{"status": "ok", "totalResults": 33, "articles": [{"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Eavesdropping crickets drop from sky to evade capture from bats - Mirage News", "description": "A sword-tailed cricket University of Bristol ...", "url": "https://www.miragenews.com/eavesdropping-crickets-drop-from-sky-to-evade-capture-from-bats/", "urlToImage": "https://www.bristol.ac.uk/media-library/sites/news/2020/may/cricket-article.jpg", "publishedAt": "2020-05-18T05:26:09Z", "content": "Researchers have uncovered the highly efficient strategy used by a group of crickets to distinguish the calls of predatory bats from the incessant noises of the nocturnal jungle. The findings, led by scientists at the Universities of Bristol and Graz in Austr… [+2565 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": "www.facebook.com/christian.n.puno", "title": "SpaceX's VisorSat will solve its satellites' over-reflectiveness - Micky News", "description": "When SpaceX launched its Starlink satellites, astronomers and scientists had a dilemma. These satellites reflect too much brightness.", "url": "https://micky.com.au/spacexs-visorsat-will-solve-its-satellites-over-reflectiveness/", "urlToImage": "https://micky.com.au/wp-content/uploads/2020/05/shutterstock_593690255-1.jpg", "publishedAt": "2020-05-18T04:49:05Z", "content": "The brightness that the satellites emit hampers with the astronomers space observations. They always run the possibility of mistaking this brightness for a constellation. Not only that, but it also lights up the evening sky. It might even rival the reflection… [+2613 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "US successfully launches unmanned reusable drone for space experiments - The Jakarta Post - Jakarta Post", "description": "The US Air Force on Sunday successfully launched its high-tech  drone X-37B, placing the reusable vehicle into orbit for its sixth secretive mission in space.", "url": "https://www.thejakartapost.com/life/2020/05/18/us-successfully-launches-unmanned-reusable-drone-for-space-experiments.html", "urlToImage": "https://img.jakpost.net/c/2020/05/18/2020_05_18_95504_1589773798._large.jpg", "publishedAt": "2020-05-18T04:04:00Z", "content": "The US Air Force on Sunday successfully launched its high-tech  drone X-37B, placing the reusable vehicle into orbit for its sixth secretive mission in space.\r\nThe drone, which resembles a smaller version of the manned space shuttles retired by the US space p… [+1759 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Edmund DeMarche", "title": "Evidence suggests sun entering ‘solar minimum’ stage: reports - Fox News", "description": "There have been 100 days since there were any recorded sunspots, which one expert says is evidence that we are entering a phase called solar minimum, reports said.", "url": "https://www.foxnews.com/science/evidence-suggests-sun-entering-solar-minimum-stage-reports", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/05/solar-activity2.en_.jpg", "publishedAt": "2020-05-18T03:57:16Z", "content": "There have been 100 days since there were any recorded sunspots, which one expert says is evidence that we are entering a phase called solar minimum, reports said.\r\nThere have been whispers on social media about an impending Ice Age (Just What We Need!), but … [+2027 chars]"}, {"source": {"id": null, "name": "Happymag.tv"}, "author": "Emily Elvish", "title": "Remember when an astronaut accidentally called 911 from the International Space Station? - Happy Mag", "description": "Dutch astronaut André Kuipers accidentally dialled 911 when attempting to call back home. It wasn't a butt dial, but NASA still weren't overly impressed.", "url": "https://happymag.tv/remember-when-an-astronaut-accidentally-called-911-from-the-international-space-station/", "urlToImage": "https://happymag.tv/wp-content/uploads/2020/05/nasa.jpg", "publishedAt": "2020-05-18T03:53:35Z", "content": "When attempting to place a simple call back home, back in 2019 Dutch astronaut André Kuipers made a cosmic but very relatable error.\r\nTo make calls from the International Space Station, astronauts have to punch in 9, followed by 011 to connect them to an inte… [+1318 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/sian-johnson/9938166", "title": "Fossilised bones of rare 'delicate' dinosaur elaphrosaur identified in a first of its kind in Australia - ABC Science Online", "description": "A dinosaur that roamed Australia about 110 million years ago has been identified thanks to a volunteer's lucky find amid a 'jumble' of bones.", "url": "https://www.abc.net.au/news/2020-05-18/rare-delicate-dinosaur-first-of-its-kind-found-in-australia/12258868", "urlToImage": "https://www.abc.net.au/cm/rimage/12258932-16x9-large.jpg?v=2", "publishedAt": "2020-05-18T02:02:00Z", "content": "A 'delicately built' dinosaur that roamed Australia when it was part of Antarctica has been identified thanks to a volunteer's lucky find amid a 'jumble' of other fossilised bones.\r\nSwinburne University palaeontologist Stephen Poropat led a research team that… [+3443 chars]"}, {"source": {"id": null, "name": "Happymag.tv"}, "author": "Emily Elvish", "title": "This bird went extinct 100,000 years ago and evolved itself back into existence - Happy Mag", "description": "Surprise bitches, I'm back. In the biggest flex known to animal-kind, this unassuming bird has evolved itself into existence twice since being pronounced extinct 136,000 years ago.", "url": "https://happymag.tv/this-bird-went-extinct-100000-years-ago-and-evolved-itself-back-into-existence/", "urlToImage": "https://happymag.tv/wp-content/uploads/2020/05/bird.jpg", "publishedAt": "2020-05-18T01:10:11Z", "content": "In the matrix glitch of the millennium, this flightless brown bird has re-incarnated itself after being declared extinct over 100,000 years ago.\r\nThe Aldabra white-throated rail was reportedly wiped out by rising sea levels a very long time ago, however, has … [+1462 chars]"}, {"source": {"id": null, "name": "Digitaltrends.com"}, "author": "Georgina Torbet", "title": "How NASA is building a new breed of spacesuit for the first expedition to Mars - Digital Trends", "description": "Designing space suits for astronauts visiting Mars is a drastically different thing than designing suits for the Moon. We spoke to NASA to find out why.", "url": "https://www.digitaltrends.com/features/spacesuit-design-mars-astronauts/", "urlToImage": "https://icdn5.digitaltrends.com/image/digitaltrends/artemis-nasa-suit-1200x630-c-ar1.91.jpg", "publishedAt": "2020-05-18T00:33:57Z", "content": "In humanity’s quest to explore Mars, getting there is only half of the battle. To keep astronauts safe while they explore the planet, we’ll need sophisticated habitats, life support systems, and communications. We’ll also need a new type of spacesuit.\r\nTo und… [+12978 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "CDC says no evidence that virus that causes COVID-19 can be spread to people through pool water - First Coast News", "description": "\"If the pool is properly chlorinated or brominated then there should be no risk for COVID transmission from the pool itself,” Dr. Caro said.", "url": "https://www.youtube.com/watch?v=Enz6-RIop9A", "urlToImage": "https://i.ytimg.com/vi/Enz6-RIop9A/hqdefault.jpg", "publishedAt": "2020-05-17T23:29:29Z", "content": null}, {"source": {"id": null, "name": "Thrillist.com"}, "author": "Dustin Nelson", "title": "NASA Just Shared a Stunning New Image of Jupiter - Thrillist", "description": "Like a painting...", "url": "https://www.thrillist.com/news/nation/nasa-jupiter-photo-juno-may-2020", "urlToImage": "https://assets3.thrillist.com/v1/image/2872593/1200x600/scale;", "publishedAt": "2020-05-17T23:17:11Z", "content": "The Juno mission to Jupiter has produced images that may become the most iconic shots of our solar system's largest planet, in addition to incredibly valuable science. Some of the most memorable photos so far have shown us the gas giant's swirling, inky atmos… [+693 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Laser-Powered Rover Will Explore the Moon’s Dark Shadows - SciTechDaily", "description": "A laser light shone through the dark could power robotic exploration of the most tantalizing locations in our Solar System: the permanently-shadowed craters around the Moon’s poles, believed to be rich in water ice and other valuable materials. ESA’s Discover…", "url": "https://scitechdaily.com/laser-powered-rover-will-explore-the-moons-dark-shadows/", "urlToImage": "https://scitechdaily.com/images/RAT-Rover-by-Night.jpg", "publishedAt": "2020-05-17T21:08:21Z", "content": "ESA’s light-studded Rover Autonomy Testbed seen during night testing in Tenerife, intended to simulate the low light environment of the lunar poles. Credit: Fernando Gandía/GMV\r\nA laser light shone through the dark could power robotic exploration of the most … [+4781 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "42 days of infection? When coronavirus won't go away - ABC News", "description": "You probably think that coronavirus is a disease that takes 14 days to get over. That's how long isolation periods last. But for some people, coronavirus is a slow burn, making them sick - sometimes critically - and keeping them infectious for weeks. For exam…", "url": "https://www.abc.net.au/radio/programs/coronacast/42-days-of-infection-when-coronavirus-wont-go-away/12257548", "urlToImage": "https://www.abc.net.au/cm/rimage/12027716-16x9-large.jpg?v=4", "publishedAt": "2020-05-17T18:01:00Z", "content": "You probably think that coronavirus is a disease that takes 14 days to get over. That's how long isolation periods last.\r\nBut for some people, coronavirus is a slow burn, making them sick - sometimes critically - and keeping them infectious for weeks.\r\nFor ex… [+704 chars]"}, {"source": {"id": null, "name": "Itnews.com.au"}, "author": null, "title": "'Star Trek, not Star Wars:' NASA releases basic principles for moon exploration pact - iTnews", "description": "How humans will live and work on the moon among pact for moon exploration.", "url": "https://www.itnews.com.au/news/star-trek-not-star-wars-nasa-releases-basic-principles-for-moon-exploration-pact-548207", "urlToImage": "https://i.nextmedia.com.au/News/2020-05-16T035054Z_1_LYNXMPEG4F05L_RTROPTP_4_SPACE-EXPLORATION-ARTEMIS.JPG", "publishedAt": "2020-05-17T14:47:00Z", "content": "NASA on Friday set the stage for a global debate over the basic principles governing how humans will live and work on the moon, as it released the main tenets of an international pact for moon exploration called the Artemis Accords.\r\nThe accords seek to estab… [+4269 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Khaleda Rahman", "title": "Antiviral Mask to Kill Coronavirus on Contact in Development by Researchers - Newsweek", "description": "The team at the University of Kentucky is hoping to create a membrane mask that would \"capture and deactivate\" SARS-CoV-2, the virus that causes COVID-19.", "url": "https://www.newsweek.com/antiviral-mask-kill-coronavirus-development-1504622", "urlToImage": "https://d.newsweek.com/en/full/1590915/dibakar-bhattacharyya.png", "publishedAt": "2020-05-17T12:31:09Z", "content": "Researchers at the University of Kentucky are working on developing a face mask that could kill the coronavirus on contact.\r\nDibakar Bhattacharyya, a chemical engineering professor who is the director of the university's Center of Membrane Sciences, recently … [+2482 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Why The Moon Was Lost 900 Years Ago - Somag News", "description": "In an article dating from 1110, it was stated that the Moon disappeared from the sky. The researchers finally found an explanation of why this event might have happened. According to the notes of an anonymous British historian, 1110 was a year full of disaste…", "url": "https://www.somagnews.com/moon-lost-900-years-ago/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2020/05/8-18-e1589713852672.jpg", "publishedAt": "2020-05-17T11:11:00Z", "content": "In an article dating from 1110, it was stated that the Moon disappeared from the sky. The researchers finally found an explanation of why this event might have happened.\r\nAccording to the notes of an anonymous British historian, 1110 was a year full of disast… [+2106 chars]"}, {"source": {"id": null, "name": "China.org.cn"}, "author": "李潇", "title": "China's Chang'e-4 probe survives 500 Earth days on moon's far side - China.org.cn", "description": null, "url": "http://www.china.org.cn/china/2020-05/17/content_76055050.htm", "urlToImage": null, "publishedAt": "2020-05-17T09:15:25Z", "content": "China's Chang'e-4 probe has survived 500 Earth days on the far side of the moon while conducting a scientific exploration of the virgin territory.\r\nThe lander and rover of the Chang'e-4 probe have resumed work for the 18th lunar day on the far side of the moo… [+2165 chars]"}, {"source": {"id": null, "name": "Webbyfeed.com"}, "author": "Carrie J. Bronstein", "title": "Astronomers get to the bottom of the mysterious pulsating stars - Webby Feed", "description": "Scientists have not been able to get to the bottom of a very specific issue for a long time: the rhythmic pulsations related to a certain category of stars. However,...", "url": "https://www.webbyfeed.com/astronomers-get-to-the-bottom-of-the-mysterious-pulsating-stars/8569/", "urlToImage": "https://www.webbyfeed.com/wp-content/uploads/2020/05/Astronomers-get-to-the-bottom-of-the-mysterious-pulsating-stars-1024x576.png", "publishedAt": "2020-05-17T08:23:41Z", "content": "Scientists have not been able to get to the bottom of a very specific issue for a long time: the rhythmic pulsations related to a certain category of stars. However, for the first time in history, they can now ignore the cosmic background noise and actually l… [+1585 chars]"}, {"source": {"id": null, "name": "Newslanded.com"}, "author": null, "title": "Single-atom transistors may revolutionize Quantum Computing - News Landed", "description": "The embedded phosphorus atoms created the foundation for a series of highly stable single-atom or a cluster of atoms transistors.", "url": "https://newslanded.com/2020/05/17/single-atom-transistors-may-revolutionize-quantum-computing/", "urlToImage": "https://newslanded.b-cdn.net/wp-content/uploads/2020/05/Single-Atom-Transistor-1.jpg", "publishedAt": "2020-05-17T07:07:37Z", "content": "Transistors consisting of single atoms or several-atom clusters may lay the framework for future quantum computing and offer unparalleled memory and processing power.\r\nResearchers at the National Institute of Standards and Technology (NIST) and their colleagu… [+3400 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "Traces of solar system’s oldest molecular fluid found in meteorite - Tech Explorist", "description": "The oldest molecular fluids in the solar system could have supported the rapid formation and evolution of the building blocks of life.", "url": "https://www.techexplorist.com/traces-solar-system-oldest-molecular-fluid-found-meteorite/32311/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/05/aminoacid.jpg", "publishedAt": "2020-05-17T06:29:37Z", "content": "The Tagish Lake meteorite is a unique piece of the asteroid belt. It is a highly brecciated ungrouped carbonaceous (C2) chondrite with minimal terrestrial alteration following retrieval of the main mass within days.\r\nDue to the pristine nature and recovery of… [+2446 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Melting glaciers cool Southern Ocean - Mirage News", "description": "Research suggests glacial melting might explain the recent decadal cooling and sea ice expansion across Antarctica's Southern Ocean. ...", "url": "https://www.miragenews.com/melting-glaciers-cool-southern-ocean/", "urlToImage": "https://news.mit.edu/sites/mit.edu.newsoffice/files/styles/news_article_image_top_slideshow/public/images/NSIDCimages__SPclouds.2158.jpg?itok=jsJrBFcA", "publishedAt": "2020-05-17T04:06:34Z", "content": "Research suggests glacial melting might explain the recent decadal cooling and sea ice expansion across Antarctica’s Southern Ocean.\r\nMIT scientists suggest sea ice extent in the Southern Ocean may increase with glacial melting in Antarctica. This image shows… [+5682 chars]"}, {"source": {"id": null, "name": "Spaceflightnow.com"}, "author": null, "title": "Crew Dragon capsule meets Falcon 9 rocket inside launch pad hangar - Spaceflight Now", "description": null, "url": "https://spaceflightnow.com/2020/05/16/crew-dragon-capsule-meets-falcon-9-rocket-inside-launch-pad-hangar/", "urlToImage": null, "publishedAt": "2020-05-17T03:16:41Z", "content": "Artist’s illustration of SpaceX’s Crew Dragon spacecraft. Credit: SpaceX\r\nSpaceX transferred the first astronaut-ready Crew Dragon spacecraft Friday night from a fueling facility at Cape Canaveral Air Force Station to pad 39A at NASAs Kennedy Space Center, wh… [+5795 chars]"}, {"source": {"id": null, "name": "Volcanodiscovery.com"}, "author": null, "title": "Volcanoes Today - summary of volcanic activity world-wide - VolcanoDiscovery", "description": "Volcanoes Today - summary of volcanic activity world-wide", "url": "https://www.volcanodiscovery.com/volcanoes/today.html", "urlToImage": null, "publishedAt": "2020-05-17T01:02:29Z", "content": "Volcanoes Today, 17 May 2020: Popocatépetl volcano, Semeru, Dukono, Sakurajima, Sabancaya\r\nSunday May 17, 2020 05:00 AM | BY: VN\r\nSatellite image of Semeru volcano on 17 May 2020\r\nSakurajima (Kyushu, Japan): Volcanic Ash Advisory Center Tokyo (VAAC) issued th… [+1369 chars]"}, {"source": {"id": null, "name": "Orlandosentinel.com"}, "author": "Richard Tribou", "title": "Weather pushes ULA’s Space Force mission to Sunday, shuffles SpaceX launch to Monday - Orlando Sentinel", "description": "Bad weather on Saturday created a rocket domino effect that will now see United Launch Alliance try to send the U.S. Space Force’s experimental mini space shuttle back into orbit on Sunday while a planned SpaceX launch of its Starlink satellites shifted to Mo…", "url": "https://www.orlandosentinel.com/space/os-bz-ula-space-force-x37b-preview-spacex-delay-20200516-execybncmzd5vkeyq5chwqfawe-story.html", "urlToImage": "https://www.orlandosentinel.com/resizer/shutnUKf79lR7QX-oD82tJnf-eY=/1200x0/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/6ROH3R6ABZB2TODBSUKDVRXW4U.jpeg", "publishedAt": "2020-05-16T20:09:58Z", "content": null}, {"source": {"id": null, "name": "Anewspost.com"}, "author": "Mark Horowitz", "title": "\"Incredibly Rare, One-In-A-Million\" Super Earth Discovered By Scientists - Anonymous News", "description": "Researchers have discovered an incredibly rare “super earth” that could potentially hold the conditions to sustain human life. The planet was discovered by New Zealand astronomers who say that the planet “is one of only a handful that have been discovered wit…", "url": "https://anewspost.com/incredibly-rare-one-in-a-million-super-earth-discovered-by-scientists/", "urlToImage": "https://anewspost.com/wp-content/uploads/2020/05/earth_00011-1000x600.jpg", "publishedAt": "2020-05-16T19:08:54Z", "content": "Researchers have discovered an incredibly rare “super earth” that could potentially hold the conditions to sustain human life. The planet was discovered by New Zealand astronomers who say that the planet “is one of only a handful that have been discovered wit… [+2745 chars]"}, {"source": {"id": null, "name": "Jordantimes.com"}, "author": null, "title": "Making tracks: ancient footprints shed light on early humans - Jordan Times", "description": "TOKYO — Thousands of years ago, a group of people took a walk in what is now Tanzania. The footprints they left behind are now offering insights into ancient human life.The group of more than 400 footprints was made sometime between 5,000 and 19,000 years ago…", "url": "http://jordantimes.com/news/features/making-tracks-ancient-footprints-shed-light-early-humans", "urlToImage": null, "publishedAt": "2020-05-16T18:14:20Z", "content": "TOKYO Thousands of years ago, a group of people took a walk in what is now Tanzania. The footprints they left behind are now offering insights into ancient human life.\r\nThe group of more than 400 footprints was made sometime between 5,000 and 19,000 years ago… [+3787 chars]"}, {"source": {"id": null, "name": "China.org.cn"}, "author": "", "title": "Salad could one day be grown on another planet: study - China.org.cn", "description": null, "url": "http://www.china.org.cn/world/Off_the_Wire/2020-05/17/content_76053429.htm", "urlToImage": null, "publishedAt": "2020-05-16T17:45:26Z", "content": "LONDON, May 16 (Xinhua) -- An experiment which saw salad seeds sent into space has given hope for the future of growing food on another planet, according to a recently-published study.\r\nThe findings have emerged after 2 kg of seeds spent six months on board t… [+2120 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "The Cosmic Companion", "title": "Can dark matter be found on earth? New research says 'maybe' - The Next Web", "description": "Dark matter may not give off any light or radiation, but we might be able to watch it smash into atoms here on Earth.\r\nDark matter makes up 85% of all matter in the Universe, but astronomers ...", "url": "https://thenextweb.com/syndication/2020/05/16/can-dark-matter-be-found-on-earth-new-research-says-maybe/", "urlToImage": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2020%2F05%2F1-17.jpg&signature=f4e819768f842b00adfc58ee9ea11d1e", "publishedAt": "2020-05-16T12:04:36Z", "content": "Dark matter may not give off any light or radiation, but we might be able to watch it smash into atoms here on Earth.\r\nDark matter makes up 85% of all matter in the Universe, but astronomers have never seen it. The nature of this mysterious something remains … [+7372 chars]"}, {"source": {"id": null, "name": "Interestingengineering.com"}, "author": "Loukia Papadopoulos", "title": "New Study Reaffirms Sea-Level Rise Is Linked to Human Activities, Not Changes in Earth's Orbit - Interesting Engineering", "description": "The research is a worrisome reminder that it is in our hands to save our planet.", "url": "https://interestingengineering.com/new-study-reaffirms-sea-level-rise-is-linked-to-human-activities-not-changes-in-earths-orbit", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/LBGR872nw2/sizes/sea-level-rises_md.jpg", "publishedAt": "2020-05-16T09:18:11Z", "content": "Rutgers scientists have produced new research that reaffirms that modern sea-level rises are linked to human activities and not to changes in Earth's orbit.\r\nRELATED: SCIENTISTS PROPOSE RADICAL GLACIER ENGINEERING PROJECTS AS WAY TO STOP SEA LEVEL RISE\r\n\"Our … [+1670 chars]"}, {"source": {"id": null, "name": "Sciencefocus.com"}, "author": "James Lloyd", "title": "'Virgin birth’ gene identified in honeybees - sciencefocus.com", "description": "The Cape bee develops this ability once the colony’s queen bee dies.", "url": "https://www.sciencefocus.com/nature/virgin-birth-gene-identified-in-honeybees/", "urlToImage": "https://images.immediate.co.uk/production/volatile/sites/4/2020/05/231218-adbe472.jpg?quality=90&resize=960,413", "publishedAt": "2020-05-16T07:00:00Z", "content": "It sounds like a miracle: a honeybee thats able to reproduce through virgin birth. But scientists have pinned down the gene thats responsible for the Cape bees unique ability.\r\nThe Cape bee is a subspecies of honeybee thats native only to the southern tip of … [+2654 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Alexander Lewis Peace, The Conversation", "title": "How Earth's Last Supercontinent Split Apart to Create The World We See Today - ScienceAlert", "description": "Pangaea was the Earth's latest supercontinent – a vast amalgamation of all the major landmasses.", "url": "https://www.sciencealert.com/our-continents-took-shape-thanks-to-a-legacy-of-scars-left-on-our-planet-s-surface", "urlToImage": "https://www.sciencealert.com/images/2020-05/processed/pangaea_map_1024.jpg", "publishedAt": "2020-05-16T06:38:51Z", "content": "Pangaea was the Earth's latest supercontinent a vast amalgamation of all the major landmasses.\r\nBefore Pangaea began to disintegrate, what we know today as Nova Scotia was attached to what seems like an unlikely neighbour: Morocco. Newfoundland was attached t… [+5318 chars]"}, {"source": {"id": null, "name": "Gizmoposts24.com"}, "author": "Nilesh Goswami", "title": "Asteroid 1998 OR2 to whoosh past Earth after 100 years? Is it dangerous? Read on to find out!!! - Gizmo Posts 24", "description": "Asteroid 1998 OR2 will fly in the near-Earth space after 100 years. It is being said that there's an asteroid closing in on a safe Earth flyby which is nothing unusual. However, the 1998 OR2, which was first discovered in 1998, is a bit different. The Virtual…", "url": "https://gizmoposts24.com/technology/asteroid-1998-or2-to-whoosh-past-earth-after-100-years-is-it-dangerous-read-on-to-find-out-62694/", "urlToImage": "https://gizmoposts24.com/wp-content/uploads/2020/04/asteroid.jpg", "publishedAt": "2020-04-23T17:18:38Z", "content": "Asteroid 1998 OR2 will fly in the near-Earth space after 100 years.\r\nIt is being said that there’s an asteroid closing in on a safe Earth flyby which is nothing unusual. However, the 1998 OR2, which was first discovered in 1998, is a bit different. The Virtua… [+1427 chars]"}, {"source": {"id": null, "name": "Kxan36news.com"}, "author": null, "title": "SpaceX launched a rocket with 60 satellites Starlink - The KXAN 36 News", "description": null, "url": "http://www.kxan36news.com/spacex-launched-a-rocket-with-60-satellites-starlink", "urlToImage": null, "publishedAt": "2020-04-22T21:35:44Z", "content": "Booster Falcon 9 SpaceX the American company with the seventh group of microsatellites Starlink started on Wednesday from the spaceport at Cape Canaveral at 15:30 East coast time USA (22:30 GMT). Stream start is on the website of the company.\r\nThe Starlink ne… [+847 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Jamie Ross", "title": "Trailblazing NASA Mathematician Katherine Johnson Dies at 101 - The Daily Beast", "description": "Johnson calculated the trajectory of man’s first trip to the moon, and her work remains vital to human spaceflight today.", "url": "https://www.thedailybeast.com/katherine-johnson-nasa-trailblazer-and-hidden-figures-mathematician-inspiration-dies-at-the-age-of-101", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2916,w_5184,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1582557258/RTX1VP9Z_h1oaky", "publishedAt": "2020-02-24T15:24:21Z", "content": "The legendary NASA mathematician Katherine Johnson died Monday at the age of 101, the U.S. space agency has announced. Johnson developed mathematical equations that were essential to NASAs early efforts to send astronauts into space and then to the moonand th… [+828 chars]"}]}