{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "Sciencealert.com"}, "author": "Michelle Starr", "title": "Astronomers Have Found a Star That Survived Being Swallowed by a Black Hole - ScienceAlert", "description": "When black holes swallow down massive amounts of matter from the space around them, they're not exactly subtle about it. They belch out tremendous flares of X-rays, generated by the material heating to intense temperatures as it's sucked towards the", "url": "https://www.sciencealert.com/this-black-hole-s-weirdly-regular-feeding-schedule-is-because-it-s-snacking-on-a-star", "urlToImage": "https://www.sciencealert.com/images/2020-04/black-hole-monch_1024.gif", "publishedAt": "2020-04-27T07:23:59Z", "content": "When black holes swallow down massive amounts of matter from the space around them, they're not exactly subtle about it. They belch out tremendous flares of X-rays, generated by the material heating to intense temperatures as it's sucked towards the black hol… [+4329 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Poor Amazonians go hungry despite living in one of the most biodiverse places on Earth - Phys.org", "description": "Poorer rural Amazonians are going hungry despite living in one of the most biodiverse areas on the planet—a new study reveals.", "url": "https://phys.org/news/2020-04-poor-amazonians-hungry-biodiverse-earth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/pooramazonia.jpg", "publishedAt": "2020-04-27T07:11:14Z", "content": "Poorer rural Amazonians are going hungry despite living in one of the most biodiverse areas on the planeta new study reveals.\r\nMassive seasonal floods mean many ribeirinhos, a marginalised social group who live alongside rivers in Brazil's Amazonian floodplai… [+5379 chars]"}, {"source": {"id": null, "name": "Ibtimes.sg"}, "author": "https://www.ibtimes.sg/reporters/carlo-inigo-monzon", "title": "Eta Aquariids meteor shower from debris of Halley's Comet to peak next week - International Business Times, Singapore Edition", "description": "The meteor shower caused by the Halley's Comet will reach its peak next week and produce at least 20 meteors per hour", "url": "https://www.ibtimes.sg/eta-aquariids-meteor-shower-debris-halleys-comet-peak-next-week-43878", "urlToImage": "https://data.ibtimes.sg/en/full/15167/halleys.jpg", "publishedAt": "2020-04-27T06:52:57Z", "content": "The Eta Aquariids meteor shower, which comes from the debris of the famous Halley's Comet, is expected to reach its peak next week. According to expert, at least 20 to 30 meteors per hour will be visible during the shower's peak. The Eta Aquariids meteor show… [+2263 chars]"}, {"source": {"id": null, "name": "Techtimes.com"}, "author": "Giuliano J. de Leon", "title": "[VIDEO] Scientists Capture Unique Gravitational Signal; Further Proof That Einstein Was Correct - Tech Times", "description": "A unique gravitational signal was recently discovered by scientists, and the result shows that Einstein's theory of relativity is correct!", "url": "https://www.techtimes.com/articles/249159/20200427/video-scientists-captured-the-most-unique-gravitational-signal-another-proof-that-einstein-is-correct.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/365013/scientists-discovered-a-unique-gravitational-signal-that-proves-einsteins-theory-what-makes-this-different-from-other-gravity-signals.jpg", "publishedAt": "2020-04-27T06:39:53Z", "content": "Scientistshave discovered a unique gravitational signal and, from it, created a visual presentation to explain further that Einstein's theory of relativity is once again correct.\r\nAccording to Earth Sky's latest report, the scientists who conducted the study … [+3046 chars]"}, {"source": {"id": null, "name": "Esquireme.com"}, "author": "Thomas Shambler", "title": "NASA built a COVID-19 ventilator in just 37 days - EsquireMe", "description": "The ventilator has been fast-tracked for use in the US", "url": "https://www.esquireme.com/content/45692-nasa-built-a-covid-19-ventilator-in-just-37-days", "urlToImage": "https://www.esquireme.com/s3/files/styles/fb_share_style_image/public/images/2020/04/27/NASA-ventilator.jpg?itok=fMmdrHhD", "publishedAt": "2020-04-27T06:22:59Z", "content": "We know how to land on the moon and Mars, but building a medical device is new, quipped NASA, as it unveiled a ventilator designed to help coronavirus patients.\r\nThe new system dubbed VITAL Ventilator Intervention Technology Accessible Locally was created in … [+1209 chars]"}, {"source": {"id": null, "name": "Sciencetimes.com"}, "author": "Staff Reporter", "title": "Emirate-Built Mars Explorer Sent to a Far Away Japanese Island for Its Final Preparation Ahead of Its July Lau - Science Times", "description": "UAE's Hope probe that is set to orbit Mars has arrived at its launch site in Japan ahead of its scheduled lift-off in July.", "url": "https://www.sciencetimes.com/articles/25471/20200427/emirate-built-mars-explorer-sent-far-away-japanese-island-final-launch.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/27200/emirate-built-mars-explorer-delivered-to-a-far-away-japanese-island-for-its-final-preparation-ahead-of-its-july-launch.jpg", "publishedAt": "2020-04-27T05:15:46Z", "content": null}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Engineers develop precision injection system for plants - Mirage News", "description": "Microneedles made of silk-based material can target plant tissues for delivery of micronutrients, hormones, or genes. ...", "url": "https://www.miragenews.com/engineers-develop-precision-injection-system-for-plants/", "urlToImage": "https://news.mit.edu/sites/mit.edu.newsoffice/files/styles/news_article_image_top_slideshow/public/images/2020/MIT-Plant-Injections-01_0.jpg?itok=10URlSKQ", "publishedAt": "2020-04-27T04:02:09Z", "content": "Microneedles made of silk-based material can target plant tissues for delivery of micronutrients, hormones, or genes.\r\nA microinjection device (red) is attached to a citrus tree, providing a way of injecting pesticide or other materials directly into the plan… [+6702 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jon Fingas", "title": "USGS releases first complete geologic map of the Moon - Yahoo Finance Australia", "description": "The USGS has made it easy to study the Moon's surface by releasing the first comprehensive geologic map of the lunar landscape.", "url": "https://au.finance.yahoo.com/news/usgs-first-geologic-map-of-moon-031051774.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/r3PLBmtEwsnFCsUiBQko3g--~B/aD03OTc7dz0xNjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-04/3e73ab00-8815-11ea-966e-c78fe3a481e5", "publishedAt": "2020-04-27T03:20:33Z", "content": "Have you ever wanted to study the Moons surface in exacting detail? Nows your chance. The USGS (with help from NASA and the Lunar Planetary Institute) has released the first complete geologic map of the Moon, providing a truly comprehensive look at our neares… [+935 chars]"}, {"source": {"id": null, "name": "Ancient-origins.net"}, "author": "ancient-origins", "title": "Four Discoveries of Ancient Greek Astronomy That Still Baffle Experts - Ancient Origins", "description": "The Histories by Herodotus (484BC to 425BC) offers a remarkable window into the world as it was known by ancient Greek astronomy in the mid fifth century BC.", "url": "https://www.ancient-origins.net/news-history-archaeology/ancient-greek-astronomy-0013626", "urlToImage": "https://www.ancient-origins.net/sites/default/files/field/image/Ancient-Greek-astronomy.jpg", "publishedAt": "2020-04-27T03:20:08Z", "content": "The Histories by Herodotus (484BC to 425BC) offers a remarkable window into the world as it was known by ancient Greek astronomy in the mid fifth century BC. Almost as interesting as what they knew, however, is what they did not know. This sets the baseline f… [+7672 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "SpaceX is already preparing for operational astronaut missions - India Gone Viral", "description": "While the world’s attention is focused on the return of orbital human spaceflight from US soil after a nearly decade long absence with the upcoming May 27th Crew Dragon Demo-2 mission, SpaceX is simul", "url": "https://indiagoneviral.com/science/2020/04/27/spacex-is-already-preparing-for-operational-astronaut-missions/43431/india-gone-viral/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2020/04/SpaceX-Second-Stage-Merlin-MVac.jpg", "publishedAt": "2020-04-27T02:00:56Z", "content": "While the worlds attention is focused on the return of orbital human spaceflight from US soil after a nearly decade long absence with the upcoming May 27th Crew Dragon Demo-2 mission, SpaceX is simultaneously preparing for the first Crew Dragon operational mi… [+4182 chars]"}, {"source": {"id": null, "name": "Unite.ai"}, "author": "Alex McFarland", "title": "Brain-Computer Interface Technology Restores Sensation to Hand of Individual with Spinal Cord Injury - Unite.AI", "description": "A team of researchers at Battelle and the Ohio State University Wexner Medical Center report that through the use of Brain-Computer Interface technology, they successfully restored sensation to the hand of an individual with a severe spinal cord injury. This …", "url": "https://www.unite.ai/brain-computer-interface-technology-restores-sensation-to-hand-of-individual-with-spinal-cord-injury/", "urlToImage": "https://www.unite.ai/wp-content/uploads/2020/04/artificial-intelligence-4694502_1280-1000x600.jpg", "publishedAt": "2020-04-27T01:49:52Z", "content": "New research coming out of Carnegie Mellon University (CMU) and the University of Pittsburgh (Pitt) will drastically improve and stabilize brain-computer interfaces. \r\nThe research was published in Nature Biomedical Engineering, with the paper being titled A … [+3916 chars]"}, {"source": {"id": null, "name": "Ntd.com"}, "author": null, "title": "Astronomers Find ‘Alien’ Asteroids Living in Our Solar System - NTD", "description": "Scientists In the last few years have studied the first observed interstellar visitors to our solar system. They ...", "url": "https://www.ntd.com/astronomers-find-alien-asteroids-living-in-our-solar-system_459760.html", "urlToImage": "https://www.ntd.com/assets/uploads/2020/04/hypatia-h_c366e18130b318283e4732b33f9821f1-h_1edcc504575c2ddfdae277afd8d3b3ea.jpg", "publishedAt": "2020-04-27T01:28:55Z", "content": "Scientists In the last few years have studied the first observed interstellar visitors to our solar system. They include a comet called 2I/Borisov, spotted in 2019 and still passing through, and an asteroid named ‘Oumuamua that zipped through quickly in 2017.… [+4427 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Josephine Harvey", "title": "Scientists Note Asteroid Approaching Earth Looks Like It’s Wearing A Face Mask - HuffPost", "description": "1998 OR2 appears to know the planet is facing the coronavirus pandemic, researchers joked.", "url": "https://www.huffpost.com/entry/asteroid-face-mask_n_5ea60b5ac5b6805f9ecf4add", "urlToImage": "https://img.huffingtonpost.com/asset/5ea617a0220000570b827ab8.jpeg?cache=GpKveYkjpn&ops=1200_630", "publishedAt": "2020-04-27T01:23:49Z", "content": "Scientists are joking that even an asteroid set to pass by Earth is exercising caution as the planet tackles the coronavirus pandemic.\r\nThe 1998 OR2 asteroid poses no risk to the Earth, but its appearance makes it look as though it were aware of the risks on … [+1689 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Alyse Stanley", "title": "If The Ancient Romans Could Recycle, Then So Can You - Gizmodo Australia", "description": "A team of researchers at Pompeii recently discovered evidence that Romans were avid recyclers, according to a weekend Guardian report. It figures that the same society that brought us urban planning, indoor heating, and concrete was also ahead of its time wit…", "url": "https://www.gizmodo.com.au/2020/04/if-the-ancient-romans-could-recycle-then-so-can-you/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/glckkwhmdckdyhqsgybr.jpg", "publishedAt": "2020-04-26T23:02:00Z", "content": "A team of researchers at Pompeii recently discovered evidence that Romans were avid recyclers, according to a weekend Guardian report. It figures that the same society that brought us urban planning, indoor heating, and concrete was also ahead of its time wit… [+2939 chars]"}, {"source": {"id": null, "name": "Eurasiareview.com"}, "author": "https://www.eurasiareview.com/author/admin/", "title": "New Study Finds Connection Between Fault Roughness And Magnitude Of Earthquakes - Eurasia Review", "description": "A new study led by McGill University has found that tectonic plates beneath the Earth’s surface can show varying degrees of roughness and could help explain why certain earthquakes are stronger tha…", "url": "https://www.eurasiareview.com/27042020-new-study-finds-connection-between-fault-roughness-and-magnitude-of-earthquakes/", "urlToImage": "https://i0.wp.com/www.eurasiareview.com/wp-content/uploads/2016/07/web-30.jpg?fit=825%2C510&ssl=1", "publishedAt": "2020-04-26T23:02:00Z", "content": "A new study led by McGill University has found that tectonic plates beneath the Earths surface can show varying degrees of roughness and could help explain why certain earthquakes are stronger than others.\r\nEarthquakes happen when the rocks beneath the Earths… [+2289 chars]"}, {"source": {"id": null, "name": "Newslanded.com"}, "author": null, "title": "Scientists discover why Venus’ atmosphere behaves so strangely - News Landed", "description": "Horinouchi and his team were able to map the winds using ultraviolet imaging of Venus' clouds provided by the Japanese space probe Akatsuki.", "url": "https://newslanded.com/2020/04/26/venus-super-rotation/", "urlToImage": "https://newslanded.b-cdn.net/wp-content/uploads/2020/04/otFCeKHpqqqgKdg9WhzUR4-650-80.jpg", "publishedAt": "2020-04-26T21:45:05Z", "content": "For years scientists have wondered why Venus’ atmosphere spins so much faster than its surface. The answer, according to a recent study by a team of scientists led by Takeshi Horinouchi (Hokkaido University in Sapporo, Japan), lies in its thermal tides.\r\nAnim… [+1535 chars]"}, {"source": {"id": null, "name": "Prnewswire.com"}, "author": null, "title": "NASA Administrator Statement on Passing of Former Administrator James Beggs - PRNewswire", "description": "/PRNewswire/ -- The following is a statement from NASA Administrator Jim Bridenstine on the passing of the agency's sixth administrator, James Beggs, on April...", "url": "https://www.prnewswire.com/news-releases/nasa-administrator-statement-on-passing-of-former-administrator-james-beggs-301047269.html", "urlToImage": "https://mma.prnewswire.com/media/326469/nasa_logo.jpg?p=facebook", "publishedAt": "2020-04-26T21:40:00Z", "content": "WASHINGTON, April 26, 2020 /PRNewswire/ -- The following is a statement from NASA Administrator Jim Bridenstine on the passing of the agency's sixth administrator, James Beggs, on April 23. Mr. Beggs served as NASA administrator from July 1981 to December 198… [+1127 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "NASA Published Photo That Jupiter Looks Like Art Painting - Somag News", "description": "NASA, one of the space agencies working on space research, shared Jupiter’s photo resembling an art painting. The photo, on which a few minor plays were made, was taken by Juno, who has been orbiting the planet since 2016. NASA is observing many different pla…", "url": "https://www.somagnews.com/nasa-published-photo-jupiter-looks-like-art-painting/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2020/04/9-26-e1587931254509.jpg", "publishedAt": "2020-04-26T20:01:00Z", "content": "NASA, one of the space agencies working on space research, shared Jupiter’s photo resembling an art painting. The photo, on which a few minor plays were made, was taken by Juno, who has been orbiting the planet since 2016.\r\nNASA is observing many different pl… [+1670 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Shari Miller For Mailonline", "title": "First ever proof of meteorite killing a man uncovered in 1888 report to Ottoman sultan - Daily Mail", "description": "Documents show Ottoman Sultan Abdul Hamid II (left), was informed of a meteorite that killed one man and paralysed another after landing in Sulaymaniyah, Iraq, on August 22, 1888.", "url": "https://www.dailymail.co.uk/news/article-8258631/First-proof-meteorite-killing-man-uncovered-1888-report-Ottoman-sultan.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/04/26/17/27674526-0-image-a-2_1587919300209.jpg", "publishedAt": "2020-04-26T19:40:56Z", "content": "The first ever proof of a person being struck and killed by a meteorite might just have been discovered.\r\nResearchers at the Meteoritical Society have found evidence of a meteorite that killed one man and left another paralysed after it fell 'like rain' on a … [+2605 chars]"}, {"source": {"id": null, "name": "Denverpost.com"}, "author": "Seth Borenstein", "title": "Earth’s insect population shrinks by 27% in 30 years, according to study - The Denver Post", "description": "The world has lost more than one quarter of its land-dwelling insects in the past 30 years, according to researchers whose big picture study of global bug decline paints a disturbing but more nuanc…", "url": "https://www.denverpost.com/2020/04/26/earths-insect-population-shrinks/", "urlToImage": "https://www.denverpost.com/wp-content/uploads/2020/04/Insect_Decline_11900-2.jpg?w=1024&h=683", "publishedAt": "2020-04-26T19:15:00Z", "content": "KENSINGTON, Maryland — The world has lost more than one quarter of its land-dwelling insects in the past 30 years, according to researchers whose big picture study of global bug decline paints a disturbing but more nuanced problem than earlier research.\r\nFrom… [+3613 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nDominic Nicholls,", "title": "Ex-SAS men supply PPE after frustration at government's failure to distribute enough supplies - Telegraph.co.uk", "description": "The Pilgrim Bandits charity has supplied face masks, suits and other equipment to A&E departments, care homes and individuals in need", "url": "https://www.telegraph.co.uk/news/2020/04/26/ex-sas-men-supply-ppe-frustration-governments-failure-distribute/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2020/04/26/TELEMMGLPICT000230205425_trans_NvBQzQNjv4BqFYaFMqenqvL3x_jptXZ5MxKi2sT3vi7ux2-RDZwC4QA.jpeg?impolicy=logo-overlay", "publishedAt": "2020-04-26T19:00:00Z", "content": "He blamed government procurement rules for the slow response in providing PPE to the coronavirus frontline. \r\nChinas got a shedload of everything, with the appropriate European stamps he said, but because the Chinese want 50 per cent of the money up front and… [+1324 chars]"}, {"source": {"id": null, "name": "Cleantechnica.com"}, "author": "Steve Hanley", "title": "Starlink Private Beta Testing To Begin In 3 Months, Public Beta Testing To Follow - CleanTechnica", "description": "With 422 Starlink satellites in orbit and 120 more due to launch soon, Elon Musk says private beta testing of the network will begin in about 3 months.", "url": "https://cleantechnica.com/2020/04/26/starlink-private-beta-testing-to-begin-in-3-months-public-beta-testing-to-follow/", "urlToImage": "https://cleantechnica.com/files/2020/04/Starlink-mission.png", "publishedAt": "2020-04-26T18:48:40Z", "content": "April 26th, 2020 by Steve Hanley \r\nSpaceX has now launched 422 of its low Earth orbit Starlink satellites. 2 prototypes were sent up first in 2018, followed by 7 launches carrying 60 satellites each since then. The most recent Starlink mission took place on A… [+3913 chars]"}, {"source": {"id": null, "name": "Nationalpost.com"}, "author": null, "title": "COVID-19 can be spread by building ventilation, say Canadian researchers working on an HVAC fix - Leduc Representative", "description": "A group of Alberta researchers are working on ways that buildings could change their HVAC set-ups to curb the risk of infection", "url": "https://nationalpost.com/health/covid-19-likely-spread-by-building-ventilation-say-canadian-researchers-working-on-an-hvac-fix", "urlToImage": "https://nationalpostcom.files.wordpress.com/2020/04/health_-coronavirus_china-africans.jpg", "publishedAt": "2020-04-26T16:41:15Z", "content": "The outbreak of COVID-19 at a restaurant in the southern Chinese city of Guangzhou was a puzzle.\r\nThe suspected index patient was a visitor from the coronavirus’s epicentre in Wuhan. But the eight other customers who later tested positive were not sitting clo… [+5434 chars]"}, {"source": {"id": null, "name": "Newburytoday.co.uk"}, "author": "Geraldine Gardner", "title": "Venus and crescent Moon close together and Earthshine - Newbury Weekly News Group", "description": "Night time sky gazing", "url": "https://www.newburytoday.co.uk/news/out---about/30343/venus-and-crescent-moon-close-together-and-earthshine.html", "urlToImage": "https://www.newburytoday.co.uk/resizer/600/315/true/Earthshine-1587899261892.jpg--venus_and_crescent_moon_close_together_to_create_night_sky_spectacle.jpg?1587899263000", "publishedAt": "2020-04-26T15:10:44Z", "content": "VENUS and the Moon will be close together over to the west just after sunset, which is at 8.20pm.\r\nAs it gets darker, you should also see the Moon as a whole circle, but with one side lit up. This is known as Earthshine and is created by sunlight bouncing off… [+879 chars]"}, {"source": {"id": null, "name": "Townsvillebulletin.com.au"}, "author": null, "title": "Researcher says reefs around Magnetic Island have nearly recovered from coral bleaching - Townsville Bulletin", "description": "Subscribe to the Townsville Bulletin to get unrestricted digital access, home paper delivery, Apps for iPad and Android and much more...", "url": "https://www.townsvillebulletin.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-26T14:01:56Z", "content": null}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Neha", "title": "Tectonic plates started shifting 3.2 billion years ago: Study - The Siasat Daily", "description": "New York: The Earth's tectonic plates started moving more than 3.2 billion years ago - just over 1.3 billion years after the Earth first formed and earlier than originally thought, researchers have revealed. To date, some researchers theorised it happened aro…", "url": "https://www.siasat.com/tectonic-plates-started-shifting-3-2-billion-years-ago-study-1880018/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/03/telescopes.jpg", "publishedAt": "2020-04-26T14:00:37Z", "content": "New York: The Earth’s tectonic plates started moving more than 3.2 billion years ago – just over 1.3 billion years after the Earth first formed and earlier than originally thought, researchers have revealed.\r\nTo date, some researchers theorised it happened ar… [+3044 chars]"}, {"source": {"id": null, "name": "Thenewdaily.com.au"}, "author": null, "title": "Did a Death Star take out a planet for real? Something did - The New Daily", "description": "If you've felt a great disturbance in the Force of late, of the sort that made you stagger and press your fingertips to your temple, then fair enough. It", "url": "https://thenewdaily.com.au/life/science/2020/04/26/death-star-return-planet/", "urlToImage": "https://1v1d1e1lmiki1lgcvx32p49h8fe-wpengine.netdna-ssl.com/wp-content/uploads/2020/04/20PLANET-superJumbo-960x600.jpg", "publishedAt": "2020-04-26T13:25:19Z", "content": "If you’ve felt a great disturbance in the Force of late, of the sort that made you stagger and press your fingertips to your temple, then fair enough.\r\nIt seems the famed planet-killing Death Star from Star Wars has been at it again.\r\nWhat else can explain th… [+3273 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Christopher Wanjek", "title": "How Space Travel Tries to Kill You and Make You Ugly - WIRED", "description": "Oh also, it makes you blind and stupid, too.", "url": "https://www.wired.com/story/how-space-tries-kill-you-make-you-ugly/", "urlToImage": "https://media.wired.com/photos/5e961efdca6a5100098746f8/191:100/w_1280,c_limit/space-human-body-backchhannel.jpg", "publishedAt": "2020-04-26T11:40:53Z", "content": "Of these 34 risks, three are potential showstoppers: radiation, gravity (or lack thereof), and the need for surgery or a complicated medical procedure.\r\nLets explore the gravity issue.\r\nSome science fiction writers in the mid-20th century speculated that zero… [+3425 chars]"}, {"source": {"id": null, "name": "Wam.ae"}, "author": "WAM", "title": "Coral nursery project for Sir Bu Nair island - WAM EN", "description": "SHARJAH, 26th April, 2020 (WAM) – Sharjah’s Environment and Protected Areas Authority, EPAA, is to collaborate with the Emirates Marine Environment Group, EMEG, to establish a large-scale coral nursery off the coast of the island of Sir Bu Nair. The project, …", "url": "http://wam.ae/en/details/1395302839000", "urlToImage": "https://assets.wam.ae/uploads/2016/12/medium-WAM_en.png", "publishedAt": "2020-04-26T10:03:00Z", "content": "SHARJAH, 26th April, 2020 (WAM) Sharjahs Environment and Protected Areas Authority, EPAA, is to collaborate with the Emirates Marine Environment Group, EMEG, to establish a large-scale coral nursery off the coast of the island of Sir Bu Nair.\r\nThe project, pa… [+2307 chars]"}, {"source": {"id": null, "name": "Webbyfeed.com"}, "author": "Herbert S. Aurand", "title": "Tomanowos Meteorite Is As Old As The Earth Is - Webby Feed", "description": "The Williamette meteorite, known as the Tomanowos according to its ancient name, is believed to have arrived on the Earth directly from heaven. The 15-ton rock was found by the...", "url": "https://www.webbyfeed.com/tomanowos-meteorite-is-as-old-as-the-earth-is/8048/", "urlToImage": "https://i1.wp.com/www.webbyfeed.com/wp-content/uploads/2020/04/Tomanowos-Meteorite.jpg?fit=1356%2C668&ssl=1", "publishedAt": "2020-04-26T10:01:00Z", "content": "The Williamette meteorite, known as the Tomanowos according to its ancient name, is believed to have arrived on the Earth directly from heaven. The 15-ton rock was found by the European Americans in the vicinity of the Willamette River more than one century a… [+1605 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "How runny a liquid can be? - Tech Explorist", "description": "Viscosity (η) is the resistance of a liquid to flow. Liquids get thicker when cooled and runnier when heated, but how runny can a liquid ever get if we", "url": "https://www.techexplorist.com/runny-liquid/31826/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/04/fundamental-constants-of-Nature.jpg", "publishedAt": "2020-04-26T09:47:18Z", "content": "Viscosity () is the resistance of a liquid to flow. Liquids get thicker when cooled and runnier when heated, but how runny can a liquid ever get if we keep heating it?\r\nAt a point, the liquid reaches a specific temperature; it transitions between the liquid-l… [+3341 chars]"}, {"source": {"id": null, "name": "Bigthink.com"}, "author": "Michelle Thaller", "title": "Ask an astronomer: How do astronauts deal with isolation? - Big Think", "description": "Being stuck at home is not as intense as being away from Earth, but there are ways to cope in either scenario.", "url": "https://bigthink.com/videos/astronaut-isolation", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMzE1NjAwNy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTYzNTY0MDgxM30.CCVXusvBpywQ1LORemSLHFoFzGGc10nXJwSIs9zvuV4/img.jpg?width=1200&coordinates=0%2C47%2C0%2C47&height=600", "publishedAt": "2020-04-26T09:05:19Z", "content": "MICHELLE THALLER: When it comes to how to deal with isolation and feeling like you're sort of helpless and cut off from everybody, it's hard to beat the experience of an astronaut, where they literally are cut off from Earth. And even if they wanted to, they … [+4662 chars]"}, {"source": {"id": null, "name": "Volcanodiscovery.com"}, "author": null, "title": "Volcanoes Today - summary of volcanic activity world-wide - VolcanoDiscovery", "description": "Volcanoes Today - summary of volcanic activity world-wide", "url": "https://www.volcanodiscovery.com/volcanoes/today.html", "urlToImage": null, "publishedAt": "2020-04-26T08:59:32Z", "content": "Volcanoes Today, 26 Apr 2020: Klyuchevskoy volcano, Reventador, Sangay, Nevados de Chillán, Aso, Sabancaya, Ebeko\r\nSunday Apr 26, 2020 11:00 AM | BY: VN\r\nSatellite image of Klyuchevskoy volcano on 26 Apr 2020\r\nKlyuchevskoy (Kamchatka): Explosive activity cont… [+1647 chars]"}, {"source": {"id": null, "name": "Biophotonics.world"}, "author": null, "title": "FSU researchers discover new structure for promising class of materials - Biophotonics.World", "description": "Florida State University researchers have discovered a novel structure for organic-inorganic hybrid materials that shows potential for more efficient technologies.&nbsp;Professor of Chemistry and Biochemistry Biwu Ma and his team have published a new study in…", "url": "https://www.biophotonics.world/magazine/article/1004/fsu-researchers-discover-new-structure-for-promising-class-of-materials", "urlToImage": "https://www.biophotonics.world/ow_static/plugins/articles/img/article-default-picture.png", "publishedAt": "2020-04-26T08:51:23Z", "content": null}, {"source": {"id": null, "name": "Phonemantra.com"}, "author": "Gourav", "title": "The fourth prototype of the SpaceX Starship spaceship is ready to finally pass the test or explode too - Phone Mantra", "description": "The third prototype of the SpaceX Starship spacecraft repeated the fate of the first two, that is, it exploded.", "url": "https://phonemantra.com/the-fourth-prototype-of-the-spacex-starship-spaceship-is-ready-to-finally-pass-the-test-or-explode-too/", "urlToImage": "https://phonemantra.com/wp-content/uploads/2020/04/SpaceX-Starship.jpg", "publishedAt": "2020-04-26T08:29:00Z", "content": "The test will pass soon\r\nEarlier this month, the third prototype of the SpaceX Starship spacecraft repeated the fate of the first two, that is, it exploded. This time, the situation was due to an operator error and a poorly configured test.\r\nThe fourth protot… [+631 chars]"}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Ethelene Bailey", "title": "BepiColombo Captured a Couple of Images of the Earth, While Heading Towards Mercury - Dual Dove", "description": "The European Space Agency has recently published a series of impressive images of the Earth captured by the BepiColombo probe. The mission aiming to provide resourceful information regarding the fo…", "url": "https://www.dualdove.com/bepicolombo-captured-a-couple-of-images-of-the-earth-while-heading-towards-mercury/9742/", "urlToImage": "https://www.dualdove.com/wp-content/uploads/2020/04/bepicolombo-missions-images-of-the-earth.jpg", "publishedAt": "2020-04-26T07:52:30Z", "content": "The European Space Agency has recently published a series of impressive images of the Earth captured by the BepiColombo probe. The mission aiming to provide resourceful information regarding the formation and evolution of Mercury started in 2018.\r\nTwo years h… [+1721 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Before becoming frozen wasteland, Antarctica was home to frogs - CGTN", "description": "At the time when the little frog was hopping around and dining on insects, ice sheets were already forming in the highlands within the interior of Antarctica.", "url": "https://news.cgtn.com/news/2020-04-26/Before-becoming-frozen-wasteland-Antarctica-was-home-to-frogs-Q0eMPNz0I0/index.html", "urlToImage": "https://news.cgtn.com/news/7959544e324d6a4e3259444d324d444f3463444f31457a6333566d54/img/1d7ef3e74ca242b09753fa27fa983284/1d7ef3e74ca242b09753fa27fa983284-1.jpg", "publishedAt": "2020-04-26T07:46:15Z", "content": "When paleontologist Thomas Mors was peering into a microscope while sorting through tiny 40 million-year-old fossils unearthed on Seymour Island near the tip of the Antarctic Peninsula, he came across quite a surprise hip and skull bones of a frog.\r\nThe littl… [+2705 chars]"}, {"source": {"id": null, "name": "Bccourier.com"}, "author": "bcc", "title": "The great death is real - Bandera County Courier", "description": "The current question first: maybe the current lockdown also helps the insects? \"Rather not,\" says Roel van Klink, \"unlike larger animals, they don't care whether we walk around in nature or not.\"", "url": "https://www.bccourier.com/the-great-death-is-real/", "urlToImage": "https://www.bccourier.com/wp-content/uploads/2020/04/232916/the-great-death-is-real.jpg", "publishedAt": "2020-04-26T07:37:17Z", "content": "The current question first: maybe the current lockdown also helps the insects? “Rather not,” says Roel van Klink, “unlike larger animals, they don't care whether we walk around in nature or not.” \r\n But one thing van Klink, who on German Center for Integrativ… [+8682 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": null, "title": "50 Years Ago, 3 Astronauts Survived Apollo 13. Could It Happen Again? - Pulse Live Kenya", "description": "(Science Times)", "url": "https://www.nytimes.com/2020/04/12/science/apollo-13-anniversary.html", "urlToImage": "https://ocdn.eu/pulscms-transforms/1/IkpktkuTURBXy9lNzk4NGNlMS1iOTg1LTQyZWQtYjVjYy1hZDZjZmQzMjAxNjAuanBlZ5GTBc0EsM0Cdg", "publishedAt": "2020-04-26T06:06:42Z", "content": "Apollo 13 almost killed three NASA astronauts.\r\nHow much safer will it be the next time that people head to the moon, more than 50 years later?\r\nWill it indeed be safer?\r\nSafer, yes, said Douglas O. Stanley, president and executive director of the National In… [+11680 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "ELIZABETH ANNE BROWN, The Asheville Citizen-Times", "title": "Bear hibernates under Asheville house, charms neighbors | News - Uniontown Herald Standard", "description": "ASHEVILLE, N.C. (AP) — At first, Haw Creek resident Ann McNamara thought she had a raccoon in her crawl space. There was a persistent scratching sound from beneath the floorboards,", "url": "https://apnews.com/8088f1ad9639ebd48163a01050e56ca4", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/heraldstandard.com/content/tncms/assets/v3/editorial/3/fe/3fe02e98-82f3-58f0-acbf-a3591eb13864/5ea50e76643db.image.jpg?resize=945%2C630", "publishedAt": "2020-04-26T04:01:14Z", "content": "ASHEVILLE, N.C. (AP) At first, Haw Creek resident Ann McNamara thought she had a raccoon in her crawl space. There was a persistent scratching sound from beneath the floorboards, and every once in a while her dog would stand stock-still and then tremble.\r\nShe… [+3884 chars]"}, {"source": {"id": null, "name": "Spokesman.com"}, "author": "Richard Tribou", "title": "SpaceX already prepping for next crew mission to ISS ahead of May test run - The Spokesman-Review", "description": "SpaceX is already looking past next month’s planned landmark mission of its Crew Dragon capsule to the International Space Station.", "url": "https://www.spokesman.com/stories/2020/apr/25/spacex-already-prepping-for-next-crew-mission-to-i/", "urlToImage": "https://media.spokesman.com/photos/2020/04/25/Rocket_Launch.JPG_CKNPuar_t1200.jpg?298603a24e8d51915fce203907ff2746e482a5a6", "publishedAt": "2020-04-26T03:51:09Z", "content": "ORLANDO, Fla. SpaceX is already looking past next months planned landmark mission of its Crew Dragon capsule to the International Space Station.\r\nCurrently slated for May 27, the mission from Kennedy Space Center will be the first time astronauts will launch … [+2624 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Jo Abi", "title": "Perth boy's desperate quest for a wheelchair - 9Honey", "description": "", "url": "https://honey.nine.com.au/latest/australian-boys-desperate-plea-for-a-wheelchair/1972ead0-2dd9-46c7-b5d7-6ad4ceee0366", "urlToImage": "https://imageresizer.static9.net.au/eLxrWLLPJF86zqA04ldoMhpd-LM=/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F51616c3d-89ec-4a17-b929-7e35273fc281", "publishedAt": "2020-04-26T03:31:20Z", "content": "Charlie Mone is just about the cutest boys you will ever see, and one of the happiest, in complete contrast to his past two years of struggle.\r\nCharlie, 10, suffers from Duchenne Muscular Dystrophy, a genetic neuromuscular condition. Is his own words, his \"br… [+4361 chars]"}, {"source": {"id": null, "name": "Abc13.com"}, "author": null, "title": "NASA Astronaut Andrew Morgan welcomed back to Earth with parade in Friendswood - KTRK-TV", "description": "Welcome home, Dr. Morgan! 🌎", "url": "https://abc13.com/friendswood-parade-nasa-astronaut-andrew-morgan-back-on-earth/6129564/", "urlToImage": "https://cdn.abcotvs.com/dip/images/6129708_042520-ktrk-astronaut-vid.jpg?w=1600", "publishedAt": "2020-04-26T00:22:43Z", "content": "FRIENDSWOOD, Texas (KTRK) -- NASA Astronaut Andrew Morgan was welcomed back to Earth with a homecoming celebration.Morgan's friends and family gathered to celebrate with a street parade in his home in Friendswood.\r\nDr. Morgan returned back to Earth on April 1… [+260 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "“Most Dangerous Place in the History of Planet Earth” Revealed by Paleontologists - SciTechDaily", "description": "100 million years ago, ferocious predators, including flying reptiles and crocodile-like hunters, made the Sahara the most dangerous place on Earth. This is according to an international team of scientists, who have published the biggest review in almost 100 …", "url": "https://scitechdaily.com/most-dangerous-place-in-the-history-of-planet-earth-revealed-by-paleontologists/", "urlToImage": "https://scitechdaily.com/images/Predator-Paradise.jpg", "publishedAt": "2020-04-25T22:55:27Z", "content": "Predator paradise — The giant predatory dinosaur Carcharodontosaurus eyes a group of Elosuchus — crocodile-like hunters — near a carcass. Credit: Artwork by Davide Bonadonna\r\n100 million years ago, ferocious predators, including flying reptiles and crocodile-… [+3134 chars]"}, {"source": {"id": null, "name": "Eurasiareview.com"}, "author": "https://www.eurasiareview.com/author/admin/", "title": "An Eclipsing Binary Millisecond Pulsar Discovered By FAST - Eurasia Review", "description": "Using the data obtained by the Five-hundred-meter Aperture Spherical radio Telescope (FAST), a research team led by Prof. PAN Zhichen and Prof. LI Di from the National Astronomical Observatories of…", "url": "https://www.eurasiareview.com/26042020-an-eclipsing-binary-millisecond-pulsar-discovered-by-fast/", "urlToImage": "https://i1.wp.com/www.eurasiareview.com/wp-content/uploads/2020/04/b-292.jpg?fit=800%2C445&ssl=1", "publishedAt": "2020-04-25T22:26:00Z", "content": "Using the data obtained by the Five-hundred-meter Aperture Spherical radio Telescope (FAST), a research team led by Prof. PAN Zhichen and Prof. LI Di from the National Astronomical Observatories of the Chinese Academy of Sciences (NAOC) discovered an eclipsin… [+1881 chars]"}, {"source": {"id": null, "name": "Newsinfopark.com"}, "author": "NIP Web Desk Team", "title": "Controversial Discovery Says Origins of Human Language Existed 25 Million Years Ago - News Info Park", "description": "(SolStock/E+/Getty Images) CARLY CASSELLA 25 APRIL 2020 A structure critical to our brain's core language pathway, found only in humans and apes, has now also been identified in monkeys, according to", "url": "https://newsinfopark.com/science/2020-04-25/article/controversial-discovery-says-origins-of-human-language-existed-25-million-years-ago-19201/nip-web-desk-team/", "urlToImage": null, "publishedAt": "2020-04-25T22:10:47Z", "content": "A structure critical to our brain’s core language pathway, found only in humans and apes, has now also been identified in monkeys, according to a controversial new study – suggesting the origins of language may have appeared 20 to 25 million years earlier tha… [+4838 chars]"}, {"source": {"id": null, "name": "Voanews.com"}, "author": "VOA Learning English", "title": "Scientists Study Unusual Comet - VOA Learning English", "description": "Amateur astronomer Gennady Borisov was the first person to identify a new comet in August of 2019. Researchers reported on Monday that gas coming off the comet, 2I/Borisov, had high levels of carbon monoxide - far more than comets formed in our solar system.", "url": "https://learningenglish.voanews.com/a/scientists-study-unusual-comet-/5384347.html", "urlToImage": "https://gdb.voanews.com/BBC62255-918B-421C-A24E-F68343F73161_w1200_r1.jpg", "publishedAt": "2020-04-25T21:58:00Z", "content": "Scientists recently reported new details about the second interstellar object ever seen passing through our solar system. It is a comet called 2I/Borisov.\r\nComets are made up of frozen gases, rock and dust that orbit stars. The Reuters news agency likens them… [+3202 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Anna Salleh", "title": "The fagus, Australia's only native winter deciduous tree, is turning its stunning autumn colours. What's behind that gorgeous display? - ABC News", "description": "Tasmania's deciduous beech, the fagus, is turning stunning yellow, orange and red — what makes this happen?", "url": "https://www.abc.net.au/news/science/2020-04-26/true-blue-autumn-leaves-are-turning/12147698", "urlToImage": "https://www.abc.net.au/cm/rimage/12169716-16x9-large.jpg?v=2", "publishedAt": "2020-04-25T20:30:09Z", "content": "Every year at this time, thousands flock to national parks in Tasmania to see the stunning autumn display of Australia's only native winter deciduous tree the fagus.\r\nBut this year the state's parks are closed until further notice thanks to coronavirus, which… [+4723 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "The Largest Hole in the Ozone Layer Over the Arctic Has Been Closed - Somag News", "description": "The large ozone hole observed last month in the Arctic, located above the north polar circle of the world, was completely closed according to the statement made by scientists. Scientists have explained that this phenomenon is not related to the coronavirus. T…", "url": "https://www.somagnews.com/largest-hole-ozone-layer-arctic-closed/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2020/04/28-23-e1587844072210.jpg", "publishedAt": "2020-04-25T19:48:00Z", "content": "The large ozone hole observed last month in the Arctic, located above the north polar circle of the world, was completely closed according to the statement made by scientists. Scientists have explained that this phenomenon is not related to the coronavirus.\r\n… [+2194 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "The Great Space Escape: Scientists Learn How Light Can Flee From Black Hole 'Like Boomerang' - Sputnik International", "description": "The scientists' discovery may potentially help them to learn more about the nature of black holes, such as the rotation speed of these space objects.", "url": "https://sputniknews.com/science/202004251079093023-the-great-space-escape-scientists-learn-how-light-can-flee-from-black-hole-like-a-boomerang/", "urlToImage": "https://cdn2.img.sputniknews.com/images/106962/09/1069620931.jpg", "publishedAt": "2020-04-25T18:31:30Z", "content": "The scientists' discovery may potentially help them to learn more about the nature of black holes, such as the rotation speed of these space objects.Having examined archived X-ray observation data of a black hole whose mass is about ten times that of the Sun … [+1560 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Callum Hoare", "title": "'Universe is unstable!' How Brian Cox revealed world could end 'at any moment' - Express.co.uk", "description": "THE END OF THE WORLD could happen 'at any moment' according to the chilling claims of a scientist, after Brian Cox revealed why the 'universe is unstable'.", "url": "https://www.express.co.uk/news/science/1273858/end-of-the-world-brian-cox-universe-unstable-vacuum-decay-space-news-spt", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1273858.jpg", "publishedAt": "2020-04-25T17:54:00Z", "content": null}, {"source": {"id": null, "name": "Ibtimes.sg"}, "author": "https://www.ibtimes.sg/reporters/jeevan-biswas", "title": "Scientists identify the 'most dangerous place' in the history of earth, once home to fearsome predators - International Business Times, Singapore Edition", "description": "According to the researchers, the area around south-eastern Morocco was home to predators such as Carcharodontosaurus, Pterosaurs and freshwater sharks 100 million years ago", "url": "https://www.ibtimes.sg/scientists-identify-most-dangerous-place-history-earth-once-home-fearsome-predators-43789", "urlToImage": "https://data.ibtimes.sg/en/full/36203/pterosaur.jpg", "publishedAt": "2020-04-25T16:43:56Z", "content": "If one was asked which was the most dangerous place in the history of the planet, what would their answer be? Not many can answer that question. However, an international team of scientists has identified such a place a predator-ridden Morocco 100 million yea… [+3056 chars]"}, {"source": {"id": null, "name": "Digitaltrends.com"}, "author": "Georgina Torbet", "title": "NASA’s Perseverance rover is perfectly balanced for its trip to Mars - Digital Trends", "description": "NASA's Perseverance rover is preparing for its launch to Mars has just made it through one more item on the list: Ensuring that it is correctly balanced.", "url": "https://www.digitaltrends.com/news/nasa-perseverance-rover-balance/", "urlToImage": "https://icdn4.digitaltrends.com/image/digitaltrends/pia23828-1200x630-c-ar1.91.jpg", "publishedAt": "2020-04-25T16:00:25Z", "content": "NASA’s Perseverance rover is preparing for launch in the next few months by undergoing final checks, and it has just made it through one more item on the list: Ensuring that it is correctly balanced.\r\nPart of the final preparations for readying the rover for … [+1853 chars]"}, {"source": {"id": null, "name": "Heritagedaily.com"}, "author": "http://www.facebook.com/archaeologynews", "title": "Hubble celebrates its 30th anniversary with a tapestry of blazing starbirth - HeritageDaily - Archaeology News - HeritageDaily", "description": "Hubble Space Telescope's iconic images and scientific breakthroughs have redefined our view of the Universe. - Space & Planetary HeritageDaily - Archaeology News", "url": "https://www.heritagedaily.com/2020/04/hubble-celebrates-its-30th-anniversary-with-a-tapestry-of-blazing-starbirth/127932", "urlToImage": "https://www.heritagedaily.com/wp-content/uploads/2020/04/HUBBLE1-scaled.jpg", "publishedAt": "2020-04-25T15:49:09Z", "content": "Hubble Space Telescope’s iconic images and scientific breakthroughs have redefined our view of the Universe.\r\nTo commemorate three decades of scientific discoveries, this image is one of the most photogenic examples of the many turbulent stellar nurseries the… [+5184 chars]"}, {"source": {"id": null, "name": "Kiowacountypress.net"}, "author": null, "title": "Kiowa County weather outlook – week of April 25, 2020 - Kiowa County Press", "description": "Steve NorrisTemperatures are going to be climbing steadily for the week ahead.High temperatures will climb from the upper 70s Sunday to the mid-80s by Wednesday and we could hit 90 Friday!Low temperatures will mostly be in the 40s for the week. The period Fro…", "url": "https://kiowacountypress.net/content/kiowa-county-weather-outlook-%E2%80%93-week-april-25-2020", "urlToImage": null, "publishedAt": "2020-04-25T15:38:06Z", "content": "Steve Norris\r\nTemperatures are going to be climbing steadily for the week ahead.\r\nHigh temperatures will climb from the upper 70s Sunday to the mid-80s by Wednesday and we could hit 90 Friday!\r\nLow temperatures will mostly be in the 40s for the week. The peri… [+432 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "China unveils name of first Mars exploration mission - The Jakarta Post - Jakarta Post", "description": "China's space agency on Friday unveiled the name of its first Mars exploration mission, coinciding with China's annual Space Day and the 50th anniversary of the launch of its first satellite.", "url": "https://www.thejakartapost.com/life/2020/04/25/china-unveils-name-of-first-mars-exploration-mission-.html", "urlToImage": "https://img.jakpost.net/c/2020/04/25/2020_04_25_93752_1587790733._large.jpg", "publishedAt": "2020-04-25T15:05:00Z", "content": "China's space agency on Friday unveiled the name of its first Mars exploration mission, coinciding with China's annual Space Day and the 50th anniversary of the launch of its first satellite.\r\nThe Mars mission has been named Tianwen-1, the official Xinhua new… [+835 chars]"}, {"source": {"id": null, "name": "Counton2.com"}, "author": "Antonio Stinson", "title": "American Red Cross to host blood drive in Berkeley County - WCBD News 2", "description": "BERKELEY COUNTY, S.C. (WCBD) – Berkeley County is partnering with the American Red Cross by hosting a blood drive. The blood drive will be on Tuesday, May 12 from 10:00 AM until 3:00 PM in th…", "url": "https://www.counton2.com/news/american-red-cross-to-host-blood-drive-in-berkeley-county/", "urlToImage": "https://www.counton2.com/wp-content/uploads/sites/7/2016/02/red-cross_37246128_ver1.0.jpg?w=825&h=376&crop=1&resize=1280,720", "publishedAt": "2020-04-25T14:55:00Z", "content": "BERKELEY COUNTY, S.C. (WCBD) – Berkeley County is partnering with the American Red Cross by hosting a blood drive. \r\nThe blood drive will be on Tuesday, May 12 from 10:00 AM until 3:00 PM in the Assembly Room at the Berkeley County Administration Building on … [+234 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Neha", "title": "Atmospheric tidal waves maintain Venus’ super-rotation - The Siasat Daily", "description": "Washington D.C.: Images from the Akatsuki spacecraft unveil what keeps Venus's atmosphere rotating much faster than the planet itself. An international research team led by Takeshi Horinouchi of Hokkaido University has revealed that this 'super-rotation' is m…", "url": "https://www.siasat.com/atmospheric-tidal-waves-maintain-venus-super-rotation-1879546/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/04/Venus-1.jpg", "publishedAt": "2020-04-25T14:08:23Z", "content": "Washington D.C.: Images from the Akatsuki spacecraft unveil what keeps Venus’s atmosphere rotating much faster than the planet itself.\r\nAn international research team led by Takeshi Horinouchi of Hokkaido University has revealed that this ‘super-rotation’ is … [+3082 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Dutch Tulip Fields Come Into Bloom in Stunning Satellite Images - SciTechDaily", "description": "While the COVID-19 virus pandemic is forcing everybody to stay at home, we bring you these beautiful views from space of the Dutch tulip fields coming into bloom. Captured by the Copernicus Sentinel-2 mission on April 5, April 10, April 15 and April 20, 2020,…", "url": "https://scitechdaily.com/dutch-tulip-fields-come-into-bloom-in-stunning-satellite-images/", "urlToImage": "https://scitechdaily.com/images/Dutch-Tulip-Fields-Bloom-Crop.gif", "publishedAt": "2020-04-25T14:03:13Z", "content": "While the COVID-19 virus pandemic is forcing everybody to stay at home, we bring you these beautiful views from space of the Dutch tulip fields coming into bloom. Captured by the Copernicus Sentinel-2 mission on April 5, April 10, April 15 and April 20, 2020,… [+1633 chars]"}, {"source": {"id": null, "name": "Nationeditions.com"}, "author": "Akshay Tiwari", "title": "Moon Uncovered: View The Updated Lunar Map Coded By Colors & Packed Including Exciting Data On Topolog ... - NationEditions", "description": "The Moon has consistently been loaded up with riddles, even with the entirety of man's endeavours to investigate and find its insider facts. As of late, be that as it may, researchers have shared the work they called \"Brought together Geologic Map of the Moon…", "url": "https://nationeditions.com/moon-uncovered-view-the-updated-lunar-map-coded-by-colors-packed-including-exciting-data-on-topology-rock-layers/", "urlToImage": "https://nationeditions.com/wp-content/uploads/2020/04/enceladus-saturn-moon-01.jpg", "publishedAt": "2020-04-25T12:44:00Z", "content": "The Moon has consistently been loaded up with riddles, even with the entirety of man’s endeavours to investigate and find its insider facts. \r\nAs of late, be that as it may, researchers have shared the work they called “Brought together Geologic Map of the Mo… [+2901 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Ciaran McGrath", "title": "Kilauea shock: Was THIS the reason for 2018 Hawaii volcano eruption? - Express.co.uk", "description": "THE spectacular Kilauea volcanic eruption of 2018, which resulted in the destruction of hundreds of homes, and the evacuation of thousands of people, may have been triggered in part by unusually high rainfall levels, a new study has suggested.", "url": "https://www.express.co.uk/news/science/1272403/kilauea-volcano-eruption-hawaii-big-island-2018-rainfall", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1272403.jpg", "publishedAt": "2020-04-25T09:30:00Z", "content": null}, {"source": {"id": null, "name": "Salisburyjournal.co.uk"}, "author": "Press Association 2020", "title": "Russian cargo ship docks with space station - Salisbury Journal", "description": "The Progress MS-14 spacecraft docked at 0512 GMT on Saturday, about three-and-a-half hours after blasting off from Kazakhstan.", "url": "https://www.salisburyjournal.co.uk/news/national/18405361.russian-cargo-ship-docks-space-station/", "urlToImage": "https://www.salisburyjournal.co.uk/resources/images/11300220/", "publishedAt": "2020-04-25T07:51:00Z", "content": "An unmanned Russian cargo capsule has arrived at the International Space Station with more than two tons of supplies for the three-man crew.\r\nThe Progress MS-14 spacecraft docked at 0512 GMT on Saturday, about three-and-a-half hours after blasting off from Ru… [+417 chars]"}, {"source": {"id": null, "name": "Travelandleisure.com"}, "author": "Cailey Rizzo", "title": "NASA's Online Game Can Help Save the Coral Reefs — and Your Boredom During Quarantine - Travel + Leisure", "description": "Move over, Animal Crossing.", "url": "https://www.travelandleisure.com/travel-tips/mobile-apps/nasa-nemo-net-coral-reef-mapping-game-quarantine", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1800&h=942&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F28%2F2020%2F04%2F20%2Fnasa-coral-mapping-CORAL0420.jpg", "publishedAt": "2020-04-20T16:42:22Z", "content": "NASA is calling on gamers to help map and explore the world’s coral reefs.\r\nIn the game, NASA NeMO-Net, players can can help train a NASA supercomputer to learn more about the ocean floor, with the help of real NASA data to identify and classify corals. Playe… [+1604 chars]"}, {"source": {"id": null, "name": "Tass.com"}, "author": "TASS", "title": "ISS crew evacuated from Soyuz-MS15 on landing - TASS", "description": "The crew has returned to Earth due to the novel coronavirus pandemic", "url": "https://tass.com/science/1146089", "urlToImage": "https://phototass1.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20200417/1263015.jpg", "publishedAt": "2020-04-17T06:20:00Z", "content": "MOSCOW, April 17. /TASS/. Roscosmos cosmonaut Oleg Skripochka and NASA astronauts Andrew Morgan and Jessica Meir have been evacuated from the Soyuz MS-15 manned spacecraft, which landed earlier in Kazakhstan, 147 km to the southeast of the city of Zhezqazghan… [+657 chars]"}, {"source": {"id": null, "name": "Travelandleisure.com"}, "author": "Alison Fox", "title": "NASA, Former Astronauts Commemorate the 50th Anniversary of Apollo 13 - Travel + Leisure", "description": "On April 13, 1970, the Apollo 13's lunar landing was aborted in what would become a historic mission.", "url": "https://www.travelandleisure.com/travel-news/apollo-13-mission-50th-anniversary", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1800&h=942&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F28%2F2020%2F04%2F13%2Fapollo-13-crew-APOLLO0420.jpg", "publishedAt": "2020-04-14T13:47:15Z", "content": "\"Houston, we've had a problem.\"\r\nFifty years after that famed phrase aboard the Apollo 13 was spoken, legends and institutions of space exploration are taking to a different form of communication to commemorate the historic mission — Twitter.\r\n“They were coas… [+3223 chars]"}]}