{"status": "ok", "totalResults": 54, "articles": [{"source": {"id": null, "name": "Digitaltrends.com"}, "author": "Georgina Torbet", "title": "Scientists figure out why Venus’s atmosphere rotates much faster than the planet - Digital Trends", "description": "Venus's atmosphere rotates 60 times faster than the planet does, and now scientists from the Institute of Space and Astronautical Science have figured out why.", "url": "https://www.digitaltrends.com/news/venus-atmosphere-superrotation/", "urlToImage": null, "publishedAt": "2020-04-26T14:18:00Z", "content": "The planet Venus has some strange characteristics, but one of its oddest features is its atmosphere. Full of clouds of sulfuric acid, its thick atmosphere hides the surface of the planet and heats it so much that even though it’s further from the sun than Mer… [+2383 chars]"}, {"source": {"id": null, "name": "Townsvillebulletin.com.au"}, "author": null, "title": "Researcher says reefs around Magnetic Island have nearly recovered from coral bleaching - Townsville Bulletin", "description": "Subscribe to the Townsville Bulletin to get unrestricted digital access, home paper delivery, Apps for iPad and Android and much more...", "url": "https://www.townsvillebulletin.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-26T14:01:56Z", "content": null}, {"source": {"id": null, "name": "Thenewdaily.com.au"}, "author": null, "title": "Did a Death Star take out a planet for real? Something did - The New Daily", "description": "If you've felt a great disturbance in the Force of late, of the sort that made you stagger and press your fingertips to your temple, then fair enough. It", "url": "https://thenewdaily.com.au/life/science/2020/04/26/death-star-return-planet/", "urlToImage": null, "publishedAt": "2020-04-26T13:25:19Z", "content": "If you’ve felt a great disturbance in the Force of late, of the sort that made you stagger and press your fingertips to your temple, then fair enough.\r\nIt seems the famed planet-killing Death Star from Star Wars has been at it again.\r\nWhat else can explain th… [+3273 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Christopher Wanjek", "title": "How Space Travel Tries to Kill You and Make You Ugly - WIRED", "description": "Oh also, it makes you blind and stupid, too.", "url": "https://www.wired.com/story/how-space-tries-kill-you-make-you-ugly/", "urlToImage": null, "publishedAt": "2020-04-26T11:40:53Z", "content": "Of these 34 risks, three are potential showstoppers: radiation, gravity (or lack thereof), and the need for surgery or a complicated medical procedure.\r\nLets explore the gravity issue.\r\nSome science fiction writers in the mid-20th century speculated that zero… [+3425 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "How runny a liquid can be? - Tech Explorist", "description": "Viscosity (η) is the resistance of a liquid to flow. Liquids get thicker when cooled and runnier when heated, but how runny can a liquid ever get if we", "url": "https://www.techexplorist.com/runny-liquid/31826/", "urlToImage": null, "publishedAt": "2020-04-26T09:47:18Z", "content": "Viscosity () is the resistance of a liquid to flow. Liquids get thicker when cooled and runnier when heated, but how runny can a liquid ever get if we keep heating it?\r\nAt a point, the liquid reaches a specific temperature; it transitions between the liquid-l… [+3341 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Carly Cassella", "title": "Ancient Australian Rocks Suggest Earth's Continents Were Shifting Earlier Than Thought - ScienceAlert", "description": "Earth's continents are constantly on the move, it's a key feature of our planet, but that wasn't always the case.", "url": "https://www.sciencealert.com/ancient-australian-rocks-suggest-earth-s-continents-have-been-moving-for-over-3-billion-years", "urlToImage": null, "publishedAt": "2020-04-26T09:40:49Z", "content": "Earth's continents are constantly on the move, it's a key feature of our planet, but that wasn't always the case.\r\nWhile some scientists think Earth's tectonic plates began pushing and pulling only a billion years ago, others think the whole process started n… [+4081 chars]"}, {"source": {"id": null, "name": "Bigthink.com"}, "author": "Michelle Thaller", "title": "Ask an astronomer: How do astronauts deal with isolation? - Big Think", "description": "Being stuck at home is not as intense as being away from Earth, but there are ways to cope in either scenario.", "url": "https://bigthink.com/videos/astronaut-isolation", "urlToImage": null, "publishedAt": "2020-04-26T09:05:19Z", "content": "MICHELLE THALLER: When it comes to how to deal with isolation and feeling like you're sort of helpless and cut off from everybody, it's hard to beat the experience of an astronaut, where they literally are cut off from Earth. And even if they wanted to, they … [+4662 chars]"}, {"source": {"id": null, "name": "Volcanodiscovery.com"}, "author": null, "title": "Volcanoes Today - summary of volcanic activity world-wide - VolcanoDiscovery", "description": "Volcanoes Today - summary of volcanic activity world-wide", "url": "https://www.volcanodiscovery.com/volcanoes/today.html", "urlToImage": null, "publishedAt": "2020-04-26T08:59:32Z", "content": "Volcanoes Today, 26 Apr 2020: Klyuchevskoy volcano, Reventador, Sangay, Nevados de Chillán, Aso, Sabancaya, Ebeko\r\nSunday Apr 26, 2020 11:00 AM | BY: VN\r\nSatellite image of Klyuchevskoy volcano on 26 Apr 2020\r\nKlyuchevskoy (Kamchatka): Explosive activity cont… [+1647 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Joel Day", "title": "Richard Dawkins confession: How scientist pinpointed ‘impossible’ universe questions - Express.co.uk", "description": "RICHARD DAWKINS claimed that religion would never answer the questions science cannot, leaving the matter of the universe's creation potentially unanswerable.", "url": "https://www.express.co.uk/news/science/1273420/richard-dawkins-science-news-universe-creator-God-religion-spt", "urlToImage": null, "publishedAt": "2020-04-26T08:00:00Z", "content": null}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Ethelene Bailey", "title": "BepiColombo Captured a Couple of Images of the Earth, While Heading Towards Mercury - Dual Dove", "description": "The European Space Agency has recently published a series of impressive images of the Earth captured by the BepiColombo probe. The mission aiming to provide resourceful information regarding the fo…", "url": "https://www.dualdove.com/bepicolombo-captured-a-couple-of-images-of-the-earth-while-heading-towards-mercury/9742/", "urlToImage": null, "publishedAt": "2020-04-26T07:52:30Z", "content": "The European Space Agency has recently published a series of impressive images of the Earth captured by the BepiColombo probe. The mission aiming to provide resourceful information regarding the formation and evolution of Mercury started in 2018.\r\nTwo years h… [+1721 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Before becoming frozen wasteland, Antarctica was home to frogs - CGTN", "description": "At the time when the little frog was hopping around and dining on insects, ice sheets were already forming in the highlands within the interior of Antarctica.", "url": "https://news.cgtn.com/news/2020-04-26/Before-becoming-frozen-wasteland-Antarctica-was-home-to-frogs-Q0eMPNz0I0/index.html", "urlToImage": null, "publishedAt": "2020-04-26T07:46:15Z", "content": "When paleontologist Thomas Mors was peering into a microscope while sorting through tiny 40 million-year-old fossils unearthed on Seymour Island near the tip of the Antarctic Peninsula, he came across quite a surprise hip and skull bones of a frog.\r\nThe littl… [+2705 chars]"}, {"source": {"id": null, "name": "Menafn.com"}, "author": "MENAFN", "title": "Comet Atlas Will Pass In May And Shine Bright As The Moon - MENAFN.COM", "description": "(MENAFN - Costa Rica News)  \nComet Atlas will pass close to Earth in May and will be a stellar show. It is the  celestial body  C / 2019 Y4 (ATLAS), first discovered on December 28, 2019. Although astronomers noticed it rather weak at that time, it has been g…", "url": "https://menafn.com/1100085274/Comet-Atlas-Will-Pass-In-May-And-Shine-Bright-As-The-Moon", "urlToImage": null, "publishedAt": "2020-04-26T03:27:20Z", "content": "(MENAFN - Costa Rica News) \r\nComet Atlas will pass close to Earth in May and will be a stellar show. It is the celestial body C / 2019 Y4 (ATLAS), first discovered on December 28, 2019. Although astronomers noticed it rather weak at that time, it has been gai… [+1268 chars]"}, {"source": {"id": null, "name": "Nasaspaceflight.com"}, "author": null, "title": "Starship SN4 set for cryogenic proof test - NASASpaceflight.com", "description": "Starship SN4 is set for a crucial cryogenic proof test as early as Saturday evening…", "url": "https://www.nasaspaceflight.com/2020/04/starship-sn4-set-for-test/", "urlToImage": null, "publishedAt": "2020-04-26T00:55:27Z", "content": "Starship SN4 is set for a crucial cryogenic proof test as early as Saturday evening at SpaceX’s launch site in Boca Chica, Texas. The cryogenic proof test is one of the first tests necessary to prove the vehicle’s flight-worthiness. If all goes well, SpaceX t… [+5301 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "“Most Dangerous Place in the History of Planet Earth” Revealed by Paleontologists - SciTechDaily", "description": "100 million years ago, ferocious predators, including flying reptiles and crocodile-like hunters, made the Sahara the most dangerous place on Earth. This is according to an international team of scientists, who have published the biggest review in almost 100 …", "url": "https://scitechdaily.com/most-dangerous-place-in-the-history-of-planet-earth-revealed-by-paleontologists/", "urlToImage": null, "publishedAt": "2020-04-25T22:55:27Z", "content": "Predator paradise — The giant predatory dinosaur Carcharodontosaurus eyes a group of Elosuchus — crocodile-like hunters — near a carcass. Credit: Artwork by Davide Bonadonna\r\n100 million years ago, ferocious predators, including flying reptiles and crocodile-… [+3134 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": null, "title": "SpaceX already preparing for next crew mission to ISS ahead of May test run - South China Morning Post", "description": "The mission will be the first time astronauts will launch from the United States on any mission since the end of the space shuttle programme in 2011.", "url": "https://www.scmp.com/news/world/united-states-canada/article/3081575/spacex-already-preparing-next-crew-mission-iss", "urlToImage": null, "publishedAt": "2020-04-25T22:13:31Z", "content": "Published: 5:34am, 26 Apr, 2020\r\nUpdated: 5:34am, 26 Apr, 2020"}, {"source": {"id": null, "name": "Voanews.com"}, "author": "VOA Learning English", "title": "Scientists Study Unusual Comet - VOA Learning English", "description": "Amateur astronomer Gennady Borisov was the first person to identify a new comet in August of 2019. Researchers reported on Monday that gas coming off the comet, 2I/Borisov, had high levels of carbon monoxide - far more than comets formed in our solar system.", "url": "https://learningenglish.voanews.com/a/scientists-study-unusual-comet-/5384347.html", "urlToImage": null, "publishedAt": "2020-04-25T21:58:00Z", "content": "Scientists recently reported new details about the second interstellar object ever seen passing through our solar system. It is a comet called 2I/Borisov.\r\nComets are made up of frozen gases, rock and dust that orbit stars. The Reuters news agency likens them… [+3202 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Anna Salleh", "title": "The fagus, Australia's only native winter deciduous tree, is turning its stunning autumn colours. What's behind that gorgeous display? - ABC News", "description": "Tasmania's deciduous beech, the fagus, is turning stunning yellow, orange and red — what makes this happen?", "url": "https://www.abc.net.au/news/science/2020-04-26/true-blue-autumn-leaves-are-turning/12147698", "urlToImage": null, "publishedAt": "2020-04-25T20:30:09Z", "content": "Every year at this time, thousands flock to national parks in Tasmania to see the stunning autumn display of Australia's only native winter deciduous tree the fagus.\r\nBut this year the state's parks are closed until further notice thanks to coronavirus, which… [+4723 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Peter Stubley", "title": "First credible evidence emerges of person being killed by meteor - The Independent", "description": "Researchers find official records documenting fatal strike in Iraq in 1888", "url": "https://www.independent.co.uk/news/science/meteor-man-death-first-person-killed-iraq-turkey-ottoman-empire-a9484231.html", "urlToImage": null, "publishedAt": "2020-04-25T20:00:42Z", "content": "The odds of being struck and killed by a meteorite are said to be as low as one in 250,000.\r\nThere has been no credible and well-documented evidence of any human being befalling this unfortunate fate.\r\nBut researchers now say they have found three separate of… [+16481 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "The Largest Hole in the Ozone Layer Over the Arctic Has Been Closed - Somag News", "description": "The large ozone hole observed last month in the Arctic, located above the north polar circle of the world, was completely closed according to the statement made by scientists. Scientists have explained that this phenomenon is not related to the coronavirus. T…", "url": "https://www.somagnews.com/largest-hole-ozone-layer-arctic-closed/", "urlToImage": null, "publishedAt": "2020-04-25T19:48:00Z", "content": "The large ozone hole observed last month in the Arctic, located above the north polar circle of the world, was completely closed according to the statement made by scientists. Scientists have explained that this phenomenon is not related to the coronavirus.\r\n… [+2194 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Scientists Find Our Solar System 'Stealing' Interstellar Asteroids - Somag News", "description": "It was found that 19 interstellar asteroids were swallowed by the Solar System. So scientists will not have to look far to observe asteroids. These asteroids are thought to have been swallowed by the Solar System about 4 billion years ago. An international te…", "url": "https://www.somagnews.com/scientists-find-solar-system-stealing-interstellar-asteroids/", "urlToImage": null, "publishedAt": "2020-04-25T19:03:00Z", "content": "It was found that 19 interstellar asteroids were swallowed by the Solar System. So scientists will not have to look far to observe asteroids. These asteroids are thought to have been swallowed by the Solar System about 4 billion years ago.\r\nAn international t… [+2034 chars]"}, {"source": {"id": null, "name": "Ibtimes.sg"}, "author": "https://www.ibtimes.sg/reporters/jeevan-biswas", "title": "Scientists identify the 'most dangerous place' in the history of earth, once home to fearsome predators - International Business Times, Singapore Edition", "description": "According to the researchers, the area around south-eastern Morocco was home to predators such as Carcharodontosaurus, Pterosaurs and freshwater sharks 100 million years ago", "url": "https://www.ibtimes.sg/scientists-identify-most-dangerous-place-history-earth-once-home-fearsome-predators-43789", "urlToImage": null, "publishedAt": "2020-04-25T16:43:56Z", "content": "If one was asked which was the most dangerous place in the history of the planet, what would their answer be? Not many can answer that question. However, an international team of scientists has identified such a place a predator-ridden Morocco 100 million yea… [+3056 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "China unveils name of first Mars exploration mission - The Jakarta Post - Jakarta Post", "description": "China's space agency on Friday unveiled the name of its first Mars exploration mission, coinciding with China's annual Space Day and the 50th anniversary of the launch of its first satellite.", "url": "https://www.thejakartapost.com/life/2020/04/25/china-unveils-name-of-first-mars-exploration-mission-.html", "urlToImage": null, "publishedAt": "2020-04-25T15:05:00Z", "content": "China's space agency on Friday unveiled the name of its first Mars exploration mission, coinciding with China's annual Space Day and the 50th anniversary of the launch of its first satellite.\r\nThe Mars mission has been named Tianwen-1, the official Xinhua new… [+835 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Dutch Tulip Fields Come Into Bloom in Stunning Satellite Images - SciTechDaily", "description": "While the COVID-19 virus pandemic is forcing everybody to stay at home, we bring you these beautiful views from space of the Dutch tulip fields coming into bloom. Captured by the Copernicus Sentinel-2 mission on April 5, April 10, April 15 and April 20, 2020,…", "url": "https://scitechdaily.com/dutch-tulip-fields-come-into-bloom-in-stunning-satellite-images/", "urlToImage": null, "publishedAt": "2020-04-25T14:03:13Z", "content": "While the COVID-19 virus pandemic is forcing everybody to stay at home, we bring you these beautiful views from space of the Dutch tulip fields coming into bloom. Captured by the Copernicus Sentinel-2 mission on April 5, April 10, April 15 and April 20, 2020,… [+1633 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Space race is rigged in Elon Musk’s favour, claims Russian rival - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T14:02:23Z", "content": null}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Carly Cassella", "title": "Controversial Discovery Says Origins of Human Language Existed 25 Million Years Ago - ScienceAlert", "description": "A structure critical to our brain's core language pathway, found only in humans and apes, has now also been identified in monkeys, according to a controversial new study - suggesting the origins of language may have appeared 20 to 25 million years ea", "url": "https://www.sciencealert.com/controversial-discovery-in-monkeys-pushes-the-origin-of-human-language-back-25-million-years", "urlToImage": null, "publishedAt": "2020-04-25T09:31:17Z", "content": "A structure critical to our brain's core language pathway, found only in humans and apes, has now also been identified in monkeys, according to a controversial new study - suggesting the origins of language may have appeared 20 to 25 million years earlier tha… [+4838 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Ciaran McGrath", "title": "Kilauea shock: Was THIS the reason for 2018 Hawaii volcano eruption? - Express.co.uk", "description": "THE spectacular Kilauea volcanic eruption of 2018, which resulted in the destruction of hundreds of homes, and the evacuation of thousands of people, may have been triggered in part by unusually high rainfall levels, a new study has suggested.", "url": "https://www.express.co.uk/news/science/1272403/kilauea-volcano-eruption-hawaii-big-island-2018-rainfall", "urlToImage": null, "publishedAt": "2020-04-25T09:30:00Z", "content": null}, {"source": {"id": null, "name": "Salisburyjournal.co.uk"}, "author": "Press Association 2020", "title": "Russian cargo ship docks with space station - Salisbury Journal", "description": "The Progress MS-14 spacecraft docked at 0512 GMT on Saturday, about three-and-a-half hours after blasting off from Kazakhstan.", "url": "https://www.salisburyjournal.co.uk/news/national/18405361.russian-cargo-ship-docks-space-station/", "urlToImage": null, "publishedAt": "2020-04-25T07:51:00Z", "content": "An unmanned Russian cargo capsule has arrived at the International Space Station with more than two tons of supplies for the three-man crew.\r\nThe Progress MS-14 spacecraft docked at 0512 GMT on Saturday, about three-and-a-half hours after blasting off from Ru… [+417 chars]"}, {"source": {"id": null, "name": "Webbyfeed.com"}, "author": "Herbert S. Aurand", "title": "Mars Exploration With Levitating Nanocardboard Probes Might Happen In The Future - Webby Feed", "description": "NASA is planning on launching into space its Perseverance rover, responsible for conducting the Mars 2020 mission. The spacecraft’s primary goal is to reach the Red Planet’s surface and provide...", "url": "https://www.webbyfeed.com/mars-exploration-with-levitating-nanocardboard-probes-might-happen-in-the-future/8026/", "urlToImage": null, "publishedAt": "2020-04-25T07:36:16Z", "content": "NASA is planning on launching into space its Perseverance rover, responsible for conducting the Mars 2020 mission. The spacecrafts primary goal is to reach the Red Planets surface and provide resourceful information on the topic of microbial life that could e… [+1776 chars]"}, {"source": {"id": null, "name": "Webbyfeed.com"}, "author": "Carrie J. Bronstein", "title": "Scientists Came Up With The Most Detailed Lunar Map, Focused On Moon's Rock Composition - Webby Feed", "description": "The distant dark spots that can be spot on the Moon from a distance are merely the tip of the iceberg, as the satellite possesses an impressive geological diversity. A...", "url": "https://www.webbyfeed.com/scientists-came-up-with-the-most-detailed-lunar-map-focused-on-moons-rock-composition/8023/", "urlToImage": null, "publishedAt": "2020-04-25T07:24:13Z", "content": "The distant dark spots that can be spot on the Moon from a distance are merely the tip of the iceberg, as the satellite possesses an impressive geological diversity. A team of determined researchers has managed to create the most detailed lunar map focused on… [+1621 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Brett Wadelton", "title": "Space news: Asteroid to pass close to Earth next week, visible by telescope - 7NEWS.com.au", "description": "Stargazers are set for a treat early next week as an asteroid will pass close to Earth.", "url": "https://7news.com.au/technology/space/space-news-mask-shaped-asteroid-to-pass-close-to-earth-next-week-visible-by-telescope-c-993995", "urlToImage": null, "publishedAt": "2020-04-25T06:38:57Z", "content": "Astronomers are set for a treat early next week as an asteroid will pass close to Earth.\r\nNamed Asteroid (52768) 1998 OR2, this large near-Earth and potentially hazardous asteroid (PHA) will safely fly past us at a mere 6.3 million kilometres - which is quite… [+1587 chars]"}, {"source": {"id": null, "name": "Hurriyetdailynews.com"}, "author": "hurriyetdailynews.com", "title": "Hubble telescope celebrates 30th year in space - Hurriyet Daily News", "description": "Scientists on April 24 celebrated the Hubble Space Telescope's 30th anniversary with a new image of a satellite galaxy of the Milky Way.", "url": "http://www.hurriyetdailynews.com/hubble-telescope-celebrates-30th-year-in-space-154195", "urlToImage": null, "publishedAt": "2020-04-25T06:16:03Z", "content": "WASHINGTON\r\nScientists on April 24 celebrated the Hubble Space Telescope's 30th anniversary with a new image of a satellite galaxy of the Milky Way. \r\nIn a statement, U.S. space agency NASA said the galaxy in the image - located 163,000 light-years away- away… [+847 chars]"}, {"source": {"id": null, "name": "Syfy.com"}, "author": "Elizabeth Rayne", "title": "This planet is so scorching that metals actually vaporize into the atmosphere - SYFY WIRE", "description": "There are hot planets, and then there are unbelievably, unbearably, insufferably hot planets. Imagine an alien world torrid enough to not just melt, but vaporize metal. MASCARA-2 b (whose name has absolutely nothing to do with makeup) is that planet. A team o…", "url": "https://www.syfy.com/syfywire/this-planet-is-so-hot-it-makes-metals-vaporize", "urlToImage": null, "publishedAt": "2020-04-25T02:16:44Z", "content": "There are hot planets, and then there are unbelievably, unbearably, insufferably hot planets.\r\nImagine an alien world torrid enough to not just melt, but vaporize metal. MASCARA-2 b (whose name has absolutely nothing to do with makeup) is that planet. A team … [+3176 chars]"}, {"source": {"id": null, "name": "Spacenews.com"}, "author": "Jeff Foust", "title": "NASA invited to White House to present coronavirus projects - SpaceNews", "description": "A day after discussing the agency’s coronavirus relief work for the media, NASA took those projects to the White House to show to President Trump.", "url": "https://spacenews.com/nasa-invited-to-white-house-to-present-coronavirus-projects/", "urlToImage": null, "publishedAt": "2020-04-25T00:17:48Z", "content": "WASHINGTON A day after discussing the agencys coronavirus relief work for the media, NASA took those projects to the White House for a presentation to President Donald Trump.\r\nNASA Administrator Jim Bridenstine appeared in the Cabinet Room at the White House … [+1724 chars]"}, {"source": {"id": null, "name": "Eurasiareview.com"}, "author": "https://www.eurasiareview.com/author/admin/", "title": "Warming Climate Undoes Decades Of Knowledge Of Marine Protected Areas - Eurasia Review", "description": "Climate change and warming seas are transforming tropical coral reefs and undoing decades of knowledge about how to protect these delicate and vital ecosystems. Many of the world’s coral reef…", "url": "https://www.eurasiareview.com/25042020-warming-climate-undoes-decades-of-knowledge-of-marine-protected-areas/", "urlToImage": null, "publishedAt": "2020-04-24T22:36:00Z", "content": "Climate change and warming seas are transforming tropical coral reefs and undoing decades of knowledge about how to protect these delicate and vital ecosystems.\r\nMany of the worlds coral reefs are seeing biodiversity plunge in the face of repeated coral bleac… [+4159 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/abc-local/sophie-kesteven/7149610", "title": "Raquel is working from home during coronavirus — and that means sloths in the spare room - ABC News", "description": "Working from home means different things for different people. For Raquel, it means moving three very lazy — but very cute — new housemates into the spare room.", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-panama-working-from-home-with-sloths/12169922", "urlToImage": null, "publishedAt": "2020-04-24T22:29:37Z", "content": "Updated \r\nApril 25, 2020 08:23:26\r\nWorking from home is the new normal for many people and for Raquel Cruz Alpizar, it's meant moving three unlikely new housemates into her spare room.\r\nSince coronavirus restrictions took hold, she's been caring around the cl… [+6272 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Michael Thomsen For Dailymail.com", "title": "Time passes faster at the top of skyscrapers according to new study - Daily Mail", "description": "A new study from the University of Tokyo has shown that time actually passes at a different speed at the top of skyscrapers and other tall buildings, at a rate of four nanoseconds more quickly.", "url": "https://www.dailymail.co.uk/sciencetech/article-8254271/Time-passes-faster-skyscrapers-according-new-study.html", "urlToImage": null, "publishedAt": "2020-04-24T22:22:17Z", "content": "A new study from the University of Tokyo has shown that time actually passes at a different speed at the top of skyscrapers and other tall buildings.\r\nA team, led by quantum electronics professor Hidetoshi Katori, climbed to the top of the Tokyo Skytree, the … [+4009 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Charles Q. Choi", "title": "Mystery of Venus atmosphere's weird rotation may finally be solved - Space.com", "description": "Thermal tides in the atmosphere make it rotate faster than the planet's surface, a new study finds.", "url": "https://www.space.com/venus-atmosphere-super-rotation-mystery-solved.html", "urlToImage": null, "publishedAt": "2020-04-24T21:59:00Z", "content": "The mystery behind why the atmosphere of Venus spins much faster than the planet's surface may finally be solved, a new study finds.\r\nThe finding might help shed light on how habitable distant exoplanets, or worlds beyond our solar system, may actually be, re… [+3613 chars]"}, {"source": {"id": null, "name": "Nerdist.com"}, "author": null, "title": "Study Suggests Icy ‘Centaurs’ Come from Outside Solar System - Nerdist", "description": "Researchers have run convincing simulations that point to a group of asteroids in our solar system originally being \"birthed\" around another star.", "url": "https://nerdist.com/article/study-on-icy-centaurs-rocks-outside-our-solar-system/", "urlToImage": null, "publishedAt": "2020-04-24T21:56:58Z", "content": "Researchers have run some apparently very convincing simulations on the likely origins of a group of Centaurs. These are small bodies orbiting around the Sun between our solar system’s outer planets. Those researchers found that they provide evidence of the i… [+2769 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Meghan Bartels", "title": "Black hole keeps snacking on white dwarf locked in its orbit - Space.com", "description": "Black holes can have a little star gas, as a treat.", "url": "https://www.space.com/star-survives-black-hole-approach.html", "urlToImage": null, "publishedAt": "2020-04-24T19:32:00Z", "content": "This black hole's parents never told it not to play with its food.\r\nAn astronomer thinks he's spotted a stellar corpse known as a white dwarf sending out blazes of light, mayday signals from its uncomfortably close orbit of a black hole. And while such a whit… [+3205 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "George Dvorsky", "title": "NASA Rocket Scientists Designed A Rapid-Production Ventilator In Just 37 Days - Gizmodo Australia", "description": "Introducing VITAL, a prototype ventilator designed expressly for quick and easy mass production. Developed by NASA engineers, the device could alleviate ongoing supply shortages in the U.S. and around the world as the covid-19 pandemic rages on....", "url": "https://www.gizmodo.com.au/2020/04/nasa-rocket-scientists-designed-a-rapid-production-ventilator-in-just-37-days/", "urlToImage": null, "publishedAt": "2020-04-24T19:30:00Z", "content": "Introducing VITAL, a prototype ventilator designed expressly for quick and easy mass production. Developed by NASA engineers, the device could alleviate ongoing supply shortages in the U.S. and around the world as the covid-19 pandemic rages on.\r\nNASA has cop… [+3078 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Amanda Kooser", "title": "Scientists pinpoint 'most dangerous place in the history of planet Earth' - CNET", "description": "A paleontologist says time travelers would not survive long in this predator-packed area of Africa 100 million years ago.", "url": "https://www.cnet.com/news/scientists-pinpoint-most-dangerous-place-in-the-history-of-planet-earth/", "urlToImage": null, "publishedAt": "2020-04-24T19:24:42Z", "content": "This artist's illustration shows a massive dinosaur Carcharodontosaurus with a group of crocodile-like Elosuchus predators near a carcass.\r\nArtwork by Davide Bonadonna\r\nOnce you build your time machine, please do not set your destination for 100 million years… [+1631 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coral Restoration | Education Earth - The Weather Channel", "description": "We spoke with the Georgia Aquarium about how coral reefs are being restored.", "url": "https://www.youtube.com/watch?v=2Z7x0fS8IzM", "urlToImage": null, "publishedAt": "2020-04-24T19:15:49Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Water may look like a simple liquid; however, it is anything but simple to analyze - Science Daily", "description": "Scientists have been able to shed new light on the properties of water at the molecular level. In particular, they were able to describe accurately the interactions between three water molecules, which contribute significantly to the energy landscape of water…", "url": "https://www.sciencedaily.com/releases/2020/04/200424132621.htm", "urlToImage": null, "publishedAt": "2020-04-24T18:11:02Z", "content": "An international team of scientists lead by Professor Martina Havenith from Ruhr-Universität Bochum (RUB) has been able to shed new light on the properties of water at the molecular level. In particular, they were able to describe accurately the interactions … [+3366 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Engineers open door to big new library of tiny nanoparticles - Phys.org", "description": "The development of bimetallic nanoparticles (i.e., tiny particles composed of two different metals that exhibit several new and improved properties) represents a novel area of research with a wide range of potential applications. Now, a research team in the U…", "url": "https://phys.org/news/2020-04-door-big-library-tiny-nanoparticles.html", "urlToImage": null, "publishedAt": "2020-04-24T18:09:04Z", "content": "The development of bimetallic nanoparticles (i.e., tiny particles composed of two different metals that exhibit several new and improved properties) represents a novel area of research with a wide range of potential applications. Now, a research team in the U… [+3847 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Catalyst Opens Door To More Efficient, Environmentally Friendly Ethylene Production - Mirage News", "description": "News Releases April 24, 2020 Reaction pathways for oxidative dehydrogenation of ethane facilitated by the molten carbonate...", "url": "https://www.miragenews.com/catalyst-opens-door-to-more-efficient-environmentally-friendly-ethylene-production/", "urlToImage": null, "publishedAt": "2020-04-24T18:02:14Z", "content": "A research team led by North Carolina State University has engineered a new catalyst that can more efficiently convert ethane into ethylene, which is used in a variety of manufacturing processes. The discovery could be used in a conversion process to drastica… [+2639 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Ryan F. Mandelbaum", "title": "This Could Be The First Record Of Someone Getting Killed By A Meteorite - Gizmodo Australia", "description": "A team of scientists think they’ve found the oldest evidence of a meteorite striking and killing a person, according to a new report published in the journal journal Meteoritics & Planetary Science....", "url": "https://www.gizmodo.com.au/2020/04/this-could-be-the-first-record-of-someone-getting-killed-by-a-meteorite/", "urlToImage": null, "publishedAt": "2020-04-24T17:52:00Z", "content": "A team of scientists think theyve found the oldest evidence of a meteorite striking and killing a person, according to a new report published in the journal journal Meteoritics &amp; Planetary Science.\r\nGiven the hype around space rocks hitting Earth, there a… [+2713 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "BCI system gives paralyzed man back his sense of touch with haptic feedback - Ars Technica", "description": "Long-term goal is to develop system that works as well at home as in the laboratory.", "url": "https://arstechnica.com/science/2020/04/bci-system-gives-paralyzed-man-back-his-sense-of-touch-with-haptic-feedback/", "urlToImage": null, "publishedAt": "2020-04-24T17:51:00Z", "content": "Enlarge/ Ian Burkhard suffered a severe spinal cord injury in 2010. Battelle's NeuroLife project is restoring motor function to his right arm with a brain-computer-interface system.\r\n4 with 4 posters participating\r\nIan Burkhart, now 28, had a diving accident … [+7377 chars]"}, {"source": {"id": null, "name": "Inews.co.uk"}, "author": "Claire Schofield", "title": "Starlink satellites tracker: how to watch Elon Musk's SpaceX satellites in the UK tonight, and what you're looking out for - inews", "description": "The satellites appear in a line crossing the night sky and their current orbital position has made them easier to spot in the past few days", "url": "https://inews.co.uk/news/science/starlink-satellites-tracker-elon-musk-spacex-satellite-how-see-uk-tonight-2545078", "urlToImage": null, "publishedAt": "2020-04-24T16:50:00Z", "content": "The satellites appear in a line crossing the night sky and their current orbital position has made them easier to spot in the past few days\r\nStreaks of bright light have been lighting up the night sky since the weekend, with many Brits spotting the UFO-like g… [+3248 chars]"}, {"source": {"id": null, "name": "Upi.com"}, "author": null, "title": "Global warming is undoing decades of progress in marine reserves - UPI.com", "description": "UPI delivers the latest headlines from around the world: Top News, Entertainment, Health, Business, Science and Sports News - United Press International", "url": "https://www.upi.com/", "urlToImage": null, "publishedAt": "2020-04-24T16:37:03Z", "content": "JJ Hofman, 6, tries to snag a roll of toilet paper with a claw machine in Chesterfield, Mo., on April 22. With toilet paper in short supply, the boy's father, James, purchased the machine, replaced stuffed animals with toilet paper and charged neighbors $5 fo… [+151 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Daniel Garcia-Castellanos", "title": "Tomanowos: The meteorite that survived mega-floods and human folly - Phys.org", "description": "The rock with arguably the most fascinating story on Earth has an ancient name: Tomanowos. It means \"the visitor from heaven\" in the extinct language of Oregon's Clackamas Indian tribe.", "url": "https://phys.org/news/2020-04-tomanowos-meteorite-survived-mega-floods-human.html", "urlToImage": null, "publishedAt": "2020-04-24T14:33:54Z", "content": "The rock with arguably the most fascinating story on Earth has an ancient name: Tomanowos. It means \"the visitor from heaven\" in the extinct language of Oregon's Clackamas Indian tribe.\r\nThe Clackamas revered the Tomanowosalso known as the Willamette meteorit… [+6709 chars]"}, {"source": {"id": null, "name": "Tass.com"}, "author": "TASS", "title": "ISS crew evacuated from Soyuz-MS15 on landing - TASS", "description": "The crew has returned to Earth due to the novel coronavirus pandemic", "url": "https://tass.com/science/1146089", "urlToImage": null, "publishedAt": "2020-04-17T06:20:00Z", "content": "MOSCOW, April 17. /TASS/. Roscosmos cosmonaut Oleg Skripochka and NASA astronauts Andrew Morgan and Jessica Meir have been evacuated from the Soyuz MS-15 manned spacecraft, which landed earlier in Kazakhstan, 147 km to the southeast of the city of Zhezqazghan… [+657 chars]"}, {"source": {"id": null, "name": "Travelandleisure.com"}, "author": "Alison Fox", "title": "NASA, Former Astronauts Commemorate the 50th Anniversary of Apollo 13 - Travel + Leisure", "description": "On April 13, 1970, the Apollo 13's lunar landing was aborted in what would become a historic mission.", "url": "https://www.travelandleisure.com/travel-news/apollo-13-mission-50th-anniversary", "urlToImage": null, "publishedAt": "2020-04-14T13:47:15Z", "content": "\"Houston, we've had a problem.\"\r\nFifty years after that famed phrase aboard the Apollo 13 was spoken, legends and institutions of space exploration are taking to a different form of communication to commemorate the historic mission — Twitter.\r\n“They were coas… [+3223 chars]"}, {"source": {"id": null, "name": "Inverse.com"}, "author": "Mike Brown", "title": "How SpaceX Starlink works: price, launch date for Elon Musk's internet - Inverse", "description": "Connecting to Starlink will be really easy, Elon Musk says", "url": "https://www.inverse.com/article/62185-here-s-how-you-will-connect-to-starlink-spacex-s-internet-constellation", "urlToImage": null, "publishedAt": "2020-01-08T19:50:11Z", "content": "Starlink, SpaceXs internet connectivity satellite constellation, is taking form. The project is designed to offer higher speeds and lower latency than competing setups, so long as the receiver can see the satellites in orbit. It could help fund some of CEO El… [+4593 chars]"}]}