{"status": "ok", "totalResults": 46, "articles": [{"source": {"id": null, "name": "Glasgow Live"}, "author": "Shivali Best, Gary Armstrong", "title": "Strawberry Moon in Glasgow - when will you be able to see it? - Glasgow Live", "description": "Did you miss the Strawberry Moon last June? You'll get another chance this week.", "url": "https://www.glasgowlive.co.uk/news/glasgow-news/strawberry-moon-glasgow-friday-time-18349064", "urlToImage": "https://i2-prod.glasgowlive.co.uk/incoming/article18348972.ece/ALTERNATES/s1200/0_JS185722972.jpg", "publishedAt": "2020-06-02T13:12:01Z", "content": "A full Strawberry Moon is set to appear in our skies this week, and it's one you don't want to miss if you're a fan of the night sky.\r\nHowever, don't be fooled by the name - a Strawberry Moon, which … [+1862 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researchers discover a new type of matter inside neutron stars - Phys.org", "description": "A Finnish research group has found strong evidence for the presence of exotic quark matter inside the cores of the largest neutron stars in existence. They reached this conclusion by combining recent results from theoretical particle and nuclear physics to me…", "url": "https://phys.org/news/2020-06-neutron-stars.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/finnishresea.jpg", "publishedAt": "2020-06-02T12:04:55Z", "content": "A Finnish research group has found strong evidence for the presence of exotic quark matter inside the cores of the largest neutron stars in existence. They reached this conclusion by combining recent… [+6187 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Derya Ozdemir", "title": "Mars Does Have a Magnetic Field of Sorts, 'Induced' by Solar Winds - Interesting Engineering", "description": "A NASA spacecraft has mapped the electric currents around Mars that show it does have a magnetic field for the first time.", "url": "https://interestingengineering.com/mars-does-have-a-magnetic-field-of-sorts-induced-by-solar-winds", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/lV6D8evn6x/sizes/mars-header_md.jpg", "publishedAt": "2020-06-02T11:18:20Z", "content": "A NASA spacecraft has mapped the electric currents around Mars for the first time and the trippy visual data hold clues as to why the red planet lost its atmosphere.\r\nIt is common knowledge that Mars… [+2515 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "A better model for neutrophil-related diseases - Mirage News", "description": "Neutrophils are critical immune cells for antimicrobial defense, but they can exacerbate a number of diseases, perhaps including COVID-19. The...", "url": "https://www.miragenews.com/a-better-model-for-neutrophil-related-diseases/", "urlToImage": "https://actu.epfl.ch/static/upload/fckeditorimage/c4/dd/e400dddc.jpg", "publishedAt": "2020-06-02T10:26:14Z", "content": "Neutrophils are critical immune cells for antimicrobial defense, but they can exacerbate a number of diseases, perhaps including COVID-19. The traditional approaches to study neutrophils in animal mo… [+2829 chars]"}, {"source": {"id": null, "name": "Dual Dove"}, "author": "Rada Mateescu", "title": "New Universe Discovery Is Unveiled - Dual Dove", "description": "It’s been just revealed that an analysis of more than 200k spiral galaxies has revealed some pretty unexpected links between spin directions of galaxies and the structures that are formed by …", "url": "https://www.dualdove.com/new-universe-discovery-is-unveiled/10797/", "urlToImage": "https://www.dualdove.com/wp-content/uploads/2020/06/2019.09.18-genesi.jpg", "publishedAt": "2020-06-02T09:16:14Z", "content": "It’s been just revealed that an analysis of more than 200k spiral galaxies has revealed some pretty unexpected links between spin directions of galaxies and the structures that are formed by the link… [+2038 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Terahertz Radiation Can Disrupt Proteins in Living Cells – Contradicting Conventional Belief - SciTechDaily", "description": "Researchers from the RIKEN Center for Advanced Photonics and collaborators have discovered that terahertz radiation, contradicting conventional belief, can disrupt proteins in living cells without killing the cells. This finding implies that terahertz radiati…", "url": "https://scitechdaily.com/terahertz-radiation-can-disrupt-proteins-in-living-cells-contradicting-conventional-belief/", "urlToImage": "https://scitechdaily.com/images/Terahertz-Radiation-Cells-Illustration.jpg", "publishedAt": "2020-06-02T09:00:20Z", "content": "Researchers from the RIKEN Center for Advanced Photonics and collaborators have discovered that terahertz radiation, contradicting conventional belief, can disrupt proteins in living cells without ki… [+3192 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Evan Gough, Universe Today", "title": "Astronomers Have Filmed a Black Hole Blasting Out Jets Close to The Speed of Light - ScienceAlert", "description": "The Chandra X-Ray Observatory has spotted a distant black hole shooting out jets of material, at close to the speed of light. No worries, this beast is about 10,000 light years away from us. It's more of a spectacle than a danger.", "url": "https://www.sciencealert.com/black-hole-seen-blasting-out-jets-at-close-to-the-speed-of-light", "urlToImage": "https://www.sciencealert.com/images/2020-06/processed/BlackHoleJets_1024.gif", "publishedAt": "2020-06-02T08:03:39Z", "content": "The Chandra X-Ray Observatory has spotted a distant black hole shooting out jets of material, at close to the speed of light. No worries, this beast is about 10,000 light years away from us. It's mor… [+5025 chars]"}, {"source": {"id": null, "name": "World Socialist Web Site"}, "author": "Bryan Dyne", "title": "SpaceX launch of astronauts marks new stage of the privatization of space exploration - World Socialist Web Site", "description": "The fact that the event was so heavily promoted by SpaceX founder and billionaire Elon Musk, the American media and President Donald Trump should give the excitement around the launch pause.", "url": "https://www.wsws.org/en/articles/2020/06/02/spac-j02.html", "urlToImage": "https://www.wsws.org/asset/c41b5f01-1430-4c98-89b0-54b1dd644db7/image.jpg", "publishedAt": "2020-06-02T07:35:47Z", "content": "SpaceX launch of astronauts marks new stage of the privatization of space exploration\r\nBy\r\n Bryan Dyne\r\n 2 June 2020\r\nOn Saturday, May 30, SpaceX corporation successfully launched the Demo-2 mission,… [+11374 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Large Simulation Finds New Origin of Supermassive Black Holes - Mirage News", "description": "Snapshots of the simulations showing the distribution of matter in the Universe at the time of black hole formation (top) and the density distribution of...", "url": "https://www.miragenews.com/large-simulation-finds-new-origin-of-supermassive-black-holes/", "urlToImage": "https://www.nao.ac.jp/en/contents/news/science/2020/20200602-cfca-fig.jpg", "publishedAt": "2020-06-02T05:14:53Z", "content": "Snapshots of the simulations showing the distribution of matter in the Universe at the time of black hole formation (top) and the density distribution of black hole-producing gas clouds (bottom). In … [+3919 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Space X Falcon-9 Rocket Manned Space Launch 2020 - WHAS11", "description": "The Coast Guard Cutter Moray (WPB-87331) patrols the waters near the Space X Falcon 9 Crew Dragon launch site May 30, 2020 to ensure vessels stay out of the ...", "url": "https://www.youtube.com/watch?v=cFd0j1vTTp8", "urlToImage": "https://i.ytimg.com/vi/cFd0j1vTTp8/maxresdefault.jpg", "publishedAt": "2020-06-02T03:15:06Z", "content": "The Coast Guard Cutter Moray (WPB-87331) patrols the waters near the Space X Falcon 9 Crew Dragon launch site May 30, 2020 to ensure vessels stay out of the security and safety zones during the launc… [+935 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Anxious wait as sun 'wakes up' | News Mail - News Mail", "description": "A surge in solar activity has been detected as the sun enters a new stage, but what impact will it have on Earth?", "url": "https://www.news.com.au/technology/science/space/nasa-says-biggest-solar-flare-in-three-years-could-be-sun-waking-up/news-story/5a433c9ff99fdcb6cd50743dbdbb4966", "urlToImage": "https://media.apnarm.net.au/media/images/2020/06/02/v3imagesbin23b3f944a9d5403a69ff1d30c7b63a8d-27s7ujeb178ac31sfu2_ct1880x930.jpg", "publishedAt": "2020-06-02T00:33:00Z", "content": "US space agency NASA has said the sun's solar cycle could be \"waking up\" after the biggest solar flare recorded in almost three years.\r\nNASA spacecraft spotted the new family of sunspots appearing on… [+2412 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Astronauts speak from International Space Station - Associated Press", "description": "Newly arrived NASA astronauts Bob Behnken and Doug Hurley, joined by astronaut Chris Cassidy, participated in a press conference on the International Space S...", "url": "https://www.youtube.com/watch?v=m1x1gEwz_RE", "urlToImage": "https://i.ytimg.com/vi/m1x1gEwz_RE/maxresdefault.jpg", "publishedAt": "2020-06-01T23:02:59Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Brittany Enos", "title": "Asteroids Ryugu and Bennu were formed by the destruction of a large asteroid - Phys.org", "description": "Scientists with NASA's first asteroid sample return mission, OSIRIS-REx, are gaining a new understanding of asteroid Bennu's carbon-rich material and signature \"spinning-top\" shape. The team, led by the University of Arizona, has discovered that the asteroid'…", "url": "https://phys.org/news/2020-05-asteroids-ryugu-bennu-destruction-large.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/theasteroids.jpg", "publishedAt": "2020-06-01T22:34:05Z", "content": "Scientists with NASA's first asteroid sample return mission, OSIRIS-REx, are gaining a new understanding of asteroid Bennu's carbon-rich material and signature \"spinning-top\" shape. The team, led by … [+5047 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Kirigami shoe grips could help reduce risk of falling among older adults - News-Medical.Net", "description": "You've never seen a pair of snake skin shoes like this before.", "url": "https://www.news-medical.net/news/20200601/Kirigami-shoe-grips-could-help-reduce-risk-of-falling-among-older-adults.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2fSeniors-620x480.jpg", "publishedAt": "2020-06-01T21:46:16Z", "content": "Reviewed by Emily Henderson, B.Sc.Jun 1 2020\r\nYou've never seen a pair of snake skin shoes like this before.\r\nResearchers at the Harvard John A. Paulson School of Engineering and Applied Sciences (SE… [+2964 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Mike Wehner", "title": "Incredible video shows SpaceX’s Starship prototype exploding - BGR", "description": "SpaceX’s Starship prototype SN4 exploded during a static fire test on Friday, just hours before the second launch attempt of the Crew Dragon. The two projects are completely different and the explosion had no impact on the NASA mission. Video of the explosion…", "url": "https://bgr.com/2020/06/01/starship-explosion-spacex-static-fire-test-video/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2020/06/screen-shot-2020-06-01-at-12.27.51-pm.png", "publishedAt": "2020-06-01T21:22:07Z", "content": "<ul><li>SpaceX’s Starship prototype SN4 exploded during a static fire test on Friday, just hours before the second launch attempt of the Crew Dragon. </li><li>The two projects are completely differen… [+2594 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "https://www.facebook.com/13ericralph31", "title": "SpaceX raises more than half a billion dollars for Starship, Starlink programs - Teslarati", "description": "In the last three months, SpaceX has managed to raise more than half a billion dollars from private investors, money that will likely go directly into the company’s ambitious Starship and Starlink programs. Despite a huge amount of public focus now placed on …", "url": "https://www.teslarati.com/spacex-starship-starlink-investment-round/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2020/06/Starship-Super-Heavy-Starlink-SpaceX-1-c-1024x490.jpg", "publishedAt": "2020-06-01T20:24:49Z", "content": "In the last three months, SpaceX has managed to raise more than half a billion dollars from private investors, money that will likely go directly into the company’s ambitious Starship and Starlink pr… [+4351 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Scientists detect Crab Nebula using innovative gamma-ray telescope - Mirage News", "description": "Scientists in the Cherenkov Telescope Array (CTA) consortium today announced at the 236th meeting of the American Astronomical Society (AAS) that they...", "url": "https://www.miragenews.com/scientists-detect-crab-nebula-using-innovative-gamma-ray-telescope/", "urlToImage": "https://d26toa8f6ahusa.cloudfront.net/wp-content/uploads/2020/06/01133258/FredWhipple_WEB_Header-150x150.jpg", "publishedAt": "2020-06-01T20:02:12Z", "content": "Scientists in the Cherenkov Telescope Array (CTA) consortium today announced at the 236th meeting of the American Astronomical Society (AAS) that they have detected gamma rays from the Crab Nebula us… [+7720 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Passant Rabie", "title": "Interstellar object Oumuamua may be a giant chunk of hydrogen ice - Inverse", "description": "Since its discovery in 2017, scientists have not been able to explain the odd properties of Oumuamua but an equally odd origin story could be the answer.", "url": "https://www.inverse.com/science/oumuamua-hydrogen-ice", "urlToImage": "https://imgix.bustle.com/uploads/image/2020/6/1/a19b6641-c903-4ac9-89f3-9234437d96b3-621_eso1737b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "publishedAt": "2020-06-01T19:36:56Z", "content": "On September 9, 2017, a rocky, elongated body sort of shaped like a cosmic cigar visited our Solar System from beyond the realms of the Sun the first ever recorded interstellar object to cruise throu… [+4734 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "ASKAP Telescope Traces Four Fast Radio Bursts to Massive Galaxies | Astronomy - Sci-News.com", "description": "Astronomers using the Australian SKA Pathfinder (ASKAP) telescope at CSIRO’s Murchison Radio-astronomy Observatory have tracked four mysterious blasts of cosmic radio waves back to their home galaxies.", "url": "http://www.sci-news.com/astronomy/askap-four-fast-radio-bursts-08488.html", "urlToImage": "http://cdn.sci-news.com/images/2020/06/image_8488f-Fast-Radio-Bursts.jpg", "publishedAt": "2020-06-01T19:31:30Z", "content": "Astronomers using the Australian SKA Pathfinder (ASKAP) telescope at CSIROs Murchison Radio-astronomy Observatory have tracked four mysterious blasts of cosmic radio waves back to their home galaxies… [+3365 chars]"}, {"source": {"id": null, "name": "The Sun"}, "author": "Debbie White", "title": "What is Anonymous? Hacker group that has re-emerged over George Floyd protests - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/3885265/what-anonymous-hacker-george-floyd-protests/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2017/11/NINTCHDBPICT000586240794-e1591023759412.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-06-01T17:25:42Z", "content": "\"HACKTIVIST\" group Anonymous has sprung back into life - apparently disabling the Minneapolis Police Department website in protest against George Floyd's death.\r\nThe force has been warned that more o… [+2513 chars]"}, {"source": {"id": null, "name": "Brinkwire.com"}, "author": null, "title": "Like a treasure map, brain region emphasizes reward location. - Brinkwire", "description": null, "url": "https://en.brinkwire.com/news/like-a-treasure-map-brain-region-emphasizes-reward-location/", "urlToImage": null, "publishedAt": "2020-06-01T16:45:33Z", "content": "We are free to wander but usually when we go somewhere it’s for a reason. In a new study, researchers at The Picower Institute for Learning and Memory show that as we pursue life’s prizes a region of… [+3435 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Scientists find oldest fossil of a land animal - CBC.ca", "description": "A fossilized millipede-like creature discovered in Scotland may represent the oldest-known land animal, a humble pioneer of terrestrial living 425 million years ago that helped pave the way for the throngs that would eventually inhabit Earth's dry parts.", "url": "https://www.cbc.ca/news/technology/oldest-land-animal-1.5592917", "urlToImage": "https://i.cbc.ca/1.5592919.1591016437!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/science-millipede.JPG", "publishedAt": "2020-06-01T16:45:00Z", "content": "A fossilized millipede-like creature discovered in Scotland may represent the oldest-known land animal, a humble pioneer of terrestrial living 425 million years ago that helped pave the way for the t… [+1747 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Cascade to criticality - Mirage News", "description": "Combined theoretical and experimental work unveils a novel mechanism through which criticality emerges in quasiperiodic structures - a finding that...", "url": "https://www.miragenews.com/cascade-to-criticality/", "urlToImage": "https://www.phys.ethz.ch/news-and-events/d-phys-news/2020/06/the-cascade-to-criticality/_jcr_content/news_content/fullwidthimage/image.imageformat.fullwidth.59144533.png", "publishedAt": "2020-06-01T15:50:16Z", "content": "The essence, and beauty, of quasiperiodic structures can be grasped by considering floor plates. A floor can be readily tiled without gaps using identical pieces of, for example, triangular, square o… [+5983 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Finnish researchers have discovered a new type of matter inside neutron stars - EurekAlert", "description": "A Finnish research group has found strong evidence for the presence of exotic quark matter inside the cores of the largest neutron stars in existence. The conclusion was reached by combining recent results from theoretical particle and nuclear physics to meas…", "url": "https://www.eurekalert.org/pub_releases/2020-06/uoh-frh060120.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/233356_web.jpg", "publishedAt": "2020-06-01T15:47:59Z", "content": "IMAGE: Confirming the existence of quark cores inside neutron stars has been one of the most important goals of neutron star physics for the last 40 years.\r\n view more \r\nCredit: Jyrki Hokkanen, CSC -… [+6530 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Science X staff", "title": "These flexible feet help robots walk faster - Tech Xplore", "description": "Roboticists at the University of California San Diego have developed flexible feet that can help robots walk up to 40 percent faster on uneven terrain such as pebbles and wood chips. The work has applications for search-and-rescue missions as well as space ex…", "url": "https://techxplore.com/news/2020-06-flexible-feet-robots-faster.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/theseflexibl.jpg", "publishedAt": "2020-06-01T15:46:34Z", "content": "Roboticists at the University of California San Diego have developed flexible feet that can help robots walk up to 40 percent faster on uneven terrain such as pebbles and wood chips. The work has app… [+4122 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Laura Arenschield", "title": "The Milky Way has one very hot halo, astronomers find - Phys.org", "description": "The halo that surrounds our own Milky Way galaxy is much hotter than scientists once believed—and it may not be unique among galaxies.", "url": "https://phys.org/news/2020-06-milky-hot-halo-astronomers.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/milkyway.jpg", "publishedAt": "2020-06-01T15:22:23Z", "content": "The halo that surrounds our own Milky Way galaxy is much hotter than scientists once believedand it may not be unique among galaxies.\r\nThe new findings were presented at the annual meeting of the Ame… [+3426 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Study shows dry air drives overlooked changes in how plants drink and breathe - Phys.org", "description": "Plants drink up much of the water that falls to Earth. They take what they need before releasing it through tiny holes on the underside of their leaves, just as people release water vapor with every exhale.", "url": "https://phys.org/news/2020-06-air-overlooked.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2017/plant.jpg", "publishedAt": "2020-06-01T15:22:20Z", "content": "Plants drink up much of the water that falls to Earth. They take what they need before releasing it through tiny holes on the underside of their leaves, just as people release water vapor with every … [+5128 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Hot stars are plagued by giant magnetic spots - Phys.org", "description": "Astronomers using European Southern Observatory (ESO) telescopes have discovered giant spots on the surface of extremely hot stars hidden in stellar clusters. Not only are these stars plagued by magnetic spots, some also experience superflare events, explosio…", "url": "https://phys.org/news/2020-06-hot-stars-plagued-giant-magnetic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/hotstarsarep.jpg", "publishedAt": "2020-06-01T15:22:15Z", "content": "Astronomers using European Southern Observatory (ESO) telescopes have discovered giant spots on the surface of extremely hot stars hidden in stellar clusters. Not only are these stars plagued by magn… [+5063 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Monitoring Environmental Exposures in Dogs Could be Early Warning System for Human Health - Mirage News", "description": "June 1, 2020 Image: NC State University Man's best friend may also be man's best bet for figuring out how...", "url": "https://www.miragenews.com/monitoring-environmental-exposures-in-dogs-could-be-early-warning-system-for-human-health/", "urlToImage": "https://news.ncsu.edu/wp-content/uploads/2020/06/dog1500.jpg", "publishedAt": "2020-06-01T15:17:43Z", "content": "Man’s best friend may also be man’s best bet for figuring out how environmental chemicals could impact our health. Researchers from North Carolina State University and Duke University’s Nicholas Scho… [+2963 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Now Complete, Telescope Instrument is Poised to Begin Its Search for Answers About Dark Energy - Mirage News", "description": "This video contains animations showing how the complex components of the Dark Energy Spectroscopic Instrument, installed on the Mayall Telescope at Kitt...", "url": "https://www.miragenews.com/now-complete-telescope-instrument-is-poised-to-begin-its-search-for-answers-about-dark-energy/", "urlToImage": "https://newscenter.lbl.gov/wp-content/uploads/sites/2/2020/06/DESI-component-installation-sm.jpg", "publishedAt": "2020-06-01T15:06:13Z", "content": "This video contains animations showing how the complex components of the Dark Energy Spectroscopic Instrument, installed on the Mayall Telescope at Kitt Peak National Observatory near Tucson, Arizona… [+3934 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Large droplet sorting now possible at high speeds - Phys.org", "description": "Bioengineers from UCLA and University of Tokyo have significantly increased the speed at which large liquid droplets, potentially containing individual live cells, can be sorted intact and in bulk.", "url": "https://phys.org/news/2020-06-large-droplet-high.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/5ed50cdb50655.jpg", "publishedAt": "2020-06-01T14:19:53Z", "content": "Bioengineers from UCLA and University of Tokyo have significantly increased the speed at which large liquid droplets, potentially containing individual live cells, can be sorted intact and in bulk.\r\n… [+3986 chars]"}, {"source": {"id": null, "name": "Wsu.edu"}, "author": "", "title": "Researchers develop viable sodium battery - WSU News", "description": "The team reports one of the best results to date for a sodium-ion battery. It is able to deliver a capacity similar to a low-end lithium-ion battery and to recharge successfully, keeping more than 80 percent of its charge after 1,000 cycles.", "url": "https://news.wsu.edu/2020/06/01/researchers-develop-viable-sodium-battery/", "urlToImage": "https://s3.wp.wsu.edu/uploads/sites/609/2020/05/Song.jpg", "publishedAt": "2020-06-01T13:00:01Z", "content": "WSU PhD graduate Junhua Song and colleagues created a sodium-ion battery that holds as much energy and works as well as some commercial lithium-ion battery chemistries.\r\nBy Tina Hilding, Voiland Coll… [+4362 chars]"}, {"source": {"id": null, "name": "Business Insider Australia"}, "author": "Aylin Woodward", "title": "Earth's magnetic field first formed thanks to a magma ocean, research shows. That means more planets in the universe could have atmospheres than we thought. - Business Insider Australia", "description": "Earth’s magnetic field shields the planet from deadly and destructive solar radiation. Without it, solar winds could strip Earth of its oceans and atmosphere – killing everything on the planet.", "url": "https://www.businessinsider.com.au/magma-ocean-inside-earth-kickstarted-magnetic-field-first-2020-2", "urlToImage": "https://i.insider.com/5e504e57fee23d7c482e1f16", "publishedAt": "2020-06-01T12:09:00Z", "content": "<ul><li>\r\nOur planet’s magnetic field, which protects our atmosphere from deadly solar winds, has been in place for at least 3.4 billion years.\r\n</li><li>\r\nFor the last 1 billion years, a swirling la… [+5426 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "William Harwood", "title": "SpaceX Crew Dragon chalks up picture-perfect docking at International Space Station - CBS News", "description": "The successful docking boosted the lab's crew to five and marked a major milestone for NASA.", "url": "https://www.cbsnews.com/news/spacex-crew-dragon-docking-international-space-station/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/05/31/20a9f7a0-45d6-4007-91ea-61d5783cd52f/thumbnail/1200x630/bb6d7fea589de8b06cfc3014d5a48a75/053120-approach.jpg", "publishedAt": "2020-06-01T10:32:04Z", "content": "Nineteen hours after a spectacular Florida launch, SpaceX's Crew Dragon capsule caught up with the International Space Station early Sunday and glided in for a problem-free docking, bringing veteran … [+7407 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "John Marshall", "title": "Prehistoric climate change damaged the ozone layer and led to a mass extinction - The Conversation UK", "description": "New research on the Late Devonian extinction suggests the ozone layer could be naturally depleted as the temperature rises.", "url": "https://theconversation.com/prehistoric-climate-change-damaged-the-ozone-layer-and-led-to-a-mass-extinction-139519", "urlToImage": "https://images.theconversation.com/files/338387/original/file-20200528-51509-l9s17i.jpg?ixlib=rb-1.1.0&rect=440%2C655%2C4230%2C2110&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2020-06-01T10:22:00Z", "content": "Mass extinctions are very important to how life evolved on Earth. For example, when an asteroid hit the Earth 66 million years ago, the resulting dinosaur extinction led mammals to take their place. … [+5333 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rachel England", "title": "Scientists find the universe's 'missing matter' using mysterious cosmic bursts - Yahoo Finance Australia", "description": "One of astrophysics' longest-running mysteries has been solved.", "url": "https://au.finance.yahoo.com/news/scientists-find-the-universes-missing-matter-using-cosmic-bursts-094512061.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/FrUjPleJnwE7HbGz2Na8kw--~B/aD00OTEyO3c9NzM2MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-01/64de15b0-4057-11ea-bf9f-6f57d28b3169", "publishedAt": "2020-06-01T09:45:00Z", "content": "Thanks to some pretty rigorous scientific calculations, researchers have long been able to determine how much matter there was in the universe when the Big Bang happened. The problem until now is tha… [+1963 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Disorder in fish shoals may reap rewards at dinner time - Mirage News", "description": "Binocular visual fields of three-spined sticklebacks in an ordered group (above) and in a disordered group (below). Groups of three-spined sticklebacks...", "url": "https://www.miragenews.com/disorder-in-fish-shoals-may-reap-rewards-at-dinner-time/", "urlToImage": "https://www.bristol.ac.uk/media-library/sites/news/2020/jun/Fish%20shoal%20article.jpg", "publishedAt": "2020-06-01T09:26:10Z", "content": "The advantages of animals foraging in an orderly group are well-known, but research by the University of Bristol has found an element of unruly adventure can help fish in the quest for food.The study… [+3372 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "ScienceAlert Staff", "title": "Strange, 'Never-Before-Seen' Asteroid Turns Out to Be Something Much More Common - ScienceAlert", "description": "Earlier this month, astronomers announced the discovery of something incredible - a brand new type of asteroid... with a tail.", "url": "https://www.sciencealert.com/strange-never-before-seen-asteroid-turns-out-to-be-something-much-more-common", "urlToImage": "https://www.sciencealert.com/images/2020-05/processed/2019-ld2_1024.jpg", "publishedAt": "2020-06-01T07:44:14Z", "content": "Earlier this month, astronomers announced the discovery of something incredible - a brand new type of asteroid... with a tail.\r\nBut in an update, the researchers have announced their original classif… [+3320 chars]"}, {"source": {"id": null, "name": "Carsales.com.au"}, "author": "carsales", "title": "Tesla plotting junior Cybertruck EV - motoring.com.au - Motoring", "description": "CEO Elon Musk confirms \"smaller\" Tesla Cybertruck under consideration; would rival Toyota HiLux ute", "url": "https://www.carsales.com.au/editorial/details/tesla-plotting-junior-cybertruck-ev-124507/", "urlToImage": "https://editorial.pxcrush.net/carsales/general/editorial/tesla-cybertruck-6-pcqh.jpg", "publishedAt": "2020-06-01T07:38:22Z", "content": "The Tesla Cybertruck EV could get a little brother roughly the same size as the most popular utes in Australia, such as the Ford Ranger and Mitsubishi Triton.\r\nThat's the word from Tesla CEO Elon Mus… [+1847 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Ethan Siegel", "title": "Did Hubble Just Find New Stars Where Planets Are Impossible? - Forbes", "description": "Maybe 100% of stars don't have planets, after all.", "url": "https://www.forbes.com/sites/startswithabang/2020/06/01/did-hubble-just-find-new-stars-where-planets-are-impossible/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fblogs-images.forbes.com%2Fstartswithabang%2Ffiles%2F2020%2F05%2Fheic1509a-1200x899.jpg", "publishedAt": "2020-06-01T06:09:32Z", "content": "This NASA/ESA Hubble Space Telescope image of the cluster Westerlund 2 and its surroundings was... [+] released to celebrate Hubbles 25th year in orbit. The images central region, containing the star… [+6927 chars]"}, {"source": {"id": null, "name": "Abs-cbn.com"}, "author": "Agence France-Presse", "title": "'Trampoline is working': Elon Musk taunts Russia - ABS-CBN News", "description": "MOSCOW - Russian space agency chief Dmitry Rogozin once ridiculed the lack of a US manned flight program, saying it might as well \"deliver its astronauts to the ISS by using a trampoline\".", "url": "https://news.abs-cbn.com/classified-odd/06/01/20/trampoline-is-working-elon-musk-taunts-russia", "urlToImage": "https://sa.kapamilya.com/absnews/abscbnnews/media/2020/news/06/01/20200601-elon-musk-rtr.jpg?ext=.jpg", "publishedAt": "2020-06-01T05:54:00Z", "content": "MOSCOW - Russian space agency chief Dmitry Rogozin once ridiculed the lack of a US manned flight program, saying it might as well \"deliver its astronauts to the ISS by using a trampoline\".\r\nSix years… [+1548 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA's 1st human spaceflight from US soil in a decade | Space X | Donald Trump - WION", "description": "NASA's 1st human spaceflight from US soil in a decade | Space X | Donald Trump NASA astronauts entered the International Space Station on Sunday after a land...", "url": "https://www.youtube.com/watch?v=379c0XSvcL0", "urlToImage": "https://i.ytimg.com/vi/379c0XSvcL0/maxresdefault.jpg", "publishedAt": "2020-06-01T02:47:32Z", "content": null}, {"source": {"id": null, "name": "Jakarta Post"}, "author": "The Jakarta Post", "title": "Millipede from Scotland is world's oldest-known land animal - The Jakarta Post - Jakarta Post", "description": "A fossilized millipede-like creature discovered in Scotland may represent the oldest-known land animal, a humble pioneer of terrestrial living 425 million years ago that helped pave the way for the throngs that would eventually inhabit Earth's dry parts.", "url": "https://www.thejakartapost.com/life/2020/05/31/millipede-from-scotland-is-worlds-oldest-known-land-animal.html", "urlToImage": "https://img.jakpost.net/c/2020/05/31/2020_05_31_96512_1590897802._large.jpg", "publishedAt": "2020-06-01T00:01:00Z", "content": "A fossilized millipede-like creature discovered in Scotland may represent the oldest-known land animal, a humble pioneer of terrestrial living 425 million years ago that helped pave the way for the t… [+1809 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Extended Parenting Helps Young Birds Grow Smarter - Mirage News", "description": "A new study of corvid birds underscores how biology, environment, and social life allow young birds and humans to learn difficult skills that improve...", "url": "https://www.miragenews.com/extended-parenting-helps-young-birds-grow-smarter/", "urlToImage": "https://www.shh.mpg.de/1715623/original-1590907146.jpeg?t=eyJ3aWR0aCI6MjQ2LCJvYmpfaWQiOjE3MTU2MjN9--b8e6a1a4c9a0c1b1861d7fcd535705b260a11743", "publishedAt": "2020-05-31T23:12:11Z", "content": "A new study of corvid birds underscores how biology, environment, and social life allow young birds and humans to learn difficult skills that improve survival\r\nThe current study analyzes social and l… [+5971 chars]"}, {"source": {"id": null, "name": "SatelliteProME.com"}, "author": null, "title": "China launches new experimental crew spacecraft on Long March 5B rocket - SatelliteProME.com", "description": "Specially developed for China's manned space programme, Long March-5B will be mainly used to launch the modules of the space station.", "url": "https://satelliteprome.com/news/china-launches-new-experimental-crew-spacecraft-on-long-march-5b-rocket/", "urlToImage": "https://satelliteprome.com/wp-content/uploads/2020/05/china.jpg", "publishedAt": "2020-05-31T16:29:54Z", "content": "Specially developed for China's manned space programme, Long March-5B will be mainly used to launch the modules of the space station.\r\nChina’s new large carrier rocket Long March-5B made its maiden f… [+1160 chars]"}, {"source": {"id": null, "name": "InsideEVs "}, "author": "Eric Loveday", "title": "Watch NASA Astronauts Take Tesla Model X To Launch Pad For Manned SpaceX Flight - InsideEVs ", "description": "Taking an electric ride before the big ride.", "url": "https://insideevs.com/news/425641/nasa-tesla-model-x-launch/", "urlToImage": "https://cdn.motor1.com/images/mgl/kXbPx/s1/tesla.jpg", "publishedAt": "2020-05-31T13:28:03Z", "content": "Astronauts Bob and Doug hitch a ride to their rocket aboard a Tesla Model X. This SpaceX manned flight marks a major milestone in U.S. history.\r\nMillions watched as NASA astronauts got into a Tesla M… [+2467 chars]"}]}