{"status": "ok", "totalResults": 35, "articles": [{"source": {"id": null, "name": "Brobible.com"}, "author": "Douglas Charles", "title": "Heads Up, There Is An 1,100 Foot Wide Asteroid Heading Our Way And It’s Going To Get Very, Very Close - BroBible", "description": "Mark your calendars. April 13, 2029. That’s the day a…", "url": "https://brobible.com/culture/article/1100-foot-wide-apophis-asteroid-2029/", "urlToImage": "https://brobible.files.wordpress.com/2020/05/1100-foot-wide-apophis-asteroid-heading-towards-earth-in-2029.jpg?quality=90&w=650", "publishedAt": "2020-05-07T13:25:26Z", "content": "iStockphoto\r\nMark your calendars. April 13, 2029. That’s the day a monstrous 1,100 foot wide asteroid is going to go zooming by Earth at a rather alarmingly close distance from the planet.\r\nIn fact, when asteroid 99942 Apophis (2004 MN4) buzzes our planet it … [+3929 chars]"}, {"source": {"id": null, "name": "Thenewdaily.com.au"}, "author": null, "title": "Black hole discovered just 1000 light-years away - The New Daily", "description": "Astronomers have found a the closest yet black hole to Earth than ever before – it's just 1000 light years away.", "url": "https://thenewdaily.com.au/life/science/2020/05/07/black-hole-found-close/", "urlToImage": "https://1v1d1e1lmiki1lgcvx32p49h8fe-wpengine.netdna-ssl.com/wp-content/uploads/2020/05/12222040-3x2-xlarge-960x600.jpg", "publishedAt": "2020-05-07T12:32:37Z", "content": "Astronomers have discovered the closest known black hole to Earth it’s just 1000 light years away.\r\nOf course, each light year is 9.5 trillion kilometres, but it’s still a darn sight closer than the next one along 3200 light-years away from Earth.\r\nThe new di… [+2473 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Jason Murdock", "title": "Kremlin Says Trump's Moon-Mining 'Artemis Accords' Plans Need 'Analysis' - Newsweek", "description": "Kremlin spokesperson Dmitry Peskov told reporters authorities are aware of the draft proposals but stressed they will need \"thorough analysis... from the existing international law standpoint.\"", "url": "https://www.newsweek.com/russia-kremlin-artemis-accords-donald-trump-draft-space-moon-mining-proposals-1502528", "urlToImage": "https://d.newsweek.com/en/full/1588001/moon.jpg", "publishedAt": "2020-05-07T12:08:12Z", "content": "Draft proposals from the Trump administration about mining on the moon need to be reviewed to ensure they comply with law, Kremlin officials say.\r\nKremlin spokesperson Dmitry Peskov told reporters yesterday authorities are aware of the so-called \"Artemis Acco… [+2847 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "While the rest of the world suffers, China decides to keep the 'space wars going' - Sky News Australia", "description": "Sky News host Paul Murray while the western world has been \"deeply suffering for the failures of the Chinese government,\" China launched another rocket into ...", "url": "https://www.youtube.com/watch?v=sylKoP8NeP8", "urlToImage": "https://i.ytimg.com/vi/sylKoP8NeP8/maxresdefault.jpg", "publishedAt": "2020-05-07T11:53:32Z", "content": "Sky News host Paul Murray while the western world has been \"deeply suffering for the failures of the Chinese government,\" China launched another rocket into space signifying another step towards building its own space station.\r\nMr Murray said as many Australi… [+378 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Hannah Osborne", "title": "Earth's Magnetic North Pole is Being Dragged Toward Siberia and Scientists Now Know Why - Newsweek", "description": "A magnetic patch under Canada has become weaker, allowing a competing \"lobe\" to take control.", "url": "https://www.newsweek.com/earth-magnetic-field-unexpected-movement-explained-1502533", "urlToImage": "https://d.newsweek.com/en/full/1587998/magnetic-field.jpg", "publishedAt": "2020-05-07T11:47:00Z", "content": "Last year, scientists announced Earth's magnetic north pole was moving toward Siberia at an unusually fast rate and they could not explain why. It had moved so far, so quickly, there had to be an unscheduled update to the World Magnetic Model (WMM), the repre… [+3165 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jackson Barron For Daily Mail Australia", "title": "Spectacular 'Super Flower Moon' and meteor shower are set to light up Australian skies TONIGHT - Daily Mail", "description": "A spectacular super flower moon will rise over Australia on Thursday evening.", "url": "https://www.dailymail.co.uk/news/article-8295919/Spectacular-Super-Flower-Moon-meteor-shower-set-light-Australian-skies-TONIGHT.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/07/09/28107504-0-image-a-22_1588840928575.jpg", "publishedAt": "2020-05-07T11:37:16Z", "content": "A spectacular 'super flower moon' and accompanying meteor shower are set to light up the Australian sky.\r\nThe moon will be the final super moon of the year, which happens when a full moon coincides with the moon being at its closest point to Earth in its orbi… [+1425 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Michelle Starr", "title": "Carbon Emissions Detected From The Moon Could Force a Major Rethink of Lunar Origins - ScienceAlert", "description": "A spacecraft orbiting the Moon has detected something really peculiar. Our satellite is emitting a steady stream of carbon ions from almost its entire surface, contrary to the long-standing thinking that the Moon is depleted of carbon and other volat", "url": "https://www.sciencealert.com/the-moon-is-emitting-carbon-putting-our-formation-theory-to-question", "urlToImage": "https://www.sciencealert.com/images/2020-05/processed/moon-carbon_1024.jpg", "publishedAt": "2020-05-07T06:18:49Z", "content": "A spacecraft orbiting the Moon has detected something really peculiar. Our satellite is emitting a steady stream of carbon ions from almost its entire surface, contrary to the long-standing thinking that the Moon is depleted of carbon and other volatile eleme… [+3217 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Peter Dockrill", "title": "In 1110, The Moon Vanished From The Sky. We Might Finally Know What Caused It - ScienceAlert", "description": "Almost a millennium ago, a major upheaval occurred in Earth's atmosphere: a giant cloud of sulphur-rich particles flowed throughout the stratosphere, turning skies dark for months or even years, before ultimately falling down to Earth.", "url": "https://www.sciencealert.com/mysterious-forgotten-volcanic-eruptions-in-history-revealed-by-dark-lunar-eclipse", "urlToImage": "https://www.sciencealert.com/images/2020-05/processed/010-lunar-eclipse_1024.jpg", "publishedAt": "2020-05-07T05:44:20Z", "content": "Almost a millennium ago, a major upheaval occurred in Earth's atmosphere: a giant cloud of sulphur-rich particles flowed throughout the stratosphere, turning skies dark for months or even years, before ultimately falling down to Earth.\r\nWe know this event hap… [+5706 chars]"}, {"source": {"id": null, "name": "Zdnet.com"}, "author": "Asha Barbaschow", "title": "Australian universities tout cancer detection devices and future telco innovation - ZDNet", "description": "The Australian National University has developed tiny devices aimed at helping identify cancer, meanwhile, the University of Sydney is hoping to use light and sound for future telecommunications innovations.", "url": "https://www.zdnet.com/article/australian-universities-tout-cancer-detection-devices-and-telco-innovation/", "urlToImage": "https://zdnet1.cbsistatic.com/hub/i/r/2020/05/07/f565bad4-bef3-42f2-9ac6-340e3ce4988b/thumbnail/770x578/8f05d7dd39400ba1d355e52814954cdc/anu.png", "publishedAt": "2020-05-07T04:34:00Z", "content": "Image: Australian National University\r\nScientists from the Australian National University (ANU), alongside the University of Strathclyde and Oxford University in the UK, have announced the development of new miniature devices that could be used to detect canc… [+4093 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Alan Boyle", "title": "Space Force will test solar power transmission during X-37B space plane’s next mystery flight - Yahoo Tech", "description": "When a Boeing-built X-37B space plane is sent into orbit this month for the test program's sixth flight, it will try out a technology that's been more than a decade in the making: space-based solar power. An experiment designed by the U.S. Naval Research Labo…", "url": "https://finance.yahoo.com/news/space-force-test-solar-power-003337866.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/TKh.cfQAkHrl.G1zjF3Xvg--~B/aD00MjA7dz02MzA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/geekwire_312/fd73d323ddb2950b2e559ad1d78216ac", "publishedAt": "2020-05-07T00:54:17Z", "content": "When a Boeing-built X-37B space plane is sent into orbit this month for the test programs sixth flight, it will try out a technology thats been more than a decade in the making: space-based solar power.\r\nAn experiment designed by the U.S. Naval Research Labor… [+3511 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NASA Science Live: On Ice - NASA", "description": "Join NASA ice experts as we discuss important science about Earth's icy regions, and how it can impact us here in warmer environments. NASA’s ICESat-2 missio...", "url": "https://www.youtube.com/watch?v=jQaxUUraV_c", "urlToImage": "https://i.ytimg.com/vi/jQaxUUraV_c/maxresdefault.jpg", "publishedAt": "2020-05-06T19:00:10Z", "content": "Join NASA ice experts as we discuss important science about Earth's icy regions, and how it can impact us here in warmer environments. NASAs ICESat-2 mission uses a laser instrument on a satellite to precisely measure ice and just released new findings about … [+318 chars]"}, {"source": {"id": null, "name": "News-medical.net"}, "author": null, "title": "New anti-phage defense mechanism in bacteria protects their DNA, finds study - News-Medical.Net", "description": "Researchers from Singapore-MIT Alliance for Research and Technology, MIT's research enterprise in Singapore, have discovered a new anti-phage defense mechanism found in some bacteria, which uses previously unknown features to protect their DNA.", "url": "https://www.news-medical.net/news/20200506/New-anti-phage-defense-mechanism-in-bacteria-protects-their-DNA-finds-study.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2016%2f3%2fbacteria_-_Sebastian_Kaulitzki_46826fb7971649bfaca04a9b4cef3309-620x480.jpg", "publishedAt": "2020-05-06T18:12:08Z", "content": "Reviewed by Emily Henderson, B.Sc.May 6 2020\r\nResearchers from Singapore-MIT Alliance for Research and Technology (SMART), MIT's research enterprise in Singapore, have discovered a new anti-phage defence mechanism found in some bacteria, which uses previously… [+3151 chars]"}, {"source": {"id": null, "name": "Sciencemag.org"}, "author": null, "title": "KAGUYA observation of global emissions of indigenous carbon ions from the Moon - Science Advances", "description": "Carbon is a volatile element that has a considerable influence on the formation and evolution of planetary bodies, although it was previously believed to be depleted in the Moon. We present observations by the lunar orbiter KAGUYA of carbon ions emitted from …", "url": "https://advances.sciencemag.org/content/6/19/eaba1050.full", "urlToImage": "https://advances.sciencemag.org/content/6/19/eaba1050/F1.large.jpg", "publishedAt": "2020-05-06T18:00:42Z", "content": "Abstract\r\nCarbon is a volatile element that has a considerable influence on the formation and evolution of planetary bodies, although it was previously believed to be depleted in the Moon. We present observations by the lunar orbiter KAGUYA of carbon ions emi… [+19597 chars]"}, {"source": {"id": null, "name": "News-medical.net"}, "author": null, "title": "New study investigates the brain's action plans during walking - News-Medical.Net", "description": "Walking across the room to switch on a light - such a simple everyday activity involves enormously complex computations by the brain as it requires interpretation of the scene, control of the gait and planning upcoming movements such as the arm movement to th…", "url": "https://www.news-medical.net/news/20200506/New-study-investigates-the-brains-action-plans-during-walking.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2017%2f5%2fyoung_fitness_woman_legs_walking_on_forest_trail-lzf_2bd66c6bf5814da3abf769cf48ed9ff1-620x480.jpg", "publishedAt": "2020-05-06T16:35:52Z", "content": "Reviewed by Emily Henderson, B.Sc.May 6 2020\r\nWalking across the room to switch on a light - such a simple everyday activity involves enormously complex computations by the brain as it requires interpretation of the scene, control of the gait and planning upc… [+5069 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Severe coral loss leaves reefs with larger fish but low energy turnover - Science Daily", "description": "Research has found severe coral loss to be associated with substantial increases in the size of large, long-living herbivorous fish. However, decreased recycling of this fish biomass could leave the ecosystem vulnerable to crashing.", "url": "https://www.sciencedaily.com/releases/2020/05/200506091541.htm", "urlToImage": null, "publishedAt": "2020-05-06T16:10:43Z", "content": "Research on the Great Barrier Reef has found severe coral loss to be associated with substantial increases in the size of large, long-living herbivorous fish. However, decreased recycling of this fish biomass could leave the ecosystem vulnerable to crashing. … [+4110 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Aristos Georgiou", "title": "Largest Impact Event in Recorded History May Have Been An Iron Asteroid That Never Actually Hit Earth - Newsweek", "description": "The explosion over Siberia—which has come to be known as the \"Tunguska event\"—has long puzzled experts.", "url": "https://www.newsweek.com/largest-impact-event-recorded-history-iron-asteroid-hit-earth-1502364", "urlToImage": "https://d.newsweek.com/en/full/1587794/tunguska-event.jpg", "publishedAt": "2020-05-06T16:06:41Z", "content": "The largest impact event in recorded history may have been caused by the shock waves generated by an iron asteroid that entered the Earth's atmosphere at a shallow angle before heading back into space, a team of Russian scientists have proposed.\r\nThe research… [+5786 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Desert 'Rover' Helps NASA Scientists Prepare for Mars - NASA Jet Propulsion Laboratory", "description": "Did life ever form on Mars? NASA is launching its new Perseverance rover to find out. In February 2020, mission scientists practiced skills they’ll need whil...", "url": "https://www.youtube.com/watch?v=y3WqWazeWlI", "urlToImage": "https://i.ytimg.com/vi/y3WqWazeWlI/maxresdefault.jpg", "publishedAt": "2020-05-06T15:52:38Z", "content": "Did life ever form on Mars? NASA is launching its new Perseverance rover to find out. In February 2020, mission scientists practiced skills theyll need while Perseverance explores the Red Planet. A seven-person field team served as a simulated rover, carrying… [+487 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "George Dvorsky", "title": "Bioluminescent Waves Draw Crowds To California Beaches - Gizmodo Australia", "description": "Stunning bioluminescent waves are crashing onto southern California shores. It’s quite the spectacle, but the light show is drawing crowds amid social distancing concerns....", "url": "https://www.gizmodo.com.au/2020/05/bioluminescent-waves-draw-crowds-to-california-beaches/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/jgqtzjxvaczlc4oidu3d.jpg", "publishedAt": "2020-05-06T15:40:00Z", "content": "Stunning bioluminescent waves are crashing onto southern California shores. Its quite the spectacle, but the light show is drawing crowds amid social distancing concerns.\r\nShores between Baja California and Los Angeles are experiencing a significant algal blo… [+3771 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Second skin protects against chem, bio agents - Mirage News", "description": "The smart protection mechanism of responsive nanotube membranes against environmental threats. The collapse of actuating polymer chains on the...", "url": "https://www.miragenews.com/second-skin-protects-against-chem-bio-agents/", "urlToImage": "https://www.llnl.gov/sites/www/files/styles/scaled_425h/public/2020-05/RCHEN_natureMaterials_875x500px.jpg?itok=aMRpCLC5", "publishedAt": "2020-05-06T14:56:11Z", "content": "The smart protection mechanism of responsive nanotube membranes against environmental threats. The collapse of actuating polymer chains on the contaminated membrane surface prevents nerve agents like sarin from entering the SWCNT pores. In a safe environment,… [+5722 chars]"}, {"source": {"id": null, "name": "Mining.com"}, "author": null, "title": "Russia questions legality of US-planned moon mining pact - MINING.com", "description": "Kremlin says legal framework for mining on the moon should be examined to make sure it complies with international laws.", "url": "https://www.mining.com/russia-questions-legality-of-us-planned-moon-mining-pact/", "urlToImage": "https://www.mining.com/wp-content/uploads/2020/05/moon-featured-image.jpg", "publishedAt": "2020-05-06T13:39:00Z", "content": "Aircraft taking off from Ronald Reagan National Airport in Arlington, Virginia. (Public domain CC0 image.)\r\nRussia is questioning a US-proposed global legal framework for mining on the moon, saying the document would have to be examined thoroughly to make sur… [+4707 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Darrell Etherington", "title": "SpaceX's Starship prototype successfully completes key engine static fire test - Yahoo Finance Australia", "description": "SpaceX's  Starship prototype is on a streak of successes, at a key moment for the spacecraft's development.  The Starship SN4 (so-named because it's the fourth full-size prototype) tester managed to pass a test of its Raptor engine firing while installed on t…", "url": "https://au.finance.yahoo.com/news/spacexs-starship-prototype-successfully-completes-124759167.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/uu8xe.klBKDOrBXdDeC8fQ--~B/aD0yMDc0O3c9MzY4NztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/techcrunch_350/dd061ed002b1d0c3b4b1903f1f2a35ab", "publishedAt": "2020-05-06T12:47:00Z", "content": "SpaceX's Starship prototype is on a streak of successes, at a key moment for the spacecraft's development. The Starship SN4 (so-named because it's the fourth full-size prototype) tester managed to pass a test of its Raptor engine firing while installed on the… [+1800 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Scientists find evidence of an ancient river on Mars - NEWS9", "description": "Researchers from Netherlands have found the first conclusive evidence about the existence of a major river on Mars. Permanent marks on a 650 ft cliff face on...", "url": "https://www.youtube.com/watch?v=VvTokHSSGWM", "urlToImage": "https://i.ytimg.com/vi/VvTokHSSGWM/maxresdefault.jpg", "publishedAt": "2020-05-06T12:26:41Z", "content": null}, {"source": {"id": "wired", "name": "Wired"}, "author": "Daniel Oberhaus", "title": "After 60 Years, Explosion-Powered Rockets Are Nearly Here - WIRED", "description": "Rotating detonation engines could make rockets lighter, faster, and simpler. First imagined in the 1950s, now they’re almost ready for their first flight.", "url": "https://www.wired.com/story/after-60-years-explosion-powered-rockets-are-nearly-here/", "urlToImage": "https://media.wired.com/photos/5eb1c1d77ecb20c186e15677/191:100/w_1280,c_limit/Science_RDE@_IMG_20190515_065438.jpg", "publishedAt": "2020-05-06T11:22:18Z", "content": "For most aerospace engineers, an explosion in a rocket engine is a disaster. But for Kareem Ahmed, its the entire point. As the director of the Propulsion and Energy Research Laboratory at the University of Central Florida, Ahmed has spent the last few years … [+3565 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Otters 'stone juggling': new research looks into why - Guardian News", "description": "Otters are often scene playing with pebbles, throwing and catching them, known as 'stone juggling' and researchers from the University of Exeter believe they...", "url": "https://www.youtube.com/watch?v=zdEBilRjcEI", "urlToImage": "https://i.ytimg.com/vi/zdEBilRjcEI/maxresdefault.jpg", "publishedAt": "2020-05-06T10:33:05Z", "content": "Otters are often scene playing with pebbles, throwing and catching them, known as 'stone juggling' and researchers from the University of Exeter believe they know why. It was previously thought the game helped hone their foraging skills. The study revealed ol… [+847 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "China launches new rocket in space race with US - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-05-06T08:10:00Z", "content": null}, {"source": {"id": null, "name": "Unsw.edu.au"}, "author": "z3530495", "title": "How strong is your mental imagery? It might depend on how 'excitable' your neurons are - UNSW Newsroom", "description": "Highly excitable brain neurons in the visual cortex may reduce a person’s ability to visualise things clearly, neuroscience study finds.", "url": "https://newsroom.unsw.edu.au/news/science-tech/how-strong-your-mental-imagery-it-might-depend-how-excitable-your-neurons-are", "urlToImage": "https://newsroom.unsw.edu.au/sites/default/files/thumbnails/image/thinking_looking_up_1.jpg", "publishedAt": "2020-05-06T01:35:00Z", "content": "Highly excitable brain neurons in the visual cortex may reduce a persons ability to visualise things clearly, neuroscience study finds. The strength of a persons mental imagery their ability to picture something in their minds eye is linked to the excitabilit… [+6838 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Ryan F. Mandelbaum", "title": "Experiment Shows Some Life Can Survive In Exoplanet-Like Conditions - Gizmodo Australia", "description": "Single-celled organisms like Escherichia coli and yeast can grow and survive in an atmosphere like the kind theorised to exist on many rocky exoplanets, according to a new paper....", "url": "https://www.gizmodo.com.au/2020/05/experiment-shows-some-life-can-survive-in-exoplanet-like-conditions/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/pqsndl3ayozmneql9di4.jpg", "publishedAt": "2020-05-06T00:00:00Z", "content": "Single-celled organisms like Escherichia coli and yeast can grow and survive in an atmosphere like the kind theorised to exist on many rocky exoplanets, according to a new paper.\r\nScientists would love to know whether theres life elsewhere in the universe, an… [+3176 chars]"}, {"source": {"id": null, "name": "Hulldailymail.co.uk"}, "author": "Barnabas Stephenson", "title": "Starlink satellite tracker shows best time to see satellites in UK skies - Hull Daily Mail", "description": "Here is a list of the exact times to spot Elon Musk's satellites moving across the sky", "url": "https://www.hulldailymail.co.uk/news/hull-east-yorkshire-news/starlink-satellite-tracker-best-time-4102923", "urlToImage": "https://i2-prod.hulldailymail.co.uk/incoming/article4102906.ece/ALTERNATES/s1200/0_ecsImgspacex-satellites-8911143947347862881.jpg", "publishedAt": "2020-05-05T19:37:00Z", "content": "Over the last few weeks many of us have been stunned by the sight of Starlink satellites.\r\nLots of people have stayed up specifically to catch a glimpse of the dazzling lights passing through the sky during the lockdown period.\r\nAnd the formations are due to … [+1514 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Outsmarting enemy: Treefrogs rely on illusions to find a mate without being eaten - Mirage News", "description": "Note to Journalists: A photo of a treefrog is available on Google Drive. Researchers at Purdue University have discovered that...", "url": "https://www.miragenews.com/outsmarting-enemy-treefrogs-rely-on-illusions-to-find-a-mate-without-being-eaten/", "urlToImage": "https://www.purdue.edu/uns/images/2020/treefrogs-maleLO.jpg", "publishedAt": "2020-05-05T19:08:11Z", "content": "Note to Journalists: A photo of a treefrog is available on Google Drive.\r\nWEST LAFAYETTE, Ind. — Treefrogs become easy targets for predators and parasites when they send mating calls, but they’re finding a way to fool their enemies with a little help from a w… [+2906 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Meet the astronauts set to make history in a SpaceX capsule - CNN Business", "description": "Veteran NASA astronauts Robert Behnken and Doug Hurley speak with CNN Business' Rachel Crane about their upcoming test flight aboard SpaceX's Crew Dragon spa...", "url": "https://www.youtube.com/watch?v=a83oYWdBAr8", "urlToImage": "https://i.ytimg.com/vi/a83oYWdBAr8/maxresdefault.jpg", "publishedAt": "2020-05-05T18:29:05Z", "content": null}, {"source": {"id": null, "name": "Sci-news.com"}, "author": null, "title": "Exoplanets with Hydrogen-Rich Atmospheres Could Harbor Simple Life Forms | Astrobiology, Astronomy - Sci-News.com", "description": "A team of researchers at the Massachusetts Institute of Technology (MIT) has demonstrated that single-celled microorganisms such as Escherichia coli and Saccharomyces cerevisiae that normally do not inhabit hydrogen-rich environments can survive and grow in a…", "url": "http://www.sci-news.com/astronomy/hydrogen-rich-exoplanet-atmospheres-simple-life-forms-08395.html", "urlToImage": "http://cdn.sci-news.com/images/2018/11/image_6609f-Barnards-Star-b.jpg", "publishedAt": "2020-05-05T17:31:10Z", "content": "A team of researchers at the Massachusetts Institute of Technology (MIT) has demonstrated that single-celled microorganisms such as Escherichia coli and Saccharomyces cerevisiae that normally do not inhabit hydrogen-rich environments can survive and grow in a… [+4027 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Scientists 'at bleeding edge' with upgrade to CMS detector - Mirage News", "description": "Note to Journalists: Images of the CMS detector are available for journalists to use via a Google Drive folder. The CMS...", "url": "https://www.miragenews.com/scientists-at-bleeding-edge-with-upgrade-to-cms-detector/", "urlToImage": "https://news.uns.purdue.edu/images/+2008/cms-detectorLO.jpg", "publishedAt": "2020-05-05T17:10:50Z", "content": "Note to Journalists: Images of the CMS detector are available for journalists to use via a Google Drive folder.\r\nPurdue particle physicists continue a legacy of  boundary-pushing experiments at the Large Hadron Collider\r\nWEST LAFAYETTE, Ind. — The huge detect… [+7146 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Evidence of ancient rivers spotted on Mars, study says - CNN", "description": "Researchers are \"reading the rocks\" and the history they show on Mars to paint a picture of when the planet supported liquid water on its surface billions of years ago.", "url": "https://www.cnn.com/2020/05/05/world/mars-river-evidence-scn-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200505101456-mars-ancient-river-super-tease.jpg", "publishedAt": "2020-05-05T15:16:04Z", "content": null}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Plants pass on 'memory' of stress to some progeny, making them more resilient - Mirage News", "description": "Researchers Xiaodong Yang (left), research assistant professor, Hardik Kundariya, graduate student (middle), and Sally Mackenzie, professor of biology...", "url": "https://www.miragenews.com/plants-pass-on-memory-of-stress-to-some-progeny-making-them-more-resilient/", "urlToImage": "https://news.psu.edu/sites/default/files/styles/threshold-992/public/Header%2C%20Mackenzie%2C%20low-rez.jpg?itok=qEspfHP-", "publishedAt": "2020-05-05T15:15:00Z", "content": "Researchers Xiaodong Yang (left), research assistant professor, Hardik Kundariya, graduate student (middle), and Sally Mackenzie, professor of biology and plant science, in the laboratory conducting research on the MSH1 gene memory induction process.\r\nImage: … [+5615 chars]"}, {"source": {"id": null, "name": "Hit.com.au"}, "author": "Hit News Team", "title": "A Dazzling Meteor Shower Will Rain Over Australia Tomorrow Night - Hit 107", "description": "So cool!", "url": "https://www.hit.com.au/story/a-dazzling-meteor-shower-will-rain-over-australia-tomorrow-night-153659", "urlToImage": "https://cdn-img.scalabs.com.au/pYeBBlG2ulLZE721-y7TbzAptyor8lXM9r384KT7hD4/aHR0cHM6Ly9zdy1o/aXQtcHJkLnNjYWRp/Z2l0YWwuaW8vbWVk/aWEvODEwNjcvbWV0/ZW9yLXNob3dlci1w/ZXhlbHMuanBnP3By/ZXNldD1tcnByZXZh/cnRpY2xl", "publishedAt": "2020-04-20T23:19:17Z", "content": "Hows this for some social-distancing entertainment?\r\nOne of the oldest meteor showers on record, the Lyrid Shower, is set to rain over Australia this week!\r\nUsually active between April 16 and 25 each year, this year, the shower will be most visible on the ev… [+621 chars]"}]}