{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rob Waugh", "title": "Spacecraft detects strange green glow on Mars which has never been seen before - Yahoo News Australia", "description": "An orbiting spacecraft has detected a strange green glow on Mars which has only ever been seen on one planet - Earth.", "url": "https://au.news.yahoo.com/spacecraft-mars-glow-173122282.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/eLnTnG7JA_hXy9Uq3cRjBQ--~B/aD00NTAwO3c9ODAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-06/7ad3fbf0-aff6-11ea-bb2c-c2c68ae27c42", "publishedAt": "2020-06-16T17:31:00Z", "content": "An orbiting spacecraft has detected a strange green glow on Mars that had previously only been seen on one planet Earth. \r\nThe ExoMars Trace Gas Orbiter (TGO) spotted glowing green oxygen in Marss at… [+2701 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Rocket Science in 60 Seconds: How and Why Are the SLS Rocket Boosters Insulated? - NASA's Marshall Space Flight Center", "description": "Rocket Science in 60 Seconds gives you an inside look at the work being done at NASA to explore deep space. Chelsea Walker is a Northrop Grumman materials an...", "url": "https://www.youtube.com/watch?v=NAeful7UD1U", "urlToImage": "https://i.ytimg.com/vi/NAeful7UD1U/hqdefault.jpg", "publishedAt": "2020-06-16T14:43:45Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Supergiant atmosphere of Antares revealed by radio telescopes - Phys.org", "description": "An international team of astronomers has created the most detailed map yet of the atmosphere of the red supergiant star Antares. The unprecedented sensitivity and resolution of both the Atacama Large Millimeter/submillimeter Array (ALMA) and the National Scie…", "url": "https://phys.org/news/2020-06-supergiant-atmosphere-antares-revealed-radio.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/supergiantat.jpg", "publishedAt": "2020-06-16T14:33:56Z", "content": "An international team of astronomers has created the most detailed map yet of the atmosphere of the red supergiant star Antares. The unprecedented sensitivity and resolution of both the Atacama Large… [+5476 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Feel the beat: implanted microlasers scan heart from inside - Phys.org", "description": "It sounds like science fiction—but lasers beating to the rhythm of a live heart is exactly what researchers at the University of St Andrews have developed to improve the understanding of heart failure and to help develop more effective treatments.", "url": "https://phys.org/news/2020-06-implanted-microlasers-scan-heart.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/feelthebeati.jpg", "publishedAt": "2020-06-16T14:26:20Z", "content": "It sounds like science fictionbut lasers beating to the rhythm of a live heart is exactly what researchers at the University of St Andrews have developed to improve the understanding of heart failure… [+4330 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Portable smartphone add-on can measure methanol in alcoholic beverages - Phys.org", "description": "A team of researchers and engineers from Particle Technology Laboratory, ETH Zurich and University Hospital Zurich has designed and built a palm-sized device that can measure the amount of methanol in an alcoholic beverage. In their paper published in the jou…", "url": "https://phys.org/news/2020-06-portable-smartphone-add-on-methanol-alcoholic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/portablesmar.jpg", "publishedAt": "2020-06-16T14:26:15Z", "content": "A team of researchers and engineers from Particle Technology Laboratory, ETH Zurich and University Hospital Zurich has designed and built a palm-sized device that can measure the amount of methanol i… [+2651 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Complex landscapes may have helped land-dwelling animals evolve higher intelligence - News-Medical.net", "description": "Ever wonder how land animals like humans evolved to become smarter than their aquatic ancestors? You can thank the ground you walk on.", "url": "https://www.news-medical.net/news/20200616/Complex-landscapes-may-have-helped-land-dwelling-animals-evolve-higher-intelligence.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2016%2f3%2fArtificially_Colored_MRI_Scan_Of_Human_Brain-Daisy_Daisy_a8c5d8bbbf824bc8932308e30187510f-620x480.jpg", "publishedAt": "2020-06-16T14:14:00Z", "content": "Ever wonder how land animals like humans evolved to become smarter than their aquatic ancestors? You can thank the ground you walk on.\r\nNorthwestern University researchers recently discovered that co… [+5986 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Mysterious blue fireball streaks above Western Australia, puzzling astronomers - Livescience.com", "description": "The strange fireball was caught on video.", "url": "https://www.livescience.com/mysterious-fireball-pilbara.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QkuLCPzH7GUVS9MthdWM9M-1200-80.jpg", "publishedAt": "2020-06-16T14:07:00Z", "content": "A streak of blue light that flashed across the sky on Monday surprised western Australia's night owls and befuddled the astronomy community. \r\nThe blue fireball was seen at 1 a.m. local time on June … [+2824 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "BBC News", "title": "How honeybees perform queen duets - BBC News", "description": "Scientists have decoded honeybee queens' \"tooting and quacking\" duets in the hive.", "url": "https://www.bbc.com/news/av/science-environment-53068718/how-honeybees-perform-queen-duets", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/13C2E/production/_112924908_p08h3yzm.jpg", "publishedAt": "2020-06-16T14:06:06Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Evidence for volcanic craters on Saturn's moon Titan - Phys.org", "description": "Volcano-like features seen in polar regions of Saturn's moon Titan by NASA's Cassini spacecraft could be evidence of explosive eruptions that may continue today, according to a new paper by Planetary Science Institute Senior Scientist Charles A. Wood and coau…", "url": "https://phys.org/news/2020-06-evidence-volcanic-craters-saturn-moon.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/evidenceforv.jpg", "publishedAt": "2020-06-16T13:13:49Z", "content": "Volcano-like features seen in polar regions of Saturn's moon Titan by NASA's Cassini spacecraft could be evidence of explosive eruptions that may continue today, according to a new paper by Planetary… [+2406 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Phil Plait", "title": "When were the *very* first stars born? Earlier than we can see, even with Hubble - SYFY WIRE", "description": "When you look up at the night sky, you can see thousands of stars. The fact that they're there at all implies they had a beginning, and we know stars can exist for billions of years. We see them die, and we see them being born. It's not a huge leap of logic t…", "url": "https://www.syfy.com/syfywire/when-were-the-very-first-stars-born-earlier-than-we-can-see-even-with-hubble", "urlToImage": "https://www.syfy.com/sites/syfy/files/styles/1200x680/public/artwork_firststars.jpg", "publishedAt": "2020-06-16T13:09:13Z", "content": "When you look up at the night sky, you can see thousands of stars. The fact that they're there at all implies they had a beginning, and we know stars can exist for billions of years. We see them die,… [+4884 chars]"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Shane McGlaun", "title": "ESA Solar Orbiter makes its first close approach to the Sun - SlashGear", "description": "The ESA has announced that the solar Orbiter has made its first close approach to the Sun. The event happened on June 15 with the solar Orbiter approaching as close as 77 million km to the Sun&#821…", "url": "https://www.slashgear.com/esa-solar-orbiter-makes-its-first-close-approach-to-the-sun-16624952/", "urlToImage": "https://cdn.slashgear.com/wp-content/uploads/2020/06/solar-orbiter.jpg", "publishedAt": "2020-06-16T13:05:38Z", "content": "The ESA has announced that the solar Orbiter has made its first close approach to the Sun. The event happened on June 15 with the solar Orbiter approaching as close as 77 million km to the Sun’s surf… [+1602 chars]"}, {"source": {"id": null, "name": "3rd Watch News"}, "author": null, "title": "Supersonic Business Jet Market rising trends, latest technologies research and future scope 2020-2025: TOP PLAYERS Aerion, Lockheed Martin, Spike Aerospace, , etc. - 3rd Watch News", "description": null, "url": "https://3wnews.org/industry/1403115/supersonic-business-jet-market-rising-trends-latest-technologies-research-and-future-scope-2020-2025-top-players-aerion-lockheed-martin-spike-aerospace-etc/", "urlToImage": null, "publishedAt": "2020-06-16T12:47:14Z", "content": "“Understand the influence of COVID-19 on the Supersonic Business Jet Market Size with our analysts monitoring the situation across the globe.\r\nOngoing Trends of Supersonic Business Jet Market :-\r\nThe… [+4045 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/nadia-daly/6564026", "title": "Coronavirus pandemic leaves hundreds of medical practices on verge of collapse - ABC News", "description": "A survey of a thousand GPs and practices shows that nearly half aren't sure whether they will still be operating in six months' time, with patient numbers plummeting amid the coronavirus pandemic.", "url": "https://www.abc.net.au/news/2020-06-16/coronavirus-leaves-medical-practices-on-verge-of-collapse/12359282", "urlToImage": "https://www.abc.net.au/cm/rimage/12245454-16x9-large.jpg?v=2", "publishedAt": "2020-06-16T12:18:00Z", "content": "Hundreds of medical practices are on the verge of collapse because of a fall in the number of visits due to the coronavirus pandemic, according to data collected by the Royal College of General Pract… [+5863 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Nature-Inspired CRISPR Enzyme Discoveries Vastly Expand Genome Editing - SciTechDaily", "description": "Applied computational biology discoveries vastly expand the range of CRISPR’s access to DNA sequences. In nature, bacteria use CRISPR as an adaptive immune system to protect themselves against viruses. Over the past decade, scientists have been able to succes…", "url": "https://scitechdaily.com/nature-inspired-crispr-enzyme-discoveries-vastly-expand-genome-editing/", "urlToImage": "https://scitechdaily.com/images/CRISPR-Cas9.jpg", "publishedAt": "2020-06-16T11:35:01Z", "content": "Gene editing Cas9 protein.\r\nApplied computational biology discoveries vastly expand the range of CRISPR’s access to DNA sequences.\r\nIn nature, bacteria use CRISPR as an adaptive immune system to prot… [+5658 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Australian fossil reveals new plant species - Phys.org", "description": "Antoine Champreux, a Ph.D. student in the Global Ecology Lab at Flinders University, has cataloged the discovery of the new fern-like plant species as part of an international effort to examine the Australian fossil in greater detail.", "url": "https://phys.org/news/2020-06-australian-fossil-reveals-species.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/australianfo.jpg", "publishedAt": "2020-06-16T11:07:20Z", "content": "Antoine Champreux, a Ph.D. student in the Global Ecology Lab at Flinders University, has cataloged the discovery of the new fern-like plant species as part of an international effort to examine the A… [+3180 chars]"}, {"source": {"id": null, "name": "Brinkwire.com"}, "author": null, "title": "Now crackpots claim they have spotted a 'human bone' on Mars – but it's probably just a rock - Brinkwire", "description": null, "url": "https://en.brinkwire.com/news/now-crackpots-claim-they-have-spotted-a-human-bone-on-mars-but-its-probably-just-a-rock/", "urlToImage": null, "publishedAt": "2020-06-16T09:51:55Z", "content": "A BIZARRE snapshot of the surface of Mars has recently resurfaced along with the conspiracy theory that it shows a human bone.\r\nSome people think they can see a femur amongst rubble on the Red Planet… [+1808 chars]"}, {"source": {"id": null, "name": "CalvinAyre.com"}, "author": null, "title": "New gold mines are waiting to be explored (but not where you think) - CalvinAyre.com", "description": "As space exploration continues to advance and mature, gold mining might eventually take place on asteroids.", "url": "https://calvinayre.com/2020/06/16/ventures/new-gold-mines-are-waiting-to-be-explored-but-not-where-you-think/", "urlToImage": "https://calvinayre.com/wp-content/uploads/2020/06/new-gold-mines-are-waiting-to-be-explored-but-not-where-you-think.jpg", "publishedAt": "2020-06-16T09:38:00Z", "content": "Theres gold in them hills! That may have been a call that enticed a lot of people to venture out to California for the Gold Rush of the mid-1800s, but, once the majority of the gold was found, the ex… [+2757 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "By Michael Havis For Mailonline", "title": "Ancient 17-foot longboat is discovered buried in mud at the edge of Irish lake - Daily Mail", "description": "Cathal McDonagh found the boat when he walked down to a lake near Lisacul, County Roscommon. Dry weather had caused its water level to drop, revealing the ancient boat.", "url": "https://www.dailymail.co.uk/sciencetech/article-8425755/Ancient-17-foot-longboat-discovered-buried-mud-edge-Irish-lake.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/06/16/09/29662222-0-image-a-8_1592295361095.jpg", "publishedAt": "2020-06-16T09:12:49Z", "content": "A schoolboy who ditched his homework to take a walk along the edge of a lake got a surprise when he stumbled upon the wreck of an ancient longboat.\r\nCathal McDonagh, from Lisacul in County Roscommon,… [+3591 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "https://www.facebook.com/13ericralph31", "title": "SpaceX’s next rocket fairing reuse milestone within reach after latest recovery - Teslarati", "description": "SpaceX’s next major Falcon 9 fairing reuse milestone is now within reach after the company managed to successfully recover an entire reused nosecone with both halves intact. On June 13th, a flight-proven Falcon 9 rocket lifted off on the seventh Starlink miss…", "url": "https://www.teslarati.com/spacex-next-rocket-fairing-reuse-milestone/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2020/06/Starlink-V1-L8-Falcon-9-B1059-LC40-061220-Richard-Angle-prelaunch-4-c-1024x490.jpg", "publishedAt": "2020-06-16T09:06:59Z", "content": "SpaceX’s next major Falcon 9 fairing reuse milestone is now within reach after the company managed to successfully recover an entire reused nosecone with both halves intact.\r\nOn June 13th, a flight-p… [+2786 chars]"}, {"source": {"id": null, "name": "Happy Mag"}, "author": "Rachel Daniel", "title": "New research reveals hummingbirds can see colours humans can't even imagine - Happy", "description": "New research reveals that, thanks to the presence of an extra cone in their eye, hummingbirds can perceive colours humans can't", "url": "https://happymag.tv/new-research-reveals-hummingbirds-can-see-colours-humans-cant-even-imagine/", "urlToImage": "https://happymag.tv/wp-content/uploads/2020/06/rsz_hummingbirds_.jpg", "publishedAt": "2020-06-16T08:48:03Z", "content": "A new experiment has revealed that thanks to the addition of an extra cone in their eye, hummingbirds can observe colours that the human cannot.\r\nAccording to researchers, wildlife with the extra con… [+1099 chars]"}, {"source": {"id": null, "name": "Jakarta Post"}, "author": "The Jakarta Post", "title": "Why it could be dangerous to exercise with a face mask on - The Jakarta Post - Jakarta Post", "description": "Exercise invariably leads to faster and harder breaths, so wearing a mask during exercise places a further strain on airflow.", "url": "https://www.thejakartapost.com/life/2020/06/16/why-it-could-be-dangerous-to-exercise-with-a-face-mask-on.html", "urlToImage": "https://img.jakpost.net/c/2020/06/16/2020_06_16_97872_1592289834._large.jpg", "publishedAt": "2020-06-16T07:48:00Z", "content": "The coronavirus began to affect sporting events as early as January 30, when the Chinese Football Association announced it was delaying the start of the football season. Two months later it was revea… [+4714 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "How deadly is the coronavirus? Scientists are close to an answer - Nature.com", "description": "Public-health researchers use the infection fatality rate to gauge how to respond to a new disease, but it’s tricky to calculate.", "url": "https://www.nature.com/articles/d41586-020-01738-2", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-020-01738-2/d41586-020-01738-2_18063800.jpg", "publishedAt": "2020-06-16T05:39:29Z", "content": "Many countries are struggling to count all their coronavirus deaths.Credit: Michael Dantas/AFP/Getty\r\nOne of the most crucial questions about an emerging infectious disease such as the new coronaviru… [+8664 chars]"}, {"source": {"id": null, "name": "Foodprocessing"}, "author": null, "title": "How long can coronavirus survive on difference surfaces? - Foodprocessing", "description": "A study published in<em> Physics of Fluids</em> has found that temperature, humidity and surfaces can affect coronavirus droplet survival time.", "url": "https://www.foodprocessing.com.au/content/food-design-research/news/how-long-can-coronavirus-survive-on-difference-surfaces--746641818", "urlToImage": "https://d1v1e13ebw3o15.cloudfront.net/data/51658/pool_and_spa_master/..jpg", "publishedAt": "2020-06-16T04:59:27Z", "content": "In a paper in Physics of Fluids, by AIP Publishing, researchers have examined the drying time of respiratory droplets from COVID-19-infected subjects on various surfaces in six cities around the worl… [+1851 chars]"}, {"source": {"id": null, "name": "Dailyresearchadvisor.com"}, "author": null, "title": "Room Dust Delivered Water to Vesta, Could it Have Done the Same for Earth? - Daily Research Advisor", "description": "One of the best long-lasting concerns regarding Earth relates to the beginnings of its own water. Where performed it originate from? One widely-held concept offers comets the tribute of taking water to Earth. Yet another one mentions that Earth’s water happen…", "url": "https://dailyresearchadvisor.com/2020/06/16/room-dust-delivered-water-to-vesta-could-it-have-done-the-same-for-earth/", "urlToImage": null, "publishedAt": "2020-06-16T04:15:02Z", "content": "One of the best long-lasting concerns regarding Earth relates to the beginnings of its own water. Where performed it originate from? One widely-held concept offers comets the tribute of taking water … [+8778 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Hannah Devlin, Madeleine Finlay", "title": "Covid-19: should we be concerned about air conditioning? - podcast - The Guardian", "description": "Hannah Devlin speaks to Lena Ciric about what role air conditioning could play in spreading or dispersing Covid-19 in buildings and on public transport", "url": "https://www.theguardian.com/science/audio/2020/jun/16/covid-19-should-we-be-concerned-about-air-conditioning-podcast", "urlToImage": "https://i.guim.co.uk/img/media/3ddd5a89c23244c957e7d5985fb1b362744f218b/0_148_6720_4032/master/6720.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8a4ad16d3f2c4d1fcf7f98a42256716e", "publishedAt": "2020-06-16T04:00:00Z", "content": "Following on from several listener questions about the role of air conditioning in spreading or dissipating Covid-19 in buildings and on public transport, Hannah Devlin asks Dr Lena Ciric whether we … [+98 chars]"}, {"source": {"id": null, "name": "Science Codex"}, "author": null, "title": "Wildfires cause bird songs to change - Science Codex", "description": null, "url": "https://www.sciencecodex.com/wildfires-cause-bird-songs-change-649659", "urlToImage": null, "publishedAt": "2020-06-16T04:00:00Z", "content": "A new study in The Auk: Ornithological Advances, published by Oxford University Press, suggests that wildfires change the types of songs sung by birds living in nearby forests.\r\nHermit Warblers sing … [+2569 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "NASA New Horizons spacecraft returns stunning images of previously unseen 'parallax effect' - Firstpost", "description": "The spacecraft has observed how Proxima Centauri and Wolf 359 appear in different positions than when observed from Earth than deep space.", "url": "https://www.firstpost.com/tech/science/nasa-new-horizons-spacecraft-returns-stunning-images-of-previously-unseen-parallax-effect-8487211.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2019/01/NASA-New-Horizonss.jpg", "publishedAt": "2020-06-16T03:36:31Z", "content": "FP TrendingJun 16, 2020 08:56:23 IST\r\nNASA's spacecraft New Horizons that is situated more than 4.3 billion miles away from Earth, has sent back pictures of the sky showing some stars in different po… [+2461 chars]"}, {"source": {"id": null, "name": "Pressinsiderdaily.com"}, "author": "Izer", "title": "There could be 36 communicating intelligent civilizations in our galaxy, study says - Press Insider Daily", "description": "Maybe we’re not. Scientists have calculated that there could be a minimum of 36 active, communicating intelligent civilizations in our Milky Way galaxy, according to a new study. However, due to time and distance, we may never actually know if they exist or e…", "url": "https://pressinsiderdaily.com/2020/06/there-could-be-36-communicating-intelligent-civilizations-in-our-galaxy-study-says/", "urlToImage": "https://pressinsiderdaily.com/wp-content/uploads/2020/06/1592271378_There-could-be-36-communicating-intelligent-civilizations-in-our-galaxy-1000x600.jpg", "publishedAt": "2020-06-16T01:36:18Z", "content": "Maybe we’re not.Scientists have calculated that there could be a minimum of 36 active, communicating intelligent civilizations in our Milky Way galaxy, according to a new study. However, due to time … [+7054 chars]"}, {"source": {"id": null, "name": "Womensagenda.com.au"}, "author": null, "title": "Almost 90% of astronauts have been men. But the future of space may be female - Women's Agenda", "description": "In many ways, women are ideal astronauts as physical strength and height are not advantages in microgravity, writes Alice Gorman.", "url": "https://womensagenda.com.au/latest/almost-90-of-astronauts-have-been-men-but-the-future-of-space-may-be-female/", "urlToImage": "https://womensagenda.com.au/wp-content/uploads/2020/06/astronaut.jpg", "publishedAt": "2020-06-16T00:17:00Z", "content": "Physical strength and height are not advantages in microgravity, Women ideal astronauts, writes Alice Gorman, from Flinders University in this piece republished from The Conversation. \r\n Only 566 peo… [+7339 chars]"}, {"source": {"id": null, "name": "PCMag.com"}, "author": "Michael Kan", "title": "SpaceX's Satellite Internet Teases Sending Out Invites for Public Beta Tests - PCMag AU", "description": "The company’s website for Starlink has been updated with a new email newsletter that'll notify applicable users about the coming public beta trial.", "url": "https://au.pcmag.com/switches/67317/spacexs-satellite-internet-teases-sending-out-invites-for-public-beta-tests", "urlToImage": "https://sm.pcmag.com/t/pcmag_au/news/s/spacexs-sa/spacexs-satellite-internet-teases-sending-out-invites-for-pu_k4vn.1200.jpg", "publishedAt": "2020-06-16T00:06:00Z", "content": "Want to try out SpaceXs satellite internet service? The company is gearing up to send email updates to interested customers, recruiting them to test it out. \r\nThe companys website for Starlink has be… [+1777 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "A chilling first: Physicists create exotic “fifth form of matter” on board the ISS - Ars Technica", "description": "JPL built Cold Atom Lab to make so-called Bose-Einstein condensates in microgravity.", "url": "https://arstechnica.com/science/2020/06/a-chilling-first-physicists-create-exotic-fifth-form-of-matter-on-board-the-iss/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2020/06/calTOP-760x380.jpg", "publishedAt": "2020-06-15T23:44:00Z", "content": "Enlarge/ This sequence of false-color images shows the formation of a Bose-Einstein condensate in the Cold Atom Laboratory prototype at NASA's Jet Propulsion Laboratory as the temperature gets progre… [+5646 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Surprising growth rates discovered in world's deepest photosynthetic corals - Science Daily", "description": "New research has revealed unexpectedly high growth rates for deep water photosynthetic corals. The study alters the assumption that deep corals living on the brink of darkness grow extremely slowly.", "url": "https://www.sciencedaily.com/releases/2020/06/200615140901.htm", "urlToImage": null, "publishedAt": "2020-06-15T23:09:04Z", "content": "New research published in the journal Coral Reefs revealed unexpectedly high growth rates for deep water photosynthetic corals. The study, led by Samuel Kahng, affiliate graduate faculty in the Unive… [+3511 chars]"}, {"source": {"id": null, "name": "The Space Review"}, "author": null, "title": "Hugging Hubble longer - The Space Review", "description": null, "url": "https://www.thespacereview.com/article/3965/1", "urlToImage": null, "publishedAt": "2020-06-15T23:01:09Z", "content": "The future of space-based astronomy is delayed. Again.\r\n<table><tr><td>“We will not launch in March, absolutely will not launch in March,” Zurbuchen said of JWST. “That is not in the cards right now.… [+10009 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": "Nicole Karlis", "title": "A new, recurring radio wave burst from space could reveal more about its mysterious origins - Salon", "description": "Scientists are intrigued by the origins of a new burst that is occurring every 157 days in the Milky Way", "url": "https://www.salon.com/2020/06/15/radio-wave-burst-space-frb-magnestar-milky-way/", "urlToImage": "https://media.salon.com/2020/01/milky-way-radio-burst-0107201.jpg", "publishedAt": "2020-06-15T22:57:00Z", "content": "A new radio wave burst in space is capturing scientists' attention because of what it may tell us about its source.\r\nKnown as fast radio bursts (FRBs), these signals have been one of the most perplex… [+3942 chars]"}, {"source": {"id": null, "name": "The Cut"}, "author": "Kelly Conaboy", "title": "Secrets Near the Earth’s Core: Revealed? - The Cut", "description": "A team of geophysicists recently found evidence of what lies around the Earth’s core.", "url": "http://www.thecut.com/2020/06/scientists-find-unexpected-structures-around-earths-core.html", "urlToImage": "https://pyxis.nymag.com/v1/imgs/ae2/4f9/193d330dbb736d3055ccecfe70eaae7ff1-earth-core-final.1x.rsocial.w1200.jpg", "publishedAt": "2020-06-15T21:37:00Z", "content": "What do you think exists around the Earths core, just below the solid mantle layer? Ill give you some time to guess. Okay. Did you say: Large structures (which are much more common and expansive than… [+1955 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Yum, Delicious: Inventors Built an Edible Robot - Futurism", "description": "Just eat around the battery.", "url": "https://futurism.com/the-byte/inventors-built-edible-robot", "urlToImage": "https://wp-assets.futurism.com/2020/06/inventors-building-edible-robots-768x403.jpg", "publishedAt": "2020-06-15T20:15:00Z", "content": "Choking Hazard\r\nA team of particularly inspired scientists finally pulled it off: they built an edible robot.\r\nResearchers from Austrias Johannes Kepler University build a robotic elephant trunk capa… [+1497 chars]"}, {"source": {"id": null, "name": "Techno Info Plus"}, "author": null, "title": "Know Everything About The First Solar Eclipse Of The Year 2020 - Techno Info Plus", "description": "Table of Contents What Is Solar Eclipse?What Is An Annular Solar Eclipse?When Will, The Solar Eclipse, Take Place?Precautions To Take For Solar EclipseWhen Will, The Next Solar Eclipse, Take Place? What Is Solar Eclipse? Solar Eclipse Of The Year 2020: Whenev…", "url": "https://technoinfoplus.com/know-everything-about-the-first-solar-eclipse-of-the-year-2020/", "urlToImage": "https://technoinfoplus.com/wp-content/uploads/2020/06/Pinterest1.jpg", "publishedAt": "2020-06-15T19:40:00Z", "content": "What Is Solar Eclipse?\r\nSolar Eclipse Of The Year 2020: Whenever the earth, sun, and moon form a straight line, it leads to either solar or lunar eclipse. The position of these three bodies decides w… [+2104 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researchers unlock clues to a dramatic chapter of Earth's geological history - Phys.org", "description": "Imagine Earth completely covered in ice. While it's hard to picture all of today's oceans and land masses obscured with glaciers, such an ice-covered version of the planet was not so far-fetched millions of years ago.", "url": "https://phys.org/news/2020-06-clues-chapter-earth-geological-history.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/42-researchersu.jpg", "publishedAt": "2020-06-15T19:33:14Z", "content": "Imagine Earth completely covered in ice. While it's hard to picture all of today's oceans and land masses obscured with glaciers, such an ice-covered version of the planet was not so far-fetched mill… [+5837 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA to Hold Mars 2020 Perseverance Rover Launch Briefing - NASA", "description": "NASA leadership and a panel of scientists and engineers will preview NASA's next mission to the Red Planet, the Mars 2020 Perseverance rover, at a media briefing at 2 p.m. EDT Wednesday, June 17.", "url": "https://www.nasa.gov/press-release/nasa-to-hold-mars-2020-perseverance-rover-launch-briefing/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/2020_rover_name_plate-1080_0.png", "publishedAt": "2020-06-15T19:06:59Z", "content": null}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Wild hummingbirds see a broad range of colors humans can only imagine - Mirage News", "description": "To find food, dazzle mates, escape predators and navigate diverse terrain, birds rely on their excellent color vision. \"Humans are color-blind compared...", "url": "https://www.miragenews.com/wild-hummingbirds-see-a-broad-range-of-colors-humans-can-only-imagine/", "urlToImage": "https://www.princeton.edu/sites/default/files/styles/half_2x/public/images/2020/06/Wild-Hummingbirds-Discriminate-Nonspectral-Colors_Infographic_Stoddard-Lab.jpg?itok=ywDwXAbW", "publishedAt": "2020-06-15T19:02:50Z", "content": "To find food, dazzle mates, escape predators and navigate diverse terrain, birds rely on their excellent color vision.\r\n“Humans are color-blind compared to birds and many other animals,” said Mary Ca… [+7076 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Kiona N. Smith", "title": "Paleolithic French didn’t let their dead rest peacefully - Ars Technica", "description": "The unusual burials hint at complex social structure and spiritual beliefs.", "url": "https://arstechnica.com/science/2020/06/paleolithic-french-didnt-let-their-dead-rest-peacefully/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2020/06/bones1-760x380.jpg", "publishedAt": "2020-06-15T19:00:00Z", "content": "20 with 15 posters participating\r\nIf you died in Europe 35,000 to 25,000 years ago, youd probably be buried with parts of your body painted with red ochre and bedecked with beads, carved figurines, a… [+6758 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Mike Brown", "title": "SpaceX Crew Dragon: astronauts reveal big benefit over space shuttle - Inverse", "description": "Doug Hurley and Bob Behnken are two of the first people to fly on a SpaceX rocket, a feat they achieved last month.", "url": "https://www.inverse.com/innovation/spacex-crew-dragon-astronaut-reveal", "urlToImage": "https://imgix.bustle.com/uploads/image/2020/6/15/f139bd5c-fb69-40ee-aa73-f052dcd58a22-88fc9bef-8dad-4835-8dd8-f96b41c00c84-update_acousic_fire.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "publishedAt": "2020-06-15T18:18:40Z", "content": "Doug Hurley and Bob Behnken are the only two people who know what it's like to fly on a SpaceX rocket. On Friday, the pair revealed some more details about how it feels, and why the Falcon 9's design… [+3513 chars]"}, {"source": {"id": null, "name": "Cisomag.com"}, "author": null, "title": "Threat Actors Can Eavesdrop Using a Light Bulb’s Vibrations: Research - CISO MAG", "description": "Researchers discovered a novel side-channel attacking technique that allows eavesdroppers to spy on conversations happening in a room", "url": "https://www.cisomag.com/lamphone-attack/", "urlToImage": "https://www.cisomag.com/wp-content/uploads/2020/06/shutterstock_1346114726.jpg", "publishedAt": "2020-06-15T18:12:00Z", "content": "A group of cybersecurity researchers discovered a novel side-channel attacking technique that allows eavesdroppers to spy on conversations happening in a room from a nearby location by watching a lig… [+3275 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "The Higgs Boson –“Gateway” to the Dark Universe? - The Daily Galaxy --Great Discoveries Channel", "description": "The cosmos contains a Higgs field—similar to an electric field—generated by Higgs bosons in the vacuum. Particles interact with the field to gain energy and, through Albert Einstein’s famous equation, E=mc2, mass.The Standard Model of particle physics, althou…", "url": "https://dailygalaxy.com/2020/06/the-higgs-boson-could-it-to-be-a-gateway-to-the-dark-universe/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2020/06/the-amazing-higgs-portal-to-the-dark-world-to-ridding-the-universe-of-antimatter-2-e1592241021372.jpg", "publishedAt": "2020-06-15T17:23:26Z", "content": "The cosmos contains a Higgs fieldsimilar to an electric fieldgenerated by Higgs bosons in the vacuum. Particles interact with the field to gain energy and, through Albert Einsteins famous equation, E… [+5812 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Radiation pressure with recoil: Experimental proof for a 90 year-old theory - Phys.org", "description": "Light exerts a certain amount of pressure onto a body: sun sails could thus power space probes in the future. However, when light particles (photons) hit an individual molecule and knock out an electron, the molecule flies toward the light source. Atomic phys…", "url": "https://phys.org/news/2020-06-pressure-recoil-experimental-proof-year-old.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/photon.jpg", "publishedAt": "2020-06-15T17:04:53Z", "content": "Light exerts a certain amount of pressure onto a body: sun sails could thus power space probes in the future. However, when light particles (photons) hit an individual molecule and knock out an elect… [+3603 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Melting a crystal topologically - Phys.org", "description": "The introduction of topology, a branch of mathematics focusing on the properties of 'knots,' into physics has inspired revolutionary concepts such as topological phases of matter and topological phase transitions, which resulted in the Nobel Prize in Physics …", "url": "https://phys.org/news/2020-06-crystal-topologically.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/meltingacrys.jpg", "publishedAt": "2020-06-15T16:55:11Z", "content": "The introduction of topology, a branch of mathematics focusing on the properties of 'knots,' into physics has inspired revolutionary concepts such as topological phases of matter and topological phas… [+2897 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": null, "title": "Half of Earth's land is still 'untouched by humans' and could be saved - Yahoo Style", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_2d9da30a-24b4-44ae-b766-194a6f4e8bfd&lang=en-GB&inline=false", "urlToImage": null, "publishedAt": "2020-06-15T16:51:00Z", "content": "Yahoo is part of Verizon Media. Click 'I agree' to allow Verizon Media and our partners to use cookies and similar technologies to access your device and use your data (including location) to underst… [+404 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "50-Year-Old Cosmic Mystery Solved: Why Pulsars Shine Bright - SciTechDaily", "description": "Intense radio emissions produced by the fast-spinning stars are caused by newborn particles interacting with powerful electromagnetic fields, new plasma simulations suggest. When Jocelyn Bell first observed the emissions of a pulsar in 1967, the rhythmic puls…", "url": "https://scitechdaily.com/50-year-old-cosmic-mystery-solved-why-pulsars-shine-bright/", "urlToImage": "https://scitechdaily.com/images/Simulated-Density-Distribution-of-Electron-Positron-Plasma.jpg", "publishedAt": "2020-06-15T16:14:00Z", "content": "Pulsars are fast-spinning neutron stars that emit narrow, sweeping beams of radio waves. A new study identifies the origin of those radio waves. Credit: NASA’s Goddard Space Flight Center\r\nIntense ra… [+5234 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": null, "title": "The many lifetimes of plastics - Newswise", "description": "Many of us have seen informational posters at parks or aquariums specifying how long plastics bags, bottles, and other products last in the environment. They’", "url": "https://www.newswise.com/articles/the-many-lifetimes-of-plastics", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2020/06/15/CollinWardworkinginlab.jpg&width=100&height=100", "publishedAt": "2020-06-15T16:05:00Z", "content": "Newswise — Many of us have seen informational posters at parks or aquariums specifying how long plastics bags, bottles, and other products last in the environment. They’re a good reminder to not litt… [+6524 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Study: Neurons can shift how they process information about motion - Mirage News", "description": "New Rochester research indicates some neurons may be more adept than previously thought in helping you perceive the motion of objects while you move...", "url": "https://www.miragenews.com/study-neurons-can-shift-how-they-process-information-about-motion/", "urlToImage": "https://cdn1.miragenews.com/wp-content/uploads/2019/04/newsdevelopments-image.jpg", "publishedAt": "2020-06-15T16:02:15Z", "content": "New Rochester research indicates some neurons may be more adept than previously thought in helping you perceive the motion of objects while you move through the world.\r\nThe findings may have implicat… [+6460 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "NIST Develops Benchmark for Accurately Detecting Large Genetic Mutations Linked to Major Diseases - Mirage News", "description": "Credit: N. Hanacek/NIST The \"book analogy\" is a popular way of explaining genome changes. If the human genome is considered...", "url": "https://www.miragenews.com/nist-develops-benchmark-for-accurately-detecting-large-genetic-mutations-linked-to-major-diseases/", "urlToImage": "https://www.nist.gov/sites/default/files/styles/960_x_960_limit/public/images/2020/06/15/20MML004_genome-book-benchmark.jpg?itok=rjHpjYWQ", "publishedAt": "2020-06-15T15:46:15Z", "content": "The “book analogy” is a popular way of explaining genome changes. If the human genome is considered a book, a new NIST-developed benchmark will help scientists better detect large chapters that are m… [+6526 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Kevin Dickinson", "title": "This ancient crocodile walked on two legs “like humans” - Big Think", "description": "Batrachopus grandis, an ancient crocodylomorph, may have chased down land prey on its own two feet.", "url": "https://bigthink.com/surprising-science/ancient-crocodile-two-legs", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMzM5MjIyMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTU5NTA2MzgzMn0.XITqV2ZJurninMtzAyBciP9CHQiYoesy6U4-lpt3Hx4/img.jpg?width=1200&coordinates=0%2C43%2C0%2C43&height=600", "publishedAt": "2020-06-15T15:36:58Z", "content": "As any schoolchild will tell you, crocodiles have remained unchanged for millions of years. These powerful ambush predators have evolved to fit perfectly within their niche. They are so successful th… [+5309 chars]"}, {"source": {"id": null, "name": "Investopedia"}, "author": "Lucas Downey", "title": "Big Money Index Suggests Lower Market Prices Ahead - Investopedia", "description": "Adopting a different focus on the markets by concentrating on invisible waves of big money offers a whole new world of sight.", "url": "https://www.investopedia.com/big-money-index-suggests-lower-market-prices-ahead-5024917", "urlToImage": "https://www.investopedia.com/thmb/N0M-Eky9cClDK_Ew2w4xXRCbdjU=/680x440/filters:fill(auto,1)/stocks_buy_sell_istock_516682755-5e0ee885acda4fad8c9451a7be5d49b7.jpg", "publishedAt": "2020-06-15T15:24:25Z", "content": "Parallax is a cool word. It describes how the apparent position of an object looks different when viewed along two different lines of sight. Here's the easiest way to show you. Hold your right index … [+5861 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Researchers develop artificial synapse that works with living cells - Medical Xpress", "description": "In 2017, Stanford University researchers presented a new device that mimics the brain's efficient and low-energy neural learning process. It was an artificial version of a synapse—the gap across which neurotransmitters travel to communicate between neurons—ma…", "url": "https://medicalxpress.com/news/2020-06-artificial-synapse-cells.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/7-stanfordrese.jpg", "publishedAt": "2020-06-15T15:13:55Z", "content": "In 2017, Stanford University researchers presented a new device that mimics the brain's efficient and low-energy neural learning process. It was an artificial version of a synapsethe gap across which… [+4741 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Astronomers Confirm Two Planets in Proxima Centauri System | Astronomy - Sci-News.com", "description": "Astronomers have finally confirmed the existence of two exoplanets -- Proxima b and c -- orbiting Proxima Centauri, the Sun’s closest stellar neighbor and one of the best-studied low-mass stars.", "url": "http://www.sci-news.com/astronomy/two-planets-proxima-centauri-system-08534.html", "urlToImage": "http://cdn.sci-news.com/images/2020/01/image_8020f-Proxima-c.jpg", "publishedAt": "2020-06-15T14:51:53Z", "content": "Astronomers have finally confirmed the existence of two exoplanets — Proxima b and c — orbiting Proxima Centauri, the Suns closest stellar neighbor and one of the best-studied low-mass stars.\r\nThis a… [+5086 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "NASA TV Coverage Set for Final Space Station Spacewalk Power Upgrades - Mirage News", "description": "NASA astronaut Jessica Meir is pictured during a spacewalk she conducted with NASA astronaut Christina Koch Jessica Meir (out of frame) to install new...", "url": "https://www.miragenews.com/nasa-tv-coverage-set-for-final-space-station-spacewalk-power-upgrades/", "urlToImage": "https://www.nasa.gov/sites/default/files/styles/full_width/public/thumbnails/image/49396024496_91f65e9a6d_k.jpg?itok=2YFv_4jG", "publishedAt": "2020-06-15T14:48:14Z", "content": "NASA astronauts Chris Cassidy and Robert Behnken are scheduled to go outside the International Space Station (ISS) Friday, June 26, and Wednesday, July 1, for spacewalks to begin the replacement of b… [+461 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "Why Gravity Is Not Like the Other Forces - Quanta Magazine", "description": "We asked four physicists why gravity stands out among the forces of nature. We got four different answers.", "url": "https://www.quantamagazine.org/why-gravity-is-not-like-the-other-forces-20200615/", "urlToImage": "https://d2r55xnwy6nx47.cloudfront.net/uploads/2020/06/Gravity_1200_Social.jpg", "publishedAt": "2020-06-15T14:15:41Z", "content": "Physicists have traced three of the four forces of nature the electromagnetic force and the strong and weak nuclear forces to their origins in quantum particles. But the fourth fundamental force, gra… [+10267 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "A possible explanation for why West Antarctica is warming faster than East Antarctica - Phys.org", "description": "A team of researchers affiliated with several institutions in South Korea has found a possible reason for West Antarctica warming faster than East Antarctica. In their paper published in the journal Science Advances, the group describes their study of surface…", "url": "https://phys.org/news/2020-06-explanation-west-antarctica-faster-east.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/5ee752c91aa58.jpg", "publishedAt": "2020-06-15T13:34:50Z", "content": "A team of researchers affiliated with several institutions in South Korea has found a possible reason for West Antarctica warming faster than East Antarctica. In their paper published in the journal … [+2994 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Physicists' innovative model provides insight into behavior of black hole at center of our galaxy - Mirage News", "description": "Physicists' innovative model provides insight into the behavior of the black hole at the center of our galaxy By Harrison Tasoff Santa Barbara, CA ...", "url": "https://www.miragenews.com/physicists-innovative-model-provides-insight-into-behavior-of-black-hole-at-center-of-our-galaxy/", "urlToImage": "https://www.news.ucsb.edu/sites/default/files/video_embed_field_thumbnails/vimeo/428265377.jpg", "publishedAt": "2020-06-15T13:10:22Z", "content": "Like most galaxies, the Milky Way hosts a supermassive black hole at its center. Called Sagittarius A*, the object has captured astronomers’ curiosity for decades. And now there is an effort to image… [+5619 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Starburst Galaxy: A Bright Find Predicted by Einstein’s General Theory of Relativity - SciTechDaily", "description": "Seen here in incredible detail, thanks to the NASA/ESA Hubble Space Telescope, is the starburst galaxy formally known as PLCK G045.1+61.1. The galaxy appears as multiple reddish dots near the center of the image and is being gravitationally lensed by a cluste…", "url": "https://scitechdaily.com/starburst-galaxy-a-bright-find-predicted-by-einsteins-general-theory-of-relativity/", "urlToImage": "https://scitechdaily.com/images/Starburst-Galaxy-Hubble-Space-Telescope.jpg", "publishedAt": "2020-06-15T12:16:59Z", "content": "Seen here in incredible detail, thanks to the NASA/ESA Hubble Space Telescope, is the starburst galaxy formally known as PLCK G045.1+61.1. Credit: ESA/Hubble &amp; NASA, B. Frye\r\nSeen here in incredi… [+1078 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Mindy Weisberger", "title": "Hidden temple in a buried Roman city discovered by ground-penetrating radar - Livescience.com", "description": "No excavation required", "url": "https://www.livescience.com/hidden-temple-buried-roman-city.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Q8j8UV6jDqu7yWZ8BZoq5m-1200-80.jpg", "publishedAt": "2020-06-15T12:15:00Z", "content": "A hidden temple was recently discovered in an ancient Roman city that's mostly still underground.\r\nThe temple was once part of the city of Falerii Novi, which was abandoned more than 1,000 years ago … [+4708 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "For The First Time, The Lifetime of a Neutron Has Been Measured in Space - ScienceAlert", "description": "For the first time, scientists have measured the lifespan of a neutron in the void of space. The margin of error means we can't narrow it down yet, but once the technique is refined, it could prove to be a game changer.", "url": "https://www.sciencealert.com/for-the-first-time-the-lifetime-of-a-neutron-has-been-measured-in-space", "urlToImage": "https://www.sciencealert.com/images/2020-06/processed/atom-zoom_1024.jpg", "publishedAt": "2020-06-15T07:49:04Z", "content": "For the first time, scientists have measured the lifespan of a neutron in the void of space. The margin of error means we can't narrow it down yet, but once the technique is refined, it could prove t… [+4666 chars]"}, {"source": {"id": null, "name": "Jbklutse.com"}, "author": "Expert Writer", "title": "Orthopaedic surgery in Singapore for repair of rotator Cuff Tears - JBKlutse", "description": "When A Rotator Cuff Tear Requires Surgery A tear in the shoulder's rotator cuff can be disabling and painful, but", "url": "https://www.jbklutse.com/orthopaedic-surgery-in-singapore/", "urlToImage": "https://www.jbklutse.com/wp-content/uploads/2020/06/Canva-Emergency-Surgery-Operation.jpg", "publishedAt": "2020-06-15T04:18:45Z", "content": "When A Rotator Cuff Tear Requires Surgery\r\nA tear in the shoulder’s rotator cuff can be disabling and painful, but it can be fixed through an orthopaedic surgery in Singapore. There are different tre… [+3677 chars]"}, {"source": {"id": null, "name": "Science Codex"}, "author": null, "title": "Carbon emission from permafrost soils underestimated by 14% - Science Codex", "description": null, "url": "https://www.sciencecodex.com/carbon-emission-permafrost-soils-underestimated-14-649560", "urlToImage": null, "publishedAt": "2020-06-15T04:00:00Z", "content": "Picture 500 million cars stacked in rows. That's how much carbon--about 1,000 petagrams, or one billion metric tons--is locked away in Arctic permafrost. \r\nCurrently, scientists estimate that 5-15% o… [+4395 chars]"}, {"source": {"id": null, "name": "Science Codex"}, "author": null, "title": "Excitons form superfluid in certain 2D combos - Science Codex", "description": null, "url": "https://www.sciencecodex.com/excitons-form-superfluid-certain-2d-combos-649578", "urlToImage": "https://media.eurekalert.org/multimedia_prod/pub/web/234707_web.jpg", "publishedAt": "2020-06-15T04:00:00Z", "content": "HOUSTON - (June 15, 2020) - Mixing and matching computational models of 2D materials led scientists at Rice University to the realization that excitons -- quasiparticles that exist when electrons and… [+3988 chars]"}, {"source": {"id": null, "name": "Science Codex"}, "author": null, "title": "Otago researchers discover the origins of the beloved guinea pig - Science Codex", "description": null, "url": "https://sciencecodex.com/otago-researchers-discover-origins-beloved-guinea-pig-649688", "urlToImage": "https://media.eurekalert.org/multimedia_prod/pub/web/234812_web.jpg", "publishedAt": "2020-06-15T04:00:00Z", "content": "New University of Otago research sheds light on guinea pig domestication and how and why the small, furry animals became distributed around the world.\r\nJust published in the international science jou… [+3875 chars]"}, {"source": {"id": null, "name": "Australian Mining"}, "author": "Salomae Haselgrove", "title": "How using bacteria could be the future of iron extraction - Australian Mining", "description": "The future of iron ore mining could be in microscopic bacteria, according to a study by the University of California’s Bakar Fellows Program.", "url": "https://www.australianmining.com.au/news/how-using-bacteria-could-be-the-future-of-iron-extraction/", "urlToImage": "https://dszs098s1om2l.cloudfront.net/australianmining.com.au/2020/06/15112503/University-of-California.jpg", "publishedAt": "2020-06-15T02:12:00Z", "content": "Professor of plant and microbial biology Arash Komeili and Bakar Fellows Program student Carly Grant.\r\nThe future of iron ore mining could be in microscopic bacteria, according to a study by the Univ… [+2185 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Jon Fingas", "title": "Scientists locate the first fast radio burst in the Milky Way - Yahoo Finance Australia", "description": "Astronomers have found the first known fast radio burst in the Milky Way, potentially solving one of the universe's greater mysteries.", "url": "https://au.finance.yahoo.com/news/first-fast-radio-burst-in-milky-way-002145743.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/2c07Qk9nDB2fRBeYai.XtQ--~B/aD0zNjYyO3c9NTI4ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-06/e79624b0-af07-11ea-a5ce-5ea518153ab6", "publishedAt": "2020-06-15T00:25:27Z", "content": "Fast radio bursts in the cosmos might not be quite so mysterious before long. Astronomers have detected the first known burst coming from within the Milky Way galaxy. It originated with the SGR 1935+… [+1334 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Caroline Spry et al., The Conversation", "title": "Unprecedented Discovery Shows The Resilience of Aboriginal Culture in Australia - ScienceAlert", "description": "Trees marked by Aboriginal cultural practices are a distinctive part of the Australian landscape.", "url": "https://www.sciencealert.com/a-stone-found-wedged-in-a-gum-tree-reveal-australia-s-aboriginal-history", "urlToImage": "https://www.sciencealert.com/images/2020-06/processed/file-20200608-176585-1uqmg8l_1_1024.jpg", "publishedAt": "2020-06-15T00:12:31Z", "content": "Trees marked by Aboriginal cultural practices are a distinctive part of the Australian landscape.\r\nA recent discovery on Wiradjuri country in New South Wales shows some of these \"culturally modified … [+5557 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Jon Fingas", "title": "Germany's COVID-19 contact tracing app arrives this week - Yahoo Finance Australia", "description": "Germany says its COVID-19 contact tracing app is ready to launch this week.", "url": "https://au.finance.yahoo.com/news/germany-covid-19-contact-tracing-app-ready-213819369.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/D4OM9BdesbyUVrzMTEQGZQ--~B/aD0yNjM4O3c9Mzg3MztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-06/b429c4d0-ae7e-11ea-9bf5-212d8b8bd295", "publishedAt": "2020-06-14T21:38:00Z", "content": "Germany will be the next big country to launch a COVID-19 contact tracing app. Health Minister Jens Spahn has confirmed that the app is coming this week, with reports suggesting that it might be read… [+1219 chars]"}]}