{"status": "ok", "totalResults": 56, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "A dinosaur's last meal: A 110 million-year-old dinosaur's stomach contents are revealed - CNN", "description": "A dinosaur with impressive armored plates across its back became mummified around 110 million years ago, and now we know what this nodosaur ate for its last meal, according to a new study.", "url": "https://www.cnn.com/2020/06/02/world/nodosaur-fossil-stomach-contents-scn-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200602130850-01-nodosaur-fossils-borealopelta-markmitchelli-super-tease.jpg", "publishedAt": "2020-06-03T00:34:51Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Falcon 9 booster used to launch NASA astronauts arrives at Port Canaveral - WKMG News 6 ClickOrlando", "description": "The SpaceX rocket booster used to launch NASA astronauts Bob Behnken and Doug Hurley on their mission to the International Space Station, making history by b...", "url": "https://www.youtube.com/watch?v=N09dg9zipIM", "urlToImage": "https://i.ytimg.com/vi/N09dg9zipIM/maxresdefault.jpg", "publishedAt": "2020-06-02T23:14:57Z", "content": "The SpaceX rocket booster used to launch NASA astronauts Bob Behnken and Doug Hurley on their mission to the International Space Station, making history by being the first private rocket to do so, he… [+37 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Brad  Bergan", "title": "Chandra Saw Two Black Hole Jets Gushing at 80% Light Speed - Interesting Engineering", "description": "The Chandra X-ray Observatory captured images of a black hole gushing out ultra-hot material at greater than 80% of the speed of light, and formed the observations into a short movie.", "url": "https://interestingengineering.com/two-black-hole-jets-gushing-out-at-80-light-speed", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/zDOZA7Yjwk/sizes/two-black-hole-jets-gushing-out-at-80-of-light-speed_md.jpg", "publishedAt": "2020-06-02T21:36:51Z", "content": "Astronomers caught a black hole gushing ultra-hot material into space at nearly the speed of light and captured the moment in a new short movie from NASA's Chandra X-ray Observatory, according to NAS… [+2881 chars]"}, {"source": {"id": null, "name": "Business Insider Australia"}, "author": "Morgan McFall-Johnsen", "title": "The sequined dinosaur toy that rode on SpaceX's historic launch was the winner of a vote by the astronauts' young sons - Business Insider Australia", "description": "NASA astronauts Bob Behnken and Doug Hurley – who made history on Saturday when they became the first people to fly a commercial spacecraft – have revealed the story of the mysterious stowaway on their flight: a sequined dinosaur plushie.", "url": "https://www.businessinsider.com.au/spacex-astronauts-sons-elected-dinosaur-toy-first-crewed-launch-2020-6", "urlToImage": "https://i.insider.com/5ed2cc7b988ee314f770c5d6", "publishedAt": "2020-06-02T20:33:00Z", "content": "NASA astronauts Bob Behnken and Doug Hurley – who made history on Saturday when they became the first people to fly a commercial spacecraft – have revealed the story of the mysterious stowaway on the… [+2780 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Luke Strotz", "title": "A 515 million-year-old freeloader: this nutrient-stealing marine worm is the oldest known parasite - The Conversation AU", "description": "We studied 515 million-year-old brachiopod fossils from southern China. These marine invertebrates were common in the geological past.", "url": "https://theconversation.com/a-515-million-year-old-freeloader-this-nutrient-stealing-marine-worm-is-the-oldest-known-parasite-139560", "urlToImage": "https://images.theconversation.com/files/339052/original/file-20200602-95018-ht3j2w.png?ixlib=rb-1.1.0&rect=0%2C201%2C3199%2C1599&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2020-06-02T20:02:00Z", "content": "The COVID-19 outbreak has put into stark relief the disruption parasites can cause, both in human society and ecosystems. \r\nResearchers have long sought to better understand the evolutionary importan… [+5806 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "New research deepens understanding of Earth's interaction with solar wind - Mirage News", "description": "(Photo by Elle Starkman) PPPL physicist Derek Schaeffer in front of an image of a jet airplane creating an atmospheric shock wave As the Earth orbits...", "url": "https://www.miragenews.com/new-research-deepens-understanding-of-earth-s-interaction-with-solar-wind/", "urlToImage": "https://www.pppl.gov/sites/pppl/files/styles/highlighted-related-image/public/article/highlighted-related-image/Derek_72dpi.jpg?itok=bIdnKT4V&qbbdkr", "publishedAt": "2020-06-02T19:49:00Z", "content": "As the Earth orbits the sun, it plows through a stream of fast-moving particles that can interfere with satellites and global positioning systems. Now, a team of scientists at the U.S. Department of … [+4634 chars]"}, {"source": {"id": null, "name": "SETI Institute"}, "author": null, "title": "Martian Moon's Orbit Hints at an Ancient Ring of Mars - SETI Institute", "description": null, "url": "https://www.seti.org/press-release/martian-moons-orbit-hints-ancient-ring-mars", "urlToImage": null, "publishedAt": "2020-06-02T19:14:27Z", "content": "Scientists from the SETI Institute and Purdue University have found that the only way to produce Deimoss unusually tilted orbit is for Mars to have had a ring billions of years ago. While some of the… [+3755 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Ryan Whitwam", "title": "Watch SpaceX's Latest Starship Prototype Blow Itself to Bits - ExtremeTech", "description": "Just a month after nailing a pressurization test, the Starship SN4 prototype exploded during an engine test. It's not clear what happened, but CEO Elon Musk has offered some hints.", "url": "https://www.extremetech.com/extreme/311239-watch-spacexs-latest-starship-prototype-blow-itself-to-bits", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2020/06/sn4.jpg", "publishedAt": "2020-06-02T18:42:26Z", "content": "SpaceX has made the Falcon 9 the heart of its launch operations, sending both cargo and now people into space. However, the private spaceflight company plans to transition its operations to its Stars… [+2268 chars]"}, {"source": {"id": null, "name": "Liverpool Echo"}, "author": "Jess Flaherty", "title": "Major astronomical events to look out for after the SpaceX NASA rocket launch - Liverpool Echo", "description": "There's plenty for star-gazers to see this month", "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/major-astronomical-events-look-out-18347708", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article18337410.ece/ALTERNATES/s1200/0_JS212731084.jpg", "publishedAt": "2020-06-02T17:39:02Z", "content": "There are several major astronomical events happening this month.\r\nWith the popularity of the SpaceX starlink satellites drumming up interest in what's going on above us, there are a number of new as… [+2639 chars]"}, {"source": {"id": null, "name": "Asia Times"}, "author": "Frank Chen", "title": "China takes rivalry with US into space - Asia Times", "description": "The rivalry between China and the United States will heat up this summer as the two countries send rovers to Mars. It appears that China’s trek to the red planet is not being hampered by the Covid-…", "url": "http://asiatimes.com/2020/06/china-takes-rivalry-with-us-into-space/", "urlToImage": "https://i2.wp.com/asiatimes.com/wp-content/uploads/2020/06/000_1NB9OI.jpg?fit=1024%2C682&ssl=1", "publishedAt": "2020-06-02T17:33:00Z", "content": "The rivalry between China and the United States will heat up this summer as the two countries send rovers to Mars.\r\nIt appears that Chinas trek to the red planet is not being hampered by the Covid-19… [+4671 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Pet Talk Tuesday - COVID puppy syndrome - WKBW TV | Buffalo, NY", "description": "Pet Talk Tuesday - COVID puppy syndrome", "url": "https://www.youtube.com/watch?v=ErFf5qAaGSI", "urlToImage": "https://i.ytimg.com/vi/ErFf5qAaGSI/maxresdefault.jpg", "publishedAt": "2020-06-02T16:40:01Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Innovationorigins.com"}, "author": "Petra Wiesmayer", "title": "Paradigm shift in the use of animal experiments: Fewer animals, more reliable results - Innovation Origins", "description": "Each year, around three million animals suffer and die in research laboratories worldwide. According to figures from the German Animal Welfare Federation, a total of 2,825,066 vertebrates and cephalop", "url": "https://innovationorigins.com/paradigm-shift-in-the-use-of-animal-experiments-fewer-animals-more-reliable-results/", "urlToImage": "https://innovationorigins.com/wp-content/uploads/2020/06/adult-tricolor-beagle-1031466-scaled.jpg", "publishedAt": "2020-06-02T16:37:50Z", "content": null}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Latest climate models show more intense droughts to come - Science Daily", "description": "An analysis of new climate model projections shows southwestern Australia and parts of southern Australia will see longer and more intense droughts due to a lack of rainfall caused by climate change. But Australia is not alone. Across the globe, several impor…", "url": "https://www.sciencedaily.com/releases/2020/06/200602110121.htm", "urlToImage": null, "publishedAt": "2020-06-02T15:37:14Z", "content": "An analysis of new climate model projections by Australian researchers from the ARC Centre of Excellence for Climate Extremes shows southwestern Australia and parts of southern Australia will see lon… [+3190 chars]"}, {"source": {"id": null, "name": "BroBible"}, "author": "Douglas Charles", "title": "Russian Space Agency Not Impressed By Manned NASA SpaceX Launch: ‘Should Have Happened Long Ago’ - BroBible", "description": "While thousands of people in the United States and around…", "url": "https://brobible.com/culture/article/russia-not-impressed-spacex-launch/", "urlToImage": "https://brobible.com/wp-content/uploads/2020/06/Russia-Not-Impressed-By-SpaceX-Launch-Should-Have-Happened-Long-Ago.jpg?quality=90&w=650", "publishedAt": "2020-06-02T15:34:38Z", "content": "Getty Image\r\nWhile thousands of people in the United States and around the world celebrated the first manned space launch from American soil since 2011 by NASA and SpaceX, and the first sent into spa… [+1881 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Kashmira Gander", "title": "Scientists Mixed Squid DNA With Human Cells to Control Their Transparency in 'Revolutionary' Study - Newsweek", "description": "The team were inspired by see-through sea creatures like squids.", "url": "https://www.newsweek.com/scientists-mixed-squid-dna-human-cells-control-their-transparency-revolutionary-study-1508024", "urlToImage": "https://d.newsweek.com/en/full/1595854/reflectin-nature.jpg", "publishedAt": "2020-06-02T15:00:34Z", "content": "Scientists have changed the degree of transparency of human cells in a laboratory, according to a study. It is hoped the technique, inspired by see-through sea creatures, will help us gain a deeper u… [+5911 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers recommend ways to reduce the number of experiments - News-Medical.Net", "description": "For some scientific disciplines, such as medical or drug research, experiments with live animals are still indispensable.", "url": "https://www.news-medical.net/news/20200602/Researchers-recommend-ways-to-reduce-the-number-of-experiments.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2fNeuroscience-620x480.jpg", "publishedAt": "2020-06-02T14:41:43Z", "content": "For some scientific disciplines, such as medical or drug research, experiments with live animals are still indispensable. Scientists are aware of their responsibilities in this sensitive area and str… [+3652 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Phil Plait", "title": "Got lithium? Thank a long-gone explodey white dwarf - SYFY WIRE", "description": "Three million people in the U.S. alone use lithium as a medication to treat mental illness, including bipolar and major depressive disorders. Lithium is also used in batteries; I have four large lithium-ion batteries in my garage that charge every day from so…", "url": "https://www.syfy.com/syfywire/got-lithium-thank-a-long-gone-explodey-white-dwarf", "urlToImage": "https://www.syfy.com/sites/syfy/files/styles/1200x680/public/davidhardy_rsoph.jpg", "publishedAt": "2020-06-02T13:23:46Z", "content": "Three million people in the U.S. alone use lithium as a medication to treat mental illness, including bipolar and major depressive disorders. Lithium is also used in batteries; I have four large lith… [+5258 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Astronomers found the exact location of four fast radio bursts - Tech Explorist", "description": "Using a specially designed transient detector on CSIRO’s ASKAP radio telescope in outback Western Australia, astronomers precisely localized the four fast radio bursts came from the outskirts of their home galaxies.", "url": "https://www.techexplorist.com/exact-location-four-fast-radio-bursts/32756/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/06/four-frbs.jpg", "publishedAt": "2020-06-02T12:55:35Z", "content": "Fast Radio Bursts are very mysterious bursts of radio waves, coming from all over the sky. In just a millisecond, a single burst releases more energy than our Sun emits in 80 years.\r\nAlthough the exa… [+2222 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researchers discover a new type of matter inside neutron stars - Phys.org", "description": "A Finnish research group has found strong evidence for the presence of exotic quark matter inside the cores of the largest neutron stars in existence. They reached this conclusion by combining recent results from theoretical particle and nuclear physics to me…", "url": "https://phys.org/news/2020-06-neutron-stars.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/finnishresea.jpg", "publishedAt": "2020-06-02T12:04:55Z", "content": "A Finnish research group has found strong evidence for the presence of exotic quark matter inside the cores of the largest neutron stars in existence. They reached this conclusion by combining recent… [+6187 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "A better model for neutrophil-related diseases - Mirage News", "description": "Neutrophils are critical immune cells for antimicrobial defense, but they can exacerbate a number of diseases, perhaps including COVID-19. The...", "url": "https://www.miragenews.com/a-better-model-for-neutrophil-related-diseases/", "urlToImage": "https://actu.epfl.ch/static/upload/fckeditorimage/c4/dd/e400dddc.jpg", "publishedAt": "2020-06-02T10:26:14Z", "content": "Neutrophils are critical immune cells for antimicrobial defense, but they can exacerbate a number of diseases, perhaps including COVID-19. The traditional approaches to study neutrophils in animal mo… [+2829 chars]"}, {"source": {"id": null, "name": "Dual Dove"}, "author": "Rada Mateescu", "title": "New Universe Discovery Is Unveiled - Dual Dove", "description": "It’s been just revealed that an analysis of more than 200k spiral galaxies has revealed some pretty unexpected links between spin directions of galaxies and the structures that are formed by …", "url": "https://www.dualdove.com/new-universe-discovery-is-unveiled/10797/", "urlToImage": "https://www.dualdove.com/wp-content/uploads/2020/06/2019.09.18-genesi.jpg", "publishedAt": "2020-06-02T09:16:14Z", "content": "It’s been just revealed that an analysis of more than 200k spiral galaxies has revealed some pretty unexpected links between spin directions of galaxies and the structures that are formed by the link… [+2038 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Gene found that causes eyes to wither in cavefish - Phys.org", "description": "Mexican cavefish spend their entire lives in the dark. With no need for vision, many of them lost functional eyes. In more than 30 varieties of Mexican cavefish, the eyes stop developing as embryos grow into larvae. Although they are still the same species as…", "url": "https://phys.org/news/2020-06-gene-eyes-wither-cavefish.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/genefoundtha.jpg", "publishedAt": "2020-06-02T09:11:14Z", "content": "Mexican cavefish spend their entire lives in the dark. With no need for vision, many of them lost functional eyes. In more than 30 varieties of Mexican cavefish, the eyes stop developing as embryos g… [+4478 chars]"}, {"source": {"id": null, "name": "Mirror Online"}, "author": "Shivali Best", "title": "Coronavirus 'could be killed by a handheld UV light device', scientists say - Mirror Online", "description": "Scientists at Penn University, the University of Minnesota and two Japanese universities claim that coronavirus could be killed by a handheld UV light device", "url": "https://www.mirror.co.uk/science/coronavirus-could-killed-handheld-uv-22124247", "urlToImage": "https://i2-prod.mirror.co.uk/science/article22124352.ece/ALTERNATES/s1200/0_JS212865576.jpg", "publishedAt": "2020-06-02T09:05:47Z", "content": "With coronavirus cases around the world now at over 6.2 million, scientists have been working around the clock to find a way to halt the pandemic. \r\nNow, scientists at Penn University, the University… [+1939 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Terahertz radiation can disrupt proteins in living cells - Mirage News", "description": "Researchers from the RIKEN Center for Advanced Photonics and collaborators have discovered that terahertz radiation, contradicting conventional belief,...", "url": "https://www.miragenews.com/terahertz-radiation-can-disrupt-proteins-in-living-cells/", "urlToImage": "https://www.riken.jp/news-pubs-en/research-news-en/2020-research-en/20200602_2_fig1.png", "publishedAt": "2020-06-02T09:02:16Z", "content": "Researchers from the RIKEN Center for Advanced Photonics and collaborators have discovered that terahertz radiation, contradicting conventional belief, can disrupt proteins in living cells without ki… [+3305 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jayme Deloss", "title": "Atmospheric scientists identify cleanest air on Earth in first-of-its-kind study - Phys.org", "description": "Colorado State University Distinguished Professor Sonia Kreidenweis and her research group identified an atmospheric region unchanged by human-related activities in the first study to measure bioaerosol composition of the Southern Ocean south of 40 degrees so…", "url": "https://phys.org/news/2020-06-atmospheric-scientists-cleanest-air-earth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/1-atmospherics.jpg", "publishedAt": "2020-06-02T08:16:23Z", "content": "Colorado State University Distinguished Professor Sonia Kreidenweis and her research group identified an atmospheric region unchanged by human-related activities in the first study to measure bioaero… [+4203 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Matthew Wills", "title": "Evolution: why it seems to have a direction and what to expect next - The Conversation UK", "description": "Evolution seems to lead to increasing complexity of species. But perhaps a dominant, intelligent species like humans will always end up destroying itself.", "url": "https://theconversation.com/evolution-why-it-seems-to-have-a-direction-and-what-to-expect-next-139706", "urlToImage": "https://images.theconversation.com/files/338870/original/file-20200601-95009-14e88ht.jpg?ixlib=rb-1.1.0&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2020-06-02T08:04:00Z", "content": "The diversity and complexity of life on Earth is astonishing: 8 million or more living species from algae to elephants all evolved from a simple, single-celled common ancestor around 3.5 billion year… [+6396 chars]"}, {"source": {"id": null, "name": "Boss Hunting"}, "author": "https://www.facebook.com/garry.lu.35", "title": "Here's How Much The Elon Musk Payout Is Worth - Boss Hunting", "description": "Elon Musk has just unlocked the first of his extensive 12-tier compensation agreement. The value of this payout? Well over US$775 million.", "url": "https://www.bosshunting.com.au/hustle/elon-musk-payout/", "urlToImage": "https://www.bosshunting.com.au/wp-content/uploads/2020/06/tesla-ceo-elon-musk-speaks-during-the-unveiling-of-the-new-news-photo-1585252263-1024x641.jpg", "publishedAt": "2020-06-02T05:30:14Z", "content": "When it comes to Tesla, Elon Musk doesn’t draw a salary as CEO nor product architect. Instead, he receives a very special and hyper-specific Elon Musk payout; which is outlined through an extensive 1… [+1663 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Large Simulation Finds New Origin of Supermassive Black Holes - Mirage News", "description": "Snapshots of the simulations showing the distribution of matter in the Universe at the time of black hole formation (top) and the density distribution of...", "url": "https://www.miragenews.com/large-simulation-finds-new-origin-of-supermassive-black-holes/", "urlToImage": "https://www.nao.ac.jp/en/contents/news/science/2020/20200602-cfca-fig.jpg", "publishedAt": "2020-06-02T05:14:53Z", "content": "Snapshots of the simulations showing the distribution of matter in the Universe at the time of black hole formation (top) and the density distribution of black hole-producing gas clouds (bottom). In … [+3919 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Space X Falcon-9 Rocket Manned Space Launch 2020 - WHAS11", "description": "The Coast Guard Cutter Moray (WPB-87331) patrols the waters near the Space X Falcon 9 Crew Dragon launch site May 30, 2020 to ensure vessels stay out of the ...", "url": "https://www.youtube.com/watch?v=cFd0j1vTTp8", "urlToImage": "https://i.ytimg.com/vi/cFd0j1vTTp8/maxresdefault.jpg", "publishedAt": "2020-06-02T03:15:06Z", "content": null}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Anxious wait as sun 'wakes up' | News Mail - News Mail", "description": "A surge in solar activity has been detected as the sun enters a new stage, but what impact will it have on Earth?", "url": "https://www.news.com.au/technology/science/space/nasa-says-biggest-solar-flare-in-three-years-could-be-sun-waking-up/news-story/5a433c9ff99fdcb6cd50743dbdbb4966", "urlToImage": "https://media.apnarm.net.au/media/images/2020/06/02/v3imagesbin23b3f944a9d5403a69ff1d30c7b63a8d-27s7ujeb178ac31sfu2_ct1880x930.jpg", "publishedAt": "2020-06-02T00:33:00Z", "content": "US space agency NASA has said the sun's solar cycle could be \"waking up\" after the biggest solar flare recorded in almost three years.\r\nNASA spacecraft spotted the new family of sunspots appearing on… [+2412 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Cone snail insulin research could jumpstart the development of better diabetes treatments - News-Medical.Net", "description": "Nearly a century after insulin was discovered, an international team of researchers including University of Utah Health scientists report that they have developed the world's smallest, fully functional version of the hormone, one that combines the potency of …", "url": "https://www.news-medical.net/news/20200601/Cone-snail-insulin-research-could-jumpstart-the-development-of-better-diabetes-treatments.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2fInsulin-620x480.jpg", "publishedAt": "2020-06-01T23:18:12Z", "content": "Nearly a century after insulin was discovered, an international team of researchers including University of Utah Health scientists report that they have developed the world's smallest, fully function… [+4570 chars]"}, {"source": {"id": null, "name": "Webby Feed"}, "author": "Carrie J. Bronstein", "title": "Mars Has a Magnetic Field and Now We Know More About It - Webby Feed", "description": "The difference between Earth and Mars is that Mars doesn’t really have a global magnetic field to protect it from the space weather. However, it has spots of induced magnetism. Scientists were able to create a detailed map of...", "url": "https://www.webbyfeed.com/mars-has-a-magnetic-field-and-now-we-know-more-about-it/8978/", "urlToImage": "https://i2.wp.com/www.webbyfeed.com/wp-content/uploads/2020/06/mars.jpg?fit=700%2C700&ssl=1", "publishedAt": "2020-06-01T23:05:34Z", "content": "The difference between Earth and Mars is that Mars doesn’t really have a global magnetic field to protect it from the space weather. However, it has spots of induced magnetism. Scientists were able t… [+1551 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Jordan Strickler", "title": "The Milky Way’s halo might be thousands of times hotter than the sun’s surface - ZME Science", "description": "The halo surrounding the Milky Way may be much hotter than originally thought.", "url": "https://www.zmescience.com/science/milky-way-halo-hotter-05235/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2020/05/MilkyWayHalo.jpg", "publishedAt": "2020-06-01T22:41:41Z", "content": "Artist’s illustration of the halo of hot gas surrounding the Milky Way galaxy (Credit: NASA)\r\nOur home galaxy, the Milky Way, contains a halo that consists of a hazy fog of dust, gas, and dark matter… [+2871 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Brittany Enos", "title": "Asteroids Ryugu and Bennu were formed by the destruction of a large asteroid - Phys.org", "description": "Scientists with NASA's first asteroid sample return mission, OSIRIS-REx, are gaining a new understanding of asteroid Bennu's carbon-rich material and signature \"spinning-top\" shape. The team, led by the University of Arizona, has discovered that the asteroid'…", "url": "https://phys.org/news/2020-05-asteroids-ryugu-bennu-destruction-large.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/theasteroids.jpg", "publishedAt": "2020-06-01T22:34:05Z", "content": "Scientists with NASA's first asteroid sample return mission, OSIRIS-REx, are gaining a new understanding of asteroid Bennu's carbon-rich material and signature \"spinning-top\" shape. The team, led by … [+5047 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Kirigami shoe grips could help reduce risk of falling among older adults - News-Medical.Net", "description": "You've never seen a pair of snake skin shoes like this before.", "url": "https://www.news-medical.net/news/20200601/Kirigami-shoe-grips-could-help-reduce-risk-of-falling-among-older-adults.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2fSeniors-620x480.jpg", "publishedAt": "2020-06-01T21:46:16Z", "content": "Reviewed by Emily Henderson, B.Sc.Jun 1 2020\r\nYou've never seen a pair of snake skin shoes like this before.\r\nResearchers at the Harvard John A. Paulson School of Engineering and Applied Sciences (SE… [+2964 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Mike Wehner", "title": "Incredible video shows SpaceX’s Starship prototype exploding - BGR", "description": "SpaceX’s Starship prototype SN4 exploded during a static fire test on Friday, just hours before the second launch attempt of the Crew Dragon. The two projects are completely different and the explosion had no impact on the NASA mission. Video of the explosion…", "url": "https://bgr.com/2020/06/01/starship-explosion-spacex-static-fire-test-video/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2020/06/screen-shot-2020-06-01-at-12.27.51-pm.png", "publishedAt": "2020-06-01T21:22:07Z", "content": "<ul><li>SpaceX’s Starship prototype SN4 exploded during a static fire test on Friday, just hours before the second launch attempt of the Crew Dragon. </li><li>The two projects are completely differen… [+2594 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Scientists detect Crab Nebula using innovative gamma-ray telescope - Mirage News", "description": "Scientists in the Cherenkov Telescope Array (CTA) consortium today announced at the 236th meeting of the American Astronomical Society (AAS) that they...", "url": "https://www.miragenews.com/scientists-detect-crab-nebula-using-innovative-gamma-ray-telescope/", "urlToImage": "https://d26toa8f6ahusa.cloudfront.net/wp-content/uploads/2020/06/01133258/FredWhipple_WEB_Header-150x150.jpg", "publishedAt": "2020-06-01T20:02:12Z", "content": "Scientists in the Cherenkov Telescope Array (CTA) consortium today announced at the 236th meeting of the American Astronomical Society (AAS) that they have detected gamma rays from the Crab Nebula us… [+7720 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rob Waugh", "title": "Astronomers close in on source of mysterious radio bursts from space - Yahoo News Australia", "description": "Scientists have analysed the source of some bursts and ruled out some possible sources, including the supermassive black holes at the heart of galaxies like our own Milky Way.", "url": "https://au.news.yahoo.com/alien-radio-bursts-174533417.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/HJ7UWK9q.Gd5KkFrFGmE6w--~B/aD0xMjAwO3c9MzIwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-06/406991a0-a42f-11ea-9f5f-f3f2a2202286", "publishedAt": "2020-06-01T17:45:00Z", "content": "Astronomers are closer to understanding the source of one of the great mysteries of space fast radio bursts detected by telescopes on Earth.\r\nFast radio bursts are bright pulses of radio emission whi… [+2576 chars]"}, {"source": {"id": null, "name": "The Sun"}, "author": "Debbie White", "title": "What is Anonymous? Hacker group that has re-emerged over George Floyd protests - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/3885265/what-anonymous-hacker-george-floyd-protests/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2017/11/NINTCHDBPICT000586240794-e1591023759412.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-06-01T17:25:42Z", "content": "\"HACKTIVIST\" group Anonymous has sprung back into life - apparently disabling the Minneapolis Police Department website in protest against George Floyd's death.\r\nThe force has been warned that more o… [+2513 chars]"}, {"source": {"id": null, "name": "Brinkwire.com"}, "author": null, "title": "Like a treasure map, brain region emphasizes reward location. - Brinkwire", "description": null, "url": "https://en.brinkwire.com/news/like-a-treasure-map-brain-region-emphasizes-reward-location/", "urlToImage": null, "publishedAt": "2020-06-01T16:45:33Z", "content": "We are free to wander but usually when we go somewhere it’s for a reason. In a new study, researchers at The Picower Institute for Learning and Memory show that as we pursue life’s prizes a region of… [+3435 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA astronaut press conference from the International Space Station - FOX10 News", "description": "NASA astronaut press conference from the International Space Station", "url": "https://www.youtube.com/watch?v=K0BtTct3kqA", "urlToImage": "https://i.ytimg.com/vi/K0BtTct3kqA/hqdefault.jpg", "publishedAt": "2020-06-01T16:04:37Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Cascade to criticality - Mirage News", "description": "Combined theoretical and experimental work unveils a novel mechanism through which criticality emerges in quasiperiodic structures - a finding that...", "url": "https://www.miragenews.com/cascade-to-criticality/", "urlToImage": "https://www.phys.ethz.ch/news-and-events/d-phys-news/2020/06/the-cascade-to-criticality/_jcr_content/news_content/fullwidthimage/image.imageformat.fullwidth.59144533.png", "publishedAt": "2020-06-01T15:50:16Z", "content": "The essence, and beauty, of quasiperiodic structures can be grasped by considering floor plates. A floor can be readily tiled without gaps using identical pieces of, for example, triangular, square o… [+5983 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Finnish researchers have discovered a new type of matter inside neutron stars - EurekAlert", "description": "A Finnish research group has found strong evidence for the presence of exotic quark matter inside the cores of the largest neutron stars in existence. The conclusion was reached by combining recent results from theoretical particle and nuclear physics to meas…", "url": "https://www.eurekalert.org/pub_releases/2020-06/uoh-frh060120.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/233356_web.jpg", "publishedAt": "2020-06-01T15:47:59Z", "content": "IMAGE: Confirming the existence of quark cores inside neutron stars has been one of the most important goals of neutron star physics for the last 40 years.\r\n view more \r\nCredit: Jyrki Hokkanen, CSC -… [+6530 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Science X staff", "title": "These flexible feet help robots walk faster - Tech Xplore", "description": "Roboticists at the University of California San Diego have developed flexible feet that can help robots walk up to 40 percent faster on uneven terrain such as pebbles and wood chips. The work has applications for search-and-rescue missions as well as space ex…", "url": "https://techxplore.com/news/2020-06-flexible-feet-robots-faster.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/theseflexibl.jpg", "publishedAt": "2020-06-01T15:46:34Z", "content": "Roboticists at the University of California San Diego have developed flexible feet that can help robots walk up to 40 percent faster on uneven terrain such as pebbles and wood chips. The work has app… [+4122 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Study shows dry air drives overlooked changes in how plants drink and breathe - Phys.org", "description": "Plants drink up much of the water that falls to Earth. They take what they need before releasing it through tiny holes on the underside of their leaves, just as people release water vapor with every exhale.", "url": "https://phys.org/news/2020-06-air-overlooked.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2017/plant.jpg", "publishedAt": "2020-06-01T15:22:20Z", "content": "Plants drink up much of the water that falls to Earth. They take what they need before releasing it through tiny holes on the underside of their leaves, just as people release water vapor with every … [+5128 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Hot stars are plagued by giant magnetic spots - Phys.org", "description": "Astronomers using European Southern Observatory (ESO) telescopes have discovered giant spots on the surface of extremely hot stars hidden in stellar clusters. Not only are these stars plagued by magnetic spots, some also experience superflare events, explosio…", "url": "https://phys.org/news/2020-06-hot-stars-plagued-giant-magnetic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/hotstarsarep.jpg", "publishedAt": "2020-06-01T15:22:15Z", "content": "Astronomers using European Southern Observatory (ESO) telescopes have discovered giant spots on the surface of extremely hot stars hidden in stellar clusters. Not only are these stars plagued by magn… [+5063 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Monitoring Environmental Exposures in Dogs Could be Early Warning System for Human Health - Mirage News", "description": "June 1, 2020 Image: NC State University Man's best friend may also be man's best bet for figuring out how...", "url": "https://www.miragenews.com/monitoring-environmental-exposures-in-dogs-could-be-early-warning-system-for-human-health/", "urlToImage": "https://news.ncsu.edu/wp-content/uploads/2020/06/dog1500.jpg", "publishedAt": "2020-06-01T15:17:43Z", "content": "Man’s best friend may also be man’s best bet for figuring out how environmental chemicals could impact our health. Researchers from North Carolina State University and Duke University’s Nicholas Scho… [+2963 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Now Complete, Telescope Instrument is Poised to Begin Its Search for Answers About Dark Energy - Mirage News", "description": "This video contains animations showing how the complex components of the Dark Energy Spectroscopic Instrument, installed on the Mayall Telescope at Kitt...", "url": "https://www.miragenews.com/now-complete-telescope-instrument-is-poised-to-begin-its-search-for-answers-about-dark-energy/", "urlToImage": "https://newscenter.lbl.gov/wp-content/uploads/sites/2/2020/06/DESI-component-installation-sm.jpg", "publishedAt": "2020-06-01T15:06:13Z", "content": "This video contains animations showing how the complex components of the Dark Energy Spectroscopic Instrument, installed on the Mayall Telescope at Kitt Peak National Observatory near Tucson, Arizona… [+3934 chars]"}, {"source": {"id": null, "name": "Business Insider Australia"}, "author": "Aylin Woodward", "title": "Earth's magnetic field first formed thanks to a magma ocean, research shows. That means more planets in the universe could have atmospheres than we thought. - Business Insider Australia", "description": "Earth’s magnetic field shields the planet from deadly and destructive solar radiation. Without it, solar winds could strip Earth of its oceans and atmosphere – killing everything on the planet.", "url": "https://www.businessinsider.com.au/magma-ocean-inside-earth-kickstarted-magnetic-field-first-2020-2", "urlToImage": "https://i.insider.com/5e504e57fee23d7c482e1f16", "publishedAt": "2020-06-01T12:09:00Z", "content": "<ul><li>\r\nOur planet’s magnetic field, which protects our atmosphere from deadly solar winds, has been in place for at least 3.4 billion years.\r\n</li><li>\r\nFor the last 1 billion years, a swirling la… [+5426 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "John Marshall", "title": "Prehistoric climate change damaged the ozone layer and led to a mass extinction - The Conversation UK", "description": "New research on the Late Devonian extinction suggests the ozone layer could be naturally depleted as the temperature rises.", "url": "https://theconversation.com/prehistoric-climate-change-damaged-the-ozone-layer-and-led-to-a-mass-extinction-139519", "urlToImage": "https://images.theconversation.com/files/338387/original/file-20200528-51509-l9s17i.jpg?ixlib=rb-1.1.0&rect=440%2C655%2C4230%2C2110&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2020-06-01T10:22:00Z", "content": "Mass extinctions are very important to how life evolved on Earth. For example, when an asteroid hit the Earth 66 million years ago, the resulting dinosaur extinction led mammals to take their place. … [+5333 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rachel England", "title": "Scientists find the universe's 'missing matter' using mysterious cosmic bursts - Yahoo Finance Australia", "description": "One of astrophysics' longest-running mysteries has been solved.", "url": "https://au.finance.yahoo.com/news/scientists-find-the-universes-missing-matter-using-cosmic-bursts-094512061.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/FrUjPleJnwE7HbGz2Na8kw--~B/aD00OTEyO3c9NzM2MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-01/64de15b0-4057-11ea-bf9f-6f57d28b3169", "publishedAt": "2020-06-01T09:45:00Z", "content": "Thanks to some pretty rigorous scientific calculations, researchers have long been able to determine how much matter there was in the universe when the Big Bang happened. The problem until now is tha… [+1963 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Disorder in fish shoals may reap rewards at dinner time - Mirage News", "description": "Binocular visual fields of three-spined sticklebacks in an ordered group (above) and in a disordered group (below). Groups of three-spined sticklebacks...", "url": "https://www.miragenews.com/disorder-in-fish-shoals-may-reap-rewards-at-dinner-time/", "urlToImage": "https://www.bristol.ac.uk/media-library/sites/news/2020/jun/Fish%20shoal%20article.jpg", "publishedAt": "2020-06-01T09:26:10Z", "content": "The advantages of animals foraging in an orderly group are well-known, but research by the University of Bristol has found an element of unruly adventure can help fish in the quest for food.The study… [+3372 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Ethan Siegel", "title": "Did Hubble Just Find New Stars Where Planets Are Impossible? - Forbes", "description": "Maybe 100% of stars don't have planets, after all.", "url": "https://www.forbes.com/sites/startswithabang/2020/06/01/did-hubble-just-find-new-stars-where-planets-are-impossible/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fblogs-images.forbes.com%2Fstartswithabang%2Ffiles%2F2020%2F05%2Fheic1509a-1200x899.jpg", "publishedAt": "2020-06-01T06:09:32Z", "content": "This NASA/ESA Hubble Space Telescope image of the cluster Westerlund 2 and its surroundings was... [+] released to celebrate Hubbles 25th year in orbit. The images central region, containing the star… [+6927 chars]"}, {"source": {"id": null, "name": "Gq.com.au"}, "author": "GQ Staff", "title": "Elon Musk’s SpaceX Just Achieved What Most Thought Was Impossible - GQ Australia", "description": "The space race forges on with an historic moment a decade in the making.", "url": "https://www.gq.com.au/entertainment/tech/elon-musks-spacex-will-launch-its-first-crewed-mission-tomorrow/news-story/9e13331bf2f822dc974ecd170eb80fea", "urlToImage": "https://content.api.news/v3/images/bin/5c5a030664167f3a112ac8024d5c1abc", "publishedAt": "2020-06-01T03:33:45Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA's 1st human spaceflight from US soil in a decade | Space X | Donald Trump - WION", "description": "NASA's 1st human spaceflight from US soil in a decade | Space X | Donald Trump NASA astronauts entered the International Space Station on Sunday after a land...", "url": "https://www.youtube.com/watch?v=379c0XSvcL0", "urlToImage": "https://i.ytimg.com/vi/379c0XSvcL0/maxresdefault.jpg", "publishedAt": "2020-06-01T02:47:32Z", "content": null}, {"source": {"id": null, "name": "Hit 107"}, "author": "Hit News Team", "title": "A Pink Super Moon Will Cover Australia Tonight! - Hit 107", "description": "We may be confined to our homes right now, but you know what is still here to amaze us: the night’s sky!", "url": "https://www.hit.com.au/story/a-pink-super-moon-will-cover-australia-this-april-152954", "urlToImage": "https://cdn-img.scalabs.com.au/2WCevWsT5QzTGyNQdK5YiSsxyUN7wg6r4xmmgDCNV9g/aHR0cHM6Ly9zdy1o/aXQtcHJkLnNjYWRp/Z2l0YWwuaW8vbWVk/aWEvMzc2MTkvYmxv/b2QtbW9vbi1waXhh/YmF5LmpwZz9wcmVz/ZXQ9bXJwcmV2YXJ0/aWNsZQ", "publishedAt": "2020-04-03T05:48:52Z", "content": "We may be confined to our homes right now, but you know what is still here to amaze us: the nights sky!\r\nLucky for us, this April 8th marks the phenomenon of a Pink Super Moon!\r\nThe moon will classif… [+1170 chars]"}]}