{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Feel the beat: implanted microlasers scan heart from inside - Phys.org", "description": "It sounds like science fiction—but lasers beating to the rhythm of a live heart is exactly what researchers at the University of St Andrews have developed to improve the understanding of heart failure and to help develop more effective treatments.", "url": "https://phys.org/news/2020-06-implanted-microlasers-scan-heart.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/feelthebeati.jpg", "publishedAt": "2020-06-16T14:26:20Z", "content": "It sounds like science fictionbut lasers beating to the rhythm of a live heart is exactly what researchers at the University of St Andrews have developed to improve the understanding of heart failure… [+4330 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Portable smartphone add-on can measure methanol in alcoholic beverages - Phys.org", "description": "A team of researchers and engineers from Particle Technology Laboratory, ETH Zurich and University Hospital Zurich has designed and built a palm-sized device that can measure the amount of methanol in an alcoholic beverage. In their paper published in the jou…", "url": "https://phys.org/news/2020-06-portable-smartphone-add-on-methanol-alcoholic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/portablesmar.jpg", "publishedAt": "2020-06-16T14:26:15Z", "content": "A team of researchers and engineers from Particle Technology Laboratory, ETH Zurich and University Hospital Zurich has designed and built a palm-sized device that can measure the amount of methanol i… [+2651 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Complex landscapes may have helped land-dwelling animals evolve higher intelligence - News-Medical.net", "description": "Ever wonder how land animals like humans evolved to become smarter than their aquatic ancestors? You can thank the ground you walk on.", "url": "https://www.news-medical.net/news/20200616/Complex-landscapes-may-have-helped-land-dwelling-animals-evolve-higher-intelligence.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2016%2f3%2fArtificially_Colored_MRI_Scan_Of_Human_Brain-Daisy_Daisy_a8c5d8bbbf824bc8932308e30187510f-620x480.jpg", "publishedAt": "2020-06-16T14:14:00Z", "content": "Ever wonder how land animals like humans evolved to become smarter than their aquatic ancestors? You can thank the ground you walk on.\r\nNorthwestern University researchers recently discovered that co… [+5986 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Victoria Gill - Science correspondent, BBC News", "title": "A Bee C: Scientists translate honeybee queen duets - Yahoo News Australia", "description": "Queens \"quack\" when ready to hatch - but if two are free at the same time, they fight to the death.", "url": "https://news.yahoo.com/bee-c-scientists-translate-honeybee-050851427.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/_etgXOfa0FgkSxZyBKgKBQ--~B/aD01NDk7dz05NzY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-gb/bbc_us_articles_995/cf4cca193ab1848b3dd0d070451d6fc8", "publishedAt": "2020-06-16T14:13:00Z", "content": "Scientists using highly sensitive vibration detectors have decoded honeybee queens' \"tooting and quacking\" duets in the hive.\r\nWorker bees make new queens by sealing eggs inside special cells with wa… [+2166 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Phil Plait", "title": "When were the *very* first stars born? Earlier than we can see, even with Hubble - SYFY WIRE", "description": "When you look up at the night sky, you can see thousands of stars. The fact that they're there at all implies they had a beginning, and we know stars can exist for billions of years. We see them die, and we see them being born. It's not a huge leap of logic t…", "url": "https://www.syfy.com/syfywire/when-were-the-very-first-stars-born-earlier-than-we-can-see-even-with-hubble", "urlToImage": "https://www.syfy.com/sites/syfy/files/styles/1200x680/public/artwork_firststars.jpg", "publishedAt": "2020-06-16T13:09:13Z", "content": "When you look up at the night sky, you can see thousands of stars. The fact that they're there at all implies they had a beginning, and we know stars can exist for billions of years. We see them die,… [+4884 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/nadia-daly/6564026", "title": "Coronavirus pandemic leaves hundreds of medical practices on verge of collapse - ABC News", "description": "A survey of a thousand GPs and practices shows that nearly half aren't sure whether they will still be operating in six months' time, with patient numbers plummeting amid the coronavirus pandemic.", "url": "https://www.abc.net.au/news/2020-06-16/coronavirus-leaves-medical-practices-on-verge-of-collapse/12359282", "urlToImage": "https://www.abc.net.au/cm/rimage/12245454-16x9-large.jpg?v=2", "publishedAt": "2020-06-16T12:18:00Z", "content": "Hundreds of medical practices are on the verge of collapse because of a fall in the number of visits due to the coronavirus pandemic, according to data collected by the Royal College of General Pract… [+5863 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Arya Udry", "title": "Meteorites from Mars contain clues about the red planet's geology - The Conversation US", "description": "Martian meteorites allow scientists here on Earth to decode that planet's geology, more than a decade before the first missions are scheduled to bring rocks back home from Mars.", "url": "https://theconversation.com/meteorites-from-mars-contain-clues-about-the-red-planets-geology-130104", "urlToImage": "https://images.theconversation.com/files/340422/original/file-20200608-176575-1vaxiqk.jpg?ixlib=rb-1.1.0&rect=6%2C65%2C1014%2C507&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2020-06-16T11:53:00Z", "content": "Despite the pandemic, NASA is on track to launch its Mars rover, Perseverance, this July from Cape Canaveral, Florida. Its central mission will be to search for evidence of previous life on Mars. \r\nA… [+5197 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Nature-Inspired CRISPR Enzyme Discoveries Vastly Expand Genome Editing - SciTechDaily", "description": "Applied computational biology discoveries vastly expand the range of CRISPR’s access to DNA sequences. In nature, bacteria use CRISPR as an adaptive immune system to protect themselves against viruses. Over the past decade, scientists have been able to succes…", "url": "https://scitechdaily.com/nature-inspired-crispr-enzyme-discoveries-vastly-expand-genome-editing/", "urlToImage": "https://scitechdaily.com/images/CRISPR-Cas9.jpg", "publishedAt": "2020-06-16T11:35:01Z", "content": "Gene editing Cas9 protein.\r\nApplied computational biology discoveries vastly expand the range of CRISPR’s access to DNA sequences.\r\nIn nature, bacteria use CRISPR as an adaptive immune system to prot… [+5658 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Australian fossil reveals new plant species - Phys.org", "description": "Antoine Champreux, a Ph.D. student in the Global Ecology Lab at Flinders University, has cataloged the discovery of the new fern-like plant species as part of an international effort to examine the Australian fossil in greater detail.", "url": "https://phys.org/news/2020-06-australian-fossil-reveals-species.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/australianfo.jpg", "publishedAt": "2020-06-16T11:07:20Z", "content": "Antoine Champreux, a Ph.D. student in the Global Ecology Lab at Flinders University, has cataloged the discovery of the new fern-like plant species as part of an international effort to examine the A… [+3180 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Explained Desk", "title": "Explained: What is NASA’s Gateway lunar orbiting outpost? - The Indian Express", "description": "NASA has described the Gateway as key to the new era of lunar explorations both in the orbit and on the surface of the Moon.", "url": "https://indianexpress.com/article/explained/explained-what-is-nasas-gateway-lunar-orbiting-outpost-6460219/", "urlToImage": "https://images.indianexpress.com/2020/06/lunar-gateway-nasa-759.jpg?w=759", "publishedAt": "2020-06-16T10:30:14Z", "content": "NASA’s Orion spacecraft (left) approaches the Gateway in lunar orbit. (Source: NASA)NASA recently finalised the contract for the initial crew module of the agencys Gateway lunar orbiting outpost. The… [+3240 chars]"}, {"source": {"id": null, "name": "CalvinAyre.com"}, "author": null, "title": "New gold mines are waiting to be explored (but not where you think) - CalvinAyre.com", "description": "As space exploration continues to advance and mature, gold mining might eventually take place on asteroids.", "url": "https://calvinayre.com/2020/06/16/ventures/new-gold-mines-are-waiting-to-be-explored-but-not-where-you-think/", "urlToImage": "https://calvinayre.com/wp-content/uploads/2020/06/new-gold-mines-are-waiting-to-be-explored-but-not-where-you-think.jpg", "publishedAt": "2020-06-16T09:38:00Z", "content": "Theres gold in them hills! That may have been a call that enticed a lot of people to venture out to California for the Gold Rush of the mid-1800s, but, once the majority of the gold was found, the ex… [+2757 chars]"}, {"source": {"id": null, "name": "Happy Mag"}, "author": "Rachel Daniel", "title": "New research reveals hummingbirds can see colours humans can't even imagine - Happy", "description": "New research reveals that, thanks to the presence of an extra cone in their eye, hummingbirds can perceive colours humans can't", "url": "https://happymag.tv/new-research-reveals-hummingbirds-can-see-colours-humans-cant-even-imagine/", "urlToImage": "https://happymag.tv/wp-content/uploads/2020/06/rsz_hummingbirds_.jpg", "publishedAt": "2020-06-16T08:48:03Z", "content": "A new experiment has revealed that thanks to the addition of an extra cone in their eye, hummingbirds can observe colours that the human cannot.\r\nAccording to researchers, wildlife with the extra con… [+1099 chars]"}, {"source": {"id": null, "name": "Jakarta Post"}, "author": "The Jakarta Post", "title": "Why it could be dangerous to exercise with a face mask on - The Jakarta Post - Jakarta Post", "description": "Exercise invariably leads to faster and harder breaths, so wearing a mask during exercise places a further strain on airflow.", "url": "https://www.thejakartapost.com/life/2020/06/16/why-it-could-be-dangerous-to-exercise-with-a-face-mask-on.html", "urlToImage": "https://img.jakpost.net/c/2020/06/16/2020_06_16_97872_1592289834._large.jpg", "publishedAt": "2020-06-16T07:48:00Z", "content": "The coronavirus began to affect sporting events as early as January 30, when the Chinese Football Association announced it was delaying the start of the football season. Two months later it was revea… [+4714 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "How deadly is the coronavirus? Scientists are close to an answer - Nature.com", "description": "Public-health researchers use the infection fatality rate to gauge how to respond to a new disease, but it’s tricky to calculate.", "url": "https://www.nature.com/articles/d41586-020-01738-2", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-020-01738-2/d41586-020-01738-2_18063800.jpg", "publishedAt": "2020-06-16T05:39:29Z", "content": "Many countries are struggling to count all their coronavirus deaths.Credit: Michael Dantas/AFP/Getty\r\nOne of the most crucial questions about an emerging infectious disease such as the new coronaviru… [+8664 chars]"}, {"source": {"id": null, "name": "Foodprocessing"}, "author": null, "title": "How long can coronavirus survive on difference surfaces? - Foodprocessing", "description": "A study published in<em> Physics of Fluids</em> has found that temperature, humidity and surfaces can affect coronavirus droplet survival time.", "url": "https://www.foodprocessing.com.au/content/food-design-research/news/how-long-can-coronavirus-survive-on-difference-surfaces--746641818", "urlToImage": "https://d1v1e13ebw3o15.cloudfront.net/data/51658/pool_and_spa_master/..jpg", "publishedAt": "2020-06-16T04:59:27Z", "content": "In a paper in Physics of Fluids, by AIP Publishing, researchers have examined the drying time of respiratory droplets from COVID-19-infected subjects on various surfaces in six cities around the worl… [+1851 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Rare Fireball Over Western Australia a Bit of a Space Mystery - Gizmodo Australia", "description": "A bright, green fireball was spotted over Western Australia's night skies on Monday but its origin remains a bit of a mystery to scientists.", "url": "https://www.gizmodo.com.au/2020/06/rare-fireball-over-western-australia-pilbara-a-space-mystery/", "urlToImage": "https://www.gizmodo.com.au/content/uploads/sites/2/2020/06/16/spacemystery.jpg", "publishedAt": "2020-06-16T04:39:20Z", "content": "A bright, green fireball was spotted over Western Australias night skies on Sunday but its origin remains a bit of a mystery to scientists.\r\nThe phenomenon was captured in a video showing the bright … [+5314 chars]"}, {"source": {"id": null, "name": "Dailyresearchadvisor.com"}, "author": null, "title": "Room Dust Delivered Water to Vesta, Could it Have Done the Same for Earth? - Daily Research Advisor", "description": "One of the best long-lasting concerns regarding Earth relates to the beginnings of its own water. Where performed it originate from? One widely-held concept offers comets the tribute of taking water to Earth. Yet another one mentions that Earth’s water happen…", "url": "https://dailyresearchadvisor.com/2020/06/16/room-dust-delivered-water-to-vesta-could-it-have-done-the-same-for-earth/", "urlToImage": null, "publishedAt": "2020-06-16T04:15:02Z", "content": "One of the best long-lasting concerns regarding Earth relates to the beginnings of its own water. Where performed it originate from? One widely-held concept offers comets the tribute of taking water … [+8778 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Hannah Devlin, Madeleine Finlay", "title": "Covid-19: should we be concerned about air conditioning? - podcast - The Guardian", "description": "Hannah Devlin speaks to Lena Ciric about what role air conditioning could play in spreading or dispersing Covid-19 in buildings and on public transport", "url": "https://www.theguardian.com/science/audio/2020/jun/16/covid-19-should-we-be-concerned-about-air-conditioning-podcast", "urlToImage": "https://i.guim.co.uk/img/media/3ddd5a89c23244c957e7d5985fb1b362744f218b/0_148_6720_4032/master/6720.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8a4ad16d3f2c4d1fcf7f98a42256716e", "publishedAt": "2020-06-16T04:00:00Z", "content": "Following on from several listener questions about the role of air conditioning in spreading or dissipating Covid-19 in buildings and on public transport, Hannah Devlin asks Dr Lena Ciric whether we … [+98 chars]"}, {"source": {"id": null, "name": "Science Codex"}, "author": null, "title": "Wildfires cause bird songs to change - Science Codex", "description": null, "url": "https://www.sciencecodex.com/wildfires-cause-bird-songs-change-649659", "urlToImage": null, "publishedAt": "2020-06-16T04:00:00Z", "content": "A new study in The Auk: Ornithological Advances, published by Oxford University Press, suggests that wildfires change the types of songs sung by birds living in nearby forests.\r\nHermit Warblers sing … [+2569 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ANI", "title": "Loneliness makes it harder to quit smoking: Study - Times of India", "description": "Science News: BRISTOL: Researchers have found evidence for a causal link between the prolonged experience of loneliness and smoking in a recent study.", "url": "https://timesofindia.indiatimes.com/home/science/loneliness-makes-it-harder-to-quit-smoking-study/articleshow/76397766.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-76397770,width-1070,height-580,imgsize-143808,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-06-16T03:46:00Z", "content": null}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "NASA New Horizons spacecraft returns stunning images of previously unseen 'parallax effect' - Firstpost", "description": "The spacecraft has observed how Proxima Centauri and Wolf 359 appear in different positions than when observed from Earth than deep space.", "url": "https://www.firstpost.com/tech/science/nasa-new-horizons-spacecraft-returns-stunning-images-of-previously-unseen-parallax-effect-8487211.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2019/01/NASA-New-Horizonss.jpg", "publishedAt": "2020-06-16T03:36:31Z", "content": "FP TrendingJun 16, 2020 08:56:23 IST\r\nNASA's spacecraft New Horizons that is situated more than 4.3 billion miles away from Earth, has sent back pictures of the sky showing some stars in different po… [+2461 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "No single solution helps all students complete MOOCs - Science Daily", "description": "In one of the largest educational field experiments ever conducted, researchers found that promising interventions to help students complete online courses were not effective on a massive scale -- suggesting that targeted solutions are needed to help students…", "url": "https://www.sciencedaily.com/releases/2020/06/200615152116.htm", "urlToImage": null, "publishedAt": "2020-06-16T01:56:10Z", "content": "In one of the largest educational field experiments ever conducted, a team co-led by a Cornell researcher found that promising interventions to help students complete online courses were not effectiv… [+4952 chars]"}, {"source": {"id": null, "name": "Pressinsiderdaily.com"}, "author": "Izer", "title": "There could be 36 communicating intelligent civilizations in our galaxy, study says - Press Insider Daily", "description": "Maybe we’re not. Scientists have calculated that there could be a minimum of 36 active, communicating intelligent civilizations in our Milky Way galaxy, according to a new study. However, due to time and distance, we may never actually know if they exist or e…", "url": "https://pressinsiderdaily.com/2020/06/there-could-be-36-communicating-intelligent-civilizations-in-our-galaxy-study-says/", "urlToImage": "https://pressinsiderdaily.com/wp-content/uploads/2020/06/1592271378_There-could-be-36-communicating-intelligent-civilizations-in-our-galaxy-1000x600.jpg", "publishedAt": "2020-06-16T01:36:18Z", "content": "Maybe we’re not.Scientists have calculated that there could be a minimum of 36 active, communicating intelligent civilizations in our Milky Way galaxy, according to a new study. However, due to time … [+7054 chars]"}, {"source": {"id": null, "name": "Womensagenda.com.au"}, "author": null, "title": "Almost 90% of astronauts have been men. But the future of space may be female - Women's Agenda", "description": "In many ways, women are ideal astronauts as physical strength and height are not advantages in microgravity, writes Alice Gorman.", "url": "https://womensagenda.com.au/latest/almost-90-of-astronauts-have-been-men-but-the-future-of-space-may-be-female/", "urlToImage": "https://womensagenda.com.au/wp-content/uploads/2020/06/astronaut.jpg", "publishedAt": "2020-06-16T00:17:00Z", "content": "Physical strength and height are not advantages in microgravity, Women ideal astronauts, writes Alice Gorman, from Flinders University in this piece republished from The Conversation. \r\n Only 566 peo… [+7339 chars]"}, {"source": {"id": null, "name": "PCMag.com"}, "author": "Michael Kan", "title": "SpaceX's Satellite Internet Teases Sending Out Invites for Public Beta Tests - PCMag AU", "description": "The company’s website for Starlink has been updated with a new email newsletter that'll notify applicable users about the coming public beta trial.", "url": "https://au.pcmag.com/switches/67317/spacexs-satellite-internet-teases-sending-out-invites-for-public-beta-tests", "urlToImage": "https://sm.pcmag.com/t/pcmag_au/news/s/spacexs-sa/spacexs-satellite-internet-teases-sending-out-invites-for-pu_k4vn.1200.jpg", "publishedAt": "2020-06-16T00:06:00Z", "content": "Want to try out SpaceXs satellite internet service? The company is gearing up to send email updates to interested customers, recruiting them to test it out. \r\nThe companys website for Starlink has be… [+1777 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Surprising growth rates discovered in world's deepest photosynthetic corals - Science Daily", "description": "New research has revealed unexpectedly high growth rates for deep water photosynthetic corals. The study alters the assumption that deep corals living on the brink of darkness grow extremely slowly.", "url": "https://www.sciencedaily.com/releases/2020/06/200615140901.htm", "urlToImage": null, "publishedAt": "2020-06-15T23:09:04Z", "content": "New research published in the journal Coral Reefs revealed unexpectedly high growth rates for deep water photosynthetic corals. The study, led by Samuel Kahng, affiliate graduate faculty in the Unive… [+3511 chars]"}, {"source": {"id": null, "name": "The Space Review"}, "author": null, "title": "Hugging Hubble longer - The Space Review", "description": null, "url": "https://www.thespacereview.com/article/3965/1", "urlToImage": null, "publishedAt": "2020-06-15T23:01:09Z", "content": "The future of space-based astronomy is delayed. Again.\r\n<table><tr><td>“We will not launch in March, absolutely will not launch in March,” Zurbuchen said of JWST. “That is not in the cards right now.… [+10009 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": "Nicole Karlis", "title": "A new, recurring radio wave burst from space could reveal more about its mysterious origins - Salon", "description": "Scientists are intrigued by the origins of a new burst that is occurring every 157 days in the Milky Way", "url": "https://www.salon.com/2020/06/15/radio-wave-burst-space-frb-magnestar-milky-way/", "urlToImage": "https://media.salon.com/2020/01/milky-way-radio-burst-0107201.jpg", "publishedAt": "2020-06-15T22:57:00Z", "content": "A new radio wave burst in space is capturing scientists' attention because of what it may tell us about its source.\r\nKnown as fast radio bursts (FRBs), these signals have been one of the most perplex… [+3942 chars]"}, {"source": {"id": null, "name": "The Cut"}, "author": "Kelly Conaboy", "title": "Secrets Near the Earth’s Core: Revealed? - The Cut", "description": "A team of geophysicists recently found evidence of what lies around the Earth’s core.", "url": "http://www.thecut.com/2020/06/scientists-find-unexpected-structures-around-earths-core.html", "urlToImage": "https://pyxis.nymag.com/v1/imgs/ae2/4f9/193d330dbb736d3055ccecfe70eaae7ff1-earth-core-final.1x.rsocial.w1200.jpg", "publishedAt": "2020-06-15T21:37:00Z", "content": "What do you think exists around the Earths core, just below the solid mantle layer? Ill give you some time to guess. Okay. Did you say: Large structures (which are much more common and expansive than… [+1955 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "A Space Probe Just Took the Closest Pictures of the Sun Ever - Futurism", "description": "\"We are expecting new and exciting results.\"", "url": "https://futurism.com/space-probe-closest-pictures-sun", "urlToImage": "https://wp-assets.futurism.com/2020/06/space-probe-closest-pictures-sun-768x403.jpg", "publishedAt": "2020-06-15T20:20:06Z", "content": "The European Space Agencys Solar Orbiter probe just made its first close approach of the Sun, getting within 77 million kilometers (47.8 million miles) of the stars surface about half the distance be… [+1828 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Yum, Delicious: Inventors Built an Edible Robot - Futurism", "description": "Just eat around the battery.", "url": "https://futurism.com/the-byte/inventors-built-edible-robot", "urlToImage": "https://wp-assets.futurism.com/2020/06/inventors-building-edible-robots-768x403.jpg", "publishedAt": "2020-06-15T20:15:00Z", "content": "Choking Hazard\r\nA team of particularly inspired scientists finally pulled it off: they built an edible robot.\r\nResearchers from Austrias Johannes Kepler University build a robotic elephant trunk capa… [+1497 chars]"}, {"source": {"id": null, "name": "Techno Info Plus"}, "author": null, "title": "Know Everything About The First Solar Eclipse Of The Year 2020 - Techno Info Plus", "description": "Table of Contents What Is Solar Eclipse?What Is An Annular Solar Eclipse?When Will, The Solar Eclipse, Take Place?Precautions To Take For Solar EclipseWhen Will, The Next Solar Eclipse, Take Place? What Is Solar Eclipse? Solar Eclipse Of The Year 2020: Whenev…", "url": "https://technoinfoplus.com/know-everything-about-the-first-solar-eclipse-of-the-year-2020/", "urlToImage": "https://technoinfoplus.com/wp-content/uploads/2020/06/Pinterest1.jpg", "publishedAt": "2020-06-15T19:40:00Z", "content": "What Is Solar Eclipse?\r\nSolar Eclipse Of The Year 2020: Whenever the earth, sun, and moon form a straight line, it leads to either solar or lunar eclipse. The position of these three bodies decides w… [+2104 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researchers unlock clues to a dramatic chapter of Earth's geological history - Phys.org", "description": "Imagine Earth completely covered in ice. While it's hard to picture all of today's oceans and land masses obscured with glaciers, such an ice-covered version of the planet was not so far-fetched millions of years ago.", "url": "https://phys.org/news/2020-06-clues-chapter-earth-geological-history.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/42-researchersu.jpg", "publishedAt": "2020-06-15T19:33:14Z", "content": "Imagine Earth completely covered in ice. While it's hard to picture all of today's oceans and land masses obscured with glaciers, such an ice-covered version of the planet was not so far-fetched mill… [+5837 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA to Hold Mars 2020 Perseverance Rover Launch Briefing - NASA", "description": "NASA leadership and a panel of scientists and engineers will preview NASA's next mission to the Red Planet, the Mars 2020 Perseverance rover, at a media briefing at 2 p.m. EDT Wednesday, June 17.", "url": "https://www.nasa.gov/press-release/nasa-to-hold-mars-2020-perseverance-rover-launch-briefing/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/2020_rover_name_plate-1080_0.png", "publishedAt": "2020-06-15T19:06:59Z", "content": null}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Wild hummingbirds see a broad range of colors humans can only imagine - Mirage News", "description": "To find food, dazzle mates, escape predators and navigate diverse terrain, birds rely on their excellent color vision. \"Humans are color-blind compared...", "url": "https://www.miragenews.com/wild-hummingbirds-see-a-broad-range-of-colors-humans-can-only-imagine/", "urlToImage": "https://www.princeton.edu/sites/default/files/styles/half_2x/public/images/2020/06/Wild-Hummingbirds-Discriminate-Nonspectral-Colors_Infographic_Stoddard-Lab.jpg?itok=ywDwXAbW", "publishedAt": "2020-06-15T19:02:50Z", "content": "To find food, dazzle mates, escape predators and navigate diverse terrain, birds rely on their excellent color vision.\r\n“Humans are color-blind compared to birds and many other animals,” said Mary Ca… [+7076 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Kiona N. Smith", "title": "Paleolithic French didn’t let their dead rest peacefully - Ars Technica", "description": "The unusual burials hint at complex social structure and spiritual beliefs.", "url": "https://arstechnica.com/science/2020/06/paleolithic-french-didnt-let-their-dead-rest-peacefully/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2020/06/bones1-760x380.jpg", "publishedAt": "2020-06-15T19:00:00Z", "content": "20 with 15 posters participating\r\nIf you died in Europe 35,000 to 25,000 years ago, youd probably be buried with parts of your body painted with red ochre and bedecked with beads, carved figurines, a… [+6758 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Jonathan Amos - BBC Science Correspondent", "title": "Mars: Green glow detected on the Red Planet - Yahoo News Australia", "description": "A joint European-Russian satellite observes a light in Mars’ atmosphere that's generated by oxygen.", "url": "https://news.yahoo.com/mars-green-glow-detected-red-171222164.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/2ZmMwSynDZohggujOUW8QA--~B/aD0yNjE7dz00NjQ7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-gb/bbc_us_articles_995/555feffd1d9b7b3a1f8b42c8993ab84b", "publishedAt": "2020-06-15T18:50:00Z", "content": "Scientists have identified a green light in the atmosphere of Mars.\r\nA similar glow is sometimes seen by astronauts on the space station when they look to the Earth's limb.\r\nThe glow comes from oxyge… [+3071 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Team develops benchmark for detecting large genetic mutations linked to major diseases - Phys.org", "description": "Many serious diseases, including autism, schizophrenia and numerous cardiac disorders, are believed to result from mutation of an individual's DNA. But some large mutations, which still make up only a small fraction of the total human genome, have been surpri…", "url": "https://phys.org/news/2020-06-team-benchmark-large-genetic-mutations.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/nistdevelops.jpg", "publishedAt": "2020-06-15T18:34:35Z", "content": "Many serious diseases, including autism, schizophrenia and numerous cardiac disorders, are believed to result from mutation of an individual's DNA. But some large mutations, which still make up only … [+7107 chars]"}, {"source": {"id": null, "name": "Cisomag.com"}, "author": null, "title": "Threat Actors Can Eavesdrop Using a Light Bulb’s Vibrations: Research - CISO MAG", "description": "Researchers discovered a novel side-channel attacking technique that allows eavesdroppers to spy on conversations happening in a room", "url": "https://www.cisomag.com/lamphone-attack/", "urlToImage": "https://www.cisomag.com/wp-content/uploads/2020/06/shutterstock_1346114726.jpg", "publishedAt": "2020-06-15T18:12:00Z", "content": "A group of cybersecurity researchers discovered a novel side-channel attacking technique that allows eavesdroppers to spy on conversations happening in a room from a nearby location by watching a lig… [+3275 chars]"}, {"source": {"id": null, "name": "Scitation.org"}, "author": "Middleton Christine author aut", "title": "Bose–Einstein condensation in space - Physics Today", "description": "<p>Ultracold rubidium atoms in microgravity exhibit both predicted and unexpected behaviors.</p>", "url": "https://physicstoday.scitation.org/do/10.1063/PT.6.1.20200615a/full/", "urlToImage": "https://physicstoday.scitation.org/action/showOpenGraphArticleImage?doi=10.1063/PT.6.1.20200615a&id=media/highlight-6.jpg", "publishedAt": "2020-06-15T17:56:12Z", "content": null}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "The Higgs Boson –“Gateway” to the Dark Universe? - The Daily Galaxy --Great Discoveries Channel", "description": "The cosmos contains a Higgs field—similar to an electric field—generated by Higgs bosons in the vacuum. Particles interact with the field to gain energy and, through Albert Einstein’s famous equation, E=mc2, mass.The Standard Model of particle physics, althou…", "url": "https://dailygalaxy.com/2020/06/the-higgs-boson-could-it-to-be-a-gateway-to-the-dark-universe/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2020/06/the-amazing-higgs-portal-to-the-dark-world-to-ridding-the-universe-of-antimatter-2-e1592241021372.jpg", "publishedAt": "2020-06-15T17:23:26Z", "content": "The cosmos contains a Higgs fieldsimilar to an electric fieldgenerated by Higgs bosons in the vacuum. Particles interact with the field to gain energy and, through Albert Einsteins famous equation, E… [+5812 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Radiation pressure with recoil: Experimental proof for a 90 year-old theory - Phys.org", "description": "Light exerts a certain amount of pressure onto a body: sun sails could thus power space probes in the future. However, when light particles (photons) hit an individual molecule and knock out an electron, the molecule flies toward the light source. Atomic phys…", "url": "https://phys.org/news/2020-06-pressure-recoil-experimental-proof-year-old.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/photon.jpg", "publishedAt": "2020-06-15T17:04:53Z", "content": "Light exerts a certain amount of pressure onto a body: sun sails could thus power space probes in the future. However, when light particles (photons) hit an individual molecule and knock out an elect… [+3603 chars]"}, {"source": {"id": null, "name": "ENGINEERING.com"}, "author": "Matthew Greenwood", "title": "The SpaceX Crew Dragon: This Ain’t Your Parents’ Space Shuttle - ENGINEERING.com", "description": "History-making private spacecraft opens up U.S.-based astronaut travel again.", "url": "https://www.engineering.com/AdvancedManufacturing/ArticleID/20355/The-SpaceX-Crew-Dragon-This-Aint-Your-Parents-Space-Shuttle.aspx", "urlToImage": "http://www.engineering.com/portals/0/BlogFiles/1_spaceX.jpg", "publishedAt": "2020-06-15T16:42:46Z", "content": "We’ve entered a new era of spaceflight—and the SpaceX Crew Dragon has blown the door open as the first privately built spacecraft to carry astronauts into orbit. The May 30 launch of the spacecraft, … [+4766 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "50-Year-Old Cosmic Mystery Solved: Why Pulsars Shine Bright - SciTechDaily", "description": "Intense radio emissions produced by the fast-spinning stars are caused by newborn particles interacting with powerful electromagnetic fields, new plasma simulations suggest. When Jocelyn Bell first observed the emissions of a pulsar in 1967, the rhythmic puls…", "url": "https://scitechdaily.com/50-year-old-cosmic-mystery-solved-why-pulsars-shine-bright/", "urlToImage": "https://scitechdaily.com/images/Simulated-Density-Distribution-of-Electron-Positron-Plasma.jpg", "publishedAt": "2020-06-15T16:14:00Z", "content": "Pulsars are fast-spinning neutron stars that emit narrow, sweeping beams of radio waves. A new study identifies the origin of those radio waves. Credit: NASA’s Goddard Space Flight Center\r\nIntense ra… [+5234 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": null, "title": "The many lifetimes of plastics - Newswise", "description": "Many of us have seen informational posters at parks or aquariums specifying how long plastics bags, bottles, and other products last in the environment. They’", "url": "https://www.newswise.com/articles/the-many-lifetimes-of-plastics", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2020/06/15/CollinWardworkinginlab.jpg&width=100&height=100", "publishedAt": "2020-06-15T16:05:00Z", "content": "Newswise — Many of us have seen informational posters at parks or aquariums specifying how long plastics bags, bottles, and other products last in the environment. They’re a good reminder to not litt… [+6524 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Study: Neurons can shift how they process information about motion - Mirage News", "description": "New Rochester research indicates some neurons may be more adept than previously thought in helping you perceive the motion of objects while you move...", "url": "https://www.miragenews.com/study-neurons-can-shift-how-they-process-information-about-motion/", "urlToImage": "https://cdn1.miragenews.com/wp-content/uploads/2019/04/newsdevelopments-image.jpg", "publishedAt": "2020-06-15T16:02:15Z", "content": "New Rochester research indicates some neurons may be more adept than previously thought in helping you perceive the motion of objects while you move through the world.\r\nThe findings may have implicat… [+6460 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Tom Fish", "title": "NASA news: New Horizons photographs 'alien' sky in experiment 4.3 BILLION miles from Earth - Express.co.uk", "description": "NASA's New Horizons probe has performed a groundbreaking new 'parallax' experiment, proving stars are positioned differently in space than when viewed from Earth.", "url": "https://www.express.co.uk/news/science/1296198/nasa-news-new-horizons-parallax-photograph-experiment-space-news", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1296198.jpg", "publishedAt": "2020-06-15T15:59:00Z", "content": null}, {"source": {"id": null, "name": "Big Think"}, "author": "Kevin Dickinson", "title": "This ancient crocodile walked on two legs “like humans” - Big Think", "description": "Batrachopus grandis, an ancient crocodylomorph, may have chased down land prey on its own two feet.", "url": "https://bigthink.com/surprising-science/ancient-crocodile-two-legs", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMzM5MjIyMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTU5NTA2MzgzMn0.XITqV2ZJurninMtzAyBciP9CHQiYoesy6U4-lpt3Hx4/img.jpg?width=1200&coordinates=0%2C43%2C0%2C43&height=600", "publishedAt": "2020-06-15T15:36:58Z", "content": "As any schoolchild will tell you, crocodiles have remained unchanged for millions of years. These powerful ambush predators have evolved to fit perfectly within their niche. They are so successful th… [+5309 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Melting a crystal topologically - Mirage News", "description": "Spin configuration of a skyrmion. Credit: Ping Huang (XJTU) Physicists at EPFL have successfully melted a very thin crystal of magnetic quasi-particles...", "url": "https://www.miragenews.com/melting-a-crystal-topologically/", "urlToImage": "https://news.epfl.ch/image/92719/1108x622.jpg", "publishedAt": "2020-06-15T15:22:14Z", "content": "Physicists at EPFL have successfully melted a very thin crystal of magnetic quasi-particles controllably, as turning ice into water. Novel phases of matter have been discovered and a new model system… [+2821 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Researchers develop artificial synapse that works with living cells - Mirage News", "description": "Researchers have created a device that can integrate and interact with neuron-like cells. This could be an early step toward an artificial synapse for...", "url": "https://www.miragenews.com/researchers-develop-artificial-synapse-that-works-with-living-cells/", "urlToImage": "https://news-media.stanford.edu/wp-content/uploads/2017/02/17143202/Synapse_3833-555x370.jpg", "publishedAt": "2020-06-15T15:04:37Z", "content": "Researchers have created a device that can integrate and interact with neuron-like cells. This could be an early step toward an artificial synapse for use in brain-computer interfaces.\r\n By Taylor Ku… [+5759 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Astronomers Confirm Two Planets in Proxima Centauri System | Astronomy - Sci-News.com", "description": "Astronomers have finally confirmed the existence of two exoplanets -- Proxima b and c -- orbiting Proxima Centauri, the Sun’s closest stellar neighbor and one of the best-studied low-mass stars.", "url": "http://www.sci-news.com/astronomy/two-planets-proxima-centauri-system-08534.html", "urlToImage": "http://cdn.sci-news.com/images/2020/01/image_8020f-Proxima-c.jpg", "publishedAt": "2020-06-15T14:51:53Z", "content": "Astronomers have finally confirmed the existence of two exoplanets — Proxima b and c — orbiting Proxima Centauri, the Suns closest stellar neighbor and one of the best-studied low-mass stars.\r\nThis a… [+5086 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Carbon emission from permafrost soils underestimated by 14% - Mirage News", "description": "ANN ARBOR-Picture 500 million cars stacked in rows. That's how much carbon-about 1,000 petagrams, or one billion metric tons-is locked away in Arctic...", "url": "https://www.miragenews.com/carbon-emission-from-permafrost-soils-underestimated-by-14/", "urlToImage": "https://cdn1.miragenews.com/wp-content/uploads/2017/11/news-developments-e1509835949106.jpg", "publishedAt": "2020-06-15T14:50:41Z", "content": "ANN ARBOR-Picture 500 million cars stacked in rows. That’s how much carbon-about 1,000 petagrams, or one billion metric tons-is locked away in Arctic permafrost.\r\nCurrently, scientists estimate that … [+4761 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "NASA TV Coverage Set for Final Space Station Spacewalk Power Upgrades - Mirage News", "description": "NASA astronaut Jessica Meir is pictured during a spacewalk she conducted with NASA astronaut Christina Koch Jessica Meir (out of frame) to install new...", "url": "https://www.miragenews.com/nasa-tv-coverage-set-for-final-space-station-spacewalk-power-upgrades/", "urlToImage": "https://www.nasa.gov/sites/default/files/styles/full_width/public/thumbnails/image/49396024496_91f65e9a6d_k.jpg?itok=2YFv_4jG", "publishedAt": "2020-06-15T14:48:14Z", "content": "NASA astronauts Chris Cassidy and Robert Behnken are scheduled to go outside the International Space Station (ISS) Friday, June 26, and Wednesday, July 1, for spacewalks to begin the replacement of b… [+461 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "A possible explanation for why West Antarctica is warming faster than East Antarctica - Phys.org", "description": "A team of researchers affiliated with several institutions in South Korea has found a possible reason for West Antarctica warming faster than East Antarctica. In their paper published in the journal Science Advances, the group describes their study of surface…", "url": "https://phys.org/news/2020-06-explanation-west-antarctica-faster-east.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/5ee752c91aa58.jpg", "publishedAt": "2020-06-15T13:34:50Z", "content": "A team of researchers affiliated with several institutions in South Korea has found a possible reason for West Antarctica warming faster than East Antarctica. In their paper published in the journal … [+2994 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Rafi Letzter", "title": "Einstein's core idea about gravity just passed an extreme, whirling test in deep space - Livescience.com", "description": "", "url": "https://www.livescience.com/einstein-theory-passes-extreme-test-deep-space.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/S7bgbcb7DVdseWdYj5DCpV-1200-80.jpg", "publishedAt": "2020-06-15T13:31:00Z", "content": "Once again, physicists have confirmed one of Albert Einstein's core ideas about gravity\r\n this time with the help of a neutron star flashing across space.\r\nThe new work makes an old idea even more ce… [+6096 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Physicists' innovative model provides insight into behavior of black hole at center of our galaxy - Mirage News", "description": "Physicists' innovative model provides insight into the behavior of the black hole at the center of our galaxy By Harrison Tasoff Santa Barbara, CA ...", "url": "https://www.miragenews.com/physicists-innovative-model-provides-insight-into-behavior-of-black-hole-at-center-of-our-galaxy/", "urlToImage": "https://www.news.ucsb.edu/sites/default/files/video_embed_field_thumbnails/vimeo/428265377.jpg", "publishedAt": "2020-06-15T13:10:22Z", "content": "Like most galaxies, the Milky Way hosts a supermassive black hole at its center. Called Sagittarius A*, the object has captured astronomers’ curiosity for decades. And now there is an effort to image… [+5619 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Starburst Galaxy: A Bright Find Predicted by Einstein’s General Theory of Relativity - SciTechDaily", "description": "Seen here in incredible detail, thanks to the NASA/ESA Hubble Space Telescope, is the starburst galaxy formally known as PLCK G045.1+61.1. The galaxy appears as multiple reddish dots near the center of the image and is being gravitationally lensed by a cluste…", "url": "https://scitechdaily.com/starburst-galaxy-a-bright-find-predicted-by-einsteins-general-theory-of-relativity/", "urlToImage": "https://scitechdaily.com/images/Starburst-Galaxy-Hubble-Space-Telescope.jpg", "publishedAt": "2020-06-15T12:16:59Z", "content": "Seen here in incredible detail, thanks to the NASA/ESA Hubble Space Telescope, is the starburst galaxy formally known as PLCK G045.1+61.1. Credit: ESA/Hubble &amp; NASA, B. Frye\r\nSeen here in incredi… [+1078 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Callum Hoare", "title": "Why Neil Armstrong and Buzz Aldrin visited NUCLEAR test site before Apollo 11 - Express.co.uk", "description": "MOON landing legends Neil Armstrong and Buzz Aldrin both visited a nuclear test site before they blasted off to the lunar surface for NASA's Apollo 11 mission, and their visit was key to their success.", "url": "https://www.express.co.uk/news/science/1295987/moon-landing-neil-armstrong-buzz-aldrin-nuclear-test-site-apollo-11-nasa-launch-rocks-spt", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1295987.jpg", "publishedAt": "2020-06-15T09:40:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Wireless Underwater Internet That Uses Light Beams and Lasers Used for the First Time - Newsweek", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMid2h0dHBzOi8vd3d3Lm5ld3N3ZWVrLmNvbS9hcXVhLWZpLXdpcmVsZXNzLXVuZGVyd2F0ZXItaW50ZXJuZXQtbGlnaHQtYmVhbXMtbGFzZXJzLXVzZWQtZmlyc3QtdGltZS1rYXVzdC1yZXNlYXJjaC0xNTEwODI20gF9aHR0cHM6Ly93d3cubmV3c3dlZWsuY29tL2FxdWEtZmktd2lyZWxlc3MtdW5kZXJ3YXRlci1pbnRlcm5ldC1saWdodC1iZWFtcy1sYXNlcnMtdXNlZC1maXJzdC10aW1lLWthdXN0LXJlc2VhcmNoLTE1MTA4MjY_YW1wPTE?oc=5", "urlToImage": null, "publishedAt": "2020-06-15T09:26:27Z", "content": null}, {"source": {"id": null, "name": "New York Times"}, "author": "Dennis Overbye", "title": "Oumuamua: Neither Comet nor Asteroid, but a Cosmic Iceberg - The New York Times", "description": "A new study suggests the interloper may have arisen in an interstellar cloud, where stars are sometimes born.", "url": "https://www.nytimes.com/2020/06/15/science/oumuamua-astronomy-comets.html", "urlToImage": "https://static01.nyt.com/images/2020/06/16/science/16SCI-OUTTHERE-ICEBERG/16SCI-OUTTHERE-ICEBERG-facebookJumbo.jpg", "publishedAt": "2020-06-15T09:03:16Z", "content": "Astronomers eventually concluded that the object was about 1,000 feet long and cigar-shaped, evoking the image of a rocket cylinder. But further analysis revealed that it was speeding up as it exited… [+1681 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "For The First Time, The Lifetime of a Neutron Has Been Measured in Space - ScienceAlert", "description": "For the first time, scientists have measured the lifespan of a neutron in the void of space. The margin of error means we can't narrow it down yet, but once the technique is refined, it could prove to be a game changer.", "url": "https://www.sciencealert.com/for-the-first-time-the-lifetime-of-a-neutron-has-been-measured-in-space", "urlToImage": "https://www.sciencealert.com/images/2020-06/processed/atom-zoom_1024.jpg", "publishedAt": "2020-06-15T07:49:04Z", "content": "For the first time, scientists have measured the lifespan of a neutron in the void of space. The margin of error means we can't narrow it down yet, but once the technique is refined, it could prove t… [+4666 chars]"}, {"source": {"id": null, "name": "Jbklutse.com"}, "author": "Expert Writer", "title": "Orthopaedic surgery in Singapore for repair of rotator Cuff Tears - JBKlutse", "description": "When A Rotator Cuff Tear Requires Surgery A tear in the shoulder's rotator cuff can be disabling and painful, but", "url": "https://www.jbklutse.com/orthopaedic-surgery-in-singapore/", "urlToImage": "https://www.jbklutse.com/wp-content/uploads/2020/06/Canva-Emergency-Surgery-Operation.jpg", "publishedAt": "2020-06-15T04:18:45Z", "content": "When A Rotator Cuff Tear Requires Surgery\r\nA tear in the shoulder’s rotator cuff can be disabling and painful, but it can be fixed through an orthopaedic surgery in Singapore. There are different tre… [+3677 chars]"}, {"source": {"id": null, "name": "Science Codex"}, "author": null, "title": "Excitons form superfluid in certain 2D combos - Science Codex", "description": null, "url": "https://www.sciencecodex.com/excitons-form-superfluid-certain-2d-combos-649578", "urlToImage": "https://media.eurekalert.org/multimedia_prod/pub/web/234707_web.jpg", "publishedAt": "2020-06-15T04:00:00Z", "content": "HOUSTON - (June 15, 2020) - Mixing and matching computational models of 2D materials led scientists at Rice University to the realization that excitons -- quasiparticles that exist when electrons and… [+3988 chars]"}, {"source": {"id": null, "name": "Australian Mining"}, "author": "Salomae Haselgrove", "title": "How using bacteria could be the future of iron extraction - Australian Mining", "description": "The future of iron ore mining could be in microscopic bacteria, according to a study by the University of California’s Bakar Fellows Program.", "url": "https://www.australianmining.com.au/news/how-using-bacteria-could-be-the-future-of-iron-extraction/", "urlToImage": "https://dszs098s1om2l.cloudfront.net/australianmining.com.au/2020/06/15112503/University-of-California.jpg", "publishedAt": "2020-06-15T02:12:00Z", "content": "Professor of plant and microbial biology Arash Komeili and Bakar Fellows Program student Carly Grant.\r\nThe future of iron ore mining could be in microscopic bacteria, according to a study by the Univ… [+2185 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Jon Fingas", "title": "Scientists locate the first fast radio burst in the Milky Way - Yahoo Finance Australia", "description": "Astronomers have found the first known fast radio burst in the Milky Way, potentially solving one of the universe's greater mysteries.", "url": "https://au.finance.yahoo.com/news/first-fast-radio-burst-in-milky-way-002145743.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/2c07Qk9nDB2fRBeYai.XtQ--~B/aD0zNjYyO3c9NTI4ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-06/e79624b0-af07-11ea-a5ce-5ea518153ab6", "publishedAt": "2020-06-15T00:25:27Z", "content": "Fast radio bursts in the cosmos might not be quite so mysterious before long. Astronomers have detected the first known burst coming from within the Milky Way galaxy. It originated with the SGR 1935+… [+1334 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Caroline Spry et al., The Conversation", "title": "Unprecedented Discovery Shows The Resilience of Aboriginal Culture in Australia - ScienceAlert", "description": "Trees marked by Aboriginal cultural practices are a distinctive part of the Australian landscape.", "url": "https://www.sciencealert.com/a-stone-found-wedged-in-a-gum-tree-reveal-australia-s-aboriginal-history", "urlToImage": "https://www.sciencealert.com/images/2020-06/processed/file-20200608-176585-1uqmg8l_1_1024.jpg", "publishedAt": "2020-06-15T00:12:31Z", "content": "Trees marked by Aboriginal cultural practices are a distinctive part of the Australian landscape.\r\nA recent discovery on Wiradjuri country in New South Wales shows some of these \"culturally modified … [+5557 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Jon Fingas", "title": "Germany's COVID-19 contact tracing app arrives this week - Yahoo Finance Australia", "description": "Germany says its COVID-19 contact tracing app is ready to launch this week.", "url": "https://au.finance.yahoo.com/news/germany-covid-19-contact-tracing-app-ready-213819369.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/D4OM9BdesbyUVrzMTEQGZQ--~B/aD0yNjM4O3c9Mzg3MztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-06/b429c4d0-ae7e-11ea-9bf5-212d8b8bd295", "publishedAt": "2020-06-14T21:38:00Z", "content": "Germany will be the next big country to launch a COVID-19 contact tracing app. Health Minister Jens Spahn has confirmed that the app is coming this week, with reports suggesting that it might be read… [+1219 chars]"}, {"source": {"id": null, "name": "Techtoday19.com"}, "author": null, "title": "The NASA spacecraft returns images of stars 4.3 billion kilometers away - techtoday19", "description": "New Horizons explores Pluto, ArrokothHave 3D glasses? You can see these stereo pictures revealing the distance of the stars from their background. On the", "url": "http://techtoday19.com/2020/06/the-nasa-spacecraft-returns-images-of-stars-4-3-billion-kilometers-away/", "urlToImage": "http://techtoday19.com/wp-content/uploads/2020/06/The-NASA-spacecraft-returns-images-of-stars-43-billion-kilometers.jpg", "publishedAt": "2020-06-14T18:09:05Z", "content": "New Horizons explores Pluto, Arrokoth\r\nHave 3D glasses? You can see these stereo pictures revealing the distance of the stars from their background. On the left is Proxima Centauri and on the right i… [+12697 chars]"}, {"source": {"id": null, "name": "NewsDio"}, "author": null, "title": "Astronauts: the Falcon 9 rocket was a 'totally different' journey that the space shuttle - NewsDio", "description": "The SpaceX Falcon 9 rocket was a \"pure flying machine\" compared to the space shuttle, according to astronauts who carried it into space. Doug Hurley and Bob Behnken piloted the Falcon 9's first manned flight on May 30. Each astronaut had previously been on tw…", "url": "https://newsdio.com/astronauts-the-falcon-9-rocket-was-a-totally-different-journey-that-the-space-shuttle/124371/", "urlToImage": "https://newsdio.com/wp-content/uploads/2020/06/spaxe-x-crew.jpg", "publishedAt": "2020-06-14T15:32:00Z", "content": "The SpaceX Falcon 9 rocket was a \"pure flying machine\" compared to the space shuttle, according to astronauts who carried it into space.\r\nDoug Hurley and Bob Behnken piloted the Falcon 9's first mann… [+2464 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Revolutionary Archaeology: Entire Roman City Revealed Without Any Digging - SciTechDaily", "description": "The city rises: Archaeologists have revealed an entire Roman city without any digging. Their approach could revolutionize the study of ancient settlements. For the first time, a team of archaeologists from the Universities of Cambridge and Ghent, has succeede…", "url": "https://scitechdaily.com/revolutionary-archaeology-entire-roman-city-revealed-without-any-digging/", "urlToImage": "https://scitechdaily.com/images/Falerii-Novi-Ground-Penetrating-Radar-Annotated.jpg", "publishedAt": "2020-06-14T13:37:41Z", "content": "A slice of ground-penetrating radar data from Falerii Novi, revealing the outlines of the town’s buildings. Credit: L. Verdonck\r\nThe city rises: Archaeologists have revealed an entire Roman city with… [+5411 chars]"}]}