{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Illawarra Mercury"}, "author": "Will Dunham", "title": "Small insect eater was dinosaur forerunner - Illawarra Mercury", "description": "Giant dinosaurs and the flying reptiles called pterosaurs had humble beginnings, as shown by a diminutive insect-eating reptile from Madagascar that was a for...", "url": "https://www.illawarramercury.com.au/story/6822018/small-insect-eater-was-dinosaur-forerunner/", "urlToImage": "https://nnimgt-a.akamaihd.net/transform/v1/crop/frm/silverstone-feed-data/1a7af42a-6644-4de5-8486-ce80e2a35156.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2020-07-06T22:46:04Z", "content": ""}, {"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/evan.gough.3", "title": "China's Mars Rover Launches in Late July - Universe Today", "description": "China says they're launching their Mars Rover this July, or maybe August. If they can successfully land their rover, they'll join an exclusive club.", "url": "https://www.universetoday.com/146844/chinas-mars-rover-launches-in-late-july/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2018/01/launch-LongMarch5-wenchang-july2-2017-full-cns-crop.png", "publishedAt": "2020-07-06T22:26:00Z", "content": "In July there’s another launch window to Mars. It looks like China is ready to take advantage of it, by launching their first rover to the planet. It’s called Tianwen-1, meaning “Heavenly Questions”,… [+3400 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ben P. Stein", "title": "Atomic 'Swiss Army knife' precisely measures materials for quantum computers - Phys.org", "description": "It images single atoms. It maps atomic-scale hills and valleys on metal and insulating surfaces. And it records the flow of current across atom-thin materials subject to giant magnetic fields. Scientists at the National Institute of Standards and Technology (…", "url": "https://phys.org/news/2020-07-atomic-swiss-army-knife-precisely.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/atomicswissa.jpg", "publishedAt": "2020-07-06T21:18:39Z", "content": "It images single atoms. It maps atomic-scale hills and valleys on metal and insulating surfaces. And it records the flow of current across atom-thin materials subject to giant magnetic fields. Scient… [+7272 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Optical amplifiers: Highest peak power and excellent stability: Record parameters for amplified ultrashort pulses - Science Daily", "description": "Optical amplifiers based on chirped pulse amplification (CPA) are used to generate high intensity pulses. In the CPA scheme, a weak temporally stretched seed pulse is amplified to high energy in a laser amplifier and finally re-compressed resulting in an ultr…", "url": "https://www.sciencedaily.com/releases/2020/07/200706113926.htm", "urlToImage": null, "publishedAt": "2020-07-06T20:54:21Z", "content": "Power-scalable ultrafast laser sources in the midwave-infrared (MWIR) are a key element for basic research and applications in material processing and medicine. Optical amplifiers based on chirped pu… [+2610 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": null, "title": "SpaceX news, launch calendars, and video - Inverse", "description": "SpaceX, the aerospace firm founded by Elon Musk in 2002, is hurtling forward with innovative technologies that bring down the cost of space flight as a way to finance his ultimate goal of getting humans on Mars.", "url": "https://www.inverse.com/spacex", "urlToImage": "https://imgix.bustle.com/uploads/image/2020/7/6/6d127501-4bd9-4586-bbb6-17c81f40f68e-slack-imgs.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "publishedAt": "2020-07-06T20:54:00Z", "content": "SpaceX, the aerospace firm founded by Elon Musk in 2002, is hurtling forward with innovative technologies that bring down the cost of space flight as a way to finance Musk's ultimate goal of getting … [+3929 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Mike Wehner", "title": "Watch a huge fireball detonate over Tokyo – BGR - BGR", "description": "A space rock entered Earth’s atmosphere over Tokyo, producing a brilliant flash and a loud sonic boom. The incident was captured on video, showing the fireball lighting up and then fizzling out. No damage was reported but the sonic boom was heard for great di…", "url": "https://bgr.com/2020/07/06/tokyo-fireball-bolide-meteor/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2019/02/earth.jpg?quality=70&strip=all", "publishedAt": "2020-07-06T20:50:20Z", "content": "<ul><li>A space rock entered Earth’s atmosphere over Tokyo, producing a brilliant flash and a loud sonic boom. </li><li>The incident was captured on video, showing the fireball lighting up and then f… [+2681 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/evan.gough.3", "title": "Astronomers See Through the Milky Way's Dust to Track Where Radiation is Coming From at the Center of the Galaxy - Universe Today", "description": "There' something mysterious going on in the center region of the Milky Way, but it's hard to see into all the dust. Now there some new data, thanks to WHAM.", "url": "https://www.universetoday.com/146845/astronomers-see-through-the-milky-ways-dust-to-track-where-radiation-is-coming-from-at-the-center-of-the-galaxy/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2016/05/1280px-Milky_Way_IR_Spitzer-1.jpg", "publishedAt": "2020-07-06T20:48:00Z", "content": "The center of our very own galaxy might be one of the Universe’s most mysterious places. Astronomers have to probe through thick dust to see what’s going on there. All that dust makes life difficult … [+8340 chars]"}, {"source": {"id": null, "name": "Theguardian.comnews"}, "author": "Jeremy Plester", "title": "Rare night clouds may be warning sign of climate crisis - The Guardian", "description": "Noctilucent clouds, on the edge of the atmosphere, are increasingly seen outside of polar regions", "url": "https://amp.theguardian.comnews/2020/jul/06/rare-night-clouds-may-be-warning-sign-of-climate-crisis", "urlToImage": "https://i.guim.co.uk/img/media/d644684af5ec5aeb3c43c3142203f6edfa20746b/0_177_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3699a5be4c9cf8090b40ae288067b1af", "publishedAt": "2020-07-06T20:30:00Z", "content": "Something magical appeared at night over London and other parts of Britain on 21 June: ripples of electric blue clouds shimmered in the twilight sky after sunset. These were noctilucent clouds, the h… [+1009 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Study shows great specificity of action by enzymes to correct double-strand DNA breaks - Phys.org", "description": "Our cells are constantly dividing, and as they do, the DNA molecule—our genetic code—sometimes gets broken. DNA has twin strands, and a break in both is considered especially dangerous. This kind of double-strand break can lead to genome rearrangements that a…", "url": "https://phys.org/news/2020-07-great-specificity-action-enzymes-double-strand.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/10-dna.jpg", "publishedAt": "2020-07-06T20:17:44Z", "content": "Our cells are constantly dividing, and as they do, the DNA moleculeour genetic codesometimes gets broken. DNA has twin strands, and a break in both is considered especially dangerous. This kind of do… [+3977 chars]"}, {"source": {"id": null, "name": "FREE NEWS"}, "author": "John Kessler", "title": "See how unicellulars illuminate the oceans: scientists understand how this happens - FREE NEWS", "description": "Scientists have discovered how a single-celled organism of the species Pyrocystis lunula produces a flash of light", "url": "https://freenews.live/see-how-unicellulars-illuminate-the-oceans-scientists-understand-how-this-happens/", "urlToImage": "https://freenews.live/wp-content/uploads/2020/07/unicellulars-illuminate.jpg", "publishedAt": "2020-07-06T20:12:00Z", "content": "Scientists have discovered how a single-celled organism of the species Pyrocystis lunula produces a flash of light. This happens when its cell wall is deformed by mechanical forces. Through systemati… [+2211 chars]"}, {"source": {"id": null, "name": "Cornell.edu"}, "author": null, "title": "Astronomer Martha Haynes awarded Jansky Lectureship | Cornell Chronicle - Cornell Chronicle", "description": "The Jansky Lectureship recognizes outstanding contributions to the advancement of radio astronomy and is being awarded to Haynes “for her influential impact to our understanding of galaxies.”", "url": "https://news.cornell.edu/stories/2020/07/astronomer-martha-haynes-awarded-jansky-lectureship", "urlToImage": "https://news.cornell.edu/sites/default/files/styles/story_thumbnail_lg/public/2020-07/070620_marthahaynes_tnd.jpg?itok=yXCxI1hv", "publishedAt": "2020-07-06T20:05:23Z", "content": "Professor Martha Haynes at the 2016 Friends of Astronomy Symposium.\r\nMartha Haynes, the Goldwin Smith Professor of Astronomy, has been awarded the 2020 Karl G. Jansky Lectureship by Associated Univer… [+2476 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Newly discovered pathogen in NY apples causes bitter rot disease - Science Daily", "description": "In a study of New York state apple orchards, plant pathologists have identified a new fungal pathogen that causes bitter rot disease in apples.", "url": "https://www.sciencedaily.com/releases/2020/07/200706145435.htm", "urlToImage": null, "publishedAt": "2020-07-06T19:58:37Z", "content": "In a study of New York state apple orchards, Cornell University plant pathologists have identified a new fungal pathogen that causes bitter rot disease in apples. In addition, a second related fungus… [+2311 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Simon Campbell, Yerra Bharat Kumar", "title": "Revealed: the Sun's secret plan to become a lithium factory - The Conversation AU", "description": "Astronomers have discovered that stars like the Sun produce huge amounts of lithium late in their lives.", "url": "https://theconversation.com/revealed-the-suns-secret-plan-to-become-a-lithium-factory-141976", "urlToImage": "https://images.theconversation.com/files/345620/original/file-20200704-33939-1i1qm43.jpg?ixlib=rb-1.1.0&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2020-07-06T19:53:00Z", "content": "Lithium is used in everything from medication to mobile phone batteries, but where does it come from? We know it is mined here on Earth, but where it is created in the universe is less well understoo… [+5897 chars]"}, {"source": {"id": null, "name": "Medium"}, "author": "Faisal Khan", "title": "Why a nearby “boring” star system could have two habitable planets? - Medium", "description": "Stars spewing out radiation and charged particles is a pretty common phenomenon. Our Sun does the same but a thick atmosphere and a strong magnetic field around the Earth protects us from the wrath…", "url": "https://medium.com/technicity/why-a-nearby-boring-star-system-could-have-two-habitable-planets-3e8e977d8acc", "urlToImage": "https://miro.medium.com/max/800/0*mZI3U1uhU7WSeSHp.jpg", "publishedAt": "2020-07-06T19:23:29Z", "content": "An artists impression of the two newly discovered planets orbiting GJ 887 Credit: Mark Garlick\r\nIt consists of a red dwarf star that doesnt emit flares or harmful radiation, which may cause its two p… [+3331 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Provides Update on Commercial Crew Program, Close Call Review of Boeing's Orbital Flight Test - NASA", "description": "NASA will host a media teleconference at 2:30 p.m. EDT Tuesday, July 7, to discuss the outcome of its High Visibility Close Call review of the December 2019 uncrewed Orbital Flight Test of Boeing’s Starliner spacecraft.", "url": "https://www.nasa.gov/press-release/nasa-provides-update-on-commercial-crew-program-close-call-review-of-boeing-s-orbital/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/49351604192_f238aeaf3b_k.jpg", "publishedAt": "2020-07-06T19:11:53Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researchers realize an anomalous Floquet topological system - Phys.org", "description": "An international team led by physicists from the Ludwig-Maximilians Universitaet (LMU) in Munich realized a novel genuine time-dependent topological system with ultracold atoms in periodically-driven optical honeycomb lattices.", "url": "https://phys.org/news/2020-07-anomalous-floquet-topological.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/quantum.jpg", "publishedAt": "2020-07-06T19:04:52Z", "content": "An international team led by physicists from the Ludwig-Maximilians Universitaet (LMU) in Munich realized a novel genuine time-dependent topological system with ultracold atoms in periodically-driven… [+2334 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "First direct evidence of ocean mixing across the gulf stream - EurekAlert", "description": "Study in the Proceedings of the National Academy of Sciences provides first direct evidence for Gulf Stream blender effect, identifying a new mechanism of mixing water across the swift-moving current. The results have important implications for weather, clima…", "url": "https://www.eurekalert.org/pub_releases/2020-07/uom-fde070120.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/236434_web.jpg", "publishedAt": "2020-07-06T19:03:30Z", "content": "IMAGE: The \"Triaxus \" towing platform breaks through the choppy surface of the ocean during a storm. By towing such a platform with monitoring instruments through the water, changing its depth in...\r… [+6445 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jim Salter", "title": "Exoplanet in the hot-Neptune desert is the first of its kind - Ars Technica", "description": "Hello, planetary delivery service? I'll take one gas giant, hold the gas.", "url": "https://arstechnica.com/science/2020/07/recently-discovered-exoplanet-may-be-a-heated-up-gas-giant-core/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2020/07/PIA09117_hires-gas-giant-formation-760x380.jpg", "publishedAt": "2020-07-06T18:42:00Z", "content": "Enlarge/ Artist's conception of a gas giant planetary system. Unlike TOI-849b, this one still has its enormous gassy envelope.\r\n21 with 18 posters participating, including story author\r\nIn 2018, scie… [+3098 chars]"}, {"source": {"id": null, "name": "Plos.org"}, "author": null, "title": "Planning for future job-hunting during COVID-19 - ECR Community - PLoS Blogs", "description": "Delayed The COVID-19 pandemic found me at the end of my PhD, and even though my graduation plans will be delayed, I…", "url": "https://ecrcommunity.plos.org/2020/07/06/planning-for-future-job-hunting-during-covid-19/", "urlToImage": "https://ecrcommunity.plos.org/wp-content/uploads/sites/9/2020/07/social-network-4095262_1920.jpg", "publishedAt": "2020-07-06T18:10:00Z", "content": "Delayed\r\nThe COVID-19 pandemic found me at the end of my PhD, and even though my graduation plans will be delayed, I will be looking for a job by the end of this year. Lots of my PhD friends are curr… [+5799 chars]"}, {"source": {"id": null, "name": "3rd Watch News"}, "author": null, "title": "Tag: EPA and DHA Market Manufacturing - 3rd Watch News", "description": null, "url": "https://3wnews.org/tag/epa-and-dha-market-manufacturing/", "urlToImage": null, "publishedAt": "2020-07-06T17:53:04Z", "content": "EPA and DHA  Market with Insights and Key Business Factors:\r\nThe latest Market report by a Data Bridge Market Research with the title [Global EPA and DHA  Market  Industry Trends and Forecast to 2026… [+5610 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Countdown to First Arab Mission to Mars - Bloomberg QuickTake News", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9VFNNcDY3V1hzQU3SAQA?oc=5", "urlToImage": null, "publishedAt": "2020-07-06T17:25:17Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "2-D semiconductors found to be close-to-ideal fractional quantum Hall platform - Phys.org", "description": "Columbia University researchers report that they have observed a quantum fluid known as the fractional quantum Hall states (FQHS), one of the most delicate phases of matter, for the first time in a monolayer 2-D semiconductor. Their findings demonstrate the e…", "url": "https://phys.org/news/2020-07-d-semiconductors-close-to-ideal-fractional-quantum.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/2dsemiconduc.jpg", "publishedAt": "2020-07-06T17:06:36Z", "content": "Columbia University researchers report that they have observed a quantum fluid known as the fractional quantum Hall states (FQHS), one of the most delicate phases of matter, for the first time in a m… [+6048 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Scientists discover a new connection between the eyes and touch - Medical Xpress", "description": "Tiny eye movements can be used as an index of humans' ability to anticipate relevant information in the environment independent of the information's sensory modality, a team of scientists has found. The work reveals a connection between eye movements and the …", "url": "https://medicalxpress.com/news/2020-07-scientists-eyes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/8-eye.jpg", "publishedAt": "2020-07-06T17:04:46Z", "content": "Tiny eye movements can be used as an index of humans' ability to anticipate relevant information in the environment independent of the information's sensory modality, a team of scientists has found. … [+2627 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Motherhood Overrides the Brain’s Decision-Making – Prioritizes Offspring Over Cocaine - SciTechDaily", "description": "Infralimbic cortex prioritizes offspring over drugs, promotes maternal behavior in rats. Motherhood takes over the brain's decision-making regions to prioritize caring for offspring, according to new research in rats published today (July 6, 2020) in eNeuro. …", "url": "https://scitechdaily.com/motherhood-overrides-the-brains-decision-making-prioritizes-offspring-over-cocaine/", "urlToImage": "https://scitechdaily.com/images/Brain-Heart-Connected.jpg", "publishedAt": "2020-07-06T17:00:43Z", "content": "Infralimbic cortex prioritizes offspring over drugs, promotes maternal behavior in rats.\r\nMotherhood takes over the brain’s decision-making regions to prioritize caring for offspring, according to ne… [+1906 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "By Ryan Morrison For Mailonline", "title": "Homo erectus could run long distances despite being 'built like a rugby player' - Daily Mail", "description": "Researchers from the Natural History Museum examined the ribcage of the famous Homo erectus skeleton Turkana Boy to better understand the species' breathing.", "url": "https://www.dailymail.co.uk/sciencetech/article-8494323/Long-distance-running-Homo-erectus-built-like-rugby-players.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/07/06/14/30447564-0-image-a-21_1594043915461.jpg", "publishedAt": "2020-07-06T16:33:50Z", "content": "Early humanoid ancestor Homo erectus was the first to be able to run long distances despite having a 'wide, deep chest' like Neanderthals, a new study reveals.  \r\nResearchers from the London's Natura… [+6384 chars]"}, {"source": {"id": null, "name": "Mining Technology"}, "author": "Admin", "title": "Lunar gold rush: can Moon mining ever take off? - Mining Technology", "description": "<p>The Moon could harbour more metals than had previously been believed beneath its surface, according to research conducted using NASA data. The new revelations about the Moon’s geological composition may affect theories as to the celestial body’s origin, bu…", "url": "https://www.mining-technology.com/features/moon-mining-what-would-it-take/", "urlToImage": "https://www.mining-technology.com/wp-content/uploads/sites/8/2020/07/full-moon-illustration-684441-scaled-e1594052466812.jpg", "publishedAt": "2020-07-06T16:25:00Z", "content": "The US has had a longstanding interest in mining the Moon.\r\nSign up here for GlobalData's free bi-weekly Covid-19 report on the latest information your industry needs to know.\r\nNew evidence that the … [+6132 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Mike Wehner", "title": "This massive ice lake on Mars will take your breath away – BGR - BGR", "description": "The ESA’s Mars Express orbiter captured images of a massive crater lake on the planet’s North Pole. Using data gathered by the mission, the ESA has created a virtual video flyover of th…", "url": "https://bgr.com/posts/5851217/1b5189-this-martian-lake-is-frozen-in-time/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2020/07/perspective_view_of_korolev_crater_pillars.jpg?quality=70&strip=all", "publishedAt": "2020-07-06T16:18:37Z", "content": "<ul><li>The ESA’s Mars Express orbiter captured images of a massive crater lake on the planet’s North Pole. </li><li>Using data gathered by the mission, the ESA has created a virtual video flyover of… [+2782 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "http://www.facebook.com/thegoodnewsnetwork", "title": "New Bird Song That 'Went Viral' Across Species of Sparrow Tracked by Scientists For First Time - Good News Network", "description": "A song that ‘went viral’ across a bird species has been tracked by scientists showing the white-throated sparrow’s new tune is here to stay.", "url": "https://www.goodnewsnetwork.org/new-bird-song-that-went-viral-across-species-of-sparrow-tracked-by-scientists-for-first-time/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2020/07/White-throated-sparrow-bird-swns.jpg", "publishedAt": "2020-07-06T16:00:00Z", "content": "A song that went viral across a species of bird has been tracked by scientists for the first time.\r\nMost of our feathered friends are slow to change their tunepreferring to stick with tried-and-teste… [+4417 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rob Waugh", "title": "‘Pink ice’ in Alps sparks global warming fears - Yahoo News Australia", "description": "The ice is thought to be caused by algae similar to plants found in Greenland and at Earth’s poles.", "url": "https://au.news.yahoo.com/pink-ice-alps-154728854.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/DXcWjKkKhON.GrxrJtDsrQ--~B/aD0zMDc4O3c9NTQ3MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-07/8dee7790-bf61-11ea-aebf-605085224916", "publishedAt": "2020-07-06T15:47:00Z", "content": "Mysterious pink ice in the Alps has sparked fears that it could worsen the effects of climate change, experts have warned. \r\nThe ice is thought to be caused by the algae, which is similar to plants f… [+2095 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "A safe and powerful treatment for the body against deadly radiation - Phys.org", "description": "Despite the wide application of radiation in diagnostics and treatments, there is still no magic material to protect people from radiation exposure. Though Amifostine is developed as a radioprotectant, the FDA approved its application only for the protection …", "url": "https://phys.org/news/2020-07-safe-powerful-treatment-body-deadly.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/asafeandpowe.jpg", "publishedAt": "2020-07-06T15:26:54Z", "content": "Despite the wide application of radiation in diagnostics and treatments, there is still no magic material to protect people from radiation exposure. Though Amifostine is developed as a radioprotectan… [+4470 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "New nano-engineering strategy shows potential for improved advanced energy storage - Phys.org", "description": "The rapid development of renewable energy resources has triggered tremendous demands in large-scale, cost-efficient and high-energy-density stationary energy storage systems.", "url": "https://phys.org/news/2020-07-nano-engineering-strategy-potential-advanced-energy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/newnanoengin.jpg", "publishedAt": "2020-07-06T15:26:33Z", "content": "The rapid development of renewable energy resources has triggered tremendous demands in large-scale, cost-efficient and high-energy-density stationary energy storage systems.\r\nLithium ion batteries (… [+2815 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "A 'breath of nothing' provides a new perspective on superconductivity - Phys.org", "description": "Zero electrical resistance at room temperature? A material with this property, i.e. a room temperature superconductor, could revolutionize power distribution. But so far, the origin of superconductivity at high temperature is only incompletely understood. Sci…", "url": "https://phys.org/news/2020-07-perspective-superconductivity.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/glassofwater.jpg", "publishedAt": "2020-07-06T15:24:44Z", "content": "Zero electrical resistance at room temperature? A material with this property, i.e. a room temperature superconductor, could revolutionize power distribution. But so far, the origin of superconductiv… [+3806 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Study: Dying Stars Breathe Life Into Earth - Mirage News", "description": "NGC 7789, also known as Caroline's Rose, is an old open star cluster of the Milky Way, which lies about 8,000 light-years away toward the constellation...", "url": "https://www.miragenews.com/study-dying-stars-breathe-life-into-earth/", "urlToImage": "https://releases.jhu.edu/wp-content/uploads/2020/07/NASA-open-cluster.png", "publishedAt": "2020-07-06T15:15:00Z", "content": "NGC 7789, also known as Caroline’s Rose, is an old open star cluster of the Milky Way, which lies about 8,000 light-years away toward the constellation Cassiopeia. It hosts a few White Dwarfs of unus… [+5038 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "'Pregnancy test for water' delivers fast, easy results on water quality - Mirage News", "description": "A new platform technology can assess water safety and quality with just a single drop and a few minutes. Likened to a pregnancy test, the handheld...", "url": "https://www.miragenews.com/pregnancy-test-for-water-delivers-fast-easy-results-on-water-quality/", "urlToImage": "https://news.northwestern.edu/assets/Stories/2020/06/_resampled/ScaleWidthWyI0ODAiXQ/lucks640.jpg", "publishedAt": "2020-07-06T15:08:14Z", "content": "A new platform technology can assess water safety and quality with just a single drop and a few minutes.\r\nLikened to a pregnancy test, the handheld platform uses one sample to provide an easy-to-read… [+7801 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "A Vast Stream of Flowing Stars Is Evidence of The Milky Way's Violent History - ScienceAlert", "description": "When you go outside and look at the sky on a clear night, it seems like nothing else could be as serene and peaceful. But many of those seemingly peaceful stars are evidence of a turbulent history - and now we're learning to unlock their secrets.", "url": "https://www.sciencealert.com/a-vast-stream-of-stars-flowing-near-the-sun-reveals-more-of-our-galaxy-s-violent-history", "urlToImage": "https://www.sciencealert.com/images/2020-07/processed/milky-way-gaia_1024.jpg", "publishedAt": "2020-07-06T15:05:28Z", "content": "When you go outside and look at the sky on a clear night, it seems like nothing else could be as serene and peaceful. But many of those seemingly peaceful stars are evidence of a turbulent history - … [+4893 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Light a critical factor in limiting carbon uptake, especially in the north - EurekAlert", "description": "A new Columbia Engineering study demonstrates that even when temperatures warm and cold stress is limited, light is still a major factor in limiting carbon uptake of northern high latitudes. The team analyzed satellite observations, field measurements, and mo…", "url": "https://www.eurekalert.org/pub_releases/2020-07/cuso-lac070220.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/236639_web.jpg", "publishedAt": "2020-07-06T15:03:02Z", "content": "IMAGE: Boreal tundra at Denali National Park, a northern high latitude region that, as temperatures rise, will not become more conducive to vegetation growth--light is still essential to end of seaso… [+5658 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Giant clams manipulate light to assist their symbiotic partner - Phys.org", "description": "Special cells in giant clams shift the wavelength of light to protect them from UV radiation and increase the photosynthetic activity of their symbionts, shows research from King Abdullah University of Science and Technology—originally intended as a photonics…", "url": "https://phys.org/news/2020-07-giant-clams-symbiotic-partner.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/giantclamsma.jpg", "publishedAt": "2020-07-06T13:46:42Z", "content": "Special cells in giant clams shift the wavelength of light to protect them from UV radiation and increase the photosynthetic activity of their symbionts, shows research from King Abdullah University … [+3353 chars]"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Shane McGlaun", "title": "Scientists now know how massive the fastest-growing black hole in the Universe is - SlashGear", "description": "A team of researchers led by The Australian National University has determined just how massive the fastest-growing black hole in the Universe is. The team is also determined how much material the …", "url": "https://www.slashgear.com/scientists-now-know-how-massive-the-fastest-growing-black-hole-in-the-universe-is-06627764/", "urlToImage": "https://cdn.slashgear.com/wp-content/uploads/2020/07/massive-black-hole.jpg", "publishedAt": "2020-07-06T13:03:55Z", "content": "A team of researchers led by The Australian National University has determined just how massive the fastest-growing black hole in the Universe is. The team is also determined how much material the bl… [+1450 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Matt Simon", "title": "The Epic Siberian Journey to Solve a Mass Extinction Mystery - WIRED", "description": "A quarter-billion years ago, huge volcanic eruptions burned coal, leading to the worst extinction in Earth’s history. Here’s how scientists hunted down the evidence.", "url": "https://www.wired.com/story/the-epic-siberian-journey-to-solve-a-mass-extinction-mystery/", "urlToImage": "https://media.wired.com/photos/5efe531a45997e7f063bec76/191:100/w_1280,c_limit/Science_90-View-from-Fedorenko-Section-1-at-our-site-5-2.jpg", "publishedAt": "2020-07-06T13:00:00Z", "content": "I really wanted to find this place that was rumored where there were a lot of rocks that result from explosive volcanic eruptions, Elkins-Tanton says, because that's the only way that we know of that… [+3302 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Herschel and Planck views of star formation - Phys.org", "description": "A collection of intriguing images based on data from ESA's Herschel and Planck space telescopes show the influence of magnetic fields on the clouds of gas and dust where stars are forming.", "url": "https://phys.org/news/2020-07-herschel-planck-views-star-formation.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/herschelandp.jpg", "publishedAt": "2020-07-06T12:53:48Z", "content": "A collection of intriguing images based on data from ESA's Herschel and Planck space telescopes show the influence of magnetic fields on the clouds of gas and dust where stars are forming.\r\nThe image… [+1961 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "By Ryan Morrison For Mailonline", "title": "Robot is being adapted to conduct up to 700 socially distanced experiments a week - Daily Mail", "description": "The robot is significantly more efficient, able to perform up to 700 experiments in a week - the same number a student might complete over the course of a PhD.", "url": "https://www.dailymail.co.uk/sciencetech/article-8493819/Robot-adapted-conduct-700-socially-distanced-experiments-week.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/07/06/11/30441618-0-image-a-18_1594032193934.jpg", "publishedAt": "2020-07-06T12:25:33Z", "content": "A robot that is usually used in car factories has been reprogrammed to test samples and carry out experiments in a lab during coronavirus lockdown, scientists reveal.\r\nUniversity of Liverpool researc… [+4953 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Daniel Oberhaus", "title": "The UAE’s First Mars Mission Is a Robo-Meteorologist - WIRED", "description": "The United Arab Emirates is preparing to launch its first Martian satellite, Hope, which will search for clues to the Red Planet’s atmospheric mysteries.", "url": "https://www.wired.com/story/the-uaes-first-mars-mission-is-a-robo-meteorologist/", "urlToImage": "https://media.wired.com/photos/5efe13e0f435e6f478b28aa9/191:100/w_1280,c_limit/Science_EMM-Hope-tvac-0210.jpg", "publishedAt": "2020-07-06T12:00:00Z", "content": "When the UAE was created, some countries were already sending things to space, says Omran Sharaf, the program manager for the Hope mission. To catch up requires us to be much faster than other nation… [+3690 chars]"}, {"source": {"id": null, "name": "Eu.com"}, "author": null, "title": "Russia and Space Adventures sign contract to offer first tourist spacewalk - ROOM Space Journal", "description": "Russian space corporation Energia and US firm Space Adventure sign a contract to offer someone the chance of becoming the first private citizen to walk in space", "url": "https://room.eu.com/news/russia-and-space-adventures-sign-contract-to-offer-first-tourist-spacewalk", "urlToImage": "https://room.eu.com/images/contents/SpacewalkSpaceAdventures.jpg", "publishedAt": "2020-07-06T11:47:48Z", "content": "Space tourists wanting to raise the bar in daring off-world escapades can now go one step further than travelling to low-Earth orbit and holidaying in the International Space Station they can now get… [+2461 chars]"}, {"source": {"id": null, "name": "Mirage News"}, "author": null, "title": "Earth's magnetic field changes faster than previously thought - Mirage News", "description": "A new study reveals that changes in the direction of the Earth's magnetic field may take place 10 times faster than previously thought. The study...", "url": "https://www.miragenews.com/earth-s-magnetic-field-changes-faster-than-previously-thought/", "urlToImage": "https://www.leeds.ac.uk/images/WEB_mag_field_NASA.jpg", "publishedAt": "2020-07-06T10:16:14Z", "content": "A new study reveals that changes in the direction of the Earth’s magnetic field may take place 10 times faster than previously thought.\r\nThe study by the University of Leeds and University of Califor… [+4378 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "2D-barcoded NMR tube scanner - News-Medical.Net", "description": "The Express Scanner from Ziath is an elegant and rapid solution for ensuring the traceability of samples in 2D-barcoded Nuclear Magnetic Resonance (NMR) tubes.", "url": "https://www.news-medical.net/news/20200706/2D-barcoded-NMR-tube-scanner.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2020%2f7%2fziathpr20-imageA_02cd8949707b49b5af422abc888f22b3-620x480.jpg", "publishedAt": "2020-07-06T10:01:22Z", "content": "The Express Scanner from Ziath is an elegant and rapid solution for ensuring the traceability of samples in 2D-barcoded Nuclear Magnetic Resonance (NMR) tubes.\r\nThis new product delivers an industry-… [+1278 chars]"}, {"source": {"id": null, "name": "GeekTyrant"}, "author": "Joey Paur", "title": "Stunning Trailer for IMAX's ASTEROID HUNTERS - \"Finding Asteroids Before They Find Us is Critical\" - GeekTyrant", "description": "IMAX has shared the first trailer for their upcoming original documentary film titled   Asteroid Hunters  . The film puts the focus on the people and technology that are being utilized to hunt down asteroids in deep space and assess them. This is basically ou…", "url": "https://geektyrant.com/news/stunning-trailer-for-imaxs-asteroid-hunters-finding-asteroids-before-they-find-us-is-critical", "urlToImage": "http://static1.squarespace.com/static/51b3dc8ee4b051b96ceb10de/51ce6099e4b0d911b4489b79/5efe24eee6756c5da09e6cae/1594029615744/stunning-trailer-for-imaxs-asteroid-hunters-finding-asteroids-before-they-find-us-is-critical-social.jpg?format=1500w", "publishedAt": "2020-07-06T10:00:00Z", "content": "IMAX has shared the first trailer for their upcoming original documentary film titled Asteroid Hunters. The film puts the focus on the people and technology that are being utilized to hunt down aster… [+1528 chars]"}, {"source": {"id": null, "name": "VG247"}, "author": "Lauren Aitken", "title": "Animal Crossing: New Horizons Sea Creature prices - when and where to find every Sea Creature - VG247", "description": "Swimming and diving have been added to Animal Crossing: New Horizons in the new July update and there’s a bunch of shiny new Sea Creatures to find for Bl…", "url": "https://www.vg247.com/2020/07/06/animal-crossing-new-horizons-sea-creature-prices/", "urlToImage": "https://assets.vg247.com/current//2020/07/animal-crossing-creature.jpg", "publishedAt": "2020-07-06T09:50:17Z", "content": "Swimming and diving have been added to Animal Crossing: New Horizons in the new July update and there’s a bunch of shiny new Sea Creatures to find for Blathers. \r\nNot content with collecting art, fos… [+4887 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Giant Sea Scorpions Were the Underwater Titans of Prehistoric Australia - Gizmodo Australia", "description": "Let’s turn back the hands of time. Before extinction knocked dinosaurs off their pillar, before the “Great Dying” extinction wiped out 95% of all organisms – we had the Paleozoic Era. During this age in Earth’s history, between 541 million and 252 million yea…", "url": "https://www.gizmodo.com.au/2020/07/giant-sea-scorpions-were-the-underwater-titans-of-prehistoric-australia/", "urlToImage": "https://www.gizmodo.com.au/content/uploads/sites/2/2020/07/06/sea-scorpions-floating-in-the-ocean-1280x621.png", "publishedAt": "2020-07-06T09:15:01Z", "content": "Lets turn back the hands of time. Before extinction knocked dinosaurs off their pillar, before the Great Dying extinction wiped out 95% of all organisms we had the Paleozoic Era.\r\nDuring this age in … [+4794 chars]"}, {"source": {"id": null, "name": "Best gaming pro"}, "author": "Dinu das", "title": "Why simple tech should excite us more - Best gaming pro", "description": "Image any movie scene set in “the long run.” Most of the time, it’s a futurescape populated by flying automobiles, environment friendly robots, and teleportation. These dazzling fictions shade our notion of what progress seems like. And this implies it’s the …", "url": "https://bestgamingpro.com/why-simple-tech-should-excite-us-more/", "urlToImage": "https://bestgamingpro.com/wp-content/uploads/2020/07/Why-simple-tech-should-excite-us-more.jpgw1200stripall-1000x600.jpeg", "publishedAt": "2020-07-06T08:40:48Z", "content": "Image any movie scene set in the long run. Most of the time, its a futurescape populated by flying automobiles, environment friendly robots, and teleportation. These dazzling fictions shade our notio… [+5735 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "'Crippling force' bursts NASA rocket - Daily Mercury", "description": "NASA has shared video of the rocket that is supposed to return astronauts to the Moon being crushed and destroyed.", "url": "https://www.news.com.au/technology/science/space/nasa-destroy-space-launch-system-bound-for-moon-mission/news-story/f41656a655b9b2c8d4c9c5ea22a8ea42", "urlToImage": "https://media.apnarm.net.au/media/images/2020/07/06/v3imagesbin97b75c408178aa34d02a950484092758-184ui1tflj6xsr6nmu2_ct1880x930.jpg", "publishedAt": "2020-07-06T07:56:00Z", "content": "The NASA rocket that's supposed to return astronauts to the Moon within the next five years has been destroyed with \"crippling force\".\r\nNASA deliberately pushed the rocket to its limits and destroyed… [+1972 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Victoria Gill - Science correspondent, BBC News", "title": "Robotic scientists will 'speed up discovery' - Yahoo News Australia", "description": "Robotic scientists could speed up scientific discovery, while human scientists work from home, developers say.", "url": "https://news.yahoo.com/robotic-scientists-speed-discovery-063604776.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/NBQcVv_6q2hFNV1DJP0S7w--~B/aD01NDk7dz05NzY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-gb/bbc_us_articles_995/ecd4c23bb1aa931c61f1e7745ff911b2", "publishedAt": "2020-07-06T06:47:41Z", "content": "Scientists at the University of Liverpool have unveiled a robotic colleague that has been working non-stop in their lab throughout lockdown.\r\nThe £100,000 programmable researcher learns from its resu… [+2743 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Russell D.C. Bicknell & Patrick M. Smith, The Conversation", "title": "Gigantic Sea Scorpions, Some Larger Than Humans, Hunted in Ancient Oceans - ScienceAlert", "description": "Let's turn back the hands of time. Before extinction knocked dinosaurs off their pillar, before the \"Great Dying\" extinction wiped out 95 percent of all organisms – we had the Paleozoic Era.", "url": "https://www.sciencealert.com/massive-scorpions-some-larger-than-humans-once-swum-australia-s-prehistoric-waters", "urlToImage": "https://www.sciencealert.com/images/2020-07/processed/GiantPrehistoricAussieScorpions_1024.jpg", "publishedAt": "2020-07-06T06:19:16Z", "content": "Let's turn back the hands of time. Before extinction knocked dinosaurs off their pillar, before the \"Great Dying\" extinction wiped out 95 percent of all organisms we had the Paleozoic Era.\r\nDuring th… [+4616 chars]"}, {"source": {"id": null, "name": "Thesaxon.org"}, "author": "Greg Smitson", "title": "Not the Sun: first time scientists were able to calculate with accuracy up to 100 meters, where is the center… - The Saxon", "description": "Valery LEBOVKA, \"FACTS\" Scientists for a long time tried to calculate the exact position of the center of the Solar", "url": "https://thesaxon.org/not-the-sun-first-time-scientists-were-able-to-calculate-with-accuracy-up-to-100-meters-where-is-the-center/5334/", "urlToImage": "https://thesaxon.org/wp-content/uploads/2020/07/ne-solnce-uchenym-vpervye-udalos-vychislit-s-tochnostju-do-100-metrov-gde-nahoditsja-centr-742a49b.jpg", "publishedAt": "2020-07-06T06:16:55Z", "content": "Valery LEBOVKA, “FACTS” \r\nScientists for a long time tried to calculate the exact position of the center of the Solar system, thanks to which it would be possible to use neutron stars to find the wea… [+3956 chars]"}, {"source": {"id": null, "name": "Anu.edu.au"}, "author": null, "title": "Hungry black hole among the most massive in the Universe - ANU College of Science", "description": "We now know just how massive the fastest-growing black hole in the Universe actually is, as well as how much it eats, thanks to new research led by The Australian National University (ANU).   It is 34 billion times the mass of our sun and gorges on nearly the…", "url": "https://www.anu.edu.au/news/all-news/hungry-black-hole-among-the-most-massive-in-the-universe", "urlToImage": "https://www.anu.edu.au/files/story/blackholeclouds_0.jpg", "publishedAt": "2020-07-06T05:05:48Z", "content": "We now know just how massive the fastest-growing black hole in the Universe actually is, as well as how much it eats, thanks to new research led by The Australian National University (ANU).  \r\nIt is … [+1886 chars]"}, {"source": {"id": null, "name": "Acs.org"}, "author": "Sam Lemonick", "title": "Pentadiamond outshines the original - Chemical & Engineering News", "description": "A theoretical material made of carbon pentagons is lighter and stiffer than a standard diamond", "url": "https://cen.acs.org/materials/Pentadiamond-outshines-original/98/i26", "urlToImage": "https://acs-h.assetsadobe.com/is/image//content/dam/cen/98/26/WEB/09826-scicon5-diamond.jpg/?$responsive$&wid=700&qlt=90,0&resMode=sharp2", "publishedAt": "2020-07-06T05:03:56Z", "content": "Diamonds may be forever, but that doesnt mean theyre the only game in town. Researchers Yasumaru Fujii, Mina Maruyama, and colleagues at the University of Tsukuba have made computer models of a new 3… [+1001 chars]"}, {"source": {"id": null, "name": "Science Codex"}, "author": null, "title": "Norman Conquest of 1066 did little to change people's eating habits - Science Codex", "description": null, "url": "https://www.sciencecodex.com/norman-conquest-1066-did-little-change-peoples-eating-habits-651206", "urlToImage": null, "publishedAt": "2020-07-06T04:00:00Z", "content": "Archaeologists from Cardiff University and the University of Sheffield have combined the latest scientific methods to offer new insights into life during the Norman Conquest of England.\r\nUntil now, t… [+3920 chars]"}, {"source": {"id": null, "name": "Aviationanalysis.net"}, "author": null, "title": "Big Penguin-Like Birds May Have After Waddled All-around The Northern Hemisphere, Far too - Aviation Analysis Wing", "description": "A new fossil discovery has uncovered that New Zealand's ancient monster penguins ended up not the only human-sized, flightless birds waddling around our", "url": "http://www.aviationanalysis.net/big-penguin-like-birds-may-have-after-waddled-all-around-the-northern-hemisphere-far-too/", "urlToImage": "https://news.google.com/images/2020-07/mayr.png", "publishedAt": "2020-07-06T03:37:00Z", "content": "A new fossil discovery has uncovered that New Zealand’s ancient monster penguins ended up not the only human-sized, flightless birds waddling around our earth tens of millions of decades in the past.… [+4182 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Surprising Find at the Bottom of Moon’s Craters Provides New Insights to Its Origin - SciTechDaily", "description": "Life on Earth would not be possible without the Moon; it keeps our planet's axis of rotation stable, which controls seasons and regulates our climate. However, there has been considerable debate over how the Moon was formed. The popular hypothesis contends th…", "url": "https://scitechdaily.com/surprising-find-at-the-bottom-of-moons-craters-provides-new-insights-to-its-origin/", "urlToImage": "https://scitechdaily.com/images/Moon-Limb-With-Earth.jpg", "publishedAt": "2020-07-06T01:52:58Z", "content": "View of Moon Limb, with Earth on the Horizon. Credit: NASA Apollo 11 Mission Image\r\nLife on Earth would not be possible without the Moon; it keeps our planet’s axis of rotation stable, which controls… [+4779 chars]"}, {"source": {"id": null, "name": "Wingedexpress.com"}, "author": "Patrick S. Shoe", "title": "Korolev crater on Mars - important to human colonisation strategies - demonstrated in spectacular ESA movie | Science - Winged Express", "description": "The European Area Company released a hardly ever-before-seen view of the icy Martian canyon known as the Korolev crater. The...", "url": "https://wingedexpress.com/korolev-crater-on-mars-important-to-human-colonisation-strategies-demonstrated-in-spectacular-esa-movie-science-news/", "urlToImage": null, "publishedAt": "2020-07-06T01:52:12Z", "content": "The European Area Company released a hardly ever-before-seen view of the icy Martian canyon known as the Korolev crater. The Korolev crater is recognized amongst experts as a probable upcoming source… [+1887 chars]"}, {"source": {"id": null, "name": "Unsw.edu.au"}, "author": "z3525182", "title": "The world endured two extra heatwave days per decade since 1950 – but the worst is yet to come - UNSW Newsroom", "description": "Heatwaves have become longer, hotter and more frequent. This trend is accelerating from climate change.", "url": "https://newsroom.unsw.edu.au/news/science-tech/world-endured-two-extra-heatwave-days-decade-1950-%E2%80%93-worst-yet-come", "urlToImage": "https://newsroom.unsw.edu.au/sites/default/files/thumbnails/image/shutterstock_1070758637_1.jpg", "publishedAt": "2020-07-05T23:20:53Z", "content": "Heatwaves have become longer, hotter and more frequent. This trend is accelerating from climate change.The term heatwave is no stranger to Australians. Defined as when conditions are excessively hot … [+5050 chars]"}, {"source": {"id": null, "name": "Lifehacker Australia"}, "author": null, "title": "How to Watch a 10-Year Time Lapse Video of the Sun - Lifehacker Australia", "description": "As children, we were told not to stare (or even look directly at) the sun because it could hurt our eyes. Sure, that makes sense, but it also adds to the mystery of the sun. We know it’s bright, but what exactly does it look like? Thanks to NASA, you...", "url": "https://www.lifehacker.com.au/2020/07/how-to-watch-a-10-year-time-lapse-video-of-the-sun/", "urlToImage": "https://www.lifehacker.com.au/content/uploads/sites/4/2020/07/06/s6qpo5n6qol91lghwjxp-1280x720.jpg", "publishedAt": "2020-07-05T22:25:26Z", "content": "As children, we were told not to stare (or even look directly at) the sun because it could hurt our eyes. Sure, that makes sense, but it also adds to the mystery of the sun. We know its bright, but w… [+1737 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Jupiter Just Sprouted a Brand New Spot - Gizmodo Australia", "description": "An amateur astronomer in South Africa has detected a bright new surface feature rising above the cloud tops on Jupiter. The largest planet in the solar system has a bright new blotch in its southern hemisphere, reports NASA. The cloudy plume, dubbed “Clyde’s …", "url": "https://www.gizmodo.com.au/2020/07/jupiter-just-sprouted-a-brand-new-spot/", "urlToImage": "https://www.gizmodo.com.au/content/uploads/sites/2/2020/07/04/vnpw49slah7yzgnntzny.jpg", "publishedAt": "2020-07-05T22:20:19Z", "content": "An amateur astronomer in South Africa has detected a bright new surface feature rising above the cloud tops on Jupiter.\r\nThe largest planet in the solar system has a bright new blotch in its southern… [+1947 chars]"}, {"source": {"id": null, "name": "Checkersaga"}, "author": "", "title": "In this area of the Earth the temperatures do not rise due to climate change, but are increasingly colder - Checkersaga", "description": "Although the greenhouse effect is increasing the temperatures of the Earth with the passing of the decades, there…", "url": "https://checkersaga.com/in-this-area-of-​​the-earth-the-temperatures-do-not-rise-due-to-climate-change-but-are-increasingly-colder/50657/", "urlToImage": null, "publishedAt": "2020-07-05T21:06:29Z", "content": "While climate change is causing the poles to melt and the sea level to rise due to rising temperatures around the world, there is an entirely opposite point on our planet: its temperatures are gettin… [+1691 chars]"}, {"source": {"id": null, "name": "Keralakaumudi.com"}, "author": "Kerala Kaumudi", "title": "ISRO's MOM captures image of the biggest moon of Mars - കേരള കൌമുദി", "description": "BENGALURU: The Mars Colour Camera (MCC) onboard ISRO's Mars Orbiter Mission has captured the image of Phobos, the closest and biggest moon of Mars.", "url": "https://www.keralakaumudi.com/en/news/news.php?id=341992&u=isros-mom-captures-image-of-the-biggest-moon-of-mars", "urlToImage": "https://keralakaumudi.com/web-news/en/2020/07/NMAN0156928/image/mars.1.665695.jpg", "publishedAt": "2020-07-05T20:24:15Z", "content": "BENGALURU: The Mars Colour Camera (MCC) onboard ISRO's Mars Orbiter Mission has captured the image of Phobos, the closest and biggest moon of Mars.\r\nThe image was taken on July 1 when MOM was about 7… [+1569 chars]"}, {"source": {"id": null, "name": "Aviationanalysis.net"}, "author": null, "title": "\"Ice Large\" --Blasted Fossil Main of a Substantial, Jupiter-Sized World Discovered (Weekend Function) - Aviation Analysis Wing", "description": "Posted on Jul 5, 2020 in Astronomy, Exoplanets, Science A bizarre ice giant that simply cannot be described by former concept has been identified by NASA", "url": "http://www.aviationanalysis.net/ice-large-blasted-fossil-main-of-a-substantial-jupiter-sized-world-discovered-weekend-function/", "urlToImage": "http://www.aviationanalysis.net/wp-content/uploads/2020/07/Ice-Giant-Blasted-Fossil-Core-of-a-Massive-Jupiter-Sized-Planet.jpg", "publishedAt": "2020-07-05T20:22:36Z", "content": "Posted on Jul 5, 2020 in Astronomy, Exoplanets, Science\r\nA bizarre ice giant that simply cannot be described by former concept has been identified by NASA Experts working with the exoplanet-sleuth Tr… [+4366 chars]"}, {"source": {"id": null, "name": "Aviationanalysis.net"}, "author": null, "title": "Fireworks canceled this calendar year? Look at the lunar eclipse 'Buck Moon' instead - Aviation Analysis Wing", "description": "ATLANTA (CNN) — If your family's Fourth of July fireworks ideas are up in smoke mainly because of the pandemic, watch the sky for a lunar eclipse", "url": "http://www.aviationanalysis.net/fireworks-canceled-this-calendar-year-look-at-the-lunar-eclipse-buck-moon-instead/", "urlToImage": null, "publishedAt": "2020-07-05T20:20:35Z", "content": "ATLANTA (CNN) If your family’s Fourth of July fireworks ideas are up in smoke mainly because of the pandemic, watch the sky for a lunar eclipse alternatively.\r\nOn July 4, just soon after 11 p.m. ET, … [+3294 chars]"}, {"source": {"id": null, "name": "International Business Times, Singapore Edition"}, "author": "https://www.ibtimes.sg/reporters/krishnendra-banerjee", "title": "Scientists Discover New Exotic Tetraquark Particle Using Large Hadron Collider At CERN - International Business Times, Singapore Edition", "description": "The new discovery of the tetraquark will help scientists study matter particles and strong interactions between them called quantum chromodynamics", "url": "https://www.ibtimes.sg/scientists-discover-new-exotic-tetraquark-particle-using-large-hadron-collider-cern-47985", "urlToImage": "https://data.ibtimes.sg/en/full/39419/tetraquark.jpg", "publishedAt": "2020-07-05T11:33:48Z", "content": "The Large Hadron Collider (LHC) has been one of the greatest gifts for particle physics and it has never ceased to amuse scientists. During CERN's (European Organization for Nuclear Research) latest … [+3701 chars]"}, {"source": {"id": null, "name": "Jakarta Post"}, "author": "The Jakarta Post", "title": "Satellite-carrying rocket 'lost' after New Zealand launch - The Jakarta Post - Jakarta Post", "description": "A commercial rocket carrying seven satellites was \"lost\" after take-off Sunday from a New Zealand launch pad, the owner Rocket Lab said.", "url": "https://www.thejakartapost.com/life/2020/07/05/satellite-carrying-rocket-lost-after-new-zealand-launch.html", "urlToImage": "https://img.jakpost.net/c/2020/07/05/2020_07_05_99478_1593929402._large.jpg", "publishedAt": "2020-07-05T06:11:00Z", "content": "A commercial rocket carrying seven satellites was \"lost\" after take-off Sunday from a New Zealand launch pad, the owner Rocket Lab said.\r\n\"We lost the flight late into the mission,\" Peter Beck, Rocke… [+1113 chars]"}, {"source": {"id": null, "name": "Market Research News"}, "author": null, "title": "They Would possibly No longer Be Snakes, however Those Amphibians Have a Venomous Chew - Market Research News", "description": "] A magnified symbol of the mouth of a ringed caecilian, Siphonops annulatus, unearths snake-like dental glands. Researchers from Brazil’s Butantan", "url": "https://marketresearchnews.org/2020/07/05/they-would-possibly-no-longer-be-snakes-however-those-amphibians-have-a-venomous-chew/", "urlToImage": "https://marketresearchnews.org/wp-content/uploads/2020/07/Oral-Glands-Close-Up.jpg", "publishedAt": "2020-07-05T05:52:40Z", "content": "]\r\nA magnified symbol of the mouth of a ringed caecilian, Siphonops annulatus, unearths snake-like dental glands. Researchers from Brazils Butantan Institute and Utah State College say the glands may… [+4108 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "CNN", "title": "Fastest-growing black hole discovered more than 12 billion light-years away - 7NEWS.com.au", "description": "The fastest-growing black hole in the universe is 34 billion times the mass of our sun and feasts on a meal the equivalent of our sun each day, according to a new study.", "url": "https://7news.com.au/technology/space/fastest-growing-black-hole-discovered-more-than-12-billion-light-years-away-c-1141865", "urlToImage": "https://images.s.7news.com.au/publication/C-1141865/8e23164052e53ac2ab6d243022ab6cb316d1c337-16x9-x0y3w878h494.jpg?imwidth=1024", "publishedAt": "2020-07-05T00:56:24Z", "content": "The fastest-growing black hole in the universe is 34 billion times the mass of our sun and feasts on a meal the equivalent of our sun each day, according to a new study.\r\nThis massive, hungry black h… [+3826 chars]"}]}