{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "News-medical.net"}, "author": null, "title": "Scientists demonstrate new brain-inspired learning mechanism - News-Medical.Net", "description": "The origin of machine and deep learning algorithms, which increasingly affect almost all aspects of our life, is the learning mechanism of synaptic (weight) strengths connecting neurons in our brain.", "url": "https://www.news-medical.net/news/20200423/Scientists-demonstrate-new-brain-inspired-learning-mechanism.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2019%2f5%2ffuturistic_techno_design_on_background_of_supercomputer_data_center_-_Image_-_Timofeev_Vladimir_M1_402c068791b640469e416c4f55d84afe-620x480.jpg", "publishedAt": "2020-04-23T14:09:18Z", "content": "The origin of machine and deep learning algorithms, which increasingly affect almost all aspects of our life, is the learning mechanism of synaptic (weight) strengths connecting neurons in our brain.\r\nAttempting to imitate these brain functions, researchers b… [+3127 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Venus: Forgotten Sister Planet or Our Next Frontier? - NASA Goddard", "description": "Venus, our nearby “sister” planet, beckons today as a compelling target for exploration that may connect the objects in our own solar system to those discove...", "url": "https://www.youtube.com/watch?v=t03o3T9zXQ8", "urlToImage": "https://i.ytimg.com/vi/t03o3T9zXQ8/hqdefault.jpg", "publishedAt": "2020-04-23T14:00:20Z", "content": null}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "Microplastics found in Antarctic sea ice - Townsville Bulletin", "description": "Microplastics found in Antarctic sea ice", "url": "https://www.news.com.au/national/breaking-news/microplastics-found-in-antarctic-sea-ice/news-story/d71c48b27c81563b6aac5d7b4a2f2e46", "urlToImage": "https://www.news.com.au/wp-content/themes/vip/newscorpau-nca/assets/dist/img/common/placeholders/newscomau-major.png", "publishedAt": "2020-04-23T10:25:00Z", "content": "Microplastics, such as those used in commercial fishing, have been discovered in Antarctic sea ice in what researchers say is a first.The study, led by an Institute for Marine and Antarctic Studies team, found 96 microplastic particles in an ice core collecte… [+1520 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Tectonic plates started shifting 3.2 billion years ago: Study - Daijiworld.com", "description": "", "url": "https://www.daijiworld.com/news/newsDisplay.aspx?newsID=700101", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2020-04-23T10:04:45Z", "content": "New York, Apr 23 (IANS): The Earth's tectonic plates started moving more than 3.2 billion years ago - just over 1.3 billion years after the Earth first formed and earlier than originally thought, researchers have revealed.\r\nTo date, some researchers theorised… [+2842 chars]"}, {"source": {"id": null, "name": "Theconversation.com"}, "author": "Peter Francis", "title": "Running shoes may cause injuries – going barefoot could be the surprising fix - The Conversation UK", "description": "Running as nature intended might help prevent shin, foot, knee and ankle injuries.", "url": "https://theconversation.com/running-shoes-may-cause-injuries-going-barefoot-could-be-the-surprising-fix-135264", "urlToImage": "https://images.theconversation.com/files/330030/original/file-20200423-47847-pjdl8s.jpg?ixlib=rb-1.1.0&rect=6%2C454%2C4454%2C2227&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2020-04-23T09:47:00Z", "content": "It was around four to six million years ago when humans first evolved to walk upright. We continued to evolve into superb long-distance walkers and runners, made possible by our arched feet, long achilles tendon, and ability to cool through sweating. And surp… [+5505 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "David L. Chandler", "title": "Researchers explore ocean microbes' role in climate effects - Phys.org", "description": "A new study shows that \"hotspots\" of nutrients surrounding phytoplankton—which are tiny marine algae producing approximately half of the oxygen we breathe every day—play an outsized role in the release of a gas involved in cloud formation and climate regulati…", "url": "https://phys.org/news/2020-04-explore-ocean-microbes-role-climate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/3-ocean.jpg", "publishedAt": "2020-04-23T09:20:22Z", "content": "A new study shows that \"hotspots\" of nutrients surrounding phytoplanktonwhich are tiny marine algae producing approximately half of the oxygen we breathe every dayplay an outsized role in the release of a gas involved in cloud formation and climate regulation… [+4821 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Researchers create seismic stress map of North America - Mirage News", "description": "A new stress map that reveals the forces acting on the planet's crust will contribute to safer energy exploration, updated seismic hazard maps and...", "url": "https://www.miragenews.com/researchers-create-seismic-stress-map-of-north-america/", "urlToImage": "https://news-media.stanford.edu/wp-content/uploads/2020/04/21100123/NAStressMap_1-555x369.jpg", "publishedAt": "2020-04-23T09:02:14Z", "content": "A new stress map that reveals the forces acting on the planet’s crust will contribute to safer energy exploration, updated seismic hazard maps and improved knowledge about the Earth.\r\n By Danielle Torrent Tucker \r\nHow do mountains form? What forces are needed… [+4604 chars]"}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Rada Mateescu", "title": "Devastating Simulations Shock The World – Arctic Summers Will Bring Massive Change - Dual Dove", "description": "For millions and millions of years, the Arctic observed a ritual that remained the same over time. During the winters, the Arctic Sea Ice is expanding, and sub-zero polar temperatures freeze waters…", "url": "https://www.dualdove.com/devastating-simulations-shock-the-world-arctic-summers-will-bring-massive-change/9664/", "urlToImage": "https://www.dualdove.com/wp-content/uploads/2020/04/Large_WW22430.jpg", "publishedAt": "2020-04-23T08:37:30Z", "content": "For millions and millions of years, the Arctic observed a ritual that remained the same over time. During the winters, the Arctic Sea Ice is expanding, and sub-zero polar temperatures freeze waters in their place.\r\nDuring the summer, the ice pack is retreatin… [+1987 chars]"}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Tanya Thompson", "title": "The Origins of Life – The Visible Universe Might Be Barren, New Research Revealed - Dual Dove", "description": "The way life emerged on Earth mimics the way the Universe was created. You can call it the Big Bang of life. Just like the Big Bang was the explosion of a singularity the size of a peach, the same …", "url": "https://www.dualdove.com/the-origins-of-life-the-visible-universe-might-be-barren-new-research-revealed/9650/", "urlToImage": "https://www.dualdove.com/wp-content/uploads/2020/04/origins-of-life-visible-universe-might-be-barren.jpg", "publishedAt": "2020-04-23T08:15:00Z", "content": "The way life emerged on Earth mimics the way the Universe was created. You can call it the Big Bang of life. Just like the Big Bang was the explosion of a singularity the size of a peach, the same way a non-living entity exploded into life.\r\nAnd just like the… [+2368 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "It takes water to give volcanoes fire and fury - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-23T08:01:00Z", "content": null}, {"source": {"id": null, "name": "Nanowerk.com"}, "author": null, "title": "New dual-action coating keeps bacteria from cross-contaminating fresh produce - Nanowerk", "description": "Over the course of their journey from the open fields to the produce displays at grocery stores, fresh vegetables and fruits can sometimes become contaminated by microorganisms. These items can then spoil other produce, spreading the contamination further and…", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=54991.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id54991.jpg", "publishedAt": "2020-04-23T05:46:59Z", "content": null}, {"source": {"id": null, "name": "Pedestrian.tv"}, "author": "David Adams", "title": "Pack A Cone & Let NASA Show You What The Hubble Telescope Looked At On Your Birthday - Pedestrian TV", "description": "NASA has unveiled an unexpectedly moving site to celebrate the scope's 30th birthday.", "url": "http://www.pedestrian.tv/news/pack-cones-and-look-at-hubble/", "urlToImage": "https://www.pedestrian.tv/content/uploads/2020/04/23/nasa-scope.jpg", "publishedAt": "2020-04-23T04:31:23Z", "content": "Youre probably not going anywhere any time soon, for reasons which should be obvious to you by now.\r\nBut thanks to NASA and the Hubble Space Telescope, you can go back in time and visit the outer reaches of visible space. A welcome escape from the tyranny of … [+1163 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Jackson Ryan", "title": "NASA's incredible new moon map will serve as blueprint for human missions - CNET", "description": "Using decades of data, the USGS put together the most comprehensive geologic map of the moon yet.", "url": "https://www.cnet.com/news/nasas-incredible-new-moon-map-will-serve-as-blueprint-for-human-missions/", "urlToImage": "https://cnet2.cbsistatic.com/img/F3B96DzILzF3uwFW8jYoXvHnWDI=/756x567/2020/04/23/4f5bd153-08a7-4362-a7b3-322f48fd4a6c/moon1.png", "publishedAt": "2020-04-23T03:29:23Z", "content": "The most comprehensive geologic map of the moon ever. \r\nNASA/GSFC/USGS\r\nNASA is preparing for new missions to the moon, setting an ambitious goal for putting walkin', talkin' humans (including the first woman) back on the lunar surface by 2024. There's plenty… [+1659 chars]"}, {"source": {"id": null, "name": "Bignewsnetwork.com"}, "author": null, "title": "Galaxies grow fat on the flesh of their neighbours - Malaysia Sun", "description": "A new research led by Indian origin researcher Dr Anshu Gupta, has revealed that galaxies grow large by eating their smaller neighbours.", "url": "https://www.bignewsnetwork.com/news/264793517/galaxies-grow-fat-on-the-flesh-of-their-neighbours", "urlToImage": "https://cdn.bignewsnetwork.com/ani1587611886.jpg", "publishedAt": "2020-04-23T03:18:00Z", "content": "Sydney [Australia], April 23 (ANI): A new research led by Indian origin researcher Dr Anshu Gupta, has revealed that galaxies grow large by eating their smaller neighbours.\r\nExactly how massive galaxies attain their size is poorly understood, not least becaus… [+2563 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NASA captures Earth for more than 50 years - KCRA News", "description": "As the world celebrates 50 years of Earth Day, one agency has been processing information and images for all those decades to improve the planet. NASA has be...", "url": "https://www.youtube.com/watch?v=DedinBELMiA", "urlToImage": "https://i.ytimg.com/vi/DedinBELMiA/maxresdefault.jpg", "publishedAt": "2020-04-23T03:07:42Z", "content": "As the world celebrates 50 years of Earth Day, one agency has been processing information and images for all those decades to improve the planet. NASA has been taking Earth Day to heart every day over past the five decades. Get the full story in the video abo… [+233 chars]"}, {"source": {"id": null, "name": "Pattayamail.com"}, "author": "Pattaya Mail", "title": "The man who wanted to fly on Mars - Pattaya Mail", "description": "Even before this interviewer can finish the question, “Did anyone ever tell you this was a crazy idea?” Bob Balaram jumps in: “Everyone. All the time.” Loading… This “crazy idea” is the Mars Helicopter, currently at Kennedy Space Center waiting to hitch a rid…", "url": "https://www.pattayamail.com/pattayamail/the-man-who-wanted-to-fly-on-mars-296566", "urlToImage": "https://www.pattayamail.com/wp-content/uploads/2020/04/1376-tec-The-man-who-wanted-to-fly-on-Mars-1.jpg", "publishedAt": "2020-04-23T03:00:00Z", "content": "Mars Helicopters chief engineer Bob Balaram and the Mars Helicopter on a test stand. The technology demonstration will ride aboard NASAs Perseverance rover to the Red Planet. (Credits: NASA/JPL-Caltech)\r\nEven before this interviewer can finish the question, D… [+8457 chars]"}, {"source": {"id": null, "name": "Bigthink.com"}, "author": "Paul Ratner", "title": "New study deepens the controversy over Planet Nine's existence - Big Think", "description": "Astronomers release new data to challenge claims about the mysterious Planet Nine.", "url": "https://bigthink.com/surprising-science/planet-nine", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMzE1Njk4OS9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTYzMjk2NDc3NX0.8ZBmGQs-fnP1ZhMZBDMFQVSh75jwpsYRJfYRb39Xy_U/img.png?width=1200&coordinates=0%2C160%2C0%2C160&height=600", "publishedAt": "2020-04-23T02:51:58Z", "content": "Is there a mysterious Planet Nine hiding in the outskirts of our solar system? While there've been hypotheses making such claims, a new study looks to disprove its existence.\r\nThe research from astronomers at the University of Pennsylvania strikes at the hear… [+2241 chars]"}, {"source": {"id": null, "name": "China.org.cn"}, "author": "", "title": "Roundup: SpaceX rocket launches 60 internet satellites into space - China.org.cn", "description": null, "url": "http://www.china.org.cn/world/Off_the_Wire/2020-04/23/content_75965285.htm", "urlToImage": null, "publishedAt": "2020-04-22T23:32:05Z", "content": "WASHINGTON, April 22 (Xinhua) -- U.S. private space company SpaceX launched its seventh batch of 60 Starlink satellites into space on Wednesday.\r\nThe Falcon 9 rocket lifted off from Launch Complex 39A (LC-39A) at NASA's Kennedy Space Center in Florida at 3:30… [+1885 chars]"}, {"source": {"id": null, "name": "Midlandweekly.com"}, "author": "Cody Martinez", "title": "Scientists Say Substance Trapped in Nanobubbles Show Unusual Properties - The Midland Weekly", "description": "Skoltech scientists modeled the behavior of nanobubbles showing in van der Waals heterostructures and the behavior of drugs trapped inside the bubbles. Sooner or later, the new mannequin will help obt", "url": "http://midlandweekly.com/2020/04/15/scientists-say-substance-trapped-in-nanobubbles-show-unusual-properties/", "urlToImage": "http://midlandweekly.b-cdn.net/wp-content/uploads/2020/04/mid-1-2.jpg", "publishedAt": "2020-04-22T22:51:53Z", "content": "Skoltech scientists modeled the behavior of nanobubbles showing in van der Waals heterostructures and the behavior of drugs trapped inside the bubbles. Sooner or later, the new mannequin will help obtain equations of state for substances in nano-volumes, open… [+1371 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Close call: Asteroid 52768 is set to flyby next week - Micky News", "description": "Astronomers are already observing a giant \"potentially hazardous\" asteroid that is due to pass relatively close to Earth on April 29.", "url": "https://micky.com.au/close-call-asteroid-52768-is-set-to-flyby-next-week/", "urlToImage": "https://micky.com.au/wp-content/uploads/2020/04/download-19.jpg", "publishedAt": "2020-04-22T22:16:00Z", "content": "According to a report, both professional observatories and amateur astronomers have been seeing a big – nay, enormous – asteroid officially dubbed 52768 (1998 OR2) for less than a month now. \r\nAlready bright enough to be seen by simple telescopes on Earth, im… [+3224 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Amanda Kooser", "title": "See the cute coral babies giving scientists hope for reef restoration - CNET", "description": "Researchers at the Florida Aquarium see the coral-spawning breakthrough as a source of hope for \"America's great barrier reef.\"", "url": "https://www.cnet.com/news/see-the-cute-coral-babies-giving-scientists-hope-for-reef-restoration/", "urlToImage": "https://cnet2.cbsistatic.com/img/4X2T6z-QLGcDjbhx7aefxEVyCgc=/2020/04/22/d2b11627-46e2-4cd4-9c80-784ca82e3068/coral.jpg", "publishedAt": "2020-04-22T21:47:27Z", "content": "This images shows the ridged cactus coral next to a close-up of a larva.\r\nThe Florida Aquarium\r\nScientists at the Florida Aquarium are celebrating a special moment in coral reproduction. Earlier this month, they witnessed the first spawning of ridged cactus c… [+1261 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NASA Astronaut Chris Cassidy Commemorates the 50th Earth Day from the International Space Station - NASA", "description": "On the 50th anniversary of Earth Day, NASA astronaut Chris Cassidy of Expedition 63 reflects on what Earth Day means to him. This Earth Day, we can still col...", "url": "https://www.youtube.com/watch?v=f3c617j1hJQ", "urlToImage": "https://i.ytimg.com/vi/f3c617j1hJQ/maxresdefault.jpg", "publishedAt": "2020-04-22T20:36:01Z", "content": null}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Human vaccine trials begin! What happens next? - Coronacast - ABC News", "description": "Human trials for a coronavirus vaccine have begun in the UK, and it's all actions go. Depending on what happens there’s a long way to go before you might be innoculated. Usually the process could take years, but this isn’t your usual vaccine trial. On today's…", "url": "https://www.abc.net.au/radio/programs/coronacast/human-vaccine-trials-begin-what-happens-next/12174900", "urlToImage": "https://www.abc.net.au/cm/rimage/12027716-16x9-large.jpg?v=2", "publishedAt": "2020-04-22T20:14:02Z", "content": "Human trials for a coronavirus vaccine have begun in the UK, and it's all actions go.\r\nDepending on what happens theres a long way to go before you might be innoculated.\r\nUsually the process could take years, but this isnt your usual vaccine trial.\r\nCoronacas… [+423 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Genelle Weule", "title": "Count stars in the Southern Cross during Dark Sky Week and help measure light pollution around the world - ABC Science Online", "description": "If you count the stars in the Southern Cross tonight you will contribute to the worldwide effort to map light pollution during International Dark Sky Week.", "url": "https://www.abc.net.au/news/science/2020-04-23/count-stars-in-the-southern-cross-and-measure-light-pollution/12166374", "urlToImage": "https://www.abc.net.au/cm/rimage/12166330-16x9-large.jpg?v=2", "publishedAt": "2020-04-22T20:00:00Z", "content": "How many stars in the Southern Cross can you see from your backyard or balcony? \r\nIf you count them tonight you can contribute to a project that maps light pollution across the globe.\r\nThe idea is to get as many people around the world to look at the stars on… [+5317 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Ryan F. Mandelbaum", "title": "The Trouble With Stephen Wolfram's New 'Fundamental Theory Of Physics' - Gizmodo Australia", "description": "[image url='https://i.kinja-img.com/gawker-media/image/upload/t_original/rg7pdwonecaq7uusrpyf.jpg' size='xlarge' licence='Image: NASA' caption='A galaxy cluster containing one to two thousand galaxies. Composite image made by NASA’s Hubble, Spitzer and Chandr…", "url": "https://www.gizmodo.com.au/2020/04/the-trouble-with-stephen-wolframs-new-fundamental-theory-of-physics/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/rg7pdwonecaq7uusrpyf.jpg", "publishedAt": "2020-04-22T19:56:00Z", "content": "Stephen Wolfram, computer scientist, physicist, and CEO of software company Wolfram Research (behind Wolfram Alpha and Mathematica) made headlines this week when he launched the Wolfram Physics Project. The blog post announcing the project explains that he an… [+7147 chars]"}, {"source": {"id": null, "name": "China.org.cn"}, "author": "", "title": "New research shows plate tectonics on earth prior to 3.2 billion years ago - China.org.cn", "description": null, "url": "http://www.china.org.cn/world/Off_the_Wire/2020-04/23/content_75964966.htm", "urlToImage": null, "publishedAt": "2020-04-22T18:54:09Z", "content": "WASHINGTON, April 22 (Xinhua) -- A new research published on Wednesday indicates that plate tectonics may have been well underway on Earth more than 3.2 billion years ago.\r\nThe research added a new dimension to an ongoing debate about exactly when plate tecto… [+1190 chars]"}, {"source": {"id": null, "name": "Sciencemag.org"}, "author": null, "title": "Diamond microscope reveals slow crawl of Earth's ancient crust - Science Magazine", "description": "Quantum tool maps tiny magnetic fields preserved in rocks", "url": "https://www.sciencemag.org/news/2020/04/diamond-microscope-reveals-slow-crawl-earth-s-ancient-crust", "urlToImage": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/ca_0424NID_Quantum_Diamond_Microscope_online.jpg?itok=N6uBlz1N", "publishedAt": "2020-04-22T18:00:00Z", "content": "A quantum diamond microscope contains a doped diamond slide that is excited by tiny magnetic fields.\r\nHARVARD PALEOMAGNETICS LAB \r\nBy Paul VoosenApr. 22, 2020 , 2:00 PM\r\nOn a table inside the magnetically shielded lab of Roger Fu, a planetary scientist at Har… [+7376 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Expedition 63 ABC Earth Day with Chris Cassidy - April 22, 2020 - NASA Video", "description": "SPACE STATION COMMANDER DISCUSSES EARTH DAY ON ITS 50TH ANNIVERSARY Aboard the International Space Station, Expedition 63 Commander Chris Cassidy of NASA dis...", "url": "https://www.youtube.com/watch?v=jzCrMHoBmf4", "urlToImage": "https://i.ytimg.com/vi/jzCrMHoBmf4/maxresdefault.jpg", "publishedAt": "2020-04-22T17:29:49Z", "content": "SPACE STATION COMMANDER DISCUSSES EARTH DAY ON ITS 50TH ANNIVERSARY\r\nAboard the International Space Station, Expedition 63 Commander Chris Cassidy of NASA discussed the view of Earth from orbit and other issues related to the 50th anniversary of Earth Day dur… [+251 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Lyrid meteor shower 2020 will light up the sky amid COVID-19 pandemic - Micky News", "description": "The Lyrid is the oldest known meteor shower which dates back to 2700 years ago. The world’s best night sky show will peak tonight.", "url": "https://micky.com.au/lyrid-meteor-shower-2020-will-light-up-the-sky-amid-covid-19-pandemic/", "urlToImage": "https://micky.com.au/wp-content/uploads/2020/04/694940094001_5765589499001_5765570952001-vs1.jpg", "publishedAt": "2020-04-22T17:13:35Z", "content": "With governments imposing lockdowns all over the world, chances are people are getting really bored inside their homes. However, being stuck there for a little longer means getting the chance to witness the best light show on the planet.\r\nThe Lyrid meteor sho… [+2562 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Prehistoric Crocodiles Imitating Dolphins and Whales in the Ocean - Somag News", "description": "The extinct creature, Thalattosuchia, has adapted its body into an aerodynamic shape and developed an inner ear to adapt to marine life. Thalattosuchia, which lived from the Early Jurassic to the Early Cretaceous, are also known as sea crocodiles. It has been…", "url": "https://www.somagnews.com/prehistoric-crocodiles-imitating-dolphins-whales-ocean/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2020/04/10-21-e1587574470996.jpg", "publishedAt": "2020-04-22T16:54:00Z", "content": "The extinct creature, Thalattosuchia, has adapted its body into an aerodynamic shape and developed an inner ear to adapt to marine life. Thalattosuchia, which lived from the Early Jurassic to the Early Cretaceous, are also known as sea crocodiles.\r\nIt has bee… [+2337 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Researchers Use Electrostatic Charge to Assemble Particles into Materials Mimicking Gemstones and Salt Crystals - Mirage News", "description": "Process Offers a Simple and Scalable Approach to Particle Self-Assembly ...", "url": "https://www.miragenews.com/researchers-use-electrostatic-charge-to-assemble-particles-into-materials-mimicking-gemstones-and-salt-crystals/", "urlToImage": "https://www.nyu.edu/content/nyu/en/about/news-publications/news/2020/april/materials-mimicking-gemstones-and-salt/jcr:content/page/image.img.320.medium.png/1587568352023.png", "publishedAt": "2020-04-22T15:34:12Z", "content": "Using just electrostatic charge, common microparticles can spontaneously organize themselves into highly ordered crystalline materials-the equivalent of table salt or opals, according to a new study led by New York University chemists and published in Nature.… [+3294 chars]"}, {"source": {"id": null, "name": "Sciencemag.org"}, "author": null, "title": "The Neanderthal DNA you carry may have surprisingly little impact on your looks, moods - Science Magazine", "description": "Icelanders can’t blame Neanderthals for their red hair and freckles, new study says", "url": "https://www.sciencemag.org/news/2020/04/neanderthal-dna-you-carry-may-have-surprisingly-little-impact-your-looks-moods", "urlToImage": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/redhair_1280p.jpg?itok=3KoY0nXc", "publishedAt": "2020-04-22T15:20:00Z", "content": "Icelanders didnt get their freckles and occasional red hair from Neanderthal ancestors.\r\nPhotoAlto / Alamy Stock Photo \r\nBy Ann GibbonsApr. 22, 2020 , 11:20 AM\r\nIf you think you got your freckles, red hair, or even narcolepsy from a Neanderthal in your family… [+3841 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Edmund Heaphy", "title": "The UK coronavirus lockdown has made people more likely to buy a car - Yahoo Finance", "description": "More than half of UK driving licence holders who don’t currently own a vehicle are now considering purchasing one, according to a new survey.", "url": "https://finance.yahoo.com/news/the-uk-coronavirus-lockdown-has-made-people-more-likely-to-buy-a-car-144643631.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/uKew5vNhe7FpBNTexMlxRg--~B/aD00MDE2O3c9NjAxNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-04/4ed43250-849e-11ea-bcb9-de2945a2aa89", "publishedAt": "2020-04-22T14:46:00Z", "content": "The coronavirus lockdown has made people in the UK more likely to buy a car once restrictions are lifted, according to a new survey.\r\nOnline car marketplace Autotrader found that 56% of UK driving licence holders who dont currently own a vehicle were now cons… [+1794 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Callum Hoare", "title": "Einstein wrong? Why scientist was stunned by 'big mistake' over universe 'ripping apart' - Express.co.uk", "description": "ALBERT EINSTEIN put forward the theory of the cosmological constant more than a century ago - but a more recent discovery, which one scientist thought was 'a big mistake,' implied the genius may have been right all along.", "url": "https://www.express.co.uk/news/science/1272400/albert-einstein-wrong-dark-energy-universe-cosmological-constant-brian-cox-space-spt", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1272400.jpg", "publishedAt": "2020-04-22T13:03:00Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Callum Hoare", "title": "‘Marked man for rest of my life’ Michael Collins’ Moon landing confession revealed - Express.co.uk", "description": "MICHAEL COLLINS admitted he would be a 'marked man' for the rest of his life, after a candid confession over his role in the Apollo 11 Moon landings.", "url": "https://www.express.co.uk/news/science/1272324/moon-landing-michael-collins-apollo-11-nasa-buzz-aldrin-neil-armstrong-confession-spt", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1272324.jpg", "publishedAt": "2020-04-22T11:39:00Z", "content": null}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Rada Mateescu", "title": "“New Earth” Is Discovered After Experts Dug Through Data That A.I. Missed - Dual Dove", "description": "Back in October 2018, NASA’s Kepler space telescope ran out of fuel – this was happening nine years after surveying the wider cosmos, while searching for alien worlds. During the missio…", "url": "https://www.dualdove.com/new-earth-is-discovered-after-experts-dug-through-data-that-a-i-missed/9642/", "urlToImage": "https://www.dualdove.com/wp-content/uploads/2020/04/unnamed-1-1.jpg", "publishedAt": "2020-04-22T09:24:03Z", "content": "Back in October 2018, NASA’s Kepler space telescope ran out of fuel – this was happening nine years after surveying the wider cosmos, while searching for alien worlds.\r\nDuring the mission, Kepler discovered more than 2,600 weird and exciting exoplanets.\r\nAbou… [+2068 chars]"}, {"source": {"id": null, "name": "Todayonline.com"}, "author": null, "title": "'Cloud brightening' experiment may help cool Great Barrier Reef - TODAYonline", "description": "LONDON - Researchers trying to save the Great Barrier Reef are attempting to cool the unusually warm sea temperatures using ‘cloud brightening’, a geo-engineering technique designed to reflect more of the sun’s rays away from the Earth.", "url": "https://www.todayonline.com/world/cloud-brightening-experiment-may-help-cool-great-barrier-reef", "urlToImage": "https://www.todayonline.com/sites/default/files/styles/new_app_article_detail/public/photos/43_images/2020-04-22T080421Z_1_LYNXNPEG3L0JZ_RTROPTP_4_AUSTRALIA-REEF.JPG?itok=CL35zwDE", "publishedAt": "2020-04-22T08:30:25Z", "content": null}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Michelle Starr", "title": "The Composition of Interstellar Comet 2I/Borisov Is Much More Alien Than We Thought - ScienceAlert", "description": "When the first known comet from interstellar space was spotted traversing the Solar System in late August of last year, astronomers snapped to attention. 2I/Borisov was an extraordinarily rare opportunity to study the formation of comets around other", "url": "https://www.sciencealert.com/turns-out-interstellar-comet-2i-borisov-is-much-more-alien-than-we-thought", "urlToImage": "https://www.sciencealert.com/images/2020-04/processed/artist-borisov_1024.jpg", "publishedAt": "2020-04-22T07:01:13Z", "content": "When the first known comet from interstellar space was spotted traversing the Solar System in late August of last year, astronomers snapped to attention. 2I/Borisov was an extraordinarily rare opportunity to study the formation of comets around other stars.\r\n… [+4936 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Brianne Tolj", "title": "Where you can watch the Lyrid meteor shower in Australia - Yahoo News Australia", "description": "From midnight on Wednesday, about a dozen meteors and shooting stars will shoot across the sky every hour.", "url": "https://au.news.yahoo.com/where-watch-lyrid-meteor-shower-australia-065357772.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/VG0ND4vj_bnfUkEvFh85rw--~B/aD01NDk7dz05NzY7c209MTthcHBpZD15dGFjaHlvbg--/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-04/1e1d7590-8462-11ea-9e7d-bd3912848117", "publishedAt": "2020-04-22T06:56:09Z", "content": "Some Australians bored during the coronavirus lockdown will be able to admire the Lyrid meteor shower tonight.\r\nFrom midnight, about a dozen meteors and shooting stars will shoot across the sky every hour, according to astrophysicist Dr Brad Tucker from the A… [+1606 chars]"}, {"source": {"id": null, "name": "Digitalcameraworld.com"}, "author": "Chris George", "title": "Why #Earthrise? The iconic photograph behind Earth Day's hashtag - Digital Camera World", "description": "The story of William Anders' iconic Earthrise image, which helped to spur Earth Day and the environmental movement", "url": "https://www.digitalcameraworld.com/news/why-earthrise-the-iconic-photograph-behind-earth-days-hashtag", "urlToImage": "https://cdn.mos.cms.futurecdn.net/YzTF6UhDyhVGuL9qJrUFB5-1200-80.jpg", "publishedAt": "2020-04-22T06:03:00Z", "content": "Earth Day celebrates its 50th birthday today. Since 1970, April 22 has become a day to reflect on the environment, and for people to share their concerns for the planet. Founded by a US senator, Earth Day has grown into a global phenomenon  and this year, bec… [+1921 chars]"}, {"source": {"id": null, "name": "Syfy.com"}, "author": "Jeff Spry", "title": "Saturn's massive moon Titan may generate swarms of dust-fueled twisters - SYFY WIRE", "description": "Does Saturn's largest moon contain swarms of dry whirlwinds similar to Earth and Mars? There's a devil of a chance! Buzzing out of Earth's atmosphere in 2026 and onward to the gas giant Saturn, NASA's Dragonfly mission to the moon of Titan will attempt to doc…", "url": "https://www.syfy.com/syfywire/saturn-moon-titan-may-generate-dust-fueled-twisters", "urlToImage": "https://www.syfy.com/sites/syfy/files/styles/1200x680/public/2020/04/titan-hero.jpg", "publishedAt": "2020-04-22T02:49:41Z", "content": "Does Saturn's largest moon contain swarms of dry whirlwinds similar to Earth and Mars? There's a devil of a chance!\r\nBuzzing out of Earth's atmosphere in 2026 and onward to the gas giant Saturn, NASA's Dragonfly mission to the moon of Titan will attempt to do… [+2285 chars]"}, {"source": {"id": null, "name": "Africanews.space"}, "author": "Space in Africa", "title": "Insight Into The USD 23M Africa Millimeter Telescope Being Built In Namibia. - Space in Africa", "description": "Africa has a good history of Astronomy and is currently engaged in mega astronomy projects such as the Square Kilometre Array (SKA)– which is about building the world’s largest radio telescope and the African Very Long Baseline Interferometry (AVN), the lates…", "url": "https://africanews.space/insight-into-the-usd-23m-africa-millimeter-telescope-being-built-in-namibia/", "urlToImage": "https://africanews.space/wp-content/uploads/2020/04/beletsky_lasilla_28.jpg", "publishedAt": "2020-04-21T23:15:54Z", "content": "Africa has a good history of Astronomy and is currently engaged in mega astronomy projects such as the Square Kilometre Array (SKA)– which is about building the worlds largest radio telescope and the African Very Long Baseline Interferometry (AVN), the latest… [+4411 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "George Dvorsky", "title": "Vanishing Exoplanet Might Actually Be The Aftermath Of A 'Supercatastrophic' Collision - Gizmodo Australia", "description": "A known exoplanet has disappeared from sight, prompting speculation among astronomers that it was never a planet in the first place and is instead the shattered remnants of a celestial smash-up....", "url": "https://www.gizmodo.com.au/2020/04/vanishing-exoplanet-might-actually-be-the-aftermath-of-a-supercatastrophic-collision/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/v2mnodgisiabhokys2rb.jpg", "publishedAt": "2020-04-21T23:15:00Z", "content": "A known exoplanet has disappeared from sight, prompting speculation among astronomers that it was never a planet in the first place and is instead the shattered remnants of a celestial smash-up.\r\nNow you see it, now you dont. \r\nA nearby exoplanet known as Fom… [+3995 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jonathan Chadwick For Mailonline", "title": "Deadly prehistoric crocodiles mimicked whales and dolphins - Daily Mail", "description": "Ancient giant crocodiles called thalattosuchians evolved into terrifying ocean predators that mimicked the senses of whales and dolphins, according to new research in Scotland.", "url": "https://www.dailymail.co.uk/sciencetech/article-8241985/Deadly-prehistoric-crocodiles-mimicked-whales-dolphins.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/04/21/19/27474684-0-image-a-86_1587492224015.jpg", "publishedAt": "2020-04-21T20:58:36Z", "content": "Deadly prehistoric crocodiles mimicked the anatomy of dolphins and whales to dominate Jurassic seas 170 million years ago, new research shows. \r\nScottish researchers say the extinct crocs, called thalattosuchians, evolved from their land-roaming ancestors to … [+5540 chars]"}, {"source": {"id": null, "name": "Nasa.gov"}, "author": "Grey Hautaluoma / Alana Johnson", "title": "How NASA's Perseverance Mars Team Has Adjusted to Work in the Time of Coronavirus - Jet Propulsion Laboratory", "description": "Like much of the rest of the world, the Mars rover team is pushing forward with its mission-critical work while putting the health and safety of their colleagues and community first.", "url": "https://www.jpl.nasa.gov/news/news.php?feature=7645", "urlToImage": "https://www.jpl.nasa.gov/images/mars2020/20200421/PIA23881-16.jpg", "publishedAt": "2020-04-21T20:28:20Z", "content": "Like much of the rest of the world, the Mars rover team is pushing forward with its mission-critical work while putting the health and safety of their colleagues and community first.\r\nFrom the moment the mission began in 2013, the women and\r\nmen working on wh… [+9980 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Stacy Liberatore For Dailymail.com", "title": "Vibrations from black holes colliding harmonize with Elvis Presley's 'I Can't Help Falling in Love' - Daily Mail", "description": "A collision of two black holes was detected 2.4 billion light-years away that produced gravitational waves, which matched the C and G notes of Elvis Presley's hit 'I Can't Help Falling in Love with You.'", "url": "https://www.dailymail.co.uk/sciencetech/article-8242377/Vibrations-black-holes-colliding-harmonize-Elvis-Presleys-Help-Falling-Love.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/04/21/20/27477536-0-image-a-30_1587498516558.jpg", "publishedAt": "2020-04-21T20:28:16Z", "content": "Vibrations captured from a collision of two black holes in deep space harmonizes with the first notes of Elvis Presley's hit 'I Can't Help Falling in Love with You.'\r\nResearchers found the source of the gravitational waves stems from the most exotic merger of… [+5194 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Weak winds in the Pacific drove record-breaking 2019 summertime marine heat wave - Phys.org", "description": "Weakened wind patterns likely spurred the wave of extreme ocean heat that swept the North Pacific last summer, according to new research led by the University of Colorado Boulder and the Scripps Institution of Oceanography at the University of California San …", "url": "https://phys.org/news/2020-04-weak-pacific-drove-record-breaking-summertime.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/howtheblobca.jpg", "publishedAt": "2020-04-21T20:14:17Z", "content": "Weakened wind patterns likely spurred the wave of extreme ocean heat that swept the North Pacific last summer, according to new research led by the University of Colorado Boulder and the Scripps Institution of Oceanography at the University of California San … [+3804 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Nick Kilvert", "title": "Australia's threatened mammals decline by more than a third since 1990s, but there's a silver lining - ABC News", "description": "The most comprehensive index to date of Australia's mammals shows that threatened mammal species have declined by more than a third on average between 1995 and 2016, but that targeted conservation efforts have proven overwhelmingly successful.", "url": "https://www.abc.net.au/news/science/2020-04-22/native-mammals-decline-over-one-third/12163838", "urlToImage": "https://www.abc.net.au/cm/rimage/12164456-16x9-large.jpg?v=2", "publishedAt": "2020-04-21T19:38:51Z", "content": "Many threatened Australian mammals suffered significant population decline between 1995 and 2016, according to a new mammal database launched today.\r\nKey points mammals\r\nKey points:\r\n<ul><li>The most comprehensive mammal database to date shows significant dec… [+4751 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Devin Coldewey", "title": "NASA may start using private suborbital flights to train astronauts - Yahoo Finance Australia", "description": "NASA  is hoping to better prepare its crews for the challenges of space by sending them on suborbital flights from the likes of Virgin Galactic and Blue Origin — suggesting a potentially huge new market for the nascent private spaceflight industry.  Speaking …", "url": "https://au.finance.yahoo.com/news/nasa-may-start-using-private-190949640.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/5Q82.tpFKh5Xwr.N6QtBYQ--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/techcrunch_350/b39c0bbbaaa2f7a61b52bec54abca531", "publishedAt": "2020-04-21T19:09:00Z", "content": "Astronauts may make a second home of space, but even they have a first time going up. NASA is hoping to better prepare its crews for the challenges of space by sending them on suborbital flights from the likes of Virgin Galactic and Blue Origin suggesting a p… [+3517 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Glaucoma could be successfully treated with gene therapy - Science Daily", "description": "A new study has shown a common eye condition, glaucoma, could be successfully treated with a single injection using gene therapy, which would improve treatment options, effectiveness and quality of life for many patients.", "url": "https://www.sciencedaily.com/releases/2020/04/200421112608.htm", "urlToImage": null, "publishedAt": "2020-04-21T18:27:43Z", "content": "A new study led by the University of Bristol has shown a common eye condition, glaucoma, could be successfully treated with a single injection using gene therapy, which would improve treatment options, effectiveness and quality of life for many patients.Glauc… [+1766 chars]"}, {"source": {"id": null, "name": "Techxplore.com"}, "author": "Science X staff", "title": "'Nanocardboard' flyers could serve as martian atmospheric probes - Tech Xplore", "description": "This summer, NASA plans to launch its next Mars rover, Perseverance, which will carry with it the first aircraft to ever fly on another planet, the Mars Helicopter. As the first of its kind, the Mars Helicopter will carry no instruments and collect no data—NA…", "url": "https://techxplore.com/news/2020-04-nanocardboard-flyers-martian-atmospheric-probes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/pennengineer.jpg", "publishedAt": "2020-04-21T18:26:32Z", "content": "This summer, NASA plans to launch its next Mars rover, Perseverance, which will carry with it the first aircraft to ever fly on another planet, the Mars Helicopter. As the first of its kind, the Mars Helicopter will carry no instruments and collect no dataNAS… [+5340 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Studying our galaxy's 'water worlds' - Science Daily", "description": "In seeking to learn more about Neptune-like exoplanets, an international team of researchers has provided one of the first mineralogy lab studies for water-rich exoplanets.", "url": "https://www.sciencedaily.com/releases/2020/04/200421134418.htm", "urlToImage": null, "publishedAt": "2020-04-21T18:13:15Z", "content": "Astrophysical observations have shown that Neptune-like water-rich exoplanets are common in our galaxy. These \"water worlds\" are believed to be covered with a thick layer of water, hundreds to thousands of miles deep, above a rocky mantle.While water-rich exo… [+2645 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Untapped potential: More US labs could be providing tests for coronavirus - Nature.com", "description": "An online survey reveals bottlenecks and challenges and barriers faced by more than 1,700 biology labs.", "url": "https://www.nature.com/articles/d41586-020-01154-6", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-020-01154-6/d41586-020-01154-6_17914176.jpg", "publishedAt": "2020-04-21T16:43:52Z", "content": "A lab scientist runs a clinical test at University of Washington Medicine in Seattle.Credit: Karen Ducey/Getty\r\nA survey of more than 4,000 researchers in the United States suggests that better coordination at an institutional and national level could make hu… [+2573 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Rotating Galaxies Galore - Mirage News", "description": "New results from an ambitious sky survey program, called ALPINE, reveal that rotating disk-shaped galaxies may have existed in large numbers earlier in...", "url": "https://www.miragenews.com/rotating-galaxies-galore/", "urlToImage": "https://web-prod-storage.s3.amazonaws.com/main.oscweb.caltech.edu/images/ALMA-Catalog-ALPINE-Carousel.2e16d0ba.fill-1600x810-c100.jpg?AWSAccessKeyId=ASIAYTIWNLHDS5XHAM6L&Signature=MmFPnFtXZpldaeoFQGIRwHjc5DI%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEAUaCXVzLXdlc3QtMiJHMEUCIBVcO735cNVued5XgJUay%2B2FE3oehVlc2tFd9JZqN7mcAiEAmaH5zSp66txLsJRjgWNuFx%2FLmtd4E7VGf5lX6%2FOqoTQq6wMILhABGgw1OTExNDE4ODY0MDciDM2uyicxCsScdEqe8CrIA6ikN%2BfiSsoJK1OP%2BMli2CN731qzSK5i28CUUZuqUcb9W1YOcgSh%2Bx%2BcW5kQ0nDHpORUJ3WZED1rLuVOiXMdLwZ0ltf%2BAploSHnDW7vEVtoqfN6RI6XF49auvhvAbZ0OqmRDutJUA5EQMNU6hcPFnPhUnuu55SCoJYvDxBcgF4yWDyRDNqVFmSaGmrGrxkGkUFTAJvyPQIS%2BCp%2Fyere1aKi0e4%2BfN%2FR4VxgkFMHwHvkRHGXDAm8hP5xzfU8YDZmiIQWC5dL3e9YxdzOwuYGCMK1tYAEshvXxLgcmahtsZ%2BHWjZUT8Eo1R5EeOtc871pvkvViEYVYGJEdeBIM7Wdth%2Fk1wugJqBzMCOIWoqgGM5CMsc0viHJUmNsFnHzWkTIDRWr3MteZHdG0Q4c%2BaaP77gACCmxdTxpDTC5PM57dInHdnt%2FySmO9CJdMbI3KHxeLYdQ0jZHTHCXr%2FQ3r9bTxg03BKd%2BAc2ue2D8SES2bPTJ0S%2FJkN%2BvaUdaPqV0SPojl7%2BDN%2FTRIOP7yX8rDDkLSbWX8BOAdNol9fivEahEl7IqBv%2FmKDkNLwcm773aNIc3yUdtSDy%2FNUKEtyO0f3UgFWFfw5jA%2FT4XwUTD61%2Fv0BTrvAa7yubE23RVkNZnEIaRGCIaZP5mx8LbTsX9mtTShVzK18Tf%2BuIqWQn1I9CxSBXtzJ%2Bi6CwuM2ZCz3Yg0yPkS%2BqLW%2FBTNpBIzFi3C4x3IhuC%2FXcX%2FTsw601YQUKxNnpkM8BOlH%2BI8zW2%2BnwXuFkDQswkdBYH2XDC8wjrL8RLxUMccjamgqPQZH0p2T0DWKgZm0l%2FtG0%2BzOjUZduYZzQwjU6FMEXML8meV2c73Y%2F0%2BQTk%2BbdRDf5ljFuO0evX7dSJ%2F%2BlMB3EWHaq%2BBseLI%2BqMuPD081FkMpaRm9bObLNxckvi1DgKMc6Lzh%2F3DSrGCgcmx&Expires=1587490241", "publishedAt": "2020-04-21T16:32:12Z", "content": "New results from an ambitious sky survey program, called ALPINE, reveal that rotating disk-shaped galaxies may have existed in large numbers earlier in the universe than previously thought.\r\nThe ALPINE program, formally named “ALMA Large Program to Investigat… [+3493 chars]"}, {"source": {"id": null, "name": "Deseret.com"}, "author": "Freddie Crowder", "title": "Previous The colour purple and how individuals are 'connected to the universe' - Mash Viral", "description": "Editor’s note: A variation of this has been formerly published on the author’s internet site. As Joni Mitchell sang 50 many years in the past, “We are stardust.” Members and company of the Utah Astronomy Club figured out that anew, and read about the near con…", "url": "https://www.deseret.com/utah/2020/4/21/21197824/joe-bauman-color-red-connected-universe-seth-jarvis-utah-astronomy-club-red-giants-supergiant-sun", "urlToImage": "https://mashviral.com/wp-content/uploads/2020/04/The-colour-purple-and-how-individuals-are-‘connected-to-the.jpg", "publishedAt": "2020-04-21T16:01:01Z", "content": "Editors note: A variation of this has been formerly published on the authors internet site.\r\nAs Joni Mitchell sang 50 many years in the past, We are stardust.\r\nMembers and company of the Utah Astronomy Club figured out that anew, and read about the near conne… [+8072 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Kepler 1649c - New Earth-Size Planet in the Habitable Zone - SETI Institute", "description": "In a new paper published in the Astrophysical Journal Letters, co-authored by SETI Institute scientist Jeff Coughlin, astronomers using Kepler data have iden...", "url": "https://www.youtube.com/watch?v=TdxrOD0KCOc", "urlToImage": "https://i.ytimg.com/vi/TdxrOD0KCOc/maxresdefault.jpg", "publishedAt": "2020-04-21T16:00:15Z", "content": null}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Got Seasonal Allergies? Beetles Could Help - Mirage News", "description": "It's time once again for the misery familiar to millions of people around the world: seasonal allergy season. But there may be hope, courtesy of a tiny...", "url": "https://www.miragenews.com/got-seasonal-allergies-beetles-could-help/", "urlToImage": "https://today.uconn.edu/wp-content/uploads/2020/04/GettyImages-1172708125-630x420.jpg", "publishedAt": "2020-04-21T15:31:22Z", "content": "It’s time once again for the misery familiar to millions of people around the world: seasonal allergy season. But there may be hope, courtesy of a tiny critter with a big appetite: a new study published in Nature Communications suggests that a species of beet… [+4905 chars]"}, {"source": {"id": null, "name": "News-medical.net"}, "author": null, "title": "Atmospheric CO2 levels can cause cognitive impairment - News-Medical.Net", "description": "As the 21st century progresses, rising atmospheric carbon dioxide (CO2) concentrations will cause urban and indoor levels of the gas to increase, and that may significantly reduce our basic decision-making ability and complex strategic thinking, according to …", "url": "https://www.news-medical.net/news/20200421/Atmospheric-CO2-levels-can-cause-cognitive-impairment.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2fAnxiety-620x480.jpg", "publishedAt": "2020-04-21T15:07:58Z", "content": "As the 21st century progresses, rising atmospheric carbon dioxide (CO2) concentrations will cause urban and indoor levels of the gas to increase, and that may significantly reduce our basic decision-making ability and complex strategic thinking, according to … [+4554 chars]"}, {"source": {"id": null, "name": "Physicsworld.com"}, "author": null, "title": "Hubble's best shots: The Antennae Galaxies - physicsworld.com", "description": "\"A titanic maelstrom of stars\" is next on Keith Cooper's list of the greatest images taken by the Hubble Space Telescope during three decades of operations", "url": "https://physicsworld.com/a/hubbles-best-shots-the-antennae-galaxies/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2020/04/Antennae-Galaxies.jpg", "publishedAt": "2020-04-21T15:04:31Z", "content": "The Hubble Space Telescope was launched on 24 April 1990. To celebrate its 30th anniversary in space, Physics World is publishing a series of blog posts exploring Hubbles 10 best images, as chosen by the science journalist and editor Keith Cooper\r\nDeadly embr… [+1557 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Sebastian Kettley", "title": "Asteroid video: Astronomer films the 4KM Asteroid OR2 due to pass Earth this month - Express.co.uk", "description": "AN ASTEROID nearly half-as-tall as Mount Everest was filmed flying through space at speeds of more than 19,000mph (30,577kmh).", "url": "https://www.express.co.uk/news/science/1271923/Asteroid-news-4KM-asteroid-OR2-video-NASA-NEO-close-approach", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1271923.jpg", "publishedAt": "2020-04-21T14:58:00Z", "content": null}, {"source": {"id": null, "name": "Zdnet.com"}, "author": "Asha Barbaschow", "title": "University of Sydney using cloud to prevent the Tasmanian devil from extinction - ZDNet", "description": "What was previously a laborious and resource intensive process is now sped up thanks to the processing capability of the AWS cloud.", "url": "https://www.zdnet.com/article/university-of-sydney-using-cloud-to-prevent-the-tasmanian-devil-from-extinction/", "urlToImage": "https://zdnet2.cbsistatic.com/hub/i/r/2020/04/21/48bbdcc6-5e56-4258-ae38-06e70e4323df/thumbnail/770x578/f93bc32833943bea53c38ee5872d8828/tasmanian-devil.jpg", "publishedAt": "2020-04-21T14:01:00Z", "content": "Image: Dr Carolyn Hogg/University of Sydney \r\nThe University of Sydney (USyd) is hoping to save a range of threatened species in Australia, turning to the computing power of Amazon Web Services (AWS) to accelerate genomics research to prevent the Tasmanian de… [+3927 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Melting of the Eurasian Ice Plate, Raised Sea Level by 8 Meters - Somag News", "description": "A new study highlighting the risks associated with melting glaciers revealed that the global sea level rose about eight meters, as the Eurasian ice sheet melted about 14,000 years ago. The world, 4.6 billion years old, experienced five major ice ages during t…", "url": "https://www.somagnews.com/melting-eurasian-ice-plate-raised-sea-level-8-meters/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2020/04/7-19-e1587476465246.jpg", "publishedAt": "2020-04-21T13:41:00Z", "content": "A new study highlighting the risks associated with melting glaciers revealed that the global sea level rose about eight meters, as the Eurasian ice sheet melted about 14,000 years ago.\r\nThe world, 4.6 billion years old, experienced five major ice ages during … [+2508 chars]"}, {"source": {"id": null, "name": "Tass.com"}, "author": "TASS", "title": "ISS crew evacuated from Soyuz-MS15 on landing - TASS", "description": "The crew has returned to Earth due to the novel coronavirus pandemic", "url": "https://tass.com/science/1146089", "urlToImage": "https://phototass1.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20200417/1263015.jpg", "publishedAt": "2020-04-17T06:20:00Z", "content": "MOSCOW, April 17. /TASS/. Roscosmos cosmonaut Oleg Skripochka and NASA astronauts Andrew Morgan and Jessica Meir have been evacuated from the Soyuz MS-15 manned spacecraft, which landed earlier in Kazakhstan, 147 km to the southeast of the city of Zhezqazghan… [+657 chars]"}, {"source": {"id": null, "name": "Hit.com.au"}, "author": "Hit News Team", "title": "A Pink Super Moon Will Cover Australia Tonight! - Hit 107", "description": "We may be confined to our homes right now, but you know what is still here to amaze us: the night’s sky!", "url": "https://www.hit.com.au/story/a-pink-super-moon-will-cover-australia-this-april-152954", "urlToImage": "https://cdn-img.scalabs.com.au/2WCevWsT5QzTGyNQdK5YiSsxyUN7wg6r4xmmgDCNV9g/aHR0cHM6Ly9zdy1o/aXQtcHJkLnNjYWRp/Z2l0YWwuaW8vbWVk/aWEvMzc2MTkvYmxv/b2QtbW9vbi1waXhh/YmF5LmpwZz9wcmVz/ZXQ9bXJwcmV2YXJ0/aWNsZQ", "publishedAt": "2020-04-03T05:48:52Z", "content": "We may be confined to our homes right now, but you know what is still here to amaze us: the nights sky!\r\nLucky for us, this April 8th marks the phenomenon of a Pink Super Moon!\r\nThe moon will classify as a Super Moon as it will be full on the same day as it w… [+1110 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "SpaceX Steps Toward Crewed Flights in Successful Test | Musk - IndustryWeek", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMifGh0dHBzOi8vd3d3LmluZHVzdHJ5d2Vlay5jb20vdGVjaG5vbG9neS1hbmQtaWlvdC9hcnRpY2xlLzIxMTIwODg2L3NwYWNleC1zdGVwcy10b3dhcmQtY3Jld2VkLWZsaWdodHMtaW4tc3VjY2Vzc2Z1bC10ZXN0LW11c2vSAQA?oc=5", "urlToImage": null, "publishedAt": "2020-01-20T11:42:55Z", "content": null}, {"source": {"id": null, "name": "Inverse.com"}, "author": "Mike Brown", "title": "How SpaceX Starlink works: price, launch date for Elon Musk's internet - Inverse", "description": "Connecting to Starlink will be really easy, Elon Musk says", "url": "https://www.inverse.com/article/62185-here-s-how-you-will-connect-to-starlink-spacex-s-internet-constellation", "urlToImage": "https://imgix.bustle.com/inverse/0b/2a/1a/cb/ca4f/4ffa/9d45/508ac403b900/a-spacex-starlink-satellite-unfolding.png?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "publishedAt": "2020-01-08T19:50:11Z", "content": "Starlink, SpaceXs internet connectivity satellite constellation, is taking form. The project is designed to offer higher speeds and lower latency than competing setups, so long as the receiver can see the satellites in orbit. It could help fund some of CEO El… [+4593 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "SpaceX Attempts 'Big Bang' Military Mission With Massive Rocket - IndustryWeek", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMidmh0dHBzOi8vd3d3LmluZHVzdHJ5d2Vlay5jb20vbGVhZGVyc2hpcC9hcnRpY2xlLzIyMDI3ODAzL3NwYWNleC1hdHRlbXB0cy1iaWctYmFuZy1taWxpdGFyeS1taXNzaW9uLXdpdGgtbWFzc2l2ZS1yb2NrZXTSAQA?oc=5", "urlToImage": null, "publishedAt": "2019-12-17T00:04:58Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "SpaceX Poised to Be First with Astronaut Flights, Beating Boeing - IndustryWeek", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMijQFodHRwczovL3d3dy5pbmR1c3RyeXdlZWsuY29tL2xlYWRlcnNoaXAvY29tcGFuaWVzLWV4ZWN1dGl2ZXMvYXJ0aWNsZS8yMjAyNjA5OS9zcGFjZXgtcG9pc2VkLXRvLWJlLWZpcnN0LXdpdGgtYXN0cm9uYXV0LWZsaWdodHMtYmVhdGluZy1ib2VpbmfSAQA?oc=5", "urlToImage": null, "publishedAt": "2019-12-16T19:21:35Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "NASA Picks Nine Companies for $2.6 Billion Moon Payload Program - IndustryWeek", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMif2h0dHBzOi8vd3d3LmluZHVzdHJ5d2Vlay5jb20vdGVjaG5vbG9neS1hbmQtaWlvdC9hcnRpY2xlLzIyMDI2NzU5L25hc2EtcGlja3MtbmluZS1jb21wYW5pZXMtZm9yLTI2LWJpbGxpb24tbW9vbi1wYXlsb2FkLXByb2dyYW3SAQA?oc=5", "urlToImage": null, "publishedAt": "2019-12-16T00:20:53Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Lockheed Wins $4.6 Billion NASA Contract for Orion Spacecraft - IndustryWeek", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMifWh0dHBzOi8vd3d3LmluZHVzdHJ5d2Vlay5jb20vdGVjaG5vbG9neS1hbmQtaWlvdC9hcnRpY2xlLzIyMDI4Mjg2L2xvY2toZWVkLXdpbnMtNDYtYmlsbGlvbi1uYXNhLWNvbnRyYWN0LWZvci1vcmlvbi1zcGFjZWNyYWZ00gEA?oc=5", "urlToImage": null, "publishedAt": "2019-12-13T20:08:22Z", "content": null}]}