{"status": "ok", "totalResults": 68, "articles": [{"source": {"id": null, "name": "Itechpost.com"}, "author": "iTech Post", "title": "SpaceX's Crew Dragon 2 Mission: Astronauts Sent To ISS Aboard Elon Musk's Falcon 9 Spacecraft - iTech Post", "description": "The company is to conduct the Demo-2 launch as a precursor to regular and continuous flights to the International Space Station.", "url": "http://www.itechpost.com/articles/102446/20200426/spacex-crew-dragon-2-mission-astronauts-sent-iss-aboard-elon-musk.htm", "urlToImage": null, "publishedAt": "2020-04-27T01:58:00Z", "content": "SpaceX's Crew Dragon 2 Mission: Astronauts Sent To ISS Aboard Elon Musk's Falcon 9 Spacecraft\r\nSpaceX's Dragon mission is arranged to launch its first set of astronauts to the International Space Station (ISS). The launch is planned to launch on May 27 and ma… [+2997 chars]"}, {"source": {"id": null, "name": "Ntd.com"}, "author": null, "title": "Astronomers Find ‘Alien’ Asteroids Living in Our Solar System - NTD", "description": "Scientists In the last few years have studied the first observed interstellar visitors to our solar system. They ...", "url": "https://www.ntd.com/astronomers-find-alien-asteroids-living-in-our-solar-system_459760.html", "urlToImage": null, "publishedAt": "2020-04-27T01:28:55Z", "content": "Scientists In the last few years have studied the first observed interstellar visitors to our solar system. They include a comet called 2I/Borisov, spotted in 2019 and still passing through, and an asteroid named ‘Oumuamua that zipped through quickly in 2017.… [+4427 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Josephine Harvey", "title": "Scientists Note Asteroid Approaching Earth Looks Like It’s Wearing A Face Mask - HuffPost", "description": "1998 OR2 appears to know the planet is facing the coronavirus pandemic, researchers joked.", "url": "https://www.huffpost.com/entry/asteroid-face-mask_n_5ea60b5ac5b6805f9ecf4add", "urlToImage": null, "publishedAt": "2020-04-27T01:23:49Z", "content": "Scientists are joking that even an asteroid set to pass by Earth is exercising caution as the planet tackles the coronavirus pandemic.\r\nThe 1998 OR2 asteroid poses no risk to the Earth, but its appearance makes it look as though it were aware of the risks on … [+1689 chars]"}, {"source": {"id": null, "name": "Eurasiareview.com"}, "author": "https://www.eurasiareview.com/author/admin/", "title": "New Study Finds Connection Between Fault Roughness And Magnitude Of Earthquakes - Eurasia Review", "description": "A new study led by McGill University has found that tectonic plates beneath the Earth’s surface can show varying degrees of roughness and could help explain why certain earthquakes are stronger tha…", "url": "https://www.eurasiareview.com/27042020-new-study-finds-connection-between-fault-roughness-and-magnitude-of-earthquakes/", "urlToImage": null, "publishedAt": "2020-04-26T23:02:00Z", "content": "A new study led by McGill University has found that tectonic plates beneath the Earths surface can show varying degrees of roughness and could help explain why certain earthquakes are stronger than others.\r\nEarthquakes happen when the rocks beneath the Earths… [+2289 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Dalvin Brown", "title": "Love under lockdown: Facebook 'virtual dates' to help users find quarantine dream partner - USA TODAY", "description": "The news was hidden at the bottom of the company's Messenger Rooms announcement where it unveiled new tools for Instagram, Messenger and WhatsApp.", "url": "https://www.usatoday.com/story/tech/2020/04/26/coronavirus-facebook-adding-virtual-dating-tool/3030311001/", "urlToImage": null, "publishedAt": "2020-04-26T21:59:24Z", "content": "Facebook is bolstering its dating service to help members find love while under lockdown orders. \r\nThe tech giant has plans to enable \"virtual dates\" so Facebook Dating users can video chat with matches via Messenger without having to add one another as frien… [+1749 chars]"}, {"source": {"id": null, "name": "Newslanded.com"}, "author": null, "title": "Scientists discover why Venus’ atmosphere behaves so strangely - News Landed", "description": "Horinouchi and his team were able to map the winds using ultraviolet imaging of Venus' clouds provided by the Japanese space probe Akatsuki.", "url": "https://newslanded.com/2020/04/26/venus-super-rotation/", "urlToImage": null, "publishedAt": "2020-04-26T21:45:05Z", "content": "For years scientists have wondered why Venus’ atmosphere spins so much faster than its surface. The answer, according to a recent study by a team of scientists led by Takeshi Horinouchi (Hokkaido University in Sapporo, Japan), lies in its thermal tides.\r\nAnim… [+1535 chars]"}, {"source": {"id": null, "name": "Latestherald.com"}, "author": null, "title": "Duchenne Muscular Dystrophy Drugs Market Overview, Top Companies, Region, Application and Global Forecast by 2026 - Latest Herald", "description": null, "url": "https://latestherald.com/2020/04/26/duchenne-muscular-dystrophy-drugs-market-overview-top-companies-region-application-and-global-forecast-by-2026/", "urlToImage": null, "publishedAt": "2020-04-26T21:34:54Z", "content": "Wave Life Sciences LtdGlobal Duchenne Muscular Dystrophy Drugs Market Segmentation\r\nThis market was divided into types, applications and regions. The growth of each segment provides an accurate calculation and forecast of sales by type and application in term… [+4325 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NASA team developed a ventilator tailored for coronavirus patients in 37 days - WKRG", "description": "NASA team developed a ventilator tailored for coronavirus patients in 37 days", "url": "https://www.youtube.com/watch?v=2RS2If_83oo", "urlToImage": null, "publishedAt": "2020-04-26T21:15:41Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "NASA Published Photo That Jupiter Looks Like Art Painting - Somag News", "description": "NASA, one of the space agencies working on space research, shared Jupiter’s photo resembling an art painting. The photo, on which a few minor plays were made, was taken by Juno, who has been orbiting the planet since 2016. NASA is observing many different pla…", "url": "https://www.somagnews.com/nasa-published-photo-jupiter-looks-like-art-painting/", "urlToImage": null, "publishedAt": "2020-04-26T20:01:00Z", "content": "NASA, one of the space agencies working on space research, shared Jupiter’s photo resembling an art painting. The photo, on which a few minor plays were made, was taken by Juno, who has been orbiting the planet since 2016.\r\nNASA is observing many different pl… [+1670 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Shari Miller For Mailonline", "title": "First ever proof of meteorite killing a man uncovered in 1888 report to Ottoman sultan - Daily Mail", "description": "Documents show Ottoman Sultan Abdul Hamid II (left), was informed of a meteorite that killed one man and paralysed another after landing in Sulaymaniyah, Iraq, on August 22, 1888.", "url": "https://www.dailymail.co.uk/news/article-8258631/First-proof-meteorite-killing-man-uncovered-1888-report-Ottoman-sultan.html", "urlToImage": null, "publishedAt": "2020-04-26T19:40:56Z", "content": "The first ever proof of a person being struck and killed by a meteorite might just have been discovered.\r\nResearchers at the Meteoritical Society have found evidence of a meteorite that killed one man and left another paralysed after it fell 'like rain' on a … [+2605 chars]"}, {"source": {"id": null, "name": "Nasaspaceflight.com"}, "author": null, "title": "UAE-built Mars orbiter arrives at launch site ahead of July liftoff - NASASpaceflight.com", "description": "An Emirati-built Mars explorer, named Al Amal (“Hope” in English) and developed by engineers at…", "url": "https://www.nasaspaceflight.com/2020/04/uae-mars-orbiter-arrives-launch-site/", "urlToImage": null, "publishedAt": "2020-04-26T19:17:36Z", "content": "An Emirati-built Mars explorer, named Al Amal (“Hope” in English) and developed by engineers at the Mohammed bin Rashed Space Centre, has been shipped to the JAXA-run Tanegashima Space Center for final checkouts and preparations ahead of its launch aboard an … [+7548 chars]"}, {"source": {"id": null, "name": "Denverpost.com"}, "author": "Seth Borenstein", "title": "Earth’s insect population shrinks by 27% in 30 years, according to study - The Denver Post", "description": "The world has lost more than one quarter of its land-dwelling insects in the past 30 years, according to researchers whose big picture study of global bug decline paints a disturbing but more nuanc…", "url": "https://www.denverpost.com/2020/04/26/earths-insect-population-shrinks/", "urlToImage": null, "publishedAt": "2020-04-26T19:15:00Z", "content": "KENSINGTON, Maryland — The world has lost more than one quarter of its land-dwelling insects in the past 30 years, according to researchers whose big picture study of global bug decline paints a disturbing but more nuanced problem than earlier research.\r\nFrom… [+3613 chars]"}, {"source": {"id": null, "name": "Adifymedia.com"}, "author": null, "title": "Global Duchenne Muscular Dystrophy Market 2020 Segmentation and Analysis by Recent Trends, Development and ... - Adify Media News", "description": "Global “Duchenne Muscular Dystrophy Market” Report Forecast 2028 states overview of epidemiology trends of Duchenne Muscular Dystrophy Industry. The Report also discusses the prevailing risk…", "url": "https://adifymedia.com/global-duchenne-muscular-dystrophy-market-2020-segmentation-and-analysis-by-recent-trends-development-and-growth-by-trending-regions-by-2028/91963/", "urlToImage": null, "publishedAt": "2020-04-26T19:06:20Z", "content": "Global Duchenne Muscular Dystrophy Market Report Forecast 2028 states overview of epidemiology trends of Duchenne Muscular Dystrophy Industry. The Report also discusses the prevailing risk factors, disease burden with special emphasis on the unmet medical nee… [+5175 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Paleontologists Reveal Jurassic Park in Eastern Morocco - SciTechDaily", "description": "The Kem Kem beds in Morocco are famous for the spectacular fossils found there, including at least four large-bodied non-avian theropods, several large-bodied pterosaurs, and crocodilians. Now, in a new geology and paleontology monograph, that reveals much mo…", "url": "https://scitechdaily.com/paleontologists-reveal-jurassic-park-in-eastern-morocco/", "urlToImage": null, "publishedAt": "2020-04-26T18:40:13Z", "content": "Predators abound on land, in the air and in water some 95 million years on the shores of northern Africa — as shown by the abundant fossils in the Kem Kem region. Large herbivores, such as the long-necked sauropod Rebbachisaurus, could have been hunted or sca… [+6070 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Michael McGowan", "title": "'On top of everything': coronavirus is making Australia's drug crisis a whole lot worse - The Guardian", "description": "Rising substance abuse and treatment restrictions are pushing an already over-burdened rehab system to breaking point", "url": "https://www.theguardian.com/world/2020/apr/27/on-top-of-everything-coronavirus-is-making-australias-drug-crisis-a-whole-lot-worse", "urlToImage": null, "publishedAt": "2020-04-26T17:30:00Z", "content": "Like most Australians, George* has spent the better part of the past two months trying to stay at home. He watches Netflix, tries to cook new things, and takes his dog Baz for walks to the park near his home in Coburg, north of Melbourne.\r\nBut life in a pande… [+13014 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Jacob Geanous", "title": "Covid-19 victim who gave birth while on ventilator beats the virus - Metro.co.uk", "description": "'It's a miracle that I'm sitting here taking to you now,' she said.", "url": "https://metro.co.uk/2020/04/26/covid-19-victim-gave-birth-ventilator-beats-virus-12612573/", "urlToImage": null, "publishedAt": "2020-04-26T15:45:24Z", "content": "Megan Sites gave birth to her son, Jameson, while critically ill with coronavirus. (Picture: UC Health/Fox19)\r\nA mother who miraculously gave birth while battling Covid-19 on a ventilator has beaten the virus. \r\nMegan Sites, 27, was seven-months pregnant with… [+2845 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ryan F. Mandelbaum", "title": "Incredible New Map of Moon Shows Its Every Nook and Cranny - Gizmodo UK", "description": "Hot damn, look at the freakin’ Moon!", "url": "https://gizmodo.com/incredible-new-map-of-moon-shows-its-every-nook-and-cra-1843029458", "urlToImage": null, "publishedAt": "2020-04-26T15:00:00Z", "content": "Hot damn, look at the freakin Moon!\r\nScientists led by the United States Geological Surveys Corey Fortezzo have released what they call the Unified Geologic Map of the Moonan authoritative map of lunar geology. The map, built from six Apollo-era maps and upda… [+2145 chars]"}, {"source": {"id": null, "name": "Syfy.com"}, "author": "Elizabeth Rayne", "title": "Brain implant and signal decoder have done the impossible and reversed paralysis - SYFY WIRE", "description": "Paralysis used to mean a life sentence of immobility with no way out—until now. Back in 2010, Ian Burkhart suffered a devastating injury that would leave him mostly paralyzed. Even though he was still able to move his shoulders and elbows, he had lost sensati…", "url": "https://www.syfy.com/syfywire/brain-implant-and-signal-decoder-reversed-paralysis", "urlToImage": null, "publishedAt": "2020-04-26T14:46:26Z", "content": "Paralysis used to mean a life sentence of immobility with no way outuntil now.\r\nBack in 2010, Ian Burkhart suffered a devastating injury that would leave him mostly paralyzed. Even though he was still able to move his shoulders and elbows, he had lost sensati… [+3894 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daniel Garcia-Castellanos", "title": "Tomanowos, the meteorite that survived mega-floods and human folly - Space.com", "description": "", "url": "https://www.space.com/tomanowos-meteorite-survived-mega-floods-human-folly.html", "urlToImage": null, "publishedAt": "2020-04-26T14:10:00Z", "content": "This article was originally published at The Conversation. The publication contributed the article to Space.com's Expert Voices: Op-Ed &amp; Insights.\r\nDaniel Garcia-Castellanos, Earth scientist, Instituto de Ciencias de la Tierra Jaume Almera (ICTJA - CSIC)\r… [+7190 chars]"}, {"source": {"id": null, "name": "Townsvillebulletin.com.au"}, "author": null, "title": "Researcher says reefs around Magnetic Island have nearly recovered from coral bleaching - Townsville Bulletin", "description": "Subscribe to the Townsville Bulletin to get unrestricted digital access, home paper delivery, Apps for iPad and Android and much more...", "url": "https://www.townsvillebulletin.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-26T14:01:56Z", "content": null}, {"source": {"id": null, "name": "Thenewdaily.com.au"}, "author": null, "title": "Did a Death Star take out a planet for real? Something did - The New Daily", "description": "If you've felt a great disturbance in the Force of late, of the sort that made you stagger and press your fingertips to your temple, then fair enough. It", "url": "https://thenewdaily.com.au/life/science/2020/04/26/death-star-return-planet/", "urlToImage": null, "publishedAt": "2020-04-26T13:25:19Z", "content": "If you’ve felt a great disturbance in the Force of late, of the sort that made you stagger and press your fingertips to your temple, then fair enough.\r\nIt seems the famed planet-killing Death Star from Star Wars has been at it again.\r\nWhat else can explain th… [+3273 chars]"}, {"source": {"id": null, "name": "Ibtimes.sg"}, "author": "https://www.ibtimes.sg/reporters/nirmal-narayanan", "title": "Did cold-blooded frogs once inhabit Antarctica? Fossils have the answer - International Business Times, Singapore Edition", "description": "The role of Antarctica in determining the evolution of these frogs is still unknown", "url": "https://www.ibtimes.sg/did-cold-blooded-frogs-once-inhabit-antarctica-fossils-have-answer-43840", "urlToImage": null, "publishedAt": "2020-04-26T12:43:02Z", "content": "A study conducted on a 40-million-year-old frog fossil has suggested that cold-blooded frogs once lived in Antarctica, which was actually warm at that time.Scientists are making such a discovery for the first time in history, and as of now, the role played by… [+1638 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Christopher Wanjek", "title": "How Space Travel Tries to Kill You and Make You Ugly - WIRED", "description": "Oh also, it makes you blind and stupid, too.", "url": "https://www.wired.com/story/how-space-tries-kill-you-make-you-ugly/", "urlToImage": null, "publishedAt": "2020-04-26T11:40:53Z", "content": "Of these 34 risks, three are potential showstoppers: radiation, gravity (or lack thereof), and the need for surgery or a complicated medical procedure.\r\nLets explore the gravity issue.\r\nSome science fiction writers in the mid-20th century speculated that zero… [+3425 chars]"}, {"source": {"id": null, "name": "Earthsky.org"}, "author": "Andy Briggs", "title": "What are gravitational waves? | Astronomy Essentials - EarthSky", "description": "First postulated by Albert Einstein in 1916 but not observed directly until September 2015, gravitational waves are ripples in spacetime.", "url": "https://earthsky.org/space/definition-what-are-gravitational-waves", "urlToImage": null, "publishedAt": "2020-04-26T11:26:41Z", "content": "Researchers at the Laser Interferometer Gravitational-Wave Observatory (LIGO) made the first-ever detection of gravitational waves on September 14, 2015. Here, a technician works on some of the optics for a LIGO detector. Image via LIGO.\r\nGravitational waves … [+8516 chars]"}, {"source": {"id": null, "name": "Wam.ae"}, "author": "WAM", "title": "Coral nursery project for Sir Bu Nair island - WAM EN", "description": "SHARJAH, 26th April, 2020 (WAM) – Sharjah’s Environment and Protected Areas Authority, EPAA, is to collaborate with the Emirates Marine Environment Group, EMEG, to establish a large-scale coral nursery off the coast of the island of Sir Bu Nair. The project, …", "url": "http://wam.ae/en/details/1395302839000", "urlToImage": null, "publishedAt": "2020-04-26T10:03:00Z", "content": "SHARJAH, 26th April, 2020 (WAM) Sharjahs Environment and Protected Areas Authority, EPAA, is to collaborate with the Emirates Marine Environment Group, EMEG, to establish a large-scale coral nursery off the coast of the island of Sir Bu Nair.\r\nThe project, pa… [+2307 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "How runny a liquid can be? - Tech Explorist", "description": "Viscosity (η) is the resistance of a liquid to flow. Liquids get thicker when cooled and runnier when heated, but how runny can a liquid ever get if we", "url": "https://www.techexplorist.com/runny-liquid/31826/", "urlToImage": null, "publishedAt": "2020-04-26T09:47:18Z", "content": "Viscosity () is the resistance of a liquid to flow. Liquids get thicker when cooled and runnier when heated, but how runny can a liquid ever get if we keep heating it?\r\nAt a point, the liquid reaches a specific temperature; it transitions between the liquid-l… [+3341 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Carly Cassella", "title": "Ancient Australian Rocks Suggest Earth's Continents Were Shifting Earlier Than Thought - ScienceAlert", "description": "Earth's continents are constantly on the move, it's a key feature of our planet, but that wasn't always the case.", "url": "https://www.sciencealert.com/ancient-australian-rocks-suggest-earth-s-continents-have-been-moving-for-over-3-billion-years", "urlToImage": null, "publishedAt": "2020-04-26T09:40:49Z", "content": "Earth's continents are constantly on the move, it's a key feature of our planet, but that wasn't always the case.\r\nWhile some scientists think Earth's tectonic plates began pushing and pulling only a billion years ago, others think the whole process started n… [+4081 chars]"}, {"source": {"id": null, "name": "Bigthink.com"}, "author": "Michelle Thaller", "title": "Ask an astronomer: How do astronauts deal with isolation? - Big Think", "description": "Being stuck at home is not as intense as being away from Earth, but there are ways to cope in either scenario.", "url": "https://bigthink.com/videos/astronaut-isolation", "urlToImage": null, "publishedAt": "2020-04-26T09:05:19Z", "content": "MICHELLE THALLER: When it comes to how to deal with isolation and feeling like you're sort of helpless and cut off from everybody, it's hard to beat the experience of an astronaut, where they literally are cut off from Earth. And even if they wanted to, they … [+4662 chars]"}, {"source": {"id": null, "name": "Volcanodiscovery.com"}, "author": null, "title": "Volcanoes Today - summary of volcanic activity world-wide - VolcanoDiscovery", "description": "Volcanoes Today - summary of volcanic activity world-wide", "url": "https://www.volcanodiscovery.com/volcanoes/today.html", "urlToImage": null, "publishedAt": "2020-04-26T08:59:32Z", "content": "Volcanoes Today, 26 Apr 2020: Klyuchevskoy volcano, Reventador, Sangay, Nevados de Chillán, Aso, Sabancaya, Ebeko\r\nSunday Apr 26, 2020 11:00 AM | BY: VN\r\nSatellite image of Klyuchevskoy volcano on 26 Apr 2020\r\nKlyuchevskoy (Kamchatka): Explosive activity cont… [+1647 chars]"}, {"source": {"id": null, "name": "Biophotonics.world"}, "author": null, "title": "FSU researchers discover new structure for promising class of materials - Biophotonics.World", "description": "Florida State University researchers have discovered a novel structure for organic-inorganic hybrid materials that shows potential for more efficient technologies.&nbsp;Professor of Chemistry and Biochemistry Biwu Ma and his team have published a new study in…", "url": "https://www.biophotonics.world/magazine/article/1004/fsu-researchers-discover-new-structure-for-promising-class-of-materials", "urlToImage": null, "publishedAt": "2020-04-26T08:51:23Z", "content": null}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Ethelene Bailey", "title": "BepiColombo Captured a Couple of Images of the Earth, While Heading Towards Mercury - Dual Dove", "description": "The European Space Agency has recently published a series of impressive images of the Earth captured by the BepiColombo probe. The mission aiming to provide resourceful information regarding the fo…", "url": "https://www.dualdove.com/bepicolombo-captured-a-couple-of-images-of-the-earth-while-heading-towards-mercury/9742/", "urlToImage": null, "publishedAt": "2020-04-26T07:52:30Z", "content": "The European Space Agency has recently published a series of impressive images of the Earth captured by the BepiColombo probe. The mission aiming to provide resourceful information regarding the formation and evolution of Mercury started in 2018.\r\nTwo years h… [+1721 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": null, "title": "50 Years Ago, 3 Astronauts Survived Apollo 13. Could It Happen Again? - Pulse Live Kenya", "description": "(Science Times)", "url": "https://www.nytimes.com/2020/04/12/science/apollo-13-anniversary.html", "urlToImage": null, "publishedAt": "2020-04-26T06:06:42Z", "content": "Apollo 13 almost killed three NASA astronauts.\r\nHow much safer will it be the next time that people head to the moon, more than 50 years later?\r\nWill it indeed be safer?\r\nSafer, yes, said Douglas O. Stanley, president and executive director of the National In… [+11680 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "ELIZABETH ANNE BROWN, The Asheville Citizen-Times", "title": "Bear hibernates under Asheville house, charms neighbors | News - Uniontown Herald Standard", "description": "ASHEVILLE, N.C. (AP) — At first, Haw Creek resident Ann McNamara thought she had a raccoon in her crawl space. There was a persistent scratching sound from beneath the floorboards,", "url": "https://apnews.com/8088f1ad9639ebd48163a01050e56ca4", "urlToImage": null, "publishedAt": "2020-04-26T04:01:14Z", "content": "ASHEVILLE, N.C. (AP) At first, Haw Creek resident Ann McNamara thought she had a raccoon in her crawl space. There was a persistent scratching sound from beneath the floorboards, and every once in a while her dog would stand stock-still and then tremble.\r\nShe… [+3884 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Jo Abi", "title": "Perth boy's desperate quest for a wheelchair - 9Honey", "description": "", "url": "https://honey.nine.com.au/latest/australian-boys-desperate-plea-for-a-wheelchair/1972ead0-2dd9-46c7-b5d7-6ad4ceee0366", "urlToImage": null, "publishedAt": "2020-04-26T03:31:20Z", "content": "Charlie Mone is just about the cutest boys you will ever see, and one of the happiest, in complete contrast to his past two years of struggle.\r\nCharlie, 10, suffers from Duchenne Muscular Dystrophy, a genetic neuromuscular condition. Is his own words, his \"br… [+4361 chars]"}, {"source": {"id": null, "name": "Jewishlifenews.com"}, "author": null, "title": "Sales Revenue of Vagus Nerve Stimulator to escalate in the Coming Years Owing to Changes in Market Dynamics During COVID-19 Pandemic - Jewish Life News", "description": null, "url": "https://jewishlifenews.com/uncategorized/sales-revenue-of-vagus-nerve-stimulator-to-escalate-in-the-coming-years-owing-to-changes-in-market-dynamics-during-covid-19-pandemic/", "urlToImage": null, "publishedAt": "2020-04-26T02:20:00Z", "content": "Vagus Nerve Stimulator Market Segmentation-\r\nThe Vagus Nerve Stimulator Market study offers an in-depth analysis of the current market trends influencing this business vertical. The study also includes market valuation, market size, revenue forecasts, geograp… [+5658 chars]"}, {"source": {"id": null, "name": "Abc13.com"}, "author": null, "title": "NASA Astronaut Andrew Morgan welcomed back to Earth with parade in Friendswood - KTRK-TV", "description": "Welcome home, Dr. Morgan! 🌎", "url": "https://abc13.com/friendswood-parade-nasa-astronaut-andrew-morgan-back-on-earth/6129564/", "urlToImage": null, "publishedAt": "2020-04-26T00:22:43Z", "content": "FRIENDSWOOD, Texas (KTRK) -- NASA Astronaut Andrew Morgan was welcomed back to Earth with a homecoming celebration.Morgan's friends and family gathered to celebrate with a street parade in his home in Friendswood.\r\nDr. Morgan returned back to Earth on April 1… [+260 chars]"}, {"source": {"id": null, "name": "Eurasiareview.com"}, "author": "https://www.eurasiareview.com/author/admin/", "title": "An Eclipsing Binary Millisecond Pulsar Discovered By FAST - Eurasia Review", "description": "Using the data obtained by the Five-hundred-meter Aperture Spherical radio Telescope (FAST), a research team led by Prof. PAN Zhichen and Prof. LI Di from the National Astronomical Observatories of…", "url": "https://www.eurasiareview.com/26042020-an-eclipsing-binary-millisecond-pulsar-discovered-by-fast/", "urlToImage": null, "publishedAt": "2020-04-25T22:26:00Z", "content": "Using the data obtained by the Five-hundred-meter Aperture Spherical radio Telescope (FAST), a research team led by Prof. PAN Zhichen and Prof. LI Di from the National Astronomical Observatories of the Chinese Academy of Sciences (NAOC) discovered an eclipsin… [+1881 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": null, "title": "SpaceX already preparing for next crew mission to ISS ahead of May test run - South China Morning Post", "description": "The mission will be the first time astronauts will launch from the United States on any mission since the end of the space shuttle programme in 2011.", "url": "https://www.scmp.com/news/world/united-states-canada/article/3081575/spacex-already-preparing-next-crew-mission-iss", "urlToImage": null, "publishedAt": "2020-04-25T22:13:31Z", "content": "Published: 5:34am, 26 Apr, 2020\r\nUpdated: 5:34am, 26 Apr, 2020"}, {"source": {"id": null, "name": "Newsinfopark.com"}, "author": "NIP Web Desk Team", "title": "Controversial Discovery Says Origins of Human Language Existed 25 Million Years Ago - News Info Park", "description": "(SolStock/E+/Getty Images) CARLY CASSELLA 25 APRIL 2020 A structure critical to our brain's core language pathway, found only in humans and apes, has now also been identified in monkeys, according to", "url": "https://newsinfopark.com/science/2020-04-25/article/controversial-discovery-says-origins-of-human-language-existed-25-million-years-ago-19201/nip-web-desk-team/", "urlToImage": null, "publishedAt": "2020-04-25T22:10:47Z", "content": "A structure critical to our brain’s core language pathway, found only in humans and apes, has now also been identified in monkeys, according to a controversial new study – suggesting the origins of language may have appeared 20 to 25 million years earlier tha… [+4838 chars]"}, {"source": {"id": null, "name": "Voanews.com"}, "author": "VOA Learning English", "title": "Scientists Study Unusual Comet - VOA Learning English", "description": "Amateur astronomer Gennady Borisov was the first person to identify a new comet in August of 2019. Researchers reported on Monday that gas coming off the comet, 2I/Borisov, had high levels of carbon monoxide - far more than comets formed in our solar system.", "url": "https://learningenglish.voanews.com/a/scientists-study-unusual-comet-/5384347.html", "urlToImage": null, "publishedAt": "2020-04-25T21:58:00Z", "content": "Scientists recently reported new details about the second interstellar object ever seen passing through our solar system. It is a comet called 2I/Borisov.\r\nComets are made up of frozen gases, rock and dust that orbit stars. The Reuters news agency likens them… [+3202 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Anna Salleh", "title": "The fagus, Australia's only native winter deciduous tree, is turning its stunning autumn colours. What's behind that gorgeous display? - ABC News", "description": "Tasmania's deciduous beech, the fagus, is turning stunning yellow, orange and red — what makes this happen?", "url": "https://www.abc.net.au/news/science/2020-04-26/true-blue-autumn-leaves-are-turning/12147698", "urlToImage": null, "publishedAt": "2020-04-25T20:30:09Z", "content": "Every year at this time, thousands flock to national parks in Tasmania to see the stunning autumn display of Australia's only native winter deciduous tree the fagus.\r\nBut this year the state's parks are closed until further notice thanks to coronavirus, which… [+4723 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "The Largest Hole in the Ozone Layer Over the Arctic Has Been Closed - Somag News", "description": "The large ozone hole observed last month in the Arctic, located above the north polar circle of the world, was completely closed according to the statement made by scientists. Scientists have explained that this phenomenon is not related to the coronavirus. T…", "url": "https://www.somagnews.com/largest-hole-ozone-layer-arctic-closed/", "urlToImage": null, "publishedAt": "2020-04-25T19:48:00Z", "content": "The large ozone hole observed last month in the Arctic, located above the north polar circle of the world, was completely closed according to the statement made by scientists. Scientists have explained that this phenomenon is not related to the coronavirus.\r\n… [+2194 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "The Great Space Escape: Scientists Learn How Light Can Flee From Black Hole 'Like Boomerang' - Sputnik International", "description": "The scientists' discovery may potentially help them to learn more about the nature of black holes, such as the rotation speed of these space objects.", "url": "https://sputniknews.com/science/202004251079093023-the-great-space-escape-scientists-learn-how-light-can-flee-from-black-hole-like-a-boomerang/", "urlToImage": null, "publishedAt": "2020-04-25T18:31:30Z", "content": "The scientists' discovery may potentially help them to learn more about the nature of black holes, such as the rotation speed of these space objects.Having examined archived X-ray observation data of a black hole whose mass is about ten times that of the Sun … [+1560 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Callum Hoare", "title": "'Universe is unstable!' How Brian Cox revealed world could end 'at any moment' - Express.co.uk", "description": "THE END OF THE WORLD could happen 'at any moment' according to the chilling claims of a scientist, after Brian Cox revealed why the 'universe is unstable'.", "url": "https://www.express.co.uk/news/science/1273858/end-of-the-world-brian-cox-universe-unstable-vacuum-decay-space-news-spt", "urlToImage": null, "publishedAt": "2020-04-25T17:54:00Z", "content": null}, {"source": {"id": null, "name": "Ibtimes.sg"}, "author": "https://www.ibtimes.sg/reporters/jeevan-biswas", "title": "Scientists identify the 'most dangerous place' in the history of earth, once home to fearsome predators - International Business Times, Singapore Edition", "description": "According to the researchers, the area around south-eastern Morocco was home to predators such as Carcharodontosaurus, Pterosaurs and freshwater sharks 100 million years ago", "url": "https://www.ibtimes.sg/scientists-identify-most-dangerous-place-history-earth-once-home-fearsome-predators-43789", "urlToImage": null, "publishedAt": "2020-04-25T16:43:56Z", "content": "If one was asked which was the most dangerous place in the history of the planet, what would their answer be? Not many can answer that question. However, an international team of scientists has identified such a place a predator-ridden Morocco 100 million yea… [+3056 chars]"}, {"source": {"id": null, "name": "Kiowacountypress.net"}, "author": null, "title": "Kiowa County weather outlook – week of April 25, 2020 - Kiowa County Press", "description": "Steve NorrisTemperatures are going to be climbing steadily for the week ahead.High temperatures will climb from the upper 70s Sunday to the mid-80s by Wednesday and we could hit 90 Friday!Low temperatures will mostly be in the 40s for the week. The period Fro…", "url": "https://kiowacountypress.net/content/kiowa-county-weather-outlook-%E2%80%93-week-april-25-2020", "urlToImage": null, "publishedAt": "2020-04-25T15:38:06Z", "content": "Steve Norris\r\nTemperatures are going to be climbing steadily for the week ahead.\r\nHigh temperatures will climb from the upper 70s Sunday to the mid-80s by Wednesday and we could hit 90 Friday!\r\nLow temperatures will mostly be in the 40s for the week. The peri… [+432 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "China unveils name of first Mars exploration mission - The Jakarta Post - Jakarta Post", "description": "China's space agency on Friday unveiled the name of its first Mars exploration mission, coinciding with China's annual Space Day and the 50th anniversary of the launch of its first satellite.", "url": "https://www.thejakartapost.com/life/2020/04/25/china-unveils-name-of-first-mars-exploration-mission-.html", "urlToImage": null, "publishedAt": "2020-04-25T15:05:00Z", "content": "China's space agency on Friday unveiled the name of its first Mars exploration mission, coinciding with China's annual Space Day and the 50th anniversary of the launch of its first satellite.\r\nThe Mars mission has been named Tianwen-1, the official Xinhua new… [+835 chars]"}, {"source": {"id": null, "name": "Counton2.com"}, "author": "Antonio Stinson", "title": "American Red Cross to host blood drive in Berkeley County - WCBD News 2", "description": "BERKELEY COUNTY, S.C. (WCBD) – Berkeley County is partnering with the American Red Cross by hosting a blood drive. The blood drive will be on Tuesday, May 12 from 10:00 AM until 3:00 PM in th…", "url": "https://www.counton2.com/news/american-red-cross-to-host-blood-drive-in-berkeley-county/", "urlToImage": null, "publishedAt": "2020-04-25T14:55:00Z", "content": "BERKELEY COUNTY, S.C. (WCBD) – Berkeley County is partnering with the American Red Cross by hosting a blood drive. \r\nThe blood drive will be on Tuesday, May 12 from 10:00 AM until 3:00 PM in the Assembly Room at the Berkeley County Administration Building on … [+234 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Dutch Tulip Fields Come Into Bloom in Stunning Satellite Images - SciTechDaily", "description": "While the COVID-19 virus pandemic is forcing everybody to stay at home, we bring you these beautiful views from space of the Dutch tulip fields coming into bloom. Captured by the Copernicus Sentinel-2 mission on April 5, April 10, April 15 and April 20, 2020,…", "url": "https://scitechdaily.com/dutch-tulip-fields-come-into-bloom-in-stunning-satellite-images/", "urlToImage": null, "publishedAt": "2020-04-25T14:03:13Z", "content": "While the COVID-19 virus pandemic is forcing everybody to stay at home, we bring you these beautiful views from space of the Dutch tulip fields coming into bloom. Captured by the Copernicus Sentinel-2 mission on April 5, April 10, April 15 and April 20, 2020,… [+1633 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Space race is rigged in Elon Musk’s favour, claims Russian rival - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T14:02:23Z", "content": null}, {"source": {"id": null, "name": "Echo-news.co.uk"}, "author": "Sean Davies", "title": "Seven more die in south Essex after testing positive for Covid-19 - Thurrock Gazette", "description": "Seven more people have died from coronavirus in south Essex.", "url": "https://www.echo-news.co.uk/news/18405656.seven-die-south-essex-testing-positive-covid-19/", "urlToImage": null, "publishedAt": "2020-04-25T13:14:00Z", "content": "Seven more people have died from coronavirus in south Essex.\r\nFigures released by NHS England show that six patients died in Basildon Hospital after testing positive for the virus.\r\nThis brings the total there to 217.\r\nIn Southend Hospital, one more person di… [+1333 chars]"}, {"source": {"id": null, "name": "Dailypress.com"}, "author": "Becky Ferreira", "title": "When crocodiles once dived like dolphins and whales - Daily Press", "description": "According to a study published Monday in the Proceedings of the National Academy of Sciences, these predatory crocodilians are the only archosaurs — the group that also includes birds and dinosaurs — known to have shifted from land to a lifestyle spent always…", "url": "https://www.dailypress.com/life/pets/sns-nyt-when-crocodiles-lived-like-dolphins-20200425-acir6swygfcnhlsxx4vg7j62g4-story.html", "urlToImage": null, "publishedAt": "2020-04-25T13:03:48Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Ciaran McGrath", "title": "Kilauea shock: Was THIS the reason for 2018 Hawaii volcano eruption? - Express.co.uk", "description": "THE spectacular Kilauea volcanic eruption of 2018, which resulted in the destruction of hundreds of homes, and the evacuation of thousands of people, may have been triggered in part by unusually high rainfall levels, a new study has suggested.", "url": "https://www.express.co.uk/news/science/1272403/kilauea-volcano-eruption-hawaii-big-island-2018-rainfall", "urlToImage": null, "publishedAt": "2020-04-25T09:30:00Z", "content": null}, {"source": {"id": null, "name": "Salisburyjournal.co.uk"}, "author": "Press Association 2020", "title": "Russian cargo ship docks with space station - Salisbury Journal", "description": "The Progress MS-14 spacecraft docked at 0512 GMT on Saturday, about three-and-a-half hours after blasting off from Kazakhstan.", "url": "https://www.salisburyjournal.co.uk/news/national/18405361.russian-cargo-ship-docks-space-station/", "urlToImage": null, "publishedAt": "2020-04-25T07:51:00Z", "content": "An unmanned Russian cargo capsule has arrived at the International Space Station with more than two tons of supplies for the three-man crew.\r\nThe Progress MS-14 spacecraft docked at 0512 GMT on Saturday, about three-and-a-half hours after blasting off from Ru… [+417 chars]"}, {"source": {"id": null, "name": "Webbyfeed.com"}, "author": "Herbert S. Aurand", "title": "Mars Exploration With Levitating Nanocardboard Probes Might Happen In The Future - Webby Feed", "description": "NASA is planning on launching into space its Perseverance rover, responsible for conducting the Mars 2020 mission. The spacecraft’s primary goal is to reach the Red Planet’s surface and provide...", "url": "https://www.webbyfeed.com/mars-exploration-with-levitating-nanocardboard-probes-might-happen-in-the-future/8026/", "urlToImage": null, "publishedAt": "2020-04-25T07:36:16Z", "content": "NASA is planning on launching into space its Perseverance rover, responsible for conducting the Mars 2020 mission. The spacecrafts primary goal is to reach the Red Planets surface and provide resourceful information on the topic of microbial life that could e… [+1776 chars]"}, {"source": {"id": null, "name": "Webbyfeed.com"}, "author": "Carrie J. Bronstein", "title": "Scientists Came Up With The Most Detailed Lunar Map, Focused On Moon's Rock Composition - Webby Feed", "description": "The distant dark spots that can be spot on the Moon from a distance are merely the tip of the iceberg, as the satellite possesses an impressive geological diversity. A...", "url": "https://www.webbyfeed.com/scientists-came-up-with-the-most-detailed-lunar-map-focused-on-moons-rock-composition/8023/", "urlToImage": null, "publishedAt": "2020-04-25T07:24:13Z", "content": "The distant dark spots that can be spot on the Moon from a distance are merely the tip of the iceberg, as the satellite possesses an impressive geological diversity. A team of determined researchers has managed to create the most detailed lunar map focused on… [+1621 chars]"}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Ethelene Bailey", "title": "JAXA Akatsuki Probe Explained The Venus Atmosphere’s Super-Rotation - Dual Dove", "description": "Launched in May 2010 to investigate Venus’ atmosphere, Japanese spacecraft Akatsuki brought some important savvy about its peculiar habit. The Venusian atmosphere suffers from what is called a supe…", "url": "https://www.dualdove.com/jaxa-akatsuki-probe-explained-the-venus-atmospheres-super-rotation/9717/", "urlToImage": null, "publishedAt": "2020-04-25T07:07:30Z", "content": "Launched in May 2010 to investigate Venus atmosphere, Japanese spacecraft Akatsuki brought some important savvy about its peculiar habit. The Venusian atmosphere suffers from what is called a super-rotation.\r\nThe atmospheric super-rotation is a condition of t… [+1640 chars]"}, {"source": {"id": null, "name": "Hurriyetdailynews.com"}, "author": "hurriyetdailynews.com", "title": "Hubble telescope celebrates 30th year in space - Hurriyet Daily News", "description": "Scientists on April 24 celebrated the Hubble Space Telescope's 30th anniversary with a new image of a satellite galaxy of the Milky Way.", "url": "http://www.hurriyetdailynews.com/hubble-telescope-celebrates-30th-year-in-space-154195", "urlToImage": null, "publishedAt": "2020-04-25T06:16:03Z", "content": "WASHINGTON\r\nScientists on April 24 celebrated the Hubble Space Telescope's 30th anniversary with a new image of a satellite galaxy of the Milky Way. \r\nIn a statement, U.S. space agency NASA said the galaxy in the image - located 163,000 light-years away- away… [+847 chars]"}, {"source": {"id": null, "name": "Prothomalo.com"}, "author": "Nusrat Nowrin", "title": "Before becoming frozen wasteland, Antarctica was home to frogs - Prothom Alo English", "description": "Before becoming frozen wasteland, Antarctica was home to frogs", "url": "https://en.prothomalo.com/science-technology/science/before-becoming-frozen-wasteland-antarctica-was-home-to-frogs", "urlToImage": null, "publishedAt": "2020-04-25T04:14:57Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Gursimran Hans", "title": "Trump’s new US Space Force to deploy surveillance telescope in Australia - Express.co.uk", "description": "THE US plans to construct a specialist space surveillance telescope at a facility in Western Australia.", "url": "https://www.express.co.uk/news/science/1273676/Space-news-USA-Australia-telescope-spy-track-debris-satellites", "urlToImage": null, "publishedAt": "2020-04-25T03:21:00Z", "content": null}, {"source": {"id": null, "name": "Spaceflightnow.com"}, "author": null, "title": "Soyuz launches from Kazakhstan with space station supply ship - Spaceflight Now", "description": null, "url": "https://spaceflightnow.com/2020/04/25/soyuz-launches-from-kazakhstan-with-space-station-supply-ship/", "urlToImage": null, "publishedAt": "2020-04-25T02:57:13Z", "content": "A Soyuz-2.1a rocket lifts off from the Baikonur Cosmodrome in Kazakhstan with the 75h Progress supply ship for the International Space Station. Credit: Roscosmos\r\nA Soyuz rocket decorated to mark the 75th anniversary of the end of World War II in Europe fired… [+4569 chars]"}, {"source": {"id": null, "name": "Syfy.com"}, "author": "Elizabeth Rayne", "title": "This planet is so scorching that metals actually vaporize into the atmosphere - SYFY WIRE", "description": "There are hot planets, and then there are unbelievably, unbearably, insufferably hot planets. Imagine an alien world torrid enough to not just melt, but vaporize metal. MASCARA-2 b (whose name has absolutely nothing to do with makeup) is that planet. A team o…", "url": "https://www.syfy.com/syfywire/this-planet-is-so-hot-it-makes-metals-vaporize", "urlToImage": null, "publishedAt": "2020-04-25T02:16:44Z", "content": "There are hot planets, and then there are unbelievably, unbearably, insufferably hot planets.\r\nImagine an alien world torrid enough to not just melt, but vaporize metal. MASCARA-2 b (whose name has absolutely nothing to do with makeup) is that planet. A team … [+3176 chars]"}, {"source": {"id": null, "name": "Itechpost.com"}, "author": "iTech Post", "title": "Black Hole Feasts On White Dwarf; X-rays Show It Sucks Up All The Gases And Keeps The Star Close To Feed On - iTech Post", "description": "A white dwarf star treads too close to a black hole, see the fate of the tiny cosmic body and its struggle against the colossus", "url": "http://www.itechpost.com/articles/102433/20200424/black-hole-feasts-white-dwarf-x-rays-show-sucks-up.htm", "urlToImage": null, "publishedAt": "2020-04-25T01:43:00Z", "content": "Black Hole Feasts On White Dwarf; X-rays Show It Sucks Up All The Gases And Keeps The Star Close To Feed On\r\nBlack holes usually devour their prey in an instant, but experts have observed one taking its sweet time in enjoying its meal. One astronomer believes… [+3192 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Sean Keach", "title": "Elon Musk’s Starlink Satellites branded ‘space junk that blocks night sky’ – but he wants to put 40,000 in orb - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11447265/elon-musk-starlink-satellites-night-sky-block-orbit-how-many/", "urlToImage": null, "publishedAt": "2020-04-21T17:05:48Z", "content": "ELON Musk has launched hundreds of Starlink 'internet satellites' into space but critics say he's flooding Earth's orbit with 'space junk'.\r\nThe billionaire space mogul's probes have proved highly controversial, but Musk still plans to launch tens of thousand… [+6649 chars]"}, {"source": {"id": null, "name": "Travelandleisure.com"}, "author": "Cailey Rizzo", "title": "NASA's Online Game Can Help Save the Coral Reefs — and Your Boredom During Quarantine - Travel + Leisure", "description": "Move over, Animal Crossing.", "url": "https://www.travelandleisure.com/travel-tips/mobile-apps/nasa-nemo-net-coral-reef-mapping-game-quarantine", "urlToImage": null, "publishedAt": "2020-04-20T16:42:22Z", "content": "NASA is calling on gamers to help map and explore the world’s coral reefs.\r\nIn the game, NASA NeMO-Net, players can can help train a NASA supercomputer to learn more about the ocean floor, with the help of real NASA data to identify and classify corals. Playe… [+1604 chars]"}, {"source": {"id": null, "name": "Tass.com"}, "author": "TASS", "title": "ISS crew evacuated from Soyuz-MS15 on landing - TASS", "description": "The crew has returned to Earth due to the novel coronavirus pandemic", "url": "https://tass.com/science/1146089", "urlToImage": null, "publishedAt": "2020-04-17T06:20:00Z", "content": "MOSCOW, April 17. /TASS/. Roscosmos cosmonaut Oleg Skripochka and NASA astronauts Andrew Morgan and Jessica Meir have been evacuated from the Soyuz MS-15 manned spacecraft, which landed earlier in Kazakhstan, 147 km to the southeast of the city of Zhezqazghan… [+657 chars]"}, {"source": {"id": null, "name": "Travelandleisure.com"}, "author": "Alison Fox", "title": "NASA, Former Astronauts Commemorate the 50th Anniversary of Apollo 13 - Travel + Leisure", "description": "On April 13, 1970, the Apollo 13's lunar landing was aborted in what would become a historic mission.", "url": "https://www.travelandleisure.com/travel-news/apollo-13-mission-50th-anniversary", "urlToImage": null, "publishedAt": "2020-04-14T13:47:15Z", "content": "\"Houston, we've had a problem.\"\r\nFifty years after that famed phrase aboard the Apollo 13 was spoken, legends and institutions of space exploration are taking to a different form of communication to commemorate the historic mission — Twitter.\r\n“They were coas… [+3223 chars]"}, {"source": {"id": null, "name": "Inverse.com"}, "author": "Mike Brown", "title": "How SpaceX Starlink works: price, launch date for Elon Musk's internet - Inverse", "description": "Connecting to Starlink will be really easy, Elon Musk says", "url": "https://www.inverse.com/article/62185-here-s-how-you-will-connect-to-starlink-spacex-s-internet-constellation", "urlToImage": null, "publishedAt": "2020-01-08T19:50:11Z", "content": "Starlink, SpaceXs internet connectivity satellite constellation, is taking form. The project is designed to offer higher speeds and lower latency than competing setups, so long as the receiver can see the satellites in orbit. It could help fund some of CEO El… [+4593 chars]"}]}