{"status": "ok", "totalResults": 52, "articles": [{"source": {"id": null, "name": "Gsweekender.com.au"}, "author": null, "title": "Opera House comes alive in your home - Great Southern Weekender", "description": "The Sydney Opera House From Our House to Yours digital theatre season has launched and offers viewers a range of full-length performances and talks, never-before-seen footage, podcasts, articles and behind-the-scenes content from various companies, celebritie…", "url": "https://gsweekender.com.au/sydney-opera-house-2020-digital-season-covid19/", "urlToImage": "https://gsweekender.com.au/wp-content/uploads/2020/04/Dance-Rites_Meuram-Murray-Island-Dancers_Sydney-Opera-House_credit_Daniel-Boud_152.jpg", "publishedAt": "2020-04-24T10:04:51Z", "content": "By Ashleigh Fielding | posted on April 24, 2020\r\nTHEATRE lovers never fear, for the Sydney Opera House is here literally here, right in your own home.\r\nThe Sydney Opera House From Our House to Yours digital theatre season was launched at the start of the mont… [+1475 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Warming climate undoes decades of knowledge of marine protected areas - Phys.org", "description": "Climate change and warming seas are transforming tropical coral reefs and undoing decades of knowledge about how to protect these delicate and vital ecosystems.", "url": "https://phys.org/news/2020-04-climate-undoes-decades-knowledge-marine.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/warmingclima.jpg", "publishedAt": "2020-04-24T09:53:12Z", "content": "Climate change and warming seas are transforming tropical coral reefs and undoing decades of knowledge about how to protect these delicate and vital ecosystems.\r\nMany of the world's coral reefs are seeing biodiversity plunge in the face of repeated coral blea… [+4590 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Tom Cowie, Chloe Booker", "title": "Shopping returning and hopes high for footy restart - The Age", "description": "The Emporium shopping centre is reopening and the AFL has the backing of health authorities to restart in June, offering those with itchy feet hope that Victoria is emerging from pandemic lockdown.", "url": "https://www.theage.com.au/national/victoria/shopping-returning-and-hopes-high-for-footy-restart-20200424-p54n0p.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.2554269175108538%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/5d6efaec31cee4f0f93195775729a96f5ae4784a", "publishedAt": "2020-04-24T08:06:00Z", "content": "However, that was still well down on the average in the past year of 3042.\r\nIt wouldn't be winter in Melbourne without footy and authorities have given a cautious green light to the AFL to proceed with plans to resume playing in June.\r\n\"There's a chance,\" Chi… [+2351 chars]"}, {"source": {"id": null, "name": "Webbyfeed.com"}, "author": "Tiffany J. London", "title": "Scientists Portrayed A Black Hole Merger With Different Masses - Webby Feed", "description": "LIGO and Virgo are two gravitational wave detectors that proved incredibly in handy during the past years, reporting an impressive number of black hole mergers to the scientists. Recently, a...", "url": "https://www.webbyfeed.com/scientists-portrayed-a-black-hole-merger-with-different-masses/8009/", "urlToImage": "https://www.webbyfeed.com/wp-content/uploads/2020/04/black-hole-merger-1024x575.jpg", "publishedAt": "2020-04-24T06:37:33Z", "content": "LIGO and Virgo are two gravitational wave detectors that proved incredibly in handy during the past years, reporting an impressive number of black hole mergers to the scientists. Recently, a new exciting discovery was made when the two detectors registered a … [+1817 chars]"}, {"source": {"id": "xinhua-net", "name": "Xinhua Net"}, "author": null, "title": "China recollects first satellite stories after entering space for 50 years - Xinhua | English.news.cn - Xinhua", "description": null, "url": "http://www.xinhuanet.com/english/2020-04/24/c_139004657.htm", "urlToImage": null, "publishedAt": "2020-04-24T06:34:57Z", "content": "BEIJING, April 24 (Xinhua) -- The Space Day of China, which falls on April 24, is more special this year, as it marks the 50th anniversary of the successful launch of Dongfanghong-1, the country's first man-made satellite.\r\nIt listed China as the fifth countr… [+3412 chars]"}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Ethelene Bailey", "title": "Plate Tectonics Might Have Started 3 Billion Years Ago - Dual Dove", "description": "Plate tectonics are as crucial as Earth itself. They are the reason Earth looks the way it does, with all the mountains and the composition of the atmosphere. The significance of tectonic plates Te…", "url": "https://www.dualdove.com/plate-tectonics-might-have-started-3-billion-years-ago/9704/", "urlToImage": "https://www.dualdove.com/wp-content/uploads/2020/04/plate-tectonics.png", "publishedAt": "2020-04-24T06:33:45Z", "content": "Plate tectonics are as crucial as Earth itself. They are the reason Earth looks the way it does, with all the mountains and the composition of the atmosphere.\r\nThe significance of tectonic plates\r\nTectonic plates are responsible for bringing Earths viscera to… [+2943 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Will Dunham", "title": "Bugged: Earth's land insects are disappearing - Sydney Morning Herald", "description": "A new study, based on 166 sets of data covering 1676 sites in 41 countries dating as far back as 1925, is the most ubiquitous and diverse animals on the planet.", "url": "https://www.smh.com.au/world/north-america/bugged-earth-s-land-insects-are-disappearing-20200424-p54n1n.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.4266%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_109/t_crop_custom/q_86%2Cf_auto/15ba50e3cb5339dfb4b7dc30131f59b6d0d4d406", "publishedAt": "2020-04-24T06:08:47Z", "content": "Other bugs are disappearing at a rate of just under 1 per cent a year, with lots of variation from place to place, according to the study published in the journal Science.\r\nThat's a tinier population decline than found by some smaller localised studies, which… [+2180 chars]"}, {"source": {"id": "xinhua-net", "name": "Xinhua Net"}, "author": null, "title": "China's first Mars exploration mission named Tianwen-1 - Xinhua | English.news.cn - 新华网", "description": null, "url": "http://www.xinhuanet.com/english/2020-04/24/c_139004464.htm", "urlToImage": null, "publishedAt": "2020-04-24T05:30:20Z", "content": "BEIJING, April 24 (Xinhua) -- China's first Mars exploration mission has been named Tianwen-1, announced the China National Space Administration (CNSA) on Friday, China's Space Day.\r\nThe name comes from the long poem \"Tianwen,\" meaning Questions to Heaven, wr… [+2775 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Sam Baron, The Conversation", "title": "Creator of Wolfram Alpha Has a Bold Plan to Find a New Fundamental Theory of Physics - ScienceAlert", "description": "Stephen Wolfram is a cult figure in programming and mathematics. He is the brains behind Wolfram Alpha, a website that tries to answer questions by using algorithms to sift through a massive database of information. He is also responsible for Mathema", "url": "https://www.sciencealert.com/the-mathematician-behind-wolfram-alpha-wants-to-rebuild-the-universe", "urlToImage": "https://www.sciencealert.com/images/2020-04/processed/wolfram_physics_project_model_cover_1024.jpg", "publishedAt": "2020-04-24T04:19:46Z", "content": "Stephen Wolfram is a cult figure in programming and mathematics. He is the brains behind Wolfram Alpha, a website that tries to answer questions by using algorithms to sift through a massive database of information. He is also responsible for Mathematica, a c… [+5520 chars]"}, {"source": {"id": null, "name": "Uq.edu.au"}, "author": null, "title": "If we can put a man on the Moon, we can save the Great Barrier Reef - UQ News", "description": "Scientists recently confirmed the Great Barrier Reef suffered another serious bleaching event last summer - the third in five years. Dramatic intervention to save the natural wonder is clearly needed.", "url": "https://www.uq.edu.au/news/article/2020/04/if-we-can-put-man-moon-we-can-save-great-barrier-reef", "urlToImage": "https://www.uq.edu.au/news/filething/get/220332/fish-378286_640.jpg", "publishedAt": "2020-04-24T04:14:49Z", "content": "Paul Hardisty, Australian Institute of Marine Science; Christian Roth, CSIRO; Damien Burrows, James Cook University; David Mead, Australian Institute of Marine Science; Ken Anthony, Australian Institute of Marine Science; Line K Bay, Australian Institute of M… [+7209 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/emma-nobel/10908446, https://www.abc.net.au/news/sian-johnson/9938166", "title": "Australian scientist names tiny Antarctic creature after climate activist Greta Thunberg - ABC Science Online", "description": "An 82-year-old Australian scientist said it seemed appropriate to name a newly discovered species after Greta Thunberg, given its habitat.", "url": "https://www.abc.net.au/news/2020-04-24/scientist-names-tiny-antarctic-creature-after-greta-thunberg/12176788", "urlToImage": "https://www.abc.net.au/news/image/12182236-16x9-700x394.jpg", "publishedAt": "2020-04-24T04:12:50Z", "content": "Posted \r\nApril 24, 2020 14:12:50\r\nAn Australian scientist has named a tiny six-legged creature that lives in a harsh Antarctic environment after Swedish climate change activist Greta Thunberg.\r\nKey points:\r\n<ul><li>An Australian scientist has identified a new… [+3914 chars]"}, {"source": {"id": null, "name": "Bodyandsoul.com.au"}, "author": "Juna Xu", "title": "Coronavirus: How to properly wear a face mask to protect against COVID-19 - Body and Soul", "description": "So many people are incorrectly wearing face masks, so here’s how to wear one properly", "url": "https://www.bodyandsoul.com.au/health/health-advice/so-many-people-are-incorrectly-wearing-face-masks-so-heres-how-to-wear-one-properly/news-story/25e9907b6c88d9ecc287b1fece958ae9", "urlToImage": "https://cdn.newsapi.com.au/image/v1/dc5191c9f35669f4563625fea5e080c3", "publishedAt": "2020-04-24T00:46:45Z", "content": "Face masks are only effective at protecting yourself, and others, from COVID-19 if worn and used correctly. Here's how to do it properly.Unless you work in the medical field, there’s a good chance you haven’t had much reason to wear a face mask.\r\nBut we’re li… [+3686 chars]"}, {"source": {"id": null, "name": "Nippon.com"}, "author": null, "title": "Japanese Probe Brings New Insight into Strong Winds on Venus - Nippon.com", "description": "Tokyo, April 24 (Jiji Press)--Data from the Japanese Venus probe Akatsuki have brought a new insight into the …", "url": "https://www.nippon.com/en/news/yjj2020042400122/", "urlToImage": "https://www.nippon.com/en/ncommon/images/no-image.png", "publishedAt": "2020-04-24T00:34:00Z", "content": "Tokyo, April 24 (Jiji Press)--Data from the Japanese Venus probe Akatsuki have brought a new insight into the superstrong winds blowing on the second planet from the sun, a research team has said.\r\nVenus has a thick atmosphere that rotates 60 times as fast as… [+725 chars]"}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Paula Tudoran", "title": "Icelandic Genomes Explain Neanderthal Legacy of Europeans - Dual Dove", "description": "Researchers at deCODE genetics and fellow collaborators from the Max Planck Institute and universities in Denmark and Iceland have published the first study to use a whole genome sequence data from…", "url": "https://www.dualdove.com/icelandic-genomes-explain-neanderthal-legacy-of-europeans/9688/", "urlToImage": "https://www.dualdove.com/wp-content/uploads/2020/04/neanderthals-96507_1280.jpg", "publishedAt": "2020-04-24T00:33:45Z", "content": "Researchers at deCODE genetics and fellow collaborators from the Max Planck Institute and universities in Denmark and Iceland have published the first study to use a whole genome sequence data from across a population in order to analyze the current successio… [+2510 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Ryan F. Mandelbaum", "title": "Incredible New Map Of Moon Shows Its Every Nook And Cranny - Gizmodo Australia", "description": "Hot damn, look at the freakin’ Moon!...", "url": "https://www.gizmodo.com.au/2020/04/incredible-new-map-of-moon-shows-its-every-nook-and-cranny/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/cs6us3kfcfkgyebpqjkp.jpg", "publishedAt": "2020-04-24T00:05:00Z", "content": "Hot damn, look at the freakin Moon!\r\nScientists led by the United States Geological Surveys Corey Fortezzo have released what they call the Unified Geologic Map of the Moonan authoritative map of lunar geology. The map, built from six Apollo-era maps and upda… [+2147 chars]"}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Morgan McFall-Johnsen", "title": "NASA designed a cheap, simple ventilator to prevent shortages during a potential second wave of COVID-19 infections - Business Insider Australia", "description": "NASA engineers have designed a mass-producible ventilator tailored to coronavirus patients, and it could get emergency approval from the Food and Drug Administration by the weekend.", "url": "https://www.businessinsider.com.au/nasa-designs-cheap-simple-coronavirus-ventilator-mass-production-2020-4", "urlToImage": "https://i.insider.com/5ea20998d553f81450392d86", "publishedAt": "2020-04-23T23:42:00Z", "content": "NASA engineers have designed a mass-producible ventilator tailored to coronavirus patients, and it could get emergency approval from the Food and Drug Administration by the weekend.\r\nA team of engineers at the Jet Propulsion Laboratory in Pasadena, California… [+3995 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Jonathan Amos - Science correspondent", "title": "Hubble telescope celebrates 30 years of stunning science - Yahoo News Australia", "description": "Three decades on from its launch, the orbiting observatory is still producing cutting-edge research.", "url": "https://news.yahoo.com/hubble-telescope-celebrates-30-years-232747718.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/M2nSYupKSLwpgSC_FhyDXA--~B/aD01NDk7dz05NzY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-gb/bbc_us_articles_995/9f4c5b3c0eb0cbe7b1ec46b664ac965d", "publishedAt": "2020-04-23T23:27:00Z", "content": "It's 30 years ago to the day that the Hubble Space Telescope was launched.\r\nFamously blighted by blurred vision at the outset, the observatory was eventually repaired and upgraded.\r\nThe remarkable pictures it has taken of planets, stars, and galaxies have tra… [+5182 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "CNN", "title": "Giant asteroid flying by Earth next week looks like it’s wearing a face mask - 7NEWS.com.au", "description": "An observatory has spotted a strange discovery on an asteroid moving at 31,000 kilometres per hour.", "url": "https://7news.com.au/technology/space/giant-asteroid-flying-by-earth-next-week-looks-like-its-wearing-a-face-mask-c-996383", "urlToImage": "https://images.7news.com.au/publication/C-996383/eabb10d23c8251bad6488e8cb59e7588768c10ab-16x9-x0y0w779h438.jpg?imwidth=1024", "publishedAt": "2020-04-23T23:08:10Z", "content": "An asteroid estimated to be 1.9 km wide will fly by Earth next week, but its not expected to collide with our planet.\r\nAnd if an asteroid could be aware of such things, it appears to be wearing a face mask in deference to the pandemic, according to new images… [+2912 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Christine Fisher", "title": "Portable 'cold plasma' wand prototype could destroy germs in seconds - Yahoo Finance Australia", "description": "Engineers from the University of Michigan created a plasma jet wand to disinfect hospital rooms.", "url": "https://au.news.yahoo.com/university-of-michigan-plasma-disinfectant-224810558.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/FzfoSiVJAFzB0AqCB33mmw--~B/aD0xMDM4O3c9MTU2MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-04/384e1960-85a2-11ea-b7ff-d98f4d14c9be", "publishedAt": "2020-04-23T22:48:00Z", "content": "A team of engineering professors from the University of Michigan have created a plasma jet wand that they believe could quickly and easily disinfect hospital rooms. The ion-emitting device looks something like a Ghostbusters proton packs, and its plasma beam … [+1574 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "SpaceX Starship SN4 is almost ready for its turn on the test stand - CNET", "description": "Work on the latest iteration of Elon Musk's Mars rocket is progressing rapidly despite some setbacks.", "url": "https://www.cnet.com/news/spacex-starship-sn4-prototype-is-almost-ready-for-its-turn-on-test-stand/", "urlToImage": "https://cnet3.cbsistatic.com/img/2KikJHi6_rqxqZ7Q1cdda9lDvkI=/2020/01/17/879db969-f89e-481c-8da2-f64a815b0c50/spacexstarship.jpg", "publishedAt": "2020-04-23T22:47:02Z", "content": "While many businesses in Texas are shuttered due to the COVID-19 pandemic, SpaceX has been busy assembling the latest Starship prototype at its Boca Chica development facility. The early version of Elon Musk's Mars rocket has the serial number SN4, and he sha… [+1175 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mars' seasons compared to other planets including Earth - AccuWeather", "description": "Why do we have seasons? It's because our planet is tilted on its axis just enough so that we have four seasons, as Earth continues its orbit around the Sun. ...", "url": "https://www.youtube.com/watch?v=aKQdl3blWR0", "urlToImage": "https://i.ytimg.com/vi/aKQdl3blWR0/hqdefault.jpg", "publishedAt": "2020-04-23T20:56:13Z", "content": "Why do we have seasons? It's because our planet is tilted on its axis just enough so that we have four seasons, as Earth continues its orbit around the Sun. But what about other planets?"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Ryan F. Mandelbaum", "title": "Astronomers Think They Have Found A Whole Population Of Rocks From Outside The Solar System - Gizmodo Australia", "description": "Astronomers think they’ve found an entire population of asteroids originating from outside our solar system, according to a new paper....", "url": "https://www.gizmodo.com.au/2020/04/astronomers-think-theyve-found-a-whole-population-of-rocks-from-outside-the-solar-system/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/a0ewweyv2lurrk0bc4wr.jpg", "publishedAt": "2020-04-23T19:05:00Z", "content": "Astronomers think theyve found an entire population of asteroids originating from outside our solar system, according to a new paper.\r\nThe objects at the centre of this investigation arent new discoveries. Called the Centaurs, theyre mysterious asteroids that… [+3260 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Revealed that Planet Shell Began To Move 3.2 Billion Years Ago - Somag News", "description": "Researchers made a new discovery of the planet’s motion as a result of their work in the Pilbara region in Western Australia. The motion of the planet crust, as it was announced, dates back 200 million years before it was known. It was discovered that the tec…", "url": "https://www.somagnews.com/revealed-planet-shell-began-move-3-2-billion-years-ago/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2020/04/30-17-e1587666856154.jpg", "publishedAt": "2020-04-23T18:34:00Z", "content": "Researchers made a new discovery of the planet’s motion as a result of their work in the Pilbara region in Western Australia. The motion of the planet crust, as it was announced, dates back 200 million years before it was known.\r\nIt was discovered that the te… [+1984 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Rosie McCall", "title": "Levels of Ocean Biodiversity Have Barely Changed for Hundreds of Millions of Years, Scientists Say - Newsweek", "description": "Scientists have analyzed fossils from the Cambrian explosion 540 million years ago to the present day to explore levels of marine biodiversity over time.", "url": "https://www.newsweek.com/levels-ocean-biodiversity-remained-stable-hundred-1499842", "urlToImage": "https://d.newsweek.com/en/full/1584157/fish-swimming-through-coral.jpg", "publishedAt": "2020-04-23T18:10:25Z", "content": "Levels of biodiversity in the world's oceans have remained virtually unchanged for hundreds of millions of years, according to a new study published in Science.\r\nThe conclusion that marine biodiversity has stayed stable over time and not mushroomed over the l… [+3686 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Better obesity treatments may lie ahead after discovery of key protein structure - Mirage News", "description": "A USC-led international team of scientists has found the precise shape of a key player in human metabolism, which could lead the way to better treatments...", "url": "https://www.miragenews.com/better-obesity-treatments-may-lie-ahead-after-discovery-of-key-protein-structure/", "urlToImage": "https://cdn1.miragenews.com/wp-content/uploads/2017/11/news-developments-e1509835949106.jpg", "publishedAt": "2020-04-23T18:04:13Z", "content": "A USC-led international team of scientists has found the precise shape of a key player in human metabolism, which could lead the way to better treatments for obesity and other metabolic diseases.\r\nFor the study, the scientists focused on a protein in the brai… [+3924 chars]"}, {"source": {"id": null, "name": "Sciencemag.org"}, "author": null, "title": "How waves and turbulence maintain the super-rotation of Venus' atmosphere - Science Magazine", "description": "The solid surface of Venus rotates very slowly, once every 243 days, but its thick atmosphere circles the planet in just 4 days. This phenomenon, known as super-rotation, requires a continuous input of angular momentum, from an unknown source, to overcome fri…", "url": "https://science.sciencemag.org/content/368/6489/405.full", "urlToImage": "https://science.sciencemag.org/content/368/6489/405/F1.large.jpg", "publishedAt": "2020-04-23T17:48:40Z", "content": "By Takeshi Horinouchi, Yoshi-Yuki Hayashi, Shigeto Watanabe, Manabu Yamada, Atsushi Yamazaki, Toru Kouyama, Makoto Taguchi, Tetsuya Fukuhara, Masahiro Takagi, Kazunori Ogohara, Shin-ya Murakami, Javier Peralta, Sanjay S. Limaye, Takeshi Imamura, Masato Nakamu… [+62 chars]"}, {"source": {"id": null, "name": "Globalhealthnewswire.com"}, "author": "News", "title": "How Birds Evolved Big Brains - Global Health News Wire", "description": "An international team of evolutionary biologists and paleontologists have reconstructed the evolution of the avian brain using a massive dataset of brain volumes from dinosaurs, extinct birds like Archaeopteryx and the Great Auk, and modern birds. The study, …", "url": "https://globalhealthnewswire.com/research/2020/04/23/how-birds-evolved-big-brains/%20", "urlToImage": "", "publishedAt": "2020-04-23T16:51:00Z", "content": "The Eurasian Jay, a member of the large-brain bird family Corvidae.\r\nAn international team of evolutionary biologists and paleontologists have reconstructed the evolution of the avian brain using a massive dataset of brain volumes from dinosaurs, extinct bird… [+2871 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "NASA Interns to Speak with NASA Astronaut Aboard Space Station - Mirage News", "description": "Expedition 63 crewmember Chris Cassidy of NASA gives a thumbs while his Sokol suit pressure is checked ahead of his launch on a Soyuz rocket with Anatoly...", "url": "https://www.miragenews.com/nasa-interns-to-speak-with-nasa-astronaut-aboard-space-station/", "urlToImage": "https://www.nasa.gov/sites/default/files/styles/full_width/public/thumbnails/image/jsc2020e017095_0.jpg?itok=cpyIrjWt", "publishedAt": "2020-04-23T16:18:11Z", "content": "Students participating in NASA internships will have an opportunity next week to talk with a NASA astronaut aboard the International Space Station. The Earth-to-space call will air live at 12:05 p.m. EDT Tuesday, April 28, on NASA television and the agencys w… [+1405 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Darrell Etherington", "title": "MIT develops machine-washable sensors that embed in clothing for constant vital sign monitoring - Yahoo Finance Australia", "description": "MIT has developed a new type of lightweight sensor that can be integrated into flexible fabrics, including the kinds of polyesters often used in athletic wear, to provide constant monitoring of vital signs including body temperature, heart rate and respirator…", "url": "https://au.finance.yahoo.com/news/mit-develops-machine-washable-sensors-150142223.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/jbQ9z0kA26brCiEMFG1LGA--~B/aD0xMjc4O3c9MTkxNztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/techcrunch_350/cd7e573e06e2a00883b75a21f75b5571", "publishedAt": "2020-04-23T15:01:00Z", "content": "MIT has developed a new type of lightweight sensor that can be integrated into flexible fabrics, including the kinds of polyesters often used in athletic wear, to provide constant monitoring of vital signs including body temperature, heart rate and respirator… [+2502 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Protecting Australia's reptiles and amphibians with global impact - Phys.org", "description": "Ecosystems around the world rely on reptiles and amphibians. They play a crucial role as part of the food web—as predator and prey—and, sometimes, a role in pollination and dispensing seeds. Frogs provide a good sign of ecosystem health due to their sensitivi…", "url": "https://phys.org/news/2020-04-australia-reptiles-amphibians-global-impact.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/protectingau.jpg", "publishedAt": "2020-04-23T14:11:25Z", "content": "Ecosystems around the world rely on reptiles and amphibians. They play a crucial role as part of the food webas predator and preyand, sometimes, a role in pollination and dispensing seeds. Frogs provide a good sign of ecosystem health due to their sensitivity… [+4322 chars]"}, {"source": {"id": null, "name": "News-medical.net"}, "author": null, "title": "Scientists demonstrate new brain-inspired learning mechanism - News-Medical.Net", "description": "The origin of machine and deep learning algorithms, which increasingly affect almost all aspects of our life, is the learning mechanism of synaptic (weight) strengths connecting neurons in our brain.", "url": "https://www.news-medical.net/news/20200423/Scientists-demonstrate-new-brain-inspired-learning-mechanism.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2019%2f5%2ffuturistic_techno_design_on_background_of_supercomputer_data_center_-_Image_-_Timofeev_Vladimir_M1_402c068791b640469e416c4f55d84afe-620x480.jpg", "publishedAt": "2020-04-23T14:09:18Z", "content": "The origin of machine and deep learning algorithms, which increasingly affect almost all aspects of our life, is the learning mechanism of synaptic (weight) strengths connecting neurons in our brain.\r\nAttempting to imitate these brain functions, researchers b… [+3127 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Darrell Etherington", "title": "Elon Musk says Starlink internet private beta to begin in roughly three months, public beta in six - Yahoo Finance Australia", "description": "SpaceX  CEO and founder Elon Musk has shared more details about when in 2020 we can expect the company's Starlink low-latency, high-bandwidth satellite internet service to actually be available to customers.  The initial beta test will apply to those located …", "url": "https://au.finance.yahoo.com/news/elon-musk-says-starlink-internet-124728701.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/DGme4rFdq53qpcN0cPmlPw--~B/aD01NDA7dz05NjA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/techcrunch_350/45f90cc8a067cbf116a7733aa256b32d", "publishedAt": "2020-04-23T12:47:00Z", "content": "SpaceX CEO and founder Elon Musk has shared more details about when in 2020 we can expect the company's Starlink low-latency, high-bandwidth satellite internet service to actually be available to customers. He said on Twitter that a private beta for Starlink … [+2134 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "Microplastics found in Antarctic sea ice - Herald Sun", "description": "Microplastics, such as those used in commercial fishing, have been discovered in Antarctic sea ice in what researchers say is a first.", "url": "https://www.news.com.au/national/breaking-news/microplastics-found-in-antarctic-sea-ice/news-story/d71c48b27c81563b6aac5d7b4a2f2e46", "urlToImage": "", "publishedAt": "2020-04-23T10:25:00Z", "content": "Microplastics, such as those used in commercial fishing, have been discovered in Antarctic sea ice in what researchers say is a first.\r\nThe study, led by an Institute for Marine and Antarctic Studies team, found 96 microplastic particles in an ice core collec… [+1588 chars]"}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Rada Mateescu", "title": "Devastating Simulations Shock The World – Arctic Summers Will Bring Massive Change - Dual Dove", "description": "For millions and millions of years, the Arctic observed a ritual that remained the same over time. During the winters, the Arctic Sea Ice is expanding, and sub-zero polar temperatures freeze waters…", "url": "https://www.dualdove.com/devastating-simulations-shock-the-world-arctic-summers-will-bring-massive-change/9664/", "urlToImage": "https://www.dualdove.com/wp-content/uploads/2020/04/Large_WW22430.jpg", "publishedAt": "2020-04-23T09:24:53Z", "content": "For millions and millions of years, the Arctic observed a ritual that remained the same over time. During the winters, the Arctic Sea Ice is expanding, and sub-zero polar temperatures freeze waters in their place.\r\nDuring the summer, the ice pack is retreatin… [+1987 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Researchers create seismic stress map of North America - Mirage News", "description": "A new stress map that reveals the forces acting on the planet's crust will contribute to safer energy exploration, updated seismic hazard maps and...", "url": "https://www.miragenews.com/researchers-create-seismic-stress-map-of-north-america/", "urlToImage": "https://news-media.stanford.edu/wp-content/uploads/2020/04/21100123/NAStressMap_1-555x369.jpg", "publishedAt": "2020-04-23T09:02:14Z", "content": "A new stress map that reveals the forces acting on the planet’s crust will contribute to safer energy exploration, updated seismic hazard maps and improved knowledge about the Earth.\r\n By Danielle Torrent Tucker \r\nHow do mountains form? What forces are needed… [+4604 chars]"}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Tanya Thompson", "title": "The Origins of Life – The Visible Universe Might Be Barren, New Research Revealed - Dual Dove", "description": "The way life emerged on Earth mimics the way the Universe was created. You can call it the Big Bang of life. Just like the Big Bang was the explosion of a singularity the size of a peach, the same …", "url": "https://www.dualdove.com/the-origins-of-life-the-visible-universe-might-be-barren-new-research-revealed/9650/", "urlToImage": "https://www.dualdove.com/wp-content/uploads/2020/04/origins-of-life-visible-universe-might-be-barren.jpg", "publishedAt": "2020-04-23T08:36:41Z", "content": "The way life emerged on Earth mimics the way the Universe was created. You can call it the Big Bang of life. Just like the Big Bang was the explosion of a singularity the size of a peach, the same way a non-living entity exploded into life.\r\nAnd just like the… [+2368 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "It takes water to give volcanoes fire and fury - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-23T08:01:00Z", "content": null}, {"source": {"id": null, "name": "Spacedaily.com"}, "author": null, "title": "Hungry galaxies grow fat on the flesh of their neighbors - Space Daily", "description": "Canberra, Australia (SPX) Apr 23, 2020 - \r\nGalaxies grow large by eating their smaller neighbours, new research reveals. \r\n\r\nExactly how massive galaxies attain their size is poorly understood, not least because they swell over billions of", "url": "https://www.spacedaily.com/reports/Hungry_galaxies_grow_fat_on_the_flesh_of_their_neighbors_999.html", "urlToImage": "https://www.spxdaily.com/images-bg/simulation-dark-matter-density-overlayed-gas-density-gas-channels-connecting-central-galaxy-and-satellite-neighbour-galaxies-bg.jpg", "publishedAt": "2020-04-23T06:47:37Z", "content": "Galaxies grow large by eating their smaller neighbours, new research reveals.\r\nExactly how massive galaxies attain their size is poorly understood, not least because they swell over billions of years. But now a combination of observation and modelling from re… [+3940 chars]"}, {"source": {"id": null, "name": "Nanowerk.com"}, "author": null, "title": "New dual-action coating keeps bacteria from cross-contaminating fresh produce - Nanowerk", "description": "Over the course of their journey from the open fields to the produce displays at grocery stores, fresh vegetables and fruits can sometimes become contaminated by microorganisms. These items can then spoil other produce, spreading the contamination further and…", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=54991.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id54991.jpg", "publishedAt": "2020-04-23T05:46:59Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NASA captures Earth for more than 50 years - KCRA News", "description": "As the world celebrates 50 years of Earth Day, one agency has been processing information and images for all those decades to improve the planet. NASA has be...", "url": "https://www.youtube.com/watch?v=DedinBELMiA", "urlToImage": "https://i.ytimg.com/vi/DedinBELMiA/maxresdefault.jpg", "publishedAt": "2020-04-23T03:07:42Z", "content": "As the world celebrates 50 years of Earth Day, one agency has been processing information and images for all those decades to improve the planet. NASA has been taking Earth Day to heart every day over past the five decades. Get the full story in the video abo… [+233 chars]"}, {"source": {"id": null, "name": "Pattayamail.com"}, "author": "Pattaya Mail", "title": "The man who wanted to fly on Mars - Pattaya Mail", "description": "Even before this interviewer can finish the question, “Did anyone ever tell you this was a crazy idea?” Bob Balaram jumps in: “Everyone. All the time.” Loading… This “crazy idea” is the Mars Helicopter, currently at Kennedy Space Center waiting to hitch a rid…", "url": "https://www.pattayamail.com/pattayamail/the-man-who-wanted-to-fly-on-mars-296566", "urlToImage": "https://www.pattayamail.com/wp-content/uploads/2020/04/1376-tec-The-man-who-wanted-to-fly-on-Mars-1.jpg", "publishedAt": "2020-04-23T03:00:00Z", "content": "Mars Helicopters chief engineer Bob Balaram and the Mars Helicopter on a test stand. The technology demonstration will ride aboard NASAs Perseverance rover to the Red Planet. (Credits: NASA/JPL-Caltech)\r\nEven before this interviewer can finish the question, D… [+8457 chars]"}, {"source": {"id": null, "name": "Digitaltrends.com"}, "author": "Luke Dormehl", "title": "Caretaker bots and starfish assassins: Meet the tech that protects Earth’s reefs - Digital Trends", "description": "Coral reefs are dying everywhere. Can technology help reverse this tragic trend? Here are six examples of cutting edge tech that might assist with exactly that.", "url": "https://www.digitaltrends.com/features/saving-coral-reefs-with-technology/", "urlToImage": "https://icdn4.digitaltrends.com/image/digitaltrends/larvalbot-feature-1200x630-c-ar1.91.jpg", "publishedAt": "2020-04-22T23:23:00Z", "content": "Coral reefs are dying everywhere. As the home of the most diverse ecosystems on Earth, that’s bad news. Coral reefs protect our coastlines from waves and tropical storms, while also sheltering huge numbers of marine organisms. Their decline is the result of p… [+7064 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Genelle Weule", "title": "Count stars in the Southern Cross during Dark Sky Week and help measure light pollution around the world - ABC News", "description": "How many stars can you see in the Southern Cross? If you count them tonight you will contribute to the worldwide effort to map light pollution.", "url": "https://www.abc.net.au/news/science/2020-04-23/count-stars-in-the-southern-cross-and-measure-light-pollution/12166374", "urlToImage": "https://www.abc.net.au/cm/rimage/12166330-16x9-large.jpg?v=2", "publishedAt": "2020-04-22T21:37:27Z", "content": "How many stars in the Southern Cross can you see from your backyard or balcony? \r\nIf you count them tonight you can contribute to a project that maps light pollution across the globe.\r\nThe idea is to get as many people around the world to look at the stars on… [+5317 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Human vaccine trials begin! What happens next? - Coronacast - ABC News", "description": "Human trials for a coronavirus vaccine have begun in the UK, and it's all actions go. Depending on what happens there’s a long way to go before you might be innoculated. Usually the process could take years, but this isn’t your usual vaccine trial. On today's…", "url": "https://www.abc.net.au/radio/programs/coronacast/human-vaccine-trials-begin-what-happens-next/12174900", "urlToImage": "https://www.abc.net.au/cm/rimage/12027716-16x9-large.jpg?v=2", "publishedAt": "2020-04-22T20:14:02Z", "content": "Human trials for a coronavirus vaccine have begun in the UK, and it's all actions go.\r\nDepending on what happens theres a long way to go before you might be innoculated.\r\nUsually the process could take years, but this isnt your usual vaccine trial.\r\nCoronacas… [+423 chars]"}, {"source": {"id": null, "name": "Ucsd.edu"}, "author": null, "title": "Researchers Make Gemstones with Salty, Soapy Water for the First Time - UC San Diego Health", "description": "Collaborators from the University of California San Diego and New York University used salt, soap and water to make “bling” with a proposed novel experiment by UC San Diego’s Jérémie Palacci to form ionic colloidal crystals from common colloids.", "url": "https://ucsdnews.ucsd.edu/pressrelease/researchers-make-gemstones-with-salty-soapy-water-for-the-first-time", "urlToImage": null, "publishedAt": "2020-04-22T20:11:14Z", "content": "Colloidal gemstones. Fixed ionic colloidal crystals can be safely dried and manipulated. Figure shows a collection of millimeter-sized iridescent monocrystalline solids embedded in a refractive index matching epoxy resin. Scale bar 100µm. Figure courtesy of J… [+5140 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Ryan F. Mandelbaum", "title": "The Trouble With Stephen Wolfram's New 'Fundamental Theory Of Physics' - Gizmodo Australia", "description": "[image url='https://i.kinja-img.com/gawker-media/image/upload/t_original/rg7pdwonecaq7uusrpyf.jpg' size='xlarge' licence='Image: NASA' caption='A galaxy cluster containing one to two thousand galaxies. Composite image made by NASA’s Hubble, Spitzer and Chandr…", "url": "https://www.gizmodo.com.au/2020/04/the-trouble-with-stephen-wolframs-new-fundamental-theory-of-physics/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/rg7pdwonecaq7uusrpyf.jpg", "publishedAt": "2020-04-22T19:56:00Z", "content": "Stephen Wolfram, computer scientist, physicist, and CEO of software company Wolfram Research (behind Wolfram Alpha and Mathematica) made headlines this week when he launched the Wolfram Physics Project. The blog post announcing the project explains that he an… [+7147 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NASA Science Live: Earth Day at Home - NASA", "description": "Happy Earth Day! Join NASA experts on the 50th anniversary of Earth Day as we explore important discoveries made about our planet, talk with teams creating g...", "url": "https://www.youtube.com/watch?v=79Zjr3WRXLw", "urlToImage": "https://i.ytimg.com/vi/79Zjr3WRXLw/maxresdefault.jpg", "publishedAt": "2020-04-22T19:00:10Z", "content": null}, {"source": {"id": null, "name": "China.org.cn"}, "author": "", "title": "New research shows plate tectonics on earth prior to 3.2 billion years ago - China.org.cn", "description": null, "url": "http://www.china.org.cn/world/Off_the_Wire/2020-04/23/content_75964966.htm", "urlToImage": null, "publishedAt": "2020-04-22T18:54:09Z", "content": "WASHINGTON, April 22 (Xinhua) -- A new research published on Wednesday indicates that plate tectonics may have been well underway on Earth more than 3.2 billion years ago.\r\nThe research added a new dimension to an ongoing debate about exactly when plate tecto… [+1190 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Lyrid meteor shower 2020 will light up the sky amid COVID-19 pandemic - Micky News", "description": "The Lyrid is the oldest known meteor shower which dates back to 2700 years ago. The world’s best night sky show will peak tonight.", "url": "https://micky.com.au/lyrid-meteor-shower-2020-will-light-up-the-sky-amid-covid-19-pandemic/", "urlToImage": "https://micky.com.au/wp-content/uploads/2020/04/694940094001_5765589499001_5765570952001-vs1.jpg", "publishedAt": "2020-04-22T17:13:35Z", "content": "With governments imposing lockdowns all over the world, chances are people are getting really bored inside their homes. However, being stuck there for a little longer means getting the chance to witness the best light show on the planet.\r\nThe Lyrid meteor sho… [+2562 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is peaking now - CNET", "description": "Catch a potential shooting star extravaganza. You probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-peaking-now/", "urlToImage": "https://cnet4.cbsistatic.com/img/-WsCPctbUquc2p-74Do1b4zv5Hk=/756x567/2018/04/19/93919e6f-0d80-4646-a5a5-f3466f233aaa/464-lyrids-main.jpg", "publishedAt": "2020-04-22T17:13:15Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started Thursday and will stay active for about 10 days, with the peak viewing window late Tuesday into … [+2475 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Prehistoric Crocodiles Imitating Dolphins and Whales in the Ocean - Somag News", "description": "The extinct creature, Thalattosuchia, has adapted its body into an aerodynamic shape and developed an inner ear to adapt to marine life. Thalattosuchia, which lived from the Early Jurassic to the Early Cretaceous, are also known as sea crocodiles. It has been…", "url": "https://www.somagnews.com/prehistoric-crocodiles-imitating-dolphins-whales-ocean/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2020/04/10-21-e1587574470996.jpg", "publishedAt": "2020-04-22T16:54:00Z", "content": "The extinct creature, Thalattosuchia, has adapted its body into an aerodynamic shape and developed an inner ear to adapt to marine life. Thalattosuchia, which lived from the Early Jurassic to the Early Cretaceous, are also known as sea crocodiles.\r\nIt has bee… [+2337 chars]"}, {"source": {"id": null, "name": "Newsdio.com"}, "author": null, "title": "Scientists discover the disappearing exoplanet is just an asteroid junk cloud - NewsDio", "description": "In 2014, an alleged exoplanet that was bright and vivid since 2004 mysteriously disappeared. Now, new research reveals that the exoplanet was not an exoplanet at all, but just a large asteroid debris cloud, explaining how it could \"disappear.\" Law of Disappea…", "url": "https://newsdio.com/scientists-discover-the-disappearing-exoplanet-is-just-an-asteroid-junk-cloud/96907/", "urlToImage": "https://newsdio.com/wp-content/uploads/2020/03/17-new-exoplanets-discovered-by-a-Canadian-astronomy-student.jpg", "publishedAt": "2020-04-22T11:33:00Z", "content": "In 2014, an alleged exoplanet that was bright and vivid since 2004 mysteriously disappeared. Now, new research reveals that the exoplanet was not an exoplanet at all, but just a large asteroid debris cloud, explaining how it could \"disappear.\" Law of Disappea… [+1958 chars]"}]}