{"status": "ok", "totalResults": 44, "articles": [{"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Astronomers discover a new type of asteroid that behaves like a comet - Micky News", "description": "Recently, astronomers are able to track and study a relatively new type of asteroid that behaves like a comet.", "url": "https://micky.com.au/astronomers-discover-a-new-type-of-asteroid-that-behaves-like-a-comet/", "urlToImage": "https://micky.com.au/wp-content/uploads/2020/05/uns-asteroid.jpg", "publishedAt": "2020-05-25T10:22:48Z", "content": "Astronomers have a clear distinction between an asteroid and a comet. A comet usually has a tail, and traverses long and looping orbits. On the other hand, asteroids are dry, rocky, and follows an or… [+2800 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "NASA astronauts complete dress rehearsal for groundbreaking SpaceX launch - ABC Technology and Games", "description": "NASA astronauts Doug Hurley and Bob Behnken will be part of the first attempt by a private company to send astronauts into orbit, and it is going to be \"quite a show\", according Elon Musk's SpaceX.", "url": "https://www.abc.net.au/news/2020-05-25/spacex-and-nasa-launch-commerical-flight-space-station-elon-musk/12283778", "urlToImage": "https://www.abc.net.au/cm/rimage/12283806-16x9-large.jpg?v=5", "publishedAt": "2020-05-25T08:48:00Z", "content": "Two US astronauts have completed a dress rehearsal ahead of their groundbreaking journey to the International Space Station in a partnership between NASA and SpaceX.\r\n<ul><li>The astronauts will be t… [+2462 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Michelle Starr", "title": "Bumblebees Bite Plants to Make Them Bloom, Scientists Find - ScienceAlert", "description": "When you wake up hungry and there's nothing to eat, the most sensible thing to do is acquire snacks. In this, bumblebees are no different from humans. If they wake early from hibernation to find a scarcity of pollen, the insects have a cunning way to", "url": "https://www.sciencealert.com/bumblebees-bite-plants-to-make-them-bloom", "urlToImage": "https://www.sciencealert.com/images/2020-05/processed/bee-climb_1024.jpg", "publishedAt": "2020-05-25T08:08:15Z", "content": "When you wake up hungry and there's nothing to eat, the most sensible thing to do is acquire snacks. In this, bumblebees are no different from humans. If they wake early from hibernation to find a sc… [+4007 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Green blooms: Patches of Antarctica’s snow is turning green with algae due to global warming - Firstpost", "description": "When the algae bloom in a large area simultaneously, it turns the snow bright green and it can be spotted from space.", "url": "https://www.firstpost.com/tech/science/green-blooms-patches-of-antarcticas-snow-is-turning-green-with-algae-due-to-global-warming-8405321.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/05/8-snow_algae_anchorage_antarctica_2018_davey_gray_crop2-2560x2660.jpg", "publishedAt": "2020-05-25T07:47:31Z", "content": "FP TrendingMay 25, 2020 13:09:59 IST\r\nResearchers have found that the microscopic algae that grow on the surface of snow along the Antarctic Peninsula are going to further spread with rising temperat… [+2596 chars]"}, {"source": {"id": null, "name": "Macaubusiness.com"}, "author": null, "title": "China space programme targets July launch for Mars mission | - Macau Business", "description": "International, MNA | China is targeting a July launch for its ambitious plans for a Mars mission which will include landing a remote-controlled robot on the surface", "url": "https://www.macaubusiness.com/china-space-programme-targets-july-launch-for-mars-mission/", "urlToImage": null, "publishedAt": "2020-05-25T07:28:59Z", "content": "China is targeting a July launch for its ambitious plans for a Mars mission which will include landing a remote-controlled robot on the surface of the red planet, the company in charge of the project… [+1451 chars]"}, {"source": {"id": null, "name": "Happymag.tv"}, "author": "Emily Elvish", "title": "Astronomer confirms that humans aren't a miracle and Earth would've always evolved life - Happy Mag", "description": "Sorry guys. Astronomer David Kipping has crunched the numbers, and he's here to confirm that humans ain't that great. Life would've evolved on Earth anyway.", "url": "https://happymag.tv/astronomer-confirms-that-humans-arent-a-miracle-and-earth-wouldve-always-evolved-life/", "urlToImage": "https://happymag.tv/wp-content/uploads/2020/05/earth-large.jpg", "publishedAt": "2020-05-25T06:51:30Z", "content": "Our scientist friends are back at it again, reminding us that we aren’t that special. We’ve always thought that life on Earth was a bit of a miracle, and intelligent life even more so. Haha, think ag… [+1431 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Amanda Kooser", "title": "Demo-2: How to watch SpaceX launch NASA astronauts to the ISS on May 27 - CNET", "description": "A Falcon 9 rocket is scheduled to carry two astronauts from US soil to the space station. The last time the US launched astronauts from within its borders was 2011.", "url": "https://www.cnet.com/how-to/demo-2-how-to-watch-spacex-launch-two-nasa-astronauts-to-the-iss-on-may-27/", "urlToImage": "https://cnet1.cbsistatic.com/img/t6UuanKQ754DQrr3WueksGJJ62Q=/2020/05/13/a8dcb28d-8613-45f3-b42a-544b2a3c55ca/crewdragondockingart.jpg", "publishedAt": "2020-05-25T05:20:48Z", "content": "This artist's impression shows Crew Dragon docking to the ISS.\r\nSpaceX\r\nIn July 2011, NASA's Space Shuttle Atlantis launched from Florida to the International Space Station, the last time humans trav… [+8160 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "by Ivan Couronne", "title": "Rocketman (and woman): Elon and Gwynne, the pair who made SpaceX - Yahoo News Australia", "description": "Space Exploration Technologies Corp. -- commonly known as SpaceX -- is slated to send two astronauts into space on Wednesday. Despite not yet being 20 years old, the company has already developed a creation myth: on September 28, 2008, its first rocket Falcon…", "url": "https://au.news.yahoo.com/rocketman-woman-elon-gwynne-pair-made-spacex-015521900--spt.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/H.SBKbWk15XfRuXMMkMQOA--~B/aD0zNTI7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_AU/Sports/Agence-FrancePresse/563cab9e7346151907eec4a0214ab44bd7fd2329.jpg", "publishedAt": "2020-05-25T02:06:53Z", "content": "Space Exploration Technologies Corp. -- commonly known as SpaceX -- is slated to send two astronauts into space on Wednesday. Despite not yet being 20 years old, the company has already developed a c… [+4661 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Russian military satellite launch spawns space-junk fireball over Australia (video) - Space.com", "description": "The satellite is apparently part of Russia's missile-warning network.", "url": "https://www.space.com/russia-satellite-launch-space-junk-fireball.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/gX7JkCf5N9Z6cSiRxeZvci-1200-80.jpg", "publishedAt": "2020-05-25T01:13:00Z", "content": "EPIC!! Check out this incredible vision captured by Mel Aldridge not long ago at Cashmore near Portland! We're getting plenty of reports. @abcmelbourne pic.twitter.com/1KuldCy6OJMay 22, 2020\r\nRussia … [+2223 chars]"}, {"source": {"id": null, "name": "Syfy.com"}, "author": "Elizabeth Rayne", "title": "This is what happens when you use a selfie stick to make a scientific discovery - SYFY WIRE", "description": "There are many instruments used to make scientific discoveries, from picks and chisels to powerful hi-res electron microscopes. Now that honor can also go to a selfie stick. It wasn’t a typical selfie stick that Russian paleontologist Nikolay G. Zverkov used …", "url": "https://www.syfy.com/syfywire/selfie-stick-makes-scientific-discovery", "urlToImage": "https://www.syfy.com/sites/syfy/files/styles/1200x680/public/2020/05/fossil1.jpg", "publishedAt": "2020-05-25T00:06:31Z", "content": "There are many instruments used to make scientific discoveries, from picks and chisels to powerful hi-res electron microscopes. Now that honor can also go to a selfie stick.\r\nIt wasnt a typical selfi… [+3358 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Allison Gasparini", "title": "New Research Shows Electroceutical Fabric Eradicates Coronavirus Infectivity On Contact - Forbes", "description": "There’s a risk that a person removing their face mask could touch viral particles latched onto the outside and further spread the coronavirus. A study by scientists from Indiana University suggests a fabric which eradicates the infectivity of viruses on conta…", "url": "https://www.forbes.com/sites/allisongasparini/2020/05/24/new-research-shows-electroceutical-fabric-eradicates-coronavirus-infectivity-on-contact/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1208749506%2F0x0.jpg", "publishedAt": "2020-05-24T23:46:49Z", "content": "3D visualization of the coronavirus. Researchers from Indiana University recently published a study ... [+] which showed demonstrated how coronavirus infectivity is eradicated on exposure to an elect… [+3460 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": null, "title": "How Fish Use Their Spines To Fend Off Hungry Seals - Gizmodo Australia", "description": "What price are you willing to pay for food? For most of us, that’s a question about money. But what if the cost were actual pain, injury and death? For some seals and dolphins, this a real risk when hunting. We took a close look at a New Zealand (or...", "url": "https://www.gizmodo.com.au/2020/05/how-fish-use-their-spines-to-fend-off-hungry-seals/", "urlToImage": "https://counter.theconversation.com/content/133627/count.gif?distributor=republish-lightbox-basic", "publishedAt": "2020-05-24T21:16:56Z", "content": "What price are you willing to pay for food? \r\nFor most of us, thats a question about money. But what if the cost were actual pain, injury and death? For some seals and dolphins, this a real risk when… [+4703 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": null, "title": "We Should Probably Talk About The Huge Wildfires In Siberia Right Now - Gizmodo Australia", "description": "It’s Northern Hemisphere spring in an era of rapid climate change so that means Russia is being lit up by monster fires. But in an era of coronavirus, a confluence of factors has made the wildfires even worse. Russia has had a rough go of it this year. It set…", "url": "https://www.gizmodo.com.au/2020/05/we-should-probably-talk-about-the-huge-wildfires-in-siberia-right-now/", "urlToImage": null, "publishedAt": "2020-05-24T21:06:03Z", "content": "Its Northern Hemisphere spring in an era of rapid climate change so that means Russia is being lit up by monster fires. But in an era of coronavirus, a confluence of factors has made the wildfires ev… [+2579 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Mike Wehner", "title": "Scientists solve the mystery of why some coral changes color when stressed - BGR", "description": "Coral bleaching occurs when ocean waters get too warm, driving algae away from the reef and prompting a change in the coral. Sometimes, bleaching leaves reefs pale white, while other times the coral takes on bright, neon shades. Researchers believe this is du…", "url": "https://bgr.com/2020/05/24/coral-bleaching-colorful-protection/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2020/05/screen-shot-2020-05-22-at-3.23.14-pm-e1590179069601.png", "publishedAt": "2020-05-24T20:22:01Z", "content": "<ul><li>Coral bleaching occurs when ocean waters get too warm, driving algae away from the reef and prompting a change in the coral. </li><li>Sometimes, bleaching leaves reefs pale white, while other… [+3169 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jon Fingas", "title": "Space Station receives the last of NASA's science racks after 19 years - Yahoo Finance Australia", "description": "NASA has sent the last of its science racks to the International Space Station, marking the end of an era.", "url": "https://au.news.yahoo.com/iss-receives-last-nasa-science-rack-194934307.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/0NW4pKE9Vx7ylZvej40Hww--~B/aD0xMDY3O3c9MTYwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-05/cc7223e0-9de7-11ea-bfef-cd75aa0eb105", "publishedAt": "2020-05-24T19:49:00Z", "content": "One of the longer chapters of the International Space Station has come to a close. NASA has sent the last of its 11 ExPRESS (Expedite the Processing of Experiments to the Space Station) science racks… [+822 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": null, "title": "Freaky ‘Active’ Object In Jupiter’s Orbit Is First Of Its Kind Seen By Astronomers - Gizmodo Australia", "description": "It’s neither an asteroid nor a comet but something in between. It’s also parked within Jupiter’s orbit, making this object the first of its kind to ever be detected. Say hello to 2019 LD2, the only active Jupiter Trojan known to science. Trojans are a large g…", "url": "https://www.gizmodo.com.au/2020/05/freaky-active-object-in-jupiters-orbit-is-first-of-its-kind-seen-by-astronomers/", "urlToImage": null, "publishedAt": "2020-05-24T18:05:23Z", "content": "Its neither an asteroid nor a comet but something in between. Its also parked within Jupiters orbit, making this object the first of its kind to ever be detected.\r\nSay hello to 2019 LD2, the only act… [+3433 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": null, "title": "Genius Bees Force Plants To Bloom By Biting Them - Gizmodo Australia", "description": "Bumblebees need pollen from flowers to survive. But increasingly, the creatures are waking up earlier in the year when flowers have not yet bloomed due to the climate crisis. Nature appears to be finding a way, though. According to research published in Scien…", "url": "https://www.gizmodo.com.au/2020/05/genius-bees-force-plants-to-bloom-by-biting-them/", "urlToImage": null, "publishedAt": "2020-05-24T17:04:14Z", "content": "Bumblebees need pollen from flowers to survive. But increasingly, the creatures are waking up earlier in the year when flowers have not yet bloomed due to the climate crisis. Nature appears to be fin… [+3532 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Vast Mineral Deposits in the Atacama Desert Seen From Space - SciTechDaily", "description": "The Copernicus Sentinel-2 mission takes us over part of Chile's Atacama Desert, which is bound on the west by the Pacific and on the east by the Andes. The Atacama is considered one of the driest places on Earth – there are some parts of the desert where rain…", "url": "https://scitechdaily.com/vast-mineral-deposits-in-the-atacama-desert-seen-from-space/", "urlToImage": "https://scitechdaily.com/images/Atacama-Minerals-scaled.jpg", "publishedAt": "2020-05-24T16:44:00Z", "content": "A specific area in the Tarapacá Region, in northern Chile,  where some of the largest caliche deposits can be found, is featured in this image captured on June 26, 2019. It is here where nitrates, li… [+1887 chars]"}, {"source": {"id": null, "name": "Digitaltrends.com"}, "author": "Georgina Torbet", "title": "How NASA’s Perseverance Rover will search for life on Mars - Digital Trends", "description": "NASA's Perseverance rover is headed to Mars, and when it arrives, it'll unleash a battery of high-tech instruments to search for signs of life.", "url": "https://www.digitaltrends.com/features/nasa-perseverance-rover-life-on-mars-search/", "urlToImage": "https://icdn5.digitaltrends.com/image/digitaltrends/mars_rover_2005013_2000x1333-1200x630-c-ar1.91.png", "publishedAt": "2020-05-24T13:52:24Z", "content": "Genevieve Poblano/Digital Trends\r\nWhen NASA’s Perseverance rover launches this summer, it will face one of the most ambitious missions in any space exploration project to date: To search for evidence… [+13549 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Masterful Illusionist: The European Viper Uses Cloak-and-Dazzle to Escape Predators - SciTechDaily", "description": "Research of the University of Jyväskylä demonstrates that the characteristic zig-zag pattern on a viper's back performs seemingly opposing functions during a predation event. At first, the zig-zag pattern helps the snake remain undetected. But upon exposure, …", "url": "https://scitechdaily.com/masterful-illusionist-the-european-viper-uses-cloak-and-dazzle-to-escape-predators/", "urlToImage": "https://scitechdaily.com/images/Viper-Snake-Zig-Zag-Pattern.jpg", "publishedAt": "2020-05-24T13:31:17Z", "content": "The viper’s zig-zag pattern helps the snake remain undetected, it also provides a warning of the snake’s dangerous defense and it can produce an illusionary effect that may hide the snake’s movement … [+4285 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "NASA, SpaceX get ready for historic crewed mission to ISS - Daijiworld.com", "description": "", "url": "http://www.daijiworld.com/news/newsDisplay.aspx?newsID=711885", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2020-05-24T11:18:24Z", "content": "Washington, May 24 (IANS): Preparations are in full swing as NASA is to launch two of its astronauts to the International Space Station (ISS) in collaboration with its commercial partner SpaceX on Ma… [+1982 chars]"}, {"source": {"id": null, "name": "Scoopwhoop.com"}, "author": "Smrutisnat Jena", "title": "Global Warming Is Causing Antarctica's Snow To Turn Green. Here's Why - ScoopWhoop", "description": "Although microscopic, scientists say they're able to see the 'green snow' from space when the algae bloom en masse.", "url": "https://www.scoopwhoop.com/news/global-warming-is-causing-antarcticas-snow-to-turn-green/", "urlToImage": "https://s4.scoopwhoop.com/anj2/5eca077a60c060497d5d17f1/5ac044b7-9297-400f-919f-f06a1010ecd5.jpg", "publishedAt": "2020-05-24T11:11:44Z", "content": "Global warming is changing the face of this planet, forcing environmental changes indicative of larger problems at hand. \r\nSource: CNET \r\nCase in point, Antarctica. The south pole hasn't had any vege… [+1130 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Daniel Oberhaus", "title": "On the Moon, astronaut pee will be a hot commodity - Ars Technica", "description": "Urine can be used for landing pads, gardens, and drinking water. But will there be enough to go around?", "url": "https://www.wired.com/story/on-the-moon-astronaut-pee-will-be-a-hot-commodity/", "urlToImage": "https://media.wired.com/photos/5ec6fb698971d7886fd36024/191:100/w_1280,c_limit/astronaut-urine-elena-lacey-wired-science.jpg", "publishedAt": "2020-05-24T10:56:00Z", "content": "Ever since President Donald Trump directed NASA to get boots on the moon by 2024, the agency and its partners have been hard at work trying to make it happen. Late last month, NASA awarded contracts … [+3470 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "Physicists produced a giant entangled state of 15 trillion atoms - Tech Explorist", "description": "In a study, ICFO, HDU and UPV researchers report the production of a giant entangled state that may help medical researchers detect extremely faint magnetic signals from the brain.", "url": "https://www.techexplorist.com/giant-entangled-state-15-trillion-atoms/32491/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/05/glass-cell.jpg", "publishedAt": "2020-05-24T08:30:06Z", "content": "Quantum technologies use entanglement to outperform classical technologies, and often employ strong cooling and isolation to protect entangled entities from decoherence by random interactions. \r\nIn a… [+4205 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "Earth’s magnetic field is gradually weakening - Tech Explorist", "description": "Scientists are using data from ESA’s Swarm constellation to improve our understanding of South Atlantic Anomaly as Earth’s magnetic field is weakening.", "url": "https://www.techexplorist.com/earth-magnetic-field-gradually-weakening/32480/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/05/Swarm_constellation.jpg", "publishedAt": "2020-05-24T06:15:48Z", "content": "Earth’s magnetic field is essential to life on our planet. It is a mind-boggling and dynamic force that shields us from cosmic radiation and charged particles from the Sun. The magnetic field is gene… [+2254 chars]"}, {"source": {"id": null, "name": "Inverse.com"}, "author": "Michael Grose, Julie Arblaster", "title": "The future of Australia could be more like 'Mad Max' than you think: climate study - Inverse", "description": "Climate scientists use mathematical models to project the Earth’s future under a warming world, but a group of the latest models have included unexpectedly high values for a measure called “climate sensitivity”.", "url": "https://www.inverse.com/science/australia-weather-2100", "urlToImage": "https://imgix.bustle.com/uploads/getty/2020/5/23/9a71a9cb-8a98-43e8-abb8-71046bd386b1-getty-1224127149.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "publishedAt": "2020-05-24T02:05:02Z", "content": "Climate scientists use mathematical models to project the Earths future under a warming world, but a group of the latest models has included unexpectedly high values for a measure called climate sens… [+5417 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "CNN", "title": "Astronomers make incredibly discovery of massive disk galaxy similar to our own - 7NEWS.com.au", "description": "The discovery is challenging a long-held belief in the world of astronomy.", "url": "https://7news.com.au/technology/space/astronomers-make-incredibly-discovery-of-massive-disk-galaxy-similar-to-our-own-c-1055812", "urlToImage": "https://images.7news.com.au/publication/C-1055812/41f2fe6439496bad68e7ef822ebdffca6fe21c0a-16x9-x0y0w1280h720.jpg?imwidth=1024", "publishedAt": "2020-05-24T01:56:34Z", "content": "Astronomers have spotted a massive disk galaxy, not unlike our own, that formed 12.5 billion years ago when our 13.8 billion-year-old universe was only a tenth of its current age.\r\nBut according to w… [+4643 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "David Nield", "title": "A 'Code' in Starlight Reflected Off Distant Planets Could Reveal if They're Habitable - ScienceAlert", "description": "The search for life elsewhere in the Universe goes on, but such is the vastness of space, any helpful tips that can point us towards the planets most likely to be habitable are really useful – and scientists think they've just discovered another cl", "url": "https://www.sciencealert.com/surface-reflections-of-starlight-on-distant-planets-could-reveal-which-ones-are-habitable", "urlToImage": "https://www.sciencealert.com/images/2020-05/processed/planet-bands_1024.jpg", "publishedAt": "2020-05-23T22:07:42Z", "content": "The search for life elsewhere in the Universe goes on, but such is the vastness of space, any helpful tips that can point us towards the planets most likely to be habitable are really useful and scie… [+3275 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "A Flickering Signal Detected from the Black Hole in the Heart of Our Galaxy - Somag News", "description": "Scientists have noticed a strange signal that was not noticed before in the center of the Milky Way galaxy. The unidentified signal is thought to come from the supermassive black hole in the heart of our galaxy. According to the research published by the rese…", "url": "https://www.somagnews.com/flickering-signal-detected-black-hole-heart-galaxy/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2020/05/16-2-e1590271137929.jpeg", "publishedAt": "2020-05-23T21:59:00Z", "content": "Scientists have noticed a strange signal that was not noticed before in the center of the Milky Way galaxy. The unidentified signal is thought to come from the supermassive black hole in the heart of… [+2083 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Digital Staff", "title": "Mysterious object lit up the sky across southern Australia was a rocket - 7NEWS.com.au", "description": "Many residents feared they were witnessing a plane exploding and others thought it was a meteorite. But experts say it was something else.", "url": "https://7news.com.au/technology/space/mysterious-object-lit-up-the-sky-across-southern-australia-was-a-rocket-c-1055605", "urlToImage": "https://images.7news.com.au/publication/C-1055605/ec3ade1c26716d6bc29bbd3d3322c7b598740e61-16x9-x0y0w1920h1080.png?imwidth=1024", "publishedAt": "2020-05-23T21:52:49Z", "content": "Stargazers reached for their astronomy guides after a mysterious flying object lit up the night sky over southern Australia.\r\nMany Victorian residents feared they were witnessing a plane exploding on… [+1122 chars]"}, {"source": {"id": null, "name": "961.com.au"}, "author": "tiashadebray", "title": "There Will Be Shooting Stars Visible All Over Australia Tonight - WSFM", "description": "Does anyone else feel like there are more astrological phenomenons happening these last few months than usual? Or are we only paying attention to them now that we’re bored at home… The Eta Aquarids Meteor is set to peak tonight/tomorrow at 4AM so if you’re co…", "url": "https://www.961.com.au/lifestyle/there-will-be-shooting-stars-visible-all-over-australia-tonight-were-talking-at-least-50-per-hour/", "urlToImage": "https://www.wsfm.com.au/wp-content/uploads/sites/11/2020/05/photo-of-sky-during-sunset-1937687.jpg?crop=0px,0px,4128px,2320px&resize=2400,1350&quality=75", "publishedAt": "2020-05-23T20:58:48Z", "content": "Does anyone else feel like there are more astrological phenomenons happening these last few months than usual?\r\nOr are we only paying attention to them now that we’re bored at home…\r\nThe Eta Aquarids… [+346 chars]"}, {"source": {"id": null, "name": "Clicklancashire.com"}, "author": null, "title": "Corals creating own sunscreen for protection against rising sea temperatures, scientists say - ClickLancashire", "description": "", "url": "https://clicklancashire.com/2020/05/23/corals-creating-own-sunscreen-for-protection-against-rising.html", "urlToImage": null, "publishedAt": "2020-05-23T20:29:32Z", "content": "Unfortunately for them, even the slightest increase in water temperature can be fatal for their relationship by expelling algae from the coral's tissue and revealing its white and vulnerable skeleton… [+3718 chars]"}, {"source": {"id": null, "name": "Satelliteprome.com"}, "author": null, "title": "China launches new experimental crew spacecraft on Long March 5B rocket - SatelliteProME.com", "description": "Specially developed for China's manned space programme, Long March-5B will be mainly used to launch the modules of the space station.", "url": "https://satelliteprome.com/news/china-launches-new-experimental-crew-spacecraft-on-long-march-5b-rocket/", "urlToImage": "https://satelliteprome.com/wp-content/uploads/2020/05/china.jpg", "publishedAt": "2020-05-23T20:29:17Z", "content": "Specially developed for China's manned space programme, Long March-5B will be mainly used to launch the modules of the space station.\r\nChina’s new large carrier rocket Long March-5B made its maiden f… [+1160 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Artificial Intelligence Helps Researchers Up-Cycle Waste Carbon With Record Efficiency - SciTechDaily", "description": "Researchers at University of Toronto Engineering and Carnegie Mellon University are using artificial intelligence (AI) to accelerate progress in transforming waste carbon into a commercially valuable product with record efficiency. They leveraged AI to speed …", "url": "https://scitechdaily.com/artificial-intelligence-helps-researchers-up-cycle-waste-carbon-with-record-efficiency/", "urlToImage": "https://scitechdaily.com/images/Electrolyzers-Convert-Waste-CO2-into-Commercially-Valuable-Chemicals.jpg", "publishedAt": "2020-05-23T19:38:24Z", "content": "Researchers from U of T Engineering and Carnegie Mellon University are using electrolyzers like this one to convert waste CO2 into commercially valuable chemicals. Their latest catalyst, designed in … [+5122 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Statue of Liberty-sized ASTEROID barrelling towards Earth as six space rocks set to skim past - RT", "description": "A huge asteroid that’s roughly the size of the Statue of Liberty is set to fly past Earth on Saturday. The enormous object is among a clutch of six space rocks that will whizz past our planet this weekend.", "url": "https://www.rt.com/news/489586-six-asteroids-approach-earth/", "urlToImage": "https://cdni.rt.com/files/2020.05/article/5ec9449485f540189834fa42.jpg", "publishedAt": "2020-05-23T16:00:42Z", "content": "The largest of the half-dozen space visitors is dubbed 2020 JX and it measures up to 100 meters in diameter, making it around the same size as the icon on Liberty island in New York. \r\nNASA’s Center … [+1434 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Shannon Stirone", "title": "Space Photos of the Week: Keeping an Eye on Jupiter's Storms - WIRED", "description": "NASA's Juno orbiter, along with its Hubble and Gemini telescopes, will help scientists better understand the planet's atmosphere.", "url": "https://www.wired.com/story/space-photos-keeping-an-eye-on-jupiters-storms/", "urlToImage": "https://media.wired.com/photos/5ec85271448999d7ae47db3f/191:100/w_1280,c_limit/photo_space_juno_2_PIA21972.jpg", "publishedAt": "2020-05-23T14:00:00Z", "content": "Jupiter has one of the most bizarre atmospheres in the entire solar system. Gas giants like Jupiter are believed to have some kind of semi-solid core, but are mostly made of gas like hydrogen, helium… [+3273 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Rafi Letzter", "title": "Strange ice formations may have tricked physicists into seeing mysterious particles that weren't there - Livescience.com", "description": "What if one of the strangest, most unsettling findings in particle physics turned out to be an illusion?", "url": "https://www.livescience.com/mysterious-physics-particles-or-a-trick-of-the-ice.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/SDr6QG4EWh2CxgogiaLvYJ-1200-80.jpg", "publishedAt": "2020-05-23T11:00:00Z", "content": "What if one of the strangest, most unsettling findings in particle physics turned out to be an illusion?\r\nSince March 2016, two mysterious signals from Antarctica have baffled researchers. Twice now,… [+16356 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Rhett Allain", "title": "What’s Up With the Funny-Looking Moons in ‘Onward’? - WIRED", "description": "Yes, I know this is a fantasy movie. That shouldn’t stop us from thinking about the real causes of lunar phases.", "url": "https://www.wired.com/story/whats-up-with-the-funny-moons-in-onward/", "urlToImage": "https://media.wired.com/photos/5ec5aa66a1675c5749a138ea/191:100/w_1280,c_limit/Science_phases_MCDONWA_WD028.jpg", "publishedAt": "2020-05-23T11:00:00Z", "content": "Let me just say, the Pixar movie Onward was fun. Its your classic kids go on quest/gain new confidence story, but set in a world with elves and dragons and smartphonesyou know, magic stuff like that.… [+1595 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Mike Wall", "title": "Colonizing Mars may require humanity to tweak its DNA - Livescience.com", "description": "Genetic engineering may be a big part of our future on Mars.", "url": "https://www.livescience.com/mars-colony-human-genetic-engineering-tardigrades.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/HujsT6p9sejFZ29wUD9rrL-1200-80.jpg", "publishedAt": "2020-05-23T11:00:00Z", "content": "If humanity is ever going to settle down on Mars\r\n, we may need to become a little less human.\r\nCrewed missions to Mars, which NASA wants to start flying in the 2030s, will be tough on astronauts\r\n, … [+5556 chars]"}, {"source": {"id": null, "name": "News-daily.com"}, "author": "Ashley Strickland, CNN", "title": "Astronomers spot 'twist' evidence of a baby planet in a young star system - News-Daily.com", "description": "A spiral marks the spot where a baby planet is forming around a star in a young system 520 light-years from Earth in the Auriga constellation. The planet birth is", "url": "https://www.news-daily.com/news/world_nation/astronomers-spot-twist-evidence-of-a-baby-planet-in-a-young-star-system/article_6b85107e-5fa3-51b0-9f7e-cdfd8815aa36.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/news-daily.com/content/tncms/assets/v3/editorial/3/3c/33cab32d-579e-5400-915e-eb0b9f6a32f8/5ec522edb7692.image.jpg?resize=1120%2C630", "publishedAt": "2020-05-22T16:09:33Z", "content": "A spiral marks the spot where a baby planet is forming around a star in a young system 520 light-years from Earth in the Auriga constellation. The planet birth is visible in new images and observatio… [+3711 chars]"}, {"source": {"id": null, "name": "Thenational.ae"}, "author": "AP", "title": "Great Barrier Reef: coral bleaching again sweeping Australian site - The National", "description": "Scientists say bleaching has struck all three regions of the world’s largest coral reef system", "url": "https://www.thenational.ae/world/oceania/great-barrier-reef-coral-bleaching-again-sweeping-australian-site-1.1003131", "urlToImage": "https://www.thenational.ae/image/policy:1.1003140:1587282113/image.jpg?f=16x9&q=0.6&w=1200&$p$f$q$w=70c86c9", "publishedAt": "2020-04-08T04:36:13Z", "content": "An aerial survey of the Great Barrier Reef shows coral bleaching is sweeping across the area off the east of Australia for the third time in five years.\r\nBleaching has struck all three regions of the… [+5082 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Jamie Ross", "title": "Trailblazing NASA Mathematician Katherine Johnson Dies at 101 - The Daily Beast", "description": "Johnson calculated the trajectory of man’s first trip to the moon, and her work remains vital to human spaceflight today.", "url": "https://www.thedailybeast.com/katherine-johnson-nasa-trailblazer-and-hidden-figures-mathematician-inspiration-dies-at-the-age-of-101", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2916,w_5184,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1582557258/RTX1VP9Z_h1oaky", "publishedAt": "2020-02-24T15:24:21Z", "content": "The legendary NASA mathematician Katherine Johnson died Monday at the age of 101, the U.S. space agency has announced. Johnson developed mathematical equations that were essential to NASAs early effo… [+888 chars]"}, {"source": {"id": null, "name": "Gizmoposts24.com"}, "author": "Kaustuv Chattopadhyay", "title": "Wolf moon eclipse kicks off the first of 13 full moons in 2020 - Gizmo Posts 24", "description": "2020 starts with a meteor shower in the very first month The year has started with a penumbral lunar eclipse during the full moon, on Friday. Although lunar eclipses occur only when there is a full moon however a total lunar eclipse is very different from a t…", "url": "https://gizmoposts24.com/technology/wolf-moon-eclipse-kicks-off-the-first-of-13-full-moons-in-2020-48994/", "urlToImage": "https://gizmoposts24.com/wp-content/uploads/2020/01/Wolf-Moon-Eclipse-on-January-10.png", "publishedAt": "2020-01-11T03:16:13Z", "content": "2020 starts with a meteor shower in the very first month\r\nThe year has started with a penumbral lunar eclipse during the full moon, on Friday. Although lunar eclipses occur only when there is a full … [+1452 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": null, "title": "Just How Big Can A Tsunami Get? - Gizmodo Australia", "description": "Video: Tsunamis are very probably the scariest natural disaster out there because they ravage everything in their path. But learning about how big they can get makes tsunamis even scarier. It’s just ridiculous. It’s like skyscraper big, man. You see, the tsun…", "url": "https://www.gizmodo.com.au/2017/01/just-how-big-can-a-tsunami-get/", "urlToImage": null, "publishedAt": "2017-02-16T03:48:44Z", "content": "Video: Tsunamis are very probably the scariest natural disaster out there because they ravage everything in their path. But learning about how big they can get makes tsunamis even scarier. Its just r… [+799 chars]"}]}