{"status": "ok", "totalResults": 37, "articles": [{"source": {"id": null, "name": "Ibtimes.sg"}, "author": "https://www.ibtimes.sg/reporters/nirmal-narayanan", "title": "This 400 million-year-old fossil could shed light on key stages of plant evolution - International Business Times, Singapore Edition", "description": "Researchers revealed that these fossils that shed light on plant evolution date back to the Devonian period", "url": "https://www.ibtimes.sg/this-400-million-year-old-fossil-could-shed-light-key-stages-plant-evolution-44429", "urlToImage": "https://data.ibtimes.sg/en/full/29509/amazon-fire.jpg", "publishedAt": "2020-05-05T10:31:15Z", "content": "A new study conducted by researchers on fossils that are currently stored in the Smithsonian National Museum of Natural History could shed light on key stages of plant evolution. During the study, researchers identified an ancient plant species, that is not l… [+2055 chars]"}, {"source": {"id": "xinhua-net", "name": "Xinhua Net"}, "author": null, "title": "China's new large rocket Long March-5B makes maiden flight - Xinhua | English.news.cn - Xinhua", "description": null, "url": "http://www.xinhuanet.com/english/2020-05/05/c_139032475.htm", "urlToImage": null, "publishedAt": "2020-05-05T10:28:25Z", "content": "China's new large carrier rocket Long March-5B blasts off from Wenchang Space Launch Center in south China's Hainan Province, May 5, 2020. China's new large carrier rocket Long March-5B made its maiden flight Tuesday, sending the trial version of China's new-… [+1017 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Brett Gibbons", "title": "Fake pet purchase victims conned out of £280,000 during coronavirus lockdown scams - Wales Online", "description": "Crooks are posting ads online for animals they do not have and they will ask people for cash to secure a purchase in advance", "url": "https://www.walesonline.co.uk/news/uk-news/fake-pet-purchase-victims-conned-18199644", "urlToImage": "https://i2-prod.birminghammail.co.uk/incoming/article18166878.ece/ALTERNATES/s1200/0_puppies.jpg", "publishedAt": "2020-05-05T10:21:12Z", "content": "Animal lovers hoping to purchase a pet during the coronavirus lockdown have been conned out of more than £280,000 in the past two months.\r\nSo far, 669 people have lost a combined total of £282,686 in March and April, after putting down deposits for pets they … [+3741 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "An artificial \"tongue\" of gold to taste maple syrup - Mirage News", "description": "It's said that maple syrup is Quebec's liquid gold. Now scientists at Université de Montréal have found a way to use real gold - in the form of...", "url": "https://www.miragenews.com/an-artificial-tongue-of-gold-to-taste-maple-syrup/", "urlToImage": "https://nouvelles.umontreal.ca/fileadmin/_processed_/csm_Simon_Forest_erable_Cr_Amelie_Philibert_745d1f1df9.jpg", "publishedAt": "2020-05-05T10:20:11Z", "content": "It’s said that maple syrup is Quebec’s liquid gold. Now scientists at Université de Montréal have found a way to use real gold – in the form of nanoparticles – to quickly find out how the syrup tastes.\r\nThe new method – a kind of artificial tongue – is valida… [+3744 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Imaging technology allows visualization of nanoscale structures inside whole cells - India Gone Viral", "description": "A 3-D super-resolution reconstruction of dendrites in primary visual cortex. Purdue University innovators created an imaging tool that allows visualization of nanoscale structures inside whole cells a", "url": "https://indiagoneviral.com/science/2020/05/05/imaging-technology-allows-visualization-of-nanoscale-structures-inside-whole-cells/51162/india-gone-viral/", "urlToImage": "https://scx1.b-cdn.net/csz/news/800/2020/1-imagingtechn.jpg", "publishedAt": "2020-05-05T09:04:26Z", "content": "Since Robert Hooke’s first description of a cell in Micrographia 350 years ago, microscopy has played an important role in understanding the rules of life.\r\nHowever, the smallest resolvable feature, the resolution, is restricted by the wave nature of light. T… [+5523 chars]"}, {"source": {"id": null, "name": "Theguardian.comscience"}, "author": "Graham Readfearn", "title": "Eta Aquarids meteor shower 2020: Australians told to look to the skies early Wednesday for best views - The Guardian", "description": "This will be a good meteor show to see from the southern hemisphere, but you’ll need to be up early, experts say. See where, when and how to watch in Australia", "url": "https://amp.theguardian.comscience/2020/may/05/australians-told-to-look-to-the-skies-early-wednesday-for-best-views-of-eta-aquariids-meteor-shower", "urlToImage": "https://i.guim.co.uk/img/media/ac6229e1c558d9ab80785ebdcd7f36b5388042bc/0_85_1280_768/master/1280.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0bc2ac2bd8539b4989ae6e79a5bf70a5", "publishedAt": "2020-05-05T08:48:00Z", "content": "If you want to see what happens when a piece of dust from the tail of a comet hits the earths atmosphere at about 60km per second, then look roughly east in the early hours of Wednesday.\r\nBetween about 2am and 5am, the annual Eta Aquarids meteor shower will p… [+3588 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Michelle Starr", "title": "New Paper Has a Wild Explanation For The Most Explosive 'Meteor Impact' on Record - ScienceAlert", "description": "In the early morning of 30 June 1908, something exploded over Siberia. The event shattered the normal stillness of the sparsely populated taiga, so powerful that it flattened an area of forest 2,150 square kilometres (830 square miles) in size - fell", "url": "https://www.sciencealert.com/scientists-have-a-new-theory-about-the-colossal-tunguska-event-explosion", "urlToImage": "https://www.sciencealert.com/images/2020-05/processed/tunguska-trees_1024.jpg", "publishedAt": "2020-05-05T07:34:45Z", "content": "In the early morning of 30 June 1908, something exploded over Siberia. The event shattered the normal stillness of the sparsely populated taiga, so powerful that it flattened an area of forest 2,150 square kilometres (830 square miles) in size - felling an es… [+4085 chars]"}, {"source": {"id": null, "name": "Pressenza.com"}, "author": "The Ecologist", "title": "Sea levels rising as Antarctica melts - Pressenza, International Press Agency", "description": "Emily Beament Earth-observing Nasa satellite bounces laser pulses off the ice surface to help measure changes in the Greenland and Antarctic ice sheets.", "url": "https://www.pressenza.com/2020/05/sea-levels-rising-as-antarctica-melts/", "urlToImage": "https://cdn77.pressenza.com/wp-content/uploads/2020/05/antarctica_7_laubeuf_fjord_webb_island.jpg", "publishedAt": "2020-05-05T06:59:31Z", "content": "Earth-observing Nasa satellite bounces laser pulses off the ice surface to help measure changes in the Greenland and Antarctic ice sheets.\r\nMelting ice from Antarctica and Greenland’s shrinking ice sheet has been responsible for a 14mm (0.55in) rise in sea le… [+2517 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/genelle-weule/7098742", "title": "Comet SWAN sky watcher's guide: what you'll see and where you'll see it - ABC Local", "description": "Australian skywatchers are in the box seat to see beautiful Comet SWAN in the early hours of tomorrow morning. We explain what you'll see, where to see it, and how to take a great photo.", "url": "https://www.abc.net.au/news/2020-05-05/comet-swan-eta-aqaiids-metor-shower-sky-watchers-guide/12215594", "urlToImage": "https://www.abc.net.au/cm/rimage/12181186-16x9-large.jpg?v=2", "publishedAt": "2020-05-05T06:20:00Z", "content": "Set your alarm clocks. Early Wednesday morning Australian sky watchers will be treated to two beautiful celestial events that will make getting out of bed before the crack of dawn worthwhile.\r\nNot only is the annual Eta Aquariid meteor shower at its peak, but… [+9172 chars]"}, {"source": {"id": null, "name": "Happymag.tv"}, "author": "Mia Montesin", "title": "Scientists discover recent tectonic activity on the near side of the moon - Happy Mag", "description": "Geologists have found activity on the near side of the moon – more activity, perhaps, than many quarantined individuals have exhibited in weeks.", "url": "https://happymag.tv/scientists-discover-recent-tectonic-activity-on-the-near-side-of-the-moon/", "urlToImage": "https://happymag.tv/wp-content/uploads/2020/05/Webp.net-resizeimage-6-2.jpg", "publishedAt": "2020-05-05T05:08:58Z", "content": "A new report from Brown University has discovered evidence of seismic activity due to strange spots scattered across the moon.\r\nScientists propose the largest, oldest, and deepest impact crater recognized on the Moon the South Pole-Aitken basin could have sha… [+1958 chars]"}, {"source": {"id": null, "name": "Thechronicle.com.au"}, "author": "Tom Gillespie, Tom Gillespie", "title": "City's first community COVID-19 testing clinic opens - Chronicle", "description": "TOOWOOMBA’S first community COVID-19 testing clinic is expected to check more than 100 people a week for the virus.", "url": "https://www.thechronicle.com.au/news/citys-first-community-covid-19-testing-clinic-open/4009179/", "urlToImage": "https://media.apnarm.net.au/media/images/2020/05/05/v3imagesbineaf981ee85ef56669bf098d7db0c5c2e-6m0x3iqvg1mrbvs7au2_ct1880x930.jpg", "publishedAt": "2020-05-05T05:00:00Z", "content": "TOOWOOMBA'S first community COVID-19 testing clinic is expected to check more than 100 people a week for the virus, as well as foster more testing in the indigenous population.\r\nCarbal Medical Services this week converted its community outreach facility on Ch… [+2207 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Ryan F. Mandelbaum", "title": "These Are The Machines Solving The Biggest Mysteries In Physics - Gizmodo Australia", "description": "Despite the stereotype of a lone, wild-haired Einstein working tirelessly at a chalkboard, today’s biggest discoveries in physics come from huge collaborations of scientists working on enormous apparatuses that can cost billions of dollars, often located in t…", "url": "https://www.gizmodo.com.au/2020/05/these-are-the-machines-solving-the-biggest-mysteries-in-physics/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/onwyp9y07hx6cgips3dw.jpg", "publishedAt": "2020-05-05T02:50:00Z", "content": "Despite the stereotype of a lone, wild-haired Einstein working tirelessly at a chalkboard, todays biggest discoveries in physics come from huge collaborations of scientists working on enormous apparatuses that can cost billions of dollars, often located in th… [+8872 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Andy Gregory", "title": "Coronavirus: Scientists divided over report recommending widespread use of face masks - The Independent", "description": "As government advisers call for nationwide use of masks, some scientists contend ‘the negative effects of outweigh the positive’", "url": "https://www.independent.co.uk/news/health/coronavirus-face-masks-effective-work-study-royal-society-research-uk-a9498796.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/05/04/23/gettyimages-1220977167.jpg", "publishedAt": "2020-05-04T23:04:37Z", "content": "A report submitted to UK government advisers advocating the widespread use of face masks to prevent further coronavirus transmissions has divided scientists.\r\nFace masks, including those that are home-made, could be an important tool in reducing Covid-19s spr… [+4347 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "George Dvorsky", "title": "NASA's Next Rover Has The Right Stuff To Hunt For Life On Mars - Gizmodo Australia", "description": "In preparation for the upcoming Perseverance mission to Mars, astrobiologists performed a dry run to see if the new rover is actually capable of finding signs of ancient life. The good news: It is, if Mars is anything like Australia....", "url": "https://www.gizmodo.com.au/2020/05/nasas-next-rover-has-the-right-stuff-to-hunt-for-life-on-mars/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/trhhpt3zw5sec5rqjznx.jpg", "publishedAt": "2020-05-04T21:50:00Z", "content": "In preparation for the upcoming Perseverance mission to Mars, astrobiologists performed a dry run to see if the new rover is actually capable of finding signs of ancient life. The good news: It is, if Mars is anything like Australia. \r\nThe Perseverance rover … [+3155 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Devin Coldewey", "title": "'This is certainly different': Astronauts on controlling the Dragon spacecraft via touchscreen - Yahoo Finance Australia", "description": "Building a brand new spacecraft means knowing when to innovate and when to stick to flight-proven methods, and for Crew Dragon, SpaceX  decided to ditch the buttons and dials and go full touchscreen.  Bob Behnken and Doug Hurley, the two astronauts soon to la…", "url": "https://au.finance.yahoo.com/news/certainly-different-astronauts-controlling-dragon-212511365.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/iNI8hrwLHV2DExy3zY7DhQ--~B/aD04MDM7dz0xNDI3O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/techcrunch_350/584b7918d360ec43207ced655d92fcd6", "publishedAt": "2020-05-04T21:25:00Z", "content": "Building a brand new spacecraft means knowing when to innovate and when to stick to flight-proven methods, and for Crew Dragon, SpaceX decided to ditch the buttons and dials and go full touchscreen. The astronauts who will fly it later this month have had lik… [+5033 chars]"}, {"source": {"id": null, "name": "Pnas.org"}, "author": null, "title": "Mechanism of water extraction from gypsum rock by desert colonizing microorganisms - pnas.org", "description": "This research provides an in-depth analysis of how microorganisms are able to survive in the world’s driest non-polar place, the Atacama Desert, Chile. We show that these organisms extract water from gypsum rocks in this desert, enabling these colonizing micr…", "url": "https://www.pnas.org/content/early/2020/04/28/2001613117", "urlToImage": "https://www.pnas.org/content/early/2020/04/28/2001613117/F1.large.jpg", "publishedAt": "2020-05-04T21:01:55Z", "content": "Abstract\r\nMicroorganisms, in the most hyperarid deserts around the world, inhabit the inside of rocks as a survival strategy. Water is essential for life, and the ability of a rock substrate to retain water is essential for its habitability. Here we report th… [+1176 chars]"}, {"source": {"id": null, "name": "Teslarati.com"}, "author": "https://www.facebook.com/13ericralph31", "title": "SpaceX’s Starship rocket program just had one of its best nights yet - Teslarati", "description": "Before dawn on May 4th, SpaceX successfully fueled a full-scale Starship prototype and (partially) tested an installed Raptor engine for the first time ever – perhaps the Starship program’s best night yet. While just a small test relative to what’s soon to co…", "url": "https://www.teslarati.com/spacex-starship-rocket-program-best-night-yet/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2020/05/Starship-Boca-Chica-050420-LabPadre-SN4-WDR-take2-2-c-1024x454.jpg", "publishedAt": "2020-05-04T20:14:20Z", "content": "Before dawn on May 4th, SpaceX successfully fueled a full-scale Starship prototype and (partially) tested an installed Raptor engine for the first time ever – perhaps the Starship program’s best night yet.\r\nWhile just a small test relative to what’s soon to c… [+3967 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Research shows how park-like tsunami defenses can provide a sustainable alternative to towering seawalls - Mirage News", "description": "Careful engineering of low, plant-covered hills along shorelines can mitigate tsunami risks with less disruption of coastal life and lower costs compared...", "url": "https://www.miragenews.com/research-shows-how-park-like-tsunami-defenses-can-provide-a-sustainable-alternative-to-towering-seawalls/", "urlToImage": "https://news-media.stanford.edu/wp-content/uploads/2020/04/27153336/TsunamiMitigation2-555x370.jpg", "publishedAt": "2020-05-04T19:04:11Z", "content": "Careful engineering of low, plant-covered hills along shorelines can mitigate tsunami risks with less disruption of coastal life and lower costs compared to seawalls.\r\n By Josie Garthwaite \r\nIn tsunami preparedness, it turns out there can be strength in beaut… [+5854 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Yessenia Funes", "title": "The Sea Ice Arctic Communities Rely On Could Disappear Three Weeks Earlier - Gizmodo Australia", "description": "Sea ice near the shore is crucial for dogsled travel for Arctic communities. But a new study shows that when temperatures crank up, it disappears faster—and it’s set to grow a lot worse by the end of the century....", "url": "https://www.gizmodo.com.au/2020/05/the-sea-ice-arctic-communities-rely-on-could-disappear-three-weeks-earlier/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/ot5vlgrnxapnc7q6yk5h.jpg", "publishedAt": "2020-05-04T16:25:00Z", "content": "Sea ice near the shore is crucial for dogsled travel for Arctic communities. But a new study shows that when temperatures crank up, it disappears fasterand its set to grow a lot worse by the end of the century.\r\nPublished in Nature Climate Change on Monday, t… [+2852 chars]"}, {"source": {"id": null, "name": "Theconversation.com"}, "author": "David Rothery", "title": "Hydrogen-breathing aliens? Study suggests new approach to finding extraterrestrial life - The Conversation UK", "description": "New research expands the pool of habitable worlds to include super-Earths with hydrogen-rich atmospheres.", "url": "https://theconversation.com/hydrogen-breathing-aliens-study-suggests-new-approach-to-finding-extraterrestrial-life-137630", "urlToImage": "https://images.theconversation.com/files/331738/original/file-20200430-42942-o1p5xu.png?ixlib=rb-1.1.0&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2020-05-04T15:01:00Z", "content": "The first time we find evidence of life on a planet orbiting another star (an exoplanet), it is probably going to be by analysing the gases in its atmosphere. With the number of known Earth-like planets growing, we could soon discover gases in an exoplanets a… [+5520 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Pursuing future of lunar habitation - Mirage News", "description": "Purdue research and testing is taking the dream of living in space beyond space stations and making the potential of future moon - and possibly Mars -...", "url": "https://www.miragenews.com/pursuing-future-of-lunar-habitation/", "urlToImage": "https://news.uns.purdue.edu/images/2020/habitat-layoutLO.jpg", "publishedAt": "2020-05-04T14:58:13Z", "content": "Note to Journalists: Photos of Shirley Dyke and a photo illustration for the release are available on Google Drive.\r\nEngineering professor works to bridge the gap between Earth, moon\r\nWEST LAFAYETTE, Ind. – Shirley Dyke doesn’t see the moon as a crater-filled… [+3307 chars]"}, {"source": {"id": null, "name": "Azocleantech.com"}, "author": null, "title": "New Membrane Efficiently Separates CO2 from a Mixture of Gases - AZoCleantech", "description": "Researchers at Newcastle University have designed a new kind of self-forming membrane to isolate carbon dioxide (CO2) from a mixture of gases.", "url": "https://www.azocleantech.com/news.aspx?newsID=27221", "urlToImage": "https://www.azocleantech.com/images/news/ImageForNews_27221_1588588593778184.png", "publishedAt": "2020-05-04T14:58:00Z", "content": "Written by AZoCleantechMay 4 2020\r\nResearchers at Newcastle University have designed a new kind of self-forming membrane to isolate carbon dioxide (CO2) from a mixture of gases.\r\nImage Credit: Newcastle University.\r\nThe membrane functions similar to a coffee … [+4045 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Neil Shaw", "title": "How to see the Starlink train of satellites in the night sky this week - Wales Online", "description": "The Elon Musk technology will be bright and visible if you know where and when to look", "url": "https://www.walesonline.co.uk/news/uk-news/how-see-starlink-train-satellites-18193953", "urlToImage": "https://i2-prod.walesonline.co.uk/news/uk-news/article18193915.ece/ALTERNATES/s1200/0_forest-katsch-E-d5IGC-_u8-unsplash.jpg", "publishedAt": "2020-05-04T13:09:58Z", "content": "A strange train of lights will soar across the night sky above the UK this week as Elon Musk's Starlink train of satellites put on an impressive display.\r\nThe lights will fly across the dark skies in formation and you will have a number of chances to catch th… [+1636 chars]"}, {"source": {"id": null, "name": "Pcmag.com"}, "author": "Matthew Humphries", "title": "Asteroid Passes Earth in 'One of the Closest Flybys Ever Recorded' - PCMag AU", "description": "We're lucky it didn't hit one of our communications satellites.", "url": "https://au.pcmag.com/communication/66730/asteroid-passes-earth-in-one-of-the-closest-flybys-ever-recorded", "urlToImage": "https://sm.pcmag.com/t/pcmag_au/news/a/asteroid-p/asteroid-passes-earth-in-one-of-the-closest-flybys-ever-reco_tekp.1200.jpg", "publishedAt": "2020-05-04T11:30:00Z", "content": "Last week, astronomers observed a brand new space rock passing the Earth and a little bit too close for comfort to one of our communications satellites.\r\nAs New Atlas reports, the space rock has been given the official name of 2020 HS7. It measures up to eigh… [+1356 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Ivan Mehta", "title": "Facebook-backed Jio leaked trove of coronavirus app data because it didn't have a password - The Next Web", "description": "A security lapse in Reliance Jio's coronavirus symptom checker exposed the results of millions of folks who took the tests. As first reported by TechCrunch, while the data was largely ...", "url": "https://thenextweb.com/?p=1289627", "urlToImage": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2020%2F05%2FJio-symptom-checker.jpg&signature=ff6f546bc47de26032c9c11329950b91", "publishedAt": "2020-05-04T09:51:15Z", "content": "A security lapse in Reliance Jios coronavirus symptom checker exposed the results of millions of folks who took the tests. As first reported by TechCrunch, while the data was largely anonymized in nature, bad actors couldve taken advantage of it and published… [+2084 chars]"}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Rada Mateescu", "title": "Radio Signals Come From Milky Way – What’s The Source? - Dual Dove", "description": "Astronomers detected a radio signal that’s coming from the Milky Way. This signal that’s been obtained is called a fast radio burst, and it only lasts for milliseconds. The radio signal…", "url": "https://www.dualdove.com/radio-signals-come-from-milky-way-whats-the-source/10000/", "urlToImage": "https://www.dualdove.com/wp-content/uploads/2020/05/second-repeating-radio-burst.jpg", "publishedAt": "2020-05-04T09:00:00Z", "content": "Astronomers detected a radio signal that’s coming from the Milky Way. This signal that’s been obtained is called a fast radio burst, and it only lasts for milliseconds.\r\nThe radio signal was extremely brief and this means that it was only identified after it … [+1907 chars]"}, {"source": {"id": null, "name": "Sciencetimes.com"}, "author": "Staff Reporter", "title": "[Listen] NASA's Sonified Hubble Deep Space Image of the Galactic Treasure Chest Will Give You Chills - Science Times", "description": "The NASA experts that created the sonified image explains that different sounds are produced by the various locations and elements of the image.", "url": "https://www.sciencetimes.com/articles/25560/20200504/listen-nasas-sonified-hubble-deep-space-image-galactic-treasure-chest.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/27345/the-chilling-sound-of-a-sonified-hubble-deep-space-image-of-the-galactic-treasure-chest.jpg", "publishedAt": "2020-05-04T08:35:06Z", "content": null}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Last supper: Fish use sharp barbs and spines to fight off hungry seals - Phys.org", "description": "What price are you willing to pay for food? As humans, we face this challenge each time we shop, but for some seals and dolphins this may be a life or death decision.", "url": "https://phys.org/news/2020-05-supper-fish-sharp-barbs-spines.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/lastsupperfi.jpg", "publishedAt": "2020-05-04T07:34:21Z", "content": "What price are you willing to pay for food? As humans, we face this challenge each time we shop, but for some seals and dolphins this may be a life or death decision.\r\nModern medical scanning reveals the steep price some marine mammals are willing to pay for … [+2968 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Scientists take a step closer to heat-tolerant wheat - Mirage News", "description": "Researchers working on molecular-level responses in crops have taken a step closer to their goal of producing heat-tolerant wheat. Smart thermostats tell...", "url": "https://www.miragenews.com/scientists-take-a-step-closer-to-heat-tolerant-wheat/", "urlToImage": "https://cisweb.lancaster.ac.uk/EventsMedia/19104-rca-temperatureillustrationv2-637238364272414753.png", "publishedAt": "2020-05-04T07:08:10Z", "content": "Researchers working on molecular-level responses in crops have taken a step closer to their goal of producing heat-tolerant wheat.\r\nSmart thermostats tell air conditioners to switch on when the sun is bearing down in the summer and when to shut down to conser… [+4199 chars]"}, {"source": {"id": null, "name": "Whitsundaytimes.com.au"}, "author": "Deborah Friend, Deborah Friend", "title": "$12.6m for farmers to protect reef water quality - Balonne Beacon", "description": "The Great Barrier Reef is in the spotlight again with farmers being offered $12.6m for innovations to improve water quality and reduce sediment.", "url": "https://www.whitsundaytimes.com.au/news/126m-for-farmers-to-protect-reef-water-quality/4008167/", "urlToImage": "https://media.apnarm.net.au/media/images/2020/05/04/v3imagesbina2e83840681378e5b65d0b06355c3d19-4ru6yhuhmrvzgvgz9u2_ct1880x930.jpg", "publishedAt": "2020-05-04T05:54:33Z", "content": "THE Great Barrier Reef is in the spotlight again, this time in relation to farmers and water quality.\r\nFarmers and organisations across catchment areas from Cairns to Mackay are being offered a total of $12.6 million for innovations to improve water quality a… [+1917 chars]"}, {"source": {"id": null, "name": "Tweaktown.com"}, "author": "Jak Connor", "title": "Scientist claims there is life outside of Earth, and here's where - TweakTown", "description": "A British scientist has claimed there is life outside of Earth, and that we already know the location of where to look", "url": "https://www.tweaktown.com/news/72217/scientist-claims-there-is-life-outside-of-earth-and-heres-where/index.html", "urlToImage": "https://images.tweaktown.com/news/7/2/72217_01_octopus-like-creatures-inhabit-jupiters-moon-claims-space-scientist_full.png", "publishedAt": "2020-05-04T05:31:41Z", "content": "The one question that has been puzzling scientists' minds is, 'are we alone in the universe?'. While we haven't found any evidence to suggest that we aren't alone, it's still important to keep an open mind about it all and keep on searching.\r\nOne British scie… [+1022 chars]"}, {"source": {"id": null, "name": "Sciencecodex.com"}, "author": null, "title": "Water-splitting module a source of perpetual energy - Science Codex", "description": null, "url": "https://www.sciencecodex.com/water-splitting-module-source-perpetual-energy-646318", "urlToImage": "https://media.eurekalert.org/multimedia_prod/pub/web/230911_web.jpg", "publishedAt": "2020-05-04T04:00:00Z", "content": "HOUSTON - (May 4, 2020) - Rice University researchers have created an efficient, low-cost device that splits water to produce hydrogen fuel. \r\nThe platform developed by the Brown School of Engineering lab of Rice materials scientist Jun Lou integrates catalyt… [+2571 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Chris Ciaccia", "title": "NASA relying on Jeff Bezos, Elon Musk, to return to the moon - NEWS.com.au", "description": "NASA relying on Jeff Bezos, Elon Musk, to return to the moon", "url": "https://www.news.com.au/technology/science/space/nasa-relying-on-jeff-bezos-elon-musk-to-return-to-the-moon/news-story/b6d54c3773c37118c1f58d732f6f0681", "urlToImage": "https://cdn.newsapi.com.au/image/v1/c8832c2219d0a408e6f33eb84a9d0405?width=650", "publishedAt": "2020-05-04T02:56:37Z", "content": "As NASA gets set to return to the moon by 2024, its going to rely on some of techs heavyweights to get there.The US government space agency announced last Thursday it had selected Amazon boss Jeff Bezos’ company Blue Origin, Tesla founder Elon Musk’s SpaceX, … [+3022 chars]"}, {"source": {"id": null, "name": "Nasa.gov"}, "author": null, "title": "Montana's Moon-Like Rocks - NASA", "description": "The Stillwater Complex in the Beartooth Mountains contains a mineral that closely resembles the most common mineral on the surface of the Moon.", "url": "https://earthobservatory.nasa.gov/images/146650/montanas-moon-like-rocks", "urlToImage": "https://eoimages.gsfc.nasa.gov/images/imagerecords/146000/146650/stillwater_oli-srtm_2018222_th.jpg", "publishedAt": "2020-05-03T21:56:15Z", "content": null}, {"source": {"id": null, "name": "Itnews.com.au"}, "author": null, "title": "SpaceX to bring astronauts to short-handed Space Station for longer stay - iTnews", "description": "Visit planned to last more than a month, instead of a week.", "url": "https://www.itnews.com.au/news/spacex-to-bring-astronauts-to-short-handed-space-station-for-longer-stay-547661", "urlToImage": "https://i.nextmedia.com.au/News/iStock-1089779672.jpg", "publishedAt": "2020-05-03T20:32:00Z", "content": "Two NASA astronauts gearing up to ride SpaceX's new space taxi will now be on a mission planned to last more than a month, instead of a week, to help the short-handed crew aboard the International Space Station, the US space agency said on Friday.\r\nThe launch… [+1929 chars]"}, {"source": {"id": null, "name": "Anu.edu.au"}, "author": null, "title": "Asteroid set to miss Earth, so there's one less worry - ANU College of Science", "description": "As the world grapples with the coronavirus pandemic, we can be thankful that humanity will be spared from another catastrophe tonight.", "url": "https://science.anu.edu.au/news-events/news/asteroid-set-miss-earth-so-there%E2%80%99s-one-less-worry", "urlToImage": "https://science.anu.edu.au/files/asteroid-3628185_1280.jpg", "publishedAt": "2020-04-28T23:22:57Z", "content": "As the world grapples with the coronavirus pandemic, we can be thankful that humanity will be spared from another catastrophe tonight when a big asteroid skims past Earth, according to ANU astronomer Dr Brad Tucker.\r\nHe said Asteroid 1998 OR2, which is about … [+1054 chars]"}, {"source": {"id": null, "name": "Hit.com.au"}, "author": "Hit News Team", "title": "A Dazzling Meteor Shower Will Rain Over Australia Tomorrow Night - Hit 107", "description": "So cool!", "url": "https://www.hit.com.au/story/a-dazzling-meteor-shower-will-rain-over-australia-tomorrow-night-153659", "urlToImage": "https://cdn-img.scalabs.com.au/pYeBBlG2ulLZE721-y7TbzAptyor8lXM9r384KT7hD4/aHR0cHM6Ly9zdy1o/aXQtcHJkLnNjYWRp/Z2l0YWwuaW8vbWVk/aWEvODEwNjcvbWV0/ZW9yLXNob3dlci1w/ZXhlbHMuanBnP3By/ZXNldD1tcnByZXZh/cnRpY2xl", "publishedAt": "2020-04-20T23:19:17Z", "content": "Hows this for some social-distancing entertainment?\r\nOne of the oldest meteor showers on record, the Lyrid Shower, is set to rain over Australia this week!\r\nUsually active between April 16 and 25 each year, this year, the shower will be most visible on the ev… [+621 chars]"}]}