{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "Digitaltrends.com"}, "author": "Georgina Torbet", "title": "NASA’s Perseverance rover is perfectly balanced for its trip to Mars - Digital Trends", "description": "NASA's Perseverance rover is preparing for its launch to Mars has just made it through one more item on the list: Ensuring that it is correctly balanced.", "url": "https://www.digitaltrends.com/news/nasa-perseverance-rover-balance/", "urlToImage": null, "publishedAt": "2020-04-25T16:00:25Z", "content": "NASA’s Perseverance rover is preparing for launch in the next few months by undergoing final checks, and it has just made it through one more item on the list: Ensuring that it is correctly balanced.\r\nPart of the final preparations for readying the rover for … [+1853 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "China unveils name of first Mars exploration mission - The Jakarta Post - Jakarta Post", "description": "China's space agency on Friday unveiled the name of its first Mars exploration mission, coinciding with China's annual Space Day and the 50th anniversary of the launch of its first satellite.", "url": "https://www.thejakartapost.com/life/2020/04/25/china-unveils-name-of-first-mars-exploration-mission-.html", "urlToImage": null, "publishedAt": "2020-04-25T15:05:00Z", "content": "China's space agency on Friday unveiled the name of its first Mars exploration mission, coinciding with China's annual Space Day and the 50th anniversary of the launch of its first satellite.\r\nThe Mars mission has been named Tianwen-1, the official Xinhua new… [+835 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Space race is rigged in Elon Musk’s favour, claims Russian rival - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T14:02:23Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Lucy Campbell", "title": "Coronavirus UK: test slots run out for second day running – latest updates - The Guardian", "description": "Questions over independence of Sage group come as UK death toll nears 20,000", "url": "https://www.theguardian.com/world/live/2020/apr/25/coronavirus-uk-calls-for-transparency-over-scientific-advice-to-ministers-latest-updates", "urlToImage": null, "publishedAt": "2020-04-25T10:41:00Z", "content": null}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Carly Cassella", "title": "Controversial Discovery Says Origins of Human Language Existed 25 Million Years Ago - ScienceAlert", "description": "A structure critical to our brain's core language pathway, found only in humans and apes, has now also been identified in monkeys, according to a controversial new study - suggesting the origins of language may have appeared 20 to 25 million years ea", "url": "https://www.sciencealert.com/controversial-discovery-in-monkeys-pushes-the-origin-of-human-language-back-25-million-years", "urlToImage": null, "publishedAt": "2020-04-25T09:31:17Z", "content": "A structure critical to our brain's core language pathway, found only in humans and apes, has now also been identified in monkeys, according to a controversial new study - suggesting the origins of language may have appeared 20 to 25 million years earlier tha… [+4838 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Russian cargo capsule docks with ISS - Yahoo News Australia", "description": "A Russian cargo capsule with 2.5 tons of supplies docked with the International Space Station (ISS) on Saturday after the fastest such trip yet from earth, the national space agency Roscosmos said.", "url": "https://au.news.yahoo.com/russian-cargo-capsule-docks-iss-074052240--spt.html", "urlToImage": null, "publishedAt": "2020-04-25T07:40:00Z", "content": "A Russian cargo capsule with 2.5 tons of supplies docked with the International Space Station (ISS) on Saturday after the fastest such trip yet from earth, the national space agency Roscosmos said.\r\nThe Progress capsule was launched atop a giant Soyuz rocket … [+1094 chars]"}, {"source": {"id": null, "name": "Webbyfeed.com"}, "author": "Carrie J. Bronstein", "title": "Scientists Came Up With The Most Detailed Lunar Map, Focused On Moon's Rock Composition - Webby Feed", "description": "The distant dark spots that can be spot on the Moon from a distance are merely the tip of the iceberg, as the satellite possesses an impressive geological diversity. A...", "url": "https://www.webbyfeed.com/scientists-came-up-with-the-most-detailed-lunar-map-focused-on-moons-rock-composition/8023/", "urlToImage": null, "publishedAt": "2020-04-25T07:24:13Z", "content": "The distant dark spots that can be spot on the Moon from a distance are merely the tip of the iceberg, as the satellite possesses an impressive geological diversity. A team of determined researchers has managed to create the most detailed lunar map focused on… [+1621 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Brett Wadelton", "title": "Space news: Asteroid to pass close to Earth next week, visible by telescope - 7NEWS.com.au", "description": "Stargazers are set for a treat early next week as an asteroid will pass close to Earth.", "url": "https://7news.com.au/technology/space/space-news-mask-shaped-asteroid-to-pass-close-to-earth-next-week-visible-by-telescope-c-993995", "urlToImage": null, "publishedAt": "2020-04-25T06:38:57Z", "content": "Astronomers are set for a treat early next week as an asteroid will pass close to Earth.\r\nNamed Asteroid (52768) 1998 OR2, this large near-Earth and potentially hazardous asteroid (PHA) will safely fly past us at a mere 6.3 million kilometres - which is quite… [+1587 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Gursimran Hans", "title": "Trump’s new US Space Force to deploy surveillance telescope in Australia - Express.co.uk", "description": "THE US plans to construct a specialist space surveillance telescope at a facility in Western Australia.", "url": "https://www.express.co.uk/news/science/1273676/Space-news-USA-Australia-telescope-spy-track-debris-satellites", "urlToImage": null, "publishedAt": "2020-04-25T03:21:00Z", "content": null}, {"source": {"id": null, "name": "Syfy.com"}, "author": "Elizabeth Rayne", "title": "This planet is so scorching that metals actually vaporize into the atmosphere - SYFY WIRE", "description": "There are hot planets, and then there are unbelievably, unbearably, insufferably hot planets. Imagine an alien world torrid enough to not just melt, but vaporize metal. MASCARA-2 b (whose name has absolutely nothing to do with makeup) is that planet. A team o…", "url": "https://www.syfy.com/syfywire/this-planet-is-so-hot-it-makes-metals-vaporize", "urlToImage": null, "publishedAt": "2020-04-25T02:16:44Z", "content": "There are hot planets, and then there are unbelievably, unbearably, insufferably hot planets.\r\nImagine an alien world torrid enough to not just melt, but vaporize metal. MASCARA-2 b (whose name has absolutely nothing to do with makeup) is that planet. A team … [+3176 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/abc-local/sophie-kesteven/7149610", "title": "Raquel is working from home during coronavirus — and that means sloths in the spare room - ABC News", "description": "Working from home means different things for different people. For Raquel, it means moving three very lazy — but very cute — new housemates into the spare room.", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-panama-working-from-home-with-sloths/12169922", "urlToImage": null, "publishedAt": "2020-04-24T22:29:37Z", "content": "Updated \r\nApril 25, 2020 08:23:26\r\nWorking from home is the new normal for many people and for Raquel Cruz Alpizar, it's meant moving three unlikely new housemates into her spare room.\r\nSince coronavirus restrictions took hold, she's been caring around the cl… [+6272 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Michael Thomsen For Dailymail.com", "title": "Time passes faster at the top of skyscrapers according to new study - Daily Mail", "description": "A new study from the University of Tokyo has shown that time actually passes at a different speed at the top of skyscrapers and other tall buildings, at a rate of four nanoseconds more quickly.", "url": "https://www.dailymail.co.uk/sciencetech/article-8254271/Time-passes-faster-skyscrapers-according-new-study.html", "urlToImage": null, "publishedAt": "2020-04-24T22:22:17Z", "content": "A new study from the University of Tokyo has shown that time actually passes at a different speed at the top of skyscrapers and other tall buildings.\r\nA team, led by quantum electronics professor Hidetoshi Katori, climbed to the top of the Tokyo Skytree, the … [+4009 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Charles Q. Choi", "title": "Mystery of Venus atmosphere's weird rotation may finally be solved - Space.com", "description": "Thermal tides in the atmosphere make it rotate faster than the planet's surface, a new study finds.", "url": "https://www.space.com/venus-atmosphere-super-rotation-mystery-solved.html", "urlToImage": null, "publishedAt": "2020-04-24T21:59:00Z", "content": "The mystery behind why the atmosphere of Venus spins much faster than the planet's surface may finally be solved, a new study finds.\r\nThe finding might help shed light on how habitable distant exoplanets, or worlds beyond our solar system, may actually be, re… [+3613 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Mindy Weisberger", "title": "Black hole bends escaping light 'like a boomerang' - Livescience.com", "description": "Even light can't resist the pull of these irresistible cosmic objects.", "url": "https://www.livescience.com/black-hold-bends-light-like-boomerang.html", "urlToImage": null, "publishedAt": "2020-04-24T20:39:00Z", "content": "Light escaping from a black hole may \"boomerang\" its way to freedom, new X-ray images reveal.\r\nResearchers found this odd behavior while reviewing archival X-ray\r\n observations of a black hole that's approximately 10 times as massive as our sun. Located about… [+3950 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Kathleen Haughney", "title": "Researchers discover new structure for promising class of materials - Phys.org", "description": "Florida State University researchers have discovered a novel structure for organic-inorganic hybrid materials that shows potential for more efficient technologies.", "url": "https://phys.org/news/2020-04-class-materials.html", "urlToImage": null, "publishedAt": "2020-04-24T20:31:40Z", "content": "Florida State University researchers have discovered a novel structure for organic-inorganic hybrid materials that shows potential for more efficient technologies.\r\nProfessor of Chemistry and Biochemistry Biwu Ma and his team have published a new study in the… [+2382 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "George Dvorsky", "title": "NASA Rocket Scientists Designed A Rapid-Production Ventilator In Just 37 Days - Gizmodo Australia", "description": "Introducing VITAL, a prototype ventilator designed expressly for quick and easy mass production. Developed by NASA engineers, the device could alleviate ongoing supply shortages in the U.S. and around the world as the covid-19 pandemic rages on....", "url": "https://www.gizmodo.com.au/2020/04/nasa-rocket-scientists-designed-a-rapid-production-ventilator-in-just-37-days/", "urlToImage": null, "publishedAt": "2020-04-24T19:30:00Z", "content": "Introducing VITAL, a prototype ventilator designed expressly for quick and easy mass production. Developed by NASA engineers, the device could alleviate ongoing supply shortages in the U.S. and around the world as the covid-19 pandemic rages on.\r\nNASA has cop… [+3078 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Amanda Kooser", "title": "Scientists pinpoint 'most dangerous place in the history of planet Earth' - CNET", "description": "A paleontologist says time travelers would not survive long in this predator-packed area of Africa 100 million years ago.", "url": "https://www.cnet.com/news/scientists-pinpoint-most-dangerous-place-in-the-history-of-planet-earth/", "urlToImage": null, "publishedAt": "2020-04-24T19:24:42Z", "content": "This artist's illustration shows a massive dinosaur Carcharodontosaurus with a group of crocodile-like Elosuchus predators near a carcass.\r\nArtwork by Davide Bonadonna\r\nOnce you build your time machine, please do not set your destination for 100 million years… [+1631 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Star somehow survives close encounter with BLACK HOLE, but faces a TRILLION YEARS on death row - RT", "description": "An extremely rare close call between a red giant star and a black hole has been captured by powerful NASA and ESA tech, revealing a key chapter in a cosmic saga that will likely continue for a trillion years.", "url": "https://www.rt.com/news/486801-star-survives-encounter-black-hole/", "urlToImage": null, "publishedAt": "2020-04-24T18:19:54Z", "content": "The fatal celestial event is unfolding in the galaxy GSN 069 – about 250 million light years away from Earth. The black hole in question is roughly 400,000 times the mass of the sun, making it small by supermassive black hole standards, but still terrifying i… [+2539 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Engineers open door to big new library of tiny nanoparticles - Phys.org", "description": "The development of bimetallic nanoparticles (i.e., tiny particles composed of two different metals that exhibit several new and improved properties) represents a novel area of research with a wide range of potential applications. Now, a research team in the U…", "url": "https://phys.org/news/2020-04-door-big-library-tiny-nanoparticles.html", "urlToImage": null, "publishedAt": "2020-04-24T18:09:04Z", "content": "The development of bimetallic nanoparticles (i.e., tiny particles composed of two different metals that exhibit several new and improved properties) represents a novel area of research with a wide range of potential applications. Now, a research team in the U… [+3847 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Catalyst Opens Door To More Efficient, Environmentally Friendly Ethylene Production - Mirage News", "description": "News Releases April 24, 2020 Reaction pathways for oxidative dehydrogenation of ethane facilitated by the molten carbonate...", "url": "https://www.miragenews.com/catalyst-opens-door-to-more-efficient-environmentally-friendly-ethylene-production/", "urlToImage": null, "publishedAt": "2020-04-24T18:02:14Z", "content": "A research team led by North Carolina State University has engineered a new catalyst that can more efficiently convert ethane into ethylene, which is used in a variety of manufacturing processes. The discovery could be used in a conversion process to drastica… [+2639 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Ryan F. Mandelbaum", "title": "This Could Be The First Record Of Someone Getting Killed By A Meteorite - Gizmodo Australia", "description": "A team of scientists think they’ve found the oldest evidence of a meteorite striking and killing a person, according to a new report published in the journal journal Meteoritics & Planetary Science....", "url": "https://www.gizmodo.com.au/2020/04/this-could-be-the-first-record-of-someone-getting-killed-by-a-meteorite/", "urlToImage": null, "publishedAt": "2020-04-24T17:52:00Z", "content": "A team of scientists think theyve found the oldest evidence of a meteorite striking and killing a person, according to a new report published in the journal journal Meteoritics &amp; Planetary Science.\r\nGiven the hype around space rocks hitting Earth, there a… [+2713 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "BCI system gives paralyzed man back his sense of touch with haptic feedback - Ars Technica", "description": "Long-term goal is to develop system that works as well at home as in the laboratory.", "url": "https://arstechnica.com/science/2020/04/bci-system-gives-paralyzed-man-back-his-sense-of-touch-with-haptic-feedback/", "urlToImage": null, "publishedAt": "2020-04-24T17:51:00Z", "content": "Enlarge/ Ian Burkhard suffered a severe spinal cord injury in 2010. Battelle's NeuroLife project is restoring motor function to his right arm with a brain-computer-interface system.\r\n4 with 4 posters participating\r\nIan Burkhart, now 28, had a diving accident … [+7377 chars]"}, {"source": {"id": null, "name": "Futurism.com"}, "author": null, "title": "NASA: Don't Break Quarantine to Watch SpaceX Launch Astronauts - Futurism", "description": "Please, NASA implores, just watch from home.", "url": "https://futurism.com/the-byte/nasa-break-quarantine-watch-spacex-launch-astronauts", "urlToImage": null, "publishedAt": "2020-04-24T17:04:02Z", "content": "Stay Home\r\nIf there wasnt a global pandemic going on, NASAs upcoming SpaceX launch the first to send astronauts into space from U.S. soil since 2011 would be a huge spectacle.\r\nBut this time around, NASA administrator Jim Bridenstine urged would-be spectators… [+1253 chars]"}, {"source": {"id": null, "name": "Dw.com"}, "author": "Deutsche Welle (www.dw.com)", "title": "Hubble's giant birthday nebula - Deutsche Welle", "description": "It's been 30 years since the Hubble Space Telescope began providing us with images from distant corners of the universe. Here some breathtaking pictures:", "url": "https://www.dw.com/en/hubbles-giant-birthday-nebula/g-18403422", "urlToImage": null, "publishedAt": "2020-04-24T13:43:06Z", "content": "The first pictures Hubble sent back were a catastrophe, however, because its main mirror had been ground to the wrong shape. In 1993, Space Shuttle Endeavor took experts to Hubble to fix the problem, giving it a pair of glasses. That was just one of five upda… [+74 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Colliding solitons in optical microresonators to reveal important fundamental physics - Phys.org", "description": "Solitons are self-reinforcing particle-like wave packets enabled by the balance between dispersion and nonlinearity. Occurring in hydrodynamics, lasers, cold atoms, and plasmas, solitons are generated when a laser field is confined in a circular resonator wit…", "url": "https://phys.org/news/2020-04-colliding-solitons-optical-microresonators-reveal.html", "urlToImage": null, "publishedAt": "2020-04-24T13:04:37Z", "content": "Solitons are self-reinforcing particle-like wave packets enabled by the balance between dispersion and nonlinearity. Occurring in hydrodynamics, lasers, cold atoms, and plasmas, solitons are generated when a laser field is confined in a circular resonator wit… [+3188 chars]"}, {"source": {"id": null, "name": "Theiet.org"}, "author": "Jack Loughran", "title": "European lockdown a boon to seismologists checking Earth's vibrations - E&T Magazine", "description": "Seismologists across Europe have been looking at the effects of the coronavirus lockdown on seismic activity and found a notable drop in ground vibrations.", "url": "https://eandt.theiet.org/content/articles/2020/04/european-lockdown-a-boon-to-seismologists-looking-for-earth-s-vibrations/", "urlToImage": null, "publishedAt": "2020-04-24T12:53:51Z", "content": "Seismologists across Europe have been looking at the effects of the coronavirus lockdown on seismic activity and found a notable drop in ground vibrations.\r\n A seismologist at the Royal Observatory in Belgium discovered that seismic levels had fallen between … [+2260 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Warming climate undoes decades of knowledge of marine protected areas - Science Daily", "description": "A new study highlights that tropical coral reef marine reserves can offer little defence in the face of climate change impacts. And the changes that are being observed will force scientists, conservationists and reserve managers to rethink the role these prot…", "url": "https://www.sciencedaily.com/releases/2020/04/200424081654.htm", "urlToImage": null, "publishedAt": "2020-04-24T12:53:43Z", "content": "Climate change and warming seas are transforming tropical coral reefs and undoing decades of knowledge about how to protect these delicate and vital ecosystems.Many of the world's coral reefs are seeing biodiversity plunge in the face of repeated coral bleach… [+4002 chars]"}, {"source": {"id": null, "name": "Heritagedaily.com"}, "author": "http://www.facebook.com/archaeologynews", "title": "Icelandic DNA jigsaw-puzzle brings new knowledge about Neanderthals - HeritageDaily", "description": "An international team of researchers has put together a new image of Neanderthals based on the genes Neanderthals left in the DNA of modern humans when they had children with them about 50,000 years ago.", "url": "https://www.heritagedaily.com/2020/04/icelandic-dna-jigsaw-puzzle-brings-new-knowledge-about-neanderthals/127864", "urlToImage": null, "publishedAt": "2020-04-24T12:36:00Z", "content": "An international team of researchers has put together a new image of Neanderthals based on the genes Neanderthals left in the DNA of modern humans when they had children with them about 50,000 years ago.\r\nThe researchers found the new pieces of the puzzle by … [+4934 chars]"}, {"source": {"id": null, "name": "Theconversation.com"}, "author": "Daniel Garcia-Castellanos", "title": "Tomanowos, the meteorite that survived mega-floods and human folly - The Conversation US", "description": "Tomanowos, aka the Willamette Meteorite, may be the world's most interesting rock. Its story includes catastrophic ice age floods, theft of Native American cultural heritage and plenty of human folly.", "url": "https://theconversation.com/tomanowos-the-meteorite-that-survived-mega-floods-and-human-folly-134213", "urlToImage": null, "publishedAt": "2020-04-24T12:23:00Z", "content": "The rock with arguably the most fascinating story on Earth has an ancient name: Tomanowos. It means the visitor from heaven in the extinct language of Oregons Clackamas Indian tribe.\r\nThe Clackamas revered the Tomanowos also known as the Willamette meteorite … [+6446 chars]"}, {"source": {"id": null, "name": "Theconversation.com"}, "author": "Rodger I. Thompson", "title": "How the Hubble Space Telescope opened our eyes to the first galaxies of the universe - The Conversation US", "description": "Thirty years ago the Hubble Space Telescope began snapping photos of distant stars, providing a time machine that has taken astronomers back to when the universe was less than a billion years old.", "url": "https://theconversation.com/how-the-hubble-space-telescope-opened-our-eyes-to-the-first-galaxies-of-the-universe-133877", "urlToImage": null, "publishedAt": "2020-04-24T12:22:00Z", "content": "The Hubble Space Telescope launched on the 24th of April, 30 years ago. Its an impressive milestone especially as its expected lifespan was just 10 years.\r\nOne of the primary reasons for the Hubble telescopes longevity is that it can be serviced and improved … [+6948 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Kevin Stacey", "title": "Researchers solve 'link discovery' problem for terahertz data networks - Phys.org", "description": "When someone opens a laptop, a router can quickly locate it and connect it to the local Wi-Fi network. That ability is a basic element of any wireless network known as link discovery, and now a team of researchers has developed a means of doing it with terahe…", "url": "https://phys.org/news/2020-04-link-discovery-problem-terahertz-networks.html", "urlToImage": null, "publishedAt": "2020-04-24T11:31:08Z", "content": "When someone opens a laptop, a router can quickly locate it and connect it to the local Wi-Fi network. That ability is a basic element of any wireless network known as link discovery, and now a team of researchers has developed a means of doing it with terahe… [+4150 chars]"}, {"source": {"id": null, "name": "H2-view.com"}, "author": "Molly Burgess", "title": "New eco-friendly fuel for fuel cell production - H2 View", "description": "Researchers at the University of Saskatchewan have developed a new eco-friendly fuel which can be used to create other by-products for hydrogen fuel cells.", "url": "https://www.h2-view.com/story/new-eco-friendly-fuel-for-fuel-cell-production/", "urlToImage": null, "publishedAt": "2020-04-24T08:38:34Z", "content": "Researchers at the University of Saskatchewan have developed a new eco-friendly fuel which can be used to create other by-products for hydrogen fuel cells.\r\nAs part of their research, Sonil Nanda, USask chemical and biological engineering research associate a… [+1205 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Tom Cowie, Chloe Booker", "title": "Shopping returning and hopes high for footy restart - The Age", "description": "The Emporium shopping centre is reopening and the AFL has the backing of health authorities to restart in June, offering those with itchy feet hope that Victoria is emerging from pandemic lockdown.", "url": "https://www.theage.com.au/national/victoria/shopping-returning-and-hopes-high-for-footy-restart-20200424-p54n0p.html", "urlToImage": null, "publishedAt": "2020-04-24T08:07:09Z", "content": "However, that was still well down on the average in the past year of 3042.\r\nIt wouldn't be winter in Melbourne without footy and authorities have given a cautious green light to the AFL to proceed with plans to resume playing in June.\r\n\"There's a chance,\" Chi… [+2351 chars]"}, {"source": {"id": null, "name": "Abc14news.com"}, "author": "Brandon G. Jones", "title": "Coronavirus: Body 'in industrial fridge for six days' - ABC 14 News", "description": "Impression copyright                 Spouse and children image                                                                    Imp", "url": "https://abc14news.com/2020/04/24/coronavirus-body-in-industrial-fridge-for-six-days/", "urlToImage": null, "publishedAt": "2020-04-24T07:56:00Z", "content": "Impression copyrightSpouse and children image\r\nImpression captionUmar Afzal was a Household Business office interpreter and spoke “50 % a dozen languages”\r\nThe previous chief prosecutor Nazir Afzal stated his brother’s body was saved in an industrial fridge f… [+2165 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Michelle Starr", "title": "Astronomers Just Identified 19 More Asteroids They Think Are Interstellar - ScienceAlert", "description": "The Solar System has been here for a long time. So, when 'Oumuamua was spotted in 2017, it was almost a dead cert it wasn't the only object from interstellar space to visit us over that 4.57 billion-year history. Then comet 2I/Borisov showed up last", "url": "https://www.sciencealert.com/astronomers-have-just-identified-19-more-asteroids-they-think-are-interstellar", "urlToImage": null, "publishedAt": "2020-04-24T07:43:50Z", "content": "The Solar System has been here for a long time. So, when 'Oumuamua was spotted in 2017, it was almost a dead cert it wasn't the only object from interstellar space to visit us over that 4.57 billion-year history. Then comet 2I/Borisov showed up last year. Tha… [+4728 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Luke Auburn", "title": "Scientists develop first 3-D mass estimate of microplastic pollution in Lake Erie - Phys.org", "description": "Rochester Institute of Technology scientists have developed the first three-dimensional mass estimate to show where microplastic pollution is collecting in Lake Erie. The study examines nine different types of polymers that are believed to account for 75 perc…", "url": "https://phys.org/news/2020-04-scientists-d-mass-microplastic-pollution.html", "urlToImage": null, "publishedAt": "2020-04-24T06:18:11Z", "content": "Rochester Institute of Technology scientists have developed the first three-dimensional mass estimate to show where microplastic pollution is collecting in Lake Erie. The study examines nine different types of polymers that are believed to account for 75 perc… [+3107 chars]"}, {"source": {"id": null, "name": "Uq.edu.au"}, "author": null, "title": "If we can put a man on the Moon, we can save the Great Barrier Reef - UQ News", "description": "Scientists recently confirmed the Great Barrier Reef suffered another serious bleaching event last summer - the third in five years. Dramatic intervention to save the natural wonder is clearly needed.", "url": "https://www.uq.edu.au/news/article/2020/04/if-we-can-put-man-moon-we-can-save-great-barrier-reef", "urlToImage": null, "publishedAt": "2020-04-24T04:14:49Z", "content": "Paul Hardisty, Australian Institute of Marine Science; Christian Roth, CSIRO; Damien Burrows, James Cook University; David Mead, Australian Institute of Marine Science; Ken Anthony, Australian Institute of Marine Science; Line K Bay, Australian Institute of M… [+7209 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Victoria Nielsen", "title": "Coronavirus: Aerial photos show Sydney deserted - NEWS.com.au", "description": "Aerial photos show an empty Sydney from above", "url": "https://www.news.com.au/national/nsw-act/aerial-photos-show-an-empty-sydney-from-above/news-story/ee858b43b7c5c259a01b50c6ae9760af", "urlToImage": null, "publishedAt": "2020-04-24T01:31:17Z", "content": "With its population of 5.2 million people being told to stay home its an unusual sight to see the usually bustling city of Sydney look eerily deserted. The following aerial views show some of our biggest tourist attractions and landmarks lying virtually empty… [+369 chars]"}, {"source": {"id": null, "name": "Bodyandsoul.com.au"}, "author": "Juna Xu", "title": "Coronavirus: How to properly wear a face mask to protect against COVID-19 - Body and Soul", "description": "So many people are incorrectly wearing face masks, so here’s how to wear one properly", "url": "https://www.bodyandsoul.com.au/health/health-advice/so-many-people-are-incorrectly-wearing-face-masks-so-heres-how-to-wear-one-properly/news-story/25e9907b6c88d9ecc287b1fece958ae9", "urlToImage": null, "publishedAt": "2020-04-24T00:46:45Z", "content": "Face masks are only effective at protecting yourself, and others, from COVID-19 if worn and used correctly. Here's how to do it properly.Unless you work in the medical field, there’s a good chance you haven’t had much reason to wear a face mask.\r\nBut we’re li… [+3686 chars]"}, {"source": {"id": null, "name": "Nippon.com"}, "author": null, "title": "Japanese Probe Brings New Insight into Strong Winds on Venus - Nippon.com", "description": "Tokyo, April 24 (Jiji Press)--Data from the Japanese Venus probe Akatsuki have brought a new insight into the …", "url": "https://www.nippon.com/en/news/yjj2020042400122/", "urlToImage": null, "publishedAt": "2020-04-24T00:34:00Z", "content": "Tokyo, April 24 (Jiji Press)--Data from the Japanese Venus probe Akatsuki have brought a new insight into the superstrong winds blowing on the second planet from the sun, a research team has said.\r\nVenus has a thick atmosphere that rotates 60 times as fast as… [+725 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Louise Boyle", "title": "Microplastics found in Antarctic sea ice for first time, scientists say - The Independent", "description": "The particles found were still relatively large in size suggesting that they had come from local pollution", "url": "https://www.independent.co.uk/environment/microplastics-antarctic-sea-ice-plastic-pollution-ocean-a9481146.html", "urlToImage": null, "publishedAt": "2020-04-24T00:28:26Z", "content": "Microplastics have been found in Antarctic sea ice for the first time, scientists say.\r\nThe study, published in the May edition of the journal Marine Pollution Bulletin, analysed an ice core collected in East Antarctica in 2009. Some 96 tiny particles of plas… [+2782 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mars' seasons compared to other planets including Earth - AccuWeather", "description": "Why do we have seasons? It's because our planet is tilted on its axis just enough so that we have four seasons, as Earth continues its orbit around the Sun. ...", "url": "https://www.youtube.com/watch?v=aKQdl3blWR0", "urlToImage": null, "publishedAt": "2020-04-23T20:56:13Z", "content": "Why do we have seasons? It's because our planet is tilted on its axis just enough so that we have four seasons, as Earth continues its orbit around the Sun. But what about other planets?"}, {"source": {"id": null, "name": "Futurism.com"}, "author": null, "title": "Researchers Want to Explore Mars Using \"Nanocardboard\" Aircraft - Futurism", "description": "\"The Mars Helicopter is very exciting, but it’s still a single, complicated machine.\"", "url": "https://futurism.com/the-byte/explore-mars-nanocardboard-aircraft", "urlToImage": null, "publishedAt": "2020-04-23T20:25:11Z", "content": "Tiny Flyers\r\nResearchers at the University of Pennsylvania say we could one day explore the surface of Mars using a fleet of nanocardboard aircraft that each weigh as much as a fruit fly and feature no moving parts.\r\nThe tiny flyers, as outlined in the study … [+1627 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tariq Malik", "title": "SpaceX rolls out new Starship prototype for tests (video) - Space.com", "description": "Pressure tests are expected to follow soon.", "url": "https://www.space.com/spacex-rolls-out-starship-sn4-prototype-video.html", "urlToImage": null, "publishedAt": "2020-04-23T20:13:00Z", "content": "SpaceX moved its latest Starship prototype to its Texas proving grounds Thursday (April 23) ahead of a new round of spacecraft tests. \r\nThe Starship prototype, a gleaming cylinder of stainless steel, is SpaceX's fourth test vehicle for a massive reusable spac… [+2964 chars]"}, {"source": {"id": null, "name": "Pulse2.com"}, "author": null, "title": "Elon Musk: SpaceX To Fix Brightness From Satellites - Pulse 2.0", "description": "SpaceX head Elon Musk said that the company is working on fixing the brightness of the company's Starlink satellites. These are the details.", "url": "https://pulse2.com/elon-musk-spacex-to-fix-brightness-from-satellites/", "urlToImage": null, "publishedAt": "2020-04-23T20:01:03Z", "content": "<ul><li>SpaceX head Elon Musk said that the company is working on fixing the brightness of the company’s Starlink satellites</li></ul>Elon Musk, the head of SpaceX, said that the company is working on fixing the brightness of the companys satellites. The Star… [+1298 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Hanneke Weitering", "title": "The 2020 Lyrid meteor shower thrills skywatchers. Here are the best photos. - Space.com", "description": "Behold, bits of Comet Thatcher!", "url": "https://www.space.com/lyrid-meteor-shower-2020-amateur-photos.html", "urlToImage": null, "publishedAt": "2020-04-23T19:26:00Z", "content": "Photographer Timothy Wenzel created this composite of six Lyrid meteor photos he captured from Midland, Michigan, in the early morning hours of April 22, 2020.  (Image credit: Courtesy of Timothy Wenzel)\r\nThe annual Lyrid meteor shower put on an exceptional s… [+6160 chars]"}, {"source": {"id": null, "name": "Sci-news.com"}, "author": null, "title": "Extreme Rainfall Triggered 2018 Eruption of Kilauea Volcano, Researchers Say | Geophysics - Sci-News.com", "description": "The 2018 eruption of Kīlauea volcano in Hawaii was likely initiated by prolonged, and at times extreme, rainfall in the months leading up to the event, according to new research from the Rosenstiel School of Marine and Atmospheric Science at the University of…", "url": "http://www.sci-news.com/othersciences/geophysics/rainfall-2018-eruption-kilauea-volcano-08359.html", "urlToImage": null, "publishedAt": "2020-04-23T19:25:03Z", "content": "The 2018 eruption of Klauea volcano in Hawaii was likely initiated by prolonged, and at times extreme, rainfall in the months leading up to the event, according to new research from the Rosenstiel School of Marine and Atmospheric Science at the University of … [+3220 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "By Matt McGrath - Environment correspondent", "title": "Nature crisis: 'Insect apocalypse' more complicated than thought - Yahoo News Australia", "description": "The health of insect populations globally is far more varied than previous research suggested.", "url": "https://news.yahoo.com/nature-crisis-insect-apocalypse-more-191059967.html", "urlToImage": null, "publishedAt": "2020-04-23T19:10:00Z", "content": "The global health of insect populations is far more complicated than previously thought, new data suggests.\r\nPrevious research indicated an alarming decline in numbers in all parts of world, with losses of up to 25% per decade.\r\nThis new study, the largest ca… [+4631 chars]"}, {"source": {"id": null, "name": "Volcanodiscovery.com"}, "author": null, "title": "Volcanoes Today - summary of volcanic activity world-wide - VolcanoDiscovery", "description": "Volcanoes Today - summary of volcanic activity world-wide", "url": "https://www.volcanodiscovery.com/volcanoes/today.html", "urlToImage": null, "publishedAt": "2020-04-23T19:01:22Z", "content": "Volcanoes Today, 25 Apr 2020: Popocatépetl volcano, Semeru, Dukono, Reventador, Sangay, Sakurajima, Aso, Nevado del Ruiz\r\nSaturday Apr 25, 2020 10:00 AM | BY: VN\r\nSatellite image of Ebeko volcano on 25 Apr 2020\r\nEbeko (Paramushir Island): Volcanic Ash Advisor… [+2353 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Revealed that Planet Shell Began To Move 3.2 Billion Years Ago - Somag News", "description": "Researchers made a new discovery of the planet’s motion as a result of their work in the Pilbara region in Western Australia. The motion of the planet crust, as it was announced, dates back 200 million years before it was known. It was discovered that the tec…", "url": "https://www.somagnews.com/revealed-planet-shell-began-move-3-2-billion-years-ago/", "urlToImage": null, "publishedAt": "2020-04-23T18:34:00Z", "content": "Researchers made a new discovery of the planet’s motion as a result of their work in the Pilbara region in Western Australia. The motion of the planet crust, as it was announced, dates back 200 million years before it was known.\r\nIt was discovered that the te… [+1984 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Atmospheric tidal waves maintain Venus' super-rotation - Phys.org", "description": "Images from the Akatsuki spacecraft unveil what keeps Venus's atmosphere rotating much faster than the planet itself.", "url": "https://phys.org/news/2020-04-atmospheric-tidal-venus-super-rotation.html", "urlToImage": null, "publishedAt": "2020-04-23T18:13:45Z", "content": "Images from the Akatsuki spacecraft unveil what keeps Venus's atmosphere rotating much faster than the planet itself.\r\nAn international research team led by Takeshi Horinouchi of Hokkaido University has revealed that this 'super-rotation' is maintained near t… [+3702 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Gail McCormick", "title": "When iron is limited, microalgae that live in coral cells may compensate with other metals - Phys.org", "description": "When iron is limited, the tiny algae that live within coral cells—which can provide the majority of a coral's nutritional needs—change how they take in other trace metals, which could have cascading effects on vital biological functions. A new study in the jo…", "url": "https://phys.org/news/2020-04-iron-limited-microalgae-coral-cells.html", "urlToImage": null, "publishedAt": "2020-04-23T18:11:47Z", "content": "When iron is limited, the tiny algae that live within coral cellswhich can provide the majority of a coral's nutritional needschange how they take in other trace metals, which could have cascading effects on vital biological functions. A new study in the jour… [+3841 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Rosie McCall", "title": "Levels of Ocean Biodiversity Have Barely Changed for Hundreds of Millions of Years, Scientists Say - Newsweek", "description": "Scientists have analyzed fossils from the Cambrian explosion 540 million years ago to the present day to explore levels of marine biodiversity over time.", "url": "https://www.newsweek.com/levels-ocean-biodiversity-remained-stable-hundred-1499842", "urlToImage": null, "publishedAt": "2020-04-23T18:10:25Z", "content": "Levels of biodiversity in the world's oceans have remained virtually unchanged for hundreds of millions of years, according to a new study published in Science.\r\nThe conclusion that marine biodiversity has stayed stable over time and not mushroomed over the l… [+3686 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Better obesity treatments may lie ahead after discovery of key protein structure - Mirage News", "description": "A USC-led international team of scientists has found the precise shape of a key player in human metabolism, which could lead the way to better treatments...", "url": "https://www.miragenews.com/better-obesity-treatments-may-lie-ahead-after-discovery-of-key-protein-structure/", "urlToImage": null, "publishedAt": "2020-04-23T18:04:13Z", "content": "A USC-led international team of scientists has found the precise shape of a key player in human metabolism, which could lead the way to better treatments for obesity and other metabolic diseases.\r\nFor the study, the scientists focused on a protein in the brai… [+3924 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Thomas Macaulay", "title": "AI detects plastics in the oceans by analyzing satellite images - The Next Web", "description": "An AI system has spotted plastic pollution in the sea by analyzing images from satellites orbiting the earth. The scientists behind the technique claim that it’s the first time patches of plastics in coastal waters have been detected via satellites. The syste…", "url": "https://thenextweb.com/neural/2020/04/23/ai-detects-plastics-in-the-oceans-by-analyzing-satellite-images/", "urlToImage": null, "publishedAt": "2020-04-23T17:40:03Z", "content": "An AI system has spotted plastic pollution in the sea by analyzing images from satellites orbiting the earth.\r\nThe scientists behind the technique claim that its the first time patches of plastics in coastal waters have been detected via satellites.\r\nThe syst… [+1109 chars]"}, {"source": {"id": null, "name": "News-medical.net"}, "author": null, "title": "Electronic sensors woven into stretchy fabrics can monitor vital signs - News-Medical.Net", "description": "MIT researchers have developed a way to incorporate electronic sensors into stretchy fabrics, allowing them to create shirts or other garments that could be used to monitor vital signs such as temperature, respiration, and heart rate.", "url": "https://www.news-medical.net/news/20200423/Electronic-sensors-woven-into-stretchy-fabrics-can-monitor-vital-signs.aspx", "urlToImage": null, "publishedAt": "2020-04-23T17:12:18Z", "content": "Reviewed by Emily Henderson, B.Sc.Apr 23 2020\r\nMIT researchers have developed a way to incorporate electronic sensors into stretchy fabrics, allowing them to create shirts or other garments that could be used to monitor vital signs such as temperature, respir… [+4357 chars]"}, {"source": {"id": null, "name": "Globalhealthnewswire.com"}, "author": "News", "title": "How Birds Evolved Big Brains - Global Health News Wire", "description": "An international team of evolutionary biologists and paleontologists have reconstructed the evolution of the avian brain using a massive dataset of brain volumes from dinosaurs, extinct birds like Archaeopteryx and the Great Auk, and modern birds. The study, …", "url": "https://globalhealthnewswire.com/research/2020/04/23/how-birds-evolved-big-brains/%20", "urlToImage": null, "publishedAt": "2020-04-23T16:51:00Z", "content": "The Eurasian Jay, a member of the large-brain bird family Corvidae.\r\nAn international team of evolutionary biologists and paleontologists have reconstructed the evolution of the avian brain using a massive dataset of brain volumes from dinosaurs, extinct bird… [+2871 chars]"}, {"source": {"id": null, "name": "Kxan36news.com"}, "author": null, "title": "The brightest recorded supernova in history - The KXAN 36 News", "description": null, "url": "http://www.kxan36news.com/the-brightest-recorded-supernova-in-history", "urlToImage": null, "publishedAt": "2020-04-14T08:38:15Z", "content": "Scientists at Birmingham University in the UK have recorded the brightest supernova in history, as reported in an article published in the journal Nature Astronomy.\r\nAstronomers believe that a supernova SN2016aps may be the model of pulsating pair-instability… [+1034 chars]"}, {"source": {"id": null, "name": "Travelandleisure.com"}, "author": "Alison Fox", "title": "Take a Virtual Tour of the Great Barrier Reef With David Attenborough As Your Guide (Video) - Travel+Leisure", "description": "The famed narrator will take viewers on a fascinating and educational journey.", "url": "https://www.travelandleisure.com/culture-design/tv-movies/david-attenborough-narrates-great-barrier-reef-virtual-tour", "urlToImage": null, "publishedAt": "2020-03-31T19:34:36Z", "content": "While travel may currently be limited to the scope of our laptops right now, that doesn’t mean we can’t explore some of the most magnificent places on earth. And this time, we have the legendary Sir David Attenborough to help walk us through it.\r\nThe British … [+1531 chars]"}, {"source": {"id": null, "name": "Thechestnutpost.com"}, "author": "TCP Staff", "title": "NASA to Reveal Name of Next Mars Rover, Hold Media Teleconference - The Chestnut Post", "description": "NASA will unveil the name of the agency&rsquo;s next Mars rover, currently known as Mars 2020, during a live event", "url": "https://www.thechestnutpost.com/news/nasa-to-reveal-name-of-next-mars-rover-hold-media-teleconference/", "urlToImage": null, "publishedAt": "2020-03-03T21:39:21Z", "content": "This post was originally published on this siteNASA will unveil the name of the agency’s next Mars rover, currently \r\n known as Mars 2020, during a live event on NASA Television at 1:30 p.m. EST Thursday, March 5, followed by a media teleconference at 3:30 p.… [+35 chars]"}, {"source": {"id": null, "name": "Inverse.com"}, "author": "Mike Brown", "title": "How SpaceX Starlink works: price, launch date for Elon Musk's internet - Inverse", "description": "Connecting to Starlink will be really easy, Elon Musk says", "url": "https://www.inverse.com/article/62185-here-s-how-you-will-connect-to-starlink-spacex-s-internet-constellation", "urlToImage": null, "publishedAt": "2020-01-08T19:50:11Z", "content": "Starlink, SpaceXs internet connectivity satellite constellation, is taking form. The project is designed to offer higher speeds and lower latency than competing setups, so long as the receiver can see the satellites in orbit. It could help fund some of CEO El… [+4593 chars]"}]}