{"status": "ok", "totalResults": 51, "articles": [{"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Progress 75 Cargo Vehicle Launch - April 24, 2020 - NASA Video", "description": "RUSSIAN CARGO SHIP SENDS SUPPLIES TO THE INTERNATIONAL SPACE STATION The unpiloted Russian ISS Progress 75 cargo ship launched from the Baikonur Cosmodrome i...", "url": "https://www.youtube.com/watch?v=pQKFzq_vVMw", "urlToImage": null, "publishedAt": "2020-04-25T03:16:00Z", "content": null}, {"source": {"id": null, "name": "Kxan36news.com"}, "author": null, "title": "At Baikonur started refuelling of the Rocket Victory - The KXAN 36 News", "description": null, "url": "http://www.kxan36news.com/at-baikonur-started-refuelling-of-the-rocket-victory", "urlToImage": null, "publishedAt": "2020-04-24T23:30:11Z", "content": "MOSCOW, 25 APR – RIA Novosti. Filling the “Rocket” Victory began at Baikonur, the state Commission approved its launch, Roscosmos reported.\r\nEarlier it was reported that a carrier Rocket “Soyuz-2.1 a” with the ship “Progress MS-14”, which is to deliver cargo … [+314 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Michelle Starr", "title": "Scientists Capture Incredibly Rare Video of Humpback Whales Nursing Their Calves - ScienceAlert", "description": "Whales, as we all know, are different from most other sea creatures. They are mammals, and give birth to live babies… and then they nurture and raise those babies, nursing them on rich, fatty milk so they can grow big and strong.", "url": "https://www.sciencealert.com/scientists-have-captured-rare-video-of-humpback-mothers-nursing-their-calves", "urlToImage": null, "publishedAt": "2020-04-24T23:05:25Z", "content": "Whales, as we all know, are different from most other sea creatures. They are mammals, and give birth to live babies and then they nurture and raise those babies, nursing them on rich, fatty milk so they can grow big and strong.\r\nBut we can't just put whales … [+2841 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/abc-local/sophie-kesteven/7149610", "title": "Raquel is working from home during coronavirus — and that means sloths in the spare room - ABC News", "description": "Working from home means different things for different people. For Raquel, it means moving three very lazy — but very cute — new housemates into the spare room.", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-panama-working-from-home-with-sloths/12169922", "urlToImage": null, "publishedAt": "2020-04-24T22:29:37Z", "content": "Updated \r\nApril 25, 2020 08:23:26\r\nWorking from home is the new normal for many people and for Raquel Cruz Alpizar, it's meant moving three unlikely new housemates into her spare room.\r\nSince coronavirus restrictions took hold, she's been caring around the cl… [+6272 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Lisa Mayoh", "title": "Vegetable garden ideas: How to grow veggie or herb gardens in small spaces - NEWS.com.au", "description": "Vegetable garden ideas: Yes, you can grow veggie patches and herb gardens in small spaces, here’s how", "url": "https://www.news.com.au/lifestyle/home/outdoors/vegetable-garden-ideas-yes-you-can-grow-veggie-patches-and-herb-gardens-in-small-spaces-heres-how/news-story/633fd68b3498749a4e1e3f22797dacca", "urlToImage": null, "publishedAt": "2020-04-24T20:18:07Z", "content": "Anyone with a failed basil plant or limp coriander leaf will know herb gardens and veggie patches arent for the faint-hearted. But with ISO-cooking firmly on the agenda, growing our own produce is becoming a productive pastime of converted green thumbs everyw… [+5078 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "George Dvorsky", "title": "NASA Rocket Scientists Designed A Rapid-Production Ventilator In Just 37 Days - Gizmodo Australia", "description": "Introducing VITAL, a prototype ventilator designed expressly for quick and easy mass production. Developed by NASA engineers, the device could alleviate ongoing supply shortages in the U.S. and around the world as the covid-19 pandemic rages on....", "url": "https://www.gizmodo.com.au/2020/04/nasa-rocket-scientists-designed-a-rapid-production-ventilator-in-just-37-days/", "urlToImage": null, "publishedAt": "2020-04-24T19:30:00Z", "content": "Introducing VITAL, a prototype ventilator designed expressly for quick and easy mass production. Developed by NASA engineers, the device could alleviate ongoing supply shortages in the U.S. and around the world as the covid-19 pandemic rages on.\r\nNASA has cop… [+3078 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "FSU researchers discover new structure for promising class of materials - Mirage News", "description": "Biwu Ma, professor of chemistry and biochemistry, published a new study on how a novel structure could create blue light in a type of material called a...", "url": "https://www.miragenews.com/fsu-researchers-discover-new-structure-for-promising-class-of-materials/", "urlToImage": null, "publishedAt": "2020-04-24T18:02:41Z", "content": "Biwu Ma, professor of chemistry and biochemistry, published a new study on how a novel structure could create blue light in a type of material called a perovskite.\r\nFlorida State University researchers have discovered a novel structure for organic-inorganic h… [+2538 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Catalyst Opens Door To More Efficient, Environmentally Friendly Ethylene Production - Mirage News", "description": "News Releases April 24, 2020 Reaction pathways for oxidative dehydrogenation of ethane facilitated by the molten carbonate...", "url": "https://www.miragenews.com/catalyst-opens-door-to-more-efficient-environmentally-friendly-ethylene-production/", "urlToImage": null, "publishedAt": "2020-04-24T18:02:14Z", "content": "A research team led by North Carolina State University has engineered a new catalyst that can more efficiently convert ethane into ethylene, which is used in a variety of manufacturing processes. The discovery could be used in a conversion process to drastica… [+2639 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Ryan F. Mandelbaum", "title": "This Could Be The First Record Of Someone Getting Killed By A Meteorite - Gizmodo Australia", "description": "A team of scientists think they’ve found the oldest evidence of a meteorite striking and killing a person, according to a new report published in the journal journal Meteoritics & Planetary Science....", "url": "https://www.gizmodo.com.au/2020/04/this-could-be-the-first-record-of-someone-getting-killed-by-a-meteorite/", "urlToImage": null, "publishedAt": "2020-04-24T17:52:00Z", "content": "A team of scientists think theyve found the oldest evidence of a meteorite striking and killing a person, according to a new report published in the journal journal Meteoritics &amp; Planetary Science.\r\nGiven the hype around space rocks hitting Earth, there a… [+2713 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "BCI system gives paralyzed man back his sense of touch with haptic feedback - Ars Technica", "description": "Long-term goal is to develop system that works as well at home as in the laboratory.", "url": "https://arstechnica.com/science/2020/04/bci-system-gives-paralyzed-man-back-his-sense-of-touch-with-haptic-feedback/", "urlToImage": null, "publishedAt": "2020-04-24T17:51:00Z", "content": "Enlarge/ Ian Burkhard suffered a severe spinal cord injury in 2010. Battelle's NeuroLife project is restoring motor function to his right arm with a brain-computer-interface system.\r\n4 with 4 posters participating\r\nIan Burkhart, now 28, had a diving accident … [+7377 chars]"}, {"source": {"id": null, "name": "Heritagedaily.com"}, "author": "http://www.facebook.com/archaeologynews", "title": "Icelandic DNA jigsaw-puzzle brings new knowledge about Neanderthals - HeritageDaily", "description": "An international team of researchers has put together a new image of Neanderthals based on the genes Neanderthals left in the DNA of modern humans when they had children with them about 50,000 years ago.", "url": "https://www.heritagedaily.com/2020/04/icelandic-dna-jigsaw-puzzle-brings-new-knowledge-about-neanderthals/127864", "urlToImage": null, "publishedAt": "2020-04-24T12:36:00Z", "content": "An international team of researchers has put together a new image of Neanderthals based on the genes Neanderthals left in the DNA of modern humans when they had children with them about 50,000 years ago.\r\nThe researchers found the new pieces of the puzzle by … [+4934 chars]"}, {"source": {"id": null, "name": "Theconversation.com"}, "author": "Daniel Garcia-Castellanos", "title": "Tomanowos, the meteorite that survived mega-floods and human folly - The Conversation US", "description": "Tomanowos, aka the Willamette Meteorite, may be the world's most interesting rock. Its story includes catastrophic ice age floods, theft of Native American cultural heritage and plenty of human folly.", "url": "https://theconversation.com/tomanowos-the-meteorite-that-survived-mega-floods-and-human-folly-134213", "urlToImage": null, "publishedAt": "2020-04-24T12:23:00Z", "content": "The rock with arguably the most fascinating story on Earth has an ancient name: Tomanowos. It means the visitor from heaven in the extinct language of Oregons Clackamas Indian tribe.\r\nThe Clackamas revered the Tomanowos also known as the Willamette meteorite … [+6446 chars]"}, {"source": {"id": null, "name": "Theconversation.com"}, "author": "Rodger I. Thompson", "title": "How the Hubble Space Telescope opened our eyes to the first galaxies of the universe - The Conversation US", "description": "Thirty years ago the Hubble Space Telescope began snapping photos of distant stars, providing a time machine that has taken astronomers back to when the universe was less than a billion years old.", "url": "https://theconversation.com/how-the-hubble-space-telescope-opened-our-eyes-to-the-first-galaxies-of-the-universe-133877", "urlToImage": null, "publishedAt": "2020-04-24T12:22:00Z", "content": "The Hubble Space Telescope launched on the 24th of April, 30 years ago. Its an impressive milestone especially as its expected lifespan was just 10 years.\r\nOne of the primary reasons for the Hubble telescopes longevity is that it can be serviced and improved … [+6948 chars]"}, {"source": {"id": null, "name": "Brinkwire.com"}, "author": null, "title": "Lyrid meteor shower to light up night sky with 20 fireballs an hour - Brinkwire", "description": null, "url": "https://en.brinkwire.com/news/lyrid-meteor-shower-to-light-up-night-sky-with-20-fireballs-an-hour/", "urlToImage": null, "publishedAt": "2020-04-24T12:15:41Z", "content": "A METEOR shower will be visible across the UK with its peak due on Tuesday night into Wednesday morning, experts say.\r\nThe shooting stars will be seen in the night sky in the first major showers since January. The Lyrid meteor shower could even bring fireball… [+2749 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Researchers solve 'link discovery' problem for terahertz data networks - Mirage News", "description": "A team of researchers from Brown and Rice universities has demonstrated a way to help devices to find each other in the ultra-fast terahertz data...", "url": "https://www.miragenews.com/researchers-solve-link-discovery-problem-for-terahertz-data-networks/", "urlToImage": null, "publishedAt": "2020-04-24T12:14:36Z", "content": "PROVIDENCE, R.I. [Brown University] – When someone opens a laptop, a router can quickly locate it and connect it to the local Wi-Fi network. That ability is a basic element of any wireless network known as link discovery, and now a team of researchers has dev… [+3883 chars]"}, {"source": {"id": null, "name": "Eurekalert.org"}, "author": null, "title": "Warming climate undoes decades of knowledge of marine protected areas - EurekAlert", "description": "A new study highlights that tropical coral reef marine reserves can offer little defence in the face of climate change impacts. And the changes that are being observed will force scientists, conservationists and reserve managers to rethink the role these prot…", "url": "https://www.eurekalert.org/pub_releases/2020-04/lu-wcu042120.php", "urlToImage": null, "publishedAt": "2020-04-24T09:02:26Z", "content": "IMAGE: A recovering reef in Seychelles.\r\n view more \r\nCredit: Nick Graham, Lancaster University\r\nClimate change and warming seas are transforming tropical coral reefs and undoing decades of knowledge about how to protect these delicate and vital ecosystems.\r\n… [+4796 chars]"}, {"source": {"id": null, "name": "H2-view.com"}, "author": "Molly Burgess", "title": "New eco-friendly fuel for fuel cell production - H2 View", "description": "Researchers at the University of Saskatchewan have developed a new eco-friendly fuel which can be used to create other by-products for hydrogen fuel cells.", "url": "https://www.h2-view.com/story/new-eco-friendly-fuel-for-fuel-cell-production/", "urlToImage": null, "publishedAt": "2020-04-24T08:38:34Z", "content": "Researchers at the University of Saskatchewan have developed a new eco-friendly fuel which can be used to create other by-products for hydrogen fuel cells.\r\nAs part of their research, Sonil Nanda, USask chemical and biological engineering research associate a… [+1205 chars]"}, {"source": {"id": null, "name": "China.org.cn"}, "author": "蔺丽瑶", "title": "China's first Mars exploration mission named Tianwen-1 - China.org.cn", "description": null, "url": "http://www.china.org.cn/china/2020-04/24/content_75972021.htm", "urlToImage": null, "publishedAt": "2020-04-24T08:09:42Z", "content": "Photo taken on Nov. 14, 2019 shows the trial ground of an experiment for landing on Mars in Huailai County, north China's Hebei Province. [Photo/Xinhua]\r\nChina's first Mars exploration mission has been named Tianwen-1, announced the China National Space Admin… [+2891 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Tom Cowie, Chloe Booker", "title": "Shopping returning and hopes high for footy restart - The Age", "description": "The Emporium shopping centre is reopening and the AFL has the backing of health authorities to restart in June, offering those with itchy feet hope that Victoria is emerging from pandemic lockdown.", "url": "https://www.theage.com.au/national/victoria/shopping-returning-and-hopes-high-for-footy-restart-20200424-p54n0p.html", "urlToImage": null, "publishedAt": "2020-04-24T08:07:09Z", "content": "However, that was still well down on the average in the past year of 3042.\r\nIt wouldn't be winter in Melbourne without footy and authorities have given a cautious green light to the AFL to proceed with plans to resume playing in June.\r\n\"There's a chance,\" Chi… [+2351 chars]"}, {"source": {"id": null, "name": "Abc14news.com"}, "author": "Brandon G. Jones", "title": "Coronavirus: Body 'in industrial fridge for six days' - ABC 14 News", "description": "Impression copyright                 Spouse and children image                                                                    Imp", "url": "https://abc14news.com/2020/04/24/coronavirus-body-in-industrial-fridge-for-six-days/", "urlToImage": null, "publishedAt": "2020-04-24T07:56:00Z", "content": "Impression copyrightSpouse and children image\r\nImpression captionUmar Afzal was a Household Business office interpreter and spoke “50 % a dozen languages”\r\nThe previous chief prosecutor Nazir Afzal stated his brother’s body was saved in an industrial fridge f… [+2165 chars]"}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Ethelene Bailey", "title": "Plate Tectonics Might Have Started 3 Billion Years Ago - Dual Dove", "description": "Plate tectonics are as crucial as Earth itself. They are the reason Earth looks the way it does, with all the mountains and the composition of the atmosphere. The significance of tectonic plates Te…", "url": "https://www.dualdove.com/plate-tectonics-might-have-started-3-billion-years-ago/9704/", "urlToImage": null, "publishedAt": "2020-04-24T06:33:45Z", "content": "Plate tectonics are as crucial as Earth itself. They are the reason Earth looks the way it does, with all the mountains and the composition of the atmosphere.\r\nThe significance of tectonic plates\r\nTectonic plates are responsible for bringing Earths viscera to… [+2943 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Will Dunham", "title": "Bugged: Earth's land insects are disappearing - Brisbane Times", "description": "A new study, based on 166 sets of data covering 1676 sites in 41 countries dating as far back as 1925, is the most ubiquitous and diverse animals on the planet.", "url": "https://www.smh.com.au/world/north-america/bugged-earth-s-land-insects-are-disappearing-20200424-p54n1n.html", "urlToImage": null, "publishedAt": "2020-04-24T06:07:00Z", "content": "Other bugs are disappearing at a rate of just under 1 per cent a year, with lots of variation from place to place, according to the study published in the journal Science.\r\nThat's a tinier population decline than found by some smaller localised studies, which… [+2180 chars]"}, {"source": {"id": null, "name": "News-medical.net"}, "author": null, "title": "A protein discovery could pave way to better treatments for obesity - News-Medical.net", "description": "A USC-led international team of scientists has found the precise shape of a key player in human metabolism, which could lead the way to better treatments for obesity and other metabolic disease.", "url": "https://www.news-medical.net/news/20200423/A-protein-discovery-could-pave-way-to-better-treatments-for-obesity.aspx", "urlToImage": null, "publishedAt": "2020-04-24T03:02:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Apr 23 2020\r\nA USC-led international team of scientists has found the precise shape of a key player in human metabolism, which could lead the way to better treatments for obesity and other metabolic disease.\r\nFor the study, t… [+2915 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "", "title": "Look, no people: Sydney seen from the air during coronavirus lockdown – in pictures - The Guardian", "description": "Getty photographers Cameron Spencer and Ryan Pierse take to the skies to capture the sights of Australia’s biggest city during the coronavirus pandemic", "url": "https://www.theguardian.com/australia-news/gallery/2020/apr/24/look-no-people-sydney-seen-from-the-air-during-coronavirus-lockdown-in-pictures", "urlToImage": null, "publishedAt": "2020-04-24T01:12:00Z", "content": "Getty photographers Cameron Spencer and Ryan Pierse take to the skies to capture the sights of Australias biggest city during the Covid-19 pandemic. New South Wales residents can be fined for leaving their homes unless they have a reasonable excuse. The laws … [+83 chars]"}, {"source": {"id": null, "name": "Bodyandsoul.com.au"}, "author": "Juna Xu", "title": "Coronavirus: How to properly wear a face mask to protect against COVID-19 - Body and Soul", "description": "So many people are incorrectly wearing face masks, so here’s how to wear one properly", "url": "https://www.bodyandsoul.com.au/health/health-advice/so-many-people-are-incorrectly-wearing-face-masks-so-heres-how-to-wear-one-properly/news-story/25e9907b6c88d9ecc287b1fece958ae9", "urlToImage": null, "publishedAt": "2020-04-24T00:46:45Z", "content": "Face masks are only effective at protecting yourself, and others, from COVID-19 if worn and used correctly. Here's how to do it properly.Unless you work in the medical field, there’s a good chance you haven’t had much reason to wear a face mask.\r\nBut we’re li… [+3686 chars]"}, {"source": {"id": null, "name": "Nippon.com"}, "author": null, "title": "Japanese Probe Brings New Insight into Strong Winds on Venus - Nippon.com", "description": "Tokyo, April 24 (Jiji Press)--Data from the Japanese Venus probe Akatsuki have brought a new insight into the …", "url": "https://www.nippon.com/en/news/yjj2020042400122/", "urlToImage": null, "publishedAt": "2020-04-24T00:34:00Z", "content": "Tokyo, April 24 (Jiji Press)--Data from the Japanese Venus probe Akatsuki have brought a new insight into the superstrong winds blowing on the second planet from the sun, a research team has said.\r\nVenus has a thick atmosphere that rotates 60 times as fast as… [+725 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "CNN", "title": "Giant asteroid flying by Earth next week looks like it’s wearing a face mask - 7NEWS.com.au", "description": "An observatory has spotted a strange discovery on an asteroid moving at 31,000 kilometres per hour.", "url": "https://7news.com.au/technology/space/giant-asteroid-flying-by-earth-next-week-looks-like-its-wearing-a-face-mask-c-996383", "urlToImage": null, "publishedAt": "2020-04-23T23:08:10Z", "content": "An asteroid estimated to be 1.9 km wide will fly by Earth next week, but its not expected to collide with our planet.\r\nAnd if an asteroid could be aware of such things, it appears to be wearing a face mask in deference to the pandemic, according to new images… [+2912 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "SpaceX Starship SN4 is almost ready for its turn on the test stand - CNET", "description": "Work on the latest iteration of Elon Musk's Mars rocket is progressing rapidly despite some setbacks.", "url": "https://www.cnet.com/news/spacex-starship-sn4-prototype-is-almost-ready-for-its-turn-on-test-stand/", "urlToImage": null, "publishedAt": "2020-04-23T22:47:02Z", "content": "While many businesses in Texas are shuttered due to the COVID-19 pandemic, SpaceX has been busy assembling the latest Starship prototype at its Boca Chica development facility. The early version of Elon Musk's Mars rocket has the serial number SN4, and he sha… [+1175 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mars' seasons compared to other planets including Earth - AccuWeather", "description": "Why do we have seasons? It's because our planet is tilted on its axis just enough so that we have four seasons, as Earth continues its orbit around the Sun. ...", "url": "https://www.youtube.com/watch?v=aKQdl3blWR0", "urlToImage": null, "publishedAt": "2020-04-23T20:56:13Z", "content": "Why do we have seasons? It's because our planet is tilted on its axis just enough so that we have four seasons, as Earth continues its orbit around the Sun. But what about other planets?"}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Holly Secon", "title": "The most detailed map of the moon's geology ever released may help astronauts explore the lunar surface - Business Insider Australia", "description": "We only ever see  one side of the moon and, most nights, only parts of it are visible.", "url": "https://www.businessinsider.com.au/map-moon-lunar-surface-features-craters-geology-most-detailed-usgs-2020-4", "urlToImage": null, "publishedAt": "2020-04-23T20:39:00Z", "content": "<ul><li>\r\nThe US Geologic Survey (USGS) just released the most detailed map ever of moon’s surface features and geology as a spinning 3D moon.\r\n</li><li>\r\nThe map shows brightly coloured spots on the lunar surface, representing different ages of the geologica… [+3764 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Atmospheric tidal waves maintain Venus' super-rotation - Mirage News", "description": "Images from the Akatsuki spacecraft unveil what keeps Venus's atmosphere rotating much faster than the planet itself. An international research team led...", "url": "https://www.miragenews.com/atmospheric-tidal-waves-maintain-venus-super-rotation/", "urlToImage": null, "publishedAt": "2020-04-23T19:06:15Z", "content": "Images from the Akatsuki spacecraft unveil what keeps Venus’s atmosphere rotating much faster than the planet itself.\r\nAn international research team led by Takeshi Horinouchi of Hokkaido University has revealed that this ‘super-rotation’ is maintained near t… [+3604 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Ryan F. Mandelbaum", "title": "Astronomers Think They Have Found A Whole Population Of Rocks From Outside The Solar System - Gizmodo Australia", "description": "Astronomers think they’ve found an entire population of asteroids originating from outside our solar system, according to a new paper....", "url": "https://www.gizmodo.com.au/2020/04/astronomers-think-theyve-found-a-whole-population-of-rocks-from-outside-the-solar-system/", "urlToImage": null, "publishedAt": "2020-04-23T19:05:00Z", "content": "Astronomers think theyve found an entire population of asteroids originating from outside our solar system, according to a new paper.\r\nThe objects at the centre of this investigation arent new discoveries. Called the Centaurs, theyre mysterious asteroids that… [+3260 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Revealed that Planet Shell Began To Move 3.2 Billion Years Ago - Somag News", "description": "Researchers made a new discovery of the planet’s motion as a result of their work in the Pilbara region in Western Australia. The motion of the planet crust, as it was announced, dates back 200 million years before it was known. It was discovered that the tec…", "url": "https://www.somagnews.com/revealed-planet-shell-began-move-3-2-billion-years-ago/", "urlToImage": null, "publishedAt": "2020-04-23T18:34:00Z", "content": "Researchers made a new discovery of the planet’s motion as a result of their work in the Pilbara region in Western Australia. The motion of the planet crust, as it was announced, dates back 200 million years before it was known.\r\nIt was discovered that the te… [+1984 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Rosie McCall", "title": "Levels of Ocean Biodiversity Have Barely Changed for Hundreds of Millions of Years, Scientists Say - Newsweek", "description": "Scientists have analyzed fossils from the Cambrian explosion 540 million years ago to the present day to explore levels of marine biodiversity over time.", "url": "https://www.newsweek.com/levels-ocean-biodiversity-remained-stable-hundred-1499842", "urlToImage": null, "publishedAt": "2020-04-23T18:10:25Z", "content": "Levels of biodiversity in the world's oceans have remained virtually unchanged for hundreds of millions of years, according to a new study published in Science.\r\nThe conclusion that marine biodiversity has stayed stable over time and not mushroomed over the l… [+3686 chars]"}, {"source": {"id": null, "name": "Globalhealthnewswire.com"}, "author": "News", "title": "How Birds Evolved Big Brains - Global Health News Wire", "description": "An international team of evolutionary biologists and paleontologists have reconstructed the evolution of the avian brain using a massive dataset of brain volumes from dinosaurs, extinct birds like Archaeopteryx and the Great Auk, and modern birds. The study, …", "url": "https://globalhealthnewswire.com/research/2020/04/23/how-birds-evolved-big-brains/%20", "urlToImage": null, "publishedAt": "2020-04-23T16:51:00Z", "content": "The Eurasian Jay, a member of the large-brain bird family Corvidae.\r\nAn international team of evolutionary biologists and paleontologists have reconstructed the evolution of the avian brain using a massive dataset of brain volumes from dinosaurs, extinct bird… [+2871 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "NASA Interns to Speak with NASA Astronaut Aboard Space Station - Mirage News", "description": "Expedition 63 crewmember Chris Cassidy of NASA gives a thumbs while his Sokol suit pressure is checked ahead of his launch on a Soyuz rocket with Anatoly...", "url": "https://www.miragenews.com/nasa-interns-to-speak-with-nasa-astronaut-aboard-space-station/", "urlToImage": null, "publishedAt": "2020-04-23T16:18:11Z", "content": "Students participating in NASA internships will have an opportunity next week to talk with a NASA astronaut aboard the International Space Station. The Earth-to-space call will air live at 12:05 p.m. EDT Tuesday, April 28, on NASA television and the agencys w… [+1405 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "The Florida Aquarium just made a breakthrough that will help save the third largest coral reef in the world - CNN", "description": "Ridged cactus coral are just one of a variety of species rescued from Florida's waters after coral reefs in the state began undergoing a major disease outbreak that started in 2014. The aquarium has successfully reproduced them in human care.", "url": "https://www.cnn.com/2020/04/22/us/florida-aquarium-first-reproduce-ridhed-cactus-coral-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-23T15:05:48Z", "content": null}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Graham Rapier", "title": "Elon Musk announces that early access to the Starlink satellite-internet project will launch this year - Business Insider Australia", "description": "", "url": "https://www.businessinsider.com.au/elon-musk-spacex-starlink-will-launch-beta-test-six-months-2020-4", "urlToImage": null, "publishedAt": "2020-04-23T15:05:45Z", "content": "<ul><li>Elon Musk said SpaceX’s Starlink would launch a beta test within months.</li><li>In a tweet, the founder said a private beta would launch in three months with a public beta shortly after.</li><li>Northern latitudes, where rural communities often lack … [+2472 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Darrell Etherington", "title": "MIT develops machine-washable sensors that embed in clothing for constant vital sign monitoring - Yahoo Finance Australia", "description": "MIT has developed a new type of lightweight sensor that can be integrated into flexible fabrics, including the kinds of polyesters often used in athletic wear, to provide constant monitoring of vital signs including body temperature, heart rate and respirator…", "url": "https://au.finance.yahoo.com/news/mit-develops-machine-washable-sensors-150142223.html", "urlToImage": null, "publishedAt": "2020-04-23T15:01:00Z", "content": "MIT has developed a new type of lightweight sensor that can be integrated into flexible fabrics, including the kinds of polyesters often used in athletic wear, to provide constant monitoring of vital signs including body temperature, heart rate and respirator… [+2502 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Protecting Australia's reptiles and amphibians with global impact - Phys.org", "description": "Ecosystems around the world rely on reptiles and amphibians. They play a crucial role as part of the food web—as predator and prey—and, sometimes, a role in pollination and dispensing seeds. Frogs provide a good sign of ecosystem health due to their sensitivi…", "url": "https://phys.org/news/2020-04-australia-reptiles-amphibians-global-impact.html", "urlToImage": null, "publishedAt": "2020-04-23T14:11:25Z", "content": "Ecosystems around the world rely on reptiles and amphibians. They play a crucial role as part of the food webas predator and preyand, sometimes, a role in pollination and dispensing seeds. Frogs provide a good sign of ecosystem health due to their sensitivity… [+4322 chars]"}, {"source": {"id": null, "name": "Globalhealthnewswire.com"}, "author": "News", "title": "Researchers Rebuild the Bridge Between Neuroscience and Artificial Intelligence - Global Health News Wire", "description": "The origin of machine and deep learning algorithms, which increasingly affect almost all aspects of our life, is the learning mechanism of synaptic (weight) strengths connecting neurons in our brain. Attempting to imitate these brain functions, researchers br…", "url": "https://globalhealthnewswire.com/technology/2020/04/23/researchers-rebuild-the-bridge-between-neuroscience-and-artificial-intelligence/%20", "urlToImage": null, "publishedAt": "2020-04-23T13:39:00Z", "content": "The origin of machine and deep learning algorithms, which increasingly affect almost all aspects of our life, is the learning mechanism of synaptic (weight) strengths connecting neurons in our brain. Attempting to imitate these brain functions, researchers br… [+2926 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Study shows destination of NASA's next Mars rover could preserve evidence of past life - Mirage News", "description": "New research indicates river delta deposits within Mars' Jezero crater - the destination of NASA' Perseverance rover on the Red Planet - formed over time...", "url": "https://www.miragenews.com/study-shows-destination-of-nasa-s-next-mars-rover-could-preserve-evidence-of-past-life/", "urlToImage": null, "publishedAt": "2020-04-23T13:04:14Z", "content": "New research indicates river delta deposits within Mars’ Jezero crater – the destination of NASA’ Perseverance rover on the Red Planet – formed over time scales that promoted habitability and enhanced preservation of evidence.\r\n By Danielle Torrent Tucker \r\nU… [+4963 chars]"}, {"source": {"id": null, "name": "Foreignbrief.com"}, "author": null, "title": "China to name first Mars exploration mission - Foreign Brief", "description": "In celebration of China’s Space Day today, the Chinese National Space Administration will announce the name of its first Mars", "url": "https://www.foreignbrief.com/daily-news/china-to-name-first-mars-exploration-mission/", "urlToImage": null, "publishedAt": "2020-04-23T10:00:15Z", "content": "Photo: CASC\r\nIn celebration of Chinas Space Day today, the Chinese National Space Administration will announce the name of its first Mars rover.\r\nThe explorer is planned to launch in late July and would arrive at the Red Planet in February 2021. A 2020 launch… [+1240 chars]"}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Rada Mateescu", "title": "Devastating Simulations Shock The World – Arctic Summers Will Bring Massive Change - Dual Dove", "description": "For millions and millions of years, the Arctic observed a ritual that remained the same over time. During the winters, the Arctic Sea Ice is expanding, and sub-zero polar temperatures freeze waters…", "url": "https://www.dualdove.com/devastating-simulations-shock-the-world-arctic-summers-will-bring-massive-change/9664/", "urlToImage": null, "publishedAt": "2020-04-23T09:24:53Z", "content": "For millions and millions of years, the Arctic observed a ritual that remained the same over time. During the winters, the Arctic Sea Ice is expanding, and sub-zero polar temperatures freeze waters in their place.\r\nDuring the summer, the ice pack is retreatin… [+1987 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Researchers create seismic stress map of North America - Mirage News", "description": "A new stress map that reveals the forces acting on the planet's crust will contribute to safer energy exploration, updated seismic hazard maps and...", "url": "https://www.miragenews.com/researchers-create-seismic-stress-map-of-north-america/", "urlToImage": null, "publishedAt": "2020-04-23T09:02:14Z", "content": "A new stress map that reveals the forces acting on the planet’s crust will contribute to safer energy exploration, updated seismic hazard maps and improved knowledge about the Earth.\r\n By Danielle Torrent Tucker \r\nHow do mountains form? What forces are needed… [+4604 chars]"}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Tanya Thompson", "title": "The Origins of Life – The Visible Universe Might Be Barren, New Research Revealed - Dual Dove", "description": "The way life emerged on Earth mimics the way the Universe was created. You can call it the Big Bang of life. Just like the Big Bang was the explosion of a singularity the size of a peach, the same …", "url": "https://www.dualdove.com/the-origins-of-life-the-visible-universe-might-be-barren-new-research-revealed/9650/", "urlToImage": null, "publishedAt": "2020-04-23T08:36:41Z", "content": "The way life emerged on Earth mimics the way the Universe was created. You can call it the Big Bang of life. Just like the Big Bang was the explosion of a singularity the size of a peach, the same way a non-living entity exploded into life.\r\nAnd just like the… [+2368 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "It takes water to give volcanoes fire and fury - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-23T08:01:00Z", "content": null}, {"source": {"id": null, "name": "Spacedaily.com"}, "author": null, "title": "Hungry galaxies grow fat on the flesh of their neighbors - Space Daily", "description": "Canberra, Australia (SPX) Apr 23, 2020 - \r\nGalaxies grow large by eating their smaller neighbours, new research reveals. \r\n\r\nExactly how massive galaxies attain their size is poorly understood, not least because they swell over billions of", "url": "https://www.spacedaily.com/reports/Hungry_galaxies_grow_fat_on_the_flesh_of_their_neighbors_999.html", "urlToImage": null, "publishedAt": "2020-04-23T06:47:37Z", "content": "Galaxies grow large by eating their smaller neighbours, new research reveals.\r\nExactly how massive galaxies attain their size is poorly understood, not least because they swell over billions of years. But now a combination of observation and modelling from re… [+3940 chars]"}, {"source": {"id": null, "name": "Nanowerk.com"}, "author": null, "title": "New dual-action coating keeps bacteria from cross-contaminating fresh produce - Nanowerk", "description": "Over the course of their journey from the open fields to the produce displays at grocery stores, fresh vegetables and fruits can sometimes become contaminated by microorganisms. These items can then spoil other produce, spreading the contamination further and…", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=54991.php", "urlToImage": null, "publishedAt": "2020-04-23T05:46:59Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NASA captures Earth for more than 50 years - KCRA News", "description": "As the world celebrates 50 years of Earth Day, one agency has been processing information and images for all those decades to improve the planet. NASA has be...", "url": "https://www.youtube.com/watch?v=DedinBELMiA", "urlToImage": null, "publishedAt": "2020-04-23T03:07:42Z", "content": "As the world celebrates 50 years of Earth Day, one agency has been processing information and images for all those decades to improve the planet. NASA has been taking Earth Day to heart every day over past the five decades. Get the full story in the video abo… [+233 chars]"}]}