{"status": "ok", "totalResults": 39, "articles": [{"source": {"id": null, "name": "Smh.com.au"}, "author": "Seth Borenstein", "title": "Astronomers find new black hole, this time in our 'neighbourhood' - Sydney Morning Herald", "description": "The discovery of a closer black hole, which is in the constellation Telescopium in the Southern Hemisphere, hints that there are more of these out there.", "url": "https://www.smh.com.au/world/north-america/astronomers-find-new-black-hole-this-time-in-our-neighbourhood-20200507-p54qr6.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.2439%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_97/t_crop_custom/q_86%2Cf_auto/ddbc402e879cabfc886dbbc88095761d03f92ef9", "publishedAt": "2020-05-07T03:17:31Z", "content": "The discovery of a closer black hole, which is in the constellation Telescopium in the Southern Hemisphere, hints that there are more of these out there. Astronomers theorise there are between 100 million to 1 billion of these small but dense objects in the M… [+1641 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "ACC risking thousands of essential care and support worker jobs - Mirage News", "description": "Over 25,000 care and support workers throughout New Zealand provide essential, life-critical services within our communities every...", "url": "https://www.miragenews.com/acc-risking-thousands-of-essential-care-and-support-worker-jobs/", "urlToImage": "https://cdn1.miragenews.com/wp-content/uploads/2019/04/news-and-developments.jpg", "publishedAt": "2020-05-07T01:10:13Z", "content": "Over 25,000 care and support workers throughout New Zealand provide essential, life-critical services within our communities every day.This includes ACC’s most vulnerable clients, allowing them to recover and remain in the comfort of their own homes with thei… [+2831 chars]"}, {"source": {"id": null, "name": "3wnews.org"}, "author": null, "title": "Phones Wireless Charging (product) Production Hindered by Difficulties in Raw Material Procurement by Prominent Manufacturers amid COVID-249 - 3rd Watch News", "description": null, "url": "https://3wnews.org/uncategorised/752391/phones-wireless-charging-product-production-hindered-by-difficulties-in-raw-material-procurement-by-prominent-manufacturers-amid-covid-249/", "urlToImage": null, "publishedAt": "2020-05-06T23:12:00Z", "content": "The global Phones Wireless Charging market study encloses the projection size of the market both in terms of value (Mn/Bn US$) and volume (x units). With bottom-up and top-down approaches, the report predicts the viewpoint of various domestic vendors in the w… [+3310 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NASA Science Live: On Ice - NASA", "description": "Join NASA ice experts as we discuss important science about Earth's icy regions, and how it can impact us here in warmer environments. NASA’s ICESat-2 missio...", "url": "https://www.youtube.com/watch?v=jQaxUUraV_c", "urlToImage": "https://i.ytimg.com/vi/jQaxUUraV_c/maxresdefault.jpg", "publishedAt": "2020-05-06T19:00:10Z", "content": "Join NASA ice experts as we discuss important science about Earth's icy regions, and how it can impact us here in warmer environments. NASAs ICESat-2 mission uses a laser instrument on a satellite to precisely measure ice and just released new findings about … [+318 chars]"}, {"source": {"id": null, "name": "News-medical.net"}, "author": null, "title": "New anti-phage defense mechanism in bacteria protects their DNA, finds study - News-Medical.Net", "description": "Researchers from Singapore-MIT Alliance for Research and Technology, MIT's research enterprise in Singapore, have discovered a new anti-phage defense mechanism found in some bacteria, which uses previously unknown features to protect their DNA.", "url": "https://www.news-medical.net/news/20200506/New-anti-phage-defense-mechanism-in-bacteria-protects-their-DNA-finds-study.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2016%2f3%2fbacteria_-_Sebastian_Kaulitzki_46826fb7971649bfaca04a9b4cef3309-620x480.jpg", "publishedAt": "2020-05-06T18:12:08Z", "content": "Reviewed by Emily Henderson, B.Sc.May 6 2020\r\nResearchers from Singapore-MIT Alliance for Research and Technology (SMART), MIT's research enterprise in Singapore, have discovered a new anti-phage defence mechanism found in some bacteria, which uses previously… [+3151 chars]"}, {"source": {"id": null, "name": "Sciencemag.org"}, "author": null, "title": "KAGUYA observation of global emissions of indigenous carbon ions from the Moon - Science Advances", "description": "Carbon is a volatile element that has a considerable influence on the formation and evolution of planetary bodies, although it was previously believed to be depleted in the Moon. We present observations by the lunar orbiter KAGUYA of carbon ions emitted from …", "url": "https://advances.sciencemag.org/content/6/19/eaba1050.full", "urlToImage": "https://advances.sciencemag.org/content/6/19/eaba1050/F1.large.jpg", "publishedAt": "2020-05-06T18:00:42Z", "content": "Abstract\r\nCarbon is a volatile element that has a considerable influence on the formation and evolution of planetary bodies, although it was previously believed to be depleted in the Moon. We present observations by the lunar orbiter KAGUYA of carbon ions emi… [+19597 chars]"}, {"source": {"id": null, "name": "News-medical.net"}, "author": null, "title": "New study investigates the brain's action plans during walking - News-Medical.Net", "description": "Walking across the room to switch on a light - such a simple everyday activity involves enormously complex computations by the brain as it requires interpretation of the scene, control of the gait and planning upcoming movements such as the arm movement to th…", "url": "https://www.news-medical.net/news/20200506/New-study-investigates-the-brains-action-plans-during-walking.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2017%2f5%2fyoung_fitness_woman_legs_walking_on_forest_trail-lzf_2bd66c6bf5814da3abf769cf48ed9ff1-620x480.jpg", "publishedAt": "2020-05-06T16:35:52Z", "content": "Reviewed by Emily Henderson, B.Sc.May 6 2020\r\nWalking across the room to switch on a light - such a simple everyday activity involves enormously complex computations by the brain as it requires interpretation of the scene, control of the gait and planning upc… [+5069 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Severe coral loss leaves reefs with larger fish but low energy turnover - Science Daily", "description": "Research has found severe coral loss to be associated with substantial increases in the size of large, long-living herbivorous fish. However, decreased recycling of this fish biomass could leave the ecosystem vulnerable to crashing.", "url": "https://www.sciencedaily.com/releases/2020/05/200506091541.htm", "urlToImage": null, "publishedAt": "2020-05-06T16:10:43Z", "content": "Research on the Great Barrier Reef has found severe coral loss to be associated with substantial increases in the size of large, long-living herbivorous fish. However, decreased recycling of this fish biomass could leave the ecosystem vulnerable to crashing. … [+4110 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Aristos Georgiou", "title": "Largest Impact Event in Recorded History May Have Been An Iron Asteroid That Never Actually Hit Earth - Newsweek", "description": "The explosion over Siberia—which has come to be known as the \"Tunguska event\"—has long puzzled experts.", "url": "https://www.newsweek.com/largest-impact-event-recorded-history-iron-asteroid-hit-earth-1502364", "urlToImage": "https://d.newsweek.com/en/full/1587794/tunguska-event.jpg", "publishedAt": "2020-05-06T16:06:41Z", "content": "The largest impact event in recorded history may have been caused by the shock waves generated by an iron asteroid that entered the Earth's atmosphere at a shallow angle before heading back into space, a team of Russian scientists have proposed.\r\nThe research… [+5786 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Astronaut Chris Cassidy Thanks Essential Workers from the International Space Station - NASA", "description": "NASA astronaut and U.S. Navy SEAL Chris Cassidy sends a message from the International Space Station, thanking all on the front lines facing COVID-19, our in...", "url": "https://www.youtube.com/watch?v=G690YvtHYEA", "urlToImage": "https://i.ytimg.com/vi/G690YvtHYEA/maxresdefault.jpg", "publishedAt": "2020-05-06T15:59:34Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Desert 'Rover' Helps NASA Scientists Prepare for Mars - NASA Jet Propulsion Laboratory", "description": "Did life ever form on Mars? NASA is launching its new Perseverance rover to find out. In February 2020, mission scientists practiced skills they’ll need whil...", "url": "https://www.youtube.com/watch?v=y3WqWazeWlI", "urlToImage": "https://i.ytimg.com/vi/y3WqWazeWlI/maxresdefault.jpg", "publishedAt": "2020-05-06T15:52:38Z", "content": "Did life ever form on Mars? NASA is launching its new Perseverance rover to find out. In February 2020, mission scientists practiced skills theyll need while Perseverance explores the Red Planet. A seven-person field team served as a simulated rover, carrying… [+487 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "George Dvorsky", "title": "Bioluminescent Waves Draw Crowds To California Beaches - Gizmodo Australia", "description": "Stunning bioluminescent waves are crashing onto southern California shores. It’s quite the spectacle, but the light show is drawing crowds amid social distancing concerns....", "url": "https://www.gizmodo.com.au/2020/05/bioluminescent-waves-draw-crowds-to-california-beaches/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/jgqtzjxvaczlc4oidu3d.jpg", "publishedAt": "2020-05-06T15:40:00Z", "content": "Stunning bioluminescent waves are crashing onto southern California shores. Its quite the spectacle, but the light show is drawing crowds amid social distancing concerns.\r\nShores between Baja California and Los Angeles are experiencing a significant algal blo… [+3771 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Second skin protects against chem, bio agents - Mirage News", "description": "The smart protection mechanism of responsive nanotube membranes against environmental threats. The collapse of actuating polymer chains on the...", "url": "https://www.miragenews.com/second-skin-protects-against-chem-bio-agents/", "urlToImage": "https://www.llnl.gov/sites/www/files/styles/scaled_425h/public/2020-05/RCHEN_natureMaterials_875x500px.jpg?itok=aMRpCLC5", "publishedAt": "2020-05-06T14:56:11Z", "content": "The smart protection mechanism of responsive nanotube membranes against environmental threats. The collapse of actuating polymer chains on the contaminated membrane surface prevents nerve agents like sarin from entering the SWCNT pores. In a safe environment,… [+5722 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Exclusive: U.S. drafting pact for moon mining - sources - Reuters", "description": "The White House will soon propose an international agreement governing mining and commerce on the moon, aiming to attract like-minded space-faring countries ...", "url": "https://www.youtube.com/watch?v=XtyJndeQ4dc", "urlToImage": "https://i.ytimg.com/vi/XtyJndeQ4dc/hqdefault.jpg", "publishedAt": "2020-05-06T14:50:04Z", "content": "The White House will soon propose an international agreement governing mining and commerce on the moon, aiming to attract like-minded space-faring countries to update a 1967 agreement on space law. \r\nSubscribe: http://smarturl.it/reuterssubscribe\r\nReuters bri… [+372 chars]"}, {"source": {"id": null, "name": "Azocleantech.com"}, "author": null, "title": "Air-Plasma-Based Jet Engine Could Replace Fossil Fuel Jet Engine - AZoCleantech", "description": "At the Institute of Technological Sciences at Wuhan University, a research team has developed a prototype device that makes use of microwave air plasmas for jet propulsion.", "url": "https://www.azocleantech.com/news.aspx?newsID=27248", "urlToImage": "https://www.azocleantech.com/images/news/ImageForNews_27248_15887618390158364.png", "publishedAt": "2020-05-06T14:49:00Z", "content": "Written by AZoCleantechMay 6 2020\r\nFossil fuels have turned out to be the essential energy source that humans rely on, particularly for transportation.\r\nA schematic diagram of a prototype microwave air plasma thruster and the images of the bright plasma jet a… [+2805 chars]"}, {"source": {"id": null, "name": "Mining.com"}, "author": null, "title": "Russia questions legality of US-planned moon mining pact - MINING.com", "description": "Kremlin says legal framework for mining on the moon should be examined to make sure it complies with international laws.", "url": "https://www.mining.com/russia-questions-legality-of-us-planned-moon-mining-pact/", "urlToImage": "https://www.mining.com/wp-content/uploads/2020/05/moon-featured-image.jpg", "publishedAt": "2020-05-06T13:39:00Z", "content": "Aircraft taking off from Ronald Reagan National Airport in Arlington, Virginia. (Public domain CC0 image.)\r\nRussia is questioning a US-proposed global legal framework for mining on the moon, saying the document would have to be examined thoroughly to make sur… [+4707 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Darrell Etherington", "title": "SpaceX's Starship prototype successfully completes key engine static fire test - Yahoo Finance Australia", "description": "SpaceX's  Starship prototype is on a streak of successes, at a key moment for the spacecraft's development.  The Starship SN4 (so-named because it's the fourth full-size prototype) tester managed to pass a test of its Raptor engine firing while installed on t…", "url": "https://au.finance.yahoo.com/news/spacexs-starship-prototype-successfully-completes-124759167.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/uu8xe.klBKDOrBXdDeC8fQ--~B/aD0yMDc0O3c9MzY4NztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/techcrunch_350/dd061ed002b1d0c3b4b1903f1f2a35ab", "publishedAt": "2020-05-06T12:47:00Z", "content": "SpaceX's Starship prototype is on a streak of successes, at a key moment for the spacecraft's development. The Starship SN4 (so-named because it's the fourth full-size prototype) tester managed to pass a test of its Raptor engine firing while installed on the… [+1800 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Agence-France Presse", "title": "China's space test hits snag with capsule 'anomaly' - Yahoo News Australia", "description": "A cargo capsule that was part of a key test in China's space programme experienced an \"anomaly\" Wednesday during its return trip, the space authority said.", "url": "https://au.news.yahoo.com/chinas-space-test-hits-snag-capsule-anomaly-120459876--spt.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/OQymwuErZG2H.Rbih.lPCA--~B/aD0zNDE7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_AU/Sports/Agence-FrancePresse/1c608556f3543e3ebc3eaf433d80226243ce7484.jpg", "publishedAt": "2020-05-06T12:04:00Z", "content": "A cargo capsule that was part of a key test in China's space programme experienced an \"anomaly\" Wednesday during its return trip, the space authority said.\r\nThe cargo capsule was launched Tuesday aboard a new type of carrier rocket along with a prototype spac… [+1744 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Daniel Oberhaus", "title": "After 60 Years, Explosion-Powered Rockets Are Nearly Here - WIRED", "description": "Rotating detonation engines could make rockets lighter, faster, and simpler. First imagined in the 1950s, now they’re almost ready for their first flight.", "url": "https://www.wired.com/story/after-60-years-explosion-powered-rockets-are-nearly-here/", "urlToImage": "https://media.wired.com/photos/5eb1c1d77ecb20c186e15677/191:100/w_1280,c_limit/Science_RDE@_IMG_20190515_065438.jpg", "publishedAt": "2020-05-06T11:22:18Z", "content": "For most aerospace engineers, an explosion in a rocket engine is a disaster. But for Kareem Ahmed, its the entire point. As the director of the Propulsion and Energy Research Laboratory at the University of Central Florida, Ahmed has spent the last few years … [+3565 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Otters 'stone juggling': new research looks into why - Guardian News", "description": "Otters are often scene playing with pebbles, throwing and catching them, known as 'stone juggling' and researchers from the University of Exeter believe they...", "url": "https://www.youtube.com/watch?v=zdEBilRjcEI", "urlToImage": "https://i.ytimg.com/vi/zdEBilRjcEI/maxresdefault.jpg", "publishedAt": "2020-05-06T10:33:05Z", "content": "Otters are often scene playing with pebbles, throwing and catching them, known as 'stone juggling' and researchers from the University of Exeter believe they know why. It was previously thought the game helped hone their foraging skills. The study revealed ol… [+847 chars]"}, {"source": {"id": null, "name": "Newcastlestar.com.au"}, "author": "Janine Graham", "title": "A super 'flower' moon awaits and here's how to see it - Newcastle Star", "description": "Look up - there's lots happening.", "url": "https://www.newcastlestar.com.au/story/6748082/a-super-flower-moon-awaits-and-heres-how-to-see-it/?cs=7", "urlToImage": "https://nnimgt-a.akamaihd.net/transform/v1/crop/frm/GJZ5TVpAk84wrTzsQfLQRB/329b773c-10a9-42b9-979a-e16bbcab85ab.jpg/r9_235_3639_2286_w1200_h678_fmax.jpg", "publishedAt": "2020-05-06T06:00:00Z", "content": "What a time to be looking skyward - yesterday a meteor shower, Thursday a super flower moon.\r\nIt's the last super moon of the year and happens when a full moon coincides with it being in its closest rotation to Earth.\r\nThis one's called a super flower moon si… [+1834 chars]"}, {"source": {"id": null, "name": "The-riotact.com"}, "author": "Michael Weaver", "title": "Stargazers show up as rare meteor shower lights up the night - The RiotACT", "description": "Stargazers, astronomers and photographers looked to the east to witness a rare torrent of shooting stars early this morning. The...", "url": "https://the-riotact.com/stargazers-show-up-as-rare-meteor-shower-lights-up-the-night/374137", "urlToImage": "https://the-riotact.com/wp-content/uploads/2020/05/Starlink-and-meteor-1-of-1-690x384.jpg", "publishedAt": "2020-05-06T04:01:16Z", "content": "The Starlink satellite with a meteor on the right over Lake George this morning. Photos: Photox – Canberra Photography Services.\r\nStargazers, astronomers and photographers looked to the east to witness a rare torrent of shooting stars early this morning.\r\nThe… [+2301 chars]"}, {"source": {"id": null, "name": "Unsw.edu.au"}, "author": "z3530495", "title": "How strong is your mental imagery? It might depend on how 'excitable' your neurons are - UNSW Newsroom", "description": "Highly excitable brain neurons in the visual cortex may reduce a person’s ability to visualise things clearly, neuroscience study finds.", "url": "https://newsroom.unsw.edu.au/news/science-tech/how-strong-your-mental-imagery-it-might-depend-how-excitable-your-neurons-are", "urlToImage": "https://newsroom.unsw.edu.au/sites/default/files/thumbnails/image/thinking_looking_up_1.jpg", "publishedAt": "2020-05-06T01:35:00Z", "content": "Highly excitable brain neurons in the visual cortex may reduce a persons ability to visualise things clearly, neuroscience study finds. The strength of a persons mental imagery their ability to picture something in their minds eye is linked to the excitabilit… [+6838 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Ryan F. Mandelbaum", "title": "Experiment Shows Some Life Can Survive In Exoplanet-Like Conditions - Gizmodo Australia", "description": "Single-celled organisms like Escherichia coli and yeast can grow and survive in an atmosphere like the kind theorised to exist on many rocky exoplanets, according to a new paper....", "url": "https://www.gizmodo.com.au/2020/05/experiment-shows-some-life-can-survive-in-exoplanet-like-conditions/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/pqsndl3ayozmneql9di4.jpg", "publishedAt": "2020-05-06T00:00:00Z", "content": "Single-celled organisms like Escherichia coli and yeast can grow and survive in an atmosphere like the kind theorised to exist on many rocky exoplanets, according to a new paper.\r\nScientists would love to know whether theres life elsewhere in the universe, an… [+3176 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Outsmarting enemy: Treefrogs rely on illusions to find a mate without being eaten - Mirage News", "description": "Note to Journalists: A photo of a treefrog is available on Google Drive. Researchers at Purdue University have discovered that...", "url": "https://www.miragenews.com/outsmarting-enemy-treefrogs-rely-on-illusions-to-find-a-mate-without-being-eaten/", "urlToImage": "https://www.purdue.edu/uns/images/2020/treefrogs-maleLO.jpg", "publishedAt": "2020-05-05T19:08:11Z", "content": "Note to Journalists: A photo of a treefrog is available on Google Drive.\r\nWEST LAFAYETTE, Ind. — Treefrogs become easy targets for predators and parasites when they send mating calls, but they’re finding a way to fool their enemies with a little help from a w… [+2906 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Rob Waugh", "title": "Strange new theory of what caused 'world's biggest impact' over Siberia 100 years ago - Yahoo News Australia", "description": "More than a century ago, something exploded in the sky above Siberia, breaking windows and creating a shining ball of light – but was it a meteor impact?", "url": "https://au.news.yahoo.com/tunguska-asteroid-impact-theory-172350208.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/ywr_b81FR8Frkbr.fqf8JQ--~B/aD0zNzQ2O3c9NTEwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-05/9b564c70-8ef4-11ea-adff-2a6fbd8a8fa8", "publishedAt": "2020-05-05T17:23:00Z", "content": "More than a century ago, something exploded in the sky above Siberia, breaking windows and creating a shining ball of light but was it a meteor impact? \r\nA new Russian study suggests a very strange alternative.\r\nThe Tunguska event, in 1908, is described as th… [+2300 chars]"}, {"source": {"id": null, "name": "Futurity.org"}, "author": "Mike Williams-Rice", "title": "'Artificial leaf' splits water to make sustainable power - Futurity: Research News", "description": "\"What we have is an integrated module that turns sunlight into electricity that drives an electrochemical reaction. It utilizes water and sunlight to get chemical fuels.\"", "url": "https://www.futurity.org/water-splitting-machine-artificial-leaf-hydrogen-fuel-2356252/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2020/05/water-splitting-hydrogen-fuel-sustainable-energy_1600.jpg", "publishedAt": "2020-05-05T17:19:09Z", "content": "Researchers have created an efficient, low-cost device that splits water to produce hydrogen fuel.\r\nThe platform integrates catalytic electrodes and perovskite solar cells so that, when sunlight triggers it, the device produces electricity. The current flows … [+3368 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Scientists 'at bleeding edge' with upgrade to CMS detector - Mirage News", "description": "Note to Journalists: Images of the CMS detector are available for journalists to use via a Google Drive folder. The CMS...", "url": "https://www.miragenews.com/scientists-at-bleeding-edge-with-upgrade-to-cms-detector/", "urlToImage": "https://news.uns.purdue.edu/images/+2008/cms-detectorLO.jpg", "publishedAt": "2020-05-05T17:10:50Z", "content": "Note to Journalists: Images of the CMS detector are available for journalists to use via a Google Drive folder.\r\nPurdue particle physicists continue a legacy of  boundary-pushing experiments at the Large Hadron Collider\r\nWEST LAFAYETTE, Ind. — The huge detect… [+7146 chars]"}, {"source": {"id": null, "name": "Gloucestershirelive.co.uk"}, "author": "Phil Norris", "title": "When Elon Musk's Starlink satellites are visible over Gloucestershire - and latest Met Office forecast - Gloucestershire Live", "description": "SpaceX wi-fi fleet has been seen over Gloucestershire in recent weeks and could be glimpsed again on Tuesday and Thursday", "url": "https://www.gloucestershirelive.co.uk/whats-on/whats-on-news/elon-musks-starlink-satellites-visible-4105032", "urlToImage": "https://i2-prod.gloucestershirelive.co.uk/incoming/article3808208.ece/ALTERNATES/s1200/1_EL_GLO040220LightsSky_01.jpg", "publishedAt": "2020-05-05T16:14:22Z", "content": "There are two more chances to see Elon Musk's Starlink satellites this week over Gloucestershire.\r\nLast month, some people saw up to 20 of the fleet orbit overhead in the late evening or early morning - others saw only a couple, or none at all.\r\n The satellit… [+1834 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Evidence of ancient rivers spotted on Mars, study says - CNN", "description": "Researchers are \"reading the rocks\" and the history they show on Mars to paint a picture of when the planet supported liquid water on its surface billions of years ago.", "url": "https://www.cnn.com/2020/05/05/world/mars-river-evidence-scn-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200505101456-mars-ancient-river-super-tease.jpg", "publishedAt": "2020-05-05T15:16:04Z", "content": null}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Plants pass on 'memory' of stress to some progeny, making them more resilient - Mirage News", "description": "Researchers Xiaodong Yang (left), research assistant professor, Hardik Kundariya, graduate student (middle), and Sally Mackenzie, professor of biology...", "url": "https://www.miragenews.com/plants-pass-on-memory-of-stress-to-some-progeny-making-them-more-resilient/", "urlToImage": "https://news.psu.edu/sites/default/files/styles/threshold-992/public/Header%2C%20Mackenzie%2C%20low-rez.jpg?itok=qEspfHP-", "publishedAt": "2020-05-05T15:15:00Z", "content": "Researchers Xiaodong Yang (left), research assistant professor, Hardik Kundariya, graduate student (middle), and Sally Mackenzie, professor of biology and plant science, in the laboratory conducting research on the MSH1 gene memory induction process.\r\nImage: … [+5615 chars]"}, {"source": {"id": null, "name": "3wnews.org"}, "author": null, "title": "CRISPR Technology Market Competitor Analysis, Winning Strategies and Growth Drivers 2027 - 3rd Watch News", "description": null, "url": "https://3wnews.org/uncategorised/740497/crispr-technology-market-competitor-analysis-winning-strategies-and-growth-drivers-2027/", "urlToImage": null, "publishedAt": "2020-05-05T13:40:00Z", "content": "CRISPR (Clustered Regularly Interspaced Short Palindromic Repeats) technology is a simple but powerful tool for genome editing. This tool enables life science researchers to easily edit DNA sequences and modify gene function. It has many potential application… [+5384 chars]"}, {"source": {"id": null, "name": "Ibtimes.sg"}, "author": "https://www.ibtimes.sg/reporters/nirmal-narayanan", "title": "This 400 million-year-old fossil could shed light on key stages of plant evolution - International Business Times, Singapore Edition", "description": "Researchers revealed that these fossils that shed light on plant evolution date back to the Devonian period", "url": "https://www.ibtimes.sg/this-400-million-year-old-fossil-could-shed-light-key-stages-plant-evolution-44429", "urlToImage": "https://data.ibtimes.sg/en/full/29509/amazon-fire.jpg", "publishedAt": "2020-05-05T10:31:15Z", "content": "A new study conducted by researchers on fossils that are currently stored in the Smithsonian National Museum of Natural History could shed light on key stages of plant evolution. During the study, researchers identified an ancient plant species, that is not l… [+2055 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "An artificial \"tongue\" of gold to taste maple syrup - Mirage News", "description": "It's said that maple syrup is Quebec's liquid gold. Now scientists at Université de Montréal have found a way to use real gold - in the form of...", "url": "https://www.miragenews.com/an-artificial-tongue-of-gold-to-taste-maple-syrup/", "urlToImage": "https://nouvelles.umontreal.ca/fileadmin/_processed_/csm_Simon_Forest_erable_Cr_Amelie_Philibert_745d1f1df9.jpg", "publishedAt": "2020-05-05T10:20:11Z", "content": "It’s said that maple syrup is Quebec’s liquid gold. Now scientists at Université de Montréal have found a way to use real gold – in the form of nanoparticles – to quickly find out how the syrup tastes.\r\nThe new method – a kind of artificial tongue – is valida… [+3744 chars]"}, {"source": {"id": null, "name": "Technologynetworks.com"}, "author": "Technology Networks", "title": "Flexible DNA, Flexible Memory? - Technology Networks", "description": "A new study suggests that the ability of the brain to extinguish fearful memories from the brain is reliant upon the flexibility of DNA.", "url": "https://www.technologynetworks.com/neuroscience/news/flexible-dna-flexible-memory-334369", "urlToImage": "https://cdn.technologynetworks.com/tn/images/thumbs/jpeg/640_360/flexible-dna-flexible-memory-334369.jpg?cb=20200505", "publishedAt": "2020-05-05T09:16:53Z", "content": "Fear is an important survival mechanism and so too is the ability to inhibit fear when its no longer needed. In order to counter-balance fear, the brain engages in fear extinction. In this process, memories are formed during non-fearful experiences with simil… [+4009 chars]"}, {"source": {"id": null, "name": "Pressenza.com"}, "author": "The Ecologist", "title": "Sea levels rising as Antarctica melts - Pressenza, International Press Agency", "description": "Emily Beament Earth-observing Nasa satellite bounces laser pulses off the ice surface to help measure changes in the Greenland and Antarctic ice sheets.", "url": "https://www.pressenza.com/2020/05/sea-levels-rising-as-antarctica-melts/", "urlToImage": "https://cdn77.pressenza.com/wp-content/uploads/2020/05/antarctica_7_laubeuf_fjord_webb_island.jpg", "publishedAt": "2020-05-05T06:59:24Z", "content": "Earth-observing Nasa satellite bounces laser pulses off the ice surface to help measure changes in the Greenland and Antarctic ice sheets.\r\nMelting ice from Antarctica and Greenland’s shrinking ice sheet has been responsible for a 14mm (0.55in) rise in sea le… [+2517 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/genelle-weule/7098742", "title": "Comet SWAN sky watcher's guide: what you'll see and where you'll see it - ABC Local", "description": "Australian skywatchers are in the box seat to see beautiful Comet SWAN. We explain what you'll see, where to see it, and how to take a great photo.", "url": "https://www.abc.net.au/news/2020-05-05/comet-swan-eta-aqaiids-metor-shower-sky-watchers-guide/12215594", "urlToImage": "https://www.abc.net.au/cm/rimage/12181186-16x9-large.jpg?v=2", "publishedAt": "2020-05-05T06:20:00Z", "content": "Set your alarm clocks. Early Wednesday morning Australian sky watchers will be treated to two beautiful celestial events that will make getting out of bed before the crack of dawn worthwhile.\r\nNot only is the annual Eta Aquariid meteor shower at its peak, but… [+9178 chars]"}, {"source": {"id": null, "name": "Thechronicle.com.au"}, "author": "Tom Gillespie, Tom Gillespie", "title": "City's first community COVID-19 testing clinic opens - Chronicle", "description": "TOOWOOMBA’S first community COVID-19 testing clinic is expected to check more than 100 people a week for the virus.", "url": "https://www.thechronicle.com.au/news/citys-first-community-covid-19-testing-clinic-open/4009179/", "urlToImage": "https://media.apnarm.net.au/media/images/2020/05/05/v3imagesbineaf981ee85ef56669bf098d7db0c5c2e-6m0x3iqvg1mrbvs7au2_ct1880x930.jpg", "publishedAt": "2020-05-05T05:00:00Z", "content": "TOOWOOMBA'S first community COVID-19 testing clinic is expected to check more than 100 people a week for the virus, as well as foster more testing in the indigenous population.\r\nCarbal Medical Services this week converted its community outreach facility on Ch… [+2207 chars]"}, {"source": {"id": null, "name": "Hit.com.au"}, "author": "Hit News Team", "title": "A Dazzling Meteor Shower Will Rain Over Australia Tomorrow Night - Hit 107", "description": "So cool!", "url": "https://www.hit.com.au/story/a-dazzling-meteor-shower-will-rain-over-australia-tomorrow-night-153659", "urlToImage": "https://cdn-img.scalabs.com.au/pYeBBlG2ulLZE721-y7TbzAptyor8lXM9r384KT7hD4/aHR0cHM6Ly9zdy1o/aXQtcHJkLnNjYWRp/Z2l0YWwuaW8vbWVk/aWEvODEwNjcvbWV0/ZW9yLXNob3dlci1w/ZXhlbHMuanBnP3By/ZXNldD1tcnByZXZh/cnRpY2xl", "publishedAt": "2020-04-20T23:19:17Z", "content": "Hows this for some social-distancing entertainment?\r\nOne of the oldest meteor showers on record, the Lyrid Shower, is set to rain over Australia this week!\r\nUsually active between April 16 and 25 each year, this year, the shower will be most visible on the ev… [+621 chars]"}]}