{"status": "ok", "totalResults": 56, "articles": [{"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Study finds 160 ways to protect the Great Barrier Reef - SBS News", "description": "From cloud brightening to heat-tolerant corals, a study has identified 160 possible interventions that could help protect the Great Barrier Reef.", "url": "https://www.sbs.com.au/news/study-finds-160-ways-to-protect-the-great-barrier-reef", "urlToImage": null, "publishedAt": "2020-04-26T04:15:48Z", "content": "Scientists recently confirmed the Great Barrier Reef suffered another serious bleaching event last summer - the third in five years. Dramatic intervention to save the natural wonder is clearly needed.\r\nFirst and foremost, this requires global greenhouse gas e… [+7754 chars]"}, {"source": {"id": null, "name": "Nasaspaceflight.com"}, "author": null, "title": "Starship SN4 set for cryogenic proof test - NASASpaceflight.com", "description": "Starship SN4 is set for a crucial cryogenic proof test as early as Saturday evening…", "url": "https://www.nasaspaceflight.com/2020/04/starship-sn4-set-for-test/", "urlToImage": null, "publishedAt": "2020-04-26T00:55:27Z", "content": "Starship SN4 is set for a crucial cryogenic proof test as early as Saturday evening at SpaceX’s launch site in Boca Chica, Texas. The cryogenic proof test is one of the first tests necessary to prove the vehicle’s flight-worthiness. If all goes well, SpaceX t… [+5301 chars]"}, {"source": {"id": null, "name": "Digitaltrends.com"}, "author": "Georgina Torbet", "title": "A Mars simulation crew spent 520 days in confinement. Here are their tips - Digital Trends", "description": "If you're struggling in quarantine right now, you might look for advice from someone like an astronaut who was part of the ESA's Mars500 simulation study.", "url": "https://www.digitaltrends.com/news/mars500-simulation-crew-confinement-tips/", "urlToImage": null, "publishedAt": "2020-04-25T23:19:33Z", "content": "If you’re struggling in quarantine right now, you might look for advice from someone how has survived a truly extreme confinement situation, such as an astronaut who was part of the European Space Agency (ESA)’s Mars500 simulation study.\r\nSimulation missions … [+2691 chars]"}, {"source": {"id": null, "name": "Universetoday.com"}, "author": "https://www.facebook.com/Storiesbywilliams-205745679447998/?ref=hl", "title": "This is the Final Picture NASA's Spitzer Space Telescope - Universe Today", "description": "NASA has just released a mosaic of the California Nebula, which was created from the final images snapped by the Spitzer Space Telescope.", "url": "https://www.universetoday.com/145828/this-is-the-final-picture-nasas-spitzer-space-telescope/", "urlToImage": null, "publishedAt": "2020-04-25T21:24:00Z", "content": "On Jan. 30th, 2020, NASA’s Spitzer Space Telescope was retired after sixteen years of faithful service. As one of the four NASA Great Observatories – alongside Hubble, Chandra, and Compton space telescopes – Spitzer was dedicated to studying the Universe in i… [+5261 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Anna Salleh", "title": "The fagus, Australia's only native winter deciduous tree, is turning its stunning autumn colours. What's behind that gorgeous display? - ABC News", "description": "Tasmania's deciduous beech, the fagus, is turning stunning yellow, orange and red — what makes this happen?", "url": "https://www.abc.net.au/news/science/2020-04-26/true-blue-autumn-leaves-are-turning/12147698", "urlToImage": null, "publishedAt": "2020-04-25T20:30:09Z", "content": "Every year at this time, thousands flock to national parks in Tasmania to see the stunning autumn display of Australia's only native winter deciduous tree the fagus.\r\nBut this year the state's parks are closed until further notice thanks to coronavirus, which… [+4723 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "The Largest Hole in the Ozone Layer Over the Arctic Has Been Closed - Somag News", "description": "The large ozone hole observed last month in the Arctic, located above the north polar circle of the world, was completely closed according to the statement made by scientists. Scientists have explained that this phenomenon is not related to the coronavirus. T…", "url": "https://www.somagnews.com/largest-hole-ozone-layer-arctic-closed/", "urlToImage": null, "publishedAt": "2020-04-25T19:48:00Z", "content": "The large ozone hole observed last month in the Arctic, located above the north polar circle of the world, was completely closed according to the statement made by scientists. Scientists have explained that this phenomenon is not related to the coronavirus.\r\n… [+2194 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "The Conversation", "title": "Chemical recycling could be the solution to plastic pollution - The Next Web", "description": "The world is drowning in plastic. About 60% of the more than 8,700 million metric tonnes of plastic ever made is no longer in use, instead sat mostly in landfill or released to the ...", "url": "https://thenextweb.com/syndication/2020/04/25/chemical-recycling-could-be-the-solution-to-plastic-pollution/", "urlToImage": null, "publishedAt": "2020-04-25T17:20:31Z", "content": "The world is drowning in plastic. About 60% of the more than 8,700 million metric tonnes of plastic ever made is no longer in use, instead sat mostly in landfill or released to the environment. That equals over 400kg of plastic waste for every one of the 7.6 … [+5031 chars]"}, {"source": {"id": null, "name": "Ibtimes.sg"}, "author": "https://www.ibtimes.sg/reporters/jeevan-biswas", "title": "Scientists identify the 'most dangerous place' in the history of earth, once home to fearsome predators - International Business Times, Singapore Edition", "description": "According to the researchers, the area around south-eastern Morocco was home to predators such as Carcharodontosaurus, Pterosaurs and freshwater sharks 100 million years ago", "url": "https://www.ibtimes.sg/scientists-identify-most-dangerous-place-history-earth-once-home-fearsome-predators-43789", "urlToImage": null, "publishedAt": "2020-04-25T16:43:56Z", "content": "If one was asked which was the most dangerous place in the history of the planet, what would their answer be? Not many can answer that question. However, an international team of scientists has identified such a place a predator-ridden Morocco 100 million yea… [+3056 chars]"}, {"source": {"id": null, "name": "Digitaltrends.com"}, "author": "Georgina Torbet", "title": "NASA’s Perseverance rover is perfectly balanced for its trip to Mars - Digital Trends", "description": "NASA's Perseverance rover is preparing for its launch to Mars has just made it through one more item on the list: Ensuring that it is correctly balanced.", "url": "https://www.digitaltrends.com/news/nasa-perseverance-rover-balance/", "urlToImage": null, "publishedAt": "2020-04-25T16:00:25Z", "content": "NASA’s Perseverance rover is preparing for launch in the next few months by undergoing final checks, and it has just made it through one more item on the list: Ensuring that it is correctly balanced.\r\nPart of the final preparations for readying the rover for … [+1853 chars]"}, {"source": {"id": null, "name": "Heritagedaily.com"}, "author": "http://www.facebook.com/archaeologynews", "title": "Paleontologists reveal 'the most dangerous place in the history of planet Earth' - HeritageDaily", "description": "100 million years ago, ferocious predators, including flying reptiles and crocodile-like hunters, made the Sahara the most dangerous place on Earth.", "url": "https://www.heritagedaily.com/2020/04/paleontologists-reveal-the-most-dangerous-place-in-the-history-of-planet-earth/127935", "urlToImage": null, "publishedAt": "2020-04-25T15:46:42Z", "content": "100 million years ago, ferocious predators, including flying reptiles and crocodile-like hunters, made the Sahara the most dangerous place on Earth.\r\nThis is according to an international team of scientists, who have published the biggest review in almost 100… [+2851 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "China unveils name of first Mars exploration mission - The Jakarta Post - Jakarta Post", "description": "China's space agency on Friday unveiled the name of its first Mars exploration mission, coinciding with China's annual Space Day and the 50th anniversary of the launch of its first satellite.", "url": "https://www.thejakartapost.com/life/2020/04/25/china-unveils-name-of-first-mars-exploration-mission-.html", "urlToImage": null, "publishedAt": "2020-04-25T15:05:00Z", "content": "China's space agency on Friday unveiled the name of its first Mars exploration mission, coinciding with China's annual Space Day and the 50th anniversary of the launch of its first satellite.\r\nThe Mars mission has been named Tianwen-1, the official Xinhua new… [+835 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Space race is rigged in Elon Musk’s favour, claims Russian rival - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T14:02:23Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Meghan Bartels", "title": "That's the way the comet crumbles: Hubble image shows remains of Comet ATLAS - Space.com", "description": "", "url": "https://www.space.com/hubble-image-comet-atlas-broken-up.html", "urlToImage": null, "publishedAt": "2020-04-25T12:08:00Z", "content": "Skywatchers had high hopes that a comet called ATLAS would light up the night sky this spring, with forecasts suggesting it could become bright enough to see with the unaided eye.\r\nInstead, the icy object crumbled to pieces but it's still putting on a spectac… [+2755 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Carly Cassella", "title": "Controversial Discovery Says Origins of Human Language Existed 25 Million Years Ago - ScienceAlert", "description": "A structure critical to our brain's core language pathway, found only in humans and apes, has now also been identified in monkeys, according to a controversial new study - suggesting the origins of language may have appeared 20 to 25 million years ea", "url": "https://www.sciencealert.com/controversial-discovery-in-monkeys-pushes-the-origin-of-human-language-back-25-million-years", "urlToImage": null, "publishedAt": "2020-04-25T09:31:17Z", "content": "A structure critical to our brain's core language pathway, found only in humans and apes, has now also been identified in monkeys, according to a controversial new study - suggesting the origins of language may have appeared 20 to 25 million years earlier tha… [+4838 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Ciaran McGrath", "title": "Kilauea shock: Was THIS the reason for 2018 Hawaii volcano eruption? - Express.co.uk", "description": "THE spectacular Kilauea volcanic eruption of 2018, which resulted in the destruction of hundreds of homes, and the evacuation of thousands of people, may have been triggered in part by unusually high rainfall levels, a new study has suggested.", "url": "https://www.express.co.uk/news/science/1272403/kilauea-volcano-eruption-hawaii-big-island-2018-rainfall", "urlToImage": null, "publishedAt": "2020-04-25T09:30:00Z", "content": null}, {"source": {"id": null, "name": "Webbyfeed.com"}, "author": "Carrie J. Bronstein", "title": "Scientists Came Up With The Most Detailed Lunar Map, Focused On Moon's Rock Composition - Webby Feed", "description": "The distant dark spots that can be spot on the Moon from a distance are merely the tip of the iceberg, as the satellite possesses an impressive geological diversity. A...", "url": "https://www.webbyfeed.com/scientists-came-up-with-the-most-detailed-lunar-map-focused-on-moons-rock-composition/8023/", "urlToImage": null, "publishedAt": "2020-04-25T07:24:13Z", "content": "The distant dark spots that can be spot on the Moon from a distance are merely the tip of the iceberg, as the satellite possesses an impressive geological diversity. A team of determined researchers has managed to create the most detailed lunar map focused on… [+1621 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Brett Wadelton", "title": "Space news: Asteroid to pass close to Earth next week, visible by telescope - 7NEWS.com.au", "description": "Stargazers are set for a treat early next week as an asteroid will pass close to Earth.", "url": "https://7news.com.au/technology/space/space-news-mask-shaped-asteroid-to-pass-close-to-earth-next-week-visible-by-telescope-c-993995", "urlToImage": null, "publishedAt": "2020-04-25T06:38:57Z", "content": "Astronomers are set for a treat early next week as an asteroid will pass close to Earth.\r\nNamed Asteroid (52768) 1998 OR2, this large near-Earth and potentially hazardous asteroid (PHA) will safely fly past us at a mere 6.3 million kilometres - which is quite… [+1587 chars]"}, {"source": {"id": null, "name": "Hurriyetdailynews.com"}, "author": "hurriyetdailynews.com", "title": "Hubble telescope celebrates 30th year in space - Hurriyet Daily News", "description": "Scientists on April 24 celebrated the Hubble Space Telescope's 30th anniversary with a new image of a satellite galaxy of the Milky Way.", "url": "http://www.hurriyetdailynews.com/hubble-telescope-celebrates-30th-year-in-space-154195", "urlToImage": null, "publishedAt": "2020-04-25T06:16:03Z", "content": "WASHINGTON\r\nScientists on April 24 celebrated the Hubble Space Telescope's 30th anniversary with a new image of a satellite galaxy of the Milky Way. \r\nIn a statement, U.S. space agency NASA said the galaxy in the image - located 163,000 light-years away- away… [+847 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Gursimran Hans", "title": "Trump’s new US Space Force to deploy surveillance telescope in Australia - Express.co.uk", "description": "THE US plans to construct a specialist space surveillance telescope at a facility in Western Australia.", "url": "https://www.express.co.uk/news/science/1273676/Space-news-USA-Australia-telescope-spy-track-debris-satellites", "urlToImage": null, "publishedAt": "2020-04-25T03:21:00Z", "content": null}, {"source": {"id": null, "name": "Syfy.com"}, "author": "Elizabeth Rayne", "title": "This planet is so scorching that metals actually vaporize into the atmosphere - SYFY WIRE", "description": "There are hot planets, and then there are unbelievably, unbearably, insufferably hot planets. Imagine an alien world torrid enough to not just melt, but vaporize metal. MASCARA-2 b (whose name has absolutely nothing to do with makeup) is that planet. A team o…", "url": "https://www.syfy.com/syfywire/this-planet-is-so-hot-it-makes-metals-vaporize", "urlToImage": null, "publishedAt": "2020-04-25T02:16:44Z", "content": "There are hot planets, and then there are unbelievably, unbearably, insufferably hot planets.\r\nImagine an alien world torrid enough to not just melt, but vaporize metal. MASCARA-2 b (whose name has absolutely nothing to do with makeup) is that planet. A team … [+3176 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/abc-local/sophie-kesteven/7149610", "title": "Raquel is working from home during coronavirus — and that means sloths in the spare room - ABC News", "description": "Working from home means different things for different people. For Raquel, it means moving three very lazy — but very cute — new housemates into the spare room.", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-panama-working-from-home-with-sloths/12169922", "urlToImage": null, "publishedAt": "2020-04-24T22:29:37Z", "content": "Updated \r\nApril 25, 2020 08:23:26\r\nWorking from home is the new normal for many people and for Raquel Cruz Alpizar, it's meant moving three unlikely new housemates into her spare room.\r\nSince coronavirus restrictions took hold, she's been caring around the cl… [+6272 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Michael Thomsen For Dailymail.com", "title": "Time passes faster at the top of skyscrapers according to new study - Daily Mail", "description": "A new study from the University of Tokyo has shown that time actually passes at a different speed at the top of skyscrapers and other tall buildings, at a rate of four nanoseconds more quickly.", "url": "https://www.dailymail.co.uk/sciencetech/article-8254271/Time-passes-faster-skyscrapers-according-new-study.html", "urlToImage": null, "publishedAt": "2020-04-24T22:22:17Z", "content": "A new study from the University of Tokyo has shown that time actually passes at a different speed at the top of skyscrapers and other tall buildings.\r\nA team, led by quantum electronics professor Hidetoshi Katori, climbed to the top of the Tokyo Skytree, the … [+4009 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Charles Q. Choi", "title": "Mystery of Venus atmosphere's weird rotation may finally be solved - Space.com", "description": "Thermal tides in the atmosphere make it rotate faster than the planet's surface, a new study finds.", "url": "https://www.space.com/venus-atmosphere-super-rotation-mystery-solved.html", "urlToImage": null, "publishedAt": "2020-04-24T21:59:00Z", "content": "The mystery behind why the atmosphere of Venus spins much faster than the planet's surface may finally be solved, a new study finds.\r\nThe finding might help shed light on how habitable distant exoplanets, or worlds beyond our solar system, may actually be, re… [+3613 chars]"}, {"source": {"id": null, "name": "Nerdist.com"}, "author": null, "title": "Study Suggests Icy ‘Centaurs’ Come from Outside Solar System - Nerdist", "description": "Researchers have run convincing simulations that point to a group of asteroids in our solar system originally being \"birthed\" around another star.", "url": "https://nerdist.com/article/study-on-icy-centaurs-rocks-outside-our-solar-system/", "urlToImage": null, "publishedAt": "2020-04-24T21:56:58Z", "content": "Researchers have run some apparently very convincing simulations on the likely origins of a group of Centaurs. These are small bodies orbiting around the Sun between our solar system’s outer planets. Those researchers found that they provide evidence of the i… [+2769 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Mindy Weisberger", "title": "Black hole bends escaping light 'like a boomerang' - Livescience.com", "description": "Even light can't resist the pull of these irresistible cosmic objects.", "url": "https://www.livescience.com/black-hold-bends-light-like-boomerang.html", "urlToImage": null, "publishedAt": "2020-04-24T20:39:00Z", "content": "Light escaping from a black hole may \"boomerang\" its way to freedom, new X-ray images reveal.\r\nResearchers found this odd behavior while reviewing archival X-ray\r\n observations of a black hole that's approximately 10 times as massive as our sun. Located about… [+3950 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Kathleen Haughney", "title": "Researchers discover new structure for promising class of materials - Phys.org", "description": "Florida State University researchers have discovered a novel structure for organic-inorganic hybrid materials that shows potential for more efficient technologies.", "url": "https://phys.org/news/2020-04-class-materials.html", "urlToImage": null, "publishedAt": "2020-04-24T20:31:40Z", "content": "Florida State University researchers have discovered a novel structure for organic-inorganic hybrid materials that shows potential for more efficient technologies.\r\nProfessor of Chemistry and Biochemistry Biwu Ma and his team have published a new study in the… [+2382 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Mike Wehner", "title": "NASA begs people to avoid SpaceX’s first astronaut launch - BGR", "description": "NASA is asking that fans avoid attending the first crewed SpaceX launch to the International Space Station. The event is a long time coming, and while NASA won’t be selling tickets to attendees, the agency is still concerned that people may flock to roadsides…", "url": "https://bgr.com/2020/04/24/spacex-iss-launch-nasa-asks-people-to-stay-home/", "urlToImage": null, "publishedAt": "2020-04-24T20:22:05Z", "content": "<ul><li>NASA is asking that fans avoid attending the first crewed SpaceX launch to the International Space Station. </li><li>The event is a long time coming, and while NASA won’t be selling tickets to attendees, the agency is still concerned that people may f… [+2569 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "George Dvorsky", "title": "NASA Rocket Scientists Designed A Rapid-Production Ventilator In Just 37 Days - Gizmodo Australia", "description": "Introducing VITAL, a prototype ventilator designed expressly for quick and easy mass production. Developed by NASA engineers, the device could alleviate ongoing supply shortages in the U.S. and around the world as the covid-19 pandemic rages on....", "url": "https://www.gizmodo.com.au/2020/04/nasa-rocket-scientists-designed-a-rapid-production-ventilator-in-just-37-days/", "urlToImage": null, "publishedAt": "2020-04-24T19:30:00Z", "content": "Introducing VITAL, a prototype ventilator designed expressly for quick and easy mass production. Developed by NASA engineers, the device could alleviate ongoing supply shortages in the U.S. and around the world as the covid-19 pandemic rages on.\r\nNASA has cop… [+3078 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Amanda Kooser", "title": "Scientists pinpoint 'most dangerous place in the history of planet Earth' - CNET", "description": "A paleontologist says time travelers would not survive long in this predator-packed area of Africa 100 million years ago.", "url": "https://www.cnet.com/news/scientists-pinpoint-most-dangerous-place-in-the-history-of-planet-earth/", "urlToImage": null, "publishedAt": "2020-04-24T19:24:42Z", "content": "This artist's illustration shows a massive dinosaur Carcharodontosaurus with a group of crocodile-like Elosuchus predators near a carcass.\r\nArtwork by Davide Bonadonna\r\nOnce you build your time machine, please do not set your destination for 100 million years… [+1631 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coral Restoration | Education Earth - The Weather Channel", "description": "We spoke with the Georgia Aquarium about how coral reefs are being restored.", "url": "https://www.youtube.com/watch?v=2Z7x0fS8IzM", "urlToImage": null, "publishedAt": "2020-04-24T19:15:49Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Star somehow survives close encounter with BLACK HOLE, but faces a TRILLION YEARS on death row - RT", "description": "An extremely rare close call between a red giant star and a black hole has been captured by powerful NASA and ESA tech, revealing a key chapter in a cosmic saga that will likely continue for a trillion years.", "url": "https://www.rt.com/news/486801-star-survives-encounter-black-hole/", "urlToImage": null, "publishedAt": "2020-04-24T18:19:54Z", "content": "The fatal celestial event is unfolding in the galaxy GSN 069 – about 250 million light years away from Earth. The black hole in question is roughly 400,000 times the mass of the sun, making it small by supermassive black hole standards, but still terrifying i… [+2539 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Water may look like a simple liquid; however, it is anything but simple to analyze - Science Daily", "description": "Scientists have been able to shed new light on the properties of water at the molecular level. In particular, they were able to describe accurately the interactions between three water molecules, which contribute significantly to the energy landscape of water…", "url": "https://www.sciencedaily.com/releases/2020/04/200424132621.htm", "urlToImage": null, "publishedAt": "2020-04-24T18:11:02Z", "content": "An international team of scientists lead by Professor Martina Havenith from Ruhr-Universität Bochum (RUB) has been able to shed new light on the properties of water at the molecular level. In particular, they were able to describe accurately the interactions … [+3366 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Engineers open door to big new library of tiny nanoparticles - Phys.org", "description": "The development of bimetallic nanoparticles (i.e., tiny particles composed of two different metals that exhibit several new and improved properties) represents a novel area of research with a wide range of potential applications. Now, a research team in the U…", "url": "https://phys.org/news/2020-04-door-big-library-tiny-nanoparticles.html", "urlToImage": null, "publishedAt": "2020-04-24T18:09:04Z", "content": "The development of bimetallic nanoparticles (i.e., tiny particles composed of two different metals that exhibit several new and improved properties) represents a novel area of research with a wide range of potential applications. Now, a research team in the U… [+3847 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Catalyst Opens Door To More Efficient, Environmentally Friendly Ethylene Production - Mirage News", "description": "News Releases April 24, 2020 Reaction pathways for oxidative dehydrogenation of ethane facilitated by the molten carbonate...", "url": "https://www.miragenews.com/catalyst-opens-door-to-more-efficient-environmentally-friendly-ethylene-production/", "urlToImage": null, "publishedAt": "2020-04-24T18:02:14Z", "content": "A research team led by North Carolina State University has engineered a new catalyst that can more efficiently convert ethane into ethylene, which is used in a variety of manufacturing processes. The discovery could be used in a conversion process to drastica… [+2639 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Ryan F. Mandelbaum", "title": "This Could Be The First Record Of Someone Getting Killed By A Meteorite - Gizmodo Australia", "description": "A team of scientists think they’ve found the oldest evidence of a meteorite striking and killing a person, according to a new report published in the journal journal Meteoritics & Planetary Science....", "url": "https://www.gizmodo.com.au/2020/04/this-could-be-the-first-record-of-someone-getting-killed-by-a-meteorite/", "urlToImage": null, "publishedAt": "2020-04-24T17:52:00Z", "content": "A team of scientists think theyve found the oldest evidence of a meteorite striking and killing a person, according to a new report published in the journal journal Meteoritics &amp; Planetary Science.\r\nGiven the hype around space rocks hitting Earth, there a… [+2713 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "BCI system gives paralyzed man back his sense of touch with haptic feedback - Ars Technica", "description": "Long-term goal is to develop system that works as well at home as in the laboratory.", "url": "https://arstechnica.com/science/2020/04/bci-system-gives-paralyzed-man-back-his-sense-of-touch-with-haptic-feedback/", "urlToImage": null, "publishedAt": "2020-04-24T17:51:00Z", "content": "Enlarge/ Ian Burkhard suffered a severe spinal cord injury in 2010. Battelle's NeuroLife project is restoring motor function to his right arm with a brain-computer-interface system.\r\n4 with 4 posters participating\r\nIan Burkhart, now 28, had a diving accident … [+7377 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Harry Pettit", "title": "Starlink satellites tracker UK: Where are Elon Musk’s SpaceX satellites right now? - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11452340/starlink-satellites-tracker-uk/", "urlToImage": null, "publishedAt": "2020-04-24T15:21:07Z", "content": "STARGAZERS have another chance to witness a swarm fo satellites passing over Britain this evening.\r\nThe \"Starink\" satellites are operated by SpaceX, a company that hopes to one day beam Wi-Fi to people from space - and we've got all the tips you need to spot … [+8624 chars]"}, {"source": {"id": null, "name": "Dw.com"}, "author": "Deutsche Welle (www.dw.com)", "title": "Hubble's giant birthday nebula - Deutsche Welle", "description": "It's been 30 years since the Hubble Space Telescope began providing us with images from distant corners of the universe. Here some breathtaking pictures:", "url": "https://www.dw.com/en/hubbles-giant-birthday-nebula/g-18403422", "urlToImage": null, "publishedAt": "2020-04-24T13:43:06Z", "content": "The first pictures Hubble sent back were a catastrophe, however, because its main mirror had been ground to the wrong shape. In 1993, Space Shuttle Endeavor took experts to Hubble to fix the problem, giving it a pair of glasses. That was just one of five upda… [+74 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Colliding solitons in optical microresonators to reveal important fundamental physics - Phys.org", "description": "Solitons are self-reinforcing particle-like wave packets enabled by the balance between dispersion and nonlinearity. Occurring in hydrodynamics, lasers, cold atoms, and plasmas, solitons are generated when a laser field is confined in a circular resonator wit…", "url": "https://phys.org/news/2020-04-colliding-solitons-optical-microresonators-reveal.html", "urlToImage": null, "publishedAt": "2020-04-24T13:04:37Z", "content": "Solitons are self-reinforcing particle-like wave packets enabled by the balance between dispersion and nonlinearity. Occurring in hydrodynamics, lasers, cold atoms, and plasmas, solitons are generated when a laser field is confined in a circular resonator wit… [+3188 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Warming climate undoes decades of knowledge of marine protected areas - Science Daily", "description": "A new study highlights that tropical coral reef marine reserves can offer little defence in the face of climate change impacts. And the changes that are being observed will force scientists, conservationists and reserve managers to rethink the role these prot…", "url": "https://www.sciencedaily.com/releases/2020/04/200424081654.htm", "urlToImage": null, "publishedAt": "2020-04-24T12:53:43Z", "content": "Climate change and warming seas are transforming tropical coral reefs and undoing decades of knowledge about how to protect these delicate and vital ecosystems.Many of the world's coral reefs are seeing biodiversity plunge in the face of repeated coral bleach… [+4002 chars]"}, {"source": {"id": null, "name": "Theconversation.com"}, "author": "Daniel Garcia-Castellanos", "title": "Tomanowos, the meteorite that survived mega-floods and human folly - The Conversation US", "description": "Tomanowos, aka the Willamette Meteorite, may be the world's most interesting rock. Its story includes catastrophic ice age floods, theft of Native American cultural heritage and plenty of human folly.", "url": "https://theconversation.com/tomanowos-the-meteorite-that-survived-mega-floods-and-human-folly-134213", "urlToImage": null, "publishedAt": "2020-04-24T12:23:00Z", "content": "The rock with arguably the most fascinating story on Earth has an ancient name: Tomanowos. It means the visitor from heaven in the extinct language of Oregons Clackamas Indian tribe.\r\nThe Clackamas revered the Tomanowos also known as the Willamette meteorite … [+6446 chars]"}, {"source": {"id": null, "name": "Technologynetworks.com"}, "author": "Technology Networks", "title": "New Knowledge on Neanderthals From Icelandic DNA Jigsaw-puzzle - Technology Networks", "description": "It is well-known that a group of our ancestors left Africa and, about 50,000 years ago, met Neanderthals in Europe, and then had children with them. A new analysis shows that the Neanderthals may have had children with another extinct species of human (Deniso…", "url": "https://www.technologynetworks.com/genomics/news/new-knowledge-on-neanderthals-from-icelandic-dna-jigsaw-puzzle-333914", "urlToImage": null, "publishedAt": "2020-04-24T12:10:55Z", "content": "It is well-known that a group of our ancestors left Africa and, about 50,000 years ago, met Neanderthals in Europe, and then had children with them.\r\nNow, a new analysis shows that the Neanderthals may have had children with another extinct species of human (… [+4918 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Kevin Stacey", "title": "Researchers solve 'link discovery' problem for terahertz data networks - Phys.org", "description": "When someone opens a laptop, a router can quickly locate it and connect it to the local Wi-Fi network. That ability is a basic element of any wireless network known as link discovery, and now a team of researchers has developed a means of doing it with terahe…", "url": "https://phys.org/news/2020-04-link-discovery-problem-terahertz-networks.html", "urlToImage": null, "publishedAt": "2020-04-24T11:31:08Z", "content": "When someone opens a laptop, a router can quickly locate it and connect it to the local Wi-Fi network. That ability is a basic element of any wireless network known as link discovery, and now a team of researchers has developed a means of doing it with terahe… [+4150 chars]"}, {"source": {"id": null, "name": "H2-view.com"}, "author": "Molly Burgess", "title": "New eco-friendly fuel for fuel cell production - H2 View", "description": "Researchers at the University of Saskatchewan have developed a new eco-friendly fuel which can be used to create other by-products for hydrogen fuel cells.", "url": "https://www.h2-view.com/story/new-eco-friendly-fuel-for-fuel-cell-production/", "urlToImage": null, "publishedAt": "2020-04-24T08:38:34Z", "content": "Researchers at the University of Saskatchewan have developed a new eco-friendly fuel which can be used to create other by-products for hydrogen fuel cells.\r\nAs part of their research, Sonil Nanda, USask chemical and biological engineering research associate a… [+1205 chars]"}, {"source": {"id": null, "name": "Ladbible.com"}, "author": "Tom Wood", "title": "Bioluminescent Plankton Turns Waves Blue Near Beach In Mexico - LADbible", "description": "It's the first time this phenomenon has been observed on this beach in 60 years", "url": "https://www.ladbible.com/news/animals-bio-luminescent-plankton-turns-waves-blue-near-beach-in-mexico-20200424", "urlToImage": null, "publishedAt": "2020-04-24T08:36:51Z", "content": "A handful of people walking along a beach in Mexico were treated to a rare and impressive show when the waters of the sea turned fluorescent blue for the first time in 60 years.\r\nThis strange glow is the work of bioluminescentplankton hanging about near to th… [+2125 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Tom Cowie, Chloe Booker", "title": "Shopping returning and hopes high for footy restart - The Age", "description": "The Emporium shopping centre is reopening and the AFL has the backing of health authorities to restart in June, offering those with itchy feet hope that Victoria is emerging from pandemic lockdown.", "url": "https://www.theage.com.au/national/victoria/shopping-returning-and-hopes-high-for-footy-restart-20200424-p54n0p.html", "urlToImage": null, "publishedAt": "2020-04-24T08:07:09Z", "content": "However, that was still well down on the average in the past year of 3042.\r\nIt wouldn't be winter in Melbourne without footy and authorities have given a cautious green light to the AFL to proceed with plans to resume playing in June.\r\n\"There's a chance,\" Chi… [+2351 chars]"}, {"source": {"id": null, "name": "Abc14news.com"}, "author": "Brandon G. Jones", "title": "Coronavirus: Body 'in industrial fridge for six days' - ABC 14 News", "description": "Impression copyright                 Spouse and children image                                                                    Imp", "url": "https://abc14news.com/2020/04/24/coronavirus-body-in-industrial-fridge-for-six-days/", "urlToImage": null, "publishedAt": "2020-04-24T07:56:00Z", "content": "Impression copyrightSpouse and children image\r\nImpression captionUmar Afzal was a Household Business office interpreter and spoke “50 % a dozen languages”\r\nThe previous chief prosecutor Nazir Afzal stated his brother’s body was saved in an industrial fridge f… [+2165 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Researchers develop nanohybrid vehicle to optimally deliver drugs into the human body - Phys.org", "description": "Researchers in The University of Texas at El Paso's Department of Chemistry and Biochemistry have developed a nanohybrid vehicle that can be used to optimally deliver drugs into the human body.", "url": "https://phys.org/news/2020-04-nanohybrid-vehicle-optimally-drugs-human.html", "urlToImage": null, "publishedAt": "2020-04-24T06:26:33Z", "content": "Researchers in The University of Texas at El Paso's Department of Chemistry and Biochemistry have developed a nanohybrid vehicle that can be used to optimally deliver drugs into the human body.\r\nThe research was published in April 2020 in ACS Applied Material… [+3243 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Luke Auburn", "title": "Scientists develop first 3-D mass estimate of microplastic pollution in Lake Erie - Phys.org", "description": "Rochester Institute of Technology scientists have developed the first three-dimensional mass estimate to show where microplastic pollution is collecting in Lake Erie. The study examines nine different types of polymers that are believed to account for 75 perc…", "url": "https://phys.org/news/2020-04-scientists-d-mass-microplastic-pollution.html", "urlToImage": null, "publishedAt": "2020-04-24T06:18:11Z", "content": "Rochester Institute of Technology scientists have developed the first three-dimensional mass estimate to show where microplastic pollution is collecting in Lake Erie. The study examines nine different types of polymers that are believed to account for 75 perc… [+3107 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Will Dunham", "title": "Bugged: Earth's land insects are disappearing - Brisbane Times", "description": "A new study, based on 166 sets of data covering 1676 sites in 41 countries dating as far back as 1925, is the most ubiquitous and diverse animals on the planet.", "url": "https://www.smh.com.au/world/north-america/bugged-earth-s-land-insects-are-disappearing-20200424-p54n1n.html", "urlToImage": null, "publishedAt": "2020-04-24T06:07:00Z", "content": "Other bugs are disappearing at a rate of just under 1 per cent a year, with lots of variation from place to place, according to the study published in the journal Science.\r\nThat's a tinier population decline than found by some smaller localised studies, which… [+2180 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Sam Baron, The Conversation", "title": "Creator of Wolfram Alpha Has a Bold Plan to Find a New Fundamental Theory of Physics - ScienceAlert", "description": "Stephen Wolfram is a cult figure in programming and mathematics. He is the brains behind Wolfram Alpha, a website that tries to answer questions by using algorithms to sift through a massive database of information. He is also responsible for Mathema", "url": "https://www.sciencealert.com/the-mathematician-behind-wolfram-alpha-wants-to-rebuild-the-universe", "urlToImage": null, "publishedAt": "2020-04-24T04:19:46Z", "content": "Stephen Wolfram is a cult figure in programming and mathematics. He is the brains behind Wolfram Alpha, a website that tries to answer questions by using algorithms to sift through a massive database of information. He is also responsible for Mathematica, a c… [+5520 chars]"}, {"source": {"id": null, "name": "Sciencecodex.com"}, "author": null, "title": "An eclipsing binary millisecond pulsar discovered by FAST - Science Codex", "description": null, "url": "https://www.sciencecodex.com/eclipsing-binary-millisecond-pulsar-discovered-fast-645714", "urlToImage": null, "publishedAt": "2020-04-24T04:00:00Z", "content": "Using the data obtained by the Five-hundred-meter Aperture Spherical radio Telescope (FAST), a research team led by Prof. PAN Zhichen and Prof. LI Di from the National Astronomical Observatories of the Chinese Academy of Sciences (NAOC) discovered an eclipsin… [+1714 chars]"}, {"source": {"id": null, "name": "Tass.com"}, "author": "TASS", "title": "ISS crew evacuated from Soyuz-MS15 on landing - TASS", "description": "The crew has returned to Earth due to the novel coronavirus pandemic", "url": "https://tass.com/science/1146089", "urlToImage": null, "publishedAt": "2020-04-17T06:20:00Z", "content": "MOSCOW, April 17. /TASS/. Roscosmos cosmonaut Oleg Skripochka and NASA astronauts Andrew Morgan and Jessica Meir have been evacuated from the Soyuz MS-15 manned spacecraft, which landed earlier in Kazakhstan, 147 km to the southeast of the city of Zhezqazghan… [+657 chars]"}, {"source": {"id": null, "name": "Thechestnutpost.com"}, "author": "TCP Staff", "title": "NASA to Reveal Name of Next Mars Rover, Hold Media Teleconference - The Chestnut Post", "description": "NASA will unveil the name of the agency&rsquo;s next Mars rover, currently known as Mars 2020, during a live event", "url": "https://www.thechestnutpost.com/news/nasa-to-reveal-name-of-next-mars-rover-hold-media-teleconference/", "urlToImage": null, "publishedAt": "2020-03-03T21:39:21Z", "content": "This post was originally published on this siteNASA will unveil the name of the agency’s next Mars rover, currently \r\n known as Mars 2020, during a live event on NASA Television at 1:30 p.m. EST Thursday, March 5, followed by a media teleconference at 3:30 p.… [+35 chars]"}, {"source": {"id": null, "name": "Inverse.com"}, "author": "Mike Brown", "title": "How SpaceX Starlink works: price, launch date for Elon Musk's internet - Inverse", "description": "Connecting to Starlink will be really easy, Elon Musk says", "url": "https://www.inverse.com/article/62185-here-s-how-you-will-connect-to-starlink-spacex-s-internet-constellation", "urlToImage": null, "publishedAt": "2020-01-08T19:50:11Z", "content": "Starlink, SpaceXs internet connectivity satellite constellation, is taking form. The project is designed to offer higher speeds and lower latency than competing setups, so long as the receiver can see the satellites in orbit. It could help fund some of CEO El… [+4593 chars]"}]}