{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Des scientifiques détectent le coronavirus sur des particules d’air pollué - Sputnik France", "description": "Une récente étude scientifique met en lumière le rôle de la pollution dans la propagation du Covid-19. Les experts tentent de comprendre si cela a permis à l’infection...", "url": "https://fr.sputniknews.com/sante/202004261043657830-des-scientifiques-detectent-le-coronavirus-sur-des-particules-dair-pollue/", "urlToImage": null, "publishedAt": "2020-04-26T17:57:43Z", "content": null}, {"source": {"id": null, "name": "Futura-sciences.com"}, "author": "Futura avec l'AFP-Relaxnews", "title": "Les bébés garderaient leurs traits de caractère à l'âge adulte - Futura", "description": "D'après une étude menée par des chercheurs américains, certains comportements des bébés de 14 mois pourraient permettre de prédire quelques traits de leur personnalité d'adulte.", "url": "https://www.futura-sciences.com/sante/actualites/psychologie-bebes-garderaient-leurs-traits-caractere-age-adulte-80722/", "urlToImage": null, "publishedAt": "2020-04-26T16:45:36Z", "content": "D'après une étude menée par des chercheurs américains, certains comportements des bébés de 14 mois pourraient permettre de prédire quelques traits de leur personnalité d'adulte.\r\nUne étude, menée par des chercheurs de l'université du Maryland, de la Catholic … [+2559 chars]"}, {"source": {"id": null, "name": "Ledauphine.com"}, "author": "Le Dauphiné Libéré", "title": "Prévisions | Votre météo du lundi 27 avril : des orages généralisés - Le Dauphiné Libéré", "description": "La matinée de lundi sera globalement assez ensoleillée malgré quelques zones pluvieuses qui pourront se développer de manière aléatoire. Les températures s'abaisseront à 10 degrés à Grenoble, 13 à Avignon ou encore 7 à Gap. Dans l'après-midi, un ciel graduell…", "url": "https://www.ledauphine.com/environnement/2020/04/26/votre-meteo-du-lundi-27-avril-des-orages-generalises", "urlToImage": null, "publishedAt": "2020-04-26T16:00:21Z", "content": null}, {"source": {"id": null, "name": "Futura-sciences.com"}, "author": "Emma Hollen", "title": "L'exoplanète disparue Fomalhaut b est en réalité une collision géante ! - Futura", "description": "Alors que les scientifiques pensaient avoir identifié une nouvelle planète par-delà les confins de notre Système solaire en 2008, celle-ci avait soudainement et complètement disparu des capteurs...", "url": "https://www.futura-sciences.com/sciences/actualites/hubble-exoplanete-disparue-fomalhaut-b-realite-collision-geante-17341/", "urlToImage": null, "publishedAt": "2020-04-26T15:22:32Z", "content": "Alors que les scientifiques pensaient avoir identifié une nouvelle planète par-delà les confins de notre Système solaire en 2008, celle-ci avait soudainement et complètement disparu des capteurs du télescope Hubble en 2014. Une nouvelle étude propose une expl… [+8098 chars]"}, {"source": {"id": null, "name": "Lavoixdunord.fr"}, "author": "Par C. Br.", "title": "Déconfinement: attention à une deuxième vague plus puissante, avertit le virologue Christian Drosten - La Voix du Nord", "description": "Conseiller du gouvernement allemand, connu du grand public via une émission de radio hebdomadaire, Christian Drosten est un virologue allemand reconnu. Face aux premières mesures de déconfinement, il met en garde contre une deuxième vague d’épidémie «plus pui…", "url": "https://www.lavoixdunord.fr/745693/article/2020-04-26/coronavirus-le-virologue-allemand-christian-drosten-avertit-contre-une-deuxieme", "urlToImage": null, "publishedAt": "2020-04-26T14:47:16Z", "content": "En Allemagne, Christian Drosten, 48 ans est un peu le virologue star. Le directeur du département de virologie de lhôpital universitaire de la Charité, à Berlin, est le virologue en qui les Allemands ont le plus confiance, selon un sondage effectué par le tab… [+2756 chars]"}, {"source": {"id": null, "name": "Europe1.fr"}, "author": null, "title": "Le coronavirus \"est aussi une maladie du cerveau\" qui peut provoquer des encéphalites - Europe 1", "description": "Avec ses équipes, le neurologue Hervé Vespignani a découvert que certains patients atteints du coronavirus développaient une encéphalite. Un symptôme qui serait responsable selon lui &quot;d'un tiers des retards d'éveil&quot; du coma artificiel dans les servi…", "url": "https://www.europe1.fr/sante/le-covid-19-est-aussi-une-maladie-du-cerveau-qui-peut-provoquer-des-encephalites-3964269", "urlToImage": null, "publishedAt": "2020-04-26T14:30:55Z", "content": "INTERVIEW\"Manifestement, le Covid-19 est aussi une maladie du cerveau.\" Si l'on sait déjà que le coronavirus peut se manifester par des troubles pulmonaires, une perte de l'odorat et du goût, ou même par des lésions cutanées, le neurologue Hervé Vespignani et… [+1828 chars]"}, {"source": {"id": null, "name": "Lachainemeteo.com"}, "author": "Gilles MATRICON", "title": "Alerte Météo : Importante dégradation pluvieuse et orageuse - La Chaîne Météo", "description": "&nbsp;En cette fin du mois d&#39;avril, les conditions changent radicalement. En effet, un vaste syst&egrave;me d&eacute;pressionnaire se reconstitue sur l&#39;Atlantique vers le centre de l&#39;Europe et rejette&nbsp;les hautes pressions vers les Balkans.<br…", "url": "https://actualite.lachainemeteo.com/alerte-meteo/5081-importante-degradation-pluvieuse-et-orageuse", "urlToImage": null, "publishedAt": "2020-04-26T14:28:19Z", "content": "Les prévisions météo complètes en direct par téléphone au\r\nEntre lundi et mardi, une perturbation très active traverse la France, d'ouest en est. Elle se heurte à de l'air très doux qui résiste dans l'est. En conséquence, l'activité de ce front se trouve renf… [+2299 chars]"}, {"source": {"id": null, "name": "Futura-sciences.com"}, "author": "Futura avec l'AFP-Relaxnews", "title": "Quels impacts du SARS-CoV-2 sur le cerveau ? - Futura", "description": "La fièvre, la toux, l’essoufflement ou encore la perte d’odorat sont les symptômes connus du Covid-19. Des chercheurs s’interrogent à présent de l’impact du SARS-CoV-2 sur le cerveau et le système...", "url": "https://www.futura-sciences.com/sante/actualites/coronavirus-impacts-sars-cov-2-cerveau-80632/", "urlToImage": null, "publishedAt": "2020-04-26T13:58:01Z", "content": "La fièvre, la toux, l'essoufflement ou encore la perte d'odorat sont les symptômes connus du Covid-19. Des chercheurs s'interrogent à présent de l'impact du SARS-CoV-2 sur le cerveau et le système nerveux, certains patients atteints du virus présentant une pe… [+4859 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Déconfinement : les recommandations du Conseil scientifique - RTL.fr", "description": "Le Conseil scientifique recommande que les personnes âgées et fragiles restent confinée de manière \"stricte et volontaire\".", "url": "https://www.rtl.fr/actu/debats-societe/deconfinement-quelles-sont-les-recommandations-du-conseil-scientifique-7800444363", "urlToImage": null, "publishedAt": "2020-04-26T13:21:00Z", "content": "Le Conseil scientifique est chargé d'éclairer le gouvernement pour mettre en place le déconfinement. Mais le Premier ministre Édouard Philippe doit annoncer ses arbitrages mardi 28 avril à l'Assemblée nationale pour convenir d'une stratégie. \r\nLes scientifiqu… [+2952 chars]"}, {"source": {"id": null, "name": "Lepoint.fr"}, "author": "Le Point.fr", "title": "22 août 1888, le jour où une météorite tue un être humain - Le Point", "description": "Des chercheurs ont mis la main sur des manuscrits datant de l'Empire ottoman et relatant la chute de météorites tueuses, rapporte « Futura Sciences ».", "url": "https://www.lepoint.fr/sciences-nature/22-aout-1888-le-jour-ou-une-meteorite-tue-un-etre-humain-26-04-2020-2372939_1924.php", "urlToImage": null, "publishedAt": "2020-04-26T13:13:00Z", "content": "Une chance sur 1 600 000. C'est, selon le professeur Nelson de l'université de Tulane, cité par Science Post, la probabilité d'être tué par l'impact d'une météorite, d'un astéroïde ou d'une comète. Le premier cas jusque-là documenté, survenu en Inde en 2016, … [+1888 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Une menace de suspension pèse-t-elle sur Didier Raoult? Le professeur répond - Sputnik France", "description": "L'Ordre des médecins a informé que les prescriptions hors protocoles de médicaments contre le coronavirus pourraient entraîner une suspension des médecins. Didier...", "url": "https://fr.sputniknews.com/france/202004261043655688-une-menace-de-suspension-pese-t-elle-sur-didier-raoult-le-professeur-repond/", "urlToImage": null, "publishedAt": "2020-04-26T12:38:25Z", "content": null}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "M.P.", "title": "Météo : Inondations et violents orages dans les Landes et les Pyrénées-Atlantiques - 20 Minutes", "description": "Météo France a placé le département des Pyrénées-Atlantiques en vigilance jaune pour orages jusqu’à ce dimanche, 16 heures", "url": "https://www.20minutes.fr/societe/2768003-20200426-meteo-inondations-violents-orages-landes-pyrenees-atlantiques", "urlToImage": null, "publishedAt": "2020-04-26T12:22:55Z", "content": "Les orages ont frappé la Nouvelle Aquitaine, samedi 25 avrl 2020. Nicolas TUCAT / AFP\r\nLes départements des Landes et du Gers avaient, ce samedi, été placés en vigilance orange pour les crues par \r\nMétéo-France, en raison des fortes pluies passées et à venir.… [+2616 chars]"}, {"source": {"id": "les-echos", "name": "Les Echos"}, "author": "Didier Raoult", "title": "Méthodes scientifiques et épidémies, par Didier Raoult - Les Échos", "description": "S'agissant du développement de nouveaux traitements, l'approche bénéfice-risque ne peut pas être la même dans les périodes stables et dans les périodes de crise, a fortiori en temps de pandémie, soutient le microbiologiste marseillais.", "url": "https://www.lesechos.fr/idees-debats/sciences-prospective/methodes-scientifiques-et-epidemies-1198116", "urlToImage": null, "publishedAt": "2020-04-26T12:10:16Z", "content": "Il me semble que la controverse actuelle autour de la méthode qu'il convient d'appliquer à la recherche d'un traitement contre le coronavirus est due au fait que nous ne parlons pas de la même chose.\r\nDans les sociétés occidentales riches, où l'espérance de v… [+2109 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Cécile Thibert", "title": "Coronavirus : l'image rare d'une cellule respiratoire infectée - Le Figaro", "description": "EN IMAGE - On voit qu'au sein de la cellule, le virus détourne des vésicules pour se répliquer.", "url": "http://www.lefigaro.fr/sciences/coronavirus-l-image-rare-d-une-cellule-respiratoire-infectee-20200426", "urlToImage": null, "publishedAt": "2020-04-26T11:56:00Z", "content": "L'Inserm a publié une photo prise au microscope électronique d'un bataillon de SARS-CoV-2 en pleine action dans une cellule respiratoire humaine.\r\nL'intérieur de la cellule a été colorisé en bleu afin de bien distinguer les virus et les superstructures qu'ils… [+2283 chars]"}, {"source": {"id": null, "name": "Sudinfo.be"}, "author": "Par sudinfo.be", "title": "Le virologue Marc Van Ranst douche nos espoirs de déconfinement: «Le nombre de nouvelles admissions à l'hôpital ne diminue pas!» - Sudinfo.be", "description": "En Belgique, le nombre de décès dus au coronavirus a franchi la barre des 7.000, a indiqué dimanche Sciensano, l’institut scientifique de santé publique. Les nouvelles admissions à l’hôpital restent stables, mais «elles n’ont pas baissé depuis quelques jours»…", "url": "https://www.sudinfo.be/id181867/article/2020-04-26/le-virologue-marc-van-ranst-douche-nos-espoirs-de-deconfinement-le-nombre-de", "urlToImage": null, "publishedAt": "2020-04-26T11:36:00Z", "content": "Daprès le bilan actualisé de Sciensano, 809 nouveaux cas confirmés de Covid-19 ont été recensés ces dernières 24 heures. 178 nouveaux décès ont également été dénombrés, ce qui porte le total à 7.094 morts. Parmi ces nouveaux décès, 103 ont eu lieu en maisons … [+1010 chars]"}, {"source": {"id": null, "name": "Ledauphine.com"}, "author": "Recueilli par Sylviane GARCIN", "title": "Météo/À écouter | Savoie: une pluie abondante annoncée à partir de lundi 27 avril - Le Dauphiné Libéré", "description": "", "url": "https://www.ledauphine.com/environnement/2020/04/26/savoie-une-pluie-abondante-annoncee-a-partir-de-lundi-27-avril", "urlToImage": null, "publishedAt": "2020-04-26T11:22:42Z", "content": null}, {"source": {"id": null, "name": "Bienpublic.com"}, "author": "V. L.", "title": "Bourgogne-Franche-Comté | Santé | Dépistage du Covid-19 : un ensemble de laboratoires alerte sur les tests rapides - Bien Public", "description": "Face au Test rapide d’orientation diagnostique (Trod) Covid-19, un ensemble de laboratoires de Bourgogne-Franche-Comté invite à la prudence du grand public. Explications.", "url": "https://www.bienpublic.com/sante/2020/04/26/depistage-du-covid-19-un-groupement-de-biologistes-alerte-sur-les-tests-rapides", "urlToImage": null, "publishedAt": "2020-04-26T09:51:18Z", "content": "Ce samedi, un ensemble de laboratoires de Bourgogne-Franche-Comté (*), alerte le grand public sur certains tests du coronavirus Covid-19. « Il est primordial de souligner que certains tests actuellement utilisés », le « Test rapide d’orientation diagnostique … [+2450 chars]"}, {"source": {"id": null, "name": "Atlantico.fr"}, "author": null, "title": "Extinction de masse : les causes de l'apocalypse des insectes beaucoup plus complexes qu'on croyait - Atlantico.fr", "description": "Selon une nouvelle étude, dévoilée par la BBC, la chute de la population des insectes est plus disparate que prévu. La santé mondiale des populations d'insectes est beaucoup plus complexe qu'on ne le pensait. Les insectes terrestres sont en net recul, selon l…", "url": "https://www.atlantico.fr/rdv/3589114/extinction-de-masse--les-causes-de-l-apocalypse-des-insectes-beaucoup-plus-complexes-qu-on-croyait-papillons-environnement-rechauffement-climatique-papillons-frelons-asiatiques-abeilles-forets-gabon-francois-lasserre-", "urlToImage": null, "publishedAt": "2020-04-26T08:51:27Z", "content": "Atlantico.fr : Alors que les insectes terriens voient leur population diminuer, ceux vivant dans leau douce connaissent une augmentation démographique, selon de nouvelles études et des informations de la BBC ? À quoi est-ce dû ?\r\nFrançois Lasserre : Lexplicat… [+7409 chars]"}, {"source": {"id": null, "name": "Numerama.com"}, "author": "Nelly Lesage", "title": "Ne manquez pas la conjonction entre la Lune et la brillante Vénus ce soir - Numerama", "description": "Dimanche 26 avril, un rapprochement notable est prévu entre la Lune et Vénus. La planète, très brillante, croisera un croissant de Lune le soir.", "url": "https://www.numerama.com/sciences/620348-ne-manquez-pas-la-conjonction-entre-la-lune-et-la-brillante-venus-dimanche.html", "urlToImage": null, "publishedAt": "2020-04-26T08:20:14Z", "content": "Dimanche 26 avril, un rapprochement notable est prévu entre la Lune et Vénus. La planète, très brillante, croisera un croissant de Lune le soir.\r\nLe mois davril 2020 met à lhonneur Vénus : passée dans lamas des Pléiades au début du mois, la planète est de plu… [+1542 chars]"}, {"source": {"id": null, "name": "Courrierinternational.com"}, "author": null, "title": "Les insectes disparaissent, mais tout espoir n'est pas perdu - Courrier International", "description": "Une nouvelle étude parue dans Science confirme la disparition massive des insectes. Mais quelques contre-exemples montrent que les politiques locales de protection des écosystèmes peuvent freiner le phénomène.", "url": "https://www.courrierinternational.com/une/biodiversite-les-insectes-disparaissent-mais-tout-espoir-nest-pas-perdu", "urlToImage": null, "publishedAt": "2020-04-26T07:54:32Z", "content": "Une nouvelle étude parue dans Science confirme la disparition massive des insectes. Mais quelques contre-exemples montrent que les politiques locales de protection des écosystèmes peuvent freiner le phénomène.Des gains parcellaires, des pertes généralisées, v… [+1540 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": "https://www.lemonde.fr/blog/realitesbiomedicales/author/realitesbiomedicales/", "title": "Covid-19 : comment le coronavirus exploite la réponse immunitaire pour attaquer des cellules respiratoires et intestinales - Le Monde", "description": "C’est une étude d'une importance majeure que viennent de publier le 21 avril une soixantaine de chercheurs internationaux dans la revue Cell. Les résultats de cette publication exceptionnellement longue (63 pages) permettent de mieux comprendre comment le cor…", "url": "https://www.lemonde.fr/blog/realitesbiomedicales/2020/04/26/covid-19-comment-le-coronavirus-exploite-la-reponse-immunitaire-pour-attaquer-des-cellules-respiratoires-et-intestinales/", "urlToImage": null, "publishedAt": "2020-04-26T07:31:20Z", "content": "Représentation artistique du coronavirus SARS-CoV-2 © Fusion Medical Animation on Unsplash\r\nCest une étude d’une importance majeure que viennent de publier le 21 avril une soixantaine de chercheurs internationaux dans la revue Cell. Les résultats de cette pub… [+15950 chars]"}, {"source": {"id": null, "name": "Sciencesetavenir.fr"}, "author": "Sylvie Rouat", "title": "L'inquiétante découverte de moules en Antarctique - Sciences et Avenir", "description": "La présence de moules de Patagonie dans les eaux de l’Antarctique témoigne de la pression humaine sur un milieu qui abrite le plus fort taux d'endémisme de la planète. En cause : le réchauffement climatique et l'augmentation débridée du tourisme polaire.", "url": "https://www.sciencesetavenir.fr/nature-environnement/mers-et-oceans/l-inquietante-decouverte-de-moules-en-antarctique_143742", "urlToImage": null, "publishedAt": "2020-04-26T07:14:24Z", "content": "L'océan Antarctique est sans doute le milieu le plus hermétique de la planète, isolé depuis cinq millions d'années par la barrière naturelle que constitue le puissant courant circumpolaire. Il semblerait cependant que cette frontière océanographique ne soit p… [+8065 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "BFMTV", "title": "Doit-on avoir peur qu'un astéroïde détruise la planète Terre? - BFMTV", "description": "Parmi les centaines de milliers d'astéroïdes connus des chercheurs, 2000 représentent un danger potentiel pour la Terre. Surveillés en permanence, leur orbite est calculée afin de prévoir un potentiel risque de collision, et des techniques de déviation de cor…", "url": "https://www.bfmtv.com/planete/doit-on-avoir-peur-qu-un-asteroide-detruise-la-planete-terre-1899689.html", "urlToImage": null, "publishedAt": "2020-04-26T05:45:56Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus : \"Les tests PCR sont fiables\", avec les tests sanguins rapides, il faut rester prudent, explique un virologue - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_9d124d6e-876e-4889-8c7d-10beb347fd2b&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-26T05:34:10Z", "content": "Afin de vous offrir une expérience globale optimisée, nous souhaitons vous proposer des publicités pertinentes qui vous seront plus utiles. Par exemple, lorsque vous recherchez un film, nous utilisons vos données de recherche et votre position pour afficher l… [+471 chars]"}, {"source": {"id": null, "name": "Laprovence.com"}, "author": "Météo France", "title": "La météo en Provence : beau sur la côte, averses dans l'arrière-pays - La Provence", "description": "Le matin : le temps est plutôt ensoleillé en bord de mer et vallée du Rhône, plus nuageux dans l'arrière-pays.  L'après-midi : les nuages s'épaississent sur les hauteurs, des averses orageuses se produisent. Les températures seront comprises entre 19 et 22°C …", "url": "https://www.laprovence.com/actu/en-direct/5971658/la-meteo-en-provence-beau-sur-la-cote-averses-dans-larriere-pays.html", "urlToImage": null, "publishedAt": "2020-04-26T04:59:53Z", "content": "Vous avez trouvé sur notre site internet un contenu ou un message manifestement illicite et/ou portant atteinte à la dignité humaine ?"}, {"source": {"id": null, "name": "Courrierinternational.com"}, "author": null, "title": "Le confinement sera un traumatisme durable pour nos esprits - Courrier International", "description": "L’isolement prolongé a des conséquences sur notre psychisme. Le confinement dû à l’épidémie de Covid-19 peut provoquer un syndrome de stress post-traumatique et une dépression, dont il faut essayer de se prémunir, écrit cette journaliste.", "url": "https://www.courrierinternational.com/article/psychologie-le-confinement-sera-un-traumatisme-durable-pour-nos-esprits", "urlToImage": null, "publishedAt": "2020-04-26T04:40:05Z", "content": "Lisolement prolongé a des conséquences sur notre psychisme. Le confinement dû à lépidémie de Covid-19 peut provoquer un syndrome de stress post-traumatique et une dépression, dont il faut essayer de se prémunir, écrit cette journaliste.À la mi-mars, jai début… [+5214 chars]"}, {"source": {"id": null, "name": "Estrepublicain.fr"}, "author": "Thierry FEDRIGO", "title": "Grand Est | Météorologie | Soleil et chaleur : sécheresse en vue - Est Républicain", "description": "Petite consolation au milieu des nuages de la crise, le soleil aura été d’une exceptionnelle générosité depuis le début du confinement. Mars aura été ...", "url": "https://www.estrepublicain.fr/actualite/2020/04/26/soleil-et-chaleur-secheresse-en-vue", "urlToImage": null, "publishedAt": "2020-04-26T04:33:24Z", "content": "Des journées chaudes comme en été. Un soleil parfois ardent. Et des pluies quasiment absentes. Depuis le début du confinement, le Grand Est est plongé dans une ambiance printanière, voire estivale. La nature a pris un peu davance. Et, dans certains jardins, o… [+2873 chars]"}, {"source": {"id": null, "name": "Fredzone.org"}, "author": "Youssouf", "title": "Les premiers humains et les Néandertaliens avaient l'air de bien s'entendre - FREDZONE", "description": "L'Homme de Néandertal, ou Néandertalien, est une espèce humaine éteinte il y a environ 30 000 ans. Il a vécu en Asie centrale, au Moyen-Orient et en Europe, et était physiquement plus robuste, plus trapu et plus lourd qu’Homo sapiens (l'Homme moderne, l’espèc…", "url": "https://www.fredzone.org/les-premiers-humains-et-les-neandertaliens-avaient-lair-de-bien-sentendre-655", "urlToImage": null, "publishedAt": "2020-04-25T21:51:12Z", "content": "L’Homme de Néandertal, ou Néandertalien, est une espèce humaine éteinte il y a environ 30 000 ans. Il a vécu en Asie centrale, au Moyen-Orient et en Europe, et était physiquement plus robuste, plus trapu et plus lourd quHomo sapiens (l’Homme moderne, lespèce … [+2187 chars]"}, {"source": {"id": null, "name": "Futura-sciences.com"}, "author": "Nathalie Mayer", "title": "Les secrets de la naissance d'Arrokoth, l'astéroïde le plus lointain jamais visité - Futura", "description": "Arrokoth est un astéroïde singulier à plus d’un titre. D’abord parce qu’il est l’objet le plus éloigné jamais visité par une sonde. Ensuite parce qu’il présente une forme et des caractéristiques...", "url": "https://www.futura-sciences.com/sciences/actualites/asteroides-secrets-naissance-arrokoth-asteroide-plus-lointain-jamais-visite-80742/", "urlToImage": null, "publishedAt": "2020-04-25T19:16:45Z", "content": "Arrokoth est un astéroïde singulier à plus d'un titre. D'abord parce qu'il est l'objet le plus éloigné jamais visité par une sonde. Ensuite parce qu'il présente une forme et des caractéristiques étonnantes. Mais des astronomes proposent aujourd'hui une explic… [+2632 chars]"}, {"source": {"id": null, "name": "Journaldequebec.com"}, "author": "Agence QMI", "title": "COVID-19 et AVC chez les jeunes adultes: un lien inquiétant et de plus en plus clair - Le Journal de Québec", "description": "L’augmentation importante du nombre d’AVC chez les adultes dans la trentaine et la quarantaine en parfaite santé inquiète des médecins new-yorkais.", "url": "https://www.journaldequebec.com/2020/04/25/covid-19-et-avc-chez-les-jeunes-adultes-un-lien-inquietant-et-de-plus-en-plus-clair-1", "urlToImage": null, "publishedAt": "2020-04-25T19:06:00Z", "content": "Laugmentation importante du nombre dAVC chez les adultes dans la trentaine et la quarantaine en parfaite santé inquiète des médecins new-yorkais, qui y voient un lien clair avec le coronavirus.  \r\n À lire aussi: Tous les développements de la pandémie \r\nLe phy… [+2656 chars]"}, {"source": {"id": null, "name": "Www.lci.fr"}, "author": "La rédaction de LCI", "title": "L'armée française s'est-elle vraiment procurée des stocks de chloroquine ? Oui, elle évoque un \"achat de précaution\" - LCI", "description": "À LA LOUPE – Une cargaison de chloroquine à destination de l'armée, filmée et diffusée sur les réseaux sociaux, a suscité des réactions massives. Le ministère a confirmé cette information et explique se préparer en cas d'efficacité avérée du traitement contre…", "url": "https://www.lci.fr/population/coronavirus-l-armee-francaise-s-est-elle-vraiment-fait-livrer-des-stocks-de-chloroquine-oui-elle-evoque-un-achat-de-precaution-2152012.html", "urlToImage": null, "publishedAt": "2020-04-25T18:59:14Z", "content": "Partagée, repartagée, commentée, débattue… Une séquence vidéo a créé la polémique sur les réseaux, un homme filmant un stock de chloroquine produit en Chine et dont le destinataire n'est autre que l'armée française. \r\n\"Soixante-dix kilos en baril de chloroqui… [+2669 chars]"}, {"source": {"id": null, "name": "Numerama.com"}, "author": "Marcus Dupont-Besnard", "title": "Et si notre cerveau avait acquis la faculté du langage il y a 25 millions d'années ? - Numerama", "description": "Une étude parue dans Nature a identifié des voies neurologiques similaires chez différents primates humains et non-humains.", "url": "https://www.numerama.com/sciences/620484-et-si-notre-cerveau-avait-acquis-la-faculte-du-langage-il-y-a-25-millions-dannees.html", "urlToImage": null, "publishedAt": "2020-04-25T18:14:27Z", "content": "Une étude parue dans Nature a identifié des voies neurologiques similaires chez différents primates humains et non-humains.\r\nPour retracer lhistoire du cerveau, les anthropologues sont face à un problème : si on peut retrouver des crânes fossilisés, ce nest p… [+3067 chars]"}, {"source": {"id": null, "name": "Lejsl.com"}, "author": "Le Journal de Saône et Loire", "title": "Météo | Le ciel de ce samedi soir annonce les orages de dimanche [VIDEO] - Le JSL", "description": "Des nuages s'inviteront dès ce matin sur l'ensemble de la région, donnant même quelques averses. Le temps deviendra de plus en ...", "url": "https://www.lejsl.com/saone-et-loire/2020/04/25/un-dimanche-orageux", "urlToImage": null, "publishedAt": "2020-04-25T17:39:31Z", "content": "Des nuages s'inviteront dès ce dimanche matin sur l'ensemble de la région, donnant même quelques averses. Le temps deviendra de plus en plus instable dans l'après-midi, tournant à l'averses et parfois à l'orage. L'atmosphère restera  douce et parfois assez lo… [+167 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Confinement : \"Les enfants sont totalement exclus ou presque des discours politiques\", regrette une spécialise des psychopathologies - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_9344a79a-11db-4c58-a537-af71610223cb&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-25T17:09:00Z", "content": "Afin de vous offrir une expérience globale optimisée, nous souhaitons vous proposer des publicités pertinentes qui vous seront plus utiles. Par exemple, lorsque vous recherchez un film, nous utilisons vos données de recherche et votre position pour afficher l… [+471 chars]"}, {"source": {"id": null, "name": "Lepoint.fr"}, "author": "Le Point.fr", "title": "Le coronavirus provoque-t-il des AVC ? Des médecins alertent - Le Point", "description": "Plusieurs dizaines de patients de 30 à 40 ans, touchés par le coronavirus, sont morts à la suite d'AVC dans différents hôpitaux, rapporte le « Washington Post ».", "url": "https://www.lepoint.fr/sante/le-coronavirus-provoque-t-il-des-avc-des-medecins-alertent-25-04-2020-2372872_40.php", "urlToImage": null, "publishedAt": "2020-04-25T16:54:00Z", "content": "Fièvres, essoufflement, perte du goût et de l'odorat sont parmi les principaux symptômes identifiés du Covid-19 jusqu'à présent. Mais, ce sont désormais les dégâts au cerveau qui inquiètent les spécialistes. Des dizaines de patients ne présentant pas forcémen… [+1869 chars]"}, {"source": {"id": null, "name": "Ledauphine.com"}, "author": "Le Dauphiné Libéré", "title": "Prévisions | Votre météo du dimanche 26 avril : attention aux orages - Le Dauphiné Libéré", "description": "Le temps s'annonce assez instable dimanche avec, le matin quelques averses possibles sur le nord de la région Rhône-Alpes. Ailleurs, le ciel sera partagé entre nuages et éclaircies. Les températures tourneront entre 10 et 12 degrés au lever du jour à basse al…", "url": "https://www.ledauphine.com/environnement/2020/04/25/votre-meteo-du-dimanche-26-avril-attention-aux-orages", "urlToImage": null, "publishedAt": "2020-04-25T16:00:03Z", "content": null}, {"source": {"id": null, "name": "Sciencesetavenir.fr"}, "author": "Coralie Lemke", "title": "Covid-19 : l'absence d'immunité serait \"une exception\" explique le Pr. Vivier - Sciences et Avenir", "description": "Mutations, recombinaisons... Les obstacles à un vaccin efficace sont nombreux. D'autant qu'il est impossible pour le moment de dire s'il existe une immunité au SARS-CoV-2. Interview avec le Pr. Eric Vivier, immunologue à l’Assistance publique - Hôpitaux de Ma…", "url": "https://www.sciencesetavenir.fr/sante/covid-19-l-absence-d-immunite-serait-une-exception-explique-le-pr-vivier_143773", "urlToImage": null, "publishedAt": "2020-04-25T15:52:43Z", "content": "Pas de vaccin avant longtemps, aucune assurance que le vaccin soit durablement efficace, une immunité inconnue après avoir été exposé au virus... Autant d'inconnues malgré lesquelles les laboratoires se sont lancés dans la course au vaccin et les gouvernement… [+3482 chars]"}, {"source": {"id": null, "name": "Businessnews.com.tn"}, "author": null, "title": "Les tests de dépistage : une clef stratégique pour le contrôle du Covid-19 - Business News", "description": "Les m�thodes et les techniques de d�pistage connaissent un d�veloppement rapide dans le contexte de la pand�mie Covid-19..", "url": "https://www.businessnews.com.tn/Les-tests-de-d%C3%A9pistage--une-clef-strat%C3%A9gique-pour-le-contr%C3%B4le-du-Covid-19,526,97872,3", "urlToImage": null, "publishedAt": "2020-04-25T12:46:00Z", "content": "Le dépistage objet de désir et de controverses\r\nLes méthodes et les techniques de dépistage connaissent un développement rapide dans le contexte de la pandémie Covid-19 provoquée par un nouveau virus. Le dépistage connait des expressions différentes dans les … [+12732 chars]"}, {"source": {"id": null, "name": "Lavoixdunord.fr"}, "author": "Par Youenn Martin", "title": "Un prof de maths de Montigny-en-Gohelle crée une chaîne Youtube idéale pour réviser en étant confiné - La Voix du Nord", "description": "Il y pensait depuis plusieurs années, le confinement l’a poussé à franchir le pas. Le Montignynois Salim Brigui, qui enseigne les mathématiques au collège Gérard-Philipe à Hénin-Beaumont et au collège Hergé à Gondecourt, vient de lancer sa chaîne Youtube.", "url": "https://www.lavoixdunord.fr/745428/article/2020-04-25/un-prof-de-maths-de-montigny-en-gohelle-cree-une-chaine-youtube-ideale-pour", "urlToImage": null, "publishedAt": "2020-04-25T12:43:00Z", "content": "Bob lÉponge, Bart Simpson, Rick et Morty On croise du beau monde dans la salle de classe (virtuelle) de Salim Brigui. Il y a un peu plus de trois semaines, cet habitant de Montigny-en-Gohelle a lancé une chaîne Youtube dédiée aux mathématiques. On y parle fon… [+272 chars]"}, {"source": {"id": null, "name": "Futura-sciences.com"}, "author": "Adrien Coffinet", "title": "Voilà à quoi ressemble l'astéroïde qui « frôlera » la Terre le 29 avril - Futura", "description": "L'astéroïde (52768) 1998 OR2, qui passera à 6,29 millions de kilomètres de la Terre le 29 avril prochain à 9 h 56 TU (11 h 56 heure de Paris), a été observé par le radiotélescope d'Arecibo. Le...", "url": "https://www.futura-sciences.com/sciences/breves/asteroides-voila-ressemble-asteroide-frolera-terre-29-avril-2081/", "urlToImage": null, "publishedAt": "2020-04-25T12:41:41Z", "content": "L'astéroïde (52768) 1998 OR2, qui passera à 6,29 millions de kilomètres de la Terre le 29 avril prochain à 9 h 56 TU (11 h 56 heure de Paris), a été observé par le radiotélescope d'Arecibo. Le réflecteur sphérique de 305 mètres de diamètre (le deuxième plus g… [+1812 chars]"}, {"source": {"id": null, "name": "Hibapress.com"}, "author": "Mohamed Baba", "title": "MÉTÉO/BULLETIN SPÉCIAL ET ALERTE ORANGE: ORAGES RAVAGEURS ET GRÊLE. LE BARRAGE LALLA TAKERKOUST EST \"RESSUSCITÉ\" - hibapress", "description": "HIBAPRESS- RABAT Le temps continue de sévir en perturbations continuent depuis jeudi dernier ou des averses orageuses et pluies diluviennes font sensations auprès des populations en ces temps de confi", "url": "https://fr.hibapress.com/news-47581.html", "urlToImage": null, "publishedAt": "2020-04-25T12:33:12Z", "content": "HIBAPRESS- RABAT\r\nLe temps continue de sévir en perturbations continuent depuis jeudi dernier ou des averses orageuses et pluies diluviennes font sensations auprès des populations en ces temps de confinement, là ou les gens peuvent donc sacquitter de belles m… [+809 chars]"}, {"source": {"id": null, "name": "Futura-sciences.com"}, "author": "Céline  Deluzarche", "title": "Pendant le confinement, les ingénieurs de la Nasa pilotent Curiosity de chez eux - Futura", "description": "Pour diriger le rover Curiosity sur Mars, les ingénieurs du Jet Propulsion Laboratory à Pasadena (Californie) disposent habituellement de lunettes spéciales pour percevoir les contours du paysage...", "url": "https://www.futura-sciences.com/sciences/breves/curiosity-pendant-confinement-ingenieurs-nasa-pilotent-curiosity-chez-eux-2416/", "urlToImage": null, "publishedAt": "2020-04-25T11:30:00Z", "content": "Pour diriger le rover Curiosity sur Mars, les ingénieurs du Jet Propulsion Laboratory à Pasadena (Californie) disposent habituellement de lunettes spéciales pour percevoir les contours du paysage en 3D. Seulement voilà : depuis le confinement, les scientifiqu… [+1355 chars]"}, {"source": {"id": null, "name": "Letemps.ch"}, "author": "Pierre Brisson", "title": "Peut-on adhérer au “principe anthropique fort” autrement qu’animé par la Foi? - Le Temps", "description": "L’Homme est-il la finalité de l’Univers ? Autrement dit, la vie intelligente, consciente d’elle-même, de son environnement et communicante, est-elle la raison d’être de l’Univers ? La question est celle du « principe anthropique fort ». Elle fut posée en des …", "url": "https://blogs.letemps.ch/pierre-brisson/2020/04/25/la-croyance-dans-le-principe-anthropique-fort-doit-elle-recueillir-notre-adhesion/", "urlToImage": null, "publishedAt": "2020-04-25T09:30:46Z", "content": "LHomme est-il la finalité de lUnivers ? Autrement dit, la vie intelligente, consciente delle-même, de son environnement et communicante, est-elle la raison dêtre de lUnivers ? La question est celle du « principe anthropique fort ». Elle fut posée en des terme… [+19074 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "L’inquiétante découverte de moules en Antarctique - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_8ab0f5d9-b48f-471c-976f-f1bd3172eac7&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-25T07:00:00Z", "content": "Afin de vous offrir une expérience globale optimisée, nous souhaitons vous proposer des publicités pertinentes qui vous seront plus utiles. Par exemple, lorsque vous recherchez un film, nous utilisons vos données de recherche et votre position pour afficher l… [+471 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "Sébastien Marcelle", "title": "Quelle était cette impressionnante traînée lumineuse blanche dans le ciel de la région vendredi soir ? - LaDepeche.fr", "description": "Une succession de points lumineux formant une longue traînée blanche a interpellé de nombreux habitants de la région, ce vendredi soir aux alentours de 22 heures. Les observateurs attentifs du ciel ont ainsi pu voir le train de satellites Starlink lancés le 2…", "url": "https://www.ladepeche.fr/2020/04/25/limpressionnante-constellation-de-satellites-starlink-visible-dans-le-ciel-de-la-region-vendredi-soir,8862233.php", "urlToImage": null, "publishedAt": "2020-04-25T06:36:36Z", "content": "l'essentiel\r\n Une succession de points lumineux formant une longue traînée blanche a interpellé de nombreux habitants de la région, ce vendredi soir aux alentours de 22 heures. Les observateurs attentifs du ciel ont ainsi pu voir le train de satellites Starli… [+3244 chars]"}, {"source": {"id": null, "name": "Lachainemeteo.com"}, "author": "Quentin PERCEROU", "title": "Qu'est-ce qu'un marais barométrique ? - La Chaîne Météo", "description": "Au cours de ces derniers jours, le temps dans le sud de la France a été influencé par un complexe dépressionnaire. Ce complexe, entre autres, a favorisé des pluies durables dans le Languedoc-Roussillon. Nous ne sommes plus sous l’influence de cette dépression…", "url": "https://actualite.lachainemeteo.com/actualite-meteo/2020-04-25/qu-est-ce-qu-un-marais-barometrique-54821", "urlToImage": null, "publishedAt": "2020-04-25T06:03:00Z", "content": "Au cours de ces derniers jours, le temps dans le sud de la France a été influencé par un complexe dépressionnaire. Ce complexe, entre autres, a favorisé des pluies durables dans le Languedoc-Roussillon. Nous ne sommes plus sous linfluence de cette dépression.… [+1455 chars]"}, {"source": {"id": null, "name": "Sciencesetavenir.fr"}, "author": "Olivier Hertel", "title": "Covid-19 : selon la pharmacocinétique, le traitement à l'hydroxychloroquine ne peut pas marcher - Sciences et Avenir", "description": "La pharmacocinétique est une discipline qui étudie l’évolution des concentrations du médicament dans l’organisme. Elle démontre que l'hydroxychloroquine ne peut pas être efficace contre le Covid-19. Explications.", "url": "https://www.sciencesetavenir.fr/sante/hydroxychloroquine-son-inefficacite-etait-previsible-depuis-le-debut_143764", "urlToImage": null, "publishedAt": "2020-04-25T04:32:21Z", "content": "INEFFICACE. Le 22 avril 2020, devant les sénateurs, le ministre de la Santé, Olivier Véran déclarait à propos de l'hydroxychloroquine et de l'azithromycine : \"Les dernières publications qui ont été publiées et validées ne sont pas en faveur, hélas, de l'utili… [+6282 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Des tests de la chloroquine contre le Covid-19 interrompus pour des raisons de sécurité après plusieurs décès - Sputnik France", "description": "Une équipe de chercheurs qui testait de la chloroquine en tant que traitement du Covid-19 a dû écourter ses travaux après qu’un quart des patients ayant pris cet...", "url": "https://fr.sputniknews.com/sci_tech/202004241043649413-des-tests-de-la-chloroquine-contre-le-covid-19-interrompus-pour-des-raisons-de-securite-apres/", "urlToImage": null, "publishedAt": "2020-04-24T21:15:58Z", "content": "Une équipe de chercheurs qui testait de la chloroquine en tant que traitement du Covid-19 a dû écourter ses travaux après quun quart des patients ayant pris cet antipaludéen sont décédés, selon les résultats de létude publiés dans le Journal de l'American Med… [+3394 chars]"}, {"source": {"id": null, "name": "Barbanews.com"}, "author": null, "title": "Thierry Lhermitte - Mystérieux mal qui le ronge vraiment au quotidien ! Trouble neurologique grave ! - barbanews", "description": "L’inoubliable Popeye, de la bande des Bronzés, se fait plutôt discret dans les médias et sur les réseaux sociaux, comparé à d’autres stars françaises. Pourtant, à de très rares occasions,...", "url": "https://www.barbanews.com/peoples/thierry-lhermitte-mysterieux-mal-qui-le-ronge-vraiment-au-quotidien-trouble-neurologique-grave/", "urlToImage": null, "publishedAt": "2020-04-24T20:23:00Z", "content": "L’inoubliable Popeye, de la bande des Bronzés, se fait plutôt discret dans les médias et sur les réseaux sociaux, comparé à d’autres stars françaises.\r\nPourtant, à de très rares occasions, l’acteur se confie sur les événements importants de sa vie, comme il a… [+2997 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Marie-Laetitia Sibille", "title": "Coronavirus : La capacité de mutation du Covid-19 a-t-elle été sous-estimée, comme le suggère une étude chinoise ? - 20 Minutes", "description": "Les résultats de cette étude, relayée sur des sites scientifiques, inquiètent les internautes, qui doutent de l’efficacité d’un futur vaccin", "url": "https://www.20minutes.fr/sante/2767043-20200424-coronavirus-capacite-mutation-covid-19-sous-estimee-comme-suggere-etude-chinoise", "urlToImage": null, "publishedAt": "2020-04-24T19:15:18Z", "content": "Au laboratoire du centre de prévention et de contrôle des maladies du comté de Changxing, dans la ville de Huzhou, en Chine, le 21 avril 2020. CHINE NOUVELLE/SIPA\r\n« On a ouvert la boîte de Pandore, et, oh surprise, le petit virus échappe à tout contrôle, auc… [+6485 chars]"}, {"source": {"id": null, "name": "Futura-sciences.com"}, "author": "Rémy Decourt", "title": "Hubble : Roger-Maurice Bonnet nous raconte la collaboration de l'ESA avec la Nasa - Futura", "description": "À l'occasion de l'anniversaire des 30 ans du télescope spatial Hubble, Roger-Maurice Bonnet, directeur du Programme scientifique de l’Agence spatiale européenne de 1983 à 2001, nous explique...", "url": "https://www.futura-sciences.com/sciences/actualites/hubble-hubble-roger-maurice-bonnet-nous-raconte-collaboration-esa-nasa-80567/", "urlToImage": null, "publishedAt": "2020-04-24T18:11:03Z", "content": "À l'occasion de l'anniversaire des 30 ans du télescope spatial Hubble, Roger-Maurice Bonnet, directeur du Programme scientifique de l'Agence spatiale européenne de 1983 à 2001, nous explique pourquoi la Nasa a embarqué l'ESA dans cette formidable aventure. Et… [+6554 chars]"}, {"source": {"id": null, "name": "Futura-sciences.com"}, "author": "Nathalie Mayer", "title": "Nouvelles images de la comète Atlas en morceaux - Futura", "description": "La comète Atlas se présentait comme la comète de l'année voire de la décennie. Mais il y a quelques jours, son éclat a faibli. Et des images du télescope spatial Hubble ont révélé qu’elle s’était...", "url": "https://www.futura-sciences.com/sciences/actualites/comete-nouvelles-images-comete-atlas-morceaux-79752/", "urlToImage": null, "publishedAt": "2020-04-24T18:11:00Z", "content": "La comète Atlas se présentait comme la comète de l'année voire de la décennie. Mais il y a quelques jours, son éclat a faibli. Et des images du télescope spatial Hubble ont révélé qu'elle s'était fragmentée.\r\nMAJ, 24 avril 2020\r\nCe samedi 18 avril 2020, le té… [+15819 chars]"}, {"source": {"id": null, "name": "Journaldugeek.com"}, "author": "Felix Gouty", "title": "Le télescope Hubble a observé une collision entre deux objets célestes - Journal du geek", "description": "Pour comprendre la raison de la disparition d'une exoplanète, des astronomes en sont venus à la conclusion que cette dernière n'avait en fait jamais existé.", "url": "https://www.journaldugeek.com/2020/04/24/telescope-hubble-collision-planetes/", "urlToImage": null, "publishedAt": "2020-04-24T17:58:04Z", "content": "Menant l’enquête pour comprendre la raison de la disparition d’une exoplanète, des astronomes en sont venus à la conclusion que cette dernière n’avait en réalité jamais existé. Le télescope Hubble aurait en fait observé une collision de deux objets puis le nu… [+2628 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Cécile Thibert", "title": "Le coronavirus pourrait aussi s'en prendre au cerveau - Le Figaro", "description": "DÉCRYPTAGE - Des troubles du comportement et des anomalies à l’imagerie cérébrale ont été identifiés chez certains patients.", "url": "http://www.lefigaro.fr/sciences/le-coronavirus-pourrait-aussi-s-en-prendre-au-cerveau-20200424", "urlToImage": null, "publishedAt": "2020-04-24T17:43:00Z", "content": "Les soignants des services de réanimation en sont désormais convaincus: quelque chose cloche avec leurs patients Covid-19. Jusque-là, la communauté médicale pensait que le virus ne sen prenait quaux voies respiratoires et digestives. Attaque se soldant, dans … [+843 chars]"}, {"source": {"id": null, "name": "Trustmyscience.com"}, "author": null, "title": "Coronavirus : Des chercheurs auraient découvert les types de cellules humaines les plus vulnérables - Trust My Science", "description": "554 Partages Des scientifiques ont découvert quels types de cellules du corps humain sont les plus susceptibles d’être infectées par le nouveau coronavirus SARS-CoV-2, en identifiant les cibles pour le pathogène en fonction des types de protéines produites pa…", "url": "https://trustmyscience.com/covid-19-scientifiques-decouvert-types-cellules-humaines-plus-vulnerables/", "urlToImage": null, "publishedAt": "2020-04-24T16:15:17Z", "content": "Des scientifiques ont découvert quels types de cellules du corps humain sont les plus susceptibles dêtre infectées par le nouveau coronavirus SARS-CoV-2, en identifiant les cibles pour le pathogène en fonction des types de protéines produites par les cellules… [+5315 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": "Clémentine Thiberge", "title": "Avec le réchauffement, des ouragans plus lents et plus destructeurs - Le Monde", "description": "Selon une étude américano-japonaise, le déplacement des cyclones et des tempêtes tropicales devraient être de moins en moins rapide, ce qui entraînerait des dégâts plus importants.", "url": "https://www.lemonde.fr/planete/article/2020/04/24/avec-le-rechauffement-des-ouragans-plus-lents-et-plus-destructeurs_6037690_3244.html", "urlToImage": null, "publishedAt": "2020-04-24T15:50:51Z", "content": "Houston, au Texas, le 31 août 2017, après le passage de louragan Harvey. SCOTT OLSON / AFP\r\nPrès de 90 morts, 125 milliards de dommages, 200 000 maisons détruites. Cest le lourd bilan de louragan Harvey, qui, en août 2017, a dévasté le Texas et la Louisiane. … [+2400 chars]"}, {"source": {"id": null, "name": "Journaldugeek.com"}, "author": "Felix Gouty", "title": "Ces 19 astéroïdes sont en réalité d'origine extrasolaire | Journal du Geek - Journal du geek", "description": "19 astéroïdes, actuellement sagement en orbite entre Jupiter et Neptune, proviennent en réalité de l'extérieur de notre système solaire.", "url": "https://www.journaldugeek.com/2020/04/24/asteroides-systeme-solaire/", "urlToImage": null, "publishedAt": "2020-04-24T15:21:29Z", "content": "19 astéroïdes, actuellement sagement en orbite entre Jupiter et Neptune, proviennent en réalité de l’extérieur de notre système solaire. Un astronome français et une astrophysicienne brésilienne sont à l’origine de cette découverte surprenante.Crédits : Imenc… [+2864 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Réunion 1ère", "title": "Coronavirus : aucun nouveau cas ce vendredi, le bilan total reste à 412 cas à La Réunion - Réunion la 1ère - Outre-mer la 1ère", "description": "La pr&eacute;fecture et l&#39;ARS annoncent qu&#39;aucun cas n&#39;a &eacute;t&eacute; confirm&eacute; ce vendredi 24 avril. Ce n&#39;est pas la premi&egrave;re fois, le nombre de cas recens&eacute;s", "url": "https://la1ere.francetvinfo.fr/reunion/coronavirus-aucun-nouveau-cas-ce-vendredi-le-bilan-total-reste-a-412-cas-a-la-reunion-826350.html", "urlToImage": null, "publishedAt": "2020-04-24T14:59:25Z", "content": "Depuis la fin du mois de mars, une baisse du nombre de cas confirmés est observée à la Réunion, entre 0 et 10 cas par jour, confirmant ainsi une faible circulation ponctuelle sur le territoire, selon les autorités sanitaires. Ainsi, le nombre total de cas con… [+3882 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "Emmanuelle Rey", "title": "Au CHU de Toulouse, une équipe étudie les complications neurologiques du Covid-19 - ladepeche.fr", "description": "Maux de tête, troubles de l'odorat, picotements dans les jambes, paralysie faciale ont pu être observés chez des patients souffrant de formes sévères de Covid-19. Depuis deux semaines, le service de neurologie du CHU de Toulouse évalue tous les patients hospi…", "url": "https://www.ladepeche.fr/2020/04/24/au-chu-de-toulouse-une-equipe-etudie-les-complications-neurologiques-du-covid-19,8861224.php", "urlToImage": null, "publishedAt": "2020-04-24T14:31:00Z", "content": "l'essentiel\r\n Maux de tête, troubles de l'odorat, picotements dans les jambes, paralysie faciale ont pu être observés chez des patients souffrant de formes sévères de Covid-19. Depuis deux semaines, le service de neurologie du CHU de Toulouse évalue tous les … [+3814 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Espace : Une exoplanète ressemblant à la Terre vient d'être découverte par la Nasa - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_25a21bf5-3c86-4648-be8d-8bdc38f1bd01&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-24T14:28:00Z", "content": "Afin de vous offrir une expérience globale optimisée, nous souhaitons vous proposer des publicités pertinentes qui vous seront plus utiles. Par exemple, lorsque vous recherchez un film, nous utilisons vos données de recherche et votre position pour afficher l… [+471 chars]"}, {"source": {"id": null, "name": "Futura-sciences.com"}, "author": "Rémy Decourt", "title": "Hubble dévoile « un récif corallien cosmique » pour ses 30 ans - Futura", "description": "Trente ans après son lancement, Hubble continue d'émerveiller le public non scientifique et la communauté des astronomes professionnels. Les images anniversaire sont toujours très attendues,...", "url": "https://www.futura-sciences.com/sciences/actualites/hubble-hubble-devoile-recif-corallien-cosmique-30-ans-80734/", "urlToImage": null, "publishedAt": "2020-04-24T12:59:42Z", "content": "Trente ans après son lancement, Hubble continue d'émerveiller le public non scientifique et la communauté des astronomes professionnels. Les images anniversaire sont toujours très attendues, d'autant plus que certaines d'entre elles sont devenues iconiques, e… [+3644 chars]"}, {"source": {"id": null, "name": "Linternaute.com"}, "author": "Mathilde Ledroit", "title": "Remdesivir et coronavirus : un usage peu efficace, voire dangereux ? - Linternaute.com", "description": "Dans la lutte contre le Covid-19, le Remdesivir a été cité parmi les traitements potentiels. Pourtant, des essais cliniques démontrent des effets secondaires importants, qui peuvent s'avérer dangereux.", "url": "https://www.linternaute.com/actualite/guide-vie-quotidienne/2491649-remdesivir-et-kaletra-des-remedes-au-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-24T12:49:16Z", "content": "Dans la lutte contre le Covid-19, le Remdesivir a été cité parmi les traitements potentiels. Pourtant, des essais cliniques démontrent des effets secondaires importants, qui peuvent s'avérer dangereux. \r\n[Mis à jours le 24 avril 2020 à 14h45] Cela fait plusie… [+5860 chars]"}, {"source": {"id": null, "name": "Courrierinternational.com"}, "author": null, "title": "Il y aurait dix-neuf objets interstellaires errant dans le Système solaire - Courrier International", "description": "Oumuamua et Borisov ne seraient pas les seuls voyageurs venus d’autres systèmes solaires à naviguer à proximité de notre étoile.", "url": "https://www.courrierinternational.com/article/astronomie-il-y-aurait-dix-neuf-objets-interstellaires-errant-dans-le-systeme-solaire", "urlToImage": null, "publishedAt": "2020-04-24T11:52:20Z", "content": "Oumuamua et Borisov ne seraient pas les seuls voyageurs venus dautres systèmes solaires à naviguer à proximité de notre étoile.Deux chercheurs assurent avoir mis en évidence la présence de 19 objets en orbite autour du Soleil, alors quils sont originaires dau… [+1605 chars]"}, {"source": {"id": null, "name": "Sciencesetavenir.fr"}, "author": "Lise Loumé", "title": "Question de la semaine : la planète Mars sera-t-elle un jour habitable comme la Terre ? - Sciences et Avenir", "description": "\"La planète Mars sera-t-elle un jour habitable comme la Terre ?\", nous demande un lecteur. L'idée selon laquelle les technologies pourraient permettre de transformer cette planète désertique pour la rendre semblable à la Terre, concept appelé \"terraformation\"…", "url": "https://www.sciencesetavenir.fr/espace/planetes/question-de-la-semaine-la-planete-mars-sera-t-elle-un-jour-habitable-comme-la-terre_143696", "urlToImage": null, "publishedAt": "2020-04-24T11:20:47Z", "content": "\"La planète Mars sera-t-elle un jour habitable comme la Terre ?\", nous demande Diassy Camara sur notre page Facebook.  Chaque semaine, sur la page de Sciences et Avenir, nous sélectionnons une question de lecteur pour lui apporter une réponse. Merci pour votr… [+3734 chars]"}, {"source": {"id": null, "name": "Numerama.com"}, "author": "Nelly Lesage", "title": "Les débris spatiaux sont un fléau : les USA adoptent de nouvelles règles pour les limiter - Numerama", "description": "La Commission fédérale des communications a mis à jour ses règles portant sur les débris spatiaux. Les entreprises qui opèrent des satellites en orbite autour de la Terre devront se plier à de nouvelles exigences.", "url": "https://www.numerama.com/sciences/620266-les-debris-spatiaux-sont-un-fleau-les-usa-adoptent-de-nouvelles-regles-pour-les-limiter.html", "urlToImage": null, "publishedAt": "2020-04-24T10:03:17Z", "content": "La Commission fédérale des communications a mis à jour ses règles portant sur les débris spatiaux. Les entreprises qui opèrent des satellites en orbite autour de la Terre devront se plier à de nouvelles exigences.\r\nIls représentent à la fois des risques en or… [+3804 chars]"}, {"source": {"id": null, "name": "Techno-science.net"}, "author": "Adrien", "title": "Vers une spintronique consommant 1000 fois moins d'énergie ? - Techno-Science.net", "description": "📰 Le spin de l'électron - propriété quantique par excellence - est au coeur de la spintronique, une technologie ayant révolutionné le stockage numérique et qui pourrait jouer...", "url": "https://www.techno-science.net/actualite/vers-spintronique-consommant-1000-fois-moins-energie-N19522.html", "urlToImage": null, "publishedAt": "2020-04-24T07:21:42Z", "content": "Le spin de l'électron - propriété quantique par excellence - est au coeur de la spintronique, une technologie ayant révolutionné le stockage numérique et qui pourrait jouer un rôle majeur dans la réalisation de nouveaux processeurs informatiques. Pour générer… [+4258 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": "Edouard Bard", "title": "Edouard Bard : « La pandémie de Covid-19 préfigure en accéléré la propagation du réchauffement climatique » - Le Monde", "description": "Face aux épidémies et aux désordres environnementaux, on constate les mêmes réactions individuelles et collectives, pointe, dans une tribune au « Monde », le climatologue, qui voit dans cette crise une « répétition générale ».", "url": "https://www.lemonde.fr/idees/article/2020/04/24/edouard-bard-la-pandemie-de-covid-19-prefigure-en-accelere-la-propagation-du-rechauffement-climatique_6037582_3232.html", "urlToImage": null, "publishedAt": "2020-04-23T23:35:12Z", "content": "CONC\r\nLa pandémie de Covid-19 nest sans doute pas dorigine climatique, même si nous navons pas encore de certitude sur les éventuels changements environnementaux qui auraient pu rapprocher les populations des animaux hôtes (chauve-souris et pangolin) de lhomm… [+2759 chars]"}, {"source": {"id": null, "name": "Lepoint.fr"}, "author": "Le Point.fr", "title": "La Nasa dévoile une cartographie inédite de la Lune - Le Point", "description": "C'est la première fois que la totalité de la surface de l'astre est cartographiée avec autant de précision et de détails, relate Numerama.", "url": "https://www.lepoint.fr/astronomie/la-nasa-devoile-une-cartographie-inedite-de-la-lune-24-04-2020-2372686_1925.php", "urlToImage": null, "publishedAt": "2020-04-23T23:34:00Z", "content": "« Cette carte est l'aboutissement d'un projet de plusieurs décennies. » Interrogé sur le site de l'Institut d'études géologiques des États-Unis (USGS), Corey Fortezzo affiche sa fierté. Ce géologue est l'auteur principal de l'« Unified Geologic Map of the Moo… [+2131 chars]"}, {"source": {"id": null, "name": "Realites.com.tn"}, "author": "la Rédaction", "title": "Didier Raoult prévoit la fin de la pandémie \"d'ici un mois\" : voici les raisons exactes de son hypothèse - Réalités", "description": "Le directeur de l'IHU Méditerranée, déjà très affirmatif sur le nécessaire recours à la chloroquine en guise de traitement au Covid-19, fait une nouvelle prédiction très optimiste.A sa grande expérience des maladies infectieuses s'associe des prédict", "url": "https://www.realites.com.tn/2020/04/didier-raoult-prevoit-la-fin-de-la-pandemie-dici-un-mois-voici-les-raisons-exactes-de-son-hypothese/", "urlToImage": null, "publishedAt": "2020-04-23T21:05:00Z", "content": null}, {"source": {"id": null, "name": "Futura-sciences.com"}, "author": "Julie Kern", "title": "Coronavirus : les tests sérologiques sont-ils fiables ? - Futura", "description": "Les tests sérologiques, qui permettent de détecter les anticorps créés à la suite d'une infection par le coronavirus, sont encore en développement. Nombre d'entre eux ne remplissent pas le cahier...", "url": "https://www.futura-sciences.com/sante/actualites/coronavirus-coronavirus-tests-serologiques-sont-ils-fiables-80667/", "urlToImage": null, "publishedAt": "2020-04-23T14:31:58Z", "content": "Les tests sérologiques, qui permettent de détecter les anticorps créés à la suite d'une infection par le coronavirus, sont encore en développement. Nombre d'entre eux ne remplissent pas le cahier des charges pour leur homologation. Leur fiabilité, notamment, … [+3070 chars]"}]}