{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "SpaceX is already preparing for operational astronaut missions - India Gone Viral", "description": "While the world’s attention is focused on the return of orbital human spaceflight from US soil after a nearly decade long absence with the upcoming May 27th Crew Dragon Demo-2 mission, SpaceX is simul", "url": "https://indiagoneviral.com/science/2020/04/27/spacex-is-already-preparing-for-operational-astronaut-missions/43431/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-27T02:00:56Z", "content": "While the worlds attention is focused on the return of orbital human spaceflight from US soil after a nearly decade long absence with the upcoming May 27th Crew Dragon Demo-2 mission, SpaceX is simultaneously preparing for the first Crew Dragon operational mi… [+4182 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Katie Gibbons", "title": "New reason to stay in as asteroid 1998 OR2 races towards Earth - The Times", "description": "Brace yourselves. Just when you thought life under lockdown couldn’t be any more challenging, a visitor from far away is about to get a little too close for comfort.New photographs show that a", "url": "https://www.thetimes.co.uk/article/new-reason-to-stay-in-as-or2-asteroid-races-towards-earth-mmhfknm3t", "urlToImage": null, "publishedAt": "2020-04-26T23:01:00Z", "content": "Brace yourselves. Just when you thought life under lockdown couldnt be any more challenging, a visitor from far away is about to get a little too close for comfort.\r\nNew photographs show that a 1.2-mile-wide asteroid is heading towards Earth.\r\nThe giant rock,… [+485 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Shari Miller For Mailonline", "title": "First ever proof of meteorite killing a man uncovered in 1888 report to Ottoman sultan - Daily Mail", "description": "Documents show Ottoman Sultan Abdul Hamid II (left), was informed of a meteorite that killed one man and paralysed another after landing in Sulaymaniyah, Iraq, on August 22, 1888.", "url": "https://www.dailymail.co.uk/news/article-8258631/First-proof-meteorite-killing-man-uncovered-1888-report-Ottoman-sultan.html", "urlToImage": null, "publishedAt": "2020-04-26T19:40:56Z", "content": "The first ever proof of a person being struck and killed by a meteorite might just have been discovered.\r\nResearchers at the Meteoritical Society have found evidence of a meteorite that killed one man and left another paralysed after it fell 'like rain' on a … [+2605 chars]"}, {"source": {"id": null, "name": "Leicestermercury.co.uk"}, "author": "Maia Snow, Ian Hughes, Laura Hartley", "title": "Live updates as SpaceX Starlink satellites pass through night skies over Leicestershire twice - Leicestershire Live", "description": "Here's what to expect tonight", "url": "https://www.leicestermercury.co.uk/news/local-news/live-updates-spacex-starlink-satellites-4080075", "urlToImage": null, "publishedAt": "2020-04-26T17:01:43Z", "content": "All week, Elon Musk's Starlink satellites have been causing a stir across the county as they have been seen shooting across the sky.\r\nThere are another two chances to see them tonight (April 26), so get wrapped up warm and head into the garden to see the ligh… [+541 chars]"}, {"source": {"id": null, "name": "Nottinghampost.com"}, "author": "Joseph Locker", "title": "Your best pictures of the Starlink satellites, Venus and the night sky in Nottinghamshire - Nottinghamshire Live", "description": "Reduced pollution and much less air traffic has resulted in clearer skies", "url": "https://www.nottinghampost.com/news/local-news/your-best-pictures-starlink-satellites-4078868", "urlToImage": null, "publishedAt": "2020-04-26T05:09:00Z", "content": "These pictures show some of the remarkable astronomical sights that residents across Nottinghamshire have spotted in the past week.\r\nSince the UK was placed into lockdown amid the coronavirus pandemic on March 23, the sky has become clearer as a result of red… [+4316 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Callum Hoare", "title": "'Universe is unstable!' How Brian Cox revealed world could end 'at any moment' - Express.co.uk", "description": "THE END OF THE WORLD could happen 'at any moment' according to the chilling claims of a scientist, after Brian Cox revealed why the 'universe is unstable'.", "url": "https://www.express.co.uk/news/science/1273858/end-of-the-world-brian-cox-universe-unstable-vacuum-decay-space-news-spt", "urlToImage": null, "publishedAt": "2020-04-25T17:54:00Z", "content": null}, {"source": {"id": null, "name": "Heritagedaily.com"}, "author": "http://www.facebook.com/archaeologynews", "title": "Hubble celebrates its 30th anniversary with a tapestry of blazing starbirth - HeritageDaily - Archaeology News - HeritageDaily", "description": "Hubble Space Telescope's iconic images and scientific breakthroughs have redefined our view of the Universe. - Space & Planetary HeritageDaily - Archaeology News", "url": "https://www.heritagedaily.com/2020/04/hubble-celebrates-its-30th-anniversary-with-a-tapestry-of-blazing-starbirth/127932", "urlToImage": null, "publishedAt": "2020-04-25T15:49:09Z", "content": "Hubble Space Telescope’s iconic images and scientific breakthroughs have redefined our view of the Universe.\r\nTo commemorate three decades of scientific discoveries, this image is one of the most photogenic examples of the many turbulent stellar nurseries the… [+5184 chars]"}, {"source": {"id": null, "name": "Heritagedaily.com"}, "author": "http://www.facebook.com/archaeologynews", "title": "Paleontologists reveal 'the most dangerous place in the history of planet Earth' - HeritageDaily", "description": "100 million years ago, ferocious predators, including flying reptiles and crocodile-like hunters, made the Sahara the most dangerous place on Earth. - Palaeontology HeritageDaily - Archaeology News", "url": "https://www.heritagedaily.com/2020/04/paleontologists-reveal-the-most-dangerous-place-in-the-history-of-planet-earth/127935", "urlToImage": null, "publishedAt": "2020-04-25T15:49:09Z", "content": "100 million years ago, ferocious predators, including flying reptiles and crocodile-like hunters, made the Sahara the most dangerous place on Earth.\r\nThis is according to an international team of scientists, who have published the biggest review in almost 100… [+2851 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Colin Drury", "title": "Coronavirus: Nasa develops ventilator tailored for Covid-19 patients in just 37 days - The Independent", "description": "'We know how to land on the moon and Mars, but building a medical device is new'", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-nasa-ventilators-vital-design-a9484036.html", "urlToImage": null, "publishedAt": "2020-04-25T15:36:59Z", "content": "Engineers at NASA have developed a ventilator specifically designed to help coronavirus patients.\r\nThe VITAL system Ventilator Intervention Technology Accessible Locally was created in just 37 days, the space agency says.\r\nNow, it has already passed critical … [+21785 chars]"}, {"source": {"id": null, "name": "Sciencefocus.com"}, "author": "James Lloyd", "title": "Origins of human language stretch back 25 million years - sciencefocus.com", "description": "The human brain's language pathway was previously thought to have evolved only 5 million years ago.", "url": "https://www.sciencefocus.com/news/origins-of-human-language-stretch-back-25-million-years/", "urlToImage": null, "publishedAt": "2020-04-25T07:00:00Z", "content": "The roots of human language have been traced back 25 million years 20 million years earlier than the previous estimate.\r\nThe discovery was made by researchers in the UK, USA and Germany by studying a connection in the brain called the arcuate fasciculus or hu… [+2518 chars]"}]}