{"status": "ok", "totalResults": 24, "articles": [{"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Phil Norris, Grace Witherden", "title": "Chance to see Elon Musk’s Starlink satellites in sky later – but you won’t have long - Mirror Online", "description": "Stargazers will have about six minutes to spot Elon Musk’s Starlink satellites tonight with people based in the north more likely to get a good view - here is what time to see it from UK", "url": "https://www.mirror.co.uk/news/uk-news/chance-see-elon-musks-starlink-21926715", "urlToImage": null, "publishedAt": "2020-04-25T18:31:38Z", "content": "Stargazers will get the chance to view Elon Musks Starlink satellites tonight as they pass over the UK but you wont have long to see them.\r\nSpaceX has been launching large batches of satellites as part of its Starlink project to improve global internet covera… [+1860 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Callum Hoare", "title": "'Universe is unstable!' How Brian Cox revealed world could end 'at any moment' - Express.co.uk", "description": "THE END OF THE WORLD could happen 'at any moment' according to the chilling claims of a scientist, after Brian Cox revealed why the 'universe is unstable'.", "url": "https://www.express.co.uk/news/science/1273858/end-of-the-world-brian-cox-universe-unstable-vacuum-decay-space-news-spt", "urlToImage": null, "publishedAt": "2020-04-25T17:54:00Z", "content": null}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "The Conversation", "title": "Chemical recycling could be the solution to plastic pollution - The Next Web", "description": "The world is drowning in plastic. About 60% of the more than 8,700 million metric tonnes of plastic ever made is no longer in use, instead sat mostly in landfill or released to the ...", "url": "https://thenextweb.com/syndication/2020/04/25/chemical-recycling-could-be-the-solution-to-plastic-pollution/", "urlToImage": null, "publishedAt": "2020-04-25T17:20:31Z", "content": "The world is drowning in plastic. About 60% of the more than 8,700 million metric tonnes of plastic ever made is no longer in use, instead sat mostly in landfill or released to the environment. That equals over 400kg of plastic waste for every one of the 7.6 … [+5031 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Colin Drury", "title": "Coronavirus: Nasa develops ventilator tailored for Covid-19 patients in just 37 days - The Independent", "description": "'We know how to land on the moon and Mars, but building a medical device is new'", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-nasa-ventilators-vital-design-a9484036.html", "urlToImage": null, "publishedAt": "2020-04-25T15:36:59Z", "content": "Engineers at NASA have developed a ventilator specifically designed to help coronavirus patients.\r\nThe VITAL system Ventilator Intervention Technology Accessible Locally was created in just 37 days, the space agency says.\r\nNow, it has already passed critical … [+21785 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Meghan Bartels", "title": "That's the way the comet crumbles: Hubble image shows remains of Comet ATLAS - Space.com", "description": "", "url": "https://www.space.com/hubble-image-comet-atlas-broken-up.html", "urlToImage": null, "publishedAt": "2020-04-25T12:08:00Z", "content": "Skywatchers had high hopes that a comet called ATLAS would light up the night sky this spring, with forecasts suggesting it could become bright enough to see with the unaided eye.\r\nInstead, the icy object crumbled to pieces but it's still putting on a spectac… [+2755 chars]"}, {"source": {"id": null, "name": "Sciencefocus.com"}, "author": "James Lloyd", "title": "Origins of human language stretch back 25 million years - sciencefocus.com", "description": "The human brain's language pathway was previously thought to have evolved only 5 million years ago.", "url": "https://www.sciencefocus.com/news/origins-of-human-language-stretch-back-25-million-years/", "urlToImage": null, "publishedAt": "2020-04-25T07:00:00Z", "content": "The roots of human language have been traced back 25 million years 20 million years earlier than the previous estimate.\r\nThe discovery was made by researchers in the UK, USA and Germany by studying a connection in the brain called the arcuate fasciculus or hu… [+2518 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Gursimran Hans", "title": "Trump’s new US Space Force to deploy surveillance telescope in Australia - Express.co.uk", "description": "THE US plans to construct a specialist space surveillance telescope at a facility in Western Australia.", "url": "https://www.express.co.uk/news/science/1273676/Space-news-USA-Australia-telescope-spy-track-debris-satellites", "urlToImage": null, "publishedAt": "2020-04-25T03:21:00Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Michael Thomsen For Dailymail.com", "title": "Time passes faster at the top of skyscrapers according to new study - Daily Mail", "description": "A new study from the University of Tokyo has shown that time actually passes at a different speed at the top of skyscrapers and other tall buildings, at a rate of four nanoseconds more quickly.", "url": "https://www.dailymail.co.uk/sciencetech/article-8254271/Time-passes-faster-skyscrapers-according-new-study.html", "urlToImage": null, "publishedAt": "2020-04-24T22:22:17Z", "content": "A new study from the University of Tokyo has shown that time actually passes at a different speed at the top of skyscrapers and other tall buildings.\r\nA team, led by quantum electronics professor Hidetoshi Katori, climbed to the top of the Tokyo Skytree, the … [+4009 chars]"}, {"source": {"id": null, "name": "Ancient-origins.net"}, "author": "ashley cowie", "title": "Historic Archive Tells Dark Story Of Death By Meteorite - Ancient Origins", "description": "Researchers have unearthed the only historically documented case of people being struck by a meteorite.", "url": "https://www.ancient-origins.net/news-history-archaeology/meteorite-death-0013614", "urlToImage": null, "publishedAt": "2020-04-24T22:03:00Z", "content": "Researchers have unearthed the only historically documented case of people being struck by a meteorite. \r\nTales of meteorites falling to Earth are carved on prehistoric stones and featured in the Bible, for example, in Revelation 6:13 , when we read the stars… [+4715 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Luke Hurst", "title": "Hubble at 30: Take a look back at some of the telescope's best images - Euronews", "description": "The Hubble Space Telescope turned 30 on Friday, and to mark the occasion Hubble released a fittingly awesome image.", "url": "https://www.euronews.com/2020/04/24/hubble-turns-30-take-a-look-back-at-some-of-the-space-telescope-s-best-images", "urlToImage": null, "publishedAt": "2020-04-24T21:06:33Z", "content": "The Hubble Space Telescope turned 30 on Friday, and to mark the occasion Hubble released a fittingly awesome image. \r\nShowing two nebulas, NGC 2020 and NGC 2014, some 163,000 light years from Earth, the image reveals part of a vast star-forming region in the … [+1048 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX on target for milestone May 27 crew launch, safety panel says - Space.com", "description": "But Boeing has some work to do before its capsule is ready to fly people.", "url": "https://www.space.com/spacex-demo-2-nasa-safety-advisory-panel.html", "urlToImage": null, "publishedAt": "2020-04-24T19:06:56Z", "content": "SpaceX\r\n remains on track to launch astronauts next month despite a few remaining issues, members of a NASA advisory panel said Thursday (April 23).\r\nElon Musk's company and NASA are working toward a May 27 launch date for Demo-2\r\n, which will send agency ast… [+4194 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Star somehow survives close encounter with BLACK HOLE, but faces a TRILLION YEARS on death row - RT", "description": "An extremely rare close call between a red giant star and a black hole has been captured by powerful NASA and ESA tech, revealing a key chapter in a cosmic saga that will likely continue for a trillion years.", "url": "https://www.rt.com/news/486801-star-survives-encounter-black-hole/", "urlToImage": null, "publishedAt": "2020-04-24T18:19:54Z", "content": "The fatal celestial event is unfolding in the galaxy GSN 069 – about 250 million light years away from Earth. The black hole in question is roughly 400,000 times the mass of the sun, making it small by supermassive black hole standards, but still terrifying i… [+2539 chars]"}, {"source": {"id": null, "name": "Inews.co.uk"}, "author": "Alex Nelson", "title": "Lyrid meteor shower 2020: here's how to watch the Lyrids in the UK tonight, and when the meteors peak - inews", "description": "The ancient Chinese are said to have watched Lyrid meteors falling 'like rain' in the year 687 BC", "url": "https://inews.co.uk/news/science/lyrid-meteor-shower-2020-uk-tonight-how-watch-when-lyrids-peak-time-2543707", "urlToImage": null, "publishedAt": "2020-04-24T16:50:00Z", "content": "The ancient Chinese are said to have watched Lyrid meteors falling 'like rain' in the year 687 BC\r\nFriday, 24th April 2020, 5:48 pm\r\nUpdated Friday, 24th April 2020, 5:50 pm\r\nMembers of the York Astronomical Society prepare to view a meteor shower in 2015 (Ph… [+3239 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Harry Pettit", "title": "Starlink satellites tracker UK: Where are Elon Musk’s SpaceX satellites right now? - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11452340/starlink-satellites-tracker-uk/", "urlToImage": null, "publishedAt": "2020-04-24T15:21:07Z", "content": "STARGAZERS have another chance to witness a swarm fo satellites passing over Britain this evening.\r\nThe \"Starink\" satellites are operated by SpaceX, a company that hopes to one day beam Wi-Fi to people from space - and we've got all the tips you need to spot … [+8624 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Ian Randall For Mailonline", "title": "Scientists reveal ferocious predators roamed Africa's SAHARA 100 million years ago - Daily Mail", "description": "A team of international researchers found that what is today the Sahara region was home to 'ferocious predators' around 100 million years ago.", "url": "https://www.dailymail.co.uk/sciencetech/article-8253453/Africa-s-Sahara-dangerous-place-Earth-100-million-years-ago.html", "urlToImage": null, "publishedAt": "2020-04-24T15:02:29Z", "content": "Africa's Sahara may have been 'the most dangerous place in the history of planet Earth', a palaeontological study has concluded.\r\nA team of international researchers found that what is today the famous desert region was home to 'ferocious predators' around 10… [+2382 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jonathan Chadwick For Mailonline", "title": "Tropical coral reefs are being transformed by climate change - Daily Mail", "description": "Climate change and warming seas are severely bleaching tropical coral reefs and undoing decades of knowledge about how to protect these delicate and vital ecosystems.", "url": "https://www.dailymail.co.uk/sciencetech/article-8253723/Tropical-coral-reefs-transformed-climate-change.html", "urlToImage": null, "publishedAt": "2020-04-24T14:50:45Z", "content": "Coral reefs are so fundamentally damaged by climate change that decades of research on how to protect them may not even still be applicable, scientists say.  \r\nIn a study of coral over 20 years, UK scientists found that a warming climate undoes decades of kno… [+6834 chars]"}, {"source": {"id": null, "name": "Theregister.co.uk"}, "author": "Katyanna Quach", "title": "Nineteen mysterious invaders from another Solar System spotted hanging around the outside edge of ours - The Register", "description": "Plus astroboffins confirm 'masked' asteroid heading Earthwards", "url": "https://www.theregister.co.uk/2020/04/24/oddball_asteroids_orbiting/", "urlToImage": null, "publishedAt": "2020-04-24T12:05:00Z", "content": "Astronomers have discovered a new population of foreign asteroids that have been quietly orbiting the Sun on the outskirts of our Solar System.\r\nThese 19 space rocks have been right under our noses the entire time, almost since the Solar System formed some 4.… [+3395 chars]"}, {"source": {"id": null, "name": "Heritagedaily.com"}, "author": "http://www.facebook.com/archaeologynews", "title": "Researchers monitor near-Earth asteroid - HeritageDaily", "description": "The Arecibo Observatory in Puerto Rico is following an asteroid approaching Earth this week and while it poses no threat, it appears to know our planet is facing a pandemic. - Space & Planetary HeritageDaily - Archaeology News", "url": "https://www.heritagedaily.com/2020/04/researchers-monitor-near-earth-asteroid/127878", "urlToImage": null, "publishedAt": "2020-04-24T12:01:47Z", "content": "The Arecibo Observatory in Puerto Rico is following an asteroid approaching Earth this week and while it poses no threat, it appears to know our planet is facing a pandemic.\r\n“The small-scale topographic features such as hills and ridges on one end of asteroi… [+3292 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "China to ask ‘Questions to Heaven’ with country’s 1st mission to Mars later this year - RT", "description": "China’s space agency has announced the title for the country’s inaugural mission to Mars. Tianwen-1, which translates roughly to “Questions to Heaven,” is expected to set off for Mars later in 2020.", "url": "https://www.rt.com/news/486734-questions-heaven-china-mars-mission/", "urlToImage": null, "publishedAt": "2020-04-24T08:37:37Z", "content": "The mission is to launch a Mars probe at some point later in 2020 while hoping for the trifecta of interplanetary exploration: orbiting, landing and roving all in a single mission. \r\nThe China National Space Administration (CNSA) used the country’s annual Spa… [+1525 chars]"}, {"source": {"id": null, "name": "Ladbible.com"}, "author": "Tom Wood", "title": "Bioluminescent Plankton Turns Waves Blue Near Beach In Mexico - LADbible", "description": "It's the first time this phenomenon has been observed on this beach in 60 years", "url": "https://www.ladbible.com/news/animals-bio-luminescent-plankton-turns-waves-blue-near-beach-in-mexico-20200424", "urlToImage": null, "publishedAt": "2020-04-24T08:36:51Z", "content": "A handful of people walking along a beach in Mexico were treated to a rare and impressive show when the waters of the sea turned fluorescent blue for the first time in 60 years.\r\nThis strange glow is the work of bioluminescentplankton hanging about near to th… [+2125 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Mike McRae", "title": "We All Have Neanderthal DNA, But It May Not Account For Looks After All - ScienceAlert", "description": "Thanks to advances in DNA technology, we now know we're all a little bit Neanderthal. Just how their genes continue to affect us has become a topic of wild speculation, with anything from red hair to sleeping habits a potential legacy left by our ext", "url": "https://www.sciencealert.com/neanderthal-dna-in-your-family-tree-probably-isn-t-responsible-for-your-looks-after-all", "urlToImage": null, "publishedAt": "2020-04-24T07:36:48Z", "content": "Thanks to advances in DNA technology, we now know we're all a little bit Neanderthal. Just how their genes continue to affect us has become a topic of wild speculation, with anything from red hair to sleeping habits a potential legacy left by our extinct cous… [+4243 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "BBC News", "title": "Coronavirus: Body 'in industrial fridge for six days' - bbc.com", "description": "Nazir Afzal says there was a \"300 body backlog\" on the day of his brother Umar's death from Covid-19.", "url": "https://www.bbc.com/news/uk-england-birmingham-52368827", "urlToImage": null, "publishedAt": "2020-04-24T06:07:00Z", "content": "We use cookies to give you the best online experience. Please let us know if you agree to all of these cookies.\r\nImage copyright\r\n Family photo\r\nImage caption\r\n Umar Afzal was a Home Office interpreter and spoke \"half a dozen languages\"\r\nA former chief prosec… [+2149 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Callum Hoare", "title": "Antarctica shock: NASA satellite exposes ‘uncharted island' near South Pole - Express.co.uk", "description": "ANTARCTICA scientists spotted an 'uncharted island' earlier this year, but a NASA satellite has been tracking it since 2014, the United States Geological Survey (USGS) revealed.", "url": "https://www.express.co.uk/news/science/1273004/antarctica-nasa-landsat-sif-island-thor-south-pole-climate-change-global-warming-spt", "urlToImage": null, "publishedAt": "2020-04-24T06:03:00Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Sean Martin", "title": "Italy volcano eruption: Mount Etna explodes - spews huge ash column 5km into air - Express.co.uk", "description": "ITALY'S fearsome Mount Etna has burst into life, spewing volcanic debris up to five kilometres into the atmosphere.", "url": "https://www.express.co.uk/news/science/1271774/Italy-volcano-eruption-Mount-Etna-erupts-today-ash-cloud-pictures", "urlToImage": null, "publishedAt": "2020-04-21T10:09:00Z", "content": null}]}