{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "Express.co.uk"}, "author": "Joel Day", "title": "Richard Dawkins confession: How scientist pinpointed ‘impossible’ universe questions - Express.co.uk", "description": "RICHARD DAWKINS claimed that religion would never answer the questions science cannot, leaving the matter of the universe's creation potentially unanswerable.", "url": "https://www.express.co.uk/news/science/1273420/richard-dawkins-science-news-universe-creator-God-religion-spt", "urlToImage": null, "publishedAt": "2020-04-26T08:00:00Z", "content": null}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Karen Price", "title": "Starlink satellites: It's your last chance to see them tonight and here's how - Wales Online", "description": "Many Brits have spotted them flash across the sky already this week", "url": "https://www.walesonline.co.uk/whats-on/whats-on-news/starlink-satellites-its-your-last-18150766", "urlToImage": null, "publishedAt": "2020-04-26T05:11:25Z", "content": "They've been causing something of a sensation this week and now it's your last chance tonight to see the Starlink satellites.\r\n The lightshows across the skies are not UFOs, but  lights coming from satellites  powered by Elon Musk's Starlink fleet. \r\n Many Br… [+1518 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Peter Stubley", "title": "First credible evidence emerges of person being killed by meteor - The Independent", "description": "Researchers find official records documenting fatal strike in Iraq in 1888", "url": "https://www.independent.co.uk/news/science/meteor-man-death-first-person-killed-iraq-turkey-ottoman-empire-a9484231.html", "urlToImage": null, "publishedAt": "2020-04-25T20:00:42Z", "content": "The odds of being struck and killed by a meteorite are said to be as low as one in 250,000.\r\nThere has been no credible and well-documented evidence of any human being befalling this unfortunate fate.\r\nBut researchers now say they have found three separate of… [+16481 chars]"}, {"source": {"id": null, "name": "Heritagedaily.com"}, "author": "http://www.facebook.com/archaeologynews", "title": "Hubble celebrates its 30th anniversary with a tapestry of blazing starbirth - HeritageDaily - Archaeology News - HeritageDaily", "description": "Hubble Space Telescope's iconic images and scientific breakthroughs have redefined our view of the Universe. - Space & Planetary HeritageDaily - Archaeology News", "url": "https://www.heritagedaily.com/2020/04/hubble-celebrates-its-30th-anniversary-with-a-tapestry-of-blazing-starbirth/127932", "urlToImage": null, "publishedAt": "2020-04-25T15:49:09Z", "content": "Hubble Space Telescope’s iconic images and scientific breakthroughs have redefined our view of the Universe.\r\nTo commemorate three decades of scientific discoveries, this image is one of the most photogenic examples of the many turbulent stellar nurseries the… [+5184 chars]"}, {"source": {"id": null, "name": "Heritagedaily.com"}, "author": "http://www.facebook.com/archaeologynews", "title": "Paleontologists reveal 'the most dangerous place in the history of planet Earth' - HeritageDaily", "description": "100 million years ago, ferocious predators, including flying reptiles and crocodile-like hunters, made the Sahara the most dangerous place on Earth. - Palaeontology HeritageDaily - Archaeology News", "url": "https://www.heritagedaily.com/2020/04/paleontologists-reveal-the-most-dangerous-place-in-the-history-of-planet-earth/127935", "urlToImage": null, "publishedAt": "2020-04-25T15:49:09Z", "content": "100 million years ago, ferocious predators, including flying reptiles and crocodile-like hunters, made the Sahara the most dangerous place on Earth.\r\nThis is according to an international team of scientists, who have published the biggest review in almost 100… [+2851 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Colin Drury", "title": "Coronavirus: Nasa develops ventilator tailored for Covid-19 patients in just 37 days - The Independent", "description": "'We know how to land on the moon and Mars, but building a medical device is new'", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-nasa-ventilators-vital-design-a9484036.html", "urlToImage": null, "publishedAt": "2020-04-25T15:36:59Z", "content": "Engineers at NASA have developed a ventilator specifically designed to help coronavirus patients.\r\nThe VITAL system Ventilator Intervention Technology Accessible Locally was created in just 37 days, the space agency says.\r\nNow, it has already passed critical … [+21785 chars]"}, {"source": {"id": null, "name": "Sciencefocus.com"}, "author": "James Lloyd", "title": "Origins of human language stretch back 25 million years - sciencefocus.com", "description": "The human brain's language pathway was previously thought to have evolved only 5 million years ago.", "url": "https://www.sciencefocus.com/news/origins-of-human-language-stretch-back-25-million-years/", "urlToImage": null, "publishedAt": "2020-04-25T07:00:00Z", "content": "The roots of human language have been traced back 25 million years 20 million years earlier than the previous estimate.\r\nThe discovery was made by researchers in the UK, USA and Germany by studying a connection in the brain called the arcuate fasciculus or hu… [+2518 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Gursimran Hans", "title": "Trump’s new US Space Force to deploy surveillance telescope in Australia - Express.co.uk", "description": "THE US plans to construct a specialist space surveillance telescope at a facility in Western Australia.", "url": "https://www.express.co.uk/news/science/1273676/Space-news-USA-Australia-telescope-spy-track-debris-satellites", "urlToImage": null, "publishedAt": "2020-04-25T03:21:00Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Michael Thomsen For Dailymail.com", "title": "Time passes faster at the top of skyscrapers according to new study - Daily Mail", "description": "A new study from the University of Tokyo has shown that time actually passes at a different speed at the top of skyscrapers and other tall buildings, at a rate of four nanoseconds more quickly.", "url": "https://www.dailymail.co.uk/sciencetech/article-8254271/Time-passes-faster-skyscrapers-according-new-study.html", "urlToImage": null, "publishedAt": "2020-04-24T22:22:17Z", "content": "A new study from the University of Tokyo has shown that time actually passes at a different speed at the top of skyscrapers and other tall buildings.\r\nA team, led by quantum electronics professor Hidetoshi Katori, climbed to the top of the Tokyo Skytree, the … [+4009 chars]"}, {"source": {"id": null, "name": "Ancient-origins.net"}, "author": "ashley cowie", "title": "Historic Archive Tells Dark Story Of Death By Meteorite - Ancient Origins", "description": "Researchers have unearthed the only historically documented case of people being struck by a meteorite.", "url": "https://www.ancient-origins.net/news-history-archaeology/meteorite-death-0013614", "urlToImage": null, "publishedAt": "2020-04-24T22:03:00Z", "content": "Researchers have unearthed the only historically documented case of people being struck by a meteorite. \r\nTales of meteorites falling to Earth are carved on prehistoric stones and featured in the Bible, for example, in Revelation 6:13 , when we read the stars… [+4715 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Charles Q. Choi", "title": "Mystery of Venus atmosphere's weird rotation may finally be solved - Space.com", "description": "Thermal tides in the atmosphere make it rotate faster than the planet's surface, a new study finds.", "url": "https://www.space.com/venus-atmosphere-super-rotation-mystery-solved.html", "urlToImage": null, "publishedAt": "2020-04-24T21:59:00Z", "content": "The mystery behind why the atmosphere of Venus spins much faster than the planet's surface may finally be solved, a new study finds.\r\nThe finding might help shed light on how habitable distant exoplanets, or worlds beyond our solar system, may actually be, re… [+3613 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX on target for milestone May 27 crew launch, safety panel says - Space.com", "description": "But Boeing has some work to do before its capsule is ready to fly people.", "url": "https://www.space.com/spacex-demo-2-nasa-safety-advisory-panel.html", "urlToImage": null, "publishedAt": "2020-04-24T19:06:56Z", "content": "SpaceX\r\n remains on track to launch astronauts next month despite a few remaining issues, members of a NASA advisory panel said Thursday (April 23).\r\nElon Musk's company and NASA are working toward a May 27 launch date for Demo-2\r\n, which will send agency ast… [+4194 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Charlotte Edwards", "title": "‘Most dangerous place in the history of planet Earth’ is in MOROCCO – where killer dinos roamed 100million yea - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11472499/most-dangerous-place-in-history-morocco/", "urlToImage": null, "publishedAt": "2020-04-24T18:45:59Z", "content": "EXPERTS claim to have discovered \"the most dangerous place in the history of planet Earth\".\r\nTheir study into ancient fossils provides an insight into Africa's age of dinosaurs.\r\nThis is an artistic impression of what the deadly place would have looked likeCr… [+4326 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Star somehow survives close encounter with BLACK HOLE, but faces a TRILLION YEARS on death row - RT", "description": "An extremely rare close call between a red giant star and a black hole has been captured by powerful NASA and ESA tech, revealing a key chapter in a cosmic saga that will likely continue for a trillion years.", "url": "https://www.rt.com/news/486801-star-survives-encounter-black-hole/", "urlToImage": null, "publishedAt": "2020-04-24T18:19:54Z", "content": "The fatal celestial event is unfolding in the galaxy GSN 069 – about 250 million light years away from Earth. The black hole in question is roughly 400,000 times the mass of the sun, making it small by supermassive black hole standards, but still terrifying i… [+2539 chars]"}, {"source": {"id": null, "name": "Inews.co.uk"}, "author": "Claire Schofield", "title": "Starlink satellites tracker: how to watch Elon Musk's SpaceX satellites in the UK tonight, and what you're looking out for - inews", "description": "The satellites appear in a line crossing the night sky and their current orbital position has made them easier to spot in the past few days", "url": "https://inews.co.uk/news/science/starlink-satellites-tracker-elon-musk-spacex-satellite-how-see-uk-tonight-2545078", "urlToImage": null, "publishedAt": "2020-04-24T16:50:00Z", "content": "The satellites appear in a line crossing the night sky and their current orbital position has made them easier to spot in the past few days\r\nStreaks of bright light have been lighting up the night sky since the weekend, with many Brits spotting the UFO-like g… [+3248 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Charlotte Edwards", "title": "Stunning Lyrid meteor shower photos reveal fiery space rocks soaring over Earth - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11434347/lyrid-meteor-shower-photos-last-night/", "urlToImage": null, "publishedAt": "2020-04-22T10:13:27Z", "content": "THE Lyrid meteor shower reached its peak in the early hours of this morning, resulting in some amazing photos.\r\nThe first meteor shower of spring is taking over the sky this week so there is still time to try and get your own stunning snaps like the ones belo… [+3882 chars]"}]}