{"status": "ok", "totalResults": 59, "articles": [{"source": {"id": null, "name": "Ndtv.com"}, "author": "Prabhakar Thakur", "title": "Astronomers Find Rare “Super-Earth” Towards the Centre of Our Galaxy - Gadgets 360", "description": "Astronomers have discovered a rare new “Super-Earth” closer to the centre of our galaxy. The planet is one of those few discovered planets that are similar to Earth in size and orbit.", "url": "https://gadgets.ndtv.com/science/news/super-earth-astronomers-university-of-canterbury-2228860", "urlToImage": "https://i.gadgets360cdn.com/large/planet_pixabay_full_1589458995354.jpg", "publishedAt": "2020-05-14T12:30:15Z", "content": "A Super-Earth has been found closer to the centre of our galaxy through a rare observation by researchers. The newly discovered planet, though heavier than our Earth, is one of those few planetary bodies that are similar to the Earth in terms of size and orbi… [+2554 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "NASA`s TESS enables breakthrough study of perplexing stellar pulsations - Zee News", "description": "The discovery will revolutionize scientists’ ability to study details like the ages, sizes and compositions of these stars--all members of a class named for the prototype, the bright star Delta Scuti.", "url": "https://zeenews.india.com/science/nasa-s-tess-enables-breakthrough-study-of-perplexing-stellar-pulsations-delta-scuti-2283476.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2020/05/14/860814-delta-scuti.jpg", "publishedAt": "2020-05-14T12:15:37Z", "content": "In a breakthrough study, astronomers have detected elusive pulsation patterns in dozens of young, rapidly rotating stars with the help of data from NASAs Transiting Exoplanet Survey Satellite (TESS). The discovery will revolutionize scientists ability to stud… [+6810 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Digital Desk", "title": "NASAs plane telescope SOFIA discovers reasons for Plutos haze - Republic World - Republic World", "description": "The modified Boeing 747 flew over the Pacific Ocean and pointed its nearly 9-foot telescope at Pluto during an occultation, an eclipse-like event", "url": "https://www.republicworld.com/technology-news/science/nasas-plane-telescope-sofia-discovers-reasons-for-plutos-haze.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/i6tvjctiuseclpxp_1589445013.jpeg?tr=f-jpeg", "publishedAt": "2020-05-14T09:58:17Z", "content": "NASA's Stratospheric Observatory for Infrared Astronomy (SOFIA) has observed that Pluto’s haze is formed from the faint light of the Sun 3.7 billion miles away as it moves through an unusual orbit. The observations are published in the scientific journal Icar… [+2027 chars]"}, {"source": {"id": null, "name": "Kxan36news.com"}, "author": null, "title": "It revealed the secret of long legs of dinosaurs - The KXAN 36 News", "description": null, "url": "http://www.kxan36news.com/it-revealed-the-secret-of-long-legs-of-dinosaurs", "urlToImage": null, "publishedAt": "2020-05-14T09:09:00Z", "content": "Scientists have long believed that the long legs of dinosaurs were animals needed for the development of speed during catching of prey. However, a new study suggests another reason.\r\nA new study suggests that long legs have the largest dinosaur, help animals … [+1186 chars]"}, {"source": {"id": null, "name": "Kalingatv.com"}, "author": "IANS", "title": "NASA astronauts enter quarantine ahead of SpaceX Demo-2 mission - Kalinga TV", "description": "New York: NASA astronauts Robert Behnken and Douglas Hurley have entered quarantine two weeks ahead of their upcoming flight to the International Space Station (ISS) on the agency's SpaceX Demo-2 mission.They will lift off aboard a SpaceX Crew Dragon", "url": "https://kalingatv.com/technology/nasa-astronauts-enter-quarantine-ahead-of-spacex-demo-2-mission/", "urlToImage": "https://cdn.kalingatv.com/wp-content/uploads/2020/05/NASA-astronauts-Space.jpg", "publishedAt": "2020-05-14T08:45:00Z", "content": "New York: NASA astronauts Robert Behnken and Douglas Hurley have entered quarantine two weeks ahead of their upcoming flight to the International Space Station (ISS) on the agency’s SpaceX Demo-2 mission.\r\nThey will lift off aboard a SpaceX Crew Dragon spacec… [+2050 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "IANS", "title": "Terrestrial Life Unlikely to Contaminate Mars' Ecosystems During Exploration: Study - The Weather Channel", "description": "Scientists used Martian climate information from both atmospheric models and spacecraft measurements.", "url": "https://weather.com/en-IN/india/science/news/2020-05-14-terrestrial-life-unlikely-to-contaminate-mars-ecosystems-during", "urlToImage": "https://s.w-x.co/in-mars_4.jpg", "publishedAt": "2020-05-14T07:54:09Z", "content": "A Sharpened Ultraviolet View of Mars. \r\n(NASA/Goddard/University of Colorado /LASP)\r\nExploring Mars may not pose risk of contaminating the Martian ecosystems as the climate on the Red Planet is not suitable for terrestrial life as we know it, says a new study… [+1811 chars]"}, {"source": {"id": null, "name": "News-medical.net"}, "author": null, "title": "Scientists describe new mechanism of cellular locomotion - News-Medical.net", "description": "Whilst the whole world is in lockdown during the current Corona crisis, certain cells within our bodies are still travelling long-distance: while this happens when you develop pneumonia, any ordinary cut on your finger will also trigger white blood cells--aka…", "url": "https://www.news-medical.net/news/20200514/Scientists-describe-new-mechanism-of-cellular-locomotion.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2fMetastasis-620x480.jpg", "publishedAt": "2020-05-14T06:19:00Z", "content": "Whilst the whole world is in lockdown during the current Corona crisis, certain cells within our bodies are still travelling long-distance: while this happens when you develop pneumonia, any ordinary cut on your finger will also trigger white blood cells aka … [+4343 chars]"}, {"source": {"id": null, "name": "News-medical.net"}, "author": null, "title": "Modified tattoo electrodes can be used to measure brain activity - News-Medical.Net", "description": "In 2015 Francesco Greco, head of the Laboratory of Applied Materials for Printed and Soft electronics (LAMPSe) at the Institute of Solid State Physics at Graz University of Technology, developed so-called \"tattoo electrodes\" together with Italian scientists.", "url": "https://www.news-medical.net/news/20200514/Modified-tattoo-electrodes-can-be-used-to-measure-brain-activity.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2016%2f6%2fChem_Lab_c618f8c3be2845828afd242b15eaaa94-620x480.jpg", "publishedAt": "2020-05-14T06:14:38Z", "content": "In 2015 Francesco Greco, head of the Laboratory of Applied Materials for Printed and Soft electronics (LAMPSe) at the Institute of Solid State Physics at Graz University of Technology, developed so-called \"tattoo electrodes\" together with Italian scientists.\r… [+3676 chars]"}, {"source": {"id": null, "name": "Indiaeducationdiary.in"}, "author": null, "title": "NASA TV to Air Launch, Capture of Cargo Ship to International Space Station - India Education Diary", "description": "NASA will broadcast the launch of a Japanese cargo spacecraft to the International Space Station beginning at 1 p.m. EDT Wednesday, May 20, live on NASA Television and the agency’s website. The Jap…", "url": "https://indiaeducationdiary.in/nasa-tv-to-air-launch-capture-of-cargo-ship-to-international-space-station/", "urlToImage": "https://i2.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/04/NASA.jpg?fit=1200%2C675&ssl=1", "publishedAt": "2020-05-14T06:14:00Z", "content": "NASA will broadcast the launch of a Japanese cargo spacecraft to the International Space Station beginning at 1 p.m. EDT Wednesday, May 20, live on NASA Television and the agencys website.\r\nThe Japan Aerospace Exploration Agency (JAXA) and Mitsubishi Heavy In… [+2624 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Nature crisis: Moths have 'secret role' as crucial pollinators - Armenian Reporter", "description": "", "url": "https://www.bbc.co.uk/news/science-environment-52630991/", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/177E1/production/_112252269_4.png", "publishedAt": "2020-05-14T04:45:00Z", "content": "Image copyrightGetty Images\r\nLong seen as annoying creatures that may go away holes in your garments, moths have been badly misjudged, say scientists.\r\nNew research suggests they play an important function as in a single day pollinators of a variety of flower… [+3982 chars]"}, {"source": {"id": null, "name": "Chemeurope.com"}, "author": null, "title": "Noble Metal Aerogels Enabled by Freezing - Chemie.de", "description": "TU Dresden chemists developed a freeze-thaw method, capable of synthesising various noble metal aerogels (NMAs) with clean surfaces and multiscale structure. In virtue of their hierarchical struct ...", "url": "https://www.chemeurope.com/en/news/1166284/noble-metal-aerogels-enabled-by-freezing.html", "urlToImage": "https://rs1.chemie.de/images//131291-76.jpg", "publishedAt": "2020-05-14T03:44:31Z", "content": "TU Dresden chemists developed a freeze-thaw method, capable of synthesising various noble metal aerogels (NMAs) with clean surfaces and multiscale structure. In virtue of their hierarchical structures and unique optical properties, outstanding performance for… [+2626 chars]"}, {"source": {"id": null, "name": "Wordpress.com"}, "author": "View all posts by Abhishek Human", "title": "A new, highly sensitive chemical sensor uses protein nanowires - stopthefud", "description": "Scientists report that they have developed bioelectronic ammonia gas sensors that are among the most sensitive ever made. It uses electric-charge-conducting protein nanowires derived from the bacte…", "url": "https://abhishekgautam1.wordpress.com/2020/05/13/a-new-highly-sensitive-chemical-sensor-uses-protein-nanowires/", "urlToImage": "https://abhishekgautam1.files.wordpress.com/2018/06/wp-1530350057440.jpg?w=200", "publishedAt": "2020-05-13T22:17:00Z", "content": "A Hinglish Science and Interesting Info Channel from a Science Lover.\r\nHi friends, I'm Abhishek and I welcome you all to this Science and information channel, Abhishek Human Are your wings all spread out and you ready to fly yet? Uh. not literally, metaphoric… [+2060 chars]"}, {"source": {"id": null, "name": "Devdiscourse.com"}, "author": "Devdiscourse News Desk", "title": "Science News Roundup: Bulgarian fossils show early arrival of Homo sapiens into Europe and Twin antibodies may help fight coronavirus - Devdiscourse", "description": "Read more about Science News Roundup: Bulgarian fossils show early arrival of Homo sapiens into Europe and Twin antibodies may help fight coronavirus  on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/1049948-science-news-roundup-bulgarian-fossils-show-early-arrival-of-homo-sapiens-into-europe-and-twin-antibodies-may-help-fight-c", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/16_01_2019_12_17_05_2873657.jpg?width=920&format=jpeg", "publishedAt": "2020-05-13T21:44:15Z", "content": "Following is a summary of current science news briefs.\r\nBulgarian fossils show early arrival of Homo sapiens into Europe\r\nFragmentary bone fossils and a molar found in Bulgaria dated roughly 45,000 years ago show that Homo sapiens populations swept into Europ… [+781 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Stacy Liberatore For Dailymail.com", "title": "Mars and the moon will appear 'tangled' on May 14 as Earth's satellite enters its last quarter phase - Daily Mail", "description": "Just before sunrise on May 14, the moon nearing its last quarter phase and appear 'tangled' with Mars in the sky. The lunar orb will be 247,000 miles for Earth and Mars will be 425 times further.", "url": "https://www.dailymail.co.uk/sciencetech/article-8317161/Mars-moon-appear-tangled-14-Earths-satellite-enters-quarter-phase.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/13/22/28363476-0-image-a-32_1589406621297.jpg", "publishedAt": "2020-05-13T21:39:38Z", "content": "In a world full of disheartening events, one wondrous cosmic display is set to take place Thursday morning that is sure to lift our spirits.\r\nJust before sunrise on May 14, the moon will be entering its last quarter phase and appear 'tangled' with Mars.  \r\nAl… [+2895 chars]"}, {"source": {"id": null, "name": "Techquila.co.in"}, "author": null, "title": "The Most Comprehensive Map of The Moon Yet - TechQuila", "description": "The recently released lunar map by USGS is the most comprehensive and detailed yet and it uses multiple sources for data collection.", "url": "https://www.techquila.co.in/moon-map/", "urlToImage": "https://www.techquila.co.in/wp-content/uploads/2020/05/1200px-FullMoon2010.jpg", "publishedAt": "2020-05-13T19:30:00Z", "content": "The moon has been the object of fascination for the most audacious explorers amongst us. The mere thought of a human setting foot on the natural satellite has sparked support as well as opposition for a long time. It is no wonder then that the act of putting … [+2601 chars]"}, {"source": {"id": null, "name": "Wordpress.com"}, "author": "Roofing Services", "title": "Alpine Home Service: Expectations Vs. Reality - stopthefud", "description": "You might also require to establish a workspace in your house for major repairs, however you can normally execute minor appliance repair work on …fromRead Morefrom From", "url": "https://roofservices0.wordpress.com/2020/05/13/alpine-home-service-expectations-vs-reality/", "urlToImage": "https://roofservices0.files.wordpress.com/2018/08/46.jpg?w=128", "publishedAt": "2020-05-13T19:27:00Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "'Mini Rover' can wiggle and crawl its way across tricky terrain on other planets - CNN", "description": "Rovers exploring planetary surfaces like Mars can get stuck in soft, steep soils. But the \"Mini Rover,\" a scaled-down 3D-printed model of a NASA rover concept built and tested by researchers at the Georgia Institute of Technology, has a gait that allows it to…", "url": "https://www.cnn.com/2020/05/13/us/mini-rover-experiment-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200513122604-01-mini-rover-super-tease.jpg", "publishedAt": "2020-05-13T18:12:42Z", "content": null}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Kashmira Gander", "title": "Millions of Human Cells Have Been Grown Inside Mice Embryos - Newsweek", "description": "Professor Jian Feng of the Jacobs School of Medicine and Biomedical Sciences told Newsweek: \"This will enable the generation of human cells, tissues or even organs in animals.\"", "url": "https://www.newsweek.com/millions-human-cells-have-been-grown-inside-mice-embryos-1503629", "urlToImage": "https://d.newsweek.com/en/full/1589532/lab-mouse-rodent-science-stock.jpg", "publishedAt": "2020-05-13T18:08:41Z", "content": "Scientists have created millions of human cells in mouse embryos, in a technique which they hope could one day be used in a variety of ways, from growing organs for life-saving transplants to finding treatments for diseases including COVID-19.\r\nThe study cent… [+5552 chars]"}, {"source": {"id": null, "name": "Eurekalert.org"}, "author": null, "title": "Scientists successfully develop 'heat resistant' coral to fight bleaching - EurekAlert", "description": "A team of scientists has successfully produced in a laboratory setting a coral that is more resistant to increased seawater temperatures.", "url": "https://www.eurekalert.org/pub_releases/2020-05/ca-ssd051120.php", "urlToImage": "https://www.eurekalert.org/images/EurekAlert_StackedLogo_RGB.jpg", "publishedAt": "2020-05-13T18:04:44Z", "content": "The team included researchers from CSIRO, Australia's national science agency, the Australian Institute of Marine Science (AIMS) and the University of Melbourne.\r\nCorals with increased heat tolerance have the potential to reduce the impact of reef bleaching f… [+2576 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt, CNN", "title": "How the world's most dangerous bird got its unique feathers - CNN", "description": "It's been called the world's most dangerous bird. The cassowary's long dagger-like middle toes were responsible for the death of a man in Florida last year, and new research now shows that its glossy feathers are unlike those of other iridescent birds.", "url": "https://www.cnn.com/2020/05/13/world/cassowary-bird-feathers-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190414090035-01-cassowary-super-tease.jpg", "publishedAt": "2020-05-13T18:04:06Z", "content": "(CNN)It's been called the world's most dangerous bird. Its long dagger-like middle toes, in fact, were responsible for the death of a man in Florida last year. \r\nBut what excites scientists about the cassowary a large, emu-like, flightless bird is its distinc… [+2718 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Mindy Weisberger", "title": "Did men's beards evolve to absorb a punch to the jaw? - Livescience.com", "description": "Thick facial hair could cushion the face and jaw", "url": "https://www.livescience.com/beards-protect-face-punches.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/UWJ4fL3rKAuYRLofTLvfpd-1200-80.jpg", "publishedAt": "2020-05-13T16:31:00Z", "content": "Full, luxurious beards are a sight to behold, and they may also serve a practical purpose softening the impact of a punch to the jaw.\r\nThroughout history, flowing beards have been celebrated by cultures around the world as an emblem of social dominance and vi… [+4090 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Scientists explained the origin of the galaxy in the shape of the letter X - The Times Hub", "description": null, "url": "https://thetimeshub.in/scientists-explained-the-origin-of-the-galaxy-in-the-shape-of-the-letter-x/18171/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2020/05/13ce396c692527a88c519b2f2eff7c67-400x400.jpg", "publishedAt": "2020-05-13T16:07:26Z", "content": "Scientists of the American research center in radio astronomy NRAO showed in the Instagram galaxy PKS 2014-55 in the form of the letter X. the Experts explained the origin of the cosmic structure.\r\nGalaxy in the shape of the letter X is located at a distance … [+747 chars]"}, {"source": {"id": null, "name": "Nanowerk.com"}, "author": null, "title": "Where neutrinos come from - Nanowerk", "description": "Researchers trace high-energy neutrino origins to black holes in far-off quasars.", "url": "https://www.nanowerk.com/news2/space/newsid=55145.php", "urlToImage": "https://www.nanowerk.com/news2/space/id55145.jpg", "publishedAt": "2020-05-13T16:00:44Z", "content": null}, {"source": {"id": null, "name": "Aninews.in"}, "author": null, "title": "AI helps researchers up-cycle waste carbon - ANI News", "description": "Washington D.C. [USA], May 13 (ANI): In a breakthrough study, researchers are using artificial intelligence (AI) to accelerate progress in transforming waste carbon into a commercially valuable product with record efficiency.", "url": "https://www.aninews.in/news/science/ai-helps-researchers-up-cycle-waste-carbon20200513212130", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/fvf_amRQdLt_AxFpJf8-thumbnail-154x87-70.jpg", "publishedAt": "2020-05-13T15:52:38Z", "content": "ANI | Updated: May 13, 2020 21:21 IST\r\nWashington D.C. [USA], May 13 (ANI): In a breakthrough study, researchers are using artificial intelligence (AI) to accelerate progress in transforming waste carbon into a commercially valuable product with record effici… [+4193 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Massive Part of Chinese Rocket Falling into Atlantic Ocean is Biggest since 1991 - News18", "description": "Astronaut Jonathan McDowell of the Harvard-Smithsonian Center for Astrophysics also confirmed the news, along with the tracking images of the CZ-5B.", "url": "https://www.news18.com/news/buzz/massive-part-of-chinese-rocket-falling-into-atlantic-ocean-is-biggest-since-1991-2618869.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2019/12/SpaceX-Successfully-Launches-Falcon-9-Rocket-to-Orbit-11.jpg", "publishedAt": "2020-05-13T15:48:16Z", "content": "Days after its successful launch into the space, a huge chunk of a Chinese rocket has fallen back to the Earth. The debris of Chinese Long March 5B (CZ5B) rocket, measuring at 17.8 tonnes, was first spotted by the US Air Force's 18th Space Control Squadron.\r\n… [+2088 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Rapid growth of new atmospheric particles by nitric acid and ammonia condensation - Nature.com", "description": "Measurements in the CLOUD chamber at CERN show that the rapid condensation of ammonia and nitric acid vapours could be important for the formation and survival of new particles in wintertime urban conditions, contributing to urban smog.", "url": "https://www.nature.com/articles/s41586-020-2270-4", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-020-2270-4/MediaObjects/41586_2020_2270_Fig1_HTML.png", "publishedAt": "2020-05-13T15:10:19Z", "content": "<li></li>\r\n1.Stanier, C. O., Khlystov, A. Y. &amp; Pandis, S. N. Nucleation events during the Pittsburgh Air Quality Study: description and relation to key meteorological, gas phase, and aerosol parameters. Aerosol Sci. Technol. 38, 253264 (2004).\r\n<li></li>\r… [+15075 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Astronaut Chris Cassidy Meets Astrobee - NASA Johnson", "description": "It turns out that astronauts could use some help with their chores, just like many of us on Earth. Astrobee, a free-flying robotic system developed by resear...", "url": "https://www.youtube.com/watch?v=i0OEF2cRa3E", "urlToImage": "https://i.ytimg.com/vi/i0OEF2cRa3E/maxresdefault.jpg", "publishedAt": "2020-05-13T15:00:22Z", "content": null}, {"source": {"id": null, "name": "Azorobotics.com"}, "author": null, "title": "Robust AI Method Morphologically Classifies Objects in Astronomical Images - AZoRobotics", "description": "At UC Santa Cruz, scientists have designed a new robust computer program known as Morpheus with the ability to examine astronomical image data pixel by pixel to determine and classify all of the stars and galaxies in huge data sets from astronomy surveys.", "url": "https://www.azorobotics.com/News.aspx?newsID=11265", "urlToImage": "https://www.azorobotics.com/images/news/ImageForNews_11265_15893709495012699.png", "publishedAt": "2020-05-13T14:50:00Z", "content": "Written by AZoRoboticsMay 13 2020\r\nAt UC Santa Cruz, scientists have designed a new robust computer program known as Morpheus with the ability to examine astronomical image data pixel by pixel to determine and classify all of the stars and galaxies in huge da… [+4979 chars]"}, {"source": {"id": null, "name": "Indiainternationaltimes.com"}, "author": "Sridhar P", "title": "What's Mars made of ? Japanese study throws light and opens up new study - India International Times", "description": "Since going to Mars, one of our closest terrestrial neighbors, is still very far away, Japanese scientists have tried something on our own planet with simulations and found that the iron-sulfur alloys thought to comprise the core of Mars to reveal details abo…", "url": "https://indiainternationaltimes.com/whats-mars-made-of-japanese-study-throws-light-and-opens-up-new-study/4110", "urlToImage": "https://i2.wp.com/indiainternationaltimes.com/wp-content/uploads/2020/05/mars3.jpg?fit=1440%2C1440&ssl=1", "publishedAt": "2020-05-13T13:01:34Z", "content": "Since going to Mars, one of our closest terrestrial neighbors, is still very far away, Japanese scientists have tried something on our own planet with simulations and found that the iron-sulfur alloys thought to comprise the core of Mars to reveal details abo… [+2910 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "B S Shylaja", "title": "A small black hole at a small distance - Deccan Herald", "description": "Science fiction movies and books also created an atmosphere of fear. The relief, however, came when we took a closer look at the numbers, the mass, the distance - all running to nine or ten digits. Then there were estimates about how close a black hole should…", "url": "https://www.deccanherald.com/science-and-environment/a-small-black-hole-at-a-small-distance-837146.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/13/file7aglo529jpjrzhvj2wm-1589374626.jpg", "publishedAt": "2020-05-13T12:57:06Z", "content": "Right from the day the word 'black hole' was coined, people have been looking at the cosmic phenomenon as a mysterious monster, just waiting to swallow everything near it. Science fiction movies and books also created an atmosphere of fear. The relief, howeve… [+3133 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Hydrogen Fuel Cells Improved With Coordination Polymer Glass - SciTechDaily", "description": "Hydrogen fuel cells made with coordination polymer glass membranes could produce as much energy as their liquid-based counterparts while adding strength and flexibility. Scientists at Japan's Institute for Integrated Cell-Material Sciences (iCeMS) are leading…", "url": "https://scitechdaily.com/hydrogen-fuel-cells-improved-with-coordination-polymer-glass/", "urlToImage": "https://scitechdaily.com/images/New-Polymer-Glass-Molecular-Structure-scaled.jpg", "publishedAt": "2020-05-13T12:42:37Z", "content": "The molecular structure of the new polymer glass facilitated the movement of protons (H+) across it under dry conditions at 120°C. Credit: Mindy Takamiya/Kyoto University iCeMS\r\nHydrogen fuel cells made with coordination polymer glass membranes could produce … [+3202 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "Scientists developed electronic diodes beyond 5G performance - Tech Explorist", "description": "NRL scientists developed a new gallium nitride-based electrical component called a resonant tunneling diode (RTD) with performance beyond the anticipated speed of 5G.", "url": "https://www.techexplorist.com/scientists-developed-electronic-diodes-beyond-5g-performance/32242/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/05/resonant-tunneling-diode.jpg", "publishedAt": "2020-05-13T12:09:03Z", "content": "David Storm, a research physicist, and Tyler Growden, an electrical engineer in collaboration with the U.S. Naval Research Laboratory, have developed new gallium nitride-based electrical component called a resonant tunneling diode (RTD) with performance beyon… [+1601 chars]"}, {"source": {"id": null, "name": "Menafn.com"}, "author": "MENAFN", "title": "Space junk: Astronomers worry as private companies push ahead with satellite launches - MENAFN.COM", "description": "(MENAFN - The Conversation) Since the launch of Sputnik 1 in 1957, the lower orbit around the Earth has become an increasingly congested environment with more than 2,200 satellite launches to dat", "url": "https://menafn.com/1100156905/space-junk-astronomers-worry-as-private-companies-push-ahead-with-satellite-launches", "urlToImage": "https://menafn.com/updates/pr/2020-05/13/TC_343cdba4-dimage_story.jpg", "publishedAt": "2020-05-13T11:43:59Z", "content": "(MENAFN - The Conversation) Since the launch of Sputnik 1 in 1957, the lower orbit around the Earth has become an increasingly congested environment with more than 2,200 satellite launches to date. Those satellites along with launch vehicle components and deb… [+4872 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Analysis of ancient minerals helped to reveal features of the earth’s atmosphere 2 billion years ago - The Times Hub", "description": null, "url": "https://thetimeshub.in/analysis-of-ancient-minerals-helped-to-reveal-features-of-the-earths-atmosphere-2-billion-years-ago/18014/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2020/05/03d5c5e687cc88718a45423128fad70b-636x400.jpg", "publishedAt": "2020-05-13T11:07:03Z", "content": "A thorough analysis of ancient mineral deposits has allowed scientists to draw a conclusion about what was the oxygen level on Earth 2 billion years ago. As it turned out, at that time the planet was much more saturated with oxygen than it was assumed before.… [+947 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Scientists: On the inner rotating core of the Earth rising mountains - The Times Hub", "description": null, "url": "https://thetimeshub.in/scientists-on-the-inner-rotating-core-of-the-earth-rising-mountains/18012/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2020/05/fe5590aa8fd725088fe88fbd503cd3c8-606x400.jpg", "publishedAt": "2020-05-13T11:06:49Z", "content": "Scientists from the University of Illinois after the analysis of seismic data and studies constantly rotating inner core of the Earth said that there are mountains. The American experts were told about the past mistakes of geologists.\r\nIn 1996, for the first … [+1136 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "'Fast & Furious' Aten-Class Asteroid Will Closely Approach Earth This June - Sputnik International", "description": "Aten-class asteroids spend most of their time inside Earth’s orbit and from time to time they come quite close to our planet, sparking fears about an imminent collision.", "url": "https://sputniknews.com/science/202005131079290831-fast--furious-aten-class-asteroid-will-closely-approach-earth-this-june/", "urlToImage": "https://cdn1.img.sputniknews.com/images/107929/08/1079290800.jpg", "publishedAt": "2020-05-13T11:00:53Z", "content": null}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Jonathan O’Callaghan", "title": "This NASA Mission May Cause an Artificial Meteor Shower - The New York Times", "description": "A study says the DART mission’s collision with an asteroid near Earth may liberate enough debris to reach Earth’s atmosphere.", "url": "https://www.nytimes.com/2020/05/13/science/meteor-shower-nasa-dart.html", "urlToImage": "https://static01.nyt.com/images/2020/05/13/science/13SCI-ASTEROID1/13SCI-ASTEROID1-facebookJumbo-v2.jpg", "publishedAt": "2020-05-13T10:03:07Z", "content": "If all goes to plan, in September 2022 a NASA spacecraft, the Double Asteroid Redirection Test mission or DART, will slam into a space rock with the equivalent energy of three tons of TNT. The goal is to nudge the orbit of its target object ever-so-slightly, … [+5308 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Meet this super-spotter of duplicated images in science papers - Nature.com", "description": "Elisabeth Bik quit her job to spot errors in research papers — and has become the public face of image sleuthing.", "url": "https://www.nature.com/articles/d41586-020-01363-z", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-020-01363-z/d41586-020-01363-z_17958208.jpg", "publishedAt": "2020-05-13T10:02:30Z", "content": "February the fourteenth starts like most other days for Elisabeth Bik: checking her phone in bed, she scrolls through a slew of Twitter notifications and private messages from scientists seeking her detective services. Todays first request is from a researche… [+21877 chars]"}, {"source": {"id": null, "name": "Eurekalert.org"}, "author": null, "title": "NMR confirms molecular switches retain function in 2D-array - EurekAlert", "description": "Researchers led by Jiri Kaleta of IOCB Prague have synthesized regular 2D assemblies of isotopically labelled molecular switches and measured the properties of their isomerization, revealing that formation of such an assembly doesn't hamper the photochemical …", "url": "https://www.eurekalert.org/pub_releases/2020-05/iooc-ncm051220.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/231663_web.jpg", "publishedAt": "2020-05-13T10:01:39Z", "content": "IMAGE: Isotopically labelled molecular switch\r\n(Source: https://www.uochb.cz/en/news/171)\r\n view more \r\nCredit: Tomas Bellon / IOCB Prague\r\nPrague, 15 May 2020 - Researchers led by Jiri Kaleta of IOCB Prague have synthesized regular 2D assemblies of isotopica… [+2970 chars]"}, {"source": {"id": null, "name": "Uploadcomet.com"}, "author": "Calvin S. Heenan", "title": "What We See at the Collision Site of Two Galaxy Clusters - Upload Comet", "description": "A few hundred million years ago, two clusters of galaxies crashed into each other, then passed one through the other. This colossal occurrence sent free a barrage of hot gas from each of the clusters, forming an out of the ordinary bridge between the two cele…", "url": "https://uploadcomet.com/what-we-see-at-the-collision-site-of-two-galaxy-clusters/8002/", "urlToImage": "https://uploadcomet.com/wp-content/uploads/2020/05/What-We-See-at-the-Collision-Site-of-Two-Galaxy-Clusters.jpg", "publishedAt": "2020-05-13T09:44:00Z", "content": "A few hundred million years ago, two clusters of galaxies crashed into each other, then passed one through the other. This colossal occurrence sent free a barrage of hot gas from each of the clusters, forming an out of the ordinary bridge between the two cele… [+1538 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Bulgarian fossils show early arrival of Homo sapiens into Europe - India Today", "description": "New research pushes back by thousands of years the arrival of Homo sapiens in Europe, a milestone in the history of a species that arose in Africa about 300,000 years ago and then spread worldwide.", "url": "https://www.indiatoday.in/science/story/bacho-kiro-homo-sapiens-arrival-europe-1677478-2020-05-13", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/2020-05-11T000000Z_1721045674_-647x363.png?NGjVBOzLeBXNYoCCODMALvvoPc_r7Xq.", "publishedAt": "2020-05-13T07:28:10Z", "content": "Fragmentary bone fossils and a molar found in Bulgaria dated to roughly 45,000 years ago show that Homo sapiens populations swept into Europe - until then a bastion for the Neanderthals - earlier than previously known, scientists said on Monday.\r\nResearchers … [+2613 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Tessa Koumoundouros", "title": "We Still Have No Idea How Male And Female Dinosaurs Differ, Study Shows - ScienceAlert", "description": "The idea that female Tyrannosaurus rex are chonkier than males may have no basis in reality. This assumption has prevailed when it comes to popular notions of these prehistoric beasties, but its origin might have been mistaken.", "url": "https://www.sciencealert.com/paleontologists-can-t-yet-tell-male-and-female-dinosaurs-apart", "urlToImage": "https://www.sciencealert.com/images/2020-05/processed/CrazyColouredDinosDimorphicCantTell_1024.jpg", "publishedAt": "2020-05-13T07:22:12Z", "content": "The idea that female Tyrannosaurus rex are chonkier than males may have no basis in reality. This assumption has prevailed when it comes to popular notions of these prehistoric beasties, but its origin might have been mistaken.\r\nIn the science world, sexing d… [+3189 chars]"}, {"source": {"id": null, "name": "Theregister.co.uk"}, "author": "Katyanna Quach", "title": "Meteorite's tiny secrets reveal Solar System's sodium-rich, alkaline liquid past – a clue to formation of life - The Register", "description": "Oh OK, so now we know who to blame for all this mess on Earth", "url": "https://www.theregister.co.uk/2020/05/13/solar_system_fluid_meteorite/", "urlToImage": "https://regmedia.co.uk/2020/05/12/tagish_lake.jpg", "publishedAt": "2020-05-13T06:39:00Z", "content": "Potentially helping to answer the question of how did we all get here, scientists have found evidence of ideal conditions for the formation of microbial life on Earth sodium-rich, alkaline fluids present in the early Solar System.\r\nAnd where did they find thi… [+3253 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Supreme Court wary of presidential 'harassment' in Trump finances fight | Reuters Video - Reuters", "description": "In a major showdown over presidential powers, U.S. Supreme Court justices on Tuesday appeared divided over President Donald Trump's bid to prevent congressional Democrats from obtaining his financial records but seemed more open toward a New York prosecutor's…", "url": "https://www.reuters.com/video/watch/idOVCDMT9SV", "urlToImage": "https://static.reuters.com/resources/r/?d=20200513&i=OVCDMT9SV&r=OVCDMT9SV&t=2", "publishedAt": "2020-05-13T06:29:51Z", "content": "Posted \r\nIn a major showdown over presidential powers, U.S. Supreme Court justices on Tuesday appeared divided over President Donald Trump's bid to prevent congressional Democrats from obtaining his financial records but seemed more open toward a New York pro… [+81 chars]"}, {"source": {"id": null, "name": "Newslivetv.com"}, "author": "Digital Desk", "title": "Jupiter's moon Europa: New evidence of watery plumes - News Live", "description": "Gottingen: A group of scientists, including researchers from the Max Planck Institute for Solar System Research (MPS) in Germany have found new evidence of the presence of a plume of water near Jupiter’s moon Europa. During a fly-by of Jupiter’s moon Europa, …", "url": "https://newslivetv.com/jupiters-moon-europa-new-evidence-of-watery-plumes/", "urlToImage": "https://i1.wp.com/www.newslivetv.com/wp-content/uploads/2020/05/original_IC3SqsA_4ueSoe11.jpg?fit=600%2C450&ssl=1", "publishedAt": "2020-05-13T04:15:00Z", "content": "Gottingen: A group of scientists, including researchers from the Max Planck Institute for Solar System Research (MPS) in Germany have found new evidence of the presence of a plume of water near Jupiter’s moon Europa.\r\nDuring a fly-by of Jupiter’s moon Europa,… [+4377 chars]"}, {"source": {"id": null, "name": "Wordpress.com"}, "author": "View all posts by chhatramanicy", "title": "‘Brain’s steering wheel’ in the brainstem of mice - stopthefud", "description": "Latest Science News — ScienceDaily ‘Brain’s steering wheel’ in the brainstem of mice #EngineeringCy In a new study in mice, neuroscientists have found neurons in the brain t…", "url": "https://cyideanet.wordpress.com/2020/05/13/brains-steering-wheel-in-the-brainstem-of-mice/", "urlToImage": "https://www.sciencedaily.com/images/sd-logo.png", "publishedAt": "2020-05-13T00:57:31Z", "content": null}, {"source": {"id": null, "name": "Wtsp.com"}, "author": "Ric Kearbey", "title": "3 planets and the moon will light up the sky before sunrise - WTSP.com", "description": "A beautiful, clear sky will allow for perfect viewing.", "url": "https://www.wtsp.com/article/tech/science/space/how-to-see-mars-moon-jupiter-saturn-in-morning-sky/67-a2b6bd9e-f9a4-4ead-b49e-9cb0a9ccb3dc", "urlToImage": "https://media.wtsp.com/assets/WTSP/images/3c5e4ff7-f22d-4852-92b9-b7b991096b02/3c5e4ff7-f22d-4852-92b9-b7b991096b02_1140x641.jpg", "publishedAt": "2020-05-12T21:46:00Z", "content": "Weve had some great sights in our skies recently, from a meteor shower to a supermoon. \r\nIf youre an early riser, take a look at the southeast-south sky to see the moon before sunrise alongside three famous planets: Jupiter, Saturn and Mars.\r\nHere's how to sp… [+853 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": null, "title": "10 stunning photos of Southern California's poppies bursting into bloom after months of drought - Business Insider India", "description": "People visit poppy fields near the Antelope Valley California Poppy Reserve.FREDERIC J. BROWN/AFP via Getty ImagesThe Antelope Valley California Poppy Reserve in Lancaster, California, is in full bloom.The fields are so bright that a NASA satellite could phot…", "url": "https://www.insider.com/california-poppies-antelope-valley-photos-2020-5", "urlToImage": "https://www.businessinsider.in/photo/75706236/10-stunning-photos-of-Southern-Californias-poppies-bursting-into-bloom-after-months-of-drought.jpg", "publishedAt": "2020-05-12T20:55:00Z", "content": "People visit poppy fields near the Antelope Valley California Poppy Reserve.FREDERIC J. BROWN/AFP via Getty Images\r\nThe world may feel an uncertain place due to the upheaval of the coronavirus pandemic, but spring has still sprung.\r\nThe Antelope Valley Califo… [+362 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Three Million Light-Year Long Bridge Between Two Galaxy Clusters Warped by Supermassive Black Hole - SciTechDaily", "description": "A new study, based on data from ESA’s XMM-Newton and NASA’s Chandra X-ray observatories, sheds new light on a three million light-year long bridge of hot gas linking two galaxy clusters, whose shape is being bent by the mighty activity of a nearby supermassiv…", "url": "https://scitechdaily.com/three-million-light-year-long-bridge-between-two-galaxy-clusters-warped-by-supermassive-black-hole/", "urlToImage": "https://scitechdaily.com/images/Bridge-Between-Galaxy-Clusters-Abell-2384-Annotated.jpg", "publishedAt": "2020-05-12T20:34:44Z", "content": "A composite view of the Abell 2384 system, comprising two galaxy clusters located 1.2 billion light years from Earth.\r\nA new study, based on data from ESA’s XMM-Newton and NASA’s Chandra X-ray observatories, sheds new light on a three million light-year long … [+2822 chars]"}, {"source": {"id": null, "name": "Kxan36news.com"}, "author": null, "title": "Created a prototype quantum radar of the future - The KXAN 36 News", "description": null, "url": "http://www.kxan36news.com/created-a-prototype-quantum-radar-of-the-future", "urlToImage": null, "publishedAt": "2020-05-12T18:22:39Z", "content": "Physicists from the Institute of science and technology Austria by colleagues from the USA, the UK and Italy created a prototype radar that uses quantum entanglement to detect the object. This technology in the future may find application in biomedical scanne… [+1310 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Scientists have identified the safest place on Mars - The Times Hub", "description": null, "url": "https://thetimeshub.in/scientists-have-identified-the-safest-place-on-mars/17700/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2020/05/9d7f8286b2443b2d5fcc57317de0afb1.jpg", "publishedAt": "2020-05-12T18:08:26Z", "content": "Lava tunnels are the safest place for future immigrants and colonizers of the red planet. This conclusion was voiced by the group of researchers from CPS (USA), which was engaged in a detailed study of the surface of Mars.\r\nAccording to experts, a chain of la… [+686 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Lois Yoksoulian", "title": "Growing mountains or shifting ground: What is going on in Earth's inner core? - Phys.org", "description": "Exhaustive seismic data from repeating earthquakes and new data-processing methods have yielded the best evidence yet that the Earth's inner core is rotating—revealing a better understanding of the hotly debated processes that control the planet's magnetic fi…", "url": "https://phys.org/news/2020-05-mountains-shifting-ground-earth-core.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/growingmount.jpg", "publishedAt": "2020-05-12T17:55:23Z", "content": "Exhaustive seismic data from repeating earthquakes and new data-processing methods have yielded the best evidence yet that the Earth's inner core is rotatingrevealing a better understanding of the hotly debated processes that control the planet's magnetic fie… [+3479 chars]"}, {"source": {"id": null, "name": "Nanowerk.com"}, "author": null, "title": "Nanofiber membranes transformed into 3D scaffolds - Nanowerk", "description": "Researchers develop a new way to create 3D scaffolds for biomedical applications.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=55134.php?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=nanowerkemergingtechnologiesnews", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id55134.jpg", "publishedAt": "2020-05-12T15:22:32Z", "content": null}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Neha", "title": "Bending the bridge between two galaxy clusters! - The Siasat Daily", "description": "Washington D.C.: Several hundred million years ago, two galaxy clusters collided and then passed through each other. This mighty event released a flood of hot gas from each galaxy cluster that formed an unusual bridge between the two objects. This bridge is n…", "url": "https://www.siasat.com/bending-bridge-between-two-galaxy-clusters-1888034/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/05/galaxy.jpg", "publishedAt": "2020-05-12T14:02:00Z", "content": "Washington D.C.: Several hundred million years ago, two galaxy clusters collided and then passed through each other. This mighty event released a flood of hot gas from each galaxy cluster that formed an unusual bridge between the two objects. This bridge is n… [+3071 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": null, "title": "SpaceX Plans To Send NASA Astronauts To Space in Q2 This Year - http://www.newsgram.com/", "description": "After NASA and SpaceX successfully completed a launch escape demonstration of the company's Crew Dragon spacecraft and Falcon 9 rocket.", "url": "https://www.newsgram.com/spacex-send-nasa-astronauts-space/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2020/01/NASA-Logo1.jpg", "publishedAt": "2020-01-20T16:14:21Z", "content": "NASA’s Hubble Space Telescope and the ground-based Gemini Observatory in Hawaii have teamed up with the Juno spacecraft to probe the mightiest storms on the giant planet Jupiter.\r\nThe images, part of a multi-year joint programme, revealed that lightning strik… [+2735 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": null, "title": "NASA Explore Technology To Build Future Homes Made of Fungi For Moon, Mars - http://www.newsgram.com/", "description": "Instead of habitats made of metal and glass, NASA is exploring technologies that could grow structures out of fungi to become our future homes in the stars.", "url": "https://www.newsgram.com/nasa-build-homes-fungi-moon-mars/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2020/01/NASA-Logo.jpg", "publishedAt": "2020-01-18T10:02:49Z", "content": "Although abrupt, Work-From-Homes has presented a shift in the working paradigm for many businesses, many tech giants see this as a new cultural trend, ready to carry it forward even after lockdown ends.\r\nBut for those sitting at home – admittedly for longer d… [+4450 chars]"}, {"source": {"id": null, "name": "Mentalfloss.com"}, "author": null, "title": "5 Fast Facts About the Spring Equinox - Mental Floss", "description": "The spring equinox occurs on March 19, 2020, at 11:49 p.m. Eastern Time—the earliest it has ever arrived in 124 years. Here's what you should know about it, including if you can balance an egg during the event.", "url": "https://www.mentalfloss.com/article/577353/spring-equinox-facts", "urlToImage": "https://images2.minutemediacdn.com/image/upload/c_crop,h_1194,w_2121,x_0,y_220/v1584620220/shape/mentalfloss/577353-gettyimages-624128826.jpg?itok=7IYjR8dN", "publishedAt": "2019-11-03T15:57:56Z", "content": "After months of quarantine, you've probably binged all your usual TV shows, cooked your favorite go-to meals, and spent more time aimlessly staring at your phone than you'd care to admit. To break up what feels like a monotonous blur of days spent cooped up i… [+26281 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "Moon May Have Harboured Life 4 Billion Years Ago, Research Suggests - http://www.newsgram.com/", "description": "While the Moon is presently unsuitable for habitation, there could have been life on its surface about four billion years ago, researchers have suggested.", "url": "https://www.newsgram.com/moon-may-harboured-life-4-billion-years-ago-research-suggests/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2018/07/moon-2762111_1920.jpg", "publishedAt": "2018-07-25T05:09:47Z", "content": "Christies presents NWA 12691, a significant lunar rock, among the largest known in existence. Moon rock is among the rarest substances on Earth, with less than 650 kg. of lunar meteorites known to exist.\r\nThis example is the fifth largest piece of the Moon on… [+2829 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "NASA releases its latest Global maps of Earth at Night, provides clearest patterns of Human Settlement across the Planet - http://www.newsgram.com/", "description": "NASA has released its latest global maps of Earth at night, providing the \"clearest yet composite\" view of patterns of human settlement across our planet.", "url": "https://www.newsgram.com/nasa-releases-its-latest-global-maps-of-earth-at-night-provides-clearest-patterns-of-human-settlement-across-the-planet/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2016/11/earth.jpg", "publishedAt": "2017-06-13T14:36:47Z", "content": "NASA’s Hubble Space Telescope and the ground-based Gemini Observatory in Hawaii have teamed up with the Juno spacecraft to probe the mightiest storms on the giant planet Jupiter.\r\nThe images, part of a multi-year joint programme, revealed that lightning strik… [+2735 chars]"}]}