{"status": "ok", "totalResults": 30, "articles": [{"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Cosmic Reef: NASA release an image of a blazing starbirth to mark Hubble's 30th birthday - Firstpost", "description": "Hubble has been placed in space to observe the most distant stars and galaxies, as well as planets in our solar system.", "url": "https://www.firstpost.com/tech/science/cosmic-reef-nasa-release-an-image-of-a-blazing-starbirth-to-mark-hubbles-30th-birthday-8299671.html", "urlToImage": null, "publishedAt": "2020-04-25T10:23:08Z", "content": "FP TrendingApr 25, 2020 16:24:11 IST\r\nThe US space agency has released a new bright picture of a firestorm of starbirth to mark the 30th anniversary of the Hubble Space Telescope. Scientists have called the picture Cosmic Reef, as it resembles a coral reef fl… [+1921 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Siddharth Iyer", "title": "Massive asteroid flying past Earth next week looks like its wearing a face mask - Republic World - Republic World", "description": "Arecibo Observatory in Puerto Rico recently shared an image of an asteroid that looked like it was wearing a 'face mask'. This image has now gone viral online.", "url": "https://www.republicworld.com/entertainment-news/whats-viral/viral-photo-of-face-mask-wearing-asteroid.html", "urlToImage": null, "publishedAt": "2020-04-25T09:06:02Z", "content": "Right now, the world is worried about the COVID-19 pandemic. In fact, people are so worried about the virus that even celestial bodies look like they are wearing face masks. Recently, Arecibo Observatory in Puerto Rico shared an image of a 1.5 kilometres wide… [+2126 chars]"}, {"source": {"id": "xinhua-net", "name": "Xinhua Net"}, "author": null, "title": "Highlights of China's science news - Xinhua | English.news.cn - Xinhua", "description": null, "url": "http://www.xinhuanet.com/english/2020-04/25/c_139007324.htm", "urlToImage": null, "publishedAt": "2020-04-25T08:26:17Z", "content": "BEIJING, April 25 (Xinhua) -- The following are the highlights of China's science news from the past week:\r\nMARS EXPLORATION\r\nChina's first Mars exploration mission has been named Tianwen-1, announced the China National Space Administration (CNSA) Friday, Chi… [+2405 chars]"}, {"source": {"id": null, "name": "Aninews.in"}, "author": null, "title": "Atmospheric tidal waves maintain Venus' super-rotation - ANI News", "description": "Washington D.C. [USA], April 25 (ANI): Images from the Akatsuki spacecraft unveil what keeps Venus's atmosphere rotating much faster than the planet itself.", "url": "https://www.aninews.in/news/science/atmospheric-tidal-waves-maintain-venus-super-rotation20200425075240", "urlToImage": null, "publishedAt": "2020-04-25T02:23:00Z", "content": "ANI | Updated: Apr 25, 2020 07:52 IST\r\nWashington D.C. [USA], April 25 (ANI): Images from the Akatsuki spacecraft unveil what keeps Venus's atmosphere rotating much faster than the planet itself.An international research team led by Takeshi Horinouchi of Hokk… [+2914 chars]"}, {"source": {"id": null, "name": "Gizbot.com"}, "author": "Sharmishte Datti", "title": "NASA VITAL Prototype Ventilators To Help Fight COVID-19 Pandemic - Gizbot", "description": "In a bid to help the coronavirus infected, NASA has announced that it has successfully developed a prototype ventilator for the treatment of coronavirus patients. For this, NASA has developed VITAL or the Ventilator Intervention Technology Accessible Locally.", "url": "https://www.gizbot.com/news/covid-19-pandemic-nasa-builds-prototype-ventilators-067269.html", "urlToImage": null, "publishedAt": "2020-04-25T02:00:00Z", "content": "In a bid to help the coronavirus infected, NASA has announced that it has successfully developed a prototype ventilator for the treatment of coronavirus patients. For this, NASA has developed VITAL or the Ventilator Intervention Technology Accessible Locally.… [+2604 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "19 asteroids detected near Jupiter are thought to come from outside the solar system - Somag News", "description": "An international astronomer team thinks that the asteroids moving in an orbit around the Sun near Jupiter, due to the gravity of the Sun, actually came from outside the Solar System. Scientists from France and Brazil are working on 19 asteroids that come from…", "url": "https://www.somagnews.com/19-asteroids-detected-near-jupiter-thought-come-outside-solar-system/", "urlToImage": null, "publishedAt": "2020-04-24T21:01:00Z", "content": "An international astronomer team thinks that the asteroids moving in an orbit around the Sun near Jupiter, due to the gravity of the Sun, actually came from outside the Solar System.\r\nScientists from France and Brazil are working on 19 asteroids that come fro… [+1708 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Live: Trump Holds Meeting With NASA On Their Coronavirus Response | NBC News - NBC News", "description": "Watch as President Trump meets with NASA officials to discuss what they have accomplished during the coronavirus outbreak. » Subscribe to NBC News: http://nb...", "url": "https://www.youtube.com/watch?v=8bH5XsHNmNU", "urlToImage": null, "publishedAt": "2020-04-24T20:01:56Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coral Restoration | Education Earth - The Weather Channel", "description": "We spoke with the Georgia Aquarium about how coral reefs are being restored.", "url": "https://www.youtube.com/watch?v=2Z7x0fS8IzM", "urlToImage": null, "publishedAt": "2020-04-24T19:15:49Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ryan F. Mandelbaum", "title": "This Could Be the First Record of Someone Getting Killed by a Meteorite - Gizmodo", "description": "A team of scientists think they’ve found the oldest evidence of a meteorite striking and killing a person, according to a new report published in the journal journal Meteoritics & Planetary Science.", "url": "https://gizmodo.com/this-could-be-the-first-record-of-someone-getting-kille-1843045054", "urlToImage": null, "publishedAt": "2020-04-24T18:16:11Z", "content": "A team of scientists think theyve found the oldest evidence of a meteorite striking and killing a person, according to a new report published in the journal journal Meteoritics &amp; Planetary Science.\r\nGiven the hype around space rocks hitting Earth, there a… [+2713 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "NASA wants people to watch historic SpaceX launch from home - India TV News", "description": "Amid COVID-19 restrictions, the historic SpaceX mission to launch two NASA astronauts to the International Space Station (ISS) on May 27 is set to be a much quieter affair than it would have been", "url": "https://www.indiatvnews.com/science/nasa-spacex-launch-watch-from-home-coronavirus-611013", "urlToImage": null, "publishedAt": "2020-04-24T17:26:12Z", "content": "Image Source : AP (FILE)NASA wants people to watch historic SpaceX launch from home\r\nAmid COVID-19 restrictions, the historic SpaceX mission to launch two NASA astronauts to the International Space Station (ISS) on May 27 is set to be a much quieter affair th… [+2148 chars]"}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "First-ever digital geological map of moon released by US Geological Survey - Down To Earth Magazine", "description": "It will serve as a blue print for future human lunar missions", "url": "https://www.downtoearth.org.in/news/science-technology/first-ever-digital-geological-map-of-moon-released-by-us-geological-survey-70690", "urlToImage": null, "publishedAt": "2020-04-24T15:59:01Z", "content": "The first ever digital, unified, global, geological map of the moon was released virtually by the  United States Geological Survey (USGS), National Aeronautics and Space Administration (Nasa) and the Lunar Planetary Institute on April 22, 2020.\r\nThe map is a … [+2958 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Daniel Garcia-Castellanos", "title": "Tomanowos: The meteorite that survived mega-floods and human folly - Phys.org", "description": "The rock with arguably the most fascinating story on Earth has an ancient name: Tomanowos. It means \"the visitor from heaven\" in the extinct language of Oregon's Clackamas Indian tribe.", "url": "https://phys.org/news/2020-04-tomanowos-meteorite-survived-mega-floods-human.html", "urlToImage": null, "publishedAt": "2020-04-24T14:33:54Z", "content": "The rock with arguably the most fascinating story on Earth has an ancient name: Tomanowos. It means \"the visitor from heaven\" in the extinct language of Oregon's Clackamas Indian tribe.\r\nThe Clackamas revered the Tomanowosalso known as the Willamette meteorit… [+6709 chars]"}, {"source": {"id": null, "name": "Microbiozindia.com"}, "author": null, "title": "Scientists reestablish paralysed man's Sense of touch utilizing brain PC interface innovation - Microbioz India", "description": "While we may regularly underestimate our feeling of touch, for scientists creating advancements to reestablish appendage work in individuals incapacitated because of spinal string injury or sickness, restoring the feeling of touch is a basic piece of the proc…", "url": "https://microbiozindia.com/health-news/scientists-reestablish-paralysed-mans-sense-of-touch-utilizing-brain-pc-interface-innovation/", "urlToImage": null, "publishedAt": "2020-04-24T13:23:48Z", "content": "While we may regularly underestimate our feeling of touch, for scientists creating advancements to reestablish appendage work in individuals incapacitated because of spinal string injury or sickness, restoring the feeling of touch is a basic piece of the proc… [+4678 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "James Rodger", "title": "Bodies kept 'in industrial fridges for six days' in Birmingham after dying from coronavirus - Birmingham Live", "description": "He was kept in the fridge due to a \"300 body backlog\" after dying from Covid-19, on date which is widely believed to have been the UK's peak", "url": "https://www.birminghammail.co.uk/news/midlands-news/bodies-kept-in-industrial-fridges-18142998", "urlToImage": null, "publishedAt": "2020-04-24T11:52:15Z", "content": "Nazir Afzal, the former chief prosecutor, has claimed his brother's body was kept in an industrial fridge for days.\r\nMr Afzal said his older brother Umar, aged 71, died in Birmingham on April 8.\r\nHe was kept in the fridge due to a \"300 body backlog\" after dyi… [+1421 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "This Beautiful Fisheye Photo of Earth Taken from ISS Will Make You Appreciate the Planet More - News18", "description": "'An Earth in crisis is still an Earth worth returning to,' NASA captioned the photo by quoting astronaut Andrew R. Morgan.", "url": "https://www.news18.com/news/buzz/this-beautiful-fisheye-photo-of-earth-taken-from-iss-will-make-you-appreciate-the-planet-more-2591267.html", "urlToImage": null, "publishedAt": "2020-04-24T11:32:18Z", "content": "The National Aeronautics and Space Administration (NASA) has shared a photo on Instagram - a night view of the earth that was taken aboard the International Space Station in the year 2016.\r\nIn the wide fisheye lens view of the Earth, one can easily distinguis… [+940 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Rosie McCall", "title": "The World is Losing 9 Percent of Its Insects Every Decade, Study Finds - Newsweek", "description": "The most extensive investigation to date finds global insect numbers drop 0.92 percent a year. However, the world's freshwater insects, like mayflies, are bucking the trend and seeing numbers rise.", "url": "https://www.newsweek.com/world-9-percent-insects-decade-study-1499964", "urlToImage": null, "publishedAt": "2020-04-24T11:21:49Z", "content": "Scientists have warned that global insect populations are facing a rapidly accumulating decline in the most extensive analysis to date.\r\nResearchers sifted through more than 166 long-term surveys carried out across 1,676 sites between 1925 and 2018. The found… [+4498 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Lyrid Meteor Shower 2020 Pictures - India Times", "description": "The Lyrid meteor shower appears annually between April 16 and April 25, and tends to peak around April 22 and April 23 in India.", "url": "https://www.indiatimes.com/trending/environment/lyrid-meteor-shower-2020-pictures-511696.html", "urlToImage": null, "publishedAt": "2020-04-24T10:50:23Z", "content": "One of the most dazzling displays of shooting stars was visible in the night sky recently, and it was possible because of the considerable drop in air pollution during the lockdown, and warm weather. The Lyrid meteor shower appears annually between April 16 a… [+1048 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "IANS", "title": "Earth's Tectonic Plates Started Shifting About 3.2 Billion Years Ago: Study - The Weather Channel", "description": "Scientists looked for clues in ancient rocks from Australia and South Africa, and found that these plates were moving at least 3.2 billion years ago on the early Earth.", "url": "https://weather.com/en-IN/india/science/news/2020-04-24-earth-tectonic-plates-started-shifting-32-billion-years-ago-study", "urlToImage": null, "publishedAt": "2020-04-24T06:49:13Z", "content": "(Reto Stockli/NASA Goddard Space Flight Center)\r\nThe Earth's tectonic plates started moving more than 3.2 billion years agomuch earlier than originally thought, and just over 1.3 billion years after the Earth first formed, researchers have revealed. To date, … [+2885 chars]"}, {"source": {"id": null, "name": "Wordlift.io"}, "author": "News Desk", "title": "First successful study to detect marine plastic pollution using satellites - Geospatial World", "description": "Earth observation scientists analysed data from the European Space Agency’s Sentinel-2 satellites to develop this new approach, which demonstrates for the first time that aggregated patches of plastics floating in coastal waters can be detected by satellites", "url": "http://data.wordlift.io/wl01287/post/first_successful_study_to_detect_marine_plastic_pollution_using_satellites", "urlToImage": null, "publishedAt": "2020-04-24T06:26:00Z", "content": "A pioneering technique to detect plastics floating on the sea surface, led by scientists at Plymouth Marine Laboratory, has been published this week in Scientific Reports.\r\nEarth observation scientists analysed data from the European Space Agencys Sentinel-2 … [+3447 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Geologists have revised the timing of tectonic activity of the Earth - The Times Hub", "description": null, "url": "https://thetimeshub.in/geologists-have-revised-the-timing-of-tectonic-activity-of-the-earth/10189/", "urlToImage": null, "publishedAt": "2020-04-23T23:06:55Z", "content": "Geologists have revised the forecasts on terms of the beginning on Earth of tectonic activity. To do this, we evaluated the minerals found under the blocks of the planetary crust.\r\nThe detailed analysis helped to figure out what on Earth tectonic movement aro… [+858 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "SpaceX Starship SN4 is almost ready for its turn on the test stand - CNET", "description": "Work on the latest iteration of Elon Musk's Mars rocket is progressing rapidly despite some setbacks.", "url": "https://www.cnet.com/news/spacex-starship-sn4-prototype-is-almost-ready-for-its-turn-on-test-stand/", "urlToImage": null, "publishedAt": "2020-04-23T22:47:02Z", "content": "While many businesses in Texas are shuttered due to the COVID-19 pandemic, SpaceX has been busy assembling the latest Starship prototype at its Boca Chica development facility. The early version of Elon Musk's Mars rocket has the serial number SN4, and he sha… [+1175 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mars' seasons compared to other planets including Earth - AccuWeather", "description": "Why do we have seasons? It's because our planet is tilted on its axis just enough so that we have four seasons, as Earth continues its orbit around the Sun. ...", "url": "https://www.youtube.com/watch?v=aKQdl3blWR0", "urlToImage": null, "publishedAt": "2020-04-23T20:56:13Z", "content": "Why do we have seasons? It's because our planet is tilted on its axis just enough so that we have four seasons, as Earth continues its orbit around the Sun. But what about other planets?"}, {"source": {"id": null, "name": "Pulse2.com"}, "author": null, "title": "Elon Musk: SpaceX To Fix Brightness From Satellites - Pulse 2.0", "description": "SpaceX head Elon Musk said that the company is working on fixing the brightness of the company's Starlink satellites. These are the details.", "url": "https://pulse2.com/elon-musk-spacex-to-fix-brightness-from-satellites/", "urlToImage": null, "publishedAt": "2020-04-23T20:01:03Z", "content": "<ul><li>SpaceX head Elon Musk said that the company is working on fixing the brightness of the company’s Starlink satellites</li></ul>Elon Musk, the head of SpaceX, said that the company is working on fixing the brightness of the companys satellites. The Star… [+1298 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Hanneke Weitering", "title": "The 2020 Lyrid meteor shower thrills skywatchers. Here are the best photos. - Space.com", "description": "Behold, bits of Comet Thatcher!", "url": "https://www.space.com/lyrid-meteor-shower-2020-amateur-photos.html", "urlToImage": null, "publishedAt": "2020-04-23T19:26:00Z", "content": "Photographer Timothy Wenzel created this composite of six Lyrid meteor photos he captured from Midland, Michigan, in the early morning hours of April 22, 2020.  (Image credit: Courtesy of Timothy Wenzel)\r\nThe annual Lyrid meteor shower put on an exceptional s… [+6160 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Rosie McCall", "title": "Levels of Ocean Biodiversity Have Barely Changed for Hundreds of Millions of Years, Scientists Say - Newsweek", "description": "Scientists have analyzed fossils from the Cambrian explosion 540 million years ago to the present day to explore levels of marine biodiversity over time.", "url": "https://www.newsweek.com/levels-ocean-biodiversity-remained-stable-hundred-1499842", "urlToImage": null, "publishedAt": "2020-04-23T18:10:25Z", "content": "Levels of biodiversity in the world's oceans have remained virtually unchanged for hundreds of millions of years, according to a new study published in Science.\r\nThe conclusion that marine biodiversity has stayed stable over time and not mushroomed over the l… [+3686 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Doyle Rice", "title": "Heavy rain triggered the 2018 eruption of Hawaii's Kilauea volcano, study suggests - USA TODAY", "description": "Scientists say that the eruption was likely initiated by prolonged, and at times extreme, rainfall in the months leading up to the event.", "url": "https://www.usatoday.com/story/news/nation/2020/04/23/kilauea-volcano-eruption-study-says-heavy-rain-triggered-eruption/3011752001/", "urlToImage": null, "publishedAt": "2020-04-23T17:35:36Z", "content": "<ul><li>In May 2018, Hawaiis Kilauea volcano let loose its largest eruption in 200 years.</li><li>Prior to the eruption, Hawaii had several months of unusually high amounts of precipitation.</li><li>This \"could go a long way towards advanced warning of associ… [+3040 chars]"}, {"source": {"id": null, "name": "Labmanager.com"}, "author": null, "title": "Rebuilding the Bridge between Neuroscience and AI - Lab Manager Magazine", "description": "Neuroscience and Artificial Intelligence", "url": "https://www.labmanager.com/news/rebuilding-the-bridge-between-neuroscience-and-ai-22452", "urlToImage": null, "publishedAt": "2020-04-23T17:35:26Z", "content": "The origin of machine and deep learning algorithms, which increasingly affect almost all aspects of our life, is the learning mechanism of synaptic (weight) strengths connecting neurons in our brain. Attempting to imitate these brain functions, researchers br… [+2926 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "The Florida Aquarium just made a breakthrough that will help save the third largest coral reef in the world - CNN", "description": "Ridged cactus coral are just one of a variety of species rescued from Florida's waters after coral reefs in the state began undergoing a major disease outbreak that started in 2014. The aquarium has successfully reproduced them in human care.", "url": "https://www.cnn.com/2020/04/22/us/florida-aquarium-first-reproduce-ridhed-cactus-coral-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-23T15:05:48Z", "content": null}, {"source": {"id": "xinhua-net", "name": "Xinhua Net"}, "author": null, "title": "Israeli, German astronomers find origin of Arrokoth object at edge of solar system - Xinhua | English.news.cn - Xinhua", "description": null, "url": "http://www.xinhuanet.com/english/2020-04/23/c_139002724.htm", "urlToImage": null, "publishedAt": "2020-04-23T14:56:37Z", "content": "JERUSALEM, April 23 (Xinhua) -- Israeli and German scientists have developed a model that explains the unique formation and properties of Arrokoth, the most distant object ever imaged in the solar system, the northern Israel Institute of Technology (Technion)… [+1221 chars]"}]}