{"status": "ok", "totalResults": 32, "articles": [{"source": {"id": null, "name": "Republicworld.com"}, "author": "Prerna Vijayeni Panda", "title": "NASA celebrates 30 years and 1.4 million observations of Hubble with Cosmic Coral Reef - Republic World - Republic World", "description": "With yet another stunning portrait of cosmic phenomena, NASA celebrated the 30th anniversary of it's prized Hubble Space Telescope with an iconic new image.", "url": "https://www.republicworld.com/technology-news/science/nasa-marks-30-years-and-1-dot-4-million-observations-of-hubble-telescope.html", "urlToImage": null, "publishedAt": "2020-04-25T03:30:36Z", "content": "With yet another stunning portrait of cosmic phenomena, NASA celebrated the 30th launch anniversary of it's prized Hubble Space Telescope by unveiling an iconic new image a firestorm of star birth in a neighboring galaxy. \r\nIn the latest Hubble image shared b… [+2121 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Prerna Vijayeni Panda", "title": "NASA shares sparkling night view of Earth from space with endearing message amid pandemic - Republic World - Republic World", "description": "While the world is struggling against the coronavirus pandemic, 'an Earth in crisis is still an Earth worth returning to' for the astronauts serving on the ISS.", "url": "https://www.republicworld.com/technology-news/science/nasa-shares-sparkling-night-view-of-earth-from-space-amid-pandemic.html", "urlToImage": null, "publishedAt": "2020-04-25T02:11:22Z", "content": "While the world is struggling to overcome the chaotic impacts of the coronavirus pandemic, 'an Earth in crisis is still an Earth worth returning to' for the astronauts serving on the International Space Station (ISS). Quoting NASA Astronaut Andrew Morgan in t… [+1661 chars]"}, {"source": {"id": null, "name": "Gizbot.com"}, "author": "Sharmishte Datti", "title": "NASA VITAL Prototype Ventilators To Help Fight COVID-19 Pandemic - Gizbot", "description": "In a bid to help the coronavirus infected, NASA has announced that it has successfully developed a prototype ventilator for the treatment of coronavirus patients. For this, NASA has developed VITAL or the Ventilator Intervention Technology Accessible Locally.", "url": "https://www.gizbot.com/news/covid-19-pandemic-nasa-builds-prototype-ventilators-067269.html", "urlToImage": null, "publishedAt": "2020-04-25T02:00:00Z", "content": "In a bid to help the coronavirus infected, NASA has announced that it has successfully developed a prototype ventilator for the treatment of coronavirus patients. For this, NASA has developed VITAL or the Ventilator Intervention Technology Accessible Locally.… [+2604 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Charles Q. Choi", "title": "Mystery of Venus atmosphere's weird rotation may finally be solved - Space.com", "description": "Thermal tides in the atmosphere make it rotate faster than the planet's surface, a new study finds.", "url": "https://www.space.com/venus-atmosphere-super-rotation-mystery-solved.html", "urlToImage": null, "publishedAt": "2020-04-24T21:59:00Z", "content": "The mystery behind why the atmosphere of Venus spins much faster than the planet's surface may finally be solved, a new study finds.\r\nThe finding might help shed light on how habitable distant exoplanets, or worlds beyond our solar system, may actually be, re… [+3613 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NASA Science Live: Asteroid Close Approach - NASA", "description": "Have you heard about an asteroid close-approach happening on April 29? Asteroid 1998 OR2 poses no threat to our planet, but we can still learn a lot by study...", "url": "https://www.youtube.com/watch?v=eiS8EPOL488", "urlToImage": null, "publishedAt": "2020-04-24T21:46:31Z", "content": "Have you heard about an asteroid close-approach happening on April 29? Asteroid 1998 OR2 poses no threat to our planet, but we can still learn a lot by studying it. Don't miss a special Planetary Defense episode of NASA Science Live on Monday, April 27 at 3:0… [+83 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coral Restoration | Education Earth - The Weather Channel", "description": "We spoke with the Georgia Aquarium about how coral reefs are being restored.", "url": "https://www.youtube.com/watch?v=2Z7x0fS8IzM", "urlToImage": null, "publishedAt": "2020-04-24T19:15:49Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ryan F. Mandelbaum", "title": "This Could Be the First Record of Someone Getting Killed by a Meteorite - Gizmodo", "description": "A team of scientists think they’ve found the oldest evidence of a meteorite striking and killing a person, according to a new report published in the journal journal Meteoritics & Planetary Science.", "url": "https://gizmodo.com/this-could-be-the-first-record-of-someone-getting-kille-1843045054", "urlToImage": null, "publishedAt": "2020-04-24T18:16:11Z", "content": "A team of scientists think theyve found the oldest evidence of a meteorite striking and killing a person, according to a new report published in the journal journal Meteoritics &amp; Planetary Science.\r\nGiven the hype around space rocks hitting Earth, there a… [+2713 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "NASA wants people to watch historic SpaceX launch from home - India TV News", "description": "Amid COVID-19 restrictions, the historic SpaceX mission to launch two NASA astronauts to the International Space Station (ISS) on May 27 is set to be a much quieter affair than it would have been", "url": "https://www.indiatvnews.com/science/nasa-spacex-launch-watch-from-home-coronavirus-611013", "urlToImage": null, "publishedAt": "2020-04-24T17:26:12Z", "content": "Image Source : AP (FILE)NASA wants people to watch historic SpaceX launch from home\r\nAmid COVID-19 restrictions, the historic SpaceX mission to launch two NASA astronauts to the International Space Station (ISS) on May 27 is set to be a much quieter affair th… [+2148 chars]"}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "First-ever digital geological map of moon released by US Geological Survey - Down To Earth Magazine", "description": "It will serve as a blue print for future human lunar missions", "url": "https://www.downtoearth.org.in/news/science-technology/first-ever-digital-geological-map-of-moon-released-by-us-geological-survey-70690", "urlToImage": null, "publishedAt": "2020-04-24T15:59:01Z", "content": "The first ever digital, unified, global, geological map of the moon was released virtually by the  United States Geological Survey (USGS), National Aeronautics and Space Administration (Nasa) and the Lunar Planetary Institute on April 22, 2020.\r\nThe map is a … [+2958 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Daniel Garcia-Castellanos", "title": "Tomanowos: The meteorite that survived mega-floods and human folly - Phys.org", "description": "The rock with arguably the most fascinating story on Earth has an ancient name: Tomanowos. It means \"the visitor from heaven\" in the extinct language of Oregon's Clackamas Indian tribe.", "url": "https://phys.org/news/2020-04-tomanowos-meteorite-survived-mega-floods-human.html", "urlToImage": null, "publishedAt": "2020-04-24T14:33:54Z", "content": "The rock with arguably the most fascinating story on Earth has an ancient name: Tomanowos. It means \"the visitor from heaven\" in the extinct language of Oregon's Clackamas Indian tribe.\r\nThe Clackamas revered the Tomanowosalso known as the Willamette meteorit… [+6709 chars]"}, {"source": {"id": null, "name": "Microbiozindia.com"}, "author": null, "title": "Scientists reestablish paralysed man's Sense of touch utilizing brain PC interface innovation - Microbioz India", "description": "While we may regularly underestimate our feeling of touch, for scientists creating advancements to reestablish appendage work in individuals incapacitated because of spinal string injury or sickness, restoring the feeling of touch is a basic piece of the proc…", "url": "https://microbiozindia.com/health-news/scientists-reestablish-paralysed-mans-sense-of-touch-utilizing-brain-pc-interface-innovation/", "urlToImage": null, "publishedAt": "2020-04-24T13:23:48Z", "content": "While we may regularly underestimate our feeling of touch, for scientists creating advancements to reestablish appendage work in individuals incapacitated because of spinal string injury or sickness, restoring the feeling of touch is a basic piece of the proc… [+4678 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Prabhjote Gill", "title": "There are 19 interstellar asteroids between Jupiter and Neptune ⁠— and even computers can’t predict where they - Business Insider India", "description": "Oumuamua and Borisov weren’t the first interstellar asteroids to visit our solar system. Scientists have discovered 19 news asteroids hiding in the space between", "url": "https://www.businessinsider.in/science/space/news/there-are-19-interstellar-asteroids-between-jupiter-and-neptune-and-even-computers-cant-predict-where-they-are-headed/articleshow/75350530.cms", "urlToImage": null, "publishedAt": "2020-04-24T11:53:00Z", "content": "Interstellar asteroids — asteroids from outside our solar system — may not be as rare as we once thought they were. An entire population was discovered between Jupiter and Neptune. \r\nThe Centaur family of asteroids roam the space between the two gas giants bu… [+2712 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "James Rodger", "title": "Bodies kept 'in industrial fridges for six days' in Birmingham after dying from coronavirus - Birmingham Live", "description": "He was kept in the fridge due to a \"300 body backlog\" after dying from Covid-19, on date which is widely believed to have been the UK's peak", "url": "https://www.birminghammail.co.uk/news/midlands-news/bodies-kept-in-industrial-fridges-18142998", "urlToImage": null, "publishedAt": "2020-04-24T11:52:15Z", "content": "Nazir Afzal, the former chief prosecutor, has claimed his brother's body was kept in an industrial fridge for days.\r\nMr Afzal said his older brother Umar, aged 71, died in Birmingham on April 8.\r\nHe was kept in the fridge due to a \"300 body backlog\" after dyi… [+1421 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "This Beautiful Fisheye Photo of Earth Taken from ISS Will Make You Appreciate the Planet More - News18", "description": "'An Earth in crisis is still an Earth worth returning to,' NASA captioned the photo by quoting astronaut Andrew R. Morgan.", "url": "https://www.news18.com/news/buzz/this-beautiful-fisheye-photo-of-earth-taken-from-iss-will-make-you-appreciate-the-planet-more-2591267.html", "urlToImage": null, "publishedAt": "2020-04-24T11:32:18Z", "content": "The National Aeronautics and Space Administration (NASA) has shared a photo on Instagram - a night view of the earth that was taken aboard the International Space Station in the year 2016.\r\nIn the wide fisheye lens view of the Earth, one can easily distinguis… [+940 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Lyrid Meteor Shower 2020 Pictures - India Times", "description": "The Lyrid meteor shower appears annually between April 16 and April 25, and tends to peak around April 22 and April 23 in India.", "url": "https://www.indiatimes.com/trending/environment/lyrid-meteor-shower-2020-pictures-511696.html", "urlToImage": null, "publishedAt": "2020-04-24T10:50:23Z", "content": "One of the most dazzling displays of shooting stars was visible in the night sky recently, and it was possible because of the considerable drop in air pollution during the lockdown, and warm weather. The Lyrid meteor shower appears annually between April 16 a… [+1048 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "China names its Mars mission Tianwen-1 ahead of its planned launch this year - The Hindu", "description": "Aiming to catch up with India, U.S., Russia and the European Union to reach the red planet, China’s Mars mission plans to complete orbiting, landing and roving in one mission", "url": "https://www.thehindu.com/news/international/china-names-its-mars-mission-tianwen-1-ahead-of-its-planned-launch-this-year/article31422712.ece", "urlToImage": null, "publishedAt": "2020-04-24T08:40:02Z", "content": "China on Friday named its first Mars exploration mission to be launched later this year as Tianwen-1 as it celebrated Space Day to mark the 50th anniversary of the launch of the countrys first satellite Dong Fang Hong-1 in 1970.\r\n Aiming to catch up with Indi… [+3236 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "IANS", "title": "Earth's Tectonic Plates Started Shifting About 3.2 Billion Years Ago: Study - The Weather Channel", "description": "Scientists looked for clues in ancient rocks from Australia and South Africa, and found that these plates were moving at least 3.2 billion years ago on the early Earth.", "url": "https://weather.com/en-IN/india/science/news/2020-04-24-earth-tectonic-plates-started-shifting-32-billion-years-ago-study", "urlToImage": null, "publishedAt": "2020-04-24T06:49:13Z", "content": "(Reto Stockli/NASA Goddard Space Flight Center)\r\nThe Earth's tectonic plates started moving more than 3.2 billion years agomuch earlier than originally thought, and just over 1.3 billion years after the Earth first formed, researchers have revealed. To date, … [+2885 chars]"}, {"source": {"id": null, "name": "Wordlift.io"}, "author": "News Desk", "title": "First successful study to detect marine plastic pollution using satellites - Geospatial World", "description": "Earth observation scientists analysed data from the European Space Agency’s Sentinel-2 satellites to develop this new approach, which demonstrates for the first time that aggregated patches of plastics floating in coastal waters can be detected by satellites", "url": "http://data.wordlift.io/wl01287/post/first_successful_study_to_detect_marine_plastic_pollution_using_satellites", "urlToImage": null, "publishedAt": "2020-04-24T06:26:00Z", "content": "A pioneering technique to detect plastics floating on the sea surface, led by scientists at Plymouth Marine Laboratory, has been published this week in Scientific Reports.\r\nEarth observation scientists analysed data from the European Space Agencys Sentinel-2 … [+3447 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "SpaceX Starship SN4 is almost ready for its turn on the test stand - CNET", "description": "Work on the latest iteration of Elon Musk's Mars rocket is progressing rapidly despite some setbacks.", "url": "https://www.cnet.com/news/spacex-starship-sn4-prototype-is-almost-ready-for-its-turn-on-test-stand/", "urlToImage": null, "publishedAt": "2020-04-23T22:47:02Z", "content": "While many businesses in Texas are shuttered due to the COVID-19 pandemic, SpaceX has been busy assembling the latest Starship prototype at its Boca Chica development facility. The early version of Elon Musk's Mars rocket has the serial number SN4, and he sha… [+1175 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mars' seasons compared to other planets including Earth - AccuWeather", "description": "Why do we have seasons? It's because our planet is tilted on its axis just enough so that we have four seasons, as Earth continues its orbit around the Sun. ...", "url": "https://www.youtube.com/watch?v=aKQdl3blWR0", "urlToImage": null, "publishedAt": "2020-04-23T20:56:13Z", "content": "Why do we have seasons? It's because our planet is tilted on its axis just enough so that we have four seasons, as Earth continues its orbit around the Sun. But what about other planets?"}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Jeremy Wilks", "title": "Elon Musk's Starlink internet-from-space satellites leave astronomers 'frustrated' - Euronews", "description": "\"I'm a bit afraid of our future view of the night sky when there are 10,000 of them in orbit,\" said German amateur astrophotographer Marcel Nowaczyk.", "url": "https://www.euronews.com/2020/04/23/elon-musk-s-starlink-internet-from-space-satellites-leave-astronomers-frustrated", "urlToImage": null, "publishedAt": "2020-04-23T18:54:32Z", "content": null}, {"source": {"id": null, "name": "Nationalheraldindia.com"}, "author": "IANS", "title": "Tectonic plates started shifting 3.2 billion years ago: Study - National Herald", "description": "Earth’s tectonic plates started moving more than 3.2 billion years ago - just over 1.3 billion years after the Earth first formed and earlier than originally thought, researchers have revealed.", "url": "https://www.nationalheraldindia.com/science-tech/tectonic-plates-started-shifting-32-billion-years-ago-study", "urlToImage": null, "publishedAt": "2020-04-23T18:18:03Z", "content": "For the study, members of the project travelled to Pilbara Craton in Western Australia. A craton is a primordial, thick, and very stable piece of crust. They are usually found in the middle of tectonic plates and are the ancient hearts of the Earth's continen… [+408 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Rosie McCall", "title": "Levels of Ocean Biodiversity Have Barely Changed for Hundreds of Millions of Years, Scientists Say - Newsweek", "description": "Scientists have analyzed fossils from the Cambrian explosion 540 million years ago to the present day to explore levels of marine biodiversity over time.", "url": "https://www.newsweek.com/levels-ocean-biodiversity-remained-stable-hundred-1499842", "urlToImage": null, "publishedAt": "2020-04-23T18:10:25Z", "content": "Levels of biodiversity in the world's oceans have remained virtually unchanged for hundreds of millions of years, according to a new study published in Science.\r\nThe conclusion that marine biodiversity has stayed stable over time and not mushroomed over the l… [+3686 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Doyle Rice", "title": "Heavy rain triggered the 2018 eruption of Hawaii's Kilauea volcano, study suggests - USA TODAY", "description": "Scientists say that the eruption was likely initiated by prolonged, and at times extreme, rainfall in the months leading up to the event.", "url": "https://www.usatoday.com/story/news/nation/2020/04/23/kilauea-volcano-eruption-study-says-heavy-rain-triggered-eruption/3011752001/", "urlToImage": null, "publishedAt": "2020-04-23T17:35:36Z", "content": "<ul><li>In May 2018, Hawaiis Kilauea volcano let loose its largest eruption in 200 years.</li><li>Prior to the eruption, Hawaii had several months of unusually high amounts of precipitation.</li><li>This \"could go a long way towards advanced warning of associ… [+3040 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "The Florida Aquarium just made a breakthrough that will help save the third largest coral reef in the world - CNN", "description": "Ridged cactus coral are just one of a variety of species rescued from Florida's waters after coral reefs in the state began undergoing a major disease outbreak that started in 2014. The aquarium has successfully reproduced them in human care.", "url": "https://www.cnn.com/2020/04/22/us/florida-aquarium-first-reproduce-ridhed-cactus-coral-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-23T15:05:48Z", "content": null}, {"source": {"id": "xinhua-net", "name": "Xinhua Net"}, "author": null, "title": "Israeli, German astronomers find origin of Arrokoth object at edge of solar system - Xinhua | English.news.cn - Xinhua", "description": null, "url": "http://www.xinhuanet.com/english/2020-04/23/c_139002724.htm", "urlToImage": null, "publishedAt": "2020-04-23T14:56:37Z", "content": "JERUSALEM, April 23 (Xinhua) -- Israeli and German scientists have developed a model that explains the unique formation and properties of Arrokoth, the most distant object ever imaged in the solar system, the northern Israel Institute of Technology (Technion)… [+1221 chars]"}, {"source": {"id": null, "name": "News-medical.net"}, "author": null, "title": "Scientists demonstrate new brain-inspired learning mechanism - News-Medical.Net", "description": "The origin of machine and deep learning algorithms, which increasingly affect almost all aspects of our life, is the learning mechanism of synaptic (weight) strengths connecting neurons in our brain.", "url": "https://www.news-medical.net/news/20200423/Scientists-demonstrate-new-brain-inspired-learning-mechanism.aspx", "urlToImage": null, "publishedAt": "2020-04-23T14:09:18Z", "content": "The origin of machine and deep learning algorithms, which increasingly affect almost all aspects of our life, is the learning mechanism of synaptic (weight) strengths connecting neurons in our brain.\r\nAttempting to imitate these brain functions, researchers b… [+3127 chars]"}, {"source": {"id": null, "name": "Gizbot.com"}, "author": "Sandeep Sarkar", "title": "Lyrid Meteor Shower Entertaining Stargazers Amid Coronavirus Lockdown - Gizbot", "description": "The Lyrids meteor shower is the collective of dust and rocks which are shot by the come C/1861 G (Thatcher) which orbits the sun every 415 years. This event is annual and the sky is the host for this show every year in April.", "url": "https://www.gizbot.com/news/lyrid-meteor-shower-entertaining-stargazers-amid-coronavirus-lockdown-067240.html", "urlToImage": null, "publishedAt": "2020-04-23T12:40:49Z", "content": "April 2020 seems to be the month for celestial-night shows. Post the Brightest Super Pink Moon, the universe is being a center stage for Lyrid meteor shower. This is the annual Lyrid meteor shower which has started on Thursday (April 16) is expected to last f… [+1810 chars]"}, {"source": {"id": null, "name": "Newkerala.com"}, "author": null, "title": "Galaxies grow fat on the flesh of their neighbours | newkerala.com #71550 - New Kerala", "description": "A new research led by Indian origin researcher Dr Anshu Gupta, has revealed that galaxies grow large by eating their smaller neighbours....", "url": "https://www.newkerala.com/news/2020/71550.htm", "urlToImage": null, "publishedAt": "2020-04-23T11:27:21Z", "content": "Exactly how massive galaxies attain their size is poorly understood, not least because they swell over billions of years.But now a combination of observation and modelling from researchers led by Dr. Anshu Gupta from Australia's ARC Centre of Excellence for A… [+2382 chars]"}, {"source": {"id": null, "name": "Physicsworld.com"}, "author": null, "title": "'Exoplanet' discovery vanishes in a puff of dust - physicsworld.com", "description": "Object designated as Formalhaut b in 2008 is more likely to be the remnants of a catastrophic collision between comet-like bodies, astronomers say", "url": "https://physicsworld.com/a/exoplanet-discovery-vanishes-in-a-puff-of-dust/", "urlToImage": null, "publishedAt": "2020-04-23T10:43:12Z", "content": "The exoplanet that wasn't: An object orbiting the star Fomalhaut may be the debris field from a collision of two 200 km-wide icy, dusty bodies, not an exoplanet as previously thought. (Courtesy: ESA, NASA and M Kornmesser)\r\nAn enigmatic object once thought to… [+2873 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "The First, Chilling Images Of Earth! - Science - Mashable India", "description": "When the Allies vanquished Nazi Germany in 1945, the U.S. captured many of the Germans' powerful V-2 rockets which, after translation, is short for \"Vengeance Weapon Two.\"\nThose seized rockets didn't stay in Europe for long. After being transported across the…", "url": "https://in.mashable.com/science/13418/the-first-chilling-images-of-earth", "urlToImage": null, "publishedAt": "2020-04-23T07:00:00Z", "content": "When the Allies vanquished Nazi Germany in 1945, the U.S. captured many of the Germans' powerful V-2 rockets which, after translation, is short for \"Vengeance Weapon Two.\"\r\nThose seized rockets didn't stay in Europe for long. After being transported across th… [+7037 chars]"}]}