{"status": "ok", "totalResults": 39, "articles": [{"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Super Flower Moon 2020: Last ‘supermoon’ of the year is truly amazing! Check images - The Financial Express", "description": "Super Flower Moon 2020: Scintillating images of the full moon, also a 'supermoon', are being shared from across the world.", "url": "https://www.financialexpress.com/lifestyle/super-flower-moon-2020-last-supermoon-of-the-year-is-truly-amazing-check-images/1951587/", "urlToImage": "https://images.financialexpress.com/2020/05/moon1-660.jpg", "publishedAt": "2020-05-07T16:34:43Z", "content": "Super Flower Moon 2020: There’s an ongoing debate between experts whether the full moon on Thursday, May 7, 2020, will be the final ‘supermoon’ of the year or not. It is the last ‘supermoon’ or not, maybe up for debate, but going by the images of the full moo… [+881 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Rosie McCall", "title": "200-Million-Year-Old Fossil Shows Squid Ancestor Attacking Prey - Newsweek", "description": "Predator-prey attacks like these are rarely seen on the fossil record and offer a snapshot in time during the Sinemurian period.", "url": "https://www.newsweek.com/200-million-year-old-fossi-squid-ancestor-prey-1502597", "urlToImage": "https://d.newsweek.com/en/full/1588083/fossil-clarkeiteuthis-montefiorei-fish-2.jpg", "publishedAt": "2020-05-07T16:02:03Z", "content": "A 200-million-year-old fossil from Britain's Jurassic Coast may be the oldest known example of a \"squid-like\" creature attacking a fish in existence, say scientists at the country's University of Portsmouth.\r\nThe creature in question is a species of cephalopo… [+3903 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NASA Celebrates Mothers of Michoud in Honor of Mother's Day - NASA's Marshall Space Flight Center", "description": "In celebration of Mother’s Day, NASA’s Michoud Assembly Facility in New Orleans partnered with children of the workforce to recognize the women working on th...", "url": "https://www.youtube.com/watch?v=wa54Hym83AU", "urlToImage": "https://i.ytimg.com/vi/wa54Hym83AU/maxresdefault.jpg", "publishedAt": "2020-05-07T15:30:32Z", "content": "In celebration of Mothers Day, NASAs Michoud Assembly Facility in New Orleans partnered with children of the workforce to recognize the women working on the mother of all rockets, NASAs powerful Space Launch System (SLS). The rocket, along with NASAs Orion sp… [+656 chars]"}, {"source": {"id": null, "name": "Zeebiz.com"}, "author": "PTI", "title": "Chinas experimental spaceship works normally in orbit - Zee Business", "description": "Chinas new-generation spaceship launched earlier in the week is working normally in orbit after completing a series of planned operations, space authorities said on Thursday", "url": "https://www.zeebiz.com/world/news-chinas-experimental-spaceship-works-normally-in-orbit-126248", "urlToImage": "https://cdn.zeebiz.com/sites/default/files/2020/05/07/118392-china-spaceship-reuters.jpg", "publishedAt": "2020-05-07T14:22:17Z", "content": "China's new-generation spaceship launched earlier in the week is working normally in orbit after completing a series of planned operations, space authorities said on Thursday. The experimental spaceship was launched without crew by China's new large carrier r… [+1227 chars]"}, {"source": {"id": null, "name": "Brobible.com"}, "author": "Douglas Charles", "title": "Heads Up, There Is An 1,100 Foot Wide Asteroid Heading Our Way And It’s Going To Get Very, Very Close - BroBible", "description": "Mark your calendars. April 13, 2029. That’s the day a…", "url": "https://brobible.com/culture/article/1100-foot-wide-apophis-asteroid-2029/", "urlToImage": "https://brobible.files.wordpress.com/2020/05/1100-foot-wide-apophis-asteroid-heading-towards-earth-in-2029.jpg?quality=90&w=650", "publishedAt": "2020-05-07T13:25:26Z", "content": "iStockphoto\r\nMark your calendars. April 13, 2029. That’s the day a monstrous 1,100 foot wide asteroid is going to go zooming by Earth at a rather alarmingly close distance from the planet.\r\nIn fact, when asteroid 99942 Apophis (2004 MN4) buzzes our planet it … [+3929 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "Engineers created pure red LEDs from nitride crystals - Tech Explorist", "description": "Scientists created pure red LEDs by creating a reactor with extra indium vapor above the crystal's surface, a process known as metalorganic vapor-phase deposition.", "url": "https://www.techexplorist.com/engineers-created-pure-red-leds-nitride-crystals/32131/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/05/MOCVD-machine.jpg", "publishedAt": "2020-05-07T12:54:41Z", "content": "Pure red LEDs are essential for building the next generation of energy-efficient micro-LED displays to follow OLED displays and for creating lighting with color tuning.\r\nCreating pure red LEDs from nitride crystals is a challenging task for engineers. Now, fo… [+1678 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "State-of-the-art lasers at the micro level - Phys.org", "description": "Many emerging technologies rely on high-quality lasers. Laser-based LiDAR sensors can provide highly accurate scans of three-dimensional spaces, and as such are crucial in applications ranging from autonomous vehicles to geological mapping technologies and em…", "url": "https://phys.org/news/2020-05-state-of-the-art-lasers-micro.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/2-stateofthear.jpg", "publishedAt": "2020-05-07T12:44:51Z", "content": "Many emerging technologies rely on high-quality lasers. Laser-based LiDAR sensors can provide highly accurate scans of three-dimensional spaces, and as such are crucial in applications ranging from autonomous vehicles to geological mapping technologies and em… [+1866 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Jason Murdock", "title": "Kremlin Says Trump's Moon-Mining 'Artemis Accords' Plans Need 'Analysis' - Newsweek", "description": "Kremlin spokesperson Dmitry Peskov told reporters authorities are aware of the draft proposals but stressed they will need \"thorough analysis... from the existing international law standpoint.\"", "url": "https://www.newsweek.com/russia-kremlin-artemis-accords-donald-trump-draft-space-moon-mining-proposals-1502528", "urlToImage": "https://d.newsweek.com/en/full/1588001/moon.jpg", "publishedAt": "2020-05-07T12:08:12Z", "content": "Draft proposals from the Trump administration about mining on the moon need to be reviewed to ensure they comply with law, Kremlin officials say.\r\nKremlin spokesperson Dmitry Peskov told reporters yesterday authorities are aware of the so-called \"Artemis Acco… [+2847 chars]"}, {"source": {"id": null, "name": "Interestingengineering.com"}, "author": "Fabienne Lang", "title": "The Moon Vanished in 1110, Scientists May Now Know Why - Interesting Engineering", "description": "Almost a millennium ago, the night sky turned dark as the Moon disappeared from view, scientists may now have the answer as to why this phenomenon occurred.", "url": "https://interestingengineering.com/the-moon-vanished-in-1110-scientists-may-now-know-why", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/1L6okoEq6P/sizes/untitled-design-2020-05-07t142259419_md.jpg", "publishedAt": "2020-05-07T11:55:02Z", "content": "Imagine a night sky without the bright, guiding light of the Moon. Now imagine that lasting for months, perhaps even years. This is what happened almost a millennium ago, in 1110, and now, scientists may have the reasons as to what caused this strange phenome… [+2469 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "We Finally Know Why the North Magnetic Pole Has Been Drifting All These Years - News18", "description": "The North Magnetic pole is located where the field lines go perpendicular to the surface.", "url": "https://www.news18.com/news/buzz/we-finally-know-why-the-north-magnetic-pole-has-been-drifting-all-these-years-2610021.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/05/1588851285_untitled-design-2020-05-07t170440.064.jpg", "publishedAt": "2020-05-07T11:36:16Z", "content": "For years now, the north magnetic pole has been drifting away from Canada and inching towards Siberia. Scientists from Europe have come with an explanation now.\r\nA group of researchers from Leeds University are of the opinion that change in the flow of molten… [+1219 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "The closest black hole yet discovered is a mere 1,000 lightyears away, reveals ESO study - Firstpost", "description": "This is one of the very first stellar-mass black holes that does not interact violently with its environment and appear truly black.", "url": "https://www.firstpost.com/tech/science/the-closest-black-hole-yet-discovered-is-a-mere-1000-lightyears-away-reveals-eso-study-8343671.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/05/eso2007a-1.jpg", "publishedAt": "2020-05-07T11:33:31Z", "content": "FP TrendingMay 07, 2020 16:50:51 IST\r\nThe European Southern Observatory (ESO) has announced that it has discovered a black hole just 1,000 light-years away from Earth. Astronomers were studying the double star system HR 6819 when they found the black hole hid… [+1804 chars]"}, {"source": {"id": null, "name": "Themoscowtimes.com"}, "author": "The Moscow Times", "title": "Russia's Spaceflight Chief With Coronavirus Dies After Sending Off Astronauts - The Moscow Times", "description": "Putin said Yevgeny Mikrin had made an “invaluable” contribution to Russia’s space program during his life.", "url": "https://www.themoscowtimes.com/2020/05/07/russias-spaceflight-chief-with-coronavirus-dies-after-sending-off-astronauts-a70209", "urlToImage": "https://static.themoscowtimes.com/image/1360/63/TASS31264686.jpg", "publishedAt": "2020-05-07T11:14:25Z", "content": "The head of Russia’s human spaceflight program who contracted the coronavirus has died at age 65, the national space agency Roscosmos announced Tuesday.\r\nYevgeny Mikrin, designer general of the Energia aerospace and defense corporation, died weeks after atten… [+1441 chars]"}, {"source": {"id": null, "name": "Kalingatv.com"}, "author": "IANS", "title": "Unlike 'Jurassic Park' movie, real Velociraptors did not hunt in packs - Kalinga TV", "description": "New York: It appears that famous movie on dinosaurs the 'Jurassic Park' may have got it all wrong as the Velociraptor dinosaurs did not hunt in packs, says a new study.The raptors (Deinonychus antirrhopus) with their sickle-shaped talons were made fa", "url": "https://kalingatv.com/miscellany/unlike-jurassic-park-movie-real-velociraptors-did-not-hunt-in-packs/", "urlToImage": "https://cdn.kalingatv.com/wp-content/uploads/2020/05/velicoptor.jpg", "publishedAt": "2020-05-07T10:00:00Z", "content": "New York: It appears that famous movie on dinosaurs the ‘Jurassic Park’ may have got it all wrong as the Velociraptor dinosaurs did not hunt in packs, says a new study.\r\nThe raptors (Deinonychus antirrhopus) with their sickle-shaped talons were made famous in… [+3111 chars]"}, {"source": {"id": null, "name": "Indiaeducationdiary.in"}, "author": null, "title": "NASA TV to Air Northrop Grumman’s Cygnus Departure from Space Station - India Education Diary", "description": "Nearly three months after delivering several tons of supplies and scientific experiments to the International Space Station, Northrup Grumman’s unpiloted Cygnus cargo craft is scheduled to depart t…", "url": "https://indiaeducationdiary.in/nasa-tv-to-air-northrop-grummans-cygnus-departure-from-space-station/", "urlToImage": "https://i2.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/04/NASA.jpg?fit=1200%2C675&ssl=1", "publishedAt": "2020-05-07T05:16:58Z", "content": "Nearly three months after delivering several tons of supplies and scientific experiments to the International Space Station, Northrup Grummans unpiloted Cygnus cargo craft is scheduled to depart the International Space Station on Monday, May 11.\r\nLive coverag… [+1076 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Christopher Woody", "title": "Mysterious X-37B Space Plane Is Returning to Orbit, And For Once We're Being Told Why - ScienceAlert", "description": "The X-37B has already spent nearly eight years in space, and it is headed back on its sixth mission on May 16.", "url": "https://www.businessinsider.com/missions-experiments-for-space-force-mysterious-x-37b-space-plane-2020-5", "urlToImage": "https://i.insider.com/5dc97f233afd377e2a4f8083?width=1200&format=jpeg", "publishedAt": "2020-05-07T01:42:27Z", "content": "The US military's X-37B space plane is heading back into space in mid-May, and while the Air Force doesn't often say much about the mysterious aircraft, the service's top civilian outlined what it will be doing this time around.\r\n\"The Air Force's Rapid Capabi… [+4368 chars]"}, {"source": {"id": null, "name": "Geekwire.com"}, "author": "https://www.facebook.com/alan.boyle", "title": "Space Force will test solar power transmission during X-37B space plane’s next mystery flight - GeekWire", "description": "When a Boeing-built X-37B space plane is sent into orbit this month, it will try out a technology that’s been more than a decade in the making: space-based solar power.", "url": "https://www.geekwire.com/2020/space-force-will-test-solar-power-transmission-x-37b-space-planes-next-mystery-flight/", "urlToImage": "https://cdn.geekwire.com/wp-content/uploads/2020/05/200506-x37b-1260x840.jpg", "publishedAt": "2020-05-07T00:34:26Z", "content": "The Pentagons X-37B space plane is encapsulated within the payload fairing of its Atlas 5 launch vehicle. (Boeing Photo)\r\nWhen a Boeing-built X-37B space plane is sent into orbit this month for the test programs sixth flight, it will try out a technology that… [+3606 chars]"}, {"source": {"id": null, "name": "Theweek.in"}, "author": null, "title": "Scientists explain greater stability of temperatures in the tropics - THE WEEK", "description": "The lightness of water vapour helps to stabilise tropical climate", "url": "https://www.theweek.in/news/sci-tech/2020/05/07/scientists-explain-greater-stability-temperatures-tropics.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/sci-tech/images/2020/5/7/vapour.jpg", "publishedAt": "2020-05-06T20:49:25Z", "content": "It has been observed that tropical climate is more stable than extratropical climate. Now scientists are offering a different explanation of the tropics climate stability.\r\nA generally accepted understanding is that dry air rises and cold air sinks, and both … [+2356 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NASA Science Live: On Ice - NASA", "description": "Join NASA ice experts as we discuss important science about Earth's icy regions, and how it can impact us here in warmer environments. NASA’s ICESat-2 missio...", "url": "https://www.youtube.com/watch?v=jQaxUUraV_c", "urlToImage": "https://i.ytimg.com/vi/jQaxUUraV_c/maxresdefault.jpg", "publishedAt": "2020-05-06T19:00:10Z", "content": "Join NASA ice experts as we discuss important science about Earth's icy regions, and how it can impact us here in warmer environments. NASAs ICESat-2 mission uses a laser instrument on a satellite to precisely measure ice and just released new findings about … [+318 chars]"}, {"source": {"id": null, "name": "Techquila.co.in"}, "author": null, "title": "The North Pole is Shifting, Here’s Why - TechQuila", "description": "The magnetic north is shifting from its usual place near Canada towards Siberia in Russia, researchers have an explanation.", "url": "https://www.techquila.co.in/magnetic-north/", "urlToImage": "https://www.techquila.co.in/wp-content/uploads/2020/05/GTY_north_pole_01_mm_151230_2_16x9_992.jpg", "publishedAt": "2020-05-06T18:26:06Z", "content": "The magnetic North Pole has been the supporting pillar for navigation techniques employed by sailors across the world. The magnetic compass points to the magnetic North regardless of your position and orientation on the globe. This simple fact has been utiliz… [+2270 chars]"}, {"source": {"id": null, "name": "Mnn.com"}, "author": "Christian Cotroneo", "title": "No fossil fuels are burned to run this jet engine - Mother Nature Network", "description": "It needs only air and electricity.", "url": "https://www.mnn.com/green-tech/research-innovations/stories/jet-engine-air-plasma-no-fossil-fuels", "urlToImage": "https://media.mnn.com/assets/images/2020/05/jet-engine-air-plasma.jpg.1080x0_q100_crop-scale.jpg", "publishedAt": "2020-05-06T18:18:00Z", "content": "A prototype for a new jet engine promises to fly passengers halfway around the world without burning fossil fuels.\r\nThe engine, developed at the Institute of Technological Sciences at Wuhan University, would allow passengers to fly carbon-neutral skies. Resea… [+2232 chars]"}, {"source": {"id": null, "name": "Thesangaiexpress.com"}, "author": "The Sangai Express English", "title": "Giant planets, terrestrial planets and major satellites - The Sangai Express", "description": "Mars : The mass of Mars is approximately one-tenth that of the Earth, and hence significant differences in the internal structure are to be expected. There appears to be less of a density contrast between the core of Mars", "url": "https://www.thesangaiexpress.com/Encyc/2020/5/6/Mars-The-mass-of-Mars-is-approximately-one-tenth-that-of-the-Earth-and-hence-significant-differences-in-the-internal-structure-are-to-be-expected-There-appears-to-be-less-of-a-density-contrast-be.html", "urlToImage": "", "publishedAt": "2020-05-06T17:22:07Z", "content": "Dr HH MateContd from prev issue Mars : The mass of Mars is approximately one-tenth that of the Earth, and hence significant differences in the internal structure are to be expected. There appears to be less of a density contrast between the core of Mars and t… [+4607 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Aristos Georgiou", "title": "Largest Impact Event in Recorded History May Have Been An Iron Asteroid That Never Actually Hit Earth - Newsweek", "description": "The explosion over Siberia—which has come to be known as the \"Tunguska event\"—has long puzzled experts.", "url": "https://www.newsweek.com/largest-impact-event-recorded-history-iron-asteroid-hit-earth-1502364", "urlToImage": "https://d.newsweek.com/en/full/1587794/tunguska-event.jpg", "publishedAt": "2020-05-06T16:06:41Z", "content": "The largest impact event in recorded history may have been caused by the shock waves generated by an iron asteroid that entered the Earth's atmosphere at a shallow angle before heading back into space, a team of Russian scientists have proposed.\r\nThe research… [+5786 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Astronaut Chris Cassidy Thanks Essential Workers from the International Space Station - NASA", "description": "NASA astronaut and U.S. Navy SEAL Chris Cassidy sends a message from the International Space Station, thanking all on the front lines facing COVID-19, our in...", "url": "https://www.youtube.com/watch?v=G690YvtHYEA", "urlToImage": "https://i.ytimg.com/vi/G690YvtHYEA/maxresdefault.jpg", "publishedAt": "2020-05-06T15:59:34Z", "content": null}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "George Dvorsky", "title": "Bioluminescent Waves Draw Crowds to California Beaches - Gizmodo", "description": "Stunning bioluminescent waves are crashing onto southern California shores. It’s quite the spectacle, but the light show is drawing crowds amid social distancing concerns.", "url": "https://gizmodo.com/bioluminescent-waves-draw-crowds-to-california-beaches-1843286292", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/jgqtzjxvaczlc4oidu3d.jpg", "publishedAt": "2020-05-06T15:53:43Z", "content": "Stunning bioluminescent waves are crashing onto southern California shores. Its quite the spectacle, but the light show is drawing crowds amid social distancing concerns.\r\nShores between Baja California and Los Angeles are experiencing a significant algal blo… [+3770 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Desert 'Rover' Helps NASA Scientists Prepare for Mars - NASA Jet Propulsion Laboratory", "description": "Did life ever form on Mars? NASA is launching its new Perseverance rover to find out. In February 2020, mission scientists practiced skills they’ll need whil...", "url": "https://www.youtube.com/watch?v=y3WqWazeWlI", "urlToImage": "https://i.ytimg.com/vi/y3WqWazeWlI/maxresdefault.jpg", "publishedAt": "2020-05-06T15:52:38Z", "content": "Did life ever form on Mars? NASA is launching its new Perseverance rover to find out. In February 2020, mission scientists practiced skills theyll need while Perseverance explores the Red Planet. A seven-person field team served as a simulated rover, carrying… [+487 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Phytoplankton: Shedding light on the ocean's living carbon pump - Phys.org", "description": "Phytoplankton play a crucial role in ocean biology and climate. Understanding the natural processes that influence phytoplankton primary production, and how they are changing as the planet warms, is vital. A new study, using data from the European Space Agenc…", "url": "https://phys.org/news/2020-05-phytoplankton-ocean-carbon.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/5-sheddingligh.jpg", "publishedAt": "2020-05-06T14:51:17Z", "content": "Phytoplankton play a crucial role in ocean biology and climate. Understanding the natural processes that influence phytoplankton primary production, and how they are changing as the planet warms, is vital. A new study, using data from the European Space Agenc… [+4215 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Tech Desk", "title": "China on track to send astronauts to Moon; new rocket’s test launch successful - The Indian Express", "description": "Aboard the Long March 5 was a special prototype spacecraft that is somewhat akin to the deep-space Orion capsule NASA has been developing to people to the Moon and beyond.", "url": "https://indianexpress.com/article/technology/science/china-long-march-5b-astronaut-moon-launch-6396940/", "urlToImage": "https://images.indianexpress.com/2020/05/Long-March-5B-China-Daily-via-REUTERS-759.jpg?w=759", "publishedAt": "2020-05-06T13:29:06Z", "content": "By: Tech Desk | New Delhi | \r\nPublished: May 6, 2020 6:18:18 pm\r\nThe Long March 5B carrier rocket takes off from Wenchang Space Launch Center in Wenchang, Hainan Province, China May 5, 2020. (Image: China Daily via REUTERS)In a major development, China has la… [+2249 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "Enabling electric cars to recharge themselves wirelessly - Tech Explorist", "description": "Engineers have demonstrated a practical way to use magnetism to transmit electricity wirelessly to recharge electric cars, robots or even drones. The technology could be scaled up to power electric cars as they drive over highways, robots on factory floors an…", "url": "https://www.techexplorist.com/enabling-electric-cars-recharge-wirelessly/32098/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/05/highway.jpg", "publishedAt": "2020-05-06T12:40:22Z", "content": "It is no longer inconvenient to charge objects in motions, thanks to a technology developed by Stanford engineers. Engineers have taken a step forward towards making this concept practical to recharge electric cars as they speed along futuristic highways buil… [+3177 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Sounak Mitra", "title": "Scientists discover traces of nitrogen compounds in 4 billion-year-old Martian Meteorite - Republic World - Republic World", "description": "A recent research was conducted by a team of scientists who has discovered a 4 billion-year-old Martian meteorite which once hit Antarctica, as per reports.", "url": "https://www.republicworld.com/technology-news/science/scientists-discover-traces-of-nitrogen-compounds-in-martian-meteorite.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/czkvaviobipjeext_1588761338.jpeg?tr=f-jpeg", "publishedAt": "2020-05-06T11:33:08Z", "content": "A recent research was conducted by a team of scientists who has discovered a 4 billion-year-old Martian meteorite which once hit Antarctica. According to the reports, Earth-Life Science Institute (ELSI) issued a press release in which the team has revealed to… [+2151 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "Scientists discovered one of the oldest objects in the Milky Way - Tech Explorist", "description": "Scientists studied the globular cluster NGC 6652.4.05957 and found out that its age is close to 13.6 billion years, which makes it one of the oldest objects in the Milky Way.", "url": "https://www.techexplorist.com/scientists-discovered-one-oldest-objects-milky-way/32095/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/05/NGC-6652.4.05957.jpg", "publishedAt": "2020-05-06T11:27:14Z", "content": "A new study has focused on the spectra of NGC 6652 obtained by the Cerro Tololo Observatory and found that the globular cluster NGC 6652.4.05957 is 13.6 billion years old. This makes the cluster one of the oldest objects in the Milky Way.\r\nWhat’s more, scient… [+1180 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Daniel Oberhaus", "title": "After 60 Years, Explosion-Powered Rockets Are Nearly Here - WIRED", "description": "Rotating detonation engines could make rockets lighter, faster, and simpler. First imagined in the 1950s, now they’re almost ready for their first flight.", "url": "https://www.wired.com/story/after-60-years-explosion-powered-rockets-are-nearly-here/", "urlToImage": "https://media.wired.com/photos/5eb1c1d77ecb20c186e15677/191:100/w_1280,c_limit/Science_RDE@_IMG_20190515_065438.jpg", "publishedAt": "2020-05-06T11:22:18Z", "content": "For most aerospace engineers, an explosion in a rocket engine is a disaster. But for Kareem Ahmed, its the entire point. As the director of the Propulsion and Energy Research Laboratory at the University of Central Florida, Ahmed has spent the last few years … [+3565 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Brandon Specktor", "title": "New image captures 'impossible' view of the moon's surface - Livescience.com", "description": "You've never seen the moon like in this 'all terminator' image (and you never will).", "url": "https://www.livescience.com/terminator-moon-composite-image.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/SYNFvhA5XoBB6L6ScwzWk4-1200-80.jpg", "publishedAt": "2020-05-06T11:00:00Z", "content": "Shadows creep down the banks of every crater on the near-side of themoon\r\n, highlighting the pockmarked face of Earth's gravitationally-bound buddy with a clarity never before seen.\r\nAccording to photographer Andrew McCarthy, who posted the stunning imageto h… [+1830 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Otters 'stone juggling': new research looks into why - Guardian News", "description": "Otters are often scene playing with pebbles, throwing and catching them, known as 'stone juggling' and researchers from the University of Exeter believe they...", "url": "https://www.youtube.com/watch?v=zdEBilRjcEI", "urlToImage": "https://i.ytimg.com/vi/zdEBilRjcEI/maxresdefault.jpg", "publishedAt": "2020-05-06T10:33:05Z", "content": "Otters are often scene playing with pebbles, throwing and catching them, known as 'stone juggling' and researchers from the University of Exeter believe they know why. It was previously thought the game helped hone their foraging skills. The study revealed ol… [+847 chars]"}, {"source": {"id": null, "name": "Inceptivemind.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "NASA’s Perseverance will have the most advanced pair of zoomable ‘eyes’ - Inceptive Mind", "description": "NASA's Perseverance rover is equipped with a pair of Mastcam-Z with next-gen zoom capability that will help the mission make 3D imagery more easily.", "url": "https://www.inceptivemind.com/nasa-perseverance-mastcam-z-advanced-pair-zoomable-eyes/13075/", "urlToImage": "https://www.inceptivemind.com/wp-content/uploads/2020/05/Perseverance-Mastcam-Z.jpg", "publishedAt": "2020-05-06T07:03:29Z", "content": "As it prepares for its Mars mission, NASA‘s Perseverance rover underwent tests in southern Australia – especially its tools and methods that will look for evidence of microbial life forms. The US space agency has added Mastcam-Z to the SuperCam instrument int… [+2748 chars]"}, {"source": {"id": null, "name": "Uniindia.com"}, "author": "Uniindia News Service", "title": "Comet Halley's Particles causes Meteor Shower visible till May 28 - United News of India", "description": "Hyderabad, May 6 (UNI) Away from city lights, two hours before Sunrise, people in India and across the world can witness Annual Meteor Shower called Eta Aquarids till May 28.  <br />Observed since time immemorial, Meteor shower are commonly known as shooting …", "url": "http://www.uniindia.com/comet-halley-s-particles-causes-meteor-shower-visible-till-may-28/south/news/1983506.html", "urlToImage": "http://www.uniindia.com//images/stripad.png", "publishedAt": "2020-05-06T03:18:00Z", "content": "Hyderabad, May 6 (UNI) Away from city lights, two hours before Sunrise, people in India and across the world can witness Annual Meteor Shower called Eta Aquarids till May 28. Observed since time immemorial, Meteor shower are commonly known as shooting stars w… [+770 chars]"}, {"source": {"id": null, "name": "Theweek.in"}, "author": null, "title": "Scientists hunt for dark matter signals in existing data - THE WEEK", "description": "Researchers propose new searches in previously collected particle detector data", "url": "https://www.theweek.in/news/sci-tech/2020/05/06/Scientists-hunt-for-dark-matter-signals-in-existing-data.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/sci-tech/2019/May/Milky-way-galaxy-with-stars-and-space-dust-in-the-universe-shut.jpg", "publishedAt": "2020-05-05T22:48:10Z", "content": "Scientists know for sure that dark matter exists because of its huge gravitational footprint in space. Though about 85 percent of the total mass of the universe is made of dark matter, it doesn't interact with photons of light, and also cannot be detected by … [+4998 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Astronomers “painted” the old images of the surface of Jupiter’s moon — Europe - The Times Hub", "description": null, "url": "https://thetimeshub.in/astronomers-painted-the-old-images-of-the-surface-of-jupiters-moon-europe/14984/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2020/05/0d1fb12d7b6b907be2bade7e0e353c98-503x400.jpg", "publishedAt": "2020-05-05T22:07:04Z", "content": "Astronomers painted old pictures, showing the surface of Jupiter’s moon Europe. Black-and-white photo of a moon of a giant planet did NASA launched the Galileo camera. \r\nTo revert to an earlier frame, the researchers decided to better prepare for upcoming mis… [+1029 chars]"}, {"source": {"id": null, "name": "Hulldailymail.co.uk"}, "author": "Barnabas Stephenson", "title": "Starlink satellite tracker shows best time to see satellites in UK skies - Hull Daily Mail", "description": "Here is a list of the exact times to spot Elon Musk's satellites moving across the sky", "url": "https://www.hulldailymail.co.uk/news/hull-east-yorkshire-news/starlink-satellite-tracker-best-time-4102923", "urlToImage": "https://i2-prod.hulldailymail.co.uk/incoming/article4102906.ece/ALTERNATES/s1200/0_ecsImgspacex-satellites-8911143947347862881.jpg", "publishedAt": "2020-05-05T19:37:00Z", "content": "Over the last few weeks many of us have been stunned by the sight of Starlink satellites.\r\nLots of people have stayed up specifically to catch a glimpse of the dazzling lights passing through the sky during the lockdown period.\r\nAnd the formations are due to … [+1514 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent | Edited by Jhinuk Sen", "title": "NASA’s Perseverance rover will look at Mars through two zoomable eyes - Hindustan Times", "description": "The Mastcam-Z on the Perseverance rover is better than the cameras on the Curiosity rover because of these zoom cameras that will help scientists and rover drivers with high-res colour images", "url": "https://www.hindustantimes.com/tech/nasa-s-perseverance-rover-will-look-at-mars-through-two-zoomable-eyes/story-HxYsrJQe8Ylyw8QbDjXGIJ.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/05/Pictures/_99be63ce-8ef0-11ea-85c6-561c42737975.jpg", "publishedAt": "2020-05-05T17:33:00Z", "content": "This summer, when NASA’s Perseverance rover launches, it will be equipped with the most advanced pair of eyes ever sent to Mars. The Mastcam-Z instrument on the Perseverance sports next-gen zoom capability that will help the mission make 3D imagery more easil… [+3272 chars]"}]}