{"status": "ok", "totalResults": 51, "articles": [{"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Massive asteroid 1998 OR2 to brush past Earth tomorrow; poses no threat to planet - Firstpost", "description": "The Arecibo Observatory in Puerto Rico captured a radar images of the steroid will pass by Earth at a distance of 6.2 million km.", "url": "https://www.firstpost.com/tech/science/massive-asteroid-1998-or2-to-brush-past-earth-tomorrow-poses-no-threat-to-planet-8307131.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/04/EV62WCgWoAEgGjK.jpg", "publishedAt": "2020-04-28T06:36:16Z", "content": "FP TrendingApr 28, 2020 12:01:01 IST\r\nThe National Aeronautics and Space Administration (NASA) has said that a huge asteroid will be passing by Earth at a distance of 6.2 million km on 29 April. The space agency has named it Asteroid 1998 OR2.\r\nAsteroid 1998 … [+1653 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "TWC India Edit Team", "title": "Ask an Astronomer: Human Expeditions to Mars, Helicopters on Red Planet, and More - The Weather Channel", "description": "To gain insights on the Red Planet’s past, and to understand what the future holds for space scientists and technologies in Mars exploration, we spoke to Dr. Abhay Deshpande.", "url": "https://weather.com/en-IN/india/science/news/2020-04-28-ask-astronomer-mars-human-expedition-helicopters-red-planet", "urlToImage": "https://s.w-x.co/in-mars_helicopter.jpg", "publishedAt": "2020-04-28T06:11:15Z", "content": "An artist concept of the Mars Helicopter.\r\n(NASA/JPL-Caltech)\r\nWith each passing day, scientists continue to pace-up their attempts to develop new technology and find novel ways to study the past environment as well as the future possibilities on our neighbou… [+10415 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Becky Ferreira", "title": "These Stunning Genetically Engineered Plants Glow Bright Green - VICE", "description": "Scientists are envisioning a future of flowers that glow like alien flora, and just took a big step forward with the brightest glowing plants ever genetically engineered.", "url": "https://www.vice.com/en_in/article/5dm7xa/these-stunning-genetically-engineered-plants-glow-bright-green", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5ea6f8f2f849b70098fe6a59/lede/1588001597541-untitled_design__20_.jpeg?crop=1xw:1xh;center,center&resize=1200:*", "publishedAt": "2020-04-28T05:13:00Z", "content": "This article originally appeared on VICE US.\r\nBioluminescence, or the ability for life to emit light, shows up in the transient flares of fireflies, the auroral glow of oceanic plankton, and the eerily bright lures of predatory animals. Plants, however, have … [+2495 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "NASA Wants People to Witness the Historic SpaceX Launch, But from Inside Their Homes - News18", "description": "In view of the spread of COVID-19, NASA is urging people to watch the event online.", "url": "https://www.news18.com/news/buzz/nasa-wants-people-to-witness-the-historic-spacex-launch-but-from-inside-their-homes-2595471.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1588048838_untitled-design-3.png", "publishedAt": "2020-04-28T04:49:32Z", "content": "Amid COVID-19 restrictions, the historic SpaceX mission to launch two NASA astronauts to the International Space Station (ISS) on May 27 is set to be a much quieter affair than it would have been in normal times, with the US space agency asking people not to … [+2138 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Prabhjote Gill", "title": "NASA caught an interstellar comet sweating bullets as it approached the sun - Business Insider India", "description": "The National Aeronautics and Space Agency (NASA) caught the instellar comet, 2I/Borisov, shedding a massive amount of water.\n At its peak, the comet was", "url": "https://www.businessinsider.in/science/space/news/nasa-caught-a-comet-from-another-solar-system-sweating-bullets-at-it-approached-the-sun/articleshow/75420891.cms", "urlToImage": "https://www.businessinsider.in/photo/75420891/nasa-caught-a-comet-from-another-solar-system-sweating-bullets-at-it-approached-the-sun.jpg?imgsize=1144406", "publishedAt": "2020-04-28T04:41:00Z", "content": "The interstellar comet\r\n 2I/Borisov that visited our corner of the universe was losing water as it approached the Sun — almost as though it was peeing its pants. At its peak, the comet was shedding nearly 30 litres of water per second, enough to fill up a bat… [+2147 chars]"}, {"source": {"id": null, "name": "Spacenews.com"}, "author": "Jeff Foust", "title": "SpaceX to test Starlink “sun visor” to reduce brightness - SpaceNews", "description": "SpaceX CEO Elon Musk said April 27 that he hopes to test a new way to reduce the brightness of the company’s Starlink satellites on the next launch.", "url": "https://spacenews.com/spacex-to-test-starlink-sun-visor-to-reduce-brightness/", "urlToImage": "https://spacenews.com/wp-content/uploads/2020/04/visorsat.jpg", "publishedAt": "2020-04-28T03:42:30Z", "content": "WASHINGTON SpaceX Chief Executive Elon Musk said April 27 that he hopes to test a new way to reduce the brightness of the companys Starlink satellites on the next launch for the broadband megaconstellation.\r\nIn a briefing to a committee working on the next as… [+5443 chars]"}, {"source": {"id": null, "name": "Ibtimes.sg"}, "author": "https://www.ibtimes.sg/reporters/nirmal-narayanan", "title": "19 interstellar asteroids lurking near Jupiter: Are they posing a threat to earth's existence? - International Business Times, Singapore Edition", "description": "Researchers revealed that the swarm of asteroids has been orbiting the sun since the birth of the solar system", "url": "https://www.ibtimes.sg/19-interstellar-asteroids-lurking-near-jupiter-are-they-posing-threat-earths-existence-43927", "urlToImage": "https://data.ibtimes.sg/en/full/27821/asteroid-collision.jpg", "publishedAt": "2020-04-28T03:38:52Z", "content": "It was in 2017 that astronomers discovered Oumuamua, touted to be the first interstellar object that reached the solar system. In 2019, an amateur astronomer discovered another interstellar object now known as 2I/Borisov. Now, a team of researchers has discov… [+2396 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "ANI", "title": "Revealed: How universe got its structure - Livemint", "description": "A 10-year survey at Carnegie's Las Campanas Observatory in Chile provided a new approach to answering this fundamental mystery.The results, led by Carnegie's Daniel Kelson, are published in Monthly Notices of the Royal Astronomical Society", "url": "https://www.livemint.com/science/news/revealed-how-universe-got-its-structure-11588043265146.html", "urlToImage": "https://images.livemint.com/img/2020/04/28/600x338/firststars-kOaG--621x414@LiveMint_1588043505937.jpg", "publishedAt": "2020-04-28T03:12:05Z", "content": "Washington D.C.: The universe is full of billions of galaxies -- but their distribution across space is far from uniform. Why do we see so much structure in the universe today, and how did it all form and grow?A 10-year survey of tens of thousands of galaxies… [+4364 chars]"}, {"source": {"id": null, "name": "Techtimes.com"}, "author": "Christine R.", "title": "NASA Builds High-Pressure Ventilator for Coronavirus Patients in Just 37 Days - Tech Times", "description": "These new ventilators passed a critical test at the Icahn School of Medicine at Mount Sinai, New York, the epicenter of the virus is located in the US.", "url": "https://www.techtimes.com/articles/249192/20200427/nasa-builds-high-pressure-covid-19-ventilator-for-patients-in-just-37-days.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/365073/vital.png", "publishedAt": "2020-04-28T01:43:11Z", "content": "Due to the coronavirus pandemic, the demand for ventilators around the world has increased. And unfortunately, the supply hasn't been able to keep up as many healthcare facilities have resorted to improvising their own ventilators, or making do with what they… [+3117 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Tristan Greene", "title": "Scientists think we’ll finally solve nuclear fusion thanks to cutting-edge AI - The Next Web", "description": "Scientists believe the world will see it’s first working thermonuclear fusion reactor by the year 2025. That’s a tall order in short form, especially when you consider that fusion has been “almost here” for nearly a century. Fusion reactors – not to be confus…", "url": "https://thenextweb.com/neural/2020/04/27/scientists-think-well-finally-solve-nuclear-fusion-thanks-to-cutting-edge-ai/", "urlToImage": "https://img-cdn.tnwcdn.com/image/neural?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2020%2F04%2Fsolarfusion.jpg&signature=026df1d94119ad9a141e5c962e4aa7e3", "publishedAt": "2020-04-27T23:31:57Z", "content": "Scientists believe the world will see its first working thermonuclear fusion reactor by the year 2025. Thats a tall order in short form, especially when you consider that fusion has been almost here for nearly a century.\r\nFusion reactors not to be confused wi… [+3306 chars]"}, {"source": {"id": null, "name": "Eurekalert.org"}, "author": null, "title": "Making sense of the viral multiverse - EurekAlert", "description": "In a consensus statement, Arvind Varsani, a molecular virologist with ASU's Biodesign Center for Fundamental and Applied Microbiomics and a host of international collaborators propose a new classification system, capable of situating coronaviruses like SARS-C…", "url": "https://www.eurekalert.org/pub_releases/2020-04/asu-mso042720.php", "urlToImage": "https://eurekalert.org/multimedia/pub/web/230332_web.jpg", "publishedAt": "2020-04-27T21:12:57Z", "content": "IMAGE: Arvind Varsani is a molecular virologist in the Biodesign Center for Fundamental and Applied Microbiomics and a researcher in ASU's School of Life Sciences\r\n view more \r\nCredit: The Biodesign Institute at Arizona State University\r\nIn November of 2019--… [+7894 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": null, "title": "This unlucky fellow was the first person to have been killed by a meteorite in recorded history - Boing Boing", "description": "On November 30 1954 in Alabama, a nine pound meteorite broke through the ceiling of Anne Hodges’ living room, bounced off her stereo system, and hit her in the side while she was asleep on th…", "url": "https://boingboing.net/2020/04/27/this-unlucky-fellow-was-the-fi.html", "urlToImage": "https://i1.wp.com/media.boingboing.net/wp-content/uploads/2020/04/screenshot-121.jpg?fit=802%2C502&ssl=1", "publishedAt": "2020-04-27T20:30:00Z", "content": "On November 30 1954 in Alabama, a nine pound meteorite broke through the ceiling of Anne Hodges' living room, bounced off her stereo system, and hit her in the side while she was asleep on the sofa. Hodges suffered a bad bruise. The National Museum of Natural… [+3055 chars]"}, {"source": {"id": null, "name": "Therahnuma.com"}, "author": null, "title": "NASA targets May 27 for historic SpaceX crew mission - The Rahnuma Daily", "description": "Washington, April 17 (IANS) NASA is set to send its astronauts on American rocket from American soil for the first time in almost a decade as the US space agency on Friday said the SpaceX’s Crew Dragon spacecraft aboard the Falcon 9 rocket will leave for the …", "url": "https://www.therahnuma.com/nasa-targets-may-27-for-historic-spacex-crew-mission/", "urlToImage": "https://www.therahnuma.com/wp-content/uploads/2020/04/1bbc96bb5e68461719c165fa69597d53.jpg", "publishedAt": "2020-04-27T19:33:08Z", "content": "Elon Musk offered the first glimpse of SpaceX’s Starship test rocket on Twitter.\r\nWashington, April 17 (IANS) NASA is set to send its astronauts on American rocket from American soil for the first time in almost a decade as the US space agency on Friday said … [+3095 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Moon and Venus will appear together after sunset tonight - 10 Tampa Bay", "description": "Look in the western sky after sunset Monday night to see the very bright Venus and the waxing crescent moon appear next to each other. Venus is now nearly 3 ...", "url": "https://www.youtube.com/watch?v=yV5uwLMS-Hk", "urlToImage": "https://i.ytimg.com/vi/yV5uwLMS-Hk/maxresdefault.jpg", "publishedAt": "2020-04-27T18:59:20Z", "content": null}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "The Universe May Not Be 'Stagnant' as Thought - Somag News", "description": "New South Wale University researchers made a very interesting and strange discovery about the universe. According to the new study, electromagnetic force may differ in some parts of the universe. In an article published in Science Advances, researchers from N…", "url": "https://www.somagnews.com/universe-may-not-stagnant-thought/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2020/04/26-22-e1588012286538.jpg", "publishedAt": "2020-04-27T18:31:00Z", "content": "New South Wale University researchers made a very interesting and strange discovery about the universe. According to the new study, electromagnetic force may differ in some parts of the universe.\r\nIn an article published in Science Advances, researchers from … [+3661 chars]"}, {"source": {"id": null, "name": "Coolingpost.com"}, "author": "Neil Everitt", "title": "Skycool vies for Keeling Curve Prize - Cooling Post", "description": "USA: A radiative sky cooling panel is one of 20 projects competing for ten $25,000 prizes in this year’s Keeling Curve Prize. The Keeling Curve Prize awards prizes to projects around the globe conside", "url": "https://www.coolingpost.com/world-news/skycool-vies-for-keeling-curve-prize/", "urlToImage": "https://s3-eu-central-1.amazonaws.com/cp-website-images/wp-content/uploads/2020/04/Skycool.jpg", "publishedAt": "2020-04-27T18:20:22Z", "content": "USA: A radiative sky cooling panel is one of 20 projects competing for ten $25,000 prizes in this years Keeling Curve Prize.\r\nThe Keeling Curve Prize awards prizes to projects around the globe considered to have significant potential to reduce greenhouse gas … [+1257 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Rob Waugh", "title": "Astronomers find star that survived being 'eaten' by a black hole - Yahoo India News", "description": "The black hole didn’t swallow the red giant whole, but chewed off its outer layers and trapped it in a deadly embrace.", "url": "https://in.news.yahoo.com/black-hole-star-181449340.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/cVLO9G7R.oGtrefpvsYQIQ--~B/aD0zMDAwO3c9NTMzMztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-04/43d39f40-88b2-11ea-bffb-c895ba73aba9", "publishedAt": "2020-04-27T18:14:00Z", "content": "Nothing can escape the enormous gravity of a black hole, not even light.\r\nSo astronomers were surprised to find a star that was eaten by a black hole, but survived. \r\nThe black hole didnt swallow the red giant whole, but it did chew off its outer layers, and … [+2366 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "'I'll pass': Trump not interested in flying on Virgin Galactic's space plane - Space.com", "description": "Maybe he's holding out for an orbital experience.", "url": "https://www.space.com/trump-not-interested-virgin-galactic-spaceflight.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/di3ezxUeKZakKoKdMTXhHV-1200-80.jpg", "publishedAt": "2020-04-27T17:51:00Z", "content": "President Donald Trump may be a fan of human spaceflight, but that doesn't necessarily mean he wants to visit the final frontier himself.\r\nDuring a conversation with NASA chief Jim Bridenstine on Friday (April 24), the president, whose administration has dire… [+1874 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Florian Aigner", "title": "Superconductivity: It's hydrogen's fault - Phys.org", "description": "Last summer, a new age for high-temperature superconductivity was proclaimed—the nickel age. It was discovered that there are promising superconductors in a special class of materials, the so-called nickelates, which can conduct electric current without any r…", "url": "https://phys.org/news/2020-04-superconductivity-hydrogen-fault.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/4-superconduct.jpg", "publishedAt": "2020-04-27T17:04:55Z", "content": "Last summer, a new age for high-temperature superconductivity was proclaimedthe nickel age. It was discovered that there are promising superconductors in a special class of materials, the so-called nickelates, which can conduct electric current without any re… [+5042 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Thomas Macaulay", "title": "Man’s paralyzed hand can feel again — thanks to a brain implant - The Next Web", "description": "Scientists have managed to reverse paralysis, by using a brain implant to restore a man’s hand movement and sense of touch. The breakthrough came after years of tests on Ian Burkhart, who severed his spinal cord in a 2010 diving accident, leaving him with par…", "url": "https://thenextweb.com/neural/2020/04/27/mans-paralyzed-hand-can-feel-again-thanks-to-a-brain-implant/", "urlToImage": "https://img-cdn.tnwcdn.com/image/neural?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2020%2F04%2FUntitled-design-15.png&signature=c8e791713a0a90ab2d779ae19a42aea6", "publishedAt": "2020-04-27T15:27:36Z", "content": "Scientists have managed to reverse paralysis, by using a brain implant to restore a mans hand movement and sense of touch.\r\nThe breakthrough came after years of tests on Ian Burkhart, who severed his spinal cord in a 2010 diving accident, leaving him with par… [+1696 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Sebastian Kettley", "title": "Asteroid flyby: The mountain-sized Asteroid OR2 will pass Earth this week - How to watch - Express.co.uk", "description": "AN ASTEROID as big as a mountain will safely swing past Earth this week. Find out how you can watch the asteroid on the night of the flyby.", "url": "https://www.express.co.uk/news/science/1254813/Asteroid-flyby-mountain-size-Asteroid-OR2-pass-Earth-how-to-watch-live", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1254813.jpg", "publishedAt": "2020-04-27T15:22:00Z", "content": null}, {"source": {"id": null, "name": "Phys.org"}, "author": "Linda Vu", "title": "World's first 3-D simulations of superluminous supernovae - Phys.org", "description": "For most of the 20th century, astronomers have scoured the skies for supernovae—the explosive deaths of massive stars—and their remnants in search of clues about the progenitor, the mechanisms that caused it to explode, and the heavy elements created in the p…", "url": "https://phys.org/news/2020-04-world-d-simulations-superluminous-supernovae.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/worldsfirst3.jpg", "publishedAt": "2020-04-27T15:20:34Z", "content": "For most of the 20th century, astronomers have scoured the skies for supernovaethe explosive deaths of massive starsand their remnants in search of clues about the progenitor, the mechanisms that caused it to explode, and the heavy elements created in the pro… [+4724 chars]"}, {"source": {"id": null, "name": "Azoquantum.com"}, "author": null, "title": "Voltage-Controlled Device Could Promote Ultralow Power Spintronics - AZoQuantum", "description": "Researchers at KAUST have developed a new device that is solely controlled by voltage, thus opening the door for spintronics with ultralow power consumption.", "url": "https://www.azoquantum.com/News.aspx?newsID=6990", "urlToImage": "https://www.azoquantum.com/images/news/ThumbForNews_6990_15879850644529054.png", "publishedAt": "2020-04-27T14:32:14Z", "content": "Written by AZoQuantumApr 27 2020\r\nResearchers at KAUST have developed a new device that is solely controlled by voltage, opening the door for spintronics with ultralow power consumption.\r\nFor spintronic applications ranging from implantable medical devices an… [+2549 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Nicholas Dallmann", "title": "Get out of the way: The 1st restartable solid rocket fuel could help reduce space junk (op-ed) - Space.com", "description": "The breakthrough could allow cubesats to safely maneuver and de-orbit.", "url": "https://www.space.com/restartable-solid-rocket-fuel-space-junk.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/iYoFgumzormYTtvNFXmMmU-1200-80.jpg", "publishedAt": "2020-04-27T12:18:00Z", "content": "Nicholas Dallmann is a research engineer at Los Alamos National Laboratory, a U.S. Department of Energy facility. He contributed this article to Space.com'sExpert Voices: Op-Ed &amp; Insights\r\n. The project he describes is funded by Los Alamos Laboratory Dire… [+5771 chars]"}, {"source": {"id": null, "name": "Heritagedaily.com"}, "author": "http://www.facebook.com/archaeologynews", "title": "Study traces spread of early dairy farming across Western Europe - HeritageDaily", "description": "A study has tracked the shift from hunter-gatherer lifestyles to early farming that occurred in prehistoric Europe over a period of around 1,500 years. - Archaeology HeritageDaily - Archaeology News", "url": "https://www.heritagedaily.com/2020/04/study-traces-spread-of-early-dairy-farming-across-western-europe/127992", "urlToImage": "https://www.heritagedaily.com/wp-content/uploads/2020/04/pottery1-scaled.jpg", "publishedAt": "2020-04-27T12:10:19Z", "content": "A study has tracked the shift from hunter-gatherer lifestyles to early farming that occurred in prehistoric Europe over a period of around 1,500 years.\r\nAn international team of scientists, led by researchers at the University of York, analysed the molecular … [+2692 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/sakharkar.ashwini", "title": "Decomposing water into oxygen and hydrogen using waste-yeast biomass - Tech Explorist", "description": "UNIST scientists have successfully developed a new catalyst synthesis method that can efficiently decompose water into oxygen and hydrogen using waste-yeast biomass.", "url": "https://www.techexplorist.com/decomposing-water-oxygen-hydrogen-using-waste-yeast-biomass/31848/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/04/Multi-heteroatom-doped-carbon.jpg", "publishedAt": "2020-04-27T11:54:58Z", "content": "Scientists at UNIST have developed a new low-cost catalyst synthesis method that can efficiently decompose water into oxygen and hydrogen using waste-yeast biomass. This system has a high return, and in this way, is expected to additionally decrease the expen… [+2803 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/sakharkar.ashwini", "title": "A new way to deliver life-saving treatments to plants - Tech Explorist", "description": "Engineers at MIT have developed a new precision injection system that includes Microneedles called phytoinjectors (made of silk-based material) to deliver life-saving treatments to plants.", "url": "https://www.techexplorist.com/new-way-deliver-life-saving-treatments-plants/31834/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/04/microinjection-system.jpg", "publishedAt": "2020-04-27T11:53:00Z", "content": "MIT scientists have come up with a new approach to help advance the fundamental understanding of plant biology and accelerate plant engineering. They have developed a method to deliver life-saving treatments to plants ravaged by threatening diseases.\r\nTheir m… [+3177 chars]"}, {"source": {"id": null, "name": "Digitaltrends.com"}, "author": "Georgina Torbet", "title": "SpaceX Starship prototype successfully passes pressure test after three failures - Digital Trends", "description": "SpaceX has finally achieved success in pressure testing its prototype SN4 Starship, the giant steel rocket which is intended to carry astronauts to Mars.", "url": "https://www.digitaltrends.com/news/spacex-starship-sn4-pass-pressure-test/", "urlToImage": "https://icdn2.digitaltrends.com/image/digitaltrends/efmgjfcxuaepgfb-1200x630-c-ar1.91.jpg", "publishedAt": "2020-04-27T11:35:00Z", "content": "SpaceX has finally had success with pressure testing its prototype Starship, the giant rocket which is intended to carry astronauts to Mars. This is a significant step forward as all of the previous full-scale Starship prototypes have failed during pressure t… [+2219 chars]"}, {"source": {"id": null, "name": "Communalnews.com"}, "author": null, "title": "New Theory and Space X-Rays - What Does It Entail? - Communal News", "description": "There is a group of physicists specifically dedicating their work to the physics of high energy densities. High-energy-density physics (HEDP) is a relatively new subfield of physics intersecting condensed matter physics, nuclear physics, astrophysics and plas…", "url": "https://communalnews.com/new-theory-and-space-x-rays-what-does-it-entail/", "urlToImage": "https://communalnews.com/wp-content/uploads/2020/04/Screen-Shot-2020-04-25-at-9.54.10-PM.png", "publishedAt": "2020-04-27T11:05:00Z", "content": "<ul><li>High-energy-density physics (HEDP) is a relatively new subfield of physics intersecting condensed matter physics, nuclear physics, astrophysics and plasma physics.</li><li> The new theory is going to be tested using a laser structure.</li><li> If the … [+4238 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Zaini Majeed", "title": "Research suggests Earths tectonic plates started moving over 3.2 billion years ago - Republic World - Republic World", "description": "Having studied the Earth's rocks (older than 3 billion years) from Australia and South Africa,scientists discovered a latitudinal drift of about 2.5 centimeter.", "url": "https://www.republicworld.com/technology-news/science/earths-tectonic-plates-started-moving-over-3-dot-2-billion-years.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/sdng3lbvie8zlpxo_1587975905.jpeg?tr=f-jpeg", "publishedAt": "2020-04-27T10:37:47Z", "content": "In a shocking discovery, researchers at Harvard University found that the Earth's tectonic plates started moving over 3.2 billion years ago, earlier than thought, which dates back to approximately 1.3 billion years after the Earth was formed. The team of geol… [+2458 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Rebecca Lloyd-Evans, Noah Payne-Frank, Charlie Phillips, Lindsay Poulton", "title": "Scars: how our wounds make us who we are – video - The Guardian", "description": "Scars are not just skin deep – emotional and psychological histories lie beneath the healed wounds", "url": "https://www.theguardian.com/news/ng-interactive/2020/apr/27/scars-how-our-wounds-make-us-who-we-are-video", "urlToImage": "https://i.guim.co.uk/img/media/1d41222aa037f1e892697d7631f3ceb8b36d06eb/0_372_5616_3370/master/5616.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=892821f80a006adc62dbd7d1751e2ea0", "publishedAt": "2020-04-27T09:29:50Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "We Finally Have the First Credible Evidence of a Meteorite Killing a Human Being - News18", "description": "This, according to researchers, is the first-ever known proof of death by a meteorite strike.", "url": "https://www.news18.com/news/buzz/we-finally-have-the-first-credible-evidence-of-a-meteorite-killing-a-human-being-2594431.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587978712_untitled-design-68.jpg", "publishedAt": "2020-04-27T09:13:49Z", "content": "After intensive research over the years, the experts have finally found the records and evidence of the first known human to be killed a meteor strike. The record has been credited to multiple documents found in the General Directorate of State Archives of th… [+1315 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Scientists Have Officially Declared This the Most Dangerous Place on Earth - News18", "description": "Now a dry land, the place was once home an extensive river system, surrounded with different species of aquatic and terrestrial animals.", "url": "https://www.news18.com/news/buzz/scientists-have-officially-declared-this-the-most-dangerous-place-on-earth-2594331.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587977180_untitled-design-16.png", "publishedAt": "2020-04-27T08:49:44Z", "content": "Humans have been inhabiting on planet Earth for years, yet there are a few questions that have remained unanswered. While we know about the deepest ocean or longest sea, not many of us knew about the most dangerous place in our home plant. The paleontologists… [+1344 chars]"}, {"source": {"id": null, "name": "Unb.com.bd"}, "author": "Md. Ashequl Morsalin Ibne Kamal(Team Leader)| Niloy Saha(Sr. Web Developer)| Shohana Afroz(Web Developer)| Jobayer Hossain(Web Developer)", "title": "'Largest-ever ozone hole' over Arctic closes - United News of Bangladesh", "description": "The largest-ever hole in ozone layer over the Arctic has closed, the...", "url": "http://www.unb.com.bd/category/World/largest-ever-ozone-hole-over-arctic-closes/50626", "urlToImage": "http://www.unb.com.bd/watermark/category/World/english/50626/largest-ever-ozone-hole-over-arctic-closes", "publishedAt": "2020-04-27T06:38:00Z", "content": "The largest-ever hole in ozone layer over the Arctic has closed, the Copernicus' Atmospheric Monitoring Service announced recently.In late March, scientists spotted signs of a rare hole forming and it was thought to be the result of low temperatures at the no… [+2329 chars]"}, {"source": {"id": null, "name": "Itechpost.com"}, "author": "iTech Post", "title": "Russian Simulations Find Life Can Exist on Venus as Microbrial Organisms Thrive on its Harsh Environment - iTech Post", "description": "Venus could hold life in a new simulated study by Russian scientists; find out the details here Finding life on other planets has always been both a dream and a hope for many scientists working in the field.", "url": "http://www.itechpost.com/articles/102452/20200427/russian-simulations-show-life-exist-venus-microbrial-organisms-thrive-harsh.htm", "urlToImage": "https://1401700980.rsc.cdn77.org/data/images/full/95711/venus-and-its-searing-hot-surface.jpg", "publishedAt": "2020-04-27T06:29:00Z", "content": "Russian Simulations Find Life Can Exist on Venus as Microbrial Organisms Thrive on its Harsh Environment\r\nFinding life on other planets has always been both a dream and a hope for many scientists working in the field. Experts have been searching the farthest … [+3312 chars]"}, {"source": {"id": "xinhua-net", "name": "Xinhua Net"}, "author": null, "title": "China builds Asia's largest steerable radio telescope for Mars mission - Xinhua | English.news.cn - Xinhua", "description": null, "url": "http://www.xinhuanet.com/english/2020-04/27/c_139011813.htm", "urlToImage": null, "publishedAt": "2020-04-27T06:21:26Z", "content": "Construction site of the steerable radio telescope in Wuqing District of northern China's Tianjin. (Photo provided to Xinhua)\r\nWith an antenna the size of nine basketball courts, a radio telescope built in north China will help receive data from the country's… [+2719 chars]"}, {"source": {"id": null, "name": "Wordlift.io"}, "author": "News Desk", "title": "COVID-19: NASA urges space fans not to travel to Florida to watch SpaceX's astronaut launch - Geospatial World", "description": "During an hour-long video conference on the US space agency’s response to COVID-19, NASA administrator Jim Bridenstine spoke about the Crew Dragon Demo-2 launch", "url": "http://data.wordlift.io/wl01287/post/covid-19__nasa_urges_space_fans_not_to_travel_to_florida_to_watch_spacexs_astronaut_launch", "urlToImage": "https://www.geospatialworld.net/wp-content/uploads/2020/04/nasa-7.jpg", "publishedAt": "2020-04-27T06:03:00Z", "content": "Photo:nasa.gov\r\nAs the fight against COVID-19 continues across the globe, NASA has urged space enthusiasts to remain at home during the launch of next month.\r\nDuring an hour-long video conference on the US space agencys response to COVID-19, NASA administrato… [+490 chars]"}, {"source": {"id": null, "name": "Sciencetimes.com"}, "author": "Staff Reporter", "title": "Emirate-Built Mars Explorer Sent to a Far Away Japanese Island for Its Final Preparation Ahead of Its July Lau - Science Times", "description": "UAE's Hope probe that is set to orbit Mars has arrived at its launch site in Japan ahead of its scheduled lift-off in July.", "url": "https://www.sciencetimes.com/articles/25471/20200427/emirate-built-mars-explorer-sent-far-away-japanese-island-final-launch.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/27200/emirate-built-mars-explorer-delivered-to-a-far-away-japanese-island-for-its-final-preparation-ahead-of-its-july-launch.jpg", "publishedAt": "2020-04-27T05:15:46Z", "content": null}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Digital Desk", "title": "Hubble telescope celebrates 30 years with portrait of a firestorm in a neighbouring galaxy - Republic World - Republic World", "description": "In the portrait, a giant red nebula and its smaller blue neighbour are part of a vast star-forming region in the Large Magellanic Cloud, a satellite galaxy", "url": "https://www.republicworld.com/technology-news/science/nasas-hubble-telescope-celebrates-30-years-with-a-portrait-of-a-fires.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/truj9pbrbzhjan2k_1587784760.jpeg?tr=f-jpeg", "publishedAt": "2020-04-27T04:49:41Z", "content": "Hubble Space Telescope celebrated 30 years in space with a new portrait of a firestorm of a starbirth in a neighboring galaxy. The image is nicknamed the \"Cosmic Reef,\" because NGC 2014 resembles part of a coral reef floating in a vast sea of stars. While som… [+2298 chars]"}, {"source": {"id": null, "name": "Ancient-origins.net"}, "author": "ancient-origins", "title": "Four Discoveries of Ancient Greek Astronomy That Still Baffle Experts - Ancient Origins", "description": "The Histories by Herodotus (484BC to 425BC) offers a remarkable window into the world as it was known by ancient Greek astronomy in the mid fifth century BC.", "url": "https://www.ancient-origins.net/news-history-archaeology/ancient-greek-astronomy-0013626", "urlToImage": "https://www.ancient-origins.net/sites/default/files/field/image/Ancient-Greek-astronomy.jpg", "publishedAt": "2020-04-27T03:20:08Z", "content": "The Histories by Herodotus (484BC to 425BC) offers a remarkable window into the world as it was known by ancient Greek astronomy in the mid fifth century BC. Almost as interesting as what they knew, however, is what they did not know. This sets the baseline f… [+7672 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "TWC India Edit Team", "title": "Scientists Develop First Comprehensive Map of the Moon's Surface - The Weather Channel", "description": "The designing of such a sharp, comprehensive map is a breakthrough in the field of lunar studies as it can help scientists understand the Moon better.", "url": "https://weather.com/en-IN/india/science/news/2020-04-27-scientists-develop-first-comprehensive-map-moon-surface", "urlToImage": "https://s.w-x.co/in-moonmap.jpg", "publishedAt": "2020-04-27T03:10:43Z", "content": "Orthographic projections of the \"Unified Geologic Map of the Moon\" showing the geology of the Moons near side (left) and far side (right) with shaded topography from the Lunar Orbiter Laser Altimeter (LOLA). \r\n(NASA/GSFC/USGS)\r\nScientists from the United Stat… [+3043 chars]"}, {"source": {"id": null, "name": "Ntd.com"}, "author": null, "title": "Astronomers Find ‘Alien’ Asteroids Living in Our Solar System - NTD", "description": "Scientists In the last few years have studied the first observed interstellar visitors to our solar system. They ...", "url": "https://www.ntd.com/astronomers-find-alien-asteroids-living-in-our-solar-system_459760.html", "urlToImage": "https://www.ntd.com/assets/uploads/2020/04/hypatia-h_c366e18130b318283e4732b33f9821f1-h_1edcc504575c2ddfdae277afd8d3b3ea.jpg", "publishedAt": "2020-04-27T01:28:55Z", "content": "Scientists In the last few years have studied the first observed interstellar visitors to our solar system. They include a comet called 2I/Borisov, spotted in 2019 and still passing through, and an asteroid named ‘Oumuamua that zipped through quickly in 2017.… [+4427 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Chinese space agency reveals Tianwen-1 is the name of the first unmanned mission to Mars - Firstpost", "description": "The name comes from “Tianwen”, or “Questions to Heaven”, a poem written by Qu Yuan who lived more than two millennia ago.", "url": "https://www.firstpost.com/tech/science/chinese-space-agency-reveals-tianwen-1-name-first-unmanned-mission-mars-8302401.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/03/mars-1280.jpg", "publishedAt": "2020-04-27T01:25:51Z", "content": "Chinas space agency on Friday unveiled the name of its first Mars exploration mission, coinciding with Chinas annual Space Day and the 50th anniversary of the launch of its first satellite.\r\nThe Mars mission has been named Tianwen-1, the official Xinhua news … [+904 chars]"}, {"source": {"id": null, "name": "Newslanded.com"}, "author": null, "title": "Scientists discover why Venus’ atmosphere behaves so strangely - News Landed", "description": "Horinouchi and his team were able to map the winds using ultraviolet imaging of Venus' clouds provided by the Japanese space probe Akatsuki.", "url": "https://newslanded.com/2020/04/26/venus-super-rotation/", "urlToImage": "https://newslanded.b-cdn.net/wp-content/uploads/2020/04/otFCeKHpqqqgKdg9WhzUR4-650-80.jpg", "publishedAt": "2020-04-26T21:45:05Z", "content": "For years scientists have wondered why Venus’ atmosphere spins so much faster than its surface. The answer, according to a recent study by a team of scientists led by Takeshi Horinouchi (Hokkaido University in Sapporo, Japan), lies in its thermal tides.\r\nAnim… [+1535 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "NASA Published Photo That Jupiter Looks Like Art Painting - Somag News", "description": "NASA, one of the space agencies working on space research, shared Jupiter’s photo resembling an art painting. The photo, on which a few minor plays were made, was taken by Juno, who has been orbiting the planet since 2016. NASA is observing many different pla…", "url": "https://www.somagnews.com/nasa-published-photo-jupiter-looks-like-art-painting/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2020/04/9-26-e1587931254509.jpg", "publishedAt": "2020-04-26T20:01:00Z", "content": "NASA, one of the space agencies working on space research, shared Jupiter’s photo resembling an art painting. The photo, on which a few minor plays were made, was taken by Juno, who has been orbiting the planet since 2016.\r\nNASA is observing many different pl… [+1670 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Shari Miller For Mailonline", "title": "First ever proof of meteorite killing a man uncovered in 1888 report to Ottoman sultan - Daily Mail", "description": "Documents show Ottoman Sultan Abdul Hamid II (left), was informed of a meteorite that killed one man and paralysed another after landing in Sulaymaniyah, Iraq, on August 22, 1888.", "url": "https://www.dailymail.co.uk/news/article-8258631/First-proof-meteorite-killing-man-uncovered-1888-report-Ottoman-sultan.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/04/26/17/27674526-0-image-a-2_1587919300209.jpg", "publishedAt": "2020-04-26T19:40:56Z", "content": "The first ever proof of a person being struck and killed by a meteorite might just have been discovered.\r\nResearchers at the Meteoritical Society have found evidence of a meteorite that killed one man and left another paralysed after it fell 'like rain' on a … [+2605 chars]"}, {"source": {"id": null, "name": "Orissapost.com"}, "author": "Post News Network", "title": "Rare merger of two black holes observed by scientists - OrissaPOST", "description": "Astronauts always crave to witness rare phenomena that can offer new premises for further research. Speaking of rare phenomena and research, there is probably nothing that can be of more interest to astronomers than black holes. Be it the time when it was men…", "url": "https://www.orissapost.com/rare-merger-of-two-black-holes-observed-by-scientists/", "urlToImage": "https://www.orissapost.com/wp-content/uploads/2020/04/Black-hole-merger-AP.jpeg", "publishedAt": "2020-04-26T16:35:00Z", "content": "Astronauts always crave to witness rare phenomena that can offer new premises for further research. Speaking of rare phenomena and research, there is probably nothing that can be of more interest to astronomers than black holes.\r\nBe it the time when it was me… [+1382 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Neha", "title": "Tectonic plates started shifting 3.2 billion years ago: Study - The Siasat Daily", "description": "New York: The Earth's tectonic plates started moving more than 3.2 billion years ago - just over 1.3 billion years after the Earth first formed and earlier than originally thought, researchers have revealed. To date, some researchers theorised it happened aro…", "url": "https://www.siasat.com/tectonic-plates-started-shifting-3-2-billion-years-ago-study-1880018/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/03/telescopes.jpg", "publishedAt": "2020-04-26T14:00:37Z", "content": "New York: The Earth’s tectonic plates started moving more than 3.2 billion years ago – just over 1.3 billion years after the Earth first formed and earlier than originally thought, researchers have revealed.\r\nTo date, some researchers theorised it happened ar… [+3044 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "How runny a liquid can be? - Tech Explorist", "description": "Viscosity (η) is the resistance of a liquid to flow. Liquids get thicker when cooled and runnier when heated, but how runny can a liquid ever get if we", "url": "https://www.techexplorist.com/runny-liquid/31826/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/04/fundamental-constants-of-Nature.jpg", "publishedAt": "2020-04-26T09:47:18Z", "content": "Viscosity () is the resistance of a liquid to flow. Liquids get thicker when cooled and runnier when heated, but how runny can a liquid ever get if we keep heating it?\r\nAt a point, the liquid reaches a specific temperature; it transitions between the liquid-l… [+3341 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu Net Desk", "title": "Watch | Great Barrier Reef suffers third major bleaching event - The Hindu", "description": "A video on the Great Barrier Reef that suffered its worst mass coral bleaching event in recent years", "url": "https://www.thehindu.com/sci-tech/energy-and-environment/great-barrier-reef-suffers-massive-coral-bleaching/article31436663.ece", "urlToImage": "https://www.thehindu.com/sci-tech/energy-and-environment/xnboqe/article31436714.ece/ALTERNATES/LANDSCAPE_615/Greatbarrierreefbleaching", "publishedAt": "2020-04-26T08:05:58Z", "content": "The Great Barrier Reef, the worlds largest coral reef ecosystem located in Australia, recently experienced its third major bleaching event in five years.\r\nIt is considered to be the most widespread coral bleaching event on record, owing to the rise in tempera… [+619 chars]"}, {"source": {"id": null, "name": "Defenceaviationpost.com"}, "author": "DefenceAviationPost", "title": "Mining on the Moon by the US, will Space Militarization follow soon? - - Defence Aviation Post", "description": "Last week, through an executive order by the US President Donald Trump, soon NASA is set to mine moon’s water ice and other natural resources. As early as 2015, the US had approved a law allowing Amer", "url": "https://www.defenceaviationpost.com/2020/04/mining-on-the-moon-by-the-us-will-space-militarization-follow-soon/", "urlToImage": "https://secureservercdn.net/198.71.233.254/bmb.1a0.myftpupload.com/wp-content/uploads/2020/04/moon-earth-e1586863031969.jpg?time=1587982906", "publishedAt": "2020-04-26T06:51:52Z", "content": "Last week, through an executive order by the US President Donald Trump, soon NASA is set to mine moons water ice and other natural resources. As early as 2015, the US had approved a law allowing American companies and citizens to use moon and asteroid resourc… [+1063 chars]"}]}