{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Team finds link between blood vessel inflammation, malfunctioning cellular powerhouses - Phys.org", "description": "The vast majority of cells in the human body contain tiny power plants known as mitochondria that generate much of the energy cells use for day-to-day activities. Like a dynamic renewable resource, these little power plants are constantly dividing and uniting…", "url": "https://phys.org/news/2020-05-team-link-blood-vessel-inflammation.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/templefindsl.jpg", "publishedAt": "2020-05-11T10:36:30Z", "content": "The vast majority of cells in the human body contain tiny power plants known as mitochondria that generate much of the energy cells use for day-to-day activities. Like a dynamic renewable resource, these little power plants are constantly dividing and uniting… [+3811 chars]"}, {"source": {"id": null, "name": "Zmescience.com"}, "author": "Rob Lea", "title": "Playing Asteroids is No Game: Humanity’s Future Could Depend on Diverting Asteroid Impacts - ZME Science", "description": "It isn't hyperbole to say, the survival of our species may depend on a sucessful method of preventing an asteroid impact. It isn't hyperbole to say, the survival of our species may depend on a sucessful method of preventing an asteroid impact.", "url": "https://www.zmescience.com/space/asteroid-deflection-methods-0423r/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2020/05/Go-AWAY.jpg", "publishedAt": "2020-05-11T10:35:10Z", "content": "Earth is surrounded by thousands of Near-Earth Objects, a few of these are potentially hazardous, and fewer still which are classified as planet killers. An impact from the latter carries implications as severe the name suggests. Clearly, we need a method of … [+14318 chars]"}, {"source": {"id": null, "name": "Iol.co.za"}, "author": "Mwangi Githahu", "title": "SA scientists help solve the mystery of galaxies that spew X-shaped radio waves - IOL", "description": "South African scientists using the MeerKAT telescope have solved a galactic puzzle that has perplexed astronomers for years, and their discovery is set to be published.", "url": "https://www.iol.co.za/capeargus/news/sa-scientists-help-solve-the-mystery-of-galaxies-that-spew-x-shaped-radio-waves-47801034", "urlToImage": "https://image.iol.co.za/image/1/process/1000x366?source=https://inm-baobab-prod-eu-west-1.s3.amazonaws.com/public/inm/media/image/118634730.JPG&operation=CROP&offset=0x219&resize=997x561", "publishedAt": "2020-05-11T10:32:58Z", "content": "Using the high-quality imaging provided by the MeerKAT telescope, inaugurated in 2018, scientists from the South African Radio Astronomy Observatory (SARAO), solved a longstanding puzzle in X-shaped radio galaxies by observing a galaxy called PKS 2014-55 that… [+2269 chars]"}, {"source": {"id": null, "name": "Kttn.com"}, "author": "View all posts by Alisa Nelson →", "title": "Missouri astronaut prepares for historic SpaceX launch - kttn", "description": "Later this month, north St. Louis County native Bob Behnken will put on his spacesuit and command the historic SpaceX flight to the International Space Station. He will strap into his seat in the cockpit of the Dragon spacecraft and fire up the vehicle. After…", "url": "https://www.kttn.com/missouri-astronaut-prepares-for-historic-spacex-launch/", "urlToImage": "https://www.kttn.com/wp-content/uploads/2020/05/Missouri-astronaut-Bob-Behnken.jpg", "publishedAt": "2020-05-11T10:17:10Z", "content": "Later this month, north St. Louis County native Bob Behnken will put on his spacesuit and command the historic SpaceX flight to the International Space Station. He will strap into his seat in the cockpit of the Dragon spacecraft and fire up the vehicle. After… [+2212 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Coronavirus: ‘Happy’ victims defy medical knowledge - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-05-11T10:14:00Z", "content": null}, {"source": {"id": null, "name": "Sciencefocus.com"}, "author": "Sara Rigby, PA Science", "title": "5G: Driverless cars could warn each other of dangers using new network - sciencefocus.com", "description": "Researchers said a vehicle-generated early warning system that alerts drivers is feasible within the next few years using 5G.", "url": "https://www.sciencefocus.com/news/5g-driverless-cars-could-warn-each-other-of-dangers-using-new-network/", "urlToImage": "https://images.immediate.co.uk/production/volatile/sites/4/2020/05/GettyImages-1207719682-crop-5e40760.jpg?quality=90&crop=4px,129px,931px,401px&resize=960,413", "publishedAt": "2020-05-11T09:32:00Z", "content": "Cars could be able to talk to each other to warn about dangers on the roads using 5G technology in future, according to researchers.\r\nExperts at Glasgow Caledonian University (GCU) believe 5G may enable driverless cars to send each other messages about risks … [+2956 chars]"}, {"source": {"id": null, "name": "Nanowerk.com"}, "author": null, "title": "Scientists create new recipe for single-atom transistors - Nanowerk", "description": "Linking multiple copies of these devices may lay the foundation for quantum computing.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=55118.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id55118.jpg", "publishedAt": "2020-05-11T09:20:35Z", "content": null}, {"source": {"id": null, "name": "Econotimes.com"}, "author": null, "title": "New study suggests exoplanets that have hydrogen-rich atmospheres are habitable - EconoTimes", "description": "When it comes to determining if a distant or nearby planet is habitable, scientists usually search for the fundamental elements found in Earths atmosphere in the atmospheres of these other planets. However, a new study...", "url": "https://www.econotimes.com/New-study-suggests-exoplanets-that-have-hydrogen-rich-atmospheres-are-habitable-1582149", "urlToImage": "https://s1.econotimes.com/assets/uploads/20200511da6a8379c0c31edd4_th_1024x0.jpg", "publishedAt": "2020-05-11T09:18:14Z", "content": "When it comes to determining if a distant or nearby planet is habitable, scientists usually search for the fundamental elements found in Earth’s atmosphere in the atmospheres of these other planets. However, a new study suggests a new way of determining wheth… [+2000 chars]"}, {"source": {"id": null, "name": "Eurekalert.org"}, "author": null, "title": "Chameleon materials: The origin of color variation in low-dimensional perovskites - EurekAlert", "description": "Some light-emitting diodes (LEDs) created from perovskite, a class of optoelectronic materials, emit light over a broad wavelength range. Scientists from the University of Groningen have now shown that in some cases, the explanation of why this happens is inc…", "url": "https://www.eurekalert.org/pub_releases/2020-05/uog-cmt050820.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/231401_web.jpg", "publishedAt": "2020-05-11T09:02:24Z", "content": "IMAGE: This is Maria Loi, Professor of Photophysics and Optoelectronics at the University of Groningen\r\n view more \r\nCredit: Sylvia Germes\r\nSome light-emitting diodes (LEDs) created from perovskite, a class of optoelectronic materials, emit light over a broad… [+5454 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "Incredibly rare new Super-Earth planet discovered - Tech Explorist", "description": "Astronomers at the University of Canterbury (UC) have found an incredibly rare new Super-Earth planet towards the centre of the galaxy.", "url": "https://www.techexplorist.com/incredibly-rare-new-super-earth-planet-discovered/32193/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/05/earth.jpg", "publishedAt": "2020-05-11T08:58:21Z", "content": "Astronomers at the University of Canterbury (UC) have discovered new one in a million Super-Earth planet towards the center of the galaxy. The planet is one of just a handful that has been found with both size and orbit equivalent to that of Earth.\r\nThe plane… [+2126 chars]"}, {"source": {"id": null, "name": "Inceptivemind.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "US Space Force prepares to launch reusable X-37B OTV with its sixth mission - Inceptive Mind", "description": "The US Air Force plans to launch the sixth mission of X-37B Orbital Test Vehicle (OTV-6) on May 16 that will host more experiments than any prior missions.", "url": "https://www.inceptivemind.com/us-space-force-prepares-launch-reusable-x-37b-otv-sixth-mission/13173/", "urlToImage": "https://www.inceptivemind.com/wp-content/uploads/2020/05/X-37B-Orbital-Test-Vehicle.jpg", "publishedAt": "2020-05-11T07:13:17Z", "content": "The US military continues to research reusable spaceflight technology with the X-37B Orbital Test Vehicle (OTV). On Wednesday, the Department of the Air Force Rapid Capabilities Office, in partnership with the US Space Force, announced the planning of a new f… [+2696 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Building blocks: ESA study find human urine could be used to make concrete on the moon - Firstpost", "description": "The main ingredient in “lunar concrete” would be a powdery soil found on the moon’s surface known as lunar regolith.", "url": "https://www.firstpost.com/tech/science/building-blocks-esa-study-find-human-urine-used-make-concrete-moon-8354871.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/05/Lunar_soil_simulant_article-1.jpg", "publishedAt": "2020-05-11T05:42:24Z", "content": "The Associated PressMay 11, 2020 11:00:52 IST\r\n The European Space Agency said Friday that human urine could one day become a useful ingredient in making concrete to build on the moon.\r\nThe agency said researchers in a recent study it sponsored found that ure… [+1564 chars]"}, {"source": {"id": null, "name": "Sciencetimes.com"}, "author": "Staff Reporter", "title": "Jellyfish-like Parasite Can Live Without Oxygen: The First of Its Kind - Science Times", "description": "First multicellular organism with no mitochondrial genome living its life without breathing. The common concept that all organisms need oxygen to live might be wrong as researchers discovered a unique organism that does not need to breathe to survive.", "url": "https://www.sciencetimes.com/articles/25636/20200511/jellyfish-parasite-live-without-oxygen-first-kind.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/27489/jellyfish-like-parasite-can-live-without-oxygen-the-first-of-its-kind.png", "publishedAt": "2020-05-11T05:07:39Z", "content": null}, {"source": {"id": null, "name": "Collectspace.com"}, "author": null, "title": "10-story-tall NASA logo being repainted for new astronaut launches - collectSPACE.com", "description": "NASA is refreshing its logo for a new era a human spaceflight. The 10-story-tall insignia that adorns the side of the space agency's iconic Vehicle Assembly Building (VAB) at the Kennedy Space Center is getting its first fresh coat of paint in more than a dec…", "url": "http://www.collectspace.com/news/news-051120a-nasa-vab-logo-repaint.html", "urlToImage": "http://www.collectspace.com/images/news-051120b-fb.jpg", "publishedAt": "2020-05-11T05:05:56Z", "content": "May 11, 2020\r\n — NASA is refreshing its logo for a new era a human spaceflight.\r\nThe 10-story-tall insignia that adorns the side of the space agency's iconic Vehicle Assembly Building (VAB) is receiving a fresh coat of paint. The emblem's bright red vector an… [+3038 chars]"}, {"source": {"id": "xinhua-net", "name": "Xinhua Net"}, "author": null, "title": "Researchers propose new computational imaging method based on physics-enhanced deep neural network - Xinhua | English.news.cn - Xinhua", "description": null, "url": "http://www.xinhuanet.com/english/2020-05/11/c_139047214.htm", "urlToImage": null, "publishedAt": "2020-05-11T04:25:51Z", "content": "BEIJING, May 11 (Xinhua) -- Researchers have proposed and demonstrated a new computational imaging method by the incorporation of a physical model into a deep neural network, according to a recent research article published in the journal Light: Science and A… [+974 chars]"}, {"source": {"id": null, "name": "Ibtimes.com"}, "author": "Inigo Monzon", "title": "ESA Releases Audio Recording Of Spacecraft’s Earth Flyby - International Business Times", "description": "The European Space Agency (ESA) has released the audio recording of the BepiColombo spacecraft during its near-Earth flyby last month. As noted by the agency, sounds made by the spacecraft and other factors in space can be heard in the recording.", "url": "https://www.ibtimes.com/esa-releases-audio-recording-spacecrafts-earth-flyby-2973849", "urlToImage": "https://s1.ibtimes.com/sites/www.ibtimes.com/files/styles/full/public/2020/04/01/bepicolombo.jpg", "publishedAt": "2020-05-11T04:13:38Z", "content": "KEY POINTS\r\n<ul><li>ESA released the audio recordings of BepiColombo's Earth flyby</li><li>BepiColombo flew close to Earth for a slingshot maneuver</li><li>Sounds produced by space and the spacecraft can be heard in the recordings </li></ul>\r\nThe European Spa… [+2299 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aylin Woodward", "title": "Stunning Fossil Reveals Brutal Squid Attack From 200 Million Years Ago - ScienceAlert", "description": "A squid-like creature attempted to strangle a fish 200 million years ago. Both animals died during the attack, and were fossilized together.", "url": "https://www.businessinsider.com/rare-fossil-shows-squid-ancestor-attacking-prehistoric-fish-2020-5", "urlToImage": "https://i.insider.com/5eb5856c204ad365cc0d8033?width=1200&format=jpeg", "publishedAt": "2020-05-11T01:57:38Z", "content": "About 200 million years ago, a brutal underwater attack took place in the Atlantic. A squid-like creature, armed with 10 tentacles studded with hooks, swam up to a prehistoric fish. The predator wrapped its long arms around the fish's head and crushed its sku… [+2750 chars]"}, {"source": {"id": null, "name": "Frasercoastchronicle.com.au"}, "author": "Stuart Fast, Stuart Fast", "title": "'Easiest, safest' form of COVID testing launches in Bay - Balonne Beacon", "description": "Hervey Bay and Bundaberg will each have a drive-through coronavirus testing clinic", "url": "https://www.frasercoastchronicle.com.au/news/easiest-safest-form-of-covid-testing-launches-in-b/4012599/", "urlToImage": "https://media.apnarm.net.au/media/images/2020/05/10/v3imagesbin5d42bec329fef07e8077656562e7abf1-uge01lc5k0gbqkr7bu2_ct1880x930.jpg", "publishedAt": "2020-05-11T00:03:46Z", "content": "FROM today, Hervey Bay residents will have access to increased coronavirus testing without having to leave their cars.\r\nQML Pathology has extended its drive-through COVID-19 testing\r\nnetwork with the opening of new facilities in Hervey Bay and Bundaberg.\r\nQML… [+1133 chars]"}, {"source": {"id": null, "name": "Duluthnewstribune.com"}, "author": null, "title": "Astro Bob: Get ready for comet SWAN and four more fabulous fuzzies - Duluth News Tribune", "description": "\"Astro\" Bob King is a freelance writer for the News Tribune. Read more of his work at astrobob.areavoices.com.", "url": "https://www.duluthnewstribune.com/news/science-and-nature/6485778-Astro-Bob-Get-ready-for-comet-SWAN-and-four-more-fabulous-fuzzies", "urlToImage": "https://www.duluthnewstribune.com/incoming/6485781-lsrwcd-SWAN-Rhemann-tail-disconnect-May-4_Fea2.jpg/alternates/BASE_LANDSCAPE/SWAN%20Rhemann%20tail%20disconnect%20May%204_Fea2.jpg", "publishedAt": "2020-05-11T00:00:00Z", "content": "Many of us look forward to bright comets. Theyre among the most beautiful objects to see in the night sky. The last truly memorable one for Northern Hemisphere skywatchers was Hale-Bopp in 1996 and 1997. All you had to do was open the front door and face the … [+3228 chars]"}, {"source": {"id": null, "name": "961.com.au"}, "author": "tiashadebray", "title": "There Will Be Shooting Stars Visible All Over Australia Tonight & We're Talking At Least 50 Per Hour - KIIS1011", "description": "Does anyone else feel like there are more astrological phenomenons happening these last few months than usual? Or are we only paying attention to them now that we’re bored at home… The Eta Aquarids Meteor is set to peak tonight/tomorrow at 4AM so if you’re co…", "url": "https://www.961.com.au/lifestyle/there-will-be-shooting-stars-visible-all-over-australia-tonight-were-talking-at-least-50-per-hour/", "urlToImage": "https://www.961.com.au/wp-content/uploads/sites/9/2020/05/photo-of-sky-during-sunset-1937687.jpg?crop=0px,0px,4128px,2320px&resize=2400,1350&quality=75", "publishedAt": "2020-05-10T22:54:44Z", "content": "Does anyone else feel like there are more astrological phenomenons happening these last few months than usual?\r\nOr are we only paying attention to them now that we’re bored at home…\r\nThe Eta Aquarids Meteor is set to peak tonight/tomorrow at 4AM so if you’re … [+287 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Most Extensive System of Haze Layers in the Solar System Have Been Discovered on Saturn - SciTechDaily", "description": "High-resolution images obtained by the Cassini spacecraft were used for this purpose by the Planetary Science Group at the University of the Basque Country. A rich variety of meteorological phenomena take place in the extensive hydrogen atmosphere of the plan…", "url": "https://scitechdaily.com/most-extensive-system-of-haze-layers-in-the-solar-system-have-been-discovered-on-saturn/", "urlToImage": "https://scitechdaily.com/images/Saturns-Hexagon-Haze-Layers.jpg", "publishedAt": "2020-05-10T22:33:24Z", "content": "High-resolution images of Saturn’s Hexagon obtained by the Cassini spacecraft. Credit: UPV/EHU\r\nHigh-resolution images obtained by the Cassini spacecraft were used for this purpose by the Planetary Science Group at the University of the Basque Country.\r\nA ric… [+4297 chars]"}, {"source": {"id": null, "name": "Universalnews.org"}, "author": null, "title": "The Count down begins for NASA's Mars Rover 2020 launch - Universal News", "description": "The Count down begins for NASA's Mars Rover 2020 launch Engineers working on NASA's Mars Rover mission at Kennedy Space Centre in Florida started placing the ro", "url": "https://universalnews.org/the-count-down-begins-for-nasas-mars-rover-2020-launch/", "urlToImage": "https://universalnews.org/wp-content/uploads/2020/05/Mars-Rover-2020.jpg", "publishedAt": "2020-05-10T17:48:29Z", "content": "Engineers working on NASA’s Mars Rover mission at Kennedy Space Centre in Florida started placing the rover and the space components into the configuration as there are 68 days left for a mission to the red planet. The launch period kicks off on July 17th.\r\nT… [+1574 chars]"}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Tanya Thompson", "title": "Phytoplankton Is The Carbon Pump of the Oceans - Dual Dove", "description": "An essential role in the ocean’s ecosystem is played by organisms known as phytoplankton. Currently, a hot topic in the field of biology is how global warming affects the production of phytoplankto…", "url": "https://www.dualdove.com/phytoplankton-is-the-carbon-pump-of-the-oceans/10219/", "urlToImage": "https://www.dualdove.com/wp-content/uploads/2020/05/Phytoplankton.jpg", "publishedAt": "2020-05-10T14:26:15Z", "content": "An essential role in the oceans ecosystem is played by organisms known as phytoplankton. Currently, a hot topic in the field of biology is how global warming affects the production of phytoplankton. New research on the matter with data collected by the Climat… [+1830 chars]"}, {"source": {"id": null, "name": "Montrealgazette.com"}, "author": "Jill Barker, Special to Montreal Gazette", "title": "Fitness: Can exercise boost your immunity? - Montreal Gazette", "description": "Fitness: Can exercise boost your immunity?", "url": "https://montrealgazette.com/life/fitness-can-exercise-boost-your-immunity", "urlToImage": "https://postmediamontrealgazette2.files.wordpress.com/2020/05/0402-col-kramberger-1.jpg", "publishedAt": "2020-05-10T13:35:43Z", "content": "Article content continued\r\nWhats the best exercise prescription for boosting immunity? Focus on moderate to vigorous workouts under 60 minutes, most if not all days of the week. If you choose to go for an extra-long run or bike ride, enhance recovery by follo… [+980 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Japanese asteroid probe discovers space rock Ryugu made close pass of Sun - Telangana Today", "description": "Hyderabad: Japan’s Hayabusa2 asteroid probe has already accomplished a lot. After launching in 2014 and spending several years travelling to intercept the space rock known as Ryugu, it made many key observations and even took samples of the asteroid before de…", "url": "https://telanganatoday.com/japanese-asteroid-probe-discovers-space-rock-ryugu-made-close-pass-of-sun", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2020/05/Hayabusa.jpg", "publishedAt": "2020-05-10T13:02:40Z", "content": "Hyderabad: Japans Hayabusa2 asteroid probe has already accomplished a lot. After launching in 2014 and spending several years travelling to intercept the space rock known as Ryugu, it made many key observations and even took samples of the asteroid before dep… [+2951 chars]"}, {"source": {"id": null, "name": "Haaretz.com"}, "author": "Ruth Schuster", "title": "Deadly heat and humidity emerging decades ahead of forecasts - Haaretz", "description": "***", "url": "https://www.haaretz.com/science-and-health/.premium-deadly-heat-and-humidity-emerging-decades-ahead-of-forecasts-1.8834668", "urlToImage": "https://www.haaretz.com/polopoly_fs/1.8834918.1589114466!/image/1733211255.jpg_gen/derivatives/headline_1200x630/1733211255.jpg", "publishedAt": "2020-05-10T12:53:37Z", "content": "Lethal heat and humidity combination isn’t futuristic, it’s already here \r\nUnsurvivable heat and humidity conditions are already emerging worldwide decades ahead of expectations. A study published Friday in Science Advances identified thousands of unusual or … [+4858 chars]"}, {"source": {"id": null, "name": "Maritime-executive.com"}, "author": null, "title": "SpaceX Ship Rescues Boater - The Maritime Executive", "description": "The crew of the SpaceX Fleet ship Go Searcher performed a good Samaritan rescue on Friday while prac...", "url": "https://www.maritime-executive.com/article/spacex-ship-rescues-boater", "urlToImage": "https://www.maritime-executive.com/media/images/article/Photos/Miscellaneous/go-searcher-credit-nasa.884b15.jpg", "publishedAt": "2020-05-10T09:34:27Z", "content": "Credit: NASA\r\nBy\r\nThe Maritime Executive \r\n05-10-2020 05:34:27 \r\nThe crew of the SpaceX Fleet ship Go Searcher performed a good Samaritan rescue on Friday while practicing recovery of the Crew Dragon astronaut capsule.\r\nThe 54-year-old man was rescued by the … [+1300 chars]"}, {"source": {"id": null, "name": "Kxan36news.com"}, "author": null, "title": "The scientist warned against getting a virus from Mars to Earth - The KXAN 36 News", "description": null, "url": "http://www.kxan36news.com/the-scientist-warned-against-getting-a-virus-from-mars-to-earth", "urlToImage": null, "publishedAt": "2020-05-10T07:01:00Z", "content": "the Alien viruses can enter the Earth through the rock samples from Mars. In an interview with Stanford News warned Stanford University Professor Scott Hubbard.\r\nthe Scientist believes that removed from the surface of the red planet the stones have to be trea… [+713 chars]"}, {"source": {"id": null, "name": "Clarksvilleonline.com"}, "author": null, "title": "NASA's Dione CubeSat mission to study Earth's Upper Atmosphere, Space Weather - Clarksville Online", "description": "Greenbelt, MD - NASA has selected a new pathfinding CubeSat mission to gather data not collected since the agency flew the Dynamics Explorer in the early", "url": "https://www.clarksvilleonline.com/2020/05/10/nasas-dione-cubesat-mission-to-study-earths-upper-atmosphere-space-weather/", "urlToImage": "https://www.clarksvilleonline.com/wp-content/uploads/2020/05/NASA’s-Dione-CubeSat-mission-to-study-Earth’s-Upper-Atmosphere-2.jpg", "publishedAt": "2020-05-10T06:34:55Z", "content": "Greenbelt, MD – NASA has selected a new pathfinding CubeSat mission to gather data not collected since the agency flew the Dynamics Explorer in the early 1980s.\r\nThe new mission, called Dione after the ancient Greek goddess of the oracles, will carry four min… [+5538 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Mohana Basu", "title": "Scientists reveal why North Magnetic Pole has shifted from Canada towards Siberia - ThePrint", "description": "ScientiFix, our weekly feature, offers you a summary of the top global science stories of the week, with links to their sources.", "url": "https://theprint.in/scientifix/scientists-reveal-why-north-magnetic-pole-has-shifted-from-canada-towards-siberia/417884/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2018/08/HadeanEarth_swri_1500.jpg", "publishedAt": "2020-05-10T02:39:25Z", "content": "Scientists have discovered why the North Magnetic Pole has, in recent years, shifted away from Canada towards Siberia. A team from the University of Leeds in the UK says this is explained by the competition of two magnetic “blobs” on the edge of the Earth’s o… [+3447 chars]"}, {"source": {"id": null, "name": "Newsheads.in"}, "author": "Ankit Pal", "title": "Scientists analyze Cassini data to learn why Saturn is hot on outer layer - NEWS HEADS", "description": "Cassini started studying Saturn way back in 2004 and died in 2017, but the date collected by it is still being studied to reveal the mysteries surrounding planet Saturn.", "url": "https://www.newsheads.in/science/space/scientists-analyze-cassini-data-to-learn-why-saturn-is-hot-on-outer-layer-article-61554", "urlToImage": "https://static.newsheads.in/media/thumbs/2020/05/10/203854368-cassini-saturn_1200x675.jpg", "publishedAt": "2020-05-10T01:15:00Z", "content": "New Delhi : Cassini started studying Saturn way back in 2004 and died in 2017, but the date collected by it is still being studied to reveal the mysteries surrounding planet Saturn.\r\nThe spacecraft had been known for providing date that can be helpful in unde… [+1036 chars]"}, {"source": {"id": null, "name": "Cbs12.com"}, "author": "Kyle Spinner", "title": "Quantum House holds drive by parade | WTVX - cw34.com", "description": "Police sirens, fire truck sirens, and car horns were in full force Saturday morning at Quantum House in West Palm Beach for a drive-by parade. Drivers and passengers came honking and filled with cheer, bringing excitement to kids and families staying at Quant…", "url": "http://cbs12.com/news/offbeat/quantum-house-holds-drive-by-parade", "urlToImage": "http://static-30.sinclairstoryline.com/resources/media/47304e8e-9b55-445e-aa12-1f2018f088d6-large16x9_IMG_3351.jpg?1589056961961", "publishedAt": "2020-05-09T23:14:28Z", "content": "©   | Portions are ©  Associated Press. All rights reserved. This material may not be published, broadcast, rewritten, or distributed.\r\nWTVX-TV - The CW West Palm provides local West Palm Beach weather and entertainment for West Palm Beach and nearby towns an… [+313 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Gabriel Pogrund, Shingi Mararike, Shanti Das and Nicholas Hellen", "title": "Coronavirus lockdown: calls grow for release of restless twentysomethings - The Times", "description": "In a suburb of Stevenage, Hertfordshire, a young man disguised as a bush can be seen on video, shuffling down the street, using front gardens as camouflage to avoid the police. “What’s our neighbour", "url": "https://www.thetimes.co.uk/article/coronavirus-lockdown-calls-grow-for-release-of-restless-twentysomethings-57pt8qj8z", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Fsundaytimes%2Fprod%2Fweb%2Fbin%2Fc35851e2-921d-11ea-9a8f-77c6fe41afdf.jpg?crop=2667%2C1500%2C0%2C0&resize=685", "publishedAt": "2020-05-09T23:01:00Z", "content": "In a suburb of Stevenage, Hertfordshire, a young man disguised as a bush can be seen on video, shuffling down the street, using front gardens as camouflage to avoid the police. Whats our neighbour doing? says the narrator. Reaching new extremes in how to snea… [+482 chars]"}, {"source": {"id": null, "name": "Theparisnews.com"}, "author": "Neil Sperry", "title": "A failing cedar elm needs attention from an arborist - Paris News", "description": "Q.", "url": "http://theparisnews.com/lifestyles/article_33ca6932-9247-11ea-8db9-63aeac128346.html", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/theparisnews.com/content/tncms/assets/v3/editorial/5/97/5979aa26-9247-11ea-b3f4-07df80b84403/5eb7337cf1a4b.image.jpg?resize=450%2C630", "publishedAt": "2020-05-09T22:48:00Z", "content": "Q.\r\n Dear Neil: I am attaching a photo of our cedar elm. The problem started last June after our sewer line was replaced (on other side of the yard). I dont know if the roots were damaged when they dug up the line or if something else happened, but one entire… [+5867 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Harmful Algal Blooms in Arabian Sea Fueled by Shrinking Snowcaps - SciTechDaily", "description": "Climate-driven shifts disrupt fisheries, desalination plants; problems may hit other regions. A uniquely resilient organism all but unheard of in the Arabian Sea 20 years ago has been proliferating and spreading at an alarming pace, forming thick, malodorous …", "url": "https://scitechdaily.com/harmful-algal-blooms-in-arabian-sea-fueled-by-shrinking-snowcaps/", "urlToImage": "https://scitechdaily.com/images/Noctiluca-Blooms-Arabian-Sea-scaled.jpg", "publishedAt": "2020-05-09T22:44:08Z", "content": "Noctiluca blooms in the Arabian Sea, as seen from space. Credit: Norman Kuring/NASA\r\nClimate-driven shifts disrupt fisheries, desalination plants; problems may hit other regions.\r\nA uniquely resilient organism all but unheard of in the Arabian Sea 20 years ag… [+6079 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Japanese asteroid probe discovers an incredible secret - India Gone Viral", "description": "Japan’s Hayabusa2 asteroid probe snapped images that reveal the space rock had a close encounter with the Sun. Scorched rock was present on the asteroid’s surface, appearing red in spectral analysis a", "url": "https://indiagoneviral.com/science/2020/05/10/japanese-asteroid-probe-discovers-an-incredible-secret/55446/india-gone-viral/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2017/01/headshot.png", "publishedAt": "2020-05-09T22:03:28Z", "content": "<ul><li>Japans Hayabusa2 asteroid probe snapped images that reveal the space rock had a close encounter with the Sun. </li><li>Scorched rock was present on the asteroids surface, appearing red in spectral analysis and indicating extreme heating over a short p… [+3125 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Emerging Across the Globe: Potentially Fatal Combinations of Heat and Humidity - SciTechDaily", "description": "US Gulf Coast among regions hit with conditions not expected for decades. Most everyone knows that humid heat is harder to handle than the \"dry\" kind. And recently, some scientists have projected that later in the century, in parts of the tropics and subtropi…", "url": "https://scitechdaily.com/emerging-across-the-globe-potentially-fatal-combinations-of-heat-and-humidity/", "urlToImage": "https://scitechdaily.com/images/Emerging-Worldwide-Hot-Spots-Crop.jpg", "publishedAt": "2020-05-09T19:06:40Z", "content": "A new study shows that extreme, sometimes potentially fatal, mixtures of heat and humidity are emerging across the globe. This map shows documented instances, with hotter colors from yellow to red signifying the worst combinations as measured on the Centigrad… [+9007 chars]"}, {"source": {"id": null, "name": "Actionnewsnow.com"}, "author": null, "title": "'Jurassic Park' raptors may not have hunted in packs like they did in the movies - Action News Now", "description": "Despite how they appear in the movie \"Jurassic Park,\" it turns out velociraptors probably did not hunt in packs and most likely had feathers.", "url": "https://www.actionnewsnow.com/content/national/570313072.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200507172323-jurassic-park-velociraptor-hunt-orig-mg-00010229-live-video.jpg", "publishedAt": "2020-05-09T18:31:00Z", "content": "The fearsome raptors that terrorized visitors to \"Jurassic Park\" may not have hunted in packs, like they did on screen.\r\nThat's the finding of a new study that analyzed teeth from Deinonychus antirrhopus, wolf-sized raptors that lived in what is now North Ame… [+3909 chars]"}, {"source": {"id": null, "name": "Spaceref.com"}, "author": null, "title": "Earth from Space: Northwest Greenland - Space Ref", "description": null, "url": "http://spaceref.com/earth/earth-from-space-northwest-greenland.html", "urlToImage": null, "publishedAt": "2020-05-09T17:15:00Z", "content": "Northwest Greenland is featured in this icy image captured by the Copernicus Sentinel-3 mission.\r\nLying in the North Atlantic Ocean, Greenland is the world's largest island and is home to the second largest ice sheet after Antarctica. Greenland's ice sheet co… [+2181 chars]"}, {"source": {"id": null, "name": "Coastalmorningstar.com"}, "author": "Claude Denni", "title": "Space Force to Get Deeper Understanding into Inner Workings of SpaceX Commercial Launches - Coastal Morning Star", "description": "The agreement for on-National Security Space fleet surveillance gives the Space Force access to SpaceX missions until November.", "url": "http://coastalmorningstar.com/2020/05/09/space-force-to-get-deeper-understanding-into-inner-workings-of-spacex-commercial-launches/", "urlToImage": "http://coastalmorningstar.com/wp-content/uploads/2020/05/https___blogs-images.forbes.com_jonathanocallaghan_files_2018_12_30934146778_db76aa9637_k-1-1200x675.jpg", "publishedAt": "2020-05-09T16:41:06Z", "content": "SpaceX on May 6 was granted an $8.9 million agreement change that gives the U.S. Space Force direct knowledge into the inward functions of the organization’s business and common space missions.\r\nThe agreement for on-National Security Space fleet surveillance … [+1443 chars]"}, {"source": {"id": null, "name": "Rocketrundown.com"}, "author": null, "title": "China's Newest Crew Capsule Touches Down After Maiden Mission - Rocket Rundown", "description": "China’s maiden next-generation crew capsule mission touched down at 05:49 UTC on May 7 completed a successful uncrewed test flight.", "url": "https://rocketrundown.com/chinas-newest-crew-capsule-touches-down-after-maiden-mission/", "urlToImage": "https://rocketrundown.com/wp-content/uploads/2020/05/china-crew-capsule.jpg", "publishedAt": "2020-05-09T16:36:58Z", "content": "Image credit: China Aerospace Science and Technology Corporation\r\nChina has successfully completed an uncrewed test mission of its next-generation crew capsule. \r\nChinas newest crew capsule was launched from the Wenchang Space Launch Center On May 5. After ap… [+1691 chars]"}, {"source": {"id": null, "name": "Techthelead.com"}, "author": "Arthur Fleck", "title": "Tom Cruise To Cruise In Space For His New Movie - TechTheLead", "description": "According to Jim Bridenstine, NASA administrator, Tom Cruise is doing his new movie in space, more precisely on the International Space Station.  The agency confirmed that the project is in the works to CNN, and while the NASA administrator didn’t comment on …", "url": "https://techthelead.com/tom-cruise-to-cruise-in-space-for-his-new-movie/", "urlToImage": "https://d3eys52k95jjdh.cloudfront.net/wp-content/uploads/2020/05/Tom-Cruise-in-space-1000x600.jpg", "publishedAt": "2020-05-09T16:06:07Z", "content": "According to Jim Bridenstine, NASA administrator, Tom Cruise is doing his new movie in space, more precisely on the International Space Station. \r\nThe agency confirmed that the project is in the works to CNN, and while the NASA administrator didn’t comment on… [+1093 chars]"}, {"source": {"id": null, "name": "Newsinfopark.com"}, "author": "NIP Web Desk Team", "title": "Whoa! Comet ATLAS got brighter this week - News Info Park", "description": "Comet C/2019 Y4 (ATLAS) was getting brighter. Then, sadly, the Hubble Space Telescope caught it apparently disintegrating. Now … surprise. Veteran comet observer Terry Lovejoy reported earlier today t", "url": "https://newsinfopark.com/science/2020-05-09/article/whoa-comet-atlas-got-brighter-this-week-33860/nip-web-desk-team/", "urlToImage": "https://earthsky.org/upl/2020/05/comet-ATLAS-brightening-May5-to-May9-2020-Terry-Lovejoy-e1589024078106.png", "publishedAt": "2020-05-09T15:06:54Z", "content": "Comet ATLAS the comet that doesnt want to die via Terry Lovejoy (@TerryLovejoy66 on Twitter).\r\nEarlier this year, comet C/2019 Y4 (ATLAS) seemed to be brightening steadily. Many hoped it would become bright enough to see with the eye alone. Then suddenly the … [+1677 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Russia – leader in number of space debris - The Times Hub", "description": null, "url": "https://thetimeshub.in/russia-leader-in-number-of-space-debris/16496/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2020/05/85b2f133be25b2be05f9a9a51b1ed4cc-700x394.jpg", "publishedAt": "2020-05-09T15:06:43Z", "content": "British scientists conducted a study on the amount of space debris in orbit, to set the country that litter most. As a result, the leadership went to Russia, “ahead” of the competitors several times.\r\nToday, in Earth orbit there are more than 30 thousands of … [+1298 chars]"}, {"source": {"id": null, "name": "Tehrantimes.com"}, "author": null, "title": "The last supermoon of 2020 - Tehran Times", "description": "The flower supermoon rises above Howz-e Soltan salt lake, 85 km south of Tehran, on Thursday, May 7, 2020.", "url": "https://www.tehrantimes.com/news/447681/The-last-supermoon-of-2020", "urlToImage": "https://media.tehrantimes.com/d/t/2020/05/09/4/3446341.jpg", "publishedAt": "2020-05-09T13:31:21Z", "content": "The flower supermoon rises above Howz-e Soltan salt lake, 85 km south of Tehran, on Thursday, May 7, 2020. \r\nThe year's final supermoon was at its most impressive, with the so-called 'Flower Moon' named for the increased fertility of plants during early May a… [+168 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Morgan McFall-Johnsen", "title": "Astronomers just stitched together an unprecedented portrait of Jupiter in infrared — and realized its Great R - Business Insider India", "description": "New images of Jupiter reveal that its Great Red Spot has holes. The infrared portrait of the planet also shows that lightning bolts form alongside 40-mile-high", "url": "https://www.businessinsider.in/science/news/astronomers-just-stitched-together-an-unprecedented-portrait-of-jupiter-in-infrared-and-realized-its-great-red-spot-is-full-of-holes/articleshow/75647749.cms", "urlToImage": "https://www.businessinsider.in/photo/75647749/astronomers-just-stitched-together-an-unprecedented-portrait-of-jupiter-in-infrared-and-realized-its-great-red-spot-is-full-of-holes.jpg?imgsize=158713", "publishedAt": "2020-05-09T13:19:00Z", "content": "New snapshots of Jupiter reveal its turbulent weather in infrared — the spectrum of light just beyond visible wavelengths.\r\nTo get these unprecedentedly sharp images, a team of researchers from NASA and the University of California, Berkeley combined data fro… [+2625 chars]"}, {"source": {"id": null, "name": "Newsinfopark.com"}, "author": "NIP Web Desk Team", "title": "Mysterious Giant Viruses: Gargantuan in Size and Complexity - News Info Park", "description": "In recent years, giant viruses have been unearthed in several of the world’s most mysterious locations, from the thawing permafrost of Siberia to locations unknown beneath the Antarctic ice. But don’t", "url": "https://newsinfopark.com/science/2020-05-09/article/mysterious-giant-viruses-gargantuan-in-size-and-complexity-33767/nip-web-desk-team/", "urlToImage": "https://scitechdaily.com/images/Tupanvirus-777x437.jpg", "publishedAt": "2020-05-09T13:05:46Z", "content": "In recent years, giant viruses have been unearthed in several of the worlds most mysterious locations, from the thawing permafrost of Siberia to locations unknown beneath the Antarctic ice. But dont worry, The Thing is still a work of science fiction. For now… [+5118 chars]"}, {"source": {"id": null, "name": "Ibtimes.sg"}, "author": "https://www.ibtimes.sg/reporters/jeevan-biswas", "title": "Neanderthals had a knack of choosing the right kind of animal bones to make tools, finds study - International Business Times, Singapore Edition", "description": "A new study by researchers from UC Davis has found that Neanderthals specifically chose bovine bones to make tools to turn hide into leather", "url": "https://www.ibtimes.sg/neanderthals-had-knack-choosing-right-kind-animal-bones-make-tools-finds-study-44712", "urlToImage": "https://data.ibtimes.sg/en/full/36756/neanderthal.jpg", "publishedAt": "2020-05-09T12:44:58Z", "content": "The level of intelligence and sophistication of Neanderthals has been a subject of debate among anthropologists. However, new research suggests that these ancient relatives of modern humans who lived nearly 40,000 years ago were experts when it came to pickin… [+2926 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Aylin Woodward", "title": "A rare fossil preserved a squid attack from 200 million years ago — the squid ancestor viciously crushed the h - Business Insider India", "description": "A rare, 200-million-year-old fossil found off the southern coast of the UK preserved an encounter in which a squid ancestor crushed the head of a prehistoric", "url": "https://www.businessinsider.in/science/news/a-rare-fossil-preserved-a-squid-attack-from-200-million-years-ago-the-squid-ancestor-viciously-crushed-the-head-of-a-prehistoric-fish/articleshow/75646432.cms", "urlToImage": "https://www.businessinsider.in/photo/75646432/a-rare-fossil-preserved-a-squid-attack-from-200-million-years-ago-the-squid-ancestor-viciously-crushed-the-head-of-a-prehistoric-fish.jpg?imgsize=1034133", "publishedAt": "2020-05-09T11:59:00Z", "content": "About 200 million years ago, a brutal underwater attack took place in the Atlantic. A squid-like creature, armed with 10 tentacles studded with hooks, swam up to a prehistoric fish. The predator wrapped its long arms around the fish's head and crushed its sku… [+2551 chars]"}, {"source": {"id": null, "name": "Rtnnewspaper.com"}, "author": "Daniel Groves", "title": "Scientists find honey bees can trigger \"virgin births\" - RTN Newspaper", "description": "Researchers at Sydney University have discovered a single gene that determines Cape honey bees in South Africa reproduce without having sex. The GB45239 or Chromosome 11 gene allows worker bees to lay eggs that only produce females, instead of the normal male…", "url": "https://www.rtnnewspaper.com/2020/05/news-bites-scientists-find-honey-bees-can-trigger-virgin-births-with-a-single-gene/", "urlToImage": "https://www.rtnnewspaper.com/wp-content/uploads/2020/05/honey-bee.jpg", "publishedAt": "2020-05-09T11:21:00Z", "content": "Researchers at Sydney University have discovered a single gene that determines Cape honey bees in South Africa reproduce without having sex.\r\nThe GB45239 or Chromosome 11 gene allows worker bees to lay eggs that only produce females, instead of the normal mal… [+102 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Charles Q. Choi | INSIDE SCIENCE", "title": "Microbes could survive on planets with all-hydrogen atmospheres - ABC News", "description": "", "url": "https://abcnews.go.com/Technology/microbes-survive-planets-hydrogen-atmospheres/story?id=70581628", "urlToImage": "https://s.abcnews.com/images/Technology/asteroid-planet-sh-jef-200508_hpMain_16x9_992.jpg", "publishedAt": "2020-05-09T11:20:15Z", "content": "This is an Inside Science story.\r\nMicrobes can survive and grow in 100% hydrogen atmospheres, suggesting life could potentially evolve on a much broader range of alien worlds than is often considered, a new study has found.\r\nHydrogen is the most common elemen… [+2338 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Kurt Streeter", "title": "Breanna Stewart’s Comeback Is Going to Take a Little Longer - The New York Times", "description": "The 2018 W.N.B.A. most valuable player’s return from a torn Achilles’ tendon was stalled by the coronavirus pandemic. Now she’s just trying to cope with being stuck inside.", "url": "https://www.nytimes.com/2020/05/09/sports/basketball/breanna-stewart-wnba-return.html", "urlToImage": "https://static01.nyt.com/images/2020/05/10/sports/09timeout-stewart-1/09timeout-stewart-1-facebookJumbo.jpg", "publishedAt": "2020-05-09T11:09:51Z", "content": "Along with the rest of the world, athletes have had their careers upended by the coronavirus pandemic. They are giving The New York Times an intimate look at their journeys in periodic installments through the rest of the year.\r\nOver the last decade Breanna S… [+6391 chars]"}, {"source": {"id": null, "name": "News-daily.com"}, "author": "Jack Guy, CNN", "title": "China takes step toward space station with new rocket launch - News-Daily.com", "description": "China's latest large carrier rocket made its first successful flight Tuesday, an important step in the nation's plan to build a space station, according to state-run news agency Xinhua.", "url": "https://www.news-daily.com/news/world_nation/china-takes-step-toward-space-station-with-new-rocket-launch/article_9b7a7b62-0da7-5a48-a17f-2fb8321a8955.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/news-daily.com/content/tncms/assets/v3/editorial/5/f7/5f7a0828-3cc3-5ac1-92d0-875ed1c3c39f/5eb2e6768569e.image.jpg?resize=1119%2C630", "publishedAt": "2020-05-09T07:05:16Z", "content": "China's latest large carrier rocket made its first successful flight Tuesday, an important step in the nation's plan to build a space station, according to state-run news agency Xinhua.\r\nThe Long March-5B rocket blasted off from the Wenchang Space Launch Cent… [+2324 chars]"}, {"source": {"id": null, "name": "Goachronicle.com"}, "author": "GC NewsDesk", "title": "Huge Asteroid to pass by earth today - Goa Chronicle", "description": "Hyderabad: A huge Asteroid called \"52768 (1998 OR2)\" will have “closest approach to earth”, passing at distance of 0.42 AU i.e. 62,90,364 km, at 1526 hours on Wednesday. This is the closest for this a", "url": "https://goachronicle.com/huge-asteroid-to-pass-by-earth-today/", "urlToImage": "https://i0.wp.com/goachronicle.com/wp-content/uploads/2020/04/2020_4largeimg29_Apr_2020_094410417.jpg?fit=595%2C350&ssl=1", "publishedAt": "2020-05-09T06:12:28Z", "content": "Hyderabad: A huge Asteroid called “52768 (1998 OR2)” will have closest approach to earth, passing at distance of 0.42 AU i.e. 62,90,364 km, at 1526 hours on Wednesday.\r\nThis is the closest for this asteroid can get to earth in next 59 years, Planetary Society… [+1705 chars]"}, {"source": {"id": null, "name": "Techquila.co.in"}, "author": null, "title": "The Most Comprehensive Map of The Moon Yet - TechQuila", "description": "The recently released lunar map by USGS is the most comprehensive and detailed yet and it uses multiple sources for data collection.", "url": "https://www.techquila.co.in/moon-map/", "urlToImage": "https://www.techquila.co.in/wp-content/uploads/2020/05/1200px-FullMoon2010.jpg", "publishedAt": "2020-05-09T05:35:00Z", "content": "The moon has been the object of fascination for the most audacious explorers amongst us. The mere thought of a human setting foot on the natural satellite has sparked support as well as opposition for a long time. It is no wonder then that the act of putting … [+2601 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": null, "title": "Experience of Astronauts Who Return to Earth Amid Pandemic - http://www.newsgram.com/", "description": "Two U.S. astronauts say it’s hard to comprehend the changes on Earth that have occurred due to the coronavirus pandemic. This is a breaking news.", "url": "https://www.newsgram.com/experience-astronauts-earth-pandemic/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2020/04/covid-4948866_1280.jpg", "publishedAt": "2020-04-13T14:28:25Z", "content": "BY SAEED NAQVI\r\nWhen the tortoise agreed to ferry a stranded scorpion on its back across the river, which was in spate, he didn’t know what he had bargained for. Midway, the scorpion stung the tortoise, deep, through its hard shell.\r\n“Why have you done this?”… [+6167 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "One step closer to understanding the human brain : Study - ETHealthworld.com", "description": "An international team of scientists led by researchers at Karolinska Institutet in Sweden has launched a comprehensive overview of all proteins expressed in the brain, published today in the journal Science.", "url": "https://health.economictimes.indiatimes.com/news/industry/one-step-closer-to-understanding-the-human-brain-study/74513929", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-74513929,imgsize-126472,width-800,height-434,overlay-ethealthworld/one-step-closer-to-understanding-the-human-brain-study.jpg", "publishedAt": "2020-03-06T12:21:20Z", "content": "Representative image \r\nAn international team of scientists led by researchers at Karolinska Institutet in Sweden has launched a comprehensive overview of all proteins expressed in the brain, published today in the journal Science. The open-access database off… [+3239 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": null, "title": "NASA Aims to Understand More About Venus, Moons of Jupiter and Neptune - http://www.newsgram.com/", "description": "NASA is funding studies that aim to understand more about Venus, Jupiter's moon Io and a unique and highly active icy moon of Neptune, Triton.", "url": "https://www.newsgram.com/nasa-venus-moons-jupiter-neptune/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2020/02/venus-11022_1280.jpg", "publishedAt": "2020-02-15T18:09:19Z", "content": "NASA’s Hubble Space Telescope and the ground-based Gemini Observatory in Hawaii have teamed up with the Juno spacecraft to probe the mightiest storms on the giant planet Jupiter.\r\nThe images, part of a multi-year joint programme, revealed that lightning strik… [+2735 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "'Ghost' ancestors: African DNA study detects mysterious human species - ETHealthworld.com", "description": "Scientists examining the genomes of West Africans have detected signs that a mysterious extinct human species interbred with our own species tens of thousands of years ago in Africa, the latest evidence of humankind's complicated genetic ancestry.", "url": "https://health.economictimes.indiatimes.com/news/industry/ghost-ancestors-african-dna-study-detects-mysterious-human-species/74144091", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-74144091,imgsize-620723,width-800,height-434,overlay-ethealthworld/ghost-ancestors-african-dna-study-detects-mysterious-human-species.jpg", "publishedAt": "2020-02-15T01:50:22Z", "content": "By Will DunhamWASHINGTON - Scientists examining the genomes of West Africans have detected signs that a mysterious extinct human species interbred with our own species tens of thousands of years ago in Africa, the latest evidence of humankind's complicated ge… [+2553 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": null, "title": "SpaceX Plans To Send NASA Astronauts To Space in Q2 This Year - http://www.newsgram.com/", "description": "After NASA and SpaceX successfully completed a launch escape demonstration of the company's Crew Dragon spacecraft and Falcon 9 rocket.", "url": "https://www.newsgram.com/spacex-send-nasa-astronauts-space/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2020/01/NASA-Logo1.jpg", "publishedAt": "2020-01-20T16:14:21Z", "content": "NASA’s Hubble Space Telescope and the ground-based Gemini Observatory in Hawaii have teamed up with the Juno spacecraft to probe the mightiest storms on the giant planet Jupiter.\r\nThe images, part of a multi-year joint programme, revealed that lightning strik… [+2735 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Mining Materials for 3D Printing in Space - Machine Design", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiaGh0dHBzOi8vd3d3Lm1hY2hpbmVkZXNpZ24uY29tLzNkLXByaW50aW5nLWNhZC9hcnRpY2xlLzIxODM1Mzk4L21pbmluZy1tYXRlcmlhbHMtZm9yLTNkLXByaW50aW5nLWluLXNwYWNl0gEA?oc=5", "urlToImage": null, "publishedAt": "2019-12-13T20:17:38Z", "content": null}, {"source": {"id": null, "name": "Tass.com"}, "author": "TASS", "title": "First woman in space says Russians will be first on Mars - TASS", "description": "The first female cosmonaut Valentina Tereshkova told a forum she would have been ready to go to the Red Planet herself, if it was not for her age", "url": "https://tass.com/science/913692", "urlToImage": "https://phototass1.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20161121/1153178.jpg", "publishedAt": "2019-06-14T22:16:38Z", "content": "YAROSLAVL, November 21. /TASS/. The first female cosmonaut Valentina Tereshkova said on Monday she believed Russians would be the first to land on Mars and she would have been ready to go to the Red Planet herself, if it was not for her age.Tereshkova made th… [+724 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "Curiosity Rover of NASA Snaps its Last Selfie on Martian Ridge - http://www.newsgram.com/", "description": "After spending more than a year on a twisting ridge on Mars, NASA's Curiosity rover has snapped its last selfie as it moves on to new sights on the Red Planet", "url": "https://www.newsgram.com/curiosity-rover-of-nasa-snaps-its-last-selfie-on-martian-ridge/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2018/08/17552520976_796f5b0214_z-1.jpg", "publishedAt": "2019-01-31T05:14:47Z", "content": "NASA’s Hubble Space Telescope and the ground-based Gemini Observatory in Hawaii have teamed up with the Juno spacecraft to probe the mightiest storms on the giant planet Jupiter.\r\nThe images, part of a multi-year joint programme, revealed that lightning strik… [+2735 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "Moon May Have Harboured Life 4 Billion Years Ago, Research Suggests - http://www.newsgram.com/", "description": "While the Moon is presently unsuitable for habitation, there could have been life on its surface about four billion years ago, researchers have suggested.", "url": "https://www.newsgram.com/moon-may-harboured-life-4-billion-years-ago-research-suggests/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2018/07/moon-2762111_1920.jpg", "publishedAt": "2018-07-25T05:09:47Z", "content": "People can keep wearing contact lenses during the coronavirus (COVID-19) pandemic, as long as they observe good hand hygiene and follow appropriate wear-and-care directions, say researchers.\r\nThe study delves into multiple aspects of eye health amidst the glo… [+2551 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "NASA Funding Project RAMA To Turn Asteroids Into Spaceships - http://www.newsgram.com/", "description": "NASA has recently announced it would give funds to a California-based 3D printing company for finding ways to turn asteroids into giant, autonomous spacecraft, which could fly to outposts in space, the media reported.", "url": "https://www.newsgram.com/nasa-funding-project-rama-turn-asteroids-spaceships/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2018/06/4224653858_a94b8bb840_o.jpg", "publishedAt": "2018-07-09T04:27:41Z", "content": "NASA’s Hubble Space Telescope and the ground-based Gemini Observatory in Hawaii have teamed up with the Juno spacecraft to probe the mightiest storms on the giant planet Jupiter.\r\nThe images, part of a multi-year joint programme, revealed that lightning strik… [+2735 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "NASA Scientists Reveal New Information on Mars' Formation and Evolution, Claim The Red Planet has a Porous Crust - http://www.newsgram.com/", "description": "Washington, Septemeber 15, 2017 : Mars’s crust is not as dense as previously thought and a lower density likely means that at least part of the Red Planet’s crust is relatively porous, says a new NASA study. The findings, published in the journal Geophysical …", "url": "https://www.newsgram.com/nasa-scientists-mars-formatio-evolution-porous-crust/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2017/09/Mars.v1.jpg", "publishedAt": "2017-09-15T04:47:21Z", "content": "NASA’s Hubble Space Telescope and the ground-based Gemini Observatory in Hawaii have teamed up with the Juno spacecraft to probe the mightiest storms on the giant planet Jupiter.\r\nThe images, part of a multi-year joint programme, revealed that lightning strik… [+2735 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "Delhi government plans bill to save Yamuna - http://www.newsgram.com/", "description": "New Delhi: There seems to be hope yet for the dying Yamuna river. Delhi's AAP government is planning to bring new legislation to save Yamuna.", "url": "https://www.newsgram.com/delhi-government-plans-bill-to-save-yamuna/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2015/10/Sunset-at-the-Yamuna-River-Boat-ride-e1445169174104.jpg", "publishedAt": "2017-06-17T07:39:03Z", "content": "New Delhi: There seems to be hope yet for the dying Yamuna river.\r\nDelhi’s AAP government is planning to bring new legislation to eliminate multiplicity of authorities that has contributed to the Yamuna, once northern India’s pride and lifeline, turning into … [+2891 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "NASA releases its latest Global maps of Earth at Night, provides clearest patterns of Human Settlement across the Planet - http://www.newsgram.com/", "description": "NASA has released its latest global maps of Earth at night, providing the \"clearest yet composite\" view of patterns of human settlement across our planet.", "url": "https://www.newsgram.com/nasa-releases-its-latest-global-maps-of-earth-at-night-provides-clearest-patterns-of-human-settlement-across-the-planet/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2016/11/earth.jpg", "publishedAt": "2017-06-13T14:36:47Z", "content": "NASA’s Hubble Space Telescope and the ground-based Gemini Observatory in Hawaii have teamed up with the Juno spacecraft to probe the mightiest storms on the giant planet Jupiter.\r\nThe images, part of a multi-year joint programme, revealed that lightning strik… [+2735 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "Archaeologists discover a 5000 year-old beer making room in China - http://www.newsgram.com/", "description": "It is confirmed that the brewery is the oldest beer making facility ever found in China, capable of using advanced beer-making techniques.", "url": "https://www.newsgram.com/archaeologists-discover-a-5000-year-old-beer-making-room-in-china/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2016/05/beers.jpg", "publishedAt": "2017-06-13T04:24:30Z", "content": "A research by the University of Oxford published on Tuesday showed efforts to rebuild economies after the devastation of coronavirus would be strengthened by including agreen’ measures such as clean energy infrastructure investment.\r\nThis first-of-its-kind st… [+3051 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "Backward Assam Village Heads for Brighter Days - http://www.newsgram.com/", "description": "Life remained stuck in a morass of underdevelopment in Bakrapara village in Rani development block, just 30 km from the state's main city of Guwahati.", "url": "https://www.newsgram.com/backward-assam-village-heads-for-brighter-days/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2016/05/A_Village_of_Karimganj_District_Assam..jpg", "publishedAt": "2017-06-12T07:04:16Z", "content": "Rani (Assam): Forty-five-year-old Dhaneswar Boro is excited that his days of illiteracy are over. He can now write his name is Assamese and he is gradually getting to know his rights as an Indian citizen.\r\nBut it was a bleak story till last year. Life remaine… [+3425 chars]"}]}