{"status": "ok", "totalResults": 35, "articles": [{"source": {"id": null, "name": "Republicworld.com"}, "author": "Zaini Majeed", "title": "Spinosaurus terrorized rivers and river banks as a semi-aquatic animal: Study - Republic World - Republic World", "description": "Scientists found that the Spinosaurus was actually marine reptile, known as the Plesiosaurs, which, despite their appearance, are not dinosaurs.", "url": "https://www.republicworld.com/world-news/rest-of-the-world-news/spinosaurus-were-first-dinosaur-aquatic-species-say-researchers.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/i5rum98cppgcihaa_1588433612.jpeg?tr=f-jpeg", "publishedAt": "2020-05-03T06:03:00Z", "content": "In a groundbreaking discovery, scientists have discovered that the largest and most enigmatic dinosaur species known as the Spinosaurus aegyptiacus was a proficient swimmer and not the typical land-dweller, which has long been the matter of debate. Belonging … [+2714 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Vishal Mathur", "title": "Gotta be Aliens! There is a Powerful Radio Signal Coming From Within Our Galaxy - News18", "description": "The SGR 1935+2154, a dead star that is around 30,000 light-years away from earth, registered for the radio observatories around the world with a single and millisecond-long burst of incredibly bright radio waves.", "url": "https://www.news18.com/news/tech/gotta-be-aliens-there-is-a-powerful-radio-signal-coming-from-within-our-galaxy-2603283.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/02/Space-Photos-Captured-by-Spitzer-Space-Telescope-10.jpg", "publishedAt": "2020-05-03T04:37:48Z", "content": "There is a very powerful radio signal that is doing rounds in our galaxy, and astronomers are perplexed because this is the first ever fast radio burst (FRB) originating in our own galaxy. And this has happened as recently as April 28, when SGR 1935+2154, a d… [+2097 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Mohana Basu", "title": "Alabama school student names NASA’s first Mars helicopter, a 2-kg, solar-powered craft - ThePrint", "description": "ScientiFix, our weekly feature, offers you a summary of the top global science stories of the week, with links to their sources.", "url": "https://theprint.in/scientifix/alabama-school-student-names-nasas-first-mars-helicopter-a-2-kg-solar-powered-craft/413337/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2019/07/316873868_1-7-e1562642806173.jpg", "publishedAt": "2020-05-03T04:35:35Z", "content": "Alabama student names NASA’s Mars helicopter ‘Ingenuity’\r\nNASA’s Mars helicopter — destined to be the first aircraft to attempt powered flights on another planet — has been named ‘Ingenuity’.\r\nThe name was picked during NASA’s “Name the Rover” essay contest. … [+5237 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Who is the chess player on Mars? - India Gone Viral", "description": "5/2/2020 – A “Mars opposition” occurs when planet Earth passes in between the Sun and planet Mars. It happens every 2 years and 2 months – 779.94 Earth days to be precise. Then Mars becomes a beautifu", "url": "https://indiagoneviral.com/science/2020/05/03/who-is-the-chess-player-on-mars/49122/india-gone-viral/", "urlToImage": "https://shop.chessbase.com/en/pics/pth_8225_141", "publishedAt": "2020-05-03T03:01:03Z", "content": "The Mars Opposition\r\nOn Wednesday, August 27 2003, at 10:51 GMT, the planet Mars approached the earth closer than at any time during the last 60,000 years. It became the brightest object in the night sky, a beautiful red jewel in the firmament, with an appare… [+4960 chars]"}, {"source": {"id": null, "name": "Pragativadi.com"}, "author": "pragativadinewsservice", "title": "Satellite images show melting ice sheets in Antarctica and Greenland - Pragativadi", "description": "New York: Fresh data from NASA showed clear images of Antarctica’s rapidly melting ice. NASA satellites have provided more data than ever before on what has been happening to Antarctica and Greenland's ice over the past 16 years with dire.Both polar", "url": "https://pragativadi.com/satellite-images-show-melting-ice-sheets-in-antarctica-and-greenland/", "urlToImage": "https://i1.wp.com/pragativadi.com/wp-content/uploads/2020/05/IMG_20200503_080216.jpg?fit=1080%2C698&ssl=1", "publishedAt": "2020-05-03T02:41:00Z", "content": "New York: Fresh data from NASA showed clear images of Antarcticas rapidly melting ice. NASA satellites have provided more data than ever before on what has been happening to Antarctica and Greenland’s ice over the past 16 years with dire.\r\nBoth polar ice shee… [+1163 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Lockdown effect: No rules of social distancing apply here - The Financial Express", "description": "Social media use surges; average time spent on platforms like Facebook and Instagram up by over 60%.", "url": "https://www.financialexpress.com/industry/technology/lockdown-effect-no-rules-of-social-distancing-apply-here/1946444/", "urlToImage": "https://images.financialexpress.com/2020/05/1-23.jpg", "publishedAt": "2020-05-02T20:23:47Z", "content": "Even when we were not forced by a lockdown and a deadly virus to remain physically distant from friends and family, social media was a popular way to remain in touch. Now, it is the only way, barring phone calls.\r\nData also points likewise. A recent report by… [+3546 chars]"}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Paula Tudoran", "title": "The Sun Shows Peculiar Behavior in Comparison With Other Similar Stars in the Universe - Dual Dove", "description": "The Sun is proving some unusual behavior, researchers have claimed: it seems to be very quiet in comparison to its galactic fellows. A new study used data collected by Kepler Space Telescope to dra…", "url": "https://www.dualdove.com/the-sun-shows-peculiar-behavior-in-comparison-with-other-similar-stars-in-the-universe/9963/", "urlToImage": "https://www.dualdove.com/wp-content/uploads/2020/05/Sun.jpg", "publishedAt": "2020-05-02T17:31:21Z", "content": "The Sun is proving some unusual behavior, researchers have claimed: it seems to be very quiet in comparison to its galactic fellows. A new study used data collected by Kepler Space Telescope to draw a comparison between the brightness of the Sun with other si… [+1921 chars]"}, {"source": {"id": null, "name": "Clicklancashire.com"}, "author": null, "title": "A piece of the moon for sale: Just £2 mil - ClickLancashire", "description": "", "url": "https://clicklancashire.com/2020/05/02/a-piece-of-the-moon-for-sale-just-2-mil.html", "urlToImage": null, "publishedAt": "2020-05-02T16:20:48Z", "content": "A piece of the moon is available for the right price.\r\nOne of the world's largest lunar meteorites goes on private sale at Christie's on Thursday, valued at $3,800,000 AUD.\r\nThe moon rock, formally known as NWA 12691, weighs more than 13.5 kg and is believed … [+1938 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "NASA begs spectators for astronaut launch: Please stay home! - Moneycontrol", "description": "It will be the first launch of astronauts from NASA’s Kennedy Space Center in nine years — ever since the last space shuttle flight in 2011. It also will be the first attempt by a private company to fly astronauts to orbit.", "url": "https://www.moneycontrol.com/news/world/nasa-begs-spectators-for-astronaut-launch-please-stay-home-5215601.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2019/10/nasa-2313267_1280-770x432-770x433.jpg", "publishedAt": "2020-05-02T15:58:15Z", "content": "NASA and SpaceX on Friday urged spectators to stay home for the first home launch of astronauts in nearly a decade because of the coronavirus pandemic.\r\nTop officials warned the public against traveling to Florida for the May 27 launch of two NASA astronauts … [+1504 chars]"}, {"source": {"id": null, "name": "Gizbot.com"}, "author": "Sharmishte Datti", "title": "NASA VITAL Ventilators Get FDA Approval To Fight COVID-19 - Gizbot", "description": "As the coronavirus pandemic continued sweeping across the globe, NASA put a halt on its usual space-related activities and began developing a prototype ventilator to help combat the deadly virus. Now the NASA VITAL ventilator got FDA approval.", "url": "https://www.gizbot.com/news/nasa-vital-ventilators-to-fight-covid-19-get-fda-approval-067437.html", "urlToImage": "https://www.gizbot.com/img/2020/05/nasa-vital-ventilators-to-fight-covid-19-get-fda-approval-1588349841.jpg", "publishedAt": "2020-05-02T13:22:46Z", "content": "As the coronavirus pandemic continued sweeping across the globe, NASA put a halt on its usual space-related activities and began developing a prototype ventilator to help combat the deadly virus. The newly developed ventilator has just received emergency appr… [+2445 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Eta Aquariid meteor shower: When and how to watch - msnNOW", "description": "The Eta Aquariid meteor shower is expected to peak on Tuesday, but a nearly full moon could outshine the show. They may be most visible on Sunday morning before dawn on Sunday, with a better chance for more visible meteors in the southern hemisphere.", "url": "https://www.cnn.com/2020/05/02/world/eta-aquariid-meteor-shower-scn-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200501152109-eta-aquariid-meteor-shower-restricted-super-tease.jpg", "publishedAt": "2020-05-02T11:15:00Z", "content": null}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "In search of dark matter with the coldest material of the universe - Tech Explorist", "description": "A study in PRL reports on how researchers at ICFO have built a spinor BEC comagnetometer, an instrument for studying the axion, a hypothetical particle that may explain the mystery of dark matter.", "url": "https://www.techexplorist.com/in-search-of-dark-matter-with-the-coldest-material-of-the-universe/31989/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/05/axdarkmatter.jpg", "publishedAt": "2020-05-02T10:16:36Z", "content": "Our current understanding of cosmology and nuclear physics suggests that dark matter can be formed from axions, hypothetical particles with unusual symmetry properties.\r\nIn a new study, scientists reported a new way to search for axions using the unique prope… [+1315 chars]"}, {"source": {"id": null, "name": "Thetrendingtimes.com"}, "author": "Candace Neil", "title": "Researchers Find Fossil of New and Peculiar Mammal - The Trending Times", "description": "While space agencies are busy searching for signs of alien life on other planets, the truth is that our Earth is thriving with peculiar creatures. Furthermore, there are new creatures...", "url": "https://thetrendingtimes.com/researchers-find-fossil-of-new-and-peculiar-mammal/4972/", "urlToImage": "https://thetrendingtimes.com/wp-content/uploads/2020/05/Researchers-Find-Fossil-of-New-and-Peculiar-Mammal.jpg", "publishedAt": "2020-05-02T09:34:10Z", "content": "While space agencies are busy searching for signs of alien life on other planets, the truth is that our Earth is thriving with peculiar creatures. Furthermore, there are new creatures found, as our planet is rich in resources capable of creating the perfect h… [+1893 chars]"}, {"source": {"id": null, "name": "Newslanded.com"}, "author": null, "title": "Newly found superconductor could revolutionize Quantum Computers - News Landed", "description": "Superconductors are materials that offer no resistance in conducting electricity or flow electrons from one atom to another.", "url": "https://newslanded.com/2020/05/02/new-superconductor-quantum-computers/", "urlToImage": "https://newslanded.b-cdn.net/wp-content/uploads/2020/05/043020_ec_superconductor_feat_rev_opt1-1028x579-1.jpg", "publishedAt": "2020-05-02T09:21:35Z", "content": "Electric current was found along the edge of a newly found superconductor.\r\nScientists, for the first time, observed semiconducting current flowing along the edge of the material. Physicist Nai Phuan Ong and colleagues from Princeton University found this phe… [+2785 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "'I Recommend the Moon': On Astronomy Day 2020, Read Interesting Sayings by Famous Astronauts - News18", "description": "Celebrated twice a year, the first International Astronomy Day is held on May 2 while the next occasion will be observed on September 26.", "url": "https://www.news18.com/news/world/i-recommend-the-moon-on-international-astronomy-day-2020-read-interesting-sayings-by-famous-astronauts-2602205.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/02/Space.jpg", "publishedAt": "2020-05-02T06:15:39Z", "content": "New Delhi: The International Astronomy Day is celebrated twice a year during autumn and spring. While 2020s first Astronomy Day is held on May 2, it will be celebrated again on September 26. \r\nOn this day, museums, societies, astronomical institutions and pla… [+1352 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": null, "title": "NASA wants to buy at the “Roscosmos” additional space on the “Union” - The Times Hub", "description": null, "url": "https://thetimeshub.in/nasa-wants-to-buy-at-the-roscosmos-additional-space-on-the-union/13466/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2020/05/cb6acd2943e6221d689a4f919168a2da-633x400.jpg", "publishedAt": "2020-05-02T06:06:59Z", "content": "The American space Agency has begun negotiations with the Russian state Corporation “Roscosmos” on the subject of acquiring additional space on the “Union”. The fact of such talks, said earlier the head of NASA Jim Breidenstein.\r\nAccording to Bridenstine, the… [+925 chars]"}, {"source": {"id": null, "name": "Indiablooms.com"}, "author": "Indiablooms", "title": "Arctic observes alarming levels of ozone depletion - indiablooms", "description": "Geneva/UNI: Depletion of the ozone layer, the shield that protects life on Earth from harmful levels of ultraviolet radiation, reached an unprecedented level over large parts of the Arctic this spring, World Meteorological Organisation said on Saturday.", "url": "https://indiablooms.com/health-details/E/6236/arctic-observes-alarming-levels-of-ozone-depletion.html", "urlToImage": "https://indiablooms.com/health_pic/2020/2-1588398072.jpg", "publishedAt": "2020-05-02T05:43:20Z", "content": "Geneva/UNI: Depletion of the ozone layer, the shield that protects life on Earth from harmful levels of ultraviolet radiation, reached an unprecedented level over large parts of the Arctic this spring, World Meteorological Organisation said on Saturday.\r\nThe … [+1478 chars]"}, {"source": {"id": null, "name": "Indiaeducationdiary.in"}, "author": null, "title": "UBC researchers establish new timeline for ancient magnetic field on Mars - India Education Diary", "description": "Mars had a global magnetic field much earlier—and much later—in the planet’s history than scientists have previously known. A planet’s global magnetic field arises from what scientists call a dynam…", "url": "https://indiaeducationdiary.in/ubc-researchers-establish-new-timeline-for-ancient-magnetic-field-on-mars/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/05/Maven-artists-concept-02-1024x622-1.jpg?fit=1024%2C622&ssl=1", "publishedAt": "2020-05-02T05:17:50Z", "content": "Mars had a global magnetic field much earlierand much laterin the planets history than scientists have previously known.\r\nA planets global magnetic field arises from what scientists call a dynamo: a flow of molten metal within the planets core that produces a… [+3796 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Bhavya Sukheja", "title": "NASA Artemis mission: SpaceX, Blue Origin and Dynetics chosen to design HLS - Republic World - Republic World", "description": "The US space agency NASA has reportedly chosen SpaceX, Blue Origin and Dynetics to design and develop human landing systems (HLS) for its Artemis program.", "url": "https://www.republicworld.com/technology-news/science/nasa-picks-spacex-blue-origin-and-dynetics-to-design-hls.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/7apgvivvzoa7xfsy_1588376097.jpeg?tr=f-jpeg", "publishedAt": "2020-05-02T01:30:40Z", "content": "The US space agency NASA has reportedly chosen SpaceX, Blue Origin and Dynetics to design and develop human landing systems (HLS) for its Artemis program. The three companies will be working on their designs over the next year after which NASA will select one… [+2653 chars]"}, {"source": {"id": null, "name": "Theweek.in"}, "author": null, "title": "Army researchers achieve great feat in quantum computing at room temperature - THE WEEK", "description": "Scientists have proved feasibility of quantum bit that operates at room temperatures", "url": "https://www.theweek.in/news/sci-tech/2020/05/02/army-researchers-achieve-great-feat-quantum-computing-room-temperature.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/sci-tech/2019/June/quantum-computer-isometric-AI-big-data-circuit-board-processor-shut.jpg", "publishedAt": "2020-05-01T22:43:48Z", "content": "US Army researchers have affirmed that future quantum computer circuits will not require extremely cold temperatures to function and it could become a reality as early as a decade.\r\nIn a quantum computer, the basic unit of memory is a quantum bit or qubit whi… [+3708 chars]"}, {"source": {"id": null, "name": "Gizmoposts24.com"}, "author": "Gaurang Bhandari", "title": "Hubble Space Telescope and how it explore? Check it here!!! - Gizmo Posts 24", "description": "The Hubble Space Telescope is a telescope that was launched into low Earth orbit in 1990 and remains in operation till now. It weighs about 11000 kilograms and travels around Earth at about 5 miles per second. It is regarded as one of the largest and most ver…", "url": "https://gizmoposts24.com/education/hubble-space-telescope-and-how-it-explore-check-it-here-64317/", "urlToImage": "https://gizmoposts24.com/wp-content/uploads/2020/04/images-2.jpeg", "publishedAt": "2020-05-01T21:22:00Z", "content": "The Hubble Space Telescope is a telescope that was launched into low Earth orbit in 1990 and remains in operation till now. It weighs about 11000 kilograms and travels around Earth at about 5 miles per second. It is regarded as one of the largest and most ver… [+1359 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "A Planet, 300 Times of the Earth Mass, Discovered - Somag News", "description": "Astronomers have discovered a planet with 300 Earth masses orbiting the star Kepler-88, located 1,250 light years from our Solar System. The planet also triples Jupiter, the largest planet in our system. Jupiter is the largest and somewhat frightening planet …", "url": "https://www.somagnews.com/planet-300-times-earth-mass-discovered/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2020/05/42-e1588367448283.jpg", "publishedAt": "2020-05-01T21:10:00Z", "content": "Astronomers have discovered a planet with 300 Earth masses orbiting the star Kepler-88, located 1,250 light years from our Solar System. The planet also triples Jupiter, the largest planet in our system.\r\nJupiter is the largest and somewhat frightening planet… [+1441 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "NASA Re-Published Images of Jupiter's Satellite Europa in 1998 - Somag News", "description": "NASA; Galileo published three reworked photographs of Europa, by Jupiter, taken by the spacecraft in 1998. In the images we have the chance to take a closer look at Europa’s surface. NASA will send the spacecraft named ‘Clipper’ to Europa in 2023. Europa, the…", "url": "https://www.somagnews.com/nasa-re-published-images-jupiters-satellite-europa-1998/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2020/05/37-e1588366573415.jpg", "publishedAt": "2020-05-01T20:56:00Z", "content": "NASA; Galileo published three reworked photographs of Europa, by Jupiter, taken by the spacecraft in 1998. In the images we have the chance to take a closer look at Europa’s surface. NASA will send the spacecraft named ‘Clipper’ to Europa in 2023.\r\nEuropa, th… [+1911 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Tristan Greene", "title": "Is AI already conscious? - The Next Web", "description": "The ultimate goal of most high-level AI research is the development of a general artificial intelligence (GAI). In essence, what we want is a synthetic mind that could function the same as a human were it placed into a physical vessel of similar capability. M…", "url": "https://thenextweb.com/neural/2020/05/01/is-ai-already-conscious/", "urlToImage": "https://img-cdn.tnwcdn.com/image/neural?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2018%2F03%2Fbraincomputer.jpg&signature=7c84c378b610fb68d903388947e164c2", "publishedAt": "2020-05-01T20:55:14Z", "content": "The ultimate goal of most high-level AI research is the development of a general artificial intelligence (GAI). In essence, what we want is a synthetic mind that could function the same as a human were it placed into a physical vessel of similar capability.\r\n… [+3873 chars]"}, {"source": {"id": null, "name": "Itnewsonline.com"}, "author": null, "title": "PR Newswire - NASA Commits to Future Artemis Missions with More SLS Rocket Engines - IT News Online", "description": "NASA Commits to Future Artemis Missions with More SLS Rocket Engines", "url": "http://www.itnewsonline.com/prnewswire/NASA-Commits-to-Future-Artemis-Missions-with-More-SLS-Rocket-Engines/690003", "urlToImage": null, "publishedAt": "2020-05-01T20:28:49Z", "content": "WASHINGTON, May 1, 2020 /PRNewswire/ --Â NASA has awarded a contract to Aerojet Rocketdyne of Sacramento, California, to manufacture 18 additional Space Launch System (SLS) RS-25 rocket engines to support Artemis missions to the Moon.Â \r\nThe follow-on contrac… [+3802 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Neha", "title": "Astronomers could spot life signs orbiting long-dead stars - The Siasat Daily", "description": "New York: The next generation of powerful Earth- and space-based telescopes will be able to hunt distant solar systems for evidence of life on Earth-like exoplanets -- particularly those that chaperone burned-out stars known as white dwarfs. The chemical prop…", "url": "https://www.siasat.com/astronomers-could-spot-life-signs-orbiting-long-dead-stars-1882711/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/05/Astronomers.jpg", "publishedAt": "2020-05-01T18:35:06Z", "content": "New York: The next generation of powerful Earth- and space-based telescopes will be able to hunt distant solar systems for evidence of life on Earth-like exoplanets — particularly those that chaperone burned-out stars known as white dwarfs.\r\nThe chemical prop… [+2885 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Asteroid 1998 OR2: Space rock passes by Earth safely - FRANCE 24 English", "description": "In this week’s edition of Tech 24, we tell you how an asteroid dubbed 1998 OR2 came within 3.9 million miles of our planet, prompting scientists to qualify i...", "url": "https://www.youtube.com/watch?v=TRdMwiVIaOc", "urlToImage": "https://i.ytimg.com/vi/TRdMwiVIaOc/hqdefault.jpg", "publishedAt": "2020-05-01T17:33:15Z", "content": "In this weeks edition of Tech 24, we tell you how an asteroid dubbed 1998 OR2 came within 3.9 million miles of our planet, prompting scientists to qualify it as a near-Earth object. It safely passed us, yet it has still raised questions about potential future… [+357 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: Cedars-Sinai Expert Weighs In On Antibody Testing - CBS Los Angeles", "description": "Dr. Rekha Murthy, an infectious disease specialist at Cedars-Sinai Medical Center, spoke to CBS2 Friday about antibody testing.", "url": "https://www.youtube.com/watch?v=w2zAcxsa-YI", "urlToImage": "https://i.ytimg.com/vi/w2zAcxsa-YI/maxresdefault.jpg", "publishedAt": "2020-05-01T16:43:40Z", "content": "Dr. Rekha Murthy, an infectious disease specialist at Cedars-Sinai Medical Center, spoke to CBS2 Friday about antibody testing."}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Aristos Georgiou", "title": "SpaceX Starlink Satellites Spotted Over Florida, Will Be Visible From Other U.S. States This Weekend - Newsweek", "description": "SpaceX's Starlink project aims to send thousands of mass-produced satellites into orbit in order to provide high-speed internet coverage across the globe.", "url": "https://www.newsweek.com/spacex-starlink-florida-states-weekend-1501482", "urlToImage": "https://d.newsweek.com/en/full/1586604/elon-musk.jpg", "publishedAt": "2020-05-01T16:41:21Z", "content": "On Thursday evening, a train of SpaceX Starlink satellites was visible in the night sky above Florida, with several residents reporting seeing a string of white lights around 9 p.m. local time.\r\nFloridians posted images and videos of the satellite train on so… [+3976 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Adele Ankers", "title": "Spinosaurus Becomes the First Known Swimming Dinosaur - IGN Southeast Asia", "description": "Fossilised tail bones indicate that Spinosaurus' could swim.", "url": "https://sea.ign.com/news/160024/spinosaurus-becomes-the-first-known-swimming-dinosaur", "urlToImage": "https://sm.ign.com/t/ign_ap/news/s/spinosauru/spinosaurus-becomes-the-first-known-swimming-dinosaur_4z57.1200.jpg", "publishedAt": "2020-05-01T16:22:01Z", "content": "Researchers have discovered that Spinosaurus aegyptiacus had a \"paddle-like\" tail to propel itself through the water bolstering the case that this particular species of dinosaur was capable of aquatic movement.\r\nNational Geographic reports that the fossilised… [+2464 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Mike Wehner", "title": "You could own a massive chunk of the Moon if your pockets are deep enough - BGR", "description": "The fifth-largest piece of the Moon known to exist here on Earth is up for sale. At a price of roughly $2.5 million, it’s a serious investment for even the most diehard space fans. The rock is being sold through Christie’s in a private sale format. Visit BGR’…", "url": "https://bgr.com/2020/05/01/lunar-meteorite-christies-sale/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2020/04/screen-shot-2020-04-30-at-2.56.37-pm.png", "publishedAt": "2020-05-01T14:22:09Z", "content": "<ul><li>The fifth-largest piece of the Moon known to exist here on Earth is up for sale. </li><li>At a price of roughly $2.5 million, it’s a serious investment for even the most diehard space fans. </li><li>The rock is being sold through Christie’s in a priva… [+2428 chars]"}, {"source": {"id": null, "name": "Dailysabah.com"}, "author": "German Press Agency - DPA", "title": "Record microplastic density found on Mediterranean seabed | Daily Sabah - Daily Sabah", "description": "International scientists have found a record density of 1.9 million microplastic particles per square meter in the Mediterranean near Italy, warning that pollution could be even...", "url": "https://www.dailysabah.com/life/environment/record-microplastic-density-found-on-mediterranean-seabed", "urlToImage": "https://idsb.tmgrup.com.tr/ly/uploads/images/2020/05/01/thumbs/1200x600/33548.jpg", "publishedAt": "2020-05-01T13:17:59Z", "content": "International scientists have found a record density of 1.9 million microplastic particles per square meter in the Mediterranean near Italy, warning that pollution could be even higher in other parts of the sea.\r\n\"This is the highest reported value for any se… [+1188 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Four-pound solar-powered Mars helicopter gets fitting name - Telangana Today", "description": "Hyderabad: An Alabama high school student named NASA’s first Mars helicopter that will be deployed to the Red Planet later this year. Ingenuity, the name submitted by Vaneera Rupani, was selected for the 4 pound (1.8 kilogram) solar-powered helicopter, NASA s…", "url": "https://telanganatoday.com/four-pound-solar-powered-mars-helicopter-gets-fitting-name", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2020/05/NASA-2-2.jpg", "publishedAt": "2020-05-01T11:40:02Z", "content": "Hyderabad: An Alabama high school student named NASAs first Mars helicopter that will be deployed to the Red Planet later this year.\r\nIngenuity, the name submitted by Vaneera Rupani, was selected for the 4 pound (1.8 kilogram) solar-powered helicopter, NASA s… [+2198 chars]"}, {"source": {"id": null, "name": "Physicsworld.com"}, "author": null, "title": "Quantum computers vastly outperform supercomputers when it comes to energy efficiency - physicsworld.com", "description": "NISQs consume orders of magnitude less energy than conventional processors, researchers say", "url": "https://physicsworld.com/a/quantum-computers-vastly-outperform-supercomputers-when-it-comes-to-energy-efficiency/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2020/05/Tim-Wogan-1-May-Sycamore.jpg", "publishedAt": "2020-05-01T11:39:49Z", "content": "Energy efficient: Googles Sycamore quantum processor. (Courtesy: Erik Lucero/Google)\r\nResearchers in the US have created a new energy-based benchmark for quantum advantage and have used it to show that noisy intermediate-scale quantum (NISQ) computers use sev… [+5004 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": null, "title": "NASA Explore Technology To Build Future Homes Made of Fungi For Moon, Mars - http://www.newsgram.com/", "description": "Instead of habitats made of metal and glass, NASA is exploring technologies that could grow structures out of fungi to become our future homes in the stars.", "url": "https://www.newsgram.com/nasa-build-homes-fungi-moon-mars/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2020/01/NASA-Logo.jpg", "publishedAt": "2020-01-18T10:02:49Z", "content": "Instead of habitats made of metal and glass, NASA is exploring technologies that could grow structures out of fungi to become our future homes in the stars, and perhaps lead to more sustainable ways of living on Earth as well.\r\nCreating a livable home for fut… [+3310 chars]"}]}