{"status": "ok", "totalResults": 28, "articles": [{"source": {"id": null, "name": "News18.com"}, "author": "Vishal Mathur", "title": "Gotta be Aliens! There is a Powerful Radio Signal Coming From Within Our Galaxy - News18", "description": "The SGR 1935+2154, a dead star that is around 30,000 light-years away from earth, registered for the radio observatories around the world with a single and millisecond-long burst of incredibly bright radio waves.", "url": "https://www.news18.com/news/tech/gotta-be-aliens-there-is-a-powerful-radio-signal-coming-from-within-our-galaxy-2603283.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/02/Space-Photos-Captured-by-Spitzer-Space-Telescope-10.jpg", "publishedAt": "2020-05-03T04:37:48Z", "content": "There is a very powerful radio signal that is doing rounds in our galaxy, and astronomers are perplexed because this is the first ever fast radio burst (FRB) originating in our own galaxy. And this has happened as recently as April 28, when SGR 1935+2154, a d… [+2097 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Mohana Basu", "title": "Alabama school student names NASA’s first Mars helicopter, a 2-kg, solar-powered craft - ThePrint", "description": "ScientiFix, our weekly feature, offers you a summary of the top global science stories of the week, with links to their sources.", "url": "https://theprint.in/scientifix/alabama-school-student-names-nasas-first-mars-helicopter-a-2-kg-solar-powered-craft/413337/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2019/07/316873868_1-7-e1562642806173.jpg", "publishedAt": "2020-05-03T04:35:35Z", "content": "Alabama student names NASA’s Mars helicopter ‘Ingenuity’\r\nNASA’s Mars helicopter — destined to be the first aircraft to attempt powered flights on another planet — has been named ‘Ingenuity’.\r\nThe name was picked during NASA’s “Name the Rover” essay contest. … [+5237 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "Deekshith Nevil Pinto", "title": "Spectacular Discovery Confirms Spinosaurus as First Known Swimming Dinosaur - The Weather Channel", "description": "The 50-foot long aquatic dinosaurs named Spinosaurus aegyptiacus have a fossil record ranging over 50 million years.", "url": "https://weather.com/en-IN/india/science/news/2020-05-02-spectacular-discovery-spinosaurus-first-known-swimming-dinosaur", "urlToImage": "https://s.w-x.co/in-dinosaur_0.jpg", "publishedAt": "2020-05-02T22:24:22Z", "content": "Reconstruction of Spinosaurus in life: long narrow jaws with conical teeth, and a unique tail for aquatic locomotion. \r\n(Artwork: Davide Bonadonna / Nature )\r\nThe scientists studying a peculiar, millions of years old fossil of a particular dinosaur species na… [+2892 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Lockdown effect: No rules of social distancing apply here - The Financial Express", "description": "Social media use surges; average time spent on platforms like Facebook and Instagram up by over 60%.", "url": "https://www.financialexpress.com/industry/technology/lockdown-effect-no-rules-of-social-distancing-apply-here/1946444/", "urlToImage": "https://images.financialexpress.com/2020/05/1-23.jpg", "publishedAt": "2020-05-02T20:23:47Z", "content": "Even when we were not forced by a lockdown and a deadly virus to remain physically distant from friends and family, social media was a popular way to remain in touch. Now, it is the only way, barring phone calls.\r\nData also points likewise. A recent report by… [+3546 chars]"}, {"source": {"id": null, "name": "Clicklancashire.com"}, "author": null, "title": "A piece of the moon for sale: Just £2 mil - ClickLancashire", "description": "", "url": "https://clicklancashire.com/2020/05/02/a-piece-of-the-moon-for-sale-just-2-mil.html", "urlToImage": null, "publishedAt": "2020-05-02T16:20:48Z", "content": "A piece of the moon is available for the right price.\r\nOne of the world's largest lunar meteorites goes on private sale at Christie's on Thursday, valued at $3,800,000 AUD.\r\nThe moon rock, formally known as NWA 12691, weighs more than 13.5 kg and is believed … [+1938 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "NASA begs spectators for astronaut launch: Please stay home! - Moneycontrol", "description": "It will be the first launch of astronauts from NASA’s Kennedy Space Center in nine years — ever since the last space shuttle flight in 2011. It also will be the first attempt by a private company to fly astronauts to orbit.", "url": "https://www.moneycontrol.com/news/world/nasa-begs-spectators-for-astronaut-launch-please-stay-home-5215601.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2019/10/nasa-2313267_1280-770x432-770x433.jpg", "publishedAt": "2020-05-02T15:58:15Z", "content": "NASA and SpaceX on Friday urged spectators to stay home for the first home launch of astronauts in nearly a decade because of the coronavirus pandemic.\r\nTop officials warned the public against traveling to Florida for the May 27 launch of two NASA astronauts … [+1504 chars]"}, {"source": {"id": null, "name": "Chessbase.com"}, "author": "", "title": "Who is the chess player on Mars? - Chessbase News", "description": "A “Mars opposition” occurs when planet Earth passes in between the Sun and planet Mars. It happens every 2 years and 2 months – 779.94 Earth days to be precise. Then Mars becomes a beautiful red jewel in the night sky, full of mystery. On the one hand a Marti…", "url": "https://en.chessbase.com/post/who-is-the-chess-player-on-mars", "urlToImage": "https://en.chessbase.com/thumb/87094_l200", "publishedAt": "2020-05-02T12:04:56Z", "content": "The Mars Opposition\r\nOn Wednesday, August 27 2003, at 10:51 GMT, the planet Mars approached the earth closer than at any time during the last 60,000 years. It became the brightest object in the night sky, a beautiful red jewel in the firmament, with an appare… [+3854 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Eta Aquariid meteor shower: When and how to watch - msnNOW", "description": "The Eta Aquariid meteor shower is expected to peak on Tuesday, but a nearly full moon could outshine the show. They may be most visible on Sunday morning before dawn on Sunday, with a better chance for more visible meteors in the southern hemisphere.", "url": "https://www.cnn.com/2020/05/02/world/eta-aquariid-meteor-shower-scn-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200501152109-eta-aquariid-meteor-shower-restricted-super-tease.jpg", "publishedAt": "2020-05-02T11:15:00Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "'I Recommend the Moon': On Astronomy Day 2020, Read Interesting Sayings by Famous Astronauts - News18", "description": "Celebrated twice a year, the first International Astronomy Day is held on May 2 while the next occasion will be observed on September 26.", "url": "https://www.news18.com/news/world/i-recommend-the-moon-on-international-astronomy-day-2020-read-interesting-sayings-by-famous-astronauts-2602205.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/02/Space.jpg", "publishedAt": "2020-05-02T06:15:39Z", "content": "New Delhi: The International Astronomy Day is celebrated twice a year during autumn and spring. While 2020s first Astronomy Day is held on May 2, it will be celebrated again on September 26. \r\nOn this day, museums, societies, astronomical institutions and pla… [+1352 chars]"}, {"source": {"id": null, "name": "Indiablooms.com"}, "author": "Indiablooms", "title": "Arctic observes alarming levels of ozone depletion - indiablooms", "description": "Geneva/UNI: Depletion of the ozone layer, the shield that protects life on Earth from harmful levels of ultraviolet radiation, reached an unprecedented level over large parts of the Arctic this spring, World Meteorological Organisation said on Saturday.", "url": "https://indiablooms.com/health-details/E/6236/arctic-observes-alarming-levels-of-ozone-depletion.html", "urlToImage": "https://indiablooms.com/health_pic/2020/2-1588398072.jpg", "publishedAt": "2020-05-02T05:43:20Z", "content": "Geneva/UNI: Depletion of the ozone layer, the shield that protects life on Earth from harmful levels of ultraviolet radiation, reached an unprecedented level over large parts of the Arctic this spring, World Meteorological Organisation said on Saturday.\r\nThe … [+1478 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Bhavya Sukheja", "title": "NASA Artemis mission: SpaceX, Blue Origin and Dynetics chosen to design HLS - Republic World - Republic World", "description": "The US space agency NASA has reportedly chosen SpaceX, Blue Origin and Dynetics to design and develop human landing systems (HLS) for its Artemis program.", "url": "https://www.republicworld.com/technology-news/science/nasa-picks-spacex-blue-origin-and-dynetics-to-design-hls.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/7apgvivvzoa7xfsy_1588376097.jpeg?tr=f-jpeg", "publishedAt": "2020-05-02T01:30:40Z", "content": "The US space agency NASA has reportedly chosen SpaceX, Blue Origin and Dynetics to design and develop human landing systems (HLS) for its Artemis program. The three companies will be working on their designs over the next year after which NASA will select one… [+2653 chars]"}, {"source": {"id": null, "name": "Gizmoposts24.com"}, "author": "Gaurang Bhandari", "title": "Hubble Space Telescope and how it explore? Check it here!!! - Gizmo Posts 24", "description": "The Hubble Space Telescope is a telescope that was launched into low Earth orbit in 1990 and remains in operation till now. It weighs about 11000 kilograms and travels around Earth at about 5 miles per second. It is regarded as one of the largest and most ver…", "url": "https://gizmoposts24.com/education/hubble-space-telescope-and-how-it-explore-check-it-here-64317/", "urlToImage": "https://gizmoposts24.com/wp-content/uploads/2020/04/images-2.jpeg", "publishedAt": "2020-05-01T21:22:00Z", "content": "The Hubble Space Telescope is a telescope that was launched into low Earth orbit in 1990 and remains in operation till now. It weighs about 11000 kilograms and travels around Earth at about 5 miles per second. It is regarded as one of the largest and most ver… [+1359 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Tristan Greene", "title": "Is AI already conscious? - The Next Web", "description": "The ultimate goal of most high-level AI research is the development of a general artificial intelligence (GAI). In essence, what we want is a synthetic mind that could function the same as a human were it placed into a physical vessel of similar capability. M…", "url": "https://thenextweb.com/neural/2020/05/01/is-ai-already-conscious/", "urlToImage": "https://img-cdn.tnwcdn.com/image/neural?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2018%2F03%2Fbraincomputer.jpg&signature=7c84c378b610fb68d903388947e164c2", "publishedAt": "2020-05-01T20:55:14Z", "content": "The ultimate goal of most high-level AI research is the development of a general artificial intelligence (GAI). In essence, what we want is a synthetic mind that could function the same as a human were it placed into a physical vessel of similar capability.\r\n… [+3873 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Neha", "title": "Astronomers could spot life signs orbiting long-dead stars - The Siasat Daily", "description": "New York: The next generation of powerful Earth- and space-based telescopes will be able to hunt distant solar systems for evidence of life on Earth-like exoplanets -- particularly those that chaperone burned-out stars known as white dwarfs. The chemical prop…", "url": "https://www.siasat.com/astronomers-could-spot-life-signs-orbiting-long-dead-stars-1882711/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/05/Astronomers.jpg", "publishedAt": "2020-05-01T18:35:06Z", "content": "New York: The next generation of powerful Earth- and space-based telescopes will be able to hunt distant solar systems for evidence of life on Earth-like exoplanets — particularly those that chaperone burned-out stars known as white dwarfs.\r\nThe chemical prop… [+2885 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Asteroid 1998 OR2: Space rock passes by Earth safely - FRANCE 24 English", "description": "In this week’s edition of Tech 24, we tell you how an asteroid dubbed 1998 OR2 came within 3.9 million miles of our planet, prompting scientists to qualify i...", "url": "https://www.youtube.com/watch?v=TRdMwiVIaOc", "urlToImage": "https://i.ytimg.com/vi/TRdMwiVIaOc/hqdefault.jpg", "publishedAt": "2020-05-01T17:33:15Z", "content": "In this weeks edition of Tech 24, we tell you how an asteroid dubbed 1998 OR2 came within 3.9 million miles of our planet, prompting scientists to qualify it as a near-Earth object. It safely passed us, yet it has still raised questions about potential future… [+357 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: Cedars-Sinai Expert Weighs In On Antibody Testing - CBS Los Angeles", "description": "Dr. Rekha Murthy, an infectious disease specialist at Cedars-Sinai Medical Center, spoke to CBS2 Friday about antibody testing.", "url": "https://www.youtube.com/watch?v=w2zAcxsa-YI", "urlToImage": "https://i.ytimg.com/vi/w2zAcxsa-YI/maxresdefault.jpg", "publishedAt": "2020-05-01T16:43:40Z", "content": "Dr. Rekha Murthy, an infectious disease specialist at Cedars-Sinai Medical Center, spoke to CBS2 Friday about antibody testing."}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Aristos Georgiou", "title": "SpaceX Starlink Satellites Spotted Over Florida, Will Be Visible From Other U.S. States This Weekend - Newsweek", "description": "SpaceX's Starlink project aims to send thousands of mass-produced satellites into orbit in order to provide high-speed internet coverage across the globe.", "url": "https://www.newsweek.com/spacex-starlink-florida-states-weekend-1501482", "urlToImage": "https://d.newsweek.com/en/full/1586604/elon-musk.jpg", "publishedAt": "2020-05-01T16:41:21Z", "content": "On Thursday evening, a train of SpaceX Starlink satellites was visible in the night sky above Florida, with several residents reporting seeing a string of white lights around 9 p.m. local time.\r\nFloridians posted images and videos of the satellite train on so… [+3976 chars]"}, {"source": {"id": null, "name": "Dailysabah.com"}, "author": "German Press Agency - DPA", "title": "Record microplastic density found on Mediterranean seabed | Daily Sabah - Daily Sabah", "description": "International scientists have found a record density of 1.9 million microplastic particles per square meter in the Mediterranean near Italy, warning that pollution could be even...", "url": "https://www.dailysabah.com/life/environment/record-microplastic-density-found-on-mediterranean-seabed", "urlToImage": "https://idsb.tmgrup.com.tr/ly/uploads/images/2020/05/01/thumbs/1200x600/33548.jpg", "publishedAt": "2020-05-01T13:17:59Z", "content": "International scientists have found a record density of 1.9 million microplastic particles per square meter in the Mediterranean near Italy, warning that pollution could be even higher in other parts of the sea.\r\n\"This is the highest reported value for any se… [+1188 chars]"}, {"source": {"id": null, "name": "Jagranjosh.com"}, "author": null, "title": "Study shows sun to be less active than other similar stars - Jagran Josh", "description": "The scientists compared the sun with other stars that have similar rotation periods and other fundamental properties. As a result, most of the stars", "url": "https://www.jagranjosh.com/current-affairs/study-shows-sun-to-be-less-active-than-other-similar-stars-1588333528-1", "urlToImage": "https://www.jagranjosh.com/imported/images/E/GK/Sun becomes less active.jpg", "publishedAt": "2020-05-01T11:48:00Z", "content": "As per the new study by the researchers, solar brightness variations have become extremely weak and by cosmic standards, the sun has become extraordinarily monotonous. The study was done through an analysis of 369 solar-like stars.\r\nThe result was shown by th… [+4112 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Four-pound solar-powered Mars helicopter gets fitting name - Telangana Today", "description": "Hyderabad: An Alabama high school student named NASA’s first Mars helicopter that will be deployed to the Red Planet later this year. Ingenuity, the name submitted by Vaneera Rupani, was selected for the 4 pound (1.8 kilogram) solar-powered helicopter, NASA s…", "url": "https://telanganatoday.com/four-pound-solar-powered-mars-helicopter-gets-fitting-name", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2020/05/NASA-2-2.jpg", "publishedAt": "2020-05-01T11:40:02Z", "content": "Hyderabad: An Alabama high school student named NASAs first Mars helicopter that will be deployed to the Red Planet later this year.\r\nIngenuity, the name submitted by Vaneera Rupani, was selected for the 4 pound (1.8 kilogram) solar-powered helicopter, NASA s… [+2198 chars]"}, {"source": {"id": null, "name": "Physicsworld.com"}, "author": null, "title": "Quantum computers vastly outperform supercomputers when it comes to energy efficiency - physicsworld.com", "description": "NISQs consume orders of magnitude less energy than conventional processors, researchers say", "url": "https://physicsworld.com/a/quantum-computers-vastly-outperform-supercomputers-when-it-comes-to-energy-efficiency/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2020/05/Tim-Wogan-1-May-Sycamore.jpg", "publishedAt": "2020-05-01T11:39:49Z", "content": "Energy efficient: Googles Sycamore quantum processor. (Courtesy: Erik Lucero/Google)\r\nResearchers in the US have created a new energy-based benchmark for quantum advantage and have used it to show that noisy intermediate-scale quantum (NISQ) computers use sev… [+5004 chars]"}, {"source": {"id": null, "name": "Inventiva.co.in"}, "author": "inventiva", "title": "FDA Authorizes A Ventilator Developed By NASA's JPL For Emergency Use In COVID-19 Treatment - Inventiva", "description": "The U.S. Food and Drug Administration (FDA) has authorized for emergency use as outlined in the agency’s COVID-19 guidelines a new ventilator designed by engi", "url": "https://www.inventiva.co.in/trends/inventiva/fda-authorizes-a-ventilator-developed-by-nasas-jpl-for-emergency-use-in-covid-19-treatment/", "urlToImage": "https://www.inventiva.co.in/wp-content/uploads/2020/05/dims.jpg", "publishedAt": "2020-05-01T11:04:40Z", "content": "The U.S. Food and Drug Administration (FDA) has authorized for emergency use as outlined in the agencys COVID-19 guidelines a new ventilator designed by engineers working at NASAs Jet Propulsion Laboratory . The ventilator, which has an acronym because this i… [+1701 chars]"}, {"source": {"id": null, "name": "Physicsworld.com"}, "author": null, "title": "NASA satellite missions track 16 years of Earth's melting ice sheets - physicsworld.com", "description": "Data from NASA’s ICESat and ICESat-2 missions reveal that ice sheet losses from Greenland and Antarctica have contributed 14 mm to sea level rise since 2003", "url": "https://physicsworld.com/a/nasa-satellite-missions-track-16-years-of-earths-melting-ice-sheets/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2020/05/antarctic-ice.jpg", "publishedAt": "2020-05-01T10:35:41Z", "content": "et al/Science)\" /&gt;\r\nThe amount of ice gained or lost by Antarctica between 2003 and 2019. The ice lost near the coasts (dark reds and purples), especially West Antarctica and the Antarctic Peninsula, vastly outweighs gains in the interior (blues). The circ… [+4685 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "'River monster': Huge African dinosaur Spinosaurus thrived in the water - India Today", "description": "Scientists this week announced the discovery of fossil bones from the tail of ​Spinosaurus in southeastern Morocco that provided a deeper understanding of the appearance, lifestyle and capabilities of the longest meat-eating dinosaur on record.", "url": "https://www.indiatoday.in/science/story/spinosaurus-new-discovery-morocco-1673263-2020-05-01", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/2020-04-29T000000Z_420140417_R-647x363.png?DmRVm7j3YePu_U8W34szur6YwCQVocLs", "publishedAt": "2020-05-01T09:18:31Z", "content": "The huge African predator Spinosaurus spent much of its life in the water, propelled by a paddle-like tail while hunting large fish - a \"river monster,\" according to scientists, that showed that some dinosaurs invaded the aquatic realm.\r\nScientists on Wednesd… [+2716 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": null, "title": "Scientists accept the presence of the moon active tectonic system - The Times Hub", "description": null, "url": "https://thetimeshub.in/scientists-accept-the-presence-of-the-moon-active-tectonic-system/13138/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2020/05/c1b3b55a5916aef4c5a416c0efb99be7-400x400.jpg", "publishedAt": "2020-05-01T08:07:04Z", "content": "American researchers have studied previously discovered on the moon of the mountain ranges. After analyzing the images, scientists accept the existence of the satellite of the Earth tectonic system.\r\nExperts of brown University took into account the presence … [+1114 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Christie's offers largest lunar meteorites for sale - Daijiworld.com", "description": "", "url": "http://www.daijiworld.com/news/newsDisplay.aspx?newsID=703179", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2020-05-01T07:21:08Z", "content": "New Delhi, May 1 (IANSlife): Christies presents NWA 12691, a significant lunar rock, among the largest known in existence. Moon rock is among the rarest substances on Earth, with less than 650 kg. of lunar meteorites known to exist.\r\nThis example is the fifth… [+2621 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": null, "title": "NASA Explore Technology To Build Future Homes Made of Fungi For Moon, Mars - http://www.newsgram.com/", "description": "Instead of habitats made of metal and glass, NASA is exploring technologies that could grow structures out of fungi to become our future homes in the stars.", "url": "https://www.newsgram.com/nasa-build-homes-fungi-moon-mars/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2020/01/NASA-Logo.jpg", "publishedAt": "2020-01-18T10:02:49Z", "content": "Instead of habitats made of metal and glass, NASA is exploring technologies that could grow structures out of fungi to become our future homes in the stars, and perhaps lead to more sustainable ways of living on Earth as well.\r\nCreating a livable home for fut… [+3310 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET BrandEquity", "title": "#Chandrayaan-2: Durex ad took Twitter users by surprise - ETBrandEquity.com", "description": "As Chandrayaan-2 came nearer to its destination after entering the lunar orbit on Tuesday, condom brand Durex published a creative ad that took Twitter users by surprise", "url": "https://brandequity.economictimes.indiatimes.com/news/marketing/chandrayaan-2-durex-ad-took-twitter-users-by-surprise/70765640", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-70765640,imgsize-1178930,width-800,height-434,overlay-etbrandequity/chandrayaan-2-durex-ad-took-twitter-users-by-surprise.jpg", "publishedAt": "2019-08-21T05:45:23Z", "content": "(Representative Image)\r\nAs Chandrayaan-2 came nearer to its destination after entering the lunar orbit on Tuesday, condom brand Durex published a creative ad that took Twitter users by surprise.\"Enjoy the ride! To buy Durex Extra Time, click ...,\" read the ca… [+1534 chars]"}]}