{"status": "ok", "totalResults": 60, "articles": [{"source": {"id": null, "name": "Gizbot.com"}, "author": "Sharmishte Datti", "title": "Astronauts Begin Quarantine Ahead Of SpaceX Demo-2 Mission To ISS - Gizbot", "description": "SpaceX Crew Dragon spaceship is gearing up for its manned mission, carrying two NASA astronauts to the International Space Station. Ahead of the liftoff, astronauts Robert Bob Behnken and Douglas Doug Hurley entered have begun their pre-flight quarantine to e…", "url": "https://www.gizbot.com/news/astronauts-begin-quarantine-ahead-of-spacex-demo-2-mission-067695.html", "urlToImage": "https://www.gizbot.com/img/2020/05/astronauts-begin-quarantine-ahead-of-spacex-demo-2-mission-1589458499.jpg", "publishedAt": "2020-05-15T02:00:00Z", "content": "SpaceX Crew Dragon spaceship is gearing up for its manned mission, carrying two NASA astronauts to the International Space Station. Ahead of the liftoff, astronauts Robert \"Bob\" Behnken and Douglas \"Doug\" Hurley entered have begun their pre-flight quarantine … [+2449 chars]"}, {"source": {"id": null, "name": "Newsheads.in"}, "author": "Ankit Pal", "title": "'Super Earth' found near the center of our galaxy, revolves one round in 617 days - NEWS HEADS", "description": "Researchers have found a 'super-earth' close to the center of our galaxy with the help of a rare observation. The newly discovered planet, a little heavier than our earth, is one of the rare planets which have a similar size and orbit.", "url": "https://www.newsheads.in/science/space/super-earth-found-near-the-center-of-our-galaxy-revolves-one-round-in-617-days-article-61616", "urlToImage": "https://static.newsheads.in/media/thumbs/2020/05/15/324700834-super-earth_1200x675.jpg", "publishedAt": "2020-05-15T01:51:33Z", "content": "Chile : Researchers have found a 'super-earth' close to the center of our galaxy with the help of a rare observation. The newly discovered planet, a little heavier than our earth, is one of the rare planets which have a similar size and orbit.\r\nThe planet's p… [+2158 chars]"}, {"source": {"id": null, "name": "Newsheads.in"}, "author": "Ankit Pal", "title": "Composition of Mars core and its formation explained by Japanese researchers - NEWS HEADS", "description": "There have been plans of humans visiting Mars in near future, but before that it is mandatory to know all about the red planet. Japanese researchers have tried to put some weight with their study on the planet from earth with simulations and found that the ir…", "url": "https://www.newsheads.in/science/space/composition-of-mars-core-and-its-formation-explained-by-japanese-researchers-article-61615", "urlToImage": "https://static.newsheads.in/media/thumbs/2020/05/15/662405077-mars_1200x675.jpg", "publishedAt": "2020-05-15T01:30:13Z", "content": "New Delhi : There have been plans of humans visiting Mars in near future, but before that it is mandatory to know all about the red planet. Japanese researchers have tried to put some weight with their study on the planet from earth with simulations and found… [+1967 chars]"}, {"source": {"id": null, "name": "Newsheads.in"}, "author": "Ankit Pal", "title": "How Pluto's hazy atmosphere changes, reveals NASA's SOFIA telescope - NEWS HEADS", "description": "NASA's Stratospheric Observatory for Infrared Astronomy (SOFIA) has made observations on how Pluto's hazy atmosphere changes while the planet moves through an unusual orbit.", "url": "https://www.newsheads.in/science/space/how-plutos-hazy-atmosphere-changes-reveals-nasas-sofia-telescope-article-61614", "urlToImage": "https://static.newsheads.in/media/thumbs/2020/05/15/920221510-pluto_1200x675.jpg", "publishedAt": "2020-05-15T01:11:58Z", "content": "New Delhi : NASA's Stratospheric Observatory for Infrared Astronomy (SOFIA) has made observations on how Pluto's hazy atmosphere changes while the planet moves through an unusual orbit.\r\nThe findings have been published in the scientific journal Icarus. \r\nThe… [+1001 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NASA 'Sonifies' Hubble Telescope Photo | NowThis - NowThis News", "description": "This Hubble Telescope photo was translated into sound — and it is chillingly beautiful. » Subscribe to NowThis: http://go.nowth.is/News_Subscribe » Sign up f...", "url": "https://www.youtube.com/watch?v=OrTLsU2oz2U", "urlToImage": "https://i.ytimg.com/vi/OrTLsU2oz2U/maxresdefault.jpg", "publishedAt": "2020-05-14T23:59:55Z", "content": "This Hubble Telescope photo was translated into sound and it is chillingly beautiful.» Subscribe to NowThis: http://go.nowth.is/News_Subscribe» Sign up for our newsletter KnowThis to get the biggest stories of the day delivered straight to your inbox: https:/… [+1405 chars]"}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Paula Tudoran", "title": "Africa’s Largest Collection of Human Footprints Was Discovered - Dual Dove", "description": "Africa’s largest collection of human footprints, with figures up to 400 and more, has been discovered in tempered volcanic sediment in northern Tanzania. The fossilized footprints are offerin…", "url": "https://www.dualdove.com/africas-largest-collection-of-human-footprints-was-discovered/10358/", "urlToImage": "https://www.dualdove.com/wp-content/uploads/2020/05/foot-2732970_1920.jpg", "publishedAt": "2020-05-14T22:32:52Z", "content": "Africa‘s largest collection of human footprints, with figures up to 400 and more, has been discovered in tempered volcanic sediment in northern Tanzania. The fossilized footprints are offering a rare glimpse at social life among ancient East African hunter-ga… [+3169 chars]"}, {"source": {"id": null, "name": "Wordpress.com"}, "author": "View all posts by chhatramanicy", "title": "The carnivorous plant lifestyle is gene costly - stopthefud", "description": "Latest Science News — ScienceDaily The carnivorous plant lifestyle is gene costly #EngineeringCy The genomes of three carnivorous plants — the Venus flytrap, spoon-leaved sundew and the…", "url": "https://cyideanet.wordpress.com/2020/05/15/the-carnivorous-plant-lifestyle-is-gene-costly/", "urlToImage": "https://www.sciencedaily.com/images/sd-logo.png", "publishedAt": "2020-05-14T19:34:43Z", "content": null}, {"source": {"id": null, "name": "Wordpress.com"}, "author": "View all posts by Abhishek Human", "title": "Science NewsDynamic stimulation of the visual cortex allows blind and sighted people to ‘see’ shapes - stopthefud", "description": "A team of investigators has described an approach in which implanted electrodes are stimulated in a dynamic sequence, essentially ‘tracing’ shapes on the surface of the visual cortex th…", "url": "https://abhishekgautam1.wordpress.com/2020/05/14/science-newsdynamic-stimulation-of-the-visual-cortex-allows-blind-and-sighted-people-to-see-shapes/", "urlToImage": "https://abhishekgautam1.files.wordpress.com/2018/06/wp-1530350057440.jpg?w=200", "publishedAt": "2020-05-14T19:04:00Z", "content": "A Hinglish Science and Interesting Info Channel from a Science Lover.\r\nHi friends, I'm Abhishek and I welcome you all to this Science and information channel, Abhishek Human Are your wings all spread out and you ready to fly yet? Uh. not literally, metaphoric… [+2060 chars]"}, {"source": {"id": null, "name": "Wordpress.com"}, "author": "View all posts by chhatramanicy", "title": "Making quantum ‘waves’ in ultrathin materials: Study reveals how wavelike plasmons could power up a new class of sensing and photochemical technologies at the nanoscale - stopthefud", "description": "Making quantum ‘waves’ in ultrathin materials A team of researchers has observed unusually long-lived wavelike electrons called ‘plasmons’ in a new class of electronically c…", "url": "https://cyideanet.wordpress.com/2020/05/15/making-quantum-waves-in-ultrathin-materials-study-reveals-how-wavelike-plasmons-could-power-up-a-new-class-of-sensing-and-photochemical-technologies-at-the-nanoscale/", "urlToImage": "https://www.sciencedaily.com/images/sd-logo.png", "publishedAt": "2020-05-14T18:33:42Z", "content": null}, {"source": {"id": null, "name": "Devdiscourse.com"}, "author": "ANI", "title": "Astronomers using Subaru Telescope determine that TRAPPIST-1 planetary orbits are not misaligned - Devdiscourse", "description": "Astronomers using the Subaru Telescope have determined that the Earth-like planets of the TRAPPIST-1 system are not significantly misaligned with the rotation of the star.", "url": "https://www.devdiscourse.com/article/science-environment/1051378-astronomers-using-subaru-telescope-determine-that-trappist-1-planetary-orbits-are-not-misaligned", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/14_05_2020_18_05_35_8898896.jpg?width=920&format=jpeg", "publishedAt": "2020-05-14T18:19:31Z", "content": "Astronomers using the Subaru Telescope have determined that the Earth-like planets of the TRAPPIST-1 system are not significantly misaligned with the rotation of the star. This is an important result for understanding the evolution of planetary systems around… [+3771 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Suchitra Karthikeyan", "title": "Chinas Long March 5B rocket crash lands in Atlantic Ocean- biggest space debris since 91 - Republic World - Republic World", "description": "In a major development, a part of China's Long March 5B (CZ–5B) rocket crash-landed in the Atlantic Ocean on Monday, after its successful launch on May 5", "url": "https://www.republicworld.com/world-news/rest-of-the-world-news/chinas-long-march-5b-rocket-crash-lands-in-the-atlantic-ocean.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/yqljfqxu2hpvibpk_1589477803.jpeg?tr=f-jpeg", "publishedAt": "2020-05-14T17:54:33Z", "content": "In a major development, a part of China's Long March 5B (CZ–5B) rocket crash-landed in the Atlantic Ocean on Monday, as per Science Alert. The debris is reportedly the rocket's core and is 30.48 metres, weighing almost 18,000 kgs - making it the biggest rocke… [+2189 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Ceramists try to stay centered as their studio fights for survival | Reuters Video - Reuters India", "description": "Before its forced closure, Brooklyn's Mouse Ceramic Studio was thriving as an artistic gathering space for students. Now, it is forced to take operations online - as past members embrace pottery at home as a means of staying centered throughout the crisis. Ji…", "url": "https://in.reuters.com/video/watch/idOVCDWS7E3", "urlToImage": "https://static.reuters.com/resources/r/?d=20200514&i=OVCDWS7E3&r=OVCDWS7E3&t=2", "publishedAt": "2020-05-14T17:49:35Z", "content": "Posted \r\nBefore its forced closure, Brooklyn's Mouse Ceramic Studio was thriving as an artistic gathering space for students. Now, it is forced to take operations online - as past members embrace pottery at home as a means of staying centered throughout the c… [+32 chars]"}, {"source": {"id": null, "name": "Sciencemag.org"}, "author": null, "title": "Deep long-period earthquakes generated by second boiling beneath Mauna Kea volcano - Science Magazine", "description": "Earthquakes near volcanoes are often a warning sign of a future eruption. However, deep long-period earthquakes (DLPs) are a special type of seismicity tied most often to quiescent volcanoes. Wech et al. found more than a million of these DLPs under the inact…", "url": "https://science.sciencemag.org/content/368/6492/775.full", "urlToImage": "https://science.sciencemag.org/content/368/6492/775/F1.large.jpg", "publishedAt": "2020-05-14T17:46:44Z", "content": "Thank you for your interest in spreading the word about Science.\r\nNOTE: We only request your email address so that the person you are recommending the page to knows that you wanted them to see it, and that it is not junk mail. We do not capture any email addr… [+3 chars]"}, {"source": {"id": null, "name": "Techlife.news"}, "author": "Suzanne Fisher", "title": "Galaxy Shaped Like a Boomerang Intrigues Astronomers - Tech Life", "description": "Astronomers succeeded in solving the dynamics of yet another significant trick that massive black holes can put on a show. In most galaxies, beams of energy are compressed outward by the black hole…", "url": "https://techlife.news/galaxy-shaped-like-a-boomerang-intrigues-astronomers/7356/", "urlToImage": "https://techlife.news/wp-content/uploads/2020/05/boomerang.jpg", "publishedAt": "2020-05-14T17:21:15Z", "content": "Astronomers succeeded in solving the dynamics of yet another significant trick that massive black holes can put on a show. In most galaxies, beams of energy are compressed outward by the black hole that hides at the core and goes blasting off in the other dir… [+2438 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Aakarsh Dube", "title": "Scientists Develop 'Heat-Resistant' Coral To Reduce The Effect Of Bleaching - Mashable India", "description": "Scientists have now developed coral that is ‘heat resistant’ so it is impervious to the rising temperatures of the ocean. The research was targetted at reducing the impact of coral bleaching that has become more frequent because of climate change.", "url": "https://in.mashable.com/science/14031/scientists-develop-heat-resistant-coral-to-reduce-the-effect-of-bleaching", "urlToImage": "https://sm.mashable.com/mashable_in/seo/default/coral-reef_4evk.jpg", "publishedAt": "2020-05-14T17:09:00Z", "content": "Scientists have now developed coral that is heat resistant as it is impervious to the rising temperatures of the ocean. The research was targeted at reducing the impact of coral bleaching that has become more frequent because of climate change.\r\nThe research … [+2348 chars]"}, {"source": {"id": null, "name": "Apnnews.com"}, "author": null, "title": "Expert: Swimming pool facilities water unlikely to spread coronavirus - APN News", "description": "WHAT: Pools across the U.S. are set to reopen in the coming weeks. If recommended chlorine levels are maintained as usual, the pools themselves should pose minimal risk of spreading the coronavirus to swimmers, says a Purdue University engineer who studies po…", "url": "https://www.apnnews.com/expert-swimming-pool-facilities-water-unlikely-to-spread-coronavirus/", "urlToImage": "https://cdn.apnnews.com/wp-content/themes/blognews/uploads/2017/04/logo-e1491375709643.png", "publishedAt": "2020-05-14T15:32:17Z", "content": null}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Ozone layer: Concern grows over threat from replacement chemicals - BBC News", "description": "Substances used for air conditioning in new cars are building up in the environment", "url": "https://www.bbc.com/news/science-environment-52663694", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/D617/production/_112270845_ice2.png", "publishedAt": "2020-05-14T14:08:26Z", "content": "Image copyrightUniversity of AlbertaImage caption\r\n Drilled and packaged ice core samples in the Arctic ready for processing\r\nSubstances used for air conditioning in almost all new cars are building up in the environment and may pose a threat to human health,… [+4333 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "'Mini Rover' can wiggle and crawl its way across tricky terrain on other planets - CNN", "description": "Rovers exploring planetary surfaces like Mars can get stuck in soft, steep soils. But the \"Mini Rover,\" a scaled-down 3D-printed model of a NASA rover concept built and tested by researchers at the Georgia Institute of Technology, has a gait that allows it to…", "url": "https://www.cnn.com/2020/05/13/us/mini-rover-experiment-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200513122604-01-mini-rover-super-tease.jpg", "publishedAt": "2020-05-14T13:34:03Z", "content": null}, {"source": {"id": null, "name": "Ndtv.com"}, "author": "Prabhakar Thakur", "title": "Astronomers Find Rare “Super-Earth” Towards the Centre of Our Galaxy - Gadgets 360", "description": "Astronomers have discovered a rare new “Super-Earth” closer to the centre of our galaxy. The planet is one of those few discovered planets that are similar to Earth in size and orbit.", "url": "https://gadgets.ndtv.com/science/news/super-earth-astronomers-university-of-canterbury-2228860", "urlToImage": "https://i.gadgets360cdn.com/large/planet_pixabay_full_1589458995354.jpg", "publishedAt": "2020-05-14T12:30:15Z", "content": "A Super-Earth has been found closer to the centre of our galaxy through a rare observation by researchers. The newly discovered planet, though heavier than our Earth, is one of those few planetary bodies that are similar to the Earth in terms of size and orbi… [+2554 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "NASA`s TESS enables breakthrough study of perplexing stellar pulsations - Zee News", "description": "The discovery will revolutionize scientists’ ability to study details like the ages, sizes and compositions of these stars--all members of a class named for the prototype, the bright star Delta Scuti.", "url": "https://zeenews.india.com/science/nasa-s-tess-enables-breakthrough-study-of-perplexing-stellar-pulsations-delta-scuti-2283476.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2020/05/14/860814-delta-scuti.jpg", "publishedAt": "2020-05-14T12:15:37Z", "content": "In a breakthrough study, astronomers have detected elusive pulsation patterns in dozens of young, rapidly rotating stars with the help of data from NASAs Transiting Exoplanet Survey Satellite (TESS). The discovery will revolutionize scientists ability to stud… [+6810 chars]"}, {"source": {"id": null, "name": "Earthsky.org"}, "author": "EarthSky Voices", "title": "Submerged in water, this new device uses sunlight to produce energy - EarthSky", "description": "", "url": "https://earthsky.org/human-world/solar-energy-via-water-splitting-module-artificial-leaf", "urlToImage": "https://earthsky.org/upl/2020/05/oak-leaves-Didgeman-Pixabay-5-9-2020-300x200.jpg", "publishedAt": "2020-05-14T11:03:46Z", "content": "Plants use the process of photosynthesis to generate chemical energy from sunlight. Likewise, a new energy-producing device developed at Rice University is triggered by sunlight. Image via Didgeman/ Pixabay.\r\nRice University researchers have created an effici… [+3621 chars]"}, {"source": {"id": null, "name": "Kxan36news.com"}, "author": null, "title": "It revealed the secret of long legs of dinosaurs - The KXAN 36 News", "description": null, "url": "http://www.kxan36news.com/it-revealed-the-secret-of-long-legs-of-dinosaurs", "urlToImage": null, "publishedAt": "2020-05-14T09:09:00Z", "content": "Scientists have long believed that the long legs of dinosaurs were animals needed for the development of speed during catching of prey. However, a new study suggests another reason.\r\nA new study suggests that long legs have the largest dinosaur, help animals … [+1186 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Shouvik Das", "title": "Lunar Craters: Here's Why the Moon's Surface is Filled With Massive Impact Areas - News18", "description": "Turns out, the moon's craters are billions of years old, formed as a result of massive meteorite impacts.", "url": "https://www.news18.com/news/tech/lunar-craters-heres-why-the-moons-surface-is-filled-with-massive-impact-areas-2619623.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/05/1589444286_wallach-crater_moon-surface.jpg", "publishedAt": "2020-05-14T08:26:17Z", "content": "Ever wondered why the moon's surface is speckled with so many craters? What exactly is the lunar soil like, and how different is the lunar surface really like, from that of the Earth? While multiple hypotheses have existed over the years, scientists now belie… [+1994 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "IANS", "title": "Terrestrial Life Unlikely to Contaminate Mars' Ecosystems During Exploration: Study - The Weather Channel", "description": "Scientists used Martian climate information from both atmospheric models and spacecraft measurements.", "url": "https://weather.com/en-IN/india/science/news/2020-05-14-terrestrial-life-unlikely-to-contaminate-mars-ecosystems-during", "urlToImage": "https://s.w-x.co/in-mars_4.jpg", "publishedAt": "2020-05-14T07:54:09Z", "content": "A Sharpened Ultraviolet View of Mars. \r\n(NASA/Goddard/University of Colorado /LASP)\r\nExploring Mars may not pose risk of contaminating the Martian ecosystems as the climate on the Red Planet is not suitable for terrestrial life as we know it, says a new study… [+1811 chars]"}, {"source": {"id": null, "name": "News-medical.net"}, "author": null, "title": "Scientists describe new mechanism of cellular locomotion - News-Medical.net", "description": "Whilst the whole world is in lockdown during the current Corona crisis, certain cells within our bodies are still travelling long-distance: while this happens when you develop pneumonia, any ordinary cut on your finger will also trigger white blood cells--aka…", "url": "https://www.news-medical.net/news/20200514/Scientists-describe-new-mechanism-of-cellular-locomotion.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2fMetastasis-620x480.jpg", "publishedAt": "2020-05-14T06:19:00Z", "content": "Whilst the whole world is in lockdown during the current Corona crisis, certain cells within our bodies are still travelling long-distance: while this happens when you develop pneumonia, any ordinary cut on your finger will also trigger white blood cells aka … [+4343 chars]"}, {"source": {"id": null, "name": "Indiaeducationdiary.in"}, "author": null, "title": "NASA TV to Air Launch, Capture of Cargo Ship to International Space Station - India Education Diary", "description": "NASA will broadcast the launch of a Japanese cargo spacecraft to the International Space Station beginning at 1 p.m. EDT Wednesday, May 20, live on NASA Television and the agency’s website. The Jap…", "url": "https://indiaeducationdiary.in/nasa-tv-to-air-launch-capture-of-cargo-ship-to-international-space-station/", "urlToImage": "https://i2.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/04/NASA.jpg?fit=1200%2C675&ssl=1", "publishedAt": "2020-05-14T06:14:00Z", "content": "NASA will broadcast the launch of a Japanese cargo spacecraft to the International Space Station beginning at 1 p.m. EDT Wednesday, May 20, live on NASA Television and the agencys website.\r\nThe Japan Aerospace Exploration Agency (JAXA) and Mitsubishi Heavy In… [+2624 chars]"}, {"source": {"id": null, "name": "Feedleader.com"}, "author": null, "title": "Millions of elderly people feel cut off due to a lack of tech knowledge - digitalhub - Feed Leader", "description": "NEWS COPY Millions of elderly people feel cut off due to a lack of tech knowledge – and would even avoid a GP appointment if it was over a video call, a study has found. A poll of 1,000 adults who have a relative aged over 70 found more than half …", "url": "https://feedleader.com/millions-of-elderly-people-feel-cut-off-due-to-a-lack-of-tech-knowledge-digitalhub/", "urlToImage": "https://feedleader.com/wp-content/uploads/2020/05/pexels-photo-3823494.jpeg", "publishedAt": "2020-05-14T05:09:00Z", "content": "NEWS COPY\r\nMillions of elderly people feel cut off due to a lack of tech knowledge – and would even avoid a GP appointment if it was over a video call, a study has found.\r\nA poll of 1,000 adults who have a relative aged over 70 found more than half believe th… [+4074 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Nature crisis: Moths have 'secret role' as crucial pollinators - Armenian Reporter", "description": "", "url": "https://www.bbc.co.uk/news/science-environment-52630991/", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/177E1/production/_112252269_4.png", "publishedAt": "2020-05-14T04:45:00Z", "content": "Image copyrightGetty Images\r\nLong seen as annoying creatures that may go away holes in your garments, moths have been badly misjudged, say scientists.\r\nNew research suggests they play an important function as in a single day pollinators of a variety of flower… [+3982 chars]"}, {"source": {"id": null, "name": "Sciencecodex.com"}, "author": null, "title": "NASA's ICESat-2 measures arctic ocean's sea ice thickness, snow cover - Science Codex", "description": null, "url": "https://www.sciencecodex.com/nasas-icesat-2-measures-arctic-oceans-sea-ice-thickness-snow-cover-647148", "urlToImage": "https://media.eurekalert.org/multimedia_prod/pub/web/231954_web.jpg", "publishedAt": "2020-05-14T04:00:00Z", "content": "Arctic sea ice helps keep Earth cool, as its bright surface reflects the Sun's energy back into space. Each year scientists use multiple satellites and data sets to track how much of the Arctic Ocean is covered in sea ice, but its thickness is harder to gauge… [+5197 chars]"}, {"source": {"id": null, "name": "Chemeurope.com"}, "author": null, "title": "Noble Metal Aerogels Enabled by Freezing - Chemie.de", "description": "TU Dresden chemists developed a freeze-thaw method, capable of synthesising various noble metal aerogels (NMAs) with clean surfaces and multiscale structure. In virtue of their hierarchical struct ...", "url": "https://www.chemeurope.com/en/news/1166284/noble-metal-aerogels-enabled-by-freezing.html", "urlToImage": "https://rs1.chemie.de/images//131291-76.jpg", "publishedAt": "2020-05-14T03:44:31Z", "content": "TU Dresden chemists developed a freeze-thaw method, capable of synthesising various noble metal aerogels (NMAs) with clean surfaces and multiscale structure. In virtue of their hierarchical structures and unique optical properties, outstanding performance for… [+2626 chars]"}, {"source": {"id": null, "name": "Wordpress.com"}, "author": "View all posts by Abhishek Human", "title": "A new, highly sensitive chemical sensor uses protein nanowires - stopthefud", "description": "Scientists report that they have developed bioelectronic ammonia gas sensors that are among the most sensitive ever made. It uses electric-charge-conducting protein nanowires derived from the bacte…", "url": "https://abhishekgautam1.wordpress.com/2020/05/13/a-new-highly-sensitive-chemical-sensor-uses-protein-nanowires/", "urlToImage": "https://abhishekgautam1.files.wordpress.com/2018/06/wp-1530350057440.jpg?w=200", "publishedAt": "2020-05-13T22:17:00Z", "content": "A Hinglish Science and Interesting Info Channel from a Science Lover.\r\nHi friends, I'm Abhishek and I welcome you all to this Science and information channel, Abhishek Human Are your wings all spread out and you ready to fly yet? Uh. not literally, metaphoric… [+2060 chars]"}, {"source": {"id": null, "name": "Devdiscourse.com"}, "author": "Devdiscourse News Desk", "title": "Science News Roundup: Bulgarian fossils show early arrival of Homo sapiens into Europe and Twin antibodies may help fight coronavirus - Devdiscourse", "description": "Read more about Science News Roundup: Bulgarian fossils show early arrival of Homo sapiens into Europe and Twin antibodies may help fight coronavirus  on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/1049948-science-news-roundup-bulgarian-fossils-show-early-arrival-of-homo-sapiens-into-europe-and-twin-antibodies-may-help-fight-c", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/16_01_2019_12_17_05_2873657.jpg?width=920&format=jpeg", "publishedAt": "2020-05-13T21:44:15Z", "content": "Following is a summary of current science news briefs.\r\nBulgarian fossils show early arrival of Homo sapiens into Europe\r\nFragmentary bone fossils and a molar found in Bulgaria dated roughly 45,000 years ago show that Homo sapiens populations swept into Europ… [+781 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Rachel Premack", "title": "The FDA just released a ghoulish handbook for how to convert trucks from storing coronavirus victims' bodies t - Business Insider India", "description": "Refrigerated trucks that carried victims of the coronavirus may still be reused to carry food. The US Food and Drug Administration released a handbook to help", "url": "https://www.businessinsider.in/thelife/news/the-fda-just-released-a-ghoulish-handbook-for-how-to-convert-trucks-from-storing-coronavirus-victims-bodies-to-hauling-food/articleshow/75727997.cms", "urlToImage": "https://www.businessinsider.in/photo/75727997/the-fda-just-released-a-ghoulish-handbook-for-how-to-convert-trucks-from-storing-coronavirus-victims-bodies-to-hauling-food.jpg?imgsize=354392", "publishedAt": "2020-05-13T21:41:00Z", "content": "Since late March, medical workers and funeral directors in coronavirus hotspots like New York City have been forced to store coronavirus victims in refrigerated trucks.\r\nThese trucks are typically used to move food. Now, the owners of those trucks have asked … [+2382 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Astronauts experiment with Nickelodeon's slime in space - CNN", "description": "Nickelodeon sent their signature \"slime\" to astronauts on the International Space Station to perform experiments and have a little fun #Space #CNN #News", "url": "https://www.youtube.com/watch?v=IjjADMNmLBw", "urlToImage": "https://i.ytimg.com/vi/IjjADMNmLBw/maxresdefault.jpg", "publishedAt": "2020-05-13T20:08:46Z", "content": null}, {"source": {"id": null, "name": "Techquila.co.in"}, "author": null, "title": "The Most Comprehensive Map of The Moon Yet - TechQuila", "description": "The recently released lunar map by USGS is the most comprehensive and detailed yet and it uses multiple sources for data collection.", "url": "https://www.techquila.co.in/moon-map/", "urlToImage": "https://www.techquila.co.in/wp-content/uploads/2020/05/1200px-FullMoon2010.jpg", "publishedAt": "2020-05-13T19:30:00Z", "content": "The moon has been the object of fascination for the most audacious explorers amongst us. The mere thought of a human setting foot on the natural satellite has sparked support as well as opposition for a long time. It is no wonder then that the act of putting … [+2601 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Secret Behind X-Shaped Galaxies - LiveScience", "description": "PKS 2014−55 is an X-shaped radio galaxy (XRG), an unusual type of galaxy that looks like an enormous X in the night sky when imaged in radio wavelengths. The...", "url": "https://www.youtube.com/watch?v=Ehty8yWohe8", "urlToImage": "https://i.ytimg.com/vi/Ehty8yWohe8/maxresdefault.jpg", "publishedAt": "2020-05-13T19:01:11Z", "content": null}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Kashmira Gander", "title": "Millions of Human Cells Have Been Grown Inside Mice Embryos - Newsweek", "description": "Professor Jian Feng of the Jacobs School of Medicine and Biomedical Sciences told Newsweek: \"This will enable the generation of human cells, tissues or even organs in animals.\"", "url": "https://www.newsweek.com/millions-human-cells-have-been-grown-inside-mice-embryos-1503629", "urlToImage": "https://d.newsweek.com/en/full/1589532/lab-mouse-rodent-science-stock.jpg", "publishedAt": "2020-05-13T18:08:41Z", "content": "Scientists have created millions of human cells in mouse embryos, in a technique which they hope could one day be used in a variety of ways, from growing organs for life-saving transplants to finding treatments for diseases including COVID-19.\r\nThe study cent… [+5552 chars]"}, {"source": {"id": null, "name": "Eurekalert.org"}, "author": null, "title": "Scientists successfully develop 'heat resistant' coral to fight bleaching - EurekAlert", "description": "A team of scientists has successfully produced in a laboratory setting a coral that is more resistant to increased seawater temperatures.", "url": "https://www.eurekalert.org/pub_releases/2020-05/ca-ssd051120.php", "urlToImage": "https://www.eurekalert.org/images/EurekAlert_StackedLogo_RGB.jpg", "publishedAt": "2020-05-13T18:04:44Z", "content": "The team included researchers from CSIRO, Australia's national science agency, the Australian Institute of Marine Science (AIMS) and the University of Melbourne.\r\nCorals with increased heat tolerance have the potential to reduce the impact of reef bleaching f… [+2576 chars]"}, {"source": {"id": null, "name": "Nanowerk.com"}, "author": null, "title": "Where neutrinos come from - Nanowerk", "description": "Researchers trace high-energy neutrino origins to black holes in far-off quasars.", "url": "https://www.nanowerk.com/news2/space/newsid=55145.php", "urlToImage": "https://www.nanowerk.com/news2/space/id55145.jpg", "publishedAt": "2020-05-13T16:00:44Z", "content": null}, {"source": {"id": null, "name": "Futurism.com"}, "author": null, "title": "Scientists Find New Evidence Europa Is Shooting Water Into Space - Futurism", "description": "ESA is planning its next flyby of Jupiter's icy moons as soon as 2029.", "url": "https://futurism.com/the-byte/scientists-europa-shooting-water-plumes-space", "urlToImage": "https://wp-assets.futurism.com/2020/05/scientists-europa-shooting-water-plumes-into-space-768x403.jpg", "publishedAt": "2020-05-13T15:55:56Z", "content": "Super Soaker\r\nA new study led by the European Space Agency (ESA) found new evidence that Jupiters moon Europa is indeed spouting plumes of water into space, suggesting the icy moon could hold vast subsurface oceans which some researchers suspect could possibl… [+1366 chars]"}, {"source": {"id": null, "name": "Aninews.in"}, "author": null, "title": "AI helps researchers up-cycle waste carbon - ANI News", "description": "Washington D.C. [USA], May 13 (ANI): In a breakthrough study, researchers are using artificial intelligence (AI) to accelerate progress in transforming waste carbon into a commercially valuable product with record efficiency.", "url": "https://www.aninews.in/news/science/ai-helps-researchers-up-cycle-waste-carbon20200513212130", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/fvf_amRQdLt_AxFpJf8-thumbnail-154x87-70.jpg", "publishedAt": "2020-05-13T15:52:38Z", "content": "ANI | Updated: May 13, 2020 21:21 IST\r\nWashington D.C. [USA], May 13 (ANI): In a breakthrough study, researchers are using artificial intelligence (AI) to accelerate progress in transforming waste carbon into a commercially valuable product with record effici… [+4193 chars]"}, {"source": {"id": null, "name": "Azorobotics.com"}, "author": null, "title": "Robust AI Method Morphologically Classifies Objects in Astronomical Images - AZoRobotics", "description": "At UC Santa Cruz, scientists have designed a new robust computer program known as Morpheus with the ability to examine astronomical image data pixel by pixel to determine and classify all of the stars and galaxies in huge data sets from astronomy surveys.", "url": "https://www.azorobotics.com/News.aspx?newsID=11265", "urlToImage": "https://www.azorobotics.com/images/news/ImageForNews_11265_15893709495012699.png", "publishedAt": "2020-05-13T14:50:00Z", "content": "Written by AZoRoboticsMay 13 2020\r\nAt UC Santa Cruz, scientists have designed a new robust computer program known as Morpheus with the ability to examine astronomical image data pixel by pixel to determine and classify all of the stars and galaxies in huge da… [+4979 chars]"}, {"source": {"id": null, "name": "Indiainternationaltimes.com"}, "author": "Sridhar P", "title": "What's Mars made of ? Japanese study throws light and opens up new study - India International Times", "description": "Since going to Mars, one of our closest terrestrial neighbors, is still very far away, Japanese scientists have tried something on our own planet with simulations and found that the iron-sulfur alloys thought to comprise the core of Mars to reveal details abo…", "url": "https://indiainternationaltimes.com/whats-mars-made-of-japanese-study-throws-light-and-opens-up-new-study/4110", "urlToImage": "https://i2.wp.com/indiainternationaltimes.com/wp-content/uploads/2020/05/mars3.jpg?fit=1440%2C1440&ssl=1", "publishedAt": "2020-05-13T13:01:34Z", "content": "Since going to Mars, one of our closest terrestrial neighbors, is still very far away, Japanese scientists have tried something on our own planet with simulations and found that the iron-sulfur alloys thought to comprise the core of Mars to reveal details abo… [+2910 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "B S Shylaja", "title": "A small black hole at a small distance - Deccan Herald", "description": "Science fiction movies and books also created an atmosphere of fear. The relief, however, came when we took a closer look at the numbers, the mass, the distance - all running to nine or ten digits. Then there were estimates about how close a black hole should…", "url": "https://www.deccanherald.com/science-and-environment/a-small-black-hole-at-a-small-distance-837146.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/13/file7aglo529jpjrzhvj2wm-1589374626.jpg", "publishedAt": "2020-05-13T12:57:06Z", "content": "Right from the day the word 'black hole' was coined, people have been looking at the cosmic phenomenon as a mysterious monster, just waiting to swallow everything near it. Science fiction movies and books also created an atmosphere of fear. The relief, howeve… [+3133 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Hydrogen Fuel Cells Improved With Coordination Polymer Glass - SciTechDaily", "description": "Hydrogen fuel cells made with coordination polymer glass membranes could produce as much energy as their liquid-based counterparts while adding strength and flexibility. Scientists at Japan's Institute for Integrated Cell-Material Sciences (iCeMS) are leading…", "url": "https://scitechdaily.com/hydrogen-fuel-cells-improved-with-coordination-polymer-glass/", "urlToImage": "https://scitechdaily.com/images/New-Polymer-Glass-Molecular-Structure-scaled.jpg", "publishedAt": "2020-05-13T12:42:37Z", "content": "The molecular structure of the new polymer glass facilitated the movement of protons (H+) across it under dry conditions at 120°C. Credit: Mindy Takamiya/Kyoto University iCeMS\r\nHydrogen fuel cells made with coordination polymer glass membranes could produce … [+3202 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "Scientists developed electronic diodes beyond 5G performance - Tech Explorist", "description": "NRL scientists developed a new gallium nitride-based electrical component called a resonant tunneling diode (RTD) with performance beyond the anticipated speed of 5G.", "url": "https://www.techexplorist.com/scientists-developed-electronic-diodes-beyond-5g-performance/32242/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/05/resonant-tunneling-diode.jpg", "publishedAt": "2020-05-13T12:09:03Z", "content": "David Storm, a research physicist, and Tyler Growden, an electrical engineer in collaboration with the U.S. Naval Research Laboratory, have developed new gallium nitride-based electrical component called a resonant tunneling diode (RTD) with performance beyon… [+1601 chars]"}, {"source": {"id": null, "name": "Menafn.com"}, "author": "MENAFN", "title": "Space junk: Astronomers worry as private companies push ahead with satellite launches - MENAFN.COM", "description": "(MENAFN - The Conversation) Since the launch of Sputnik 1 in 1957, the lower orbit around the Earth has become an increasingly congested environment with more than 2,200 satellite launches to dat", "url": "https://menafn.com/1100156905/space-junk-astronomers-worry-as-private-companies-push-ahead-with-satellite-launches", "urlToImage": "https://menafn.com/updates/pr/2020-05/13/TC_343cdba4-dimage_story.jpg", "publishedAt": "2020-05-13T11:43:59Z", "content": "(MENAFN - The Conversation) Since the launch of Sputnik 1 in 1957, the lower orbit around the Earth has become an increasingly congested environment with more than 2,200 satellite launches to date. Those satellites along with launch vehicle components and deb… [+4872 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Analysis of ancient minerals helped to reveal features of the earth’s atmosphere 2 billion years ago - The Times Hub", "description": null, "url": "https://thetimeshub.in/analysis-of-ancient-minerals-helped-to-reveal-features-of-the-earths-atmosphere-2-billion-years-ago/18014/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2020/05/03d5c5e687cc88718a45423128fad70b-636x400.jpg", "publishedAt": "2020-05-13T11:07:03Z", "content": "A thorough analysis of ancient mineral deposits has allowed scientists to draw a conclusion about what was the oxygen level on Earth 2 billion years ago. As it turned out, at that time the planet was much more saturated with oxygen than it was assumed before.… [+947 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Scientists: On the inner rotating core of the Earth rising mountains - The Times Hub", "description": null, "url": "https://thetimeshub.in/scientists-on-the-inner-rotating-core-of-the-earth-rising-mountains/18012/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2020/05/fe5590aa8fd725088fe88fbd503cd3c8-606x400.jpg", "publishedAt": "2020-05-13T11:06:49Z", "content": "Scientists from the University of Illinois after the analysis of seismic data and studies constantly rotating inner core of the Earth said that there are mountains. The American experts were told about the past mistakes of geologists.\r\nIn 1996, for the first … [+1136 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "'Fast & Furious' Aten-Class Asteroid Will Closely Approach Earth This June - Sputnik International", "description": "Aten-class asteroids spend most of their time inside Earth’s orbit and from time to time they come quite close to our planet, sparking fears about an imminent collision.", "url": "https://sputniknews.com/science/202005131079290831-fast--furious-aten-class-asteroid-will-closely-approach-earth-this-june/", "urlToImage": "https://cdn1.img.sputniknews.com/images/107929/08/1079290800.jpg", "publishedAt": "2020-05-13T11:00:53Z", "content": null}, {"source": {"id": null, "name": "Eurekalert.org"}, "author": null, "title": "NMR confirms molecular switches retain function in 2D-array - EurekAlert", "description": "Researchers led by Jiri Kaleta of IOCB Prague have synthesized regular 2D assemblies of isotopically labelled molecular switches and measured the properties of their isomerization, revealing that formation of such an assembly doesn't hamper the photochemical …", "url": "https://www.eurekalert.org/pub_releases/2020-05/iooc-ncm051220.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/231663_web.jpg", "publishedAt": "2020-05-13T10:01:39Z", "content": "IMAGE: Isotopically labelled molecular switch\r\n(Source: https://www.uochb.cz/en/news/171)\r\n view more \r\nCredit: Tomas Bellon / IOCB Prague\r\nPrague, 15 May 2020 - Researchers led by Jiri Kaleta of IOCB Prague have synthesized regular 2D assemblies of isotopica… [+2970 chars]"}, {"source": {"id": null, "name": "Uploadcomet.com"}, "author": "Calvin S. Heenan", "title": "What We See at the Collision Site of Two Galaxy Clusters - Upload Comet", "description": "A few hundred million years ago, two clusters of galaxies crashed into each other, then passed one through the other. This colossal occurrence sent free a barrage of hot gas from each of the clusters, forming an out of the ordinary bridge between the two cele…", "url": "https://uploadcomet.com/what-we-see-at-the-collision-site-of-two-galaxy-clusters/8002/", "urlToImage": "https://uploadcomet.com/wp-content/uploads/2020/05/What-We-See-at-the-Collision-Site-of-Two-Galaxy-Clusters.jpg", "publishedAt": "2020-05-13T09:44:00Z", "content": "A few hundred million years ago, two clusters of galaxies crashed into each other, then passed one through the other. This colossal occurrence sent free a barrage of hot gas from each of the clusters, forming an out of the ordinary bridge between the two cele… [+1538 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Tessa Koumoundouros", "title": "We Still Have No Idea How Male And Female Dinosaurs Differ, Study Shows - ScienceAlert", "description": "The idea that female Tyrannosaurus rex are chonkier than males may have no basis in reality. This assumption has prevailed when it comes to popular notions of these prehistoric beasties, but its origin might have been mistaken.", "url": "https://www.sciencealert.com/paleontologists-can-t-yet-tell-male-and-female-dinosaurs-apart", "urlToImage": "https://www.sciencealert.com/images/2020-05/processed/CrazyColouredDinosDimorphicCantTell_1024.jpg", "publishedAt": "2020-05-13T07:22:12Z", "content": "The idea that female Tyrannosaurus rex are chonkier than males may have no basis in reality. This assumption has prevailed when it comes to popular notions of these prehistoric beasties, but its origin might have been mistaken.\r\nIn the science world, sexing d… [+3189 chars]"}, {"source": {"id": null, "name": "Coastalmorningstar.com"}, "author": "Claude Denni", "title": "Newly Discovered Comet SWAN Might Soon Fizzle Out of View - Coastal Morning Star", "description": "During the following couple of weeks, we’ll get an opportunity of considering a comet as it clears past the sun.", "url": "http://coastalmorningstar.com/2020/05/12/newly-discovered-comet-swan-might-soon-fizzle-out-of-view/", "urlToImage": "http://coastalmorningstar.com/wp-content/uploads/2020/05/swan-candy-f-07a3-1589270636.jpg", "publishedAt": "2020-05-13T05:50:28Z", "content": "During the following couple of weeks, we’ll get an opportunity of considering a comet as it clears past the sun.\r\nThe comet’s name is SWAN, an abbreviation for the Solar Wind Anisotropies camera on NASA’s Solar and Heliospheric Observatory (SOHO). Formally as… [+1109 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "In aqueous inclusions of the meteorite, scientists found conditions for the formation of amino acids - The Times Hub", "description": null, "url": "https://thetimeshub.in/in-aqueous-inclusions-of-the-meteorite-scientists-found-conditions-for-the-formation-of-amino-acids/17888/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2020/05/3c6f433e74fa3f00469fa9cce57cbb77.jpg", "publishedAt": "2020-05-13T05:07:24Z", "content": "Scientists have studied water inclusions in the meteorite lake Tagish. Fluid indicates the possibility of formation in these bodies of amino acids, which are building blocks of proteins, necessary for the emergence of life. \r\nResearchers from the Royal Ontari… [+732 chars]"}, {"source": {"id": null, "name": "Plenglish.com"}, "author": "", "title": "China's modern spacecraft returns to Earth successfully - Prensa Latina", "description": "Beijing, May 8 (Prensa Latina) China's prototype spacecraft returned to Earth successfully on Friday, after following instructions from the Beijing Aerospace Control Center.", "url": "https://www.plenglish.com/index.php?o=rn&id=55492&SEO=chinas-modern-spacecraft-returns-to-earth-successfully", "urlToImage": "http://www.plenglish.com/images/2020/mayo/08/china-nave-espacial.jpg", "publishedAt": "2020-05-08T15:34:48Z", "content": "Beijing, May 8 (Prensa Latina) China's prototype spacecraft returned to Earth successfully on Friday, after following instructions from the Beijing Aerospace Control Center.\r\nAccording to the China Manned Space Agency (CMSA), it is an experimental capsule tha… [+690 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": null, "title": "NASA Explore Technology To Build Future Homes Made of Fungi For Moon, Mars - http://www.newsgram.com/", "description": "Instead of habitats made of metal and glass, NASA is exploring technologies that could grow structures out of fungi to become our future homes in the stars.", "url": "https://www.newsgram.com/nasa-build-homes-fungi-moon-mars/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2020/01/NASA-Logo.jpg", "publishedAt": "2020-01-18T10:02:49Z", "content": "By Muskan Bhatnagar\r\nHow boring and hard is it to sit back at home during lockdown? No new episodes, no new movies, no delicious restaurant food, no car rides, no parties, no meetups with friends, and no travel plans.\r\nBut do we realize how privileged we are … [+4327 chars]"}, {"source": {"id": null, "name": "Mentalfloss.com"}, "author": null, "title": "5 Fast Facts About the Spring Equinox - Mental Floss", "description": "The spring equinox occurs on March 19, 2020, at 11:49 p.m. Eastern Time—the earliest it has ever arrived in 124 years. Here's what you should know about it, including if you can balance an egg during the event.", "url": "https://www.mentalfloss.com/article/577353/spring-equinox-facts", "urlToImage": "https://images2.minutemediacdn.com/image/upload/c_crop,h_1194,w_2121,x_0,y_220/v1584620220/shape/mentalfloss/577353-gettyimages-624128826.jpg?itok=7IYjR8dN", "publishedAt": "2019-11-03T15:57:56Z", "content": "After months of quarantine, you've probably binged all your usual TV shows, cooked your favorite go-to meals, and spent more time aimlessly staring at your phone than you'd care to admit. To break up what feels like a monotonous blur of days spent cooped up i… [+26281 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": null, "title": "Before Nobel Prizes, It Was the Gift That Reigned in Science - The Wire", "description": "From pleasing patrons to realising the need for the progress of mankind, the Nobel Prize has come a long way to being formalised today.", "url": "https://thewire.in/history/before-nobels-gifts-to-and-from-rich-patrons-were-early-sciences-currency-2", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2019/10/12180913/NOBEL-PRIZEPEACEjpg-800x400.jpg", "publishedAt": "2019-10-13T03:36:24Z", "content": "While the first Nobel Prizes were handed out in 1901, rewards for scientific achievement have been around much longer. As early as the 17th century, at the very origins of modern experimental science, promoters of science realised the need for some system of … [+9460 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "NASA Scientists Reveal New Information on Mars' Formation and Evolution, Claim The Red Planet has a Porous Crust - http://www.newsgram.com/", "description": "Washington, Septemeber 15, 2017 : Mars’s crust is not as dense as previously thought and a lower density likely means that at least part of the Red Planet’s crust is relatively porous, says a new NASA study. The findings, published in the journal Geophysical …", "url": "https://www.newsgram.com/nasa-scientists-mars-formatio-evolution-porous-crust/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2017/09/Mars.v1.jpg", "publishedAt": "2017-09-15T04:47:21Z", "content": "NASA’s Hubble Space Telescope and the ground-based Gemini Observatory in Hawaii have teamed up with the Juno spacecraft to probe the mightiest storms on the giant planet Jupiter.\r\nThe images, part of a multi-year joint programme, revealed that lightning strik… [+2735 chars]"}]}