{"status": "ok", "totalResults": 59, "articles": [{"source": {"id": null, "name": "Indianexpress.com"}, "author": "Tech Desk", "title": "Now you can own a piece of Moon; all you need is Rs 18.9 crore - The Indian Express", "description": "This particular rock is one of the 30 lunar meteorites that landed on Earth hundreds or thousands of year ago when a comet or asteroid collided with our Moon and broke off some chunks of its surface.", "url": "https://indianexpress.com/article/technology/science/moon-rock-sale-6391924/", "urlToImage": "https://images.indianexpress.com/2020/05/moon-rock-759.jpg?w=759", "publishedAt": "2020-05-03T12:33:24Z", "content": "By: Tech Desk | New Delhi | \r\nUpdated: May 3, 2020 6:17:14 pm\r\nNWA 12691 a massive specimen of the Moon. Lunar Feldspathic Breccia. Sahara Desert, Western Sahara. Offered for private sale at Christies. (Image: Christi’s)Countless poets and songwriters have ta… [+2388 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Ian Kane & Michael Clare, The Conversation", "title": "Scientists Find The Highest-Ever Concentration of Microplastics on The Seafloor - ScienceAlert", "description": "What if the \"great ocean garbage patches\" were just the tip of the iceberg? While more than 10 million tonnes of plastic waste enters the sea each year, we actually see just 1 percent of it – the portion that floats on the ocean surface. What happe", "url": "https://www.sciencealert.com/teeny-tiny-plastics-are-sinking-deep-into-the-ocean-to-where-life-is-abundant", "urlToImage": "https://www.sciencealert.com/images/2020-05/processed/tinymicroplastic_1024.jpg", "publishedAt": "2020-05-03T11:38:50Z", "content": "What if the \"great ocean garbage patches\" were just the tip of the iceberg? While more than 10 million tonnes of plastic waste enters the sea each year, we actually see just 1 percent of it the portion that floats on the ocean surface. What happens to the mis… [+3700 chars]"}, {"source": {"id": null, "name": "Scoopwhoop.com"}, "author": "Pradamini Kumari", "title": "Powerful Radio Signal Recorded Within Our Galaxy For The First Time Ever. Aliens, It You? - ScoopWhoop", "description": "Astronomers claim to have recorded a very powerful radio signal coming from within our galaxy for the very first time.", "url": "https://www.scoopwhoop.com/news/astronomers-record-powerful-radio-signals-coming-from-within-our-galaxy/", "urlToImage": "https://s3.scoopwhoop.com/anj2/5eae94c518ac8160d3161fa5/95c26cc2-b443-41f4-a130-7cdd6c00d7a3.jpg", "publishedAt": "2020-05-03T11:27:06Z", "content": "Days after Pentagon officially released three UFO videos shot by US Navy Pilots in the past, astronomers claim to have recorded a very powerful radio signal coming from within our galaxy for the very first time. \r\nThis new finding has perplexed astronomers be… [+1097 chars]"}, {"source": {"id": null, "name": "Thelogicalindian.com"}, "author": "Navya Singh", "title": "Largest Recorded Hole In Ozone Layer Over Arctic Now Closed: UN - The Logical Indian", "description": "The hole had suddenly reached a record high in March due to the presence of ozone depleting...", "url": "https://thelogicalindian.com/environment/ozone-layer-largest-hole-over-arctic-closed-20896", "urlToImage": "https://thelogicalindian.com/content/servlet/RDESController?command=rdm.Picture&sessionId=RDWEBF8ZTNM9UW3F4CF04NW0X73XKZJAHSEQ2&app=rdes&partner=tli&type=7&uid=23716RYnfzHViUS2t8s6nvheRwYDnAqZEtUY67794736", "publishedAt": "2020-05-03T09:46:32Z", "content": "The ozone depletion over the Arctic hit a record high in March. It was the biggest and even worse recorded hole since 2001. \r\nThe UN World Meteorological Organisation on Friday said that the whole is now closed. This was first announced on April 23rd, by the … [+1488 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Isobel Asher Hamilton", "title": "3D glasses, double headsets, and rock drilling: NASA engineers told us what it's like to drive a Mars rover fr - Business Insider India", "description": "NASA's staff is currently working from home due to the coronavirus pandemic — and this includes the team currently piloting the Curiosity rover on the surface", "url": "https://www.businessinsider.in/tech/news/3d-glasses-double-headsets-and-rock-drilling-nasa-engineers-told-us-what-its-like-to-drive-a-mars-rover-from-home-during-the-pandemic/articleshow/75517015.cms", "urlToImage": "https://www.businessinsider.in/photo/75517015/3d-glasses-double-headsets-and-rock-drilling-nasa-engineers-told-us-what-its-like-to-drive-a-mars-rover-from-home-during-the-pandemic.jpg?imgsize=1207581", "publishedAt": "2020-05-03T09:04:00Z", "content": "Remote work doesn't get much more remote than piloting a robot 140 million miles away on the surface of Mars.\r\nNASA, alongside many other workplaces, has had to shut its doors during the coronavirus pandemic. For engineers and scientists working at the Jet Pr… [+6230 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Zaini Majeed", "title": "Spinosaurus terrorized rivers and river banks as a semi-aquatic animal: Study - Republic World - Republic World", "description": "Scientists found that the Spinosaurus was actually marine reptile, known as the Plesiosaurs, which, despite their appearance, are not dinosaurs.", "url": "https://www.republicworld.com/world-news/rest-of-the-world-news/spinosaurus-were-first-dinosaur-aquatic-species-say-researchers.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/i5rum98cppgcihaa_1588433612.jpeg?tr=f-jpeg", "publishedAt": "2020-05-03T06:03:00Z", "content": "In a groundbreaking discovery, scientists have discovered that the largest and most enigmatic dinosaur species known as the Spinosaurus aegyptiacus was a proficient swimmer and not the typical land-dweller, which has long been the matter of debate. Belonging … [+2714 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Who is the chess player on Mars? - India Gone Viral", "description": "5/2/2020 – A “Mars opposition” occurs when planet Earth passes in between the Sun and planet Mars. It happens every 2 years and 2 months – 779.94 Earth days to be precise. Then Mars becomes a beautifu", "url": "https://indiagoneviral.com/science/2020/05/03/who-is-the-chess-player-on-mars/49122/india-gone-viral/", "urlToImage": "https://shop.chessbase.com/en/pics/pth_8225_141", "publishedAt": "2020-05-03T03:01:03Z", "content": "The Mars Opposition\r\nOn Wednesday, August 27 2003, at 10:51 GMT, the planet Mars approached the earth closer than at any time during the last 60,000 years. It became the brightest object in the night sky, a beautiful red jewel in the firmament, with an appare… [+4960 chars]"}, {"source": {"id": null, "name": "Pragativadi.com"}, "author": "pragativadinewsservice", "title": "Satellite images show melting ice sheets in Antarctica and Greenland - Pragativadi", "description": "New York: Fresh data from NASA showed clear images of Antarctica’s rapidly melting ice. NASA satellites have provided more data than ever before on what has been happening to Antarctica and Greenland's ice over the past 16 years with dire.Both polar", "url": "https://pragativadi.com/satellite-images-show-melting-ice-sheets-in-antarctica-and-greenland/", "urlToImage": "https://i1.wp.com/pragativadi.com/wp-content/uploads/2020/05/IMG_20200503_080216.jpg?fit=1080%2C698&ssl=1", "publishedAt": "2020-05-03T02:41:00Z", "content": "New York: Fresh data from NASA showed clear images of Antarcticas rapidly melting ice. NASA satellites have provided more data than ever before on what has been happening to Antarctica and Greenland’s ice over the past 16 years with dire.\r\nBoth polar ice shee… [+1163 chars]"}, {"source": {"id": null, "name": "Universetoday.com"}, "author": "https://www.facebook.com/Storiesbywilliams-205745679447998/?ref=hl", "title": "Supermassive Black Hole Orbits an Even More Massive Black Hole, Crashing Through its Accretion Disk Every 12 Years - Universe Today", "description": "Recent observations by the now-retired Spitzer mission have led to accurate predictions OJ 287, a blazar that contains a supermassive black hole orbited by another black hole.", "url": "https://www.universetoday.com/145935/supermassive-black-hole-orbits-an-even-more-massive-black-hole-crashing-through-its-accretion-disk-every-12-years/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2020/05/eventhorizon_orbit.jpg", "publishedAt": "2020-05-02T23:41:00Z", "content": "NASA’s Spitzer Space Telescope may be retired, but the things it witnessed during its sixteen and a half year mission will be the subject of study for many years to come. For instance, Spitzer is the only telescope to witness something truly astounding occurr… [+6871 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Lockdown effect: No rules of social distancing apply here - The Financial Express", "description": "Social media use surges; average time spent on platforms like Facebook and Instagram up by over 60%.", "url": "https://www.financialexpress.com/industry/technology/lockdown-effect-no-rules-of-social-distancing-apply-here/1946444/", "urlToImage": "https://images.financialexpress.com/2020/05/1-23.jpg", "publishedAt": "2020-05-02T20:23:47Z", "content": "Even when we were not forced by a lockdown and a deadly virus to remain physically distant from friends and family, social media was a popular way to remain in touch. Now, it is the only way, barring phone calls.\r\nData also points likewise. A recent report by… [+3546 chars]"}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Paula Tudoran", "title": "The Sun Shows Peculiar Behavior in Comparison With Other Similar Stars in the Universe - Dual Dove", "description": "The Sun is proving some unusual behavior, researchers have claimed: it seems to be very quiet in comparison to its galactic fellows. A new study used data collected by Kepler Space Telescope to dra…", "url": "https://www.dualdove.com/the-sun-shows-peculiar-behavior-in-comparison-with-other-similar-stars-in-the-universe/9963/", "urlToImage": "https://www.dualdove.com/wp-content/uploads/2020/05/Sun.jpg", "publishedAt": "2020-05-02T17:31:21Z", "content": "The Sun is proving some unusual behavior, researchers have claimed: it seems to be very quiet in comparison to its galactic fellows. A new study used data collected by Kepler Space Telescope to draw a comparison between the brightness of the Sun with other si… [+1921 chars]"}, {"source": {"id": null, "name": "Asiatimes.com"}, "author": "Dave Makichuk", "title": "Boeing left out of NASA’s lunar lander competition - Asia Times", "description": "And then there were three — and this time, Boeing has been left out. NASA has selected three US aerospace firms to design and develop human landing systems for the agency’s Artemis program, o…", "url": "http://asiatimes.com/2020/05/boeing-left-out-of-nasas-lunar-lander-competition/", "urlToImage": "https://i1.wp.com/asiatimes.com/wp-content/uploads/2020/05/BLue-Origin.png?fit=1134%2C707&ssl=1", "publishedAt": "2020-05-02T16:21:00Z", "content": "And then there were three and this time, Boeing has been left out.\r\nNASA has selected three US aerospace firms to design and develop human landing systems for the agencys Artemis program, one of which will land the first woman and next man on the surface of t… [+3799 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "NASA begs spectators for astronaut launch: Please stay home! - Moneycontrol", "description": "It will be the first launch of astronauts from NASA’s Kennedy Space Center in nine years — ever since the last space shuttle flight in 2011. It also will be the first attempt by a private company to fly astronauts to orbit.", "url": "https://www.moneycontrol.com/news/world/nasa-begs-spectators-for-astronaut-launch-please-stay-home-5215601.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2019/10/nasa-2313267_1280-770x432-770x433.jpg", "publishedAt": "2020-05-02T15:58:15Z", "content": "NASA and SpaceX on Friday urged spectators to stay home for the first home launch of astronauts in nearly a decade because of the coronavirus pandemic.\r\nTop officials warned the public against traveling to Florida for the May 27 launch of two NASA astronauts … [+1504 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Shannon Stirone", "title": "Space Photos of the Week: Happy Birthday, Hubble! - WIRED", "description": "Every year on the telescope's birthday, we're the ones who get a gift: a brilliant and never-before-seen snapshot of the cosmos.", "url": "https://www.wired.com/story/space-photos-of-the-week-happy-birthday-hubble-30/", "urlToImage": "https://media.wired.com/photos/5eaca02f381a11d296a5adab/191:100/w_1280,c_limit/photo_space_hubble_1_stsci-h-p2016a-m.jpg", "publishedAt": "2020-05-02T14:18:39Z", "content": "NASA launched the Hubble Space Telescope on April 24,1990, and Hubble has been busy observing the universe ever since. In honor of its 30th birthday, well explore some of its most memorable and mind-blowing photos, starting with the anniversary photo. This im… [+3088 chars]"}, {"source": {"id": null, "name": "Gizbot.com"}, "author": "Sharmishte Datti", "title": "NASA VITAL Ventilators Get FDA Approval To Fight COVID-19 - Gizbot", "description": "As the coronavirus pandemic continued sweeping across the globe, NASA put a halt on its usual space-related activities and began developing a prototype ventilator to help combat the deadly virus. Now the NASA VITAL ventilator got FDA approval.", "url": "https://www.gizbot.com/news/nasa-vital-ventilators-to-fight-covid-19-get-fda-approval-067437.html", "urlToImage": "https://www.gizbot.com/img/2020/05/nasa-vital-ventilators-to-fight-covid-19-get-fda-approval-1588349841.jpg", "publishedAt": "2020-05-02T13:22:46Z", "content": "As the coronavirus pandemic continued sweeping across the globe, NASA put a halt on its usual space-related activities and began developing a prototype ventilator to help combat the deadly virus. The newly developed ventilator has just received emergency appr… [+2445 chars]"}, {"source": {"id": null, "name": "Sciencetimes.com"}, "author": "Staff Reporter", "title": "Astronomers Catch Radio Signals Emanating from the Milky Way; Where Is the Source Coming From? - Science Times", "description": "A radio signal was detected coming deep within outer space. Scientists are still forming theories as to where fast radio bursts come from. Click the link to learn more.", "url": "https://www.sciencetimes.com/articles/25551/20200502/astronomers-catch-radio-signals-emanating-milky-way-where-source-coming.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/27336/radio-signal-from-space.jpg", "publishedAt": "2020-05-02T11:24:28Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Eta Aquariid meteor shower: When and how to watch - msnNOW", "description": "The Eta Aquariid meteor shower is expected to peak on Tuesday, but a nearly full moon could outshine the show. They may be most visible on Sunday morning before dawn on Sunday, with a better chance for more visible meteors in the southern hemisphere.", "url": "https://www.cnn.com/2020/05/02/world/eta-aquariid-meteor-shower-scn-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200501152109-eta-aquariid-meteor-shower-restricted-super-tease.jpg", "publishedAt": "2020-05-02T11:15:00Z", "content": null}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Aswathy T O", "title": "International Astronomy Day 2020: 5 exhilarating ways to discover the outer space amid lockdown - International Business Times, India Edition", "description": "International Astronomy Day 2020 aims to attract the public interest in to the field of astronomy and space science by providing easier access to the public to learn more on the subject.", "url": "https://www.ibtimes.co.in/international-astronomy-day-2020-5-ways-discover-outer-space-amid-lockdown-818936", "urlToImage": "https://data1.ibtimes.co.in/en/full/737466/night-sky.jpg", "publishedAt": "2020-05-02T10:26:27Z", "content": "Watchdog Group in the US releases reports on Taliban Attacks\r\nWhat do you love the most about the unfathomable sky and the mysterious outer space above its horizon?\r\nOn this International Astronomy Day, you can't stop the dormant astronomy enthusiast in you t… [+2583 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "In search of dark matter with the coldest material of the universe - Tech Explorist", "description": "A study in PRL reports on how researchers at ICFO have built a spinor BEC comagnetometer, an instrument for studying the axion, a hypothetical particle that may explain the mystery of dark matter.", "url": "https://www.techexplorist.com/in-search-of-dark-matter-with-the-coldest-material-of-the-universe/31989/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/05/axdarkmatter.jpg", "publishedAt": "2020-05-02T10:16:36Z", "content": "Our current understanding of cosmology and nuclear physics suggests that dark matter can be formed from axions, hypothetical particles with unusual symmetry properties.\r\nIn a new study, scientists reported a new way to search for axions using the unique prope… [+1315 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Robin George Andrews", "title": "Antarctica vs. Science - The New York Times", "description": "For researchers using delicate, one-of-a-kind equipment, the extreme conditions at the bottom of the planet pose special challenges.", "url": "https://www.nytimes.com/2020/05/02/science/antarctica-science-equipment.html", "urlToImage": "https://static01.nyt.com/images/2020/04/24/science/00SCI-ANTARCTICWRECKAGE1/00SCI-ANTARCTICWRECKAGE1-facebookJumbo.jpg", "publishedAt": "2020-05-02T09:27:43Z", "content": "At the start of January, the same month the world marked the 200th anniversary of the discovery of Antarctica, scientists on snowmobiles were zipping across its diamantine ice, dragging a rig of metal detectors in their wake. Researchers were hoping to discov… [+5857 chars]"}, {"source": {"id": null, "name": "Newslanded.com"}, "author": null, "title": "Newly found superconductor could revolutionize Quantum Computers - News Landed", "description": "Superconductors are materials that offer no resistance in conducting electricity or flow electrons from one atom to another.", "url": "https://newslanded.com/2020/05/02/new-superconductor-quantum-computers/", "urlToImage": "https://newslanded.b-cdn.net/wp-content/uploads/2020/05/043020_ec_superconductor_feat_rev_opt1-1028x579-1.jpg", "publishedAt": "2020-05-02T09:21:35Z", "content": "Electric current was found along the edge of a newly found superconductor.\r\nScientists, for the first time, observed semiconducting current flowing along the edge of the material. Physicist Nai Phuan Ong and colleagues from Princeton University found this phe… [+2785 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": null, "title": "NASA wants to buy at the “Roscosmos” additional space on the “Union” - The Times Hub", "description": null, "url": "https://thetimeshub.in/nasa-wants-to-buy-at-the-roscosmos-additional-space-on-the-union/13466/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2020/05/cb6acd2943e6221d689a4f919168a2da-633x400.jpg", "publishedAt": "2020-05-02T06:06:59Z", "content": "The American space Agency has begun negotiations with the Russian state Corporation “Roscosmos” on the subject of acquiring additional space on the “Union”. The fact of such talks, said earlier the head of NASA Jim Breidenstein.\r\nAccording to Bridenstine, the… [+925 chars]"}, {"source": {"id": null, "name": "Indiaeducationdiary.in"}, "author": null, "title": "UBC researchers establish new timeline for ancient magnetic field on Mars - India Education Diary", "description": "Mars had a global magnetic field much earlier—and much later—in the planet’s history than scientists have previously known. A planet’s global magnetic field arises from what scientists call a dynam…", "url": "https://indiaeducationdiary.in/ubc-researchers-establish-new-timeline-for-ancient-magnetic-field-on-mars/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/05/Maven-artists-concept-02-1024x622-1.jpg?fit=1024%2C622&ssl=1", "publishedAt": "2020-05-02T05:17:50Z", "content": "Mars had a global magnetic field much earlierand much laterin the planets history than scientists have previously known.\r\nA planets global magnetic field arises from what scientists call a dynamo: a flow of molten metal within the planets core that produces a… [+3796 chars]"}, {"source": {"id": null, "name": "Ancient-origins.net"}, "author": "ancient-origins", "title": "66-Million-Year-Old 'Crazy Beast' Fossil Discovered on Madagascar - Ancient Origins", "description": "In evolutionary terms, islands are the stuff of weirdness. It is on islands where animals evolve in isolation, often for millions of years, with different food sources, competitors, predators, and parasites...indeed, different everything compared to mainland …", "url": "https://www.ancient-origins.net/news-evolution-human-origins/crazy-beast-0013656", "urlToImage": "https://www.ancient-origins.net/sites/default/files/field/image/Crazy-beast.jpg", "publishedAt": "2020-05-02T01:05:01Z", "content": "In evolutionary terms, islands are the stuff of weirdness. It is on islands where animals evolve in isolation, often for millions of years, with different food sources, competitors, predators, and parasites...indeed, different everything compared to mainland … [+8643 chars]"}, {"source": {"id": null, "name": "Newsinfopark.com"}, "author": "NIP Web Desk Team", "title": "Researchers see path to quantum computing at room temperature - News Info Park", "description": "Credit: CC0 Public Domain Army researchers predict quantum computer circuits that will no longer need extremely cold temperatures to function could become a reality after about a decade. For years, so", "url": "https://newsinfopark.com/science/2020-05-01/article/researchers-see-path-to-quantum-computing-at-room-temperature-26011/nip-web-desk-team/", "urlToImage": "https://scx1.b-cdn.net/csz/news/800/2018/quantum.jpg", "publishedAt": "2020-05-01T23:24:06Z", "content": "Army researchers predict quantum computer circuits that will no longer need extremely cold temperatures to function could become a reality after about a decade.\r\nFor years, solid-state quantum technology that operates at room temperature seemed remote. While … [+6475 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Capturing CO2 with new self-forming membrane - Science Daily", "description": "A new class of self-forming membrane has been developed. Capturing the carbon dioxide which can then be processed, the membrane dramatically reduced the demand for silver and the cost.", "url": "https://www.sciencedaily.com/releases/2020/05/200501120054.htm", "urlToImage": null, "publishedAt": "2020-05-01T23:18:19Z", "content": "Newcastle University researchers have developed a new class of self-forming membrane to separate carbon dioxide from a mixture of gases. Operating like a coffee filter, it lets harmless gases, such as nitrogen, exit into the atmosphere and then the carbon dio… [+3557 chars]"}, {"source": {"id": null, "name": "Wric.com"}, "author": null, "title": "30-pound piece of moon for sale - 8News", "description": "Talk about an \"out of this world\" trinket.", "url": "https://www.wric.com/video/30-pound-piece-of-moon-for-sale/5469370/", "urlToImage": "https://jkvdxu3faz4qgr2j6w5qctdnde.gcdn.anvato.net/pvw_lin/78B/7EC/78B7ECE2632D430B8B525BCC157AA254_8.jpg?Expires=1682985600&KeyName=mcpkey1&Signature=byuqrnKa84qVDOW1205Xkcq_VhM", "publishedAt": "2020-05-01T23:16:58Z", "content": null}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "Physicists identify unique signature to confirm quark-gluon plasma in universe - Ars Technica", "description": "Simulations show that QGP could form in immediate aftermath of neutron star merger", "url": "https://arstechnica.com/science/2020/05/physicists-identify-unique-signature-to-confirm-quark-gluon-plasma-in-universe/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2020/04/qgp1-760x380.jpg", "publishedAt": "2020-05-01T23:05:00Z", "content": "16 with 15 posters participating\r\nComputer simulation of a merger between two dense neutron stars. After the merger, a phase transition from ordinary hadronic matter (red-yellow) to quark matter (green) takes place.\r\nIn the first fractions of a second of our … [+5936 chars]"}, {"source": {"id": null, "name": "Visualcapitalist.com"}, "author": "Nick Routley", "title": "Incredible Map of Pangea With Modern-Day Borders - Visual Capitalist", "description": "Many millions of years ago, the world was one. This nifty map shows this Pangea supercontinent overlaid with modern country borders.", "url": "https://www.visualcapitalist.com/incredible-map-of-pangea-with-modern-borders/", "urlToImage": "https://www.visualcapitalist.com/wp-content/uploads/2020/05/pangea-share-1000x600.jpg", "publishedAt": "2020-05-01T22:56:23Z", "content": "View the high resolution version of this infographic by clicking here.\r\nIn just a few decades, it’s possible that some of today’s most recognized companies may no longer be household names.\r\nCorporate longevity, or the average lifespan of a company, has been … [+6591 chars]"}, {"source": {"id": null, "name": "Theweek.in"}, "author": null, "title": "Army researchers achieve great feat in quantum computing at room temperature - THE WEEK", "description": "Scientists have proved feasibility of quantum bit that operates at room temperatures", "url": "https://www.theweek.in/news/sci-tech/2020/05/02/army-researchers-achieve-great-feat-quantum-computing-room-temperature.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/sci-tech/2019/June/quantum-computer-isometric-AI-big-data-circuit-board-processor-shut.jpg", "publishedAt": "2020-05-01T22:43:48Z", "content": "US Army researchers have affirmed that future quantum computer circuits will not require extremely cold temperatures to function and it could become a reality as early as a decade.\r\nIn a quantum computer, the basic unit of memory is a quantum bit or qubit whi… [+3708 chars]"}, {"source": {"id": null, "name": "Sciencemag.org"}, "author": null, "title": "Biologists invent a new way to fight viruses with llama blood and molecular super glue - Science Magazine", "description": "Combinations of small antibodies block viruses, scientists show", "url": "https://www.sciencemag.org/news/2020/05/biologists-invent-new-way-fight-viruses-llama-blood-and-molecular-super-glue", "urlToImage": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/riftvalley_1280p.jpg?itok=48u-6337", "publishedAt": "2020-05-01T22:40:00Z", "content": "Researchers have shown that small antibodies can block the Rift Valley fever virus (above) from entering cells.\r\nLAGUNA DESIGN/Science Source \r\nBy Mitch LeslieMay. 1, 2020 , 6:40 PM\r\nFor more than 20 years, researchers have tried with limited success to engin… [+3987 chars]"}, {"source": {"id": null, "name": "Slashgear.com"}, "author": "Brittany A. Roston", "title": "NASA reprocessed Europa images from the ’90s to reveal stunning details - SlashGear", "description": "NASA has reprocessed images of Jupiter’s moon Europa that were captured by its Galileo spacecraft back in the 1990s. The reprocessed versions of the images reveal the moon’s surface in …", "url": "https://www.slashgear.com/nasa-reprocessed-europa-images-from-the-90s-to-reveal-stunning-details-01619028/", "urlToImage": "https://scdn.slashgear.com/wp-content/uploads/2020/05/nasa_europa_main.jpg", "publishedAt": "2020-05-01T21:57:08Z", "content": "NASA has reprocessed images of Jupiter’s moon Europa that were captured by its Galileo spacecraft back in the 1990s. The reprocessed versions of the images reveal the moon’s surface in stunning detail, highlighting what NASA refers to as ‘chaos terrain’ and a… [+1534 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "George Dvorsky", "title": "Research Casts Doubt on Elliptical Galaxies Being Cradles of Intelligent Life - Gizmodo", "description": "We live inside a spiral galaxy, but one school of thought suggests oval-shaped elliptical galaxies are most likely to host intelligent civilizations. A new paper tries to overturn this assumption by applying a classic philosophical technique used by scientist…", "url": "https://gizmodo.com/research-casts-doubt-on-elliptical-galaxies-being-cradl-1843203569", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/psshwjzbymfxtv2zpzwe.jpg", "publishedAt": "2020-05-01T21:45:29Z", "content": "We live inside a spiral galaxy, but one school of thought suggests oval-shaped elliptical galaxies are most likely to host intelligent civilizations. A new paper tries to overturn this assumption by applying a classic philosophical technique used by scientist… [+4471 chars]"}, {"source": {"id": null, "name": "Gizmoposts24.com"}, "author": "Gaurang Bhandari", "title": "Hubble Space Telescope and how it explore? Check it here!!! - Gizmo Posts 24", "description": "The Hubble Space Telescope is a telescope that was launched into low Earth orbit in 1990 and remains in operation till now. It weighs about 11000 kilograms and travels around Earth at about 5 miles per second. It is regarded as one of the largest and most ver…", "url": "https://gizmoposts24.com/education/hubble-space-telescope-and-how-it-explore-check-it-here-64317/", "urlToImage": "https://gizmoposts24.com/wp-content/uploads/2020/04/images-2.jpeg", "publishedAt": "2020-05-01T21:22:00Z", "content": "The Hubble Space Telescope is a telescope that was launched into low Earth orbit in 1990 and remains in operation till now. It weighs about 11000 kilograms and travels around Earth at about 5 miles per second. It is regarded as one of the largest and most ver… [+1359 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "A Planet, 300 Times of the Earth Mass, Discovered - Somag News", "description": "Astronomers have discovered a planet with 300 Earth masses orbiting the star Kepler-88, located 1,250 light years from our Solar System. The planet also triples Jupiter, the largest planet in our system. Jupiter is the largest and somewhat frightening planet …", "url": "https://www.somagnews.com/planet-300-times-earth-mass-discovered/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2020/05/42-e1588367448283.jpg", "publishedAt": "2020-05-01T21:10:00Z", "content": "Astronomers have discovered a planet with 300 Earth masses orbiting the star Kepler-88, located 1,250 light years from our Solar System. The planet also triples Jupiter, the largest planet in our system.\r\nJupiter is the largest and somewhat frightening planet… [+1441 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Tristan Greene", "title": "Is AI already conscious? - The Next Web", "description": "The ultimate goal of most high-level AI research is the development of a general artificial intelligence (GAI). In essence, what we want is a synthetic mind that could function the same as a human were it placed into a physical vessel of similar capability. M…", "url": "https://thenextweb.com/neural/2020/05/01/is-ai-already-conscious/", "urlToImage": "https://img-cdn.tnwcdn.com/image/neural?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2018%2F03%2Fbraincomputer.jpg&signature=7c84c378b610fb68d903388947e164c2", "publishedAt": "2020-05-01T20:55:14Z", "content": "The ultimate goal of most high-level AI research is the development of a general artificial intelligence (GAI). In essence, what we want is a synthetic mind that could function the same as a human were it placed into a physical vessel of similar capability.\r\n… [+3873 chars]"}, {"source": {"id": null, "name": "Newsherder.com"}, "author": null, "title": "Elon Musk's SpaceX, Jeff Bezos' Blue Origin land contracts to build Nasa's astronaut moon lander - News Herder", "description": "Nasa on Thursday selected space firms SpaceX, Blue Origin and Dynetics to build lunar landing systems that can carry astronauts to the moon by 2024, the White House’s accelerated deadline under the space agency’s moon-to-Mars campaign. The three companies, wh…", "url": "https://newsherder.com/top-stories/2020/05/01/elon-musks-spacex-jeff-bezos-blue-origin-land-contracts-to-build-nasas-astronaut-moon-lander/", "urlToImage": "https://newsherder.com/wp-content/uploads/2020/05/download__4_-647x363.jpeg", "publishedAt": "2020-05-01T20:32:45Z", "content": "Nasa on Thursday selected space firms SpaceX, Blue Origin and Dynetics to build lunar landing systems that can carry astronauts to the moon by 2024, the White House’s accelerated deadline under the space agency’s moon-to-Mars campaign.\r\nThe three companies, w… [+1734 chars]"}, {"source": {"id": null, "name": "Itnewsonline.com"}, "author": null, "title": "PR Newswire - NASA Commits to Future Artemis Missions with More SLS Rocket Engines - IT News Online", "description": "NASA Commits to Future Artemis Missions with More SLS Rocket Engines", "url": "http://www.itnewsonline.com/prnewswire/NASA-Commits-to-Future-Artemis-Missions-with-More-SLS-Rocket-Engines/690003", "urlToImage": null, "publishedAt": "2020-05-01T20:28:49Z", "content": "WASHINGTON, May 1, 2020 /PRNewswire/ --Â NASA has awarded a contract to Aerojet Rocketdyne of Sacramento, California, to manufacture 18 additional Space Launch System (SLS) RS-25 rocket engines to support Artemis missions to the Moon.Â \r\nThe follow-on contrac… [+3802 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "This was the most dangerous place in our planet's history - KUGN", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiU2h0dHBzOi8vd3d3Lmt1Z24uY29tL25ld3MvdGhpcy13YXMtdGhlLW1vc3QtZGFuZ2Vyb3VzLXBsYWNlLWluLW91ci1wbGFuZXRzLWhpc3Rvcnkv0gEA?oc=5", "urlToImage": null, "publishedAt": "2020-05-01T18:50:52Z", "content": null}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Nirmal Narayanan", "title": "Astronomers and space experts are concerned about Elon Musk's Starlink satellites, check out why - International Business Times, India Edition", "description": "Space agencies like NASA believe that there could be more than 170 million pieces of space junks in the earth's orbit.", "url": "https://www.ibtimes.co.in/astronomers-space-experts-are-concerned-about-elon-musks-starlink-satellites-check-out-why-818909", "urlToImage": "https://data1.ibtimes.co.in/en/full/725690/starlink-satellite.jpg", "publishedAt": "2020-05-01T18:46:23Z", "content": "SpaceX Crew Dragon Spacecraft Launches Successfully\r\nIn an attempt to provide high-speed internet in all nooks of the world, Elon Musk's SpaceX has started sending Starlink satellites to the earth's orbit. The company has been launching 60 satellites each mon… [+1907 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Neha", "title": "Astronomers could spot life signs orbiting long-dead stars - The Siasat Daily", "description": "New York: The next generation of powerful Earth- and space-based telescopes will be able to hunt distant solar systems for evidence of life on Earth-like exoplanets -- particularly those that chaperone burned-out stars known as white dwarfs. The chemical prop…", "url": "https://www.siasat.com/astronomers-could-spot-life-signs-orbiting-long-dead-stars-1882711/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/05/Astronomers.jpg", "publishedAt": "2020-05-01T18:35:06Z", "content": "New York: The next generation of powerful Earth- and space-based telescopes will be able to hunt distant solar systems for evidence of life on Earth-like exoplanets — particularly those that chaperone burned-out stars known as white dwarfs.\r\nThe chemical prop… [+2885 chars]"}, {"source": {"id": null, "name": "Tor.com"}, "author": "James Davis Nicoll", "title": "Put a Ring On It: Potential Planetary Ring Systems and Where to Find Them - tor.com", "description": "The mediocrity principle suggests there’s probably nothing special about our Solar System. There are millions of planets in our galaxy; if we were to randomly pick one, it would be likely to be a c…", "url": "https://www.tor.com/2020/05/01/put-a-ring-on-it-potential-planetary-ring-systems-and-where-to-find-them/comment-page-1/#comments", "urlToImage": "https://i2.wp.com/www.tor.com/wp-content/uploads/2020/04/Saturn-rings.jpg?fit=1200%2C+9999&crop=0%2C0%2C100%2C800px&quality=100&ssl=1", "publishedAt": "2020-05-01T18:15:07Z", "content": "The mediocrity principle suggests theres probably nothing special about our Solar System. There are millions of planets in our galaxy; if we were to randomly pick one, it would be likely to be a common sort of planet, from the middle of a normal standard dist… [+5252 chars]"}, {"source": {"id": null, "name": "As.com"}, "author": "AS English", "title": "The biggest asteroid of the year passed safely by Earth - AS South Africa", "description": "An asteroid the size of a house flew by Earth on Wednesday and according to scientists the space rock looked like it was wearing a face mask.", "url": "https://en.as.com/en/2020/05/01/other_sports/1588354847_890977.html", "urlToImage": "https://as01.epimg.net/en/imagenes/2020/05/01/other_sports/1588354847_890977_1588355041_noticia_normal.jpg", "publishedAt": "2020-05-01T17:47:39Z", "content": "According to data from NASAs Center for Near Earth Object Studies (CEOS) the asteroid known as 1998 OR2 is the largest to make a close approach to Earth in the last year. It measured somewhere between 1.1 and 2.5 miles in diameter and rotates once every 4.1 h… [+1608 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "The Missing 99%? Highest Ever Level of Microplastics Found on Seafloor - SciTechDaily", "description": "An international research project has revealed the highest levels of microplastic ever recorded on the seafloor, with up to 1.9 million pieces in a thin layer covering just 1 square meter. Over 10 million tons of plastic waste enters the oceans each year. Flo…", "url": "https://scitechdaily.com/the-missing-99-highest-ever-level-of-microplastics-found-on-seafloor/", "urlToImage": "https://scitechdaily.com/images/Deep-Ocean-Microplastic-Hotspots.jpg", "publishedAt": "2020-05-01T17:40:25Z", "content": "Microplastics are delivered to the ocean through rivers carrying industrial and domestic wastewater, carried down submarine canyons by powerful avalanches of sediment (turbidity currents) and then transported on the seafloor by ‘bottom currents’ and deposited… [+4388 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: Cedars-Sinai Expert Weighs In On Antibody Testing - CBS Los Angeles", "description": "Dr. Rekha Murthy, an infectious disease specialist at Cedars-Sinai Medical Center, spoke to CBS2 Friday about antibody testing.", "url": "https://www.youtube.com/watch?v=w2zAcxsa-YI", "urlToImage": "https://i.ytimg.com/vi/w2zAcxsa-YI/maxresdefault.jpg", "publishedAt": "2020-05-01T16:43:40Z", "content": "Dr. Rekha Murthy, an infectious disease specialist at Cedars-Sinai Medical Center, spoke to CBS2 Friday about antibody testing."}, {"source": {"id": null, "name": "Princeton.edu"}, "author": null, "title": "New Princeton study takes superconductivity to the edge - Princeton University", "description": "The existence of superconducting currents, or supercurrents, along the exterior of a superconductor, has been surprisingly hard to find. Now, researchers at Princeton have discovered these edge supercurrents in a material that is both a superconductor and a t…", "url": "https://www.princeton.edu/news/2020/05/01/new-princeton-study-takes-superconductivity-edge", "urlToImage": "https://www.princeton.edu/sites/default/files/styles/scale_1440/public/images/2020/04/2020_NaiPhuanOng_image4.jpg?itok=WUP8-oMi", "publishedAt": "2020-05-01T16:03:27Z", "content": "A discovery that long eluded physicists has been detected in a laboratory at Princeton. A team of physicists detected superconducting currents the flow of electrons without wasting energy along the exterior edge of a superconducting material. The finding was … [+7964 chars]"}, {"source": {"id": null, "name": "Dailygalaxy.com"}, "author": null, "title": "“Farside Wakeup” –One of Largest Impacts in Solar System Rang the Moon to ‘Life’ - The Daily Galaxy --Great Discoveries Channel", "description": "The researchers believe that an active nearside tectonic system on the moon was actually set in motion billions of years ago with a giant impact on the farside that formed the 1500-mile South Pole Aitken Basin, one of the largest impact craters in the Solar S…", "url": "https://dailygalaxy.com/2020/05/farside-wakeup-one-of-largest-impacts-in-solar-system-rang-the-moon-to-life/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2020/05/600px-LRO_WAC_South_Pole_Mosaic.jpg", "publishedAt": "2020-05-01T15:28:26Z", "content": "The researchers believe that an active nearside tectonic system on the moon was actually set in motion billions of years ago with a giant impact on the farside that formed the 1500-mile South Pole Aitken Basin, one of the largest impact craters in the Solar S… [+4668 chars]"}, {"source": {"id": null, "name": "Sciencemag.org"}, "author": null, "title": "Mouse brains seen in unprecedented 3D detail, thanks to new staining technique - Science Magazine", "description": "Method could lead to new understandings of solid tumors and neurodegenerative diseases", "url": "https://www.sciencemag.org/news/2020/05/mouse-brains-seen-unprecedented-3d-detail-thanks-new-staining-technique", "urlToImage": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/Thy1-YFP%26Chat%26Dat-1280x720.jpg?itok=XWlbgWg-", "publishedAt": "2020-05-01T15:15:00Z", "content": "Scientists imaged a mouse brain with a new staining method that can image up to four molecular targets at once (three targets shown above).\r\nRIKEN/Creative Commons \r\nBy Dennis NormileMay. 1, 2020 , 11:15 AM\r\nScientists studying brains and other organs and can… [+2680 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Diane Lincoln", "title": "Online course trains students in the bizarre world of quantum computing - Livescience.com", "description": "", "url": "https://www.livescience.com/quantum-computing-students-online-course.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/gXDSa9bBsoBn66Wd8k3xkb-1200-80.jpg", "publishedAt": "2020-05-01T15:14:00Z", "content": "When the bizarre world of quantum physics\r\n where a \"cat\" can be both alive and dead, and particles a galaxy apart are connected is merged with computer technology, the result is unprecedented power to anyone who masters this technology first. \r\nThere is an o… [+5340 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Researchers find space station's surface microbial profile resembles skin of its crew members - Phys.org", "description": "A study conducted by a team of national laboratory and NASA researchers has found that the environment of the International Space Station is affected by the microbial composition of the astronauts themselves.", "url": "https://phys.org/news/2020-05-space-station-surface-microbial-profile.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/26-researchersf.jpg", "publishedAt": "2020-05-01T13:13:45Z", "content": "A study conducted by a team of national laboratory and NASA researchers has found that the environment of the International Space Station is affected by the microbial composition of the astronauts themselves.\r\nThe five-year research effort represents the firs… [+5766 chars]"}, {"source": {"id": null, "name": "Hexus.net"}, "author": "Mark Tyson", "title": "Proof of concept wearable is powered by gelatine - Industry - News - HEXUS", "description": "Using human generated heat, gelatine cells could be the answer for wearables, IoT power.", "url": "https://hexus.net/tech/news/industry/142186-proof-concept-wearable-powered-gelatine/", "urlToImage": "https://hexus.net/media/uploaded/2020/5/7aebf83b-5dde-493a-94ae-ec7da723423e.jpg", "publishedAt": "2020-05-01T13:11:00Z", "content": "Scientists at the Southern University of Science and Technology (SUSTech) in Shenzhen, China, collaborating with the Department of Mechanical Engineering at MIT, have developed a proof of concept flexible wearable device which is powered by an unlikely substa… [+1464 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "News story: New study reveals unexpected softness of bilayer graphene - Phys.org", "description": "In the study, published in the journal Physical Review B, the researchers showed that bilayer graphene, consisting of two layers of graphene, was noticeably softer than both two-dimensional (2-D) graphene and three-dimensional (3-D) graphite along the stackin…", "url": "https://phys.org/news/2020-05-news-story-reveals-unexpected-softness.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2016/graphene.jpg", "publishedAt": "2020-05-01T12:47:14Z", "content": "In the study, published in the journal Physical Review B, the researchers showed that bilayer graphene, consisting of two layers of graphene, was noticeably softer than both two-dimensional (2-D) graphene and three-dimensional (3-D) graphite along the stackin… [+3019 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Four-pound solar-powered Mars helicopter gets fitting name - Telangana Today", "description": "Hyderabad: An Alabama high school student named NASA’s first Mars helicopter that will be deployed to the Red Planet later this year. Ingenuity, the name submitted by Vaneera Rupani, was selected for the 4 pound (1.8 kilogram) solar-powered helicopter, NASA s…", "url": "https://telanganatoday.com/four-pound-solar-powered-mars-helicopter-gets-fitting-name", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2020/05/NASA-2-2.jpg", "publishedAt": "2020-05-01T11:40:02Z", "content": "Hyderabad: An Alabama high school student named NASAs first Mars helicopter that will be deployed to the Red Planet later this year.\r\nIngenuity, the name submitted by Vaneera Rupani, was selected for the 4 pound (1.8 kilogram) solar-powered helicopter, NASA s… [+2198 chars]"}, {"source": {"id": null, "name": "Lifesly.com"}, "author": null, "title": "Hubble Space Telescope yields fascinating 1.4 million observations in 30 years - Lifesly.com", "description": "The Hubble Space Telescope, which is now celebrating 30 years of stunning discoveries, has yielded 1.4 million observations and provided data that astronomers around the world have used to write … Read More", "url": "https://lifesly.com/hubble-space-telescope-yields-fascinating-1-4-million-observations-in-30-years/", "urlToImage": "https://lifesly.com/wp-content/uploads/2020/04/1587825805_Hubble-Space-Telescope-yields-fascinating-1.4-million-observations-in-30-years.jpg", "publishedAt": "2020-04-25T14:46:39Z", "content": "The Hubble Space Telescope, which is now celebrating 30 years of stunning discoveries, has yielded 1.4 million observations and provided data that astronomers around the world have used to write more than 17,000 peer-reviewed scientific publications, making i… [+2734 chars]"}, {"source": {"id": null, "name": "Tass.com"}, "author": "TASS", "title": "ISS crew evacuated from Soyuz-MS15 on landing - TASS", "description": "The crew has returned to Earth due to the novel coronavirus pandemic", "url": "https://tass.com/science/1146089", "urlToImage": "https://phototass1.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20200417/1263015.jpg", "publishedAt": "2020-04-17T06:20:00Z", "content": "MOSCOW, April 17. /TASS/. Roscosmos cosmonaut Oleg Skripochka and NASA astronauts Andrew Morgan and Jessica Meir have been evacuated from the Soyuz MS-15 manned spacecraft, which landed earlier in Kazakhstan, 147 km to the southeast of the city of Zhezqazghan… [+657 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": null, "title": "NASA Explore Technology To Build Future Homes Made of Fungi For Moon, Mars - http://www.newsgram.com/", "description": "Instead of habitats made of metal and glass, NASA is exploring technologies that could grow structures out of fungi to become our future homes in the stars.", "url": "https://www.newsgram.com/nasa-build-homes-fungi-moon-mars/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2020/01/NASA-Logo.jpg", "publishedAt": "2020-01-18T10:02:49Z", "content": "Instead of habitats made of metal and glass, NASA is exploring technologies that could grow structures out of fungi to become our future homes in the stars, and perhaps lead to more sustainable ways of living on Earth as well.\r\nCreating a livable home for fut… [+3310 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "SpaceX Attempts 'Big Bang' Military Mission With Massive Rocket - IndustryWeek", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMidmh0dHBzOi8vd3d3LmluZHVzdHJ5d2Vlay5jb20vbGVhZGVyc2hpcC9hcnRpY2xlLzIyMDI3ODAzL3NwYWNleC1hdHRlbXB0cy1iaWctYmFuZy1taWxpdGFyeS1taXNzaW9uLXdpdGgtbWFzc2l2ZS1yb2NrZXTSAQA?oc=5", "urlToImage": null, "publishedAt": "2019-12-17T00:04:58Z", "content": null}, {"source": {"id": null, "name": "Mentalfloss.com"}, "author": null, "title": "NASA Is Canceling Its All-Female Spacewalk Due to Ill-Fitting Spacesuits - Mental Floss", "description": "Astronauts Christina Koch and Anne McClain were set to make history this week. Now, only one of the women will be participating.", "url": "https://www.mentalfloss.com/article/578004/nasa-canceling-all-female-spacewalk", "urlToImage": "https://images2.minutemediacdn.com/image/upload/c_crop,h_3057,w_5439,x_0,y_543/v1553607718/shape/mentalfloss/539787-gettyimages-548979711.jpg?itok=zQoZ58RH", "publishedAt": "2019-09-10T05:08:16Z", "content": "Just because youre not headed to the Moon anytime soon doesnt mean you cant flaunt your passion for space exploration in other ways. To help you, Casio is releasing a NASA-themed G-Shock watch that looks like it was fashioned out of a space suit from the Apol… [+1097 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "NASA releases its latest Global maps of Earth at Night, provides clearest patterns of Human Settlement across the Planet - http://www.newsgram.com/", "description": "NASA has released its latest global maps of Earth at night, providing the \"clearest yet composite\" view of patterns of human settlement across our planet.", "url": "https://www.newsgram.com/nasa-releases-its-latest-global-maps-of-earth-at-night-provides-clearest-patterns-of-human-settlement-across-the-planet/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2016/11/earth.jpg", "publishedAt": "2017-06-13T14:36:47Z", "content": "The US space agency NASA on Thursday announced it has selected Elon Musk-run SpaceX, Jeff Bezos-owned Blue Origin and Dynetics (a Leidos company) to design and develop human landing systems (HLS) for the agency’s Artemis programme, one of which will land the … [+2957 chars]"}]}