{"status": "ok", "totalResults": 57, "articles": [{"source": {"id": null, "name": "Interestingengineering.com"}, "author": "Loukia Papadopoulos", "title": "China's Mars Mission Is Called \"Tianwen 1,\" Meaning \"Quest for Heavenly Truth\" - Interesting Engineering", "description": "CNSA is on track for its first Mars mission.", "url": "https://interestingengineering.com/chinas-new-mars-mission-is-called-tianwen-1-meaning-quest-for-heavenly-truth", "urlToImage": null, "publishedAt": "2020-04-26T09:23:52Z", "content": "On Friday, the China National Space Administration (CNSA) revealed in a statement the name of its new Mars mission. The ambitious mission is set to be named \"Tianwen 1\" after the country's planetary exploration program \"Tianwen,\" which means \"quest for heaven… [+1758 chars]"}, {"source": {"id": null, "name": "Indianweb2.com"}, "author": "Vardaan", "title": "An Asteroid \"Coming Near Earth\" Looks Like It's Wearing A Face Mask - IndianWeb2.com", "description": "", "url": "https://www.indianweb2.com/2020/04/26/an-asteroid-coming-near-earth-looks-like-its-wearing-a-face-mask/", "urlToImage": null, "publishedAt": "2020-04-26T09:21:47Z", "content": "The Arecibo Observatory, a radio telescope in Puerto Rico, is tracking an asteroid which is approaching Earth this week and while it poses no threat, the asteroid somehow appears to know this planet of humans is facing a pandemic.\r\nThe University of Central F… [+1510 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu Net Desk", "title": "Watch | Great Barrier Reef suffers third major bleaching event - The Hindu", "description": "A video on the Great Barrier Reef that suffered its worst mass coral bleaching event in recent years", "url": "https://www.thehindu.com/sci-tech/energy-and-environment/great-barrier-reef-suffers-massive-coral-bleaching/article31436663.ece", "urlToImage": null, "publishedAt": "2020-04-26T08:05:58Z", "content": "The Great Barrier Reef, the worlds largest coral reef ecosystem located in Australia, recently experienced its third major bleaching event in five years.\r\nIt is considered to be the most widespread coral bleaching event on record, owing to the rise in tempera… [+619 chars]"}, {"source": {"id": null, "name": "Scoopwhoop.com"}, "author": "Pradamini Kumari", "title": "In Good News, The Largest Hole In The Ozone Layer Has Apparently Healed Itself - ScoopWhoop", "description": "Scientists have confirmed that the 1 million square kilometre wide hole in the ozone layer over the Arctic has finally healed.", "url": "https://www.scoopwhoop.com/news/scientists-claim-largest-hole-in-the-ozone-layer-healed-itself/", "urlToImage": null, "publishedAt": "2020-04-26T07:26:33Z", "content": "When we say planet Earth is healing, we literally mean it. \r\nAccording to reports, scientists have confirmed that the 1 million square kilometre wide hole in the ozone layer over the Arctic has finally healed. And, apparently the hole over the north pole has … [+2217 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Vishal Mathur", "title": "NASA Engineers Built This COVID Ventilator in 37 Days, And it Has Already Passed a Key Test - 360TopNews", "description": "VITAL has a design that allows flexibility of use, which makes it relevant for temporary hospitals and health facilities that may already be running short of medical equipment.", "url": "https://www.news18.com/news/tech/nasa-engineers-built-this-covid-ventilator-in-37-days-and-it-has-already-passed-a-key-test-2593003.html", "urlToImage": null, "publishedAt": "2020-04-26T05:01:37Z", "content": "As NASA says, they usually build spacecrafts and not medical devices. But as it turns out, when they do decide to make one, they do a rather fine job of it. The National Aeronautics and Space Administration (NASA) has developed a ventilator as the world strug… [+2354 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Sandhya Ramesh", "title": "Rising CO2 emissions could change the way human brains work, study says - ThePrint", "description": "ScientiFix, our weekly feature, offers you a summary of the top global science stories of the week, with links to their sources.", "url": "https://theprint.in/scientifix/rising-co2-emissions-could-change-the-way-human-brains-work-study-says/409011/", "urlToImage": null, "publishedAt": "2020-04-26T04:45:46Z", "content": "Rising CO2 emissions could affect decision-making in humans\r\nResearchers at the University of Colorado at Boulder have suggested that rising carbon dioxide (CO2) levels could eventually alter basic decision-making skills in humans. Due to fossil-fuel producti… [+2300 chars]"}, {"source": {"id": null, "name": "Nasaspaceflight.com"}, "author": null, "title": "Starship SN4 set for cryogenic proof test - NASASpaceflight.com", "description": "Starship SN4 is set for a crucial cryogenic proof test as early as Saturday evening…", "url": "https://www.nasaspaceflight.com/2020/04/starship-sn4-set-for-test/", "urlToImage": null, "publishedAt": "2020-04-26T00:55:27Z", "content": "Starship SN4 is set for a crucial cryogenic proof test as early as Saturday evening at SpaceX’s launch site in Boca Chica, Texas. The cryogenic proof test is one of the first tests necessary to prove the vehicle’s flight-worthiness. If all goes well, SpaceX t… [+5301 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Astronomers have discovered a cosmic system of six exoplanets - The Times Hub", "description": null, "url": "https://thetimeshub.in/astronomers-have-discovered-a-cosmic-system-of-six-exoplanets/10942/", "urlToImage": null, "publishedAt": "2020-04-26T00:07:24Z", "content": "Astronomers from the University of Geneva with colleagues from the Swiss Institute PlanetS during the new observations found a space system, consisting of six exoplanets. Now found a total of 10 similar objects.\r\nScientists observed the star HD 158259, locate… [+833 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": null, "title": "SpaceX already preparing for next crew mission to ISS ahead of May test run - South China Morning Post", "description": "The mission will be the first time astronauts will launch from the United States on any mission since the end of the space shuttle programme in 2011.", "url": "https://www.scmp.com/news/world/united-states-canada/article/3081575/spacex-already-preparing-next-crew-mission-iss", "urlToImage": null, "publishedAt": "2020-04-25T22:13:31Z", "content": "Published: 5:34am, 26 Apr, 2020\r\nUpdated: 5:34am, 26 Apr, 2020"}, {"source": {"id": null, "name": "Voanews.com"}, "author": "VOA Learning English", "title": "Scientists Study Unusual Comet - VOA Learning English", "description": "Amateur astronomer Gennady Borisov was the first person to identify a new comet in August of 2019. Researchers reported on Monday that gas coming off the comet, 2I/Borisov, had high levels of carbon monoxide - far more than comets formed in our solar system.", "url": "https://learningenglish.voanews.com/a/scientists-study-unusual-comet-/5384347.html", "urlToImage": null, "publishedAt": "2020-04-25T21:58:00Z", "content": "Scientists recently reported new details about the second interstellar object ever seen passing through our solar system. It is a comet called 2I/Borisov.\r\nComets are made up of frozen gases, rock and dust that orbit stars. The Reuters news agency likens them… [+3202 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Georgina Torbet", "title": "Starlink beta could begin within 3 months, according to Elon Musk - Yahoo Tech", "description": "It will begin with a private beta, with public beta in six months", "url": "https://finance.yahoo.com/news/starlink-beta-could-begin-within-194759001.html", "urlToImage": null, "publishedAt": "2020-04-25T19:47:00Z", "content": "SpaceX could begin beta testing its Starlink global satellite internet program within a few months, according to CEO Elon Musk.\r\nIn a tweet this week, Musk revealed that the Starlink private beta will begin within approximately three months, with the public b… [+2398 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Scientists Find Our Solar System 'Stealing' Interstellar Asteroids - Somag News", "description": "It was found that 19 interstellar asteroids were swallowed by the Solar System. So scientists will not have to look far to observe asteroids. These asteroids are thought to have been swallowed by the Solar System about 4 billion years ago. An international te…", "url": "https://www.somagnews.com/scientists-find-solar-system-stealing-interstellar-asteroids/", "urlToImage": null, "publishedAt": "2020-04-25T19:03:00Z", "content": "It was found that 19 interstellar asteroids were swallowed by the Solar System. So scientists will not have to look far to observe asteroids. These asteroids are thought to have been swallowed by the Solar System about 4 billion years ago.\r\nAn international t… [+2034 chars]"}, {"source": {"id": null, "name": "Defenceaviationpost.com"}, "author": "DefenceAviationPost", "title": "Mining on the Moon by the US, will Space Militarization follow soon? - - Defence Aviation Post", "description": "Last week, through an executive order by the US President Donald Trump, soon NASA is set to mine moon’s water ice and other natural resources. As early as 2015, the US had approved a law allowing Amer", "url": "https://www.defenceaviationpost.com/2020/04/mining-on-the-moon-by-the-us-will-space-militarization-follow-soon/", "urlToImage": null, "publishedAt": "2020-04-25T18:51:41Z", "content": "Last week, through an executive order by the US President Donald Trump, soon NASA is set to mine moons water ice and other natural resources. As early as 2015, the US had approved a law allowing American companies and citizens to use moon and asteroid resourc… [+1063 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "The Great Space Escape: Scientists Learn How Light Can Flee From Black Hole 'Like Boomerang' - Sputnik International", "description": "The scientists' discovery may potentially help them to learn more about the nature of black holes, such as the rotation speed of these space objects.", "url": "https://sputniknews.com/science/202004251079093023-the-great-space-escape-scientists-learn-how-light-can-flee-from-black-hole-like-a-boomerang/", "urlToImage": null, "publishedAt": "2020-04-25T18:31:30Z", "content": "The scientists' discovery may potentially help them to learn more about the nature of black holes, such as the rotation speed of these space objects.Having examined archived X-ray observation data of a black hole whose mass is about ten times that of the Sun … [+1560 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Neha", "title": "Atmospheric tidal waves maintain Venus’ super-rotation - The Siasat Daily", "description": "Washington D.C.: Images from the Akatsuki spacecraft unveil what keeps Venus's atmosphere rotating much faster than the planet itself. An international research team led by Takeshi Horinouchi of Hokkaido University has revealed that this 'super-rotation' is m…", "url": "https://www.siasat.com/atmospheric-tidal-waves-maintain-venus-super-rotation-1879546/", "urlToImage": null, "publishedAt": "2020-04-25T14:08:23Z", "content": "Washington D.C.: Images from the Akatsuki spacecraft unveil what keeps Venus’s atmosphere rotating much faster than the planet itself.\r\nAn international research team led by Takeshi Horinouchi of Hokkaido University has revealed that this ‘super-rotation’ is … [+3082 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Dutch Tulip Fields Come Into Bloom in Stunning Satellite Images - SciTechDaily", "description": "While the COVID-19 virus pandemic is forcing everybody to stay at home, we bring you these beautiful views from space of the Dutch tulip fields coming into bloom. Captured by the Copernicus Sentinel-2 mission on April 5, April 10, April 15 and April 20, 2020,…", "url": "https://scitechdaily.com/dutch-tulip-fields-come-into-bloom-in-stunning-satellite-images/", "urlToImage": null, "publishedAt": "2020-04-25T14:03:13Z", "content": "While the COVID-19 virus pandemic is forcing everybody to stay at home, we bring you these beautiful views from space of the Dutch tulip fields coming into bloom. Captured by the Copernicus Sentinel-2 mission on April 5, April 10, April 15 and April 20, 2020,… [+1633 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "Scientists discovered ‘the most dangerous place in history’ on Earth - Tech Explorist", "description": "100 million years ago, ferocious predators, including flying reptiles and crocodile-like hunters, made the Sahara the most dangerous place on Earth.", "url": "https://www.techexplorist.com/scientists-discovered-most-dangerous-place-earth/31814/", "urlToImage": null, "publishedAt": "2020-04-25T12:35:00Z", "content": "A new study by the University of Portsmouth has provided a window into Africa’s Age of Dinosaurs. They reviewed almost 100 years of fossil vertebrates from an area of Cretaceous rock formations in south-eastern Morocco, known as the Kem Kem Group.\r\nAt that ti… [+2140 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Cosmic Reef: NASA release an image of a blazing starbirth to mark Hubble's 30th birthday - Firstpost", "description": "Hubble has been placed in space to observe the most distant stars and galaxies, as well as planets in our solar system.", "url": "https://www.firstpost.com/tech/science/cosmic-reef-nasa-release-an-image-of-a-blazing-starbirth-to-mark-hubbles-30th-birthday-8299671.html", "urlToImage": null, "publishedAt": "2020-04-25T10:23:08Z", "content": "FP TrendingApr 25, 2020 16:24:11 IST\r\nThe US space agency has released a new bright picture of a firestorm of starbirth to mark the 30th anniversary of the Hubble Space Telescope. Scientists have called the picture Cosmic Reef, as it resembles a coral reef fl… [+1921 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Carly Cassella", "title": "Controversial Discovery Says Origins of Human Language Existed 25 Million Years Ago - ScienceAlert", "description": "A structure critical to our brain's core language pathway, found only in humans and apes, has now also been identified in monkeys, according to a controversial new study - suggesting the origins of language may have appeared 20 to 25 million years ea", "url": "https://www.sciencealert.com/controversial-discovery-in-monkeys-pushes-the-origin-of-human-language-back-25-million-years", "urlToImage": null, "publishedAt": "2020-04-25T09:31:17Z", "content": "A structure critical to our brain's core language pathway, found only in humans and apes, has now also been identified in monkeys, according to a controversial new study - suggesting the origins of language may have appeared 20 to 25 million years earlier tha… [+4838 chars]"}, {"source": {"id": null, "name": "Theweek.in"}, "author": null, "title": "NASA's Perseverance to throw light on geological evolution of the Red Planet - THE WEEK", "description": "Mars rover will collect samples that will be returned to Earth in a future mission", "url": "https://www.theweek.in/news/sci-tech/2020/04/25/nasa-perseverance-throw-light-geological-evolution-red-planet.html", "urlToImage": null, "publishedAt": "2020-04-25T06:22:59Z", "content": "There has been enormous enthusiasm in the space science community since NASA chose Jezero crater as the landing site for its upcoming Mars 2020 rover mission after a five year search.\r\nNASA's Perseverance rover to Mars, expected to launch in July, will look f… [+2949 chars]"}, {"source": {"id": null, "name": "China.org.cn"}, "author": "", "title": "1st LD Writethru: Roscosmos launches Victory Rocket to ISS: statement - China.org.cn", "description": null, "url": "http://www.china.org.cn/world/Off_the_Wire/2020-04/25/content_75975070.htm", "urlToImage": null, "publishedAt": "2020-04-25T05:43:14Z", "content": "MOSCOW, April 25 (Xinhua) -- Russia's Roscosmos state space corporation on Saturday launched a special Soyuz-2.1a carrier rocket with the Progress MS-14 cargo spacecraft to the International Space Station (ISS), the corporation said in a statement.\r\nThe Soyuz… [+631 chars]"}, {"source": {"id": null, "name": "Interestingengineering.com"}, "author": "Brad  Bergan", "title": "First Known Evidence of Death Caused by Meteorite Impact - Interesting Engineering", "description": "Researchers in Turkey uncovered archived records from 1888 alleging the death of a man from a meteorite.", "url": "https://interestingengineering.com/for-the-first-time-we-have-evidence-of-death-by-meteorite", "urlToImage": null, "publishedAt": "2020-04-25T00:08:42Z", "content": "At last, researchers have discovered credible evidence of someone killed from the fateful fall of a meteorite, reports Science Alert.\r\nRELATED: DIFFERENCE BETWEEN ASTEROIDS AND METEORITES\r\nMeteorite killed a human, Turkish sources say\r\nMultiple documents from… [+3024 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Time Runs Faster On Skyscrapers Than Down There - Researchers - Sputnik International", "description": "The time phenomena can be explained by Einstein's general theory of relativity (GTR), stating that time is dependent on the strength of gravity in the place where it is...", "url": "https://sputniknews.com/science/202004241079086823-time-runs-faster-on-skyscrapers-than-down-there---researchers/", "urlToImage": null, "publishedAt": "2020-04-24T23:05:38Z", "content": null}, {"source": {"id": null, "name": "Thrillist.com"}, "author": "Dustin Nelson", "title": "Venus Will Be the Brightest It’ll Be All Year on April 27 - Thrillist", "description": "It'll be quite bright.", "url": "https://www.thrillist.com/news/nation/venus-bright-tonight-april", "urlToImage": null, "publishedAt": "2020-04-24T22:07:30Z", "content": "Venus is the brightest natural object in our sky after the moon and the sun. If you've looked out the window or enjoyed the spring air after sunset over the last month-plus, you've probably seen it, even if you didn't know you were seeing it. Early in the eve… [+993 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Meghan Bartels", "title": "Black hole keeps snacking on white dwarf locked in its orbit - Space.com", "description": "Black holes can have a little star gas, as a treat.", "url": "https://www.space.com/star-survives-black-hole-approach.html", "urlToImage": null, "publishedAt": "2020-04-24T19:32:00Z", "content": "This black hole's parents never told it not to play with its food.\r\nAn astronomer thinks he's spotted a stellar corpse known as a white dwarf sending out blazes of light, mayday signals from its uncomfortably close orbit of a black hole. And while such a whit… [+3205 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Amanda Kooser", "title": "Scientists pinpoint 'most dangerous place in the history of planet Earth' - CNET", "description": "A paleontologist says time travelers would not survive long in this predator-packed area of Africa 100 million years ago.", "url": "https://www.cnet.com/news/scientists-pinpoint-most-dangerous-place-in-the-history-of-planet-earth/", "urlToImage": null, "publishedAt": "2020-04-24T19:24:42Z", "content": "This artist's illustration shows a massive dinosaur Carcharodontosaurus with a group of crocodile-like Elosuchus predators near a carcass.\r\nArtwork by Davide Bonadonna\r\nOnce you build your time machine, please do not set your destination for 100 million years… [+1631 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coral Restoration | Education Earth - The Weather Channel", "description": "We spoke with the Georgia Aquarium about how coral reefs are being restored.", "url": "https://www.youtube.com/watch?v=2Z7x0fS8IzM", "urlToImage": null, "publishedAt": "2020-04-24T19:15:49Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Results Just In From Randomized Clinical Trial That Evaluated Chloroquine Diphosphate for COVID-19 - SciTechDaily", "description": "This randomized clinical trial evaluated the safety and efficacy of two chloroquine diphosphate dosages in patients with severe coronavirus disease 2019 (COVID-19). Key Points Question How safe and effective are 2 different regimens of chloroquine diphosphate…", "url": "https://scitechdaily.com/results-just-in-from-randomized-clinical-trial-that-evaluated-chloroquine-diphosphate-for-covid-19/", "urlToImage": null, "publishedAt": "2020-04-24T18:43:29Z", "content": "This randomized clinical trial evaluated the safety and efficacy of two chloroquine diphosphate dosages in patients with severe coronavirus disease 2019 (COVID-19).\r\nKey Points\r\nQuestion How safe and effective are 2 different regimens of chloroquine diphospha… [+4775 chars]"}, {"source": {"id": null, "name": "Nanowerk.com"}, "author": null, "title": "Engineers open door to big new library of nanoparticles - Nanowerk", "description": "A new study expands the landscape of nanomaterials - and what we can do with them.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=55007.php", "urlToImage": null, "publishedAt": "2020-04-24T18:29:54Z", "content": null}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Elena Malysheva demonstrated the struggle of man against coronavirus - The Times Hub", "description": null, "url": "https://thetimeshub.in/elena-malysheva-demonstrated-the-struggle-of-man-against-coronavirus/10521/", "urlToImage": null, "publishedAt": "2020-04-24T18:00:00Z", "content": "Master and doctor Elena Malysheva demonstrated the process of the human body to fight the coronavirus. Interesting episode appeared in the program “Live healthy” on the First channel.\r\nAs told Elena Malysheva in the fight against coronavirus infection enters … [+785 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "BCI system gives paralyzed man back his sense of touch with haptic feedback - Ars Technica", "description": "Long-term goal is to develop system that works as well at home as in the laboratory.", "url": "https://arstechnica.com/science/2020/04/bci-system-gives-paralyzed-man-back-his-sense-of-touch-with-haptic-feedback/", "urlToImage": null, "publishedAt": "2020-04-24T17:51:00Z", "content": "Enlarge/ Ian Burkhard suffered a severe spinal cord injury in 2010. Battelle's NeuroLife project is restoring motor function to his right arm with a brain-computer-interface system.\r\n4 with 4 posters participating\r\nIan Burkhart, now 28, had a diving accident … [+7377 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "The Hubble space telescope has captured an amazing event in the Solar system - The Times Hub", "description": null, "url": "https://thetimeshub.in/the-hubble-space-telescope-has-captured-an-amazing-event-in-the-solar-system/10457/", "urlToImage": null, "publishedAt": "2020-04-24T16:07:31Z", "content": "Evgeniy Opanasenko\r\nAstronomers expected the comet to consider the ATLAS with a maximum convergence with the Earth, which would happen at the end of may 2020. However, when approaching us, the comet suddenly started to break up into small pieces. Telescope “H… [+1654 chars]"}, {"source": {"id": null, "name": "Clicklancashire.com"}, "author": null, "title": "Astronomers watch a suspected exoplanet disappear before their very eyes - ClickLancashire", "description": "", "url": "https://clicklancashire.com/2020/04/24/astronomers-watch-a-suspected-exoplanet-disappear-before.html", "urlToImage": null, "publishedAt": "2020-04-24T16:04:57Z", "content": "And \"Hubble\" at the right time in the right place, giving scientists the opportunity to observe how the planet can destroy each other.\r\nIt's an incredible discovery, but astronomers had already believed Dagon - also known as Fomalhaut b - was a real weirdo in… [+2489 chars]"}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "First-ever digital geological map of moon released by US Geological Survey - Down To Earth Magazine", "description": "It will serve as a blue print for future human lunar missions", "url": "https://www.downtoearth.org.in/news/science-technology/first-ever-digital-geological-map-of-moon-released-by-us-geological-survey-70690", "urlToImage": null, "publishedAt": "2020-04-24T15:59:01Z", "content": "The first ever digital, unified, global, geological map of the moon was released virtually by the  United States Geological Survey (USGS), National Aeronautics and Space Administration (Nasa) and the Lunar Planetary Institute on April 22, 2020.\r\nThe map is a … [+2958 chars]"}, {"source": {"id": null, "name": "Azosensors.com"}, "author": null, "title": "Sensor-Embedded Garments can Monitor Breathing and Heart Rate - AZoSensors", "description": "Scientists from the Massachusetts Institute of Technology (MIT) have come up with a new technique to integrate electronic sensors into stretchable fabrics, enabling them to design shirts or other kinds of garments that can potentially be used for tracking man…", "url": "https://www.azosensors.com/news.aspx?newsID=13820", "urlToImage": null, "publishedAt": "2020-04-24T15:22:36Z", "content": "Written by AZoSensorsApr 24 2020\r\nScientists from the Massachusetts Institute of Technology (MIT) have come up with a new technique to integrate electronic sensors into stretchable fabrics, enabling them to design shirts or other kinds of garments that can po… [+5279 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Daniel Garcia-Castellanos", "title": "Tomanowos: The meteorite that survived mega-floods and human folly - Phys.org", "description": "The rock with arguably the most fascinating story on Earth has an ancient name: Tomanowos. It means \"the visitor from heaven\" in the extinct language of Oregon's Clackamas Indian tribe.", "url": "https://phys.org/news/2020-04-tomanowos-meteorite-survived-mega-floods-human.html", "urlToImage": null, "publishedAt": "2020-04-24T14:33:54Z", "content": "The rock with arguably the most fascinating story on Earth has an ancient name: Tomanowos. It means \"the visitor from heaven\" in the extinct language of Oregon's Clackamas Indian tribe.\r\nThe Clackamas revered the Tomanowosalso known as the Willamette meteorit… [+6709 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Viral News Desk", "title": "Trending News Today April 24, 2020: NASA Shares Stunning Night View of Earth Through Fisheye Lens, Beauty of - India.com", "description": "'Our planet still sparkles – just like you do': NASA feeds hope in netizens dealing with COVID-19 gloom by sharing a picture of the earth's night view full of dreamy city lights and starlights", "url": "https://www.india.com/viral/trending-news-today-april-24-2020-nasa-shares-stunning-night-view-of-earth-through-fisheye-lens-beauty-of-the-planet-will-leave-you-mesmerised-4009951/", "urlToImage": null, "publishedAt": "2020-04-24T12:40:33Z", "content": "Dispersing the gloom and distressing news of COVID-19 on our social media feeds, the National Aeronautics and Space Administration recently treated netizens to a night view of the earth and we literally dropped our jaws in awe. Full of dreamy glitters and spa… [+1415 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Prabhjote Gill", "title": "There are 19 interstellar asteroids between Jupiter and Neptune ⁠— and even computers can’t predict where they - Business Insider India", "description": "Oumuamua and Borisov weren’t the first interstellar asteroids to visit our solar system. Scientists have discovered 19 news asteroids hiding in the space between", "url": "https://www.businessinsider.in/science/space/news/there-are-19-interstellar-asteroids-between-jupiter-and-neptune-and-even-computers-cant-predict-where-they-are-headed/articleshow/75350530.cms", "urlToImage": null, "publishedAt": "2020-04-24T11:53:00Z", "content": "Interstellar asteroids — asteroids from outside our solar system — may not be as rare as we once thought they were. An entire population was discovered between Jupiter and Neptune. \r\nThe Centaur family of asteroids roam the space between the two gas giants bu… [+2712 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "James Rodger", "title": "Bodies kept 'in industrial fridges for six days' in Birmingham after dying from coronavirus - Birmingham Live", "description": "He was kept in the fridge due to a \"300 body backlog\" after dying from Covid-19, on date which is widely believed to have been the UK's peak", "url": "https://www.birminghammail.co.uk/news/midlands-news/bodies-kept-in-industrial-fridges-18142998", "urlToImage": null, "publishedAt": "2020-04-24T11:52:15Z", "content": "Nazir Afzal, the former chief prosecutor, has claimed his brother's body was kept in an industrial fridge for days.\r\nMr Afzal said his older brother Umar, aged 71, died in Birmingham on April 8.\r\nHe was kept in the fridge due to a \"300 body backlog\" after dyi… [+1421 chars]"}, {"source": {"id": null, "name": "Theiet.org"}, "author": "E&T editorial staff", "title": "Ocean plastic pollution hotspots detected using satellites - E&T Magazine", "description": "Satellites have been used to detect patches of floating macroplastics in marine environments which could help to aid ocean clean ups.", "url": "https://eandt.theiet.org/content/articles/2020/04/ocean-plastic-pollution-hotspots-detected-using-satellites/", "urlToImage": null, "publishedAt": "2020-04-24T11:39:32Z", "content": "Satellites have been used to detect patches of floating macroplastics in marine environments which could help to aid ocean clean ups.\r\n The approach, which uses data from the European Space Agency Sentinel-2 satellites, is able to distinguish plastics from ot… [+2216 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Rosie McCall", "title": "The World is Losing 9 Percent of Its Insects Every Decade, Study Finds - Newsweek", "description": "The most extensive investigation to date finds global insect numbers drop 0.92 percent a year. However, the world's freshwater insects, like mayflies, are bucking the trend and seeing numbers rise.", "url": "https://www.newsweek.com/world-9-percent-insects-decade-study-1499964", "urlToImage": null, "publishedAt": "2020-04-24T11:21:49Z", "content": "Scientists have warned that global insect populations are facing a rapidly accumulating decline in the most extensive analysis to date.\r\nResearchers sifted through more than 166 long-term surveys carried out across 1,676 sites between 1925 and 2018. The found… [+4498 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Lyrid Meteor Shower 2020 Pictures - India Times", "description": "The Lyrid meteor shower appears annually between April 16 and April 25, and tends to peak around April 22 and April 23 in India.", "url": "https://www.indiatimes.com/trending/environment/lyrid-meteor-shower-2020-pictures-511696.html", "urlToImage": null, "publishedAt": "2020-04-24T10:50:23Z", "content": "One of the most dazzling displays of shooting stars was visible in the night sky recently, and it was possible because of the considerable drop in air pollution during the lockdown, and warm weather. The Lyrid meteor shower appears annually between April 16 a… [+1048 chars]"}, {"source": {"id": null, "name": "Tass.com"}, "author": "TASS", "title": "Soyuz MS-15 with 3 ISS crew members lands in Kazakhstan - TASS", "description": "The crew has returned to Earth due to the novel coronavirus pandemic", "url": "https://tass.com/science/1146081", "urlToImage": null, "publishedAt": "2020-04-17T05:51:51Z", "content": "MOSCOW, April 17. /TASS/. The Soyuz MS-15 manned spacecraft with three International Space Station (ISS) crewmembers on board has landed in Kazakhstan, 147 km to the southeast of the city of Zhezqazghan, Russian state space corporation Roscosmos chief Dmitry … [+748 chars]"}, {"source": {"id": null, "name": "Travelandleisure.com"}, "author": "Cailey Rizzo", "title": "An Asteroid the Size of a House Will Fly by Earth Today - Travel+Leisure", "description": "It poses no threat of danger to the Earth.", "url": "https://www.travelandleisure.com/trip-ideas/space-astronomy/asteroid-2020-gh2-passing-earth", "urlToImage": null, "publishedAt": "2020-04-15T19:24:13Z", "content": "A newly-discovered asteroid is projected to fly safely by Earth on Wednesday.\r\nDiscovered April 11, Asteroid 2020 GH2 is anywhere from 43 to 70 feet wide or about the size of a single-family house, according to Space.com. The asteroid is projected to pass by … [+1478 chars]"}, {"source": {"id": null, "name": "Travelandleisure.com"}, "author": "Alison Fox", "title": "NASA, Former Astronauts Commemorate the 50th Anniversary of Apollo 13 - Travel + Leisure", "description": "On April 13, 1970, the Apollo 13's lunar landing was aborted in what would become a historic mission.", "url": "https://www.travelandleisure.com/travel-news/apollo-13-mission-50th-anniversary", "urlToImage": null, "publishedAt": "2020-04-14T13:47:15Z", "content": "\"Houston, we've had a problem.\"\r\nFifty years after that famed phrase aboard the Apollo 13 was spoken, legends and institutions of space exploration are taking to a different form of communication to commemorate the historic mission — Twitter.\r\n“They were coas… [+3223 chars]"}, {"source": {"id": null, "name": "Inverse.com"}, "author": "Mike Brown", "title": "How SpaceX Starlink works: price, launch date for Elon Musk's internet - Inverse", "description": "Connecting to Starlink will be really easy, Elon Musk says", "url": "https://www.inverse.com/article/62185-here-s-how-you-will-connect-to-starlink-spacex-s-internet-constellation", "urlToImage": null, "publishedAt": "2020-01-08T19:50:11Z", "content": "Starlink, SpaceXs internet connectivity satellite constellation, is taking form. The project is designed to offer higher speeds and lower latency than competing setups, so long as the receiver can see the satellites in orbit. It could help fund some of CEO El… [+4593 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET EnergyWorld", "title": "'Novel CO2 capturing tech may cut vehicle emissions by 90 per cent' - ETEnergyworld.com", "description": "They propose to capture CO2 and convert it from a gas to a liquid in a process that recovers most of energy available onboard, such as heat from the engine", "url": "https://energy.economictimes.indiatimes.com/news/oil-and-gas/novel-co2-capturing-tech-may-cut-vehicle-emissions-by-90pc/72953449", "urlToImage": null, "publishedAt": "2019-12-24T10:10:27Z", "content": "Geneva: Scientists have developed a new technology that could cut carbon dioxide emissions from trucks and buses by almost 90 per cent by capturing CO2 within the exhaust system, converting it into a liquid and storing it on the vehicle. The liquid CO2 would … [+2262 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Boeing Faces Huge Test With the Launch of Starliner - IndustryWeek", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMidWh0dHBzOi8vd3d3LmluZHVzdHJ5d2Vlay5jb20vdGVjaG5vbG9neS1hbmQtaWlvdC9hcnRpY2xlLzIxMTE4ODgxL2JvZWluZy1mYWNlcy1odWdlLXRlc3Qtd2l0aC10aGUtbGF1bmNoLW9mLXN0YXJsaW5lctIBAA?oc=5", "urlToImage": null, "publishedAt": "2019-12-19T14:55:18Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "NASA Picks Nine Companies for $2.6 Billion Moon Payload Program - IndustryWeek", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMif2h0dHBzOi8vd3d3LmluZHVzdHJ5d2Vlay5jb20vdGVjaG5vbG9neS1hbmQtaWlvdC9hcnRpY2xlLzIyMDI2NzU5L25hc2EtcGlja3MtbmluZS1jb21wYW5pZXMtZm9yLTI2LWJpbGxpb24tbW9vbi1wYXlsb2FkLXByb2dyYW3SAQA?oc=5", "urlToImage": null, "publishedAt": "2019-12-16T00:20:53Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Bang! Zoom! Straight to the Moon! ... Eventually - IndustryWeek", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMia2h0dHBzOi8vd3d3LmluZHVzdHJ5d2Vlay5jb20vdGVjaG5vbG9neS1hbmQtaWlvdC9hcnRpY2xlLzIyMDI0NzI3L2Jhbmctem9vbS1zdHJhaWdodC10by10aGUtbW9vbi1ldmVudHVhbGx50gEA?oc=5", "urlToImage": null, "publishedAt": "2019-12-14T16:36:09Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Will the Future Run on Moon Power? India's Space Agency Bets Yes. - IndustryWeek", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMigAFodHRwczovL3d3dy5pbmR1c3RyeXdlZWsuY29tL3RlY2hub2xvZ3ktYW5kLWlpb3QvYXJ0aWNsZS8yMjAyNTg3Mi93aWxsLXRoZS1mdXR1cmUtcnVuLW9uLW1vb24tcG93ZXItaW5kaWFzLXNwYWNlLWFnZW5jeS1iZXRzLXllc9IBAA?oc=5", "urlToImage": null, "publishedAt": "2019-12-13T23:25:34Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Lockheed Wins $4.6 Billion NASA Contract for Orion Spacecraft - IndustryWeek", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMifWh0dHBzOi8vd3d3LmluZHVzdHJ5d2Vlay5jb20vdGVjaG5vbG9neS1hbmQtaWlvdC9hcnRpY2xlLzIyMDI4Mjg2L2xvY2toZWVkLXdpbnMtNDYtYmlsbGlvbi1uYXNhLWNvbnRyYWN0LWZvci1vcmlvbi1zcGFjZWNyYWZ00gEA?oc=5", "urlToImage": null, "publishedAt": "2019-12-13T20:08:22Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET EnergyWorld", "title": "INNOVATION: Purple bacteria may help harvest green fuel from wastewater - ETEnergyworld.com", "description": "The study showed that supplying electric current to purple phototrophic bacteria can recover nearly 100 per cent of carbon from any type of organic waste, while generating hydrogen gas for electricity production", "url": "https://energy.economictimes.indiatimes.com/news/oil-and-gas/innovation-purple-bacteria-may-help-harvest-green-fuel-from-wastewater/66619380", "urlToImage": null, "publishedAt": "2018-11-14T10:14:21Z", "content": "London: A purple bacteria -- which store energy from light -- can help harvest hydrogen fuel from sewage, and recover carbon from any type of organic waste, scientists have found. Organic compounds in household sewage and industrial wastewater are a rich pote… [+2630 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "NASA On The Outlook To Find The Name Of Its New Mars Rover - http://www.newsgram.com/", "description": "NASA is on the look out for a partner to conduct a contest among students to name the agency's next rover to the Mars 2020 mission.", "url": "https://www.newsgram.com/nasa-on-the-outlook-to-find-the-name-of-its-new-mars-rover/", "urlToImage": null, "publishedAt": "2018-09-22T14:20:08Z", "content": "New analysis of data from NASA’s Cassini mission may finally explain why the upper layers in the atmospheres of gas giants — Saturn, Jupiter, Uranus and Neptune — are hot, just like Earth’s.\r\nAs unlike Earth, the Sun is too far from these outer planets to acc… [+2616 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "Moon May Have Harboured Life 4 Billion Years Ago, Research Suggests - http://www.newsgram.com/", "description": "While the Moon is presently unsuitable for habitation, there could have been life on its surface about four billion years ago, researchers have suggested.", "url": "https://www.newsgram.com/moon-may-harboured-life-4-billion-years-ago-research-suggests/", "urlToImage": null, "publishedAt": "2018-07-25T05:09:47Z", "content": "People can keep wearing contact lenses during the coronavirus (COVID-19) pandemic, as long as they observe good hand hygiene and follow appropriate wear-and-care directions, say researchers.\r\nThe study delves into multiple aspects of eye health amidst the glo… [+2551 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "NASA releases its latest Global maps of Earth at Night, provides clearest patterns of Human Settlement across the Planet - http://www.newsgram.com/", "description": "NASA has released its latest global maps of Earth at night, providing the \"clearest yet composite\" view of patterns of human settlement across our planet.", "url": "https://www.newsgram.com/nasa-releases-its-latest-global-maps-of-earth-at-night-provides-clearest-patterns-of-human-settlement-across-the-planet/", "urlToImage": null, "publishedAt": "2017-06-13T14:36:47Z", "content": "BY FRANK F. ISLAM\r\nAs the coronavirus pandemic dominates global news in the United States, progress toward the next presidential election scheduled to be held on November 3 moves slowly forward. President Donald Trump had no real opposition in the Republican … [+6074 chars]"}]}