{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Gizbot"}, "author": "Sharmishte Datti", "title": "SpaceX Spacesuits Gets High Ratings From NASA Astronauts - Gizbot", "description": "Apart from providing spaceships to head to outer space, SpaceX also provides its passengers with spacesuits. NASA astronauts have tried out these SpaceX spacesuits and here is the scorecard.", "url": "https://www.gizbot.com/news/spacex-spacesuits-gets-high-ratings-from-nasa-astronauts-068209.html", "urlToImage": "https://www.gizbot.com/img/2020/06/spacex-spacesuits-gets-high-ratings-from-nasa-astronauts-1591791548.jpg", "publishedAt": "2020-06-11T02:00:00Z", "content": "On May 30, SpaceX and NASA together created one of the iconic moments of 2020, kickstarting the space launch aboard a private space rocket. Apart from providing spaceships to head to outer space, Spa… [+2355 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Jeff Spry", "title": "NASA's STEREO-A observatory crosses paths with a comet, solar wind, and Mercury - SYFY WIRE", "description": "Visionary stargazers like Jules Verne and Georges Méliès could probably not have imagined anything more spectacular than these new images of outer space captured by NASA's intrepid STEREO-A space probe. Featuring a breathtaking array of heavenly activity, the…", "url": "https://www.syfy.com/syfywire/nasa-solar-observatory-stereo-a-observations", "urlToImage": "https://www.syfy.com/sites/syfy/files/styles/1200x680/public/2020/06/stereo-a.jpg", "publishedAt": "2020-06-11T00:26:25Z", "content": "Visionary stargazers like Jules Verne and Georges Méliès could probably not have imagined anything more spectacular than these new images of outer space captured by NASA's intrepid STEREO-A space pro… [+3173 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Holly Secon", "title": "Astronomers Discover Star And Planet Strikingly Similar to The Sun And Earth - ScienceAlert", "description": "Scientists discovered an Earth-like, potentially habitable planet about 3,000 light-years away. Its star is strikingly similar to our sun.", "url": "https://www.businessinsider.com/astronomers-find-earth-like-planet-sun-like-star-2020-6", "urlToImage": "https://i.insider.com/5edeaf1bf34d051ca065d915?width=1200&format=jpeg", "publishedAt": "2020-06-10T23:12:00Z", "content": "Scientists have found a potentially habitable exoplanet and its star that are more similar to the Earth and our sun than any other known planet-star pair.\r\nThe planet — which is still considered a pl… [+3652 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tariq Malik", "title": "Rocket Lab to launch satellites for US spysat agency and NASA tonight. Here's how to watch. - Space.com", "description": "The launch comes after months of delays due to COVID-19.", "url": "https://www.space.com/rocket-lab-us-spy-satellites-launch-june-2020-webcast.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rSTi4XGfgv9HWtH9M9U8uf-1200-80.jpg", "publishedAt": "2020-06-10T21:22:00Z", "content": "The small-satellite launch company Rocket Lab will loft a mini-fleet of payloads for NASA, a U.S. spy satellite agency and universities in the wee hours of the morning this Thursday (June 11) and you… [+3891 chars]"}, {"source": {"id": null, "name": "Eenewseurope.com"}, "author": null, "title": "Satellite servers in the sky aim for global broadband - eeNews Europe", "description": "Starlink has reached the minimum number of satellites to start a broadband service from its 'servers in the sky'. Matt Monson, Director of Starlink Software at SpaceX recently detailed some of the technology.", "url": "https://www.eenewseurope.com/news/satellite-servers-sky-aim-global-broadband", "urlToImage": "https://eenews.cdnartwhere.eu/sites/default/files/styles/facebook/public/sites/default/files/images/2020-06011-starlink.jpg?itok=gE1ZJ5d1", "publishedAt": "2020-06-10T21:18:42Z", "content": "Starlink, the low earth orbit satellite constellation from SpaceX, has hit the minimum configuration to provide broadband. So far 482 satellites have been launched, just above the 400 needed for a mi… [+1747 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "After a century of searching, scientists find new liquid phase - Phys.org", "description": "Researchers at the University of Colorado Boulder's Soft Materials Research Center (SMRC) have discovered an elusive phase of matter, first proposed more than 100 years ago and sought after ever since.", "url": "https://phys.org/news/2020-06-century-scientists-liquid-phase.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/afteracentur.jpg", "publishedAt": "2020-06-10T21:06:35Z", "content": "Researchers at the University of Colorado Boulder's Soft Materials Research Center (SMRC) have discovered an elusive phase of matter, first proposed more than 100 years ago and sought after ever sinc… [+5521 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "Great white sharks' stomach contents reveal surprising meal choices - CNET", "description": "Scientists are disproving the Jaws-style feeding stereotypes of great whites.", "url": "https://www.cnet.com/news/great-white-shark-stomachs-reveal-surprising-diet-secrets/", "urlToImage": "https://cnet3.cbsistatic.com/img/js0HhVLEaAgvcaO7vRiLFEBZJHY=/2020/06/09/75ac81fd-00b6-4239-9a46-2f5a41397273/whiteshark.jpg", "publishedAt": "2020-06-10T20:36:09Z", "content": "University of Sydney doctoral student Richard Grainger catalogs the contents of a white shark's stomach.\r\nUniversity of Sydney\r\nLet's hit pause on the Jaws theme music. Scientists inspected the stoma… [+2386 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Taylor Hatmaker", "title": "Twitter tests a feature that calls you out for RTing without reading the article - TechCrunch", "description": "A new Twitter test feature aiming to “promote informed discussion” will nudge users to read before they retweet. The company describes the test as a step to help people be more aware of what they’re sharing in a broader effort to inspire “healthier conversati…", "url": "http://techcrunch.com/2020/06/10/twitter-retweet-prompt-android/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/03/GettyImages-1055352580.jpg?w=601", "publishedAt": "2020-06-10T20:36:04Z", "content": "A new Twitter test feature aiming to “promote informed discussion” will nudge users to read before they retweet. The company describes the test as a step to help people be more aware of what they’re … [+2009 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Engineers find neat way to turn waste carbon dioxide into useful material - Phys.org", "description": "Chemical engineers from UNSW Sydney have developed new technology that helps convert harmful carbon dioxide emissions into chemical building blocks to make useful industrial products like fuel and plastics.", "url": "https://phys.org/news/2020-06-neat-carbon-dioxide-material.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/5ee13cf8380ef.jpg", "publishedAt": "2020-06-10T20:28:08Z", "content": "Chemical engineers from UNSW Sydney have developed new technology that helps convert harmful carbon dioxide emissions into chemical building blocks to make useful industrial products like fuel and pl… [+5456 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Carly Mallenbaum", "title": "Should you wear a face mask to the gym? A look at the debate - USA TODAY", "description": "The same thing that makes going to a fitness center safer from COVID-19, also makes the exercise experience decidedly worse. Let's talk about masks.", "url": "https://www.usatoday.com/story/life/2020/06/10/face-mask-gym-debate-coronavirus-safety-precaution/3161272001/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/06/04/USAT/80ea1513-7e3e-447e-bd87-34c321b3ea66-ot1.jpg?crop=4031,2268,x0,y604&width=3200&height=1680&fit=bounds", "publishedAt": "2020-06-10T20:19:54Z", "content": "This is how often you should wash your cloth face mask.\r\nUSA TODAY\r\nHeres a conundrum: The same thing that makes going to a fitness center safer from COVID-19, also makes the exercise experience deci… [+7711 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Morgan McFall-Johnsen", "title": "NASA is about to farm out the launch of its first moon rover in 48 years to a commercial rocket company - Business Insider India", "description": "NASA is preparing to land a spacecraft on the moon for the first time in nearly half a century. On Thursday, the agency will announce the rocket company that", "url": "https://www.businessinsider.in/science/news/nasa-is-about-to-farm-out-the-launch-of-its-first-moon-rover-in-48-years-to-a-commercial-rocket-company/articleshow/76311298.cms", "urlToImage": "https://www.businessinsider.in/photo/76311298/nasa-is-about-to-farm-out-the-launch-of-its-first-moon-rover-in-48-years-to-a-commercial-rocket-company.jpg?imgsize=161292", "publishedAt": "2020-06-10T19:51:00Z", "content": "NASA\r\n is about to announce the rocket company that will carry its next rover to the moon — the first such flight since the Apollo program ended in 1972.\r\nIt's the next step in the agency's plan to p… [+4885 chars]"}, {"source": {"id": null, "name": "Filmyone.com"}, "author": "Ajay Rathore", "title": "Strange Radio Bursts in Space Are Repeating a Pattern, What Is Sending Them? - Filmy One", "description": "Mysterious fast radio burst patterns in space have been observed by astronomers for only the second time in history. Now the mission is on to find out what exactly is sending these incredible bursts. Fast radio bursts, aka FRBs, “are millisecond-long bursts o…", "url": "https://filmyone.com/strange-radio-bursts-in-space-are-repeating-a-pattern-what-is-sending-them/", "urlToImage": "https://filmyone.com/wp-content/uploads/2020/06/Strange-Radio-Bursts-in-Space-Are-Repeating-a-Pattern-What.jpg", "publishedAt": "2020-06-10T19:20:03Z", "content": "One of the big appeals of HBO Max, it seemed, ahead of its launch last month was that it would be a hub for DC content. While the streaming service did launch with a selection of DC movies and TV sho… [+2679 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "Small islands may not disappear under rising seas, researchers find - Devdiscourse", "description": "By Michael Taylor KUALA LUMPUR, June 10 (Thomson Reuters Foundation) - In recent years, the leaders and inhabitants of many small-island nations like Kiribati and Tuvalu have warned that climate change is an existential threat to their homelands, fearing they…", "url": "https://www.devdiscourse.com/article/science-environment/1087328-small-islands-may-not-disappear-under-rising-seas-researchers-find", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/16_01_2019_12_17_05_2873657.jpg?width=920&format=jpeg", "publishedAt": "2020-06-10T18:18:12Z", "content": "By Michael Taylor KUALA LUMPUR, June 10 (Thomson Reuters Foundation) - In recent years, the leaders and inhabitants of many small-island nations like Kiribati and Tuvalu have warned that climate chan… [+3289 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Shubham Sharma", "title": "Kathy Sullivan, America's first woman spacewalker, reaches ocean's deepest point - NewsBytes", "description": "America's first woman spacewalker has now become the first-ever woman to reach the deepest known point in our planet's oceans", "url": "https://www.newsbytesapp.com/timeline/world/62039/290802/first-woman-spacewalker-reaches-ocean-s-deepest-point", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l170_5061591784897.jpg", "publishedAt": "2020-06-10T18:00:54Z", "content": "<li>America's first woman spacewalker has now become the first-ever woman to reach the deepest known point in our planet's oceans.\r\nKathy Sullivan, a former astronaut and oceanographer, completed her… [+2809 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "A method has been developed to study the 'traces' of coronal mass ejections at the Sun. - EurekAlert", "description": "Scientists at Skolkovo Institute of Science and Technology (skoltech), together with colleagues from the Karl-Franzens University of Graz and the Kanzelhoehe Observatory (Austria) developed an automatic method for detecting 'coronal dimmings', or 'traces' of …", "url": "https://www.eurekalert.org/pub_releases/2020-06/sios-amh061020.php", "urlToImage": "https://eurekalert.org/multimedia/pub/web/234402_web.jpg", "publishedAt": "2020-06-10T17:55:06Z", "content": "IMAGE: Coronal dimming and the associated coronal mass ejection\r\n view more \r\nCredit: STEREO/EUVI\r\nScientists at Skolkovo Institute of Science and Technology (skoltech), together with colleagues from… [+4245 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Tristan Greene", "title": "Dear NASA, please put a particle collider on the Moon - TNW", "description": "NASA’s current mission, to boldly go where no PR campaign has on behalf of Elon Musk’s SpaceX, is a noble one. Donald Trump wants US boots on Mars. And considering the bipartisan popularity of the idea, whoever ends up president when the smoke clears in Novem…", "url": "https://thenextweb.com/insider/2020/06/10/dear-nasa-please-put-a-particle-collider-on-the-moon/", "urlToImage": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2020%2F06%2Flhc.jpg&signature=9939e9ea2862d343b1ad58bd9926fd27", "publishedAt": "2020-06-10T16:35:06Z", "content": "NASAs current mission, to boldly go where no PR campaign has on behalf of Elon Musks SpaceX, is a noble one. Donald Trump wants US boots on Mars. And considering the bipartisan popularity of the idea… [+3769 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Kate Kelland", "title": "Scientists create embryo-like research model from human stem cells - Yahoo News", "description": "Scientists have used human embryonic stem cells to create an embryo-like research model to help them study some of the earliest stages of human development...", "url": "https://news.yahoo.com/scientists-create-embryo-research-model-150113527.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-06-10T15:01:00Z", "content": "By Kate Kelland\r\nLONDON (Reuters) - Scientists have used human embryonic stem cells to create an embryo-like research model to help them study some of the earliest stages of human development.\r\nThe m… [+2051 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mashable News Staff", "title": "Astronomers Say Titan Is Moving Away From Saturn 100 Times Faster Than Predicted! - Mashable India", "description": "Astronomers have found that Titan’s orbit around Saturn is expanding about 100 times faster than previously expected.", "url": "https://in.mashable.com/science/14666/astronomers-say-titan-is-moving-away-from-saturn-100-times-faster-than-predicted", "urlToImage": "https://sm.mashable.com/mashable_in/seo/default/titan-alongside-saturns-ring-and-enceladus_hk8e.jpg", "publishedAt": "2020-06-10T14:20:00Z", "content": "Astronomers have found that Titans orbit around Saturn is expanding about 100 times faster than previously expected.\r\nTitan is the largest of the 82 moons that orbit Saturn. It has been studied exten… [+1907 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Mars rock layers swirl in gorgeous crater photo - Space.com", "description": "The layered sandstone of Mars' Holden Crater evokes the red-rock country of the American Southwest.", "url": "https://www.space.com/mars-rock-layers-holden-crater-photo.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Qa8QfxCXhS3PMkeBbABs6S-1200-80.jpg", "publishedAt": "2020-06-10T14:00:00Z", "content": "A sliver of Martian geological history takes center stage in a striking photo of a Red Planet crater.\r\nThe image, captured by the High Resolution Imaging Science Experiment (HiRISE) camera aboard NAS… [+1805 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Tower Extension Test a Success for NASA's James Webb Space Telescope - NASA Goddard", "description": "To test the James Webb Space Telescope’s readiness for its journey in space, technicians successfully commanded it to deploy and extend a critical part of th...", "url": "https://www.youtube.com/watch?v=H8mXSgu7KNE", "urlToImage": "https://i.ytimg.com/vi/H8mXSgu7KNE/hqdefault.jpg", "publishedAt": "2020-06-10T13:31:01Z", "content": "To test the James Webb Space Telescopes readiness for its journey in space, technicians successfully commanded it to deploy and extend a critical part of the observatory known as the Deployable Tower… [+3519 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Shannon Hall", "title": "Culprit for Mass Extinction 445 Million Years Ago? Global Warming - The New York Times", "description": "A planet heated by giant volcanic eruptions drove the earliest known wipeout of life on Earth.", "url": "https://www.nytimes.com/2020/06/10/science/global-warming-ordovician-extinction.html", "urlToImage": "https://static01.nyt.com/images/2020/06/10/science/10SCI-EXTINCTION/10SCI-EXTINCTION-facebookJumbo.jpg", "publishedAt": "2020-06-10T13:09:00Z", "content": "These findings allowed the team to paint a new picture one that doesnt discount the glaciation at the time, but suggests that the cooler climate was punctuated by global warming events triggered by v… [+1683 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Surprised When They Examine Stomach Contents of Great White Sharks and Find Out What They Really Eat - SciTechDaily", "description": "Understanding how sharks feed is vital for managing human interactions. The first-ever detailed study of the diets of great white sharks off the east Australian coast reveals this apex predator spends more time feeding close to the seabed than expected. \"With…", "url": "https://scitechdaily.com/scientists-examine-the-stomach-contents-of-great-white-sharks-are-surprised-by-what-they-eat/", "urlToImage": "https://scitechdaily.com/images/Great-White-Shark-Smile.jpg", "publishedAt": "2020-06-10T12:03:07Z", "content": "The first-ever detailed study of the diets of great white sharks off the east Australian coast reveals this apex predator spends more time feeding close to the seabed than expected.\r\nLead author Rich… [+4455 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Heartbeat of supermassive black hole 600 mn light-years away still strong a decade after discovery - Firstpost", "description": "The time between each beat could reveal key information – particularly about the matter near the black hole, and its size.", "url": "https://www.firstpost.com/tech/science/heartbeat-of-supermassive-black-hole-600-mn-light-years-away-still-strong-a-decade-after-discovery-8469511.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/06/A-black-hole-including-the-heartbeat-signal-observed-in-2007-and-2018_Image-Chichuan-Jin_National-Astronomical-Observatories-CAS-NASA-Goddard-1.jpg", "publishedAt": "2020-06-10T11:41:33Z", "content": "FP TrendingJun 10, 2020 17:01:42 IST\r\nAstronomers have confirmed that the heartbeat of a supermassive black hole under study is still going strong after ten years since its discovery.\r\nAs per a BBC r… [+2430 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Twitter Has a Fun Time after Zomato Compares a Crater on Mars with 'Kulhad Lassi' - News18", "description": "Retweeting the post on their handle, Zomato quipped, 'That's kulhad lassi.'", "url": "https://www.news18.com/news/buzz/twitter-has-a-fun-time-after-zomato-compares-a-crater-on-mars-with-kulhad-lassi-2662933.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/06/1591789224_untitled-design-9.jpg", "publishedAt": "2020-06-10T11:40:45Z", "content": "Indians are great foodies and there is no doubt over this fact. Be it trying different cuisine or cooking different recipes at home, we love to stay on top when it is anything related to food. But ca… [+1754 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Confirming Einstein's most fortunate thought - Nanowerk", "description": "Radio astronomers use a dance of three exotic stars to test the universality of free fall.", "url": "https://www.nanowerk.com/news2/space/newsid=55362.php", "urlToImage": "https://www.nanowerk.com/news2/space/id55362.jpg", "publishedAt": "2020-06-10T11:37:47Z", "content": null}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "TWC India Edit Team", "title": "Colourful Corals 'Glow' in Last, Desperate Bid to Survive in Warming Oceans - The Weather Channel", "description": "Coral reefs under warmer ocean temperatures undergo bleaching, thereby displaying a wide array of beautiful colours, which attract the vital microscopic algae used as a defence mechanism for survival.", "url": "https://weather.com/en-IN/india/science/news/2020-06-10-colourful-corals-glow-bid-survive-warming-oceans", "urlToImage": "https://s.w-x.co/in-glowing_corals.jpg", "publishedAt": "2020-06-10T11:34:16Z", "content": "Coral reefs in the Hawaiian Archipelago Papahanaumokuakea\r\n(NOAA)\r\nCoral reefs can be found all across the worlds major oceans, the biggest ones found in the clear, shallow depths of tropics and the … [+4969 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Kriti Mehta", "title": "What is an annular solar eclipse? How it is different from a total eclipse and a partial eclipse - Times Now", "description": "The annular solar eclipse on June 21 will start at 9:15 am IST and end by 3:04 pm IST. Much of Asia, Africa, the Indian Ocean, the Pacific Ocean and parts of Europe and Australia will be able to witness it.", "url": "https://www.timesnownews.com/technology-science/article/what-is-an-annular-solar-eclipse-how-it-is-different-from-a-total-eclipse-and-a-partial-eclipse/604350", "urlToImage": "https://imgk.timesnownews.com/story/solar_eclipse.png?tr=w-560,h-292,fo-top", "publishedAt": "2020-06-10T10:48:16Z", "content": "<ul><li>The annularity, when only a ring of fire is visible, usually ranges from less than a second to over 12 minutes.</li></ul>\r\n<ul><li>The world annular comes from the Latin word annulus which me… [+3233 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Reuters", "title": "Roscosmos Chief Dmitry Rogozin Complains About American Jokes - Gadgets 360", "description": "Americans should show more respect for Russia's space programme after relying on it for nine years as the only way to send US astronauts into orbit, the head of Russia's space agency said.", "url": "https://gadgets.ndtv.com/science/news/roscosmos-chief-dmitry-rogozin-complains-about-american-jokes-2243731", "urlToImage": "https://i.gadgets360cdn.com/large/russia_space_head_us_criticism_spacex_mission_large_1591767755971.jpg", "publishedAt": "2020-06-10T08:39:06Z", "content": "Americans should show more respect for Russia's space programme after relying on it for nine years as the only way to send US astronauts into orbit, the head of Russia's space agency said.\r\nThe Unite… [+1540 chars]"}, {"source": {"id": null, "name": "Chemistry World"}, "author": "Umicore", "title": "Post-silicon age dawns as carbon nanotube transistors made in chip factories - Chemistry World", "description": "Moore's law could hold true for many years to come with a little help from nanotubes", "url": "https://www.chemistryworld.com/news/post-silicon-age-dawns-as-carbon-nanotube-transistors-made-in-chip-factories/4011927.article", "urlToImage": "https://d2cbg94ubxgsnp.cloudfront.net/Pictures/2000x2000fit/4/7/4/505474_photo_lab_119751_crop.jpg", "publishedAt": "2020-06-10T08:30:41Z", "content": "Carbon nanotube (CNT) transistors have been produced in commercial silicon chip facilities by US researchers, marking possibly the first time a post-silicon transistor intended for use in a computer … [+4899 chars]"}, {"source": {"id": null, "name": "Dailyhover.com"}, "author": "Jason Amato", "title": "Explanation to Saturn’s Polar Hexagon - DailyHover", "description": "A few Harvard University researchers have created a computer simulation that can describe the elusive polar hexagon that Saturn has to offer.Rakesh Yadav and Jeremy Bloxham conclude in their article p", "url": "https://dailyhover.com/explanation-to-saturns-polar-hexagon/", "urlToImage": "https://dailyhover.com/wp-content/uploads/2020/06/Explanation-to-Saturns-Polar-Hexagon.jpg", "publishedAt": "2020-06-10T07:30:09Z", "content": "A few Harvard University researchers have created a computer simulation that can describe the elusive polar hexagon that Saturn has to offer.Rakesh Yadav and Jeremy Bloxham conclude in their article … [+1890 chars]"}, {"source": {"id": null, "name": "UNILAD"}, "author": "Emma Rosemurgey", "title": "Elon Musk Is Focusing SpaceX On Missions To The Moon And Mars - UNILAD", "description": "After successfully launching two NASA astronauts into space, Elon Musk has revealed SpaceX will now turn its attention to developing the next-generation spacecraft Starship to help humankind reach Mars. The spacecraft was first unveiled in September of last y…", "url": "https://www.unilad.co.uk/science/elon-musk-is-focusing-spacex-on-missions-to-the-moon-and-mars/", "urlToImage": "https://images.ladbible.com/thumbnail?type=jpeg&url=https://www.unilad.co.uk/wp-content/uploads/2020/06/elon-musk.jpg&quality=70&width=808", "publishedAt": "2020-06-10T07:13:37Z", "content": "After successfully launching two NASA astronauts into space, Elon Musk has revealed SpaceX will now turn its attention to developing the next-generation spacecraft Starship to help humankind reach Ma… [+2277 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Sunlight can crack rocks on asteroid Bennu, reveal OSIRIS-REx images - Zee News", "description": "The images captured by NASA s OSIRIS-REx (Origins Spectral Interpretation Resource Identification Security - Regolith Explorer) spacecraft have discovered that rocks on asteroid Bennu could crack as sunlight heats them up during the day and the rocks cool dow…", "url": "https://zeenews.india.com/science/sunlight-can-crack-rocks-on-asteroid-bennu-reveal-osiris-rex-images-2289079.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2020/06/10/865868-bennu-use.jpg", "publishedAt": "2020-06-10T06:39:15Z", "content": "The images captured by NASA's OSIRIS-REx (Origins Spectral Interpretation Resource Identification Security - Regolith Explorer) spacecraft have discovered that rocks on asteroid Bennu could crack as … [+2274 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Jupiter, Saturn, Moon to form a triangle in the sky: How to watch tonight - The Indian Express", "description": "Back in April this year, we saw a similar wide triangle formed by Saturn, Jupiter, and the Moon.", "url": "https://indianexpress.com/article/technology/science/jupiter-saturn-moon-triangle-watch-6450696/", "urlToImage": "https://images.indianexpress.com/2020/06/planet-pixabay-sergeitokmakov-759.jpg?w=759", "publishedAt": "2020-06-10T04:02:03Z", "content": "By: Tech Desk | New Delhi | \r\nUpdated: June 10, 2020 9:28:15 am\r\nJupiter, Saturn, Moon to form a triangle. (Representational image: Pixabay/Sergeitokmakov)The month of June already saw a lunar eclips… [+1945 chars]"}, {"source": {"id": null, "name": "Astrobiology News"}, "author": null, "title": "Presence Of Airborne Dust Could Signify Increased Habitability Of Distant Planets - Astrobiology News", "description": null, "url": "http://astrobiology.com/2020/06/presence-of-airborne-dust-could-signify-increased-habitability-of-distant-planets.html", "urlToImage": null, "publishedAt": "2020-06-10T03:55:00Z", "content": "Scientists have expanded our understanding of potentially habitable planets orbiting distant stars by including a critical climate component - the presence of airborne dust.\r\nThe researchers suggest … [+4846 chars]"}, {"source": {"id": null, "name": "Astrobiology News"}, "author": null, "title": "Ancient Micrometeoroids Carried Specks Of Stardust And Water To Asteroid 4 Vesta - Astrobiology News", "description": null, "url": "http://astrobiology.com/2020/06/ancient-micrometeoroids-carried-specks-of-stardust-and-water-to-asteroid-4-vesta.html", "urlToImage": null, "publishedAt": "2020-06-10T03:52:00Z", "content": "The formation of our solar system was a messy affair. Most of the material that existed before its formation -- material formed around other, long-dead stars -- was vaporized, then recondensed into n… [+4099 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "'Cosmic snowflakes' captured in stunning Hubble image | Armenian American Reporter - Armenian Reporter", "description": "", "url": "https://www.foxnews.com/science/cosmic-snowflakes-captured-stunning-hubble-image/", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/06/nasa-image.jpg", "publishedAt": "2020-06-09T20:47:00Z", "content": "The European Space Agency referred to the cluster as “cosmic snowflakes” and said it’s believed the stars have 1.6 million times the mass of the sun’s rays, which would make NGC 6441 one of the bigge… [+707 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Hannah Hickey", "title": "Volcanic activity and changes in Earth's mantle were key to rise of atmospheric oxygen - Phys.org", "description": "Oxygen first accumulated in the Earth's atmosphere about 2.4 billion years ago, during the Great Oxidation Event. A long-standing puzzle has been that geologic clues suggest early bacteria were photosynthesizing and pumping out oxygen hundreds of millions of …", "url": "https://phys.org/news/2020-06-volcanic-earth-mantle-key-atmospheric.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/1-volcanicacti.jpg", "publishedAt": "2020-06-09T19:34:25Z", "content": "Oxygen first accumulated in the Earth's atmosphere about 2.4 billion years ago, during the Great Oxidation Event. A long-standing puzzle has been that geologic clues suggest early bacteria were photo… [+4208 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Water vapor in the atmosphere may be prime renewable energy source - Nanowerk", "description": "Electricity generated by interactions between water molecules and metals may be turned into a source of energy.", "url": "https://www.nanowerk.com/news2/green/newsid=55350.php?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=nanowerkemergingtechnologiesnews", "urlToImage": "https://www.nanowerk.com/news2/green/id55350.jpg", "publishedAt": "2020-06-09T16:49:47Z", "content": null}, {"source": {"id": null, "name": "Express"}, "author": "Sean Martin", "title": "Asteroid news: THREE space rocks to shoot past Earth in next 48 HOURS - Express.co.uk", "description": "THREE asteroids are due to zoom past Earth in the coming couple of days, which NASA will be monitoring closely.", "url": "https://www.express.co.uk/news/science/1293564/asteroid-news-earth-nasa-asteroids-2020-ky-space-NEO", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1293564.jpg", "publishedAt": "2020-06-09T16:39:00Z", "content": null}, {"source": {"id": null, "name": "Medium"}, "author": "Bloomberg", "title": "Satellites Are Capturing the Protests, and Just About Everything Else on Earth - Medium", "description": "Satellites Are Capturing the Protests, and Just About Everything Else on Earth. This year has brought immense change, much of it immortalized in high-resolution images from space.", "url": "https://medium.com/bloomberg/satellites-are-capturing-the-protests-and-just-about-everything-else-on-earth-96fd016500dd", "urlToImage": "https://miro.medium.com/max/1200/1*HYAd1aal5Et1A-Qzs6VAtQ.jpeg", "publishedAt": "2020-06-09T15:37:15Z", "content": "By Ashlee Vance\r\nAs protesters gathered in Washington over the weekend, their march across the city was documented by photography satellites"}, {"source": {"id": null, "name": "Inverse"}, "author": "Sarah Wells", "title": "A single drop of sweat can reveal these 7 things about your health - Inverse", "description": "Researchers have designed a paper-based wearable device that can monitor your sweat for 10-days at a time to detect important information about your health.", "url": "https://www.inverse.com/innovation/sweat-analysis-reveals-body-health", "urlToImage": "https://imgix.bustle.com/uploads/shutterstock/2020/6/8/0322ea7d-2dda-4921-bf13-92ea9f121860-shutterstock-1396284686.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "publishedAt": "2020-06-09T15:33:59Z", "content": "Constantly wiping sweat from our brows isn't anyone's idea of a summer highlight. But the warm-weather annoyance and exercise byproduct could offer a goldmine of data about your body. A new device de… [+6857 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Scientists revealed the mystery of the mysterious hexagon on Saturn - The Times Hub", "description": null, "url": "https://thetimeshub.in/scientists-revealed-the-mystery-of-the-mysterious-hexagon-on-saturn/30292/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2020/06/c28a104eeaa96a6d45b660079ee89f1a-461x400.jpg", "publishedAt": "2020-06-09T15:08:39Z", "content": "Scientists in the study managed to uncover the secret of the mysterious hexagon discovered on Saturn. The work was carried out by experts from the United States, representing Harvard University. \r\nFi… [+736 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Yashika Sharma", "title": "Elon Musk not satisfied with ISS; tells SpaceX staff to focus on Starship for Moon & Mars - Republic World - Republic World", "description": "Elon Musk has reportedly sent out an email to his more than 7000 employees to start focusing towards the making of Starship and its launch as the next step.", "url": "https://www.republicworld.com/technology-news/science/elon-musk-asks-spacex-employees-to-focus-on-starship.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/udor4plg5d61pfpn_1591714113.jpeg?tr=f-jpeg", "publishedAt": "2020-06-09T14:51:49Z", "content": "After successfully sending two astronauts at the International Space Station in May, Elon Musk is all set to widen his horizons and achieve even more. As per a news source, the Founder and CEO of Spa… [+2630 chars]"}, {"source": {"id": null, "name": "Nerdist"}, "author": null, "title": "Animated Video Details How NASA Plans to Return to the Moon - Nerdist", "description": "These these new NASA videos narrated by Star Wars' Kelly Marie Tran show us exactly how NASA plans to return to the moon.", "url": "https://nerdist.com/article/nasa-moon-return-animated-video-kelly-marie-tran/", "urlToImage": "https://nerdist.com/wp-content/uploads/2020/06/Capture-1.jpg", "publishedAt": "2020-06-09T14:26:15Z", "content": "One of the pinnacle scientific achievements of humankind was landing on the moon in 1969. After that, we went back to our orbiting satellite a handful more times, but largely abandoned it. The last t… [+1533 chars]"}, {"source": {"id": null, "name": "NewsDio"}, "author": null, "title": "The glass-bottomed roof opens onto the & # 39; horizontal skyscraper & # 39; from China - NewsDio", "description": "(CNN) – It is easy to see why \"The Crystal\" is one of the most anticipated new attractions in China. Designed by Moshe Safdie, the mastermind behind Singapore's impressive Jewel Changi, the 250-meter-high airlift is the tallest of its kind. Nicknamed a horizo…", "url": "https://newsdio.com/the-glass-bottomed-roof-opens-onto-the-39-horizontal-skyscraper-39-from-china/122394/", "urlToImage": "https://newsdio.com/wp-content/uploads/2020/06/200609162036-the-crystal-2-exterior-super-tease.jpg", "publishedAt": "2020-06-09T14:02:00Z", "content": "(CNN) – It is easy to see why \"The Crystal\" is one of the most anticipated new attractions in China.\r\nDesigned by Moshe Safdie, the mastermind behind Singapore's impressive Jewel Changi, the 250-mete… [+3766 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Matt Williams", "title": "At the heart of the Milky Way, stars draw closer, threatening planets in their orbit - Phys.org", "description": "At the center of our galaxy resides the galactic bulge, a densely packed region of stars, dust and gas. Within this massive structure, which spans thousands of light-years, there are an estimated 10 billion stars, most of which are old red giant stars. Becaus…", "url": "https://phys.org/news/2020-06-heart-milky-stars-closer-threatening.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/1-supernova.jpg", "publishedAt": "2020-06-09T13:33:58Z", "content": "At the center of our galaxy resides the galactic bulge, a densely packed region of stars, dust and gas. Within this massive structure, which spans thousands of light-years, there are an estimated 10 … [+6840 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "KC Archana", "title": "Yellowstone Supereruptions: Activity At Hotspot Waning, Chances Of 'Cataclysmic' Explosion Low - India Times", "description": "Researchers have discovered two ancient supereruptions associatedwith the Yellowstone hot spot track. According to Science Alert,the two new-found events have been named the McMullen Creek eruption (occurringabout 8.99 million years ago) and the Grey's Landin…", "url": "https://www.indiatimes.com/trending/environment/yellowstone-supereruptions-activity-at-hotspot-waning-chances-of-cataclysmic-explosion-low-515280.html", "urlToImage": "https://im.indiatimes.in/content/2020/Jun/Yellowstone_5edf7cacb1898.jpg", "publishedAt": "2020-06-09T13:00:59Z", "content": "Researchers have discovered two ancient supereruptions associated\r\nwith the Yellowstone hot spot track.\r\nAccording toScience Alert,\r\nthe two new-found events have been named the McMullen Creek erupti… [+2528 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Brandon Specktor", "title": "Mysterious scars on Hawaiian shark could be sign of giant squid attack - Livescience.com", "description": "", "url": "https://www.livescience.com/shark-giant-squid-fight.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/imdf56TtUoxgDt4cZ4pqqD-1200-80.jpg", "publishedAt": "2020-06-09T12:46:00Z", "content": "A rare, multispecies brawl unfolded recently in the deep ocean off the coast of Hawaii\r\n. In one corner, an oceanic whitetip shark (Carcharhinus longimanus) a 7-foot-long (2.1 meters) predator capabl… [+2846 chars]"}, {"source": {"id": null, "name": "Azooptics.com"}, "author": null, "title": "Glass-Ceramics Used in Greenhouse Lamps Promote Plant Growth - AZoOptics.com", "description": "Researchers have proposed a new concept to produce light sources from ceramics by adding chrome: the light from these lamps provides not only red but also infrared (IR) light, which is anticipated to have a positive impact on the growth of the plants.", "url": "https://www.azooptics.com/News.aspx?newsID=25032", "urlToImage": "https://www.azooptics.com/images/news/ImageForNews_25032_15917042504379284.png", "publishedAt": "2020-06-09T12:06:00Z", "content": "Written by AZoOpticsJun 9 2020\r\nMany individuals would have observed bright pink light in a few windows. This light comes from particular lamps that are utilized to provide sufficient lighting to hou… [+4193 chars]"}, {"source": {"id": null, "name": "The Rahnuma Daily"}, "author": null, "title": "Big leap: SpaceX Crew Dragon docks with space station - The Rahnuma Daily", "description": "Washington, May 31 (IANS) Marking the beginning of a new era in the US space programme, the SpaceX Crew Dragon spacecraft carrying NASA astronauts Robert Behnken and Douglas Hurley successfully docked with the International Space Station (ISS) on Sunday. “Doc…", "url": "https://www.therahnuma.com/big-leap-spacex-crew-dragon-docks-with-space-station/", "urlToImage": "https://www.therahnuma.com/wp-content/uploads/2020/05/8098f5815e289d675bf85988075c1ea4.jpg", "publishedAt": "2020-06-09T11:56:25Z", "content": "NASA astronauts Robert Behnken (right) and Douglas Hurley at NASAâ\u0080\u0099s Kennedy Space Center in Florida on May 23 as they prepare to be transported to Launch Complex 39A during a full dress rehearsal a… [+4239 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Sana Sikander", "title": "Universe is flat, say astronomers at Portsmouth - The Siasat Daily", "description": "Hyderabad: Astronomers at Portsmouth have concluded after observation of millions of galaxies that the Universe is “Flat” and not curved as the standard big bang cosmology had assumed. This paper has been accepted for publication in Physical Review Letters. I…", "url": "https://www.siasat.com/universe-flat-say-astronomers-portsmouth-1900255/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/04/universe-1.jpg", "publishedAt": "2020-06-09T11:56:00Z", "content": "Hyderabad: Astronomers at Portsmouth have concluded after observation of millions of galaxies that the Universe is Flat and not curved as the standard big bang cosmology had assumed. This paper has b… [+973 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "You Can Visit International Space Station From Home With a Little Help from Google - News18", "description": "The modular space station situated in a low earth orbit carries out regular space research and can accommodate up to 6 people comfortably at a time. You can join them.", "url": "https://www.news18.com/news/buzz/you-can-now-visit-international-space-station-from-home-with-a-little-help-from-google-2661203.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/06/1591702158_untitled-design-2020-06-09t165745.336.png", "publishedAt": "2020-06-09T11:43:00Z", "content": "Many of us dream of becoming astronauts and exploring the space in our childhood. While realizing this dream requires an interest in science subjects, high-level space research capability, and unpara… [+1316 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Yashika Sharma", "title": "June Eclipse Season 2020: Earth to witness Annular Solar Eclipse & another Lunar Eclipse - Republic World - Republic World", "description": "June Eclipse Season 2020 will be a great event for all those who are fascinated by various events in the space. Here are details of the upcoming eclipses.", "url": "https://www.republicworld.com/technology-news/science/june-eclipse-season-2020-annular-solar-eclipse-lunar-eclipse.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/uojn21zvizmyvrr5_1591697676.jpeg?tr=f-jpeg", "publishedAt": "2020-06-09T11:01:16Z", "content": "For all the lovers of everything about space and fans of astronomy, there is some great news in the skies. The months of June and July in 2020 have brought forward the Eclipse Season 2020. The follow… [+2703 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Sebastian Kettley", "title": "Asteroid shock: Preacher's bizarre prophecy of 'explosions' and 'deep impact' revealed - Express.co.uk", "description": "ASTEROID APOPHIS, which has been confirmed by astronomers to pose absolutely no threat to Earth, has been bizarrely branded a biblical sign of prophecy by a Christian evangelist.", "url": "https://www.express.co.uk/news/weird/1293410/Asteroid-news-Apophis-prophecy-explosions-impact-Bible-NASA-asteroid", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/80/750x445/1293410.jpg", "publishedAt": "2020-06-09T10:58:00Z", "content": null}, {"source": {"id": null, "name": "Green Car Congress"}, "author": null, "title": "Integrating nanomaterial with light-absorbing molecule powers hydrogen production from water and sunlight - Green Car Congress", "description": "Scientists at Tokyo Institute of Technology (Tokyo Tech) have developed a hybrid material constructed from a metal oxide nanosheet and a light-absorbing molecule for splitting water molecules (H2O) to obtain hydrogen (H2) under sunlight. The research team led…", "url": "https://www.greencarcongress.com/2020/06/20200609-ttech.html", "urlToImage": "https://bioage.typepad.com/.a/6a00d8341c4fbe53ef0264e2e16b3f200d-600wi", "publishedAt": "2020-06-09T10:08:34Z", "content": "Scientists at Tokyo Institute of Technology (Tokyo Tech) have developed a hybrid material constructed from a metal oxide nanosheet and a light-absorbing molecule for splitting water molecules (H2O) t… [+3205 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Aditi Murti", "title": "The Sea Creature that Cleans Carbon From the Ocean - The Swaddle", "description": "The giant Larvacean traps carbon in its mucus feeding apparatus, and then discards the carbon-soaked apparatus into the deep seafloor.", "url": "https://theswaddle.com/scientists-discover-the-filtration-process-of-a-sea-creature-that-cleans-carbon-from-the-ocean/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2020/06/sea-creature-min.jpg", "publishedAt": "2020-06-09T09:51:18Z", "content": "The giant Larvacean (Bathochordaeus) is a 10-centimeter long tadpole-like creature, but the mucus it secretes can fan out around it by up to one meter. For the larvacean, this is a feeding apparatus,… [+2709 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "NASA Perseverance rover ready to explore the wilds of Mars - CNET", "description": "NASA's newest rover will carry a helicopter in its belly when it leaves for Mars in July.", "url": "https://www.cnet.com/pictures/nasa-perseverance-rover-ready-to-explore-the-wilds-of-mars/", "urlToImage": "https://cnet1.cbsistatic.com/img/Ndz_RN81IZOeH1TU3XrGTj30iMI=/756x567/2019/05/22/338db5e4-54e5-43f0-b0c2-9f863f564f1d/mars-2020-rover-nasa.jpg", "publishedAt": "2020-06-09T08:06:12Z", "content": null}, {"source": {"id": null, "name": "Theguardian.comworld"}, "author": "Patrick Wintour", "title": "'It is about our survival': UAE's Mars mission prepares for launch - MSN Money", "description": "Arab world’s first interplanetary mission will see probe orbit planet for a Martian year to study its climate", "url": "https://amp.theguardian.comworld/2020/jun/09/it-is-about-our-survival-uaes-mars-mission-prepares-for-launch", "urlToImage": "https://i.guim.co.uk/img/media/a82f154b4fcde702f8573d822fa054265c0fe270/106_0_1582_950/master/1582.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2a08a539132cfd8d859eb545d5616b26", "publishedAt": "2020-06-09T07:40:00Z", "content": "The Arab worlds first interplanetary mission, due to launch in 40 days time and reach the orbit of Mars in February next year, is about the survival and future of the entire Middle East, the leaders … [+4307 chars]"}, {"source": {"id": null, "name": "Astrobiology News"}, "author": null, "title": "Ancient Asteroid Impacts Created The Ingredients Of Life On Earth And Mars - Astrobiology News", "description": null, "url": "http://astrobiology.com/2020/06/ancient-asteroid-impacts-created-the-ingredients-of-life-on-earth-and-mars.html", "urlToImage": null, "publishedAt": "2020-06-09T05:39:00Z", "content": "A new study reveals that asteroid impact sites in the ocean may possess a crucial link in explaining the formation of the essential molecules for life. \r\nThe study discovered the emergence of amino a… [+2178 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Explained Desk", "title": "Explained: Asteroid that will make a close approach to Earth this month - The Indian Express", "description": "A Near-Earth Object (NEO), the asteroid is called 163348 (2002 NN4) and is classified as a Potentially Hazardous Asteroid (PHA).", "url": "https://indianexpress.com/article/explained/nasa-earth-asteroid-6444103/", "urlToImage": "https://images.indianexpress.com/2020/06/Asteriod-759.jpg?w=759", "publishedAt": "2020-06-08T03:13:31Z", "content": "This asteroid is classified as a PHA, which means the asteroid has the potential to make threatening close approaches to the Earth. (Representational Image)Earlier this week, NASA announced that a gi… [+3395 chars]"}, {"source": {"id": null, "name": "BroBible"}, "author": "Douglas Charles", "title": "Heads Up, There Is An 1,100 Foot Wide Asteroid Heading Our Way And It’s Going To Get Very, Very Close - BroBible", "description": "Mark your calendars. April 13, 2029. That’s the day a…", "url": "https://brobible.com/culture/article/1100-foot-wide-apophis-asteroid-2029/", "urlToImage": "https://brobible.com/wp-content/uploads/2020/05/1100-foot-wide-apophis-asteroid-heading-towards-earth-in-2029.jpg?quality=90&w=650", "publishedAt": "2020-05-07T13:25:26Z", "content": "iStockphoto\r\nMark your calendars. April 13, 2029. That’s the day a monstrous 1,100 foot wide asteroid is going to go zooming by Earth at a rather alarmingly close distance from the planet.\r\nIn fact, … [+3989 chars]"}, {"source": {"id": null, "name": "Gizmo Posts 24"}, "author": "Khushboo Garg", "title": "Alert!!!!NASA’s warning: 3 asteroids currently headed for Earth!! - Gizmo Posts 24", "description": "Focus Points: NASA is keeping an eye on three asteroids that will approach Earth tomorrow. All the three asteroids go along with Earth-crossing orbits. The three approaching asteroids can induce powerful mid-air explosions. NASA’s asteroid tracking system is …", "url": "https://gizmoposts24.com/education/alertnasas-warning-3-asteroids-currently-headed-for-earth-55684/", "urlToImage": "https://gizmoposts24.com/wp-content/uploads/2020/03/asteroidspassingearth.jpg", "publishedAt": "2020-03-18T18:01:03Z", "content": "Focus Points:\r\n<ul><li>NASA is keeping an eye on three asteroids that will approach Earth tomorrow.</li><li>All the three asteroids go along with Earth-crossing orbits.</li><li>The three approaching … [+2052 chars]"}, {"source": {"id": null, "name": "Gizmo Posts 24"}, "author": "Kaustuv Chattopadhyay", "title": "Science News Roundup: ‘Dancing dragon’ shows feathers grew differently on dinosaurs and birds - Gizmo Posts 24", "description": "The features on dinosaurs and birds are made a little differently than each other It has been discovered that in the fossil of a fierce little Chinese dinosaur dubbed, the \"dancing dragon,\" which is supposed to be an older cousin of the Velociraptor, has indi…", "url": "https://gizmoposts24.com/technology/science-news-roundup-dancing-dragon-shows-feathers-grew-differently-on-dinosaurs-and-birds-49847/", "urlToImage": "https://gizmoposts24.com/wp-content/uploads/2020/01/image_8027_2-Wulong-bohaiensis.jpg", "publishedAt": "2020-01-20T14:48:05Z", "content": "The features on dinosaurs and birds are made a little differently than each other\r\nIt has been discovered that in the fossil of a fierce little Chinese dinosaur dubbed, the “dancing dragon,” which is… [+1621 chars]"}, {"source": {"id": null, "name": "Gizmo Posts 24"}, "author": "Tania Ghosh", "title": "Special coating required for 12000 satellites for clearing sky vision! - Gizmo Posts 24", "description": "Special coating required for 12000 satellites for clearing sky vision! Amazon will launch a constellation of 3326 satellites. It will float in the Earth's lower orbit so that high internet speed can be provided throughout the world. Space X plans Space X had …", "url": "https://gizmoposts24.com/education/special-coating-required-for-12000-satellites-for-clearing-sky-vision-47716/", "urlToImage": "https://gizmoposts24.com/wp-content/uploads/2019/12/images-78.jpg", "publishedAt": "2019-12-29T02:44:32Z", "content": "Education\r\nSpecial coating required for 12000 satellites for clearing sky vision!\r\nAmazon will launch a constellation of 3326 satellites. It will float in the Earth’s lower orbit so that high interne… [+2078 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Musk's SpaceX Successfully Lands Rocket Back at California Base - IndustryWeek", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMigAFodHRwczovL3d3dy5pbmR1c3RyeXdlZWsuY29tL3RlY2hub2xvZ3ktYW5kLWlpb3QvYXJ0aWNsZS8yMjAyNjQ3MC9tdXNrcy1zcGFjZXgtc3VjY2Vzc2Z1bGx5LWxhbmRzLXJvY2tldC1iYWNrLWF0LWNhbGlmb3JuaWEtYmFzZdIBAA?oc=5", "urlToImage": null, "publishedAt": "2019-12-18T10:05:10Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "SpaceX Launches 64 Small Satellites Into Earth Orbit - IndustryWeek", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMidmh0dHBzOi8vd3d3LmluZHVzdHJ5d2Vlay5jb20vdGVjaG5vbG9neS1hbmQtaWlvdC9hcnRpY2xlLzIyMDI2Nzc2L3NwYWNleC1sYXVuY2hlcy02NC1zbWFsbC1zYXRlbGxpdGVzLWludG8tZWFydGgtb3JiaXTSAQA?oc=5", "urlToImage": null, "publishedAt": "2019-12-17T10:24:56Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "SpaceX Attempts 'Big Bang' Military Mission With Massive Rocket - IndustryWeek", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMidmh0dHBzOi8vd3d3LmluZHVzdHJ5d2Vlay5jb20vbGVhZGVyc2hpcC9hcnRpY2xlLzIyMDI3ODAzL3NwYWNleC1hdHRlbXB0cy1iaWctYmFuZy1taWxpdGFyeS1taXNzaW9uLXdpdGgtbWFzc2l2ZS1yb2NrZXTSAQA?oc=5", "urlToImage": null, "publishedAt": "2019-12-17T00:04:58Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "China First to Land on Moon's Dark Side - IndustryWeek", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiaGh0dHBzOi8vd3d3LmluZHVzdHJ5d2Vlay5jb20vdGVjaG5vbG9neS1hbmQtaWlvdC9hcnRpY2xlLzIyMDI2OTMzL2NoaW5hLWZpcnN0LXRvLWxhbmQtb24tbW9vbnMtZGFyay1zaWRl0gEA?oc=5", "urlToImage": null, "publishedAt": "2019-12-14T10:46:15Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Will the Future Run on Moon Power? India's Space Agency Bets Yes. - IndustryWeek", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMigAFodHRwczovL3d3dy5pbmR1c3RyeXdlZWsuY29tL3RlY2hub2xvZ3ktYW5kLWlpb3QvYXJ0aWNsZS8yMjAyNTg3Mi93aWxsLXRoZS1mdXR1cmUtcnVuLW9uLW1vb24tcG93ZXItaW5kaWFzLXNwYWNlLWFnZW5jeS1iZXRzLXllc9IBAA?oc=5", "urlToImage": null, "publishedAt": "2019-12-13T23:25:34Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Space.com Staff", "title": "Watch live tonight: Rocket Lab launching satellite rideshare mission @ 12:43 am ET - Space.com", "description": "The launch window opens Thursday (June 11) at 12:43 a.m. EDT (0443 GMT).", "url": "https://www.space.com/17933-nasa-television-webcasts-live-space-tv.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/MqrFAoCdmcbXwyLUisK7hH-1200-80.jpg", "publishedAt": "2017-06-06T20:02:55Z", "content": "Rocket Lab is planning to launch several satellites into orbit early Thursday (June 11) morning for a rideshare mission dubbed \"Don't Stop Me Now.\" \r\nThe private spaceflight company's Electron rocket… [+5053 chars]"}]}