{"status": "ok", "totalResults": 54, "articles": [{"source": {"id": null, "name": "Phys.org"}, "author": "Liam Jackson", "title": "Graphene-reinforced carbon fiber may lead to affordable, stronger car materials - Phys.org", "description": "A new way of creating carbon fibers—which are typically expensive to make—could one day lead to using these lightweight, high-strength materials to improve safety and reduce the cost of producing cars, according to a team of researchers. Using a mix of comput…", "url": "https://phys.org/news/2020-05-graphene-reinforced-carbon-fiber-stronger-car.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/graphenerein.jpg", "publishedAt": "2020-05-18T18:06:30Z", "content": "A new way of creating carbon fiberswhich are typically expensive to makecould one day lead to using these lightweight, high-strength materials to improve safety and reduce the cost of producing cars, according to a team of researchers. Using a mix of computer… [+5100 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Shake, Rattle and Roll: Testing NASA's Mars 2020 Perseverance Rover - NASA Jet Propulsion Laboratory", "description": "NASA's Mars 2020 Perseverance rover lives up to its name by enduring a series of tests to prepare for its journey to the Red Planet. Tests for the mission we...", "url": "https://www.youtube.com/watch?v=_1aJra9Wu_U", "urlToImage": "https://i.ytimg.com/vi/_1aJra9Wu_U/maxresdefault.jpg", "publishedAt": "2020-05-18T17:05:26Z", "content": null}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Rosie McCall", "title": "'Bizarre' Dinosaur That Lived Near the South Pole Discovered in Australia - Newsweek", "description": "Scientists describe the two-inch bone of a 110 million-year-old elaphrosaur found in Victoria, Australia, after it was misidentified as belonging to a pterosaur.", "url": "https://www.newsweek.com/bizarre-dinosaur-south-pole-australia-1504794", "urlToImage": "https://d.newsweek.com/en/full/1591197/illustration-elaphrosaur.jpg", "publishedAt": "2020-05-18T17:03:33Z", "content": "A 110 million-year-old fossilized bone belonging to a \"bizarre\" dinosaur called an elaphrosaur has been discovered at a site in Victoria, Australia, suggesting it lived near the South Pole, say scientists.\r\nPaleontologists writing in Gondwana Research say it … [+3323 chars]"}, {"source": {"id": null, "name": "Thesun.ie"}, "author": "Charlotte Edwards", "title": "SpaceX cancels Starlink launch AGAIN after Elon Musk’s satellite mission is grounded by bad weather - The Irish Sun", "description": "", "url": "http://www.thesun.ie/tech/5442467/spacex-cancels-starlink-launch-again-elon-musk/", "urlToImage": "https://www.thesun.ie/wp-content/uploads/sites/3/2020/05/NINTCHDBPICT000578871608-1-1.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-05-18T16:22:36Z", "content": "SPACEX has cancelled it's next scheduled Starlink satellite launch.\r\nThis original launch was supposed to go ahead on May 17, then tomorrow and now its been stood down until sometime after May 27.\r\nStanding down from the Starlink mission, due to tropical stor… [+4431 chars]"}, {"source": {"id": null, "name": "Universetoday.com"}, "author": "https://www.facebook.com/nancy.atkinson4", "title": "If Rockets were Transparent: Video Shows You How Rockets Use up Their Propellant - Universe Today", "description": "I always remember hearing the comparison of how the Space Shuttle’s main engines would drain an average family swimming pool in under 25 seconds. Or that the Saturn V used the equivalent of 763 elephants of fuel. But just how much fuel does a rocket burn duri…", "url": "https://www.universetoday.com/146106/if-rockets-were-transparent-video-shows-you-how-rockets-use-up-their-propellant/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2016/07/SaturnV_FalconHeavy2.jpg", "publishedAt": "2020-05-18T15:18:00Z", "content": "I always remember hearing the comparison of how the Space Shuttles main engines would drain an average family swimming pool in under 25 seconds. Or that the Saturn V used the equivalent of 763 elephants of fuel. But just how much fuel does a rocket burn durin… [+2342 chars]"}, {"source": {"id": null, "name": "Ironbladeonline.com"}, "author": null, "title": "The coronavirus can soon be detected by sneezing into the phone - Ferrum College : Iron Blade Online", "description": "There is nothing to sneeze at this development. Coronavirus can be quickly detected by sneezing or coughing on a phone that delivers results within 60 seconds using a small sensor. University of Utah engineering professor Masood Tabib-Azar says he is leading …", "url": "http://ironbladeonline.com/2020/05/the-coronavirus-can-soon-be-detected-by-sneezing-into-the-phone/", "urlToImage": "http://ironbladeonline.com/wp-content/uploads/2020/05/The-coronavirus-can-soon-be-detected-by-sneezing-into-the.jpg", "publishedAt": "2020-05-18T14:10:08Z", "content": "There is nothing to sneeze at this development.\r\nCoronavirus can be quickly detected by sneezing or coughing on a phone that delivers results within 60 seconds using a small sensor.\r\nUniversity of Utah engineering professor Masood Tabib-Azar says he is leadin… [+1340 chars]"}, {"source": {"id": null, "name": "Zmescience.com"}, "author": "Tibi Puiu", "title": "Birds in higher latitudes are more adapted to long-distance flight - ZME Science", "description": "Researchers analyzed the wing shapes of more than 10,000 species of birds.", "url": "https://www.zmescience.com/science/birds-in-higher-latitudes-are-more-adapted-to-long-distance-flight/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2020/05/231919_web-1.jpg", "publishedAt": "2020-05-18T13:59:06Z", "content": "Migratory birds like this endangered Whooping Crane have more elongated wings than their sedentary counterparts. Credit: John Noll. \r\nAn international team of researchers underwent one of the most comprehensive analyses of bird wings in an effort to unravel p… [+6524 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Scientists puzzle over massive, never-before-seen star system in the Milky Way - Phys.org", "description": "Earlier this year, an international team of scientists announced the second detection of a gravitational-wave signal from the collision of two neutron stars. The event, called GW190425, is puzzling: The combined mass of the two neutron stars is greater than a…", "url": "https://phys.org/news/2020-05-scientists-puzzle-massive-never-before-seen-star.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/1-scientistspu.jpg", "publishedAt": "2020-05-18T13:56:55Z", "content": "Earlier this year, an international team of scientists announced the second detection of a gravitational-wave signal from the collision of two neutron stars. The event, called GW190425, is puzzling: The combined mass of the two neutron stars is greater than a… [+3208 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "'Groupie' galaxies orbiting Milky Way tell us about dark matter, how galaxy formed - Phys.org", "description": "We live in a big-city galaxy. The Milky Way is so big it has satellite galaxies that orbit it, just as the Moon orbits the Earth. These arrangements tell us a great deal about the secrets of the universe—from how galaxies form to the mysterious nature of dark…", "url": "https://phys.org/news/2020-05-groupie-galaxies-orbiting-milky-dark.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/groupiegalax.jpg", "publishedAt": "2020-05-18T13:35:26Z", "content": "We live in a big-city galaxy. The Milky Way is so big it has satellite galaxies that orbit it, just as the Moon orbits the Earth. These arrangements tell us a great deal about the secrets of the universefrom how galaxies form to the mysterious nature of dark … [+4758 chars]"}, {"source": {"id": null, "name": "Gim-international.com"}, "author": null, "title": "Czech Republic Drought Visible from Space - GIM International", "description": "The prolonged period of dry weather in the Czech Republic has resulted in what experts are calling the &lsquo;worst drought in 500 years.&rsquo; Scien...", "url": "https://www.gim-international.com/content/news/czech-republic-drought-visible-from-space", "urlToImage": "https://www.gim-international.com/cache/7/7/f/9/d/77f9d53e0659d00dafaf434d3747b7adc14acdf5.jpeg", "publishedAt": "2020-05-18T13:01:18Z", "content": "The prolonged period of dry weather in the Czech Republic has resulted in what experts are calling the ‘worst drought in 500 years.’ Scientists are using ESA satellite data to monitor the drought that’s gripped the country.Recent maps, produced by the Dutch c… [+3456 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "'Method to rapidly identify antibodies against coronavirus from convalescent plasma developed' - Deccan Herald", "description": "Researchers have used a single-cell analysis method to identify multiple antibodies from COVID-19 patients that could neutralise the novel coronavirus, an advance which may lead to better therapeutics against the deadly disease. Track live updates on coronavi…", "url": "https://www.deccanherald.com/science-and-environment/method-to-rapidly-identify-antibodies-against-coronavirus-from-convalescent-plasma-developed-839081.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/18/808881-01-02-1589804861.jpg", "publishedAt": "2020-05-18T12:27:41Z", "content": "Researchers have used a single-cell analysis method to identify multiple antibodies from COVID-19 patients that could neutralise the novel coronavirus, an advance which may lead to better therapeutics against the deadly disease.\r\nTrack live updates on coronav… [+2622 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Meghan Bartels", "title": "NASA's Parker Solar Probe starts sun observation marathon - Space.com", "description": "", "url": "https://www.space.com/parker-solar-probe-marathon-sun-observations.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Yuz89DfvLAfoJFXSnNk24Y-1200-80.jpg", "publishedAt": "2020-05-18T12:25:54Z", "content": "NASA's sun-grazing spacecraft is gathering the most data ever on its upcoming skim past our star, with instruments turned on for nearly two months.\r\nParker Solar Probe\r\n launched in August 2018 for a seven-year mission studying the sun\r\n by flying deeper into… [+2617 chars]"}, {"source": {"id": null, "name": "Hortidaily.com"}, "author": null, "title": "Challenges for a sustainable food production system on board of the International Space Station - hortidaily.com", "description": "The possibility of prolonging space missions—and consequently the permanence of humans in space—depends on the possibility of providing them with an adequate supply of fresh foods to meet…", "url": "https://www.hortidaily.com/article/9216851/challenges-for-a-sustainable-food-production-system-on-board-of-the-international-space-station/", "urlToImage": "https://www.hortidaily.com/remote.axd?https://agfstorage.blob.core.windows.net/misc/HD_com/2020/05/14/iss.jpg?preset=OgImage", "publishedAt": "2020-05-18T12:14:45Z", "content": "The possibility of prolonging space missionsand consequently the permanence of humans in spacedepends on the possibility of providing them with an adequate supply of fresh foods to meet their nutritional requirements. This would allow space travelers to mitig… [+1079 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "Do expansive body postures increase self-esteem in children? - Tech Explorist", "description": "Power posing had the strongest effect on the children's self-esteem. A dominant body posture may help children to feel more confident in school.", "url": "https://www.techexplorist.com/do-expansive-body-postures-increase-self-esteem-in-children/32327/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/05/children-posture.jpg", "publishedAt": "2020-05-18T12:05:46Z", "content": "Power posing is a popular but also controversial topic. Still, there has been no research on the possible effects on children.\r\nSomebody poses don’t need further explanation: When a person sits with their arms crossed behind their head, resting their feet cas… [+2635 chars]"}, {"source": {"id": null, "name": "Inverse.com"}, "author": "Mike Brown", "title": "Terraform Mars: Elon Musk responds to claim he needs 10,000 missiles - Inverse", "description": "The SpaceX CEO is not too concerned about reports that the firm would need a huge amount of missiles.", "url": "https://www.inverse.com/innovation/elon-musk-terraform-mars", "urlToImage": "https://imgix.bustle.com/uploads/image/2020/5/18/5e763983-99de-42bf-92e0-fe89f03cf611-99750685-e872-4fc5-90bd-00482162baca-getty-1194820621.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "publishedAt": "2020-05-18T11:48:00Z", "content": "Humanity may need more than 10,000 missiles to nuke Mars and transform the planet into something more hospitable to humans. But Elon Musk, the tech entrepreneur that's spoken before about his wish to terraform Mars, suggested Sunday that the huge stock of wea… [+4114 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Two asteroids to approach Earth on Monday, one of them BIGGER than STATUE OF LIBERTY - RT", "description": "Just in case anyone was getting too comfy, NASA’s Center for Near-Earth Object Studies is warning that two asteroids are heading towards Earth this Monday. Another one is expected to come close to us early on Tuesday.", "url": "https://www.rt.com/news/488935-three-asteroids-headed-towards-earth/", "urlToImage": "https://cdni.rt.com/files/2020.05/article/5ec269e7203027162c290a57.jpg", "publishedAt": "2020-05-18T11:30:57Z", "content": "All three of the near-Earth asteroids are expected to make close approaches at some point  between Monday May 18 and Tuesday May 19, at speeds of between 13,000 and 31,000 miles per hour.\r\nThe first of the week’s incoming asteroids, 2020 JE2, boasts a diamete… [+1236 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mashable News Staff", "title": "ESA’s Laser-Powered Lunar Rover Will Explore ‘Permanently Shadowed’ Craters - Mashable India", "description": "The European Space Agency (ESA) is working towards sending a laser-powered rover to the craters in the polar regions of the Moon that constantly in darkness under the shadows cast by the Sun.", "url": "https://in.mashable.com/science/14083/esas-laser-powered-lunar-rover-will-explore-permanently-shadowed-craters", "urlToImage": "https://sm.mashable.com/mashable_in/seo/default/esa-testing-laser-powered-lunar-rover-in-the-dark-of-night_gke6.jpg", "publishedAt": "2020-05-18T10:54:00Z", "content": "The European Space Agency (ESA) is working towards sending a laser-powered rover to craters in the polar regions of the Moon that are permanently shadowed.\r\nESA explained that the craters near the highest lunar latitudes are constantly in the dark. Relative t… [+2174 chars]"}, {"source": {"id": null, "name": "Sciencefocus.com"}, "author": "Sara Rigby, PA Science", "title": "Re-introduce insects to cities to help urban birds, scientists say - sciencefocus.com", "description": "Most songbirds require an insect-rich diet to successfully raise many and vigorous young, researchers say.", "url": "https://www.sciencefocus.com/news/re-introduce-insects-to-cities-to-help-urban-birds-scientists-say/", "urlToImage": "https://images.immediate.co.uk/production/volatile/sites/4/2020/05/GettyImages-478799181-crop-2c0c40e.jpg?quality=90&crop=4px,118px,931px,401px&resize=960,413", "publishedAt": "2020-05-18T10:18:00Z", "content": "Boosting insect populations in urban areas could help great tits in cities have the same breeding success as their forest-dwelling counterparts, according to research.\r\nScientists have found chicks that were provided with additional high-quality food showed a… [+3487 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Scientists have uncovered the true cause of climate catastrophe - The Times Hub", "description": null, "url": "https://thetimeshub.in/scientists-have-uncovered-the-true-cause-of-climate-catastrophe/20249/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2020/05/b07d834e5221083040c9ac01cd089663.jpg", "publishedAt": "2020-05-18T09:07:51Z", "content": "Scientists of Rutgers University in the US revealed the true cause of modern climate catastrophe. As it turned out, all because of human activity. \r\nAs explained by American climate scientists, in their science article published in Science Advances, global wa… [+1249 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Amir Khollam", "title": "Sun in lockdown period? Here are details about the solar minimum phenomenon - Republic World - Republic World", "description": "'Sun in Lockdown' has been trending on various social media platforms. Read to know what is the solar minimum and if it has any catastrophic results.", "url": "https://www.republicworld.com/technology-news/science/syn-in-lockdown-solar-minimum.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/sm9u3s3cbttssr22_1589778287.jpeg?tr=f-jpeg", "publishedAt": "2020-05-18T08:06:56Z", "content": "Space authorities across the globe have expressed their concerns as the sun is reportedly going in a 'lockdown' period. As per reports, this lockdown period of the sun will mark a dramatic decrease in solar radiation on the surface of the sun. This phenomenon… [+2384 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "CRISPR tool scales up to interrogate a huge line-up of viral suspects - Nature.com", "description": "A diagnostic platform enables rapid detection of nucleic-acid sequences.", "url": "https://www.nature.com/articles/d41586-020-01447-w", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-020-01447-w/d41586-020-01447-w_17986584.png", "publishedAt": "2020-05-18T08:02:23Z", "content": "The current severe effects of the global pandemic of COVID-19 reveals our vulnerability to emerging infectious diseases1,2. It also highlights the need for tools to detect a broad range of disease-causing agents, both known and recently emerged, that could th… [+10003 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "NASA shows how it will launch its giant space telescope in a short video - Mashable", "description": "It's the next generation of space telescope.", "url": "https://mashable.com/video/nasa-james-webb-space-telescope-launch-fold/", "urlToImage": "https://mondrian.mashable.com/2020%252F05%252F17%252F8b%252Fdbd76d54f51042e9bf3539fa4c694b3f.f2cf0.jpg%252F1200x630.jpg?signature=huG_aALdLAvPcbmiofyGBA-xBBA=", "publishedAt": "2020-05-18T07:58:42Z", "content": "With a shield about the length of a tennis court, the colossal James Webb Space Telescope the next generation of space telescope due to launch in 2021 wouldn't fit on any rocket. \r\nSo NASA designed the space telescope to fold up. A 45-second video recently re… [+902 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Along with SpaceX's Starlink, six earth imaging satellites — SkySats — will also be launched - Firstpost", "description": "Planet is part of SpaceX's RIdeshare program and currently has 15 SkySats in orbit, including two prototypes launched in 2013 and 2014.", "url": "https://www.firstpost.com/tech/science/along-with-spacexs-starlink-six-earth-imaging-satellites-skysats-will-also-be-launched-8378621.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/05/KSC_SLC40_s104_20200125T160144Z-1.jpg", "publishedAt": "2020-05-18T07:34:51Z", "content": "FP TrendingMay 18, 2020 12:56:59 IST\r\nUS earth-imaging company Planet Labs has announced the launch of six SkySat satellites, which will help provide more imaging coverage in additional to the 15 other existing SkySat satellites.\r\nAccording to a report in NAS… [+3055 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindustantimes.com | Edited by Anubha Rohatgi", "title": "NASA shares new image of Jupiter captured by Juno spacecraft - Hindustan Times", "description": "In the image of Jupiter processed by citizen scientist Gerald Eichstadt, long, thin streaks can be seen running through the centre of the image from top to bottom. The streaks are layers of haze particles that float above the underlying cloud features, says N…", "url": "https://www.hindustantimes.com/science/nasa-shares-new-image-of-jupiter-captured-by-juno-spacecraft/story-5cXNlZzAMctfoJ4tbxFCcP.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/18/Pictures/_4698f964-98d4-11ea-bab9-2a7e8acfdee5.png", "publishedAt": "2020-05-18T07:15:00Z", "content": "American space agency NASA recently shared an image of Jupiter captured by its Juno spacecraft that has been orbiting the planet since July 2016. \r\nThe image is of the gaseous planet’s northern regions that was taken during the spacecraft’s close approach to … [+1234 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "SpaceX to launch first Starlink satellites with VisorSat to block sun from reflecting off its bright parts - Firstpost", "description": "Elon Musk said that a", "url": "https://www.firstpost.com/tech/science/spacex-to-launch-first-starlink-satellites-with-visorsat-to-block-sun-from-reflecting-off-its-bright-parts-8378471.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/05/spacex-1.jpg", "publishedAt": "2020-05-18T07:01:29Z", "content": "FP TrendingMay 18, 2020 12:24:48 IST\r\nSpaceX is all geared up to launch a batch of 60 satellites from Florida early Tuesday morning. SpaceX had earlier targeted 17 May for the launch of the eighth Starlink mission. However, poor weather conditions forced it t… [+1998 chars]"}, {"source": {"id": null, "name": "Theweek.in"}, "author": null, "title": "Face mask that kills coronavirus being developed - THE WEEK", "description": "Researchers at University of Kentucky working on mask", "url": "https://www.theweek.in/news/health/2020/05/18/Face-mask-that-kills-coronavirus-being-developed.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/health/images/2020/5/7/mother-child-sanitiser-facemask-mask-covid-care-shut.jpg", "publishedAt": "2020-05-18T06:43:06Z", "content": "A team of researchers are working on an anti-viral face mask that could kill coronavirus upon making contact. A team led by Dibakar Bhattacharyya at the University of Kentucky is working on developing a face mask that will 'capture and deactivate' SARS-CoV-2,… [+951 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": "Agence France-Presse", "title": "US Successfully Launches Unmanned Reusable Drone for Space Experiments - Gadgets 360", "description": "The US Air Force on Sunday successfully launched its high-tech drone X-37B, placing the reusable vehicle into orbit for its sixth secretive mission in space.", "url": "https://gadgets.ndtv.com/science/news/us-successfully-launches-unmanned-reusable-drone-for-space-experiments-2230653", "urlToImage": "https://i.gadgets360cdn.com/large/us_space_drone_twitter_esper_dod_large_1589782267651.jpg", "publishedAt": "2020-05-18T06:17:39Z", "content": "The US Air Force on Sunday successfully launched its high-tech drone X-37B, placing the reusable vehicle into orbit for its sixth secretive mission in space. The drone, which resembles a smaller version of the manned space shuttles retired by the US space pro… [+1519 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "An extinct bird just ‘evolved itself’ back into existence - EsquireMe", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiX2h0dHBzOi8vd3d3LmVzcXVpcmVtZS5jb20vY29udGVudC80NjEzMy1hbi1leHRpbmN0LWJpcmQtanVzdC1ldm9sdmVkLWl0c2VsZi1iYWNrLWludG8tZXhpc3RlbmNl0gF9aHR0cHM6Ly9hbXAuZXNxdWlyZW1lLmNvbS9hbXAvYXJ0aWNsZV9saXN0aW5nL2VzcXVpcmVtZS9jb250ZW50LzQ2MTMzLWFuLWV4dGluY3QtYmlyZC1qdXN0LWV2b2x2ZWQtaXRzZWxmLWJhY2staW50by1leGlzdGVuY2U?oc=5", "urlToImage": null, "publishedAt": "2020-05-18T05:53:06Z", "content": null}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Crickets Eavesdrop on Bat Echolocation Calls and Drop From the Sky to Evade Capture - SciTechDaily", "description": "Researchers have uncovered the highly efficient strategy used by a group of crickets to distinguish the calls of predatory bats from the incessant noises of the nocturnal jungle. The findings, led by scientists at the Universities of Bristol and Graz in Austr…", "url": "https://scitechdaily.com/crickets-eavesdrop-on-bat-echolocation-calls-and-drop-from-the-sky-to-evade-capture/", "urlToImage": "https://scitechdaily.com/images/Sword-Tailed-Cricket.jpg", "publishedAt": "2020-05-18T03:52:47Z", "content": "A sword-tailed cricket. Credit: Dr. Marc Holderied, University of Bristol\r\nResearchers have uncovered the highly efficient strategy used by a group of crickets to distinguish the calls of predatory bats from the incessant noises of the nocturnal jungle. The f… [+2597 chars]"}, {"source": {"id": null, "name": "Newsheads.in"}, "author": "Ankit Pal", "title": "NASA releases Artemis Accords for space exploration - NEWS HEADS", "description": "NASA has released a legal framework that needs to be followed by the countries and companies in space and on the moon. The document has been named Artemis Accords and includes the creation of “safety zones” around sites where mining and exploration would take…", "url": "https://www.newsheads.in/science/space/nasa-releases-artemis-accords-for-space-exploration-article-61654", "urlToImage": "https://static.newsheads.in/media/thumbs/2020/05/18/870002277-nasa-space_1200x675.jpg", "publishedAt": "2020-05-18T02:37:01Z", "content": "New Delhi : NASA has released a legal framework that needs to be followed by the countries and companies in space and on the moon. The document has been named Artemis Accords and includes the creation of safety zones around sites where mining and exploration … [+1558 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "China's Chang'e-4 probe survives 500 Earth days on Moon's far side - CGTN", "description": "China's Chang'e-4 probe has survived 500 Earth days on the far side of the moon while conducting a scientific exploration of the virgin territory.", "url": "https://news.cgtn.com/news/2020-05-18/China-s-Chang-e-4-probe-survives-500-Earth-days-on-Moon-s-far-side-QAlC2bR2CY/index.html", "urlToImage": "https://news.cgtn.com/news/2020-05-18/China-s-Chang-e-4-probe-survives-500-Earth-days-on-Moon-s-far-side-QAlC2bR2CY/img/3674f177e5344d30b103b0c52551ecd8/3674f177e5344d30b103b0c52551ecd8-750.jpeg", "publishedAt": "2020-05-18T02:27:39Z", "content": "China's Chang'e-4 probe has survived 500 Earth days on the far side of the moon while conducting a scientific exploration of the virgin territory.\r\nThe lander and rover of the Chang'e-4 probe have resumed work for the 18th lunar day on the far side of the moo… [+2145 chars]"}, {"source": {"id": null, "name": "Syfy.com"}, "author": "Elizabeth Rayne", "title": "Wait. If the moon suddenly vanished 900 years ago, where did it go? - SYFY WIRE", "description": "As the Sun disappeared on the night of May 5, 1110, it didn’t just go dark. It ended up being a blackout because the Moon never emerged. When the Sun goes down, the Moon comes up. At least it usually does. Until science revealed the Earth’s rotation, many anc…", "url": "https://www.syfy.com/syfywire/the-moon-suddenly-vanished-900-years-ago", "urlToImage": "https://www.syfy.com/sites/syfy/files/styles/1200x680/public/2020/05/lunareclipse.jpg", "publishedAt": "2020-05-18T01:10:11Z", "content": "As the Sun disappeared on the night of May 5, 1110, it didnt just go dark. It ended up being a blackout because the Moon never emerged.\r\nWhen the Sun goes down, the Moon comes up. At least it usually does. Until science revealed the Earths rotation, many anci… [+4251 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "CDC says no evidence that virus that causes COVID-19 can be spread to people through pool water - First Coast News", "description": "\"If the pool is properly chlorinated or brominated then there should be no risk for COVID transmission from the pool itself,” Dr. Caro said.", "url": "https://www.youtube.com/watch?v=Enz6-RIop9A", "urlToImage": "https://i.ytimg.com/vi/Enz6-RIop9A/hqdefault.jpg", "publishedAt": "2020-05-17T23:29:29Z", "content": null}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Paula Tudoran", "title": "How to See Comet SWAN From the Northern Hemisphere - Dual Dove", "description": "The long-tailed Comet SWAN was only found in April 2020 but has created an exciting fuss among skywatchers. Spotted by Michael Mattiazzo, the comet, also known as C/2020 F8, flew at close approach …", "url": "https://www.dualdove.com/how-to-see-comet-swan-from-the-northern-hemisphere/10414/", "urlToImage": "https://www.dualdove.com/wp-content/uploads/2020/05/960x0-1.jpg", "publishedAt": "2020-05-17T19:16:28Z", "content": "The long-tailed Comet SWAN was only found in April 2020 but has created an exciting fuss among skywatchers. Spotted by Michael Mattiazzo, the comet, also known as C/2020 F8, flew at close approach by Earth on May 13th but is expected to remain within sights u… [+1774 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": "Tim Korso. Sputnik International", "title": "US Military Launches Secretive Spaceship With On-Board Laboratory Into Orbit - Sputnik International", "description": "Just like the preceding five launches, the Pentagon hasn’t revealed either the spacecraft’s mission or how long it will remain in orbit before returning.", "url": "https://sputniknews.com/us/202005171079334039-us-military-launches-secretive-spaceship-with-on-board-laboratory-into-orbit/", "urlToImage": "https://cdn2.img.sputniknews.com/images/107933/40/1079334059.jpg", "publishedAt": "2020-05-17T18:59:16Z", "content": null}, {"source": {"id": null, "name": "Myamazonecho.com"}, "author": null, "title": "China's first test flight becomes a success – My Amazon Echo - My Amazon Echo", "description": null, "url": "https://myamazonecho.com/news/27/chinas-first-test-flight-becomes-a-success/", "urlToImage": null, "publishedAt": "2020-05-17T18:33:00Z", "content": "For decades, physicists have taken up the molecular compounding of the cosmos and the actual existence of its components. Space telescope may make a significant contribution to this field of study from its advantageous location beyond the upper atmosphere. St… [+2479 chars]"}, {"source": {"id": null, "name": "Syfy.com"}, "author": "Elizabeth Rayne", "title": "Why are stars flashing us? NASA might have just found out what’s behind strange pulsations in the sky - SYFY WIRE", "description": "You’re getting flashed every night, and it isn’t by someone streaking across the neighbor’s lawn because they partied a little too hard. NASA’s TESS planet hunter doesn’t just seek out exoplanets. It also observes stars, some of which it caught flashing in a …", "url": "https://www.syfy.com/syfywire/whats-behind-delat-scuti-star-pulsations", "urlToImage": "https://www.syfy.com/sites/syfy/files/styles/1200x680/public/2020/05/deltascuti.jpg", "publishedAt": "2020-05-17T16:35:21Z", "content": "Youre getting flashed every night, and it isnt by someone streaking across the neighbors lawn because they partied a little too hard.\r\nNASAs TESS planet hunter doesnt just seek out exoplanets. It also observes stars, some of which it caught flashing in a pecu… [+3915 chars]"}, {"source": {"id": null, "name": "Biophotonics.world"}, "author": null, "title": "Controlling cells with light - posted by Biophotonics.World at Biophotonics.World - Biophotonics.World", "description": "Photopharmacology investigates the use of light to switch the effect of drugs on and off. Now, for the first time, scientific teams from Jena, Munich, and New York have succeeded in using this method to control a component of cells that was previously conside…", "url": "https://www.biophotonics.world/magazine/article/1020/controlling-cells-with-light", "urlToImage": "https://www.biophotonics.world/ow_userfiles/plugins/articles/article_icon_5ec0f26c0fdcf.jpg", "publishedAt": "2020-05-17T08:14:59Z", "content": null}, {"source": {"id": null, "name": "Newslanded.com"}, "author": null, "title": "Single-atom transistors may revolutionize Quantum Computing - News Landed", "description": "The embedded phosphorus atoms created the foundation for a series of highly stable single-atom or a cluster of atoms transistors.", "url": "https://newslanded.com/2020/05/17/single-atom-transistors-may-revolutionize-quantum-computing/", "urlToImage": "https://newslanded.b-cdn.net/wp-content/uploads/2020/05/Single-Atom-Transistor-1.jpg", "publishedAt": "2020-05-17T07:07:37Z", "content": "Transistors consisting of single atoms or several-atom clusters may lay the framework for future quantum computing and offer unparalleled memory and processing power.\r\nResearchers at the National Institute of Standards and Technology (NIST) and their colleagu… [+3400 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "Traces of solar system’s oldest molecular fluid found in meteorite - Tech Explorist", "description": "The oldest molecular fluids in the solar system could have supported the rapid formation and evolution of the building blocks of life.", "url": "https://www.techexplorist.com/traces-solar-system-oldest-molecular-fluid-found-meteorite/32311/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/05/aminoacid.jpg", "publishedAt": "2020-05-17T06:29:37Z", "content": "The Tagish Lake meteorite is a unique piece of the asteroid belt. It is a highly brecciated ungrouped carbonaceous (C2) chondrite with minimal terrestrial alteration following retrieval of the main mass within days.\r\nDue to the pristine nature and recovery of… [+2446 chars]"}, {"source": {"id": null, "name": "Mit.edu"}, "author": "Fernanda Ferreira | School of Science", "title": "Melting glaciers cool the Southern Ocean - MIT News", "description": "Research suggests glacial melting might explain the recent decadal cooling and sea ice expansion across Antarctica's Southern Ocean.", "url": "http://news.mit.edu/2020/melting-glaciers-cool-southern-ocean-0517", "urlToImage": "http://news.mit.edu/sites/mit.edu.newsoffice/files/styles/og/public/images/2020/antarctica-from-space.jpg", "publishedAt": "2020-05-17T04:06:05Z", "content": "Tucked away at the very bottom of the globe surrounding Antarctica, the Southern Ocean has never been easy to study. Its challenging conditions have placed it out of reach to all but the most intrepid explorers. For climate modelers, however, the surface wate… [+5256 chars]"}, {"source": {"id": null, "name": "Sentinelassam.com"}, "author": "Sentinel Digital Desk", "title": "Study says Human activities responsible for rising sea levels- Sentinelassam - The Sentinel Assam", "description": "Sea-level rise, which has accelerated in recent decades, threatens to permanently inundate densely...", "url": "https://www.sentinelassam.com/topheadlines/study-says-human-activities-responsible-for-rising-sea-levels-477276", "urlToImage": "https://www.sentinelassam.com/h-upload/2020/05/17/127028-sea6.JPG", "publishedAt": "2020-05-17T02:12:43Z", "content": "NEW YORK: Sea-level rise, which has accelerated in recent decades, threatens to permanently inundate densely populated coastal cities and communities. According to researchers, modern sea-level rise is linked to human activities and not to changes in Earth's … [+2490 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Salad could one day be grown on another planet: study - CGTN", "description": "An experiment which saw salad seeds sent into space has given hope for the future of growing food on another planet, according to a recently-published study.", "url": "https://news.cgtn.com/news/2020-05-17/Salad-could-one-day-be-grown-on-another-planet-study-QyCeQCvKJW/index.html", "urlToImage": "https://news.cgtn.com/news/2020-05-17/Salad-could-one-day-be-grown-on-another-planet-study-QyCeQCvKJW/img/427b0101dcd841d191c3eac95ec53c38/427b0101dcd841d191c3eac95ec53c38-1280.jpeg", "publishedAt": "2020-05-17T01:03:25Z", "content": "An experiment which saw salad seeds sent into space has given hope for the future of growing food on another planet, according to a recently-published study. \r\nThe findings have emerged after two kilograms of seeds spent six months on board the International … [+2184 chars]"}, {"source": {"id": null, "name": "Anewspost.com"}, "author": "Mark Horowitz", "title": "\"Incredibly Rare, One-In-A-Million\" Super Earth Discovered By Scientists - Anonymous News", "description": "Researchers have discovered an incredibly rare “super earth” that could potentially hold the conditions to sustain human life. The planet was discovered by New Zealand astronomers who say that the planet “is one of only a handful that have been discovered wit…", "url": "https://anewspost.com/incredibly-rare-one-in-a-million-super-earth-discovered-by-scientists/", "urlToImage": "https://anewspost.com/wp-content/uploads/2020/05/earth_00011-1000x600.jpg", "publishedAt": "2020-05-16T19:08:54Z", "content": "Researchers have discovered an incredibly rare “super earth” that could potentially hold the conditions to sustain human life. The planet was discovered by New Zealand astronomers who say that the planet “is one of only a handful that have been discovered wit… [+2745 chars]"}, {"source": {"id": null, "name": "Tass.com"}, "author": "TASS", "title": "Elon Musk will need more than 10,000 missiles to nuke Mars — Roscosmos - TASS", "description": "Earlier, Musk proposed an ambitious idea to terraform Mars by bombarding the planet’s poles with a large number of nuclear weapons", "url": "https://tass.com/science/1155417", "urlToImage": "https://phototass3.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20200512/1266233.jpg", "publishedAt": "2020-05-12T13:16:14Z", "content": "MOSCOW, May 12. /TASS/. Billionaire entrepreneur and SpaceX CEO Elon Musk’s plan to bombard the Martian polar caps to terraform the planet through release of carbon dioxide will require launching more than 10,000 nuclear warheads, Russia’s space agency Roscos… [+1023 chars]"}, {"source": {"id": null, "name": "Kxan36news.com"}, "author": null, "title": "Without Russia: the US is preparing the contract on the extraction of minerals on the moon - The KXAN 36 News", "description": null, "url": "http://www.kxan36news.com/without-russia-the-us-is-preparing-the-contract-on-the-extraction-of-minerals-on-the-moon", "urlToImage": null, "publishedAt": "2020-05-06T03:02:37Z", "content": "The US administration is preparing a draft new international agreement on the extraction of minerals on the moon. The agreement called Artemis Accords will attract a number of countries, Russia among them yet.\r\nThe document suggests the creation of “security … [+632 chars]"}, {"source": {"id": null, "name": "Kxan36news.com"}, "author": null, "title": "SpaceX launched a rocket with 60 satellites Starlink - The KXAN 36 News", "description": null, "url": "http://www.kxan36news.com/spacex-launched-a-rocket-with-60-satellites-starlink", "urlToImage": null, "publishedAt": "2020-04-22T21:35:44Z", "content": "Booster Falcon 9 SpaceX the American company with the seventh group of microsatellites Starlink started on Wednesday from the spaceport at Cape Canaveral at 15:30 East coast time USA (22:30 GMT). Stream start is on the website of the company.\r\nThe Starlink ne… [+847 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": null, "title": "NASA Explore Technology To Build Future Homes Made of Fungi For Moon, Mars - http://www.newsgram.com/", "description": "Instead of habitats made of metal and glass, NASA is exploring technologies that could grow structures out of fungi to become our future homes in the stars.", "url": "https://www.newsgram.com/nasa-build-homes-fungi-moon-mars/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2020/01/NASA-Logo.jpg", "publishedAt": "2020-01-18T10:02:49Z", "content": "By Muskan Bhatnagar\r\nHow boring and hard is it to sit back at home during lockdown? No new episodes, no new movies, no delicious restaurant food, no car rides, no parties, no meetups with friends, and no travel plans.\r\nBut do we realize how privileged we are … [+4327 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": null, "title": "Chinese Researchers Spot Monster Black Hole Bigger Than Sun - http://www.newsgram.com/", "description": "A team led by Chinese researchers has spotted a monster black hole with a mass 70 times greater than Sun -- toppling the earlier assumption.", "url": "https://www.newsgram.com/chinese-researcher-black-hole-bigger-sun/", "urlToImage": "https://www.newsgram.com/wp-content/uploads/2019/11/1236px-Black_hole_-_Messier_87.jpg", "publishedAt": "2019-11-30T10:32:44Z", "content": "A team led by Chinese researchers has spotted a monster black hole with a mass 70 times greater than Sun — toppling the earlier assumption that the mass of an individual black hole in our Galaxy is no more than 20 times that of Sun.\r\nOur Milky Way Galaxy is e… [+2263 chars]"}, {"source": {"id": null, "name": "Mentalfloss.com"}, "author": null, "title": "5 Fast Facts About the Spring Equinox - Mental Floss", "description": "The spring equinox occurs on March 19, 2020, at 11:49 p.m. Eastern Time—the earliest it has ever arrived in 124 years. Here's what you should know about it, including if you can balance an egg during the event.", "url": "https://www.mentalfloss.com/article/577353/spring-equinox-facts", "urlToImage": "https://images2.minutemediacdn.com/image/upload/c_crop,h_1194,w_2121,x_0,y_220/v1584620220/shape/mentalfloss/577353-gettyimages-624128826.jpg?itok=7IYjR8dN", "publishedAt": "2019-11-03T15:57:56Z", "content": "The history of marriage is colorful, to say the least. Over the centuries, people have married for various reasons, whether it be the formation of a strategic alliance, economic advantage, or simply because two people (and sometimes more) have fallen in love.… [+6655 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": null, "title": "Archeologists find New Evidence about Extinction of Ice Age Animals - http://www.newsgram.com/", "description": "Archaeologists have found new evidence that an extraterrestrial body crashed to Earth almost 13,000 years ago that caused the Extinction of many animals.", "url": "https://www.newsgram.com/new-evidence-about-extinction-of-ice-age-animals/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2019/10/Ice-Age.jpg", "publishedAt": "2019-10-26T11:08:04Z", "content": "BY VISHAL GULATI\r\nBird photography as a hobby and profession has taken off to a major extent in India. It has led to important discoveries of species not previously known from the country, a globally renowned ornithologist said on Sunday.\r\nIn his latest paper… [+4613 chars]"}, {"source": {"id": null, "name": "Morningpicker.com"}, "author": "Debargha Maiti", "title": "Milky Way core flared up like a lighthouse in the recent past? - Morning Picker", "description": "Our Milky Way galaxy does look quite peaceful most of the time, but recent, but in recent past, it has some other stories behind this. Several scientists from worldwide came jointly and found evidence that few millions of years ago, the center of our home gal…", "url": "https://morningpicker.com/technology/milky-way-core-flared-up-like-a-lighthouse-in-the-recent-past-27684/", "urlToImage": "https://morningpicker.com/wp-content/uploads/2019/10/mil.jpg", "publishedAt": "2019-10-07T15:58:43Z", "content": "Our Milky Way galaxy does look quite peaceful most of the time, but recent, but in recent past, it has some other stories behind this.\r\nSeveral scientists from worldwide came jointly and found evidence that few millions of years ago, the center of our home ga… [+1540 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "Moon May Have Harboured Life 4 Billion Years Ago, Research Suggests - http://www.newsgram.com/", "description": "While the Moon is presently unsuitable for habitation, there could have been life on its surface about four billion years ago, researchers have suggested.", "url": "https://www.newsgram.com/moon-may-harboured-life-4-billion-years-ago-research-suggests/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2018/07/moon-2762111_1920.jpg", "publishedAt": "2018-07-25T05:09:47Z", "content": "A team of German researchers has identified potential cellular targets for treating SARS-CoV-2, the virus that causes COVID-19.\r\nA team of biochemists and virologists at Goethe University and the Frankfurt University Hospital in Germany tested a series of com… [+3232 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "NASA Scientists Reveal New Information on Mars' Formation and Evolution, Claim The Red Planet has a Porous Crust - http://www.newsgram.com/", "description": "Washington, Septemeber 15, 2017 : Mars’s crust is not as dense as previously thought and a lower density likely means that at least part of the Red Planet’s crust is relatively porous, says a new NASA study. The findings, published in the journal Geophysical …", "url": "https://www.newsgram.com/nasa-scientists-mars-formatio-evolution-porous-crust/", "urlToImage": "https://www.newsgram.com/wp-content/uploads/2017/09/Mars.v1.jpg", "publishedAt": "2017-09-15T04:47:21Z", "content": "NASA’s Hubble Space Telescope and the ground-based Gemini Observatory in Hawaii have teamed up with the Juno spacecraft to probe the mightiest storms on the giant planet Jupiter.\r\nThe images, part of a multi-year joint programme, revealed that lightning strik… [+2735 chars]"}]}