{"status": "ok", "totalResults": 55, "articles": [{"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Starlink Satellites seen across Tippecanoe County skies overnight - WLFITV", "description": "That thing in the sky last night? Here is what it was:", "url": "https://www.youtube.com/watch?v=gB2YhSw16vM", "urlToImage": "https://i.ytimg.com/vi/gB2YhSw16vM/hqdefault.jpg", "publishedAt": "2020-04-27T09:46:05Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "We Finally Have the First Credible Evidence of a Meteorite Killing a Human Being - News18", "description": "This, according to researchers, is the first-ever known proof of death by a meteorite strike.", "url": "https://www.news18.com/news/buzz/we-finally-have-the-first-credible-evidence-of-a-meteorite-killing-a-human-being-2594431.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587978712_untitled-design-68.jpg", "publishedAt": "2020-04-27T09:13:49Z", "content": "After intensive research over the years, the experts have finally found the records and evidence of the first known human to be killed a meteor strike. The record has been credited to multiple documents found in the General Directorate of State Archives of th… [+1315 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Scientists Have Officially Declared This the Most Dangerous Place on Earth - News18", "description": "Now a dry land, the place was once home an extensive river system, surrounded with different species of aquatic and terrestrial animals.", "url": "https://www.news18.com/news/buzz/scientists-have-officially-declared-this-the-most-dangerous-place-on-earth-2594331.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587977180_untitled-design-16.png", "publishedAt": "2020-04-27T08:49:44Z", "content": "Humans have been inhabiting on planet Earth for years, yet there are a few questions that have remained unanswered. While we know about the deepest ocean or longest sea, not many of us knew about the most dangerous place in our home plant. The paleontologists… [+1344 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Kunal Gaurav", "title": "Elon Musk announces success of cryogenic proof test of Starship prototype SN4 - Republic World - Republic World", "description": "SN4 has become SpaceX’s first full-scale prototype to pass the cryogenic proof test after the Mk1, SN1, and SN3 full-scale Starship prototype failed at it.", "url": "https://www.republicworld.com/technology-news/science/elon-musk-announces-successful-cryogenic-proof-test-of-starship-sn4.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/h4ugcgnzo2aa9cth_1587974985.jpeg?tr=f-jpeg", "publishedAt": "2020-04-27T08:36:09Z", "content": "Tesla CEO Elon Musk announced that Starship prototype SN4 passed the cryogenic proof test at SpaceX’s launch site in Boca Chica, Texas. The SpaceX founder tweeted a video on April 27 saying it was snowing in Texas and in a subsequent tweet Musk said that SN4,… [+1791 chars]"}, {"source": {"id": null, "name": "Advancedsciencenews.com"}, "author": "Advanced Science News", "title": "Hubble celebrates its 30th anniversary with a tapestry of blazing starbirth - Advanced Science News", "description": "This year marks the 30th anniversary of the Hubble Space Telescope, which has opened a new eye onto the cosmos and has been transformative for our civilization.", "url": "https://www.advancedsciencenews.com/hubble-celebrates-its-30th-anniversary-with-a-tapestry-of-blazing-starbirth/", "urlToImage": "https://www.advancedsciencenews.com/wp-content/uploads/2020/04/230137_web.jpg", "publishedAt": "2020-04-27T08:15:56Z", "content": "Hubble Space Telescope’s iconic images and scientific breakthroughs have redefined our view of the Universe. To commemorate three decades of scientific discoveries, this image is one of the most photogenic examples of the many turbulent stellar nurseries the … [+4727 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Michelle Starr", "title": "Astronomers Have Found a Star That Survived Being Swallowed by a Black Hole - ScienceAlert", "description": "When black holes swallow down massive amounts of matter from the space around them, they're not exactly subtle about it. They belch out tremendous flares of X-rays, generated by the material heating to intense temperatures as it's sucked towards the", "url": "https://www.sciencealert.com/this-black-hole-s-weirdly-regular-feeding-schedule-is-because-it-s-snacking-on-a-star", "urlToImage": "https://www.sciencealert.com/images/2020-04/black-hole-monch_1024.gif", "publishedAt": "2020-04-27T07:23:59Z", "content": "When black holes swallow down massive amounts of matter from the space around them, they're not exactly subtle about it. They belch out tremendous flares of X-rays, generated by the material heating to intense temperatures as it's sucked towards the black hol… [+4329 chars]"}, {"source": {"id": null, "name": "Wordlift.io"}, "author": "News Desk", "title": "COVID-19: NASA urges space fans not to travel to Florida to watch SpaceX's astronaut launch - Geospatial World", "description": "During an hour-long video conference on the US space agency’s response to COVID-19, NASA administrator Jim Bridenstine spoke about the Crew Dragon Demo-2 launch", "url": "http://data.wordlift.io/wl01287/post/covid-19__nasa_urges_space_fans_not_to_travel_to_florida_to_watch_spacexs_astronaut_launch", "urlToImage": "https://www.geospatialworld.net/wp-content/uploads/2020/04/nasa-7.jpg", "publishedAt": "2020-04-27T06:03:00Z", "content": "Photo:nasa.gov\r\nAs the fight against COVID-19 continues across the globe, NASA has urged space enthusiasts to remain at home during the launch of next month.\r\nDuring an hour-long video conference on the US space agencys response to COVID-19, NASA administrato… [+490 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Earth's Continents Have Been Shifting for Over 3 Billion Years, Research Shows - News18", "description": "The researchers believe this shift is the earliest proof that modern-like plate motion happened between two to four billion years ago.", "url": "https://www.news18.com/news/buzz/earths-continents-have-been-shifting-for-over-3-billion-years-research-shows-2594035.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/01/Earth-photo.png", "publishedAt": "2020-04-27T05:54:16Z", "content": "The Earth's tectonic plates started moving more than 3.2 billion years ago - just over 1.3 billion years after the Earth first formed and earlier than originally thought, researchers have revealed.\r\nTo date, some researchers theorised it happened around four … [+2817 chars]"}, {"source": {"id": null, "name": "Sciencetimes.com"}, "author": "Staff Reporter", "title": "Emirate-Built Mars Explorer Sent to a Far Away Japanese Island for Its Final Preparation Ahead of Its July Lau - Science Times", "description": "UAE's Hope probe that is set to orbit Mars has arrived at its launch site in Japan ahead of its scheduled lift-off in July.", "url": "https://www.sciencetimes.com/articles/25471/20200427/emirate-built-mars-explorer-sent-far-away-japanese-island-final-launch.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/27200/emirate-built-mars-explorer-delivered-to-a-far-away-japanese-island-for-its-final-preparation-ahead-of-its-july-launch.jpg", "publishedAt": "2020-04-27T05:15:46Z", "content": null}, {"source": {"id": null, "name": "Nanowerk.com"}, "author": null, "title": "Engineers develop precision injection system for plants - Nanowerk", "description": "Microneedles made of silk-based material can target plant tissues for delivery of micronutrients, hormones, or genes.", "url": "https://www.nanowerk.com/news2/biotech/newsid=55010.php", "urlToImage": "https://www.nanowerk.com/news2/biotech/id55010.jpg", "publishedAt": "2020-04-27T05:00:17Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "As Beautiful as The Moon? This is The First Time we Get to See The Lunar Surface in Such Detail - 360TopNews", "description": "Scientists used information from six Apollo-era regional maps along with updated information from recent satellite missions to the moon. The missions include the including the Lunar Reconnaissance Orbiter and Japan’s SELENE.", "url": "https://www.news18.com/news/tech/as-beautiful-as-the-moon-this-is-the-first-time-we-get-to-see-the-lunar-surface-in-such-detail-2593939.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587959334_moon.jpg", "publishedAt": "2020-04-27T04:36:30Z", "content": "We know the moon is beautiful. It has been referenced in many a love story, official or secretive. Its beauty has been mentioned in many musical pieces too. And when you do peer out of your window into the night sky, it really does look something else. Now, y… [+1736 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Prabhjote Gill", "title": "The biggest asteroid of the year will zoom past Earth this week — adhering to 'social distancing' and even wea - Business Insider India", "description": "The biggest asteroid of 2020 — Asteroid 52768 (1998 OR2) — didn’t get the memo that Earth is under lockdown. It will be zooming past the planet on April 29.", "url": "https://www.businessinsider.in/science/space/news/the-biggest-asteroid-of-the-year-will-zoom-past-earth-this-week-adhering-to-social-distancing-and-even-wearing-a-mask/articleshow/75399097.cms", "urlToImage": "https://www.businessinsider.in/photo/75399097/the-biggest-asteroid-of-the-year-will-zoom-past-earth-this-week-adhering-to-social-distancing-and-even-wearing-a-mask.jpg?imgsize=661542", "publishedAt": "2020-04-27T03:45:00Z", "content": "The biggest asteroid of the year\r\n — Asteroid 52768 (1998 OR2) — is expected to fly on April 29. Apparently, it didn’t get the notice that Earth is under lockdown. \r\nHowever, it does seem to know that it shouldn’t get too close to the planet. The asteroid has… [+2689 chars]"}, {"source": {"id": null, "name": "Ancient-origins.net"}, "author": "ancient-origins", "title": "Four Discoveries of Ancient Greek Astronomy That Still Baffle Experts - Ancient Origins", "description": "The Histories by Herodotus (484BC to 425BC) offers a remarkable window into the world as it was known by ancient Greek astronomy in the mid fifth century BC.", "url": "https://www.ancient-origins.net/news-history-archaeology/ancient-greek-astronomy-0013626", "urlToImage": "https://www.ancient-origins.net/sites/default/files/field/image/Ancient-Greek-astronomy.jpg", "publishedAt": "2020-04-27T03:20:08Z", "content": "The Histories by Herodotus (484BC to 425BC) offers a remarkable window into the world as it was known by ancient Greek astronomy in the mid fifth century BC. Almost as interesting as what they knew, however, is what they did not know. This sets the baseline f… [+7672 chars]"}, {"source": {"id": null, "name": "Unite.ai"}, "author": "Alex McFarland", "title": "Brain-Computer Interface Technology Restores Sensation to Hand of Individual with Spinal Cord Injury - Unite.AI", "description": "A team of researchers at Battelle and the Ohio State University Wexner Medical Center report that through the use of Brain-Computer Interface technology, they successfully restored sensation to the hand of an individual with a severe spinal cord injury. This …", "url": "https://www.unite.ai/brain-computer-interface-technology-restores-sensation-to-hand-of-individual-with-spinal-cord-injury/", "urlToImage": "https://www.unite.ai/wp-content/uploads/2020/04/artificial-intelligence-4694502_1280-1000x600.jpg", "publishedAt": "2020-04-27T01:49:52Z", "content": "New research coming out of Carnegie Mellon University (CMU) and the University of Pittsburgh (Pitt) will drastically improve and stabilize brain-computer interfaces. \r\nThe research was published in Nature Biomedical Engineering, with the paper being titled A … [+3916 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Chinese space agency reveals Tianwen-1 is the name of the first unmanned mission to Mars - Firstpost", "description": "The name comes from “Tianwen”, or “Questions to Heaven”, a poem written by Qu Yuan who lived more than two millennia ago.", "url": "https://www.firstpost.com/tech/science/chinese-space-agency-reveals-tianwen-1-name-first-unmanned-mission-mars-8302401.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/03/mars-1280.jpg", "publishedAt": "2020-04-27T01:25:51Z", "content": "Chinas space agency on Friday unveiled the name of its first Mars exploration mission, coinciding with Chinas annual Space Day and the 50th anniversary of the launch of its first satellite.\r\nThe Mars mission has been named Tianwen-1, the official Xinhua news … [+904 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Record-breaking hole in ozone layer over Arctic closed: EU sat - Times of India", "description": "India News: In a good news, European satellite system Copernicus has found that a record-breaking hole ever observed in the ozone layer over Arctic has closed.", "url": "https://timesofindia.indiatimes.com/india/record-breaking-hole-in-ozone-layer-over-arctic-closed-eu-sat/articleshow/75397575.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75397574,width-1070,height-580,imgsize-449354,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-04-27T00:43:00Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Newslanded.com"}, "author": null, "title": "Scientists discover why Venus’ atmosphere behaves so strangely - News Landed", "description": "Horinouchi and his team were able to map the winds using ultraviolet imaging of Venus' clouds provided by the Japanese space probe Akatsuki.", "url": "https://newslanded.com/2020/04/26/venus-super-rotation/", "urlToImage": "https://newslanded.b-cdn.net/wp-content/uploads/2020/04/otFCeKHpqqqgKdg9WhzUR4-650-80.jpg", "publishedAt": "2020-04-26T21:45:05Z", "content": "For years scientists have wondered why Venus’ atmosphere spins so much faster than its surface. The answer, according to a recent study by a team of scientists led by Takeshi Horinouchi (Hokkaido University in Sapporo, Japan), lies in its thermal tides.\r\nAnim… [+1535 chars]"}, {"source": {"id": null, "name": "Prnewswire.com"}, "author": null, "title": "NASA Administrator Statement on Passing of Former Administrator James Beggs - PRNewswire", "description": "/PRNewswire/ -- The following is a statement from NASA Administrator Jim Bridenstine on the passing of the agency's sixth administrator, James Beggs, on April...", "url": "https://www.prnewswire.com/news-releases/nasa-administrator-statement-on-passing-of-former-administrator-james-beggs-301047269.html", "urlToImage": "https://mma.prnewswire.com/media/326469/nasa_logo.jpg?p=facebook", "publishedAt": "2020-04-26T21:40:00Z", "content": "WASHINGTON, April 26, 2020 /PRNewswire/ -- The following is a statement from NASA Administrator Jim Bridenstine on the passing of the agency's sixth administrator, James Beggs, on April 23. Mr. Beggs served as NASA administrator from July 1981 to December 198… [+1127 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "NASA Published Photo That Jupiter Looks Like Art Painting - Somag News", "description": "NASA, one of the space agencies working on space research, shared Jupiter’s photo resembling an art painting. The photo, on which a few minor plays were made, was taken by Juno, who has been orbiting the planet since 2016. NASA is observing many different pla…", "url": "https://www.somagnews.com/nasa-published-photo-jupiter-looks-like-art-painting/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2020/04/9-26-e1587931254509.jpg", "publishedAt": "2020-04-26T20:01:00Z", "content": "NASA, one of the space agencies working on space research, shared Jupiter’s photo resembling an art painting. The photo, on which a few minor plays were made, was taken by Juno, who has been orbiting the planet since 2016.\r\nNASA is observing many different pl… [+1670 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Shari Miller For Mailonline", "title": "First ever proof of meteorite killing a man uncovered in 1888 report to Ottoman sultan - Daily Mail", "description": "Documents show Ottoman Sultan Abdul Hamid II (left), was informed of a meteorite that killed one man and paralysed another after landing in Sulaymaniyah, Iraq, on August 22, 1888.", "url": "https://www.dailymail.co.uk/news/article-8258631/First-proof-meteorite-killing-man-uncovered-1888-report-Ottoman-sultan.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/04/26/17/27674526-0-image-a-2_1587919300209.jpg", "publishedAt": "2020-04-26T19:40:56Z", "content": "The first ever proof of a person being struck and killed by a meteorite might just have been discovered.\r\nResearchers at the Meteoritical Society have found evidence of a meteorite that killed one man and left another paralysed after it fell 'like rain' on a … [+2605 chars]"}, {"source": {"id": null, "name": "Denverpost.com"}, "author": "Seth Borenstein", "title": "Earth’s insect population shrinks by 27% in 30 years, according to study - The Denver Post", "description": "The world has lost more than one quarter of its land-dwelling insects in the past 30 years, according to researchers whose big picture study of global bug decline paints a disturbing but more nuanc…", "url": "https://www.denverpost.com/2020/04/26/earths-insect-population-shrinks/", "urlToImage": "https://www.denverpost.com/wp-content/uploads/2020/04/Insect_Decline_11900-2.jpg?w=1024&h=683", "publishedAt": "2020-04-26T19:15:00Z", "content": "KENSINGTON, Maryland — The world has lost more than one quarter of its land-dwelling insects in the past 30 years, according to researchers whose big picture study of global bug decline paints a disturbing but more nuanced problem than earlier research.\r\nFrom… [+3613 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nDominic Nicholls,", "title": "Ex-SAS men supply PPE after frustration at government's failure to distribute enough supplies - Telegraph.co.uk", "description": "The Pilgrim Bandits charity has supplied face masks, suits and other equipment to A&E departments, care homes and individuals in need", "url": "https://www.telegraph.co.uk/news/2020/04/26/ex-sas-men-supply-ppe-frustration-governments-failure-distribute/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2020/04/26/TELEMMGLPICT000230205425_trans_NvBQzQNjv4BqFYaFMqenqvL3x_jptXZ5MxKi2sT3vi7ux2-RDZwC4QA.jpeg?impolicy=logo-overlay", "publishedAt": "2020-04-26T19:00:00Z", "content": "He blamed government procurement rules for the slow response in providing PPE to the coronavirus frontline. \r\nChinas got a shedload of everything, with the appropriate European stamps he said, but because the Chinese want 50 per cent of the money up front and… [+1324 chars]"}, {"source": {"id": null, "name": "Orissapost.com"}, "author": "Post News Network", "title": "Rare merger of two black holes observed by scientists - OrissaPOST", "description": "Astronauts always crave to witness rare phenomena that can offer new premises for further research. Speaking of rare phenomena and research, there is probably nothing that can be of more interest to astronomers than black holes. Be it the time when it was men…", "url": "https://www.orissapost.com/rare-merger-of-two-black-holes-observed-by-scientists/", "urlToImage": "https://www.orissapost.com/wp-content/uploads/2020/04/Black-hole-merger-AP.jpeg", "publishedAt": "2020-04-26T16:35:00Z", "content": "Astronauts always crave to witness rare phenomena that can offer new premises for further research. Speaking of rare phenomena and research, there is probably nothing that can be of more interest to astronomers than black holes.\r\nBe it the time when it was me… [+1382 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Neha", "title": "Tectonic plates started shifting 3.2 billion years ago: Study - The Siasat Daily", "description": "New York: The Earth's tectonic plates started moving more than 3.2 billion years ago - just over 1.3 billion years after the Earth first formed and earlier than originally thought, researchers have revealed. To date, some researchers theorised it happened aro…", "url": "https://www.siasat.com/tectonic-plates-started-shifting-3-2-billion-years-ago-study-1880018/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/03/telescopes.jpg", "publishedAt": "2020-04-26T14:00:37Z", "content": "New York: The Earth’s tectonic plates started moving more than 3.2 billion years ago – just over 1.3 billion years after the Earth first formed and earlier than originally thought, researchers have revealed.\r\nTo date, some researchers theorised it happened ar… [+3044 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "NASA develops low-cost ventilator to fight coronavirus - Northeast Now", "description": "NASA engineers have designed a new low-cost high-pressure ventilator tailored to treat coronavirus patients. The device, called VITAL (Ventilator Intervention Technology Accessible Locally), passed a critical test on April 21 at the Icahn School of Medicine a…", "url": "https://nenow.in/health/nasa-develops-low-cost-ventilator-to-fight-coronavirus.html/", "urlToImage": "https://nenow.in/wp-content/uploads/2020/04/NASA.jpg", "publishedAt": "2020-04-26T13:42:22Z", "content": "NASA engineers have designed a new low-cost high-pressure ventilator tailored to treat coronavirus patients.\r\nThe device, called VITAL (Ventilator Intervention Technology Accessible Locally), passed a critical test on April 21 at the Icahn School of Medicine … [+1301 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Christopher Wanjek", "title": "How Space Travel Tries to Kill You and Make You Ugly - WIRED", "description": "Oh also, it makes you blind and stupid, too.", "url": "https://www.wired.com/story/how-space-tries-kill-you-make-you-ugly/", "urlToImage": "https://media.wired.com/photos/5e961efdca6a5100098746f8/191:100/w_1280,c_limit/space-human-body-backchhannel.jpg", "publishedAt": "2020-04-26T11:40:53Z", "content": "Of these 34 risks, three are potential showstoppers: radiation, gravity (or lack thereof), and the need for surgery or a complicated medical procedure.\r\nLets explore the gravity issue.\r\nSome science fiction writers in the mid-20th century speculated that zero… [+3425 chars]"}, {"source": {"id": null, "name": "Webbyfeed.com"}, "author": "Herbert S. Aurand", "title": "Tomanowos Meteorite Is As Old As The Earth Is - Webby Feed", "description": "The Williamette meteorite, known as the Tomanowos according to its ancient name, is believed to have arrived on the Earth directly from heaven. The 15-ton rock was found by the...", "url": "https://www.webbyfeed.com/tomanowos-meteorite-is-as-old-as-the-earth-is/8048/", "urlToImage": "https://i1.wp.com/www.webbyfeed.com/wp-content/uploads/2020/04/Tomanowos-Meteorite.jpg?fit=1356%2C668&ssl=1", "publishedAt": "2020-04-26T10:01:00Z", "content": "The Williamette meteorite, known as the Tomanowos according to its ancient name, is believed to have arrived on the Earth directly from heaven. The 15-ton rock was found by the European Americans in the vicinity of the Willamette River more than one century a… [+1605 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "How runny a liquid can be? - Tech Explorist", "description": "Viscosity (η) is the resistance of a liquid to flow. Liquids get thicker when cooled and runnier when heated, but how runny can a liquid ever get if we", "url": "https://www.techexplorist.com/runny-liquid/31826/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/04/fundamental-constants-of-Nature.jpg", "publishedAt": "2020-04-26T09:47:18Z", "content": "Viscosity () is the resistance of a liquid to flow. Liquids get thicker when cooled and runnier when heated, but how runny can a liquid ever get if we keep heating it?\r\nAt a point, the liquid reaches a specific temperature; it transitions between the liquid-l… [+3341 chars]"}, {"source": {"id": null, "name": "Bigthink.com"}, "author": "Michelle Thaller", "title": "Ask an astronomer: How do astronauts deal with isolation? - Big Think", "description": "Being stuck at home is not as intense as being away from Earth, but there are ways to cope in either scenario.", "url": "https://bigthink.com/videos/astronaut-isolation", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMzE1NjAwNy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTYzNTY0MDgxM30.CCVXusvBpywQ1LORemSLHFoFzGGc10nXJwSIs9zvuV4/img.jpg?width=1200&coordinates=0%2C47%2C0%2C47&height=600", "publishedAt": "2020-04-26T09:05:19Z", "content": "MICHELLE THALLER: When it comes to how to deal with isolation and feeling like you're sort of helpless and cut off from everybody, it's hard to beat the experience of an astronaut, where they literally are cut off from Earth. And even if they wanted to, they … [+4662 chars]"}, {"source": {"id": null, "name": "Volcanodiscovery.com"}, "author": null, "title": "Volcanoes Today - summary of volcanic activity world-wide - VolcanoDiscovery", "description": "Volcanoes Today - summary of volcanic activity world-wide", "url": "https://www.volcanodiscovery.com/volcanoes/today.html", "urlToImage": null, "publishedAt": "2020-04-26T08:59:32Z", "content": "Volcanoes Today, 26 Apr 2020: Klyuchevskoy volcano, Reventador, Sangay, Nevados de Chillán, Aso, Sabancaya, Ebeko\r\nSunday Apr 26, 2020 11:00 AM | BY: VN\r\nSatellite image of Klyuchevskoy volcano on 26 Apr 2020\r\nKlyuchevskoy (Kamchatka): Explosive activity cont… [+1647 chars]"}, {"source": {"id": null, "name": "Publicist360.com"}, "author": null, "title": "Sales Revenue of Autoclaved Aerated Concrete (AAC) to escalate in the Coming Years Owing to Changes in Market Dynamics During COVID-19 Pandemic - Publicist360", "description": "Autoclaved Aerated Concrete (AAC) Market Segmentation- The Autoclaved Aerated Concrete (AAC) Market study offers an in-depth analysis of the current market trends influencing this business vertical. The study also includes market valuation, market size, reven…", "url": "https://publicist360.com/2020/04/26/sales-revenue-of-autoclaved-aerated-concrete-aac-to-escalate-in-the-coming-years-owing-to-changes-in-market-dynamics-during-covid-19-pandemic/", "urlToImage": "https://jewishlifenews.com/wp-content/uploads/2020/02/Untitled-design-8.png", "publishedAt": "2020-04-26T08:23:21Z", "content": "Autoclaved Aerated Concrete (AAC) Market Segmentation-\r\nThe Autoclaved Aerated Concrete (AAC) Market study offers an in-depth analysis of the current market trends influencing this business vertical. The study also includes market valuation, market size, reve… [+5552 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu Net Desk", "title": "Watch | Great Barrier Reef suffers third major bleaching event - The Hindu", "description": "A video on the Great Barrier Reef that suffered its worst mass coral bleaching event in recent years", "url": "https://www.thehindu.com/sci-tech/energy-and-environment/great-barrier-reef-suffers-massive-coral-bleaching/article31436663.ece", "urlToImage": "https://www.thehindu.com/sci-tech/energy-and-environment/xnboqe/article31436714.ece/ALTERNATES/LANDSCAPE_615/Greatbarrierreefbleaching", "publishedAt": "2020-04-26T08:05:58Z", "content": "The Great Barrier Reef, the worlds largest coral reef ecosystem located in Australia, recently experienced its third major bleaching event in five years.\r\nIt is considered to be the most widespread coral bleaching event on record, owing to the rise in tempera… [+619 chars]"}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Ethelene Bailey", "title": "BepiColombo Captured a Couple of Images of the Earth, While Heading Towards Mercury - Dual Dove", "description": "The European Space Agency has recently published a series of impressive images of the Earth captured by the BepiColombo probe. The mission aiming to provide resourceful information regarding the fo…", "url": "https://www.dualdove.com/bepicolombo-captured-a-couple-of-images-of-the-earth-while-heading-towards-mercury/9742/", "urlToImage": "https://www.dualdove.com/wp-content/uploads/2020/04/bepicolombo-missions-images-of-the-earth.jpg", "publishedAt": "2020-04-26T07:52:30Z", "content": "The European Space Agency has recently published a series of impressive images of the Earth captured by the BepiColombo probe. The mission aiming to provide resourceful information regarding the formation and evolution of Mercury started in 2018.\r\nTwo years h… [+1721 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Before becoming frozen wasteland, Antarctica was home to frogs - CGTN", "description": "At the time when the little frog was hopping around and dining on insects, ice sheets were already forming in the highlands within the interior of Antarctica.", "url": "https://news.cgtn.com/news/2020-04-26/Before-becoming-frozen-wasteland-Antarctica-was-home-to-frogs-Q0eMPNz0I0/index.html", "urlToImage": "https://news.cgtn.com/news/7959544e324d6a4e3259444d324d444f3463444f31457a6333566d54/img/1d7ef3e74ca242b09753fa27fa983284/1d7ef3e74ca242b09753fa27fa983284-1.jpg", "publishedAt": "2020-04-26T07:46:15Z", "content": "When paleontologist Thomas Mors was peering into a microscope while sorting through tiny 40 million-year-old fossils unearthed on Seymour Island near the tip of the Antarctic Peninsula, he came across quite a surprise hip and skull bones of a frog.\r\nThe littl… [+2705 chars]"}, {"source": {"id": null, "name": "Bccourier.com"}, "author": "bcc", "title": "The great death is real - Bandera County Courier", "description": "The current question first: maybe the current lockdown also helps the insects? \"Rather not,\" says Roel van Klink, \"unlike larger animals, they don't care whether we walk around in nature or not.\"", "url": "https://www.bccourier.com/the-great-death-is-real/", "urlToImage": "https://www.bccourier.com/wp-content/uploads/2020/04/232916/the-great-death-is-real.jpg", "publishedAt": "2020-04-26T07:37:17Z", "content": "The current question first: maybe the current lockdown also helps the insects? “Rather not,” says Roel van Klink, “unlike larger animals, they don't care whether we walk around in nature or not.” \r\n But one thing van Klink, who on German Center for Integrativ… [+8682 chars]"}, {"source": {"id": null, "name": "Spokesman.com"}, "author": "Richard Tribou", "title": "SpaceX already prepping for next crew mission to ISS ahead of May test run - The Spokesman-Review", "description": "SpaceX is already looking past next month’s planned landmark mission of its Crew Dragon capsule to the International Space Station.", "url": "https://www.spokesman.com/stories/2020/apr/25/spacex-already-prepping-for-next-crew-mission-to-i/", "urlToImage": "https://media.spokesman.com/photos/2020/04/25/Rocket_Launch.JPG_CKNPuar_t1200.jpg?298603a24e8d51915fce203907ff2746e482a5a6", "publishedAt": "2020-04-26T03:51:09Z", "content": "ORLANDO, Fla. SpaceX is already looking past next months planned landmark mission of its Crew Dragon capsule to the International Space Station.\r\nCurrently slated for May 27, the mission from Kennedy Space Center will be the first time astronauts will launch … [+2624 chars]"}, {"source": {"id": null, "name": "Thenews.com.pk"}, "author": "News Report", "title": "NASAs new moon map to support future missions - The News International", "description": "CALIFORNIA: NASA plans to send humans to the moon by 2024. As ambitious as it sounds, we might be surprised by how NASA will manage to develop the future missions. There are also lots of massive...", "url": "https://www.thenews.com.pk/print/650008-nasa-s-new-moon-map-to-support-future-missions", "urlToImage": "https://www.thenews.com.pk/assets/front/img/no-img-fb.jpg", "publishedAt": "2020-04-26T02:00:27Z", "content": "CALIFORNIA: NASA plans to send humans to the moon by 2024. As ambitious as it sounds, we might be surprised by how NASA will manage to develop the future missions. There are also lots of massive hurdles to face before humans reach the Moon, foreign media repo… [+1546 chars]"}, {"source": {"id": null, "name": "Eurasiareview.com"}, "author": "https://www.eurasiareview.com/author/admin/", "title": "An Eclipsing Binary Millisecond Pulsar Discovered By FAST - Eurasia Review", "description": "Using the data obtained by the Five-hundred-meter Aperture Spherical radio Telescope (FAST), a research team led by Prof. PAN Zhichen and Prof. LI Di from the National Astronomical Observatories of…", "url": "https://www.eurasiareview.com/26042020-an-eclipsing-binary-millisecond-pulsar-discovered-by-fast/", "urlToImage": "https://i1.wp.com/www.eurasiareview.com/wp-content/uploads/2020/04/b-292.jpg?fit=800%2C445&ssl=1", "publishedAt": "2020-04-25T22:26:00Z", "content": "Using the data obtained by the Five-hundred-meter Aperture Spherical radio Telescope (FAST), a research team led by Prof. PAN Zhichen and Prof. LI Di from the National Astronomical Observatories of the Chinese Academy of Sciences (NAOC) discovered an eclipsin… [+1881 chars]"}, {"source": {"id": null, "name": "Voanews.com"}, "author": "VOA Learning English", "title": "Scientists Study Unusual Comet - VOA Learning English", "description": "Amateur astronomer Gennady Borisov was the first person to identify a new comet in August of 2019. Researchers reported on Monday that gas coming off the comet, 2I/Borisov, had high levels of carbon monoxide - far more than comets formed in our solar system.", "url": "https://learningenglish.voanews.com/a/scientists-study-unusual-comet-/5384347.html", "urlToImage": "https://gdb.voanews.com/BBC62255-918B-421C-A24E-F68343F73161_w1200_r1.jpg", "publishedAt": "2020-04-25T21:58:00Z", "content": "Scientists recently reported new details about the second interstellar object ever seen passing through our solar system. It is a comet called 2I/Borisov.\r\nComets are made up of frozen gases, rock and dust that orbit stars. The Reuters news agency likens them… [+3202 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Scientists Find Our Solar System 'Stealing' Interstellar Asteroids - Somag News", "description": "It was found that 19 interstellar asteroids were swallowed by the Solar System. So scientists will not have to look far to observe asteroids. These asteroids are thought to have been swallowed by the Solar System about 4 billion years ago. An international te…", "url": "https://www.somagnews.com/scientists-find-solar-system-stealing-interstellar-asteroids/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2020/04/10-2-e1587841404843.jpeg", "publishedAt": "2020-04-25T19:03:00Z", "content": "It was found that 19 interstellar asteroids were swallowed by the Solar System. So scientists will not have to look far to observe asteroids. These asteroids are thought to have been swallowed by the Solar System about 4 billion years ago.\r\nAn international t… [+2034 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "The Great Space Escape: Scientists Learn How Light Can Flee From Black Hole 'Like Boomerang' - Sputnik International", "description": "The scientists' discovery may potentially help them to learn more about the nature of black holes, such as the rotation speed of these space objects.", "url": "https://sputniknews.com/science/202004251079093023-the-great-space-escape-scientists-learn-how-light-can-flee-from-black-hole-like-a-boomerang/", "urlToImage": "https://cdn2.img.sputniknews.com/images/106962/09/1069620931.jpg", "publishedAt": "2020-04-25T18:31:30Z", "content": "The scientists' discovery may potentially help them to learn more about the nature of black holes, such as the rotation speed of these space objects.Having examined archived X-ray observation data of a black hole whose mass is about ten times that of the Sun … [+1560 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Callum Hoare", "title": "'Universe is unstable!' How Brian Cox revealed world could end 'at any moment' - Express.co.uk", "description": "THE END OF THE WORLD could happen 'at any moment' according to the chilling claims of a scientist, after Brian Cox revealed why the 'universe is unstable'.", "url": "https://www.express.co.uk/news/science/1273858/end-of-the-world-brian-cox-universe-unstable-vacuum-decay-space-news-spt", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1273858.jpg", "publishedAt": "2020-04-25T17:54:00Z", "content": null}, {"source": {"id": null, "name": "Investrecords.com"}, "author": "admin", "title": "The Most Important Image Ever Taken By NASA's Hubble Space Telescope - Invest Records", "description": "One peek into a small part of the sky, one giant leap back in time. This small patch of sky... [+] represents less than 1/100,000,000th of the volume of the Universe, but reveals nearly 1,000 galaxies", "url": "https://www.investrecords.com/the-most-important-image-ever-taken-by-nasas-hubble-space-telescope/", "urlToImage": "https://www.investrecords.com/wp-content/uploads/2020/04/49579/the-most-important-image-ever-taken-by-nasas-hubble-space-telescope-scaled.jpg", "publishedAt": "2020-04-25T17:36:08Z", "content": "One peek into a small part of the sky, one giant leap back in time. This small patch of sky… [+] represents less than 1/100,000,000th of the volume of the Universe, but reveals nearly 1,000 galaxies that had never been seen before. This small fraction of the … [+7400 chars]"}, {"source": {"id": null, "name": "Ibtimes.sg"}, "author": "https://www.ibtimes.sg/reporters/jeevan-biswas", "title": "Scientists identify the 'most dangerous place' in the history of earth, once home to fearsome predators - International Business Times, Singapore Edition", "description": "According to the researchers, the area around south-eastern Morocco was home to predators such as Carcharodontosaurus, Pterosaurs and freshwater sharks 100 million years ago", "url": "https://www.ibtimes.sg/scientists-identify-most-dangerous-place-history-earth-once-home-fearsome-predators-43789", "urlToImage": "https://data.ibtimes.sg/en/full/36203/pterosaur.jpg", "publishedAt": "2020-04-25T16:43:56Z", "content": "If one was asked which was the most dangerous place in the history of the planet, what would their answer be? Not many can answer that question. However, an international team of scientists has identified such a place a predator-ridden Morocco 100 million yea… [+3056 chars]"}, {"source": {"id": null, "name": "Digitaltrends.com"}, "author": "Georgina Torbet", "title": "NASA’s Perseverance rover is perfectly balanced for its trip to Mars - Digital Trends", "description": "NASA's Perseverance rover is preparing for its launch to Mars has just made it through one more item on the list: Ensuring that it is correctly balanced.", "url": "https://www.digitaltrends.com/news/nasa-perseverance-rover-balance/", "urlToImage": "https://icdn4.digitaltrends.com/image/digitaltrends/pia23828-1200x630-c-ar1.91.jpg", "publishedAt": "2020-04-25T16:00:25Z", "content": "NASA’s Perseverance rover is preparing for launch in the next few months by undergoing final checks, and it has just made it through one more item on the list: Ensuring that it is correctly balanced.\r\nPart of the final preparations for readying the rover for … [+1853 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Dutch Tulip Fields Come Into Bloom in Stunning Satellite Images - SciTechDaily", "description": "While the COVID-19 virus pandemic is forcing everybody to stay at home, we bring you these beautiful views from space of the Dutch tulip fields coming into bloom. Captured by the Copernicus Sentinel-2 mission on April 5, April 10, April 15 and April 20, 2020,…", "url": "https://scitechdaily.com/dutch-tulip-fields-come-into-bloom-in-stunning-satellite-images/", "urlToImage": "https://scitechdaily.com/images/Dutch-Tulip-Fields-Bloom-Crop.gif", "publishedAt": "2020-04-25T14:03:13Z", "content": "While the COVID-19 virus pandemic is forcing everybody to stay at home, we bring you these beautiful views from space of the Dutch tulip fields coming into bloom. Captured by the Copernicus Sentinel-2 mission on April 5, April 10, April 15 and April 20, 2020,… [+1633 chars]"}, {"source": {"id": null, "name": "Phonemantra.com"}, "author": "Admin", "title": "Hubble turns 30, NASA celebrates by sharing a wonderful image - Phone Mantra", "description": "It was April 24, 1990, when the Hubble Space Telescope arrived in the Earth’s low orbit, the beginning of a very long observation mission that was able to give us the most suggestive images of the cosmos ever. To commemorate the important event, NASA and ESA …", "url": "https://phonemantra.com/hubble-turns-30-nasa-celebrates-by-sharing-a-wonderful-image/", "urlToImage": "https://phonemantra.com/wp-content/uploads/2020/04/photos-taken-through-Hubble.jpg", "publishedAt": "2020-04-25T13:39:00Z", "content": "It was April 24, 1990, when the Hubble Space Telescope arrived in the Earth’s low orbit, the beginning of a very long observation mission that was able to give us the most suggestive images of the cosmos ever. To commemorate the important event, NASA and ESA … [+1253 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "Scientists discovered ‘the most dangerous place in history’ on Earth - Tech Explorist", "description": "100 million years ago, ferocious predators, including flying reptiles and crocodile-like hunters, made the Sahara the most dangerous place on Earth.", "url": "https://www.techexplorist.com/scientists-discovered-most-dangerous-place-earth/31814/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/04/danger-place.jpg", "publishedAt": "2020-04-25T12:35:00Z", "content": "A new study by the University of Portsmouth has provided a window into Africa’s Age of Dinosaurs. They reviewed almost 100 years of fossil vertebrates from an area of Cretaceous rock formations in south-eastern Morocco, known as the Kem Kem Group.\r\nAt that ti… [+2140 chars]"}, {"source": {"id": null, "name": "Newkerala.com"}, "author": null, "title": "Atmospheric tidal waves maintain Venus super-rotation - New Kerala", "description": "Images from the Akatsuki spacecraft unveil what keeps Venuss atmosphere rotating much faster than the planet itself....", "url": "https://www.newkerala.com/news/2020/72955.htm", "urlToImage": null, "publishedAt": "2020-04-25T12:09:54Z", "content": "ANI | Washington D.C. , April 25 Images from the Akatsuki spacecraft unveil what keeps Venus's atmosphere rotating much faster than the planet itself.An international research team led by Takeshi Horinouchi of Hokkaido University has revealed that this 'super… [+2878 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Carly Cassella", "title": "Controversial Discovery Says Origins of Human Language Existed 25 Million Years Ago - ScienceAlert", "description": "A structure critical to our brain's core language pathway, found only in humans and apes, has now also been identified in monkeys, according to a controversial new study - suggesting the origins of language may have appeared 20 to 25 million years ea", "url": "https://www.sciencealert.com/controversial-discovery-in-monkeys-pushes-the-origin-of-human-language-back-25-million-years", "urlToImage": "https://www.sciencealert.com/images/2020-04/processed/rhesusmacaques_1024.jpg", "publishedAt": "2020-04-25T09:31:17Z", "content": "A structure critical to our brain's core language pathway, found only in humans and apes, has now also been identified in monkeys, according to a controversial new study - suggesting the origins of language may have appeared 20 to 25 million years earlier tha… [+4838 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Ciaran McGrath", "title": "Kilauea shock: Was THIS the reason for 2018 Hawaii volcano eruption? - Express.co.uk", "description": "THE spectacular Kilauea volcanic eruption of 2018, which resulted in the destruction of hundreds of homes, and the evacuation of thousands of people, may have been triggered in part by unusually high rainfall levels, a new study has suggested.", "url": "https://www.express.co.uk/news/science/1272403/kilauea-volcano-eruption-hawaii-big-island-2018-rainfall", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1272403.jpg", "publishedAt": "2020-04-25T09:30:00Z", "content": null}, {"source": {"id": null, "name": "Travelandleisure.com"}, "author": "Cailey Rizzo", "title": "NASA's Online Game Can Help Save the Coral Reefs — and Your Boredom During Quarantine - Travel + Leisure", "description": "Move over, Animal Crossing.", "url": "https://www.travelandleisure.com/travel-tips/mobile-apps/nasa-nemo-net-coral-reef-mapping-game-quarantine", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1800&h=942&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F28%2F2020%2F04%2F20%2Fnasa-coral-mapping-CORAL0420.jpg", "publishedAt": "2020-04-20T16:42:22Z", "content": "NASA is calling on gamers to help map and explore the world’s coral reefs.\r\nIn the game, NASA NeMO-Net, players can can help train a NASA supercomputer to learn more about the ocean floor, with the help of real NASA data to identify and classify corals. Playe… [+1604 chars]"}, {"source": {"id": null, "name": "Tass.com"}, "author": "TASS", "title": "ISS crew evacuated from Soyuz-MS15 on landing - TASS", "description": "The crew has returned to Earth due to the novel coronavirus pandemic", "url": "https://tass.com/science/1146089", "urlToImage": "https://phototass1.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20200417/1263015.jpg", "publishedAt": "2020-04-17T06:20:00Z", "content": "MOSCOW, April 17. /TASS/. Roscosmos cosmonaut Oleg Skripochka and NASA astronauts Andrew Morgan and Jessica Meir have been evacuated from the Soyuz MS-15 manned spacecraft, which landed earlier in Kazakhstan, 147 km to the southeast of the city of Zhezqazghan… [+657 chars]"}, {"source": {"id": null, "name": "Travelandleisure.com"}, "author": "Alison Fox", "title": "NASA, Former Astronauts Commemorate the 50th Anniversary of Apollo 13 - Travel + Leisure", "description": "On April 13, 1970, the Apollo 13's lunar landing was aborted in what would become a historic mission.", "url": "https://www.travelandleisure.com/travel-news/apollo-13-mission-50th-anniversary", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1800&h=942&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F28%2F2020%2F04%2F13%2Fapollo-13-crew-APOLLO0420.jpg", "publishedAt": "2020-04-14T13:47:15Z", "content": "\"Houston, we've had a problem.\"\r\nFifty years after that famed phrase aboard the Apollo 13 was spoken, legends and institutions of space exploration are taking to a different form of communication to commemorate the historic mission — Twitter.\r\n“They were coas… [+3223 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "Nihonium makes its way into The Periodic Table with 3 other Elements - http://www.newsgram.com/", "description": "4 new elements were discovered late last year and will be added to the Periodic Table. Nihonium is the first element to be discovered in an Asian country.", "url": "https://www.newsgram.com/nihonium-makes-its-way-into-the-periodic-table-with-3-other-elements/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2016/06/n-nihonium-a-20160610.jpg", "publishedAt": "2017-06-14T01:38:24Z", "content": "BY VISHAL GULATI\r\nBird photography as a hobby and profession has taken off to a major extent in India. It has led to important discoveries of species not previously known from the country, a globally renowned ornithologist said on Sunday.\r\nIn his latest paper… [+4613 chars]"}]}