{"status": "ok", "totalResults": 54, "articles": [{"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV News Desk", "title": "Potentially hazardous Apollo asteroid galloping towards Earth, likely to fly by on May 7 - India TV News", "description": "An asteroid 210-metre in diametre is hurling towards earth and is likely to come particularly close on May 7, when the asteroid is like to fly past. NASA Centre for Near-Earth Object Studies has revealed details about the asteroid on its website. The Apollo c…", "url": "https://www.indiatvnews.com/science/potentially-hazardous-apollo-asteroid-to-galloping-towards-earth-likely-to-fly-by-on-may-7-611667", "urlToImage": null, "publishedAt": "2020-04-27T04:36:35Z", "content": "Image Source : SPACE REFERENCEPotentially hazardous Apollo asteroid to galloping towards earth, likely to fly by on May 7\r\nAn asteroid 210-metre in diametre is hurling towards earth and is likely to come particularly close on May 7, when the asteroid is like … [+1787 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "As Beautiful as The Moon? This is The First Time we Get to See The Lunar Surface in Such Detail - 360TopNews", "description": "Scientists used information from six Apollo-era regional maps along with updated information from recent satellite missions to the moon. The missions include the including the Lunar Reconnaissance Orbiter and Japan’s SELENE.", "url": "https://www.news18.com/news/tech/as-beautiful-as-the-moon-this-is-the-first-time-we-get-to-see-the-lunar-surface-in-such-detail-2593939.html", "urlToImage": null, "publishedAt": "2020-04-27T04:36:30Z", "content": "We know the moon is beautiful. It has been referenced in many a love story, official or secretive. Its beauty has been mentioned in many musical pieces too. And when you do peer out of your window into the night sky, it really does look something else. Now, y… [+1736 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Digital Desk", "title": "Hubble telescope celebrates 30 years with portrait of a firestorm in a neighbouring galaxy - Republic World - Republic World", "description": "In the portrait, a giant red nebula and its smaller blue neighbour are part of a vast star-forming region in the Large Magellanic Cloud, a satellite galaxy", "url": "https://www.republicworld.com/technology-news/science/nasas-hubble-telescope-celebrates-30-years-with-a-portrait-of-a-fires.html", "urlToImage": null, "publishedAt": "2020-04-27T04:30:00Z", "content": "Hubble Space Telescope celebrated 30 years in space with a new portrait of a firestorm of a starbirth in a neighboring galaxy. The image is nicknamed the \"Cosmic Reef,\" because NGC 2014 resembles part of a coral reef floating in a vast sea of stars. While som… [+2298 chars]"}, {"source": {"id": null, "name": "Itechpost.com"}, "author": "iTech Post", "title": "SpaceX's Crew Dragon 2 Mission: Astronauts Sent To ISS Aboard Elon Musk's Falcon 9 Spacecraft - iTech Post", "description": "The company is to conduct the Demo-2 launch as a precursor to regular and continuous flights to the International Space Station.", "url": "http://www.itechpost.com/articles/102446/20200426/spacex-crew-dragon-2-mission-astronauts-sent-iss-aboard-elon-musk.htm", "urlToImage": null, "publishedAt": "2020-04-27T01:58:00Z", "content": "SpaceX's Crew Dragon 2 Mission: Astronauts Sent To ISS Aboard Elon Musk's Falcon 9 Spacecraft\r\nSpaceX's Dragon mission is arranged to launch its first set of astronauts to the International Space Station (ISS). The launch is planned to launch on May 27 and ma… [+2997 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Chinese space agency reveals Tianwen-1 is the name of the first unmanned mission to Mars - Firstpost", "description": "The name comes from “Tianwen”, or “Questions to Heaven”, a poem written by Qu Yuan who lived more than two millennia ago.", "url": "https://www.firstpost.com/tech/science/chinese-space-agency-reveals-tianwen-1-name-first-unmanned-mission-mars-8302401.html", "urlToImage": null, "publishedAt": "2020-04-27T01:25:51Z", "content": "Chinas space agency on Friday unveiled the name of its first Mars exploration mission, coinciding with Chinas annual Space Day and the 50th anniversary of the launch of its first satellite.\r\nThe Mars mission has been named Tianwen-1, the official Xinhua news … [+904 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Record-breaking hole in ozone layer over Arctic closed: EU sat - Times of India", "description": "India News: In a good news, European satellite system Copernicus has found that a record-breaking hole ever observed in the ozone layer over Arctic has closed.", "url": "https://timesofindia.indiatimes.com/india/record-breaking-hole-in-ozone-layer-over-arctic-closed-eu-sat/articleshow/75397575.cms", "urlToImage": null, "publishedAt": "2020-04-27T00:43:00Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Eurasiareview.com"}, "author": "https://www.eurasiareview.com/author/admin/", "title": "New Study Finds Connection Between Fault Roughness And Magnitude Of Earthquakes - Eurasia Review", "description": "A new study led by McGill University has found that tectonic plates beneath the Earth’s surface can show varying degrees of roughness and could help explain why certain earthquakes are stronger tha…", "url": "https://www.eurasiareview.com/27042020-new-study-finds-connection-between-fault-roughness-and-magnitude-of-earthquakes/", "urlToImage": null, "publishedAt": "2020-04-26T23:02:00Z", "content": "A new study led by McGill University has found that tectonic plates beneath the Earths surface can show varying degrees of roughness and could help explain why certain earthquakes are stronger than others.\r\nEarthquakes happen when the rocks beneath the Earths… [+2289 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Dalvin Brown", "title": "Love under lockdown: Facebook 'virtual dates' to help users find quarantine dream partner - USA TODAY", "description": "The news was hidden at the bottom of the company's Messenger Rooms announcement where it unveiled new tools for Instagram, Messenger and WhatsApp.", "url": "https://www.usatoday.com/story/tech/2020/04/26/coronavirus-facebook-adding-virtual-dating-tool/3030311001/", "urlToImage": null, "publishedAt": "2020-04-26T21:59:24Z", "content": "Facebook is bolstering its dating service to help members find love while under lockdown orders. \r\nThe tech giant has plans to enable \"virtual dates\" so Facebook Dating users can video chat with matches via Messenger without having to add one another as frien… [+1749 chars]"}, {"source": {"id": null, "name": "Newslanded.com"}, "author": null, "title": "Scientists discover why Venus’ atmosphere behaves so strangely - News Landed", "description": "Horinouchi and his team were able to map the winds using ultraviolet imaging of Venus' clouds provided by the Japanese space probe Akatsuki.", "url": "https://newslanded.com/2020/04/26/venus-super-rotation/", "urlToImage": null, "publishedAt": "2020-04-26T21:45:05Z", "content": "For years scientists have wondered why Venus’ atmosphere spins so much faster than its surface. The answer, according to a recent study by a team of scientists led by Takeshi Horinouchi (Hokkaido University in Sapporo, Japan), lies in its thermal tides.\r\nAnim… [+1535 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "NASA Published Photo That Jupiter Looks Like Art Painting - Somag News", "description": "NASA, one of the space agencies working on space research, shared Jupiter’s photo resembling an art painting. The photo, on which a few minor plays were made, was taken by Juno, who has been orbiting the planet since 2016. NASA is observing many different pla…", "url": "https://www.somagnews.com/nasa-published-photo-jupiter-looks-like-art-painting/", "urlToImage": null, "publishedAt": "2020-04-26T20:01:00Z", "content": "NASA, one of the space agencies working on space research, shared Jupiter’s photo resembling an art painting. The photo, on which a few minor plays were made, was taken by Juno, who has been orbiting the planet since 2016.\r\nNASA is observing many different pl… [+1670 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Shari Miller For Mailonline", "title": "First ever proof of meteorite killing a man uncovered in 1888 report to Ottoman sultan - Daily Mail", "description": "Documents show Ottoman Sultan Abdul Hamid II (left), was informed of a meteorite that killed one man and paralysed another after landing in Sulaymaniyah, Iraq, on August 22, 1888.", "url": "https://www.dailymail.co.uk/news/article-8258631/First-proof-meteorite-killing-man-uncovered-1888-report-Ottoman-sultan.html", "urlToImage": null, "publishedAt": "2020-04-26T19:40:56Z", "content": "The first ever proof of a person being struck and killed by a meteorite might just have been discovered.\r\nResearchers at the Meteoritical Society have found evidence of a meteorite that killed one man and left another paralysed after it fell 'like rain' on a … [+2605 chars]"}, {"source": {"id": null, "name": "Nasaspaceflight.com"}, "author": null, "title": "UAE-built Mars orbiter arrives at launch site ahead of July liftoff - NASASpaceflight.com", "description": "An Emirati-built Mars explorer, named Al Amal (“Hope” in English) and developed by engineers at…", "url": "https://www.nasaspaceflight.com/2020/04/uae-mars-orbiter-arrives-launch-site/", "urlToImage": null, "publishedAt": "2020-04-26T19:17:36Z", "content": "An Emirati-built Mars explorer, named Al Amal (“Hope” in English) and developed by engineers at the Mohammed bin Rashed Space Centre, has been shipped to the JAXA-run Tanegashima Space Center for final checkouts and preparations ahead of its launch aboard an … [+7548 chars]"}, {"source": {"id": null, "name": "Denverpost.com"}, "author": "Seth Borenstein", "title": "Earth’s insect population shrinks by 27% in 30 years, according to study - The Denver Post", "description": "The world has lost more than one quarter of its land-dwelling insects in the past 30 years, according to researchers whose big picture study of global bug decline paints a disturbing but more nuanc…", "url": "https://www.denverpost.com/2020/04/26/earths-insect-population-shrinks/", "urlToImage": null, "publishedAt": "2020-04-26T19:15:00Z", "content": "KENSINGTON, Maryland — The world has lost more than one quarter of its land-dwelling insects in the past 30 years, according to researchers whose big picture study of global bug decline paints a disturbing but more nuanced problem than earlier research.\r\nFrom… [+3613 chars]"}, {"source": {"id": null, "name": "Cleantechnica.com"}, "author": "Steve Hanley", "title": "Starlink Private Beta Testing To Begin In 3 Months, Public Beta Testing To Follow - CleanTechnica", "description": "With 422 Starlink satellites in orbit and 120 more due to launch soon, Elon Musk says private beta testing of the network will begin in about 3 months.", "url": "https://cleantechnica.com/2020/04/26/starlink-private-beta-testing-to-begin-in-3-months-public-beta-testing-to-follow/", "urlToImage": null, "publishedAt": "2020-04-26T18:48:40Z", "content": "April 26th, 2020 by Steve Hanley \r\nSpaceX has now launched 422 of its low Earth orbit Starlink satellites. 2 prototypes were sent up first in 2018, followed by 7 launches carrying 60 satellites each since then. The most recent Starlink mission took place on A… [+3913 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daniel Garcia-Castellanos", "title": "Tomanowos, the meteorite that survived mega-floods and human folly - Space.com", "description": "", "url": "https://www.space.com/tomanowos-meteorite-survived-mega-floods-human-folly.html", "urlToImage": null, "publishedAt": "2020-04-26T14:10:00Z", "content": "This article was originally published at The Conversation. The publication contributed the article to Space.com's Expert Voices: Op-Ed &amp; Insights.\r\nDaniel Garcia-Castellanos, Earth scientist, Instituto de Ciencias de la Tierra Jaume Almera (ICTJA - CSIC)\r… [+7190 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Neha", "title": "Tectonic plates started shifting 3.2 billion years ago: Study - The Siasat Daily", "description": "New York: The Earth's tectonic plates started moving more than 3.2 billion years ago - just over 1.3 billion years after the Earth first formed and earlier than originally thought, researchers have revealed. To date, some researchers theorised it happened aro…", "url": "https://www.siasat.com/tectonic-plates-started-shifting-3-2-billion-years-ago-study-1880018/", "urlToImage": null, "publishedAt": "2020-04-26T14:00:37Z", "content": "New York: The Earth’s tectonic plates started moving more than 3.2 billion years ago – just over 1.3 billion years after the Earth first formed and earlier than originally thought, researchers have revealed.\r\nTo date, some researchers theorised it happened ar… [+3044 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "NASA develops low-cost ventilator to fight coronavirus - Northeast Now", "description": "NASA engineers have designed a new low-cost high-pressure ventilator tailored to treat coronavirus patients. The device, called VITAL (Ventilator Intervention Technology Accessible Locally), passed a critical test on April 21 at the Icahn School of Medicine a…", "url": "https://nenow.in/health/nasa-develops-low-cost-ventilator-to-fight-coronavirus.html/", "urlToImage": null, "publishedAt": "2020-04-26T13:42:22Z", "content": "NASA engineers have designed a new low-cost high-pressure ventilator tailored to treat coronavirus patients.\r\nThe device, called VITAL (Ventilator Intervention Technology Accessible Locally), passed a critical test on April 21 at the Icahn School of Medicine … [+1301 chars]"}, {"source": {"id": null, "name": "Orissapost.com"}, "author": "Post News Network", "title": "Rare merger of two black holes observed by scientists - OrissaPOST", "description": "Astronauts always crave to witness rare phenomena that can offer new premises for further research. Speaking of rare phenomena and research, there is probably nothing that can be of more interest to astronomers than black holes. Be it the time when it was men…", "url": "https://www.orissapost.com/rare-merger-of-two-black-holes-observed-by-scientists/", "urlToImage": null, "publishedAt": "2020-04-26T12:38:33Z", "content": "Astronauts always crave to witness rare phenomena that can offer new premises for further research. Speaking of rare phenomena and research, there is probably nothing that can be of more interest to astronomers than black holes.\r\nBe it the time when it was me… [+1382 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Christopher Wanjek", "title": "How Space Travel Tries to Kill You and Make You Ugly - WIRED", "description": "Oh also, it makes you blind and stupid, too.", "url": "https://www.wired.com/story/how-space-tries-kill-you-make-you-ugly/", "urlToImage": null, "publishedAt": "2020-04-26T11:40:53Z", "content": "Of these 34 risks, three are potential showstoppers: radiation, gravity (or lack thereof), and the need for surgery or a complicated medical procedure.\r\nLets explore the gravity issue.\r\nSome science fiction writers in the mid-20th century speculated that zero… [+3425 chars]"}, {"source": {"id": null, "name": "Wam.ae"}, "author": "WAM", "title": "Coral nursery project for Sir Bu Nair island - WAM EN", "description": "SHARJAH, 26th April, 2020 (WAM) – Sharjah’s Environment and Protected Areas Authority, EPAA, is to collaborate with the Emirates Marine Environment Group, EMEG, to establish a large-scale coral nursery off the coast of the island of Sir Bu Nair. The project, …", "url": "http://wam.ae/en/details/1395302839000", "urlToImage": null, "publishedAt": "2020-04-26T10:03:00Z", "content": "SHARJAH, 26th April, 2020 (WAM) Sharjahs Environment and Protected Areas Authority, EPAA, is to collaborate with the Emirates Marine Environment Group, EMEG, to establish a large-scale coral nursery off the coast of the island of Sir Bu Nair.\r\nThe project, pa… [+2307 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "How runny a liquid can be? - Tech Explorist", "description": "Viscosity (η) is the resistance of a liquid to flow. Liquids get thicker when cooled and runnier when heated, but how runny can a liquid ever get if we", "url": "https://www.techexplorist.com/runny-liquid/31826/", "urlToImage": null, "publishedAt": "2020-04-26T09:47:18Z", "content": "Viscosity () is the resistance of a liquid to flow. Liquids get thicker when cooled and runnier when heated, but how runny can a liquid ever get if we keep heating it?\r\nAt a point, the liquid reaches a specific temperature; it transitions between the liquid-l… [+3341 chars]"}, {"source": {"id": null, "name": "Bigthink.com"}, "author": "Michelle Thaller", "title": "Ask an astronomer: How do astronauts deal with isolation? - Big Think", "description": "Being stuck at home is not as intense as being away from Earth, but there are ways to cope in either scenario.", "url": "https://bigthink.com/videos/astronaut-isolation", "urlToImage": null, "publishedAt": "2020-04-26T09:05:19Z", "content": "MICHELLE THALLER: When it comes to how to deal with isolation and feeling like you're sort of helpless and cut off from everybody, it's hard to beat the experience of an astronaut, where they literally are cut off from Earth. And even if they wanted to, they … [+4662 chars]"}, {"source": {"id": null, "name": "Volcanodiscovery.com"}, "author": null, "title": "Volcanoes Today - summary of volcanic activity world-wide - VolcanoDiscovery", "description": "Volcanoes Today - summary of volcanic activity world-wide", "url": "https://www.volcanodiscovery.com/volcanoes/today.html", "urlToImage": null, "publishedAt": "2020-04-26T08:59:32Z", "content": "Volcanoes Today, 26 Apr 2020: Klyuchevskoy volcano, Reventador, Sangay, Nevados de Chillán, Aso, Sabancaya, Ebeko\r\nSunday Apr 26, 2020 11:00 AM | BY: VN\r\nSatellite image of Klyuchevskoy volcano on 26 Apr 2020\r\nKlyuchevskoy (Kamchatka): Explosive activity cont… [+1647 chars]"}, {"source": {"id": null, "name": "Biophotonics.world"}, "author": null, "title": "FSU researchers discover new structure for promising class of materials - Biophotonics.World", "description": "Florida State University researchers have discovered a novel structure for organic-inorganic hybrid materials that shows potential for more efficient technologies.&nbsp;Professor of Chemistry and Biochemistry Biwu Ma and his team have published a new study in…", "url": "https://www.biophotonics.world/magazine/article/1004/fsu-researchers-discover-new-structure-for-promising-class-of-materials", "urlToImage": null, "publishedAt": "2020-04-26T08:51:23Z", "content": null}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu Net Desk", "title": "Watch | Great Barrier Reef suffers third major bleaching event - The Hindu", "description": "A video on the Great Barrier Reef that suffered its worst mass coral bleaching event in recent years", "url": "https://www.thehindu.com/sci-tech/energy-and-environment/great-barrier-reef-suffers-massive-coral-bleaching/article31436663.ece", "urlToImage": null, "publishedAt": "2020-04-26T08:05:58Z", "content": "The Great Barrier Reef, the worlds largest coral reef ecosystem located in Australia, recently experienced its third major bleaching event in five years.\r\nIt is considered to be the most widespread coral bleaching event on record, owing to the rise in tempera… [+619 chars]"}, {"source": {"id": null, "name": "Dualdove.com"}, "author": "Ethelene Bailey", "title": "BepiColombo Captured a Couple of Images of the Earth, While Heading Towards Mercury - Dual Dove", "description": "The European Space Agency has recently published a series of impressive images of the Earth captured by the BepiColombo probe. The mission aiming to provide resourceful information regarding the fo…", "url": "https://www.dualdove.com/bepicolombo-captured-a-couple-of-images-of-the-earth-while-heading-towards-mercury/9742/", "urlToImage": null, "publishedAt": "2020-04-26T07:52:30Z", "content": "The European Space Agency has recently published a series of impressive images of the Earth captured by the BepiColombo probe. The mission aiming to provide resourceful information regarding the formation and evolution of Mercury started in 2018.\r\nTwo years h… [+1721 chars]"}, {"source": {"id": null, "name": "Thecantonsentinel.com"}, "author": "Loreal Delmont", "title": "Sales Revenue of Duchenne Muscular Dystrophy to escalate in the Coming Years Owing to Changes in Market Dynamics During COVID-19 Pandemic - The Canton Independent Sentinel", "description": "Duchenne Muscular Dystrophy Market Segmentation- The Duchenne Muscular Dystrophy Market study offers an in-depth analysis of the current market trends influencing this business vertical. The study also includes market valuation, market size, revenue forecasts…", "url": "https://thecantonsentinel.com/uncategorized/44660/sales-revenue-of-duchenne-muscular-dystrophy-to-escalate-in-the-coming-years-owing-to-changes-in-market-dynamics-during-covid-19-pandemic/", "urlToImage": null, "publishedAt": "2020-04-26T07:50:00Z", "content": "Duchenne Muscular Dystrophy Market Segmentation-\r\nThe Duchenne Muscular Dystrophy Market study offers an in-depth analysis of the current market trends influencing this business vertical. The study also includes market valuation, market size, revenue forecast… [+5812 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Before becoming frozen wasteland, Antarctica was home to frogs - CGTN", "description": "At the time when the little frog was hopping around and dining on insects, ice sheets were already forming in the highlands within the interior of Antarctica.", "url": "https://news.cgtn.com/news/2020-04-26/Before-becoming-frozen-wasteland-Antarctica-was-home-to-frogs-Q0eMPNz0I0/index.html", "urlToImage": null, "publishedAt": "2020-04-26T07:46:15Z", "content": "When paleontologist Thomas Mors was peering into a microscope while sorting through tiny 40 million-year-old fossils unearthed on Seymour Island near the tip of the Antarctic Peninsula, he came across quite a surprise hip and skull bones of a frog.\r\nThe littl… [+2705 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": null, "title": "50 Years Ago, 3 Astronauts Survived Apollo 13. Could It Happen Again? - Pulse Live Kenya", "description": "(Science Times)", "url": "https://www.nytimes.com/2020/04/12/science/apollo-13-anniversary.html", "urlToImage": null, "publishedAt": "2020-04-26T06:06:42Z", "content": "Apollo 13 almost killed three NASA astronauts.\r\nHow much safer will it be the next time that people head to the moon, more than 50 years later?\r\nWill it indeed be safer?\r\nSafer, yes, said Douglas O. Stanley, president and executive director of the National In… [+11680 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "ELIZABETH ANNE BROWN, The Asheville Citizen-Times", "title": "Bear hibernates under Asheville house, charms neighbors | News - Uniontown Herald Standard", "description": "ASHEVILLE, N.C. (AP) — At first, Haw Creek resident Ann McNamara thought she had a raccoon in her crawl space. There was a persistent scratching sound from beneath the floorboards,", "url": "https://apnews.com/8088f1ad9639ebd48163a01050e56ca4", "urlToImage": null, "publishedAt": "2020-04-26T04:01:14Z", "content": "ASHEVILLE, N.C. (AP) At first, Haw Creek resident Ann McNamara thought she had a raccoon in her crawl space. There was a persistent scratching sound from beneath the floorboards, and every once in a while her dog would stand stock-still and then tremble.\r\nShe… [+3884 chars]"}, {"source": {"id": null, "name": "Abc13.com"}, "author": null, "title": "NASA Astronaut Andrew Morgan welcomed back to Earth with parade in Friendswood - KTRK-TV", "description": "Welcome home, Dr. Morgan! 🌎", "url": "https://abc13.com/friendswood-parade-nasa-astronaut-andrew-morgan-back-on-earth/6129564/", "urlToImage": null, "publishedAt": "2020-04-26T00:22:43Z", "content": "FRIENDSWOOD, Texas (KTRK) -- NASA Astronaut Andrew Morgan was welcomed back to Earth with a homecoming celebration.Morgan's friends and family gathered to celebrate with a street parade in his home in Friendswood.\r\nDr. Morgan returned back to Earth on April 1… [+260 chars]"}, {"source": {"id": null, "name": "Eurasiareview.com"}, "author": "https://www.eurasiareview.com/author/admin/", "title": "An Eclipsing Binary Millisecond Pulsar Discovered By FAST - Eurasia Review", "description": "Using the data obtained by the Five-hundred-meter Aperture Spherical radio Telescope (FAST), a research team led by Prof. PAN Zhichen and Prof. LI Di from the National Astronomical Observatories of…", "url": "https://www.eurasiareview.com/26042020-an-eclipsing-binary-millisecond-pulsar-discovered-by-fast/", "urlToImage": null, "publishedAt": "2020-04-25T22:26:00Z", "content": "Using the data obtained by the Five-hundred-meter Aperture Spherical radio Telescope (FAST), a research team led by Prof. PAN Zhichen and Prof. LI Di from the National Astronomical Observatories of the Chinese Academy of Sciences (NAOC) discovered an eclipsin… [+1881 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": null, "title": "SpaceX already preparing for next crew mission to ISS ahead of May test run - South China Morning Post", "description": "The mission will be the first time astronauts will launch from the United States on any mission since the end of the space shuttle programme in 2011.", "url": "https://www.scmp.com/news/world/united-states-canada/article/3081575/spacex-already-preparing-next-crew-mission-iss", "urlToImage": null, "publishedAt": "2020-04-25T22:13:31Z", "content": "Published: 5:34am, 26 Apr, 2020\r\nUpdated: 5:34am, 26 Apr, 2020"}, {"source": {"id": null, "name": "Newsinfopark.com"}, "author": "NIP Web Desk Team", "title": "Controversial Discovery Says Origins of Human Language Existed 25 Million Years Ago - News Info Park", "description": "(SolStock/E+/Getty Images) CARLY CASSELLA 25 APRIL 2020 A structure critical to our brain's core language pathway, found only in humans and apes, has now also been identified in monkeys, according to", "url": "https://newsinfopark.com/science/2020-04-25/article/controversial-discovery-says-origins-of-human-language-existed-25-million-years-ago-19201/nip-web-desk-team/", "urlToImage": null, "publishedAt": "2020-04-25T22:10:47Z", "content": "A structure critical to our brain’s core language pathway, found only in humans and apes, has now also been identified in monkeys, according to a controversial new study – suggesting the origins of language may have appeared 20 to 25 million years earlier tha… [+4838 chars]"}, {"source": {"id": null, "name": "Voanews.com"}, "author": "VOA Learning English", "title": "Scientists Study Unusual Comet - VOA Learning English", "description": "Amateur astronomer Gennady Borisov was the first person to identify a new comet in August of 2019. Researchers reported on Monday that gas coming off the comet, 2I/Borisov, had high levels of carbon monoxide - far more than comets formed in our solar system.", "url": "https://learningenglish.voanews.com/a/scientists-study-unusual-comet-/5384347.html", "urlToImage": null, "publishedAt": "2020-04-25T21:58:00Z", "content": "Scientists recently reported new details about the second interstellar object ever seen passing through our solar system. It is a comet called 2I/Borisov.\r\nComets are made up of frozen gases, rock and dust that orbit stars. The Reuters news agency likens them… [+3202 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Scientists Find Our Solar System 'Stealing' Interstellar Asteroids - Somag News", "description": "It was found that 19 interstellar asteroids were swallowed by the Solar System. So scientists will not have to look far to observe asteroids. These asteroids are thought to have been swallowed by the Solar System about 4 billion years ago. An international te…", "url": "https://www.somagnews.com/scientists-find-solar-system-stealing-interstellar-asteroids/", "urlToImage": null, "publishedAt": "2020-04-25T19:03:00Z", "content": "It was found that 19 interstellar asteroids were swallowed by the Solar System. So scientists will not have to look far to observe asteroids. These asteroids are thought to have been swallowed by the Solar System about 4 billion years ago.\r\nAn international t… [+2034 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "The Most Dangerous Area of All Time According to Science - Somag News", "description": "Scientists have identified the most dangerous region of all time to live. The area in question has long hosted the deadliest dinosaurs of all time. Imagine you have a time machine. Assume that you can travel anytime and to any region in history. When would yo…", "url": "https://www.somagnews.com/dangerous-area-time-according-science/", "urlToImage": null, "publishedAt": "2020-04-25T18:39:00Z", "content": "Scientists have identified the most dangerous region of all time to live. The area in question has long hosted the deadliest dinosaurs of all time.\r\nImagine you have a time machine. Assume that you can travel anytime and to any region in history. When would y… [+2021 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "The Great Space Escape: Scientists Learn How Light Can Flee From Black Hole 'Like Boomerang' - Sputnik International", "description": "The scientists' discovery may potentially help them to learn more about the nature of black holes, such as the rotation speed of these space objects.", "url": "https://sputniknews.com/science/202004251079093023-the-great-space-escape-scientists-learn-how-light-can-flee-from-black-hole-like-a-boomerang/", "urlToImage": null, "publishedAt": "2020-04-25T18:31:30Z", "content": "The scientists' discovery may potentially help them to learn more about the nature of black holes, such as the rotation speed of these space objects.Having examined archived X-ray observation data of a black hole whose mass is about ten times that of the Sun … [+1560 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Callum Hoare", "title": "'Universe is unstable!' How Brian Cox revealed world could end 'at any moment' - Express.co.uk", "description": "THE END OF THE WORLD could happen 'at any moment' according to the chilling claims of a scientist, after Brian Cox revealed why the 'universe is unstable'.", "url": "https://www.express.co.uk/news/science/1273858/end-of-the-world-brian-cox-universe-unstable-vacuum-decay-space-news-spt", "urlToImage": null, "publishedAt": "2020-04-25T17:54:00Z", "content": null}, {"source": {"id": null, "name": "Investrecords.com"}, "author": "admin", "title": "The Most Important Image Ever Taken By NASA's Hubble Space Telescope - Invest Records", "description": "One peek into a small part of the sky, one giant leap back in time. This small patch of sky... [+] represents less than 1/100,000,000th of the volume of the Universe, but reveals nearly 1,000 galaxies", "url": "https://www.investrecords.com/the-most-important-image-ever-taken-by-nasas-hubble-space-telescope/", "urlToImage": null, "publishedAt": "2020-04-25T17:36:08Z", "content": "One peek into a small part of the sky, one giant leap back in time. This small patch of sky… [+] represents less than 1/100,000,000th of the volume of the Universe, but reveals nearly 1,000 galaxies that had never been seen before. This small fraction of the … [+7400 chars]"}, {"source": {"id": null, "name": "Ibtimes.sg"}, "author": "https://www.ibtimes.sg/reporters/jeevan-biswas", "title": "Scientists identify the 'most dangerous place' in the history of earth, once home to fearsome predators - International Business Times, Singapore Edition", "description": "According to the researchers, the area around south-eastern Morocco was home to predators such as Carcharodontosaurus, Pterosaurs and freshwater sharks 100 million years ago", "url": "https://www.ibtimes.sg/scientists-identify-most-dangerous-place-history-earth-once-home-fearsome-predators-43789", "urlToImage": null, "publishedAt": "2020-04-25T16:43:56Z", "content": "If one was asked which was the most dangerous place in the history of the planet, what would their answer be? Not many can answer that question. However, an international team of scientists has identified such a place a predator-ridden Morocco 100 million yea… [+3056 chars]"}, {"source": {"id": null, "name": "Digitaltrends.com"}, "author": "Georgina Torbet", "title": "NASA’s Perseverance rover is perfectly balanced for its trip to Mars - Digital Trends", "description": "NASA's Perseverance rover is preparing for its launch to Mars has just made it through one more item on the list: Ensuring that it is correctly balanced.", "url": "https://www.digitaltrends.com/news/nasa-perseverance-rover-balance/", "urlToImage": null, "publishedAt": "2020-04-25T16:00:25Z", "content": "NASA’s Perseverance rover is preparing for launch in the next few months by undergoing final checks, and it has just made it through one more item on the list: Ensuring that it is correctly balanced.\r\nPart of the final preparations for readying the rover for … [+1853 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Dutch Tulip Fields Come Into Bloom in Stunning Satellite Images - SciTechDaily", "description": "While the COVID-19 virus pandemic is forcing everybody to stay at home, we bring you these beautiful views from space of the Dutch tulip fields coming into bloom. Captured by the Copernicus Sentinel-2 mission on April 5, April 10, April 15 and April 20, 2020,…", "url": "https://scitechdaily.com/dutch-tulip-fields-come-into-bloom-in-stunning-satellite-images/", "urlToImage": null, "publishedAt": "2020-04-25T14:03:13Z", "content": "While the COVID-19 virus pandemic is forcing everybody to stay at home, we bring you these beautiful views from space of the Dutch tulip fields coming into bloom. Captured by the Copernicus Sentinel-2 mission on April 5, April 10, April 15 and April 20, 2020,… [+1633 chars]"}, {"source": {"id": null, "name": "Nationeditions.com"}, "author": "Akshay Tiwari", "title": "Moon Uncovered: View The Updated Lunar Map Coded By Colors & Packed Including Exciting Data On Topolog ... - NationEditions", "description": "The Moon has consistently been loaded up with riddles, even with the entirety of man's endeavours to investigate and find its insider facts. As of late, be that as it may, researchers have shared the work they called \"Brought together Geologic Map of the Moon…", "url": "https://nationeditions.com/moon-uncovered-view-the-updated-lunar-map-coded-by-colors-packed-including-exciting-data-on-topology-rock-layers/", "urlToImage": null, "publishedAt": "2020-04-25T12:44:00Z", "content": "The Moon has consistently been loaded up with riddles, even with the entirety of man’s endeavours to investigate and find its insider facts. \r\nAs of late, be that as it may, researchers have shared the work they called “Brought together Geologic Map of the Mo… [+2901 chars]"}, {"source": {"id": null, "name": "Newkerala.com"}, "author": null, "title": "Atmospheric tidal waves maintain Venus super-rotation - New Kerala", "description": "Images from the Akatsuki spacecraft unveil what keeps Venuss atmosphere rotating much faster than the planet itself....", "url": "https://www.newkerala.com/news/2020/72955.htm", "urlToImage": null, "publishedAt": "2020-04-25T12:09:54Z", "content": "ANI | Washington D.C. , April 25 Images from the Akatsuki spacecraft unveil what keeps Venus's atmosphere rotating much faster than the planet itself.An international research team led by Takeshi Horinouchi of Hokkaido University has revealed that this 'super… [+2878 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Ciaran McGrath", "title": "Kilauea shock: Was THIS the reason for 2018 Hawaii volcano eruption? - Express.co.uk", "description": "THE spectacular Kilauea volcanic eruption of 2018, which resulted in the destruction of hundreds of homes, and the evacuation of thousands of people, may have been triggered in part by unusually high rainfall levels, a new study has suggested.", "url": "https://www.express.co.uk/news/science/1272403/kilauea-volcano-eruption-hawaii-big-island-2018-rainfall", "urlToImage": null, "publishedAt": "2020-04-25T09:30:00Z", "content": null}, {"source": {"id": null, "name": "Salisburyjournal.co.uk"}, "author": "Press Association 2020", "title": "Russian cargo ship docks with space station - Salisbury Journal", "description": "The Progress MS-14 spacecraft docked at 0512 GMT on Saturday, about three-and-a-half hours after blasting off from Kazakhstan.", "url": "https://www.salisburyjournal.co.uk/news/national/18405361.russian-cargo-ship-docks-space-station/", "urlToImage": null, "publishedAt": "2020-04-25T07:51:00Z", "content": "An unmanned Russian cargo capsule has arrived at the International Space Station with more than two tons of supplies for the three-man crew.\r\nThe Progress MS-14 spacecraft docked at 0512 GMT on Saturday, about three-and-a-half hours after blasting off from Ru… [+417 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Gursimran Hans", "title": "Trump’s new US Space Force to deploy surveillance telescope in Australia - Express.co.uk", "description": "THE US plans to construct a specialist space surveillance telescope at a facility in Western Australia.", "url": "https://www.express.co.uk/news/science/1273676/Space-news-USA-Australia-telescope-spy-track-debris-satellites", "urlToImage": null, "publishedAt": "2020-04-25T03:21:00Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Sean Keach", "title": "Elon Musk’s Starlink Satellites branded ‘space junk that blocks night sky’ – but he wants to put 40,000 in orb - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11447265/elon-musk-starlink-satellites-night-sky-block-orbit-how-many/", "urlToImage": null, "publishedAt": "2020-04-21T17:05:48Z", "content": "ELON Musk has launched hundreds of Starlink 'internet satellites' into space but critics say he's flooding Earth's orbit with 'space junk'.\r\nThe billionaire space mogul's probes have proved highly controversial, but Musk still plans to launch tens of thousand… [+6649 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nTelegraph Reporters", "title": "Meteor showers to watch out for in 2020, including the Lyrids - Telegraph.co.uk", "description": "Meteor showers come and go throughout the year, but when can you spot them in 2020?", "url": "https://www.telegraph.co.uk/science/0/lyrid-meteor-shower-2020-peak-uk-when-what-how-watch/", "urlToImage": null, "publishedAt": "2020-04-21T07:53:43Z", "content": "The meteoroids from Halley's Comet strike Earth's atmosphere at a speed of 148,000mph, (238,000kph) burning up in streaking flashes of light that can be seen with the naked eye.\r\nOrionid meteors are known for their speed and brilliance, so if you persevere th… [+4092 chars]"}, {"source": {"id": null, "name": "Travelandleisure.com"}, "author": "Cailey Rizzo", "title": "NASA's Online Game Can Help Save the Coral Reefs — and Your Boredom During Quarantine - Travel + Leisure", "description": "Move over, Animal Crossing.", "url": "https://www.travelandleisure.com/travel-tips/mobile-apps/nasa-nemo-net-coral-reef-mapping-game-quarantine", "urlToImage": null, "publishedAt": "2020-04-20T16:42:22Z", "content": "NASA is calling on gamers to help map and explore the world’s coral reefs.\r\nIn the game, NASA NeMO-Net, players can can help train a NASA supercomputer to learn more about the ocean floor, with the help of real NASA data to identify and classify corals. Playe… [+1604 chars]"}, {"source": {"id": null, "name": "Tass.com"}, "author": "TASS", "title": "ISS crew evacuated from Soyuz-MS15 on landing - TASS", "description": "The crew has returned to Earth due to the novel coronavirus pandemic", "url": "https://tass.com/science/1146089", "urlToImage": null, "publishedAt": "2020-04-17T06:20:00Z", "content": "MOSCOW, April 17. /TASS/. Roscosmos cosmonaut Oleg Skripochka and NASA astronauts Andrew Morgan and Jessica Meir have been evacuated from the Soyuz MS-15 manned spacecraft, which landed earlier in Kazakhstan, 147 km to the southeast of the city of Zhezqazghan… [+657 chars]"}, {"source": {"id": null, "name": "Travelandleisure.com"}, "author": "Alison Fox", "title": "NASA, Former Astronauts Commemorate the 50th Anniversary of Apollo 13 - Travel + Leisure", "description": "On April 13, 1970, the Apollo 13's lunar landing was aborted in what would become a historic mission.", "url": "https://www.travelandleisure.com/travel-news/apollo-13-mission-50th-anniversary", "urlToImage": null, "publishedAt": "2020-04-14T13:47:15Z", "content": "\"Houston, we've had a problem.\"\r\nFifty years after that famed phrase aboard the Apollo 13 was spoken, legends and institutions of space exploration are taking to a different form of communication to commemorate the historic mission — Twitter.\r\n“They were coas… [+3223 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "Nihonium makes its way into The Periodic Table with 3 other Elements - http://www.newsgram.com/", "description": "4 new elements were discovered late last year and will be added to the Periodic Table. Nihonium is the first element to be discovered in an Asian country.", "url": "https://www.newsgram.com/nihonium-makes-its-way-into-the-periodic-table-with-3-other-elements/", "urlToImage": null, "publishedAt": "2017-06-14T01:38:24Z", "content": "BY VISHAL GULATI\r\nBird photography as a hobby and profession has taken off to a major extent in India. It has led to important discoveries of species not previously known from the country, a globally renowned ornithologist said on Sunday.\r\nIn his latest paper… [+4613 chars]"}]}