{"status": "ok", "totalResults": 42, "articles": [{"source": {"id": null, "name": "Jagran.com"}, "author": "James Kuanal", "title": "Ozone layer heals itself as hole over arctic circle closes, confirm scientists: Report - Jagran English", "description": "The ozone layer works as a protective shield as it prevents Sun s ultraviolet rays from entering Earth   Pic credits   SavetheearthB Twitter", "url": "https://english.jagran.com/world/coronavirus-lockdown-ozone-layer-heals-itself-as-hole-over-arctic-circle-closes-confirms-scientists-report-10011145", "urlToImage": null, "publishedAt": "2020-04-26T16:08:22Z", "content": "New Delhi | Jagran Lifestyle Desk: The largest hole in the Ozone layer spreading over 1 million square kilometers above the Arctic caused due to unusual atmospheric conditions has closed, said a report published in the week.in. The hole was first identified b… [+2093 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Neha", "title": "Tectonic plates started shifting 3.2 billion years ago: Study - The Siasat Daily", "description": "New York: The Earth's tectonic plates started moving more than 3.2 billion years ago - just over 1.3 billion years after the Earth first formed and earlier than originally thought, researchers have revealed. To date, some researchers theorised it happened aro…", "url": "https://www.siasat.com/tectonic-plates-started-shifting-3-2-billion-years-ago-study-1880018/", "urlToImage": null, "publishedAt": "2020-04-26T14:00:37Z", "content": "New York: The Earth’s tectonic plates started moving more than 3.2 billion years ago – just over 1.3 billion years after the Earth first formed and earlier than originally thought, researchers have revealed.\r\nTo date, some researchers theorised it happened ar… [+3044 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Neha", "title": "Hubble Space Telescope yields 1.4 mn observations in 3 decades - The Siasat Daily", "description": "Washington: The Hubble Space Telescope, which is now celebrating 30 years of stunning discoveries, has yielded 1.4 million observations and provided data that astronomers around the world have used to write more than 17,000 peer-reviewed scientific publicatio…", "url": "https://www.siasat.com/hubble-space-telescope-yields-1-4-mn-observations-3-decades-1880016/", "urlToImage": null, "publishedAt": "2020-04-26T14:00:33Z", "content": "Washington: The Hubble Space Telescope, which is now celebrating 30 years of stunning discoveries, has yielded 1.4 million observations and provided data that astronomers around the world have used to write more than 17,000 peer-reviewed scientific publicatio… [+2845 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "NASA develops low-cost ventilator to fight coronavirus - Northeast Now", "description": "NASA engineers have designed a new low-cost high-pressure ventilator tailored to treat coronavirus patients. The device, called VITAL (Ventilator Intervention Technology Accessible Locally), passed a critical test on April 21 at the Icahn School of Medicine a…", "url": "https://nenow.in/health/nasa-develops-low-cost-ventilator-to-fight-coronavirus.html/", "urlToImage": null, "publishedAt": "2020-04-26T13:42:22Z", "content": "NASA engineers have designed a new low-cost high-pressure ventilator tailored to treat coronavirus patients.\r\nThe device, called VITAL (Ventilator Intervention Technology Accessible Locally), passed a critical test on April 21 at the Icahn School of Medicine … [+1301 chars]"}, {"source": {"id": null, "name": "Orissapost.com"}, "author": "Post News Network", "title": "Rare merger of two black holes observed by scientists - OrissaPOST", "description": "Astronauts always crave to witness rare phenomena that can offer new premises for further research. Speaking of rare phenomena and research, there is probably nothing that can be of more interest to astronomers than black holes. Be it the time when it was men…", "url": "https://www.orissapost.com/rare-merger-of-two-black-holes-observed-by-scientists/", "urlToImage": null, "publishedAt": "2020-04-26T12:38:33Z", "content": "Astronauts always crave to witness rare phenomena that can offer new premises for further research. Speaking of rare phenomena and research, there is probably nothing that can be of more interest to astronomers than black holes.\r\nBe it the time when it was me… [+1382 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Christopher Wanjek", "title": "How Space Travel Tries to Kill You and Make You Ugly - WIRED", "description": "Oh also, it makes you blind and stupid, too.", "url": "https://www.wired.com/story/how-space-tries-kill-you-make-you-ugly/", "urlToImage": null, "publishedAt": "2020-04-26T11:40:53Z", "content": "Of these 34 risks, three are potential showstoppers: radiation, gravity (or lack thereof), and the need for surgery or a complicated medical procedure.\r\nLets explore the gravity issue.\r\nSome science fiction writers in the mid-20th century speculated that zero… [+3425 chars]"}, {"source": {"id": null, "name": "Digitaltrends.com"}, "author": "Georgina Torbet", "title": "Starlink beta could begin within 3 months, according to Elon Musk - Digital Trends", "description": "SpaceX could begin beta testing its Starlink global satellite internet program within a few months, according to CEO Elon Musk, starting with a private beta.", "url": "https://www.digitaltrends.com/news/starlink-beta-program-first-details/", "urlToImage": null, "publishedAt": "2020-04-26T10:26:21Z", "content": "SpaceX could begin beta testing its Starlink global satellite internet program within a few months, according to CEO Elon Musk.\r\nIn a tweet this week, Musk revealed that the Starlink private beta will begin within approximately three months, with the public b… [+2428 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "How runny a liquid can be? - Tech Explorist", "description": "Viscosity (η) is the resistance of a liquid to flow. Liquids get thicker when cooled and runnier when heated, but how runny can a liquid ever get if we", "url": "https://www.techexplorist.com/runny-liquid/31826/", "urlToImage": null, "publishedAt": "2020-04-26T09:47:18Z", "content": "Viscosity () is the resistance of a liquid to flow. Liquids get thicker when cooled and runnier when heated, but how runny can a liquid ever get if we keep heating it?\r\nAt a point, the liquid reaches a specific temperature; it transitions between the liquid-l… [+3341 chars]"}, {"source": {"id": null, "name": "Interestingengineering.com"}, "author": "Loukia Papadopoulos", "title": "China's Mars Mission Is Called \"Tianwen 1,\" Meaning \"Quest for Heavenly Truth\" - Interesting Engineering", "description": "CNSA is on track for its first Mars mission.", "url": "https://interestingengineering.com/chinas-new-mars-mission-is-called-tianwen-1-meaning-quest-for-heavenly-truth", "urlToImage": null, "publishedAt": "2020-04-26T09:23:52Z", "content": "On Friday, the China National Space Administration (CNSA) revealed in a statement the name of its new Mars mission. The ambitious mission is set to be named \"Tianwen 1\" after the country's planetary exploration program \"Tianwen,\" which means \"quest for heaven… [+1758 chars]"}, {"source": {"id": null, "name": "Indianweb2.com"}, "author": "Vardaan", "title": "An Asteroid \"Coming Near Earth\" Looks Like It's Wearing A Face Mask - IndianWeb2.com", "description": "", "url": "https://www.indianweb2.com/2020/04/26/an-asteroid-coming-near-earth-looks-like-its-wearing-a-face-mask/", "urlToImage": null, "publishedAt": "2020-04-26T09:21:47Z", "content": "The Arecibo Observatory, a radio telescope in Puerto Rico, is tracking an asteroid which is approaching Earth this week and while it poses no threat, the asteroid somehow appears to know this planet of humans is facing a pandemic.\r\nThe University of Central F… [+1510 chars]"}, {"source": {"id": null, "name": "Enter21st.com"}, "author": null, "title": "This Image of Jupiter Looks like a Piece of Modern Art - Enter21st", "description": "NASA is understood to watch totally different planets in our Solar System within the hopes of creating some shocking discoveries concerning the universe. One of the numerous missions of NASA is to watch the largest planet within the Solar System – Jupiter. Th…", "url": "https://enter21st.com/this-image-of-jupiter-looks-like-a-piece-of-modern-art/", "urlToImage": null, "publishedAt": "2020-04-26T09:05:46Z", "content": "NASA is understood to watch totally different planets in our Solar System within the hopes of creating some shocking discoveries concerning the universe. One of the numerous missions of NASA is to watch the largest planet within the Solar System Jupiter. The … [+1846 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu Net Desk", "title": "Watch | Great Barrier Reef suffers third major bleaching event - The Hindu", "description": "A video on the Great Barrier Reef that suffered its worst mass coral bleaching event in recent years", "url": "https://www.thehindu.com/sci-tech/energy-and-environment/great-barrier-reef-suffers-massive-coral-bleaching/article31436663.ece", "urlToImage": null, "publishedAt": "2020-04-26T08:05:58Z", "content": "The Great Barrier Reef, the worlds largest coral reef ecosystem located in Australia, recently experienced its third major bleaching event in five years.\r\nIt is considered to be the most widespread coral bleaching event on record, owing to the rise in tempera… [+619 chars]"}, {"source": {"id": null, "name": "Thecantonsentinel.com"}, "author": "Loreal Delmont", "title": "Sales Revenue of Duchenne Muscular Dystrophy to escalate in the Coming Years Owing to Changes in Market Dynamics During COVID-19 Pandemic - The Canton Independent Sentinel", "description": "Duchenne Muscular Dystrophy Market Segmentation- The Duchenne Muscular Dystrophy Market study offers an in-depth analysis of the current market trends influencing this business vertical. The study also includes market valuation, market size, revenue forecasts…", "url": "https://thecantonsentinel.com/uncategorized/44660/sales-revenue-of-duchenne-muscular-dystrophy-to-escalate-in-the-coming-years-owing-to-changes-in-market-dynamics-during-covid-19-pandemic/", "urlToImage": null, "publishedAt": "2020-04-26T07:50:00Z", "content": "Duchenne Muscular Dystrophy Market Segmentation-\r\nThe Duchenne Muscular Dystrophy Market study offers an in-depth analysis of the current market trends influencing this business vertical. The study also includes market valuation, market size, revenue forecast… [+5812 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Before becoming frozen wasteland, Antarctica was home to frogs - CGTN", "description": "At the time when the little frog was hopping around and dining on insects, ice sheets were already forming in the highlands within the interior of Antarctica.", "url": "https://news.cgtn.com/news/2020-04-26/Before-becoming-frozen-wasteland-Antarctica-was-home-to-frogs-Q0eMPNz0I0/index.html", "urlToImage": null, "publishedAt": "2020-04-26T07:46:15Z", "content": "When paleontologist Thomas Mors was peering into a microscope while sorting through tiny 40 million-year-old fossils unearthed on Seymour Island near the tip of the Antarctic Peninsula, he came across quite a surprise hip and skull bones of a frog.\r\nThe littl… [+2705 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Astronomers find 'alien' asteroids living in our solar system - CNN", "description": "Scientists In the last few years have studied the first observed interstellar visitors to our solar system. They include a comet called 2I/Borisov, spotted in 2019 and still passing through, and an asteroid called 'Oumuamua that zipped through quickly in 2017.", "url": "https://www.cnn.com/2020/04/26/world/alien-asteroids-solar-system-scn-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-26T05:04:00Z", "content": "(CNN)Scientists In the last few years have studied the first observed interstellar visitors to our solar system. They include a comet called 2I/Borisov, spotted in 2019 and still passing through, and an asteroid called 'Oumuamua that zipped through quickly in… [+4388 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": null, "title": "SpaceX already preparing for next crew mission to ISS ahead of May test run - South China Morning Post", "description": "The mission will be the first time astronauts will launch from the United States on any mission since the end of the space shuttle programme in 2011.", "url": "https://www.scmp.com/news/world/united-states-canada/article/3081575/spacex-already-preparing-next-crew-mission-iss", "urlToImage": null, "publishedAt": "2020-04-25T22:13:31Z", "content": "Published: 5:34am, 26 Apr, 2020\r\nUpdated: 5:34am, 26 Apr, 2020"}, {"source": {"id": null, "name": "Voanews.com"}, "author": "VOA Learning English", "title": "Scientists Study Unusual Comet - VOA Learning English", "description": "Amateur astronomer Gennady Borisov was the first person to identify a new comet in August of 2019. Researchers reported on Monday that gas coming off the comet, 2I/Borisov, had high levels of carbon monoxide - far more than comets formed in our solar system.", "url": "https://learningenglish.voanews.com/a/scientists-study-unusual-comet-/5384347.html", "urlToImage": null, "publishedAt": "2020-04-25T21:58:00Z", "content": "Scientists recently reported new details about the second interstellar object ever seen passing through our solar system. It is a comet called 2I/Borisov.\r\nComets are made up of frozen gases, rock and dust that orbit stars. The Reuters news agency likens them… [+3202 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Peter Stubley", "title": "First credible evidence emerges of person being killed by meteor - The Independent", "description": "Researchers find official records documenting fatal strike in Iraq in 1888", "url": "https://www.independent.co.uk/news/science/meteor-man-death-first-person-killed-iraq-turkey-ottoman-empire-a9484231.html", "urlToImage": null, "publishedAt": "2020-04-25T20:00:42Z", "content": "The odds of being struck and killed by a meteorite are said to be as low as one in 250,000.\r\nThere has been no credible and well-documented evidence of any human being befalling this unfortunate fate.\r\nBut researchers now say they have found three separate of… [+16481 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "The Great Space Escape: Scientists Learn How Light Can Flee From Black Hole 'Like Boomerang' - Sputnik International", "description": "The scientists' discovery may potentially help them to learn more about the nature of black holes, such as the rotation speed of these space objects.", "url": "https://sputniknews.com/science/202004251079093023-the-great-space-escape-scientists-learn-how-light-can-flee-from-black-hole-like-a-boomerang/", "urlToImage": null, "publishedAt": "2020-04-25T18:31:30Z", "content": "The scientists' discovery may potentially help them to learn more about the nature of black holes, such as the rotation speed of these space objects.Having examined archived X-ray observation data of a black hole whose mass is about ten times that of the Sun … [+1560 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Neha", "title": "Atmospheric tidal waves maintain Venus’ super-rotation - The Siasat Daily", "description": "Washington D.C.: Images from the Akatsuki spacecraft unveil what keeps Venus's atmosphere rotating much faster than the planet itself. An international research team led by Takeshi Horinouchi of Hokkaido University has revealed that this 'super-rotation' is m…", "url": "https://www.siasat.com/atmospheric-tidal-waves-maintain-venus-super-rotation-1879546/", "urlToImage": null, "publishedAt": "2020-04-25T14:08:23Z", "content": "Washington D.C.: Images from the Akatsuki spacecraft unveil what keeps Venus’s atmosphere rotating much faster than the planet itself.\r\nAn international research team led by Takeshi Horinouchi of Hokkaido University has revealed that this ‘super-rotation’ is … [+3082 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Dutch Tulip Fields Come Into Bloom in Stunning Satellite Images - SciTechDaily", "description": "While the COVID-19 virus pandemic is forcing everybody to stay at home, we bring you these beautiful views from space of the Dutch tulip fields coming into bloom. Captured by the Copernicus Sentinel-2 mission on April 5, April 10, April 15 and April 20, 2020,…", "url": "https://scitechdaily.com/dutch-tulip-fields-come-into-bloom-in-stunning-satellite-images/", "urlToImage": null, "publishedAt": "2020-04-25T14:03:13Z", "content": "While the COVID-19 virus pandemic is forcing everybody to stay at home, we bring you these beautiful views from space of the Dutch tulip fields coming into bloom. Captured by the Copernicus Sentinel-2 mission on April 5, April 10, April 15 and April 20, 2020,… [+1633 chars]"}, {"source": {"id": null, "name": "Nationeditions.com"}, "author": "Akshay Tiwari", "title": "Moon Uncovered: View The Updated Lunar Map Coded By Colors & Packed Including Exciting Data On Topolog ... - NationEditions", "description": "The Moon has consistently been loaded up with riddles, even with the entirety of man's endeavours to investigate and find its insider facts. As of late, be that as it may, researchers have shared the work they called \"Brought together Geologic Map of the Moon…", "url": "https://nationeditions.com/moon-uncovered-view-the-updated-lunar-map-coded-by-colors-packed-including-exciting-data-on-topology-rock-layers/", "urlToImage": null, "publishedAt": "2020-04-25T12:44:00Z", "content": "The Moon has consistently been loaded up with riddles, even with the entirety of man’s endeavours to investigate and find its insider facts. \r\nAs of late, be that as it may, researchers have shared the work they called “Brought together Geologic Map of the Mo… [+2901 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "Scientists discovered ‘the most dangerous place in history’ on Earth - Tech Explorist", "description": "100 million years ago, ferocious predators, including flying reptiles and crocodile-like hunters, made the Sahara the most dangerous place on Earth.", "url": "https://www.techexplorist.com/scientists-discovered-most-dangerous-place-earth/31814/", "urlToImage": null, "publishedAt": "2020-04-25T12:35:00Z", "content": "A new study by the University of Portsmouth has provided a window into Africa’s Age of Dinosaurs. They reviewed almost 100 years of fossil vertebrates from an area of Cretaceous rock formations in south-eastern Morocco, known as the Kem Kem Group.\r\nAt that ti… [+2140 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Cosmic Reef: NASA release an image of a blazing starbirth to mark Hubble's 30th birthday - Firstpost", "description": "Hubble has been placed in space to observe the most distant stars and galaxies, as well as planets in our solar system.", "url": "https://www.firstpost.com/tech/science/cosmic-reef-nasa-release-an-image-of-a-blazing-starbirth-to-mark-hubbles-30th-birthday-8299671.html", "urlToImage": null, "publishedAt": "2020-04-25T10:23:08Z", "content": "FP TrendingApr 25, 2020 16:24:11 IST\r\nThe US space agency has released a new bright picture of a firestorm of starbirth to mark the 30th anniversary of the Hubble Space Telescope. Scientists have called the picture Cosmic Reef, as it resembles a coral reef fl… [+1921 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Carly Cassella", "title": "Controversial Discovery Says Origins of Human Language Existed 25 Million Years Ago - ScienceAlert", "description": "A structure critical to our brain's core language pathway, found only in humans and apes, has now also been identified in monkeys, according to a controversial new study - suggesting the origins of language may have appeared 20 to 25 million years ea", "url": "https://www.sciencealert.com/controversial-discovery-in-monkeys-pushes-the-origin-of-human-language-back-25-million-years", "urlToImage": null, "publishedAt": "2020-04-25T09:31:17Z", "content": "A structure critical to our brain's core language pathway, found only in humans and apes, has now also been identified in monkeys, according to a controversial new study - suggesting the origins of language may have appeared 20 to 25 million years earlier tha… [+4838 chars]"}, {"source": {"id": null, "name": "Theweek.in"}, "author": null, "title": "NASA's Perseverance to throw light on geological evolution of the Red Planet - THE WEEK", "description": "Mars rover will collect samples that will be returned to Earth in a future mission", "url": "https://www.theweek.in/news/sci-tech/2020/04/25/nasa-perseverance-throw-light-geological-evolution-red-planet.html", "urlToImage": null, "publishedAt": "2020-04-25T06:22:59Z", "content": "There has been enormous enthusiasm in the space science community since NASA chose Jezero crater as the landing site for its upcoming Mars 2020 rover mission after a five year search.\r\nNASA's Perseverance rover to Mars, expected to launch in July, will look f… [+2949 chars]"}, {"source": {"id": null, "name": "Itechpost.com"}, "author": "iTech Post", "title": "Black Hole Feasts On White Dwarf; X-rays Show It Sucks Up All The Gases And Keeps The Star Close To Feed On - iTech Post", "description": "A white dwarf star treads too close to a black hole, see the fate of the tiny cosmic body and its struggle against the colossus", "url": "http://www.itechpost.com/articles/102433/20200424/black-hole-feasts-white-dwarf-x-rays-show-sucks-up.htm", "urlToImage": null, "publishedAt": "2020-04-25T01:43:00Z", "content": "Black Hole Feasts On White Dwarf; X-rays Show It Sucks Up All The Gases And Keeps The Star Close To Feed On\r\nBlack holes usually devour their prey in an instant, but experts have observed one taking its sweet time in enjoying its meal. One astronomer believes… [+3192 chars]"}, {"source": {"id": null, "name": "Spacenews.com"}, "author": "Jeff Foust", "title": "NASA invited to White House to present coronavirus projects - SpaceNews", "description": "A day after discussing the agency’s coronavirus relief work for the media, NASA took those projects to the White House to show to President Trump.", "url": "https://spacenews.com/nasa-invited-to-white-house-to-present-coronavirus-projects/", "urlToImage": null, "publishedAt": "2020-04-25T00:17:48Z", "content": "WASHINGTON A day after discussing the agencys coronavirus relief work for the media, NASA took those projects to the White House for a presentation to President Donald Trump.\r\nNASA Administrator Jim Bridenstine appeared in the Cabinet Room at the White House … [+1724 chars]"}, {"source": {"id": null, "name": "Interestingengineering.com"}, "author": "Brad  Bergan", "title": "First Known Evidence of Death Caused by Meteorite Impact - Interesting Engineering", "description": "Researchers in Turkey uncovered archived records from 1888 alleging the death of a man from a meteorite.", "url": "https://interestingengineering.com/for-the-first-time-we-have-evidence-of-death-by-meteorite", "urlToImage": null, "publishedAt": "2020-04-25T00:08:42Z", "content": "At last, researchers have discovered credible evidence of someone killed from the fateful fall of a meteorite, reports Science Alert.\r\nRELATED: DIFFERENCE BETWEEN ASTEROIDS AND METEORITES\r\nMeteorite killed a human, Turkish sources say\r\nMultiple documents from… [+3024 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Time Runs Faster On Skyscrapers Than Down There - Researchers - Sputnik International", "description": "The time phenomena can be explained by Einstein's general theory of relativity (GTR), stating that time is dependent on the strength of gravity in the place where it is...", "url": "https://sputniknews.com/science/202004241079086823-time-runs-faster-on-skyscrapers-than-down-there---researchers/", "urlToImage": null, "publishedAt": "2020-04-24T23:05:38Z", "content": null}, {"source": {"id": null, "name": "Thrillist.com"}, "author": "Dustin Nelson", "title": "Venus Will Be the Brightest It’ll Be All Year on April 27 - Thrillist", "description": "It'll be quite bright.", "url": "https://www.thrillist.com/news/nation/venus-bright-tonight-april", "urlToImage": null, "publishedAt": "2020-04-24T22:07:30Z", "content": "Venus is the brightest natural object in our sky after the moon and the sun. If you've looked out the window or enjoyed the spring air after sunset over the last month-plus, you've probably seen it, even if you didn't know you were seeing it. Early in the eve… [+993 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "19 asteroids detected near Jupiter are thought to come from outside the solar system - Somag News", "description": "An international astronomer team thinks that the asteroids moving in an orbit around the Sun near Jupiter, due to the gravity of the Sun, actually came from outside the Solar System. Scientists from France and Brazil are working on 19 asteroids that come from…", "url": "https://www.somagnews.com/19-asteroids-detected-near-jupiter-thought-come-outside-solar-system/", "urlToImage": null, "publishedAt": "2020-04-24T21:01:00Z", "content": "An international astronomer team thinks that the asteroids moving in an orbit around the Sun near Jupiter, due to the gravity of the Sun, actually came from outside the Solar System.\r\nScientists from France and Brazil are working on 19 asteroids that come fro… [+1708 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Amanda Kooser", "title": "Scientists pinpoint 'most dangerous place in the history of planet Earth' - CNET", "description": "A paleontologist says time travelers would not survive long in this predator-packed area of Africa 100 million years ago.", "url": "https://www.cnet.com/news/scientists-pinpoint-most-dangerous-place-in-the-history-of-planet-earth/", "urlToImage": null, "publishedAt": "2020-04-24T19:24:42Z", "content": "This artist's illustration shows a massive dinosaur Carcharodontosaurus with a group of crocodile-like Elosuchus predators near a carcass.\r\nArtwork by Davide Bonadonna\r\nOnce you build your time machine, please do not set your destination for 100 million years… [+1631 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coral Restoration | Education Earth - The Weather Channel", "description": "We spoke with the Georgia Aquarium about how coral reefs are being restored.", "url": "https://www.youtube.com/watch?v=2Z7x0fS8IzM", "urlToImage": null, "publishedAt": "2020-04-24T19:15:49Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Results Just In From Randomized Clinical Trial That Evaluated Chloroquine Diphosphate for COVID-19 - SciTechDaily", "description": "This randomized clinical trial evaluated the safety and efficacy of two chloroquine diphosphate dosages in patients with severe coronavirus disease 2019 (COVID-19). Key Points Question How safe and effective are 2 different regimens of chloroquine diphosphate…", "url": "https://scitechdaily.com/results-just-in-from-randomized-clinical-trial-that-evaluated-chloroquine-diphosphate-for-covid-19/", "urlToImage": null, "publishedAt": "2020-04-24T18:43:29Z", "content": "This randomized clinical trial evaluated the safety and efficacy of two chloroquine diphosphate dosages in patients with severe coronavirus disease 2019 (COVID-19).\r\nKey Points\r\nQuestion How safe and effective are 2 different regimens of chloroquine diphospha… [+4775 chars]"}, {"source": {"id": null, "name": "Nanowerk.com"}, "author": null, "title": "Engineers open door to big new library of nanoparticles - Nanowerk", "description": "A new study expands the landscape of nanomaterials - and what we can do with them.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=55007.php", "urlToImage": null, "publishedAt": "2020-04-24T18:29:54Z", "content": null}, {"source": {"id": null, "name": "Phys.org"}, "author": "Matt Shipman", "title": "Catalyst opens door to more efficient, environmentally friendly ethylene production - Phys.org", "description": "A research team led by North Carolina State University has engineered a new catalyst that can more efficiently convert ethane into ethylene, which is used in a variety of manufacturing processes. The discovery could be used in a conversion process to drastica…", "url": "https://phys.org/news/2020-04-catalyst-door-efficient-environmentally-friendly.html", "urlToImage": null, "publishedAt": "2020-04-24T18:16:56Z", "content": "A research team led by North Carolina State University has engineered a new catalyst that can more efficiently convert ethane into ethylene, which is used in a variety of manufacturing processes. The discovery could be used in a conversion process to drastica… [+2945 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "BCI system gives paralyzed man back his sense of touch with haptic feedback - Ars Technica", "description": "Long-term goal is to develop system that works as well at home as in the laboratory.", "url": "https://arstechnica.com/science/2020/04/bci-system-gives-paralyzed-man-back-his-sense-of-touch-with-haptic-feedback/", "urlToImage": null, "publishedAt": "2020-04-24T17:51:00Z", "content": "Enlarge/ Ian Burkhard suffered a severe spinal cord injury in 2010. Battelle's NeuroLife project is restoring motor function to his right arm with a brain-computer-interface system.\r\n4 with 4 posters participating\r\nIan Burkhart, now 28, had a diving accident … [+7377 chars]"}, {"source": {"id": null, "name": "Tass.com"}, "author": "TASS", "title": "ISS crew evacuated from Soyuz-MS15 on landing - TASS", "description": "The crew has returned to Earth due to the novel coronavirus pandemic", "url": "https://tass.com/science/1146089", "urlToImage": null, "publishedAt": "2020-04-17T06:20:00Z", "content": "MOSCOW, April 17. /TASS/. Roscosmos cosmonaut Oleg Skripochka and NASA astronauts Andrew Morgan and Jessica Meir have been evacuated from the Soyuz MS-15 manned spacecraft, which landed earlier in Kazakhstan, 147 km to the southeast of the city of Zhezqazghan… [+657 chars]"}, {"source": {"id": null, "name": "Travelandleisure.com"}, "author": "Alison Fox", "title": "NASA, Former Astronauts Commemorate the 50th Anniversary of Apollo 13 - Travel + Leisure", "description": "On April 13, 1970, the Apollo 13's lunar landing was aborted in what would become a historic mission.", "url": "https://www.travelandleisure.com/travel-news/apollo-13-mission-50th-anniversary", "urlToImage": null, "publishedAt": "2020-04-14T13:47:15Z", "content": "\"Houston, we've had a problem.\"\r\nFifty years after that famed phrase aboard the Apollo 13 was spoken, legends and institutions of space exploration are taking to a different form of communication to commemorate the historic mission — Twitter.\r\n“They were coas… [+3223 chars]"}, {"source": {"id": null, "name": "Inverse.com"}, "author": "Mike Brown", "title": "How SpaceX Starlink works: price, launch date for Elon Musk's internet - Inverse", "description": "Connecting to Starlink will be really easy, Elon Musk says", "url": "https://www.inverse.com/article/62185-here-s-how-you-will-connect-to-starlink-spacex-s-internet-constellation", "urlToImage": null, "publishedAt": "2020-01-08T19:50:11Z", "content": "Starlink, SpaceXs internet connectivity satellite constellation, is taking form. The project is designed to offer higher speeds and lower latency than competing setups, so long as the receiver can see the satellites in orbit. It could help fund some of CEO El… [+4593 chars]"}]}