{"status": "ok", "totalResults": 29, "articles": [{"source": {"id": null, "name": "Gizbot.com"}, "author": "Sharmishte Datti", "title": "NASA Hubble Telescope Discovers Cosmic Reef From Nearby Galaxy - Gizbot", "description": "With the NASA Hubble Space Telescope, astronomers are able to capture such larger-than-life occurring. On the occasion of the Hubble telescope’s 30th birthday, it has unveiled a stunning new portrait of a firestorm of star birth in a neighboring galaxy.", "url": "https://www.gizbot.com/news/nasa-hubble-telescope-discovers-cosmic-reef-from-nearby-galaxy-067289.html", "urlToImage": null, "publishedAt": "2020-04-26T01:30:00Z", "content": "Cosmic events are something that keeps happening with fiery explosions of gas and radiation. Thanks to telescopes like the NASA Hubble Space Telescope, astronomers are able to capture such larger-than-life occurring. On the occasion of the Hubble telescope's … [+2342 chars]"}, {"source": {"id": null, "name": "Digitaltrends.com"}, "author": "Georgina Torbet", "title": "A Mars simulation crew spent 520 days in confinement. Here are their tips - Digital Trends", "description": "If you're struggling in quarantine right now, you might look for advice from someone like an astronaut who was part of the ESA's Mars500 simulation study.", "url": "https://www.digitaltrends.com/news/mars500-simulation-crew-confinement-tips/", "urlToImage": null, "publishedAt": "2020-04-25T23:19:33Z", "content": "If you’re struggling in quarantine right now, you might look for advice from someone how has survived a truly extreme confinement situation, such as an astronaut who was part of the European Space Agency (ESA)’s Mars500 simulation study.\r\nSimulation missions … [+2691 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": null, "title": "SpaceX already preparing for next crew mission to ISS ahead of May test run - South China Morning Post", "description": "The mission will be the first time astronauts will launch from the United States on any mission since the end of the space shuttle programme in 2011.", "url": "https://www.scmp.com/news/world/united-states-canada/article/3081575/spacex-already-preparing-next-crew-mission-iss", "urlToImage": null, "publishedAt": "2020-04-25T22:13:31Z", "content": "Published: 5:34am, 26 Apr, 2020\r\nUpdated: 5:34am, 26 Apr, 2020"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NASA Builds COVID-19 Ventilator - Newsy", "description": "The agency built a high-pressure ventilator prototype tailored to COVID-19 patients in just 37 days. Learn more about this story at https://www.newsy.com/100...", "url": "https://www.youtube.com/watch?v=G2-M7aIe04o", "urlToImage": null, "publishedAt": "2020-04-25T18:56:27Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Phil Norris, Grace Witherden", "title": "Chance to see Elon Musk’s Starlink satellites in sky later – but you won’t have long - Mirror Online", "description": "Stargazers will have about six minutes to spot Elon Musk’s Starlink satellites tonight with people based in the north more likely to get a good view - here is what time to see it from UK", "url": "https://www.mirror.co.uk/news/uk-news/chance-see-elon-musks-starlink-21926715", "urlToImage": null, "publishedAt": "2020-04-25T18:31:38Z", "content": "Stargazers will get the chance to view Elon Musks Starlink satellites tonight as they pass over the UK but you wont have long to see them.\r\nSpaceX has been launching large batches of satellites as part of its Starlink project to improve global internet covera… [+1860 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Is 2020 the 'Year of the Dragon' for the Red planet? - Telangana Today", "description": "Hyderabad: On Friday, China celebrated its first-ever “China Aerospace Day” commemorating the 50th anniversary of the launch of its first artificial earth satellite, Dongfanghong-1. The China National Space Administration (CNSA) also held an online launching …", "url": "https://telanganatoday.com/is-2020-the-year-of-the-dragon-for-the-red-planet", "urlToImage": null, "publishedAt": "2020-04-25T16:23:00Z", "content": "Hyderabad: On Friday, China celebrated its first-ever China Aerospace Day commemorating the 50th anniversary of the launch of its first artificial earth satellite, Dongfanghong-1. The China National Space Administration (CNSA) also held an online launching ce… [+3510 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Neha", "title": "Atmospheric tidal waves maintain Venus’ super-rotation - The Siasat Daily", "description": "Washington D.C.: Images from the Akatsuki spacecraft unveil what keeps Venus's atmosphere rotating much faster than the planet itself. An international research team led by Takeshi Horinouchi of Hokkaido University has revealed that this 'super-rotation' is m…", "url": "https://www.siasat.com/atmospheric-tidal-waves-maintain-venus-super-rotation-1879546/", "urlToImage": null, "publishedAt": "2020-04-25T14:08:23Z", "content": "Washington D.C.: Images from the Akatsuki spacecraft unveil what keeps Venus’s atmosphere rotating much faster than the planet itself.\r\nAn international research team led by Takeshi Horinouchi of Hokkaido University has revealed that this ‘super-rotation’ is … [+3082 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Cosmic Reef: NASA release an image of a blazing starbirth to mark Hubble's 30th birthday - Firstpost", "description": "Hubble has been placed in space to observe the most distant stars and galaxies, as well as planets in our solar system.", "url": "https://www.firstpost.com/tech/science/cosmic-reef-nasa-release-an-image-of-a-blazing-starbirth-to-mark-hubbles-30th-birthday-8299671.html", "urlToImage": null, "publishedAt": "2020-04-25T10:23:08Z", "content": "FP TrendingApr 25, 2020 16:24:11 IST\r\nThe US space agency has released a new bright picture of a firestorm of starbirth to mark the 30th anniversary of the Hubble Space Telescope. Scientists have called the picture Cosmic Reef, as it resembles a coral reef fl… [+1921 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Siddharth Iyer", "title": "Massive asteroid flying past Earth next week looks like its wearing a face mask - Republic World - Republic World", "description": "Arecibo Observatory in Puerto Rico recently shared an image of an asteroid that looked like it was wearing a 'face mask'. This image has now gone viral online.", "url": "https://www.republicworld.com/entertainment-news/whats-viral/viral-photo-of-face-mask-wearing-asteroid.html", "urlToImage": null, "publishedAt": "2020-04-25T09:06:02Z", "content": "Right now, the world is worried about the COVID-19 pandemic. In fact, people are so worried about the virus that even celestial bodies look like they are wearing face masks. Recently, Arecibo Observatory in Puerto Rico shared an image of a 1.5 kilometres wide… [+2126 chars]"}, {"source": {"id": null, "name": "Theweek.in"}, "author": null, "title": "NASA's Perseverance to throw light on geological evolution of the Red Planet - THE WEEK", "description": "Mars rover will collect samples that will be returned to Earth in a future mission", "url": "https://www.theweek.in/news/sci-tech/2020/04/25/nasa-perseverance-throw-light-geological-evolution-red-planet.html", "urlToImage": null, "publishedAt": "2020-04-25T06:22:59Z", "content": "There has been enormous enthusiasm in the space science community since NASA chose Jezero crater as the landing site for its upcoming Mars 2020 rover mission after a five year search.\r\nNASA's Perseverance rover to Mars, expected to launch in July, will look f… [+2949 chars]"}, {"source": {"id": null, "name": "Defenceaviationpost.com"}, "author": "DefenceAviationPost", "title": "Mining on the Moon by the US, will Space Militarization follow soon? - - Defence Aviation Post", "description": "Last week, through an executive order by the US President Donald Trump, soon NASA is set to mine moon’s water ice and other natural resources. As early as 2015, the US had approved a law allowing Amer", "url": "https://www.defenceaviationpost.com/2020/04/mining-on-the-moon-by-the-us-will-space-militarization-follow-soon/", "urlToImage": null, "publishedAt": "2020-04-24T22:59:02Z", "content": "Last week, through an executive order by the US President Donald Trump, soon NASA is set to mine moons water ice and other natural resources. As early as 2015, the US had approved a law allowing American companies and citizens to use moon and asteroid resourc… [+1063 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "19 asteroids detected near Jupiter are thought to come from outside the solar system - Somag News", "description": "An international astronomer team thinks that the asteroids moving in an orbit around the Sun near Jupiter, due to the gravity of the Sun, actually came from outside the Solar System. Scientists from France and Brazil are working on 19 asteroids that come from…", "url": "https://www.somagnews.com/19-asteroids-detected-near-jupiter-thought-come-outside-solar-system/", "urlToImage": null, "publishedAt": "2020-04-24T21:01:00Z", "content": "An international astronomer team thinks that the asteroids moving in an orbit around the Sun near Jupiter, due to the gravity of the Sun, actually came from outside the Solar System.\r\nScientists from France and Brazil are working on 19 asteroids that come fro… [+1708 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coral Restoration | Education Earth - The Weather Channel", "description": "We spoke with the Georgia Aquarium about how coral reefs are being restored.", "url": "https://www.youtube.com/watch?v=2Z7x0fS8IzM", "urlToImage": null, "publishedAt": "2020-04-24T19:15:49Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "First-ever digital geological map of moon released by US Geological Survey - Down To Earth Magazine", "description": "It will serve as a blue print for future human lunar missions", "url": "https://www.downtoearth.org.in/news/science-technology/first-ever-digital-geological-map-of-moon-released-by-us-geological-survey-70690", "urlToImage": null, "publishedAt": "2020-04-24T15:59:01Z", "content": "The first ever digital, unified, global, geological map of the moon was released virtually by the  United States Geological Survey (USGS), National Aeronautics and Space Administration (Nasa) and the Lunar Planetary Institute on April 22, 2020.\r\nThe map is a … [+2958 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Daniel Garcia-Castellanos", "title": "Tomanowos: The meteorite that survived mega-floods and human folly - Phys.org", "description": "The rock with arguably the most fascinating story on Earth has an ancient name: Tomanowos. It means \"the visitor from heaven\" in the extinct language of Oregon's Clackamas Indian tribe.", "url": "https://phys.org/news/2020-04-tomanowos-meteorite-survived-mega-floods-human.html", "urlToImage": null, "publishedAt": "2020-04-24T14:33:54Z", "content": "The rock with arguably the most fascinating story on Earth has an ancient name: Tomanowos. It means \"the visitor from heaven\" in the extinct language of Oregon's Clackamas Indian tribe.\r\nThe Clackamas revered the Tomanowosalso known as the Willamette meteorit… [+6709 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Viral News Desk", "title": "Trending News Today April 24, 2020: NASA Shares Stunning Night View of Earth Through Fisheye Lens, Beauty of - India.com", "description": "'Our planet still sparkles – just like you do': NASA feeds hope in netizens dealing with COVID-19 gloom by sharing a picture of the earth's night view full of dreamy city lights and starlights", "url": "https://www.india.com/viral/trending-news-today-april-24-2020-nasa-shares-stunning-night-view-of-earth-through-fisheye-lens-beauty-of-the-planet-will-leave-you-mesmerised-4009951/", "urlToImage": null, "publishedAt": "2020-04-24T12:40:33Z", "content": "Dispersing the gloom and distressing news of COVID-19 on our social media feeds, the National Aeronautics and Space Administration recently treated netizens to a night view of the earth and we literally dropped our jaws in awe. Full of dreamy glitters and spa… [+1415 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "James Rodger", "title": "Bodies kept 'in industrial fridges for six days' in Birmingham after dying from coronavirus - Birmingham Live", "description": "He was kept in the fridge due to a \"300 body backlog\" after dying from Covid-19, on date which is widely believed to have been the UK's peak", "url": "https://www.birminghammail.co.uk/news/midlands-news/bodies-kept-in-industrial-fridges-18142998", "urlToImage": null, "publishedAt": "2020-04-24T11:52:15Z", "content": "Nazir Afzal, the former chief prosecutor, has claimed his brother's body was kept in an industrial fridge for days.\r\nMr Afzal said his older brother Umar, aged 71, died in Birmingham on April 8.\r\nHe was kept in the fridge due to a \"300 body backlog\" after dyi… [+1421 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Rosie McCall", "title": "The World is Losing 9 Percent of Its Insects Every Decade, Study Finds - Newsweek", "description": "The most extensive investigation to date finds global insect numbers drop 0.92 percent a year. However, the world's freshwater insects, like mayflies, are bucking the trend and seeing numbers rise.", "url": "https://www.newsweek.com/world-9-percent-insects-decade-study-1499964", "urlToImage": null, "publishedAt": "2020-04-24T11:21:49Z", "content": "Scientists have warned that global insect populations are facing a rapidly accumulating decline in the most extensive analysis to date.\r\nResearchers sifted through more than 166 long-term surveys carried out across 1,676 sites between 1925 and 2018. The found… [+4498 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Lyrid Meteor Shower 2020 Pictures - India Times", "description": "The Lyrid meteor shower appears annually between April 16 and April 25, and tends to peak around April 22 and April 23 in India.", "url": "https://www.indiatimes.com/trending/environment/lyrid-meteor-shower-2020-pictures-511696.html", "urlToImage": null, "publishedAt": "2020-04-24T10:50:23Z", "content": "One of the most dazzling displays of shooting stars was visible in the night sky recently, and it was possible because of the considerable drop in air pollution during the lockdown, and warm weather. The Lyrid meteor shower appears annually between April 16 a… [+1048 chars]"}, {"source": {"id": null, "name": "Therahnuma.com"}, "author": null, "title": "Tectonic plates started shifting 3.2 billion years ago: Study - The Rahnuma Daily", "description": "New York, April 23 (IANS) The Earth’s tectonic plates started moving more than 3.2 billion years ago – just over 1.3 billion years after the Earth first formed and earlier than originally thought, researchers have revealed. To date, some researchers theorised…", "url": "https://www.therahnuma.com/tectonic-plates-started-shifting-3-2-billion-years-ago-study/", "urlToImage": null, "publishedAt": "2020-04-24T07:46:53Z", "content": "This spectacular “blue marble” image of Earth is the most detailed true-color image of the entire Earth till date. (Photo Courtesy: Reto Stockli/NASA Goddard Space Flight Center)\r\nNew York, April 23 (IANS) The Earth’s tectonic plates started moving more than … [+3023 chars]"}, {"source": {"id": null, "name": "Wordlift.io"}, "author": "News Desk", "title": "First successful study to detect marine plastic pollution using satellites - Geospatial World", "description": "Earth observation scientists analysed data from the European Space Agency’s Sentinel-2 satellites to develop this new approach, which demonstrates for the first time that aggregated patches of plastics floating in coastal waters can be detected by satellites", "url": "http://data.wordlift.io/wl01287/post/first_successful_study_to_detect_marine_plastic_pollution_using_satellites", "urlToImage": null, "publishedAt": "2020-04-24T06:26:00Z", "content": "A pioneering technique to detect plastics floating on the sea surface, led by scientists at Plymouth Marine Laboratory, has been published this week in Scientific Reports.\r\nEarth observation scientists analysed data from the European Space Agencys Sentinel-2 … [+3447 chars]"}, {"source": {"id": null, "name": "Tass.com"}, "author": "TASS", "title": "Soyuz MS-15 with 3 ISS crew members lands in Kazakhstan - TASS", "description": "The crew has returned to Earth due to the novel coronavirus pandemic", "url": "https://tass.com/science/1146081", "urlToImage": null, "publishedAt": "2020-04-17T05:51:51Z", "content": "MOSCOW, April 17. /TASS/. The Soyuz MS-15 manned spacecraft with three International Space Station (ISS) crewmembers on board has landed in Kazakhstan, 147 km to the southeast of the city of Zhezqazghan, Russian state space corporation Roscosmos chief Dmitry … [+748 chars]"}, {"source": {"id": null, "name": "Travelandleisure.com"}, "author": "Alison Fox", "title": "NASA, Former Astronauts Commemorate the 50th Anniversary of Apollo 13 - Travel + Leisure", "description": "On April 13, 1970, the Apollo 13's lunar landing was aborted in what would become a historic mission.", "url": "https://www.travelandleisure.com/travel-news/apollo-13-mission-50th-anniversary", "urlToImage": null, "publishedAt": "2020-04-14T13:47:15Z", "content": "\"Houston, we've had a problem.\"\r\nFifty years after that famed phrase aboard the Apollo 13 was spoken, legends and institutions of space exploration are taking to a different form of communication to commemorate the historic mission — Twitter.\r\n“They were coas… [+3223 chars]"}, {"source": {"id": null, "name": "Tass.com"}, "author": "TASS", "title": "Russia’s Soyuz MS-16 spacecraft with three crewmembers docks with space station - TASS", "description": "Cosmonaut Ivanishin earlier said that the International Space Station would be the safest place during the coronavirus pandemic on the Earth", "url": "https://tass.com/science/1142503", "urlToImage": null, "publishedAt": "2020-04-09T15:08:23Z", "content": "MOSCOW, April 9. /TASS/. Russia’s Soyuz MS-16 manned spacecraft with three crewmembers docked to the Poisk module of the International Space Station (ISS) in the automatic mode, the State Space Corporation Roscosmos announced in its live broadcast on Thursday… [+1518 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET EnergyWorld", "title": "'Novel CO2 capturing tech may cut vehicle emissions by 90 per cent' - ETEnergyworld.com", "description": "They propose to capture CO2 and convert it from a gas to a liquid in a process that recovers most of energy available onboard, such as heat from the engine", "url": "https://energy.economictimes.indiatimes.com/news/oil-and-gas/novel-co2-capturing-tech-may-cut-vehicle-emissions-by-90pc/72953449", "urlToImage": null, "publishedAt": "2019-12-24T10:10:27Z", "content": "Geneva: Scientists have developed a new technology that could cut carbon dioxide emissions from trucks and buses by almost 90 per cent by capturing CO2 within the exhaust system, converting it into a liquid and storing it on the vehicle. The liquid CO2 would … [+2262 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Will the Future Run on Moon Power? India's Space Agency Bets Yes. - IndustryWeek", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMigAFodHRwczovL3d3dy5pbmR1c3RyeXdlZWsuY29tL3RlY2hub2xvZ3ktYW5kLWlpb3QvYXJ0aWNsZS8yMjAyNTg3Mi93aWxsLXRoZS1mdXR1cmUtcnVuLW9uLW1vb24tcG93ZXItaW5kaWFzLXNwYWNlLWFnZW5jeS1iZXRzLXllc9IBAA?oc=5", "urlToImage": null, "publishedAt": "2019-12-13T23:25:34Z", "content": null}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "Moon May Have Harboured Life 4 Billion Years Ago, Research Suggests - http://www.newsgram.com/", "description": "While the Moon is presently unsuitable for habitation, there could have been life on its surface about four billion years ago, researchers have suggested.", "url": "https://www.newsgram.com/moon-may-harboured-life-4-billion-years-ago-research-suggests/", "urlToImage": null, "publishedAt": "2018-07-25T05:09:47Z", "content": "People can keep wearing contact lenses during the coronavirus (COVID-19) pandemic, as long as they observe good hand hygiene and follow appropriate wear-and-care directions, say researchers.\r\nThe study delves into multiple aspects of eye health amidst the glo… [+2551 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "NASA releases its latest Global maps of Earth at Night, provides clearest patterns of Human Settlement across the Planet - http://www.newsgram.com/", "description": "NASA has released its latest global maps of Earth at night, providing the \"clearest yet composite\" view of patterns of human settlement across our planet.", "url": "https://www.newsgram.com/nasa-releases-its-latest-global-maps-of-earth-at-night-provides-clearest-patterns-of-human-settlement-across-the-planet/", "urlToImage": null, "publishedAt": "2017-06-13T14:36:47Z", "content": "BY FRANK F. ISLAM\r\nAs the coronavirus pandemic dominates global news in the United States, progress toward the next presidential election scheduled to be held on November 3 moves slowly forward. President Donald Trump had no real opposition in the Republican … [+6074 chars]"}]}