{"status": "ok", "totalResults": 50, "articles": [{"source": {"id": null, "name": "CNET"}, "author": "Jessica Dolcourt", "title": "Pssst... Your face mask isn't a force field against the coronavirus. Sorry - CNET", "description": "Commentary: While COVID-19 quietly thrives, are some people letting their guard -- and masks -- down too early? Here's what I see where I live.", "url": "https://www.cnet.com/health/pssst-your-face-mask-isnt-a-force-field-against-the-coronavirus-sorry/", "urlToImage": "https://cnet2.cbsistatic.com/img/x2e96wd1fpkM4UP-mi2c2FVNa-w=/756x567/2020/05/12/e19738c2-f117-4bd8-b48c-e3b7aee37406/01-homemade-face-mask.jpg", "publishedAt": "2020-06-02T12:17:33Z", "content": "My local Starbucks is happy to see me, it says, as long as I wear a face mask.\r\nJessica Dolcourt/CNET\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO websi… [+8299 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "William Harwood", "title": "Astronauts describe ride to space aboard SpaceX Crew Dragon - CBS News", "description": "SpaceX Crew Dragon astronauts say the ship is living up to high-tech expectations — but there was one rougher moment.", "url": "https://www.cbsnews.com/news/spacex-astronauts-crew-dragon-ride-international-space-station/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/06/01/ba28f4f6-eb9a-4dc9-9023-59f2362166e2/thumbnail/1200x630/d186af8f2b14dbb542587f5defc39441/060120-flag.jpg", "publishedAt": "2020-06-02T11:25:50Z", "content": "The SpaceX Falcon 9 rocket that boosted astronauts Douglas Hurley and Robert Behnken into space provided a slightly rougher ride than expected during the later stages of the climb to orbit, but both … [+6102 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "https://www.facebook.com/13ericralph31", "title": "SpaceX’s Starship explosion explained by Elon Musk - Teslarati", "description": "Shortly after a briefing following SpaceX’s flawless astronaut launch debut, CEO Elon Musk casually revealed the best explanation yet for why a Starship prototype violently exploded during testing on May 29th. On that fated Saturday, SpaceX successfully compl…", "url": "https://www.teslarati.com/spacex-starship-explosion-explained-elon-musk/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2020/06/Starship-Boca-Chica-052920-SPadre-SN4-explosion-aftermath-4-edit-c-1024x411.jpg", "publishedAt": "2020-06-02T09:02:04Z", "content": "Shortly after a briefing following SpaceX’s flawless astronaut launch debut, CEO Elon Musk casually revealed the best explanation yet for why a Starship prototype violently exploded during testing on… [+5410 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Terahertz Radiation Can Disrupt Proteins in Living Cells – Contradicting Conventional Belief - SciTechDaily", "description": "Researchers from the RIKEN Center for Advanced Photonics and collaborators have discovered that terahertz radiation, contradicting conventional belief, can disrupt proteins in living cells without killing the cells. This finding implies that terahertz radiati…", "url": "https://scitechdaily.com/terahertz-radiation-can-disrupt-proteins-in-living-cells-contradicting-conventional-belief/", "urlToImage": "https://scitechdaily.com/images/Terahertz-Radiation-Cells-Illustration.jpg", "publishedAt": "2020-06-02T09:00:20Z", "content": "Researchers from the RIKEN Center for Advanced Photonics and collaborators have discovered that terahertz radiation, contradicting conventional belief, can disrupt proteins in living cells without ki… [+3192 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Five asteroids inbound THIS WEEK as 2020’s relentless onslaught continues - RT", "description": "NASA is reporting that at least five asteroids are headed towards Earth this week, adding yet another ominous threat people should watch out for.", "url": "https://www.rt.com/news/490465-five-asteroids-inbound-this-week/", "urlToImage": "https://cdni.rt.com/files/2020.06/article/5ed60cb585f540060b5122bf.jpg", "publishedAt": "2020-06-02T08:39:33Z", "content": "According to NASA’s Center for Near-Earth Object Studies (CNEOS), four of the near-Earth objects are due to fly past the planet on Tuesday, June 2. \r\nKicking things off will be the 108-foot wide 2020… [+2265 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Patterns Formed by Spiral Galaxies Suggest The Universe's Structure Isn't Totally Random - ScienceAlert", "description": "The Universe is not a structureless mish-mash of space stuff, but there's still a lot we don't know about how it's put together.", "url": "https://www.sciencealert.com/the-spin-directions-of-spiral-galaxies-suggest-the-axis-of-evil-is-real", "urlToImage": "https://www.sciencealert.com/images/2020-06/processed/kstatestudyr_2_1024.jpg", "publishedAt": "2020-06-02T08:03:46Z", "content": "The Universe is not a structureless mish-mash of space stuff, but there's still a lot we don't know about how it's put together.\r\nAlthough we know that everything is connected by a vast, filamentary … [+4191 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Evan Gough, Universe Today", "title": "Astronomers Have Filmed a Black Hole Blasting Out Jets Close to The Speed of Light - ScienceAlert", "description": "The Chandra X-Ray Observatory has spotted a distant black hole shooting out jets of material, at close to the speed of light. No worries, this beast is about 10,000 light years away from us. It's more of a spectacle than a danger.", "url": "https://www.sciencealert.com/black-hole-seen-blasting-out-jets-at-close-to-the-speed-of-light", "urlToImage": "https://www.sciencealert.com/images/2020-06/processed/BlackHoleJets_1024.gif", "publishedAt": "2020-06-02T08:03:39Z", "content": "The Chandra X-Ray Observatory has spotted a distant black hole shooting out jets of material, at close to the speed of light. No worries, this beast is about 10,000 light years away from us. It's mor… [+5025 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Dalvin Brown", "title": "Pulled over while connected: Siri can quietly video record the police - MSN Money", "description": "iPhone users can now use Siri to secretly record police encounters and alert others of what happened.", "url": "https://www.usatoday.com/story/tech/2018/10/04/siri-shortcut-can-discreetly-record-cops-during-traffic-stops/1509065002/", "urlToImage": "https://www.gannett-cdn.com/-mm-/00328455916bb45ca99246179b52b99baca14f7b/c=0-0-642-361/local/-/media/2018/06/01/USATODAY/usatsports/Reviewed.com-RvEW-21784-og_siri.png?width=1600&height=800&fit=crop", "publishedAt": "2020-06-02T06:08:00Z", "content": "Apple's Shortcuts has an add-on feature called \"Police.\" The app uses Siri to covertly record law enforcement during a traffic stop.\r\nUSA TODAY\r\nSiri Voice Assistant by Apple\r\n(Photo: Apple)\r\nJust sa… [+3018 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Eric Mack", "title": "SpaceX to follow historic astronaut mission with yet another launch - CNET", "description": "Less than a week after sending humans to space for the first time, Elon Musk's company has another routine launch ready to go.", "url": "https://www.cnet.com/news/spacex-to-follow-historic-astronaut-mission-with-yet-another-launch/", "urlToImage": "https://cnet2.cbsistatic.com/img/UT6BSaEotbkOQ3GnGRJNZOrkPsE=/2020/01/04/319d2f62-9c7e-489b-9639-96b4efd24213/starlink1.jpg", "publishedAt": "2020-06-01T22:07:39Z", "content": "The Falcon 9 launch in November 2019 carried 60 Starlink satellites. On Wednesday, it'll attempt to send up more.\r\nSpaceX\r\nSpaceX carried out the historic Demo-2 mission with NASA over the weekend, s… [+1772 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "New study challenges popular “collapse” hypothesis for Easter Island - Ars Technica", "description": "Bayesian model-based analysis points to resilient, cooperative society well beyond 1600.", "url": "https://arstechnica.com/science/2020/06/new-study-challenges-popular-collapse-hypothesis-for-easter-island/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2019/01/easter1-760x380.jpg", "publishedAt": "2020-06-01T21:28:00Z", "content": "Enlarge/ Moai statues in a row, Ahu Tongariki, Easter Island, Chile.\r\n24 with 22 posters participating\r\nIn his bestselling 2005 book Collapse, Jared Diamond offered the societal collapse of Easter Is… [+9101 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "https://www.facebook.com/13ericralph31", "title": "SpaceX raises more than half a billion dollars for Starship, Starlink programs - Teslarati", "description": "In the last three months, SpaceX has managed to raise more than half a billion dollars from private investors, money that will likely go directly into the company’s ambitious Starship and Starlink programs. Despite a huge amount of public focus now placed on …", "url": "https://www.teslarati.com/spacex-starship-starlink-investment-round/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2020/06/Starship-Super-Heavy-Starlink-SpaceX-1-c-1024x490.jpg", "publishedAt": "2020-06-01T20:24:49Z", "content": "In the last three months, SpaceX has managed to raise more than half a billion dollars from private investors, money that will likely go directly into the company’s ambitious Starship and Starlink pr… [+4351 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "New biosensor visualizes stress in living plant cells in real time - Phys.org", "description": "Plant biologists have long sought a deeper understanding of foundational processes involving kinases, enzymes that catalyze key biological activities in proteins. Analyzing the processes underlying kinases in plants takes on greater urgency in today's environ…", "url": "https://phys.org/news/2020-06-biosensor-visualizes-stress-cells-real.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/newbiosensor.jpg", "publishedAt": "2020-06-01T20:11:14Z", "content": "Plant biologists have long sought a deeper understanding of foundational processes involving kinases, enzymes that catalyze key biological activities in proteins. Analyzing the processes underlying k… [+3246 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Passant Rabie", "title": "Interstellar object Oumuamua may be a giant chunk of hydrogen ice - Inverse", "description": "Since its discovery in 2017, scientists have not been able to explain the odd properties of Oumuamua but an equally odd origin story could be the answer.", "url": "https://www.inverse.com/science/oumuamua-hydrogen-ice", "urlToImage": "https://imgix.bustle.com/uploads/image/2020/6/1/a19b6641-c903-4ac9-89f3-9234437d96b3-621_eso1737b.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "publishedAt": "2020-06-01T19:36:56Z", "content": "On September 9, 2017, a rocky, elongated body sort of shaped like a cosmic cigar visited our Solar System from beyond the realms of the Sun the first ever recorded interstellar object to cruise throu… [+4734 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Global glacier melt raises sea levels and depletes once-reliable water source - Phys.org", "description": "The melting of glaciers and ice caps in places as diverse as the Himalayas and Andes mountain ranges, the Svalbard island group and the Canadian Arctic Archipelago has the dual effect of raising global sea levels and depleting freshwater resources that serve …", "url": "https://phys.org/news/2020-06-global-glacier-sea-depletes-once-reliable.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/globalglacie.jpg", "publishedAt": "2020-06-01T19:06:23Z", "content": "The melting of glaciers and ice caps in places as diverse as the Himalayas and Andes mountain ranges, the Svalbard island group and the Canadian Arctic Archipelago has the dual effect of raising glob… [+4068 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Karin Valentine", "title": "Class of stellar explosions found to be galactic producers of lithium - Phys.org", "description": "A team of researchers, led by astrophysicist Sumner Starrfield of Arizona State University, has combined theory with both observations and laboratory studies and determined that a class of stellar explosions, called classical novae, are responsible for most o…", "url": "https://phys.org/news/2020-06-class-stellar-explosions-galactic-lithium.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/classofstell.jpg", "publishedAt": "2020-06-01T19:06:15Z", "content": "A team of researchers, led by astrophysicist Sumner Starrfield of Arizona State University, has combined theory with both observations and laboratory studies and determined that a class of stellar ex… [+5077 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Study finds that patterns formed by spiral galaxies show that the universe may have a defined structure - Phys.org", "description": "An analysis of more than 200,000 spiral galaxies has revealed unexpected links between spin directions of galaxies, and the structure formed by these links might suggest that the early universe could have been spinning, according to a Kansas State University …", "url": "https://phys.org/news/2020-06-patterns-spiral-galaxies-universe.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/kstatestudyr.jpg", "publishedAt": "2020-06-01T18:01:24Z", "content": "An analysis of more than 200,000 spiral galaxies has revealed unexpected links between spin directions of galaxies, and the structure formed by these links might suggest that the early universe could… [+5118 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "SpaceX CEO Elon Musk officially launched humans to space -- here's what he's planning next - WKMG News 6 ClickOrlando", "description": "Thousands of people gathered to witness history as two NASA astronauts blasted off from the Space Coast Saturday afternoon on a SpaceX rocket, marking the fi...", "url": "https://www.youtube.com/watch?v=WRZQfLAcXws", "urlToImage": "https://i.ytimg.com/vi/WRZQfLAcXws/maxresdefault.jpg", "publishedAt": "2020-06-01T16:58:34Z", "content": null}, {"source": {"id": null, "name": "Designboom"}, "author": null, "title": "this origami-inspired super-grip sole could help prevent falls - Designboom", "description": "", "url": "https://www.designboom.com/technology/super-grip-sole-origami-prevent-falls-06-01-2020/", "urlToImage": "https://www.designboom.com/wp-content/uploads/2020/06/super-shoe-grip-mit-harvard-designboom-fb.jpg", "publishedAt": "2020-06-01T16:45:01Z", "content": "inspired by kirigami — a variation of origami that involves cutting paper as well as folding it — MIT engineers have developed a shoe grip that can increase friction between the shoe and the ground. … [+1986 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Laura Arenschield", "title": "The Milky Way has one very hot halo, astronomers find - Phys.org", "description": "The halo that surrounds our own Milky Way galaxy is much hotter than scientists once believed—and it may not be unique among galaxies.", "url": "https://phys.org/news/2020-06-milky-hot-halo-astronomers.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/milkyway.jpg", "publishedAt": "2020-06-01T15:22:23Z", "content": "The halo that surrounds our own Milky Way galaxy is much hotter than scientists once believedand it may not be unique among galaxies.\r\nThe new findings were presented at the annual meeting of the Ame… [+3426 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Giant Magnetic Spots Discovered on the Surface of Extremely Hot Stars Hidden in Stellar Clusters - SciTechDaily", "description": "Astronomers using European Southern Observatory (ESO) telescopes have discovered giant spots on the surface of extremely hot stars hidden in stellar clusters. Not only are these stars plagued by magnetic spots, some also experience superflare events, explosio…", "url": "https://scitechdaily.com/giant-magnetic-spots-discovered-on-the-surface-of-extremely-hot-stars-hidden-in-stellar-clusters/", "urlToImage": "https://scitechdaily.com/images/Sunspot-vs-Giant-Magnetic-Spot-on-Star.gif", "publishedAt": "2020-06-01T15:00:22Z", "content": "Astronomers using ESO telescopes have discovered giant spots on the surface of extremely hot stars hidden in stellar clusters, called extreme horizontal branch stars. This image shows an artist’s imp… [+8415 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Astronomers find cosmic golden needle buried for two decades - Phys.org", "description": "Determined to find a needle in a cosmic haystack, a pair of astronomers time traveled through archives of old data from W. M. Keck Observatory on Mauankea in Hawaii and old X-ray data from NASA's Chandra X-ray Observatory to unlock a mystery surrounding a bri…", "url": "https://phys.org/news/2020-06-astronomers-cosmic-golden-needle-decades.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/5-astronomersf.jpg", "publishedAt": "2020-06-01T14:37:24Z", "content": "Determined to find a needle in a cosmic haystack, a pair of astronomers time traveled through archives of old data from W. M. Keck Observatory on Mauankea in Hawaii and old X-ray data from NASA's Cha… [+5621 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Astronomers Just Narrowed Down The Source of Those Powerful Radio Signals From Space - ScienceAlert", "description": "Strange, powerful signals from deep space called fast radio bursts are slippery little suckers.", "url": "https://www.sciencealert.com/we-re-starting-to-figure-out-where-fast-radio-bursts-come-from", "urlToImage": "https://www.sciencealert.com/images/2020-06/processed/askap-antennas_1024.jpg", "publishedAt": "2020-06-01T14:32:34Z", "content": "Strange, powerful signals from deep space called fast radio bursts are slippery little suckers.\r\nMost of them just flash once, a mysterious huge spike in the radio data out of nowhere, lasting just m… [+4606 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Hannah Osborne", "title": "Sun Produces Biggest Solar Flare in Two Years After Unusual Quiet Period - Newsweek", "description": "NASA said the flares may suggest the sun is emerging from the solar minimum and entering its next cycle.", "url": "https://www.newsweek.com/solar-flare-nasa-sun-quiet-1507793", "urlToImage": "https://d.newsweek.com/en/full/1595560/sun.jpg", "publishedAt": "2020-06-01T14:11:14Z", "content": "The sun has produced its biggest solar flare since October 2017, potentially suggesting it is emerging from the solar minimum. The activity comes as scientists record an unusually low number of sunsp… [+2769 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "What's the risk that animals will spread the coronavirus? - Nature.com", "description": "Researchers say there’s an urgent need to find out whether animals can catch the virus and pass it to people.", "url": "https://www.nature.com/articles/d41586-020-01574-4", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-020-01574-4/d41586-020-01574-4_18005084.jpg", "publishedAt": "2020-06-01T12:26:34Z", "content": "Cats can be infected with the coronavirus.Credit: Carol Smiljan/NurPhoto/Getty\r\nSoon after the new coronavirus started spreading around the globe, reports emerged of cases in animals pet cats in Hong… [+6632 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Diane Lincoln", "title": "Here's how plants became meat eaters - Livescience.com", "description": "Carnivorous plants are the 'most skillful green hunters on the planet.'", "url": "https://www.livescience.com/how-carnivorous-plants-evolved.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/fqACxLh8WMEUPMm6cJQLmP-1200-80.jpg", "publishedAt": "2020-06-01T12:12:00Z", "content": "About 70 million years ago, when dinosaurs roamed the Earth, a genetic anomaly allowed some plants to turn into meat eaters. This was done in part, with a stealthy trick: repurposing genes meant for … [+4222 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Particles trapped in twisted materials and quantum fingerprints identified - Phys.org", "description": "A paper by the Quantum Photonics Lab at Heriot-Watt, published today in top-tier Nature Materials,  identifies how to trap interlayer excitons (IXs) and their quantum fingerprints. The IXs are trapped by the interaction of two sheets of atoms made of differen…", "url": "https://phys.org/news/2020-06-particles-materials-quantum-fingerprints.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/particlestra.jpg", "publishedAt": "2020-06-01T11:27:33Z", "content": "A paper by the Quantum Photonics Lab at Heriot-Watt, published today in top-tier Nature Materials, identifies how to trap interlayer excitons (IXs) and their quantum fingerprints. The IXs are trapped… [+2971 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Demo-2 launch wins political praise, but future funding uncertain - SpaceNews", "description": "The successful return of human orbital spaceflight to the U.S. generated bipartisan praise, but it’s unclear if that support will translate into funding.", "url": "https://spacenews.com/demo-2-launch-wins-political-praise-but-future-funding-uncertain/", "urlToImage": "https://spacenews.com/wp-content/uploads/2020/06/demo2-bridenstine.jpg", "publishedAt": "2020-06-01T11:11:43Z", "content": "WASHINGTON The successful return of human orbital spaceflight to the United States generated bipartisan praise, but its unclear if that support will translate into funding required to enable other NA… [+4284 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "William Harwood", "title": "SpaceX Crew Dragon chalks up picture-perfect docking at International Space Station - CBS News", "description": "The successful docking boosted the lab's crew to five and marked a major milestone for NASA.", "url": "https://www.cbsnews.com/news/spacex-crew-dragon-docking-international-space-station/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/05/31/20a9f7a0-45d6-4007-91ea-61d5783cd52f/thumbnail/1200x630/bb6d7fea589de8b06cfc3014d5a48a75/053120-approach.jpg", "publishedAt": "2020-06-01T10:32:04Z", "content": "Nineteen hours after a spectacular Florida launch, SpaceX's Crew Dragon capsule caught up with the International Space Station early Sunday and glided in for a problem-free docking, bringing veteran … [+7407 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "John Marshall", "title": "Prehistoric climate change damaged the ozone layer and led to a mass extinction - The Conversation UK", "description": "New research on the Late Devonian extinction suggests the ozone layer could be naturally depleted as the temperature rises.", "url": "https://theconversation.com/prehistoric-climate-change-damaged-the-ozone-layer-and-led-to-a-mass-extinction-139519", "urlToImage": "https://images.theconversation.com/files/338387/original/file-20200528-51509-l9s17i.jpg?ixlib=rb-1.1.0&rect=440%2C655%2C4230%2C2110&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2020-06-01T10:22:00Z", "content": "Mass extinctions are very important to how life evolved on Earth. For example, when an asteroid hit the Earth 66 million years ago, the resulting dinosaur extinction led mammals to take their place. … [+5333 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "https://www.facebook.com/13ericralph31", "title": "SpaceX to ring in Crew Dragon’s success with a Starlink launch and landing - Teslarati", "description": "SpaceX wants to ring in the historic success of its Crew Dragon spacecraft the only way it knows how – sending 60-satellite Starlink satellites into orbit and landing another Falcon booster as few as three days after the company’s inaugural astronaut launch. …", "url": "https://www.teslarati.com/spacex-crew-dragon-success-next-starlink-launch/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2020/05/Crew-Dragon-C206-F9-B1058-Demo-2-39A-053020-NASA-launch-8-crop-c-1024x522.jpg", "publishedAt": "2020-06-01T09:05:45Z", "content": "SpaceX wants to ring in the historic success of its Crew Dragon spacecraft the only way it knows how – sending 60-satellite Starlink satellites into orbit and landing another Falcon booster as few as… [+6258 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Christopher Carbone", "title": "Dinosaur-killing asteroid created massive magma chamber that lasted millions of years, study shows - Fox News", "description": "The asteroid that slammed into Earth some 66 million years ago and wiped out the dinosaurs also produced a gigantic pool of magma many times larger than the crater at the center of Yellowstone National Park, new research reveals.", "url": "https://www.foxnews.com/science/dinosaur-killing-asteroid-massive-magma-chamber-millions-years", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/05/asteroid-dinosaurs-swns.jpg", "publishedAt": "2020-06-01T08:01:51Z", "content": "The asteroid that slammed into Earth some 66 million years ago and wiped out the dinosaurs also produced a gigantic pool of magma many times larger than the crater at the center of Yellowstone Nation… [+1901 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Mars Does Have a Magnetic Field of Sorts – And We've Finally Got Data to Map It - ScienceAlert", "description": "Unlike Earth, Mars doesn't have a global magnetic field to protect it from the rigours of space weather – but it does have spots of local, induced magnetism.", "url": "https://www.sciencealert.com/mars-does-have-a-magnetic-field-of-sorts-and-we-ve-finally-got-enough-data-to-map-it", "urlToImage": "https://www.sciencealert.com/images/2020-05/processed/mars-wrap_1024.jpg", "publishedAt": "2020-06-01T07:48:35Z", "content": "Unlike Earth, Mars doesn't have a global magnetic field to protect it from the rigours of space weather but it does have spots of local, induced magnetism.\r\nNow, researchers have been able to create … [+3185 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Ethan Siegel", "title": "Did Hubble Just Find New Stars Where Planets Are Impossible? - Forbes", "description": "Maybe 100% of stars don't have planets, after all.", "url": "https://www.forbes.com/sites/startswithabang/2020/06/01/did-hubble-just-find-new-stars-where-planets-are-impossible/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fblogs-images.forbes.com%2Fstartswithabang%2Ffiles%2F2020%2F05%2Fheic1509a-1200x899.jpg", "publishedAt": "2020-06-01T06:09:32Z", "content": "This NASA/ESA Hubble Space Telescope image of the cluster Westerlund 2 and its surroundings was... [+] released to celebrate Hubbles 25th year in orbit. The images central region, containing the star… [+6927 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Researchers develop viable sodium battery - EurekAlert", "description": "Washington State University and Pacific Northwest National Laboratory researchers have created a sodium-ion battery that holds as much energy and works as well as some commercial lithium-ion battery chemistries, making for a potentially viable battery technol…", "url": "https://www.eurekalert.org/pub_releases/2020-06/wsu-rdv052920.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/233292_web.jpg", "publishedAt": "2020-06-01T04:02:23Z", "content": "IMAGE: WSU PhD graduate Junhua Song and colleagues created a sodium-ion battery that holds as much energy and works as well as some commercial lithium-ion battery chemistries.\r\n view more \r\nCredit: W… [+4092 chars]"}, {"source": {"id": null, "name": "WLWT Cincinnati"}, "author": "WLWT Digital Staff", "title": "Space station flies over Cincinnati tonight: When to look up - WLWT Cincinnati", "description": "Look up to the sky, Cincinnati.", "url": "https://www.wlwt.com/article/space-station-flies-over-cincinnati-tonight-when-to-look-up/32724469", "urlToImage": "https://kubrick.htvapps.com/htv-prod/ibmig/cms/image/wlwt/10595668-10595668.jpg?crop=1.00xw:0.846xh;0,0&resize=1200:*", "publishedAt": "2020-06-01T02:45:58Z", "content": "CINCINNATI —Look up to the sky, Cincinnati.\r\nThe International Space Station complete with passengers will be flying over the city Sunday night. \r\nThe ISS will be visible from 10:37 p.m. through 10:4… [+183 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "Thousands of Species Are Fleeing to Earth's Poles en Masse, And a Pattern's Emerging - ScienceAlert", "description": "We know that global warming is forcing many animals around the world to flee their normal habitats, but now, an exhaustive analysis has shown marine species are booking it for the poles six times faster than those on land.", "url": "https://www.sciencealert.com/as-the-world-gets-hotter-thousands-of-species-are-fleeing-to-earth-s-poles", "urlToImage": "https://www.sciencealert.com/images/2020-05/processed/marinemigration_1024.jpg", "publishedAt": "2020-06-01T01:26:54Z", "content": "We know that global warming is forcing many animals around the world to flee their normal habitats, but now, an exhaustive analysis has shown marine species are booking it for the poles six times fas… [+4804 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Anderson Cooper", "title": "NASA is heading back to Mars with a new rover searching for signs of past life - 60 Minutes - CBS News", "description": "The space agency is making final preparations for what one official calls \"probably the most complex\" scientific mission NASA has ever undertaken. Anderson Cooper reports.", "url": "https://www.cbsnews.com/news/mars-rover-nasa-ancient-life-60-minutes-2020-05-31/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/05/31/479f767a-0153-4d22-8b32-a49e8cc9a2ea/thumbnail/1200x630/08c0ef1c307831256756f5c03c726d49/marsvideo.jpg", "publishedAt": "2020-06-01T00:54:22Z", "content": "If you're tired of being cooped up and yearning for a get-away, have we got an adventure for you. It's a new mission to Mars, NASA's most ambitious one yet. The goal is to land a new vehicle, a high-… [+13511 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Elizabeth Rayne", "title": "The exoplanet closest to us could be crawling with life—except it gets blasted with lethal X-rays - SYFY WIRE", "description": "While we’re pretty sure the moon is dead and Mars doesn’t look too promising for any life-forms (except that human colony Elon Musk is planning), we may have to look beyond our solar system. Proxima b is the closest exoplanet to Earth and a contradiction in i…", "url": "https://www.syfy.com/syfywire/proxima-b-could-be-crawling-with-life-but-x-rays", "urlToImage": "https://www.syfy.com/sites/syfy/files/styles/1200x680/public/2020/05/proximab.jpg", "publishedAt": "2020-06-01T00:26:30Z", "content": "While were pretty sure the moon is dead and Mars doesnt look too promising for any life-forms (except that human colony Elon Musk is planning), we may have to look beyond our solar system.\r\nProxima b… [+3630 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "NASA Seeks People for Isolation Study to Prepare for Moon and Mars - VOA Learning English", "description": "NASA is seeking candidates to go into isolation for eight months in an experiment to help prepare for long-term stays on the moon and Mars.", "url": "https://learningenglish.voanews.com/a/nasa-seeks-people-for-isolation-study-to-prepare-for-moon-and-mars/5439752.html", "urlToImage": "https://gdb.voanews.com/C40ECE5F-D014-42F3-B327-30239C57D4B5_cx0_cy4_cw0_w1200_r1.jpg", "publishedAt": "2020-05-31T22:01:00Z", "content": "NASA is seeking candidates to go into isolation for eight months in an experiment to help prepare for long-term stays on the moon and Mars.\r\nResearchers say results of the study will help them better… [+3602 chars]"}, {"source": {"id": null, "name": "CleanTechnica"}, "author": "Johnna Crider", "title": "Tesla Sentry Mode Captures Falcon 9 & Crew Dragon Liftoff - CleanTechnica", "description": "Tesla Sentry Mode is great at capturing vandals and thieves, witnessing fistfights, and identifying people who like to be just plain evil. Today, however, Sentry Mode caught something else. Along with millions around the world watching, this particular Tesla …", "url": "https://cleantechnica.com/2020/05/31/tesla-sentry-mode-captures-falcon-9-crew-dragon-liftoff/", "urlToImage": "https://cleantechnica.com/files/2020/05/timdoddtweet-150x150.png", "publishedAt": "2020-05-31T20:44:00Z", "content": "CarsPublished on May 31st, 2020 |\r\n by Johnna Crider\r\n0\r\nMay 31st, 2020 by Johnna Crider \r\nTesla Sentry Mode is great at capturing vandals and thieves, witnessing fistfights, and identifying people w… [+3181 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Mike Wall", "title": "Sun unleashes biggest flare since 2017. Is our star waking up? - Livescience.com", "description": "", "url": "https://www.livescience.com/sun-unleashes-biggest-solar-flare-since-2017.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/VTzxWwinvmWfwuBAtF8tPF-1200-80.jpg", "publishedAt": "2020-05-31T20:32:00Z", "content": "The sun\r\n may be coming out of its slumber at long last.\r\nOn Friday morning (May 29), our star fired off its strongest flare since October 2017, an eruption spotted by NASA's sun-watching Solar Dynam… [+2045 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Benjamin Spillman", "title": "Nevada home to 246M-year-old fossil of pregnant ichthyosaur - Phys.org", "description": "Autumn was closing in fast on northern Nevada when Martin Sander took one last look around the excavation site in the Augusta Mountains 150 miles (241 kilometers) east of Reno.", "url": "https://phys.org/news/2020-05-nevada-home-246m-year-old-fossil-pregnant.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/nevada.jpg", "publishedAt": "2020-05-31T20:27:20Z", "content": "Autumn was closing in fast on northern Nevada when Martin Sander took one last look around the excavation site in the Augusta Mountains 150 miles (241 kilometers) east of Reno.\r\nThe longtime paleonto… [+7487 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX's historic Demo-2 Crew Dragon astronaut test flight: Full coverage - Space.com", "description": "", "url": "https://www.space.com/spacex-crew-dragon-demo-2-test-flight-explained.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/o8VEX6t2yFY3yXgReVaG2E-1200-80.png", "publishedAt": "2020-05-31T18:24:00Z", "content": "Updated May 31 at 2:20 p.m. EDT.\r\nThe first SpaceX Crew Dragon spacecraft to carry astronauts successfully docked with the International Space Station today, May 31, at 10:16 a.m. EDT (1416 GMT) afte… [+16880 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "SpaceX's historic Demo-2 delivers NASA astronauts to ISS - CNET", "description": "After a 19-hour ride, two NASA astronauts aboard a Crew Dragon capsule reached the International Space Station 10 minutes ahead of schedule.", "url": "https://www.cnet.com/how-to/spacexs-historic-demo-2-delivers-nasa-astronauts-to-iss/", "urlToImage": "https://cnet1.cbsistatic.com/img/t6UuanKQ754DQrr3WueksGJJ62Q=/2020/05/13/a8dcb28d-8613-45f3-b42a-544b2a3c55ca/crewdragondockingart.jpg", "publishedAt": "2020-05-31T18:17:20Z", "content": "SpaceX's Crew Dragon is shown here minutes before docking with the International Space Station.\r\nNASA; Screenshot by Stephen Shankland/CNET\r\nSpaceX's Crew Dragon successfully reached the Internationa… [+8516 chars]"}, {"source": {"id": null, "name": "Sputnik International"}, "author": null, "title": "World's Oldest Bug Discovered in Scotland, Says New Study - Sputnik International", "description": "Scientists say that the findings of their study suggest that bugs, as well as plants, have evolved much more quickly than they previously thought, going from small...", "url": "https://sputniknews.com/science/202005311079479049-worlds-oldest-bug-discovered-in-scotland-says-new-study/", "urlToImage": "https://cdn2.img.sputniknews.com/images/107470/31/1074703165.jpg", "publishedAt": "2020-05-31T17:08:46Z", "content": "Scientists say that the findings of their study suggest that bugs, as well as plants, have evolved much more quickly than they previously thought, going from small communities to complex ecosystems i… [+1364 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Anna SMOLCHENKO", "title": "Moscow bemused at US space 'hysteria' as Musk taunts Russia - Yahoo News", "description": "Moscow space officials on Sunday said they were puzzled by \"hysteria\" around the successful SpaceX flight as Elon Musk taunted Russia and US...", "url": "https://news.yahoo.com/moscow-bemused-us-space-hysteria-musk-taunts-russia-160514223.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/abvpE1H0BXJoyt3V_wCVSg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NDguMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/DmgpfOIGqu.CFFtpd8POxA--~B/aD01Njk7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/24ac6907c24173627f67fdba56572f4514ad0b98.jpg", "publishedAt": "2020-05-31T16:05:00Z", "content": "Moscow (AFP) - Moscow space officials on Sunday said they were puzzled by \"hysteria\" around the successful SpaceX flight as Elon Musk taunted Russia and US President Donald Trump vowed to beat it to … [+3772 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Einstein’s Two Big Mistakes - SciTechDaily", "description": "Scientific research is based on the relationship between the reality of nature, as it is observed, and a representation of this reality, formulated by a theory in mathematical language. If all the consequences of the theory are experimentally proven, it is co…", "url": "https://scitechdaily.com/einsteins-two-big-mistakes/", "urlToImage": "https://scitechdaily.com/images/Camille-Flammarion-Engraving-scaled.jpg", "publishedAt": "2020-05-31T15:45:57Z", "content": "Woodcut from Camille Flammarion’s 1888 book L’Atmosphère: météorologie populaire. The caption reads: ‘A missionary of the Middle Ages tells that he had found the point where the sky and the Earth tou… [+8969 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "James Conca", "title": "Climate Change Driving Forests To Smaller And Younger Trees - Forbes", "description": "A new study by scientists at PNNL shows that ongoing environmental changes are transforming forests worldwide, resulting in shorter and younger trees with broad impacts on global ecosystems. Stunted growth from rising temperatures more than offset any growth …", "url": "https://www.forbes.com/sites/jamesconca/2020/05/31/climate-change-driving-forests-to-smaller-and-younger-trees/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5ed3cbd0b8ac0f0006007bee%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D1080%26cropY1%3D0%26cropY2%3D720", "publishedAt": "2020-05-31T15:45:42Z", "content": "Our planets forests are adapting to global warming, as one would expect. But their trees are getting shorter and younger. And thats going to continue for a long time.\r\nBurned forest are a natural phe… [+9352 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Wants to Go Nuclear on the Moon and Mars for Astronaut Settlement - SciTechDaily", "description": "It might sound like science fiction, but scientists are preparing to build colonies on the moon and, eventually, Mars. With NASA planning its next human mission to the moon in 2024, researchers are looking for options to power settlements on the lunar surface…", "url": "https://scitechdaily.com/nasa-wants-to-go-nuclear-on-the-moon-and-mars-for-astronaut-settlement/", "urlToImage": "https://scitechdaily.com/images/Simple-Compact-Nuclear-Reactor.jpg", "publishedAt": "2020-05-31T14:04:40Z", "content": "NASA is developing a nuclear reactor (shown in this artist’s rendition) that could power a human settlement on the moon. Credit: NASA\r\nIt might sound like science fiction, but scientists are preparin… [+3669 chars]"}, {"source": {"id": null, "name": "Travel+Leisure"}, "author": "Jamie Carter", "title": "A Strawberry Moon Eclipse Will Be Visible in Parts of the World This Week - Travel + Leisure", "description": "North America gets two chances to see this month’s Strawberry Moon.", "url": "https://www.travelandleisure.com/trip-ideas/space-astronomy/strawberry-moon-eclipse", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1800&h=942&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F28%2F2020%2F05%2F27%2Fpartial-lunar-eclipse-STRWBRYMOON0520.jpg", "publishedAt": "2020-05-31T11:20:51Z", "content": "This month has an extra-special full moon and a lunar eclipse combined, but while the former is easily visible to everyone on the planet, only those in Asia, Africa, and Australia will see the latter… [+2933 chars]"}]}