{"status": "ok", "totalResults": 23, "articles": [{"source": {"id": null, "name": "Wthr.com"}, "author": "https://www.facebook.com/WTHR13/", "title": "Strange lights explained: SpaceX satellites light up night sky over Indiana - WTHR", "description": "Social media is \"lighting up\" with reports of a strange string of lights in the sky Sunday night.", "url": "https://www.wthr.com/article/strange-lights-explained-spacex-satellites-light-night-sky-over-indiana", "urlToImage": null, "publishedAt": "2020-04-27T03:25:10Z", "content": "INDIANAPOLIS (WTHR) - Social media is \"lighting up\" with reports of a strange string of lights in the sky Sunday night.\r\nBut there is likely a good explanation.\r\nSeveral viewers contacted 13News after seeing the lights around 10 p.m. Sunday.\r\nAccording to Spa… [+487 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "USGS releases first complete geologic map of the Moon - Engadget", "description": "The USGS has made it easy to study the Moon's surface by releasing the first comprehensive geologic map of the lunar landscape.", "url": "https://www.engadget.com/usgs-first-geologic-map-of-moon-031051774.html", "urlToImage": null, "publishedAt": "2020-04-27T03:15:13Z", "content": "Have you ever wanted to study the Moon’s surface in exacting detail? Now’s your chance. The USGS (with help from NASA and the Lunar Planetary Institute) has released the first complete geologic map of the Moon, providing a truly comprehensive look at our near… [+566 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "SpaceX is already preparing for operational astronaut missions - India Gone Viral", "description": "While the world’s attention is focused on the return of orbital human spaceflight from US soil after a nearly decade long absence with the upcoming May 27th Crew Dragon Demo-2 mission, SpaceX is simul", "url": "https://indiagoneviral.com/science/2020/04/27/spacex-is-already-preparing-for-operational-astronaut-missions/43431/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-27T02:00:56Z", "content": "While the worlds attention is focused on the return of orbital human spaceflight from US soil after a nearly decade long absence with the upcoming May 27th Crew Dragon Demo-2 mission, SpaceX is simultaneously preparing for the first Crew Dragon operational mi… [+4182 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Josephine Harvey", "title": "Scientists Note Asteroid Approaching Earth Looks Like It’s Wearing A Face Mask - HuffPost", "description": "1998 OR2 appears to know the planet is facing the coronavirus pandemic, researchers joked.", "url": "https://www.huffpost.com/entry/asteroid-face-mask_n_5ea60b5ac5b6805f9ecf4add", "urlToImage": null, "publishedAt": "2020-04-27T01:23:49Z", "content": "Scientists are joking that even an asteroid set to pass by Earth is exercising caution as the planet tackles the coronavirus pandemic.\r\nThe 1998 OR2 asteroid poses no risk to the Earth, but its appearance makes it look as though it were aware of the risks on … [+1689 chars]"}, {"source": {"id": null, "name": "Newsinfopark.com"}, "author": "NIP Web Desk Team", "title": "A unique (so far) gravitational wave signal - News Info Park", "description": "Originally published by the Max Planck Institute for Gravitational Physics (Albert Einstein Institute, or AEI) in Hannover, Germany on April 20, 2020. The expectations of the gravitational-wave resear", "url": "https://newsinfopark.com/science/2020-04-26/article/a-unique-so-far-gravitational-wave-signal-19978/nip-web-desk-team/", "urlToImage": null, "publishedAt": "2020-04-26T21:10:02Z", "content": "Originally published by the Max Planck Institute for Gravitational Physics (Albert Einstein Institute, or AEI) in Hannover, Germany on April 20, 2020.\r\nThe expectations of the gravitational-wave research community have been fulfilled: gravitational-wave disco… [+6634 chars]"}, {"source": {"id": null, "name": "Ktla.com"}, "author": "CNN Wire", "title": "NASA engineers in Pasadena develop ventilator tailored to needs of COVID-19 patients - KTLA Los Angeles", "description": "The engineers at NASA have developed a high-pressure ventilator prototype specifically tailored to help coronavirus patients, according to the agency. It’s called VITAL, or Ventilator In…", "url": "https://ktla.com/news/nationworld/nasa-engineers-in-pasadena-develop-ventilator-tailored-to-needs-of-covid-19-patients/", "urlToImage": null, "publishedAt": "2020-04-26T20:11:28Z", "content": "The engineers at NASA have developed a high-pressure ventilator prototype specifically tailored to help coronavirus patients, according to the agency.\r\nIt’s called VITAL, or Ventilator Intervention Technology Accessible Locally. And after passing a critical t… [+8491 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Shari Miller For Mailonline", "title": "First ever proof of meteorite killing a man uncovered in 1888 report to Ottoman sultan - Daily Mail", "description": "Documents show Ottoman Sultan Abdul Hamid II (left), was informed of a meteorite that killed one man and paralysed another after landing in Sulaymaniyah, Iraq, on August 22, 1888.", "url": "https://www.dailymail.co.uk/news/article-8258631/First-proof-meteorite-killing-man-uncovered-1888-report-Ottoman-sultan.html", "urlToImage": null, "publishedAt": "2020-04-26T19:40:56Z", "content": "The first ever proof of a person being struck and killed by a meteorite might just have been discovered.\r\nResearchers at the Meteoritical Society have found evidence of a meteorite that killed one man and left another paralysed after it fell 'like rain' on a … [+2605 chars]"}, {"source": {"id": null, "name": "Nasaspaceflight.com"}, "author": null, "title": "UAE-built Mars orbiter arrives at launch site ahead of July liftoff - NASASpaceflight.com", "description": "An Emirati-built Mars explorer, named Al Amal (“Hope” in English) and developed by engineers at…", "url": "https://www.nasaspaceflight.com/2020/04/uae-mars-orbiter-arrives-launch-site/", "urlToImage": null, "publishedAt": "2020-04-26T19:17:36Z", "content": "An Emirati-built Mars explorer, named Al Amal (“Hope” in English) and developed by engineers at the Mohammed bin Rashed Space Centre, has been shipped to the JAXA-run Tanegashima Space Center for final checkouts and preparations ahead of its launch aboard an … [+7548 chars]"}, {"source": {"id": null, "name": "Digitaltrends.com"}, "author": "Georgina Torbet", "title": "Scientists figure out why Venus’ atmosphere rotates 60x faster than the planet - Digital Trends", "description": "Venus's atmosphere rotates 60 times faster than the planet does, and now scientists from the Institute of Space and Astronautical Science have figured out why.", "url": "https://www.digitaltrends.com/news/venus-atmosphere-superrotation/", "urlToImage": null, "publishedAt": "2020-04-26T16:19:57Z", "content": "The planet Venus has some strange characteristics, but one of its oddest features is its atmosphere. Full of clouds of sulfuric acid, its thick atmosphere hides the surface of the planet and heats it so much that even though it’s further from the sun than Mer… [+2383 chars]"}, {"source": {"id": null, "name": "Syfy.com"}, "author": "Elizabeth Rayne", "title": "Brain implant and signal decoder have done the impossible and reversed paralysis - SYFY WIRE", "description": "Paralysis used to mean a life sentence of immobility with no way out—until now. Back in 2010, Ian Burkhart suffered a devastating injury that would leave him mostly paralyzed. Even though he was still able to move his shoulders and elbows, he had lost sensati…", "url": "https://www.syfy.com/syfywire/brain-implant-and-signal-decoder-reversed-paralysis", "urlToImage": null, "publishedAt": "2020-04-26T14:46:26Z", "content": "Paralysis used to mean a life sentence of immobility with no way outuntil now.\r\nBack in 2010, Ian Burkhart suffered a devastating injury that would leave him mostly paralyzed. Even though he was still able to move his shoulders and elbows, he had lost sensati… [+3894 chars]"}, {"source": {"id": null, "name": "Myfox8.com"}, "author": "CNN Wire", "title": "Astronomers find ‘alien’ asteroids living in our solar system - WGHP FOX 8 Greensboro", "description": "Scientists In the last few years have studied the first observed interstellar visitors to our solar system. They include a comet called 2I/Borisov, spotted in 2019 and still passing through, and an…", "url": "https://myfox8.com/news/astronomers-find-alien-asteroids-living-in-our-solar-system/", "urlToImage": null, "publishedAt": "2020-04-26T12:06:50Z", "content": "Scientists In the last few years have studied the first observed interstellar visitors to our solar system. They include a comet called 2I/Borisov, spotted in 2019 and still passing through, and an asteroid called ‘Oumuamua that zipped through quickly in 2017… [+4408 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Christopher Wanjek", "title": "How Space Travel Tries to Kill You and Make You Ugly - WIRED", "description": "Oh also, it makes you blind and stupid, too.", "url": "https://www.wired.com/story/how-space-tries-kill-you-make-you-ugly/", "urlToImage": null, "publishedAt": "2020-04-26T11:40:53Z", "content": "Of these 34 risks, three are potential showstoppers: radiation, gravity (or lack thereof), and the need for surgery or a complicated medical procedure.\r\nLets explore the gravity issue.\r\nSome science fiction writers in the mid-20th century speculated that zero… [+3425 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "China installs antenna reflector for Mars exploration mission - CGTN", "description": "China successfully integrally hoisted and installed the antenna reflector for its Mars exploration mission in Wuqing District, north China's Tianjin Municipality on Saturday.", "url": "https://news.cgtn.com/news/2020-04-26/China-installs-antenna-reflector-for-Mars-exploration-mission-PZRw0UtqMw/index.html", "urlToImage": null, "publishedAt": "2020-04-26T02:20:59Z", "content": "China integrally hoisted and installed the antenna reflector for its Mars exploration mission in Wuqing District, north China's Tianjin Municipality on Saturday.\r\nAs the key equipment for receiving the data from the Mars exploration, the high-performance ante… [+2014 chars]"}, {"source": {"id": null, "name": "Abc13.com"}, "author": null, "title": "NASA Astronaut Andrew Morgan welcomed back to Earth with parade in Friendswood - KTRK-TV", "description": "Welcome home, Dr. Morgan! 🌎", "url": "https://abc13.com/friendswood-parade-nasa-astronaut-andrew-morgan-back-on-earth/6129564/", "urlToImage": null, "publishedAt": "2020-04-26T00:22:43Z", "content": "FRIENDSWOOD, Texas (KTRK) -- NASA Astronaut Andrew Morgan was welcomed back to Earth with a homecoming celebration.Morgan's friends and family gathered to celebrate with a street parade in his home in Friendswood.\r\nDr. Morgan returned back to Earth on April 1… [+260 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "“Most Dangerous Place in the History of Planet Earth” Revealed by Paleontologists - SciTechDaily", "description": "100 million years ago, ferocious predators, including flying reptiles and crocodile-like hunters, made the Sahara the most dangerous place on Earth. This is according to an international team of scientists, who have published the biggest review in almost 100 …", "url": "https://scitechdaily.com/most-dangerous-place-in-the-history-of-planet-earth-revealed-by-paleontologists/", "urlToImage": null, "publishedAt": "2020-04-25T22:55:27Z", "content": "Predator paradise — The giant predatory dinosaur Carcharodontosaurus eyes a group of Elosuchus — crocodile-like hunters — near a carcass. Credit: Artwork by Davide Bonadonna\r\n100 million years ago, ferocious predators, including flying reptiles and crocodile-… [+3134 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Julia Musto", "title": "Fossil shows cold-blooded frogs lived on warm Antarctica - Fox News", "description": "A 40 million-year-old frog fossil has revealed that cold-blooded frogs once inhabited a warm Antarctica.", "url": "https://www.foxnews.com/science/fossil-shows-cold-blooded-frogs-lived-on-warm-antarctica", "urlToImage": null, "publishedAt": "2020-04-25T21:35:22Z", "content": "A 40 million-year-old frog fossil has revealed that cold-blooded frogs once inhabited a warm Antarctica.\r\nThe specimen, discovered in 2015 by Swedish vertebrate paleontologist Dr. Thomas Mörs, is most likely related to a species currently living in South Amer… [+2632 chars]"}, {"source": {"id": null, "name": "Universetoday.com"}, "author": "https://www.facebook.com/Storiesbywilliams-205745679447998/?ref=hl", "title": "This is the Final Picture NASA's Spitzer Space Telescope - Universe Today", "description": "NASA has just released a mosaic of the California Nebula, which was created from the final images snapped by the Spitzer Space Telescope.", "url": "https://www.universetoday.com/145828/this-is-the-final-picture-nasas-spitzer-space-telescope/", "urlToImage": null, "publishedAt": "2020-04-25T21:24:00Z", "content": "On Jan. 30th, 2020, NASA’s Spitzer Space Telescope was retired after sixteen years of faithful service. As one of the four NASA Great Observatories – alongside Hubble, Chandra, and Compton space telescopes – Spitzer was dedicated to studying the Universe in i… [+5261 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": null, "title": "NASA scientists get look inside comet from outside Earth's solar system - The Jerusalem Post", "description": "Since the comet 2I/Borisov was first observed entering our solar system in 2019, it has intrigued scientists as a time capsule from another sector of the universe.", "url": "https://www.jpost.com/international/nasa-scientists-get-look-inside-comet-from-outside-earths-solar-system-625868", "urlToImage": null, "publishedAt": "2020-04-25T20:25:00Z", "content": null}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "The Largest Hole in the Ozone Layer Over the Arctic Has Been Closed - Somag News", "description": "The large ozone hole observed last month in the Arctic, located above the north polar circle of the world, was completely closed according to the statement made by scientists. Scientists have explained that this phenomenon is not related to the coronavirus. T…", "url": "https://www.somagnews.com/largest-hole-ozone-layer-arctic-closed/", "urlToImage": null, "publishedAt": "2020-04-25T19:48:00Z", "content": "The large ozone hole observed last month in the Arctic, located above the north polar circle of the world, was completely closed according to the statement made by scientists. Scientists have explained that this phenomenon is not related to the coronavirus.\r\n… [+2194 chars]"}, {"source": {"id": null, "name": "Newser.com"}, "author": "Neal Colgrass", "title": "Scientists Spot the 'Most Dangerous Place in History' - Newser", "description": "100M years ago, Morocco was not for the faint of heart", "url": "https://www.newser.com/story/290053/scientists-find-the-most-dangerous-place-in-history.html", "urlToImage": null, "publishedAt": "2020-04-25T17:00:00Z", "content": "(Newser)\r\nMorocco looked a lot different 100 million years ago—and it wasn't too inviting. This according to scientists who studied fossils and say southeastern Morocco was heavily populated with animals, including three of the biggest predatory dinosaurs eve… [+1271 chars]"}, {"source": {"id": null, "name": "Digitaltrends.com"}, "author": "Georgina Torbet", "title": "NASA’s Perseverance rover is perfectly balanced for its trip to Mars - Digital Trends", "description": "NASA's Perseverance rover is preparing for its launch to Mars has just made it through one more item on the list: Ensuring that it is correctly balanced.", "url": "https://www.digitaltrends.com/news/nasa-perseverance-rover-balance/", "urlToImage": null, "publishedAt": "2020-04-25T16:00:25Z", "content": "NASA’s Perseverance rover is preparing for launch in the next few months by undergoing final checks, and it has just made it through one more item on the list: Ensuring that it is correctly balanced.\r\nPart of the final preparations for readying the rover for … [+1853 chars]"}, {"source": {"id": null, "name": "Heritagedaily.com"}, "author": "http://www.facebook.com/archaeologynews", "title": "Hubble celebrates its 30th anniversary with a tapestry of blazing starbirth - HeritageDaily - Archaeology News - HeritageDaily", "description": "Hubble Space Telescope's iconic images and scientific breakthroughs have redefined our view of the Universe. - Space & Planetary HeritageDaily - Archaeology News", "url": "https://www.heritagedaily.com/2020/04/hubble-celebrates-its-30th-anniversary-with-a-tapestry-of-blazing-starbirth/127932", "urlToImage": null, "publishedAt": "2020-04-25T15:49:09Z", "content": "Hubble Space Telescope’s iconic images and scientific breakthroughs have redefined our view of the Universe.\r\nTo commemorate three decades of scientific discoveries, this image is one of the most photogenic examples of the many turbulent stellar nurseries the… [+5184 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Carly Cassella", "title": "Controversial Discovery Says Origins of Human Language Existed 25 Million Years Ago - ScienceAlert", "description": "A structure critical to our brain's core language pathway, found only in humans and apes, has now also been identified in monkeys, according to a controversial new study - suggesting the origins of language may have appeared 20 to 25 million years ea", "url": "https://www.sciencealert.com/controversial-discovery-in-monkeys-pushes-the-origin-of-human-language-back-25-million-years", "urlToImage": null, "publishedAt": "2020-04-25T09:31:17Z", "content": "A structure critical to our brain's core language pathway, found only in humans and apes, has now also been identified in monkeys, according to a controversial new study - suggesting the origins of language may have appeared 20 to 25 million years earlier tha… [+4838 chars]"}]}