{"status": "ok", "totalResults": 37, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Astronomers find 'alien' asteroids living in our solar system - CNN", "description": "Scientists In the last few years have studied the first observed interstellar visitors to our solar system. They include a comet called 2I/Borisov, spotted in 2019 and still passing through, and an asteroid called 'Oumuamua that zipped through quickly in 2017.", "url": "https://www.cnn.com/2020/04/26/world/alien-asteroids-solar-system-scn-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-26T05:04:00Z", "content": "(CNN)Scientists In the last few years have studied the first observed interstellar visitors to our solar system. They include a comet called 2I/Borisov, spotted in 2019 and still passing through, and an asteroid called 'Oumuamua that zipped through quickly in… [+4388 chars]"}, {"source": {"id": null, "name": "Nasaspaceflight.com"}, "author": null, "title": "Starship SN4 set for cryogenic proof test - NASASpaceflight.com", "description": "Starship SN4 is set for a crucial cryogenic proof test as early as Saturday evening…", "url": "https://www.nasaspaceflight.com/2020/04/starship-sn4-set-for-test/", "urlToImage": null, "publishedAt": "2020-04-26T00:55:27Z", "content": "Starship SN4 is set for a crucial cryogenic proof test as early as Saturday evening at SpaceX’s launch site in Boca Chica, Texas. The cryogenic proof test is one of the first tests necessary to prove the vehicle’s flight-worthiness. If all goes well, SpaceX t… [+5301 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "“Most Dangerous Place in the History of Planet Earth” Revealed by Paleontologists - SciTechDaily", "description": "100 million years ago, ferocious predators, including flying reptiles and crocodile-like hunters, made the Sahara the most dangerous place on Earth. This is according to an international team of scientists, who have published the biggest review in almost 100 …", "url": "https://scitechdaily.com/most-dangerous-place-in-the-history-of-planet-earth-revealed-by-paleontologists/", "urlToImage": null, "publishedAt": "2020-04-25T22:55:27Z", "content": "Predator paradise — The giant predatory dinosaur Carcharodontosaurus eyes a group of Elosuchus — crocodile-like hunters — near a carcass. Credit: Artwork by Davide Bonadonna\r\n100 million years ago, ferocious predators, including flying reptiles and crocodile-… [+3134 chars]"}, {"source": {"id": null, "name": "Voanews.com"}, "author": "VOA Learning English", "title": "Scientists Study Unusual Comet - VOA Learning English", "description": "Amateur astronomer Gennady Borisov was the first person to identify a new comet in August of 2019. Researchers reported on Monday that gas coming off the comet, 2I/Borisov, had high levels of carbon monoxide - far more than comets formed in our solar system.", "url": "https://learningenglish.voanews.com/a/scientists-study-unusual-comet-/5384347.html", "urlToImage": null, "publishedAt": "2020-04-25T21:58:00Z", "content": "Scientists recently reported new details about the second interstellar object ever seen passing through our solar system. It is a comet called 2I/Borisov.\r\nComets are made up of frozen gases, rock and dust that orbit stars. The Reuters news agency likens them… [+3202 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Mike Wall", "title": "Big asteroid shows itself ahead of Earth flyby on April 29 - Livescience.com", "description": "We have nothing to fear from 1998 OR2.", "url": "https://www.livescience.com/asteroid-1998-or2-photo-april-2020-flyby.html", "urlToImage": null, "publishedAt": "2020-04-25T21:40:00Z", "content": "We've now got a good visual on the big space rock that's going to fly by Earth next week.\r\nOn Saturday (April 18), the Arecibo Observatory\r\n in Puerto Rico captured a radar image of the asteroid 1998 OR2, which will zoom within 3.9 million miles (6.3 million … [+2360 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Julia Musto", "title": "Fossil shows cold-blooded frogs lived on warm Antarctica - Fox News", "description": "A 40 million-year-old frog fossil has revealed that cold-blooded frogs once inhabited a warm Antarctica.", "url": "https://www.foxnews.com/science/fossil-shows-cold-blooded-frogs-lived-on-warm-antarctica", "urlToImage": null, "publishedAt": "2020-04-25T21:35:22Z", "content": "A 40 million-year-old frog fossil has revealed that cold-blooded frogs once inhabited a warm Antarctica.\r\nThe specimen, discovered in 2015 by Swedish vertebrate paleontologist Dr. Thomas Mörs, is most likely related to a species currently living in South Amer… [+2632 chars]"}, {"source": {"id": null, "name": "Universetoday.com"}, "author": "https://www.facebook.com/Storiesbywilliams-205745679447998/?ref=hl", "title": "This is the Final Picture NASA's Spitzer Space Telescope - Universe Today", "description": "NASA has just released a mosaic of the California Nebula, which was created from the final images snapped by the Spitzer Space Telescope.", "url": "https://www.universetoday.com/145828/this-is-the-final-picture-nasas-spitzer-space-telescope/", "urlToImage": null, "publishedAt": "2020-04-25T21:24:00Z", "content": "On Jan. 30th, 2020, NASA’s Spitzer Space Telescope was retired after sixteen years of faithful service. As one of the four NASA Great Observatories – alongside Hubble, Chandra, and Compton space telescopes – Spitzer was dedicated to studying the Universe in i… [+5261 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "The Largest Hole in the Ozone Layer Over the Arctic Has Been Closed - Somag News", "description": "The large ozone hole observed last month in the Arctic, located above the north polar circle of the world, was completely closed according to the statement made by scientists. Scientists have explained that this phenomenon is not related to the coronavirus. T…", "url": "https://www.somagnews.com/largest-hole-ozone-layer-arctic-closed/", "urlToImage": null, "publishedAt": "2020-04-25T19:48:00Z", "content": "The large ozone hole observed last month in the Arctic, located above the north polar circle of the world, was completely closed according to the statement made by scientists. Scientists have explained that this phenomenon is not related to the coronavirus.\r\n… [+2194 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Georgina Torbet", "title": "Starlink beta could begin within 3 months, according to Elon Musk - Yahoo Tech", "description": "It will begin with a private beta, with public beta in six months", "url": "https://finance.yahoo.com/news/starlink-beta-could-begin-within-194759001.html", "urlToImage": null, "publishedAt": "2020-04-25T19:47:00Z", "content": "SpaceX could begin beta testing its Starlink global satellite internet program within a few months, according to CEO Elon Musk.\r\nIn a tweet this week, Musk revealed that the Starlink private beta will begin within approximately three months, with the public b… [+2398 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NASA Builds COVID-19 Ventilator - Newsy", "description": "The agency built a high-pressure ventilator prototype tailored to COVID-19 patients in just 37 days. Learn more about this story at https://www.newsy.com/100...", "url": "https://www.youtube.com/watch?v=G2-M7aIe04o", "urlToImage": null, "publishedAt": "2020-04-25T18:56:27Z", "content": null}, {"source": {"id": null, "name": "Newser.com"}, "author": "Neal Colgrass", "title": "Scientists Spot the 'Most Dangerous Place in History' - Newser", "description": "100M years ago, Morocco was not for the faint of heart", "url": "https://www.newser.com/story/290053/scientists-find-the-most-dangerous-place-in-history.html", "urlToImage": null, "publishedAt": "2020-04-25T17:00:00Z", "content": "(Newser)\r\nMorocco looked a lot different 100 million years ago—and it wasn't too inviting. This according to scientists who studied fossils and say southeastern Morocco was heavily populated with animals, including three of the biggest predatory dinosaurs eve… [+1271 chars]"}, {"source": {"id": null, "name": "Digitaltrends.com"}, "author": "Georgina Torbet", "title": "NASA’s Perseverance rover is perfectly balanced for its trip to Mars - Digital Trends", "description": "NASA's Perseverance rover is preparing for its launch to Mars has just made it through one more item on the list: Ensuring that it is correctly balanced.", "url": "https://www.digitaltrends.com/news/nasa-perseverance-rover-balance/", "urlToImage": null, "publishedAt": "2020-04-25T16:00:25Z", "content": "NASA’s Perseverance rover is preparing for launch in the next few months by undergoing final checks, and it has just made it through one more item on the list: Ensuring that it is correctly balanced.\r\nPart of the final preparations for readying the rover for … [+1853 chars]"}, {"source": {"id": null, "name": "Interestingengineering.com"}, "author": "Loukia Papadopoulos", "title": "SpaceX Completes Falcon 9 Static Fire Test - Interesting Engineering", "description": "The test comes on the heels of another successful static fire test earlier this week.", "url": "https://interestingengineering.com/spacex-successfully-completes-falcon-9-static-fire-test", "urlToImage": null, "publishedAt": "2020-04-25T13:33:43Z", "content": "Preparations for Crew Dragon’s first operational mission seems to be going well. SpaceX's rocket development facility in McGregor, Texas, announced on Saturday that it successfully completed a static fire test of the Falcon 9 first stage that will launch the … [+1718 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew May", "title": "Celebrating 30 years of the Hubble Space Telescope - Space.com", "description": "Celebrating three decades of an icon of science — and a triumph of technology.", "url": "https://www.space.com/hubble-space-telescope-turns-30.html", "urlToImage": null, "publishedAt": "2020-04-25T12:43:31Z", "content": "It's been 30 years since NASA launched the Hubble Space Telescope on April 24, 1990. The observatory was carried aloft in the payload bay of space shuttle Discovery, and for three decades Hubble's history was closely intertwined with the shuttle's. The telesc… [+8383 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Carly Cassella", "title": "Controversial Discovery Says Origins of Human Language Existed 25 Million Years Ago - ScienceAlert", "description": "A structure critical to our brain's core language pathway, found only in humans and apes, has now also been identified in monkeys, according to a controversial new study - suggesting the origins of language may have appeared 20 to 25 million years ea", "url": "https://www.sciencealert.com/controversial-discovery-in-monkeys-pushes-the-origin-of-human-language-back-25-million-years", "urlToImage": null, "publishedAt": "2020-04-25T09:31:17Z", "content": "A structure critical to our brain's core language pathway, found only in humans and apes, has now also been identified in monkeys, according to a controversial new study - suggesting the origins of language may have appeared 20 to 25 million years earlier tha… [+4838 chars]"}, {"source": {"id": null, "name": "Syfy.com"}, "author": "Elizabeth Rayne", "title": "This planet is so scorching that metals actually vaporize into the atmosphere - SYFY WIRE", "description": "There are hot planets, and then there are unbelievably, unbearably, insufferably hot planets. Imagine an alien world torrid enough to not just melt, but vaporize metal. MASCARA-2 b (whose name has absolutely nothing to do with makeup) is that planet. A team o…", "url": "https://www.syfy.com/syfywire/this-planet-is-so-hot-it-makes-metals-vaporize", "urlToImage": null, "publishedAt": "2020-04-25T02:16:44Z", "content": "There are hot planets, and then there are unbelievably, unbearably, insufferably hot planets.\r\nImagine an alien world torrid enough to not just melt, but vaporize metal. MASCARA-2 b (whose name has absolutely nothing to do with makeup) is that planet. A team … [+3176 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Star Captured by Supermassive Black Hole’s Gravity – And Survives! - SciTechDaily", "description": "Astronomers may have discovered a new kind of survival story: a star that had a brush with a giant black hole and lived to tell the tale through exclamations of X-rays. Data from NASA’s Chandra X-ray Observatory and ESA’s XMM-Newton uncovered the account that…", "url": "https://scitechdaily.com/star-captured-by-supermassive-black-holes-gravity-and-survives/", "urlToImage": null, "publishedAt": "2020-04-24T23:04:34Z", "content": "Astronomers may have discovered a new kind of survival story: a star that had a brush with a giant black hole and lived to tell the tale through exclamations of X-rays. Data from NASA’s Chandra X-ray Observatory and ESA’s XMM-Newton uncovered the account that… [+5133 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Michael Thomsen For Dailymail.com", "title": "Time passes faster at the top of skyscrapers according to new study - Daily Mail", "description": "A new study from the University of Tokyo has shown that time actually passes at a different speed at the top of skyscrapers and other tall buildings, at a rate of four nanoseconds more quickly.", "url": "https://www.dailymail.co.uk/sciencetech/article-8254271/Time-passes-faster-skyscrapers-according-new-study.html", "urlToImage": null, "publishedAt": "2020-04-24T22:22:17Z", "content": "A new study from the University of Tokyo has shown that time actually passes at a different speed at the top of skyscrapers and other tall buildings.\r\nA team, led by quantum electronics professor Hidetoshi Katori, climbed to the top of the Tokyo Skytree, the … [+4009 chars]"}, {"source": {"id": null, "name": "Thrillist.com"}, "author": "Dustin Nelson", "title": "Venus Will Be the Brightest It’ll Be All Year on April 27 - Thrillist", "description": "It'll be quite bright.", "url": "https://www.thrillist.com/news/nation/venus-bright-tonight-april", "urlToImage": null, "publishedAt": "2020-04-24T22:07:30Z", "content": "Venus is the brightest natural object in our sky after the moon and the sun. If you've looked out the window or enjoyed the spring air after sunset over the last month-plus, you've probably seen it, even if you didn't know you were seeing it. Early in the eve… [+993 chars]"}, {"source": {"id": null, "name": "Ancient-origins.net"}, "author": "ashley cowie", "title": "Historic Archive Tells Dark Story Of Death By Meteorite - Ancient Origins", "description": "Researchers have unearthed the only historically documented case of people being struck by a meteorite.", "url": "https://www.ancient-origins.net/news-history-archaeology/meteorite-death-0013614", "urlToImage": null, "publishedAt": "2020-04-24T22:03:00Z", "content": "Researchers have unearthed the only historically documented case of people being struck by a meteorite. \r\nTales of meteorites falling to Earth are carved on prehistoric stones and featured in the Bible, for example, in Revelation 6:13 , when we read the stars… [+4715 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Charles Q. Choi", "title": "Mystery of Venus atmosphere's weird rotation may finally be solved - Space.com", "description": "Thermal tides in the atmosphere make it rotate faster than the planet's surface, a new study finds.", "url": "https://www.space.com/venus-atmosphere-super-rotation-mystery-solved.html", "urlToImage": null, "publishedAt": "2020-04-24T21:59:00Z", "content": "The mystery behind why the atmosphere of Venus spins much faster than the planet's surface may finally be solved, a new study finds.\r\nThe finding might help shed light on how habitable distant exoplanets, or worlds beyond our solar system, may actually be, re… [+3613 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Matthew Chapman", "title": "Trump asked NASA if their technology could sterilize the inside of people’s lungs to kill coronavirus - Raw Story", "description": "According to Cleveland.com, President Donald Trump asked NASA Administrator Jim Bridenstine if an experimental disinfectant fog in development at the Glenn Research Center could be used to sterilize the inside of people’s lungs to treat coronavirus. “Clevelan…", "url": "https://www.rawstory.com/2020/04/trump-asked-nasa-if-their-technology-could-sterilize-the-inside-of-peoples-lungs-to-kill-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-24T21:45:22Z", "content": "According to Cleveland.com, President Donald Trump asked NASA Administrator Jim Bridenstine if an experimental disinfectant fog in development at the Glenn Research Center could be used to sterilize the inside of people’s lungs to treat coronavirus.\r\n“Clevela… [+2747 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Abrar Al-Heeti", "title": "China shares the name of its Mars mission - CNET", "description": "The unmanned mission is slated to launch this year.", "url": "https://www.cnet.com/news/china-shares-the-name-of-its-mars-mission/", "urlToImage": null, "publishedAt": "2020-04-24T21:22:57Z", "content": "China is launching an unmanned exploration mission to Mars.\r\nGetty Images\r\nChina's space agency shared the name of its first Mars mission on Friday: Tianwen-1, according to Reuters. The unmanned exploration mission is slated to launch this year. \r\nThe name is… [+531 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Mindy Weisberger", "title": "Black hole bends escaping light 'like a boomerang' - Livescience.com", "description": "Even light can't resist the pull of these irresistible cosmic objects.", "url": "https://www.livescience.com/black-hold-bends-light-like-boomerang.html", "urlToImage": null, "publishedAt": "2020-04-24T20:39:00Z", "content": "Light escaping from a black hole may \"boomerang\" its way to freedom, new X-ray images reveal.\r\nResearchers found this odd behavior while reviewing archival X-ray\r\n observations of a black hole that's approximately 10 times as massive as our sun. Located about… [+3950 chars]"}, {"source": {"id": null, "name": "Medpagetoday.com"}, "author": "Molly  Walker", "title": "High-Dose CQ Tied to Death, Cardiac Events in COVID-19 Patients - MedPage Today", "description": "Trial stopped due to prolonged QTc interval, higher rate of death in high- vs low-dose group", "url": "https://www.medpagetoday.com/infectiousdisease/covid19/86151", "urlToImage": null, "publishedAt": "2020-04-24T20:01:01Z", "content": "Hospitalized patients with COVID-19 coronavirus infection treated with high-dose chloroquine diphosphate (CQ) in conjunction with azithromycin or oseltamivir experienced higher rates of death and adverse cardiac events compared with a low-dose group, an unpla… [+5246 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Space.com Staff", "title": "The Best Hubble Space Telescope Images of All Time! - Space.com", "description": "", "url": "https://www.space.com/best-hubble-space-telescope-images.html", "urlToImage": null, "publishedAt": "2020-04-24T18:57:00Z", "content": "The spiral galaxy NGC 772, seen here in a 2019 image from the Hubble Space Telescope, bears some striking similarities to the Milky Way galaxy that we call home, with its spiral arms, glowing core and dark dust lanes. But there are some key differences betwee… [+437 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Matt Shipman", "title": "Catalyst opens door to more efficient, environmentally friendly ethylene production - Phys.org", "description": "A research team led by North Carolina State University has engineered a new catalyst that can more efficiently convert ethane into ethylene, which is used in a variety of manufacturing processes. The discovery could be used in a conversion process to drastica…", "url": "https://phys.org/news/2020-04-catalyst-door-efficient-environmentally-friendly.html", "urlToImage": null, "publishedAt": "2020-04-24T18:16:56Z", "content": "A research team led by North Carolina State University has engineered a new catalyst that can more efficiently convert ethane into ethylene, which is used in a variety of manufacturing processes. The discovery could be used in a conversion process to drastica… [+2945 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Engineers open door to big new library of tiny nanoparticles - Phys.org", "description": "The development of bimetallic nanoparticles (i.e., tiny particles composed of two different metals that exhibit several new and improved properties) represents a novel area of research with a wide range of potential applications. Now, a research team in the U…", "url": "https://phys.org/news/2020-04-door-big-library-tiny-nanoparticles.html", "urlToImage": null, "publishedAt": "2020-04-24T18:09:04Z", "content": "The development of bimetallic nanoparticles (i.e., tiny particles composed of two different metals that exhibit several new and improved properties) represents a novel area of research with a wide range of potential applications. Now, a research team in the U… [+3847 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "BCI system gives paralyzed man back his sense of touch with haptic feedback - Ars Technica", "description": "Long-term goal is to develop system that works as well at home as in the laboratory.", "url": "https://arstechnica.com/science/2020/04/bci-system-gives-paralyzed-man-back-his-sense-of-touch-with-haptic-feedback/", "urlToImage": null, "publishedAt": "2020-04-24T17:51:00Z", "content": "Enlarge/ Ian Burkhard suffered a severe spinal cord injury in 2010. Battelle's NeuroLife project is restoring motor function to his right arm with a brain-computer-interface system.\r\n4 with 4 posters participating\r\nIan Burkhart, now 28, had a diving accident … [+7377 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jonathan Chadwick For Mailonline", "title": "Tropical coral reefs are being transformed by climate change - Daily Mail", "description": "Climate change and warming seas are severely bleaching tropical coral reefs and undoing decades of knowledge about how to protect these delicate and vital ecosystems.", "url": "https://www.dailymail.co.uk/sciencetech/article-8253723/Tropical-coral-reefs-transformed-climate-change.html", "urlToImage": null, "publishedAt": "2020-04-24T14:50:45Z", "content": "Coral reefs are so fundamentally damaged by climate change that decades of research on how to protect them may not even still be applicable, scientists say.  \r\nIn a study of coral over 20 years, UK scientists found that a warming climate undoes decades of kno… [+6834 chars]"}, {"source": {"id": null, "name": "Eurekalert.org"}, "author": null, "title": "Paleontologists reveal 'the most dangerous place in the history of planet Earth' - EurekAlert", "description": "100 million years ago, ferocious predators, including flying reptiles and crocodile-like hunters, made the Sahara the most dangerous place on Earth.", "url": "https://eurekalert.org/pub_releases/2020-04/uop-pr042420.php", "urlToImage": null, "publishedAt": "2020-04-24T14:45:42Z", "content": "IMAGE: Predator paradise - The giant predatory dinosaur Carcharodontosaurus eyes a group of Elosuchus - crocodile-like hunters - near a carcass. Artwork by Davide Bonadonna\r\n view more \r\nCredit: Artwork by Davide Bonadonna\r\n100 million years ago, ferocious pr… [+4453 chars]"}, {"source": {"id": null, "name": "Planetary.org"}, "author": null, "title": "A Puffy Planet and a Cat on Titan - The Planetary Society", "description": "News from the forefront of exploration, plus a collection to help you keep your cosmic calm.", "url": "https://www.planetary.org/the-downlink/puffy-planet-cat-titan.html", "urlToImage": null, "publishedAt": "2020-04-24T14:22:01Z", "content": null}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Aristos Georgiou", "title": "First Comprehensive Geological Map of the Moon Created by USGS - Newsweek", "description": "The map was put together using six regional maps made during the Apollo era, in combination with information collected during recent lunar missions.", "url": "https://www.newsweek.com/first-comprehensive-geological-map-moon-usgs-1500006", "urlToImage": null, "publishedAt": "2020-04-24T12:43:32Z", "content": "Researchers have created a unique map of the moon that reveals the geological make-up of our natural satellite.\r\nAccording to the United States Geological Survey (USGS), the so-called \"Unified Geologic Map of the Moon\" is the definitive blueprint of the moon'… [+2385 chars]"}, {"source": {"id": null, "name": "Theconversation.com"}, "author": "Daniel Garcia-Castellanos", "title": "Tomanowos, the meteorite that survived mega-floods and human folly - The Conversation US", "description": "Tomanowos, aka the Willamette Meteorite, may be the world's most interesting rock. Its story includes catastrophic ice age floods, theft of Native American cultural heritage and plenty of human folly.", "url": "https://theconversation.com/tomanowos-the-meteorite-that-survived-mega-floods-and-human-folly-134213", "urlToImage": null, "publishedAt": "2020-04-24T12:23:00Z", "content": "The rock with arguably the most fascinating story on Earth has an ancient name: Tomanowos. It means the visitor from heaven in the extinct language of Oregons Clackamas Indian tribe.\r\nThe Clackamas revered the Tomanowos also known as the Willamette meteorite … [+6446 chars]"}, {"source": {"id": null, "name": "Theregister.co.uk"}, "author": "Katyanna Quach", "title": "Nineteen mysterious invaders from another Solar System spotted hanging around the outside edge of ours - The Register", "description": "Plus astroboffins confirm 'masked' asteroid heading Earthwards", "url": "https://www.theregister.co.uk/2020/04/24/oddball_asteroids_orbiting/", "urlToImage": null, "publishedAt": "2020-04-24T12:05:00Z", "content": "Astronomers have discovered a new population of foreign asteroids that have been quietly orbiting the Sun on the outskirts of our Solar System.\r\nThese 19 space rocks have been right under our noses the entire time, almost since the Solar System formed some 4.… [+3395 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Kevin Stacey", "title": "Researchers solve 'link discovery' problem for terahertz data networks - Phys.org", "description": "When someone opens a laptop, a router can quickly locate it and connect it to the local Wi-Fi network. That ability is a basic element of any wireless network known as link discovery, and now a team of researchers has developed a means of doing it with terahe…", "url": "https://phys.org/news/2020-04-link-discovery-problem-terahertz-networks.html", "urlToImage": null, "publishedAt": "2020-04-24T11:31:08Z", "content": "When someone opens a laptop, a router can quickly locate it and connect it to the local Wi-Fi network. That ability is a basic element of any wireless network known as link discovery, and now a team of researchers has developed a means of doing it with terahe… [+4150 chars]"}]}