{"status": "ok", "totalResults": 35, "articles": [{"source": {"id": null, "name": "Fox13now.com"}, "author": "", "title": "Satellite \"train\" passing over Utah Sunday night - fox13now.com", "description": "", "url": "https://www.fox13now.com/satellite-train-passing-over-utah-sunday-night", "urlToImage": null, "publishedAt": "2020-04-26T14:15:24Z", "content": "SALT LAKE CITY, Utah According to NASA/JPL Ambassador to Utah Patrick Wiggins, a group of 60 Starlink satellites that were launched by SpaceX last Wednesday will be passing over Utah Sunday night.\r\nThe set of satellites are jokingly referred to as a train, be… [+720 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daniel Garcia-Castellanos", "title": "Tomanowos, the meteorite that survived mega-floods and human folly - Space.com", "description": "", "url": "https://www.space.com/tomanowos-meteorite-survived-mega-floods-human-folly.html", "urlToImage": null, "publishedAt": "2020-04-26T14:10:00Z", "content": "This article was originally published at The Conversation. The publication contributed the article to Space.com's Expert Voices: Op-Ed &amp; Insights.\r\nDaniel Garcia-Castellanos, Earth scientist, Instituto de Ciencias de la Tierra Jaume Almera (ICTJA - CSIC)\r… [+7190 chars]"}, {"source": {"id": null, "name": "Earthsky.org"}, "author": "EarthSky Voices", "title": "A unique (so far) gravitational wave signal - EarthSky", "description": "LIGO and Virgo detectors have now captured the first gravitational waves from a binary black hole merger where the black hole masses are unequal.", "url": "https://earthsky.org/space/a-gravitational-wave-signal-like-none-before", "urlToImage": null, "publishedAt": "2020-04-26T11:42:46Z", "content": "Originally published by the Max Planck Institute for Gravitational Physics (Albert Einstein Institute, or AEI) in Hannover, Germany on April 20, 2020.\r\nThe expectations of the gravitational-wave research community have been fulfilled: gravitational-wave disco… [+6739 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Christopher Wanjek", "title": "How Space Travel Tries to Kill You and Make You Ugly - WIRED", "description": "Oh also, it makes you blind and stupid, too.", "url": "https://www.wired.com/story/how-space-tries-kill-you-make-you-ugly/", "urlToImage": null, "publishedAt": "2020-04-26T11:40:53Z", "content": "Of these 34 risks, three are potential showstoppers: radiation, gravity (or lack thereof), and the need for surgery or a complicated medical procedure.\r\nLets explore the gravity issue.\r\nSome science fiction writers in the mid-20th century speculated that zero… [+3425 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Karen Crouse", "title": "Katie Ledecky Is Swimming, and Studying - The New York Times", "description": "The five-time Olympic gold medalist is taking an infectious diseases class at Stanford and still finding a way to train.", "url": "https://www.nytimes.com/2020/04/26/sports/coronavirus-ledecky-olympics-swimmers.html", "urlToImage": null, "publishedAt": "2020-04-26T07:27:48Z", "content": "People throughout the sports world, from athletes to arena staff members, tell The New York Times how their lives have changed during the coronavirus pandemic.\r\nIt was a Saturday in California and the five-time Olympic gold medalist Katie Ledecky had a compet… [+5793 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Astronomers find 'alien' asteroids living in our solar system - CNN", "description": "Scientists In the last few years have studied the first observed interstellar visitors to our solar system. They include a comet called 2I/Borisov, spotted in 2019 and still passing through, and an asteroid called 'Oumuamua that zipped through quickly in 2017.", "url": "https://www.cnn.com/2020/04/26/world/alien-asteroids-solar-system-scn-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-26T05:04:00Z", "content": "(CNN)Scientists In the last few years have studied the first observed interstellar visitors to our solar system. They include a comet called 2I/Borisov, spotted in 2019 and still passing through, and an asteroid called 'Oumuamua that zipped through quickly in… [+4388 chars]"}, {"source": {"id": null, "name": "Abc13.com"}, "author": null, "title": "NASA Astronaut Andrew Morgan welcomed back to Earth with parade in Friendswood - KTRK-TV", "description": "Welcome home, Dr. Morgan! 🌎", "url": "https://abc13.com/friendswood-parade-nasa-astronaut-andrew-morgan-back-on-earth/6129564/", "urlToImage": null, "publishedAt": "2020-04-26T00:22:43Z", "content": "FRIENDSWOOD, Texas (KTRK) -- NASA Astronaut Andrew Morgan was welcomed back to Earth with a homecoming celebration.Morgan's friends and family gathered to celebrate with a street parade in his home in Friendswood.\r\nDr. Morgan returned back to Earth on April 1… [+260 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "“Most Dangerous Place in the History of Planet Earth” Revealed by Paleontologists - SciTechDaily", "description": "100 million years ago, ferocious predators, including flying reptiles and crocodile-like hunters, made the Sahara the most dangerous place on Earth. This is according to an international team of scientists, who have published the biggest review in almost 100 …", "url": "https://scitechdaily.com/most-dangerous-place-in-the-history-of-planet-earth-revealed-by-paleontologists/", "urlToImage": null, "publishedAt": "2020-04-25T22:55:27Z", "content": "Predator paradise — The giant predatory dinosaur Carcharodontosaurus eyes a group of Elosuchus — crocodile-like hunters — near a carcass. Credit: Artwork by Davide Bonadonna\r\n100 million years ago, ferocious predators, including flying reptiles and crocodile-… [+3134 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Mike Wall", "title": "Big asteroid shows itself ahead of Earth flyby on April 29 - Livescience.com", "description": "We have nothing to fear from 1998 OR2.", "url": "https://www.livescience.com/asteroid-1998-or2-photo-april-2020-flyby.html", "urlToImage": null, "publishedAt": "2020-04-25T21:40:00Z", "content": "We've now got a good visual on the big space rock that's going to fly by Earth next week.\r\nOn Saturday (April 18), the Arecibo Observatory\r\n in Puerto Rico captured a radar image of the asteroid 1998 OR2, which will zoom within 3.9 million miles (6.3 million … [+2360 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Julia Musto", "title": "Fossil shows cold-blooded frogs lived on warm Antarctica - Fox News", "description": "A 40 million-year-old frog fossil has revealed that cold-blooded frogs once inhabited a warm Antarctica.", "url": "https://www.foxnews.com/science/fossil-shows-cold-blooded-frogs-lived-on-warm-antarctica", "urlToImage": null, "publishedAt": "2020-04-25T21:35:22Z", "content": "A 40 million-year-old frog fossil has revealed that cold-blooded frogs once inhabited a warm Antarctica.\r\nThe specimen, discovered in 2015 by Swedish vertebrate paleontologist Dr. Thomas Mörs, is most likely related to a species currently living in South Amer… [+2632 chars]"}, {"source": {"id": null, "name": "Universetoday.com"}, "author": "https://www.facebook.com/Storiesbywilliams-205745679447998/?ref=hl", "title": "This is the Final Picture NASA's Spitzer Space Telescope - Universe Today", "description": "NASA has just released a mosaic of the California Nebula, which was created from the final images snapped by the Spitzer Space Telescope.", "url": "https://www.universetoday.com/145828/this-is-the-final-picture-nasas-spitzer-space-telescope/", "urlToImage": null, "publishedAt": "2020-04-25T21:24:00Z", "content": "On Jan. 30th, 2020, NASA’s Spitzer Space Telescope was retired after sixteen years of faithful service. As one of the four NASA Great Observatories – alongside Hubble, Chandra, and Compton space telescopes – Spitzer was dedicated to studying the Universe in i… [+5261 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": null, "title": "NASA scientists get look inside comet from outside Earth's solar system - The Jerusalem Post", "description": "Since the comet 2I/Borisov was first observed entering our solar system in 2019, it has intrigued scientists as a time capsule from another sector of the universe.", "url": "https://www.jpost.com/international/nasa-scientists-get-look-inside-comet-from-outside-earths-solar-system-625868", "urlToImage": null, "publishedAt": "2020-04-25T20:25:00Z", "content": null}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "The Largest Hole in the Ozone Layer Over the Arctic Has Been Closed - Somag News", "description": "The large ozone hole observed last month in the Arctic, located above the north polar circle of the world, was completely closed according to the statement made by scientists. Scientists have explained that this phenomenon is not related to the coronavirus. T…", "url": "https://www.somagnews.com/largest-hole-ozone-layer-arctic-closed/", "urlToImage": null, "publishedAt": "2020-04-25T19:48:00Z", "content": "The large ozone hole observed last month in the Arctic, located above the north polar circle of the world, was completely closed according to the statement made by scientists. Scientists have explained that this phenomenon is not related to the coronavirus.\r\n… [+2194 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NASA Builds COVID-19 Ventilator - Newsy", "description": "The agency built a high-pressure ventilator prototype tailored to COVID-19 patients in just 37 days. Learn more about this story at https://www.newsy.com/100...", "url": "https://www.youtube.com/watch?v=G2-M7aIe04o", "urlToImage": null, "publishedAt": "2020-04-25T18:56:27Z", "content": null}, {"source": {"id": null, "name": "Newser.com"}, "author": "Neal Colgrass", "title": "Scientists Spot the 'Most Dangerous Place in History' - Newser", "description": "100M years ago, Morocco was not for the faint of heart", "url": "https://www.newser.com/story/290053/scientists-find-the-most-dangerous-place-in-history.html", "urlToImage": null, "publishedAt": "2020-04-25T17:00:00Z", "content": "(Newser)\r\nMorocco looked a lot different 100 million years ago—and it wasn't too inviting. This according to scientists who studied fossils and say southeastern Morocco was heavily populated with animals, including three of the biggest predatory dinosaurs eve… [+1271 chars]"}, {"source": {"id": null, "name": "Digitaltrends.com"}, "author": "Georgina Torbet", "title": "NASA’s Perseverance rover is perfectly balanced for its trip to Mars - Digital Trends", "description": "NASA's Perseverance rover is preparing for its launch to Mars has just made it through one more item on the list: Ensuring that it is correctly balanced.", "url": "https://www.digitaltrends.com/news/nasa-perseverance-rover-balance/", "urlToImage": null, "publishedAt": "2020-04-25T16:00:25Z", "content": "NASA’s Perseverance rover is preparing for launch in the next few months by undergoing final checks, and it has just made it through one more item on the list: Ensuring that it is correctly balanced.\r\nPart of the final preparations for readying the rover for … [+1853 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew May", "title": "Celebrating 30 years of the Hubble Space Telescope - Space.com", "description": "Celebrating three decades of an icon of science — and a triumph of technology.", "url": "https://www.space.com/hubble-space-telescope-turns-30.html", "urlToImage": null, "publishedAt": "2020-04-25T12:43:31Z", "content": "It's been 30 years since NASA launched the Hubble Space Telescope on April 24, 1990. The observatory was carried aloft in the payload bay of space shuttle Discovery, and for three decades Hubble's history was closely intertwined with the shuttle's. The telesc… [+8383 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Carly Cassella", "title": "Controversial Discovery Says Origins of Human Language Existed 25 Million Years Ago - ScienceAlert", "description": "A structure critical to our brain's core language pathway, found only in humans and apes, has now also been identified in monkeys, according to a controversial new study - suggesting the origins of language may have appeared 20 to 25 million years ea", "url": "https://www.sciencealert.com/controversial-discovery-in-monkeys-pushes-the-origin-of-human-language-back-25-million-years", "urlToImage": null, "publishedAt": "2020-04-25T09:31:17Z", "content": "A structure critical to our brain's core language pathway, found only in humans and apes, has now also been identified in monkeys, according to a controversial new study - suggesting the origins of language may have appeared 20 to 25 million years earlier tha… [+4838 chars]"}, {"source": {"id": null, "name": "Spaceflightnow.com"}, "author": null, "title": "Citing coronavirus, NASA urges public not to travel for launch of astronauts - Spaceflight Now", "description": null, "url": "https://spaceflightnow.com/2020/04/24/citing-coronavirus-concerns-nasa-discourages-public-from-attending-launch-of-astronauts/", "urlToImage": null, "publishedAt": "2020-04-25T04:48:33Z", "content": "NASA Administrator Jim Bridenstine speaks during a presentation in November 2018 at NASA Headquarters announcing the companies that will compete for the agency’s Commercial Lunar Payload Services program. Credit: NASA/Bill Ingalls\r\nNASA Administrator Jim Brid… [+6811 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Time passes faster at the top of skyscrapers according to new study - India Gone Viral", "description": "Scientists find time passes nanoseconds faster at the top of skyscrapers than on the groundResearchers in Japan climbed the Tokyo Skytree to measure the passage of timeThey found that time passed four", "url": "https://indiagoneviral.com/science/2020/04/25/time-passes-faster-at-the-top-of-skyscrapers-according-to-new-study/41853/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T02:57:44Z", "content": "A new study from the University of Tokyo has shown that time actually passes at a different speed at the top of skyscrapers and other tall buildings.\r\nA team, led by quantum electronics professor Hidetoshi Katori, climbed to the top of the Tokyo Skytree, the … [+3421 chars]"}, {"source": {"id": null, "name": "Syfy.com"}, "author": "Elizabeth Rayne", "title": "This planet is so scorching that metals actually vaporize into the atmosphere - SYFY WIRE", "description": "There are hot planets, and then there are unbelievably, unbearably, insufferably hot planets. Imagine an alien world torrid enough to not just melt, but vaporize metal. MASCARA-2 b (whose name has absolutely nothing to do with makeup) is that planet. A team o…", "url": "https://www.syfy.com/syfywire/this-planet-is-so-hot-it-makes-metals-vaporize", "urlToImage": null, "publishedAt": "2020-04-25T02:16:44Z", "content": "There are hot planets, and then there are unbelievably, unbearably, insufferably hot planets.\r\nImagine an alien world torrid enough to not just melt, but vaporize metal. MASCARA-2 b (whose name has absolutely nothing to do with makeup) is that planet. A team … [+3176 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Star Captured by Supermassive Black Hole’s Gravity – And Survives! - SciTechDaily", "description": "Astronomers may have discovered a new kind of survival story: a star that had a brush with a giant black hole and lived to tell the tale through exclamations of X-rays. Data from NASA’s Chandra X-ray Observatory and ESA’s XMM-Newton uncovered the account that…", "url": "https://scitechdaily.com/star-captured-by-supermassive-black-holes-gravity-and-survives/", "urlToImage": null, "publishedAt": "2020-04-24T23:04:34Z", "content": "Astronomers may have discovered a new kind of survival story: a star that had a brush with a giant black hole and lived to tell the tale through exclamations of X-rays. Data from NASA’s Chandra X-ray Observatory and ESA’s XMM-Newton uncovered the account that… [+5133 chars]"}, {"source": {"id": null, "name": "Thrillist.com"}, "author": "Dustin Nelson", "title": "Venus Will Be the Brightest It’ll Be All Year on April 27 - Thrillist", "description": "It'll be quite bright.", "url": "https://www.thrillist.com/news/nation/venus-bright-tonight-april", "urlToImage": null, "publishedAt": "2020-04-24T22:07:30Z", "content": "Venus is the brightest natural object in our sky after the moon and the sun. If you've looked out the window or enjoyed the spring air after sunset over the last month-plus, you've probably seen it, even if you didn't know you were seeing it. Early in the eve… [+993 chars]"}, {"source": {"id": null, "name": "Ancient-origins.net"}, "author": "ashley cowie", "title": "Historic Archive Tells Dark Story Of Death By Meteorite - Ancient Origins", "description": "Researchers have unearthed the only historically documented case of people being struck by a meteorite.", "url": "https://www.ancient-origins.net/news-history-archaeology/meteorite-death-0013614", "urlToImage": null, "publishedAt": "2020-04-24T22:03:00Z", "content": "Researchers have unearthed the only historically documented case of people being struck by a meteorite. \r\nTales of meteorites falling to Earth are carved on prehistoric stones and featured in the Bible, for example, in Revelation 6:13 , when we read the stars… [+4715 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Charles Q. Choi", "title": "Mystery of Venus atmosphere's weird rotation may finally be solved - Space.com", "description": "Thermal tides in the atmosphere make it rotate faster than the planet's surface, a new study finds.", "url": "https://www.space.com/venus-atmosphere-super-rotation-mystery-solved.html", "urlToImage": null, "publishedAt": "2020-04-24T21:59:00Z", "content": "The mystery behind why the atmosphere of Venus spins much faster than the planet's surface may finally be solved, a new study finds.\r\nThe finding might help shed light on how habitable distant exoplanets, or worlds beyond our solar system, may actually be, re… [+3613 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Matthew Chapman", "title": "Trump asked NASA if their technology could sterilize the inside of people’s lungs to kill coronavirus - Raw Story", "description": "According to Cleveland.com, President Donald Trump asked NASA Administrator Jim Bridenstine if an experimental disinfectant fog in development at the Glenn Research Center could be used to sterilize the inside of people’s lungs to treat coronavirus. “Clevelan…", "url": "https://www.rawstory.com/2020/04/trump-asked-nasa-if-their-technology-could-sterilize-the-inside-of-peoples-lungs-to-kill-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-24T21:45:22Z", "content": "According to Cleveland.com, President Donald Trump asked NASA Administrator Jim Bridenstine if an experimental disinfectant fog in development at the Glenn Research Center could be used to sterilize the inside of people’s lungs to treat coronavirus.\r\n“Clevela… [+2747 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Mindy Weisberger", "title": "Black hole bends escaping light 'like a boomerang' - Livescience.com", "description": "Even light can't resist the pull of these irresistible cosmic objects.", "url": "https://www.livescience.com/black-hold-bends-light-like-boomerang.html", "urlToImage": null, "publishedAt": "2020-04-24T20:39:00Z", "content": "Light escaping from a black hole may \"boomerang\" its way to freedom, new X-ray images reveal.\r\nResearchers found this odd behavior while reviewing archival X-ray\r\n observations of a black hole that's approximately 10 times as massive as our sun. Located about… [+3950 chars]"}, {"source": {"id": null, "name": "Futurism.com"}, "author": null, "title": "China Will Launch Mars Mission \"In Coming Months\" - Futurism", "description": "And the mission has been named after an ancient poem.", "url": "https://futurism.com/the-byte/china-launch-mars-mission-coming-months", "urlToImage": null, "publishedAt": "2020-04-24T20:29:38Z", "content": "Forging Ahead\r\nChina says that its still on schedule for the mission to Mars it plans to launch later this year.\r\nThe mission, originally slated for a July launch date, is set to happen in the coming months, according to the China National Space Administratio… [+1254 chars]"}, {"source": {"id": null, "name": "Medpagetoday.com"}, "author": "Molly  Walker", "title": "High-Dose CQ Tied to Death, Cardiac Events in COVID-19 Patients - MedPage Today", "description": "Trial stopped due to prolonged QTc interval, higher rate of death in high- vs low-dose group", "url": "https://www.medpagetoday.com/infectiousdisease/covid19/86151", "urlToImage": null, "publishedAt": "2020-04-24T20:01:01Z", "content": "Hospitalized patients with COVID-19 coronavirus infection treated with high-dose chloroquine diphosphate (CQ) in conjunction with azithromycin or oseltamivir experienced higher rates of death and adverse cardiac events compared with a low-dose group, an unpla… [+5246 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Amanda Kooser", "title": "Scientists pinpoint 'most dangerous place in the history of planet Earth' - CNET", "description": "A paleontologist says time travelers would not survive long in this predator-packed area of Africa 100 million years ago.", "url": "https://www.cnet.com/news/scientists-pinpoint-most-dangerous-place-in-the-history-of-planet-earth/", "urlToImage": null, "publishedAt": "2020-04-24T19:24:42Z", "content": "This artist's illustration shows a massive dinosaur Carcharodontosaurus with a group of crocodile-like Elosuchus predators near a carcass.\r\nArtwork by Davide Bonadonna\r\nOnce you build your time machine, please do not set your destination for 100 million years… [+1631 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Space.com Staff", "title": "The Best Hubble Space Telescope Images of All Time! - Space.com", "description": "", "url": "https://www.space.com/best-hubble-space-telescope-images.html", "urlToImage": null, "publishedAt": "2020-04-24T18:57:00Z", "content": "The spiral galaxy NGC 772, seen here in a 2019 image from the Hubble Space Telescope, bears some striking similarities to the Milky Way galaxy that we call home, with its spiral arms, glowing core and dark dust lanes. But there are some key differences betwee… [+437 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Matt Shipman", "title": "Catalyst opens door to more efficient, environmentally friendly ethylene production - Phys.org", "description": "A research team led by North Carolina State University has engineered a new catalyst that can more efficiently convert ethane into ethylene, which is used in a variety of manufacturing processes. The discovery could be used in a conversion process to drastica…", "url": "https://phys.org/news/2020-04-catalyst-door-efficient-environmentally-friendly.html", "urlToImage": null, "publishedAt": "2020-04-24T18:16:56Z", "content": "A research team led by North Carolina State University has engineered a new catalyst that can more efficiently convert ethane into ethylene, which is used in a variety of manufacturing processes. The discovery could be used in a conversion process to drastica… [+2945 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Engineers open door to big new library of tiny nanoparticles - Phys.org", "description": "The development of bimetallic nanoparticles (i.e., tiny particles composed of two different metals that exhibit several new and improved properties) represents a novel area of research with a wide range of potential applications. Now, a research team in the U…", "url": "https://phys.org/news/2020-04-door-big-library-tiny-nanoparticles.html", "urlToImage": null, "publishedAt": "2020-04-24T18:09:04Z", "content": "The development of bimetallic nanoparticles (i.e., tiny particles composed of two different metals that exhibit several new and improved properties) represents a novel area of research with a wide range of potential applications. Now, a research team in the U… [+3847 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": null, "name": "Goodnewsnetwork.org"}, "author": "http://www.facebook.com/thegoodnewsnetwork", "title": "Researchers Restore Injured Man's Sense of Touch Using Ingenious Brain-Computer Interface - Good News Network", "description": "The scientists from Battelle University say that restoring Ian Burkhart's sense of touch “was a big eureka moment” for the team.", "url": "https://www.goodnewsnetwork.org/injured-mans-sense-of-touch-restored-with-brain-computer-interface/", "urlToImage": null, "publishedAt": "2020-04-24T17:18:00Z", "content": "While we might often take our sense of touch for granted, re-establishing the sense of touch means a great deal to the researchers who are developing technologies to restore limb function for paralyzed people.\r\nHowever, a team of researchers at Battelle and t… [+4496 chars]"}]}