{"status": "ok", "totalResults": 30, "articles": [{"source": {"id": null, "name": "Cnet.com"}, "author": "Amanda Kooser", "title": "Demo-2: How to watch SpaceX launch NASA astronauts to the ISS on May 27 - CNET", "description": "A Falcon 9 rocket is scheduled to carry two astronauts from US soil to the space station. The last time the US launched astronauts from within its borders was 2011.", "url": "https://www.cnet.com/how-to/demo-2-how-to-watch-spacex-launch-two-nasa-astronauts-to-the-iss-on-may-27/", "urlToImage": "https://cnet1.cbsistatic.com/img/t6UuanKQ754DQrr3WueksGJJ62Q=/2020/05/13/a8dcb28d-8613-45f3-b42a-544b2a3c55ca/crewdragondockingart.jpg", "publishedAt": "2020-05-25T05:20:48Z", "content": "This artist's impression shows Crew Dragon docking to the ISS.\r\nSpaceX\r\nIn July 2011, NASA's Space Shuttle Atlantis launched from Florida to the International Space Station, the last time humans trav… [+8160 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Ivan Couronne", "title": "Rocketman (and woman): Elon and Gwynne, the pair who made SpaceX - Yahoo News", "description": "Space Exploration Technologies Corp. -- commonly known as SpaceX -- is slated to send two astronauts into space on Wednesday.  Fortunately the fourth launch ...", "url": "https://news.yahoo.com/rocketman-woman-elon-gwynne-pair-made-spacex-012851260.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/8s79D2fM2QX6yPj.H4CYXA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04ODA-/https://s.yimg.com/uu/api/res/1.2/vN_nwJnoygvSq.tnB6hcfA--~B/aD01Mjg7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/85ebfb42c81bfb50f6347f5aabe1a7a7fa894ce1.jpg", "publishedAt": "2020-05-25T04:22:57Z", "content": "Washington (AFP) - Space Exploration Technologies Corp. -- commonly known as SpaceX -- is slated to send two astronauts into space on Wednesday. Despite not yet being 20 years old, the company has al… [+4164 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Russian military satellite launch spawns space-junk fireball over Australia (video) - Space.com", "description": "The satellite is apparently part of Russia's missile-warning network.", "url": "https://www.space.com/russia-satellite-launch-space-junk-fireball.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/gX7JkCf5N9Z6cSiRxeZvci-1200-80.jpg", "publishedAt": "2020-05-25T01:13:00Z", "content": "EPIC!! Check out this incredible vision captured by Mel Aldridge not long ago at Cashmore near Portland! We're getting plenty of reports. @abcmelbourne pic.twitter.com/1KuldCy6OJMay 22, 2020\r\nRussia … [+2223 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Allison Gasparini", "title": "New Research Shows Electroceutical Fabric Eradicates Coronavirus Infectivity On Contact - Forbes", "description": "There’s a risk that a person removing their face mask could touch viral particles latched onto the outside and further spread the coronavirus. A study by scientists from Indiana University suggests a fabric which eradicates the infectivity of viruses on conta…", "url": "https://www.forbes.com/sites/allisongasparini/2020/05/24/new-research-shows-electroceutical-fabric-eradicates-coronavirus-infectivity-on-contact/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1208749506%2F0x0.jpg", "publishedAt": "2020-05-24T23:46:49Z", "content": "3D visualization of the coronavirus. Researchers from Indiana University recently published a study ... [+] which showed demonstrated how coronavirus infectivity is eradicated on exposure to an elect… [+3460 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Space Station receives the last of NASA's science racks after 19 years - Engadget", "description": "NASA has sent the last of its science racks to the International Space Station, marking the end of an era.", "url": "https://www.engadget.com/iss-receives-last-nasa-science-rack-194934307.html", "urlToImage": "https://o.aolcdn.com/images/dims?resize=1200%2C630&crop=1200%2C630%2C0%2C0&quality=80&image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2020-05%2Fcc7223e0-9de7-11ea-bfef-cd75aa0eb105&client=amp-blogside-v2&signature=33af291ae08b56541d6602637d877d16c3d48515", "publishedAt": "2020-05-24T20:24:07Z", "content": "One of the longer chapters of the International Space Station has come to a close. NASA has sent the last of its 11 ExPRESS (Expedite the Processing of Experiments to the Space Station) science racks… [+440 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "How a Selfie Stick and Fishing Rod Accessed an Ancient Skeleton to Shed First Light on 145 Million-Year-Old Reptile - SciTechDaily", "description": "The skeleton of an extinct 'fish lizard' locked in a glass case over 16ft from the ground for the last 100 years has finally been studied, thanks to a selfie stick on a fishing rod. The 145 million-year-old Nannopterygius is a species of ichthyosaur, which sw…", "url": "https://scitechdaily.com/how-a-selfie-stick-and-fishing-rod-accessed-an-ancient-skeleton-to-shed-first-light-on-145-million-year-old-reptile/", "urlToImage": "https://scitechdaily.com/images/Nannopterygius-Fish-Lizard-Reconstruction-Crop.jpg", "publishedAt": "2020-05-24T19:08:29Z", "content": "This is an artistic life reconstruction of Nannopterygius. Credit: Andrey-Atuchin\r\nThe skeleton of an extinct ‘fish lizard’ locked in a glass case over 16ft from the ground for the last 100 years has… [+3422 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "Earth’s Magnetic Field Weakens, Impacting Satellites and Spacecraft: Space Agency - The Epoch Times", "description": "The Earth's magnetic field is weakening between Africa and South America, causing problems for spacecraft and satellites, scientists ...", "url": "https://www.theepochtimes.com/earths-magnetic-field-weakens-impacting-satellites-and-spacecraft-space-agency_3362838.html", "urlToImage": "https://img.theepochtimes.com/assets/uploads/2016/05/17/Swarm_constellation-1200x800.jpg", "publishedAt": "2020-05-24T17:25:21Z", "content": "The Earth’s magnetic field is weakening between Africa and South America, causing problems for spacecraft and satellites, scientists with the European Space Agency (ESA) have said.\r\nResearchers noted… [+2798 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Vast Mineral Deposits in the Atacama Desert Seen From Space - SciTechDaily", "description": "The Copernicus Sentinel-2 mission takes us over part of Chile's Atacama Desert, which is bound on the west by the Pacific and on the east by the Andes. The Atacama is considered one of the driest places on Earth – there are some parts of the desert where rain…", "url": "https://scitechdaily.com/vast-mineral-deposits-in-the-atacama-desert-seen-from-space/", "urlToImage": "https://scitechdaily.com/images/Atacama-Minerals-scaled.jpg", "publishedAt": "2020-05-24T16:44:00Z", "content": "A specific area in the Tarapacá Region, in northern Chile,  where some of the largest caliche deposits can be found, is featured in this image captured on June 26, 2019. It is here where nitrates, li… [+1887 chars]"}, {"source": {"id": null, "name": "Sci-news.com"}, "author": null, "title": "Scientists Sequence Single-Celled Alga Genome | Genetics - Sci-News.com", "description": "An international team of researchers has successfully sequenced the genome of Penium margaritaceum, a single-celled alga species that belongs to Zygnematophyceae, the sister lineage to land plants, provides many clues to how aquatic plants first colonized lan…", "url": "http://www.sci-news.com/genetics/penium-margaritaceum-genome-08459.html", "urlToImage": "http://cdn.sci-news.com/images/2020/05/image_8459_1-Penium-margaritaceum.jpg", "publishedAt": "2020-05-24T14:51:17Z", "content": "An international team of researchers has successfully sequenced the genome of Penium margaritaceum, a single-celled alga species that belongs to Zygnematophyceae, the sister lineage to land plants, p… [+3421 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Masterful Illusionist: The European Viper Uses Cloak-and-Dazzle to Escape Predators - SciTechDaily", "description": "Research of the University of Jyväskylä demonstrates that the characteristic zig-zag pattern on a viper's back performs seemingly opposing functions during a predation event. At first, the zig-zag pattern helps the snake remain undetected. But upon exposure, …", "url": "https://scitechdaily.com/masterful-illusionist-the-european-viper-uses-cloak-and-dazzle-to-escape-predators/", "urlToImage": "https://scitechdaily.com/images/Viper-Snake-Zig-Zag-Pattern.jpg", "publishedAt": "2020-05-24T13:31:17Z", "content": "The viper’s zig-zag pattern helps the snake remain undetected, it also provides a warning of the snake’s dangerous defense and it can produce an illusionary effect that may hide the snake’s movement … [+4285 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "New Portable Analyzer Can Detect Antivirus Antibody in Just 20 Minutes - SciTechDaily", "description": "Researchers have succeeded in detecting anti-avian influenza virus antibody in blood serum within 20 minutes, using a portable analyzer they have developed to conduct rapid on-site bio tests. If a suitable reagent is developed, this technology could be used t…", "url": "https://scitechdaily.com/new-portable-analyzer-can-detect-antivirus-antibody-in-just-20-minutes/", "urlToImage": "https://scitechdaily.com/images/Virus-Antibody-Device-Analyzer.jpg", "publishedAt": "2020-05-24T12:45:08Z", "content": "The microfluidic device to which 20 μL of samples containing 2 μL of serum will be applied. Credit: Nishiyama K. et al., Sensors and Actuators B: Chemical. April 21, 2020\r\nResearchers have succeeded … [+4307 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Peter Dockrill", "title": "Astronomer Calculates The Odds of Life Emerging on Earth, And We May Not Be So Special - ScienceAlert", "description": "Was life on Earth a fluke? Perhaps not. New research suggests that the emergence of life on Earth, while far from a guaranteed outcome, was in fact a probable event – although the odds of intelligent life evolving remain rather less favourable.", "url": "https://www.sciencealert.com/astrophysicist-calculates-the-odds-of-life-emerging-on-earth-again-if-we-started-over", "urlToImage": "https://www.sciencealert.com/images/2020-05/processed/010-life-emerge-again_1024.jpg", "publishedAt": "2020-05-24T11:58:30Z", "content": "Was life on Earth a fluke? Perhaps not. New research suggests that the emergence of life on Earth, while far from a guaranteed outcome, was in fact a probable event although the odds of intelligent l… [+4677 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Daniel Oberhaus", "title": "On the Moon, astronaut pee will be a hot commodity - Ars Technica", "description": "Urine can be used for landing pads, gardens, and drinking water. But will there be enough to go around?", "url": "https://www.wired.com/story/on-the-moon-astronaut-pee-will-be-a-hot-commodity/", "urlToImage": "https://media.wired.com/photos/5ec6fb698971d7886fd36024/191:100/w_1280,c_limit/astronaut-urine-elena-lacey-wired-science.jpg", "publishedAt": "2020-05-24T10:56:00Z", "content": "Ever since President Donald Trump directed NASA to get boots on the moon by 2024, the agency and its partners have been hard at work trying to make it happen. Late last month, NASA awarded contracts … [+3470 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "David Nield", "title": "A 'Code' in Starlight Reflected Off Distant Planets Could Reveal if They're Habitable - ScienceAlert", "description": "The search for life elsewhere in the Universe goes on, but such is the vastness of space, any helpful tips that can point us towards the planets most likely to be habitable are really useful – and scientists think they've just discovered another cl", "url": "https://www.sciencealert.com/surface-reflections-of-starlight-on-distant-planets-could-reveal-which-ones-are-habitable", "urlToImage": "https://www.sciencealert.com/images/2020-05/processed/planet-bands_1024.jpg", "publishedAt": "2020-05-23T22:07:42Z", "content": "The search for life elsewhere in the Universe goes on, but such is the vastness of space, any helpful tips that can point us towards the planets most likely to be habitable are really useful and scie… [+3275 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Dan Robitzski, Futurism", "title": "Scientists Detect a Flickering Signal Coming From The Heart of Our Galaxy - ScienceAlert", "description": "Scientists found something peculiar coming from the center of the Milky Way galaxy: a previously-unnoticed signal they think is coming from the supermassive black hole at the heart of our galaxy.", "url": "https://www.sciencealert.com/there-s-a-peculiar-signal-coming-from-the-heart-of-our-galaxy-and-we-just-noticed", "urlToImage": "https://www.sciencealert.com/images/2020-05/processed/blackholesupermassive_1024.jpg", "publishedAt": "2020-05-23T22:07:40Z", "content": "Scientists found something peculiar coming from the center of the Milky Way galaxy: a previously-unnoticed signal they think is coming from the supermassive black hole at the heart of our galaxy.\r\nTh… [+1419 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Artificial Intelligence Helps Researchers Up-Cycle Waste Carbon With Record Efficiency - SciTechDaily", "description": "Researchers at University of Toronto Engineering and Carnegie Mellon University are using artificial intelligence (AI) to accelerate progress in transforming waste carbon into a commercially valuable product with record efficiency. They leveraged AI to speed …", "url": "https://scitechdaily.com/artificial-intelligence-helps-researchers-up-cycle-waste-carbon-with-record-efficiency/", "urlToImage": "https://scitechdaily.com/images/Electrolyzers-Convert-Waste-CO2-into-Commercially-Valuable-Chemicals.jpg", "publishedAt": "2020-05-23T19:38:24Z", "content": "Researchers from U of T Engineering and Carnegie Mellon University are using electrolyzers like this one to convert waste CO2 into commercially valuable chemicals. Their latest catalyst, designed in … [+5122 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Hilary Hanson", "title": "Climate Change Could Mean More Of Antarctica Turning Green With Algae - HuffPost", "description": "Snow algae is already a part of summer on the Antarctic Peninsula. A warming planet may mean a lot more of it.", "url": "https://www.huffpost.com/entry/green-snow-algae-antarctica-climate-change_n_5ec96726c5b6a11b8be765da", "urlToImage": "https://img.huffingtonpost.com/asset/5ec96b97240000c50e8eb5d3.png?cache=qSdUR5YycA&ops=1200_630", "publishedAt": "2020-05-23T19:28:53Z", "content": "The algal blooms that blanket parts of Antarctica’s snow cover in the summer are likely to expand as the planet warms, researchers say in a new study.\r\nA research team from the University of Cambridg… [+2505 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Trials by Fire, Ice, Light and Sound: NASA's New Mars Rover Perseveres - SciTechDaily", "description": "The agency's new Mars rover is put through a series of tests in vacuum chambers, acoustic chambers and more to get ready for the Red Planet. While auto manufacturers built over 92 million motor vehicles for this world in 2019, NASA built just one for Mars. Th…", "url": "https://scitechdaily.com/trials-by-fire-ice-light-and-sound-nasas-new-mars-rover-perseveres/", "urlToImage": "https://scitechdaily.com/images/Perseverance-Mars-Rover-Parachute.gif", "publishedAt": "2020-05-23T17:28:54Z", "content": "This animated GIF shows a successful test of the parachute that will be used to land NASA’s Perseverance rover on Mars. The images were taken on Sept. 7, 2018, during the third and final flight of th… [+9790 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Statue of Liberty-sized ASTEROID barrelling towards Earth as six space rocks set to skim past - RT", "description": "A huge asteroid that’s roughly the size of the Statue of Liberty is set to fly past Earth on Saturday. The enormous object is among a clutch of six space rocks that will whizz past our planet this weekend.", "url": "https://www.rt.com/news/489586-six-asteroids-approach-earth/", "urlToImage": "https://cdni.rt.com/files/2020.05/article/5ec9449485f540189834fa42.jpg", "publishedAt": "2020-05-23T16:00:42Z", "content": "The largest of the half-dozen space visitors is dubbed 2020 JX and it measures up to 100 meters in diameter, making it around the same size as the icon on Liberty island in New York. \r\nNASA’s Center … [+1434 chars]"}, {"source": {"id": null, "name": "Prevention.com"}, "author": "Jessica Migala", "title": "15 Best Moisturizers With SPF 2020, According to Dermatologists - Prevention.com", "description": "Make sun protection easy with these expert-approved hydrators.", "url": "https://www.prevention.com/beauty/skin-care/g22719929/moisturizer-with-spf/", "urlToImage": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/young-beautiful-woman-enjoying-the-beach-royalty-free-image-165782519-1562096366.jpg?crop=1.00xw:0.757xh;0,0.190xh&resize=1200:*", "publishedAt": "2020-05-23T15:50:00Z", "content": "If there’s one piece of skincare advice you’ve heard over and over again, it’s to wear sunscreen every day—yes, even during the cold, gray months—but especially during spring and summer. And while yo… [+2849 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Shannon Stirone", "title": "Space Photos of the Week: Keeping an Eye on Jupiter's Storms - WIRED", "description": "NASA's Juno orbiter, along with its Hubble and Gemini telescopes, will help scientists better understand the planet's atmosphere.", "url": "https://www.wired.com/story/space-photos-keeping-an-eye-on-jupiters-storms/", "urlToImage": "https://media.wired.com/photos/5ec85271448999d7ae47db3f/191:100/w_1280,c_limit/photo_space_juno_2_PIA21972.jpg", "publishedAt": "2020-05-23T14:00:00Z", "content": "Jupiter has one of the most bizarre atmospheres in the entire solar system. Gas giants like Jupiter are believed to have some kind of semi-solid core, but are mostly made of gas like hydrogen, helium… [+3273 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Astronomers find the Wolfe Disk, an unlikely galaxy, in the distant universe - CNN", "description": "Astronomers have spotted a massive disk galaxy, not unlike our own, that formed 12.5 billion years ago when our 13.8 billion-year-old universe was only a tenth of its current age. But according to what scientists know about galaxy formation, this one has no b…", "url": "https://www.cnn.com/2020/05/23/world/distant-galaxy-wolfe-disk-scn-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200522122159-02-wonders-of-the-universe-0522-super-tease.jpg", "publishedAt": "2020-05-23T13:24:57Z", "content": "(CNN)Astronomers have spotted a massive disk galaxy, not unlike our own, that formed 12.5 billion years ago when our 13.8 billion-year-old universe was only a tenth of its current age. But according … [+4591 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Rafi Letzter", "title": "Strange ice formations may have tricked physicists into seeing mysterious particles that weren't there - Livescience.com", "description": "What if one of the strangest, most unsettling findings in particle physics turned out to be an illusion?", "url": "https://www.livescience.com/mysterious-physics-particles-or-a-trick-of-the-ice.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/SDr6QG4EWh2CxgogiaLvYJ-1200-80.jpg", "publishedAt": "2020-05-23T11:00:00Z", "content": "What if one of the strangest, most unsettling findings in particle physics turned out to be an illusion?\r\nSince March 2016, two mysterious signals from Antarctica have baffled researchers. Twice now,… [+16356 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Rhett Allain", "title": "What’s Up With the Funny-Looking Moons in ‘Onward’? - WIRED", "description": "Yes, I know this is a fantasy movie. That shouldn’t stop us from thinking about the real causes of lunar phases.", "url": "https://www.wired.com/story/whats-up-with-the-funny-moons-in-onward/", "urlToImage": "https://media.wired.com/photos/5ec5aa66a1675c5749a138ea/191:100/w_1280,c_limit/Science_phases_MCDONWA_WD028.jpg", "publishedAt": "2020-05-23T11:00:00Z", "content": "Let me just say, the Pixar movie Onward was fun. Its your classic kids go on quest/gain new confidence story, but set in a world with elves and dragons and smartphonesyou know, magic stuff like that.… [+1595 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Mike Wall", "title": "Colonizing Mars may require humanity to tweak its DNA - Livescience.com", "description": "Genetic engineering may be a big part of our future on Mars.", "url": "https://www.livescience.com/mars-colony-human-genetic-engineering-tardigrades.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/HujsT6p9sejFZ29wUD9rrL-1200-80.jpg", "publishedAt": "2020-05-23T11:00:00Z", "content": "If humanity is ever going to settle down on Mars\r\n, we may need to become a little less human.\r\nCrewed missions to Mars, which NASA wants to start flying in the 2030s, will be tough on astronauts\r\n, … [+5556 chars]"}, {"source": {"id": null, "name": "Physicsworld.com"}, "author": null, "title": "Astronomers see first evidence of a new planet being born – Physics World - physicsworld.com", "description": "Combined measurements from two ESO telescopes provide evidence that a new planet is currently forming around the young star AB Aurigae", "url": "https://physicsworld.com/a/astronomers-see-first-evidence-of-a-new-planet-being-born/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2020/05/AB-Aurigae.jpg", "publishedAt": "2020-05-23T10:32:59Z", "content": "et al)\" /&gt;\r\nThis image, obtained with the Very Large Telescope's SPHERE instrument, shows the disc around the young AB Aurigae star, where astronomers have spotted signs of planet birth. Close to … [+3295 chars]"}, {"source": {"id": null, "name": "Moneymorning.com"}, "author": "Michael A. Robinson", "title": "This Money-Doubling Classic Could Lead an Outer Space \"Gold Rush\" - Money Morning", "description": "Today, our Michael Robinson is going to show you a money-doubling classic play that could lead an outer space \"gold rush.\" That's right - the new, commercial \"Space Race\" is on and you're set to profit with Michael's pick...", "url": "https://moneymorning.com/2020/05/23/this-money-doubling-classic-could-lead-an-outer-space-gold-rush/", "urlToImage": "https://moneymorning.com/wp-content/blogs.dir/1/files/2020/05/money-pocket.jpg", "publishedAt": "2020-05-23T09:06:31Z", "content": "When Apollo 17 astronauts Eugene Cernan and Harrison Schmitt blasted off from the surface of the moon on the evening of Dec. 14, 1972, very few people believed it would be NASA's last manned moon mis… [+1819 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Katherine Kornei", "title": "Long Limbs Helped Propel T. Rex Up the Dinosaur Food Chain - The New York Times", "description": "The apex predator wasn’t a quick runner because of its heft, but its lanky limbs ensured it could amble efficiently for hours.", "url": "https://www.nytimes.com/2020/05/23/science/tyrannosaurus-rex-legs.html", "urlToImage": "https://static01.nyt.com/images/2020/05/23/science/23TB-TREX/23TB-TREX-facebookJumbo.jpg", "publishedAt": "2020-05-23T03:40:00Z", "content": "Surviving in the Cretaceous wasnt a sprint, it was a marathon. And Tyrannosaurus rex was built to amble for hours, new research reveals. That attribute might have helped propel the carnivore to the t… [+4029 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Sean Martin", "title": "Near death experience: Scientist explains what happens when you are dying - Express.co.uk", "description": "NEAR death experiences (NDEs) are an 'authentic' experience caused by a lowering of activity in the brain, according to an expert.", "url": "https://www.express.co.uk/news/science/1286022/near-death-experience-what-happens-when-you-die-afterlife-nde", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1286022.jpg", "publishedAt": "2020-05-22T20:26:00Z", "content": null}, {"source": {"id": null, "name": "Tass.com"}, "author": "TASS", "title": "Elon Musk will need more than 10,000 missiles to nuke Mars — Roscosmos - TASS", "description": "Earlier, Musk proposed an ambitious idea to terraform Mars by bombarding the planet’s poles with a large number of nuclear weapons", "url": "https://tass.com/science/1155417", "urlToImage": "https://phototass3.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20200512/1266233.jpg", "publishedAt": "2020-05-12T13:16:14Z", "content": "MOSCOW, May 12. /TASS/. Billionaire entrepreneur and SpaceX CEO Elon Musk’s plan to bombard the Martian polar caps to terraform the planet through release of carbon dioxide will require launching mor… [+1083 chars]"}]}