{"status": "ok", "totalResults": 208, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Singapore's migrant workers are suffering the brunt of the country's coronavirus outbreak", "description": null, "url": "https://www.cnn.com/collections/intl-global-coronavirus-stories-4-25/", "urlToImage": null, "publishedAt": "2020-04-25T04:27:22Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Angela Dewan, CNN", "title": "Lifting lockdowns safely relies on effective testing. Germany surges ahead, but US states are flying blind", "description": "People in the US state of Georgia can now get their nails done, their hair cut -- even get a tattoo or a massage -- after just three weeks of a state-wide stay-at-home order. That's an awful lot of touching, considering a highly contagious and deadly virus is…", "url": "https://www.cnn.com/2020/04/25/world/georgia-us-germany-coronavirus-lockdown-ger-intl/index.html", "urlToImage": null, "publishedAt": "2020-04-25T04:19:18Z", "content": "(CNN)People in the US state of Georgia can nowget their nails done, their hair cut -- even get a tattoo or a massage -- after just three weeks of a state-wide stay-at-home order. That's an awful lot of touching, considering a highly contagious and deadly viru… [+9784 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary Cohen and Alex Marquardt, CNN", "title": "'They are trying to steal everything.' US coronavirus response hit by foreign hackers", "description": "The Trump administration is pointing the finger at China for attempting to steal coronavirus research as officials are warning they have seen a growing wave of cyberattacks on US government agencies and medical institutions leading the pandemic response by na…", "url": "https://www.cnn.com/2020/04/25/politics/us-china-cyberattacks-coronavirus-research/index.html", "urlToImage": null, "publishedAt": "2020-04-25T04:00:12Z", "content": "Washington (CNN)The Trump administration is pointing the finger at China for attempting to steal coronavirus research as officials are warning they have seen a growing wave of cyberattacks on US government agencies and medical institutions leading the pandemi… [+9161 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "All The Good Stuff that happened this week", "description": null, "url": "https://www.cnn.com/2020/04/24/us/the-good-stuff-042520/index.html", "urlToImage": null, "publishedAt": "2020-04-25T03:53:07Z", "content": "Speaking of heroes, two weeks ago I spent a few lines thanking all kinds of essential personnel (and revealing my deep desire to drive the bulldozer at the solid waste management unit). Readers, you jumped in and offered dozens more suggestions of people and … [+1129 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "What will it take to reopen the economy in a safe way?", "description": "CNN's Tom Foreman highlights the steps needed to help reopen the US economy safely amid the coronavirus pandemic.", "url": "https://www.cnn.com/videos/us/2020/04/25/how-safely-reopen-us-economy-coronavirus-foreman-dnt-cpt-vpx.cnn", "urlToImage": null, "publishedAt": "2020-04-25T03:44:35Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul Vercammen and Jon Passantino, CNN", "title": "Many Southern California beaches remain closed as heat wave hits", "description": "Beaches in Los Angeles and San Diego counties will remain closed this weekend to slow the spread of the coronavirus as a heatwave brings record warm temperatures to Southern California.", "url": "https://www.cnn.com/2020/04/24/us/many-southern-california-beaches-closed-in-heat-wave/index.html", "urlToImage": null, "publishedAt": "2020-04-25T02:37:01Z", "content": "Heat Advisory Friday/Saturday as temperatures soar into the 90's. \r\nReminder, the Mayor's \"Safer at Home\" order remains in effect &amp; LA beaches are closed. \r\nIf engaging in essential activities, maintain social distancing &amp; wear face coverings as requi… [+88 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Fox, CNN", "title": "US government review of first Wuhan repatriation says safety protocols not followed", "description": "A US government review out Friday sheds light on early missteps of the administration in repatriating the first Americans from coronavirus-struck Wuhan, China, on January 29.", "url": "https://www.cnn.com/2020/04/24/politics/hhs-review-us-repatriation-flight-wuhan/index.html", "urlToImage": null, "publishedAt": "2020-04-25T02:36:51Z", "content": "(CNN)A US government review out Friday sheds light on early missteps of the administration in repatriating the first Americans from coronavirus-struck Wuhan, China, on January 29.\r\nWhile the summary report makes clear that all the individuals were asymptomati… [+3692 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Andy Cohen: As a gay man I am unable to donate blood", "description": "CNN's Anderson Cooper speaks to TV host Andy Cohen about his experience trying to donate plasma in the wake of the pandemic and being turned away due to his sexuality.", "url": "https://www.cnn.com/videos/health/2020/04/25/andy-cohen-plasma-donation-intv-cooper-vpx.cnn", "urlToImage": null, "publishedAt": "2020-04-25T02:26:18Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Jeffrey Sachs", "title": "First we need to fix this key thing. Then we can reopen", "description": "Jeffrey Sachs writes that before we can consider reopening America, we must fix our broken public health system, so we can better test, trace and track the spread of coronavirus.", "url": "https://www.cnn.com/2020/04/24/opinions/fix-public-health-care-system-covid-19-sachs/index.html", "urlToImage": null, "publishedAt": "2020-04-25T02:08:46Z", "content": "Jeffrey Sachs is a professor and director of the Center for Sustainable Development at Columbia University. The opinions expressed in this commentary are those of the author; view more opinion articles on CNN.\r\n (CNN)With the US surpassing the grim toll of 50… [+6915 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dr. Sanjay Gupta, CNN Chief Medical Correspondent", "title": "He signed up for a coronavirus vaccine trial using a method that's never been used in humans. Here's why.", "description": "Sean Doyle signed up for a trial for a coronavirus vaccines that uses new technology to try and reach a vaccine quicker. Experts debate whether these vaccines will work and make it through safety tests or change how we make vaccines forever.", "url": "https://www.cnn.com/2020/04/24/health/coronavirus-vaccine-speed-sanjay-gupta/index.html", "urlToImage": null, "publishedAt": "2020-04-25T01:40:20Z", "content": "(CNN)Despite all his medical knowledge, 31-year-old medical student and Ph. D. candidate Sean Doyle couldn't know for certain all the risks of the injection he had just received in his right shoulder at Emory University Hospital. Yes, of course he was told of… [+11348 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "John Avlon", "title": "Opinion: Making an unhinged Trump sound reasonable", "description": "Even in the face of, for example, the President's suggestion that injecting disinfectants might have promise in fighting Covid-19, some in the White House staff apparently can sleep at night by telling themselves it would be worse if they weren't around. They…", "url": "https://www.cnn.com/2020/04/24/opinions/coronavirus-disinfectant-trump-avlon/index.html", "urlToImage": null, "publishedAt": "2020-04-25T01:36:39Z", "content": "John Avlon is a senior political analyst at CNN. The opinions expressed in this commentary are his own. View more opinion on CNN.\r\n (CNN)You don't need to be a doctor to know that it's dangerous to ingest or inject disinfectants. A random kid on the street co… [+5109 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Widow of coronavirus victim shares heartbreaking details of husband's last days", "description": "CNN's Anderson Cooper speaks to Katie Coelho, who found a goodbye note on her 32-year-old husband Jonathan's phone after he died from coronavirus. Support the Coelho family here.", "url": "https://www.cnn.com/videos/us/2020/04/25/katie-coelho-husband-note-coroanvirus-ac360-vpx.cnn", "urlToImage": null, "publishedAt": "2020-04-25T01:36:37Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/julia-hollingsworth\">Julia Hollingsworth</a> and <a href=\"/profiles/brett-mckeehan\">Brett McKeehan</a>, CNN", "title": "UK to start trials of drones delivering medical supplies", "description": "The global coronavirus pandemic has brought countries around the world to a standstill. Here's the latest updates on worldwide Covid-19 cases, deaths, government responses and more.", "url": "https://www.cnn.com/world/live-news/coronavirus-pandemic-04-25-20-intl/index.html", "urlToImage": null, "publishedAt": "2020-04-25T01:28:37Z", "content": "Indonesia has temporarily banned domestic road, air and sea travel starting Friday to prevent the spread of coronavirus, as millions of Muslims mark the start of the holy month of Ramadan.\r\nWhat's going on? Indonesia has the largest Muslim population in the w… [+1590 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Biden makes ominous warning about 2020 and President Trump", "description": "The Trump campaign is dismissing Joe Biden's warning that the President will try to postpone the November presidential election because of the coronavirus pandemic. CNN's Abby Phillip reports what's behind Biden's stunning accusation.", "url": "https://www.cnn.com/videos/politics/2020/04/25/mail-in-voting-joe-biden-donald-trump-november-election-phillip-dnt-ebof-vpx.cnn", "urlToImage": null, "publishedAt": "2020-04-25T00:56:41Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rosa Flores, Sara Weisfeldt and Arman Azad, CNN", "title": "2 studies show many people who tested positive for Covid-19 displayed no symptoms", "description": "Two coronavirus studies released Friday -- one involving almost 2,000 people from Florida and the other from a Washington state nursing home -- came to the same conclusion: Many of the people who tested positive for the virus didn't know it they had it becaus…", "url": "https://www.cnn.com/2020/04/24/us/2-asymptomatic-coronavirus-studies/index.html", "urlToImage": null, "publishedAt": "2020-04-25T00:56:19Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Stelter, CNN Business", "title": "Nearly three quarters of US senators call on Trump administration to help local news", "description": "United States Senators have a new idea to boost struggling local news outlets in their home states: Ads from the federal government.", "url": "https://www.cnn.com/2020/04/24/media/senators-letter-support-local-news/index.html", "urlToImage": null, "publishedAt": "2020-04-25T00:54:48Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "White House official tries to move CNN reporter at briefing", "description": "CNN's Jim Acosta discusses why President Trump ended the coronavirus briefing without taking questions and how a White House official tried to move a CNN reporter to the back of the room.", "url": "https://www.cnn.com/videos/politics/2020/04/25/white-house-seats-acosta-ac360-vpx.cnn", "urlToImage": null, "publishedAt": "2020-04-25T00:39:40Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oscar Holland, CNN", "title": "How North Korea's ideology is built on song and dance", "description": "Ethnomusicologist Keith Howard has spent years listening to \"mind-numbing\" North Korean music to better understand how it reflects and reinforces the secretive state's ideology.", "url": "https://www.cnn.com/style/article/north-korea-song-dance/index.html", "urlToImage": null, "publishedAt": "2020-04-25T00:27:54Z", "content": "artsPublished 25th April 2020\r\n\"So dear to all our hearts is our General's glorious name; our own beloved Kim Il Sung of undying fame,\" go the lyrics to one of North Korea's best-known songs, \"Song of General Kim Il Sung,\" which honors the country's founding … [+8346 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Brad Lendon, CNN", "title": "US Air Force pulls bombers from Guam", "description": "For the first time in 16 years, the United States Air Force has no heavy bombers on Guam.", "url": "https://www.cnn.com/2020/04/24/asia/guam-us-air-force-bombers-pull-out-intl-hnk/index.html", "urlToImage": null, "publishedAt": "2020-04-25T00:21:03Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung, Joshua Berlinger, Manisha Tank and Isaac Yee, CNN", "title": "Singapore's migrant workers are suffering the brunt of the coronavirus pandemic", "description": "Rubel, a 28-year-old migrant worker in Singapore, is afraid. The dormitory he and other foreign workers live in has been locked down, and nobody is allowed in or out as government officials scramble to contain the country's novel coronavirus outbreak.", "url": "https://www.cnn.com/2020/04/24/asia/singapore-coronavirus-foreign-workers-intl-hnk/index.html", "urlToImage": null, "publishedAt": "2020-04-25T00:17:01Z", "content": "Singapore (CNN)Rubel, a 28-year-old migrant worker in Singapore, is afraid. The dormitory he and other foreign workers live in has been locked down, and nobody is allowed in or out as government officials scramble to contain the country's novel coronavirus ou… [+9745 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jim Acosta, Kristen Holmes, Dana Bash and Gloria Borger, CNN", "title": "Aides and allies making concerted effort to get Trump to stop doing daily briefings", "description": "There has been a concerted effort among aides and allies to get President Donald Trump to stop conducting the daily coronavirus briefings, multiple sources tell CNN.", "url": "https://www.cnn.com/2020/04/24/politics/white-house-briefings-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-25T00:07:33Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Caroline Kelly, CNN", "title": "Kentucky Democratic governor vetoes abortion bill", "description": "Democratic Kentucky Gov. Andrew Beshear vetoed a bill on Friday that would have allowed the Republican attorney general to potentially restrict abortion access during the coronavirus outbreak as well as requiring doctors to try to preserve the life of any inf…", "url": "https://www.cnn.com/2020/04/24/politics/kentucky-abortion-bill-born-alive-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-25T00:02:22Z", "content": "(CNN)Democratic Kentucky Gov. Andrew Beshear vetoed a bill on Friday that would have allowed the Republican attorney general to potentially restrict abortion access during the coronavirus outbreak as well as requiring doctors to try to preserve the life of an… [+3561 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Shannon Liao, CNN Business", "title": "Nintendo reveals 160,000 accounts were breached", "description": "Nintendo revealed on Friday that 160,000 accounts were breached since the beginning of April, by hackers using others' Nintendo Network IDs without permission. The company announced users will no longer need to use these IDs to log into their accounts, and th…", "url": "https://www.cnn.com/2020/04/24/tech/nintendo-accounts-hacked/index.html", "urlToImage": null, "publishedAt": "2020-04-24T23:43:36Z", "content": "New York (CNN Business)Nintendo revealed on Friday that 160,000 accounts were breached since the beginning of April, by hackers using others' Nintendo Network IDs without permission. The company announced users will no longer need to use these IDs to log into… [+1787 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by David A. Thomas", "title": "Morehouse president: It's too soon for Georgia to open up. Here's how we're weathering the storm", "description": "David A. Thomas writes that despite rising cases of coronavirus in Georgia, a segment of the business community will reopen. While colleges and universities will experience a financial loss from Covid-19, they prioritize the health of their students.", "url": "https://www.cnn.com/2020/04/24/opinions/morehouse-president-too-soon-for-georgia-to-open-thomas/index.html", "urlToImage": null, "publishedAt": "2020-04-24T23:42:47Z", "content": "David A. Thomas, Ph.D. is the president of Morehouse College. He was previously the dean of Georgetown University's McDonough School of Business, and has served as a business school professor at Harvard University and the University of Pennsylvania. His is th… [+8012 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alisha Ebrahimji, CNN", "title": "After her husband died from coronavirus, she found an emotional note on his phone", "description": "\"I love you guys with all my heart and you've given me the best life I could have ever asked for.\"", "url": "https://www.cnn.com/2020/04/24/us/coronavirus-victim-family-note-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-24T23:31:41Z", "content": "(CNN)\"I love you guys with all my heart and you've given me the best life I could have ever asked for.\"\r\nThat's the beginning of a goodbye note one woman found on her husband's phone after he died from coronavirus this week.\r\nJonathan Coelho, 32 passed away o… [+5048 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "New York City will distribute 500,000 free halal meals to Muslims during Ramadan", "description": "The coronavirus pandemic has turned life upside down for many New Yorkers, including those who wish to safely practice their faiths.", "url": "https://www.cnn.com/2020/04/24/us/new-york-halal-meals-ramadan-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-24T23:27:34Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariane de Vogue, CNN Supreme Court Reporter", "title": "Supreme Court denies request to suspend 'public charge' rule for immigrants during pandemic", "description": "The Supreme Court on Friday denied a request from New York and other states to block the Trump administration's controversial \"public charge\" rule during the coronavirus pandemic.", "url": "https://www.cnn.com/2020/04/24/politics/supreme-court-public-charge-pandemic/index.html", "urlToImage": null, "publishedAt": "2020-04-24T23:00:55Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Benjamin Jealous", "title": "The creative thinker who should be Biden's vice president", "description": "Benjamin Jealous writes that Joe Biden should choose Stacey Abrams as his Vice President because, aside from appealing to key Democratic constituencies, she has the determination to get the job done, no matter what challenges may stand in her way. And that te…", "url": "https://www.cnn.com/2020/04/24/opinions/stacey-abrams-joe-biden-vp-pick-jealous/index.html", "urlToImage": null, "publishedAt": "2020-04-24T22:54:52Z", "content": "Benjamin Jealous is a visiting scholar at the Annenberg School for Communication at the University of Pennsylvania and a board member at Pigeonly.com. He is the former national president and CEO of the NAACP. He resides in Maryland and was his state's 2018 De… [+6116 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Evan Perez and David Shortell, CNN", "title": "Justice Department provides Flynn's attorneys with documents from Barr's re-examination", "description": "The Justice Department said Friday it shared with Michael Flynn's lawyers a number of documents uncovered in a review ordered by Attorney General William Barr, raising the prospect that the department now believes potentially exculpatory information wasn't tu…", "url": "https://www.cnn.com/2020/04/24/politics/justice-department-michael-flynn-william-barr/index.html", "urlToImage": null, "publishedAt": "2020-04-24T22:41:52Z", "content": "(CNN)The Justice Department said Friday it shared with Michael Flynn's lawyers a number of documents uncovered in a review ordered by Attorney General William Barr, raising the prospect that the department now believes potentially exculpatory information wasn… [+4556 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Dezenski, CNN", "title": "The week in 13 headlines", "description": "This week, small protests over stay-at-home orders roiled state capitals, while Georgia's governor led the charge in reopening his state. Meanwhile, President Trump backed off promoting hydroxychloroquine only to surface another much more dangerous theory: in…", "url": "https://www.cnn.com/2020/04/24/politics/coronavirus-trump-week-in-review/index.html", "urlToImage": null, "publishedAt": "2020-04-24T22:32:10Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "10 leaders who mattered most on coronavirus response this week", "description": "America's fight against the coronavirus entered a new phase this week as the debate over when and how to reopen the country began in earnest.", "url": "https://www.cnn.com/2020/04/24/politics/top-leaders-coronavirus-response/index.html", "urlToImage": null, "publishedAt": "2020-04-24T22:30:24Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Trump abruptly exits virus briefing", "description": "President Trump unexpectedly leaves the coronavirus task force briefing without answering questions, a day after he asked medical experts to look into the possibility of injecting disinfectant as a treatment for the coronavirus.", "url": "https://www.cnn.com/videos/politics/2020/04/24/trump-leaves-task-force-briefing-white-house-tsr-vpx-blitzer.cnn", "urlToImage": null, "publishedAt": "2020-04-24T22:29:20Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sarah Jorgensen and Scottie Andrew, CNN", "title": "The 5-month-old daughter of a New York firefighter dies from coronavirus", "description": "A New York firefighter's infant daughter has died from coronavirus, her family says, making her one of the youngest known victims of the virus.", "url": "https://www.cnn.com/2020/04/24/us/fdny-firefighter-daughter-dies-coronavirus-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-24T22:28:25Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren M. Johnson, CNN", "title": "To get around stay-at-home orders, Spaniards have been walking some unusual 'pets'", "description": "The Spanish government's strict stay-at-home order allows people to leave their homes to walk their pets.", "url": "https://www.cnn.com/2020/04/24/world/spanish-residents-walking-pets-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-24T22:27:15Z", "content": "(CNN)The Spanish government's strict stay-at-home order allows people to leave their homes to walk their pets.\r\nWell, that order has prompted some to get a little creative with what the government means in terms of \"pet.\"\r\nOn Friday the Spanish National Polic… [+1129 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Majlie de Puy Kamp, Drew Griffin, and Nelli Black, CNN Investigates", "title": "House Democrats investigating unproven Covid-19 antibody tests", "description": "FDA policy has led to unproven and fraudulently marketed coronavirus antibody tests on the market, House Democrats say after a briefing by federal officials.", "url": "https://www.cnn.com/2020/04/24/politics/house-oversight-investigating-covid-19-antibody-tests-invs/index.html", "urlToImage": null, "publishedAt": "2020-04-24T22:19:35Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Majlie de Puy Kamp, Drew Griffin, and Nelli Black, CNN Investigates", "title": "House Democrats investigating unproven Covid-19 antibody tests", "description": "House Democrats are citing flaws in federal policy that have led to unproven and fraudulently marketed coronavirus antibody tests being sold in the United States, according to a memo shared exclusively with CNN.", "url": "https://www.cnn.com/2020/04/24/politics/house-oversight-investigating-covid-19-antibody-tests-invs/index.html", "urlToImage": null, "publishedAt": "2020-04-24T22:19:35Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Herb, Manu Raju and Lauren Fox, CNN", "title": "GOP senators open to more emergency relief for states amid divide in party", "description": "A number of Senate Republicans are publicly and privately expressing an openness toward a new round of funding to cash-strapped state and local governments, even as Senate Majority Leader Mitch McConnell floated the possibility of states declaring bankruptcy …", "url": "https://www.cnn.com/2020/04/24/politics/republican-emergency-relief-aid-conditions/index.html", "urlToImage": null, "publishedAt": "2020-04-24T22:16:15Z", "content": "(CNN)A number of Senate Republicans are publicly and privately expressing an openness toward a new round of funding to cash-strapped state and local governments, even as Senate Majority Leader Mitch McConnell floated the possibility of states declaring bankru… [+8779 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Unemployment office phone lines jammed, websites crashing", "description": "Go There looks at how unemployment offices are dealing with a record number of workers in the US filing for unemployment and other benefits, with phone lines jammed, websites crashing, and lines only getting longer. CNN's Vanessa Yurkevich speaks with small b…", "url": "https://www.cnn.com/videos/us/2020/04/24/us-unemployment-coronavirus-covid-19-go-there-pkg-vpx.cnn", "urlToImage": null, "publishedAt": "2020-04-24T22:12:33Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nathaniel Meyersohn, CNN Business", "title": "Walmart store in Colorado shuts down after coronavirus deaths", "description": "Public health officials in Aurora, Colorado, ordered a Walmart supercenter to shut down Thursday after a 72-year-old Walmart worker, her 63-year-old husband, and a 69-year-old third-party security contractor for the company died from coronavirus.", "url": "https://www.cnn.com/2020/04/24/business/walmart-coronavirus-colorado-death/index.html", "urlToImage": null, "publishedAt": "2020-04-24T22:10:29Z", "content": "New York (CNN Business)Public health officials in Aurora, Colorado, ordered a Walmart supercenter to shut down Thursday after a 72-year-old Walmart worker, her 63-year-old husband, and a 69-year-old third-party security contractor for the company died from co… [+2433 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariane de Vogue, CNN Supreme Court Reporter", "title": "Trump administration plans to go to the Supreme Court in Mueller grand jury document dispute", "description": "The Trump administration on Friday said that it plans to ask the Supreme Court to block a lower court ruling that allows the House of Representatives to access secret grand jury material gathered in former special counsel Robert Mueller's investigation.", "url": "https://www.cnn.com/2020/04/24/politics/mueller-grand-jury-supreme-court/index.html", "urlToImage": null, "publishedAt": "2020-04-24T22:07:19Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Asmelash, CNN", "title": "The Beatles will stream their animated film 'Yellow Submarine' Saturday and host a sing-a-long watch party", "description": "If you've been cooped up inside for a few weeks now, chances are you're getting a little antsy. Luckily, The Beatles are here to help, by airing the animated \"The Beatles: Yellow Submarine\" while hosting a dress up sing-along watch party.", "url": "https://www.cnn.com/2020/04/24/entertainment/the-beatles-yellow-submarine-sing-a-long-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-24T21:43:10Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Yellin", "title": "Get 20% off at Amazon with targeted Discover credit cards", "description": "If you're a Discover card holder and an Amazon shopper, you might be able to score a 20% discount if you're targeted for this promotion.", "url": "https://www.cnn.com/2020/04/24/cnn-underscored/discover-card-amazon-discount-promotion/index.html", "urlToImage": null, "publishedAt": "2020-04-24T21:08:03Z", "content": "If you're a Discover card holder and an Amazon shopper, you might be in luck. Amazon recently launched a targeted promotion offering a 20% discount on most products sold directly by Amazon simply if you have a select Discover card. \r\nWith this offer, you can … [+6411 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeanne Sahadi, CNN Business", "title": "More small business loans are on the way. Here's what you need to know", "description": "Another $310 billion is being added to the Paycheck Protection Program so that lenders can offer more forgivable loans to small businesses.", "url": "https://www.cnn.com/2020/04/24/success/small-businesses-ppp-loans-restarting/index.html", "urlToImage": null, "publishedAt": "2020-04-24T21:07:10Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Lobosco, CNN", "title": "Federal budget deficit could hit $3.7 trillion this year, CBO says", "description": "The economic fallout of the coronavirus pandemic could nearly quadruple the federal budget deficit this year, pushing it to a whopping $3.7 trillion, according to a projection released Friday by the Congressional Budget Office.", "url": "https://www.cnn.com/2020/04/24/politics/federal-budget-deficit-cbo-estimate/index.html", "urlToImage": null, "publishedAt": "2020-04-24T21:02:04Z", "content": "Washington (CNN)The economic fallout of the coronavirus pandemic could nearly quadruple the federal budget deficit this year, pushing it to a whopping $3.7 trillion, according to a projection released Friday by the Congressional Budget Office. \r\nLast year, wi… [+1788 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera, CNN", "title": "X Games cancels July event while UFC schedules 3 fights for May", "description": "The X Games were originally set to take place July 17 to 19 in Minneapolis, Minnesota.", "url": "https://www.cnn.com/2020/04/24/us/ufc-x-games-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-24T20:58:39Z", "content": "Due to the ongoing COVID-19 concerns, X Games Minneapolis 2020 -- July 17-19 -- has been cancelled. The safety of the athletes, staff and spectators is our top priority, and we will continue to closely monitor the situation for all X Games events. pic.twitter… [+50 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Wattles, CNN Business", "title": "NASA: Do not come to Florida for SpaceX's historic astronaut launch", "description": "The head of NASA is urging space enthusiasts not to show up to Florida for the launch of SpaceX's first crewed mission next month.", "url": "https://www.cnn.com/2020/04/24/tech/nasa-spacex-crew-dragon-public-viewing-sites-scn/index.html", "urlToImage": null, "publishedAt": "2020-04-24T20:50:00Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Deanna Hackney, CNN", "title": "Maryland governor unveils road map to recovery but says state is not ready to open yet", "description": "Maryland Gov. Larry Hogan on Friday delivered the details of the state's plan to reopen, but at the same time warned the state has not yet hit its Covid-19 peak and is not ready to reopen yet.", "url": "https://www.cnn.com/2020/04/24/politics/maryland-open-plan/index.html", "urlToImage": null, "publishedAt": "2020-04-24T20:48:41Z", "content": "(CNN)Maryland Gov. Larry Hogan on Friday delivered the details of the state's plan to reopen, but at the same time warned the state has not yet hit its Covid-19 peak and is not ready to reopen yet.\r\nHogan, a Republican, said that the state plans to follow the… [+3672 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Deanna Hackney, CNN", "title": "Maryland governor unveils road map to recovery but says state is not ready to open yet", "description": "Maryland Gov. Larry Hogan on Friday delivered the details of the state's plan to reopen, but at the same time warned the state has not yet hit its Covid-19 peak and is not ready to reopen yet.", "url": "https://www.cnn.com/2020/04/24/politics/maryland-open-plan/index.html", "urlToImage": null, "publishedAt": "2020-04-24T20:48:41Z", "content": "(CNN)Maryland Gov. Larry Hogan on Friday delivered the details of the state's plan to reopen, but at the same time warned the state has not yet hit its Covid-19 peak and is not ready to reopen yet.\r\nHogan, a Republican, said that the state plans to follow the… [+3672 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan, CNN", "title": "More than 200 black women urge Biden to pick black woman as running mate", "description": "More than 200 black women on Friday signed an open letter to presumptive Democratic presidential nominee Joe Biden urging him to pick a black woman as his running mate.", "url": "https://www.cnn.com/2020/04/24/politics/black-women-letter-joe-biden-running-mate/index.html", "urlToImage": null, "publishedAt": "2020-04-24T20:28:09Z", "content": "Washington (CNN)More than 200 black women on Friday signed an open letter to presumptive Democratic presidential nominee Joe Biden urging him to pick a black woman as his running mate. \r\nBiden has said he will choose a woman to be his vice presidential nomine… [+3856 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "NASA team developed a ventilator tailored for coronavirus patients in 37 days", "description": "A team of NASA engineers and designers worked with medical professionals to develop a high-pressure ventilator prototype specifically tailored to help coronavirus patients, according to the agency.", "url": "https://www.cnn.com/2020/04/24/health/nasa-ventilator-pandemic-wellness-scn/index.html", "urlToImage": null, "publishedAt": "2020-04-24T20:21:30Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary Cohen and Arman Azad, CNN", "title": "VA will continue to use unproven drug touted by Trump to treat Covid-19 despite FDA saying it has 'known risks'", "description": "The Department of Veterans Affairs says it is continuing to use an anti-malarial drug touted by President Donald Trump to treat coronavirus cases in a manner \"consistent with current FDA guidance\" despite the Food and Drug Administration warning it's not prov…", "url": "https://www.cnn.com/2020/04/24/politics/veterans-affairs-continue-hydroxychloroquine-treatment/index.html", "urlToImage": null, "publishedAt": "2020-04-24T20:13:04Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "First ever 'road map' of the moon released", "description": "The US Geological Survey released the first ever comprehensive lunar map with rock layers and craters charted in great detail.", "url": "https://www.cnn.com/videos/world/2020/04/24/moon-road-map-ns-orig.cnn", "urlToImage": null, "publishedAt": "2020-04-24T20:12:25Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Krol", "title": "How to setup Touch ID on the iPhone SE", "description": "While Face ID is the easy and secure way to unlock the iPhone 11 family, the new iPhone SE uses Touch ID. In fact, it's a second-generation Touch ID backed into a haptic home button. And while we'll leave our full thoughts on the second-generation iPhone SE t…", "url": "https://www.cnn.com/2020/04/24/cnn-underscored/touch-id-iphone-se/index.html", "urlToImage": null, "publishedAt": "2020-04-24T20:06:44Z", "content": "While Face ID is the easy and secure way to unlock the iPhone 11 family, the new iPhone SE uses Touch ID. In fact, it's a second-generation Touch ID backed into a haptic home button. And while we'll leave our full thoughts on the second-generation iPhone SE t… [+3168 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Frank Pallotta, CNN Business", "title": "Virtual NFL Draft nabs record viewership", "description": "The NFL Draft gave fans some much-desired sports programming on Thursday night, and viewers watched in record numbers.", "url": "https://www.cnn.com/2020/04/24/media/nfl-draft-ratings/index.html", "urlToImage": null, "publishedAt": "2020-04-24T20:00:25Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandra Gonzalez, CNN", "title": "Tributes to the entertainers and artists who died from coronavirus", "description": "To honor some the creative forces who have died due to Covid-19, CNN turned to those who knew them, loved them and were deeply affected by the work that defined their legacies.", "url": "https://www.cnn.com/2020/04/24/entertainment/entertainers-weve-lost-to-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-24T19:50:42Z", "content": "(CNN)To honor some the creative forces who have died due to Covid-19, CNN turned to those who knew them, loved them and were deeply affected by the work that defined their legacies. \r\nBelow are tributes to these artists.\r\n\"Mark Blum was an actor's actor. Ever… [+21278 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ray Sanchez and Paula Newton, CNN", "title": "Domestic assault may have triggered Canadian rampage that left 22 dead, police say", "description": "A domestic assault could have been the catalyst of a Nova Scotia shooting rampage that left 22 people dead, the Royal Canadian Mounted Police said Friday.", "url": "https://www.cnn.com/2020/04/24/americas/nova-scotia-shooting-friday/index.html", "urlToImage": null, "publishedAt": "2020-04-24T19:50:33Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brynn Gingras and Sarah Jorgensen, CNN", "title": "For those longing to eat the meatballs at Rao's, now's your chance (pickup only but you'll take it)", "description": "There may be a perk to this pandemic for New Yorkers: meatballs. And not just any meatballs but carnivorous spheres of goodness from an exclusive restaurant that most likely you wouldn't otherwise have tasted in your lifetime.", "url": "https://www.cnn.com/2020/04/24/us/raos-italian-food-nyc-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-24T19:45:53Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Head of Navy recommends reinstating commander of USS Theodore Roosevelt", "description": null, "url": "https://www.cnn.com/collections/us-navy-outbreaks-intl-042420/", "urlToImage": null, "publishedAt": "2020-04-24T19:33:10Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Barbara Starr and Ryan Browne, CNN", "title": "Head of Navy recommends reinstating commander of USS Theodore Roosevelt", "description": "The head of the Navy recommended to Defense Secretary Mark Esper that Capt. Brett Crozier be restored to command of the USS Theodore Roosevelt aircraft carrier on Friday, according to an administration official.", "url": "https://www.cnn.com/2020/04/24/politics/navy-recommend-reinstating-roosevelt-commander/index.html", "urlToImage": null, "publishedAt": "2020-04-24T19:30:24Z", "content": "Washington (CNN)The head of the Navy recommended to Defense Secretary Mark Esper that Capt. Brett Crozier be restored to command of the USS Theodore Roosevelt aircraft carrier on Friday, according to an administration official.\r\nEsper was not prepared to imme… [+4552 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anna Bahney, CNN Business", "title": "Limits on savings withdrawals have been lifted", "description": "Banks can now allow savings account holders to make an unlimited number of transfers or withdrawals, the Federal Reserve Board announced Friday.", "url": "https://www.cnn.com/2020/04/24/success/fed-removes-savings-account-limits/index.html", "urlToImage": null, "publishedAt": "2020-04-24T19:28:20Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jim Acosta and Kevin Liptak, CNN", "title": "Trump can't stop putting his top public health officials in tough spots", "description": "President Donald Trump's choose-your-own-adventure of medical studies and advice has this week forced his coronavirus team's medical experts into awkward and often untenable positions, leading to what some describe as a baffling conundrum of when and how to p…", "url": "https://www.cnn.com/2020/04/24/politics/donald-trump-doctors-science-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-24T19:24:49Z", "content": "(CNN)President Donald Trump's choose-your-own-adventure of medical studies and advice has this week forced his coronavirus team's medical experts into awkward and often untenable positions, leading to what some describe as a baffling conundrum of when and how… [+12053 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jim Acosta and Kevin Liptak, CNN", "title": "Trump can't stop putting his top public health officials in tough spots", "description": "President Donald Trump's choose-your-own-adventure of medical studies and advice has this week forced his coronavirus team's medical experts into awkward and often untenable positions, leading to what some describe as a baffling conundrum of when and how to p…", "url": "https://www.cnn.com/2020/04/24/politics/donald-trump-doctors-science-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-24T19:24:49Z", "content": "(CNN)President Donald Trump's choose-your-own-adventure of medical studies and advice has this week forced his coronavirus team's medical experts into awkward and often untenable positions, leading to what some describe as a baffling conundrum of when and how… [+12053 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "The authoritarian threats of coronavirus", "description": "Christiane speaks with David Rohde, author of \"In Deep\", and Anne Applebaum, author of the forthcoming \"Twilight of Democracy\", about government reactions to Covid-19.", "url": "https://www.cnn.com/videos/tv/2020/04/24/amanpour-david-rohde-anne-applebaum.cnn", "urlToImage": null, "publishedAt": "2020-04-24T19:22:59Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale", "title": "Fact check: Trump lies that he was being 'sarcastic' when he talked about injecting disinfectant", "description": "President Donald Trump lied Friday when he said he was being \"sarcastic\" when he asked medical experts on Thursday to look into the possibility of injecting disinfectant as a treatment for the coronavirus.", "url": "https://www.cnn.com/2020/04/24/politics/fact-check-trump-disinfectant-sarcastic/index.html", "urlToImage": null, "publishedAt": "2020-04-24T19:11:55Z", "content": "Washington (CNN)President Donald Trump lied Friday when he said he was being \"sarcastic\" when he asked medical experts on Thursday to look into the possibility of injecting disinfectant as a treatment for the coronavirus.\r\nDoctors and the company that makes L… [+4297 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Valdes-Dapena, CNN Business", "title": "Automakers plan to restart factories in early May. UAW says not so fast", "description": "Volkswagen, Toyota, Hyundai and Fiat Chrysler are preparing to restart production at factories in the US that have been shut down due to the coronavirus pandemic come early May. It's a move the United Auto Workers says is premature given concerns about the po…", "url": "https://www.cnn.com/2020/04/24/cars/automakers-uaw-restart-production-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-24T19:06:44Z", "content": "(CNN)Volkswagen, Toyota, Hyundai and Fiat Chrysler are preparing to restart production at factories in the US that have been shut down due to the coronavirus pandemic come early May. It's a move the United Auto Workers says is premature given concerns about t… [+1993 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sonia Moghe, CNN", "title": "NY business owner becomes first charged under Defense Production Act for hoarding PPE, sanitizer", "description": "A Long Island man is charged with violating the Defense Production Act, after prosecutors say he hoarded several tons of personal protective equipment needed by first responders and health care workers who are treating Covid-19 patients and sold it at his sto…", "url": "https://www.cnn.com/2020/04/24/politics/defense-production-act-charges-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-24T19:03:07Z", "content": "(CNN)A Long Island man is charged with violating the Defense Production Act, after prosecutors say he hoarded several tons of personal protective equipment needed by first responders and health care workers who are treating Covid-19 patients and sold it at hi… [+3357 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "How nursing homes are dealing with coronavirus pandemic", "description": "CNN's Sara Sidner examines how nursing homes have been dealing with the fallout of the novel coronavirus pandemic.", "url": "https://www.cnn.com/videos/us/2020/04/24/nursing-homes-coronavirus-deaths-sidner-newday-dnt-vpx.cnn", "urlToImage": null, "publishedAt": "2020-04-24T19:01:56Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rishi Iyengar, CNN Business", "title": "Facebook is taking on Zoom with new video features", "description": "Facebook has a long history of expanding its features to emulate major tech competitors. Now, it's taking on platform-of-the-moment Zoom.", "url": "https://www.cnn.com/2020/04/24/tech/facebook-video-calling-upgrades/index.html", "urlToImage": null, "publishedAt": "2020-04-24T18:55:26Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dan Merica, Arlette Saenz and Sarah Mucha, CNN", "title": "Biden extends influence over party with joint fundraising agreement", "description": "Joe Biden's campaign and the Democratic National Committee formally agreed to a joint fundraising agreement on Friday, two Democratic officials tell CNN, clearing the way for the presumptive nominee to raise larger amounts from individuals with the committee …", "url": "https://www.cnn.com/2020/04/24/politics/biden-democratic-national-committee/index.html", "urlToImage": null, "publishedAt": "2020-04-24T18:45:19Z", "content": "(CNN)Joe Biden's campaign and the Democratic National Committee formally agreed to a joint fundraising agreement on Friday, two Democratic officials tell CNN, clearing the way for the presumptive nominee to raise larger amounts from individuals with the commi… [+4167 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Lobosco, CNN", "title": "More than 88 million stimulus payments have been delivered, Treasury says", "description": "More than 88 million people received their stimulus payments last week, totaling nearly $158 billion, the Treasury Department and Internal Revenue Service said Friday.", "url": "https://www.cnn.com/2020/04/24/politics/treasury-stimulus-payments-delivered/index.html", "urlToImage": null, "publishedAt": "2020-04-24T18:44:44Z", "content": "Washington (CNN)More than 88 million people received their stimulus payments last week, totaling nearly $158 billion, the Treasury Department and Internal Revenue Service said Friday.\r\nThe data shows that as of April 17, the greatest number of payments went t… [+1970 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Tony Hale has a new movie and some advice on staying sane at home", "description": "Tony Hale has a new movie you can stream from the comfort of your couch this weekend.", "url": "https://www.cnn.com/2020/04/24/entertainment/tony-hale-to-the-stars-veep-coronavirus-interview/index.html", "urlToImage": null, "publishedAt": "2020-04-24T18:44:19Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Anderson Cooper: Trump just lied about something we all witnessed", "description": "President Donald Trump says he was being sarcastic when he suggested disinfectant could kill the coronavirus and CNN's Anderson Cooper rolls the tape showing that wasn't the case.", "url": "https://www.cnn.com/videos/politics/2020/04/24/donald-trump-sunlight-disinfectant-walk-back-lies-cooper-sot-vpx.cnn", "urlToImage": null, "publishedAt": "2020-04-24T18:42:07Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ellen McAlpine", "title": "Your new iPhone SE is on the way and you deserve the best accessories to go with it", "description": "So, you've ordered your new iPhone SE, and couldn't be more excited. We're pumped about this new addition to the iPhone lineup, and we're even more excited about the accessories to go with it. We've listed out our top picks for charging options, cases, screen…", "url": "https://www.cnn.com/2020/04/24/cnn-underscored/best-iphone-se-accessories/index.html", "urlToImage": null, "publishedAt": "2020-04-24T18:39:23Z", "content": "So, you've ordered your new iPhone SE, and couldn't be more excited. We're pumped about this new addition to the iPhone lineup, and we're even more excited about the accessories to go with it. We've listed out our top picks for charging options, cases, screen… [+10295 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone", "title": "The best sales to shop this weekend: Sephora, Rosetta Stone, DNA kits and more", "description": "We've rounded up a few of our favorite sales to shop over the next few days, including everything from refurb audio equipment and on-sale DNA kits for DNA Day to markdowns on thousands of beauty products at Sephora.", "url": "https://www.cnn.com/2020/04/24/cnn-underscored/weekend-sales-deals/index.html", "urlToImage": null, "publishedAt": "2020-04-24T18:27:25Z", "content": "Spend this weekend saving money. We've rounded up a few of our favorite sales to shop over the next few days, including everything from refurb audio equipment and on-sale DNA kits for DNA Day to markdowns on thousands of beauty products at Sephora. No matter … [+4912 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan, CNN Business", "title": "First on CNN Business: JPMorgan, Ruth's Chris accused of cheating small businesses out of emergency loans", "description": "JPMorgan Chase, Ruth's Chris Steak House and others are being accused in a lawsuit of efforts to \"cheat\" small businesses out of federal stimulus funding.", "url": "https://www.cnn.com/2020/04/24/business/ruth-chris-jpmorgan-small-business-ppp/index.html", "urlToImage": null, "publishedAt": "2020-04-24T18:19:26Z", "content": "New York (CNN Business)JPMorgan Chase, Ruth's Chris Steak House and others are being accused in a lawsuit of efforts to \"cheat\" small businesses out of federal stimulus funding.\r\nAn Illinois popcorn seller hurt by the coronavirus pandemic alleges that JPMorga… [+7482 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan, CNN Business", "title": "JPMorgan, Ruth's Chris accused of cheating small businesses out of emergency loans", "description": "JPMorgan Chase, Ruth's Chris Steak House and others are being accused in a lawsuit of efforts to \"cheat\" small businesses out of federal stimulus funding.", "url": "https://www.cnn.com/2020/04/24/business/ruth-chris-jpmorgan-small-business-ppp/index.html", "urlToImage": null, "publishedAt": "2020-04-24T18:19:26Z", "content": "New York (CNN Business)JPMorgan Chase, Ruth's Chris Steak House and others are being accused in a lawsuit of efforts to \"cheat\" small businesses out of federal stimulus funding.\r\nAn Illinois popcorn seller hurt by the coronavirus pandemic alleges that JPMorga… [+7482 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Erica Hernandez, CNN", "title": "Settle in with these weekend reads", "description": "Grab a cup of coffee and settle in. Here's what you might have missed during a busy news week.", "url": "https://www.cnn.com/2020/04/24/app-news-section/weekend-reads-april-24/index.html", "urlToImage": null, "publishedAt": "2020-04-24T18:18:49Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ali Velez Alderfer, CNN", "title": "Quickly catch up on the day's news", "description": "Here's what you might have missed on CNN.", "url": "https://www.cnn.com/2020/04/24/app-news-section/quickly-catch-up-april-24/index.html", "urlToImage": null, "publishedAt": "2020-04-24T18:17:46Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "See Dr. Birx's reaction to Trump's dangerous suggestion", "description": "President Trump asked William Bryan, head of science and technology for DHS, to study UV light and dangerously injecting disinfectant to treat coronavirus. Medical experts agree that sunlight and disinfectant are not safe human treatments for coronavirus.", "url": "https://www.cnn.com/videos/politics/2020/04/24/birx-reaction-trump-disinfectant-vpx.cnn", "urlToImage": null, "publishedAt": "2020-04-24T18:12:28Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Taylor Swift slams ex-record label for releasing new album", "description": "The longtime feud between Taylor Swift and her former record label has been reignited.", "url": "https://www.cnn.com/2020/04/24/entertainment/taylor-swift-fight-album-big-machine-label-group/index.html", "urlToImage": null, "publishedAt": "2020-04-24T18:11:11Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez, CNN", "title": "Migrant children are still attending deportation hearings amid the pandemic", "description": "As the United States shuttered due to coronavirus, every day children watched immigration judges miles away pop up on TV screens for hearings that will ultimately decide whether they can stay in the country.", "url": "https://www.cnn.com/2020/04/24/politics/children-immigration-hearings/index.html", "urlToImage": null, "publishedAt": "2020-04-24T18:11:10Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Richard Gere and his wife welcome baby boy", "description": "Richard Gere and his wife, Alejandra Silva, have welcomed their second son, a rep for the actor confirms to CNN.", "url": "https://www.cnn.com/2020/04/24/entertainment/richard-gere-baby-boy-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-24T18:03:51Z", "content": "(CNN)Richard Gere and his wife, Alejandra Silva, have welcomed their second son, a rep for the actor confirms to CNN.\r\nGere, 70 and Silva, 37, already have 14-month-old Alexander. Gere also has a 20-year-old son from a previous marriage. Silva has a son with … [+419 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France, CNN", "title": "Nick Cordero's wife offers update as he battles coronavirus", "description": "According to Nick Cordero's wife, Amanda Kloots, they are in \"a bit of a waiting game.\" The Broadway actor has been battling the coronavirus and recently had his leg amputated due to complications from the virus.", "url": "https://www.cnn.com/2020/04/24/entertainment/nick-cordero-coronavirus-update/index.html", "urlToImage": null, "publishedAt": "2020-04-24T18:03:15Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Foran and Haley Byrd, CNN", "title": "Pelosi promises more coronavirus relief: 'There will be a bill and it will be expensive'", "description": "House Speaker Nancy Pelosi insisted on Friday that congressional efforts to deliver coronavirus relief are not finished, saying there will be yet another major legislative package after Congress passed $484 billion in aid for small businesses, hospitals and t…", "url": "https://www.cnn.com/2020/04/24/politics/coronavirus-legislation-pelosi/index.html", "urlToImage": null, "publishedAt": "2020-04-24T17:59:54Z", "content": "Washington (CNN)House Speaker Nancy Pelosi insisted on Friday that congressional efforts to deliver coronavirus relief are not finished, saying there will be yet another major legislative package after Congress passed $484 billion in aid for small businesses,… [+1264 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "READ: FDA warns of serious side effects for drugs touted by Trump to treat coronavirus", "description": "Today, the U.S. Food and Drug Administration issued a Drug Safety Communication regarding known side effects of hydroxychloroquine and chloroquine, including serious and potentially life-threatening heart rhythm problems, that have been reported with their us…", "url": "https://www.cnn.com/2020/04/24/politics/fda-warning-drugs-coronavirus-trump/index.html", "urlToImage": null, "publishedAt": "2020-04-24T17:27:16Z", "content": "(CNN)Today, the U.S. Food and Drug Administration issued a Drug Safety Communication regarding known side effects of hydroxychloroquine and chloroquine, including serious and potentially life-threatening heart rhythm problems, that have been reported with the… [+4268 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Scannell", "title": "Michael Avenatti released from jail due to coronavirus fears", "description": "Michael Avenatti, the celebrity attorney whose clients include adult film star Stormy Daniels, has been released from a New York jail as he begins a temporary reprieve from detention because of coronavirus pandemic fears.", "url": "https://www.cnn.com/2020/04/24/politics/michael-avenatti-prison-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-24T17:20:37Z", "content": "(CNN)Michael Avenatti, the celebrity attorney whose clients include adult film star Stormy Daniels, has been released from a New York jail as he begins a temporary reprieve from detention because of coronavirus pandemic fears.\r\nAvenatti was released from the … [+647 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Arman Azad", "title": "FDA warns of serious side effects from drugs touted by Trump to treat coronavirus", "description": "Hydroxychloroquine and chloroquine, malaria drugs promoted by President Trump to treat Covid-19 coronavirus, could cause dangerous and even deadly health problems, the FDA warns.", "url": "https://www.cnn.com/2020/04/24/health/fda-warns-against-chloroquine-to-treat-covid/index.html", "urlToImage": null, "publishedAt": "2020-04-24T17:18:53Z", "content": "(CNN)The US Food and Drug Administration warned on Friday against the use of two drugs that have been touted by President Donald Trump as potential treatments for the novel coronavirus.\r\nThe drugs, hydroxychloroquine and chloroquine, should only be used in ho… [+4889 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "Doctors reject Trump's dangerous suggestion to use disinfectant as a coronavirus treatment", "description": "Doctors are rejecting the idea floated by President Donald Trump that research should be done into whether chemical disinfectants could be injected into human bodies as a potential coronavirus treatment.", "url": "https://www.cnn.com/2020/04/24/politics/doctors-respond-trump-disinfectant-injection-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-24T17:07:17Z", "content": "Washington (CNN)Doctors are rejecting the idea floated by President Donald Trump that research should be done into whether chemical disinfectants could be injected into human bodies as a potential coronavirus treatment.\r\nThere's \"absolutely no merit\" to the i… [+4091 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Staff", "title": "CNN Underscored staff picks: 10 things that have improved our productivity", "description": "We've rounded up CNN Underscored staffers' favorite products for helping them stay focused throughout the week during these uncertain times. If you're in the market for some suggestions to improve your productivity, read on.", "url": "https://www.cnn.com/2020/04/24/cnn-underscored/underscored-favorite-products-for-productivity/index.html", "urlToImage": null, "publishedAt": "2020-04-24T17:01:58Z", "content": "We've interviewed experts and found the best options to help you cope during this uncertain time. Find all of our coronavirus-related coverage here, and let us know your thoughts here.\r\nFor those of us lucky enough to have a job that we can perform remotely, … [+9986 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "W. Kamau Bell, CNN", "title": "W. Kamau Bell: What an Oklahoma rancher wants you to know about America's broken food supply system", "description": "\"United Shades of America\" host W. Kamau Bell speaks candidly with farmer Scott Blubaugh of Tonkawa, Oklahoma, who describes how Covid-19 has put a glaring spotlight on what's wrong with the way our country handles food production and distribution.", "url": "https://www.cnn.com/2020/04/24/opinions/united-shades-of-america-family-farms-kamau-bell-opinion/index.html", "urlToImage": null, "publishedAt": "2020-04-24T16:57:35Z", "content": "W. Kamau Bell is a sociopolitical comedian who is the host and executive producer of the Emmy Award-winning CNN Original Series \"United Shades of America with W. Kamau Bell.\" The views expressed here are his; read more opinion on CNN. \r\n (CNN)I first met Scot… [+13847 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Blake Ellis and Melanie Hicken, CNN", "title": "Covid-19 is ravaging nursing homes. Government records show why", "description": "Government records reveal how supply shortages, lapses in care, a lack of transparency and inadequate infection control precautions are fueling the spread of Covid-19 within America's nursing homes.", "url": "https://www.cnn.com/2020/04/24/us/nursing-homes-coronavirus-invs/index.html", "urlToImage": null, "publishedAt": "2020-04-24T16:28:23Z", "content": "(CNN)Government records reveal how supply shortages, lapses in care, a lack of transparency and inadequate infection control precautions are fueling the spread of Covid-19 within America's nursing homes. \r\nTroubled facilities and highly rated nursing homes al… [+20126 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexander Salerno for CNN Business Perspectives", "title": "As a doctor in the US, I shouldn't have to buy masks and gloves on the black market", "description": "Because the United States outsources the production of medical supplies and test components to countries like Italy and China, we are in the midst of the greatest supply shortage I've ever seen, writes Alexander Salerno, a primary care physician at Salerno Me…", "url": "https://www.cnn.com/2020/04/24/perspectives/ppe-production-shortage/index.html", "urlToImage": null, "publishedAt": "2020-04-24T16:25:55Z", "content": "Alexander Salerno is a primary care physician at Salerno Medical Associates, a family practice in New Jersey dedicated to population health, chronic disease management and community health. The opinions expressed in this commentary are his own.\r\nI recently pa… [+3674 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Weisfeldt and Rosa Flores, CNN", "title": "More Florida beaches are reopening", "description": "The beaches in Bay County, Florida, are officially back open as of Friday with limitations during the Covid-19 pandemic. \nPublic Beaches in Sarasota County, Florida, will reopen on Monday for \"essential\" recreational activities.", "url": "https://www.cnn.com/2020/04/24/us/florida-beaches-reopening-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-24T16:21:04Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Owner reopening salon: Stylists, clients can't be 6 feet apart", "description": "After Georgia Gov. Brian Kemp announced certain nonessential businesses may reopen during the coronavirus pandemic, business owners face a difficult choice.", "url": "https://www.cnn.com/videos/us/2020/04/24/ga-business-owners-struggle-reopening-during-pandemic-intv-newsroom-vpx.cnn", "urlToImage": null, "publishedAt": "2020-04-24T16:16:07Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "As the DRC fights disease, the coronavirus threat looms", "description": "The Democratic Republic of Congo is fighting several killer diseases at the same time -- measles, polio, malaria, cholera, Ebola and now the coronavirus. CNN's Radina Gigova reports.", "url": "https://www.cnn.com/videos/world/2020/04/17/drc-killer-diseases-malaria-polio-cholera-measles-ebola-coronavirus-lon-orig-na.cnn", "urlToImage": null, "publishedAt": "2020-04-24T16:11:35Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "W. Kamau Bell, CNN", "title": "W. Kamau Bell: What an Oklahoma rancher wants you to know about America's broken food supply system", "description": "\"United Shades of America\" host W. Kamau Bell speaks candidly with farmer Scott Blubaugh of Tonkawa, Oklahoma, who describes how Covid-19 has put a glaring spotlight on what's wrong with the way our country handles food production and distribution.", "url": "https://www.cnn.com/2020/04/24/us/united-shades-of-america-family-farms-kamau-bell/index.html", "urlToImage": null, "publishedAt": "2020-04-24T16:01:12Z", "content": "(CNN)I first met Scott Blubaugh, the president of the Oklahoma Farmers Union, last year when I was filming an episode on family farms for this summer's season of \"United Shades of America.\" There's a lot of talk in this country of farmers as the backbone of A… [+13608 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Wallace", "title": "Everything you need to make your own face mask", "description": "It's now recommended that all Americans wear face coverings while in public. With guidance from an expert, we rounded up everything to make your own, as well as some of our favorite premade masks available now on Etsy.", "url": "https://www.cnn.com/2020/04/24/cnn-underscored/how-to-make-face-mask-at-home/index.html", "urlToImage": null, "publishedAt": "2020-04-24T15:57:55Z", "content": "CNN Underscored has interviewed experts to find the best options to help you cope during this uncertain time. Find all our coronavirus-related coverage here, and let us know your thoughts here.\r\nThe Centers for Disease Control and Prevention, the US surgeon g… [+10815 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew, CNN", "title": "Elijah Wood visited a stranger on 'Animal Crossing' to sell turnips and make friends", "description": "For everyone in isolation, the Nintendo Switch game \"Animal Crossing: New Horizons\" has been a boon: It's a place to virtually meet up with friends, pretend to live a simple, pandemic-free existence -- and run into the occasional celebrity.", "url": "https://www.cnn.com/2020/04/24/culture/elijah-wood-animal-crossing-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-24T15:57:34Z", "content": "(CNN)For everyone in isolation, the Nintendo Switch game \"Animal Crossing: New Horizons\" has been a boon: It's a place to virtually meet up with friends, pretend to live a simple, pandemic-free existence and run into the occasional celebrity -- like Elijah Wo… [+2438 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Karol Brinkley, CNN", "title": "Must-watch videos of the week", "description": "Jellyfish swimming in clear canals in Venice, a bullied boy gets an A-list level surprise and tennis players on lockdown find a unique way to play their sport. There are the videos you don't want to miss this week.", "url": "https://www.cnn.com/2020/04/24/app-news-section/videos-of-the-week-mobile-april-24/index.html", "urlToImage": null, "publishedAt": "2020-04-24T15:52:59Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ryan Browne and Michael Conte, CNN", "title": "Second US Navy warship hit by major coronavirus outbreak", "description": "A US Navy destroyer performing a counter narcotics mission has been hit by an outbreak of at least 18 coronavirus cases, a US Navy official tells CNN.", "url": "https://www.cnn.com/2020/04/24/politics/uss-kidd-coronavirus-outbreak/index.html", "urlToImage": null, "publishedAt": "2020-04-24T15:43:59Z", "content": null}]}