{"status": "ok", "totalResults": 327, "articles": [{"source": {"id": "google-news", "name": "Google News"}, "author": "news+feed@crunchyroll.com", "title": "Cel-Ga Fills the Convention Void with Online Live Anime Cel Auction", "description": "Event will take place July 4Want to own a little piece of anime history? Cel-Ga is looking for you! The London anime cel dealer will be holding a live online auction this July 4 for interested collectors. Find out how to take part after the jump!", "url": "http://feedproxy.google.com/~r/crunchyroll/animenews/~3/PkBTtMWpXlc/cel-ga-fills-the-convention-void-with-online-live-anime-cel-auction", "urlToImage": null, "publishedAt": "2020-06-30T18:47:48Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "news+feed@crunchyroll.com", "title": "Sword Art Online: Alicization Lycoris Trailer is All About Large-Scale Battles", "description": "Four players and four AI partners can team up to execute group attacksIn Sword Art Online: Alicization Lycoris, you'll be able to team up in parties consisting of four players and four AI partners, complete with powerful group attacks to even the odds some of…", "url": "http://feedproxy.google.com/~r/crunchyroll/animenews/~3/S9poUawW_bk/sword-art-online-alicization-lycoris-trailer-is-all-about-large-scale-battles", "urlToImage": null, "publishedAt": "2020-06-30T18:28:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Matthew Fox", "title": "Workhorse extends June rally to 706% after securing $70 million in new financing (WKHS)", "description": "<ul>\n<li>Workhorse surged as much as 38% on Tuesday after the company secured $70 million in new financing. </li>\n<li>The jump extended the electric vehicle maker's June rally to as much as 706%. </li>\n<li>Workhorse was added to the Russell 3000 index on Mond…", "url": "http://feedproxy.google.com/~r/clusterstock/~3/JElPVI2QCGA/workhorse-stock-price-june-secures-financing-russell3000-electric-vehicle-2020-6-1029355924", "urlToImage": null, "publishedAt": "2020-06-30T18:17:43Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Uddhav K. Shigdel, Seung-Joo Lee, Mathew E. Sowa, Brian R. Bowman, Keith Robison, Minyun Zhou, Khian Hong Pua, Dylan T. Stiles, Joshua A. V. Blodgett, Daniel W. Udwary, Andrew T. Rajczewski, Alan S. Mann, Siavash Mostafavi, Tara Hardy, Sukrat Arya, Zhigang Weng, Michelle Stewart, Kyle Kenyon, Jay P. Morgenstern, Ende Pan, Daniel C. Gray, Roy M. Pollock, Andrew M. Fry, Richard D. Klausner, Sharon A. Townson, Gregory L. Verdine", "title": "Genomic discovery of an evolutionarily programmed modality for small-molecule targeting of an intractable protein surface [Microbiology]", "description": "The vast majority of intracellular protein targets are refractory toward small-molecule therapeutic engagement, and additional therapeutic modalities are needed to overcome this deficiency. Here, the identification and characterization of a natural product, W…", "url": "http://feedproxy.google.com/~r/Pnas-RssFeedOfEarlyEditionArticles/~3/Q4qhzYAFsmk/2006560117.short", "urlToImage": null, "publishedAt": "2020-06-30T17:48:02Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Jian Wu, Lu Xia, Xiangyu Yao, Xiao Yu, Keyla C. Tumas, Wenxiang Sun, Yang Cheng, Xiao He, Yu-chih Peng, Brajesh K. Singh, Cui Zhang, Chen-Feng Qi, Silvia Bolland, Sonja M. Best, Channe Gowda, Ruili Huang, Timothy G. Myers, Carole A. Long, Rong-Fu Wang, Xin-zhuan Su", "title": "The E3 ubiquitin ligase MARCH1 regulates antimalaria immunity through interferon signaling and T cell activation [Microbiology]", "description": "Malaria infection induces complex and diverse immune responses. To elucidate the mechanisms underlying host–parasite interaction, we performed a genetic screen during early (24 h) Plasmodium yoelii infection in mice and identified a large number of interactin…", "url": "http://feedproxy.google.com/~r/Pnas-RssFeedOfEarlyEditionArticles/~3/oytaR_TRtOI/2004332117.short", "urlToImage": null, "publishedAt": "2020-06-30T17:48:01Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "TinkerTool 7.5 - Expanded preference settings for OS X. (Free)", "description": "TinkerTool is an application that gives you access to additional preference settings Apple has built into Mac OS X. This allows to activate hidden features in the operating system and in some of the applications delivered with the system. \n\nThe tool makes sur…", "url": "http://feedproxy.google.com/~r/macupdate/~3/_JGUdgv9Y2E/1593539002", "urlToImage": null, "publishedAt": "2020-06-30T17:43:22Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Claire Tsosie", "title": "Alaska Airlines Mileage Plan: Your Complete Guide", "description": "» COVID-19 updates: Alaska’s change and cancellation policies. Alaska’s elite status policies. For people who fly from the West Coast, Alaska Airlines checks all the boxes: It serves complimentary in-flight…", "url": "http://feedproxy.google.com/~r/NerdwalletCreditCardWatch/~3/KBpSk78GOoc/alaska-airlines-mileage-plan-your-complete-guide", "urlToImage": null, "publishedAt": "2020-06-30T17:37:37Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Mac Cleaner 3.0.0 - Powerful system optimizer. (Free)", "description": "Mac Cleaner is a powerful 7-in-1 Mac Software. Seven powerful Features of Mac Cleaner: Mac Cleaner, Uninstaller, Duplicate Finder, Similar Finder, File Shredder, Browser Cleanup, Extension Manager. You can use it to Speed Up your Mac in One Click. Automatical…", "url": "http://feedproxy.google.com/~r/macupdate/~3/JKOLIyb37dU/1593538610", "urlToImage": null, "publishedAt": "2020-06-30T17:36:50Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "iMyMac 3.0.0 - Free all-in-one system optimizer. (Demo)", "description": "Mac Cleaner is a powerful 7-in-1 Mac Software. Seven powerful Features of Mac Cleaner: Mac Cleaner, Uninstaller, Duplicate Finder, Similar Finder, File Shredder, Browser Cleanup, Extension Manager. You can use it to Speed Up your Mac in One Click. Automatical…", "url": "http://feedproxy.google.com/~r/macupdate/~3/u-mXTILBf5A/1593538610", "urlToImage": null, "publishedAt": "2020-06-30T17:36:50Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Olivia Muenter", "title": "The One Tiny Design Tweak That Got Me Out of the Habit of Eating Dinner on the Couch", "description": "Netflix can wait!\nREAD MORE...", "url": "http://feedproxy.google.com/~r/apartmenttherapy/thekitchn/~3/2tdFFk9GiFM/eat-at-dining-table-tip-23050106", "urlToImage": null, "publishedAt": "2020-06-30T17:30:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Umbra 1.1.2 - Specify different wallpapers for light & dark mode. (Demo)", "description": "Umbra is a little menu bar app that lets you specify different desktop wallpapers for both light & dark appearances in macOS. \n\nYou can also switch between light & dark modes at any time by simply option clicking the Umbra icon in your menu bar. \n\nSupport & F…", "url": "http://feedproxy.google.com/~r/macupdate/~3/-wfq7Ks_QrU/1593538094", "urlToImage": null, "publishedAt": "2020-06-30T17:28:14Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Adobe Illustrator 24.2.1 - Professional vector graphics tool for Web and print. (Demo)", "description": "You can download Adobe Illustrator for Mac as a part of Creative Cloud for only $20.99/month (or $9.99/month if you have also purchased an earlier software version). \n\nAdobe Illustrator for Mac is the vector graphics classics in the design industry. It is a d…", "url": "http://feedproxy.google.com/~r/macupdate/~3/Xfw-Sgoq1Hw/1593537174", "urlToImage": null, "publishedAt": "2020-06-30T17:12:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "William Lambert, Laura A. Cobus, Thomas Frappart, Mathias Fink, Alexandre Aubry", "title": "Distortion matrix approach for ultrasound imaging of random scattering media [Applied Physical Sciences]", "description": "Focusing waves inside inhomogeneous media is a fundamental problem for imaging. Spatial variations of wave velocity can strongly distort propagating wave fronts and degrade image quality. Adaptive focusing can compensate for such aberration but is only effect…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/sJWiPjGIal8/14645.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Dominic T. Castanzo, Benjamin LaFrance, Andreas Martin", "title": "The AAA+ ATPase Msp1 is a processive protein translocase with robust unfoldase activity [Biochemistry]", "description": "Msp1 is a conserved eukaryotic AAA+ ATPase localized to the outer mitochondrial membrane, where it is thought to extract mislocalized tail-anchored proteins. Despite recent in vivo and in vitro studies supporting this function, a mechanistic understanding of …", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/7OF3cfj8cjc/14970.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Fabrizio Mafessoni, Steffi Grote, Cesare de Filippo, Viviane Slon, Kseniya A. Kolobova, Bence Viola, Sergey V. Markin, Manȷusha Chintalapati, Stephane Peyregne, Laurits Skov, Pontus Skoglund, Andrey I. Krivoshapkin, Anatoly P. Derevianko, Matthias Meyer, Janet Kelso, Benȷamin Peter, Kay Prufer, Svante Paabo", "title": "A high-coverage Neandertal genome from Chagyrskaya Cave [Genetics]", "description": "We sequenced the genome of a Neandertal from Chagyrskaya Cave in the Altai Mountains, Russia, to 27-fold genomic coverage. We show that this Neandertal was a female and that she was more related to Neandertals in western Eurasia [Prüfer et al., Science 358, 6…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/B7yV5oiZGeo/15132.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Seth G. Benzell, Avinash Collis, Christos Nicolaides", "title": "Rationing social contact during the COVID-19 pandemic: Transmission risk and social benefits of US locations [Economic Sciences]", "description": "To prevent the spread of coronavirus disease 2019 (COVID-19), some types of public spaces have been shut down while others remain open. These decisions constitute a judgment about the relative danger and benefits of those locations. Using mobility data from a…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/PU1s8jBkuHg/14642.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Deirdre B. Hoban, Shelby Shrigley, Bengt Mattsson, Ludivine S. Breger, Ulla Jarl, Tiago Cardoso, Jenny Nelander Wahlestedt, Kelvin C. Luk, Anders Bȷorklund, Malin Parmar", "title": "Impact of {alpha}-synuclein pathology on transplanted hESC-derived dopaminergic neurons in a humanized {alpha}-synuclein rat model of PD [Neuroscience]", "description": "Preclinical assessment of the therapeutic potential of dopamine (DA) neuron replacement in Parkinson’s disease (PD) has primarily been performed in the 6-hydroxydopamine toxin model. While this is a good model to assess graft function, it does not reflect the…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/22M4GA8k-58/15209.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Leo I. Volkov, Jeong Sook Kim-Han, Lauren M. Saunders, Deepak Poria, Andrew E. O. Hughes, Vladimir J. Kefalov, David M. Parichy, Joseph C. Corbo", "title": "Thyroid hormone receptors mediate two distinct mechanisms of long-wavelength vision [Neuroscience]", "description": "Thyroid hormone (TH) signaling plays an important role in the regulation of long-wavelength vision in vertebrates. In the retina, thyroid hormone receptor β (thrb) is required for expression of long-wavelength-sensitive opsin (lws) in red cone photoreceptors,…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/iA3h8WLt7Y0/15262.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Jeffrey W. Grover, Diane Burgess, Timmy Kendall, Abdul Baten, Suresh Pokhrel, Graham J. King, Blake C. Meyers, Michael Freeling, Rebecca A. Mosher", "title": "Abundant expression of maternal siRNAs is a conserved feature of seed development [Plant Biology]", "description": "Small RNAs are abundant in plant reproductive tissues, especially 24-nucleotide (nt) small interfering RNAs (siRNAs). Most 24-nt siRNAs are dependent on RNA Pol IV and RNA-DEPENDENT RNA POLYMERASE 2 (RDR2) and establish DNA methylation at thousands of genomic…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/IdQEijM6wnU/15305.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Tao-Hsin Chang, Fu-Lien Hsieh, Philip M. Smallwood, Sandra B. Gabelli, Jeremy Nathans", "title": "Structure of the RECK CC domain, an evolutionary anomaly [Evolution]", "description": "Five small protein domains, the CC-domains, at the N terminus of the RECK protein, play essential roles in signaling by WNT7A and WNT7B in the context of central nervous system angiogenesis and blood–brain barrier formation and maintenance. We have determined…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/J0KucYrXPes/15104.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Menachem Stern, Chukwunonso Arinze, Leron Perez, Stephanie E. Palmer, Arvind Murugan", "title": "Supervised learning through physical changes in a mechanical system [Physics]", "description": "Mechanical metamaterials are usually designed to show desired responses to prescribed forces. In some applications, the desired force–response relationship is hard to specify exactly, but examples of forces and desired responses are easily available. Here, we…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/Nfj_r1WQW_k/14843.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Andrew Steptoe, Paola Zaninotto", "title": "Lower socioeconomic status and the acceleration of aging: An outcome-wide analysis [Social Sciences]", "description": "Aging involves decline in a range of functional abilities and phenotypes, many of which are also associated with socioeconomic status (SES). Here we assessed whether lower SES is a determinant of the rate of decline over 8 y in six domains—physical capability…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/A10HKGZOpH4/14911.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Terry L. Schell, Matthew Cefalu, Beth Ann Griffin, Rosanna Smart, Andrew R. Morral", "title": "Changes in firearm mortality following the implementation of state laws regulating firearm access and use [Social Sciences]", "description": "Although 39,000 individuals die annually from gunshots in the US, research examining the effects of laws designed to reduce these deaths has sometimes produced inconclusive or contradictory findings. We evaluated the effects on total firearm-related deaths of…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/44Ntjyz41sY/14906.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Rene F. Kizilcec, Justin Reich, Michael Yeomans, Christoph Dann, Emma Brunskill, Glenn Lopez, Selen Turkay, Joseph Jay Williams, Dustin Tingley", "title": "Scaling up behavioral science interventions in online education [Psychological and Cognitive Sciences]", "description": "Online education is rapidly expanding in response to rising demand for higher and continuing education, but many online students struggle to achieve their educational goals. Several behavioral science interventions have shown promise in raising student persis…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/g3QdkCQ00X8/14900.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Michael W. Cooke, Adrian Botti, Dorian Zok, Georg Steinhauser, Kurt R. Ungar", "title": "Identification of a chemical fingerprint linking the undeclared 2017 release of 106Ru to advanced nuclear fuel reprocessing [Chemistry]", "description": "The undeclared release and subsequent detection of ruthenium-106 (106Ru) across Europe from late September to early October of 2017 prompted an international effort to ascertain the circumstances of the event. While dispersion modeling, corroborated by ground…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/csJDUNL2E2M/14703.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Haiwen Zhang, Kally C. S. Ly, Xianghui Liu, Zhihan Chen, Max Yan, Zilong Wu, Xin Wang, Yuebing Zheng, Han Zhou, Tongxiang Fan", "title": "Biologically inspired flexible photonic films for efficient passive radiative cooling [Applied Physical Sciences]", "description": "Temperature is a fundamental parameter for all forms of lives. Natural evolution has resulted in organisms which have excellent thermoregulation capabilities in extreme climates. Bioinspired materials that mimic biological solution for thermoregulation have p…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/wQOvnVHoKV0/14657.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Samuel Stolz, Oliver Groning, Jan Prinz, Harald Brune, Roland Widmer", "title": "Molecular motor crossing the frontier of classical to quantum tunneling motion [Physics]", "description": "The reliability by which molecular motor proteins convert undirected energy input into directed motion or transport has inspired the design of innumerable artificial molecular motors. We have realized and investigated an artificial molecular motor applying sc…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/Kf0O52FtLy0/14838.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Mingchao Zhang, Rui Guo, Ke Chen, Yiliang Wang, Jiali Niu, Yubing Guo, Yong Zhang, Zhe Yin, Kailun Xia, Binghan Zhou, Huimin Wang, Wenya He, Jing Liu, Metin Sitti, Yingying Zhang", "title": "Microribbons composed of directionally self-assembled nanoflakes as highly stretchable ionic neural electrodes [Applied Physical Sciences]", "description": "Many natural materials possess built-in structural variation, endowing them with superior performance. However, it is challenging to realize programmable structural variation in self-assembled synthetic materials since self-assembly processes usually generate…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/XUApxaEzS5c/14667.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Jules Dupire, Pierre–Henri Puech, Emmanuele Helfer, Annie Viallat", "title": "Mechanical adaptation of monocytes in model lung capillary networks [Cell Biology]", "description": "Proper circulation of white blood cells (WBCs) in the pulmonary vascular bed is crucial for an effective immune response. In this branched vascular network, WBCs have to strongly deform to pass through the narrowest capillaries and bifurcations. Although it i…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/FSJfRc_Ghf4/14798.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Jia Liu, Xinyuan Zhang, Yuxin Liu, Miguel Rodrigo, Patrick D. Loftus, Joy Aparicio-Valenzuela, Jukuan Zheng, Terrence Pong, Kevin J. Cyr, Meghedi Babakhanian, Jasmine Hasi, Jinxing Li, Yuanwen Jiang, Christopher J. Kenney, Paul J. Wang, Anson M. Lee, Zhenan Bao", "title": "Intrinsically stretchable electrode array enabled in vivo electrophysiological mapping of atrial fibrillation at cellular resolution [Engineering]", "description": "Electrophysiological mapping of chronic atrial fibrillation (AF) at high throughput and high resolution is critical for understanding its underlying mechanism and guiding definitive treatment such as cardiac ablation, but current electrophysiological tools ar…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/Fwg5jbqsBN0/14769.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Jorge Morales, Axel Bax, Chaz Firestone", "title": "Sustained representation of perspectival shape [Psychological and Cognitive Sciences]", "description": "Arguably the most foundational principle in perception research is that our experience of the world goes beyond the retinal image; we perceive the distal environment itself, not the proximal stimulation it causes. Shape may be the paradigm case of such “uncon…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/lyM_KZBTktk/14873.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Kirsten Lex, Mariana Maia Gil, Bruno Lopes–Bastos, Margarida Figueira, Marta Marzullo, Kety Giannetti, Tania Carvalho, Miguel Godinho Ferreira", "title": "Telomere shortening produces an inflammatory environment that increases tumor incidence in zebrafish [Cell Biology]", "description": "Cancer incidence increases exponentially with age when human telomeres are shorter. Similarly, telomerase reverse transcriptase (tert) mutant zebrafish have premature short telomeres and anticipate cancer incidence to younger ages. However, because short telo…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/NYa4gEzTiWs/15066.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "An–Chih Yang, Teȷ Choksi, Verena Streibel, Hassan Alȷama, Cody J. Wrasman, Luke T. Roling, Emmett D. Goodman, Dionne Thomas, Simon R. Bare, Roel S. Sanchez–Carrera, Ansgar Schafer, Yueȷin Li, Frank Abild–Pedersen, Matteo Cargnello", "title": "Revealing the structure of a catalytic combustion active-site ensemble combining uniform nanocrystal catalysts and theory insights [Chemistry]", "description": "Supported metal catalysts are extensively used in industrial and environmental applications. To improve their performance, it is crucial to identify the most active sites. This identification is, however, made challenging by the presence of a large number of …", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/O_u7Kmu5ec8/14721.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "David E. Buchholz, Thomas S. Carroll, Arif Kocabas, Xiaodong Zhu, Hourinaz Behesti, Phyllis L. Faust, Lauren Stalbow, Yin Fang, Mary E. Hatten", "title": "Novel genetic features of human and mouse Purkinje cell differentiation defined by comparative transcriptomics [Developmental Biology]", "description": "Comparative transcriptomics between differentiating human pluripotent stem cells (hPSCs) and developing mouse neurons offers a powerful approach to compare genetic and epigenetic pathways in human and mouse neurons. To analyze human Purkinje cell (PC) differe…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/a2JGsqcqBlg/15085.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Ayal B. Gussow, Noam Auslander, Guilhem Faure, Yuri I. Wolf, Feng Zhang, Eugene V. Koonin", "title": "Genomic determinants of pathogenicity in SARS-CoV-2 and other human coronaviruses [Microbiology]", "description": "Severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) poses an immediate, major threat to public health across the globe. Here we report an in-depth molecular analysis to reconstruct the evolutionary origins of the enhanced pathogenicity of SARS-CoV-2 …", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/OusudhNrCNI/15193.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Denis Archakov, Iain DeWitt, Paweł Kuśmierek, Michael Ortiz–Rios, Daniel Cameron, Ding Cui, Elyse L. Morin, John W. VanMeter, Mikko Sams, Iiro P. Jaaskelainen, Josef P. Rauschecker", "title": "Auditory representation of learned sound sequences in motor regions of the macaque brain [Neuroscience]", "description": "Human speech production requires the ability to couple motor actions with their auditory consequences. Nonhuman primates might not have speech because they lack this ability. To address this question, we trained macaques to perform an auditory–motor task prod…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/3DWvFJPrm2E/15242.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Vivek J. Srinivasan, Ala Moshiri", "title": "Imaging oxygenation of retinal capillaries with depth resolution [Medical Sciences]", "description": "The inner retina has a three-tiered vascular supply, with capillary beds stratifying in the nerve fiber layer/ganglion cell layer, the inner plexiform layer, and the outer plexiform layer (1). While this trilaminar architecture likely functions to serve the m…", "url": "http://feedproxy.google.com/~r/pnas/SMZM/~3/BwHTqdOmJOw/14626.short", "urlToImage": null, "publishedAt": "2020-06-30T17:11:53Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "MagicDraw UML 19.0 SP4 - Visual UML modeling and CASE tool with teamwork support (beta). (Demo)", "description": "MagicDraw is a visual UML modeling and CASE tool with teamwork support. Designed for business analysts, software analysts, programmers, qa engineers, and documentation writers, this dynamic and versatile development tool facilitates analysis and design of Obj…", "url": "http://feedproxy.google.com/~r/macupdate/~3/9PtIJ18Ruwo/1593536962", "urlToImage": null, "publishedAt": "2020-06-30T17:09:22Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Julia", "title": "Things to Consider When Choosing a Hardwood Floor", "description": "Hardwood floors are often referred to as the “gold standard” of flooring. They are timeless, durable, and hypoallergenic. Wood floors last a lifetime and can even raise your home’s value in the long run. Choosing the hardwood flooring that fits you and your h…", "url": "http://feedproxy.google.com/~r/KnockOffDecor/~3/8C-VV-fhGzU/", "urlToImage": null, "publishedAt": "2020-06-30T17:07:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Meghan Splawn", "title": "This Backyard Picnic Snack Board Is Filled with Hot Dogs and Rice Krispies Treats", "description": "Serve it to celebrate the start of summer, the Fourth of July, or just a really good Tuesday night. \nREAD MORE...", "url": "http://feedproxy.google.com/~r/apartmenttherapy/thekitchn/~3/Z5JSZTKHEos/family-snack-board-hot-dogs-23046166", "urlToImage": null, "publishedAt": "2020-06-30T17:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Ring 2.6.1 - Monitor your front door. (Shareware)", "description": "Ring allows you to monitor your home from your smartphone, tablet or PC. Every Ring device features a wide-angle lens and a built-in microphone and speaker, so you can see, hear and speak to anyone on your property from anywhere. \n\nRing’s customizable motion …", "url": "http://feedproxy.google.com/~r/macupdate/~3/-b4LjEvzAt0/1593536256", "urlToImage": null, "publishedAt": "2020-06-30T16:57:36Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "news+feed@crunchyroll.com", "title": "Kyoto Animation Films to Headline TOHO Cinema Ikebukuro's Opening Week", "description": "TOHO Cinema Ikebukuro opens its doors on July 3 with an Evangelion collaborationWith many new films not opening for a few more weeks, TOHO Cinemas announced today that it's opening week will b populated by anime films from Kyoto Animation, starting with the M…", "url": "http://feedproxy.google.com/~r/crunchyroll/animenews/~3/GlDkSKMAK2Y/kyoto-animation-films-to-headline-toho-cinema-ikebukuros-opening-week", "urlToImage": null, "publishedAt": "2020-06-30T16:54:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Rain Noe", "title": "The Design Evolution of the Air Conditioner, Part 2", "description": "As we saw in Part 1, the earliest domestic air conditioners (like the one above) were upright-piano-sized console units putting out up to 24,000 BTUs. But in the mid-1930s, some companies figured that smaller, more manageable air conditioners in the 3,500-7,0…", "url": "http://feedproxy.google.com/~r/core77/blog/~3/1PzIFwQm-F0/The-Design-Evolution-of-the-Air-Conditioner-Part%09-2", "urlToImage": null, "publishedAt": "2020-06-30T16:38:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Julia", "title": "Bedroom Storage Solutions When You Need Space", "description": "Seeking an answer to living comfortably while stuck with a small bedroom? The answer lies in finding the right storage solutions that can help. Understanding how you can maximize space without having to compromise on your bedroom decor might seem tricky initi…", "url": "http://feedproxy.google.com/~r/KnockOffDecor/~3/m258yVKwClg/", "urlToImage": null, "publishedAt": "2020-06-30T16:37:45Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "podcast@cnet.com (CNET.com), CNET", "title": "What's new to stream for July 2020", "description": "Hamilton makes its streaming debut on Disney Plus, while Netflix gets some strong additions to its streaming empire.", "url": "http://feedproxy.google.com/~r/allcnetvideopodcasts/~3/n87ejhq1kGY/Netpicks_July_2020_374642_740.mp4", "urlToImage": null, "publishedAt": "2020-06-30T16:20:47Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "feedback@businessinsider.com (Carmen Reinicke), Carmen Reinicke", "title": "Goldman Sachs says national mask mandate could save US from a 5% hit to GDP", "description": "REUTERS/Caitlin Ochs\n<ul>\n<li>A national mask mandate could potentially substitute for lockdowns to curb the spread of coronavirus, Goldman Sachs Chief Economist Jan Hatzius wrote in a Monday note. </li>\n<li>Goldman's baseline estimate is that a national mand…", "url": "http://feedproxy.google.com/~r/businessinsider/~3/fhZrTJPDOCA/goldman-sachs-national-mask-mandate-save-gdp-hit-economic-impact-2020-6", "urlToImage": null, "publishedAt": "2020-06-30T16:13:25Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Bitnami DreamFactory 4.3.0-0 - API management gateway. (Free)", "description": "DreamFactory is an API management gateway. It’s capable of generating powerful, documented APIs for almost twenty databases including Microsoft SQL Server, in addition to file storage, caching, e-mail, 3rd party APIs and SOAP services. \n\nThe scripting interfa…", "url": "http://feedproxy.google.com/~r/macupdate/~3/qXbDQyBkDko/1593533572", "urlToImage": null, "publishedAt": "2020-06-30T16:12:52Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "news+feed@crunchyroll.com", "title": "Ghibli's Porco Rosso Voted Best Award-Winning Film in Annecy History", "description": "32 percent of voters chose Miyazaki's classic over the other acclaimed featuresTo celebrate the the 60th anniversary of the awards, Annecy asked the Internet to vote on which Cristal winner is the best film in Annecy history. Find out which films came out on …", "url": "http://feedproxy.google.com/~r/crunchyroll/animenews/~3/N_ank6G3QYQ/ghiblis-porco-rosso-voted-best-award-winning-film-in-annecy-history", "urlToImage": null, "publishedAt": "2020-06-30T16:08:43Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 18 - Cosplay! Shigeo Komata", "description": "A cosplaying man named Shigeo Komata, his clothes are ragged and he has a crew cut like someone out of a video game. Though he based his attacks on a video game character, his power is not to be taken lightly! For this reason, he is number six in the Fukamich…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/Cv6wthX0UII/media-795813", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 25 - Break! Konishi vs. Julietta", "description": "\"I will defeat you. I will become a perfect dazzling star in the night sky tonight!\" declares Konishi. While standing up to Julietta's random power, Konishi keeps telling himself to remain cool. Konishi breaks Julietta's right leg with his left arm! You can h…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/wTGxMB0k8FM/media-795827", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 27 - Final Episode Fly! Maki Aikawa", "description": "\"Win, Maki.\" Maki Aikawa tosses her body away during the fight and realizes the true essence of fighting. She thinks. She searches. That is why she's so strong when at full power. Her opponents all know this well. The people she encounters all experiences thi…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/_qOMb8gIxic/media-795832", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 10 - Blaze! Kinjiro Kitaeda", "description": "Although the kidnapped Mina was rescued from the hands of the Black Alliance, Tsukio, Reiichi, and Shinnosuke are soon overwhelmed by the growing number of the Black Alliance. Tsukio realizes that they would soon be annihilated and orders Shinnosuke and Reiic…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/1Oqb5KlS-zA/media-795797", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 16 - Fight! Fukamichi Ranking", "description": "A mysterious man calling himself Fukamichi suddenly appears in front of Tsukio and Reiichi asking them to join the Fukamichi Ranking. Tsukio is annoyed at his attitude but invites Lucha Master to take his place. Right when they think the fight is about to sta…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/wPe1kcD8L-8/media-795809", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 1 - Fly! Air Master", "description": "Maki Aikawa is tall, with a nice model-like figure, but is also quiet and looks like an ordinary high school girl. However, her unique life style includes being a street fighter within the dark alleyways and back streets of Tokyo. To date, she remains undefea…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/QnrhGqtjC-U/media-795780", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 8 - Resound! Mina Nakanotani", "description": "The beach! Maki, Mina, Yuu, Michiru, and Renge had come to hang out and sun bathe together. Of course, Mina and her unbelievable breasts stood out conspicuously to attract the attention of anyone who passed by.While at the beach, Renge decided to enter Mina i…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/qjiyMEEGgmI/media-795793", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 11 - Beat it in! Maki Vs. Kinjiro", "description": "Maki's anger erupted into a violent rage when she saw Mina! After defeating several of the Black Alliance members, Maki is challenged to a fight by their leader, Kinjiro, who is also known as \"Kin-chan.\" As Maki and Kinjiro prepare to battle drawing closer to…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/iiL6gh1oUXo/media-795799", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Welcome to the JAPARI PARK - Episode 30 - Untitled", "description": "", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/FTtmZHM1lNo/media-796078", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 6 - Ride it! Maki", "description": "Maki's involuntary encounter with Julietta Sakamoto left her confused. She spaces out and decided not to go to school because something still doesn't feel right. She wants the challenge of battle but knows it is not possible. Mina begins to worry about Maki w…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/Z8jrHwvizqo/media-795789", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 12 - Make Yourself Known! Fami-Wrestlers", "description": "Kaori Sakiyama continues to knock down her opponents one after another when street fighting. Impressed by Sakiyama's sense of fighting, Tomiko, a professional woman wrestler asks her to join a wresting tag team called Fami-Wrestlers. During there conversation…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/XkFxraZH3KA/media-795801", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 5 - Sing! Julietta Sakamoto", "description": "Maki is confronted by a man named Julietta Sakamoto who Tsukio knows and calls a strong man. Approaching Maki, he begins to whisper words of love into her ear and gently kisses her hand. Maki is quite surprised while her friends Yuu and Michiru drop their jaw…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/mkK4xQuIaeo/media-795786", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 14 - Fly Through! Kai and Maki!", "description": "Air Master vs. Sky Star, the mid-air battle extravaganza has finally begun! But Kai is a cut above Maki when it comes to the ring. Maki is about to collapse! But then, Sakiyama yells from ringside, \"What the hell are you doing in there?!\" But then Maki is sma…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/TFMIjEDFWjE/media-795805", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 15 - Conquer! Empress Cockroach", "description": "After the pro wrestling event, everyone slowly starts to change. Shinnosuke makes a resolution in his heart and leaves on a solitary voyage. Maki, on the other hand, is rendered completely dumb after the match. She isn't giving off the same aura she had while…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/DcmFj2U_-hY/media-795807", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 19 - Lurk in the Shadows! Koji Ogata", "description": "Maki and Kai will have real Fukamichi Ranking battles. Fukamichi gives them both locators to find the other person, to be worn on their wrists. Though it's an incredible device to help you locate your opponent, Maki can't figure out how to work it at all! Fuk…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/KQmNkRbdndU/media-795815", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 22 - Launch it! The Flame Fighter", "description": "Deciding to follow the invitation of Shizuna, who said she could fix his arm, Kinjiro follows her to a mysterious basement and passes out. The pain and fatigue had pushed him to his limits. Shortly afterward, when he awakes, he feels that his pain threshold h…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/RZwyjK9zI2Y/media-795821", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 3 - Challenge! Shinnosuke Tokita", "description": "Yuu, Michiru, Mina, Renge, and Maki went to Shibuya. When on the street, a young man named Shinnosuke Tokita whose goal was to beat the Air Master, presented his challenge. This man who challenged Maki carried a Sansetsukon, a deadly weapon that he had traine…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/K2lQIqukq-U/media-795782", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 26 - Feel it! The Wind of the Fight", "description": "A few days after being completely defeated by the woman, Yuki Minaguchi, Kinjiro Kitaeda puts on a new Shizuna-man outfit dubbed Shizuna-man Version 2. But once Nagato saw him in that armor, the atmosphere suddenly changes. He doesn't seem like the normal, pa…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/XpK2JNslWN4/media-795830", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 2 - Howl! Kaori Sakiyama", "description": "From the scene that took place the other day, several girls (also known as a ko-gal group) immediately began to voice their acceptance in having Maki join their circle of friends. The group include Yuu, Michiru, Mina, and Renge. Maki was nicknamed Maki-chan.T…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/8NCqScMKD3U/media-795781", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 4 - Stand out! Tsukio and Reiichi", "description": "After battling together, Shinnosuke was so impressed with Maki's abilities, he decided that he too wants to become a street fighter. Mina senses Shinnosuke's feeling toward Maki and becomes jealous.During that night, the fighters of Shibuya were surprised at …", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/tGJgkkKWHe0/media-795784", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 9 - Go! Black Alliance of Justice and Sincerity", "description": "A group of high school students in their school uniforms came to Tokyo on a field trip. They call themselves the \"Black Alliance of Justice and Sincerity\". While the Black Alliance enjoy fighting, they also have aspiration of becoming Japan's number one fight…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/F-Lro5a5GFo/media-795795", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 13 - Sparkle! Sky Star", "description": "An out-of-this-world tag team is born! And they're called the Fami-Wrestlers! Ignoring the matches listed on the card, this duo starts attacking one team after another! Kaori Sakiyama grabs a mic in the stunned crowd and gives an all-out performance! Feeling …", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/RbATinjLiVk/media-795803", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 17 - Gather Round! Street Fighters", "description": "Maki's strength is fully tested by the Fukamichi Ranking. Maki easily defeats the 17th ranked fighter but waiting at the side is a dangerous looking fighter, her opponent. He says \"Welcome to the Sniper Karate course.\" There is also a man who has come to Toky…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/zlP6E3nXSCA/media-795811", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 20 - Strike! Kai vs. Kinjiro", "description": "Kai is walking along a large road following the locator that Fukamichi gave to her. Slowly but surely, she approaches her opponent. Miori is alongside and her and is completely emotionally attacked to Kai. Her opponent happens to be Kinjiro Kitaeda, or Kin-ch…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/rrgmAPhuOLU/media-795818", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 21 - Make Him Talk! Fukamichi (Little Brother)", "description": "The man who appeared in front of Julietta was the younger brother of the ringleader of the Ranking's younger brother, Fukamichi. Nobuhiko challenges Julietta to a fight. He thought Julietta Sakamoto would be unable to fight and he mistakenly feels happy. Fuka…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/ttvagQ7goic/media-795819", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 24 - Grill it! Meat", "description": "It's been ten days since the showdown between Maki and Yuki Minaguchi. Maki has been out of it, not sure if she feels good or bad. At Maki's father, Saeki Shiro's dojo, a man calling himself Konishi shows up. He says he won't use his bat and challenges Saeki.…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/_ug8zCDJg3U/media-795825", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 7 - I Won't Let Me Say That Again!!", "description": "Maki challenges Julietta to a fight. The appointed time is three o'clock and that's when she wakes up. \"I overslept!\" said Maki. However, the man who arrived at the appointed place on time was Maki's father, \"Shiro Saeki\". Without Maki's presence, Shiro chall…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/v2gu1NUzt3g/media-795791", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Air Master - Episode 23 - Slash Through! Yuki Minaguchi", "description": "Kin-chan loses to Yuki Minaguchi. His right arm is back to full function but he's overwhelmed by Yuki's strength. Her next opponent is the Air Master. All the Fukamichi Ranking fans across the country have been awaiting this battle as the fight begins in earn…", "url": "http://feedproxy.google.com/~r/crunchyroll/rss/anime/~3/lUkx3jgyOTQ/media-795823", "urlToImage": null, "publishedAt": "2020-06-30T16:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Avocode 4.7.3 - Build web, iOS and Android apps exactly as they were designed. (Shareware)", "description": "Avocode is designed to help you inspect Photoshop and Sketch projects and export any of the included elements with minimal effort. Moreover, the graphic objects will be uploaded to the Avocode cloud, and you get to share them publicly or with your team member…", "url": "http://feedproxy.google.com/~r/macupdate/~3/wgyXAh07pvw/1593532762", "urlToImage": null, "publishedAt": "2020-06-30T15:59:22Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "RsyncOSX 6.3.5 - GUI for rsync. (Free)", "description": "RsyncOSX is a GUI frontend for the rsync command-line tool \n\nBefore installing and using RsyncOSX there are some important information to read and understand. The first document is how to get and install RsyncOSX. The second document is some information what …", "url": "http://feedproxy.google.com/~r/macupdate/~3/qq0jhG83Hu4/1593532617", "urlToImage": null, "publishedAt": "2020-06-30T15:56:57Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Movavi Photo Editor 6.6.0 - Image editor. (Demo)", "description": "Movavi Photo Editor provides standard editing features in a user-friendly environment. Perform simple operations like cropping, rotating and resizing images as well as advanced tools like removing backgrounds and fine-tuning skin adjustments. \n\nFeatures: \n<ul…", "url": "http://feedproxy.google.com/~r/macupdate/~3/dK0o9F4OhwU/1593532539", "urlToImage": null, "publishedAt": "2020-06-30T15:55:39Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "MacX DVD Ripper Pro 6.5.3 - Copy DVDs to digital, single-file format. (Shareware)", "description": "MacX DVD Ripper Pro is an ultimate Mac DVD ripper to backup & rip your DVDs on Mac with the final video and audio file in all sorts of formats, including DVD to MP4, H.264, MOV, M4V, FLV, MPEG4, AVI, QT, MP3, etc. With 350+ preset profiles, MacX DVD Ripper Pr…", "url": "http://feedproxy.google.com/~r/macupdate/~3/PbZlhIvI1Ww/1593532413", "urlToImage": null, "publishedAt": "2020-06-30T15:53:33Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "podcast@cnet.com (CNET.com), CNET", "title": "The 2021 Bentley Bentayga only has a few changes, but they're all in the right places", "description": "With a lot of new competition on the scene Bentley has made some tweaks to keep the Bentayga ahead of the game.", "url": "http://feedproxy.google.com/~r/allcnetvideopodcasts/~3/xsFU4E3dkaA/CF_Bentley_Bentayga_2020_Site_374605_740.mp4", "urlToImage": null, "publishedAt": "2020-06-30T15:52:37Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Agena 2.21.3 - Procedural programming language. (Free)", "description": "Agena is an easy-to-learn procedural programming language suited to be used in scientific, educational, linguistic, and many other applications, including scripting.Version 2.21.3: \n<ul>\n<li>The new `?-` token checks an expression and executes a one-line stat…", "url": "http://feedproxy.google.com/~r/macupdate/~3/te3oyA_X1MI/1593532265", "urlToImage": null, "publishedAt": "2020-06-30T15:51:05Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Snagit 2020.1.5 - Screen capture utility. (Shareware)", "description": "Snagit lets you create an image of what you see on your computer monitor. \n\nFeatures \n<ul> \n<li>Flexible options that let you capture only what you want.</li> \n<li>Annotation varieties like arrows, speech bubbles, and more make it easy to customize your captu…", "url": "http://feedproxy.google.com/~r/macupdate/~3/3cuPoSQtMQw/1593532191", "urlToImage": null, "publishedAt": "2020-06-30T15:49:51Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Camtasia 2020.0.5 - Powerful screen recording and production tool. (Shareware)", "description": "Camtasia for remarkable screencasts made easy. Create eye-catching training, presentation, and demo videos…the easy way. Camtasia screen-recording software is streamlined, intuitive, and makes you look like a pro. \n\n Easily record onscreen activity, Keynote s…", "url": "http://feedproxy.google.com/~r/macupdate/~3/JzIhsZmCNhg/1593532060", "urlToImage": null, "publishedAt": "2020-06-30T15:47:40Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Saloni Sardana", "title": "Amateur investors speculating on stocks have pushed markets skywards, but angered some of investing's biggest names. Here's what they have to say about the day-trading boom.", "description": "<ul>\n<li>Stocks have rallied sharply in recent months, thanks in part to a boom in day-traders, who invest in the markets for fun, rather than professionally.</li>\n<li>Dave Portnoy, founder of Barstool sports turned investor has become the poster-child of day…", "url": "http://feedproxy.google.com/~r/TheMoneyGame/~3/bJIbs2NleZc/day-trading-boom-angers-serious-investors-best-quotes-by-billionaires-amateur-investors-speculating-on-stocks-have-pushed-markets-skywards-but-angered-some-of-investing-s-biggest-names-here-s-what-they-have-to-say-about-the-day-trading-boom-1029355205", "urlToImage": null, "publishedAt": "2020-06-30T15:47:17Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "feedback@businessinsider.com (Saloni Sardana), Saloni Sardana", "title": "Amateur investors speculating on stocks have pushed markets skywards, but angered some of investing's biggest names. Here's what they have to say about the day-trading boom.", "description": "Getty Images; Getty Images\n<ul>\n<li>Stocks have rallied sharply in recent months, thanks in part to a boom in day-traders, who invest in the markets for fun, rather than professionally.</li>\n<li>Dave Portnoy, founder of Barstool sports turned investor has bec…", "url": "http://feedproxy.google.com/~r/businessinsider/~3/bhtkv3FVlrI/day-trading-boom-the-best-quotes-from-billionaires-2020-6", "urlToImage": null, "publishedAt": "2020-06-30T15:47:17Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "feedback@businessinsider.com (Saloni Sardana), Saloni Sardana", "title": "Amateur investors speculating on stocks have pushed markets skywards, but angered some of investing's biggest names. Here's what they have to say about the day-trading boom.", "description": "Getty Images; Getty Images\n<ul>\n<li>Stocks have rallied sharply in recent months, thanks in part to a boom in day-traders, who invest in the markets for fun, rather than professionally.</li>\n<li>Dave Portnoy, founder of Barstool sports turned investor has bec…", "url": "http://feedproxy.google.com/~r/businessinsider/~3/bJIbs2NleZc/day-trading-boom-angers-serious-investors-best-quotes-by-billionaires-amateur-investors-speculating-on-stocks-have-pushed-markets-skywards-but-angered-some-of-investing-s-biggest-names-here-s-what-they-have-to-say-about-the-day-trading-boom-1029355205", "urlToImage": null, "publishedAt": "2020-06-30T15:47:17Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Simplenote 1.11 - Note-keeping app that syncs with all your devices. (Free)", "description": "Simplenote is a streamlined note-keeping app that syncs with all your devices for free. \n\nAs your collection of notes grows, you can search them instantly and keep them organized with tags and pins. You can also share notes and publish them for other people.V…", "url": "http://feedproxy.google.com/~r/macupdate/~3/Py_YUGxWFYE/1593531771", "urlToImage": null, "publishedAt": "2020-06-30T15:42:51Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Acana My Books 2.0.1 - Manage your books, audio books, and audio cassettes. (Commercial)", "description": "Acana My Books manages your books, audio books, audio cassettes, comic collections and journals. For each entry a note and unlimited attachments can be added. \n\nFeatures \n<ul> \n<li>Enter all data Details Title</li> \n<li>Author</li> \n<li>Co-Author</li> \n<li>Sp…", "url": "http://feedproxy.google.com/~r/macupdate/~3/GvDl1CKF84s/1593531524", "urlToImage": null, "publishedAt": "2020-06-30T15:38:44Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "File Cabinet Lite 7.9.5 - File management application (was File Cabinet). (Free)", "description": "File Cabinet Lite (was File Cabinet) is the lite version of File Cabinet Pro, the file manager for the macOS menu bar. With File Cabinet Lite you can view files directly from the menubar. File Cabinet Lite is also a document-based application that ships with …", "url": "http://feedproxy.google.com/~r/macupdate/~3/1pX7TSuBcWw/1593531385", "urlToImage": null, "publishedAt": "2020-06-30T15:36:25Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Downcast 2.9.51 - Download, play, and sync your podcasts. (Commercial)", "description": "Downcast lets you download, play, and sync** your favorite podcasts with an intuitive interface built specifically for podcasts. \n\nSubscription Features \n<ul> \n<li>Search, subscribe to, and download audio and video podcasts</li> \n<li>Manually subscribe to pod…", "url": "http://feedproxy.google.com/~r/macupdate/~3/xG3W7V9lTSo/1593531282", "urlToImage": null, "publishedAt": "2020-06-30T15:34:42Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "DiabetesPal 6.2 - Diabetes management software. (Free)", "description": "DiabetesPal is diabetes-management software. There is also a companion iOS app on the iTunes Store. This is the first diabetes software that syncs your data using iCloud! So your data is accessible on all your devices. Use the iOS app to input the data during…", "url": "http://feedproxy.google.com/~r/macupdate/~3/ErCMm7a-HGo/1593529218", "urlToImage": null, "publishedAt": "2020-06-30T15:00:18Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "news+feed@crunchyroll.com", "title": "Anime vs. Real Life: The Many Dark Alleys of SING \"YESTERDAY\" FOR ME", "description": "Check out more of the real-world locations of SING \"YESTERDAY\" FOR MEIn this installment of Anime vs. Real Life, check out almost 50 real-life comparison images from Doga Kobo’s superb character drama, SING \"YESTERDAY\" FOR ME’. From all of the show’s long and…", "url": "http://feedproxy.google.com/~r/crunchyroll/animenews/~3/YSuKnMWsXOs/anime-vs-real-life-the-many-dark-alleys-of-sing-yesterday-for-me", "urlToImage": null, "publishedAt": "2020-06-30T15:00:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "JustPlay 1.6 - Media player that will play any video on Mac. (Commercial)", "description": "JustPlay is a simple media player that will just play any video or audio file you have. It supports MP4, AVI, MOV, SWF, DAT, MKV, MP3, FLAC, M4V, FLV, Blu-ray, etc. You won't need additional codecs or plugins - this tiny player actually comes packed with all …", "url": "http://feedproxy.google.com/~r/macupdate/~3/kEN6irw30lU/1593528822", "urlToImage": null, "publishedAt": "2020-06-30T14:53:42Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "As Biden expands lead, Dems can't shake November nightmare...", "description": "As Biden expands lead, Dems can't shake November nightmare...\r\n\n \n \n \n (Third column, 9th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:BIDEN: TRUMP SURRENDERED TO VIRUS...\r\nPLAYS VICTIM...\r\nPresident dismisses covid, polls, recession to tell winning story...\r\nBu…", "url": "http://feedproxy.google.com/~r/DrudgeReportFeed/~3/W3Ton_LlKvI/article243827732.html", "urlToImage": null, "publishedAt": "2020-06-30T14:49:39Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "news+feed@crunchyroll.com", "title": "Fire Force Company 8 Tees up for a Fiery Collaboration With Japanese Baseball Teams", "description": "The second season of Fire Force is scheduled to broadcast from July 3Ahead of Fire Force Season 2 burning up screens across the world, the 8th Special Fire Force Company is hitting the big leagues and teaming up with the Japanese Baseball Pacific League to hi…", "url": "http://feedproxy.google.com/~r/crunchyroll/animenews/~3/VbFjEAlh9V0/fire-force-company-8-tees-up-for-a-fiery-collaboration-with-japanese-baseball", "urlToImage": null, "publishedAt": "2020-06-30T14:47:37Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Dow Jones Falls 100 Points In Coronavirus Stock Market Rally; Boeing Dives 7% - Investor's Business Daily", "description": "<ol><li>Dow Jones Falls 100 Points In Coronavirus Stock Market Rally; Boeing Dives 7%  Investor's Business Daily\r\n</li><li>Wall Street ends higher on Boeing bump, stimulus eyed  Reuters\r\n</li><li>Dow surges thanks to Boeing and strong home sales  CNN\r\n</li><l…", "url": "https://news.google.com/__i/rss/rd/articles/CBMifGh0dHBzOi8vd3d3LmludmVzdG9ycy5jb20vbWFya2V0LXRyZW5kL3N0b2NrLW1hcmtldC10b2RheS9kb3ctam9uZXMtY29yb25hdmlydXMtc3RvY2stbWFya2V0LXJhbGx5LWx1bHVsZW1vbi1taWNyb24tbmV0ZmxpeC_SAQA?oc=5", "urlToImage": null, "publishedAt": "2020-06-30T14:39:01Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Carmen Reinicke", "title": "A Wall Street chief strategist says US stocks have 'considerable upside' from current levels — and could climb as much as 20% in a best-case scenario", "description": "<ul>\n<li>Stocks have upside from current levels even given the size and scope of the market rally from March lows, according to Leuthold Group. </li>\n<li>\"If a new bull market has begun, despite the size and speed of this year's rally, there is still favorabl…", "url": "http://feedproxy.google.com/~r/clusterstock/~3/fo-exEqJvaI/a-wall-street-chief-strategist-says-us-stocks-have-considerable-upside-from-current-levels-and-could-climb-as-much-as-20-in-a-best-case-scenario-1029354809", "urlToImage": null, "publishedAt": "2020-06-30T14:18:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "snagarajan@businessinsider.com (Shalini Nagarajan), Shalini Nagarajan", "title": "Wirecard stock jumps as much as 160% after a UK regulator eased restrictions on one of its key businesses", "description": "REUTERS\n<ul>\n<li>Wirecard shares jumped as much as 160% on Tuesday as it continues to rebound from lows seen last week.</li>\n<li>The fintech group's stock jump was likely propelled by UK's financial authority lifting restrictions on one of its subsidiaries.</…", "url": "http://feedproxy.google.com/~r/businessinsider/~3/EBPShRKHglE/wirecard-stock-price-uk-fca-eases-restrictions-2020-6-1029354603", "urlToImage": null, "publishedAt": "2020-06-30T13:58:19Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "FET 5.45.1 - Automatic school scheduling. (Shareware)", "description": "FET is open source free software for automatically scheduling the timetable of a school, high-school or university. It uses a fast and efficient timetabling algorithm. It is licensed under the GNU Affero General Public License version 3 or later. \n\nFET is abl…", "url": "http://feedproxy.google.com/~r/macupdate/education/~3/yD1jP5f5yPE/1593524505", "urlToImage": null, "publishedAt": "2020-06-30T13:41:45Z", "content": null}]}