{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Heraldsun.com.au"}, "author": null, "title": "The best Aussie singers of all time - Herald Sun", "description": "Subscribe to the Herald Sun to get unrestricted digital access, home paper delivery, Foxsports.com.au subscription,  Apps for iPad and Android and much more...", "url": "https://www.heraldsun.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-26T04:37:06Z", "content": null}, {"source": {"id": null, "name": "Thewest.com.au"}, "author": "Peter Law", "title": "Coronavirus crisis: WA to 'cautiously' relax COVID-19 restrictions, allow 10-person gatherings - The West Australian", "description": "Premier Mark McGowan has announced a relaxation of the two-person limit on outdoor gatherings after no new cases were reported in WA overnight.", "url": "https://thewest.com.au/news/coronavirus/coronavirus-crisis-wa-to-cautiously-relax-covid-19-restrictions-allow-10-person-gatherings-ng-b881530318z", "urlToImage": null, "publishedAt": "2020-04-26T04:36:05Z", "content": "Premier Mark McGowan has announced a relaxation of the two-person limit on outdoor gatherings.\r\nFrom Monday, indoor and outdoor non work gatherings will be relaxed to 10 people, Mr McGowan said.\r\nThe number of people allowed at weddings has increased to 10, t… [+1451 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Coronavirus update: Global death toll reaches 200,000, NY Governor announces testing expansion - ABC News", "description": "China records zero COVID-19-related deaths for the 11th straight day, as hundreds of cities report an improvement in air quality.", "url": "https://www.abc.net.au/news/2020-04-26/coronavirus-update-australia-covid19-april-26-death-toll-200000/12185414", "urlToImage": null, "publishedAt": "2020-04-26T04:22:20Z", "content": "Updated \r\nApril 26, 2020 14:38:15\r\nHundreds of cities across mainland China have recorded improvements in air quality during the coronavirus outbreak, as the country reports no COVID-19-related deaths for the 11th day in a row.\r\nElsewhere, some countries have… [+14355 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Australian Associated Press And Jackson Barron For Daily Mail Australia", "title": "Coronavirus restrictions will be eased in Queensland on Friday to allow some recreational activities - Daily Mail", "description": "Queenslanders will be able to go for a drive, ride a motorbike, jetski or boat for recreation, have a picnic, visit a national park and shop for non-essential items from midnight on Friday.", "url": "https://www.dailymail.co.uk/news/article-8257705/Coronavirus-restrictions-eased-Queensland-Friday-allow-recreational-activities.html", "urlToImage": null, "publishedAt": "2020-04-26T04:17:14Z", "content": "Queensland will be the first Australian state to ease strict lockdown conditions as the country's effort to flatten the coronavirus curve begins to get results. \r\nState Premier Annastacia Palaszczuk announced that Queenslanders will finally be freed to go for… [+10496 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Study finds 160 ways to protect the Great Barrier Reef - SBS News", "description": "From cloud brightening to heat-tolerant corals, a study has identified 160 possible interventions that could help protect the Great Barrier Reef.", "url": "https://www.sbs.com.au/news/study-finds-160-ways-to-protect-the-great-barrier-reef", "urlToImage": null, "publishedAt": "2020-04-26T04:15:48Z", "content": "Scientists recently confirmed the Great Barrier Reef suffered another serious bleaching event last summer - the third in five years. Dramatic intervention to save the natural wonder is clearly needed.\r\nFirst and foremost, this requires global greenhouse gas e… [+7754 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": "James O’Doherty and Janet Fife-Yeomans", "title": "Female doctor at Nepean Hospital contracts COVID-19, as the NSW death toll rises to 36 - Daily Telegraph", "description": "A female doctor working at Nepean Hospital has tested positive to COVID-19 but had not been working with patients in the 48 hours before she started showing symptoms, NSW Health Minister Brad Hazzard has confirmed.", "url": "https://www.dailytelegraph.com.au/coronavirus/coronavirus-nsw-death-toll-rises-as-6th-newmarch-house-resident-dies/news-story/07f1c630b3cd54b38fa8b3fc2bda67e9", "urlToImage": null, "publishedAt": "2020-04-26T04:06:02Z", "content": "A female doctor working at Nepean Hospital has tested positive to COVID-19 but had not been working with patients in the 48 hours before she started showing symptoms, NSW Health Minister Brad Hazzard has confirmed.\r\nShe also worked at Sydney Adventist Hospita… [+4238 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Latika Bourke, Harriet Alexander, Carrie Fellner", "title": "Coronavirus updates LIVE: Global COVID-19 cases surpass 2.8 million as Australia's death toll stands at 81 - The Sydney Morning Herald", "description": "If you suspect you or a family member has coronavirus you should call (not visit) your GP or ring the national Coronavirus Health Information Hotline on 1800 020 080.", "url": "https://www.smh.com.au/national/coronavirus-updates-live-global-covid-19-cases-surpass-2-8-million-trump-suggests-dettol-as-treatment-as-australia-s-death-toll-stands-at-81-20200425-p54n8c.html", "urlToImage": null, "publishedAt": "2020-04-26T03:58:00Z", "content": "NSW Department of Education Secretary Mark Scott told this afternoon's press conference that the plan was for a staged return to school. Schools would be open for the start of term two, but the plan was to have all students attending at last one day per week … [+1203 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Anthony Galloway", "title": "Australian intelligence officials treating reports of Kim Jong-un's ill health seriously - Sydney Morning Herald", "description": "Australian intelligence officials are treating reports of North Korea's leader Kim Jong-un ill health seriously, with concerns about the upheaval that would be created by a change of leader in the secretive and authoritarian state.", "url": "https://www.smh.com.au/world/asia/australian-intelligence-officials-treating-reports-of-kim-jong-un-s-ill-health-seriously-20200426-p54nbc.html", "urlToImage": null, "publishedAt": "2020-04-26T03:55:29Z", "content": "38North, the Washington think tank, cautioned that the train's presence \"does not prove the whereabouts of the North Korean leader or indicate anything about his health\".\r\n\"But it does lend weight to reports that Kim is staying at an elite area on the country… [+2355 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/kathryn-bermingham/12125068", "title": "High-ranking SA Police officer Joanne Shanahan confirmed as victim of Urrbrae high-speed crash - ABC News", "description": "Chief Superintendent Joanne Shanahan, 55, is confirmed as one of two people killed in a three-car crash in which a ute became airborne and hit a streetlight.", "url": "https://www.abc.net.au/news/2020-04-26/adelaide-fatal-crash-victim-named-as-senior-police-officer/12185932", "urlToImage": null, "publishedAt": "2020-04-26T02:58:10Z", "content": "Updated \r\nApril 26, 2020 13:03:59\r\nOne of the victims of a high-speed crash at Urrbrae, south of Adelaide, has been identified as top-ranking police officer Joanne Shanahan. \r\nKey points:\r\n<ul><li>Detective Chief Inspector Shanahan is survived by her husband … [+3016 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Craig Butt", "title": "Coronovirus updates LIVE: UK's death toll passes 20,000, global cases pass 2.8 million - The Age", "description": "More than 2.8 million people worldwide have tested positive for COVID-19 since the start of the outbreak, and overnight the number of coronavirus deaths in the United Kingdom passed 20,000.", "url": "https://www.theage.com.au/national/victoria/coronavirus-updates-live-uk-s-death-toll-passes-20-000-global-cases-pass-2-8-million-20200426-p54n8f.html", "urlToImage": null, "publishedAt": "2020-04-26T02:34:00Z", "content": "Labors home affairs spokeswoman Kristina Keneally has called for the Morrison government to legislate privacy protections into its new tracing application to fight COVID-19.\r\nThe federal governments app is expected to be launched later on Sunday, which allows… [+777 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/11029686", "title": "The Netherlands will pay reparations to Indonesian victims of colonial atrocities. Could the UK do the same? - ABC News", "description": "Andi Monji's father was one of 200 men to be summarily executed at their village on the island of Sulawesi in January 1947.", "url": "https://www.abc.net.au/news/2020-04-26/netherlands-pay-reparations-indonesia-colonial-violence-1940s/12114892", "urlToImage": null, "publishedAt": "2020-04-26T02:20:38Z", "content": "Posted \r\nApril 26, 2020 08:06:56\r\nAndi Monji was 10 years old when he was forced to watch his father executed in front of him.\r\nThe 83-year-old Indonesian man, who had travelled to The Hague to testify in front of a Dutch court, was last month awarded 10,000 … [+7911 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Karren Brady", "title": "We must not bail OUT firms like Richard Branson’s Virgin Atlantic who didn’t pay IN first - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11480062/bail-out-virgin-atlantic-pay-in/", "urlToImage": null, "publishedAt": "2020-04-26T01:59:10Z", "content": "THE Government shouldnt step in to bail them out. They should let them go bust.\r\nGuess who said that, in 2009, about whether the then Government should intervene to save British Airways?\r\n The idea that the British taxpayer should bail out Virgin Atlantic is … [+10329 chars]"}, {"source": {"id": null, "name": "Hepburnadvocate.com.au"}, "author": "Melbourne", "title": "One new COVID-19 death in Victoria - Hepburn Advocate", "description": "Victoria has recorded one new death from coronavirus overnight on Saturday. Health Minister Jenny Mikakos announced on Sunday a man in his 90s died in hospita...", "url": "https://www.hepburnadvocate.com.au/story/6735329/one-new-covid-19-death-in-victoria/?cs=7", "urlToImage": null, "publishedAt": "2020-04-26T01:56:02Z", "content": "Victoria has recorded one new death from coronavirus overnight on Saturday.\r\nHealth Minister Jenny Mikakos announced on Sunday a man in his 90s died in hospital, bringing the state's total deaths to 17.\r\nThe state's total coronavirus cases now stands at 1349,… [+2250 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/sarah-thomas/11326482, https://www.abc.net.au/news/10768238", "title": "Crowds hit Sydney beaches again, drawing more concerns about coronavirus social distancing - ABC News", "description": "Scenes at Coogee beach in Sydney's east on Sunday mirror that of yesterday, with crowds flocking to the spot despite rules that people can use the beach for exercise only.", "url": "https://www.abc.net.au/news/2020-04-26/crowds-flock-to-sydney-beaches-again-despite-coronavirus-risks/12185926", "urlToImage": null, "publishedAt": "2020-04-26T01:48:47Z", "content": "Posted \r\nApril 26, 2020 11:48:47\r\nCrowds have flocked to Sydney beaches again, raising concerns over safety as Sunday-morning scenes showed a huge volume of people risking social-distancing guidelines.\r\nKey points: \r\n<ul><li>Some beaches in Sydney's east were… [+3262 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Monique Friedlander For Daily Mail Australia", "title": "Cassandra Thorburn hits back after half-sister claims she's 'secretly OBSESSED' with Karl Stefanovic - Daily Mail", "description": "Cassandra Thorburn, 49, has hit back at her estranged half-sister Allegra Bottrell-Thorburn, after she claimed that the journalist has a 'secret obsession' with her ex-husband Karl Stefanovic.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8257357/Cassandra-Thorburn-hits-half-sister-claims-shes-secretly-OBSESSED-Karl-Stefanovic.html", "urlToImage": null, "publishedAt": "2020-04-26T01:44:07Z", "content": "Cassandra Thorburn, 49, has hit back at her estranged half-sister Allegra Bottrell-Thorburn, after she claimed that the journalist has a 'secret obsession' with her ex-husband Karl Stefanovic. \r\nPosting to Instagram on Sunday, Cassandra said Allegra's claims … [+2333 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "James Weir", "title": "Bec Judd's iso fail we can learn from - Northern Star", "description": "James Weir: Celebrity fails we can learn from during coronavirus isolation", "url": "https://www.news.com.au/entertainment/celebrity-life/celebrity-selfies/james-weir-celebrity-fails-we-can-learn-from-during-coronavirus-isolation/news-story/0209bb77e78d95eb48dbb3d3ac51b58b", "urlToImage": null, "publishedAt": "2020-04-26T00:59:00Z", "content": "What kind of a world do we live in where we can’t even trust our favourite rappers to deliver accurate, up-to-the-second analysis of a global health pandemic?\r\nIt’s so hard to know who to trust these days.\r\nA new study has found celebrities like rapper Wiz Kh… [+3598 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Huawei AppGallery: Can it replace the Google Play Store? - Micky News", "description": "With Huawei's P40 and P40 Pro only sporting Huawei Media Suite, can the Huawei AppGallery replace the Google Play Store?", "url": "https://micky.com.au/huawei-app-gallery-can-it-replace-the-google-play-store/", "urlToImage": null, "publishedAt": "2020-04-26T00:48:34Z", "content": "The departure of the Google Play Store on Huawei devices started when the U.S. imposed a trade ban on the Chinese OEM. This means that Huawei may run the Android software, but the Google Media Suite is not allowed.\r\nGmail, YouTube, Google Photos, and many mor… [+4628 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Chinese Government official slams Australia's push for an investigation into the coronavirus outbreak - ABC News", "description": "China has slammed Australia's push for an independent international probe of the coronavirus pandemic describing the move as political manoeuvring", "url": "https://www.abc.net.au/news/2020-04-26/coronavirus-china-slams-australia-over-independent-inquiry/12185988", "urlToImage": null, "publishedAt": "2020-04-26T00:31:45Z", "content": "Updated \r\nApril 26, 2020 10:38:34\r\nChina has criticised Australia's push for an independent international probe of the coronavirus pandemic, describing the move as \"political manoeuvring\". \r\nKey points:\r\n<ul><li>Australia wants an investigation of China's han… [+2797 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/kate-midena/10748890", "title": "Coronavirus restrictions mean celebrities are also turning to cooking. But for some it's nothing new - ABC News", "description": "First isolation restrictions gave us the Quarantini, then we had whipped coffee, and now the internet has gifted us Stanley Tucci making a Negroni.", "url": "https://www.abc.net.au/news/2020-04-26/celebrities-cooking-during-coronavirus-including-stanley-tucci/12176190", "urlToImage": null, "publishedAt": "2020-04-26T00:31:13Z", "content": "Updated \r\nApril 26, 2020 10:43:09\r\nCoronavirus restrictions have seen many of us experimenting in the kitchen, sharing recipes and discoveries with our friends on social media.\r\nIt has also prompted a few... trends.\r\nFirst we had the 'Quarantini' cocktail an … [+8652 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "A-League QuaranTeam of the season challenge - SBS - The World Game", "description": "With the A-League regular season originally scheduled for an April end, it seems fitting we look back at the best that was before the coronavirus outbreak.", "url": "https://theworldgame.sbs.com.au/a-league-quaranteam-of-the-season-challenge", "urlToImage": null, "publishedAt": "2020-04-26T00:19:00Z", "content": "Sunday marked what would have been the final round of the 2019-20 campaign, with the leagues suspension since leaving fans, players and pundits all unsure of whats next.\r\nAlthough there were five rounds remaining in the season, the players produced several st… [+5588 chars]"}, {"source": {"id": null, "name": "Fool.com.au"}, "author": null, "title": "How to generate $20000 of passive income from ASX shares - Motley Fool Australia", "description": "Here's how a touch of luck and some strong ASX dividend shares can deliver a $20,000 passive income to your pocket over time.", "url": "https://www.fool.com.au/2020/04/26/how-to-generate-20000-of-passive-income-from-asx-shares/", "urlToImage": null, "publishedAt": "2020-04-26T00:18:15Z", "content": "$20,000 per year of passive income from ASX shares sounds pretty good right now. Tragically, times are tough, and everyone is looking for a little bit of extra cash.\r\nOf course if you’re a bargain-seeking Fool, you might be investing heavily in ASX shares. Wh… [+3934 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "‘I’m not trying to dramatise it’: Paul Kent and RLPA boss in fiery clash over May 28 restart - Fox Sports", "description": "<b>Tune into our new show Fox League Live on Channel 502 Monday to Friday at 6.30pm and on Saturday at 3pm and Sunday at 5pm.</b>", "url": "https://www.foxsports.com.au/nrl/nrl-premiership/nrl-2020-paul-kent-vs-rlpa-boss-clint-newton-may-28-restart-peter-vlandys-rugby-league/news-story/b857b10950f54478a23f722501a9e88f", "urlToImage": null, "publishedAt": "2020-04-26T00:10:00Z", "content": "Paul Kent has been involved in a fiery clash with RLPA boss Clint Newton over his comments that the NRLs May 28 restart was premature.\r\nKent took issue with the fact that Newton released a statement mid-week saying the May 28 restart was not set in stone, des… [+4015 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Coronavirus study finds schools are safe for teachers and students - SBS News", "description": "A study of the NSW school students and staff who have tested positive for COVID-19 found an \"extraordinarily\" low rate of transmission in schools.", "url": "https://www.sbs.com.au/news/coronavirus-study-finds-schools-are-safe-for-teachers-and-students", "urlToImage": null, "publishedAt": "2020-04-25T23:21:07Z", "content": "There is no evidence students at NSW schools have infected staff with the coronavirus, according to a study cited by the federal government in its push to reopen schools.\r\nThe National Centre for Immunisation Research and Surveillance probe looked at all 18 c… [+1860 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Alex Woodward", "title": "Coronavirus: 'No evidence' recovered patients are immune to re-infection, warns WHO - The Independent", "description": "World Health Organisation does not recommend governments issue 'immunity passports' as countries look to 'reopen' amid pandemic", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-immunity-passports-antibody-tests-world-health-organisation-a9484261.html", "urlToImage": null, "publishedAt": "2020-04-25T23:11:26Z", "content": "The World Health Organisation says there is no evidence that people who have recovered from coronavirus and have antibodies are protected against a second infection.\r\nIn a scientific brief published on Saturday, the United Nations agency warned against countr… [+2673 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "7NEWS", "title": "The new Big Brother: First look inside the house and the diary room - 7NEWS.com.au", "description": "Sonia Kruger addresses some of the biggest rumours.", "url": "https://7news.com.au/entertainment/big-brother-australia/the-new-big-brother-first-look-inside-the-house-and-the-diary-room--c-997997", "urlToImage": null, "publishedAt": "2020-04-25T23:09:53Z", "content": "Its the most talked-about property in Australia - and thats saying something because, lets face it, Aussies love to talk about real-estate.\r\nFor months Big Brother superfans have been speculating about the made for TV mega-house that will become the backdrop … [+3231 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "WWOS staff", "title": "Raelene Castle copped death threat from Israel Folau supporter, new report reveals - Wide World of Sports", "description": "Police contacted, security increased around CEO", "url": "https://wwos.nine.com.au/rugby/raelene-castle-israel-folau-death-threat-rugby-australia-hearing/47afb748-21c1-4a6c-b74c-d7a22fb1c2f8", "urlToImage": null, "publishedAt": "2020-04-25T23:07:56Z", "content": "Raelene Castle was subjected to a death threat from an Israel Folau supporter, a new report has revealed.\r\nThe Sydney Morning Herald reported that the threat was issued on Facebook around the time of Folau's code of conduct hearing in May last year.\r\nFolau wa… [+849 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": null, "title": "What’s the Buzz: Saint, Sinner, Shoosh, Spotted - Daily Telegraph", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.dailytelegraph.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T22:18:45Z", "content": null}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Anna Salleh", "title": "The fagus, Australia's only native winter deciduous tree, is turning its stunning autumn colours. What's behind that gorgeous display? - ABC News", "description": "Tasmania's deciduous beech, the fagus, is turning stunning yellow, orange and red — what makes this happen?", "url": "https://www.abc.net.au/news/science/2020-04-26/true-blue-autumn-leaves-are-turning/12147698", "urlToImage": null, "publishedAt": "2020-04-25T20:30:09Z", "content": "Every year at this time, thousands flock to national parks in Tasmania to see the stunning autumn display of Australia's only native winter deciduous tree the fagus.\r\nBut this year the state's parks are closed until further notice thanks to coronavirus, which… [+4723 chars]"}, {"source": {"id": null, "name": "Heraldsun.com.au"}, "author": "Nathan Vass in New York, Staff writers, AP, Reuters", "title": "Coronavirus updates: UK’s grim milestone as ‘immunity passports’ slammed by WHO - Herald Sun", "description": "The world’s coronavirus death toll passed 200,000 early this morning Australian time as the number of infections approached three million.", "url": "https://www.heraldsun.com.au/coronavirus/coronavirus-updates-uks-grim-milestone-prediction-as-immunity-passports-slammed-by-who/news-story/004c23014e5a3f38760ca5bb34088e17", "urlToImage": null, "publishedAt": "2020-04-25T17:58:18Z", "content": "<ul><li>Global virus death toll passes 200,000</li><li>Britain hits grim new milestone</li><li>Americans flock to beaches in heat wave</li><li>WHO warns against immunity passports</li></ul>The worlds coronavirus death toll passed 200,000 early this morning Au… [+22497 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Alessandro Barbosa", "title": "No Man's Sky Will Get Even More Ambitious In 2020 - GameSpot", "description": "With large additions over the last five months, Hello Games is teasing even more content for No Man's Sky this year.", "url": "https://www.gamespot.com/articles/no-mans-sky-will-get-even-more-ambitious-in-2020/1100-6476421/", "urlToImage": null, "publishedAt": "2020-04-25T17:02:00Z", "content": "No Man's Sky has been receiving numerous free content updates over the past few months, adding features like living ships, colossal exo mechs, and even a full audio creation suite to the space-explorer.\r\nDeveloper Hello Games is continuing to tinker with its … [+1395 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Gareth Beavis", "title": "iPhone SE 2020 teardown reveals intriguing facts about battery and camera - TechRadar", "description": "Things are more similar than we anticipated", "url": "https://www.techradar.com/news/iphone-se-2020-teardown-reveals-intriguing-facts-about-battery-and-camera", "urlToImage": null, "publishedAt": "2020-04-25T16:21:00Z", "content": "Weve been waiting to see what parts are in Apples new iPhone - our iPhone SE review left us with a few questions we wanted answering, and iFixits iPhone SE early teardown has begun to provide a few of them.\r\nWhile theres still more to come when the full teard… [+2050 chars]"}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": "Alex Crowe", "title": "What will Term 2 look like for ACT schools? - The Canberra Times", "description": "Here's what you need to know before Term 2 starts in the ACT.", "url": "https://www.canberratimes.com.au/story/6733682/what-will-term-2-look-like-for-act-schools/", "urlToImage": null, "publishedAt": "2020-04-25T15:30:00Z", "content": ""}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "WHO says no evidence recovered COVID-19 patients are immune to reinfection - The Times of Israel", "description": "UN health agency warns against notion of 'immunity passports,' saying they could risk further transmission of the coronavirus", "url": "https://www.timesofisrael.com/who-says-no-evidence-recovered-covid-19-patients-immune-to-reinfection/", "urlToImage": null, "publishedAt": "2020-04-25T12:54:26Z", "content": "The World Health Organization on Saturday said there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection, cautioning against the idea of immunity passports.\r\nThe concept of immunit… [+4204 chars]"}, {"source": {"id": null, "name": "Couriermail.com.au"}, "author": null, "title": "Expert reveals the Qld airline that could replace ‘tainted’ Virgin Australia - Courier Mail", "description": "Subscribe to The Courier-Mail to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.couriermail.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T11:02:01Z", "content": null}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Alex Turner-Cohen", "title": "Baby makes 'miracle' recovery to beat virus - Queensland Times", "description": "Coronavirus: Six-month-old baby from Manchester beats COVID-19, parents overjoyed", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-sixmonthold-baby-from-manchester-beats-covid19-parents-overjoyed/news-story/dd23c0c28d8689c2497724fdb6291258", "urlToImage": null, "publishedAt": "2020-04-25T09:49:00Z", "content": "Already severely underweight and with other medical complications, doctors thought this six-month-old baby was done for when she contracted COVID-19. But Erin Bates pulled through and has become a symbol of hope for others.\r\nThe baby from Manchester, England,… [+3668 chars]"}, {"source": {"id": null, "name": "Hurriyetdailynews.com"}, "author": "hurriyetdailynews.com", "title": "Hubble telescope celebrates 30th year in space - Hurriyet Daily News", "description": "Scientists on April 24 celebrated the Hubble Space Telescope's 30th anniversary with a new image of a satellite galaxy of the Milky Way.", "url": "http://www.hurriyetdailynews.com/hubble-telescope-celebrates-30th-year-in-space-154195", "urlToImage": null, "publishedAt": "2020-04-25T06:16:03Z", "content": "WASHINGTON\r\nScientists on April 24 celebrated the Hubble Space Telescope's 30th anniversary with a new image of a satellite galaxy of the Milky Way. \r\nIn a statement, U.S. space agency NASA said the galaxy in the image - located 163,000 light-years away- away… [+847 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": null, "name": "Heraldsun.com.au"}, "author": null, "title": "Virgin Australia aircraft blocked in Perth as collapse could domino air route shutdown across the country - Herald Sun", "description": "Subscribe to the Herald Sun to get unrestricted digital access, home paper delivery, Foxsports.com.au subscription,  Apps for iPad and Android and much more...", "url": "https://www.heraldsun.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-24T12:03:00Z", "content": null}]}