{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "7news.com.au"}, "author": "Brett Wadelton", "title": "Space news: Asteroid to pass close to Earth next week, visible by telescope - 7NEWS.com.au", "description": "Stargazers are set for a treat early next week as an asteroid will pass close to Earth.", "url": "https://7news.com.au/technology/space/space-news-mask-shaped-asteroid-to-pass-close-to-earth-next-week-visible-by-telescope-c-993995", "urlToImage": null, "publishedAt": "2020-04-25T06:38:57Z", "content": "Astronomers are set for a treat early next week as an asteroid will pass close to Earth.\r\nNamed Asteroid (52768) 1998 OR2, this large near-Earth and potentially hazardous asteroid (PHA) will safely fly past us at a mere 6.3 million kilometres - which is quite… [+1587 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/paige-cockburn/7065460", "title": "Coronavirus cases in NSW rise again, beachgoers slammed for not keeping social distance - ABC News", "description": "The number of new coronavirus cases in NSW is back in double digits as the state's Health Minister expresses his agitation over people ignoring social distancing rules on three Sydney beaches which have since been shut again.", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-nsw-cases-rise-by-12-people-crowd-randwick-beaches/12184422", "urlToImage": null, "publishedAt": "2020-04-25T05:12:54Z", "content": "Updated \r\nApril 25, 2020 16:26:51\r\nThe NSW Health Minister has expressed his disappointment in people who flouted social distancing rules on Sydney beaches after council relaxed the lockdown for their benefit.\r\nKey points:\r\n<ul><li>There were 12 new coronavir… [+4182 chars]"}, {"source": {"id": null, "name": "Bluemountainsgazette.com.au"}, "author": null, "title": "NSW Health urges COVID-19 testing for Blue Mountains residents with symptoms - Blue Mountains Gazette", "description": "Blue Mountains residents with minor symptoms of COVID-19 have been urged to come forward for testing.", "url": "https://www.bluemountainsgazette.com.au/story/6735170/nsw-health-urges-covid-19-testing-for-blue-mountains-residents-with-symptoms/", "urlToImage": null, "publishedAt": "2020-04-25T04:10:00Z", "content": "Blue Mountains residents with minor symptoms of COVID-19 have been urged to come forward for testing.\r\nNSW Health executive director Dr Jeremy McAnulty issued the call at a press conference today [Saturday, April 25]. \r\n NSW Health executive director Dr Jerem… [+2064 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Man fighting for life, woman expected to be charged following serious stabbing at Kilburn in Adelaide - ABC News", "description": "A man is fighting for life and a woman is expected to be charged with attempted murder following an early morning stabbing north of Adelaide.", "url": "https://www.abc.net.au/news/2020-04-25/man-with-life-threatening-injuries-after-adelaide-stabbing/12184892", "urlToImage": null, "publishedAt": "2020-04-25T03:29:29Z", "content": "Posted \r\nApril 25, 2020 13:29:29\r\nA young man is fighting for his life after he was found with stab wounds at a home north of Adelaide.\r\n<ul><li>A woman fled the scene but was arrested in a nearby street</li><li>The man is being treated in hospital for seriou… [+902 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Sally Rawsthorne", "title": "NSW records 12 new coronavirus cases, total almost at 3000 - Sydney Morning Herald", "description": "Health Minister Brad Hazzard said the state was doing \"a lot, lot better\" compared to this time a month ago.", "url": "https://www.smh.com.au/national/nsw/nsw-records-12-new-coronavirus-cases-total-almost-at-3000-20200425-p54n62.html", "urlToImage": null, "publishedAt": "2020-04-25T03:16:39Z", "content": "Six residents have now died of coronavirus at the aged care home. \"To the family of that lady, I want to express all of the community's condolences,\" Mr Hazzard said.\r\nThere is now a total of 48 cases at Newmarch House, comprised of 17 staff and 31 residents.… [+3372 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Ex-Wanderer: The club 'went to s***' when Popovic left - SBS - The World Game", "description": "Former Western Sydney Wanderers defender Abdelrahman Kuku has opened up about his frustration at not getting an opportunity in the A-League and says the club has still not recovered from the departure of Tony Popovic.", "url": "https://theworldgame.sbs.com.au/ex-wanderer-the-club-went-to-s-when-popovic-left", "urlToImage": null, "publishedAt": "2020-04-25T03:10:00Z", "content": "Kuku joined the Wanderers youth set-up in 2014 and worked his way up through the clubs ranks. But unable to break through into the senior team, he moved to America to take up a full athletic scholarship at Eastern Florida State College in 2018.\r\nThe 21-year-o… [+4300 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "AP", "title": "US coronavirus protests: 1500 protesters crowd Wisconsin capital - NEWS.com.au", "description": "Coronavirus: Crowd of 1500 storms capital in latest US protest", "url": "https://www.news.com.au/world/north-america/coronavirus-crowd-of-1500-storms-capital-in-latest-us-protest/news-story/f4d279f3d294214c6b69cf81909aa903", "urlToImage": null, "publishedAt": "2020-04-25T02:59:56Z", "content": "Around 1500 Trump supporters ignored social distancing to stage the latest protest in the United States against lockdown measures.The demonstrations by right-wing groups against measures to contain the coronavirus, which have risen up around the country, came… [+1431 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Apple iPhone 12 might support 5G, official release pushed to December - Micky News", "description": "Rumors around the tech community claim that the Apple iPhone 12 might support 5G, and that its release date was delayed until December.", "url": "https://micky.com.au/apple-iphone-12-might-support-5g-official-release-pushed-to-december/", "urlToImage": null, "publishedAt": "2020-04-25T02:44:27Z", "content": "Apple has released a new version of its flagship device every year. Despite the spread of the COVID-19 virus, it would appear that Apple will push through with its original schedule.\r\nThe Apple iPhone is usually released every September of the year. However, … [+2513 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Thomas Duff For Daily Mail Australia", "title": "Tragedy as a man dies from coronavirus in Tasmania - taking Australia's death toll to 80 - Daily Mail", "description": "A 90-year-old man from Tasmania's north-west coast has died from the coronavirus on Friday, bringing the state's total to 10 and Australia's death toll to 80.", "url": "https://www.dailymail.co.uk/news/article-8255737/Tragedy-man-dies-coronavirus-Tasmania-taking-Australias-death-toll-80.html", "urlToImage": null, "publishedAt": "2020-04-25T02:38:22Z", "content": "A man from Tasmania's north-west coast has died from the coronavirus, bringing the state's total to 10 and Australia's death toll to 80. \r\nThe 90-year-old man died on Friday at the Mersey Community Hospital in Latrobe. \r\nOut of the 10 deaths from coronavirus … [+2250 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Summer Woolley", "title": "Coronavirus Australia: Further cases recorded at Anglicare’s Newmarch House facility - 7NEWS.com.au", "description": "It comes as authorities reveal another aged care worker at a separate facility had become symptomatic.", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-australia-further-cases-recorded-at-anglicares-newmarch-house-facility-c-998878", "urlToImage": null, "publishedAt": "2020-04-25T02:37:42Z", "content": "A Sydney aged care facility has recorded a further four cases of COVID-19 in the last 24 hours.\r\nAnglicares Newmarch House facility has recorded a total of 48 cases of coronavirus including 17 staff members and 31 residents, NSW Health Minister Brad Hazzard s… [+1519 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Latika Bourke, Sally Rawsthorne", "title": "Coronavirus updates LIVE: Scott Morrison says social distancing won't apply to schools, global COVID-19 cases surpass 2.7 million, Australian death toll stands at 80 - The Sydney Morning Herald", "description": "If you suspect you or a family member has coronavirus you should call (not visit) your GP or ring the national Coronavirus Health Information Hotline on 1800 020 080.", "url": "https://www.smh.com.au/national/coronavirus-updates-live-scott-morrison-says-social-distancing-won-t-apply-to-schools-global-covid-19-cases-surpass-2-7-million-australian-death-toll-stands-at-80-20200424-p54n21.html", "urlToImage": null, "publishedAt": "2020-04-25T02:19:00Z", "content": "Six residents have now died of coronavirus at the aged care home. \r\n\"To the family of that lady, I want to express all of the community's condolences,\" Mr Hazzard said.\r\nThere is now a total of 48 cases at Newmarch House, comprised of 17 staff and 31 resident… [+947 chars]"}, {"source": {"id": null, "name": "9news.com.au"}, "author": "Olivana Smith-Lathouris", "title": "Drug paraphernalia found in truck involved in deadly accident - 9News", "description": "<p>Drug paraphernalia was allegedly found in the cabin of the truck involved  in the horrific crash that killed four police officers on Wednesday night.</p>", "url": "https://www.9news.com.au/national/victoria-police-crash-drug-paraphernalia-found-in-truck-involved-in-deadly-accident-killing-four-officers/678d0107-73b2-41c9-b302-9b345abd42b8", "urlToImage": null, "publishedAt": "2020-04-25T01:57:16Z", "content": null}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Christine McGinn", "title": "Victorians mark Anzac Day at home - NEWS.com.au", "description": "Victorians mark Anzac Day at home", "url": "https://www.news.com.au/national/breaking-news/victorians-to-honour-anzac-day-at-home/news-story/c3aaab9528a1a92c3d2f53e548d9d502", "urlToImage": null, "publishedAt": "2020-04-25T01:18:45Z", "content": "There was no usual dawn service, march or even two-up this Anzac Day, but Victorians made sure it wasn't forgotten.Instead of pouring into the city, Victorians stayed home and stood in their driveways to pay respect with the Returned and Services League's Lig… [+1988 chars]"}, {"source": {"id": null, "name": "Watoday.com.au"}, "author": "Nathan Hondros", "title": "Qantas rips into Perth Airport amid blockade of Virgin Australia aircraft - Sydney Morning Herald", "description": "Qantas has delivered a stinging rebuke to Perth Airport over its standoff with Virgin Australia, defending it rivals over millions in outstanding invoices.", "url": "https://www.watoday.com.au/national/western-australia/qantas-rips-into-perth-airport-amid-blockade-of-virgin-australia-aircraft-20200425-p54n5n.html", "urlToImage": null, "publishedAt": "2020-04-25T01:05:36Z", "content": "\"It's no way to treat a customer of 20 years. This kind of action is deeply worrying for all users of Perth Airport.\r\n\"We have our own dispute with Perth Airport over excessive charges, which has been going through the courts for over a year.\r\n\"As part of tha… [+1882 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Vicky Roach", "title": "Movie reviews: Chris Hemsworth’s Extraction and kids’ flick The Willoughbys - Jimmys Post", "description": "LOOKING for something new to watch this weekend? Check out Chris Hemsworth’s new thriller and sweet kids’ romp The Willoughbys.", "url": "https://www.news.com.au/entertainment/movies/movie-reviews-chris-hemsworths-extraction-and-kids-flick-the-willoughbys/news-story/ceebdfbaf48d22882ccb9ad549e4cddc", "urlToImage": null, "publishedAt": "2020-04-25T01:04:54Z", "content": "LOOKING for something new to watch this weekend? Check out Chris Hemsworths new thriller and sweet kids romp The Willoughbys. \r\nEXTRACTION\r\nTwo stars \r\nDirector: Sam Hargrave\r\nStarring: Chris Hemsworth, Rudhraskh Jaiswal, David Harbour\r\nRating: MA15+\r\nRunning… [+6915 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": null, "title": "Who makes the all-time NRL cult heroes team? - Daily Telegraph", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.dailytelegraph.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T00:36:00Z", "content": null}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Baked beans an unlikely nutrition star, and pandemic hit - Health - ABC News", "description": "While baked beans might not look particularly sexy, they're a favourite among nutrition experts. Here's why.", "url": "https://www.abc.net.au/news/health/2020-04-25/baked-beans-an-unlikely-nutrition-star/12176974", "urlToImage": null, "publishedAt": "2020-04-25T00:17:11Z", "content": "As we all fight our inner \"prepper\" and try not to succumb to panic buying, it seems many of us have turned to an old favourite: baked beans.\r\nBean production at Australia's largest fruit and vegetable cannery in Shepparton, Victoria, has doubled its usual vo… [+5001 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/hannah--reich/9151774", "title": "TikTok offers connection, comedy and creativity during coronavirus lockdown - ABC News", "description": "The social video sharing app once seemed just for teenagers but since social isolation started, more and more people are joining TikTok for connection, comedy and creativity.", "url": "https://www.abc.net.au/news/2020-04-25/turning-to-tiktok-during-coronavirus-lockdown/12176814", "urlToImage": null, "publishedAt": "2020-04-24T23:57:27Z", "content": "Posted \r\nApril 25, 2020 09:19:12\r\n\"If it wasn't for coronavirus, I wouldn't have downloaded it and the fact that I have makes me feel a little bit embarrassed,\" says Hannah Baker, a new TikTok devotee.\r\nThe 27-year-old judge's associate says one thing that go… [+7054 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "", "title": "Anzac Day 2020: Australia and New Zealand come together in isolation – in pictures - The Guardian", "description": "From driveway ceremonies to backyard buglers, Australians and New Zealanders marked Anzac Day in lockdown", "url": "https://www.theguardian.com/news/gallery/2020/apr/25/anzac-day-2020-australia-and-new-zealand-come-together-in-isolation", "urlToImage": null, "publishedAt": "2020-04-24T23:47:00Z", "content": "From driveway ceremonies to backyard buglers, Australians and New Zealanders marked Anzac Day in lockdown. Some gathered, far apart, on beaches. Others lined residential streets, standing in front of their homes with wreaths and poppies and candles to honour … [+167 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "By LOLITA C. BALDOR and ROBERT BURNS", "title": "US Navy recommends return of fired captain - NEWS.com.au", "description": "US Navy recommends return of fired captain", "url": "https://www.news.com.au/world/breaking-news/us-navy-recommends-return-of-fired-captain/news-story/50fd60f2f3f5d801f606cdf6f228f466", "urlToImage": null, "publishedAt": "2020-04-24T22:32:54Z", "content": "The top Navy officer has recommended the reinstatement of the aircraft carrier captain fired for sending a fraught email to commanders pleading for faster action to protect his crew from a coronavirus outbreak, officials familiar with the investigation say.Ad… [+3979 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/abc-local/sophie-kesteven/7149610", "title": "Raquel is working from home during coronavirus — and that means sloths in the spare room - ABC News", "description": "Working from home means different things for different people. For Raquel, it means moving three very lazy — but very cute — new housemates into the spare room.", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-panama-working-from-home-with-sloths/12169922", "urlToImage": null, "publishedAt": "2020-04-24T22:29:37Z", "content": "Updated \r\nApril 25, 2020 08:23:26\r\nWorking from home is the new normal for many people and for Raquel Cruz Alpizar, it's meant moving three unlikely new housemates into her spare room.\r\nSince coronavirus restrictions took hold, she's been caring around the cl… [+6272 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "‘Isolation is getting to you’: Paul Kent and Ben Ikin clash over NRL points allocation - Fox Sports", "description": "<b>Tune into our new show Fox League Live on Channel 502 Monday to Friday at 6.30pm and on Saturday at 3pm and Sunday at 5pm.</b>", "url": "https://www.foxsports.com.au/nrl/nrl-premiership/nrl-2020-paul-kent-vs-ben-ikin-nrl-points-system-round-1-and-round-2-eels-knights-panthers-broncos-raiders-storm/news-story/38b7f07a754f97698a1c5cb6a4fdef33", "urlToImage": null, "publishedAt": "2020-04-24T22:10:35Z", "content": "Ben Ikin and Paul Kent have clashed over potentially cutting some or all of the points from the first two rounds in a revised competition when the season returns.\r\nBryan Fletcher asked Ikin if the NRL should increase the points to three points a win or four p… [+2578 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Ally Foster", "title": "Coronavirus: Trump’s weird suggestions to get rid of the virus - NEWS.com.au", "description": "Coronavirus: Trump claims ‘dangerous’ suggestions to kill the virus were sarcastic", "url": "https://www.news.com.au/world/coronavirus/health/coronavirus-trumps-weird-suggestions-to-get-rid-of-the-virus/news-story/5c22dcca5950df9748e594d0254facac", "urlToImage": null, "publishedAt": "2020-04-24T21:00:00Z", "content": "During a White House press briefing yesterday, Donald Trump suggested that disinfectants like bleach or rubbing alcohol could be injected into the body to kill the coronavirus.His comments brought swift backlash from health professionals who warned against th… [+5985 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": null, "title": "Captain Tom Moore becomes oldest person to top Britain's music chart - The Age", "description": "A World War II veteran who raised millions for charity has now become the oldest person to top Britain's main music chart.", "url": "https://www.smh.com.au/world/europe/captain-tom-moore-becomes-oldest-person-to-top-britain-s-music-chart-20200425-p54n4v.html", "urlToImage": null, "publishedAt": "2020-04-24T20:40:50Z", "content": "He also went to No.1 on the music charts - with a little help from a friend.\r\nThe cover version of You'll Never Walk Alone that Moore appears on with singer Michael Ball was on course to be pipped by The Weeknd's Blinding Lights, until the Canadian star asked… [+1312 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "‘What the f*** am I doing?’ The Christmas Day epiphany that changed Rob Whittaker’s life - Fox Sports", "description": "Robert Whittaker had not once quit on running up this sand dune in Sydney’s Sutherland Shire.", "url": "https://www.foxsports.com.au/ufc/what-the-f-am-i-doing-the-christmas-day-epiphany-that-changed-rob-whittakers-life/news-story/cad4632c55311f95e02d455205242887", "urlToImage": null, "publishedAt": "2020-04-24T20:00:20Z", "content": "That was until Christmas Day last year, when he just stopped.\r\nThen (I) stood there, asking what the f**k am I doing? he told The Saturday Telegraph.\r\nIt was Christmas Day.\r\nMy family was somewhere else.\r\nThat moment, its when everything crashed.\r\nWatch Foxte… [+1979 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Malcolm Farr", "title": "Morrison's 'good habits' of cooperation in crisis may die hard in recovery - The Guardian", "description": "With Labor ready for a ‘big conversation’, get ready for a wild ride along the path to coronavirus recovery", "url": "https://www.theguardian.com/australia-news/2020/apr/25/morrisons-good-habits-of-cooperation-in-crisis-may-die-hard-in-recovery", "urlToImage": null, "publishedAt": "2020-04-24T20:00:00Z", "content": "The political biff is back.\r\nThe pandemic-enforced harmony between Labor and the government, and what Scott Morrison calls the good habits of cooperation, are doomed.\r\nThe political focus is shifting to recovery from the Covid-19 economic devastation, and una… [+5782 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "George Dvorsky", "title": "NASA Rocket Scientists Designed A Rapid-Production Ventilator In Just 37 Days - Gizmodo Australia", "description": "Introducing VITAL, a prototype ventilator designed expressly for quick and easy mass production. Developed by NASA engineers, the device could alleviate ongoing supply shortages in the U.S. and around the world as the covid-19 pandemic rages on....", "url": "https://www.gizmodo.com.au/2020/04/nasa-rocket-scientists-designed-a-rapid-production-ventilator-in-just-37-days/", "urlToImage": null, "publishedAt": "2020-04-24T19:30:00Z", "content": "Introducing VITAL, a prototype ventilator designed expressly for quick and easy mass production. Developed by NASA engineers, the device could alleviate ongoing supply shortages in the U.S. and around the world as the covid-19 pandemic rages on.\r\nNASA has cop… [+3078 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": null, "name": "Standard.net.au"}, "author": "Andi Yu", "title": "New Vic laws and virus outbreak probe - Warrnambool Standard", "description": "Emergency laws to combat the effects of coronavirus on the Victorian economy and the investigation of an outbreak at a Melbourne psychiatric facility are the...", "url": "https://www.standard.net.au/story/6734968/new-vic-laws-and-virus-outbreak-probe/?cs=10264", "urlToImage": null, "publishedAt": "2020-04-24T17:31:40Z", "content": ""}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Eve Wagstaff", "title": "Coronavirus: Ricky Gervais launches epic rant against ‘multi-millionaire celebs’ lecturing people during lockdown - NEWS.com.au", "description": "Coronavirus: Ricky Gervais launches epic rant against ‘multi-millionaire celebs’ lecturing people during lockdown", "url": "https://www.news.com.au/entertainment/celebrity-life/coronavirus-ricky-gervais-launches-epic-rant-against-multimillionaire-celebs-lecturing-people-during-lockdown/news-story/ac2d236332980c8b99d499ffb519dfe7", "urlToImage": null, "publishedAt": "2020-04-24T17:20:49Z", "content": "Ricky Gervais has launched an epic rant against \"multi-millionaire celebs\" who lecture \"normal nobodies\" on how to live while health staff risk their lives.The 58-year-old comedian blasted a string of A-listers including Gal Gadot and her Hollywood friends wh… [+3810 chars]"}, {"source": {"id": null, "name": "Zdnet.com"}, "author": "Daphne Leprince-Ringuet", "title": "Coronavirus contact-tracing app: Here’s how we’ll protect your privacy, says NHS - ZDNet", "description": "NHS insists the public's data is safe in the hands of the health services. Privacy campaigners want more detail.", "url": "https://www.zdnet.com/article/coronavirus-contact-tracing-app-heres-how-well-protect-your-privacy-says-nhs/", "urlToImage": null, "publishedAt": "2020-04-24T14:18:00Z", "content": "To earn the trust of the public, privacy will be fundamental to the building the coronavirus contact-tracing app that the UK government is working on, NHSX boss Matthew Gould has said in a new post detailing the organization's commitment to confidentiality - … [+6376 chars]"}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": "Adrian Rollins", "title": "JobKeeper fixes unveiled improving access for some sectors - The Canberra Times", "description": "Employers will not be able to pick and choose who gets JobKeeper payments.", "url": "https://www.canberratimes.com.au/story/6734871/jobkeeper-fixes-unveiled-improving-access-for-some-sectors/", "urlToImage": null, "publishedAt": "2020-04-24T14:00:00Z", "content": ""}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Rachel England", "title": "Nintendo blocks legacy logins after 160,000 accounts were compromised (update) - Yahoo Finance Australia", "description": "Some 160,000 Switch users have been the subject of a data breach.", "url": "https://au.finance.yahoo.com/news/nintendo-blocks-legacy-logins-data-breach-account-120610588.html", "urlToImage": null, "publishedAt": "2020-04-24T12:06:00Z", "content": "Nintendo has shut down NNID logins and is encouraging Switch owners to lock down their accounts after a wave of fraudulent attacks. Nintendo itself has confirmed that the platform has fallen foul of hackers, who are accessing accounts and using linked PayPal … [+3633 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Apple says ‘no evidence’ a flaw in iPhone email app is security risk for customers - 7NEWS.com.au", "description": "A flaw in an iPhone email app has been exposed but Apple says there is no security risk to its more than half a billion users.", "url": "https://7news.com.au/technology/apple-says-no-evidence-a-flaw-in-iphone-email-app-is-security-risk-for-customers-c-997338", "urlToImage": null, "publishedAt": "2020-04-24T07:01:00Z", "content": "Apple Inc says it has found no evidence a flaw in its email app for iPhones and iPads has been used against customers.\r\nAnd it believes the flaw does not pose an immediate risk to our users.\r\nWatch the video above\r\nSan Francisco-based security firm ZecOps on … [+1400 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "WA teachers' union panned over virus ad - NEWS.com.au", "description": "WA teachers' union panned over virus ad", "url": "https://www.news.com.au/national/breaking-news/wa-teachers-union-wants-kids-to-stay-home/news-story/4bd5691d834ec162941ad6ee98d45d8a", "urlToImage": null, "publishedAt": "2020-04-24T06:00:00Z", "content": "West Australian teachers have called on parents to keep children home from school but state and federal leaders say the union has its facts wrong.In a full-page newspaper advertisement published on Friday, the State School Teachers' Union of WA says schools s… [+1966 chars]"}, {"source": {"id": null, "name": "Onestepoffthegrid.com.au"}, "author": "Sophie Vorrath", "title": "NSW paves way for more – and bigger – rooftop solar systems - One Step Off The Grid", "description": "NSW government unveils further relaxations to renewable energy development policy, paving way for installation of larger residential and commercial rooftop solar systems.", "url": "https://onestepoffthegrid.com.au/nsw-paves-way-for-more-and-bigger-rooftop-solar-systems/", "urlToImage": null, "publishedAt": "2020-04-24T01:21:37Z", "content": "The New South Wales government has unveiled further relaxations to laws governing renewable energy development, paving the way for the installation of larger residential and commercial rooftop solar systems across the state.\r\nThe new amendments to the State E… [+2992 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Coronavirus: New York antibody tests reveal more people exposed to virus than thought - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-23T22:28:00Z", "content": null}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Deloitte tightens grip on Virgin - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-23T10:45:00Z", "content": null}]}