{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Theage.com.au"}, "author": "Adam Carey, Michael Fowler", "title": "Victoria's political unity on schools turns into open warfare - The Age", "description": "The state opposition has demanded the Andrews government immediately reopen schools to all students.", "url": "https://www.theage.com.au/national/victoria/victoria-s-political-unity-on-schools-turns-into-open-warfare-20200425-p54n5q.html", "urlToImage": null, "publishedAt": "2020-04-25T13:01:44Z", "content": "The Premier needs to understand the pressure that his restrictions are putting on families, Mr OBrien said. Other states are moving to get kids back to school safely and Victoria must do the same.\r\nThe Liberal leader proposed extra safety measures for schools… [+4543 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Apple iPhone 12 might support 5G, official release pushed to December - Micky News", "description": "Rumors around the tech community claim that the Apple iPhone 12 might support 5G, and that its release date was delayed until December.", "url": "https://micky.com.au/apple-iphone-12-might-support-5g-official-release-pushed-to-december/", "urlToImage": null, "publishedAt": "2020-04-25T12:10:25Z", "content": "Apple has released a new version of its flagship device every year. Despite the spread of the COVID-19 virus, it would appear that Apple will push through with its original schedule.\r\nThe Apple iPhone is usually released every September of the year. However, … [+2513 chars]"}, {"source": {"id": null, "name": "Betanews.com"}, "author": null, "title": "Microsoft is bombarding Chrome-using Outlook.com visitors with ads for Edge - BetaNews", "description": "Microsoft is no stranger to hitting its customers with ads for its products and services, and it seems that the company is so keen that people make the switch to the new Chromium-based version of Edge that it is now bombarding Outlook.com users with banner ad…", "url": "https://betanews.com/2020/04/25/microsoft-edge-ads-chrome-outlook/", "urlToImage": null, "publishedAt": "2020-04-25T12:07:30Z", "content": "Microsoft is no stranger to hitting its customers with ads for its products and services, and it seems that the company is so keen that people make the switch to the new Chromium-based version of Edge that it is now bombarding Outlook.com users with banner ad… [+1100 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Adelaide and Perth airports seize Virgin aircraft as collateral against debts - Sky News Australia", "description": "Adelaide Airport has become the latest Australian airport to sieze possession of Virgin Australia aircraft as collateral against outstanding bills. Since bei...", "url": "https://www.youtube.com/watch?v=ywsYGqXZCh0", "urlToImage": null, "publishedAt": "2020-04-25T11:59:36Z", "content": null}, {"source": {"id": null, "name": "Themercury.com.au"}, "author": "AMBER WILSON", "title": "Tasmania records one new COVID-19 case on Saturday - The Mercury", "description": "TASMANIA recorded just one new confirmed coronavirus case on Saturday — another North-West healthcare worker.", "url": "https://www.themercury.com.au/news/coronavirus/tasmania-records-one-new-covid19-case-on-saturday/news-story/6c3476d057902acd95b828506872da0c", "urlToImage": null, "publishedAt": "2020-04-25T11:38:00Z", "content": "TASMANIA recorded just one new confirmed coronavirus case on Saturday another North-West healthcare worker.\r\nActing public health director Scott McKeown confirmed on Saturday night that the patient was male and in his 40s.\r\nThe state’s COVID-19 tally now stan… [+624 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Victoria Police officer killed by truck on Eastern Freeway remembered as 'loving and genuine soul' - ABC News", "description": "A Victoria Police officer, who was killed along with three of his colleagues, is remembered as a bright light by his devastated family", "url": "https://www.abc.net.au/news/2020-04-25/victoria-police-officer-killed-truck-kew-remembered-by-family/12185526", "urlToImage": null, "publishedAt": "2020-04-25T11:19:15Z", "content": "Updated \r\nApril 25, 2020 21:59:20\r\nA Victoria Police officer killed in the line of duty has been remembered as a \"bright light\" by his devastated family, who have been left \"with a pain that has taken our breath away\".\r\nKey points:\r\n<ul><li>Constable Joshua P… [+3192 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Staff writers", "title": "Coronavirus: White House considering scaling back Donald Trump’s role in daily virus briefings - NEWS.com.au", "description": "Coronavirus: White House considering scaling back Donald Trump’s role in daily virus briefings", "url": "https://www.news.com.au/world/coronavirus/global/coronavirus-white-house-considering-scaling-back-donald-trumps-role-in-daily-virus-briefings/news-story/b5c1d3534f49d4707be2531feece499d", "urlToImage": null, "publishedAt": "2020-04-25T11:06:01Z", "content": "The White House is reportedly considering scaling back Donald Trumps role in its daily coronavirus briefings after a series of blunders.There have been discussions about changing the format of the briefings to curtail the US President’s role, according to fou… [+4397 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Rachael Gavin", "title": "Music From the Home Front concert opens with fitting tributes and iconic songs - Nine", "description": "Ben Lee and Jimmy Barnes perform", "url": "https://www.nine.com.au/entertainment/latest/music-from-the-home-front-ben-lee-jimmy-barnes/499adb3a-d09e-4752-8efe-8228e7350f8a", "urlToImage": null, "publishedAt": "2020-04-25T10:57:37Z", "content": "Music From The Home Front has paid tribute on Anzac Day to both those Aussies who have served and died in wars and conflicts, while also thanking workers on the frontline of the COVID-19 pandemic.\r\nThe show opened with three meaningful performances, each perf… [+1789 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "China sends medical team to check on Kim Jong-un's health, sources say - SBS News", "description": "China has sent a team including medical experts to advise on North Korea's Kim Jong-un, sources say.", "url": "https://www.sbs.com.au/news/china-sends-medical-team-to-check-on-kim-jong-un-s-health-sources-say", "urlToImage": null, "publishedAt": "2020-04-25T09:53:28Z", "content": "China has dispatched a team to North Korea including medical experts to advise on North Korean leader Kim Jong-un, according to three people familiar with the situation.\r\nThe trip by the Chinese doctors and officials comes amid conflicting reports about the h… [+3855 chars]"}, {"source": {"id": null, "name": "9news.com.au"}, "author": "9News Staff", "title": "'Die': $3m home of man arrested over deadly police crash vandalised - 9News", "description": "<p>The home of the Porsche driver held over the Melbourne police crash has been vandalized, as the family of one of the dead officers released an emotional tribute.</p>", "url": "https://www.9news.com.au/national/melbourne-police-crash-eastern-freeway-porsche-driver-richard-pusey-home-vandalised/818c433b-653b-4bf5-b18e-9fa4fc00813c", "urlToImage": null, "publishedAt": "2020-04-25T09:46:53Z", "content": "Property News: Tips and tricks for propagating edibles and seed saving - domain.com.au"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Calla Wahlquist", "title": "Health authorities defend handling of coronavirus cluster at Melbourne psychiatric facility - The Guardian", "description": "Fifteen people, including six patients, from the Albert Road Clinic have tested positive to Covid-19 since 24 March", "url": "https://www.theguardian.com/australia-news/2020/apr/25/health-authorities-defend-handling-of-coronavirus-cluster-at-melbourne-psychiatric-facility", "urlToImage": null, "publishedAt": "2020-04-25T09:33:43Z", "content": "Victorian health authorities have defended their response to a coronavirus outbreak in an inpatient psychiatric facility after staff and patients were not told of the cluster until one month after the first positive test.\r\nMeanwhile more than 180 Australians … [+4243 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Chris De Silva", "title": "Todd Greenberg keeping options open amid Rugby Australia, Cricket Australia links - Wide World of Sports", "description": "'I've had a couple of calls this week actually'", "url": "https://wwos.nine.com.au/nrl/todd-greenberg-reveals-offers-after-nrl-resignation-keeping-options-open/df2c52d2-307b-4fda-b4f2-c95ca2f642c0", "urlToImage": null, "publishedAt": "2020-04-25T09:03:05Z", "content": "Former NRL CEO Todd Greenberg has admitted that he has already received a number of job offers, just days after stepping down from his role as league boss.\r\nGreenberg was heavily criticised for the NRL's dire financial situation which was laid bare amid the C… [+2866 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Sarah McPhee", "title": "Adelaide crash: Two women dead after 'horrific' collision in Urrbrae - NEWS.com.au", "description": "Adelaide crash: Two women dead after 'horrific' collision in Urrbrae", "url": "https://www.news.com.au/national/south-australia/adelaide-crash-horrific-multivehicle-collision-on-cross-rd-urrbrae/news-story/a90b8596f9d5c92c5b7788da17d9c98d", "urlToImage": null, "publishedAt": "2020-04-25T08:26:15Z", "content": "Two women travelling in separate cars have died and a young man has been seriously injured after a three-vehicle crash in Adelaide leaving debris strewn for hundreds of metres. Emergency services including SA Police, a HAZMAT response team, paramedics and the… [+1338 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Farrah Tomazin", "title": "Ahead of the curve: five other countries winning the battle against coronavirus - The Age", "description": "Countries that succeed in tackling their infection rates  - such as Australia - have many different challenges but one common enemy - the coronavirus. We look at five places that acted early and tested widely in the fight against the pandemic.", "url": "https://www.smh.com.au/world/asia/ahead-of-the-curve-five-other-nations-winning-the-battle-against-coronavirus-20200424-p54my1.html", "urlToImage": null, "publishedAt": "2020-04-25T08:13:29Z", "content": "Despite their proximity to the source, Taiwans 24 million residents have managed to avoid the kind of lockdowns Australians have faced.\r\nBy Friday morning, the island known for staring down Beijing had only recorded six coronavirus deaths and 427 confirmed ca… [+8257 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Rugby Australia board member to meet disgruntled former Wallaby to begin salvage job - Fox Sports", "description": "A Rugby Australia board member and one of the group of disgruntled former Wallabies captains are set to meet on Monday, as the troubled code tries to find unity.", "url": "https://www.foxsports.com.au/rugby/rugby-australia-board-member-to-meet-disgruntled-former-wallaby-to-begin-salvage-job/news-story/3e9ba5ac836bd1b8e6320c6cced3fcc3", "urlToImage": null, "publishedAt": "2020-04-25T07:59:00Z", "content": "The 10 former Wallabies skippers sent a letter expressing their discontent over the state of rugby in Australia to RA last week, a few days before chief executive Raelene Castle stood down.\r\nThey said Australian rugby had lost its way and had suffered from po… [+2661 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Coronavirus update: WHO warns against using 'immunity passports', Sri Lanka goes back into lockdown, Australia reports two more COVID-19 deaths - ABC News", "description": "The World Health Organization says there is no evidence that people who have recovered from COVID-19 are protected from a second infection.", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-update-australia-covid19-donald-trump-sri-lanka/12183558", "urlToImage": null, "publishedAt": "2020-04-25T07:57:43Z", "content": "Updated \r\nApril 25, 2020 23:47:51\r\nThe World Health Organization has warned against issuing \"immunity passports\" to people who have been infected with COVID-19 and recovered, saying there is \"no evidence\" that antibodies protect someone from a second infectio… [+20206 chars]"}, {"source": {"id": null, "name": "Riverbender.com"}, "author": null, "title": "Russian cargo ship docks with space station - RiverBender.com", "description": "MOSCOW (AP) — An unmanned Russian cargo capsule docked with the International Space Station, bringing more than 2 tons of supplies to the three-person", "url": "https://www.riverbender.com/sports-news/details.cfm?id=302363", "urlToImage": null, "publishedAt": "2020-04-25T07:37:31Z", "content": "MOSCOW (AP) An unmanned Russian cargo capsule docked with the International Space Station, bringing more than 2 tons of supplies to the three-person crew.\r\nThe Progress spacecraft docked at 0512 GMT Saturday, about 3 1/2 hours after blasting off from Russias … [+242 chars]"}, {"source": {"id": null, "name": "Couriermail.com.au"}, "author": "Janelle Miles", "title": "Qld health authorities trying to track Virgin passengers after coronavirus diagnosis - Courier Mail", "description": "QUEENSLAND recorded just 16 new cases of pandemic coronavirus in the past week, including a passenger on a Virgin Australia flight into Brisbane from Melbourne.", "url": "https://www.couriermail.com.au/coronavirus/qld-health-authorities-trying-to-track-virgin-passengers-seated-near-someone-who-later-tested-positive-to-the-novel-coronavirus/news-story/99e019f7d2757638cb147813bcae2280", "urlToImage": null, "publishedAt": "2020-04-25T07:28:00Z", "content": "QUEENSLAND recorded just 16 new cases of pandemic coronavirus in the past week, including a passenger on a Virgin Australia flight into Brisbane from Melbourne.\r\nPublic Health authorities are still trying to track down passengers from flight VA341 last Monday… [+2831 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Coronavirus Australia live updates: National death toll rises; Donald Trump shocks with disinfectant injection musing - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T07:26:00Z", "content": null}, {"source": {"id": null, "name": "Couriermail.com.au"}, "author": null, "title": "Miner, his workmates and the false COVID-19 tests - Chronicle", "description": "Subscribe to The Courier-Mail to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.couriermail.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T06:46:00Z", "content": null}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Lucy Mae Beers", "title": "South Australia has zero new coronavirus cases for third day in a row - 7NEWS.com.au", "description": "A total of 92 per cent of people infected in the state have recovered.", "url": "https://7news.com.au/lifestyle/health-wellbeing/south-australia-has-zero-new-coronavirus-cases-for-third-day-in-a-row-c-999085", "urlToImage": null, "publishedAt": "2020-04-25T06:17:36Z", "content": "South Australia has recorded zero new coronavirus cases for the third day in a row.\r\nOn Saturday, Acting Chief Medical Officer Dr Michael Cusack gave an update saying the 438 cases in the state remains the same.\r\nA total of 92 per cent of people infected in t… [+316 chars]"}, {"source": {"id": null, "name": "Digitalinformationworld.com"}, "author": "Arooj Ahmed", "title": "A Researcher Created A Website Highlighting What A Smartphone sees While Using Bluetooth And Discovered One Of The Biggest Challenges COVID-19 Tracking Technology Will Face - Digital Information World", "description": "One of the hurdles in the creation of this technology is that Bluetooth also detects devices through walls or other bodies that may not transmit the virus.", "url": "https://www.digitalinformationworld.com/2020/04/website-delenates-what-a-smartphone-sees-while-using-bluetooth-and-challenges-covid-19-tracking-technology-will-face.html", "urlToImage": null, "publishedAt": "2020-04-25T06:06:04Z", "content": "<ul><li>Claudio Guarnieri, an artist and security researcher created a website visualizing what a smartphone sees while the Bluetooth is turned on.</li><li>Apple and Google are creating a contact tracing technology to trace COVID-19 spread using Bluetooth ins… [+2045 chars]"}, {"source": {"id": null, "name": "Executivetraveller.com"}, "author": "David Flynn", "title": "Virgin Australia Mk II could launch in as little as three months - Executive Traveller", "description": "Virgin's administrators want to see a new owner in place by the end of June.", "url": "https://www.executivetraveller.com/news/virgin-australia-could-be-flying-again-in-as-little-as-three-months", "urlToImage": null, "publishedAt": "2020-04-25T05:11:14Z", "content": "A reborn Virgin Australia could be flying in as little as three months, with administrators seeking to lock down offers from potential new owners by the middle of June.\r\n\"This is not intended to be a long protracted process,\" Deloitte partner and administrato… [+6253 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": null, "title": "Agustin Pichot queries secretive voting system in World Rugby election - Stuff.co.nz", "description": "New Zealand-backed rival for Bill Beaumont's job would prefer 'a show of hands at our next council meeting'.", "url": "https://i.stuff.co.nz/sport/rugby/all-blacks/121274381/agustin-pichot-queries-secretive-voting-system-in-world-rugby-election", "urlToImage": null, "publishedAt": "2020-04-25T04:25:00Z", "content": "The World Rugby vice-chairman, Agustin Pichot, has called for greater transparency in the process to elect a new chairman that begins on Monday.\r\n The Argentine is standing against chairman Sir Bill Beaumont and has told The Telegraph that he would prefer to … [+2072 chars]"}, {"source": {"id": null, "name": "Fool.com.au"}, "author": null, "title": "3 ASX dividend shares to own in retirement - Motley Fool Australia", "description": "Looking for income in retirement? Here are three quality ASX shares which I believe offer a great source of income for retirees.", "url": "https://www.fool.com.au/2020/04/25/3-asx-dividend-shares-to-own-in-retirement/", "urlToImage": null, "publishedAt": "2020-04-25T04:06:19Z", "content": "I believe ASX dividend shares offer retirees the most valuable source of income. True, share prices can be volatile. And many have been due to the recent coronavirusbear market.\r\nBut many are still paying out dividends to investors despite lower share prices.… [+3868 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": null, "title": "Coronavirus NSW: Aged care worker tests positive for COVID-19 - Daily Telegraph", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.dailytelegraph.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T03:18:00Z", "content": null}, {"source": {"id": null, "name": "Newidea.com.au"}, "author": "New Idea", "title": "Stunning claim made about Meghan Markle and her father in court - New Idea", "description": "A shock new claim has been made about the Duchess of Sussex and her estranged father Thomas Markle.", "url": "https://www.newidea.com.au/stunning-claim-made-about-meghan-markle-and-her-father-in-court", "urlToImage": null, "publishedAt": "2020-04-25T00:33:00Z", "content": "It has been claimed that Meghan Markle has not seen her father Thomas in two years.\r\nLawyers for the the royal husband and wife claim the letters publication was a misuse of private information and breached her copyright.\r\nThe publication of the letter is cla… [+1059 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "", "title": "Anzac Day 2020: Australia and New Zealand come together in isolation – in pictures - The Guardian", "description": "From driveway ceremonies to backyard buglers, Australians and New Zealanders marked Anzac Day in lockdown", "url": "https://www.theguardian.com/news/gallery/2020/apr/25/anzac-day-2020-australia-and-new-zealand-come-together-in-isolation", "urlToImage": null, "publishedAt": "2020-04-24T23:47:00Z", "content": "From driveway ceremonies to backyard buglers, Australians and New Zealanders marked Anzac Day in lockdown. Some gathered, far apart, on beaches. Others lined residential streets, standing in front of their homes with wreaths and poppies and candles to honour … [+167 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/abc-local/sophie-kesteven/7149610", "title": "Raquel is working from home during coronavirus — and that means sloths in the spare room - ABC News", "description": "Working from home means different things for different people. For Raquel, it means moving three very lazy — but very cute — new housemates into the spare room.", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-panama-working-from-home-with-sloths/12169922", "urlToImage": null, "publishedAt": "2020-04-24T22:29:37Z", "content": "Updated \r\nApril 25, 2020 08:23:26\r\nWorking from home is the new normal for many people and for Raquel Cruz Alpizar, it's meant moving three unlikely new housemates into her spare room.\r\nSince coronavirus restrictions took hold, she's been caring around the cl… [+6272 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": null, "title": "Captain Tom Moore becomes oldest person to top Britain's music chart - The Age", "description": "A World War II veteran who raised millions for charity has now become the oldest person to top Britain's main music chart.", "url": "https://www.smh.com.au/world/europe/captain-tom-moore-becomes-oldest-person-to-top-britain-s-music-chart-20200425-p54n4v.html", "urlToImage": null, "publishedAt": "2020-04-24T20:40:50Z", "content": "He also went to No.1 on the music charts - with a little help from a friend.\r\nThe cover version of You'll Never Walk Alone that Moore appears on with singer Michael Ball was on course to be pipped by The Weeknd's Blinding Lights, until the Canadian star asked… [+1312 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Apple Starts iPhone SE 2020 Sales in 40 Countries - Somag News", "description": "Apple, which introduced a surprisingly new generation iPhone SE model in the past days, has now started the first sales of the device in 40 countries. In the first wave, supply is expected to be limited, but most customers who pre-ordered on April 17 are said…", "url": "https://www.somagnews.com/apple-starts-iphone-se-2020-sales-40-countries/", "urlToImage": null, "publishedAt": "2020-04-24T19:51:00Z", "content": "Apple, which introduced a surprisingly new generation iPhone SE model in the past days, has now started the first sales of the device in 40 countries. In the first wave, supply is expected to be limited, but most customers who pre-ordered on April 17 are said… [+1666 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "Spain reports more recovered than infected - NEWS.com.au", "description": "Spain reports more recovered than infected", "url": "https://www.news.com.au/world/breaking-news/spain-reports-more-recovered-than-infected/news-story/a50378884c6754e3874e418e94e174a5", "urlToImage": null, "publishedAt": "2020-04-24T13:26:39Z", "content": "Spanish health authorities are reporting that, for the first time since the beginning of the coronavirus outbreak there, more people are being diagnosed as cured than those falling sick.On Friday, there were 2796 new infections confirmed while 3105 overcame t… [+398 chars]"}, {"source": {"id": null, "name": "Theconversation.com"}, "author": "Rodger I. Thompson", "title": "How the Hubble Space Telescope opened our eyes to the first galaxies of the universe - The Conversation US", "description": "Thirty years ago the Hubble Space Telescope began snapping photos of distant stars, providing a time machine that has taken astronomers back to when the universe was less than a billion years old.", "url": "https://theconversation.com/how-the-hubble-space-telescope-opened-our-eyes-to-the-first-galaxies-of-the-universe-133877", "urlToImage": null, "publishedAt": "2020-04-24T12:22:00Z", "content": "The Hubble Space Telescope launched on the 24th of April, 30 years ago. Its an impressive milestone especially as its expected lifespan was just 10 years.\r\nOne of the primary reasons for the Hubble telescopes longevity is that it can be serviced and improved … [+6948 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Raelene Castle was simply the scapegoat, says Andrew Forrest - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-24T12:15:00Z", "content": null}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "Bang Showbiz", "title": "Tom Hanks gifts Corona-branded typewriter to bullied Australian boy named Corona - PerthNow", "description": "The actor sent a heartwarming letter and gift to a young Australian boy named Corona after he revealed he had been bullied over his moniker.", "url": "https://www.perthnow.com.au/entertainment/celebrity-gossip/tom-hanks-gifts-corona-branded-typewriter-to-bullied-australian-boy-named-corona-ng-b881529498z", "urlToImage": null, "publishedAt": "2020-04-24T07:38:48Z", "content": "Tom Hanks has sent a typewriter to a young Australian boy named Corona after he revealed he had been bullied over his moniker.\r\nThe Castaway actor wrote a kind note to eight-year-old Corona De Vries after the young Australian sent him a letter when he and wif… [+1519 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Melissa Cunningham", "title": "'Things can change quickly': Complacency warning as infections drop - The Age", "description": "As Victoria's rate of coronavirus infection falls again, Chief Health Officer warns second wave of cases could happen anytime if social distancing is relaxed.", "url": "https://www.theage.com.au/national/victoria/things-can-change-quickly-complacency-warning-as-infections-drop-20200424-p54mzh.html", "urlToImage": null, "publishedAt": "2020-04-24T07:24:37Z", "content": "There were no new community transmission infections in Victoria as of Friday morning, with the number of those cases stable at 135.\r\nTwenty-seven people remain in hospital, including 11 people in intensive care.\r\nAsked if Victoria's tally might continue to tr… [+1892 chars]"}, {"source": {"id": null, "name": "Onestepoffthegrid.com.au"}, "author": "Sophie Vorrath", "title": "NSW paves way for more – and bigger – rooftop solar systems - One Step Off The Grid", "description": "NSW government unveils further relaxations to renewable energy development policy, paving way for installation of larger residential and commercial rooftop solar systems.", "url": "https://onestepoffthegrid.com.au/nsw-paves-way-for-more-and-bigger-rooftop-solar-systems/", "urlToImage": null, "publishedAt": "2020-04-24T01:21:37Z", "content": "The New South Wales government has unveiled further relaxations to laws governing renewable energy development, paving the way for the installation of larger residential and commercial rooftop solar systems across the state.\r\nThe new amendments to the State E… [+2992 chars]"}]}