{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Theguardian.com"}, "author": "Naaman Zhou, Josh Taylor", "title": "Australia coronavirus update latest: Anzac Day dawn services marked in isolation – live news - The Guardian", "description": "Australians mark Gallipolli landing in driveway services under physical distancing rules as nationwide Covid-19 testing kicks off", "url": "https://www.theguardian.com/news/live/2020/apr/25/australia-coronavirus-latest-updates-nsw-victoria-queensland-covid-19-testing-latest-news", "urlToImage": null, "publishedAt": "2020-04-25T00:32:00Z", "content": "Australians mark Gallipolli landing in driveway services under physical distancing rules as nationwide Covid-19 testing kicks off"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "Coronavirus Australia: Everything Scott Morrison announced Friday: social gathering rules, testing - NEWS.com.au", "description": "Coronavirus Australia: Everything Scott Morrison announced on Friday", "url": "https://www.news.com.au/national/coronavirus-australia-everything-scott-morrison-announced-today/news-story/8bf8de9bceeec13afba550d48589aa98", "urlToImage": null, "publishedAt": "2020-04-25T00:29:19Z", "content": "Prime Minister Scott Morrison highlighted how suppression of coronavirus in Australia was working, while addressing several other issues on Friday.Mr Morrison noted “the good progress that has been made”, pointing out how NSW was now encouraging anyone with s… [+4067 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Baked beans an unlikely nutrition star, and pandemic hit - Health - ABC News", "description": "While baked beans might not look particularly sexy, they're a favourite among nutrition experts. Here's why.", "url": "https://www.abc.net.au/news/health/2020-04-25/baked-beans-an-unlikely-nutrition-star/12176974", "urlToImage": null, "publishedAt": "2020-04-25T00:17:11Z", "content": "As we all fight our inner \"prepper\" and try not to succumb to panic buying, it seems many of us have turned to an old favourite: baked beans.\r\nBean production at Australia's largest fruit and vegetable cannery in Shepparton, Victoria, has doubled its usual vo… [+5001 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/hannah--reich/9151774", "title": "TikTok offers connection, comedy and creativity during coronavirus lockdown - ABC News", "description": "The social video sharing app once seemed just for teenagers but since social isolation started, more and more people are joining TikTok for connection, comedy and creativity.", "url": "https://www.abc.net.au/news/2020-04-25/turning-to-tiktok-during-coronavirus-lockdown/12176814", "urlToImage": null, "publishedAt": "2020-04-24T23:57:27Z", "content": "Posted \r\nApril 25, 2020 09:19:12\r\n\"If it wasn't for coronavirus, I wouldn't have downloaded it and the fact that I have makes me feel a little bit embarrassed,\" says Hannah Baker, a new TikTok devotee.\r\nThe 27-year-old judge's associate says one thing that go… [+7054 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Dom Phillips", "title": "Justice minister's resignation plunges Brazil into turmoil - The Guardian", "description": "President Jair Bolsonaro denies he sought to influence federal police inquiries", "url": "https://www.theguardian.com/world/2020/apr/24/justice-ministers-sacking-plunges-brazil-into-turmoil", "urlToImage": null, "publishedAt": "2020-04-24T23:40:46Z", "content": "Brazils government has been plunged into turmoil after the resignation of one of Jair Bolsonaros most powerful ministers sparked protests, calls for the presidents impeachment and an investigation into claims he had improperly interfered in the countrys feder… [+3829 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/baz--ruddick/10119472", "title": "Veteran strives to name 72 unmarked graves of servicemen who died 'shell-shocked' in mental asylum - ABC News", "description": "A veteran discovers 72 unmarked war graves at a cemetery west of Brisbane, working tirelessly to identify the lost servicemen and get plaques placed on their final resting place.", "url": "https://www.abc.net.au/news/2020-04-25/queensland-anzac-war-graves-qld-matthew-rennie/12183570", "urlToImage": null, "publishedAt": "2020-04-24T23:32:19Z", "content": "Updated \r\nApril 25, 2020 10:17:53\r\nIn an Australian Imperial Force (AIF) plot at the Ipswich General Cemetery, west of Brisbane, lay 72 servicemen who died forgotten in unmarked graves and without commemoration. \r\nThe men, who returned after serving in World … [+5970 chars]"}, {"source": {"id": null, "name": "Couriermail.com.au"}, "author": null, "title": "Man dead after horror crash wipes out power at busy Logan intersection - Courier Mail", "description": "Subscribe to The Courier-Mail to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.couriermail.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-24T23:31:43Z", "content": null}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Michelle Starr", "title": "Scientists Capture Incredibly Rare Video of Humpback Whales Nursing Their Calves - ScienceAlert", "description": "Whales, as we all know, are different from most other sea creatures. They are mammals, and give birth to live babies… and then they nurture and raise those babies, nursing them on rich, fatty milk so they can grow big and strong.", "url": "https://www.sciencealert.com/scientists-have-captured-rare-video-of-humpback-mothers-nursing-their-calves", "urlToImage": null, "publishedAt": "2020-04-24T23:05:25Z", "content": "Whales, as we all know, are different from most other sea creatures. They are mammals, and give birth to live babies and then they nurture and raise those babies, nursing them on rich, fatty milk so they can grow big and strong.\r\nBut we can't just put whales … [+2841 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Summer Woolley", "title": "Eastern Freeway crash: Richard Pusey has Melbourne home vandalised - 7NEWS.com.au", "description": "The home of the Porsche driver who allegedly fled the scene of a deadly car crash has been vandalised overnight.", "url": "https://7news.com.au/news/disaster-and-emergency/eastern-freeway-crash-richard-pusey-has-melbourne-home-vandalised-c-998676", "urlToImage": null, "publishedAt": "2020-04-24T22:34:34Z", "content": "The home of the Porsche driver who allegedly fled the scene of a deadly car crash has been vandalised overnight.\r\nThe word DIE was seen spray-painted across the roller door of Richard Puseys home on Saturday morning.\r\nThe 41-year-old is accused of fleeing the… [+1215 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Coronavirus update: World unites for WHO vaccine plan, US death toll passes 50,000 and more people recover in Spain than are diagnosed - ABC News", "description": "Leaders from around the world sign up to a WHO collaboration to speed up the development of tests and treatments, however the US chooses not to be involved. Meanwhile, Spain rejoices as more people recover from coronavirus than are diagnosed with it.", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-update-australia-covid19-who-global-initiative/12183558", "urlToImage": null, "publishedAt": "2020-04-24T22:30:31Z", "content": "Updated \r\nApril 25, 2020 08:07:58\r\nLeaders from around the globe have joined the World Health Organisation for a virtual meeting in which they pledged their support for a collaboration to speed up the development of treatments for COVID-19, though the US was … [+11703 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/tracey-shelton/9323988", "title": "Captain Tom Moore becomes oldest artist to top the UK charts with You'll Never Walk Alone cover - ABC News", "description": "Captain Tom Moore, the British Army veteran who raised more than $55 million for Britain's National Health Service, tops the UK music charts with a cover of You'll Never Walk Alone.", "url": "https://www.abc.net.au/news/2020-04-25/captain-tom-moore-number-1-youll-never-walk-alone-coronavirus/12180754", "urlToImage": null, "publishedAt": "2020-04-24T22:30:20Z", "content": "Updated \r\nApril 25, 2020 08:26:39\r\nCaptain Tom Moore, the British Army veteran who raised more than $55 million for Britain's National Health Service (NHS), has become the oldest artist to claim a UK number one single, topping the music charts on the week of … [+3700 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Latika Bourke, Sally Rawsthorne", "title": "Coronavirus updates LIVE: Scott Morrison says social distancing won't apply to schools, global COVID-19 cases surpass 2.7 million, Australian death toll stands at 79 - The Sydney Morning Herald", "description": "If you suspect you or a family member has coronavirus you should call (not visit) your GP or ring the national Coronavirus Health Information Hotline on 1800 020 080.", "url": "https://www.smh.com.au/national/coronavirus-updates-live-scott-morrison-says-social-distancing-won-t-apply-to-schools-global-covid-19-cases-surpass-2-7-million-australian-death-toll-stands-at-79-20200424-p54n21.html", "urlToImage": null, "publishedAt": "2020-04-24T22:20:00Z", "content": "The total number of people hospitalised statewide continues to drop slowly, hitting 14,258, though the number of new patients coming into hospitals is basically flat at around 1300, Cuomo said.\r\nWhile the overall trends provide some hope, the governor continu… [+541 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/simon-smale/10007892", "title": "Coronavirus Australia live news: - ABC News", "description": "US President Donald Trump says his widely ridiculed musings on whether injecting disinfectants could cure coronavirus were posed sarcastically as medical experts urge people not to drink or inject disinfectant. Follow live.", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-australia-live-news-covid-19-latest/12183378", "urlToImage": null, "publishedAt": "2020-04-24T21:13:12Z", "content": "This service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\r\nAEST = Australian Eastern Standard Time which is 10 hours ahead of GMT (Greenwich Mean Time)"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Alexis Carey", "title": "Woolworths: Renovatio’s ‘surreal’ $5 million vitamins deal with supermarket - NEWS.com.au", "description": "Woolworths: Renovatio’s ‘surreal’ $5 million vitamins deal with supermarket", "url": "https://www.news.com.au/finance/business/retail/woolworths-renovatios-surreal-5-million-vitamins-deal-with-supermarket/news-story/a39f8f664142827789fea67c1b00186f", "urlToImage": null, "publishedAt": "2020-04-24T20:50:16Z", "content": "Dr Vincent Candrawinatas grandmother went from being a passionate ballroom dancer to virtually housebound as rheumatoid arthritis took its devastating toll.The young scientist was in the middle of groundbreaking research at the University of Newcastle when hi… [+3651 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Olivia Willis", "title": "When coronavirus patients suddenly decline, their own immune system might be to blame - ABC News", "description": "In some cases of COVID-19, it may be the body's response to the virus, rather than the virus itself, that ultimately causes harm.", "url": "https://www.abc.net.au/news/health/2020-04-25/coronavirus-covid-immune-response-causes-harm/12176872", "urlToImage": null, "publishedAt": "2020-04-24T20:30:29Z", "content": "It's been described as the \"second week crash\".\r\nAbout seven days after developing symptoms of COVID-19, some people even those with mild symptoms can suddenly start to deteriorate, often with little warning.\r\n\"They end up getting admitted to hospital, and ab… [+6217 chars]"}, {"source": {"id": null, "name": "Thenewdaily.com.au"}, "author": "https://www.facebook.com/TheNewDaily", "title": "Australian doctor among the first injected in coronavirus vaccine trial - The New Daily", "description": "Australian doctor Edward O'Neill believes taking part in a UK coronavirus vaccine trial is the right thing to do but admits he's taking a \"walk in faith\".", "url": "https://thenewdaily.com.au/news/national/2020/04/25/coronavirus-vaccine-australian-doctor/", "urlToImage": null, "publishedAt": "2020-04-24T19:52:30Z", "content": "An Australian doctor is one of the first two people in the world to be injected in human trials for a potential coronavirus vaccine which could be rolled out this year.\r\nSydney man Dr Edward O’Neill, who moved to the UK two years ago, has turned guinea pig fo… [+5466 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "George Dvorsky", "title": "NASA Rocket Scientists Designed A Rapid-Production Ventilator In Just 37 Days - Gizmodo Australia", "description": "Introducing VITAL, a prototype ventilator designed expressly for quick and easy mass production. Developed by NASA engineers, the device could alleviate ongoing supply shortages in the U.S. and around the world as the covid-19 pandemic rages on....", "url": "https://www.gizmodo.com.au/2020/04/nasa-rocket-scientists-designed-a-rapid-production-ventilator-in-just-37-days/", "urlToImage": null, "publishedAt": "2020-04-24T19:30:00Z", "content": "Introducing VITAL, a prototype ventilator designed expressly for quick and easy mass production. Developed by NASA engineers, the device could alleviate ongoing supply shortages in the U.S. and around the world as the covid-19 pandemic rages on.\r\nNASA has cop… [+3078 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": null, "name": "Zdnet.com"}, "author": "Daphne Leprince-Ringuet", "title": "Coronavirus contact-tracing app: Here’s how we’ll protect your privacy, says NHS - ZDNet", "description": "NHS insists the public's data is safe in the hands of the health services. Privacy campaigners want more detail.", "url": "https://www.zdnet.com/article/coronavirus-contact-tracing-app-heres-how-well-protect-your-privacy-says-nhs/", "urlToImage": null, "publishedAt": "2020-04-24T14:18:00Z", "content": "To earn the trust of the public, privacy will be fundamental to the building the coronavirus contact-tracing app that the UK government is working on, NHSX boss Matthew Gould has said in a new post detailing the organization's commitment to confidentiality - … [+6376 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Patrick Hatch, Sarah Danckert", "title": "The week that Virgin Australia hit the ground hard - Sydney Morning Herald", "description": "After its hopes of help from the Morrison government were dashed, Virgin Australia has no easy way back into the air.", "url": "https://www.smh.com.au/business/companies/the-week-that-virgin-australia-hit-the-ground-hard-20200423-p54mhp.html", "urlToImage": null, "publishedAt": "2020-04-24T14:03:50Z", "content": "Normal text sizeLarger text sizeVery large text size\r\nIt was getting close to 8pm on Thursday, April 16, when Paul Scurrah finally accepted the airline he leads was unlikely to avoid financial collapse. The Virgin Australia chief executive was attending a vir… [+11656 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Aussies should brace for rolling lockdowns in years ahead - Big Rigs", "description": "Australia is preparing to cautiously lift the first virus restrictions next week – but a return to “normal” could still be years away.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-aussies-should-brace-for-rolling-lockdowns-in-years-ahead/news-story/8847b0e8f896994785239983a0e91880", "urlToImage": null, "publishedAt": "2020-04-24T11:15:08Z", "content": "ANALYSIS\r\nBrace yourselves: We're going to need more lockdowns to get on top of COVID-19.\r\nEconomists used to dream of exponential growth in relation to the economy. But that same explosive effect seems set to doom us to rolling lockdowns for years to come.\r\n… [+5660 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Australian Associated Press", "title": "Broadcasters agree to May 28 NRL restart, says Peter V'landys - The Guardian", "description": "ARL Commission chairman Peter V’landys has reiterated the NRL competition intends to resume on 28 May and the length of the season will be determined next week", "url": "https://www.theguardian.com/sport/2020/apr/24/nrl-2020-season-return-plans", "urlToImage": null, "publishedAt": "2020-04-24T10:29:57Z", "content": "The structure of a revised NRL competition is imminent after television broadcasters agreed to recognise 28 May as the optimal season restart date. After a high-powered meeting on Friday, Channel Nine and Foxtel could not reach an agreement on the length of t… [+2613 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Tom Bedford", "title": "The new iPhone SE is on sale today: here's how you can get one - TechRadar", "description": "No premium prices here", "url": "https://www.techradar.com/news/the-new-iphone-se-is-out-today-and-heres-how-you-can-get-one", "urlToImage": null, "publishedAt": "2020-04-24T10:09:00Z", "content": "Apple's new iPhone SE is available to buy now around the world. If you've been waiting to pick up a new iPhone that doesn't cost as much as a member of the iPhone 11 range, now is the time to do it.\r\nThe new iPhone SE has a 4.7-inch screen, the modern A13 Bio… [+987 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Australian Associated Press", "title": "'My soulmate has gone': Victorian police officer loved helping people, grieving partner says - The Guardian", "description": "Partner of Constable Glen Humphris says he should be remembered as someone who lit up the room and loved his job", "url": "https://www.theguardian.com/australia-news/2020/apr/24/my-soulmate-has-gone-victorian-police-officer-loved-helping-people-grieving-partner-says", "urlToImage": null, "publishedAt": "2020-04-24T09:34:00Z", "content": "Police officer Glen Humphris was so proud to be a policeman and should be remembered for his bubbly nature and infectious smile, his grieving partner says.\r\nTodd Robinson, the partner of Constable Humphris, who was tragically killed with three colleagues on t… [+1623 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Georgina Robinson", "title": "The final betrayal that caused Castle to crumble - Sydney Morning Herald", "description": "When RA chief executive Raelene Castle agreed to a pre-recorded TV interview on Thursday, little did she know she would be out of the job by the end of the day.", "url": "https://www.smh.com.au/sport/rugby-union/the-final-betrayal-that-caused-castle-to-crumble-20200424-p54n2u.html", "urlToImage": null, "publishedAt": "2020-04-24T09:19:22Z", "content": "The answer from McLean on Thursday morning was 'no'. What the respected former Wallabies captain meant was 'nothing in the next 48 hours'.\r\nWhat is now clear, acknowledge by McLean and confirmed by another board source, was that the interim chairman and the s… [+4801 chars]"}, {"source": {"id": null, "name": "Fool.com.au"}, "author": null, "title": "Why smart investors are buying cheap dividend stocks right now - Motley Fool Australia", "description": "Dividend stocks could offer high income returns relative to other assets, as well as growing shareholder payouts over the long run.", "url": "https://www.fool.com.au/2020/04/24/why-smart-investors-are-buying-cheap-dividend-stocks-right-now/", "urlToImage": null, "publishedAt": "2020-04-24T08:46:13Z", "content": "Buying dividend stocks after a market crash could prove to be a worthwhile move over the long run. At the present time, a number of dividend stocks offer high yields compared to their historic levels. In an era when the returns of other assets could fail to k… [+4107 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Megan Gorrey, Angus Thompson, Matt Bungard", "title": "'Very few people are actually exercising': Sydney beaches closed due to crowds - Sydney Morning Herald", "description": "The beaches were open for exercise, but the council said too many people were there simply \"having a splash\".", "url": "https://www.smh.com.au/national/nsw/coogee-and-maroubra-beaches-shut-due-to-crowds-20200424-p54mz6.html", "urlToImage": null, "publishedAt": "2020-04-24T08:26:59Z", "content": "\"The vast majority of people are very conscious of the fact it's important to keep their distance,\" Cr Byrne said. \"But it's a big challenge because people need to be able to get outside to exercise.\"\r\nThe council has decided to turn on floodlights at multipl… [+2918 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Wenlei Ma", "title": "Defending Jacob TV review: Chris Evans’ splashy new Apple TV+ series - NEWS.com.au", "description": "Chris Evans leads splashy Apple TV series, Defending Jacob", "url": "https://www.news.com.au/entertainment/tv/tv-shows/chris-evans-leads-splashy-apple-tv-series-defending-jacob/news-story/8a1090ed6067bcb3337ebc5c6a2e375b", "urlToImage": null, "publishedAt": "2020-04-24T08:19:44Z", "content": "From the outside, the Barbers seem like a blessed family.Dad Andy is a successful prosecutor, mum Laurie works with traumatised kids and son Jacob, 14, attends the local middle school in an upper-middle class Boston community where we’re told every second par… [+3627 chars]"}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "Bang Showbiz", "title": "Tom Hanks gifts Corona-branded typewriter to bullied Australian boy named Corona - PerthNow", "description": "The actor sent a heartwarming letter and gift to a young Australian boy named Corona after he revealed he had been bullied over his moniker.", "url": "https://www.perthnow.com.au/entertainment/celebrity-gossip/tom-hanks-gifts-corona-branded-typewriter-to-bullied-australian-boy-named-corona-ng-b881529498z", "urlToImage": null, "publishedAt": "2020-04-24T07:38:48Z", "content": "Tom Hanks has sent a typewriter to a young Australian boy named Corona after he revealed he had been bullied over his moniker.\r\nThe Castaway actor wrote a kind note to eight-year-old Corona De Vries after the young Australian sent him a letter when he and wif… [+1519 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Apple says ‘no evidence’ a flaw in iPhone email app is security risk for customers - 7NEWS.com.au", "description": "A flaw in an iPhone email app has been exposed but Apple says there is no security risk to its more than half a billion users.", "url": "https://7news.com.au/technology/apple-says-no-evidence-a-flaw-in-iphone-email-app-is-security-risk-for-customers-c-997338", "urlToImage": null, "publishedAt": "2020-04-24T07:01:00Z", "content": "Apple Inc says it has found no evidence a flaw in its email app for iPhones and iPads has been used against customers.\r\nAnd it believes the flaw does not pose an immediate risk to our users.\r\nWatch the video above\r\nSan Francisco-based security firm ZecOps on … [+1400 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Coronavirus outbreak at Victorian psychiatric facility being investigated by health authorities - ABC News", "description": "Victorian health authorities are investigating a coronavirus outbreak at a private psychiatric facility which has resulted in at least 14 confirmed cases of the virus so far.", "url": "https://www.abc.net.au/news/2020-04-24/coronavirus-outbreak-at-psychiatric-facility-in-victoria-covid19/12180212", "urlToImage": null, "publishedAt": "2020-04-24T05:40:34Z", "content": "Updated \r\nApril 24, 2020 16:52:29\r\nVictorian health authorities are investigating a coronavirus outbreak at a private psychiatric facility which has resulted in at least 14 confirmed cases of the virus so far.\r\nKey points:\r\n<ul><li>Health authorities have con… [+5396 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "'Emotional and psychological issues' brought down my Arsenal career, says Denilson - The World Game", "description": "Former Arsenal midfielder Denilson revealed how his struggles with mental health ultimately led to him quitting the club.", "url": "https://theworldgame.sbs.com.au/emotional-and-psychological-issues-brought-down-my-arsenal-career-says-denilson", "urlToImage": null, "publishedAt": "2020-04-24T05:00:00Z", "content": "Denilson, a former captain of Brazil at youth level, never fulfilled his potential after joining the Gunners in 2006 and spoke about how poor mental health and culture shock impacted his career in London.\r\n\"I suffered a lot, honestly,\" the 32-year-old told Th… [+2538 chars]"}, {"source": {"id": null, "name": "Espn.com.au"}, "author": "Ben Baby", "title": "No. 1 pick Joe Burrow ready to compete to be Bengals' starting QB - ESPN Australia", "description": "Bengals coach Zac Taylor said quarterback Joe Burrow, taken with the No. 1 overall pick Thursday in the NFL draft, will be expected to compete for the team's starting job, which is how Burrow said he expected it to be.", "url": "https://www.espn.com.au/nfl/story/_/id/29089822/cincinnati-bengals-take-joe-burrow-no-1-pick-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-24T00:30:09Z", "content": "CINCINNATI -- The Cincinnati Bengals have their next franchise quarterback. And the task ahead of him could not be any clearer.\r\nMonths of speculation ended Thursday night when the Bengals selected former LSU standout Joe Burrow with the first overall pick in… [+5107 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "CNN", "title": "Giant asteroid flying by Earth next week looks like it’s wearing a face mask - 7NEWS.com.au", "description": "An observatory has spotted a strange discovery on an asteroid moving at 31,000 kilometres per hour.", "url": "https://7news.com.au/technology/space/giant-asteroid-flying-by-earth-next-week-looks-like-its-wearing-a-face-mask-c-996383", "urlToImage": null, "publishedAt": "2020-04-23T23:08:10Z", "content": "An asteroid estimated to be 1.9 km wide will fly by Earth next week, but its not expected to collide with our planet.\r\nAnd if an asteroid could be aware of such things, it appears to be wearing a face mask in deference to the pandemic, according to new images… [+2912 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Coronavirus: New York antibody tests reveal more people exposed to virus than thought - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-23T22:28:00Z", "content": null}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "James O'Connor", "title": "When Does Travis Scott Come To Fortnite Today?: Concert Start Time - GameSpot", "description": "Rapper Travis Scott will be doing a virtual global tour of Fortnite in the form of the Astronomical concert tonight, performing a new track in the massive battle royale game. Here are all the show times.", "url": "https://www.gamespot.com/articles/travis-scott-fortnite-concert-when-can-i-catch-the/1100-6476241/", "urlToImage": null, "publishedAt": "2020-04-23T19:06:00Z", "content": "Fortnite: Battle Royale will host Travis Scott concert tonight that will be used to launch a new song from the rapper. The concert, called Astronomical, will involve Travis Scott dropping a new track as part of what's being called \"an other-worldly experience… [+2264 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Deloitte tightens grip on Virgin - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-23T10:45:00Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Josh Taylor", "title": "Coronavirus Australia latest: at a glance - The Guardian", "description": "A summary of the major developments in the coronavirus outbreak across Australia", "url": "https://www.theguardian.com/australia-news/2020/apr/23/coronavirus-australia-latest-at-a-glance", "urlToImage": null, "publishedAt": "2020-04-23T09:10:00Z", "content": "Good evening, and welcome to our daily roundup of the latest developments on the coronavirus pandemic in Australia. This is Josh Taylor bringing you the main stories on Thursday 23 April.\r\nRuby Princess cruise ship departs Australia\r\nThe Ruby Princess has dep… [+3494 chars]"}]}