{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Truck driver from Melbourne freeway crash hit with multiple charges over police officer deaths - ABC News", "description": "The alleged driver of a truck that crashed into and killed four Victorian police officers is hit with four major driving charges and taken into custody.", "url": "https://www.abc.net.au/news/2020-04-27/driver-of-truck-in-crash-that-killed-four-police-charged/12187792", "urlToImage": null, "publishedAt": "2020-04-26T17:02:05Z", "content": "Updated \r\nApril 27, 2020 03:46:03\r\nA 47-year-old truck driver has been charged with four counts of culpable driving causing death, in relation to the freeway crash that killed four police officers.\r\n<ul><li>The truck that crashed into police officers on the E… [+2039 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Latika Bourke", "title": "Coronavirus updates LIVE: COVIDSafe app goes live as global COVID-19 cases near 3 million, Australian death toll stands at 83 - The Sydney Morning Herald", "description": "If you suspect you or a family member has coronavirus you should call (not visit) your GP or ring the national Coronavirus Health Information Hotline on 1800 020 080.", "url": "https://www.smh.com.au/national/coronavirus-updates-live-covidsafe-app-goes-live-as-global-covid-19-cases-near-3-million-australian-death-toll-stands-at-83-20200426-p54nep.html", "urlToImage": null, "publishedAt": "2020-04-26T15:44:00Z", "content": "The UK has recorded its lowest daily death toll since March 31, with 431 new fatalities recorded in the last 24 hours. \r\nThis is almost half Saturday's daily toll of 813 meaning the next few days' data will be crucial in gauging whether the UK's outbreak is n… [+419 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "Leo Sun", "title": "Up 300% in 5 Years, How Much Higher Can Microsoft Stock Soar? - Motley Fool", "description": "The tech giant’s “mobile first, cloud first” strategy has turned it into a growth stock again.", "url": "https://www.fool.com/investing/2020/04/26/up-300-how-much-higher-can-microsoft-stock-soar.aspx", "urlToImage": null, "publishedAt": "2020-04-26T15:08:00Z", "content": "Microsoft (NASDAQ:MSFT) was once considered a mature tech stock that was owned for stability and income instead of growth. But over the past five years, Microsoft stock rallied roughly 300% as a visionary CEO turned its business upside down.\r\nSatya Nadella, w… [+4450 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Georgina Torbet", "title": "Scientists figure out why Venus’s atmosphere rotates much faster than the planet - Yahoo Tech", "description": "Japan's Akatsuki spacecraft has been investigating the planet for a decade", "url": "https://finance.yahoo.com/news/scientists-figure-why-venus-atmosphere-143303659.html", "urlToImage": null, "publishedAt": "2020-04-26T14:33:00Z", "content": "The planet Venus has some strange characteristics, but one of its oddest features is its atmosphere. Full of clouds of sulfuric acid, its thick atmosphere hides the surface of the planet and heats it so much that even though its further from the sun than Merc… [+2332 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "Coronavirus China: Wuhan COVID-19 hospital patients discharged - NEWS.com.au", "description": "Coronavirus China: Wuhan COVID-19 hospital patients discharged", "url": "https://www.news.com.au/world/coronavirus/global/coronavirus-china-wuhan-covid19-hospital-patients-discharged/news-story/65912598dfbed525f3f80a7dc652a655", "urlToImage": null, "publishedAt": "2020-04-26T14:23:04Z", "content": "The Chinese city of Wuhan, where the global coronavirus pandemic began, now has no remaining cases in its hospitals, a health official has told reporters. The novel coronavirus is believed to have originated in a wet market in Wuhan and first emerged in Decem… [+1226 chars]"}, {"source": {"id": null, "name": "Townsvillebulletin.com.au"}, "author": null, "title": "Researcher says reefs around Magnetic Island have nearly recovered from coral bleaching - Townsville Bulletin", "description": "Subscribe to the Townsville Bulletin to get unrestricted digital access, home paper delivery, Apps for iPad and Android and much more...", "url": "https://www.townsvillebulletin.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-26T14:01:56Z", "content": null}, {"source": {"id": null, "name": "Un.org"}, "author": null, "title": "Millions more children at risk with immunization services disrupted amid COVID-19 pandemic - UN News", "description": "Last year, over 13 million children received no vaccines at all, and the UN Children’s Fund (UNICEF) is calling on governments to step up, warning disrupting immunization services amid the COVID-19 pandemic could leave even more of the world’s most marginaliz…", "url": "https://news.un.org/en/story/2020/04/1062622", "urlToImage": null, "publishedAt": "2020-04-26T11:40:07Z", "content": "Making its call at the start of the 2020 edition of World Immunization Week, UNICEF said on Saturday that millions of children are in danger of missing life-saving vaccines against measles, diphtheria and polio due to disruptions in immunization service as th… [+3030 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Lexie Cartwright", "title": "MasterChef judges stunned by Reynold’s ‘magic’ dessert on tonight’s episode - NEWS.com.au", "description": "MasterChef judges stunned by Reynold’s ‘magic’ dessert on tonight’s episode", "url": "https://www.news.com.au/entertainment/tv/reality-tv/masterchef-judges-stunned-by-reynolds-magic-dessert-on-tonights-episode/news-story/fe9d82cd7cd75ec9ddc0f908e7eb8214", "urlToImage": null, "publishedAt": "2020-04-26T11:38:01Z", "content": "The new MasterChef judges have been left stunned by a magic dessert served on tonights episode.Reynold Poernomo, who came fourth in the seventh season of the cooking show and has returned for this year’s all stars series MasterChef: Back to Win, whipped up th… [+1822 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": null, "title": "Monday Buzz: State of Origin switch huge boost for NRL - Daily Telegraph", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.dailytelegraph.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-26T10:00:00Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Marta Jary For Daily Mail Australia", "title": "Love Island Australia's Vanessa Sierra bares her bust for a very risqué drive - Daily Mail", "description": "Vanessa Sierra has been pushing the envelope with her risqué social media posts of late.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258141/Love-Island-Australias-Vanessa-Sierra-bares-bust-risqu-drive.html", "urlToImage": null, "publishedAt": "2020-04-26T09:43:03Z", "content": "Vanessa Sierra has been pushing the envelope with her risqué social media posts of late.  \r\nOn Sunday, the former Love Island Australia star posted an Instagram video in which she's driving in a car with the top down, while bearing her bust. \r\nThe 25-year-old… [+2265 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "LIVE: NRL players face being forced to leave family homes in radical anti-COVID-19 protocols - Fox Sports", "description": "<b>Tune into our new show Fox League Live on Channel 502 Monday to Friday at 6.30pm and on Saturday at 3pm and Sunday at 5pm.</b>", "url": "https://www.foxsports.com.au/nrl/nrl-premiership/live-todd-greenberg-receives-hefty-pay-out-as-nrl-fights-for-survival/news-story/778c5fad077f2b2bf72be3f4250a3cf0", "urlToImage": null, "publishedAt": "2020-04-26T09:38:00Z", "content": "The NRL and the broadcasters have locked in a May 28 return, but theres plenty that needs to happen before thats a reality, with the season structure still to be decided.\r\nHere are the latest updates.\r\nWatch Foxtel in an instant. Catch up and settle in with n… [+9174 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Brittany Chain Lauren Ferri For Daily Mail Australia", "title": "Ten workers at Nepean and Sydney Adventist Hospitals quarantined after doctor caught coronavirus - Daily Mail", "description": "On Sunday, Nepean Blue Mountains Local Health District confirmed a female doctor from Nepean Hospital, at the base of the Blue Mountains in Sydney's west, tested positive for coronavirus.", "url": "https://www.dailymail.co.uk/news/article-8258071/Ten-workers-Nepean-Sydney-Adventist-Hospitals-quarantined-doctor-caught-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-26T08:42:33Z", "content": "Ten healthcare workers across two hospitals will spend the next 14 days in self-isolation after another employee tested positive to coronavirus.\r\nOn Sunday morning, Nepean Blue Mountains Local Health District confirmed a female doctor from Nepean Hospital, at… [+4220 chars]"}, {"source": {"id": null, "name": "Adelaidenow.com.au"}, "author": null, "title": "Flooding up to the footpath on Marion Rd, while farmers rejoice the end of the dry season - The Advertiser", "description": "Subscribe to The Advertiser to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.adelaidenow.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-26T07:27:00Z", "content": null}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Adam Carey", "title": "Classroom hours slashed for teaching students to avoid educator shortage - The Age", "description": "This year’s crop of teaching graduates will be allowed to enter the profession with 25 per cent less classroom experience, in response to COVID-19.", "url": "https://www.theage.com.au/national/victoria/classroom-hours-slashed-for-teaching-students-to-avoid-teacher-drought-20200426-p54ncf.html", "urlToImage": null, "publishedAt": "2020-04-26T06:24:12Z", "content": "Victorian Education Minister James Merlino said the government was adjusting placement and registration requirements to make it easier for teachers to do their work during the pandemic.\r\nWith many students now learning from home, teaching students and current… [+1618 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Conflicting reports over North Korean leader Kim Jong-un's health, possible successor - SBS News", "description": "There are conflicting reports about the health and whereabouts of North Korean leader Kim Jong-un, as well as questions over who would succeed him if he died.", "url": "https://www.sbs.com.au/news/conflicting-reports-over-north-korean-leader-kim-jong-un-s-health-possible-successor", "urlToImage": null, "publishedAt": "2020-04-26T06:00:32Z", "content": "A special train possibly belonging to North Korean leader Kim Jong-un has been spotted at a resort town in the country, according to satellite images reviewed by a Washington-based North Korea monitoring project, amid conflicting reports about Mr Kim's health… [+4112 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Denied Govt bailout, Richard Branson seeks buyer for Virgin Atlantic - Executive Traveller", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=be485430-87ab-11ea-a90c-19b1f946e45e&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNC0yNS9yaWNoYXJkLWJyYW5zb24tc2Vla2luZy1idXllci1mb3ItdmlyZ2luLWF0bGFudGljLXRlbGVncmFwaA==", "urlToImage": null, "publishedAt": "2020-04-26T05:00:00Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": null, "title": "School return plan reinforced by NSW study - The Canberra Times", "description": "There is no evidence students at NSW schools have infected staff with COVID-19, according to a study cited by the federal government in its push to reopen sch...", "url": "https://www.canberratimes.com.au/story/6735338/school-return-plan-reinforced-by-nsw-study/?cs=14264", "urlToImage": null, "publishedAt": "2020-04-26T04:45:18Z", "content": ""}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Anna Prytz", "title": "Schools 'surreal' without students - The Age", "description": "Empty classrooms and deserted playgrounds have become a strange new reality for schools around the country.", "url": "https://www.theage.com.au/national/victoria/surreal-schools-without-students-20200423-p54mfp.html", "urlToImage": null, "publishedAt": "2020-04-26T04:35:18Z", "content": "Mr Adamson said a staff member was present every day in case of a last-minute student arrival and other teachers had volunteered to come in if needed.\r\n\"Parents might get called in to work. We might get more. It'll be a week-by-week thing.\"\r\nEducation Ministe… [+1997 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Tim Elbra", "title": "Raelene Castle's exit as Rugby Australia CEO 'terrible', says Peter FitzSimons - Wide World of Sports", "description": "FitzSimons points the finger at Castle's main foe", "url": "https://wwos.nine.com.au/rugby/raelene-castle-rugby-australia-exit-terrible-peter-fitzsimons/ddb243f6-1574-45d9-b771-ef31226185f1", "urlToImage": null, "publishedAt": "2020-04-26T04:03:05Z", "content": "Raelene Castle's exit as Rugby Australia chief executive was a \"terrible\" look for the game, as was Phil Kearns' role as a chief agitator, former Wallaby Peter FitzSimons says.\r\nCastle left after losing the support of the board, but also amid claims of bullyi… [+3469 chars]"}, {"source": {"id": null, "name": "Skynews.com.au"}, "author": null, "title": "Health Minister 'disapointed' at crowds descending on Sydney beaches - Sky News Australia", "description": "Health Minister Brad Hazzard says he was “disappointed” to see beachgoers ignore the “very strong message about social distancing”. \n\nRandwick Council re-opened several eastern suburbs beaches from 6 to 9am on Saturday, allowing locals to swim, surf and run a…", "url": "https://www.skynews.com.au/details/_6151991549001", "urlToImage": null, "publishedAt": "2020-04-26T03:27:56Z", "content": null}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Coronavirus stay-at-home restrictions to be eased in Queensland - SBS News", "description": "Queensland will relax some stay-at-home restrictions from midnight on Friday with less than 100 active COVID-19 cases across the state.", "url": "https://www.sbs.com.au/news/coronavirus-stay-at-home-restrictions-to-be-eased-in-queensland", "urlToImage": null, "publishedAt": "2020-04-26T03:20:30Z", "content": "Family picnics and weekend drives are back on the agenda for Queenslanders starting next weekend after just three COVID-19 cases were recorded overnight.\r\nPremier Annastacia Palaszcuk says the easing of restrictions would start at midnight on Friday and peopl… [+3860 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "South Australian police officer, mother killed in crash - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-26T02:54:00Z", "content": null}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "9Honey Celebrity with Variety", "title": "Broadway star Nick Cordero gets temporary pacemaker after leg amputation in COVID-19 battle - 9Honey", "description": "", "url": "https://celebrity.nine.com.au/latest/broadway-nick-cordero-temporary-pacemaker-leg-amputation-coronavirus/61ccda76-569a-41e7-bede-2b7f181f473a", "urlToImage": null, "publishedAt": "2020-04-26T02:31:00Z", "content": "LOS ANGELES (Variety.com) After doctors had to amputate his right leg last week, Broadway actor Nick Cordero has had a procedure to insert a temporary pacemaker in his heart, his wife Amanda Kloots announced.\r\nKloots, 39, gave the update on 41-year-old Corder… [+3555 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "admin", "title": "Android app network removed from Google Play Store - Jimmys Post", "description": "", "url": "https://www.news.com.au/technology/gadgets/mobile-phones/android-app-network-removed-from-google-play-store/news-story/aef721ceea32ed6c6f7ca08ee43375c7/", "urlToImage": null, "publishedAt": "2020-04-26T02:14:02Z", "content": "Google has reportedly removed more than 100 apps with tens of millions of downloads after allegations the apps were part of a co-ordinated group that may have violated store policies.The group allegedly involves at least 27 separate app developers (that could… [+7911 chars]"}, {"source": {"id": null, "name": "Darkhorizons.com"}, "author": null, "title": "Tom Hanks' Blood May Help Develop Vaccine - Dark Horizons", "description": "Tom Hanks and wife Rita Wilson have volunteered to donate blood for coronavirus research after recovering from the disease. Hanks and Wilson revealed on March 11th, in Australia for pre-production of Baz Luhrmann’s untitled Elvis Presley film, that they had t…", "url": "https://www.darkhorizons.com/tom-hanks-blood-may-help-develop-vaccine/", "urlToImage": null, "publishedAt": "2020-04-25T23:50:00Z", "content": "Tom Hanks and wife Rita Wilson have volunteered to donate blood for coronavirus research after recovering from the disease.\r\nHanks and Wilson revealed on March 11th, in Australia for pre-production of Baz Luhrmann’s untitled Elvis Presley film, that they had … [+840 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "Coronavirus Australia: COVID-19 has limited transmissibility for students, NSW Health report finds - The Weekly Times", "description": "Coronavirus Australia: COVID-19 has limited transmissibility for students, NSW Health report finds", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-australia-covid19-has-limited-transmissibility-for-students-nsw-health-report-finds/news-story/1d441996a3654167226bb910277a4f68", "urlToImage": null, "publishedAt": "2020-04-25T23:38:00Z", "content": "A NSW Health report has concluded that COVID-19 has limited transmissibility between students, and from students to teachers.Chief Medical Officer Brendan Murphy cited the report on Friday at a press conference with Prime Minister Scott Morrison, who stressed… [+3141 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Bevan Shields", "title": "Boris Johnson announces return to work as Britain's COVID-19 toll passes 20,000 - The Age", "description": "The Prime Minister will confront a series of urgent decisions, including whether the United Kingdom's lockdown should be eased.", "url": "https://www.smh.com.au/world/europe/boris-johnson-announces-return-to-work-as-britain-s-covid-19-toll-passes-20-000-20200426-p54n8m.html", "urlToImage": null, "publishedAt": "2020-04-25T23:33:46Z", "content": "The timing of Johnson's return means he will have to decide whether the lockdown should be extended. The Prime Minister is reported to have told aids that he fears a second wave of the virus could strike if the lockdown is relaxed too soon.\r\nA woman takes a p… [+2487 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Anna Salleh", "title": "The fagus, Australia's only native winter deciduous tree, is turning its stunning autumn colours. What's behind that gorgeous display? - ABC News", "description": "Tasmania's deciduous beech, the fagus, is turning stunning yellow, orange and red — what makes this happen?", "url": "https://www.abc.net.au/news/science/2020-04-26/true-blue-autumn-leaves-are-turning/12147698", "urlToImage": null, "publishedAt": "2020-04-25T20:30:09Z", "content": "Every year at this time, thousands flock to national parks in Tasmania to see the stunning autumn display of Australia's only native winter deciduous tree the fagus.\r\nBut this year the state's parks are closed until further notice thanks to coronavirus, which… [+4723 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Melissa Davey", "title": "Search for answers after coronavirus strikes at heart of Tasmania’s north-west - The Guardian", "description": "Dozens of health workers were infected and thousands quarantined, stretching medical resources. But how did it spread so quickly?", "url": "https://www.theguardian.com/world/2020/apr/26/search-for-answers-after-coronavirus-strikes-at-heart-of-tasmanias-north-west", "urlToImage": null, "publishedAt": "2020-04-25T20:00:00Z", "content": "More than 1,000 Tasmanian health workers in mandatory quarantine following a Covid-19 outbreak in two hospitals are preparing to return to work but they are no closer to understanding how the virus spread so rapidly.\r\nThe secretary of the health and community… [+7365 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/steve-cannane/4823320", "title": "How the lives of poker machine addicts have improved during the coronavirus lockdown - ABC News", "description": "The coronavirus shutdown has negatively affected so many aspects of the economy, but for these Australians, the closure of pokies rooms has changed life for the better.", "url": "https://www.abc.net.au/news/2020-04-26/pokies-addicts-kick-habit-during-coronavirus-venues-shutdown/12183018", "urlToImage": null, "publishedAt": "2020-04-25T19:37:35Z", "content": "Updated \r\nApril 26, 2020 12:57:59\r\nThe coronavirus pandemic has had a devastating impact on so many Australians. \r\nIf you or anyone you know needs help:\r\nLives have been lost, jobs and businesses have been wiped out, and individuals have had to come to grips … [+7985 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Gareth Beavis", "title": "iPhone SE 2020 teardown reveals intriguing facts about battery and camera - TechRadar", "description": "Things are more similar than we anticipated", "url": "https://www.techradar.com/news/iphone-se-2020-teardown-reveals-intriguing-facts-about-battery-and-camera", "urlToImage": null, "publishedAt": "2020-04-25T16:21:00Z", "content": "Weve been waiting to see what parts are in Apples new iPhone - our iPhone SE review left us with a few questions we wanted answering, and iFixits iPhone SE early teardown has begun to provide a few of them.\r\nWhile theres still more to come when the full teard… [+2050 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Apple Watch turns 5: Did you know this is not the first watch Apple has designed? - Hindustan Times", "description": "That and four other cool things you did not know about the Apple Watch", "url": "https://www.hindustantimes.com/tech/apple-watch-turns-5-did-you-know-this-is-not-the-first-watch-apple-has-designed/story-TaLd5mAFahahxirkVPkLaN.html", "urlToImage": null, "publishedAt": "2020-04-25T15:57:39Z", "content": "Apple launched the first Apple Watch five years ago this week. The Apple Watch was Tim Cook’s first high profile product launch after he took over from Steve Jobs. For Jobs, the Apple iPad was the last big product that he launched. \r\nOver the last five years,… [+4241 chars]"}, {"source": {"id": null, "name": "Domain.com.au"}, "author": "Tawar Razaghi", "title": "Sydney house prices: Decline in listings could put a floor under price declines - Domain News", "description": "There are fewer houses for sale across the city, but in some pockets the number of listings is up on the same time last year. If you're in the market, here's where to check.", "url": "https://www.domain.com.au/news/listings-down-in-most-sydney-regions-but-it-could-put-a-floor-on-prices-950937/", "urlToImage": null, "publishedAt": "2020-04-25T14:30:23Z", "content": "Strong buyer demand from first-home buyers and upgraders will help put a floor on property prices as the number of homes for sale drops in almost every part of Sydney, experts say.\r\nWhile the citys property market recovery was in full swing by March, the coro… [+6863 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Zach Hope", "title": "Farmers ploughing fresh veggies back into soil as restaurant ban bites - The Age", "description": "Millions of dollars of fresh produce is going to waste as the coronavirus ban on dining at cafes, restaurants and pubs continues without an end in sight.", "url": "https://www.theage.com.au/national/victoria/farmers-ploughing-fresh-veggies-back-into-soil-as-restaurant-ban-bites-20200424-p54n0q.html", "urlToImage": null, "publishedAt": "2020-04-25T13:31:19Z", "content": "\"We are planting, but we're planting for numbers that we're just guessing at.\"\r\nMr Haw said his business had lost \"literally millions\" of dollars worth of produce since the coronavirus outbreak, having \"ploughed it back into the ground because we can't sell i… [+2192 chars]"}, {"source": {"id": null, "name": "Couriermail.com.au"}, "author": null, "title": "Expert reveals the Qld airline that could replace ‘tainted’ Virgin Australia - Courier Mail", "description": "Subscribe to The Courier-Mail to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.couriermail.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T11:02:01Z", "content": null}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Protesters lay 'body bags' at Trump hotel over coronavirus response - SBS News", "description": "Anti-Donald Trump protesters have taken to the Trump International Hotel in Washington, DC to show disapproval of his administration's coronavirus response.", "url": "https://www.sbs.com.au/news/protesters-lay-body-bags-at-trump-hotel-over-coronavirus-response", "urlToImage": null, "publishedAt": "2020-04-25T05:09:43Z", "content": "Protesters frustrated with President Donald Trump and his administration's handling of the coronavirus crisis have placed 'body bags' outside a hotel owned by his family.\r\nThe black garbage bags, filled with cardboard to make them look like body bags with cor… [+2825 chars]"}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": null, "title": "Anzac Day in Canberra in photos - The Canberra Times", "description": "Canberrans have remembered Anzac Day very differently to other years.  They stood at the end of their driveways, carrying candles to symbolically light the da...", "url": "https://www.canberratimes.com.au/story/6735069/anzac-day-in-canberra-in-photos/", "urlToImage": null, "publishedAt": "2020-04-25T00:00:00Z", "content": null}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}]}