{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Government's coronavirus tracing app released, Health Minister says misusing data could result in jail - ABC News", "description": "As Australia looks to implement an app that will help ease coronavirus restrictions, privacy concerns remain. But the nation's top medical officers and Health Minister have moved to reassure people security is paramount.", "url": "https://www.abc.net.au/news/2020-04-26/coronavirus-tracing-app-covidsafe-australia-covid-19-data/12186068", "urlToImage": null, "publishedAt": "2020-04-26T07:54:20Z", "content": "Updated \r\nApril 26, 2020 18:20:36\r\nThe Government's coronavirus tracing app has been released, and its uptake will play a large part in helping ease restrictions.\r\nIt has been called COVIDSafe and will allow authorities to quickly notify people if they have b… [+6725 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/nicolas-perpitch/5641906", "title": "WA eases coronavirus restrictions to allow 10-person gatherings - ABC News", "description": "Premier Mark McGowan says some coronavirus restrictions can be relaxed.", "url": "https://www.abc.net.au/news/2020-04-26/wa-relaxes-stage-3-coronavirus-restrictions/12186258", "urlToImage": null, "publishedAt": "2020-04-26T06:53:59Z", "content": "Updated \r\nApril 26, 2020 17:47:02\r\nWest Australian Premier Mark McGowan has announced a \"cautious relaxation\" of some COVID-19 restrictions in the State, including allowing indoor and outdoor non-work gatherings of up to 10 people.\r\nKey Points:\r\n<ul><li>Gathe… [+4754 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Sumeyya Ilanbey", "title": "Victoria won't consider easing restrictions before May 11: health chief - Sydney Morning Herald", "description": "The Victorian government ruled out following in the footsteps of other states which have begun easing some restrictions.", "url": "https://www.theage.com.au/national/victoria/victoria-won-t-consider-easing-restrictions-before-may-11-health-chief-20200426-p54n93.html", "urlToImage": null, "publishedAt": "2020-04-26T06:45:24Z", "content": "Health Minister Jenny Mikakos has rejected any notion of isolation measures being lifted sooner in rural and regional Victoria, where there have been fewer coronavirus cases compared with metropolitan Melbourne and Geelong.\r\n\"There might be some changes to cl… [+3693 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "James McKern", "title": "The Last Dance, Michael Jordan: Jason Hehir on ‘jarring’ moment’, Chicago Bulls | how to watch - NEWS.com.au", "description": "The Last Dance director talks all things Michael Jordan and the Chicago Bulls", "url": "https://www.news.com.au/sport/american-sports/nba/the-last-dance-director-talks-all-things-michael-jordan-and-the-chicago-bulls/news-story/80884469d879a23fcd07594a510914b2", "urlToImage": null, "publishedAt": "2020-04-26T06:35:11Z", "content": "The world is hooked on Michael Jordan and the Chicago Bulls. No, we haven’t entered a time warp, but the Bulls have become the talk of sports fans everywhere thanks to ESPN’s 10-part docu-series on their final championship run in 1997/98.\r\nOver 10,000 hours o… [+6345 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Rachel Clun", "title": "Five more COVID-19 patients at care facility as NSW passes 3000 cases - Sydney Morning Herald", "description": "A doctor from Nepean Hospital was also among the eight new confirmed cases reported on Sunday.", "url": "https://www.smh.com.au/national/nsw/five-more-covid-19-patients-at-care-facility-as-nsw-passes-3000-cases-20200426-p54nc6.html", "urlToImage": null, "publishedAt": "2020-04-26T06:00:26Z", "content": "\"Whilst this is a particularly difficult and challenging virus, we also know that it still hasn't managed to get through the community in NSW - indeed Australia - to the extent that it certainly has in other jurisdictions,\" he said.\r\nAn 82-year-old man died o… [+2470 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "NFL Draft report card: Cowboys’ gold star, nightmare continues - Fox Sports", "description": "Teams keep secret their NFL draft boards, but we share a report card.", "url": "https://www.foxsports.com.au/nfl/nfl-draft-2020-report-card-dallas-cowboys-top-list-houston-texans-have-a-nightmare/news-story/ec2f3ac798ad2456244b05c66f488a3c", "urlToImage": null, "publishedAt": "2020-04-26T05:53:00Z", "content": "So, which teams handled the unique scouting and technological challenges caused by coronavirus stay-at-home restrictions better than the rest?\r\nHere are first-look grades for all 32 teams, with a curve instituted for the first-, second- and third-round picks … [+11394 chars]"}, {"source": {"id": null, "name": "Theguardian.comworld"}, "author": "Luke Henriques-Gomes", "title": "Children unlikely to transmit coronavirus, says study cited in PM's push to reopen schools - The Guardian", "description": "NSW report held up as Morrison government seeks return to classrooms across Australia despite warnings from teacher unions", "url": "https://amp.theguardian.comworld/2020/apr/26/children-unlikely-to-transmit-coronavirus-says-study-cited-in-pms-push-to-reopen-schools", "urlToImage": null, "publishedAt": "2020-04-26T05:45:02Z", "content": "A new report, cited by the chief medical officer as the federal government advocates the reopening of schools, says children are unlikely to transmit Covid-19 between each other or to adults.\r\nThe study by NSW Healths Centre for Immunisation Research and Surv… [+4081 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Kristine Tarbert", "title": "'Moved on': Former judge Gary Mehigan breaks silence on new MasterChef - Lifestyle", "description": "Gary Mehigan was a judge on the show alongside Matt Preston and George Calombaris for ten years.", "url": "https://au.lifestyle.yahoo.com/gary-mehigan-new-masterchef-legacy-045408196.html", "urlToImage": null, "publishedAt": "2020-04-26T05:02:42Z", "content": "The latest season of MasterChef has been kicking goals so far - a hit with fans, and doing well in the ratings - and now former judge Gary Mehigan broken his silence after leaving the show last year.\r\nGary was a judge on the show alongside Matt Preston and Ge… [+2231 chars]"}, {"source": {"id": null, "name": "9news.com.au"}, "author": "Lara Pearce", "title": "Ten hospital staff isolated after Sydney doctor tests positive - 9News", "description": "<p>Ten staff across two western Sydney hospitals are in isolation today after a doctor was diagnosed with COVID-19.</p>", "url": "https://www.9news.com.au/national/coronavirus-nsw-nepean-hospital-staff-in-isolation-after-doctor-tests-positive/196dcdf3-5e4f-4735-9bfd-680602167326", "urlToImage": null, "publishedAt": "2020-04-26T04:29:35Z", "content": "Property News: Creative ways people are staying connected during isolation - domain.com.au"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Rohan Smith", "title": "Coronavirus Australia: Qld and WA to lift some social distancing restrictions - NEWS.com.au", "description": "Coronavirus Australia: Queensland and Western Australia to lift some social distancing restrictions", "url": "https://www.news.com.au/world/coronavirus/australia/coronavirus-australia-qld-to-lift-some-social-distancing-restrictions/news-story/74e156e6e58852d33c90b068c3c22047", "urlToImage": null, "publishedAt": "2020-04-26T04:26:37Z", "content": "As Australia successfully flattens the coronavirus curve, some states have decided to cautiously relax restrictions.Queensland Premier Annastacia Palaszczuk announced some of the state's strict isolation measures would be relaxed on Saturday, May 2.\r\nSpeaking… [+5924 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Adam Carey, Sumeyya Ilanbey", "title": "Victoria digs in on school closures as Tehan calls for May opening - Sydney Morning Herald", "description": "Federal Education Minister Dan Tehan has challenged Victoria to open schools next month rather than persist with remote learning until the end of term two.", "url": "https://www.theage.com.au/politics/victoria/victoria-digs-in-on-school-closures-as-tehan-calls-for-may-opening-20200426-p54nby.html", "urlToImage": null, "publishedAt": "2020-04-26T04:12:13Z", "content": "He spoke after Victorias Education Minister, James Merlino issued a fiery rejection of Coalition pleas to reopen schools, arguing the move could undermine state efforts to contain the spread of COVID-19.\r\nLet me be very clear, particularly to the federal gove… [+3029 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Anthony Galloway", "title": "Australian intelligence officials treating reports of Kim Jong-un's ill health seriously - Sydney Morning Herald", "description": "Australian intelligence officials are treating reports of North Korea's leader Kim Jong-un ill health seriously, with concerns about the upheaval that would be created by a change of leader in the secretive and authoritarian state.", "url": "https://www.smh.com.au/world/asia/australian-intelligence-officials-treating-reports-of-kim-jong-un-s-ill-health-seriously-20200426-p54nbc.html", "urlToImage": null, "publishedAt": "2020-04-26T03:55:29Z", "content": "38North, the Washington think tank, cautioned that the train's presence \"does not prove the whereabouts of the North Korean leader or indicate anything about his health\".\r\n\"But it does lend weight to reports that Kim is staying at an elite area on the country… [+2355 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Jamie Seidel", "title": "Coronavirus vaccines and treatment are in development, but what is Plan C? - NEWS.com.au", "description": "Coronavirus vaccines and treatment are in development, but what is the world’s Plan C?", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-vaccines-and-treatment-are-in-development-but-what-is-the-worlds-plan-c/news-story/082aa3bdda2ee957d532ec1e4605726c", "urlToImage": null, "publishedAt": "2020-04-26T03:46:21Z", "content": "Will a vaccine save us from COVID-19? What about new treatments for its symptoms?Indications are, we may have to find a Plan C.Billions of people are confined to our homes. We can’t go to the beach. The office. Or school. It’s the bluntest possible response t… [+8397 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "LIVE: Warriors await exemption as every player commits to NRL relaunch - Fox Sports", "description": "<b>Tune into our new show Fox League Live on Channel 502 Monday to Friday at 6.30pm and on Saturday at 3pm and Sunday at 5pm.</b>", "url": "https://www.foxsports.com.au/nrl/nrl-premiership/live-todd-greenberg-receives-hefty-pay-out-as-nrl-fights-for-survival/news-story/778c5fad077f2b2bf72be3f4250a3cf0", "urlToImage": null, "publishedAt": "2020-04-26T03:37:00Z", "content": "The NRL and the broadcasters have locked in a May 28 return, but theres plenty that needs to happen before thats a reality, with the season structure still to be decided.\r\nHere are the latest updates.\r\nWatch Foxtel in an instant. Catch up and settle in with n… [+8225 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Luke Malpass", "title": "'Saint Jacinda' Ardern's lockdown has not silenced her critics - The Age", "description": "Ardern may be very popular but she remains a fallible person dealing with real problems.", "url": "https://www.smh.com.au/world/oceania/saint-jacinda-ardern-s-lockdown-has-not-silenced-her-critics-20200424-p54n37.html", "urlToImage": null, "publishedAt": "2020-04-26T03:32:43Z", "content": "Yet back in the living rooms of New Zealanders harsh lockdown laws mean that most people are rarely to be found elsewhere all is not viewed so rosily.\r\nLast Monday the government released a damning report into its own contact tracing efforts.\r\nMeanwhile, job … [+6434 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Karren Brady", "title": "We must not bail OUT firms like Richard Branson’s Virgin Atlantic who didn’t pay IN first - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11480062/bail-out-virgin-atlantic-pay-in/", "urlToImage": null, "publishedAt": "2020-04-26T01:59:10Z", "content": "THE Government shouldnt step in to bail them out. They should let them go bust.\r\nGuess who said that, in 2009, about whether the then Government should intervene to save British Airways?\r\n The idea that the British taxpayer should bail out Virgin Atlantic is … [+10329 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Monique Friedlander For Daily Mail Australia", "title": "Cassandra Thorburn hits back after half-sister claims she's 'secretly OBSESSED' with Karl Stefanovic - Daily Mail", "description": "Cassandra Thorburn, 49, has hit back at her estranged half-sister Allegra Bottrell-Thorburn, after she claimed that the journalist has a 'secret obsession' with her ex-husband Karl Stefanovic.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8257357/Cassandra-Thorburn-hits-half-sister-claims-shes-secretly-OBSESSED-Karl-Stefanovic.html", "urlToImage": null, "publishedAt": "2020-04-26T01:44:07Z", "content": "Cassandra Thorburn, 49, has hit back at her estranged half-sister Allegra Bottrell-Thorburn, after she claimed that the journalist has a 'secret obsession' with her ex-husband Karl Stefanovic. \r\nPosting to Instagram on Sunday, Cassandra said Allegra's claims … [+2333 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Tasmania records 11th coronavirus death - ABC News", "description": "Another elderly person dies from coronavirus in Tasmania's north-west, the state's third death in three days.", "url": "https://www.abc.net.au/news/2020-04-26/tasmania-coronavirus-death-tally-11/12185936", "urlToImage": null, "publishedAt": "2020-04-26T01:23:16Z", "content": "Updated \r\nApril 26, 2020 12:25:19\r\nA man in his 90s has died of coronavirus in Tasmania overnight, becoming the 11th Tasmanian to succumb to COVID-19.\r\nTasmania COVID-19 snapshot\r\n<ul><li>Confirmed cases: 208</li><li>Deaths: 11, 10 in north-west</li></ul>What… [+2165 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Huawei AppGallery: Can it replace the Google Play Store? - Micky News", "description": "With Huawei's P40 and P40 Pro only sporting Huawei Media Suite, can the Huawei AppGallery replace the Google Play Store?", "url": "https://micky.com.au/huawei-app-gallery-can-it-replace-the-google-play-store/", "urlToImage": null, "publishedAt": "2020-04-26T00:48:34Z", "content": "The departure of the Google Play Store on Huawei devices started when the U.S. imposed a trade ban on the Chinese OEM. This means that Huawei may run the Android software, but the Google Media Suite is not allowed.\r\nGmail, YouTube, Google Photos, and many mor… [+4628 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Chinese Government official slams Australia's push for an investigation into the coronavirus outbreak - ABC News", "description": "China has slammed Australia's push for an independent international probe of the coronavirus pandemic describing the move as political manoeuvring", "url": "https://www.abc.net.au/news/2020-04-26/coronavirus-china-slams-australia-over-independent-inquiry/12185988", "urlToImage": null, "publishedAt": "2020-04-26T00:31:45Z", "content": "Updated \r\nApril 26, 2020 10:38:34\r\nChina has criticised Australia's push for an independent international probe of the coronavirus pandemic, describing the move as \"political manoeuvring\". \r\nKey points:\r\n<ul><li>Australia wants an investigation of China's han… [+2797 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/kate-midena/10748890", "title": "Coronavirus restrictions mean celebrities are also turning to cooking. But for some it's nothing new - ABC News", "description": "First isolation restrictions gave us the Quarantini, then we had whipped coffee, and now the internet has gifted us Stanley Tucci making a Negroni.", "url": "https://www.abc.net.au/news/2020-04-26/celebrities-cooking-during-coronavirus-including-stanley-tucci/12176190", "urlToImage": null, "publishedAt": "2020-04-26T00:31:13Z", "content": "Updated \r\nApril 26, 2020 10:43:09\r\nCoronavirus restrictions have seen many of us experimenting in the kitchen, sharing recipes and discoveries with our friends on social media.\r\nIt has also prompted a few... trends.\r\nFirst we had the 'Quarantini' cocktail an … [+8652 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "A-League QuaranTeam of the season challenge - SBS - The World Game", "description": "With the A-League regular season originally scheduled for an April end, it seems fitting we look back at the best that was before the coronavirus outbreak.", "url": "https://theworldgame.sbs.com.au/a-league-quaranteam-of-the-season-challenge", "urlToImage": null, "publishedAt": "2020-04-26T00:19:00Z", "content": "Sunday marked what would have been the final round of the 2019-20 campaign, with the leagues suspension since leaving fans, players and pundits all unsure of whats next.\r\nAlthough there were five rounds remaining in the season, the players produced several st… [+5588 chars]"}, {"source": {"id": null, "name": "Fool.com.au"}, "author": null, "title": "How to generate $20000 of passive income from ASX shares - Motley Fool Australia", "description": "Here's how a touch of luck and some strong ASX dividend shares can deliver a $20,000 passive income to your pocket over time.", "url": "https://www.fool.com.au/2020/04/26/how-to-generate-20000-of-passive-income-from-asx-shares/", "urlToImage": null, "publishedAt": "2020-04-26T00:18:15Z", "content": "$20,000 per year of passive income from ASX shares sounds pretty good right now. Tragically, times are tough, and everyone is looking for a little bit of extra cash.\r\nOf course if you’re a bargain-seeking Fool, you might be investing heavily in ASX shares. Wh… [+3934 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Rebekah Scanlan", "title": "Coles shoppers going crazy for Monday $10 shampoo and conditioner - NEWS.com.au", "description": "The Beauty Diary by Rebekah Scanlan: Best new beauty buys, perfect for isolation", "url": "https://www.news.com.au/lifestyle/beauty/the-beauty-diary-by-rebekah-scanlan-best-new-beauty-buys-perfect-for-isolation/news-story/d317aff12889952e627efeb117395664", "urlToImage": null, "publishedAt": "2020-04-25T21:10:10Z", "content": "With money on our minds more than ever, its never been as important to find high quality goods at affordable prices and beauty products are no exception. That’s why when I spotted a new haircare launch in Coles that promised to give you a salon-worthy wash fo… [+8570 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Anna Salleh", "title": "The fagus, Australia's only native winter deciduous tree, is turning its stunning autumn colours. What's behind that gorgeous display? - ABC News", "description": "Tasmania's deciduous beech, the fagus, is turning stunning yellow, orange and red — what makes this happen?", "url": "https://www.abc.net.au/news/science/2020-04-26/true-blue-autumn-leaves-are-turning/12147698", "urlToImage": null, "publishedAt": "2020-04-25T20:30:09Z", "content": "Every year at this time, thousands flock to national parks in Tasmania to see the stunning autumn display of Australia's only native winter deciduous tree the fagus.\r\nBut this year the state's parks are closed until further notice thanks to coronavirus, which… [+4723 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": null, "title": "Samantha Armytage signs up with Lisa Wilkinson’s agent, takes 20pc pay cut - Daily Telegraph", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.dailytelegraph.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T20:04:14Z", "content": null}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Zack Zwiezen", "title": "New GTA Online Missions Are All About Preparing For A Recession - Kotaku Australia", "description": "Grand Theft Auto Online received a new update a few days ago that added six new missions. These missions are all about an old-time GTA Online character, Gerald, and his attempts to get ready for an upcoming recession. Five of them are good and one of them is …", "url": "https://www.kotaku.com.au/2020/04/new-gta-online-missions-are-all-about-preparing-for-a-recession/", "urlToImage": null, "publishedAt": "2020-04-25T18:00:00Z", "content": "Grand Theft Auto Online received a new update a few days ago that added six new missions. These missions are all about an old-time GTA Online character, Gerald, and his attempts to get ready for an upcoming recession. Five of them are good and one of them is … [+2803 chars]"}, {"source": {"id": null, "name": "Trust.org"}, "author": "Thomson Reuters Foundation", "title": "Mothering with a mask: Belgian with COVID-19 gives birth to ... - Thomson Reuters Foundation", "description": "HEALTH-CORONAVIRUS/BELGIUM-NEWBORN (TV, PIX):Mothering with a mask: Belgian with COVID-19 gives birth to healthy baby", "url": "https://news.trust.org/item/20200425155818-nb16i", "urlToImage": null, "publishedAt": "2020-04-25T16:38:00Z", "content": "BRUSSELS, April 25 (Reuters) - A pregnant Belgian woman diagnosed with the coronavirus has given birth to a healthy baby daughter - but must now learn to care for her newborn wearing, and sleeping with, a protective mask.\r\nBaby Mahaut was born on April 23 in … [+1715 chars]"}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": "Alex Crowe", "title": "What will Term 2 look like for ACT schools? - The Canberra Times", "description": "Here's what you need to know before Term 2 starts in the ACT.", "url": "https://www.canberratimes.com.au/story/6733682/what-will-term-2-look-like-for-act-schools/", "urlToImage": null, "publishedAt": "2020-04-25T15:30:00Z", "content": ""}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Lynn La", "title": "iPhone SE vs. iPhone 8 comparison: Which $400 iPhone should you get? - CNET", "description": "Some retailers are still selling the iPhone 8 despite Apple discontinuing the device. But you should just get the new iPhone SE instead.", "url": "https://www.cnet.com/news/iphone-se-vs-iphone-8-spec-comparison-which-400-iphone-should-you-get/", "urlToImage": null, "publishedAt": "2020-04-25T11:28:26Z", "content": "In a bid to lure budget-minded iPhone fans, Apple debuted its new iPhone SE for 2020 on April 15 for $399 (£419, AU$749). It's a sequel to its 2016 iPhone of the same name. The new iPhone SE's specs are similar to the iPhone 8 from three years ago, which is l… [+8211 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Naaman Zhou", "title": "Coronavirus Australia latest: at a glance - The Guardian", "description": "A summary of the major developments in the coronavirus outbreak across Australia", "url": "https://www.theguardian.com/australia-news/2020/apr/25/coronavirus-australia-latest-at-a-glance", "urlToImage": null, "publishedAt": "2020-04-25T07:52:00Z", "content": "Good evening and here is our daily roundup of the latest developments on the coronavirus pandemic in Australia. This is Naaman Zhou bringing you the main stories on Saturday 25 April.\r\nDeath toll rises to 80\r\nAustralias national coronavirus death toll has ris… [+3643 chars]"}, {"source": {"id": null, "name": "Hurriyetdailynews.com"}, "author": "hurriyetdailynews.com", "title": "Hubble telescope celebrates 30th year in space - Hurriyet Daily News", "description": "Scientists on April 24 celebrated the Hubble Space Telescope's 30th anniversary with a new image of a satellite galaxy of the Milky Way.", "url": "http://www.hurriyetdailynews.com/hubble-telescope-celebrates-30th-year-in-space-154195", "urlToImage": null, "publishedAt": "2020-04-25T06:16:03Z", "content": "WASHINGTON\r\nScientists on April 24 celebrated the Hubble Space Telescope's 30th anniversary with a new image of a satellite galaxy of the Milky Way. \r\nIn a statement, U.S. space agency NASA said the galaxy in the image - located 163,000 light-years away- away… [+847 chars]"}, {"source": {"id": null, "name": "Digitalinformationworld.com"}, "author": "Arooj Ahmed", "title": "A Researcher Created A Website Highlighting What A Smartphone sees While Using Bluetooth And Discovered One Of The Biggest Challenges COVID-19 Tracking Technology Will Face - Digital Information World", "description": "One of the hurdles in the creation of this technology is that Bluetooth also detects devices through walls or other bodies that may not transmit the virus.", "url": "https://www.digitalinformationworld.com/2020/04/website-delenates-what-a-smartphone-sees-while-using-bluetooth-and-challenges-covid-19-tracking-technology-will-face.html", "urlToImage": null, "publishedAt": "2020-04-25T06:06:04Z", "content": "<ul><li>Claudio Guarnieri, an artist and security researcher created a website visualizing what a smartphone sees while the Bluetooth is turned on.</li><li>Apple and Google are creating a contact tracing technology to trace COVID-19 spread using Bluetooth ins… [+2045 chars]"}, {"source": {"id": null, "name": "Couriermail.com.au"}, "author": null, "title": "Teacher unions aren’t just hurting kids, it’s the teachers too - Courier Mail", "description": "Subscribe to The Courier-Mail to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.couriermail.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T05:00:00Z", "content": null}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "China sees more imported coronavirus cases - NEWS.com.au", "description": "China sees more imported coronavirus cases", "url": "https://www.news.com.au/world/breaking-news/china-sees-more-imported-coronavirus-cases/news-story/9de1a6d2d8e414ca86e3a5abb2852835", "urlToImage": null, "publishedAt": "2020-04-25T03:51:48Z", "content": "China's northwestern province of Shaanxi has reported seven new imported cases of the novel coronavirus, all in citizens returning home from Russia, even as domestic cases in the country have been largely curbed.The port city of Manzhouli in Inner Mongolia al… [+1566 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/abc-local/sophie-kesteven/7149610", "title": "Raquel is working from home during coronavirus — and that means sloths in the spare room - ABC News", "description": "Working from home means different things for different people. For Raquel, it means moving three very lazy — but very cute — new housemates into the spare room.", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-panama-working-from-home-with-sloths/12169922", "urlToImage": null, "publishedAt": "2020-04-24T22:29:37Z", "content": "Updated \r\nApril 25, 2020 08:23:26\r\nWorking from home is the new normal for many people and for Raquel Cruz Alpizar, it's meant moving three unlikely new housemates into her spare room.\r\nSince coronavirus restrictions took hold, she's been caring around the cl… [+6272 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": null, "name": "Heraldsun.com.au"}, "author": null, "title": "Virgin Australia aircraft blocked in Perth as collapse could domino air route shutdown across the country - Herald Sun", "description": "Subscribe to the Herald Sun to get unrestricted digital access, home paper delivery, Foxsports.com.au subscription,  Apps for iPad and Android and much more...", "url": "https://www.heraldsun.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-24T12:03:00Z", "content": null}]}