{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Victoria elective surgeries set to return - 7NEWS.com.au", "description": "Victorians awaiting a variety of elective surgical procedures will be able to get them as hospitals see a gradual return to normal come Monday.", "url": "https://7news.com.au/news/health/victoria-elective-surgeries-set-to-return-c-999349", "urlToImage": null, "publishedAt": "2020-04-25T17:50:29Z", "content": "While Victorians remain under strict social distancing rules to control the spread of coronavirus, hospitals are gradually returning to business as usual.\r\nThe state's public and private hospitals will begin doing more elective surgeries from Monday.\r\nIn his … [+1332 chars]"}, {"source": {"id": null, "name": "Youngwitness.com.au"}, "author": "Tim Dornin", "title": "SA near end of coronavirus testing blitz - The Young Witness", "description": "South Australia has recorded no new cases of the coronavirus on six of the past eight days as it continues with a two-week testing blitz to flush out infectio...", "url": "https://www.youngwitness.com.au/story/6735327/sa-near-end-of-coronavirus-testing-blitz/?cs=9397", "urlToImage": null, "publishedAt": "2020-04-25T17:30:09Z", "content": "South Australia has recorded no new cases of the coronavirus on six of the past eight days as it continues with a two-week testing blitz to flush out infections across the community.\r\nOnly three new cases have been reported over the past week leaving the stat… [+828 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Marta Jary For Daily Mail Australia", "title": "Delta Goodrem joins Australia's biggest artists for Music From The Home Front online concert - Daily Mail", "description": "Delta Goodren stole the show on Saturday night when she performed in the Music From The Home Front online concert.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8256539/Delta-Goodrem-joins-Australias-biggest-artists-Music-Home-online-concert.html", "urlToImage": null, "publishedAt": "2020-04-25T14:40:14Z", "content": "Delta Goodren stole the show on Saturday night when she performed in the Music From The Home Front online concert. \r\nThe Voice coach performed a moving version of Men At Work's iconic hit Down Under. \r\nBetter yet, the 35-year-old was accompanied by the band's… [+2456 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Zack Zwiezen", "title": "Battlefield V Will Get One Final Update In June - Kotaku Australia", "description": "Battlefield developers Dice announced earlier this week that one final update is coming to Battlefield V in June, though they will continue to combat cheaters even after this last update....", "url": "https://www.kotaku.com.au/2020/04/battlefield-v-will-get-one-final-update-in-june/", "urlToImage": null, "publishedAt": "2020-04-25T14:30:00Z", "content": "Battlefield developers Dice announced earlier this week that one final update is coming to Battlefield V in June, though they will continue to combat cheaters even after this last update.\r\nReleased in November 2018, Battlefield V took the popular series back … [+822 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "This iOS text code can crash your iPhone - here’s how you can fix it - TechRadar", "description": "It seems protection is coming from Apple too", "url": "https://www.techradar.com/news/watch-out-for-this-text-code-that-can-crash-your-iphone", "urlToImage": null, "publishedAt": "2020-04-25T14:30:00Z", "content": "There's a text message doing the rounds that can crash iPhones or disable the touchscreen, though Apple already seems to be working on a fix the beta version of iOS 13.4.5 appears to add extra protection against the rogue message.\r\nThe damaging string of text… [+1630 chars]"}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Shona Ghosh", "title": "Apple is locked in a power battle with the UK, France, and Germany about how COVID-19 should be tracked - Business Insider Australia", "description": "The UK, France, and Germany are locked in a power battle with Apple and Google over the way COVID-19 should be tracked via apps.", "url": "https://www.businessinsider.com.au/france-uk-apple-contact-tracing-apps-2020-4", "urlToImage": null, "publishedAt": "2020-04-25T13:22:18Z", "content": "<ul><li>\r\nThere’s a power battle between the UK, Germany, and France on one side and Apple and Google on the other about coronavirus contact-tracing.\r\n</li><li>\r\nLike other countries, the UK, Germany, and France are creating apps that will track people who re… [+9617 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Adam Carey, Michael Fowler", "title": "Victoria's political unity on schools turns into open warfare - The Age", "description": "The state opposition has demanded the Andrews government immediately reopen schools to all students.", "url": "https://www.theage.com.au/national/victoria/victoria-s-political-unity-on-schools-turns-into-open-warfare-20200425-p54n5q.html", "urlToImage": null, "publishedAt": "2020-04-25T13:01:44Z", "content": "The Premier needs to understand the pressure that his restrictions are putting on families, Mr OBrien said. Other states are moving to get kids back to school safely and Victoria must do the same.\r\nThe Liberal leader proposed extra safety measures for schools… [+4543 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Baby given guard of honour by NHS staff after recovering from coronavirus - The Telegraph", "description": "A six-month-old has been given a guard of honour and applauded by NHS staff after she recovered from coronavirus and was moved out of isolation. Baby Erin ha...", "url": "https://www.youtube.com/watch?v=9m8OjGk5WCQ", "urlToImage": null, "publishedAt": "2020-04-25T12:56:55Z", "content": null}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Danny Weidler", "title": "Greenberg's $650,000 parting gift from NRL - Sydney Morning Herald", "description": "If you think the game's departing chief executive looked relaxed, or even relieved, when he fronted the media after quitting, now you know why.", "url": "https://www.smh.com.au/sport/nrl/greenberg-s-650-000-parting-gift-from-nrl-20200425-p54n85.html", "urlToImage": null, "publishedAt": "2020-04-25T12:02:39Z", "content": "Greenbergs first contract, signed four years ago, was approved by former ARLC chairman John Grant. Greenbergs lawyers outsmarted the NRL.\r\nIt will raise more questions for an organisation that has been criticised for a bloated front office. It was a theme for… [+7937 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Adelaide and Perth airports seize Virgin aircraft as collateral against debts - Sky News Australia", "description": "Adelaide Airport has become the latest Australian airport to sieze possession of Virgin Australia aircraft as collateral against outstanding bills. Since bei...", "url": "https://www.youtube.com/watch?v=ywsYGqXZCh0", "urlToImage": null, "publishedAt": "2020-04-25T11:59:36Z", "content": null}, {"source": {"id": null, "name": "Themercury.com.au"}, "author": "AMBER WILSON", "title": "Tasmania records one new COVID-19 case on Saturday - The Mercury", "description": "TASMANIA recorded just one new confirmed coronavirus case on Saturday — another North-West healthcare worker.", "url": "https://www.themercury.com.au/news/coronavirus/tasmania-records-one-new-covid19-case-on-saturday/news-story/6c3476d057902acd95b828506872da0c", "urlToImage": null, "publishedAt": "2020-04-25T11:38:00Z", "content": "TASMANIA recorded just one new confirmed coronavirus case on Saturday another North-West healthcare worker.\r\nActing public health director Scott McKeown confirmed on Saturday night that the patient was male and in his 40s.\r\nThe state’s COVID-19 tally now stan… [+624 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/kathryn-bermingham/12125068, https://www.abc.net.au/news/sara-tomevska/10287304", "title": "Two women killed, others injured in high-speed crash in Urrbrae, south of Adelaide - ABC News", "description": "Two women have died in a high-speed crash that took place at Urrbrae, south of Adelaide, on Saturday afternoon.", "url": "https://www.abc.net.au/news/2020-04-25/sa-urrbrae-hazmat-crash/12185150", "urlToImage": null, "publishedAt": "2020-04-25T10:17:31Z", "content": "Updated \r\nApril 25, 2020 19:02:39\r\nTwo people have been killed and three others seriously injured in a high-speed crash at Urrbrae, south of Adelaide.\r\n<ul><li>Three people are in a serious condition after the \"horrific\" crash</li><li>A witness felt her house… [+1966 chars]"}, {"source": {"id": null, "name": "Heraldsun.com.au"}, "author": null, "title": "Familiar voice returns to Overnight airwaves - Herald Sun", "description": "Subscribe to the Herald Sun to get unrestricted digital access, home paper delivery, Foxsports.com.au subscription,  Apps for iPad and Android and much more...", "url": "https://www.heraldsun.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": null}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "China sends medical team to check on Kim Jong-un's health, sources say - SBS News", "description": "China has sent a team including medical experts to advise on North Korea's Kim Jong-un, sources say.", "url": "https://www.sbs.com.au/news/china-sends-medical-team-to-check-on-kim-jong-un-s-health-sources-say", "urlToImage": null, "publishedAt": "2020-04-25T09:53:28Z", "content": "China has dispatched a team to North Korea including medical experts to advise on North Korean leader Kim Jong-un, according to three people familiar with the situation.\r\nThe trip by the Chinese doctors and officials comes amid conflicting reports about the h… [+3855 chars]"}, {"source": {"id": null, "name": "9news.com.au"}, "author": "9News Staff", "title": "'Die': $3m home of man arrested over deadly police crash vandalised - 9News", "description": "<p>The home of the Porsche driver held over the Melbourne police crash has been vandalized, as the family of one of the dead officers released an emotional tribute.</p>", "url": "https://www.9news.com.au/national/melbourne-police-crash-eastern-freeway-porsche-driver-richard-pusey-home-vandalised/818c433b-653b-4bf5-b18e-9fa4fc00813c", "urlToImage": null, "publishedAt": "2020-04-25T09:46:53Z", "content": "Property News: Tips and tricks for propagating edibles and seed saving - domain.com.au"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Calla Wahlquist", "title": "Family of youngest officer killed in Melbourne freeway crash say 'bright light' is lost - The Guardian", "description": "Parents of constable Josh Prestney, 28, say they ‘cannot fathom the circumstances’ that led to their son’s death", "url": "https://www.theguardian.com/australia-news/2020/apr/25/family-of-youngest-officer-killed-in-melbourne-freeway-crash-say-bright-light-is-lost", "urlToImage": null, "publishedAt": "2020-04-25T09:08:00Z", "content": "The family of a police officer killed alongside three colleagues when they were struck by a truck on a Melbourne freeway on Wednesday say they have lost their bright light.\r\nConstable Josh Prestney, 28, was the youngest of the four officers killed in the inci… [+2683 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Peter Ryan", "title": "Standing together, while apart as the Last Post fills the MCG - The Age", "description": "On August 9, 1941 two death notices appeared in The Age, one after the other, paying tribute to soldiers killed in active service.", "url": "https://www.theage.com.au/sport/afl/standing-together-while-apart-as-the-last-post-fills-the-mcg-20200425-p54n73.html", "urlToImage": null, "publishedAt": "2020-04-25T08:37:48Z", "content": "Maisie, his younger sister, was 29. She died just before her 96th birthday remembering Tom every step of the 65 years she spent without him.\r\nIt's not only that alphabetical coincidence that leaps into my mind on Anzac Day every year when standing for the Las… [+2426 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Trump was being \"sarcastic\" when he suggested injecting disinfectant to treat COVID-19 | ABC News - ABC News (Australia)", "description": "A major maker of disinfectant has warned against ingesting its cleaning products after the US President suggested it could be a possible treatment for corona...", "url": "https://www.youtube.com/watch?v=CvXJDPb9P4U", "urlToImage": null, "publishedAt": "2020-04-25T08:29:07Z", "content": "A major maker of disinfectant has warned against ingesting its cleaning products after the US President suggested it could be a possible treatment for coronavirus.\r\nHis comments also prompted health experts to issue urgent advice, but Donald Trump now says he… [+544 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Coronavirus Australia live updates: National death toll rises; Donald Trump shocks with disinfectant injection musing - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T07:26:00Z", "content": null}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Brett Wadelton", "title": "Space news: Asteroid to pass close to Earth next week, visible by telescope - 7NEWS.com.au", "description": "Stargazers are set for a treat early next week as an asteroid will pass close to Earth.", "url": "https://7news.com.au/technology/space/space-news-mask-shaped-asteroid-to-pass-close-to-earth-next-week-visible-by-telescope-c-993995", "urlToImage": null, "publishedAt": "2020-04-25T06:38:57Z", "content": "Astronomers are set for a treat early next week as an asteroid will pass close to Earth.\r\nNamed Asteroid (52768) 1998 OR2, this large near-Earth and potentially hazardous asteroid (PHA) will safely fly past us at a mere 6.3 million kilometres - which is quite… [+1587 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Pam Whaley", "title": "Peter V'landys says NRL plans to honour COVID-19 health workers in State of Origin series - Wide World of Sports", "description": "'There's a few things we can do in that period'", "url": "https://wwos.nine.com.au/nrl/nrl-look-honour-health-workers-at-origin/d06ca541-9319-48e2-a105-cf21d6c93986", "urlToImage": null, "publishedAt": "2020-04-25T05:51:32Z", "content": "A three-game State of Origin series will be held at the end of the year with hopes the NRL can reward health workers and attract a safe crowd.\r\nWhile a competition structure is still unknown, ARLC chairman Peter V'landys has confirmed the NRL will move it's b… [+1809 chars]"}, {"source": {"id": null, "name": "Couriermail.com.au"}, "author": null, "title": "Teacher unions aren’t just hurting kids, it’s the teachers too - Courier Mail", "description": "Subscribe to The Courier-Mail to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.couriermail.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T05:00:00Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rosa Flores, Sara Weisfeldt and Arman Azad, CNN", "title": "2 studies show many people who tested positive for Covid-19 displayed no symptoms - CNN", "description": "Two coronavirus studies released Friday -- one involving almost 2,000 people from Florida and the other from a Washington state nursing home -- came to the same conclusion: Many of the people who tested positive for the virus didn't know it they had it becaus…", "url": "https://www.cnn.com/2020/04/24/us/2-asymptomatic-coronavirus-studies/index.html", "urlToImage": null, "publishedAt": "2020-04-25T04:54:54Z", "content": null}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Angus Thompson", "title": "'It was a lot more real': one Sydney street's driveway dawn service - The Age", "description": "Albie Woodhouse has performed the Last Post in many different settings. But, until this morning, never the driveway of his Daceyville home.", "url": "https://www.smh.com.au/national/nsw/it-was-a-lot-more-real-one-sydney-street-s-driveway-dawn-service-20200425-p54n5o.html", "urlToImage": null, "publishedAt": "2020-04-25T04:52:56Z", "content": "\"It felt a bit more personal, because instead of playing in front of teachers I was around friends and family.\"\r\nHis father, Rob, said Anzac Day had special significance to the family because his grandfather had been a prisoner of war at Changi, the notorious… [+2377 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Angus Thompson", "title": "'You needed lane ropes': Siren sounds for Coogee's morning crowds to disperse - Sydney Morning Herald", "description": "The cry of sirens signalled the call for swimmers to leave Coogee Beach at 9am on Saturday as part of new social distancing restrictions.", "url": "https://www.smh.com.au/national/nsw/you-needed-lane-ropes-siren-sounds-for-coogee-s-morning-crowds-to-disperse-20200425-p54n6j.html", "urlToImage": null, "publishedAt": "2020-04-25T04:22:37Z", "content": "\"Everyone's been so cooped up,\" she said, adding the situation was \"challenging\".\r\nJohn Griffiths, who was ocean swimming with his family, said there were lots of people exercising in the water. \"You needed lane ropes,\" he said.\r\nNSW Health Minister Brad Hazz… [+462 chars]"}, {"source": {"id": null, "name": "Tweaktown.com"}, "author": "https://www.facebook.com/agarreffa", "title": "ASUS ROG STRIX Radeon RX 5600 XT Graphics Card Review - TweakTown", "description": "ASUS has one of the fastest Radeon RX 5600 XT cards with its ROG STRIX RX 5600 XT.", "url": "https://www.tweaktown.com/reviews/9433/asus-rog-strix-radeon-rx-5600-xt-graphics-card/index.html", "urlToImage": null, "publishedAt": "2020-04-25T03:35:29Z", "content": "Introduction\r\nI've reviewed a few AMD Radeon RX 5600 XT graphics cards so far, but today brings one of the most enthusiast ones I've tested so far -- the ASUS ROG STRIX Radeon RX 5600 XT. ASUS puts on the usual Republic of Gamers (ROG... duh) spin on this cus… [+1753 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "AP", "title": "US coronavirus protests: 1500 protesters crowd Wisconsin capital - NEWS.com.au", "description": "Coronavirus: Crowd of 1500 storms capital in latest US protest", "url": "https://www.news.com.au/world/north-america/coronavirus-crowd-of-1500-storms-capital-in-latest-us-protest/news-story/f4d279f3d294214c6b69cf81909aa903", "urlToImage": null, "publishedAt": "2020-04-25T02:59:56Z", "content": "Around 1500 Trump supporters ignored social distancing to stage the latest protest in the United States against lockdown measures.The demonstrations by right-wing groups against measures to contain the coronavirus, which have risen up around the country, came… [+1431 chars]"}, {"source": {"id": null, "name": "Couriermail.com.au"}, "author": "admin", "title": "Anzac biscuits: Why calling it a ‘cookie’ could earn you a fine - Jimmys Post", "description": "", "url": "https://www.couriermail.com.au/lifestyle/food/anzac-biscuits-why-calling-it-a-cookie-can-earn-a-fine/news-story/3017910c019f84b3b1d2143dde37b98e/", "urlToImage": null, "publishedAt": "2020-04-25T02:02:49Z", "content": "Calling an Anzac biscuit a cookie is officially regarded as un-Australian and could even earn a fine from the Federal Government if used to market goods.\r\nStarting off its life as an army biscuit sent by Australians to support their loved ones fighting in Eur… [+3405 chars]"}, {"source": {"id": null, "name": "Newidea.com.au"}, "author": "New Idea", "title": "Stunning claim made about Meghan Markle and her father in court - New Idea", "description": "A shock new claim has been made about the Duchess of Sussex and her estranged father Thomas Markle.", "url": "https://www.newidea.com.au/stunning-claim-made-about-meghan-markle-and-her-father-in-court", "urlToImage": null, "publishedAt": "2020-04-25T00:33:00Z", "content": "It has been claimed that Meghan Markle has not seen her father Thomas in two years.\r\nLawyers for the the royal husband and wife claim the letters publication was a misuse of private information and breached her copyright.\r\nThe publication of the letter is cla… [+1059 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/abc-local/sophie-kesteven/7149610", "title": "Raquel is working from home during coronavirus — and that means sloths in the spare room - ABC News", "description": "Working from home means different things for different people. For Raquel, it means moving three very lazy — but very cute — new housemates into the spare room.", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-panama-working-from-home-with-sloths/12169922", "urlToImage": null, "publishedAt": "2020-04-24T22:29:37Z", "content": "Updated \r\nApril 25, 2020 08:23:26\r\nWorking from home is the new normal for many people and for Raquel Cruz Alpizar, it's meant moving three unlikely new housemates into her spare room.\r\nSince coronavirus restrictions took hold, she's been caring around the cl… [+6272 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": null, "title": "Captain Tom Moore becomes oldest person to top Britain's music chart - The Age", "description": "A World War II veteran who raised millions for charity has now become the oldest person to top Britain's main music chart.", "url": "https://www.smh.com.au/world/europe/captain-tom-moore-becomes-oldest-person-to-top-britain-s-music-chart-20200425-p54n4v.html", "urlToImage": null, "publishedAt": "2020-04-24T20:40:50Z", "content": "He also went to No.1 on the music charts - with a little help from a friend.\r\nThe cover version of You'll Never Walk Alone that Moore appears on with singer Michael Ball was on course to be pipped by The Weeknd's Blinding Lights, until the Canadian star asked… [+1312 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": "Adrian Rollins", "title": "JobKeeper fixes unveiled improving access for some sectors - The Canberra Times", "description": "Employers will not be able to pick and choose who gets JobKeeper payments.", "url": "https://www.canberratimes.com.au/story/6734871/jobkeeper-fixes-unveiled-improving-access-for-some-sectors/", "urlToImage": null, "publishedAt": "2020-04-24T14:00:00Z", "content": ""}, {"source": {"id": null, "name": "Theconversation.com"}, "author": "Rodger I. Thompson", "title": "How the Hubble Space Telescope opened our eyes to the first galaxies of the universe - The Conversation US", "description": "Thirty years ago the Hubble Space Telescope began snapping photos of distant stars, providing a time machine that has taken astronomers back to when the universe was less than a billion years old.", "url": "https://theconversation.com/how-the-hubble-space-telescope-opened-our-eyes-to-the-first-galaxies-of-the-universe-133877", "urlToImage": null, "publishedAt": "2020-04-24T12:22:00Z", "content": "The Hubble Space Telescope launched on the 24th of April, 30 years ago. Its an impressive milestone especially as its expected lifespan was just 10 years.\r\nOne of the primary reasons for the Hubble telescopes longevity is that it can be serviced and improved … [+6948 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Raelene Castle was simply the scapegoat, says Andrew Forrest - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-24T12:15:00Z", "content": null}, {"source": {"id": null, "name": "Heraldsun.com.au"}, "author": null, "title": "Virgin Australia aircraft blocked in Perth as collapse could domino air route shutdown across the country - Herald Sun", "description": "Subscribe to the Herald Sun to get unrestricted digital access, home paper delivery, Foxsports.com.au subscription,  Apps for iPad and Android and much more...", "url": "https://www.heraldsun.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-24T12:03:00Z", "content": null}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": "Jennifer Dudley-Nicholson, Tom Minear, John Rolfe, Clare Armstrong, Sue Dunlevy, staff writers", "title": "Coronavirus: Scott Morrison gives update, Donald Trump suggests new ways of fighting virus - Daily Telegraph", "description": "Scott Morrison has said new guidelines are coming on a range of restrictions in place, and Australians can expect the COVID-19 contact tracing app soon.", "url": "https://www.dailytelegraph.com.au/coronavirus/australias-covid19-daily-increase-drops-as-nations-considers-easing-some-restrictions/news-story/e19add26ffbd63a46d9ee92e2d52648d", "urlToImage": null, "publishedAt": "2020-04-24T10:30:02Z", "content": "<ul><li>New Aussie guidelines for exercise, schools, aged care coming</li><li>Donald Trump suggests new ways to fight coronavirus</li><li>China puts city of 10 million into lockdown</li><li>UK bank warns of worst recession in centuries</li></ul>Scott Morrison… [+21298 chars]"}, {"source": {"id": null, "name": "Onestepoffthegrid.com.au"}, "author": "Sophie Vorrath", "title": "NSW paves way for more – and bigger – rooftop solar systems - One Step Off The Grid", "description": "NSW government unveils further relaxations to renewable energy development policy, paving way for installation of larger residential and commercial rooftop solar systems.", "url": "https://onestepoffthegrid.com.au/nsw-paves-way-for-more-and-bigger-rooftop-solar-systems/", "urlToImage": null, "publishedAt": "2020-04-24T01:21:37Z", "content": "The New South Wales government has unveiled further relaxations to laws governing renewable energy development, paving the way for the installation of larger residential and commercial rooftop solar systems across the state.\r\nThe new amendments to the State E… [+2992 chars]"}]}