{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Skynews.com.au"}, "author": null, "title": "Porsche driver's home vandalised overnight - Sky News Australia", "description": "Vandals have spray painted the word 'DIE' on the home of a driver involved in a truck crash that killed four Victorian police officers.\n\nPolice say Richard Pusey's Fitzroy home was attacked around 4 o'clock on Saturday morning.\n\nThe 41-year-old is facing nine…", "url": "https://www.skynews.com.au/details/_6152008406001", "urlToImage": null, "publishedAt": "2020-04-25T10:27:51Z", "content": null}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Alle McMahon", "title": "Victoria Police: Crash victim’s parents share ‘proudest moment’ after losing ‘loving’ son - NEWS.com.au", "description": "Victoria Police: Crash victim’s parents share ‘proudest moment’ after losing ‘loving’ son", "url": "https://www.news.com.au/national/victoria/news/victoria-police-crash-victims-parents-share-proudest-moment-after-losing-loving-son/news-story/da46d1590de0375e580b0bedee1f3e3a", "urlToImage": null, "publishedAt": "2020-04-25T09:49:41Z", "content": "The devastated parents of one of the four Victoria Police officers killed in a horrific crash in Melbourne this week say they are broken after losing their loving son.Constable Josh Prestney, 28, died alongside Leading Senior Constable Lynette Taylor, Senior … [+2969 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Calla Wahlquist, Naaman Zhou, Josh Taylor", "title": "Australia coronavirus news: sixth Newmarch House aged care resident dies – as it happened - The Guardian", "description": "Australians mark Gallipolli landing in driveway services under physical distancing rules as nationwide Covid-19 testing kicks off. This blog is now closed", "url": "https://www.theguardian.com/news/live/2020/apr/25/australia-coronavirus-latest-updates-nsw-victoria-queensland-covid-19-testing-latest-news", "urlToImage": null, "publishedAt": "2020-04-25T09:33:47Z", "content": "Australians mark Gallipolli landing in driveway services under physical distancing rules as nationwide Covid-19 testing kicks off. This blog is now closed"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Calla Wahlquist", "title": "Health authorities defend handling of coronavirus cluster at Melbourne psychiatric facility - The Guardian", "description": "Fifteen people, including six patients, from the Albert Road Clinic have tested positive to Covid-19 since 24 March", "url": "https://www.theguardian.com/australia-news/2020/apr/25/health-authorities-defend-handling-of-coronavirus-cluster-at-melbourne-psychiatric-facility", "urlToImage": null, "publishedAt": "2020-04-25T09:33:43Z", "content": "Victorian health authorities have defended their response to a coronavirus outbreak in an inpatient psychiatric facility after staff and patients were not told of the cluster until one month after the first positive test.\r\nMeanwhile more than 180 Australians … [+4243 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Trump was being \"sarcastic\" when he suggested injecting disinfectant to treat COVID-19 | ABC News - ABC News (Australia)", "description": "A major maker of disinfectant has warned against ingesting its cleaning products after the US President suggested it could be a possible treatment for corona...", "url": "https://www.youtube.com/watch?v=CvXJDPb9P4U", "urlToImage": null, "publishedAt": "2020-04-25T08:29:07Z", "content": "A major maker of disinfectant has warned against ingesting its cleaning products after the US President suggested it could be a possible treatment for coronavirus.\r\nHis comments also prompted health experts to issue urgent advice, but Donald Trump now says he… [+544 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Sarah McPhee", "title": "Adelaide crash: Two women dead after 'horrific' collision in Urrbrae - NEWS.com.au", "description": "Adelaide crash: Two women dead after 'horrific' collision in Urrbrae", "url": "https://www.news.com.au/national/south-australia/adelaide-crash-horrific-multivehicle-collision-on-cross-rd-urrbrae/news-story/a90b8596f9d5c92c5b7788da17d9c98d", "urlToImage": null, "publishedAt": "2020-04-25T08:26:15Z", "content": "Two women travelling in separate cars have died and a young man has been seriously injured after a three-vehicle crash in Adelaide leaving debris strewn for hundreds of metres. Emergency services including SA Police, a HAZMAT response team, paramedics and the… [+1338 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Farrah Tomazin", "title": "Ahead of the curve: five other countries winning the battle against coronavirus - The Age", "description": "Countries that succeed in tackling their infection rates  - such as Australia - have many different challenges but one common enemy - the coronavirus. We look at five places that acted early and tested widely in the fight against the pandemic.", "url": "https://www.smh.com.au/world/asia/ahead-of-the-curve-five-other-nations-winning-the-battle-against-coronavirus-20200424-p54my1.html", "urlToImage": null, "publishedAt": "2020-04-25T08:13:29Z", "content": "Despite their proximity to the source, Taiwans 24 million residents have managed to avoid the kind of lockdowns Australians have faced.\r\nBy Friday morning, the island known for staring down Beijing had only recorded six coronavirus deaths and 427 confirmed ca… [+8257 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/peta-fuller/11746470", "title": "Sentinel testing will be part of the strategy before Australia's coronavirus restrictions are potentially eased - ABC News", "description": "Australians are seeing more days with low (or even no) new coronavirus cases in their state. But alone, that's not enough to see restrictions ease. Can more testing help?", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-sentinel-testing-surveillance-testing-covid-19/12180274", "urlToImage": null, "publishedAt": "2020-04-25T07:58:12Z", "content": "Updated \r\nApril 25, 2020 17:10:08\r\nThere's a new testing buzzword in Australia and it might sound slightly ominous sentinel surveillance or sentinel testing.\r\nAs our COVID-19 case rates slow, it's part of the next step to staying on top of infection rates in … [+5412 chars]"}, {"source": {"id": null, "name": "Brisbanetimes.com.au"}, "author": "Jocelyn Garcia", "title": "Queensland's weekly COVID-19 tally drops by more than two thirds - Brisbane Times", "description": "The coronavirus case total has risen to 1026. Police have fined 33 people in the past 24 hours for breaching public health directions. Since March 27, 1,354 fines have been dished out.", "url": "https://www.brisbanetimes.com.au/national/queensland/queensland-s-weekly-covid-19-tally-drops-by-more-than-two-thirds-20200425-p54n6y.html", "urlToImage": null, "publishedAt": "2020-04-25T07:42:00Z", "content": "Chief Health Officer Jeannette Young said 964 of the confirmed patients in Queensland had recently travelled overseas or had close contact with a confirmed case, such as their partner or flatmate.\r\nPolice have fined 33 people in the past 24 hours for breachin… [+1102 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Alle McMahon", "title": "Coronavirus Australia: Big changes that will affect Aussie life over the coming months - NEWS.com.au", "description": "Coronavirus Australia: Big changes that will affect Aussie life", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-australia-big-changes-that-will-affect-aussie-life/news-story/ec24e2ad30e9c781bc070390d740c223", "urlToImage": null, "publishedAt": "2020-04-25T07:34:25Z", "content": "Australia has now reached the third wave of the coronavirus, the Prime Minister has declared.First there was the “export phase”, when the virus spread from Wuhan to countries across the globe. Then there was the “repatriation phase”, when overseas travellers … [+7293 chars]"}, {"source": {"id": null, "name": "Northerndailyleader.com.au"}, "author": "Claudia Thaler", "title": "Russian ship docks with space station - The Northern Daily Leader", "description": "A Russian cargo ship has docked with the International Space Station, delivering more than 2.5 tonnes of food, fuel, equipment for experiments and other suppl...", "url": "https://www.northerndailyleader.com.au/story/6735252/russian-ship-docks-with-space-station/?cs=5461", "urlToImage": null, "publishedAt": "2020-04-25T07:01:06Z", "content": ""}, {"source": {"id": null, "name": "Fool.com.au"}, "author": null, "title": "5 top ASX shares to buy in May - Motley Fool Australia", "description": "Afterpay Ltd (ASX:APT) and CSL Limited (ASX:CSL) are two of five ASX shares to consider buying for your portfolio in May...", "url": "https://www.fool.com.au/2020/04/25/5-top-asx-shares-to-buy-in-may/", "urlToImage": null, "publishedAt": "2020-04-25T06:41:34Z", "content": "While the S&amp;P/ASX 200 Index (ASX: XJO) falling from grace over the last couple of months has been disappointing, one positive is that it has brought some high quality shares down to more attractive levels.\r\nIn light of this, I think now could be an opport… [+4143 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Pam Whaley", "title": "Peter V'landys says NRL plans to honour COVID-19 health workers in State of Origin series - Wide World of Sports", "description": "'There's a few things we can do in that period'", "url": "https://wwos.nine.com.au/nrl/nrl-look-honour-health-workers-at-origin/d06ca541-9319-48e2-a105-cf21d6c93986", "urlToImage": null, "publishedAt": "2020-04-25T05:44:42Z", "content": "A three-game State of Origin series will be held at the end of the year with hopes the NRL can reward health workers and attract a safe crowd.\r\nWhile a competition structure is still unknown, ARLC chairman Peter V'landys has confirmed the NRL will move it's b… [+1809 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/paige-cockburn/7065460", "title": "Coronavirus cases in NSW rise again, beachgoers slammed for not keeping social distance - ABC News", "description": "The number of new coronavirus cases in NSW is back in double digits as the state's Health Minister expresses his agitation over people ignoring social distancing rules on three Sydney beaches which have since been shut again.", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-nsw-cases-rise-by-12-people-crowd-randwick-beaches/12184422", "urlToImage": null, "publishedAt": "2020-04-25T05:12:54Z", "content": "Updated \r\nApril 25, 2020 16:26:51\r\nThe NSW Health Minister has expressed his disappointment in people who flouted social distancing rules on Sydney beaches after council relaxed the lockdown for their benefit.\r\nKey points:\r\n<ul><li>There were 12 new coronavir… [+4182 chars]"}, {"source": {"id": null, "name": "Executivetraveller.com"}, "author": "David Flynn", "title": "Virgin Australia Mk II could launch in as little as three months - Executive Traveller", "description": "Virgin's administrators want to see a new owner in place by the end of June.", "url": "https://www.executivetraveller.com/news/virgin-australia-could-be-flying-again-in-as-little-as-three-months", "urlToImage": null, "publishedAt": "2020-04-25T05:11:14Z", "content": "A reborn Virgin Australia could be flying in as little as three months, with administrators seeking to lock down offers from potential new owners by the middle of June.\r\n\"This is not intended to be a long protracted process,\" Deloitte partner and administrato… [+6253 chars]"}, {"source": {"id": null, "name": "Fool.com.au"}, "author": null, "title": "Forget gold. I'd buy bargain dividend stocks today to get rich and retire early - Motley Fool Australia", "description": "Buying undervalued dividend stocks today could be a more profitable long-term move than buying gold.", "url": "https://www.fool.com.au/2020/04/25/forget-gold-id-buy-bargain-dividend-stocks-today-to-get-rich-and-retire-early/", "urlToImage": null, "publishedAt": "2020-04-25T04:55:30Z", "content": "The recent stock market crash may have caused many investors to doubt the appeal of equities. After all, their prices declined by a significant amount in a very short period of time. Looking ahead, further falls in the stock market would not be a major surpri… [+4116 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Ex-Wanderer: The club 'went to s***' when Popovic left - SBS - The World Game", "description": "Former Western Sydney Wanderers defender Abdelrahman Kuku has opened up about his frustration at not getting an opportunity in the A-League and says the club has still not recovered from the departure of Tony Popovic.", "url": "https://theworldgame.sbs.com.au/ex-wanderer-the-club-went-to-s-when-popovic-left", "urlToImage": null, "publishedAt": "2020-04-25T03:10:00Z", "content": "Kuku joined the Wanderers youth set-up in 2014 and worked his way up through the clubs ranks. But unable to break through into the senior team, he moved to America to take up a full athletic scholarship at Eastern Florida State College in 2018.\r\nThe 21-year-o… [+4300 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Former Broncos star Daniel Vidot makes WWE Smackdown debut - Fox Sports", "description": "<b>Tune into our new show Fox League Live on Channel 502 Monday to Friday at 6.30pm and on Saturday at 3pm and Sunday at 5pm.</b>", "url": "https://www.foxsports.com.au/nrl/nrl-premiership/nrl-2020-daniel-vidot-wwe-smackdown-debut-brisbane-broncos-rugby-league/news-story/547c2c589f14894482608abf3ffee303", "urlToImage": null, "publishedAt": "2020-04-25T03:03:00Z", "content": "Former NRL player Daniel Vidot has taken his wrestling career to even greater heights making his WWE SmackDown debut during the coronavirus pandemic.\r\nVidot made the unlikely career switch after his rugby league life came to an end in 2017.\r\nWatch Foxtel in a… [+1615 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/marian--faa/11259998", "title": "Grieving Cairns mum granted permission to travel to US to attend 20yo son's funeral - ABC News", "description": "As Australians spend the day commemorating fallen soldiers, one Queensland mother flies to the US after her son dies following a military training exercise.", "url": "https://www.abc.net.au/news/2020-04-25/cairns-mum-rushing-to-united-states-for-20yo-son-funeral/12182724", "urlToImage": null, "publishedAt": "2020-04-25T02:59:34Z", "content": "Updated \r\nApril 25, 2020 15:07:53\r\nAs Australians spend the day commemorating fallen soldiers, one Queensland mother is en route to the United States after her 20-year-old son died suddenly following a military training exercise there last week.\r\nLeonid \"Leon… [+3918 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Maddison Leach", "title": "Why the Queen sees Harry as the royal family's 'prodigal son' - 9Honey", "description": "", "url": "https://honey.nine.com.au/royals/prince-harry-megahn-markle-royal-exit-royals-queen/b4a8378d-4092-4820-a46b-ddda0b76f7fe", "urlToImage": null, "publishedAt": "2020-04-25T02:35:38Z", "content": "It hasn't even been a full month since Prince Harry and Meghan Markle left the royal family, but some royal experts are sure they'll return eventually.\r\nAnd it seems the Queen herself may feel the same way, Ingrid Seward, editor-in-chief of Majesty magazine, … [+2383 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Latika Bourke, Sally Rawsthorne", "title": "Coronavirus updates LIVE: Scott Morrison says social distancing won't apply to schools, global COVID-19 cases surpass 2.7 million, Australian death toll stands at 80 - The Sydney Morning Herald", "description": "If you suspect you or a family member has coronavirus you should call (not visit) your GP or ring the national Coronavirus Health Information Hotline on 1800 020 080.", "url": "https://www.smh.com.au/national/coronavirus-updates-live-scott-morrison-says-social-distancing-won-t-apply-to-schools-global-covid-19-cases-surpass-2-7-million-australian-death-toll-stands-at-80-20200424-p54n21.html", "urlToImage": null, "publishedAt": "2020-04-25T02:19:00Z", "content": "Six residents have now died of coronavirus at the aged care home. \r\n\"To the family of that lady, I want to express all of the community's condolences,\" Mr Hazzard said.\r\nThere is now a total of 48 cases at Newmarch House, comprised of 17 staff and 31 resident… [+947 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Brazil President Jair Bolsonaro in crisis mode after losing another key minister - SBS News", "description": "Brazil's President Jair Bolsonaro has lost another key minister, and continues to play down the country's growing coronavirus outbreak.", "url": "https://www.sbs.com.au/news/brazil-president-jair-bolsonaro-in-crisis-mode-after-losing-another-key-minister", "urlToImage": null, "publishedAt": "2020-04-25T02:09:49Z", "content": "As Brazil veers closer to becoming a coronavirus pandemic hotspot, its government has been riven with internal dissent.\r\nJustice Minister Sergio Moro, a popular crusader against corruption, resigned on Friday alleging political interference in the federal pol… [+1999 chars]"}, {"source": {"id": null, "name": "Themercury.com.au"}, "author": null, "title": "Tenth coronavirus death confirmed in Tasmania - The Mercury", "description": "TASMANIA has recorded its tenth death from coronavirus, the State Government confirmed this morning.", "url": "https://www.themercury.com.au/news/coronavirus/tenth-coronavirus-death-confirmed-in-tasmania/news-story/b0735b1759ca24cf164784fdf58f5ad0", "urlToImage": null, "publishedAt": "2020-04-25T01:33:00Z", "content": "TASMANIA has recorded its tenth death from coronavirus, the State Government confirmed this morning.\r\nPremier Peter Gutwein issued a statement which said a 90-year-old man from the North-West died late Friday from the virus.\r\nThe man was being cared for at th… [+1055 chars]"}, {"source": {"id": null, "name": "Watoday.com.au"}, "author": "Nathan Hondros", "title": "Qantas rips into Perth Airport amid blockade of Virgin Australia aircraft - Sydney Morning Herald", "description": "Qantas has delivered a stinging rebuke to Perth Airport over its standoff with Virgin Australia, defending it rivals over millions in outstanding invoices.", "url": "https://www.watoday.com.au/national/western-australia/qantas-rips-into-perth-airport-amid-blockade-of-virgin-australia-aircraft-20200425-p54n5n.html", "urlToImage": null, "publishedAt": "2020-04-25T01:05:36Z", "content": "\"It's no way to treat a customer of 20 years. This kind of action is deeply worrying for all users of Perth Airport.\r\n\"We have our own dispute with Perth Airport over excessive charges, which has been going through the courts for over a year.\r\n\"As part of tha… [+1882 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "By LOLITA C. BALDOR and ROBERT BURNS", "title": "US Navy recommends return of fired captain - NEWS.com.au", "description": "US Navy recommends return of fired captain", "url": "https://www.news.com.au/world/breaking-news/us-navy-recommends-return-of-fired-captain/news-story/50fd60f2f3f5d801f606cdf6f228f466", "urlToImage": null, "publishedAt": "2020-04-24T22:32:54Z", "content": "The top Navy officer has recommended the reinstatement of the aircraft carrier captain fired for sending a fraught email to commanders pleading for faster action to protect his crew from a coronavirus outbreak, officials familiar with the investigation say.Ad… [+3979 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/abc-local/sophie-kesteven/7149610", "title": "Raquel is working from home during coronavirus — and that means sloths in the spare room - ABC News", "description": "Working from home means different things for different people. For Raquel, it means moving three very lazy — but very cute — new housemates into the spare room.", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-panama-working-from-home-with-sloths/12169922", "urlToImage": null, "publishedAt": "2020-04-24T22:29:37Z", "content": "Updated \r\nApril 25, 2020 08:23:26\r\nWorking from home is the new normal for many people and for Raquel Cruz Alpizar, it's meant moving three unlikely new housemates into her spare room.\r\nSince coronavirus restrictions took hold, she's been caring around the cl… [+6272 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": null, "title": "Captain Tom Moore becomes oldest person to top Britain's music chart - The Age", "description": "A World War II veteran who raised millions for charity has now become the oldest person to top Britain's main music chart.", "url": "https://www.smh.com.au/world/europe/captain-tom-moore-becomes-oldest-person-to-top-britain-s-music-chart-20200425-p54n4v.html", "urlToImage": null, "publishedAt": "2020-04-24T20:40:50Z", "content": "He also went to No.1 on the music charts - with a little help from a friend.\r\nThe cover version of You'll Never Walk Alone that Moore appears on with singer Michael Ball was on course to be pipped by The Weeknd's Blinding Lights, until the Canadian star asked… [+1312 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Bret Harris", "title": "Raelene Castle becomes latest casualty of Australia's flawed rugby system - The Guardian", "description": "Did the tenure of the first woman to fill the role of Rugby Australia chief executive really end in failure?", "url": "https://www.theguardian.com/sport/2020/apr/25/raelene-castle-becomes-latest-casualty-of-australias-flawed-rugby-system", "urlToImage": null, "publishedAt": "2020-04-24T20:00:00Z", "content": "Under siege for several months, Raelene Castle tendered her resignation to Rugby Australia just three days after the publication of a letter co-authored by 11 unhappy former Wallabies captains calling for leadership change. The letter was the last straw for C… [+4817 chars]"}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Mary Meisenzahl", "title": "Facebook's new video chat Zoom competitor is coming soon — here's how the new feature works - Business Insider Australia", "description": "Facebook CEO Mark Zuckerberg announced on Friday the company is introducing 50-person video chatrooms.", "url": "https://www.businessinsider.com.au/facebook-messenger-rooms-video-chat-zoom-walkthrough-like-zoom-2020-4", "urlToImage": null, "publishedAt": "2020-04-24T19:44:33Z", "content": "<ul><li>Facebook just announced 50-person video chatrooms called Messenger Rooms.</li><li>\r\nThe new Messenger Rooms have some features in common with other video calling apps, like Zoom and Houseparty.\r\n</li><li>\r\nThe company says Messenger Rooms will be comi… [+3605 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": null, "name": "Standard.net.au"}, "author": "Andi Yu", "title": "New Vic laws and virus outbreak probe - Warrnambool Standard", "description": "Emergency laws to combat the effects of coronavirus on the Victorian economy and the investigation of an outbreak at a Melbourne psychiatric facility are the...", "url": "https://www.standard.net.au/story/6734968/new-vic-laws-and-virus-outbreak-probe/?cs=10264", "urlToImage": null, "publishedAt": "2020-04-24T17:31:40Z", "content": ""}, {"source": {"id": null, "name": "Zdnet.com"}, "author": "Daphne Leprince-Ringuet", "title": "Coronavirus contact-tracing app: Here’s how we’ll protect your privacy, says NHS - ZDNet", "description": "NHS insists the public's data is safe in the hands of the health services. Privacy campaigners want more detail.", "url": "https://www.zdnet.com/article/coronavirus-contact-tracing-app-heres-how-well-protect-your-privacy-says-nhs/", "urlToImage": null, "publishedAt": "2020-04-24T14:18:00Z", "content": "To earn the trust of the public, privacy will be fundamental to the building the coronavirus contact-tracing app that the UK government is working on, NHSX boss Matthew Gould has said in a new post detailing the organization's commitment to confidentiality - … [+6376 chars]"}, {"source": {"id": null, "name": "Theconversation.com"}, "author": "Rodger I. Thompson", "title": "How the Hubble Space Telescope opened our eyes to the first galaxies of the universe - The Conversation US", "description": "Thirty years ago the Hubble Space Telescope began snapping photos of distant stars, providing a time machine that has taken astronomers back to when the universe was less than a billion years old.", "url": "https://theconversation.com/how-the-hubble-space-telescope-opened-our-eyes-to-the-first-galaxies-of-the-universe-133877", "urlToImage": null, "publishedAt": "2020-04-24T12:22:00Z", "content": "The Hubble Space Telescope launched on the 24th of April, 30 years ago. Its an impressive milestone especially as its expected lifespan was just 10 years.\r\nOne of the primary reasons for the Hubble telescopes longevity is that it can be serviced and improved … [+6948 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Raelene Castle was simply the scapegoat, says Andrew Forrest - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-24T12:15:00Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Rachel England", "title": "Nintendo blocks legacy logins after 160,000 accounts were compromised (update) - Yahoo Finance Australia", "description": "Some 160,000 Switch users have been the subject of a data breach.", "url": "https://au.finance.yahoo.com/news/nintendo-blocks-legacy-logins-data-breach-account-120610588.html", "urlToImage": null, "publishedAt": "2020-04-24T12:06:00Z", "content": "Nintendo has shut down NNID logins and is encouraging Switch owners to lock down their accounts after a wave of fraudulent attacks. Nintendo itself has confirmed that the platform has fallen foul of hackers, who are accessing accounts and using linked PayPal … [+3633 chars]"}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "Bang Showbiz", "title": "Tom Hanks gifts Corona-branded typewriter to bullied Australian boy named Corona - PerthNow", "description": "The actor sent a heartwarming letter and gift to a young Australian boy named Corona after he revealed he had been bullied over his moniker.", "url": "https://www.perthnow.com.au/entertainment/celebrity-gossip/tom-hanks-gifts-corona-branded-typewriter-to-bullied-australian-boy-named-corona-ng-b881529498z", "urlToImage": null, "publishedAt": "2020-04-24T07:38:48Z", "content": "Tom Hanks has sent a typewriter to a young Australian boy named Corona after he revealed he had been bullied over his moniker.\r\nThe Castaway actor wrote a kind note to eight-year-old Corona De Vries after the young Australian sent him a letter when he and wif… [+1519 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Apple says ‘no evidence’ a flaw in iPhone email app is security risk for customers - 7NEWS.com.au", "description": "A flaw in an iPhone email app has been exposed but Apple says there is no security risk to its more than half a billion users.", "url": "https://7news.com.au/technology/apple-says-no-evidence-a-flaw-in-iphone-email-app-is-security-risk-for-customers-c-997338", "urlToImage": null, "publishedAt": "2020-04-24T07:01:00Z", "content": "Apple Inc says it has found no evidence a flaw in its email app for iPhones and iPads has been used against customers.\r\nAnd it believes the flaw does not pose an immediate risk to our users.\r\nWatch the video above\r\nSan Francisco-based security firm ZecOps on … [+1400 chars]"}, {"source": {"id": null, "name": "Clicklancashire.com"}, "author": null, "title": "Doctors Warn CCP Virus Might Cause Strokes in Young Adults - ClickLancashire", "description": "", "url": "https://clicklancashire.com/2020/04/23/doctors-warn-ccp-virus-might-cause-strokes-in-young-adults.html", "urlToImage": null, "publishedAt": "2020-04-23T16:49:09Z", "content": "Approximately 12 per cent of patients in the study needed ventilators, CNN reports. Another 41 percent had obesity, while 33 percent suffered from diabetes.\r\nDr. Terry Tsue, vice president of Clinical Services and physician in chief at the University of Kansa… [+2001 chars]"}]}