{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/ariel-bogle/9224490", "title": "COVIDSafe's effectiveness on iPhone in question as Government releases coronavirus contact tracing app - ABC News", "description": "The iPhone app may not work effectively if too many other Bluetooth apps are running.", "url": "https://www.abc.net.au/news/2020-04-26/coronavirus-tracing-app-covidsafe-apple-iphone-covid-19/12187448", "urlToImage": null, "publishedAt": "2020-04-26T10:18:52Z", "content": "Updated \r\nApril 26, 2020 19:19:30\r\nThe Government wants 40 per cent of Australians to use its contact tracing app COVIDSafe, but questions remain about the technology's performance on iPhone.\r\nKey points:\r\n<ul><li>If an iPhone is in low power mode, it reduces… [+6400 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Coronavirus update: Wuhan says there are no COVID-19 patients left in its hospitals as China reports no deaths for 11th straight day - ABC News", "description": "China records zero COVID-19-related deaths for the 11th straight day, and the city of Wuhan reports zero COVID-19 patients remain in its hospitals.", "url": "https://www.abc.net.au/news/2020-04-26/coronavirus-update-australia-covid19-april-26-death-toll-200000/12185414", "urlToImage": null, "publishedAt": "2020-04-26T10:02:57Z", "content": "Updated \r\nApril 26, 2020 20:26:43\r\nThe city of Wuhan, where the global coronavirus pandemic began, says there are no remaining cases in its hospitals, as China reports no COVID-19-related deaths for the 11th day in a row.\r\nIn Australia, some states are easing… [+20603 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Carly Cassella", "title": "Ancient Australian Rocks Suggest Earth's Continents Were Shifting Earlier Than Thought - ScienceAlert", "description": "Earth's continents are constantly on the move, it's a key feature of our planet, but that wasn't always the case.", "url": "https://www.sciencealert.com/ancient-australian-rocks-suggest-earth-s-continents-have-been-moving-for-over-3-billion-years", "urlToImage": null, "publishedAt": "2020-04-26T09:40:49Z", "content": "Earth's continents are constantly on the move, it's a key feature of our planet, but that wasn't always the case.\r\nWhile some scientists think Earth's tectonic plates began pushing and pulling only a billion years ago, others think the whole process started n… [+4081 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "David Nield", "title": "Scientists Have Recreated Medieval Battles to Solve Debate Over Ancient Bronze Swords - ScienceAlert", "description": "Bronze swords made from copper and tin aren't the most robust of weapons, which has led to some uncertainty about whether they were originally used for battle or just for show.", "url": "https://www.sciencealert.com/scientists-trade-blows-in-a-debate-over-whether-ancient-bronze-swords-were-just-for-show", "urlToImage": null, "publishedAt": "2020-04-26T09:25:44Z", "content": "Bronze swords made from copper and tin aren't the most robust of weapons, which has led to some uncertainty about whether they were originally used for battle or just for show.\r\nNow, a group of archaeologists has tried to settle the debate by quite literally … [+3240 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Ben Grubb", "title": "The coronavirus tracing app gets a privacy tick, but it will test Australians’ trust - Sydney Morning Herald", "description": "The government says it has done enough to protect Australians' privacy when it comes to its coronavirus tracing app - and it looks like it might be about right.", "url": "https://www.smh.com.au/politics/federal/the-coronavirus-tracing-app-gets-a-privacy-tick-but-it-will-test-australians-trust-20200426-p54nd2.html", "urlToImage": null, "publishedAt": "2020-04-26T08:01:34Z", "content": "Australians are desperate to see each other again and if this technology is adopted widely, it could see the easing of social gathering restrictions and be used to contain coronavirus outbreaks.\r\nHowever, in Singapore, where a similar app was designed, the bi… [+2824 chars]"}, {"source": {"id": null, "name": "Bunburymail.com.au"}, "author": null, "title": "SA hospital numbers down amid COVID-19 - Bunbury Mail", "description": "South Australia has recorded no new cases of coronavirus for the fourth consecutive day, as the state government urged people with other serious medical issue...", "url": "https://www.bunburymail.com.au/story/6735327/sa-hospital-numbers-down-amid-covid-19/", "urlToImage": null, "publishedAt": "2020-04-26T06:57:20Z", "content": "South Australia has recorded no new cases of coronavirus for the fourth consecutive day, as the state government urged people with other serious medical issues to not let the pandemic stop them seeking help.\r\nThe state has confirmed a total of 438 cases, but … [+1837 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "The Patriots tried to draft a Tom Brady replacement. They failed, and now have nobody - Fox Sports", "description": "The Patriots didn’t find a replacement for Tom Brady in the draft, if that was even possible.", "url": "https://www.foxsports.com.au/nfl/nfl-news-tom-brady-replacement-nfl-draft-new-england-patriots-qb-situation-jarrett-stidham-brian-hoyer/news-story/bbaf77594b6256668faa1b68788268ac", "urlToImage": null, "publishedAt": "2020-04-26T06:53:00Z", "content": "But they did address almost every other one of their needs.\r\nNew England entered the draft with 12 picks and after making several trades over three days wound up selecting 10 players.\r\nPatriots coach Bill Belichick acknowledged the team made an attempt to add… [+4127 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Adrianna Zappavigna", "title": "Coronavirus Australia: WA attempts ‘cautious relaxation’ of restrictions from tomorrow - NEWS.com.au", "description": "Coronavirus: Western Australia attempts ‘cautious relaxation’ of lockdown restrictions", "url": "https://www.news.com.au/world/coronavirus/australia/coronavirus-western-australia-attempts-cautious-relaxation-of-lockdown-restrictions/news-story/acafbedc3c91355804686859067ba2ca", "urlToImage": null, "publishedAt": "2020-04-26T06:48:14Z", "content": "Western Australia has announced today that it will cautiously relax its coronavirus restrictions, but all are encouraged to continue practising social distancing. From Monday, up to 10 people will be allowed to gather for non-work activities, as the state rec… [+2286 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Sumeyya Ilanbey", "title": "Victoria won't consider easing restrictions before May 11: health chief - Sydney Morning Herald", "description": "The Victorian government ruled out following in the footsteps of other states which have begun easing some restrictions.", "url": "https://www.theage.com.au/national/victoria/victoria-won-t-consider-easing-restrictions-before-may-11-health-chief-20200426-p54n93.html", "urlToImage": null, "publishedAt": "2020-04-26T06:45:24Z", "content": "Health Minister Jenny Mikakos has rejected any notion of isolation measures being lifted sooner in rural and regional Victoria, where there have been fewer coronavirus cases compared with metropolitan Melbourne and Geelong.\r\n\"There might be some changes to cl… [+3693 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Adam Carey", "title": "Classroom hours slashed for teaching students to avoid educator shortage - The Age", "description": "This year’s crop of teaching graduates will be allowed to enter the profession with 25 per cent less classroom experience, in response to COVID-19.", "url": "https://www.theage.com.au/national/victoria/classroom-hours-slashed-for-teaching-students-to-avoid-teacher-drought-20200426-p54ncf.html", "urlToImage": null, "publishedAt": "2020-04-26T06:24:12Z", "content": "Victorian Education Minister James Merlino said the government was adjusting placement and registration requirements to make it easier for teachers to do their work during the pandemic.\r\nWith many students now learning from home, teaching students and current… [+1618 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Jamie Seidel", "title": "PLAN C: Our last hope if virus vaccine comes to nothing - Big Rigs", "description": "Coronavirus vaccines and treatment are in development, but what is the world’s Plan C?", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-vaccines-and-treatment-are-in-development-but-what-is-the-worlds-plan-c/news-story/082aa3bdda2ee957d532ec1e4605726c", "urlToImage": null, "publishedAt": "2020-04-26T05:20:30Z", "content": "Will a vaccine save us from COVID-19? What about new treatments for its symptoms?Indications are, we may have to find a Plan C.Billions of people are confined to our homes. We can’t go to the beach. The office. Or school. It’s the bluntest possible response t… [+8397 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Kristine Tarbert", "title": "'Moved on': Former judge Gary Mehigan breaks silence on new MasterChef - Lifestyle", "description": "Gary Mehigan was a judge on the show alongside Matt Preston and George Calombaris for ten years.", "url": "https://au.lifestyle.yahoo.com/gary-mehigan-new-masterchef-legacy-045408196.html", "urlToImage": null, "publishedAt": "2020-04-26T05:02:42Z", "content": "The latest season of MasterChef has been kicking goals so far - a hit with fans, and doing well in the ratings - and now former judge Gary Mehigan broken his silence after leaving the show last year.\r\nGary was a judge on the show alongside Matt Preston and Ge… [+2231 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Denied Govt bailout, Richard Branson seeks buyer for Virgin Atlantic - Executive Traveller", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=be485430-87ab-11ea-a90c-19b1f946e45e&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNC0yNS9yaWNoYXJkLWJyYW5zb24tc2Vla2luZy1idXllci1mb3ItdmlyZ2luLWF0bGFudGljLXRlbGVncmFwaA==", "urlToImage": null, "publishedAt": "2020-04-26T05:00:00Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": null, "name": "Heraldsun.com.au"}, "author": null, "title": "The best Aussie singers of all time - Herald Sun", "description": "Subscribe to the Herald Sun to get unrestricted digital access, home paper delivery, Foxsports.com.au subscription,  Apps for iPad and Android and much more...", "url": "https://www.heraldsun.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-26T04:37:06Z", "content": null}, {"source": {"id": null, "name": "9news.com.au"}, "author": "Lara Pearce", "title": "Ten hospital staff isolated after Sydney doctor tests positive - 9News", "description": "<p>Ten staff across two western Sydney hospitals are in isolation today after a doctor was diagnosed with COVID-19.</p>", "url": "https://www.9news.com.au/national/coronavirus-nsw-nepean-hospital-staff-in-isolation-after-doctor-tests-positive/196dcdf3-5e4f-4735-9bfd-680602167326", "urlToImage": null, "publishedAt": "2020-04-26T04:29:35Z", "content": "Property News: Creative ways people are staying connected during isolation - domain.com.au"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Rohan Smith", "title": "Coronavirus Australia: Qld and WA to lift some social distancing restrictions - NEWS.com.au", "description": "Coronavirus Australia: Queensland and Western Australia to lift some social distancing restrictions", "url": "https://www.news.com.au/world/coronavirus/australia/coronavirus-australia-qld-to-lift-some-social-distancing-restrictions/news-story/74e156e6e58852d33c90b068c3c22047", "urlToImage": null, "publishedAt": "2020-04-26T04:26:37Z", "content": "As Australia successfully flattens the coronavirus curve, some states have decided to cautiously relax restrictions.Queensland Premier Annastacia Palaszczuk announced some of the state's strict isolation measures would be relaxed on Saturday, May 2.\r\nSpeaking… [+5924 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Tim Elbra", "title": "Raelene Castle's exit as Rugby Australia CEO 'terrible', says Peter FitzSimons - Wide World of Sports", "description": "FitzSimons points the finger at Castle's main foe", "url": "https://wwos.nine.com.au/rugby/raelene-castle-rugby-australia-exit-terrible-peter-fitzsimons/ddb243f6-1574-45d9-b771-ef31226185f1", "urlToImage": null, "publishedAt": "2020-04-26T04:03:05Z", "content": "Raelene Castle's exit as Rugby Australia chief executive was a \"terrible\" look for the game, as was Phil Kearns' role as a chief agitator, former Wallaby Peter FitzSimons says.\r\nCastle left after losing the support of the board, but also amid claims of bullyi… [+3469 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Anthony Galloway", "title": "Australian intelligence officials treating reports of Kim Jong-un's ill health seriously - Sydney Morning Herald", "description": "Australian intelligence officials are treating reports of North Korea's leader Kim Jong-un ill health seriously, with concerns about the upheaval that would be created by a change of leader in the secretive and authoritarian state.", "url": "https://www.smh.com.au/world/asia/australian-intelligence-officials-treating-reports-of-kim-jong-un-s-ill-health-seriously-20200426-p54nbc.html", "urlToImage": null, "publishedAt": "2020-04-26T03:55:29Z", "content": "38North, the Washington think tank, cautioned that the train's presence \"does not prove the whereabouts of the North Korean leader or indicate anything about his health\".\r\n\"But it does lend weight to reports that Kim is staying at an elite area on the country… [+2355 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Two elderly men die of coronavirus, bringing national toll to 83 - SBS News", "description": "Two men in their 90s have died of coronavirus in Australia, bringing the national toll to 83.", "url": "https://www.sbs.com.au/news/two-elderly-men-die-of-coronavirus-bringing-national-toll-to-83", "urlToImage": null, "publishedAt": "2020-04-26T03:41:47Z", "content": "A total of 83 people have now died of COVID-19 in Australia. \r\nA man in his 90s died in hospital in Victoria, while in Tasmania another man in his 90s died at the Mersey hospital, it was announced on Sunday.\r\nAs it stands at 11.30am on Sunday, 36 people have … [+2815 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Yemen's separatist southern forces announce plans for self-rule, jeopardising Riyadh peace deal - ABC News", "description": "Yemen's separatist southern forces announce plans to establish a self-ruled administration, a move that would effectively end a November peace deal.", "url": "https://www.abc.net.au/news/2020-04-26/stc-announces-plan-for-self-rule-in-south-yemen/12186074", "urlToImage": null, "publishedAt": "2020-04-26T03:19:20Z", "content": "Posted \r\nApril 26, 2020 12:45:28\r\nYemen's separatist Southern Transitional Council (STC) has announced immediate plans to establish a self-ruled administration in the regions under their control, a move that would effectively end a November peace deal.\r\nKey p… [+2807 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "Leo Sun", "title": "Is NVIDIA’s Cloud Gaming Platform Already Dying? - The Motley Fool", "description": "The “Stadia killer” loses over half a dozen major publishers in just two months.", "url": "https://www.fool.com/investing/2020/04/25/is-nvidias-cloud-gaming-platform-already-dying.aspx", "urlToImage": null, "publishedAt": "2020-04-26T02:48:37Z", "content": "When NVIDIA (NASDAQ:NVDA) launched its cloud gaming platform GeForce Now in February, it seemed poised to disrupt the nascent market.\r\nUnlike Alphabet's (NASDAQ:GOOG)(NASDAQ:GOOGL) Google Stadia, which required gamers to repurchase games they already owned, G… [+4458 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "9Honey Celebrity with Variety", "title": "Broadway star Nick Cordero gets temporary pacemaker after leg amputation in COVID-19 battle - 9Honey", "description": "", "url": "https://celebrity.nine.com.au/latest/broadway-nick-cordero-temporary-pacemaker-leg-amputation-coronavirus/61ccda76-569a-41e7-bede-2b7f181f473a", "urlToImage": null, "publishedAt": "2020-04-26T02:31:00Z", "content": "LOS ANGELES (Variety.com) After doctors had to amputate his right leg last week, Broadway actor Nick Cordero has had a procedure to insert a temporary pacemaker in his heart, his wife Amanda Kloots announced.\r\nKloots, 39, gave the update on 41-year-old Corder… [+3555 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/11029686", "title": "The Netherlands will pay reparations to Indonesian victims of colonial atrocities. Could the UK do the same? - ABC News", "description": "Andi Monji's father was one of 200 men to be summarily executed at their village on the island of Sulawesi in January 1947.", "url": "https://www.abc.net.au/news/2020-04-26/netherlands-pay-reparations-indonesia-colonial-violence-1940s/12114892", "urlToImage": null, "publishedAt": "2020-04-26T02:20:38Z", "content": "Posted \r\nApril 26, 2020 08:06:56\r\nAndi Monji was 10 years old when he was forced to watch his father executed in front of him.\r\nThe 83-year-old Indonesian man, who had travelled to The Hague to testify in front of a Dutch court, was last month awarded 10,000 … [+7911 chars]"}, {"source": {"id": null, "name": "Fool.com.au"}, "author": null, "title": "Why this market crash can improve your chances of retiring wealthy! - Motley Fool Australia", "description": "Buying stocks while they trade at low prices and holding them over the long run could increase your chances of building a generous retirement nest egg.", "url": "https://www.fool.com.au/2020/04/26/why-this-market-crash-can-improve-your-chances-of-retiring-wealthy/", "urlToImage": null, "publishedAt": "2020-04-26T02:14:20Z", "content": "The recent stock market crash may have caused your portfolios valuation to decline. However, the track record of the stock market shows that it is very likely to recover in the coming years.\r\nAs such, through buying a wide range of high-quality stocks while t… [+3533 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "A-League QuaranTeam of the season challenge - SBS - The World Game", "description": "With the A-League regular season originally scheduled for an April end, it seems fitting we look back at the best that was before the coronavirus outbreak.", "url": "https://theworldgame.sbs.com.au/a-league-quaranteam-of-the-season-challenge", "urlToImage": null, "publishedAt": "2020-04-26T00:19:00Z", "content": "Sunday marked what would have been the final round of the 2019-20 campaign, with the leagues suspension since leaving fans, players and pundits all unsure of whats next.\r\nAlthough there were five rounds remaining in the season, the players produced several st… [+5588 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "'Filled with pain': parents of police officer killed in Melbourne crash speak of heartbreak - SBS News", "description": "The parents of Constable Josh Prestney, who was killed with three other officers in a freeway tragedy in Melbourne, say they cannot fathom their loss.", "url": "https://www.sbs.com.au/news/filled-with-pain-parents-of-police-officer-killed-in-melbourne-crash-speak-of-heartbreak", "urlToImage": null, "publishedAt": "2020-04-25T22:53:34Z", "content": "The parents of slain police officer Josh Prestney say they are filled with a pain that takes their breath away and are \"broken\".\r\nConstable Prestney was killed on Wednesday as a truck careered into him and three of his colleagues while they were dealing with … [+2516 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Andrew Reid", "title": "Paul Kent savages Peter FitzSimons over scathing NRL swipe - Yahoo Sport Australia", "description": "The rugby league journalist has slammed the outspoken former Wallaby's scathing attack on the NRL.", "url": "https://au.sports.yahoo.com/nrl-rugby-league-journalist-paul-kent-angry-peter-fitzsimons-swipe-224117646.html", "urlToImage": null, "publishedAt": "2020-04-25T22:41:00Z", "content": "Rugby league journalist Paul Kent has ripped into Peter FitzSimons after the former Wallaby went on the attack over the NRL's plans to resume competition next month.\r\nARL Commission chairman Peter V'landys has confirmed the NRL will have the final say on a ne… [+5131 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "COVID-19 study finds schools safe: report - SBS", "description": "A study of the NSW school students and staff who have tested positive for COVID-19 found an \"extraordinarily\" low rate of transmission in schools.", "url": "https://www.sbs.com.au/news/coronavirus-study-finds-schools-are-safe-for-teachers-and-students", "urlToImage": null, "publishedAt": "2020-04-25T22:28:01Z", "content": "There is no evidence students at NSW schools have infected staff with the coronavirus, according to a study cited by the federal government in its push to reopen schools.\r\nThe National Centre for Immunisation Research and Surveillance probe looked at all 18 c… [+1860 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Rebekah Scanlan", "title": "Coles shoppers going crazy for Monday $10 shampoo and conditioner - NEWS.com.au", "description": "The Beauty Diary by Rebekah Scanlan: Best new beauty buys, perfect for isolation", "url": "https://www.news.com.au/lifestyle/beauty/the-beauty-diary-by-rebekah-scanlan-best-new-beauty-buys-perfect-for-isolation/news-story/d317aff12889952e627efeb117395664", "urlToImage": null, "publishedAt": "2020-04-25T21:10:10Z", "content": "With money on our minds more than ever, its never been as important to find high quality goods at affordable prices and beauty products are no exception. That’s why when I spotted a new haircare launch in Coles that promised to give you a salon-worthy wash fo… [+8570 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": null, "title": "Music From the Home Front concert: Australian singers bring tears to viewers - Daily Telegraph", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.dailytelegraph.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T12:55:00Z", "content": null}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Lynn La", "title": "iPhone SE vs. iPhone 8 comparison: Which $400 iPhone should you get? - CNET", "description": "Some retailers are still selling the iPhone 8 despite Apple discontinuing the device. But you should just get the new iPhone SE instead.", "url": "https://www.cnet.com/news/iphone-se-vs-iphone-8-spec-comparison-which-400-iphone-should-you-get/", "urlToImage": null, "publishedAt": "2020-04-25T11:28:26Z", "content": "In a bid to lure budget-minded iPhone fans, Apple debuted its new iPhone SE for 2020 on April 15 for $399 (£419, AU$749). It's a sequel to its 2016 iPhone of the same name. The new iPhone SE's specs are similar to the iPhone 8 from three years ago, which is l… [+8211 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Brett Wadelton", "title": "Google removes 103 Android apps from the Play Store with 69 million installs - 7NEWS.com.au", "description": "What actually happens is that most of these apps continue to run in the background and serve the user’s phone with intrusive ads.", "url": "https://7news.com.au/technology/google-removes-103-android-apps-from-the-play-store-with-69-million-installs-c-997272", "urlToImage": null, "publishedAt": "2020-04-25T07:27:42Z", "content": "Google has removed a whopping 103 apps from Androids Play Store after they were found bypass security checks, contain adware and descriptions that were deemed to be misleading.\r\nMore alarmingly is the amount of installs that these apps had accumulated.\r\nThese… [+7517 chars]"}, {"source": {"id": null, "name": "Hurriyetdailynews.com"}, "author": "hurriyetdailynews.com", "title": "Hubble telescope celebrates 30th year in space - Hurriyet Daily News", "description": "Scientists on April 24 celebrated the Hubble Space Telescope's 30th anniversary with a new image of a satellite galaxy of the Milky Way.", "url": "http://www.hurriyetdailynews.com/hubble-telescope-celebrates-30th-year-in-space-154195", "urlToImage": null, "publishedAt": "2020-04-25T06:16:03Z", "content": "WASHINGTON\r\nScientists on April 24 celebrated the Hubble Space Telescope's 30th anniversary with a new image of a satellite galaxy of the Milky Way. \r\nIn a statement, U.S. space agency NASA said the galaxy in the image - located 163,000 light-years away- away… [+847 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "China sees more imported coronavirus cases - NEWS.com.au", "description": "China sees more imported coronavirus cases", "url": "https://www.news.com.au/world/breaking-news/china-sees-more-imported-coronavirus-cases/news-story/9de1a6d2d8e414ca86e3a5abb2852835", "urlToImage": null, "publishedAt": "2020-04-25T03:51:48Z", "content": "China's northwestern province of Shaanxi has reported seven new imported cases of the novel coronavirus, all in citizens returning home from Russia, even as domestic cases in the country have been largely curbed.The port city of Manzhouli in Inner Mongolia al… [+1566 chars]"}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": null, "title": "Anzac Day in Canberra in photos - The Canberra Times", "description": "Canberrans have remembered Anzac Day very differently to other years.  They stood at the end of their driveways, carrying candles to symbolically light the da...", "url": "https://www.canberratimes.com.au/story/6735069/anzac-day-in-canberra-in-photos/", "urlToImage": null, "publishedAt": "2020-04-25T00:00:00Z", "content": null}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Lisa Mayoh", "title": "Vegetable garden ideas: How to grow veggie or herb gardens in small spaces - NEWS.com.au", "description": "Vegetable garden ideas: Yes, you can grow veggie patches and herb gardens in small spaces, here’s how", "url": "https://www.news.com.au/lifestyle/home/outdoors/vegetable-garden-ideas-yes-you-can-grow-veggie-patches-and-herb-gardens-in-small-spaces-heres-how/news-story/633fd68b3498749a4e1e3f22797dacca", "urlToImage": null, "publishedAt": "2020-04-24T20:18:07Z", "content": "Anyone with a failed basil plant or limp coriander leaf will know herb gardens and veggie patches arent for the faint-hearted. But with ISO-cooking firmly on the agenda, growing our own produce is becoming a productive pastime of converted green thumbs everyw… [+5078 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": null, "name": "Heraldsun.com.au"}, "author": null, "title": "Virgin Australia aircraft blocked in Perth as collapse could domino air route shutdown across the country - Herald Sun", "description": "Subscribe to the Herald Sun to get unrestricted digital access, home paper delivery, Foxsports.com.au subscription,  Apps for iPad and Android and much more...", "url": "https://www.heraldsun.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-24T12:03:00Z", "content": null}]}