{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Nine.com.au"}, "author": "Rachael Gavin", "title": "Music From the Home Front concert opens with fitting tributes and iconic songs - Nine", "description": "Ben Lee and Jimmy Barnes perform", "url": "https://www.nine.com.au/entertainment/latest/music-from-the-home-front-ben-lee-jimmy-barnes/499adb3a-d09e-4752-8efe-8228e7350f8a", "urlToImage": null, "publishedAt": "2020-04-25T10:57:37Z", "content": "Music From The Home Front has paid tribute on Anzac Day to both those Aussies who have served and died in wars and conflicts, while also thanking workers on the frontline of the COVID-19 pandemic.\r\nThe show opened with three meaningful performances, each perf… [+1789 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Australians told not to get complacent as virus death toll rises to 81 - SBS News", "description": "An 83-year-old man is the latest COVID-19 death in NSW and the sixth resident at Newmarch House, taking the state's toll to 36.", "url": "https://www.sbs.com.au/news/australians-told-not-to-get-complacent-as-virus-death-toll-rises-to-81", "urlToImage": null, "publishedAt": "2020-04-25T10:20:20Z", "content": "An 83-year-old man has died from COVID-19 at an aged care facility in western Sydney, taking the state's virus toll to 36.\r\nThe man was a resident at Anglicare Newmarch House in Cadden and is the sixth death at the facility.\r\nThe facility is the state's large… [+3319 chars]"}, {"source": {"id": null, "name": "9news.com.au"}, "author": "9News Staff", "title": "'Die': $3m home of man arrested over deadly police crash vandalised - 9News", "description": "<p>The home of the Porsche driver held over the Melbourne police crash has been vandalized, as the family of one of the dead officers released an emotional tribute.</p>", "url": "https://www.9news.com.au/national/melbourne-police-crash-eastern-freeway-porsche-driver-richard-pusey-home-vandalised/818c433b-653b-4bf5-b18e-9fa4fc00813c", "urlToImage": null, "publishedAt": "2020-04-25T09:46:53Z", "content": "Property News: Tips and tricks for propagating edibles and seed saving - domain.com.au"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Calla Wahlquist", "title": "Health authorities defend handling of coronavirus cluster at Melbourne psychiatric facility - The Guardian", "description": "Fifteen people, including six patients, from the Albert Road Clinic have tested positive to Covid-19 since 24 March", "url": "https://www.theguardian.com/australia-news/2020/apr/25/health-authorities-defend-handling-of-coronavirus-cluster-at-melbourne-psychiatric-facility", "urlToImage": null, "publishedAt": "2020-04-25T09:33:43Z", "content": "Victorian health authorities have defended their response to a coronavirus outbreak in an inpatient psychiatric facility after staff and patients were not told of the cluster until one month after the first positive test.\r\nMeanwhile more than 180 Australians … [+4243 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Calla Wahlquist", "title": "Family of youngest officer killed in Melbourne freeway crash say 'bright light' is lost - The Guardian", "description": "Parents of constable Josh Prestney, 28, say they ‘cannot fathom the circumstances’ that led to their son’s death", "url": "https://www.theguardian.com/australia-news/2020/apr/25/family-of-youngest-officer-killed-in-melbourne-freeway-crash-say-bright-light-is-lost", "urlToImage": null, "publishedAt": "2020-04-25T09:08:00Z", "content": "The family of a police officer killed alongside three colleagues when they were struck by a truck on a Melbourne freeway on Wednesday say they have lost their bright light.\r\nConstable Josh Prestney, 28, was the youngest of the four officers killed in the inci… [+2683 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Chris De Silva", "title": "Todd Greenberg keeping options open amid Rugby Australia, Cricket Australia links - Wide World of Sports", "description": "'I've had a couple of calls this week actually'", "url": "https://wwos.nine.com.au/nrl/todd-greenberg-reveals-offers-after-nrl-resignation-keeping-options-open/df2c52d2-307b-4fda-b4f2-c95ca2f642c0", "urlToImage": null, "publishedAt": "2020-04-25T09:03:05Z", "content": "Former NRL CEO Todd Greenberg has admitted that he has already received a number of job offers, just days after stepping down from his role as league boss.\r\nGreenberg was heavily criticised for the NRL's dire financial situation which was laid bare amid the C… [+2866 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Farrah Tomazin", "title": "Ahead of the curve: five other countries winning the battle against coronavirus - The Age", "description": "Countries that succeed in tackling their infection rates  - such as Australia - have many different challenges but one common enemy - the coronavirus. We look at five places that acted early and tested widely in the fight against the pandemic.", "url": "https://www.smh.com.au/world/asia/ahead-of-the-curve-five-other-nations-winning-the-battle-against-coronavirus-20200424-p54my1.html", "urlToImage": null, "publishedAt": "2020-04-25T08:13:29Z", "content": "Despite their proximity to the source, Taiwans 24 million residents have managed to avoid the kind of lockdowns Australians have faced.\r\nBy Friday morning, the island known for staring down Beijing had only recorded six coronavirus deaths and 427 confirmed ca… [+8257 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/peta-fuller/11746470", "title": "Sentinel testing will be part of the strategy before Australia's coronavirus restrictions are potentially eased - ABC News", "description": "Australians are seeing more days with low (or even no) new coronavirus cases in their state. But alone, that's not enough to see restrictions ease. Can more testing help?", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-sentinel-testing-surveillance-testing-covid-19/12180274", "urlToImage": null, "publishedAt": "2020-04-25T07:58:12Z", "content": "Updated \r\nApril 25, 2020 17:10:08\r\nThere's a new testing buzzword in Australia and it might sound slightly ominous sentinel surveillance or sentinel testing.\r\nAs our COVID-19 case rates slow, it's part of the next step to staying on top of infection rates in … [+5412 chars]"}, {"source": {"id": null, "name": "Couriermail.com.au"}, "author": "Janelle Miles", "title": "Qld health authorities trying to track Virgin passengers after coronavirus diagnosis - Courier Mail", "description": "QUEENSLAND recorded just 16 new cases of pandemic coronavirus in the past week, including a passenger on a Virgin Australia flight into Brisbane from Melbourne.", "url": "https://www.couriermail.com.au/coronavirus/qld-health-authorities-trying-to-track-virgin-passengers-seated-near-someone-who-later-tested-positive-to-the-novel-coronavirus/news-story/99e019f7d2757638cb147813bcae2280", "urlToImage": null, "publishedAt": "2020-04-25T07:28:00Z", "content": "QUEENSLAND recorded just 16 new cases of pandemic coronavirus in the past week, including a passenger on a Virgin Australia flight into Brisbane from Melbourne.\r\nPublic Health authorities are still trying to track down passengers from flight VA341 last Monday… [+2831 chars]"}, {"source": {"id": null, "name": "Northerndailyleader.com.au"}, "author": "Claudia Thaler", "title": "Russian ship docks with space station - The Northern Daily Leader", "description": "A Russian cargo ship has docked with the International Space Station, delivering more than 2.5 tonnes of food, fuel, equipment for experiments and other suppl...", "url": "https://www.northerndailyleader.com.au/story/6735252/russian-ship-docks-with-space-station/?cs=5461", "urlToImage": null, "publishedAt": "2020-04-25T07:01:06Z", "content": ""}, {"source": {"id": null, "name": "Fool.com.au"}, "author": null, "title": "5 top ASX shares to buy in May - Motley Fool Australia", "description": "Afterpay Ltd (ASX:APT) and CSL Limited (ASX:CSL) are two of five ASX shares to consider buying for your portfolio in May...", "url": "https://www.fool.com.au/2020/04/25/5-top-asx-shares-to-buy-in-may/", "urlToImage": null, "publishedAt": "2020-04-25T06:41:34Z", "content": "While the S&amp;P/ASX 200 Index (ASX: XJO) falling from grace over the last couple of months has been disappointing, one positive is that it has brought some high quality shares down to more attractive levels.\r\nIn light of this, I think now could be an opport… [+4143 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "‘He’s never backed a winning cause:’ Kenty’s swipe at FitzSimons - Fox Sports", "description": "<b>Tune into our new show Fox League Live on Channel 502 Monday to Friday at 6.30pm and on Saturday at 3pm and Sunday at 5pm.</b>", "url": "https://www.foxsports.com.au/nrl/nrl-premiership/nrl-2020-paul-kent-peter-fitzsimons-nrl-restart-date-may-28-gladys-berejiklian/news-story/ecad45e5b8be5595c7dafa6e9721b7aa", "urlToImage": null, "publishedAt": "2020-04-25T06:24:00Z", "content": "The Daily Telegraphs Paul Kent has delivered a stunning take-down of Sydney Morning Herald columnist Peter FitzSimons, saying: hes never backed a winning cause.\r\nThe former Wallaby penned a column saying that NSW premier Gladys Berejiklian needed to put rugby… [+2938 chars]"}, {"source": {"id": null, "name": "Digitalinformationworld.com"}, "author": "Arooj Ahmed", "title": "A Researcher Created A Website Highlighting What A Smartphone sees While Using Bluetooth And Discovered One Of The Biggest Challenges COVID-19 Tracking Technology Will Face - Digital Information World", "description": "One of the hurdles in the creation of this technology is that Bluetooth also detects devices through walls or other bodies that may not transmit the virus.", "url": "https://www.digitalinformationworld.com/2020/04/website-delenates-what-a-smartphone-sees-while-using-bluetooth-and-challenges-covid-19-tracking-technology-will-face.html", "urlToImage": null, "publishedAt": "2020-04-25T06:06:04Z", "content": "<ul><li>Claudio Guarnieri, an artist and security researcher created a website visualizing what a smartphone sees while the Bluetooth is turned on.</li><li>Apple and Google are creating a contact tracing technology to trace COVID-19 spread using Bluetooth ins… [+2045 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/paige-cockburn/7065460", "title": "Coronavirus cases in NSW rise again, beachgoers slammed for not keeping social distance - ABC News", "description": "The number of new coronavirus cases in NSW is back in double digits as the state's Health Minister expresses his agitation over people ignoring social distancing rules on three Sydney beaches which have since been shut again.", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-nsw-cases-rise-by-12-people-crowd-randwick-beaches/12184422", "urlToImage": null, "publishedAt": "2020-04-25T05:12:54Z", "content": "Updated \r\nApril 25, 2020 16:26:51\r\nThe NSW Health Minister has expressed his disappointment in people who flouted social distancing rules on Sydney beaches after council relaxed the lockdown for their benefit.\r\nKey points:\r\n<ul><li>There were 12 new coronavir… [+4182 chars]"}, {"source": {"id": null, "name": "Executivetraveller.com"}, "author": "David Flynn", "title": "Virgin Australia Mk II could launch in as little as three months - Executive Traveller", "description": "Virgin's administrators want to see a new owner in place by the end of June.", "url": "https://www.executivetraveller.com/news/virgin-australia-could-be-flying-again-in-as-little-as-three-months", "urlToImage": null, "publishedAt": "2020-04-25T05:11:14Z", "content": "A reborn Virgin Australia could be flying in as little as three months, with administrators seeking to lock down offers from potential new owners by the middle of June.\r\n\"This is not intended to be a long protracted process,\" Deloitte partner and administrato… [+6253 chars]"}, {"source": {"id": null, "name": "Couriermail.com.au"}, "author": null, "title": "Teacher unions aren’t just hurting kids, it’s the teachers too - Courier Mail", "description": "Subscribe to The Courier-Mail to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.couriermail.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T05:00:00Z", "content": null}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Sarah McPhee", "title": "New test hot spot in 'desperate' state - Gympie Times", "description": "Coronavirus NSW: 'Desperate' state tests for COVID-19 in Blue Mountains", "url": "https://www.news.com.au/national/nsw-act/news/coronavirus-nsw-desperate-state-tests-for-covid19-in-blue-mountains/news-story/f6b83a5ea32f37a8bae2afb30bf32928", "urlToImage": null, "publishedAt": "2020-04-25T04:35:00Z", "content": "Health authorities in NSW are desperate to get much more testing done after recording 12 more cases of COVID-19.It is a significant chunk of the country’s new cases given Australia has recorded less than 50 cases each day over the past seven days.\r\nQueensland… [+2984 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Alex Turner-Cohen and Ally Foster", "title": "Coronavirus: Sydney’s Coogee Beach packed with people ahead of closure - NEWS.com.au", "description": "Coronavirus: Sydney’s Coogee beach packed with people ahead of closure", "url": "https://www.news.com.au/national/nsw-act/news/coronavirus-sydneys-coogee-beach-packed-with-people-ahead-of-closure/news-story/1e304e64ea0cb9eac84c6528f92e584c", "urlToImage": null, "publishedAt": "2020-04-25T03:06:35Z", "content": "Crowds packed Coogee Beach in Sydney this morning after it was reopened for a few hours to allow people to exercise following yesterday's closure.Randwick Council opened Coogee, Maroubra and Clovelly Beach for this weekend between 6am and 9am, with exercise t… [+1834 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Brazil President Jair Bolsonaro in crisis mode after losing another key minister - SBS News", "description": "Brazil's President Jair Bolsonaro has lost another key minister, and continues to play down the country's growing coronavirus outbreak.", "url": "https://www.sbs.com.au/news/brazil-president-jair-bolsonaro-in-crisis-mode-after-losing-another-key-minister", "urlToImage": null, "publishedAt": "2020-04-25T02:09:49Z", "content": "As Brazil veers closer to becoming a coronavirus pandemic hotspot, its government has been riven with internal dissent.\r\nJustice Minister Sergio Moro, a popular crusader against corruption, resigned on Friday alleging political interference in the federal pol… [+1999 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Donald Trump says he was being sarcastic when he suggested injecting disinfectant could treat coronavirus - ABC News", "description": "Donald Trump says his suggestion that disinfectant could be injected into people to treat coronavirus was a sarcastic question to reporters, as US medical services receive calls about his comments.", "url": "https://www.abc.net.au/news/2020-04-25/donald-trump-inject-disinfectant-coronavirus-sarcastic-covid-19/12184508", "urlToImage": null, "publishedAt": "2020-04-25T02:05:25Z", "content": "Updated \r\nApril 25, 2020 15:13:58\r\nUS President Donald Trump has said he was being sarcastic when he raised the possibility of using disinfectant inside people's bodies to fight coronavirus, in an attempt to walk back comments that alarmed medical professiona… [+3783 chars]"}, {"source": {"id": null, "name": "Watoday.com.au"}, "author": "Nathan Hondros", "title": "Qantas rips into Perth Airport amid blockade of Virgin Australia aircraft - Sydney Morning Herald", "description": "Qantas has delivered a stinging rebuke to Perth Airport over its standoff with Virgin Australia, defending it rivals over millions in outstanding invoices.", "url": "https://www.watoday.com.au/national/western-australia/qantas-rips-into-perth-airport-amid-blockade-of-virgin-australia-aircraft-20200425-p54n5n.html", "urlToImage": null, "publishedAt": "2020-04-25T01:05:36Z", "content": "\"It's no way to treat a customer of 20 years. This kind of action is deeply worrying for all users of Perth Airport.\r\n\"We have our own dispute with Perth Airport over excessive charges, which has been going through the courts for over a year.\r\n\"As part of tha… [+1882 chars]"}, {"source": {"id": null, "name": "Newidea.com.au"}, "author": "New Idea", "title": "Stunning claim made about Meghan Markle and her father in court - New Idea", "description": "A shock new claim has been made about the Duchess of Sussex and her estranged father Thomas Markle.", "url": "https://www.newidea.com.au/stunning-claim-made-about-meghan-markle-and-her-father-in-court", "urlToImage": null, "publishedAt": "2020-04-25T00:33:00Z", "content": "It has been claimed that Meghan Markle has not seen her father Thomas in two years.\r\nLawyers for the the royal husband and wife claim the letters publication was a misuse of private information and breached her copyright.\r\nThe publication of the letter is cla… [+1059 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "", "title": "Anzac Day 2020: Australia and New Zealand come together in isolation – in pictures - The Guardian", "description": "From driveway ceremonies to backyard buglers, Australians and New Zealanders marked Anzac Day in lockdown", "url": "https://www.theguardian.com/news/gallery/2020/apr/25/anzac-day-2020-australia-and-new-zealand-come-together-in-isolation", "urlToImage": null, "publishedAt": "2020-04-24T23:47:00Z", "content": "From driveway ceremonies to backyard buglers, Australians and New Zealanders marked Anzac Day in lockdown. Some gathered, far apart, on beaches. Others lined residential streets, standing in front of their homes with wreaths and poppies and candles to honour … [+167 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "By LOLITA C. BALDOR and ROBERT BURNS", "title": "US Navy recommends return of fired captain - NEWS.com.au", "description": "US Navy recommends return of fired captain", "url": "https://www.news.com.au/world/breaking-news/us-navy-recommends-return-of-fired-captain/news-story/50fd60f2f3f5d801f606cdf6f228f466", "urlToImage": null, "publishedAt": "2020-04-24T22:32:54Z", "content": "The top Navy officer has recommended the reinstatement of the aircraft carrier captain fired for sending a fraught email to commanders pleading for faster action to protect his crew from a coronavirus outbreak, officials familiar with the investigation say.Ad… [+3979 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/abc-local/sophie-kesteven/7149610", "title": "Raquel is working from home during coronavirus — and that means sloths in the spare room - ABC News", "description": "Working from home means different things for different people. For Raquel, it means moving three very lazy — but very cute — new housemates into the spare room.", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-panama-working-from-home-with-sloths/12169922", "urlToImage": null, "publishedAt": "2020-04-24T22:29:37Z", "content": "Updated \r\nApril 25, 2020 08:23:26\r\nWorking from home is the new normal for many people and for Raquel Cruz Alpizar, it's meant moving three unlikely new housemates into her spare room.\r\nSince coronavirus restrictions took hold, she's been caring around the cl… [+6272 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": null, "title": "Captain Tom Moore becomes oldest person to top Britain's music chart - The Age", "description": "A World War II veteran who raised millions for charity has now become the oldest person to top Britain's main music chart.", "url": "https://www.smh.com.au/world/europe/captain-tom-moore-becomes-oldest-person-to-top-britain-s-music-chart-20200425-p54n4v.html", "urlToImage": null, "publishedAt": "2020-04-24T20:40:50Z", "content": "He also went to No.1 on the music charts - with a little help from a friend.\r\nThe cover version of You'll Never Walk Alone that Moore appears on with singer Michael Ball was on course to be pipped by The Weeknd's Blinding Lights, until the Canadian star asked… [+1312 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Bret Harris", "title": "Raelene Castle becomes latest casualty of Australia's flawed rugby system - The Guardian", "description": "Did the tenure of the first woman to fill the role of Rugby Australia chief executive really end in failure?", "url": "https://www.theguardian.com/sport/2020/apr/25/raelene-castle-becomes-latest-casualty-of-australias-flawed-rugby-system", "urlToImage": null, "publishedAt": "2020-04-24T20:00:00Z", "content": "Under siege for several months, Raelene Castle tendered her resignation to Rugby Australia just three days after the publication of a letter co-authored by 11 unhappy former Wallabies captains calling for leadership change. The letter was the last straw for C… [+4817 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Microsoft Begins Showing Edge Ads in Outlook.com - Somag News", "description": "US technology giant Microsoft has begun to run ads with download links on the email service Outlook.com for its new Chromium-based Microsoft Edge browser, which it launched earlier this year. Edge recently managed to be the second most popular internet browse…", "url": "https://www.somagnews.com/microsoft-begins-showing-edge-ads-outlook-com/", "urlToImage": null, "publishedAt": "2020-04-24T19:22:00Z", "content": "US technology giant Microsoft has begun to run ads with download links on the email service Outlook.com for its new Chromium-based Microsoft Edge browser, which it launched earlier this year. Edge recently managed to be the second most popular internet browse… [+1516 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": null, "name": "Standard.net.au"}, "author": "Andi Yu", "title": "New Vic laws and virus outbreak probe - Warrnambool Standard", "description": "Emergency laws to combat the effects of coronavirus on the Victorian economy and the investigation of an outbreak at a Melbourne psychiatric facility are the...", "url": "https://www.standard.net.au/story/6734968/new-vic-laws-and-virus-outbreak-probe/?cs=10264", "urlToImage": null, "publishedAt": "2020-04-24T17:31:40Z", "content": ""}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Stephanie Nebehay", "title": "World leaders launch WHO COVID-19 plan - NEWS.com.au", "description": "World leaders launch WHO COVID-19 plan", "url": "https://www.news.com.au/world/breaking-news/world-leaders-launch-who-covid19-plan/news-story/be3ab18ffd13ac3cf033725b37b24bbd", "urlToImage": null, "publishedAt": "2020-04-24T13:27:27Z", "content": "French President Emmanuel Macron and German Chancellor Angela Merkel will help launch a global initiative to accelerate work to fight COVID-19, the World Health Organisation says, but the United States says it will not take part.The WHO said it would to annou… [+1727 chars]"}, {"source": {"id": null, "name": "Theconversation.com"}, "author": "Rodger I. Thompson", "title": "How the Hubble Space Telescope opened our eyes to the first galaxies of the universe - The Conversation US", "description": "Thirty years ago the Hubble Space Telescope began snapping photos of distant stars, providing a time machine that has taken astronomers back to when the universe was less than a billion years old.", "url": "https://theconversation.com/how-the-hubble-space-telescope-opened-our-eyes-to-the-first-galaxies-of-the-universe-133877", "urlToImage": null, "publishedAt": "2020-04-24T12:22:00Z", "content": "The Hubble Space Telescope launched on the 24th of April, 30 years ago. Its an impressive milestone especially as its expected lifespan was just 10 years.\r\nOne of the primary reasons for the Hubble telescopes longevity is that it can be serviced and improved … [+6948 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Raelene Castle was simply the scapegoat, says Andrew Forrest - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-24T12:15:00Z", "content": null}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "All the key points from the Prime Minister's latest coronavirus press conference - ABC News", "description": "Missed the Prime Minister's latest coronavirus update? Here's all the key points.", "url": "https://www.abc.net.au/news/2020-04-24/national-cabinet-key-points-scott-morrison-coronavirus-update/12182148", "urlToImage": null, "publishedAt": "2020-04-24T09:17:51Z", "content": "Updated \r\nApril 25, 2020 00:00:13\r\nIn many parts of the country, coronavirus numbers have been looking pretty good lately.\r\nNaturally, we're starting to think about when we can get back to normal.\r\nBut, while the latest update from the Prime Minister and Chie… [+12531 chars]"}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "Bang Showbiz", "title": "Tom Hanks gifts Corona-branded typewriter to bullied Australian boy named Corona - PerthNow", "description": "The actor sent a heartwarming letter and gift to a young Australian boy named Corona after he revealed he had been bullied over his moniker.", "url": "https://www.perthnow.com.au/entertainment/celebrity-gossip/tom-hanks-gifts-corona-branded-typewriter-to-bullied-australian-boy-named-corona-ng-b881529498z", "urlToImage": null, "publishedAt": "2020-04-24T07:38:48Z", "content": "Tom Hanks has sent a typewriter to a young Australian boy named Corona after he revealed he had been bullied over his moniker.\r\nThe Castaway actor wrote a kind note to eight-year-old Corona De Vries after the young Australian sent him a letter when he and wif… [+1519 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Apple says ‘no evidence’ a flaw in iPhone email app is security risk for customers - 7NEWS.com.au", "description": "A flaw in an iPhone email app has been exposed but Apple says there is no security risk to its more than half a billion users.", "url": "https://7news.com.au/technology/apple-says-no-evidence-a-flaw-in-iphone-email-app-is-security-risk-for-customers-c-997338", "urlToImage": null, "publishedAt": "2020-04-24T07:01:00Z", "content": "Apple Inc says it has found no evidence a flaw in its email app for iPhones and iPads has been used against customers.\r\nAnd it believes the flaw does not pose an immediate risk to our users.\r\nWatch the video above\r\nSan Francisco-based security firm ZecOps on … [+1400 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Isolation item earns Aussie $150k in 7 mins - Tweed Daily News", "description": "While coronavirus has had a catastrophic effect, the sudden change to everyday life has meant Aussies are spending their cash in unexpected places.", "url": "https://www.news.com.au/lifestyle/fitness/aussie-makes-150k-in-seven-minutes-off-new-isolation-musthave/news-story/764ecc100b4c25fb218aff38a227eeeb", "urlToImage": null, "publishedAt": "2020-04-24T01:43:00Z", "content": "While coronavirus has had a catastrophic effect on many businesses, the sudden change to everyday life has meant Aussies are spending their cash in unexpected places.\r\nJust ask Matilda Murray, who co-owns fitness apparel brand Stax with Don Robertson.\r\nShe sa… [+3919 chars]"}, {"source": {"id": null, "name": "Onestepoffthegrid.com.au"}, "author": "Sophie Vorrath", "title": "NSW paves way for more – and bigger – rooftop solar systems - One Step Off The Grid", "description": "NSW government unveils further relaxations to renewable energy development policy, paving way for installation of larger residential and commercial rooftop solar systems.", "url": "https://onestepoffthegrid.com.au/nsw-paves-way-for-more-and-bigger-rooftop-solar-systems/", "urlToImage": null, "publishedAt": "2020-04-24T01:21:37Z", "content": "The New South Wales government has unveiled further relaxations to laws governing renewable energy development, paving the way for the installation of larger residential and commercial rooftop solar systems across the state.\r\nThe new amendments to the State E… [+2992 chars]"}]}