{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Thomas Duff For Daily Mail Australia", "title": "Tragedy as a man dies from coronavirus in Tasmania - taking Australia's death toll to 80 - Daily Mail", "description": "A 90-year-old man from Tasmania's north-west coast has died from the coronavirus on Friday, bringing the state's total to 10 and Australia's death toll to 80.", "url": "https://www.dailymail.co.uk/news/article-8255737/Tragedy-man-dies-coronavirus-Tasmania-taking-Australias-death-toll-80.html", "urlToImage": null, "publishedAt": "2020-04-25T02:38:22Z", "content": "A man from Tasmania's north-west coast has died from the coronavirus, bringing the state's total to 10 and Australia's death toll to 80. \r\nThe 90-year-old man died on Friday at the Mersey Community Hospital in Latrobe. \r\nOut of the 10 deaths from coronavirus … [+2250 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Latika Bourke, Sally Rawsthorne", "title": "Coronavirus updates LIVE: Scott Morrison says social distancing won't apply to schools, global COVID-19 cases surpass 2.7 million, Australian death toll stands at 80 - The Sydney Morning Herald", "description": "If you suspect you or a family member has coronavirus you should call (not visit) your GP or ring the national Coronavirus Health Information Hotline on 1800 020 080.", "url": "https://www.smh.com.au/national/coronavirus-updates-live-scott-morrison-says-social-distancing-won-t-apply-to-schools-global-covid-19-cases-surpass-2-7-million-australian-death-toll-stands-at-80-20200424-p54n21.html", "urlToImage": null, "publishedAt": "2020-04-25T02:19:00Z", "content": "Six residents have now died of coronavirus at the aged care home. \r\n\"To the family of that lady, I want to express all of the community's condolences,\" Mr Hazzard said.\r\nThere is now a total of 48 cases at Newmarch House, comprised of 17 staff and 31 resident… [+947 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Donald Trump says he was being sarcastic when he suggested injecting disinfectant could treat coronavirus - ABC News", "description": "Donald Trump says his suggestion that disinfectant could be injected into people to treat coronavirus was a sarcastic question to reporters, as US medical services receive calls about his comments.", "url": "https://www.abc.net.au/news/2020-04-25/donald-trump-inject-disinfectant-coronavirus-sarcastic-covid-19/12184508", "urlToImage": null, "publishedAt": "2020-04-25T02:05:25Z", "content": "Updated \r\nApril 25, 2020 11:46:58\r\nUS President Donald Trump has said he was being sarcastic when he raised the possibility of using disinfectant inside people's bodies to fight coronavirus, in an attempt to walk back comments that alarmed medical professiona… [+3553 chars]"}, {"source": {"id": null, "name": "9news.com.au"}, "author": "Olivana Smith-Lathouris", "title": "Drug paraphernalia found in truck involved in deadly accident - 9News", "description": "<p>Drug paraphernalia was allegedly found in the cabin of the truck involved  in the horrific crash that killed four police officers on Wednesday night.</p>", "url": "https://www.9news.com.au/national/victoria-police-crash-drug-paraphernalia-found-in-truck-involved-in-deadly-accident-killing-four-officers/678d0107-73b2-41c9-b302-9b345abd42b8", "urlToImage": null, "publishedAt": "2020-04-25T01:57:16Z", "content": null}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Christine McGinn", "title": "Victorians mark Anzac Day at home - NEWS.com.au", "description": "Victorians mark Anzac Day at home", "url": "https://www.news.com.au/national/breaking-news/victorians-to-honour-anzac-day-at-home/news-story/c3aaab9528a1a92c3d2f53e548d9d502", "urlToImage": null, "publishedAt": "2020-04-25T01:18:45Z", "content": "There was no usual dawn service, march or even two-up this Anzac Day, but Victorians made sure it wasn't forgotten.Instead of pouring into the city, Victorians stayed home and stood in their driveways to pay respect with the Returned and Services League's Lig… [+1988 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "‘Disgusted, insulted’: ‘Obnoxious’ $210m backflip triggers wild NFL trade reality - Fox Sports", "description": "Aaron Rodgers can’t be happy.", "url": "https://www.foxsports.com.au/nfl/nfl-draft-2020-aaron-rodgers-jordan-love-green-bay-packers-analysis-reaction/news-story/3373f1c4fa71447884681a43cfc4a165", "urlToImage": null, "publishedAt": "2020-04-25T01:15:00Z", "content": "The superstar quarterback, who has four years remaining on his contract in Green Bay, watched on during the first round of the 2020 NFL Draft as the organisation gleefully snapped up his potential successor.\r\nA team that couldnt stop the run in the NFC Champi… [+4452 chars]"}, {"source": {"id": null, "name": "Watoday.com.au"}, "author": "Nathan Hondros", "title": "Qantas rips into Perth Airport amid blockade of Virgin Australia aircraft - Sydney Morning Herald", "description": "Qantas has delivered a stinging rebuke to Perth Airport over its standoff with Virgin Australia, defending it rivals over millions in outstanding invoices.", "url": "https://www.watoday.com.au/national/western-australia/qantas-rips-into-perth-airport-amid-blockade-of-virgin-australia-aircraft-20200425-p54n5n.html", "urlToImage": null, "publishedAt": "2020-04-25T01:05:36Z", "content": "\"It's no way to treat a customer of 20 years. This kind of action is deeply worrying for all users of Perth Airport.\r\n\"We have our own dispute with Perth Airport over excessive charges, which has been going through the courts for over a year.\r\n\"As part of tha… [+1882 chars]"}, {"source": {"id": null, "name": "Newidea.com.au"}, "author": "New Idea", "title": "Stunning claim made about Meghan Markle and her father in court - New Idea", "description": "A shock new claim has been made about the Duchess of Sussex and her estranged father Thomas Markle.", "url": "https://www.newidea.com.au/stunning-claim-made-about-meghan-markle-and-her-father-in-court", "urlToImage": null, "publishedAt": "2020-04-25T00:33:00Z", "content": "It has been claimed that Meghan Markle has not seen her father Thomas in two years.\r\nLawyers for the the royal husband and wife claim the letters publication was a misuse of private information and breached her copyright.\r\nThe publication of the letter is cla… [+1059 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Naaman Zhou, Josh Taylor", "title": "Australia coronavirus update latest: Anzac Day dawn services marked in isolation – live news - The Guardian", "description": "Australians mark Gallipolli landing in driveway services under physical distancing rules as nationwide Covid-19 testing kicks off", "url": "https://www.theguardian.com/news/live/2020/apr/25/australia-coronavirus-latest-updates-nsw-victoria-queensland-covid-19-testing-latest-news", "urlToImage": null, "publishedAt": "2020-04-25T00:32:00Z", "content": "Australians mark Gallipolli landing in driveway services under physical distancing rules as nationwide Covid-19 testing kicks off"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "DIANE JEANTET, DAVID BILLER and MAURICIO SAVARESE", "title": "Brazil's Bolsonaro in crisis mode - NEWS.com.au", "description": "Brazil's Bolsonaro in crisis mode", "url": "https://www.news.com.au/world/breaking-news/brazils-bolsonaro-in-crisis-mode/news-story/4c39f91a85ba6c44236fe44a2be73dc7", "urlToImage": null, "publishedAt": "2020-04-25T00:26:22Z", "content": "As Brazil veers closer to becoming a coronavirus pandemic hotspot, its government has been riven with internal dissent.Justice Minister Sergio Moro, a popular crusader against corruption, resigned on Friday alleging political interference in the federal polic… [+1400 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Baked beans an unlikely nutrition star, and pandemic hit - Health - ABC News", "description": "While baked beans might not look particularly sexy, they're a favourite among nutrition experts. Here's why.", "url": "https://www.abc.net.au/news/health/2020-04-25/baked-beans-an-unlikely-nutrition-star/12176974", "urlToImage": null, "publishedAt": "2020-04-25T00:17:11Z", "content": "As we all fight our inner \"prepper\" and try not to succumb to panic buying, it seems many of us have turned to an old favourite: baked beans.\r\nBean production at Australia's largest fruit and vegetable cannery in Shepparton, Victoria, has doubled its usual vo… [+5001 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/hannah--reich/9151774", "title": "TikTok offers connection, comedy and creativity during coronavirus lockdown - ABC News", "description": "The social video sharing app once seemed just for teenagers but since social isolation started, more and more people are joining TikTok for connection, comedy and creativity.", "url": "https://www.abc.net.au/news/2020-04-25/turning-to-tiktok-during-coronavirus-lockdown/12176814", "urlToImage": null, "publishedAt": "2020-04-24T23:57:27Z", "content": "Posted \r\nApril 25, 2020 09:19:12\r\n\"If it wasn't for coronavirus, I wouldn't have downloaded it and the fact that I have makes me feel a little bit embarrassed,\" says Hannah Baker, a new TikTok devotee.\r\nThe 27-year-old judge's associate says one thing that go… [+7054 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "", "title": "Anzac Day 2020: Australia and New Zealand come together in isolation – in pictures - The Guardian", "description": "From driveway ceremonies to backyard buglers, Australians and New Zealanders marked Anzac Day in lockdown", "url": "https://www.theguardian.com/news/gallery/2020/apr/25/anzac-day-2020-australia-and-new-zealand-come-together-in-isolation", "urlToImage": null, "publishedAt": "2020-04-24T23:47:00Z", "content": "From driveway ceremonies to backyard buglers, Australians and New Zealanders marked Anzac Day in lockdown. Some gathered, far apart, on beaches. Others lined residential streets, standing in front of their homes with wreaths and poppies and candles to honour … [+167 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/baz--ruddick/10119472", "title": "Veteran strives to name 72 unmarked graves of servicemen who died 'shell-shocked' in mental asylum - ABC News", "description": "A veteran discovers 72 unmarked war graves at a cemetery west of Brisbane, working tirelessly to identify the lost servicemen and get plaques placed on their final resting place.", "url": "https://www.abc.net.au/news/2020-04-25/queensland-anzac-war-graves-qld-matthew-rennie/12183570", "urlToImage": null, "publishedAt": "2020-04-24T23:32:19Z", "content": "Updated \r\nApril 25, 2020 10:17:53\r\nIn an Australian Imperial Force (AIF) plot at the Ipswich General Cemetery, west of Brisbane, lay 72 servicemen who died forgotten in unmarked graves and without commemoration. \r\nThe men, who returned after serving in World … [+5970 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Victoria Craw and Ally Foster", "title": "Coronavirus Australia live updates: Crowds pack Coogee Beach ahead of 9am closure - NEWS.com.au", "description": "Crowds packed Coogee Beach this morning after it reopened for a few hours to allow people to exercise following yesterday's closure.", "url": "https://www.news.com.au/world/coronavirus/australia/coronavirus-australia-live-updates/live-coverage/23762c2d7cce7e40c305f08efb399de3", "urlToImage": null, "publishedAt": "2020-04-24T23:21:09Z", "content": "For the first time, President Donald Trump cut off his daily coronavirus task force briefing on Friday without taking any questions from reporters. It may not be the last time.\r\nThere have been discussions within the White House about changing the format of t… [+1763 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Michelle Starr", "title": "Scientists Capture Incredibly Rare Video of Humpback Whales Nursing Their Calves - ScienceAlert", "description": "Whales, as we all know, are different from most other sea creatures. They are mammals, and give birth to live babies… and then they nurture and raise those babies, nursing them on rich, fatty milk so they can grow big and strong.", "url": "https://www.sciencealert.com/scientists-have-captured-rare-video-of-humpback-mothers-nursing-their-calves", "urlToImage": null, "publishedAt": "2020-04-24T23:05:25Z", "content": "Whales, as we all know, are different from most other sea creatures. They are mammals, and give birth to live babies and then they nurture and raise those babies, nursing them on rich, fatty milk so they can grow big and strong.\r\nBut we can't just put whales … [+2841 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Coronavirus update: World unites for WHO vaccine plan, US death toll passes 50,000 and more people recover in Spain than are diagnosed - ABC News", "description": "Leaders from around the world sign up to a WHO collaboration to speed up the development of tests and treatments, however the US chooses not to be involved. Meanwhile, Spain rejoices as more people recover from coronavirus than are diagnosed with it.", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-update-australia-covid19-who-global-initiative/12183558", "urlToImage": null, "publishedAt": "2020-04-24T22:30:31Z", "content": "Updated \r\nApril 25, 2020 08:07:58\r\nLeaders from around the globe have joined the World Health Organisation for a virtual meeting in which they pledged their support for a collaboration to speed up the development of treatments for COVID-19, though the US was … [+11703 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/tracey-shelton/9323988", "title": "Captain Tom Moore becomes oldest artist to top the UK charts with You'll Never Walk Alone cover - ABC News", "description": "Captain Tom Moore, the British Army veteran who raised more than $55 million for Britain's National Health Service, tops the UK music charts with a cover of You'll Never Walk Alone.", "url": "https://www.abc.net.au/news/2020-04-25/captain-tom-moore-number-1-youll-never-walk-alone-coronavirus/12180754", "urlToImage": null, "publishedAt": "2020-04-24T22:30:20Z", "content": "Updated \r\nApril 25, 2020 08:26:39\r\nCaptain Tom Moore, the British Army veteran who raised more than $55 million for Britain's National Health Service (NHS), has become the oldest artist to claim a UK number one single, topping the music charts on the week of … [+3700 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/abc-local/sophie-kesteven/7149610", "title": "Raquel is working from home during coronavirus — and that means sloths in the spare room - ABC News", "description": "Working from home means different things for different people. For Raquel, it means moving three very lazy — but very cute — new housemates into the spare room.", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-panama-working-from-home-with-sloths/12169922", "urlToImage": null, "publishedAt": "2020-04-24T22:29:37Z", "content": "Updated \r\nApril 25, 2020 08:23:26\r\nWorking from home is the new normal for many people and for Raquel Cruz Alpizar, it's meant moving three unlikely new housemates into her spare room.\r\nSince coronavirus restrictions took hold, she's been caring around the cl… [+6272 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Ex-Glory player Torres sentenced to jail for match-fixing - SBS - The World Game", "description": "Former Perth Glory midfielder Xavi Torres has been handed a prison sentence along with an ex-Real Betis teammate and five former directors of Osasuna after being found guilty on corruption charges in Spain.", "url": "https://theworldgame.sbs.com.au/ex-glory-player-torres-sentenced-to-jail-for-match-fixing", "urlToImage": null, "publishedAt": "2020-04-24T21:51:35Z", "content": "The two former La Liga footballers have been given one-year prison sentences in a landmark case marking the first successful prosecution for match-fixing in Spain.\r\nThe former Real Betis players Xabi Torres and Antonio Amaya were on Friday convicted of fixing… [+1480 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Alexis Carey", "title": "Woolworths: Renovatio’s ‘surreal’ $5 million vitamins deal with supermarket - NEWS.com.au", "description": "Woolworths: Renovatio’s ‘surreal’ $5 million vitamins deal with supermarket", "url": "https://www.news.com.au/finance/business/retail/woolworths-renovatios-surreal-5-million-vitamins-deal-with-supermarket/news-story/a39f8f664142827789fea67c1b00186f", "urlToImage": null, "publishedAt": "2020-04-24T20:50:16Z", "content": "Dr Vincent Candrawinatas grandmother went from being a passionate ballroom dancer to virtually housebound as rheumatoid arthritis took its devastating toll.The young scientist was in the middle of groundbreaking research at the University of Newcastle when hi… [+3651 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Olivia Willis", "title": "When coronavirus patients suddenly decline, their own immune system might be to blame - ABC News", "description": "In some cases of COVID-19, it may be the body's response to the virus, rather than the virus itself, that ultimately causes harm.", "url": "https://www.abc.net.au/news/health/2020-04-25/coronavirus-covid-immune-response-causes-harm/12176872", "urlToImage": null, "publishedAt": "2020-04-24T20:30:29Z", "content": "It's been described as the \"second week crash\".\r\nAbout seven days after developing symptoms of COVID-19, some people even those with mild symptoms can suddenly start to deteriorate, often with little warning.\r\n\"They end up getting admitted to hospital, and ab… [+6217 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "‘What the f*** am I doing?’ The Christmas Day epiphany that changed Rob Whittaker’s life - Fox Sports", "description": "Robert Whittaker had not once quit on running up this sand dune in Sydney’s Sutherland Shire.", "url": "https://www.foxsports.com.au/ufc/what-the-f-am-i-doing-the-christmas-day-epiphany-that-changed-rob-whittakers-life/news-story/cad4632c55311f95e02d455205242887", "urlToImage": null, "publishedAt": "2020-04-24T20:00:20Z", "content": "That was until Christmas Day last year, when he just stopped.\r\nThen (I) stood there, asking what the f**k am I doing? he told The Saturday Telegraph.\r\nIt was Christmas Day.\r\nMy family was somewhere else.\r\nThat moment, its when everything crashed.\r\nWatch Foxte… [+1979 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "George Dvorsky", "title": "NASA Rocket Scientists Designed A Rapid-Production Ventilator In Just 37 Days - Gizmodo Australia", "description": "Introducing VITAL, a prototype ventilator designed expressly for quick and easy mass production. Developed by NASA engineers, the device could alleviate ongoing supply shortages in the U.S. and around the world as the covid-19 pandemic rages on....", "url": "https://www.gizmodo.com.au/2020/04/nasa-rocket-scientists-designed-a-rapid-production-ventilator-in-just-37-days/", "urlToImage": null, "publishedAt": "2020-04-24T19:30:00Z", "content": "Introducing VITAL, a prototype ventilator designed expressly for quick and easy mass production. Developed by NASA engineers, the device could alleviate ongoing supply shortages in the U.S. and around the world as the covid-19 pandemic rages on.\r\nNASA has cop… [+3078 chars]"}, {"source": {"id": null, "name": "Newcastleherald.com.au"}, "author": null, "title": "New Vic laws and virus outbreak probe - Newcastle Herald", "description": "Crooks are copping a double whammy from police, being fined for breaching social distancing rules when they're caught committing crimes. Police handed out ano...", "url": "https://www.newcastleherald.com.au/story/6734968/vic-crooks-being-hit-with-virus-fines/?cs=9397", "urlToImage": null, "publishedAt": "2020-04-24T17:31:40Z", "content": ""}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Alisha Rouse For Daily Mail Australia", "title": "Australia is steamrolling the curve: Nation records just 17 cases in one day - Daily Mail", "description": "Just 17 new cases of COVID-19, the killer respiratory virus which was crippled dozens of other countries, were recorded in Australia in the 24 hours from midnight on Thursday.", "url": "https://www.dailymail.co.uk/news/article-8253621/Australia-steamrolling-curve-Nation-records-just-17-cases-one-day.html", "urlToImage": null, "publishedAt": "2020-04-24T15:17:13Z", "content": "Australia is continuing its remarkable fight against the coronavirus, with three states recording no new infections on Friday.\r\nJust 17 new cases of COVID-19, the killer respiratory virus which was crippled dozens of other countries, were recorded in Australi… [+11020 chars]"}, {"source": {"id": null, "name": "Zdnet.com"}, "author": "Daphne Leprince-Ringuet", "title": "Coronavirus contact-tracing app: Here’s how we’ll protect your privacy, says NHS - ZDNet", "description": "NHS insists the public's data is safe in the hands of the health services. Privacy campaigners want more detail.", "url": "https://www.zdnet.com/article/coronavirus-contact-tracing-app-heres-how-well-protect-your-privacy-says-nhs/", "urlToImage": null, "publishedAt": "2020-04-24T14:18:00Z", "content": "To earn the trust of the public, privacy will be fundamental to the building the coronavirus contact-tracing app that the UK government is working on, NHSX boss Matthew Gould has said in a new post detailing the organization's commitment to confidentiality - … [+6376 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Aussies should brace for rolling lockdowns in years ahead - Big Rigs", "description": "Australia is preparing to cautiously lift the first virus restrictions next week – but a return to “normal” could still be years away.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-aussies-should-brace-for-rolling-lockdowns-in-years-ahead/news-story/8847b0e8f896994785239983a0e91880", "urlToImage": null, "publishedAt": "2020-04-24T11:15:08Z", "content": "ANALYSIS\r\nBrace yourselves: We're going to need more lockdowns to get on top of COVID-19.\r\nEconomists used to dream of exponential growth in relation to the economy. But that same explosive effect seems set to doom us to rolling lockdowns for years to come.\r\n… [+5660 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Australian Associated Press", "title": "Broadcasters agree to May 28 NRL restart, says Peter V'landys - The Guardian", "description": "ARL Commission chairman Peter V’landys has reiterated the NRL competition intends to resume on 28 May and the length of the season will be determined next week", "url": "https://www.theguardian.com/sport/2020/apr/24/nrl-2020-season-return-plans", "urlToImage": null, "publishedAt": "2020-04-24T10:29:57Z", "content": "The structure of a revised NRL competition is imminent after television broadcasters agreed to recognise 28 May as the optimal season restart date. After a high-powered meeting on Friday, Channel Nine and Foxtel could not reach an agreement on the length of t… [+2613 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Tom Bedford", "title": "The new iPhone SE is on sale today: here's how you can get one - TechRadar", "description": "No premium prices here", "url": "https://www.techradar.com/news/the-new-iphone-se-is-out-today-and-heres-how-you-can-get-one", "urlToImage": null, "publishedAt": "2020-04-24T10:09:00Z", "content": "Apple's new iPhone SE is available to buy now around the world. If you've been waiting to pick up a new iPhone that doesn't cost as much as a member of the iPhone 11 range, now is the time to do it.\r\nThe new iPhone SE has a 4.7-inch screen, the modern A13 Bio… [+987 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Shane Wright, Nick Bonyhady", "title": "Treasurer closes loopholes, fixes problems with JobKeeper - Sydney Morning Herald", "description": "Treasurer Josh Frydenberg has closed a series of loopholes and fixed some problems with the JobKeeper laws.", "url": "https://www.smh.com.au/politics/federal/treasurer-closes-loopholes-fixes-problems-with-jobkeeper-20200424-p54mzb.html", "urlToImage": null, "publishedAt": "2020-04-24T09:11:57Z", "content": "A series of problems with the Morrison government's $130 billion JobKeeper program have been resolved amid growing concerns about its feasibility for many small businesses.\r\nTreasurer Josh Frydenberg announced a string of changes to the pandemic response prog… [+617 chars]"}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "Bang Showbiz", "title": "Tom Hanks gifts Corona-branded typewriter to bullied Australian boy named Corona - PerthNow", "description": "The actor sent a heartwarming letter and gift to a young Australian boy named Corona after he revealed he had been bullied over his moniker.", "url": "https://www.perthnow.com.au/entertainment/celebrity-gossip/tom-hanks-gifts-corona-branded-typewriter-to-bullied-australian-boy-named-corona-ng-b881529498z", "urlToImage": null, "publishedAt": "2020-04-24T07:38:48Z", "content": "Tom Hanks has sent a typewriter to a young Australian boy named Corona after he revealed he had been bullied over his moniker.\r\nThe Castaway actor wrote a kind note to eight-year-old Corona De Vries after the young Australian sent him a letter when he and wif… [+1519 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Apple says ‘no evidence’ a flaw in iPhone email app is security risk for customers - 7NEWS.com.au", "description": "A flaw in an iPhone email app has been exposed but Apple says there is no security risk to its more than half a billion users.", "url": "https://7news.com.au/technology/apple-says-no-evidence-a-flaw-in-iphone-email-app-is-security-risk-for-customers-c-997338", "urlToImage": null, "publishedAt": "2020-04-24T07:01:00Z", "content": "Apple Inc says it has found no evidence a flaw in its email app for iPhones and iPads has been used against customers.\r\nAnd it believes the flaw does not pose an immediate risk to our users.\r\nWatch the video above\r\nSan Francisco-based security firm ZecOps on … [+1400 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "WA teachers' union panned over virus ad - NEWS.com.au", "description": "WA teachers' union panned over virus ad", "url": "https://www.news.com.au/national/breaking-news/wa-teachers-union-wants-kids-to-stay-home/news-story/4bd5691d834ec162941ad6ee98d45d8a", "urlToImage": null, "publishedAt": "2020-04-24T06:00:00Z", "content": "West Australian teachers have called on parents to keep children home from school but state and federal leaders say the union has its facts wrong.In a full-page newspaper advertisement published on Friday, the State School Teachers' Union of WA says schools s… [+1966 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "CNN", "title": "Giant asteroid flying by Earth next week looks like it’s wearing a face mask - 7NEWS.com.au", "description": "An observatory has spotted a strange discovery on an asteroid moving at 31,000 kilometres per hour.", "url": "https://7news.com.au/technology/space/giant-asteroid-flying-by-earth-next-week-looks-like-its-wearing-a-face-mask-c-996383", "urlToImage": null, "publishedAt": "2020-04-23T23:08:10Z", "content": "An asteroid estimated to be 1.9 km wide will fly by Earth next week, but its not expected to collide with our planet.\r\nAnd if an asteroid could be aware of such things, it appears to be wearing a face mask in deference to the pandemic, according to new images… [+2912 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Gerald Imray", "title": "Jump in cases raises fears Africa could become new centre of pandemic - The Age", "description": "WHO warned the virus could kill more than 300,000 people and push 30 million into desperate poverty.", "url": "https://www.smh.com.au/world/africa/jump-in-cases-raises-fears-africa-could-become-new-centre-of-pandemic-20200424-p54mtl.html", "urlToImage": null, "publishedAt": "2020-04-23T22:56:08Z", "content": "Africa still has time to avert such a disaster, Nkengasong said, but testing people and tracing virus cases is critical.\r\nSouth African National Defence Forces patrol in Johannesburg as residents protest against the lack of food. Many have lost their income a… [+3332 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "James O'Connor", "title": "When Does Travis Scott Come To Fortnite Today?: Concert Start Time - GameSpot", "description": "Rapper Travis Scott will be doing a virtual global tour of Fortnite in the form of the Astronomical concert tonight, performing a new track in the massive battle royale game. Here are all the show times.", "url": "https://www.gamespot.com/articles/travis-scott-fortnite-concert-when-can-i-catch-the/1100-6476241/", "urlToImage": null, "publishedAt": "2020-04-23T19:06:00Z", "content": "Fortnite: Battle Royale will host Travis Scott concert tonight that will be used to launch a new song from the rapper. The concert, called Astronomical, will involve Travis Scott dropping a new track as part of what's being called \"an other-worldly experience… [+2264 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Deloitte tightens grip on Virgin - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-23T10:45:00Z", "content": null}]}