{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "This iOS text code can crash your iPhone - here’s how you can fix it - TechRadar", "description": "It seems protection is coming from Apple too", "url": "https://www.techradar.com/news/watch-out-for-this-text-code-that-can-crash-your-iphone", "urlToImage": null, "publishedAt": "2020-04-25T14:30:00Z", "content": "There's a text message doing the rounds that can crash iPhones or disable the touchscreen, though Apple already seems to be working on a fix the beta version of iOS 13.4.5 appears to add extra protection against the rogue message.\r\nThe damaging string of text… [+1630 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "'No evidence' yet that recovered Covid-19 patients cannot be reinfected: WHO - Times of India", "description": "Rest of World News: The WHO said on Saturday that there was currently \"no evidence\" that people who have recovered from Covid-19 and have antibodies are protected from a", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/no-evidence-yet-that-recovered-covid-patients-cannot-be-reinfected-who/articleshow/75374877.cms", "urlToImage": null, "publishedAt": "2020-04-25T14:22:36Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Shona Ghosh", "title": "Apple is locked in a power battle with the UK, France, and Germany about how COVID-19 should be tracked - Business Insider Australia", "description": "The UK, France, and Germany are locked in a power battle with Apple and Google over the way COVID-19 should be tracked via apps.", "url": "https://www.businessinsider.com.au/france-uk-apple-contact-tracing-apps-2020-4", "urlToImage": null, "publishedAt": "2020-04-25T13:22:18Z", "content": "<ul><li>\r\nThere’s a power battle between the UK, Germany, and France on one side and Apple and Google on the other about coronavirus contact-tracing.\r\n</li><li>\r\nLike other countries, the UK, Germany, and France are creating apps that will track people who re… [+9617 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Adam Carey, Michael Fowler", "title": "Victoria's political unity on schools turns into open warfare - The Age", "description": "The state opposition has demanded the Andrews government immediately reopen schools to all students.", "url": "https://www.theage.com.au/national/victoria/victoria-s-political-unity-on-schools-turns-into-open-warfare-20200425-p54n5q.html", "urlToImage": null, "publishedAt": "2020-04-25T13:01:44Z", "content": "The Premier needs to understand the pressure that his restrictions are putting on families, Mr OBrien said. Other states are moving to get kids back to school safely and Victoria must do the same.\r\nThe Liberal leader proposed extra safety measures for schools… [+4543 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Danny Weidler", "title": "Greenberg's $650,000 parting gift from NRL - Sydney Morning Herald", "description": "If you think the game's departing chief executive looked relaxed, or even relieved, when he fronted the media after quitting, now you know why.", "url": "https://www.smh.com.au/sport/nrl/greenberg-s-650-000-parting-gift-from-nrl-20200425-p54n85.html", "urlToImage": null, "publishedAt": "2020-04-25T12:02:39Z", "content": "Greenbergs first contract, signed four years ago, was approved by former ARLC chairman John Grant. Greenbergs lawyers outsmarted the NRL.\r\nIt will raise more questions for an organisation that has been criticised for a bloated front office. It was a theme for… [+7937 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Laura Chung, Sally Rawsthorne, Latika Bourke", "title": "As the day unfolded: Scott Morrison says social distancing won't apply to schools, global COVID-19 cases surpass 2.7 million, Australian death toll stands at 81 - The Sydney Morning Herald", "description": "If you suspect you or a family member has coronavirus you should call (not visit) your GP or ring the national Coronavirus Health Information Hotline on 1800 020 080.", "url": "https://www.smh.com.au/national/coronavirus-updates-live-scott-morrison-says-social-distancing-won-t-apply-to-schools-global-covid-19-cases-surpass-2-7-million-australian-death-toll-stands-at-80-20200424-p54n21.html", "urlToImage": null, "publishedAt": "2020-04-25T12:00:00Z", "content": "If youve been paying attention to the shows promos, youll know it wont be business as usual when Tens news quiz show, Have You Been Paying Attention?, returns on May 4.\r\nWe realised about a month ago we werent going to be able to get an audience, or even five… [+566 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Adelaide and Perth airports seize Virgin aircraft as collateral against debts - Sky News Australia", "description": "Adelaide Airport has become the latest Australian airport to sieze possession of Virgin Australia aircraft as collateral against outstanding bills. Since bei...", "url": "https://www.youtube.com/watch?v=ywsYGqXZCh0", "urlToImage": null, "publishedAt": "2020-04-25T11:59:36Z", "content": null}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Staff writers", "title": "Coronavirus: White House considering scaling back Donald Trump’s role in daily virus briefings - NEWS.com.au", "description": "Coronavirus: White House considering scaling back Donald Trump’s role in daily virus briefings", "url": "https://www.news.com.au/world/coronavirus/global/coronavirus-white-house-considering-scaling-back-donald-trumps-role-in-daily-virus-briefings/news-story/b5c1d3534f49d4707be2531feece499d", "urlToImage": null, "publishedAt": "2020-04-25T11:06:01Z", "content": "The White House is reportedly considering scaling back Donald Trumps role in its daily coronavirus briefings after a series of blunders.There have been discussions about changing the format of the briefings to curtail the US President’s role, according to fou… [+4397 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jeran Wittenstein", "title": "Zoom’s Good Week Ends on Sour Note After Facebook Crashes Party - Yahoo Finance Australia", "description": "(Bloomberg) -- In another winning week, shares in Zoom Video Communications Inc. ended on a sour note after Facebook Inc. disclosed plans for a competing video chat product.The news sent Zoom shares tumbling, eventually closing with a decline of 6.1% on Frida…", "url": "https://au.finance.yahoo.com/news/zoom-good-week-ends-sour-110000176.html", "urlToImage": null, "publishedAt": "2020-04-25T11:00:00Z", "content": "(Bloomberg) --\r\nIn another winning week, shares in Zoom Video Communications Inc. ended on a sour note after Facebook Inc. disclosed plans for a competing video chat product.\r\nThe news sent Zoom shares tumbling, eventually closing with a decline of 6.1% on Fr… [+1987 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/kathryn-bermingham/12125068, https://www.abc.net.au/news/sara-tomevska/10287304", "title": "Two women killed, others injured in high-speed crash in Urrbrae, south of Adelaide - ABC News", "description": "Two women have died in a high-speed crash that took place at Urrbrae, south of Adelaide, on Saturday afternoon.", "url": "https://www.abc.net.au/news/2020-04-25/sa-urrbrae-hazmat-crash/12185150", "urlToImage": null, "publishedAt": "2020-04-25T10:17:31Z", "content": "Updated \r\nApril 25, 2020 19:02:39\r\nTwo people have been killed and three others seriously injured in a high-speed crash at Urrbrae, south of Adelaide.\r\n<ul><li>Three people are in a serious condition after the \"horrific\" crash</li><li>A witness felt her house… [+1966 chars]"}, {"source": {"id": null, "name": "Heraldsun.com.au"}, "author": null, "title": "Familiar voice returns to Overnight airwaves - Herald Sun", "description": "Subscribe to the Herald Sun to get unrestricted digital access, home paper delivery, Foxsports.com.au subscription,  Apps for iPad and Android and much more...", "url": "https://www.heraldsun.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": null}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "China sends medical team to check on Kim Jong-un's health, sources say - SBS News", "description": "China has sent a team including medical experts to advise on North Korea's Kim Jong-un, sources say.", "url": "https://www.sbs.com.au/news/china-sends-medical-team-to-check-on-kim-jong-un-s-health-sources-say", "urlToImage": null, "publishedAt": "2020-04-25T09:53:28Z", "content": "China has dispatched a team to North Korea including medical experts to advise on North Korean leader Kim Jong-un, according to three people familiar with the situation.\r\nThe trip by the Chinese doctors and officials comes amid conflicting reports about the h… [+3855 chars]"}, {"source": {"id": null, "name": "9news.com.au"}, "author": "9News Staff", "title": "'Die': $3m home of man arrested over deadly police crash vandalised - 9News", "description": "<p>The home of the Porsche driver held over the Melbourne police crash has been vandalized, as the family of one of the dead officers released an emotional tribute.</p>", "url": "https://www.9news.com.au/national/melbourne-police-crash-eastern-freeway-porsche-driver-richard-pusey-home-vandalised/818c433b-653b-4bf5-b18e-9fa4fc00813c", "urlToImage": null, "publishedAt": "2020-04-25T09:46:53Z", "content": "Property News: Tips and tricks for propagating edibles and seed saving - domain.com.au"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Calla Wahlquist", "title": "Health authorities defend handling of coronavirus cluster at Melbourne psychiatric facility - The Guardian", "description": "Fifteen people, including six patients, from the Albert Road Clinic have tested positive to Covid-19 since 24 March", "url": "https://www.theguardian.com/australia-news/2020/apr/25/health-authorities-defend-handling-of-coronavirus-cluster-at-melbourne-psychiatric-facility", "urlToImage": null, "publishedAt": "2020-04-25T09:33:43Z", "content": "Victorian health authorities have defended their response to a coronavirus outbreak in an inpatient psychiatric facility after staff and patients were not told of the cluster until one month after the first positive test.\r\nMeanwhile more than 180 Australians … [+4243 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Calla Wahlquist", "title": "Family of youngest officer killed in Melbourne freeway crash say 'bright light' is lost - The Guardian", "description": "Parents of constable Josh Prestney, 28, say they ‘cannot fathom the circumstances’ that led to their son’s death", "url": "https://www.theguardian.com/australia-news/2020/apr/25/family-of-youngest-officer-killed-in-melbourne-freeway-crash-say-bright-light-is-lost", "urlToImage": null, "publishedAt": "2020-04-25T09:08:00Z", "content": "The family of a police officer killed alongside three colleagues when they were struck by a truck on a Melbourne freeway on Wednesday say they have lost their bright light.\r\nConstable Josh Prestney, 28, was the youngest of the four officers killed in the inci… [+2683 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Rugby Australia board member to meet disgruntled former Wallaby to begin salvage job - Fox Sports", "description": "A Rugby Australia board member and one of the group of disgruntled former Wallabies captains are set to meet on Monday, as the troubled code tries to find unity.", "url": "https://www.foxsports.com.au/rugby/rugby-australia-board-member-to-meet-disgruntled-former-wallaby-to-begin-salvage-job/news-story/3e9ba5ac836bd1b8e6320c6cced3fcc3", "urlToImage": null, "publishedAt": "2020-04-25T07:59:00Z", "content": "The 10 former Wallabies skippers sent a letter expressing their discontent over the state of rugby in Australia to RA last week, a few days before chief executive Raelene Castle stood down.\r\nThey said Australian rugby had lost its way and had suffered from po… [+2661 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Oliver Harvey", "title": "Coronavirus: Prince William is lifting Britain’s spirits during lockdown - NEWS.com.au", "description": "Coronavirus: Prince William is lifting Britain’s spirits during lockdown", "url": "https://www.news.com.au/entertainment/celebrity-life/royals/coronavirus-prince-william-is-lifting-britains-spirits-during-lockdown/news-story/4a84968209de83390eacd01faa586cd4", "urlToImage": null, "publishedAt": "2020-04-25T07:55:17Z", "content": "Like monarchs down a long line of history, Prince William has proved himself strongest as his country faces its darkest hours.\r\nGrabbing the baton for the royal family, William, wife Kate, and their joyful young family have led by example, with their knack of… [+2564 chars]"}, {"source": {"id": null, "name": "Brisbanetimes.com.au"}, "author": "Jocelyn Garcia", "title": "Queensland's weekly COVID-19 tally drops by more than two thirds - Sydney Morning Herald", "description": "The coronavirus case total has risen to 1026. Police have fined 33 people in the past 24 hours for breaching public health directions. Since March 27, 1,354 fines have been dished out.", "url": "https://www.brisbanetimes.com.au/national/queensland/queensland-s-weekly-covid-19-tally-drops-by-more-than-two-thirds-20200425-p54n6y.html", "urlToImage": null, "publishedAt": "2020-04-25T07:45:50Z", "content": "Chief Health Officer Jeannette Young said 964 of the confirmed patients in Queensland had recently travelled overseas or had close contact with a confirmed case, such as their partner or flatmate.\r\nPolice have fined 33 people in the past 24 hours for breachin… [+1102 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Alle McMahon", "title": "Coronavirus Australia: Big changes that will affect Aussie life over the coming months - NEWS.com.au", "description": "Coronavirus Australia: Big changes that will affect Aussie life", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-australia-big-changes-that-will-affect-aussie-life/news-story/ec24e2ad30e9c781bc070390d740c223", "urlToImage": null, "publishedAt": "2020-04-25T07:34:25Z", "content": "Australia has now reached the third wave of the coronavirus, the Prime Minister has declared.First there was the “export phase”, when the virus spread from Wuhan to countries across the globe. Then there was the “repatriation phase”, when overseas travellers … [+7293 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Coronavirus Australia live updates: National death toll rises; Donald Trump shocks with disinfectant injection musing - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T07:26:00Z", "content": null}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Brett Wadelton", "title": "Space news: Asteroid to pass close to Earth next week, visible by telescope - 7NEWS.com.au", "description": "Stargazers are set for a treat early next week as an asteroid will pass close to Earth.", "url": "https://7news.com.au/technology/space/space-news-mask-shaped-asteroid-to-pass-close-to-earth-next-week-visible-by-telescope-c-993995", "urlToImage": null, "publishedAt": "2020-04-25T06:38:57Z", "content": "Astronomers are set for a treat early next week as an asteroid will pass close to Earth.\r\nNamed Asteroid (52768) 1998 OR2, this large near-Earth and potentially hazardous asteroid (PHA) will safely fly past us at a mere 6.3 million kilometres - which is quite… [+1587 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "‘He’s never backed a winning cause:’ Kenty’s swipe at FitzSimons - Fox Sports", "description": "<b>Tune into our new show Fox League Live on Channel 502 Monday to Friday at 6.30pm and on Saturday at 3pm and Sunday at 5pm.</b>", "url": "https://www.foxsports.com.au/nrl/nrl-premiership/nrl-2020-paul-kent-peter-fitzsimons-nrl-restart-date-may-28-gladys-berejiklian/news-story/ecad45e5b8be5595c7dafa6e9721b7aa", "urlToImage": null, "publishedAt": "2020-04-25T06:24:00Z", "content": "The Daily Telegraphs Paul Kent has delivered a stunning take-down of Sydney Morning Herald columnist Peter FitzSimons, saying: hes never backed a winning cause.\r\nThe former Wallaby penned a column saying that NSW premier Gladys Berejiklian needed to put rugby… [+2938 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Pam Whaley", "title": "Peter V'landys says NRL plans to honour COVID-19 health workers in State of Origin series - Wide World of Sports", "description": "'There's a few things we can do in that period'", "url": "https://wwos.nine.com.au/nrl/nrl-look-honour-health-workers-at-origin/d06ca541-9319-48e2-a105-cf21d6c93986", "urlToImage": null, "publishedAt": "2020-04-25T05:51:32Z", "content": "A three-game State of Origin series will be held at the end of the year with hopes the NRL can reward health workers and attract a safe crowd.\r\nWhile a competition structure is still unknown, ARLC chairman Peter V'landys has confirmed the NRL will move it's b… [+1809 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Protesters lay 'body bags' at Trump hotel over coronavirus response - SBS News", "description": "Anti-Donald Trump protesters have taken to the Trump International Hotel in Washington, DC to show disapproval of his administration's coronavirus response.", "url": "https://www.sbs.com.au/news/protesters-lay-body-bags-at-trump-hotel-over-coronavirus-response", "urlToImage": null, "publishedAt": "2020-04-25T05:09:43Z", "content": "Protesters frustrated with President Donald Trump and his administration's handling of the coronavirus crisis have placed 'body bags' outside a hotel owned by his family.\r\nThe black garbage bags, filled with cardboard to make them look like body bags with cor… [+2825 chars]"}, {"source": {"id": null, "name": "Couriermail.com.au"}, "author": null, "title": "Teacher unions aren’t just hurting kids, it’s the teachers too - Courier Mail", "description": "Subscribe to The Courier-Mail to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.couriermail.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T05:00:00Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rosa Flores, Sara Weisfeldt and Arman Azad, CNN", "title": "2 studies show many people who tested positive for Covid-19 displayed no symptoms - CNN", "description": "Two coronavirus studies released Friday -- one involving almost 2,000 people from Florida and the other from a Washington state nursing home -- came to the same conclusion: Many of the people who tested positive for the virus didn't know it they had it becaus…", "url": "https://www.cnn.com/2020/04/24/us/2-asymptomatic-coronavirus-studies/index.html", "urlToImage": null, "publishedAt": "2020-04-25T04:54:54Z", "content": null}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "AP", "title": "US coronavirus protests: 1500 protesters crowd Wisconsin capital - NEWS.com.au", "description": "Coronavirus: Crowd of 1500 storms capital in latest US protest", "url": "https://www.news.com.au/world/north-america/coronavirus-crowd-of-1500-storms-capital-in-latest-us-protest/news-story/f4d279f3d294214c6b69cf81909aa903", "urlToImage": null, "publishedAt": "2020-04-25T02:59:56Z", "content": "Around 1500 Trump supporters ignored social distancing to stage the latest protest in the United States against lockdown measures.The demonstrations by right-wing groups against measures to contain the coronavirus, which have risen up around the country, came… [+1431 chars]"}, {"source": {"id": null, "name": "Newidea.com.au"}, "author": "New Idea", "title": "Stunning claim made about Meghan Markle and her father in court - New Idea", "description": "A shock new claim has been made about the Duchess of Sussex and her estranged father Thomas Markle.", "url": "https://www.newidea.com.au/stunning-claim-made-about-meghan-markle-and-her-father-in-court", "urlToImage": null, "publishedAt": "2020-04-25T00:33:00Z", "content": "It has been claimed that Meghan Markle has not seen her father Thomas in two years.\r\nLawyers for the the royal husband and wife claim the letters publication was a misuse of private information and breached her copyright.\r\nThe publication of the letter is cla… [+1059 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/abc-local/sophie-kesteven/7149610", "title": "Raquel is working from home during coronavirus — and that means sloths in the spare room - ABC News", "description": "Working from home means different things for different people. For Raquel, it means moving three very lazy — but very cute — new housemates into the spare room.", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-panama-working-from-home-with-sloths/12169922", "urlToImage": null, "publishedAt": "2020-04-24T22:29:37Z", "content": "Updated \r\nApril 25, 2020 08:23:26\r\nWorking from home is the new normal for many people and for Raquel Cruz Alpizar, it's meant moving three unlikely new housemates into her spare room.\r\nSince coronavirus restrictions took hold, she's been caring around the cl… [+6272 chars]"}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": "Alex Crowe", "title": "Anzac Day tribute remembers Australian and New Zealanders who served - The Canberra Times", "description": "The Anzac Day service looked very different ...", "url": "https://www.canberratimes.com.au/story/6734982/anzacs-honoured-though-not-in-the-way-were-used-to/", "urlToImage": null, "publishedAt": "2020-04-24T22:00:00Z", "content": ""}, {"source": {"id": null, "name": "Smh.com.au"}, "author": null, "title": "Captain Tom Moore becomes oldest person to top Britain's music chart - The Age", "description": "A World War II veteran who raised millions for charity has now become the oldest person to top Britain's main music chart.", "url": "https://www.smh.com.au/world/europe/captain-tom-moore-becomes-oldest-person-to-top-britain-s-music-chart-20200425-p54n4v.html", "urlToImage": null, "publishedAt": "2020-04-24T20:40:50Z", "content": "He also went to No.1 on the music charts - with a little help from a friend.\r\nThe cover version of You'll Never Walk Alone that Moore appears on with singer Michael Ball was on course to be pipped by The Weeknd's Blinding Lights, until the Canadian star asked… [+1312 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Microsoft Begins Showing Edge Ads in Outlook.com - Somag News", "description": "US technology giant Microsoft has begun to run ads with download links on the email service Outlook.com for its new Chromium-based Microsoft Edge browser, which it launched earlier this year. Edge recently managed to be the second most popular internet browse…", "url": "https://www.somagnews.com/microsoft-begins-showing-edge-ads-outlook-com/", "urlToImage": null, "publishedAt": "2020-04-24T19:22:00Z", "content": "US technology giant Microsoft has begun to run ads with download links on the email service Outlook.com for its new Chromium-based Microsoft Edge browser, which it launched earlier this year. Edge recently managed to be the second most popular internet browse… [+1516 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": "Adrian Rollins", "title": "JobKeeper fixes unveiled improving access for some sectors - The Canberra Times", "description": "Employers will not be able to pick and choose who gets JobKeeper payments.", "url": "https://www.canberratimes.com.au/story/6734871/jobkeeper-fixes-unveiled-improving-access-for-some-sectors/", "urlToImage": null, "publishedAt": "2020-04-24T14:00:00Z", "content": ""}, {"source": {"id": null, "name": "Theconversation.com"}, "author": "Rodger I. Thompson", "title": "How the Hubble Space Telescope opened our eyes to the first galaxies of the universe - The Conversation US", "description": "Thirty years ago the Hubble Space Telescope began snapping photos of distant stars, providing a time machine that has taken astronomers back to when the universe was less than a billion years old.", "url": "https://theconversation.com/how-the-hubble-space-telescope-opened-our-eyes-to-the-first-galaxies-of-the-universe-133877", "urlToImage": null, "publishedAt": "2020-04-24T12:22:00Z", "content": "The Hubble Space Telescope launched on the 24th of April, 30 years ago. Its an impressive milestone especially as its expected lifespan was just 10 years.\r\nOne of the primary reasons for the Hubble telescopes longevity is that it can be serviced and improved … [+6948 chars]"}, {"source": {"id": null, "name": "Heraldsun.com.au"}, "author": null, "title": "Virgin Australia aircraft blocked in Perth as collapse could domino air route shutdown across the country - Herald Sun", "description": "Subscribe to the Herald Sun to get unrestricted digital access, home paper delivery, Foxsports.com.au subscription,  Apps for iPad and Android and much more...", "url": "https://www.heraldsun.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-24T12:03:00Z", "content": null}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/jessica-warriner/11501098", "title": "WA teachers urge parents to keep children home in term two, in advertising blitz on Government - ABC News", "description": "The union representing public school teachers in WA launches an advertising blitz against the State Government's decision to reopen schools next week.", "url": "https://www.abc.net.au/news/2020-04-24/wa-teachers-urge-parents-to-keep-children-home-term-two/12180836", "urlToImage": null, "publishedAt": "2020-04-24T05:40:50Z", "content": "Updated \r\nApril 25, 2020 15:25:31\r\nThe union representing public school teachers in Western Australia has launched an advertising blitz against the State Government's decision to reopen schools next week while citing safety fears over coronavirus. \r\nKey Point… [+8002 chars]"}, {"source": {"id": null, "name": "Onestepoffthegrid.com.au"}, "author": "Sophie Vorrath", "title": "NSW paves way for more – and bigger – rooftop solar systems - One Step Off The Grid", "description": "NSW government unveils further relaxations to renewable energy development policy, paving way for installation of larger residential and commercial rooftop solar systems.", "url": "https://onestepoffthegrid.com.au/nsw-paves-way-for-more-and-bigger-rooftop-solar-systems/", "urlToImage": null, "publishedAt": "2020-04-24T01:21:37Z", "content": "The New South Wales government has unveiled further relaxations to laws governing renewable energy development, paving the way for the installation of larger residential and commercial rooftop solar systems across the state.\r\nThe new amendments to the State E… [+2992 chars]"}]}