{"status": "ok", "totalResults": 34, "articles": [{"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Le Figaro avec AFP", "title": "Déconfinement: les transports entre régions possibles, préconise le Conseil scientifique - Le Figaro", "description": null, "url": "http://www.lefigaro.fr/sciences/deconfinement-les-transports-entre-regions-possibles-preconise-le-conseil-scientifique-20200425", "urlToImage": null, "publishedAt": "2020-04-25T21:57:00Z", "content": "Les déplacements d'une région à l'autre par transports en commun pourraient à nouveau être autorisés dès lors que les mesures barrière et les règles de distanciation sociale sont respectées, propose le Conseil scientifique dans un avis sur le déconfinement re… [+1947 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "École, commerces, dépistages, seniors… Ce que recommande le Conseil scientifique pour le déconfinement - Le Parisien", "description": "Le comité a rendu deux avis, dont l’un porte exclusivement sur la réouverture des établissements scolaires, qu’il déconseillait jusqu’à sept", "url": "http://www.leparisien.fr/societe/ecole-commerces-depistages-seniors-ce-que-recommande-le-conseil-scientifique-pour-le-deconfinement-25-04-2020-8305890.php", "urlToImage": null, "publishedAt": "2020-04-25T21:39:00Z", "content": "Le conseil scientifique chargé de conseiller l'exécutif sur la gestion de l'épidémie de coronavirus a rendu publics samedi deux avis portant sur le déconfinement progressif à venir. L'un d'eux contient des préconisations drastiques pour la rentrée scolaire pr… [+5319 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Emma Vanpoulle", "title": "The Voice 2020 - Les KO : Pascal Obispo, intransigeant, multiplie les piques - Pure People", "description": "Suite et fin des KO dans \"The Voice\". Samedi 25 avril 2020, c'est Pascal Obispo qui a clôturé cette épreuve en faisant passer son équipe de sept talents... à seulement trois. Quels talents l'ont convaincu et ont rejoint ceux de ses camarades en demi-finale ? …", "url": "https://www.purepeople.com/article/the-voice-2020-les-ko-pascal-obispo-intransigeant-multiplie-les-piques_a385562/1", "urlToImage": null, "publishedAt": "2020-04-25T20:40:00Z", "content": "Après des semaines de compétition, l'étau se resserre dansThe Voice. Samedi 25 avril 2020, les coachs ont vécu une nouvelle et ultime soirée des KO. Après les choix déchirants établis par Marc Lavoine, puis ceux d'Amel Bent et enfin Lara Fabian, ce fut au tou… [+10521 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Violences à Gennevilliers. Un livreur mis en examen pour avoir fourni des cités en cocktails Molotov - Ouest-France éditions locales", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMimgFodHRwczovL3d3dy5vdWVzdC1mcmFuY2UuZnIvc29jaWV0ZS9mYWl0cy1kaXZlcnMvdmlvbGVuY2VzLWdlbm5ldmlsbGllcnMtdW4tbGl2cmV1ci1taXMtZW4tZXhhbWVuLXBvdXItYXZvaXItZm91cm5pLWRlcy1jaXRlcy1lbi1jb2NrdGFpbHMtbW9sb3Rvdi02ODE3Nzkz0gGaAWh0dHBzOi8vYW1wLm91ZXN0LWZyYW5jZS5mci9zb2NpZXRlL2ZhaXRzLWRpdmVycy92aW9sZW5jZXMtZ2VubmV2aWxsaWVycy11bi1saXZyZXVyLW1pcy1lbi1leGFtZW4tcG91ci1hdm9pci1mb3VybmktZGVzLWNpdGVzLWVuLWNvY2t0YWlscy1tb2xvdG92LTY4MTc3OTM?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T20:11:09Z", "content": null}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Benjamin Lecomte (Monaco) : « J'envoie ma force et mon courage à Junior Sambia » - Foot - Coronavirus - L'Équipe.fr", "description": "Lors d'un live Instagram avec le journaliste de « L'Équipe » Hugo Guillemet, le gardien de but monégasque a tenu à témoigner son soutien à son ancien coéquipier Junior Sambia, touché par le coronavirus.", "url": "https://www.lequipe.fr/Football/Actualites/Benjamin-lecomte-monaco-j-envoie-ma-force-et-mon-courage-a-junior-sambia/1129790", "urlToImage": null, "publishedAt": "2020-04-25T20:09:27Z", "content": "Benjamin Lecomte (Monaco) : « Je voudrais envoyer toute ma force et mon courage à Junior (Sambia) et à ses proches, et lui dire que je le soutiens. Cela fait toujours bizarre quand c'est un joueur avec qui l'on a joué qui attrape le coronavirus et qui est hos… [+222 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus: plus de 200.000 morts dans le monde - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_324941ef-e804-4464-b793-d4fa92a586da&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-25T19:57:00Z", "content": "Afin de vous offrir une expérience globale optimisée, nous souhaitons vous proposer des publicités pertinentes qui vous seront plus utiles. Par exemple, lorsque vous recherchez un film, nous utilisons vos données de recherche et votre position pour afficher l… [+471 chars]"}, {"source": {"id": null, "name": "Dailymercato.com"}, "author": "", "title": "Finalement, Cavani se verrait bien prolonger le plaisir au PSG - Daily Mercato", "description": "Promis &agrave; un d&eacute;part cet &eacute;t&eacute;, Edinson Cavani se verrait finalement bien rester au PSG encore un peu....", "url": "https://www.dailymercato.com/news/finalement-cavani-se-verrait-bien-prolonger-le-plaisir-au-psg", "urlToImage": null, "publishedAt": "2020-04-25T19:29:04Z", "content": "Promis à un départ cet été, Edinson Cavani se verrait finalement bien rester au PSG encore un peu.Et si Cavani restait au PSG ? Selon L'Equipe, cette hypothèse n'est pas à exclure et c'est une petite surprise en soi puisque le buteur uruguayen avait voulu par… [+1101 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "BFMTV", "title": "Edouard Philippe annoncera le plan de déconfinement ce mardi à l'Assemblée - BFMTV", "description": "INFO BFMTV - Le plan présenté ce mardi par le Premier ministre fera ensuite l'objet d'un vote devant les parlementaires.", "url": "https://www.bfmtv.com/politique/coronavirus-edouard-philippe-va-annoncer-le-plan-de-deconfinement-ce-mardi-a-l-assemblee-1901010.html", "urlToImage": null, "publishedAt": "2020-04-25T19:13:31Z", "content": null}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Coronavirus : les signalements d'effets indésirables des traitements en hausse - RTL.fr", "description": "300 cas d'effets indésirables liés aux traitements testés contre le Covid-19 ont été signalés ces dernières semaines.", "url": "https://www.rtl.fr/actu/bien-etre/coronavirus-les-signalements-d-effets-indesirables-des-traitements-en-hausse-7800442761", "urlToImage": null, "publishedAt": "2020-04-25T19:11:00Z", "content": "\"Au 22 avril 2020, 321 cas d'effets indésirables ont été déclarés en lien avec une infection au Covid-19, dont 80% de cas graves\", détaille l'Agence nationale de sécurité du médicament, qui avait annoncé une centaine de cas le 10 avril.\r\nDans les deux tiers d… [+1763 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Coronavirus : le Royaume-Uni passe le cap «profondément tragique» des 20 000 morts - Le Parisien", "description": "Au mois de mars, des responsables du secteur de la santé estimaient qu’un bilan final de 20 000 morts ou moins serait un « bon résultat ». I", "url": "http://www.leparisien.fr/international/coronavirus-le-royaume-uni-passe-le-cap-profondement-tragique-des-20-000-morts-25-04-2020-8305875.php", "urlToImage": null, "publishedAt": "2020-04-25T18:54:00Z", "content": "La ministre de l'Intérieur a déploré un cap « profondément tragique », appelant la population à « être forte » pour poursuivre le confinement. Le Royaume-Uni a dépassé les 20 000 morts à l'hôpital de patients atteints par le nouveau coronavirus, ce samedi.\r\nS… [+2137 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "Transport aérien : crash annoncé pour les compagnies low cost - Franceinfo", "description": "", "url": "https://www.francetvinfo.fr/sante/maladie/coronavirus/transport-aerien-crash-annonce-pour-les-compagnies-low-cost_3934567.html", "urlToImage": null, "publishedAt": "2020-04-25T18:41:41Z", "content": "Depuis près de deux mois, les avions sont cloués au sol. Avec la diffusion du coronavirus Covid-19, les voyages professionnels, à l'instar des vacances, ont été suspendus. Même l'aéroport d'Orly (Val-de-Marne), a dû fermer ses portes, face à la baisse du traf… [+685 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Aide de l'Etat à Air France : \"Il est certain qu'il faudra repenser notre activité\" - Europe 1", "description": "Alors que le gouvernement a annoncé un plan d'aide de sept milliards d'euros pour le groupe Air France-KLM, direction et salariés se réjouissent. Au micro d'...", "url": "https://www.youtube.com/watch?v=0BY1j4s8X2w", "urlToImage": null, "publishedAt": "2020-04-25T18:15:38Z", "content": "Alors que le gouvernement a annoncé un plan d'aide de sept milliards d'euros pour le groupe Air France-KLM, direction et salariés se réjouissent. Au micro d'Europe 1 samedi, le délégué syndical FO-Air France Christophe Malloggi a néanmoins rappelé que la cris… [+358 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Les infos de 18h - Déconfinement : comment va se passer le retour à l'école - RTL.fr", "description": "L'Académie de médecine a donné ce samedi 25 avril une batterie de recommandations sanitaires pour la rentrée scolaire.", "url": "https://www.rtl.fr/actu/debats-societe/les-infos-de-18h-deconfinement-comment-va-se-passer-le-retour-a-l-ecole-7800442803", "urlToImage": null, "publishedAt": "2020-04-25T17:45:00Z", "content": "LAcadémie de médecine vient de donner ce samedi 25 avril son mode demploi pour la réouverture des écoles. En plus de la prise systématique de la température des élèves quand ils arrivent à lécole, l'institution insiste sur les mesures de distanciation avec de… [+1733 chars]"}, {"source": {"id": null, "name": "Presse-citron.net"}, "author": "Hadrien Augusto", "title": "Amazon perd face à la justice française, quelles conséquences sur les commandes ? - Presse-citron", "description": "Le géant du e-commerce a perdu son appel vendredi, laissant place à de nombreux doutes pour les clients et les employés.", "url": "https://www.presse-citron.net/amazon-justice-consequences-sur-les-commandes/", "urlToImage": null, "publishedAt": "2020-04-25T17:34:19Z", "content": "La cour dappel de Versailles vient de confirmer lordonnance du 14 avril du tribunal de Nanterre, dans laquelle il a été décidé quAmazon sen tienne à la distribution de produits essentiels pendant lépidémie de coronavirus. La décision, pour laquelle Amazon Fra… [+2332 chars]"}, {"source": {"id": null, "name": "Presse-citron.net"}, "author": "Stéphane Ficca", "title": "C’est officiel, les vidéos de groupe à 8 participants arrivent sur WhatsApp ! - Presse-citron", "description": "Facebook a annoncé qu'il sera bientôt possible, via WhatsApp, d'effectuer des appels vocaux et des vidéos de groupe, comprenant jusqu'à 8 personnes.", "url": "https://www.presse-citron.net/whatsapp-permettra-bientot-des-appels-video-a-8-participants/", "urlToImage": null, "publishedAt": "2020-04-25T17:15:52Z", "content": "Depuis plus d’un mois maintenant, de très nombreux confinés font appel aux applications de messagerie pour rester en contact avec leurs proches. Selon Facebook, entre WhatsApp et Messenger, ce sont plus de 700 millions de comptes qui participent à des appels … [+1594 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "PSG : Neymar c'est 164ME, la FIFA a tranché - Foot01.com", "description": "Retenu par le Paris Saint-Germain l’été dernier, Neymar sera un peu plus accessible au prochain mercato. Pour le recruter, il faudra bien payer le prix fixé par la FIFA, un montant révélé par son ancien agent Wagner Ribeiro.\r\nParmi les nombreuses rumeurs…", "url": "https://www.foot01.com/equipe/paris/psg-neymar-c-est-164me-la-fifa-a-tranche,347961", "urlToImage": null, "publishedAt": "2020-04-25T17:12:18Z", "content": "Retenu par le Paris Saint-Germain lété dernier, Neymar sera un peu plus accessible au prochain mercato. Pour le recruter, il faudra bien payer le prix fixé par la FIFA, un montant révélé par son ancien agent Wagner Ribeiro.\r\nParmi les nombreuses rumeurs qui c… [+1569 chars]"}, {"source": {"id": null, "name": "Francebleu.fr"}, "author": "Sixtine Lys", "title": "Coronavirus : 369 morts de plus en 24 heures, le nombre de patients en réanimation continue de diminuer - France Bleu", "description": "124.114 personnes ont été contaminées en France, indique la direction générale de la Santé samedi dans un communiqué. 22.614 décès sont comptabilisés depuis le 1er mars.", "url": "https://www.francebleu.fr/infos/sante-sciences/coronavirus-369-morts-de-plus-en-24-heures-le-nombre-de-patients-en-reanimation-continue-de-diminuer-1587834475", "urlToImage": null, "publishedAt": "2020-04-25T17:10:10Z", "content": "Selon un nouveau bilan dévoilé par la direction générale de la Santé ce samedi soir, l'épidémie de Coronavirus a fait 22.614 décès depuis le 1er mars en France. C'est 369 morts de plus en 24 heures.\r\nL'épidémie a tué 14.050 personnes dans les hôpitaux, soit 1… [+564 chars]"}, {"source": {"id": null, "name": "Huffingtonpost.fr"}, "author": "Geoffroy Clavel", "title": "Trump et désinfectant... Ce tweet de Ricky Gervais en 2016 relève de la prophétie - Le HuffPost", "description": "En mars 2016, l'humoriste britannique réputé pour ses blagues décapantes ironisait sur le lien entre l'élection possible de Donald Trump et l'eau de javel. Quatre ans après....", "url": "https://www.huffingtonpost.fr/entry/trump-desinfectant-ce-tweet-de-ricky-gervais-en-2016-releve-de-la-prophetie_fr_5ea45496c5b6f9639815b49a", "urlToImage": null, "publishedAt": "2020-04-25T15:52:01Z", "content": "CORONAVIRUS - On connaissait son humour grinçant qui a fait des ravages dans la version originale de “The Office” ou lors des cérémonies des Golden Globes. On ignorait en revanche tout des talents de devin de Ricky Gervais.\r\nAlors que le président américain D… [+2056 chars]"}, {"source": {"id": null, "name": "Laprovence.com"}, "author": "La Provence", "title": "Al Pacino fête ses 80 ans : ses consécrations, ses rôles refusés... Un géant du cinéma - La Provence", "description": "Le temps passe très vite. Al Pacino, un des géants du cinéma américain, fête aujourd'hui ses 80 ans. New-Yorkais de naissance, Al Pacino compte plus de 50 années de carrière marquée par de nombreuses récompenses (Oscar, Emmy Award, Tony Award...) et des rôles…", "url": "https://www.laprovence.com/actu/en-direct/5971677/al-pacino-fete-ses-80-ans-ses-consecrations-ses-roles-refuses-un-geant-du-cinema.html", "urlToImage": null, "publishedAt": "2020-04-25T15:13:27Z", "content": "Le temps passe très vite. Al Pacino, un des géants du cinéma américain, fête aujourd'hui ses 80 ans. New-Yorkais de naissance, Al Pacino compte plus de 50 années de carrière marquée par de nombreuses récompenses (Oscar, Emmy Award, Tony Award...) et des rôles… [+1952 chars]"}, {"source": {"id": null, "name": "Europe1.fr"}, "author": "Europe1 .fr", "title": "Coronavirus : \"Impossible de tester 60 millions de Français tous les jours\" pour Olivier Véran - Europe 1", "description": "Tester l'ensemble des Français pour savoir s'ils sont porteurs du coronavirus serait &quot;impossible&quot; et &quot;n'a pas de sens du niveau médical&quot;, a jugé samedi le ministre de la Santé Olivier Véran, réaffirmant la &quot;priorité&quot; donnée au dé…", "url": "https://www.europe1.fr/sante/coronavirus-impossible-de-tester-60-millions-de-francais-tous-les-jours-pour-olivier-veran-3964366", "urlToImage": null, "publishedAt": "2020-04-25T15:10:02Z", "content": "\"On va faire tester 60 millions de Français tous les jours ? C'est impossible, aucun pays au monde ne le fait\", a déclaré le ministre de la Santé, samedi, expliquant d'une part que les capacités de tests actuelles pour le covid-19 n'étaient pas suffisantes et… [+2216 chars]"}, {"source": {"id": null, "name": "Www.lci.fr"}, "author": "La rédaction de LCI", "title": "Est-on immunisé après avoir été infecté par le coronavirus ? Pas sûr, prévient l’OMS - LCI", "description": "PANDEMIE – Une fois guéri du coronavirus, un patient peut-il de nouveau être infecté ? Rien n’indique le contraire, estime l’Organisation mondiale de la santé, qui explique qu’il n’y a pas de preuve que les personnes déjà testées positives au Covid-19 soient …", "url": "https://www.lci.fr/sante/coronavirus-pas-de-preuve-que-les-malades-covid19-gueris-sont-immunise-selon-l-oms-met-en-garde-contre-tests-serologiques-2152021.html", "urlToImage": null, "publishedAt": "2020-04-25T15:06:56Z", "content": "\"A la date du 24 avril 2020, aucune étude n'a évalué si la présence d'anticorps au SARS-CoV-2 (le nom scientifique du Covid-19, ndlr) confère une immunité contre une future infection par ce virus chez les humains\", précise-t-elle. Certains gouvernements ont é… [+1658 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Etienne Froment pour 20 Minutes", "title": "Les avatars débarquent sur Facebook et dans Messenger - 20 Minutes", "description": "Les membres du réseau social Facebook peuvent désormais créer un avatar à leur image", "url": "https://www.20minutes.fr/high-tech/2765647-20200422-les-avatars-debarquent-sur-facebook-et-dans-messenger", "urlToImage": null, "publishedAt": "2020-04-25T14:43:35Z", "content": "Les avatars débarquent sur Facebook et dans Messenger Geeko\r\nDéjà disponible en Australie, la fonctionnalité de créer son avatar sur Facebook serait actuellement déployée massivement en Europe, selon TechCrunch. Sinspirant très ouvertement de \r\nBitmoji, propr… [+1396 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "VIDÉO. Comment Kanye West est devenu milliardaire... avec Yeezy, sa marque de baskets - Le Parisien", "description": "Kanye West ne doit pas son 1,3 milliard de dollars à sa musique mais à sa marque de baskets Yeezy, selon le magazine Forbes.", "url": "http://www.leparisien.fr/video/video-comment-kanye-west-est-devenu-milliardaire-avec-yeezy-sa-marque-de-baskets-25-04-2020-8305725.php", "urlToImage": null, "publishedAt": "2020-04-25T12:50:00Z", "content": "Rappeur unanimement salué par la critique qui compte parmi les plus gros vendeurs de disques et les artistes plus récompensés, Kanye West est désormais milliardaire. Le magazine Forbes annoncé que le rappeur de Chicago comptait parmi son célèbre classement, g… [+51 chars]"}, {"source": {"id": null, "name": "Public.fr"}, "author": null, "title": "PHOTOS - Matt Pokora et Christina Milian organisent une pool party en plein confinement ! - Public.fr", "description": "Dur, dur le confinement à Los Angeles...", "url": "https://www.public.fr/Toutes-les-photos/PHOTOS-Matt-Pokora-et-Christina-Milian-organisent-une-pool-party-en-plein-confinement-1639787", "urlToImage": null, "publishedAt": "2020-04-25T12:35:00Z", "content": "Est-ce quil est possible de dire que les temps sont durs pour Matt Pokora ? Ces dernières semaines, le chanteur de 34 ans a dû faire le dos rond lorsque la tempête sest abattue sur lui. La pandémie de covid-19 a bouleversé le quotidien de milliards de personn… [+1674 chars]"}, {"source": {"id": null, "name": "Jeuxvideo.com"}, "author": "theholomovement", "title": "Animal Crossing New Horizons : une invasion extraterrestre à venir ? Notre guide pour voir l'indice - jeuxvideo.com", "description": "Dans Animal Crossing : New Horizons sur Nintendo Switch, beaucoup de mystères attendent encore d'être découverts. Pendant que nous remplissons nos bébêtopédies ou cherchons à devenir riche en spéculant sur le navet, et si une invasion extraterrestre se prépar…", "url": "http://www.jeuxvideo.com/news/1216763/animal-crossing-new-horizons-une-invasion-extraterrestre-a-venir-notre-guide-pour-voir-l-indice.htm", "urlToImage": null, "publishedAt": "2020-04-25T12:29:00Z", "content": "Dans Animal Crossing : New Horizons sur Nintendo Switch, beaucoup de mystères attendent encore d'être découverts. Pendant que nous remplissons nos bébêtopédies ou cherchons à devenir riche en spéculant sur le navet, et si une invasion extraterrestre se prépar… [+1133 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Yannick Sagorin", "title": "Ce qu’ont versé Canal+ et beIN Sports à la LFP - Sports.fr", "description": "Les groupes Canal+ et beIN Sports ont obtenu une belle ristourne auprès de la LFP pour les matches de championnat déjà diffusés. Les négociations des présidents Nasser al-Khelaïfi (PSG), Jacques-Henri Eyraud (OM), Olivier Sadran (Toulouse) et Jean-Pierre Rivè…", "url": "https://www.sports.fr/football/quont-verse-canal-bein-sports-a-lfp-349556.html", "urlToImage": null, "publishedAt": "2020-04-25T10:44:47Z", "content": "Les groupes Canal+ et beIN Sports ont obtenu une belle ristourne auprès de la LFP pour les matches de championnat déjà diffusés.\r\nLes négociations des présidents Nasser al-Khelaïfi (PSG), Jacques-Henri Eyraud (OM), Olivier Sadran (Toulouse) et Jean-Pierre Riv… [+857 chars]"}, {"source": {"id": null, "name": "Huffingtonpost.fr"}, "author": "Maxime Bourdier", "title": "DIRECT. Coronavirus: Le Royaume-Uni franchit le seuil des 20.000 morts - Le HuffPost", "description": "Retrouvez les informations liées à la pandémie de Covid-19 en France et à travers le monde ce week-end des 25 et 26 avril.", "url": "https://www.huffingtonpost.fr/entry/direct-coronavirus-confinement-toutes-les-informations-liees-a-la-pandemie-de-covid-19-en-france-et-a-travers-le-monde_fr_5ea2f954c5b6d376358e71c3", "urlToImage": null, "publishedAt": "2020-04-25T07:10:08Z", "content": "CORONAVIRUS - “Crise sanitaire mondiale majeure de notre époque”, pour l’OMS, pire crise mondiale depuis 1945 selon l’ONU, la pandémie de Covid-19 fait des dégâts planétaires et son bilan s’alourdit chaque jour. Partie en décembre de Chine où elle semble maît… [+14908 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Les infos de 8h - Les compagnies aériennes sommées de rembourser les voyageurs lésés - RTL.fr", "description": "Les compagnies aériennes proposent des avoirs aux voyageurs dont le billet a été annulé pour cause de coronavirus.", "url": "https://www.rtl.fr/actu/conso/les-infos-de-8h-les-compagnies-aeriennes-sommees-de-rembourser-les-voyageurs-leses-7800440573", "urlToImage": null, "publishedAt": "2020-04-25T06:53:00Z", "content": "Air France est mise en demeure par l'UFC-Que choisir, ainsi que la compagnie allemande Lufthansa ou Emirates et Easyjet... L'association de consommateurs donne 15 jours aux compagnies pour rembourser aux clients les billets annulés en raison de l'épidémie, ce… [+1610 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": "Antonio Casilli, Paul-Olivier Dehaye, Jean-Baptiste Soufron", "title": "« StopCovid est un projet désastreux piloté par des apprentis sorciers » - Le Monde", "description": "Il faut renoncer à la mise en place d’un outil de surveillance enregistrant toutes nos interactions humaines et sur lequel pèse l’ombre d’intérêts privés et politiques, à l’instar du scandale Cambridge Analytica, plaide un collectif de spécialistes du numériq…", "url": "https://www.lemonde.fr/idees/article/2020/04/25/stopcovid-est-un-projet-desastreux-pilote-par-des-apprentis-sorciers_6037721_3232.html", "urlToImage": null, "publishedAt": "2020-04-25T02:35:24Z", "content": "A Singapour, le 25 mars, le tracking est en place. EDGAR SU / REUTERS\r\nTribune. Le mardi 28 avril, les parlementaires français seront amenés à voter sur StopCovid, lapplication mobile de traçage des individus imposée par lexécutif. Nous souhaitons que, par le… [+3041 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Coronavirus en France : 389 nouveaux décès en 24 heures, 22 245 morts au total - Le Parisien", "description": "Ce vendredi, selon le dernier bilan du directeur général de la Santé, 4870 malades se trouvent encore en réanimation dans les hôpitaux franç", "url": "http://www.leparisien.fr/societe/coronavirus-en-france-389-nouveaux-deces-en-24-heures-22-245-morts-au-total-24-04-2020-8305446.php", "urlToImage": null, "publishedAt": "2020-04-24T18:41:00Z", "content": "La France déplore ce vendredi 389 décès de plus que la veille liés au coronavirus. Au total, 22 245 personnes sont mortes du Covid-19 depuis le début de l'épidémie, a annoncé le directeur général de la Santé Jérôme Salomon, lors de son point presse quotidien.… [+1265 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Guadeloupe 1ère", "title": "Coronavirus : toujours 149 cas confirmés par test PCR en Guadeloupe, pas de nouveau cas - Guadeloupe la 1ère - Outre-mer la 1ère", "description": "149 c&#39;est toujours le nombre de cas cumul&eacute;s et confirm&eacute;s par test PCR en Guadeloupe. Pas de nouveau cas enregistr&eacute; officiellement. C&#39;est le dernier bilan communiqu&eacute;", "url": "https://la1ere.francetvinfo.fr/guadeloupe/coronavirus-toujours-x-cas-confirmes-par-test-pcr-en-guadeloupe-pas-de-nouveau-cas-826374.html", "urlToImage": null, "publishedAt": "2020-04-24T17:36:33Z", "content": "Pas de nouveau cas recensé dans notre région ces dernières 24h, selon le dernier bilan publié par l'Agence Régionale de Santé. Cela porte toujours à 149, le nombre de cas confirmés par test PCR (en données cumulées) en Guadeloupe. Parmi ces cas confirmés, 14 … [+1476 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Ingrid Vergara", "title": "Dans l’impasse, la pépite de la réalité augmentée Magic Leap change de stratégie - Le Figaro", "description": "Faute de trouver un acheteur au prix qu’elle estime valoir, la société américaine licencie 1000 salariés et se recentre sur le marché professionnel.", "url": "http://www.lefigaro.fr/secteur/high-tech/dans-l-impasse-la-pepite-de-la-realite-augmentee-magic-leap-change-de-strategie-20200424", "urlToImage": null, "publishedAt": "2020-04-24T16:44:00Z", "content": "Magic Leap vire de cap. Fini le rêve déquiper le grand public en lunettes de réalité augmentée et le convertir massivement à cette nouvelle technologie prometteuse: la société américaine, en difficulté, va se recentrer sur le marché professionnel. Cette nouve… [+2994 chars]"}, {"source": {"id": null, "name": "Sciencepost.fr"}, "author": "Brice Louvet, rédacteur sciences", "title": "Covid-19 : que dit la première étude séro-épidémiologique en France ? - SciencePost", "description": "Fin Mars, 661 personnes ont fait l'objet d'une étude épidémiologique et sérologique dans le cadre de la lutte contre le Covid-19", "url": "https://sciencepost.fr/covid-19-que-dit-la-premiere-etude-sero-epidemiologique-en-france/", "urlToImage": null, "publishedAt": "2020-04-24T12:52:57Z", "content": "Fin mars 2020, 661 personnes reliées à un lycée de Crépy-en-Valois (Oise) ont fait l’objet d’une étude épidémiologique et sérologique menée par les chercheurs de lInstitut Pasteur dans le cadre de la lutte contre le Covid-19. Quels enseignements peut-on tirer… [+3683 chars]"}, {"source": {"id": null, "name": "Atlantico.fr"}, "author": null, "title": "Covid-19 : tour du monde des pistes de traitements potentiels - Atlantico.fr", "description": "Alors que de nombreux pays à travers la planète préparent et travaillent activement sur la phase du déconfinement, le Dr Stéphane Gayet revient sur les pistes de traitements contre le Covid-19 et notamment sur les vaccins ou sur la solution du...", "url": "https://www.atlantico.fr/decryptage/3589060/covid-19--tour-du-monde-des-pistes-de-traitements-potentiels-hydroxychloroquine-didier-raoult-vaccin-coronavirus-stephane-gayet", "urlToImage": null, "publishedAt": "2020-04-24T06:37:14Z", "content": "Atlantico.fr : Que savons-nous aujourd'hui des pistes de traitements du CoVid-19 ?\r\nAntiviraux et antibiotiques : deux classes thérapeutiques sans aucun point commun\r\nStéphane Gayet : On parle bien ici de médicaments qui agissent in vivo, c'est-à-dire dans no… [+20179 chars]"}]}