{"status": "ok", "totalResults": 34, "articles": [{"source": {"id": null, "name": "20minutes.fr"}, "author": "Laure Cometti", "title": "Coronavirus : « J’ai peur de les contaminer… » Revoir ses grands-parents après le 11 mai, un dilemme pour nos… - 20 Minutes", "description": "Les retrouvailles familiales seront possibles après la levée du confinement, mais beaucoup craignent de contaminer leurs parents ou grands-parents, alors que les plus âgés sont plus gravement touchés par l’épidémie", "url": "https://www.20minutes.fr/societe/2765479-20200425-coronavirus-peur-contaminer-revoir-grands-parents-apres-11-mai-dilemme-lecteurs", "urlToImage": null, "publishedAt": "2020-04-25T08:23:29Z", "content": "Revoir ses proches âgés, plus vulnérables face au Covid-19, ou bien les laisser confinés, mais déprimés, est un dilemme pour de nombreuses personnes. Marlena Sloss/AP/SIPA\r\n« Cest immensément difficile de faire un choix. Je suis tiraillée entre ce que dicte m… [+7231 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Saint-Étienne : Robert Herbin hospitalisé dans un état préoccupant - Le Figaro", "description": "Personnage indissociable de la grande histoire de Saint-Étienne, Robert Herbin, est depuis mardi dernier hospitalisé dans un CHU de sa ville de cœur. Son état de santé, jugé préoccupant pas son entourage, n’a toutefois pas de lien avec la pandémie actuelle de…", "url": "https://sport24.lefigaro.fr/football/ligue-1/fil-info/saint-Etienne-robert-herbin-hospitalise-dans-un-etat-preoccupant-1000238", "urlToImage": null, "publishedAt": "2020-04-25T07:23:00Z", "content": "Personnage indissociable de la grande histoire de Saint-Étienne, Robert Herbin, est depuis mardi dernier hospitalisé dans un CHU de sa ville de cur. Son état de santé, jugé préoccupant pas son entourage, na toutefois pas de lien avec la pandémie actuelle de n… [+561 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": null, "title": "Pour le gouvernement, un week-end de travail pour préparer le déconfinement - Le Monde", "description": "A moins de trois semaines du début de la levée progressive du confinement, le dernier bilan de l’épidémie due au coronavirus en France fait état de 22 245 morts.", "url": "https://www.lemonde.fr/planete/article/2020/04/25/pour-le-gouvernement-un-week-end-de-travail-pour-preparer-le-deconfinement_6037740_3244.html", "urlToImage": null, "publishedAt": "2020-04-25T07:20:57Z", "content": "Les applaudissements quotidiens au personnel soignant dans un immeuble de Nice, le vendredi 24 avril 2020 à 20 heures, au 39e jour du confinement. VALERY HACHE / AFP\r\nAlors que le gouvernement doit finir de préparer, ce week-end, le déconfinement progressif d… [+4991 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Le Figaro avec AFP", "title": "Le rappeur Kanye West est désormais milliardaire, selon Forbes - Le Figaro", "description": "Le mari de Kim Kardashian a développé avec Adidas une marque de chaussures, les Yeezy.", "url": "http://www.lefigaro.fr/flash-eco/le-rappeur-kanye-west-est-desormais-milliardaire-selon-forbes-20200425", "urlToImage": null, "publishedAt": "2020-04-25T07:17:00Z", "content": "Le célèbre rappeur américain Kanye West vaut maintenant 1,3 milliard de dollars et a rejoint la prestigieuse liste des milliardaires de Forbes, grâce à sa marque de chaussures développée avec Adidas, a annoncé le magazine économique vendredi.\r\nLes baskets du … [+2197 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Les infos de 8h - Les compagnies aériennes sommées de rembourser les voyageurs lésés - RTL.fr", "description": "Les compagnies aériennes proposent des avoirs aux voyageurs dont le billet a été annulé pour cause de coronavirus.", "url": "https://www.rtl.fr/actu/conso/les-infos-de-8h-les-compagnies-aeriennes-sommees-de-rembourser-les-voyageurs-leses-7800440573", "urlToImage": null, "publishedAt": "2020-04-25T06:53:00Z", "content": "Air France est mise en demeure par l'UFC-Que choisir, ainsi que la compagnie allemande Lufthansa ou Emirates et Easyjet... L'association de consommateurs donne 15 jours aux compagnies pour rembourser aux clients les billets annulés en raison de l'épidémie, ce… [+1610 chars]"}, {"source": {"id": null, "name": "Bienpublic.com"}, "author": "Le Bien Public", "title": "Télévision. Sam éliminé de Koh-Lanta : les internautes ulcérés - Bien Public", "description": "Le candidat, plutôt renfermé, mais favori du public, a dû éteindre son flambeau vendredi soir sur TF1, provoquant la colère des internautes.", "url": "https://www.bienpublic.com/societe/2020/04/25/sam-elimine-de-koh-lanta-les-internautes-ulceres", "urlToImage": null, "publishedAt": "2020-04-25T06:51:13Z", "content": "Sam, 19 ans, a été éliminé lors du dernier épisode de \"Koh-Lanta, l'île des héros\", diffusé vendredi soir sur TF1.\r\nDlutôt renfermé, l'ex-jaune a dû éteindre son flambeau avec six voix contre lui, face à Charlotte et Eric, alors qu'il avait pourtant séduit le… [+1480 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "Sébastien Marcelle", "title": "Quelle était cette impressionnante traînée lumineuse blanche dans le ciel de la région vendredi soir ? - LaDepeche.fr", "description": "Une succession de points lumineux formant une longue traînée blanche a interpellé de nombreux habitants de la région, ce vendredi soir aux alentours de 22 heures. Les observateurs attentifs du ciel ont ainsi pu voir le train de satellites Starlink lancés le 2…", "url": "https://www.ladepeche.fr/2020/04/25/limpressionnante-constellation-de-satellites-starlink-visible-dans-le-ciel-de-la-region-vendredi-soir,8862233.php", "urlToImage": null, "publishedAt": "2020-04-25T06:36:36Z", "content": "l'essentiel\r\n Une succession de points lumineux formant une longue traînée blanche a interpellé de nombreux habitants de la région, ce vendredi soir aux alentours de 22 heures. Les observateurs attentifs du ciel ont ainsi pu voir le train de satellites Starli… [+3244 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "\"Les années à venir du sport féminin ne vont pas être sympathiques\" : les sportives redoutent de subir les premières les conséquences du coronavirus - franceinfo", "description": "", "url": "https://www.francetvinfo.fr/sante/maladie/coronavirus/les-annees-a-venir-du-sport-feminin-ne-vont-pas-etre-sympathiques-les-sportives-redoutent-de-subir-les-premiers-les-consequences-du-coronavirus_3932703.html", "urlToImage": null, "publishedAt": "2020-04-25T06:24:41Z", "content": "Avec son lot dannulations de compétitions, de baisse des salaires ou de partenaires qui rompent leurs contrats publicitaires, clubs féminins et sportives craignent dêtre les premiers à payer les pots cassés.\r\nLes conséquences de la crise du coronavirus Covid-… [+2625 chars]"}, {"source": {"id": null, "name": "Www.lci.fr"}, "author": "La rédaction de LCI", "title": "VIDÉO - Soigner le Covid-19 avec une injection de désinfectant ? Trump assure que sa suggestion était sarcastique - LCI", "description": "ETATS UNIS - Au cours de sa conférence de presse de jeudi sur l'épidémie, le président américain a suggéré que les malades reçoivent des injections de désinfectant dans les poumons pour guérir de la maladie. Le lendemain, il a rétropédalé et a assuré qu'il ét…", "url": "https://www.lci.fr/international/video-polemique-coronavirus-soigner-le-covid-19-avec-une-injection-de-desinfectant-trump-assure-c-etait-sarcastique-2151919.html", "urlToImage": null, "publishedAt": "2020-04-25T06:09:13Z", "content": "International\r\nETATS UNIS - Au cours de sa conférence de presse de jeudi sur l'épidémie, le président américain a suggéré que les malades reçoivent des injections de désinfectant dans les poumons pour guérir de la maladie. Le lendemain, il a rétropédalé et a … [+4565 chars]"}, {"source": {"id": null, "name": "Actu.fr"}, "author": "Thibaut Calatayud", "title": "Coronavirus. Toulouse est-elle prête à accueillir une deuxième vague après le confinement ? - actu.fr", "description": "Au CHU de Toulouse, l'activité liée au Covid-19 continue de baisser. Mais l'arrivée probable d'une seconde vague après le confinement pourrait-elle mettre le CHU en délicatesse ?", "url": "https://actu.fr/occitanie/toulouse_31555/coronavirus-toulouse-prete-accueillir-deuxieme-vague-apres-confinement_33235279.html", "urlToImage": null, "publishedAt": "2020-04-25T06:06:02Z", "content": "L’activité du CHU de Toulouse liée au coronavirus continue de baisser. (©Adobe Stock)\r\n« L’activité Covid continue à décroître, lentement, mais de façon certaine », constate Marc Penaud, le directeur général du CHU de Toulouse. Le plateau observé depuis déjà … [+7028 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Michael Balcaen", "title": "La Coupe de France pour commencer ! - Sports.fr", "description": "La Fédération française va devoir proposer un nouveau calendrier à l’UEFA. Et Noël Le Graët souhaite que la saison reprenne avec la finale de la Coupe de France puis celle de la Coupe de la Ligue. Une reprise par deux finales ! C’est le souhait de Noël Le Gra…", "url": "https://www.sports.fr/football/coupe-de-france-commencer-349529.html", "urlToImage": null, "publishedAt": "2020-04-25T06:04:14Z", "content": "La Fédération française va devoir proposer un nouveau calendrier à l’UEFA. Et Noël Le Graët souhaite que la saison reprenne avec la finale de la Coupe de France puis celle de la Coupe de la Ligue.\r\nUne reprise par deux finales ! C’est le souhait de Noël Le Gr… [+1824 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "DIRECT. Coronavirus : le bilan journalier en forte baisse aux Etats-Unis, avec 1 258 morts supplémentaires ... - Franceinfo", "description": "", "url": "https://www.francetvinfo.fr/sante/maladie/coronavirus/direct-coronavirus-le-bilan-journalier-en-forte-baisse-aux-etats-unis-avec-1-258-morts-supplementaires-en-24-heures_3934003.html", "urlToImage": null, "publishedAt": "2020-04-25T05:33:58Z", "content": "Retrouvez ici l'intégralité de notre live #CORONAVIRUS\r\n00h00 : Ce direct est terminé. Voici le point sur l'actualité de la journée :\r\nLe bilan de l'épidémie en France passe à 22 245 morts, avec une augmentation de 389 décès en 24 heures (contre 516 hier).\r\nL… [+14142 chars]"}, {"source": {"id": null, "name": "Sudouest.fr"}, "author": "Sud Ouest", "title": "Le gouvernement dévoilera son plan de déconfinement la semaine prochaine - Sud Ouest", "description": "Ouvertures des commerces, des écoles, port du masque… Les détails du plan de déconfinement seront présentés la semaine prochaine aux Français, sans doute autour de mardi.", "url": "https://www.sudouest.fr/2020/04/25/le-gouvernement-devoilera-son-plan-de-deconfinement-la-semaine-prochaine-7438420-10861.php", "urlToImage": null, "publishedAt": "2020-04-25T05:23:47Z", "content": "Le gouvernement met ce week-end la dernière main à ses premières propositions pour sortir la France du déconfinement, après avoir donné des pistes fluctuantes sur l’école ou les transports, et a déjà sorti son portefeuille pour Air France.\r\nPort du masque ou … [+4195 chars]"}, {"source": {"id": null, "name": "Huffingtonpost.fr"}, "author": "Geoffroy Clavel", "title": "Le maintien du confinement soutenu par moins d'un Français sur deux [SONDAGE EXCLUSIF] - Le HuffPost", "description": "43% des personnes interrogées par YouGov pour \"Le HuffPost\" soutiennent le maintien du confinement, une première depuis le lancement de notre baromètre.", "url": "https://www.huffingtonpost.fr/entry/le-maintien-du-confinement-soutenu-par-moins-dun-francais-sur-deux-sondage-exclusif_fr_5ea3080bc5b6f96398140f82", "urlToImage": null, "publishedAt": "2020-04-25T03:48:45Z", "content": "CORONAVIRUS - Plus le temps passe, moins les Français jugent utile la prolongation du confinement général. Si la date du 11 mai annoncée par Emmanuel Macron en vue du déconfinement est toujours loin de faire l’unanimité, seule une minorité de Français interro… [+1577 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Les infos de 5h - Á Lyon, le trafic routier n'a jamais été aussi dense depuis le début... - RTL.fr", "description": "Depuis l'annonce du déconfinement, fixé le 11 mai prochain, le trafic routier est en nette progression à Lyon.", "url": "https://www.rtl.fr/actu/debats-societe/les-infos-de-5h-lyon-le-trafic-routier-n-a-jamais-ete-aussi-dense-depuis-le-debut-du-confinement-7800440419", "urlToImage": null, "publishedAt": "2020-04-25T03:45:00Z", "content": "Depuis l'annonce du déconfinement, fixé par les autorités françaises le 11 mai prochain, les rues dans certaines villes de France se sont repeuplées et la circulation n'a jamais été aussi dense depuis le début du confinement. Á Lyon, dans le quartier du vieux… [+1745 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": "Bruno Philip, Marie Jégo, Benjamin Barthe, Théa Ollivier", "title": "Du Sénégal à l'Indonésie, au premier jour du ramadan, « il n'y a pas le même engouement ni la même ambiance » - Le Monde", "description": "Les restrictions liées au confinement mises en place dans la plupart des pays où l’islam est majoritaire changent la nature de ce mois sacré habituellement festif.", "url": "https://www.lemonde.fr/international/article/2020/04/25/du-senegal-a-l-indonesie-au-premier-jour-du-ramadan-il-n-y-a-pas-le-meme-engouement-ni-la-meme-ambiance_6037724_3210.html", "urlToImage": null, "publishedAt": "2020-04-25T03:24:41Z", "content": "Des mulsumans dIndonésie se réunissent dans une mosquée de Madiun, dans la province de Java, le 24 avril. ANTARA FOTO / via REUTERS\r\nLe premier jour de jeûne du ramadan sest achevé dans une grande partie du monde musulman, vendredi 24 avril, alors que, de lAf… [+2899 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Floréal Hernandez", "title": "Coronavirus : Les salariés d’Amazon confinés chez eux jusqu’au 28 avril - 20 Minutes", "description": "Amazon a prolongé de deux jours la fermeture de ses sites après une nouvelle décision de justice lui imposant une véritable évaluation des risques liés à l’épidémie de coronavirus", "url": "https://www.20minutes.fr/economie/2767391-20200424-coronavirus-salaries-amazon-confines-chez-jusqu-28-avril", "urlToImage": null, "publishedAt": "2020-04-25T02:07:43Z", "content": "Le centre logistique d'Amazon à Lauwin-Planque, dans le Nord. (Illustration) AFP\r\nAu moins douze jours de fermeture pour les centres de distribution Amazon en France. En effet, \r\n«l'arrêt temporaire» des entrepôts du géant américain de la logistique a été pro… [+466 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "La Belgique rouvre progressivement les commerces et les écoles à la mi-mai - RTL.fr", "description": "La Première ministre Sophie Wilmès a annoncé la réouverture progressive des commerces et des écoles les 11 et 18 mai.", "url": "https://www.rtl.fr/actu/international/la-belgique-rouvre-progressivement-les-commerces-et-les-ecoles-a-la-mi-mai-7800440368", "urlToImage": null, "publishedAt": "2020-04-25T00:46:00Z", "content": "Les commerces et les écoles vont rouvrir progressivement à compter respectivement des 11 et 18 mai en Belgique, a annoncé vendredi soir la Première ministre Sophie Wilmès. Les autorités avaient mis en place des mesures de confinement à la mi-mars pour lutter … [+621 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "Confinement : Facebook propose de \"faire un saut\" chez ses amis via des appels vidéo \"spontanés\" - franceinfo", "description": "", "url": "https://www.francetvinfo.fr/sante/maladie/coronavirus/confinement-facebook-propose-de-faire-un-saut-chez-ses-amis-via-des-appels-video-spontanes_3933725.html", "urlToImage": null, "publishedAt": "2020-04-24T22:21:28Z", "content": "Contrairement aux plateformes originellement prévues pour des réunions professionnelles, comme Zoom ou Teams (Microsoft), Messenger Rooms se veut un espace de socialisation convivial, pour des anniversaires, des apéros, des clubs de lecture, des groupes de pa… [+2197 chars]"}, {"source": {"id": null, "name": "Public.fr"}, "author": "Public", "title": "Mort de Christophe : voici la seule chose qu'il a légué à Romain, le fils qu'il a eu avec Michèle Torr - Public", "description": "Le chanteur Christophe s’est éteint le 16 avril 2020 des suites d’un long combat contre la maladie. Mort à 74 ans, l’artiste souffrait en effet depuis longtemps d’un emphysème, une maladie pulmonaire chronique. Depuis quelques années, le chanteur Christophe é…", "url": "https://www.public.fr/News/Mort-de-Christophe-voici-la-seule-chose-qu-il-a-legue-a-Romain-le-fils-qu-il-a-eu-avec-Michele-Torr-1639768", "urlToImage": null, "publishedAt": "2020-04-24T22:16:41Z", "content": "Le chanteur Christophe sest éteint le 16 avril 2020 des suites dun long combat contre la maladie. Mort à 74 ans, lartiste souffrait en effet depuis longtemps dun emphysème, une maladie pulmonaire chronique. Depuis quelques années, le chanteur Christophe était… [+1741 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Coronavirus : l'Armée confirme avoir acheté de la chloroquine par \"précaution\" - RTL.fr", "description": "Le ministère a indiqué s'être procuré de la chloroquine au cas où son utilité serait \"validée\" pour traiter le covid-19.", "url": "https://www.rtl.fr/actu/politique/coronavirus-l-armee-confirme-avoir-achete-de-la-chloroquine-par-precaution-7800439800", "urlToImage": null, "publishedAt": "2020-04-24T19:53:00Z", "content": "L'Armée en première ligne pour l'accès à la chloroquine. Le ministère de Florence Parly a confirmé vendredi 24 avril s'être procuré des stocks de ce médicament, dont les effets curatifs du Covid-19 sont contestés. Il s'agit d'un \"achat de précaution, si jamai… [+1593 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Restauration : le gouvernement à la rescousse - CNEWS", "description": "La décision sur la date de réouverture des cafés, restaurants et bars sera prise à la fin mai, a indiqué vendredi le ministre de l'Economie Bruno Le Maire à ...", "url": "https://www.youtube.com/watch?v=gSq-ZoIIhAo", "urlToImage": null, "publishedAt": "2020-04-24T19:36:39Z", "content": null}, {"source": {"id": null, "name": "Sudouest.fr"}, "author": "Sud Ouest", "title": "Coronavirus en Nouvelle-Aquitaine : huit morts en 24 heures, les premières projections pour le 11 mai - Sud Ouest", "description": "Dans son bilan quotidien, l'ARS Nouvelle-Aquitaine déplore huit nouveaux décès dans les hôpitaux et a procédé à des ajustements dans les chiffres des Ehpad. Elle a également dévoilé les projections réalisées par l'Institut Pasteur pour le 11 mai", "url": "https://www.sudouest.fr/2020/04/24/coronavirus-en-nouvelle-aquitaine-huit-morts-en-24-heures-les-premieres-projections-pour-le-11-mai-7437287-10861.php", "urlToImage": null, "publishedAt": "2020-04-24T17:51:08Z", "content": "La Nouvelle-Aquitaine reste l’une des régions de France les moins impactées par l’épidémie. Les premières projections réalisées par l’Institut Pasteur montrent que le pourcentage de personnes potentiellement infectées serait au 11 mai, date du début de déconf… [+2667 chars]"}, {"source": {"id": null, "name": "Francebleu.fr"}, "author": "Aurore Jarnoux", "title": "Coronavirus : 389 décès supplémentaires en une journée, plus de 122.500 cas confirmés en France - France Bleu", "description": "Depuis le début de l'épidémie de coronavirus, on dénombre désormais 22.245 morts en France, ce qui représente 389 décès supplémentaires en 24 heures, a annoncé ce vendredi Jérôme Salomon, le directeur général de la Santé. 122.577 personnes ont été testés posi…", "url": "https://www.francebleu.fr/infos/sante-sciences/coronavirus-389-deces-supplementaires-en-une-journee-plus-de-122-500-cas-confirmes-en-france-1587748928", "urlToImage": null, "publishedAt": "2020-04-24T17:42:33Z", "content": "Lors de son point presse quotidien ce vendredi soir, Jérôme Salomon, le directeur général de la Santé, a annoncé que l'épidémie de coronavirus a causé la mort de 22.245 malades depuis le 1er mars dernier, soit 389 décès supplémentaires en une journée. 13.852 … [+3004 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Masques contre le coronavirus : les commerces de tissu peuvent rouvrir - Le Parisien", "description": "Le gouvernement a pris un décret autorisant leur réouverture, dans le but de permettre aux Français de confectionner leurs propres masques.", "url": "http://www.leparisien.fr/economie/masques-contre-le-coronavirus-les-commerces-de-detail-de-textiles-peuvent-rouvrir-24-04-2020-8305407.php", "urlToImage": null, "publishedAt": "2020-04-24T16:21:00Z", "content": "Le début du déconfinement est prévu pour le 11 mai et le gouvernement prépare l'échéance. Les commerces de tissu sont autorisés à rouvrir dès ce vendredi afin de « permettre à chaque Français qui le souhaite de se procurer les matières premières nécessaires »… [+1764 chars]"}, {"source": {"id": null, "name": "Frandroid.com"}, "author": "Manuel Castejon", "title": "Test du Dell XPS 13 (2020) : le nouveau mètre-étalon de la bureautique - Frandroid", "description": "Le Dell XPS 13 se renouvelle en 2020 et corrige les erreurs de la génération précédente. Un sans faute ? La réponse dans notre test complet.", "url": "https://www.frandroid.com/marques/dell/699493_test-dell-xps-13-2020-9300-avis-ordinateur-pc-portable", "urlToImage": null, "publishedAt": "2020-04-24T16:20:19Z", "content": "Introduction\r\nLe Dell XPS 13 se renouvelle en 2020 et corrige les erreurs de la génération précédente. Un sans faute ? La réponse dans notre test complet.\r\nDell XPS 13 (2020)\r\nSur le marché des ordinateurs portables haut de gamme, le XPS 13 est depuis plusieu… [+14301 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/marc.alvarez1", "title": "Maguire : “La Champions League 19/20 reprendra sous une forme ou une autre” - Canal Supporters", "description": "Les enjeux sont trop importants pour que l'UEFA tire un trait sur la Ligue des champions 2019/2020. Tout sera fait, qu'importe le calendrier,", "url": "https://canal-supporters.com/2020/04/maguire-la-champions-league-19-20-reprendra-sous-une-forme-ou-une-autre/", "urlToImage": null, "publishedAt": "2020-04-24T14:54:14Z", "content": "Les enjeux sont trop importants pour que l’UEFA tire un trait sur la Ligue des champions 2019/2020. Tout sera fait, qu’importe le calendrier, pour que la compétition continentale suspendue depuis la mi-mars aille à son terme. Le spécialiste de l’économie du f… [+1420 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Romain Delacroix", "title": "Le «coup de gueule» de Jean-Pierre Pernaut durant le «13 heures» de TF1 - Le Figaro", "description": "Le présentateur a ironisé à sa manière sur certaines mesures prises depuis le début de l’épidémie de coronavirus.", "url": "https://tvmag.lefigaro.fr/programme-tv/le-coup-de-gueule-de-jean-pierre-pernaut-durant-le-13-heures-de-tf1_2bf4d706-8626-11ea-b0b7-ac58f2163138/", "urlToImage": null, "publishedAt": "2020-04-24T13:18:16Z", "content": "Le présentateur a ironisé à sa manière sur certaines mesures prises depuis le début de lépidémie de coronavirus.Jean-Pierre Pernaut était en forme ce vendredi. Alors quil intervient chaque jour, depuis son domicile, à la fin du JT de «13 heures» de TF1, le jo… [+2087 chars]"}, {"source": {"id": null, "name": "Telerama.fr"}, "author": "Mathilde Blottière", "title": "Truffaut, Resnais, Lynch, Dolan : pourquoi Netflix est devenu cinéphile - Télérama.fr", "description": "En partenariat avec MK2, Netflix France met à disposition de ses 7 millions d’abonnés des grands classiques, dont douze films de François Truffaut dès ce 24 avril 2020. Une prise de prestige… ou un changement stratégique de la plateforme jusqu’ici peu portée …", "url": "https://www.telerama.fr/television/truffaut,-resnais,-lynch,-dolan-pourquoi-netflix-est-devenu-cinephile,n6631120.php", "urlToImage": null, "publishedAt": "2020-04-24T13:00:00Z", "content": "En partenariat avec MK2, Netflix France met à disposition de ses 7 millions dabonnés des grands classiques, dont douze films de François Truffaut dès ce 24 avril 2020. Une prise de prestige ou un changement stratégique de la plateforme jusquici peu portée sur… [+8429 chars]"}, {"source": {"id": null, "name": "Sciencepost.fr"}, "author": "Brice Louvet, rédacteur sciences", "title": "Covid-19 : que dit la première étude séro-épidémiologique en France ? - SciencePost", "description": "Fin Mars, 661 personnes ont fait l'objet d'une étude épidémiologique et sérologique dans le cadre de la lutte contre le Covid-19", "url": "https://sciencepost.fr/covid-19-que-dit-la-premiere-etude-sero-epidemiologique-en-france/", "urlToImage": null, "publishedAt": "2020-04-24T12:52:57Z", "content": "Fin mars 2020, 661 personnes reliées à un lycée de Crépy-en-Valois (Oise) ont fait l’objet d’une étude épidémiologique et sérologique menée par les chercheurs de lInstitut Pasteur dans le cadre de la lutte contre le Covid-19. Quels enseignements peut-on tirer… [+3683 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "BFMTV", "title": "Face aux restaurateurs, Macron dépeint un coronavirus qui « n'aime pas l'art de vivre à la française » - BFMTV", "description": "Les secteurs de l'hôtellerie et de la restauration sont sévèrement touchés par les mesures de restriction liées à la pandémie de coronavirus. Le gouvernement leur a promis un plan d'aide spécifique pour survivre face à ce virus qui « n'aime pas l'art de vivre…", "url": "https://www.bfmtv.com/politique/face-aux-restaurateurs-macron-depeint-un-coronavirus-qui-n-aime-pas-l-art-de-vivre-a-la-francaise-1899973.html", "urlToImage": null, "publishedAt": "2020-04-24T11:34:09Z", "content": null}, {"source": {"id": null, "name": "Phonandroid.com"}, "author": "Bruno Mathieu", "title": "iPhone et iPad : le drapeau italien fait planter les appareils d’Apple ! - Phonandroid", "description": "iPhone et iPad d'Apple sont victimes d'un bug improbable : ils plantent à cause du drapeau italien et d'un caractère sindhi.", "url": "https://www.phonandroid.com/iphone-ipad-le-drapeau-italien-fait-planter-les-appareils-apple.html", "urlToImage": null, "publishedAt": "2020-04-24T11:30:48Z", "content": "iPhone et iPad d’Apple font actuellement les frais d’un bug étrange, voire improbable : quand un utilisateur reçoit une notification dans laquelle sont affichés le drapeau italien et un caractère sindhi, les appareils plantent littéralement. Mais comment les … [+2146 chars]"}, {"source": {"id": "liberation", "name": "Libération"}, "author": "Robin Andraca", "title": "Covid-19 : pourquoi le directeur de l'OMS a-t-il dit que le «pire restait à venir» ? - Libération", "description": "Durant un point presse tenu le 20 avril, le directeur général de l'Organisation Mondiale de la Santé, Tedros Adhanom Ghebreyesus, a insisté sur le fait que «sans cohésion mondiale, le pire était encore à venir».", "url": "https://www.liberation.fr/checknews/2020/04/24/covid-19-pourquoi-le-directeur-de-l-oms-a-t-il-dit-que-le-pire-restait-a-venir_1786287", "urlToImage": null, "publishedAt": "2020-04-24T10:48:15Z", "content": "Question posée le 21/04/2020\r\nBonjour,\r\nVous faites référence au point presse tenu le 20 avril par le directeur général de lOrganisation Mondiale de la Santé (OMS), Tedros Adhanom Ghebreyesus. Une phrase prononcée pendant ce briefing a suscité lintérêt de nom… [+1808 chars]"}, {"source": {"id": null, "name": "Pourquoidocteur.fr"}, "author": null, "title": "Obésité : on en sait plus sur le lien entre manque de sommeil et prise de poids - Pourquoi Docteur ?", "description": "D'après une nouvelle étude, l'excès de poids pourrait favoriser un mauvais sommeil et non pas le contraire, contrairement à ce qui a souvent été avancé. .", "url": "https://www.pourquoidocteur.fr/Articles/Question-d-actu/32263-Obesite-sait-lien-manque-sommeil-prise-de-poids", "urlToImage": null, "publishedAt": "2020-04-24T09:15:00Z", "content": "<ul><li> Le lien entre mauvais sommeil et prise de poids a déjà été établi</li><li> Une nouvelle étude suggère que c'est le surpoids qui entraînerait un mauvais sommeil et non l'inverse</li></ul>\r\nIl a été prouvé à maintes reprises qu’un mauvais sommeil favor… [+4957 chars]"}]}