{"status": "ok", "totalResults": 34, "articles": [{"source": {"id": null, "name": "Ladepeche.fr"}, "author": "Sébastien Marcelle", "title": "Quelle était cette impressionnante traînée lumineuse blanche dans le ciel de la région vendredi soir ? - LaDepeche.fr", "description": "Une succession de points lumineux formant une longue traînée blanche a interpellé de nombreux habitants de la région, ce vendredi soir aux alentours de 22 heures. Les observateurs attentifs du ciel ont ainsi pu voir le train de satellites Starlink lancés le 2…", "url": "https://www.ladepeche.fr/2020/04/25/limpressionnante-constellation-de-satellites-starlink-visible-dans-le-ciel-de-la-region-vendredi-soir,8862233.php", "urlToImage": null, "publishedAt": "2020-04-25T06:36:36Z", "content": "l'essentiel\r\n Une succession de points lumineux formant une longue traînée blanche a interpellé de nombreux habitants de la région, ce vendredi soir aux alentours de 22 heures. Les observateurs attentifs du ciel ont ainsi pu voir le train de satellites Starli… [+3244 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "20 Minutes avec AFP", "title": "Coronavirus: Le Canada juge non conformes un million de masques achetés en Chine - 20 Minutes", "description": "Le ministère de la Santé va cependant évaluer si ces protections peuvent être utilisées dans d’autres milieux que celui de la santé", "url": "https://www.20minutes.fr/monde/2767611-20200425-coronavirus-canada-juge-non-conformes-million-masques-achetes-chine", "urlToImage": null, "publishedAt": "2020-04-25T06:14:49Z", "content": "Un masque de protection jeté sur le sol (illustration). Rodrigo Abd/AP/SIPA\r\nAlors quil est particulièrement difficile pour de nombreux pays de se procurer des protections contre le coronavirus, cest une vraie désillusion que vient de connaître le Canada. Le … [+1188 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Coronavirus : après les propos de Trump, un fabriquant de désinfectant fait une mise en garde sanitaire - Le Parisien", "description": "Le président américain a semblé envisager de traiter au désinfectant le virus, suscitant une polémique mondiale au moment où les Etats-Unis", "url": "http://www.leparisien.fr/international/coronavirus-apres-les-propos-de-trump-un-fabriquant-de-desinfectant-fait-une-mise-en-garde-sanitaire-25-04-2020-8305590.php", "urlToImage": null, "publishedAt": "2020-04-25T05:45:00Z", "content": "Les propos confus de Donald Trump sur de possibles injections de désinfectant pour lutter contre Covid-19 ont suscité la stupéfaction. Après une journée de réactions indignées, le locataire de Maison Blanche a participé vendredi à un bref point de presse mais… [+3663 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "DIRECT. Coronavirus : le bilan journalier en forte baisse aux Etats-Unis, avec 1 258 morts supplémentaires ... - Franceinfo", "description": "", "url": "https://www.francetvinfo.fr/sante/maladie/coronavirus/direct-coronavirus-le-bilan-journalier-en-forte-baisse-aux-etats-unis-avec-1-258-morts-supplementaires-en-24-heures_3934003.html", "urlToImage": null, "publishedAt": "2020-04-25T05:33:58Z", "content": "Retrouvez ici l'intégralité de notre live #CORONAVIRUS\r\n00h00 : Ce direct est terminé. Voici le point sur l'actualité de la journée :\r\nLe bilan de l'épidémie en France passe à 22 245 morts, avec une augmentation de 389 décès en 24 heures (contre 516 hier).\r\nL… [+14142 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "Coronavirus : des mesures d'urgence aux plans de relance, comment affronter la \"pire crise économique depui... - franceinfo", "description": "", "url": "https://www.francetvinfo.fr/sante/maladie/coronavirus/coronavirus-des-mesures-d-urgence-aux-plans-de-relance-comment-affronter-la-pire-crise-economique-depuis-1929_3932413.html", "urlToImage": null, "publishedAt": "2020-04-25T05:27:53Z", "content": "Face à la crise actuelle, les gouvernements ont promis des milliards et des milliards pour éviter un effondrement de l'économie. Mais la reprise s'annonce longue.\r\nComment l'économie parviendra-t-elle à se relever après un tel choc ? Depuis le début de l'épid… [+14301 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Les infos de 5h - Á Lyon, le trafic routier n'a jamais été aussi dense depuis le début... - RTL.fr", "description": "Depuis l'annonce du déconfinement, fixé le 11 mai prochain, le trafic routier est en nette progression à Lyon.", "url": "https://www.rtl.fr/actu/debats-societe/les-infos-de-5h-lyon-le-trafic-routier-n-a-jamais-ete-aussi-dense-depuis-le-debut-du-confinement-7800440419", "urlToImage": null, "publishedAt": "2020-04-25T03:45:00Z", "content": "Depuis l'annonce du déconfinement, fixé par les autorités françaises le 11 mai prochain, les rues dans certaines villes de France se sont repeuplées et la circulation n'a jamais été aussi dense depuis le début du confinement. Á Lyon, dans le quartier du vieux… [+1745 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": "Bruno Meyerfeld", "title": "Au Brésil, la démission de Sergio Moro ébranle le pouvoir - Le Monde", "description": "Les accusations portées, vendredi, contre Jair Bolsonaro par l’ambitieux et désormais ancien ministre de la justice pourraient potentiellement justifier l’ouverture d’une procédure de destitution contre le président.", "url": "https://www.lemonde.fr/international/article/2020/04/25/au-bresil-la-demission-de-sergio-moro-ebranle-le-pouvoir_6037726_3210.html", "urlToImage": null, "publishedAt": "2020-04-25T03:40:01Z", "content": "Lancien ministre brésilien de la justice Sergio Moro à Brasilia le 24 avril. UESLEI MARCELINO / REUTERS\r\nUne pandémie mondiale, doublée dun crash économique : tout cela nétait pas suffisant pour Jair Bolsonaro. Depuis ce vendredi 24 avril, avec la démission b… [+2727 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": "Bruno Philip, Marie Jégo, Benjamin Barthe, Théa Ollivier", "title": "Du Sénégal à l'Indonésie, au premier jour du ramadan, « il n'y a pas le même engouement ni la même ambiance » - Le Monde", "description": "Les restrictions liées au confinement mises en place dans la plupart des pays où l’islam est majoritaire changent la nature de ce mois sacré habituellement festif.", "url": "https://www.lemonde.fr/international/article/2020/04/25/du-senegal-a-l-indonesie-au-premier-jour-du-ramadan-il-n-y-a-pas-le-meme-engouement-ni-la-meme-ambiance_6037724_3210.html", "urlToImage": null, "publishedAt": "2020-04-25T03:24:41Z", "content": "Des mulsumans dIndonésie se réunissent dans une mosquée de Madiun, dans la province de Java, le 24 avril. ANTARA FOTO / via REUTERS\r\nLe premier jour de jeûne du ramadan sest achevé dans une grande partie du monde musulman, vendredi 24 avril, alors que, de lAf… [+2899 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": "Alexandre Piquard", "title": "Coronavirus : en France, Amazon poursuit son bras de fer avec les syndicats et la justice - Le Monde", "description": "La cour d’appel de Versailles a confirmé, en la nuançant, la décision qui avait ordonné à Amazon de mieux protéger ses salariés du coronavirus et de restreindre ses activités aux produits jugés essentiels.", "url": "https://www.lemonde.fr/economie/article/2020/04/25/coronavirus-en-france-amazon-poursuit-son-bras-de-fer-avec-les-syndicats-et-la-justice_6037723_3234.html", "urlToImage": null, "publishedAt": "2020-04-25T03:15:55Z", "content": "Le site dAmazon à Lauwin-Planque dans le Nord. DENIS CHARLET / AFP\r\nCest un moment symbolique dans le conflit entre la multinationale Amazon et les syndicats français, devenu affaire nationale et suivi de près au siège américain de Seattle (Etat de Washington… [+3133 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Coronavirus: 1.258 victimes en 24h aux États-Unis, un bilan en forte baisse - RTL.fr", "description": "Dans les dernières 24 heures, les États-Unis ont recensé 1.258 décès supplémentaires liés à l'épidémie de coronavirus.", "url": "https://www.rtl.fr/actu/bien-etre/coronavirus-1-258-victimes-en-24h-aux-etats-unis-un-bilan-en-forte-baisse-7800440392", "urlToImage": null, "publishedAt": "2020-04-25T02:45:00Z", "content": "Dans les dernières 24 heures, les autorités américaines ont enregistré 1.258 décès supplémentaires, soit le bilan le plus bas en près de trois semaines, selon le comptage de l'université Johns Hopkins qui fait référence. Au total, l'épidémie de coronavirus a … [+1083 chars]"}, {"source": {"id": null, "name": "Huffingtonpost.fr"}, "author": "Maxime Bourdeau", "title": "Les larmes de Sam, éliminé de \"Koh-Lanta\", ont ému les spectateurs - Le HuffPost", "description": "Un coup dur pour l'aventurier qui avait raconté s’être longtemps entraîné pour exceller au cours du jeu et que sa participation relevait du rêve d’une vie.", "url": "https://www.huffingtonpost.fr/entry/les-larmes-sam-elimine-de-koh-lanta-ont-emu-les-spectateurs_fr_5ea3706ac5b6f963981500b8", "urlToImage": null, "publishedAt": "2020-04-25T00:08:45Z", "content": "TÉLÉVISION - “Koh-Lanta” a perdu ce vendredi 24 avril l’un de ses aventuriers très appréciés des téléspectateurs: les candidats en lice dans cette saison 21 ont décidé d’éliminer Sam et de lui faire quitter l’île.\r\nUne sentence que l’Alsacien de 20 ans a pris… [+1150 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Anne Rovan", "title": "La Belgique se lance prudemment dans le déconfinement - Le Figaro", "description": "L’ensemble des commerces rouvrira le 11 mai et les écoles à partir du 18 mai, selon des modalités qui restent à préciser. Mais la vie sociale restera très encadrée.", "url": "http://www.lefigaro.fr/international/la-belgique-se-lance-prudemment-dans-le-deconfinement-20200425", "urlToImage": null, "publishedAt": "2020-04-24T23:59:00Z", "content": "Le gouvernement fédéral belge a dévoilé vendredi soir le plan de déconfinement du Royaume au terme dune interminable réunion du conseil national de sécurité. Dans ce pays de 11 millions dhabitants, où le coronavirus a tué près de 6.700 personnes, le retour à … [+4042 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "Confinement : Facebook propose de \"faire un saut\" chez ses amis via des appels vidéo \"spontanés\" - franceinfo", "description": "", "url": "https://www.francetvinfo.fr/sante/maladie/coronavirus/confinement-facebook-propose-de-faire-un-saut-chez-ses-amis-via-des-appels-video-spontanes_3933725.html", "urlToImage": null, "publishedAt": "2020-04-24T22:21:28Z", "content": "Contrairement aux plateformes originellement prévues pour des réunions professionnelles, comme Zoom ou Teams (Microsoft), Messenger Rooms se veut un espace de socialisation convivial, pour des anniversaires, des apéros, des clubs de lecture, des groupes de pa… [+2197 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "Saint-Étienne: Robert Herbin hospitalisé dans un état grave - RMC Sport", "description": "Robert Herbin, 81 ans, ancien joueur et entraîneur historique de l'AS Saint-Étienne, est hospitalisé depuis plusieurs jours. Son état de santé est jugé grave.", "url": "https://rmcsport.bfmtv.com/football/saint-etienne-robert-herbin-hospitalise-dans-un-etat-grave-1900428.html", "urlToImage": null, "publishedAt": "2020-04-24T21:39:35Z", "content": null}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Des tests de la chloroquine contre le Covid-19 interrompus pour des raisons de sécurité après plusieurs décès - Sputnik France", "description": "Une équipe de chercheurs qui testait de la chloroquine en tant que traitement du Covid-19 a dû écourter ses travaux après qu’un quart des patients ayant pris cet...", "url": "https://fr.sputniknews.com/sci_tech/202004241043649413-des-tests-de-la-chloroquine-contre-le-covid-19-interrompus-pour-des-raisons-de-securite-apres/", "urlToImage": null, "publishedAt": "2020-04-24T21:15:58Z", "content": "Une équipe de chercheurs qui testait de la chloroquine en tant que traitement du Covid-19 a dû écourter ses travaux après quun quart des patients ayant pris cet antipaludéen sont décédés, selon les résultats de létude publiés dans le Journal de l'American Med… [+3394 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Yannick Sagorin", "title": "Aulas, le nouveau taquet à l’OM - Sports.fr", "description": "Le président de l’OL Jean-Michel Aulas ne manque jamais une occasion de tacler son rival marseillais. Ce vendredi encore sur la chaîne de son club. « Gouverner, c’est prévoir », consent ce vendredi soir Jean-Michel Aulas au détour d’un entretien diffusé sur l…", "url": "https://www.sports.fr/football/aulas-nouveau-taquet-a-lom-349466.html", "urlToImage": null, "publishedAt": "2020-04-24T21:13:47Z", "content": "Le président de lOL Jean-Michel Aulas ne manque jamais une occasion de tacler son rival marseillais. Ce vendredi encore sur la chaîne de son club.\r\n« Gouverner, cest prévoir », consent ce vendredi soir Jean-Michel Aulas au détour dun entretien diffusé sur la … [+1967 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "Coronavirus : Air France va recevoir sept milliards d'euros de prêts, mais sa nationalisation n'est pas à l... - franceinfo", "description": "", "url": "https://www.francetvinfo.fr/sante/maladie/coronavirus/la-compagnie-air-france-va-recevoir-sept-milliards-d-euros-de-prets-mais-sa-nationalisation-n-est-pas-a-l-ordre-du-jour_3933073.html", "urlToImage": null, "publishedAt": "2020-04-24T20:34:28Z", "content": "Alors que la quasi-totalité de ses avions sont cloués au sol du fait des mesures de confinement décidées pour lutter contre l'épidémie de Covid-19, Air France fait face à une situation critique.\r\nUn gros coup de pouce. La compagnie aérienne Air France va rece… [+2158 chars]"}, {"source": {"id": null, "name": "Lephoceen.fr"}, "author": "Le Phocéen", "title": "La LFP fixe une possible date de reprise des entraînements - Le Phoceen", "description": "La LFP espère que les entraînements reprendront au mois de mai.", "url": "https://www.lephoceen.fr/infos-om/autour-de-l-om/la-lfp-fixe-une-possible-date-de-reprise-des-entrainements-178256", "urlToImage": null, "publishedAt": "2020-04-24T20:08:09Z", "content": "Réuni ce vendredi, le bureau du conseil d'administration de la LFP a poursuivi ses travaux sur la possible reprise du championnat à la mi-juin, sous réserve de connaître les modalités de déconfinement. En ce sens, la date d'une reprise des entraînements a été… [+714 chars]"}, {"source": {"id": null, "name": "Lindependant.fr"}, "author": "Nicolas Monnet", "title": "\"On a du mal à comprendre tout ça !\" : le coup de gueule de Jean-Pierre Pernaut contre le gouvernement en plei - L'Indépendant", "description": "Le présentateur vedette de TF1 s'est emporté contre le gouvernement ce vendredi 24 avril pendant le JT de 13 heures.", "url": "https://www.lindependant.fr/2020/04/24/on-a-du-mal-a-comprendre-tout-ca-le-coup-de-gueule-de-jean-pierre-pernaut-contre-le-gouvernement-en-plein-jt,8861532.php", "urlToImage": null, "publishedAt": "2020-04-24T18:20:00Z", "content": "Le présentateur vedette de TF1 s'est emporté contre le gouvernement ce vendredi 24 avril pendant le JT de 13 heures.Jean-Pierre Pernaut en a gros. Et il le dit. Le présentateur historique du JT de 13 heures de TF1 qui a décidé de ne plus venir sur son plateau… [+1385 chars]"}, {"source": {"id": null, "name": "Journaldugeek.com"}, "author": "Felix Gouty", "title": "Le télescope spatial Hubble a observé une collision entre deux objets célestes - Journal du geek", "description": "Pour comprendre la raison de la disparition d'une exoplanète, des astronomes en sont venus à la conclusion que cette dernière n'avait en fait jamais existé.", "url": "https://www.journaldugeek.com/2020/04/24/telescope-hubble-collision-planetes/", "urlToImage": null, "publishedAt": "2020-04-24T17:58:04Z", "content": "Menant l’enquête pour comprendre la raison de la disparition d’une exoplanète, des astronomes en sont venus à la conclusion que cette dernière n’avait en réalité jamais existé. Le télescope Hubble aurait en fait observé une collision de deux objets puis le nu… [+2628 chars]"}, {"source": {"id": null, "name": "Actu.fr"}, "author": "Simon Louvet", "title": "VIDÉO. \"T'as voulu voir le salon\", la géniale parodie de Jacques Brel en temps de confinement - actu.fr", "description": "La reprise hilarante de la chanson \"Vesoul\" de Jacques Brel par le groupe Les Goguettes fait le tour des réseaux sociaux depuis mardi 21 avril 2020, affolant les compteurs.", "url": "https://actu.fr/ile-de-france/paris_75056/video-tas-voulu-voir-salon-geniale-parodie-jacques-brel-temps-confinement_33240047.html", "urlToImage": null, "publishedAt": "2020-04-24T17:57:35Z", "content": "Les Goguettes, groupe auquel appartient Valentin Vander, ont publié une parodie de la chanson Vesoul de Jacques Brel, détournée sur le confinement. (©Capture d’écran YouTube)\r\nValentin Vander rassure : il va bien, malgré le confinement, et aucun chat n’a été … [+3457 chars]"}, {"source": {"id": null, "name": "Francebleu.fr"}, "author": "Aurore Jarnoux", "title": "Coronavirus : 389 décès supplémentaires en une journée, plus de 122.500 cas confirmés en France - France Bleu", "description": "Depuis le début de l'épidémie de coronavirus, on dénombre désormais 22.245 morts en France, ce qui représente 389 décès supplémentaires en 24 heures, a annoncé ce vendredi Jérôme Salomon, le directeur général de la Santé. 122.577 personnes ont été testés posi…", "url": "https://www.francebleu.fr/infos/sante-sciences/coronavirus-389-deces-supplementaires-en-une-journee-plus-de-122-500-cas-confirmes-en-france-1587748928", "urlToImage": null, "publishedAt": "2020-04-24T17:42:33Z", "content": "Lors de son point presse quotidien ce vendredi soir, Jérôme Salomon, le directeur général de la Santé, a annoncé que l'épidémie de coronavirus a causé la mort de 22.245 malades depuis le 1er mars dernier, soit 389 décès supplémentaires en une journée. 13.852 … [+3004 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "François-Xavier Bourmaud, Marcelo Wesfreid", "title": "Macron-Philippe: la crise sanitaire tend les relations au sein du couple exécutif - Le Figaro", "description": "RÉCIT - Entre le président et le chef du gouvernement, la gestion de crise du coronavirus a laissé apparaître les premières failles.", "url": "http://www.lefigaro.fr/politique/macron-philippe-la-crise-sanitaire-tend-les-relations-au-sein-du-couple-executif-20200424", "urlToImage": null, "publishedAt": "2020-04-24T17:37:00Z", "content": "Le grammage a augmenté. Sur fond de préparation du déconfinement, la feuille de papier à cigarette censée séparer les positions de lÉlysée et de Matignon a pris de lépaisseur. Entre le président de la République et son premier ministre, la tension affleure. E… [+1015 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Nicolas Stival", "title": "Coronavirus à Toulouse : En attendant une possible deuxième vague, les cas diminuent toujours au CHU - 20 Minutes", "description": "71 malades du coronavirus étaient hospitalisés ce vendredi au CHU de Purpan, contre 113 une semaine plus tôt", "url": "https://www.20minutes.fr/toulouse/2767363-20200424-coronavirus-toulouse-attendant-possible-deuxieme-vague-cas-diminuent-toujours-chu", "urlToImage": null, "publishedAt": "2020-04-24T17:18:36Z", "content": "L'unité des soins intensifs de l'hôpital Purpan, à Toulouse, le 21 avril 2020. Frédéric Scheiber / 20 Minutes\r\nLes chiffres sont éloquents : selon le CHU de Toulouse, 71 malades du coronavirus sont hospitalisés ce vendredi (dont 20 en réanimation et deux en s… [+2241 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Le Figaro avec AFP", "title": "Une demande d'interdiction d'Uber en France rejetée en référé - Le Figaro", "description": null, "url": "http://www.lefigaro.fr/flash-eco/une-demande-d-interdiction-d-uber-en-france-rejetee-en-refere-20200424", "urlToImage": null, "publishedAt": "2020-04-24T16:44:00Z", "content": "Le tribunal de commerce de Paris a rejeté la demande en référé d'une fédération de taxis pour faire interdire Uber en France, dans une ordonnance consultée vendredi par l'AFP. La Fédération française des taxis de province (FFTP), qui représente 528 adhérents … [+2010 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Voici à quoi pourraient ressembler les restaurants à leur réouverture - Edition du soir Ouest France - 24/04/2020 - Ouest-France", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMijwFodHRwczovL3d3dy5vdWVzdC1mcmFuY2UuZnIvZWNvbm9taWUvZW50cmVwcmlzZXMvY3Jpc2UtZHUtY29yb25hdmlydXMvdm9pY2ktcXVvaS1wb3VycmFpZW50LXJlc3NlbWJsZXItbGVzLXJlc3RhdXJhbnRzLWxldXItcmVvdXZlcnR1cmUtNjgxNzE2N9IBAA?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T16:41:15Z", "content": null}, {"source": {"id": null, "name": "Observalgerie.com"}, "author": null, "title": "Air Algérie et Air France menacées de poursuites pour non-remboursement de billets - Observ'Algérie - Algérie Actualité ", "description": "L'UFC-Que choisir a donné un ultimatum de 15 jours pour 57 compagnies aériennes dont Air Algérie et Air France afin de rembourser leurs", "url": "https://www.observalgerie.com/air-algerie-et-air-france-menacees-de-poursuites-pour-non-remboursement-de-billets/2020/", "urlToImage": null, "publishedAt": "2020-04-24T14:55:14Z", "content": "LAssociation internationale du transport aérien L’UFC-Que choisir a donné un ultimatum de 15 jours pour 57 compagnies aériennes, dont Air Algérie et Air France, afin de rembourser leurs passagers qui nont pas pu prendre lavion en raison de la fermetures des f… [+4521 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/marc.alvarez1", "title": "Maguire : “La Champions League 19/20 reprendra sous une forme ou une autre” - Canal Supporters", "description": "Les enjeux sont trop importants pour que l'UEFA tire un trait sur la Ligue des champions 2019/2020. Tout sera fait, qu'importe le calendrier,", "url": "https://canal-supporters.com/2020/04/maguire-la-champions-league-19-20-reprendra-sous-une-forme-ou-une-autre/", "urlToImage": null, "publishedAt": "2020-04-24T14:54:14Z", "content": "Les enjeux sont trop importants pour que l’UEFA tire un trait sur la Ligue des champions 2019/2020. Tout sera fait, qu’importe le calendrier, pour que la compétition continentale suspendue depuis la mi-mars aille à son terme. Le spécialiste de l’économie du f… [+1420 chars]"}, {"source": {"id": null, "name": "Jeuxvideo.com"}, "author": "theholomovement", "title": "Animal Crossing New Horizons : mouche, fourmi, comment les ajouter à votre bébêtopédie ? - jeuxvideo.com", "description": "Votre aventure dans Animal Crossing : New Horizons sur Nintendo Switch a déjà bien commencé et vous cherchez certainement à remplir votre bébêtopédie en quête, notamment, des outils en or. Pourtant la mouche et la fourmi manquent encore à l'appel ? Ce guide d…", "url": "http://www.jeuxvideo.com/news/1216328/animal-crossing-new-horizons-mouche-fourmi-comment-les-ajouter-a-votre-bebetopedie.htm", "urlToImage": null, "publishedAt": "2020-04-24T14:01:25Z", "content": "Votre aventure dans Animal Crossing : New Horizons sur Nintendo Switch a déjà bien commencé et vous cherchez certainement à remplir votre bébêtopédie en quête, notamment, des outils en or. Pourtant la mouche et la fourmi manquent encore à l'appel ? Ce guide d… [+1477 chars]"}, {"source": {"id": null, "name": "Telerama.fr"}, "author": "Mathilde Blottière", "title": "Truffaut, Resnais, Lynch, Dolan : pourquoi Netflix est devenu cinéphile - Télérama.fr", "description": "En partenariat avec MK2, Netflix France met à disposition de ses 7 millions d’abonnés des grands classiques, dont douze films de François Truffaut dès ce 24 avril 2020. Une prise de prestige… ou un changement stratégique de la plateforme jusqu’ici peu portée …", "url": "https://www.telerama.fr/television/truffaut,-resnais,-lynch,-dolan-pourquoi-netflix-est-devenu-cinephile,n6631120.php", "urlToImage": null, "publishedAt": "2020-04-24T13:00:00Z", "content": "En partenariat avec MK2, Netflix France met à disposition de ses 7 millions dabonnés des grands classiques, dont douze films de François Truffaut dès ce 24 avril 2020. Une prise de prestige ou un changement stratégique de la plateforme jusquici peu portée sur… [+8429 chars]"}, {"source": {"id": null, "name": "Sciencepost.fr"}, "author": "Brice Louvet, rédacteur sciences", "title": "Covid-19 : que dit la première étude séro-épidémiologique en France ? - SciencePost", "description": "Fin Mars, 661 personnes ont fait l'objet d'une étude épidémiologique et sérologique dans le cadre de la lutte contre le Covid-19", "url": "https://sciencepost.fr/covid-19-que-dit-la-premiere-etude-sero-epidemiologique-en-france/", "urlToImage": null, "publishedAt": "2020-04-24T12:52:57Z", "content": "Fin mars 2020, 661 personnes reliées à un lycée de Crépy-en-Valois (Oise) ont fait l’objet d’une étude épidémiologique et sérologique menée par les chercheurs de lInstitut Pasteur dans le cadre de la lutte contre le Covid-19. Quels enseignements peut-on tirer… [+3683 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "BFMTV", "title": "Jean-Baptiste Djebbari: « 70% de transports en Ile-de-France et 50% de TGV le 11 mai » - BFMTV.COM", "description": "Le secrétaire d'Etat chargé des transports a détaillé sur BFMTV la montée en puissance du plan de transport pour la semaine du déconfinement le 11 mai.", "url": "https://www.bfmtv.com/economie/jean-baptiste-djebbari-70percent-de-transports-en-ile-de-france-et-50percent-de-tgv-le-11-mai-1899796.html", "urlToImage": null, "publishedAt": "2020-04-24T07:28:00Z", "content": null}, {"source": {"id": null, "name": "Atlantico.fr"}, "author": null, "title": "Covid-19 : tour du monde des pistes de traitements potentiels - Atlantico.fr", "description": "Alors que de nombreux pays à travers la planète préparent et travaillent activement sur la phase du déconfinement, le Dr Stéphane Gayet revient sur les pistes de traitements contre le Covid-19 et notamment sur les vaccins ou sur la solution du...", "url": "https://www.atlantico.fr/decryptage/3589060/covid-19--tour-du-monde-des-pistes-de-traitements-potentiels-hydroxychloroquine-didier-raoult-vaccin-coronavirus-stephane-gayet", "urlToImage": null, "publishedAt": "2020-04-24T06:37:14Z", "content": "Atlantico.fr : Que savons-nous aujourd'hui des pistes de traitements du CoVid-19 ?\r\nAntiviraux et antibiotiques : deux classes thérapeutiques sans aucun point commun\r\nStéphane Gayet : On parle bien ici de médicaments qui agissent in vivo, c'est-à-dire dans no… [+20179 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Le Figaro avec AFP", "title": "Echec d'un essai clinique de l'antiviral remdesivir contre le Covid-19 - Le Figaro", "description": null, "url": "http://www.lefigaro.fr/flash-eco/echec-d-un-essai-clinique-de-l-antiviral-remdesivir-contre-le-covid-19-20200423", "urlToImage": null, "publishedAt": "2020-04-23T18:59:00Z", "content": "L'antiviral remdesivir du laboratoire américain Gilead Sciences a échoué à améliorer l'état de malades de Covid-19, maladie causée par le nouveau coronavirus, selon les résultats d'un des premiers essais cliniques sur le médicament en Chine et publiés prématu… [+1826 chars]"}]}