{"status": "ok", "totalResults": 34, "articles": [{"source": {"id": null, "name": "20minutes.fr"}, "author": "C.G.", "title": "Coronavirus à Lyon : A peine libéré de prison dans le cadre de l'urgence sanitaire, il retourne derrière les… - 20 Minutes", "description": "L’individu, qui n’avait pas respecté son assignation à résidence, s’est illustré dans différentes bagarres", "url": "https://www.20minutes.fr/societe/2768059-20200426-coronavirus-lyon-peine-libere-prison-cadre-urgence-sanitaire-retourne-derriere-barreaux", "urlToImage": null, "publishedAt": "2020-04-26T12:32:21Z", "content": "CORBAS, le 05/03/2015 Illustration prison de Lyon:FABRICE ELSNER/SIPA/1503111644 SIPA\r\nDeux semaines de liberté avant de retourner derrière les barreaux. Un Lyonnais de 38 ans, qui avait été libéré de prison le 10 avril dans le cadre de lurgence sanitaire, a … [+766 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "OM : Thauvin reste, Eyraud va faire la grimace - Foot01.com", "description": "Longtemps blessé cette saison et en fin de contrat dans un an, Florian Thauvin ne quittera pas l’OM cet été au mercato.\r\nC’est le joueur lui-même qui a annoncé la nouvelle sur les réseaux sociaux. Pour l’international tricolore, il est tout simplement…", "url": "https://www.foot01.com/equipe/marseille/om-thauvin-reste-eyraud-va-faire-la-grimace,347997", "urlToImage": null, "publishedAt": "2020-04-26T11:26:27Z", "content": "Longtemps blessé cette saison et en fin de contrat dans un an, Florian Thauvin ne quittera pas lOM cet été au mercato.\r\nCest le joueur lui-même qui a annoncé la nouvelle sur les réseaux sociaux. Pour linternational tricolore, il est tout simplement inenvisage… [+1879 chars]"}, {"source": {"id": null, "name": "Public.fr"}, "author": "Public", "title": "PHOTO - The Voice : Pascal Obispo embrasse l’une de ses candidates sur la bouche... La Toile est sous le choc ! - Public", "description": "La neuvième saison de l’émission The Voice a continué d’être diffusé malgré le confinement. Mais hier soir, samedi 25 avril, les derniers KO ont pris fin. Après les passages des apprentis artistes, Nikos est apparu quelques minutes pour annoncer la suite des …", "url": "https://www.public.fr/News/PHOTO-The-Voice-Pascal-Obispo-embrasse-l-une-de-ses-candidates-sur-la-bouche-La-Toile-est-sous-le-choc-1639804", "urlToImage": null, "publishedAt": "2020-04-26T11:20:07Z", "content": "La neuvième saison de lémission The Voice a continué dêtre diffusé malgré le confinement. Mais hier soir, samedi 25 avril, les derniers KO ont pris fin. Après les passages des apprentis artistes, Nikos est apparu quelques minutes pour annoncer la suite des év… [+1419 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "A.L.", "title": "« Koh-Lanta » : Deux candidats reçoivent des menaces de mort après l’élimination de Sam - 20 Minutes", "description": "Deux candidats de « Koh-Lanta » ont indiqué avoir reçu des menaces de mort et messages de haine après l’élimination d’un troisième candidat, lors de la diffusion du dernier épisode vendredi soir sur TF1", "url": "https://www.20minutes.fr/arts-stars/television/2768043-20200426-koh-lanta-deux-candidats-recoivent-menaces-mort-apres-elimination-sam", "urlToImage": null, "publishedAt": "2020-04-26T11:18:10Z", "content": "Une partie des candidats de Koh-Lanta, l'île des héros. Philippe Le Roux/ALP/TF1/Starface\r\nDeux candidats du jeu daventures Koh-Lanta, lîle des héros, Inès et Régis, ont reçu des messages de haine après lélimination de Sam, lors de la diffusion du dernier épi… [+1888 chars]"}, {"source": {"id": null, "name": "Boursorama.com"}, "author": null, "title": "Air France: pas de retour rapide à la normale, plan de départs volontaires envisagé, indique son patron - Boursorama", "description": "Le directeur général d'Air France-KLM, Benjamin Smith, ne prévoit pas de retour à une activité normale avant deux ans, mais souligne que le prêt de l'Etat français va permettre \"de passer la période la plus difficile\". \n\n\n  Il annonce aussi, dans un entretien…", "url": "https://www.boursorama.com/bourse/actualites/air-france-pas-de-retour-rapide-a-la-normale-plan-de-departs-volontaires-envisage-indique-son-patron-d76e482c30ddfb23aad7970ec7b08071", "urlToImage": null, "publishedAt": "2020-04-26T11:13:20Z", "content": "Des avions à l'arrêt sur le tarmac de l'aéroport de Roissy, au nord de Paris, le 24 mars 2020 ( AFP / Thomas SAMSON )\r\nIl annonce aussi, dans un entretien publié samedi par Les Echos, vouloir \"accélérer\" la transformation de la compagnie, avec \"un impact soci… [+3098 chars]"}, {"source": {"id": null, "name": "Actu17.fr"}, "author": "https://actu17.fr/author/actu17/", "title": "Coronavirus : Les pharmacies vont pouvoir vendre des masques «grand public» - Actu17", "description": "Le gouvernement a décidé d’autoriser les pharmacies à vendre des masques « non sanitaires ». Il s’agit de masques grand public, non destinés aux professionnels. Il sera bientôt possible de se procurer des masques textiles provenant de la filière industrielle …", "url": "https://actu17.fr/coronavirus-les-pharmacies-vont-pouvoir-vendre-des-masques-grand-public/", "urlToImage": null, "publishedAt": "2020-04-26T11:11:00Z", "content": "Le gouvernement a décidé d’autoriser les pharmacies à vendre des masques « non sanitaires ». Il sagit de masques grand public, non destinés aux professionnels.\r\nIl sera bientôt possible de se procurer des masques textiles provenant de la filière industrielle … [+1200 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Pour Guy Drut, le projet de Paris 2024 est désormais «obsolète, dépassé et déconnecté de la réalité» - Le Figaro", "description": "L'ancien ministre des Sports appelle à une réforme en profondeur des Jeux olympiques et de leur organisation.", "url": "https://sport24.lefigaro.fr/jeux-olympiques/jo-2024/actualites/pour-guy-drut-le-projet-de-paris-2024-est-desormais-obsolete-depasse-et-deconnecte-de-la-realite-1000341", "urlToImage": null, "publishedAt": "2020-04-26T10:48:00Z", "content": "L'ancien ministre des Sports appelle à une réforme en profondeur des Jeux olympiques et de leur organisation.Dans une tribune publiée par France Info, Guy Drut plaide pour une refonte organisationnelle des Jeux olympiques, conséquence de la crise sanitaire et… [+1253 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "20 Minutes avec AFP", "title": "Confinement en Espagne : Les enfants vont pouvoir sortir ce dimanche pour la première fois après six semaines - 20 Minutes", "description": "Depuis le 14 mars, les enfants de moins de 14 ans n'avaient pas le droit de sortir dans toute l'Espagne, qui commence petit à petit à se déconfiner", "url": "https://www.20minutes.fr/monde/2767979-20200426-espagne-premiere-fois-depuis-six-semaines-enfants-vont-pouvoir-sortir-dimanche", "urlToImage": null, "publishedAt": "2020-04-26T10:37:44Z", "content": "La Feria de Abril s'est faite aux fenêtres et balcon le 25 avril à Madrid. Depuis dimanche 26 avril, les enfants ont le droit de sortir pour la première fois depuis le 14 mars. A Perez Meca/REX/SIPA\r\nSortir prendre lair et se dégourdir les jambes, enfin. Enfe… [+2932 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "Sandra Favier", "title": "Coronavirus. Plan de déconfinement d'Edouard Philippe : à quoi peut-on s'attendre mardi ? - LaDepeche.fr", "description": "Malgré l'épidémie de coronavirus qui continue, le Premier ministre présentera, mardi, son plan de déconfinement progressif devant l'Assemblée nationale. Entre avis du conseil scientifique, de l'Académie de médecine et arbitrages politique et économique, à quo…", "url": "https://www.ladepeche.fr/2020/04/26/coronavirus-plan-de-deconfinement-dedouard-philippe-a-quoi-peut-on-sattendre-mardi,8863281.php", "urlToImage": null, "publishedAt": "2020-04-26T10:36:27Z", "content": "l'essentiel\r\n Malgré l'épidémie de coronavirus qui continue, le Premier ministre présentera, mardi, son plan de déconfinement progressif devant l'Assemblée nationale. Entre avis du conseil scientifique, de l'Académie de médecine et arbitrages politique et éco… [+9954 chars]"}, {"source": {"id": null, "name": "Nicematin.com"}, "author": "La rédaction avec AFP", "title": "Masques, voyages, rentrée scolaire, les recommandations du Conseil scientifique pour éviter une seconde vague après le 11 mai - Nice-Matin", "description": "Le Premier Ministre Edouard Philippe doit présenter mardi devant l'Assemblée nationale le plan de déconfinement. Le conseil scientifique, chargé d'éclairer le gouvernement, a publié samedi soir sur son site deux avis pour une \"levée progressive et contrôlée d…", "url": "https://www.nicematin.com/sante/masques-voyages-rentree-scolaire-les-recommandations-du-conseil-scientifique-pour-eviter-une-seconde-vague-apres-le-11-mai-501700", "urlToImage": null, "publishedAt": "2020-04-26T10:34:00Z", "content": "Pour éviter une deuxième vague épidémique et/ou un nouveau confinement, le Conseil scientifique, chargé d'éclairer le gouvernement sur la stratégie face au Covid-19, a publié samedi soir deux avis datés du 20 avril et du 24 avril, le premier sur les modalités… [+3449 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Coronavirus : Romain Philippoteaux (Nîmes) trouve le plan de reprise de la L1 « ahurissant » - Foot - L1 - Coronavirus - L'Équipe.fr", "description": "Face à la menace de l'épidémie de coronavirus, le milieu offensif de Nîmes est opposé à un redémarrage de la L1 à court terme.", "url": "https://www.lequipe.fr/Football/Actualites/Coronavirus-romain-philippoteaux-nimes-trouve-le-plan-de-reprise-de-la-l1-ahurissant/1129863", "urlToImage": null, "publishedAt": "2020-04-26T10:31:24Z", "content": "Interrogé par La Provence, Romain Philippoteaux, le milieu offensif de Nîmes, n'a pas caché son scepticisme et même son opposition à une reprise de la L1 dans les semaines qui viennent. « J'ai du mal à y croire, lance-t-il. Les instances nationales insistent,… [+1416 chars]"}, {"source": {"id": null, "name": "Jeanmarcmorandini.com"}, "author": "Jean-Marc Morandini", "title": "Les éditions Albert René annoncent la sortie prochaine d'un nouvel album d'Astérix et Obélix inspiré p... - Le Blog de Jean-Marc Morandini", "description": "Les éditions Albert René annoncent la sortie prochaine d'un nouvel album d'Astérix et Obélix. Le nom de celui-ci sera le «Menhir d'or», révèle le JDD...", "url": "https://www.jeanmarcmorandini.com/article-423175-les-editions-albert-rene-annoncent-la-sortie-prochaine-d-un-nouvel-album-d-asterix-et-obelix-inspire-par-les-tele-crochets-le-menhir-d-or.html", "urlToImage": null, "publishedAt": "2020-04-26T10:21:20Z", "content": "Les éditions Albert René annoncent la sortie prochaine d'un nouvel album d'Astérix et Obélix. Le nom de celui-ci sera le «Menhir d'or», révèle le JDD ce 26 avril, et aura pour héros Assurancetourix, barde du village au talent musical douteux. L'histoire n'est… [+1235 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "J.G.", "title": "Coronavirus dans le Finistère : Quatre surfeurs reçoivent une lourde amende en sortant de l’eau - 20 Minutes", "description": "Un arrêté préfectoral interdit toute activité nautique pendant la durée du confinement", "url": "https://www.20minutes.fr/societe/2767975-20200426-coronavirus-finistere-quatre-surfeurs-recoivent-lourde-amende-sortant-eau", "urlToImage": null, "publishedAt": "2020-04-26T10:11:24Z", "content": "Illustration de surfeurs dans le Finistère. COLLIOT BRUNO/SIPA\r\nLeur petite session de surf leur a valu une amende bien salée. Bravant les mesures de confinement et linterdiction de toute activité nautique, quatre surfeurs se sont mis à leau pour taquiner la … [+773 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "20 Minutes avec AFP", "title": "Coronavirus : Malgré la crise, certains secteurs recrutent - 20 Minutes", "description": "La crise a fait émerger de nouveaux besoins en recrutement", "url": "https://www.20minutes.fr/economie/2767963-20200426-coronavirus-malgre-crise-certains-secteurs-recrutent", "urlToImage": null, "publishedAt": "2020-04-26T10:11:19Z", "content": "Une biologiste fait un test PCR sur le Champs de Mars à Paris. AFP\r\nSanté, chaîne alimentaire, transports ou encore informatique: la crise du coronavirus  a fait émerger des besoins de recrutement dans certains secteurs d'activité malgré un recul «historique»… [+4439 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Le Figaro avec AFP", "title": "Le groupe Bertrand plaide pour un retour de la TVA à 5,5% dans la restauration - Le Figaro", "description": null, "url": "http://www.lefigaro.fr/flash-eco/le-groupe-bertrand-plaide-pour-un-retour-de-la-tva-a-5-5-dans-la-restauration-20200426", "urlToImage": null, "publishedAt": "2020-04-26T09:51:00Z", "content": "Le patron du groupe Bertrand plaide dimanche pour le retour de la TVA à 5,5% dans la restauration pour «amortir les nouveaux coûts» auxquels ses confrères vont devoir faire face «pour réorganiser (leurs) établissements et assurer la sécurité des clients et de… [+2119 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": "Philippe Mesmer", "title": "Corée du Nord : l'absence prolongée de Kim Jong-un alimente les spéculations sur son état de santé - Le Monde", "description": "Certains spécialistes avancent que le dictateur nord-coréen est « pratiquement mort », tandis que les autorités de Corée du Sud restent prudentes, estimant même que « le leader pourrait être en tournée régionale ».", "url": "https://www.lemonde.fr/international/article/2020/04/26/coree-du-nord-l-absence-prolongee-de-kim-jong-un-alimente-les-speculations-sur-son-etat-de-sante_6037805_3210.html", "urlToImage": null, "publishedAt": "2020-04-26T09:47:57Z", "content": "Le silence qui entoure létat de santé du dirigeant nord-coréen, Kim Jong-un, alimente les rumeurs les plus diverses et des théories plus ou moins sérieuses. Dernière information en date, celle de 38 North. Samedi 25 avril, le très sérieux centre danalyses amé… [+4954 chars]"}, {"source": {"id": null, "name": "Huffingtonpost.fr"}, "author": "Astrid de Villaines", "title": "Déconfinement: le vote du 28 avril fait bondir l'opposition et une partie de LREM - Le HuffPost", "description": "Les députés dénoncent un \"manque de démocratie\" et la précipitation de l'exécutif.", "url": "https://www.huffingtonpost.fr/entry/deconfinement-le-vote-du-28-avril-fait-bondir-lopposition-et-une-partie-de-lrem_fr_5ea53b3fc5b6805f9ece70a8", "urlToImage": null, "publishedAt": "2020-04-26T09:38:27Z", "content": "POLITIQUE - Comme un air de précipitation. Cette semaine, Edouard Philippe voulait “prendre le temps” de préparer le plan de déconfinement, le voilà finalement prêt à le défendre dès ce mardi 28 avril devant l’Assemblée nationale. \r\nLa nouvelle est tombée ce … [+5181 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "«Un NON-SENS de tester 65 millions de Français» contre le coronavirus Olivier Véran - Figaro Live", "description": "La date annoncée du début du déconfinement progressif en France, le 11 mai, approche et le ministre de la Santé et des Solidarités a visité un laboratoire de...", "url": "https://www.youtube.com/watch?v=ffK12nvLd00", "urlToImage": null, "publishedAt": "2020-04-26T09:23:13Z", "content": null}, {"source": {"id": null, "name": "Phonandroid.com"}, "author": "Bruno Mathieu", "title": "Non, OnePlus ne va pas licencier 80% de son personnel en Europe pendant la crise - Phonandroid", "description": "OnePlus aurait licencié une grosse partie de son personnel, notamment en France. Mais non, ce n'est pas 80% de ses effectifs qui est concerné.", "url": "https://www.phonandroid.com/oneplus-ne-va-pas-licencier-presque-tout-son-personnel-en-europe-pendant-la-crise.html", "urlToImage": null, "publishedAt": "2020-04-26T09:20:39Z", "content": "Moins de deux semaines après avoir lancé ses OnePlus 8 et OnePlus 8 Pro, la marque chinoise irait au plus mal en Europe. Elle aurait ainsi licencié une très grosse partie de son personnel, notamment en France. Face à cette soudaine rumeur originaire du site E… [+3492 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Décès de l’écrivain suédois Per Olov Enquist - Ouest-France", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiWWh0dHBzOi8vd3d3Lm91ZXN0LWZyYW5jZS5mci9ldXJvcGUvc3VlZGUvZGVjZXMtZGUtbC1lY3JpdmFpbi1zdWVkb2lzLW9sb3YtZW5xdWlzdC02ODE3OTA30gFZaHR0cHM6Ly9hbXAub3Vlc3QtZnJhbmNlLmZyL2V1cm9wZS9zdWVkZS9kZWNlcy1kZS1sLWVjcml2YWluLXN1ZWRvaXMtb2xvdi1lbnF1aXN0LTY4MTc5MDc?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T09:18:14Z", "content": null}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Cavani, un coup de tonnerre qui se confirme ! - Sports.fr", "description": "Longtemps promis à un départ au terme de la saison, Edinson Cavani, en fin de contrat, pourrait finalement bel et bien rempiler au PSG. Meilleur buteur de l’histoire du PSG avec 200 buts au compteur et parmi les meilleurs réalisateurs de l’histoire du champio…", "url": "https://www.sports.fr/football/cavani-coup-de-tonnerre-se-confirme-349718.html", "urlToImage": null, "publishedAt": "2020-04-26T08:15:13Z", "content": "Longtemps promis à un départ au terme de la saison, Edinson Cavani, en fin de contrat, pourrait finalement bel et bien rempiler au PSG.\r\nMeilleur buteur de lhistoire du PSG avec 200 buts au compteur et parmi les meilleurs réalisateurs de lhistoire du champion… [+1771 chars]"}, {"source": {"id": null, "name": "Frandroid.com"}, "author": "Geoffroy Husson", "title": "Xiaomi Mi 10 Pro vs Oppo Find X2 Pro : lequel est le meilleur smartphone ? - Frandroid", "description": "Autour des 1000 euros, la bataille fait désormais rage dans le domaine des smartphones. Deux téléphones ont su se distinguer récemment, les Xiaomi Mi 10 Pro et l'Oppo Find X2 Pro. Mais lequel est le meilleur ? C'est ce qu'on va voir dans ce comparatif.", "url": "https://www.frandroid.com/versus/702284_xiaomi-mi-10-pro-vs-oppo-find-x2-pro-lequel-est-le-meilleur-smartphone", "urlToImage": null, "publishedAt": "2020-04-26T08:09:48Z", "content": "Autour des 1000 euros, la bataille fait désormais rage dans le domaine des smartphones. Deux téléphones ont su se distinguer récemment, les Xiaomi Mi 10 Pro et l'Oppo Find X2 Pro. Mais lequel est le meilleur ? C'est ce qu'on va voir dans ce comparatif. \r\nCes … [+14018 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Elsa Bembaron", "title": "StopCovid: la Cnil dit oui sous conditions à l’application de traçage - Le Figaro", "description": "La Commission informatique et liberté pose les frontières à l’utilisation d’une telle application. Elle doit notamment être limitée dans le temps.", "url": "http://www.lefigaro.fr/secteur/high-tech/stopcovid-la-cnil-dit-oui-sous-conditions-a-l-application-de-tracage-20200426", "urlToImage": null, "publishedAt": "2020-04-26T07:53:00Z", "content": "La Commission informatique et liberté (Cnil) a rendu public son avis sur lapplication «StopCovid» du gouvernement, ce dimanche matin 26 avril. Les membres du collège de la Cnil se sont prononcés le 24 avril. La commission estime que «lapplication peut être dé… [+3246 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "Attendu sur sa stratégie face au coronavirus, Boris Johnson reprendra les rênes du gouvernement britannique... - franceinfo", "description": "", "url": "https://www.francetvinfo.fr/sante/maladie/coronavirus/attendu-sur-sa-strategie-face-au-coronavirus-boris-johnson-reprendra-les-renes-du-gouvernement-britannique-lundi_3935469.html", "urlToImage": null, "publishedAt": "2020-04-26T07:22:17Z", "content": "Plus d'un mois après l'entrée en vigueur du confinement généralisé, les attentes sont fortes pour que Boris Johnson fasse part de ses projets pour tenter de remettre l'économie en ordre de marche et s'expliquer sur l'avenir du confinement.\r\nLe Premier ministr… [+1802 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "DIRECT. Coronavirus : l'Espagne enregistre son bilan quotidien le plus bas depuis un mois, avec 288 morts e... - Franceinfo", "description": "", "url": "https://www.francetvinfo.fr/sante/maladie/coronavirus/direct-coronavirus-les-etats-unis-deplorent-plus-de-53-000-morts-liees-au-covid-19_3935427.html", "urlToImage": null, "publishedAt": "2020-04-26T05:32:05Z", "content": "Retrouvez ici l'intégralité de notre live #CORONAVIRUS\r\n12h45 : L'usine de masques respiratoires de Plaintel dans les Côtes-d'Armor, pourrait rouvrir\"au courant de l'automne\", selon Guy Hascoët, chargé par la région Bretagne de piloter la mission détude sur l… [+12418 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Transports, tests, écoles... Le plan de déconfinement présenté mardi - RTL.fr", "description": "Le Premier ministre Édouard Philippe présentera devant l'Assemblée nationale le plan de déconfinement.", "url": "https://www.rtl.fr/actu/bien-etre/transports-tests-ecoles-le-plan-de-deconfinement-presente-mardi-7800443334", "urlToImage": null, "publishedAt": "2020-04-26T04:02:00Z", "content": "Pendant que les Français vivent un nouveau week-end printanier confinés chez eux, et que le bilan chiffré de l'épidémie poursuit son amélioration, le gouvernement a confirmé présenter, mardi 28 avril, son plan de déconfinement qui s'appliquera à partir du 11 … [+2311 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": "Paul Benkimoun, Chloé Hecketsweiler", "title": "Coronavirus : masques, travail, écoles, transports… Le conseil scientifique très prudent sur les conditions du déconfinement - Le Monde", "description": "Dans son sixième avis, le cercle d’experts pose plusieurs conditions à cette nouvelle étape. Il insiste sur le risque de rebond en cas de relâchement trop soudain des mesures de contrôle.", "url": "https://www.lemonde.fr/planete/article/2020/04/25/coronavirus-masques-systematiques-teletravail-ecoles-le-conseil-scientifique-recommande-une-strategie-nationale-pour-le-deconfinement_6037781_3244.html", "urlToImage": null, "publishedAt": "2020-04-25T21:30:23Z", "content": "Des enfants jouent au tennis dans les rues désertées de Paris, le 21 avril. CHRISTOPHE ARCHAMBAULT / AFP\r\nA quelles conditions le confinement pourra-t-il être levé ? Quelle stratégie mettre en uvre pour éviter un rebond de lépidémie de Covid-19 ? Voilà les qu… [+2211 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Le patron de Ryanair menace de représailles les compagnies aériennes nationales - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_13073053-3f6f-4991-982a-77e681b6c28e&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-25T15:35:00Z", "content": "Yahoo fait partie de Verizon Media. Cliquez sur J'accepte afin dautoriser Verizon Media et ses partenaires à utiliser des cookies et des technologies similaires pour accéder à votre appareil, utiliser vos données (y compris votre position géographique), compr… [+596 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Etienne Froment pour 20 Minutes", "title": "Les avatars débarquent sur Facebook et dans Messenger - 20 Minutes", "description": "Les membres du réseau social Facebook peuvent désormais créer un avatar à leur image", "url": "https://www.20minutes.fr/high-tech/2765647-20200422-les-avatars-debarquent-sur-facebook-et-dans-messenger", "urlToImage": null, "publishedAt": "2020-04-25T14:43:35Z", "content": "Les avatars débarquent sur Facebook et dans Messenger Geeko\r\nDéjà disponible en Australie, la fonctionnalité de créer son avatar sur Facebook serait actuellement déployée massivement en Europe, selon TechCrunch. Sinspirant très ouvertement de \r\nBitmoji, propr… [+1396 chars]"}, {"source": {"id": null, "name": "Huffingtonpost.fr"}, "author": "Paul Guyonnet", "title": "Covid-19: L'Agence du médicament met en garde contre les \"effets secondaires graves\" des traitements - Le HuffPost", "description": "Un avertissement est tout particulièrement adressé à l'hydroxychloroquine lorsqu'elle est  utilisée en dehors d'essais cliniques.", "url": "https://www.huffingtonpost.fr/entry/coronavirus-traitements-effets-secondaires-chloroquine_fr_5ea41280c5b6d37635902861", "urlToImage": null, "publishedAt": "2020-04-25T11:33:44Z", "content": "SANTÉ - Les signalements d’effets indésirables liés aux traitements testés contre le Covid-19 ont continué à augmenter ces dernières semaines, atteignant plus de 300 cas, a annoncé l’Agence du médicament (ANSM) vendredi 24 avril, confirmant en particulier le … [+2442 chars]"}, {"source": {"id": null, "name": "Parismatch.com"}, "author": "Paris Match", "title": "La Chine a envoyé des experts médicaux auprès de Kim Jong-un - Paris Match", "description": "Selon des informations de Reuters, Pékin a envoyé en Corée du Nord des experts médicaux auprès de Kim Jong-un.", "url": "https://www.parismatch.com/Actu/International/La-Chine-a-envoye-des-experts-medicaux-aupres-de-Kim-Jong-un-1683234", "urlToImage": null, "publishedAt": "2020-04-25T11:23:07Z", "content": "Selon des informations de Reuters, Pékin a envoyé en Corée du Nord des experts médicaux auprès de Kim Jong-un. La Chine a envoyé en Corée du Nord une équipe médicale au chevet de Kim Jong-un, selon des informations de lagence de presse Reuters. Létat du dirig… [+1398 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Jennifer Alberts", "title": "Coronavirus - L'Institut Pasteur étend son étude épidémiologique à Crépy-en-Valois aux enfants de 5 à 1 - France 3 Régions", "description": "Après une première étude épidémiologique fin mars auprès de 661 personnes reliées au lycée Jean-Monnet de Crépy-en-Valois dans l'Oise, l'Institut Pasteur va tester les 5-12 ans scolarisés dans la commune. Le but : comprendre comment elle est devenue le coeur …", "url": "https://france3-regions.francetvinfo.fr/hauts-de-france/oise/coronavirus-institut-pasteur-etend-son-etude-epidemiologiste-aux-enfants-5-12-ans-crepy-valois-1820800.html", "urlToImage": null, "publishedAt": "2020-04-25T09:36:36Z", "content": "Groupe CORSER-2. C'est le nom de la deuxième phase de l'étude épidémiologique de l'Institut Pasteur à Crépy-en-Valois dans l'Oise. Cette fois-ci, ce sont les enfants de 5 à 12 ans, scolarisés dans la commune, et leurs parents qui sont ciblés, après avoir test… [+4089 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Covid-19 : l'absence d'immunité serait \"une exception\" explique le Pr. Vivier - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_12ca8140-a384-451d-ae34-48fa512d0952&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-24T15:41:00Z", "content": "Afin de vous offrir une expérience globale optimisée, nous souhaitons vous proposer des publicités pertinentes qui vous seront plus utiles. Par exemple, lorsque vous recherchez un film, nous utilisons vos données de recherche et votre position pour afficher l… [+471 chars]"}, {"source": {"id": null, "name": "Consomac.fr"}, "author": "Sylvain Rogelet", "title": "Une nouvelle suite de caractères fait planter l'iPhone - Consomac", "description": "Deux ans après le bug de la lettre télougou qui faisait planter l'application iMessage, voilà une nouvelle chaîne de caractères qui fait totalement planter iOS lorsqu'elle apparaît dans une notification, obligeant l'utilisateur recevant le message à redémarre…", "url": "https://consomac.fr/news-12377-une-nouvelle-suite-de-caracteres-fait-planter-ios.html", "urlToImage": null, "publishedAt": "2020-04-24T13:46:00Z", "content": "Deux ans après le bug de la lettre télougou qui faisait planter l'application iMessage, voilà une nouvelle chaîne de caractères qui fait totalement planter iOS lorsqu'elle apparaît dans une notification, obligeant l'utilisateur recevant le message à redémarre… [+741 chars]"}]}