{"status": "ok", "totalResults": 34, "articles": [{"source": {"id": null, "name": "20minutes.fr"}, "author": "M.Co.", "title": "Port du masque, dauphins filmés… Attention aux intox de la semaine - 20 Minutes", "description": "Soyez forts contre les fausses nouvelles", "url": "https://www.20minutes.fr/societe/2767627-20200425-port-masque-dauphins-filmes-attention-intox-semaine", "urlToImage": null, "publishedAt": "2020-04-25T12:23:29Z", "content": "Fabrication de masques en tissu à Cannes le 20 avril (illustration). SYSPEO/SIPA\r\nVous les avez sans doute vues passer sur le mur Facebook dun ami ou dans votre boîte mail. Parce que les intox voisinent de plus en plus avec les infos, la rédaction de 20 Minut… [+4124 chars]"}, {"source": {"id": null, "name": "Www.lci.fr"}, "author": "La rédaction de LCI", "title": "EN DIRECT - Coronavirus : O. Véran en visite dans un laboratoire de Saint-Denis - LCI", "description": "CORONAVIRUS - Alors que la France se dirige avec incertitude vers la sortie progressive du confinement à partir du 11 mai, la pandémie de Covid-19 poursuit sa propagation tragique à travers toute la planète. Suivez les dernières informations en direct.. Santé…", "url": "https://www.lci.fr/sante/en-direct-coronavirus-pas-de-preuve-que-des-personnes-deja-infectees-soient-immunisees-previent-l-oms-2151538.html", "urlToImage": null, "publishedAt": "2020-04-25T12:20:09Z", "content": "AUSTRALIE : IL PROMET QU'UNE \"MACHINE À LUMIÈRE\" PEUT COMBATTRE LE VIRUS, IL ÉCOPE D'UNE AMENDE\r\nLe célèbre chef australien Pete Evans a écopé d'une amende de plusieurs milliers d'euros pour avoir fait la promotion d'une \"machine à lumière\" dont il prétendait… [+897 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "Le nombre de signalements d'\"effets secondaires graves\" des traitements contre le Covid-19 en hausse - franceinfo", "description": "", "url": "https://www.francetvinfo.fr/sante/maladie/coronavirus/le-nombre-de-signalements-d-effets-secondaires-graves-des-traitements-contre-le-covid-19-en-hausse_3934295.html", "urlToImage": null, "publishedAt": "2020-04-25T12:10:49Z", "content": "\"Au 22 avril 2020, 321 cas d'effets indésirables ont été déclarés en lien avec une infection à Covid-19, dont 80% de cas graves\", indique l'ANSM.\r\nLes signalements d'effets indésirables liés aux traitements testés contre le Covid-19 ont continué à augmenter c… [+2296 chars]"}, {"source": {"id": null, "name": "Jeuxvideo.com"}, "author": "theholomovement", "title": "Animal Crossing New Horizons, bébètes d'avril : quelles espèces vont disparaître en mai ? - jeuxvideo.com", "description": "La fin du mois d'avril approche à grand pas. Et qui dit fin du mois dit changement dans la faune et la flore d'Animal Crossing : New Horizons. Après avoir passé le mois à la recherche d'oeufs cachés ou à profiter de la mise à jour 1.2.0 et notamment de l'ouve…", "url": "http://www.jeuxvideo.com/news/1216747/animal-crossing-new-horizons-bebetes-d-avril-quelles-especes-vont-disparaitre-en-mai.htm", "urlToImage": null, "publishedAt": "2020-04-25T11:57:10Z", "content": "La fin du mois d'avril approche à grand pas. Et qui dit fin du mois dit changement dans la faune et la flore d'Animal Crossing : New Horizons. Après avoir passé le mois à la recherche d'oeufs cachés ou à profiter de la mise à jour 1.2.0 et notamment de l'ouve… [+2142 chars]"}, {"source": {"id": null, "name": "Sudouest.fr"}, "author": "Sud Ouest", "title": "Robert Herbin, l’ex-entraîneur de l’AS Saint-Etienne, est hospitalisé - Sud Ouest", "description": "L'ex-entraîneur emblématique de la grande époque de l'AS Saint-Etienne est hospitalisé depuis cette semaine pour de sérieuses insuffisances cardiaques et pulmonaires.", "url": "https://www.sudouest.fr/2020/04/25/l-ex-entraineur-de-l-as-saint-etienne-robert-herbin-hospitalise-7438865-766.php", "urlToImage": null, "publishedAt": "2020-04-25T11:16:39Z", "content": "Robert Herbin, entraîneur emblématique de la grande époque de l’AS Saint-Etienne, est hospitalisé depuis mardi au CHU de Saint-Étienne pour de sérieuses insuffisances cardiaques et pulmonaires, a-t-on appris samedi de sources concordantes. Son état de santé e… [+1930 chars]"}, {"source": {"id": null, "name": "Sudouest.fr"}, "author": "Sud Ouest", "title": "Covid-19: des '\"effets secondaires graves\" après des traitements, notamment à l’hydroxychloroquine - Sud Ouest", "description": "Les signalements d'effets indésirables liés aux traitements testés contre le Covid-19 ont continué à augmenter ces dernières semaines. L'Agence du médicament (ANSM) confirme en particulier le \"signal de vigilance\" concernant l'hydroxychloroquine.", "url": "https://www.sudouest.fr/2020/04/25/covid-19-des-effets-secondaires-graves-apres-des-traitements-notamment-a-l-hydroxychloroquine-7438797-10618.php", "urlToImage": null, "publishedAt": "2020-04-25T10:57:40Z", "content": "Les signalements d’effets indésirables liés aux traitements testés contre le Covid-19 ont continué à augmenter ces dernières semaines, atteignant plus de 300 cas, a annoncé l’Agence du médicament (ANSM), qui confirme en particulier le \"signal de vigilance\" co… [+2267 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "B.Ch.", "title": "Mick Jagger et Paul McCartney rejouent (pour rire) la guerre entre Beatles et Rolling Stones - 20 Minutes", "description": "Les deux chanteurs se répondent par médias interposés sur la question de la supériorité de leurs groupes respectifs", "url": "https://www.20minutes.fr/arts-stars/culture/2767647-20200425-mick-jagger-paul-mccartney-rejouent-rire-guerre-entre-beatles-rolling-stones", "urlToImage": null, "publishedAt": "2020-04-25T10:51:33Z", "content": "Paul McCartney et Mick Jagger en 2011 à New York Richard Young / Rex Fea/REX/SIPA\r\nPaul McCartney et Mick Jagger relancent \r\n la polémique la plus \r\nvive des dernières décennies : plutôt Beatles ou Rolling Stones? Alors bien sûr, cest pour rire, bien sûr, ils… [+1575 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "Trump assure qu'il était \"sarcastique\" lorsqu'il a suggéré des injections de désinfectant pour traiter le c... - franceinfo", "description": "", "url": "https://www.francetvinfo.fr/sante/maladie/coronavirus/trump-assure-qu-il-etait-sarcastique-lorsqu-il-a-suggere-d-injecter-un-desinfectant-pour-lutter-contre-le-coronavirus_3934203.html", "urlToImage": null, "publishedAt": "2020-04-25T10:44:46Z", "content": "Le président des Etats-Unis avait suscité la stupeur et une pluie de critiques, jeudi, en suggérant que les malades reçoivent des injections de désinfectant dans les poumons pour guérir du Covid-19.\r\nDonald Trump n'est pas connu pour sa rigueur scientifique. … [+1952 chars]"}, {"source": {"id": null, "name": "Sudouest.fr"}, "author": "Sud Ouest", "title": "Coronavirus : au moins 25 soignants décédés en France, qui étaient-ils ? - Sud Ouest", "description": "Sur le front depuis des semaines face à l'épidémie, les soignants payent un lourd tribut. Au moins 25 d'entre eux sont décédés depuis mars en France. Qui étaient-ils ?", "url": "https://www.sudouest.fr/2020/04/25/coronavirus-au-moins-25-soignants-decedes-en-france-qui-etaient-ils-7438807-10861.php", "urlToImage": null, "publishedAt": "2020-04-25T10:34:47Z", "content": "Depuis le début de l’épidémie, 25 professionnels de santé au moins sont décédés du covid-19 en France. Un bilan sans doute inférieur à la réalité, les données disponibles restant très incomplètes.\r\nMédecins généralistes ou urgentistes, infirmiers, aides-soign… [+5754 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "BFMTV", "title": "Une pétition réclame un « accès responsable à la nature » pendant le confinement - BFMTV", "description": "Une pétition soutenue par une quinzaine de personnalités et signée par des dizaines de milliers de personnes propose aux autorités d'assouplir certaines mesures imposées par le confinement avant même le 11 mai.", "url": "https://www.bfmtv.com/societe/une-petition-reclame-un-acces-responsable-a-la-nature-pendant-le-confinement-1900557.html", "urlToImage": null, "publishedAt": "2020-04-25T10:18:15Z", "content": null}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "VIDÉO. La Mecque quasi vide pour le premier jour du ramadan - Le Parisien", "description": "Le premier lieu saint de l’islam connaît des mesures de restrictions sans précédents pour lutter contre la propagation du coronavirus alors", "url": "http://www.leparisien.fr/video/video-la-mecque-quasi-vide-pour-le-premier-jour-du-ramadan-25-04-2020-8305683.php", "urlToImage": null, "publishedAt": "2020-04-25T10:16:00Z", "content": "Seuls l'imam de la mosquée et le personnel de sécurité, de nettoyage et d'entretien du lieu saint ont été autorisés à prier à l'intérieur. En Arabie saoudite, les prières ont été suspendues dans les mosquées pour limiter la propagation du coronavirus. Dans le… [+56 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": null, "title": "L'Arabie saoudite abolit la peine de flagellation - Le Monde", "description": "La Cour suprême du royaume a fait savoir qu’elle avait décidé de remplacer la flagellation par des peines de prison et des amendes.", "url": "https://www.lemonde.fr/international/article/2020/04/25/l-arabie-saoudite-abolit-la-peine-de-flagellation_6037759_3210.html", "urlToImage": null, "publishedAt": "2020-04-25T10:15:12Z", "content": "Manifestation contre la détention du blogueur saoudien Raif Badawi à Vienne, en Autriche, le 6 février 2015. Hans Punz / AP\r\nLArabie saoudite a supprimé la flagellation de son système pénal, une peine très critiquée par les organisations non gouvernementales … [+3315 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Jennifer Alberts", "title": "Coronavirus - L'Institut Pasteur étend son étude épidémiologique à Crépy-en-Valois aux enfants de 5 à 1 - France 3 Régions", "description": "Après une première étude épidémiologique fin mars auprès de 661 personnes reliées au lycée Jean-Monnet de Crépy-en-Valois dans l'Oise, l'Institut Pasteur va tester les 5-12 ans scolarisés dans la commune. Le but : comprendre comment elle est devenue le coeur …", "url": "https://france3-regions.francetvinfo.fr/hauts-de-france/oise/coronavirus-institut-pasteur-etend-son-etude-epidemiologiste-aux-enfants-5-12-ans-crepy-valois-1820800.html", "urlToImage": null, "publishedAt": "2020-04-25T09:36:36Z", "content": "Groupe CORSER-2. C'est le nom de la deuxième phase de l'étude épidémiologique de l'Institut Pasteur à Crépy-en-Valois dans l'Oise. Cette fois-ci, ce sont les enfants de 5 à 12 ans, scolarisés dans la commune, et leurs parents qui sont ciblés, après avoir test… [+4089 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "Prêt de 7 milliards d'euros de l'État à Air France : \"Cela va permettre de sauver les 50 000 employés\", déf... - franceinfo", "description": "", "url": "https://www.francetvinfo.fr/sante/maladie/coronavirus/pret-de-7-milliards-d-euros-de-l-etat-a-air-france-cela-va-permettre-de-sauver-les-50000-employes-defend-un-syndicat_3934103.html", "urlToImage": null, "publishedAt": "2020-04-25T09:12:54Z", "content": "Le ministre de l'Économie a conditionné cette aide au respect de l'environnement. Olivier Lavielle du Syndicat des Navigants assure qu'\"Air France est à la pointe de cela depuis des années\".\r\nLe ministre de l'Économie, Bruno Le Maire, a annoncé vendredi soir … [+1659 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "La Ligue 1 à huis-clos jusqu'en 2021, le foot a peur - Foot01.com", "description": "Tandis que les clubs veulent croire à une reprise rapide, l'idée d'une compétition dans des stades vides jusqu'en 2021 gagne du terrain.\r\nLe 11 mai est attendu par toute la France puisque c’est à cette date que le déconfinement débutera dans la totalité…", "url": "https://www.foot01.com/ligue1/la-ligue-1-a-huis-clos-jusqu-en-2021-le-foot-a-peur,347937", "urlToImage": null, "publishedAt": "2020-04-25T09:09:12Z", "content": "Tandis que les clubs veulent croire à une reprise rapide, l'idée d'une compétition dans des stades vides jusqu'en 2021 gagne du terrain.\r\nLe 11 mai est attendu par toute la France puisque cest à cette date que le déconfinement débutera dans la totalité du pay… [+1377 chars]"}, {"source": {"id": null, "name": "Sudouest.fr"}, "author": "Sud Ouest", "title": "600 contraventions pour non-respect du confinement à Dax et Mont-de-Marsan - Sud Ouest", "description": "Depuis le début du confinement, les policiers landais ont dressé 600 contraventions. 70 personnes ont été verbalisées plus d'une fois", "url": "https://www.sudouest.fr/2020/04/24/600-contraventions-pour-non-respect-du-confinement-a-dax-et-mont-de-marsan-7437645-3452.php", "urlToImage": null, "publishedAt": "2020-04-25T09:06:34Z", "content": "Si les policiers landais ont d’abord fait de la prévention depuis le 16 mars, début du confinement, ils ont ensuite verbalisé les citoyens ne respectant pas les restrictions de circulation.\r\n&gt;&gt; Retrouvez tous nos articles sur la pandémie de coronavirus\r… [+497 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Coronavirus : pourquoi l'Espagne est un des pays les plus frappés par le Covid-19 - RTL.fr", "description": "ECLAIRAGE - L'ampleur du bilan en Espagne s'explique en partie par le mode de vie et les contacts étroits entre générations.", "url": "https://www.rtl.fr/actu/international/pourquoi-l-espagne-est-un-des-pays-les-plus-frappes-par-le-coronavirus-7800441666", "urlToImage": null, "publishedAt": "2020-04-25T08:37:00Z", "content": "L'Espagne est le troisième pays comptant le plus de morts du Covid-19. Dans la péninsule ibérique, le virus s'est répandu rapidement sans être détecté, en particulier parmi les personnes âgées, selon des experts. Les raisons notamment de l'ampleur du bilan : … [+4255 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Le Figaro avec AFP", "title": "Les commerçants sont décidés à ouvrir mais veulent «des règles» (confédération) - Le Figaro", "description": null, "url": "http://www.lefigaro.fr/flash-eco/les-commercants-sont-decides-a-ouvrir-mais-veulent-des-regles-confederation-20200425", "urlToImage": null, "publishedAt": "2020-04-25T08:22:00Z", "content": "Les commerçants sont «mobilisés» et «fermement décidés à ouvrir» après le 11 mai, mais demandent des «règles du jeu», a déclaré samedi le président de la Confédération des commerçants de France, Francis Palombi.\r\n«Pour l'instant, l'état d'esprit des commerçan… [+1474 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "BFMTV", "title": "Kanye West est officiellement milliardaire - BFMTV people", "description": "Le célèbre rappeur américain a fait fortune grâce à sa marque de sneakers, les Yeezy, développée en collaboration avec Adidas.", "url": "https://people.bfmtv.com/actualite-people/kanye-west-est-officiellement-milliardaire-1900480.html", "urlToImage": null, "publishedAt": "2020-04-25T08:13:00Z", "content": null}, {"source": {"id": null, "name": "Francebleu.fr"}, "author": "Théophile Pedrola", "title": "Quelle était cette ligne de points lumineux dans le ciel normand cette nuit ? - France Bleu", "description": "Une ligne de points très lumineux est passée au nord de la Normandie vendredi 24 avril, au soir. Visible à plusieurs centaines de kilomètres, elle en intrigue plus d'un.", "url": "https://www.francebleu.fr/infos/insolite/quelle-etait-cette-ligne-de-points-lumineux-dans-le-ciel-normand-cette-nuit-1587798810", "urlToImage": null, "publishedAt": "2020-04-25T07:13:34Z", "content": "Si vous aviez le nez en l'air, dans le nord de la Normandie hier, vendredi 24 avril, vers 22h, vous avez peut-être vu apparaître un drôle de spectacle : des points très lumineux, parfaitement alignés, se déplacer en vitesse. Visible pendant deux minutes envir… [+759 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Les infos de 8h - Les compagnies aériennes sommées de rembourser les voyageurs lésés - RTL.fr", "description": "Les compagnies aériennes proposent des avoirs aux voyageurs dont le billet a été annulé pour cause de coronavirus.", "url": "https://www.rtl.fr/actu/conso/les-infos-de-8h-les-compagnies-aeriennes-sommees-de-rembourser-les-voyageurs-leses-7800440573", "urlToImage": null, "publishedAt": "2020-04-25T06:53:00Z", "content": "Air France est mise en demeure par l'UFC-Que choisir, ainsi que la compagnie allemande Lufthansa ou Emirates et Easyjet... L'association de consommateurs donne 15 jours aux compagnies pour rembourser aux clients les billets annulés en raison de l'épidémie, ce… [+1610 chars]"}, {"source": {"id": null, "name": "Actu.fr"}, "author": "Thibaut Calatayud", "title": "Coronavirus. Toulouse est-elle prête à accueillir une deuxième vague après le confinement ? - actu.fr", "description": "Au CHU de Toulouse, l'activité liée au Covid-19 continue de baisser. Mais l'arrivée probable d'une seconde vague après le confinement pourrait-elle mettre le CHU en délicatesse ?", "url": "https://actu.fr/occitanie/toulouse_31555/coronavirus-toulouse-prete-accueillir-deuxieme-vague-apres-confinement_33235279.html", "urlToImage": null, "publishedAt": "2020-04-25T06:06:02Z", "content": "L’activité du CHU de Toulouse liée au coronavirus continue de baisser. (©Adobe Stock)\r\n« L’activité Covid continue à décroître, lentement, mais de façon certaine », constate Marc Penaud, le directeur général du CHU de Toulouse. Le plateau observé depuis déjà … [+7028 chars]"}, {"source": {"id": null, "name": "Allezpaillade.com"}, "author": null, "title": "Romain Thomas (SCO): « On est tous avec Junior Sambia » - AllezPaillade.com", "description": "Interrogé par L'Equipe, l'angevin Romain Thomas a évoqué l'hospitalisation de Junior Sambia et ses craintes sur une éventuelle reprise de la Ligue 1: \"Quand j'ai appris que Ju", "url": "https://www.allezpaillade.com/actualites/breves/romain-thomas-sco-on-est-tous-avec-junior-sambia/", "urlToImage": null, "publishedAt": "2020-04-25T05:30:00Z", "content": "Interrogé par L’Equipe, l’angevin Romain Thomas a évoqué l’hospitalisation de Junior Sambia et ses craintes sur une éventuelle reprise de la Ligue 1:\r\n« Quand j’ai appris que Junior Sambia était en réanimation, ça m’a alerté, ça veut dire qu’il a de graves pr… [+649 chars]"}, {"source": {"id": null, "name": "Republicain-lorrain.fr"}, "author": "Kevin GRETHEN", "title": "Lorraine. Des médecins mosellans sommés de se taire - Le Républicain Lorrain", "description": "L’usage de certains médicaments contre le coronavirus leur avait déjà attiré les foudres de confrères. C’est maintenant le conseil national de l’ordre ...", "url": "https://www.republicain-lorrain.fr/sante/2020/04/25/des-medecins-mosellans-sommes-de-se-taire", "urlToImage": null, "publishedAt": "2020-04-25T05:00:14Z", "content": "Cessez de parler de ce protocole que je ne saurais voir. C’est le message de fermeté diffusé par le conseil national de l’Ordre des médecins (CNOM) à l’adresse de médecins généralistes qui utilisent un remède « maison » face au coronavirus. « Le conseil natio… [+2389 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Le Figaro avec Reuters", "title": "Pékin a pressé l'UE de ne pas dénoncer de désinformation sur le virus - Le Figaro", "description": null, "url": "http://www.lefigaro.fr/flash-actu/pekin-a-presse-l-ue-de-ne-pas-denoncer-de-desinformation-sur-le-virus-20200425", "urlToImage": null, "publishedAt": "2020-04-25T02:57:00Z", "content": "La Chine a tenté de bloquer la publication d'un rapport de l'Union européenne prétendant que Pékin répandait de fausses informations sur l'épidémie de coronavirus, selon quatre sources et des correspondances diplomatiques que Reuters a pu consulter. La rappor… [+3761 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Floréal Hernandez", "title": "Coronavirus : Les salariés d’Amazon confinés chez eux jusqu’au 28 avril - 20 Minutes", "description": "Amazon a prolongé de deux jours la fermeture de ses sites après une nouvelle décision de justice lui imposant une véritable évaluation des risques liés à l’épidémie de coronavirus", "url": "https://www.20minutes.fr/economie/2767391-20200424-coronavirus-salaries-amazon-confines-chez-jusqu-28-avril", "urlToImage": null, "publishedAt": "2020-04-25T02:07:43Z", "content": "Le centre logistique d'Amazon à Lauwin-Planque, dans le Nord. (Illustration) AFP\r\nAu moins douze jours de fermeture pour les centres de distribution Amazon en France. En effet, \r\n«l'arrêt temporaire» des entrepôts du géant américain de la logistique a été pro… [+466 chars]"}, {"source": {"id": null, "name": "Public.fr"}, "author": "Public", "title": "Mort de Christophe : voici la seule chose qu'il a légué à Romain, le fils qu'il a eu avec Michèle Torr - Public", "description": "Le chanteur Christophe s’est éteint le 16 avril 2020 des suites d’un long combat contre la maladie. Mort à 74 ans, l’artiste souffrait en effet depuis longtemps d’un emphysème, une maladie pulmonaire chronique. Depuis quelques années, le chanteur Christophe é…", "url": "https://www.public.fr/News/Mort-de-Christophe-voici-la-seule-chose-qu-il-a-legue-a-Romain-le-fils-qu-il-a-eu-avec-Michele-Torr-1639768", "urlToImage": null, "publishedAt": "2020-04-24T22:16:41Z", "content": "Le chanteur Christophe sest éteint le 16 avril 2020 des suites dun long combat contre la maladie. Mort à 74 ans, lartiste souffrait en effet depuis longtemps dun emphysème, une maladie pulmonaire chronique. Depuis quelques années, le chanteur Christophe était… [+1741 chars]"}, {"source": {"id": "liberation", "name": "Libération"}, "author": "Laurence Defranoux", "title": "Auxiliaires de vie : «On est la basse classe, celle dont on ne parle pas» - Libération", "description": "Malgré le coronavirus, les aides à domicile continuent d’aller chez les personnes âgées dépendantes pour un maigre salaire. Comme Sophie de Saint-Andrieu, en Seine-Maritime.", "url": "https://www.liberation.fr/france/2020/04/24/auxiliaires-de-vie-on-est-la-basse-classe-celle-dont-on-ne-parle-pas_1786387", "urlToImage": null, "publishedAt": "2020-04-24T18:32:19Z", "content": "Search\r\nDirect\r\nUser\r\n100\r\nZoom\r\nQuiz\r\n?\r\nLibération Diamond\r\nclock\r\nxml\r\nnetvibes\r\nlive\r\nanciens-numeros\r\ndata\r\ndesintox\r\ndiapo\r\nedito\r\nelection-2017\r\nelection\r\nessentiel\r\ngenerique\r\nidee\r\njo\r\nnext\r\nportrait\r\nradio\r\nson\r\nalerte\r\ntop-100\r\nstar\r\nune\r\nvideo\r\nsc… [+398 chars]"}, {"source": {"id": null, "name": "Clubic.com"}, "author": "Marc Mitrani", "title": "Test de l'Oppo Find X2 Pro : l’ambition concrétisée d'Oppo - Clubic", "description": "Sorti il y a maintenant deux ans, le Find X d'Oppo laissait présager l'ambition du constructeur de se tourner vers les smartphones haut de gamme. Étonnamment, le premier modèle n'a pas été renouvelé l'année dernière, Oppo semblant préférer prendre son temps p…", "url": "https://www.clubic.com/test-produit/article-892591-1-test-find-x2-pro-oppo-ambition.html", "urlToImage": null, "publishedAt": "2020-04-24T16:01:33Z", "content": "Sorti il y a maintenant deux ans, le Find X d'Oppo laissait présager l'ambition du constructeur de se tourner vers les smartphones haut de gamme. Étonnamment, le premier modèle n'a pas été renouvelé l'année dernière, Oppo semblant préférer prendre son temps p… [+26740 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Emilie FLORES", "title": "Bernard Montiel assume son départ (très critiqué) de Paris à l'annonce du confinement : \"Ils se sont trompés ! - Télé Loisirs.fr", "description": "Un confinement en Nouvelle-Aquitaine qui ne passe pas. L'animateur et chroniqueur Bernard Montiel avait décidé de quitter Paris au début de la crise sanitaire; une attitude qui a agacé de nombreux Français.", "url": "https://www.programme-tv.net/news/people/253577-bernard-montiel-se-defend-davoir-quitte-paris-a-lannonce-du-confinement-je-ne-suis-pas-venu-me-planquer-video/", "urlToImage": null, "publishedAt": "2020-04-24T15:05:00Z", "content": "Les Parisiens pas les bienvenus en Province ? Bernard Montiel fait partie de ces nombreux citadins qui ont décidé de partir dans leur seconde maison, au moment de l'annonce du confinement en mars dernier. Objectif : quitter les villes pour se mettre au vert d… [+2078 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/marc.alvarez1", "title": "Maguire : “La Champions League 19/20 reprendra sous une forme ou une autre” - Canal Supporters", "description": "Les enjeux sont trop importants pour que l'UEFA tire un trait sur la Ligue des champions 2019/2020. Tout sera fait, qu'importe le calendrier,", "url": "https://canal-supporters.com/2020/04/maguire-la-champions-league-19-20-reprendra-sous-une-forme-ou-une-autre/", "urlToImage": null, "publishedAt": "2020-04-24T14:54:14Z", "content": "Les enjeux sont trop importants pour que l’UEFA tire un trait sur la Ligue des champions 2019/2020. Tout sera fait, qu’importe le calendrier, pour que la compétition continentale suspendue depuis la mi-mars aille à son terme. Le spécialiste de l’économie du f… [+1420 chars]"}, {"source": {"id": null, "name": "Sudouest.fr"}, "author": "Sud Ouest", "title": "Masques au Pays basque : où en sommes-nous ? - Sud Ouest", "description": "La distribution par Bayonne d’un masque gratuit par habitant commencera avant le 11 mai. En parallèle, l’Agglomération fournira tous les habitants du Pays basque. D’autres initiatives existent. Le point", "url": "https://www.sudouest.fr/2020/04/24/masques-au-pays-basque-ou-en-sommes-nous-7436549-4018.php", "urlToImage": null, "publishedAt": "2020-04-24T13:04:40Z", "content": "La Ville de Bayonne a trouvé un fabricant local et va distribuer avant le 11 mai des masques en tissu homologués. Il y en aura un par habitant. Il s’agit du Béret Français, une entreprise implantée à Bayonne, qui a adapté ses unités de production. Au total, 5… [+1518 chars]"}, {"source": {"id": null, "name": "Phonandroid.com"}, "author": "Bruno Mathieu", "title": "iPhone et iPad : le drapeau italien fait planter les appareils d’Apple ! - Phonandroid", "description": "iPhone et iPad d'Apple sont victimes d'un bug improbable : ils plantent à cause du drapeau italien et d'un caractère sindhi.", "url": "https://www.phonandroid.com/iphone-ipad-le-drapeau-italien-fait-planter-les-appareils-apple.html", "urlToImage": null, "publishedAt": "2020-04-24T11:30:48Z", "content": "iPhone et iPad d’Apple font actuellement les frais d’un bug étrange, voire improbable : quand un utilisateur reçoit une notification dans laquelle sont affichés le drapeau italien et un caractère sindhi, les appareils plantent littéralement. Mais comment les … [+2146 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Gennevilliers : la vidéo d’une interpellation musclée indigne le maire - Le Parisien", "description": "Patrice Leclerc (PCF) a demandé une enquête aux services de l’Etat, après la diffusion d’images montrant l’arrestation mouvementée d’un homm", "url": "http://www.leparisien.fr/hauts-de-seine-92/gennevilliers-la-video-d-une-interpellation-musclee-indigne-le-maire-23-04-2020-8304831.php", "urlToImage": null, "publishedAt": "2020-04-23T18:49:00Z", "content": "Violences urbaines riment avec vidéastes amateurs. Dans la nuit de mercredi à jeudi, l'un d'eux a capté les images d'une interpellation musclée survenue à Gennevilliers, théâtre comme Nanterre, Asnières ou Clichy de heurts réguliers avec les forces de l'ordre… [+1769 chars]"}]}