{"status": "ok", "totalResults": 34, "articles": [{"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "DIRECT. Coronavirus : le Conseil scientifique a présenté ses recommandations pour le déconfinement - Ouest-France", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMimQFodHRwczovL3d3dy5vdWVzdC1mcmFuY2UuZnIvc2FudGUvdmlydXMvY29yb25hdmlydXMvZGlyZWN0LWNvcm9uYXZpcnVzLWxlLWNvbnNlaWwtc2NpZW50aWZpcXVlLXByZXNlbnRlLXNlcy1yZWNvbW1hbmRhdGlvbnMtcG91ci1sZS1kZWNvbmZpbmVtZW50LTY4MTc4NTHSAZkBaHR0cHM6Ly9hbXAub3Vlc3QtZnJhbmNlLmZyL3NhbnRlL3ZpcnVzL2Nvcm9uYXZpcnVzL2RpcmVjdC1jb3JvbmF2aXJ1cy1sZS1jb25zZWlsLXNjaWVudGlmaXF1ZS1wcmVzZW50ZS1zZXMtcmVjb21tYW5kYXRpb25zLXBvdXItbGUtZGVjb25maW5lbWVudC02ODE3ODUx?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T06:40:59Z", "content": null}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": null, "title": "StopCovid : être prêts le 11 mai sera un défi, selon Cédric O - Le Monde", "description": "« Il y a encore plusieurs problèmes techniques à résoudre » concernant l’application qui doit permettre de tracer les contacts avec des personnes diagnostiquées positives au coronavirus.", "url": "https://www.lemonde.fr/pixels/article/2020/04/26/stopcovid-etre-prets-le-11-mai-sera-un-defi-selon-cedric-o_6037789_4408996.html", "urlToImage": null, "publishedAt": "2020-04-26T05:41:29Z", "content": "La mise au point pour le 11 mai de lapplication StopCovid, qui doit permettre de tracer les contacts avec des personnes diagnostiquées positives au coronavirus, constitue « un défi », souligne, dimanche 26 avril, le secrétaire dEtat au numérique, Cédric O. « … [+3201 chars]"}, {"source": {"id": null, "name": "Sudouest.fr"}, "author": "Sud Ouest", "title": "Déconfinement : les principales recommandations du Conseil scientifique - Sud Ouest", "description": "Alors qu’Édouard Philippe doit présenter mardi son plan de déconfinement, le Conseil scientifique, chargé de conseiller le gouvernement sur la gestion de l’épidémie, a rendu publics plusieurs avis sur les mesures à adopter pour le déconfinement.", "url": "https://www.sudouest.fr/2020/04/26/deconfinement-les-principales-recommandations-du-conseil-scientifique-7439697-10861.php", "urlToImage": null, "publishedAt": "2020-04-26T05:21:37Z", "content": "Déplacements possibles entre régions mais déconseillés à l’étranger, masques obligatoires au collège et au lycée, maintien du télétravail : le Conseil scientifique chargé d’éclairer le gouvernement a livré samedi ses recommandations pour une \"levée progressiv… [+4488 chars]"}, {"source": {"id": null, "name": "Footballclubdemarseille.fr"}, "author": "La Redaction FC Marseille", "title": "Mercato OM : Thauvin met les choses au clair concernant son avenir ! - Football Club de Marseille", "description": "Ce samedi soir, Florian Thauvin était en live sur son compte Instagram avec Malik Bentalha. L'ailier de l'OM a", "url": "https://www.footballclubdemarseille.fr/om-fil-info/mercato-om-thauvin-met-les-choses-au-clair-concernant-son-avenir.html", "urlToImage": null, "publishedAt": "2020-04-26T03:10:26Z", "content": "Ce samedi soir, Florian Thauvin était en live sur son compte Instagram avec Malik Bentalha. L’ailier de l’OM a affirmé qu’il resterait à Marseille !\r\nAprès toutes les rumeurs venant d’Italie affirmant qu’il était proche de l’AS Roma, Florian Thauvin a décidé … [+883 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Des tensions entre Mbappé et le PSG ? - Sports.fr", "description": "Les dernières manigances des dirigeants parisiens n’auraient pas été du goût de Kylian Mbappé. Si confinement oblige, les joueurs parisiens sont au chômage technique, obligés de se contenter de séances individuelles à leur domicile, leurs dirigeants du PSG ne…", "url": "https://www.sports.fr/football/tensions-entre-mbappe-psg-349660.html", "urlToImage": null, "publishedAt": "2020-04-26T03:00:27Z", "content": "Les dernières manigances des dirigeants parisiens nauraient pas été du goût de Kylian Mbappé.\r\nSi confinement oblige, les joueurs parisiens sont au chômage technique, obligés de se contenter de séances individuelles à leur domicile, leurs dirigeants du PSG ne… [+1469 chars]"}, {"source": {"id": null, "name": "Huffingtonpost.fr"}, "author": "Maxime Bourdeau", "title": "Donald Trump, après le \"désinfectant\", redoute les points presse - Le HuffPost", "description": "Après 50 points presse en deux mois, Donald Trump n'a pas tenu de conférence ce samedi et n'a pas l'air pressé de revenir face aux journalistes pour parler coronavirus.", "url": "https://www.huffingtonpost.fr/entry/donald-trump-apres-le-desinfectant-redoute-les-points-presse_fr_5ea4ef80c5b6f96398160520", "urlToImage": null, "publishedAt": "2020-04-26T02:56:59Z", "content": "ÉTATS-UNIS - Le dérapage de trop? Quarante-huit heures après avoir créé une polémique mondiale et engendré bon nombre de moqueries en suggérant de traiter le Covid-19 au désinfectant, Donald Trump a tweeté ce samedi 25 avril que ses points presse quotidiens s… [+2231 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": null, "title": "Coronavirus : 22 614 morts en France, le conseil scientifique dévoile son avis sur le déconfinement - Le Monde", "description": "Après un week-end de consultations, le gouvernement révélera mardi son plan pour permettre à la France de sortir du confinement le 11 mai.", "url": "https://www.lemonde.fr/planete/article/2020/04/26/coronavirus-22-614-morts-en-france-le-conseil-scientifique-devoile-son-avis-sur-le-deconfinement_6037790_3244.html", "urlToImage": null, "publishedAt": "2020-04-26T01:30:06Z", "content": "La rue de Rivoli, à Paris, en plein confinement, samedi 25 avril. Michel Euler / AP\r\n<ul><li>Bilan journalier de morts le plus faible dans les hôpitaux depuis un mois\r\n</li></ul>Lépidémie de Covid-19 a fait au moins 22 614 morts en France, avec 369 nouveaux d… [+5733 chars]"}, {"source": {"id": null, "name": "Huffingtonpost.fr"}, "author": "Maxime Bourdeau", "title": "Masques, seniors, télétravail... L'avis du Conseil scientifique sur le déconfinement - Le HuffPost", "description": "Les recommandations des experts au gouvernement pour une “levée progressive et contrôlée du confinement” à partir du 11 mai.", "url": "https://www.huffingtonpost.fr/entry/masques-seniors-teletravail-lavis-du-conseil-scientifique-sur-le-deconfinement_fr_5ea4c8f5c5b6d3763590a65c", "urlToImage": null, "publishedAt": "2020-04-26T00:02:42Z", "content": "CORONAVIRUS - Déplacements possibles entre régions mais déconseillés à l’étranger, masques obligatoires au collège et au lycée, maintien du télétravail: le Conseil scientifique chargé d’éclairer le gouvernement a livré ce samedi 25 avril  ses recommandations … [+5080 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Le Figaro avec Reuters", "title": "Boris Johnson reprendra le travail lundi - Le Figaro", "description": null, "url": "http://www.lefigaro.fr/international/boris-johnson-reprendra-le-travail-lundi-20200425", "urlToImage": null, "publishedAt": "2020-04-25T21:33:00Z", "content": "Le premier ministre britannique Boris Johnson, remis d'une grave infection au coronavirus, reprendra le travail lundi, a annoncé samedi une porte-parole de Downing Street.\r\nAgé de 55 ans, Boris Johnson, testé positif au coronavirus le 26 mars, a dû être hospi… [+463 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Covid-19 : le bilan au Royaume-Uni dépasse les 20 000 morts - FRANCE 24", "description": "Selon le dernier bilan publié samedi par le ministère de la Santé, le coronavirus a causé la mort de plus de 20 000 patients dans les hôpitaux britanniques. ...", "url": "https://www.youtube.com/watch?v=bnN1F6GKXBg", "urlToImage": null, "publishedAt": "2020-04-25T21:23:22Z", "content": null}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Emma Vanpoulle", "title": "The Voice 2020 - Les KO : Pascal Obispo, intransigeant, multiplie les piques - Pure People", "description": "Suite et fin des KO dans \"The Voice\". Samedi 25 avril 2020, c'est Pascal Obispo qui a clôturé cette épreuve en faisant passer son équipe de sept talents... à seulement trois. Quels talents l'ont convaincu et ont rejoint ceux de ses camarades en demi-finale ? …", "url": "https://www.purepeople.com/article/the-voice-2020-les-ko-pascal-obispo-intransigeant-multiplie-les-piques_a385562/1", "urlToImage": null, "publishedAt": "2020-04-25T20:40:00Z", "content": "Après des semaines de compétition, l'étau se resserre dansThe Voice. Samedi 25 avril 2020, les coachs ont vécu une nouvelle et ultime soirée des KO. Après les choix déchirants établis par Marc Lavoine, puis ceux d'Amel Bent et enfin Lara Fabian, ce fut au tou… [+10521 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "20 Minutes avec AFP", "title": "Coronavirus : Edouard Philippe présentera le plan de déconfinement à l'Assemblée mardi à 15 heures - 20 Minutes", "description": "Le confinement en raison de l’épidémie de coronavirus avait été lancé en France le 17 mars", "url": "https://www.20minutes.fr/societe/2767739-20200425-coronavirus-edouard-philippe-presentera-plan-deconfinement-assemblee-mardi-15-heures", "urlToImage": null, "publishedAt": "2020-04-25T20:09:48Z", "content": "Le Premier ministre Edouard Philippe. AFP\r\nUne prise de parole très attendue. Edouard Philippe présentera mardi à 15 heures devant lAssemblée nationale « la stratégie nationale du plan de déconfinement » qui doit débuter le \r\n11 mai, a annoncé ce samedi Matig… [+1519 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Benjamin Lecomte (Monaco) : « J'envoie ma force et mon courage à Junior Sambia » - Foot - Coronavirus - L'Équipe.fr", "description": "Lors d'un live Instagram avec le journaliste de « L'Équipe » Hugo Guillemet, le gardien de but monégasque a tenu à témoigner son soutien à son ancien coéquipier Junior Sambia, touché par le coronavirus.", "url": "https://www.lequipe.fr/Football/Actualites/Benjamin-lecomte-monaco-j-envoie-ma-force-et-mon-courage-a-junior-sambia/1129790", "urlToImage": null, "publishedAt": "2020-04-25T20:09:27Z", "content": "Benjamin Lecomte (Monaco) : « Je voudrais envoyer toute ma force et mon courage à Junior (Sambia) et à ses proches, et lui dire que je le soutiens. Cela fait toujours bizarre quand c'est un joueur avec qui l'on a joué qui attrape le coronavirus et qui est hos… [+222 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Coronavirus : les signalements d'effets indésirables des traitements en hausse - RTL.fr", "description": "300 cas d'effets indésirables liés aux traitements testés contre le Covid-19 ont été signalés ces dernières semaines.", "url": "https://www.rtl.fr/actu/bien-etre/coronavirus-les-signalements-d-effets-indesirables-des-traitements-en-hausse-7800442761", "urlToImage": null, "publishedAt": "2020-04-25T19:11:00Z", "content": "\"Au 22 avril 2020, 321 cas d'effets indésirables ont été déclarés en lien avec une infection au Covid-19, dont 80% de cas graves\", détaille l'Agence nationale de sécurité du médicament, qui avait annoncé une centaine de cas le 10 avril.\r\nDans les deux tiers d… [+1763 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "Covid-19 : qui sera testé après le 11 mai ? - Franceinfo", "description": "", "url": "https://www.francetvinfo.fr/sante/maladie/coronavirus/covid-19-qui-sera-teste-apres-le-11-mai_3934575.html", "urlToImage": null, "publishedAt": "2020-04-25T18:58:10Z", "content": "Le ministre de la Santé, Olivier Véran, était en visite dans un laboratoire danalyses de Seine-Saint-Denis, samedi 25 avril. Une manière de dire quen matière de dépistages, la France est enfin prête à passer la vitesse supérieure. 150 000 tests sont réalisés … [+843 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Déconfinement : derniers arbitrages lundi à l’Elysée avant le vote à l’Assemblée mardi - Le Parisien", "description": "Le plan sera finalisé lundi par le président de la République après un déjeuner avec son premier ministre, selon nos informations. Après ces", "url": "http://www.leparisien.fr/politique/deconfinement-macron-decide-lundi-25-04-2020-8305881.php", "urlToImage": null, "publishedAt": "2020-04-25T18:57:00Z", "content": "Les derniers arbitrages vont être rendus lundi soir ou mardi matin au plus tard par le président de la République. Lors de son allocution du 13 avril il avait promis que le plan de déconfinement serait présenté sous quinze jours. Nous y sommes. Par conséquent… [+2058 chars]"}, {"source": {"id": null, "name": "Presse-citron.net"}, "author": "Hadrien Augusto", "title": "Amazon perd face à la justice française, quelles conséquences sur les commandes ? - Presse-citron", "description": "Le géant du e-commerce a perdu son appel vendredi, laissant place à de nombreux doutes pour les clients et les employés.", "url": "https://www.presse-citron.net/amazon-justice-consequences-sur-les-commandes/", "urlToImage": null, "publishedAt": "2020-04-25T17:34:19Z", "content": "La cour dappel de Versailles vient de confirmer lordonnance du 14 avril du tribunal de Nanterre, dans laquelle il a été décidé quAmazon sen tienne à la distribution de produits essentiels pendant lépidémie de coronavirus. La décision, pour laquelle Amazon Fra… [+2332 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Guadeloupe 1ère", "title": "Coronavirus : toujours 149 cas confirmés par test PCR en Guadeloupe, un patient évacué par le Dixmude - Guadel - Outre-mer la 1ère", "description": "Le nombre de cas cumul&eacute;s et confirm&eacute;s par test PCR en Guadeloupe est toujours de 149 cas. Pas de nouveau cas enregistr&eacute; officiellement, selon le dernier bilan communiqu&eacute; pa", "url": "https://la1ere.francetvinfo.fr/guadeloupe/coronavirus-toujours-149-cas-confirmes-par-test-pcr-en-guadeloupe-pas-de-nouveau-cas-826638.html", "urlToImage": null, "publishedAt": "2020-04-25T17:29:25Z", "content": "Selon le dernier bilan publié par l'Agence Régionale de Santé, il n'y a pas de nouveau cas recensé chez nous ces dernières 24h. Le nombre de cas confirmés par test PCR (en données cumulées) en Guadeloupe est toujours de 149.Parmi ces cas confirmés, 12 patient… [+1629 chars]"}, {"source": {"id": null, "name": "Francebleu.fr"}, "author": "Sixtine Lys", "title": "Coronavirus : 369 morts de plus en 24 heures, le nombre de patients en réanimation continue de diminuer - France Bleu", "description": "124.114 personnes ont été contaminées en France, indique la direction générale de la Santé samedi dans un communiqué. 22.614 décès sont comptabilisés depuis le 1er mars.", "url": "https://www.francebleu.fr/infos/sante-sciences/coronavirus-369-morts-de-plus-en-24-heures-le-nombre-de-patients-en-reanimation-continue-de-diminuer-1587834475", "urlToImage": null, "publishedAt": "2020-04-25T17:10:10Z", "content": "Selon un nouveau bilan dévoilé par la direction générale de la Santé ce samedi soir, l'épidémie de Coronavirus a fait 22.614 décès depuis le 1er mars en France. C'est 369 morts de plus en 24 heures.\r\nL'épidémie a tué 14.050 personnes dans les hôpitaux, soit 1… [+564 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Premier League : Les joueurs de Chelsea conservent l'intégralité de leurs salaires - Eurosport - FRANCE (FR)", "description": "PREMIER LEAGUE - Dans un communiqué publié samedi, Chelsea a annoncé que ses joueurs n'allaient pas subir de baisse de salaire en lien avec le Covid 19.", "url": "https://www.eurosport.fr/football/premier-league/2019-2020/premier-league-les-joueurs-de-chelsea-conservent-l-integralite-de-leurs-salaires_sto7734824/story.shtml", "urlToImage": null, "publishedAt": "2020-04-25T16:55:14Z", "content": "Si leurs voisins d'Arsenal ont récemment accepté de baisser leurs salaires de 12,5%, ce n'est pas la voie qu'ont décidé de prendre les joueurs de Chelsea. Dans un communiqué publié samedi, le club londonnien a fait un point sur une éventuelle réduction de sal… [+1035 chars]"}, {"source": {"id": null, "name": "Sudouest.fr"}, "author": "Sud Ouest", "title": "Centrale nucléaire du Blayais : pendant le coronavirus, les quatre réacteurs doivent continuer de tourner - Sud Ouest", "description": "Service public essentiel, la production d'électricité ne doit pas s'interrompre. Comme ses dix-huit cousines sur le sol français, la centrale nucléaire du Blayais s'est adaptée aux contraintes. Mais la consommation a fortement baissé en cette période de confi…", "url": "https://www.sudouest.fr/2020/04/25/coronavirus-et-centrale-du-blayais-les-quatre-reacteurs-de-la-centrale-doivent-continuer-a-tourner-7438989-705.php", "urlToImage": null, "publishedAt": "2020-04-25T16:22:09Z", "content": "Par Jean-Denis RenardPublié le 25/04/2020Mis à jour aujourd'hui à 8h32\r\nService public essentiel, la production d’électricité ne doit pas s’interrompre. Comme ses dix-huit cousines sur le sol français, la centrale nucléaire du Blayais s’est adaptée aux contra… [+596 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Margot Desmas", "title": "Grenoble : c'était quoi ces points scintillants qui ont traversé le ciel vendredi soir ? - France 3 Régions", "description": "Une drôle de ligne lumineuse s'est formée dans le ciel vendredi soir, ce qu'ont remarqué de nombreux Grenoblois. Il s'agit d'un train de satellites lancé par la firme américaine SpaceX. De nouveaux passages vont se produire samedi et dimanche soir.", "url": "https://france3-regions.francetvinfo.fr/auvergne-rhone-alpes/isere/grenoble/grenoble-c-etait-quoi-ces-points-scintillants-qui-ont-traverse-ciel-vendredi-soir-1820948.html", "urlToImage": null, "publishedAt": "2020-04-25T15:30:17Z", "content": "Dans la soirée du vendredi 24 avril, les habitants de Grenoble et des alentours étaient nombreux à s'étonner, sur les réseaux sociaux, de voir une série de points lumineux traverser le ciel de l'Isère. Un \"joli spectacle\" dont la provenance a fait douter cert… [+1553 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Etienne Froment pour 20 Minutes", "title": "Les avatars débarquent sur Facebook et dans Messenger - 20 Minutes", "description": "Les membres du réseau social Facebook peuvent désormais créer un avatar à leur image", "url": "https://www.20minutes.fr/high-tech/2765647-20200422-les-avatars-debarquent-sur-facebook-et-dans-messenger", "urlToImage": null, "publishedAt": "2020-04-25T14:43:35Z", "content": "Les avatars débarquent sur Facebook et dans Messenger Geeko\r\nDéjà disponible en Australie, la fonctionnalité de créer son avatar sur Facebook serait actuellement déployée massivement en Europe, selon TechCrunch. Sinspirant très ouvertement de \r\nBitmoji, propr… [+1396 chars]"}, {"source": {"id": null, "name": "Public.fr"}, "author": null, "title": "PHOTOS - Matt Pokora et Christina Milian organisent une pool party en plein confinement ! - Public.fr", "description": "Dur, dur le confinement à Los Angeles...", "url": "https://www.public.fr/Toutes-les-photos/PHOTOS-Matt-Pokora-et-Christina-Milian-organisent-une-pool-party-en-plein-confinement-1639787", "urlToImage": null, "publishedAt": "2020-04-25T12:35:00Z", "content": "Est-ce quil est possible de dire que les temps sont durs pour Matt Pokora ? Ces dernières semaines, le chanteur de 34 ans a dû faire le dos rond lorsque la tempête sest abattue sur lui. La pandémie de covid-19 a bouleversé le quotidien de milliards de personn… [+1674 chars]"}, {"source": {"id": "les-echos", "name": "Les Echos"}, "author": "Bruno Trévidic", "title": "Ben Smith : « Cette crise doit être pour Air France l'occasion de se réformer » - Les Échos", "description": "Dans un entretien aux Echos, le patron d'Air France-KLM, Benjamin Smith, détaille les hypothèses de sortie de crise et les conditions aux 7 milliards d'euros de prêts consentis par l'Etat. En contrepartie, Air France s'est engagée à accélérer son plan de tran…", "url": "https://www.lesechos.fr/industrie-services/tourisme-transport/ben-smith-cette-crise-doit-etre-pour-air-france-loccasion-de-se-reformer-1198117", "urlToImage": null, "publishedAt": "2020-04-25T12:30:10Z", "content": "Air France-KLM a obtenu de l'Etat français et des banques, 7 milliards d'euros sous forme de prêts pour Air France. Est-ce suffisant pour passer la crise et combien de temps pouvez-vous tenir ?\r\nJe tiens tout d'abord à remercier le gouvernement français, le m… [+702 chars]"}, {"source": {"id": null, "name": "Jeuxvideo.com"}, "author": "theholomovement", "title": "Animal Crossing New Horizons, bébètes d'avril : quelles espèces vont disparaître en mai ? - jeuxvideo.com", "description": "La fin du mois d'avril approche à grand pas. Et qui dit fin du mois dit changement dans la faune et la flore d'Animal Crossing : New Horizons. Après avoir passé le mois à la recherche d'oeufs cachés ou à profiter de la mise à jour 1.2.0 et notamment de l'ouve…", "url": "http://www.jeuxvideo.com/news/1216747/animal-crossing-new-horizons-bebetes-d-avril-quelles-especes-vont-disparaitre-en-mai.htm", "urlToImage": null, "publishedAt": "2020-04-25T11:57:10Z", "content": "La fin du mois d'avril approche à grand pas. Et qui dit fin du mois dit changement dans la faune et la flore d'Animal Crossing : New Horizons. Après avoir passé le mois à la recherche d'oeufs cachés ou à profiter de la mise à jour 1.2.0 et notamment de l'ouve… [+2142 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Marie-Amélie Druesne", "title": "Tous en cuisine avec Cyril Lignac : la liste des ingrédients de la semaine du 27 avril au 1er mai - Télé Loisirs.fr", "description": "Et si vous glissiez un peu de gourmand-croquant dans votre confinement ? Tous les soirs dans Tous en cuisine sur M6, Cyril Lignac cuisine en direct. Afin que vous puissiez vous organiser, voici toute la liste des ingrédients pour les recettes du 27 avril au 1…", "url": "https://www.programme-tv.net/news/tv/253604-tous-en-cuisine-avec-cyril-lignac-la-liste-des-ingredients-de-la-semaine-du-27-avril-au-1er-mai/", "urlToImage": null, "publishedAt": "2020-04-25T11:48:07Z", "content": "Faire à manger midi et soir Cela un véritable casse-tête pour beaucoup de trouver de nouvelles idées gourmandes et équilibrées ! Et si vous vous lanciez dans les recettes d'un grand chef ? Tous les soirs dans Tous en cuisine depuis le début du confinement sur… [+5144 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Anne-Laure Deparis", "title": "Koh-Lanta : Delphine révèle à Denis Brogniart pourquoi elle a gardé son collier d'immunité au lieu de le donne - Télé Loisirs.fr", "description": "Delphine est revenue sur son aventure dans Koh-Lanta, l'île des héros dans le live Instagram de Denis Brogniart ce vendredi 24 avril. La candidate éliminée lors de la réunion des ambassadeurs a dévoilé les raisons qui l'ont poussée à conserver son collier d'i…", "url": "https://www.programme-tv.net/news/evenement/koh-lanta-koh-lanta-lile-des-heros/253602-koh-lanta-delphine-revele-a-denis-brogniart-pourquoi-elle-a-garde-son-collier-dimmunite-au-lieu-de-le-donner-a-charlotte/", "urlToImage": null, "publishedAt": "2020-04-25T10:38:35Z", "content": "C'est devenu un rendez-vous des mordus de Koh-Lanta presque au même titre que la diffusion hebdomadaire de l'émission sur TF1. Chaque soir depuis le début du confinement, Denis Brogniart s'entretient avec un ancien participant du jeu d'aventures en live sur s… [+2194 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Jennifer Alberts", "title": "Coronavirus - L'Institut Pasteur étend son étude épidémiologique à Crépy-en-Valois aux enfants de 5 à 1 - France 3 Régions", "description": "Après une première étude épidémiologique fin mars auprès de 661 personnes reliées au lycée Jean-Monnet de Crépy-en-Valois dans l'Oise, l'Institut Pasteur va tester les 5-12 ans scolarisés dans la commune. Le but : comprendre comment elle est devenue le coeur …", "url": "https://france3-regions.francetvinfo.fr/hauts-de-france/oise/coronavirus-institut-pasteur-etend-son-etude-epidemiologiste-aux-enfants-5-12-ans-crepy-valois-1820800.html", "urlToImage": null, "publishedAt": "2020-04-25T09:36:36Z", "content": "Groupe CORSER-2. C'est le nom de la deuxième phase de l'étude épidémiologique de l'Institut Pasteur à Crépy-en-Valois dans l'Oise. Cette fois-ci, ce sont les enfants de 5 à 12 ans, scolarisés dans la commune, et leurs parents qui sont ciblés, après avoir test… [+4089 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": "Arnaud Leparmentier", "title": "Coronavirus : Jeff Bezos, sujet incontournable en temps de crise - Le Monde", "description": "La mise en confinement des économies avec son cortège de boutiques et centres commerciaux fermés a placé Amazon au centre du jeu. Avec à la clé des couacs. Mais l’occasion est belle pour son fondateur de tenter de restaurer son image.", "url": "https://www.lemonde.fr/economie/article/2020/04/25/coronavirus-jeff-bezos-sujet-incontournable-en-temps-de-crise_6037743_3234.html", "urlToImage": null, "publishedAt": "2020-04-25T08:04:12Z", "content": "Jeff Bezos, le 6 juin 2019 à Las Vegas. John Locher / AP\r\nLépidémie de coronavirus est survenue, et Amazon était là. Plus puissante que jamais. Dans une Amérique confinée, lentreprise fondée par Jeff Bezos a changé de nature. Lancienne librairie Internet de S… [+3433 chars]"}, {"source": {"id": null, "name": "Actu.fr"}, "author": "Thibaut Calatayud", "title": "Coronavirus. Toulouse est-elle prête à accueillir une deuxième vague après le confinement ? - actu.fr", "description": "Au CHU de Toulouse, l'activité liée au Covid-19 continue de baisser. Mais l'arrivée probable d'une seconde vague après le confinement pourrait-elle mettre le CHU en délicatesse ?", "url": "https://actu.fr/occitanie/toulouse_31555/coronavirus-toulouse-prete-accueillir-deuxieme-vague-apres-confinement_33235279.html", "urlToImage": null, "publishedAt": "2020-04-25T06:06:02Z", "content": "L’activité du CHU de Toulouse liée au coronavirus continue de baisser. (©Adobe Stock)\r\n« L’activité Covid continue à décroître, lentement, mais de façon certaine », constate Marc Penaud, le directeur général du CHU de Toulouse. Le plateau observé depuis déjà … [+7028 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Coronavirus : le Conseil scientifique recommande le port du masque dès le collège - Le Parisien", "description": "Le Conseil scientifique, qui a diffusé une note sur la reprise des cours après le 11 mai, suggère notamment des mesures similaires à celles", "url": "http://www.leparisien.fr/societe/coronavirus-le-bilan-frole-les-200-000-morts-dans-le-monde-la-france-se-prepare-au-deconfinement-suivez-notre-direct-25-04-2020-8305587.php", "urlToImage": null, "publishedAt": "2020-04-25T05:42:00Z", "content": "&gt; L'essentiel :\r\n&gt; Les événements de la journée de samedi :\r\n23h25. C'est la fin de ce direct. Merci de nous avoir suivis ! Rendez-vous dès demain matin sur LeParisien.fr pour un nouveau suivi en direct de l'évolution de l'épidémie.\r\n23h15. Des dépistag… [+26909 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Sébastien Letard", "title": "Coronavirus Covid-19 : Ce que l'on sait (ou pas) de la rentrée scolaire le 11 mai en Bourgogne Franche-Comté - France 3 Régions", "description": "Les annonces se sont multipliées ces derniers jours : rentrée progressive, sur la base du volontariat. Sera-t-elle la même à Nevers et à Belfort ? Dans un village ou en ville ? Quelles précautions sanitaires ? La cantine, les transports scolaires seront-ils a…", "url": "https://france3-regions.francetvinfo.fr/bourgogne-franche-comte/coronavirus-covid-19-ce-que-on-sait-pas-rentree-scolaire-11-mai-bourgogne-franche-comte-1820564.html", "urlToImage": null, "publishedAt": "2020-04-24T18:32:06Z", "content": "Depuis mardi 21 avril, le ministère de l'Education Nationale et l'Elysée distillent les informations sur les conditions de la rentrée scolaire prévue le 11 mai. Ce vendredi 24 avril, la rectrice de Dijon et le recteur de Besançon ont apporté de nouvelles préc… [+7630 chars]"}, {"source": {"id": null, "name": "Consomac.fr"}, "author": "Sylvain Rogelet", "title": "Une nouvelle suite de caractères fait planter l'iPhone - Consomac", "description": "Deux ans après le bug de la lettre télougou qui faisait planter l'application iMessage, voilà une nouvelle chaîne de caractères qui fait totalement planter iOS lorsqu'elle apparaît dans une notification, obligeant l'utilisateur recevant le message à redémarre…", "url": "https://consomac.fr/news-12377-une-nouvelle-suite-de-caracteres-fait-planter-ios.html", "urlToImage": null, "publishedAt": "2020-04-24T13:46:00Z", "content": "Deux ans après le bug de la lettre télougou qui faisait planter l'application iMessage, voilà une nouvelle chaîne de caractères qui fait totalement planter iOS lorsqu'elle apparaît dans une notification, obligeant l'utilisateur recevant le message à redémarre… [+741 chars]"}]}