{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Matt Dathan", "title": "Premier League football to return ‘within weeks’ with games behind closed doors but may be shown on fre - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/11476053/premier-league-return-back-tv-within-weeks/", "urlToImage": null, "publishedAt": "2020-04-25T16:45:58Z", "content": "PREMIER League football could be back on TV within weeks in a major boost for bored Brits.Boris Johnson has been briefed on plans for matches to be played behind closed doors and sees the resumption of live sport as key to boosting the morale of the nation af… [+9612 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sophie Tanno Chris Jewers For Mailonline", "title": "China sends medics to North Korea amid claims in Japanese media Kim Jong Un is in a vegetative state - Daily Mail", "description": "A Japanese news outlet has claimed on Friday that North Korea's dictator is currently in a 'vegetative state' after having heart surgery earlier in the month, with medics sent from China to treat him.", "url": "https://www.dailymail.co.uk/news/article-8256791/China-sends-medics-North-Korea-amid-claims-Japanese-media-Kim-Jong-vegetative-state.html", "urlToImage": null, "publishedAt": "2020-04-25T16:45:14Z", "content": "China has dispatched a team to North Korea including medical experts to advise on North Korean leader Kim Jong Un, according to three people familiar with the situation.\r\nThe trip by the Chinese doctors and officials comes amid conflicting reports about the h… [+6192 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Darren Boyle Milly Vincent For Mailonline", "title": "Fury at Dominic Cummings' wife using BBC Radio 4's Thought For The Day - Daily Mail", "description": "Mary Wakefield, wife of Dominic Cummings said her husband raced home when she developed Covid-19 during her broadcast on BBC Radio 4's Thought For The Day.", "url": "https://www.dailymail.co.uk/news/article-8256551/Fury-Dominic-Cummings-wife-using-BBC-Radio-4s-Thought-Day.html", "urlToImage": null, "publishedAt": "2020-04-25T16:45:06Z", "content": "The wife of Prime Minster Boris Johnson's chief advisor described her husband Dominic Cummings as 'extremely kind' during this morning's Thought For The Day on BBC Radio 4. \r\nMary Wakefield, who is the commissioning editor of The Spectator spoke about their b… [+7641 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Danya Bazaraa", "title": "Coronavirus: Sick criminals try to smuggle £1m of cocaine into UK in face masks - Mirror Online", "description": "The UK's coronavirus death toll in hospitals has passed 20,000 after a rise of 797 deaths - NHS England confirmed 711 deaths, with the youngest being a 34-year-old with no known underlying health conditions", "url": "https://www.mirror.co.uk/news/politics/breaking-coronavirus-sick-criminals-try-21925812", "urlToImage": null, "publishedAt": "2020-04-25T16:41:47Z", "content": "Priti Patel has revealed that criminals attempting to smuggle £1million worth of cocaine into the UK in face masks had been stopped.\r\nSpeaking in today's government press briefing, the Home Secretary said that last week Border Force found £1million worth of c… [+7012 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Kate Mcgreavy For Mailonline", "title": "Mike Phelan on how Ole Gunnar Solskjaer is showing shades of Sir Alex Ferguson - Daily Mail", "description": "Phelan took part in a Q&A on Twitter on Friday night on the official account of the Manchester Football Association. Fans asked a host of questions to Sir Alex Ferguson's old No 2.", "url": "https://www.dailymail.co.uk/sport/football/article-8256549/Mike-Phelan-Ole-Gunnar-Solskjaer-showing-shades-Sir-Alex-Ferguson.html", "urlToImage": null, "publishedAt": "2020-04-25T16:28:58Z", "content": "Manchester United assistant manager Mike Phelan has explained how United boss Ole Gunnar Solskjaer is showing shades of Sir Alex Ferguson in his management.\r\nPhelan took part in a Q&amp;A on Twitter on Friday night on the official account of the Manchester Fo… [+2346 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Annita Katee For Dailymail.com", "title": "Lily-Rose Depp and Timothee Chalamet call it quits after one year of dating - Daily Mail", "description": "Lily-Rose Depp and Timothee Chalamet have called it quits on their relationship after dating for one year. The pair were last spotted on a dinner date in October 2019 in Los Angeles.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8256735/Lily-Rose-Depp-Timothee-Chalamet-call-quits-one-year-dating.html", "urlToImage": null, "publishedAt": "2020-04-25T16:24:28Z", "content": "Lily-Rose Depp, 20, and Timothee Chalamet, 24, have split after one year of dating. \r\nThe pair were last spotted together in late October on a dinner date in Los Angeles. \r\nA source told Us Weekly on Saturday that the duo had officially called time on their r… [+1737 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Tata Steel 'needs £500m government support' - BBC News", "description": "The £50m cap on UK government loans is about 10% of what Tata Steel needs, says MP Stephen Kinnock.", "url": "https://www.bbc.com/news/uk-wales-52426525", "urlToImage": null, "publishedAt": "2020-04-25T15:05:48Z", "content": "Image copyrightGetty ImagesImage caption\r\n Tata Steel runs the UK's largest steel works in Port Talbot\r\nTata Steel needs about £500m of government support to get through the coronavirus pandemic, the MP for Aberavon Stephen Kinnock has said.\r\nTata employs 8,3… [+1482 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Greg Heffer", "title": "Coronavirus: Experts once said 20,000 deaths was a 'good outcome' - so where is the UK headed now? - Sky News", "description": "With the UK having passed the level that was previously considered a \"good result\" - how many deaths could there now be?", "url": "https://news.sky.com/story/coronavirus-experts-once-said-20-000-deaths-was-a-good-outcome-so-where-is-the-uk-headed-now-11978609", "urlToImage": null, "publishedAt": "2020-04-25T14:35:31Z", "content": null}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Harrison Jones", "title": "Gun fired and arrest made at chaotic funeral which flouted lockdown rules - Metro.co.uk", "description": "The man arrested for attempted murder had been stabbed.", "url": "https://metro.co.uk/2020/04/25/gun-fired-arrest-made-chaotic-funeral-flouted-lockdown-rules-12609233/", "urlToImage": null, "publishedAt": "2020-04-25T14:29:54Z", "content": "Police at the scene at Gorton Cemetery, Manchester, yesterday (Picture: Manchester Evening News)\r\nThe chaotic funeral of a known criminal resulted in a man being arrested after a gun was fired, as hundreds of mourners broke lockdown rules to gather in Manches… [+2824 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Coronavirus: UK hospital deaths rise by 813, taking total to 20,319 - Sky News", "description": "The figures show 8 April continues to have the highest number for the most hospital deaths on a single day, with 855.", "url": "https://news.sky.com/story/coronavirus-uk-hospital-deaths-rise-by-813-taking-total-to-20-319-11978678", "urlToImage": null, "publishedAt": "2020-04-25T14:26:30Z", "content": null}, {"source": {"id": null, "name": "Theguardian.comfootball"}, "author": "Paul Wilson", "title": "Chelsea fail to reach agreement with players in ongoing wage reduction talks - The Guardian", "description": "Chelsea have still not reached an agreement with their first-team players over pay cuts after rejecting a proposed reduction put forward by captain César Azpilicueta", "url": "https://amp.theguardian.comfootball/2020/apr/25/chelsea-first-team-players-coronavirus-wage-cut-talks-cesar-azpilicueta", "urlToImage": null, "publishedAt": "2020-04-25T14:24:00Z", "content": "Chelsea have still not reached an agreement with their first team players over pay cuts after rejecting a proposal put forward by the club captain César Azpilicueta.\r\nThe club insists negotiations are both amicable and continuing, but after originally asking … [+2470 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Lucy Needham", "title": "Richard Sanders dead: Former Radio 4 presenter dies from coronavirus at 62 - Mirror Online", "description": "BBC Radio 4's Charlotte Smith announced the news to listeners on her show today", "url": "https://www.mirror.co.uk/3am/celebrity-news/breaking-richard-sanders-dead-ex-21925652", "urlToImage": null, "publishedAt": "2020-04-25T14:19:31Z", "content": "Former Radio 4 presenter Richard Sanders has died from coronavirus at the age of 62.\r\nThe former host of Farming Today contracted the deadly bug while in hospital, the show's current anchor Charlotte Smith told listeners today.\r\nAnnouncing the news, Charlotte… [+789 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Immunity passports ‘could increase virus spread’ - BBC News", "description": "No evidence people who develop antibodies after recovering are protected against a second infection.", "url": "https://www.bbc.com/news/world-52425825", "urlToImage": null, "publishedAt": "2020-04-25T13:40:47Z", "content": "Image copyrightReutersImage caption\r\n Testing for antibodies is becoming more widespread\r\nGovernments should not issue so-called \"immunity passports\" or \"risk-free certificates\" as a way of easing lockdowns, the World Health Organization (WHO) says.\r\nIt said … [+4744 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "David Smith, Kari Paul", "title": "Debacle of Trump's coronavirus disinfectant comments could be tipping point - The Guardian", "description": "The US president plans to ‘pare back’ his daily coronavirus briefings after falsely claiming his suggestion to ingest cleaning products had been ‘sarcastic’", "url": "https://www.theguardian.com/us-news/2020/apr/25/donald-trump-coronavirus-disinfectant-sarcastic-tipping-point", "urlToImage": null, "publishedAt": "2020-04-25T13:20:40Z", "content": "For Donald Trump, it was the strangest and most news-making thing he could have done: instead of taking questions from journalists, dominating the nations airwaves yet again, the US president gave a short pre-written statement and then stalked off the stage.\r… [+6803 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Lockdown should ease to help economy, says Philip Hammond - BBC News", "description": "The former chancellor warns that the economy \"won't survive\" waiting for a vaccine to be developed.", "url": "https://www.bbc.co.uk/news/uk-politics-52425460", "urlToImage": null, "publishedAt": "2020-04-25T13:03:00Z", "content": "Image copyrightGetty ImagesImage caption\r\n Cafes and shops closed in Brixton market, south London.\r\nFormer chancellor Philip Hammond has urged the government to set out its plan to restart the economy. \r\nMinisters have been reluctant to discuss a lockdown exi… [+2509 chars]"}, {"source": {"id": null, "name": "Gov.scot"}, "author": "The Scottish Government", "title": "Coronavirus (COVID-19): testing for key workers in Scotland - Scottish Government News", "description": "Guidance on coronavirus testing for key workers who are showing symptoms.", "url": "https://www.gov.scot/publications/coronavirus-covid-19-testing-for-key-workers-in-Scotland/", "urlToImage": null, "publishedAt": "2020-04-25T12:11:15Z", "content": "Testing of key workers\r\nThe UK government has established a new network of Covid testing facilities for key workers. This programme runs alongside the existing programme of testing in the NHS for clinical purposes and testing of key workers in health and soci… [+8940 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Olivia Petter", "title": "Anzac Day 2020: How to make Anzac biscuits - The Independent", "description": "Anzac Day is observed on 25 April every year", "url": "https://www.independent.co.uk/life-style/food-and-drink/anzac-day-cookies-recipe-how-to-make-smallseed-a9483741.html", "urlToImage": null, "publishedAt": "2020-04-25T11:24:26Z", "content": "Every year, Anzac Day is observed on 25 April to honour members of the Australian and New Zealand Army Corps (Anzac) who lost their lives in foreign conflicts.\r\nAnzac biscuits were originally baked and sent to the Anzacs serving in Gallipoli, and are a core p… [+1512 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By James Wood For Mailonline", "title": "New figures show number of people visiting UK's A&E wards down by half this month - Daily Mail", "description": "Health officials are worried many people are not seeking treatment because they fear contracting Covid-19, thereby jeopardising their survival and potentially becoming collateral damage.", "url": "https://www.dailymail.co.uk/news/article-8256237/New-figures-number-people-visiting-UKs-E-wards-half-month.html", "urlToImage": null, "publishedAt": "2020-04-25T11:23:22Z", "content": "The NHS is launching a new campaign to make sure people seek urgent care during a medical emergency after visits to A&amp;E dropped by almost 50 per cent this month.\r\nHealth officials are worried many people are not seeking treatment because they fear contrac… [+23274 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: India allows small shops to reopen - BBC News", "description": "Only half of staff are allowed to work and must take precautions such as wearing face masks.", "url": "https://www.bbc.co.uk/news/world-asia-india-52423474", "urlToImage": null, "publishedAt": "2020-04-25T10:41:24Z", "content": "Image copyrightAFPImage caption\r\n Millions of Indian households depend on neighbourhood shops for essentials\r\nIndia has allowed small local stores to reopen more than a month after the country went into lockdown because of the coronavirus pandemic.\r\nThe inter… [+2322 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Lucy Campbell", "title": "Coronavirus UK: test slots run out for second day running – latest updates - The Guardian", "description": "Questions over independence of Sage group come as UK death toll nears 20,000", "url": "https://www.theguardian.com/world/live/2020/apr/25/coronavirus-uk-calls-for-transparency-over-scientific-advice-to-ministers-latest-updates", "urlToImage": null, "publishedAt": "2020-04-25T10:41:00Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Oli Smith", "title": "EU 'in denial' over Brexit - George Galloway exposes Brussels' desperate plot to stop exit - Express", "description": "GEORGE GALLOWAY has launched a scathing rebuke of the European Union's desperate attempt to cling onto the UK, claiming that Brussels are living 'in denial' over Brexit after top EU officials urged a two year delay to the exit.", "url": "https://www.express.co.uk/news/uk/1273741/EU-Brexit-talks-George-Galloway-Brussels-financial-bailout-Barnier-Boris-Johnson", "urlToImage": null, "publishedAt": "2020-04-25T09:41:51Z", "content": null}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Emma Brazell", "title": "Neighbours clap for care home nurse who died of coronavirus - Metro.co.uk", "description": "Locals surrounded the medic's house in Sutton to pay tribute to her during 'Clap For Carers' on Thursday.", "url": "https://metro.co.uk/2020/04/25/neighbours-clap-care-home-nurse-died-coronavirus-12608017/", "urlToImage": null, "publishedAt": "2020-04-25T09:15:17Z", "content": "Rahima Bibi Sidhanee, 69, brought so much love into this world (Picture: PA/Family Handout)\r\nNeighbours of a care home nurse who died after contracting coronavirus took to the streets to clap for her on Thursday.\r\nRahima Bibi Sidhanee, 69, who worked at Grenn… [+2246 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Stephen Warwick", "title": "EU states 'being completely held hostage by Google and Apple' says official - Android Central", "description": "Apple and Google have rebuffed calls from France and Germany to support their contact tracing apps, which use centralized data containing user information.", "url": "https://www.androidcentral.com/eu-states-being-completely-held-hostage-google-and-apple-says-official", "urlToImage": null, "publishedAt": "2020-04-25T09:10:59Z", "content": "An EU official has said that Apple and Google are holding EU states hostage after they rebuffed further calls to support contact tracing solutions offered by France and Germany.\r\nAs Reuters reports:\r\nA standoff between the two largest nations in the European … [+2171 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "West Indies 'flexible' on new Test dates against England - Sky Sports", "description": "Cricket West Indies says it is \"flexible\" about rearranging a Test tour of England but the governing body insists it will not jeopardise the safety of players.", "url": "https://www.skysports.com/cricket/news/12123/11978552/west-indies-flexible-on-new-test-dates-against-england", "urlToImage": null, "publishedAt": "2020-04-25T08:42:39Z", "content": "Cricket West Indies says it is \"flexible\" about rearranging a Test tour of England but the governing body insists it will not jeopardise the safety of players in order to complete the three-match series.\r\nIn a series that counts towards the World Test Champio… [+2902 chars]"}, {"source": {"id": null, "name": "Edp24.co.uk"}, "author": "Caroline Culot", "title": "Housebuilder Persimmon to restart homes in sites across Norfolk UK after coronavirus lockdown | Latest Norfolk and Suffolk Business News - Eastern Daily Press", "description": "Housebuilder Persimmon, which has sites across Norfolk, is implementing a phased restart of work after its coronavirus shutdown.", "url": "https://www.edp24.co.uk/business/persimmon-to-start-rebuilding-houses-norfolk-coronavirus-1-6623896", "urlToImage": null, "publishedAt": "2020-04-25T08:12:00Z", "content": "PUBLISHED: 09:12 25 April 2020 | UPDATED: 10:16 25 April 2020\r\nCaroline Culot\r\nPersimmon is planning a phased re-opening of its sites after the coronavirus shutdown. Pic: Persimmon/Archant\r\nIt comes as Taylor Wimpey also announced it was reopening sites earli… [+967 chars]"}, {"source": {"id": null, "name": "Digitalcameraworld.com"}, "author": "Louise Carey", "title": "iPhone 12: What we know so far about September 2020 iPhone release - Digital Camera World", "description": "The iPhone 12 is set to be announced in September, but what are we expecting from the latest iPhone generation?", "url": "https://www.digitalcameraworld.com/news/iphone-12-what-we-know-so-far-about-september-2020-iphone-release", "urlToImage": null, "publishedAt": "2020-04-25T07:02:00Z", "content": "With only a matter of months to go until Apple's traditional September iPhone launch event, the internet is already abuzz with rumors and speculation on what the iPhone 12 release is going to look like. With the 2019 iPhone 11 release leaving some feeling und… [+6204 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Zoe Wood", "title": "Will shoppers return to the UK high street after lockdown? - The Guardian", "description": "Retailers fear the coronavirus pandemic could permanently change consumer habits", "url": "https://www.theguardian.com/business/2020/apr/25/will-shoppers-return-to-the-uk-high-street-after-lockdown", "urlToImage": null, "publishedAt": "2020-04-25T06:03:46Z", "content": "Coronavirus has already triggered a wave of high street failures, from Oasis and Warehouse to Laura Ashley and Cath Kidston. Hundreds of thousands of retail workers have been furloughed, with the aim that they will return to the shop floor when stores are all… [+8636 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nAndrew Orlowski", "title": "Connecting the doubts over whether Hancock's coronavirus 'miracle app' is really the smart move - Telegraph.co.uk", "description": "The NHS hopes an app could be a game changer, but critics fear it may undermine the pandemic fight", "url": "https://www.telegraph.co.uk/business/2020/04/25/contact-tracing-could-halt-spread-virus-britons-unlikely-accept/", "urlToImage": null, "publishedAt": "2020-04-25T05:00:00Z", "content": "The problem, hardware engineers warn, is the integrity of the data on which the system would be based. Smartphones have four sources of data to help determine their location, and all have accuracy problems.\r\nThe civilian version of GPS only gives a four-metre… [+1365 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Manon Dark", "title": "Meghan Markle could face father in court as family tensions boil over - Express", "description": "MEGHAN MARKLE could face her father, Thomas Markle, in court over a dispute fuelled by an article published in the Mail on Sunday.", "url": "https://www.express.co.uk/news/royal/1273682/Meghan-Markle-royal-news-court-mail-on-sunday-sue-father-Thomas-Markle", "urlToImage": null, "publishedAt": "2020-04-25T04:53:13Z", "content": null}, {"source": {"id": null, "name": "Sky.com"}, "author": "Tom Gillespie", "title": "Kanye West: Hip hop star and fashion designer becomes a billionaire - Sky News", "description": "The rapper, who has long coveted the status, has claimed he is worth more after his net worth was valued at $1.3bn (£1.05bn).", "url": "https://news.sky.com/story/kanye-west-hip-hop-star-and-fashion-designer-becomes-a-billionaire-11978510", "urlToImage": null, "publishedAt": "2020-04-25T03:39:04Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Gursimran Hans", "title": "Trump’s new US Space Force to deploy surveillance telescope in Australia - Express.co.uk", "description": "THE US plans to construct a specialist space surveillance telescope at a facility in Western Australia.", "url": "https://www.express.co.uk/news/science/1273676/Space-news-USA-Australia-telescope-spy-track-debris-satellites", "urlToImage": null, "publishedAt": "2020-04-25T03:21:00Z", "content": null}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Luke Hurst", "title": "Hubble at 30: Take a look back at some of the telescope's best images - Euronews", "description": "The Hubble Space Telescope turned 30 on Friday, and to mark the occasion Hubble released a fittingly awesome image.", "url": "https://www.euronews.com/2020/04/24/hubble-turns-30-take-a-look-back-at-some-of-the-space-telescope-s-best-images", "urlToImage": null, "publishedAt": "2020-04-24T21:06:33Z", "content": "The Hubble Space Telescope turned 30 on Friday, and to mark the occasion Hubble released a fittingly awesome image. \r\nShowing two nebulas, NGC 2020 and NGC 2014, some 163,000 light years from Earth, the image reveals part of a vast star-forming region in the … [+1048 chars]"}, {"source": {"id": null, "name": "Playstationlifestyle.net"}, "author": null, "title": "Tequila Works CEO Impressed by DualSense Controller, Including Reportedly ‘Biometric Data Detection, Fingerprint Recognition’ - PlayStation LifeStyle", "description": "The Tequila Works CEO Raúl Rubio seems impressed by the DualSense controller features, particularly with regards to the sensory-centric upgrades. The interview may have also leaked unknown features like DualSense biometrics and fingerprint recognition.", "url": "https://www.playstationlifestyle.net/2020/04/24/tequila-works-ceo-dualsense-controller-features/", "urlToImage": null, "publishedAt": "2020-04-24T19:30:00Z", "content": "Tequila Works CEO Raúl Rubio has voiced his impressions with regards to next-gen hardware. The CEO most notably seems thrilled about PlayStation 5s recently unveiled DualSense controller. As far as Rubio is concerned, features such as haptic feedback and the … [+1969 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Harry Pettit", "title": "Starlink satellites tracker UK: Where are Elon Musk’s SpaceX satellites right now? - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11452340/starlink-satellites-tracker-uk/", "urlToImage": null, "publishedAt": "2020-04-24T15:21:07Z", "content": "STARGAZERS have another chance to witness a swarm fo satellites passing over Britain this evening.\r\nThe \"Starink\" satellites are operated by SpaceX, a company that hopes to one day beam Wi-Fi to people from space - and we've got all the tips you need to spot … [+8624 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Kevin Pocock", "title": "Sony’s WF-1000XM3 noise-cancelling headphones – £77 off, with Alexa BUILT IN - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11472205/sony-wf-1000xm3-noise-cancelling-headphones-bluetooth-deal-save/", "urlToImage": null, "publishedAt": "2020-04-24T13:39:03Z", "content": "OUT for exercise or at home enjoying some downtime, the right pair of headphones are a real bonus.\r\nThe best often require investment, and the Sony WF-1000XM3 set is one of them.\r\n The charging case should offer 3 additional full charges\r\nSonys premium WF-100… [+2068 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "UK announces new COVID-19 testing but website runs out in minutes - The Sun", "description": "The Government has now announced that they will be opening up testing to up to 10 million key workers and their households. Previously almost all tests were ...", "url": "https://www.youtube.com/watch?v=8D2a9i0EGpA", "urlToImage": null, "publishedAt": "2020-04-24T11:11:35Z", "content": null}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Test website closes after 'significant demand' - BBC News", "description": "Up to 10 million key workers and their households are eligible to book a test for coronavirus.", "url": "https://www.bbc.com/news/uk-52405852", "urlToImage": null, "publishedAt": "2020-04-24T10:48:10Z", "content": "Image copyrightGetty ImagesImage caption\r\n Key workers trying to book tests were met with this message from the middle of Friday morning\r\nThe new website for key workers to book coronavirus tests has temporarily closed - hours after being opened by the govern… [+9603 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Rob Powell, political correspondent, and Greg Heffer, political reporter", "title": "Coronavirus test applications closed after 5,000 home kits ordered in two minutes - Sky News", "description": "Downing Street reveals that 5,000 home-testing kits were ordered within two minutes of the new website opening.", "url": "https://news.sky.com/story/coronavirus-online-applications-for-covid-19-tests-temporarily-closed-due-to-huge-demand-11978070", "urlToImage": null, "publishedAt": "2020-04-24T10:11:24Z", "content": null}]}