{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Chris Kitching, Cate Cadell", "title": "Worldwide coronavirus death toll passes 200,000 - as confirmed cases close to 3m - Mirror Online", "description": "The UK's coronavirus hospital death toll has passed 20,000 but experts say the true total could be double that figure as it doesn't include fatalities in care homes, private homes or hospices", "url": "https://www.mirror.co.uk/news/world-news/breaking-worldwide-coronavirus-death-toll-21926741", "urlToImage": null, "publishedAt": "2020-04-25T18:44:57Z", "content": "Global deaths linked to the new strain of coronavirus have passed 200,000.\r\nConfirmed cases of the virus are expected to hit three million in coming days.\r\nMore than half of the fatalities have been reported by the United States, Spain and Italy.\r\nThe UK's ho… [+2960 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Chris Kitching", "title": "NHS boss' dire coronavirus warning as he calls 20,000 UK deaths 'very sad day' - Mirror Online", "description": "Professor Stephen Powis, the national medical director for England who had earlier said less than 20,000 deaths would be a \"good result\", claims the NHS hasn't been overwhelmed by the coronavirus crisis", "url": "https://www.mirror.co.uk/news/uk-news/nhs-boss-dire-coronavirus-warning-21926085", "urlToImage": null, "publishedAt": "2020-04-25T18:44:24Z", "content": "An NHS boss has issued a dire coronavirus warning after the UK's death toll passed 20,000 - a figure that he had earlier said would be a \"good result\".\r\nProfessor Stephen Powis, national medical director for England, said it was a \"very sad day\" for Britain a… [+3050 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Alex Richards", "title": "Diogo Jota crowned Premier League's best FIFA 20 player after five-day charity tournament - Mirror Online", "description": "The tournament, spread across five days, led to Wolves' Portuguese forward Diogo Jota meeting Liverpool's Trent Alexander-Arnold in the final of the ePremier League Invitational", "url": "https://www.mirror.co.uk/sport/football/news/breaking-premier-leagues-best-fifa-21926048", "urlToImage": null, "publishedAt": "2020-04-25T18:35:34Z", "content": "It was football, but not quite as we know it, as Wolves striker Diogo Jota was crowned the Premier League's best FIFA 20 player after claiming victory in the ePremier League invitational charity tournament.\r\nAfter a five-day tournament, he claimed a golden go… [+2465 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jason Groves Political Editor For The Daily Mail Amie Gordon Jack Elsom Jack Wright For Mailonline", "title": "Brits emerge from lockdown as new figures show rise in people outdoors - Daily Mail", "description": "The British public are hitting the roads again this weekend as new figures show traffic congestion is steadily rising as people emerg from an enforced hibernation to breach strict lockdown rules.", "url": "https://www.dailymail.co.uk/news/article-8256435/Brits-emerge-lockdown-new-figures-rise-people-outdoors.html", "urlToImage": null, "publishedAt": "2020-04-25T17:49:56Z", "content": "The British public has emerged from its enforced hibernation to push strict lockdown rules to their limit this weekend as the Government considers allowing friends and family to gather together in 'bubbles'.  \r\nPeople are hitting the roads again today as new … [+64963 chars]"}, {"source": {"id": null, "name": "Theguardian.comworld"}, "author": "Emma Graham-Harrison", "title": "WHO warns against coronavirus immunity passports - The Guardian", "description": "No evidence former Covid-19 patients protected from a second infection, says body", "url": "https://amp.theguardian.comworld/2020/apr/25/who-warns-against-coronavirus-immunity-passports", "urlToImage": null, "publishedAt": "2020-04-25T17:37:49Z", "content": "The World Health Organization has warned against issuing immunity passports to people who have recovered from Covid-19, as there is no evidence that they will be protected from a second infection.\r\nThe idea of issuing some form of certificates to people who h… [+3270 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Matt Dathan", "title": "Premier League football to return ‘within weeks’ with games behind closed doors but may be shown on fre - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/11476053/premier-league-return-back-tv-within-weeks/", "urlToImage": null, "publishedAt": "2020-04-25T16:45:58Z", "content": "PREMIER League football could be back on TV within weeks in a major boost for bored Brits.Boris Johnson has been briefed on plans for matches to be played behind closed doors and sees the resumption of live sport as key to boosting the morale of the nation af… [+9612 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Rebecca Perring", "title": "China threatens EU: Gag criticism of Beijing's coronavirus LIES or face consequences - Express.co.uk", "description": "CHINA has been accused of openly threatening the EU - warning Brussels to block a report alleging Beijing was deliberately spreading disinformation about the coronavirus outbreak, or face the consequences.", "url": "https://www.express.co.uk/news/world/1273844/China-coronavirus-eu-news-coronavirus-china-news-coronavirus-conspiracy-theories", "urlToImage": null, "publishedAt": "2020-04-25T16:38:00Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: New York governor Cuomo provides update on outbreak – watch live - Guardian News", "description": "New York governor Andrew Cuomo provides a coronavirus update", "url": "https://www.youtube.com/watch?v=W2rKwRiIFLc", "urlToImage": null, "publishedAt": "2020-04-25T16:16:18Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Davey Winder", "title": "Working from home? How to stay in touch and stay secure - The Guardian", "description": "Covid-19 has forced millions into the unfamiliar world of the home office, where new security threats loom. Here’s how to protect yourself and colleagues", "url": "https://www.theguardian.com/technology/2020/apr/25/working-from-home-how-to-stay-in-touch-and-stay-secure", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "Businesses are used to being prepared for a disaster and most will have had a well-rehearsed continuity plan in place in case one struck. But even the best plan couldnt have effectively anticipated the wholesale overnight shift to home working that Covid-19 h… [+7011 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Captain Tom tops the charts at the age of 99 - BBC News - BBC News", "description": "Captain Tom Moore has become the oldest artist to reach the top spot of BBC Radio 1's The Official Chart. His rendition of You’ll Never Walk Alone is the fas...", "url": "https://www.youtube.com/watch?v=xM_S7qaYDiU", "urlToImage": null, "publishedAt": "2020-04-25T15:53:55Z", "content": "Captain Tom Moore has become the oldest artist to reach the top spot of BBC Radio 1's The Official Chart.\r\nHis rendition of Youll Never Walk Alone is the fastest-selling single of 2020, with 82,000 copies and proceeds going to the NHS Charities Together fund.… [+202 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Greg Heffer", "title": "Coronavirus: Experts once said 20,000 deaths was a 'good outcome' - so where is the UK headed now? - Sky News", "description": "With the UK having passed the level that was previously considered a \"good result\" - how many deaths could there now be?", "url": "https://news.sky.com/story/coronavirus-experts-once-said-20-000-deaths-was-a-good-outcome-so-where-is-the-uk-headed-now-11978609", "urlToImage": null, "publishedAt": "2020-04-25T14:35:31Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: UK hospital deaths pass 20,000 - BBC South East Wales", "description": "The government reveals the \"tragic and terrible milestone\", 51 days after the first virus-related death was announced in the UK.", "url": "https://www.bbc.co.uk/news/uk-52424413", "urlToImage": null, "publishedAt": "2020-04-25T14:24:29Z", "content": "Image copyrightGetty Images\r\nMore than 20,000 people have now died with coronavirus in UK hospitals, the Department of Health has announced.\r\nThe latest figures showed a total of 20,319 deaths in the UK, up by 813 on the previous day.\r\nAt the government's dai… [+4634 chars]"}, {"source": {"id": null, "name": "Indy100.com"}, "author": "Greg Evans", "title": "Trump is tweeting about professional wrestling just a day after US death toll surpasses 50,000 - indy100", "description": "", "url": "https://www.indy100.com/article/trump-coronavirus-wrestling-wwe-triple-h-twitter-9483866", "urlToImage": null, "publishedAt": "2020-04-25T13:27:20Z", "content": "On Friday, it was confirmed that more than 52,000 Americans had died from coronavirus, considerably more than any other nation in the world. On Saturday, Donald Trump tweeted about professional wrestling. \r\nNo, this isn't what Donald Trump calls 'fake news' b… [+1196 chars]"}, {"source": {"id": null, "name": "Simpleflying.com"}, "author": "Jay Singh", "title": "Breaking: Boeing Terminates Joint Venture Deal With Embraer - Simple Flying", "description": "Breaking news this morning in the United States that Boeing has terminated its joint venture agreement with Embraer.", "url": "https://simpleflying.com/boeing-embraer-jv-termination/", "urlToImage": null, "publishedAt": "2020-04-25T13:22:44Z", "content": "Breaking news this morning in the United States that Boeing has terminated its joint venture agreement with Embraer. According to the manufacturer, Embraer did not meet some of the conditions of the deal which resulted in Boeing’s termination of the plan.\r\nBo… [+4010 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "David Smith, Kari Paul", "title": "Debacle of Trump's coronavirus disinfectant comments could be tipping point - The Guardian", "description": "The US president plans to ‘pare back’ his daily coronavirus briefings after falsely claiming his suggestion to ingest cleaning products had been ‘sarcastic’", "url": "https://www.theguardian.com/us-news/2020/apr/25/donald-trump-coronavirus-disinfectant-sarcastic-tipping-point", "urlToImage": null, "publishedAt": "2020-04-25T13:20:40Z", "content": "For Donald Trump, it was the strangest and most news-making thing he could have done: instead of taking questions from journalists, dominating the nations airwaves yet again, the US president gave a short pre-written statement and then stalked off the stage.\r… [+6803 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Rachel Cooke", "title": "'People fell under its spell': Shelley Klein on growing up in one of Britain's finest modernist houses - The Guardian", "description": "Textile designer Bernat Klein found solace in High Sunderland, his minimal 1950s house in the Scottish Borders. In her memoir, his daughter recalls returning to her childhood home", "url": "https://www.theguardian.com/artanddesign/2020/apr/25/people-fell-under-its-spell-shelley-klein-on-growing-up-in-one-of-britains-finest-modernist-houses", "urlToImage": null, "publishedAt": "2020-04-25T13:03:59Z", "content": "In December 2009, Shelley Klein left her home in the fishing village of Port Isaac, Cornwall, and set off for the house in the Scottish Borders where she had grown up. The 450-mile journey was ostensibly the result of her recent decision to move in with her e… [+13977 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Lockdown should ease to help economy, says Philip Hammond - BBC News", "description": "The former chancellor warns that the economy \"won't survive\" waiting for a vaccine to be developed.", "url": "https://www.bbc.co.uk/news/uk-politics-52425460", "urlToImage": null, "publishedAt": "2020-04-25T13:03:04Z", "content": "Image copyrightGetty ImagesImage caption\r\n Cafes and shops closed in Brixton market, south London.\r\nFormer chancellor Philip Hammond has urged the government to set out its plan to restart the economy. \r\nMinisters have been reluctant to discuss a lockdown exi… [+2509 chars]"}, {"source": {"id": null, "name": "Gov.scot"}, "author": "The Scottish Government", "title": "Coronavirus (COVID-19): testing for key workers in Scotland - Scottish Government News", "description": "Guidance on coronavirus testing for key workers who are showing symptoms.", "url": "https://www.gov.scot/publications/coronavirus-covid-19-testing-for-key-workers-in-Scotland/", "urlToImage": null, "publishedAt": "2020-04-25T12:11:15Z", "content": "Testing of key workers\r\nThe UK government has established a new network of Covid testing facilities for key workers. This programme runs alongside the existing programme of testing in the NHS for clinical purposes and testing of key workers in health and soci… [+8940 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By James Wood For Mailonline", "title": "New figures show number of people visiting UK's A&E wards down by half this month - Daily Mail", "description": "Health officials are worried many people are not seeking treatment because they fear contracting Covid-19, thereby jeopardising their survival and potentially becoming collateral damage.", "url": "https://www.dailymail.co.uk/news/article-8256237/New-figures-number-people-visiting-UKs-E-wards-half-month.html", "urlToImage": null, "publishedAt": "2020-04-25T11:23:22Z", "content": "The NHS is launching a new campaign to make sure people seek urgent care during a medical emergency after visits to A&amp;E dropped by almost 50 per cent this month.\r\nHealth officials are worried many people are not seeking treatment because they fear contrac… [+23274 chars]"}, {"source": {"id": null, "name": "Chelseafc.com"}, "author": null, "title": "Coronavirus update: Chelsea statement on employees, tickets, men's first team and community help - Chelsea FC", "description": "The board of Chelsea Football Club would like to update our fans, our staff, our community and our other stakeholders of certain actions the club is taking during the coronavirus crisis.", "url": "https://www.chelseafc.com/en/news/2020/04/25/club-update-on-coronavirus-initiatives-for-staff--supporters-and", "urlToImage": null, "publishedAt": "2020-04-25T11:17:31Z", "content": "The board, guided by club owner Roman Abramovich, has agreed on a number of initiatives aimed at ensuring the financial well-being of our staff as well as supporting our fans and the wider community.Employees\r\nThe club can confirm we will not be taking advant… [+2981 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Lucy Campbell", "title": "Coronavirus UK: test slots run out for second day running – latest updates - The Guardian", "description": "Questions over independence of Sage group come as UK death toll nears 20,000", "url": "https://www.theguardian.com/world/live/2020/apr/25/coronavirus-uk-calls-for-transparency-over-scientific-advice-to-ministers-latest-updates", "urlToImage": null, "publishedAt": "2020-04-25T10:41:00Z", "content": null}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Faye Brown", "title": "People could see '10 friends and family members' if lockdown eased - Metro.co.uk", "description": "Ministers are mulling over plans to relax strict ‘stay at home’ advice to ease loneliness and isolation.", "url": "https://metro.co.uk/2020/04/25/people-see-10-friends-family-members-plans-ease-lockdown-12608249/", "urlToImage": null, "publishedAt": "2020-04-25T09:53:44Z", "content": "People could meet up with friends and family in other households under plans to lift lockdown (Picture: SWNS)\r\nPeople could be allowed to socialise with up to 10 of their closest family and friends if lockdown rules are lifted.\r\nMinisters are mulling over pla… [+3268 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Stephen Warwick", "title": "EU states 'being completely held hostage by Google and Apple' says official - Android Central", "description": "Apple and Google have rebuffed calls from France and Germany to support their contact tracing apps, which use centralized data containing user information.", "url": "https://www.androidcentral.com/eu-states-being-completely-held-hostage-google-and-apple-says-official", "urlToImage": null, "publishedAt": "2020-04-25T09:10:59Z", "content": "An EU official has said that Apple and Google are holding EU states hostage after they rebuffed further calls to support contact tracing solutions offered by France and Germany.\r\nAs Reuters reports:\r\nA standoff between the two largest nations in the European … [+2171 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "West Indies 'flexible' on new Test dates against England - Sky Sports", "description": "Cricket West Indies says it is \"flexible\" about rearranging a Test tour of England but the governing body insists it will not jeopardise the safety of players.", "url": "https://www.skysports.com/cricket/news/12123/11978552/west-indies-flexible-on-new-test-dates-against-england", "urlToImage": null, "publishedAt": "2020-04-25T08:42:39Z", "content": "Cricket West Indies says it is \"flexible\" about rearranging a Test tour of England but the governing body insists it will not jeopardise the safety of players in order to complete the three-match series.\r\nIn a series that counts towards the World Test Champio… [+2902 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "WHO warns against idea of ‘immunity passports’ - Yahoo News UK", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_351bf09e-8e78-47de-b1c2-ab3761171fd6&lang=en-GB&inline=false", "urlToImage": null, "publishedAt": "2020-04-25T08:03:00Z", "content": "Yahoo is part of Verizon Media. Click 'I agree' to allow Verizon Media and our partners to use cookies and similar technologies to access your device and use your data (including location) to understand your interests, and provide and measure personalised ads… [+344 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Bill McLoughlin", "title": "EU to struggle with united front in Brexit talks after coronavirus ‘host of issues' - Express.co.uk", "description": "BREXIT negotiations resumed this week in order to push forward with negotiating a deal but Brussels could be set for a series of issues going forward, an expert has claimed.", "url": "https://www.express.co.uk/news/uk/1273055/Brexit-news-eu-crisis-coronavirus-brexit-talks-delay-issues-eu-unity", "urlToImage": null, "publishedAt": "2020-04-25T07:30:00Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "WhatsApp update DOUBLES the maximum number of people in a video call - Express", "description": "WHATSAPP has expanded the maximum number of people who can take part in a video call at the same time - doubling the previous limit of four simultaneous callers. Just as before, these video calls will be end-to-end encrypted.", "url": "https://www.express.co.uk/life-style/science-technology/1273575/WhatsApp-Maximum-Number-People-Video-Call-Double-Limit-Update-iPhone-Android", "urlToImage": null, "publishedAt": "2020-04-25T06:42:31Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "Time to ditch WhatsApp and Houseparty? Google just made a huge change to your video calls - Express", "description": "GOOGLE has rolled out a colossal change to its video chat application, Google Duo, that promises to dramatically boost the video quality - even when making calls on sluggish home internet connections. Coupled with a number of new features added to the app, it…", "url": "https://www.express.co.uk/life-style/science-technology/1273369/Ditch-WhatsApp-Houseparty-Video-Calls-Google-Duo-Quality-Stream-Slow-Internet", "urlToImage": null, "publishedAt": "2020-04-25T06:36:39Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Zoe Wood", "title": "Will shoppers return to the UK high street after lockdown? - The Guardian", "description": "Retailers fear the coronavirus pandemic could permanently change consumer habits", "url": "https://www.theguardian.com/business/2020/apr/25/will-shoppers-return-to-the-uk-high-street-after-lockdown", "urlToImage": null, "publishedAt": "2020-04-25T06:03:46Z", "content": "Coronavirus has already triggered a wave of high street failures, from Oasis and Warehouse to Laura Ashley and Cath Kidston. Hundreds of thousands of retail workers have been furloughed, with the aim that they will return to the shop floor when stores are all… [+8636 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nAndrew Orlowski", "title": "Connecting the doubts over whether Hancock's coronavirus 'miracle app' is really the smart move - Telegraph.co.uk", "description": "The NHS hopes an app could be a game changer, but critics fear it may undermine the pandemic fight", "url": "https://www.telegraph.co.uk/business/2020/04/25/contact-tracing-could-halt-spread-virus-britons-unlikely-accept/", "urlToImage": null, "publishedAt": "2020-04-25T05:00:00Z", "content": "The problem, hardware engineers warn, is the integrity of the data on which the system would be based. Smartphones have four sources of data to help determine their location, and all have accuracy problems.\r\nThe civilian version of GPS only gives a four-metre… [+1365 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Manon Dark", "title": "Meghan Markle could face father in court as family tensions boil over - Express", "description": "MEGHAN MARKLE could face her father, Thomas Markle, in court over a dispute fuelled by an article published in the Mail on Sunday.", "url": "https://www.express.co.uk/news/royal/1273682/Meghan-Markle-royal-news-court-mail-on-sunday-sue-father-Thomas-Markle", "urlToImage": null, "publishedAt": "2020-04-25T04:53:13Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Kate Ferguson", "title": "Boris Johnson is ‘cheerful and on the mend’ after easing himself back into work - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11476730/boris-johnson-cheerful-and-on-the-mend/", "urlToImage": null, "publishedAt": "2020-04-25T01:36:12Z", "content": "BORIS Johnson is cheerful and on the mend fuelling hopes he could soon return to No10.\r\nThe PM has eased himself back into work over the past few days, holding calls with the Queen and Donald Trump.\r\n After a difficult battle with coronavirus, Boris Johnson i… [+3264 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Are these seven targets being hit? - BBC News", "description": "Ministers have set targets for testing, medical equipment and hospital beds. Have they delivered?", "url": "https://www.bbc.co.uk/news/52382786", "urlToImage": null, "publishedAt": "2020-04-24T23:04:26Z", "content": "Image copyrightGetty Images\r\nThe UK government has set various targets during its efforts to tackle the coronavirus outbreak. Have they been met?\r\n1. 25,000 tests a day by the middle of April\r\n\"We will massively scale up our testing capacity in the weeks ahea… [+7912 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Luke Hurst", "title": "Hubble at 30: Take a look back at some of the telescope's best images - Euronews", "description": "The Hubble Space Telescope turned 30 on Friday, and to mark the occasion Hubble released a fittingly awesome image.", "url": "https://www.euronews.com/2020/04/24/hubble-turns-30-take-a-look-back-at-some-of-the-space-telescope-s-best-images", "urlToImage": null, "publishedAt": "2020-04-24T21:06:33Z", "content": "The Hubble Space Telescope turned 30 on Friday, and to mark the occasion Hubble released a fittingly awesome image. \r\nShowing two nebulas, NGC 2020 and NGC 2014, some 163,000 light years from Earth, the image reveals part of a vast star-forming region in the … [+1048 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Alex Woodward", "title": "Coronavirus: US will not participate in WHO vaccine project after Trump turned against it - The Independent", "description": "Despite snub, coalition of world leaders will support US during crisis: 'There should be no division in order to win this battle'", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-vaccine-who-project-trump-us-covid-19-a9483421.html", "urlToImage": null, "publishedAt": "2020-04-24T21:00:25Z", "content": "The US will not participate in a global effort with the World Health Organisation to develop drugs and a vaccine to combat the coronavirus.\r\nA spokesman for the US mission told Reuters that \"there will be no US official participation\" in the programme, which … [+2599 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": null, "title": "Will American shale oil rise again? - Financial Times", "description": "Donald Trump’s efforts to end a price war backfired leaving the industry on its knees", "url": "https://www.ft.com/content/2d129e4a-860b-11ea-b872-8db45d5f6714", "urlToImage": null, "publishedAt": "2020-04-24T20:35:59Z", "content": "Asking Opec to help save the US oil sector was not part of Donald Trump’s vision of “American energy dominance”. The US president’s role in brokering a deal between Saudi Arabia and Russia to end a damaging price war was intended to prop up oil.\r\nInstead the … [+10293 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Harry Pettit", "title": "Starlink satellites tracker UK: Where are Elon Musk’s SpaceX satellites right now? - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11452340/starlink-satellites-tracker-uk/", "urlToImage": null, "publishedAt": "2020-04-24T15:21:07Z", "content": "STARGAZERS have another chance to witness a swarm fo satellites passing over Britain this evening.\r\nThe \"Starink\" satellites are operated by SpaceX, a company that hopes to one day beam Wi-Fi to people from space - and we've got all the tips you need to spot … [+8624 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Sean Martin", "title": "Lyrids meteor shower 2020: NASA cameras capture stunning fireballs - Express.co.uk", "description": "THE Lyrids meteor shower did not disappoint, with a plethora of shooting stars raining down on Earth.", "url": "https://www.express.co.uk/news/science/1272244/lyrids-meteor-shower-2020-nasa-pictures-fireball-shooting-stars-meteors", "urlToImage": null, "publishedAt": "2020-04-24T06:57:00Z", "content": null}]}