{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Glen Owen Harry Cole Brendan Carlin for The Mail on Sunday", "title": "Boris Johnson says he is 'raring to go' and will start work on Monday - Daily Mail", "description": "The Prime Minister told aides during a three-hour Covid-19 strategy session that doctors had given him permission to return.", "url": "https://www.dailymail.co.uk/news/article-8257275/Boris-Johnson-says-raring-start-work-Monday.html", "urlToImage": null, "publishedAt": "2020-04-26T00:44:43Z", "content": "Boris Johnson will return from his Chequers convalescence on Monday determined to 'tighten his grip' on a Government which has often appeared to flounder in his absence.\r\nThe Prime Minister told aides during a three-hour Covid-19 strategy session that doctors… [+5137 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "James Beal", "title": "Kim Jong-un death rumours: China and US race to find out the truth after claims tyrant died from ‘botched h - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11482322/kim-jong-un-dead-north-korea-heart-op-china/", "urlToImage": null, "publishedAt": "2020-04-26T00:32:16Z", "content": "NORTH Korean tyrant Kim Jong-un has been reported dead as officials scrambled to try and verify the claims.\r\nThe US are closely monitoring the situation as China dispatched a medical team in an attempt to find out the truth from the highly secretive nation.\r\n… [+5386 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Charlotte Dean For Mailonline", "title": "BGT's Simon Cowell pushes his golden buzzer for Fayth Ifil, 12, after she wows with Tina Turner song - Daily Mail", "description": "Simon Cowell gave 12-year-old Fayth Ifil a clear run to the semi-finals after awarding her with his golden buzzer during Saturday's episode of Britain's Got Talent.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8257439/BGTs-Simon-Cowell-pushes-golden-buzzer-Fayth-Ifil-12-wows-Tina-Turner-song.html", "urlToImage": null, "publishedAt": "2020-04-25T23:23:22Z", "content": "Simon Cowell gave 12-year-old Fayth Ifil a clear run to the semi-finals after awarding her with his golden buzzer during Saturday's episode of Britain's Got Talent.\r\nThe youngster, who has previously performed on the West End in Tina Turner and School Of Rock… [+3562 chars]"}, {"source": {"id": null, "name": "Theguardian.comfootball"}, "author": "Guardian staff reporter", "title": "Everton 'appalled' after Moise Kean hosts coronavirus lockdown party - The Guardian", "description": "Everton have labelled Moise Kean’s actions ‘unacceptable’ after he flouted coronavirus lockdown restrictions", "url": "https://amp.theguardian.comfootball/2020/apr/26/everton-appalled-moise-kean-hosts-coronavirus-lockdown-party", "urlToImage": null, "publishedAt": "2020-04-25T23:14:54Z", "content": "Everton have labelled Moise Keans actions unacceptable after he flouted coronavirus lockdown restrictions.\r\nThe striker filmed himself partying at home with guests in a breach of social distancing regulations during the coronavirus pandemic. Kean, who joined … [+1170 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Alex Woodward", "title": "Coronavirus: 'No evidence' recovered patients are immune to re-infection, warns WHO - The Independent", "description": "World Health Organisation does not recommend governments issue 'immunity passports' as countries look to 'reopen' amid pandemic", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-immunity-passports-antibody-tests-world-health-organisation-a9484261.html", "urlToImage": null, "publishedAt": "2020-04-25T23:11:26Z", "content": "The World Health Organisation says there is no evidence that people who have recovered from coronavirus and have antibodies are protected against a second infection.\r\nIn a scientific brief published on Saturday, the United Nations agency warned against countr… [+2673 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Recorded crime in Scotland down by a quarter since lockdown - BBC News", "description": "Police Scotland says serious assaults have dropped by 40% and house break-ins are down by 30%.", "url": "https://www.bbc.com/news/uk-scotland-52424893", "urlToImage": null, "publishedAt": "2020-04-25T23:05:19Z", "content": "Image copyrightGetty ImagesImage caption\r\n Police Scotland said fewer crimes were being committed on the streets and in town and city centres\r\nRecorded crime in Scotland has fallen by about 25% during the coronavirus lockdown, Police Scotland have said.\r\nThe … [+3151 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Christy Cooney", "title": "UK removes China from official coronavirus deaths comparison after ‘cover-up’ claims and disbelief at low fig - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11481397/uk-removes-china-official-coronavirus-deaths-cover-up/", "urlToImage": null, "publishedAt": "2020-04-25T22:44:57Z", "content": "THE government has removed China from graphs it uses to compare the UK's coronavirus deaths to those elsewhere amid accusations the country has covered up the true impact of the pandemic.   \r\nThe official toll in China, where the virus first broke out in Dece… [+2351 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Grace Witherden", "title": "Coronavirus 'vanishes' after 70 days with or without intervention, claims professor - Mirror Online", "description": "Professor Isaac Ben-Israel made the claims about Covid-19 in a self-published article but his calculations have been criticised, as there is no country that can be used as a baseline", "url": "https://www.mirror.co.uk/news/world-news/coronavirus-vanishes-after-70-days-21927634", "urlToImage": null, "publishedAt": "2020-04-25T22:44:24Z", "content": "An Israeli professor has claimed that coronavirus will disappear after 70 days with or without intervention.\r\nThe unproven claims were made by Professor Isaac Ben-Israel, who is the head of the security studies programme at Tel Aviv University.\r\nHe said that … [+3195 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "James Hockaday", "title": "Parks swamped with sunbathers as phone data shows Brits ignoring lockdown - Metro.co.uk", "description": "'It won't take much for this virus to start increasing its transmission again and to spread more widely.'", "url": "https://metro.co.uk/2020/04/25/parks-swamped-sunbathers-phone-data-shows-brits-ignoring-lockdown-12610758/", "urlToImage": null, "publishedAt": "2020-04-25T21:55:51Z", "content": "Police patrolled parks as people flocked outside to enjoy the sunshine (Picture: Getty Images/REX)\r\nHealth officials fear Britons are getting complacent about the coronavirus lockdown as traffic and mobile phone data revealed more of us are on the roads and l… [+4912 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Tess de la Mare, Grace Witherden", "title": "UK coronavirus deaths 'increasing more rapidly than any other country bar US' - Mirror Online", "description": "The Home Secretary Priti Patel said the UK had hit a “tragic and terrible milestone” today as more than 20,000 coronavirus Covid-19 deaths in hospital were announced by the Department for Health", "url": "https://www.mirror.co.uk/news/uk-news/uk-coronavirus-deaths-increasing-more-21926927", "urlToImage": null, "publishedAt": "2020-04-25T20:47:28Z", "content": "The UK has become the fifth country to pass 20,000 deaths in hospital from coronavirus, behind the US, Italy, Spain and France. \r\nThe Department of Health announced today that a further 813 people had died after testing positive for Covid-19, bringing the tot… [+2367 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "'No evidence' that recovered COVID-19 patients cannot be reinfected - WHO - Reuters UK", "description": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.", "url": "https://uk.reuters.com/article/health-coronavirus-who-idUKL5N2CC6XA", "urlToImage": null, "publishedAt": "2020-04-25T20:40:44Z", "content": "GENEVA, April 25 (Reuters) - The World Health Organization (WHO) said on Saturday that there was currently “no evidence” that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection. \r\nIn a statement, the … [+545 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nOliver Gill", "title": "Branson races to find Virgin Atlantic buyer - Telegraph.co.uk", "description": "Sir Richard Branson has set a deadline of the end of May to find a buyer to save stricken airline Virgin Atlanic from collapse", "url": "https://www.telegraph.co.uk/business/2020/04/25/branson-races-find-virgin-atlantic-buyer/", "urlToImage": null, "publishedAt": "2020-04-25T20:30:00Z", "content": "Sir Richard Branson is seeking a buyer for Virgin Atlantic and has set an end-of-May deadline to save the airline from collapse after a taxpayer bailout proved beyond his reach.\r\nThe Sunday Telegraph has learnt that the pursuit of a £500m government package h… [+1158 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Mattha Busby", "title": "Government 'reviewing' NHS surcharge for migrant medics - The Guardian", "description": "Home secretary says immigration surcharge for doctors and nurses under review", "url": "https://www.theguardian.com/world/2020/apr/25/government-reviewing-nhs-surcharge-for-migrant-medics", "urlToImage": null, "publishedAt": "2020-04-25T20:21:53Z", "content": "The government is reviewing the surcharge that some migrant doctors and nurses working in the NHS must pay to access the health service, the home secretary Priti Patel has said.\r\nIn the daily press conference at Downing Street on Saturday, after the UK became… [+3064 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Helen Davidson, Jedidajah Otte, Aaron Walawalkar, Damien Gayle, Sam Jones, William Costa, Angela Giuffrida, Kim Willsher, Akhtar Mohammad Makoii, Helena Smith, Kevin Rawlinson", "title": "Coronavirus live news: global death toll passes 200,000 - The Guardian", "description": "Greece prepares to end lockdown; Bill Gates vows to fund vaccine production; Australia and New Zealand mark Anzac Day from driveways", "url": "https://www.theguardian.com/world/live/2020/apr/25/coronavirus-live-news-brazils-health-system-on-verge-of-collapse-medics-warn", "urlToImage": null, "publishedAt": "2020-04-25T20:20:36Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Mary Gallagher", "title": "Pregnant Rochelle Humes says she is ‘in tears’ as she suffers severe morning sickness in her second tri - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11480705/pregnant-rochelle-humes-morning-sickness-trimester/", "urlToImage": null, "publishedAt": "2020-04-25T19:45:16Z", "content": "ROCHELLE Humes has revealed she has been crying today after suffering painful morning sickness in the second trimester of her pregnancy.\r\nThe This Morning host announced her third pregnancy earlier this month and is expecting a baby boy later this year.\r\n Pre… [+4676 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nChristopher Williams,", "title": "Sales shifted online may never return to stores, Dixons Carphone boss warns - Telegraph.co.uk", "description": "Dixons Carphone is preparing to join a first wave of “non-essential” retailers resuming operations with social distancing in place", "url": "https://www.telegraph.co.uk/business/2020/04/25/sales-shifted-online-may-never-return-stores-dixons-carphone/", "urlToImage": null, "publishedAt": "2020-04-25T19:00:00Z", "content": "The boss of Dixons Carphone has warned that some sales that have shifted online during the lockdown will never return to bricks and mortar stores, as he prepares to reopen with extreme care.\r\nAlex Baldock said that the retailer had been pleased by the proport… [+1297 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Aaron Walawalkar", "title": "Tata Steel needs '£500m government bailout' as Covid-19 halts production - The Guardian", "description": "UK’s biggest steel producer reportedly seeks government support as it takes big hit in pandemic", "url": "https://www.theguardian.com/business/2020/apr/25/tata-steel-needs-500m-government-bailout-says-stephen-kinnock", "urlToImage": null, "publishedAt": "2020-04-25T18:54:42Z", "content": "The UKs biggest steel producer needs about £500m in government support to see it through the coronavirus crisis, according to Welsh MP Stephen Kinnock.\r\nTata Steel has approached the UK and Welsh governments for a bailout after its big European customers halt… [+1920 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Arsenal to open London Colney training ground to players on limited basis - BBC Sport", "description": "Arsenal's players will be allowed to return to limited training sessions from next week.", "url": "https://www.bbc.co.uk/sport/football/52428362", "urlToImage": null, "publishedAt": "2020-04-25T18:35:02Z", "content": "Arsenal were ninth in the Premier League when the season was halted\r\nArsenal's players will return to light training sessions from next week.\r\nPlayers will undertake individual running at London Colney, in line with government coronavirus regulations.\r\n\"Playe… [+971 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Callum Hoare", "title": "'Universe is unstable!' How Brian Cox revealed world could end 'at any moment' - Express.co.uk", "description": "THE END OF THE WORLD could happen 'at any moment' according to the chilling claims of a scientist, after Brian Cox revealed why the 'universe is unstable'.", "url": "https://www.express.co.uk/news/science/1273858/end-of-the-world-brian-cox-universe-unstable-vacuum-decay-space-news-spt", "urlToImage": null, "publishedAt": "2020-04-25T17:54:00Z", "content": null}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "Petec21", "title": "Raheem Sterling: There’s Only One Shirt I Want - Bitter and Blue", "description": "City Winger Wants Barca Legend Shirt", "url": "https://bitterandblue.sbnation.com/2020/4/25/21236328/raheem-sterling-theres-only-one-shirt-i-want", "urlToImage": null, "publishedAt": "2020-04-25T17:48:16Z", "content": "Manchester City winger Raheem Sterling has revealed the one shirt he wants to obtain from his playing days for his collections. Despite gathering a collection of medals, trophies and players shirts, Sterling has said the one he really wants is a shirt off the… [+1452 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Davey Winder", "title": "Working from home? How to stay in touch and stay secure - The Guardian", "description": "Covid-19 has forced millions into the unfamiliar world of the home office, where new security threats loom. Here’s how to protect yourself and colleagues", "url": "https://www.theguardian.com/technology/2020/apr/25/working-from-home-how-to-stay-in-touch-and-stay-secure", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "Businesses are used to being prepared for a disaster and most will have had a well-rehearsed continuity plan in place in case one struck. But even the best plan couldnt have effectively anticipated the wholesale overnight shift to home working that Covid-19 h… [+7011 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nRowan Pelling", "title": "'Normal People' takes me back to the mad, sad days of my own secret student romance - Telegraph.co.uk", "description": "As Sally Rooney's bestselling novel hits screens, Rowan Pelling recognises the small humiliations of her own clandestine affair at Oxford", "url": "https://www.telegraph.co.uk/women/life/normal-people-takes-back-mad-sad-days-secret-student-romance/", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "After that, I moved around college on auto-pilot, carrying all this darkness and drama within, and one of the few souls who knew was the boy I was sleeping with. Unsurprisingly, the knowledge was too oppressive for him; he had his own demons and wanted to par… [+1724 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Jillian Ambrose", "title": "America’s fracking boom founders as global prices and demand collapse - The Guardian", "description": "The shale industry made the US a major producer once again. But Covid-19 looks likely to ruin many prospectors", "url": "https://www.theguardian.com/business/2020/apr/25/fracking-america-boom-founders-prices-demand-collapse-covid-19", "urlToImage": null, "publishedAt": "2020-04-25T15:03:42Z", "content": "The US shale industry was forecast to deliver record high oil production this year. Only a few months ago the Permian basin was expected to increase its oil output to a new high of 4.8 million barrels per day, on the way to spurring the entire US market to a … [+5884 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nLizzie Roberts", "title": "Contact tracing: how has it worked for other countries, and could it really help ease UK lockdown? - The Telegraph", "description": "From teams of 'corona detectives' to Army cadets making thousands of calls a day, countries are tracking the spread of Covid-19", "url": "https://www.telegraph.co.uk/news/2020/04/25/what-contact-tracing-how-work-countries-uk-lockdown/", "urlToImage": null, "publishedAt": "2020-04-25T13:41:28Z", "content": "Countries around the world are rushing to launch contact tracing apps to identify who an infected person has had contact with, as part of efforts to slow the spread of the coronavirus. \r\nThe UK Government has announced the infrastructure was being put in plac… [+1754 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Dominic Cummings 'should not be' at SAGE meetings, says David Davis - Sky News", "description": "", "url": "https://news.sky.com/video/dominic-cummings-should-not-be-at-sage-meetings-says-former-cabinet-minister-11978679", "urlToImage": null, "publishedAt": "2020-04-25T13:04:26Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Rachel Cooke", "title": "'People fell under its spell': Shelley Klein on growing up in one of Britain's finest modernist houses - The Guardian", "description": "Textile designer Bernat Klein found solace in High Sunderland, his minimal 1950s house in the Scottish Borders. In her memoir, his daughter recalls returning to her childhood home", "url": "https://www.theguardian.com/artanddesign/2020/apr/25/people-fell-under-its-spell-shelley-klein-on-growing-up-in-one-of-britains-finest-modernist-houses", "urlToImage": null, "publishedAt": "2020-04-25T13:03:59Z", "content": "In December 2009, Shelley Klein left her home in the fishing village of Port Isaac, Cornwall, and set off for the house in the Scottish Borders where she had grown up. The 450-mile journey was ostensibly the result of her recent decision to move in with her e… [+13977 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Jedidajah Otte", "title": "UK coronavirus: public urged to observe lockdown despite weekend sunshine - The Guardian", "description": "People reminded to stay at home as calls grow for easing of coronavirus restrictions", "url": "https://www.theguardian.com/world/2020/apr/25/public-urged-to-observe-lockdown-despite-weekend-sunshine", "urlToImage": null, "publishedAt": "2020-04-25T12:43:49Z", "content": null}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": null, "title": "WHO warns against coronavirus ‘immunity passports’ - Financial Times", "description": "Health agency says there is no proof recovered patients are shielded from reinfection", "url": "https://www.ft.com/content/49615c5b-d5b0-444b-b5f3-29bcc451f01e", "urlToImage": null, "publishedAt": "2020-04-25T12:19:58Z", "content": "The World Health Organization has warned governments against issuing “immunity passports” to allow people who show antibodies for coronavirus to return to work. \r\nAs leaders across the world turn their focus to reopening their economies after weeks of social … [+2484 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Milly Vincent For Mailonline", "title": "No evidence recovered covid patients can't be re-infected World Health Organisation says - Daily Mail", "description": "United Nations agency warned against issuing 'immunity passports' to people who have been infected, saying practice may actually increase the risk of spread as they may ignore standard advice.", "url": "https://www.dailymail.co.uk/news/article-8256249/No-evidence-recovered-covid-patients-infected-World-Health-Organisation-says.html", "urlToImage": null, "publishedAt": "2020-04-25T12:18:37Z", "content": "The World Health Organization (WHO) said on Saturday that there was currently 'no evidence' that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nIn a statement, the United Nations agency warned a… [+10548 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Trump walks out of his coronavirus news conference - Sky News", "description": "President Trump walked out of his daily news briefing after just 22 minutes - a day after suggesting Americans should dose themselves with disinfectant. SUBS...", "url": "https://www.youtube.com/watch?v=0dzGuwJWLk8", "urlToImage": null, "publishedAt": "2020-04-25T11:27:41Z", "content": null}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "West Indies 'flexible' on new Test dates against England - Sky Sports", "description": "Cricket West Indies says it is \"flexible\" about rearranging a Test tour of England but the governing body insists it will not jeopardise the safety of players.", "url": "https://www.skysports.com/cricket/news/12123/11978552/west-indies-flexible-on-new-test-dates-against-england", "urlToImage": null, "publishedAt": "2020-04-25T08:42:39Z", "content": "Cricket West Indies says it is \"flexible\" about rearranging a Test tour of England but the governing body insists it will not jeopardise the safety of players in order to complete the three-match series.\r\nIn a series that counts towards the World Test Champio… [+2902 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Bill McLoughlin", "title": "EU to struggle with united front in Brexit talks after coronavirus ‘host of issues' - Express.co.uk", "description": "BREXIT negotiations resumed this week in order to push forward with negotiating a deal but Brussels could be set for a series of issues going forward, an expert has claimed.", "url": "https://www.express.co.uk/news/uk/1273055/Brexit-news-eu-crisis-coronavirus-brexit-talks-delay-issues-eu-unity", "urlToImage": null, "publishedAt": "2020-04-25T07:30:00Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "WhatsApp update DOUBLES the maximum number of people in a video call - Express", "description": "WHATSAPP has expanded the maximum number of people who can take part in a video call at the same time - doubling the previous limit of four simultaneous callers. Just as before, these video calls will be end-to-end encrypted.", "url": "https://www.express.co.uk/life-style/science-technology/1273575/WhatsApp-Maximum-Number-People-Video-Call-Double-Limit-Update-iPhone-Android", "urlToImage": null, "publishedAt": "2020-04-25T06:42:31Z", "content": null}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Dominic Cummings attended meetings of key scientific group - BBC News", "description": "Downing Street confirms the PM's chief adviser attended Sage meetings but denies he is a member.", "url": "https://www.bbc.com/news/uk-politics-52421744", "urlToImage": null, "publishedAt": "2020-04-25T00:41:20Z", "content": "Image copyrightReuters\r\nBoris Johnson's chief adviser, Dominic Cummings, has attended meetings of the scientific body shaping the government's coronavirus response.\r\nDowning Street denied a Guardian report he was a member of the Scientific Advisory Group for … [+4173 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Luke Hurst", "title": "Hubble at 30: Take a look back at some of the telescope's best images - Euronews", "description": "The Hubble Space Telescope turned 30 on Friday, and to mark the occasion Hubble released a fittingly awesome image.", "url": "https://www.euronews.com/2020/04/24/hubble-turns-30-take-a-look-back-at-some-of-the-space-telescope-s-best-images", "urlToImage": null, "publishedAt": "2020-04-24T21:06:33Z", "content": "The Hubble Space Telescope turned 30 on Friday, and to mark the occasion Hubble released a fittingly awesome image. \r\nShowing two nebulas, NGC 2020 and NGC 2014, some 163,000 light years from Earth, the image reveals part of a vast star-forming region in the … [+1048 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Chris Edwards", "title": "Nintendo addresses major security breach - digitalspy.com", "description": "There have been reported incidents of unauthorised access to user accounts.", "url": "https://www.digitalspy.com/tech/a32270793/nintendo-security-breach/", "urlToImage": null, "publishedAt": "2020-04-24T20:38:00Z", "content": "Nintendo has addressed a major security breach as it encourages users to take new security steps. \r\nIn a statement on its official website, the gaming company said it is continuing to investigate recent incidents of unauthorised access to Nintendo Accounts, b… [+1827 chars]"}, {"source": {"id": null, "name": "Inews.co.uk"}, "author": "Alex Nelson", "title": "Lyrid meteor shower 2020: here's how to watch the Lyrids in the UK tonight, and when the meteors peak - inews", "description": "The ancient Chinese are said to have watched Lyrid meteors falling 'like rain' in the year 687 BC", "url": "https://inews.co.uk/news/science/lyrid-meteor-shower-2020-uk-tonight-how-watch-when-lyrids-peak-time-2543707", "urlToImage": null, "publishedAt": "2020-04-24T16:50:00Z", "content": "The ancient Chinese are said to have watched Lyrid meteors falling 'like rain' in the year 687 BC\r\nFriday, 24th April 2020, 5:48 pm\r\nUpdated Friday, 24th April 2020, 5:50 pm\r\nMembers of the York Astronomical Society prepare to view a meteor shower in 2015 (Ph… [+3239 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Harry Pettit", "title": "Starlink satellites tracker UK: Where are Elon Musk’s SpaceX satellites right now? - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11452340/starlink-satellites-tracker-uk/", "urlToImage": null, "publishedAt": "2020-04-24T15:21:07Z", "content": "STARGAZERS have another chance to witness a swarm fo satellites passing over Britain this evening.\r\nThe \"Starink\" satellites are operated by SpaceX, a company that hopes to one day beam Wi-Fi to people from space - and we've got all the tips you need to spot … [+8624 chars]"}]}