{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Matt Dathan", "title": "Premier League football will return ‘within weeks’ with games behind closed doors but could be shown on fre - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/11476053/premier-league-when-return-back-tv-within-weeks/", "urlToImage": null, "publishedAt": "2020-04-25T08:43:22Z", "content": "PREMIER League football could be back on TV within weeks in a major boost for bored Brits.Boris Johnson has been briefed on plans for matches to be played behind closed doors and sees the resumption of live sport as key to boosting the morale of the nation af… [+9612 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By James Wood For Mailonline", "title": "Millions of key workers face a rush to secure coronavirus test as applications re-open - Daily Mail", "description": "Many will be trying to secure a test for the second time after the government's new website had to close hours after launching on Friday as 46,000 people tried to access it.", "url": "https://www.dailymail.co.uk/news/article-8256023/Millions-key-workers-face-rush-secure-coronavirus-test-applications-open.html", "urlToImage": null, "publishedAt": "2020-04-25T08:28:46Z", "content": "Millions of key workers are facing a rush to secure a coronavirus test this morning as applications re-open after a 'significant' surge in demand yesterday.\r\nSome 5,000 home kits and 19,000 drive-through tests are expected to be made available on Saturday - w… [+9495 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "BBC News", "title": "Coronavirus: Doctors dismantle Trump's treatment comments - BBC News", "description": "They warned that heeding his comments on using disinfectants or UV light could have fatal consequences.", "url": "https://www.bbc.co.uk/news/av/world-us-canada-52421673/coronavirus-doctors-dismantle-trump-s-treatment-comments", "urlToImage": null, "publishedAt": "2020-04-25T08:24:34Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Anna MacSwan", "title": "Coronavirus lockdown exit plan 'could let Brits see bubble of up to 10 others' - Mirror Online", "description": "The Government is considering allowing people to socialise in \"small bubbles\", under plans to ease the coronavirus lockdown which would see households nominate up to 10 people", "url": "https://www.mirror.co.uk/news/politics/government-considering-easing-lockdown-rules-21924319", "urlToImage": null, "publishedAt": "2020-04-25T07:55:18Z", "content": "Brits could be allowed to meet up with 10 of their closest family or friends under one idea to relax the coronavirus lockdown.\r\nIt is understood that the UK government is considering letting people socialise outside of their households in small \"bubbles\" as i… [+4401 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Lucy Needham", "title": "Kanye West declared a billionaire by Forbes but rapper insists they have 'undervalued him' - Mirror Online", "description": "The rapper was unhappy at being 'undervalued' by the magazine, despite being listed as worth more than make-up mogul sister-in-law Kylie Jenner.", "url": "https://www.mirror.co.uk/3am/celebrity-news/kanye-west-declared-billionaire-forbes-21924741", "urlToImage": null, "publishedAt": "2020-04-25T07:47:41Z", "content": "Kanye West is officially a billionaire, according to Forbes magazine.\r\nThe outlet says the rapper and fashion designer, who has long coveted the status, provided an eye-catching glimpse into his personal finances and valued his net worth at a whopping $1.3 bi… [+2644 chars]"}, {"source": {"id": null, "name": "Theguardian.comworld"}, "author": "Sarah Marsh, Nazia Parveen", "title": "England campaign targets seriously ill patients avoiding hospitals - The Guardian", "description": "Campaign will urge people with serious non-coronavirus-related conditions to seek help", "url": "https://amp.theguardian.comworld/2020/apr/25/england-campaign-targets-seriously-ill-patients-avoiding-hospitals", "urlToImage": null, "publishedAt": "2020-04-25T07:46:47Z", "content": "A government campaign has been launched to encourage people seriously ill with non-Covid conditions such as heart attacks to seek help amid concerns some are avoiding hospitals.\r\nThe campaign, which will be rolled out next week, aims to encourage people to us… [+4549 chars]"}, {"source": {"id": null, "name": "Football365.com"}, "author": "Matthew Stead", "title": "Man Utd move for Jadon Sancho in doubt after Ed Woodward comments - Football365.com", "description": "Football365 - Man Utd chief Ed Woodward sensibly says \"speculation around transfers for hundreds of millions of pounds this summer\" is silly.", "url": "https://www.football365.com/news/ed-woodward-man-utd-jadon-sancho-revealing-comments", "urlToImage": null, "publishedAt": "2020-04-25T07:17:54Z", "content": "Man Utd executive vice-chairman Ed Woodward believes continuing speculation around big-money transfers “ignore the realities that face the sport” due to the coronavirus crisis.\r\nSix weeks have passed since Ole Gunnar Solskjaer’s men last took to the field, ro… [+1986 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Martyn James, Resolver.co.uk", "title": "What you can cancel without penalties during lockdown to save money - Mirror Online", "description": "Whether money's tight or not, continuing to shell out for services you don't need and in some cases can't even use during the coronavirus lockdown makes no sense - this is what you can ditch without fear of comeback", "url": "https://www.mirror.co.uk/money/what-you-can-can-cancel-21917083", "urlToImage": null, "publishedAt": "2020-04-25T07:12:24Z", "content": "While Britain is locked down everything from gyms to schools, restaurants and stadiums are closed, while travel is restricted to essential journey's only.\r\nBut what happens if you are paying for a subscription, membership or season ticket that is now effectiv… [+8087 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "David James", "title": "Coronavirus morning headlines on Saturday, April 25, as questions raised about secretive scientific body - Wales Online", "description": "There is an investigation into why death figures for Wales were wrongly counted", "url": "https://www.walesonline.co.uk/news/uk-news/coronavirus-wales-latest-cases-new-18149134", "urlToImage": null, "publishedAt": "2020-04-25T07:10:39Z", "content": "Here is a round-up of the latest news in response to the coronavirus pandemic on Saturday, April 25.\r\nFollow updates on the world coronavirus pandemic on our live blog.\r\nConfirmed worldwide cases: 2,790,886\r\nConfirmed deaths: 195,920\r\nUK figures: 144,635 case… [+12231 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Sian Elvin", "title": "Coronavirus UK: Public warned to stay at home during warm weather - Metro.co.uk", "description": "The Home Secretary is expected to condemn those ignoring the travel ban today.", "url": "https://metro.co.uk/2020/04/25/public-warned-stay-home-warm-weather-face-tougher-lockdown-measures-12607886/", "urlToImage": null, "publishedAt": "2020-04-25T06:35:27Z", "content": "The public has been urged to stay at home and not ignore lockdown measures this weekend (Picture: PA)\r\nThe public has been urged to stay at home during the UKs fifth weekend under lockdown, or face stricter rules.\r\nForecasters have predicted warm conditions f… [+3163 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Zoe Wood", "title": "Will shoppers return to the UK high street after lockdown? - The Guardian", "description": "Retailers fear the coronavirus pandemic could permanently change consumer habits", "url": "https://www.theguardian.com/business/2020/apr/25/will-shoppers-return-to-the-uk-high-street-after-lockdown", "urlToImage": null, "publishedAt": "2020-04-25T06:03:46Z", "content": "Coronavirus has already triggered a wave of high street failures, from Oasis and Warehouse to Laura Ashley and Cath Kidston. Hundreds of thousands of retail workers have been furloughed, with the aim that they will return to the shop floor when stores are all… [+8636 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Rob Davies", "title": "We'll survive! Why Hays Travel owners have no regrets on Thomas Cook rescue - The Guardian", "description": "Irene and John Hays remain upbeat about takeover of 555 branches six months before coronavirus halted global travel", "url": "https://www.theguardian.com/business/2020/apr/25/hays-travel-owners-no-regrets-thomas-cook-rescue-john-irene-hays", "urlToImage": null, "publishedAt": "2020-04-25T06:03:33Z", "content": "When John and Irene Hays rescued Thomas Cooks 555 high street travel agencies out of administration last year, conventional wisdom suggested they were making a big mistake.\r\nThere was a widespread belief that the spectacular failure of the 178-year-old busine… [+6104 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Ben Mitchell, Press Association", "title": "Identical twins who both worked as nurses die with coronavirus - Wales Online", "description": "'They always said they would come into the world together and go out together'", "url": "https://www.walesonline.co.uk/news/uk-news/coronavirus-identical-twins-died-davis-18149129", "urlToImage": null, "publishedAt": "2020-04-25T05:52:43Z", "content": "Identical twin sisters died in three days of each other after both testing positive for Covid-19.\r\nChildren's nurse Katy Davis, 37, died at Southampton General Hospital on Tuesday while her identical twin, Emma, a former surgery nurse, died early on Friday.\r\n… [+2001 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nAndrew Orlowski", "title": "Contact tracing could halt the spread of virus, but Britons unlikely to accept surveillance - Telegraph.co.uk", "description": "The NHS hopes an app could be a game changer, but critics fear it may undermine the pandemic fight", "url": "https://www.telegraph.co.uk/business/2020/04/25/contact-tracing-could-halt-spread-virus-britons-unlikely-accept/", "urlToImage": null, "publishedAt": "2020-04-25T05:00:00Z", "content": "Nuffields Ada Lovelace Institute last week produced a damning summary of the exuberance around digital contact tracing.\r\nInaccurate, irresponsible or imprecise use of data or technology can undermine public health strategies, wrote the authors of a report. [T… [+1728 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Some states begin to reopen as US death toll passes 50,000 - BBC News", "description": "Georgia, Oklahoma and Alaska lift some restrictions despite warnings that it may be too soon.", "url": "https://www.bbc.co.uk/news/world-us-canada-52421730", "urlToImage": null, "publishedAt": "2020-04-25T04:39:52Z", "content": "Image copyrightReutersImage caption\r\n Salons and spas were allowed to reopen in Georgia\r\nThree US states have allowed some shops to reopen after measures imposed to curb the spread of the coronavirus, as the country's death toll passed 51,000.\r\nSalons and spa… [+3317 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Daily Mail Reporter", "title": "Coronavirus has made cancelling holidays a nightmare - here's the lowdown on refunds and vouchers - Daily Mail", "description": "This week we've been inundated by requests for help with coronavirus-related travel problems. We can't address them all, but we hope these answers will help.", "url": "https://www.dailymail.co.uk/travel/travel_news/article-8254941/Coronavirus-cancelling-holidays-nightmare-heres-lowdown-refunds-vouchers.html", "urlToImage": null, "publishedAt": "2020-04-25T03:19:22Z", "content": "This week weve been inundated by requests for help with coronavirus-related travel problems. Getting to the grocery shop is tricky enough these days, let alone organising a holiday.\r\nThis is especially true because no one knows exactly when travel restriction… [+9792 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Matt Atherton", "title": "Coronavirus warning - does your poo look like this? The texture that could be COVID-19 - Express", "description": "CORONAVIRUS is a deadly infection that's easily spread, and the disease has killed almost 20,000 people in the UK. You could be at risk of COVID-19 symptoms if you develop this mild sign when you go to the toilet. What texture is your poo, and should you be c…", "url": "https://www.express.co.uk/life-style/health/1273471/coronavirus-symptoms-signs-covid-19-infection-toilet-loose-poo-diarrhoea", "urlToImage": null, "publishedAt": "2020-04-25T03:01:37Z", "content": null}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Donald Trump cuts off daily coronavirus press briefing without taking questions for first time - ITV News", "description": "President Donald Trump has, for the first time, cut off his daily coronavirus task force briefing on Friday without taking any questions from reporters.\n\nThe briefings often stretch well beyond an hour Mr Trump often relishes the chance at the end to go toe-t…", "url": "https://www.itv.com/news/2020-04-25/white-house-cuts-off-coronavirus-briefing-without-taking-questions/", "urlToImage": null, "publishedAt": "2020-04-25T02:57:00Z", "content": "President Donald Trump has, for the first time, cut off his daily coronavirus task force briefing on Friday without taking any questions from reporters.\r\nThe briefings often stretch well beyond an hour Mr Trump often relishes the chance at the end to go toe-t… [+1428 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Frank Skinner: Will Gompertz reviews the comedian's poetry podcast on Absolute Radio ★★★★☆ - BBC News", "description": "It's a simple idea presented by someone who brings insight to an art form that is enjoying a resurgence.", "url": "https://www.bbc.co.uk/news/entertainment-arts-52403782", "urlToImage": null, "publishedAt": "2020-04-25T02:48:36Z", "content": "Odd combinations have long been a staple of the entertainment industry. For those old enough to have seen it (still available on YouTube), who can forget Prince Edward's cringe-inducing toe-dip into television production with the culture-clash that was It's A… [+9008 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus test website reopens for bookings after 'significant demand' - BBC News", "description": "Millions of key workers and their households can apply for a test to see if they have coronavirus.", "url": "https://www.bbc.co.uk/news/uk-52418872", "urlToImage": null, "publishedAt": "2020-04-25T01:33:32Z", "content": "Media captionCoronavirus test website designed to close and reopen with more slots - Shapps\r\nThe government website for key workers to apply for coronavirus tests has reopened after \"exceptional demand\".\r\nSpeaking at Friday's daily briefing, Transport Secreta… [+6996 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Dominic Cummings attended meetings of key scientific group - BBC News", "description": "Downing Street confirms the PM's chief adviser attended Sage meetings but denies he is a member.", "url": "https://www.bbc.co.uk/news/uk-politics-52421744", "urlToImage": null, "publishedAt": "2020-04-25T00:41:20Z", "content": "Image copyrightReuters\r\nBoris Johnson's chief adviser, Dominic Cummings, has attended meetings of the scientific body advising the government on the coronavirus outbreak.\r\nHowever, Downing Street denied a report in the Guardian that Mr Cummings was a member o… [+2932 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Guardian sport", "title": "West Indies say Test tour of England has been postponed due to Covid-19 - The Guardian", "description": "The three-Test series between England and West Indies in June has been postponed due to the coronavirus outbreak", "url": "https://www.theguardian.com/sport/2020/apr/24/west-indies-test-tour-england-postponed-covid-19-cricket", "urlToImage": null, "publishedAt": "2020-04-24T23:20:55Z", "content": "The three-Test series between England and West Indies in June has been postponed due to the coronavirus outbreak, Cricket West Indies (CWI) said on Friday.\r\nWest Indies had been scheduled to play on 4-8 June at The Oval, 12-16 June at Edgbaston and 25-29 June… [+1600 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Gursimran Hans", "title": "Macron warns EU could ‘collapse’ over coronavirus – ‘The whole of Europe will fall’ - Express.co.uk", "description": "FRENCH President Emmanuel Macron has issued an ultimatum to EU members in Northern Europe to spend more to help southern states or risk losing access to the single market.", "url": "https://www.express.co.uk/news/world/1273663/EU-coronavirus-latest-updates-Emmanuel-Macron-France-Germany-Italy-bailout", "urlToImage": null, "publishedAt": "2020-04-24T23:07:00Z", "content": null}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Nova Scotia shooting: 'They had no idea the hell they were going to face' - BBC News", "description": "Canada's deadliest shooting is pieced together by the people swept up in its path of terror.", "url": "https://www.bbc.com/news/world-us-canada-52373798", "urlToImage": null, "publishedAt": "2020-04-24T21:47:25Z", "content": "Image copyrightFacebook / HandoutImage caption\r\n Victims of the Canada's largest mass shooting\r\nOver the span of 12 hours, a gunman posing as a police officer went on a rampage across the province of Nova Scotia that became the most deadly shooting in Canadia… [+11498 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Ed Woodward says Manchester United may not do 'business as usual' in summer transfer market - Sky Sports", "description": "It may not be \"business as usual\" for Manchester United in the summer transfer market, according to the club's executive vice-chairman Ed Woodward.", "url": "https://www.skysports.com/football/news/11667/11978379/ed-woodward-says-manchester-united-may-not-do-business-as-usual-in-summer-transfer-market", "urlToImage": null, "publishedAt": "2020-04-24T21:36:14Z", "content": "It may not be \"business as usual\" for Manchester United in the summer transfer market, according to the club's executive vice-chairman Ed Woodward.\r\nSpeaking to a Manchester United Fans' Forum held remotely via a conference call on Friday, Woodward said he do… [+1471 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": null, "title": "Facebook takes aim at Zoom with new video chat features - Financial Times", "description": "Zoom shares fall 10% as tech giant launches rival to apps made popular during lockdowns", "url": "https://www.ft.com/content/ceee381c-d42b-4f35-a2cb-2ae07a299ec8", "urlToImage": null, "publishedAt": "2020-04-24T21:01:19Z", "content": "Facebook is launching several multi-person video-chat features on its apps in a dash to compete with the popular tools from Zoom, Google and Houseparty that billions of people are using to socialise during the coronavirus crisis.\r\nThe world’s largest social m… [+2998 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: Excess deaths suggest a higher mortality rate than official figures - Sky News", "description": "Although official figures report the number of coronavirus-related deaths at over 19,000, there has been a spike in the number of 'excess deaths'. These acco...", "url": "https://www.youtube.com/watch?v=C4EeZ4f85KI", "urlToImage": null, "publishedAt": "2020-04-24T20:45:40Z", "content": null}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Chris Edwards", "title": "Nintendo addresses major security breach - digitalspy.com", "description": "There have been reported incidents of unauthorised access to user accounts.", "url": "https://www.digitalspy.com/tech/a32270793/nintendo-security-breach/", "urlToImage": null, "publishedAt": "2020-04-24T20:38:00Z", "content": "Nintendo has addressed a major security breach as it encourages users to take new security steps. \r\nIn a statement on its official website, the gaming company said it is continuing to investigate recent incidents of unauthorised access to Nintendo Accounts, b… [+1827 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Hubble Telescope marks 30th birthday with stunning new image - Sky News", "description": "The picture of nebulas NGC 2014 and NGC 2020 has been nicknamed the \"Cosmic Reef\" because it looks like an undersea world.", "url": "https://news.sky.com/story/hubble-telescope-marks-30th-birthday-with-stunning-new-image-11978420", "urlToImage": null, "publishedAt": "2020-04-24T19:35:02Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Daniel Boffey, Jennifer Rankin", "title": "Britain running down the clock in Brexit talks, says Michel Barnier - The Guardian", "description": "EU negotiator expresses frustrations at UK refusal to discuss key issues of transition", "url": "https://www.theguardian.com/politics/2020/apr/24/britain-running-down-the-clock-in-brexit-talks-says-michel-barnier-eu", "urlToImage": null, "publishedAt": "2020-04-24T18:21:36Z", "content": "Michel Barnier has suggested the UK is running down the clock in talks over the future trade and security relationship with the EU.\r\nThe claim by the blocs chief negotiator during a virtual press conference at the end of a difficult week of videoconference ta… [+9746 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nTelegraph Obituaries", "title": "Lynn Faulds Wood, fearless consumer champion who was the first co-presenter of Watchdog – obituary - Telegraph.co.uk", "description": "She became a familiar face on television exposing everything from faulty household products to fly-by-night conmen", "url": "https://www.telegraph.co.uk/obituaries/2020/04/24/lynn-faulds-wood-fearless-consumer-champion-first-co-presenter/", "urlToImage": null, "publishedAt": "2020-04-24T17:45:00Z", "content": "From 2003 to 2009, Lynne Faulds Wood returned to breakfast television, as Consumer Champion on GMTV. In 2006 she joined Esther Rantzen on the BBC consumer series Old Dogs, New Tricks, then in 2014 she and Sophie Raworth presented Watchdog Test House.\r\nShe was… [+848 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Les Steed", "title": "How does key worker testing work and what time can I apply for a coronavirus test? - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11469520/key-worker-coronavirus-testing-how-what-time/", "urlToImage": null, "publishedAt": "2020-04-24T17:35:15Z", "content": "MATT HANCOCK announced that testing can now be provided for up to seven million key workers and emergency staff.\r\nHere's how to get tested if you are an essential worker who believes that you or a household member has coronavirus.\r\n Matt Hancock said key work… [+6641 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nIzzy Lyons", "title": "Scots could see 'bubble' of friends after lockdown, as exit strategies of UK nations start to fracture - Telegraph.co.uk", "description": "The first ministers of Wales, Scotland and Northern Ireland have all proposed respective exit strategies this week", "url": "https://www.telegraph.co.uk/politics/2020/04/24/scots-could-allowed-see-bubble-friends-lockdown-nicola-sturgeon/", "urlToImage": null, "publishedAt": "2020-04-24T17:27:00Z", "content": "First Minister Arlene Foster also indicated that Northern Ireland could divert from a one-size-fits-all approach this week, stating that different regions of the UK could emerge from the restrictions at a different pace.\r\nAn ally of Mrs Foster told the Telegr… [+1771 chars]"}, {"source": {"id": null, "name": "Inews.co.uk"}, "author": "Alex Nelson", "title": "Lyrid meteor shower 2020: here's how to watch the Lyrids in the UK tonight, and when the meteors peak - inews", "description": "The ancient Chinese are said to have watched Lyrid meteors falling 'like rain' in the year 687 BC", "url": "https://inews.co.uk/news/science/lyrid-meteor-shower-2020-uk-tonight-how-watch-when-lyrids-peak-time-2543707", "urlToImage": null, "publishedAt": "2020-04-24T16:50:00Z", "content": "The ancient Chinese are said to have watched Lyrid meteors falling 'like rain' in the year 687 BC\r\nFriday, 24th April 2020, 5:48 pm\r\nUpdated Friday, 24th April 2020, 5:50 pm\r\nMembers of the York Astronomical Society prepare to view a meteor shower in 2015 (Ph… [+3239 chars]"}, {"source": {"id": null, "name": "Indy100.com"}, "author": "Joanna Taylor", "title": "Tom Hanks wrote a letter to a boy named Corona who was being bullied and it's perfect - indy100", "description": "", "url": "https://www.indy100.com/article/tom-hanks-typewriter-young-fan-corona-australia-9482646", "urlToImage": null, "publishedAt": "2020-04-24T15:01:29Z", "content": "People are obsessed with \"hero\" Tom Hanks's heartwarming gesture to an eight-year-old boy being bullied because his name is Corona. \r\nCorona De Vries, who lives on Australia's Gold Coast, wrote to Tom Hanks and his wife Rita Wilson in early April to wish them… [+1923 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jonathan Chadwick For Mailonline", "title": "Tropical coral reefs are being transformed by climate change - Daily Mail", "description": "Climate change and warming seas are severely bleaching tropical coral reefs and undoing decades of knowledge about how to protect these delicate and vital ecosystems.", "url": "https://www.dailymail.co.uk/sciencetech/article-8253723/Tropical-coral-reefs-transformed-climate-change.html", "urlToImage": null, "publishedAt": "2020-04-24T14:50:45Z", "content": "Coral reefs are so fundamentally damaged by climate change that decades of research on how to protect them may not even still be applicable, scientists say.  \r\nIn a study of coral over 20 years, UK scientists found that a warming climate undoes decades of kno… [+6834 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Harry Pettit", "title": "iPhone ‘text bomb’ crashes your mobile with bizarre ‘Italian flag emoji’ message - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11470739/iphone-text-bomb-crashes-your-mobile-with-italian-flag-emoji-and-a-sindhi-character/", "urlToImage": null, "publishedAt": "2020-04-24T13:00:02Z", "content": "A NEW iPhone hack lets people crash your mobile by sending you a simple string of letters.\r\nApple fans on social media warn the \"text bomb\" is triggered when a victim receives a message - and it can force your iPad and Mac to crash, too.\r\n A new text bomb is … [+4436 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Harry Pettit", "title": "Starlink satellites will be ‘low and bright’ over UK TONIGHT – best time to see Elon Musk probes on Thurs - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11465432/how-to-see-starlink-elon-musk-spacex-satelite-uk-4/", "urlToImage": null, "publishedAt": "2020-04-24T07:59:04Z", "content": "BRIT stargazers are bracing for another dazzling satellite display tonight - the fourth over the UK this week.\r\nThe super-bright \"Starlink\" satellites are operated by US rocket company SpaceX and will produce what could be their most spectacular showing so fa… [+10751 chars]"}]}