{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Brittany Vonow", "title": "Coronavirus home and drive-through tests for key workers snapped up within one hour as thousands flock to - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11478016/coronavirus-tests-key-workers-website/", "urlToImage": null, "publishedAt": "2020-04-25T10:41:54Z", "content": "CORONAVIRUS home and drive-through tests for key workers have been snapped up within one hour today as thousands flock to the website.\r\nBy 8.21am the government's website told hopefuls the applications for DIY kits were closed while drive-through tests were b… [+6398 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Lucy Campbell", "title": "Coronavirus UK: test slots run out for second day running – latest updates - The Guardian", "description": "Questions over independence of Sage group come as UK death toll nears 20,000", "url": "https://www.theguardian.com/world/live/2020/apr/25/coronavirus-uk-calls-for-transparency-over-scientific-advice-to-ministers-latest-updates", "urlToImage": null, "publishedAt": "2020-04-25T10:41:00Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jason Groves Political Editor For The Daily Mail Jack Elsom Amie Gordon For Mailonline", "title": "Ex-Chanceller Philip Hammond says it's time Britain gets back to work - Daily Mail", "description": "Former Chancellor Philip Hammond has today warned the country cannot afford to wait until a vaccine is available before resuming more normal economic activity.", "url": "https://www.dailymail.co.uk/news/article-8256159/Ex-Chanceller-Philip-Hammond-says-time-Britain-gets-work.html", "urlToImage": null, "publishedAt": "2020-04-25T10:34:45Z", "content": "Philip Hammond today urged the government to face the 'reality' that the UK must get back to work while people are still suffering with Covid-19.\r\nThe Former Chancellor has told the Government to publish an exit plan outlining a strategy to ease the coronavir… [+55175 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Freddie Keighley", "title": "Ole Gunnar Solskjaer's plan to fit transfer target Jack Grealish into Man Utd team - Mirror Online", "description": "The Red Devils are in pole position to sign the Aston Villa captain - and they have decided he will line up in an unconventional role should he move to Old Trafford", "url": "https://www.mirror.co.uk/sport/football/transfer-news/ole-gunnar-solskjaers-plan-fit-21924780", "urlToImage": null, "publishedAt": "2020-04-25T10:33:54Z", "content": "Manchester United are already planning which position long-term transfer target Jack Grealish will be deployed in ahead of a potential move this summer. \r\nAston Villa star Grealish is contracted until 2023, but is heavily linked with a £60m transfer to Old Tr… [+2022 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Jedidajah Otte", "title": "UK coronavirus: public urged to observe lockdown despite weekend sunshine - The Guardian", "description": "People reminded to stay at home as calls grow for easing of coronavirus restrictions", "url": "https://www.theguardian.com/world/2020/apr/25/public-urged-to-observe-lockdown-despite-weekend-sunshine", "urlToImage": null, "publishedAt": "2020-04-25T09:55:51Z", "content": null}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Faye Brown", "title": "People could see '10 friends and family members' if lockdown eased - Metro.co.uk", "description": "Ministers are mulling over plans to relax strict ‘stay at home’ advice to ease loneliness and isolation.", "url": "https://metro.co.uk/2020/04/25/people-see-10-friends-family-members-plans-ease-lockdown-12608249/", "urlToImage": null, "publishedAt": "2020-04-25T09:53:44Z", "content": "People could meet up with friends and family in other households under plans to lift lockdown (Picture: SWNS)\r\nPeople could be allowed to socialise with up to 10 of their closest family and friends if lockdown rules are lifted.\r\nMinisters are mulling over pla… [+3268 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Simon Peach", "title": "Premier League moves closer to behind closed doors return in June - The Independent", "description": "Discussions with broadcasters are ongoing to determine the best way to televise the season’s remaining matches", "url": "https://www.independent.co.uk/sport/football/premier-league/premier-league-coronavirus-restart-behind-closed-doors-june-tv-epl-a9483566.html", "urlToImage": null, "publishedAt": "2020-04-25T08:52:43Z", "content": "The Premier League is in discussions with UK rights holders about how best to broadcast the seasons remaining fixtures as the campaign edges closer to a return behind closed doors.\r\nIt is six weeks since the English top-flight was suspended in a bid to curb t… [+2018 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Katrina Turrill", "title": "Coronavirus symptoms: Heartbroken son reveals mum's first symptom before her death - Express", "description": "CORONAVIRUS symptoms have been shown to differ from person to person - while symptoms in some people appear mild, in others they present as more severe. A son has now spoken of his mum's first symptom before her death.", "url": "https://www.express.co.uk/life-style/health/1273717/coronavirus-symptoms-cases-death-feeling-unwell-cough", "urlToImage": null, "publishedAt": "2020-04-25T08:30:49Z", "content": "Graeme Anderson, 36, has described his mum’s first symptoms before her untimely death from COVID-19.\r\nSpeaking to Liverpool Echo, he explained his mum, June, had self-isolated for two weeks after a neighbour by her home tested positive for the disease.\r\nBut s… [+264 chars]"}, {"source": {"id": null, "name": "Edp24.co.uk"}, "author": "Caroline Culot", "title": "Housebuilder Persimmon to restart homes in sites across Norfolk UK after coronavirus lockdown | Latest Norfolk and Suffolk Business News - Eastern Daily Press", "description": "Housebuilder Persimmon, which has sites across Norfolk, is implementing a phased restart of work after its coronavirus shutdown.", "url": "https://www.edp24.co.uk/business/persimmon-to-start-rebuilding-houses-norfolk-coronavirus-1-6623896", "urlToImage": null, "publishedAt": "2020-04-25T08:12:00Z", "content": "PUBLISHED: 09:12 25 April 2020 | UPDATED: 10:16 25 April 2020\r\nCaroline Culot\r\nPersimmon is planning a phased re-opening of its sites after the coronavirus shutdown. Pic: Persimmon/Archant\r\nIt comes as Taylor Wimpey also announced it was reopening sites earli… [+967 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Australia and New Zealand mark Anzac Day in driveways - BBC News", "description": "Citizens, many holding candles, stand in silence in driveways to pay a dawn tribute to wartime dead.", "url": "https://www.bbc.com/news/world-australia-52406944", "urlToImage": null, "publishedAt": "2020-04-25T08:08:35Z", "content": "Image copyrightAFPImage caption\r\n Musicians across Australia and New Zeland paid tribute\r\nThousands of people across Australia and New Zealand have stood outside their homes at dawn to mark Anzac Day, after being urged to pay tribute even amid the coronavirus… [+3017 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Kathryn Batte For Mailonline", "title": "Raheem Sterling reveals Lionel Messi is the only shirt missing from his incredible collection - Daily Mail", "description": "The Manchester City winger revealed his desire to have a room in his house dedicated to trophies and another for the shirts he has picked up throughout his career.", "url": "https://www.dailymail.co.uk/sport/football/article-8255647/Raheem-Sterling-reveals-Lionel-Messi-shirt-missing-incredible-collection.html", "urlToImage": null, "publishedAt": "2020-04-25T08:00:01Z", "content": "Raheem Sterling is desperate to add a Lionel Messi shirt to his incredible match-worn collection.\r\nThe Manchester City winger revealed his desire to have a room in his house dedicated to trophies and another for the shirts he has picked up throughout his care… [+1598 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Brian McGleenon", "title": "Kim Jong-Un health fears after China ‘sends team of doctors to North Korea’ - Express.co.uk", "description": "CHINA has sent a team of doctors to North Korea to determine the status of Kim Jong-Un's health, insiders have claimed.", "url": "https://www.express.co.uk/news/world/1273723/kim-jong-un-health-latest-update-north-korea-china-doctors-kim-jong-un-dead-reports", "urlToImage": null, "publishedAt": "2020-04-25T07:59:00Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Lucy Needham", "title": "Kanye West declared a billionaire by Forbes but rapper insists they have 'undervalued him' - Mirror Online", "description": "The rapper was unhappy at being 'undervalued' by the magazine, despite being listed as worth more than make-up mogul sister-in-law Kylie Jenner.", "url": "https://www.mirror.co.uk/3am/celebrity-news/kanye-west-declared-billionaire-forbes-21924741", "urlToImage": null, "publishedAt": "2020-04-25T07:47:41Z", "content": "Kanye West is officially a billionaire, according to Forbes magazine.\r\nThe outlet says the rapper and fashion designer, who has long coveted the status, provided an eye-catching glimpse into his personal finances and valued his net worth at a whopping $1.3 bi… [+2644 chars]"}, {"source": {"id": null, "name": "Theguardian.comworld"}, "author": "Sarah Marsh, Nazia Parveen", "title": "England campaign targets seriously ill patients avoiding hospitals - The Guardian", "description": "Campaign will urge people with serious non-coronavirus-related conditions to seek help", "url": "https://amp.theguardian.comworld/2020/apr/25/england-campaign-targets-seriously-ill-patients-avoiding-hospitals", "urlToImage": null, "publishedAt": "2020-04-25T07:46:47Z", "content": "A government campaign has been launched to encourage people seriously ill with non-Covid conditions such as heart attacks to seek help amid concerns some are avoiding hospitals.\r\nThe campaign, which will be rolled out next week, aims to encourage people to us… [+4549 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Martyn James, Resolver.co.uk", "title": "What you can cancel without penalties during lockdown to save money - Mirror Online", "description": "Whether money's tight or not, continuing to shell out for services you don't need and in some cases can't even use during the coronavirus lockdown makes no sense - this is what you can ditch without fear of comeback", "url": "https://www.mirror.co.uk/money/what-you-can-can-cancel-21917083", "urlToImage": null, "publishedAt": "2020-04-25T07:12:24Z", "content": "While Britain is locked down everything from gyms to schools, restaurants and stadiums are closed, while travel is restricted to essential journey's only.\r\nBut what happens if you are paying for a subscription, membership or season ticket that is now effectiv… [+8087 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "WhatsApp update DOUBLES the maximum number of people in a video call - Express", "description": "WHATSAPP has expanded the maximum number of people who can take part in a video call at the same time - doubling the previous limit of four simultaneous callers. Just as before, these video calls will be end-to-end encrypted.", "url": "https://www.express.co.uk/life-style/science-technology/1273575/WhatsApp-Maximum-Number-People-Video-Call-Double-Limit-Update-iPhone-Android", "urlToImage": null, "publishedAt": "2020-04-25T06:42:31Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Jess Glass, Elaine McCahill", "title": "Brits urged to obey lockdown this weekend or 'face even stricter rules' - Mirror Online", "description": "Brits have been asked to adhere to social distancing rules as the UK goes into its fifth weekend in lockdown. Temperatures are expected to remain, prompting fears people will flout the rules.", "url": "https://www.mirror.co.uk/news/politics/brits-urged-obey-lockdown-weekend-21924571", "urlToImage": null, "publishedAt": "2020-04-25T06:33:38Z", "content": "Brits have been urged to obey lockdown and stay home this weekend, as temperatures are expected to remain high.\r\nForecasters have predicted warm conditions for most of the country over the weekend, prompting concerns about the \"danger\" that people may defy th… [+3846 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Zoe Wood", "title": "Will shoppers return to the UK high street after lockdown? - The Guardian", "description": "Retailers fear the coronavirus pandemic could permanently change consumer habits", "url": "https://www.theguardian.com/business/2020/apr/25/will-shoppers-return-to-the-uk-high-street-after-lockdown", "urlToImage": null, "publishedAt": "2020-04-25T06:03:46Z", "content": "Coronavirus has already triggered a wave of high street failures, from Oasis and Warehouse to Laura Ashley and Cath Kidston. Hundreds of thousands of retail workers have been furloughed, with the aim that they will return to the shop floor when stores are all… [+8636 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Katie Harris", "title": "NO CHANCE! Former MEP reveals why Boris will not extend transition period - Express.co.uk", "description": "BORIS JOHNSON will succeed in striking a post-Brexit free trade deal with the EU by the end of the year, an ex-MEP has predicted.", "url": "https://www.express.co.uk/news/politics/1273423/brexit-news-boris-johnson-free-trade-deal-transition-period-alexandra-phillips", "urlToImage": null, "publishedAt": "2020-04-25T06:00:00Z", "content": null}, {"source": {"id": null, "name": "Warringtonguardian.co.uk"}, "author": "Adam Everett", "title": "Man in hospital after being shot at house on Poplars Avenue - Warrington Guardian", "description": "A MAN was rushed to hospital after being shot at a house in Orford last night.", "url": "https://www.warringtonguardian.co.uk/news/18405294.man-hospital-shot-house-poplars-avenue/", "urlToImage": null, "publishedAt": "2020-04-25T05:55:00Z", "content": "A MAN was rushed to hospital after being shot at a house in Orford last night.\r\nCheshire Police received reports of a firearm being discharged at a property on Poplars Avenue shortly after 8.45pm yesterday, Friday.\r\nThe force has confirmed that a man was take… [+977 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Guardian sport", "title": "Philadelphia Eagles surprise with Jalen Hurts pick on day two of NFL draft - The Guardian", "description": "The Eagles selected Oklahoma quarterback Jalen Hurts in the second round of the NFL draft on Friday, a stunning move for a team with more pressing needs", "url": "https://www.theguardian.com/sport/2020/apr/25/nfl-draft-picks-day-two-jalen-hurts", "urlToImage": null, "publishedAt": "2020-04-25T04:20:00Z", "content": "After giving Carson Wentz a playmaker, the Philadelphia Eagles drafted his backup.\r\nThe Eagles selected Oklahoma quarterback Jalen Hurts in the second round of the NFL draft on Friday night, a stunning move for a team with more pressing needs.\r\nPhiladelphia h… [+10018 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Gursimran Hans", "title": "Trump’s new US Space Force to deploy surveillance telescope in Australia - Express.co.uk", "description": "THE US plans to construct a specialist space surveillance telescope at a facility in Western Australia.", "url": "https://www.express.co.uk/news/science/1273676/Space-news-USA-Australia-telescope-spy-track-debris-satellites", "urlToImage": null, "publishedAt": "2020-04-25T03:21:00Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Daily Mail Reporter", "title": "Coronavirus has made cancelling holidays a nightmare - here's the lowdown on refunds and vouchers - Daily Mail", "description": "This week we've been inundated by requests for help with coronavirus-related travel problems. We can't address them all, but we hope these answers will help.", "url": "https://www.dailymail.co.uk/travel/travel_news/article-8254941/Coronavirus-cancelling-holidays-nightmare-heres-lowdown-refunds-vouchers.html", "urlToImage": null, "publishedAt": "2020-04-25T03:19:22Z", "content": "This week weve been inundated by requests for help with coronavirus-related travel problems. Getting to the grocery shop is tricky enough these days, let alone organising a holiday.\r\nThis is especially true because no one knows exactly when travel restriction… [+9792 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Donald Trump cuts off daily coronavirus press briefing without taking questions for first time - ITV News", "description": "President Donald Trump has, for the first time, cut off his daily coronavirus task force briefing on Friday without taking any questions from reporters.\n\nThe briefings often stretch well beyond an hour Mr Trump often relishes the chance at the end to go toe-t…", "url": "https://www.itv.com/news/2020-04-25/white-house-cuts-off-coronavirus-briefing-without-taking-questions/", "urlToImage": null, "publishedAt": "2020-04-25T02:57:00Z", "content": "President Donald Trump has, for the first time, cut off his daily coronavirus task force briefing on Friday without taking any questions from reporters.\r\nThe briefings often stretch well beyond an hour Mr Trump often relishes the chance at the end to go toe-t… [+1428 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By James Pero For Dailymail.com", "title": "Apple and Google promise to discontinue COVID-19 tracking following the pandemic - Daily Mail", "description": "The decision to disable tech supporting contact tracing apps designed to monitor the spread of COVID-19 be made on a geographic basis according to representatives.", "url": "https://www.dailymail.co.uk/sciencetech/article-8255441/Apple-Google-promise-discontinue-COVID-19-tracking-following-pandemic.html", "urlToImage": null, "publishedAt": "2020-04-25T02:49:20Z", "content": "For the first time, Apple and Google have publicly committed to discontinuing their coronavirus tracking program once the pandemic is officially declared over.\r\nAs noted by The Verge, both companies committed to winding a contact tracing program down in a cal… [+2352 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Frank Skinner: Will Gompertz reviews the comedian's poetry podcast on Absolute Radio ★★★★☆ - BBC News", "description": "It's a simple idea presented by someone who brings insight to an art form that is enjoying a resurgence.", "url": "https://www.bbc.co.uk/news/entertainment-arts-52403782", "urlToImage": null, "publishedAt": "2020-04-25T02:48:36Z", "content": "Odd combinations have long been a staple of the entertainment industry. For those old enough to have seen it (still available on YouTube), who can forget Prince Edward's cringe-inducing toe-dip into television production with the culture-clash that was It's A… [+9008 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Helen Davidson", "title": "Coronavirus live news: Brazil’s health system on verge of collapse, medics warn - The Guardian", "description": "Leader of US group peddling bleach as ‘miracle’ cure wrote to Trump before remarks; Australia and New Zealand mark Anzac Day from driveways", "url": "https://www.theguardian.com/world/live/2020/apr/25/coronavirus-live-news-brazils-health-system-on-verge-of-collapse-medics-warn", "urlToImage": null, "publishedAt": "2020-04-25T02:17:45Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Niamh Cavanagh", "title": "Mecca’s Grand Mosque deserted on the first day of Ramadan as coronavirus lockdown bans crowds of worshippers - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11476931/meccas-grand-mosque-deserted-lockdown/", "urlToImage": null, "publishedAt": "2020-04-25T01:35:48Z", "content": "MECCA'S Grand Mosque was deserted on the first day of Ramadan as the coronavirus lockdown keeps the crowds away.\r\nThe Saudi Arabian mosque attracts more than 1million Muslims every year during the three weeks of Ramadan.\r\n The recent outbreak has affected the… [+3934 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Sam Corbishley", "title": "Twin sisters, 37, die three days apart after catching coronavirus - Metro.co.uk", "description": "Katy and Emma Davis 'always said they had come into the world together and would go out together as well'.", "url": "https://metro.co.uk/2020/04/24/twin-sisters-37-die-three-days-apart-catching-coronavirus-12607364/", "urlToImage": null, "publishedAt": "2020-04-24T21:15:35Z", "content": "Katy (left) and Emma Davis always said they had come into the world together and would go out together as well (Picture: PA)\r\nTwin sisters who had each worked as nurses have died within three days of each other after both testing positive for Covid-19.\r\nChild… [+2378 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Luke Hurst", "title": "Hubble at 30: Take a look back at some of the telescope's best images - Euronews", "description": "The Hubble Space Telescope turned 30 on Friday, and to mark the occasion Hubble released a fittingly awesome image.", "url": "https://www.euronews.com/2020/04/24/hubble-turns-30-take-a-look-back-at-some-of-the-space-telescope-s-best-images", "urlToImage": null, "publishedAt": "2020-04-24T21:06:33Z", "content": "The Hubble Space Telescope turned 30 on Friday, and to mark the occasion Hubble released a fittingly awesome image. \r\nShowing two nebulas, NGC 2020 and NGC 2014, some 163,000 light years from Earth, the image reveals part of a vast star-forming region in the … [+1048 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Matthew Lee", "title": "Travis Scott performs live to over 12m people in record-breaking Fortnite concert - GIVEMESPORT", "description": "Travis Scott performs live to over 12m people in record-breaking Fortnite concert", "url": "https://www.givemesport.com/1564673-travis-scott-performs-live-to-over-12m-people-in-recordbreaking-fortnite-concert", "urlToImage": null, "publishedAt": "2020-04-24T16:18:29Z", "content": "Popular musician Travis Scott has found a new way to keep his followers entertained - performing live to over 12 million people on the video game Fortnite.\r\nThe music industry is one of a number of sectors suffering as a result of the coronavirus pandemic.\r\nL… [+1570 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Samuel Osborne", "title": "UK coronavirus hospital death toll rises to 19,506 after 684 more deaths - The Independent", "description": "Meanwhile, government testing site crashes as it is overwhelmed with new bookings", "url": "https://www.independent.co.uk/news/health/uk-coronavirus-deaths-update-today-news-latest-nhs-england-a9482411.html", "urlToImage": null, "publishedAt": "2020-04-24T15:20:19Z", "content": "At least 19,506 people have died after testing positive for coronavirus at hospitals in the UK, the Department of Health has announced, after 684 deaths were recorded in the last 24 hours.\r\nSome 444,222 people have been tested for Covid-19, of which 143,464 t… [+3843 chars]"}, {"source": {"id": null, "name": "Indy100.com"}, "author": "Joanna Taylor", "title": "Tom Hanks wrote a letter to a boy named Corona who was being bullied and it's perfect - indy100", "description": "", "url": "https://www.indy100.com/article/tom-hanks-typewriter-young-fan-corona-australia-9482646", "urlToImage": null, "publishedAt": "2020-04-24T15:01:29Z", "content": "People are obsessed with \"hero\" Tom Hanks's heartwarming gesture to an eight-year-old boy being bullied because his name is Corona. \r\nCorona De Vries, who lives on Australia's Gold Coast, wrote to Tom Hanks and his wife Rita Wilson in early April to wish them… [+1923 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jonathan Chadwick For Mailonline", "title": "Tropical coral reefs are being transformed by climate change - Daily Mail", "description": "Climate change and warming seas are severely bleaching tropical coral reefs and undoing decades of knowledge about how to protect these delicate and vital ecosystems.", "url": "https://www.dailymail.co.uk/sciencetech/article-8253723/Tropical-coral-reefs-transformed-climate-change.html", "urlToImage": null, "publishedAt": "2020-04-24T14:50:45Z", "content": "Coral reefs are so fundamentally damaged by climate change that decades of research on how to protect them may not even still be applicable, scientists say.  \r\nIn a study of coral over 20 years, UK scientists found that a warming climate undoes decades of kno… [+6834 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Kevin Pocock", "title": "Sony’s WF-1000XM3 noise-cancelling headphones – £77 off, with Alexa BUILT IN - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11472205/sony-wf-1000xm3-noise-cancelling-headphones-bluetooth-deal-save/", "urlToImage": null, "publishedAt": "2020-04-24T13:39:03Z", "content": "OUT for exercise or at home enjoying some downtime, the right pair of headphones are a real bonus.\r\nThe best often require investment, and the Sony WF-1000XM3 set is one of them.\r\n The charging case should offer 3 additional full charges\r\nSonys premium WF-100… [+2068 chars]"}, {"source": {"id": null, "name": "Gizmodo.co.uk"}, "author": null, "title": "Apple iPhone SE: First Look Review - Gizmodo UK", "description": "Being able to get the best phone processor on the market in a sub-£500 phone is a real power move by Apple.", "url": "https://www.gizmodo.co.uk/2020/04/apple-iphone-se-first-look-review/", "urlToImage": null, "publishedAt": "2020-04-24T11:00:00Z", "content": "Last year, Google turned the mid-range phone market on its head by introducing the ludicrously-priced and well-specced Pixel 3a. A few other brands have followed suit since then, but none have been quite as exciting as the new iPhone SE. Now it truly seems li… [+9454 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Harry Pettit", "title": "Starlink satellites will be ‘low and bright’ over UK TONIGHT – best time to see Elon Musk probes on Thurs - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11465432/how-to-see-starlink-elon-musk-spacex-satelite-uk-4/", "urlToImage": null, "publishedAt": "2020-04-24T07:59:04Z", "content": "BRIT stargazers are bracing for another dazzling satellite display tonight - the fourth over the UK this week.\r\nThe super-bright \"Starlink\" satellites are operated by US rocket company SpaceX and will produce what could be their most spectacular showing so fa… [+10751 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Sophie Law", "title": "Scots to be told to 'cover mouth and nose with scarves' instead of masks during coronavirus outbreak - Daily Record", "description": "Scientists and politicians are set to meet today to discuss whether masks should be made compulsory.", "url": "https://www.dailyrecord.co.uk/news/health/scots-told-cover-mouth-nose-21915766", "urlToImage": null, "publishedAt": "2020-04-23T16:02:47Z", "content": "Scots are expected to be told to use scarves to cover their mouth and nose instead of wearing masks during the coronavirus outbreak, according to reports. \r\n The nation's top scientists have been discussing the benefits of masks, and whether they could slow t… [+1659 chars]"}]}