{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Geoff Earle, Deputy U.s. Political Editor For Dailymail.com", "title": "Donald Trump WALKS OUT of coronavirus briefing after his disinfectant disaster - Daily Mail", "description": "President Donald Trump avoided questions at his White House briefing Friday after giving conflicting responses on his proposed idea of treating coronavirus with disinfectants.", "url": "https://www.dailymail.co.uk/news/article-8255403/Donald-Trump-WALKS-coronavirus-briefing-disinfectant-disaster.html", "urlToImage": null, "publishedAt": "2020-04-25T06:44:18Z", "content": "President Donald Trump abruptly exited his daily White House press briefing Friday without taking a single question, after digging an increasingly deep hole over his comments about treating coronavirus patients with powerful disinfectants. \r\nThe event lasted … [+52759 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Jess Glass, Elaine McCahill", "title": "Brits urged to obey lockdown this weekend or 'face even stricter rules' - Mirror Online", "description": "Brits have been asked to adhere to social distancing rules as the UK goes into its fifth weekend in lockdown. Temperatures are expected to remain, prompting fears people will flout the rules.", "url": "https://www.mirror.co.uk/news/politics/brits-urged-obey-lockdown-weekend-21924571", "urlToImage": null, "publishedAt": "2020-04-25T06:33:38Z", "content": "Brits have been urged to obey lockdown and stay home this weekend, as temperatures are expected to remain high.\r\nForecasters have predicted warm conditions for most of the country over the weekend, prompting concerns about the \"danger\" that people may defy th… [+3846 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Rob Davies", "title": "We'll survive! Why Hays Travel owners have no regrets on Thomas Cook rescue - The Guardian", "description": "Irene and John Hays remain upbeat about takeover of 555 branches six months before coronavirus halted global travel", "url": "https://www.theguardian.com/business/2020/apr/25/hays-travel-owners-no-regrets-thomas-cook-rescue-john-irene-hays", "urlToImage": null, "publishedAt": "2020-04-25T06:03:33Z", "content": "When John and Irene Hays rescued Thomas Cooks 555 high street travel agencies out of administration last year, conventional wisdom suggested they were making a big mistake.\r\nThere was a widespread belief that the spectacular failure of the 178-year-old busine… [+6104 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Sian Cain", "title": "Sexy beats: How Normal People’s ‘intimacy coordinator’ works - The Guardian", "description": "Ita O’Brien, who worked on the BBC version of Sally Rooney’s novel, explains her often vexed role and how she helped with a story that depends on its sex scenes", "url": "https://www.theguardian.com/books/2020/apr/25/normal-people-intimacy-coordinator-works-sally-rooney-sex-scenes", "urlToImage": null, "publishedAt": "2020-04-25T06:00:53Z", "content": "Its easy to forget just how much sex there is in Sally Rooneys Normal People, when many of its greatest romantic beats are carried in a furtive glance or something left unsaid. But when putting the novels most intimate scenes between Marianne and Connell on s… [+4562 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Samuel Luckhurst", "title": "Every word of what Ed Woodward said in Manchester United statement to fans - Manchester Evening News", "description": "Man United executive vice-chairman Ed Woodward spoke at length at the start of the quarterly fans' forum on Friday.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-united-ed-woodward-transcript-18145485", "urlToImage": null, "publishedAt": "2020-04-25T05:10:19Z", "content": "The Manchester United executive vice-chairman Ed Woodward, managing director Richard Arnold, chief operating officer Collette Roche, and director of communications Charlie Brooks dialled into a video conference call for the quarterly fans' forum on Friday.\r\nT… [+7681 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Mark Douglas", "title": "The Newcastle United Supporters Trust call for new owners to take 'radical' steps as they back takeover - Chronicle Live", "description": "Newcastle United's Supporters Trust have backed the takeover as it enters the final stages of the Owners and Directors checks", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/newcastle-united-supporters-trust-call-18148851", "urlToImage": null, "publishedAt": "2020-04-25T05:04:28Z", "content": "The Newcastle United Supporters Trust has thrown its weight behind the potential takeover of the club after publishing a survey of members which showed overwhelming support for the buy out.\r\nA Trust survey has found 96.7% of their members are in favour of the… [+3515 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Daily Mail Reporter", "title": "Coronavirus has made cancelling holidays a nightmare - here's the lowdown on refunds and vouchers - Daily Mail", "description": "This week we've been inundated by requests for help with coronavirus-related travel problems. We can't address them all, but we hope these answers will help.", "url": "https://www.dailymail.co.uk/travel/travel_news/article-8254941/Coronavirus-cancelling-holidays-nightmare-heres-lowdown-refunds-vouchers.html", "urlToImage": null, "publishedAt": "2020-04-25T03:19:22Z", "content": "This week weve been inundated by requests for help with coronavirus-related travel problems. Getting to the grocery shop is tricky enough these days, let alone organising a holiday.\r\nThis is especially true because no one knows exactly when travel restriction… [+9792 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Matt Atherton", "title": "Coronavirus warning - does your poo look like this? The texture that could be COVID-19 - Express", "description": "CORONAVIRUS is a deadly infection that's easily spread, and the disease has killed almost 20,000 people in the UK. You could be at risk of COVID-19 symptoms if you develop this mild sign when you go to the toilet. What texture is your poo, and should you be c…", "url": "https://www.express.co.uk/life-style/health/1273471/coronavirus-symptoms-signs-covid-19-infection-toilet-loose-poo-diarrhoea", "urlToImage": null, "publishedAt": "2020-04-25T03:01:37Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Some states begin to reopen as US death toll passes 50,000 - BBC News", "description": "Georgia, Oklahoma and Alaska lift some restrictions despite warnings that it may be too soon.", "url": "https://www.bbc.co.uk/news/world-us-canada-52421730", "urlToImage": null, "publishedAt": "2020-04-25T02:38:21Z", "content": "Image copyrightReutersImage caption\r\n Salons and spas were allowed to reopen in Georgia\r\nThree US states have allowed some shops to reopen after measures imposed to curb the spread of the coronavirus, as the country's death toll passed 51,000.\r\nSalons and spa… [+3287 chars]"}, {"source": {"id": null, "name": "Cryptomoni.com"}, "author": "admin", "title": "Insurers estimate virus payouts to UK firms to be £1.2bn - Crypto Monitor News", "description": "Image copyright Getty Images Image caption UK companies face a cash flow crisis as many have been forced to close due to the lockdown Payouts to UK firms over coronavirus could cost £1.2bn, initial es", "url": "https://www.cryptomoni.com/insurers-put-virus-payouts-to-uk-firms-at-1-2bn/2387", "urlToImage": null, "publishedAt": "2020-04-25T01:52:56Z", "content": "Image copyrightGetty Images\r\nImage captionUK companies face a cash flow crisis as many have been forced to close due to the lockdown\r\nPayouts to UK firms over coronavirus could cost £1.2bn, initial estimates from the Association of British Insurers (ABI) indi… [+3398 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By David Churchill For The Daily Mail", "title": "Top EU negotiator Michel Barnier rages at deadlock as UK trade talks resume - Daily Mail", "description": "Britain locked horns with the EU over fishing rights yesterday after the first post-Brexit trade talks in more than a month.", "url": "https://www.dailymail.co.uk/news/article-8255455/Top-EU-negotiator-Michel-Barnier-rages-deadlock-UK-trade-talks-resume.html", "urlToImage": null, "publishedAt": "2020-04-25T01:45:25Z", "content": "Britain locked horns with the EU over fishing rights yesterday after the first post-Brexit trade talks in more than a month.\r\nBrussels chief negotiator Michel Barnier accused the UK of dragging its feet and warned negotiations could collapse by June.\r\nBut Bri… [+2515 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sophie Tanno For Mailonline", "title": "Captain Tom Moore, 99, 'is added to honours shortlist as nominations flood in' - Daily Mail", "description": "Captain Tom could now receive a CBE after his fundraising efforts for the National Health Service amid the coronavirus pandemic captured the hearts of the nation.", "url": "https://www.dailymail.co.uk/news/article-8255323/Captain-Tom-Moore-99-added-honours-shortlist-nominations-flood-in.html", "urlToImage": null, "publishedAt": "2020-04-25T01:44:34Z", "content": "Captain Tom Moore has reportedly been added to the honours shortlist after nominations for him flooded for him. \r\nThe war veteran from Bedfordshire raised £28 million for the NHS by walking laps of his garden.   \r\nCaptain Tom could now receive a CBE after his… [+5330 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Coronavirus dominates Saturday's newspaper front pages - ITV News - ITV News", "description": "Saturday’s papers are led by the possible easing of lockdown measures and a new treatment being trialled for Covid-19 patients.\n\nTreasury has issued a proposal to “get Britain back to work” with non-essential businesses to reopen in a “safe and practical way”…", "url": "https://www.itv.com/news/2020-04-25/what-the-papers-say-april-25/", "urlToImage": null, "publishedAt": "2020-04-25T01:38:00Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Jessica Glenza", "title": "Brazilian chloroquine study halted after high dose proved lethal for some patients - The Guardian", "description": "Concerns grow as the journal Nature raises alarm on serious heart risks associated with Covid-19 patients taking the drugs", "url": "https://www.theguardian.com/world/2020/apr/24/chloroquine-study-coronavirus-brazil", "urlToImage": null, "publishedAt": "2020-04-25T01:34:50Z", "content": "A Brazilian study investigating whether the anti-malaria drug chloroquine was effective in treating patients with Covid-19 was halted on safety concerns, after a high dose of the drug proved lethal for some patients.\r\nChloroquine, and a related drug, hydroxyc… [+3895 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Dominic Cummings attended meetings of key scientific group - BBC News", "description": "Downing Street confirms the PM's chief adviser attended Sage meetings but denies he is a member.", "url": "https://www.bbc.co.uk/news/uk-politics-52421744", "urlToImage": null, "publishedAt": "2020-04-25T00:41:20Z", "content": "Image copyrightReuters\r\nBoris Johnson's chief adviser, Dominic Cummings, has attended meetings of the scientific body advising the government on the coronavirus outbreak.\r\nHowever, Downing Street denied a report in the Guardian that Mr Cummings was a member o… [+2932 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Ian Doyle", "title": "Only realistic way Liverpool can now lose Premier League title - Liverpool Echo", "description": "Ian Doyle discusses Liverpool, the Premier League title and the void in the latest Blood Red column", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/only-realistic-way-liverpool-can-18148023", "urlToImage": null, "publishedAt": "2020-04-25T00:08:28Z", "content": "It's all about the void for Liverpool at present.\r\nAnd we're not talking about the prospect of the Premier League season being scrapped.\r\nWell, not exclusively, at any rate.\r\nInstead, it's the huge chasm that has been left by the absence of football - and, ju… [+3501 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Guardian sport", "title": "West Indies say Test tour of England has been postponed due to Covid-19 - The Guardian", "description": "The three-Test series between England and West Indies in June has been postponed due to the coronavirus outbreak", "url": "https://www.theguardian.com/sport/2020/apr/24/west-indies-test-tour-england-postponed-covid-19-cricket", "urlToImage": null, "publishedAt": "2020-04-24T23:20:55Z", "content": "The three-Test series between England and West Indies in June has been postponed due to the coronavirus outbreak, Cricket West Indies (CWI) said on Friday.\r\nWest Indies had been scheduled to play on 4-8 June at The Oval, 12-16 June at Edgbaston and 25-29 June… [+1600 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Are these seven targets being hit? - BBC News", "description": "Ministers have set targets for testing, medical equipment and hospital beds. Have they delivered?", "url": "https://www.bbc.com/news/52382786", "urlToImage": null, "publishedAt": "2020-04-24T23:04:26Z", "content": "Image copyrightGetty Images\r\nThe UK government has set various targets during its efforts to tackle the coronavirus outbreak. Have they been met?\r\n1. 25,000 tests a day by the middle of April\r\n\"We will massively scale up our testing capacity in the weeks ahea… [+7912 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: How do you social distance in schools? - BBC News", "description": "If pupils are allowed to return to school after the lockdown, how would they keep 2m apart?", "url": "https://www.bbc.com/news/uk-scotland-52412171", "urlToImage": null, "publishedAt": "2020-04-24T23:00:54Z", "content": "Image copyrightEPA\r\nThe Scottish government is considering if it is feasible for children to carry out physical distancing in schools once the lockdown is over. So how can you social distance in a school?\r\nWhat the government says\r\nThe Scottish government say… [+5434 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sara-Aisha Kent", "title": "Watchdog's Lynn Faulds Wood bravely beat cancer twice before tragic death from stroke - Mirror Online", "description": "Former Watchdog host Lynn Faulds Wood, who died today at the age of 72 from a \"massive\" stroke, beat both skin and bowel cancer before her death", "url": "https://www.mirror.co.uk/3am/celebrity-news/watchdogs-lynn-faulds-wood-bravely-21923092", "urlToImage": null, "publishedAt": "2020-04-24T22:44:05Z", "content": "Lynn Faulds Wood sadly died at the age of 72 from a stroke today. \r\nThe former Watchdog presenter battled cancer twice before she died and used her experience to help others who were diagnosed with the disease.\r\nShe bravely got through a diagnosis of skin can… [+2892 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: US death toll passes 50,000 in world's deadliest outbreak - BBC News", "description": "A grim milestone is passed by the world's deadliest outbreak, although US mortality rate is comparatively low.", "url": "https://www.bbc.com/news/world-us-canada-52415579", "urlToImage": null, "publishedAt": "2020-04-24T22:43:13Z", "content": "Image copyrightGetty Images\r\nThe US virus death toll has surpassed 50,000, according to data from Johns Hopkins University, in what is the world's deadliest Covid-19 outbreak.\r\nMore than 3,000 deaths came in the last 24 hours, and there are now over 870,000 c… [+3926 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Rebecca Speare-Cole", "title": "UK coronavirus lockdown faces stern test with public urged to stay home for fifth weekend running - Evening Standard", "description": "", "url": "https://www.standard.co.uk/news/uk/uk-coronavirus-lockdown-fifth-weekend-stern-test-a4423801.html", "urlToImage": null, "publishedAt": "2020-04-24T21:56:05Z", "content": "The UK's coronavirus lockdown faces a stern test with the public urged to stay home for a fifth weekend running.\r\nWith apparent signs of the shutdown measures working in stemming the infections spread, the public has been urged not to throw progress away by f… [+15772 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: test booking website swamped as thousands apply - BBC News - BBC News", "description": "A new government website, for key workers and their families to book coronavirus tests online, was forced to shut down for a time as it was swamped with requ...", "url": "https://www.youtube.com/watch?v=UI99jRFra_0", "urlToImage": null, "publishedAt": "2020-04-24T21:28:30Z", "content": "A new government website, for key workers and their families to book coronavirus tests online, was forced to shut down for a time as it was swamped with requests. \r\nAlmost 50,000 people in England tried to book a test just hours after the website launched. 16… [+530 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Luke Hurst", "title": "Hubble at 30: Take a look back at some of the telescope's best images - Euronews", "description": "The Hubble Space Telescope turned 30 on Friday, and to mark the occasion Hubble released a fittingly awesome image.", "url": "https://www.euronews.com/2020/04/24/hubble-turns-30-take-a-look-back-at-some-of-the-space-telescope-s-best-images", "urlToImage": null, "publishedAt": "2020-04-24T21:06:33Z", "content": "The Hubble Space Telescope turned 30 on Friday, and to mark the occasion Hubble released a fittingly awesome image. \r\nShowing two nebulas, NGC 2020 and NGC 2014, some 163,000 light years from Earth, the image reveals part of a vast star-forming region in the … [+1048 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": null, "title": "Facebook takes aim at Zoom with new video chat features - Financial Times", "description": "Zoom shares fall 10% as tech giant launches rival to apps made popular during lockdowns", "url": "https://www.ft.com/content/ceee381c-d42b-4f35-a2cb-2ae07a299ec8", "urlToImage": null, "publishedAt": "2020-04-24T21:01:19Z", "content": "Facebook is launching several multi-person video-chat features on its apps in a dash to compete with the popular tools from Zoom, Google and Houseparty that billions of people are using to socialise during the coronavirus crisis.\r\nThe world’s largest social m… [+2998 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Chris Edwards", "title": "Nintendo addresses major security breach - digitalspy.com", "description": "There have been reported incidents of unauthorised access to user accounts.", "url": "https://www.digitalspy.com/tech/a32270793/nintendo-security-breach/", "urlToImage": null, "publishedAt": "2020-04-24T20:38:00Z", "content": "Nintendo has addressed a major security breach as it encourages users to take new security steps. \r\nIn a statement on its official website, the gaming company said it is continuing to investigate recent incidents of unauthorised access to Nintendo Accounts, b… [+1827 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": null, "title": "Will American shale oil rise again? - Financial Times", "description": "Donald Trump’s efforts to end a price war backfired leaving the industry on its knees", "url": "https://www.ft.com/content/2d129e4a-860b-11ea-b872-8db45d5f6714", "urlToImage": null, "publishedAt": "2020-04-24T20:35:59Z", "content": "Asking Opec to help save the US oil sector was not part of Donald Trump’s vision of “American energy dominance”. The US president’s role in brokering a deal between Saudi Arabia and Russia to end a damaging price war was intended to prop up oil.\r\nInstead the … [+10293 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Saffron Otter", "title": "Government warns key workers not to ‘waste’ coronavirus test orders as 16,000 were booked online in first day - Manchester Evening News", "description": "Both Mr Shapps and Prof Harries insisted tests should only be ordered if key workers and their household have symptoms", "url": "https://www.manchestereveningnews.co.uk/news/uk-news/government-warns-key-workers-not-18148574", "urlToImage": null, "publishedAt": "2020-04-24T19:38:06Z", "content": "The government has warned some 10m key workers and their households not to waste booking a coronavirus test as 16,000 were ordered on the first day of the online launch.\r\nTransport Secretary Grant Shapps, who led Fridays government briefing, said the public s… [+2788 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Apple and Google accelerate coronavirus contact tracing apps plan - BBC News", "description": "Tech giants add privacy protections to the contact-tracing scheme they are offering to public authorities.", "url": "https://www.bbc.com/news/technology-52415593", "urlToImage": null, "publishedAt": "2020-04-24T19:29:34Z", "content": "Apple and Google have tightened privacy measures in the contact-tracing scheme they are offering to health authorities and brought forward its launch.\r\nThe tech giants now intend to release a software building block to developers on Tuesday, allowing them to … [+4500 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Jacob Jarvis", "title": "Twins, 37, who both worked as nurses die after both being diagnosed with coronavirus - Evening Standard", "description": "", "url": "https://www.standard.co.uk/news/uk/twins-die-coronavirus-katy-emma-davis-a4423746.html", "urlToImage": null, "publishedAt": "2020-04-24T19:02:10Z", "content": "Twin sisters who had both worked as nurses have died after both testing positive for coronavirus.\r\nThe pair died within three days of each other.\r\nChildrens nurse Katy Davis, 37, died at Southampton General Hospital on Tuesday while her identical twin, Emma, … [+1255 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Alex Woodward", "title": "US coronavirus death toll rises above 50,000 - The Independent", "description": "FDA warns against controversial drug promoted by Donald Trump as nation has world's deadliest outbreak", "url": "https://www.independent.co.uk/news/world/americas/us-coronavirus-death-toll-total-figure-cases-latest-update-a9482786.html", "urlToImage": null, "publishedAt": "2020-04-24T16:43:52Z", "content": "More than 50,000 people in the US have died within less than four months of the onset of the coronavirus outbreak as a patchwork response to the pandemic struggled to combat the spread of the virus.\r\nAt least 50,031 people in the US have died from Covid-19, a… [+2465 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Matthew Lee", "title": "Travis Scott performs live to over 12m people in record-breaking Fortnite concert - GIVEMESPORT", "description": "Travis Scott performs live to over 12m people in record-breaking Fortnite concert", "url": "https://www.givemesport.com/1564673-travis-scott-performs-live-to-over-12m-people-in-recordbreaking-fortnite-concert", "urlToImage": null, "publishedAt": "2020-04-24T16:18:29Z", "content": "Popular musician Travis Scott has found a new way to keep his followers entertained - performing live to over 12 million people on the video game Fortnite.\r\nThe music industry is one of a number of sectors suffering as a result of the coronavirus pandemic.\r\nL… [+1570 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Emily Goodin, Senior U.s. Political Reporter For Dailymail.com", "title": "Pentagon steps up investigation into whether coronavirus is linked to Chinese biological warfare - Daily Mail", "description": "The Pentagon and U.S. intelligence agencies are investigating whether the coronavirus could be used as a biological weapon as President Donald Trump ramps up his attacks on China.", "url": "https://www.dailymail.co.uk/news/article-8253669/Pentagon-steps-investigation-coronavirus-linked-Chinese-biological-warfare.html", "urlToImage": null, "publishedAt": "2020-04-24T16:15:28Z", "content": "The Pentagon and U.S. intelligence agencies are investigating whether the coronavirus could be used as a biological weapon as President Donald Trump ramps up his attacks on China.\r\nThe stepped up investigation does not mean officials are worried the disease w… [+12115 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jonathan Chadwick For Mailonline", "title": "Tropical coral reefs are being transformed by climate change - Daily Mail", "description": "Climate change and warming seas are severely bleaching tropical coral reefs and undoing decades of knowledge about how to protect these delicate and vital ecosystems.", "url": "https://www.dailymail.co.uk/sciencetech/article-8253723/Tropical-coral-reefs-transformed-climate-change.html", "urlToImage": null, "publishedAt": "2020-04-24T14:50:45Z", "content": "Coral reefs are so fundamentally damaged by climate change that decades of research on how to protect them may not even still be applicable, scientists say.  \r\nIn a study of coral over 20 years, UK scientists found that a warming climate undoes decades of kno… [+6834 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Rob Powell, political correspondent, and Greg Heffer, political reporter", "title": "Coronavirus test applications closed after 5,000 home kits ordered in two minutes - Sky News", "description": "Downing Street reveals that 5,000 home-testing kits were ordered within two minutes of the new website opening.", "url": "https://news.sky.com/story/coronavirus-online-applications-for-covid-19-tests-temporarily-closed-due-to-huge-demand-11978070", "urlToImage": null, "publishedAt": "2020-04-24T10:11:24Z", "content": null}, {"source": {"id": "independent", "name": "Independent"}, "author": "Andrew Griffin", "title": "iPhone text 'bomb' can crash iOS 13 with just a string of letters - The Independent", "description": "A Sindhi character and the Italian flag emoji can break phones, iPads, Macs and Apple Watches", "url": "https://www.independent.co.uk/life-style/gadgets-and-tech/news/iphone-text-letters-emoji-crash-apple-ios-latest-update-sindhi-flag-a9481456.html", "urlToImage": null, "publishedAt": "2020-04-24T08:19:49Z", "content": "A new Apple text \"bomb\" forces iPhones that receive it to crash.\r\nThe innocent-looking message which is made up of the Italian flag emoji and a Sindhi character overloads the device and forces it to shut down.\r\nIt works on Macs, Apple Watches and iPads as wel… [+11365 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Harry Pettit", "title": "Starlink satellites will be ‘low and bright’ over UK TONIGHT – best time to see Elon Musk probes on Thurs - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11465432/how-to-see-starlink-elon-musk-spacex-satelite-uk-4/", "urlToImage": null, "publishedAt": "2020-04-24T07:59:04Z", "content": "BRIT stargazers are bracing for another dazzling satellite display tonight - the fourth over the UK this week.\r\nThe super-bright \"Starlink\" satellites are operated by US rocket company SpaceX and will produce what could be their most spectacular showing so fa… [+10751 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Sean Martin", "title": "Lyrids meteor shower 2020: NASA cameras capture stunning fireballs - Express.co.uk", "description": "THE Lyrids meteor shower did not disappoint, with a plethora of shooting stars raining down on Earth.", "url": "https://www.express.co.uk/news/science/1272244/lyrids-meteor-shower-2020-nasa-pictures-fireball-shooting-stars-meteors", "urlToImage": null, "publishedAt": "2020-04-24T06:57:00Z", "content": null}]}