{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Boris Johnson back at Downing Street to lead response - BBC News", "description": "Boris Johnson will chair the morning cabinet meeting, just over two weeks after leaving hospital.", "url": "https://www.bbc.com/news/uk-52436471", "urlToImage": null, "publishedAt": "2020-04-27T01:54:30Z", "content": "Image copyrightGetty ImagesImage caption\r\n The PM last attended the government's daily briefing on 26 March\r\nBoris Johnson has returned to Downing Street to take charge of the UK's response to the coronavirus outbreak.\r\nThe prime minister will chair the regul… [+5123 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Grace MacRae", "title": "Dominic Raab makes grim social distancing announcement in latest lockdown update - Express", "description": "BRITONS could be forced to spend even more time away from loved ones after lockdown is lifted.", "url": "https://www.express.co.uk/news/uk/1274179/dominic-raab-news-social-distancing-lockdown-latest-coronavirus-boris-johnson-latest", "urlToImage": null, "publishedAt": "2020-04-27T01:25:38Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Larisa Brown  Political Correspondent", "title": "Furloughed British workers could pick fruit and veg suggests Environment Secretary - Daily Mail", "description": "The Environment Secretary has used the Government's daily press briefing to suggest furloughed British workers could plug the gap of fruit and veg pickers who have not migrated from Eastern Europe this year.", "url": "https://www.dailymail.co.uk/news/article-8259301/Furloughed-British-workers-pick-fruit-veg-suggests-Environment-Secretary.html", "urlToImage": null, "publishedAt": "2020-04-27T01:12:25Z", "content": "British workers furloughed during the coronavirus crisis will be encouraged to take a second job picking fruit and vegetables, the Environment Secretary said yesterday. \r\nGeorge Eustice said that although the international food chain was continuing to work we… [+1409 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Helen Sullivan, Richard Partington, Oliver Laughland", "title": "Coronavirus live news: Boris Johnson back in Number 10 as Trump denies he plans to fire health secretary - The Guardian", "description": "More US states to reopen; Italy to ease lockdown; Egypt asks IMF for bailout loan. Follow the latest updates", "url": "https://www.theguardian.com/world/live/2020/apr/27/coronavirus-live-news-boris-johnson-back-in-number-10-as-trump-denies-he-plans-to-fire-health-secretary", "urlToImage": null, "publishedAt": "2020-04-27T00:48:00Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Danyal Hussain For Mailonline", "title": "Kim Jong-un 'sent letter of thanks to builders who worked on tourism project' - Daily Mail", "description": "North Korean state newspaper Rodong Sinmun has now reported that Kim Jong-un has sent a personal letter to workers on a project in the city of Wonsan.", "url": "https://www.dailymail.co.uk/news/article-8259379/Kim-Jong-sent-letter-thanks-builders-worked-tourism-project.html", "urlToImage": null, "publishedAt": "2020-04-27T00:32:00Z", "content": "North Korean leader Kim Jong-un has sent a thank you message to builders working on a tourism project at a seaside resort, according to a state newspaper apparently eager to quash reports he may be dead. \r\nRumours have swirled about Kim's health, after he und… [+31283 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Joanna Crawley For Mailonline", "title": "Sarah-Jane Mee, 41, reveals she is planning a home birth with fiancé by her side - Daily Mail", "description": "Sarah-Jane Mee has spoken out on her change in birth plan amid the covid-19 pandemic.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8259465/Sarah-Jane-Mee-41-reveals-planning-home-birth-fianc-side.html", "urlToImage": null, "publishedAt": "2020-04-27T00:27:10Z", "content": "Sarah-Jane Mee has spoken out on her change in birth plan amid the covid-19 pandemic.\r\nThe Sky News host, who is 28 weeks pregnant, has revealed she is now planning to give birth to her first child at home, to ensure that her fiancé Ben Richardson can be by h… [+2737 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Ilford stabbing: Baby girl and three-year-old boy killed - BBC News", "description": "A 40-year-old man is being treated for knife injuries but police are not looking for anyone else.", "url": "https://www.bbc.com/news/uk-england-london-52436350", "urlToImage": null, "publishedAt": "2020-04-27T00:18:15Z", "content": "Image copyrightPA MediaImage caption\r\n Police were called to a property on Aldborough Road North\r\nA baby and a three-year-old boy have been stabbed to death at a home.\r\nPolice were called to reports of a man and two children injured in Aldborough Road North i… [+700 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Coronavirus: Italy to ease lockdown as daily deaths drop to lowest since March - Sky News", "description": "Italy's PM Giuseppe Conte lays out a long-awaited timetable of gradual measures that may offer some return to normality.", "url": "https://news.sky.com/story/coronavirus-italy-to-ease-lockdown-as-daily-deaths-drop-to-lowest-since-march-11979205", "urlToImage": null, "publishedAt": "2020-04-26T23:40:04Z", "content": null}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Sean McCormick", "title": "Former Newcastle United boss Kevin Keegan's 'I would love it' rant remembered on Match of the Day - Chronicle Live", "description": "Match of the Day Top 10s' podcast picked out the Premier League's 10 most bonkers moments this week", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/former-newcastle-united-boss-kevin-18153104", "urlToImage": null, "publishedAt": "2020-04-26T23:19:39Z", "content": "Match of the Day pundits Alan Shearer, Ian Wright and Gary Lineker have reminisced over Kevin Keegan's 'I would love it' rant.\r\nKeegan's Newcastle were 12 points clear at the top of the Premier League table at one stage during the 1995/96 season but had been … [+2517 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Gruffalo artist Axel Sheffler: 'This was something I could do to help' - BBC News", "description": "Axel Sheffler has rushed to publish a book which explains the coronavirus pandemic to children.", "url": "https://www.bbc.com/news/entertainment-arts-52414701", "urlToImage": null, "publishedAt": "2020-04-26T23:14:17Z", "content": "Image copyrightAxel SchefflerImage caption\r\n Axel Sheffler is well known for his illustrations in Julia Donaldson's The Gruafflo\r\n\"I don't feel like I'm very good at drawing real people in the real world\" says a wistful Axel Sheffler.\r\nThe illustrator is famo… [+2748 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Jasper Jolly", "title": "FTSE 100 firms using furlough scheme pay CEOs average of £3.6m - The Guardian", "description": "Companies claiming Covid-19 support will face pressure to cut executive salaries, a thinktank has said.", "url": "https://www.theguardian.com/business/2020/apr/27/ftse-100-firms-using-furlough-scheme-pay-ceos-average-of-36m", "urlToImage": null, "publishedAt": "2020-04-26T23:05:54Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Martin Blackburn", "title": "Man Utd ready to flog Paul Pogba and Jesse Lingard in flash sale to raise funds for Jadon Sancho transfer - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11485211/man-utd-sell-pogba-transfer-sancho/", "urlToImage": null, "publishedAt": "2020-04-26T22:35:04Z", "content": "OLE GUNNAR SOLSKJAER could be forced into a major clear out to boost his end of season transfer kitty.\r\nAnd that could include cashing in on Paul Pogba if a sizeable offer comes in for the French World Cup winner.\r\n Man Utd could sell Pogba and Lingard to fun… [+1572 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Oliver Laughland, Bryan Armen Graham, Tom Lutz", "title": "Coronavirus US live: Maryland's Republican governor concerned over Trump's 'mixed messages' – as it happened - The Guardian", "description": "Larry Hogan says state’s Covid-19 hotline received ‘hundreds of calls’ following Trump’s comments", "url": "https://www.theguardian.com/world/live/2020/apr/26/coronavirus-us-latest-news-trump-birx-cuomo-updates", "urlToImage": null, "publishedAt": "2020-04-26T22:34:50Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Chris Kitching", "title": "Smethwick stabbing: Man, 20, dies after being knifed in chest in broad daylight attack - Mirror Online", "description": "An \"extremely distressing\" video shows the man being stabbed in the chest at Cross Shopping Centre in Smethwick, near Birmingham - West Midlands Police have urged people not to share it", "url": "https://www.mirror.co.uk/news/uk-news/breaking-smethwick-stabbing-man-20-21930187", "urlToImage": null, "publishedAt": "2020-04-26T22:23:32Z", "content": "A murder investigation has been launched after a 20-year-old was stabbed to death in a horrifying incident captured on camera.\r\nMobile phone footage posted on social media shows the young man being knifed in the chest and then falling to the floor outside a s… [+3032 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Manchester United's Scott McTominay says he turned down loan to prove himself at club - Sky Sports", "description": "Scott McTominay says he turned down the opportunity to leave Manchester United on loan in order to prove himself at Old Trafford.", "url": "https://www.skysports.com/football/news/11667/11979006/manchester-uniteds-scott-mctominay-says-he-turned-down-loan-to-prove-himself-at-club", "urlToImage": null, "publishedAt": "2020-04-26T22:16:29Z", "content": "Scott McTominay says he turned down the opportunity to leave Manchester United on loan in order to prove himself at Old Trafford.\r\nThe Scotland international has established himself as an important member of Ole Gunnar Solskjaer's midfield this season - which… [+1613 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Matt Barlow for the Daily Mail", "title": "Alan Pardew sets the record straight as he opens up on his Dutch adventure so far - Daily Mail", "description": "EXCLUSIVE INTERVIEW: Alan Pardew could only sit and wait for the phone call. There was nothing else to do as the fate of ADO Den Haag's season was debated in a series of video conference calls.", "url": "https://www.dailymail.co.uk/sport/football/article-8259085/Alan-Pardew-sets-record-straight-opens-Dutch-adventure-far.html", "urlToImage": null, "publishedAt": "2020-04-26T22:02:45Z", "content": "Alan Pardew could only sit and wait for the phone call. There was nothing else to do as the fate of ADO Den Haag's season was debated and then fixed in a series of video conference calls involving the Dutch football authorities.\r\nWhen it came, on Friday, the … [+9190 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: children in Spain leave homes for first time in 6 weeks - BBC News - BBC News", "description": "Spain, which has had one of the strictest lockdowns in Europe, is allowing children to leave their homes, if they're with an adult, for the first time in six...", "url": "https://www.youtube.com/watch?v=ykUvfGAA8nk", "urlToImage": null, "publishedAt": "2020-04-26T21:42:38Z", "content": null}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Jacob Geanous", "title": "Thousands of people crowd California beach despite ongoing coronavirus crisis - Metro.co.uk", "description": "Metro.co.uk: News, Sport, Showbiz, Celebrities from Metro", "url": "https://metro.co.uk/2020/04/26/thousands-people-crowd-california-beach-despite-ongoing-coronavirus-crisis-12613642/", "urlToImage": null, "publishedAt": "2020-04-26T21:08:04Z", "content": "Thousands of people flocked to beaches in Southern California after the restrictions on beaches were loosened. (Picture: AP/Getty Images)\r\nThousands of Californians flocked to the beach despite the ongoing coronavirus crisis after the state experienced its fi… [+1873 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nTim Wallace", "title": "UK faces longer recession as Britons refuse to go out even after lockdown is lifted - Telegraph.co.uk", "description": "The campaign to 'stay home, save lives' has been so effective that only 10pc plan to go back to their old ways after the pandemic ends", "url": "https://www.telegraph.co.uk/business/2020/04/26/uk-faces-longer-recession-britons-refuse-go-even-lockdown-lifted/", "urlToImage": null, "publishedAt": "2020-04-26T21:00:00Z", "content": "More than one-third of respondents said they will remain a bit cautious while more than four in 10 will be extremely cautious.\r\nAnother 13pc intend to remain in self-isolation regardless. \r\nIt means the hit to the economy will last for some time. \r\nThe figure… [+519 chars]"}, {"source": {"id": null, "name": "Mylondon.news"}, "author": "Laura Hartley", "title": "London coronavirus: The hospitals where more patients have died as London death toll reaches more than 4,600 - MyLondon", "description": "In London the figure for positive tests stands at 23,341.", "url": "https://www.mylondon.news/news/zone-1-news/london-coronavirus-hospitals-180-more-18154404", "urlToImage": null, "publishedAt": "2020-04-26T20:19:00Z", "content": "The number of people in London who have died from coronavirus has reached over 4,600.\r\nAs earlier reported on our live blog, a further 64 people have died from coronavirus in London, compared to yesterdays figure of 126.\r\n In London the figure for positive te… [+5998 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Why the winners of Race Across the World have decided to give away their prize money - Telegraph.co.uk", "description": null, "url": "https://www.telegraph.co.uk/travel/news/race-across-the-world-winners/", "urlToImage": null, "publishedAt": "2020-04-26T20:02:00Z", "content": "Hours and hours spent on long-haul buses are the best way to experience a countrys beating heart.\r\nThis is the verdict of the winners of BBC series Race Across the World, which came to a crescendo on Sunday night; the show saw teams compete to reach Ushuaia, … [+3320 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Coronavirus: Dartmoor Zoo saved from imminent closure after 'phenomenal' flood of donations - Sky News", "description": "The zoo was fast running out of cash - but can now survive for at least another month.", "url": "https://news.sky.com/story/coronavirus-dartmoor-zoo-saved-from-imminent-closure-after-phenomenal-flood-of-donations-11979181", "urlToImage": null, "publishedAt": "2020-04-26T19:45:10Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "More US states begin lifting virus lockdown orders - BBC News", "description": "Some Americans can resume going to restaurants, cinemas and nail salons starting this week.", "url": "https://www.bbc.co.uk/news/world-us-canada-52435648", "urlToImage": null, "publishedAt": "2020-04-26T18:34:17Z", "content": "Image copyrightGetty ImagesImage caption\r\n Some businesses have already been allowed to reopen in several states\r\nMore US states are beginning to lift lockdown orders even as US leaders say social distancing guidelines will be necessary throughout the summer.… [+3326 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": null, "title": "Branson races to find Virgin Atlantic investor in rescue attempt - Financial Times", "description": "Entrepreneur denies that an outright sale of the airline is on the cards", "url": "https://www.ft.com/content/5d099f3b-8ea3-40e0-bb28-91918fe85cdb", "urlToImage": null, "publishedAt": "2020-04-26T17:32:28Z", "content": "Virgin Atlantic is racing to find new investors within the next month in a process that could reduce the 51 per cent stake held by billionaire founder Richard Branson. \r\nThe Financial Times revealed last week that the airline had hired investment bank Houliha… [+3234 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nDaniel Wighton", "title": "Germany changes track on contact-tracing app over privacy concerns - Telegraph.co.uk", "description": "Users' data will no longer be stored centrally - a set-up that critics said made it vulnerable to abuse", "url": "https://www.telegraph.co.uk/news/2020/04/26/germany-changes-track-contact-tracing-app-privacy-concerns/", "urlToImage": null, "publishedAt": "2020-04-26T17:21:00Z", "content": "The German government on Sunday switched to backing a coronavirus-tracing app using technology supported by Google and Apple, ditching a German-led alternative that had come under fire over privacy concerns.\r\nThe original app was set to store users contact tr… [+3675 chars]"}, {"source": {"id": null, "name": "Leicestermercury.co.uk"}, "author": "Maia Snow, Ian Hughes, Laura Hartley", "title": "Live updates as SpaceX Starlink satellites pass through night skies over Leicestershire twice - Leicestershire Live", "description": "Here's what to expect tonight", "url": "https://www.leicestermercury.co.uk/news/local-news/live-updates-spacex-starlink-satellites-4080075", "urlToImage": null, "publishedAt": "2020-04-26T17:01:43Z", "content": "All week, Elon Musk's Starlink satellites have been causing a stir across the county as they have been seen shooting across the sky.\r\nThere are another two chances to see them tonight (April 26), so get wrapped up warm and head into the garden to see the ligh… [+541 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Luke Andrews For Mailonline", "title": "Contact tracing app to be released in weeks could help prevent Covid-19 infections - Daily Mail", "description": "Professor Christophe Fraser, from Oxford University's Big Data Institute, said 60 per cent of the UK population - or 40 million - would need to download the app.", "url": "https://www.dailymail.co.uk/news/article-8258493/Contact-tracing-app-released-weeks-help-prevent-Covid-19-infections.html", "urlToImage": null, "publishedAt": "2020-04-26T16:44:25Z", "content": "A contact tracing app could prevent one Covid-19 infection for every one to two users who download it, an expert advising the government has said.\r\nProfessor Christophe Fraser, from Oxford University's Big Data Institute, heaped praise on the app but said 60 … [+4739 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nEd Clowes", "title": "The week that changed oil: how fortunes were lost and made in a matter of minutes - Telegraph.co.uk", "description": "The historic oil price crash saw prices plunge to less than $0", "url": "https://www.telegraph.co.uk/business/2020/04/26/week-changed-oil-howfortunes-lost-made-matter-minutes/", "urlToImage": null, "publishedAt": "2020-04-26T12:26:00Z", "content": "But coronavirus has made that almost impossible. More than three billion people around the world are on lockdown, meaning that no one is using any oil.\r\nMany traders are stashing away their barrels in the hope that lockdowns are lifted later this year, and pr… [+2548 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Joe Roberts", "title": "Donald Trump says briefings 'aren't worth the effort' after disinfectant fiasco - Metro.co.uk", "description": "Donald Trump has suggested he may pull back from his daily press briefings.", "url": "https://metro.co.uk/2020/04/26/sulky-trump-says-briefings-arent-worth-effort-disinfectant-fiasco-12611678/", "urlToImage": null, "publishedAt": "2020-04-26T12:05:00Z", "content": "Donald Trump has hinted he may pull back from his daily press briefings (Picture: AP)\r\nDonald Trump has hit out at the lamestream media, complaining that his press briefings on coronavirus are not worth the time and effort.\r\nThe outburst comes following wides… [+3517 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "Facebook takes on Zoom with 50-way video calls in Messenger Rooms - TechRadar", "description": "Do you have that many friends?", "url": "https://www.techradar.com/news/facebook-takes-on-zoom-with-50-way-video-calls-in-messenger-rooms", "urlToImage": null, "publishedAt": "2020-04-26T10:30:00Z", "content": "Video calling software is hugely popular at the moment, for obvious reasons, with Zoom the main beneficiary. Now Facebook wants more of the video calling market, and has introduced a new tool called Messenger Rooms.\r\nAs Facebook explains in a blog post, Messe… [+1509 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "Time to ditch WhatsApp and Houseparty? Google just made a huge change to your video calls - Express", "description": "GOOGLE has rolled out a colossal change to its video chat application, Google Duo, that promises to dramatically boost the video quality - even when making calls on sluggish home internet connections. Coupled with a number of new features added to the app, it…", "url": "https://www.express.co.uk/life-style/science-technology/1273369/Ditch-WhatsApp-Houseparty-Video-Calls-Google-Duo-Quality-Streaming-Slow-Internet-WiFi", "urlToImage": null, "publishedAt": "2020-04-26T09:43:00Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Fay Watson", "title": "Normal People: Daisy Edgar-Jones stars in trailer for new series - Express", "description": "NORMAL PEOPLE is the much-anticipated adaptation of Sally Rooney's novel. Here's what Express.co.uk thought of the new series.", "url": "https://www.express.co.uk/showbiz/tv-radio/1273629/Normal-People-review-series-BBC-Three-Hulu-Sally-Rooney-Paul-Mescal-Daisy-Edgar-Jones", "urlToImage": null, "publishedAt": "2020-04-26T08:02:54Z", "content": null}, {"source": {"id": null, "name": "Nottinghampost.com"}, "author": "Joseph Locker", "title": "Your best pictures of the Starlink satellites, Venus and the night sky in Nottinghamshire - Nottinghamshire Live", "description": "Reduced pollution and much less air traffic has resulted in clearer skies", "url": "https://www.nottinghampost.com/news/local-news/your-best-pictures-starlink-satellites-4078868", "urlToImage": null, "publishedAt": "2020-04-26T05:09:00Z", "content": "These pictures show some of the remarkable astronomical sights that residents across Nottinghamshire have spotted in the past week.\r\nSince the UK was placed into lockdown amid the coronavirus pandemic on March 23, the sky has become clearer as a result of red… [+4316 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Gursimran Hans", "title": "Coronavirus ‘Game changer’ - Britain orders 50 million antibody testing kits - Express", "description": "THE GOVERNMENT has ordered production of up to 50 million new coronavirus antibody testing kits.", "url": "https://www.express.co.uk/news/uk/1273924/UK-coronavirus-latest-updates-antibody-testing-kits-order-June-ready", "urlToImage": null, "publishedAt": "2020-04-26T03:45:26Z", "content": null}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Former Apple designer drops Watch trivia on its fifth anniversary - Engadget", "description": "Imran Chaudhri, Apple’s design lead for hardware from 1995 to 2016, dropped some details about Apple Watch’s history on its fifth anniversary.  While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a re…", "url": "https://www.engadget.com/former-apple-designer-drops-watch-trivia-on-its-fifth-anniversary-144849444.html", "urlToImage": null, "publishedAt": "2020-04-25T18:39:26Z", "content": "Imran Chaudhri, Apple’s design lead for hardware from 1995 to 2016, dropped some details about Apple Watch’s history on its fifth anniversary. While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a rep… [+906 chars]"}, {"source": {"id": null, "name": "Heritagedaily.com"}, "author": "http://www.facebook.com/archaeologynews", "title": "Hubble celebrates its 30th anniversary with a tapestry of blazing starbirth - HeritageDaily - Archaeology News - HeritageDaily", "description": "Hubble Space Telescope's iconic images and scientific breakthroughs have redefined our view of the Universe. - Space & Planetary HeritageDaily - Archaeology News", "url": "https://www.heritagedaily.com/2020/04/hubble-celebrates-its-30th-anniversary-with-a-tapestry-of-blazing-starbirth/127932", "urlToImage": null, "publishedAt": "2020-04-25T15:49:09Z", "content": "Hubble Space Telescope’s iconic images and scientific breakthroughs have redefined our view of the Universe.\r\nTo commemorate three decades of scientific discoveries, this image is one of the most photogenic examples of the many turbulent stellar nurseries the… [+5184 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Test website closes after 'significant demand' - BBC News", "description": "Up to 10 million key workers and their households are eligible to book a test for coronavirus.", "url": "https://www.bbc.co.uk/news/uk-52405852", "urlToImage": null, "publishedAt": "2020-04-25T03:46:36Z", "content": "Image copyrightGetty ImagesImage caption\r\n Key workers trying to book tests were met with this message from the middle of Friday morning\r\nThe new website for key workers to book coronavirus tests has temporarily closed - hours after being opened by the govern… [+9603 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Charlotte Edwards", "title": "Stunning Lyrid meteor shower photos reveal fiery space rocks soaring over Earth - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11434347/lyrid-meteor-shower-photos-last-night/", "urlToImage": null, "publishedAt": "2020-04-22T10:13:27Z", "content": "THE Lyrid meteor shower reached its peak in the early hours of this morning, resulting in some amazing photos.\r\nThe first meteor shower of spring is taking over the sky this week so there is still time to try and get your own stunning snaps like the ones belo… [+3882 chars]"}]}