{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Jeremy Culley", "title": "Coronavirus: Italy offers UK hope by easing lockdown with bars to reopen in June - Mirror Online", "description": "The UK's coronavirus outbreak has closely tracked Italy's and Rome PM Giuseppe Conte has announced that the strict lockdown will start to be eased in a week's time with bars reopening in June", "url": "https://www.mirror.co.uk/news/world-news/italy-ease-coronavirus-lockdown-reopen-21930921", "urlToImage": null, "publishedAt": "2020-04-27T03:21:35Z", "content": "Italy is to ease its lockdown on May 4 and open bars and restaurants again in June after seven weeks of shutdown to curb coronavirus. \r\nSeen as Britain's blueprint with an outbreak two weeks ahead of the UK, Italy will allow factories and building sites to re… [+2341 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nJosh White", "title": "How to book a coronavirus test if you're a key worker - The Telegraph", "description": "Essential workers will be able to order a coronavirus test from the Government - here's how to do it and how to work out if you qualify", "url": "https://www.telegraph.co.uk/news/2020/04/27/essential-workers-key-coronavirus-test/", "urlToImage": null, "publishedAt": "2020-04-27T03:17:35Z", "content": "Food and other necessary goods\r\nFood chain workers, including those involved in production, processing, distribution, sale and delivery of goods.\r\nKey public services\r\nPostal workers, those required to run the justice system, religious staff, and those respon… [+928 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "April Roach", "title": "NHS coronavirus tracking app could prevent one case for every two people that download it - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11486606/nhs-coronavirus-tracking-app-could-lessen-spread/", "urlToImage": null, "publishedAt": "2020-04-27T01:59:19Z", "content": "A CONTACT tracing app could prevent one coronavirus infection for every one to two users who download it, said an expert advising the Government.\r\nProfessor Christophe Fraser, from the Oxford University's Big Data Institute said the app could be released \"wit… [+4410 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Boris Johnson back at Downing Street to lead response - BBC News", "description": "Boris Johnson will chair the morning cabinet meeting, just over two weeks after leaving hospital.", "url": "https://www.bbc.co.uk/news/uk-52436471", "urlToImage": null, "publishedAt": "2020-04-27T01:54:00Z", "content": "Image copyrightGetty ImagesImage caption\r\n The PM last attended the government's daily briefing on 26 March\r\nBoris Johnson has returned to Downing Street to take charge of the UK's response to the coronavirus outbreak.\r\nThe prime minister will chair the regul… [+5123 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Ilford stabbing: Baby girl and three-year-old boy killed - BBC News", "description": "A 40-year-old man is being treated for knife injuries but police are not looking for anyone else.", "url": "https://www.bbc.co.uk/news/uk-england-london-52436350", "urlToImage": null, "publishedAt": "2020-04-27T01:51:37Z", "content": "Image copyrightPA MediaImage caption\r\n Police were called to a property on Aldborough Road North\r\nA baby and a three-year-old boy have been stabbed to death at a home.\r\nPolice were called to reports of a man and two children injured in Aldborough Road North i… [+700 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Temperatures to fall after the lockdown's fifth sunny weekend - Sky News", "description": "The weather is expected to return to average for this time of year following days of sunshine.", "url": "https://news.sky.com/story/temperatures-to-fall-after-the-lockdowns-fifth-sunny-weekend-11979240", "urlToImage": null, "publishedAt": "2020-04-27T01:26:05Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Grace MacRae", "title": "Dominic Raab makes grim social distancing announcement in latest lockdown update - Express", "description": "BRITONS could be forced to spend even more time away from loved ones after lockdown is lifted.", "url": "https://www.express.co.uk/news/uk/1274179/dominic-raab-news-social-distancing-lockdown-latest-coronavirus-boris-johnson-latest", "urlToImage": null, "publishedAt": "2020-04-27T01:25:38Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Larisa Brown  Political Correspondent", "title": "Furloughed British workers could pick fruit and veg suggests Environment Secretary - Daily Mail", "description": "The Environment Secretary has used the Government's daily press briefing to suggest furloughed British workers could plug the gap of fruit and veg pickers who have not migrated from Eastern Europe this year.", "url": "https://www.dailymail.co.uk/news/article-8259301/Furloughed-British-workers-pick-fruit-veg-suggests-Environment-Secretary.html", "urlToImage": null, "publishedAt": "2020-04-27T01:12:25Z", "content": "British workers furloughed during the coronavirus crisis will be encouraged to take a second job picking fruit and vegetables, the Environment Secretary said yesterday. \r\nGeorge Eustice said that although the international food chain was continuing to work we… [+1409 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Danyal Hussain For Mailonline", "title": "Kim Jong-un 'sent letter of thanks to builders who worked on tourism project' - Daily Mail", "description": "North Korean state newspaper Rodong Sinmun has now reported that Kim Jong-un has sent a personal letter to workers on a project in the city of Wonsan.", "url": "https://www.dailymail.co.uk/news/article-8259379/Kim-Jong-sent-letter-thanks-builders-worked-tourism-project.html", "urlToImage": null, "publishedAt": "2020-04-27T00:32:00Z", "content": "North Korean leader Kim Jong-un has sent a thank you message to builders working on a tourism project at a seaside resort, according to a state newspaper apparently eager to quash reports he may be dead. \r\nRumours have swirled about Kim's health, after he und… [+31283 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Claire Bushey", "title": "Airbus is ‘bleeding cash’, says chief executive - Financial Times", "description": "News, analysis and comment from the Financial Times, the worldʼs leading global business publication", "url": "https://www.ft.com/content/230a0b31-77ef-4ebd-b85e-dfee7ba33eb7", "urlToImage": null, "publishedAt": "2020-04-26T23:22:17Z", "content": "Keep abreast of significant corporate, financial and political developments around the world.\r\nStay informed and spot emerging risks and opportunities with independent global reporting, expert\r\ncommentary and analysis you can trust."}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Callum Hoare", "title": "'Europe will be an inhabitable desert' Shocking footage exposes ‘unthinkable’ WW3 scenario - Express.co.uk", "description": "WORLD WAR 3 was more than just a possibility in the Eighties, and shocking unearthed footage shows how Britain was preparing for the 'unthinkable' scenario.", "url": "https://www.express.co.uk/news/world/1274077/world-war-3-bbc-panorama-cold-war-soviet-union-nuclear-arms-race-nato-spt", "urlToImage": null, "publishedAt": "2020-04-26T23:18:29Z", "content": null}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Gruffalo artist Axel Sheffler: 'This was something I could do to help' - BBC News", "description": "Axel Sheffler has rushed to publish a book which explains the coronavirus pandemic to children.", "url": "https://www.bbc.com/news/entertainment-arts-52414701", "urlToImage": null, "publishedAt": "2020-04-26T23:14:17Z", "content": "Image copyrightAxel SchefflerImage caption\r\n Axel Sheffler is well known for his illustrations in Julia Donaldson's The Gruafflo\r\n\"I don't feel like I'm very good at drawing real people in the real world\" says a wistful Axel Sheffler.\r\nThe illustrator is famo… [+2748 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "'He said it was the stupidest idea he had ever seen' - BBC News", "description": "How Abigail Forsyth set up and grew the popular reusable cup business, KeepCup.", "url": "https://www.bbc.com/news/business-52366981", "urlToImage": null, "publishedAt": "2020-04-26T23:07:40Z", "content": "Image copyrightKeepCupImage caption\r\n Abigail and her brother wanted to give coffee-drinkers a reusable option when it came to cups\r\nThe BBC's weekly The Boss series profiles different business leaders from around the world. This week we speak to Abigail Fors… [+5835 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "NewsClicks", "title": "More US states begin lifting virus lockdown orders - NewsClicks", "description": "Image copyright Getty Images Image caption Some companies have already been allowed to reopen in a number of states More US states are starting to elevate lockdown orders whilst US leaders say social distancing tips can be essential all through the summer sea…", "url": "https://www.bbc.co.uk/news/world-us-canada-52435648", "urlToImage": null, "publishedAt": "2020-04-26T23:00:24Z", "content": "Image copyrightGetty Images\r\nImage captionSome companies have already been allowed to reopen in a number of states\r\nMore US states are starting to elevate lockdown orders whilst US leaders say social distancing tips can be essential all through the summer sea… [+3548 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Matt Barlow for the Daily Mail", "title": "Alan Pardew sets the record straight as he opens up on his Dutch adventure so far - Daily Mail", "description": "EXCLUSIVE INTERVIEW: Alan Pardew could only sit and wait for the phone call. There was nothing else to do as the fate of ADO Den Haag's season was debated in a series of video conference calls.", "url": "https://www.dailymail.co.uk/sport/football/article-8259085/Alan-Pardew-sets-record-straight-opens-Dutch-adventure-far.html", "urlToImage": null, "publishedAt": "2020-04-26T22:02:45Z", "content": "Alan Pardew could only sit and wait for the phone call. There was nothing else to do as the fate of ADO Den Haag's season was debated and then fixed in a series of video conference calls involving the Dutch football authorities.\r\nWhen it came, on Friday, the … [+9190 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Oscar Paul", "title": "Newcastle’s £300m Saudi takeover leaves success-starved Toon fans in a moral maze… here SunSport reviews pros - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11484894/newcastles-saudi-takeover-toon-fans/", "urlToImage": null, "publishedAt": "2020-04-26T21:53:54Z", "content": "WITH the world set to be their oyster, the moral dilemma facing Newcastle fans is stark.\r\nGet on board with a £300million Saudi-led takeover and go on the ride of a lifetime, or speak out against a pariah state that still beheads its citizens?\r\n Mohammad Bin … [+5740 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Tara Fitzpatrick", "title": "Nicola Sturgeon missing six Cobra meetings was 'the norm', says health secretary - Daily Record", "description": "Jeane Freeman defended the First Minister at a press conference in Edinburgh today.", "url": "https://www.dailyrecord.co.uk/news/scottish-news/nicola-sturgeon-cobra-missing-six-21929240", "urlToImage": null, "publishedAt": "2020-04-26T20:38:10Z", "content": "Nicola Sturgeons absence from coronavirus Cobra meetings was the norm, the Scottish Health Secretary has said. \r\n Chairing a press briefing at St Andrews House in Edinburgh this afternoon, Jeane Freeman MSP responded to reports, made by our sister title The S… [+2067 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Rianne Addo For Mailonline", "title": "Jessie J sparks reconciliation rumours with on-off beau Channing Tatum - Daily Mail", "description": "The singer, 32, marked the screen star's 40th birthday with a sweet Instagram message on Sunday, despite claims they called it quits for a second time earlier this month.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8259031/Jessie-J-sparks-reconciliation-rumours-beau-Channing-Tatum.html", "urlToImage": null, "publishedAt": "2020-04-26T20:32:32Z", "content": "Jessie J has sparked rumours she's back with her on-off boyfriend, actor Channing Tatum.\r\nThe singer, 32, marked the screen star's 40th birthday with a sweet Instagram message on Sunday, despite claims they called it quits for a second time earlier this month… [+4171 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": null, "title": "Type 2 diabetes symptoms: Five signs you could have nerve damage from high blood sugar - Express", "description": "TYPE 2 diabetes left untreated can lead to serious complications. One such consequence is nerve damage. What are the five signs you could have it?", "url": "https://www.express.co.uk/life-style/health/1274140/type-2-diabetes-high-blood-sugar-nerve-damage-peripheral-neuropathy", "urlToImage": null, "publishedAt": "2020-04-26T20:30:21Z", "content": "Type 2 diabetes is the result of high blood sugar levels. This can damage nerves inside the body. What are the five signs you're suffering from it?\r\nNerves carry messages between the brain and every part of the body.\r\nWhen the nerves are damaged by high blood… [+947 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Why the winners of Race Across the World have decided to give away their prize money - Telegraph.co.uk", "description": null, "url": "https://www.telegraph.co.uk/travel/news/race-across-the-world-winners/", "urlToImage": null, "publishedAt": "2020-04-26T20:02:00Z", "content": "Hours and hours spent on long-haul buses are the best way to experience a countrys beating heart.\r\nThis is the verdict of the winners of BBC series Race Across the World, which came to a crescendo on Sunday night; the show saw teams compete to reach Ushuaia, … [+3320 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Rupert Neate", "title": "Virgin Atlantic hires bank in search for emergency funds - The Guardian", "description": "More than 100 potential investors contacted to help keep grounded airline afloat", "url": "https://www.theguardian.com/business/2020/apr/26/virgin-atlantic-hires-bank-in-search-for-emergency-funds", "urlToImage": null, "publishedAt": "2020-04-26T19:45:35Z", "content": "Sir Richard Bransons Virgin Atlantic has hired the investment bank Houlihan Lokey to try to find investors willing to inject emergency funding into the transatlantic airline to avert its collapse into administration.\r\nIt is understood more than 100 potential … [+3168 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Coronavirus: Dartmoor Zoo saved from imminent closure after 'phenomenal' flood of donations - Sky News", "description": "The zoo was fast running out of cash - but can now survive for at least another month.", "url": "https://news.sky.com/story/coronavirus-dartmoor-zoo-saved-from-imminent-closure-after-phenomenal-flood-of-donations-11979181", "urlToImage": null, "publishedAt": "2020-04-26T19:45:10Z", "content": null}, {"source": {"id": null, "name": "Gloucestershirelive.co.uk"}, "author": "Jenni Phillips", "title": "Just one coronavirus death recorded in Gloucestershire in past 24 hours - Gloucestershire Live", "description": "Only one additional COVID-19 death has been recorded across NHS settings in Gloucestershire in the past 24 hours", "url": "https://www.gloucestershirelive.co.uk/news/health/just-one-coronavirus-death-recorded-4080616", "urlToImage": null, "publishedAt": "2020-04-26T19:42:08Z", "content": "One more person has died from coronavirus in Gloucestershire, the lowest increase in fatalities from the virus in recent weeks.\r\nThe death, at one of the county's two main hospitals at Cheltenham General Hospital or Gloucestershire Royal Hospital, was the onl… [+1026 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Alex Woodward", "title": "'Hambergers' and 'Noble prizes': Trump attacks press in furious Twitter rant riddled with spelling errors - The Independent", "description": "President lashes out at report detailing his eating habits and TV news addiction", "url": "https://www.independent.co.uk/news/world/americas/us-politics/donald-trump-latest-coronavirus-hamburger-nobel-prize-russia-a9485006.html", "urlToImage": null, "publishedAt": "2020-04-26T19:31:01Z", "content": "Donald Trump has threatened to strip reporters of \"Noble prizes\" and sue media outlets over their reporting that confirmed Russian interference in US elections and within the president's 2016 campaign.\r\nIn a furious, misspelled Twitter rant on Sunday, the pre… [+10844 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Mikael McKenzie", "title": "Man Utd chief Ed Woodward makes transfer decision which could end Jadon Sancho pursuit - Express", "description": "Manchester United have set out the maximum price they are willing to spend on a player this summer.", "url": "https://www.express.co.uk/sport/football/1274107/Man-Utd-Ed-Woodward-transfer-decision-Jadon-Sancho", "urlToImage": null, "publishedAt": "2020-04-26T18:02:21Z", "content": null}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Australians download COVIDSafe contact tracing app - BBC News", "description": "The government app notifies users if they have had contact with a user who has Covid-19.", "url": "https://www.bbc.com/news/world-australia-52433340", "urlToImage": null, "publishedAt": "2020-04-26T17:03:54Z", "content": "Image copyrightEPAImage caption\r\n Use of the Australian government's new coronavirus tracing app \"COVIDSafe\" is voluntary - but ministers hope it will be widely downloaded\r\nMore than a million Australians have downloaded a coronavirus contact tracing app with… [+2183 chars]"}, {"source": {"id": null, "name": "Leicestermercury.co.uk"}, "author": "Maia Snow, Ian Hughes, Laura Hartley", "title": "Live updates as SpaceX Starlink satellites pass through night skies over Leicestershire twice - Leicestershire Live", "description": "Here's what to expect tonight", "url": "https://www.leicestermercury.co.uk/news/local-news/live-updates-spacex-starlink-satellites-4080075", "urlToImage": null, "publishedAt": "2020-04-26T17:01:43Z", "content": "All week, Elon Musk's Starlink satellites have been causing a stir across the county as they have been seen shooting across the sky.\r\nThere are another two chances to see them tonight (April 26), so get wrapped up warm and head into the garden to see the ligh… [+541 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Children in Spain relish outdoor hour as lockdown eases - ITV News", "description": "Shrieks of joy rang out Sunday in the streets of Spain as children were allowed to leave their homes for the first time in six weeks.\n\nThe sound of children shouting and the rattle of bikes on the pavement after the 44-day seclusion of Spain’s youngest citize…", "url": "https://www.itv.com/news/2020-04-26/children-in-spain-relish-outdoor-hour-as-lockdown-eases/", "urlToImage": null, "publishedAt": "2020-04-26T16:17:00Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Diogo Jota: Wolves forward believes Premier League will be completed - BBC Sport", "description": "Wolves and Portugal forward Diogo Jota believes the Premier League will be completed despite the cancellation of some other European leagues because of coronavirus.", "url": "https://www.bbc.co.uk/sport/football/52435195", "urlToImage": null, "publishedAt": "2020-04-26T16:03:50Z", "content": "Diogo Jota joined Wolves from Atletico Madrid - initially on loan - in 2017\r\nWolves and Portugal forward Diogo Jota believes the Premier League will be completed despite the cancellation of some other European leagues because of coronavirus.\r\nThe Dutch Erediv… [+2904 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nEd Clowes", "title": "The week that changed oil: how fortunes were lost and made in a matter of minutes - Telegraph.co.uk", "description": "The historic oil price crash saw prices plunge to less than $0", "url": "https://www.telegraph.co.uk/business/2020/04/26/week-changed-oil-howfortunes-lost-made-matter-minutes/", "urlToImage": null, "publishedAt": "2020-04-26T12:26:00Z", "content": "But coronavirus has made that almost impossible. More than three billion people around the world are on lockdown, meaning that no one is using any oil.\r\nMany traders are stashing away their barrels in the hope that lockdowns are lifted later this year, and pr… [+2548 chars]"}, {"source": {"id": null, "name": "Sammobile.com"}, "author": "SamMobile", "title": "Here’s a Samsung smartphone with a pop-up camera because nothing makes sense anymore - SamMobile", "description": "Samsung hasn't really opted for any extraordinary solutions for the front camera just to achieve a higher screen-to-body ratio. It ...", "url": "https://www.sammobile.com/news/samsung-smartphone-pop-up-camera-nothing-makes-sense", "urlToImage": null, "publishedAt": "2020-04-26T11:51:34Z", "content": "Samsung hasn’t really opted for any extraordinary solutions for the front camera just to achieve a higher screen-to-body ratio. It has stuck with its Infinity-O, Infinity-V and Infinity-U notched solutions with the Galaxy A80 being the only exception.\r\nThe Ga… [+1732 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "Time to ditch WhatsApp and Houseparty? Google just made a huge change to your video calls - Express", "description": "GOOGLE has rolled out a colossal change to its video chat application, Google Duo, that promises to dramatically boost the video quality - even when making calls on sluggish home internet connections. Coupled with a number of new features added to the app, it…", "url": "https://www.express.co.uk/life-style/science-technology/1273369/Ditch-WhatsApp-Houseparty-Video-Calls-Google-Duo-Quality-Streaming-Slow-Internet-WiFi", "urlToImage": null, "publishedAt": "2020-04-26T09:43:00Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Robert Webb", "title": "'They were literally about to turn me off and on again': Robert Webb on his brush with mortality - The Guardian", "description": "A routine medical brought life-changing news for the comedian and author. And the curious thing was he’d predicted it in his new novel", "url": "https://www.theguardian.com/books/2020/apr/26/they-were-literally-about-to-turn-me-off-and-on-again-robert-webb-on-his-brush-with-mortality", "urlToImage": null, "publishedAt": "2020-04-26T09:00:55Z", "content": "There are moments when your life changes over the length of a single word. For example, you might remember that particular time you heard the word pregnant. Or maybe divorce or congratulations or guilty. And maybe you remember the silence that followed and ho… [+8084 chars]"}, {"source": {"id": null, "name": "Nottinghampost.com"}, "author": "Joseph Locker", "title": "Your best pictures of the Starlink satellites, Venus and the night sky in Nottinghamshire - Nottinghamshire Live", "description": "Reduced pollution and much less air traffic has resulted in clearer skies", "url": "https://www.nottinghampost.com/news/local-news/your-best-pictures-starlink-satellites-4078868", "urlToImage": null, "publishedAt": "2020-04-26T05:09:00Z", "content": "These pictures show some of the remarkable astronomical sights that residents across Nottinghamshire have spotted in the past week.\r\nSince the UK was placed into lockdown amid the coronavirus pandemic on March 23, the sky has become clearer as a result of red… [+4316 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Former Apple designer drops Watch trivia on its fifth anniversary - Engadget", "description": "Imran Chaudhri, Apple’s design lead for hardware from 1995 to 2016, dropped some details about Apple Watch’s history on its fifth anniversary.  While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a re…", "url": "https://www.engadget.com/former-apple-designer-drops-watch-trivia-on-its-fifth-anniversary-144849444.html", "urlToImage": null, "publishedAt": "2020-04-25T18:39:26Z", "content": "Imran Chaudhri, Apple’s design lead for hardware from 1995 to 2016, dropped some details about Apple Watch’s history on its fifth anniversary. While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a rep… [+906 chars]"}, {"source": {"id": null, "name": "Heritagedaily.com"}, "author": "http://www.facebook.com/archaeologynews", "title": "Hubble celebrates its 30th anniversary with a tapestry of blazing starbirth - HeritageDaily - Archaeology News - HeritageDaily", "description": "Hubble Space Telescope's iconic images and scientific breakthroughs have redefined our view of the Universe. - Space & Planetary HeritageDaily - Archaeology News", "url": "https://www.heritagedaily.com/2020/04/hubble-celebrates-its-30th-anniversary-with-a-tapestry-of-blazing-starbirth/127932", "urlToImage": null, "publishedAt": "2020-04-25T15:49:09Z", "content": "Hubble Space Telescope’s iconic images and scientific breakthroughs have redefined our view of the Universe.\r\nTo commemorate three decades of scientific discoveries, this image is one of the most photogenic examples of the many turbulent stellar nurseries the… [+5184 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Colin Drury", "title": "Coronavirus: Nasa develops ventilator tailored for Covid-19 patients in just 37 days - The Independent", "description": "'We know how to land on the moon and Mars, but building a medical device is new'", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-nasa-ventilators-vital-design-a9484036.html", "urlToImage": null, "publishedAt": "2020-04-25T15:36:59Z", "content": "Engineers at NASA have developed a ventilator specifically designed to help coronavirus patients.\r\nThe VITAL system Ventilator Intervention Technology Accessible Locally was created in just 37 days, the space agency says.\r\nNow, it has already passed critical … [+21785 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nLizzie Roberts", "title": "Contact tracing: how has it worked for other countries, and could it really help ease UK lockdown? - The Telegraph", "description": "From teams of 'corona detectives' to Army cadets making thousands of calls a day, countries are tracking the spread of Covid-19", "url": "https://www.telegraph.co.uk/news/2020/04/26/contact-tracing-what-how-work-countries-help-uk-lockdown/", "urlToImage": null, "publishedAt": "2020-04-25T13:41:28Z", "content": "Countries around the world are rushing to launch contact tracing apps to identify who an infected person has had contact with, as part of efforts to slow the spread of the coronavirus. \r\nThe UK Government has announced the infrastructure was being put in plac… [+1754 chars]"}]}