{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Paul Gorst", "title": "Manchester United chief Ed Woodward sends warning and Liverpool's plans could change - Liverpool Echo", "description": "Manchester United chief Ed Woodward believes the transfer market might look a lot different", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpools-plans-could-change-manchester-18149564", "urlToImage": null, "publishedAt": "2020-04-25T12:07:25Z", "content": "It's been 44 days since a ball has been kicked across any of Europe's top leagues.\r\nBut despite the inactivity, the ongoing uncertainty and crippling financial impact because of the coronavirus pandemic, there is one element of the modern game that simply ref… [+3869 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Mattha Busby", "title": "Bar Dominic Cummings from Sage meetings, Labour urges - The Guardian", "description": "Party raises concerns independence of group advising ministers on coronavirus has been compromised", "url": "https://www.theguardian.com/world/2020/apr/25/bar-dominic-cummings-from-sage-coronavirus-meetings-labour-urges", "urlToImage": null, "publishedAt": "2020-04-25T11:56:44Z", "content": "Labour has urged the government to stop the prime ministers chief political adviser, Dominic Cummings, from attending meetings of the secret scientific group advising on the coronavirus pandemic over concerns that its independence has been compromised.\r\nA lea… [+800 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Sian Elvin", "title": "Coronavirus UK death toll set to pass 20,000 today - Metro.co.uk", "description": "Chief scientific adviser Patrick Vallance said last month keeping the toll under that number would be 'a good outcome'.", "url": "https://metro.co.uk/2020/04/25/uk-coronavirus-death-toll-set-pass-20000-today-12608642/", "urlToImage": null, "publishedAt": "2020-04-25T11:51:12Z", "content": "The UK coronavirus death toll is set to pass 20,000 today\r\n(Picture: Our World in Data)\r\nBritain is likely to hit the grim milestone of 20,000 deaths due to coronavirus later on Saturday.\r\nThis is likely to happen when the daily count is added to the current … [+1683 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Coronavirus: Sunny spring weather fuels fears of lockdown busting - Sky News", "description": "With rising temperatures there are concerns the public could ignore social distancing rules and head for the parks and beaches.", "url": "https://news.sky.com/story/coronavirus-sunny-spring-weather-fuels-fears-of-lockdown-busting-11978626", "urlToImage": null, "publishedAt": "2020-04-25T11:35:41Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By James Wood For Mailonline", "title": "New figures show number of people visiting UK's A&E wards down by half this month - Daily Mail", "description": "Health officials are worried many people are not seeking treatment because they fear contracting Covid-19, thereby jeopardising their survival and potentially becoming collateral damage.", "url": "https://www.dailymail.co.uk/news/article-8256237/New-figures-number-people-visiting-UKs-E-wards-half-month.html", "urlToImage": null, "publishedAt": "2020-04-25T11:23:22Z", "content": "The NHS is launching a new campaign to make sure people seek urgent care during a medical emergency after visits to A&amp;E dropped by almost 50 per cent this month.\r\nHealth officials are worried many people are not seeking treatment because they fear contrac… [+23274 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Mark Kleinman", "title": "Coronavirus: Port Talbot-owner Tata Steel seeks £500m state bailout - Sky News", "description": "The Indian-owned steel producer has approached ministers to seek an emergency loan package, Sky News learns.", "url": "https://news.sky.com/story/coronavirus-port-talbot-owner-tata-steel-seeks-500m-state-bailout-11978645", "urlToImage": null, "publishedAt": "2020-04-25T11:19:22Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Zoe Zaczek For Daily Mail Australia", "title": "Jenny Morrison channels Meghan Markle while joining husband Scott to pay her respects on Anzac Day - Daily Mail", "description": "Mrs Morrison wore a beige three-quarter coat and beret as she paid respects to the nation's servicemen and servicewomen with husband Scott Morrison in Canberra on Saturday morning.", "url": "https://www.dailymail.co.uk/femail/article-8255551/Jenny-Morrison-channels-Meghan-Markle-joining-husband-Scott-pay-respects-Anzac-Day.html", "urlToImage": null, "publishedAt": "2020-04-25T11:00:04Z", "content": "Jenny Morrison has channelled Meghan Markle as she joined the Prime Minister for Anzac Day commemorations at the Australian War Memorial. \r\nMrs Morrison wore a beige three-quarter coat and beret as she paid respects to the nation's servicemen and servicewomen… [+2144 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Roisin O'Connor", "title": "Kanye West is unhappy with Forbes for saying he’s ‘only’ worth £1 billion - The Independent", "description": "Rapper, producer and Yeezy designer apparently texted the magazine to tell them how much he thought he was worth", "url": "https://www.independent.co.uk/arts-entertainment/music/news/kanye-west-billionaire-forbes-net-worth-2020-kylie-jenner-a9483641.html", "urlToImage": null, "publishedAt": "2020-04-25T10:17:32Z", "content": "Kanye West has officially reached billionaire status, as his line of sneakers was described as one of the great retail stores of the century.\r\nAccording to Forbes, the rapper, producer and fashion designer is said to have reached a net worth of $1.3bn (£1.05b… [+1116 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "REPLAYED: West Ham 0-2 Liverpool | Ox & Salah make it 19 points at the London Stadium - Liverpool FC", "description": "Relive the Reds' victory at the London Stadium, as Alex Oxlade-Chamberlain's well-taken goal was added to by a Mo Salah penalty to stretch LFC's lead at the ...", "url": "https://www.youtube.com/watch?v=knNR4bd5Dd8", "urlToImage": null, "publishedAt": "2020-04-25T09:57:14Z", "content": "Relive the Reds' victory at the London Stadium, as Alex Oxlade-Chamberlain's well-taken goal was added to by a Mo Salah penalty to stretch LFC's lead at the top of the Premier League.\r\nEnjoy more content and get exclusive perks in our Liverpool FC Members Are… [+197 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Jedidajah Otte", "title": "UK coronavirus: public urged to observe lockdown despite weekend sunshine - The Guardian", "description": "People reminded to stay at home as calls grow for easing of coronavirus restrictions", "url": "https://www.theguardian.com/world/2020/apr/25/public-urged-to-observe-lockdown-despite-weekend-sunshine", "urlToImage": null, "publishedAt": "2020-04-25T09:55:51Z", "content": null}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Faye Brown", "title": "People could see '10 friends and family members' if lockdown eased - Metro.co.uk", "description": "Ministers are mulling over plans to relax strict ‘stay at home’ advice to ease loneliness and isolation.", "url": "https://metro.co.uk/2020/04/25/people-see-10-friends-family-members-plans-ease-lockdown-12608249/", "urlToImage": null, "publishedAt": "2020-04-25T09:53:44Z", "content": "People could meet up with friends and family in other households under plans to lift lockdown (Picture: SWNS)\r\nPeople could be allowed to socialise with up to 10 of their closest family and friends if lockdown rules are lifted.\r\nMinisters are mulling over pla… [+3268 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Oli Smith", "title": "EU 'in denial' over Brexit - George Galloway exposes Brussels' desperate plot to stop exit - Express", "description": "GEORGE GALLOWAY has launched a scathing rebuke of the European Union's desperate attempt to cling onto the UK, claiming that Brussels are living 'in denial' over Brexit after top EU officials urged a two year delay to the exit.", "url": "https://www.express.co.uk/news/uk/1273741/EU-Brexit-talks-George-Galloway-Brussels-financial-bailout-Barnier-Boris-Johnson", "urlToImage": null, "publishedAt": "2020-04-25T09:41:51Z", "content": null}, {"source": {"id": "independent", "name": "Independent"}, "author": "Tom Kershaw", "title": "Newcastle supporters 97% in favour of takeover despite concerns over Saudi Arabia’s human rights record - The Independent", "description": "Alex Hurst, Trust chair, said: ‘This survey shows that the appetite for change at Newcastle United is enormous’", "url": "https://www.independent.co.uk/sport/football/premier-league/newcastle-takeover-supporters-premier-league-saudi-arabia-a9483621.html", "urlToImage": null, "publishedAt": "2020-04-25T09:41:22Z", "content": "A Newcastle United Supporters Trust survey of over 3,000 fans found that 96.7% of fans are in favour of the clubs controversial takeover.\r\nA consortium led by Amanda Staveley and backed by the Saudi Arabian sovereign wealth fund are on the verge of completing… [+3059 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Stephen Warwick", "title": "EU states 'being completely held hostage by Google and Apple' says official - Android Central", "description": "Apple and Google have rebuffed calls from France and Germany to support their contact tracing apps, which use centralized data containing user information.", "url": "https://www.androidcentral.com/eu-states-being-completely-held-hostage-google-and-apple-says-official", "urlToImage": null, "publishedAt": "2020-04-25T09:10:59Z", "content": "An EU official has said that Apple and Google are holding EU states hostage after they rebuffed further calls to support contact tracing solutions offered by France and Germany.\r\nAs Reuters reports:\r\nA standoff between the two largest nations in the European … [+2171 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Katrina Turrill", "title": "Coronavirus symptoms: Heartbroken son reveals mum's first symptom before her death - Express", "description": "CORONAVIRUS symptoms have been shown to differ from person to person - while symptoms in some people appear mild, in others they present as more severe. A son has now spoken of his mum's first symptom before her death.", "url": "https://www.express.co.uk/life-style/health/1273717/coronavirus-symptoms-cases-death-feeling-unwell-cough", "urlToImage": null, "publishedAt": "2020-04-25T08:30:49Z", "content": "Graeme Anderson, 36, has described his mum’s first symptoms before her untimely death from COVID-19.\r\nSpeaking to Liverpool Echo, he explained his mum, June, had self-isolated for two weeks after a neighbour by her home tested positive for the disease.\r\nBut s… [+264 chars]"}, {"source": {"id": null, "name": "Edp24.co.uk"}, "author": "Caroline Culot", "title": "Housebuilder Persimmon to restart homes in sites across Norfolk UK after coronavirus lockdown | Latest Norfolk and Suffolk Business News - Eastern Daily Press", "description": "Housebuilder Persimmon, which has sites across Norfolk, is implementing a phased restart of work after its coronavirus shutdown.", "url": "https://www.edp24.co.uk/business/persimmon-to-start-rebuilding-houses-norfolk-coronavirus-1-6623896", "urlToImage": null, "publishedAt": "2020-04-25T08:12:00Z", "content": "PUBLISHED: 09:12 25 April 2020 | UPDATED: 10:16 25 April 2020\r\nCaroline Culot\r\nPersimmon is planning a phased re-opening of its sites after the coronavirus shutdown. Pic: Persimmon/Archant\r\nIt comes as Taylor Wimpey also announced it was reopening sites earli… [+967 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Ellena Cruse", "title": "Donald Trump walks out of coronavirus press briefing without taking questions after criticism over disinfectant injection comments - Evening Standard", "description": "", "url": "https://www.standard.co.uk/news/world/donald-trump-cuts-off-coronavirus-briefing-no-reporter-questions-walks-out-a4423866.html", "urlToImage": null, "publishedAt": "2020-04-25T08:06:06Z", "content": "Donald Trump cut off his daily coronavirus task force briefing without taking any questions from reporters a day after he was slammed for suggesting disinfectant could be injected as a treatment.\r\nThe president walked out of the briefing room as journalists s… [+2039 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Sergio Moro: Brazil prosecutor requests Bolsonaro 'meddling' probe - BBC News", "description": "It comes after former justice minister Sergio Moro accused the president of political interference.", "url": "https://www.bbc.com/news/world-latin-america-52423473", "urlToImage": null, "publishedAt": "2020-04-25T08:05:47Z", "content": "Image copyrightReutersImage caption\r\n Sergio Moro was seen as a key figure in the government\r\nBrazil's top public prosecutor has requested clearance to investigate allegations of political interference by President Jair Bolsonaro.\r\nIt comes after Justice Mini… [+4982 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Martyn James, Resolver.co.uk", "title": "What you can cancel without penalties during lockdown to save money - Mirror Online", "description": "Whether money's tight or not, continuing to shell out for services you don't need and in some cases can't even use during the coronavirus lockdown makes no sense - this is what you can ditch without fear of comeback", "url": "https://www.mirror.co.uk/money/what-you-can-can-cancel-21917083", "urlToImage": null, "publishedAt": "2020-04-25T07:12:24Z", "content": "While Britain is locked down everything from gyms to schools, restaurants and stadiums are closed, while travel is restricted to essential journey's only.\r\nBut what happens if you are paying for a subscription, membership or season ticket that is now effectiv… [+8087 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "WhatsApp update DOUBLES the maximum number of people in a video call - Express", "description": "WHATSAPP has expanded the maximum number of people who can take part in a video call at the same time - doubling the previous limit of four simultaneous callers. Just as before, these video calls will be end-to-end encrypted.", "url": "https://www.express.co.uk/life-style/science-technology/1273575/WhatsApp-Maximum-Number-People-Video-Call-Double-Limit-Update-iPhone-Android", "urlToImage": null, "publishedAt": "2020-04-25T06:42:31Z", "content": null}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nAndrew Orlowski", "title": "Connecting the doubts over whether Hancock's coronavirus 'miracle app' is really the smart move - Telegraph.co.uk", "description": "The NHS hopes an app could be a game changer, but critics fear it may undermine the pandemic fight", "url": "https://www.telegraph.co.uk/business/2020/04/25/contact-tracing-could-halt-spread-virus-britons-unlikely-accept/", "urlToImage": null, "publishedAt": "2020-04-25T05:00:00Z", "content": "The problem, hardware engineers warn, is the integrity of the data on which the system would be based. Smartphones have four sources of data to help determine their location, and all have accuracy problems.\r\nThe civilian version of GPS only gives a four-metre… [+1365 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Manon Dark", "title": "Meghan Markle could face father in court as family tensions boil over - Express", "description": "MEGHAN MARKLE could face her father, Thomas Markle, in court over a dispute fuelled by an article published in the Mail on Sunday.", "url": "https://www.express.co.uk/news/royal/1273682/Meghan-Markle-royal-news-court-mail-on-sunday-sue-father-Thomas-Markle", "urlToImage": null, "publishedAt": "2020-04-25T04:53:13Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Gursimran Hans", "title": "Trump’s new US Space Force to deploy surveillance telescope in Australia - Express.co.uk", "description": "THE US plans to construct a specialist space surveillance telescope at a facility in Western Australia.", "url": "https://www.express.co.uk/news/science/1273676/Space-news-USA-Australia-telescope-spy-track-debris-satellites", "urlToImage": null, "publishedAt": "2020-04-25T03:21:00Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Helen Davidson", "title": "Coronavirus live news: Brazil’s health system on verge of collapse, medics warn - The Guardian", "description": "Leader of US group peddling bleach as ‘miracle’ cure wrote to Trump before remarks; Australia and New Zealand mark Anzac Day from driveways", "url": "https://www.theguardian.com/world/live/2020/apr/25/coronavirus-live-news-brazils-health-system-on-verge-of-collapse-medics-warn", "urlToImage": null, "publishedAt": "2020-04-25T02:17:45Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Norwich City defend furlough decision and could lose up to £35m - BBC Sport", "description": "Norwich City will \"stick to their guns\" on a decision to furlough non-playing staff and expect to lose up to £35m.", "url": "https://www.bbc.co.uk/sport/football/52409583", "urlToImage": null, "publishedAt": "2020-04-25T01:41:53Z", "content": "Norwich's last game before the suspension of English football was a 1-0 loss at Sheffield United on 7 March\r\nNorwich City will \"stick to their guns\" on a decision to furlough non-playing staff, with the club expected to lose up to £35m because of coronavirus.… [+2176 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Coronavirus dominates Saturday's newspaper front pages - ITV News - ITV News", "description": "Saturday’s papers are led by the possible easing of lockdown measures and a new treatment being trialled for Covid-19 patients.\n\nTreasury has issued a proposal to “get Britain back to work” with non-essential businesses to reopen in a “safe and practical way”…", "url": "https://www.itv.com/news/2020-04-25/what-the-papers-say-april-25/", "urlToImage": null, "publishedAt": "2020-04-25T01:38:00Z", "content": null}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Are these seven targets being hit? - BBC News", "description": "Ministers have set targets for testing, medical equipment and hospital beds. Have they delivered?", "url": "https://www.bbc.com/news/52382786", "urlToImage": null, "publishedAt": "2020-04-24T23:04:26Z", "content": "Image copyrightGetty Images\r\nThe UK government has set various targets during its efforts to tackle the coronavirus outbreak. Have they been met?\r\n1. 25,000 tests a day by the middle of April\r\n\"We will massively scale up our testing capacity in the weeks ahea… [+7912 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Tony Jones, Matthew Dresch", "title": "Prince Charles 'heartbroken' as he pays tribute to healthy teen who died alone of coronavirus - Mirror Online", "description": "Prince Charles has shared his heartbreak at the death of 13-year-old Ismail Mohamed Abdulwahab, from Brixton, London, who passed away on his own after contracting coronavirus", "url": "https://www.mirror.co.uk/news/uk-news/prince-charles-heartbroken-pays-tribute-21924145", "urlToImage": null, "publishedAt": "2020-04-24T22:57:32Z", "content": "The Prince of Wales has described how he was left \"utterly heartbroken\" by the \"tragic story\" of the 13-year-old Muslim boy who died alone after contracting Covid-19.\r\nCharles's comments were made in a video message to mark the start of the holy month of Rama… [+3267 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: test booking website swamped as thousands apply - BBC News - BBC News", "description": "A new government website, for key workers and their families to book coronavirus tests online, was forced to shut down for a time as it was swamped with requ...", "url": "https://www.youtube.com/watch?v=UI99jRFra_0", "urlToImage": null, "publishedAt": "2020-04-24T21:28:30Z", "content": null}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Sam Corbishley", "title": "Twin sisters, 37, die three days apart after catching coronavirus - Metro.co.uk", "description": "Katy and Emma Davis 'always said they had come into the world together and would go out together as well'.", "url": "https://metro.co.uk/2020/04/24/twin-sisters-37-die-three-days-apart-catching-coronavirus-12607364/", "urlToImage": null, "publishedAt": "2020-04-24T21:15:35Z", "content": "Katy (left) and Emma Davis always said they had come into the world together and would go out together as well (Picture: PA)\r\nTwin sisters who had each worked as nurses have died within three days of each other after both testing positive for Covid-19.\r\nChild… [+2378 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Luke Hurst", "title": "Hubble at 30: Take a look back at some of the telescope's best images - Euronews", "description": "The Hubble Space Telescope turned 30 on Friday, and to mark the occasion Hubble released a fittingly awesome image.", "url": "https://www.euronews.com/2020/04/24/hubble-turns-30-take-a-look-back-at-some-of-the-space-telescope-s-best-images", "urlToImage": null, "publishedAt": "2020-04-24T21:06:33Z", "content": "The Hubble Space Telescope turned 30 on Friday, and to mark the occasion Hubble released a fittingly awesome image. \r\nShowing two nebulas, NGC 2020 and NGC 2014, some 163,000 light years from Earth, the image reveals part of a vast star-forming region in the … [+1048 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Chris Edwards", "title": "Nintendo addresses major security breach - digitalspy.com", "description": "There have been reported incidents of unauthorised access to user accounts.", "url": "https://www.digitalspy.com/tech/a32270793/nintendo-security-breach/", "urlToImage": null, "publishedAt": "2020-04-24T20:38:00Z", "content": "Nintendo has addressed a major security breach as it encourages users to take new security steps. \r\nIn a statement on its official website, the gaming company said it is continuing to investigate recent incidents of unauthorised access to Nintendo Accounts, b… [+1827 chars]"}, {"source": {"id": null, "name": "Inews.co.uk"}, "author": "Alex Nelson", "title": "Lyrid meteor shower 2020: here's how to watch the Lyrids in the UK tonight, and when the meteors peak - inews", "description": "The ancient Chinese are said to have watched Lyrid meteors falling 'like rain' in the year 687 BC", "url": "https://inews.co.uk/news/science/lyrid-meteor-shower-2020-uk-tonight-how-watch-when-lyrids-peak-time-2543707", "urlToImage": null, "publishedAt": "2020-04-24T16:50:00Z", "content": "The ancient Chinese are said to have watched Lyrid meteors falling 'like rain' in the year 687 BC\r\nFriday, 24th April 2020, 5:48 pm\r\nUpdated Friday, 24th April 2020, 5:50 pm\r\nMembers of the York Astronomical Society prepare to view a meteor shower in 2015 (Ph… [+3239 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Matthew Lee", "title": "Travis Scott performs live to over 12m people in record-breaking Fortnite concert - GIVEMESPORT", "description": "Travis Scott performs live to over 12m people in record-breaking Fortnite concert", "url": "https://www.givemesport.com/1564673-travis-scott-performs-live-to-over-12m-people-in-recordbreaking-fortnite-concert", "urlToImage": null, "publishedAt": "2020-04-24T16:18:29Z", "content": "Popular musician Travis Scott has found a new way to keep his followers entertained - performing live to over 12 million people on the video game Fortnite.\r\nThe music industry is one of a number of sectors suffering as a result of the coronavirus pandemic.\r\nL… [+1570 chars]"}, {"source": {"id": null, "name": "Indy100.com"}, "author": "Joanna Taylor", "title": "Tom Hanks wrote a letter to a boy named Corona who was being bullied and it's perfect - indy100", "description": "", "url": "https://www.indy100.com/article/tom-hanks-typewriter-young-fan-corona-australia-9482646", "urlToImage": null, "publishedAt": "2020-04-24T15:01:29Z", "content": "People are obsessed with \"hero\" Tom Hanks's heartwarming gesture to an eight-year-old boy being bullied because his name is Corona. \r\nCorona De Vries, who lives on Australia's Gold Coast, wrote to Tom Hanks and his wife Rita Wilson in early April to wish them… [+1923 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Kevin Pocock", "title": "Sony’s WF-1000XM3 noise-cancelling headphones – £77 off, with Alexa BUILT IN - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11472205/sony-wf-1000xm3-noise-cancelling-headphones-bluetooth-deal-save/", "urlToImage": null, "publishedAt": "2020-04-24T13:39:03Z", "content": "OUT for exercise or at home enjoying some downtime, the right pair of headphones are a real bonus.\r\nThe best often require investment, and the Sony WF-1000XM3 set is one of them.\r\n The charging case should offer 3 additional full charges\r\nSonys premium WF-100… [+2068 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Harry Pettit", "title": "Starlink satellites will be ‘low and bright’ over UK TONIGHT – best time to see Elon Musk probes on Thurs - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11465432/how-to-see-starlink-elon-musk-spacex-satelite-uk-4/", "urlToImage": null, "publishedAt": "2020-04-24T07:59:04Z", "content": "BRIT stargazers are bracing for another dazzling satellite display tonight - the fourth over the UK this week.\r\nThe super-bright \"Starlink\" satellites are operated by US rocket company SpaceX and will produce what could be their most spectacular showing so fa… [+10751 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nAnna Mikhailova,", "title": "Scarves are no substitute for face masks in protecting against coronavirus, experts say - Telegraph.co.uk", "description": "Worries over supplies of masks for medical workers means Government advice could be to use alternative ways of covering their faces", "url": "https://www.telegraph.co.uk/politics/2020/04/23/scarves-no-substitute-face-masks-protecting-against-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-23T20:30:00Z", "content": "The governments plan to recommend scarves instead of face masks will not offer people the same level of protection from Covid-19, experts have warned.\r\nMinisters are considering the recommendation by the Scientific Advisory Group for Emergencies (Sage), which… [+1150 chars]"}]}