{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Joe Davies For Mailonline", "title": "Robert Webb told his heart would 'fail' due to undiagnosed condition mirroring the plot of his book - Daily Mail", "description": "Robert Webb, 47, had heart surgery for a mitral valve prolapse in October last year after writing his debut novel Come Again. The comedian accelerated the unknown condition with alcohol 'addiction'.", "url": "https://www.dailymail.co.uk/news/article-8258545/Robert-Webb-told-heart-fail-undiagnosed-condition-mirroring-plot-book.html", "urlToImage": null, "publishedAt": "2020-04-26T18:41:00Z", "content": "Comedian Robert Webb was told his heart would 'fail' due to an undiagnosed heart condition, at the same time he had finished a book that closely mirrored his reality.\r\nThe Peep Show star, 47, had just finished editing his novel Come Again where a central char… [+3487 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By William Cole For Mailonline", "title": "Britain's biggest steelmaker Tata Steel seeks taxpayer bailout of £500m - Daily Mail", "description": "It was reported the firm approached the UK and Welsh Governments for a £500m funding package after many customers, such as car manufacturers, halted production during the crisis.", "url": "https://www.dailymail.co.uk/news/article-8258747/Britains-biggest-steelmaker-Tata-Steel-seeks-taxpayer-bailout-500m.html", "urlToImage": null, "publishedAt": "2020-04-26T18:14:54Z", "content": "Britain's largest steel manufacturer will need £500 million in Government support to weather the coronavirus crisis, according to an MP.\r\nLabour MP Stephen Kinnock, whose Port Talbot constituency includes the Tata Steel's main steelworks plant said the compan… [+2514 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Rachael Kennedy, news reporter", "title": "Coronavirus: Boris Johnson arrives at Downing Street after COVID-19 recovery - Sky News", "description": "The prime minister is expected to return to work on Monday, and is said to be \"raring to go\" after his coronavirus recovery.", "url": "https://news.sky.com/story/coronavirus-boris-johnson-arrives-at-downing-street-after-covid-19-recovery-11979175", "urlToImage": null, "publishedAt": "2020-04-26T18:00:27Z", "content": null}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Spain records lowest daily death toll as lockdown eases - BBC News", "description": "The health ministry says 288 people have died of the virus, the lowest number since 20 March.", "url": "https://www.bbc.com/news/world-europe-52433659", "urlToImage": null, "publishedAt": "2020-04-26T17:52:14Z", "content": "Image copyrightReutersImage caption\r\n Spanish children under the age of 14 are now allowed outside one hour per day\r\nSpain, which has been one of the countries worst hit in the coronavirus pandemic, has reported its lowest daily death toll in more than a mont… [+2088 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Mark Smith", "title": "Police livid as walkers from Bristol and London arrive to climb Penyfan and Snowdon - Wales Online", "description": "Officers said they were 'in despair'", "url": "https://www.walesonline.co.uk/news/wales-news/police-livid-english-walkers-arrive-18153724", "urlToImage": null, "publishedAt": "2020-04-26T17:41:17Z", "content": "People from England have been issued with fines after driving to Penyfan and Snowdon to walk.\r\nOfficers stopped ten people in two separate cars who had driven in convoy from London to climb Wales' highest peak. They were all reported for breaching Covid-19 le… [+2228 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Ian Sample", "title": "Coronavirus UK: government assessing antibody test kits - The Guardian", "description": "Ministers are considering ordering millions of tests although concerns remain over their accuracy", "url": "https://www.theguardian.com/world/2020/apr/26/coronavirus-uk-government-assessing-antibody-test-kits", "urlToImage": null, "publishedAt": "2020-04-26T17:40:59Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Neal Baker", "title": "Who is Kim Jong-un’s wife Ri Sol-ju? Inside the life of North Korea’s first lady - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/5931989/kim-jong-un-wife-ri-sol-ju/", "urlToImage": null, "publishedAt": "2020-04-26T17:40:24Z", "content": "LIKE much of North Korea, the personal life of its dictator Kim Jong-un is shrouded in secrecy.\r\nLittle is known about his wife, Ri Sol-ju, but she is considered a favourite in the country, even being allowed to be named First Lady.\r\n Six years into his reign… [+4011 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Henry Martin For Mailonline Jack Maidment, Deputy Political Editor For Mailonline", "title": "Another 368 coronavirus deaths are recorded in UK today - the lowest figure this month - Daily Mail", "description": "The UK's coronavirus death toll increased by 413 today - the lowest recorded this month.", "url": "https://www.dailymail.co.uk/news/article-8258439/Another-368-coronavirus-deaths-recorded-UK-today-lowest-figure-month.html", "urlToImage": null, "publishedAt": "2020-04-26T16:44:34Z", "content": "The UK's coronavirus death toll increased by 413 today - the lowest recorded this month - as NHS bosses said social distancing is 'paying off' but warned breaking the rules now could result in a second peak of the deadly disease. \r\nStephen Powis, the national… [+28501 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Elisa Menendez", "title": "Supermarket food stocks ‘back to normal’, minister declares - Metro.co.uk", "description": "Environment Secretary George Eustice insisted there have been 'encouraging signs of progress'.", "url": "https://metro.co.uk/2020/04/26/supermarket-food-stocks-back-normal-minister-declares-12612595/", "urlToImage": null, "publishedAt": "2020-04-26T16:23:57Z", "content": "Supermarket stocks have now returned to normal after an episode of panic buying (Picture: AP/No 10)\r\nAfter panic buying caused UK supermarket shelves to be stripped bare, the environment minister has claimed food stocks have now returned to normal.\r\nSpeaking … [+5308 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Sean McCormick", "title": "Newcastle United takeover news RECAP: Timescale latest as Premier League checks near completion - ChronicleLive", "description": "The latest NUFC takeover news as Amanda Staveley, the Reuben brothers and the Saudi Public Investment Fund close in on Newcastle United", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/newcastle-united-takeover-news-recap-18149994", "urlToImage": null, "publishedAt": "2020-04-26T15:49:00Z", "content": "“Personally, I’ve been talking to a couple of strong American bids, one with sporting connections and one incredibly wealthy individual, even by American standards, but in this period of exclusivity, they cannot move.\r\n“I think the takeover will be waved thro… [+1344 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nJason Burt,", "title": "Premier League needs 300 people per match to end lockdown and reboot season - Telegraph.co.uk", "description": "Some clubs will not play home matches in their own grounds if authorities believe that is safest approach to completing fixtures", "url": "https://www.telegraph.co.uk/football/2020/04/26/premier-league-says-needs-just-300-people-per-match-reboot-season/", "urlToImage": null, "publishedAt": "2020-04-26T15:15:00Z", "content": "Tom Harrison, the chief executive of the ECB, said: Clearly there will need to be a significant testing regime in place. I'm not sure if quarantined is the right word but there will need to be areas of the ground where only certain people are allowed to go at… [+4303 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Mark Kleinman", "title": "Coronavirus: Airlines lobby Sunak over prolonged 'cash crisis' - Sky News", "description": "Airlines are urging Rishi Sunak to taper the emergency job retention scheme beyond June, in a letter seen by Sky News.", "url": "https://news.sky.com/story/coronavirus-airlines-lobby-sunak-over-prolonged-cash-crisis-11979120", "urlToImage": null, "publishedAt": "2020-04-26T14:55:06Z", "content": null}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Coronavirus: Spanish children enjoy fresh air for first time in six weeks as lockdown is eased - Sky News", "description": "Youthful cries of joy and the rattle of bikes on pavements heralded the ending of the 44-day confinement of under-14s.", "url": "https://news.sky.com/story/coronavirus-spanish-children-enjoy-fresh-air-for-first-time-in-six-weeks-as-lockdown-is-eased-11979073", "urlToImage": null, "publishedAt": "2020-04-26T14:53:59Z", "content": null}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Ellena Cruse", "title": "Laurence Fox was dumped by his mixed-race girlfriend after BBC Question time comments about race - Evening Standard", "description": "", "url": "https://www.standard.co.uk/showbiz/celebrity-news/laurence-fox-dumped-mixed-race-girlfriend-bbc-question-time-comments-a4424386.html", "urlToImage": null, "publishedAt": "2020-04-26T14:39:07Z", "content": "Laurence Fox was dumped by his mixed-race girlfriend after his rant about racism on BBC Question earlier this year.\r\nThe actor and musician waded into a debate about how Meghan Markle is portrayed in the media with his comments sparking a race row about white… [+1600 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Zach Vasquez", "title": "Saturday Night Live: Brad Pitt plays Dr Anthony Fauci in standout virtual episode - The Guardian", "description": "In cold open, Fauci (Pitt) clears up Trump’s false claims about the coronavirus and Miley Cyrus performs a killer cover of Pink Floyd’s Wish You Were Here", "url": "https://www.theguardian.com/tv-and-radio/2020/apr/26/saturday-night-live-brad-pitt-dr-anthony-fauci-virtual-episode", "urlToImage": null, "publishedAt": "2020-04-26T13:45:51Z", "content": "For the second time this month, Saturday Night Live made a surprise return to deliver a new episode filmed remotely. This time, virtual hosting duties fell to Brad Pitt, playing lead member of the White House coronavirus task force, Dr Anthony Fauci. The rasp… [+6959 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Donald Trump says press briefings 'not worth the time and effort' as disinfectant fallout continues - ITV News", "description": "President Donald Trump says his press briefings are \"not worth the time and effort\" as his administration prepares to adjust his public presence.\n\nTweeting on Saturday, one of the few days in which he has not held a daily briefing since the start of the outbr…", "url": "https://www.itv.com/news/2020-04-26/donald-trump-says-press-briefings-not-worth-the-time-and-effort-as-disinfectant-fallout-continues/", "urlToImage": null, "publishedAt": "2020-04-26T13:10:00Z", "content": "President Donald Trump says his press briefings are \"not worth the time and effort\" as his administration prepares to adjust his public presence.\r\nTweeting on Saturday, one of the few days in which he has not held a daily briefing since the start of the outbr… [+1024 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Stars join general public to take on 2.6 challenge following London Marathon postponement - ITV News", "description": "With the London Marathon postponed due to the coronavirus crisis, sports stars answered the call to take part in the 2.6 challenge on Sunday.\n\nRaising money for the charities missing out as a result of the race being off, various big names stepped up to take …", "url": "https://www.itv.com/news/2020-04-26/stars-and-general-public-take-on-2-6-challenge-following-marathon-postponement/", "urlToImage": null, "publishedAt": "2020-04-26T12:59:00Z", "content": null}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nEd Clowes", "title": "The week that changed oil: how fortunes were lost and made in a matter of minutes - Telegraph.co.uk", "description": "The historic oil price crash saw prices plunge to less than $0", "url": "https://www.telegraph.co.uk/business/2020/04/26/week-changed-oil-howfortunes-lost-made-matter-minutes/", "urlToImage": null, "publishedAt": "2020-04-26T12:26:00Z", "content": "But coronavirus has made that almost impossible. More than three billion people around the world are on lockdown, meaning that no one is using any oil.\r\nMany traders are stashing away their barrels in the hope that lockdowns are lifted later this year, and pr… [+2548 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Felicity Lawrence, Severin Carrell, David Pegg", "title": "Attendees of Sage meetings worried by presence of Cummings - The Guardian", "description": "Scientists on UK government’s coronavirus advisory group say Dominic Cummings was an active participant", "url": "https://www.theguardian.com/world/2020/apr/26/attendees-of-sage-coronavirus-meetings-worried-by-presence-of-dominic-cummings", "urlToImage": null, "publishedAt": "2020-04-26T12:20:54Z", "content": "The involvement of the prime ministers chief political adviser, Dominic Cummings, in meetings of the scientific group advising the UK governments response to the coronavirus has left other attendees shocked, concerned and worried for the impartiality of advic… [+8119 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: UK must find 'new normal' to ease lockdown - Raab - BBC News", "description": "It comes as Prime Minister Boris Johnson arrives back in Downing Street to resume work on Monday.", "url": "https://www.bbc.com/news/uk-52431501", "urlToImage": null, "publishedAt": "2020-04-26T10:52:02Z", "content": "Media captionDominic Raab: NHS staff 'have best PPE we can get them'\r\nThe UK's lockdown needs to be eased carefully, meaning social distancing will remain for \"some time\", Foreign Secretary Dominic Raab has said. \r\nHe described the more than 20,000 deaths in … [+7916 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Scotland could have different exit from lockdown - BBC News", "description": "The first minister said she would do what she judged best to protect Scotland's population.", "url": "https://www.bbc.co.uk/news/uk-scotland-52431863", "urlToImage": null, "publishedAt": "2020-04-26T10:47:14Z", "content": "Media captionNicola Sturgeon: \"I would want to make sure that Scotland did what I judged was best to protect the population.\"\r\nNicola Sturgeon says Scotland could have a different exit from the Covid-19 lockdown if she felt the UK government had taken \"premat… [+2877 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "Facebook takes on Zoom with 50-way video calls in Messenger Rooms - TechRadar India", "description": "Do you have that many friends?", "url": "https://www.techradar.com/news/facebook-takes-on-zoom-with-50-way-video-calls-in-messenger-rooms", "urlToImage": null, "publishedAt": "2020-04-26T10:30:00Z", "content": "Video calling software is hugely popular at the moment, for obvious reasons, with Zoom the main beneficiary. Now Facebook wants more of the video calling market, and has introduced a new tool called Messenger Rooms.\r\nAs Facebook explains in a blog post, Messe… [+1506 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: New York to allow tests in pharmacies - BBC News", "description": "Testing remains a key problem across the US but some states have started to lift restrictions.", "url": "https://www.bbc.co.uk/news/world-us-canada-52428994", "urlToImage": null, "publishedAt": "2020-04-26T10:16:54Z", "content": "Image copyrightEPAImage caption\r\n New York's governor says the goal is to provide 40,000 tests per day\r\nThe US state of New York, the epicentre of the country's Covid-19 outbreak, will allow pharmacies to carry out tests for the virus, the governor says.\r\nAnd… [+4243 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Alahna Kindred", "title": "Coronavirus patients suffering ‘nasty red rash’ before Covid-19 symptoms - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11482938/coronavirus-symptoms-rash/", "urlToImage": null, "publishedAt": "2020-04-26T09:56:39Z", "content": "A RED rash could be another symptom of coronavirus, experts have warned.\r\nData from Italy suggests as many as one in five people who are hospitalised with the killer bug may develop rashes or unexplained marks on their skin.\r\n Scientists are still trying to u… [+3944 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nAnnelies Gartner", "title": "How close are we to a coronavirus vaccine? Latest news on UK trials - Telegraph.co.uk", "description": "Latest news on the search for a vaccine against the new coronavirus", "url": "https://www.telegraph.co.uk/global-health/science-and-disease/coronavirus-vaccine-trials-start-covid-19-update-why-long/", "urlToImage": null, "publishedAt": "2020-04-26T09:40:09Z", "content": "As Covid-19 has rapidly spread around the world there has been a mad scramble to find a vaccine. \r\nIn the UK, a potential coronavirus vaccine being developed at the University of Oxford began human trials on Thursday.\r\nSpeaking at the Governments daily press … [+1670 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "iPhone users warned: Viewing this text can crash ANY Apple smartphone - Express", "description": "WATCH OUT, iPhone owners! Apple smartphones can be crashed by a string of text sent in text messages or shared on websites or online forums. The text causes your iPhone to freeze.", "url": "https://www.express.co.uk/life-style/science-technology/1273586/iPhone-Warning-iOS-Text-Message-Crash-Any-Apple-Smartphone", "urlToImage": null, "publishedAt": "2020-04-26T09:39:00Z", "content": null}, {"source": {"id": "independent", "name": "Independent"}, "author": "Melissa Reddy", "title": "Arsenal players allowed to return to training 46 days after Mikel Arteta contracted coronavirus - The Independent", "description": "Premier League was suspended after Arteta was diagnosed with Covid-19, with players set to be allowed to return to the club’s London Colney base with strict guidelines in place and a rotation schedule", "url": "https://www.independent.co.uk/sport/football/premier-league/arsenal-training-coronavirus-mikel-arteta-london-colney-a9484396.html", "urlToImage": null, "publishedAt": "2020-04-26T09:33:01Z", "content": "Arsenals squad will be permitted to train at their London Colney base from Monday under carefully controlled conditions for the first time since Mikel Arteta tested positive for coronavirus.\r\nThe partial reopening of the facility comes 46 days after the manag… [+1503 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Melanie Hancill", "title": "Vitamin D tips and 12 other ways of keeping bones healthy in coronavirus lockdown - Mirror Online", "description": "Exercise and diet play a huge role in how healthy our bones stay as we get older – so at a time when we are more sedentary than ever, here’s how to keep moving", "url": "https://www.mirror.co.uk/lifestyle/health/thirteen-secrets-keeping-your-bones-21907317", "urlToImage": null, "publishedAt": "2020-04-26T08:59:08Z", "content": "We might be cooped up indoors, but it shouldnt be an excuse to sit around all day as tempting as that is.\r\nStaying active helps to keep bones strong and healthy, says osteopath Jess Roberts, founder of Unity-wellness.com.\r\nIn fact, research suggests that walk… [+4880 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Lizzie Dearden", "title": "Coronavirus: Military to test key workers and vulnerable people in prisons and care homes - The Independent", "description": "Government says 96 mobile units will be operating by the start of May amid pressure to hit target", "url": "https://www.independent.co.uk/news/health/coronavirus-test-uk-military-army-key-workers-care-homes-prisons-a9484371.html", "urlToImage": null, "publishedAt": "2020-04-26T08:54:19Z", "content": "Military personnel are to start operating almost 100 mobile coronavirus testing units for key workers and vulnerable people.\r\nThe move was announced after the government was heavily criticised for falling short of its target of 100,000 tests a day, which it a… [+2921 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Joel Day", "title": "Richard Dawkins confession: How scientist pinpointed ‘impossible’ universe questions - Express.co.uk", "description": "RICHARD DAWKINS claimed that religion would never answer the questions science cannot, leaving the matter of the universe's creation potentially unanswerable.", "url": "https://www.express.co.uk/news/science/1273420/richard-dawkins-science-news-universe-creator-God-religion-spt", "urlToImage": null, "publishedAt": "2020-04-26T08:00:00Z", "content": null}, {"source": {"id": null, "name": "Refinery29.com"}, "author": "Gwendolyn Smith", "title": "Normal People Is The Horniest Show On TV – But Not In A Traditional Way - Refinery29", "description": "Normal People is incredibly sexual but in the most refreshing way possible. Here's why that matters.", "url": "https://www.refinery29.com/en-gb/normal-people-sally-rooney-review-tv", "urlToImage": null, "publishedAt": "2020-04-26T06:00:00Z", "content": "A scene where Marianne hungrily watches Connell playing football asserts that he's as much an object of desire as she is."}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Karen Price", "title": "Starlink satellites: It's your last chance to see them tonight and here's how - Wales Online", "description": "Many Brits have spotted them flash across the sky already this week", "url": "https://www.walesonline.co.uk/whats-on/whats-on-news/starlink-satellites-its-your-last-18150766", "urlToImage": null, "publishedAt": "2020-04-26T05:11:25Z", "content": "They've been causing something of a sensation this week and now it's your last chance tonight to see the Starlink satellites.\r\n The lightshows across the skies are not UFOs, but  lights coming from satellites  powered by Elon Musk's Starlink fleet. \r\n Many Br… [+1518 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Luke O'Reilly", "title": "Mobile phone data shows Britons beginning to flout coronavirus lockdown - Evening Standard", "description": "", "url": "https://www.standard.co.uk/news/health/mobile-phone-data-britons-flouting-lockdown-a4424176.html", "urlToImage": null, "publishedAt": "2020-04-25T21:03:57Z", "content": "Health officials fear Britons are starting to get complacent about the Covid-19 lockdown after traffic and mobile phone data revealed more of us are on the roads and looking for directions.\r\nProfessor Stephen Powis, national medical director of NHS England, s… [+2014 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Former Apple designer drops Watch trivia on its fifth anniversary - Engadget", "description": "Imran Chaudhri, Apple’s design lead for hardware from 1995 to 2016, dropped some details about Apple Watch’s history on its fifth anniversary.  While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a re…", "url": "https://www.engadget.com/former-apple-designer-drops-watch-trivia-on-its-fifth-anniversary-144849444.html", "urlToImage": null, "publishedAt": "2020-04-25T18:39:26Z", "content": "Imran Chaudhri, Apple’s design lead for hardware from 1995 to 2016, dropped some details about Apple Watch’s history on its fifth anniversary. While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a rep… [+906 chars]"}, {"source": {"id": null, "name": "Heritagedaily.com"}, "author": "http://www.facebook.com/archaeologynews", "title": "Hubble celebrates its 30th anniversary with a tapestry of blazing starbirth - HeritageDaily - Archaeology News - HeritageDaily", "description": "Hubble Space Telescope's iconic images and scientific breakthroughs have redefined our view of the Universe. - Space & Planetary HeritageDaily - Archaeology News", "url": "https://www.heritagedaily.com/2020/04/hubble-celebrates-its-30th-anniversary-with-a-tapestry-of-blazing-starbirth/127932", "urlToImage": null, "publishedAt": "2020-04-25T15:49:09Z", "content": "Hubble Space Telescope’s iconic images and scientific breakthroughs have redefined our view of the Universe.\r\nTo commemorate three decades of scientific discoveries, this image is one of the most photogenic examples of the many turbulent stellar nurseries the… [+5184 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nLizzie Roberts", "title": "Contact tracing: how has it worked for other countries, and could it really help ease UK lockdown? - The Telegraph", "description": "From teams of 'corona detectives' to Army cadets making thousands of calls a day, countries are tracking the spread of Covid-19", "url": "https://www.telegraph.co.uk/news/2020/04/25/what-contact-tracing-how-work-countries-uk-lockdown/", "urlToImage": null, "publishedAt": "2020-04-25T13:41:28Z", "content": "Countries around the world are rushing to launch contact tracing apps to identify who an infected person has had contact with, as part of efforts to slow the spread of the coronavirus. \r\nThe UK Government has announced the infrastructure was being put in plac… [+1754 chars]"}, {"source": {"id": null, "name": "Thelocal.fr"}, "author": null, "title": "France readying 'historic' multi-billion euro package to save Air France and Renault - The Local France", "description": null, "url": "https://www.thelocal.fr/20200425/france-readying-historic-multi-billion-euro-package-to-save-air-france-and-renault", "urlToImage": null, "publishedAt": "2020-04-25T07:44:10Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Charlotte Edwards", "title": "Stunning Lyrid meteor shower photos reveal fiery space rocks soaring over Earth - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11434347/lyrid-meteor-shower-photos-last-night/", "urlToImage": null, "publishedAt": "2020-04-22T10:13:27Z", "content": "THE Lyrid meteor shower reached its peak in the early hours of this morning, resulting in some amazing photos.\r\nThe first meteor shower of spring is taking over the sky this week so there is still time to try and get your own stunning snaps like the ones belo… [+3882 chars]"}]}