{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Elsom For Mailonline", "title": "Priti Patel to warn 'selfish rule-breakers' to stop flouting lockdown - Daily Mail", "description": "The Home Secretary will underscore her warning to stay indoors with the threat of beefing up the police's powers to enforce social distancing.", "url": "https://www.dailymail.co.uk/news/article-8255553/Priti-Patel-warn-selfish-rule-breakers-stop-flouting-coronavirus-lockdown.html", "urlToImage": null, "publishedAt": "2020-04-25T02:44:45Z", "content": "Priti Patel will today scold the rule-breakers ignoring the coronavirus lockdown after scenes of crowds pouring into public places sent alarm bells ringing through government.\r\nThe Home Secretary will underscore her warning to stay indoors with the threat of … [+33978 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Reuters", "title": "Kim Jong-un: China sends doctors to check on health – report - The Guardian", "description": "Speculation continues about dictator’s condition after reports of heart surgery and absence from important events", "url": "https://www.theguardian.com/world/2020/apr/25/kim-jong-un-china-sends-doctors-to-advise-on-health-report", "urlToImage": null, "publishedAt": "2020-04-25T01:40:50Z", "content": "China has sent a team to North Korea including medical experts to check on Kim Jong-un, according to three people familiar with the situation.\r\nThe trip by the Chinese doctors and officials comes amid conflicting reports about the health of the North Korean r… [+3653 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Dominic Cummings attended meetings of key scientific group - BBC News", "description": "Downing Street confirms the PM's chief adviser attended Sage meetings but denies he is a member.", "url": "https://www.bbc.co.uk/news/uk-politics-52421744", "urlToImage": null, "publishedAt": "2020-04-25T00:41:20Z", "content": "Image copyrightReuters\r\nBoris Johnson's chief adviser, Dominic Cummings, has attended meetings of the scientific body advising the government on the coronavirus outbreak.\r\nHowever, Downing Street denied a report in the Guardian that Mr Cummings was a member o… [+2932 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Peter Stubley", "title": "Coronavirus: Identical twin sisters die within days of each other - The Independent", "description": "‘They always said they had come into the world together and would go out together as well’", "url": "https://www.independent.co.uk/news/uk/home-news/coronavirus-twin-sisters-death-nurses-southampton-hospital-katy-emma-davis-a9483481.html", "urlToImage": null, "publishedAt": "2020-04-24T23:48:47Z", "content": "Identical twin sisters who had worked as nurses at the same hospital died within days of each other after testing positive for coronavirus.\r\nKaty and Emma Davis, 37, both suffered from underlying health conditions and had been unwell for some time before cont… [+1667 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Anna MacSwan", "title": "Government 'considering easing lockdown rules to allow Brits see up to 10 others' - Mirror Online", "description": "The Government is considering allowing people to socialise in \"small bubbles\", under plans to ease the coronavirus lockdown which would see households nominate up to 10 people", "url": "https://www.mirror.co.uk/news/politics/government-considering-easing-lockdown-rules-21924319", "urlToImage": null, "publishedAt": "2020-04-24T23:38:46Z", "content": "Brits could be allowed to meet up with 10 of their closest family or friends under one idea to relax the coronavirus lockdown. \r\nIt is understood that the UK government is considering letting people socialise outside of their households in small \"bubbles\" as … [+4416 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Jimmy McCloskey", "title": "Donald Trump storms out of coronavirus briefing after ‘inject disinfectant’ fiasco - Metro.co.uk", "description": "The president refused to take any questions hours after he faced worldwide condemnation for suggesting injections of disinfectant as a Covid-19 treatment", "url": "https://metro.co.uk/2020/04/24/donald-trump-refuses-take-questions-covid-19-press-conference-inject-disinfectant-fiasco-12607560/", "urlToImage": null, "publishedAt": "2020-04-24T23:08:07Z", "content": "Donald Trump is pictured leaving Fridays White House coronavirus briefing after refusing to take reporters questions (Picture: AP)\r\nDonald Trump dramatically refused to take journalists questions at the daily White House coronavirus press conference 24 hours … [+3963 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Are these seven targets being hit? - BBC News", "description": "Ministers have set targets for testing, medical equipment and hospital beds. Have they delivered?", "url": "https://www.bbc.co.uk/news/52382786", "urlToImage": null, "publishedAt": "2020-04-24T23:04:26Z", "content": "Image copyrightGetty Images\r\nThe UK government has set various targets during its efforts to tackle the coronavirus outbreak. Have they been met?\r\n1. 25,000 tests a day by the middle of April\r\n\"We will massively scale up our testing capacity in the weeks ahea… [+7912 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Tashan Deniran-Alleyne", "title": "How the Dutch FA's decision would affect Chelsea's top-four battle with Man United and Tottenham - Football.London", "description": "The Eredivisie have become the first major European division to decide against crowning a league champion for the 2019/20 season, and the decision could impact English football", "url": "https://www.football.london/chelsea-fc/news/chelsea-champions-league-man-united-18148939", "urlToImage": null, "publishedAt": "2020-04-24T22:55:13Z", "content": "The big news in the world of football on Friday surrounding a massive decision made by the Dutch FA.\r\nIt was announced that the 2019/20 Eredivisie season has been ended.\r\nLast season's Champions League semi-finalists Ajax had led the table on goal difference … [+2396 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: US death toll passes 50,000 in world's deadliest outbreak - BBC News", "description": "A grim milestone is passed by the world's deadliest outbreak, although US mortality rate is comparatively low.", "url": "https://www.bbc.com/news/world-us-canada-52415579", "urlToImage": null, "publishedAt": "2020-04-24T22:43:13Z", "content": "Image copyrightGetty Images\r\nThe US virus death toll has surpassed 50,000, according to data from Johns Hopkins University, in what is the world's deadliest Covid-19 outbreak.\r\nMore than 3,000 deaths came in the last 24 hours, and there are now over 870,000 c… [+3926 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Kishan Vaghela For Mailonline", "title": "Prime Minister Boris Johnson 'briefed on plans to have Premier League football return within weeks' - Daily Mail", "description": "The Prime Minister has been informed of the proposals for matches to be played behind closed doors. And Mr Johnson sees the resumption of live sport as key to boosting the moral of the nation.", "url": "https://www.dailymail.co.uk/sport/football/article-8255287/Prime-Minister-Boris-Johnson-briefed-plans-Premier-League-football-return-weeks.html", "urlToImage": null, "publishedAt": "2020-04-24T22:28:34Z", "content": "2020 OLYMPIC GAMES  \r\nThe 2020 Olympic Games has been postponed until 2021 on March 24 - becoming one of the last major sporting events this summer to fall victim to the coronavirus.\r\nJapanese prime minister Shinzo Abe held a crucial conference call with Olym… [+24811 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Air France-KLM secures billions in government aid - BBC News", "description": "Like many other airlines, the Franco-Dutch group has been badly hit by the coronavirus outbreak.", "url": "https://www.bbc.com/news/world-europe-52420312", "urlToImage": null, "publishedAt": "2020-04-24T22:18:16Z", "content": "Image copyrightReutersImage caption\r\n Air France-KLM's boss said the company would rethink its operating model \"immediately\"\r\nAir France-KLM has secured at least 9bn (£7.9bn; $9.7bn) in government aid, as the Franco-Dutch airline group struggles to stay afloa… [+1104 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By James Wood For Mailonline", "title": "Scathing letters from Sex Pistols' manager Malcolm McLaren to Richard Branson uncovered - Daily Mail", "description": "The British punk rock band were signed to Virgin Records at the time but McLaren accused Branson's (pictured in 1979) record label of 'pilfering and pirating' their famous studio album.", "url": "https://www.dailymail.co.uk/news/article-8254109/Scathing-letters-Sex-Pistols-manager-Malcolm-McLaren-Richard-Branson-uncovered.html", "urlToImage": null, "publishedAt": "2020-04-24T22:09:11Z", "content": "Sex Pistols' manager Malcolm McLaren branded Richard Branson 'insidious and idiotic' in letters which have been unearthed after 40 years.\r\nThe punk rock band was signed to Virgin Records at the time but McLaren accused Branson's record label of 'pilfering and… [+6532 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: retail sales suffer biggest fall since records began - BBC News - BBC News", "description": "Retail sales have suffered the biggest drop since records began, falling by more than 5% last month. The figures from the Office for National Statistics show...", "url": "https://www.youtube.com/watch?v=VDbFPtAo2o8", "urlToImage": null, "publishedAt": "2020-04-24T21:40:52Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Captain Tom Moore tops singles chart in time for his 100th birthday | ITV News - ITV News", "description": "Captain Tom Moore has become the oldest artist to reach number one on the UK singles chart as his rendition of You’ll Never Walk Alone landed in the top spot...", "url": "https://www.youtube.com/watch?v=TPxOjHgqFrY", "urlToImage": null, "publishedAt": "2020-04-24T21:35:18Z", "content": "Captain Tom Moore has become the oldest artist to reach number one on the UK singles chart as his rendition of Youll Never Walk Alone landed in the top spot in time for his 100th birthday.\r\nThe war veteran has already raised more than £28 million for the NHS … [+613 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Ed Woodward: Man Utd chief says big-money transfer talk ignores financial reality - BBC News", "description": "Manchester United executive vice-chairman Ed Woodward says speculation about transfers for \"hundreds of millions of pounds this summer\" is ignoring the \"realities that face the sport\".", "url": "https://www.bbc.co.uk/sport/football/52418826", "urlToImage": null, "publishedAt": "2020-04-24T21:31:20Z", "content": "United were linked with a £200m move for Tottenham and England striker Harry Kane\r\nManchester United executive vice-chairman Ed Woodward says speculation about transfers for \"hundreds of millions of pounds this summer\" is ignoring the \"realities that face the… [+2830 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Luke Hurst", "title": "Hubble at 30: Take a look back at some of the telescope's best images - Euronews", "description": "The Hubble Space Telescope turned 30 on Friday, and to mark the occasion Hubble released a fittingly awesome image.", "url": "https://www.euronews.com/2020/04/24/hubble-turns-30-take-a-look-back-at-some-of-the-space-telescope-s-best-images", "urlToImage": null, "publishedAt": "2020-04-24T21:06:33Z", "content": "The Hubble Space Telescope turned 30 on Friday, and to mark the occasion Hubble released a fittingly awesome image. \r\nShowing two nebulas, NGC 2020 and NGC 2014, some 163,000 light years from Earth, the image reveals part of a vast star-forming region in the … [+1048 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Chris Edwards", "title": "Nintendo addresses major security breach - digitalspy.com", "description": "There have been reported incidents of unauthorised access to user accounts.", "url": "https://www.digitalspy.com/tech/a32270793/nintendo-security-breach/", "urlToImage": null, "publishedAt": "2020-04-24T20:38:00Z", "content": "Nintendo has addressed a major security breach as it encourages users to take new security steps. \r\nIn a statement on its official website, the gaming company said it is continuing to investigate recent incidents of unauthorised access to Nintendo Accounts, b… [+1827 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Tania Snuggs", "title": "Coronavirus: Dyson's £20m ventilator 'no longer required' by the government - Sky News", "description": "Sir James Dyson said \"CoVent\" was developed at the request of the prime minister and that 10,000 units had been ordered.", "url": "https://news.sky.com/story/coronavirus-dysons-20m-ventilator-no-longer-required-by-the-government-11978474", "urlToImage": null, "publishedAt": "2020-04-24T20:35:23Z", "content": null}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "James Laird", "title": "2020 NFL Draft live stream: how to watch online from anywhere in the world - Techradar", "description": "Joe Burrow is the new face of the Cincinnati Bengals", "url": "https://www.techradar.com/news/2020-nfl-draft-live-stream-how-to-watch-online-from-anywhere-in-the-world", "urlToImage": null, "publishedAt": "2020-04-24T20:20:00Z", "content": "The 2020 NFL Draft is the first virtual player selection event in the league's history, but despite this year's proceedings being unprecedented in so many ways, some things about the draft never change: a stud QB goes at number one, the Patriots trade out of … [+10540 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Apple and Google accelerate coronavirus contact tracing apps plan - BBC News", "description": "Tech giants add privacy protections to the contact-tracing scheme they are offering to public authorities.", "url": "https://www.bbc.com/news/technology-52415593", "urlToImage": null, "publishedAt": "2020-04-24T19:29:34Z", "content": "Apple and Google have tightened privacy measures in the contact-tracing scheme they are offering to health authorities and brought forward its launch.\r\nThe tech giants now intend to release a software building block to developers on Tuesday, allowing them to … [+4500 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "'I feel a deep responsibility': UK Health Secretary Matt Hancock on Covid-19 response - Channel 4 News", "description": "We speak to Health Secretary Matt Hancock and begin by asking him whether the government had failed to anticipate the demand for tests when it launched its o...", "url": "https://www.youtube.com/watch?v=kraGcbA_7D4", "urlToImage": null, "publishedAt": "2020-04-24T18:37:28Z", "content": null}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Britta Zeltmann", "title": "UK coronavirus cases rise to 143,464 after biggest increase in infections for five days - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11474116/coronavirus-cases-biggest-infection-rate-five-days/", "urlToImage": null, "publishedAt": "2020-04-24T17:38:31Z", "content": "CORONAVIRUS cases continue to rise in the UK after 5,386 more infections were confirmed today.\r\nIt brings the total number of positive covid-19 cases recorded in Britain to 143,464 - up from 138,078 yesterday.\r\n A nurse prepares to take a sample at a covid-19… [+4120 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Drones to deliver NHS supplies to Isle of Wight - BBC News", "description": "A delivery drone trial between Hampshire and the Isle of Wight has been brought forward.", "url": "https://www.bbc.com/news/technology-52419705", "urlToImage": null, "publishedAt": "2020-04-24T17:32:47Z", "content": "Image copyrightSolent TransportImage caption\r\n The Windracers Ultra drone can carry 100kg\r\nDrones will be used to carry medical supplies from Hampshire to the Isle of Wight, the government has announced.\r\nGrant Shapps, secretary of state for transport, said a… [+2575 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Oliver Wright, Matt Chorley, Kieran Andrews", "title": "Wales joins Scotland in setting out lockdown exit plan - The Times", "description": "The Welsh government today joined Scotland’s in defying Downing Street and setting out its own plans for how and when the coronavirus lockdown might be relaxed.Mark Drakeford, the first minister, said", "url": "https://www.thetimes.co.uk/article/wales-joins-scotland-in-setting-out-lockdown-exit-plan-hdrjnf78m", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "The Welsh government today joined Scotlands in defying Downing Street and setting out its own plans for how and when the coronavirus lockdown might be relaxed.\r\nMark Drakeford, the first minister, said that the Welsh lockdown could start being lifted as early… [+470 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Laura Jane Turner", "title": "After Life season 2 ending explained - it had to end that way, according to Ricky Gervais - digitalspy.com", "description": "And what it could mean for season 3...", "url": "https://www.digitalspy.com/tv/a32235764/after-life-season-2-ending-explained-netflix/", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "After Life season two spoilers follow, including its ending. \r\nWell, there you have it. By now, if you're reading this article, you have come to the end of After Life's second season – and if you haven't quite finished, you should probably do so before readin… [+4565 chars]"}, {"source": {"id": null, "name": "Mylondon.news"}, "author": "Qasim Peracha", "title": "London coronavirus: The hospitals where 126 more patients have died as London death toll hits 4,426 - MyLondon", "description": "UK deaths now account for one in 10 coronavirus deaths across the world", "url": "https://www.mylondon.news/news/zone-1-news/london-coronavirus-hospitals-126-more-18146984", "urlToImage": null, "publishedAt": "2020-04-24T15:59:00Z", "content": "A further 126 deaths from coronavirus have been recorded in London, taking the total death toll in the capital's hospitals to 4,426. \r\nNationally, the death toll reached 19,506 deaths in hospitals across the country after 684 more deaths were registered accor… [+5100 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Luke Hawker", "title": "‘Petulant’ Barnier attacked after ‘moaning’ in Brexit update - ‘Boris MUST stand strong!' - Express.co.uk", "description": "MICHEL BARNIER has been condemned by leading Brexiteers after the EU chief blasted the UK's negotiating team for the lack of progress in Brexit talks.", "url": "https://www.express.co.uk/news/politics/1273521/Brexit-news-michel-barnier-eu-trade-fishing-negotiation-european-union-boris-johnson-frost", "urlToImage": null, "publishedAt": "2020-04-24T15:31:00Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Ian Randall For Mailonline", "title": "Scientists reveal ferocious predators roamed Africa's SAHARA 100 million years ago - Daily Mail", "description": "A team of international researchers found that what is today the Sahara region was home to 'ferocious predators' around 100 million years ago.", "url": "https://www.dailymail.co.uk/sciencetech/article-8253453/Africa-s-Sahara-dangerous-place-Earth-100-million-years-ago.html", "urlToImage": null, "publishedAt": "2020-04-24T15:02:29Z", "content": "Africa's Sahara may have been 'the most dangerous place in the history of planet Earth', a palaeontological study has concluded.\r\nA team of international researchers found that what is today the famous desert region was home to 'ferocious predators' around 10… [+2382 chars]"}, {"source": {"id": null, "name": "Theguardian.comgames"}, "author": "Keith Stuart", "title": "More than 12m players watch Travis Scott concert in Fortnite - The Guardian", "description": "The US rapper performed inside the popular Battle Royale game with a visually astonishing set, and has announced more dates", "url": "https://amp.theguardian.comgames/2020/apr/24/travis-scott-concert-fortnite-more-than-12m-players-watch", "urlToImage": null, "publishedAt": "2020-04-24T13:00:53Z", "content": "The live music event of the year may just have taken place, unaffected by the global lockdown and within a video game. On Thursday, US rapper Travis Scott performed a live set inside the online shooter Fortnite and more than 12m players took part in the spect… [+1976 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Emily Ferguson", "title": "Pay up, China! Trump blasts Beijing over coronavirus outbreak - US sends warning - Express.co.uk", "description": "DONALD TRUMP'S Secretary of State has warned China it will 'pay the price for what they did' with the coronavirus outbreak.", "url": "https://www.express.co.uk/news/world/1273469/Donald-trump-latest-coronavirus-press-conference-china-coronavirus-news-wuhan-disinfectant", "urlToImage": null, "publishedAt": "2020-04-24T12:06:00Z", "content": null}, {"source": {"id": "independent", "name": "Independent"}, "author": "Fiona Sturges", "title": "Clumsy sex and longing stares: How Normal People captures the angst of young romance - The Independent", "description": "While plenty of young drama is played for shock or laughs, the anticipated BBC3 adaptation of Sally Rooney's best-selling book lingers on what goes unsaid between its adolescent lovebirds. And there is lots of humping, says arts columnist Fiona Sturges", "url": "https://www.independent.co.uk/arts-entertainment/tv/features/normal-people-tv-series-bbc3-sally-rooney-daisy-edgar-jones-paul-mescal-a9480071.html", "urlToImage": null, "publishedAt": "2020-04-24T11:20:28Z", "content": "In Normal People, the new series based on 2018s stratospherically successful coming-of-age novel by Sally Rooney, two teenagers from the same Irish town move in and out of each others lives over four years, navigating the slings and arrows of friendship and r… [+4947 chars]"}, {"source": {"id": null, "name": "Gizmodo.co.uk"}, "author": null, "title": "Apple iPhone SE: First Look Review - Gizmodo UK", "description": "Being able to get the best phone processor on the market in a sub-£500 phone is a real power move by Apple.", "url": "https://www.gizmodo.co.uk/2020/04/apple-iphone-se-first-look-review/", "urlToImage": null, "publishedAt": "2020-04-24T11:00:00Z", "content": "Last year, Google turned the mid-range phone market on its head by introducing the ludicrously-priced and well-specced Pixel 3a. A few other brands have followed suit since then, but none have been quite as exciting as the new iPhone SE. Now it truly seems li… [+9454 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Afp", "title": "Bodies piled up in Brazilian city of Manaus because of coronavirus - Daily Mail", "description": "The mayor of Manaus Virgilio Neto said his city was 'no longer in a state of emergency but rather of absolute calamity' after the daily death rate shot up from 20-30 per day to more than 100.", "url": "https://www.dailymail.co.uk/news/article-8252459/Bodies-piled-Brazilian-city-Manaus-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-24T10:57:55Z", "content": "The mayor of Brazil's worst-hit city has described the hundreds of coronavirus deaths in Manaus as 'a scene out of a horror movie' as bodies are piled up in refrigerated trucks and bulldozers dig mass graves at cemeteries. \r\nMayor Virgilio Neto said his city … [+7723 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Harry Pettit", "title": "Starlink satellites will be ‘low and bright’ over UK TONIGHT – best time to see Elon Musk probes on Thurs - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11465432/how-to-see-starlink-elon-musk-spacex-satelite-uk-4/", "urlToImage": null, "publishedAt": "2020-04-24T07:59:04Z", "content": "BRIT stargazers are bracing for another dazzling satellite display tonight - the fourth over the UK this week.\r\nThe super-bright \"Starlink\" satellites are operated by US rocket company SpaceX and will produce what could be their most spectacular showing so fa… [+10751 chars]"}, {"source": {"id": null, "name": "Belfasttelegraph.co.uk"}, "author": "Gareth Cross, Andrew Madden and Mark Edwards", "title": "Coronavirus updates: 15 further deaths in Northern Ireland - Belfast Telegraph", "description": "Cemeteries in Northern Ireland are to be reopened, First Minister Arlene Foster has announced.", "url": "https://www.belfasttelegraph.co.uk/news/health/coronavirus/coronavirus-updates-northern-ireland-cemeteries-to-be-reopened-following-sinn-fein-u-turn-as-15-more-patients-die-39153813.html", "urlToImage": null, "publishedAt": "2020-04-24T07:06:00Z", "content": "Cemeteries in Northern Ireland are to be reopened, First Minister Arlene Foster has announced.\r\nGraveyards were shut last month as part of lockdown regulations introduced by the Stormont Executive in response to the coronavirus pandemic.\r\nSpeaking at the Exec… [+1718 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "David Snelling", "title": "Apple Watch turns FIVE: The biggest 5 upgrades that have changed this smartwatch - Express", "description": "THE Apple Watch is celebrating a big birthday today as this wearable officially turns five. Here are some of the ways that it has changed over the last five years.", "url": "https://www.express.co.uk/life-style/science-technology/1273252/Apple-Watch-update-news-features-upgrade-five", "urlToImage": null, "publishedAt": "2020-04-24T06:14:59Z", "content": null}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nAnna Mikhailova,", "title": "Scarves are no substitute for face masks in protecting against coronavirus, experts say - Telegraph.co.uk", "description": "Worries over supplies of masks for medical workers means Government advice could be to use alternative ways of covering their faces", "url": "https://www.telegraph.co.uk/politics/2020/04/23/scarves-no-substitute-face-masks-protecting-against-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-23T20:30:00Z", "content": "The governments plan to recommend scarves instead of face masks will not offer people the same level of protection from Covid-19, experts have warned.\r\nMinisters are considering the recommendation by the Scientific Advisory Group for Emergencies (Sage), which… [+1150 chars]"}]}