{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Jagran.com"}, "author": "James Kuanal", "title": "Ozone layer heals itself as hole over arctic circle closes, confirm scientists: Report - Jagran English", "description": "The ozone layer works as a protective shield as it prevents Sun s ultraviolet rays from entering Earth   Pic credits   SavetheearthB Twitter", "url": "https://english.jagran.com/world/coronavirus-lockdown-ozone-layer-heals-itself-as-hole-over-arctic-circle-closes-confirms-scientists-report-10011145", "urlToImage": null, "publishedAt": "2020-04-26T16:08:22Z", "content": "New Delhi | Jagran Lifestyle Desk: The largest hole in the Ozone layer spreading over 1 million square kilometers above the Arctic caused due to unusual atmospheric conditions has closed, said a report published in the week.in. The hole was first identified b… [+2093 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Rajeev Jayaswal and Anisha Dutta", "title": "Centre rejects tax-hike proposal by IRS officials, calls it ill-conceived - Hindustan Times", "description": "Some IRS officials had released recommendations to hike taxes along with other measures to shore up revenues to mitigate the economic impact of coronavirus.", "url": "https://www.hindustantimes.com/india-news/centre-dismisses-tax-super-rich-proposal-by-irs-officials-calls-it-irresponsible/story-lJ6haLkNydtIzMNcm7gXNI.html", "urlToImage": null, "publishedAt": "2020-04-26T15:59:00Z", "content": "The government has “summarily” rejected an “ill-conceived” report prepared by a group of Indian Revenue Service (IRS) officers that suggested raising income-tax rate up to 40%, imposing a super-rich tax and levy a 4% Covid-19 relief cess to rebuild the econom… [+3743 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus India News highlights: Maharashtra reports 440 fresh COVID-19 cases; Nepal extends lockdown till May 7 - Moneycontrol", "description": "Highlights of the novel coronavirus pandemic and its economic impact. Total confirmed cases in India have risen to 26,496", "url": "https://www.moneycontrol.com/news/india/coronavirus-india-news-live-updates-covid-19-pandemic-pm-modi-delhi-maharashtra-mumbai-gujarat-statewise-tally-lockdown-migrants-mann-ki-baat-5189971.html", "urlToImage": null, "publishedAt": "2020-04-26T15:25:39Z", "content": "Coronavirus in Maharashtra LIVE Updates | State Health Department: 440 new positive COVID-19 cases and 19 deaths reported in the state today, taking total number of cases to 8,068 and death toll to 342, till date. 112 patients discharged today, while a total … [+47 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Covid-19 death toll rises to 826, cases climb to 26,917: Health ministry - Times of India", "description": "India News: The countrywide death toll due to Covid-19 rose to 826 and the number of cases climbed to 26,917 on Sunday, according to the Union health ministry. Th", "url": "https://timesofindia.indiatimes.com/india/covid-19-death-toll-rises-to-826-cases-climb-to-26917-health-ministry/articleshow/75390883.cms", "urlToImage": null, "publishedAt": "2020-04-26T14:33:59Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Lockdown has made me more dedicated and taught me that we can survive without eating outside, Hima Das te - Times of India", "description": "More sports News: From crying after meeting idol Sachin Tendulkar to learning how to be more dedicated during the coronavirus lockdown, India's star sprinter Hima Das o", "url": "https://timesofindia.indiatimes.com/sports/more-sports/athletics/lockdown-has-made-me-more-dedicated-and-taught-me-that-we-can-survive-without-eating-outside-hima-das-tells-suresh-raina/articleshow/75391961.cms", "urlToImage": null, "publishedAt": "2020-04-26T14:31:03Z", "content": "NEW DELHI: From crying after meeting idol Sachin Tendulkar to learning how to be more dedicated during the coronavirus lockdown, India's star sprinter Hima Das opened up about her life in a candid chat with Indian cricketer Suresh Raina on Sunday.\r\nThe two In… [+3156 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Neha", "title": "Hubble Space Telescope yields 1.4 mn observations in 3 decades - The Siasat Daily", "description": "Washington: The Hubble Space Telescope, which is now celebrating 30 years of stunning discoveries, has yielded 1.4 million observations and provided data that astronomers around the world have used to write more than 17,000 peer-reviewed scientific publicatio…", "url": "https://www.siasat.com/hubble-space-telescope-yields-1-4-mn-observations-3-decades-1880016/", "urlToImage": null, "publishedAt": "2020-04-26T14:00:33Z", "content": "Washington: The Hubble Space Telescope, which is now celebrating 30 years of stunning discoveries, has yielded 1.4 million observations and provided data that astronomers around the world have used to write more than 17,000 peer-reviewed scientific publicatio… [+2845 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": null, "title": "Help everyone without discrimination: Mohan Bhagwat to RSS workers on Covid-19 crisis - khabrisala", "description": "", "url": "https://indianexpress.com/article/india/help-everyone-without-discrimination-mohan-bhagwat-tells-rss-workers-on-covid-19-crisis-6380304/", "urlToImage": null, "publishedAt": "2020-04-26T13:42:48Z", "content": "The RSS chief stated the organisation was working to create consciousness in regards to the Covid-19 pandemic, whereas observing all guidelines and precautions throughout the lockdown. (File)\r\nRashtriya Swayamsevak Sangh (RSS) chief Mohan Bhagwat Sunday instr… [+2417 chars]"}, {"source": {"id": null, "name": "Cnbctv18.com"}, "author": null, "title": "JioMart WhatsApp service goes live: How to place an order if you are in Navi Mumbai, Thane, Kalyan - CNBCTV18", "description": "A few days after announcing the massive USD 5.7 billion deal with Facebook, Mukesh Ambani-owned JioMart has gone live via WhatsApp.Get latest Retail online at cnbctv18.com", "url": "https://www.cnbctv18.com/retail/jiomart-whatsapp-kirana-launch-how-to-place-order-thane-kalyan-5779521.htm/", "urlToImage": null, "publishedAt": "2020-04-26T13:30:06Z", "content": "A few days after announcing the massive USD 5.7 billion deal with Facebook, Mukesh Ambani-owned JioMart has gone live via WhatsApp.\r\nOffering its service in only three regions - Thane, Navi Mumbai and Kalyan as of now -- JioMart has already set the ball rolli… [+2388 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Asit Ranjan Mishra", "title": "Govt reshuffles secretary portfolios as it gets battle-ready against covid-19 - Livemint", "description": "The reshuffle of bureaucrats also saw government appointing new officers in crucial departments directly handling matters related to covid-19 crisis", "url": "https://www.livemint.com/news/india/govt-reshuffles-secretary-portfolios-as-it-gets-battle-ready-against-covid-19-11587907264135.html", "urlToImage": null, "publishedAt": "2020-04-26T13:29:39Z", "content": "The centre on Sunday appointed 23 new secretaries including Tarun Bajaj as the new economic affairs secretary and Rajesh Verma as the corporate affairs secretary triggered by superannuation of existing secretaries in various departments.Bajaj, a 1988 batch Ha… [+2486 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Special Correspondent", "title": "Yes Bank case: CBI takes Kapil and Dheeraj Wadhawan into custody - The Hindu", "description": "Non-bailable warrants pending against them, says probe agency", "url": "https://www.thehindu.com/news/national/yes-bank-case-cbi-takes-kapil-and-dheeraj-wadhawan-into-custody/article31437652.ece", "urlToImage": null, "publishedAt": "2020-04-26T12:45:05Z", "content": "The CBI on Sunday took custody of Kapil and Dheeraj Wadhawan in connection with the Yes Bank case. The two were earlier kept in quarantine after they were tracked down to Satara in Maharashtra.\r\nAlso read: Yes Bank yet to use RBIs credit lifeline\r\nNon-bailabl… [+2281 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Karan Johar says sorry for social media posts: Have realised that I may have been insensitive - India Today", "description": "Karan Johar took to Twitter to apologies for his recent social media posts.", "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-says-sorry-for-social-media-posts-have-realised-that-i-may-have-been-insensitive-1671359-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T12:33:59Z", "content": "Filmmaker Karan Johar on Sunday said he is apologetic for his social media posts, many of which may have come off as \"insensitive\", at a time when the world is fighting the coronavirus outbreak.\r\nJohar's post came as a reaction to Australian comedian Greta Le… [+2240 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Gurugram MNCs may have to work from home till July end, some real estate projects can resume work: Official - India Today", "description": "MNCs, BPOs and IT enabled services (ITES) in Gurgaon may have to allow their employees to work from home till the end of July, says Gurgaon Metropolitan Development Authority CEO VS Kundu.", "url": "https://www.indiatoday.in/india/story/gurugram-mncs-may-have-to-work-from-home-till-july-end-some-real-estate-projects-can-resume-work-official-1671343-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T12:30:56Z", "content": "MNCs, BPOs and IT enabled services (ITES) in Gurugram may have to allow their employees to work from home till the end of July, says Gurgaon Metropolitan Development Authority CEO VS Kundu.\r\nKundu, who is also additional chief secretary of Haryana, added that… [+2945 chars]"}, {"source": {"id": null, "name": "Thenewsopediaindia.co.in"}, "author": "rishixkumar00", "title": "Covid-recovered PM Boris Johnson to resume work from Monday, says ‘raring to go’ - The Newsopedia", "description": "Recovered after being stricken by coronavirus, Prime Minister Boris Johnson prepared to lead the government response to the pandemic challenge again from Monday, as pressure grew from various quarters", "url": "https://www.thenewsopediaindia.co.in/news/world/covid-recovered-pm-boris-johnson-to-resume-work-from-monday-says-raring-to-go-world-news/", "urlToImage": null, "publishedAt": "2020-04-26T12:25:13Z", "content": "Recovered after being stricken by coronavirus, Prime Minister Boris Johnson prepared to lead the government response to the pandemic challenge again from Monday, as pressure grew from various quarters to announce steps to ease the lockdown.\r\nForeign secretary… [+1781 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Covid-19 cases in Wuhan hospitals drop to zero for 1st time - Times of India", "description": "China News: The last patient in Wuhan was cured on Friday, reducing the number of coronavirus patients in the city to zero, said a spokesperson for China's Nation", "url": "https://timesofindia.indiatimes.com/world/china/covid-19-cases-in-wuhan-hospitals-drop-to-zero-for-1st-time/articleshow/75390046.cms", "urlToImage": null, "publishedAt": "2020-04-26T12:08:20Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Staff Writer", "title": "Gold prices up 40% in a year. Next target: ₹50,000 per 10 gram by year-end - Livemint", "description": "Across the world, the investment demand for gold has been on a upswing as a hedge against a deeper global recession and meltdown in some asset classes like oil", "url": "https://www.livemint.com/market/commodities/gold-prices-up-40-in-a-year-next-target-rs-50-000-per-10-gram-by-year-end-11587889465935.html", "urlToImage": null, "publishedAt": "2020-04-26T12:03:22Z", "content": "From last year's Akshaya Tritiya to this years's Akshaya Tritiya, gold prices are up about 40% in a span of one year. And still analysts remain bullish on the yellow metal with some of them forecasting price prices to rise to about 50,000 per 10 gram by the e… [+3210 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Senior health official dies of Covid-19 in West Bengal - Hindustan Times", "description": "Dasgupta, 60, was in-charge of the state’s central medical store. He was admitted to the hospital on April 18, a day after his samples tested positive, and had been on ventilator since then. His wife is also battling Covid-19.", "url": "https://www.hindustantimes.com/india-news/senior-health-official-dies-of-covid-19-in-west-bengal/story-M75bbs2sG7UO1AETwpsQKN.html", "urlToImage": null, "publishedAt": "2020-04-26T11:48:19Z", "content": "West Bengal recorded the first case of a senior health official dying after being infected by the coronavirus disease (Covid-19) when Biplab Kanti Dasgupta, assistant director of health services, died at a private hospital early on Sunday.\r\nDasgupta, 60, was … [+2464 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Omar Rashid", "title": "Every person I came in contact with tested negative, says singer Kanika Kapoor - The Hindu", "description": "In a statement issued on Sunday, she responded to allegations of not adhering to quarantine norms.", "url": "https://www.thehindu.com/entertainment/every-person-i-came-in-contact-with-tested-negative-says-singer-kanika-kapoor/article31437427.ece", "urlToImage": null, "publishedAt": "2020-04-26T11:44:57Z", "content": "Bollywood singer Kanika Kapoor on Sunday for the first time openly responded to allegations of not adhering to quarantine norms around the time she had returned from abroad and tested positive for COVID-19 last month.\r\n\"Every person that I have come in contac… [+1685 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "New York Times", "title": "Coronavirus antibody tests: Can you trust the results? - Times of India", "description": "The researchers worked around the clock, in shifts of three to five hours, hoping to stave off weariness and keep t", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-antibody-tests-can-you-trust-the-results/articleshow/75387833.cms", "urlToImage": null, "publishedAt": "2020-04-26T11:41:54Z", "content": "The researchers worked around the clock, in shifts of three to five hours, hoping to stave off weariness and keep their minds sharp for the delicate task.\r\nThey set up lines of laboratory volunteers: medical residents, postdoctoral students, even experienced … [+11078 chars]"}, {"source": {"id": null, "name": "Thestar.com.my"}, "author": "Douglas Busvine", "title": "Covid-19: Germany flips on smartphone contact tracing, backs Apple and Google - The Star Online", "description": "Germany changed course on Sunday over which type of smartphone technology it wanted to use to trace coronavirus infections, backing an approach supported by Apple and Google along with a growing number of other European countries.", "url": "https://www.thestar.com.my/tech/tech-news/2020/04/26/covid-19-germany-flips-on-smartphone-contact-tracing-backs-apple-and-google", "urlToImage": null, "publishedAt": "2020-04-26T09:57:55Z", "content": "BERLIN: Germany changed course on on April 26 over which type of smartphone technology it wanted to use to trace coronavirus infections, backing an approach supported by Apple and Google along with a growing number of other European countries.\r\nChancellery Mi… [+3366 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Rafael sends Manchester United summer transfer warning - Goal India", "description": "Onome Ebi is doubtful about Nigeria's chances of maintaining its continental dominance in the coming years following a nervy triumph over South Africa at the 2018 African Women's Cup of Nations.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T09:41:00Z", "content": "More"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Sukanya Charuchandra", "title": "Convalescent Plasma's Success Against COVID-19 Continues in New Study - The Wire", "description": "Convalescent plasma is one of three immune-based options that may be able to tackle COVID-19.", "url": "https://science.thewire.in/the-sciences/convalescent-plasmas-success-against-covid-19-continues-in-new-study/", "urlToImage": null, "publishedAt": "2020-04-26T09:29:00Z", "content": "An artist’s impression of red blood cells flowing through a vein. Image: Narupon Promvichai/pixabay.\r\nResearchers in China have been experimenting with using blood plasma from patients who have recovered from COVID-19 as a possible way to treat severely ill C… [+5508 chars]"}, {"source": {"id": null, "name": "Indianweb2.com"}, "author": "Vardaan", "title": "An Asteroid \"Coming Near Earth\" Looks Like It's Wearing A Face Mask - IndianWeb2.com", "description": "", "url": "https://www.indianweb2.com/2020/04/26/an-asteroid-coming-near-earth-looks-like-its-wearing-a-face-mask/", "urlToImage": null, "publishedAt": "2020-04-26T09:21:47Z", "content": "The Arecibo Observatory, a radio telescope in Puerto Rico, is tracking an asteroid which is approaching Earth this week and while it poses no threat, the asteroid somehow appears to know this planet of humans is facing a pandemic.\r\nThe University of Central F… [+1510 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "http://www.facebook.com/pages/wmpowerusercom/37708414657", "title": "Apple and Google updates their Coronavirus contact-tracing API to reduce false positives - MSPoweruser - MSPoweruser", "description": "Earlier Apple and Google announced that they are working together to develop an API for iOS and Android which can be used by approved apps to detect who you come in contact with during the day and notify you if those people later turn out to be positive for c…", "url": "https://mspoweruser.com/apple-and-google-updates-their-contact-tracing-api-to-reduce-false-positives/", "urlToImage": null, "publishedAt": "2020-04-26T09:21:33Z", "content": "Earlier Apple and Google announced that they are working together to develop an API for iOS and Android which can be used by approved apps to detect who you come in contact with during the day and notify you if those people later turn out to be positive for c… [+1613 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "PTI", "title": "Cardiac abnormalities in COVID-19 patients treated with hydroxychloroquine: Study - India TV News", "description": "Patients with COVID-19 who were on a regimen of the drugs hydroxychloroquine and azithromycin experienced cardiac abnormalities, according to a study which recommends the continuous monitoring of heart beat rhythms in infected people with underlying health co…", "url": "https://www.indiatvnews.com/science/cardiac-abnormalities-covid-19-patients-treated-with-hydroxychloroquine-study-611462", "urlToImage": null, "publishedAt": "2020-04-26T09:20:29Z", "content": "Cardiac abnormalities in COVID-19 patients treated with hydroxychloroquine: Study\r\nPatients with COVID-19 who were on a regimen of the drugs hydroxychloroquine and azithromycin experienced cardiac abnormalities, according to a study which recommends the conti… [+2424 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "36-year-old man dies, becomes Tamil Nadu’s youngest COVID-19 victim - The News Minute", "description": "A 36-year-old man who was admitted to Chrompet Government Hospital in Chennai died due to COVID-19 infection at 10.15 pm on April 24, taking the total number of COVID-19 deaths in Tamil Nadu to 23. This is the youngest COVID-19 death in the state so far. The …", "url": "https://www.thenewsminute.com/article/36-year-old-man-dies-becomes-tamil-nadu-s-youngest-covid-19-victim-123358", "urlToImage": null, "publishedAt": "2020-04-26T09:03:01Z", "content": "According to officials, the deceased had comorbidities like hypothyroidism and obesity.A 36-year-old man who was admitted to Chrompet Government Hospital in Chennai died due to COVID-19 infection at 10.15 pm on April 24, taking the total number of COVID-19 de… [+1772 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Will Tell TikTok to Block You because You're Annoying: Chris Gayle Trolls Yuzvendra Chahal - News18", "description": "Gayle referred to Chahal as 'annoying' and went on to the extent of saying that he is going to block him.", "url": "https://www.news18.com/news/buzz/will-tell-tiktok-to-block-you-because-youre-annoying-chris-gayle-trolls-yuzvendra-chahal-2593275.html", "urlToImage": null, "publishedAt": "2020-04-26T08:34:30Z", "content": "West Indies batsman Chris Gayle brutally roasted India spinner Yuzvendra Chahal for his social media posts during a live session on popular social media platform Instagram. With no cricket going due to coronavirus pandemic, players are engaging with fans thes… [+1055 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Randeep Hooda uses Extraction to deliver important Covid-19 message: ‘Don’t step out or...’ - Hindustan Times", "description": "Randeep Hooda shared a still from his latest release, the Netflix film Extraction and asks all to stay home during the pandemic.", "url": "https://www.hindustantimes.com/bollywood/randeep-hooda-uses-extraction-to-deliver-important-covid-19-message-don-t-step-out-or/story-AF3RqM9ZGRcHLSzVpS7dFO.html", "urlToImage": null, "publishedAt": "2020-04-26T08:01:00Z", "content": "Actor Randeep Hooda made his Hollywood debut with Chris Hemsworth starrer Extraction earlier this week. On Sunday, he posted a still from the film and warned all against stepping out during coronavirus crisis.\r\nHe wrote on Instagram, “Only if this boy hadn’t … [+2270 chars]"}, {"source": {"id": null, "name": "Www.bgr.in"}, "author": "Staff", "title": "LG Velvet key specifications leak ahead of launch | BGR India - BGR India", "description": "LG Velvet - A list of important specifications of the upcoming LG smartphone was recently leaked. Check the leaked specifications at BGR.in", "url": "https://www.bgr.in/news/lg-velvet-key-specifications-leaked-ahead-of-launch-reveals-snapdragon-765-8gb-ram-888019/", "urlToImage": null, "publishedAt": "2020-04-26T07:44:07Z", "content": "LG is set to make a pretty big comeback with its upcoming series of smartphones that will focus on design and aesthetics. Set to replace the LG G series, the first of these phones is the upcoming LG Velvet. Now days ahead of its launch, the entire specificati… [+1974 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Mark Zuckerberg on rise of video conferencing apps amid Covid-19 pandemic - Hindustan Times", "description": "Zuckerberg said there is a ‘temporary’ peak right now but the trend was always headed towards that direction.", "url": "https://www.hindustantimes.com/tech/mark-zuckerberg-on-rise-of-video-conferencing-apps-amid-covid-19-pandemic/story-4nQtPZHKKRjfukcIo5DlnI.html", "urlToImage": null, "publishedAt": "2020-04-26T07:28:23Z", "content": "The rise of video conferencing app is one of the by-products of the ongoing of Covid-19 pandemic. From Zoom to HouseParty, a slew of video calling applications have started to gain huge traction. Facebook is also joining the fray with Messenger Rooms and a bu… [+2276 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Sandeep Phukan", "title": "Don't lower your guard against COVID-19, PM Modi tells citizens - The Hindu", "description": "PM hails contribution of State govts in fight against COVID-19 pandemic, says they have played a very active role.", "url": "https://www.thehindu.com/news/national/modi-on-mann-ki-baat/article31436630.ece", "urlToImage": null, "publishedAt": "2020-04-26T06:24:56Z", "content": "Acknowledging that Indias fight against the coronavirus [COVID-19] is people-driven, Prime Minister Narendra Modi asked citizens to remain careful and not lower their guard against the pandemic on the assumption that it will not affect them.'\r\nAddressing his … [+3629 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Samantha fans bowled over by Tamannaah Bhatia's tweet - Telangana Today", "description": "Hyderabad: It's a rare sight for anyone in Telugu cinema industry to have female stars praising each other. Samantha Akkineni fans went gaga over actor Tamannaah Bhatia' tweet, On an exceptionally special occasion, I’d like to reveal #SamanthaBirthdayCDP The …", "url": "https://telanganatoday.com/samantha-fans-bowled-over-by-tamannahs-tweet", "urlToImage": null, "publishedAt": "2020-04-26T06:20:00Z", "content": "Hyderabad: It’s a rare sight for anyone in Telugu cinema industry to have female stars praising each other. Samantha Akkineni fans went gaga over actor Tamannaah Bhatia’ tweet, “On an exceptionally special occasion, Id like to reveal #SamanthaBirthdayCDP The … [+1811 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Longjam Dineshwori", "title": "Prescriptions for antidepressants and anti-anxiety drugs surge amidst COVID-19 pandemic - TheHealthSite", "description": "According to a report prescriptions of anti-anxiety medications rose by 34.1% between mid-February and mid-March in the US.", "url": "https://www.thehealthsite.com/news/prescriptions-for-antidepressants-and-anti-anxiety-drugs-surge-amidst-covid-19-pandemic-741891/", "urlToImage": null, "publishedAt": "2020-04-26T06:06:59Z", "content": "Stress about health, finances and uncertainty about the future amidst the COVID-19 pandemic is taking a serious toll on the mental health of people worldwide. In India, there has been a massive spike in patients with mental illness since the coronavirus outbr… [+4292 chars]"}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "Alex  Mathew", "title": "BQ Big Decisions: As A Crisis Hits Debt Funds, Is Your Money Safe? - BloombergQuint", "description": "Should you approach investing in debt mutual funds differently now?", "url": "https://www.bloombergquint.com/business/bq-big-decisions-as-a-crisis-hits-debt-funds-is-your-money-safe", "urlToImage": null, "publishedAt": "2020-04-26T05:25:49Z", "content": "BloombergQuints Big Decisions podcast gets you the insights you need to make big money decisions with confidence.\r\nWhen Franklin Templeton Mutual Fund wound up its six yield-oriented, managed credit funds last week, it shook the confidence of a large number o… [+485 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "todaynewspaper.in", "title": "As Rumours Surface of Kim Jong Un’s Ill Health, Spotlight on His Sister as Possible Power Centre - Todaynewspaper", "description": "Kim Jong Un with sister Kim Yo Jong (Reuters) Each change of leadership in North Korea has raised the prospect of a leadership vacuum or collapse of the Kim dynasty, which has ruled the country since its founding in 1948. Reuters \r Last Updated: April 26, 202…", "url": "https://www.news18.com/news/world/as-rumours-surface-of-kim-jong-uns-ill-health-spotlight-on-his-sister-as-possible-power-centre-2593017.html", "urlToImage": null, "publishedAt": "2020-04-26T04:52:48Z", "content": "North Korea has never publicised who would follow leader Kim Jong Un in the event he is incapacitated, and with no details known about his young children, analysts say his sister and loyalists could form a regency until a successor is old enough to take over.… [+4343 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "Second wave of COVID-19 may hit India during monsoon months - Northeast Now", "description": "Though coronavirus cases in India may go down substantially in the coming days, it may again resurface during the monsoon months. According to an India Times report, the second wave is expected to hit the country in the months of July and August. However, acc…", "url": "https://nenow.in/top-news/second-wave-of-covid-19-may-hit-india-during-monsoon-months.html/", "urlToImage": null, "publishedAt": "2020-04-26T03:20:07Z", "content": "Though coronavirus cases in India may go down substantially in the coming days, it may again resurface during the monsoon months.\r\nAccording to an India Times report, the second wave is expected to hit the country in the months of July and August.\r\nHowever, a… [+840 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Reuters", "title": "'I want my life back': Germans protest against lockdown - The Hindu", "description": "Germany has put in place strict curbs on public activity, imposing its lockdown on March 17", "url": "https://www.thehindu.com/news/international/i-want-my-life-back-germans-protest-against-lockdown/article31436294.ece", "urlToImage": null, "publishedAt": "2020-04-26T02:39:59Z", "content": "German police wearing riot gear and face masks tussled on Saturday with dozens of protesters demonstrating in central Berlin against the coronavirus lockdown on public life.\r\nProtesters shouted I want my life back and held up signs with slogans such as Protec… [+2371 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "UK Hospital Deaths From Coronavirus Cross 20,000, Fifth Nation to Touch Grim Milestone - News18", "description": "These official figures do not account for deaths that occur elsewhere in the community, which means the overall number of COVID-19 deaths in the country is much higher.", "url": "https://www.news18.com/news/world/uk-hospital-deaths-from-coronavirus-cross-20000-fifth-nation-to-touch-grim-milestone-2592723.html", "urlToImage": null, "publishedAt": "2020-04-25T15:59:27Z", "content": "The number of deaths in the UK hospitals from the novel coronavirus crossed the grim milestone of 20,000 on Saturday, up by 813 over the previous day among the highest daily death tolls recorded this week.\r\nThese official figures released daily by the UK's De… [+1180 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Cosmic Reef: NASA release an image of a blazing starbirth to mark Hubble's 30th birthday - Firstpost", "description": "Hubble has been placed in space to observe the most distant stars and galaxies, as well as planets in our solar system.", "url": "https://www.firstpost.com/tech/science/cosmic-reef-nasa-release-an-image-of-a-blazing-starbirth-to-mark-hubbles-30th-birthday-8299671.html", "urlToImage": null, "publishedAt": "2020-04-25T10:23:08Z", "content": "FP TrendingApr 25, 2020 16:24:11 IST\r\nThe US space agency has released a new bright picture of a firestorm of starbirth to mark the 30th anniversary of the Hubble Space Telescope. Scientists have called the picture Cosmic Reef, as it resembles a coral reef fl… [+1921 chars]"}]}