{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "techradar", "name": "TechRadar"}, "author": "Mark Wilson", "title": "Join us live and play The TechRadar Quiz on Facebook and YouTube today! - TechRadar India", "description": "Let's get quizzical etc", "url": "https://www.techradar.com/news/join-us-and-play-the-techradar-quiz-on-facebook-and-youtube-today", "urlToImage": "https://cdn.mos.cms.futurecdn.net/kkoyHMdPD5ZLeW9AspFaif-1200-80.png", "publishedAt": "2020-04-23T18:30:00Z", "content": "Is your tech knowledge so good that Tim Cook calls you for help with pub quiz questions? Or do you reckon you've got a photographic memory for app logos? \r\nIf so, we've got a challenge for you - The Tech(Radar) Quiz, and it's happening today, April 23 on Tech… [+1942 chars]"}, {"source": {"id": null, "name": "Nationalheraldindia.com"}, "author": "IANS", "title": "Tectonic plates started shifting 3.2 billion years ago: Study - National Herald", "description": "Earth’s tectonic plates started moving more than 3.2 billion years ago - just over 1.3 billion years after the Earth first formed and earlier than originally thought, researchers have revealed.", "url": "https://www.nationalheraldindia.com/science-tech/tectonic-plates-started-shifting-32-billion-years-ago-study", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2020-04%2Fdfde116a-4fe3-4b33-bf16-5d17ad905df0%2Ftectonic.jpg?rect=11%2C0%2C594%2C312&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-04-23T18:18:03Z", "content": "For the study, members of the project travelled to Pilbara Craton in Western Australia. A craton is a primordial, thick, and very stable piece of crust. They are usually found in the middle of tectonic plates and are the ancient hearts of the Earth's continen… [+408 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express Web Desk", "title": "Coronavirus India LIVE Updates: Stigma over COVID-19 increasing mortality, morbidity, says AIIMS director - The Indian Express", "description": "Coronavirus (COVID-19) Tracker India Latest News LIVE Updates: A month into the nationwide lockdown enforced to contain the spread of the novel coronavirus, the total number of Covid-19 cases in India rose to 21,700, including 16,689 active cases, 4,325 recov…", "url": "https://indianexpress.com/article/india/coronavirus-latest-news-india-live-updates-covid-19-tracker-india-state-wise-worldwide-cases-deaths-covid-19-vaccine-news-update-6374673/", "urlToImage": "https://images.indianexpress.com/2020/04/delhi-corona-1.jpg?w=759", "publishedAt": "2020-04-23T17:38:54Z", "content": "The ordinance to amend the Epidemic Diseases Act, 1897, will cover all healthcare personnel (Express Photo)\r\nEarlier in the day, the Ministry of Finance issued a notification this afternoon freezing Dearness Allowance (DA) to its employees and Dearness Relief… [+3847 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Hope For Covid-19 Treatment, Gilead's Antiviral Remdesivir, Flops in First Human Trial: Report - News18", "description": "The trial showed that remdesivir did not improve patients' condition or reduce the pathogen's presence in the bloodstream.", "url": "https://www.news18.com/news/world/worlds-first-hope-for-covid-19-treatment-gileads-antiviral-remdesivir-flops-in-first-human-trial-2590205.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587662894_2020-04-23t170420z_1_lynxnpeg3m26k_rtroptp_4_health-coronavirus-gilead-sciences.jpg", "publishedAt": "2020-04-23T17:36:14Z", "content": "Gilead Sciences Inc's experimental coronavirus drug failed its first randomised clinical trial, the Financial Times reported on Thursday, citing draft documents published accidentally by the World Health Organisation.\r\nTrading in the shares of the company was… [+1185 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "No DA hike, dearness relief for central govt staff and pensioners: What are the financial implications? - Moneycontrol.com", "description": "Dearness allowance and dearness relief are part of salary or pension received by the employee or pensioner, respectively. They are taxed at marginal rate of tax under the head ‘income from salary’", "url": "https://www.moneycontrol.com/news/business/economy/no-da-hike-dearness-relief-for-central-govt-staff-and-pensioners-what-are-the-financial-implications-5183531.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/02/rupee_f18-770x433.jpg", "publishedAt": "2020-04-23T17:22:00Z", "content": "The Centre has announced a freeze in the dearness allowance payable to central government employees and dearness relief payable to central government pensioners at current rates till July 2021. The announcement comes in the backdrop of the economic slowdown c… [+3827 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Shishir Gupta", "title": "Pilloried over Covid-19 response, WHO opts for truncated annual meet in May - Hindustan Times", "description": "The World Heath Organisation has said the May session of the World Health Assembly would only consider an abridged agenda", "url": "https://www.hindustantimes.com/world-news/pilloried-over-covid-19-response-who-opts-for-truncated-annual-meet-in-may/story-wfE7aJ8yok0ylGXTkuppSO.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/23/Pictures/_f0f1e4d6-8581-11ea-bf89-3b987bd73d6a.jpg", "publishedAt": "2020-04-23T16:51:00Z", "content": "The World Health Organisation has decided to go for a truncated annual meet on May 18 with a limited agenda amid efforts by countries such as Australia to push for an international investigation into the coronavirus pandemic.\r\nIn a communication sent to membe… [+2886 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Don't think MS Dhoni wants to play for India anymore: Harbhajan Singh - Times of India", "description": "Cricket News: Veteran Indian spinner Harbhajan Singh on Thursday said that former India skipper MS Dhoni does not want to make a comeback in the team. Harbhajan in", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/dont-think-ms-dhoni-wants-to-play-for-india-anymore-harbhajan-singh/articleshow/75328835.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75328797,width-1070,height-580,imgsize-175602,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-04-23T16:40:06Z", "content": "NEW DELHI: Veteran Indian spinner Harbhajan Singh on Thursday said that former India skipper MS Dhoni does not want to make a comeback in the team.\r\nHarbhajan in an Instagram Live session with India opener Rohit Sharma revealed that the World Cup 2019 semifin… [+1465 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "What Facebook and Jio working together means for Internet in India - Hindustan Times", "description": "Facebook buying a 9.99% stake in Reliance Jio platforms gives both the companies a chance to make inroads into the Indian Internet domain.", "url": "https://www.hindustantimes.com/tech/what-facebook-and-jio-working-together-means-for-internet-in-india/story-i8Ob8HQhgtHDnhJbVnxotL.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/23/Pictures/_2427f026-857c-11ea-bf89-3b987bd73d6a.jpeg", "publishedAt": "2020-04-23T16:26:33Z", "content": "Facebook buying a 9.99% stake in Reliance Jio platforms gives both the companies a chance to make inroads into the Indian Internet domain. Reliance Retail will get to use WhatsApp to get more customers onto JioMart, its grocery delivery platform for starters,… [+4447 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Stop cheap politics, join hands with govt in fighting coronavirus: BJP to Congress - Times of India", "description": "India News: Accusing the Congress of deliberately trying to create divisions in the society, the BJP on Thursday asked the opposition party not to practice \"cheap", "url": "https://timesofindia.indiatimes.com/india/stop-cheap-politics-join-hands-with-govt-in-fighting-coronavirus-bjp-to-congress/articleshow/75326125.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75326173,width-1070,height-580,imgsize-257046,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-04-23T16:20:46Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Unboxing the New Apple iPhone SE - PCMag", "description": "Apple's new $399 iPhone SE looks a lot like an iPhone 8, but it has the latest A13 processor on board. Here's what you get in the box. https://www.pcmag.com/...", "url": "https://www.youtube.com/watch?v=ofQ8Mr4gPo4", "urlToImage": "https://i.ytimg.com/vi/ofQ8Mr4gPo4/maxresdefault.jpg", "publishedAt": "2020-04-23T16:07:17Z", "content": null}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "Don't want to revisit old controversies: Kerala CM Pinarayi on Sprinklr row - The News Minute", "description": "For the second day in a row, Kerala Chief Minister Pinarayi Vijayan was subjected to questions from journalists regarding allegations that data of persons under observation for COVID-19 were being leaked by the government. For the last few weeks, multiple MLA…", "url": "https://www.thenewsminute.com/article/dont-want-revisit-old-controversies-kerala-cm-pinarayi-sprinklr-row-123208", "urlToImage": "https://www.thenewsminute.com/sites/default/files/pinarayi-vijayan_1200x800.jpg", "publishedAt": "2020-04-23T15:47:38Z", "content": "On Thursday, 10 more people tested positive for coronavirus in Kerala.For the second day in a row, Kerala Chief Minister Pinarayi Vijayan was subjected to questions from journalists regarding allegations that data of persons under observation for COVID-19 wer… [+4363 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Randeep Hooda on why he rejected Hollywood roles before Extraction: They were stereotypical, ridiculed India - India Today", "description": "Randeep Hooda spoke to IndiaToday.in about how action is perceived in Bollywood vs Hollywood, why he rejected several international offers before Extraction, and about Salman Khan's Radhe.", "url": "https://www.indiatoday.in/movies/celebrities/story/randeep-hooda-on-why-he-rejected-hollywood-roles-before-extraction-they-were-stereotypical-ridiculed-india-1670299-2020-04-23", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202004/randeep-647x363.jpeg?7yBHpxIs.rIO8lsia.bxEqQrkGjs1p4K", "publishedAt": "2020-04-23T15:11:15Z", "content": "When the news of Chris Hemsworth aka Thor starring in an action-packed Netflix Original, Extraction, dropped, the world sat up and took notice. Sam Hargrave, the man credited as the stunt coordinator for several films in the Marvel Cinematic Universe, was goi… [+6952 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Pakistan running propaganda against India on social media - Times of India", "description": "India News: NEW DELHI: Pakistan has been running social media propaganda against India using fake Arab, Christian and Hindu identities to target Prime Minister Na.", "url": "https://timesofindia.indiatimes.com/india/pakistan-running-propaganda-against-india-on-social-media/articleshow/75321469.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75321547,width-1070,height-580,imgsize-36664,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-04-23T15:10:24Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "ICC heading towards T20 World Cup in Feb-March, opens opportunity to stage IPL in Sept-Oct - India Today", "description": "ICC is heading towards hosting the T20 World Cup in February-March 2021, thereby opening the opportunity to stage the Indian Premier League (IPL) in September-October.", "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-schedule-icc-bcci-ipl-news-1670288-2020-04-23", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202004/ICC-770x433-647x363.jpeg?LCyAh4yrw_unBI3JkNua8yuxHcxNxmqW", "publishedAt": "2020-04-23T15:09:31Z", "content": "The BCCI has made it clear that Test cricket remains paramount for Indian cricket with regards to the disrupted World Test Championship even as options for a delayed T20 World Cup were discussed during the ICC chief executives' committee meeting on Thursday.\r… [+2240 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘Fed up’ Kiara Advani zooming off on a tricycle in adorable throwback video is a total mood - Hindustan Times", "description": "Kiara Advani shared a childhood video of herself which reflects her current mood. However, with the lockdown in place, she cannot go out.", "url": "https://www.hindustantimes.com/bollywood/fed-up-kiara-advani-zooming-off-on-a-tricycle-in-adorable-throwback-video-is-a-total-mood/story-qUMjVgwIRp2BRow1P75oWN.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/23/Pictures/_260b60e0-8571-11ea-bf89-3b987bd73d6a.jpg", "publishedAt": "2020-04-23T15:04:53Z", "content": "Kiara Advani, who is self-isolating with her family in Mumbai, has been entertaining fans with adorable throwback videos from her ‘wonder years’. Her latest childhood video perfectly captures her mood right now.\r\nIn the cute clip, Kiara tells her mother that … [+1609 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "David Canellis", "title": "Elon Musk’s 420th Starlink satellite is more than just a weed joke - The Next Web", "description": "Elon Musk‘s internet-from-space project Starlink sent 60 new satellites into low-orbit without problem on Wednesday, bringing the total size of its constellation to — wait for it — 420. The SpaceX founder was quick to laud Starlink’s success with a cute tweet…", "url": "https://thenextweb.com/hardfork/2020/04/23/starlink-spacex-elon-musk-satellites-420-weed-funny-haha-taking-tesla-private/", "urlToImage": "https://img-cdn.tnwcdn.com/image/hardfork?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2020%2F04%2Fmuskstarlink.jpg&signature=d1caac783581e53a6fc88eb0a2db5354", "publishedAt": "2020-04-23T14:05:42Z", "content": "Elon Musks internet-from-space project Starlink sent 60 new satellites into low-orbit without problem on Wednesday, bringing the total size of its constellation to  wait for it  420.\r\nThe SpaceX founder was quick to laud Starlinks success with a cute tweet, c… [+2518 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Coronavirus: Oxford University begins human trials, but vaccine may not be available till next year - India Today", "description": "It's hoped that the production of the Oxford trial vaccine should start in September but before people could rejoice, Chief Medical Officer of England, Chris Whitty warned that we might not be able to reap its benefits this year.", "url": "https://www.indiatoday.in/world/story/coronavirus-oxford-university-begins-human-trials-but-vaccine-may-not-be-available-till-next-year-1670256-2020-04-23", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202004/PTI20-04-2020_000087B-647x363.jpeg?A1RCHaJnkh_tJKSWvaaJ0QzDVxoQGG.m", "publishedAt": "2020-04-23T13:22:26Z", "content": "The University of Oxford in the United Kingdom on Thursday started the human trial of the novel coronavirus vaccine it has developed.\r\nIn its first phase, the trial will be carried out on healthy adults between the age of 18 to 55. Once the safety is ascertai… [+3043 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Prabhjote Gill", "title": "The Mars helicopter is cool — a fleet of small, levitating nanocardboard aircraft would be cooler - Business Insider India", "description": "Exploring Mars in the future could be done using tiny, levitiating ‘nanocardboard’ aircraft — each of which weighs less than a fruit fly. These aircraft will", "url": "https://www.businessinsider.in/science/space/news/the-mars-helicopter-is-cool-a-fleet-of-small-levitating-nanocardboard-aircraft-would-be-cooler/articleshow/75325080.cms", "urlToImage": "https://www.businessinsider.in/photo/75325080/the-mars-helicopter-is-cool-a-fleet-of-small-levitating-nanocardboard-aircraft-would-be-cooler.jpg?imgsize=755490", "publishedAt": "2020-04-23T13:10:00Z", "content": "NASA has plans to launch Perseverance this summer with a “high risk, high reward” helicopter on board to explore the Red Planet. Before the project’s had a chance to get off the ground — quite literally — researchers at Penn University have a more ambitious p… [+3386 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "NASA, USGS Release New Map of the Moon to Serve as Blueprint for Further Missions - News18", "description": "The USGS says that the map is the product of a project that has been in the works for decades.", "url": "https://www.news18.com/news/buzz/nasa-usgs-release-new-map-of-the-moon-to-serve-as-blueprint-for-further-missions-2589757.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587643263_fake-news-9.jpg", "publishedAt": "2020-04-23T12:24:57Z", "content": "The United States Geological Survey (USGS) has now released a comprehensive and more detailed map of the moon in association with the Lunar Planetary Institute and NASA. The new map, according to USGS, will serve as a blueprint that can help navigate and guid… [+985 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Aparna Banerjea", "title": "Coronavirus update: Covid-19 cases in India surge to 21,700, death toll at 686. State-wise numbers - Livemint", "description": "Maharashtra remained the worst hit state in India with a total of 5,652 coronavirus cases along with 269 deaths since the outbreak .So far, 4,324 patients who have been discharged or cured of the highly contagious disease and one has migrated from the country", "url": "https://www.livemint.com/news/india/coronavirus-update-covid-19-cases-in-india-surge-to-21-700-death-toll-at-686-state-wise-numbers-11587638713364.html", "urlToImage": "https://images.livemint.com/img/2020/04/23/600x338/2020-04-23T092319Z_399661465_RC29AG906398_RTRMADP_3_HEALTH-CORONAVIRUS-SOUTHASIA_1587641039075_1587641053628.JPG", "publishedAt": "2020-04-23T12:08:53Z", "content": "With 1,229 fresh cases in the last 24 hours, India's novel coronavirus count has increased to 21,700, according to the latest Ministry of Health and Family Welfare data. Along with that, the death toll due to the virus has increased to 686 after 34 more patie… [+4408 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Rahul Singh", "title": "Rajnath Singh unveils DRDO-powered mobile lab to speed up Covid-19 screening - Hindustan Times", "description": "The DRDO is among the several government agencies that have been at the forefront of the fight against the coronavirus disease. It has developed several products to combat the pandemic, including ventilators, PPE kits, large area sanitisation solutions and Co…", "url": "https://www.hindustantimes.com/india-news/rajnath-singh-unveils-drdo-powered-mobile-lab-to-speed-up-covid-19-screening/story-ElcyBOt2HPxcQgwL6tydMI.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/23/Pictures/covid19-transportable-testing-lab-launched_5e50521a-8555-11ea-bf89-3b987bd73d6a.jpg", "publishedAt": "2020-04-23T11:59:27Z", "content": "Defence minister Rajnath Singh on Thursday unveiled, via video conference, a mobile virology research and diagnostics laboratory (MVRDL) that will speed up coronavirus disease screening and other Covid-19-related research and development activities, the defen… [+2741 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "SEBI eases buyback rules for fundraising amid coronavirus pandemic - Moneycontrol", "description": "This relaxation will be applicable till December 31, 2020, the Securities and Exchange Board of India (SEBI) said in a circular.", "url": "https://www.moneycontrol.com/news/india/sebi-eases-buyback-rules-for-fundraising-amid-coronavirus-pandemic-5182191.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2019/06/SEBI-770x433.jpg", "publishedAt": "2020-04-23T11:58:35Z", "content": "To ease fundraising through securities markets, regulator SEBI on Thursday relaxed period of restriction to six months for raising further capital through buyback from the current one year amid the coronavirus pandemic.\r\nThis relaxation will be applicable til… [+1237 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": null, "title": "Match Preview Australia vs India, Final, Sharjah Cup 2020 - ESPNcricinfo", "description": "Read and watch preview for Final, Sharjah Cup 2020, RetroLive 2019/20 only on ESPNcricinfo.com", "url": "https://www.espncricinfo.com/series/19832/preview/1221310/australia-vs-india-final-sharjah-cup-retrolive-2019-20", "urlToImage": "https://a.espncdn.com/i/cricket/cricinfo/309739_900x506.jpg", "publishedAt": "2020-04-23T10:43:00Z", "content": "Big picture\r\nIt is said often that cricket is an individual pursuit masquerading as a team sport.\r\nOn April 22, Sachin Tendulkar proved and disproved it at the same time. Having fielded and bowled in the crazy heat of a Sharjah April afternoon, Tendulkar dipp… [+4551 chars]"}, {"source": {"id": null, "name": "Dailypost.ng"}, "author": "John Owen Nwachukwu", "title": "PTF counters Health Minister, Osagie on ‘COVID-19 being transmitted ‘sexually’ - Daily Post Nigeria", "description": "The Nigerian government through the Presidential Task Force (PTF) on COVID-19 has said there is no scientific proof that the disease is sexually transmissible. This assertion was made by the National Coordinator of the PTF, Dr Sani Aliyu in a press briefing o…", "url": "https://dailypost.ng/2020/04/23/ptf-counters-health-minister-osagie-on-covid-19-being-transmitted-sexually/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2019/09/Osagie-Ehanire-1280x720.jpg", "publishedAt": "2020-04-23T10:39:01Z", "content": "The Nigerian government through the Presidential Task Force (PTF) on COVID-19 has said there is no scientific proof that the disease is sexually transmissible.\r\nThis assertion was made by the National Coordinator of the PTF, Dr Sani Aliyu in a press briefing … [+1083 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT correspondent", "title": "‘Fear we don’t start treating Covid-19 patients on road’: Pakistan doctors say they are running out... - Hindustan Times", "description": "The doctors said it is very unfortunate that people in Pakistan are not taking Covid-19 seriously.", "url": "https://www.hindustantimes.com/world-news/fear-we-don-t-start-treating-covid-19-patients-on-road-pakistan-doctors-say-they-are-running-out-of-beds/story-qWzqJvpv6BPXJEhDN76YdN.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/23/Pictures/doctors-ramadan-prevent-congregations-coronavirus-implementation-lockdown_3ba671b2-8547-11ea-bf89-3b987bd73d6a.jpg", "publishedAt": "2020-04-23T10:00:29Z", "content": "The doctors in Pakistan have warned that the coronavirus pandemic could worsen in the country in the coming weeks, and warned people to follow social distancing norms especially during the month of Ramzan.\r\n“This is a medical problem which has its resulting e… [+2149 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Bengal Governor questions Mamata Banerjee’s ‘red carpet’ to WHO team - Hindustan Times", "description": "A World Health Organization (WHO) team had visited Bengal earlier this week and the state government had cooperated with it.", "url": "https://www.hindustantimes.com/india-news/bengal-governor-questions-mamata-banerjee-s-red-carpet-to-who-team/story-H2em7vr2KlXPXxyTZYenpN.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/23/Pictures/constituion-november-occasion-dhankhar-hindustan-governor-jagdeep_e54fd1a2-853f-11ea-a351-6978c1d205f3.jpg", "publishedAt": "2020-04-23T09:43:00Z", "content": "West Bengal Governor Jagdeep Dhankhar took to Twitter on Thursday to fire another salvo at the Mamata Banerjee government over the ‘red carpet’ treatment for a World Health Organization (WHO) team and asking the government about the outcome of the visit.\r\n“Ur… [+3781 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": "https://web.facebook.com/udinmwen.efosa", "title": "Xiaomi will use a 150MP camera in Q4 2020 – Samsung is developing a 250MP sensor - Gizchina.com", "description": "Xiaomi to use a 150MP camera in Q4 2020 - Samsung developing a 250MP sensor. As of now, there is no timeline for the release of the 250MP sensor", "url": "https://www.gizchina.com/2020/04/23/xiaomi-to-use-a-150mp-camera-in-q4-2020-samsung-developing-a-250mp-sensor/", "urlToImage": "https://www.gizchina.com/wp-content/uploads/images/2019/10/108MP-camera.jpg", "publishedAt": "2020-04-23T09:36:21Z", "content": "Chinese manufacturing giant, Xiaomi, has been doing quite a lot in the smartphone industry. The company has a good working relationship with Samsung, especially in the camera department. Recall that Xiaomi is the first company to use Samsung’s 108MP camera – … [+1799 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Srinivasa Ramanujam", "title": "Kamal Haasan releases new song ‘Arivum Anbum’, states that ‘knowledge and love’ is the need of the hour - The Hindu", "description": "The actor-politician talks about his new virtually-conceived project to spread positivity during the global lockdown", "url": "https://www.thehindu.com/entertainment/movies/kamal-haasan-releases-new-song-arivum-anbum-states-that-knowledge-and-love-is-the-need-of-the-hour/article31413543.ece", "urlToImage": "https://www.thehindu.com/entertainment/movies/1hhoiz/article31413542.ece/ALTERNATES/LANDSCAPE_615/KH7", "publishedAt": "2020-04-23T09:03:58Z", "content": "Actor Kamal Haasan is trying to spread hope through music. His latest creation, Arivum Anbum, a song that sees big names of the film industry teaming up, is a number to spread positivity in these troubled times.\r\nI hope this song is therapy, a calming factor … [+3454 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "Apple leads true wireless buds market in India, Realme now on top 5 - India TV News", "description": "Apple dominated the true wireless stereo (TWS) market in India in 2019 while Realme grabbed 5th spot in just one month of launching its first Buds Air.", "url": "https://www.indiatvnews.com/technology/news-apple-leads-true-wireless-buds-market-in-india-realme-now-on-top-5-610512", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/04/apple-airpods-1587632042.jpg", "publishedAt": "2020-04-23T09:00:38Z", "content": "Apple Airpods are one of the most selling truly wireless earbuds in India.\r\nApple dominated the true wireless stereo (TWS) hearables market in India in 2019, driven by strong sales of its second-generation AirPods, while Chinese brand Realme grabbed 5th spot … [+2217 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Coronavirus crisis will not end anytime soon, many countries in early stages of epidemic, says WHO chief... - Firstpost", "description": "The WHO said that the coronavirus crisis will not end any time soon, with several countries only in the initial stages of the fight against COVID-19", "url": "https://www.firstpost.com/world/coronavirus-crisis-will-not-end-anytime-soon-many-countries-in-early-stages-of-epidemic-says-who-chief-tedros-adhanom-ghebreyesus-8289931.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2017/07/Tedros_WHO-director_getty_social-1280.jpg", "publishedAt": "2020-04-23T08:56:06Z", "content": "Geneva: The World Health Organisation (WHO) on Wednesday said that the COVID-19 crisis will not end any time soon, with several countries only in the initial stages of the fight against the virus.\r\nFile image of WHO director Tedros. Getty Images\r\n\"Make no mis… [+875 chars]"}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "Rajesh Bhayani", "title": "Why brokers are up in arms against MCX over the April crude oil contract - Business Standard", "description": "They say the exchange muscled its way in to force negative pricing on the contract without tweaking its software to protect traders, the way Nymex has done", "url": "https://www.business-standard.com/article/markets/explained-why-mcx-brokers-are-up-in-arms-against-crude-oil-contract-120042300492_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2018-08/31/full/1535655257-7138.jpg", "publishedAt": "2020-04-23T08:15:25Z", "content": "Over the past two days, broker members of MCX, India’s largest exchange for commodity derivatives, are up in arms against the manner in which the April crude oil contract was settled by the bourse. They have valid reasons to present their side of the story ag… [+5705 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "COVID-19 may not spread through sperm: Study - Daijiworld.com", "description": "", "url": "https://www.daijiworld.com/news/newsDisplay.aspx?newsID=700049", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2020-04-23T07:35:21Z", "content": "New York, Apr 23 (IANS): The deadly coronavirus is unlikely to spread through sperms, say researchers, adding that they found no evidence of the virus in the samples of semen of men infected with mild-to-moderate COVID-19 disease. It comes as a huge relief as… [+2517 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Aditi Sharma", "title": "Disha Patani reveals secret workout routine that helps her stay fit during lockdown - Republic World - Republic World", "description": "Disha Patani has been giving her fans major fitness goals by posting her quarantine workout routines. The actor recently talked about her fitness mantra.", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/disha-patani-reveals-the-secret-work-routine-that-is-keeping-her-fit.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/ptgwq8trep3p5hqs_1587622399.jpeg?tr=f-jpeg", "publishedAt": "2020-04-23T06:59:35Z", "content": "Disha Patani’s fans have been swooning over her impeccable beauty in her recent pictures. The actor has been giving major fitness goals with her dance and workout routines. The actor in the recent past made her fans go gaga over her stunning dance video on a … [+2138 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "U.S. was attacked, says Trump on coronavirus pandemic - The Hindu", "description": "U.S. President Donald Trump said the number of new positive COVID-19 cases continue to decline across the country.", "url": "https://www.thehindu.com/news/international/us-was-attacked-says-trump-on-coronavirus-pandemic/article31411726.ece", "urlToImage": "https://www.thehindu.com/news/international/q5sii4/article31411725.ece/ALTERNATES/LANDSCAPE_615/HEALTH-CORONAVIRUSUSA", "publishedAt": "2020-04-23T02:59:57Z", "content": "Struggling to restore normalcy in the U.S. where COVID-19 has claimed the lives of more than 47,000 people and infected over 8,52,000, President Donald Trump has said that the the country was attacked.\r\nWe were attacked. This was an attack. This wasnt just th… [+2738 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Maharashtra govt to CBI, ED: Take custody of Wadhawans - Times of India", "description": "India Business News: State home minister Anil Deshmukh said on Wednesday that the government has written to the Central Bureau of Investigations (CBI) and the Enforcement", "url": "https://timesofindia.indiatimes.com/business/india-business/maharashtra-govt-to-cbi-ed-take-custody-of-wadhawans/articleshow/75308499.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75308548,width-1070,height-580,imgsize-94454,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-04-23T02:21:58Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "marca", "name": "Marca"}, "author": "Jon Prada, Adapted by Billy Munday", "title": "Newcastle prepare to revolutionise the Premier League... if they're allowed - MARCA.com", "description": "Newcastle United are subject of a takeover bid from investors including PCP Capital Partners, who receive financial backing from the Public Investment...", "url": "https://www.marca.com/en/football/international-football/2020/04/22/5ea0aedf46163fc9be8b45f1.html", "urlToImage": "https://e00-marca.uecdn.es/assets/multimedia/imagenes/2020/04/22/15875547274517.jpg", "publishedAt": "2020-04-22T21:04:00Z", "content": "20 richest owners in the Premier League: Newcastle jump up the list\r\nNewcastle United are subject of a takeover bid from investors including PCP Capital Partners, who receive financial backing from the Public Investment Fund of Saudi Arabia, with the deal val… [+4490 chars]"}, {"source": {"id": null, "name": "Dailytrust.com.ng"}, "author": null, "title": "What we know about COVID-19 and sex for now - FG - Daily Trust", "description": "The Federal Government has said that there are no scientific prove that the novel COVID-19 virus infection is sexually transmissible.", "url": "https://www.dailytrust.com.ng/what-we-know-about-covid-19-and-sex-for-now-fg.html", "urlToImage": "https://cdn.dailytrust.com.ng/wp-content/uploads/2019/10/sexual-intercourse-of-a-couple-in.jpg", "publishedAt": "2020-04-22T19:08:57Z", "content": "The Federal Government has said that there are no scientific prove that the novel COVID-19 virus infection is sexually transmissible.\r\nThe National Coordinator of the Presidential Task Force (PTF) on COVID-19, Dr. Sani Aliyu, said this on Wednesday in Abuja a… [+1944 chars]"}, {"source": {"id": null, "name": "Wave3.com"}, "author": "", "title": "Dermatologist: ‘COVID toes’ a potential symptom of the new coronavirus - WAVE 3", "description": "A dermatologist is looking at a link between an inflammatory reaction of the toes and COVID-19.", "url": "https://www.wave3.com/2020/04/22/dermatologist-covid-toes-potential-symptom-new-coronavirus/", "urlToImage": "https://www.wave3.com/resizer/YL_244ylWLKio_BvU-YJspnSUyA=/1200x0/arc-anglerfish-arc2-prod-raycom.s3.amazonaws.com/public/KU6Z7JM4NBDJHEGYK5HFUP64JE.jpg", "publishedAt": "2020-04-22T16:37:00Z", "content": "EVANSTON, Ill. (Gray News) - A dermatologist is looking at a link between an inflammatory reaction of the toes and COVID-19.\r\nPaller is calling for more testing on the condition so doctors can learn more about the link between the potential symptom and COVID-… [+548 chars]"}]}