{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "PUBG Mobile Lite 0.17.0 Beta update: Payload mode, Falcon and more incoming - Hindustan Times", "description": "You can install it on your Android and Apple devices both to test it", "url": "https://www.hindustantimes.com/tech/pubg-mobile-lite-0-17-0-beta-update-payload-mode-falcon-and-more-incoming/story-ptP78mKcP6vfGtoTpe5D8I.html", "urlToImage": null, "publishedAt": "2020-04-25T17:15:12Z", "content": "For PUBG Mobile Lite users, Tencent has started rolling out the 0.17.0 Beta update. This update brings in the much-awaited Payload mode to the game along with some new features. \r\nThe most noticeable change that the latest update brings in is the Payload mode… [+1080 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘Since then I stay away from coffee,’ Hardik Pandya opens up on the ‘Koffee with Karan’ controversy - Hindustan Times", "description": "Hardik said on a lighter note that one cup of coffee proved very costly for him, referring to his controversial remark on TV show ‘Koffee With Karan’, which created a furore.", "url": "https://www.hindustantimes.com/cricket/since-then-i-stay-away-from-coffee-hardik-pandya-opens-up-on-the-koffee-with-karan-controversy/story-IBXLQ15vwDdElLh6IlC5hM.html", "urlToImage": null, "publishedAt": "2020-04-25T16:55:00Z", "content": "India all-rounder Hardik Pandya opened up for the first time on the Koffee With Karan episode that almost pushed his and teammate KL Rahul’s professional cricketing career on the brink. \r\nDuring an Instagram chat with Dinesh Karthik, Hardik also said on a lig… [+1207 chars]"}, {"source": {"id": null, "name": "Ddinews.gov.in"}, "author": null, "title": "NASA develops new ventilator tailored specifically to treat COVID-19 patients - Doordarshan", "description": "DDNews, News, National News, Indian News, Sports News", "url": "http://www.ddinews.gov.in/international/nasa-develops-new-ventilator-tailored-specifically-treat-covid-19-patients", "urlToImage": null, "publishedAt": "2020-04-25T16:21:00Z", "content": "NASA engineers have developed a new, easy-to-build high-pressure ventilator tailored specifically to treat COVID-19 patients. The US space agency said that the device, called VITAL (Ventilator Intervention Technology Accessible Locally), passed a critical tes… [+481 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Don’t worry, the new Apple iPhone SE’s A13 Bionic chipset is as powerful as the one in iPhone 11 - Hindustan Times", "description": "Although some reports mentioned that Apple iPhone SE (2020) scored lower than iPhone 11 (with the same A13 Bionic processor) in Antutu benchmarks, Prosser says that it is because of the low RAM capacity in SE.", "url": "https://www.hindustantimes.com/tech/don-t-worry-the-new-apple-iphone-se-s-a13-bionic-chipset-is-as-powerful-as-the-one-in-iphone-11/story-AzE3cT6RvHL9SGpBHSJN2K.html", "urlToImage": null, "publishedAt": "2020-04-25T16:18:25Z", "content": "Rubbishing the recent reports of Apple underclocking its A13 Bionic processor in iPhone SE (2020), tipster Jon Prosser says that the chipset is as powerful as the one used in the iPhone 11 series. Although some reports mentioned that Apple iPhone SE (2020) sc… [+1643 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Prashant Mahesh", "title": "6 FOFs from Franklin Templeton see NAVs dip as debt funds are wound up - Economic Times", "description": "The NAV of Franklin India Dynamic Asset Allocation FOFs (fell 16.6%), Franklin India Multi-Asset Solution (fell 22.42%), Franklin India Life Stage FOFs-20 (fell 6.59%), Franklin India Life Stage FOFs-30 (13.51%), Franklin India Life Stage FOFs-40 ( fell 17.81…", "url": "https://economictimes.indiatimes.com/mf/mf-news/6-fofs-from-franklin-templeton-see-navs-dip-as-debt-funds-are-wound-up/articleshow/75382011.cms", "urlToImage": null, "publishedAt": "2020-04-25T16:12:00Z", "content": "MUMBAI: The NAV of as many six fund of fund (FoFs) from Franklin Templeton India mutual fund fell by as much as 22.42% in a single day due to the winding up of six debt schemes at the fund house. A fund of funds (FOF) is an investment strategy of holding a po… [+1548 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "J. Jagannath", "title": "With record 811 fresh Covid-19 cases, Maharashtra's tally surges to 7,628 - Livemint", "description": "The state's death toll reached 323; Mumbai accounts for 4,870 of the over 7,600 cases", "url": "https://www.livemint.com/news/india/with-record-811-fresh-covid-19-cases-maharashtra-s-count-surges-to-7-628-11587828096783.html", "urlToImage": null, "publishedAt": "2020-04-25T15:24:52Z", "content": "New Delhi: Maharashtra on Saturday reported 811 new confirmed Covid-19 cases, a single-day record for the state.The total number of positive cases in the state are now 7,628 and the death toll rose by 22 to reach 323, a Health department statement said. With … [+1288 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Covid-19: Government guidelines on ACs, coolers and fans - Times of India", "description": "India Business News: Accoding to the guidelines compiled by the Indian Society of Heating Refrigerating and Air Conditioner Engineers (ISHRAE), a temperature between 24-30", "url": "https://timesofindia.indiatimes.com/business/india-business/covid-19-government-guidelines-on-acs-coolers-and-fans/articleshow/75371703.cms", "urlToImage": null, "publishedAt": "2020-04-25T15:16:23Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘Political virus’: Mamata’s TMC’s latest attack on Central teams visiting Bengal - Hindustan Times", "description": "Central teams have alleged non-cooperation by the state government in conduct of their assignment", "url": "https://www.hindustantimes.com/india-news/political-virus-mamata-s-tmc-s-latest-attack-on-central-teams-visiting-bengal/story-WEH2x39rX7MFX4e9zTTmIK.html", "urlToImage": null, "publishedAt": "2020-04-25T15:15:54Z", "content": "Mamata Banerjee’s Trinamool Congress party has accused the two Central teams visiting the state of West Bengal of spreading a “political virus” in the name of assessing the coronavirus containment efforts on the ground. This is the latest in the continuing wa… [+2584 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Followed my heroes Vivian Richards and MS Dhoni: Kapil Dev on his lockdown look - India Today", "description": "Kapil Dev, who was known for his curls during his playing days, has always been open to trying new looks. The lockdown period in the country has given the legendary all-rounder the time to experiment with his looks.", "url": "https://www.indiatoday.in/sports/cricket/story/followed-my-heroes-vivian-richards-and-ms-dhoni-kapil-dev-on-his-lockdown-look-1671071-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T15:09:12Z", "content": "Former India captain and World Cup-winner Kapil Dev has revealed that his new lockdown look has been inspired by Vivian Richards and MS Dhoni. Kapil Dev said that he had seen MS Dhoni sporting bald look after 2011 World Cup and had thought that he will also d… [+1312 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Lockdown, Day 32: Some good news - Economic Times", "description": "The plasma therapy has shown hope in treating Covid-19 patients. The plasma therapy trials in Delhi have been encouraging, said the Delhi health minister. Other states have also shown interest in the therapy and are waiting for further directions from Centre.", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/lockdown-day-32-some-good-news/articleshow/75377595.cms", "urlToImage": null, "publishedAt": "2020-04-25T14:47:00Z", "content": "India recorded the lowest daily growth rate since the country crossed 100 positive cases last month. Another good news came in the form of further lockdown relaxation announced late last night by the central government in the form of opening of shops with cer… [+2782 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Senegal's $1 COVID-19 test kit and the race for a vaccine | Counting the Cost - Al Jazeera English", "description": "What should take 10-15 years, the global scientific community hopes to cram into months. The World Health Organization (WHO) says there are 70 vaccines in th...", "url": "https://www.youtube.com/watch?v=tqKBNQzEROc", "urlToImage": null, "publishedAt": "2020-04-25T14:28:39Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Agence France-Presse", "title": "Boeing scraps $4.2 billion deal to buy Embraer commercial division - Hindustan Times", "description": "The companies had planned to form a joint venture in which Boeing would take an 80 percent stake in that division. The deal had been due to be finalized no later than Friday.", "url": "https://www.hindustantimes.com/world-news/boeing-scraps-4-2-billion-deal-to-buy-embraer-commercial-division/story-VHPO8d73sxwN46DPwnQ73L.html", "urlToImage": null, "publishedAt": "2020-04-25T14:19:31Z", "content": "Boeing announced Saturday it was pulling out of a $4.2 billion deal to acquire the commercial plane division of its Brazilian rival Embraer.\r\nThe companies had planned to form a joint venture in which Boeing would take an 80 percent stake in that division. Th… [+705 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "I was clueless on Test debut, thought had played my last game: Sachin Tendulkar - Times of India", "description": "Cricket News: In his first Test in 1989, Sachin Tendulkar was up against a Pakistan pace attack of Imran Khan, Wasim Akram & Waqar Younis. Recalling the outing, he", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/i-was-clueless-on-test-debut-thought-had-played-my-last-game-sachin-tendulkar/articleshow/75378166.cms", "urlToImage": null, "publishedAt": "2020-04-25T14:04:29Z", "content": "LONDON: Sachin Tendulkar says he was \"clueless\" on his Test debut and almost cried thinking it was all over for him.\r\nWhen he walked out for the last time 24 years later, Tendulkar would do so as a batting great with a record 200 Test appearances to his name.… [+2404 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "PTI", "title": "India Records Lowest Daily Growth Rate in Covid-19 Infections in 24 Hours Since Crossing 100 Cases, Says ... - News18", "description": "The Group of Ministers that met on Saturday was informed that the current death rate in India is 3.1% while the recovery rate is more than 20%, which is comparatively better than most countries.", "url": "https://www.news18.com/news/india/india-records-lowest-daily-growth-rate-in-covid-19-cases-on-saturday-since-it-crossed-100-cases-2592481.html", "urlToImage": null, "publishedAt": "2020-04-25T13:38:00Z", "content": "New Delhi: The average doubling rate of COVID-19 cases in the country is 9.1 days as of now and from Friday 8am to Saturday 8am, India recorded a 6% growth in new cases, which is the lowest daily growth rate recorded since the country crossed 100 cases, the g… [+4454 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Sutirtho Patranobis", "title": "China checks on Kim Jong-un’s ill health, sends a team to North Korea - Hindustan Times", "description": "The delegation is led by a senior member of the Communist Party of China’s (CPC) international liaison department and left Beijing for Pyongyang on Thursday, a report said on Saturday.", "url": "https://www.hindustantimes.com/world-news/china-sends-team-to-north-korea-amid-reports-of-kim-jong-un-s-ill-health/story-k5oEoVbIrH7ySFxiwF5yOM.html", "urlToImage": null, "publishedAt": "2020-04-25T13:35:00Z", "content": "Chief ally China has sent a team including doctors to North Korea to check on its leader Kim Jong-un following reports last week that said the 36-year-old was critically ill.\r\nThe delegation is led by a senior member of the Communist Party of China’s (CPC) in… [+1815 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "twinklekhanna", "title": "When Janhvi Kapoor and Khushi Kapoor’s offbeat yet stylish looks stole the show on the red carpet - PINKVILLA", "description": "Janhvi Kapoor and Khushi Kapoor have always rocked the red carpet with their style. In a throwback photo, both Janhvi and Khushi prove why they are the style icons of Gen-Y. Check it out.", "url": "https://www.pinkvilla.com/entertainment/news/when-janhvi-kapoor-and-khushi-kapoor-s-offbeat-yet-stylish-looks-stole-show-red-carpet-527471", "urlToImage": null, "publishedAt": "2020-04-25T13:05:39Z", "content": null}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Key nose cells identified as entry points for corona: Study - Telangana Today", "description": "London: Researchers have discovered that goblet and ciliated cells in the nose have high levels of the entry proteins that the COVID-19 coronavirus uses to get into our cells. The identification of these cells could help explain the high transmission rate of …", "url": "https://telanganatoday.com/key-nose-cells-identified-as-entry-points-for-corona-study", "urlToImage": null, "publishedAt": "2020-04-25T12:43:00Z", "content": "London: Researchers have discovered that goblet and ciliated cells in the nose have high levels of the entry proteins that the COVID-19 coronavirus uses to get into our cells. The identification of these cells could help explain the high transmission rate of … [+2503 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Covid-19 update: Coronavirus cases rise to 24,942 in India, 779 deaths recorded - Hindustan Times", "description": "Maharashtra continues to be the state with the maximum number of coronavirus cases in the country.", "url": "https://www.hindustantimes.com/india-news/covid-19-update-coronavirus-cases-rise-to-24-942-in-india-779-deaths-recorded/story-5zEiGEQ7mclOzQajybfPKN.html", "urlToImage": null, "publishedAt": "2020-04-25T12:41:18Z", "content": "The Ministry of Health on Saturday evening updated the total number of coronavirus cases in the country to 24,942. The figure includes 18,953 active cases, 5,209 patients who have been cured or discharged and 779 fatalities. \r\nWith this, the country’s coronav… [+1903 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Rohit KVN", "title": "WhatsApp increases group video call users' limit; is this enough to shun Zoom? - Deccan Herald", "description": "Last week, we reported Facebook-owned WhatsApp testing video group chat with the option to include more people, from the existing limit fo four. Now, the company has formally announced it will soon be releasing an update to the messenger app. WhatsApp messeng…", "url": "https://www.deccanherald.com/specials/whatsapp-increases-group-video-call-users-limit-is-this-enough-to-shun-zoom-829797.html", "urlToImage": null, "publishedAt": "2020-04-25T12:29:54Z", "content": "Last week, we reported Facebook-owned WhatsApp testing video group chat with the option to include more people, from the existing limit fo four. Now, the company has formally announced it will soon be releasing an update to the messenger app.\r\nWhatsApp messen… [+1314 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Uday Bhatia", "title": "Film review: ‘Extraction’ on Netflix is a joyless slab of action cinema - Livemint", "description": "Chris Hemsworth lays waste to Dhaka in order to save an Indian drug lord’s kidnapped son in this Netflix film written by Joe Russo", "url": "https://www.livemint.com/mint-lounge/features/film-review-extraction-on-netflix-is-a-joyless-slab-of-action-cinema-11587817372674.html", "urlToImage": null, "publishedAt": "2020-04-25T12:29:38Z", "content": "Sometimes the smallest detail can trip up your experience of a movie. Forty minutes into Extraction, Tyler (Chris Hemsworth) and Ovi (Rudhraksh Jaiswal) are dodging gunmen in a Dhaka building. They break into an apartment, and the famous intro to Didi Tera De… [+3823 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "IANS", "title": "Suriya’s ‘Soorarai Pottru’ could be banned, if Jyothika’s ‘Pon Magal Vandhal’ releases directly on OTT - The Hindu", "description": "Tamil Nadu Theatre And Multiplex Owners’ Association respond to expected release of Jyothika’s film on Amazon Prime next month", "url": "https://www.thehindu.com/entertainment/movies/suriyas-soorarai-pottru-could-be-banned-if-jyothikas-pon-magal-vandhal-releases-directly-on-ott/article31432944.ece", "urlToImage": null, "publishedAt": "2020-04-25T12:25:03Z", "content": "The Tamil Nadu Theatre And Multiplex Owners Association have threatened to ban films starring Suriya, as well as the films produced by his production company 2D films. The decision comes after the news that the film Pon Magal Vandhal, produced by Suriya and s… [+1831 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "Coronavirus | India records lowest daily growth rate in COVID-19 cases - The Hindu", "description": "“The average doubling rate of the country is 9.1 days as of now,” the ministry said.", "url": "https://www.thehindu.com/news/national/statement-issued-by-union-health-ministry-during-high-level-group-of-ministers-gom-on-covid-19/article31432452.ece", "urlToImage": null, "publishedAt": "2020-04-25T11:25:04Z", "content": "The average doubling rate of COVID-19 cases in the country is 9.1 days as of now and from Friday 8 am to Saturday 8 am, India recorded a six-per cent growth in new cases, which is the lowest daily growth rate recorded since the country crossed 100 cases, the … [+4599 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "India and Pakistan ease coronavirus lockdown restrictions - Al Jazeera English", "description": "India allows limited reopening of retail shops while Pakistan permits some industrial and commercial activities.", "url": "https://www.aljazeera.com/news/2020/04/india-pakistan-ease-coronavirus-lockdown-restrictions-200425072609484.html", "urlToImage": null, "publishedAt": "2020-04-25T11:02:04Z", "content": "India has allowed a limited reopening of shops in neighbourhoods and residential areas, a month after the nation went into lockdown to curb the spread of the coronavirus, officials said.\r\nThe federal home ministry announced on Friday that retail shops could s… [+3035 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Akshay Tritiya 2020: Jewellers giving discounts to lure customers on digital purchase - here are some offers - Moneycontrol", "description": "Experts see gold prices touching Rs 53,000-55000 per 10 gram by next Akshay Tritiya.", "url": "https://www.moneycontrol.com/news/business/akshay-tritiya-2020-jewellers-giving-discounts-to-lure-customers-on-digital-purchase-here-are-some-offers-5189151.html", "urlToImage": null, "publishedAt": "2020-04-25T10:31:13Z", "content": "This year though the traditional form of buying physical gold jewellery or coins on Akshay Tritiya is no longer an avenue for people where they can to go and shop due to current national lockdown imposed due to coronavirus outbreak.\r\nKumar Jain, Vice Presiden… [+5612 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Cosmic Reef: NASA release an image of a blazing starbirth to mark Hubble's 30th birthday - Firstpost", "description": "Hubble has been placed in space to observe the most distant stars and galaxies, as well as planets in our solar system.", "url": "https://www.firstpost.com/tech/science/cosmic-reef-nasa-release-an-image-of-a-blazing-starbirth-to-mark-hubbles-30th-birthday-8299671.html", "urlToImage": null, "publishedAt": "2020-04-25T10:23:08Z", "content": "FP TrendingApr 25, 2020 16:24:11 IST\r\nThe US space agency has released a new bright picture of a firestorm of starbirth to mark the 30th anniversary of the Hubble Space Telescope. Scientists have called the picture Cosmic Reef, as it resembles a coral reef fl… [+1921 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Times Now Digital", "title": "China arm twists EU to drop COVID-19 disinformation criticism, accuses it of trying to please ‘someone else’ - Times Now", "description": "China forced the European Union to drop references of its disinformation campaign around COVID-19 from its report saying it would make Beijing \"very angry\".", "url": "https://www.timesnownews.com/international/article/china-arm-twists-eu-to-drop-covid-19-disinformation-criticism-accuses-it-of-trying-to-please-someone-else/582889", "urlToImage": null, "publishedAt": "2020-04-25T09:57:53Z", "content": "<ul><li>'If the report is as described and it is released today it will be very bad for cooperation'</li><li>'China has continued to run a global disinformation campaign to deflect blame for the outbreak of the pandemic and improve its international image. Bo… [+2367 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AFP", "title": "Saudi Arabia abolishes the punishment of flogging - Livemint", "description": "Court-ordered floggings in Saudi Arabia have long drawn condemnation from human rights groups.The Saudi supreme court said the latest reform was intended to 'bring the kingdom into line with international human rights norms against corporal punishment'", "url": "https://www.livemint.com/news/world/saudi-arabia-abolishes-the-punishment-of-flogging-11587807404372.html", "urlToImage": null, "publishedAt": "2020-04-25T09:43:36Z", "content": "Saudi Arabia has abolished flogging as a punishment, the supreme court announced, hailing the latest in a series of \"human rights advances\" made by the king and his powerful son.Court-ordered floggings in Saudi Arabia -- sometimes extending to hundreds of las… [+2262 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus lockdown: RWAs await clarity on MHA guidelines that allow shops to remain open - Moneycontrol", "description": "The shops will have to function with 50 percent worker strength and masks and social distancing will be mandatory", "url": "https://www.moneycontrol.com/news/business/real-estate/coronavirus-lockdown-rwas-await-clarity-on-mha-guidelines-that-allow-shops-to-remain-open-5189001.html", "urlToImage": null, "publishedAt": "2020-04-25T09:19:01Z", "content": "Resident welfare associations are still awaiting clarity on the Ministry of Home Affairs (MHA) guidelines on April 24 that has allowed all shops registered under the Shops and Establishment Act of respective states and union territories (UTs), including shops… [+3149 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Wasim Jaffer Reveals the First Thing He Will Do Once the Lockdown is Lifted in India - News18", "description": "The former Indian cricketer took to Twitter and asked fans and followers to list the first thing they would do after the lockdown restrictions were lifted from the country.", "url": "https://www.news18.com/news/buzz/wasim-jaffer-reveals-the-first-thing-he-will-do-once-the-lockdown-is-lifted-in-india-2592255.html", "urlToImage": null, "publishedAt": "2020-04-25T08:54:15Z", "content": "Former India cricketer Wasim Jaffer has revealed the first thing he would do once the nationwide lockdown is lifted amid the coronavirus outbreak.\r\nJaffer said he will take his family out for dinner once the lockdown ends on May 3. After that, he will bat in … [+2086 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "World Malaria Day 2020: WHO tells nations not to compromise on efforts to battle disease during COVID-19... - Firstpost", "description": "WHO says that every year the world witnesses more than 200 million new cases of malaria", "url": "https://www.firstpost.com/health/world-malaria-day-2020-who-tells-nations-not-to-compromise-on-efforts-to-battle-disease-during-covid-19-pandemic-says-67-deaths-among-kids-under-5-8299361.html", "urlToImage": null, "publishedAt": "2020-04-25T08:16:18Z", "content": null}, {"source": {"id": null, "name": "91mobiles.com"}, "author": null, "title": "LG Velvet specifications leak out ahead of May 7th launch - 91mobiles", "description": "LG Velvet key specifications including processor, cameras and battery details have leaked out ahead of the May 7th launch event.", "url": "https://www.91mobiles.com/hub/lg-velvet-specifications-leak-processor-camera-may-7-launch/", "urlToImage": null, "publishedAt": "2020-04-25T04:41:15Z", "content": "LG Velvet specifications will include the Snapdragon 765 5G processor \r\nLG Velvet specifications have appeared online ahead of the smartphone’s launch on May 7th. The upcoming phone from LG has been turning some heads thanks to its unique design language, esp… [+1673 chars]"}, {"source": {"id": null, "name": "Gulte.com"}, "author": null, "title": "Mahesh-Rajamouli: A dream come true with hard realities! - Gulte", "description": "It sounds super enticing and a dream-come-true to many fans of Mahesh Babu when Rajamouli himself ma", "url": "https://www.gulte.com/movienews/1894/mahesh-rajamouli-a-dream-come-true-with-hard-realities", "urlToImage": null, "publishedAt": "2020-04-25T04:05:33Z", "content": "It sounds super enticing and a dream-come-true to many fans of Mahesh Babu when Rajamouli himself made it official about him directing the superstar in his next. It might give goosebumps when fans foresee the combination’s capability in the collections and in… [+2095 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Neetu Chandra Sharma", "title": "Coronavirus infection curve flattens, all eyes now on fiscal stimulus package - Livemint", "description": "Government calls the month-long nationwide lockdown to halt covid’s spread a ‘timely decision’, says doubling rate of cases has reduced to 10 days", "url": "https://www.livemint.com/news/india/infection-curve-flattens-all-eyes-now-on-fiscal-stimulus-package-11587754986630.html", "urlToImage": null, "publishedAt": "2020-04-24T19:11:33Z", "content": "NEW DELHI :\r\nCalling the month-long nationwide lockdown a timely decision\", the government on Friday said the covid-19 curve in India has begun to flatten with the doubling rate of cases reducing from 3.3 days at the outset of the crisis to 10 days now.The st… [+3889 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "NASA wants people to watch historic SpaceX launch from home - India TV News", "description": "Amid COVID-19 restrictions, the historic SpaceX mission to launch two NASA astronauts to the International Space Station (ISS) on May 27 is set to be a much quieter affair than it would have been", "url": "https://www.indiatvnews.com/science/nasa-spacex-launch-watch-from-home-coronavirus-611013", "urlToImage": null, "publishedAt": "2020-04-24T17:26:12Z", "content": "Image Source : AP (FILE)NASA wants people to watch historic SpaceX launch from home\r\nAmid COVID-19 restrictions, the historic SpaceX mission to launch two NASA astronauts to the International Space Station (ISS) on May 27 is set to be a much quieter affair th… [+2148 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Reuters", "title": "The mega Jio-Facebook deal might have Paytm quaking in its UPI boots - Livemint", "description": "The deal will give WhatsApp an inside track on payments for Reliance's retail unit, aimed at tens of millions of small shops across India.Compared to other major players in India's digital payments markets, Paytm is already on backfoot amid competition from A…", "url": "https://www.livemint.com/companies/news/the-mega-jio-facebook-deal-might-have-paytm-quaking-in-its-upi-boots-11587728958399.html", "urlToImage": null, "publishedAt": "2020-04-24T16:25:54Z", "content": "NEW DELHI/MUMBAI: Facebook's $5.7 billion investment in Reliance promises to be the biggest headache yet for Paytm, a SoftBank-backed pioneer in India's digital payments market but which has been losing ground to rivals with deeper pockets.Facebook's WhatsApp… [+4422 chars]"}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "First-ever digital geological map of moon released by US Geological Survey - Down To Earth Magazine", "description": "It will serve as a blue print for future human lunar missions", "url": "https://www.downtoearth.org.in/news/science-technology/first-ever-digital-geological-map-of-moon-released-by-us-geological-survey-70690", "urlToImage": null, "publishedAt": "2020-04-24T15:59:01Z", "content": "The first ever digital, unified, global, geological map of the moon was released virtually by the  United States Geological Survey (USGS), National Aeronautics and Space Administration (Nasa) and the Lunar Planetary Institute on April 22, 2020.\r\nThe map is a … [+2958 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "Covid-19 crisis: Fight against malaria could be set back 20 years, warns WHO - Livemint", "description": "The WHO said new projections indicate that in a worst-case scenario, 769,000 people could die of malaria in sub-Saharan Africa this year.There have already been 'severe disruptions' to anti-malaria campaigns and access to anti-malaria medication in Africa, WH…", "url": "https://www.livemint.com/news/world/covid-19-crisis-fight-against-malaria-could-be-set-back-20-years-warns-who-11587729475109.html", "urlToImage": null, "publishedAt": "2020-04-24T12:13:20Z", "content": "Cape Town: One of the hard lessons the World Health Organization learned during the Ebola outbreak in West Africa was this: Other diseases can be forgotten and take a deadlier toll.The WHO is now warning that the battle against malaria in sub-Saharan Africa, … [+3100 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Times Now Digital", "title": "Without lockdown there would have been estimated 1 lakh Covid-19 cases; 9.45 lakh under surveillance: Govt - Times Now", "description": "In its daily briefing on Covid-19, Chairman of Empowered Group-1 said the lockdown successfully changed the growth trajectory of Covid-19 transmission in India", "url": "https://www.timesnownews.com/india/article/without-lockdown-there-would-be-1-lakh-cases-in-india-by-now-9-45-lakh-under-surveillance-govt/582589", "urlToImage": null, "publishedAt": "2020-04-24T12:04:00Z", "content": "<ul><li>Overall cases at 23,077 after 1,684 new infections discovered in the last 24 hours</li><li>Decision of lockdown was timely, curve has begun to flatten: Chairman, Empowered Group-1</li><li>Recovery rate of Covid-19 patients in India at 20.57% hugely po… [+4777 chars]"}]}