{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Indianexpress.com"}, "author": "Deeptiman Tiwary", "title": "Centre revises Centre’s guidelines, states left scrambling to catch up - The Indian Express", "description": "A month ago, on March 24, when the Centre announced the first phase of the lockdown, states were left to manage its sudden consequences such as the massive disruption in supply chain, and migrant labour walking hundreds of miles to their homes.", "url": "https://indianexpress.com/article/india/centre-revises-centres-guidelines-states-left-scrambling-to-catch-up-coronavirus-lockdown-6379328/", "urlToImage": null, "publishedAt": "2020-04-25T23:36:57Z", "content": "A sample for coronavirus amid a nationwide lockdown, in Old Delhi.LATE FRIDAY night, as the Centre issued orders allowing shops and markets in rural areas and stand-alone shops in urban areas to open for sale of even non-essential items for the first time sin… [+8875 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Covid-19: India cases cross 26,000 with another big spike in Maharashtra - Times of India", "description": "India News: Maharashtra accounted for nearly half of Saturday’s national Covid-19 count, which at 1,715 was the second-highest recorded for a single day so far, 3", "url": "https://timesofindia.indiatimes.com/india/covid-19-india-cases-cross-26000-with-another-big-spike-in-maharashtra/articleshow/75384598.cms", "urlToImage": null, "publishedAt": "2020-04-25T22:40:34Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "George", "title": "iPhone SE works with iPhone 8's camera swapped in, new teardown shows - GSMArena.com news - GSMArena.com", "description": "Good news if you happen to break your SE's cam on the bathroom counter and conveniently have an 8 lying around?", "url": "https://www.gsmarena.com/iphone_se_works_with_iphone_8s_camera_swapped_in_new_teardown_shows-news-42874.php", "urlToImage": null, "publishedAt": "2020-04-25T19:50:01Z", "content": "The iPhone SE of 2020 is a resurrected iPhone 8, that's self-evident. But what are the implications of that fact in terms of reusing the old model for spare parts? We had one teardown of the SE from yesterday, but a new one we have here is helpful in a differ… [+1557 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NASA Builds COVID-19 Ventilator - Newsy", "description": "The agency built a high-pressure ventilator prototype tailored to COVID-19 patients in just 37 days. Learn more about this story at https://www.newsy.com/100...", "url": "https://www.youtube.com/watch?v=G2-M7aIe04o", "urlToImage": null, "publishedAt": "2020-04-25T18:56:27Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Here’s a thermal camera that measures temp, detects social distancing violations - Hindustan Times", "description": "The camera may be used at entrances to events, airports, metro stations, manufacturing plants, buildings, hotels, commercial complexes, shopping malls, and gated societies during the Covid-19 spread.", "url": "https://www.hindustantimes.com/tech/here-s-a-thermal-camera-that-measures-temp-detects-social-distancing-violations/story-U3vWY7YlQqNpHhES6xy0jI.html", "urlToImage": null, "publishedAt": "2020-04-25T18:29:59Z", "content": "Until now, there were thermal cameras that helped measure the body temperature of people and determine if they have Covid-19 symptoms or not. Now, Vehant Technologies has developed a thermal camera named FebriEye that not just measures the body temperature bu… [+1673 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Global Coronavirus Death Toll Crosses 2 Lakh, Positive Cases to Soon Touch 30 Lakh: Report - News18", "description": "The United States had reported more than 52,400 deaths as of Saturday morning, while Italy, Spain and France have reported between 22,000-26,000 fatalities each.", "url": "https://www.news18.com/news/world/global-coronavirus-death-toll-hits-200000-positive-cases-to-touch-3-million-soon-report-2592839.html", "urlToImage": null, "publishedAt": "2020-04-25T18:24:43Z", "content": "Global deaths linked to the coronavirus passed 2,00,000 on Saturday, while confirmed cases are expected to hit three million (or 30 lakh) in the coming days, according to a Reuters tally.\r\nMore than half of the fatalities have been reported in the United Stat… [+1565 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Shishir Gupta", "title": "‘Special flights, hospital beds’: Centre preps to fly back Indians stranded abroad - Hindustan Times", "description": "Prime Minister Narendra Modi has been holding discussions with senior ministers and officials on the modalities of bringing the stranded Indians back home, people familiar with the developments told Hindustan Times.", "url": "https://www.hindustantimes.com/india-news/special-flights-hospital-beds-centre-preps-to-fly-back-indians-stranded-abroad/story-G4r4rZGNGgT4RyN3GqOA4K.html", "urlToImage": null, "publishedAt": "2020-04-25T17:11:22Z", "content": "The Centre on Friday started making preparations to run scores of special flights early next month to bring thousands of Indians stranded abroad due to the cancellation of international flights from 22 March.\r\nFor nearly a week, Prime Minister Narendra Modi h… [+3859 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Manish Shukla", "title": "Amid coronavirus COVID-19 lockdown, Korean Embassy serves free meal to more than 4,000 people in Delhi - Zee News", "description": "In partnership with Annamrita Foundation, India’s non-profit organization, the Ambassador Shin Bong-Kil and other staff members of the Embassy on Friday served hot meals and handed out fresh bread.", "url": "https://zeenews.india.com/india/amid-coronavirus-covid-19-lockdown-korean-embassy-serves-free-meal-to-more-than-4000-people-in-delhi-2278988.html", "urlToImage": null, "publishedAt": "2020-04-25T16:51:30Z", "content": "In a bid to join Indias nationwide effort in tackling coronavirus COVID-19, the Embassy of the Republic of Korea provided free mid-day meals for more than 4,000 people in Delhi.\r\nIn partnership with Annamrita Foundation, Indias non-profit organization, the Am… [+719 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "World Malaria Day: Alertness essential for Malaria-endemic regions in COVID-19 era - Times of India", "description": "While the world is battling this deadly disease coronavirus, we should not lose focus on control of another deadly", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/world-malaria-day-alertness-essential-for-malaria-endemic-regions-in-covid-19-era/articleshow/75353454.cms", "urlToImage": null, "publishedAt": "2020-04-25T16:29:54Z", "content": "According to WHO, Malaria endemic countries in all WHO regions have reported cases of the Coronavirus. While the world is battling this deadly disease coronavirus, we should not lose focus on control of another deadly disease viz. Malaria. In 2018, there were… [+4625 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bangalore Mirror", "title": "Karnataka reports 26 new positive COVID-19 cases, total tally touches 500 - Bangalore Mirror", "description": "According to a mid-day bulletin released by the state government on Saturday, 15 news positive COVID-19 cases have been reported in Karnataka. The total number of cases in the state now stands at 489", "url": "https://bangaloremirror.indiatimes.com/bangalore/others/karnataka-reports-15-new-positive-covid-19-cases-state-health-ministry-initiates-plasma-therapy-trial-at-victoria-hospital/articleshow/75372377.cms", "urlToImage": null, "publishedAt": "2020-04-25T16:22:43Z", "content": "According to a bulletin released by the state government on Saturday, 26 news positive COVID-19\r\n cases have been reported in Karnataka\r\n. The total number of cases in the state now stands at 500 including 18 deaths and 158 discharges.\r\nOut of these new cases… [+1281 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Prashant Mahesh", "title": "6 FOFs from Franklin Templeton see NAVs dip as debt funds are wound up - Economic Times", "description": "The NAV of Franklin India Dynamic Asset Allocation FOFs (fell 16.6%), Franklin India Multi-Asset Solution (fell 22.42%), Franklin India Life Stage FOFs-20 (fell 6.59%), Franklin India Life Stage FOFs-30 (13.51%), Franklin India Life Stage FOFs-40 ( fell 17.81…", "url": "https://economictimes.indiatimes.com/mf/mf-news/6-fofs-from-franklin-templeton-see-navs-dip-as-debt-funds-are-wound-up/articleshow/75382011.cms", "urlToImage": null, "publishedAt": "2020-04-25T16:12:00Z", "content": "MUMBAI: The NAV of as many six fund of fund (FoFs) from Franklin Templeton India mutual fund fell by as much as 22.42% in a single day due to the winding up of six debt schemes at the fund house. A fund of funds (FOF) is an investment strategy of holding a po… [+1548 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Brokerage firm moves Delhi high court against MCX - Hindustan Times", "description": "MCX, which initially announced a provisional settlement price of Re 1 for its contract that ended on April 20, later calculated a price of minus Rs 2,884 per barrel, exposing brokers to a potential loss of Rs 435 crore.", "url": "https://www.hindustantimes.com/business-news/brokerage-firm-moves-delhi-high-court-against-mcx/story-AXkklID45tUdcVhij2JYiP.html", "urlToImage": null, "publishedAt": "2020-04-25T15:57:11Z", "content": "A broker member of MCX, country’s largest exchange for commodity derivatives, moved the Delhi high court against the manner in which the April crude oil contract was settled by the bourse. \r\nPrrsaar Commodities (P) Ltd moved the court in the interest of its i… [+1142 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Saudi Arabia abolishes flogging as punishment - Al Jazeera English", "description": "Saudi Supreme Court says decision is part of reforms pushed by King Salman and his son Crown Prince Mohammed.", "url": "https://www.aljazeera.com/news/2020/04/saudi-arabia-abolishes-flogging-punishment-supreme-court-200425103319396.html", "urlToImage": null, "publishedAt": "2020-04-25T15:19:54Z", "content": "Saudi Arabia has abolished flogging as a form of punishment, the country's supreme court has announced.\r\nThe court said on Saturday that the \"human rights advances\" are part of reforms pushed by King Salman Bin Abdul Aziz and his son, the kingdom's de facto r… [+2775 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Delhi govt to implement MHA order on opening of shops - Moneycontrol", "description": "A Delhi government official said that non-essential shops will be allowed to open, but not in coronavirus containment zones.", "url": "https://www.moneycontrol.com/news/india/delhi-govt-to-implement-mha-order-on-opening-of-shops-5189791.html", "urlToImage": null, "publishedAt": "2020-04-25T15:18:11Z", "content": "The Delhi government on Saturday decided to implement the Centre's latest guidelines on opening of shops, officials said. A Delhi government official said that non-essential shops will be allowed to open, but not in coronavirus containment zones.\r\n\"No activit… [+716 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Followed my heroes Vivian Richards and MS Dhoni: Kapil Dev on his lockdown look - India Today", "description": "Kapil Dev, who was known for his curls during his playing days, has always been open to trying new looks. The lockdown period in the country has given the legendary all-rounder the time to experiment with his looks.", "url": "https://www.indiatoday.in/sports/cricket/story/followed-my-heroes-vivian-richards-and-ms-dhoni-kapil-dev-on-his-lockdown-look-1671071-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T15:09:12Z", "content": "Former India captain and World Cup-winner Kapil Dev has revealed that his new lockdown look has been inspired by Vivian Richards and MS Dhoni. Kapil Dev said that he had seen MS Dhoni sporting bald look after 2011 World Cup and had thought that he will also d… [+1312 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Yashwant Raj", "title": "US states lift Covid-19 restrictions, Donald Trump defends walks back disinfectant remarks - Hindustan Times", "description": "The Trump White House continued Friday to deal with the outrage triggered by President Donald Trump’s suggestion to use household disinfectants to kill the virus inside human bodies as it does outside on surfaces.", "url": "https://www.hindustantimes.com/world-news/us-states-lift-covid-19-restrictions-donald-trump-defends-walks-back-disinfectant-remarks/story-93p6tMfvJJvpAMNXtdoaGM.html", "urlToImage": null, "publishedAt": "2020-04-25T15:07:41Z", "content": "Three US states have allowed some businesses to reopen under the watchful eye of the rest of the country and other governors weigh options as the coronavirus epidemic crossed another grime milestone with fatalities going past the 50,000 mark and infections in… [+2611 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Coronavirus Oubtreak: Lockdown rules will not change in Maharashtra till 3 May, says state health... - Firstpost", "description": "", "url": "https://www.firstpost.com/health/coronavirus-oubtreak-lockdown-rules-will-not-change-in-maharashtra-till-3-may-says-state-health-minister-rajesh-tope-8300281.html", "urlToImage": null, "publishedAt": "2020-04-25T14:35:43Z", "content": null}, {"source": {"id": null, "name": "Arabnews.com"}, "author": "AFP", "title": "'No evidence' people with coronavirus are immunized: WHO - Arabnews", "description": "GENEVA: The World Health Organization (WHO) warned on Saturday that there is no evidence that people who test positive for the new coronavirus are immunized and protected against reinfection. The warning suggests that the issuance of “immune passports” may pr…", "url": "https://www.arabnews.com/node/1664881", "urlToImage": null, "publishedAt": "2020-04-25T14:10:32Z", "content": "GENEVA: The World Health Organization (WHO) warned on Saturday that there is no evidence that people who test positive for the new coronavirus are immunized and protected against reinfection.The warning suggests that the issuance of immune passports may promo… [+2029 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "You can now use Apple Music on your Samsung Smart TVs - Hindustan Times", "description": "If you have a Samsung Smart TV model between 2018 and 2020, you can stream Apple Music on it", "url": "https://www.hindustantimes.com/tech/you-can-now-use-apple-music-on-your-samsung-smart-tvs/story-DqBenQxwj8BJeMrWSgLGJM.html", "urlToImage": null, "publishedAt": "2020-04-25T13:26:00Z", "content": "Samsung has become the first TV manufacturer to get the Apple Music app on its platform. If you own one of their smart TVs, bought between 2018 and 2020, you will get the Apple Music app for free and you can start streaming music on it. Samsung has said that … [+1199 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "twinklekhanna", "title": "When Janhvi Kapoor and Khushi Kapoor’s offbeat yet stylish looks stole the show on the red carpet - PINKVILLA", "description": "Janhvi Kapoor and Khushi Kapoor have always rocked the red carpet with their style. In a throwback photo, both Janhvi and Khushi prove why they are the style icons of Gen-Y. Check it out.", "url": "https://www.pinkvilla.com/entertainment/news/when-janhvi-kapoor-and-khushi-kapoor-s-offbeat-yet-stylish-looks-stole-show-red-carpet-527471", "urlToImage": null, "publishedAt": "2020-04-25T13:05:39Z", "content": null}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Joel Kurian", "title": "Ramayans Sita posts pic with Ramanand Sagar, netizens notice the photobombers - Republic World - Republic World", "description": "Amid 'Ramayan's record-breaking re-run, Dipika Chikhalia posted a pic with Ramanand Sagar, Arun Govil. Netizens observed Sita's 'dewars' in the background", "url": "https://www.republicworld.com/entertainment-news/television-news/ramayan-dipika-chihalia-sita-ram-arun-govil-pics-ramanand-sagar-episod.html", "urlToImage": null, "publishedAt": "2020-04-25T13:05:11Z", "content": "The re-run of Ramayan has not just freshened the memories of that era for those who watched the serial then, but also introduced the current generation to the religious text. That is evident in the manner in which the show has broken records to become the mos… [+3083 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Too early to talk about playing 5 Tests in Australia: BCCI official - Hindustan Times", "description": "A BCCI official said that a decision on that can be taken at the right time and any planning at this stage would be too early in the wake of the pandemic.", "url": "https://www.hindustantimes.com/cricket/too-early-to-talk-about-playing-5-tests-in-australia-bcci-official/story-7EezwXRXeWtEuIBD0F6cpN.html", "urlToImage": null, "publishedAt": "2020-04-25T12:58:55Z", "content": "The outbreak of the coronavirus has seen the Australian government seal the international boundaries till September 30. But Cricket Australia is not only keen to conduct the T20 World Cup in October, but also have India travel Down Under for the bilateral ser… [+1881 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Anuja", "title": "Consider ₹1 trillion wage protection package for MSMEs: Sonia Gandhi to Modi - Livemint", "description": "In a letter to the prime minister, Gandhi listed five suggestions, including the financial package.The party's 11 member consultative committee had discussed the issue earlier this week", "url": "https://www.livemint.com/news/india/consider-rs-1-trillion-wage-protection-package-for-msmes-sonia-gandhi-to-modi-11587818100950.html", "urlToImage": null, "publishedAt": "2020-04-25T12:51:12Z", "content": "NEW DELHI: Congress president Sonia Gandhi on Saturday urged Prime Minister Narendra Modi to announce a 1 trillion wage protection package for micro, small and medium enterprises (MSME) as the sector needs immediate attention.In a letter to the prime minister… [+1413 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Giant asteroid to pass close to Earth next week - Tamil News - IndiaGlitz.com", "description": "An asteroid which was first spotted in 1998, called 52768 (1998 OR2), is expected to zip past Earth next week", "url": "https://www.indiaglitz.com/massive-asteroid-1998-or2-to-fly-by-earth-next-week-april-29-will-not-collide-with-planet-potentially-hazardous-tamil-news-258947", "urlToImage": null, "publishedAt": "2020-04-25T12:39:43Z", "content": "An asteroid which was first spotted in 1998, called 52768 (1998 OR2), is expected to zip past Earth next week. However, it is not expected to collide with our planet, as per reports.\r\nThe asteroid will reportedly pass within 3908791 miles of Earth, moving at … [+2750 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "IANS", "title": "Suriya’s ‘Soorarai Pottru’ could be banned, if Jyothika’s ‘Pon Magal Vandhal’ releases directly on OTT - The Hindu", "description": "Tamil Nadu Theatre And Multiplex Owners’ Association respond to expected release of Jyothika’s film on Amazon Prime next month", "url": "https://www.thehindu.com/entertainment/movies/suriyas-soorarai-pottru-could-be-banned-if-jyothikas-pon-magal-vandhal-releases-directly-on-ott/article31432944.ece", "urlToImage": null, "publishedAt": "2020-04-25T12:25:03Z", "content": "The Tamil Nadu Theatre And Multiplex Owners Association have threatened to ban films starring Suriya, as well as the films produced by his production company 2D films. The decision comes after the news that the film Pon Magal Vandhal, produced by Suriya and s… [+1831 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "‘Didn’t want people to say Silver Sindhu,’ Talk of final phobia propelled PV Sindhu to World Championship... - Hindustan Times", "description": "Sindhu, who had already won two silver and two bronze medals at the event, defeated her nemesis Nozomi Okuhara 21-7 21-7 in the summit clash that lasted just 38 minutes on August 26 last year.", "url": "https://www.hindustantimes.com/other-sports/didn-t-want-people-to-say-silver-sindhu-talk-of-final-phobia-propelled-pv-sindhu-to-world-championship-glory/story-9daLENyFdFsDbf4qp35ELI.html", "urlToImage": null, "publishedAt": "2020-04-25T11:59:43Z", "content": "Ace shuttler PV Sindhu, who had created history by becoming the first Indian to win gold medal at the World Championships last year, has revealed that she didnt want people to call her “silver Sindhu” and thats why she was desperate to clinch the top honours … [+1477 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Plasma therapy trials for coronavirus patients begin in Karnataka - Deccan Herald", "description": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.", "url": "https://www.deccanherald.com/state/top-karnataka-stories/plasma-therapy-trials-for-coronavirus-patients-begin-in-karnataka-829772.html", "urlToImage": null, "publishedAt": "2020-04-25T11:00:06Z", "content": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.\r\nFollow latest updates on the COVID-19 pandemic here\r\nIn a tweet, Medical Education Minister K Sudhakar said, \"Happy to … [+1295 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Cosmic Reef: NASA release an image of a blazing starbirth to mark Hubble's 30th birthday - Firstpost", "description": "Hubble has been placed in space to observe the most distant stars and galaxies, as well as planets in our solar system.", "url": "https://www.firstpost.com/tech/science/cosmic-reef-nasa-release-an-image-of-a-blazing-starbirth-to-mark-hubbles-30th-birthday-8299671.html", "urlToImage": null, "publishedAt": "2020-04-25T10:23:08Z", "content": "FP TrendingApr 25, 2020 16:24:11 IST\r\nThe US space agency has released a new bright picture of a firestorm of starbirth to mark the 30th anniversary of the Hubble Space Telescope. Scientists have called the picture Cosmic Reef, as it resembles a coral reef fl… [+1921 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Bloomberg", "title": "You may catch coronavirus more than once, says WHO - Livemint", "description": "'There is currently no evidence that people who have recovered from Covid-19 and have antibodies are protected from a second infection,' says WHO.The WHO guidance came after some governments suggested that people who have antibodies to the coronavirus could b…", "url": "https://www.livemint.com/news/world/you-may-catch-coronavirus-more-than-once-says-who-11587806764276.html", "urlToImage": null, "publishedAt": "2020-04-25T09:34:08Z", "content": "Catching Covid-19 once may not protect you from getting it again, according to the World Health Organization.There is currently no evidence that people who have recovered from Covid-19 and have antibodies are protected from a second infection,\" the United Nat… [+914 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Wasim Jaffer Reveals the First Thing He Will Do Once the Lockdown is Lifted in India - News18", "description": "The former Indian cricketer took to Twitter and asked fans and followers to list the first thing they would do after the lockdown restrictions were lifted from the country.", "url": "https://www.news18.com/news/buzz/wasim-jaffer-reveals-the-first-thing-he-will-do-once-the-lockdown-is-lifted-in-india-2592255.html", "urlToImage": null, "publishedAt": "2020-04-25T08:54:15Z", "content": "Former India cricketer Wasim Jaffer has revealed the first thing he would do once the nationwide lockdown is lifted amid the coronavirus outbreak.\r\nJaffer said he will take his family out for dinner once the lockdown ends on May 3. After that, he will bat in … [+2086 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "World Malaria Day 2020: WHO tells nations not to compromise on efforts to battle disease during COVID-19... - Firstpost", "description": "WHO says that every year the world witnesses more than 200 million new cases of malaria", "url": "https://www.firstpost.com/health/world-malaria-day-2020-who-tells-nations-not-to-compromise-on-efforts-to-battle-disease-during-covid-19-pandemic-says-67-deaths-among-kids-under-5-8299361.html", "urlToImage": null, "publishedAt": "2020-04-25T08:16:18Z", "content": null}, {"source": {"id": null, "name": "91mobiles.com"}, "author": null, "title": "LG Velvet specifications leak out ahead of May 7th launch - 91mobiles", "description": "LG Velvet key specifications including processor, cameras and battery details have leaked out ahead of the May 7th launch event.", "url": "https://www.91mobiles.com/hub/lg-velvet-specifications-leak-processor-camera-may-7-launch/", "urlToImage": null, "publishedAt": "2020-04-25T04:41:15Z", "content": "LG Velvet specifications will include the Snapdragon 765 5G processor \r\nLG Velvet specifications have appeared online ahead of the smartphone’s launch on May 7th. The upcoming phone from LG has been turning some heads thanks to its unique design language, esp… [+1673 chars]"}, {"source": {"id": null, "name": "Tribuneindia.com"}, "author": "Tribune India", "title": "Covid-19: Death toll mounts to 775 - The Tribune India", "description": "The total count has increased to over 24500 across the country", "url": "https://www.tribuneindia.com/news/nation/covid-19-death-toll-mounts-to-775-govt-says-stage-3-prevented-75726", "urlToImage": null, "publishedAt": "2020-04-25T04:11:25Z", "content": "New Delhi, April 25\r\nThe total number of coronavirus cases in India reached 24,506 on Saturday, including foreign nationals, with 18,668 active cases, while the death toll has increased to 775, the Union Health Ministry said.\r\nThe Health Ministry said in its … [+1974 chars]"}, {"source": {"id": null, "name": "Gulte.com"}, "author": null, "title": "Mahesh-Rajamouli: A dream come true with hard realities! - Gulte", "description": "It sounds super enticing and a dream-come-true to many fans of Mahesh Babu when Rajamouli himself ma", "url": "https://www.gulte.com/movienews/1894/mahesh-rajamouli-a-dream-come-true-with-hard-realities", "urlToImage": null, "publishedAt": "2020-04-25T04:05:33Z", "content": "It sounds super enticing and a dream-come-true to many fans of Mahesh Babu when Rajamouli himself made it official about him directing the superstar in his next. It might give goosebumps when fans foresee the combination’s capability in the collections and in… [+2095 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Slideshow | Top 10 stocks which moved the most this week - Moneycontrol.com", "description": "Experts foresee a sharp sell-off in the coming sessions if Nifty breaks 13-day EMA. Positional traders can consider shorting the index below 9,045 levels and look for bigger targets.", "url": "https://www.moneycontrol.com/news/business/stocks/slideshow-top-10-stocks-which-moved-the-most-this-week-5187801.html", "urlToImage": null, "publishedAt": "2020-04-25T02:36:00Z", "content": "TV18 Broadcast, up 18% | TV18 Broadcast, a subsidiary of Network18, has registered a 373.33 percent year-on-year growth (YoY) in Q4FY20 consolidated profit due to strong revenue and operating EBITDA. Profit for the quarter stood at Rs 142 crore, up from Rs 30… [+350 chars]"}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "First-ever digital geological map of moon released by US Geological Survey - Down To Earth Magazine", "description": "It will serve as a blue print for future human lunar missions", "url": "https://www.downtoearth.org.in/news/science-technology/first-ever-digital-geological-map-of-moon-released-by-us-geological-survey-70690", "urlToImage": null, "publishedAt": "2020-04-24T15:59:01Z", "content": "The first ever digital, unified, global, geological map of the moon was released virtually by the  United States Geological Survey (USGS), National Aeronautics and Space Administration (Nasa) and the Lunar Planetary Institute on April 22, 2020.\r\nThe map is a … [+2958 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Lockdown prevented 'US or Europe-like' situation in India but bigger challenge awaits: Experts - Economic Times", "description": "However, most of the experts also cautioned that a  bigger challenge  awaits the country when it gradually move towards exiting the nationwide lockdown, which has emerged as one of India's biggest weapons so far in the battle against COVID-19.", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/lockdown-prevented-us-or-europe-like-situation-in-india-but-bigger-challenge-awaits-experts/articleshow/75348474.cms", "urlToImage": null, "publishedAt": "2020-04-24T10:24:29Z", "content": "As India completes a month under lockdown that brought the world's most populous democracy to a virtual standstill, with no or very minimal social and economic activities to prevent the spread of COVID-19 pandemic, several medical experts feel that these rest… [+5963 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Bloomberg", "title": "Akshaya Tritiya: Jewelers focusing on online gold sales as stores remain closed - Livemint", "description": "Though the delivery of non-essential goods is not allowed by the government currently, jewelers are offering consumers the option of locking in their products on the day and taking them home on a later date", "url": "https://www.livemint.com/money/personal-finance/akshaya-tritiya-jewelers-focusing-on-online-gold-sales-as-stores-remain-closed-11587714764615.html", "urlToImage": null, "publishedAt": "2020-04-24T07:58:45Z", "content": "With staying-at-home becoming the new normal and most Indian jewelry stores shut due to a nationwide lockdown, Mamta Vinay Gokarn is facing a dilemma: how to get a hold of gold on the second-most auspicious day in the Hindu calendar to buy the metal.Purchases… [+3789 chars]"}]}