{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Thenewsopediaindia.co.in"}, "author": "rishixkumar00", "title": "Kim Jong Un ‘alive and well’: Seoul - The Newsopedia", "description": "North Korean leader Kim Jong Un is “alive and well”, a top security adviser to the South’s President Moon Jae-in said, downplaying rumours over Kim’s health following his absence", "url": "https://www.thenewsopediaindia.co.in/news/world/kim-jong-un-alive-and-well-seoul-world-news/", "urlToImage": null, "publishedAt": "2020-04-27T02:05:48Z", "content": "North Korean leader Kim Jong Un is alive and well, a top security adviser to the Souths President Moon Jae-in said, downplaying rumours over Kims health following his absence from a key anniversary.\r\nOur government position is firm, said Moons special adviser… [+2703 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Keto, Intermittent Fasting can help you lose weight and manage diabetes, say experts - Times of India", "description": "Researchers have claimed that certain diet plans can not only effectively manage weight problems but also prevent or treat diabetes to an extent.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/keto-intermittent-fasting-can-help-you-lose-weight-and-manage-diabetes-say-experts/photostory/75381445.cms", "urlToImage": null, "publishedAt": "2020-04-27T01:30:00Z", "content": "And now, new researchers have claimed that certain diet plans can not only effectively manage weight problems but also prevent or treat diabetes to an extent.\r\nWhile we do know that certain lifestyle diseases are a result of bad eating habits and low levels o… [+219 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Record-breaking hole in ozone layer over Arctic closed: EU sat - Times of India", "description": "India News: In a good news, European satellite system Copernicus has found that a record-breaking hole ever observed in the ozone layer over Arctic has closed.", "url": "https://timesofindia.indiatimes.com/india/record-breaking-hole-in-ozone-layer-over-arctic-closed-eu-sat/articleshow/75397575.cms", "urlToImage": null, "publishedAt": "2020-04-27T00:43:00Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayshree P Upadhyay and Gopika Gopakumar", "title": "Mutual funds scramble to keep lid on Franklin impact - Hindustan Times", "description": "So far, the Securities and Exchange Board of India (Sebi), RBI and the government have not said anything about the crisis in the mutual funds industry.", "url": "https://www.hindustantimes.com/business-news/mutual-funds-scramble-to-keep-lid-on-franklin-impact/story-h6cEIVvgVQv7llHeGE5M4H.html", "urlToImage": null, "publishedAt": "2020-04-27T00:33:03Z", "content": "Mutual funds (MFs) are worried that the collapse of six debt schemes of Franklin Templeton India will set off a redemptions crisis in the nation’s asset management industry.\r\nAsset managers are marking down bad investments and seeking bank loans, and a liquid… [+4203 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Beijing's aggressive South China Sea push amid pandemic worries India, US - Times of India", "description": "India News: Under cover of the coronavirus pandemic, China has ramped up its aggressive expansionism both in the South China Sea as well as raising concern not on", "url": "https://timesofindia.indiatimes.com/india/beijings-aggressive-south-china-sea-push-amid-pandemic-worries-india-us/articleshow/75393720.cms", "urlToImage": null, "publishedAt": "2020-04-27T00:15:06Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Pray that we can beat virus before Eid: PM - Times of India", "description": "India News: Asking people to observe Ramzan as a time of restraint, sensitivity and service, Prime Minister Narendra Modi expressed hope that the pandemic would h", "url": "https://timesofindia.indiatimes.com/india/pray-that-we-can-beat-virus-before-eid-pm/articleshow/75397022.cms", "urlToImage": null, "publishedAt": "2020-04-26T23:46:49Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "293 new Covid-19 cases take Delhi’s tally closer to 3,000 - Hindustan Times", "description": "A total of 877 people have recovered from Covid -19 so far in Delhi.", "url": "https://www.hindustantimes.com/india-news/293-new-covid-19-cases-take-delhi-s-tally-closer-to-3-000/story-W0juyariDN2PtsNZdvso1H.html", "urlToImage": null, "publishedAt": "2020-04-26T23:41:20Z", "content": "Delhi recorded 293 cases of Covid-19 on Sunday to take its tally to 2918, the state health department said in its bulletin.\r\nEight people recovered on Sunday to take the total recoveries to 877. The national capital now has 1,987 active cases while the total … [+1075 chars]"}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "Dileep V Kumar", "title": "Health department augments testing strategy to reach out to more people - The New Indian Express", "description": "While the fear of community transmission continues to hang in the air, Kerala has adopted testing as its mantra to combat Covid-19.", "url": "https://www.newindianexpress.com/cities/thiruvananthapuram/2020/apr/27/health-department-augments-testing-strategy-to-reach-out-to-more-people-2135705.html", "urlToImage": null, "publishedAt": "2020-04-26T22:24:00Z", "content": "THIRUVANANTHAPURAM: While the fear of community transmission continues to hang in the air, Kerala has adopted testing as its mantra to combat Covid-19. Shaping new strategies, the health department is now augmenting testing facilities to reach out to more peo… [+1986 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Saudi Arabia ends death penalty for minors and floggings - Times of India", "description": "Middle East News: The decision comes on the heels of another ordering judges to end the practice of flogging, replacing it with jail time, fines or community service an", "url": "https://timesofindia.indiatimes.com/world/middle-east/saudi-arabia-ends-death-penalty-for-minors-and-floggings/articleshow/75395581.cms", "urlToImage": null, "publishedAt": "2020-04-26T21:19:55Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Jayshree P. Upadhyay, Gopika Gopakumar", "title": "Mutual funds scramble to keep lid on Franklin impact, may ask for RBI’s help - Livemint", "description": "While a majority of fund houses say that the debt schemes are fairly liquid at this point but could get difficult in coming weeks if lockdown is not lifted.To meet the liquidity needs of mutual funds, RBI has allowed banks to avail of cheap funding under the …", "url": "https://www.livemint.com/mutual-fund/mf-news/mutual-funds-scramble-to-contain-franklin-impact-to-seek-rbi-s-intervention-11587900606693.html", "urlToImage": null, "publishedAt": "2020-04-26T20:20:18Z", "content": "Mumbai: Mutual funds (MFs) are worried that the collapse of six debt schemes of Franklin Templeton India will set off a redemptions crisis in the nations asset management industry.Asset managers are marking down bad investments, seeking bank loans and a liqui… [+5493 chars]"}, {"source": {"id": null, "name": "Nasaspaceflight.com"}, "author": null, "title": "UAE-built Mars orbiter arrives at launch site ahead of July liftoff - NASASpaceflight.com", "description": "An Emirati-built Mars explorer, named Al Amal (“Hope” in English) and developed by engineers at…", "url": "https://www.nasaspaceflight.com/2020/04/uae-mars-orbiter-arrives-launch-site/", "urlToImage": null, "publishedAt": "2020-04-26T19:17:36Z", "content": "An Emirati-built Mars explorer, named Al Amal (“Hope” in English) and developed by engineers at the Mohammed bin Rashed Space Centre, has been shipped to the JAXA-run Tanegashima Space Center for final checkouts and preparations ahead of its launch aboard an … [+7548 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Deepit Sharma", "title": "“Now, I’m Gonna Knock Him Out!”- Dominick Reyes Talks Jon Jones Rematch - Essentially Sports", "description": "Dominick Reyes is planning on coming back stronger than ever to beat Jon Jones after he lost out in the close toe-to-toe match they had in February.", "url": "https://www.essentiallysports.com/now-im-gonna-knock-him-out-dominick-reyes-talks-jon-jones-rematch-ufc-news/", "urlToImage": null, "publishedAt": "2020-04-26T19:04:00Z", "content": "Dominick Reyes shook the world when he went face-to-face with Jon “Bones” Jones. While the UFC Universe did expect Reyes to put on a spectacular show, nobody could have thought that he would give Jone Jones such a run for his money.\r\nThe two faced off in the … [+1828 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "Battered and bruised, global supply chain shifts to recover-and-survive mode - Economic Times", "description": "For cos in the U.S. and Europe, ultimately what may happen depends upon the availability of key supplies.", "url": "https://economictimes.indiatimes.com/news/international/business/battered-and-bruised-global-supply-chain-shifts-to-recover-and-survive-mode/articleshow/75395103.cms", "urlToImage": null, "publishedAt": "2020-04-26T18:07:00Z", "content": "When the timeline of the pandemic of 2020 is complete, March 24 will stand out as a day to remember for everyone from sports fans to anthropologists to cola drinkers.\r\nJapan postponed the Summer Olympics that day. India put 1.3 billion people under lockdown. … [+7828 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Sutirtho Patranobis", "title": "First pandemic epicentre Wuhan discharges its last Covid patient from hospital - Hindustan Times", "description": "The novel coronavirus is believed to have originated in a wet seafood and meat market in Wuhan before spreading across China and then globally.", "url": "https://www.hindustantimes.com/world-news/first-pandemic-epicentre-wuhan-discharges-its-last-covid-patient-from-hospital/story-xRNgzwDzdbdhIW7K3X87lO.html", "urlToImage": null, "publishedAt": "2020-04-26T16:19:22Z", "content": "The central Chinese city of Wuhan, the first Covid-19 pandemic epicentre where the virus emerged late last year, has no remaining cases in hospitals, China announced Sunday.\r\nThe novel coronavirus is believed to have originated in a wet seafood and meat marke… [+2849 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "Sachin Tendulkar picks his five favourite all-rounders in the... - The Cricket Times", "description": "Master Blaster Sachin Tendulkar, on Saturday, hand-picked his five favourite all-rounders in the world. Sachin, who recently celebrated his 47th birthday, graced Star Sports show ‘Cricket Connected’ with his presence. In that show, he named Kapil Dev as his f…", "url": "https://crickettimes.com/2020/04/sachin-tendulkar-picks-his-five-favourite-all-rounders-in-the-world/", "urlToImage": null, "publishedAt": "2020-04-26T15:49:58Z", "content": "Master Blaster Sachin Tendulkar, on Saturday, hand-picked his five favourite all-rounders in the world. Sachin, who recently celebrated his 47th birthday, graced Star Sports show Cricket Connected with his presence. In that show, he named Kapil Dev as his fav… [+1647 chars]"}, {"source": {"id": null, "name": "Thequint.com"}, "author": "The Quint", "title": "Biggest 1-Day Spike in COVID Cases, Vardhan Says Situation Better - The Quint", "description": "The number of coronavirus cases in the country rose to 26,917 on Sunday, with the tally including 20,177 active cases, 826 deaths, 5,913 cured or discharged patients and one migrated patient, according to the health ministry figures.", "url": "https://www.thequint.com/news/india/coronavirus-covid-19-latest-news-breaking-news-live-updates-26-april", "urlToImage": null, "publishedAt": "2020-04-26T15:33:45Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Hindustan Times", "title": "Raj and DK working on micro-series and films that will be shot indoors - Hindustan Times", "description": "Raj Nidimoru and Krishna DK of the Raj and DK director duo are producing two series and a film shot inside homes.", "url": "https://www.hindustantimes.com/bollywood/raj-and-dk-working-on-micro-series-and-films-that-will-be-shot-indoors/story-gXELo8YYMV7tT6WBs2v3FP.html", "urlToImage": null, "publishedAt": "2020-04-26T15:24:47Z", "content": "In order to encourage budding filmmakers during lockdown and to keep their creativity flowing, director duo Raj Nidimoru and Krishna DK, said they will mentor and back the new format of micro-storytelling. The duo already has two micro-series in the pipeline.… [+2319 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Tamal Nandi", "title": "Income tax department rejects IRS officers report on hiking tax for super-rich - Livemint", "description": "'It is unequivocally stated that CBDT never asked IRS Association or these officers to prepare such a report,' the income tax department said on Twitter", "url": "https://www.livemint.com/news/india/income-tax-department-rejects-irs-officers-report-on-hiking-tax-for-super-rich-11587913154224.html", "urlToImage": null, "publishedAt": "2020-04-26T15:09:42Z", "content": "The income tax department today rejected a report by a team of 50 young Indian Revenue Services (IRS) officers suggesting the government to hike income tax rates for super-rich and imposing a Covid-relief cess of 4% for those earning above 4 lakh.There is som… [+2520 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Instagram wants you to ‘Guess the Gibberish’, here’s how to get the story filter - Hindustan Times", "description": "The new filter on Instagram shows you a jumbled phrase that you have to guess what it is based on how the gibberish phrase sounds.", "url": "https://www.hindustantimes.com/tech/instagram-wants-you-to-guess-the-gibberish-during-lockdown-here-s-how-to-get-the-story-filter/story-bYOAnBERHEsBSbhxLvt9TN.html", "urlToImage": null, "publishedAt": "2020-04-26T15:02:07Z", "content": "If you are a frequent Instagram user, you must have come across stories from your friends with ‘Guess the Gibberish’ cards. For those who don’t know about it, it’s an Instagram Story filter that shows you a randomly generated strings of words for a few second… [+1429 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Neha", "title": "Hubble Space Telescope yields 1.4 mn observations in 3 decades - The Siasat Daily", "description": "Washington: The Hubble Space Telescope, which is now celebrating 30 years of stunning discoveries, has yielded 1.4 million observations and provided data that astronomers around the world have used to write more than 17,000 peer-reviewed scientific publicatio…", "url": "https://www.siasat.com/hubble-space-telescope-yields-1-4-mn-observations-3-decades-1880016/", "urlToImage": null, "publishedAt": "2020-04-26T14:00:33Z", "content": "Washington: The Hubble Space Telescope, which is now celebrating 30 years of stunning discoveries, has yielded 1.4 million observations and provided data that astronomers around the world have used to write more than 17,000 peer-reviewed scientific publicatio… [+2845 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "NASA develops low-cost ventilator to fight coronavirus - Northeast Now", "description": "NASA engineers have designed a new low-cost high-pressure ventilator tailored to treat coronavirus patients. The device, called VITAL (Ventilator Intervention Technology Accessible Locally), passed a critical test on April 21 at the Icahn School of Medicine a…", "url": "https://nenow.in/health/nasa-develops-low-cost-ventilator-to-fight-coronavirus.html/", "urlToImage": null, "publishedAt": "2020-04-26T13:42:22Z", "content": "NASA engineers have designed a new low-cost high-pressure ventilator tailored to treat coronavirus patients.\r\nThe device, called VITAL (Ventilator Intervention Technology Accessible Locally), passed a critical test on April 21 at the Icahn School of Medicine … [+1301 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Coronavirus Outbreak: Senior govt doctor dealing with COVID-19 cases, 34-year-old man die at Kolkata... - Firstpost", "description": "West Bengal has reported a total of 541 COVID-19 cases so far. Of them, 18 have succumbed to the disease, according to the state health department.", "url": "https://www.firstpost.com/health/coronavirus-outbreak-senior-govt-doctor-dealing-with-covid-19-cases-34-year-old-man-die-at-kolkata-hospital-8301921.html", "urlToImage": null, "publishedAt": "2020-04-26T13:03:59Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "‘Humein to pata hi nahi tha’: Shikhar Dhawan hilariously trolls Cheteshwar Pujara - Hindustan Times", "description": "With no cricket being played due to coronavirus pandemic, Pujara uploaded a picture of himself batting in the nets and his post read: “The thing I miss the most in this lockdown is being on the cricket field.”", "url": "https://www.hindustantimes.com/cricket/humein-to-pata-hi-nahi-tha-shikhar-dhawan-hilariously-trolls-cheteshwar-pujara/story-wdFBZqAL032Z76ORKpmeEP.html", "urlToImage": null, "publishedAt": "2020-04-26T12:29:28Z", "content": "India opener Shikhar Dhawan hilariously trolled Test specialist Cheteshwar Pujara after the latter shared a photograph of himself on social media recently.\r\nWith no cricket being played due to coronavirus pandemic, Pujara uploaded a picture of himself batting… [+989 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Apple's new iPhone SE: Can it get people to forget phone stores? - ZDNet", "description": "Chris Matyszczyk wonders if Apple's new, inexpensive phone is a success, what does that mean for traditional phone retail? Read more: https://zd.net/2xaW3mU ...", "url": "https://www.youtube.com/watch?v=WKggeuJduVE", "urlToImage": null, "publishedAt": "2020-04-26T12:05:24Z", "content": "Chris Matyszczyk wonders if Apple's new, inexpensive phone is a success, what does that mean for traditional phone retail? Read more: https://zd.net/2xaW3mU\r\nFOLLOW US - Subscribe to ZDNet on YouTube: http://bit.ly/2HzQmyf- Watch more ZDNet videos: http://zd.… [+320 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Omar Rashid", "title": "Every person I came in contact with tested negative, says singer Kanika Kapoor - The Hindu", "description": "In a statement issued on Sunday, she responded to allegations of not adhering to quarantine norms.", "url": "https://www.thehindu.com/entertainment/every-person-i-came-in-contact-with-tested-negative-says-singer-kanika-kapoor/article31437427.ece", "urlToImage": null, "publishedAt": "2020-04-26T11:44:57Z", "content": "Bollywood singer Kanika Kapoor on Sunday for the first time openly responded to allegations of not adhering to quarantine norms around the time she had returned from abroad and tested positive for COVID-19 last month.\r\n\"Every person that I have come in contac… [+1685 chars]"}, {"source": {"id": null, "name": "Weforum.org"}, "author": "Stephanie Nebehay", "title": "WHO warns COVID-19 patients could be infected again - World Economic Forum", "description": "The World Health Organization advises countries against issuing “immunity passports” or “risk-free certificates” to people who have been infected.", "url": "https://www.weforum.org/agenda/2020/04/no-evidence-that-recovered-covid-19-patients-cannot-be-reinfected-who/", "urlToImage": null, "publishedAt": "2020-04-26T11:38:09Z", "content": "<ul><li>People who have recovered from COVID-19 still need to take precautions to prevent re-infection</li><li>Some countries have handed out health passports to people who have recovered from the illness</li><li>There are now 2.9 million cases of coronavirus… [+1994 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jeran Wittenstein", "title": "Zoom’s good week ends on sour note after Facebook crashes party with Messenger Rooms - Hindustan Times", "description": "In a challenge to Zoom, Facebook said the goal of its new video platform, which will allow as many as 50 people per chat, was to offer users a more social and less corporate feel than what’s currently available.", "url": "https://www.hindustantimes.com/tech/zoom-s-good-week-ends-on-sour-note-after-facebook-crashes-party-with-messenger-rooms/story-OiWkL5QsdQzly2NvKOjzbP.html", "urlToImage": null, "publishedAt": "2020-04-26T11:18:03Z", "content": "In another winning week, shares in Zoom Video Communications Inc. ended on a sour note after Facebook Inc. disclosed plans for a competing video chat product called Messenger Rooms.\r\nMessenger Rooms is a new group video chat feature for which users can invite… [+2265 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express Web Desk", "title": "Coronavirus India LIVE Updates: Malls, market to stay shut in Delhi; Mumbai constable dies of virus - The Indian Express", "description": "Coronavirus (COVID-19) Tracker India Latest News Updates Highlights: As per the last update by the Health Ministry, the total number of cases climbed to 26,917, including 826 deaths.", "url": "https://indianexpress.com/article/india/coronavirus-cases-in-india-live-news-latest-updates-covid-19-tracker-total-corona-cases-in-india-and-global-6379356/", "urlToImage": null, "publishedAt": "2020-04-26T09:54:33Z", "content": "The Centre has issued orders allowing shops and markets in rural areas and stand-alone shops in urban areas to open for sale (Express Photo: Srinivas K)\r\nThe nationwide tally of coronavirus positive patients neared 25,000 on Saturday with fresh cases getting … [+3691 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Slideshow | Top companies by market cap last week; RIL biggest gainer - Moneycontrol.com", "description": "RIL, TCS, HDFC Bank, Infosys and Kotak Mahindra Bank witnessed a rise in their market capitalisation, while HUL, HDFC, Bharti Airtel, ITC and ICICI Bank finished last week with losses.", "url": "https://www.moneycontrol.com/news/business/markets/slideshow-top-companies-by-market-cap-last-week-ril-biggest-gainer-5190711.html", "urlToImage": null, "publishedAt": "2020-04-26T09:40:00Z", "content": "1. Reliance Industries | M-cap for the week ended April 24: Rs 8,98,499.89 crore crore | Gain during the week: Rs 1,21,904.63 crore (Disclaimer: Reliance Industries Ltd. is the sole beneficiary of Independent Media Trust which controls Network18 Media &amp; I… [+14 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu Net Desk", "title": "Coronavirus India lockdown Day 33 updates | April 26, 2020 - The Hindu", "description": "The death toll due to COVID-19 continued to rise on Sunday, with the country registering a total of 826 fatalities and 26,917 cases, according to the Union Health Ministry. While the death toll rose b", "url": "https://www.thehindu.com/news/national/india-coronavirus-lockdown-april-26-2020-live-updates/article31436416.ece", "urlToImage": null, "publishedAt": "2020-04-26T08:45:04Z", "content": "The death toll due to COVID-19 continued to rise on Sunday, with the country registering a total of 826 fatalities and 26,917 cases, according to the Union Health Ministry. While the death toll rose by 46, the number of cases spiked by 1,975 since Saturday ev… [+25580 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "IANS", "title": "Coronavirus: How a game of cards ended up infecting 38 people in Andhra Pradesh - Livemint", "description": "Feeling bored, the driver invited neighbours and friends for a game of cards while his wife invited womenfolk from nearby houses.The incident has been reported from Andhra Pradesh's Vijayawada city", "url": "https://www.livemint.com/news/india/coronavirus-update-how-a-game-of-cards-ended-up-infecting-38-people-in-andhra-pradesh-11587887543159.html", "urlToImage": null, "publishedAt": "2020-04-26T08:13:51Z", "content": "VIJAYAWADA :\r\nPlaying game of cards and hosting parties to kill time during the nationwide lockdown, two truck driver in Andhra Pradesh's Vijayawada city spread coronavirus to as many as 38 persons, officials said on Sunday.One of them infected 24 people whil… [+1329 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": null, "title": "Review | 'Extraction' Falls Back on the Only Weapon in Its Arsenal: Action - The Wire", "description": "Most of the action really well done, especially a seemingly single-take shot that lasts for 16 breathtaking minutes. But after a point, the Chris Hemsworth starrer becomes tedious due to unimaginative and formulaic writing.", "url": "https://thewire.in/film/review-extraction-chris-hemsworth-netflix", "urlToImage": null, "publishedAt": "2020-04-26T08:09:14Z", "content": "The new Netflix release Extraction has a story that can be distilled into a line: a young boy is kidnapped; a mercenary is sent out to rescue him.\r\nThat boy is Ovi Mahajan (Rudhraksh Jaiswal), the son of a jailed Indian drug lord (Pankaj Tripathi). The one-ma… [+3432 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "IANS", "title": "Donald Trump might appoint Indian-American Seema Verma as new health secretary - Livemint", "description": "If Seema Verma does get the job, she will be the second person of Indian descent to serve on the US federal cabinet after Nikki Haley.Verma has appeared at its news briefings with Trump several times - probably more often that Azar - raising her public profile", "url": "https://www.livemint.com/news/world/donald-trump-might-appoint-indian-american-seema-verma-as-new-health-secretary-11587883238338.html", "urlToImage": null, "publishedAt": "2020-04-26T07:12:31Z", "content": "NEW YORK :\r\nUS President Donald Trump may replace Health and Human Services secretary Alex Azar and Seema Verma, the head of government health insurance programmes, is one of those under consideration to succeed him, according to media reports.Quoting anonymo… [+3666 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Karan Johar realises mistake after watching sarcastic videos on celebs, Amitabh Bachchan gives ‘breaking... - Hindustan Times", "description": "Top entertainment news: Karan Johar has apologised for sharing ‘insensitive’ posts during coronavirus crisis while Amitabh Bachchan on Saturday declared on social media that a bat had entered his home in Mumbai.", "url": "https://www.hindustantimes.com/bollywood/karan-johar-realises-mistake-after-sarcastic-videos-on-celebs-amitabh-bachchan-gives-breaking-news-from-jalsa/story-aydICNSMdMWh6XsbPfwLRM.html", "urlToImage": null, "publishedAt": "2020-04-26T05:15:02Z", "content": "Amitabh Bachchan has a crisis at home in Covid-19 times, says ‘Breaking news, a bat just entered my home’\r\nActor Amitabh Bachchan, who has been putting out motivational posts through out the coronavirus pandemic, felt the crisis up close and personal on Satur… [+2147 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Sidharth Shekhar", "title": "India adopts new strategy on burial of terrorists in J&K; bodies won’t be handed to kin to stop mass gathering - Times Now", "description": "Pakistan-based terrorist organizations and Inter-Services Intelligence (ISI) have used mass gatherings to recruit terrorists.", "url": "https://www.timesnownews.com/india/article/india-adopts-new-strategy-on-burial-of-terrorists-in-jk-bodies-won-t-be-handed-to-kin-to-stop-mass-gathering/583079", "urlToImage": null, "publishedAt": "2020-04-26T04:14:11Z", "content": "<ul><li>Hundreds of people, defying lockdown, gathered at the funeral of JeM militant Sajad Nawab Dar who was killed in an encounter with security forces in the Sopore earlier this month</li><li>Pakistan-based terrorist organisations and ISI use mass gatherin… [+2507 chars]"}, {"source": {"id": null, "name": "Espn.co.uk"}, "author": "Adrian Wojnarowski", "title": "NBA reopening team practice facilities Friday where local restrictions eased, sources say - ESPN.co.uk", "description": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.", "url": "https://www.espn.co.uk/nba/story/_/id/29099194/nba-reopening-team-practice-facilities-friday-where-local-restrictions-eased-sources-say", "urlToImage": null, "publishedAt": "2020-04-25T23:09:06Z", "content": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.\r\nPlayers can return to team facilities in states such as … [+2131 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "There is a Feature to Improve User Privacy in the New Developer Version of Android 11 - Somag News", "description": "A developer has detected a new feature in the Android 11 3rd developer preview that has been released recently that will improve user privacy. In particular, together with Android, it can revoke some permissions for apps that have not been used for a while. T…", "url": "https://www.somagnews.com/feature-improve-user-privacy-new-developer-version-android-11/", "urlToImage": null, "publishedAt": "2020-04-25T18:58:00Z", "content": "A developer has detected a new feature in the Android 11 3rd developer preview that has been released recently that will improve user privacy. In particular, together with Android, it can revoke some permissions for apps that have not been used for a while.\r\n… [+2316 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Recovered COVID-19 patient Smriti Thakkar speaks to Mirror Now | EXCLUSIVE - Mirror Now", "description": "Meet Smriti Thakkar a braveheart who recovered from Coronavirus and now a plasma donor speaks exclusively to Mirror Now. She talks about her journey from ill...", "url": "https://www.youtube.com/watch?v=3zQgID-kiNY", "urlToImage": null, "publishedAt": "2020-04-25T16:07:07Z", "content": null}]}