{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Gaurav Gupta", "title": "IPL: Summer of discontent for young Indian cricketers - Times of India", "description": "Cricket News: Many young Indian cricketers were eager to sizzle in the IPL. However, the coronavirus outbreak and the all-India lockdown has postponed the glitzy ev", "url": "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/ipl-summer-of-discontent-for-young-indian-cricketers/articleshow/75398433.cms", "urlToImage": null, "publishedAt": "2020-04-27T04:39:24Z", "content": "Many young Indian cricketers were eager to sizzle in the IPL. However, the coronavirus outbreak and the all-India lockdown has postponed the glitzy event indefinitely.\r\nTOI spoke to four such talented 'wonderkids,' to find out how they're coping with it and k… [+6850 chars]"}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "SI Reporter", "title": "MARKET LIVE: Sensex gains 550 points, Nifty above 9,300; Mindtree jumps 7% - Business Standard", "description": "Catch all the live market updates here", "url": "https://www.business-standard.com/article/markets/market-live-sensex-nifty-bse-nse-sgx-nifty-covid-19-indusind-bank-120042700094_1.html", "urlToImage": null, "publishedAt": "2020-04-27T04:39:13Z", "content": "An across the board buying -- especially in index heavyweights Reliance Industries and HDFC -- drove the Indian markets higher, in line with the Asian indices, on Monday.The S&amp;P BSE Sensex jumped 690 points, or over 2 per cent, to 31,978. The Nifty50 inde… [+347 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Coronavirus Outbreak LIVE Updates: Narendra Modi to discuss COVID-19 situation with CMs shortly; Rajasthan records 2,221 cases with 44 deaths - Firstpost", "description": "Coronavirus Outbreak LIVE Updates: Prime Minister Narendra Modi will interact with chief ministers via video conference on Monday at 10 am on the way ahead in the fight against the coronavirus pandemic. Watch LIVE News, Latest Updates, Live blog, Highlights a…", "url": "https://www.firstpost.com/health/coronavirus-outbreak-live-updates-covid-19-pandemic-india-toll-narendra-modi-on-lockdown-maharashtra-mumbai-delhi-gujarat-madhya-pradesh-latest-news-today-8302031.html", "urlToImage": null, "publishedAt": "2020-04-27T04:38:28Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "As Beautiful as The Moon? This is The First Time we Get to See The Lunar Surface in Such Detail - 360TopNews", "description": "Scientists used information from six Apollo-era regional maps along with updated information from recent satellite missions to the moon. The missions include the including the Lunar Reconnaissance Orbiter and Japan’s SELENE.", "url": "https://www.news18.com/news/tech/as-beautiful-as-the-moon-this-is-the-first-time-we-get-to-see-the-lunar-surface-in-such-detail-2593939.html", "urlToImage": null, "publishedAt": "2020-04-27T04:36:30Z", "content": "We know the moon is beautiful. It has been referenced in many a love story, official or secretive. Its beauty has been mentioned in many musical pieces too. And when you do peer out of your window into the night sky, it really does look something else. Now, y… [+1736 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Digital Desk", "title": "Hubble telescope celebrates 30 years with portrait of a firestorm in a neighbouring galaxy - Republic World - Republic World", "description": "In the portrait, a giant red nebula and its smaller blue neighbour are part of a vast star-forming region in the Large Magellanic Cloud, a satellite galaxy", "url": "https://www.republicworld.com/technology-news/science/nasas-hubble-telescope-celebrates-30-years-with-a-portrait-of-a-fires.html", "urlToImage": null, "publishedAt": "2020-04-27T04:30:00Z", "content": "Hubble Space Telescope celebrated 30 years in space with a new portrait of a firestorm of a starbirth in a neighboring galaxy. The image is nicknamed the \"Cosmic Reef,\" because NGC 2014 resembles part of a coral reef floating in a vast sea of stars. While som… [+2298 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "North Korean leader Kim Jong Un 'alive and well': South Korea - Times of India", "description": "Rest of World News: North Korean leader Kim Jong Un is \"alive and well\", a top security adviser to the South's President Moon Jae-in said, downplaying rumours over Kim's", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/north-korean-leader-kim-jong-un-alive-and-well-south-korea/articleshow/75397995.cms", "urlToImage": null, "publishedAt": "2020-04-27T04:27:18Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Coronavirus latest updates: 1,396 cases & 48 deaths reported in last 24 hours in India - Times of India", "description": "India News: NEW DELHI: According to the latest update by the ministry of health and family welfare, 1,396 new cases and 48 deaths reported in the last 24 hours.", "url": "https://timesofindia.indiatimes.com/india/coronavirus-latest-updates-22-of-covid-19-patients-have-recovered-in-india/articleshow/75398899.cms", "urlToImage": null, "publishedAt": "2020-04-27T04:26:25Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Anonna Dutt", "title": "200 Tablighi Jamaat members, who have recovered, pledge to donate plasma - Hindustan Times", "description": "The plasma will be able to save critical Covid-19 patients, Kejriwal highlighted, citing an example of a Covid-19 patient in serious condition, who was administered the therapy and has improved in the last 24 hours.", "url": "https://www.hindustantimes.com/delhi-news/200-tablighi-jamaat-members-who-have-recovered-pledge-to-donate-plasma/story-uCGTmL5MvH5uNXRkDnCDOL.html", "urlToImage": null, "publishedAt": "2020-04-27T04:21:27Z", "content": "Over 200 members of the Tablighi Jamaat who have recovered from the Covid-19 infection have pledged to donate plasma to help those admitted to city hospitals with severe infections. Chief Minister Arvind Kejriwal on Sunday urged everyone who has recovered fro… [+3130 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "PM Modi to meet CMs: Discussion on lockdown lifting on May 3 likely - Moneycontrol", "description": "PTI reported that the a \"graded\" exit from the lockdown will be evaluated.", "url": "https://www.moneycontrol.com/news/india/pm-modi-to-meet-cms-discussion-on-lockdown-lifting-on-may-3-likely-5191721.html", "urlToImage": null, "publishedAt": "2020-04-27T04:18:44Z", "content": "Prime Minister Narendra Modi will meet chief ministers via a video conference on April 27 to discuss the further course of action to tackle the COVID-19 outbreak.\r\nThis will be the fourth interaction between PM Modi and the chief ministers since the COVID-19 … [+1911 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Telangana becomes 9th state with over 1000 cases, Delhi nears 3000-mark: Covid-19 state tally - Hindustan Times", "description": "Coronavirus cases in Maharashtra have crossed the 8,000-mark while in the national capital, the number of cases near 3,000.", "url": "https://www.hindustantimes.com/india-news/telangana-becomes-9th-state-with-over-1000-cases-delhi-nears-3000-mark-covid-19-state-tally/story-NIFM71hhWtY6vHWxBGWO0N.html", "urlToImage": null, "publishedAt": "2020-04-27T04:13:47Z", "content": "The number of coronavirus cases in the country rose to 27,892 on Monday. According to the latest figures updated by the Ministry of Health, there are 20,835 active coronavirus cases in the country, 6,184 patients have been cured or discharged while 872 people… [+4146 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Agencies", "title": "Over 54,000 Covid-19 deaths in hardest-hit US, number of cases near a million - Hindustan Times", "description": "A record 26.5 million Americans have filed for jobless benefits since mid-March due to coronavirus pandemic, and retail sales, homebuilding and consumer confidence have all cratered.", "url": "https://www.hindustantimes.com/world-news/over-54-000-covid-19-deaths-in-hardest-hit-us-number-of-cases-near-a-million/story-7yyz2FRmu0VfN6SMCVwE1L.html", "urlToImage": null, "publishedAt": "2020-04-27T04:09:13Z", "content": "The United States recorded 1,330 more Covid-19 related deaths in the past 24 hours, according to figures reported late on Sunday by the Johns Hopkins University.\r\nThe country now has an overall death toll of 54,841, with 9,64,937 confirmed infections, accordi… [+1904 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Coronavirus Outbreak: Number of cases rises to 26,917 as country records highest single-day spike; Modi... - Firstpost", "description": "Coronavirus Outbreak LIVE Updates: Prime Minister Narendra Modi will interact with chief ministers via video conference on Monday at 10 am on the way ahead in the fight against the coronavirus pandemic. Watch LIVE News, Latest Updates, Live blog, Highlights a…", "url": "https://www.firstpost.com/health/coronavirus-outbreak-live-updates-covid-19-pandemic-india-toll-narendra-modi-on-lockdown-maharashtra-mumbai-delhi-gujarat-madhya-pradesh-latest-news-today-8302031.html", "urlToImage": null, "publishedAt": "2020-04-27T02:43:03Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Nishanth Vasudevan and MC Govardhana Rangan", "title": "Sebi, RBI take stock of situation in fund mart post Franklin fiasco - Economic Times", "description": "Sebi has sought details from mutual funds on the extent of redemptions.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-rbi-take-stock-of-situation-in-fund-mart-post-franklin-fiasco/articleshow/75398000.cms", "urlToImage": null, "publishedAt": "2020-04-27T02:41:00Z", "content": "Mumbai: The capital markets regulator and Reserve Bank of India (RBI) swung into action over the weekend to assess the damage and contain the fallout from Franklin Templeton’s decision to close six debt funds.\r\nTo spur banks to lend more, the RBI may tweak ru… [+4796 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Keto, Intermittent Fasting can help you lose weight and manage diabetes, say experts - Times of India", "description": "Researchers have claimed that certain diet plans can not only effectively manage weight problems but also prevent or treat diabetes to an extent.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/keto-intermittent-fasting-can-help-you-lose-weight-and-manage-diabetes-say-experts/photostory/75381445.cms", "urlToImage": null, "publishedAt": "2020-04-27T01:30:00Z", "content": "And now, new researchers have claimed that certain diet plans can not only effectively manage weight problems but also prevent or treat diabetes to an extent.\r\nWhile we do know that certain lifestyle diseases are a result of bad eating habits and low levels o… [+219 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Record-breaking hole in ozone layer over Arctic closed: EU sat - Times of India", "description": "India News: In a good news, European satellite system Copernicus has found that a record-breaking hole ever observed in the ozone layer over Arctic has closed.", "url": "https://timesofindia.indiatimes.com/india/record-breaking-hole-in-ozone-layer-over-arctic-closed-eu-sat/articleshow/75397575.cms", "urlToImage": null, "publishedAt": "2020-04-27T00:43:00Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "​In big rejig, govt appoints secys to a dozen key depts - Times of India", "description": "India News: In a major top-deck reshuffle, the government on Sunday appointed nearly two dozen new secretaries, including those for economic affairs, petroleum, e", "url": "https://timesofindia.indiatimes.com/india/in-big-rejig-govt-appoints-secys-to-a-dozen-key-depts/articleshow/75397078.cms", "urlToImage": null, "publishedAt": "2020-04-26T23:46:52Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: How India will play a major role in a Covid-19 vaccine - BBC News", "description": "As one of the world's biggest vaccine makers, India could to play a big role in stopping the virus.", "url": "https://www.bbc.com/news/world-asia-india-52363791", "urlToImage": null, "publishedAt": "2020-04-26T23:14:23Z", "content": "Image caption\r\n Half a dozen Indian companies are developing vaccines for coronavirus\r\nUS Secretary of State Mike Pompeo said last fortnight that India and the US were working together to develop vaccines against the coronavirus. \r\nMr Pompeo's remark didn't e… [+4660 chars]"}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "Dileep V Kumar", "title": "Health department augments testing strategy to reach out to more people - The New Indian Express", "description": "While the fear of community transmission continues to hang in the air, Kerala has adopted testing as its mantra to combat Covid-19.", "url": "https://www.newindianexpress.com/cities/thiruvananthapuram/2020/apr/27/health-department-augments-testing-strategy-to-reach-out-to-more-people-2135705.html", "urlToImage": null, "publishedAt": "2020-04-26T22:24:00Z", "content": "THIRUVANANTHAPURAM: While the fear of community transmission continues to hang in the air, Kerala has adopted testing as its mantra to combat Covid-19. Shaping new strategies, the health department is now augmenting testing facilities to reach out to more peo… [+1986 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Mahalakshmi Murali", "title": "“I Am Very Pessimistic” – Rafael Nadal - Essentially Sports", "description": "Rafael Nadal has been confined in his residence in Mallorca, and he is not sure about the tennis tour returning to normalcy in the near future.", "url": "https://www.essentiallysports.com/tennis-news-atp-i-am-very-pessimistic-rafael-nadal/", "urlToImage": null, "publishedAt": "2020-04-26T20:18:00Z", "content": "19-time Grand Slam champion Rafael Nadal has been confined in his residence in Mallorca, Spain and he hasnt touched a tennis racquet since Indian Wells tournaments cancelation in March. Also, his nation, Spain is one of the worst-hit areas by the coronavirus … [+1778 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Vanessa Hand Orellana", "title": "2 Apple Watch features that earned the smartwatch a permanent spot on my wrist - CNET", "description": "I started out a skeptic, but the Apple Watch eventually won me over. Here's what it took for me to take it seriously as a fitness tracker and smartwatch.", "url": "https://www.cnet.com/news/apple-watch-features-earned-smartwatch-permanent-spot-wrist/", "urlToImage": null, "publishedAt": "2020-04-26T20:08:47Z", "content": "Angela Lang/CNET\r\nI haven't always been a fan of the Apple Watch. I bought one as soon as it went on sale in 2015 hoping it would blow me away, but it ended up spending more time in my drawer than on my wrist. It took three more years and the addition of two … [+8182 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Mrin Agarwal", "title": "Here's how to manage your debt funds post-Franklin Templeton crisis - Deccan Herald", "description": "As if there was already not enough going on in the markets to impact investor’s portfolios, Franklin Templeton decided to wind down six debt funds including ultra short term funds meant for parking short term monies, leading to investors panicking on all thei…", "url": "https://www.deccanherald.com/business/heres-how-to-manage-your-debt-funds-post-franklin-templeton-crisis-830260.html", "urlToImage": null, "publishedAt": "2020-04-26T16:44:01Z", "content": "As if there was already not enough going on in the markets to impact investors portfolios, Franklin Templeton decided to wind down six debt funds including ultra short term funds meant for parking short term monies, leading to investors panicking on all their… [+3580 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Tamal Nandi", "title": "Income tax department rejects IRS officers report on hiking tax for super-rich - Livemint", "description": "'It is unequivocally stated that CBDT never asked IRS Association or these officers to prepare such a report,' the income tax department said on Twitter", "url": "https://www.livemint.com/news/india/income-tax-department-rejects-irs-officers-report-on-hiking-tax-for-super-rich-11587913154224.html", "urlToImage": null, "publishedAt": "2020-04-26T15:09:42Z", "content": "The income tax department today rejected a report by a team of 50 young Indian Revenue Services (IRS) officers suggesting the government to hike income tax rates for super-rich and imposing a Covid-relief cess of 4% for those earning above 4 lakh.There is som… [+2520 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18.com", "title": "India Sees Record Surge in Coronavirus Infections Second Time in 3 Days as Case Count Nears 27,000 - News18", "description": "Health ministry data showed 1,975 new infections were reported in India in the last 24 hours. This is 223 cases more than the biggest 24-hour spike of 1,752 infections recorded on Friday.", "url": "https://www.news18.com/news/india/india-sees-record-surge-in-coronavirus-infections-twice-in-three-days-as-case-count-nears-27000-mark-2593669.html", "urlToImage": null, "publishedAt": "2020-04-26T15:06:00Z", "content": "New Delhi: For the second time in three days, the number of coronavirus cases in the country surged to a new daily record as 1,975 new infections were reported by the home ministry on Sunday. \r\nThis is 223 cases more than the biggest 24-hour spike of 1,752 in… [+3064 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Lockdown has made me more dedicated and taught me that we can survive without eating outside, Hima Das te - Times of India", "description": "More sports News: From crying after meeting idol Sachin Tendulkar to learning how to be more dedicated during the coronavirus lockdown, India's star sprinter Hima Das o", "url": "https://timesofindia.indiatimes.com/sports/more-sports/athletics/lockdown-has-made-me-more-dedicated-and-taught-me-that-we-can-survive-without-eating-outside-hima-das-tells-suresh-raina/articleshow/75391961.cms", "urlToImage": null, "publishedAt": "2020-04-26T14:31:03Z", "content": "NEW DELHI: From crying after meeting idol Sachin Tendulkar to learning how to be more dedicated during the coronavirus lockdown, India's star sprinter Hima Das opened up about her life in a candid chat with Indian cricketer Suresh Raina on Sunday.\r\nThe two In… [+3156 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "NASA develops low-cost ventilator to fight coronavirus - Northeast Now", "description": "NASA engineers have designed a new low-cost high-pressure ventilator tailored to treat coronavirus patients. The device, called VITAL (Ventilator Intervention Technology Accessible Locally), passed a critical test on April 21 at the Icahn School of Medicine a…", "url": "https://nenow.in/health/nasa-develops-low-cost-ventilator-to-fight-coronavirus.html/", "urlToImage": null, "publishedAt": "2020-04-26T13:42:22Z", "content": "NASA engineers have designed a new low-cost high-pressure ventilator tailored to treat coronavirus patients.\r\nThe device, called VITAL (Ventilator Intervention Technology Accessible Locally), passed a critical test on April 21 at the Icahn School of Medicine … [+1301 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Shilpa Shetty and Raj Kundra fight in Mahabharat style and son Viaan plays Narayan; watch hilarious video - Times of India", "description": "Super Dancer judge Shilpa Shetty's latest video will literally make you roll on the floor. The actress, along with", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/shilpa-shetty-and-raj-kundra-fight-in-mahabharat-style-and-son-viaan-plays-narayan-watch-hilarious-video/articleshow/75391787.cms", "urlToImage": null, "publishedAt": "2020-04-26T13:33:00Z", "content": null}, {"source": {"id": null, "name": "Ommcomnews.com"}, "author": "OMMCOM NEWS", "title": "'Asymptomatic Transmission Achilles' Heel Of COVID-19 Strategies' - Ommcom News", "description": "Calling for unprecedented measures to defeat COVID-19, researchers form University of California, San Francisco have said that asymptomatic transmission of SARS-CoV-2 has made controlling the spread of the disease all the more difficult.", "url": "https://www.ommcomnews.com/world-news/-asymptomatic-transmission-achilles-heel-of-covid-19-strategies-", "urlToImage": null, "publishedAt": "2020-04-26T12:33:32Z", "content": "Subscribe\r\nSubscribe to never miss a news \r\nLondon: Calling for unprecedented measures to defeat COVID-19, researchers form University of California, San Francisco have said that asymptomatic transmission of SARS-CoV-2 has made controlling the spread of the d… [+2526 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Samsung’s first smartphone with pop-up front camera shown off in leaked renders - XDA Developers", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiYmh0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9zYW1zdW5nLWdhbGF4eS1maXJzdC1zbWFydHBob25lLXBvcC11cC1mcm9udC1jYW1lcmEtbGVha2VkLXJlbmRlcnMv0gFmaHR0cHM6Ly93d3cueGRhLWRldmVsb3BlcnMuY29tL3NhbXN1bmctZ2FsYXh5LWZpcnN0LXNtYXJ0cGhvbmUtcG9wLXVwLWZyb250LWNhbWVyYS1sZWFrZWQtcmVuZGVycy9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T12:16:31Z", "content": null}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Staff Writer", "title": "Gold prices up 40% in a year. Analysts' next target: ₹50,000 by year-end - Livemint", "description": "Across the world, the investment demand for gold has been on a upswing as a hedge against a deeper global recession and meltdown in some asset classes like oil", "url": "https://www.livemint.com/market/commodities/gold-prices-up-40-in-a-year-next-target-rs-50-000-per-10-gram-by-year-end-11587889465935.html", "urlToImage": null, "publishedAt": "2020-04-26T12:03:22Z", "content": "From last year's Akshaya Tritiya to this years's Akshaya Tritiya, gold prices are up about 40% in a span of one year. And still analysts remain bullish on the yellow metal with some of them forecasting price prices to rise to about 50,000 per 10 gram by the e… [+3210 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Android 11 Developer Preview 3: New features spotted in the latest update - Hindustan Times", "description": "Google is expected to roll out Android 11 public beta for more users next month. Here’s what the latest dev update brings.", "url": "https://www.hindustantimes.com/tech/android-11-developer-preview-3-new-features-spotted-in-the-latest-update/story-OigRrLInfGGlAufO1SwGmN.html", "urlToImage": null, "publishedAt": "2020-04-26T10:51:36Z", "content": "Google earlier this week rolled out Android 11 Developer Preview 3 ahead of the public beta launch next month. The latest DP3 was initially said to have skipped major features and focus only on improvements and bug fixes. But it seems the DP3 does come with s… [+1319 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Delhi lockdown won’t be relaxed beyond what Centre permits, says Arvind Kejriwal - The Financial Express", "description": "Addressing an online media briefing, the chief minister said his government was implementing the Centre's guidelines on opening of neighbourhood and standalone shops during the lockdown till May 3.", "url": "https://www.financialexpress.com/india-news/lockdown-relaxation-in-delhi-not-more-than-those-permitted-by-centre-says-arvind-kejriwal/1939990/", "urlToImage": null, "publishedAt": "2020-04-26T10:33:39Z", "content": "The lockdown in Delhi will not be relaxed beyond what the Union home ministry has suggested in its guidelines, Chief Minister Arvind Kejriwal said on Sunday and added that his government’s focus is on bringing down COVID-19 infections in the city.\r\nAddressing… [+2532 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Long-term immigration reform may be afoot in US to curb H-1B, but will it really help? - Moneycontrol", "description": "Trump’s senior policy adviser Stephen Miller has pointed out how the temporary ban may usher in the broader long-term changes to immigration in the US.", "url": "https://www.moneycontrol.com/news/business/long-term-immigration-reform-may-be-afoot-in-us-to-curb-h-1b-but-will-it-really-help-5190531.html", "urlToImage": null, "publishedAt": "2020-04-26T09:04:00Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Randeep Hooda uses Extraction to deliver important Covid-19 message: ‘Don’t step out or...’ - Hindustan Times", "description": "Randeep Hooda shared a still from his latest release, the Netflix film Extraction and asks all to stay home during the pandemic.", "url": "https://www.hindustantimes.com/bollywood/randeep-hooda-uses-extraction-to-deliver-important-covid-19-message-don-t-step-out-or/story-AF3RqM9ZGRcHLSzVpS7dFO.html", "urlToImage": null, "publishedAt": "2020-04-26T08:01:00Z", "content": "Actor Randeep Hooda made his Hollywood debut with Chris Hemsworth starrer Extraction earlier this week. On Sunday, he posted a still from the film and warned all against stepping out during coronavirus crisis.\r\nHe wrote on Instagram, “Only if this boy hadn’t … [+2270 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Amitabh Bachchan Jokes About Coronavirus and Netizens Aren't Happy - News18", "description": "Amitabh Bachchan took to Twitter to tell his fans that a bat had entered his room at his residence Jalsa. He joked how the coronavirus is trailing him.", "url": "https://www.news18.com/news/movies/amitabh-bachchan-jokes-about-coronavirus-and-netizens-arent-happy-2592947.html", "urlToImage": null, "publishedAt": "2020-04-26T03:38:37Z", "content": "Superstar Amitabh Bachchan is one of the most active social media users in the Hindi film industry. From motivational videos to viral challenges, the actor participates in most internet content, thereby entertaining his fans. However, his recent attempt at jo… [+2763 chars]"}, {"source": {"id": null, "name": "Clickitornot.com"}, "author": "https://www.facebook.com/clickitornot", "title": "How To Download & Install Android 11 Developer Preview On Google Pixel Devices - ClickItorNot - ClickItorNot", "description": "Google released the first developer preview for Android 11 back in February 2020. This update has started just after five months of Android 10 stable update.", "url": "https://clickitornot.com/android-11-developer-preview-on-pixel-devices/", "urlToImage": null, "publishedAt": "2020-04-26T03:03:24Z", "content": "Google released the first developer preview for Android 11 back in February 2020. This update has started just after five months of Android 10 stable update.\r\nThe second developer preview of Android 11 was released in March. Recently, Google released develope… [+402 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Bloomberg", "title": "Trump muses that virus briefings ‘not worth the time and effort’ - Livemint", "description": "Trump on Friday said he had “sarcastically” suggested Americans be injected with disinfectant. The president’s new spokeswoman also sought to clarify his remarks.", "url": "https://www.livemint.com/news/world/trump-muses-that-virus-briefings-not-worth-the-time-and-effort-11587865027144.html", "urlToImage": null, "publishedAt": "2020-04-26T01:44:56Z", "content": "(Bloomberg) -- President Donald Trump has been determined to talk his way through the coronavirus crisis, but frequent misstatements at his daily news conferences have caused a litany of public health and political headaches for the White House.On Friday, Tru… [+8239 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "Ryan O'Hanlon", "title": "Premier League scouting: Why identifying similar clubs could be the key to the transfer window - ESPN India", "description": "With football shut down and no games to attend, scouts need to creatively identify transfer targets. One way to do so? Find playing-style proxies.", "url": "https://www.espn.in/football/english-premier-league/story/4086053/premier-league-scouting-why-identifying-similar-clubs-could-be-the-key-to-the-transfer-window", "urlToImage": null, "publishedAt": "2020-04-25T10:26:13Z", "content": "Traditional scouting is gone. During a global pandemic, there are no games for talent identifiers to watch -- outside of Belarus, that is. And whenever games do return, they will presumably be played in empty stadiums, with nowhere for outside employees from … [+13243 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "WWII veteran fundraiser, 99, tops UK single chart - The Jakarta Post - Jakarta Post", "description": "A World War II veteran who has raised millions of pounds for charity by walking around his garden on Friday became the oldest man to top the UK music charts -- just days from his 100th birthday.", "url": "https://www.thejakartapost.com/life/2020/04/25/wwii-veteran-fundraiser-99-tops-uk-single-chart.html", "urlToImage": null, "publishedAt": "2020-04-25T06:30:00Z", "content": "A World War II veteran who has raised millions of pounds for charity by walking around his garden on Friday became the oldest man to top the UK music charts -- just days from his 100th birthday.\r\nCaptain Tom Moore had already become a global phenomenon for ra… [+2570 chars]"}]}