{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Coronavirus Outbreak LIVE Updates: Maharashtra's toll at 323 after highest single-day spike with 22 COVID-19 deaths - Firstpost", "description": "Coronavirus Outbreak LIVE Updates: Maharashtra on Saturday reported 811 new confirmed COVID-19 cases, a single-day record for the state. The total number of positive cases in the state are now 7,628 and the toll rose by 22 to reach 323, a Health department st…", "url": "https://www.firstpost.com/health/coronavirus-outbreak-live-updates-covid-19-pandemic-india-death-count-lockdown-maharashtra-mumbai-gujarat-delhi-latest-news-today-8300291.html", "urlToImage": null, "publishedAt": "2020-04-26T04:40:42Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "Vishal Mathur", "title": "NASA Engineers Built This COVID Ventilator in 37 Days, And it Has Already Passed a Key Test - News18", "description": "VITAL has a design that allows flexibility of use, which makes it relevant for temporary hospitals and health facilities that may already be running short of medical equipment.", "url": "https://www.news18.com/news/tech/nasa-engineers-built-this-covid-ventilator-in-37-days-and-it-has-already-passed-a-key-test-2593003.html", "urlToImage": null, "publishedAt": "2020-04-26T04:14:14Z", "content": "As NASA says, they usually build spacecrafts and not medical devices. But as it turns out, when they do decide to make one, they do a rather fine job of it. The National Aeronautics and Space Administration (NASA) has developed a ventilator as the world strug… [+2354 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Antibody evidence does not yet support 'immunity passport' proposals: WHO - ARIRANG NEWS", "description": "WHO, 코로나19 '면역 증명서'은 정확성 보장 못해. The World Health Organization said Friday that there's not enough evidence to prove that the presence of antibodies for COVID...", "url": "https://www.youtube.com/watch?v=cIiSr0eu-mo", "urlToImage": null, "publishedAt": "2020-04-26T04:08:28Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "Antara Kashyap", "title": "Amitabh Bachchan Jokes About Coronavirus And Netizens Aren't Happy - News18", "description": "Amitabh Bachchan took to Twitter to tell his fans that a bat had entered his room at his residence Jalsa. He joked how the coronavirus is trailing him.", "url": "https://www.news18.com/news/movies/amitabh-bachchan-jokes-about-coronavirus-and-netizens-arent-happy-2592947.html", "urlToImage": null, "publishedAt": "2020-04-26T03:38:37Z", "content": "Superstar Amitabh Bachchan is one of the most active social media users in the Hindi film industry. From motivational videos to viral challenges, the actor participates in most internet content, thereby entertaining his fans. However, his recent attempt at jo… [+2771 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This 4TB PCIe SSD can make your Windows laptop feel more like a MacBook Pro - TechRadar", "description": "Assuming you have a compatible laptop, that is", "url": "https://www.techradar.com/news/this-4tb-pcie-ssd-can-make-your-windows-laptop-feel-more-like-a-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-26T03:00:00Z", "content": "The Apple MacBook Pro 16 still holds bragging rights when it comes to the maximum storage capacity available in a traditional portable laptop. \r\nApple uses a proprietary approach, plugging memory chips directly into the motherboard to reach a whopping 8TB of … [+1494 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Rasesh Mandani", "title": "Bailout plan: Play more matches with India - Hindustan Times", "description": "Later this year, the new Future Tours Programme (FTP) for the years 2023-2031 will be finalised; the ICC continues to be heavily dependent on the BCCI for revenue.", "url": "https://www.hindustantimes.com/cricket/bailout-plan-play-more-matches-with-india/story-VRqndyDqK1aBAy0bT21qoO.html", "urlToImage": null, "publishedAt": "2020-04-26T02:57:47Z", "content": "The Board of Control for Cricket in India (BCCI), the richest body in world cricket, has come up with a plan to help countries facing losses due to the cancellation of cricket worldwide -- although the idea is contingent on games resuming.\r\nAccording to BCCI … [+4642 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Shops in markets or market complexes in urban areas to remain closed during lockdown, clarifies MHA - Times of India", "description": "India News: Seeking to end the confusion over its late Friday night order allowing opening of shops selling non-essential items, the home ministry clarified on Sa", "url": "https://timesofindia.indiatimes.com/india/shops-in-markets-or-market-complexes-in-urban-areas-to-remain-closed-during-lockdown-clarifies-mha/articleshow/75384876.cms", "urlToImage": null, "publishedAt": "2020-04-26T02:39:42Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "'Not Worth Time & Effort': Trump Slams Briefings With 'Lamestream Media' After Disinfectant Gaffe - News18", "description": "After a strong rebuff of his suggestion by top medical experts and disinfectant manufacturers, Trump on Friday claimed he had been speaking 'sarcastically'.", "url": "https://www.news18.com/news/world/not-worth-time-effort-trump-slams-briefings-with-lamestream-media-after-disinfectant-gaffe-2592905.html", "urlToImage": null, "publishedAt": "2020-04-26T02:15:01Z", "content": "US President Donald Trump tweeted that his daily coronavirus briefings were not worth his time, two days after sparking a furore by suggesting patients might be injected with disinfectant to kill an infection.\r\nHe appeared to confirm media reports that he was… [+2094 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "ANI", "title": "PM Modi to address 64th edition of 'Mann Ki Baat' today - Livemint", "description": "In the 63rd episode of 'Mann Ki Baat', Modi had focussed on the situation prevailing in the country due to covis-19.", "url": "https://www.livemint.com/news/india/pm-modi-to-address-64th-edition-of-mann-ki-baat-today-11587865961726.html", "urlToImage": null, "publishedAt": "2020-04-26T01:59:45Z", "content": "NEW DELHI :\r\nPrime Minister Narendra Modi will address the 64th edition of his monthly radio programme 'Mann Ki Baat' at 11 am on Sunday amid the nationwide coronavirus lockdown.\"Have been getting several insightful inputs for this month's #MannKiBaat. Do tun… [+783 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "No evidence proves antibodies can protect from second wave: WHO - India TV News", "description": "There is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection, the World Health Organization (WHO) said in a daily situation report.", "url": "https://www.indiatvnews.com/news/world/no-evidence-proves-antibodies-can-protect-from-second-wave-who-611321", "urlToImage": null, "publishedAt": "2020-04-26T01:43:31Z", "content": "Image Source : APNo evidence proves antibodies can protect from second wave: WHO\r\nThere is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection, the World Health Organization (WHO) said i… [+1540 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Just like Shilpa Shetty, here's why dosa is the perfect protein-packed breakfast option for you - Times of India", "description": "Love feasting on dosas? We tell you why this is one of the healthiest breakfast options for you!", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/just-like-shilpa-shetty-heres-why-dosa-is-the-perfect-protein-packed-breakfast-option-for-you/photostory/75377655.cms", "urlToImage": null, "publishedAt": "2020-04-26T01:30:00Z", "content": "For all the vegetarians who complain about missing out on proteins with their morning meal, fear no more. Dosa batter is made of fermented rice and black urad dal, which is an essential lentil. Pulses and lentils are super-rich on proteins, amino acids and gi… [+135 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Reuters", "title": "Kim Jong Un’s train possibly spotted in North Korean resort town, says U.S.-based think tank - The Hindu", "description": "This comes amid conflicting reports about the North Korean leader’s health and whereabouts.", "url": "https://www.thehindu.com/news/international/kim-jong-uns-train-possibly-spotted-in-north-korean-resort-town-says-us-based-think-tank/article31436236.ece", "urlToImage": null, "publishedAt": "2020-04-26T01:19:54Z", "content": "A special train possibly belonging to North Korean leader Kim Jong Un was spotted this week at a resort town in the country, according to satellite images reviewed by a Washington-based North Korea monitoring project, amid conflicting reports about Mr. Kim's … [+3341 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Bloomberg", "title": "UK PM Boris Johnson to be back at work on Monday - Hindustan Times", "description": "The government has been without a leader since the prime minister was admitted to the hospital on April 5.", "url": "https://www.hindustantimes.com/world-news/uk-pm-boris-johnson-will-be-back-at-work-on-monday-report/story-oDeI7t1kZot0LlaacVYl9I.html", "urlToImage": null, "publishedAt": "2020-04-25T22:02:50Z", "content": "Boris Johnson will return to work on Monday and take charge of the U.K.’s handling of the pandemic, a month after he was struck down by the coronavirus.\r\nThe government has been without a leader since the prime minister was admitted to the hospital on April 5… [+1617 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "The Largest Hole in the Ozone Layer Over the Arctic Has Been Closed - Somag News", "description": "The large ozone hole observed last month in the Arctic, located above the north polar circle of the world, was completely closed according to the statement made by scientists. Scientists have explained that this phenomenon is not related to the coronavirus. T…", "url": "https://www.somagnews.com/largest-hole-ozone-layer-arctic-closed/", "urlToImage": null, "publishedAt": "2020-04-25T19:48:00Z", "content": "The large ozone hole observed last month in the Arctic, located above the north polar circle of the world, was completely closed according to the statement made by scientists. Scientists have explained that this phenomenon is not related to the coronavirus.\r\n… [+2194 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Bhavya Sukheja", "title": "Chris Hemsworth speaking Bangla in Netflixs Extraction leaves netizens flipped - Republic World - Republic World", "description": "One of the scenes from the action-packed film left viewers a little taken aback as Chris Hemsworth, known for 'Thor', spoke fairly fluent Bangla.", "url": "https://www.republicworld.com/entertainment-news/whats-viral/chris-hemsworth-speaking-bangla-leaves-netizens-flipped.html", "urlToImage": null, "publishedAt": "2020-04-25T19:34:34Z", "content": "One of the most awaited movies of 2020, Extraction, starring Chris Hemsworth, Randeep Hooda and Pankaj Tripathi recently released on Netflix and netizens were completely blown away within the first 90 minutes of the film. One of the scenes from the action-pac… [+2489 chars]"}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "Mike Isaac & Sheera Frenkel | NYT", "title": "Zooms sudden popularity sets off scramble in rivals - Business Standard", "description": "Facebook, Google and other behemoths are training their sights on Silicon Valley's company of the moment", "url": "https://www.business-standard.com/article/international/zoom-s-sudden-popularity-sets-off-scramble-in-rivals-120042600008_1.html", "urlToImage": null, "publishedAt": "2020-04-25T19:28:16Z", "content": "As people turned in droves to the video chatting app Zoom in recent weeks, the buzz caught Facebook’s attention. Inside the social network, that immediately set off a scramble.\r\nMark Zuckerberg, Facebook’s chief executive, ordered employees to ramp up and foc… [+4014 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "Android 11 DP3 adds new sensitivity options for gesture navigation - Android Police", "description": "Google was changing Android 10's full-screen gesture navigation all the way up to release, and you could definitely make the argument that there were", "url": "https://www.androidpolice.com/2020/04/25/android-11-dp3-adds-new-sensitivity-options-for-gesture-navigation/", "urlToImage": null, "publishedAt": "2020-04-25T18:49:39Z", "content": "Google was changing Android 10's full-screen gesture navigation all the way up to release, and you could definitely make the argument that there were still unresolved issues I still frequently go back when I'm trying to open an app's side menu. Thankfully, th… [+740 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Global Coronavirus Death Toll Crosses 2 Lakh, Positive Cases to Soon Touch 30 Lakh: Report - News18", "description": "The United States had reported more than 52,400 deaths as of Saturday morning, while Italy, Spain and France have reported between 22,000-26,000 fatalities each.", "url": "https://www.news18.com/news/world/global-coronavirus-death-toll-hits-200000-positive-cases-to-touch-3-million-soon-report-2592839.html", "urlToImage": null, "publishedAt": "2020-04-25T18:24:43Z", "content": "Global deaths linked to the coronavirus passed 2,00,000 on Saturday, while confirmed cases are expected to hit three million (or 30 lakh) in the coming days, according to a Reuters tally.\r\nMore than half of the fatalities have been reported in the United Stat… [+1565 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Boeing scraps $4.2 billion deal to buy Embraer commercial division - Times of India", "description": "International Business News: Boeing announced on Saturday that it was pulling out of a $4.2 billion deal to acquire the commercial plane division of its Brazilian rival Embraer. T", "url": "https://timesofindia.indiatimes.com/business/international-business/boeing-scraps-4-2-billion-deal-to-buy-embraer-commercial-division/articleshow/75380810.cms", "urlToImage": null, "publishedAt": "2020-04-25T17:21:56Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "Plasma therapy trials for corona patients begin in Karnataka - Hindustan Times", "description": "The Minister, who is also leading government efforts against Covid-19 in Bengaluru and is in charge of the state war room had said Convalescent Plasma Therapy was only for patients who are critical, in intensive care units or on ventilator.", "url": "https://www.hindustantimes.com/india-news/plasma-therapy-trials-for-corona-patients-begin-in-karnataka/story-QDgJbjZXWwZaodXBqoGwTO.html", "urlToImage": null, "publishedAt": "2020-04-25T17:11:24Z", "content": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for ‘severe’ coronavirus patients in the state.\r\nIn a tweet, Medical Education Minister K Sudhakar said, “Happy to announce the commencement of Clinical Trials for Plas… [+1156 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Sidharth Yadav", "title": "Coronavirus | After Indore, three nearby districts see surge in deaths - The Hindu", "description": "They account for 85% of fatalities in Madhya Pradesh", "url": "https://www.thehindu.com/news/national/other-states/coronavirus-after-indore-three-nearby-districts-see-surge-in-deaths/article31434284.ece", "urlToImage": null, "publishedAt": "2020-04-25T17:04:54Z", "content": "Three neighbouring districts of Indore which reported the most COVID-19 cases in Madhya Pradesh are fast emerging as the new hotspots. Three out of four patients to die of the illness in the State come from the four districts combined. \r\nThe alarming trend is… [+3527 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "HRD wants universities to study how India handled 1918 Spanish flu, revived economy - Deccan Herald", "description": "The HRD Ministry has asked universities to study how India handled the Spanish flu pandemic in 1918 and what measures were taken to boost the economy. The ministry has also advised the universities to set up research teams and study the levels of awareness of…", "url": "https://www.deccanherald.com/national/north-and-central/hrd-wants-universities-to-study-how-india-handled-1918-spanish-flu-revived-economy-829907.html", "urlToImage": null, "publishedAt": "2020-04-25T16:53:48Z", "content": "The HRD Ministry has asked universities to study how India handled the Spanish flu pandemic in 1918 and what measures were taken to boost the economy.\r\nThe ministry has also advised the universities to set up research teams and study the levels of awareness o… [+1360 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "I was clueless on Test debut, thought had played my last game: Sachin Tendulkar - Times of India", "description": "Cricket News: In his first Test in 1989, Sachin Tendulkar was up against a Pakistan pace attack of Imran Khan, Wasim Akram & Waqar Younis. Recalling the outing, he", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/i-was-clueless-on-test-debut-thought-had-played-my-last-game-sachin-tendulkar/articleshow/75378166.cms", "urlToImage": null, "publishedAt": "2020-04-25T16:40:51Z", "content": "LONDON: Sachin Tendulkar says he was \"clueless\" on his Test debut and almost cried thinking it was all over for him.\r\nWhen he walked out for the last time 24 years later, Tendulkar would do so as a batting great with a record 200 Test appearances to his name.… [+2404 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Prashant Mahesh", "title": "6 FOFs from Franklin Templeton see NAVs dip as debt funds are wound up - Economic Times", "description": "The NAV of Franklin India Dynamic Asset Allocation FOFs (fell 16.6%), Franklin India Multi-Asset Solution (fell 22.42%), Franklin India Life Stage FOFs-20 (fell 6.59%), Franklin India Life Stage FOFs-30 (13.51%), Franklin India Life Stage FOFs-40 ( fell 17.81…", "url": "https://economictimes.indiatimes.com/mf/mf-news/6-fofs-from-franklin-templeton-see-navs-dip-as-debt-funds-are-wound-up/articleshow/75382011.cms", "urlToImage": null, "publishedAt": "2020-04-25T16:12:00Z", "content": "MUMBAI: The NAV of as many six fund of fund (FoFs) from Franklin Templeton India mutual fund fell by as much as 22.42% in a single day due to the winding up of six debt schemes at the fund house. A fund of funds (FOF) is an investment strategy of holding a po… [+1548 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Karan Johar apologises for sharing ‘insensitive’ social media posts during Covid-19 pandemic: ‘I apologise... - Hindustan Times", "description": "Karan Johar has apologised for his ‘insensitive’ social media posts during the coronavirus pandemic, after watching a ‘hard-hitting’ video.", "url": "https://www.hindustantimes.com/bollywood/karan-johar-apologises-for-sharing-insensitive-social-media-posts-during-covid-19-pandemic-i-apologise-profusely/story-s3PG07KXmMswOWceePauAN.html", "urlToImage": null, "publishedAt": "2020-04-25T16:10:00Z", "content": "Filmmaker Karan Johar has apologised for his social media posts during the coronavirus lockdown, after watching a video which sarcastically pointed out that the real heroes are the celebrities. \r\nKaran wrote on Twitter, in reaction to the video, “This hit me … [+2134 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Apple Watch turns 5: Did you know this is not the first watch Apple has designed? - Hindustan Times", "description": "That and four other cool things you did not know about the Apple Watch", "url": "https://www.hindustantimes.com/tech/apple-watch-turns-5-did-you-know-this-is-not-the-first-watch-apple-has-designed/story-TaLd5mAFahahxirkVPkLaN.html", "urlToImage": null, "publishedAt": "2020-04-25T15:57:39Z", "content": "Apple launched the first Apple Watch five years ago this week. The Apple Watch was Tim Cook’s first high profile product launch after he took over from Steve Jobs. For Jobs, the Apple iPad was the last big product that he launched. \r\nOver the last five years,… [+4241 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Brokerage firm moves Delhi high court against MCX - Hindustan Times", "description": "MCX, which initially announced a provisional settlement price of Re 1 for its contract that ended on April 20, later calculated a price of minus Rs 2,884 per barrel, exposing brokers to a potential loss of Rs 435 crore.", "url": "https://www.hindustantimes.com/business-news/brokerage-firm-moves-delhi-high-court-against-mcx/story-AXkklID45tUdcVhij2JYiP.html", "urlToImage": null, "publishedAt": "2020-04-25T15:57:11Z", "content": "A broker member of MCX, country’s largest exchange for commodity derivatives, moved the Delhi high court against the manner in which the April crude oil contract was settled by the bourse. \r\nPrrsaar Commodities (P) Ltd moved the court in the interest of its i… [+1142 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "ICICI Prudential Life Insurance Q4 net profit down 31.5% - Moneycontrol.com", "description": "The company posted a 21 percent YoY growth in value of new business to Rs 1,605 crore in FY20.", "url": "https://www.moneycontrol.com/news/business/companies/icici-prudential-life-insurance-q4-net-profit-down-31-5-5189541.html", "urlToImage": null, "publishedAt": "2020-04-25T15:09:00Z", "content": "Private life insurer ICICI Prudential Life Insurance posted a 31.5 percent year-on-year decline in its March quarter (Q4) consolidated net profit at Rs 178.73 crore due to a drop in net investment income and provisions. However, the company posted a 21 percen… [+5527 chars]"}, {"source": {"id": null, "name": "Thesportsrush.com"}, "author": "Tanish Chachra", "title": "Manchester City star David Silva names best Premier League player of his era - The Sportsrush", "description": "Manchester City star David Silva picks best Premier League player to play in his era as he goes live on for an AMA on social media. Manchester City's captain David Silva has completed 10 years in the Premier League this year and in his time with the Citizens,…", "url": "https://thesportsrush.com/manchester-city-star-david-silva-names-best-premier-league-player-of-his-era/", "urlToImage": null, "publishedAt": "2020-04-25T13:12:00Z", "content": "Manchester City star David Silva picks best Premier League player to play in his era as he goes live on for an AMA on social media.\r\nManchester City’s captain David Silva has completed 10 years in the Premier League this year and in his time with the Citizens… [+1530 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Anuja", "title": "Consider ₹1 trillion wage protection package for MSMEs: Sonia Gandhi to Modi - Livemint", "description": "In a letter to the prime minister, Gandhi listed five suggestions, including the financial package.The party's 11 member consultative committee had discussed the issue earlier this week", "url": "https://www.livemint.com/news/india/consider-rs-1-trillion-wage-protection-package-for-msmes-sonia-gandhi-to-modi-11587818100950.html", "urlToImage": null, "publishedAt": "2020-04-25T12:51:12Z", "content": "NEW DELHI: Congress president Sonia Gandhi on Saturday urged Prime Minister Narendra Modi to announce a 1 trillion wage protection package for micro, small and medium enterprises (MSME) as the sector needs immediate attention.In a letter to the prime minister… [+1413 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "No Dearness Allowance hike freeze for Central Government Employees necessary: Manmohan Singh - The Financial Express", "description": "Dearness Allowance News: Manmohan Singh has said he believed that it was not necessary to impose hardships on government employees.", "url": "https://www.financialexpress.com/money/dearness-allowance-da-hike-for-central-government-employees-latest-new-7th-pay-commission-manmohan-singh/1939320/", "urlToImage": null, "publishedAt": "2020-04-25T12:28:30Z", "content": "Dearness Allowance Hike freeze for Central Government Employees Latest News: Former Prime Minister Manmohan Singh has said he believed that it was “not necessary” to impose hardships on government employees and armed forces by freezing Dearness Allowance and … [+1884 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "IANS", "title": "Suriya’s ‘Soorarai Pottru’ could be banned, if Jyothika’s ‘Pon Magal Vandhal’ releases directly on OTT - The Hindu", "description": "Tamil Nadu Theatre And Multiplex Owners’ Association respond to expected release of Jyothika’s film on Amazon Prime next month", "url": "https://www.thehindu.com/entertainment/movies/suriyas-soorarai-pottru-could-be-banned-if-jyothikas-pon-magal-vandhal-releases-directly-on-ott/article31432944.ece", "urlToImage": null, "publishedAt": "2020-04-25T12:25:03Z", "content": "The Tamil Nadu Theatre And Multiplex Owners Association have threatened to ban films starring Suriya, as well as the films produced by his production company 2D films. The decision comes after the news that the film Pon Magal Vandhal, produced by Suriya and s… [+1831 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "‘Didn’t want people to say Silver Sindhu,’ Talk of final phobia propelled PV Sindhu to World Championship... - Hindustan Times", "description": "Sindhu, who had already won two silver and two bronze medals at the event, defeated her nemesis Nozomi Okuhara 21-7 21-7 in the summit clash that lasted just 38 minutes on August 26 last year.", "url": "https://www.hindustantimes.com/other-sports/didn-t-want-people-to-say-silver-sindhu-talk-of-final-phobia-propelled-pv-sindhu-to-world-championship-glory/story-9daLENyFdFsDbf4qp35ELI.html", "urlToImage": null, "publishedAt": "2020-04-25T11:59:43Z", "content": "Ace shuttler PV Sindhu, who had created history by becoming the first Indian to win gold medal at the World Championships last year, has revealed that she didnt want people to call her “silver Sindhu” and thats why she was desperate to clinch the top honours … [+1477 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Cosmic Reef: NASA release an image of a blazing starbirth to mark Hubble's 30th birthday - Firstpost", "description": "Hubble has been placed in space to observe the most distant stars and galaxies, as well as planets in our solar system.", "url": "https://www.firstpost.com/tech/science/cosmic-reef-nasa-release-an-image-of-a-blazing-starbirth-to-mark-hubbles-30th-birthday-8299671.html", "urlToImage": null, "publishedAt": "2020-04-25T10:23:08Z", "content": "FP TrendingApr 25, 2020 16:24:11 IST\r\nThe US space agency has released a new bright picture of a firestorm of starbirth to mark the 30th anniversary of the Hubble Space Telescope. Scientists have called the picture Cosmic Reef, as it resembles a coral reef fl… [+1921 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Coronavirus: Doubling rate rises further, now 10 days - Times of India", "description": "India News: Timely imposition of a lockdown after a ban on international air traffic helped India limit Covid-19 cases, which otherwise could have ballooned to ov", "url": "https://timesofindia.indiatimes.com/india/doubling-rate-of-coronavirus-slows-down-further-now-its-10-days/articleshow/75364560.cms", "urlToImage": null, "publishedAt": "2020-04-25T10:16:27Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "US states start to reopen as coronavirus death toll tops 50000 - Al Jazeera English", "description": "Some states in the southern United States with Republican governors are easing restrictions, in spite of warnings from the medical community that it is too s...", "url": "https://www.youtube.com/watch?v=oI74Ylp8rus", "urlToImage": null, "publishedAt": "2020-04-25T07:41:10Z", "content": null}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Livemint", "title": "Crouching tiger upsets hidden dragon - Livemint", "description": "India’s decision to block Chinese investments has led to a mini earthquake in the Sino-Indian investment corridor.Indian startups themselves covet Chinese funding, because it comes with real-time expertise on how to tweak their business models on a daily basis", "url": "https://www.livemint.com/news/india/crouching-tiger-upsets-hidden-dragon-11587750652064.html", "urlToImage": null, "publishedAt": "2020-04-25T05:30:33Z", "content": "MUMBAI :\r\nIf India doesnt want Chinese money, said the executive of a venture capital fund in Beijing, then more money will go to another country.\" The pragmatic, young Chinese man, experienced in doing business in India, already had alternative investment de… [+11981 chars]"}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "First-ever digital geological map of moon released by US Geological Survey - Down To Earth Magazine", "description": "It will serve as a blue print for future human lunar missions", "url": "https://www.downtoearth.org.in/news/science-technology/first-ever-digital-geological-map-of-moon-released-by-us-geological-survey-70690", "urlToImage": null, "publishedAt": "2020-04-24T15:59:01Z", "content": "The first ever digital, unified, global, geological map of the moon was released virtually by the  United States Geological Survey (USGS), National Aeronautics and Space Administration (Nasa) and the Lunar Planetary Institute on April 22, 2020.\r\nThe map is a … [+2958 chars]"}]}