{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "MS Dhoni always takes responsibility when team loses, says Mohit Sharma - Times of India", "description": "Cricket News: He has played most of his cricket under MS Dhoni and pacer Mohit Sharma says the revered former India skipper is a true leader who does not back off w", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/ms-dhoni-always-takes-responsibility-when-team-loses-says-mohit-sharma/articleshow/75388665.cms", "urlToImage": null, "publishedAt": "2020-04-26T10:26:03Z", "content": "NEW DELHI: He has played most of his cricket under MS Dhoni and pacer Mohit Sharma says the revered former India skipper is a true leader who does not back off when it comes to taking responsibility in challenging times.\r\nThe 31-year-old pacer has played unde… [+2580 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "PM to interact with CMs on Monday to discuss way out of lockdown, Covid fight - Times of India", "description": "India News: PM Modi will interact with chief ministers via video conference on Monday morning on the way ahead in the fight against the coronavirus, amid indicati", "url": "https://timesofindia.indiatimes.com/india/pm-to-interact-with-cms-on-monday-to-discuss-way-out-of-lockdown-covid-fight/articleshow/75389416.cms", "urlToImage": null, "publishedAt": "2020-04-26T10:16:39Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "New York Times", "title": "Coronavirus antibody tests: Can you trust the results? - Times of India", "description": "The researchers worked around the clock, in shifts of three to five hours, hoping to stave off weariness and keep t", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-antibody-tests-can-you-trust-the-results/articleshow/75387833.cms", "urlToImage": null, "publishedAt": "2020-04-26T10:11:40Z", "content": "The researchers worked around the clock, in shifts of three to five hours, hoping to stave off weariness and keep their minds sharp for the delicate task.\r\nThey set up lines of laboratory volunteers: medical residents, postdoctoral students, even experienced … [+11078 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Reuters", "title": "Focus turns to Kim Yo Jong as mystery intensifies over Kim Jong Un’s health - Hindustan Times", "description": "South Korean and Chinese officials on Tuesday cast doubt on reports that Kim was gravely ill following a cardiovascular procedure, after his absence from a key state anniversary event triggered speculation about his health.", "url": "https://www.hindustantimes.com/world-news/focus-turns-to-kim-yo-jong-as-mystery-intensifies-over-kim-jong-un-s-health/story-Jn6OKliLN8z9nkjdKd918M.html", "urlToImage": null, "publishedAt": "2020-04-26T10:08:38Z", "content": "North Korea has never publicised who would follow leader Kim Jong Un in the event he is incapacitated, and with no details known about his young children, analysts say his sister and loyalists could form a regency until a successor is old enough to take over.… [+4599 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Super Rich May Have to Pay Wealth Tax and One-Time Relief Cess to Fund India's Coronavirus Fight - News18", "description": "The central government has frozen the inflation-linked allowance for its employees and pensioners, a move that will help it save around Rs 37,000 crore.", "url": "https://www.news18.com/news/business/tax-officers-suggest-40-tax-on-super-rich-higher-levy-on-foreign-companies-to-fund-covid-19-battle-2593351.html", "urlToImage": null, "publishedAt": "2020-04-26T09:55:05Z", "content": "Mumbai: A group of senior tax officers has suggested a super-rich tax and a higher levy on foreign companies to keep the cash running as part of short term measures to help the government fight the coronavirus pandemic.\r\nThe suggestions are part of a paper ti… [+2267 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Romita Majumdar", "title": "A pandemic may be the right time for Indian IT firms to seek M&As - Livemint", "description": "In 2008, TCS bought out Citigroup’s captive arm in India for $505 million at the height of the global financial crisis.Many recent acquisitions by IT companies have been in the areas of digital analytics and marketing", "url": "https://www.livemint.com/companies/news/a-pandemic-may-be-the-right-time-for-indian-it-firms-to-seek-m-as-11587893096952.html", "urlToImage": null, "publishedAt": "2020-04-26T09:29:41Z", "content": "The economic chaos caused by the covid-19 pandemic appears to be fertile ground for IT companies to seek out mergers &amp; acquisitions (M&amp;As) and as indicated by the management commentary emerging from India's top IT companies like Tata Consultancy Servi… [+2809 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Delhi will implement Centre’s guidelines on reopening of shops, says Kejriwal - India Gone Viral", "description": "Home / India News / Delhi will implement Centre’s guidelines on reopening of shops, says Kejriwal Delhi chief minister Arvind Kejriwal on Sunday presented data on the coronavirus disease (Covid-19) ca", "url": "https://indiagoneviral.com/news/2020/04/26/delhi-will-implement-centres-guidelines-on-reopening-of-shops-says-kejriwal/42867/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-26T09:09:04Z", "content": "Home / India News / Delhi will implement Centres guidelines on reopening of shops, says Kejriwal Delhi chief minister Arvind Kejriwal on Sunday presented data on the coronavirus disease (Covid-19) cases in the national capital to say his government will not a… [+2619 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Covid-19: Apple, Google to shut down the coronavirus tracker once it is contained - Hindustan Times", "description": "The document clearly mentions that “Google and Apple can disable the exposure notification system on a regional basis when it is no longer needed.”", "url": "https://www.hindustantimes.com/tech/covid-19-apple-google-to-shut-down-the-coronavirus-tracker-once-it-is-contained/story-EpyL70qsPuJdxQnZsNim2I.html", "urlToImage": null, "publishedAt": "2020-04-26T08:56:47Z", "content": "While Apple and Google are working on using your smartphone’s Bluetooth and location tracking to determine Covid-19 effected people around you, they will also be turning off this tech once the disease is contained. This has been mentioned in the ‘Frequently A… [+1716 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "As coronavirus stalls global growth, safe haven gold may touch Rs 52,000 by next Akshaya Tritiya - Moneycontrol.com", "description": "However, experts also warn that if a COVID-19 vaccine is developed and economic activity picks up, then there could be a major correction in gold prices.", "url": "https://www.moneycontrol.com/news/business/markets/as-coronavirus-stalls-global-growth-safe-haven-gold-may-touch-rs-52000-by-next-akshaya-tritiya-5190361.html", "urlToImage": null, "publishedAt": "2020-04-26T08:03:00Z", "content": "Buying gold as a coin or in some form of jewellery on the occasion of Akshaya Tritiya, an auspicious time for Hindus and Jains, is always considered as a good start and there are beliefs that it brings unending prosperity.\r\nBut this time the situation is diff… [+5167 chars]"}, {"source": {"id": null, "name": "Scoopwhoop.com"}, "author": "Pradamini Kumari", "title": "In Good News, The Largest Hole In The Ozone Layer Has Apparently Healed Itself - ScoopWhoop", "description": "Scientists have confirmed that the 1 million square kilometre wide hole in the ozone layer over the Arctic has finally healed.", "url": "https://www.scoopwhoop.com/news/scientists-claim-largest-hole-in-the-ozone-layer-healed-itself/", "urlToImage": null, "publishedAt": "2020-04-26T07:26:33Z", "content": "When we say planet Earth is healing, we literally mean it. \r\nAccording to reports, scientists have confirmed that the 1 million square kilometre wide hole in the ozone layer over the Arctic has finally healed. And, apparently the hole over the north pole has … [+2217 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Irrfan Khan attends mother Saeda Begum’s funeral via video conferencing - Hindustan Times", "description": "Irrfan Khan’s mother Saeda Begum died on Saturday morning. The actor could not make it to her funeral, owing to the lockdown.", "url": "https://www.hindustantimes.com/bollywood/irrfan-khan-attends-mother-saeda-begum-s-funeral-via-video-conferencing/story-U1oaroYOIteMiIH1R9zxWO.html", "urlToImage": null, "publishedAt": "2020-04-26T06:37:04Z", "content": "Unable to travel to Rajasthan for his mother Saeda Begum’s last rites, Irrfan Khan was a part of the funeral through video conferencing. Her last rites were performed on Saturday evening at Chungi Naka graveyard on the outskirts of Jaipur. DNA reports that on… [+1143 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Blast from the past! When Suhana Khan turned hairstylist for daddy Shah Rukh Khan on the sets, see pictur - Times of India", "description": "Superstar Shah Rukh Khan and his daughter Suhana Khan are one of the most loved father-daughter duos in town. Not o", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/blast-from-the-past-when-suhana-khan-turned-hairstylist-for-daddy-shah-rukh-khan-on-the-sets-see-picture/articleshow/75387332.cms", "urlToImage": null, "publishedAt": "2020-04-26T06:36:00Z", "content": null}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Pat Cummins recalls Cheteshwar Pujara's exploits Down Under, picks him as toughest batsman to bowl - India Today", "description": "Australian fast bowler Pat Cummins said that Cheteshwar Pujara remains one of the toughest he has ever bowled to especially Test cricket.", "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-recalls-cheteshwar-pujara-exploits-australia-picks-him-toughest-batsman-to-bowl-in-tests-1671223-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T06:32:34Z", "content": "World No.1 Test bowler Pat Cummins has revealed that India's Cheteshwar Pujara is the toughest batsman to bowl to in the longest format of the game.\r\nCheteshwar Pujara had helped India orchestrate their maiden Test series victory in Australia last year as he … [+1384 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Centre issues guidelines on use of AC, coolers, fans amid coronavirus COVID-19 outbreak - Zee News", "description": "As the temperatures conitnues to rise in the country, people need to switch on their air conditioners (AC) and dessert coolers to get some respite from the blistering heat. However, there have been several concerns over the use of ACs and coolers amid the cor…", "url": "https://zeenews.india.com/india/centre-issues-guidelines-on-use-of-ac-coolers-fans-amid-coronavirus-covid-19-outbreak-2279137.html", "urlToImage": null, "publishedAt": "2020-04-26T06:27:36Z", "content": "As the temperatures conitnues to rise in the country, people need to switch on their air conditioners (AC) and dessert coolers to get some respite from the blistering heat. However, there have been several concerns over the use of ACs and coolers amid the cor… [+2198 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Reliance’s E-Commerce Venture JioMart Goes Live On WhatsApp In Mumbai’s Thane, Kalyan And Navi Mumbai Areas - Swarajya", "description": "JioMart has gained direct access and reach to WhatsApp's user base of over 400 million.", "url": "https://swarajyamag.com/insta/reliances-e-commerce-venture-jiomart-goes-live-on-whatsapp-in-mumbais-thane-kalyan-and-navi-mumbai-areas", "urlToImage": null, "publishedAt": "2020-04-26T06:20:47Z", "content": null}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Longjam Dineshwori", "title": "Prescriptions for antidepressants and anti-anxiety drugs surge amidst COVID-19 pandemic - TheHealthSite", "description": "According to a report prescriptions of anti-anxiety medications rose by 34.1% between mid-February and mid-March in the US.", "url": "https://www.thehealthsite.com/news/prescriptions-for-antidepressants-and-anti-anxiety-drugs-surge-amidst-covid-19-pandemic-741891/", "urlToImage": null, "publishedAt": "2020-04-26T06:06:59Z", "content": "Stress about health, finances and uncertainty about the future amidst the COVID-19 pandemic is taking a serious toll on the mental health of people worldwide. In India, there has been a massive spike in patients with mental illness since the coronavirus outbr… [+4292 chars]"}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "Alex  Mathew", "title": "BQ Big Decisions: As A Crisis Hits Debt Funds, Is Your Money Safe? - BloombergQuint", "description": "Should you approach investing in debt mutual funds differently now?", "url": "https://www.bloombergquint.com/business/bq-big-decisions-as-a-crisis-hits-debt-funds-is-your-money-safe", "urlToImage": null, "publishedAt": "2020-04-26T05:25:49Z", "content": "BloombergQuints Big Decisions podcast gets you the insights you need to make big money decisions with confidence.\r\nWhen Franklin Templeton Mutual Fund wound up its six yield-oriented, managed credit funds last week, it shook the confidence of a large number o… [+485 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Vishal Mathur", "title": "NASA Engineers Built This COVID Ventilator in 37 Days, And it Has Already Passed a Key Test - 360TopNews", "description": "VITAL has a design that allows flexibility of use, which makes it relevant for temporary hospitals and health facilities that may already be running short of medical equipment.", "url": "https://www.news18.com/news/tech/nasa-engineers-built-this-covid-ventilator-in-37-days-and-it-has-already-passed-a-key-test-2593003.html", "urlToImage": null, "publishedAt": "2020-04-26T05:01:37Z", "content": "As NASA says, they usually build spacecrafts and not medical devices. But as it turns out, when they do decide to make one, they do a rather fine job of it. The National Aeronautics and Space Administration (NASA) has developed a ventilator as the world strug… [+2354 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Sandhya Ramesh", "title": "Rising CO2 emissions could change the way human brains work, study says - ThePrint", "description": "ScientiFix, our weekly feature, offers you a summary of the top global science stories of the week, with links to their sources.", "url": "https://theprint.in/scientifix/rising-co2-emissions-could-change-the-way-human-brains-work-study-says/409011/", "urlToImage": null, "publishedAt": "2020-04-26T04:45:46Z", "content": "Rising CO2 emissions could affect decision-making in humans\r\nResearchers at the University of Colorado at Boulder have suggested that rising carbon dioxide (CO2) levels could eventually alter basic decision-making skills in humans. Due to fossil-fuel producti… [+2300 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Safoora", "title": "iPhone users! This message can crash Apple devices in seconds - The Siasat Daily", "description": "NEW DELHI: Here’s an important ‘warning’ if you use an Apple devices. There's a text message that has been circulating on secure messaging platform Telegram as well as a number of forums that particularly affects Apple devices running on iOS. This string of c…", "url": "https://www.siasat.com/iphone-users-message-can-crash-apple-devices-seconds-1879653/", "urlToImage": null, "publishedAt": "2020-04-26T04:45:20Z", "content": "NEW DELHI: Heres an important warning if you use an Apple devices.\r\nThere’s a text message that has been circulating on secure messaging platform Telegram as well as a number of forums that particularly affects Apple devices running on iOS.\r\nThis string of ch… [+525 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu Net Desk", "title": "Coronavirus India lockdown Day 33 updates | Positive cases cross 26,500 - The Hindu", "description": "Globally, as of 25 April 2020, there have been 27,24,809 confirmed cases including 1,87,847 deaths, reported to WHO", "url": "https://www.thehindu.com/news/national/india-coronavirus-lockdown-april-26-2020-live-updates/article31436416.ece", "urlToImage": null, "publishedAt": "2020-04-26T04:25:00Z", "content": "India posted 1,554 new cases of COVID-19 since Saturday evening bringing the total number of those confirmed positive to 26,496 according to an update by the Union Ministry of Health and Family Welfare. The death toll stands at 824.\r\nData from States however … [+4927 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Saudi Arabia bans flogging as form of punishment, convicts to be handed jail sentences and fines instead - Firstpost", "description": "Saudi Arabia is ending flogging as a form of punishment, according to a document from the kingdom’s top court seen by Reuters", "url": "https://www.firstpost.com/world/saudi-arabia-bans-flogging-as-form-of-punishment-convicts-to-be-handed-jail-sentences-and-fines-instead-8298111.html", "urlToImage": null, "publishedAt": "2020-04-26T03:39:27Z", "content": "Riyadh: Saudi Arabia is ending flogging as a form of punishment, according to a document from the kingdoms top court seen by Reuters on Friday.\r\nFile image of Saudi Arabia's Crown Prince Mohammad bin Salman. AP\r\nThe decision by the General Commission for the … [+1590 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Covid-19 state tally: Maharashtra crosses 7,000-mark, lockdown in Tamil Nadu cities - Hindustan Times", "description": "Gujarat continues to have the second-highest number of coronavirus cases in the country after Maharashtra.", "url": "https://www.hindustantimes.com/india-news/covid-19-state-tally-maharashtra-crosses-7-000-mark-lockdown-in-tamil-nadu-cities/story-otxBMPzuLOs4MkLcF0epeI.html", "urlToImage": null, "publishedAt": "2020-04-26T03:37:54Z", "content": "The number of coronavirus cases in the country rose to 26,496 on Sunday. According to the latest figures updated by the Ministry of Health, there are 19,868 active coronavirus cases in the country, 5,803 patients have been cured or discharged while 824 people… [+4737 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Rasesh Mandani", "title": "Bailout plan: Play more matches with India - Hindustan Times", "description": "Later this year, the new Future Tours Programme (FTP) for the years 2023-2031 will be finalised; the ICC continues to be heavily dependent on the BCCI for revenue.", "url": "https://www.hindustantimes.com/cricket/bailout-plan-play-more-matches-with-india/story-VRqndyDqK1aBAy0bT21qoO.html", "urlToImage": null, "publishedAt": "2020-04-26T02:57:47Z", "content": "The Board of Control for Cricket in India (BCCI), the richest body in world cricket, has come up with a plan to help countries facing losses due to the cancellation of cricket worldwide -- although the idea is contingent on games resuming.\r\nAccording to BCCI … [+4642 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Reuters", "title": "'I want my life back': Germans protest against lockdown - The Hindu", "description": "Germany has put in place strict curbs on public activity, imposing its lockdown on March 17", "url": "https://www.thehindu.com/news/international/i-want-my-life-back-germans-protest-against-lockdown/article31436294.ece", "urlToImage": null, "publishedAt": "2020-04-26T02:39:59Z", "content": "German police wearing riot gear and face masks tussled on Saturday with dozens of protesters demonstrating in central Berlin against the coronavirus lockdown on public life.\r\nProtesters shouted I want my life back and held up signs with slogans such as Protec… [+2371 chars]"}, {"source": {"id": null, "name": "Tribuneindia.com"}, "author": "Tribune News Service", "title": "Neighbourhood shops allowed to open - The Tribune India", "description": "Salons, eateries, liquor vends to remain closed | No relaxation in containment zones", "url": "https://www.tribuneindia.com/news/nation/neighbourhood-shops-allowed-to-open-76317", "urlToImage": null, "publishedAt": "2020-04-26T01:41:26Z", "content": "New Delhi, April 25\r\nFurther easing lockdown restrictions in non-containment zones, the Centre has allowed opening of neighbourhood and standalone shops, including those in residential complexes, within the municipal limits.\r\nThe order was issued late last ni… [+686 chars]"}, {"source": {"id": null, "name": "Vogue.in"}, "author": "Nupur Sarvaiya", "title": "Aishwarya Rai Bachchan’s pink lehenga from her mehandi is for brides who love soothing hues - VOGUE India", "description": "Aishwarya Rai Bachchan chose a romantic pink lehenga for her pre-wedding celebrations back in 2007. Here's how you can get the look", "url": "https://www.vogue.in/wedding-wardrobe/collection/aishwarya-rai-bachchan-pink-mehandi-lehenga-neeta-lulla-long-blouse-floral-maangtikka-necklace-earrings-abhishek-bachchan/", "urlToImage": null, "publishedAt": "2020-04-26T01:12:38Z", "content": "For her wedding with Abhishek Bachchan back in April 2007, Aishwarya Rai Bachchan served up a good mix of traditional and contemporary bridal looks. While the star dressed in a pastel blue Abu Jani Sandeep Khosla lehenga for her sangeet, a regal gold silk sar… [+1517 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "WHO warns over virus immunity as global death toll nears 200,000 - Times of India", "description": "Europe News: The WHO warned on Saturday recovering from coronavirus may not protect people from reinfection as the death toll from the pandemic approached 200,000", "url": "https://timesofindia.indiatimes.com/world/europe/who-warns-over-virus-immunity-as-global-death-toll-nears-200000/articleshow/75380902.cms", "urlToImage": null, "publishedAt": "2020-04-25T23:47:59Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "Mike Isaac & Sheera Frenkel | NYT", "title": "Zooms sudden popularity sets off scramble in rivals - Business Standard", "description": "Facebook, Google and other behemoths are training their sights on Silicon Valley's company of the moment", "url": "https://www.business-standard.com/article/international/zoom-s-sudden-popularity-sets-off-scramble-in-rivals-120042600008_1.html", "urlToImage": null, "publishedAt": "2020-04-25T19:28:16Z", "content": "As people turned in droves to the video chatting app Zoom in recent weeks, the buzz caught Facebook’s attention. Inside the social network, that immediately set off a scramble.\r\nMark Zuckerberg, Facebook’s chief executive, ordered employees to ramp up and foc… [+4014 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "Android 11 DP3 adds new sensitivity options for gesture navigation - Android Police", "description": "Google was changing Android 10's full-screen gesture navigation all the way up to release, and you could definitely make the argument that there were", "url": "https://www.androidpolice.com/2020/04/25/android-11-dp3-adds-new-sensitivity-options-for-gesture-navigation/", "urlToImage": null, "publishedAt": "2020-04-25T18:49:39Z", "content": "Google was changing Android 10's full-screen gesture navigation all the way up to release, and you could definitely make the argument that there were still unresolved issues I still frequently go back when I'm trying to open an app's side menu. Thankfully, th… [+740 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "India plans to fast track Chinese investments after policy change: Sources - Moneycontrol", "description": "To avoid opportunistic takeovers during the coronavirus outbreak, India said this week that all foreign direct investment from countries sharing a land border would require prior government clearance, meaning they can't go through a so-called automatic route.", "url": "https://www.moneycontrol.com/news/india/india-plans-to-fast-track-chinese-investments-after-policy-change-sources-5189761.html", "urlToImage": null, "publishedAt": "2020-04-25T14:58:07Z", "content": "India plans to fast track the review of some investment proposals from neigbouring countries such as China following concerns new screening rules could hit plans of companies and investors, three sources told Reuters on Saturday.\r\nTo avoid opportunistic takeo… [+3315 chars]"}, {"source": {"id": null, "name": "Indiantelevision.com"}, "author": "https://www.facebook.com/ITVNewz", "title": "Godrej Group urges people to take precautionary measures on world malaria day - Indiantelevision.com", "description": "MUMBAI: On World Malaria Day, Godrej Group has urged people to take precautionary measures against vector-borne diseases like malaria, dengue during the ongoing COVID-19 pandemic. The conglomerate has released a digital film to highlight EMBED (Elimination of…", "url": "https://www.indiantelevision.com/mam/marketing/mam/godrej-group-urges-people-to-take-precautionary-measures-on-world-malaria-day-200425", "urlToImage": null, "publishedAt": "2020-04-25T14:05:57Z", "content": "MUMBAI: On World Malaria Day, Godrej Group has urged people to take precautionary measures against vector-borne diseases like malaria, dengue during the ongoing COVID-19 pandemic. The conglomerate has released a digital film to highlight EMBED (Elimination of… [+4044 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "Social distancing forgotten as panic buying ensues in Chennai after lockdown order - The News Minute", "description": "On Saturday, markets in Chennai witnessed huge crowds as people started streaming in, some with masks and some without, from early morning. More than 150 people crowded the market lane of Chintadripet, Chennai, disregarding social distancing norms. Each shop …", "url": "https://www.thenewsminute.com/article/social-distancing-forgotten-panic-buying-ensues-chennai-after-lockdown-order-123318", "urlToImage": null, "publishedAt": "2020-04-25T14:02:51Z", "content": "The Chennai Metropolitan Development Authority on Saturday clarified that vegetable shops will be open during the lockdown.On Saturday, markets in Chennai witnessed huge crowds as people started streaming in, some with masks and some without, from early morni… [+2998 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Immunity passports 'could increase virus spread' - BBC News", "description": "No evidence people who develop antibodies after recovering are protected against a second infection.", "url": "https://www.bbc.com/news/world-52425825", "urlToImage": null, "publishedAt": "2020-04-25T13:40:47Z", "content": "Image copyrightReutersImage caption\r\n Testing for antibodies is becoming more widespread\r\nGovernments should not issue so-called \"immunity passports\" or \"risk-free certificates\" as a way of easing lockdowns, the World Health Organization (WHO) says.\r\nIt said … [+4744 chars]"}, {"source": {"id": null, "name": "Thesportsrush.com"}, "author": "Tanish Chachra", "title": "Manchester City star David Silva names best Premier League player of his era - The Sportsrush", "description": "Manchester City star David Silva picks best Premier League player to play in his era as he goes live on for an AMA on social media. Manchester City's captain David Silva has completed 10 years in the Premier League this year and in his time with the Citizens,…", "url": "https://thesportsrush.com/manchester-city-star-david-silva-names-best-premier-league-player-of-his-era/", "urlToImage": null, "publishedAt": "2020-04-25T13:12:00Z", "content": "Manchester City star David Silva picks best Premier League player to play in his era as he goes live on for an AMA on social media.\r\nManchester City’s captain David Silva has completed 10 years in the Premier League this year and in his time with the Citizens… [+1530 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Anuja", "title": "Consider ₹1 trillion wage protection package for MSMEs: Sonia Gandhi to Modi - Livemint", "description": "In a letter to the prime minister, Gandhi listed five suggestions, including the financial package.The party's 11 member consultative committee had discussed the issue earlier this week", "url": "https://www.livemint.com/news/india/consider-rs-1-trillion-wage-protection-package-for-msmes-sonia-gandhi-to-modi-11587818100950.html", "urlToImage": null, "publishedAt": "2020-04-25T12:51:12Z", "content": "NEW DELHI: Congress president Sonia Gandhi on Saturday urged Prime Minister Narendra Modi to announce a 1 trillion wage protection package for micro, small and medium enterprises (MSME) as the sector needs immediate attention.In a letter to the prime minister… [+1413 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Nandini Ramnath", "title": "‘Hundred’ review: Lara Dutta and Rinku Rajguru steer a fun run to the crease - Scroll.in", "description": "In the Disney+ Hotstar web series, Lara Dutta is a police officer who uses Rinku Rajguru’s terminally ill government employee to save her job.", "url": "https://scroll.in/reel/960181/hundred-review-lara-dutta-and-rinku-rajguru-steer-a-fun-run-to-the-crease", "urlToImage": null, "publishedAt": "2020-04-25T06:34:00Z", "content": "Hundred is a web series that revolves around two women. One is going to die. The other is barely surviving. But dont you ever make the mistake of feeling sorry for Nethra or Saumya. \r\nNethra (Rinku Rajguru) has recently learnt that she has a galloping brain t… [+5002 chars]"}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "First-ever digital geological map of moon released by US Geological Survey - Down To Earth Magazine", "description": "It will serve as a blue print for future human lunar missions", "url": "https://www.downtoearth.org.in/news/science-technology/first-ever-digital-geological-map-of-moon-released-by-us-geological-survey-70690", "urlToImage": null, "publishedAt": "2020-04-24T15:59:01Z", "content": "The first ever digital, unified, global, geological map of the moon was released virtually by the  United States Geological Survey (USGS), National Aeronautics and Space Administration (Nasa) and the Lunar Planetary Institute on April 22, 2020.\r\nThe map is a … [+2958 chars]"}]}