{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Apple, Google Boost Privacy Protections for Covid Contact-Tracing Tool - Bloomberg Technology", "description": "Apr.25 -- Apple Inc. and Google said they are putting stronger privacy protections in their upcoming contact-tracing tool for Covid-19. Bloomberg's Mark Gurm...", "url": "https://www.youtube.com/watch?v=woKQVFKc4Tw", "urlToImage": null, "publishedAt": "2020-04-25T12:35:09Z", "content": null}, {"source": {"id": null, "name": "Cnbctv18.com"}, "author": null, "title": "Lockdown: Godrej Group urges govt to include mosquito repellents in essential items list - CNBCTV18", "description": "In March, the World Health Organization (WHO) also issued an advisory urging countries to ensure the continuity of malaria services in the context of the COVID-19 pandemic, the statement saidGet latest Business online at cnbctv18.com", "url": "https://www.cnbctv18.com/business/lockdown-godrej-group-urges-govt-to-include-mosquito-repellents-in-essential-items-list-5775731.htm/", "urlToImage": null, "publishedAt": "2020-04-25T12:23:02Z", "content": "The Godrej Group on Saturday urged the government to include mosquito repellents and other similar products in the essential items list during the ongoing lockdown.\r\nAs a trend, malaria and dengue spike during May running up to August and preparation for the … [+1509 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Central team suggests stricter implementation of lockdown in North Bengal - Times of India", "description": "India News: A central team visiting north Bengal to assess the Covid-19 situation wrote to the West Bengal government on Saturday, suggesting stricter implementat", "url": "https://timesofindia.indiatimes.com/india/central-team-suggests-stricter-implementation-of-lockdown-in-north-bengal/articleshow/75374512.cms", "urlToImage": null, "publishedAt": "2020-04-25T12:05:45Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Mumbai, Pune lockdown may be extended till 18 May: State health minister - India Gone Viral", "description": "Home > News > India > Mumbai, Pune lockdown may be extended till 18 May: State health minister On 21 April, Maharashtra government reinstated a full lockdown in the Mumbai Metropolitan Region and the", "url": "https://indiagoneviral.com/news/2020/04/25/mumbai-pune-lockdown-may-be-extended-till-18-may-state-health-minister/42102/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T11:05:38Z", "content": "MUMBAI: The nationwide lockdown may be lifted on 4 May, but Mumbai and Pune are likely to extend the curbs till 18 May as covid-19 cases continue to rise in the two cities, Maharashtra health minister Rajesh Tope told Mint on Saturday.The main objective of im… [+4707 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Darren Allan", "title": "AMD Cezanne leak hints at next-gen laptop CPUs with RDNA 2 graphics that go for Intel’s jugular - TechRadar India", "description": "Zen 3 APUs with RDNA 2-powered integrated graphics, rumor has it", "url": "https://www.techradar.com/news/amd-cezanne-leak-hints-at-next-gen-laptop-cpus-with-rdna-2-graphics-that-go-for-intels-jugular", "urlToImage": null, "publishedAt": "2020-04-25T10:54:00Z", "content": "AMD Ryzen 4000 (codenamed Renoir) mobile chips are still very much fresh on the scene and making a huge impact in terms of competitiveness in the laptop world but weve already seen a leak for next-gen APUs apparently codenamed Cezanne (a name which has been d… [+2934 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "‘If You Need Money Then You Should Stop Activities At The Border’: Kapil Dev - Swarajya", "description": "", "url": "https://swarajyamag.com/insta/if-you-need-money-then-you-should-stop-activities-at-the-border-kapil-dev", "urlToImage": null, "publishedAt": "2020-04-25T10:36:52Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "'No Evidence that Recovered Covid-19 Patients Cannot be Reinfected': WHO Warns Against 'Immunity Passport... - News18", "description": "The practice could actually increase the risks of continued spread as people who have recovered may ignore advice about taking standard precautions against the virus, the WHO said.", "url": "https://www.news18.com/news/world/no-evidence-that-recovered-covid-19-patients-cannot-be-reinfected-who-warns-govts-against-immunity-passports-2592409.html", "urlToImage": null, "publishedAt": "2020-04-25T10:36:34Z", "content": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nIn a scientific brief, the United Nations agency w… [+1650 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Akshay Tritiya 2020: Jewellers giving discounts to lure customers on digital purchase - here are some offers - Moneycontrol", "description": "Experts see gold prices touching Rs 53,000-55000 per 10 gram by next Akshay Tritiya.", "url": "https://www.moneycontrol.com/news/business/akshay-tritiya-2020-jewellers-giving-discounts-to-lure-customers-on-digital-purchase-here-are-some-offers-5189151.html", "urlToImage": null, "publishedAt": "2020-04-25T10:31:13Z", "content": "This year though the traditional form of buying physical gold jewellery or coins on Akshay Tritiya is no longer an avenue for people where they can to go and shop due to current national lockdown imposed due to coronavirus outbreak.\r\nKumar Jain, Vice Presiden… [+5612 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Cosmic Reef: NASA release an image of a blazing starbirth to mark Hubble's 30th birthday - Firstpost", "description": "Hubble has been placed in space to observe the most distant stars and galaxies, as well as planets in our solar system.", "url": "https://www.firstpost.com/tech/science/cosmic-reef-nasa-release-an-image-of-a-blazing-starbirth-to-mark-hubbles-30th-birthday-8299671.html", "urlToImage": null, "publishedAt": "2020-04-25T10:23:08Z", "content": "FP TrendingApr 25, 2020 16:24:11 IST\r\nThe US space agency has released a new bright picture of a firestorm of starbirth to mark the 30th anniversary of the Hubble Space Telescope. Scientists have called the picture Cosmic Reef, as it resembles a coral reef fl… [+1921 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Neil Borate", "title": "Franklin Templeton marks down its Fund-of-Fund Schemes by 50% - Livemint", "description": "Franklin Templeton Mutual Fund has six such FoFs which saw sharp declines on account of their holding of the 6 Franklin debt schemes which are being wound up", "url": "https://www.livemint.com/money/personal-finance/franklin-templeton-marks-down-its-fund-of-fund-schemes-by-50-11587808234050.html", "urlToImage": null, "publishedAt": "2020-04-25T10:15:28Z", "content": "Franklin Templeton Mutual Fund has marked down its Fund-of-Fund (FoF) exposure to the debt funds being wound up by 50%. A senior executive at the AMC who declined to be named said this was the decision of an internal valuation committee. A Fund of Funds (FoF)… [+2545 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Murali Krishnan", "title": "Rajasthan HC objects to lawyer appearing in vest through video conferencing - Hindustan Times", "description": "The HC said that the Advocates Act stipulates lawyers to appear before the court in the prescribed dress code and the decorum should be maintained even when it is functioning through a virtual medium.", "url": "https://www.hindustantimes.com/india-news/rajasthan-hc-objects-to-lawyer-appearing-in-vest-through-video-conferencing/story-jMCkE0PBdCNsavVCPYORlL.html", "urlToImage": null, "publishedAt": "2020-04-25T10:08:00Z", "content": "Lawyers must be dressed in proper uniform when they appear before the court via video-conferencing, the Rajasthan high court (HC) observed on Friday taking exception to an advocate, who was found wearing a banian (vest) during a hearing of a bail plea.\r\nThe H… [+2246 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Suraksha P", "title": "Will do whatever it takes to ensure that all of us come out of this, says recovered Bengaluru COVID-19 patient - Deccan Herald", "description": "Karnataka Medical Education Minister Dr K Sudhakar and Health Minister B Sriramulu symbolically launched the clinical trials for convalescent plasma therapy here on Saturday at Victoria Hospital in Bengaluru.  Two patients from the state who have recovered fr…", "url": "https://www.deccanherald.com/city/top-bengaluru-stories/will-do-whatever-it-takes-to-ensure-that-all-of-us-come-out-of-this-says-recovered-bengaluru-covid-19-patient-829762.html", "urlToImage": null, "publishedAt": "2020-04-25T10:07:38Z", "content": "Karnataka Medical Education Minister Dr K Sudhakar and Health Minister B Sriramulu symbolically launched the clinical trials for convalescent plasma therapy here on Saturday at Victoria Hospital in Bengaluru. \r\nTwo patients from the state who have recovered f… [+2654 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Covid-19: Without lockdown, India's cases would have been nearly 9X - Times of India", "description": "India News: When PM Modi announced a lockdown a month ago, there were around 500 Covid-19 cases in India. The average daily growth in cases was 21.6% on March 24,", "url": "https://timesofindia.indiatimes.com/india/without-lockdown-indias-cases-would-have-been-nearly-9x/articleshow/75369890.cms", "urlToImage": null, "publishedAt": "2020-04-25T09:33:22Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Milind Soman says Ankita Konwar was cool with his sex scenes in Four More Shots Please!: ‘She was actually... - Hindustan Times", "description": "Days after they celebrated their second wedding anniversary, Milind Soman talks about wife Ankita Konwar’s reaction to his intimate scenes in web series, Four More Shots Please!.", "url": "https://www.hindustantimes.com/bollywood/milind-soman-says-ankita-konwar-was-cool-with-his-sex-scenes-in-four-more-shots-please-she-was-actually-very-excited/story-XmiImsEdVfK5pmksvrTdyN.html", "urlToImage": null, "publishedAt": "2020-04-25T09:27:00Z", "content": "Actor Milind Soman has revealed wife Ankita Konwar was “very excited” about his sex scenes from the web series Four More Shots Please! which also featured him walking in underwear.\r\nMilind told Pinkvilla in an interview, “She was very cool with it (intimate s… [+1598 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "It’s official, WhatsApp will let you video call ‘privately’ with up to 8 people starting next week - The Financial Express", "description": "WhatsApp currently lets you video and voice call with up to four people.", "url": "https://www.financialexpress.com/industry/technology/its-official-whatsapp-will-soon-let-you-video-call-privately-with-up-to-8-people/1939448/", "urlToImage": null, "publishedAt": "2020-04-25T09:21:25Z", "content": "Facebook has confirmed that WhatsApp will soon let you video and voice call with up to eight people simultaneously, which is double the existing number of participants. The popular instant messaging platform currently lets you video and voice call with up to … [+2289 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Siddharth Iyer", "title": "Massive asteroid flying past Earth next week looks like its wearing a face mask - Republic World - Republic World", "description": "Arecibo Observatory in Puerto Rico recently shared an image of an asteroid that looked like it was wearing a 'face mask'. This image has now gone viral online.", "url": "https://www.republicworld.com/entertainment-news/whats-viral/viral-photo-of-face-mask-wearing-asteroid.html", "urlToImage": null, "publishedAt": "2020-04-25T09:06:02Z", "content": "Right now, the world is worried about the COVID-19 pandemic. In fact, people are so worried about the virus that even celestial bodies look like they are wearing face masks. Recently, Arecibo Observatory in Puerto Rico shared an image of a 1.5 kilometres wide… [+2126 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18.com", "title": "Shops in Neighbourhood Allowed, But Not in Market Complexes: What Can Open, What Can't - News18", "description": "With the Centre’s fresh guidelines, local shops selling both essential and non-essential goods can open for the first time in more than a month. The Ministry, however, said the new instructions will not apply to hotspots or containment zones in the country.", "url": "https://www.news18.com/news/india/shops-and-salons-in-neighbourhood-allowed-but-not-in-market-complexes-what-can-open-what-cant-2592081.html", "urlToImage": null, "publishedAt": "2020-04-25T09:04:00Z", "content": "New Delhi: In a midnight order, the union home ministry on Friday announced a new set of relaxations, allowing opening of neighbourhood and standalone shops, including those located in residential complexes.\r\nThe order comes as a big relief for small-scale tr… [+2837 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Anushka Sharma’s Small Gesture During Virat Kohli’s Live Chat Leaves Him Blushing, Watch Here - News18", "description": "Virat Kohli was having an Instagram Live session when his wife helped him by turning on the lights of the room.", "url": "https://www.news18.com/news/movies/anushka-sharmas-small-gesture-during-virat-kohlis-live-chat-leaves-him-blushing-watch-here-2592223.html", "urlToImage": null, "publishedAt": "2020-04-25T08:34:28Z", "content": "Lovebirds Anushka Sharma and Virat Kohli are spending the lockdown time together at their home. The duo is having quite fun in their day to day routine, making each day special for each other.\r\nThe Indian cricket team captain recently had a live chat session … [+1684 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Can someone go better than God, we'll wait and see: Brett Lee on Sachin Tendulkar - Times of India", "description": "Cricket News: Former Australia speedster Brett Lee believes Virat Kohli can surpass the extraordinary feat of \"god\" Sachin Tendulkar. \"But, how can you say someone", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/can-someone-go-better-than-god-well-wait-and-see-brett-lee-on-sachin-tendulkar/articleshow/75371307.cms", "urlToImage": null, "publishedAt": "2020-04-25T08:25:39Z", "content": "NEW DELHI: Former Australia speedster Brett Lee believes Virat Kohli can surpass the extraordinary feats of \"god\" Sachin Tendulkar.\r\n\"We are talking about phenomenal numbers here, so you mentioned seven to eight years of cricket and at the rate he (Virat Kohl… [+2009 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jamie Mullick", "title": "The state of States: What numbers show a month after Covid-19 lockdown - Hindustan Times", "description": "With over 6,400 cases and 283 deaths as of April 23, Maharashtra remains the worst-hit state in the country by a large margin.", "url": "https://www.hindustantimes.com/india-news/the-state-of-states-what-numbers-show-a-month-after-covid-19-lockdown/story-g17EDRD1rClF6a4wWw9S3N.html", "urlToImage": null, "publishedAt": "2020-04-25T08:24:49Z", "content": "With over 500 cases of the coronavirus disease (Covid-19) and 11 deaths, the country was put under a complete lockdown on March 25, starting the country’s full-blown battle against the pandemic. At the end of the first month of the lockdown, we take a look at… [+2649 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Thahar Ja: Ajay Devgn gets teary-eyed as he urges people to stay home with new song, son Yug makes cameo. Watch - Hindustan Times", "description": "Ajay Devgn has released a new song titled Thahar Ja to encourage his fans to stay home amid coronavirus outbreak.", "url": "https://www.hindustantimes.com/bollywood/thahar-ja-ajay-devgn-gets-teary-eyed-as-he-urges-people-to-stay-home-with-new-song-son-yug-makes-cameo-watch/story-72ZuV33NjqBAq28PJaaPXN.html", "urlToImage": null, "publishedAt": "2020-04-25T08:14:04Z", "content": "Ajay Devgn has released a new song titled Thahar Ja through which he makes an emotional appeal to his fans to stay at home amid coronavirus lockdown. His son Yug also makes an appearance at the end of the music video. \r\nProduced by Ajay, the song has been sun… [+1800 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Akshay Kumar's Laxmmi Bomb To Skip Theatrical Release And Premiere on Disney+Hotstar? - News18", "description": "The global viral scare reportedly seems to persuade Bollywood filmmakers and producers to release their upcoming titles on OTT platforms rather than delaying them.", "url": "https://www.news18.com/news/movies/akshay-kumars-laxmmi-bomb-to-skip-theatrical-release-and-premiere-on-disneyhotstar-2592117.html", "urlToImage": null, "publishedAt": "2020-04-25T07:11:35Z", "content": "It's a dreadful time for the film industry as cinema halls across the world remain closed amid the coronavirus crisis. The global viral scare reportedly seems to persuade Bollywood filmmakers and producers to release their upcoming titles on OTT platforms rat… [+1773 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "China approves third COVID-19 vaccine for clinical trials - The Hindu", "description": "China has approved three coronavirus vaccines, including the one developed by Chinese military, the People’s Liberation Army (PLA) for clinical trials", "url": "https://www.thehindu.com/news/international/china-approves-third-covid-19-vaccine-for-clinical-trials/article31430243.ece", "urlToImage": null, "publishedAt": "2020-04-25T06:39:59Z", "content": "China has approved its third coronavirus vaccine for the second phase of clinical trials as it reported 12 new COVID-19 cases, taking the total number of infections in the country to 82,816.\r\nChina has approved three coronavirus vaccines, including the one de… [+3512 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "No Dearness Allowance hike freeze for Central Government Employees necessary: Manmohan Singh - The Financial Express", "description": "Dearness Allowance News: Manmohan Singh has said he believed that it was not necessary to impose hardships on government employees.", "url": "https://www.financialexpress.com/money/dearness-allowance-da-hike-for-central-government-employees-latest-new-7th-pay-commission-manmohan-singh/1939320/", "urlToImage": null, "publishedAt": "2020-04-25T06:26:04Z", "content": "Dearness Allowance Hike freeze for Central Government Employees Latest News: Former Prime Minister Manmohan Singh has said he believed that it was not necessary to impose hardships on government employees and armed forces by freezing Dearness Allowance and De… [+608 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Anuja", "title": "Freezing dearness allowance at this stage unnecessary: Manmohan Singh - Livemint", "description": "Congress on Saturday morning released a video sharing views of its senior leaders who are part of an internal consultative committee formed to deliberate on national issues", "url": "https://www.livemint.com/news/india/freezing-dearness-allowance-at-this-stage-unnecessary-manmohan-singh-11587793098288.html", "urlToImage": null, "publishedAt": "2020-04-25T05:58:04Z", "content": "NEW DELHI: Former prime minister Manmohan Singh has joined the chorus against the government's decision to freeze dearness allowance of its employees earlier this week, saying the the move was unnecessary at this stage.Congress on Saturday morning released a … [+2116 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Policy flip-flop on e-commerce: Preferential pricing to gain some market share has to be stopped in its... - Firstpost", "description": "The government's recent flip-flop on opening of e-commerce to the so-called “non-essential” goods is just one of the many such flip-flops that the Government of India has made in the last 15 years on policies relating to modernisation of India’s retail sector", "url": "https://www.firstpost.com/business/policy-flip-flop-on-e-commerce-preferential-pricing-to-gain-some-market-share-has-to-be-stopped-in-its-tracks8298581-8298581.html", "urlToImage": null, "publishedAt": "2020-04-25T05:23:11Z", "content": "Despite the expected sharp slowdown of Indias economy in March, it may have still clocked a GDP of about $ 3,000 billion for the year ending on 31 March 2020. Private consumption accounts for about 58 percent of the GDP (expected to be about $1,700 billion). … [+4684 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AFP", "title": "Virus toll nears 200,000 as UN pushes for global vaccine effort - Economic Times", "description": "Governments around the world are struggling to limit the economic devastation unleashed by the virus, which has infected nearly 2.8 million people and left half of humanity under some form of lockdown.", "url": "https://economictimes.indiatimes.com/news/international/world-news/virus-toll-nears-200000-as-un-pushes-for-global-vaccine-effort/articleshow/75369509.cms", "urlToImage": null, "publishedAt": "2020-04-25T05:06:29Z", "content": "The global coronavirus death toll approached 200,000 on Saturday as the United Nations launched an international push for a vaccine to defeat the pandemic.\r\nGovernments around the world are struggling to limit the economic devastation unleashed by the virus, … [+5028 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Reuters", "title": "China sent team including medical experts to advise on Kim Jong Un: Report - Hindustan Times", "description": "The trip by the Chinese doctors and officials comes amid conflicting reports about the health of the North Korean leader. Reuters was unable to immediately determine what the trip by the Chinese team signaled in terms of Kim’s health.", "url": "https://www.hindustantimes.com/world-news/china-sent-team-including-medical-experts-to-advise-on-kim-jung-un-report/story-ZpvisufvkwTehcKZhOAv0O.html", "urlToImage": null, "publishedAt": "2020-04-25T04:09:00Z", "content": "China has dispatched a team to North Korea including medical experts to advise on North Korean leader Kim Jong Un, according to three people familiar with the situation.\r\nThe trip by the Chinese doctors and officials comes amid conflicting reports about the h… [+4055 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Coronavirus update: India records 1,428 new Covid-19 cases, 57 deaths in last 24 hours - Hindustan Times", "description": "India’s tally of the coronavirus disease stands at 24,506—including 18,668 active cases, 5063 cured, discharged or migrated and 775 deaths, according to the health ministry’s dashboard at 8am.", "url": "https://www.hindustantimes.com/india-news/coronavirus-update-india-saw-1-428-new-covid-19-cases-57-deaths-in-24-hours/story-1HDsY7DdulUnZTwHJ4iY5I.html", "urlToImage": null, "publishedAt": "2020-04-25T03:49:00Z", "content": "There were 1,429 new cases of the coronavirus disease (Covid-19) and 57 deaths across the country in the last 24 hours, the Union home ministry said on Saturday, which marks a month since India was put under a nationwide lockdown.\r\nIndia’s tally of the corona… [+2257 chars]"}, {"source": {"id": null, "name": "Bollywoodlife.com"}, "author": "Nirali Kanabar", "title": "It's expensive: When Katrina Kaif splurged Rs. 92,000 to look gorgeous at rumoured ex-boyfriend, Salman Khan' - Bollywood Life", "description": "Today, we are taking you back to Salman Khan's grand birthday bash where Katrina Kaif grabbed eyeballs for all the right reasons.", "url": "https://www.bollywoodlife.com/style/its-expensive-when-katrina-kaif-splurged-rs-92000-to-look-gorgeous-at-rumoured-ex-boyfriend-salman-khans-birthday-bash-1611259/", "urlToImage": null, "publishedAt": "2020-04-25T03:47:56Z", "content": "There's a dearth of Bollywood events due to the coronavirus lockdown. We haven't seen pictures of our celebrities flaunting their fashion ka jalwa for the longest time now. Hence, we are revisiting the times they made head turns in public because of their sar… [+2226 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Matt Espineli", "title": "FF7 Remake Elemental Materia Guide: Where To Find This Essential Materia Orb - GameSpot", "description": "Here's how to get the only two Elemental Materia orbs available in FF7 Remake for PS4.", "url": "https://www.gamespot.com/articles/ff7-remake-elemental-materia-guide-where-to-find-t/1100-6476502/", "urlToImage": null, "publishedAt": "2020-04-25T03:26:00Z", "content": "In Final Fantasy 7 Remake, the Elemental Materia is one of the best Materia orbs you can get, as it can imbue either your weapons with elemental power and your armor with elemental defense. However, this Materia can be incredibly easy to miss if you're just g… [+2738 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "White House Could Alter Covid-19 Briefings to Limit Trump's Role After Uproar over Disinfectant Remark - News18", "description": "Trump's advisers have argued that while the briefings may appeal to his most loyal base of supporters, they could be alienating some viewers, including senior citizens worried about their health.", "url": "https://www.news18.com/news/world/white-house-could-alter-covid-19-briefings-to-limit-trumps-role-after-uproar-over-his-disinfectant-remarks-2591839.html", "urlToImage": null, "publishedAt": "2020-04-25T02:34:15Z", "content": "For the first time, President Donald Trump cut off his daily coronavirus task force briefing on Friday without taking any questions from reporters. It may not be the last time.\r\nThere have been discussions within the White House about changing the format of t… [+2465 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Karishma Mehrotra", "title": "Outbreak in seven states growing faster than national rate: IIT model - The Indian Express", "description": "From slowest to fastest, they are Jharkhand, Rajasthan, Maharashtra, Uttar Pradesh, Madhya Pradesh, West Bengal, and Gujarat.", "url": "https://indianexpress.com/article/india/outbreak-in-seven-states-growing-faster-than-national-rate-iit-model-6378191/", "urlToImage": null, "publishedAt": "2020-04-25T02:21:34Z", "content": "ITBP personnel wearing special dress patrol in old Delhi on Wednesday.Just as India completes a month of lockdown, the latest modeling by IIT Delhi researchers has found that the COVID-19 outbreak in seven states, which account for two-thirds of the total cas… [+3139 chars]"}, {"source": {"id": null, "name": "Gizbot.com"}, "author": "Sharmishte Datti", "title": "NASA VITAL Prototype Ventilators To Help Fight COVID-19 Pandemic - Gizbot", "description": "In a bid to help the coronavirus infected, NASA has announced that it has successfully developed a prototype ventilator for the treatment of coronavirus patients. For this, NASA has developed VITAL or the Ventilator Intervention Technology Accessible Locally.", "url": "https://www.gizbot.com/news/covid-19-pandemic-nasa-builds-prototype-ventilators-067269.html", "urlToImage": null, "publishedAt": "2020-04-25T02:00:00Z", "content": "In a bid to help the coronavirus infected, NASA has announced that it has successfully developed a prototype ventilator for the treatment of coronavirus patients. For this, NASA has developed VITAL or the Ventilator Intervention Technology Accessible Locally.… [+2604 chars]"}, {"source": {"id": null, "name": "Arunachaltimes.in"}, "author": null, "title": "Fight against malaria could be set back 20 years, WHO warns - The Arunachal Times", "description": null, "url": "https://arunachaltimes.in/index.php/2020/04/25/fight-against-malaria-could-be-set-back-20-years-who-warns/", "urlToImage": null, "publishedAt": "2020-04-24T18:08:00Z", "content": "Cape Town, Apr 24 (AP) One of the hard lessons the World Health Organization learned during the Ebola outbreak in West Africa was this: Other diseases can be forgotten and take a deadlier toll.The WHO is now warning that the battle against malaria in sub-Saha… [+2802 chars]"}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "First-ever digital geological map of moon released by US Geological Survey - Down To Earth Magazine", "description": "It will serve as a blue print for future human lunar missions", "url": "https://www.downtoearth.org.in/news/science-technology/first-ever-digital-geological-map-of-moon-released-by-us-geological-survey-70690", "urlToImage": null, "publishedAt": "2020-04-24T15:59:01Z", "content": "The first ever digital, unified, global, geological map of the moon was released virtually by the  United States Geological Survey (USGS), National Aeronautics and Space Administration (Nasa) and the Lunar Planetary Institute on April 22, 2020.\r\nThe map is a … [+2958 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Keane sees 'long way back' for Man Utd & remains unconvinced by Shaw - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T14:54:00Z", "content": "More"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Sensex plummets 536 points to close at 31,327; Nifty ends at 9,154 - Times of India", "description": "India Business News: Equity indices plunged on Friday with the benchmark BSE Sensex falling over 500 points, dragged by financial, banking and IT stocks amid weak global c", "url": "https://timesofindia.indiatimes.com/business/india-business/sensex-tanks-over-550-points-as-banking-financial-stocks-fall-nifty-below-9200/articleshow/75340794.cms", "urlToImage": null, "publishedAt": "2020-04-24T12:37:21Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}]}