{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "News18.com"}, "author": "News18 Staff", "title": "Coronavirus Pandemic LIVE Updates: 1,975 New Cases, 47 Deaths in Last 24 Hours, Total Infections Rise to 26,917 - News18", "description": "Coronavirus Pandemic LIVE Updates: The Delhi government would not allow any more relaxation in the ongoing lockdown than those permitted by the Union home ministry, Chief Minister Arvind Kejriwal said today and stressed on bringing down the number of Covid-19…", "url": "https://www.news18.com/news/india/coronavirus-pandemic-live-updates-maharashtra-us-mumbai-gujarat-india-cases-deaths-andhra-pradesh-tips-vaccine-2592927.html", "urlToImage": null, "publishedAt": "2020-04-26T12:35:31Z", "content": "India's total Covid-19 cases crossed the 26,000-mark today, with the death toll jumping to 824. Of the total 26,496 cases, 19,868 are active while 5,803 have been cured. The figures come amid a stringent lockdown in the country till May 3 to arrest the spread… [+3395 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Covid-19 cases in Wuhan hospitals drop to zero for 1st time - Times of India", "description": "China News: The last patient in Wuhan was cured on Friday, reducing the number of coronavirus patients in the city to zero, said a spokesperson for China's Nation", "url": "https://timesofindia.indiatimes.com/world/china/covid-19-cases-in-wuhan-hospitals-drop-to-zero-for-1st-time/articleshow/75390046.cms", "urlToImage": null, "publishedAt": "2020-04-26T12:08:20Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "Gurgaon MNCs may have to work from home till July end, some real estate projects can resume work: Official - Livemint", "description": "Gurgaon has effectively been under lockdown since March 22 – two days before Prime Minister Narendra Modi’s announcement of a pan-India shutdown.Gurgaon, which is part of the National Capital Region, is known as the millennium city and is home to many BPOs, M…", "url": "https://www.livemint.com/news/india/gurgaon-mncs-may-have-to-work-from-home-till-july-end-some-real-estate-projects-can-resume-work-official-11587901006967.html", "urlToImage": null, "publishedAt": "2020-04-26T11:44:26Z", "content": "GURGAON :\r\nMNCs, BPOs and IT enabled services (ITES) in Gurgaon may have to allow their employees to work from home till the end of July, says Gurgaon Metropolitan Development Authority CEO V S Kundu.Kundu, who is also additional chief secretary of Haryana, a… [+3073 chars]"}, {"source": {"id": null, "name": "Weforum.org"}, "author": "Stephanie Nebehay", "title": "WHO warns COVID-19 patients could be infected again - World Economic Forum", "description": "The World Health Organization advises countries against issuing “immunity passports” or “risk-free certificates” to people who have been infected.", "url": "https://www.weforum.org/agenda/2020/04/no-evidence-that-recovered-covid-19-patients-cannot-be-reinfected-who/", "urlToImage": null, "publishedAt": "2020-04-26T11:38:09Z", "content": "<ul><li>People who have recovered from COVID-19 still need to take precautions to prevent re-infection</li><li>Some countries have handed out health passports to people who have recovered from the illness</li><li>There are now 2.9 million cases of coronavirus… [+1994 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Jayshree P. Upadhyay, Gopika Gopakumar", "title": "Mutual funds scramble to contain Franklin impact, to seek RBI’s intervention - Livemint", "description": "While a majority of fund houses say that the debt schemes are fairly liquid at this point but could get difficult in coming weeks if lockdown is not lifted.To meet the liquidity needs of mutual funds, RBI has allowed banks to avail of cheap funding under the …", "url": "https://www.livemint.com/mutual-fund/mf-news/mutual-funds-scramble-to-contain-franklin-impact-to-seek-rbi-s-intervention-11587900606693.html", "urlToImage": null, "publishedAt": "2020-04-26T11:37:11Z", "content": "To contain the impact of redemption related stress, mutual fund houses are marking down bad investments, seeking bank loans and a liquidity intervention from Reserve Bank of Indias (RBI) as the lender of last resort.Due to redemption pressure, Franklin Temple… [+5149 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "Prolonged lockdown may push millions into margins of subsistence: Ex-RBI governor Subbarao - Hindustan Times", "description": "Subbarao said that as predicted by analysts, India will have a V shaped recovery which is far better than most of the other countries.", "url": "https://www.hindustantimes.com/india-news/prolonged-lockdown-may-push-millions-into-margins-of-subsistence-ex-rbi-governor-subbarao/story-C6bfvVBUI0kEiAaNIh6iOK.html", "urlToImage": null, "publishedAt": "2020-04-26T11:37:00Z", "content": "A prolonged lockdown may possibly push million of Indians into the “margins of subsistence”, former RBI Governor Duvvuri Subba Rao said on Sunday while expecting a V curved recovery once the Covid-19 crisis ends and the turnaround in India to be faster than s… [+2384 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Step inside Taapsee Pannu’s house in Mumbai, actor recalls how she made it home. Watch video - Hindustan Times", "description": "Taapsee Pannu, who has been sharing throwback pictures and videos, on Saturday, shared her experience about moving into her own apartment in Mumbai.", "url": "https://www.hindustantimes.com/bollywood/step-inside-taapsee-pannu-s-house-in-mumbai-actor-recalls-how-she-made-it-home-watch-video/story-oZ90qWQm4Um1TJOysIRiQI.html", "urlToImage": null, "publishedAt": "2020-04-26T11:02:24Z", "content": "Actor Taapsee Pannu has been sharing throwback images and videos, making her journey as an outsider in Bollywood. Her latest is about when she bought her flat in Mumbai and made it her own.\r\nSharing a picture, she wrote how the process coincided with her shoo… [+3591 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Sports in times of COVID-19: Top Indian stars foresee new normal once pandemic mayhem ends - Times of India", "description": "More sports News: Will sports and watching sports ever be the same again in a world scarred by the COVID-19 pandemic? India's sportspersons -- current and former -- gaz", "url": "https://timesofindia.indiatimes.com/sports/more-sports/others/sports-in-times-of-covid-19-top-indian-stars-foresee-new-normal-once-pandemic-mayhem-ends/articleshow/75388631.cms", "urlToImage": null, "publishedAt": "2020-04-26T10:26:04Z", "content": "NEW DELHI: Will the fans rush back? Will training abroad be as hassle-free as it used to be? What about contact sports where social distancing can't really be practised?\r\nIn a nutshell, will sports and watching sports ever be the same again in a world scarred… [+6513 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "MS Dhoni always takes responsibility when team loses, says Mohit Sharma - Times of India", "description": "Cricket News: He has played most of his cricket under MS Dhoni and pacer Mohit Sharma says the revered former India skipper is a true leader who does not back off w", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/ms-dhoni-always-takes-responsibility-when-team-loses-says-mohit-sharma/articleshow/75388665.cms", "urlToImage": null, "publishedAt": "2020-04-26T10:26:03Z", "content": "NEW DELHI: He has played most of his cricket under MS Dhoni and pacer Mohit Sharma says the revered former India skipper is a true leader who does not back off when it comes to taking responsibility in challenging times.\r\nThe 31-year-old pacer has played unde… [+2580 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "PM to interact with CMs on Monday to discuss way out of lockdown, Covid fight - Times of India", "description": "India News: PM Modi will interact with chief ministers via video conference on Monday morning on the way ahead in the fight against the coronavirus, amid indicati", "url": "https://timesofindia.indiatimes.com/india/pm-to-interact-with-cms-on-monday-to-discuss-way-out-of-lockdown-covid-fight/articleshow/75389416.cms", "urlToImage": null, "publishedAt": "2020-04-26T10:16:39Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Irrfan Khan loses his mother; his friends dont know where he is - Bollywood Hungama", "description": "Irrfan Khan loses his mother; his friends don’t know where he is. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/bollywood/irrfan-khan-loses-mother-friends-dont-know/", "urlToImage": null, "publishedAt": "2020-04-26T10:14:06Z", "content": "Apparently he has flown back to the UK for treatment after the completion of Angrezi Medium. But what kind of medical attention could Irrfan be getting during these times of the Coronavirus? More importantly, being unwell himself how has Irrfan taken this ber… [+439 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "New York Times", "title": "Coronavirus antibody tests: Can you trust the results? - Times of India", "description": "The researchers worked around the clock, in shifts of three to five hours, hoping to stave off weariness and keep t", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-antibody-tests-can-you-trust-the-results/articleshow/75387833.cms", "urlToImage": null, "publishedAt": "2020-04-26T10:11:40Z", "content": "The researchers worked around the clock, in shifts of three to five hours, hoping to stave off weariness and keep their minds sharp for the delicate task.\r\nThey set up lines of laboratory volunteers: medical residents, postdoctoral students, even experienced … [+11078 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Reuters", "title": "Focus turns to Kim Yo Jong as mystery intensifies over Kim Jong Un’s health - Hindustan Times", "description": "South Korean and Chinese officials on Tuesday cast doubt on reports that Kim was gravely ill following a cardiovascular procedure, after his absence from a key state anniversary event triggered speculation about his health.", "url": "https://www.hindustantimes.com/world-news/focus-turns-to-kim-yo-jong-as-mystery-intensifies-over-kim-jong-un-s-health/story-Jn6OKliLN8z9nkjdKd918M.html", "urlToImage": null, "publishedAt": "2020-04-26T10:08:38Z", "content": "North Korea has never publicised who would follow leader Kim Jong Un in the event he is incapacitated, and with no details known about his young children, analysts say his sister and loyalists could form a regency until a successor is old enough to take over.… [+4599 chars]"}, {"source": {"id": null, "name": "Bostonherald.com"}, "author": "Joe Dwinell", "title": "MIT team races to perfect cellphone tracing of coronavirus - Boston Herald", "description": "MIT scientists are racing to harness Bluetooth technology to boost contact tracing of the coronavirus. This revolution in cellphone technology is being launched in Massachusetts, with MIT’s L…", "url": "https://www.bostonherald.com/2020/04/26/mit-team-races-to-perfect-cellphone-tracing-of-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-26T10:01:35Z", "content": "The smartphone could help the world get back to work.\r\nMIT’s Daniel J. Weitzner Courtesy MIT\r\nMIT scientists are racing to harness Bluetooth technology to boost contact tracing of the coronavirus. This revolution in cellphone technology is being launched in M… [+3625 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Bloomberg", "title": "Reliance starts WhatsApp-based online shopping portal during COVID-19 lockdown - Deccan Herald", "description": "Reliance Industries Ltd. started testing its online shopping portal three days after Facebook Inc. said it will invest $5.7 billion in digital assets controlled by billionaire Mukesh Ambani.", "url": "https://www.deccanherald.com/business/business-news/reliance-starts-whatsapp-based-online-shopping-portal-during-covid-19-lockdown-830082.html", "urlToImage": null, "publishedAt": "2020-04-26T09:54:54Z", "content": "By P R Sanjai\r\nReliance Industries Ltd. started testing its online shopping portal three days after Facebook Inc. said it will invest $5.7 billion in digital assets controlled by billionaire Mukesh Ambani.\r\nFollow latest updates on the COVID-19 pandemic here\r… [+1706 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Funding coronavirus fight: Tax officers suggest 40% tax on super-rich, higher levy on foreign cos - Economic Times", "description": "Tax officers have suggested a 40% tax on super-rich as well as higher levy on foreign companies.", "url": "https://economictimes.indiatimes.com/news/economy/policy/funding-coronavirus-fight-tax-officers-suggest-40-tax-on-super-rich-higher-levy-on-foreign-cos/articleshow/75389146.cms", "urlToImage": null, "publishedAt": "2020-04-26T09:44:30Z", "content": "MUMBAI: A group of senior \r\ntaxofficers has suggested a \r\nsuper-\r\nrichtax and a \r\nhigherlevyonforeign companies to keep the cash till running as part of short term measures to help the government fight the \r\ncoronavirus pandemic.\r\nThe suggestions are part of … [+2323 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus state-wise tally April 26: Confirmed COVID-19 cases in Maharashtra surge past 7,600 - Moneycontrol", "description": "With 7,628 COVID-19 cases, Maharashtra has reported the highest number of infections, followed by Gujarat (3,071) and Delhi (2,625).", "url": "https://www.moneycontrol.com/news/india/coronavirus-cases-death-count-state-wise-tally-april-26-latest-news-today-maharashtra-most-affected-5190071.html", "urlToImage": null, "publishedAt": "2020-04-26T09:38:04Z", "content": "India has recorded 26,917 cases of the novel coronavirus and 826 deaths, according to the Union Health Ministry's latest update.\r\nOf these, 20,177 are active cases while 5,913 have been cured or discharged.\r\nThe data was updated at 5.00 pm on April 26 on the … [+3398 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘Clear bottlenecks, ramp up Covid-19 testing’: Rahul Gandhi tells PM in tweet - Hindustan Times", "description": "Rahul Gandhi is a part of an 11-member consultative group formed by Congress president Sonia Gandhi to deliberate on matters related to Covid-19 pandemic and formulate the party’s views on them.", "url": "https://www.hindustantimes.com/india-news/clear-bottlenecks-ramp-up-covid-19-testing-rahul-gandhi-tells-pm-in-tweet/story-UrhDODinvpTcOgIBYDS5LK.html", "urlToImage": null, "publishedAt": "2020-04-26T09:34:00Z", "content": "Congress leader Rahul Gandhi has said that India has not been able to scale up its testing for coronavirus disease Covid-19 due to bottlenecks and urged Prime Minister Narendra Modi to clear the same.\r\n“Experts agree that mass random testing is the key to bea… [+2195 chars]"}, {"source": {"id": null, "name": "Indianweb2.com"}, "author": "Vardaan", "title": "An Asteroid \"Coming Near Earth\" Looks Like It's Wearing A Face Mask - IndianWeb2.com", "description": "", "url": "https://www.indianweb2.com/2020/04/26/an-asteroid-coming-near-earth-looks-like-its-wearing-a-face-mask/", "urlToImage": null, "publishedAt": "2020-04-26T09:21:47Z", "content": "The Arecibo Observatory, a radio telescope in Puerto Rico, is tracking an asteroid which is approaching Earth this week and while it poses no threat, the asteroid somehow appears to know this planet of humans is facing a pandemic.\r\nThe University of Central F… [+1510 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Covid-19: Apple, Google to shut down the coronavirus tracker once it is contained - Hindustan Times", "description": "The document clearly mentions that “Google and Apple can disable the exposure notification system on a regional basis when it is no longer needed.”", "url": "https://www.hindustantimes.com/tech/covid-19-apple-google-to-shut-down-the-coronavirus-tracker-once-it-is-contained/story-EpyL70qsPuJdxQnZsNim2I.html", "urlToImage": null, "publishedAt": "2020-04-26T08:56:47Z", "content": "While Apple and Google are working on using your smartphone’s Bluetooth and location tracking to determine Covid-19 effected people around you, they will also be turning off this tech once the disease is contained. This has been mentioned in the ‘Frequently A… [+1716 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Will Tell TikTok to Block You because You're Annoying: Chris Gayle Trolls Yuzvendra Chahal - News18", "description": "Gayle referred to Chahal as 'annoying' and went on to the extent of saying that he is going to block him.", "url": "https://www.news18.com/news/buzz/will-tell-tiktok-to-block-you-because-youre-annoying-chris-gayle-trolls-yuzvendra-chahal-2593275.html", "urlToImage": null, "publishedAt": "2020-04-26T08:34:30Z", "content": "West Indies batsman Chris Gayle brutally roasted India spinner Yuzvendra Chahal for his social media posts during a live session on popular social media platform Instagram. With no cricket going due to coronavirus pandemic, players are engaging with fans thes… [+1055 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Delhi will implement Centre’s guidelines on reopening of shops, says Kejriwal - Hindustan Times", "description": "Addressing a press briefing through video, Arvind Kejriwal said his government will implement the Centre’s guidelines on the opening of neighbourhood and standalone shops during the lockdown till May 3 in the national capital.", "url": "https://www.hindustantimes.com/india-news/covid-19-update-delhi-will-implement-centre-s-guidelines-on-reopening-of-shops-says-cm-arvind-kejriwal/story-CK7sRV8MH0o0e7swOshLXN.html", "urlToImage": null, "publishedAt": "2020-04-26T07:58:04Z", "content": "Delhi chief minister Arvind Kejriwal on Sunday presented data on the coronavirus disease (Covid-19) cases in the national capital to say his government will not allow any more relaxation in rules during the ongoing lockdown than those permitted by the Union m… [+2541 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Bloomberg", "title": "Covid-19: UK PM Boris Johnson to be back at work on Monday a month - Hindustan Times", "description": "The government has been without a leader since the prime minister was admitted to the hospital on April 5.", "url": "https://www.hindustantimes.com/world-news/uk-pm-boris-johnson-will-be-back-at-work-on-monday-report/story-oDeI7t1kZot0LlaacVYl9I.html", "urlToImage": null, "publishedAt": "2020-04-26T07:29:00Z", "content": "Boris Johnson will return to work on Monday and take charge of the U.K.’s handling of the pandemic, a month after he was struck down by the coronavirus.\r\nThe government has been without a leader since the prime minister was admitted to the hospital on April 5… [+1617 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Centre issues guidelines on use of AC, coolers, fans amid coronavirus COVID-19 outbreak - Zee News", "description": "As the temperatures conitnues to rise in the country, people need to switch on their air conditioners (AC) and dessert coolers to get some respite from the blistering heat. However, there have been several concerns over the use of ACs and coolers amid the cor…", "url": "https://zeenews.india.com/india/centre-issues-guidelines-on-use-of-ac-coolers-fans-amid-coronavirus-covid-19-outbreak-2279137.html", "urlToImage": null, "publishedAt": "2020-04-26T06:27:36Z", "content": "As the temperatures conitnues to rise in the country, people need to switch on their air conditioners (AC) and dessert coolers to get some respite from the blistering heat. However, there have been several concerns over the use of ACs and coolers amid the cor… [+2198 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Longjam Dineshwori", "title": "Prescriptions for antidepressants and anti-anxiety drugs surge amidst COVID-19 pandemic - TheHealthSite", "description": "According to a report prescriptions of anti-anxiety medications rose by 34.1% between mid-February and mid-March in the US.", "url": "https://www.thehealthsite.com/news/prescriptions-for-antidepressants-and-anti-anxiety-drugs-surge-amidst-covid-19-pandemic-741891/", "urlToImage": null, "publishedAt": "2020-04-26T06:06:59Z", "content": "Stress about health, finances and uncertainty about the future amidst the COVID-19 pandemic is taking a serious toll on the mental health of people worldwide. In India, there has been a massive spike in patients with mental illness since the coronavirus outbr… [+4292 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Buy gold via these 3 avenues on Akshaya Tritiya as COVID-19 makes physical buying difficult - Moneycontrol.com", "description": "Allocation to gold is more a tactical one wherein the weightage should further increase in case of any uncertainties to the economy.", "url": "https://www.moneycontrol.com/news/business/markets/buy-gold-via-these-3-avenues-on-akshaya-tritiya-as-covid-19-makes-physical-buying-difficult-5190111.html", "urlToImage": null, "publishedAt": "2020-04-26T05:45:00Z", "content": "Tushar Bopche\r\nGold has a deep-rooted significance in Indian history. People in the country are used to buying gold on auspicious occasions like festivals, marriage, child-birth, etc. Gold has extraordinary power which attracts Indians at a different level.\r\n… [+4748 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Priyanka Chopra Jonas wears a saree at home as she poses for a romantic picture with hubby Nick Jonas ami - Times of India", "description": "Lockdown has given ample time to our B-town celebrities to spend quality time with their loved ones. Every day we g", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/priyanka-chopra-jonas-wears-a-saree-at-home-as-she-poses-for-a-romantic-picture-with-hubby-nick-jonas-amid-the-lockdown/articleshow/75386442.cms", "urlToImage": null, "publishedAt": "2020-04-26T05:05:00Z", "content": null}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Sandhya Ramesh", "title": "Rising CO2 emissions could change the way human brains work, study says - ThePrint", "description": "ScientiFix, our weekly feature, offers you a summary of the top global science stories of the week, with links to their sources.", "url": "https://theprint.in/scientifix/rising-co2-emissions-could-change-the-way-human-brains-work-study-says/409011/", "urlToImage": null, "publishedAt": "2020-04-26T04:45:46Z", "content": "Rising CO2 emissions could affect decision-making in humans\r\nResearchers at the University of Colorado at Boulder have suggested that rising carbon dioxide (CO2) levels could eventually alter basic decision-making skills in humans. Due to fossil-fuel producti… [+2300 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "The 20 minutes that broke the US oil market - Economic Times", "description": "The fossil fuel that helped to build the modern world, was now not an asset but a liability.", "url": "https://economictimes.indiatimes.com/markets/commodities/news/the-20-minutes-that-broke-the-us-oil-market/articleshow/75385758.cms", "urlToImage": null, "publishedAt": "2020-04-26T04:02:00Z", "content": "It was evident from the very beginning on April 20 that the oil market was headed for trouble.\r\nFrantic sell orders had been pouring in overnight and any traders who connected to the Nymex platform that morning could see a bloodbath was coming. By 7 a.m. in N… [+11240 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Saudi Arabia bans flogging as form of punishment, convicts to be handed jail sentences and fines instead - Firstpost", "description": "Saudi Arabia is ending flogging as a form of punishment, according to a document from the kingdom’s top court seen by Reuters", "url": "https://www.firstpost.com/world/saudi-arabia-bans-flogging-as-form-of-punishment-convicts-to-be-handed-jail-sentences-and-fines-instead-8298111.html", "urlToImage": null, "publishedAt": "2020-04-26T03:39:27Z", "content": "Riyadh: Saudi Arabia is ending flogging as a form of punishment, according to a document from the kingdoms top court seen by Reuters on Friday.\r\nFile image of Saudi Arabia's Crown Prince Mohammad bin Salman. AP\r\nThe decision by the General Commission for the … [+1590 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Rasesh Mandani", "title": "Bailout plan: Play more matches with India - Hindustan Times", "description": "Later this year, the new Future Tours Programme (FTP) for the years 2023-2031 will be finalised; the ICC continues to be heavily dependent on the BCCI for revenue.", "url": "https://www.hindustantimes.com/cricket/bailout-plan-play-more-matches-with-india/story-VRqndyDqK1aBAy0bT21qoO.html", "urlToImage": null, "publishedAt": "2020-04-26T02:57:47Z", "content": "The Board of Control for Cricket in India (BCCI), the richest body in world cricket, has come up with a plan to help countries facing losses due to the cancellation of cricket worldwide -- although the idea is contingent on games resuming.\r\nAccording to BCCI … [+4642 chars]"}, {"source": {"id": null, "name": "Theweek.in"}, "author": null, "title": "Ozone layer hole over Arctic closes, confirm scientists - THE WEEK", "description": "Scientists said the hole over the Arctic, noticed in March this year, has healed", "url": "https://www.theweek.in/news/sci-tech/2020/04/26/ozone-layer-hole-over-arctic-closes-confirm-scientists.html", "urlToImage": null, "publishedAt": "2020-04-25T22:52:00Z", "content": "The largest hole in the Ozone layer above the Arctic caused due to the unusual atmospheric conditions has closed, as per reports. The hole was first identified by scientists in March this year.\r\nThe Copernicus Climate Change Service (C3S) and Copernicus Atmos… [+1417 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "Android 11 DP3 adds new sensitivity options for gesture navigation - Android Police", "description": "Google was changing Android 10's full-screen gesture navigation all the way up to release, and you could definitely make the argument that there were", "url": "https://www.androidpolice.com/2020/04/25/android-11-dp3-adds-new-sensitivity-options-for-gesture-navigation/", "urlToImage": null, "publishedAt": "2020-04-25T18:49:39Z", "content": "Google was changing Android 10's full-screen gesture navigation all the way up to release, and you could definitely make the argument that there were still unresolved issues I still frequently go back when I'm trying to open an app's side menu. Thankfully, th… [+740 chars]"}, {"source": {"id": null, "name": "Telugucinema.com"}, "author": "tc editor", "title": "Pic: Naga Chaitanya's quarantine look - Telugu Cinema", "description": "Naga Chaitanya and his wife Samantha have been kept themselves during this lockdown period. They have cut down posts on social media as well. After being silent on social media for more than two weeks, Samantha is now sharing a pic or two.  She now posted a n…", "url": "https://www.telugucinema.com/news/pic-naga-chaitanyas-quarantine-look", "urlToImage": null, "publishedAt": "2020-04-25T18:33:09Z", "content": "Naga Chaitanya and his wife Samantha have been kept themselves during this lockdown period. They have cut down posts on social media as well. After being silent on social media for more than two weeks, Samantha is now sharing a pic or two. \r\nShe now posted a … [+642 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Mumbai cop succumbs to coronavirus, 95 other cops infected in Maharashtra - Hindustan Times", "description": "Pendurkar was posted at Vakola Police Station at Santacruz East.", "url": "https://www.hindustantimes.com/india-news/mumbai-cop-succumbs-to-coronavirus-95-other-cops-infected-in-maharashtra/story-wVjQKbMX15rU8Rn92Pa1iL.html", "urlToImage": null, "publishedAt": "2020-04-25T18:29:10Z", "content": "A head constable with Mumbai police, Chandrakant Ganapat Pendurkar, succumbed to coronavirus on Saturday, said Mumbai police.\r\n57-year-old Pendurkar had been battling the disease for the past few days after testing positive. Pendurkar, is the first cop in Mum… [+1359 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": "Team Newsable", "title": "2 COVID-19 patients released by mistake due to name confusion in Uttar Pradesh - Asianet News English", "description": "A confusion due to similar names led to the release of two COVID-19 positive patients from quarantine. The error was later rectified.", "url": "https://newsable.asianetnews.com/india/2-covid-19-patients-released-by-mistake-due-to-name-confusion-in-uttar-pradesh-q9cfuk", "urlToImage": null, "publishedAt": "2020-04-25T12:27:50Z", "content": "Moradabad: A shocking incident has emerged from Moradabad amidst the coronavirus pandemic. On Thursday evening, the health department mistakenly discharged two COVID-19 patients from a quarantine centre as their names were similar to two other persons who tes… [+917 chars]"}, {"source": {"id": null, "name": "Gizmochina.com"}, "author": null, "title": "LG Velvet Specs are out ahead of official launch - gizmochina", "description": "There have been multiple rumours over the past few months regarding LG ditching its G series. The South Korean electronics giant confirmed it by revealing new ‘Velvet’ branding, which was later followed by a teaser video exposing the entire design to the publ…", "url": "https://www.gizmochina.com/2020/04/25/lg-velvet-specs-are-out-ahead-of-official-launch/", "urlToImage": null, "publishedAt": "2020-04-25T07:24:00Z", "content": "There have been multiple rumours over the past few months regarding LG ditching its G series. The South Korean electronics giant confirmed it by revealing new Velvet branding, which was later followed by a teaser video exposing the entire design to the public… [+1772 chars]"}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "First-ever digital geological map of moon released by US Geological Survey - Down To Earth Magazine", "description": "It will serve as a blue print for future human lunar missions", "url": "https://www.downtoearth.org.in/news/science-technology/first-ever-digital-geological-map-of-moon-released-by-us-geological-survey-70690", "urlToImage": null, "publishedAt": "2020-04-24T15:59:01Z", "content": "The first ever digital, unified, global, geological map of the moon was released virtually by the  United States Geological Survey (USGS), National Aeronautics and Space Administration (Nasa) and the Lunar Planetary Institute on April 22, 2020.\r\nThe map is a … [+2958 chars]"}]}