{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "No to saliva, yes to shine: Ball-tampering laws in cricket may change - Times of India", "description": "Cricket News: Cricket may change ball-tampering laws and approve external method to help polish the red cherry in proposed post-corona measures. The matter of saliv", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/no-to-saliva-yes-to-shine-ball-tampering-laws-in-cricket-may-change/articleshow/75367490.cms", "urlToImage": null, "publishedAt": "2020-04-25T04:40:29Z", "content": "NEW DELHI: The coronavirus pandemic may force cricket's world governing body to tweak one of its oldest rules and approve the use of an artificial substance to help shine the ball, effectively legalizing what has for long been a core tenet of the sport's anti… [+4836 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "PTI", "title": "US will make sure other countries know that coronavirus originated in China: Mike Pompeo - Zee News", "description": "US Secretary of State Mike Pompeo alleged that the World Health Organization failed in its mission to protect the world from the pandemic.", "url": "https://zeenews.india.com/world/us-will-make-sure-other-countries-know-that-coronavirus-originated-in-china-mike-pompeo-2278903.html", "urlToImage": null, "publishedAt": "2020-04-25T04:38:36Z", "content": "Washington: The United States is working with other countries to make sure they understand that coronavirus originated in Wuhan, China, Secretary of State Mike Pompeo has said.Stressing that the burden is on Beijing to explain where the virus came from, Pompe… [+4508 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "UN-WHO collaborate in coronavirus fight, increased efforts to find COVID-19 vaccine - Zee News", "description": "As the coronavirus COVID-19 pandemic continues to create chaos with most of the countries across the globe imposing lockdown measures, the hunt for a vaccine has also picked up pace. Several trials and studies are being conducted in US, UK, China and India wi…", "url": "https://zeenews.india.com/world/un-who-collaborate-in-coronavirus-fight-increased-efforts-to-find-covid-19-vaccine-2278900.html", "urlToImage": null, "publishedAt": "2020-04-25T04:38:33Z", "content": "As the coronavirus COVID-19 pandemic continues to create chaos with most of the countries across the globe imposing lockdown measures, the hunt for a vaccine has also picked up pace. Several trials and studies are being conducted in US, UK, China and India wi… [+1771 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "China sent team including medical experts to advise on North Korea's Kim: Sources - Times of India", "description": "Rest of World News: China has dispatched a team to North Korea including medical experts to advise on North Korean leader Kim Jong Un, according to three people familiar", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/china-sent-team-including-medical-experts-to-advise-on-north-koreas-kim-sources/articleshow/75367498.cms", "urlToImage": null, "publishedAt": "2020-04-25T04:13:40Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Coronavirus Highlights: India records biggest spike in COVID-19 numbers; 1,752 fresh cases on Friday - The Financial Express", "description": "Coronavirus India Latest Updates LIVE (State-Wise): Total COVID-19 cases in India has gone up to 24,506. This includes 18,668 active coronavirus cases while 5062 patients have been cured/discharged", "url": "https://www.financialexpress.com/lifestyle/health/coronavirus-india-updates-live-state-wise-covid-19-latest-news-corona-cases-tips-tracker-vaccine-symptoms-cure/1938098/", "urlToImage": null, "publishedAt": "2020-04-25T04:10:00Z", "content": "Coronavirus India Latest Updates LIVE (State-Wise): Total COVID-19 cases in India has gone up to 24,506. This includes 18,668 active coronavirus cases while 5062 patients have been cured/discharged. As many as 775 people have died due to coronavirus in India,… [+547 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Covid-19: Slight dip in new cases but deaths surge to 54 - Times of India", "description": "India News: However, the number of deaths related to the virus jumped to what is probably the highest single-day toll of 54, taking the total to 780 so far — whic", "url": "https://timesofindia.indiatimes.com/india/covid-19-slight-dip-in-new-cases-but-deaths-surge-to-54/articleshow/75366016.cms", "urlToImage": null, "publishedAt": "2020-04-25T03:43:36Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Prerna Vijayeni Panda", "title": "NASA celebrates 30 years and 1.4 million observations of Hubble with Cosmic Coral Reef - Republic World - Republic World", "description": "With yet another stunning portrait of cosmic phenomena, NASA celebrated the 30th anniversary of it's prized Hubble Space Telescope with an iconic new image.", "url": "https://www.republicworld.com/technology-news/science/nasa-marks-30-years-and-1-dot-4-million-observations-of-hubble-telescope.html", "urlToImage": null, "publishedAt": "2020-04-25T03:30:36Z", "content": "With yet another stunning portrait of cosmic phenomena, NASA celebrated the 30th launch anniversary of it's prized Hubble Space Telescope by unveiling an iconic new image a firestorm of star birth in a neighboring galaxy. \r\nIn the latest Hubble image shared b… [+2121 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Sobhita Dhulipala accused of lying about clicking her own pics for magazine shoot, issues clarification:... - Hindustan Times", "description": "Actor Sobhita Dhulipala recently shared pictures from a magazine photoshoot, saying that she had clicked the pictures herself. Later, a picture of her getting clicked by a man on her terrace landed online.", "url": "https://www.hindustantimes.com/bollywood/sobhita-dhulipala-accused-of-lying-about-clicking-her-own-pics-for-magazine-shoot-issues-clarification-it-is-upsetting/story-fYdaCclRaGZ8BSXzAcd5hN.html", "urlToImage": null, "publishedAt": "2020-04-25T03:30:04Z", "content": "Actor Sobhita Dhulipala has issued a clarification after she was accused of lying about a new magazine photoshoot. Sobhita had shared multiple pictures from the latest issue of Cosmopolitan magazine over the last couple of days, saying that she styles herself… [+3087 chars]"}, {"source": {"id": null, "name": "Gadgetsnow.com"}, "author": "Gadgets Now Bureau", "title": "How Apple and Google will 'use' your phone to fight coronavirus: 15 things to know - Gadgets Now", "description": "Almost two weeks back two of the world’s biggest tech companies — Apple and Google — announced that they would work together to help in the fight against coronavirus pandemic. The two companies announced their plans of helping governments, health agencies acr…", "url": "https://www.gadgetsnow.com/slideshows/how-apple-and-google-will-use-your-phone-to-fight-coronavirus-15-things-to-know/photolist/75367998.cms", "urlToImage": null, "publishedAt": "2020-04-25T03:22:00Z", "content": "Almost two weeks back two of the world’s biggest tech companies — Apple\r\n and Google\r\n — announced that they would work together to help in the fight against coronavirus\r\n pandemic. The two companies announced their plans of helping governments, health agenci… [+310 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Anulekha Ray", "title": "Coronavirus update: COVID-19 cases in India near 25,000, biggest jump in death toll. State-wise tally - Livemint", "description": "Coronavirus has claimed 57 lives in last 24 hours, taking the death toll in the country to 775.Maharashtra continues to report highest number of deaths at followed by Gujarat, Madhya Pradesh and Delhi", "url": "https://www.livemint.com/news/india/coronavirus-update-covid-19-cases-in-india-near-25-000-biggest-jump-in-death-toll-state-wise-tally-11587783346559.html", "urlToImage": null, "publishedAt": "2020-04-25T03:15:00Z", "content": "India recorded 1,429 coronavirus cases in last 24 hours, dipped slightly from 1,684 from the day before. The total number of coronavirus cases in the country has climbed to 24,506. However, there was a sharp increase in the COVID-19 fatalities. Coronavirus ha… [+2309 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Bloomberg", "title": "Tesla turns up heat on Chinese startup over alleged theft of Autopilot secrets - Hindustan Times", "description": "Xpeng, backed by Alibaba Group, and a former Apple employee are accused of 'stealing' autopilot secrets from Tesla.", "url": "https://auto.hindustantimes.com/auto/news/tesla-turns-up-heat-on-chinese-startup-over-alleged-theft-of-autopilot-secrets-41587782951640.html", "urlToImage": null, "publishedAt": "2020-04-25T03:03:11Z", "content": "More than a year after the billionaire chairman of Xpeng Motors labeled as questionable\" Tesla Inc.s allegations that an engineer stole Autopilot secrets before bolting to the Chinese startup, the questions from Elon Musks company keep coming.\r\nAs Tesla tries… [+5008 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Virat Kohli, AB de Villiers pick combined India-South Africa XI, MS Dhoni named captain - Hindustan Times", "description": "Former India and South Africa coach Gary Kirsten was picked as the coach of this combined playing XI.", "url": "https://www.hindustantimes.com/cricket/virat-kohli-ab-de-villiers-pick-combined-india-south-africa-xi-ms-dhoni-named-captain/story-DivDpAWclSIUehNSrqvpVP.html", "urlToImage": null, "publishedAt": "2020-04-25T03:02:34Z", "content": "Virat Kohli and AB De Villiers picked a combined India-South Africa ODI squad during their latest Instagram Live interaction and they both decided on MS Dhoni as the skipper. The Royal Challengers Bangalore teammates talked about a lot of topics during their … [+1714 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This AMD Ryzen notebook deal is probably the best we've ever seen - TechRadar", "description": "Lenovo and AMD provide a glimpse into the future", "url": "https://www.techradar.com/news/this-amd-ryzen-laptop-is-the-probably-the-best-notebook-deal-ever", "urlToImage": null, "publishedAt": "2020-04-25T03:00:00Z", "content": "We reviewers are used to obsessing over incremental technology changes, but every now and then a supernova appears on our radar - something that can single handedly change the status quo.\r\nThe AMD Ryzen 4000 family is one such supernova and promises to bring … [+1829 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "White House Could Alter Covid-19 Briefings to Limit Trump's Role After Uproar over Disinfectant Remark - News18", "description": "Trump's advisers have argued that while the briefings may appeal to his most loyal base of supporters, they could be alienating some viewers, including senior citizens worried about their health.", "url": "https://www.news18.com/news/world/white-house-could-alter-covid-19-briefings-to-limit-trumps-role-after-uproar-over-his-disinfectant-remarks-2591839.html", "urlToImage": null, "publishedAt": "2020-04-25T02:34:15Z", "content": "For the first time, President Donald Trump cut off his daily coronavirus task force briefing on Friday without taking any questions from reporters. It may not be the last time.\r\nThere have been discussions within the White House about changing the format of t… [+2465 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Bengaluru hospital to conduct plasma therapy trials on Sat - Daijiworld.com", "description": "", "url": "http://www.daijiworld.com/news/newsDisplay.aspx?newsID=700743", "urlToImage": null, "publishedAt": "2020-04-25T02:32:14Z", "content": "Bengaluru, Apr 25 (IANS): City-based BMC Victoria Hospital is poised to take the first steps in assessing the efficacy of plasma therapy for Covid-19 patients on Saturday, Karnataka Health Minister B. Sriramulu said on Friday.\r\n\"BMC Victoria hospital will tak… [+875 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Arunima", "title": "In Midnight Order, Centre Allows Neighbourhood Shops to Reopen But Malls to Stay Closed - News18", "description": "The home ministry said all shops, including neighbourhood shops and standalone shops in residential complexes, will be allowed to open during the lockdown in non-hotspot areas.", "url": "https://www.news18.com/news/india/in-midnight-order-centre-allows-neighbourhood-shops-to-reopen-but-malls-to-stay-closed-2591825.html", "urlToImage": null, "publishedAt": "2020-04-25T02:14:16Z", "content": "New Delhi: A month after the all-India lockdown was implemented, the central government has allowed opening of neighbourhood and standalone shops, including those located in residential complexes within municipal areas. \r\nThe late night order, issued by the h… [+2685 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Vlad", "title": "Facebook launches Messenger Rooms for unlimited video calls with up to 50 people - GSMArena.com news - GSMArena.com", "description": "You don't even need to have a Facebook account to join a Room.", "url": "https://www.gsmarena.com/facebook_launches_messenger_rooms_for_video_chats_with_up_to_50_people-news-42865.php", "urlToImage": null, "publishedAt": "2020-04-25T02:00:01Z", "content": "Today Facebook has unveiled its response to the crazy growth of Zoom over the past few weeks of the COVID-19 related lockdowns happening pretty much worldwide.\r\nFacebook Messenger already had video chat functionality, but it was limited both in the total numb… [+1538 chars]"}, {"source": {"id": null, "name": "Gizbot.com"}, "author": "Sharmishte Datti", "title": "NASA VITAL Prototype Ventilators To Help Fight COVID-19 Pandemic - Gizbot", "description": "In a bid to help the coronavirus infected, NASA has announced that it has successfully developed a prototype ventilator for the treatment of coronavirus patients. For this, NASA has developed VITAL or the Ventilator Intervention Technology Accessible Locally.", "url": "https://www.gizbot.com/news/covid-19-pandemic-nasa-builds-prototype-ventilators-067269.html", "urlToImage": null, "publishedAt": "2020-04-25T02:00:00Z", "content": "In a bid to help the coronavirus infected, NASA has announced that it has successfully developed a prototype ventilator for the treatment of coronavirus patients. For this, NASA has developed VITAL or the Ventilator Intervention Technology Accessible Locally.… [+2604 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shubham Raj", "title": "How Franklin Templeton MF shot in the foot & put Rs 30,000 crore investor wealth at risk - Economic Times", "description": "These funds have a huge exposure of Rs 14,564 crore to non-banking finance companies.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/how-franklin-templeton-mf-shot-in-the-foot-put-rs-30000-crore-investor-wealth-at-risk/articleshow/75356512.cms", "urlToImage": null, "publishedAt": "2020-04-25T00:53:00Z", "content": "Franklin Templeton India’s move to freeze nearly Rs 31,000 crore worth of assets amid “significant reduction in liquidity and higher redemptions” has laid bare the problems with Indian debt papers, especially sectors to which the fund house has huge exposure.… [+4577 chars]"}, {"source": {"id": null, "name": "Globaltimes.cn"}, "author": null, "title": "UK pushes forward coronavirus vaccine trial amid increasing pandemic death toll - Global Times", "description": "After implementing social distancing measures for weeks, Britain has hit", "url": "https://www.globaltimes.cn/content/1186675.shtml", "urlToImage": null, "publishedAt": "2020-04-25T00:42:44Z", "content": "An ambulance is seen in Oxford, Britain, April 24, 2020. A team at the University of Oxford is starting a coronavirus vaccine trial on humans Thursday. The team started work on developing the vaccine to prevent COVID-19 on Jan. 20, 2020. (Photo by Tim Ireland… [+5600 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Manchester United chief Woodward warns transfer market won't be 'business as usual' for his side - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T22:10:42Z", "content": "More"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NASA Science Live: Asteroid Close Approach - NASA", "description": "Have you heard about an asteroid close-approach happening on April 29? Asteroid 1998 OR2 poses no threat to our planet, but we can still learn a lot by study...", "url": "https://www.youtube.com/watch?v=eiS8EPOL488", "urlToImage": null, "publishedAt": "2020-04-24T21:46:31Z", "content": "Have you heard about an asteroid close-approach happening on April 29? Asteroid 1998 OR2 poses no threat to our planet, but we can still learn a lot by studying it. Don't miss a special Planetary Defense episode of NASA Science Live on Monday, April 27 at 3:0… [+83 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Covid-19: Telangana govt shifts focus to three districts, GHMC - Telangana Today", "description": "Hyderabad: The prevalence of coronavirus positive cases is now almost confined to three districts and the Greater Hyderabad Municipal Corporation limits in Telangana, which has given a lot of hope that the spread of Covid-19 can be halted and the situation br…", "url": "https://telanganatoday.com/covid-19-telangana-govt-shifts-focus-to-three-districts-ghmc", "urlToImage": null, "publishedAt": "2020-04-24T18:28:00Z", "content": "Hyderabad: The prevalence of coronavirus positive cases is now almost confined to three districts and the Greater Hyderabad Municipal Corporation limits in Telangana, which has given a lot of hope that the spread of Covid-19 can be halted and the situation br… [+2402 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Carly Page", "title": "The Dell XPS 15 2020 may have been redesigned to take on the MacBook Pro - TechRadar India", "description": "Incoming model will boast smaller bezels and upward-firing speakers", "url": "https://www.techradar.com/news/the-dell-xps-15-2020-may-have-been-redesigned-to-take-on-the-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-24T17:31:00Z", "content": "Dell looks poised to release an all-new version of its XPS 15 laptop that will take a number of design clues from the recently-revamped Dell XPS 13\r\n.\r\nThats according to leaked images posted on the Korea Energy Agency Efficiency Standardization Certification… [+2119 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Covid-19 outbreak: Ajax denied title as Dutch Eredivisie season declared void - India Today", "description": "The Dutch Eredivisie season has been ended with immediate effect, meaning league leaders Ajax have been denied the title.", "url": "https://www.indiatoday.in/sports/football/story/covid-19-outbreak-ajax-denied-title-as-dutch-eredivisie-season-declared-void-1670775-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T16:33:44Z", "content": "No top-flight league title will be awarded in the Netherlands after the COVID-19 pandemic brought the campaign to a premature close but Ajax Amsterdam and AZ Alkmaar will qualify for next season's Champions League, Dutch media reported on Friday.\r\nThe reports… [+560 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "When Shah Rukh Khan warned Aamir Khan to not work with Kajol: ‘She is very bad, unfocused’ - Hindustan Times", "description": "Before they came to be known as one of Bollywood’s best romantic pairs, actors Shah Rukh Khan and Kajol got off on the wrong foot.", "url": "https://www.hindustantimes.com/bollywood/when-shah-rukh-khan-warned-aamir-khan-to-not-work-with-kajol-she-is-very-bad-unfocused/story-ohHuC9ZVW9pUEacCoSFHQK.html", "urlToImage": null, "publishedAt": "2020-04-24T16:23:00Z", "content": "They’re known as one of Bollywood’s finest romantic pairs, but did you know that Shah Rukh Khan and Kajol got off on the wrong foot when they first met? In fact, Shah Rukh confessed that he’d even warned Aamir Khan about her, calling her unfocused and ‘very b… [+1544 chars]"}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "First-ever digital geological map of moon released by US Geological Survey - Down To Earth Magazine", "description": "It will serve as a blue print for future human lunar missions", "url": "https://www.downtoearth.org.in/news/science-technology/first-ever-digital-geological-map-of-moon-released-by-us-geological-survey-70690", "urlToImage": null, "publishedAt": "2020-04-24T15:59:01Z", "content": "The first ever digital, unified, global, geological map of the moon was released virtually by the  United States Geological Survey (USGS), National Aeronautics and Space Administration (Nasa) and the Lunar Planetary Institute on April 22, 2020.\r\nThe map is a … [+2958 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Faulty antibody testing kits will be returned to respective countries: Health minister Harsh Vardhan - Times of India", "description": "India News: Union health minister Dr Harsh Vardhan on Thursday said faulty antibody testing kits will be returned to the respective countries, whether it is China", "url": "https://timesofindia.indiatimes.com/india/faulty-antibody-testing-kits-will-be-returned-to-respective-countries-health-minister-harsh-vardhan/articleshow/75347398.cms", "urlToImage": null, "publishedAt": "2020-04-24T15:55:35Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Saif Ali Khan says son Taimur will be devastated when lockdown ends as he makes a cameo in another ... - Hindustan Times", "description": "Saif Ali Khan’s son Taimur made an adorable appearance in yet another interview of the actor. Here’s what the actor said about him.", "url": "https://www.hindustantimes.com/bollywood/saif-ali-khan-says-son-taimur-will-be-devastated-when-lockdown-ends-as-he-makes-a-cameo-in-another-interview/story-0rdhaQXkKenwyZjLzbu1mN.html", "urlToImage": null, "publishedAt": "2020-04-24T13:37:08Z", "content": "Actor Saif Ali Khan knows his son Taimur will be devastated when the lockdown finally lifts. Thought the little boy misses playing with his friends, he will miss his parently dearly when they return to work. \r\nSpeaking to Rajeev Masand in an interview, Saif s… [+1238 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Bengal IMCT team finds major gaps in state’s Covid-19 preparedness at hospitals - India Gone Viral", "description": "Home / India News / Bengal IMCT team finds major gaps in state’s Covid-19 preparedness at hospitals One of the Inter-Ministerial Central Teams (IMCTs) sent to West Bengal to assess the on-ground situa", "url": "https://indiagoneviral.com/news/2020/04/24/bengal-imct-team-finds-major-gaps-in-states-covid-19-preparedness-at-hospitals/40845/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-24T13:04:45Z", "content": "Home / India News / Bengal IMCT team finds major gaps in states Covid-19 preparedness at hospitals One of the Inter-Ministerial Central Teams (IMCTs) sent to West Bengal to assess the on-ground situation there, after inspection of health care facilities at tw… [+3826 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus crisis | PM Modi to take a call on another relief package after April 27 meet with CMs - Moneycontrol", "description": "Moneycontrol had reported on April 23 that Prime Minister Narendra Modi is expected to meet finance ministry officials soon to take stock of the economic situation", "url": "https://www.moneycontrol.com/news/business/economy/coronavirus-crisis-pm-modi-to-take-a-call-on-another-relief-package-after-april-27-meet-with-cms-5186511.html", "urlToImage": null, "publishedAt": "2020-04-24T11:58:26Z", "content": "A decision to provide another economic relief package would be taken after Prime Minister Narendra Modi meets chief ministers on April 27.\r\n\"The prime minister would be meeting chief ministers on Monday. A fiscal package would be announced after taking into c… [+1910 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Bloomberg", "title": "COVID-19 lockdown to test Akshaya Tritiya tradition of buying gold - Deccan Herald", "description": "With staying-at-home becoming the new normal and most Indian jewelry stores shut due to a nationwide lockdown, Mamta Vinay Gokarn is facing a dilemma: how to get a hold of gold on the second-most auspicious day in the Hindu calendar to buy the metal.", "url": "https://www.deccanherald.com/business/covid-19-lockdown-to-test-akshaya-tritiya-tradition-of-buying-gold-829357.html", "urlToImage": null, "publishedAt": "2020-04-24T11:26:30Z", "content": "By Swansy Afonso\r\nWith staying-at-home becoming the new normal and most Indian jewelry stores shut due to a nationwide lockdown, Mamta Vinay Gokarn is facing a dilemma: how to get a hold of gold on the second-most auspicious day in the Hindu calendar to buy t… [+3718 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "COVID-19 cases in India cross 23,000 - The News Minute", "description": "As India attempts to flatten the curve of the novel coronavirus and is currently under lockdown, some states are continuing to see a steady rise in cases. India is under lockdown till May 3 to help stop the spread of COVID-19. The number of cases in India has…", "url": "https://www.thenewsminute.com/article/covid-19-cases-india-cross-23000-123232", "urlToImage": null, "publishedAt": "2020-04-24T09:57:43Z", "content": "Over 4,700 people have recovered from the disease, and 718 people have died, according to government data.As India attempts to flatten the curve of the novel coronavirus and is currently under lockdown, some states are continuing to see a steady rise in cases… [+1681 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "D-Street Buzz: Over 300 stocks hit lower circuit on BSE; Bajaj Finance, BoB at new 52-week low - Moneycontrol.com", "description": "116 stocks have hit new 52-week low on BSE including Bajaj Finance, Bank of Baroda, Spandana Sphoorty Financial and Aditya Birla Fashion among others.", "url": "https://www.moneycontrol.com/news/business/stocks/d-street-buzz-over-300-stocks-hit-lower-circuit-on-bse-bajaj-finance-bob-at-new-52-week-low-5185881.html", "urlToImage": null, "publishedAt": "2020-04-24T09:42:00Z", "content": "The Indian stock market after recovering lost ground has once again slipped into the red with Sensex is down 444.40 points or 1.39% at 31418.68, and the Nifty down 137.00 points or 1.47% at 9176.90.\r\nBank Nifty fell over 3 percent dragged by IndusInd Bank and… [+1773 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AFP", "title": "You've got mail: Tom Hanks writes to bullied boy called 'Corona' - Livemint", "description": "Tom Hanks and his wife Rita Wilson contracted Covid-19 in March.Eight-year-old Corona De Vries sent a letter to Hanks asking after his health", "url": "https://www.livemint.com/news/world/you-ve-got-mail-tom-hanks-writes-to-bullied-boy-called-corona-11587712686667.html", "urlToImage": null, "publishedAt": "2020-04-24T07:26:46Z", "content": "Hollywood megastar and coronavirus survivor Tom Hanks has written a comforting letter to a bullied Australian boy called Corona and gifted him a cherished typewriter bearing the same name.Hanks and his wife Rita Wilson contracted COVID-19, the disease caused … [+976 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Coronavirus Outbreak LIVE Updates: Maharashtra confirms 293 COVID-19 deaths till 10 am, confirmed cases at 6,427 after 778 more test positive - Firstpost", "description": "Coronavirus Outbreak LIVE Updates: The Maharashtra health department said that 394 new COVID-19 cases and 18 deaths have been reported in the state on Friday, taking the total number of cases to 6,817 and the toll to 310 in the state. Watch LIVE News, Latest …", "url": "https://www.firstpost.com/health/coronavirus-outbreak-highlights-covid-19-pandemic-india-pm-narendra-modi-speech-today-death-count-lockdown-maharashtra-delhi-latest-news-panchayat-raj-day-2020-8293391.html", "urlToImage": null, "publishedAt": "2020-04-24T06:57:41Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Maharashtra records 778 new cases; state COVID-19 tally 6427 - Economic Times", "description": "So far, 840 COVID-19 patients have been discharged in the state after recovery, the officials said.", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/maharashtra-records-778-new-cases-state-covid-19-tally-6427/articleshow/75329414.cms", "urlToImage": null, "publishedAt": "2020-04-23T15:57:14Z", "content": "MUMBAI: Maharashtra recorded 778 coronavirus positive cases on Thursday, taking the state's COVID-19 tally to 6427, health officials said. Fourteen COVID-19 patients died on Thursday, taking the COVID-19 death toll in the state to 283, the officials said. \r\nS… [+97 chars]"}, {"source": {"id": null, "name": "Latestly.com"}, "author": "PTI", "title": "Coronavirus Does Not Spread Through Sex? Study Finds No COVID-19 Traces in Semen Tests of Patients, But - LatestLY", "description": "According to a study that found no evidence of the novel coronavirus in the semen or testes of men, covid-19 may not spread through sex. The study, published in the journal Fertility &amp; Sterility, was not comprehensive enough to fully rule out the possibil…", "url": "https://www.latestly.com/lifestyle/health-wellness/coronavirus-does-not-spread-through-sex-study-finds-no-covid-19-traces-in-semen-tests-of-patients-but-does-not-completely-rule-out-sexual-transmission-1703310.html", "urlToImage": null, "publishedAt": "2020-04-23T14:50:22Z", "content": "Washington, Apr 23: COVID-19 is unlikely to be spread through sexual transmission, according to a study that found no evidence of the novel coronavirus in the semen or testes of men. The study, published in the journal Fertility &amp; Sterility, was not compr… [+3562 chars]"}]}