{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Help all without discrimination, work towards becoming self-reliant country: RSS chief Mohan Bhagwat on C - Times of India", "description": "India News: As the country faces the coronavirus pandemic, RSS chief Mohan Bhagwat on Sunday cautioned against forces inimical to India's interests taking advanta", "url": "https://timesofindia.indiatimes.com/india/help-all-without-discrimination-work-towards-becoming-self-reliant-country-rss-chief-mohan-bhagwat-on-covid-crisis/articleshow/75391725.cms", "urlToImage": null, "publishedAt": "2020-04-26T14:03:08Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Neha", "title": "Hubble Space Telescope yields 1.4 mn observations in 3 decades - The Siasat Daily", "description": "Washington: The Hubble Space Telescope, which is now celebrating 30 years of stunning discoveries, has yielded 1.4 million observations and provided data that astronomers around the world have used to write more than 17,000 peer-reviewed scientific publicatio…", "url": "https://www.siasat.com/hubble-space-telescope-yields-1-4-mn-observations-3-decades-1880016/", "urlToImage": null, "publishedAt": "2020-04-26T14:00:33Z", "content": "Washington: The Hubble Space Telescope, which is now celebrating 30 years of stunning discoveries, has yielded 1.4 million observations and provided data that astronomers around the world have used to write more than 17,000 peer-reviewed scientific publicatio… [+2845 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "NASA develops low-cost ventilator to fight coronavirus - Northeast Now", "description": "NASA engineers have designed a new low-cost high-pressure ventilator tailored to treat coronavirus patients. The device, called VITAL (Ventilator Intervention Technology Accessible Locally), passed a critical test on April 21 at the Icahn School of Medicine a…", "url": "https://nenow.in/health/nasa-develops-low-cost-ventilator-to-fight-coronavirus.html/", "urlToImage": null, "publishedAt": "2020-04-26T13:42:22Z", "content": "NASA engineers have designed a new low-cost high-pressure ventilator tailored to treat coronavirus patients.\r\nThe device, called VITAL (Ventilator Intervention Technology Accessible Locally), passed a critical test on April 21 at the Icahn School of Medicine … [+1301 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Bloomberg", "title": "Will a woman run North Korea? Kim Jong Un’s sister outshines male rivals - Hindustan Times", "description": "The question of whether Kim Yo Jong will become North Korea’s first woman leader has suddenly become front and center as questions about her brother’s health intensify.", "url": "https://www.hindustantimes.com/world-news/will-a-woman-run-north-korea-kim-jong-un-s-sister-outshines-male-rivals/story-wBRP1dQpI1MvO8f8CAipvI.html", "urlToImage": null, "publishedAt": "2020-04-26T13:25:00Z", "content": "Of all the family members who could eventually take the reins from North Korean leader Kim Jong Un, his sister seems like the obvious choice.\r\nKim Yo Jong, in her early 30s, has been by her brother’s side at summits with U.S. President Donald Trump and Chines… [+8446 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Sanjay Mishra’s entry for ‘Me At 20’ trend is epic, watch him do the barati dance - Hindustan Times", "description": "Check out the video in which Sanjay Mishra can be seen dancing at a wedding ceremony-- doing exactly what most people do on such occasions.", "url": "https://www.hindustantimes.com/bollywood/sanjay-mishra-s-entry-for-me-at-20-trend-is-epic-watch-him-do-the-barati-dance/story-o9PRLgrAocCHuqStD3xKAO.html", "urlToImage": null, "publishedAt": "2020-04-26T13:10:18Z", "content": "Actor Sanjay Mishra has shared a throwback video in which he is seen doing the typical ‘baraati’ dance at a wedding ceremony. Sanjay decided to join the popular trend on social media where people post pictures and videos of themselves when they were 20 years … [+1758 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Aparna Banerjea", "title": "Coronavirus update: India's Covid-19 cases near 27,000-mark, death toll at 826. State-wise tally - Livemint", "description": "Maharashtra continues to be the worst hit state with total number of positive cases rising to 7,628 along with 323 deaths.The global death toll shot past 200,000 while the number of positive cases surpassed 2.9 million", "url": "https://www.livemint.com/news/india/coronavirus-update-india-s-covid-19-cases-near-27-000-mark-death-toll-at-826-state-wise-tally-11587897409880.html", "urlToImage": null, "publishedAt": "2020-04-26T12:20:01Z", "content": "After recording 1,975 fresh novel coronavirus cases in the last 24 hours, India's Covid-19 cases count surged to 26,917 today, according to the Ministry of Health and Family Welfare data. The death toll due to the highly contagious infection also increased to… [+3456 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "Coronavirus cases cross 3,000-mark in Singapore, foreign workers worst-affected - Hindustan Times", "description": "Foreign workers’ dormitories have been locked down as the government struggles to curb the second wave of the Covid-19 outbreak.", "url": "https://www.hindustantimes.com/world-news/coronavirus-cases-cross-3-000-mark-in-singapore-foreign-workers-worst-affected/story-HYFLOSHeTEOfBzCbEWS4DL.html", "urlToImage": null, "publishedAt": "2020-04-26T12:15:06Z", "content": "Coronavirus cases in Singapore crossed the 13,000-mark on Sunday after 931 positive cases were confirmed with majority of them continued to be foreign workers, including Indian nationals, living in dormitories.\r\n The vast majority of the news cases are work p… [+2405 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Covid-19 cases in Wuhan hospitals drop to zero for 1st time - Times of India", "description": "China News: The last patient in Wuhan was cured on Friday, reducing the number of coronavirus patients in the city to zero, said a spokesperson for China's Nation", "url": "https://timesofindia.indiatimes.com/world/china/covid-19-cases-in-wuhan-hospitals-drop-to-zero-for-1st-time/articleshow/75390046.cms", "urlToImage": null, "publishedAt": "2020-04-26T12:08:20Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Apple's new iPhone SE: Can it get people to forget phone stores? - ZDNet", "description": "Chris Matyszczyk wonders if Apple's new, inexpensive phone is a success, what does that mean for traditional phone retail? Read more: https://zd.net/2xaW3mU ...", "url": "https://www.youtube.com/watch?v=WKggeuJduVE", "urlToImage": null, "publishedAt": "2020-04-26T12:05:24Z", "content": "Chris Matyszczyk wonders if Apple's new, inexpensive phone is a success, what does that mean for traditional phone retail? Read more: https://zd.net/2xaW3mU\r\nFOLLOW US - Subscribe to ZDNet on YouTube: http://bit.ly/2HzQmyf- Watch more ZDNet videos: http://zd.… [+320 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Prasun Sonwalkar", "title": "Clock is ticking, as Covid-19 puts Brexit on back-burner - Hindustan Times", "description": "The UK symbolically left the EU in January and entered into a ‘transition’ phase until December 31, by when both sides are expected to finalise post-Brexit trade and other arrangements.", "url": "https://www.hindustantimes.com/world-news/clock-is-ticking-as-covid-19-puts-brexit-on-back-burner/story-SyRl8LF9784uT1ndoqqASK.html", "urlToImage": null, "publishedAt": "2020-04-26T12:00:01Z", "content": "The United Kingdom and the European Union were supposed to be at an advanced stage of trade talks now, but the coronavirus pandemic has pushed Brexit into the background, with latest talks by video-link on Friday described as ‘disappointing’.\r\nThe UK symbolic… [+1466 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Mahesh Langa", "title": "PM’s trusted aide appointed Secretary of MSME - The Hindu", "description": "Several officials moved in a much-awaited reshuffle in Central administration", "url": "https://www.thehindu.com/news/national/pms-trusted-aide-appointed-secretary-of-msme/article31437442.ece", "urlToImage": null, "publishedAt": "2020-04-26T11:45:01Z", "content": "In a much-awaited large-scale reshuffle in the Central administration, the Modi government has appointed/reshuffled 23 Secretary-level officials. \r\nTwo senior bureaucrats from the PMO have been moved out to important positions Secretary AK Sharma as Secretary… [+3398 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Omar Rashid", "title": "Every person I came in contact with tested negative, says singer Kanika Kapoor - The Hindu", "description": "In a statement issued on Sunday, she responded to allegations of not adhering to quarantine norms.", "url": "https://www.thehindu.com/entertainment/every-person-i-came-in-contact-with-tested-negative-says-singer-kanika-kapoor/article31437427.ece", "urlToImage": null, "publishedAt": "2020-04-26T11:44:57Z", "content": "Bollywood singer Kanika Kapoor on Sunday for the first time openly responded to allegations of not adhering to quarantine norms around the time she had returned from abroad and tested positive for COVID-19 last month.\r\n\"Every person that I have come in contac… [+1685 chars]"}, {"source": {"id": null, "name": "Weforum.org"}, "author": "Stephanie Nebehay", "title": "WHO warns COVID-19 patients could be infected again - World Economic Forum", "description": "The World Health Organization advises countries against issuing “immunity passports” or “risk-free certificates” to people who have been infected.", "url": "https://www.weforum.org/agenda/2020/04/no-evidence-that-recovered-covid-19-patients-cannot-be-reinfected-who/", "urlToImage": null, "publishedAt": "2020-04-26T11:38:09Z", "content": "<ul><li>People who have recovered from COVID-19 still need to take precautions to prevent re-infection</li><li>Some countries have handed out health passports to people who have recovered from the illness</li><li>There are now 2.9 million cases of coronavirus… [+1994 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Jayshree P. Upadhyay, Gopika Gopakumar", "title": "Mutual funds scramble to contain Franklin impact, to seek RBI’s intervention - Livemint", "description": "While a majority of fund houses say that the debt schemes are fairly liquid at this point but could get difficult in coming weeks if lockdown is not lifted.To meet the liquidity needs of mutual funds, RBI has allowed banks to avail of cheap funding under the …", "url": "https://www.livemint.com/mutual-fund/mf-news/mutual-funds-scramble-to-contain-franklin-impact-to-seek-rbi-s-intervention-11587900606693.html", "urlToImage": null, "publishedAt": "2020-04-26T11:37:11Z", "content": "To contain the impact of redemption related stress, mutual fund houses are marking down bad investments, seeking bank loans and a liquidity intervention from Reserve Bank of Indias (RBI) as the lender of last resort.Due to redemption pressure, Franklin Temple… [+5149 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Sports in times of COVID-19: Top Indian stars foresee new normal once pandemic mayhem ends - Times of India", "description": "More sports News: Will sports and watching sports ever be the same again in a world scarred by the COVID-19 pandemic? India's sportspersons -- current and former -- gaz", "url": "https://timesofindia.indiatimes.com/sports/more-sports/others/sports-in-times-of-covid-19-top-indian-stars-foresee-new-normal-once-pandemic-mayhem-ends/articleshow/75388631.cms", "urlToImage": null, "publishedAt": "2020-04-26T10:26:04Z", "content": "NEW DELHI: Will the fans rush back? Will training abroad be as hassle-free as it used to be? What about contact sports where social distancing can't really be practised?\r\nIn a nutshell, will sports and watching sports ever be the same again in a world scarred… [+6513 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "MS Dhoni always takes responsibility when team loses, says Mohit Sharma - Times of India", "description": "Cricket News: He has played most of his cricket under MS Dhoni and pacer Mohit Sharma says the revered former India skipper is a true leader who does not back off w", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/ms-dhoni-always-takes-responsibility-when-team-loses-says-mohit-sharma/articleshow/75388665.cms", "urlToImage": null, "publishedAt": "2020-04-26T10:26:03Z", "content": "NEW DELHI: He has played most of his cricket under MS Dhoni and pacer Mohit Sharma says the revered former India skipper is a true leader who does not back off when it comes to taking responsibility in challenging times.\r\nThe 31-year-old pacer has played unde… [+2580 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "PM to interact with CMs on Monday to discuss way out of lockdown, Covid fight - Times of India", "description": "India News: PM Modi will interact with chief ministers via video conference on Monday morning on the way ahead in the fight against the coronavirus, amid indicati", "url": "https://timesofindia.indiatimes.com/india/pm-to-interact-with-cms-on-monday-to-discuss-way-out-of-lockdown-covid-fight/articleshow/75389416.cms", "urlToImage": null, "publishedAt": "2020-04-26T10:16:39Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Bloomberg", "title": "Reliance starts WhatsApp-based online shopping portal during COVID-19 lockdown - Deccan Herald", "description": "Reliance Industries Ltd. started testing its online shopping portal three days after Facebook Inc. said it will invest $5.7 billion in digital assets controlled by billionaire Mukesh Ambani.", "url": "https://www.deccanherald.com/business/business-news/reliance-starts-whatsapp-based-online-shopping-portal-during-covid-19-lockdown-830082.html", "urlToImage": null, "publishedAt": "2020-04-26T09:54:54Z", "content": "By P R Sanjai\r\nReliance Industries Ltd. started testing its online shopping portal three days after Facebook Inc. said it will invest $5.7 billion in digital assets controlled by billionaire Mukesh Ambani.\r\nFollow latest updates on the COVID-19 pandemic here\r… [+1706 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Rafael sends Manchester United summer transfer warning - Goal India", "description": "Onome Ebi is doubtful about Nigeria's chances of maintaining its continental dominance in the coming years following a nervy triumph over South Africa at the 2018 African Women's Cup of Nations.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T09:41:00Z", "content": "More"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Sukanya Charuchandra", "title": "Convalescent Plasma's Success Against COVID-19 Continues in New Study - The Wire", "description": "Convalescent plasma is one of three immune-based options that may be able to tackle COVID-19.", "url": "https://science.thewire.in/the-sciences/convalescent-plasmas-success-against-covid-19-continues-in-new-study/", "urlToImage": null, "publishedAt": "2020-04-26T09:29:00Z", "content": "An artist’s impression of red blood cells flowing through a vein. Image: Narupon Promvichai/pixabay.\r\nResearchers in China have been experimenting with using blood plasma from patients who have recovered from COVID-19 as a possible way to treat severely ill C… [+5508 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "The next chapter of the oil crisis: The industry shuts down - Economic Times", "description": "The economic impact of the coronavirus has ripped through the oil industry in dramatic phases.", "url": "https://economictimes.indiatimes.com/news/international/business/the-next-chapter-of-the-oil-crisis-the-industry-shuts-down/articleshow/75388726.cms", "urlToImage": null, "publishedAt": "2020-04-26T09:17:00Z", "content": "by Javier BlasNegative oil prices, ships dawdling at sea with unwanted cargoes, and traders getting creative about where to stash oil. The next chapter in the oil crisis is now inevitable: great swathes of the petroleum industry are about to start shutting do… [+6313 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Agencies", "title": "Yes Bank scam: CBI takes DHFL promoters Kapil and Dheeraj Wadhawan in custody - Livemint", "description": "Wadhawan brothers are named as accused in the CBI's FIR pertaining to alleged swindling of money by Yes Bank promoter Rana Kapoor and others.The brothers are out on bail since February 21", "url": "https://www.livemint.com/companies/news/yes-bank-scam-cbi-takes-dhfl-promoters-kapil-and-dheeraj-wadhawan-in-custody-11587891739992.html", "urlToImage": null, "publishedAt": "2020-04-26T09:08:40Z", "content": "NEW DELHI :\r\nDHFL promoters Kapil and Dheeraj Wadhawan, accused in the Yes Bank-DHFL fraud cases, have been taken into CBI custody, Maharashtra home minister Anil Deshmukh said today.\"A #CBI team has taken both Kapil and Dhiraj Wadhwan into custody. @SataraPo… [+1163 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "36-year-old man dies, becomes Tamil Nadu’s youngest COVID-19 victim - The News Minute", "description": "A 36-year-old man who was admitted to Chrompet Government Hospital in Chennai died due to COVID-19 infection at 10.15 pm on April 24, taking the total number of COVID-19 deaths in Tamil Nadu to 23. This is the youngest COVID-19 death in the state so far. The …", "url": "https://www.thenewsminute.com/article/36-year-old-man-dies-becomes-tamil-nadu-s-youngest-covid-19-victim-123358", "urlToImage": null, "publishedAt": "2020-04-26T09:03:01Z", "content": "According to officials, the deceased had comorbidities like hypothyroidism and obesity.A 36-year-old man who was admitted to Chrompet Government Hospital in Chennai died due to COVID-19 infection at 10.15 pm on April 24, taking the total number of COVID-19 de… [+1772 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Covid-19: Apple, Google to shut down the coronavirus tracker once it is contained - Hindustan Times", "description": "The document clearly mentions that “Google and Apple can disable the exposure notification system on a regional basis when it is no longer needed.”", "url": "https://www.hindustantimes.com/tech/covid-19-apple-google-to-shut-down-the-coronavirus-tracker-once-it-is-contained/story-EpyL70qsPuJdxQnZsNim2I.html", "urlToImage": null, "publishedAt": "2020-04-26T08:56:47Z", "content": "While Apple and Google are working on using your smartphone’s Bluetooth and location tracking to determine Covid-19 effected people around you, they will also be turning off this tech once the disease is contained. This has been mentioned in the ‘Frequently A… [+1716 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Will Tell TikTok to Block You because You're Annoying: Chris Gayle Trolls Yuzvendra Chahal - News18", "description": "Gayle referred to Chahal as 'annoying' and went on to the extent of saying that he is going to block him.", "url": "https://www.news18.com/news/buzz/will-tell-tiktok-to-block-you-because-youre-annoying-chris-gayle-trolls-yuzvendra-chahal-2593275.html", "urlToImage": null, "publishedAt": "2020-04-26T08:34:30Z", "content": "West Indies batsman Chris Gayle brutally roasted India spinner Yuzvendra Chahal for his social media posts during a live session on popular social media platform Instagram. With no cricket going due to coronavirus pandemic, players are engaging with fans thes… [+1055 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "As coronavirus stalls global growth, safe haven gold may touch Rs 52,000 by next Akshaya Tritiya - Moneycontrol.com", "description": "However, experts also warn that if a COVID-19 vaccine is developed and economic activity picks up, then there could be a major correction in gold prices.", "url": "https://www.moneycontrol.com/news/business/markets/as-coronavirus-stalls-global-growth-safe-haven-gold-may-touch-rs-52000-by-next-akshaya-tritiya-5190361.html", "urlToImage": null, "publishedAt": "2020-04-26T08:03:00Z", "content": "Buying gold as a coin or in some form of jewellery on the occasion of Akshaya Tritiya, an auspicious time for Hindus and Jains, is always considered as a good start and there are beliefs that it brings unending prosperity.\r\nBut this time the situation is diff… [+5167 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": null, "title": "Did you know Shah Rukh Khan cheated wife Gauri on their honeymoon? - Asianet News English", "description": "In an event, Shah Rukh Khan revealed a hilarious story from his honeymoon, where he tricked his wife Gauri", "url": "https://newsable.asianetnews.com/gallery/entertainment/did-you-know-shah-rukh-khan-cheated-wife-gauri-on-their-honeymoon--q9dx5f", "urlToImage": null, "publishedAt": "2020-04-26T07:37:19Z", "content": "\"This is my favourite picture...When I got married, I was very poor while Gauri was middle class, well to do. So like how usually everyone does, I had promised her that after we get married, I'll take her to Paris and show her the Eiffel Tower. But obviously,… [+374 chars]"}, {"source": {"id": null, "name": "Scoopwhoop.com"}, "author": "Pradamini Kumari", "title": "In Good News, The Largest Hole In The Ozone Layer Has Apparently Healed Itself - ScoopWhoop", "description": "Scientists have confirmed that the 1 million square kilometre wide hole in the ozone layer over the Arctic has finally healed.", "url": "https://www.scoopwhoop.com/news/scientists-claim-largest-hole-in-the-ozone-layer-healed-itself/", "urlToImage": null, "publishedAt": "2020-04-26T07:26:33Z", "content": "When we say planet Earth is healing, we literally mean it. \r\nAccording to reports, scientists have confirmed that the 1 million square kilometre wide hole in the ozone layer over the Arctic has finally healed. And, apparently the hole over the north pole has … [+2217 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "New York starts antibody testing medical front-line workers - Al Jazeera English", "description": "The US state of New York has begun antibody tests for front-line healthcare workers. The screening programme will examine whether doctors and nurses working ...", "url": "https://www.youtube.com/watch?v=eVueTtGNPhU", "urlToImage": null, "publishedAt": "2020-04-26T05:24:44Z", "content": null}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Reuters", "title": "'I want my life back': Germans protest against lockdown - The Hindu", "description": "Germany has put in place strict curbs on public activity, imposing its lockdown on March 17", "url": "https://www.thehindu.com/news/international/i-want-my-life-back-germans-protest-against-lockdown/article31436294.ece", "urlToImage": null, "publishedAt": "2020-04-26T02:39:59Z", "content": "German police wearing riot gear and face masks tussled on Saturday with dozens of protesters demonstrating in central Berlin against the coronavirus lockdown on public life.\r\nProtesters shouted I want my life back and held up signs with slogans such as Protec… [+2371 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "Android 11 DP3 adds new sensitivity options for gesture navigation - Android Police", "description": "Google was changing Android 10's full-screen gesture navigation all the way up to release, and you could definitely make the argument that there were", "url": "https://www.androidpolice.com/2020/04/25/android-11-dp3-adds-new-sensitivity-options-for-gesture-navigation/", "urlToImage": null, "publishedAt": "2020-04-25T18:49:39Z", "content": "Google was changing Android 10's full-screen gesture navigation all the way up to release, and you could definitely make the argument that there were still unresolved issues I still frequently go back when I'm trying to open an app's side menu. Thankfully, th… [+740 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Sunetra Choudhury", "title": "CEA points at Spanish Flu lesson in Covid fight - Hindustan Times", "description": "The  Spanish flu emerged in 1918 and claimed 39 million lives till 1920.", "url": "https://www.hindustantimes.com/india-news/cea-points-at-spanish-flu-lesson-in-covid-fight/story-bMWrrU9fXxrCfKLjyVM96M.html", "urlToImage": null, "publishedAt": "2020-04-25T18:15:05Z", "content": "A paper recently published by the US-based National Bureau of Economic Research (NBER) is bringing considerable comfort to policy makers here. Chief Economic Advisor KV Subramanian was the first to draw attention to the research and others like it on the Span… [+2689 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "India records lowest daily growth rate in COVID-19 cases on Saturday since it crossed 100 cases - Economic Times", "description": "The 13th meeting of the high-level Group of Ministers (GoM) on COVID-19 was held under the chairpersonship of Union Health Minister Harsh Vardhan on Saturday.", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/india-records-lowest-daily-growth-rate-in-covid-19-cases-on-saturday-since-it-crossed-100-cases/articleshow/75376244.cms", "urlToImage": null, "publishedAt": "2020-04-25T14:58:00Z", "content": "NEW DELHI: The average doubling rate of COVID-19 cases in the country is 9.1 days as of now and from Friday 8 am to Saturday 8 am, India recorded a six-per cent growth in new cases, which is the lowest daily growth rate recorded since the country crossed 100 … [+3844 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Mumbai Mirror", "title": "Dharavi records 21 new cases, total cases from the slum stand at 241 - Mumbai Mirror", "description": "On Saturday, 21 new cases were recorded from Mumbai's Dharavi, thus taking the total number of people infected in the slum area to 241, so far. 14 people from the Asia's largest slum have succumbed t", "url": "https://mumbaimirror.indiatimes.com/coronavirus/news/dharavi-records-21-new-cases-total-cases-from-the-slum-stand-at-241/articleshow/75378513.cms", "urlToImage": null, "publishedAt": "2020-04-25T13:16:00Z", "content": "With each passing day, positive coronavirus\r\n cases are spiking in Maharashtra\r\n and the nation. On Saturday, 21 new cases were recorded from Mumbai\r\n's Dharavi\r\n, thus taking the total number of people infected in the slum area to 241, so far. 14 people from… [+1179 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Covid-19 pandemic: Centre’s do’s and don’ts on maintaining AC temperature, ventilation - Hindustan Times", "description": "As per the guidelines, it is ideal to operate the air-conditioner between 24-30 degree centigrade at home amid the coronavirus pandemic.", "url": "https://www.hindustantimes.com/india-news/covid-19-pandemic-centre-s-do-s-and-don-ts-on-maintaining-ac-temperature-ventilation/story-XgfKRZ4u6KSUKzVnKAQ3CO.html", "urlToImage": null, "publishedAt": "2020-04-25T11:16:54Z", "content": "Amid public concerns associated with air conditioning, ventilation and the spread of coronavirus, the government has issued guidelines compiled by the Indian Society of Heating Refrigerating and Air Conditioner Engineers (ISHRAE).\r\nThe ISHRAE guidelines on th… [+2562 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Cosmic Reef: NASA release an image of a blazing starbirth to mark Hubble's 30th birthday - Firstpost", "description": "Hubble has been placed in space to observe the most distant stars and galaxies, as well as planets in our solar system.", "url": "https://www.firstpost.com/tech/science/cosmic-reef-nasa-release-an-image-of-a-blazing-starbirth-to-mark-hubbles-30th-birthday-8299671.html", "urlToImage": null, "publishedAt": "2020-04-25T10:23:08Z", "content": "FP TrendingApr 25, 2020 16:24:11 IST\r\nThe US space agency has released a new bright picture of a firestorm of starbirth to mark the 30th anniversary of the Hubble Space Telescope. Scientists have called the picture Cosmic Reef, as it resembles a coral reef fl… [+1921 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Anushka Sharma’s Small Gesture During Virat Kohli’s Live Chat Leaves Him Blushing, Watch Here - News18", "description": "Virat Kohli was having an Instagram Live session when his wife helped him by turning on the lights of the room.", "url": "https://www.news18.com/news/movies/anushka-sharmas-small-gesture-during-virat-kohlis-live-chat-leaves-him-blushing-watch-here-2592223.html", "urlToImage": null, "publishedAt": "2020-04-25T08:34:28Z", "content": "Lovebirds Anushka Sharma and Virat Kohli are spending the lockdown time together at their home. The duo is having quite fun in their day to day routine, making each day special for each other.\r\nThe Indian cricket team captain recently had a live chat session … [+1684 chars]"}, {"source": {"id": null, "name": "Gizmochina.com"}, "author": null, "title": "LG Velvet Specs are out ahead of official launch - gizmochina", "description": "There have been multiple rumours over the past few months regarding LG ditching its G series. The South Korean electronics giant confirmed it by revealing new ‘Velvet’ branding, which was later followed by a teaser video exposing the entire design to the publ…", "url": "https://www.gizmochina.com/2020/04/25/lg-velvet-specs-are-out-ahead-of-official-launch/", "urlToImage": null, "publishedAt": "2020-04-25T07:24:00Z", "content": "There have been multiple rumours over the past few months regarding LG ditching its G series. The South Korean electronics giant confirmed it by revealing new Velvet branding, which was later followed by a teaser video exposing the entire design to the public… [+1772 chars]"}]}