{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Will never leave RCB: Virat Kohli tells IPL teammate AB de Villiers - Trendinindia", "description": "RCB stalwarts Virat Kohli and AB de Villiers on Friday declared in unison that they had no intention of leaving the side for as long as they play the IPL.", "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-ab-de-villiers-never-leave-rcb-ipl-2020-coronavirus-1670731-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T22:39:30Z", "content": "Virat Kohli and AB de Villiers - long-time friends and teammates at Indian Premier League (IPL) franchise Royal Challengers Bangalore (RCB) revealed their great admiration and love for the side even as the tournament itself has failed to get underway in its 2… [+3010 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "NASA engineers build low-cost ventilator to fight Covid-19 - Times of India", "description": "Science News: WASHINGTON: NASA engineers have designed a new low-cost high-pressure ventilator tailored specifically to treat Covid-19 patients.", "url": "https://timesofindia.indiatimes.com/home/science/nasa-engineers-build-low-cost-ventilator-to-fight-covid-19/articleshow/75359739.cms", "urlToImage": null, "publishedAt": "2020-04-24T21:24:53Z", "content": "WASHINGTON: NASA engineers have designed a new low-cost high-pressure ventilator tailored specifically to treat Covid-19 patients.\r\nThe device, called VITAL (Ventilator Intervention Technology Accessible Locally), passed a critical test on April 21 at the Ica… [+2140 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Luke Hurst", "title": "Hubble at 30: Take a look back at some of the telescope's best images - Euronews", "description": "The Hubble Space Telescope turned 30 on Friday, and to mark the occasion Hubble released a fittingly awesome image.", "url": "https://www.euronews.com/2020/04/24/hubble-turns-30-take-a-look-back-at-some-of-the-space-telescope-s-best-images", "urlToImage": null, "publishedAt": "2020-04-24T21:06:33Z", "content": "The Hubble Space Telescope turned 30 on Friday, and to mark the occasion Hubble released a fittingly awesome image. \r\nShowing two nebulas, NGC 2020 and NGC 2014, some 163,000 light years from Earth, the image reveals part of a vast star-forming region in the … [+1048 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "ESPNcricinfo staff", "title": "MS Dhoni 'doesn't want to' play for India again, says Harbhajan Singh | ESPNcricinfo.com - ESPNcricinfo", "description": "The offspinner speaks to Rohit Sharma on Dhoni's future and India's 2019 World Cup exit | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29093560/ms-dhoni-want-play-india-hints-harbhajan-singh", "urlToImage": null, "publishedAt": "2020-04-24T19:28:28Z", "content": "As far as Harbhajan Singh is concerned, MS Dhoni will never play for India again. Harbhajan, who trained with Dhoni in March at the Chennai Super Kings' preparatory camp for the IPL, said the former India captain had \"played enough\" for India.\r\nRecently, as s… [+4213 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Ultimate Comparison: iPhone SE (2020) VS iPhone 11! - AppleInsider", "description": "AppleInsider compares the brand new 2020 iPhone SE against the iPhone 11 to see how much of a difference there is. : ➡ Grab the lowest prices on Apple hardwa...", "url": "https://www.youtube.com/watch?v=0sr9gG0ma44", "urlToImage": null, "publishedAt": "2020-04-24T19:16:05Z", "content": "AppleInsider compares the brand new 2020 iPhone SE against the iPhone 11 to see how much of a difference there is.\r\n: \r\nGrab the lowest prices on Apple hardware:\r\nMacs - https://prices.appleinsider.com/curre...iPads - https://prices.appleinsider.com/ipadApple… [+1026 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "AFP", "title": "Coronavirus | U.S. President Donald Trump says he spoke ‘sarcastically’ about injecting disinfectants - The Hindu", "description": "\"I was asking a question sarcastically to reporters like you, just to see what would happen,\" he told journalists at the White House.", "url": "https://www.thehindu.com/news/international/coronavirus-us-president-donald-trump-says-spoke-sarcastically-about-injecting-disinfectants/article31428311.ece", "urlToImage": null, "publishedAt": "2020-04-24T18:40:02Z", "content": "President Donald Trump on April 24 played down a furore over his suggestion that people could try injecting disinfectants to fight the novel coronavirus, claiming he was being sarcastic.\r\nAlso read | U.S. was attacked, says Trump on coronavirus pandemic\r\n\"I w… [+1908 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Carly Page", "title": "The Dell XPS 15 2020 may have been redesigned to take on the MacBook Pro - TechRadar India", "description": "Incoming model will boast smaller bezels and upward-firing speakers", "url": "https://www.techradar.com/news/the-dell-xps-15-2020-may-have-been-redesigned-to-take-on-the-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-24T17:31:00Z", "content": "Dell looks poised to release an all-new version of its XPS 15 laptop that will take a number of design clues from the recently-revamped Dell XPS 13\r\n.\r\nThats according to leaked images posted on the Korea Energy Agency Efficiency Standardization Certification… [+2119 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Bureau", "title": "UBS cuts target prices on bank stocks by 5-41% - Economic Times", "description": "UBS has downgraded SBI to sell from buy and cut target price on it to Rs 160 from Rs 270.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/ubs-cuts-target-price-on-bank-stocks-by-5-41/articleshow/75349388.cms", "urlToImage": null, "publishedAt": "2020-04-24T17:06:00Z", "content": "Mumbai: UBS has cut target price of banks by 5-41% as it believes risk-reward remains unfavourable in the sector while risks to collections and credit culture are rising.\r\nThe brokerage has downgraded its rating on HDFC Bank to neutral from buy and cut target… [+1694 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Covid-19 outbreak: Ajax denied title as Dutch Eredivisie season declared void - India Today", "description": "The Dutch Eredivisie season has been ended with immediate effect, meaning league leaders Ajax have been denied the title.", "url": "https://www.indiatoday.in/sports/football/story/covid-19-outbreak-ajax-denied-title-as-dutch-eredivisie-season-declared-void-1670775-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T16:33:44Z", "content": "No top-flight league title will be awarded in the Netherlands after the COVID-19 pandemic brought the campaign to a premature close but Ajax Amsterdam and AZ Alkmaar will qualify for next season's Champions League, Dutch media reported on Friday.\r\nThe reports… [+560 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "BIG STORY | Franklin Templeton India closes 6 funds: All questions answered - Moneycontrol.com", "description": "What the winding up of these credit funds means for investors, explained.", "url": "https://www.moneycontrol.com/news/business/mutual-funds/big-story-franklin-templeton-india-closes-6-funds-all-questions-answered-5187721.html", "urlToImage": null, "publishedAt": "2020-04-24T16:26:00Z", "content": "Franklin Templeton India, one of the largest fund houses in the country, has said it will shut six debt funds that carried credit risk.\r\nWhy did Franklin Templeton India decide to shutter these funds? What happens to your investments?\r\nAlso Read: Franklin Tem… [+654 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Unseen picture of Arun Govil aka Ram and Arvind Trivedi aka Raavan shaking hands from the Ramayan sets - Times of India", "description": "In the image, Arun Govil, who played Lord Ram can be seen shaking hands with Raavan aka Arvind Trivedi. The picture", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/unseen-picture-of-arun-govil-aka-ram-and-arvind-trivedi-aka-raavan-shaking-hands-from-the-ramayan-sets/articleshow/75358544.cms", "urlToImage": null, "publishedAt": "2020-04-24T16:13:00Z", "content": null}, {"source": {"id": null, "name": "Nejm.org"}, "author": null, "title": "Asymptomatic Transmission, the Achilles' Heel of Current Strategies to Control Covid-19 - nejm.org", "description": "Editorial from The New England Journal of Medicine — Asymptomatic Transmission, the Achilles’ Heel of Current Strategies to Control Covid-19", "url": "https://www.nejm.org/doi/full/10.1056/NEJMe2009758", "urlToImage": null, "publishedAt": "2020-04-24T16:03:34Z", "content": "Traditional infection-control and public health strategies rely heavily on early detection of disease to contain spread. When Covid-19 burst onto the global scene, public health officials initially deployed interventions that were used to control severe acute… [+7447 chars]"}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "First-ever digital geological map of moon released by US Geological Survey - Down To Earth Magazine", "description": "It will serve as a blue print for future human lunar missions", "url": "https://www.downtoearth.org.in/news/science-technology/first-ever-digital-geological-map-of-moon-released-by-us-geological-survey-70690", "urlToImage": null, "publishedAt": "2020-04-24T15:59:01Z", "content": "The first ever digital, unified, global, geological map of the moon was released virtually by the  United States Geological Survey (USGS), National Aeronautics and Space Administration (Nasa) and the Lunar Planetary Institute on April 22, 2020.\r\nThe map is a … [+2958 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Coronavirus latest updates: India reports over 23,000 cases; 723 deaths - Times of India", "description": "India News: NEW DELHI: The death toll due to the novel coronavirus rose to 723 with 37 fatalities reported since Thursday evening, while the number of cases saw a.", "url": "https://timesofindia.indiatimes.com/india/coronavirus-latest-updates-about-3-million-jobs-at-risk-due-to-covid-impact-on-indian-airline-industry/articleshow/75339613.cms", "urlToImage": null, "publishedAt": "2020-04-24T15:28:49Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "Xiaomi Mi 10 Youth surfaces in TENAA database - Gizchina.com", "description": "The upcoming Xiaomi Mi 10 Youth has been certified by TENAA. The handset boasts Snapdragon 765G and will be revealed on April 27.", "url": "https://www.gizchina.com/2020/04/24/xiaomi-mi-10-youth-clears-out-tenaa/", "urlToImage": null, "publishedAt": "2020-04-24T15:23:34Z", "content": "The last days of April will be quite hectic for Xiaomi fans. The company will reveal on April 27, next Monday, the highly-anticipated MIUI 12 OS update and a new smartphone dubbed Mi 10 Youth. The handset basically is a rebranded Mi 10 Lite with Snapdragon 76… [+1028 chars]"}, {"source": {"id": null, "name": "Thequint.com"}, "author": "The Quint", "title": "COVID-19 Tally Rises to 23,452 in Biggest One-Day Jump; 723 Dead - The Quint", "description": "COVID-19, Coronavirus Latest News Updates 24 April: Coronavirus: COVID-19 Tally Rises to 23,452 in Biggest One-Day Jump; 723 Dead", "url": "https://www.thequint.com/news/india/coronavirus-covid-19-latest-news-breaking-news-live-updates-24-april", "urlToImage": null, "publishedAt": "2020-04-24T14:47:20Z", "content": null}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Scroll Staff", "title": "Felt embarrassed after Sachin Tendulkar spoke to me about my sledging: Saqlain Mushtaq - Scroll.in", "description": "Former Pakistan off-spinner recalls an incident with the Indian batting legend during a match in the Sahara Cup in Canada.", "url": "https://scroll.in/field/960158/felt-embarrassed-after-sachin-tendulkar-spoke-to-me-about-my-sledging-saqlain-mushtaq", "urlToImage": null, "publishedAt": "2020-04-24T13:54:00Z", "content": "Former Pakistan off-spinner Saqlain Mushtaq on Friday remembered a tense battle with Indian batting legend Sachin Tendulkar in 1990s, leaving him embarrassed following a war of words. \r\nIn one of his early battles with Tendulkar during the Sahara Cup in Canad… [+3279 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Sanchita Sharma", "title": "Six coronavirus vaccines in human trials bring hope for early success - India news - gotech daily", "description": "Covid-19 update: The trial will study whether the new vaccine is safe and can generate strong immune responses against Sars-Cov-2, the virus that causes the coronavirus disease (Covid-19), and protect healthy people from infection.", "url": "https://www.hindustantimes.com/india-news/six-coronavirus-vaccines-in-human-trials-bring-hope-of-early-success/story-N3ZcJMi93NeF0puSIAFuvL.html", "urlToImage": null, "publishedAt": "2020-04-24T13:37:46Z", "content": "Human safety trials of a coronavirus vaccine developed by Oxford University began on Thursday even as Indian company Serum Institute of India started work on making the vaccine locally so as to be ready in case the trial succeeds.\r\nThe trial began in Oxford o… [+7429 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Reuters", "title": "Mystery of India’s lower death rates seems to defy coronavirus trend - Hindustan Times", "description": "Covid-19 in India: Modi imposed a lockdown of India’s 1.3 billion people on March 25 in a bid to stop the spread of the coronavirus, which has infected some 23,077 people, killing 718 of them, according to the latest figures.", "url": "https://www.hindustantimes.com/india-news/why-mystery-of-india-s-lower-death-rates-seems-to-defy-coronavirus-trend/story-cFUg3YGdSk8Cs3gv5dQwQO.html", "urlToImage": null, "publishedAt": "2020-04-24T13:37:07Z", "content": "Parts of India have recorded dramatic falls in mortality rates after a nationwide lockdown was imposed to fight the new coronavirus, suggesting there has not been an undetected surge in virus-related deaths.\r\nAll over the world, mortality rates are being scru… [+4398 chars]"}, {"source": {"id": null, "name": "Devdiscourse.com"}, "author": "PTI", "title": "Key nose cells identified as likely entry points of novel coronavirus - Devdiscourse", "description": "Scientists have identified two specific cell types in the nose as likely initial infection points for the novel coronavirus that causes COVID-19. The researche", "url": "https://www.devdiscourse.com/article/health/1022363-key-nose-cells-identified-as-likely-entry-points-of-novel-coronavirus", "urlToImage": null, "publishedAt": "2020-04-24T12:56:53Z", "content": "Scientists have identified two specific cell types in the nose as likely initial infection points for the novel coronavirus that causes COVID-19. The researchers, including those from the Wellcome Sanger Institute in the UK and University Medical Centre Groni… [+2333 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "COVID-19: Plasma Therapy likely to begin from April 25 in Karnataka - Deccan Herald", "description": "Karnataka is likely to start Convalescent Plasma Therapy for COVID-19 patients, who are critical, from tomorrow, Medical Education Minister K Sudhakar said here on on Friday. \"We have already got approval for Convalescent Plasma Therapy.", "url": "https://www.deccanherald.com/state/top-karnataka-stories/covid-19-plasma-therapy-likely-to-begin-from-april-25-in-karnataka-829398.html", "urlToImage": null, "publishedAt": "2020-04-24T12:55:53Z", "content": "Karnataka is likely to start Convalescent Plasma Therapy for COVID-19 patients, who are critical, from tomorrow, Medical Education Minister K Sudhakar said here on on Friday. \"We have already got approval for Convalescent Plasma Therapy.\r\nFollow latest update… [+1640 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Afghanistan: Taliban rejects call for ceasefire during Ramadan - Al Jazeera English", "description": "President Ashraf Ghani had appealed to the group to lay down arms for the Islamic holy month that began on Friday.", "url": "https://www.aljazeera.com/news/2020/04/afghanistan-taliban-rejects-call-ceasefire-ramadan-200424104202456.html", "urlToImage": null, "publishedAt": "2020-04-24T12:55:26Z", "content": "The Taliban has rejected a government call for a ceasefire in Afghanistan for the holy month of Ramadan, saying a truce is \"not rational\" as they ramp up attacks on government forces.\r\nAfghan President Ashraf Ghani had appealed to the armed group to lay down … [+2075 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Day 31 of coronavirus lockdown: Ground report from Indian cities - Times of India", "description": "India News: NEW DELHI: The number of coronavirus cases in India have crossed the 23,000 mark.", "url": "https://timesofindia.indiatimes.com/india/day-31-of-coronavirus-lockdown-ground-report-from-indian-cities/articleshow/75345447.cms", "urlToImage": null, "publishedAt": "2020-04-24T12:10:18Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETMarkets.com", "title": "Mindtree Q4 results: Net profit jumps 3.9% YoY to Rs 206 crore; firm announces dividend of Rs 10 per share - Economic Times", "description": "The company had reported profit at Rs 198.4 crore in the corresponding quarter last year.", "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/mindtree-q4-results-net-profit-jumps-3-9-yoy-to-rs-206-crore/articleshow/75351409.cms", "urlToImage": null, "publishedAt": "2020-04-24T11:59:00Z", "content": "New Delhi: Mindtree on Friday reported 3.9 per cent year-on-year (YoY) jump in consolidated net profit at Rs 206.2 crore for the fourth quarter ended March 31. The company had reported profit at Rs 198.4 crore in the corresponding quarter last year. \r\nConsoli… [+1202 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus crisis | PM Modi to take a call on another relief package after April 27 meet with CMs - Moneycontrol", "description": "Moneycontrol had reported on April 23 that Prime Minister Narendra Modi is expected to meet finance ministry officials soon to take stock of the economic situation", "url": "https://www.moneycontrol.com/news/business/economy/coronavirus-crisis-pm-modi-to-take-a-call-on-another-relief-package-after-april-27-meet-with-cms-5186511.html", "urlToImage": null, "publishedAt": "2020-04-24T11:58:26Z", "content": "A decision to provide another economic relief package would be taken after Prime Minister Narendra Modi meets chief ministers on April 27.\r\n\"The prime minister would be meeting chief ministers on Monday. A fiscal package would be announced after taking into c… [+1910 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Ramadan 2020: Holy month begins on 25 April with sighting of crescent moon; Muslims to observe day-long... - Firstpost", "description": "It is believed that it was during the month of Ramadan, the Quran was first revealed to Prophet Muhammad.", "url": "https://www.firstpost.com/india/ramadan-2020-holy-month-begins-on-25-april-with-sighting-of-crescent-moon-muslims-to-observe-day-long-fasts-from-tomorrow-8293201.html", "urlToImage": null, "publishedAt": "2020-04-24T11:42:44Z", "content": "The holy month of Ramadan falls on the ninth month of the Islamic lunar calendar. Observed by Muslims across the world, people fast from dawn to dusk during this time. Ramadan begins with the sighting of the crescent moon.\r\nIt is believed that it was during t… [+1820 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Mumbai Mirror", "title": "COVID-19 cases in India rise, but doubling rate slows down to 10 days - Pune Mirror", "description": "During the week of March 24 to 31, the doubling rate was in the range of five. However, now it is close to 10 days.", "url": "https://mumbaimirror.indiatimes.com/coronavirus/news/covid-19-cases-in-india-rise-but-doubling-rate-slows-down-to-10-days/articleshow/75351272.cms", "urlToImage": null, "publishedAt": "2020-04-24T11:35:00Z", "content": "Even though the number of COVID-19\r\n cases continues to rise in the country, in some relief, the Health Ministry\r\n on Friday said that the doubling rate of the novel coronavirus\r\n patients now stands at 10 days.\r\nIn the last 24 hours, 1684 new patients tested… [+1461 chars]"}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "Vishwanath Nair", "title": "Large Firms Start Seeking Loan Moratorium From Banks - BloombergQuint", "description": "A look at some of the top firms that have approached their lenders for the moratorium.", "url": "https://www.bloombergquint.com/business/large-corporates-start-seeking-loan-repayment-moratorium-from-banks", "urlToImage": null, "publishedAt": "2020-04-24T11:21:38Z", "content": ""}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Sangeeta Ojha", "title": "Tamil Nadu announces complete lockdown in Chennai, 4 other cities - Livemint", "description": "Tamil Nadu CM has ordered tightening of the lockdown in Chennai, Coimbatore, Madurai, Tiruppur and Salem.Edappadi Palaniswami said online food delivery will be allowed during the lockdown", "url": "https://www.livemint.com/news/india/tamil-nadu-announces-complete-lockdown-in-chennai-coimbatore-madurai-salem-tiruppur-11587722390572.html", "urlToImage": null, "publishedAt": "2020-04-24T10:26:53Z", "content": "Tamil Nadu Chief Minister Edappadi K. Palaniswami has ordered tightening of the lockdown in Chennai, Coimbatore, Madurai, Tiruppur and Salem in view of the rising coronavirus cases, news Agency ANI reported. The decision was taken after Palaniswami chaired a … [+1570 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Divyanka, Sidharth Shukla, Parth Samthaan and others unite for Ekta Kapoor's short film on Covid-19 - India Today", "description": "Ekta Kapoor shared the short film on social media, which features TV actors Divyanka Tripathi, Parth Samthaan, Sidharth Shukla, Erica Fernandes, Shabir Ahluwalia, Sriti Jha, Rohitashv Gour, Anita Hassanandani and Karishma Tanna, among others.", "url": "https://www.indiatoday.in/television/celebrity/story/divyanka-sidharth-shukla-parth-samthaan-and-others-unite-for-ekta-kapoor-s-short-film-on-covid-19-1670567-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T10:18:45Z", "content": "Producers and television actors have joined hands for a short film, which spreads awareness on the need to stay at home to contain the spread of the Covid-19 pandemic. The initiative was spearheaded by TV czarina Ekta Kapoor and includes other TV producers Bi… [+3193 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "COVID-19 cases in India cross 23,000 - The News Minute", "description": "As India attempts to flatten the curve of the novel coronavirus and is currently under lockdown, some states are continuing to see a steady rise in cases. India is under lockdown till May 3 to help stop the spread of COVID-19. The number of cases in India has…", "url": "https://www.thenewsminute.com/article/covid-19-cases-india-cross-23000-123232", "urlToImage": null, "publishedAt": "2020-04-24T09:57:43Z", "content": "Over 4,700 people have recovered from the disease, and 718 people have died, according to government data.As India attempts to flatten the curve of the novel coronavirus and is currently under lockdown, some states are continuing to see a steady rise in cases… [+1681 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "China names its Mars mission Tianwen-1 ahead of its planned launch this year - The Hindu", "description": "Aiming to catch up with India, U.S., Russia and the European Union to reach the red planet, China’s Mars mission plans to complete orbiting, landing and roving in one mission", "url": "https://www.thehindu.com/news/international/china-names-its-mars-mission-tianwen-1-ahead-of-its-planned-launch-this-year/article31422712.ece", "urlToImage": null, "publishedAt": "2020-04-24T08:40:02Z", "content": "China on Friday named its first Mars exploration mission to be launched later this year as Tianwen-1 as it celebrated Space Day to mark the 50th anniversary of the launch of the countrys first satellite Dong Fang Hong-1 in 1970.\r\n Aiming to catch up with Indi… [+3236 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AFP", "title": "You've got mail: Tom Hanks writes to bullied boy called 'Corona' - Livemint", "description": "Tom Hanks and his wife Rita Wilson contracted Covid-19 in March.Eight-year-old Corona De Vries sent a letter to Hanks asking after his health", "url": "https://www.livemint.com/news/world/you-ve-got-mail-tom-hanks-writes-to-bullied-boy-called-corona-11587712686667.html", "urlToImage": null, "publishedAt": "2020-04-24T07:26:46Z", "content": "Hollywood megastar and coronavirus survivor Tom Hanks has written a comforting letter to a bullied Australian boy called Corona and gifted him a cherished typewriter bearing the same name.Hanks and his wife Rita Wilson contracted COVID-19, the disease caused … [+976 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Anulekha Ray", "title": "Plasma therapy shows positive results on COVID-19 patients, says Kejriwal - Livemint", "description": "Four COVID-19 patients had plasma therapy treatment in Delhi's Lok Nayak Jai Prakash Narayan Hospital in the last few weeks.Delhi government decided to conduct plasma therapy on three more patients in the next few days", "url": "https://www.livemint.com/news/india/plasma-therapy-shows-positive-results-on-covid-19-patients-says-arvind-kejriwal-11587712477476.html", "urlToImage": null, "publishedAt": "2020-04-24T07:24:42Z", "content": "Delhi chief minister Arvind Kejriwal said today that plasma therapy showed positive results on coronavirus patients in the capital. Four COVID-19 patients had plasma therapy treatment in Delhi's Lok Nayak Jai Prakash Narayan Hospital in the last few weeks. Th… [+2596 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Police complaint against Kangana Ranaut over video supporting sister, Varun Dhawan celebrates birthday... - Hindustan Times", "description": "Top entertainment news: Actor Varun Dhawan celebrated his 33rd birthday with family in the midst of Covid 19 lockdown and a police complaint has been filed against Kangana Ranaut for her video supporting her sister Rangoli Chandel.", "url": "https://www.hindustantimes.com/bollywood/police-complaint-against-kangana-ranaut-over-video-supporting-sister-varun-dhawan-celebrates-birthday-at-home/story-RRTN0d9UJId9uoFyezOwHO.html", "urlToImage": null, "publishedAt": "2020-04-24T04:56:47Z", "content": "Varun Dhawan celebrates 33rd birthday at home amid lockdown, Nora Fatehi, Karan Johar shower him with love. See pics\r\nActor Varun Dhawan turned 33 on Friday and celebrated it with his family amid coronavirus lockdown. The actor took to Instagram stories to sh… [+2263 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Scroll Staff", "title": "Covid-19: India tally makes biggest single-day jump, US toll crosses 50,000 - Scroll.in", "description": "The total number of coronavirus cases in India rose to 23,452.", "url": "https://scroll.in/latest/960080/coronavirus-iit-delhi-says-icmr-approved-its-affordable-testing-kits-mumbai-breaches-4000-mark", "urlToImage": null, "publishedAt": "2020-04-24T02:37:00Z", "content": "10.45 pm: Here are the top updates from Friday: \r\n<ol><li>The number of coronavirus cases in India rose to 23,452 on Friday evening, according to data from the health ministry. The Indian Council of Medical Research, however, said that at least 23,502 people … [+35735 chars]"}, {"source": {"id": null, "name": "Pocketnow.com"}, "author": "Lee Kelly", "title": "Realme X50m brings 120Hz display, quad cameras, and 5G support at just $280 - PocketNow", "description": "Realme X50m is powered by the octa-core Qualcomm Snapdragon 765G processor and also brings support for 30W wired fast charging.", "url": "https://pocketnow.com/realme-x50m-brings-120hz-display-quad-cameras-and-5g-support-at-just-280", "urlToImage": null, "publishedAt": "2020-04-23T16:01:00Z", "content": "Realme, the OPPO spin-off brand that is primarily focused on the Indian and Chinese market, has today launched a new mid-range phone called Realme X50m. Starting at just ¥1,999 (~280), the Realme X50m packs quite a punch given its on-paper hardware. \r\nKey hig… [+1306 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Sriharsha Devulapalli, Pooja Dantewadia", "title": "Mint Covid Tracker: New infections rising fastest in Gujarat, deaths spiking in Rajasthan - Livemint", "description": "At the current trajectory, the number of covid-19 cases in India could cross 30,000 in the next four days", "url": "https://www.livemint.com/news/india/mint-covid-tracker-new-infections-rising-fastest-in-gujarat-deaths-spiking-in-rajasthan-11587611930257.html", "urlToImage": null, "publishedAt": "2020-04-23T03:44:49Z", "content": "The number of reported covid-19 cases in India rose by 16 percent over the past two days to 20,471, data from the ministry of health and family welfare (MoHFW) published last evening showed. This is a slower rate of increase as compared to the previous 48 hou… [+3915 chars]"}]}