{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Thenewsopediaindia.co.in"}, "author": "rishixkumar00", "title": "With record 931 new Covid-19 cases in a day, Singapore emerges as Asia’s hotspot - The Newsopedia", "description": "Singapore on Sunday reported 931 new cases of coronavirus disease Covid-19 which took its total to 13,624. Most of the new infections are from foreign workers’ dormitories, which have", "url": "https://www.thenewsopediaindia.co.in/news/world/with-record-931-new-covid-19-cases-in-a-day-singapore-emerges-as-asias-hotspot-world-news/", "urlToImage": null, "publishedAt": "2020-04-26T08:06:58Z", "content": "Singapore on Sunday reported 931 new cases of coronavirus disease Covid-19 which took its total to 13,624. Most of the new infections are from foreign workers dormitories, which have been locked down as the government struggles to curb the outbreak.\r\nFifteen … [+1711 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "India's holding of US govt securities hits record high of $177.5 bn in Feb - Moneycontrol", "description": "Latest data from the US Treasury Department showed that the amount of securities owned by India has also gone up by the maximum quantum in a span of one month, amid the country slowly hiking the level since November last year when it stood at USD 159.2 billio…", "url": "https://www.moneycontrol.com/news/world/indias-holding-of-us-govt-securities-hits-record-high-of-177-5-bn-in-feb-5190351.html", "urlToImage": null, "publishedAt": "2020-04-26T07:55:08Z", "content": "Continuing to increase its exposure, India's holding of US government securities jumped by over USD 13 billion in a month to record high of USD 177.5 billion at the end of February. In the last one year since February 2019, the overall holding of India has ju… [+2636 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "JioMart gets a WhatsApp number, rolls out services in areas near Mumbai - Moneycontrol", "description": "Launched in January, the web-only arm of Reliance Retail allows consumers to purchase from among 50,000 products including groceries and other essential items.", "url": "https://www.moneycontrol.com/news/business/jiomart-gets-a-whatsapp-number-rolls-out-services-in-areas-near-mumbai-5190331.html", "urlToImage": null, "publishedAt": "2020-04-26T07:50:23Z", "content": "After signing a historic $5.7 billion deal with Facebook on April 22, Reliance Industries e-commerce platform JioMart is now live in Kalyan, Thane and Navi Mumbai near Mumbai.\r\nCustomers can place an order on JioMarts WhatsApp number 88500 08000 using their p… [+2645 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Mark Zuckerberg on rise of video conferencing apps amid Covid-19 pandemic - Hindustan Times", "description": "Zuckerberg said there is a ‘temporary’ peak right now but the trend was always headed towards that direction.", "url": "https://www.hindustantimes.com/tech/mark-zuckerberg-on-rise-of-video-conferencing-apps-amid-covid-19-pandemic/story-4nQtPZHKKRjfukcIo5DlnI.html", "urlToImage": null, "publishedAt": "2020-04-26T07:28:23Z", "content": "The rise of video conferencing app is one of the by-products of the ongoing of Covid-19 pandemic. From Zoom to HouseParty, a slew of video calling applications have started to gain huge traction. Facebook is also joining the fray with Messenger Rooms and a bu… [+2276 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Irrfan Khan attends mother Saeda Begum’s funeral via video conferencing - Hindustan Times", "description": "Irrfan Khan’s mother Saeda Begum died on Saturday morning. The actor could not make it to her funeral, owing to the lockdown.", "url": "https://www.hindustantimes.com/bollywood/irrfan-khan-attends-mother-saeda-begum-s-funeral-via-video-conferencing/story-U1oaroYOIteMiIH1R9zxWO.html", "urlToImage": null, "publishedAt": "2020-04-26T06:37:04Z", "content": "Unable to travel to Rajasthan for his mother Saeda Begum’s last rites, Irrfan Khan was a part of the funeral through video conferencing. Her last rites were performed on Saturday evening at Chungi Naka graveyard on the outskirts of Jaipur. DNA reports that on… [+1143 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Pat Cummins recalls Cheteshwar Pujara's exploits Down Under, picks him as toughest batsman to bowl - India Today", "description": "Australian fast bowler Pat Cummins said that Cheteshwar Pujara remains one of the toughest he has ever bowled to especially Test cricket.", "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-recalls-cheteshwar-pujara-exploits-australia-picks-him-toughest-batsman-to-bowl-in-tests-1671223-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T06:32:34Z", "content": "World No.1 Test bowler Pat Cummins has revealed that India's Cheteshwar Pujara is the toughest batsman to bowl to in the longest format of the game.\r\nCheteshwar Pujara had helped India orchestrate their maiden Test series victory in Australia last year as he … [+1384 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Sandeep Phukan", "title": "India’s decision to supply medicines to countries was guided by its ethos, says PM Modi - The Hindu", "description": "PM hails contribution of state govts in fight against COVID-19 pandemic, says they have played a very active role.", "url": "https://www.thehindu.com/news/national/modi-on-mann-ki-baat/article31436630.ece", "urlToImage": null, "publishedAt": "2020-04-26T06:24:56Z", "content": "Prime Minister Narendra Modi on the April 26 edition of his monthly radio broadcast, Mann ki Baat, addressed the people mentioning all the measures taken to fight the deadly Coronavirus and appreciated the work done by citizens and people from various special… [+4079 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Don't issue virus 'immunity passports': WHO - Telangana Today", "description": "Geneva: Governments should not issue so-called immunity passports or risk-free certificates as a way of easing lockdowns, the World Health Organization (WHO) said. The WHO's guidance is based on evidence from researchers all around the world. But it could wel…", "url": "https://telanganatoday.com/dont-issue-virus-immunity-passports-who", "urlToImage": null, "publishedAt": "2020-04-26T06:15:00Z", "content": "Geneva: Governments should not issue so-called “immunity passports” or “risk-free certificates” as a way of easing lockdowns, the World Health Organization (WHO) said.\r\nThe WHO’s guidance is based on evidence from researchers all around the world. But it coul… [+2984 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express Web Desk", "title": "Coronavirus India LIVE Updates: ‘Intense lockdown’ in 5 Tamil Nadu cities, over 26,000 cases in India - The Indian Express", "description": "Coronavirus (COVID-19) Tracker India Latest News Updates LIVE: Of the 26,496 cases, 19,868 are active, while 5,804 are recovered patients. With 49 casualties in the past 24 hours, the death toll is pegged at 824", "url": "https://indianexpress.com/article/india/coronavirus-cases-in-india-live-news-latest-updates-covid-19-tracker-total-corona-cases-in-india-and-global-6379356/", "urlToImage": null, "publishedAt": "2020-04-26T06:03:05Z", "content": "The Centre has issued orders allowing shops and markets in rural areas and stand-alone shops in urban areas to open for sale (Express Photo: Srinivas K)\r\nThe nationwide tally of coronavirus positive patients neared 25,000 on Saturday with fresh cases getting … [+3691 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "China health officials notice rise in imported cases, fear resurgence of Covid-19 - Hindustan Times", "description": "Death toll in China remained at 4,632 for the past 10 days, according to data released by the National Health Commission (NHC) on Sunday.", "url": "https://www.hindustantimes.com/world-news/china-health-officials-notice-rise-in-imported-cases-fear-resurgence-of-covid-19/story-VBEExPOcfG6lPgBGGfPhzL.html", "urlToImage": null, "publishedAt": "2020-04-26T05:35:57Z", "content": "China confirmed 11 new coronavirus cases, including six locally transmitted infections, taking the total count to 82,827, while a senior health official has warned of domestic resurgence of COVID-19 due to the rise in imported cases.\r\nDeath toll in China rema… [+1773 chars]"}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "Alex  Mathew", "title": "BQ Big Decisions: As A Crisis Hits Debt Funds, Is Your Money Safe? - BloombergQuint", "description": "Should you approach investing in debt mutual funds differently now?", "url": "https://www.bloombergquint.com/business/bq-big-decisions-as-a-crisis-hits-debt-funds-is-your-money-safe", "urlToImage": null, "publishedAt": "2020-04-26T05:25:49Z", "content": "BloombergQuints Big Decisions podcast gets you the insights you need to make big money decisions with confidence.\r\nWhen Franklin Templeton Mutual Fund wound up its six yield-oriented, managed credit funds last week, it shook the confidence of a large number o… [+485 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Priyanka Chopra Jonas wears a saree at home as she poses for a romantic picture with hubby Nick Jonas ami - Times of India", "description": "Lockdown has given ample time to our B-town celebrities to spend quality time with their loved ones. Every day we g", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/priyanka-chopra-jonas-wears-a-saree-at-home-as-she-poses-for-a-romantic-picture-with-hubby-nick-jonas-amid-the-lockdown/articleshow/75386442.cms", "urlToImage": null, "publishedAt": "2020-04-26T05:05:00Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "Vishal Mathur", "title": "NASA Engineers Built This COVID Ventilator in 37 Days, And it Has Already Passed a Key Test - 360TopNews", "description": "VITAL has a design that allows flexibility of use, which makes it relevant for temporary hospitals and health facilities that may already be running short of medical equipment.", "url": "https://www.news18.com/news/tech/nasa-engineers-built-this-covid-ventilator-in-37-days-and-it-has-already-passed-a-key-test-2593003.html", "urlToImage": null, "publishedAt": "2020-04-26T05:01:37Z", "content": "As NASA says, they usually build spacecrafts and not medical devices. But as it turns out, when they do decide to make one, they do a rather fine job of it. The National Aeronautics and Space Administration (NASA) has developed a ventilator as the world strug… [+2354 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "PTI", "title": "Coronavirus Death Toll in India Rises to 824, Total Number of Cases Now at 26,496 - News18", "description": "Of the 45 deaths reported since Saturday evening, 22 are from Maharashtra, six in Gujarat, seven from Madhya Pradesh, one from among others.", "url": "https://www.news18.com/news/india/indias-coronavirus-death-toll-rises-to-824-total-number-of-cases-now-at-26496-2593037.html", "urlToImage": null, "publishedAt": "2020-04-26T04:54:15Z", "content": "New Delhi: The death toll due to COVID-19 rose to 824 and the number of cases climbed to 26,496 in India on Sunday, according to the Union health ministry.\r\nThe death toll increased by 45 and the number of cases has gone up by 1,554 since the ministry last up… [+1072 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "todaynewspaper.in", "title": "As Rumours Surface of Kim Jong Un’s Ill Health, Spotlight on His Sister as Possible Power Centre - Todaynewspaper", "description": "Kim Jong Un with sister Kim Yo Jong (Reuters) Each change of leadership in North Korea has raised the prospect of a leadership vacuum or collapse of the Kim dynasty, which has ruled the country since its founding in 1948. Reuters \r Last Updated: April 26, 202…", "url": "https://www.news18.com/news/world/as-rumours-surface-of-kim-jong-uns-ill-health-spotlight-on-his-sister-as-possible-power-centre-2593017.html", "urlToImage": null, "publishedAt": "2020-04-26T04:52:48Z", "content": "North Korea has never publicised who would follow leader Kim Jong Un in the event he is incapacitated, and with no details known about his young children, analysts say his sister and loyalists could form a regency until a successor is old enough to take over.… [+4343 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Sandhya Ramesh", "title": "Rising CO2 emissions could change the way human brains work, study says - ThePrint", "description": "ScientiFix, our weekly feature, offers you a summary of the top global science stories of the week, with links to their sources.", "url": "https://theprint.in/scientifix/rising-co2-emissions-could-change-the-way-human-brains-work-study-says/409011/", "urlToImage": null, "publishedAt": "2020-04-26T04:45:46Z", "content": "Rising CO2 emissions could affect decision-making in humans\r\nResearchers at the University of Colorado at Boulder have suggested that rising carbon dioxide (CO2) levels could eventually alter basic decision-making skills in humans. Due to fossil-fuel producti… [+2300 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Safoora", "title": "iPhone users! This message can crash Apple devices in seconds - The Siasat Daily", "description": "NEW DELHI: Here’s an important ‘warning’ if you use an Apple devices. There's a text message that has been circulating on secure messaging platform Telegram as well as a number of forums that particularly affects Apple devices running on iOS. This string of c…", "url": "https://www.siasat.com/iphone-users-message-can-crash-apple-devices-seconds-1879653/", "urlToImage": null, "publishedAt": "2020-04-26T04:45:20Z", "content": "NEW DELHI: Heres an important warning if you use an Apple devices.\r\nThere’s a text message that has been circulating on secure messaging platform Telegram as well as a number of forums that particularly affects Apple devices running on iOS.\r\nThis string of ch… [+525 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu Net Desk", "title": "Coronavirus India lockdown Day 33 updates | Positive cases cross 26,500 - The Hindu", "description": "Globally, as of 25 April 2020, there have been 27,24,809 confirmed cases including 1,87,847 deaths, reported to WHO", "url": "https://www.thehindu.com/news/national/india-coronavirus-lockdown-april-26-2020-live-updates/article31436416.ece", "urlToImage": null, "publishedAt": "2020-04-26T04:25:00Z", "content": "India posted 1,554 new cases of COVID-19 since Saturday evening bringing the total number of those confirmed positive to 26,496 according to an update by the Union Ministry of Health and Family Welfare. The death toll stands at 824.\r\nData from States however … [+4927 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Gujarat Covid-19 update: Cases cross 3,000-mark, Centre says situation in Ahmedabad and Surat ‘seri... - Hindustan Times", "description": "Covid-19 cases in Ahmedabad crossed 2,000-mark to reach 2,003 on Saturday as 182 new cases were recorded in the city.", "url": "https://www.hindustantimes.com/india-news/gujarat-covid-19-update-cases-cross-3-000-mark-centre-says-situation-in-ahmedabad-and-surat-serious/story-wldSqAN7D4kkX7wuFkQboO.html", "urlToImage": null, "publishedAt": "2020-04-26T04:02:28Z", "content": "The total number of coronavirus disease Covid-19 cases crossed the 3,000-mark (3,071 to be exact) on Sunday, according to the Uniokn health ministry data. Two hundred fifty six new cases were reported across the state on Saturday.\r\nSix more deaths have taken … [+1149 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Antara Kashyap", "title": "Amitabh Bachchan Jokes About Coronavirus And Netizens Aren't Happy - News18", "description": "Amitabh Bachchan took to Twitter to tell his fans that a bat had entered his room at his residence Jalsa. He joked how the coronavirus is trailing him.", "url": "https://www.news18.com/news/movies/amitabh-bachchan-jokes-about-coronavirus-and-netizens-arent-happy-2592947.html", "urlToImage": null, "publishedAt": "2020-04-26T03:38:37Z", "content": "Superstar Amitabh Bachchan is one of the most active social media users in the Hindi film industry. From motivational videos to viral challenges, the actor participates in most internet content, thereby entertaining his fans. However, his recent attempt at jo… [+2771 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Sonia writes to PM, wants Rs 1 lakh cr wage protection package for MSMEs - Times of India", "description": "India News: In a raft of suggestions to revive the MSME sector after the corona lockdown, Congress president Sonia Gandhi asked PM Narendra Modi to announce a Rs", "url": "https://timesofindia.indiatimes.com/india/sonia-writes-to-pm-wants-rs-1-lakh-cr-wage-protection-package-for-msmes/articleshow/75384846.cms", "urlToImage": null, "publishedAt": "2020-04-26T03:05:52Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Rasesh Mandani", "title": "Bailout plan: Play more matches with India - Hindustan Times", "description": "Later this year, the new Future Tours Programme (FTP) for the years 2023-2031 will be finalised; the ICC continues to be heavily dependent on the BCCI for revenue.", "url": "https://www.hindustantimes.com/cricket/bailout-plan-play-more-matches-with-india/story-VRqndyDqK1aBAy0bT21qoO.html", "urlToImage": null, "publishedAt": "2020-04-26T02:57:47Z", "content": "The Board of Control for Cricket in India (BCCI), the richest body in world cricket, has come up with a plan to help countries facing losses due to the cancellation of cricket worldwide -- although the idea is contingent on games resuming.\r\nAccording to BCCI … [+4642 chars]"}, {"source": {"id": null, "name": "Tribuneindia.com"}, "author": "Tribune News Service", "title": "Neighbourhood shops allowed to open - The Tribune India", "description": "Salons, eateries, liquor vends to remain closed | No relaxation in containment zones", "url": "https://www.tribuneindia.com/news/nation/neighbourhood-shops-allowed-to-open-76317", "urlToImage": null, "publishedAt": "2020-04-26T01:41:26Z", "content": "New Delhi, April 25\r\nFurther easing lockdown restrictions in non-containment zones, the Centre has allowed opening of neighbourhood and standalone shops, including those in residential complexes, within the municipal limits.\r\nThe order was issued late last ni… [+686 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Bengaluru man beats Covid-19, set to be first plasma donor - Times of India", "description": "A 40-year-old man, treated for Covid-19 in Bengaluru, is the first plasma donor in Karnataka.", "url": "https://timesofindia.indiatimes.com/city/bengaluru/bengaluru-man-beats-covid-19-set-to-be-first-plasma-donor/articleshow/75385061.cms", "urlToImage": null, "publishedAt": "2020-04-26T01:33:56Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Reuters", "title": "US airlines receive extra $9.5 bln in payroll support - Hindustan Times", "description": "The Treasury Department also published on Saturday the application form for companies deemed critical to maintaining national security seeking loans from a $17 billion fund.", "url": "https://www.hindustantimes.com/business-news/us-airlines-receive-extra-9-5-bln-in-payroll-support/story-VTRYiDifSzQrVmWgliDm3M.html", "urlToImage": null, "publishedAt": "2020-04-26T00:40:38Z", "content": "The US Treasury Department said on Saturday it has released $9.5 billion in additional funds from the Payroll Support Program to US air carriers, bringing to $12.4 billion the total provided to the airline sector hit hard by the coronavirus pandemic.\r\nIn tota… [+2892 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "Android 11 DP3 adds new sensitivity options for gesture navigation - Android Police", "description": "Google was changing Android 10's full-screen gesture navigation all the way up to release, and you could definitely make the argument that there were", "url": "https://www.androidpolice.com/2020/04/25/android-11-dp3-adds-new-sensitivity-options-for-gesture-navigation/", "urlToImage": null, "publishedAt": "2020-04-25T18:49:39Z", "content": "Google was changing Android 10's full-screen gesture navigation all the way up to release, and you could definitely make the argument that there were still unresolved issues I still frequently go back when I'm trying to open an app's side menu. Thankfully, th… [+740 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "Julien Laurens", "title": "Arsenal to return to training despite UK's coronavirus lockdown - ESPN India", "description": "Arsenal players will make a staggered return to training at their London Colney training ground next week, sources have told ESPN.", "url": "https://www.espn.in/football/arsenal/story/4089033/arsenal-to-return-to-training-despite-uks-coronavirus-lockdown-sources", "urlToImage": null, "publishedAt": "2020-04-25T18:24:56Z", "content": "Arsenal players will make a return to training at their London Colney training ground next week despite the UK still being on a government-imposed lockdown amid the coronavirus pandemic.\r\n- Stream every episode of 30 for 30: Soccer Stories on ESPN+\r\nThey are … [+2027 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "George", "title": "HTC Desire 20 Pro reportedly in the works, spotted on GeekBench too - GSMArena.com news - GSMArena.com", "description": "The phone looks like a Xiaomi Mi 10 from the back, has a 3.5mm jack, insider says.", "url": "https://www.gsmarena.com/htc_desire_20_pro_reportedly_in_the_works_geekbench-news-42873.php", "urlToImage": null, "publishedAt": "2020-04-25T17:35:01Z", "content": "HTC is working on a new smartphone, what year is it? An insider by the name of @LlabTooFeR with historically reliable intel on HTC devices has shared some bits on the matter.\r\nThe smartphone has a code name Bayamo but will be called Desire 20 Pro for commerci… [+1007 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Saudi Arabia abolishes flogging as punishment - Al Jazeera English", "description": "Saudi Supreme Court says decision is part of reforms pushed by King Salman and his son Crown Prince Mohammed.", "url": "https://www.aljazeera.com/news/2020/04/saudi-arabia-abolishes-flogging-punishment-supreme-court-200425103319396.html", "urlToImage": null, "publishedAt": "2020-04-25T15:19:54Z", "content": "Saudi Arabia has abolished flogging as a form of punishment, the country's supreme court has announced.\r\nThe court said on Saturday that the \"human rights advances\" are part of reforms pushed by King Salman Bin Abdul Aziz and his son, the kingdom's de facto r… [+2775 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Govindraj Ethiraj, IndiaSpend.com", "title": "Interview: Given India’s vastness, we need local solutions to fight Covid-19 - Scroll.in", "description": "Professor Ajay Shah on testing strategies India should adopt.", "url": "https://scroll.in/article/960122/interview-given-indias-vastness-we-need-local-solutions-to-fight-covid-19", "urlToImage": null, "publishedAt": "2020-04-25T15:00:00Z", "content": "The lockdown on the Indian economy to contain Covid-19 spead is supposed to continue at least till May 3. Whether it will be lifted, and in what way and in how many cities and states, is not yet known. Most importantly, restarting the economy is not going to … [+14327 chars]"}, {"source": {"id": null, "name": "Thesportsrush.com"}, "author": "Tanish Chachra", "title": "Manchester City star David Silva names best Premier League player of his era - The Sportsrush", "description": "Manchester City star David Silva picks best Premier League player to play in his era as he goes live on for an AMA on social media. Manchester City's captain David Silva has completed 10 years in the Premier League this year and in his time with the Citizens,…", "url": "https://thesportsrush.com/manchester-city-star-david-silva-names-best-premier-league-player-of-his-era/", "urlToImage": null, "publishedAt": "2020-04-25T13:12:00Z", "content": "Manchester City star David Silva picks best Premier League player to play in his era as he goes live on for an AMA on social media.\r\nManchester City’s captain David Silva has completed 10 years in the Premier League this year and in his time with the Citizens… [+1530 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "IANS", "title": "Suriya’s ‘Soorarai Pottru’ could be banned, if Jyothika’s ‘Pon Magal Vandhal’ releases directly on OTT - The Hindu", "description": "Tamil Nadu Theatre And Multiplex Owners’ Association respond to expected release of Jyothika’s film on Amazon Prime next month", "url": "https://www.thehindu.com/entertainment/movies/suriyas-soorarai-pottru-could-be-banned-if-jyothikas-pon-magal-vandhal-releases-directly-on-ott/article31432944.ece", "urlToImage": null, "publishedAt": "2020-04-25T12:25:03Z", "content": "The Tamil Nadu Theatre And Multiplex Owners Association have threatened to ban films starring Suriya, as well as the films produced by his production company 2D films. The decision comes after the news that the film Pon Magal Vandhal, produced by Suriya and s… [+1831 chars]"}, {"source": {"id": null, "name": "Aa.com.tr"}, "author": null, "title": "World Malaria Day: Fight against life-threatening disease - Anadolu Agency", "description": "'No evidence-based information chloroquine medication, used in malaria, protective in COVID-19,' says expert  - Anadolu Agency", "url": "https://www.aa.com.tr/en/health/world-malaria-day-fight-against-life-threatening-disease/1818308", "urlToImage": null, "publishedAt": "2020-04-25T12:10:38Z", "content": "ANKARA \r\nWhile humanity is struggling with coronavirus outbreak, the world is observing on April 25 Malaria Day, highlighting the importance of the fight against another life-threatening disease.\r\nAlthough it is very easy and inexpensive to prevent deaths fro… [+3789 chars]"}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "Anuraag Singh", "title": "Six test corona positive in MP after visiting hair-cutting salon that served COVID-19 patient earlier - The New Indian Express", "description": "In another development, a young IPS officer, who brought back an absconding COVID-19 positive NSA detainee to Jabalpur, tested positive.", "url": "https://www.newindianexpress.com/nation/2020/apr/25/six-test-corona-positive-in-mp-after-visiting-hair-cutting-salon-that-served-covid-19-patient-earlie-2135208.html", "urlToImage": null, "publishedAt": "2020-04-25T11:45:00Z", "content": "BHOPAL: Panic has struck the Bargaon village in Madhya Pradesh’s Khargone district after six villagers, who went to a hair-cutting salon recently for hair-cuts and shaving, have tested positive for coronavirus. Swab samples of as many as 10-12 persons, who re… [+2853 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Cosmic Reef: NASA release an image of a blazing starbirth to mark Hubble's 30th birthday - Firstpost", "description": "Hubble has been placed in space to observe the most distant stars and galaxies, as well as planets in our solar system.", "url": "https://www.firstpost.com/tech/science/cosmic-reef-nasa-release-an-image-of-a-blazing-starbirth-to-mark-hubbles-30th-birthday-8299671.html", "urlToImage": null, "publishedAt": "2020-04-25T10:23:08Z", "content": "FP TrendingApr 25, 2020 16:24:11 IST\r\nThe US space agency has released a new bright picture of a firestorm of starbirth to mark the 30th anniversary of the Hubble Space Telescope. Scientists have called the picture Cosmic Reef, as it resembles a coral reef fl… [+1921 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Livemint", "title": "Crouching tiger upsets hidden dragon - Livemint", "description": "India’s decision to block Chinese investments has led to a mini earthquake in the Sino-Indian investment corridor.Indian startups themselves covet Chinese funding, because it comes with real-time expertise on how to tweak their business models on a daily basis", "url": "https://www.livemint.com/news/india/crouching-tiger-upsets-hidden-dragon-11587750652064.html", "urlToImage": null, "publishedAt": "2020-04-25T05:30:33Z", "content": "MUMBAI :\r\nIf India doesnt want Chinese money, said the executive of a venture capital fund in Beijing, then more money will go to another country.\" The pragmatic, young Chinese man, experienced in doing business in India, already had alternative investment de… [+11981 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What COVID-19 Symptoms Should People Be On The Lookout For? - WCCO - CBS Minnesota", "description": "There are so many unknowns about COVID-19. But, one thing has been clear – the virus can present itself differently in different people, Heather Brown report...", "url": "https://www.youtube.com/watch?v=Ml0aBNKYVyc", "urlToImage": null, "publishedAt": "2020-04-25T03:58:36Z", "content": null}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "First-ever digital geological map of moon released by US Geological Survey - Down To Earth Magazine", "description": "It will serve as a blue print for future human lunar missions", "url": "https://www.downtoearth.org.in/news/science-technology/first-ever-digital-geological-map-of-moon-released-by-us-geological-survey-70690", "urlToImage": null, "publishedAt": "2020-04-24T15:59:01Z", "content": "The first ever digital, unified, global, geological map of the moon was released virtually by the  United States Geological Survey (USGS), National Aeronautics and Space Administration (Nasa) and the Lunar Planetary Institute on April 22, 2020.\r\nThe map is a … [+2958 chars]"}]}