{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "PM Narendra Modi's 'Mann ki Baat' address: Key points - Times of India", "description": "India News: NEW DELHI: Prime Minister Narendra Modi on Sunday addressed the nation during the 64th edition of monthly 'Mann ki Baat' programme.", "url": "https://timesofindia.indiatimes.com/india/prime-minister-narendra-modis-mann-ki-baat-address-key-points/articleshow/75386271.cms", "urlToImage": null, "publishedAt": "2020-04-26T06:34:50Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus tips: 5 things in your car you definitely need to disinfect now! - Times of India", "description": "We love to take care of our cars on a day to day basis. It is important that we do that now as well. In this time o", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-tips-5-things-in-your-car-you-definitely-need-to-disinfect-now/articleshow/75375998.cms", "urlToImage": null, "publishedAt": "2020-04-26T06:24:55Z", "content": null}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "PTI", "title": "Indian World War I fighter pilot’s moving story emerges in rare UK archive - The Indian Express", "description": "The never-before-published files contain thousands of letters, pictures and other papers sent between the Commission and the next of the kin of First World War dead.", "url": "https://indianexpress.com/article/india/indian-world-war-i-fighter-pilot-krishna-chanda-welinkar-uk-archive-6379798/", "urlToImage": null, "publishedAt": "2020-04-26T05:38:11Z", "content": "By: PTI | London | \r\nPublished: April 26, 2020 11:04:22 am\r\nLieutenant Shri Krishna Chanda Welinkar is one of the thousands of moving stories from the war preserved in family correspondence and being brought alive as part of a digitisation project. (Twitter/@… [+5346 chars]"}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "Alex  Mathew", "title": "BQ Big Decisions: As A Crisis Hits Debt Funds, Is Your Money Safe? - BloombergQuint", "description": "Should you approach investing in debt mutual funds differently now?", "url": "https://www.bloombergquint.com/business/bq-big-decisions-as-a-crisis-hits-debt-funds-is-your-money-safe", "urlToImage": null, "publishedAt": "2020-04-26T05:25:49Z", "content": "BloombergQuints Big Decisions podcast gets you the insights you need to make big money decisions with confidence.\r\nWhen Franklin Templeton Mutual Fund wound up its six yield-oriented, managed credit funds last week, it shook the confidence of a large number o… [+485 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "HTC Desire 20 Pro spotted on Geekbench, likely to come with 6GB RAM - Hindustan Times", "description": "The tipster also notes that the phone is codenamed ‘Bayamo’ and it will sport a 3.5mm headphone jack.", "url": "https://www.hindustantimes.com/tech/htc-desire-20-pro-spotted-on-geekbench-likely-to-come-with-6gb-ram/story-sBOS2j6L8ZFliDiAi2UZLM.html", "urlToImage": null, "publishedAt": "2020-04-26T05:15:05Z", "content": "HTC launched its flagship the HTC U12+ back in May 2018. Now, two years later, it seems that the company is gearing to launch a new flagship smartphone.\r\nAccording to a report by tipster LlabTooFeR, HTC is planning to launch an HTC Desire 10 Pro successor soo… [+1063 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Priyanka Chopra Jonas wears a saree at home as she poses for a romantic picture with hubby Nick Jonas ami - Times of India", "description": "Lockdown has given ample time to our B-town celebrities to spend quality time with their loved ones. Every day we g", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/priyanka-chopra-jonas-wears-a-saree-at-home-as-she-poses-for-a-romantic-picture-with-hubby-nick-jonas-amid-the-lockdown/articleshow/75386442.cms", "urlToImage": null, "publishedAt": "2020-04-26T05:05:00Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "Vishal Mathur", "title": "NASA Engineers Built This COVID Ventilator in 37 Days, And it Has Already Passed a Key Test - 360TopNews", "description": "VITAL has a design that allows flexibility of use, which makes it relevant for temporary hospitals and health facilities that may already be running short of medical equipment.", "url": "https://www.news18.com/news/tech/nasa-engineers-built-this-covid-ventilator-in-37-days-and-it-has-already-passed-a-key-test-2593003.html", "urlToImage": null, "publishedAt": "2020-04-26T05:01:37Z", "content": "As NASA says, they usually build spacecrafts and not medical devices. But as it turns out, when they do decide to make one, they do a rather fine job of it. The National Aeronautics and Space Administration (NASA) has developed a ventilator as the world strug… [+2354 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "PTI", "title": "Coronavirus Death Toll in India Rises to 824, Total Number of Cases Now at 26,496 - News18", "description": "Of the 45 deaths reported since Saturday evening, 22 are from Maharashtra, six in Gujarat, seven from Madhya Pradesh, one from among others.", "url": "https://www.news18.com/news/india/indias-coronavirus-death-toll-rises-to-824-total-number-of-cases-now-at-26496-2593037.html", "urlToImage": null, "publishedAt": "2020-04-26T04:54:15Z", "content": "New Delhi: The death toll due to COVID-19 rose to 824 and the number of cases climbed to 26,496 in India on Sunday, according to the Union health ministry.\r\nThe death toll increased by 45 and the number of cases has gone up by 1,554 since the ministry last up… [+1072 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "todaynewspaper.in", "title": "As Rumours Surface of Kim Jong Un’s Ill Health, Spotlight on His Sister as Possible Power Centre - Todaynewspaper", "description": "Kim Jong Un with sister Kim Yo Jong (Reuters) Each change of leadership in North Korea has raised the prospect of a leadership vacuum or collapse of the Kim dynasty, which has ruled the country since its founding in 1948. Reuters \r Last Updated: April 26, 202…", "url": "https://www.news18.com/news/world/as-rumours-surface-of-kim-jong-uns-ill-health-spotlight-on-his-sister-as-possible-power-centre-2593017.html", "urlToImage": null, "publishedAt": "2020-04-26T04:52:48Z", "content": "North Korea has never publicised who would follow leader Kim Jong Un in the event he is incapacitated, and with no details known about his young children, analysts say his sister and loyalists could form a regency until a successor is old enough to take over.… [+4343 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Surajit Dasgupta", "title": "If you had bought gold on Akshaya Tritiya in 2019, price gain will surprise you - Livemint", "description": "Despite the sharp jump in prices over the past one year, analysts remain bullish on gold.But record high prices have hurt physical gold demand in India", "url": "https://www.livemint.com/news/india/if-you-had-bought-gold-on-akshaya-tritiya-in-2019-price-gain-will-surprise-you-11587870902195.html", "urlToImage": null, "publishedAt": "2020-04-26T04:52:41Z", "content": "If you had bought gold on Akshaya Tritiya last year, today you would be sitting on gains of over 40%. Coronavirus crisis, rupee's depreciation against US dollar, meltdown in some asset classes like oil and stimulus measures by central banks across the world h… [+2093 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Safoora", "title": "iPhone users! This message can crash Apple devices in seconds - The Siasat Daily", "description": "NEW DELHI: Here’s an important ‘warning’ if you use an Apple devices. There's a text message that has been circulating on secure messaging platform Telegram as well as a number of forums that particularly affects Apple devices running on iOS. This string of c…", "url": "https://www.siasat.com/iphone-users-message-can-crash-apple-devices-seconds-1879653/", "urlToImage": null, "publishedAt": "2020-04-26T04:45:20Z", "content": "NEW DELHI: Heres an important warning if you use an Apple devices.\r\nThere’s a text message that has been circulating on secure messaging platform Telegram as well as a number of forums that particularly affects Apple devices running on iOS.\r\nThis string of ch… [+525 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu Net Desk", "title": "Coronavirus India lockdown Day 33 updates | Positive cases cross 26,500 - The Hindu", "description": "Globally, as of 25 April 2020, there have been 27,24,809 confirmed cases including 1,87,847 deaths, reported to WHO", "url": "https://www.thehindu.com/news/national/india-coronavirus-lockdown-april-26-2020-live-updates/article31436416.ece", "urlToImage": null, "publishedAt": "2020-04-26T04:25:00Z", "content": "India posted 1,554 new cases of COVID-19 since Saturday evening bringing the total number of those confirmed positive to 26,496 according to an update by the Union Ministry of Health and Family Welfare. The death toll stands at 824.\r\nData from States however … [+4927 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Antara Kashyap", "title": "Amitabh Bachchan Jokes About Coronavirus And Netizens Aren't Happy - News18", "description": "Amitabh Bachchan took to Twitter to tell his fans that a bat had entered his room at his residence Jalsa. He joked how the coronavirus is trailing him.", "url": "https://www.news18.com/news/movies/amitabh-bachchan-jokes-about-coronavirus-and-netizens-arent-happy-2592947.html", "urlToImage": null, "publishedAt": "2020-04-26T03:38:37Z", "content": "Superstar Amitabh Bachchan is one of the most active social media users in the Hindi film industry. From motivational videos to viral challenges, the actor participates in most internet content, thereby entertaining his fans. However, his recent attempt at jo… [+2771 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This 4TB PCIe SSD can make your Windows laptop feel more like a MacBook Pro - Techradar", "description": "Assuming you have a compatible laptop, that is", "url": "https://www.techradar.com/news/this-4tb-pcie-ssd-can-make-your-windows-laptop-feel-more-like-a-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-26T03:00:00Z", "content": "The Apple MacBook Pro 16 still holds bragging rights when it comes to the maximum storage capacity available in a traditional portable laptop. \r\nApple uses a proprietary approach, plugging memory chips directly into the motherboard to reach a whopping 8TB of … [+1494 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Rasesh Mandani", "title": "Bailout plan: Play more matches with India - Hindustan Times", "description": "Later this year, the new Future Tours Programme (FTP) for the years 2023-2031 will be finalised; the ICC continues to be heavily dependent on the BCCI for revenue.", "url": "https://www.hindustantimes.com/cricket/bailout-plan-play-more-matches-with-india/story-VRqndyDqK1aBAy0bT21qoO.html", "urlToImage": null, "publishedAt": "2020-04-26T02:57:47Z", "content": "The Board of Control for Cricket in India (BCCI), the richest body in world cricket, has come up with a plan to help countries facing losses due to the cancellation of cricket worldwide -- although the idea is contingent on games resuming.\r\nAccording to BCCI … [+4642 chars]"}, {"source": {"id": null, "name": "Newsonair.com"}, "author": null, "title": "WHO says there is no evidence that recovered patients are immune to COVID-19 infection - All India Radio", "description": "World Health Organization (WHO) has said that there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection.", "url": "http://www.newsonair.com/Main-News-Details.aspx?id=386715", "urlToImage": null, "publishedAt": "2020-04-26T02:42:41Z", "content": "Site Maintained by: Website Cell, NSD and IT Division, Prasar Bharati, New Delhi, India. Website Policy"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Reuters", "title": "'I want my life back': Germans protest against lockdown - The Hindu", "description": "Germany has put in place strict curbs on public activity, imposing its lockdown on March 17", "url": "https://www.thehindu.com/news/international/i-want-my-life-back-germans-protest-against-lockdown/article31436294.ece", "urlToImage": null, "publishedAt": "2020-04-26T02:39:59Z", "content": "German police wearing riot gear and face masks tussled on Saturday with dozens of protesters demonstrating in central Berlin against the coronavirus lockdown on public life.\r\nProtesters shouted I want my life back and held up signs with slogans such as Protec… [+2371 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "China installs antenna reflector for Mars exploration mission - CGTN", "description": "China successfully integrally hoisted and installed the antenna reflector for its Mars exploration mission in Wuqing District, north China's Tianjin Municipality on Saturday.", "url": "https://news.cgtn.com/news/2020-04-26/China-installs-antenna-reflector-for-Mars-exploration-mission-PZRw0UtqMw/index.html", "urlToImage": null, "publishedAt": "2020-04-26T02:20:59Z", "content": "China integrally hoisted and installed the antenna reflector for its Mars exploration mission in Wuqing District, north China's Tianjin Municipality on Saturday.\r\nAs the key equipment for receiving the data from the Mars exploration, the high-performance ante… [+2014 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "COVID-19 can attack again! - Northeast Now", "description": "One can be infected with COVID-19 again after getting cured for the first time, warns World Health Organization on Saturday. In a statement by WHO said there is currently no evidence that people who have recovered from COVID-19 and have anti-bodies are protec…", "url": "https://nenow.in/health/covid-19-can-attack-again.html/", "urlToImage": null, "publishedAt": "2020-04-26T02:13:24Z", "content": "One can be infected with COVID-19 again after getting cured for the first time, warns World Health Organization on Saturday.\r\nIn a statement by WHO said there is currently no evidence that people who have recovered from COVID-19 and have anti-bodies are prote… [+666 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Covid-19: States divided on extending lockdown beyond May 3 - Hindustan Times", "description": "The decision on whether to lift or extend the lockdown is expected to be among issues likely to be discussed in Prime Minister Modi’s video conference with the chief ministers on Monday, April 27.", "url": "https://www.hindustantimes.com/india-news/covid-19-states-divided-on-extending-lockdown-beyond-may-3/story-o1Lul35IR8Uw6YXc91zOrK.html", "urlToImage": null, "publishedAt": "2020-04-26T02:10:31Z", "content": "As India continues to grapple with the coronavirus outbreak amid a nationwide lockdown, some states are considering the option of extending the shutdown beyond May 3 while some others are in favour of restricting it to containment zones and their buffer areas… [+3613 chars]"}, {"source": {"id": null, "name": "Tribuneindia.com"}, "author": "Tribune News Service", "title": "Neighbourhood shops allowed to open - The Tribune India", "description": "Salons, eateries, liquor vends to remain closed | No relaxation in containment zones", "url": "https://www.tribuneindia.com/news/nation/neighbourhood-shops-allowed-to-open-76317", "urlToImage": null, "publishedAt": "2020-04-26T01:41:26Z", "content": "New Delhi, April 25\r\nFurther easing lockdown restrictions in non-containment zones, the Centre has allowed opening of neighbourhood and standalone shops, including those in residential complexes, within the municipal limits.\r\nThe order was issued late last ni… [+686 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Reuters", "title": "US airlines receive extra $9.5 bln in payroll support - Hindustan Times", "description": "The Treasury Department also published on Saturday the application form for companies deemed critical to maintaining national security seeking loans from a $17 billion fund.", "url": "https://www.hindustantimes.com/business-news/us-airlines-receive-extra-9-5-bln-in-payroll-support/story-VTRYiDifSzQrVmWgliDm3M.html", "urlToImage": null, "publishedAt": "2020-04-26T00:40:38Z", "content": "The US Treasury Department said on Saturday it has released $9.5 billion in additional funds from the Payroll Support Program to US air carriers, bringing to $12.4 billion the total provided to the airline sector hit hard by the coronavirus pandemic.\r\nIn tota… [+2892 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "AFP", "title": "Boeing scraps $4.2 billion deal to buy Embraer commercial division - Deccan Herald", "description": "Unknown assailants lobbed an explosive device at a private bank branch in southern Lebanon on Saturday, damaging its facade and roof, the country's state news agency reported. The assault on a branch of Fransabank in the southern city of Sidon came at a time …", "url": "https://www.deccanherald.com/business/boeing-scraps-42-billion-deal-to-buy-embraer-commercial-division-829977.html", "urlToImage": null, "publishedAt": "2020-04-25T23:30:56Z", "content": "Unknown assailants lobbed an explosive device at a private bank branch in southern Lebanon on Saturday, damaging its facade and roof, the country's state news agency reported.\r\nThe assault on a branch of Fransabank in the southern city of Sidon came at a time… [+1711 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "ESPN", "title": "Ex-Chelsea forward Costa: Conte would never last as Real Madrid boss - ESPN India", "description": "Former Chelsea forwarded Diego Costa told ESPN Brasil that he thinks Antonio Conte could never last a full season at a club like Real Madrid.", "url": "https://www.espn.in/football/chelsea/story/4088814/ex-chelsea-forward-costa-conte-would-never-last-as-real-madrid-boss", "urlToImage": null, "publishedAt": "2020-04-25T21:38:12Z", "content": "Former Chelsea forward Diego Costa told ESPN Brasil that he thinks Antonio Conte could never last a full season at a club like Real Madrid.\r\nCosta left Chelsea at the end of the 2016-17 season following a row with Conte and returned to Atletico Madrid -- the … [+2163 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "Android 11 DP3 adds new sensitivity options for gesture navigation - Android Police", "description": "Google was changing Android 10's full-screen gesture navigation all the way up to release, and you could definitely make the argument that there were", "url": "https://www.androidpolice.com/2020/04/25/android-11-dp3-adds-new-sensitivity-options-for-gesture-navigation/", "urlToImage": null, "publishedAt": "2020-04-25T18:49:39Z", "content": "Google was changing Android 10's full-screen gesture navigation all the way up to release, and you could definitely make the argument that there were still unresolved issues I still frequently go back when I'm trying to open an app's side menu. Thankfully, th… [+740 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Brokerage firm moves Delhi high court against MCX - Hindustan Times", "description": "MCX, which initially announced a provisional settlement price of Re 1 for its contract that ended on April 20, later calculated a price of minus Rs 2,884 per barrel, exposing brokers to a potential loss of Rs 435 crore.", "url": "https://www.hindustantimes.com/business-news/brokerage-firm-moves-delhi-high-court-against-mcx/story-AXkklID45tUdcVhij2JYiP.html", "urlToImage": null, "publishedAt": "2020-04-25T15:57:11Z", "content": "A broker member of MCX, country’s largest exchange for commodity derivatives, moved the Delhi high court against the manner in which the April crude oil contract was settled by the bourse. \r\nPrrsaar Commodities (P) Ltd moved the court in the interest of its i… [+1142 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Sonia Gandhi writes to PM Modi; seeks economic package for revival of MSMEs - Moneycontrol", "description": "In a letter to Modi, Gandhi also made some suggestions for the revival of the Micro, Small and Medium Enterprises (MSME), which is reeling under the adverse impact of the coronavirus lockdown.", "url": "https://www.moneycontrol.com/news/india/sonia-gandhi-writes-to-pm-modi-seeks-economic-package-for-revival-of-msmes-5189721.html", "urlToImage": null, "publishedAt": "2020-04-25T14:25:20Z", "content": "Congress president Sonia Gandhi on Saturday urged Prime Minister Narendra Modi to announce a financial package for the revival of the MSME sector, saying if ignored, the problem can have a devastating and expansive ripple effect on the country's economy.\r\nIn … [+1384 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "PV Sindhu says was desperate to win World Championships as people started calling her 'silver Sindhu' - India Today", "description": "PV Sindhu, who beat her nemesis Nozomi Okuhara of Japan 21-7 21-7 to win World Championships, admitted that she felt bad when people said she has a \"final phobia\".", "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-says-was-desperate-to-win-world-championships-as-people-started-calling-her-silver-sindhu-1671055-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T14:03:03Z", "content": "Star shuttler P V Sindhu says she was desperate to win the World Championships title last year after a string of runner-up finishes as people started calling her \"silver Sindhu\".\r\nSindhu, who also won a silver medal in the 2016 Rio Olympics, admitted that she… [+1999 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Suniel Shetty says Dhadkan sequel should star his and Akshay Kumar’s sons, Ahan and Aarav - Hindustan Times", "description": "Suniel Shetty says he’s pitched the idea that the Dhadkan sequel should star his and Akshay Kumar’s sons, Ahan and Aarav, to the producer.", "url": "https://www.hindustantimes.com/bollywood/suniel-shetty-says-dhadkan-sequel-should-star-his-and-akshay-kumar-s-sons-ahan-and-aarav/story-otPBbTUVjvwepoDM8byDYN.html", "urlToImage": null, "publishedAt": "2020-04-25T13:57:38Z", "content": "Actor Suniel Shetty feels that both him and Akshay Kumar are too old to appear in a sequel to their 2000 film, Dhadkan, but that their sons, Ahan and Aarav, could take on the mantle. Dhadkan, directed by Dharmesh Darshan, also starred Shilpa Shetty.\r\nSuniel t… [+1192 chars]"}, {"source": {"id": null, "name": "Thesportsrush.com"}, "author": "Tanish Chachra", "title": "Manchester City star David Silva names best Premier League player of his era - The Sportsrush", "description": "Manchester City star David Silva picks best Premier League player to play in his era as he goes live on for an AMA on social media. Manchester City's captain David Silva has completed 10 years in the Premier League this year and in his time with the Citizens,…", "url": "https://thesportsrush.com/manchester-city-star-david-silva-names-best-premier-league-player-of-his-era/", "urlToImage": null, "publishedAt": "2020-04-25T13:12:00Z", "content": "Manchester City star David Silva picks best Premier League player to play in his era as he goes live on for an AMA on social media.\r\nManchester City’s captain David Silva has completed 10 years in the Premier League this year and in his time with the Citizens… [+1530 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "No Dearness Allowance hike freeze for Central Government Employees necessary: Manmohan Singh - The Financial Express", "description": "Dearness Allowance News: Manmohan Singh has said he believed that it was not necessary to impose hardships on government employees.", "url": "https://www.financialexpress.com/money/dearness-allowance-da-hike-for-central-government-employees-latest-new-7th-pay-commission-manmohan-singh/1939320/", "urlToImage": null, "publishedAt": "2020-04-25T12:28:30Z", "content": "Dearness Allowance Hike freeze for Central Government Employees Latest News: Former Prime Minister Manmohan Singh has said he believed that it was “not necessary” to impose hardships on government employees and armed forces by freezing Dearness Allowance and … [+1884 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "IANS", "title": "Suriya’s ‘Soorarai Pottru’ could be banned, if Jyothika’s ‘Pon Magal Vandhal’ releases directly on OTT - The Hindu", "description": "Tamil Nadu Theatre And Multiplex Owners’ Association respond to expected release of Jyothika’s film on Amazon Prime next month", "url": "https://www.thehindu.com/entertainment/movies/suriyas-soorarai-pottru-could-be-banned-if-jyothikas-pon-magal-vandhal-releases-directly-on-ott/article31432944.ece", "urlToImage": null, "publishedAt": "2020-04-25T12:25:03Z", "content": "The Tamil Nadu Theatre And Multiplex Owners Association have threatened to ban films starring Suriya, as well as the films produced by his production company 2D films. The decision comes after the news that the film Pon Magal Vandhal, produced by Suriya and s… [+1831 chars]"}, {"source": {"id": null, "name": "Aa.com.tr"}, "author": null, "title": "World Malaria Day: Fight against life-threatening disease - Anadolu Agency", "description": "'No evidence-based information chloroquine medication, used in malaria, protective in COVID-19,' says expert  - Anadolu Agency", "url": "https://www.aa.com.tr/en/health/world-malaria-day-fight-against-life-threatening-disease/1818308", "urlToImage": null, "publishedAt": "2020-04-25T12:10:38Z", "content": "ANKARA \r\nWhile humanity is struggling with coronavirus outbreak, the world is observing on April 25 Malaria Day, highlighting the importance of the fight against another life-threatening disease.\r\nAlthough it is very easy and inexpensive to prevent deaths fro… [+3789 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Cosmic Reef: NASA release an image of a blazing starbirth to mark Hubble's 30th birthday - Firstpost", "description": "Hubble has been placed in space to observe the most distant stars and galaxies, as well as planets in our solar system.", "url": "https://www.firstpost.com/tech/science/cosmic-reef-nasa-release-an-image-of-a-blazing-starbirth-to-mark-hubbles-30th-birthday-8299671.html", "urlToImage": null, "publishedAt": "2020-04-25T10:23:08Z", "content": "FP TrendingApr 25, 2020 16:24:11 IST\r\nThe US space agency has released a new bright picture of a firestorm of starbirth to mark the 30th anniversary of the Hubble Space Telescope. Scientists have called the picture Cosmic Reef, as it resembles a coral reef fl… [+1921 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Sohini Ghosh", "title": "17-year-old’s death a Gujarat blip: Not high-risk, no known co-morbidity - The Indian Express", "description": "In an analysis of deaths across the state released on April 20, Principal Health Secretary Jayanti Ravi had said more than half the deaths till then (35 of 67) were of high-risk patients with multiple co-morbidities.", "url": "https://indianexpress.com/article/cities/ahmedabad/coronavirus-17-yr-olds-death-a-gujarat-blip-not-high-risk-no-known-co-morbidity-6378136/", "urlToImage": null, "publishedAt": "2020-04-25T04:46:56Z", "content": "Written by Sohini Ghosh\r\n | Ahmedabad | \r\nUpdated: April 25, 2020 10:46:56 am\r\nThe youngest to die this week was a 16-year-old, from Dani Limda area, a hotspot in Ahmedabad. (Representational Photo)A 17-year-old with no co-morbidities died in Ahmedabad on Fri… [+4017 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Agence France-Presse", "title": "‘Knocks the virus out in one minute’: Trump’s disinfectant claims baffle citizens - Hindustan Times", "description": "Encouraged by tentative findings that summer weather may dampen the novel coronavirus, Trump used his daily live national press briefing to ask whether light could become a medical treatment.", "url": "https://www.hindustantimes.com/world-news/knocks-the-virus-out-in-one-minute-trump-s-disinfectant-claims-baffle-citizens/story-NxKqtVOX38LTD86iZfa6ZP.html", "urlToImage": null, "publishedAt": "2020-04-25T03:37:00Z", "content": "Top White House coronavirus advisor Deborah Birx shrank in horror and around the nation comedians sharpened their pens: President Donald Trump had just asked if virus victims couldn’t be injected with disinfectant.\r\nEven as a new poll shows most Americans wis… [+5058 chars]"}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "First-ever digital geological map of moon released by US Geological Survey - Down To Earth Magazine", "description": "It will serve as a blue print for future human lunar missions", "url": "https://www.downtoearth.org.in/news/science-technology/first-ever-digital-geological-map-of-moon-released-by-us-geological-survey-70690", "urlToImage": null, "publishedAt": "2020-04-24T15:59:01Z", "content": "The first ever digital, unified, global, geological map of the moon was released virtually by the  United States Geological Survey (USGS), National Aeronautics and Space Administration (Nasa) and the Lunar Planetary Institute on April 22, 2020.\r\nThe map is a … [+2958 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Pune Mirror", "title": "India may see second wave of COVID-19 outbreak in monsoon, say scientists - Pune Mirror", "description": "A study published in The Lancet journal earlier this month modelled the potential adverse consequences of premature relaxation of interventions, and found it might lead to a second wave of infections", "url": "https://punemirror.indiatimes.com/news/india/covid-19-india-may-see-second-wave-of-outbreak-in-monsoon-say-scientists/articleshow/75347662.cms", "urlToImage": null, "publishedAt": "2020-04-24T09:37:00Z", "content": "The trajectory of COVID-19\r\n cases could have plateaued and might even fall for some weeks after the lockdown\r\n is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say scientists\r\n.… [+6693 chars]"}]}