{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "All you need to know about SVAMITVA scheme and its coverage - Hindustan Times", "description": "About 6.62 lakh villages in the country will be eventually covered in the SVAMITVA scheme.", "url": "https://www.hindustantimes.com/india-news/all-you-need-to-know-about-svamitva-scheme-and-its-coverage/story-qwMGmugQXo0cnhFQq9tCYM.html", "urlToImage": null, "publishedAt": "2020-04-26T02:32:35Z", "content": "Prime Minister Narendra Modi on Friday announced a scheme that has the potential to change the dynamics of rural areas. The announcement of SVAMITVA scheme coincided with the Panchayati Raj Day.\r\nThe SVAMITVA scheme aims to provide an integrated property vali… [+2052 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "'Not Worth Time & Effort': Trump Slams Briefings With 'Lamestream Media' After Disinfectant Gaffe - News18", "description": "After a strong rebuff of his suggestion by top medical experts and disinfectant manufacturers, Trump on Friday claimed he had been speaking 'sarcastically'.", "url": "https://www.news18.com/news/world/not-worth-time-effort-trump-slams-briefings-with-lamestream-media-after-disinfectant-gaffe-2592905.html", "urlToImage": null, "publishedAt": "2020-04-26T02:15:01Z", "content": "US President Donald Trump tweeted that his daily coronavirus briefings were not worth his time, two days after sparking a furore by suggesting patients might be injected with disinfectant to kill an infection.\r\nHe appeared to confirm media reports that he was… [+2094 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Modi remains in touch with world capitals for global fight against coronavirus - Times of India", "description": "India News:  Through the ongoing Covid-19 crisis, Prime Minister Narendra Modi has maintained a steady stream of diplomatic engagements, pushing for India’s medic", "url": "https://timesofindia.indiatimes.com/india/modi-remains-in-touch-with-world-capitals-for-global-fight-against-coronavirus/articleshow/75384920.cms", "urlToImage": null, "publishedAt": "2020-04-26T02:09:35Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Just like Shilpa Shetty, here's why dosa is the perfect protein-packed breakfast option for you - Times of India", "description": "Love feasting on dosas? We tell you why this is one of the healthiest breakfast options for you!", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/just-like-shilpa-shetty-heres-why-dosa-is-the-perfect-protein-packed-breakfast-option-for-you/photostory/75377655.cms", "urlToImage": null, "publishedAt": "2020-04-26T01:30:00Z", "content": "For all the vegetarians who complain about missing out on proteins with their morning meal, fear no more. Dosa batter is made of fermented rice and black urad dal, which is an essential lentil. Pulses and lentils are super-rich on proteins, amino acids and gi… [+135 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Bloomberg", "title": "Train belonging to Kim Jong Un spotted as health rumors persist - Hindustan Times", "description": "China sent a team that included health-care experts to the neighboring country to advise on Kim, Reuters reported, citing three people familiar with the matter.", "url": "https://www.hindustantimes.com/world-news/train-belonging-to-kim-jong-un-spotted-as-health-rumors-persist/story-JJVZH4bo6a5ewh2gurgBRK.html", "urlToImage": null, "publishedAt": "2020-04-26T00:57:42Z", "content": "Satellite imagery of a parked train suggests Kim Jong Un may have been at his holiday compound in North Korea’s east coast this week as speculation swirls about the leader’s health, according to the monitoring group 38 North.\r\nChina sent a team that included … [+2990 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Deeptiman Tiwary", "title": "Centre revises Centre’s guidelines, states left scrambling to catch up - The Indian Express", "description": "A month ago, on March 24, when the Centre announced the first phase of the lockdown, states were left to manage its sudden consequences such as the massive disruption in supply chain, and migrant labour walking hundreds of miles to their homes.", "url": "https://indianexpress.com/article/india/centre-revises-centres-guidelines-states-left-scrambling-to-catch-up-coronavirus-lockdown-6379328/", "urlToImage": null, "publishedAt": "2020-04-25T23:36:57Z", "content": "A sample for coronavirus amid a nationwide lockdown, in Old Delhi.LATE FRIDAY night, as the Centre issued orders allowing shops and markets in rural areas and stand-alone shops in urban areas to open for sale of even non-essential items for the first time sin… [+8875 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Covid-19: India cases cross 26,000 with another big spike in Maharashtra - Times of India", "description": "India News: Maharashtra accounted for nearly half of Saturday’s national Covid-19 count, which at 1,715 was the second-highest recorded for a single day so far, 3", "url": "https://timesofindia.indiatimes.com/india/covid-19-india-cases-cross-26000-with-another-big-spike-in-maharashtra/articleshow/75384598.cms", "urlToImage": null, "publishedAt": "2020-04-25T22:40:34Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Amitabh Bachchan shares a 'Breaking News'; a BAT enters his room amid Coronavirus lockdown - Times of India", "description": "Amitabh Bachchan is currently spending quality time with his family sans wife Jaya Bachchan who is in Delhi due to", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/amitabh-bachchan-shares-a-breaking-news-a-bat-enters-his-room-amid-coronavirus-lockdown/articleshow/75384810.cms", "urlToImage": null, "publishedAt": "2020-04-25T22:34:00Z", "content": null}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Bhavya Sukheja", "title": "Chris Hemsworth speaking Bangla in Netflixs Extraction leaves netizens flipped - Republic World - Republic World", "description": "One of the scenes from the action-packed film left viewers a little taken aback as Chris Hemsworth, known for 'Thor', spoke fairly fluent Bangla.", "url": "https://www.republicworld.com/entertainment-news/whats-viral/chris-hemsworth-speaking-bangla-leaves-netizens-flipped.html", "urlToImage": null, "publishedAt": "2020-04-25T19:34:34Z", "content": "One of the most awaited movies of 2020, Extraction, starring Chris Hemsworth, Randeep Hooda and Pankaj Tripathi recently released on Netflix and netizens were completely blown away within the first 90 minutes of the film. One of the scenes from the action-pac… [+2489 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NASA Builds COVID-19 Ventilator - Newsy", "description": "The agency built a high-pressure ventilator prototype tailored to COVID-19 patients in just 37 days. Learn more about this story at https://www.newsy.com/100...", "url": "https://www.youtube.com/watch?v=G2-M7aIe04o", "urlToImage": null, "publishedAt": "2020-04-25T18:56:27Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Here’s a thermal camera that measures temp, detects social distancing violations - Hindustan Times", "description": "The camera may be used at entrances to events, airports, metro stations, manufacturing plants, buildings, hotels, commercial complexes, shopping malls, and gated societies during the Covid-19 spread.", "url": "https://www.hindustantimes.com/tech/here-s-a-thermal-camera-that-measures-temp-detects-social-distancing-violations/story-U3vWY7YlQqNpHhES6xy0jI.html", "urlToImage": null, "publishedAt": "2020-04-25T18:29:59Z", "content": "Until now, there were thermal cameras that helped measure the body temperature of people and determine if they have Covid-19 symptoms or not. Now, Vehant Technologies has developed a thermal camera named FebriEye that not just measures the body temperature bu… [+1673 chars]"}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "Jash Kriplani", "title": "Franklin Templeton fund of funds sees sharp value drop after scheme wind-up - Business Standard", "description": "Six fund-of-funds schemes take 6-25% NAV hit to their exposure to schemes wound up by the AMC", "url": "https://www.business-standard.com/article/companies/franklin-templeton-fund-of-funds-see-sharp-drop-in-value-120042500959_1.html", "urlToImage": null, "publishedAt": "2020-04-25T18:28:09Z", "content": "Franklin Templeton investors may have to brace for another blow, with six of the fund house's debt schemes having seen erosions of between six per cent and 25 per cent in their net asset values (NAVs). The six are so-called fund of fund (FoF) schemes, which i… [+4365 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "2 cell types are entry points for virus - Hindustan Times", "description": "The respiratory tract is filled with numerous cells, among which are goblet cells and ciliated cells.", "url": "https://www.hindustantimes.com/india-news/2-cell-types-are-entry-points-for-virus/story-VZ250MIqdc4r0OIzxsTqPJ.html", "urlToImage": null, "publishedAt": "2020-04-25T17:54:31Z", "content": "Scientists have identified two types of cells in the nose that are likely to be point of infection for the Sars-CoV-2 virus, which causes Covid-19, in the body.\r\nThe respiratory tract is filled with numerous cells, among which are goblet cells and ciliated ce… [+2449 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Special Correspondent", "title": "Coronavirus | India says daily growth rate of COVID-19 cases has dipped to 6% - The Hindu", "description": "Health Ministry claims recovery rate of more than 20% is “comparatively better” than most countries.", "url": "https://www.thehindu.com/news/national/coronavirus-india-says-daily-growth-rate-of-covid-19-cases-has-dipped-to-6/article31432452.ece", "urlToImage": null, "publishedAt": "2020-04-25T17:40:37Z", "content": "India posted 1,429 new cases of COVID-19 since Friday. This brings the total number of those confirmed positive to 24,506 according to an update by the Union Ministry of Health and Family Welfare.\r\nAt least 56 more deaths were reported in the last 24 hours, t… [+2761 chars]"}, {"source": {"id": null, "name": "Dawn.com"}, "author": "AFP", "title": "Chelsea opt against pay cut, tell players to donate to charity - DAWN.com", "description": "Newcastle and Norwich are currently the only two Premier League clubs using the furlough for some of their staff.", "url": "https://www.dawn.com/news/1552184", "urlToImage": null, "publishedAt": "2020-04-25T16:22:22Z", "content": "English Premier League side Chelsea have said they won't impose a pay cut on their first-team squad in response to the coronavirus outbreak.\r\nBut the club added on Saturday they had asked players to continue donating to charities during the ongoing pandemic.\r… [+2170 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express Web Desk", "title": "Coronavirus India updates, April 25: Announce Rs 1 lakh-crore MSME wage protection package, Sonia Gandhi writes to PM - The Indian Express", "description": "Coronavirus Covid-19 India Tracker latest updates: The central government Friday eased curbs on select shops outside municipality areas with 50 per cent workers and mandatory precautions like wearing of masks and social distancing norms.", "url": "https://indianexpress.com/article/india/coronavirus-india-updates-april-25-west-bengal-maharashtra-delhi-gujarat-tamil-nadu-6378811/", "urlToImage": null, "publishedAt": "2020-04-25T16:14:51Z", "content": "According to Health Ministry, West Bengal has 571 cases and recorded 18 deaths so far.With more than 1,000 people testing positive for the novel coronavirus (Covid-19) since yesterday, India’s tally inched close to 25,000 on Saturday with confirmed cases at 2… [+9672 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Apple Watch turns 5: Did you know this is not the first watch Apple has designed? - Hindustan Times", "description": "That and four other cool things you did not know about the Apple Watch", "url": "https://www.hindustantimes.com/tech/apple-watch-turns-5-did-you-know-this-is-not-the-first-watch-apple-has-designed/story-TaLd5mAFahahxirkVPkLaN.html", "urlToImage": null, "publishedAt": "2020-04-25T15:57:39Z", "content": "Apple launched the first Apple Watch five years ago this week. The Apple Watch was Tim Cook’s first high profile product launch after he took over from Steve Jobs. For Jobs, the Apple iPad was the last big product that he launched. \r\nOver the last five years,… [+4241 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Brokerage firm moves Delhi high court against MCX - Hindustan Times", "description": "MCX, which initially announced a provisional settlement price of Re 1 for its contract that ended on April 20, later calculated a price of minus Rs 2,884 per barrel, exposing brokers to a potential loss of Rs 435 crore.", "url": "https://www.hindustantimes.com/business-news/brokerage-firm-moves-delhi-high-court-against-mcx/story-AXkklID45tUdcVhij2JYiP.html", "urlToImage": null, "publishedAt": "2020-04-25T15:57:11Z", "content": "A broker member of MCX, country’s largest exchange for commodity derivatives, moved the Delhi high court against the manner in which the April crude oil contract was settled by the bourse. \r\nPrrsaar Commodities (P) Ltd moved the court in the interest of its i… [+1142 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Saudi Arabia abolishes flogging as punishment - Al Jazeera English", "description": "Saudi Supreme Court says decision is part of reforms pushed by King Salman and his son Crown Prince Mohammed.", "url": "https://www.aljazeera.com/news/2020/04/saudi-arabia-abolishes-flogging-punishment-supreme-court-200425103319396.html", "urlToImage": null, "publishedAt": "2020-04-25T15:19:54Z", "content": "Saudi Arabia has abolished flogging as a form of punishment, the country's supreme court has announced.\r\nThe court said on Saturday that the \"human rights advances\" are part of reforms pushed by King Salman Bin Abdul Aziz and his son, the kingdom's de facto r… [+2775 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Delhi govt to implement MHA order on opening of shops - Moneycontrol", "description": "A Delhi government official said that non-essential shops will be allowed to open, but not in coronavirus containment zones.", "url": "https://www.moneycontrol.com/news/india/delhi-govt-to-implement-mha-order-on-opening-of-shops-5189791.html", "urlToImage": null, "publishedAt": "2020-04-25T15:18:11Z", "content": "The Delhi government on Saturday decided to implement the Centre's latest guidelines on opening of shops, officials said. A Delhi government official said that non-essential shops will be allowed to open, but not in coronavirus containment zones.\r\n\"No activit… [+716 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Decision on Amarnath yatra after periodic review, says J-K Lt Governor - Hindustan Times", "description": "L T Governor Murmu said that due to the Covid-19 pandemic , appropriate decision on organizing the pilgrimages can only be taken after periodic reviews of the situation.", "url": "https://www.hindustantimes.com/india-news/decision-on-amarnath-yatra-after-periodic-review-says-j-k-lt-governor/story-cN4Sk6spNphzrdI8iDi5xL.html", "urlToImage": null, "publishedAt": "2020-04-25T14:15:22Z", "content": "Barely two days after a flip flop on annual Amarnath pilgrimage, Jammu and Kashmir lieutenant governor GC Murmu, on Saturday said that appropriate decision on organizing Amarnath Yatra and Budda Amarnath Yatra can only be taken after periodic reviews of the s… [+3238 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "How a chat with Ravi Shastri helped Sachin Tendulkar after his Test debut against Pakistan - India Today", "description": "Sachin Tendulkar revealed Ravi Shastri had told him that he played against Pakistan in his Test debut like a 'school match'.", "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkar-reveals-chat-ravi-shastri-test-debut-pakistan-1671050-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T13:35:46Z", "content": "Sachin Tendulkar says he was \"clueless\" on his Test debut and almost cried thinking it was all over for him.\r\nWhen he walked out for the last time 24 years later, Tendulkar would do so as a batting great with a record 200 Test appearances to his name.\r\n\"I was… [+2436 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "You can now use Apple Music on your Samsung Smart TVs - Hindustan Times", "description": "If you have a Samsung Smart TV model between 2018 and 2020, you can stream Apple Music on it", "url": "https://www.hindustantimes.com/tech/you-can-now-use-apple-music-on-your-samsung-smart-tvs/story-DqBenQxwj8BJeMrWSgLGJM.html", "urlToImage": null, "publishedAt": "2020-04-25T13:26:00Z", "content": "Samsung has become the first TV manufacturer to get the Apple Music app on its platform. If you own one of their smart TVs, bought between 2018 and 2020, you will get the Apple Music app for free and you can start streaming music on it. Samsung has said that … [+1199 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Too early to talk about playing 5 Tests in Australia: BCCI official - Hindustan Times", "description": "A BCCI official said that a decision on that can be taken at the right time and any planning at this stage would be too early in the wake of the pandemic.", "url": "https://www.hindustantimes.com/cricket/too-early-to-talk-about-playing-5-tests-in-australia-bcci-official/story-7EezwXRXeWtEuIBD0F6cpN.html", "urlToImage": null, "publishedAt": "2020-04-25T12:58:55Z", "content": "The outbreak of the coronavirus has seen the Australian government seal the international boundaries till September 30. But Cricket Australia is not only keen to conduct the T20 World Cup in October, but also have India travel Down Under for the bilateral ser… [+1881 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "IANS", "title": "Suriya’s ‘Soorarai Pottru’ could be banned, if Jyothika’s ‘Pon Magal Vandhal’ releases directly on OTT - The Hindu", "description": "Tamil Nadu Theatre And Multiplex Owners’ Association respond to expected release of Jyothika’s film on Amazon Prime next month", "url": "https://www.thehindu.com/entertainment/movies/suriyas-soorarai-pottru-could-be-banned-if-jyothikas-pon-magal-vandhal-releases-directly-on-ott/article31432944.ece", "urlToImage": null, "publishedAt": "2020-04-25T12:25:03Z", "content": "The Tamil Nadu Theatre And Multiplex Owners Association have threatened to ban films starring Suriya, as well as the films produced by his production company 2D films. The decision comes after the news that the film Pon Magal Vandhal, produced by Suriya and s… [+1831 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "‘Didn’t want people to say Silver Sindhu,’ Talk of final phobia propelled PV Sindhu to World Championship... - Hindustan Times", "description": "Sindhu, who had already won two silver and two bronze medals at the event, defeated her nemesis Nozomi Okuhara 21-7 21-7 in the summit clash that lasted just 38 minutes on August 26 last year.", "url": "https://www.hindustantimes.com/other-sports/didn-t-want-people-to-say-silver-sindhu-talk-of-final-phobia-propelled-pv-sindhu-to-world-championship-glory/story-9daLENyFdFsDbf4qp35ELI.html", "urlToImage": null, "publishedAt": "2020-04-25T11:59:43Z", "content": "Ace shuttler PV Sindhu, who had created history by becoming the first Indian to win gold medal at the World Championships last year, has revealed that she didnt want people to call her “silver Sindhu” and thats why she was desperate to clinch the top honours … [+1477 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Plasma therapy trials for coronavirus patients begin in Karnataka - Deccan Herald", "description": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.", "url": "https://www.deccanherald.com/state/top-karnataka-stories/plasma-therapy-trials-for-coronavirus-patients-begin-in-karnataka-829772.html", "urlToImage": null, "publishedAt": "2020-04-25T11:00:06Z", "content": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.\r\nFollow latest updates on the COVID-19 pandemic here\r\nIn a tweet, Medical Education Minister K Sudhakar said, \"Happy to … [+1295 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Akshay Tritiya 2020: Jewellers giving discounts to lure customers on digital purchase - here are some offers - Moneycontrol", "description": "Experts see gold prices touching Rs 53,000-55000 per 10 gram by next Akshay Tritiya.", "url": "https://www.moneycontrol.com/news/business/akshay-tritiya-2020-jewellers-giving-discounts-to-lure-customers-on-digital-purchase-here-are-some-offers-5189151.html", "urlToImage": null, "publishedAt": "2020-04-25T10:31:13Z", "content": "This year though the traditional form of buying physical gold jewellery or coins on Akshay Tritiya is no longer an avenue for people where they can to go and shop due to current national lockdown imposed due to coronavirus outbreak.\r\nKumar Jain, Vice Presiden… [+5612 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Cosmic Reef: NASA release an image of a blazing starbirth to mark Hubble's 30th birthday - Firstpost", "description": "Hubble has been placed in space to observe the most distant stars and galaxies, as well as planets in our solar system.", "url": "https://www.firstpost.com/tech/science/cosmic-reef-nasa-release-an-image-of-a-blazing-starbirth-to-mark-hubbles-30th-birthday-8299671.html", "urlToImage": null, "publishedAt": "2020-04-25T10:23:08Z", "content": "FP TrendingApr 25, 2020 16:24:11 IST\r\nThe US space agency has released a new bright picture of a firestorm of starbirth to mark the 30th anniversary of the Hubble Space Telescope. Scientists have called the picture Cosmic Reef, as it resembles a coral reef fl… [+1921 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Coronavirus: Doubling rate rises further, now 10 days - Times of India", "description": "India News: Timely imposition of a lockdown after a ban on international air traffic helped India limit Covid-19 cases, which otherwise could have ballooned to ov", "url": "https://timesofindia.indiatimes.com/india/doubling-rate-of-coronavirus-slows-down-further-now-its-10-days/articleshow/75364560.cms", "urlToImage": null, "publishedAt": "2020-04-25T10:16:27Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Bloomberg", "title": "You may catch coronavirus more than once, says WHO - Livemint", "description": "'There is currently no evidence that people who have recovered from Covid-19 and have antibodies are protected from a second infection,' says WHO.The WHO guidance came after some governments suggested that people who have antibodies to the coronavirus could b…", "url": "https://www.livemint.com/news/world/you-may-catch-coronavirus-more-than-once-says-who-11587806764276.html", "urlToImage": null, "publishedAt": "2020-04-25T09:34:08Z", "content": "Catching Covid-19 once may not protect you from getting it again, according to the World Health Organization.There is currently no evidence that people who have recovered from Covid-19 and have antibodies are protected from a second infection,\" the United Nat… [+914 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Siddharth Iyer", "title": "Massive asteroid flying past Earth next week looks like its wearing a face mask - Republic World - Republic World", "description": "Arecibo Observatory in Puerto Rico recently shared an image of an asteroid that looked like it was wearing a 'face mask'. This image has now gone viral online.", "url": "https://www.republicworld.com/entertainment-news/whats-viral/viral-photo-of-face-mask-wearing-asteroid.html", "urlToImage": null, "publishedAt": "2020-04-25T09:06:02Z", "content": "Right now, the world is worried about the COVID-19 pandemic. In fact, people are so worried about the virus that even celestial bodies look like they are wearing face masks. Recently, Arecibo Observatory in Puerto Rico shared an image of a 1.5 kilometres wide… [+2126 chars]"}, {"source": {"id": null, "name": "91mobiles.com"}, "author": null, "title": "LG Velvet specifications leak out ahead of May 7th launch - 91mobiles", "description": "LG Velvet key specifications including processor, cameras and battery details have leaked out ahead of the May 7th launch event.", "url": "https://www.91mobiles.com/hub/lg-velvet-specifications-leak-processor-camera-may-7-launch/", "urlToImage": null, "publishedAt": "2020-04-25T04:41:15Z", "content": "LG Velvet specifications will include the Snapdragon 765 5G processor \r\nLG Velvet specifications have appeared online ahead of the smartphone’s launch on May 7th. The upcoming phone from LG has been turning some heads thanks to its unique design language, esp… [+1673 chars]"}, {"source": {"id": null, "name": "Gulte.com"}, "author": null, "title": "Mahesh-Rajamouli: A dream come true with hard realities! - Gulte", "description": "It sounds super enticing and a dream-come-true to many fans of Mahesh Babu when Rajamouli himself ma", "url": "https://www.gulte.com/movienews/1894/mahesh-rajamouli-a-dream-come-true-with-hard-realities", "urlToImage": null, "publishedAt": "2020-04-25T04:05:33Z", "content": "It sounds super enticing and a dream-come-true to many fans of Mahesh Babu when Rajamouli himself made it official about him directing the superstar in his next. It might give goosebumps when fans foresee the combination’s capability in the collections and in… [+2095 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Saikat Das", "title": "RIL group raises over Rs 5,100 crore via bonds and CPs - Economic Times", "description": "Goldman Sachs said that concerns over the balance sheet and free cash flow were overdone.", "url": "https://economictimes.indiatimes.com/markets/bonds/ril-group-raises-over-rs-5100-crore-via-bonds-and-cps/articleshow/75368321.cms", "urlToImage": null, "publishedAt": "2020-04-25T03:46:50Z", "content": "Mumbai: Mukesh Ambani-led Reliance Industries Ltd (RIL) raised Rs 2,795 crore in a domestic bond sale Friday, taking advantage of a market flush with liquidity to reduce borrowing costs, dealers said. This follows Rs 8,500 crore it raised via the same route o… [+3074 chars]"}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "First-ever digital geological map of moon released by US Geological Survey - Down To Earth Magazine", "description": "It will serve as a blue print for future human lunar missions", "url": "https://www.downtoearth.org.in/news/science-technology/first-ever-digital-geological-map-of-moon-released-by-us-geological-survey-70690", "urlToImage": null, "publishedAt": "2020-04-24T15:59:01Z", "content": "The first ever digital, unified, global, geological map of the moon was released virtually by the  United States Geological Survey (USGS), National Aeronautics and Space Administration (Nasa) and the Lunar Planetary Institute on April 22, 2020.\r\nThe map is a … [+2958 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Lockdown prevented 'US or Europe-like' situation in India but bigger challenge awaits: Experts - Economic Times", "description": "However, most of the experts also cautioned that a  bigger challenge  awaits the country when it gradually move towards exiting the nationwide lockdown, which has emerged as one of India's biggest weapons so far in the battle against COVID-19.", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/lockdown-prevented-us-or-europe-like-situation-in-india-but-bigger-challenge-awaits-experts/articleshow/75348474.cms", "urlToImage": null, "publishedAt": "2020-04-24T10:24:29Z", "content": "As India completes a month under lockdown that brought the world's most populous democracy to a virtual standstill, with no or very minimal social and economic activities to prevent the spread of COVID-19 pandemic, several medical experts feel that these rest… [+5963 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Pune Mirror", "title": "India may see second wave of COVID-19 outbreak in monsoon, say scientists - Pune Mirror", "description": "A study published in The Lancet journal earlier this month modelled the potential adverse consequences of premature relaxation of interventions, and found it might lead to a second wave of infections", "url": "https://punemirror.indiatimes.com/news/india/covid-19-india-may-see-second-wave-of-outbreak-in-monsoon-say-scientists/articleshow/75347662.cms", "urlToImage": null, "publishedAt": "2020-04-24T09:37:00Z", "content": "The trajectory of COVID-19\r\n cases could have plateaued and might even fall for some weeks after the lockdown\r\n is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say scientists\r\n.… [+6693 chars]"}]}