{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "MHA order on shops: What's open, what's close - Times of India", "description": "India News: In rural areas, all shops, except those in shopping malls are allowed to open. In urban areas, all standalone shops, neighbourhood shops and shops in", "url": "https://timesofindia.indiatimes.com/india/coronavirus-lockdown-govt-allows-all-standalone-neighbourhood-shops-in-cities-to-open/articleshow/75370173.cms", "urlToImage": null, "publishedAt": "2020-04-25T06:14:58Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "NASA's longest living observatory — Hubble space telescope celebrates its 30th birthday - Firstpost", "description": "Hubble is the first major optical telescope to be placed in space and has an unobstructed view of the universe.", "url": "https://www.firstpost.com/tech/science/nasas-longest-living-observatory-hubble-space-telescope-celebrates-its-30th-birthday-8299041.html", "urlToImage": null, "publishedAt": "2020-04-25T05:51:43Z", "content": "Abigail BanerjiApr 25, 2020 11:18:42 IST\r\nThirty years ago on, 24 April, NASA had launched Hubble Space Telescope and it fundamentally changed the way humans thought about the cosmos. With repairs and upgrades, Hubble has been one of the space agencys longest… [+2080 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Slideshow | Market breaks 2-week winning streak; rupee hits fresh record low - Moneycontrol.com", "description": "On the BSE Sensex, Reliance Industries gained the most in terms of market value.", "url": "https://www.moneycontrol.com/news/business/markets/slideshow-market-breaks-2-week-winning-streak-rupee-hits-fresh-record-low-5188301.html", "urlToImage": null, "publishedAt": "2020-04-25T05:25:00Z", "content": "The BSE Small-cap index was down 1.5 percent in last week. PVR, Kisan Mouldings, Century Textiles, Premier Explosives and Multibase India were among major losers, while gainers included Eros International Media, Optiemus Infracom, Hathway Cable, Ruchi Soya an… [+9 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Nishanth Vasudevan and Saikat Das", "title": "Franklin TempleRun: Panic spreads to AMCs, corp bonds - Economic Times", "description": "Investors are said to be pulling money out of other credit-risk schemes.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/franklin-templerun-panic-spreads-to-amcs-corp-bonds/articleshow/75368508.cms", "urlToImage": null, "publishedAt": "2020-04-25T05:11:00Z", "content": "Mumbai: Panic over Franklin Templeton Mutual Fund’s decision to wind up six debt schemes and block redemptions indefinitely due to liquidity issues spread to the asset management industry and the corporate bond market. Several mutual funds sold top-rated debt… [+5008 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Special Correspondent", "title": "No need to impose hardship on govt servants, says Manmohan Singh on DA cut - The Hindu", "description": "Former Prime Minister opposes government’s decision to roll back hike in allowance", "url": "https://www.thehindu.com/news/national/no-need-to-impose-hardship-on-govt-servants-says-manmohan-singh-on-da-cut/article31430002.ece", "urlToImage": null, "publishedAt": "2020-04-25T05:04:55Z", "content": "Opposing the governments decision to cut back on hike in dearness allowance (DA) for government employees and pensioners, former Prime Minister Manmohan Singh said he did not think that at this stage such cuts were necessary. \r\nThe government, in an announcem… [+1504 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Aditi Shrivastava", "title": "Pay cuts, layoffs: Startup morale under lockdown - Economic Times", "description": "Over the past 4 weeks, at least two dozen top companies have fired employees and contract staff.", "url": "https://economictimes.indiatimes.com/small-biz/startups/newsbuzz/pay-cuts-layoffs-startup-morale-under-lockdown/articleshow/75367549.cms", "urlToImage": null, "publishedAt": "2020-04-25T05:00:00Z", "content": "BENGALURU: Despondency is taking hold of employees at startups in India that are shrinking operations amid the lockdown to contain the Covid-19 outbreak, putting jobs on the line.\r\nSome dismissals are apparently occurring despite promises to the contrary. Avi… [+4018 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "No to saliva, yes to shine: Ball-tampering laws in cricket may change - Times of India", "description": "Cricket News: Cricket may change ball-tampering laws and approve external method to help polish the red cherry in proposed post-corona measures. The matter of saliv", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/no-to-saliva-yes-to-shine-ball-tampering-laws-in-cricket-may-change/articleshow/75367490.cms", "urlToImage": null, "publishedAt": "2020-04-25T04:40:29Z", "content": "NEW DELHI: The coronavirus pandemic may force cricket's world governing body to tweak one of its oldest rules and approve the use of an artificial substance to help shine the ball, effectively legalizing what has for long been a core tenet of the sport's anti… [+4836 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "PTI", "title": "US will make sure other countries know that coronavirus originated in China: Mike Pompeo - Zee News", "description": "US Secretary of State Mike Pompeo alleged that the World Health Organization failed in its mission to protect the world from the pandemic.", "url": "https://zeenews.india.com/world/us-will-make-sure-other-countries-know-that-coronavirus-originated-in-china-mike-pompeo-2278903.html", "urlToImage": null, "publishedAt": "2020-04-25T04:38:36Z", "content": "Washington: The United States is working with other countries to make sure they understand that coronavirus originated in Wuhan, China, Secretary of State Mike Pompeo has said.Stressing that the burden is on Beijing to explain where the virus came from, Pompe… [+4508 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "UN-WHO collaborate in coronavirus fight, increased efforts to find COVID-19 vaccine - Zee News", "description": "As the coronavirus COVID-19 pandemic continues to create chaos with most of the countries across the globe imposing lockdown measures, the hunt for a vaccine has also picked up pace. Several trials and studies are being conducted in US, UK, China and India wi…", "url": "https://zeenews.india.com/world/un-who-collaborate-in-coronavirus-fight-increased-efforts-to-find-covid-19-vaccine-2278900.html", "urlToImage": null, "publishedAt": "2020-04-25T04:38:33Z", "content": "As the coronavirus COVID-19 pandemic continues to create chaos with most of the countries across the globe imposing lockdown measures, the hunt for a vaccine has also picked up pace. Several trials and studies are being conducted in US, UK, China and India wi… [+1771 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "2 militants, associate killed in encounter with security forces in J-K’s Pulwama - Hindustan Times", "description": "The search operation turned into an encounter after the terrorists fired upon the forces, who retaliated.", "url": "https://www.hindustantimes.com/india-news/encounter-breaks-out-between-security-forces-and-terrorists-in-jammu-and-kashmir-s-pulwama/story-bK3qY562BpHMuFHqs154SI.html", "urlToImage": null, "publishedAt": "2020-04-25T04:20:40Z", "content": "Two militants and a “hardcore” militant associate were killed in an encounter with security forces in Pulwama district of Jammu and Kashmir on Saturday, police said.\r\nSecurity forces launched a cordon-and-search operation in the Goripora area of Awantipora in… [+473 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Virat Kohli thanks Anushka Sharma for switching on lights during live chat with AB de Villiers: ‘Thanks... - Hindustan Times", "description": "Virat Kohli expressed his gratitude to wife Anushka Sharma after she turned on the lights during his live chat session on Friday.", "url": "https://www.hindustantimes.com/bollywood/virat-kohli-thanks-anushka-sharma-for-switching-on-lights-during-live-chat-with-ab-de-villiers-thanks-my-love/story-LEezrrdrYGBl9aUKEvvY3M.html", "urlToImage": null, "publishedAt": "2020-04-25T04:15:14Z", "content": "Actor Anushka Sharma is every bit a considerate wife to her cricketer husband Virat Kohli. It was evident on Friday when Virat was conducting an Instagram Live with AB de Villiers. A sweet gesture by Anushka made Virat smile. \r\nAs it grew dark out during thei… [+1522 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Coronavirus Highlights: India records biggest spike in COVID-19 numbers; 1,752 fresh cases on Friday - The Financial Express", "description": "Coronavirus India Latest Updates LIVE (State-Wise): Total COVID-19 cases in India has gone up to 24,506. This includes 18,668 active coronavirus cases while 5062 patients have been cured/discharged", "url": "https://www.financialexpress.com/lifestyle/health/coronavirus-india-updates-live-state-wise-covid-19-latest-news-corona-cases-tips-tracker-vaccine-symptoms-cure/1938098/", "urlToImage": null, "publishedAt": "2020-04-25T04:10:00Z", "content": "Coronavirus India Latest Updates LIVE (State-Wise): Total COVID-19 cases in India has gone up to 24,506. This includes 18,668 active coronavirus cases while 5062 patients have been cured/discharged. As many as 775 people have died due to coronavirus in India,… [+547 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Vlad", "title": "Facebook makes it official: WhatsApp audio and video calls will soon have up to 8 participants - GSMArena.com news - GSMArena.com", "description": "The functionality had been spotted in beta versions of WhatsApp before.", "url": "https://www.gsmarena.com/facebook_makes_it_official_whatsapp_audio_and_video_calls_will_soon_go_up_to_8_participants-news-42866.php", "urlToImage": null, "publishedAt": "2020-04-25T04:00:01Z", "content": "The rumors were correct, Facebook is indeed upping the maximum limit of people allowed to participate in a group audio or video call on WhatsApp.\r\nThe current limit is 4, but this will \"soon\" double to 8 for everyone, the company revealed today. The new funct… [+760 chars]"}, {"source": {"id": null, "name": "Gadgetsnow.com"}, "author": "Gadgets Now Bureau", "title": "Text bomb: This message may crash your iPhone, iPad, Apple Watch, Mac - Gadgets Now", "description": "If you use an Apple device, here’s an important ‘warning’. A new text bomb is crashing iPhones, Apple Watch, iPad or Mac. This string of characters includes Italian flag emoji and some Sindhi characters. According to a report by 9to5Mac, users have reported r…", "url": "https://www.gadgetsnow.com/tech-news/text-bomb-this-message-may-crash-your-iphone-ipad-apple-watch-mac/articleshow/75368309.cms", "urlToImage": null, "publishedAt": "2020-04-25T03:51:46Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "With 51,000 fatalities, US records over one fourth of global Covid-19 deaths - Hindustan Times", "description": "The United States, which has been the worst hit by coronavirus alone accounts the highest number so far; wherein more than 9.2 lakh Americans have tested positive for Covid-19 and the fatalities count on Friday stood at 51,000, according to the Johns Hopkins …", "url": "https://www.hindustantimes.com/world-news/coronavirus-update-with-51-000-fatalities-us-records-over-one-fourth-of-global-covid-19-deaths/story-h99XfXNb22p1JS4blSTFVM.html", "urlToImage": null, "publishedAt": "2020-04-25T03:39:13Z", "content": "The United States accounts for more than one fourth of the global Covid-19 deaths and over one-third of the total number of people infected with the deadly virus, latest figures revealed on Friday.\r\n The coronavirus pandemic that started from Wuhan City in Ch… [+4243 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "G. Lakshmi and Shilpi Garg", "title": "World Malaria Day – a Good Time to Remember COVID-19 Isn't the Only Crisis - The Wire", "description": "The ongoing novel coronavirus pandemic hasn't made matters easier, even if the world has developed – even temporarily – a heightened awareness of the effects of infectious diseases.", "url": "https://science.thewire.in/the-sciences/world-malaria-day-a-good-time-to-remember-covid-19-isnt-the-only-crisis/", "urlToImage": null, "publishedAt": "2020-04-25T03:29:00Z", "content": "An Anopheles stephensi mosquito obtains a blood meal from a human host through its pointed proboscis in this undated handout photo obtained by Reuters, November 2015. Photo: Reuters/Jim Gathany/CDC.\r\nThe latest World Malaria Report released in December 2019 s… [+5011 chars]"}, {"source": {"id": null, "name": "Gadgetsnow.com"}, "author": "Gadgets Now Bureau", "title": "How Apple and Google will 'use' your phone to fight coronavirus: 15 things to know - Gadgets Now", "description": "These apps will be approved only if they are “administered in conjunction with public health authorities, meet our privacy requirements, and protect user data,” said Apple and Google.", "url": "https://www.gadgetsnow.com/slideshows/how-apple-and-google-will-use-your-phone-to-fight-coronavirus-15-things-to-know/Apps-will-undergo-rigorous-checks-before-they-are-approved/photolist/75368002.cms", "urlToImage": null, "publishedAt": "2020-04-25T03:23:00Z", "content": "Almost two weeks back two of the world’s biggest tech companies — Apple\r\n and Google\r\n — announced that they would work together to help in the fight against coronavirus\r\n pandemic. The two companies announced their plans of helping governments, health agenci… [+310 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Anulekha Ray", "title": "Coronavirus update: COVID-19 cases in India near 25,000, biggest jump in death toll. State-wise tally - Livemint", "description": "Coronavirus has claimed 57 lives in last 24 hours, taking the death toll in the country to 775.Maharashtra continues to report highest number of deaths at followed by Gujarat, Madhya Pradesh and Delhi", "url": "https://www.livemint.com/news/india/coronavirus-update-covid-19-cases-in-india-near-25-000-biggest-jump-in-death-toll-state-wise-tally-11587783346559.html", "urlToImage": null, "publishedAt": "2020-04-25T03:15:00Z", "content": "India recorded 1,429 coronavirus cases in last 24 hours, dipped slightly from 1,684 from the day before. The total number of coronavirus cases in the country has climbed to 24,506. However, there was a sharp increase in the COVID-19 fatalities. Coronavirus ha… [+2309 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Bloomberg", "title": "Tesla turns up heat on Chinese startup over alleged theft of Autopilot secrets - Hindustan Times", "description": "Xpeng, backed by Alibaba Group, and a former Apple employee are accused of 'stealing' autopilot secrets from Tesla.", "url": "https://auto.hindustantimes.com/auto/news/tesla-turns-up-heat-on-chinese-startup-over-alleged-theft-of-autopilot-secrets-41587782951640.html", "urlToImage": null, "publishedAt": "2020-04-25T03:03:11Z", "content": "More than a year after the billionaire chairman of Xpeng Motors labeled as questionable\" Tesla Inc.s allegations that an engineer stole Autopilot secrets before bolting to the Chinese startup, the questions from Elon Musks company keep coming.\r\nAs Tesla tries… [+5008 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This AMD Ryzen notebook deal is probably the best we've ever seen - TechRadar", "description": "Lenovo and AMD provide a glimpse into the future", "url": "https://www.techradar.com/news/this-amd-ryzen-laptop-is-the-probably-the-best-notebook-deal-ever", "urlToImage": null, "publishedAt": "2020-04-25T03:00:00Z", "content": "We reviewers are used to obsessing over incremental technology changes, but every now and then a supernova appears on our radar - something that can single handedly change the status quo.\r\nThe AMD Ryzen 4000 family is one such supernova and promises to bring … [+1829 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18.com", "title": "Sobhita Dhulipala Issues Clarification After Being Accused of Lying About 'Self-Clicked' Cover - News18", "description": "Sobhita's statement comes after a series of her behind-the-scenes pictures from the shoot were surfaced online.", "url": "https://www.news18.com/news/lifestyle/sobhita-dhulipala-releases-statement-after-being-accused-of-lying-about-self-clicked-cover-2591861.html", "urlToImage": null, "publishedAt": "2020-04-25T02:46:09Z", "content": "Actress Sobhita Dhulipala has released a statement regarding her \"self-timed\" magazine cover after being accused of lying about clicking them by herself.\r\nSobhita's statement comes after a series of her behind-the-scenes pictures from her Cosmopolitan magazin… [+2087 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Coronavirus Outbreak LIVE Updates: Centre allows neighbourhood shops to reopen as nation completes month in lockdown with 23,452 cases - Firstpost", "description": "Coronavirus Outbreak LIVE Updates: The home ministry on Friday allowed reopening of all shops in residential and market complexes outside municipal limits and all neighbourhood shops within municipal limits of non-containment zones to open during the lockdown…", "url": "https://www.firstpost.com/health/coronavirus-outbreak-live-updates-covid-19-pandemic-india-death-count-lockdown-maharashtra-mumbai-delhi-latest-news-ramzan-celebrations-2020-8297111.html", "urlToImage": null, "publishedAt": "2020-04-25T02:42:40Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "White House Could Alter Covid-19 Briefings to Limit Trump's Role After Uproar over Disinfectant Remark - News18", "description": "Trump's advisers have argued that while the briefings may appeal to his most loyal base of supporters, they could be alienating some viewers, including senior citizens worried about their health.", "url": "https://www.news18.com/news/world/white-house-could-alter-covid-19-briefings-to-limit-trumps-role-after-uproar-over-his-disinfectant-remarks-2591839.html", "urlToImage": null, "publishedAt": "2020-04-25T02:34:15Z", "content": "For the first time, President Donald Trump cut off his daily coronavirus task force briefing on Friday without taking any questions from reporters. It may not be the last time.\r\nThere have been discussions within the White House about changing the format of t… [+2465 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Bengaluru hospital to conduct plasma therapy trials on Sat - Daijiworld.com", "description": "", "url": "http://www.daijiworld.com/news/newsDisplay.aspx?newsID=700743", "urlToImage": null, "publishedAt": "2020-04-25T02:32:14Z", "content": "Bengaluru, Apr 25 (IANS): City-based BMC Victoria Hospital is poised to take the first steps in assessing the efficacy of plasma therapy for Covid-19 patients on Saturday, Karnataka Health Minister B. Sriramulu said on Friday.\r\n\"BMC Victoria hospital will tak… [+875 chars]"}, {"source": {"id": null, "name": "Gizbot.com"}, "author": "Sharmishte Datti", "title": "NASA VITAL Prototype Ventilators To Help Fight COVID-19 Pandemic - Gizbot", "description": "In a bid to help the coronavirus infected, NASA has announced that it has successfully developed a prototype ventilator for the treatment of coronavirus patients. For this, NASA has developed VITAL or the Ventilator Intervention Technology Accessible Locally.", "url": "https://www.gizbot.com/news/covid-19-pandemic-nasa-builds-prototype-ventilators-067269.html", "urlToImage": null, "publishedAt": "2020-04-25T02:00:00Z", "content": "In a bid to help the coronavirus infected, NASA has announced that it has successfully developed a prototype ventilator for the treatment of coronavirus patients. For this, NASA has developed VITAL or the Ventilator Intervention Technology Accessible Locally.… [+2604 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "COVID-19 outbreak: Pune’s Serum Institute all set to make under-trial Coronavirus vaccine - The Financial Express", "description": "Once the clinical trials are over and successful, SII will release its vaccine. If the clinical trials by Oxford are not successful then the loss will be of SII. Some limited clinical trials will be done by SII also.", "url": "https://www.financialexpress.com/industry/covid-19-outbreak-punes-serum-institute-all-set-to-make-under-trial-coronavirus-vaccine/1938911/", "urlToImage": null, "publishedAt": "2020-04-24T23:16:14Z", "content": "The Serum Institute of India (SII), which has partnered with the University of Oxford, has started work on manufacturing a vaccine for coronavirus. The SII has started the work even as Oxford University on Thursday started clinical trials of the vaccine it ha… [+1151 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NASA Science Live: Asteroid Close Approach - NASA", "description": "Have you heard about an asteroid close-approach happening on April 29? Asteroid 1998 OR2 poses no threat to our planet, but we can still learn a lot by study...", "url": "https://www.youtube.com/watch?v=eiS8EPOL488", "urlToImage": null, "publishedAt": "2020-04-24T21:46:31Z", "content": "Have you heard about an asteroid close-approach happening on April 29? Asteroid 1998 OR2 poses no threat to our planet, but we can still learn a lot by studying it. Don't miss a special Planetary Defense episode of NASA Science Live on Monday, April 27 at 3:0… [+83 chars]"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Adnan Riaz", "title": "Ronaldo And Ronaldinho Finally Answer GOAT Debate Between Lionel Messi And Cristiano Ronaldo - SPORTbible", "description": "Ronaldinho and Ronaldo praised Lionel Messi and Cristiano Ronaldo, but they both chose the same player in the footballing GOAT debate.", "url": "https://www.sportbible.com/football/news-rivalries-ronaldo-and-ronaldinho-answer-goat-debate-between-messi-and-cristiano-20200424", "urlToImage": null, "publishedAt": "2020-04-24T18:53:18Z", "content": "Brazilian legends Ronaldinho and Ronaldo revealed that they would choose Lionel Messi ahead of Cristiano Ronaldo as the 'GOAT of football.'\r\nMessi and Ronaldo's status as two of the best players in the history of the sport has led to many debating who is the … [+1624 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "When Shah Rukh Khan warned Aamir Khan to not work with Kajol: ‘She is very bad, unfocused’ - Hindustan Times", "description": "Before they came to be known as one of Bollywood’s best romantic pairs, actors Shah Rukh Khan and Kajol got off on the wrong foot.", "url": "https://www.hindustantimes.com/bollywood/when-shah-rukh-khan-warned-aamir-khan-to-not-work-with-kajol-she-is-very-bad-unfocused/story-ohHuC9ZVW9pUEacCoSFHQK.html", "urlToImage": null, "publishedAt": "2020-04-24T16:23:00Z", "content": "They’re known as one of Bollywood’s finest romantic pairs, but did you know that Shah Rukh Khan and Kajol got off on the wrong foot when they first met? In fact, Shah Rukh confessed that he’d even warned Aamir Khan about her, calling her unfocused and ‘very b… [+1544 chars]"}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "First-ever digital geological map of moon released by US Geological Survey - Down To Earth Magazine", "description": "It will serve as a blue print for future human lunar missions", "url": "https://www.downtoearth.org.in/news/science-technology/first-ever-digital-geological-map-of-moon-released-by-us-geological-survey-70690", "urlToImage": null, "publishedAt": "2020-04-24T15:59:01Z", "content": "The first ever digital, unified, global, geological map of the moon was released virtually by the  United States Geological Survey (USGS), National Aeronautics and Space Administration (Nasa) and the Lunar Planetary Institute on April 22, 2020.\r\nThe map is a … [+2958 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Faulty antibody testing kits will be returned to respective countries: Health minister Harsh Vardhan - Times of India", "description": "India News: Union health minister Dr Harsh Vardhan on Thursday said faulty antibody testing kits will be returned to the respective countries, whether it is China", "url": "https://timesofindia.indiatimes.com/india/faulty-antibody-testing-kits-will-be-returned-to-respective-countries-health-minister-harsh-vardhan/articleshow/75347398.cms", "urlToImage": null, "publishedAt": "2020-04-24T15:55:35Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Keane sees 'long way back' for Man Utd & remains unconvinced by Shaw - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T14:54:00Z", "content": "More"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "Key nose cells identified as likely entry points of novel coronavirus - Livemint", "description": "The identification of these cells could help explain the high transmission rate of Covid-19.The researchers looked for which individual cells expressed both of two key entry proteins that are used by the Covid-19 virus to infect our cells", "url": "https://www.livemint.com/science/health/key-nose-cells-identified-as-likely-entry-points-of-novel-coronavirus-11587731023526.html", "urlToImage": null, "publishedAt": "2020-04-24T12:40:00Z", "content": "LONDON :\r\nScientists have identified two specific cell types in the nose as likely initial infection points for the novel coronavirus that causes COVID-19.The researchers, including those from the Wellcome Sanger Institute in the UK and University Medical Cen… [+2481 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AFP", "title": "You've got mail: Tom Hanks writes to bullied boy called 'Corona' - Livemint", "description": "Tom Hanks and his wife Rita Wilson contracted Covid-19 in March.Eight-year-old Corona De Vries sent a letter to Hanks asking after his health", "url": "https://www.livemint.com/news/world/you-ve-got-mail-tom-hanks-writes-to-bullied-boy-called-corona-11587712686667.html", "urlToImage": null, "publishedAt": "2020-04-24T07:26:46Z", "content": "Hollywood megastar and coronavirus survivor Tom Hanks has written a comforting letter to a bullied Australian boy called Corona and gifted him a cherished typewriter bearing the same name.Hanks and his wife Rita Wilson contracted COVID-19, the disease caused … [+976 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": "Richa Barua", "title": "Fact Check: Vicky Kaushal slams baseless rumours of breaking lockdown, getting caught by cops - Asianet News English", "description": "There were rumours that the Uri: The Surgical Strike star left his house to meet another Bollywood actor, but was pulled over by the cops and fined", "url": "https://newsable.asianetnews.com/entertainment/fact-check-vicky-kaushal-slams-baseless-rumours-of-breaking-lockdown-getting-caught-by-cops-q9a4x0", "urlToImage": null, "publishedAt": "2020-04-24T06:34:12Z", "content": "Actor Vicky Kaushal on Thursday slammed reports that he was caught by the city police after he allegedly broke the lockdown and stepped out of his house.\r\nThere were rumours that the \"Uri: The Surgical Strike\" star left his house to meet another Bollywood act… [+846 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "COVID-19 infection rate in India has slowed down to 'flatten the curve': Govt - Livemint", "description": "ICMR said the situation is 'currently stable' and the growth of the infections has been more or less linear and not exponential.The officials also said that despite a 24-fold increase in testing, the percentage of positive cases is not rising", "url": "https://www.livemint.com/news/india/covid-19-infection-rate-in-india-has-slowed-down-to-flatten-the-curve-govt-11587667324493.html", "urlToImage": null, "publishedAt": "2020-04-23T18:48:55Z", "content": "New Delhi: Striking a positive note on the COVID-19 situation in India, the Centre on Thursday said it has been able to slow down the infection rate to flatten the curve\" and minimise the spread during the period of the national lockdown which has entered the… [+6290 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Coronavirus spread slowed by a month of lockdown: Govt - Hindustan Times", "description": "Thursday marked the 30th day of a national lockdown, a tough measure to halt the spread of the disease that has killed at least 185,000 people across the world and infected about 2.7 million.", "url": "https://www.hindustantimes.com/india-news/india-slowed-doubling-rate-of-covid-19-cases-ramped-up-testing-officials/story-Mlasg1KnlqnAkKUFqWniLI.html", "urlToImage": null, "publishedAt": "2020-04-23T18:10:00Z", "content": "Medical experts and government officials steering India’s battle against Covid-19 said on Thursday that the country’s prophylactic measures have led to a reduction in the disease’s doubling rate, while allowing the ramping up of testing and the bolstering of … [+7924 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Mumbai Mirror", "title": "COVID-19: ICMR says India has conducted over 5 lakh tests; Covid growth over the last month has been lin - Mumbai Mirror", "description": "India on Thursday reported 1,409 new COVID-19 positive cases in the last 24 hours. This brings the total number of cases to 21,393.", "url": "https://mumbaimirror.indiatimes.com/coronavirus/news/covid-19-icmr-says-india-has-conducted-over-5-lakh-tests-covid-gowth-over-the-last-month-has-been-linear-not-exponential/articleshow/75323056.cms", "urlToImage": null, "publishedAt": "2020-04-23T11:47:00Z", "content": "India\r\n on Thursday reported 1,409 new COVID-19\r\n positive cases in the last 24 hours. This brings the total number of cases to 21,393. As the number of positive cases continue to surge, on the flip side,the Health Ministry said, \"As on today, we have 12 dist… [+2723 chars]"}]}