{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Covid-19: Without lockdown, India's cases would have been nearly 9X - Times of India", "description": "India News: When PM Modi announced a total lockdown exactly a month ago, there were around 500 Covid-19 cases in India. The average daily growth in cases was 21.6", "url": "https://timesofindia.indiatimes.com/india/without-lockdown-indias-cases-would-have-been-nearly-9x/articleshow/75369890.cms", "urlToImage": null, "publishedAt": "2020-04-25T08:38:16Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Can someone go better than God, we'll wait and see: Brett Lee on Sachin Tendulkar - Times of India", "description": "Cricket News: Former Australia speedster Brett Lee believes Virat Kohli can surpass the extraordinary feat of \"god\" Sachin Tendulkar. \"But, how can you say someone", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/can-someone-go-better-than-god-well-wait-and-see-brett-lee-on-sachin-tendulkar/articleshow/75371307.cms", "urlToImage": null, "publishedAt": "2020-04-25T08:25:39Z", "content": "NEW DELHI: Former Australia speedster Brett Lee believes Virat Kohli can surpass the extraordinary feats of \"god\" Sachin Tendulkar.\r\n\"We are talking about phenomenal numbers here, so you mentioned seven to eight years of cricket and at the rate he (Virat Kohl… [+2009 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Ajay Devgn releases song ‘Thahar Ja’ that urges people to stay calm and happy - Bollywood Hungama", "description": "Ajay Devgn releases song ‘Thahar Ja’ that urges people to stay calm and happy. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/bollywood/ajay-devgn-releases-song-thahar-ja-urges-people-stay-calm-happy/", "urlToImage": null, "publishedAt": "2020-04-25T08:03:40Z", "content": "The song that features Ajay Devgn was shot at home by him. The song also features his 9-year-old son Yug. Talking about the song, Ajay said that the song was penned by Anil Verma who has written songs for Tanhaji:The Unsung Warrior as well. Ajay said that the… [+469 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Daniel R Deakin", "title": "AMD Ryzen 3 3300X starts cementing its position as a budget CPU champion by beating the Intel Core i3-10300 in Time Spy benchmark - Notebookcheck.net", "description": "An AMD Ryzen 3 3300X and an Intel Core i3-10300 have been spotted in a comparison on 3DMark’s Time Spy benchmark. In another blow for Team Blue, it appears that the new budget Matisse chip from AMD has the edge on the upcoming Comet Lake processor. The Ryzen …", "url": "https://www.notebookcheck.net/AMD-Ryzen-3-3300X-starts-cementing-its-position-as-a-budget-CPU-champion-by-beating-the-Intel-Core-i3-10300-in-Time-Spy-benchmark.462912.0.html", "urlToImage": null, "publishedAt": "2020-04-25T08:03:15Z", "content": "We already had some first benchmark results for both the AMD Ryzen 3 3300X and the Ryzen 3 3100, where both of the recently announced processors managed to thoroughly challenge Intels aging Kaby Lake Core i7-7700K desktop processor. However, it seems the Ryze… [+1184 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Franklin Templeton mess: A liquidity mishap or a series of wrong, aggressive bets? - Moneycontrol", "description": "The closure of Franklin Templeton’s six funds has opened room for questions.", "url": "https://www.moneycontrol.com/news/business/franklin-templeton-mess-a-liquidity-mishap-or-a-series-of-wrong-aggressive-bets-5188271.html", "urlToImage": null, "publishedAt": "2020-04-25T07:52:46Z", "content": "Did the general liquidity crunch post COVID-19 alone kill Franklin Templeton Indias six credit-risk funds  as the fund house claims? Or was it also a result of bad investment decisions that went unquestioned for long? The crisis triggered by the closure of Fr… [+6631 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Claudia Geib", "title": "The Long-Term Effects of COVID-19 on Field Science - The Wire", "description": "As the coronavirus has spread, reaching every continent except Antarctica and infecting over half a million people, scientific institutions all around the world have shut down or suspended field research, leaving many of these scientists’ work in limbo.", "url": "https://science.thewire.in/the-sciences/the-long-term-effects-of-covid-19-on-field-science/", "urlToImage": null, "publishedAt": "2020-04-25T07:30:00Z", "content": "If this winter had gone as planned, Bethany Jenkins would be getting ready to board a 274-foot research vessel called Atlantis right about now to head east across the Atlantic Ocean. But everything changed when the novel coronavirus SARS-CoV-2 began to infect… [+11877 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "Deekshith Nevil Pinto", "title": "World Malaria Day: Would Coronavirus Revive or Derail India's Success Story Against Malaria? - The Weather Channel", "description": "The novel coronavirus is restricting the ongoing healthcare services that helped countries to fight several deadly diseases like Malaria.", "url": "https://weather.com/en-IN/india/coronavirus/news/2020-04-25-world-malaria-day-covid-19-revive-derail-india-success-story", "urlToImage": null, "publishedAt": "2020-04-25T07:28:54Z", "content": "On December 4, 2019, the World Health Organisation (WHO) released the World Malaria Report 2019a comprehensive analysis of the global Malaria situation. The report showed that India was one of the only two success stories among 11 countries facing the world's… [+7093 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Trending Desk", "title": "Akshaya Tritiya 2020: The Day When Buying Gold is Considered Auspicious - News18", "description": "Akshaya Tritiya is considered pious for various auspicious events like marriage, thread ceremony, and the beginning of economic ventures.", "url": "https://www.news18.com/news/india/akshaya-tritiya-2020-the-day-when-buying-gold-is-considered-auspicious-2592095.html", "urlToImage": null, "publishedAt": "2020-04-25T07:05:00Z", "content": "New Delhi: Akshaya Tritiya is considered to be one of the most auspicious days as it marks the harbinger of good luck in the Hindu calendar. Also known as Akha Teej, devotees believe that that the occasion is best suited for conducting various rituals, rites … [+1904 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "PTI", "title": "Australian Government looking at travel exemptions for Indian cricket team’s Test tour: Reports - Hindustan Times", "description": "The Australian government might make travel exemptions for the Indian team’s tour Down Under later this year to save the cricket board from losing a staggering 300 million Australian dollars in the wake of COVID-9 pandemic.", "url": "https://www.hindustantimes.com/cricket/australian-government-looking-at-travel-exemptions-for-indian-cricket-team-s-test-tour-reports/story-Mzb7TERDRKB4dH6pE1mwUK.html", "urlToImage": null, "publishedAt": "2020-04-25T07:05:00Z", "content": "The Australian government might make travel exemptions for the Indian team’s tour Down Under later this year to save the cricket board from losing a staggering 300 million Australian dollars in the wake of COVID-9 pandemic.\r\nCricket Australia is under huge fi… [+2201 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "China approves third COVID-19 vaccine for clinical trials - The Hindu", "description": "China has approved three coronavirus vaccines, including the one developed by Chinese military, the People’s Liberation Army (PLA) for clinical trials", "url": "https://www.thehindu.com/news/international/china-approves-third-covid-19-vaccine-for-clinical-trials/article31430243.ece", "urlToImage": null, "publishedAt": "2020-04-25T06:39:59Z", "content": "China has approved its third coronavirus vaccine for the second phase of clinical trials as it reported 12 new COVID-19 cases, taking the total number of infections in the country to 82,816.\r\nChina has approved three coronavirus vaccines, including the one de… [+3512 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Sophie Turner advises fans not to drink bleach after Donald Trump’s statement, calls him a moron - Hindustan Times", "description": "Sophie Turner called Donald Trump a moron and told fans not to drink bleach as seemingly advised by the President.", "url": "https://www.hindustantimes.com/tv/sophie-turner-advises-fans-not-to-drink-bleach-after-donald-trump-s-statement-calls-him-a-moron/story-jgMAgBi75we361TVmZ1d5J.html", "urlToImage": null, "publishedAt": "2020-04-25T06:38:46Z", "content": "Game of Thrones actor Sophie Turner thought it was necessary to clear out the ill advice given by US President Donald Trump in his latest statement. His latest musings include injecting disinfectants into people to fight Covid-19 infection, triggering an outc… [+2323 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18.com", "title": "Gujarat Tops List of 7 States Where Covid-19 Outbreak is Spreading Faster Than National Average, Reveals ... - News18", "description": "The dashboard shows the transmission rate in 19 states and 100 districts which make up for 60 per cent of the novel coronavirus infections in India.", "url": "https://www.news18.com/news/india/gujarat-tops-list-of-7-states-where-covid-19-outbreak-is-spreading-faster-than-national-average-reveals-iit-study-2592029.html", "urlToImage": null, "publishedAt": "2020-04-25T06:34:27Z", "content": "As India prepares to emerge from the lockdown imposed to check the spread of Covid-19, a recent modeling by IIT Delhi researchers shows that the virus is spreading faster in seven states than the national rate. \r\nIn the ascending order, the states are Jharkha… [+2995 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Mike Moore", "title": "Beware - that email from HR might be a cyber scam - TechRadar India", "description": "Criminals look to exploit new working from home trend", "url": "https://www.techradar.com/news/beware-that-email-from-hr-might-be-a-cyber-scam", "urlToImage": null, "publishedAt": "2020-04-25T06:29:00Z", "content": "Remote workers are being targeted by a wide-ranging new online scam looking to steal business logins.\r\nResearchers at security firm Cofense have uncovered a phishing campaign masquerading as emails from HR departments.\r\nThe scam targets employees who are stil… [+1879 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "MHA order on shops: What's open, what's close - Times of India", "description": "India News: In rural areas, all shops, except those in shopping malls are allowed to open. In urban areas, all standalone shops, neighbourhood shops and shops in", "url": "https://timesofindia.indiatimes.com/india/coronavirus-lockdown-govt-allows-all-standalone-neighbourhood-shops-in-cities-to-open/articleshow/75370173.cms", "urlToImage": null, "publishedAt": "2020-04-25T06:14:58Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "NASA's longest living observatory — Hubble space telescope celebrates its 30th birthday - Firstpost", "description": "Hubble is the first major optical telescope to be placed in space and has an unobstructed view of the universe.", "url": "https://www.firstpost.com/tech/science/nasas-longest-living-observatory-hubble-space-telescope-celebrates-its-30th-birthday-8299041.html", "urlToImage": null, "publishedAt": "2020-04-25T05:51:43Z", "content": "Abigail BanerjiApr 25, 2020 11:18:42 IST\r\nThirty years ago on, 24 April, NASA had launched Hubble Space Telescope and it fundamentally changed the way humans thought about the cosmos. With repairs and upgrades, Hubble has been one of the space agencys longest… [+2080 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AFP", "title": "Virus toll nears 200,000 as UN pushes for global vaccine effort - Economic Times", "description": "Governments around the world are struggling to limit the economic devastation unleashed by the virus, which has infected nearly 2.8 million people and left half of humanity under some form of lockdown.", "url": "https://economictimes.indiatimes.com/news/international/world-news/virus-toll-nears-200000-as-un-pushes-for-global-vaccine-effort/articleshow/75369509.cms", "urlToImage": null, "publishedAt": "2020-04-25T05:06:29Z", "content": "The global coronavirus death toll approached 200,000 on Saturday as the United Nations launched an international push for a vaccine to defeat the pandemic.\r\nGovernments around the world are struggling to limit the economic devastation unleashed by the virus, … [+5028 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Aditi Shrivastava", "title": "Pay cuts, layoffs: Startup morale under lockdown - Economic Times", "description": "Over the past 4 weeks, at least two dozen top companies have fired employees and contract staff.", "url": "https://economictimes.indiatimes.com/small-biz/startups/newsbuzz/pay-cuts-layoffs-startup-morale-under-lockdown/articleshow/75367549.cms", "urlToImage": null, "publishedAt": "2020-04-25T05:00:00Z", "content": "BENGALURU: Despondency is taking hold of employees at startups in India that are shrinking operations amid the lockdown to contain the Covid-19 outbreak, putting jobs on the line.\r\nSome dismissals are apparently occurring despite promises to the contrary. Avi… [+4018 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "Parts of Chengalpattu, Kancheepuram and Tiruvallur districts to be under total lockdown - The News Minute", "description": "Hours after the government of Tamil Nadu announced stricter lockdown in five city corporations -- Chennai, Madurai, Coimbatore, Salem and Tiruppur -- to bring the spread of novel coronavirus under control, three more districts surrounding Chennai joined the l…", "url": "https://www.thenewsminute.com/article/parts-chengalpattu-kancheepuram-and-tiruvallur-districts-be-under-total-lockdown-123303", "urlToImage": null, "publishedAt": "2020-04-25T04:45:29Z", "content": "Hours after the government of Tamil Nadu announced stricter lockdown in five city corporations -- Chennai, Madurai, Coimbatore, Salem and Tiruppur -- to bring the spread of novel coronavirus under control, three more districts surrounding Chennai joined the l… [+2815 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "UN-WHO collaborate in coronavirus fight, increased efforts to find COVID-19 vaccine - Zee News", "description": "As the coronavirus COVID-19 pandemic continues to create chaos with most of the countries across the globe imposing lockdown measures, the hunt for a vaccine has also picked up pace. Several trials and studies are being conducted in US, UK, China and India wi…", "url": "https://zeenews.india.com/world/un-who-collaborate-in-coronavirus-fight-increased-efforts-to-find-covid-19-vaccine-2278900.html", "urlToImage": null, "publishedAt": "2020-04-25T04:38:33Z", "content": "As the coronavirus COVID-19 pandemic continues to create chaos with most of the countries across the globe imposing lockdown measures, the hunt for a vaccine has also picked up pace. Several trials and studies are being conducted in US, UK, China and India wi… [+1771 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Virat Kohli thanks Anushka Sharma for switching on lights during live chat with AB de Villiers: ‘Thanks... - Hindustan Times", "description": "Virat Kohli expressed his gratitude to wife Anushka Sharma after she turned on the lights during his live chat session on Friday.", "url": "https://www.hindustantimes.com/bollywood/virat-kohli-thanks-anushka-sharma-for-switching-on-lights-during-live-chat-with-ab-de-villiers-thanks-my-love/story-LEezrrdrYGBl9aUKEvvY3M.html", "urlToImage": null, "publishedAt": "2020-04-25T04:15:14Z", "content": "Actor Anushka Sharma is every bit a considerate wife to her cricketer husband Virat Kohli. It was evident on Friday when Virat was conducting an Instagram Live with AB de Villiers. A sweet gesture by Anushka made Virat smile. \r\nAs it grew dark out during thei… [+1522 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Vlad", "title": "Facebook makes it official: WhatsApp audio and video calls will soon have up to 8 participants - GSMArena.com news - GSMArena.com", "description": "The functionality had been spotted in beta versions of WhatsApp before.", "url": "https://www.gsmarena.com/facebook_makes_it_official_whatsapp_audio_and_video_calls_will_soon_go_up_to_8_participants-news-42866.php", "urlToImage": null, "publishedAt": "2020-04-25T04:00:01Z", "content": "The rumors were correct, Facebook is indeed upping the maximum limit of people allowed to participate in a group audio or video call on WhatsApp.\r\nThe current limit is 4, but this will \"soon\" double to 8 for everyone, the company revealed today. The new funct… [+760 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Spider-Man: Into the Spider-Verse Sequel Delayed Five Months In 2022 - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiQ2h0dHBzOi8vc2NyZWVucmFudC5jb20vc3BpZGVybWFuLXNwaWRlci12ZXJzZS0yLXJlbGVhc2UtZGF0ZS1kZWxheS_SAUdodHRwczovL3NjcmVlbnJhbnQuY29tL3NwaWRlcm1hbi1zcGlkZXItdmVyc2UtMi1yZWxlYXNlLWRhdGUtZGVsYXkvYW1wLw?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T03:58:19Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Coronavirus update: India records 1,428 new Covid-19 cases, 57 deaths in last 24 hours - Hindustan Times", "description": "India’s tally of the coronavirus disease stands at 24,506—including 18,668 active cases, 5063 cured, discharged or migrated and 775 deaths, according to the health ministry’s dashboard at 8am.", "url": "https://www.hindustantimes.com/india-news/coronavirus-update-india-saw-1-428-new-covid-19-cases-57-deaths-in-24-hours/story-1HDsY7DdulUnZTwHJ4iY5I.html", "urlToImage": null, "publishedAt": "2020-04-25T03:49:00Z", "content": "There were 1,429 new cases of the coronavirus disease (Covid-19) and 57 deaths across the country in the last 24 hours, the Union home ministry said on Saturday, which marks a month since India was put under a nationwide lockdown.\r\nIndia’s tally of the corona… [+2257 chars]"}, {"source": {"id": null, "name": "Gadgetsnow.com"}, "author": "Gadgets Now Bureau", "title": "How Apple and Google will 'use' your phone to fight coronavirus: 15 things to know - Gadgets Now", "description": "Almost two weeks back two of the world’s biggest tech companies — Apple and Google — announced that they would work together to help in the fight against coronavirus pandemic. The two companies announced their plans of helping governments, health agencies acr…", "url": "https://www.gadgetsnow.com/slideshows/how-apple-and-google-will-use-your-phone-to-fight-coronavirus-15-things-to-know/photolist/75367998.cms", "urlToImage": null, "publishedAt": "2020-04-25T03:22:00Z", "content": "Almost two weeks back two of the world’s biggest tech companies — Apple\r\n and Google\r\n — announced that they would work together to help in the fight against coronavirus\r\n pandemic. The two companies announced their plans of helping governments, health agenci… [+310 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Day 31 of coronavirus lockdown: Ground report from Indian cities - India Gone Viral", "description": "TIMESOFINDIA.COM | Apr 24, 2020, 13:47 ISTNEW DELHI: The number of coronavirus cases in India have crossed the 23,000 mark. 718 patients have died so far due to the coronavirus in India. Mumbai saw th", "url": "https://indiagoneviral.com/news/2020/04/25/day-31-of-coronavirus-lockdown-ground-report-from-indian-cities/41852/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T03:05:14Z", "content": "TIMESOFINDIA.COM | Apr 24, 2020, 13:47 IST\r\nNEW DELHI: The number of coronavirus cases in India have crossed the 23,000 mark. 718 patients have died so far due to the coronavirus in India. Mumbai saw the biggest rise in the number of cases on Thursday with 52… [+8290 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18.com", "title": "Sobhita Dhulipala Issues Clarification After Being Accused of Lying About 'Self-Clicked' Cover - News18", "description": "Sobhita's statement comes after a series of her behind-the-scenes pictures from the shoot were surfaced online.", "url": "https://www.news18.com/news/lifestyle/sobhita-dhulipala-releases-statement-after-being-accused-of-lying-about-self-clicked-cover-2591861.html", "urlToImage": null, "publishedAt": "2020-04-25T02:46:09Z", "content": "Actress Sobhita Dhulipala has released a statement regarding her \"self-timed\" magazine cover after being accused of lying about clicking them by herself.\r\nSobhita's statement comes after a series of her behind-the-scenes pictures from her Cosmopolitan magazin… [+2087 chars]"}, {"source": {"id": null, "name": "Theweek.in"}, "author": null, "title": "THE WEEK morning brief: Cabinet secretary to meet state officials on lockdown - THE WEEK", "description": "The meeting comes two days before Modi holds a videoconference with all CMs", "url": "https://www.theweek.in/news/india/2020/04/25/the-week-morning-brief-cabinet-secretary-to-meet-state-officials-on-lockdown.html", "urlToImage": null, "publishedAt": "2020-04-25T02:26:47Z", "content": "Bureaucrats meeting\r\nCabinet Secretary Rajiv Gauba is scheduled to meet all chief secretaries and top police officials of all states and Union territories on Saturday. According to reports, the meeting is aimed at charting a road map to normalcy after the nat… [+2311 chars]"}, {"source": {"id": null, "name": "Gizbot.com"}, "author": "Sharmishte Datti", "title": "NASA VITAL Prototype Ventilators To Help Fight COVID-19 Pandemic - Gizbot", "description": "In a bid to help the coronavirus infected, NASA has announced that it has successfully developed a prototype ventilator for the treatment of coronavirus patients. For this, NASA has developed VITAL or the Ventilator Intervention Technology Accessible Locally.", "url": "https://www.gizbot.com/news/covid-19-pandemic-nasa-builds-prototype-ventilators-067269.html", "urlToImage": null, "publishedAt": "2020-04-25T02:00:00Z", "content": "In a bid to help the coronavirus infected, NASA has announced that it has successfully developed a prototype ventilator for the treatment of coronavirus patients. For this, NASA has developed VITAL or the Ventilator Intervention Technology Accessible Locally.… [+2604 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Sara Ali Khan Brings Back Her Knock-knock Series with Brother Ibrahim, Watch Hilarious Video - News18", "description": "Sara Ali Khan reprised her iconic knock-knock series with her brother Ibrahim where she made bad jokes with hilarious results amid the Coronavirus lockdown.", "url": "https://www.news18.com/news/movies/sara-ali-khan-brings-back-her-knock-knock-series-with-brother-ibrahim-watch-hilarious-video-2591593.html", "urlToImage": null, "publishedAt": "2020-04-25T01:41:31Z", "content": "Actress Sara Ali Khan is known for her wit and sense of humour on social media. Be it her \"shayaris\", throwback videos or even her knock-knock jokes, Sara keeps her fans entertained. Recently, the actress reprised her iconic knock-knock series with her brothe… [+679 chars]"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Adnan Riaz", "title": "Ronaldo And Ronaldinho Finally Answer GOAT Debate Between Lionel Messi And Cristiano Ronaldo - SPORTbible", "description": "Ronaldinho and Ronaldo praised Lionel Messi and Cristiano Ronaldo, but they both chose the same player in the footballing GOAT debate.", "url": "https://www.sportbible.com/football/news-rivalries-ronaldo-and-ronaldinho-answer-goat-debate-between-messi-and-cristiano-20200424", "urlToImage": null, "publishedAt": "2020-04-24T18:53:18Z", "content": "Brazilian legends Ronaldinho and Ronaldo revealed that they would choose Lionel Messi ahead of Cristiano Ronaldo as the 'GOAT of football.'\r\nMessi and Ronaldo's status as two of the best players in the history of the sport has led to many debating who is the … [+1624 chars]"}, {"source": {"id": null, "name": "Biospectrumasia.com"}, "author": null, "title": "Scientists identify key nasal cells believed to attract Coronavirus - BSA bureau", "description": "Scientists discovered that goblet and ciliated cells in the nose have high levels of the entry proteins that the Coronavirus uses to get into our cells.", "url": "https://www.biospectrumasia.com/news/26/15851/scientists-identify-key-nasal-cells-believed-to-attract-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-24T18:29:42Z", "content": "Scientists discovered that goblet and ciliated cells in the nose have high levels of the entry proteins that the Coronavirus uses to get into our cells.\r\nTwo specific nose cell types have been identified as likely initial infection points for COVID-19 coronav… [+1756 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "The Hans India", "title": "Plasma therapy for Covid patients from Monday Only 13 new cases in Telangana in 24 hrs - The Hans India", "description": "Hyderabad: Health Minister Eatala Rajender said Telangana has got the nod for convalescent plasma...", "url": "https://www.thehansindia.com/telangana/plasma-therapy-for-covid-patients-from-monday-only-13-new-cases-in-telangana-in-24-hrs-619047", "urlToImage": null, "publishedAt": "2020-04-24T18:02:48Z", "content": "Hyderabad: Health Minister Eatala Rajender said Telangana has got the nod for convalescent plasma therapy from the Centre and it would be done on Covid-19 patients in critical condition from Monday.\r\nHe said that 13 new cases were confirmed with 29 recovered … [+1903 chars]"}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "First-ever digital geological map of moon released by US Geological Survey - Down To Earth Magazine", "description": "It will serve as a blue print for future human lunar missions", "url": "https://www.downtoearth.org.in/news/science-technology/first-ever-digital-geological-map-of-moon-released-by-us-geological-survey-70690", "urlToImage": null, "publishedAt": "2020-04-24T15:59:01Z", "content": "The first ever digital, unified, global, geological map of the moon was released virtually by the  United States Geological Survey (USGS), National Aeronautics and Space Administration (Nasa) and the Lunar Planetary Institute on April 22, 2020.\r\nThe map is a … [+2958 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Surajit Dasgupta", "title": "What triggered 500-point fall in Sensex today and key levels to watch out for - Livemint", "description": "Bears again gripped Indian markets after two sessions of bullish show.Financials were among the worst hit today in Indian markets", "url": "https://www.livemint.com/news/india/what-triggered-500-point-in-sensex-today-and-key-levels-to-watch-out-for-11587726823356.html", "urlToImage": null, "publishedAt": "2020-04-24T11:35:06Z", "content": "Indian stock markets fell sharply today, dragged down by financial stocks after after a prominent fund house said it would wind up some funds. The Sensex closed down over 500 points at 31,327, closing the week about 1% lower while Nifty ended 1.71% lower at 9… [+4623 chars]"}, {"source": {"id": null, "name": "Deccanchronicle.com"}, "author": null, "title": "Virus cases continue to rise as country inches closer to end of lockdown - Deccan Chronicle", "description": "The Indian Council of Medical Research (ICMR) said a total 23,502 samples have been confirmed positive for coronavirus so far", "url": "https://www.deccanchronicle.com/nation/current-affairs/240420/virus-cases-continue-to-rise-as-country-inches-closer-to-end-of-lockdo.html", "urlToImage": null, "publishedAt": "2020-04-24T05:27:00Z", "content": "New Delhi: The death toll due to COVID-19 rose to 718 and the number of cases to 23,077 in the country on Friday, according to the Union Health Ministry.\r\nThe number of active COVID-19 cases is 17,610 as 4,748 people were cured and discharged, and one patient… [+2730 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "India faring better than other countries at the 5L-test mark: Committee chief - Times of India", "description": "India News: Though the number of Covid-19 patients in India is rising, the graph is linear and not exponential and could indicate a flattening of the curve as the", "url": "https://timesofindia.indiatimes.com/india/india-faring-better-than-other-countries-at-the-5l-test-mark-committee-chief/articleshow/75336392.cms", "urlToImage": null, "publishedAt": "2020-04-24T04:52:23Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Over 23,000 Covid-19 cases recorded in India, death toll at 718 - Hindustan Times", "description": "Officials and medical experts have said India the country’s preventive measures have helped in reducing in the coronavirus disease’s doubling rate and also allowed the ramping up of testing and bolstering health care preparedness.", "url": "https://www.hindustantimes.com/india-news/india-has-more-than-23-000-covid-19-cases-718-deaths/story-iMYIU6jbbDC65yt2dKsIoO.html", "urlToImage": null, "publishedAt": "2020-04-24T04:47:00Z", "content": "More than 23,000 people have been infected by Sars-CoV-2, the virus that causes Covid-19, and 718 have died in India, according to the Union health ministry data on Friday morning.\r\nWith 17,610 active cases, 4749 people cured or migrated and 718 deaths, India… [+857 chars]"}, {"source": {"id": null, "name": "Tribuneindia.com"}, "author": "Tribune India", "title": "COVID-19 infection rate in India has slowed down to ‘flatten the curve’: Govt - The Tribune India", "description": "More than 5 lakh tests done till April 22", "url": "https://www.tribuneindia.com/news/nation/covid-19-infection-rate-in-india-has-slowed-down-to-flatten-the-curve-govt-75156", "urlToImage": null, "publishedAt": "2020-04-23T17:42:56Z", "content": "New Delhi, April 23\r\nStriking a positive note on the COVID-19 situation in India, the Centre on Thursday said it has been able to slow down the infection rate to “flatten the curve” and minimise the spread during the period of the national lockdown which has … [+5145 chars]"}]}