{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Nytimes.com"}, "author": null, "title": "Live Coronavirus News and Updates - The New York Times", "description": "An internal Trump administration report expects about 200,000 daily cases by June. The White House bars coronavirus task force officials from testifying to Congress without approval.", "url": "https://www.nytimes.com/2020/05/04/us/coronavirus-live-updates.html", "urlToImage": "https://static01.nyt.com/images/2020/03/03/world/coronavirus-map-promo/coronavirus-map-promo-facebookJumbo-v490.png", "publishedAt": "2020-05-05T04:24:13Z", "content": "Heres what you need to know:\r\nAs President Trump presses for states to reopen their economies, his administration is privately projecting a steady rise in the number of coronavirus cases and deaths over the next several weeks. The daily death toll will reach … [+30787 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Daniel Villarreal", "title": "Dr. Fauci Dismisses Wuhan Lab as Source of Coronavirus, Contradicting Trump and Pompeo - Newsweek", "description": "\"If you look at the evolution of the virus in bats and what's out there now, [the scientific evidence] is very, very strongly leaning toward this could not have been artificially or deliberately...", "url": "https://www.newsweek.com/dr-fauci-dismisses-wuhan-lab-source-coronavirus-contradicting-trump-pompeo-1501924", "urlToImage": "https://d.newsweek.com/en/full/1587263/dr-anthony-fauci.jpg", "publishedAt": "2020-05-05T04:12:33Z", "content": "Dr. Anthony Fauci, the scientific face of America's pandemic response, dismissed the theory that coronavirus originated in a lab in Wuhan, contradicting the president and his Secretary of State in an escalating confrontation with China.\r\n\"The best evidence sh… [+6857 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "John Myers", "title": "Newsom refuses to divulge secret deal for coronavirus masks - Los Angeles Times", "description": "In a letter to the Los Angeles Times, the Governor's Office of Emergency Services insisted the contract with BYD does not have to be made public.", "url": "https://www.latimes.com/california/story/2020-05-04/gavin-newsom-will-not-release-california-coronavirus-masks-byd-contract", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/ed74234/2147483647/strip/true/crop/6554x3441+0+464/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F89%2Fef%2Ffa9083ab4c7db10ea9cc229fa690%2Fvirus-outbreak-hospital-ship-few-patients-78442.jpg", "publishedAt": "2020-05-05T03:23:02Z", "content": "Attorneys for Gov. Gavin Newsoms administration refused Monday to reveal the contents of a $990-million contract for purchasing protective masks from a Chinese electric car manufacturer, even though millions of the masks have already arrived in California to … [+3745 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Foran, CNN", "title": "Nancy Pelosi defends decision to decline Trump admin testing offer: 'They don't have them' - CNN", "description": "House Speaker Nancy Pelosi on Monday defended her decision along with Senate Majority Leader Mitch McConnell to decline an offer from the Trump administration to deploy rapid coronavirus testing capabilities to Capitol Hill and said that tests should go to Am…", "url": "https://www.cnn.com/2020/05/04/politics/pelosi-white-house-coronavirus-hill-testimony-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200504192320-nancy-pelosi-payroll-tax-cut-super-tease.jpg", "publishedAt": "2020-05-05T03:16:02Z", "content": "Washington (CNN)House Speaker Nancy Pelosi on Monday defended her decision along with Senate Majority Leader Mitch McConnell to decline an offer from the Trump administration to deploy rapid coronavirus testing capabilities to Capitol Hill and said that tests… [+3173 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alec Snyder, Mirna Alsharif and Theresa Waldrop, CNN", "title": "Three family members charged in shooting death of security guard who told a customer to put on a face mask - CNN", "description": "Three family members have been charged in the killing of a security guard who told a customer at a Michigan Family Dollar store to wear a state-mandated face mask, officials said on Monday.", "url": "https://www.cnn.com/2020/05/04/us/michigan-security-guard-mask-killing-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200504123938-family-dollar-shooting-super-tease.jpg", "publishedAt": "2020-05-05T02:05:52Z", "content": null}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Kenneth Garger", "title": "Miami Beach park closes after nearly 9,000 Covidiots violate face mask policy - New York Post ", "description": "A popular Miami Beach green space was reportedly closed Monday — five days after reopening — because nearly 9,000 people were caught violating the park’s mask policy. South Pointe Park …", "url": "https://nypost.com/2020/05/04/miami-beach-park-closes-after-nearly-9000-people-violate-face-mask-policy/", "urlToImage": "https://thenypost.files.wordpress.com/2020/05/south-pointe-park.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-05-05T01:56:58Z", "content": "A popular Miami Beach green space was reportedly closed Monday — five days after reopening — because nearly 9,000 people were caught violating the parks mask policy.\r\nSouth Pointe Park had initially opened back up Wednesday, along with other green spaces in M… [+1066 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Henry Fountain", "title": "Billions Could Live in Extreme Heat Zones Within Decades, Study Finds - The New York Times", "description": "Researchers said that by 2070 extreme heat could encompass a much larger part of Africa, as well as parts of India, the Middle East, South America, Southeast Asia and Australia.", "url": "https://www.nytimes.com/2020/05/04/climate/heat-temperatures-climate-change.html", "urlToImage": "https://static01.nyt.com/images/2020/05/04/climate/04cli/04cli--facebookJumbo.jpg", "publishedAt": "2020-05-05T01:51:17Z", "content": "As the climate continues to warm over the next half-century, up to one-third of the worlds population is likely to live in areas that are considered unsuitably hot for humans, scientists said Monday.\r\nCurrently fewer than 25 million people live in the worlds … [+3741 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Jenn Leser", "title": "Second wave of coronavirus is \"very likely,\" doctor warns - CBS News", "description": "Public health officials have warned a second wave of coronavirus is likely this fall.", "url": "https://www.cbsnews.com/news/coronavirus-second-wave-very-likely-doctor-says/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/05/01/529d38bd-77c5-47aa-aad8-b43a5f6901bd/thumbnail/1200x630/da85621552d1ab90de3873c125a1294e/gettyimages-1211277802.jpg", "publishedAt": "2020-05-05T01:37:28Z", "content": "As states begin to reopen and social distancing rules are relaxed, public health officials are warning about a possible second wave of coronavirus cases later this year. Dr. Shoshana Ungerleider, an internal medicine physician at Sutter Health in San Francisc… [+1109 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Anna Wintour Addresses the Met Gala and Florence + The Machine Performs | Vogue - Vogue", "description": "Vogue editor in chief Anna Wintour addresses the Met Gala and Florence + The Machine perform and acoustic version of the song \"You've Got the Love.\" Vogue wi...", "url": "https://www.youtube.com/watch?v=HptQEYkMrVQ", "urlToImage": "https://i.ytimg.com/vi/HptQEYkMrVQ/maxresdefault.jpg", "publishedAt": "2020-05-05T01:28:58Z", "content": "Vogue editor in chief Anna Wintour addresses the Met Gala and Florence + The Machine perform and acoustic version of the song \"You've Got the Love.\"\r\nVogue will make a donation to both the Costume Institute and A Common Thread, and will ask viewers to conside… [+599 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Kevin Stankiewicz", "title": "Retail investors bought airline stocks even as travel slowed to a trickle, TD Ameritrade says - CNBC", "description": "\"I don't think you're buying these thinking that that business is coming back immediately,\" TD Ameritrade chief market strategist JJ Kinahan told CNBC.", "url": "https://www.cnbc.com/2020/05/04/td-ameritrades-retail-investors-bought-airline-stocks-in-april.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106474161-1585941859869gettyimages-1216652481.jpeg?v=1585941910", "publishedAt": "2020-05-05T01:15:16Z", "content": "Warren Buffett's Berkshire Hathaway has sold all its airline stocks, but retail investors at TD Ameritrade were buying them in April, according to JJ Kinahan, the firm's chief market strategist. \r\n\"Nobody in their right mind normally fades Mr. Buffett, but wi… [+2382 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Pelosi responds to Trump's demand for payroll tax cut: No way - CNN", "description": "House Speaker Nancy Pelosi responds to President Donald Trump's threat that he'll block the next coronavirus relief package unless Congress cuts payroll taxe...", "url": "https://www.youtube.com/watch?v=CGMrX1nz9HY", "urlToImage": "https://i.ytimg.com/vi/CGMrX1nz9HY/maxresdefault.jpg", "publishedAt": "2020-05-05T01:08:45Z", "content": "House Speaker Nancy Pelosi responds to President Donald Trump's threat that he'll block the next coronavirus relief package unless Congress cuts payroll taxes.#CNN#News"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Mike Florio", "title": "Larry Csonka “felt a terrible loss” on hearing of Don Shula’s passing - NBCSports.com", "description": "Hall of Fame coach Don Shula died on Tuesday at the age of 90. One of his Hall of Fame pupils took the loss harder than he thought he would. “I was out cutting brush in a field, and my wife Audrey called me and said Coach had passed,” former Dolphins running …", "url": "https://profootballtalk.nbcsports.com/2020/05/04/larry-csonka-felt-a-terrible-loss-on-hearing-of-don-shulas-passing/", "urlToImage": "https://profootballtalk.nbcsports.com/wp-content/uploads/sites/25/2020/05/GettyImages-98290511-e1588639675829.jpg", "publishedAt": "2020-05-05T00:48:00Z", "content": "Hall of Fame coach Don Shula died on Tuesday at the age of 90. One of his Hall of Fame pupils took the loss harder than he thought he would.\r\n“I was out cutting brush in a field, and my wife Audrey called me and said Coach had passed,” former Dolphins running… [+4399 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Around The NFL staff", "title": "2020 NFL schedule set for release Thursday - NFL.com", "description": "The 2020 NFL schedule will be unveiled on Thursday at 8 p.m. ET on the NFL Network, NFL app and NFL.com. It's time to circle your calendars.", "url": "http://www.nfl.com/news/story/0ap3000001112748/article/2020-nfl-schedule-set-for-release-thursday-night", "urlToImage": "http://static.nfl.com/static/content/public/photo/2020/05/04/0ap3000001112746_thumbnail_200_150.jpg", "publishedAt": "2020-05-05T00:08:00Z", "content": "Circle your calendars and plan ahead.\r\nThe 2020 NFL schedule will be unveiled Thursday night at 8 ET on the NFL Network, the NFL app and NFL.com. \r\nOpponents for all 32 teams were previously released on Dec. 30, 2019, but Thursday will see the 2020 slate unve… [+1090 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju, Clare Foran and Ted Barrett, CNN", "title": "Scant agreement over next relief package in Congress as economy reels from coronavirus crisis - CNN", "description": "Senate Republicans and House Democrats are at sharp odds over the next relief package -- about the size, scope and policy -- even as the coronavirus crisis facing the United States is threatening to further drag down the economy and send scores of more Americ…", "url": "https://www.cnn.com/2020/05/04/politics/coronavirus-congress-stimulus/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191216230457-schumer-mcconnell-split-super-tease.jpg", "publishedAt": "2020-05-04T23:55:01Z", "content": "Washington (CNN)Senate Republicans and House Democrats are at sharp odds over the next relief package -- about the size, scope and policy -- even as the coronavirus crisis facing the United States is threatening to further drag down the economy and send score… [+9209 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Concepción de León", "title": "Pulitzer Prizes: A Guide to the Winning Books and Finalists - The New York Times", "description": "Here are the 2020 contenders for fiction, nonfiction, poetry, history and biography.", "url": "https://www.nytimes.com/2020/05/04/books/pulitzer-prize-books.html", "urlToImage": "https://static01.nyt.com/images/2020/05/04/books/04pulitzerbooks1/04pulitzerbooks1-facebookJumbo.jpg", "publishedAt": "2020-05-04T23:46:54Z", "content": "Fifteen books were recognized as winners or finalists for the Pulitzer Prize on Monday, in the categories of fiction, general history, biography, poetry and general nonfiction.\r\nIn his latest novel, the Underground Railroad writer fictionalized the story of a… [+6288 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Andrew Limbong", "title": "2020 Pulitzer Prize Winners Announced - Full List - NPR", "description": "This year's Pulitzer Prize Board awarded its first Audio Reporting award to the staff of This American Life, for a piece on the Trump administration's \"remain in Mexico\" policy.", "url": "https://www.npr.org/2020/05/04/849991957/2020-pulitzer-prize-winners-include-this-american-life-see-a-full-list", "urlToImage": "https://media.npr.org/assets/img/2020/05/04/gettyimages-2119740_wide-6d5d2ff0a8f9a8f56a55c9ba81e1d2d0d38d5846.jpg?s=1400", "publishedAt": "2020-05-04T23:44:29Z", "content": "The Pulitzer Prize board awarded suffragist Ida B. Wells a special citation for her reporting on lynching.\r\nR. Gates/Getty Images\r\nThere were a couple firsts in this year's announcement of the winners of the Pulitzer Prize. First off, it was done remotely due… [+3343 chars]"}, {"source": {"id": null, "name": "Click2houston.com"}, "author": "Ashley Strickland, CNN", "title": "Halley’s Comet is bringing a meteor shower that will peak tonight! When and how to watch - KPRC Click2Houston", "description": "The Eta Aquariid meteor shower is expected to peak on Tuesday, but a nearly full moon could outshine the show.", "url": "https://www.click2houston.com/news/local/2020/05/04/halleys-comet-is-bringing-a-meteor-shower-that-will-peak-tonight-when-and-how-to-watch/", "urlToImage": "https://www.click2houston.com/resizer/X9mI6JMqf20BzZMAEdcol4QAGeo=/1600x1067/smart/filters:format(jpeg):strip_exif(true):strip_icc(true):no_upscale(true):quality(65)/arc-anglerfish-arc2-prod-gmg.s3.amazonaws.com/public/3VBCLIDIS5BQZPNH36XTMT6J7Y.jpg", "publishedAt": "2020-05-04T23:42:16Z", "content": "(CNN) The Eta Aquariid meteor shower is expected to peak on Tuesday, but a nearly full moon could outshine the show.\r\nMay is the best spring month to view meteor activity for those in the northern hemisphere, according to the American Meteor Society.\r\nHowever… [+1545 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Napier Lopez", "title": "Samsung’s Galaxy Book Flex, its most interesting laptop in ages, is now available in the US - The Next Web", "description": "Samsung’s Galaxy Book Flex, one of the first laptops with a QLED display, and one of Samsung’s most premium laptops in ages, is now on sale in the US. It’s a sign the company is becoming more serious about its laptop offerings. The Galaxy Flex is a premium 2-…", "url": "https://thenextweb.com/plugged/2020/05/04/samsungs-galaxy-book-flex-its-most-interesting-laptop-in-ages-is-now-available-in-the-us/", "urlToImage": "https://img-cdn.tnwcdn.com/image/plugged?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2020%2F05%2FGalaxy-Book-Flex_NT930QCGI_035_Pair_Front-Open_Blue.png&signature=1540bbe4486b8959ec0cfb3b5c5650dc", "publishedAt": "2020-05-04T23:32:21Z", "content": "Samsungs Galaxy Book Flex, one of the first laptops with a QLED display, and one of Samsungs most premium laptops in ages, is now on sale in the US. Its a sign the company is becoming more serious about its laptop offerings.\r\nThe Galaxy Flex is a premium 2-in… [+2432 chars]"}, {"source": {"id": null, "name": "Good.is"}, "author": "Julia Conley", "title": "Citing 'vein of toxicity' and firing of whistleblowers, Amazon VP resigns in disgust - GOOD Magazine", "description": "\"This is a really big deal. This kind of courage is what we need right now, in every workplace and walk of life.\"", "url": "https://www.good.is/Business/amazon-vp-resigns-work-conditions-bezos", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMzIwNzAwMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTYzNjY0MzU2MH0.bnOnSLNkjbuzlmt53OaNwS-t2fqLsTtO3946Xa5MVJI/img.jpg?width=1200&coordinates=0%2C11%2C0%2C11&height=600", "publishedAt": "2020-05-04T23:32:00Z", "content": "This article originally appeared on Common Dreams. You can read it here.\r\nAmazon vice president Tim Bray won praise from labor rights advocates on Monday after resigning from the company over its treatment of whistleblowers during the Covid-19 pandemic, publi… [+3756 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "", "title": "Saudi Arabia's Oil Tanker Flotilla Is Reaching The U.S., Despite Some Objections - NPR", "description": "At least 18 very large crude carriers, each carrying 2 million barrels of oil, are headed to the U.S. American shale producers and some lawmakers are worried.", "url": "https://www.npr.org/2020/05/04/850026351/saudi-arabias-oil-tanker-flotilla-is-reaching-the-u-s-despite-some-objections", "urlToImage": "https://media.npr.org/assets/img/2020/05/04/ap_20101568387513_wide-7ff10e47041fb4fa5a6d922c652edf0abac36b3b.jpg?s=1400", "publishedAt": "2020-05-04T22:50:46Z", "content": "Saudi Prince Abdulaziz bin Salman Al-Saud, minister of energy of Saudi Arabia, chairs a virtual summit of the Group of 20 energy ministers at his office in Riyadh, Saudi Arabia, on April 10, to coordinate a response to plummeting oil prices due to an oversupp… [+4826 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "Google starts enforcing email-based two-factor authentication on Nest accounts - 9to5Google", "description": "Back in February, Google announced that it would require all Nest users to enable two-factor authentication this spring. Google Nest accounts 2FA...", "url": "https://9to5google.com/2020/05/04/google-nest-accounts-2fa/", "urlToImage": "https://9to5google.com/wp-content/uploads/sites/4/2020/01/nest_cam_iq_1.jpg?resize=1024,512", "publishedAt": "2020-05-04T22:26:14Z", "content": "Back in February, Google announced that it would require all Nest users to enable two-factor authentication this spring. Google is now starting to enforce this new 2FA account security measure.\r\nThis measure is intended for Nest users that have not migrated t… [+1395 chars]"}, {"source": {"id": null, "name": "Variety.com"}, "author": "Brian Steinberg", "title": "Andy Lack Will Leave NBC News After Chaotic Tenure - Variety", "description": "During Andy Lack’s first tour of duty leading NBC News, he helped “Dateline” bounce back from a dark era in which producers admitted to manipulating elements of an investigative report on General Motors, and expanded the hours of the “Today” morning franchise…", "url": "https://variety.com/2020/tv/news/andy-lack-nbc-news-depature_tv-1234597490/", "urlToImage": "https://pmcvariety.files.wordpress.com/2017/11/andrew-lack.jpg?w=1000", "publishedAt": "2020-05-04T22:20:42Z", "content": "During Andy Lack’s first tour of duty leading NBC News, he helped “Dateline” bounce back from a dark era in which producers admitted to manipulating elements of an investigative report on General Motors, and expanded the hours of the “Today” morning franchise… [+5150 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Caitlin McGarry", "title": "Here’s What Apple and Google Want Coronavirus Contact-Tracing Apps to Look Like - Gizmodo", "description": "Apple and Google aren’t developing coronavirus-tracking apps, but on Monday they shared examples of what those apps could look like. Most notably, the tech giants detailed what the public health authorities who can use their contact-tracing APIs to create tho…", "url": "https://gizmodo.com/here-s-what-apple-and-google-want-coronavirus-contact-t-1843247795", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/tdjkvwxsefmhltypiwwt.jpg", "publishedAt": "2020-05-04T22:17:34Z", "content": "Apple and Google arent developing coronavirus-tracking apps, but on Monday they shared examples of what those apps could look like. Most notably, the tech giants detailed what the public health authorities who can use their contact-tracing APIs to create thos… [+2461 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Vandana Rambaran", "title": "NYPD officers say coronavirus social distancing policing needs to end - Fox News", "description": "Officers from the New York Police Department have decried city officials \"get cops out of the social distancing enforcement business altogether,\" following backlash stemming from a violent confrontation with police over the weekend as officers tried to enforc…", "url": "https://www.foxnews.com/us/nypd-officers-say-coronavirus-social-distancing-policing-needs-to-end", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/05/AP20122726452629.jpg", "publishedAt": "2020-05-04T22:13:33Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nOfficers from the New York Police Department have decried city officials \"get cops out of the social distancing enforcement business altogether,\" following backlash … [+3695 chars]"}, {"source": {"id": null, "name": "Voanews.com"}, "author": "VOA Learning English", "title": "NASA Goes Private for 1st Astronaut Lunar Landers Since 1970s - VOA Learning English", "description": "The American space agency NASA is looking to private industry to build lunar landers. NASA Administrator Jim Bridenstine announced last week that three businesses will develop, build and fly the lunar landers.", "url": "https://learningenglish.voanews.com/a/nasa-goes-private-for-1st-astronaut-lunar-landers-since-1970s/5404649.html", "urlToImage": "https://gdb.voanews.com/85FA0453-0D35-46EF-85C2-A4D1C4FB2310_w1200_r1.jpg", "publishedAt": "2020-05-04T21:57:00Z", "content": "The American space agency NASA is looking to private industry to build lunar landers. When completed, the spacecraft will be the first to take astronauts to the surface of the moon in almost 50 years.\r\nNASA Administrator Jim Bridenstine announced last week th… [+3531 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Ryan Parry West Coast Editor For Dailymail.com", "title": "Scott Disick checks himself into Colorado rehab for alcohol and cocaine abuse - Daily Mail", "description": "Troubled Scott Disick, 36, has checked himself into a luxury addiction treatment center in The Rocky Mountains after relapsing with booze and drugs, DailyMailTV can reveal.", "url": "https://www.dailymail.co.uk/news/article-8285683/Scott-Disick-checks-Colorado-rehab-alcohol-cocaine-abuse.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/04/20/27998368-0-image-a-7_1588621148051.jpg", "publishedAt": "2020-05-04T21:48:06Z", "content": "Troubled Scott Disick has checked himself into a luxury addiction treatment center in The Rocky Mountains after relapsing with booze and drugs, DailyMailTV can exclusively reveal.\r\nThe reality star arrived at the exclusive All Points North Lodge in Edwards, C… [+7916 chars]"}, {"source": {"id": null, "name": "Snopes.com"}, "author": "David Mikkelson", "title": "A Majority of Vaccine Skeptics Plan to Refuse a COVID-19 Vaccine, A Study Suggests - Snopes.com", "description": "If most of these individuals forego receiving a COVID-19 vaccine, they could potentially jeopardize the recovery process.", "url": "https://www.snopes.com/news/2020/05/04/a-majority-of-vaccine-skeptics-plan-to-refuse-a-covid-19-vaccine-a-study-suggests/", "urlToImage": "https://www.snopes.com/tachyon/2018/01/flu_shot_fb.jpg", "publishedAt": "2020-05-04T21:30:50Z", "content": "This article is republished here with permission from The Conversation. This content is shared here because the topic may interest Snopes readers; it does not, however, represent the work of Snopes fact-checkers or editors.\r\nThe availability of a vaccine for … [+6653 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Nicole Lyn Pesce", "title": "The Twitter response to J.Crew filing for bankruptcy has been savage — but it has a point - MarketWatch", "description": "Many tweets note that the retailer’s problems were terminal long before the coronavirus hit", "url": "https://www.marketwatch.com/story/the-twitter-response-to-j-crew-filing-for-bankruptcy-has-been-savage-but-it-has-a-point-2020-05-04", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-IF791_JCrewS_ZG_20200504152125.jpg", "publishedAt": "2020-05-04T20:48:44Z", "content": "The unraveling of J.Crew has spun many Twitter threads, from fans mourning the possible end of an iconic American brand to those dancing on the preppy New York labels grave. The news led J.Crew to top Google\r\n GOOG, \r\n +0.46%\r\nsearches and to go viral on Twit… [+2953 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Cara Giaimo", "title": "The Ghost Dogs of the Amazon Get a Bit Less Mysterious - NewsClicks", "description": "Scientists have produced data that shows the range of an enigmatic short-eared canid species that has yet to be widely studied.", "url": "https://www.nytimes.com/2020/05/04/science/ghost-dog-amazon-rainforest.html", "urlToImage": "https://static01.nyt.com/images/2020/05/04/science/04tb-ghostdog01/04tb-ghostdog01-facebookJumbo.jpg", "publishedAt": "2020-05-04T20:41:41Z", "content": "It is one of the Amazon rain forests most elusive and enigmatic mammals. Experts call the species shy or even a ghost.\r\nIts a dog.\r\nOr at least a type of dog. The short-eared canid is the only member of the canine genus Atelocynus, and the only such species u… [+4116 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Luke Money", "title": "Coronavirus: 2 California counties let some businesses reopen - Los Angeles Times", "description": "Some coronavirus-related regulations were relaxed in California's Yuba and Sutter counties, letting some businesses reopen starting Monday.", "url": "https://www.latimes.com/california/story/2020-05-04/coronavirus-california-reopening-yuba-sutter-counties-businesses", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/a421841/2147483647/strip/true/crop/4338x2277+0+307/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F87%2Fd6%2F638d5083446fae29d6f736653dd6%2Fap20119044929392.jpg", "publishedAt": "2020-05-04T19:41:46Z", "content": "For Natalie Lambert, welcoming diners back into her Yuba City restaurant was an exciting but somewhat conflicting experience. \r\nYou dont know if youre an outlaw or a pioneer at this point, the Lambert House Cafe owner said in a phone interview.\r\nShe, like oth… [+5874 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Scholes finds novel magnetic field effect in diamagnetic molecules - Phys.org", "description": "The Princeton University Department of Chemistry publishes research this week proving that an applied magnetic field will interact with the electronic structure of weakly-magnetic, or diamagnetic, molecules to induce a magnetic-field effect that, to their kno…", "url": "https://phys.org/news/2020-05-scholes-magnetic-field-effect-diamagnetic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/scholesfinds.jpg", "publishedAt": "2020-05-04T19:16:58Z", "content": "The Princeton University Department of Chemistry publishes research this week proving that an applied magnetic field will interact with the electronic structure of weakly-magnetic, or diamagnetic, molecules to induce a magnetic-field effect that, to their kno… [+6193 chars]"}, {"source": {"id": null, "name": "Fivethirtyeight.com"}, "author": "Philip Kiefer", "title": "Why Scientists Think The Novel Coronavirus Developed Naturally — Not In A Chinese Lab - FiveThirtyEight", "description": "You could be forgiven for wondering how a disease as fast-moving and deadly as COVID-19 could just appear naturally, out of nowhere, seemingly overnight. Presid…", "url": "https://fivethirtyeight.com/features/why-scientists-think-the-novel-coronavirus-developed-naturally-not-in-a-chinese-lab/", "urlToImage": "https://fivethirtyeight.com/wp-content/uploads/2020/05/RTX6DE5B-16x9-1.jpg?w=575", "publishedAt": "2020-05-04T18:58:00Z", "content": "You could be forgiven for wondering how a disease as fast-moving and deadly as COVID-19 could just appear naturally, out of nowhere, seemingly overnight. President Trump expressed doubt, saying that a lot of people were looking at the possibility that a Chine… [+8623 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "NFL cancels all international games in London, Mexico City for the 2020 NFL season - CBS Sports", "description": "The NFL will be staying home in 2020 due to COVID-19", "url": "https://www.cbssports.com/nfl/news/nfl-cancels-all-international-games-in-london-mexico-city-for-the-2020-nfl-season/", "urlToImage": "https://sportshub.cbsistatic.com/i/r/2020/05/04/f875f1d1-6c08-40ae-9a3e-e61fb0b16a11/thumbnail/1200x675/280c30373f6c20379c8a46ce013cffe9/usatsi-13614231.jpg", "publishedAt": "2020-05-04T18:31:33Z", "content": "The NFL won't be going abroad in 2020 as the world continues to battle the COVID-19 pandemic. The league will be staying home for at least one season.\r\nOn Monday, during the week of the expected schedule release, the NFL officially cancelled the five internat… [+3077 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "", "title": "Millions of Italians Return To Work As Coronavirus Lockdown Eases : Coronavirus Live Updates - NPR", "description": "Italy was one of the first countries to be racked by the disease. The government imposed strict lockdown policies on March 9, earlier than many countries started responding.", "url": "https://www.npr.org/sections/coronavirus-live-updates/2020/05/04/849989973/millions-return-to-work-in-italy-after-weeks-of-lockdown", "urlToImage": "https://media.npr.org/assets/img/2020/05/04/ap_20125359857254_wide-d9f0da0e54b30e07c99844de9de2ebb8e69abc82.jpg?s=1400", "publishedAt": "2020-05-04T17:50:49Z", "content": "Commuters crowd Cadorna train station in Milan on Monday. Italy has begun stirring again, after a nearly two-month coronavirus shutdown, as restrictions on movement ease.\r\nClaudio Furlan/AP\r\nAbout 4.5 million Italians are returning to work Monday as Italy one… [+2201 chars]"}, {"source": {"id": null, "name": "Variety.com"}, "author": "Joe Otterson", "title": "Nicolas Cage to Play ‘Tiger King’s’ Joe Exotic in Scripted Series From ‘American Vandal’ Showrunner (EXCLUSIVE) - Variety", "description": "Nicolas Cage is set to star in a scripted series centered on Joe Exotic, the subject of the Netflix docuseries “Tiger King,” Variety has learned exclusively. The eight-episode series is being produced by Imagine Television Studios and CBS Television Studios. …", "url": "https://variety.com/2020/tv/news/joe-exotic-nicolas-cage-series-tiger-king-1234574979/", "urlToImage": "https://pmcvariety.files.wordpress.com/2020/04/joe-exotic-nicholas-cage.jpg?w=1000", "publishedAt": "2020-05-04T17:31:39Z", "content": "Nicolas Cage is set to star in a scripted series centered on Joe Exotic, the subject of the Netflix docuseries “Tiger King,” Variety has learned exclusively.\r\nThe eight-episode series is being produced by Imagine Television Studios and CBS Television Studios.… [+2897 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "After retesting samples, French hospital discovers COVID-19 case from December - Yahoo News", "description": "A French hospital which has retested old samples from pneumonia patients discovered that it treated a man who had COVID-19 as early as Dec. 27, nearly a mont...", "url": "https://news.yahoo.com/retesting-samples-french-hospital-discovers-153353216.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-05-04T15:33:00Z", "content": "PARIS, May 4 (Reuters) - A French hospital which has retested old samples from pneumonia patients discovered that it treated a man who had COVID-19 as early as Dec. 27, nearly a month before the French government confirmed its first cases.\r\nYves Cohen, head o… [+2073 chars]"}, {"source": {"id": null, "name": "Apple.com"}, "author": null, "title": "Apple updates 13-inch MacBook Pro with Magic Keyboard, double the storage, and faster performance - Apple Newsroom", "description": "Apple today updated the 13-inch MacBook Pro, improving the typing experience with the new Magic Keyboard and doubling the storage.", "url": "https://www.apple.com/newsroom/2020/05/apple-updates-13-inch-macbook-pro-with-magic-keyboard-double-the-storage-and-faster-performance/", "urlToImage": "https://www.apple.com/newsroom/images/product/mac/standard/Apple_macbookpro-13-inch_screen_05042020_LP_hero.jpg.og.jpg?202005041234", "publishedAt": "2020-05-04T12:31:51Z", "content": "1 Performance claims are as compared to previous-generation MacBook Pro notebooks. For more information, visit: apple.com/macbook-pro. 2 Education pricing is available to current and newly accepted college students and their parents, as well as faculty, staff… [+280 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "NFL Nation", "title": "2020 NFL Power Rankings - 1-32 poll, plus post-draft winners for every team - ESPN", "description": "Ben Roethlisberger and Chandler Jones got some support in the NFL draft, while Alvin Kamara's importance was cemented even more.", "url": "https://www.espn.com/nfl/story/_/id/29119922/2020-nfl-power-rankings-1-32-poll-plus-post-draft-winners-every-team", "urlToImage": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0430%2Fnfl_post%2Ddraft%2Dpower%2Drankings_16x9.jpg", "publishedAt": "2020-05-04T10:52:51Z", "content": "The NFL draft is typically about who's next for each team. But while veteran players might receive more competition from the annual influx of rookies, the newbies can actually provide some help and positive clarity for the vets, too.\r\nThat's where we went wit… [+21020 chars]"}]}