{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Nbcsports.com"}, "author": "NBC Sports Staff", "title": "2020 NFL Draft order: Latest list of all picks, selections from Round 1 through Round 7 - NBC Sports - Misc.", "description": "The 2020 NFL Draft is happening now for all 32 teams and runs through Saturday, April 25. Rounds 2 and 3 will air on Friday, while rounds 4-7 are on Saturday. For those who want to see where every pick is in the NFL Draft order, see below. For the first time …", "url": "https://sports.nbcsports.com/2020/04/25/nfl-draft-order-2020/", "urlToImage": null, "publishedAt": "2020-04-25T04:08:00Z", "content": "The 2020 NFL Draft is happening now for all 32 teams and runs through Saturday, April 25. Rounds 2 and 3 will air on Friday, while rounds 4-7 are on Saturday. For those who want to see where every pick is in the NFL Draft order, see below.\r\nFor the first time… [+9697 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "HOLLY OTTERBEIN", "title": "New evidence surfaces in Tara Reade allegation against Biden - POLITICO", "description": "A 1993 video appears to show her mother calling the Larry King Show to discuss a claim against “a prominent senator.”", "url": "https://www.politico.com/news/2020/04/24/tara-reade-biden-video-207670", "urlToImage": null, "publishedAt": "2020-04-25T04:00:33Z", "content": "King asked the woman, She had a story to tell but, out of respect for the person she worked for, she didnt tell it?\" \r\nThe caller replied, \"That's true.\"\r\nIn March, Reade accused Biden of digitally penetrating her in 1993 without her consent. Last year, she t… [+1738 chars]"}, {"source": {"id": null, "name": "Behindthesteelcurtain.com"}, "author": "Jeff.Hartman", "title": "2020 NFL Draft: Steelers select OLB Alex Highsmith with 3rd round pick - Behind the Steel Curtain", "description": "The Pittsburgh Steelers have selected Alex Highsmith with their 3rd round pick.", "url": "https://www.behindthesteelcurtain.com/2020/4/24/21234488/2020-nfl-draft-results-pittsburgh-steelers-select-olb-alex-highsmith-with-3rd-round-pick-charlotte", "urlToImage": null, "publishedAt": "2020-04-25T03:50:36Z", "content": "Entering the 2020 NFL Draft, the Pittsburgh Steelers had a number of draft needs which they needed to address. With no first round selection in the draft, running back, safety and even pass rusher were still positions of need to help the black-and-gold get to… [+1540 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Tom Gillespie", "title": "Kanye West: Hip hop star and fashion designer becomes a billionaire - Sky News", "description": "The rapper, who has long coveted the status, has claimed he is worth more after his net worth was valued at $1.3bn (£1.05bn).", "url": "https://news.sky.com/story/kanye-west-hip-hop-star-and-fashion-designer-becomes-a-billionaire-11978510", "urlToImage": null, "publishedAt": "2020-04-25T03:39:04Z", "content": null}, {"source": {"id": null, "name": "Espn.com"}, "author": "Rob Demovsky", "title": "Packers' Jordan Love says Aaron Rodgers congratulated him on pick - ESPN", "description": "Jordan Love, the Green Bay Packers' first-round pick in the NFL draft, told ESPN's Maria Taylor on Friday that he and Aaron Rodgers had a good first interaction, and Rodgers congratulated him on joining the team.", "url": "https://www.espn.com/nfl/story/_/id/29096298/packers-jordan-love-says-aaron-rodgers-congratulated-pick", "urlToImage": null, "publishedAt": "2020-04-25T03:03:45Z", "content": "GREEN BAY, Wis. -- It took less than 24 hours for the Green Bay Packers' quarterback of the future to connect with the quarterback of the present.\r\nJordan Love, the Green Bay Packers' first-round pick in the NFL draft, told ESPN's Maria Taylor on Friday that … [+1581 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Dom Phillips", "title": "Brazilian government in turmoil after justice minister resigns - The Guardian", "description": "President Jair Bolsonaro denies he sought to influence federal police inquiries", "url": "https://www.theguardian.com/world/2020/apr/24/justice-ministers-sacking-plunges-brazil-into-turmoil", "urlToImage": null, "publishedAt": "2020-04-25T02:34:52Z", "content": "Brazils government has been plunged into turmoil after the resignation of one of Jair Bolsonaros most powerful ministers sparked protests, calls for the presidents impeachment and an investigation into claims he had improperly interfered in the countrys feder… [+3829 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Stephen Nellis", "title": "Showdown looms between Silicon Valley, U.S. states over contact tracing apps - Reuters", "description": "U.S. states promoting apps that could prove essential to ending the coronavirus lockdown may be headed for a showdown with the two Silicon Valley companies that control key software on 99% of smartphones over the collection of sensitive GPS location data.", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-apps-idUSKCN22702F", "urlToImage": null, "publishedAt": "2020-04-25T01:56:24Z", "content": "SAN FRANCISCO (Reuters) - U.S. states promoting apps that could prove essential to ending the coronavirus lockdown may be headed for a showdown with the two Silicon Valley companies that control key software on 99% of smartphones over the collection of sensit… [+5217 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Mike Bohn", "title": "UFC 249: Joe Rogan slated to be part of broadcast team - MMA Junkie", "description": "After all the hoopla, Joe Rogan is indeed planned to be on commentary for UFC 249.", "url": "https://mmajunkie.usatoday.com/2020/04/joe-rogan-ufc-249-commentary-team-jon-anik-daniel-cormier", "urlToImage": null, "publishedAt": "2020-04-25T01:15:22Z", "content": "After all the hoopla, Joe Rogan is indeed planned to be on commentary for UFC 249.\r\nAs the coronavirus pandemic became a bigger issue in the U.S., Rogan, the longtime UFC color commentator, expressed concern about calling fights in a time with so much uncerta… [+1376 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Matt Keeley, Tom O'Connor, Naveed Jamali", "title": "China Sends Doctors to North Korea as TV Report Fuels Speculation About Kim Jong Un's Health - Newsweek", "description": "China has sent a team of doctors to North Korea to help determine Supreme Leader of North Korea Kim Jong Un's health status, Reuters reported on Friday. Hong Kong state media reported that Kim was...", "url": "https://www.newsweek.com/china-sends-doctors-north-korea-tv-report-fuels-speculation-kim-jong-un-dead-1500181", "urlToImage": null, "publishedAt": "2020-04-25T01:14:30Z", "content": "China has sent a team of doctors to North Korea to help determine supreme leader of North Korea Kim Jong Un's health status, Reuters reported on Friday. Hong Kong Satellite Television reported that Kim was dead, though there has been no confirmation from U.S.… [+4451 chars]"}, {"source": {"id": null, "name": "Nj.com"}, "author": "Sophie Nieto-Munoz | NJ Advance Media for NJ.com, Michael Sol Warren | NJ Advance Media for NJ.com", "title": "You can pay rent with your security deposit during coronavirus pandemic, Murphy orders - NJ.com", "description": "“We are all in this together, tenants and landlords, and we can only emerge stronger when no one, and I mean no one, fears for their home or residence,” Gov. Phil Murphy said.", "url": "https://www.nj.com/politics/2020/04/you-can-pay-rent-with-your-security-deposit-during-coronavirus-pandemic-murphy-orders.html", "urlToImage": null, "publishedAt": "2020-04-25T00:29:00Z", "content": "New Jersey renters struggling to pay rent during the coronavirus pandemic can now use their security deposits for help.\r\nGov. Phil Murphy issued an executive order Friday that allows renters in the state to direct their landlords to tap into the previously pa… [+3722 chars]"}, {"source": {"id": null, "name": "Cinemablend.com"}, "author": "Laura Hurley", "title": "Blue Bloods Actor Nick Cordero's Wife Says He Should Have Woken From Coma By Now - CinemaBlend", "description": "Amanda Kloots provides an update on her husband's condition.", "url": "https://www.cinemablend.com/television/2495108/blue-bloods-actor-nick-corderos-wife-says-he-should-have-woken-from-coma-by-now", "urlToImage": null, "publishedAt": "2020-04-25T00:23:14Z", "content": "Blue Bloods actor and popular TV guest star Nick Cordero has been fighting for his life after a diagnosis with COVID-19, and his wife Amanda Kloots has been providing regular updates on his condition. Her updates have provided a window into the illness as wel… [+2833 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Sophie Lewis", "title": "Massive asteroid flying past Earth next week looks like it's wearing a face mask - CBS News", "description": "But don't worry — it will keep its distance.", "url": "https://www.cbsnews.com/news/coronavirus-asteroid-flying-past-earth-next-week-wearing-face-mask/", "urlToImage": null, "publishedAt": "2020-04-25T00:18:24Z", "content": "If you're planning to visit Earth in the year 2020, it's important to be wearing a face mask to protect yourself from the coronavirus. And apparently the rule doesn't only apply to humans — an asteroid speeding toward Earth appears to know about the pandemic … [+2203 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Morgan McFall-Johnsen, Business Insider", "title": "NASA Has Designed a Mass-Producible Ventilator For a Second Wave of COVID-19 - ScienceAlert", "description": "NASA engineers have designed a mass-producible ventilator tailored to coronavirus patients, and it could get emergency approval from the Food and Drug Administration by the weekend.", "url": "https://www.businessinsider.com/nasa-designs-cheap-simple-coronavirus-ventilator-mass-production-2020-4?utm_source=feedburner&amp%3Butm_medium=referral&utm_medium=feed&utm_campaign=Feed%3A+businessinsider+%28Business+Insider%29&r=US&IR=T", "urlToImage": null, "publishedAt": "2020-04-24T23:52:28Z", "content": "NASA engineers have designed a mass-producible ventilator tailored to coronavirus patients, and it could get emergency approval from the Food and Drug Administration by the weekend.\r\nA team of engineers at the Jet Propulsion Laboratory in Pasadena, California… [+4024 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Next round of small-business loans under controversial coronavirus-aid program starts Monday - Seattle Times", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMigwFodHRwczovL3d3dy5zZWF0dGxldGltZXMuY29tL2J1c2luZXNzL25leHQtcm91bmQtb2Ytc21hbGwtYnVzaW5lc3MtbG9hbnMtdW5kZXItY29udHJvdmVyc2lhbC1jb3JvbmF2aXJ1cy1haWQtcHJvZ3JhbS1zdGFydHMtbW9uZGF5L9IBiQFodHRwczovL3d3dy5zZWF0dGxldGltZXMuY29tL2J1c2luZXNzL25leHQtcm91bmQtb2Ytc21hbGwtYnVzaW5lc3MtbG9hbnMtdW5kZXItY29udHJvdmVyc2lhbC1jb3JvbmF2aXJ1cy1haWQtcHJvZ3JhbS1zdGFydHMtbW9uZGF5Lz9hbXA9MQ?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T23:44:00Z", "content": null}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Laurie McGinley, Christopher Rowland, Yasmeen Abutaleb, Carolyn Y. Johnson", "title": "FDA warns about hydroxychloroquine dangers, citing serious heart issues, including death - The Washington Post", "description": "The FDA warned Friday that people should not take chloroquine and hydroxychloroquine for covid-19 outside of a hospital or clinical trial, citing reports of « serious heart rhythm problems. »", "url": "https://www.washingtonpost.com/health/2020/04/24/fda-warns-about-hydroxychloroquine-dangers-citing-serious-heart-issues-including-death/", "urlToImage": null, "publishedAt": "2020-04-24T23:01:35Z", "content": "An increasing number of studies and reports have raised safety issues, making the drugs an example of how the presidents embrace of unproven medical ideas has potentially endangered Americans lives and put health agencies in a tough spot.\r\nOn Thursday, after … [+9358 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Julia Alexander", "title": "Sony delays Spider-Man films, forcing Marvel to move Doctor Strange and Thor sequels again - The Verge", "description": "Spider-Man: Into the Spider-Verse and the third movie in the Spider-Man: Homecoming trilogy are getting delayed as Sony messes with its release schedule. As a result, Doctor Strange into the Multiverse and Thor: Love and Thunder have been delayed for a second…", "url": "https://www.theverge.com/2020/4/24/21235283/spider-man-spiderverse-homecoming-delay-release-date-trilogy-marvel-venom-doctor-strange-thor", "urlToImage": null, "publishedAt": "2020-04-24T22:45:42Z", "content": "But Uncharted gets an early release date\r\nPhoto: Sony Pictures Entertainment\r\nLike almost every other studio, Sony is moving around its film schedule because of the novel coronavirus. That means its two biggest Spider-Man movies will be delayed. \r\nThe sequel … [+1662 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Sam Dorman", "title": "House Republican dubs Mitch McConnell the 'Marie Antoinette of the Senate' - Fox News", "description": "Rep. Peter King, R-N.Y., had some harsh words for Senate Majority Leader Mitch McConnell, R-Ky., after the latter suggested that state governments should be able to declare bankruptcy during the coronavirus pandemic.", "url": "https://www.foxnews.com/media/peter-king-mcconnell-marie-antoinette", "urlToImage": null, "publishedAt": "2020-04-24T22:25:33Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nRep. Peter King, R-N.Y., had some harsh words for Senate Majority Leader Mitch McConnell, R-Ky., after the latter suggested that state governments should be able to … [+2010 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Helene Cooper, Eric Schmitt, Thomas Gibbons-Neff", "title": "Navy Leaders Recommend Reinstating Roosevelt Captain Fired Over Virus Warning - The New York Times", "description": "Capt. Brett E. Crozier, who was removed from command after sending a letter pleading for help to fight the coronavirus on his aircraft carrier, was largely cleared after Navy review.", "url": "https://www.nytimes.com/2020/04/24/us/politics/coronavirus-navy-roosevelt-brett-crozier.html", "urlToImage": null, "publishedAt": "2020-04-24T22:24:55Z", "content": "WASHINGTON Capt. Brett E. Crozier should be restored to command of the aircraft carrier Theodore Roosevelt, the Navys top officials recommended on Friday.\r\nBut Defense Secretary Mark T. Esper, who was briefed on the recommendations, has asked for more time to… [+6185 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Gabrielle Fonrouge", "title": "Today's coronavirus update: Gym, barbers reopen in Georgia; Michigan acquiesces - New York Post ", "description": "Georgia became the first state in the US to reopen some nonessential businesses — despite a sharp rebuke from President Trump, who said he “wasn’t happy” with the decision.  Gov. Br…", "url": "https://nypost.com/2020/04/24/todays-coronavirus-update-georgia-reopens-michigan-acquiesces/", "urlToImage": null, "publishedAt": "2020-04-24T21:50:44Z", "content": "Georgia became the first state in the US to reopen some nonessential businesses — despite a sharp rebuke from President Trump, who said he wasnt happy with the decision. \r\nGov. Brian Kemp forged ahead with the plan anyway and opened the doors of gyms, barbers… [+1231 chars]"}, {"source": {"id": null, "name": "Tmonews.com"}, "author": "Alex Wagner", "title": "iPhone SE launches today, Costco rolls out deal for T-Mobile customers - TmoNews", "description": "A little over a week after Apple surprised us with an updated iPhone SE, the new device has officially launche", "url": "https://www.tmonews.com/2020/04/iphone-se-launch-today-costco-deal-t-mobile-customers/", "urlToImage": null, "publishedAt": "2020-04-24T21:33:27Z", "content": "A little over a week after Apple surprised us with an updated iPhone SE, the new device has officially launched.\r\nThe iPhone SE is in stock and ready to ship at T-Mobile. The 64GB and 256GB have estimated ship dates of April 24-27, but you may have to wait a … [+1585 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Alex Woodward", "title": "Coronavirus: US will not participate in WHO vaccine project after Trump turned against it - The Independent", "description": "Despite snub, coalition of world leaders will support US during crisis: 'There should be no division in order to win this battle'", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-vaccine-who-project-trump-us-covid-19-a9483421.html", "urlToImage": null, "publishedAt": "2020-04-24T21:00:25Z", "content": "The US will not participate in a global effort with the World Health Organisation to develop drugs and a vaccine to combat the coronavirus.\r\nA spokesman for the US mission told Reuters that \"there will be no US official participation\" in the programme, which … [+2599 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Christopher Carbone", "title": "Hubble nabs stunning 'Cosmic Reef' image to mark 30th anniversary - Fox News", "description": "A gorgeous \"Cosmic Reef\" image released for the Hubble Space Telescope's 30th anniversary shows off some of the instrument's amazing capabilities.", "url": "https://www.foxnews.com/science/hubble-stunning-cosmic-reef-image-30th-anniversary", "urlToImage": null, "publishedAt": "2020-04-24T20:59:55Z", "content": "A gorgeous \"Cosmic Reef\" image released for the Hubble Space Telescope's 30th anniversary shows off some of the instrument's amazing capabilities.\r\nThree decades ago, Hubble launched into space on a mission to open humanity's eyes to the wonders of the cosmos… [+1326 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Mindy Weisberger", "title": "Black hole bends escaping light 'like a boomerang' - Livescience.com", "description": "Even light can't resist the pull of these irresistible cosmic objects.", "url": "https://www.livescience.com/black-hold-bends-light-like-boomerang.html", "urlToImage": null, "publishedAt": "2020-04-24T20:39:00Z", "content": "Light escaping from a black hole may \"boomerang\" its way to freedom, new X-ray images reveal.\r\nResearchers found this odd behavior while reviewing archival X-ray\r\n observations of a black hole that's approximately 10 times as massive as our sun. Located about… [+3950 chars]"}, {"source": {"id": null, "name": "Snopes.com"}, "author": "Associated Press", "title": "Canada Mass Shooting Started with Assault on Girlfriend - Snopes.com", "description": "The weekend shooting rampage started with an assault by the suspect on his girlfriend and ended with 22 people dead in communities across central and northern Nova Scotia.", "url": "https://www.snopes.com/ap/2020/04/24/canada-mass-shooting-started-with-assault-on-girlfriend/", "urlToImage": null, "publishedAt": "2020-04-24T19:23:29Z", "content": "TORONTO (AP) Canadas worst mass shooting erupted from an argument between the gunman and his girlfriend, who survived the attack, police have confirmed.\r\nRoyal Canadian Mounted Police Supt. Darren Campbell said the weekend shooting rampage started with an ass… [+5247 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Angel Au-Yeung", "title": "Amnesty International Calls On Jeff Bezos To Address Amazon Employees’ Concerns About Working Conditions - Forbes", "description": "The demand from the international NGO coincides with a virtual protest planned by Amazon tech and warehouse workers.", "url": "https://www.forbes.com/sites/angelauyeung/2020/04/24/amnesty-international-calls-on-jeff-bezos-to-address-amazon-employees-concerns-about-working-conditions/", "urlToImage": null, "publishedAt": "2020-04-24T19:22:00Z", "content": "Jeff Bezos.\r\n© 2016 Bloomberg Finance LP\r\nOn Friday morning, hundreds of employees from Amazons corporate offices and warehouses called in sick to protest the e-commerce behemoths handling of working conditions amid the coronavirus pandemic. Human rights grou… [+4426 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Meghan Markle Case Against British Tabloid Set To Begin In London | TODAY - TODAY", "description": "Friday marks the first court hearing in a privacy case brought by Meghan Markle against the Daily Mail, a British tabloid, for publishing part of a letter sh...", "url": "https://www.youtube.com/watch?v=Cjuyow4ftc8", "urlToImage": null, "publishedAt": "2020-04-24T19:00:03Z", "content": "Friday marks the first court hearing in a privacy case brought by Meghan Markle against the Daily Mail, a British tabloid, for publishing part of a letter she wrote to her father. NBC's Kelly Cobiella reports for TODAY from London.» Subscribe to TODAY: http:/… [+845 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": null, "title": "Facebook launches ‘Messenger Rooms’ as a Zoom and Group FaceTime alternative - 9to5Mac", "description": "Facebook is out today with a new product to connect multiple people via video chat and compete with popular offerings like Zoom, Group FaceTime, Skype, Houseparty, and more. Detailed by TechCrunch, Facebook announced a number of messaging updates today with t…", "url": "https://9to5mac.com/2020/04/24/facebook-launches-messenger-rooms-as-a-zoom-and-group-facetime-alternative/", "urlToImage": null, "publishedAt": "2020-04-24T18:47:18Z", "content": "Facebook is out today with a new product to connect multiple people via video chat and compete with popular offerings like Zoom, Group FaceTime, Skype, Houseparty, and more.\r\nDetailed by TechCrunch, Facebook announced a number of messaging updates today with … [+3683 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Ebony Bowden", "title": "Michigan governor Gretchen Whitmer eases stay-at-home order after protests - New York Post ", "description": "Michigan Gov. Gretchen Whitmer announced she would begin reopening parts of the state’s economy on Friday — the decision coming amid armed protests outside her home and the threat of a …", "url": "https://nypost.com/2020/04/24/michigan-governor-gretchen-whitmer-eases-stay-at-home-order-after-protests/", "urlToImage": null, "publishedAt": "2020-04-24T18:30:52Z", "content": "Michigan Gov. Gretchen Whitmer announced she would begin reopening parts of the state’s economy on Friday — the decision coming amid armed protests outside her home and the threat of a mutiny by state lawmakers.\r\nWhitmer signed a new executive order extending… [+1459 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Jane C. Timm", "title": "Trump says he was being sarcastic with comments about injecting disinfectants - NBC News", "description": "President Donald Trump claimed that his remarks on injecting disinfectants to treat COVID-19 was sarcasm, after doctors responded with horror at his comments.", "url": "https://www.nbcnews.com/politics/donald-trump/trump-says-he-was-being-sarcastic-comments-about-injecting-disinfectants-n1191991", "urlToImage": null, "publishedAt": "2020-04-24T18:07:25Z", "content": "President Donald Trump said Friday that his remarks on injecting disinfectants to treat COVID-19 were sarcasm, after doctors responded with horror and disinfectant manufacturers urged people not to ingest the poisonous substances.\r\n\"I was asking a question sa… [+2111 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Fatima-Tul Farha", "title": "Coronavirus has changed the way Muslims are celebrating Ramadan, in virtual spaces and in solitude - USA TODAY", "description": "Hajjar Ahmed sees Ramadan as an opportunity this year \"to celebrate in real time virtually with Muslims all over the world.\"", "url": "https://www.usatoday.com/story/news/2020/04/24/coronavirus-muslims-celebrate-ramadan-differently-during-pandemic/5167361002/", "urlToImage": null, "publishedAt": "2020-04-24T17:51:24Z", "content": "Take a look at what the Great Mosque of Mecca before and after the coronavirus outbreak during Ramadan.\r\nUSA TODAY\r\nHajjar Ahmed's lofty goals this Ramadan include reading the Qur'an multiple times, joining virtual Iftar meals to break the fast, and engaging … [+9394 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Allison Pecorin, Cho Park, Matthew Mosk, Halley Freger", "title": "Coronavirus crosses grim milestone of 10,000 deaths in US nursing homes - The-Latest News", "description": "", "url": "https://abcnews.go.com/Health/coronavirus-crosses-grim-milestone-10000-deaths-us-nursing/story?id=70321822", "urlToImage": null, "publishedAt": "2020-04-24T16:47:09Z", "content": "The number of nursing home residents who have succumbed to the novel coronavirus in the United States has surpassed 10,000, a new survey of state data compiled by ABC News has found.\r\nThis surge in deaths, accounting for about 20% of all coronavirus fatalitie… [+6050 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eli Blumenthal", "title": "New iOS text-bomb bug can crash your iPhone, but fix is said to be close - CNET", "description": "Be careful: A new, annoying iOS text-bomb bug is out there crashing devices.", "url": "https://www.cnet.com/news/new-ios-text-bomb-bug-can-crash-your-iphone-but-fix-is-said-to-be-close/", "urlToImage": null, "publishedAt": "2020-04-24T14:46:32Z", "content": "A new texting bug is crashing iPhones. \r\nAngela Lang/CNET\r\nStrings of texts that cause iPhones and iOS devices to crash isn't a new problem, but a new one has appeared in 2020. After several bugs annoyed iOS users in the last decade, a new string of text usin… [+1425 chars]"}, {"source": {"id": null, "name": "Meredithlmg.com"}, "author": "Maggie Fox, CNN", "title": "Covid-19 causes sudden strokes in young adults, doctors say - KMOV.com", "description": "The new coronavirus appears to be causing sudden strokes in adults in their 30s and 40s who are not otherwise terribly ill, doctors reported Wednesday.", "url": "https://www.news.meredithlmg.com/covid-19-causes-sudden-strokes-in-young-adults-doctors-say/article_ecef8006-862f-11ea-9389-2b1d6b612f29.html", "urlToImage": null, "publishedAt": "2020-04-24T13:31:00Z", "content": "(CNN) -- The new coronavirus appears to be causing sudden strokes in adults in their 30s and 40s who are not otherwise terribly ill, doctors reported Wednesday.\r\nThey said patients may be unwilling to call 911 because they have heard hospitals are overwhelmed… [+2624 chars]"}, {"source": {"id": null, "name": "Benzinga.com"}, "author": "Business Wire", "title": "Pre & Post COVID-19 Market Estimates-Global Neuromodulation Market 2020-2024 | Evolving Opportunities with Abbott Laboratories and Boston Scientific Corp. | Technavio - Benzinga", "description": "The neuromodulation market is poised to grow by USD 5.2 billion during 2020-2024, progressing at a CAGR of over 11% during the forecast period. Request free ...", "url": "https://www.benzinga.com/pressreleases/20/04/b15874122/pre-post-covid-19-market-estimates-global-neuromodulation-market-2020-2024-evolving-opportunities-", "urlToImage": null, "publishedAt": "2020-04-24T13:15:00Z", "content": "The neuromodulation market is poised to grow by USD 5.2 billion during 2020-2024, progressing at a CAGR of over 11% during the forecast period. Request free sample pages\r\nThis press release features multimedia. View the full release here: https://www.business… [+5094 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Adam Forrest", "title": "Coronavirus: Eyes could be contagious for weeks, study finds - The Independent", "description": "Eye fluid could may be ‘not only a site of virus entry but also a source of contagion,’ Italian study concludes", "url": "https://www.independent.co.uk/news/health/coronavirus-eyes-contagious-infection-conjunctivitis-italy-wuhan-a9482186.html", "urlToImage": null, "publishedAt": "2020-04-24T12:45:34Z", "content": "The coronavirus can linger in patients eyes for several weeks and could act as a way of spreading the Covid-19 disease, according new study from Italy.\r\nScientists at Italys National Institute for Infectious Diseases hospital in Rome studied the symptoms of a… [+1675 chars]"}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "The Wall Street Journal", "title": "Grocers hunt meat as coronavirus hobbles beef and pork plants - Fox Business", "description": "Grocery executives at retailers including Walmart Inc. and Costco Wholesale Corp. worry supplies of some products could run short just as demand is surging.", "url": "https://www.foxbusiness.com/markets/grocers-hunt-meat-as-coronavirus-hobbles-beef-and-pork-plants", "urlToImage": null, "publishedAt": "2020-04-24T09:59:36Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nU.S. grocers are struggling to secure meat, looking for new suppliers and selling different cuts, as the coronavirus pandemic cuts into domestic production and raise… [+5296 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Yasemin Saplakoglu", "title": "Nearly 9 in 10 COVID-19 patients who are put on a ventilator die, New York hospital data suggests - Livescience.com", "description": "That doesn't mean the ventilators caused harm, though.", "url": "https://www.livescience.com/coronavirus-ventilator-deaths-new-york.html", "urlToImage": null, "publishedAt": "2020-04-23T23:44:00Z", "content": "Around 88% of patients with COVID-19 who were put on a ventilator in a New York hospital system died, according to a new study.\r\nIn the new study, researchers analyzed data from 5,700 patients who were hospitalized from March 1 to April 4 through Northwell He… [+1552 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Yaron Steinbuch", "title": "Healthy 57-year-old woman was first confirmed coronavirus death in US - New York Post ", "description": "A seemingly healthy 57-year-old San Jose woman has emerged as the first person in the US to have died of the coronavirus — with her Feb. 6 death coming almost three weeks before two fatalities were…", "url": "https://nypost.com/2020/04/23/san-jose-woman-57-was-first-confirmed-coronavirus-death-in-us/", "urlToImage": null, "publishedAt": "2020-04-23T13:44:24Z", "content": "A seemingly healthy 57-year-old San Jose woman has emerged as the first person in the US to have died of the coronavirus with her Feb. 6 death coming almost three weeks before two fatalities were reported, according to a report.\r\nPatricia Dowd, a manager for … [+2154 chars]"}]}