{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Nytimes.com"}, "author": "Marlise Simons", "title": "France Arrests Rwandan Millionaire Accused of Financing 1994 Genocide - The New York Times", "description": "Félicien Kabuga, 84, had been on the run for 23 years, since he was indicted by the International Criminal Tribunal for Rwanda on multiple charges of genocide.", "url": "https://www.nytimes.com/2020/05/16/world/europe/france-rwanda-genocide-kabuga.html", "urlToImage": "https://static01.nyt.com/images/2020/05/17/world/17rwanda/16rwanda01-facebookJumbo.jpg", "publishedAt": "2020-05-16T16:12:07Z", "content": "PARIS One of the most-wanted fugitives of the 1994 Rwanda genocide, accused of financing the slaughter of as many as one million people, mostly Tutsis, was arrested in a Paris suburb early on Saturday, the French police said, ending a decades-long internation… [+5464 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Minyvonne Burke", "title": "NYC tourist arrested in Hawaii for violating quarantine; Instagram pics showed him at beach - NBC News", "description": "A New York tourist visiting Hawaii violated the state's 14-day quarantine to go site-seeing and then shared photos of himself at the beach on Instagram, the governor's office said.", "url": "https://www.nbcnews.com/news/us-news/nyc-tourist-arrested-hawaii-violating-quarantine-instagram-pics-showed-him-n1208601", "urlToImage": "https://media4.s-nbcnews.com/j/newscms/2019_01/2705191/nbc-social-default_b6fa4fef0d31ca7e8bc7ff6d117ca9f4.nbcnews-fp-1200-630.png", "publishedAt": "2020-05-16T15:47:14Z", "content": "A New York City tourist in Hawaii was arrested for violating the state's quarantine rule after he shared photos of himself on Instagram at the beach, authorities said.\r\nTarique Peters, 23, was arrested after local residents saw the pictures and alerted Hawaii… [+1502 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Holmes and Nick Valencia, CNN", "title": "Tensions rise between the White House and CDC as Birx critiques virus tracking - CNN", "description": "As the coronavirus pandemic stretches past its ninth week, tensions are rising between the White House and the nation's leading public health agency. In interviews with CNN, senior administration officials in Washington, as well as top officials at the Center…", "url": "https://www.cnn.com/2020/05/16/politics/white-house-cdc-tension-birx-coronavirus-tracking/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200507201013-03-cnn-town-hall-0407-birx-super-tease.jpg", "publishedAt": "2020-05-16T15:42:56Z", "content": "Washington (CNN)As the coronavirus pandemic stretches past its ninth week, tensions are rising between the White House and the nation's leading public health agency. In interviews with CNN, senior administration officials in Washington, as well as top officia… [+5709 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Emily Price", "title": "Nintendo Switch Users Should Get This Soothing Free Animal Crossing Tetris Theme This Weekend - Lifehacker", "description": "By in large my  Switch has been used to play exactly three things over the past few months: Mario Kart, Tetris, and Animal Crossing. This weekend, those last two are combining together in an Animal Crossing Maximus Cup within Tetris 99. If you “win” the compe…", "url": "https://lifehacker.com/nintendo-switch-users-should-get-this-soothing-free-ani-1843486378", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/upucp6oulfwotxgdzv6f.jpg", "publishedAt": "2020-05-16T15:24:57Z", "content": "By in large my Switch has been used to play exactly three things over the past few months: Mario Kart, Tetris, and Animal Crossing. This weekend, those last two are combining together in an Animal Crossing Maximus Cup within Tetris 99. If you win the competit… [+2795 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Jon Levine", "title": "Italy to ease coronavirus travel restrictions after months of lockdown - New York Post ", "description": "Italy has set a date to lift its COVID-19 travel restrictions as the country takes its first tentative steps to ease more than two months of lockdown. Starting June 3, Italy will again permit trave…", "url": "https://nypost.com/2020/05/16/italy-to-ease-coronavirus-travel-restrictions/", "urlToImage": "https://thenypost.files.wordpress.com/2020/05/200516-italy-coronavirus-travel.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-05-16T14:58:04Z", "content": "Italy has set a date to lift its COVID-19 travel restrictions as the country takes its first tentative steps to ease more than two months of lockdown.\r\nStarting June 3, Italy will again permit travel in and out of the country, as well as between regions, the … [+482 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Artemis Moshtaghian and Jay Croft, CNN", "title": "Weather postpones Atlas V rocket launch - CNN", "description": "Saturday's planned liftoff of an Atlas V rocket from Cape Canaveral has been delayed a day because of weather, according to Paul Aragon of United Launch Alliance.", "url": "https://www.cnn.com/2020/05/16/us/atlas-v-rocket-launch-cape-canaveral/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200516090702-01-atlas-v-0515-super-tease.jpg", "publishedAt": "2020-05-16T14:55:01Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Terina Allen", "title": "The Bill Passed For Second Stimulus Check And Hazard Pay For Essential Workers - Forbes", "description": "The House successfully passed a fourth stimulus relief package yesterday. The $3 trillion Heroes Act contains a second round of $1,200 stimulus checks, $200 billion in hazard pay for essential workers, six more months of COVID-19 unemployment, funding for sta…", "url": "https://www.forbes.com/sites/terinaallen/2020/05/16/the-bill-passed-for-second-stimulus-check-and-hazard-pay-for-essential-workers/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5ebfede3f4d58d00076e6afc%2F0x0.jpg", "publishedAt": "2020-05-16T14:50:09Z", "content": "WASHINGTON, DC - MAY 12: WASHINGTON, DC - MAY 12: House Speaker Nancy Pelosi, D-CA, arrives at a ... [+] news conference to deliver a statement on the Heroes Act aid package introduced by House democrats, May 12, 2020 on Capitol Hill, in Washington D.C. The l… [+10588 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Cameron Wolfe", "title": "Giants' DeAndre Baker turns himself in to police on armed robbery charges - ESPN", "description": "Giants CB DeAndre Baker has turned himself in to police on charges of armed robbery with a firearm and aggravated assault with a firearm, his lawyer said. Seahawks CB Quinton Dunbar hasn't yet turned himself in for armed robbery charges.", "url": "https://www.espn.com/nfl/story/_/id/29182475/giants-deandre-baker-turns-police-armed-robbery-charges", "urlToImage": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F1121%2Fr631165_1296x729_16%2D9.jpg", "publishedAt": "2020-05-16T14:46:57Z", "content": "New York Giants cornerback DeAndre Baker has turned himself in to the Broward County Jail on Saturday for four counts of armed robbery with a firearm and four counts of aggravated assault with a firearm, according to his lawyer, Bradford Cohen.\r\nCohen confirm… [+2488 chars]"}, {"source": {"id": null, "name": "Aol.com"}, "author": "Joe Peters", "title": "The moon's mysterious disappearance 900 years ago finally gets an explanation - AOL", "description": "\"On the fifth night in the month of May appeared the moon shining bright in the evening, and afterwards by little and little its light diminished.\"", "url": "https://www.aol.com/article/news/2020/05/16/moons-mysterious-disappearance-900-years-ago-finally-gets-an-explanation/24324609/", "urlToImage": "https://o.aolcdn.com/images/dims3/GLOB/crop/3382x2217+0+13/resize/1028x675!/format/jpg/quality/85/https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2020-05%2F23e208a0-9782-11ea-9978-c8a0ef8375e5", "publishedAt": "2020-05-16T14:34:23Z", "content": "There's no use sugar coating it: According to one scribe in medieval England, A.D. 1110 was a \"disastrous year.\" Torrential rainfall damaged crops, famine stalked the land and, as if that wasn't bad enough, on one fateful night in May, the moon simply vanishe… [+4499 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Scott Snowden", "title": "Captain Pike of 'Star Trek' gets spin-off series with Spock and Number One - Space.com", "description": "Anson Mount, Ethan Peck and Rebecca Romijn reprise their roles.", "url": "https://www.space.com/star-trek-captain-pike-spock-spinoff-series.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/RBrBtyyXAkiM45yGgkB3AM-1200-80.jpg", "publishedAt": "2020-05-16T14:14:00Z", "content": "It's official! After months of speculation and wishful thinking  CBS All Access has confirmed that Captain Pike is coming back, with Spock and Number One along for the ride, in the new spin-off series \"Star Trek: Strange New Worlds.\"\r\nPike (portrayed by Anson… [+3548 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Mike Florio", "title": "The key question and answer from Aaron Rodgers’ conference call - NBCSports.com", "description": "Packers quarterback Aaron Rodgers conducted a conference call on Friday with Wisconsin media. And some have taken issue with our characterization of Rodgers’ comments regarding the possibility of finishing his career elsewhere. Here’s the full content of the …", "url": "https://profootballtalk.nbcsports.com/2020/05/16/the-key-question-and-answer-from-aaron-rodgers-conference-call/", "urlToImage": "https://profootballtalk.nbcsports.com/wp-content/uploads/sites/25/2020/05/GettyImages-1200620709-e1589638368191.jpg", "publishedAt": "2020-05-16T14:13:00Z", "content": "Packers quarterback Aaron Rodgers conducted a conference call on Friday with Wisconsin media. And some have taken issue with our characterization of Rodgers’ comments regarding the possibility of finishing his career elsewhere.\r\nHere’s the full content of the… [+3120 chars]"}, {"source": {"id": null, "name": "Mmafighting.com"}, "author": "Jed Meshew", "title": "Hot Tweets: Who is to blame for the Glover Teixeira vs. Anthony Smith stoppage? - MMA Fighting", "description": "Fighting has returned to our fair televisions, and with it, questions about the state of MMA. This week we discuss corners stopping fights, Jon Jones’ continued flirtations with the heavyweight...", "url": "https://www.mmafighting.com/2020/5/16/21260744/hot-tweets-who-is-to-blame-for-the-glover-teixeira-vs-anthony-smith-stoppage", "urlToImage": "https://cdn.vox-cdn.com/thumbor/grXnmkoQk2lXj8ruiN1WZW_FzrU=/0x0:5568x2915/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19981688/usa_today_14306644.jpg", "publishedAt": "2020-05-16T14:00:00Z", "content": "Fighting has returned to our fair televisions, and with it, questions about the state of MMA. This week we discuss corners stopping fights, Jon Jones continued flirtations with the heavyweight division, and Tony Fergusons unfortunate fall from grace.\r\nIs it a… [+11911 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jay Peters", "title": "Facebook’s Giphy acquisition might have big implications for iMessage and Twitter - The Verge", "description": "Now that Facebook is buying Giphy, how you send and receive GIFs on the internet could change forever. Some of the most popular apps and services rely on Giphy’s API and archives to let users share and post GIFs, and we’ve collected all of the services that w…", "url": "https://www.theverge.com/2020/5/16/21260104/facebook-giphy-acquisition-twitter-slack-snapchat-apple-imessage-signal-facebook-tinder", "urlToImage": "https://cdn.vox-cdn.com/thumbor/SRqxnTQS16um3q2NE7mgF0wlqkg=/0x68:977x580/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19980728/Screen_Shot_2020_05_15_at_10.54.23_AM.png", "publishedAt": "2020-05-16T13:46:39Z", "content": "Giphy is integrated into some of the internets most popular apps and services\r\nFacebook is buying Giphy, and that means how you send and receive GIFs on the internet could change forever. The service claims that more than 700 million people see Giphy content … [+6734 chars]"}, {"source": {"id": null, "name": "Footwearnews.com"}, "author": "Claudia Miller", "title": "J-Lo Works Out in Head-to-Toe Camo, Matching a Sports Bra and Leggings to Chunky Sneakers - Footwear News", "description": "She can't get enough of these sneakers.", "url": "https://footwearnews.com/2020/fashion/celebrity-style/jennifer-lopez-camo-sports-bra-leggings-chunky-sneakers-1202989213/", "urlToImage": "https://pmcfootwearnews.files.wordpress.com/2020/02/j-lo-01-1.jpg", "publishedAt": "2020-05-16T13:44:47Z", "content": "Jennifer Lopez is back again in her favorite workout gear.\r\nThe “On the Floor” singer posed for a quick mirror selfie last night mid gym session, showing off her go-to sweat-ready combination on Instagram. The matching camouflage set from Niyama Sol includes … [+2295 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Ralph R. Ortega For Dailymail.com", "title": "Colorado health officials under fire for saying drunk man died of coronavirus - Daily Mail", "description": "Montezuma County Coroner George Deaver has challenged Colorado state health officials who said Sebastian Yellow, 35, died from his COVID-19 infection when his BAC was 0.55 per cent.", "url": "https://www.dailymail.co.uk/news/article-8324017/Colorado-health-officials-fire-saying-drunk-man-died-coronavirus.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/15/18/28443606-0-image-a-17_1589565206891.jpg", "publishedAt": "2020-05-16T13:37:19Z", "content": "Colorado state health officials are being challenged by a county coroner for saying that a man who tested positive for the coronavirus succumbed to the deadly infection when an investigation showed he had literally drunk himself to death.\r\nMontezuma County Co… [+3540 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "'Trading Spaces' Designer Frank Bielec, Dead at 72 - TMZ", "description": "Frank Bielec, one of the stars of \"Trading Spaces\" has died ... TMZ has learned.", "url": "https://www.tmz.com/2020/05/16/trading-spaces-designer-frank-bielec-dead-died-72/", "urlToImage": "https://imagez.tmz.com/image/21/16by9/2020/05/16/217ec85a135f47e6b9aa2ca182d20794_xl.jpg", "publishedAt": "2020-05-16T13:36:00Z", "content": "Frank Bielec, one of the stars of \"Trading Spaces\" has died ... TMZ has learned.\r\nFrank's wife, Judy, tells TMZ, Frank passed away Friday ... a day after suffering a heart attack. He was taken to a hospital in Katy, Texas, and then transferred to a Houston ho… [+1813 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Greg Robb", "title": "Fed says pandemic has created U.S. financial sector fragility that will last for some time - MarketWatch", "description": "Financial institutions, including banks, could experience strains", "url": "https://www.marketwatch.com/story/fed-says-pandemic-has-created-us-financial-sector-fragility-that-will-last-for-some-time-2020-05-15", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-ID155_ATM_cu_ZG_20200326131010.jpg", "publishedAt": "2020-05-16T13:27:31Z", "content": "The coronavirus pandemic has created a fragile U.S. financial system that could last some time, the Federal Reserve said Friday.The strains on households and business balance sheets from the economic and financial shocks since March will likely create fragili… [+2361 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Don Babwin", "title": "Coronavirus masks a boon for crooks who hide their faces - The Associated Press", "description": "CHICAGO (AP) — The way the FBI tells it, William Rosario Lopez put on a surgical mask and walked into the Connecticut convenience store looking to the world like a typical pandemic-era shopper as...", "url": "https://apnews.com/f97b4914b4159dec0c98359fac123d52", "urlToImage": "https://storage.googleapis.com/afs-prod/media/7246d1beb2d04363acb201978a2a102d/1376.jpeg", "publishedAt": "2020-05-16T13:19:42Z", "content": "CHICAGO (AP) The way the FBI tells it, William Rosario Lopez put on a surgical mask and walked into the Connecticut convenience store looking to the world like a typical pandemic-era shopper as he picked up plastic wrap, fruit snacks and a few other items. Th… [+5432 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "Maurie Backman", "title": "Unemployment Is Hitting Older Workers Hard. Here's What to Do About It - The Motley Fool", "description": "The jobless rate among older workers shot up in April. If you've lost your job but aren't ready to retire, here are some options.", "url": "https://www.fool.com/retirement/2020/05/16/unemployment-is-hitting-older-workers-hard-heres-w.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/574683/older-man-sitting-on-couch-pinching-his-nose_gettyimages-1157747722.jpg", "publishedAt": "2020-05-16T13:00:53Z", "content": "Read the news, and you'll see staggering numbers on the jobless front. The unemployment rate reached an all-time high of 14.7% in April, and while employees of all ages have been impacted by the COVID-19 crisis, older workers have been hurt to an alarming deg… [+5400 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Kitty Empire", "title": "Charli XCX: How I'm Feeling Now review – truly a work of its time - The Guardian", "description": "The ‘workaholic party animal’ has, under the glare of social media, put together a quarantine record to beat them all", "url": "https://www.theguardian.com/music/2020/may/16/charli-xcx-how-im-feeling-now-review-show-and-tell-turned-up-to-11", "urlToImage": "https://i.guim.co.uk/img/media/0ce2a04eb9a82b8d3fc96eb26f9b7653bc7e4285/0_515_1125_675/master/1125.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctcmV2aWV3LTQucG5n&enable=upscale&s=13dc5b7651eafa06b377752d247b5cf5", "publishedAt": "2020-05-16T13:00:50Z", "content": "A level of mystique has long surrounded how musicians bottle their magic. In 2015, PJ Harvey a fiercely private British artist exposed the recording of her Hope Six Demolition Project to public view at Londons Somerset House, workshopping the songs behind one… [+5242 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "JC Penney: US department store files for bankruptcy - BBC News", "description": "The 118-year-old company has warned stores will close as a result of the filing.", "url": "https://www.bbc.co.uk/news/world-us-canada-52691160", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/0989/production/_112314420_e1ad4c38-0ea6-4be7-aa12-51e63ab33196.jpg", "publishedAt": "2020-05-16T12:40:44Z", "content": "Image copyrightReutersImage caption\r\n The company filed for chapter 11 bankruptcy on Friday\r\nAmerican department store JC Penney has filed for bankruptcy becoming the latest company to be hit by Covid-19.\r\nThe 118-year-old store sells clothing, cosmetics and … [+2255 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Hannah Knowles", "title": "State Department inspector general fired; Democrats decry ‘dangerous pattern of retaliation’ - The Washington Post", "description": "Rep. Eliot L. Engel, chairman of House Foreign Affairs Committee, alleged the State Inspector General was fired after opening an investigation into Secretary of State Mike Pompeo and said the timing suggested “an unlawful act of retaliation.”", "url": "https://www.washingtonpost.com/politics/2020/05/16/state-department-inspector-general-fired-democrats-decry-dangerous-pattern-retaliation/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ROLUJ6EXEEI6VB5DELJSII2WGY.jpg&w=1440", "publishedAt": "2020-05-16T12:39:52Z", "content": "Rep. Eliot L. Engel (D.-N.Y.), chairman of the House Foreign Affairs Committee, claimed the State Inspector General was fired after opening an investigation into Secretary of State Mike Pompeo and said the timing suggested an unlawful act of retaliation. The … [+3049 chars]"}, {"source": {"id": null, "name": "Lehighvalleylive.com"}, "author": "Connor Lagore | For lehighvalleylive.com", "title": "Lehigh Valley’s only children’s hospital treats 3 with rare syndrome linked to COVID-19 - lehighvalleylive.com", "description": "Pediatric multisystem inflammatory syndrome has shown a connection to the coronavirus outbreak. The children with PMIS have been treated at Reilly and are recovering.", "url": "https://www.lehighvalleylive.com/coronavirus/2020/05/lehigh-valleys-only-childrens-hospital-treats-3-with-rare-syndrome-linked-to-covid-19.html", "urlToImage": "https://www.lehighvalleylive.com/resizer/lrpRliNPtfUUXIF6wToejJOdXac=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/MEBKN6H4FNEZ7NQHTQOBF7NXBI.JPG", "publishedAt": "2020-05-16T12:17:04Z", "content": "Less than a week ago, an ailment the New York Times called baffling took the lives of three children. More cases of the syndrome, which doctors believe is related to the COVID-19 pandemic, have been popping up in children around the United States and in Europ… [+1917 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "Michael McGrady", "title": "Moderna and Novavax are Making Strides in Advancing Novel Coronavirus Vaccine Research - Motley Fool", "description": "The biotechnology companies creating COVID-19 vaccines should give hope to patients and investors. Moderna and Novavax are no exception.", "url": "https://www.fool.com/investing/2020/05/16/moderna-and-novavax-are-making-strides-in-advancin.aspx", "urlToImage": "https://g.foolcdn.com/editorial/images/574403/scientist-research-laboratory.jpg", "publishedAt": "2020-05-16T12:08:00Z", "content": "On April 27, biotechnology company Moderna(NASDAQ:MRNA) announced its submission of an investigational new drug (IND) application to the U.S. Food and Drug Administration (FDA) to start phase 2 clinical trials related to its mRNA-1273 vaccine, which is being … [+3796 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Marty Johnson", "title": "Texas Supreme Court halts expansion of mail-in voting during pandemic | TheHill - The Hill", "description": "The Texas Supreme Court on Friday halted the expansion of mail-in voting in the state during...", "url": "https://thehill.com/homenews/state-watch/498108-texas-supreme-court-halts-expansion-of-mail-in-voting", "urlToImage": "https://thehill.com/sites/default/files/texasgop_090519hillillustration.jpg", "publishedAt": "2020-05-16T12:00:04Z", "content": "The Texas Supreme Court on Friday halted the expansion of mail-in voting in the state during the coronavirus pandemic.\r\nThe court issued the stay after Texas Attorney General Ken Paxton (R) asked the Lone Star State's top court to take action in a letter earl… [+2379 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Sanjeev Miglani", "title": "India's coronavirus infections surpass China, but contagion slowing - Reuters", "description": "India's total novel coronavirus cases rose to 85,940 on Saturday, taking it past China, where the pandemic originated last year, though a strict lockdown enforced since late March has reduced the rate of contagion.", "url": "https://www.reuters.com/article/health-coronavirus-india-idUSKBN22S08F", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-05-16T07:08:22Z", "content": "NEW DELHI (Reuters) - India’s total novel coronavirus cases rose to 85,940 on Saturday, taking it past China, where the pandemic originated last year, though a strict lockdown enforced since late March has reduced the rate of contagion. \r\nState leaders, busin… [+2177 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Nicholas Bogel-Burroughs", "title": "Judge Orders Los Angeles to Move Homeless People Away From Freeways - The New York Times", "description": "The order, which takes effect next Friday, will apply to about 6,500 people living under freeways and on their ramps.", "url": "https://www.nytimes.com/2020/05/16/us/los-angeles-homeless-freeways.html", "urlToImage": "https://static01.nyt.com/images/2020/05/15/us/politics/15losangeles-freeway-living/merlin_171380706_e8daa1db-5053-4f4a-992e-b8b2e5dcee87-facebookJumbo.jpg", "publishedAt": "2020-05-16T05:39:06Z", "content": "A federal judge on Friday ordered the Los Angeles authorities to move thousands of homeless people away from freeways and their ramps because of the particularly deadly hazards in those areas, including pollutants, passing cars and potential earthquakes.\r\nJud… [+2662 chars]"}, {"source": {"id": null, "name": "Theathletic.com"}, "author": "The Athletic UK Staff", "title": "Looking for a Bundesliga team to support? Let our writers help you - The Athletic", "description": "Athletic writers nominate their teams, appealing to fans of underdogs, river walks, losers, kebabs, Tony Yeboah and costly shopping trips...", "url": "https://theathletic.com/1816044/2020/05/16/choose-your-bundesliga-team/", "urlToImage": "https://cdn.theathletic.com/app/uploads/2020/05/15140007/3x2-bundesliga-2-e1589565827715-1024x683.png", "publishedAt": "2020-05-16T04:23:51Z", "content": "The Bundesliga is back today, your first taste of elite football for weeks. Thanks to resident German football expert Raphael Honigstein’s in-depth reporting you know what to expect. Now it’s time to invest a little bit of emotion into football’s return by pi… [+672 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale and Holmes Lybrand, CNN", "title": "'He lied on national television': Trump says truckers protesting industry problems are actually honking to support him - CNN", "description": "When blaring truck horns intruded on President Donald Trump's Friday speech in the White House Rose Garden about the search for a coronavirus vaccine, Trump claimed that this was the sound of a pro-Trump protest.", "url": "https://www.cnn.com/2020/05/15/politics/fact-check-trump-trucker-protest/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200515142830-01-truckers-protest-dc-0511-super-tease.jpg", "publishedAt": "2020-05-16T01:12:52Z", "content": "Washington (CNN)When blaring truck horns intruded on President Donald Trump's Friday speech in the White House Rose Garden about the search for a coronavirus vaccine, Trump claimed that this was the sound of a pro-Trump protest.\r\n\"And you hear that outside, t… [+4414 chars]"}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Brittany De Lea", "title": "SBA releases coronavirus PPP loan forgiveness application - Fox Business", "description": "Complete forgiveness may not be as simple as some business owners think.", "url": "https://www.foxbusiness.com/personal-finance/sba-releases-ppp-loan-forgiveness-application", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2020/04/0/0/AP20120620061381-e1588186347324.jpg?ve=1&tl=1", "publishedAt": "2020-05-16T00:15:05Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox.  Sign up here.\r\nThe Small Business Administration and Treasury Department on Friday released the application for business owners to fill out in order to have their Paycheck Protect… [+2891 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Devin Coldewey", "title": "NASA’s ‘Artemis Accords’ set forth new and old rules for outer space cooperation - TechCrunch", "description": "NASA’s plan to return to the Moon is ambitious enough on its own, but the agency is aiming to modernize international cooperation in space in the process. Today it published a summary of the “Artemis Accords,” a new set of voluntary guidelines that partner na…", "url": "http://techcrunch.com/2020/05/15/nasas-artemis-accords-set-forth-new-and-old-rules-for-outer-space-cooperation/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/05/nasa-artemis-astronauts.jpg?w=711", "publishedAt": "2020-05-15T23:47:55Z", "content": "NASA’s plan to return to the Moon is ambitious enough on its own, but the agency is aiming to modernize international cooperation in space in the process. Today it published a summary of the “Artemis Accords,” a new set of voluntary guidelines that partner na… [+3342 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Fact-Checking Trump's Claim COVID-19 Vaccine Could Come By 'End Of Year' | NBC News NOW - NBC News", "description": "NBC News’ Jane Timm fact checks President Trump’s claim about a potential coronavirus vaccine that he says could be available by the “end of the year.” » Sub...", "url": "https://www.youtube.com/watch?v=GXW627dqoSg", "urlToImage": "https://i.ytimg.com/vi/GXW627dqoSg/maxresdefault.jpg", "publishedAt": "2020-05-15T22:59:47Z", "content": null}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "US on track to pull troops out of Afghanistan: Pentagon - Al Jazeera English", "description": "Some question whether the US-Taliban agreement aimed at bringing peace to Afghanistan was mainly just a withdrawal deal.", "url": "https://www.aljazeera.com/news/2020/05/track-pull-troops-afghanistan-pentagon-200515190550268.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/3/1/e2e804e8ecdb4f3db32dabbf7dcf8f4a_18.jpg", "publishedAt": "2020-05-15T21:56:17Z", "content": "The United States is on track to meet its commitment to the Taliban to withdraw several thousand troops from Afghanistan by mid-July, even as violence flares, the peace process is stalled, and Kabul struggles in political deadlock.\r\nUS officials say they will… [+5707 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "NFL to propose Rooney Rule change that includes draft-pick incentives for minority hiring, per report - CBS Sports", "description": "The league is looking to incentivize teams to hire minorities in coaching and front office pipeline positions", "url": "https://www.cbssports.com/nfl/news/nfl-to-propose-rooney-rule-change-that-includes-draft-pick-incentives-for-minority-hiring-per-report/", "urlToImage": "https://sportshub.cbsistatic.com/i/r/2020/02/12/f269e0f7-e1cd-471c-a17e-1b7d76c1727b/thumbnail/1200x675/110161020e6b05377cbf43dc0dede715/eric-bieniemy.jpg", "publishedAt": "2020-05-15T20:25:49Z", "content": "Unsatisfied with the number of coaching and front offices vacancies that have been filled by minorities in recent years, the NFL is preparing to propose changes to the Rooney Rule. According to a report from NFL.com's Jim Trotter, the league will propose thos… [+3436 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Amanda Kooser", "title": "Funky, new parasitic species named after Twitter, where it was discovered - CNET", "description": "\"As far as we know, this is the first time that a new species has been discovered on Twitter,\" said the scientist who spotted it.", "url": "https://www.cnet.com/news/funky-new-parasitic-species-named-after-twitter-where-it-was-first-discovered/", "urlToImage": "https://cnet4.cbsistatic.com/img/i6aIiBJodGP7lFmi3ur6aebUUAM=/2020/05/15/b2304643-909d-45d5-94e1-3fb4c68b7cfc/fungusmillipede.jpg", "publishedAt": "2020-05-15T18:52:11Z", "content": "Virginia Tech millipede specialist Derek Hennen shared this photo on Twitter and sparked a new fungus species discovery. The red circles show where the fungus is located.\r\nDerek Hennen\r\nIn my Twitter career, I've posted cute photos of my cat and messaged back… [+2719 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Noah Higgins-Dunn", "title": "New York Gov. Cuomo says four states will allow modified beach access for Memorial Day weekend - CNBC", "description": "Cuomo said the beaches will be limited to 50% capacity. Concession stands will be closed and contact activities, including sports, such as volleyball, are prohibited. Public pools will remain closed, he said.", "url": "https://www.cnbc.com/2020/05/15/new-york-gov-cuomo-says-four-states-will-reopen-restricted-beach-access-for-memorial-day-weekend.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106515969-1588339507418gettyimages-1211432279.jpeg?v=1589558121", "publishedAt": "2020-05-15T18:43:09Z", "content": "New York state will reopen its beaches, including local beaches and lake shores, for Memorial Day weekend in coordination with New Jersey, Connecticut and Delaware, Gov. Andrew Cuomo announced Friday. \r\nCuomo said the beaches will be limited to 50% capacity. … [+2907 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Carly Page", "title": "Those Apple-exclusive Ice Lake processors aren't faster than the 15W versions in other laptops - TechRadar India", "description": "Ice Lake CPUs fall flat in early benchmarks", "url": "https://www.techradar.com/news/those-apple-exclusive-ice-lake-processors-arent-faster-than-the-15w-versions-in-other-laptops", "urlToImage": "https://cdn.mos.cms.futurecdn.net/fmSctFNq8WJcDdywKvFTmj-1200-80.jpg", "publishedAt": "2020-05-15T18:21:00Z", "content": "Though Intel is reportedly reserving its top-end 28W 10th-gen Ice Lake CPUs for Apples 13in MacBook, it appears these chips fail to offer a substantial performance advantage over their 15W counterparts.\r\nFollowing the launch of the MacBook Pro 13, the Intel C… [+1583 chars]"}, {"source": {"id": null, "name": "Benzinga.com"}, "author": "Shanthi Rexaline", "title": "Nvidia Analyst Says New, Ampere-Based Data Center GPU Makes Chipmaker 'Unassailable' - Benzinga", "description": "NVIDIA Corporation (NASDAQ: NVDA) shares, which have been bouncing along nicely for much of this week amid positive sell-side expectations for the ...", "url": "https://www.benzinga.com/analyst-ratings/analyst-color/20/05/16043371/nvidia-analyst-says-new-ampere-based-data-center-gpu-makes-chipmaker-unassailable", "urlToImage": "https://cdn.benzinga.com/files/imagecache/og_image_social_share_1200x630/images/story/2012/nvidia_a100_gpu.jpg", "publishedAt": "2020-05-15T17:11:24Z", "content": null}]}