{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Kanye West is now hip-hop’s second billionaire, according to Forbes - NME Live", "description": "After reviewing his finances upon request, Forbes Magazine says Kanye West is now officially a billionaire. West is now hip-hop's second billionaire.", "url": "https://www.nme.com/news/music/kanye-west-is-now-hip-hops-second-billionaire-according-to-forbes-2653542", "urlToImage": null, "publishedAt": "2020-04-25T07:52:18Z", "content": "After reviewing his finances upon request, Forbes says Kanye West is now officially a billionaire.\r\nA new report from the American business magazine valued the rapper and fashion mogul at $1.3billion. The bulk of that wealth comes from West’s stake in his Yee… [+1281 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "2020 NFL Draft Day 2 winners and losers: Panthers load up on defense, Packers make more head-scratching moves - CBS Sports", "description": "Matt Rhule is building a defense that should complement his offense for years to come", "url": "https://www.cbssports.com/nfl/news/2020-nfl-draft-day-2-winners-and-losers-panthers-load-up-on-defense-packers-make-more-head-scratching-moves/", "urlToImage": null, "publishedAt": "2020-04-25T06:57:46Z", "content": "Like Day 1, Day 2 of the 2020 NFL Draft saw several teams make very strong picks that should immediately pay dividends for the upcoming season. Conversely, several other teams made some head-scratching decisions that will surely come back to haunt them in the… [+8877 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": null, "title": "Why 49ers might consider Rodgers like they did with Brady - NBCSports.com", "description": "Why wouldn't the 49ers kick the tires on Rodgers, who is both younger and better than Brady at this stage?", "url": "https://www.nbcsports.com/bayarea/49ers/forget-tom-brady-might-aaron-rodgers-replace-49ers-jimmy-garoppolo", "urlToImage": null, "publishedAt": "2020-04-25T06:20:52Z", "content": "The wait continues for the 49ers.\r\nGeneral manager John Lynch and coach Kyle Shanahan got no TV time in their home offices on Friday as the NFL buzzed through the second and third rounds of the draft.\r\nThe 49ers are not scheduled to leap into action until the… [+4087 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Mike Freeman", "title": "NFL Draft Day 2 Notebook: Hurts No Novelty for Eagles, and Wentz Should Know It - Bleacher Report", "description": "One of the more creative minds in football is Eagles coach Doug Pederson.  One of the most brittle quarterbacks in football is Carson Wentz.  One of the most versatile and talented athletes in the draft is Oklahoma quarterback Jalen Hurts...", "url": "https://bleacherreport.com/articles/2888469-nfl-draft-day-2-notebook-hurts-no-novelty-for-eagles-and-wentz-should-know-it", "urlToImage": null, "publishedAt": "2020-04-25T05:53:42Z", "content": "Michael Conroy/Associated Press\r\nOne of the more creative minds in football is Eagles coach Doug Pederson.\r\nOne of the most brittle quarterbacks in football is Carson Wentz.\r\nOne of the most versatile and talented athletes in the draft is Oklahoma quarterback… [+7123 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Dennis Romero", "title": "Judge orders release of migrant children despite challenges presented by pandemic - NBC News", "description": "A federal judge ordered the Trump administration to release migrant children under a 1997 settlement between advocates and the government.", "url": "https://www.nbcnews.com/news/us-news/judge-orders-release-migrant-children-despite-challenges-presented-pandemic-n1192456", "urlToImage": null, "publishedAt": "2020-04-25T05:35:22Z", "content": "A federal judge on Friday ruled that the Trump administration was again violating a longstanding agreement that compels the government to release migrant children detained at the border within 20 days and ordered the minors be released.\r\nPlaintiffs represente… [+2481 chars]"}, {"source": {"id": null, "name": "Nj.com"}, "author": "Brent Johnson | NJ Advance Media for NJ.com", "title": "‘We’re not out of the woods yet,’ Murphy says, even as N.J. coronavirus hospitalizations drop - NJ.com", "description": "Murphy said he plans on Monday to outline “broad principles\" for the steps the state needs to take to begin gradually lifting restrictions and reopening the economy.", "url": "https://www.nj.com/coronavirus/2020/04/were-not-out-of-the-woods-yet-murphy-says-even-as-nj-coronavirus-hospitalizations-drop.html", "urlToImage": null, "publishedAt": "2020-04-25T05:14:00Z", "content": "New Jersey got good news and bad news Friday in its fight against the coronavirus pandemic.\r\nThe rate of hospitalizations, critical care patients, ventilator use, and deaths are dropping, state officials said.\r\nBut the number of cases and deaths rose again, a… [+5655 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Connie Liou", "title": "Who Plays Magda on 'Penny Dreadful: City of Angels'? Natalie Dormer Portrays Showtime's Latest Supernatural Antagonist - Showbiz Cheat Sheet", "description": "Who plays Magda, Elsa, Rio, and Alex on 'Penny Dreadful: City of Angels'? Here's Natalie Dormer's latest project after 'Game of Thrones'.", "url": "https://www.cheatsheet.com/entertainment/magda-penny-dreadful-city-of-angels-natalie-dormer-alex-rio-elsa.html/", "urlToImage": null, "publishedAt": "2020-04-25T04:33:27Z", "content": "ThePenny Dreadful spinoff, City of Angels, may not star Eva Green, but the shows cast still packs a powerful punch. The new Showtime original series includes fan-favorites such as Nathan Lane and Alex Rodriguez. But Natalie Dormer — who plays Magda, Elsa, Rio… [+4684 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "HOLLY OTTERBEIN", "title": "New evidence surfaces in Tara Reade allegation against Biden - POLITICO", "description": "A 1993 video appears to show her mother calling the Larry King Show to discuss a claim against “a prominent senator.”", "url": "https://www.politico.com/news/2020/04/24/tara-reade-biden-video-207670", "urlToImage": null, "publishedAt": "2020-04-25T04:00:33Z", "content": "King asked the woman, She had a story to tell but, out of respect for the person she worked for, she didnt tell it?\" \r\nThe caller replied, \"That's true.\"\r\nIn March, Reade accused Biden of digitally penetrating her in 1993 without her consent. Last year, she t… [+1738 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "The Associated Press", "title": "Showdown looms between Silicon Valley, U.S. states over contact tracing apps - NBC News", "description": "Showdown looms between two of the biggest Silicon Valley companies and U.S. states over contact tracing apps that could prove essential to ending coronavirus lockdowns", "url": "https://www.nbcnews.com/tech/tech-news/showdown-looms-between-silicon-valley-u-s-states-over-contact-n1192436", "urlToImage": null, "publishedAt": "2020-04-25T03:04:11Z", "content": "SAN FRANCISCO - U.S. states promoting apps that could prove essential to ending the coronavirus lockdown may be headed for a showdown with the two Silicon Valley companies that control key software on 99 percent of smartphones over the collection of sensitive… [+5135 chars]"}, {"source": {"id": null, "name": "Ksl.com"}, "author": "https://www.facebook.com/kslcom/", "title": "Giant asteroid flying by Earth next week looks like it's wearing a face mask - KSL.com", "description": "An asteroid estimated to be 1.2 miles wide will fly by Earth next week, but it's not expected to collide with our planet.", "url": "https://www.ksl.com/article/46744600/giant-asteroid-flying-by-earth-next-week-looks-like-its-wearing-a-face-mask", "urlToImage": null, "publishedAt": "2020-04-25T02:57:43Z", "content": "ATLANTA (CNN) An asteroid estimated to be 1.2 miles wide will fly by Earth next week, but it's not expected to collide with our planet.\r\nAnd if an asteroid could be aware of such things, it appears to be wearing a face mask in deference to the pandemic, accor… [+2872 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul Vercammen and Jon Passantino, CNN", "title": "Many Southern California beaches remain closed as heat wave hits - CNN", "description": "Beaches in Los Angeles and San Diego counties will remain closed this weekend to slow the spread of the coronavirus as a heatwave brings record warm temperatures to Southern California.", "url": "https://www.cnn.com/2020/04/24/us/many-southern-california-beaches-closed-in-heat-wave/index.html", "urlToImage": null, "publishedAt": "2020-04-25T02:44:48Z", "content": "Heat Advisory Friday/Saturday as temperatures soar into the 90's. \r\nReminder, the Mayor's \"Safer at Home\" order remains in effect &amp; LA beaches are closed. \r\nIf engaging in essential activities, maintain social distancing &amp; wear face coverings as requi… [+88 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Terrence McCoy", "title": "Brazil’s justice minister resigns, accusing Bolsonaro of improper conduct - The Washington Post", "description": "The resignation further isolates Bolsonaro as he faces criticism for his handling of the coronavirus crisis.", "url": "https://www.washingtonpost.com/world/the_americas/brazils-justice-minister-resigns-accusing-bolsonoro-of-improper-conduct/2020/04/24/53f4b804-8642-11ea-81a3-9690c9881111_story.html", "urlToImage": null, "publishedAt": "2020-04-25T02:22:56Z", "content": "Moro said he could discern only political and improper motives behind Bolsonaros decision to fire Maurício Valeixo, the head of the federal police. He accused Bolsonaro of wanting to install a police chief who would grant him access to confidential reports an… [+5099 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Ryan Gaydos", "title": "D'Andre Swift's dad steals the show after Lions select running back in NFL Draft - Fox News", "description": "The Detroit Lions may have found their running back of the future with D’Andre Swift, but fans had to be begging the team to take a second look at his father.", "url": "https://www.foxnews.com/sports/dandre-swift-dad-lions-select-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-25T01:53:54Z", "content": "The Detroit Lions may have found their running back of the future with D’Andre Swift, but fans had to be begging the team to take a second look at his father.\r\nESPN’s broadcast of the NFL Draft showcased Swift’s father, Darren, working out in the gym -- and h… [+1120 chars]"}, {"source": {"id": null, "name": "Nydailynews.com"}, "author": "Anna Sanders, Chris Sommerfeldt", "title": "Spike in NYC residents ingesting householder cleaners: Poison Control Center - New York Daily News", "description": "NYC's Poison Control Center, a sub-agency of the city’s Health Department, managed a total of 30 cases of possible exposure to disinfectants between 9 p.m. Thursday and 3 p.m. Friday.", "url": "https://www.nydailynews.com/coronavirus/ny-coronavirus-new-yorkers-household-cleaners-trump-20200425-rnaqio5dyfeaxmthxx2vktqa5m-story.html", "urlToImage": null, "publishedAt": "2020-04-25T01:48:21Z", "content": null}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Matt Keeley, Tom O'Connor, Naveed Jamali", "title": "China Sends Doctors to North Korea as TV Report Fuels Speculation About Kim Jong Un's Health - Newsweek", "description": "China has sent a team of doctors to North Korea to help determine Supreme Leader of North Korea Kim Jong Un's health status, Reuters reported on Friday. Hong Kong state media reported that Kim was...", "url": "https://www.newsweek.com/china-sends-doctors-north-korea-tv-report-fuels-speculation-kim-jong-un-dead-1500181", "urlToImage": null, "publishedAt": "2020-04-25T01:14:30Z", "content": "China has sent a team of doctors to North Korea to help determine supreme leader of North Korea Kim Jong Un's health status, Reuters reported on Friday. Hong Kong Satellite Television reported that Kim was dead, though there has been no confirmation from U.S.… [+4451 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Louis Casiano", "title": "Six percent of Miami-Dade residents have coronavirus antibodies, far more than official count, study finds - Fox News", "description": "University of Miami researchers said Friday that around six percent of Miami-Dade County residents -- approximamtely 165,000 people -- have coronavirus antibodies indicating previous infection, a far larger total than the 10,926 county cases confirmed by Flor…", "url": "https://www.foxnews.com/us/six-percent-of-miami-dade-residents-have-coronavirus-antibodies-far-more-than-official-count-study-says", "urlToImage": null, "publishedAt": "2020-04-25T00:42:05Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nUniversity of Miami researchers said Friday that around six percent of Miami-Dade County residents -- approximamtely 165,000 people -- have coronavirus antibodies in… [+2924 chars]"}, {"source": {"id": null, "name": "Visualcapitalist.com"}, "author": "Iman Ghosh", "title": "Exploring the Expanse: 30 Years of Hubble Discoveries - Visual Capitalist", "description": "For 30 years, the Hubble Space telescope has been our eye into outer space. This stunning map looks at 550,000 observations made between 1990-2019.", "url": "https://www.visualcapitalist.com/30-years-hubble-discoveries/", "urlToImage": null, "publishedAt": "2020-04-25T00:26:55Z", "content": "If you think back almost 12 months, you’ll remember that the markets opened the year with extreme levels of volatility.\r\nStocks had just finished the worst year in a decade. Then in early January, Apple cut its earnings guidance after the company had already … [+3801 chars]"}, {"source": {"id": null, "name": "Cinemablend.com"}, "author": "Laura Hurley", "title": "Blue Bloods Actor Nick Cordero's Wife Says He Should Have Woken From Coma By Now - CinemaBlend", "description": "Amanda Kloots provides an update on her husband's condition.", "url": "https://www.cinemablend.com/television/2495108/blue-bloods-actor-nick-corderos-wife-says-he-should-have-woken-from-coma-by-now", "urlToImage": null, "publishedAt": "2020-04-25T00:23:14Z", "content": "Blue Bloods actor and popular TV guest star Nick Cordero has been fighting for his life after a diagnosis with COVID-19, and his wife Amanda Kloots has been providing regular updates on his condition. Her updates have provided a window into the illness as wel… [+2833 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Navy Recommends Reinstatement Of Capt. Crozier, Who Sounded Alarm On Coronavirus | NBC Nightly News - NBC News", "description": "The Navy’s top brass recommended the reinstatement of Capt. Brett Crozier as commander of the USS Theodore Roosevelt to Defense Secretary Mark Esper. Crozier...", "url": "https://www.youtube.com/watch?v=tX0NTRyIIck", "urlToImage": null, "publishedAt": "2020-04-25T00:11:04Z", "content": "The Navys top brass recommended the reinstatement of Capt. Brett Crozier as commander of the USS Theodore Roosevelt to Defense Secretary Mark Esper. Crozier was dismissed for writing a letter begging for help for his crew after a coronavirus outbreak on the a… [+1006 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Morgan McFall-Johnsen, Business Insider", "title": "NASA Has Designed a Mass-Producible Ventilator For a Second Wave of COVID-19 - ScienceAlert", "description": "NASA engineers have designed a mass-producible ventilator tailored to coronavirus patients, and it could get emergency approval from the Food and Drug Administration by the weekend.", "url": "https://www.businessinsider.com/nasa-designs-cheap-simple-coronavirus-ventilator-mass-production-2020-4?utm_source=feedburner&amp%3Butm_medium=referral&utm_medium=feed&utm_campaign=Feed%3A+businessinsider+%28Business+Insider%29&r=US&IR=T", "urlToImage": null, "publishedAt": "2020-04-24T23:52:28Z", "content": "NASA engineers have designed a mass-producible ventilator tailored to coronavirus patients, and it could get emergency approval from the Food and Drug Administration by the weekend.\r\nA team of engineers at the Jet Propulsion Laboratory in Pasadena, California… [+4024 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Next round of small-business loans under controversial coronavirus-aid program starts Monday - Seattle Times", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMigwFodHRwczovL3d3dy5zZWF0dGxldGltZXMuY29tL2J1c2luZXNzL25leHQtcm91bmQtb2Ytc21hbGwtYnVzaW5lc3MtbG9hbnMtdW5kZXItY29udHJvdmVyc2lhbC1jb3JvbmF2aXJ1cy1haWQtcHJvZ3JhbS1zdGFydHMtbW9uZGF5L9IBiQFodHRwczovL3d3dy5zZWF0dGxldGltZXMuY29tL2J1c2luZXNzL25leHQtcm91bmQtb2Ytc21hbGwtYnVzaW5lc3MtbG9hbnMtdW5kZXItY29udHJvdmVyc2lhbC1jb3JvbmF2aXJ1cy1haWQtcHJvZ3JhbS1zdGFydHMtbW9uZGF5Lz9hbXA9MQ?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T23:44:00Z", "content": null}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Corinne Reichert", "title": "Disney reshuffles Marvel movie release dates out to 2022 - CNET", "description": "Doctor Strange and Thor have been moved, while Into the Spider-Verse has also been delayed by Sony.", "url": "https://www.cnet.com/news/disney-reshuffles-marvel-movie-release-dates-out-to-2022/", "urlToImage": null, "publishedAt": "2020-04-24T23:02:30Z", "content": "Disney\r\nWalt Disney Studios has moved around a few more release dates following the delay of movies amid COVID-19 lockdowns and quarantines, including two Marvel Cinematic Universe movies. The Doctor Strange sequel has been pushed from 2021 to 2022, Disney sa… [+849 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Laurie McGinley, Christopher Rowland, Yasmeen Abutaleb, Carolyn Y. Johnson", "title": "FDA warns about hydroxychloroquine dangers, citing serious heart issues, including death - The Washington Post", "description": "The FDA warned Friday that people should not take chloroquine and hydroxychloroquine for covid-19 outside of a hospital or clinical trial, citing reports of « serious heart rhythm problems. »", "url": "https://www.washingtonpost.com/health/2020/04/24/fda-warns-about-hydroxychloroquine-dangers-citing-serious-heart-issues-including-death/", "urlToImage": null, "publishedAt": "2020-04-24T23:01:35Z", "content": "An increasing number of studies and reports have raised safety issues, making the drugs an example of how the presidents embrace of unproven medical ideas has potentially endangered Americans lives and put health agencies in a tough spot.\r\nOn Thursday, after … [+9358 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Laura Italiano", "title": "China's first wave of coronavirus cases may have been four times bigger than originally reported - New York Post ", "description": "China’s first wave of coronavirus cases may have been four times bigger than the country reported, according to a Hong Kong study. China had reported more than 55,000 cases as of Feb. 20 &#82…", "url": "https://nypost.com/2020/04/24/china-first-wave-of-coronavirus-may-have-been-four-times-bigger/", "urlToImage": null, "publishedAt": "2020-04-24T22:47:40Z", "content": "China’s first wave of coronavirus cases may have been four times bigger than the country reported, according to a Hong Kong study.\r\nChina had reported more than 55,000 cases as of Feb. 20 — but the true number would have been far greater if the country had us… [+574 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Healthy people in their 30s and 40s, barely sick with COVID-19, are dying from strokes - Seattle Times", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMif2h0dHBzOi8vd3d3LnNlYXR0bGV0aW1lcy5jb20vbmF0aW9uLXdvcmxkL2hlYWx0aHktcGVvcGxlLWluLXRoZWlyLTMwcy1hbmQtNDBzLWJhcmVseS1zaWNrLXdpdGgtY292aWQtMTktYXJlLWR5aW5nLWZyb20tc3Ryb2tlcy_SAYUBaHR0cHM6Ly93d3cuc2VhdHRsZXRpbWVzLmNvbS9uYXRpb24td29ybGQvaGVhbHRoeS1wZW9wbGUtaW4tdGhlaXItMzBzLWFuZC00MHMtYmFyZWx5LXNpY2std2l0aC1jb3ZpZC0xOS1hcmUtZHlpbmctZnJvbS1zdHJva2VzLz9hbXA9MQ?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T21:58:00Z", "content": null}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Gabrielle Fonrouge", "title": "Today's coronavirus update: Gym, barbers reopen in Georgia; Michigan acquiesces - New York Post ", "description": "Georgia became the first state in the US to reopen some nonessential businesses — despite a sharp rebuke from President Trump, who said he “wasn’t happy” with the decision.  Gov. Br…", "url": "https://nypost.com/2020/04/24/todays-coronavirus-update-georgia-reopens-michigan-acquiesces/", "urlToImage": null, "publishedAt": "2020-04-24T21:50:44Z", "content": "Georgia became the first state in the US to reopen some nonessential businesses — despite a sharp rebuke from President Trump, who said he wasnt happy with the decision. \r\nGov. Brian Kemp forged ahead with the plan anyway and opened the doors of gyms, barbers… [+1231 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Phil LeBeau", "title": "Boeing pushes back target date for fixing 737 Max as coronavirus hinders progress - CNBC", "description": "Boeing still needs to complete two software updates and clear a number of other hurdles, including a recertification flight, before the Max can be cleared to return to commercial service.", "url": "https://www.cnbc.com/2020/04/24/boeing-737-max-fix-date-quietly-pushed-back-amid-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-24T21:49:29Z", "content": "Boeing is once again pushing back the time frame for when it expects to have the 737 Max recertified for flight as the coronavirus pandemic hinders progress. Sources familiar with the latest expectations for fixing the Max tell CNBC that the plane is unlikely… [+1607 chars]"}, {"source": {"id": null, "name": "Abc6onyourside.com"}, "author": "Stephen Loiaconi", "title": "Biden benefits from staying out of spotlight amid coronavirus outbreak, experts say - ABC6OnYourSide.com", "description": "Former Vice President Joe Biden is building a lead over President Donald Trump in key swing states, new polls suggest, as voters question Trump&rsquo;s response to the coronavirus outbreak and pay relatively little attention to anything Biden is doing at all.…", "url": "http://abc6onyourside.com/news/nation-world/biden-benefits-from-staying-out-of-spotlight-amid-coronavirus-outbreak-experts-say", "urlToImage": null, "publishedAt": "2020-04-24T21:37:00Z", "content": null}, {"source": {"id": null, "name": "Tmonews.com"}, "author": "Alex Wagner", "title": "iPhone SE launches today, Costco rolls out deal for T-Mobile customers - TmoNews", "description": "A little over a week after Apple surprised us with an updated iPhone SE, the new device has officially launche", "url": "https://www.tmonews.com/2020/04/iphone-se-launch-today-costco-deal-t-mobile-customers/", "urlToImage": null, "publishedAt": "2020-04-24T21:33:27Z", "content": "A little over a week after Apple surprised us with an updated iPhone SE, the new device has officially launched.\r\nThe iPhone SE is in stock and ready to ship at T-Mobile. The 64GB and 256GB have estimated ship dates of April 24-27, but you may have to wait a … [+1585 chars]"}, {"source": {"id": null, "name": "News12.com"}, "author": null, "title": "Plainview store owner hit with federal charges for alleged hoarding, price gouging of PPE - News 12 Long Island", "description": "A Plainview businessman has been charged with illegally hoarding and price gouging over four tons of personal protective equipment needed in the fight against the coronavirus.", "url": "http://longisland.news12.com/story/42047760/plainview-store-owner-hit-with-federal-charges-for-alleged-hoarding-price-gouging-of-ppe", "urlToImage": null, "publishedAt": "2020-04-24T21:01:00Z", "content": "A Plainview businessman has been charged with illegally hoarding and price gouging over four tons of personal protective equipment needed in the fight against the coronavirus.\r\nNews 12 reported earlier this month on Bobby Singh, owner of Wholesale Liquidation… [+1761 chars]"}, {"source": {"id": null, "name": "Threatpost.com"}, "author": "Tara Seals", "title": "Latest Apple Text-Bomb Crashes iPhones via Message Notifications - Threatpost", "description": "Sindhi-language characters can crash iPhones and other iOS/macOS devices if a victim views texts, Twitter posts or messages within various apps containing them.", "url": "https://threatpost.com/apple-text-bomb-crashes-iphones-message-notifications/155144/", "urlToImage": null, "publishedAt": "2020-04-24T20:41:00Z", "content": "Sindhi-language characters can crash iPhones and other iOS/macOS devices if a victim views texts, Twitter posts or messages within various apps containing them.Apple devices are vulnerable to a “text bomb” attack where simply looking at messages or posts cont… [+3338 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Georgia mayor on reopening: It's like the 'Twilight Zone' - CNN", "description": "Atlanta Mayor Keisha Lance Bottoms pleads for residents to stay home, despite Governor Brian Kemp lifting shelter-in-place orders and reopening some nonessen...", "url": "https://www.youtube.com/watch?v=u6pBm-JaupA", "urlToImage": null, "publishedAt": "2020-04-24T20:32:09Z", "content": null}, {"source": {"id": null, "name": "Snopes.com"}, "author": "Associated Press", "title": "Canada Mass Shooting Started with Assault on Girlfriend - Snopes.com", "description": "The weekend shooting rampage started with an assault by the suspect on his girlfriend and ended with 22 people dead in communities across central and northern Nova Scotia.", "url": "https://www.snopes.com/ap/2020/04/24/canada-mass-shooting-started-with-assault-on-girlfriend/", "urlToImage": null, "publishedAt": "2020-04-24T19:23:29Z", "content": "TORONTO (AP) Canadas worst mass shooting erupted from an argument between the gunman and his girlfriend, who survived the attack, police have confirmed.\r\nRoyal Canadian Mounted Police Supt. Darren Campbell said the weekend shooting rampage started with an ass… [+5247 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Angel Au-Yeung", "title": "Amnesty International Calls On Jeff Bezos To Address Amazon Employees’ Concerns About Working Conditions - Forbes", "description": "The demand from the international NGO coincides with a virtual protest planned by Amazon tech and warehouse workers.", "url": "https://www.forbes.com/sites/angelauyeung/2020/04/24/amnesty-international-calls-on-jeff-bezos-to-address-amazon-employees-concerns-about-working-conditions/", "urlToImage": null, "publishedAt": "2020-04-24T19:22:00Z", "content": "Jeff Bezos.\r\n© 2016 Bloomberg Finance LP\r\nOn Friday morning, hundreds of employees from Amazons corporate offices and warehouses called in sick to protest the e-commerce behemoths handling of working conditions amid the coronavirus pandemic. Human rights grou… [+4426 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": null, "title": "Facebook launches ‘Messenger Rooms’ as a Zoom and Group FaceTime alternative - 9to5Mac", "description": "Facebook is out today with a new product to connect multiple people via video chat and compete with popular offerings like Zoom, Group FaceTime, Skype, Houseparty, and more. Detailed by TechCrunch, Facebook announced a number of messaging updates today with t…", "url": "https://9to5mac.com/2020/04/24/facebook-launches-messenger-rooms-as-a-zoom-and-group-facetime-alternative/", "urlToImage": null, "publishedAt": "2020-04-24T18:47:18Z", "content": "Facebook is out today with a new product to connect multiple people via video chat and compete with popular offerings like Zoom, Group FaceTime, Skype, Houseparty, and more.\r\nDetailed by TechCrunch, Facebook announced a number of messaging updates today with … [+3683 chars]"}, {"source": {"id": null, "name": "Dispatch.com"}, "author": "Max Filby", "title": "Coronavirus: Antibody testing coming to Columbus-area hospitals - The Columbus Dispatch", "description": "Testing for COVID-19 antibodies could soon be available throughout Ohio. Experts say the testing could be key to restarting the economy on a large scale.", "url": "https://www.dispatch.com/article/20200424/NEWS/200429239", "urlToImage": null, "publishedAt": "2020-04-24T18:38:49Z", "content": "Testing for COVID-19 antibodies may soon be available throughout Ohio. Experts say it could be key to restarting the economy on a large scale.\r\nCentral Ohio hospitals could start testing for COVID-19 antibodies in patients as soon as next week.\r\nThe testing, … [+4501 chars]"}, {"source": {"id": null, "name": "Nasaspaceflight.com"}, "author": null, "title": "Soyuz “Victory Rocket” launches Progress MS-14 to the ISS - NASASpaceflight.com", "description": "For the second time this month, the Russian federal space agency, Roscosmos, launched one of…", "url": "https://www.nasaspaceflight.com/2020/04/soyuz-victory-ready-for-station/", "urlToImage": null, "publishedAt": "2020-04-24T18:27:01Z", "content": "For the second time this month, the Russian federal space agency, Roscosmos, launched one of their crafts to the International Space Station.\r\nLiftoff of the Progress MS-14 uncrewed cargo resupply mission to the orbital outpost launched from Site No. 31/6 at … [+5873 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Fatima-Tul Farha", "title": "Coronavirus has changed the way Muslims are celebrating Ramadan, in virtual spaces and in solitude - USA TODAY", "description": "Hajjar Ahmed sees Ramadan as an opportunity this year \"to celebrate in real time virtually with Muslims all over the world.\"", "url": "https://www.usatoday.com/story/news/2020/04/24/coronavirus-muslims-celebrate-ramadan-differently-during-pandemic/5167361002/", "urlToImage": null, "publishedAt": "2020-04-24T17:51:24Z", "content": "Take a look at what the Great Mosque of Mecca before and after the coronavirus outbreak during Ramadan.\r\nUSA TODAY\r\nHajjar Ahmed's lofty goals this Ramadan include reading the Qur'an multiple times, joining virtual Iftar meals to break the fast, and engaging … [+9394 chars]"}]}