{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "MJ Lee, CNN Political Correspondent", "title": "Biden's accuser says mother called into 'Larry King Live' in 1993 for advice after alleged sexual assault - CNN", "description": "Newly surfaced video from 1993 appears to feature the mother of Tara Reade, a woman who accused presumptive Democratic presidential nominee Joe Biden of sexual assault, calling into a cable TV show to seek advice around the time of the alleged assault.", "url": "https://www.cnn.com/2020/04/25/politics/tara-reade-mom-larry-king/index.html", "urlToImage": null, "publishedAt": "2020-04-25T18:15:46Z", "content": null}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "NFL Draft 2020 trade tracker: Trent Williams, Matt Breida dealt on Day 3 and details of every trade - CBS Sports", "description": "Find out the details of every draft day trade right here", "url": "https://www.cbssports.com/nfl/draft/news/nfl-draft-2020-trade-tracker-trent-williams-matt-breida-dealt-on-day-3-and-details-of-every-trade/", "urlToImage": null, "publishedAt": "2020-04-25T18:15:37Z", "content": "After four trades on Thursday night, Day 2 of the NFL draft had nine swaps that included three deals made by the Patriots, who have moved around a total of four times in this year's draft heading into Day 3. Day 2 ended with the Saints trading all four of the… [+377 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Erik Ortiz", "title": "Coronavirus survivors detail despair, recovery: 'You're a miracle' - NBC News", "description": "In the face of mounting infection rates and death tolls, it can be difficult to remember that most people infected with COVID-19 do recover and survive.", "url": "https://www.nbcnews.com/news/us-news/coronavirus-survivors-detail-despair-recovery-you-re-miracle-n1191831", "urlToImage": null, "publishedAt": "2020-04-25T17:44:42Z", "content": "They are survivors of severe cases of the coronavirus, most of them had been hospitalized, some of them hooked up to ventilators for several days and none of them ever wanting to experience the misery, uncertainty and loneliness of the illness ever again.\r\n\"I… [+4613 chars]"}, {"source": {"id": null, "name": "Sfgate.com"}, "author": "Hearst Television", "title": "National coronavirus updates: No evidence people who had virus immune from second infection, WHO warns - SF Gate", "description": "The latest:", "url": "https://www.sfgate.com/news/article/National-coronavirus-updates-US-death-toll-15225716.php", "urlToImage": null, "publishedAt": "2020-04-25T17:22:03Z", "content": "National coronavirus updates: Worldwide coronavirus death toll passes 200,000\r\nThe latest:\r\n<ul><li>There have been more than 924,000 coronavirus cases in the United States, according to the Johns Hopkins University tally.</li><li>The U.S. death toll has surp… [+9491 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Icahn Says Stocks Are Overvalued, Virus May Cause ‘Downdrafts’ - Bloomberg", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=8e33fc20-8726-11ea-8287-3b59790ee79a&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNC0yNS9pY2Fobi1zYXlzLXN0b2Nrcy1hcmUtb3ZlcnZhbHVlZC12aXJ1cy1tYXktY2F1c2UtZG93bmRyYWZ0cw==", "urlToImage": null, "publishedAt": "2020-04-25T17:15:21Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Minyvonne Burke", "title": "Texas mayor apologizes after violating stay-at-home order to go to nail salon - NBC News", "description": "The mayor of a southern Texas city apologized for violating her own stay-at-home order after a photo surfaced on social media of her at a nail salon.", "url": "https://www.nbcnews.com/news/us-news/texas-mayor-apologizes-after-violating-stay-home-order-go-nail-n1192631", "urlToImage": null, "publishedAt": "2020-04-25T17:02:47Z", "content": "The mayor of a southern Texas city apologized for violating her own stay-at-home order after a photo surfaced on social media of her at a nail salon.\r\nThe trip Tuesday by Beaumont Mayor Becky Ames to the closed salon has sparked an investigation by the distri… [+2214 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Tal Axelrod", "title": "Michigan state senator apologizes for wearing face mask that resembles Confederate flag | TheHill - The Hill", "description": "A Michigan state senator apologized Saturday for wearing a face mask that resembled the Confederate flag during a vote at the state Capitol.", "url": "https://thehill.com/homenews/state-watch/494654-michigan-state-senator-apologizes-for-wearing-face-mask-that-resembles", "urlToImage": null, "publishedAt": "2020-04-25T16:51:02Z", "content": "A Michigan state senator apologized Saturday for wearing a face mask that resembled the Confederate flag during a vote at the state Capitol.\r\nState Sen. Dale Zorn (R) had previously denied that the pattern on his mask was the flag but admitted Saturday he mad… [+1227 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Josh Lezmi", "title": "The 4 Most Plausible Reasons Tom Holland Beat Out the Competition When Auditioning For Spider-Man in the MCU - Showbiz Cheat Sheet", "description": "The 4 most likely reasons Tom Holland was chosen to play Spider-Man in the MCU over his fierce competition. Get the full breakdown here.", "url": "https://www.cheatsheet.com/entertainment/the-4-most-plausible-reasons-tom-holland-beat-the-competition-auditioning-for-spider-man-mcu.html/", "urlToImage": null, "publishedAt": "2020-04-25T16:32:24Z", "content": "Tom Holland first appeared in the Marvel Cinematic Universe as underoos when he swung onto the scene to strip Captain America of his shield in Civil War. Since that first debut, he has gone on to become a major presence in the landscape. Holland appeared in t… [+2984 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Julie Johnsson", "title": "Boeing, Embraer Scrap $4.2 Billion Deal as Market Shrinks - Yahoo Canada Finance", "description": "(Bloomberg) -- Boeing Co. is walking away from its proposed $4.2 billion combination with Embraer SA’s commercial-aircraft business, ending years of talks, as the planemakers brace for a far smaller jetliner market after the coronavirus pandemic.The deal’s co…", "url": "https://finance.yahoo.com/news/boeing-embraer-scrap-4-2-151917245.html", "urlToImage": null, "publishedAt": "2020-04-25T16:31:00Z", "content": "(Bloomberg) -- Boeing Co. is walking away from its proposed $4.2 billion combination with Embraer SAs commercial-aircraft business, ending years of talks, as the planemakers brace for a far smaller jetliner market after the coronavirus pandemic.\r\nThe deals co… [+4741 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Gareth Beavis", "title": "iPhone SE 2020 teardown reveals intriguing facts about battery and camera - TechRadar India", "description": "Things are more similar than we anticipated", "url": "https://www.techradar.com/news/iphone-se-2020-teardown-reveals-intriguing-facts-about-battery-and-camera", "urlToImage": null, "publishedAt": "2020-04-25T16:21:00Z", "content": "Weve been waiting to see what parts are in Apples new iPhone - our iPhone SE review left us with a few questions we wanted answering, and iFixits iPhone SE early teardown has begun to provide a few of them.\r\nWhile theres still more to come when the full teard… [+2050 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "John Keim, Nick Wagoner", "title": "Redskins trade OT Trent Williams to 49ers for pair of NFL draft picks - ESPN", "description": "The Redskins traded Pro Bowl offensive tackle Trent Williams to San Francisco in exchange for a fifth-round pick this year and a third-round pick in 2021.", "url": "https://www.espn.com/nfl/story/_/id/29097862/sources-redskins-trade-ot-trent-williams-49ers", "urlToImage": null, "publishedAt": "2020-04-25T16:17:59Z", "content": "The Washington Redskins on Saturday traded perennial Pro Bowl offensive tackle Trent Williams to the San Francisco 49ers, ending a nearly yearlong dispute with the team that drafted him.\r\nThe Redskins traded Williams to San Francisco in exchange for a fifth-r… [+4477 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Paulina Dedaj", "title": "Dallas Cowboys' Jerry Jones hails NFL Draft as 'respite' from coronavirus - Fox News", "description": "Dallas Cowboys’ owner and general manager Jerry Jones recognized the importance of the NFL Draft, not only for football fans but for everyone quarantined at home, providing a sense of “business-as-usual” during the coronavirus pandemic.", "url": "https://www.foxnews.com/sports/dallas-cowboys-jerry-jones-draft-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T15:46:55Z", "content": "Dallas Cowboys’ owner and general manager Jerry Jones recognized the importance of the NFL Draft, not only for football fans but for everyone quarantined at home, providing a sense of “business-as-usual” during the coronavirus pandemic.\r\nJones appeared sentim… [+1235 chars]"}, {"source": {"id": null, "name": "Vox.com"}, "author": "Zeeshan Aleem", "title": "WHO warns against coronavirus “immunity passports” due to reinfection concerns - Vox.com", "description": "It says there is “currently no evidence” that someone cannot be reinfected.", "url": "https://www.vox.com/2020/4/25/21235946/coronavirus-immunity-passport-who-infection-twice", "urlToImage": null, "publishedAt": "2020-04-25T15:44:16Z", "content": "The World Health Organization (WHO) released a scientific brief on Saturday recommending countries refrain from issuing certificates of immunity to people who have been infected with the novel coronavirus, warning there is currently no evidence that someone c… [+7993 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Jessica Jones", "title": "Spain's kids prepare for taste of freedom after six-week lockdown - Reuters", "description": "Spain released guidelines on Saturday allowing children to go outside after six weeks living under one of Europe's strictest lockdowns, as figures confirmed a daily coronavirus death toll running well below the peak seen early this month.", "url": "https://www.reuters.com/article/us-health-coronavirus-spain-idUSKCN2270KL", "urlToImage": null, "publishedAt": "2020-04-25T15:14:26Z", "content": "MADRID (Reuters) - Spain released guidelines on Saturday allowing children to go outside after six weeks living under one of Europe’s strictest lockdowns, as figures confirmed a daily coronavirus death toll running well below the peak seen early this month. \r… [+3741 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Rick Rojas, Richard Fausset", "title": "Coronavirus Looms as Businesses Reopen in Some States - The New York Times", "description": "Some states have taken tentative steps toward reopening businesses shuttered by the coronavirus. In Georgia, it meant a few residents were out getting haircuts and their tongues pierced.", "url": "https://www.nytimes.com/2020/04/24/us/coronavirus-georgia-oklahoma-alaska-reopen.html", "urlToImage": null, "publishedAt": "2020-04-25T15:04:11Z", "content": "ATLANTA Weeks after a deadly virus reordered daily life in America, shuttering most businesses and forcing most people indoors, three states on Friday took tentative steps toward something resembling normalcy. But across Georgia, Alaska and Oklahoma, it was a… [+10562 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Andrew E. Kramer", "title": "‘There Are No Viruses Here’: Leader of Belarus Scoffs at Lockdowns - The New York Times", "description": "Under the autocratic rule of President Aleksandr G. Lukashenko, Belarus has yet to impose any restrictions to slow the virus. No, everything is not fine.", "url": "https://www.nytimes.com/2020/04/25/world/europe/belarus-lukashenko-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-25T15:03:13Z", "content": "MOSCOW As he headed off the ice after playing a hockey game in an amateur tournament in late March, the leader of Belarus brushed aside reporters anxious questions about the coronavirus pandemic.\r\nThere are no viruses here, said the Belarusian president, Alek… [+7805 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Dana Kennedy", "title": "Kim Jong Un in 'vegetative state,' Japanese media report says - New York Post ", "description": "North Korean dictator Kim Jong Un is in a “vegetative state” after he underwent heart surgery earlier this month, a Japanese magazine says. The weekly Shukan Gendai reported Friday that…", "url": "https://nypost.com/2020/04/25/kim-jong-un-in-vegetative-state-japanese-media-report-says/", "urlToImage": null, "publishedAt": "2020-04-25T14:49:09Z", "content": "North Korean dictator Kim Jong Un is in a “vegetative state” after he underwent heart surgery earlier this month, a Japanese magazine says.\r\nThe weekly Shukan Gendai reported Friday that a Chinese medic sent to North Korea as part of a team to treat Kim belie… [+1454 chars]"}, {"source": {"id": null, "name": "Wyff4.com"}, "author": null, "title": "Bittersweet: After her husband died from coronavirus, she found a goodbye note on his phone - WYFF Greenville", "description": "\"I love you guys with all my heart and you've given me the best life I could have ever asked for.\"", "url": "https://www.wyff4.com/article/bittersweet-after-her-husband-died-from-coronavirus-she-found-a-goodbye-note-on-his-phone/32273418", "urlToImage": null, "publishedAt": "2020-04-25T14:40:00Z", "content": "CNN —\"I love you guys with all my heart and you've given me the best life I could have ever asked for.\"\r\nThat's the beginning of a goodbye note one woman found on her husband's phone after he died from coronavirus this week.\r\nJonathan Coelho, 32, passed away … [+5087 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Haley Brink and Alta Spells, CNN", "title": "Severe storms possible across parts of the Southeast Saturday - CNN", "description": "Severe storms will track across parts of the Southeast Saturday after causing damage in northeast Texas on Friday.", "url": "https://www.cnn.com/2020/04/25/us/saturday-weather-texas-storm-damage/index.html", "urlToImage": null, "publishedAt": "2020-04-25T14:35:37Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/julia-hollingsworth\">Julia Hollingsworth</a>, <a href=\"/profiles/brett-mckeehan\">Brett McKeehan</a>, Tara John and <a href=\"/profiles/fernando-alfonso-iii\">Fernando Alfonso III</a>, CNN", "title": "Coronavirus pandemic spreads around the globe: Live updates - CNN International", "description": "The global coronavirus pandemic has brought countries around the world to a standstill. Here's the latest updates on worldwide Covid-19 cases, deaths, government responses and more.", "url": "https://www.cnn.com/world/live-news/coronavirus-pandemic-04-25-20-intl/index.html", "urlToImage": null, "publishedAt": "2020-04-25T14:31:00Z", "content": "In a moment caught on video, CNN producer Tawanda Scott heard her daughter talking to her friend about coronavirus. \r\nHer daughter's friend said, \"they said it's hitting African-Americans especially hard.\"\r\nThis moment was aired today during the CNN and Sesam… [+1095 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Spencer Kimball", "title": "Congress approved $370 billion more in small business loans, but the money could run out in days — again - CNBC", "description": "Though Congress approved more funding for PPP loans, it's unclear whether that's enough to cover every small business hit by the coronavirus pandemic.", "url": "https://www.cnbc.com/2020/04/25/coronavirus-ppp-small-business-loans-could-run-out-in-days.html", "urlToImage": null, "publishedAt": "2020-04-25T14:26:10Z", "content": "A customer taste tests a beer before ordering a growler to go at Harlem Public in northern Manhattan. April 24, 2020\r\nJust when Kal Narvilas thought his loan applications were about to get approved, his bank delivered the bad news there was no more money left… [+8242 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Tal Axelrod", "title": "CDC adds six more symptoms for coronavirus | TheHill - The Hill", "description": "The Centers for Disease Control and Prevention (CDC) added six new symptoms for the coronavirus to its website as officials still grapple with gauging the illness’s scope.", "url": "https://thehill.com/policy/healthcare/494640-cdc-adds-six-more-symptoms-for-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T14:25:21Z", "content": "The Centers for Disease Control and Prevention (CDC) added six new symptoms for the coronavirus to its website as officials grapple with gauging the illness's scope.\r\nThe new symptoms for the disease are chills, repeated shaking with chills, muscle pain, head… [+623 chars]"}, {"source": {"id": null, "name": "Loudwire.com"}, "author": "joedivita", "title": "Watch Post Malone + Travis Barker Play 15 Nirvana Cover Songs - Loudwire", "description": "The COVID-19 relief show was streamed live and can be watched in full.", "url": "https://loudwire.com/watch-post-malone-travis-barker-nirvana-covers/", "urlToImage": null, "publishedAt": "2020-04-25T14:23:00Z", "content": "Post Malone's at-home COVID-19 relief benefit show with Blink-182's Travis Barker featured a total of 15 Nirvana cover songs and can now be viewed in it's entirety at the bottom of this page.\r\nThe two were flanked by bassist Brian Lee and guitarist Nick Mac a… [+1763 chars]"}, {"source": {"id": null, "name": "Newsinfopark.com"}, "author": "NIP Web Desk Team", "title": "Elective surgeries set to resume, with complications and concerns - News Info Park", "description": "Austin Wall left work with severe pain and knew something was not right.Wall, 42, a Caterpillar dealership parts coordinator in Irving, Texas, went to an urgent care clinic nearly a month ago and was", "url": "https://newsinfopark.com/world-news/2020-04-25/article/elective-surgeries-set-to-resume-with-complications-and-concerns-18991/nip-web-desk-team/", "urlToImage": null, "publishedAt": "2020-04-25T13:56:03Z", "content": "Austin Wall left work with severe pain and knew something was not right.\r\nWall, 42, a Caterpillar dealership parts coordinator in Irving, Texas, went to an urgent care clinic nearly a month ago and was quickly sent to the Medical City Hospital in Arlington — … [+13488 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "David Smith, Kari Paul", "title": "Debacle of Trump's coronavirus disinfectant comments could be tipping point - The Guardian", "description": "The US president plans to ‘pare back’ his daily coronavirus briefings after falsely claiming his suggestion to ingest cleaning products had been ‘sarcastic’", "url": "https://www.theguardian.com/us-news/2020/apr/25/donald-trump-coronavirus-disinfectant-sarcastic-tipping-point", "urlToImage": null, "publishedAt": "2020-04-25T13:20:40Z", "content": "For Donald Trump, it was the strangest and most news-making thing he could have done: instead of taking questions from journalists, dominating the nations airwaves yet again, the US president gave a short pre-written statement and then stalked off the stage.\r… [+6803 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Zoom’s Good Week Ends on Sour Note After Facebook Crashes Party - Bloomberg", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=177d2d80-8704-11ea-b23a-c3ca0be50368&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNC0yNS96b29tLXMtZ29vZC13ZWVrLWVuZHMtb24tc291ci1ub3RlLWFmdGVyLWZhY2Vib29rLWNyYXNoZXMtcGFydHk=", "urlToImage": null, "publishedAt": "2020-04-25T13:13:17Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Sarah Parvini", "title": "Amid coronavirus crisis, mosques could lose key Ramadan donations - Los Angeles Times", "description": "During Ramadan, mosques around the country are able to raise as much as 30% of their annual revenue through charity from congregants. But as mosques shut their doors under coronavirus quarantine orders, they have been taken a financial hit.", "url": "https://www.latimes.com/california/story/2020-04-25/la-me-ramadan-mosques-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T13:04:47Z", "content": "Last year, on the 27th night of Ramadan, the faithful at the Islamic Center of Hawthorne pulled up to the mosque in droves to celebrate one of the holiest nights on the Islamic calendar.\r\nAfter theyd recited sunset prayers and begun their feast of meats, rice… [+5954 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew May", "title": "Celebrating 30 years of the Hubble Space Telescope - Space.com", "description": "Celebrating three decades of an icon of science — and a triumph of technology.", "url": "https://www.space.com/hubble-space-telescope-turns-30.html", "urlToImage": null, "publishedAt": "2020-04-25T12:43:31Z", "content": "It's been 30 years since NASA launched the Hubble Space Telescope on April 24, 1990. The observatory was carried aloft in the payload bay of space shuttle Discovery, and for three decades Hubble's history was closely intertwined with the shuttle's. The telesc… [+8383 chars]"}, {"source": {"id": null, "name": "France24.com"}, "author": "NEWS WIRES", "title": "'No evidence' that recovering from Covid-19 gives people immunity, WHO says - FRANCE 24 English", "description": "The World Health Organization warned on Saturday that recovering from coronavirus may not protect people from reinfection as the death toll from the pandemic approached 200,000 around the globe.", "url": "https://www.france24.com/en/20200425-no-evidence-that-recovering-from-covid-19-gives-people-immunity-who-says", "urlToImage": null, "publishedAt": "2020-04-25T12:11:51Z", "content": "The World Health Organization warned on Saturday that recovering from coronavirus may not protect people from reinfection as the death toll from the pandemic approached 200,000 around the globe.\r\n Governments across the world are struggling to limit the econo… [+6426 chars]"}, {"source": {"id": null, "name": "Nj.com"}, "author": "Darryl Slater | NJ Advance Media for NJ.com", "title": "NFL Draft 2020: Ranking 50 best players still available on Day 3, including Jake Fromm, Jacob Eason, Trey Ada - NJ.com", "description": "A look at the best players still available in the 2020 NFL Draft.", "url": "https://www.nj.com/jets/2020/04/nfl-draft-2020-ranking-50-best-players-still-available-on-day-3-including-jake-fromm-jacob-eason-trey-adams-more.html", "urlToImage": null, "publishedAt": "2020-04-25T10:16:05Z", "content": "We are through three rounds of the 2020 NFL Draft, after the second and third rounds wrapped up Friday night.\r\nThe draft concludes Saturday with Rounds 4-7, beginning at noon.\r\nSo lets rank the 50 best prospects still available.\r\n1. QB Jacob Eason, Washington… [+2013 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Guy Lodge", "title": "Streaming: curate your own Spike Jonze mini-season - The Guardian", "description": "The director’s new Beastie Boys doc is the latest twist in a singular career. What better time to seek out his best work online...", "url": "https://www.theguardian.com/film/2020/apr/25/streaming-the-best-of-spike-jonze-online-beastie-boys-story", "urlToImage": null, "publishedAt": "2020-04-25T07:01:01Z", "content": "Its been a quiet few months for Apple TV+ since the glossy hype of its launch last November, but we got a taste of their promised hipper side this week. On Friday, the streaming platform premiered Beastie Boys Story, a new documentary by Spike Jonze on the to… [+5621 chars]"}, {"source": {"id": null, "name": "Spaceflightnow.com"}, "author": null, "title": "Citing coronavirus, NASA urges public not to travel for launch of astronauts - Spaceflight Now", "description": null, "url": "https://spaceflightnow.com/2020/04/24/citing-coronavirus-concerns-nasa-discourages-public-from-attending-launch-of-astronauts/", "urlToImage": null, "publishedAt": "2020-04-25T04:48:33Z", "content": "NASA Administrator Jim Bridenstine speaks during a presentation in November 2018 at NASA Headquarters announcing the companies that will compete for the agency’s Commercial Lunar Payload Services program. Credit: NASA/Bill Ingalls\r\nNASA Administrator Jim Brid… [+6811 chars]"}, {"source": {"id": null, "name": "Ksl.com"}, "author": "https://www.facebook.com/kslcom/", "title": "Giant asteroid flying by Earth next week looks like it's wearing a face mask - KSL.com", "description": "An asteroid estimated to be 1.2 miles wide will fly by Earth next week, but it's not expected to collide with our planet.", "url": "https://www.ksl.com/article/46744600/giant-asteroid-flying-by-earth-next-week-looks-like-its-wearing-a-face-mask", "urlToImage": null, "publishedAt": "2020-04-25T02:57:43Z", "content": "ATLANTA (CNN) An asteroid estimated to be 1.2 miles wide will fly by Earth next week, but it's not expected to collide with our planet.\r\nAnd if an asteroid could be aware of such things, it appears to be wearing a face mask in deference to the pandemic, accor… [+2872 chars]"}, {"source": {"id": null, "name": "Japantimes.co.jp"}, "author": "Internal Submission", "title": "160000 Nintendo game accounts may have been hacked - The Japan Times", "description": "Birthdays, email addresses and other information of the account holders for game consoles such as Wii U and Nintendo 3DS online, could have been viewed.", "url": "https://www.japantimes.co.jp/news/2020/04/25/business/tech/160000-nintendo-game-accounts-hacked/", "urlToImage": null, "publishedAt": "2020-04-25T01:10:00Z", "content": "Nintendo Co. has said that about 160,000 accounts for its home video game networking service may have been hit by an unauthorized login.\r\nBirthdays, email addresses and other information of the account holders for game consoles such as Wii U and Nintendo 3DS … [+583 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "T-Mobile confirms it's going to brick 5G on most Sprint 5G phones post-merger - Android Police", "description": "T-Mobile will shut down Sprint's 5G network in order to rework its spectrum into its own 5G grid. While those with a Galaxy S20 series device on Sprint", "url": "https://www.androidpolice.com/2020/04/24/t-mobile-confirms-its-going-to-brick-5g-on-most-sprint-5g-phones-post-merger/", "urlToImage": null, "publishedAt": "2020-04-24T21:06:31Z", "content": "This story was originally published 2020/04/22 11:47am PDTon Apr 22, 2020 and last updated 2020/04/24 1:56pm PDTApr 24, 2020. \r\nT-Mobile will shut down Sprint's 5G network in order to rework its spectrum into its own 5G grid. While those with a Galaxy S20 ser… [+3283 chars]"}, {"source": {"id": null, "name": "Extremetech.com"}, "author": "Ryan Whitwam", "title": "NASA JPL Engineers Design COVID-19 Ventilator in 37 Days - ExtremeTech", "description": "The unprecedented coronavirus pandemic has left many hospitals without enough ventilators, but companies like Tesla are trying to design new, easily built machines. Now, scientists from NASA's Jet Propulsion Laboratory (JPL) have created their own ventilator …", "url": "https://www.extremetech.com/extreme/309751-nasa-jpl-engineers-design-covid-19-ventilator-in-37-days", "urlToImage": null, "publishedAt": "2020-04-24T18:43:21Z", "content": "The unprecedented coronavirus pandemic has left many hospitals without enough ventilators, but companies like Tesla are trying to design new, easily built machines. Now, scientists from NASA’s Jet Propulsion Laboratory (JPL) have created their own ventilator … [+2209 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Sky Chadde and Kyle Bagenstose", "title": "USDA let poultry plants put workers close together even as they got sick from coronavirus. - USA TODAY", "description": "The USDA lets some poultry plants crowd lines to work faster. USA TODAY found coronavirus cases at more than one in ten of those plants.", "url": "https://www.usatoday.com/story/news/2020/04/24/usda-let-poultry-plants-move-faster-crowd-lines-covid-coronavirus-spread-meat-packing-workers/3013615001/", "urlToImage": null, "publishedAt": "2020-04-24T18:06:41Z", "content": "As coronavirus cases mounted at meatpacking plants this month, the federal government granted 15 poultry processors waivers to cut chickens faster, usually by crowding more workers onto their production lines. \r\nOverall, poultry plants with such waivers are a… [+5840 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Lydia Smith", "title": "Sunlight Kills Coronavirus Quickly, Says Top DHS Scientist - Newsweek", "description": "The research did not specify the intensity and wavelength of the UV light used in the experiment—and it's also not known whether the sunlight imitated the actual natural sunlight during the summer.", "url": "https://www.newsweek.com/sunlight-kills-coronavirus-scientist-1500012", "urlToImage": null, "publishedAt": "2020-04-24T14:35:21Z", "content": "Coronavirus can be destroyed by ultraviolet rays from the sun, a top U.S. scientist announced at a briefing from the White House coronavirus task force Thursday. William Bryan, science and technology advisor to the Department of Homeland Security (DHS) secret… [+6273 chars]"}]}