{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": "David Gaffen", "title": "When oil became waste: a week of turmoil for crude, and more pain to come - Reuters", "description": "The magnitude of how damaged the energy industry is came into full view on April 20 when the benchmark price of U.S. oil futures , which had never dropped below $10 a barrel in its nearly 40-year history, plunged to a previously unthinkable minus $38 a barrel.", "url": "https://www.reuters.com/article/us-global-oil-turmoil-idUSKCN228059", "urlToImage": null, "publishedAt": "2020-04-26T05:17:48Z", "content": "(Reuters) - The magnitude of how damaged the energy industry is came into full view on April 20 when the benchmark price of U.S. oil futures CLc1, which had never dropped below $10 a barrel in its nearly 40-year history, plunged to a previously unthinkable mi… [+5183 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Mel Kiper Jr.", "title": "2020 NFL draft grades: Kiper on all 32 classes, best picks and sleepers - ESPN", "description": "The Cowboys went best player available. The Packers surprised everyone. The Redskins got a gimme. Mel Kiper evaluates every team's draft class.", "url": "https://www.espn.com/nfl/draft2020/insider/story/_/id/29056681/2020-nfl-draft-grades-mel-kiper-all-32-classes-best-picks-steals-sleepers", "urlToImage": null, "publishedAt": "2020-04-26T04:40:37Z", "content": "The 2020 NFL draft is in the books, and it was ... interesting. Green Bay surprised everyone with a quarterback in Round 1, while Philadelphia did the same thing in Round 2. On Day 3, I was surprised that quarterbacks Jacob Eason and Jake Fromm were still ava… [+4608 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Rob Bailey-Millado", "title": "Brad Pitt channels Dr. Anthony Fauci for 'SNL' virtual cold open - New York Post ", "description": "Brad Pitt brought some red-hot star quality to the cold open of “Saturday Night Live … At Home.”", "url": "https://nypost.com/2020/04/26/brad-pitt-channels-dr-anthony-fauci-for-snl-cold-open/", "urlToImage": null, "publishedAt": "2020-04-26T04:12:59Z", "content": "Brad Pitt brought some red-hot star quality to the cold open of “Saturday Night Live … At Home.”\r\nThe “Once Upon a Time … in Hollywood” Oscar winner donned a silver wig to play White House coronavirus task force advisor, Dr. Anthony Fauci, ruminating on Presi… [+1186 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": null, "title": "Satellite imagery finds likely Kim Jong Un train amid health rumors - USA TODAY", "description": "The satellite photos released by 38 North, a website specializing in North Korea studies, don’t say anything about Kim’s potential health problems.", "url": "https://www.usatoday.com/story/news/world/2020/04/25/kim-jong-uns-train-seen-satellite-imagery-amid-health-rumors/3029122001/", "urlToImage": null, "publishedAt": "2020-04-26T03:46:48Z", "content": "North Korean leader Kim Jong Un attends a politburo meeting of the ruling Workers' Party of Korea on April 11 in Pyongyang.\r\n (Photo: KCNA)\r\nSEOUL, South Korea A train likely belonging to North Korean leader Kim Jong Un has been parked at his compound on the … [+5075 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: New York to allow tests in pharmacies - BBC News", "description": "Testing remains a key problem across the US but some states have started to lift restrictions.", "url": "https://www.bbc.co.uk/news/world-us-canada-52428994", "urlToImage": null, "publishedAt": "2020-04-26T03:42:46Z", "content": "Image copyrightEPAImage caption\r\n New York's governor says the goal is to provide 40,000 tests per day\r\nThe US state of New York, the epicentre of the country's Covid-19 outbreak, will allow pharmacies to carry out tests for the virus, the governor says.\r\nAnd… [+2518 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Anita Bennett", "title": "Trump Threatens To End Daily White House Coronavirus Briefings Over “Hostile Questions” - Deadline", "description": "President Donald Trump is threatening to stop the daily White House coronavirus briefings — not because of public outcry over his comments about injecting disinfectants, or because his statements are being used against him in Joe Biden attack ads — but becaus…", "url": "https://deadline.com/2020/04/trump-threatens-to-end-daily-white-house-coronavirus-briefings-1202917989/", "urlToImage": null, "publishedAt": "2020-04-26T03:15:58Z", "content": "President Donald Trump is threatening to stop the daily White Housecoronavirus briefings — not because of public outcry over his comments about injecting disinfectants, or because his statements are being used against him in Joe Biden attack ads — but because… [+2797 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Dan Heching For Dailymail.com", "title": "Katherine Schwarzenegger goes on a bike ride with husband Chris Pratt as it's learned she's pregnant - Daily Mail", "description": "It's already been an eventful weekend for Katherine Schwarzenegger and Chris Pratt, as news broke on Saturday that the couple are expecting their first baby together.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8257317/Katherine-Schwarzenegger-goes-bike-ride-husband-Chris-Pratt-learned-shes-pregnant.html", "urlToImage": null, "publishedAt": "2020-04-26T03:12:07Z", "content": "It's been an eventful weekend for Katherine Schwarzenegger and Chris Pratt, as news broke on Saturday that the couple are expecting their first baby together.\r\nAnd earlier that day, the 30-year-old daughter of Arnold Schwarzenegger and Maria Shriver took a ge… [+3815 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "'Battlefield V' will get one last standalone update this summer - Engadget", "description": "'Battlefield V' is winding down with a final standalone update that should arrive in June.", "url": "https://www.engadget.com/battlefield-v-last-update-in-summer-013240631.html", "urlToImage": null, "publishedAt": "2020-04-26T02:32:34Z", "content": "DICE and EA are bringing Battlefield V’s steady stream of updates to a close. The developers have announced (via Rock Paper Shotgun) that there will be one last standalone update to the WWII shooter this summer. It’s not clear what the update will contain bes… [+391 chars]"}, {"source": {"id": null, "name": "Buffalonews.com"}, "author": null, "title": "Even Jake Fromm was puzzled why Bills selected him, but he gets to prove himself now - Buffalo News", "description": "When general manager Brandon Beane called Jake Fromm Saturday to inform him he was the Bills' fifth-round choice, the former Georgia QB was", "url": "https://buffalonews.com/2020/04/25/buffalo-bills-jake-fromm-josh-allen-brandon-beane-nfl-draft-vic-carucci-football/", "urlToImage": null, "publishedAt": "2020-04-26T02:14:23Z", "content": "This is how unexpected the Buffalo Bills' drafting of a quarterback was.\r\nWhen general manager Brandon Beane called Jake Fromm Saturday to inform him he was the Bills' fifth-round choice, the former Georgia QB was more than a little skeptical.\r\n\"I thought it … [+6117 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Christine Wang", "title": "Coronavirus live updates: Singapore reports 618 new cases, Boris Johnson to return to work Monday - CNBC", "description": "The report marks the second day in a row that Singapore's daily new cases were less than 1,000.", "url": "https://www.cnbc.com/2020/04/26/coronavirus-live-updates.html", "urlToImage": null, "publishedAt": "2020-04-26T01:51:52Z", "content": "This is CNBC's live blog covering all the latest news on the coronavirus outbreak. This blog will be updated throughout the day as the news breaks.\r\n<ul><li>Global cases: More than 2.8 million</li><li>Global deaths: At least 202,668</li><li>Most cases reporte… [+4444 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Stephanie Armour, Rebecca Ballhaus", "title": "White House in Talks to Replace Health and Human Services Secretary Alex Azar - The Wall Street Journal", "description": "Discussions follow criticism of his handling of the Trump administration’s early response to the coronavirus pandemic", "url": "https://www.wsj.com/articles/white-house-in-talks-to-replace-health-and-human-services-secretary-alex-azar-11587860458", "urlToImage": null, "publishedAt": "2020-04-26T00:55:15Z", "content": "Administration officials are discussing replacing Health and Human Services Secretary Alex Azar following criticism of his management of the early response to the coronavirus pandemic, according to six people familiar with the discussions.\r\nIt remains unclear… [+276 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Baltimore Ravens pull off a GREAT draft | 2020 NFL Draft | CBS Sports HQ - CBS Sports", "description": "Following a culture shifting season in Baltimore, the Ravens used their draft picks to surround reigning MVP Lamar Jackson with immediate help on both sides ...", "url": "https://www.youtube.com/watch?v=DRzupfxpEgA", "urlToImage": null, "publishedAt": "2020-04-26T00:23:53Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Scott McDonald", "title": "Michigan State Senator Apologizes for Wearing Mask That Suggests Confederate Symbol - Newsweek", "description": "\"I'm sorry for my choice of pattern on the face mask I wore yesterday on the Senate floor. I did not intend to offend anyone,\" State Senator Dale Zorn tweeted Saturday.", "url": "https://www.newsweek.com/michigan-state-senator-apologizes-wearing-mask-that-suggests-confederate-symbol-1500248", "urlToImage": null, "publishedAt": "2020-04-26T00:20:04Z", "content": "A Michigan state senator who wore a protective face mask that appears to resemble the Confederate flag has since apologized, saying he had no intentions to offend anyone.\r\nState Senator Dale Zorn, a Republican who represents Ida Township in the southeastern p… [+3012 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Nick Bromberg", "title": "2020 NFL draft: LSU ties Ohio State's record with 14 NFL draft picks - Yahoo Sports", "description": "Somewhat surprisingly, none of the 14 LSU players taken in the draft was TE Thaddeus Moss.", "url": "https://sports.yahoo.com/lsu-ties-ohio-states-record-with-14-nfl-draft-picks-231230327.html", "urlToImage": null, "publishedAt": "2020-04-25T23:12:00Z", "content": "LSU dominated the 2020 NFL draft much like it did the 2019 college football season.\r\nThe Tigers tied a seven-round NFL draft record with 14 draft picks over Thursday, Friday and Saturday. Tight end Stephen Sullivan was the 14th Tiger taken when he was drafted… [+2000 chars]"}, {"source": {"id": null, "name": "Sfgate.com"}, "author": "Hearst Television", "title": "National coronavirus updates: FDA authorizes three more antibody tests - SF Gate", "description": "The latest:", "url": "https://www.sfgate.com/news/article/National-coronavirus-updates-US-death-toll-15225716.php", "urlToImage": null, "publishedAt": "2020-04-25T22:44:00Z", "content": "National coronavirus updates: Auto workers step up to make medical gear\r\nThe latest:\r\n<ul><li>There have been more than 939,000 coronavirus cases in the United States, according to the Johns Hopkins University tally.</li><li>The U.S. death toll has surpassed … [+10255 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Holly Bailey", "title": "In Wisconsin, protesters attack stay-at-home orders as unnecessary — or a government cabal - The Washington Post", "description": "", "url": "https://www.washingtonpost.com/politics/2020/04/25/wisconsin-protestors-attack-stay-at-home-orders-unnecessary-or-government-cabal/", "urlToImage": null, "publishedAt": "2020-04-25T21:53:00Z", "content": "What has not been fine, she said, is what has happened to her family in the past month. Most of her children and grandchildren work in the service industry, including in salons and restaurants, and all had been laid off several weeks ago as Wisconsin ordered … [+9008 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Mike Wall", "title": "Big asteroid shows itself ahead of Earth flyby on April 29 - Livescience.com", "description": "We have nothing to fear from 1998 OR2.", "url": "https://www.livescience.com/asteroid-1998-or2-photo-april-2020-flyby.html", "urlToImage": null, "publishedAt": "2020-04-25T21:40:00Z", "content": "We've now got a good visual on the big space rock that's going to fly by Earth next week.\r\nOn Saturday (April 18), the Arecibo Observatory\r\n in Puerto Rico captured a radar image of the asteroid 1998 OR2, which will zoom within 3.9 million miles (6.3 million … [+2360 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Colby Itkowitz", "title": "Republican strategy memo advises GOP campaigns to blame China for coronavirus - The Washington Post", "description": "‘Don’t defend Trump,’ the memo says. ‘Attack China.’", "url": "https://www.washingtonpost.com/politics/2020/04/25/senate-gop-talking-points-coronavirus-blame-china-not-trump/", "urlToImage": null, "publishedAt": "2020-04-25T21:31:51Z", "content": "If asked whether Trump is at fault for the nations unpreparedness as the virus spread, the candidates are told, dont defend Trump, other than the China Travel Ban attack China, according to the memo, a copy of which was obtained by The Washington Post. The me… [+3721 chars]"}, {"source": {"id": null, "name": "Newser.com"}, "author": "Neal Colgrass", "title": "World-Health Body Slams 'an Extremely Bad Idea' - Newser", "description": "The World Health Organization is not on board", "url": "https://www.newser.com/story/290056/who-has-something-to-say-about-immunity-passports.html", "urlToImage": null, "publishedAt": "2020-04-25T21:30:00Z", "content": "(Newser)\r\nCoronavirus survivors may not be getting \"immunity passports\" after all. The idea—which has gained some ground in Europe—is that passport holders would be immune to COVID-19 and able to re-enter society. But the World Health Organization warned Frid… [+1268 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "Lou Whiteman", "title": "Boeing Abandons $4 Billion Embraer Deal: What It Means for Boeing Stock - Motley Fool", "description": "The good and the bad concerning Boeing's decision to bail on Embraer.", "url": "https://www.fool.com/investing/2020/04/25/boeing-abandons-4-billion-embraer-deal-what-it-mea.aspx", "urlToImage": null, "publishedAt": "2020-04-25T20:30:00Z", "content": "On Saturday, Boeing(NYSE:BA) terminated a $4 billion deal that would have given it controlling of the commercial aerospace operations of Embraer(NYSE:ERJ) after a Friday night deadline came and passed without the two sides ironing out final details.\r\nIn press… [+5558 chars]"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Jim Asker", "title": "Following the Passing of Harold Reid, A Look at the Statler Brothers’ Biggest Billboard Hits - Billboard", "description": "The baritone served as the group’s foundation for more than four decades.", "url": "https://www.billboard.com/articles/business/chart-beat/9365978/statler-brothers-biggest-hits", "urlToImage": null, "publishedAt": "2020-04-25T20:25:22Z", "content": "Following a long battle with kidney failure, Harold Reid, a founding member of The Statler Brothers, died on Friday (April 24) in his hometown Staunton, Va. He was 80.\r\nStaunton was the home base for the group, which initially worked as a gospel group, since … [+2644 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Anita Bennett", "title": "President Donald Trump Tweetstorm – The Saturday Edition - Deadline", "description": "President Donald Trump has taken aim at the Wall Street Journal for a Friday editorial saying he is “piling on” Georgia Gov. Brian Kemp for reopening the state for business, after earlier calling on governors to do just that. The paper’s editorial board calle…", "url": "https://deadline.com/2020/04/president-donald-trump-tweetstorm-the-saturday-edition-70-1202917870/", "urlToImage": null, "publishedAt": "2020-04-25T20:19:14Z", "content": "President Donald Trump has taken aim at the Wall Street Journal for a Friday editorial saying he is “piling on” Georgia Gov. Brian Kemp for reopening the state for business, after earlier calling on governors to do just that.\r\nThe paper’s editorial board call… [+2931 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "J. Edward Moreno", "title": "Global death toll from coronavirus reaches over 200,000 | TheHill - The Hill", "description": "More than 200,000 people worldwide have been reported dead as a result of the coronavirus pandemic, according to a tally by Johns Hopkins University.", "url": "https://thehill.com/homenews/news/494667-global-death-toll-from-coronavirus-reaches-over-200000", "urlToImage": null, "publishedAt": "2020-04-25T20:04:08Z", "content": "More than 200,000 people worldwide have been reported dead as a result of the coronavirus pandemic, according to a tally by Johns Hopkins University.\r\nAs of Saturday afternoon, 2.8 million people have tested positive for the virus globally. The death toll is … [+1681 chars]"}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "Mike Isaac & Sheera Frenkel | NYT", "title": "Zooms sudden popularity sets off scramble in rivals - Business Standard", "description": "Facebook, Google and other behemoths are training their sights on Silicon Valley's company of the moment", "url": "https://www.business-standard.com/article/international/zoom-s-sudden-popularity-sets-off-scramble-in-rivals-120042600008_1.html", "urlToImage": null, "publishedAt": "2020-04-25T19:28:16Z", "content": "As people turned in droves to the video chatting app Zoom in recent weeks, the buzz caught Facebook’s attention. Inside the social network, that immediately set off a scramble.\r\nMark Zuckerberg, Facebook’s chief executive, ordered employees to ramp up and foc… [+4014 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Sergei Klebnikov", "title": "Icahn Sees Further Market Crash From Coronavirus, Says He’s Shorting Commercial Real Estate - Forbes", "description": "The billionaire investor said he isn’t buying stocks right now.", "url": "https://www.forbes.com/sites/sergeiklebnikov/2020/04/25/icahn-sees-further-market-crash-from-coronavirus-says-hes-shorting-commercial-real-estate/", "urlToImage": null, "publishedAt": "2020-04-25T19:08:58Z", "content": "One of Wall Streets most successful investors, billionaire Carl Icahn, warned in a recent interview with Bloomberg that stocks are overvalued, and although there will be good opportunities to buy, he expects that the coronavirus will lead to a further market … [+3210 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Alison DeNisco Rayome", "title": "Facebook Messenger Rooms: How to use the free Zoom video chat competitor - CNET", "description": "Up to 50 people can chat in a room at once, with no time limit.", "url": "https://www.cnet.com/how-to/facebook-messenger-rooms-how-to-use-the-free-zoom-video-chat-competitor/", "urlToImage": null, "publishedAt": "2020-04-25T18:43:15Z", "content": "Facebook Messenger Rooms is set to compete with Zoom and other group video chat apps.\r\nFacebook\r\nFacebook is getting in on the group-video-chat game with a new feature called Messenger Rooms, which seems set to compete with services like Zoom, Skype and Micro… [+2907 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Canada's worst mass shooting began with argument between gunman, his girlfriend - The Times of Israel", "description": "Assault by the suspect on his girlfriend ended with 22 people dead in communities across central and northern Nova Scotia", "url": "https://www.timesofisrael.com/canadas-worst-mass-shooting-began-with-argument-between-gunman-his-girlfriend/", "urlToImage": null, "publishedAt": "2020-04-25T17:51:00Z", "content": "TORONTO (AP) Canadas worst mass shooting erupted from an argument between the gunman and his girlfriend, who survived the attack, police confirmed Friday.\r\nRoyal Canadian Mounted Police Supt. Darren Campbell said the weekend shooting rampage started with an a… [+5673 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Benjamin Fearnow", "title": "Nearly Three-Quarters of Single Democrats Won't Date Trump Voters, Survey Finds - Newsweek", "description": "Seventy-one percent of single Democratic Party voters said they are very unlikely to even consider dating a person who voted for Republican Donald Trump in the 2016 presidential election.", "url": "https://www.newsweek.com/nearly-three-quarters-single-democrats-wont-date-trump-voters-survey-finds-1500225", "urlToImage": null, "publishedAt": "2020-04-25T17:06:47Z", "content": "Seventy-one percent of single Democratic Party voters said they are very unlikely to even consider dating a person who voted for Republican Donald Trump in the 2016 presidential election, a new survey finds.\r\nThe Pew Research Center study revealed the country… [+2661 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "https://www.facebook.com/profile.php?id=100034991436602", "title": "Massive Discount: Microsoft's Surface Laptop 2 is $699 cheaper today - MSPoweruser - MSPoweruser", "description": "If you’re on the lookout for a light and premium Windows 10 PC, Surface Laptop 2 deserves your attention. The Laptop 2 is also $699 cheaper today, so it’s now even easier to recommend. Microsoft  Surface Laptop 2 (Intel Core i7, 16GB RAM, 1TB) is now availabl…", "url": "https://mspoweruser.com/huge-discount-on-surface-laptop-2-at-amazon/", "urlToImage": null, "publishedAt": "2020-04-25T17:00:50Z", "content": "If you’re on the lookout for a light and premium Windows 10 PC, Surface Laptop 2 deserves your attention. The Laptop 2 is also $699 cheaper today, so it’s now even easier to recommend.\r\nMicrosoft  Surface Laptop 2 (Intel Core i7, 16GB RAM, 1TB) is now availab… [+1099 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Bruce Haring", "title": "Georgia Cautiously Reopens, Californians Defy Beach Ban As Temperatures Soar - Deadline", "description": "Even as Georgia became the first state to officially reopen some of its businesses, increasingly restive California residents defied lockdown orders to head to the beaches as temperatures hit the 90s. California Gov. Gavin Newsom pleaded for social distancing…", "url": "https://deadline.com/2020/04/georgia-cautiously-reopens-californians-defy-beach-ban-1202917827/", "urlToImage": null, "publishedAt": "2020-04-25T16:37:14Z", "content": "Even as Georgia became the first state to officially reopen some of its businesses, increasingly restive California residents defied lockdown orders to head to the beaches as temperatures hit the 90s.\r\nCalifornia Gov. Gavin Newsom pleaded for social distancin… [+1250 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "Daniel Miller", "title": "The Auto Industry's Ticking Time Bomb: How Plunging Used Car Prices Could Devastate Automakers - Motley Fool", "description": "How in the world could lower used car prices be such a huge hindrance to automakers that primarily sell new vehicles?", "url": "https://www.fool.com/investing/2020/04/25/the-auto-industrys-ticking-timebomb-how-plunging-u.aspx", "urlToImage": null, "publishedAt": "2020-04-25T16:24:00Z", "content": "It only takes a few minutes of skimming headlines and articles covering the automotive industry to turn a smile upside down. Major manufacturing plants from automakers such as Ford(NYSE:F) and General Motors(NYSE:GM) have halted vehicle production, and analys… [+4730 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Scott Mendelson", "title": "Did ‘Spider-Man 3’ Spoil Marvel’s Post-‘Avengers: Endgame’ Plans? - Forbes", "description": "Thanks to 'Spider-Man 3,' 'Doctor Strange 2' may open out of order. 'Thor 4,' 'Doctor Strange 2,' 'Black Panther 2' and 'Captain Marvel 2' will open almost concurrently in 2022.", "url": "https://www.forbes.com/sites/scottmendelson/2020/04/25/spider-man-3-delay-puts-a-wrinkle-in-marvels-post-avengers-endgame-plans-for-thor-and-doctor-strange/", "urlToImage": null, "publishedAt": "2020-04-25T16:05:17Z", "content": "posters from 'Doctor Strange,' 'Spider-Man Far from Home' and 'Thor Ragnarok'\r\nWalt Disney and Marvel\r\nA date change for Sonys untitled third Spider-Man movie leaves Doctor Strange in the Multiverse of Madness opening out of order and results in Thor 4, Docto… [+7355 chars]"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "Staff", "title": "WHO says ‘no evidence’ that recovered COVID-19 patients cannot be re-infected - Global News", "description": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.", "url": "http://globalnews.ca/news/6867902/coronavirus-who-patients-reinfected/", "urlToImage": null, "publishedAt": "2020-04-25T13:43:33Z", "content": "The World Health Organization (WHO) said on Saturday that there was currently “no evidence” that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nIn a scientific brief, the United Nations agency w… [+1913 chars]"}, {"source": {"id": null, "name": "Interestingengineering.com"}, "author": "Loukia Papadopoulos", "title": "SpaceX Completes Falcon 9 Static Fire Test - Interesting Engineering", "description": "The test comes on the heels of another successful static fire test earlier this week.", "url": "https://interestingengineering.com/spacex-successfully-completes-falcon-9-static-fire-test", "urlToImage": null, "publishedAt": "2020-04-25T13:33:43Z", "content": "Preparations for Crew Dragon’s first operational mission seems to be going well. SpaceX's rocket development facility in McGregor, Texas, announced on Saturday that it successfully completed a static fire test of the Falcon 9 first stage that will launch the … [+1718 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew May", "title": "Celebrating 30 years of the Hubble Space Telescope - Space.com", "description": "Celebrating three decades of an icon of science — and a triumph of technology.", "url": "https://www.space.com/hubble-space-telescope-turns-30.html", "urlToImage": null, "publishedAt": "2020-04-25T12:43:31Z", "content": "It's been 30 years since NASA launched the Hubble Space Telescope on April 24, 1990. The observatory was carried aloft in the payload bay of space shuttle Discovery, and for three decades Hubble's history was closely intertwined with the shuttle's. The telesc… [+8383 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "Success against malaria gives solutions for COVID-19 - The Jakarta Post - Jakarta Post", "description": "Today is World Malaria Day, a day when we remind ourselves of a disease that has killed more people in history than any other.", "url": "https://www.thejakartapost.com/academia/2020/04/25/success-against-malaria-gives-solutions-for-covid-19.html", "urlToImage": null, "publishedAt": "2020-04-25T04:56:00Z", "content": "Today is World Malaria Day, a day when we remind ourselves of a disease that has killed more people in history than any other.\r\nAs the world is focused on bringing the deadly COVID-19 pandemic under control, reflecting on the progress made in the fight agains… [+4107 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How a phone app triggered an international manhunt for the killer of a U.S. college student - CBS News", "description": "Roommates of Binghamton University nursing student Haley Anderson became concerned over her whereabouts due to her silence on social media in 2018. They soon...", "url": "https://www.youtube.com/watch?v=baJJATAEKI0", "urlToImage": null, "publishedAt": "2020-04-24T18:36:34Z", "content": null}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}]}