{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Derek Hawkins, Shibani Mahtani, Timothy Bella", "title": "Live updates: As deaths surpass 200,000 worldwide, WHO says no evidence recovery prevents second coronavirus infection - The Washington Post", "description": "Anthony S. Fauci — the infectious diseases expert helping to steer the White House’s coronavirus response — said that the United States should double the number of coronavirus tests it’s performing in the next several weeks, and has the capacity to do so.", "url": "https://www.washingtonpost.com/world/2020/04/26/coronavirus-latest-news/", "urlToImage": null, "publishedAt": "2020-04-26T04:20:46Z", "content": "Potbelly announced on Saturday that it was returning its $10 million small-business loan to the federal government, joining a slew of large companies to give back coronavirus funding.\r\nThe sandwich chain, which received the maximum loan amount under the Payro… [+1371 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Rob Bailey-Millado", "title": "Brad Pitt channels Dr. Anthony Fauci for 'SNL' virtual cold open - New York Post ", "description": "Brad Pitt brought some red-hot star quality to the cold open of “Saturday Night Live … At Home.”", "url": "https://nypost.com/2020/04/26/brad-pitt-channels-dr-anthony-fauci-for-snl-cold-open/", "urlToImage": null, "publishedAt": "2020-04-26T04:12:59Z", "content": "Brad Pitt brought some red-hot star quality to the cold open of “Saturday Night Live … At Home.”\r\nThe “Once Upon a Time … in Hollywood” Oscar winner donned a silver wig to play White House coronavirus task force advisor, Dr. Anthony Fauci, ruminating on Presi… [+1186 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Chad Reuter", "title": "Final quick-snap draft grades for all 32 teams - NFL.com", "description": "With the 2020 NFL Draft in the books, Chad Reuter reveals his final quick-snap grades for all 32 teams. Did the Cowboys clean up with an ideal haul? Did the Packers miss the mark?", "url": "http://www.nfl.com/news/story/0ap3000001111711/article/2020-nfl-draft-final-quicksnap-grades-for-all-32-teams", "urlToImage": null, "publishedAt": "2020-04-26T02:58:00Z", "content": "I've heard the argument that grading draft picks immediately after they are made is worthless, but I don't agree.\r\nSince no one can see into the future, these 2020 NFL Draft quick-snap grades only partially reflect how I expect a player's career to progress. … [+37601 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Rob Demovsky", "title": "Packers coach Matt LaFleur says clock not ticking on Aaron Rodgers - ESPN", "description": "Coach Matt LaFleur said he hopes Aaron Rodgers remains the Packers' leader for a \"really long time.\"", "url": "https://www.espn.com/nfl/story/_/id/29099952/packers-coach-matt-lafleur-says-clock-not-ticking-aaron-rodgers", "urlToImage": null, "publishedAt": "2020-04-26T02:53:01Z", "content": "GREEN BAY, Wis. -- If drafting Jordan Love started the clock on Aaron Rodgers' career with the Green Bay Packers, coach Matt LaFleur tried to make it sound like time would move slowly.\r\nIn his first comments since the Packers traded up to the No. 26 pick in t… [+3694 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Connie Liou", "title": "'The Bachelorette': Clare Crawley Gets Real About Her Contestants Who Are There for the Wrong Reasons - Showbiz Cheat Sheet", "description": "'The Bachelorette's Clare Crawley calls out her cast on Twitter and Bachelor Nation fans predict she was addressing Matt James.", "url": "https://www.cheatsheet.com/entertainment/bachelorette-clare-crawley-twitter-matt-james.html/", "urlToImage": null, "publishedAt": "2020-04-26T02:05:25Z", "content": "When Clare Crawley was cast as the next bachelorette, Bachelor Nation fans rejoiced. Over the past few years, many fans have called out the ABC reality franchise for rewarding Instagram influencers over genuine romance. And ever since she first appeared on Ju… [+4074 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Christine Wang", "title": "Coronavirus live updates: Singapore reports 618 new cases, Boris Johnson to return to work Monday - CNBC", "description": "The report marks the second day in a row that Singapore's daily new cases were less than 1,000.", "url": "https://www.cnbc.com/2020/04/26/coronavirus-live-updates.html", "urlToImage": null, "publishedAt": "2020-04-26T01:51:52Z", "content": "This is CNBC's live blog covering all the latest news on the coronavirus outbreak. This blog will be updated throughout the day as the news breaks.\r\n<ul><li>Global cases: More than 2.8 million</li><li>Global deaths: At least 202,668</li><li>Most cases reporte… [+4444 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Reuters", "title": "Kim Jong-un's train possibly spotted at North Korean resort - The Guardian", "description": "As rumours persist that ruler is in poor health, satellite images emerge showing train parked at Wonsan’s ‘leadership station’", "url": "https://www.theguardian.com/world/2020/apr/26/kim-jong-uns-train-possibly-spotted-at-north-korean-resort", "urlToImage": null, "publishedAt": "2020-04-26T01:26:32Z", "content": "A special train possibly belonging to the North Korean ruler, Kim Jong-un, has been spotted at a resort town, according to satellite images reviewed by a Washington-based North Korea monitoring project, amid conflicting reports about Kims health and whereabou… [+4255 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Kevin Baxter, Alex Wigglesworth", "title": "Ventura and Orange County beaches fill up as people seek relief from the heat and weeks of staying home - Los Angeles Times", "description": "Coronavirus: Beaches fill up as people seek relief from heat, weeks of staying at home", "url": "https://www.latimes.com/california/story/2020-04-25/beaches-fill-up-as-people-seek-relief-from-heat-weeks-of-staying-at-home", "urlToImage": null, "publishedAt": "2020-04-26T01:14:47Z", "content": "Ventura and Orange county beaches that were open Saturday drew big crowds hoping to cool off and enjoy the views.\r\nOfficials reported few incidents and said people were doing their best to social distance.\r\nIn Ventura, the opening of city and state beaches br… [+3477 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maeve Reston, CNN", "title": "Georgia starts to reopen but nervous mayors warn that coronavirus crisis isn't over - CNN", "description": "Georgia on Friday became one of the first states to experiment with easing its stay-at-home restrictions and concerned mayors from across the state pointed to the rise in coronavirus cases in their cities -- both urban and rural -- as evidence it's too soon t…", "url": "https://www.cnn.com/2020/04/25/politics/georgia-reopening-rural-urban-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-26T00:55:01Z", "content": "(CNN)Georgia on Friday became one of the first states to experiment with easing its stay-at-home restrictions and concerned mayors from across the state pointed to the rise in coronavirus cases in their cities -- both urban and rural -- as evidence it's too s… [+8886 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": null, "title": "White House weighing plan to replace Azar - POLITICO", "description": "Among the candidates to take over as HHS secretary is coronavirus coordinator Deborah Birx, according to people familiar with the talks.", "url": "https://www.politico.com/news/2020/04/25/white-house-replace-alex-azar-208151", "urlToImage": null, "publishedAt": "2020-04-26T00:29:47Z", "content": "The Department of Health and Human Services, under the leadership of Secretary Azar, continues to lead on a number of the Presidents priorities. Any speculation about personnel is irresponsible and a distraction from our whole-of-government response to COVID-… [+4828 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Baltimore Ravens pull off a GREAT draft | 2020 NFL Draft | CBS Sports HQ - CBS Sports", "description": "Following a culture shifting season in Baltimore, the Ravens used their draft picks to surround reigning MVP Lamar Jackson with immediate help on both sides ...", "url": "https://www.youtube.com/watch?v=DRzupfxpEgA", "urlToImage": null, "publishedAt": "2020-04-26T00:23:53Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Seung Min Kim", "title": "Tensions emerge between Republicans over coronavirus spending and how to rescue the economy - The Washington Post", "description": "A debate is stirring among Republicans about how substantial the package should be and whether concerns about debt are misplaced at a time of economic crisis when the government continues to be able to borrow at rock-bottom prices.", "url": "https://www.washingtonpost.com/politics/republicans-trump-coronavirus-spending-deficit-economy/2020/04/25/9013c5ee-8671-11ea-a3eb-e9fc93160703_story.html", "urlToImage": null, "publishedAt": "2020-04-25T22:39:07Z", "content": "As we start thinking down the road in future iterations, my hope would be that its more fine tuning what weve already done rather than taking on big, aggressive new initiatives that are paid for by additional debt, Senate Majority Whip John Thune (S.D.), the … [+8736 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Hannah Miller", "title": "Potbelly says it will return $10 million small business loan, following others after outrage - CNBC", "description": "Potbelly, which received the maximum loan amount, has a market cap of $71.2 million.", "url": "https://www.cnbc.com/2020/04/25/potbelly-to-return-10-million-ppp-loan-after-outrage.html", "urlToImage": null, "publishedAt": "2020-04-25T22:31:01Z", "content": "Potbelly said Saturday that it will return its $10 million loan from the Payroll Protection Program intended for small businesses, making it the latest notable name to return the funds. \r\nThe sandwich shop chain follows other large, public companies like Ruth… [+2087 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Sergei Klebnikov", "title": "These Stocks Will Thrive In A Post-Coronavirus World, According To Experts - Forbes", "description": "Here are 19 stocks that will benefit from new consumer trends once quarantine orders are lifted.", "url": "https://www.forbes.com/sites/sergeiklebnikov/2020/04/25/these-stocks-will-thrive-in-a-post-coronavirus-world-according-to-experts/", "urlToImage": null, "publishedAt": "2020-04-25T22:20:01Z", "content": "Despite the coronavirus pandemic causing unprecedented financial disruptions and a major shift in the lives of American consumers, a slowdown in new cases has made Wall Street more optimistic about eventually reopening the economy and here are 19 stocks poise… [+3491 chars]"}, {"source": {"id": null, "name": "Slate.com"}, "author": "Daniel Politi", "title": "Video Appears to Show Tara Reade’s Mother Knew of Allegations Against Biden in 1993 - Slate", "description": "A 1993 video appears to show Reade's mother calling the Larry King Show and mentioning \"problems\" she had while working for a \"prominent senator.\"", "url": "https://slate.com/news-and-politics/2020/04/video-tara-reade-mother-joe-biden-larry-king.html", "urlToImage": null, "publishedAt": "2020-04-25T22:12:05Z", "content": "Former Vice President Joe Biden is seen on stage as he and Senator Bernie Sanders take part in the 11th Democratic Party 2020 presidential debate in a CNN Washington Bureau studio in Washington, D.C. on March 15, 2020.\r\n<ol><li>\r\nSingapore Contained the Coron… [+5036 chars]"}, {"source": {"id": null, "name": "9news.com.au"}, "author": "9NEWS", "title": "'No evidence' having coronavirus gives sufferers immunity: World Health Organisation - 9News", "description": "<p>The World Health Organisation is warning that people who have had COVID-19 are not necessarily immune by the presence of antibodies from getting the virus again.</p>", "url": "https://www.9news.com.au/world/coronavirus-immunity-not-guaranteed-who-warns/65ea1b9f-17b4-4583-a789-f8af15a7a98a", "urlToImage": null, "publishedAt": "2020-04-25T21:09:09Z", "content": "Property News: How to create positive vibes with these mood-boosting interior tips - domain.com.au"}, {"source": {"id": null, "name": "Fool.com"}, "author": "Lou Whiteman", "title": "Boeing Abandons $4 Billion Embraer Deal: What It Means for Boeing Stock - Motley Fool", "description": "The good and the bad concerning Boeing's decision to bail on Embraer.", "url": "https://www.fool.com/investing/2020/04/25/boeing-abandons-4-billion-embraer-deal-what-it-mea.aspx", "urlToImage": null, "publishedAt": "2020-04-25T20:30:00Z", "content": "On Saturday, Boeing(NYSE:BA) terminated a $4 billion deal that would have given it controlling of the commercial aerospace operations of Embraer(NYSE:ERJ) after a Friday night deadline came and passed without the two sides ironing out final details.\r\nIn press… [+5558 chars]"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Jim Asker", "title": "Following the Passing of Harold Reid, A Look at the Statler Brothers’ Biggest Billboard Hits - Billboard", "description": "The baritone served as the group’s foundation for more than four decades.", "url": "https://www.billboard.com/articles/business/chart-beat/9365978/statler-brothers-biggest-hits", "urlToImage": null, "publishedAt": "2020-04-25T20:25:22Z", "content": "Following a long battle with kidney failure, Harold Reid, a founding member of The Statler Brothers, died on Friday (April 24) in his hometown Staunton, Va. He was 80.\r\nStaunton was the home base for the group, which initially worked as a gospel group, since … [+2644 chars]"}, {"source": {"id": null, "name": "Vox.com"}, "author": "Anya van Wagtendonk", "title": "Amid coronavirus concerns, New York and Kentucky allow everyone to vote by mail - Vox.com", "description": "Friday, the governors of New York and Kentucky signed executive orders expanding vote-by-mail access to ensure crowds won’t have to risk coronavirus to vote.", "url": "https://www.vox.com/covid-19-coronavirus-us-response-trump/2020/4/25/21236389/new-york-kentucky-expand-vote-by-mail-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T19:55:36Z", "content": "New York and Kentucky announced new programs on Friday aimed at improving access to mail-in ballots, as both states work to find ways to limit interaction at the polls during upcoming elections amid the Covid-19 pandemic.\r\nOn Friday, New York Gov. Andrew Cuom… [+5095 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Paulina Dedaj", "title": "49ers' Joe Staley announces NFL retirement after 13 seasons over health concerns - Fox News", "description": "Six-time Pro-Bowler and longtime offensive tackle for the San Francisco 49ers Joe Staley announced his retirement on Saturday shortly after the Niners acquired Trent Williams from the Washington Redskins.", "url": "https://www.foxnews.com/sports/49ers-joe-staley-announces-nfl-retirement-health-concerns", "urlToImage": null, "publishedAt": "2020-04-25T19:51:33Z", "content": "Six-time Pro-Bowler and longtime offensive tackle for the San Francisco 49ers Joe Staley announced his retirement on Saturday shortly after the Niners acquired Trent Williams from the Washington Redskins.\r\nWilliams was traded during the third day of the NFL D… [+1921 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Daniel Kreps", "title": "Live Nation Amends Ticket Refund Policy Following Criticism - Rolling Stone", "description": "\"Fans, we hear you. We don’t want you to be waiting in limbo while shows are being rescheduled,\" CEO Michael Rapino tweets", "url": "https://www.rollingstone.com/music/music-news/live-nation-tickermaster-refund-policy-990053/", "urlToImage": null, "publishedAt": "2020-04-25T19:31:14Z", "content": "Following continued criticism over their refund policies, Live Nation has amended its previously announced plan for concerts canceled or postponed by the coronavirus pandemic, the New York Times reported Saturday.\r\n“Fans, we hear you. We don’t want you to be … [+2553 chars]"}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "Mike Isaac & Sheera Frenkel | NYT", "title": "Zooms sudden popularity sets off scramble in rivals - Business Standard", "description": "Facebook, Google and other behemoths are training their sights on Silicon Valley's company of the moment", "url": "https://www.business-standard.com/article/international/zoom-s-sudden-popularity-sets-off-scramble-in-rivals-120042600008_1.html", "urlToImage": null, "publishedAt": "2020-04-25T19:28:16Z", "content": "As people turned in droves to the video chatting app Zoom in recent weeks, the buzz caught Facebook’s attention. Inside the social network, that immediately set off a scramble.\r\nMark Zuckerberg, Facebook’s chief executive, ordered employees to ramp up and foc… [+4014 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oliver Darcy, CNN Business", "title": "Trump goes into hiding - CNN", "description": "A version of this article first appeared in the \"Reliable Sources\" newsletter. You can sign up for free right here.", "url": "https://www.cnn.com/2020/04/25/media/trump-goes-into-hiding-reliable-sources/index.html", "urlToImage": null, "publishedAt": "2020-04-25T19:25:00Z", "content": null}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Alison DeNisco Rayome", "title": "Facebook Messenger Rooms: How to use the free Zoom video chat competitor - CNET", "description": "Up to 50 people can chat in a room at once, with no time limit.", "url": "https://www.cnet.com/how-to/facebook-messenger-rooms-how-to-use-the-free-zoom-video-chat-competitor/", "urlToImage": null, "publishedAt": "2020-04-25T18:43:15Z", "content": "Facebook Messenger Rooms is set to compete with Zoom and other group video chat apps.\r\nFacebook\r\nFacebook is getting in on the group-video-chat game with a new feature called Messenger Rooms, which seems set to compete with services like Zoom, Skype and Micro… [+2907 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Canada's worst mass shooting began with argument between gunman, his girlfriend - The Times of Israel", "description": "Assault by the suspect on his girlfriend ended with 22 people dead in communities across central and northern Nova Scotia", "url": "https://www.timesofisrael.com/canadas-worst-mass-shooting-began-with-argument-between-gunman-his-girlfriend/", "urlToImage": null, "publishedAt": "2020-04-25T17:51:00Z", "content": "TORONTO (AP) Canadas worst mass shooting erupted from an argument between the gunman and his girlfriend, who survived the attack, police confirmed Friday.\r\nRoyal Canadian Mounted Police Supt. Darren Campbell said the weekend shooting rampage started with an a… [+5673 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Best iPhone SE (2020) Cases + Accessories! - Dom Esposito", "description": "Top iPhone SE (2020) Cases & Accessories! Apple's iPhone SE 2 review is coming soon, but these are best iPhone SE (2020) accessories & cases. From the best i...", "url": "https://www.youtube.com/watch?v=fEJYa3mT2XM", "urlToImage": null, "publishedAt": "2020-04-25T17:20:52Z", "content": null}, {"source": {"id": null, "name": "Fool.com"}, "author": "Daniel Miller", "title": "The Auto Industry's Ticking Time Bomb: How Plunging Used Car Prices Could Devastate Automakers - Motley Fool", "description": "How in the world could lower used car prices be such a huge hindrance to automakers that primarily sell new vehicles?", "url": "https://www.fool.com/investing/2020/04/25/the-auto-industrys-ticking-timebomb-how-plunging-u.aspx", "urlToImage": null, "publishedAt": "2020-04-25T16:24:00Z", "content": "It only takes a few minutes of skimming headlines and articles covering the automotive industry to turn a smile upside down. Major manufacturing plants from automakers such as Ford(NYSE:F) and General Motors(NYSE:GM) have halted vehicle production, and analys… [+4730 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Colin Drury", "title": "Coronavirus: Nasa develops ventilator tailored for Covid-19 patients in just 37 days - The Independent", "description": "'We know how to land on the moon and Mars, but building a medical device is new'", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-nasa-ventilators-vital-design-a9484036.html", "urlToImage": null, "publishedAt": "2020-04-25T15:36:59Z", "content": "Engineers at NASA have developed a ventilator specifically designed to help coronavirus patients.\r\nThe VITAL system Ventilator Intervention Technology Accessible Locally was created in just 37 days, the space agency says.\r\nNow, it has already passed critical … [+21785 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "http://www.facebook.com/pages/wmpowerusercom/37708414657", "title": "Deal Alert: One-day deal can score you a Surface Book for only $479.99 - MSPoweruser - MSPoweruser", "description": "The Surface Book with its detachable base is still a very unique device, and today only you can score one for as little as $479.99 Woot is running a one-day sale on refurbished Surface Book laptops, with a range of models available. The laptops are all Micros…", "url": "https://mspoweruser.com/deal-alert-one-day-deal-can-score-you-a-surface-book-for-only-479-99/", "urlToImage": null, "publishedAt": "2020-04-25T14:21:18Z", "content": "You can now get a steep $290 discount on Surface Pro X bundle, which includes the Surface Pro X device, Signature Keyboard and the Slim Pen. Amazon is currently offering the Black Surface Pr...\r\nDeal Alert: Save up to $300 on Microsoft Surface Pro 7\r\nYou can … [+2253 chars]"}, {"source": {"id": null, "name": "Abs-cbn.com"}, "author": "Agence France-Presse", "title": "WHO: ‘No evidence’ that people who recovered from COVID-19 are immunized - ABS-CBN News", "description": "There is not enough evidence about the effectiveness of antibody-mediated immunity to guarantee the accuracy of an \"immunity passport\" or \"risk-free certificate.\"", "url": "https://news.abs-cbn.com/overseas/04/25/20/who-people-recovered-covid-19-immunized", "urlToImage": null, "publishedAt": "2020-04-25T13:52:00Z", "content": "The World Health Organization (WHO) warned on Saturday that there is no evidence that people who test positive for the new coronavirus are immunized and protected against reinfection.\r\nThe warning suggests that the issuance of \"immune passports\" may promote t… [+2075 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Tom Embury-Dennis", "title": "Coronavirus: New York sees spike in disinfectant exposure cases following Trump’s dangerous treatment musings - The Independent", "description": "US president’s false suggestions regarding use of cleaning agent widely condemned", "url": "https://www.independent.co.uk/news/world/americas/us-politics/coronavirus-trump-treatment-disinfectant-bleach-new-york-a9483786.html", "urlToImage": null, "publishedAt": "2020-04-25T13:34:06Z", "content": "New York revealed a spike in cases of disinfectant exposure in the 18 hours following Donald Trumps dangerous and false suggestion that injecting the cleaning agent could help treat coronavirus patients.\r\nThe citys Poison Control Centre managed 30 cases from … [+1893 chars]"}, {"source": {"id": null, "name": "Interestingengineering.com"}, "author": "Loukia Papadopoulos", "title": "SpaceX Completes Falcon 9 Static Fire Test - Interesting Engineering", "description": "The test comes on the heels of another successful static fire test earlier this week.", "url": "https://interestingengineering.com/spacex-successfully-completes-falcon-9-static-fire-test", "urlToImage": null, "publishedAt": "2020-04-25T13:33:43Z", "content": "Preparations for Crew Dragon’s first operational mission seems to be going well. SpaceX's rocket development facility in McGregor, Texas, announced on Saturday that it successfully completed a static fire test of the Falcon 9 first stage that will launch the … [+1718 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew May", "title": "Celebrating 30 years of the Hubble Space Telescope - Space.com", "description": "Celebrating three decades of an icon of science — and a triumph of technology.", "url": "https://www.space.com/hubble-space-telescope-turns-30.html", "urlToImage": null, "publishedAt": "2020-04-25T12:43:31Z", "content": "It's been 30 years since NASA launched the Hubble Space Telescope on April 24, 1990. The observatory was carried aloft in the payload bay of space shuttle Discovery, and for three decades Hubble's history was closely intertwined with the shuttle's. The telesc… [+8383 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "WHO says you may catch coronavirus more than once - The Jakarta Post - Jakarta Post", "description": "Catching COVID-19 once may not protect you from getting it again, according to the World Health Organization.", "url": "https://www.thejakartapost.com/life/2020/04/25/who-says-you-may-catch-coronavirus-more-than-once.html", "urlToImage": null, "publishedAt": "2020-04-25T09:17:00Z", "content": "Catching COVID-19 once may not protect you from getting it again, according to the World Health Organization.\r\n“There is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection,” the United … [+746 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Oliver Laughland, Lauren Zanolli", "title": "Why is coronavirus taking such a deadly toll on black Americans? - The Guardian", "description": "Longstanding health and socio-economic disparities have made minorities more vulnerable to Covid-19", "url": "https://www.theguardian.com/world/2020/apr/25/coronavirus-racial-disparities-african-americans", "urlToImage": null, "publishedAt": "2020-04-25T09:00:00Z", "content": "For the first weeks of the pandemic in St Louis, Missouri, the only ones to die from the virus were black.\r\nBy 8 April the coronavirus had killed 12 people. Each and every one was African American.\r\nIn this midwestern city that six years ago became the focal … [+10540 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "Success against malaria gives solutions for COVID-19 - The Jakarta Post - Jakarta Post", "description": "Today is World Malaria Day, a day when we remind ourselves of a disease that has killed more people in history than any other.", "url": "https://www.thejakartapost.com/academia/2020/04/25/success-against-malaria-gives-solutions-for-covid-19.html", "urlToImage": null, "publishedAt": "2020-04-25T04:56:00Z", "content": "Today is World Malaria Day, a day when we remind ourselves of a disease that has killed more people in history than any other.\r\nAs the world is focused on bringing the deadly COVID-19 pandemic under control, reflecting on the progress made in the fight agains… [+4107 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How a phone app triggered an international manhunt for the killer of a U.S. college student - CBS News", "description": "Roommates of Binghamton University nursing student Haley Anderson became concerned over her whereabouts due to her silence on social media in 2018. They soon...", "url": "https://www.youtube.com/watch?v=baJJATAEKI0", "urlToImage": null, "publishedAt": "2020-04-24T18:36:34Z", "content": null}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}]}