{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Dom Calicchio", "title": "Coronavirus immunity not assured after infection, WHO says, imperiling ‘passport’ idea - Fox News", "description": "There is “currently no evidence” that people who recover from coronavirus are protected from a second infection, the World Health Organization wrote Friday in a scientific briefing.", "url": "https://www.foxnews.com/health/coronavirus-immunity-not-assured-after-infection-who-says-imperiling-passport-idea", "urlToImage": null, "publishedAt": "2020-04-26T10:12:41Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nThere is “currently no evidence” that people who recover from coronavirus are protected from a second infection, the World Health Organization wrote Friday in a scie… [+3645 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "More states are easing coronavirus restrictions this week, unnerving experts and some local officials - CNN", "description": "Several states are reopening from coronavirus shutdowns this week even as the number of cases in the US gets closer to 1 million", "url": "https://www.cnn.com/2020/04/26/health/us-coronavirus-sunday/index.html", "urlToImage": null, "publishedAt": "2020-04-26T09:54:51Z", "content": null}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Dave Itzkoff", "title": "Brad Pitt Plays Dr. Anthony Fauci in an At-Home Edition of ‘S.N.L.’ - The New York Times", "description": "The latest remotely produced episode of “Saturday Night Live” also featured appearances from Miley Cyrus and Adam Sandler, among others.", "url": "https://www.nytimes.com/2020/04/26/arts/television/saturday-night-live-brad-pitt.html", "urlToImage": null, "publishedAt": "2020-04-26T09:48:26Z", "content": "Two weeks ago, Saturday Night Live returned to television with its first new episode of the at-home era: a collection of remotely produced sketches that were low on production value but high on spirit and innovation. It offered a window into what the show cou… [+6337 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Sameer Yasir, Atul Loke", "title": "Kashmir, Under Siege and Lockdown, Faces a Mental Health Crisis - The New York Times", "description": "Years of strife left a generation traumatized. India’s clampdown disrupted daily life. Now the battle against the coronavirus has further isolated and scarred a people with little access to help.", "url": "https://www.nytimes.com/2020/04/26/world/asia/kasmir-india-mental-health-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-26T09:48:12Z", "content": "PAHOO, Kashmir Sara Begums suffering began on Aug. 3, when masked policemen barged into her home, badly roughed up her son and whisked him away.\r\nMs. Begums son, Fayaz Ahmad Mir, 28, was one of thousands of civilians arrested or detained by order of the India… [+7437 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Henry T. Casey", "title": "The new iPhone SE is the perfect phone — for my parents - Tom's Guide", "description": "The iPhone SE 2020 is the best iPhone to recommend to most people", "url": "https://www.tomsguide.com/news/iphone-se-2020-parent-phone", "urlToImage": null, "publishedAt": "2020-04-26T09:15:25Z", "content": "The iPhone SE 2020 may not be the tiny successor to the original, but I'm sure it's my parents' next phone. Like many younger folks who are more familiar with technology than their relatives, I'm constantly asked for product recommendations, and when I saw ou… [+6030 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Michael David Smith", "title": "Belichick shrugs off Patriots passing on QBs - NBCSports.com", "description": "The Patriots selected 10 players in the 2020 NFL draft, and despite the departure of Tom Brady, a quarterback was not one of them. Bill Belichick says that’s just the way the team’s draft board fell. “If we feel like we find the right situation, we’ll certain…", "url": "https://profootballtalk.nbcsports.com/2020/04/26/belichick-shrugs-off-patriots-passing-on-qbs/", "urlToImage": null, "publishedAt": "2020-04-26T08:24:00Z", "content": "The Patriots selected 10 players in the 2020 NFL draft, and despite the departure of Tom Brady, a quarterback was not one of them. Bill Belichick says that’s just the way the team’s draft board fell.\r\n“If we feel like we find the right situation, we’ll certai… [+729 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Paul Kasabian", "title": "Fantasy Football 2020: Dynasty Rookie Rankings, 1st-Round Mock After NFL Draft - Bleacher Report", "description": "The  NFL  draft is over, which means the next drafting season will move into full swing as fantasy football players ramp up for the 2020 season...", "url": "https://bleacherreport.com/articles/2888709-fantasy-football-2020-dynasty-rookie-rankings-1st-round-mock-after-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-26T08:23:39Z", "content": "Alika Jenner/Getty Images\r\nThe NFL draft is over, which means the next drafting season will move into full swing as fantasy football players ramp up for the 2020 season.\r\nThis year's rookie class is full of skill-position players who will be afforded opportun… [+6700 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "James Walker", "title": "Trump Hints at Cancelling Coronavirus Press Briefings: 'What is The Purpose?' - Newsweek", "description": "The president also criticized the media for asking \"hostile questions\" as he dodged the coronavirus briefing on Saturday.", "url": "https://www.newsweek.com/trump-coronavirus-briefings-1500256", "urlToImage": null, "publishedAt": "2020-04-26T08:14:15Z", "content": "President Donald Trump wrote on Twitter Saturday that the daily coronavirus briefings were \"not worth the time &amp; effort\" after his remarks on injecting disinfectant drew criticism earlier this week.\r\nDuring his absence at yesterday's White House coronavir… [+2704 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Douglas Busvine", "title": "Germany flips on smartphone contact tracing, backs Apple and Google - Reuters", "description": "Germany changed course on Sunday over which type of smartphone technology it wanted to use to trace coronavirus infections, backing an approach supported by Apple and Google along with a growing number of other European countries.", "url": "https://www.reuters.com/article/us-health-coronavirus-europe-tech-idUSKCN22807J", "urlToImage": null, "publishedAt": "2020-04-26T08:03:22Z", "content": "BERLIN (Reuters) - Germany changed course on Sunday over which type of smartphone technology it wanted to use to trace coronavirus infections, backing an approach supported by Apple and Google along with a growing number of other European countries. \r\nChancel… [+3449 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Guardian staff and agencies", "title": "Kim Jong-un's train possibly spotted at North Korean resort - The Guardian", "description": "As rumours persist that ruler is in poor health, satellite images emerge showing train parked at Wonsan’s ‘leadership station’", "url": "https://www.theguardian.com/world/2020/apr/26/kim-jong-uns-train-possibly-spotted-at-north-korean-resort", "urlToImage": null, "publishedAt": "2020-04-26T06:50:34Z", "content": "A special train possibly belonging to the North Korean ruler, Kim Jong-un, has been spotted at a resort town, according to satellite images reviewed by a Washington-based North Korea monitoring project, amid conflicting reports about Kims health and whereabou… [+4255 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Murder of N.Y. nursing student leads to an international manhunt for her killer - CBS News", "description": "The Find My Friends app leads to the body of a missing college student as her suspected killer flees the country. Will he get away with murder?", "url": "https://www.cbsnews.com/news/haley-anderson-murder-international-manhunt/", "urlToImage": null, "publishedAt": "2020-04-26T05:04:27Z", "content": "Produced by Judy Rybak and Stephanie Slifer\r\nWhen Binghamton University student Haley Anderson first disappeared from her off-campus apartment, her close friend and roommate Josie Artin says she wasn't that alarmed. \r\n\"When I first didn't hear from her, I did… [+32795 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "'Battlefield V' will get one last standalone update this summer - Engadget", "description": "'Battlefield V' is winding down with a final standalone update that should arrive in June.", "url": "https://www.engadget.com/battlefield-v-last-update-in-summer-013240631.html", "urlToImage": null, "publishedAt": "2020-04-26T02:32:34Z", "content": "DICE and EA are bringing Battlefield V’s steady stream of updates to a close. The developers have announced (via Rock Paper Shotgun) that there will be one last standalone update to the WWII shooter this summer. It’s not clear what the update will contain bes… [+391 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Diamond, Jamie Gangel and Tami Luhby, CNN", "title": "White House officials are discussing plans to replace HHS Secretary Alex Azar - CNN", "description": "White House officials are discussing plans to replace Health and Human Services Secretary Alex Azar following a spate of criticism over the early federal response to the coronavirus, a senior administration official confirmed.", "url": "https://www.cnn.com/2020/04/25/politics/white-house-health-and-human-services-secretary-alex-azar/index.html", "urlToImage": null, "publishedAt": "2020-04-26T02:15:57Z", "content": "(CNN)White House officials are discussing plans to replace Health and Human Services Secretary Alex Azar following a spate of criticism over the early federal response to the coronavirus, a senior administration official confirmed.\r\nAny move to replace Azar w… [+5293 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "2020 NFL Draft picks by college team, conference: LSU ties all-time record, SEC on top for 14th straight year - CBS Sports", "description": "The Tigers, coming off a national championship, also broke the SEC record for most picks by a school", "url": "https://www.cbssports.com/college-football/news/2020-nfl-draft-picks-by-college-team-conference-lsu-ties-all-time-record-sec-on-top-for-14th-straight-year/", "urlToImage": null, "publishedAt": "2020-04-26T01:57:29Z", "content": "For the 14th straight year, the SEC was the king of the NFL Draft. Given that a majority of college football's talent pool lies in the South, it shouldn't be a major surprise that the SEC led all conferences with 63 picks in the 2020 NFL Draft. That falls jus… [+1297 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Joel Shannon", "title": "Police arrest 3 people protesting closed beaches at SoCal beach set to reopen Monday - USA TODAY", "description": "Encinitas mayor Catherine Blakespear said she believed the protesters “were trying to make a political point\" at a beach scheduled to reopen Monday.", "url": "https://www.usatoday.com/story/news/nation/2020/04/25/3-arrests-beach-protest-san-diego-county-moonlight-beach/3028200001/", "urlToImage": null, "publishedAt": "2020-04-26T01:05:54Z", "content": "A Department of Homeland Security study shows the effects of sunlight, heat and humidity on the half life of the coronavirus that causes COVID-19.\r\nUSA TODAY\r\nSAN DIEGO  San Diego County police say three people protesting beach closures were arrested in Encin… [+3100 chars]"}, {"source": {"id": null, "name": "Nydailynews.com"}, "author": "Storm Gifford", "title": "Kids' stuff: Pratt and Schwarzenegger expecting - New York Daily News", "description": "Chris Pratt and Katherine Schwarzenegger are expecting their first child.", "url": "https://www.nydailynews.com/snyde/ny-kat-and-pratt-20200426-3ljz34ax7nb5xlfwrq5yez3hme-story.html", "urlToImage": null, "publishedAt": "2020-04-26T01:01:41Z", "content": null}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Scott McDonald", "title": "Michigan State Senator Apologizes for Wearing Mask That Suggests Confederate Symbol - Newsweek", "description": "\"I'm sorry for my choice of pattern on the face mask I wore yesterday on the Senate floor. I did not intend to offend anyone,\" State Senator Dale Zorn tweeted Saturday.", "url": "https://www.newsweek.com/michigan-state-senator-apologizes-wearing-mask-that-suggests-confederate-symbol-1500248", "urlToImage": null, "publishedAt": "2020-04-26T00:20:04Z", "content": "A Michigan state senator who wore a protective face mask that appears to resemble the Confederate flag has since apologized, saying he had no intentions to offend anyone.\r\nState Senator Dale Zorn, a Republican who represents Ida Township in the southeastern p… [+3012 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": null, "title": "U.K. Prime Minister Boris Johnson To Return To Work Monday - NPR", "description": "Johnson plans to return to 10 Downing Street roughly two weeks after leaving the hospital for COVID-19 treatment.", "url": "https://www.npr.org/sections/coronavirus-live-updates/2020/04/25/845039047/u-k-prime-minister-boris-johnson-to-return-to-work-monday", "urlToImage": null, "publishedAt": "2020-04-26T00:08:42Z", "content": "Britain's Prime Minister Boris Johnson speaking from 10 Downing Street after his release from the hospital for COVID-19 treatment.\r\nPippa Fowles/AP\r\nBritish Prime Minister Boris Johnson is returning to work Monday after recovering from COVID-19, according to … [+882 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Hailey Waller", "title": "Richard Branson Seeking Buyer for Virgin Atlantic: Telegraph - Yahoo Finance", "description": "(Bloomberg) -- Richard Branson is seeking a buyer for Virgin Atlantic Airways Ltd. as he struggles to secure a 500 million pound ($618 million) government bailout, the Telegraph reported.Branson has set an end-of-May deadline to save the U.K. airline from col…", "url": "https://finance.yahoo.com/news/richard-branson-seeking-buyer-virgin-211425325.html", "urlToImage": null, "publishedAt": "2020-04-25T23:25:00Z", "content": "(Bloomberg) -- Richard Branson is seeking a buyer for Virgin Atlantic Airways Ltd. as he struggles to secure a 500 million pound ($618 million) government bailout, the Telegraph reported.\r\nBranson has set an end-of-May deadline to save the U.K. airline from c… [+1570 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Sergei Klebnikov", "title": "These Stocks Will Thrive In A Post-Coronavirus World, According To Experts - Forbes", "description": "Here are 19 stocks that will benefit from new consumer trends once quarantine orders are lifted.", "url": "https://www.forbes.com/sites/sergeiklebnikov/2020/04/25/these-stocks-will-thrive-in-a-post-coronavirus-world-according-to-experts/", "urlToImage": null, "publishedAt": "2020-04-25T22:20:01Z", "content": "Despite the coronavirus pandemic causing unprecedented financial disruptions and a major shift in the lives of American consumers, a slowdown in new cases has made Wall Street more optimistic about eventually reopening the economy and here are 19 stocks poise… [+3491 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Holly Bailey", "title": "In Wisconsin, protesters attack stay-at-home orders as unnecessary — or a government cabal - The Washington Post", "description": "", "url": "https://www.washingtonpost.com/politics/2020/04/25/wisconsin-protestors-attack-stay-at-home-orders-unnecessary-or-government-cabal/", "urlToImage": null, "publishedAt": "2020-04-25T21:53:00Z", "content": "What has not been fine, she said, is what has happened to her family in the past month. Most of her children and grandchildren work in the service industry, including in salons and restaurants, and all had been laid off several weeks ago as Wisconsin ordered … [+9008 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Mike Wall", "title": "Big asteroid shows itself ahead of Earth flyby on April 29 - Livescience.com", "description": "We have nothing to fear from 1998 OR2.", "url": "https://www.livescience.com/asteroid-1998-or2-photo-april-2020-flyby.html", "urlToImage": null, "publishedAt": "2020-04-25T21:40:00Z", "content": "We've now got a good visual on the big space rock that's going to fly by Earth next week.\r\nOn Saturday (April 18), the Arecibo Observatory\r\n in Puerto Rico captured a radar image of the asteroid 1998 OR2, which will zoom within 3.9 million miles (6.3 million … [+2360 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Thomas Perroteau with AFP bureaus", "title": "WHO warns over virus immunity as global death toll tops 200,000 - Yahoo News", "description": "Spanish children were allowed outside on Sunday for the first time in six weeks as countries prepared to ease lockdown measures and reopen economies gutted b...", "url": "https://news.yahoo.com/warns-over-virus-immunity-global-death-toll-nears-163443970.html", "urlToImage": null, "publishedAt": "2020-04-25T21:31:45Z", "content": "Madrid (AFP) - Spanish children were allowed outside on Sunday for the first time in six weeks as countries prepared to ease lockdown measures and reopen economies gutted by the coronavirus despite the worldwide death toll surpassing 200,000.\r\nGovernments fro… [+4846 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "Lou Whiteman", "title": "Boeing Abandons $4 Billion Embraer Deal: What It Means for Boeing Stock - Motley Fool", "description": "The good and the bad concerning Boeing's decision to bail on Embraer.", "url": "https://www.fool.com/investing/2020/04/25/boeing-abandons-4-billion-embraer-deal-what-it-mea.aspx", "urlToImage": null, "publishedAt": "2020-04-25T20:30:00Z", "content": "On Saturday, Boeing(NYSE:BA) terminated a $4 billion deal that would have given it controlling of the commercial aerospace operations of Embraer(NYSE:ERJ) after a Friday night deadline came and passed without the two sides ironing out final details.\r\nIn press… [+5558 chars]"}, {"source": {"id": null, "name": "Profootballrumors.com"}, "author": null, "title": "49ers Trade Matt Breida To Dolphins - profootballrumors.com", "description": "The 49ers are shaking up their backfield and sending a member of their surplus to south Florida, dealing Matt Breida &hellip;", "url": "https://www.profootballrumors.com/2020/04/dolphins-to-acquire-matt-breida-from-49ers", "urlToImage": null, "publishedAt": "2020-04-25T19:30:00Z", "content": "The 49ers are shaking up their backfield and sending a member of their surplus to south Florida, dealing Matt Breida to the Dolphins for the No. 153 overall pick, Ian Rapoport of NFL.com tweets.\r\nMiami did not previously address its backfield need but made mu… [+1928 chars]"}, {"source": {"id": null, "name": "Variety.com"}, "author": "Jordan Moreau", "title": "Tom Hanks’ Blood Is Being Used to Develop Coronavirus Vaccine - Variety", "description": "After recovering from coronavirus, Tom Hanks and Rita Wilson have offered their blood to help develop a vaccine for coronavirus. In early March, the couple tested positive for COVID-19 while in Australia for Baz Luhrmann’s Elvis Presley biopic, in which Hanks…", "url": "https://variety.com/2020/film/news/tom-hanks-coronavirus-blood-research-vaccine-1234589978/", "urlToImage": null, "publishedAt": "2020-04-25T19:18:12Z", "content": "After recovering from coronavirus, Tom Hanks and Rita Wilson have offered their blood to help develop a vaccine for coronavirus.\r\nIn early March, the couple tested positive for COVID-19 while in Australia for Baz Luhrmann’s Elvis Presley biopic, in which Hank… [+1114 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "BBC News", "title": "Coronavirus: Worldwide death toll climbs to 200,000 - BBC News", "description": "The sombre milestone is reached with 2.8 million infections, Johns Hopkins University figures say.", "url": "https://www.bbc.com/news/world-52428162", "urlToImage": null, "publishedAt": "2020-04-25T19:03:00Z", "content": "Let us know you agree to cookies\r\nWe use cookies to give you the best online experience. Please let us know if you agree to all of these cookies.\r\nImage copyright\r\n Getty Images\r\nImage caption\r\n While the number of virus cases appears to be stable or declinin… [+4298 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Ellen Gabler, Michael H. Keller", "title": "Prescriptions Surged as Trump Praised Drugs in Coronavirus Fight - The New York Times", "description": "Prescriptions for two antimalarial drugs jumped by 46 times the average when the president promoted them on TV. There’s no proof they work against Covid-19.", "url": "https://www.nytimes.com/2020/04/25/us/coronavirus-trump-chloroquine-hydroxychloroquine.html", "urlToImage": null, "publishedAt": "2020-04-25T19:02:27Z", "content": "It was at a midday briefing last month that President Trump first used the White House telecast to promote two antimalarial drugs in the fight against the coronavirus.\r\nI think it could be something really incredible, Mr. Trump said on March 19, noting that w… [+11336 chars]"}, {"source": {"id": null, "name": "Slashfilm.com"}, "author": "Ethan Anderton", "title": "Sony Pictures Release Dates Shuffled for 2020 and 2021/Film - /FILM", "description": "Sony Pictures release dates have been shifted around for movies in 2020 and 2021 thanks to the production shutdown caused by coronavirua.", "url": "https://www.slashfilm.com/sony-pictures-release-dates-for-2020-and-2021/", "urlToImage": null, "publishedAt": "2020-04-25T19:00:39Z", "content": "After pushing back both Spider-Man 3 and Spider-Man: Into the Spider-Verse, Sony Pictures has also shuffled around a bunch of other upcoming release dates for movies slated to come out this year and through 2021. Some of the movies hopping around the theatric… [+2805 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Lance Roberts", "title": "MacroView: The Oil Price Crash Was Inevitable - Seeking Alpha", "description": "Nobody wanted to pay much attention to the fundamentals at a time when near-zero interest rates were pushing banks, hedge funds, and private equity firms to chase the \"yield\" in the energy space.The charts for WTI remain bearish, and the fundamentals are stil…", "url": "https://seekingalpha.com/article/4339980-macroview-oil-price-crash-was-inevitable", "urlToImage": null, "publishedAt": "2020-04-25T18:50:32Z", "content": "The oil price crash was inevitable.\r\nTo understand why, we have to review a bit of history.\r\nIn 2013, I began warning of the risk to oil prices due to the ongoing imbalances between global supply and demand. Those warnings fell on deaf ears.\r\nNobody wanted to… [+12630 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Alison DeNisco Rayome", "title": "Facebook Messenger Rooms: How to use the free Zoom video chat competitor - CNET", "description": "Up to 50 people can chat in a room at once, with no time limit.", "url": "https://www.cnet.com/how-to/facebook-messenger-rooms-how-to-use-the-free-zoom-video-chat-competitor/", "urlToImage": null, "publishedAt": "2020-04-25T18:43:15Z", "content": "Facebook Messenger Rooms is set to compete with Zoom and other group video chat apps.\r\nFacebook\r\nFacebook is getting in on the group-video-chat game with a new feature called Messenger Rooms, which seems set to compete with services like Zoom, Skype and Micro… [+2907 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Peter Aitken", "title": "Global coronavirus death toll passes 200000 - Fox News", "description": "The world passes a grim milestone during the coronavirus pandemic.", "url": "https://www.foxnews.com/us/global-coronavirus-death-toll-passes-200000", "urlToImage": null, "publishedAt": "2020-04-25T18:42:40Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nGlobal coronavirus deaths surpassed 200,000 on Saturday, according to Johns Hopkins University researchers.\r\nThere are now at least 201,502 COVID-related deaths repo… [+1131 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Immunity passports 'could increase virus spread' - BBC News", "description": "No evidence people who develop antibodies after recovering are protected against a second infection.", "url": "https://www.bbc.com/news/world-52425825", "urlToImage": null, "publishedAt": "2020-04-25T13:40:47Z", "content": "Image copyrightReutersImage caption\r\n Testing for antibodies is becoming more widespread\r\nGovernments should not issue so-called \"immunity passports\" or \"risk-free certificates\" as a way of easing lockdowns, the World Health Organization (WHO) says.\r\nIt said … [+4744 chars]"}, {"source": {"id": null, "name": "Interestingengineering.com"}, "author": "Loukia Papadopoulos", "title": "SpaceX Completes Falcon 9 Static Fire Test - Interesting Engineering", "description": "The test comes on the heels of another successful static fire test earlier this week.", "url": "https://interestingengineering.com/spacex-successfully-completes-falcon-9-static-fire-test", "urlToImage": null, "publishedAt": "2020-04-25T13:33:43Z", "content": "Preparations for Crew Dragon’s first operational mission seems to be going well. SpaceX's rocket development facility in McGregor, Texas, announced on Saturday that it successfully completed a static fire test of the Falcon 9 first stage that will launch the … [+1718 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew May", "title": "Celebrating 30 years of the Hubble Space Telescope - Space.com", "description": "Celebrating three decades of an icon of science — and a triumph of technology.", "url": "https://www.space.com/hubble-space-telescope-turns-30.html", "urlToImage": null, "publishedAt": "2020-04-25T12:43:31Z", "content": "It's been 30 years since NASA launched the Hubble Space Telescope on April 24, 1990. The observatory was carried aloft in the payload bay of space shuttle Discovery, and for three decades Hubble's history was closely intertwined with the shuttle's. The telesc… [+8383 chars]"}, {"source": {"id": null, "name": "Keprtv.com"}, "author": "Christopher Poulsen", "title": "Police cars make some noise for Pasco boy's birthday - KEPR 19", "description": "PASCO, Wash. -- Coronavirus is changing the way families are celebrating birthdays. A parade of Pasco police made sure 10-year-old Stryker Smith enjoyed his birthday. Sgt. Rodrigo Pruneda says the usual party with friends, cake and candles is out of reach thi…", "url": "http://keprtv.com/news/coronavirus/police-cars-make-some-noise-for-pasco-boys-birthday", "urlToImage": null, "publishedAt": "2020-04-25T01:07:08Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Moira Warburton", "title": "Gunman started Canada's worst mass shooting after his girlfriend fled - Reuters", "description": "The gunman in Canada's worst ever mass shooting began the weekend rampage that ultimately killed 22 people after his girlfriend escaped him when he assaulted her, a top police official said on Friday.", "url": "https://www.reuters.com/article/us-canada-crime-novascotia-idUSKCN2262VE", "urlToImage": null, "publishedAt": "2020-04-24T21:55:18Z", "content": "TORONTO/OTTAWA (Reuters) - The gunman in Canada’s worst ever mass shooting began the weekend rampage that ultimately killed 22 people after his girlfriend escaped him when he assaulted her, a top police official said on Friday. \r\nPolice did not give details a… [+3204 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}]}