{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "NFL Draft 2020: Grades and analysis from Pete Prisco for every first-round draft selection - CBS Sports", "description": "Pete Prisco grades the first 32 picks of the 2020 NFL Draft", "url": "https://www.cbssports.com/nfl/news/nfl-draft-2020-grades-and-analysis-from-pete-prisco-for-every-first-round-draft-selection/", "urlToImage": null, "publishedAt": "2020-04-25T16:14:32Z", "content": "Want to know what I think of every pick made Thursday in the first round of the 2020 NFL Draft? You can find it all below. You can also follow along throughout the rest of the draft on Days 2 and 3 for more grades and more analysis. Be sure to refresh this pa… [+8035 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "North Korean Sympathizer Calls News on Kim's Health 'False' - Bloomberg", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=d368b8a0-8715-11ea-a98e-01efa6ea8674&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNC0yNS9ub3J0aC1rb3JlYW4tc3ltcGF0aGl6ZXItY2FsbHMtbmV3cy1vbi1raW0tcy1oZWFsdGgtZmFsc2U=", "urlToImage": null, "publishedAt": "2020-04-25T16:04:17Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Jeremy Bogaisky", "title": "Boeing-Embraer Deal Collapses - Forbes", "description": "Boeing has abandoned a deal to buy 80% of Embraer’s commercial aircraft business for $4.2 billion, stating Saturday morning that the Brazilian company didn’t satisfy necessary conditions of the agreement.", "url": "https://www.forbes.com/sites/jeremybogaisky/2020/04/25/boeing-embraer-deal-collapses/", "urlToImage": null, "publishedAt": "2020-04-25T15:16:58Z", "content": "Employees remove cockpit window covers from an Embraer SA E195-E2 aircraft during the 52nd ... [+] International Paris Air Show at Le Bourget, in Paris, France, on Tuesday, June 20, 2017.\r\n© 2017 Bloomberg Finance LP\r\nBoein \r\n BA\r\ng has abandoned a deal to bu… [+3856 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Sandra G. Boodman", "title": "She fell more than 30 times. For three years, doctors couldn’t explain why. - The Washington Post", "description": "A bevy of specialists tried to help but seemed stymied by her symptoms — and their narrow focus.", "url": "https://www.washingtonpost.com/health/medical-mysteries/she-fell-more-than-30-times-for-three-years-doctors-couldnt-explain-why/2020/04/24/685c2eaa-62f5-11ea-acca-80c22bbee96f_story.html", "urlToImage": null, "publishedAt": "2020-04-25T15:11:19Z", "content": "The 10 doctors she consulted between 2016 and 2019 four orthopedists, three neurologists, a rheumatologist, a podiatrist and her internist reached disparate conclusions. One suggested she was clumsy. Others suspected her problem was primarily orthopedic or co… [+8899 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Hannah Fry, Priscella Vega, Alex Wigglesworth, Lindsay Winkley", "title": "Some beaches are open, but coronavirus rules apply - Los Angeles Times", "description": "Some Southern California beaches are open, while others — including in L.A. County — remain closed during this weekend's heat wave.", "url": "https://www.latimes.com/california/story/2020-04-25/some-beaches-closed-others-open-during-heat-wave-but-coronavirus-rules-apply", "urlToImage": null, "publishedAt": "2020-04-25T14:54:19Z", "content": "With hot weather blanketing Southern California this weekend, officials are urging residents to keep up with social distancing measures and avoid trips especially to the beach.\r\nA day or two of fun, leading to weeks more of us being in our homes and not being… [+5149 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Haley Brink and Alta Spells, CNN", "title": "Severe storms possible across parts of the Southeast Saturday - CNN", "description": "Severe storms will track across parts of the Southeast Saturday after causing damage in northeast Texas on Friday.", "url": "https://www.cnn.com/2020/04/25/us/saturday-weather-texas-storm-damage/index.html", "urlToImage": null, "publishedAt": "2020-04-25T14:35:37Z", "content": null}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Marshall Honorof", "title": "The iPhone SE just put every cheap Android phone on notice — here's why - Tom's Guide", "description": "The iPhone SE is nearly a flagship phone, and Android just can't compete at its price range", "url": "https://www.tomsguide.com/news/the-iphone-se-just-put-every-cheap-android-phone-on-notice-heres-why", "urlToImage": null, "publishedAt": "2020-04-25T14:35:03Z", "content": "When the new iPhone SE\r\n was announced, I was skeptical. Another iPhone usually means another overpriced fashion accessory, offering features that Android phones had two years ago, but at a much higher price.\r\nThen I saw that the device costs only $400, and I… [+6764 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/julia-hollingsworth\">Julia Hollingsworth</a>, <a href=\"/profiles/brett-mckeehan\">Brett McKeehan</a>, Tara John and <a href=\"/profiles/fernando-alfonso-iii\">Fernando Alfonso III</a>, CNN", "title": "Coronavirus pandemic spreads around the globe: Live updates - CNN International", "description": "The global coronavirus pandemic has brought countries around the world to a standstill. Here's the latest updates on worldwide Covid-19 cases, deaths, government responses and more.", "url": "https://www.cnn.com/world/live-news/coronavirus-pandemic-04-25-20-intl/index.html", "urlToImage": null, "publishedAt": "2020-04-25T14:31:00Z", "content": "In a moment caught on video, CNN producer Tawanda Scott heard her daughter talking to her friend about coronavirus. \r\nHer daughter's friend said, \"they said it's hitting African-Americans especially hard.\"\r\nThis moment was aired today during the CNN and Sesam… [+1095 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Senegal's $1 COVID-19 test kit and the race for a vaccine | Counting the Cost - Al Jazeera English", "description": "What should take 10-15 years, the global scientific community hopes to cram into months. The World Health Organization (WHO) says there are 70 vaccines in th...", "url": "https://www.youtube.com/watch?v=tqKBNQzEROc", "urlToImage": null, "publishedAt": "2020-04-25T14:28:39Z", "content": null}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Spencer Kimball", "title": "Congress approved $370 billion more in small business loans, but the money could run out in days — again - CNBC", "description": "Though Congress approved more funding for PPP loans, it's unclear whether that's enough to cover every small business hit by the coronavirus pandemic.", "url": "https://www.cnbc.com/2020/04/25/coronavirus-ppp-small-business-loans-could-run-out-in-days.html", "urlToImage": null, "publishedAt": "2020-04-25T14:26:10Z", "content": "A customer taste tests a beer before ordering a growler to go at Harlem Public in northern Manhattan. April 24, 2020\r\nJust when Kal Narvilas thought his loan applications were about to get approved, his bank delivered the bad news there was no more money left… [+8242 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Tal Axelrod", "title": "CDC adds six more symptoms for coronavirus | TheHill - The Hill", "description": "The Centers for Disease Control and Prevention (CDC) added six new symptoms for the coronavirus to its website as officials still grapple with gauging the illness’s scope.", "url": "https://thehill.com/policy/healthcare/494640-cdc-adds-six-more-symptoms-for-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T14:25:21Z", "content": "The Centers for Disease Control and Prevention (CDC) added six new symptoms for the coronavirus to its website as officials grapple with gauging the illness's scope.\r\nThe new symptoms for the disease are chills, repeated shaking with chills, muscle pain, head… [+623 chars]"}, {"source": {"id": null, "name": "Loudwire.com"}, "author": "joedivita", "title": "Watch Post Malone + Travis Barker Play 15 Nirvana Cover Songs - Loudwire", "description": "The COVID-19 relief show was streamed live and can be watched in full.", "url": "https://loudwire.com/watch-post-malone-travis-barker-nirvana-covers/", "urlToImage": null, "publishedAt": "2020-04-25T14:23:00Z", "content": "Post Malone's at-home COVID-19 relief benefit show with Blink-182's Travis Barker featured a total of 15 Nirvana cover songs and can now be viewed in it's entirety at the bottom of this page.\r\nThe two were flanked by bassist Brian Lee and guitarist Nick Mac a… [+1763 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maeve Reston, CNN", "title": "Georgia starts to reopen but nervous mayors warn that coronavirus crisis isn't over - CNN", "description": "Georgia on Friday became the first state to experiment with easing its stay-at-home restrictions and concerned mayors from the across state pointed to the rise in coronavirus cases in their cities -- both urban and rural -- as evidence it's too soon to return…", "url": "https://www.cnn.com/2020/04/25/politics/georgia-reopening-rural-urban-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-25T14:15:36Z", "content": "(CNN)Georgia on Friday became the first state to experiment with easing its stay-at-home restrictions and concerned mayors from the across state pointed to the rise in coronavirus cases in their cities -- both urban and rural -- as evidence it's too soon to r… [+8327 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Melissa Roberto", "title": "Kanye West is officially a billionaire, Forbes says - but rapper claims publication is still low-balling him - Fox News", "description": "Kanye West is officially a billionaire, according to Forbes, but the rapper claimed their figure is still off by $2 billion.", "url": "https://www.foxnews.com/entertainment/kanye-west-billionaire-forbes", "urlToImage": null, "publishedAt": "2020-04-25T13:59:12Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox.  Sign up here. \r\nKanye West has amassed a $1.3 billion net worth, officially making him a billionaire for the first time, according to Forbes.\r\nBut the rapper-turned-sneaker-mogul … [+2100 chars]"}, {"source": {"id": null, "name": "Abc7ny.com"}, "author": null, "title": "'COVID toes' may be new symptom of coronavirus, doctors say - WABC-TV", "description": "Doctors say there may be a new symptom of coronavirus they are calling \"Covid Toes.\"", "url": "https://abc7ny.com/covid-toes-covid19-coronavirus-symptoms/6128998/", "urlToImage": null, "publishedAt": "2020-04-25T13:59:05Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "6 Ways Doctor Strange 2 Could Be A Game-Changer For The MCU - CBR", "description": "Multiverse of Madness Could Change the MCU Forever SUBSCRIBE NOW to CBR! Click here: http://bit.ly/Subscribe-to-CBR We all know that the Infinity Saga was a ...", "url": "https://www.youtube.com/watch?v=_f0Jc21vK5Q", "urlToImage": null, "publishedAt": "2020-04-25T13:45:00Z", "content": "Multiverse of Madness Could Change the MCU ForeverSUBSCRIBE NOW to CBR! Click here: http://bit.ly/Subscribe-to-CBR\r\nWe all know that the Infinity Saga was a major game changer for the Marvel Cinematic Universe, but lets not forget about Phase Fours Doctor Str… [+1433 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "David Smith, Kari Paul", "title": "Debacle of Trump's coronavirus disinfectant comments could be tipping point - The Guardian", "description": "The US president plans to ‘pare back’ his daily coronavirus briefings after falsely claiming his suggestion to ingest cleaning products had been ‘sarcastic’", "url": "https://www.theguardian.com/us-news/2020/apr/25/donald-trump-coronavirus-disinfectant-sarcastic-tipping-point", "urlToImage": null, "publishedAt": "2020-04-25T13:20:40Z", "content": "For Donald Trump, it was the strangest and most news-making thing he could have done: instead of taking questions from journalists, dominating the nations airwaves yet again, the US president gave a short pre-written statement and then stalked off the stage.\r… [+6803 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Zoom’s Good Week Ends on Sour Note After Facebook Crashes Party - Bloomberg", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=177d2d80-8704-11ea-b23a-c3ca0be50368&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNC0yNS96b29tLXMtZ29vZC13ZWVrLWVuZHMtb24tc291ci1ub3RlLWFmdGVyLWZhY2Vib29rLWNyYXNoZXMtcGFydHk=", "urlToImage": null, "publishedAt": "2020-04-25T13:13:17Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": null, "name": "Espn.com"}, "author": "John Keim, Courtney Cronin", "title": "Redskins OT Trent Williams denies nixing potential trade to Vikings - ESPN", "description": "Trent Williams told ESPN that he did not strike down a potential trade to the Vikings, though sources confirmed that the potential trade partners were informed at some point Friday that the Redskins offensive tackle did not want to play in Minnesota.", "url": "https://www.espn.com/nfl/story/_/id/29097412/redskins-ot-trent-williams-denies-nixing-potential-trade-vikings", "urlToImage": null, "publishedAt": "2020-04-25T13:07:07Z", "content": "Washington Redskins offensive tackle Trent Williams is denying that he struck down a potential trade to the Vikings because he didn't want to play in Minnesota, he told ESPN on Saturday.\r\n\"No, that's not true,\" Williams said.\r\nHowever, sources confirmed to ES… [+4047 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Sarah Parvini", "title": "Amid coronavirus crisis, mosques could lose key Ramadan donations - Los Angeles Times", "description": "During Ramadan, mosques around the country are able to raise as much as 30% of their annual revenue through charity from congregants. But as mosques shut their doors under coronavirus quarantine orders, they have been taken a financial hit.", "url": "https://www.latimes.com/california/story/2020-04-25/la-me-ramadan-mosques-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T13:04:47Z", "content": "Last year, on the 27th night of Ramadan, the faithful at the Islamic Center of Hawthorne pulled up to the mosque in droves to celebrate one of the holiest nights on the Islamic calendar.\r\nAfter theyd recited sunset prayers and begun their feast of meats, rice… [+5954 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Vanessa Hand Orellana", "title": "2 Apple Watch features that earned the smartwatch a permanent spot on my wrist - CNET", "description": "I started out a skeptic, but the Apple Watch eventually won me over. Here's what it took for me to take it seriously as a fitness tracker and smartwatch.", "url": "https://www.cnet.com/news/apple-watch-features-that-earned-smartwatch-permanent-spot-on-my-wrist/", "urlToImage": null, "publishedAt": "2020-04-25T12:52:25Z", "content": "Angela Lang/CNET\r\nI haven't always been a fan of the Apple Watch. I bought one as soon as it went on sale in 2015 hoping it would blow me away, but it ended up spending more time in my drawer than on my wrist. It took three more years and the addition of two … [+8182 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Sara Dorn", "title": "'No evidence' antibodies protect recovered coronavirus patients, WHO says - New York Post ", "description": "No evidence exists that people who have recovered from the coronavirus are protected from reinfection, even if they have antibodies, the World Health Organization said Saturday. The warning from th…", "url": "https://nypost.com/2020/04/25/no-evidence-recovered-coronavirus-patients-are-immune-who/", "urlToImage": null, "publishedAt": "2020-04-25T12:52:21Z", "content": "No evidence exists that people who have recovered from the coronavirus are protected from reinfection, even if they have antibodies, the World Health Organization said Saturday.\r\nThe warning from the U.N.’s health arm runs counter to what many survivors thoug… [+1038 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew May", "title": "Celebrating 30 years of the Hubble Space Telescope - Space.com", "description": "Celebrating three decades of an icon of science — and a triumph of technology.", "url": "https://www.space.com/hubble-space-telescope-turns-30.html", "urlToImage": null, "publishedAt": "2020-04-25T12:43:31Z", "content": "It's been 30 years since NASA launched the Hubble Space Telescope on April 24, 1990. The observatory was carried aloft in the payload bay of space shuttle Discovery, and for three decades Hubble's history was closely intertwined with the shuttle's. The telesc… [+8383 chars]"}, {"source": {"id": null, "name": "Eonline.com"}, "author": "Cydney Contreras", "title": "Anderson Cooper Moved to Tears By Woman Whose Spouse Died From COVID - E! NEWS", "description": "Anderson Cooper shares an emotional moment with Katie Coelho, whose 32-year-old husband died from the coronavirus and left behind a note for his family", "url": "https://www.eonline.com/news/1144837/anderson-cooper-is-moved-to-tears-by-woman-whose-32-year-old-husband-died-from-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T10:35:35Z", "content": "The morning he died, Katie was unable to make it to the hospital in time, but she shared the emotional letter he wrote to her and their two children, one of whom has what CNN described as \"several medical complexities, in the days before his passing. And thou… [+461 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Brazil justice minister resigns, accuses Bolsonaro of meddling - Al Jazeera English", "description": "Brazil’s President Jair Bolsonaro has repeatedly downplayed the extent of damage the coronavirus in his country. Just over a week ago, he fired the health mi...", "url": "https://www.youtube.com/watch?v=8mJM-JCIVr8", "urlToImage": null, "publishedAt": "2020-04-25T06:15:01Z", "content": null}, {"source": {"id": null, "name": "Theathletic.com"}, "author": "Dane Brugler", "title": "The players remaining on Dane Brugler's top 300 draft... - The Athletic", "description": "Here is how the list of top 300 prospects stands heading into the final four rounds on Saturday.", "url": "https://theathletic.com/1773033/2020/04/25/the-players-remaining-on-dane-bruglers-top-300-draft-board-entering-day-3/", "urlToImage": null, "publishedAt": "2020-04-25T05:19:12Z", "content": "Most of the top players in the NFL Draft were selected during the first two days, but as the best teams routinely demonstrate, there are plenty of quality players to be found in the later rounds.Washington’s Jacob Eason and Georgia’s Jake Fromm are among the … [+678 chars]"}, {"source": {"id": null, "name": "Ksl.com"}, "author": "https://www.facebook.com/kslcom/", "title": "Giant asteroid flying by Earth next week looks like it's wearing a face mask - KSL.com", "description": "An asteroid estimated to be 1.2 miles wide will fly by Earth next week, but it's not expected to collide with our planet.", "url": "https://www.ksl.com/article/46744600/giant-asteroid-flying-by-earth-next-week-looks-like-its-wearing-a-face-mask", "urlToImage": null, "publishedAt": "2020-04-25T02:57:43Z", "content": "ATLANTA (CNN) An asteroid estimated to be 1.2 miles wide will fly by Earth next week, but it's not expected to collide with our planet.\r\nAnd if an asteroid could be aware of such things, it appears to be wearing a face mask in deference to the pandemic, accor… [+2872 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": null, "title": "Lawmakers press for small business loans for payday lenders - POLITICO", "description": "The lenders are among many industries lobbying to gain access to the $670 billion small business loan program.", "url": "https://www.politico.com/news/2020/04/24/lawmakers-press-for-small-business-loans-for-payday-lenders-207636", "urlToImage": null, "publishedAt": "2020-04-25T01:12:48Z", "content": "Payday lenders weren't explicitly mentioned, but a spokesperson for Rep. Blaine Luetkemeyer (R-Mo.), one of the lawmakers who led the letter, confirmed the intent was to include them in the request.\r\nIn the letter sent Thursday, the House members said the com… [+1698 chars]"}, {"source": {"id": null, "name": "Chicagotribune.com"}, "author": "Steve Johnson, Alice Yin, Deanese Williams-Harris, Peter Nickeas, Stacy St. Clair", "title": "As stay-at-home order extended, Chicagoans enter next phase of life under COVID-19 - Chicago Tribune", "description": "How Chicago residents are dealing with the stay-at-home order extension: Illinois enters this next phase of life under the virus as a truly bifurcated state, a population split into those who are fighting bankruptcy and those fighting boredom.", "url": "https://www.chicagotribune.com/coronavirus/ct-corona-stay-at-home-illinois-extended-20200425-6fgetwbgczabjoyk4d3c6oheni-story.html", "urlToImage": null, "publishedAt": "2020-04-25T00:05:21Z", "content": null}, {"source": {"id": null, "name": "Msn.com"}, "author": null, "title": "Pitch and catch: Round 2 of NFL draft heavy on receivers Pitch and catch. While only - msnNOW", "description": "Pitch and catch. While only one quarterback, Oklahoma's Jalen Hurts, was taken in the second round of the NFL draft Friday, the guys who haul in passes were everywhere. Starting with the top two selections on Day 2 — Clemson's Tee Higgins to Cincinnati and So…", "url": "https://www.msn.com/en-us/sports/nfl/pitch-and-catch-round-2-of-nfl-draft-heavy-on-receivers/ar-BB13amlc", "urlToImage": null, "publishedAt": "2020-04-24T23:55:00Z", "content": "In this still image from video provided by the NFL, Tee Higgins, front center, is selected by the Cincinnati Bengals in the second round of the NFL football draft, Friday, April 24, 2020. (NFL via AP)\r\nFILE - In this Feb. 27, 2020, file photo, Oklahoma quarte… [+6049 chars]"}, {"source": {"id": null, "name": "Realclearpolitics.com"}, "author": null, "title": "Cuomo: The Coronavirus That Came To New York \"Did Not Come From China, It Came From Europe\" - RealClearPolitics", "description": "Gov. Andrew Cuomo (D-NY) argued the coronavirus that hit New York state did not come from China but  Europe, probably Italy he said. At his Friday coronavirus press briefing, Cuomo said President Trump's China travel ban was too late and the horse had long le…", "url": "https://www.realclearpolitics.com/video/2020/04/24/cuomo_the_coronavirus_that_came_to_new_york_did_not_come_from_china_it_came_from_europe.html", "urlToImage": null, "publishedAt": "2020-04-24T22:21:25Z", "content": "Gov. Andrew Cuomo (D-NY) argued the coronavirus that hit New York state did not come from China but Europe, probably Italy he said. At his Friday coronavirus press briefing, Cuomo said President Trump's China travel ban was too late and the horse had long lef… [+4682 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Hannah Miller", "title": "California launches meal delivery program for seniors amid coronavirus pandemic - CNBC", "description": "California Gov. Gavin Newsom announced the launch of a new program Friday called \"Restaurants Deliver: Home Meals for Seniors,\" which will use local eateries to prepare and deliver free food for older adults in need.", "url": "https://www.cnbc.com/2020/04/24/california-launches-meal-delivery-program-for-seniors-amid-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-24T21:35:44Z", "content": "California Gov. Gavin Newsom announced the launch of a new program Friday called \"Restaurants Deliver: Home Meals for Seniors,\" which will use local eateries to prepare and deliver free food for older adults in need.\r\nCreated through a partnership with the Fe… [+1577 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "T-Mobile confirms it's going to brick 5G on most Sprint 5G phones post-merger - Android Police", "description": "T-Mobile will shut down Sprint's 5G network in order to rework its spectrum into its own 5G grid. While those with a Galaxy S20 series device on Sprint", "url": "https://www.androidpolice.com/2020/04/24/t-mobile-confirms-its-going-to-brick-5g-on-most-sprint-5g-phones-post-merger/", "urlToImage": null, "publishedAt": "2020-04-24T21:06:31Z", "content": "This story was originally published 2020/04/22 11:47am PDTon Apr 22, 2020 and last updated 2020/04/24 1:56pm PDTApr 24, 2020. \r\nT-Mobile will shut down Sprint's 5G network in order to rework its spectrum into its own 5G grid. While those with a Galaxy S20 ser… [+3283 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Alex Woodward", "title": "Coronavirus: US will not participate in WHO vaccine project after Trump turned against it - The Independent", "description": "Despite snub, coalition of world leaders will support US during crisis: 'There should be no division in order to win this battle'", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-vaccine-who-project-trump-us-covid-19-a9483421.html", "urlToImage": null, "publishedAt": "2020-04-24T21:00:25Z", "content": "The US will not participate in a global effort with the World Health Organisation to develop drugs and a vaccine to combat the coronavirus.\r\nA spokesman for the US mission told Reuters that \"there will be no US official participation\" in the programme, which … [+2599 chars]"}, {"source": {"id": null, "name": "Extremetech.com"}, "author": "Ryan Whitwam", "title": "NASA JPL Engineers Design COVID-19 Ventilator in 37 Days - ExtremeTech", "description": "The unprecedented coronavirus pandemic has left many hospitals without enough ventilators, but companies like Tesla are trying to design new, easily built machines. Now, scientists from NASA's Jet Propulsion Laboratory (JPL) have created their own ventilator …", "url": "https://www.extremetech.com/extreme/309751-nasa-jpl-engineers-design-covid-19-ventilator-in-37-days", "urlToImage": null, "publishedAt": "2020-04-24T18:43:21Z", "content": "The unprecedented coronavirus pandemic has left many hospitals without enough ventilators, but companies like Tesla are trying to design new, easily built machines. Now, scientists from NASA’s Jet Propulsion Laboratory (JPL) have created their own ventilator … [+2209 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Sky Chadde and Kyle Bagenstose", "title": "USDA let poultry plants put workers close together even as they got sick from coronavirus. - USA TODAY", "description": "The USDA lets some poultry plants crowd lines to work faster. USA TODAY found coronavirus cases at more than one in ten of those plants.", "url": "https://www.usatoday.com/story/news/2020/04/24/usda-let-poultry-plants-move-faster-crowd-lines-covid-coronavirus-spread-meat-packing-workers/3013615001/", "urlToImage": null, "publishedAt": "2020-04-24T18:06:41Z", "content": "As coronavirus cases mounted at meatpacking plants this month, the federal government granted 15 poultry processors waivers to cut chickens faster, usually by crowding more workers onto their production lines. \r\nOverall, poultry plants with such waivers are a… [+5840 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Lydia Smith", "title": "Sunlight Kills Coronavirus Quickly, Says Top DHS Scientist - Newsweek", "description": "The research did not specify the intensity and wavelength of the UV light used in the experiment—and it's also not known whether the sunlight imitated the actual natural sunlight during the summer.", "url": "https://www.newsweek.com/sunlight-kills-coronavirus-scientist-1500012", "urlToImage": null, "publishedAt": "2020-04-24T14:35:21Z", "content": "Coronavirus can be destroyed by ultraviolet rays from the sun, a top U.S. scientist announced at a briefing from the White House coronavirus task force Thursday. William Bryan, science and technology advisor to the Department of Homeland Security (DHS) secret… [+6273 chars]"}]}