{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/julia-hollingsworth\">Julia Hollingsworth</a> and <a href=\"/profiles/brett-mckeehan\">Brett McKeehan</a>, CNN", "title": "Coronavirus pandemic: Updates from around the world - CNN International", "description": "The global coronavirus pandemic has brought countries around the world to a standstill. Here's the latest updates on worldwide Covid-19 cases, deaths, government responses and more.", "url": "https://www.cnn.com/world/live-news/coronavirus-pandemic-04-25-20-intl/index.html", "urlToImage": null, "publishedAt": "2020-04-25T06:08:00Z", "content": "Rubel, a 28-year-old migrant worker in Singapore, is afraid. The dormitory he and other foreign workers live in has been locked down, and nobody is allowed in or out as government officials scramble to contain the country's novel coronavirus outbreak.\r\nWhat's… [+1739 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Mike Freeman", "title": "NFL Draft Day 2 Notebook: Hurts No Novelty for Eagles, and Wentz Should Know It - Bleacher Report", "description": "One of the more creative minds in football is Eagles coach Doug Pederson.  One of the most brittle quarterbacks in football is Carson Wentz.  One of the most versatile and talented athletes in the draft is Oklahoma quarterback Jalen Hurts...", "url": "https://bleacherreport.com/articles/2888469-nfl-draft-day-2-notebook-hurts-no-novelty-for-eagles-and-wentz-should-know-it", "urlToImage": null, "publishedAt": "2020-04-25T05:53:42Z", "content": "Michael Conroy/Associated Press\r\nOne of the more creative minds in football is Eagles coach Doug Pederson.\r\nOne of the most brittle quarterbacks in football is Carson Wentz.\r\nOne of the most versatile and talented athletes in the draft is Oklahoma quarterback… [+7123 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Connie Liou", "title": "Who Plays Magda on 'Penny Dreadful: City of Angels'? Natalie Dormer Portrays Showtime's Latest Supernatural Antagonist - Showbiz Cheat Sheet", "description": "Who plays Magda, Elsa, Rio, and Alex on 'Penny Dreadful: City of Angels'? Here's Natalie Dormer's latest project after 'Game of Thrones'.", "url": "https://www.cheatsheet.com/entertainment/magda-penny-dreadful-city-of-angels-natalie-dormer-alex-rio-elsa.html/", "urlToImage": null, "publishedAt": "2020-04-25T04:33:27Z", "content": "ThePenny Dreadful spinoff, City of Angels, may not star Eva Green, but the shows cast still packs a powerful punch. The new Showtime original series includes fan-favorites such as Nathan Lane and Alex Rodriguez. But Natalie Dormer — who plays Magda, Elsa, Rio… [+4684 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "NBC Sports Staff", "title": "2020 NFL Draft order: Latest list of all picks, selections from Round 1 through Round 7 - NBC Sports - Misc.", "description": "The 2020 NFL Draft is happening now for all 32 teams and runs through Saturday, April 25. Rounds 2 and 3 will air on Friday, while rounds 4-7 are on Saturday. For those who want to see where every pick is in the NFL Draft order, see below. For the first time …", "url": "https://sports.nbcsports.com/2020/04/25/nfl-draft-order-2020/", "urlToImage": null, "publishedAt": "2020-04-25T04:08:00Z", "content": "The 2020 NFL Draft is happening now for all 32 teams and runs through Saturday, April 25. Rounds 2 and 3 will air on Friday, while rounds 4-7 are on Saturday. For those who want to see where every pick is in the NFL Draft order, see below.\r\nFor the first time… [+9697 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "HOLLY OTTERBEIN", "title": "New evidence surfaces in Tara Reade allegation against Biden - POLITICO", "description": "A 1993 video appears to show her mother calling the Larry King Show to discuss a claim against “a prominent senator.”", "url": "https://www.politico.com/news/2020/04/24/tara-reade-biden-video-207670", "urlToImage": null, "publishedAt": "2020-04-25T04:00:33Z", "content": "King asked the woman, She had a story to tell but, out of respect for the person she worked for, she didnt tell it?\" \r\nThe caller replied, \"That's true.\"\r\nIn March, Reade accused Biden of digitally penetrating her in 1993 without her consent. Last year, she t… [+1738 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Samantha Previte", "title": "Aaron Rodgers congratulates Jordan Love after 2020 NFL Draft stunner - New York Post ", "description": "Aaron Rodgers is on good terms with his potential successor — for now — after a dramatic start to Jordan Love’s career with the Packers. While the 15-year veteran was not consulte…", "url": "https://nypost.com/2020/04/24/nfl-draft-2020-aaron-rodgers-congratulates-jordan-love/", "urlToImage": null, "publishedAt": "2020-04-25T03:39:58Z", "content": "Aaron Rodgers is on good terms with his potential successor — for now — after a dramatic start to Jordan Love’s career with the Packers.\r\nWhile the 15-year veteran was not consulted about Green Bay’s first-round scheme to trade with the Dolphins and nab the s… [+1847 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Tom Gillespie", "title": "Kanye West: Hip hop star and fashion designer becomes a billionaire - Sky News", "description": "The rapper, who has long coveted the status, has claimed he is worth more after his net worth was valued at $1.3bn (£1.05bn).", "url": "https://news.sky.com/story/kanye-west-hip-hop-star-and-fashion-designer-becomes-a-billionaire-11978510", "urlToImage": null, "publishedAt": "2020-04-25T03:39:04Z", "content": null}, {"source": {"id": null, "name": "Ksl.com"}, "author": "https://www.facebook.com/kslcom/", "title": "Giant asteroid flying by Earth next week looks like it's wearing a face mask - KSL.com", "description": "An asteroid estimated to be 1.2 miles wide will fly by Earth next week, but it's not expected to collide with our planet.", "url": "https://www.ksl.com/article/46744600/giant-asteroid-flying-by-earth-next-week-looks-like-its-wearing-a-face-mask", "urlToImage": null, "publishedAt": "2020-04-25T02:57:43Z", "content": "ATLANTA (CNN) An asteroid estimated to be 1.2 miles wide will fly by Earth next week, but it's not expected to collide with our planet.\r\nAnd if an asteroid could be aware of such things, it appears to be wearing a face mask in deference to the pandemic, accor… [+2872 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Dom Phillips", "title": "Brazilian government in turmoil after justice minister resigns - The Guardian", "description": "President Jair Bolsonaro denies he sought to influence federal police inquiries", "url": "https://www.theguardian.com/world/2020/apr/24/justice-ministers-sacking-plunges-brazil-into-turmoil", "urlToImage": null, "publishedAt": "2020-04-25T02:34:52Z", "content": "Brazils government has been plunged into turmoil after the resignation of one of Jair Bolsonaros most powerful ministers sparked protests, calls for the presidents impeachment and an investigation into claims he had improperly interfered in the countrys feder… [+3829 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Stephen Nellis", "title": "Showdown looms between Silicon Valley, U.S. states over contact tracing apps - Reuters", "description": "U.S. states promoting apps that could prove essential to ending the coronavirus lockdown may be headed for a showdown with the two Silicon Valley companies that control key software on 99% of smartphones over the collection of sensitive GPS location data.", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-apps-idUSKCN22702F", "urlToImage": null, "publishedAt": "2020-04-25T01:56:24Z", "content": "SAN FRANCISCO (Reuters) - U.S. states promoting apps that could prove essential to ending the coronavirus lockdown may be headed for a showdown with the two Silicon Valley companies that control key software on 99% of smartphones over the collection of sensit… [+5217 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Matt Keeley, Tom O'Connor, Naveed Jamali", "title": "China Sends Doctors to North Korea as TV Report Fuels Speculation About Kim Jong Un's Health - Newsweek", "description": "China has sent a team of doctors to North Korea to help determine Supreme Leader of North Korea Kim Jong Un's health status, Reuters reported on Friday. Hong Kong state media reported that Kim was...", "url": "https://www.newsweek.com/china-sends-doctors-north-korea-tv-report-fuels-speculation-kim-jong-un-dead-1500181", "urlToImage": null, "publishedAt": "2020-04-25T01:14:30Z", "content": "China has sent a team of doctors to North Korea to help determine supreme leader of North Korea Kim Jong Un's health status, Reuters reported on Friday. Hong Kong Satellite Television reported that Kim was dead, though there has been no confirmation from U.S.… [+4451 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rosa Flores, Sara Weisfeldt and Arman Azad, CNN", "title": "2 studies show many people who tested positive for Covid-19 displayed no symptoms - CNN", "description": "Two coronavirus studies released Friday -- one involving almost 2,000 people from Florida and the other from a Washington state nursing home -- came to the same conclusion: Many of the people who tested positive for the virus didn't know it they had it becaus…", "url": "https://www.cnn.com/2020/04/24/us/2-asymptomatic-coronavirus-studies/index.html", "urlToImage": null, "publishedAt": "2020-04-25T00:54:57Z", "content": null}, {"source": {"id": null, "name": "Nj.com"}, "author": "Sophie Nieto-Munoz | NJ Advance Media for NJ.com, Michael Sol Warren | NJ Advance Media for NJ.com", "title": "You can pay rent with your security deposit during coronavirus pandemic, Murphy orders - NJ.com", "description": "“We are all in this together, tenants and landlords, and we can only emerge stronger when no one, and I mean no one, fears for their home or residence,” Gov. Phil Murphy said.", "url": "https://www.nj.com/politics/2020/04/you-can-pay-rent-with-your-security-deposit-during-coronavirus-pandemic-murphy-orders.html", "urlToImage": null, "publishedAt": "2020-04-25T00:29:00Z", "content": "New Jersey renters struggling to pay rent during the coronavirus pandemic can now use their security deposits for help.\r\nGov. Phil Murphy issued an executive order Friday that allows renters in the state to direct their landlords to tap into the previously pa… [+3722 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Blake Ellis and Melanie Hicken, CNN", "title": "Covid-19 is ravaging nursing homes. Government records show why - CNN", "description": "Government records reveal how supply shortages, lapses in care, a lack of transparency and inadequate infection control precautions are fueling the spread of Covid-19 within America's nursing homes.", "url": "https://www.cnn.com/2020/04/24/us/nursing-homes-coronavirus-invs/index.html", "urlToImage": null, "publishedAt": "2020-04-25T00:25:11Z", "content": "(CNN)Government records reveal how supply shortages, lapses in care, a lack of transparency and inadequate infection control precautions are fueling the spread of Covid-19 within America's nursing homes. \r\nTroubled facilities and highly rated nursing homes al… [+20126 chars]"}, {"source": {"id": null, "name": "Cinemablend.com"}, "author": "Laura Hurley", "title": "Blue Bloods Actor Nick Cordero's Wife Says He Should Have Woken From Coma By Now - CinemaBlend", "description": "Amanda Kloots provides an update on her husband's condition.", "url": "https://www.cinemablend.com/television/2495108/blue-bloods-actor-nick-corderos-wife-says-he-should-have-woken-from-coma-by-now", "urlToImage": null, "publishedAt": "2020-04-25T00:23:14Z", "content": "Blue Bloods actor and popular TV guest star Nick Cordero has been fighting for his life after a diagnosis with COVID-19, and his wife Amanda Kloots has been providing regular updates on his condition. Her updates have provided a window into the illness as wel… [+2833 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Declan Walsh", "title": "As Ramadan Begins, Muslims (Mostly) Accede to Pandemic Orders - The New York Times", "description": "Islam’s most sacred sites were largely deserted as the holy month started, but Muslims in some places were resisting in ways that could spread the coronavirus.", "url": "https://www.nytimes.com/2020/04/24/world/middleeast/coronavirus-ramadan-2020.html", "urlToImage": null, "publishedAt": "2020-04-25T00:18:09Z", "content": "CAIRO It was a rare moment in the 1,400-year history of Islam, and another sobering milestone in the march of the coronavirus.\r\nOn Friday, the first day of Ramadan, silence shrouded the Kaaba, the black cube-shaped structure that Muslims face while praying, a… [+4778 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Morgan McFall-Johnsen, Business Insider", "title": "NASA Has Designed a Mass-Producible Ventilator For a Second Wave of COVID-19 - ScienceAlert", "description": "NASA engineers have designed a mass-producible ventilator tailored to coronavirus patients, and it could get emergency approval from the Food and Drug Administration by the weekend.", "url": "https://www.businessinsider.com/nasa-designs-cheap-simple-coronavirus-ventilator-mass-production-2020-4?utm_source=feedburner&amp%3Butm_medium=referral&utm_medium=feed&utm_campaign=Feed%3A+businessinsider+%28Business+Insider%29&r=US&IR=T", "urlToImage": null, "publishedAt": "2020-04-24T23:52:28Z", "content": "NASA engineers have designed a mass-producible ventilator tailored to coronavirus patients, and it could get emergency approval from the Food and Drug Administration by the weekend.\r\nA team of engineers at the Jet Propulsion Laboratory in Pasadena, California… [+4024 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Next round of small-business loans under controversial coronavirus-aid program starts Monday - Seattle Times", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMigwFodHRwczovL3d3dy5zZWF0dGxldGltZXMuY29tL2J1c2luZXNzL25leHQtcm91bmQtb2Ytc21hbGwtYnVzaW5lc3MtbG9hbnMtdW5kZXItY29udHJvdmVyc2lhbC1jb3JvbmF2aXJ1cy1haWQtcHJvZ3JhbS1zdGFydHMtbW9uZGF5L9IBiQFodHRwczovL3d3dy5zZWF0dGxldGltZXMuY29tL2J1c2luZXNzL25leHQtcm91bmQtb2Ytc21hbGwtYnVzaW5lc3MtbG9hbnMtdW5kZXItY29udHJvdmVyc2lhbC1jb3JvbmF2aXJ1cy1haWQtcHJvZ3JhbS1zdGFydHMtbW9uZGF5Lz9hbXA9MQ?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T23:44:00Z", "content": null}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Laurie McGinley, Christopher Rowland, Yasmeen Abutaleb, Carolyn Y. Johnson", "title": "FDA warns about hydroxychloroquine dangers, citing serious heart issues, including death - The Washington Post", "description": "The FDA warned Friday that people should not take chloroquine and hydroxychloroquine for covid-19 outside of a hospital or clinical trial, citing reports of « serious heart rhythm problems. »", "url": "https://www.washingtonpost.com/health/2020/04/24/fda-warns-about-hydroxychloroquine-dangers-citing-serious-heart-issues-including-death/", "urlToImage": null, "publishedAt": "2020-04-24T23:01:35Z", "content": "An increasing number of studies and reports have raised safety issues, making the drugs an example of how the presidents embrace of unproven medical ideas has potentially endangered Americans lives and put health agencies in a tough spot.\r\nOn Thursday, after … [+9358 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Julia Alexander", "title": "Sony delays Spider-Man films, forcing Marvel to move Doctor Strange and Thor sequels again - The Verge", "description": "Spider-Man: Into the Spider-Verse and the third movie in the Spider-Man: Homecoming trilogy are getting delayed as Sony messes with its release schedule. As a result, Doctor Strange into the Multiverse and Thor: Love and Thunder have been delayed for a second…", "url": "https://www.theverge.com/2020/4/24/21235283/spider-man-spiderverse-homecoming-delay-release-date-trilogy-marvel-venom-doctor-strange-thor", "urlToImage": null, "publishedAt": "2020-04-24T22:45:42Z", "content": "But Uncharted gets an early release date\r\nPhoto: Sony Pictures Entertainment\r\nLike almost every other studio, Sony is moving around its film schedule because of the novel coronavirus. That means its two biggest Spider-Man movies will be delayed. \r\nThe sequel … [+1662 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Air France-KLM secures billions in government aid - BBC News", "description": "Like many other airlines, the Franco-Dutch group has been badly hit by the coronavirus outbreak.", "url": "https://www.bbc.com/news/world-europe-52420312", "urlToImage": null, "publishedAt": "2020-04-24T22:18:16Z", "content": "Image copyrightReutersImage caption\r\n Air France-KLM's boss said the company would rethink its operating model \"immediately\"\r\nAir France-KLM has secured at least 9bn (£7.9bn; $9.7bn) in government aid, as the Franco-Dutch airline group struggles to stay afloa… [+1104 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Ellen Mitchell", "title": "Overnight Defense: Navy recommends reinstating Crozier | Virus outbreak on US destroyer | Troops sue Pentagon to become naturalized citizens | TheHill - The Hill", "description": "Happy Friday and welcome to Overnight Defense. I'm Ellen Mitchell, and...", "url": "https://thehill.com/policy/defense/overnights/494596-overnight-defense-navy-recommends-reinstating-capt-crozier-virus", "urlToImage": null, "publishedAt": "2020-04-24T22:14:20Z", "content": "Happy Friday and welcome to Overnight Defense. I'm Ellen Mitchell, and here's your nightly guide to the latest developments at the Pentagon, on Capitol Hill and beyond. CLICK HERE to subscribe to the newsletter.\r\nTHE TOPLINE: The Navy has recommended reinstat… [+8379 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Mike Bohn", "title": "'Fight Island' update: Dana White plans beachfront octagon, shows 'up and running by June' - MMA Junkie", "description": "UFC president Dana White maintains his promise that “Fight Island” is a real thing.", "url": "https://mmajunkie.usatoday.com/2020/04/fight-island-update-dana-white-beachfront-octagon-june-events", "urlToImage": null, "publishedAt": "2020-04-24T22:02:32Z", "content": "UFC president Dana White maintains “Fight Island” is a real thing, and the venue will be prepared to host events inside two months.\r\nAlthough the location is still unknown, White insists the private island he’s secured in the wake of the coronavirus pandemic … [+1597 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Gabrielle Fonrouge", "title": "Today's coronavirus update: Gym, barbers reopen in Georgia; Michigan acquiesces - New York Post ", "description": "Georgia became the first state in the US to reopen some nonessential businesses — despite a sharp rebuke from President Trump, who said he “wasn’t happy” with the decision.  Gov. Br…", "url": "https://nypost.com/2020/04/24/todays-coronavirus-update-georgia-reopens-michigan-acquiesces/", "urlToImage": null, "publishedAt": "2020-04-24T21:50:44Z", "content": "Georgia became the first state in the US to reopen some nonessential businesses — despite a sharp rebuke from President Trump, who said he wasnt happy with the decision. \r\nGov. Brian Kemp forged ahead with the plan anyway and opened the doors of gyms, barbers… [+1231 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Phil LeBeau", "title": "Boeing pushes back target date for fixing 737 Max as coronavirus hinders progress - CNBC", "description": "Boeing still needs to complete two software updates and clear a number of other hurdles, including a recertification flight, before the Max can be cleared to return to commercial service.", "url": "https://www.cnbc.com/2020/04/24/boeing-737-max-fix-date-quietly-pushed-back-amid-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-24T21:49:29Z", "content": "Boeing is once again pushing back the time frame for when it expects to have the 737 Max recertified for flight as the coronavirus pandemic hinders progress. Sources familiar with the latest expectations for fixing the Max tell CNBC that the plane is unlikely… [+1607 chars]"}, {"source": {"id": null, "name": "Abc6onyourside.com"}, "author": "Stephen Loiaconi", "title": "Biden benefits from staying out of spotlight amid coronavirus outbreak, experts say - ABC6OnYourSide.com", "description": "Former Vice President Joe Biden is building a lead over President Donald Trump in key swing states, new polls suggest, as voters question Trump&rsquo;s response to the coronavirus outbreak and pay relatively little attention to anything Biden is doing at all.…", "url": "http://abc6onyourside.com/news/nation-world/biden-benefits-from-staying-out-of-spotlight-amid-coronavirus-outbreak-experts-say", "urlToImage": null, "publishedAt": "2020-04-24T21:37:00Z", "content": null}, {"source": {"id": null, "name": "Tmonews.com"}, "author": "Alex Wagner", "title": "iPhone SE launches today, Costco rolls out deal for T-Mobile customers - TmoNews", "description": "A little over a week after Apple surprised us with an updated iPhone SE, the new device has officially launche", "url": "https://www.tmonews.com/2020/04/iphone-se-launch-today-costco-deal-t-mobile-customers/", "urlToImage": null, "publishedAt": "2020-04-24T21:33:27Z", "content": "A little over a week after Apple surprised us with an updated iPhone SE, the new device has officially launched.\r\nThe iPhone SE is in stock and ready to ship at T-Mobile. The 64GB and 256GB have estimated ship dates of April 24-27, but you may have to wait a … [+1585 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Alex Woodward", "title": "Coronavirus: US will not participate in WHO vaccine project after Trump turned against it - The Independent", "description": "Despite snub, coalition of world leaders will support US during crisis: 'There should be no division in order to win this battle'", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-vaccine-who-project-trump-us-covid-19-a9483421.html", "urlToImage": null, "publishedAt": "2020-04-24T21:00:25Z", "content": "The US will not participate in a global effort with the World Health Organisation to develop drugs and a vaccine to combat the coronavirus.\r\nA spokesman for the US mission told Reuters that \"there will be no US official participation\" in the programme, which … [+2599 chars]"}, {"source": {"id": null, "name": "Threatpost.com"}, "author": "Tara Seals", "title": "Latest Apple Text-Bomb Crashes iPhones via Message Notifications - Threatpost", "description": "Sindhi-language characters can crash iPhones and other iOS/macOS devices if a victim views texts, Twitter posts or messages within various apps containing them.", "url": "https://threatpost.com/apple-text-bomb-crashes-iphones-message-notifications/155144/", "urlToImage": null, "publishedAt": "2020-04-24T20:41:00Z", "content": "Sindhi-language characters can crash iPhones and other iOS/macOS devices if a victim views texts, Twitter posts or messages within various apps containing them.Apple devices are vulnerable to a “text bomb” attack where simply looking at messages or posts cont… [+3338 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Mindy Weisberger", "title": "Black hole bends escaping light 'like a boomerang' - Livescience.com", "description": "Even light can't resist the pull of these irresistible cosmic objects.", "url": "https://www.livescience.com/black-hold-bends-light-like-boomerang.html", "urlToImage": null, "publishedAt": "2020-04-24T20:39:00Z", "content": "Light escaping from a black hole may \"boomerang\" its way to freedom, new X-ray images reveal.\r\nResearchers found this odd behavior while reviewing archival X-ray\r\n observations of a black hole that's approximately 10 times as massive as our sun. Located about… [+3950 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Georgia mayor on reopening: It's like the 'Twilight Zone' - CNN", "description": "Atlanta Mayor Keisha Lance Bottoms pleads for residents to stay home, despite Governor Brian Kemp lifting shelter-in-place orders and reopening some nonessen...", "url": "https://www.youtube.com/watch?v=u6pBm-JaupA", "urlToImage": null, "publishedAt": "2020-04-24T20:32:09Z", "content": null}, {"source": {"id": null, "name": "Snopes.com"}, "author": "Associated Press", "title": "Canada Mass Shooting Started with Assault on Girlfriend - Snopes.com", "description": "The weekend shooting rampage started with an assault by the suspect on his girlfriend and ended with 22 people dead in communities across central and northern Nova Scotia.", "url": "https://www.snopes.com/ap/2020/04/24/canada-mass-shooting-started-with-assault-on-girlfriend/", "urlToImage": null, "publishedAt": "2020-04-24T19:23:29Z", "content": "TORONTO (AP) Canadas worst mass shooting erupted from an argument between the gunman and his girlfriend, who survived the attack, police have confirmed.\r\nRoyal Canadian Mounted Police Supt. Darren Campbell said the weekend shooting rampage started with an ass… [+5247 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": null, "title": "Facebook launches ‘Messenger Rooms’ as a Zoom and Group FaceTime alternative - 9to5Mac", "description": "Facebook is out today with a new product to connect multiple people via video chat and compete with popular offerings like Zoom, Group FaceTime, Skype, Houseparty, and more. Detailed by TechCrunch, Facebook announced a number of messaging updates today with t…", "url": "https://9to5mac.com/2020/04/24/facebook-launches-messenger-rooms-as-a-zoom-and-group-facetime-alternative/", "urlToImage": null, "publishedAt": "2020-04-24T18:47:18Z", "content": "Facebook is out today with a new product to connect multiple people via video chat and compete with popular offerings like Zoom, Group FaceTime, Skype, Houseparty, and more.\r\nDetailed by TechCrunch, Facebook announced a number of messaging updates today with … [+3683 chars]"}, {"source": {"id": null, "name": "Dispatch.com"}, "author": "Max Filby", "title": "Coronavirus: Antibody testing coming to Columbus-area hospitals - The Columbus Dispatch", "description": "Testing for COVID-19 antibodies could soon be available throughout Ohio. Experts say the testing could be key to restarting the economy on a large scale.", "url": "https://www.dispatch.com/article/20200424/NEWS/200429239", "urlToImage": null, "publishedAt": "2020-04-24T18:38:49Z", "content": "Testing for COVID-19 antibodies may soon be available throughout Ohio. Experts say it could be key to restarting the economy on a large scale.\r\nCentral Ohio hospitals could start testing for COVID-19 antibodies in patients as soon as next week.\r\nThe testing, … [+4501 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Jane C. Timm", "title": "Trump says he was being sarcastic with comments about injecting disinfectants - NBC News", "description": "President Donald Trump claimed that his remarks on injecting disinfectants to treat COVID-19 was sarcasm, after doctors responded with horror at his comments.", "url": "https://www.nbcnews.com/politics/donald-trump/trump-says-he-was-being-sarcastic-comments-about-injecting-disinfectants-n1191991", "urlToImage": null, "publishedAt": "2020-04-24T18:07:25Z", "content": "President Donald Trump said Friday that his remarks on injecting disinfectants to treat COVID-19 were sarcasm, after doctors responded with horror and disinfectant manufacturers urged people not to ingest the poisonous substances.\r\n\"I was asking a question sa… [+2111 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Michael Sheetz", "title": "NASA's Hubble telescope launched 30 years ago – here's a look at Lockheed Martin building it - CNBC", "description": "NASA launched the immense Hubble space telescope thirty years ago on Friday.", "url": "https://www.cnbc.com/2020/04/24/nasas-hubble-telescope-launch-anniversary-built-by-lockheed-martin.html", "urlToImage": null, "publishedAt": "2020-04-24T17:03:12Z", "content": "Lockheed Martin technicians examine part of NASA's Hubble Space Telescope during assembly.\r\nNASA launched the immense Hubble space telescope thirty years ago on Friday, a spacecraft that helped astronomers make numerous discoveries and is still operating in o… [+1404 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Alessandra Malito", "title": "Retirement savers have been following generic financial advice — according to Fidelity — and that’s a good thing right now - MarketWatch", "description": "The coronavirus crisis has upended many Americans’ finances, but some investors are ‘staying the course’", "url": "https://www.marketwatch.com/story/retirement-savers-have-been-following-generic-financial-advice-according-to-fidelity-and-thats-a-good-thing-right-now-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T16:17:45Z", "content": "At a time of heightened uncertainty about health, the economy and personal financial status retirement savers didnt falter, at least according to first-quarter data Fidelity Investments released on Friday. Not only did 401(k) contribution rates remain steady … [+4880 chars]"}, {"source": {"id": null, "name": "Wreg.com"}, "author": "CNN Wire", "title": "COVID-19 causes sudden strokes in young adults, doctors say - wreg.com", "description": "The new coronavirus may be causing sudden strokes in adults in their 30s and 40s who are not otherwise terribly ill, doctors reported Wednesday.", "url": "https://wreg.com/news/covid-19-causes-sudden-strokes-in-young-adults-doctors-say/", "urlToImage": null, "publishedAt": "2020-04-23T16:00:00Z", "content": "NEW YORK The new coronavirus may be causing sudden strokes in adults in their 30s and 40s who are not otherwise terribly ill, doctors reported Wednesday.\r\nThey said patients may be unwilling to call 911 because they have heard hospitals are overwhelmed by cor… [+2540 chars]"}]}