{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Cnet.com"}, "author": "Ian Sherr", "title": "Apple, Google address privacy concerns with coronavirus tracking tech - CNET", "description": "The tech giants added new security features for their iPhone and Android phone technology.", "url": "https://www.cnet.com/news/apple-google-address-privacy-concerns-with-coronavirus-tracking-tech/", "urlToImage": null, "publishedAt": "2020-04-26T18:26:48Z", "content": "Background by Pixabay/Photo by Angela Lang/CNET\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nAs companies and governments around the world battle the coronavirus pandemic, Apple and Google are making ch… [+4845 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "2020 NFL Draft: Grades and full analysis for every player selected in second round - CBS Sports", "description": "Chris Trapasso grades the second day of the 2020 NFL Draft", "url": "https://www.cbssports.com/nfl/news/2020-nfl-draft-grades-and-full-analysis-for-every-player-selected-in-second-round/", "urlToImage": null, "publishedAt": "2020-04-26T18:22:15Z", "content": "Want to know what I thought of every pick made in the second round of the 2020 NFL Draft? You can read below as I graded all the Round 2 picks from Friday night. Be sure to refresh this page throughout the night to get the latest grades from Day 3. You can al… [+7994 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Pam Belluck", "title": "32 Days on a Ventilator: One Covid Patient’s Fight to Breathe Again - The New York Times", "description": "Jim Bello, 49 and healthy, fell gravely ill, highlighting agonizing mysteries of the coronavirus. Doctors’ relentless effort to save him was a roller-coaster of devastating and triumphant twists.", "url": "https://www.nytimes.com/2020/04/26/health/coronavirus-patient-ventilator.html", "urlToImage": null, "publishedAt": "2020-04-26T18:18:44Z", "content": "HINGHAM, Mass. Is he going to make it? Kim Bello asked, clutching her phone, alone in her yard.\r\nShe had slipped outside so her three children, playing games in the living room, could be shielded from a wrenching conversation with a doctor treating her husban… [+15430 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Caroline Linton", "title": "Coronavirus updates: Global cases near 3 million as CDC flags new symptoms - CBS News", "description": "There are more than 52,000 deaths in the United States, according to a tally from Johns Hopkins University​.", "url": "https://www.cbsnews.com/live-updates/coronavirus-update-covid-19-2020-04-26/", "urlToImage": null, "publishedAt": "2020-04-26T18:06:57Z", "content": "New York Governor Andrew Cuomo outlined his vision for reopening the state Sunday, saying it will be a gradual process which will allow for the state to monitor the spread of COVID-19 as businesses reopen\r\n\"We're going to reopen in phases,\" Cuomo said. \"Look … [+1195 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Brad Pitt plays Anthony Fauci in SNL's star-studded at-home episode - Washington Post", "description": "Brad Pitt, Miley Cyrus, Paul Rudd, Adam Sandler and others appeared on the second at-home episode of “Saturday Night Live” on April 25. Read more: https://wa...", "url": "https://www.youtube.com/watch?v=IBPNoCJQgio", "urlToImage": null, "publishedAt": "2020-04-26T17:47:51Z", "content": "Brad Pitt, Miley Cyrus, Paul Rudd, Adam Sandler and others appeared on the second at-home episode of Saturday Night Live on April 25. Read more: https://wapo.st/2VCtyYD. SPECIAL OFFER: To thank you for your support, heres a deal on a Washington Post digital s… [+294 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Kristin Cavallari and Jay Cutler Announce Divorce - TMZ", "description": "Kristin Cavallari just dropped some sad and actually shocking news ... she and Jay Cutler are throwing in the towel on their decade-long relationship.", "url": "https://www.tmz.com/2020/04/26/kristin-cavallari-and-jay-cutler-divorcing/", "urlToImage": null, "publishedAt": "2020-04-26T17:37:00Z", "content": "Kristin Cavallari just dropped some sad and actually shocking news ... she and Jay Cutler are throwing in the towel on their decade-long relationship.\r\nKristin just said, \"With great sadness, after 10 years together we have come to a loving conclusion to get … [+1211 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "Chuck Saletta", "title": "Should You Invest New Money During the Coronavirus Pandemic? - The Motley Fool", "description": "Fortunes are made during bear markets and only revealed during bull runs.", "url": "https://www.fool.com/retirement/2020/04/26/should-you-invest-new-money-during-the-coronavirus.aspx", "urlToImage": null, "publishedAt": "2020-04-26T16:40:20Z", "content": "Efforts to blunt the impact of the coronavirus pandemic have led to some of the most abrupt negative economic changes in modern history. First-time unemployment claims hit record highs as businesses shuttered or were otherwise restricted to reduce gatherings … [+4732 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Unemployment rate could reach Great Depression levels: Trump economic adviser | ABC News - ABC News", "description": "White House senior adviser Kevin Hassett is interviewed on \"This Week.\" #ABCNews #ThisWeek #UnemploymentRate #Economy #KevinHassett", "url": "https://www.youtube.com/watch?v=386HKy4kfGE", "urlToImage": null, "publishedAt": "2020-04-26T16:27:50Z", "content": null}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Susan Miller", "title": "These are the 6 new possible symptoms of the coronavirus the CDC added to its list - USA TODAY", "description": "Chills, repeated shaking with chills, muscle pain, headache, sore throat and a loss of taste or smell are the new symptoms added to the CDC list.", "url": "https://www.usatoday.com/story/news/health/2020/04/26/coronavirus-symptoms-cdc-adds-six-new-symptoms-covid-19/3029438001/", "urlToImage": null, "publishedAt": "2020-04-26T16:18:45Z", "content": "The secret to fighting COVID-19 could be in recovered patients. Here's how antibodies could lead to a treatment for those fighting coronavirus.\r\nUSA TODAY\r\nChills, repeated shaking with chills, muscle pain, headache, sore throat and a loss of taste or smell.\r… [+2926 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Nate Day", "title": "Meghan Markle, Prince Harry mourn loss of 18-year-old fan in heartfelt letter - Fox News", "description": "Meghan Markle and Prince Harry are in mourning.", "url": "https://www.foxnews.com/entertainment/meghan-markle-prince-harry-mourn-loss-18-year-old-fan-letter", "urlToImage": null, "publishedAt": "2020-04-26T16:09:44Z", "content": "Meghan Markle and Prince Harry are in mourning.\r\nA young fan of the royal duo, Holly Smallman, recently died at the age of 18, according to Daily Mail. Harry had previously met Smallman at a charity event.\r\nMEGHAN MARKLE IS WILLING TO TESTIFY IN PRIVACY LAWSU… [+2245 chars]"}, {"source": {"id": null, "name": "Sciencemag.org"}, "author": null, "title": "New York clinical trial quietly tests heartburn remedy against coronavirus - Science Magazine", "description": "Hospital data from China and a classified drug screening program led to the rapid launch of $21 million study", "url": "https://www.sciencemag.org/news/2020/04/new-york-clinical-trial-quietly-tests-heartburn-remedy-against-coronavirus", "urlToImage": null, "publishedAt": "2020-04-26T16:00:00Z", "content": "The heartburn remedy famotidine may disable a key enzyme that the new coronavirus uses to make copies (gold) of itself.\r\nNIH \r\nBy Brendan BorrellApr. 26, 2020 , 12:00 PM\r\nSciences COVID-19 reporting is supported by the Pulitzer Center.\r\nThe fast-growing list … [+8078 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Danielle Wallace", "title": "Louisiana pastor placed on house arrest, ordered not to hold services amid coronavirus stay-at-home order - Fox News", "description": "The embattled Louisiana pastor who repeatedly flouted social distancing measures was placed on house arrest Saturday after refusing to tell a judge if he’d continue to hold Sunday services in defiance of orders to stay at home to limit the impact of the coron…", "url": "https://www.foxnews.com/us/louisiana-pastor-house-arrest-stay-at-home-order-coronavirus-tony-spell", "urlToImage": null, "publishedAt": "2020-04-26T15:48:52Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox.  Sign up here.\r\nThe embattled Louisiana pastor who repeatedly flouted social distancing measures was placed on house arrest Saturday after refusing to tell a judge if he’d continue… [+4419 chars]"}, {"source": {"id": null, "name": "Vox.com"}, "author": "Anya van Wagtendonk", "title": "Trump dismisses daily coronavirus press briefings as “not worth the time & effort” - Vox.com", "description": "After blowblack from his suggestion bleach be investigated as a coronavirus cure, Trump expressed his frustration with his daily news conferences on Twitter.", "url": "https://www.vox.com/coronavirus-covid19/2020/4/26/21237309/trump-dismisses-his-daily-coronavirus-press-briefings-as-not-worth-the-time-effort", "urlToImage": null, "publishedAt": "2020-04-26T15:47:16Z", "content": "President Donald Trump has expressed growing frustration with his daily coronavirus-related press conferences, calling them not worth the time and effort Saturday.\r\nThe sentiment, coming days after an erratic briefing at which Trump incorrectly suggested that… [+5770 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Yasmeen Abutaleb, Josh Dawsey", "title": "White House officials weigh replacement of HHS Secretary Alex Azar - The Washington Post", "description": "", "url": "https://www.washingtonpost.com/politics/2020/04/26/trump-alexazar-replacement/", "urlToImage": null, "publishedAt": "2020-04-26T15:14:20Z", "content": "Several top White House aides are discussing Azars removal and have mused over possible replacements, but President Trump has not weighed in, said five people familiar with the talks who spoke on the condition of anonymity to be candid. It remains unclear whe… [+4889 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Jennifer Van Grove, Andrew J. Campa, Alex Wigglesworth", "title": "Coronavirus: 3 arrests at California stay-home order protest - Los Angeles Times", "description": "About 75 to 100 people gathered near a San Diego County beach to protest stay-at-home orders that also limit access to public parks and beaches.", "url": "https://www.latimes.com/california/story/2020-04-26/3-arrested-beach-protest-california-stay-home-order", "urlToImage": null, "publishedAt": "2020-04-26T14:36:36Z", "content": "Three people protesting Californias stay-at-home order Saturday in an Encinitas protest were arrested on suspicion of violating San Diego County health orders, marking the latest in a series of rallies along the coast.\r\nAbout 75 to 100 people gathered near th… [+4530 chars]"}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "Christian D'Andrea, Morgan Moriarty, Adam Stites", "title": "The NFL undrafted free agents we’re most excited about in 2020 - SB Nation", "description": "Not everyone gets drafted — but that’s not necessarily the end of the road.", "url": "https://www.sbnation.com/nfl/2020/4/26/21236205/nfl-undrafted-free-agents-2020-udfa-favorites-thaddeus-moss-anthony-gordon", "urlToImage": null, "publishedAt": "2020-04-26T14:05:40Z", "content": "By the time the clock struck 7 p.m. ET on Saturday, 255 players heard their names called at the 2020 NFL Draft. Many will go on to have an impact in the league as rookies but they wont be alone.\r\nEvery year, players rise up from the ranks of the undrafted to … [+8044 chars]"}, {"source": {"id": null, "name": "Salon.com"}, "author": "Bob Brigham", "title": "Dr. Birx complains to Fox News' Jesse Watters about press coverage of Trump's coronavirus briefings - Salon", "description": "Dr. Birx complains about press coverage of Trump during Saturday night appearance on Fox News", "url": "https://www.salon.com/2020/04/26/dr-brix-complains-to-fox-news-jesse-watters-about-press-coverage-of-trumps-coronavirus-briefings_partner/", "urlToImage": null, "publishedAt": "2020-04-26T13:23:32Z", "content": "Dr. Deborah Birx, the coordinator of Donald Trump's COVID-19 response, complained about media coverage while appearing on Fox News on Saturday night.\r\n\"Do you believe the media in this country have been fair during this pandemic?\" Fox News personality Jesse W… [+467 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Choe Sang-Hun", "title": "Kim Jong-un's Absent, North Korea’s Silent, and Rumors Fly - The New York Times", "description": "Rumors about the North Korean leader’s health — and speculation over his possible death — have only increased over the past two weeks.", "url": "https://www.nytimes.com/2020/04/26/world/asia/kim-jong-un-absence-north-korea.html", "urlToImage": null, "publishedAt": "2020-04-26T13:15:01Z", "content": "SEOUL, South Korea North Korea is still sending letters and gifts to foreign leaders and domestic workers in the name of its leader, Kim Jong-un. Its news media brims, as usual, with panegyrical propaganda extolling Mr. Kims leadership. South Korea reiterates… [+8249 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hayley Peterson", "title": "The $600 federal boost to unemployment is triggering confusion - Business Insider - Business Insider", "description": "\"How do I say no to employees who asked to be laid off so they can get a raise?\" asked one restaurant owner.", "url": "https://www.businessinsider.com/the-600-federal-boost-to-unemployment-is-triggering-confusion-2020-4", "urlToImage": null, "publishedAt": "2020-04-26T13:12:52Z", "content": "A federal stimulus program meant to aid the unemployed is causing confusion and frustration among some business owners, laid-off workers, and the currently employed, according to interviews.\r\nThe federal program pays $600 weekly to the unemployed, in addition… [+6088 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Daniel Kreps", "title": "See Miley Cyrus Cover Pink Floyd’s ‘Wish You Were Here’ on ‘SNL at Home’ - Rolling Stone", "description": "Singer delivers acoustic take on 1975 classic", "url": "https://www.rollingstone.com/music/music-news/miley-cyrus-pink-floyd-wish-you-were-here-snl-990103/", "urlToImage": null, "publishedAt": "2020-04-26T13:04:55Z", "content": "Miley Cyrus performed an acoustic cover of the Pink Floyd classic “Wish You Were Here” as musical guest on the latest episode of Saturday Night Live at Home.\r\nSitting next to a fire pit that lent the performance a red glow, Cyrus and her socially distanced gu… [+650 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Eden David", "title": "A reality check on antibody testing: How do we race forward thoughtfully? - ABC News", "description": "", "url": "https://abcnews.go.com/Health/reality-check-antibody-testing-race-forward-thoughtfully/story?id=70214520", "urlToImage": null, "publishedAt": "2020-04-26T13:03:48Z", "content": "As U.S. government officials begin debating the right steps in easing restrictions due to the novel coronavirus, antibody tests have been touted as the key to returning to normal.\r\nThis particular type of test can detect whether or not a person has developed … [+12523 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Samsung’s first smartphone with pop-up front camera shown off in leaked renders - XDA Developers", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiYmh0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9zYW1zdW5nLWdhbGF4eS1maXJzdC1zbWFydHBob25lLXBvcC11cC1mcm9udC1jYW1lcmEtbGVha2VkLXJlbmRlcnMv0gFmaHR0cHM6Ly93d3cueGRhLWRldmVsb3BlcnMuY29tL3NhbXN1bmctZ2FsYXh5LWZpcnN0LXNtYXJ0cGhvbmUtcG9wLXVwLWZyb250LWNhbWVyYS1sZWFrZWQtcmVuZGVycy9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T12:16:31Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Fresh air at last! Spanish children go outdoors for first time in six weeks - Reuters", "description": "On foot and with bicycles, skateboards and scooters, Spanish children went outside at last on Sunday, emerging from their homes for the first time after six ...", "url": "https://www.youtube.com/watch?v=6ab35L21p3k", "urlToImage": null, "publishedAt": "2020-04-26T12:16:03Z", "content": null}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "Kyle Hightower", "title": "Justin Rohrwasser, Patriots kicker: Tattoo doesn't represent Three Percenters - Washington Times", "description": "New Patriots kicker Justin Rohrwasser says a tattoo on his arm is not representative of a loosely organized right-wing militia group that has adopted the symbol.", "url": "https://www.washingtontimes.com/news/2020/apr/26/justin-rohrwasser-patriots-kicker-tattoo-doesnt-re/", "urlToImage": null, "publishedAt": "2020-04-26T11:27:12Z", "content": "BOSTON — New Patriots kicker Justin Rohrwasser says a tattoo on his arm is not representative of a loosely organized right-wing militia group that has adopted the symbol.\r\nRohrwasser, who played at Rhode Island and Marshall, was taken 159th overall in the fif… [+1245 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Yuliya Talmazan, Reuters", "title": "As global death toll tops 200,000, WHO warns there's no evidence of coronavirus immunity - NBC News", "description": "The World Health Organization cautioned Saturday that there is currently no evidence that people who have recovered from COVID-19 are immune to the coronavirus.", "url": "https://www.nbcnews.com/news/world/global-death-toll-tops-200-000-who-warns-there-s-n1192831", "urlToImage": null, "publishedAt": "2020-04-26T11:16:00Z", "content": "There is currently no evidence that people who have recovered from COVID-19 are protected from a second infection, the World Health Organization warned Saturday as the worldwide death toll topped 200,000.\r\nThe health body tweeted that it was continuing to rev… [+3444 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "David Gelles, Kate Kelly, David Yaffe-Bellany", "title": "As States Push to Reopen, Business Leaders Say Not So Fast - The New York Times", "description": "“Shutting down was hard, but opening up is going to be harder,” one C.E.O. said of balancing public health and a damaged economy.", "url": "https://www.nytimes.com/2020/04/26/business/coronavirus-states-businesses-reopen.html", "urlToImage": null, "publishedAt": "2020-04-26T09:54:50Z", "content": "Companies in a handful of states have begun taking tentative steps to reopen stores, offices and factories that were closed by the coronavirus. Yet as the first employees and customers return, interviews with roughly 30 major employers show thatbusinesses are… [+7587 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Yoel Minkoff", "title": "Court likely to decide fate of Boeing-Embraer deal - Seeking Alpha", "description": "<ul><li>\"Embraer (NYSE:<a href='https://seekingalpha.com/symbol/ERJ' title='Embraer S.A.'>ERJ</a>) believes strongly that Boeing (NYSE:<a href='https://seekingalpha.com/symbol/BA' title='The Boeing Company'>BA</a>) has wrongfully terminated the (agreement,)\" …", "url": "https://seekingalpha.com/news/3564425-court-likely-to-decide-fate-of-boeing-embraer-deal", "urlToImage": null, "publishedAt": "2020-04-26T09:19:22Z", "content": "\"Embraer (NYSE:ERJ) believes strongly that Boeing (NYSE:BA) has wrongfully terminated the (agreement,)\" the Brazilian planemaker said in a statement, vowing to \"pursue all remedies against Boeing for the damages incurred.\"\r\nBoeing \"manufactured false claims a… [+654 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Charles Robinson", "title": "Jameis Winston, Saints are close on deal - Yahoo Sports", "description": "A signing won’t guarantee him the backup job behind Drew Brees. Winston's best case scenario may ultimately be competing for the No. 2 spot with Taysom Hill", "url": "https://sports.yahoo.com/sources-jameis-winston-saints-finalizing-deal-081654906.html", "urlToImage": null, "publishedAt": "2020-04-26T08:16:00Z", "content": "Jameis Winston, one of the biggest remaining question marks in free agency, is finalizing a one-year deal to play for the New Orleans Saints in 2020, sources tell Yahoo Sports.\r\nThe deal is expected to be completed quickly now that the NFL draft has wrapped, … [+3075 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Joseph Wulfsohn", "title": "CNN 'Larry King' episode featuring Biden accuser's mother disappears from Google Play catalog - Fox News", "description": "The 1993 episode of \"Larry King Live\" featuring an anonymous caller who was later identified as Biden accuser Tara Reade's mother is no longer listed in Google Play's catalog.", "url": "https://www.foxnews.com/media/cnn-larry-king-episode-featuring-biden-accusers-mother-disappears-from-google-play-catalog", "urlToImage": null, "publishedAt": "2020-04-26T05:29:02Z", "content": "The 1993 episode of CNN's \"Larry King Live\" featuring an anonymous caller who was later identified as the mother of Biden accuser Tara Reade was no longer listed in Google Play's catalog late Saturday.\r\nTwitter user J.L. Hamilton shared a screenshot showing t… [+6952 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: New York to allow tests in pharmacies - BBC News", "description": "Testing remains a key problem across the US but some states have started to lift restrictions.", "url": "https://www.bbc.com/news/world-us-canada-52428994", "urlToImage": null, "publishedAt": "2020-04-26T03:43:26Z", "content": "Image copyrightEPAImage caption\r\n New York's governor says the goal is to provide 40,000 tests per day\r\nThe US state of New York, the epicentre of the country's Covid-19 outbreak, will allow pharmacies to carry out tests for the virus, the governor says.\r\nAnd… [+4243 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Holly Bailey", "title": "In Wisconsin, protesters attack stay-at-home orders as unnecessary — or a government cabal - The Washington Post", "description": "", "url": "https://www.washingtonpost.com/politics/2020/04/25/wisconsin-protestors-attack-stay-at-home-orders-unnecessary-or-government-cabal/", "urlToImage": null, "publishedAt": "2020-04-25T21:53:00Z", "content": "What has not been fine, she said, is what has happened to her family in the past month. Most of her children and grandchildren work in the service industry, including in salons and restaurants, and all had been laid off several weeks ago as Wisconsin ordered … [+9008 chars]"}, {"source": {"id": null, "name": "Universetoday.com"}, "author": "https://www.facebook.com/Storiesbywilliams-205745679447998/?ref=hl", "title": "This is the Final Picture NASA's Spitzer Space Telescope - Universe Today", "description": "NASA has just released a mosaic of the California Nebula, which was created from the final images snapped by the Spitzer Space Telescope.", "url": "https://www.universetoday.com/145828/this-is-the-final-picture-nasas-spitzer-space-telescope/", "urlToImage": null, "publishedAt": "2020-04-25T21:24:00Z", "content": "On Jan. 30th, 2020, NASA’s Spitzer Space Telescope was retired after sixteen years of faithful service. As one of the four NASA Great Observatories – alongside Hubble, Chandra, and Compton space telescopes – Spitzer was dedicated to studying the Universe in i… [+5261 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Former Apple designer drops Watch trivia on its fifth anniversary - Engadget", "description": "Imran Chaudhri, Apple’s design lead for hardware from 1995 to 2016, dropped some details about Apple Watch’s history on its fifth anniversary.  While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a re…", "url": "https://www.engadget.com/former-apple-designer-drops-watch-trivia-on-its-fifth-anniversary-144849444.html", "urlToImage": null, "publishedAt": "2020-04-25T18:39:26Z", "content": "Imran Chaudhri, Apple’s design lead for hardware from 1995 to 2016, dropped some details about Apple Watch’s history on its fifth anniversary. While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a rep… [+906 chars]"}, {"source": {"id": null, "name": "Kimt.com"}, "author": null, "title": "A 5-part series: What does it take to re-open one of Minnesota's largest cities? - KIMT 3", "description": "KIMT's Jessica Bringe talked to people throughout southeastern Minnesota to see what's next as people and communities fight the coronavirus.", "url": "https://www.kimt.com/content/news/A-5-part-series-What-does-it-take-to-re-open-one-of-Minnesotas-largest-cities-569950771.html", "urlToImage": null, "publishedAt": "2020-04-25T17:05:00Z", "content": "Governor Tim Walz is moving forward with plans to reopen the economy in our region by partnering with other Midwest governors.Walz said, “If I thought we could go back to work tomorrow that’s exactly what we would do.”As governors across the U.S. begin collab… [+3176 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Naomi Jagoda", "title": "McConnell state bankruptcy remarks raise constitutional questions | TheHill - The Hill", "description": "Municipal finance experts say that it may be unconstitutional for Congress to allow states to declare bankruptcy, and that even if it is constitutional, it would be a bad idea.", "url": "https://thehill.com/homenews/senate/494612-mcconnell-state-bankruptcy-remarks-raise-constitutional-questions", "urlToImage": null, "publishedAt": "2020-04-25T16:50:22Z", "content": "Municipal finance experts say that it may be unconstitutional for Congress to allow states to declare bankruptcy, and that even if it is constitutional, it would be a bad idea.\r\nExperts on state and local government finances say that Congress may not have the… [+6966 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew May", "title": "Celebrating 30 years of the Hubble Space Telescope - Space.com", "description": "Celebrating three decades of an icon of science — and a triumph of technology.", "url": "https://www.space.com/hubble-space-telescope-turns-30.html", "urlToImage": null, "publishedAt": "2020-04-25T12:43:31Z", "content": "It's been 30 years since NASA launched the Hubble Space Telescope on April 24, 1990. The observatory was carried aloft in the payload bay of space shuttle Discovery, and for three decades Hubble's history was closely intertwined with the shuttle's. The telesc… [+8383 chars]"}, {"source": {"id": null, "name": "Futurism.com"}, "author": null, "title": "China Will Launch Mars Mission \"In Coming Months\" - Futurism", "description": "And the mission has been named after an ancient poem.", "url": "https://futurism.com/the-byte/china-launch-mars-mission-coming-months", "urlToImage": null, "publishedAt": "2020-04-24T20:29:38Z", "content": "Forging Ahead\r\nChina says that its still on schedule for the mission to Mars it plans to launch later this year.\r\nThe mission, originally slated for a July launch date, is set to happen in the coming months, according to the China National Space Administratio… [+1254 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Kelly Woo", "title": "Forget Zoom: Facebook launches 50-person video calls for free - Tom's Guide", "description": "Facebook takes on Zoom with free, 50-person Messenger Rooms", "url": "https://www.tomsguide.com/news/forget-zoom-facebook-launches-50-person-video-calls-for-free", "urlToImage": null, "publishedAt": "2020-04-24T19:49:59Z", "content": "Take that Zoom  Facebook is launching Messenger Rooms, a new video call feature that include up to 50 people with no time limit. \r\nWith many people working and staying at home under quarantine regulations, video calling and conferencing services like Zoom hav… [+2402 chars]"}]}