{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": "Mohammed Ghobari", "title": "STC announces plan for self-rule in south Yemen; government calls move 'catastrophic' - Reuters", "description": "Yemen's main southern separatist group announced early on Sunday it would establish self-rule in areas under its control, which the Saudi-backed government warned would have \"catastrophic consequences\".", "url": "https://www.reuters.com/article/us-yemen-security-south-idUSKCN228003", "urlToImage": null, "publishedAt": "2020-04-26T08:34:09Z", "content": "ADEN (Reuters) - Yemen’s main southern separatist group announced early on Sunday it would establish self-rule in areas under its control, which the Saudi-backed government warned would have “catastrophic consequences”. \r\nThe move threatens to renew conflict … [+3664 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "What's Next for Global Oil Prices?: The Industry May Shut Down - Bloomberg", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=f3fed920-879a-11ea-8666-95abf40774bf&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNC0yNi90aGUtbmV4dC1jaGFwdGVyLW9mLXRoZS1vaWwtY3Jpc2lzLXRoZS1pbmR1c3RyeS1zaHV0cy1kb3du", "urlToImage": null, "publishedAt": "2020-04-26T08:23:26Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Brad Pitt channels Dr. Fauci on 'SNL' - CNN", "description": "In a surprise appearance, Brad Pitt played Dr. Anthony Fauci in the opening of Saturday's \"SNL,\" which was produced remotely because of the coronavirus pandemic.", "url": "https://www.cnn.com/videos/media/2020/04/26/saturday-night-live-home-brad-pitt-dr-fauci.cnn", "urlToImage": null, "publishedAt": "2020-04-26T07:04:36Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Guardian staff and agencies", "title": "Kim Jong-un's train possibly spotted at North Korean resort - The Guardian", "description": "As rumours persist that ruler is in poor health, satellite images emerge showing train parked at Wonsan’s ‘leadership station’", "url": "https://www.theguardian.com/world/2020/apr/26/kim-jong-uns-train-possibly-spotted-at-north-korean-resort", "urlToImage": null, "publishedAt": "2020-04-26T06:50:34Z", "content": "A special train possibly belonging to the North Korean ruler, Kim Jong-un, has been spotted at a resort town, according to satellite images reviewed by a Washington-based North Korea monitoring project, amid conflicting reports about Kims health and whereabou… [+4255 chars]"}, {"source": {"id": null, "name": "Si.com"}, "author": "Andy Benoit", "title": "Grading every team's picks in the 2020 NFL draft - Sports Illustrated", "description": "Which teams had successful NFL drafts, and who could be struggling next season? Handing out grades for every team’s draft.", "url": "https://www.si.com/nfl/2020/04/26/nfl-draft-2020-team-grades-picks-analysis", "urlToImage": null, "publishedAt": "2020-04-26T05:41:00Z", "content": "The 2020 NFL draft was like no other, with the commissioner and team evaluators (and their kids, and their dogs) checking in from their homes to make the 255 picks from Joe Burrow to Mr. Irrelevant, Tae Crowder.\r\nWhich teams fared the best over the past three… [+84186 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "David Gaffen", "title": "When oil became waste: a week of turmoil for crude, and more pain to come - Reuters", "description": "The magnitude of how damaged the energy industry is came into full view on April 20 when the benchmark price of U.S. oil futures , which had never dropped below $10 a barrel in its nearly 40-year history, plunged to a previously unthinkable minus $38 a barrel.", "url": "https://www.reuters.com/article/us-global-oil-turmoil-idUSKCN228059", "urlToImage": null, "publishedAt": "2020-04-26T05:17:48Z", "content": "(Reuters) - The magnitude of how damaged the energy industry is came into full view on April 20 when the benchmark price of U.S. oil futures CLc1, which had never dropped below $10 a barrel in its nearly 40-year history, plunged to a previously unthinkable mi… [+5183 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Murder of N.Y. nursing student leads to an international manhunt for her killer - CBS News", "description": "The Find My Friends app leads to the body of a missing college student as her suspected killer flees the country. Will he get away with murder?", "url": "https://www.cbsnews.com/news/haley-anderson-murder-international-manhunt/", "urlToImage": null, "publishedAt": "2020-04-26T05:04:27Z", "content": "Produced by Judy Rybak and Stephanie Slifer\r\nWhen Binghamton University student Haley Anderson first disappeared from her off-campus apartment, her close friend and roommate Josie Artin says she wasn't that alarmed. \r\n\"When I first didn't hear from her, I did… [+32795 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Amazon asks workers to request leave if they continue staying at home - Engadget", "description": "Amazon warehouse workers will have to request a leave of absence if they want to stay at home after May 1st.", "url": "https://www.engadget.com/amazon-workers-must-request-leave-034137183.html", "urlToImage": null, "publishedAt": "2020-04-26T04:04:22Z", "content": "Amazon warehouse workers wanting to stay home to avoid COVID-19 will soon have to make a formal request. The online retailer is asking staff staying home to either report to their shifts starting May 1st or else request a leave of absence. A spokesperson told… [+588 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: New York to allow tests in pharmacies - BBC News", "description": "Testing remains a key problem across the US but some states have started to lift restrictions.", "url": "https://www.bbc.co.uk/news/world-us-canada-52428994", "urlToImage": null, "publishedAt": "2020-04-26T03:42:46Z", "content": "Image copyrightEPAImage caption\r\n New York's governor says the goal is to provide 40,000 tests per day\r\nThe US state of New York, the epicentre of the country's Covid-19 outbreak, will allow pharmacies to carry out tests for the virus, the governor says.\r\nAnd… [+2518 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Anita Bennett", "title": "Trump Threatens To End Daily White House Coronavirus Briefings Over “Hostile Questions” - Deadline", "description": "President Donald Trump is threatening to stop the daily White House coronavirus briefings — not because of public outcry over his comments about injecting disinfectants, or because his statements are being used against him in Joe Biden attack ads — but becaus…", "url": "https://deadline.com/2020/04/trump-threatens-to-end-daily-white-house-coronavirus-briefings-1202917989/", "urlToImage": null, "publishedAt": "2020-04-26T03:15:58Z", "content": "President Donald Trump is threatening to stop the daily White Housecoronavirus briefings — not because of public outcry over his comments about injecting disinfectants, or because his statements are being used against him in Joe Biden attack ads — but because… [+2797 chars]"}, {"source": {"id": null, "name": "Buffalonews.com"}, "author": null, "title": "Even Jake Fromm was puzzled why Bills selected him, but he gets to prove himself now - Buffalo News", "description": "When general manager Brandon Beane called Jake Fromm Saturday to inform him he was the Bills' fifth-round choice, the former Georgia QB was", "url": "https://buffalonews.com/2020/04/25/buffalo-bills-jake-fromm-josh-allen-brandon-beane-nfl-draft-vic-carucci-football/", "urlToImage": null, "publishedAt": "2020-04-26T02:14:23Z", "content": "This is how unexpected the Buffalo Bills' drafting of a quarterback was.\r\nWhen general manager Brandon Beane called Jake Fromm Saturday to inform him he was the Bills' fifth-round choice, the former Georgia QB was more than a little skeptical.\r\n\"I thought it … [+6117 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Alicia Victoria Lozano, Dennis Romero", "title": "California heat wave draws large crowds to beaches despite stay-at-home order - NBC News", "description": "Summer-like weather across much of California drove large crowds to beaches Saturday despite a statewide stay-at-home order.", "url": "https://www.nbcnews.com/news/us-news/california-heat-wave-draws-large-crowds-beaches-despite-stay-home-n1192766", "urlToImage": null, "publishedAt": "2020-04-26T01:40:39Z", "content": "Summer-like weather across much of California drove large crowds to the beaches Saturday despite a statewide stay-at-home order intended to curb the spread of coronavirus.\r\nTemperatures reached into the 80s and 90s in Southern California, where people were sw… [+2821 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Nick Wagoner", "title": "49ers, Trent Williams in no rush on extension, GM John Lynch says - ESPN", "description": "On the day the San Francisco 49ers acquired left tackle Trent Williams from Washington, 49ers general manager John Lynch said neither Williams nor the team is focused on a contract extension. Williams will be in the final year of his deal this season.", "url": "https://www.espn.com/nfl/story/_/id/29099733/49ers-trent-williams-no-rush-extension-gm-john-lynch-says", "urlToImage": null, "publishedAt": "2020-04-26T01:30:59Z", "content": "SANTA CLARA, Calif. -- It's been 482 days since new San Francisco 49ers left tackle Trent Williams last played in an NFL football game.\r\nWith so much uncertainty surrounding when the NFL season will start because of the coronavirus pandemic, it remains to be … [+5231 chars]"}, {"source": {"id": null, "name": "Nydailynews.com"}, "author": "Storm Gifford", "title": "Kids' stuff: Pratt and Schwarzenegger expecting - New York Daily News", "description": "Chris Pratt and Katherine Schwarzenegger are expecting their first child.", "url": "https://www.nydailynews.com/snyde/ny-kat-and-pratt-20200426-3ljz34ax7nb5xlfwrq5yez3hme-story.html", "urlToImage": null, "publishedAt": "2020-04-26T01:01:41Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Elise Solé", "title": "Tom Hanks and Rita Wilson are donating blood for coronavirus research - Yahoo Entertainment", "description": "Tom Hanks and Rita Wilson, who have recovered from the coronavirus, are paying it forward.", "url": "https://www.yahoo.com/entertainment/tom-hanks-and-rita-wilson-donate-blood-to-help-coronavirus-vaccine-234312222.html", "urlToImage": null, "publishedAt": "2020-04-26T00:40:18Z", "content": "Tom Hanks says the blood that him and wife Rita Wilson donated after recovering from the coronavirus, should go toward a Hank-ccine.\r\nDuring a recent episode of NPRs Wait Wait...Dont Tell Me! Hanks, 63, explained that him and Wilson are feeling dandy, althoug… [+2903 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": null, "title": "White House weighing plan to replace Azar - POLITICO", "description": "Among the candidates to take over as HHS secretary is coronavirus coordinator Deborah Birx, according to people familiar with the talks.", "url": "https://www.politico.com/news/2020/04/25/white-house-replace-alex-azar-208151", "urlToImage": null, "publishedAt": "2020-04-26T00:29:47Z", "content": "The Department of Health and Human Services, under the leadership of Secretary Azar, continues to lead on a number of the Presidents priorities. Any speculation about personnel is irresponsible and a distraction from our whole-of-government response to COVID-… [+4828 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Scott McDonald", "title": "Michigan State Senator Apologizes for Wearing Mask That Suggests Confederate Symbol - Newsweek", "description": "\"I'm sorry for my choice of pattern on the face mask I wore yesterday on the Senate floor. I did not intend to offend anyone,\" State Senator Dale Zorn tweeted Saturday.", "url": "https://www.newsweek.com/michigan-state-senator-apologizes-wearing-mask-that-suggests-confederate-symbol-1500248", "urlToImage": null, "publishedAt": "2020-04-26T00:20:04Z", "content": "A Michigan state senator who wore a protective face mask that appears to resemble the Confederate flag has since apologized, saying he had no intentions to offend anyone.\r\nState Senator Dale Zorn, a Republican who represents Ida Township in the southeastern p… [+3012 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Ryan Young", "title": "NFL raised more than $100 million during draft for coronavirus relief - Yahoo Sports", "description": "Roger Goodell announced that the NFL raised more than $100 million for coronavirus relief during the draft.", "url": "https://sports.yahoo.com/nfl-draft-raised-100-million-for-coronavirus-covid-19-pandemic-relief-roger-goodell-235016606.html", "urlToImage": null, "publishedAt": "2020-04-25T23:50:00Z", "content": "The COVID-19 pandemic forced the NFL to host its draft virtually this year which ended up running fairly smoothly. \r\nWhile teams were making their picks, the league simultaneously held a draft-a-thon fundraiser to help raise money for coronavirus relief in th… [+1217 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Tom Holland to host Marvel-themed quiz show on April 29 - Geo News", "description": "The actor plans to host the quiz show for charity amid the coronavirus pandemic", "url": "https://www.geo.tv/latest/284969-tom-holland-to-host-marvel-themed-quiz-show-on-april-29", "urlToImage": null, "publishedAt": "2020-04-25T23:21:54Z", "content": "Tom Holland to host Marvel-themed quiz show on April 29\r\nTom Holland has announced to host a virtual quiz show to help people amid the coronavirus pandemic.\r\nThe Spider-Man actor told Jimmy Kimmel that he will host a Marvel-themed quiz on Instagram.\r\nFor the … [+783 chars]"}, {"source": {"id": null, "name": "Sfgate.com"}, "author": "Hearst Television", "title": "National coronavirus updates: FDA authorizes three more antibody tests - SF Gate", "description": "The latest:", "url": "https://www.sfgate.com/news/article/National-coronavirus-updates-US-death-toll-15225716.php", "urlToImage": null, "publishedAt": "2020-04-25T22:44:00Z", "content": "National coronavirus updates: Auto workers step up to make medical gear\r\nThe latest:\r\n<ul><li>There have been more than 939,000 coronavirus cases in the United States, according to the Johns Hopkins University tally.</li><li>The U.S. death toll has surpassed … [+10255 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Holly Bailey", "title": "In Wisconsin, protesters attack stay-at-home orders as unnecessary — or a government cabal - The Washington Post", "description": "", "url": "https://www.washingtonpost.com/politics/2020/04/25/wisconsin-protestors-attack-stay-at-home-orders-unnecessary-or-government-cabal/", "urlToImage": null, "publishedAt": "2020-04-25T21:53:00Z", "content": "What has not been fine, she said, is what has happened to her family in the past month. Most of her children and grandchildren work in the service industry, including in salons and restaurants, and all had been laid off several weeks ago as Wisconsin ordered … [+9008 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Colby Itkowitz", "title": "Republican strategy memo advises GOP campaigns to blame China for coronavirus - The Washington Post", "description": "‘Don’t defend Trump,’ the memo says. ‘Attack China.’", "url": "https://www.washingtonpost.com/politics/2020/04/25/senate-gop-talking-points-coronavirus-blame-china-not-trump/", "urlToImage": null, "publishedAt": "2020-04-25T21:31:51Z", "content": "If asked whether Trump is at fault for the nations unpreparedness as the virus spread, the candidates are told, dont defend Trump, other than the China Travel Ban attack China, according to the memo, a copy of which was obtained by The Washington Post. The me… [+3721 chars]"}, {"source": {"id": null, "name": "Newser.com"}, "author": "Neal Colgrass", "title": "World-Health Body Slams 'an Extremely Bad Idea' - Newser", "description": "The World Health Organization is not on board", "url": "https://www.newser.com/story/290056/who-has-something-to-say-about-immunity-passports.html", "urlToImage": null, "publishedAt": "2020-04-25T21:30:00Z", "content": "(Newser)\r\nCoronavirus survivors may not be getting \"immunity passports\" after all. The idea—which has gained some ground in Europe—is that passport holders would be immune to COVID-19 and able to re-enter society. But the World Health Organization warned Frid… [+1268 chars]"}, {"source": {"id": null, "name": "Universetoday.com"}, "author": "https://www.facebook.com/Storiesbywilliams-205745679447998/?ref=hl", "title": "This is the Final Picture NASA's Spitzer Space Telescope - Universe Today", "description": "NASA has just released a mosaic of the California Nebula, which was created from the final images snapped by the Spitzer Space Telescope.", "url": "https://www.universetoday.com/145828/this-is-the-final-picture-nasas-spitzer-space-telescope/", "urlToImage": null, "publishedAt": "2020-04-25T21:24:00Z", "content": "On Jan. 30th, 2020, NASA’s Spitzer Space Telescope was retired after sixteen years of faithful service. As one of the four NASA Great Observatories – alongside Hubble, Chandra, and Compton space telescopes – Spitzer was dedicated to studying the Universe in i… [+5261 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "Facebook adds Messenger Rooms to the bevy of group video services - Android Police", "description": "Video calls have become an important way to stay in touch with friends and family during this time of isolation. There's already plenty to choose from,", "url": "https://www.androidpolice.com/2020/04/25/facebook-adds-messenger-rooms-to-the-bevy-of-group-video-services/", "urlToImage": null, "publishedAt": "2020-04-25T20:49:00Z", "content": "Video calls have become an important way to stay in touch with friends and family during this time of isolation. There's already plenty to choose from, but now Facebook is giving us something new to consider as Messenger Rooms begins to roll out across the gl… [+1587 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "Lou Whiteman", "title": "Boeing Abandons $4 Billion Embraer Deal: What It Means for Boeing Stock - Motley Fool", "description": "The good and the bad concerning Boeing's decision to bail on Embraer.", "url": "https://www.fool.com/investing/2020/04/25/boeing-abandons-4-billion-embraer-deal-what-it-mea.aspx", "urlToImage": null, "publishedAt": "2020-04-25T20:30:00Z", "content": "On Saturday, Boeing(NYSE:BA) terminated a $4 billion deal that would have given it controlling of the commercial aerospace operations of Embraer(NYSE:ERJ) after a Friday night deadline came and passed without the two sides ironing out final details.\r\nIn press… [+5558 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "J. Edward Moreno", "title": "Global death toll from coronavirus reaches over 200,000 | TheHill - The Hill", "description": "More than 200,000 people worldwide have been reported dead as a result of the coronavirus pandemic, according to a tally by Johns Hopkins University.", "url": "https://thehill.com/homenews/news/494667-global-death-toll-from-coronavirus-reaches-over-200000", "urlToImage": null, "publishedAt": "2020-04-25T20:04:08Z", "content": "More than 200,000 people worldwide have been reported dead as a result of the coronavirus pandemic, according to a tally by Johns Hopkins University.\r\nAs of Saturday afternoon, 2.8 million people have tested positive for the virus globally. The death toll is … [+1681 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Sergei Klebnikov", "title": "Icahn Sees Further Market Crash From Coronavirus, Says He’s Shorting Commercial Real Estate - Forbes", "description": "The billionaire investor said he isn’t buying stocks right now.", "url": "https://www.forbes.com/sites/sergeiklebnikov/2020/04/25/icahn-sees-further-market-crash-from-coronavirus-says-hes-shorting-commercial-real-estate/", "urlToImage": null, "publishedAt": "2020-04-25T19:08:58Z", "content": "One of Wall Streets most successful investors, billionaire Carl Icahn, warned in a recent interview with Bloomberg that stocks are overvalued, and although there will be good opportunities to buy, he expects that the coronavirus will lead to a further market … [+3210 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Canada's worst mass shooting began with argument between gunman, his girlfriend - The Times of Israel", "description": "Assault by the suspect on his girlfriend ended with 22 people dead in communities across central and northern Nova Scotia", "url": "https://www.timesofisrael.com/canadas-worst-mass-shooting-began-with-argument-between-gunman-his-girlfriend/", "urlToImage": null, "publishedAt": "2020-04-25T17:51:00Z", "content": "TORONTO (AP) Canadas worst mass shooting erupted from an argument between the gunman and his girlfriend, who survived the attack, police confirmed Friday.\r\nRoyal Canadian Mounted Police Supt. Darren Campbell said the weekend shooting rampage started with an a… [+5673 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Asher Stockler", "title": "Trump Holds Narrow Lead Over Biden in Texas, New Poll Says - Newsweek", "description": "A Democratic candidate for president has not won the state of Texas since then-candidate Jimmy Carter beat Gerald Ford in 1976.", "url": "https://www.newsweek.com/texas-biden-trump-2020-1500219", "urlToImage": null, "publishedAt": "2020-04-25T15:07:48Z", "content": "U.S. President Donald Trump is holding a narrow five-point lead over former Vice President Joe Biden in the presidential race in Texas, according to a new University of Texas/Texas Tribunepoll.\r\nAs indicated by the latest survey, Trump is currently sitting at… [+2408 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Ian Sherr", "title": "Apple, Google update coronavirus tracking tech to address privacy concerns - CNET", "description": "The tech giants added new security features for their iPhone and Android phone technology.", "url": "https://www.cnet.com/news/apple-google-update-coronavirus-tracking-tech-to-address-privacy-concerns/", "urlToImage": null, "publishedAt": "2020-04-25T14:38:34Z", "content": "Background by Pixabay/Photo by Angela Lang/CNET\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nAs companies and governments around the world battle the coronavirus pandemic, Apple and Google are making ch… [+4845 chars]"}, {"source": {"id": null, "name": "Interestingengineering.com"}, "author": "Loukia Papadopoulos", "title": "SpaceX Completes Falcon 9 Static Fire Test - Interesting Engineering", "description": "The test comes on the heels of another successful static fire test earlier this week.", "url": "https://interestingengineering.com/spacex-successfully-completes-falcon-9-static-fire-test", "urlToImage": null, "publishedAt": "2020-04-25T13:33:43Z", "content": "Preparations for Crew Dragon’s first operational mission seems to be going well. SpaceX's rocket development facility in McGregor, Texas, announced on Saturday that it successfully completed a static fire test of the Falcon 9 first stage that will launch the … [+1718 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Gilbert", "title": "How to set up Nintendo Switch two-factor authentication - Business Insider - Business Insider", "description": "Following a major breach, Nintendo is suggesting all Nintendo Switch owners set up two-factor authentication. Here's how to do it.", "url": "https://www.businessinsider.com/how-to-set-up-nintendo-switch-two-factor-authentication-2020-4", "urlToImage": null, "publishedAt": "2020-04-25T13:00:26Z", "content": "Do you have a Nintendo Switch? Did you also have a Nintendo 3DS or Wii U? \r\nIf you answered yes to both of those questions, there's a possibility your Nintendo Switch account was one of \"about 160,000\" breaches that Nintendo announced on Friday morning.\r\nSo, … [+180 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew May", "title": "Celebrating 30 years of the Hubble Space Telescope - Space.com", "description": "Celebrating three decades of an icon of science — and a triumph of technology.", "url": "https://www.space.com/hubble-space-telescope-turns-30.html", "urlToImage": null, "publishedAt": "2020-04-25T12:43:31Z", "content": "It's been 30 years since NASA launched the Hubble Space Telescope on April 24, 1990. The observatory was carried aloft in the payload bay of space shuttle Discovery, and for three decades Hubble's history was closely intertwined with the shuttle's. The telesc… [+8383 chars]"}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "Patrick Henry", "title": "WHO Warns You May Catch Coronavirus More Than Once - BloombergQuint", "description": "Catching Covid-19 once may not protect you from getting it again, according to the World Health Organization.", "url": "https://www.bloombergquint.com/business/catching-covid-19-may-not-shield-against-new-infection-who-says", "urlToImage": null, "publishedAt": "2020-04-25T09:51:48Z", "content": ""}, {"source": {"id": null, "name": "Keprtv.com"}, "author": "Christopher Poulsen", "title": "Police cars make some noise for Pasco boy's birthday - KEPR 19", "description": "PASCO, Wash. -- Coronavirus is changing the way families are celebrating birthdays. A parade of Pasco police made sure 10-year-old Stryker Smith enjoyed his birthday. Sgt. Rodrigo Pruneda says the usual party with friends, cake and candles is out of reach thi…", "url": "http://keprtv.com/news/coronavirus/police-cars-make-some-noise-for-pasco-boys-birthday", "urlToImage": null, "publishedAt": "2020-04-25T01:07:08Z", "content": null}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Brittany Shammas", "title": "U.S. coronavirus death toll surpasses 50,000 - The Washington Post", "description": "The coronavirus’s U.S. death toll surged past 50,000 on Friday, marking another grim milestone in the pandemic that has upended life around the globe.", "url": "https://www.washingtonpost.com/nation/2020/04/24/us-coronavirus-death-toll-surpasses-50000/", "urlToImage": null, "publishedAt": "2020-04-24T20:29:01Z", "content": "Experts have warned that the number of reported fatalities probably underestimates the true toll of covid-19, the disease caused by the virus. Amid a national debate over how to count the dead, methods have varied widely from state to state. And the Centers f… [+3558 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}]}