{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Eonline.com"}, "author": "Pamela Avila", "title": "Katherine Schwarzenegger Debuts Her Baby Bump Alongside Chris Pratt - E! NEWS", "description": "Katherine Schwarzenegger is debuting her baby bump shortly after it was announced that she was expecting her first child.", "url": "https://www.eonline.com/news/1144919/katherine-schwarzenegger-debuts-her-baby-bump-alongside-chris-pratt-during-bike-ride", "urlToImage": null, "publishedAt": "2020-04-26T00:24:24Z", "content": "Katherine Schwarzenegger is debuting her baby bump shortly after it was announced that she was expecting her first child. \r\nThe 30-year-old and Chris Pratt were spotted out on a bike ride in Santa Monica, Calif. on Saturday afternoon and the mother-to-be's ba… [+835 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Mike Freeman", "title": "NFL Draft Day 3 Notebook: Trent Williams Trade Just Right for Aggressive 49ers - Bleacher Report", "description": "Offensive lineman Trent Williams wasn't one of the flashy potential stars available in this year's draft.  He isn't a fast receiver or a 15-sack pass-rusher with his whole career ahead of him...", "url": "https://bleacherreport.com/articles/2888650-nfl-draft-day-3-notebook-trent-williams-trade-just-right-for-aggressive-49ers", "urlToImage": null, "publishedAt": "2020-04-26T00:14:22Z", "content": "49ers GM John Lynch and coach Kyle Shanahan can celebrate their draft weekend, most of all because of their trade for Trent Williams.Michael Zagaris/Getty Images\r\nOffensive lineman Trent Williams wasn't one of the flashy potential stars available in this year… [+5936 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "Josh Edwards", "title": "2020 NFL Draft: Live tracker, picks by team, grades, analysis, order, start time and more - CBSSports.com", "description": "CBS Sports is bringing you live updates and analysis as the 2020 NFL Draft wraps up on Saturday", "url": "https://www.cbssports.com/nfl/news/2020-nfl-draft-live-tracker-picks-by-team-grades-analysis-order-start-time-and-more/live/", "urlToImage": null, "publishedAt": "2020-04-25T23:18:00Z", "content": "The 2020 NFL Draft is in the books and despite the pre-draft concerns about our first-ever virtual event, the entire weekend went down smoothly. Of course, the actual action -- the draft picks and trades -- featured a slew of surprises. The Packers shocked us… [+398 chars]"}, {"source": {"id": null, "name": "Patriots.com"}, "author": null, "title": "2020 Draft Day 3: Patriots add five more rookies - Patriots.com", "description": "Recapping New England's activity during Rounds 4 through 7 of the 2020 NFL Draft.", "url": "https://www.patriots.com/news/2020-draft-day-3-patriots-add-five-more-rookies", "urlToImage": null, "publishedAt": "2020-04-25T23:10:25Z", "content": "On the third and final day of the 2020 NFL Draft, the Patriots picked up where they left off on Day 2. Operating from remote locations as a result of the ongoing coronavirus pandemic lockdown, New England's top brass kept themselves active throughout Rounds 4… [+3596 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Adrian Wojnarowski", "title": "NBA reopening team practice facilities Friday where local restrictions eased, sources say - ESPN", "description": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.", "url": "https://www.espn.com/nba/story/_/id/29099194/nba-reopening-team-practice-facilities-friday-where-local-restrictions-eased-sources-say", "urlToImage": null, "publishedAt": "2020-04-25T23:00:39Z", "content": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.\r\nPlayers can return to team facilities in states such as … [+2131 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "Post Malone held a Nirvana tribute concert that raised nearly $3 million for coronavirus relief - CNN", "description": "Post Malone raised more than $2.8 million for coronavirus relief by livestreaming a Nirvana tribute concert on YouTube.", "url": "https://www.cnn.com/2020/04/25/us/post-malone-nirvana-tribute-coronavirus-relief-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-25T22:55:21Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Lauren Aratani", "title": "Trump says briefings 'not worth the effort' amid fallout from disinfectant comments - The Guardian", "description": "The president remained behind closed doors after advisers reportedly warned him that the briefings were hurting his campaign", "url": "https://www.theguardian.com/us-news/2020/apr/25/donald-trump-stays-away-from-briefings-amid-fallout-from-disinfectant-comments", "urlToImage": null, "publishedAt": "2020-04-25T22:50:44Z", "content": "After more than a month of near-daily White House coronavirus press briefings, Donald Trump stayed behind closed doors on Saturday after advisers reportedly warned the president that his appearances were hurting his campaign.\r\nTrump himself referenced his abs… [+3432 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Seung Min Kim", "title": "Tensions emerge between Republicans over coronavirus spending and how to rescue the economy - The Washington Post", "description": "A debate is stirring among Republicans about how substantial the package should be and whether concerns about debt are misplaced at a time of economic crisis when the government continues to be able to borrow at rock-bottom prices.", "url": "https://www.washingtonpost.com/politics/republicans-trump-coronavirus-spending-deficit-economy/2020/04/25/9013c5ee-8671-11ea-a3eb-e9fc93160703_story.html", "urlToImage": null, "publishedAt": "2020-04-25T22:39:07Z", "content": "As we start thinking down the road in future iterations, my hope would be that its more fine tuning what weve already done rather than taking on big, aggressive new initiatives that are paid for by additional debt, Senate Majority Whip John Thune (S.D.), the … [+8736 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Spencer Kimball", "title": "UK Prime Minister Boris Johnson will return to work Monday after coronavirus recovery - CNBC", "description": "Johnson was the first publicly reported case of a world leader testing positive.", "url": "https://www.cnbc.com/2020/04/25/coronavirus-uk-prime-minister-boris-johnson-will-return-to-work-monday.html", "urlToImage": null, "publishedAt": "2020-04-25T22:36:56Z", "content": "British Prime Minister Boris Johnson will return to work Monday after recovering from coronavirus, according to Downing Street.  \r\nJohnson has been convalescing at Chequers, the prime minister's country estate, since he was discharged from hospital earlier th… [+892 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Dennis Romero", "title": "California can check backgrounds of ammunition buyers for now, court says - NBC News", "description": "A federal appeals court ruled late Friday that California could continue checking the backgrounds of ammunition buyers. The state faces a court challenge.", "url": "https://www.nbcnews.com/news/us-news/california-can-check-backgrounds-ammunition-buyers-now-court-says-n1192711", "urlToImage": null, "publishedAt": "2020-04-25T22:22:17Z", "content": "A federal appeals court late Friday ruled that California could continue requiring background checks of ammunition buyers as a challenge to the voter-approved rule makes its way through the justice system.\r\nThe U.S. Court of Appeals for the Ninth Circuit paus… [+1716 chars]"}, {"source": {"id": null, "name": "Cryptomoni.com"}, "author": "admin", "title": "Big asteroid shows itself ahead of Earth flyby on April 29 - Crypto Monitor News", "description": "We've now got a good visual on the big space rock that's going to fly by Earth next week. On Saturday (April 18), the Arecibo Observatory in Puerto Rico captured a radar image of the asteroid 1998 OR2", "url": "https://www.cryptomoni.com/big-asteroid-shows-itself-ahead-of-earth-flyby-on-april-29/2572", "urlToImage": null, "publishedAt": "2020-04-25T22:21:26Z", "content": "We’ve now got a good visual on the big space rock that’s going to fly by Earth next week.\r\nOn Saturday (April 18), the Arecibo Observatory\r\n in Puerto Rico captured a radar image of the asteroid 1998 OR2, which will zoom within 3.9 million miles (6.3 million … [+2356 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Tom O'Connor, Naveed Jamali", "title": "Despite Kim Jong Un's Absence, Military Activity Suggests Nothing Amiss in North Korea, U.S. Intelligence Says - Newsweek", "description": "North Korean supreme leader Kim Jong Un missed another national holiday, fueling rumors and reports of his health. But U.S. intelligence still sees no sign of him losing power.", "url": "https://www.newsweek.com/despite-kim-jong-uns-absence-military-activity-suggests-nothing-amiss-north-korea-us-1500228", "urlToImage": null, "publishedAt": "2020-04-25T21:29:04Z", "content": "North Korean supreme leader Kim Jong Un missed another national holiday on Saturday, fueling rumors and reports of his health. But U.S. intelligence sees no sign of unusual military activity that would suggest something amiss.\r\n\"Regional militaries in the Wes… [+7660 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kelly Mena", "title": "Michigan state lawmaker apologizes for wearing apparent Confederate flag face mask - CNN", "description": "A Michigan state senator is now apologizing for wearing a face mask with what appeared to be a Confederate flag pattern.", "url": "https://www.cnn.com/2020/04/25/politics/michigan-legislator-dale-zorn-confederate-face-mask/index.html", "urlToImage": null, "publishedAt": "2020-04-25T21:24:51Z", "content": "1/2:\r\nI'm sorry for my choice of pattern on the face mask I wore yesterday on the Senate floor. I did not intend to offend anyone; however, I realize that I did, and for that I am sorry. Those who know me best know that I do not support the things this patter… [+61 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Audrey McNamara", "title": "CDC adds six new possible coronavirus symptoms - CBS News", "description": "The agency has updated its list to include: chills, repeated shaking with chills, muscle pain, headache, sore throat and new loss of taste or smell.", "url": "https://www.cbsnews.com/news/cdc-adds-six-new-possible-coronavirus-symptoms-2020-04-25/", "urlToImage": null, "publishedAt": "2020-04-25T21:21:29Z", "content": "The Centers for Disease Control and Prevention has added six new symptoms to its list of possible signs of the coronavirus. Previously, the CDC only noted fever, cough and shortness of breath as symptoms.\r\nThe agency has updated its list to include: chills, r… [+2199 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "MJ Lee, CNN Political Correspondent", "title": "Biden's accuser says mother called into 'Larry King Live' in 1993 for advice after alleged sexual assault - CNN", "description": "Newly surfaced video from 1993 appears to feature the mother of Tara Reade, a woman who accused presumptive Democratic presidential nominee Joe Biden of sexual assault, calling into a cable TV show to seek advice around the time of the alleged assault.", "url": "https://www.cnn.com/2020/04/25/politics/tara-reade-mom-larry-king/index.html", "urlToImage": null, "publishedAt": "2020-04-25T21:03:51Z", "content": null}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "Facebook adds Messenger Rooms to the bevy of group video services - Android Police", "description": "Video calls have become an important way to stay in touch with friends and family during this time of isolation. There's already plenty to choose from,", "url": "https://www.androidpolice.com/2020/04/25/facebook-adds-messenger-rooms-to-the-bevy-of-group-video-services/", "urlToImage": null, "publishedAt": "2020-04-25T20:49:00Z", "content": "Video calls have become an important way to stay in touch with friends and family during this time of isolation. There's already plenty to choose from, but now Facebook is giving us something new to consider as Messenger Rooms begins to roll out across the gl… [+1587 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "Lou Whiteman", "title": "Boeing Abandons $4 Billion Embraer Deal: What It Means for Boeing Stock - Motley Fool", "description": "The good and the bad concerning Boeing's decision to bail on Embraer.", "url": "https://www.fool.com/investing/2020/04/25/boeing-abandons-4-billion-embraer-deal-what-it-mea.aspx", "urlToImage": null, "publishedAt": "2020-04-25T20:30:00Z", "content": "On Saturday, Boeing(NYSE:BA) terminated a $4 billion deal that would have given it controlling of the commercial aerospace operations of Embraer(NYSE:ERJ) after a Friday night deadline came and passed without the two sides ironing out final details.\r\nIn press… [+5558 chars]"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Jim Asker", "title": "Following the Passing of Harold Reid, A Look at the Statler Brothers’ Biggest Billboard Hits - Billboard", "description": "The baritone served as the group’s foundation for more than four decades.", "url": "https://www.billboard.com/articles/business/chart-beat/9365978/statler-brothers-biggest-hits", "urlToImage": null, "publishedAt": "2020-04-25T20:25:22Z", "content": "Following a long battle with kidney failure, Harold Reid, a founding member of The Statler Brothers, died on Friday (April 24) in his hometown Staunton, Va. He was 80.\r\nStaunton was the home base for the group, which initially worked as a gospel group, since … [+2644 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Julie Steenhuysen", "title": "Special Report: Countries, companies risk billions in race for coronavirus vaccine - Reuters", "description": "In the race to develop a vaccine to end the COVID-19 pandemic, governments, charities and Big Pharma firms are sinking billions of dollars into bets with extraordinarily low odds of success.", "url": "https://www.reuters.com/article/us-health-coronavirus-vaccine-specialrep-idUSKCN2270U1", "urlToImage": null, "publishedAt": "2020-04-25T19:51:02Z", "content": "(Reuters) - In the race to develop a vaccine to end the COVID-19 pandemic, governments, charities and Big Pharma firms are sinking billions of dollars into bets with extraordinarily low odds of success. \r\nThey’re fast-tracking the testing and regulatory revie… [+16271 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Stephen Shankland", "title": "iPhone SE outclasses all Android phones thanks to Apple's A13 chip - CNET", "description": "Performance on a budget arrives just in time for buyers spooked by the pandemic.", "url": "https://www.cnet.com/news/iphone-se-outclasses-all-android-phones-thanks-to-apples-a13-chip-processor/", "urlToImage": null, "publishedAt": "2020-04-25T19:18:55Z", "content": "John Kim/CNET\r\nBy packing the big A13 chip into its small iPhone SE, Apple has made its budget smartphone a more compelling product at just the right time for a coronavirus-spooked world. Where most budget phones cut costs by using lower-end processors, the n… [+3579 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Sergei Klebnikov", "title": "Icahn Sees Further Market Crash From Coronavirus, Says He’s Shorting Commercial Real Estate - Forbes", "description": "The billionaire investor said he isn’t buying stocks right now.", "url": "https://www.forbes.com/sites/sergeiklebnikov/2020/04/25/icahn-sees-further-market-crash-from-coronavirus-says-hes-shorting-commercial-real-estate/", "urlToImage": null, "publishedAt": "2020-04-25T19:08:58Z", "content": "One of Wall Streets most successful investors, billionaire Carl Icahn, warned in a recent interview with Bloomberg that stocks are overvalued, and although there will be good opportunities to buy, he expects that the coronavirus will lead to a further market … [+3210 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Julia Musto", "title": "GA salon owners 'thrilled' to reopen as state eases coronavirus restrictions on businesses - Fox News", "description": "Georgia hair salon co-owners Brooke McLaughlin and Julia Butler said Saturday that they are \"excited\" and \"thrilled\" to be able to return to work at the Taylor Brooks Salon as some nonessential businesses in the Peach State have been allowed to open.", "url": "https://www.foxnews.com/media/georgia-hair-salon-owners-reopen-friday-brian-kemp", "urlToImage": null, "publishedAt": "2020-04-25T19:02:02Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nGeorgia hair salon co-owners Brooke McLaughlin and Julia Butler are \"thrilled\" to be able to return to work -- though the new normal at their business includes manda… [+4196 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Cate Cadell", "title": "Global coronavirus death toll hits 200,000 - Reuters", "description": "Global deaths linked to the coronavirus passed 200,000 on Saturday, while confirmed cases of the virus are expected to hit 3 million in coming days, according to a Reuters tally.", "url": "https://www.reuters.com/article/us-health-coronavirus-death-toll-idUSKCN2270S4", "urlToImage": null, "publishedAt": "2020-04-25T18:06:56Z", "content": "(Reuters) - Global deaths linked to the coronavirus passed 200,000 on Saturday, while confirmed cases of the virus are expected to hit 3 million in coming days, according to a Reuters tally. \r\nMore than half of the fatalities have been reported by the United … [+1755 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Henry T. Casey", "title": "Beastie Boys Story is so good you’ll want to pay for Apple TV Plus - Tom's Guide", "description": "Spike Jonze's latest film should show Apple how to make Apple TV Plus a hit", "url": "https://www.tomsguide.com/news/beastie-boys-story-review-apple-tv-plus", "urlToImage": null, "publishedAt": "2020-04-25T17:17:43Z", "content": "Out now, exclusively on Apple TV Plus\r\n, Beastie Boys Story might be my favorite thing I've watched during the 6 weeks I've been stuck inside under quarantine. It also got me thinking about the Apple TV Plus service, which probably hasn't been the home-run hi… [+7073 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Minyvonne Burke", "title": "Texas mayor apologizes after violating stay-at-home order to go to nail salon - NBC News", "description": "The mayor of a southern Texas city apologized for violating her own stay-at-home order after a photo surfaced on social media of her at a nail salon.", "url": "https://www.nbcnews.com/news/us-news/texas-mayor-apologizes-after-violating-stay-home-order-go-nail-n1192631", "urlToImage": null, "publishedAt": "2020-04-25T17:02:47Z", "content": "The mayor of a southern Texas city apologized for violating her own stay-at-home order after a photo surfaced on social media of her at a nail salon.\r\nThe trip Tuesday by Beaumont Mayor Becky Ames to the closed salon has sparked an investigation by the distri… [+2214 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WHO warns 'no evidence' that recovered COVID-19 patients cannot be reinfected - Reuters", "description": "The World Health Organization (WHO) said on Saturday that there was currently “no evidence” that people who have recovered from COVID-19 and have antibodies ...", "url": "https://www.youtube.com/watch?v=zLsDVh_rsbc", "urlToImage": null, "publishedAt": "2020-04-25T16:58:21Z", "content": null}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Bruce Haring", "title": "Georgia Cautiously Reopens, Californians Defy Beach Ban As Temperatures Soar - Deadline", "description": "Even as Georgia became the first state to officially reopen some of its businesses, increasingly restive California residents defied lockdown orders to head to the beaches as temperatures hit the 90s. California Gov. Gavin Newsom pleaded for social distancing…", "url": "https://deadline.com/2020/04/georgia-cautiously-reopens-californians-defy-beach-ban-1202917827/", "urlToImage": null, "publishedAt": "2020-04-25T16:37:14Z", "content": "Even as Georgia became the first state to officially reopen some of its businesses, increasingly restive California residents defied lockdown orders to head to the beaches as temperatures hit the 90s.\r\nCalifornia Gov. Gavin Newsom pleaded for social distancin… [+1228 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "Daniel Miller", "title": "The Auto Industry's Ticking Time Bomb: How Plunging Used Car Prices Could Devastate Automakers - Motley Fool", "description": "How in the world could lower used car prices be such a huge hindrance to automakers that primarily sell new vehicles?", "url": "https://www.fool.com/investing/2020/04/25/the-auto-industrys-ticking-timebomb-how-plunging-u.aspx", "urlToImage": null, "publishedAt": "2020-04-25T16:24:00Z", "content": "It only takes a few minutes of skimming headlines and articles covering the automotive industry to turn a smile upside down. Major manufacturing plants from automakers such as Ford(NYSE:F) and General Motors(NYSE:GM) have halted vehicle production, and analys… [+4730 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Annie Nova", "title": "He was approved for a Paycheck Protection Program loan. Here's his advice to business owners who want one, too - CNBC", "description": "Fabian Videla was one of the small-business owners to get approved for his $60,000 loan from the government, which should keep his employees paid for the next two months. Here's his advice to others trying to get one.", "url": "https://www.cnbc.com/2020/04/25/how-one-small-business-owner-got-the-paycheck-protection-program-loan.html", "urlToImage": null, "publishedAt": "2020-04-25T16:15:52Z", "content": "In March, Fabian Videla realized that his 20-year-old construction and renovation company, Smarter Remodeling,in Jacksonville, Florida, might not survive the coronavirus outbreak. \r\n\"People started canceling sales appointments,\" Videla, 49, said. \"Current cus… [+4238 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Colin Drury", "title": "Coronavirus: Nasa develops ventilator tailored for Covid-19 patients in just 37 days - The Independent", "description": "'We know how to land on the moon and Mars, but building a medical device is new'", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-nasa-ventilators-vital-design-a9484036.html", "urlToImage": null, "publishedAt": "2020-04-25T15:36:59Z", "content": "Engineers at NASA have developed a ventilator specifically designed to help coronavirus patients.\r\nThe VITAL system Ventilator Intervention Technology Accessible Locally was created in just 37 days, the space agency says.\r\nNow, it has already passed critical … [+21785 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "James McAuley", "title": "Violent protests in Paris suburbs reflect tensions under lockdown - The Washington Post", "description": "The coronavirus has highlighted the inequalities between the poor communities and the wealthier capital.", "url": "https://www.washingtonpost.com/world/europe/paris-suburbs-protests-villeneuve-la-garenne/2020/04/25/55f5a40c-85a1-11ea-81a3-9690c9881111_story.html", "urlToImage": null, "publishedAt": "2020-04-25T14:22:48Z", "content": "But, coming five weeks into a lockdown that has exacerbated inequalities, the incident brought simmering tensions to a boiling point in Frances poor and densely populated suburbs.\r\nVideo footage from Villeneuve-la-Garenne this past week showed protesters aimi… [+7625 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Rhett Allain", "title": "Wait a Second, That Table Has No Legs! - WIRED", "description": "How to build “magic,” gravity-defying structures—with Legos, kite string, and physics.", "url": "https://www.wired.com/story/wait-that-table-has-no-legs/", "urlToImage": null, "publishedAt": "2020-04-25T14:00:00Z", "content": "Really, this doesn't tell us much. All it says is that the upward-pulling tension has to be equal to the two downward forces (gravity and the other tension).\r\nBut what about the sum of the torques? If the object is in equilibrium, you can pick any point on th… [+2262 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Lily Hay Newman", "title": "Zoom Upgrades Encryption Keys to What It Promised All Along - WIRED", "description": "Plus: Facebook data on the dark web, Nintendo accounts keep getting hacked, and more of the week's top security news.", "url": "https://www.wired.com/story/security-news-roundup-zoom-upgrades-encryption-keys/", "urlToImage": null, "publishedAt": "2020-04-25T13:11:10Z", "content": "It was another week of social distancing or quarantine for most of the world, but Google published findings that it has seen 12 government-backed hacking groups undeterred by the pandemic and, in fact, trying to take advantage of those conditions for intellig… [+3200 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Sarah Parvini", "title": "Amid coronavirus crisis, mosques could lose key Ramadan donations - Los Angeles Times", "description": "During Ramadan, mosques around the country are able to raise as much as 30% of their annual revenue through charity from congregants. But as mosques shut their doors under coronavirus quarantine orders, they have been taken a financial hit.", "url": "https://www.latimes.com/california/story/2020-04-25/la-me-ramadan-mosques-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T13:04:47Z", "content": "Last year, on the 27th night of Ramadan, the faithful at the Islamic Center of Hawthorne pulled up to the mosque in droves to celebrate one of the holiest nights on the Islamic calendar.\r\nAfter theyd recited sunset prayers and begun their feast of meats, rice… [+5954 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew May", "title": "Celebrating 30 years of the Hubble Space Telescope - Space.com", "description": "Celebrating three decades of an icon of science — and a triumph of technology.", "url": "https://www.space.com/hubble-space-telescope-turns-30.html", "urlToImage": null, "publishedAt": "2020-04-25T12:43:31Z", "content": "It's been 30 years since NASA launched the Hubble Space Telescope on April 24, 1990. The observatory was carried aloft in the payload bay of space shuttle Discovery, and for three decades Hubble's history was closely intertwined with the shuttle's. The telesc… [+8383 chars]"}, {"source": {"id": null, "name": "Tribuneindia.com"}, "author": "Tribune India", "title": "Can you catch Covid-19 twice? WHO answers to it - The Tribune India", "description": "", "url": "https://www.tribuneindia.com/news/health/can-you-catch-covid-19-twice-who-answers-to-it-76173", "urlToImage": null, "publishedAt": "2020-04-25T11:26:13Z", "content": "Geneva, April 25\r\nThe World Health Organisation (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nIn a scientific brief, the Unite… [+1678 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": null, "title": "WHO says you could catch coronavirus more than once - The Boston Globe", "description": "“There is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection,” the United Nations agency said in an April 24 statement.", "url": "https://www.bostonglobe.com/2020/04/25/nation/who-says-you-could-catch-coronavirus-more-than-once/", "urlToImage": null, "publishedAt": "2020-04-25T09:35:16Z", "content": "Catching Covid-19 once may not protect you from getting it again, according to the World Health Organization, a finding that could jeopardize efforts to allow people to return to work after recovering from the virus.\r\nThere is currently no evidence that peopl… [+2099 chars]"}, {"source": {"id": null, "name": "Spaceflightnow.com"}, "author": null, "title": "Citing coronavirus, NASA urges public not to travel for launch of astronauts - Spaceflight Now", "description": null, "url": "https://spaceflightnow.com/2020/04/24/citing-coronavirus-concerns-nasa-discourages-public-from-attending-launch-of-astronauts/", "urlToImage": null, "publishedAt": "2020-04-25T04:48:33Z", "content": "NASA Administrator Jim Bridenstine speaks during a presentation in November 2018 at NASA Headquarters announcing the companies that will compete for the agency’s Commercial Lunar Payload Services program. Credit: NASA/Bill Ingalls\r\nNASA Administrator Jim Brid… [+6811 chars]"}]}