{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Diamond, Jamie Gangel and Tami Luhby, CNN", "title": "White House officials are discussing plans to replace HHS Secretary Alex Azar - CNN", "description": "White House officials are discussing plans to replace Health and Human Services Secretary Alex Azar following a spate of criticism over the early federal response to the coronavirus, a senior administration official confirmed.", "url": "https://www.cnn.com/2020/04/25/politics/white-house-health-and-human-services-secretary-alex-azar/index.html", "urlToImage": null, "publishedAt": "2020-04-26T02:15:57Z", "content": "(CNN)White House officials are discussing plans to replace Health and Human Services Secretary Alex Azar following a spate of criticism over the early federal response to the coronavirus, a senior administration official confirmed.\r\nAny move to replace Azar w… [+5293 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Connie Liou", "title": "'The Bachelorette': Clare Crawley Gets Real About Her Contestants Who Are There for the Wrong Reasons - Showbiz Cheat Sheet", "description": "'The Bachelorette's Clare Crawley calls out her cast on Twitter and Bachelor Nation fans predict she was addressing Matt James.", "url": "https://www.cheatsheet.com/entertainment/bachelorette-clare-crawley-twitter-matt-james.html/", "urlToImage": null, "publishedAt": "2020-04-26T02:05:25Z", "content": "When Clare Crawley was cast as the next bachelorette, Bachelor Nation fans rejoiced. Over the past few years, many fans have called out the ABC reality franchise for rewarding Instagram influencers over genuine romance. And ever since she first appeared on Ju… [+4074 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Christine Wang", "title": "Coronavirus live updates: Singapore reports 618 new cases, Boris Johnson to return to work Monday - CNBC", "description": "The report marks the second day in a row that Singapore's daily new cases were less than 1,000.", "url": "https://www.cnbc.com/2020/04/26/coronavirus-live-updates.html", "urlToImage": null, "publishedAt": "2020-04-26T01:51:52Z", "content": "This is CNBC's live blog covering all the latest news on the coronavirus outbreak. This blog will be updated throughout the day as the news breaks.\r\n<ul><li>Global cases: More than 2.8 million</li><li>Global deaths: At least 202,668</li><li>Most cases reporte… [+4444 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Kyle Madson", "title": "Rams head coach Sean McVay has funny response to Trent Williams trade - Niners Wire", "description": "Sean McVay had a funny response when told about the 49ers trade for left tackle Trent Williams.", "url": "https://ninerswire.usatoday.com/2020/04/25/trent-williams-trade-49ers-rams-sean-mcvay/", "urlToImage": null, "publishedAt": "2020-04-26T01:36:16Z", "content": "The 49ers made the NFL’s biggest splash on Day 3 of the draft when they traded a 2020 fifth-round pick and a 2021 third-round pick for Washington’s seven-time Pro Bowl tackle Trent Williams.\r\nThe trade came as a precursor to Joe Staley’s retirement. With Will… [+1145 chars]"}, {"source": {"id": null, "name": "Eonline.com"}, "author": "Pamela Avila", "title": "Katherine Schwarzenegger Debuts Her Baby Bump Alongside Chris Pratt - E! NEWS", "description": "Katherine Schwarzenegger is debuting her baby bump shortly after it was announced that she was expecting her first child.", "url": "https://www.eonline.com/news/1144919/katherine-schwarzenegger-debuts-her-baby-bump-alongside-chris-pratt-during-bike-ride", "urlToImage": null, "publishedAt": "2020-04-26T01:29:31Z", "content": "Katherine Schwarzenegger is debuting her baby bump shortly after it was announced that she was expecting her first child. \r\nThe 30-year-old and Chris Pratt were spotted out on a bike ride in Santa Monica, Calif. on Saturday afternoon and the mother-to-be's ba… [+835 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "GA salon owners 'thrilled' to reopen as state eases coronavirus restrictions on businesses - India Gone Viral", "description": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.Georgia hair salon co-owners Brooke McLaughlin and Julia Butler are \"thrilled\" to be able to return to work", "url": "https://indiagoneviral.com/worldnews/2020/04/26/ga-salon-owners-thrilled-to-reopen-as-state-eases-coronavirus-restrictions-on-businesses/42621/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-26T01:21:34Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nGeorgia hair salon co-owners Brooke McLaughlin and Julia Butler are “thrilled” to be able to return to work — though the new normal at their business includes mandat… [+4178 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Kristopher Knox", "title": "Ranking Top 6 Future Scenarios for Aaron Rodgers After Packers Draft Jordan Love - Bleacher Report", "description": "The 2020  NFL  draft wrapped up on Saturday, ending one of the most entertaining and unpredictable selection processes in recent memory.   The \"virtual\" nature of the remote draft played a part, but most of the drama came from the selections themselves...", "url": "https://bleacherreport.com/articles/2888669-ranking-top-6-future-scenarios-for-aaron-rodgers-after-packers-draft-jordan-love", "urlToImage": null, "publishedAt": "2020-04-26T01:21:11Z", "content": "Marcio Jose Sanchez/Associated Press\r\nBrady may have outlasted Garoppolo in New England, but he didn't retire when it was time to walk away. Instead, he signed with the Tampa Bay Buccaneers, in part to prove that he could be successful outside of the Patriots… [+785 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Kevin Baxter, Alex Wigglesworth", "title": "Ventura and Orange County beaches fill up as people seek relief from the heat and weeks of staying home - Los Angeles Times", "description": "Coronavirus: Beaches fill up as people seek relief from heat, weeks of staying at home", "url": "https://www.latimes.com/california/story/2020-04-25/beaches-fill-up-as-people-seek-relief-from-heat-weeks-of-staying-at-home", "urlToImage": null, "publishedAt": "2020-04-26T01:14:47Z", "content": "Ventura and Orange county beaches that were open Saturday drew big crowds hoping to cool off and enjoy the views.\r\nOfficials reported few incidents and said people were doing their best to social distance.\r\nIn Ventura, the opening of city and state beaches br… [+3477 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Ramadan: Muslims fast under coronavirus lockdowns - BBC News", "description": "Normally a time when people gather to break their fasts and pray, many are marking Ramadan alone.", "url": "https://www.bbc.com/news/world-52428992", "urlToImage": null, "publishedAt": "2020-04-26T00:38:14Z", "content": "Image copyrightAFPImage caption\r\n A Muslim devotee attends a prayer in Kathmandu amid a government-imposed lockdown across Nepal\r\nMillions of Muslims around the world have found different ways to celebrate Ramadan this year, as restrictions imposed by countri… [+1915 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Kevin Seifert", "title": "2020 NFL draft biggest takeaways - Surprises, lingering questions and lots of dogs - ESPN", "description": "The Packers drafted a QB, while the Patriots did not. What were the other most notable events from the NFL's virtual draft?", "url": "https://www.espn.com/nfl/draft2020/story/_/id/29097982/2020-nfl-draft-biggest-takeaways-surprises-lingering-questions-lots-dogs", "urlToImage": null, "publishedAt": "2020-04-25T23:03:46Z", "content": "The NFL's draft industrial complex took a hit this weekend, and I mean that in the most optimistic way possible. The 2020 virtual NFL draft revealed a level of humanity, intimacy and spartan aesthetics that was not only pitch-perfect amid a national quarantin… [+14616 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Lauren Aratani", "title": "Trump says briefings 'not worth the effort' amid fallout from disinfectant comments - The Guardian", "description": "The president remained behind closed doors after advisers reportedly warned him that the briefings were hurting his campaign", "url": "https://www.theguardian.com/us-news/2020/apr/25/donald-trump-stays-away-from-briefings-amid-fallout-from-disinfectant-comments", "urlToImage": null, "publishedAt": "2020-04-25T22:50:44Z", "content": "After more than a month of near-daily White House coronavirus press briefings, Donald Trump stayed behind closed doors on Saturday after advisers reportedly warned the president that his appearances were hurting his campaign.\r\nTrump himself referenced his abs… [+3432 chars]"}, {"source": {"id": null, "name": "Hawkcentral.com"}, "author": "Chad Leistikow", "title": "Iowa's Geno Stone, Nate Stanley are Day 3 picks in NFL Draft - Hawk Central", "description": "Stone and Stanley bring Iowa's tally to five picks in this year's NFL Draft.", "url": "https://www.hawkcentral.com/story/sports/college/iowa/football/2020/04/25/geno-stone-nate-stanley-day-3-nfl-draft-hawkeyes/3025593001/", "urlToImage": null, "publishedAt": "2020-04-25T22:41:07Z", "content": "The three-year Iowa starter had one of his best games in San Diego, leading five touchdown drives in a 49-24 rout of USC.\r\nHawk Central\r\nHalf of Iowa's secondary has been selected in this year's NFL Draft, 142 picks apart.\r\nA day after cornerback Michael Ojem… [+2159 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Seung Min Kim", "title": "Tensions emerge between Republicans over coronavirus spending and how to rescue the economy - The Washington Post", "description": "A debate is stirring among Republicans about how substantial the package should be and whether concerns about debt are misplaced at a time of economic crisis when the government continues to be able to borrow at rock-bottom prices.", "url": "https://www.washingtonpost.com/politics/republicans-trump-coronavirus-spending-deficit-economy/2020/04/25/9013c5ee-8671-11ea-a3eb-e9fc93160703_story.html", "urlToImage": null, "publishedAt": "2020-04-25T22:39:07Z", "content": "As we start thinking down the road in future iterations, my hope would be that its more fine tuning what weve already done rather than taking on big, aggressive new initiatives that are paid for by additional debt, Senate Majority Whip John Thune (S.D.), the … [+8736 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Hannah Miller", "title": "Potbelly says it will return $10 million small business loan, following others after outrage - CNBC", "description": "Potbelly, which received the maximum loan amount, has a market cap of $71.2 million.", "url": "https://www.cnbc.com/2020/04/25/potbelly-to-return-10-million-ppp-loan-after-outrage.html", "urlToImage": null, "publishedAt": "2020-04-25T22:31:01Z", "content": "Potbelly said Saturday that it will return its $10 million loan from the Payroll Protection Program intended for small businesses, making it the latest notable name to return the funds. \r\nThe sandwich shop chain follows other large, public companies like Ruth… [+2087 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Dennis Romero", "title": "California can check backgrounds of ammunition buyers for now, court says - NBC News", "description": "A federal appeals court ruled late Friday that California could continue checking the backgrounds of ammunition buyers. The state faces a court challenge.", "url": "https://www.nbcnews.com/news/us-news/california-can-check-backgrounds-ammunition-buyers-now-court-says-n1192711", "urlToImage": null, "publishedAt": "2020-04-25T22:22:17Z", "content": "A federal appeals court late Friday ruled that California could continue requiring background checks of ammunition buyers as a challenge to the voter-approved rule makes its way through the justice system.\r\nThe U.S. Court of Appeals for the Ninth Circuit paus… [+1716 chars]"}, {"source": {"id": null, "name": "Wjla.com"}, "author": "ABC7", "title": "CDC adds six new symptoms linked to the coronavirus - WJLA", "description": "The Centers for Disease Control and Prevention has added six new symptoms linked to the coronavirus. The agency had previously only listed fever, cough, and shortness of breath or difficulty breathing as symptoms to watch for. &ldquo;People with COVID-19 have…", "url": "http://wjla.com/news/coronavirus/cdc-symptoms-covid", "urlToImage": null, "publishedAt": "2020-04-25T22:21:00Z", "content": null}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Spencer Kimball", "title": "Coronavirus live updates: Global deaths cross 200,000, US beaches reopen, NY expands testing - CNBC", "description": "The novel coronavirus has infected more than 2.8 million people globally and killed at least 201,502 as of Saturday.", "url": "https://www.cnbc.com/2020/04/25/coronavirus-live-updates.html", "urlToImage": null, "publishedAt": "2020-04-25T21:47:23Z", "content": "The global death toll from the coronavirus pandemic crossed 200,000 on Saturday as countries and a handful of U.S. states ease lockdown restrictions. New York, the epicenter of the outbreak in the U.S., reported hospitalization and death rates that continue t… [+18929 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Mike Wall", "title": "Big asteroid shows itself ahead of Earth flyby on April 29 - Livescience.com", "description": "We have nothing to fear from 1998 OR2.", "url": "https://www.livescience.com/asteroid-1998-or2-photo-april-2020-flyby.html", "urlToImage": null, "publishedAt": "2020-04-25T21:40:00Z", "content": "We've now got a good visual on the big space rock that's going to fly by Earth next week.\r\nOn Saturday (April 18), the Arecibo Observatory\r\n in Puerto Rico captured a radar image of the asteroid 1998 OR2, which will zoom within 3.9 million miles (6.3 million … [+2360 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Jessica Jones", "title": "Spain to allow outdoor exercise as kids prepare for taste of freedom - Reuters", "description": "Spain's Prime Minister Pedro Sanchez announced an easing of lockdown restrictions on Saturday, as children prepared to go outside for the first time in six weeks and figures confirmed a daily coronavirus death toll running well below the peak seen early this …", "url": "https://www.reuters.com/article/us-health-coronavirus-spain-idUSKCN2270KL", "urlToImage": null, "publishedAt": "2020-04-25T21:29:13Z", "content": "MADRID (Reuters) - Spain’s Prime Minister Pedro Sanchez announced an easing of lockdown restrictions on Saturday, as children prepared to go outside for the first time in six weeks and figures confirmed a daily coronavirus death toll running well below the pe… [+3939 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Tom O'Connor, Naveed Jamali", "title": "Despite Kim Jong Un's Absence, Military Activity Suggests Nothing Amiss in North Korea, U.S. Intelligence Says - Newsweek", "description": "North Korean supreme leader Kim Jong Un missed another national holiday, fueling rumors and reports of his health. But U.S. intelligence still sees no sign of him losing power.", "url": "https://www.newsweek.com/despite-kim-jong-uns-absence-military-activity-suggests-nothing-amiss-north-korea-us-1500228", "urlToImage": null, "publishedAt": "2020-04-25T21:29:04Z", "content": "North Korean supreme leader Kim Jong Un missed another national holiday on Saturday, fueling rumors and reports of his health. But U.S. intelligence sees no sign of unusual military activity that would suggest something amiss.\r\n\"Regional militaries in the Wes… [+7660 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "Lou Whiteman", "title": "Boeing Abandons $4 Billion Embraer Deal: What It Means for Boeing Stock - Motley Fool", "description": "The good and the bad concerning Boeing's decision to bail on Embraer.", "url": "https://www.fool.com/investing/2020/04/25/boeing-abandons-4-billion-embraer-deal-what-it-mea.aspx", "urlToImage": null, "publishedAt": "2020-04-25T20:30:00Z", "content": "On Saturday, Boeing(NYSE:BA) terminated a $4 billion deal that would have given it controlling of the commercial aerospace operations of Embraer(NYSE:ERJ) after a Friday night deadline came and passed without the two sides ironing out final details.\r\nIn press… [+5558 chars]"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Jim Asker", "title": "Following the Passing of Harold Reid, A Look at the Statler Brothers’ Biggest Billboard Hits - Billboard", "description": "The baritone served as the group’s foundation for more than four decades.", "url": "https://www.billboard.com/articles/business/chart-beat/9365978/statler-brothers-biggest-hits", "urlToImage": null, "publishedAt": "2020-04-25T20:25:22Z", "content": "Following a long battle with kidney failure, Harold Reid, a founding member of The Statler Brothers, died on Friday (April 24) in his hometown Staunton, Va. He was 80.\r\nStaunton was the home base for the group, which initially worked as a gospel group, since … [+2644 chars]"}, {"source": {"id": null, "name": "Vox.com"}, "author": "Anya van Wagtendonk", "title": "Amid coronavirus concerns, New York and Kentucky allow everyone to vote by mail - Vox.com", "description": "Friday, the governors of New York and Kentucky signed executive orders expanding vote-by-mail access to ensure crowds won’t have to risk coronavirus to vote.", "url": "https://www.vox.com/covid-19-coronavirus-us-response-trump/2020/4/25/21236389/new-york-kentucky-expand-vote-by-mail-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T19:55:36Z", "content": "New York and Kentucky announced new programs on Friday aimed at improving access to mail-in ballots, as both states work to find ways to limit interaction at the polls during upcoming elections amid the Covid-19 pandemic.\r\nOn Friday, New York Gov. Andrew Cuom… [+5095 chars]"}, {"source": {"id": null, "name": "Sfgate.com"}, "author": "Hearst Television", "title": "National coronavirus updates: Worldwide coronavirus death toll passes 200000 - SF Gate", "description": "The latest:", "url": "https://www.sfgate.com/news/article/National-coronavirus-updates-US-death-toll-15225716.php", "urlToImage": null, "publishedAt": "2020-04-25T19:33:52Z", "content": "National coronavirus updates: Auto workers step up to make medical gear\r\nThe latest:\r\n<ul><li>There have been more than 933,000 coronavirus cases in the United States, according to the Johns Hopkins University tally.</li><li>The U.S. death toll has surpassed … [+10255 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Stephen Shankland", "title": "iPhone SE outclasses all Android phones thanks to Apple's A13 chip - CNET", "description": "Performance on a budget arrives just in time for buyers spooked by the pandemic.", "url": "https://www.cnet.com/news/iphone-se-outclasses-all-android-phones-thanks-to-apples-a13-chip-processor/", "urlToImage": null, "publishedAt": "2020-04-25T19:18:55Z", "content": "John Kim/CNET\r\nBy packing the big A13 chip into its small iPhone SE, Apple has made its budget smartphone a more compelling product at just the right time for a coronavirus-spooked world. Where most budget phones cut costs by using lower-end processors, the n… [+3579 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Sergei Klebnikov", "title": "Icahn Sees Further Market Crash From Coronavirus, Says He’s Shorting Commercial Real Estate - Forbes", "description": "The billionaire investor said he isn’t buying stocks right now.", "url": "https://www.forbes.com/sites/sergeiklebnikov/2020/04/25/icahn-sees-further-market-crash-from-coronavirus-says-hes-shorting-commercial-real-estate/", "urlToImage": null, "publishedAt": "2020-04-25T19:08:58Z", "content": "One of Wall Streets most successful investors, billionaire Carl Icahn, warned in a recent interview with Bloomberg that stocks are overvalued, and although there will be good opportunities to buy, he expects that the coronavirus will lead to a further market … [+3210 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "'A very sad day' as coronavirus deaths in UK hospitals top 20000 - Al Jazeera English", "description": "The number of people who have died from coronavirus in the United Kingdom has exceeded 20,000 - up by more than 800 in the past day. The UK is now the fifth ...", "url": "https://www.youtube.com/watch?v=2w0fgaQRsmE", "urlToImage": null, "publishedAt": "2020-04-25T18:59:15Z", "content": "The number of people who have died from coronavirus in the United Kingdom has exceeded 20,000 - up by more than 800 in the past day. The UK is now the fifth country to pass that milestone. Meanwhile, Belgium, the European country with the highest rate of deat… [+334 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "WHO warns against coronavirus 'immunity passports' - Al Jazeera English", "description": "UN health agency says there is 'no evidence' that recovered coronavirus patients are protected from reinfection.", "url": "https://www.aljazeera.com/news/2020/04/warns-coronavirus-immunity-passports-200425150532564.html", "urlToImage": null, "publishedAt": "2020-04-25T18:15:49Z", "content": "The United Nations's health agency has warned there is no scientific evidence to prove that people who have recovered from the coronavirus develop immunity against potential infection in the future.\r\nThe World Health Organization (WHO) gave the warning on Sat… [+2432 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Henry T. Casey", "title": "Beastie Boys Story is so good you’ll want to pay for Apple TV Plus - Tom's Guide", "description": "Spike Jonze's latest film should show Apple how to make Apple TV Plus a hit", "url": "https://www.tomsguide.com/news/beastie-boys-story-review-apple-tv-plus", "urlToImage": null, "publishedAt": "2020-04-25T17:17:43Z", "content": "Out now, exclusively on Apple TV Plus\r\n, Beastie Boys Story might be my favorite thing I've watched during the 6 weeks I've been stuck inside under quarantine. It also got me thinking about the Apple TV Plus service, which probably hasn't been the home-run hi… [+7073 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "Daniel Miller", "title": "The Auto Industry's Ticking Time Bomb: How Plunging Used Car Prices Could Devastate Automakers - Motley Fool", "description": "How in the world could lower used car prices be such a huge hindrance to automakers that primarily sell new vehicles?", "url": "https://www.fool.com/investing/2020/04/25/the-auto-industrys-ticking-timebomb-how-plunging-u.aspx", "urlToImage": null, "publishedAt": "2020-04-25T16:24:00Z", "content": "It only takes a few minutes of skimming headlines and articles covering the automotive industry to turn a smile upside down. Major manufacturing plants from automakers such as Ford(NYSE:F) and General Motors(NYSE:GM) have halted vehicle production, and analys… [+4730 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Colin Drury", "title": "Coronavirus: Nasa develops ventilator tailored for Covid-19 patients in just 37 days - The Independent", "description": "'We know how to land on the moon and Mars, but building a medical device is new'", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-nasa-ventilators-vital-design-a9484036.html", "urlToImage": null, "publishedAt": "2020-04-25T15:36:59Z", "content": "Engineers at NASA have developed a ventilator specifically designed to help coronavirus patients.\r\nThe VITAL system Ventilator Intervention Technology Accessible Locally was created in just 37 days, the space agency says.\r\nNow, it has already passed critical … [+21785 chars]"}, {"source": {"id": null, "name": "Kotaku.com"}, "author": "Zack Zwiezen", "title": "Battlefield V Will Get One Final Update In June - Kotaku", "description": "Battlefield developers Dice announced earlier this week that one final update is coming to Battlefield V in June, though they will continue to combat cheaters even after this last update.", "url": "https://kotaku.com/battlefield-v-will-get-one-final-update-in-june-1843066143", "urlToImage": null, "publishedAt": "2020-04-25T14:56:30Z", "content": "Battlefield developers Dice announced earlier this week that one final update is coming to Battlefield V in June, though they will continue to combat cheaters even after this last update.\r\nReleased in November 2018, Battlefield V took the popular series back … [+822 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Haley Brink and Alta Spells, CNN", "title": "Severe storms possible across parts of the Southeast Saturday - CNN", "description": "Severe storms will track across parts of the Southeast Saturday after causing damage in northeast Texas on Friday.", "url": "https://www.cnn.com/2020/04/25/us/saturday-weather-texas-storm-damage/index.html", "urlToImage": null, "publishedAt": "2020-04-25T14:35:37Z", "content": null}, {"source": {"id": null, "name": "Abs-cbn.com"}, "author": "Agence France-Presse", "title": "WHO: ‘No evidence’ that people who recovered from COVID-19 are immunized - ABS-CBN News", "description": "There is not enough evidence about the effectiveness of antibody-mediated immunity to guarantee the accuracy of an \"immunity passport\" or \"risk-free certificate.\"", "url": "https://news.abs-cbn.com/overseas/04/25/20/who-people-recovered-covid-19-immunized", "urlToImage": null, "publishedAt": "2020-04-25T13:52:00Z", "content": "The World Health Organization (WHO) warned on Saturday that there is no evidence that people who test positive for the new coronavirus are immunized and protected against reinfection.\r\nThe warning suggests that the issuance of \"immune passports\" may promote t… [+2075 chars]"}, {"source": {"id": null, "name": "Interestingengineering.com"}, "author": "Loukia Papadopoulos", "title": "SpaceX Completes Falcon 9 Static Fire Test - Interesting Engineering", "description": "The test comes on the heels of another successful static fire test earlier this week.", "url": "https://interestingengineering.com/spacex-successfully-completes-falcon-9-static-fire-test", "urlToImage": null, "publishedAt": "2020-04-25T13:33:43Z", "content": "Preparations for Crew Dragon’s first operational mission seems to be going well. SpaceX's rocket development facility in McGregor, Texas, announced on Saturday that it successfully completed a static fire test of the Falcon 9 first stage that will launch the … [+1718 chars]"}, {"source": {"id": null, "name": "Thestreet.com"}, "author": "Annie Gaus", "title": "Facebook Reports Earnings on Wednesday: 3 Things to Watch For - TheStreet", "description": "Facebook previously warned investors that its first quarter results were 'adversely affected' by the pandemic. Here's what investors should watch for.", "url": "https://www.thestreet.com/investing/facebook-reports-earnings-on-wednesday-what-to-watch-for", "urlToImage": null, "publishedAt": "2020-04-25T13:08:58Z", "content": "All signs point to a rough quarter for advertising, and Facebook likely won't be immune. \r\nThe world's biggest social network reports its full March quarter earnings on April 29, just a few weeks after warning investors that the coronavirus pandemic had \"adve… [+3550 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew May", "title": "Celebrating 30 years of the Hubble Space Telescope - Space.com", "description": "Celebrating three decades of an icon of science — and a triumph of technology.", "url": "https://www.space.com/hubble-space-telescope-turns-30.html", "urlToImage": null, "publishedAt": "2020-04-25T12:43:31Z", "content": "It's been 30 years since NASA launched the Hubble Space Telescope on April 24, 1990. The observatory was carried aloft in the payload bay of space shuttle Discovery, and for three decades Hubble's history was closely intertwined with the shuttle's. The telesc… [+8383 chars]"}, {"source": {"id": null, "name": "Japantimes.co.jp"}, "author": "Internal Submission", "title": "160000 Nintendo game accounts may have been hacked - The Japan Times", "description": "Birthdays, email addresses and other information of the account holders for game consoles such as Wii U and Nintendo 3DS online, could have been viewed.", "url": "https://www.japantimes.co.jp/news/2020/04/25/business/tech/160000-nintendo-game-accounts-hacked/", "urlToImage": null, "publishedAt": "2020-04-25T01:10:00Z", "content": "Nintendo Co. has said that about 160,000 accounts for its home video game networking service may have been hit by an unauthorized login.\r\nBirthdays, email addresses and other information of the account holders for game consoles such as Wii U and Nintendo 3DS … [+583 chars]"}]}