{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": "Cate Cadell", "title": "Global coronavirus death toll hits 200,000 - Reuters", "description": "Global deaths linked to the coronavirus passed 200,000 on Saturday, while confirmed cases of the virus are expected to hit 3 million in coming days, according to a Reuters tally.", "url": "https://www.reuters.com/article/us-health-coronavirus-death-toll-idUSKCN2270S4", "urlToImage": null, "publishedAt": "2020-04-26T12:17:33Z", "content": "(Reuters) - Global deaths linked to the coronavirus passed 200,000 on Saturday, while confirmed cases of the virus are expected to hit 3 million in coming days, according to a Reuters tally. \r\nMore than half of the fatalities have been reported by the United … [+1755 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Phil McCausland, Jonathan Allen", "title": "Veteran advocates say VA has provided few answers around agency's virus study - NBC News", "description": "Veteran advocates blasted what they called a lack of transparency around the Department of Veterans Affairs' use of hydroxychloroquine as a coronavirus treatment.", "url": "https://www.nbcnews.com/news/us-news/veteran-advocates-say-va-has-provided-few-answers-around-agency-n1190791", "urlToImage": null, "publishedAt": "2020-04-26T12:05:18Z", "content": "Veteran advocates say they are frustrated at the lack of transparency around the Department of Veterans Affairs' use of the unproven drug hydroxychloroquine as a treatment for coronavirus.\r\nAfter the release of a preliminary study of veterans hospitalized wit… [+6933 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Justin Wise", "title": "Brad Pitt plays Anthony Fauci on 'Saturday Night Live,' takes aim at Trump | TheHill - The Hill", "description": "Brad Pitt impersonated Dr. Anthony Fauci, director of the National Institute of Allergy and...", "url": "https://thehill.com/homenews/media/494691-brad-pitt-impersonates-anthony-fauci-on-saturday-night-live-takes-aim-at-trump", "urlToImage": null, "publishedAt": "2020-04-26T11:32:48Z", "content": "Brad Pitt impersonated Dr. Anthony FauciAnthony FauciWHO says there's 'no evidence' recovered coronavirus patients won't get reinfectedTrump coronavirus briefings put health officials in bindHouse Democrats: FDA not doing enough to regulate antibody testsMORE… [+3367 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Stephen Shankland", "title": "iPhone SE outclasses all Android phones thanks to Apple's A13 chip - CNET", "description": "Performance on a budget arrives just in time for buyers spooked by the pandemic.", "url": "https://www.cnet.com/news/iphone-se-outclasses-all-android-phones-thanks-apples-a13-chip-processor/", "urlToImage": null, "publishedAt": "2020-04-26T11:23:59Z", "content": "John Kim/CNET\r\nBy packing the big A13 chip into its small iPhone SE, Apple has made its budget smartphone a more compelling product at just the right time for a coronavirus-spooked world. Where most budget phones cut costs by using lower-end processors, the n… [+3579 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Yuliya Talmazan, Reuters", "title": "As global death toll tops 200,000, WHO warns there's no evidence of coronavirus immunity - NBC News", "description": "The World Health Organization cautioned Saturday that there is currently no evidence that people who have recovered from COVID-19 are immune to the coronavirus.", "url": "https://www.nbcnews.com/news/world/global-death-toll-tops-200-000-who-warns-there-s-n1192831", "urlToImage": null, "publishedAt": "2020-04-26T11:16:00Z", "content": "There is currently no evidence that people who have recovered from COVID-19 are protected from a second infection, the World Health Organization warned Saturday as the worldwide death toll topped 200,000.\r\nThe health body tweeted that it was continuing to rev… [+3444 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": null, "title": "USDA let millions of pounds of food rot while food-bank demand soared - POLITICO", "description": "State officials and growers say Trump’s Agriculture Department has been woefully slow to respond to farm crisis caused by coronavirus.", "url": "https://www.politico.com/news/2020/04/26/food-banks-coronavirus-agriculture-usda-207215", "urlToImage": null, "publishedAt": "2020-04-26T11:11:38Z", "content": "The precipitous drop in demand left many growers with no choice but to trash excess food or leave it in the fields because the cost of picking, packing and storing the crops would only put them further in the hole. Some with more resources in hand took on the… [+4294 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tom Porter", "title": "US intelligence does not believe Kim Jong Un is dead - Business Insider - Business Insider", "description": "Rumors have been swirling about Kim's health since he missed events celebrating the birth of his grandfather, who founded the North Korean regime.", "url": "https://www.businessinsider.com/us-intelligence-does-not-believe-kim-jong-un-is-dead-2020-4", "urlToImage": null, "publishedAt": "2020-04-26T11:11:32Z", "content": "US intelligence agencies do not believe that reports spreading across the internet of North Korean leader Kim Jong Un's death are accurate, The Washington Post reported. \r\nThree government officials familiar with the matter told the publication that US and So… [+1630 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "James Morgan", "title": "Every quarterback drafted before Georgia's Jake Fromm - UGA Wire", "description": "Georgia Bulldogs quarterback Jake Fromm was selected 167th (fifth round) in the 2020 NFL Draft by the Buffalo Bills. Fromm fell further than expected in the NFL Draft due to his subpar junior seaso…", "url": "https://ugawire.usatoday.com/2020/04/26/2020-nfl-draft-quarterbacks-georgia-bulldogs-football-jake-fromm-buffalo-bills/", "urlToImage": null, "publishedAt": "2020-04-26T11:06:46Z", "content": "Georgia Bulldogs quarterback Jake Fromm was selected 167th (fifth round) in the 2020 NFL Draft by the Buffalo Bills. Fromm fell further than expected in the NFL Draft due to his subpar junior season and concerns over his physical talent.\r\nFromm is a proven wi… [+1026 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Evan Halper", "title": "Lawmakers warn coronavirus contact-tracing is ripe for abusive surveillance - Yahoo News", "description": "Silicon Valley can come up with apps that might free Americans from home confinement. But Washington fears creating an invasive surveillance system.", "url": "https://news.yahoo.com/lawmakers-warn-coronavirus-contact-tracing-110029995.html", "urlToImage": null, "publishedAt": "2020-04-26T11:00:00Z", "content": "Smartphones could discreetly detect those who may have COVID-19 and nudge them to quarantine. But some fear that a massive digital contact-tracing infrastructure could become a hulking, invasive surveillance system. (Koichi Kamoshida / Bloomberg)\r\nIt is a big… [+9077 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Jake Rill", "title": "NFL Draft Grades 2020: Final Results and Team-by-Team Letter Chart - Bleacher Report", "description": "For months, NFL analysts and experts speculated over where the top college prospects would land in the 2020 draft. We now have our answers.    The seven-round draft culminated Saturday, with 255 picks taking place over three days...", "url": "https://bleacherreport.com/articles/2888724-nfl-draft-grades-2020-final-results-and-team-by-team-letter-chart", "urlToImage": null, "publishedAt": "2020-04-26T10:32:12Z", "content": "Michael Conroy/Associated Press\r\nFor months, NFL analysts and experts speculated over where the top college prospects would land in the 2020 draft. We now have our answers.\r\nThe seven-round draft culminated Saturday, with 255 picks taking place over three day… [+5042 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Estelle Shirbon", "title": "UK at 'dangerous' stage, no lockdown exit strategy in sight - Reuters", "description": "Britain's stand-in leader resisted pressure on Sunday to explain how the government plans to ease a coronavirus lockdown that has been in place for a month, warning that hasty action could result in a second peak of infections.", "url": "https://www.reuters.com/article/us-health-coronavirus-britain-idUSKCN228073", "urlToImage": null, "publishedAt": "2020-04-26T10:22:04Z", "content": "LONDON (Reuters) - Britain’s stand-in leader resisted pressure on Sunday to explain how the government plans to ease a coronavirus lockdown that has been in place for a month, warning that hasty action could result in a second peak of infections. \r\nForeign Se… [+2976 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Natasha Turak", "title": "Coronavirus live updates: China says all Wuhan patients have been discharged, Russia cases top 80,000 - CNBC", "description": "China reported 11 new confirmed cases in the country and no additional deaths as of April 25, according to its National Health Commission.", "url": "https://www.cnbc.com/2020/04/26/coronavirus-live-updates.html", "urlToImage": null, "publishedAt": "2020-04-26T10:21:30Z", "content": "This is CNBC's live blog covering all the latest news on the coronavirus outbreak. This blog will be updated throughout the day as the news breaks.\r\n<ul><li>Global cases: More than 2.8 million</li><li>Global deaths: At least 202,668</li><li>Most cases reporte… [+8887 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Sameer Yasir, Atul Loke", "title": "Kashmir, Under Siege and Lockdown, Faces a Mental Health Crisis - The New York Times", "description": "Years of strife left a generation traumatized. India’s clampdown disrupted daily life. Now the battle against the coronavirus has further isolated and scarred a people with little access to help.", "url": "https://www.nytimes.com/2020/04/26/world/asia/kasmir-india-mental-health-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-26T09:48:12Z", "content": "PAHOO, Kashmir Sara Begums suffering began on Aug. 3, when masked policemen barged into her home, badly roughed up her son and whisked him away.\r\nMs. Begums son, Fayaz Ahmad Mir, 28, was one of thousands of civilians arrested or detained by order of the India… [+7437 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "What's Next for Global Oil Prices?: The Industry May Shut Down - Bloomberg", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=f3fed920-879a-11ea-8666-95abf40774bf&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNC0yNi90aGUtbmV4dC1jaGFwdGVyLW9mLXRoZS1vaWwtY3Jpc2lzLXRoZS1pbmR1c3RyeS1zaHV0cy1kb3du", "urlToImage": null, "publishedAt": "2020-04-26T08:23:26Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "James Walker", "title": "Trump Hints at Cancelling Coronavirus Press Briefings: 'What is The Purpose?' - Newsweek", "description": "The president also criticized the media for asking \"hostile questions\" as he dodged the coronavirus briefing on Saturday.", "url": "https://www.newsweek.com/trump-coronavirus-briefings-1500256", "urlToImage": null, "publishedAt": "2020-04-26T08:14:15Z", "content": "President Donald Trump wrote on Twitter Saturday that the daily coronavirus briefings were \"not worth the time &amp; effort\" after his remarks on injecting disinfectant drew criticism earlier this week.\r\nDuring his absence at yesterday's White House coronavir… [+2704 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Douglas Busvine", "title": "Germany flips on smartphone contact tracing, backs Apple and Google - Reuters", "description": "Germany changed course on Sunday over which type of smartphone technology it wanted to use to trace coronavirus infections, backing an approach supported by Apple and Google along with a growing number of other European countries.", "url": "https://www.reuters.com/article/us-health-coronavirus-europe-tech-idUSKCN22807J", "urlToImage": null, "publishedAt": "2020-04-26T08:03:22Z", "content": "BERLIN (Reuters) - Germany changed course on Sunday over which type of smartphone technology it wanted to use to trace coronavirus infections, backing an approach supported by Apple and Google along with a growing number of other European countries. \r\nChancel… [+3449 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Joseph Wulfsohn", "title": "CNN 'Larry King' episode featuring Biden accuser's mother disappears from Google Play catalog - Fox News", "description": "The 1993 episode of \"Larry King Live\" featuring an anonymous caller who was later identified as Biden accuser Tara Reade's mother is no longer listed in Google Play's catalog.", "url": "https://www.foxnews.com/media/cnn-larry-king-episode-featuring-biden-accusers-mother-disappears-from-google-play-catalog", "urlToImage": null, "publishedAt": "2020-04-26T05:29:02Z", "content": "The 1993 episode of CNN's \"Larry King Live\" featuring an anonymous caller who was later identified as the mother of Biden accuser Tara Reade was no longer listed in Google Play's catalog late Saturday.\r\nTwitter user J.L. Hamilton shared a screenshot showing t… [+6952 chars]"}, {"source": {"id": null, "name": "Clickondetroit.com"}, "author": "Amber Ainsworth", "title": "Coronavirus in Michigan: Here’s where we stand as of Saturday night - WDIV ClickOnDetroit", "description": "Here's the latest headlines on coronavirus in Michigan.", "url": "https://www.clickondetroit.com/news/michigan/2020/04/26/coronavirus-in-michigan-heres-where-we-stand-as-of-saturday-night/", "urlToImage": null, "publishedAt": "2020-04-26T02:34:59Z", "content": "DETROIT The coronavirus (COVID-19) recovery rate in Michigan rose on Saturday.\r\nHeres what happened Saturday:\r\nThe official COVID-19 recovery rate in Michigan is now 8,342.\r\nOfficials provide an update each Saturday.\r\nFinding new ways to celebrate holy events… [+4065 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/james-griffiths\">James Griffiths</a> and <a href=\"/profiles/jenni-marsh-profile\">Jenni Marsh</a>, CNN", "title": "Worldwide coronavirus death toll passes 200,000: Live updates - CNN International", "description": "The global coronavirus pandemic has brought countries around the world to a standstill. Here are the latest updates on worldwide Covid-19 cases, deaths, government responses and more.", "url": "https://www.cnn.com/world/live-news/coronavirus-pandemic-04-26-20-intl/index.html", "urlToImage": null, "publishedAt": "2020-04-26T02:29:00Z", "content": "It might be necessary to start manufacturing coronavirus vaccines even before they have been fully tested to see if they can protect people from infection, said Richard Hatchett, the CEO of Coalition for Epidemic Preparedness Innovations (CEPI).\r\nCEPI is a no… [+1787 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Diamond, Jamie Gangel and Tami Luhby, CNN", "title": "White House officials are discussing plans to replace HHS Secretary Alex Azar - CNN", "description": "White House officials are discussing plans to replace Health and Human Services Secretary Alex Azar following a spate of criticism over the early federal response to the coronavirus, a senior administration official confirmed.", "url": "https://www.cnn.com/2020/04/25/politics/white-house-health-and-human-services-secretary-alex-azar/index.html", "urlToImage": null, "publishedAt": "2020-04-26T02:15:57Z", "content": "(CNN)White House officials are discussing plans to replace Health and Human Services Secretary Alex Azar following a spate of criticism over the early federal response to the coronavirus, a senior administration official confirmed.\r\nAny move to replace Azar w… [+5293 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Joel Shannon", "title": "Police arrest 3 people protesting closed beaches at SoCal beach set to reopen Monday - USA TODAY", "description": "Encinitas mayor Catherine Blakespear said she believed the protesters “were trying to make a political point\" at a beach scheduled to reopen Monday.", "url": "https://www.usatoday.com/story/news/nation/2020/04/25/3-arrests-beach-protest-san-diego-county-moonlight-beach/3028200001/", "urlToImage": null, "publishedAt": "2020-04-26T01:05:54Z", "content": "A Department of Homeland Security study shows the effects of sunlight, heat and humidity on the half life of the coronavirus that causes COVID-19.\r\nUSA TODAY\r\nSAN DIEGO  San Diego County police say three people protesting beach closures were arrested in Encin… [+3100 chars]"}, {"source": {"id": null, "name": "Nydailynews.com"}, "author": "Storm Gifford", "title": "Kids' stuff: Pratt and Schwarzenegger expecting - New York Daily News", "description": "Chris Pratt and Katherine Schwarzenegger are expecting their first child.", "url": "https://www.nydailynews.com/snyde/ny-kat-and-pratt-20200426-3ljz34ax7nb5xlfwrq5yez3hme-story.html", "urlToImage": null, "publishedAt": "2020-04-26T01:01:41Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Chavez, CNN", "title": "Tampa mayor tries to make amends with Tom Brady in welcome letter - CNN", "description": "Tom Brady has had a few mishaps since moving to Tampa, Florida, so the mayor is trying to make nice with him.", "url": "https://www.cnn.com/2020/04/25/us/tom-brady-tampa-mayor-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-26T00:14:51Z", "content": "(CNN)Tom Brady has had a few mishaps since moving to Tampa, Florida, so the mayor is trying to make nice with him.\r\nThe 42-year-old NFL star was discovered working out in a downtown park earlier this week, and park staff ordered him to leave, Mayor Jane Casto… [+1235 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Hailey Waller", "title": "Richard Branson Seeking Buyer for Virgin Atlantic: Telegraph - Yahoo Finance", "description": "(Bloomberg) -- Richard Branson is seeking a buyer for Virgin Atlantic Airways Ltd. as he struggles to secure a 500 million pound ($618 million) government bailout, the Telegraph reported.Branson has set an end-of-May deadline to save the U.K. airline from col…", "url": "https://finance.yahoo.com/news/richard-branson-seeking-buyer-virgin-211425325.html", "urlToImage": null, "publishedAt": "2020-04-25T23:25:00Z", "content": "(Bloomberg) -- Richard Branson is seeking a buyer for Virgin Atlantic Airways Ltd. as he struggles to secure a 500 million pound ($618 million) government bailout, the Telegraph reported.\r\nBranson has set an end-of-May deadline to save the U.K. airline from c… [+1570 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Tom Holland to host Marvel-themed quiz show on April 29 - Geo News", "description": "The actor plans to host the quiz show for charity amid the coronavirus pandemic", "url": "https://www.geo.tv/latest/284969-tom-holland-to-host-marvel-themed-quiz-show-on-april-29", "urlToImage": null, "publishedAt": "2020-04-25T23:21:54Z", "content": "Tom Holland to host Marvel-themed quiz show on April 29\r\nTom Holland has announced to host a virtual quiz show to help people amid the coronavirus pandemic.\r\nThe Spider-Man actor told Jimmy Kimmel that he will host a Marvel-themed quiz on Instagram.\r\nFor the … [+783 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Anita Bennett", "title": "Tom Hanks, Rita Wilson Donate Blood For Coronavirus Vaccine Research - Deadline", "description": "Tom Hanks and wife Rita Wilson are stepping up to help in the fight against coronavirus. Hanks revealed in a new interview that they volunteered to donate blood for COVID-19 research after recovering from the disease. “A lot of the question is, is what now? W…", "url": "https://deadline.com/2020/04/tom-hanks-rita-wilson-donate-blood-coronavirus-vaccine-1202917940/", "urlToImage": null, "publishedAt": "2020-04-25T23:05:42Z", "content": "Tom Hanks and wife Rita Wilson are stepping up to help in the fight against coronavirus. Hanks revealed in a new interview that they volunteered to donate blood for COVID-19research after recovering from the disease.\r\n“A lot of the question is, is what now? W… [+744 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Seung Min Kim", "title": "Tensions emerge between Republicans over coronavirus spending and how to rescue the economy - The Washington Post", "description": "A debate is stirring among Republicans about how substantial the package should be and whether concerns about debt are misplaced at a time of economic crisis when the government continues to be able to borrow at rock-bottom prices.", "url": "https://www.washingtonpost.com/politics/republicans-trump-coronavirus-spending-deficit-economy/2020/04/25/9013c5ee-8671-11ea-a3eb-e9fc93160703_story.html", "urlToImage": null, "publishedAt": "2020-04-25T22:39:07Z", "content": "As we start thinking down the road in future iterations, my hope would be that its more fine tuning what weve already done rather than taking on big, aggressive new initiatives that are paid for by additional debt, Senate Majority Whip John Thune (S.D.), the … [+8736 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Sergei Klebnikov", "title": "These Stocks Will Thrive In A Post-Coronavirus World, According To Experts - Forbes", "description": "Here are 19 stocks that will benefit from new consumer trends once quarantine orders are lifted.", "url": "https://www.forbes.com/sites/sergeiklebnikov/2020/04/25/these-stocks-will-thrive-in-a-post-coronavirus-world-according-to-experts/", "urlToImage": null, "publishedAt": "2020-04-25T22:20:01Z", "content": "Despite the coronavirus pandemic causing unprecedented financial disruptions and a major shift in the lives of American consumers, a slowdown in new cases has made Wall Street more optimistic about eventually reopening the economy and here are 19 stocks poise… [+3491 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Holly Bailey", "title": "In Wisconsin, protesters attack stay-at-home orders as unnecessary — or a government cabal - The Washington Post", "description": "", "url": "https://www.washingtonpost.com/politics/2020/04/25/wisconsin-protestors-attack-stay-at-home-orders-unnecessary-or-government-cabal/", "urlToImage": null, "publishedAt": "2020-04-25T21:53:00Z", "content": "What has not been fine, she said, is what has happened to her family in the past month. Most of her children and grandchildren work in the service industry, including in salons and restaurants, and all had been laid off several weeks ago as Wisconsin ordered … [+9008 chars]"}, {"source": {"id": null, "name": "Universetoday.com"}, "author": "https://www.facebook.com/Storiesbywilliams-205745679447998/?ref=hl", "title": "This is the Final Picture NASA's Spitzer Space Telescope - Universe Today", "description": "NASA has just released a mosaic of the California Nebula, which was created from the final images snapped by the Spitzer Space Telescope.", "url": "https://www.universetoday.com/145828/this-is-the-final-picture-nasas-spitzer-space-telescope/", "urlToImage": null, "publishedAt": "2020-04-25T21:24:00Z", "content": "On Jan. 30th, 2020, NASA’s Spitzer Space Telescope was retired after sixteen years of faithful service. As one of the four NASA Great Observatories – alongside Hubble, Chandra, and Compton space telescopes – Spitzer was dedicated to studying the Universe in i… [+5261 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "Facebook adds Messenger Rooms to the bevy of group video services - Android Police", "description": "Video calls have become an important way to stay in touch with friends and family during this time of isolation. There's already plenty to choose from,", "url": "https://www.androidpolice.com/2020/04/25/facebook-adds-messenger-rooms-to-the-bevy-of-group-video-services/", "urlToImage": null, "publishedAt": "2020-04-25T20:49:00Z", "content": "Video calls have become an important way to stay in touch with friends and family during this time of isolation. There's already plenty to choose from, but now Facebook is giving us something new to consider as Messenger Rooms begins to roll out across the gl… [+1587 chars]"}, {"source": {"id": null, "name": "Si.com"}, "author": "Michael McCann", "title": "Debunking the Michael Jordan Gambling Conspiracy - Sports Illustrated", "description": "Michael Jordan's first retirement from the NBA has led to conspiracy theories over the years to explain why he left the Chicago Bulls in October 1993.", "url": "https://www.si.com/nba/2020/04/25/michael-jordan-retirement-gambling-conspiracy", "urlToImage": null, "publishedAt": "2020-04-25T20:13:00Z", "content": "While most of The Last Dance’s commentary on Michael Jordan is flattering, Jordan’s career featured several controversies that will be explored in upcoming episodes. One was his shocking decision to retire from the NBA in October 1993. \r\nJordan was only 30 ye… [+12212 chars]"}, {"source": {"id": null, "name": "Seekingalpha.com"}, "author": "Lance Roberts", "title": "MacroView: The Oil Price Crash Was Inevitable - Seeking Alpha", "description": "Nobody wanted to pay much attention to the fundamentals at a time when near-zero interest rates were pushing banks, hedge funds, and private equity firms to chase the \"yield\" in the energy space.The charts for WTI remain bearish, and the fundamentals are stil…", "url": "https://seekingalpha.com/article/4339980-macroview-oil-price-crash-was-inevitable", "urlToImage": null, "publishedAt": "2020-04-25T18:50:32Z", "content": "The oil price crash was inevitable.\r\nTo understand why, we have to review a bit of history.\r\nIn 2013, I began warning of the risk to oil prices due to the ongoing imbalances between global supply and demand. Those warnings fell on deaf ears.\r\nNobody wanted to… [+12630 chars]"}, {"source": {"id": null, "name": "Newser.com"}, "author": "Jenn Gidman", "title": "NASA's Hubble Space Telescope Takes Photo of 'Cosmic Reef' Nebulas to Celebrate 30th Anniversary in Space - Newser", "description": "To celebrate 30 years in space, a jaw-dropping photo of 'Cosmic Reef' nebulas", "url": "https://www.newser.com/story/290033/hubble-telescope-gives-itself-stunning-anniversary-gift.html", "urlToImage": null, "publishedAt": "2020-04-25T14:00:00Z", "content": "(Newser)\r\nOn April 24, 1990, the space shuttle Discovery lifted off from Florida's Kennedy Space Center, with a very special item on board: the Hubble Space Telescope, which was launched into Earth's orbit a day later. Now, to celebrate the telescope's 30th a… [+1276 chars]"}, {"source": {"id": null, "name": "Spaceflightnow.com"}, "author": null, "title": "Citing coronavirus, NASA urges public not to travel for launch of astronauts - Spaceflight Now", "description": null, "url": "https://spaceflightnow.com/2020/04/24/citing-coronavirus-concerns-nasa-discourages-public-from-attending-launch-of-astronauts/", "urlToImage": null, "publishedAt": "2020-04-25T04:48:33Z", "content": "NASA Administrator Jim Bridenstine speaks during a presentation in November 2018 at NASA Headquarters announcing the companies that will compete for the agency’s Commercial Lunar Payload Services program. Credit: NASA/Bill Ingalls\r\nNASA Administrator Jim Brid… [+6811 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What COVID-19 Symptoms Should People Be On The Lookout For? - WCCO - CBS Minnesota", "description": "There are so many unknowns about COVID-19. But, one thing has been clear – the virus can present itself differently in different people, Heather Brown report...", "url": "https://www.youtube.com/watch?v=Ml0aBNKYVyc", "urlToImage": null, "publishedAt": "2020-04-25T03:58:36Z", "content": "There are so many unknowns about COVID-19. But, one thing has been clear the virus can present itself differently in different people, Heather Brown reports (2:37).WCCO 4 News at 10 April 24, 2020"}, {"source": {"id": null, "name": "Keprtv.com"}, "author": "Christopher Poulsen", "title": "Police cars make some noise for Pasco boy's birthday - KEPR 19", "description": "PASCO, Wash. -- Coronavirus is changing the way families are celebrating birthdays. A parade of Pasco police made sure 10-year-old Stryker Smith enjoyed his birthday. Sgt. Rodrigo Pruneda says the usual party with friends, cake and candles is out of reach thi…", "url": "http://keprtv.com/news/coronavirus/police-cars-make-some-noise-for-pasco-boys-birthday", "urlToImage": null, "publishedAt": "2020-04-25T01:07:08Z", "content": null}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Eric Mack", "title": "Lyrid meteor shower, the best night sky show for months, is still active - CNET", "description": "The peak is past, but you might still be able to catch a few shooting stars this weekend. Besides, you probably don't have anywhere else to go.", "url": "https://www.cnet.com/news/lyrid-meteor-shower-the-best-night-sky-show-for-months-is-still-active/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:53Z", "content": "The 2012 Lyrid meteor shower as captured by astronaut Don Pettit aboard the International Space Station. \r\nNASA\r\nThe annual Lyrid meteor shower officially started last week, and although the peak happened earlier this week, the night sky show will stay active… [+2433 chars]"}]}