{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "James Matthey", "title": "The Last Dance: Dennis Rodman’s wild bender, Carmen Electra cameo - NEWS.com.au", "description": "The Last Dance: Dennis Rodman’s wild Las Vegas bender brought to light", "url": "https://www.news.com.au/sport/american-sports/nba/the-last-dance-dennis-rodmans-wild-las-vegas-bender-brought-to-light/news-story/dfb3a2c127abca463cc29eec2b2483a3", "urlToImage": null, "publishedAt": "2020-04-27T02:12:10Z", "content": "Dennis Rodman is a character as colourful as they come and the stories told about the NBA icon during his final season with the Chicago Bulls definitely dont disappoint.The tattooed, pierced friend of North Korean dictator Kim Jong-un was an enigmatic defensi… [+2878 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Surprising list of the world’s biggest sports stadiums ... you probably haven’t been to No.1 - Fox Sports", "description": "Right now they’re sadly all empty, but is there anything quite like a huge sporting ground at full capacity?", "url": "https://www.foxsports.com.au/more-sports/surprising-list-of-the-worlds-biggest-sports-stadiums-you-probably-havent-been-to-no1/news-story/7cf187274ea66c37626f9618d9a9c5ea", "urlToImage": null, "publishedAt": "2020-04-27T01:59:00Z", "content": "Imagine the atmosphere of being in Brazils Maracana stadium when almost 200,000 fans packed in for the 1950 World Cup final, or when an estimated 150,000 witnessed Scotland v England at Glasgows Hampden Park in 1937.\r\nWith terraces replaced by set seating and… [+4788 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Australian Open finalist Dominic Thiem will not pay for tennis relief fund during coronavirus shutdown - ABC News", "description": "The men's world number three has earned more than $37 million during his career, but he says he is not willing to contribute to a planned relief program to help struggling tennis professionals.", "url": "https://www.abc.net.au/news/2020-04-27/coronavirus-dominic-thiem-against-funding-lower-ranked-players/12188120", "urlToImage": null, "publishedAt": "2020-04-27T01:51:59Z", "content": "Updated \r\nApril 27, 2020 11:04:00\r\nAustralian Open finalist Dominic Thiem does not believe the top tennis players in the world should help fund lower-ranked professionals struggling financially while the ATP and WTA Tours are suspended because of coronavirus.… [+3089 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Live: Saints coach has his say on whether players could refuse to join quarantine hubs - Fox Sports", "description": "The AFL is still a fortnight away from announcing a restart date.", "url": "https://www.foxsports.com.au/afl/afl-2020-coronavirus-updates-covid19-melbourne-afl-hubs-gold-coast-ed-langdon/news-story/385717ff270e2bd0d21233bcd6b0e19b", "urlToImage": null, "publishedAt": "2020-04-27T01:48:00Z", "content": "But one Demon is concerned about the mental health of players if isolation hubs are used, with Gold Coast among the potential home bases considered.\r\nFollow all the latest AFL developments below. \r\nWatch Foxtel in an instant. Catch up and settle in with no in… [+5619 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Australian Associated Press", "title": "Police investigate NRL stars Josh Addo-Carr and Latrell Mitchell over gathering - The Guardian", "description": "NSW Police will investigate whether Kangaroos stars Latrell Mitchell and Josh Addo-Carr flouted social distancing laws on a mid-north coast farm", "url": "https://www.theguardian.com/sport/2020/apr/27/police-investigate-nrl-stars-josh-addo-carr-and-latrell-mitchell-over-social-media-post", "urlToImage": null, "publishedAt": "2020-04-27T01:30:45Z", "content": "New South Wales Police will investigate whether Kangaroos stars Latrell Mitchell and Josh Addo-Carr flouted social distancing laws on a mid-north coast farm.\r\nOn the same day the NRL gave clubs a draft of strict new biosecurity rules, Addo-Carr posted images … [+2331 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": null, "title": "'I can't thank you enough': Masoe's tribute after leaving hospital - Sydney Morning Herald", "description": "Former Roosters and Panthers hardman Mose Masoe has been released from an English hospital after suffering a career-ending spinal injury in January.", "url": "https://www.smh.com.au/sport/nrl/i-can-t-thank-you-enough-masoe-s-tribute-after-leaving-hospital-20200427-p54nif.html", "urlToImage": null, "publishedAt": "2020-04-27T01:08:09Z", "content": "The former Sydney Roosters and Penrith forward is determined to make a full recovery and recently started walking again with the aid of crutches.\r\nMasoe was initially told in late March that he would have to make way for coronavirus patients and leave the Wak… [+512 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "AFL 2020: Photos coaches would prefer stayed in the archives - Fox Sports", "description": "They’re notoriously surly and straight-faced in public these days, but almost every one of the AFL’s coaches used to be a player — and one of the boys.", "url": "https://www.news.com.au/sport/afl/afl-2020-photos-coaches-would-prefer-stayed-in-the-archives/news-story/483b07f8ec51411fc569968f48bf639d", "urlToImage": null, "publishedAt": "2020-04-27T01:04:00Z", "content": null}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Cricket news, 2020: Michael Clarke, Lara Bingle break-up, diamond ring story - NEWS.com.au", "description": "‘I’m dumb, but not that dumb’: Michael Clarke lifts the lid on diamond ring rumour", "url": "https://www.foxsports.com.au/cricket/australia/im-dumb-but-not-that-dumb-michael-clarke-lifts-the-lid-on-that-diamond-ring-rumour/news-story/b325c379d4608f11ee16e15eaa5d0862", "urlToImage": null, "publishedAt": "2020-04-27T00:11:15Z", "content": "Its one of the great urban legends in Australian sport and in a cheeky radio segment Michael Clarke was forced to again answer questions about his break-up with model Lara Bingle and that famous diamond ring. Photos of Clarke clearing out his Bondi Beach apar… [+3045 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Taggart makes goalscoring return in Korea - The World Game", "description": "Last season's K League 1 top scorer Adam Taggart has wasted no time finding the back of the net as Suwon Bluewings prepare for the new campaign to get underway.", "url": "https://theworldgame.sbs.com.au/taggart-makes-goalscoring-return-in-korea", "urlToImage": null, "publishedAt": "2020-04-26T23:31:00Z", "content": "While most of his Socceroos teammates kick their heels with leagues suspended across the globe, Taggart took to the field this past weekend as Bluewings faced Seoul E-Land in a pre-season friendly.\r\nThe Australian notched the only goal of the game in the 10th… [+1548 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Ten Network boss slams Rugby Australia’s ‘shameful’ handling of Raelene Castle exit - Fox Sports", "description": "Ten’s outgoing chief executive has reportedly lashed Rugby Australia over the circumstances of Raelene Castle’s resignation as Optus signalled an intention to further delay talks on a new broadcast deal.", "url": "https://www.foxsports.com.au/rugby/rugby-news-raelene-castle-sacked-channel-10-next-ceo-update-super-rugby/news-story/a312996d2b50f7fb871edc150ea82c37", "urlToImage": null, "publishedAt": "2020-04-26T23:07:47Z", "content": "The developments put the code into further turmoil as RA chairman Paul McLean prepares to sit down on Monday for talks with 10 former Wallabies captains who wrote a letter expressing their discontent at the state of rugby.\r\nTen boss Paul Anderson described th… [+1013 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Forced out by one legendary quarterback, this NFL enigma will now fight to back up another - Fox Sports", "description": "Jameis Winston, the former Tampa Bay quarterback who lost his starting job to six-time Super Bowl winner Tom Brady, is the newest recruit for the NFL’s New Orleans Saints.", "url": "https://www.foxsports.com.au/nfl/forced-out-by-one-legendary-quarterback-this-nfl-enigma-will-now-fight-to-back-up-another/news-story/75ea891c89a4c8b5999e78e105f9615f", "urlToImage": null, "publishedAt": "2020-04-26T22:01:42Z", "content": "The deal, confirmed in a league Twitter posting and expected to be signed later Sunday, ends Winstons month-long search for a new team, finding one with an NFC South division rival of his former club.\r\nWinston, the top pick in the 2015 NFL draft, led the leag… [+1481 chars]"}, {"source": {"id": null, "name": "Afl.com.au"}, "author": "Riley Beveridge", "title": "Why AFL recruiters eagerly watched the NFL draft - Australian Football League", "description": "A look at how clubs are planning to potentially profit from a new-look trade and draft system", "url": "https://www.afl.com.au/news/392072/why-afl-recruiters-eagerly-watched-the-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-26T21:40:00Z", "content": "AS THE NFL Draft played out across the United States over the weekend, a number of AFL recruiters eagerly watched on from the other side of the globe attempting to gather any trends or strategies they could identify.\r\nThe 'virtual' nature of an NFL Draft impa… [+4125 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Tennis star challenged fans to play her on PS4... but it kept crashing - Fox Sports", "description": "Eugenie Bouchard’s PlayStation crashed because so many fans tried to add her online.", "url": "https://www.foxsports.com.au/tennis/tennis-star-challenged-fans-to-play-her-on-ps4-but-it-kept-crashing/news-story/3475558f230574e87f68fbe81270b9fc", "urlToImage": null, "publishedAt": "2020-04-26T21:29:07Z", "content": "The Canadian tennis star challenged her followers to a game of Tennis World Tour and encouraged them to add her username but it crashed her system.\r\nThe 26-year-old is preparing for an online tournament on Monday The Mutua Madrid Open Virtual Pro in which a n… [+1699 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "Mark Schlabach", "title": "Tulane guard Teshaun Hightower charged with murder in Georgia - ESPN India", "description": "Teshaun Hightower, the Green Wave's leading scorer in 2019-20 after transferring from Georgia, was arrested Saturday and charged with murder in connection with a homicide in Stockbridge, Georgia, earlier this month.", "url": "https://www.espn.in/mens-college-basketball/story/_/id/29101453/tulane-guard-teshaun-hightower-charged-murder-georgia", "urlToImage": null, "publishedAt": "2020-04-26T20:25:36Z", "content": "Tulane basketball player Teshaun Hightower was arrested Saturday and charged with murder in connection with a homicide in Stockbridge, Georgia, earlier this month.\r\nHightower, the Green Wave's leading scorer in the 2019-20 season, was being held in the Henry … [+1376 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Stokes plays hardball on $350m sports rights bill - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-26T20:13:00Z", "content": null}, {"source": {"id": null, "name": "Speedcafe.com"}, "author": null, "title": "Triple Eight Race Engineering reveals updated ventilator - Speedcafe", "description": "Supercars team Triple Eight Race Engineering has revealed the second iteration of its emergency medical ventilator prototype", "url": "https://www.speedcafe.com/2020/04/27/triple-eight-race-engineering-reveals-updated-ventilator/", "urlToImage": null, "publishedAt": "2020-04-26T20:00:00Z", "content": "The second version of the Triple Eight Race Engineering emergency ventilator prototype\r\nSupercars team Triple Eight Race Engineering has revealed the second iteration of its emergency medical ventilator prototype.\r\nThe team has also released a behind-the-scen… [+4549 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Two cross-code stars and a reformed bad boy: Eight greatest wingers of NRL era - Fox Sports", "description": "<b>Tune into our new show Fox League Live on Channel 502 Monday to Friday at 6.30pm and on Saturday at 3pm and Sunday at 5pm.</b>", "url": "https://www.foxsports.com.au/nrl/nrl-premiership/two-current-stars-and-two-dual-internationals-best-wingers-of-nrl-era/news-story/ec32f875e58f98bb3c7d36215e5c955f", "urlToImage": null, "publishedAt": "2020-04-26T14:00:42Z", "content": "Wingers have evolved from fleet footed flyers to barnstorming behemoths and back up front-rowers over the course of the modern era.\r\nWe take a look back at some of the most brilliant flyers since 1998 to decide the best winger of the NRL era.\r\nScroll down to … [+6185 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Brendon Goddard is footy’s most misunderstood man, and I get why he regrets joining the Bombers: Zach Merrett column - Fox Sports", "description": "In my time in football, Brendon Goddard is the most misunderstood person I’ve come across.", "url": "https://www.foxsports.com.au/afl/brendon-goddard-is-footys-most-misunderstood-man-and-i-get-why-he-regrets-joining-the-bombers-zach-merrett-column/news-story/b9b351ed664d3fd72da13adec7f88447", "urlToImage": null, "publishedAt": "2020-04-26T14:00:42Z", "content": "Hes one of very few players Ive seen that could simultaneously communicate strongly to his teammates, abuse an opponent, tell an umpire why they were wrong and still perform at an extremely high level on a consistent basis.\r\nJordan Lewis, Luke Hodge, Jarrad M… [+6096 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Levi Parsons For Daily Mail Australia", "title": "Mentor to Ben Cousins says he will continue to support him despite his epic fall from grace - Daily Mail", "description": "Cousins remains in custody and is facing a second long-term stint behind bars after officers found him sleeping next to his car at East Victoria Park in Perth with 2.5g of ice.", "url": "https://www.dailymail.co.uk/news/article-8258003/Mentor-Ben-Cousins-says-continue-support-despite-epic-fall-grace.html", "urlToImage": null, "publishedAt": "2020-04-26T13:57:49Z", "content": "Ben Cousin's former coach says he feels sorry for the fallen AFL star and is committed to dragging him out of drug addiction.\r\nCousins is facing a second long-term stint behind bars after police allegedly found him sleeping next to his car at East Victoria Pa… [+6170 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Super Rugby as it exists could be dead - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-26T10:58:00Z", "content": null}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Chris De Silva", "title": "Shane Richardson takes name out of running for NRL CEO job, defends Todd Greenberg - Wide World of Sports", "description": "'I really do believe he inherited a poisoned chalice'", "url": "https://wwos.nine.com.au/nrl/shane-richardson-slams-todd-greenberg-criticism-removes-name-from-nrl-ceo-race/c21072df-fa4d-42fa-9836-87b4953003f5", "urlToImage": null, "publishedAt": "2020-04-26T10:30:02Z", "content": "Former Souths boss Shane Richardson has taken his name out of the running to become the NRL's next CEO, lashing the treatment of former league boss Todd Greenberg.\r\nGreenberg resigned from the position last week following the revelation of the league's disast… [+2729 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": null, "title": "Monday Buzz: State of Origin switch huge boost for NRL - Daily Telegraph", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.dailytelegraph.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-26T10:00:00Z", "content": null}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Georgina Robinson", "title": "Penrith and Newcastle in race to claim extra Shute Shield spot - Sydney Morning Herald", "description": "Finally, a timeline for club footy. The Shute Shield will return on July 25 with an exciting twist.", "url": "https://www.smh.com.au/sport/rugby-union/penrith-and-newcastle-in-race-to-claim-extra-shute-shield-spot-20200426-p54ndq.html", "urlToImage": null, "publishedAt": "2020-04-26T09:51:49Z", "content": "\"Newcastle understand our competition and the strength they need in their playing roster. We wouldn't be putting them in unless they have one that shows they can be competitive,\" he said. \"Penrith continue to talk to the Western Force, which is a strong relat… [+2073 chars]"}, {"source": {"id": null, "name": "Womens.afl"}, "author": "Marc McGowan", "title": "WATCH: Mark and Goal of the year revealed Check out the winner of this year's Mark - AFLW", "description": "Check out the winner of this year's Mark and Goal of the Year", "url": "https://womens.afl/news/50120/watch-mark-and-goal-of-the-year-revealed", "urlToImage": null, "publishedAt": "2020-04-26T09:45:00Z", "content": "COMEBACK Giant Rebecca Privitelli and gun Demon Kate Hore are this year's recipients of the AFLW Mark of the Year and Coates Hire Goal of the Year.\r\nPrivitelli, 25, joined the Giants for the 2018 season but was delisted at season's end and opted to sit out of… [+2892 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Nic Savage", "title": "NRL news 2020: players and staff to undergo strict safety protocols ahead of return - NEWS.com.au", "description": "NRL players and staff to undergo strict biosecurity protocols ahead of season’s return", "url": "https://www.news.com.au/sport/nrl/nrl-players-and-staff-to-undergo-strict-biosecurity-protocols-ahead-of-seasons-return/news-story/d595ed63c22f104691365371147f037f", "urlToImage": null, "publishedAt": "2020-04-26T09:42:20Z", "content": "NRL players and staff will be banned from exercising in public places and catching Ubers under strict restrictions to be enforced when training resumes next month.Despite some reluctance from Channel 9, the NRL’s broadcast partners agreed to a May 28th restar… [+3034 chars]"}, {"source": {"id": null, "name": "Racing.com"}, "author": "Brad Bishop", "title": "Purton creates Hong Kong history 26 Apr, 2020 - Racing.com", "description": "Dirty day turns around as Aussie jockey creates Hong Kong history", "url": "https://www.racing.com/news/2020-04-26/news-purtons-historic-cup-win", "urlToImage": null, "publishedAt": "2020-04-26T09:37:02Z", "content": "Zac Purton salvaged something from what had been a Champions Day wreck when he partnered Exultant to victory in the QEII Cup (2000m).\r\nBeaten aboard short-priced favourites in the other two Group 1s, the Australian jockey guided the $1.50 favourite to a tough… [+2534 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Peter Ryan", "title": "'I'm not sure everyone would cope': AFL seeks approval for hub plan - The Age", "description": "The AFLPA remains open to the idea of using quarantine hubs to restart the season, but are determined to ensure that any demands made on players and their families are reasonable.", "url": "https://www.theage.com.au/sport/afl/i-m-not-sure-everyone-would-cope-afl-seeks-approval-for-hub-plan-20200425-p54n7u.html", "urlToImage": null, "publishedAt": "2020-04-26T08:59:12Z", "content": "Although the 24-year-old recruit is comfortable about moving into hubs to resume the season he said setting them up properly was likely to be complicated.\r\n\"It's going to be hard for players and staff to go from the current climate we are in now where you are… [+1536 chars]"}, {"source": {"id": null, "name": "Adelaidenow.com.au"}, "author": null, "title": "Crows, Magpies in doubt as SANFL clubs struggle to meet JobKeeper payment requirements due to financial impact of COVID-19 - The Advertiser", "description": "Subscribe to The Advertiser to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.adelaidenow.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-26T08:30:00Z", "content": null}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "'Administrators should look at cutting administration costs', says Postecoglou - The World Game", "description": "Ange Postecoglou has spoken about the challenges facing the A-League and his own as coach of defending J.League champions Yokohama F. Marinos during COVID-19 lockdown.", "url": "https://theworldgame.sbs.com.au/administrators-should-look-at-cutting-administration-costs-says-postecoglou", "urlToImage": null, "publishedAt": "2020-04-26T08:07:00Z", "content": "Former Australia coach Postecoglou spoke to ABC's Offsiders from his home in Japan about the troubles facing the A-League and it potentially losing momentum in the Australian sporting landscape.\r\nAdministrators talking about cutting costs thats nothing new,\" … [+2118 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "AAP", "title": "Away Game ready to take on the big girls in Robert Sangster Stakes - Racenet", "description": "Away Game's already memorable juvenile season could reach new heights if the bold plan to run her in the weight-for-age Group I Robert Sangster Stakes is successful.", "url": "https://www.racenet.com.au/news/away-game-ready-to-take-on-the-big-girls-in-sangster-20200426", "urlToImage": null, "publishedAt": "2020-04-26T08:02:22Z", "content": "Away Game's already memorable juvenile season could reach new heights if the bold plan to run her in the weight-for-age Group I Robert Sangster Stakes is successful.\r\nAfter Away Game won the Group II Percy Sykes Stakes at Randwick on April 11, trainers Ciaron… [+1712 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Chris De Silva", "title": "Melbourne Storm star Sandor Earl launches passionate defence of NRL's restart plans - Wide World of Sports", "description": "'Outlandish comments to try and get a little bit of publicity'", "url": "https://wwos.nine.com.au/nrl/sandor-earl-slams-misguided-information-surrounding-nrl-return-from-coronavirus-covid-19-melbourne-storm/15e90b14-6f06-4ba0-b279-65afca4bca01", "urlToImage": null, "publishedAt": "2020-04-26T07:23:15Z", "content": "Melbourne Storm star Sandor Earl has slammed \"misguided information\" that has resulted in the NRL being heavily criticised in its attempts to restart the season.\r\nAfter ARL Commissioner Wayne Pearce announced that the league was sticking to its proposed May 2… [+4023 chars]"}, {"source": {"id": null, "name": "Punters.com.au"}, "author": "James Lamb", "title": "Hot favourite eased out of Chairman's Sprint - Punters", "description": "Raging-hot favourite Aethero has suffered his second heavy defeat in a row, failing to beat a runner home in Sunday's G1 Chairman's Sprint at Sha Tin.", "url": "https://www.punters.com.au/news/hot-favourite-eased-out-of-chairmans-sprint_190197/", "urlToImage": null, "publishedAt": "2020-04-26T07:15:00Z", "content": "Raging-hot favourite Aethero has suffered his second heavy defeat in a row, failing to beat a runner home in Sunday's G1 Chairman's Sprint (1200m) at Sha Tin. The boom sprinter, backed from $2.50 into $1.85, jumped well to find the lead under Zac Purton but w… [+1089 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "Brad Waters", "title": "Inquiry in Vega One ride at Sunshine Coast - Racenet", "description": "Racing Queensland stewards have opened an inquiry into apprentice Baylee Nothdurft’s tactics on the Tony Gollan-trained Vega One at the Sunshine Coast on Saturday.", "url": "https://www.racenet.com.au/news/inquiry-in-vega-one-ride-at-sunshine-coast-20200426", "urlToImage": null, "publishedAt": "2020-04-26T06:56:15Z", "content": "Racing Queensland stewards have opened an inquiry into apprentice Baylee Nothdurft’s tactics on the Tony Gollan-trained Vega One at the Sunshine Coast on Saturday.\r\nNothdurft rode Vega One into fourth place, a length from the winner and stablemate Just Orm in… [+835 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "The Patriots tried to draft a Tom Brady replacement. They failed, and now have nobody - Fox Sports", "description": "The Patriots didn’t find a replacement for Tom Brady in the draft, if that was even possible.", "url": "https://www.foxsports.com.au/nfl/nfl-news-tom-brady-replacement-nfl-draft-new-england-patriots-qb-situation-jarrett-stidham-brian-hoyer/news-story/bbaf77594b6256668faa1b68788268ac", "urlToImage": null, "publishedAt": "2020-04-26T06:53:00Z", "content": "But they did address almost every other one of their needs.\r\nNew England entered the draft with 12 picks and after making several trades over three days wound up selecting 10 players.\r\nPatriots coach Bill Belichick acknowledged the team made an attempt to add… [+4127 chars]"}, {"source": {"id": null, "name": "Afl.com.au"}, "author": "Anna Harrington, AAP", "title": "News Viewed From finals or bust to 'Ken will be coaching next year' - AFL", "description": "Power chairman David Koch has seemingly guaranteed Ken Hinkley his coaching position for 2021", "url": "https://www.afl.com.au/news/392119/from-finals-or-bust-to-ken-will-be-coaching-next-year-", "urlToImage": null, "publishedAt": "2020-04-26T06:35:00Z", "content": "PORT Adelaide chairman David Koch is confident Ken Hinkley will still be at the club in 2021.\r\nLast year, Hinkley confirmed there was a clause in his contract essentially requiring the Power to make finals in 2020 to trigger an extension.\r\nPRESSURE GAUGE Whic… [+2117 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Sam Phillips", "title": "Storm resigned to Sydney move after cross-border pre-season camp - The Age", "description": "The Storm will base themselves in a city on the edge of the NSW and Victoria border in preparation for the resumption of the season.", "url": "https://www.smh.com.au/sport/nrl/storm-resigned-to-sydney-move-after-cross-border-preseason-camp-20200426-p54ncg.html", "urlToImage": null, "publishedAt": "2020-04-26T06:23:32Z", "content": "They will then report back to the team's NSW base on Sunday night.\r\n\"We will probably have to top up the gym with a few things and there will certainly be a few alterations. But its nothing that cant be done, put it that way,\" Storm football director Frank Po… [+1563 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Re-start your engines! Red Bull boss says F1 has a return date and race penciled in - Fox Sports", "description": "Christian Horner says Formula One has pencilled in the date for the start of the season – starting at the Red Bull Ring in Austria.", "url": "https://www.foxsports.com.au/motorsport/formula-one/formula-one-news-restart-date-race-locations-christian-horner-red-bull-ring/news-story/50dcd63e878f96b1bdc0bc46b5440f24", "urlToImage": null, "publishedAt": "2020-04-26T06:06:00Z", "content": "The Aston Martin Red Bull Racing boss believes that announcing a proposed date of July 5 could act as a shot in the arm for the sport.\r\nMcLaughlin fumes over 'BS'\r\n2:54\r\nF1 chiefs have been desperate to get the season underway after they cancelled the Austral… [+1958 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "AAP", "title": "Melbourne Cup winner Vow And Declare heading for the paddock - Racenet", "description": "Melbourne Cup winner Vow And Declare is heading for a break after disappointing trainer Danny O'Brien at Flemington.", "url": "https://www.racenet.com.au/news/vow-and-declare-gets-a-break-after-flemington-disappointment-20200426", "urlToImage": null, "publishedAt": "2020-04-26T05:59:38Z", "content": "Melbourne Cup winner Vow And Declare is heading for a break after disappointing trainer Danny O'Brien at Flemington.\r\nVow And Declare finished fifth in Saturday's William Newton VC Handicap (2600m), a little over four lengths from the winner Haky.\r\nO'Brien di… [+1511 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Peter Sterling backs Origin foes to be game’s next two Immortals - Fox Sports", "description": "<b>Tune into our new show Fox League Live on Channel 502 Monday to Friday at 6.30pm and on Saturday at 3pm and Sunday at 5pm.</b>", "url": "https://www.foxsports.com.au/nrl/nrl-premiership/nrl-2020-next-immortals-peter-sterling-brad-fittler-darren-lockyer-billy-slater-cameron-smith-rugby-league/news-story/03bc1a831b1aa656a481325709a2a128", "urlToImage": null, "publishedAt": "2020-04-26T04:46:00Z", "content": "Peter Sterling has called on Brad Fittler and Darren Lockyer to be inducted as the games next two Immortals.\r\nThe next Immortal induction ceremony is scheduled for 2022 and Sterling believes Fittler has just as much right to join the exclusive club of 13 as L… [+3408 chars]"}, {"source": {"id": null, "name": "Skynews.com.au"}, "author": null, "title": "Health Minister 'disapointed' at crowds descending on Sydney beaches - Sky News Australia", "description": "Health Minister Brad Hazzard says he was “disappointed” to see beachgoers ignore the “very strong message about social distancing”. \n\nRandwick Council re-opened several eastern suburbs beaches from 6 to 9am on Saturday, allowing locals to swim, surf and run a…", "url": "https://www.skynews.com.au/details/_6151991549001", "urlToImage": null, "publishedAt": "2020-04-26T03:27:56Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Australian Associated Press", "title": "'Appalled': Footballer slammed for lockdown breach with lap dancers - Yahoo News Australia", "description": "A Premier League star is in hot water for breaching lockdown rules by throwing a wild house party with lap dancers.", "url": "https://au.sports.yahoo.com/football-moise-kean-lockdown-party-lap-dancers-premier-league-club-everton-slam-player-031755213.html", "urlToImage": null, "publishedAt": "2020-04-26T03:17:00Z", "content": "Everton have labelled Moise Kean's actions \"unacceptable\" after he flouted coronavirus lockdown restrictions.\r\nThe Premier League club and football community have been left fuming after the player filmed himself in a wild house party with friends in what is a… [+4904 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "Stephen Brassel", "title": "The Armchair Punter analyses Rosehill from Hawkesbury Cup day - Racenet", "description": "We were back onto a good surface at Rosehill for the relocated Hawkesbury Cup meeting and every horse had their chance on  track which played fair to most although there were a few hard luck stories including an awful watch in the feature race of the day.", "url": "https://www.racenet.com.au/news/the-armchair-punter-dissects-the-hawkesbury-cup-meeting-from-rosehill-20200426", "urlToImage": null, "publishedAt": "2020-04-26T03:04:05Z", "content": "We were back onto a good surface at Rosehill for the relocated Hawkesbury Cup meeting and every horse had their chance on  track which played fair to most although there were a few hard luck stories including an awful watch in the feature race of the day.\r\nST… [+6001 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Anzac Day: 2019 - Collingwood Football Club", "description": "The pies never relinquished the lead against a gallant Essendon in 2019, a true battle for the ages.", "url": "https://www.youtube.com/watch?v=9gi42H9TPB4", "urlToImage": null, "publishedAt": "2020-04-26T03:00:03Z", "content": null}, {"source": {"id": null, "name": "Afl.com.au"}, "author": "Shayne Hope, AAP", "title": "'We're prepared to do anything': Tigers happy for interstate hub - Australian Football League", "description": "Richmond coach Damien Hardwick will do anything to get the season back up and running", "url": "https://www.afl.com.au/news/392108/-we-re-prepared-to-do-anything-tigers-happy-for-interstate-hub", "urlToImage": null, "publishedAt": "2020-04-26T02:55:00Z", "content": "DAMIEN Hardwick would be prepared to take Richmond to an interstate hub in order to reboot the AFL season.\r\nThe dual premiership coach admits it has been difficult to navigate training schedules without an official end date for the competition's coronavirus s… [+2505 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Jon Boon", "title": "Mike Tyson’s wild love life, caught ex-wife having sex with Brad Pitt - NEWS.com.au", "description": "Mike Tyson’s love life has been a wild ride", "url": "https://www.news.com.au/sport/sports-life/mike-tysons-love-life-has-been-a-wild-ride/news-story/7add0306c1e649a057e2d3147384d944", "urlToImage": null, "publishedAt": "2020-04-26T02:25:13Z", "content": "Boxing legend Mike Tyson is the most settled hes ever been.And that could be because of the influence of his new wife, Lakiha Spicer, The Sun reports.\r\nSpicer is the latest player in Tyson’s love life but before they walked down the aisle, he was wed twice.\r\n… [+3636 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "Cameron Happ", "title": "Cameron Happ dissects Saturdays Flemington Meeting - Racenet", "description": "The VRC might need to consider renaming the feature race the Gai Waterhouse St Leger with the champion trainer bringing up a hat-trick of wins. Honours were mostly shared throughout the day with Damien Oliver the only one to bring up a double.", "url": "https://www.racenet.com.au/news/cameron-happ-dissects-saturday-s-vrc-st-leger-meeting-from-flemington-20200426", "urlToImage": null, "publishedAt": "2020-04-26T01:49:05Z", "content": "The VRC might need to consider renaming the feature race the Gai Waterhouse St Leger with the champion trainer bringing up a hat-trick of wins. Honours were mostly shared throughout the day with Damien Oliver the only one to bring up a double.\r\nClearly the in… [+7266 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "AAP", "title": "Alysha Collett and Patrick Moloney return to Australia from Singapore - Racenet", "description": "Alysha Collett and Patrick Moloney are the latest ex-pat jockeys to leave Singapore with heightened restrictions introduced because of the COVID-19 pandemic.", "url": "https://www.racenet.com.au/news/two-more-ex-pat-jockeys-leave-singapore-for-australia-20200426", "urlToImage": null, "publishedAt": "2020-04-26T01:40:30Z", "content": "Alysha Collett and Patrick Moloney are the latest ex-pat jockeys to leave Singapore with heightened restrictions introduced because of the COVID-19 pandemic.\r\nMoloney is returning to Victoria while New Zealander Collett will head to Sydney where she rode with… [+2194 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "‘I’m not trying to dramatise it’: Paul Kent and RLPA boss in fiery clash over May 28 restart - Fox Sports", "description": "<b>Tune into our new show Fox League Live on Channel 502 Monday to Friday at 6.30pm and on Saturday at 3pm and Sunday at 5pm.</b>", "url": "https://www.foxsports.com.au/nrl/nrl-premiership/nrl-2020-paul-kent-vs-rlpa-boss-clint-newton-may-28-restart-peter-vlandys-rugby-league/news-story/b857b10950f54478a23f722501a9e88f", "urlToImage": null, "publishedAt": "2020-04-26T00:10:00Z", "content": "Paul Kent has been involved in a fiery clash with RLPA boss Clint Newton over his comments that the NRLs May 28 restart was premature.\r\nKent took issue with the fact that Newton released a statement mid-week saying the May 28 restart was not set in stone, des… [+4015 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Mariners no longer a sinking ship, says Stajcic - SBS - The World Game", "description": "Central Coast coach Alen Stajcic is convinced he has steadied a sinking ship with the battling A-League club now destined for smoother waters.", "url": "https://theworldgame.sbs.com.au/mariners-no-longer-a-sinking-ship-says-stajcic", "urlToImage": null, "publishedAt": "2020-04-25T23:45:00Z", "content": "Prior to the suspension of the competition in late March, the Mariners were on course to pick up a third wooden spoon in four seasons after losing 10 in a row.\r\nBut prior to that slump there had been distinct signs of a revival for the Gosford-based club, whi… [+2169 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Goal", "title": "Footballer, 23, placed in 'artificial coma' after catching virus - Yahoo News Australia", "description": "Harrowing details have emerged of the 23-year-old French football player's virus ordeal.", "url": "https://au.sports.yahoo.com/football-junior-sambia-artificial-coma-montpellier-player-tested-positive-covid-19-234234394.html", "urlToImage": null, "publishedAt": "2020-04-25T23:42:00Z", "content": "Montpellier midfielder Junior Sambia is out of a coma and breathing on his own after being diagnosed with Covid-19, according to his agent.\r\nThe 23-year-old was admitted to hospital on Tuesday after suffering from severe gastroenteritis, which was followed by… [+4076 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "Greg Polson", "title": "Horse Racing Tips & Best Bets for Tamworth Sunday April 26 - Racenet", "description": "He won’t be at the track after breaking his leg in a trackwork incident on Saturday however trainer Cody Morgan looks set to get a smile back by replicating his 2019 achievement of winning the Country Championship Qualifier and Tamworth Cup with the same hors…", "url": "https://www.racenet.com.au/news/top-bets-from-greg-polson-for-tamworth-sunday-20200426", "urlToImage": null, "publishedAt": "2020-04-25T23:29:39Z", "content": "He won’t be at the track after breaking his leg in a trackwork incident on Saturday however trainer Cody Morgan looks set to get a smile back by replicating his 2019 achievement of winning the Country Championship Qualifier and Tamworth Cup with the same hors… [+2324 chars]"}, {"source": {"id": null, "name": "Espn.co.uk"}, "author": "Kevin Seifert", "title": "2020 NFL draft biggest takeaways - Surprises, lingering questions and lots of dogs - ESPN.co.uk", "description": "The Packers drafted a QB, and the Patriots did not. What were the other most notable events from the NFL's virtual draft?", "url": "https://www.espn.co.uk/nfl/draft2020/story/_/id/29097982/2020-nfl-draft-biggest-takeaways-surprises-lingering-questions-lots-dogs", "urlToImage": null, "publishedAt": "2020-04-25T23:26:31Z", "content": "The NFL's draft industrial complex took a hit this weekend, and I mean that in the most optimistic way possible. The 2020 virtual NFL draft revealed a level of humanity, intimacy and spartan aesthetics that was not only pitch-perfect amid a national quarantin… [+14616 chars]"}, {"source": {"id": null, "name": "Espn.com.au"}, "author": "Adrian Wojnarowski", "title": "NBA reopening team practice facilities Friday where local restrictions eased, sources say - ESPN Australia", "description": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.", "url": "https://www.espn.com.au/nba/story/_/id/29099194/nba-reopening-team-practice-facilities-friday-where-local-restrictions-eased-sources-say", "urlToImage": null, "publishedAt": "2020-04-25T23:03:22Z", "content": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.\r\nPlayers can return to team facilities in states such as … [+2131 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Makur Maker enters NBA draft, Australia basketball teen, draft predictions 2020 - NEWS.com.au", "description": "Is this Australia’s next NBA star? Giant teen Makur Maker enters draft", "url": "https://www.foxsports.com.au/basketball/nba/is-this-australias-next-nba-star-giant-teen-makur-maker-enters-draft/news-story/6f1aa24e10d52d44f1589fd84c031754", "urlToImage": null, "publishedAt": "2020-04-25T22:30:25Z", "content": "Giant-sized Australian teenager Makur Maker will enter the NBA Draft.The athletic 19-year-old stands 211cm tall and is aiming to follow in the footsteps of Australian cousin Thon Maker, who was drafted 10th by the Milwaukee Bucks in 2016 and now plays for the… [+1978 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "At home, not far away: Former president calls for Geelong home AFL Grand Final - Fox Sports", "description": "GMHBA Stadium should host this year’s AFL Grand Final should Geelong qualify and crowds remain locked out, according to former Cats president Frank Costa.", "url": "https://www.foxsports.com.au/afl/afl-2020-afl-geelong-cats-home-grand-final-geelong-cats-kardinia-park-frank-costa/news-story/6e7e655139fdb467faff395baa48b27c", "urlToImage": null, "publishedAt": "2020-04-25T21:31:32Z", "content": "Geelong has long campaigned for home finals to be played at its home venue, with coach Chris Scott claiming the current system, which aims to hold finals at the biggest stadiums available, is Wrong... there can be no doubting that its wrong.\r\nCosta, who was p… [+1413 chars]"}, {"source": {"id": null, "name": "Speedcafe.com"}, "author": null, "title": "GALLERY: Ambrose's motorsport career - Speedcafe", "description": "A Gallery of Marcos Ambrose's career to date following his announcement he will return to Australia after nine seasons in NASCAR", "url": "https://www.speedcafe.com/2020/04/26/gallery-marcos-ambrose/", "urlToImage": null, "publishedAt": "2020-04-25T21:00:00Z", "content": "Comments require approval before being published. Speedcafe.com reserves the right to deny any post that is abusive or offtopic. \r\nUsers are encouraged to flag/report comments which should be removed.\r\nSome comments may require approval before being published… [+77 chars]"}, {"source": {"id": null, "name": "Asiarugby.com"}, "author": "Asia Rugby", "title": "World Rugby elections, Update on Asia Rugby throws the weight of its continent behind challenger Agustín Pichot - asiarugby.com", "description": "World Rugby elections, Asia Rugby throws the weight of its continent behind challenger Agustín Pichot to become the next Chairman of World Rugby.", "url": "https://www.asiarugby.com/2020/04/25/world-rugby-elections-2/", "urlToImage": null, "publishedAt": "2020-04-25T13:55:03Z", "content": "Asia Rugby throws the weight of its continent behind challenger Agustín Pichot to become the next Chairman of World Rugby.\r\nWorld Rugby elections,  Asia Rugby President, Mr. Qais Abdulla Al Dhalai announced that today 25th April 2020 at the close of voting to… [+1771 chars]"}, {"source": {"id": null, "name": "Heraldsun.com.au"}, "author": "Leo Schlink", "title": "Melbourne Cup winner Vow And Declare fails to flatter with trainer Danny O’Brien left scratching head - Herald Sun", "description": "Danny O’Brien will almost certainly abandon Vow And Declare’s autumn and winter program after the Melbourne Cup winner was upstaged by Haky in a stunning upset in the William Newton Handicap (2600m).", "url": "https://www.heraldsun.com.au/sport/superracing/melbourne-cup-winner-vow-and-declare-fails-to-flatter-with-trainer-danny-obrien-left-scratching-head/news-story/f60975224d2abd3adcec88482cc0e569", "urlToImage": null, "publishedAt": "2020-04-25T10:10:31Z", "content": "Danny OBrien will almost certainly abandon Vow And Declares autumn and winter program after the Melbourne Cup winner was upstaged by Haky in a stunning upset in the William Newton Handicap (2600m).\r\nA $1.90 favourite, Vow And Declare finished fifth, beaten fo… [+12286 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Anna Harrington", "title": "Hawthorn coach Alastair Clarkson reveals ideas for AFL's radical post-coronavirus return - Wide World of Sports", "description": "'Some significant things to do for the game'", "url": "https://wwos.nine.com.au/afl/coaches-footy-bosses-to-guide-afl-return/f8d7d144-0d8f-4809-b13a-5f2be24d89da", "urlToImage": null, "publishedAt": "2020-04-25T10:09:11Z", "content": "Hawthorn coach Alastair Clarkson is among a collective of AFL coaches and football managers who will navigate the league through its return to play, and assess the future of football departments and talent pathways.\r\nThe soft cap for football departments is s… [+2337 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "Brad Waters", "title": "Dalasan wins 2020 Chairman's Stakes - Racenet", "description": "Dalasan sounded a warning to the interstate raiders targeting the South Australian Derby with his win in Saturday’s Group III Chairman’s Stakes (2050m) at Morphettville.", "url": "https://www.racenet.com.au/news/dalasan-keeps-up-sa-derby-chase-in-chairman-s-stakes-20200425", "urlToImage": null, "publishedAt": "2020-04-25T08:00:02Z", "content": "Dalasan sounded a warning to the interstate raiders targeting the South Australian Derby with his win in Saturday’s Group III Chairman’s Stakes (2050m) at Morphettville.\r\nDalasan is unbeaten in South Australia and kept that record intact with another strong e… [+1727 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "NBA 2020: Timberwolves roasted for D’Angelo Russell injection post - NEWS.com.au", "description": "NBA 2020: Timberwolves roasted for D’Angelo Russell injection post", "url": "https://www.news.com.au/sport/american-sports/nba/nba-2020-timberwolves-roasted-for-dangelo-russell-injection-post/news-story/337d297e0c7d3fa08fe0590aa185d600", "urlToImage": null, "publishedAt": "2020-04-25T06:23:00Z", "content": "The Minnesota Timberwolves have delivered a genuine contender for dumbest tweet of the week after a social media post on Saturday morning left commentators scratching their heads. The franchise has been under the pump since a cheeky dig at US President Donald… [+2444 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Jake Niall", "title": "Last man standing: Why Gillon McLachlan must stay in the job - Sydney Morning Herald", "description": "AFL boss Gillon McLachlan will be remembered largely for the game he bequeaths to his successor, whenever that happens.", "url": "https://www.theage.com.au/sport/afl/afl-and-coronavirus-why-gillon-mclachlan-must-stay-in-the-job-20200425-p54n6t.html", "urlToImage": null, "publishedAt": "2020-04-25T05:49:35Z", "content": "There was speculation about a potential move to run Crown Casino, as he was sounded out about other jobs, and open talk within the game about Brendon Gale, Richmond's chief executive, as his prospective successor.\r\nToday, any thoughts McLachlan harboured abou… [+4971 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "‘Disgusted, insulted’: ‘Obnoxious’ $210m backflip triggers wild NFL trade reality - Fox Sports", "description": "Aaron Rodgers can’t be happy.", "url": "https://www.foxsports.com.au/nfl/nfl-draft-2020-aaron-rodgers-jordan-love-green-bay-packers-analysis-reaction/news-story/3373f1c4fa71447884681a43cfc4a165", "urlToImage": null, "publishedAt": "2020-04-25T04:41:00Z", "content": "The superstar quarterback, who has four years remaining on his contract in Green Bay, watched on during the first round of the 2020 NFL Draft as the organisation gleefully snapped up his potential successor.\r\nA team that couldnt stop the run in the NFC Champi… [+4742 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "Graeme Watson dead: Australian Cricket great remembered by Ian Chappell - NEWS.com.au", "description": "Graeme Watson dead: Australian Cricket great remembered by Ian Chappell", "url": "https://www.news.com.au/sport/cricket/graeme-watson-dead-australian-cricket-great-remembered-by-ian-chappell/news-story/5155ebf8f7fab7983788b9a06982cefa", "urlToImage": null, "publishedAt": "2020-04-25T04:16:59Z", "content": "Aussie test cricket great Graeme Watson has died after a long battle with cancer. The all-rounder was a trailblazer in Australian cricket and is in the elite group of Aussie sporting legends to have balanced first-class football and cricket careers at the sam… [+3280 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Neil Breen", "title": "Would Michael Jordan have survived scrutiny of the social media age? - The Age", "description": "Jordan was arguably the biggest sportsman on the planet in the 1990s. But how would he be remembered if he was around today?", "url": "https://www.smh.com.au/sport/basketball/would-michael-jordan-have-survived-scrutiny-of-the-social-media-age-20200424-p54mxn.html", "urlToImage": null, "publishedAt": "2020-04-25T03:34:34Z", "content": "For me, though, the hidden highlight was watching them all go about their business in the pre-social media world, when they could still operate with an air of mystery.\r\nJordan's ascent may have looked very different in the age of social media.Credit:AP\r\nSteve… [+3893 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Andrew Reid", "title": "'Needs more followers': Roger Federer at centre of stunning conspiracy theory - Yahoo Sport Australia", "description": "Roger Federer's motivations have come into question around a controversial new proposal.", "url": "https://au.sports.yahoo.com/tennis-roger-federer-merge-atp-wta-swiss-criticised-over-controversial-idea-010643139.html", "urlToImage": null, "publishedAt": "2020-04-25T01:06:00Z", "content": "Roger Federer has been accused of trying to win more followers on social media as the tennis world continues to discuss his controversial merger proposal.\r\nFederer sparked somewhat of a frenzy on Thursday when he suggested that the mens and womens tours shoul… [+3348 chars]"}, {"source": {"id": null, "name": "Sen.com.au"}, "author": null, "title": "Report: ICC considering “legalised ball-tampering” - SEN", "description": "It comes in the wake of the COVID-19 pandemic.", "url": "https://www.sen.com.au/news/2020/04/25/report-icc-considering-legalised-ball-tampering/", "urlToImage": null, "publishedAt": "2020-04-25T00:50:38Z", "content": "The ICC are considering allowing legalised ball-tampering once cricket resumes, according to ESPNcricinfo's Daniel Brettig. \r\nUnder the supervision of umpires, the rule change would allow teams to use artificial substances to shine the ball in order to help g… [+560 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "NFL Draft: Dog steals the show, New England Patriots, every pick, D’Andre Swift’s dad - NEWS.com.au", "description": "NFL Draft, second round: Patriots dog and jacked dad steal the show", "url": "https://www.news.com.au/sport/american-sports/nfl/nfl-draft-second-round-patriots-dog-and-jacked-dad-steal-the-show/news-story/4af53e69050551a9827641b6ed09ef30", "urlToImage": null, "publishedAt": "2020-04-25T00:41:45Z", "content": "The second round of the NFL Draft is underway, but it wasnt a selection or even one of the coaches fancy houses that sent social media into a spin.Instead it was the dog of New England Patriots coach Bill Belichick who stole the show.\r\nAfter drafting safety K… [+1663 chars]"}, {"source": {"id": null, "name": "Nrl.com"}, "author": "Ben Coady", "title": "How good were NRL coaches at playing rugby league - NRL.COM", "description": "How good were the current NRL coaches at playing the game?", "url": "https://www.nrl.com/news/2020/04/25/not-all-were-stars-but-nrl-coaches-make-dream-team/", "urlToImage": null, "publishedAt": "2020-04-24T22:01:22Z", "content": "What would you know? Youve never played the game.\r\nEvery sports journalist has heard that comment at least once during their career (unless of course they did play the game.)\r\nSo how good were the current crop of NRL coaches at playing the game? Pretty damn g… [+17450 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "‘Don’t know how he came out alive’: Brutal ‘Jordan Rules’ turned MJ into ‘screaming devil’ - Fox Sports", "description": "If you can’t beat them, beat them up.", "url": "https://www.foxsports.com.au/basketball/nba/the-last-dance-episode-3-episode-4-michael-jordan-chicago-bulls-vs-detroit-pistons/news-story/a543e00a926c79110ea7b71fcdf48091", "urlToImage": null, "publishedAt": "2020-04-23T07:06:00Z", "content": "It may be a bit simplistic, but that was essentially the Detroit Pistons approach back in the late 80s and early 90s.\r\nAnd it worked.\r\nThe Bad Boys reached the NBA Finals three times winning it all twice and took down some historically great teams in the proc… [+4842 chars]"}]}