{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Australian Open finalist Dominic Thiem fumes over plan to help out ‘unprofessional’ lower-ranked players - Fox Sports", "description": "Australian Open runner-up Dominic Thiem has delivered a scathing attack on lower-ranked tennis players, saying he won’t donate a small amount to help them because they’re “unprofessional”.", "url": "https://www.foxsports.com.au/tennis/tennis-news-dominic-thiem-attacks-lowerranked-players-calls-them-unprofessional-wont-donate-to-struggling-atp-pros/news-story/370b26183e2853d03725084511029c2a", "urlToImage": null, "publishedAt": "2020-04-26T12:45:00Z", "content": "A proposal by Novak Djokovic, in his role as president of the ATP player council, would see top players donate to those who dont rake in the big bucks on tour.\r\nA sliding scale would see top five players donate $US30,000 each, down to players ranked 51 to 100… [+1686 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Socceroos star Adam Taggart is back playing for his club — and he’s already scoring goals - Fox Sports", "description": "Last season’s K-League top scorer Adam Taggart has wasted no time finding the back of the net as his team Suwon Bluewings prepares for the new campaign to get underway.", "url": "https://www.foxsports.com.au/football/football-news-adam-taggart-socceroos-news-kleague-returning-after-coronavirus-soccer-in-south-korea/news-story/22b2aa69f5c32c7feb21965bec669928", "urlToImage": null, "publishedAt": "2020-04-26T11:58:00Z", "content": "While most of his Socceroos teammates kick their heels with leagues suspended across the globe, Taggart took to the field on Saturday as Bluewings faced Seoul E-Land in a pre-season friendly.\r\nThe Australian notched the only goal of the game in the 10th minut… [+1789 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": null, "title": "Monday Buzz: State of Origin switch huge boost for NRL - Daily Telegraph", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.dailytelegraph.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-26T10:00:00Z", "content": null}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Nic Savage", "title": "NRL news 2020: players and staff to undergo strict safety protocols ahead of return - NEWS.com.au", "description": "NRL players and staff to undergo strict biosecurity protocols ahead of season’s return", "url": "https://www.news.com.au/sport/nrl/nrl-players-and-staff-to-undergo-strict-biosecurity-protocols-ahead-of-seasons-return/news-story/d595ed63c22f104691365371147f037f", "urlToImage": null, "publishedAt": "2020-04-26T09:42:20Z", "content": "NRL players and staff will be banned from exercising in public places and catching Ubers under strict restrictions to be enforced when training resumes next month.Despite some reluctance from Channel 9, the NRL’s broadcast partners agreed to a May 28th restar… [+3034 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Chris Barrett", "title": "'Long way to go': Top doctor's caution on summer of cricket - The Age", "description": "Cricket Australia has $300 million resting on the series between Australia and India going ahead but will need the approval of the federal government for Virat Kohli's team to fly here.", "url": "https://www.smh.com.au/sport/cricket/long-way-to-go-top-doctor-s-caution-on-summer-of-cricket-20200426-p54ncy.html", "urlToImage": null, "publishedAt": "2020-04-26T09:42:12Z", "content": "CA is drawing up biosecurity plans for how the series could go ahead, with an Adelaide Oval quarantine hub among the options on the table, while the federal government has also held talks with organisers of the Twenty20 World Cup, scheduled to be played in Oc… [+3144 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mini-Match: Essendon v Collingwood, Anzac Day 2009 | AFL - AFL", "description": "Extended highlights of an epic between the Bombers and Magpies on Anzac Day in 2009 at the MCG. Subscribe now and get more footy in your feed. Follow us on I...", "url": "https://www.youtube.com/watch?v=n2IptKac5-s", "urlToImage": null, "publishedAt": "2020-04-26T09:30:11Z", "content": "Extended highlights of an epic between the Bombers and Magpies on Anzac Day in 2009 at the MCG.\r\nSubscribe now and get more footy in your feed.\r\nFollow us on Instagram: http://www.instagram.com/aflLike our Facebook page: http://www.facebook.com/AFLFollow us o… [+141 chars]"}, {"source": {"id": null, "name": "Heraldsun.com.au"}, "author": null, "title": "Gold Coast in box seat to be one of three hubs to resume AFL season - Herald Sun", "description": "Subscribe to the Herald Sun to get unrestricted digital access, home paper delivery, Foxsports.com.au subscription,  Apps for iPad and Android and much more...", "url": "https://www.heraldsun.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-26T09:17:00Z", "content": null}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Peter Ryan", "title": "'I'm not sure everyone would cope': AFL seeks approval for hub plan - The Age", "description": "The AFLPA remains open to the idea of using quarantine hubs to restart the season, but are determined to ensure that any demands made on players and their families are reasonable.", "url": "https://www.theage.com.au/sport/afl/i-m-not-sure-everyone-would-cope-afl-seeks-approval-for-hub-plan-20200425-p54n7u.html", "urlToImage": null, "publishedAt": "2020-04-26T08:59:12Z", "content": "Although the 24-year-old recruit is comfortable about moving into hubs to resume the season he said setting them up properly was likely to be complicated.\r\n\"It's going to be hard for players and staff to go from the current climate we are in now where you are… [+1536 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "James McKern", "title": "The Last Dance director talks all things Michael Jordan and the Chicago Bulls - Fox Sports", "description": "The Last Dance director talks all things Michael Jordan and the Chicago Bulls", "url": "https://www.news.com.au/sport/american-sports/nba/the-last-dance-director-talks-all-things-michael-jordan-and-the-chicago-bulls/news-story/80884469d879a23fcd07594a510914b2", "urlToImage": null, "publishedAt": "2020-04-26T08:13:00Z", "content": "The world is hooked on Michael Jordan and the Chicago Bulls. No, we haven’t entered a time warp, but the Bulls have become the talk of sports fans everywhere thanks to ESPN’s 10-part docu-series on their final championship run in 1997/98.\r\nOver 10,000 hours o… [+6345 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "'Administrators should look at cutting administration costs', says Postecoglou - The World Game", "description": "Ange Postecoglou has spoken about the challenges facing the A-League and his own as coach of defending J.League champions Yokohama F. Marinos during COVID-19 lockdown.", "url": "https://theworldgame.sbs.com.au/administrators-should-look-at-cutting-administration-costs-says-postecoglou", "urlToImage": null, "publishedAt": "2020-04-26T08:07:00Z", "content": "Former Australia coach Postecoglou spoke to ABC's Offsiders from his home in Japan about the troubles facing the A-League and it potentially losing momentum in the Australian sporting landscape.\r\nAdministrators talking about cutting costs thats nothing new,\" … [+2118 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Shayne Hope", "title": "Essendon coach John Worsfold open to coaching third AFL side after completion of handover - Wide World of Sports", "description": "'Love to still contribute and add some value'", "url": "https://wwos.nine.com.au/afl/worsfold-open-to-new-afl-position-in-2021/20fc2c94-5a02-4978-b363-8ed586a21dce", "urlToImage": null, "publishedAt": "2020-04-26T07:09:55Z", "content": "John Worsfold will welcome approaches from rival AFL clubs after he completes a handover of Essendon's coaching reins to Ben Rutten this year.\r\nThe 51-year-old Worsfold has previously discussed possible new roles at the Bombers in 2021 and beyond with chief e… [+2094 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "Brad Waters", "title": "Inquiry in Vega One ride at Sunshine Coast - Racenet", "description": "Racing Queensland stewards have opened an inquiry into apprentice Baylee Nothdurft’s tactics on the Tony Gollan-trained Vega One at the Sunshine Coast on Saturday.", "url": "https://www.racenet.com.au/news/inquiry-in-vega-one-ride-at-sunshine-coast-20200426", "urlToImage": null, "publishedAt": "2020-04-26T06:56:15Z", "content": "Racing Queensland stewards have opened an inquiry into apprentice Baylee Nothdurft’s tactics on the Tony Gollan-trained Vega One at the Sunshine Coast on Saturday.\r\nNothdurft rode Vega One into fourth place, a length from the winner and stablemate Just Orm in… [+835 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "The Patriots tried to draft a Tom Brady replacement. They failed, and now have nobody - Fox Sports", "description": "The Patriots didn’t find a replacement for Tom Brady in the draft, if that was even possible.", "url": "https://www.foxsports.com.au/nfl/nfl-news-tom-brady-replacement-nfl-draft-new-england-patriots-qb-situation-jarrett-stidham-brian-hoyer/news-story/bbaf77594b6256668faa1b68788268ac", "urlToImage": null, "publishedAt": "2020-04-26T06:53:00Z", "content": "But they did address almost every other one of their needs.\r\nNew England entered the draft with 12 picks and after making several trades over three days wound up selecting 10 players.\r\nPatriots coach Bill Belichick acknowledged the team made an attempt to add… [+4127 chars]"}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "PerthNow", "title": "COVID-19 isolation: Celebs and WAGS perfect beauty routines and share outfit inspo while stuck at home - PerthNow", "description": "From perfecting beauty routines to baking and daily outfit inspiration, see what some of Australia’s best known celebs and WAG influencers are getting up to in isolation.", "url": "https://www.perthnow.com.au/news/coronavirus/covid-19-isolation-wags-perfect-beauty-routines-and-share-outfit-inspo-while-stuck-at-home-ng-b881529108z", "urlToImage": null, "publishedAt": "2020-04-26T06:42:35Z", "content": "They are the glamorous women who have graced the red carpets on the arms of footys elite, but Australias WAGs are making the adjustment to life in isolation.\r\nFrom perfecting beauty routines to baking and daily outfit inspiration, see what these influencers a… [+6702 chars]"}, {"source": {"id": null, "name": "Afl.com.au"}, "author": "Anna Harrington, AAP", "title": "From finals or bust to 'Ken will be coaching next year' - Australian Football League", "description": "Power chairman David Koch has seemingly guaranteed Ken Hinkley his coaching position for 2021", "url": "https://www.afl.com.au/news/392119/from-finals-or-bust-to-ken-will-be-coaching-next-year-", "urlToImage": null, "publishedAt": "2020-04-26T06:35:00Z", "content": "PORT Adelaide chairman David Koch is confident Ken Hinkley will still be at the club in 2021.\r\nLast year, Hinkley confirmed there was a clause in his contract essentially requiring the Power to make finals in 2020 to trigger an extension.\r\nPRESSURE GAUGE Whic… [+2117 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "AAP", "title": "Melbourne Cup winner Vow And Declare heading for the paddock - Racenet", "description": "Melbourne Cup winner Vow And Declare is heading for a break after disappointing trainer Danny O'Brien at Flemington.", "url": "https://www.racenet.com.au/news/vow-and-declare-gets-a-break-after-flemington-disappointment-20200426", "urlToImage": null, "publishedAt": "2020-04-26T05:59:38Z", "content": "Melbourne Cup winner Vow And Declare is heading for a break after disappointing trainer Danny O'Brien at Flemington.\r\nVow And Declare finished fifth in Saturday's William Newton VC Handicap (2600m), a little over four lengths from the winner Haky.\r\nO'Brien di… [+1511 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "NFL Draft report card: Cowboys’ gold star, nightmare continues - Fox Sports", "description": "Teams keep secret their NFL draft boards, but we share a report card.", "url": "https://www.foxsports.com.au/nfl/nfl-draft-2020-report-card-dallas-cowboys-top-list-houston-texans-have-a-nightmare/news-story/ec2f3ac798ad2456244b05c66f488a3c", "urlToImage": null, "publishedAt": "2020-04-26T05:53:00Z", "content": "So, which teams handled the unique scouting and technological challenges caused by coronavirus stay-at-home restrictions better than the rest?\r\nHere are first-look grades for all 32 teams, with a curve instituted for the first-, second- and third-round picks … [+11394 chars]"}, {"source": {"id": null, "name": "Heraldsun.com.au"}, "author": null, "title": "Sam Newman says campaign to play golf isn’t out of self interest — he can’t play due to injury - Herald Sun", "description": "Subscribe to the Herald Sun to get unrestricted digital access, home paper delivery, Foxsports.com.au subscription,  Apps for iPad and Android and much more...", "url": "https://www.heraldsun.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-26T05:49:00Z", "content": null}, {"source": {"id": null, "name": "Couriermail.com.au"}, "author": null, "title": "Injury, desire to be with family brings curtain down on career of former Wallaby Berrick Barnes - Courier Mail", "description": "Subscribe to The Courier-Mail to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.couriermail.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-26T05:40:00Z", "content": null}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "NRL 2020, news: Sandor Earl slams misinformation over return, Melbourne Storm - NEWS.com.au", "description": "Melbourne Storm’s Sandor Earl slams ‘misguided’ media over NRL return", "url": "https://www.news.com.au/sport/nrl/melbourne-storms-sandor-earl-slams-misguided-media-over-nrl-return/news-story/b4fef2e7f58d4637498fbeb4360c58a0", "urlToImage": null, "publishedAt": "2020-04-26T04:59:21Z", "content": "Questions have been raised since the NRL announced a return date for the 2020 season, but some arent happy with the proposition with a negative light being shone on the date.Despite the NRL pushing ahead, people believe rushing back into sport isn’t a good si… [+3632 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Peter Sterling backs Origin foes to be game’s next two Immortals - Fox Sports", "description": "<b>Tune into our new show Fox League Live on Channel 502 Monday to Friday at 6.30pm and on Saturday at 3pm and Sunday at 5pm.</b>", "url": "https://www.foxsports.com.au/nrl/nrl-premiership/nrl-2020-next-immortals-peter-sterling-brad-fittler-darren-lockyer-billy-slater-cameron-smith-rugby-league/news-story/03bc1a831b1aa656a481325709a2a128", "urlToImage": null, "publishedAt": "2020-04-26T04:46:00Z", "content": "Peter Sterling has called on Brad Fittler and Darren Lockyer to be inducted as the games next two Immortals.\r\nThe next Immortal induction ceremony is scheduled for 2022 and Sterling believes Fittler has just as much right to join the exclusive club of 13 as L… [+3408 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "Racenet", "title": "TIPS Sha Tin tips - Sunday April 26 It's HK$20m Champions Mile day at Sha - Racenet", "description": "It's HK$20m Champions Mile day at Sha Tin on Sunday and local hero Beauty Generation will be looking to reinforce his claims to another Horse Of The Year title when he takes on arch rival Waikuku in the 1600m event.", "url": "https://www.racenet.com.au/news/sha-tin-tips---sunday-april-26-20200426", "urlToImage": null, "publishedAt": "2020-04-26T04:27:05Z", "content": "It's HK$20m Champions Mile day at Sha Tin on Sunday and local hero Beauty Generation will be looking to reinforce his claims to another Horse Of The Year title when he takes on arch rival Waikuku in the 1600m event.\r\nIn the speedster ranks boom sprinter Aethe… [+2407 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Tim Elbra", "title": "Raelene Castle's exit as Rugby Australia CEO 'terrible', says Peter FitzSimons - Wide World of Sports", "description": "FitzSimons points the finger at Castle's main foe", "url": "https://wwos.nine.com.au/rugby/raelene-castle-rugby-australia-exit-terrible-peter-fitzsimons/ddb243f6-1574-45d9-b771-ef31226185f1", "urlToImage": null, "publishedAt": "2020-04-26T04:03:05Z", "content": "Raelene Castle's exit as Rugby Australia chief executive was a \"terrible\" look for the game, as was Phil Kearns' role as a chief agitator, former Wallaby Peter FitzSimons says.\r\nCastle left after losing the support of the board, but also amid claims of bullyi… [+3469 chars]"}, {"source": {"id": null, "name": "Skynews.com.au"}, "author": null, "title": "Health Minister 'disapointed' at crowds descending on Sydney beaches - Sky News Australia", "description": "Health Minister Brad Hazzard says he was “disappointed” to see beachgoers ignore the “very strong message about social distancing”. \n\nRandwick Council re-opened several eastern suburbs beaches from 6 to 9am on Saturday, allowing locals to swim, surf and run a…", "url": "https://www.skynews.com.au/details/_6151991549001", "urlToImage": null, "publishedAt": "2020-04-26T03:27:56Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Australian Associated Press", "title": "'Appalled': Footballer slammed for lockdown breach with lap dancers - Yahoo News Australia", "description": "A Premier League star is in hot water for breaching lockdown rules by throwing a wild house party with lap dancers.", "url": "https://au.sports.yahoo.com/football-moise-kean-lockdown-party-lap-dancers-premier-league-club-everton-slam-player-031755213.html", "urlToImage": null, "publishedAt": "2020-04-26T03:17:00Z", "content": "Everton have labelled Moise Kean's actions \"unacceptable\" after he flouted coronavirus lockdown restrictions.\r\nThe Premier League club and football community have been left fuming after the player filmed himself in a wild house party with friends in what is a… [+4904 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "Stephen Brassel", "title": "The Armchair Punter analyses Rosehill from Hawkesbury Cup day - Racenet", "description": "We were back onto a good surface at Rosehill for the relocated Hawkesbury Cup meeting and every horse had their chance on  track which played fair to most although there were a few hard luck stories including an awful watch in the feature race of the day.", "url": "https://www.racenet.com.au/news/the-armchair-punter-dissects-the-hawkesbury-cup-meeting-from-rosehill-20200426", "urlToImage": null, "publishedAt": "2020-04-26T03:04:05Z", "content": "We were back onto a good surface at Rosehill for the relocated Hawkesbury Cup meeting and every horse had their chance on  track which played fair to most although there were a few hard luck stories including an awful watch in the feature race of the day.\r\nST… [+6001 chars]"}, {"source": {"id": null, "name": "Thewest.com.au"}, "author": "The West Australian", "title": "Richmond coach Damien Hardwick calls for AFL to follow NRL’s lead and give clubs clarity over return date - The West Australian", "description": "The dual premiership coach admits it has been difficult to navigate training schedules without an official end date for the competition’s coronavirus shutdown in sight.", "url": "https://thewest.com.au/sport/afl/richmond-coach-damien-hardwick-calls-for-afl-to-follow-nrls-lead-and-give-clubs-clarity-over-return-date-ng-b881530242z", "urlToImage": null, "publishedAt": "2020-04-26T03:00:33Z", "content": "Damien Hardwick would be prepared to take Richmond to an interstate hub in order to reboot the AFL season.\r\nThe dual premiership coach admits it has been difficult to navigate training schedules without an official end date for the competitions coronavirus sh… [+2263 chars]"}, {"source": {"id": null, "name": "Rugby.com.au"}, "author": null, "title": "Time for a Super Rugby \"rethink\": To'omua - Rugby.com.au", "description": "Super Rugby in its current form is not attractive for fans and now is the time to be \"innovative\" in developing solutions for future competition formats.", "url": "https://www.rugby.com.au/news/2020/04/26/super-rugby-toomua-transformation", "urlToImage": null, "publishedAt": "2020-04-26T02:05:35Z", "content": "Super Rugby in its current form is not attractive for fans and now is the time to be \"innovative\" in developing solutions for future competition formats.\r\nThat's the view of Rebels and Wallabies playmaker Matt To'omua, who could emerge as a key voice in discu… [+5154 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "Cameron Happ", "title": "Cameron Happ dissects Saturdays Flemington Meeting - Racenet", "description": "The VRC might need to consider renaming the feature race the Gai Waterhouse St Leger with the champion trainer bringing up a hat-trick of wins. Honours were mostly shared throughout the day with Damien Oliver the only one to bring up a double.", "url": "https://www.racenet.com.au/news/cameron-happ-dissects-saturday-s-vrc-st-leger-meeting-from-flemington-20200426", "urlToImage": null, "publishedAt": "2020-04-26T01:49:05Z", "content": "The VRC might need to consider renaming the feature race the Gai Waterhouse St Leger with the champion trainer bringing up a hat-trick of wins. Honours were mostly shared throughout the day with Damien Oliver the only one to bring up a double.\r\nClearly the in… [+7266 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "AAP", "title": "Alysha Collett and Patrick Moloney return to Australia from Singapore - Racenet", "description": "Alysha Collett and Patrick Moloney are the latest ex-pat jockeys to leave Singapore with heightened restrictions introduced because of the COVID-19 pandemic.", "url": "https://www.racenet.com.au/news/two-more-ex-pat-jockeys-leave-singapore-for-australia-20200426", "urlToImage": null, "publishedAt": "2020-04-26T01:40:30Z", "content": "Alysha Collett and Patrick Moloney are the latest ex-pat jockeys to leave Singapore with heightened restrictions introduced because of the COVID-19 pandemic.\r\nMoloney is returning to Victoria while New Zealander Collett will head to Sydney where she rode with… [+2194 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": null, "title": "Ingles thinks NBA season may be cancelled - Sydney Morning Herald", "description": "Joe Ingles initially thought it would be a \"two or three week\" pause on the NBA season. Now he is beginning to think it will be lost.", "url": "https://www.smh.com.au/sport/basketball/ingles-thinks-nba-season-may-be-cancelled-20200426-p54naq.html", "urlToImage": null, "publishedAt": "2020-04-26T01:29:16Z", "content": "\"My personal opinion is every week that we go along, it feels like it's a less and less chance that we're going to return.\"\r\nNBA commissioner Adam Silver said last week all options remained open with the season possibly resuming later in the year or could be … [+1305 chars]"}, {"source": {"id": null, "name": "Afl.com.au"}, "author": "Riley Beveridge", "title": "News Viewed From St Kilda to Detroit: Former Saint lands NFL deal Former St Kilda player - AFL", "description": "Former St Kilda player Arryn Siposs has been signed by NFL franchise Detroit Lions", "url": "https://www.afl.com.au/news/392079/from-st-kilda-to-detroit-former-saint-lands-nfl-deal", "urlToImage": null, "publishedAt": "2020-04-26T00:35:00Z", "content": "FORMER St Kilda forward Arryn Siposs is on the verge of becoming the fifth ex-AFL player to realise his NFL dream, signing as an undrafted free agent to the Detroit Lions on Sunday morning.\r\nSiposs was overlooked throughout the three-day NFL Draft, with only … [+1262 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Is this Australia’s next NBA star? Giant teen Makur Maker enters draft - Fox Sports", "description": "Giant-sized Australian teenager Makur Maker will enter the NBA Draft.", "url": "https://www.foxsports.com.au/basketball/nba/is-this-australias-next-nba-star-giant-teen-makur-maker-enters-draft/news-story/6f1aa24e10d52d44f1589fd84c031754", "urlToImage": null, "publishedAt": "2020-04-26T00:28:00Z", "content": "The athletic 19-year-old stands 211cm tall and is aiming to follow in the footsteps of Australian cousin Thon Maker who was drafted 10th by the Milwaukee Bucks in 2016 and now plays for Detroit Pistons.\r\nWatch Foxtel in an instant. Catch up and settle in with… [+2215 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "‘I’m not trying to dramatise it’: Paul Kent and RLPA boss in fiery clash over May 28 restart - Fox Sports", "description": "<b>Tune into our new show Fox League Live on Channel 502 Monday to Friday at 6.30pm and on Saturday at 3pm and Sunday at 5pm.</b>", "url": "https://www.foxsports.com.au/nrl/nrl-premiership/nrl-2020-paul-kent-vs-rlpa-boss-clint-newton-may-28-restart-peter-vlandys-rugby-league/news-story/b857b10950f54478a23f722501a9e88f", "urlToImage": null, "publishedAt": "2020-04-26T00:10:00Z", "content": "Paul Kent has been involved in a fiery clash with RLPA boss Clint Newton over his comments that the NRLs May 28 restart was premature.\r\nKent took issue with the fact that Newton released a statement mid-week saying the May 28 restart was not set in stone, des… [+4015 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Mariners no longer a sinking ship, says Stajcic - SBS - The World Game", "description": "Central Coast coach Alen Stajcic is convinced he has steadied a sinking ship with the battling A-League club now destined for smoother waters.", "url": "https://theworldgame.sbs.com.au/mariners-no-longer-a-sinking-ship-says-stajcic", "urlToImage": null, "publishedAt": "2020-04-25T23:45:00Z", "content": "Prior to the suspension of the competition in late March, the Mariners were on course to pick up a third wooden spoon in four seasons after losing 10 in a row.\r\nBut prior to that slump there had been distinct signs of a revival for the Gosford-based club, whi… [+2169 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Goal", "title": "Footballer, 23, placed in 'artificial coma' after catching virus - Yahoo News Australia", "description": "Harrowing details have emerged of the 23-year-old French football player's virus ordeal.", "url": "https://au.sports.yahoo.com/football-junior-sambia-artificial-coma-montpellier-player-tested-positive-covid-19-234234394.html", "urlToImage": null, "publishedAt": "2020-04-25T23:42:00Z", "content": "Montpellier midfielder Junior Sambia is out of a coma and breathing on his own after being diagnosed with Covid-19, according to his agent.\r\nThe 23-year-old was admitted to hospital on Tuesday after suffering from severe gastroenteritis, which was followed by… [+4076 chars]"}, {"source": {"id": null, "name": "Speedcafe.com"}, "author": null, "title": "Norris claims spin-win, McLaughlin fourth at COTA - Speedcafe", "description": "McLaren Formula 1 driver Lando Norris recovered from a mid-race spin to win the fifth round of the IndyCar iRacing Challenge at the Circuit of the Americas", "url": "https://www.speedcafe.com/2020/04/26/norris-claims-spin-win-mclaughlin-fourth-at-cota/", "urlToImage": null, "publishedAt": "2020-04-25T23:34:00Z", "content": "Norris led Power in the early stages\r\nMcLaren Formula 1 driver Lando Norris recovered from a mid-race spin to win the fifth round of the IndyCar iRacing Challenge at the Circuit of the Americas.\r\nA wildcard entry for the event, Norris led the early stages bef… [+2233 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "Greg Polson", "title": "Horse Racing Tips & Best Bets for Tamworth Sunday April 26 - Racenet", "description": "He won’t be at the track after breaking his leg in a trackwork incident on Saturday however trainer Cody Morgan looks set to get a smile back by replicating his 2019 achievement of winning the Country Championship Qualifier and Tamworth Cup with the same hors…", "url": "https://www.racenet.com.au/news/top-bets-from-greg-polson-for-tamworth-sunday-20200426", "urlToImage": null, "publishedAt": "2020-04-25T23:29:39Z", "content": "He won’t be at the track after breaking his leg in a trackwork incident on Saturday however trainer Cody Morgan looks set to get a smile back by replicating his 2019 achievement of winning the Country Championship Qualifier and Tamworth Cup with the same hors… [+2324 chars]"}, {"source": {"id": null, "name": "Espn.com.au"}, "author": "Adrian Wojnarowski", "title": "NBA reopening team practice facilities Friday where local restrictions eased, sources say - ESPN Australia", "description": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.", "url": "https://www.espn.com.au/nba/story/_/id/29099194/nba-reopening-team-practice-facilities-friday-where-local-restrictions-eased-sources-say", "urlToImage": null, "publishedAt": "2020-04-25T23:03:22Z", "content": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.\r\nPlayers can return to team facilities in states such as … [+2131 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "‘It will be covered’: NFL draft pick under fire for right wing militia tattoo - Fox Sports", "description": "New Patriots kicker Justin Rohrwasser says a tattoo on his arm is not representative of a loosely organised right-wing militia group that has adopted the symbol.", "url": "https://www.foxsports.com.au/nfl/nfl-draft-2020-justin-rohrwasser-new-england-patriots-kicker-tattoo/news-story/8065ebd403f41258a368e29f3c6934d1", "urlToImage": null, "publishedAt": "2020-04-25T22:43:43Z", "content": "Rohrwasser, who played at Rhode Island and Marshall, was taken 159th overall in the fifth round of the draft on Sunday (AEST).\r\nHe said in a conference call with reporters that he got the tattoo as a teenager because he has a lot of family members in the mili… [+1283 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Andrew Reid", "title": "Paul Kent savages Peter FitzSimons over scathing NRL swipe - Yahoo Sport Australia", "description": "The rugby league journalist has slammed the outspoken former Wallaby's scathing attack on the NRL.", "url": "https://au.sports.yahoo.com/nrl-rugby-league-journalist-paul-kent-angry-peter-fitzsimons-swipe-224117646.html", "urlToImage": null, "publishedAt": "2020-04-25T22:41:00Z", "content": "Rugby league journalist Paul Kent has ripped into Peter FitzSimons after the former Wallaby went on the attack over the NRL's plans to resume competition next month.\r\nARL Commission chairman Peter V'landys has confirmed the NRL will have the final say on a ne… [+5131 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "At home, not far away: Former president calls for Geelong home AFL Grand Final - Fox Sports", "description": "GMHBA Stadium should host this year’s AFL Grand Final should Geelong qualify and crowds remain locked out, according to former Cats president Frank Costa.", "url": "https://www.foxsports.com.au/afl/afl-2020-afl-geelong-cats-home-grand-final-geelong-cats-kardinia-park-frank-costa/news-story/6e7e655139fdb467faff395baa48b27c", "urlToImage": null, "publishedAt": "2020-04-25T21:31:32Z", "content": "Geelong has long campaigned for home finals to be played at its home venue, with coach Chris Scott claiming the current system, which aims to hold finals at the biggest stadiums available, is Wrong... there can be no doubting that its wrong.\r\nCosta, who was p… [+1413 chars]"}, {"source": {"id": null, "name": "Speedcafe.com"}, "author": null, "title": "GALLERY: Ambrose's motorsport career - Speedcafe", "description": "A Gallery of Marcos Ambrose's career to date following his announcement he will return to Australia after nine seasons in NASCAR", "url": "https://www.speedcafe.com/2020/04/26/gallery-marcos-ambrose/", "urlToImage": null, "publishedAt": "2020-04-25T21:00:00Z", "content": "Comments require approval before being published. Speedcafe.com reserves the right to deny any post that is abusive or offtopic. \r\nUsers are encouraged to flag/report comments which should be removed.\r\nSome comments may require approval before being published… [+77 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "ESPNcricinfo staff", "title": "Former Australia allrounder Graeme Watson dies at 75 | ESPNcricinfo.com - ESPNcricinfo", "description": "He played five Tests for Australia in an injury-plagued career | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29096744/former-australia-allrounder-graeme-watson-dies-75", "urlToImage": null, "publishedAt": "2020-04-25T15:03:25Z", "content": "Graeme Watson, the former Australia allrounder who was battling cancer, has died at the age of 75. Primarily a middle-order batsman and a medium-pace bowler, he played five Tests from 1967 to 1972 and two ODIs in 1972.\r\nAfter starting his domestic career at V… [+1316 chars]"}, {"source": {"id": null, "name": "Asiarugby.com"}, "author": "Asia Rugby", "title": "World Rugby elections, Update on Asia Rugby throws the weight of its continent behind challenger Agustín Pichot - asiarugby.com", "description": "World Rugby elections, Asia Rugby throws the weight of its continent behind challenger Agustín Pichot to become the next Chairman of World Rugby.", "url": "https://www.asiarugby.com/2020/04/25/world-rugby-elections-2/", "urlToImage": null, "publishedAt": "2020-04-25T13:55:03Z", "content": "Asia Rugby throws the weight of its continent behind challenger Agustín Pichot to become the next Chairman of World Rugby.\r\nWorld Rugby elections,  Asia Rugby President, Mr. Qais Abdulla Al Dhalai announced that today 25th April 2020 at the close of voting to… [+1771 chars]"}, {"source": {"id": null, "name": "Heraldsun.com.au"}, "author": "Leo Schlink", "title": "Melbourne Cup winner Vow And Declare fails to flatter with trainer Danny O’Brien left scratching head - Herald Sun", "description": "Danny O’Brien will almost certainly abandon Vow And Declare’s autumn and winter program after the Melbourne Cup winner was upstaged by Haky in a stunning upset in the William Newton Handicap (2600m).", "url": "https://www.heraldsun.com.au/sport/superracing/melbourne-cup-winner-vow-and-declare-fails-to-flatter-with-trainer-danny-obrien-left-scratching-head/news-story/f60975224d2abd3adcec88482cc0e569", "urlToImage": null, "publishedAt": "2020-04-25T10:10:31Z", "content": "Danny OBrien will almost certainly abandon Vow And Declares autumn and winter program after the Melbourne Cup winner was upstaged by Haky in a stunning upset in the William Newton Handicap (2600m).\r\nA $1.90 favourite, Vow And Declare finished fifth, beaten fo… [+12286 chars]"}, {"source": {"id": null, "name": "Racing.com"}, "author": "Brad Bishop", "title": "McNeil suspended out of St Leger McNeil suspended out of St Leger Interference in concluding stages - Racing.com", "description": "Interference in concluding stages costs young gun jockey almost two weeks on sideines", "url": "https://www.racing.com/news/2020-04-25/news-mcneil-suspended-out-of-st-leger", "urlToImage": null, "publishedAt": "2020-04-25T10:10:14Z", "content": "Jye McNeil’s frustration at defeat in Saturday’s VRC St Leger was amplified in the stewards’ room after the $160,000 Listed event.\r\nThe rising star was suspended for causing interference in the concluding stages of the feature event on the Flemington card.\r\nM… [+582 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Anna Harrington", "title": "Hawthorn coach Alastair Clarkson reveals ideas for AFL's radical post-coronavirus return - Wide World of Sports", "description": "'Some significant things to do for the game'", "url": "https://wwos.nine.com.au/afl/coaches-footy-bosses-to-guide-afl-return/f8d7d144-0d8f-4809-b13a-5f2be24d89da", "urlToImage": null, "publishedAt": "2020-04-25T10:09:11Z", "content": "Hawthorn coach Alastair Clarkson is among a collective of AFL coaches and football managers who will navigate the league through its return to play, and assess the future of football departments and talent pathways.\r\nThe soft cap for football departments is s… [+2337 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "Former Perth Glory player Xavier Torres jailed for match-fixing - Fox Sports", "description": "Two former La Liga footballers have been given one-year prison sentences in a landmark case marking the first successful prosecution for match-fixing in Spain.", "url": "https://www.news.com.au/sport/football/former-perth-glory-player-xavier-torres-jailed-for-matchfixing/news-story/1decfd789f5bc3652779463b27d4e806", "urlToImage": null, "publishedAt": "2020-04-25T08:44:00Z", "content": "The former Real Betis players Antonio Amaya and Xavier Torres, who played for A-League club Perth Glory in 2017/18 under coach Kenny Lowe, were on Friday convicted of fixing two games in the 2013/14 season.\r\nFive then-Osasuna directors, and two real estate ag… [+1550 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "Brad Waters", "title": "Dalasan wins 2020 Chairman's Stakes - Racenet", "description": "Dalasan sounded a warning to the interstate raiders targeting the South Australian Derby with his win in Saturday’s Group III Chairman’s Stakes (2050m) at Morphettville.", "url": "https://www.racenet.com.au/news/dalasan-keeps-up-sa-derby-chase-in-chairman-s-stakes-20200425", "urlToImage": null, "publishedAt": "2020-04-25T08:00:02Z", "content": "Dalasan sounded a warning to the interstate raiders targeting the South Australian Derby with his win in Saturday’s Group III Chairman’s Stakes (2050m) at Morphettville.\r\nDalasan is unbeaten in South Australia and kept that record intact with another strong e… [+1727 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "Mitch Cohen", "title": "Family comes first for Hawkes Racing in Gold Cup with Amangiri - Racenet", "description": "It was a true family affair when the Hawkes Racing-trained Amangiri showed fighting spirit to take out the Group III Hawkesbury Gold Cup (1500m) at Rosehill.", "url": "https://www.racenet.com.au/news/family-comes-first-for-hawkes-racing-in-gold-cup-20200425", "urlToImage": null, "publishedAt": "2020-04-25T07:45:18Z", "content": "It was a true family affair when the Hawkes Racing-trained Amangiri showed fighting spirit to take out the Group III Hawkesbury Gold Cup (1500m) at Rosehill.\r\nAmangiri is owned by the wives of John and Michael Hawkes, Jenny and Claire respectively, and the pr… [+2209 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "Brad Waters", "title": "RACE REVIEWS Gai & Adrian complete VRC St Leger hat trick Stewards were called on to - Racenet", "description": "Stewards were called on to confirm training partners Gai Waterhouse and Adrian Bott had won their third straight VRC St Leger at Flemington.", "url": "https://www.racenet.com.au/news/gai--adrian-complete-vrc-st-leger-hat-trick-20200425", "urlToImage": null, "publishedAt": "2020-04-25T07:13:46Z", "content": "Stewards were called on to confirm training partners Gai Waterhouse and Adrian Bott had won their third straight VRC St Leger at Flemington.\r\nWaterhouse and Bott won the previous two runnings of the Anzac Day event with Runaway and Transact. Sacramento ($5.50… [+1357 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "On the Wattbike... and the punt! Storm’s Kiwi flyer gives insight into his hotel room isolation - Fox Sports", "description": "<b>Tune into our new show Fox League Live on Channel 502 Monday to Friday at 6.30pm and on Saturday at 3pm and Sunday at 5pm.</b>", "url": "https://www.foxsports.com.au/nrl/nrl-premiership/teams/storm/nrl-2020-covid19-coronavirus-brandon-smith-new-zealand-craig-bellamy-melbourne-storm/news-story/0221a4414d26450609352dbdeb44c2b8", "urlToImage": null, "publishedAt": "2020-04-25T07:10:00Z", "content": "Melbourne coach Craig Bellamy doesnt have to worry about his Kiwi star Brandon Smith failing skin-fold tests when NRL training resumes.\r\nWhile the Storm would normally be preparing for their annual Anzac Day match against the Warriors, players are laying low … [+3139 chars]"}, {"source": {"id": null, "name": "Bendigoadvertiser.com.au"}, "author": "KIERAN ILES", "title": "Tributes flow for harness racing icon Gavin Lang - Bendigo Advertiser", "description": "Industry mourns the loss of a legend.", "url": "https://www.bendigoadvertiser.com.au/story/6735133/tributes-flow-for-harness-racing-icon-gavin-lang/", "urlToImage": null, "publishedAt": "2020-04-25T06:30:00Z", "content": "Tributes flow for harness racing icon Gavin Lang\r\nhttps://nnimgt-a.akamaihd.net/transform/v1/crop/frm/j98Hh85wiUB5yeTBh2fLTR/35217473-1fdc-4ea2-be41-49798cf5cdf7.jpg/r0_263_1920_1348_w1200_h678_fmax.jpg\r\nIndustry mourns the loss of a legend.\r\nnews, local-news… [+276 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "NBA 2020: Timberwolves roasted for D’Angelo Russell injection post - NEWS.com.au", "description": "NBA 2020: Timberwolves roasted for D’Angelo Russell injection post", "url": "https://www.news.com.au/sport/american-sports/nba/nba-2020-timberwolves-roasted-for-dangelo-russell-injection-post/news-story/337d297e0c7d3fa08fe0590aa185d600", "urlToImage": null, "publishedAt": "2020-04-25T06:23:00Z", "content": "The Minnesota Timberwolves have delivered a genuine contender for dumbest tweet of the week after a social media post on Saturday morning left commentators scratching their heads. The franchise has been under the pump since a cheeky dig at US President Donald… [+2444 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Jake Niall", "title": "Last man standing: Why Gillon McLachlan must stay in the job - Sydney Morning Herald", "description": "AFL boss Gillon McLachlan will be remembered largely for the game he bequeaths to his successor, whenever that happens.", "url": "https://www.theage.com.au/sport/afl/afl-and-coronavirus-why-gillon-mclachlan-must-stay-in-the-job-20200425-p54n6t.html", "urlToImage": null, "publishedAt": "2020-04-25T05:49:35Z", "content": "There was speculation about a potential move to run Crown Casino, as he was sounded out about other jobs, and open talk within the game about Brendon Gale, Richmond's chief executive, as his prospective successor.\r\nToday, any thoughts McLachlan harboured abou… [+4971 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Let’s hope in time Raelene Castle is paid the respect she deserves - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T05:41:00Z", "content": null}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "Mitch Cohen", "title": "SATURDAY RACING Sweet Scandal arrives right on time in Hawkesbury Crown Kris Lees' In Her Time - Racenet", "description": "Kris Lees' In Her Time looked to be headed towards the breeding barn on a winning note before Sweet Scandal emerged from the pack to score by long neck.", "url": "https://www.racenet.com.au/news/sweet-scandal-arrives-right-on-time-in-hawkesbury-crown-20200425", "urlToImage": null, "publishedAt": "2020-04-25T05:30:40Z", "content": "Sweet Scandal crashed In Her Time's farewell party when the Chris Waller-trained mare rocketed home to claim the Group III Hawkesbury Crown (1300m) at Rosehill on Saturday.\r\nIn Her Time looked to be headed towards the breeding barn on a winning note before Sw… [+1950 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "‘Disgusted, insulted’: ‘Obnoxious’ $210m backflip triggers wild NFL trade reality - Fox Sports", "description": "Aaron Rodgers can’t be happy.", "url": "https://www.foxsports.com.au/nfl/nfl-draft-2020-aaron-rodgers-jordan-love-green-bay-packers-analysis-reaction/news-story/3373f1c4fa71447884681a43cfc4a165", "urlToImage": null, "publishedAt": "2020-04-25T04:41:00Z", "content": "The superstar quarterback, who has four years remaining on his contract in Green Bay, watched on during the first round of the 2020 NFL Draft as the organisation gleefully snapped up his potential successor.\r\nA team that couldnt stop the run in the NFC Champi… [+4742 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": "Nick Walshaw", "title": "UFC 2020: Robert Whittaker breaks silence on UFC absence - Daily Telegraph", "description": "Robert Whittaker was halfway up a sandhill on Christmas Day when he did the unthinkable.", "url": "https://www.dailytelegraph.com.au/sport/ufc-2020-robert-whittaker-breaks-silence-on-ufc-absence/news-story/7e306d4a813b262d76b612dedfb83b7e", "urlToImage": null, "publishedAt": "2020-04-25T04:26:23Z", "content": "Robert Whittaker was halfway up a sandhill on Christmas Day when he did the unthinkable.\r\nHe stopped.\r\nWhich made no sense.\r\nOr not for Whittaker.\r\nThat unbreakable UFC fighter who, for five years, has devoted his Sundays to climbing those famed Wanda dunes i… [+7443 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "Brad Waters", "title": "Caulfield Guineas plans for Flying Award - Racenet", "description": "Trainer Danny O’Brien has earmarked Flying Award as a Caulfield Guineas hope after his last-to-first win in Saturday’s Listed Anzac Day Stakes (1400m) at Flemington.", "url": "https://www.racenet.com.au/news/o-brien-chasing-guineas-award-after-anzac-day-stakes-win-20200425", "urlToImage": null, "publishedAt": "2020-04-25T04:05:05Z", "content": "Trainer Danny O’Brien has earmarked Flying Award as a Caulfield Guineas hope after his last-to-first win in Saturday’s Listed Anzac Day Stakes (1400m) at Flemington.\r\nThe Anzac Day Stakes has been an interesting Caulfield Guineas form race in recent years wit… [+2123 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Neil Breen", "title": "Would Michael Jordan have survived scrutiny of the social media age? - The Age", "description": "Jordan was arguably the biggest sportsman on the planet in the 1990s. But how would he be remembered if he was around today?", "url": "https://www.smh.com.au/sport/basketball/would-michael-jordan-have-survived-scrutiny-of-the-social-media-age-20200424-p54mxn.html", "urlToImage": null, "publishedAt": "2020-04-25T03:34:34Z", "content": "For me, though, the hidden highlight was watching them all go about their business in the pre-social media world, when they could still operate with an air of mystery.\r\nJordan's ascent may have looked very different in the age of social media.Credit:AP\r\nSteve… [+3893 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Lest We Forget | Anzac Day 2020 | AFL - AFL", "description": "Lest We Forget. www.anzacappeal.com.au Reciting the ode: Dr Robert Webster OAM State President, RSL Victoria Bugler: John Mansfield", "url": "https://www.youtube.com/watch?v=Hae9lEMhteU", "urlToImage": null, "publishedAt": "2020-04-25T03:00:12Z", "content": null}, {"source": {"id": null, "name": "Espn.in"}, "author": "Tim McManus", "title": "Eagles surprisingly take Sooners QB Jalen Hurts in 2nd round of NFL draft - ESPN India", "description": "In a surprise move, the Eagles selected Oklahoma quarterback Jalen Hurts in the second round of the NFL draft Friday.", "url": "https://www.espn.in/nfl/story/_/id/29095862/eagles-surprisingly-take-sooners-qb-jalen-hurts-2nd-round-draft", "urlToImage": null, "publishedAt": "2020-04-25T01:20:52Z", "content": "PHILADELPHIA -- In a surprise move that stirred up instant conversation in Philadelphia, the Eagles selected Oklahoma quarterback Jalen Hurts in the second round of the 2020 NFL draft with the 53rd overall pick Friday.\r\nGiven that the Eagles handed Carson Wen… [+4361 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Andrew Reid", "title": "'Needs more followers': Roger Federer at centre of stunning conspiracy theory - Yahoo Sport Australia", "description": "Roger Federer's motivations have come into question around a controversial new proposal.", "url": "https://au.sports.yahoo.com/tennis-roger-federer-merge-atp-wta-swiss-criticised-over-controversial-idea-010643139.html", "urlToImage": null, "publishedAt": "2020-04-25T01:06:00Z", "content": "Roger Federer has been accused of trying to win more followers on social media as the tennis world continues to discuss his controversial merger proposal.\r\nFederer sparked somewhat of a frenzy on Thursday when he suggested that the mens and womens tours shoul… [+3348 chars]"}, {"source": {"id": null, "name": "Sen.com.au"}, "author": null, "title": "Report: ICC considering “legalised ball-tampering” - SEN", "description": "It comes in the wake of the COVID-19 pandemic.", "url": "https://www.sen.com.au/news/2020/04/25/report-icc-considering-legalised-ball-tampering/", "urlToImage": null, "publishedAt": "2020-04-25T00:50:38Z", "content": "The ICC are considering allowing legalised ball-tampering once cricket resumes, according to ESPNcricinfo's Daniel Brettig. \r\nUnder the supervision of umpires, the rule change would allow teams to use artificial substances to shine the ball in order to help g… [+560 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "NFL Draft: Dog steals the show, New England Patriots, every pick, D’Andre Swift’s dad - NEWS.com.au", "description": "NFL Draft, second round: Patriots dog and jacked dad steal the show", "url": "https://www.news.com.au/sport/american-sports/nfl/nfl-draft-second-round-patriots-dog-and-jacked-dad-steal-the-show/news-story/4af53e69050551a9827641b6ed09ef30", "urlToImage": null, "publishedAt": "2020-04-25T00:41:45Z", "content": "The second round of the NFL Draft is underway, but it wasnt a selection or even one of the coaches fancy houses that sent social media into a spin.Instead it was the dog of New England Patriots coach Bill Belichick who stole the show.\r\nAfter drafting safety K… [+1663 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "AFP", "title": "WADA demand answers over Sun Yang doping ban 'breach' - Yahoo Sport Australia", "description": "Banned swimmer Sun Yang's call-up for an Olympics training squad has caught the attention of anti-doping officials.", "url": "https://au.sports.yahoo.com/swimming-sun-yang-doping-ban-wada-seek-answers-over-alleged-breach-001549457.html", "urlToImage": null, "publishedAt": "2020-04-25T00:15:00Z", "content": "The World Anti-Doping Agency demanded answers Friday after reports that Chinese swimming star Sun Yang was called up for national training for the Tokyo Olympics in an apparent breach of his doping ban.\r\nThe latest incident in the colourful career of the thre… [+4450 chars]"}, {"source": {"id": null, "name": "Nrl.com"}, "author": "Ben Coady", "title": "How good were NRL coaches at playing rugby league - NRL.COM", "description": "How good were the current NRL coaches at playing the game?", "url": "https://www.nrl.com/news/2020/04/25/not-all-were-stars-but-nrl-coaches-make-dream-team/", "urlToImage": null, "publishedAt": "2020-04-24T22:01:22Z", "content": "What would you know? Youve never played the game.\r\nEvery sports journalist has heard that comment at least once during their career (unless of course they did play the game.)\r\nSo how good were the current crop of NRL coaches at playing the game? Pretty damn g… [+17450 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "‘Don’t know how he came out alive’: Brutal ‘Jordan Rules’ turned MJ into ‘screaming devil’ - Fox Sports", "description": "If you can’t beat them, beat them up.", "url": "https://www.foxsports.com.au/basketball/nba/the-last-dance-episode-3-episode-4-michael-jordan-chicago-bulls-vs-detroit-pistons/news-story/a543e00a926c79110ea7b71fcdf48091", "urlToImage": null, "publishedAt": "2020-04-23T07:06:00Z", "content": "It may be a bit simplistic, but that was essentially the Detroit Pistons approach back in the late 80s and early 90s.\r\nAnd it worked.\r\nThe Bad Boys reached the NBA Finals three times winning it all twice and took down some historically great teams in the proc… [+4842 chars]"}]}