{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Matt Dathan", "title": "Football news: English Premier League return, Liverpool, Boris Johnson, coronavirus - NEWS.com.au", "description": "English Premier League could be back and running within a few weeks", "url": "https://www.news.com.au/sport/football/english-premier-league-could-be-back-and-running-within-a-few-weeks/news-story/757b29162313c9ed8f69dd3b59774af1", "urlToImage": null, "publishedAt": "2020-04-25T01:30:46Z", "content": "Premier League football could be back on TV within weeks in a major boost for bored Brits.Boris Johnson has been briefed on plans for matches to be played behind closed doors and sees the resumption of live sport as key to boosting the moral of the nation aft… [+4241 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "The Big Weekend Sports Quiz: What year did Cathy Freeman make her Olympic Games debut - Fox Sports", "description": "Stuck inside with nothing to do this weekend?", "url": "https://www.foxsports.com.au/breaking-news/the-big-weekend-sports-quiz-what-year-did-cathy-freeman-make-her-olympic-games-debut/news-story/5b22b5a387582b2b2c5cbef64188a87e", "urlToImage": null, "publishedAt": "2020-04-25T01:28:00Z", "content": "Put away the puzzle, weve got you covered for the next five to ten minutes at least.\r\nJust how well do you really know your sport? Take on our 25 question quiz and see how your knowledge really stacks up in Fox Sports Australias Big Weekend Quiz.\r\nWatch Foxte… [+203 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "‘Disgusted, insulted’: ‘Obnoxious’ $210m backflip triggers wild NFL trade reality - Fox Sports", "description": "Aaron Rodgers can’t be happy.", "url": "https://www.foxsports.com.au/nfl/nfl-draft-2020-aaron-rodgers-jordan-love-green-bay-packers-analysis-reaction/news-story/3373f1c4fa71447884681a43cfc4a165", "urlToImage": null, "publishedAt": "2020-04-25T01:15:00Z", "content": "The superstar quarterback, who has four years remaining on his contract in Green Bay, watched on during the first round of the 2020 NFL Draft as the organisation gleefully snapped up his potential successor.\r\nA team that couldnt stop the run in the NFC Champi… [+4452 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Andrew Reid", "title": "'Needs more followers': Roger Federer at centre of stunning conspiracy theory - Yahoo Sport Australia", "description": "Roger Federer's motivations have come into question around a controversial new proposal.", "url": "https://au.sports.yahoo.com/tennis-roger-federer-merge-atp-wta-swiss-criticised-over-controversial-idea-010643139.html", "urlToImage": null, "publishedAt": "2020-04-25T01:06:00Z", "content": "Roger Federer has been accused of trying to win more followers on social media as the tennis world continues to discuss his controversial merger proposal.\r\nFederer sparked somewhat of a frenzy on Thursday when he suggested that the mens and womens tours shoul… [+3348 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "NFL Draft: Dog steals the show, New England Patriots, every pick, D’Andre Swift’s dad - NEWS.com.au", "description": "NFL Draft, second round: Patriots dog and jacked dad steal the show", "url": "https://www.news.com.au/sport/american-sports/nfl/nfl-draft-second-round-patriots-dog-and-jacked-dad-steal-the-show/news-story/4af53e69050551a9827641b6ed09ef30", "urlToImage": null, "publishedAt": "2020-04-25T00:41:45Z", "content": "The second round of the NFL Draft is underway, but it wasnt a selection or even one of the coaches fancy houses that sent social media into a spin.Instead it was the dog of New England Patriots coach Bill Belichick who stole the show.\r\nAfter drafting safety K… [+1663 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "AFP", "title": "WADA demand answers over Sun Yang doping ban 'breach' - Yahoo Sport Australia", "description": "Banned swimmer Sun Yang's call-up for an Olympics training squad has caught the attention of anti-doping officials.", "url": "https://au.sports.yahoo.com/swimming-sun-yang-doping-ban-wada-seek-answers-over-alleged-breach-001549457.html", "urlToImage": null, "publishedAt": "2020-04-25T00:15:00Z", "content": "The World Anti-Doping Agency demanded answers Friday after reports that Chinese swimming star Sun Yang was called up for national training for the Tokyo Olympics in an apparent breach of his doping ban.\r\nThe latest incident in the colourful career of the thre… [+4450 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "WWOS staff", "title": "AFL to make season relaunch decision on May 11 - Wide World of Sports", "description": "Leaked memo reveals competition's plans", "url": "https://wwos.nine.com.au/afl/afl-to-make-season-relaunch-decision-on-may-11/cdc41039-66ad-47cc-befc-59093186ac21", "urlToImage": null, "publishedAt": "2020-04-24T23:57:59Z", "content": "The AFL are set to make a decision on May 11 surrounding the relaunch of the 2020 season amid the coronavirus pandemic.\r\nAccording to report from Fox Sports, a memo issued to clubs from CEO Gillon McLachlan insists the competition will follow key medical advi… [+1063 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The biggest and best Anzac Day goals | Collingwood v Essendon, 1995-2020 | AFL - AFL", "description": "James Hird, Dane Swan, David Zaharakis, Alan Didak, Che Cockatoo-Collins, Saverio Rocca and so many more! It's been 25 years since Collingwood and Essendon s...", "url": "https://www.youtube.com/watch?v=Y4JjjDjNyv0", "urlToImage": null, "publishedAt": "2020-04-24T23:00:08Z", "content": "James Hird, Dane Swan, David Zaharakis, Alan Didak, Che Cockatoo-Collins, Saverio Rocca and so many more!\r\nIt's been 25 years since Collingwood and Essendon started the now traditional Anzac Day game and here is the most memorable and remarkable goals between… [+327 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Making up for lost time: UFC reveals grand return with THREE events in a week - Fox Sports", "description": "Full steam ahead.", "url": "https://www.foxsports.com.au/ufc/the-ufc-is-going-somewhere-theyve-never-been-to-put-on-a-monster-event-next-month/news-story/2d70a302e190a193e7a3c250efc9a34e", "urlToImage": null, "publishedAt": "2020-04-24T22:41:15Z", "content": "The UFC plans to set up shop in Jacksonville for a week next month as Dana White puts on three shows, including a blockbuster UFC 249 card headlined by Tony Ferguson and Justin Gaethje.\r\nAfter being forced to postpone UFC 249 last month, White went right back… [+2434 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "James Dielhenn", "title": "Boxing news: Manny Pacquiao, Rustico Torrecampo, where is he now - NEWS.com.au", "description": "Grim tale behind the man who was the first to knockout Manny Pacquiao", "url": "https://www.news.com.au/sport/boxing/grim-tale-behind-the-man-who-was-the-first-to-knockout-manny-pacquiao/news-story/4799ed94655a5702275879996483cc0a", "urlToImage": null, "publishedAt": "2020-04-24T22:18:38Z", "content": "People dont know exactly where Rustico Torrecampo is, and thats the way he needs it to be.He isn't in jail so is likely living as a squatter again, with barely a penny to his name, as he was before he became a wanted man. The years have not been easy on Torre… [+5498 chars]"}, {"source": {"id": null, "name": "Nrl.com"}, "author": "Ben Coady", "title": "How good were NRL coaches at playing rugby league - NRL.COM", "description": "How good were the current NRL coaches at playing the game?", "url": "https://www.nrl.com/news/2020/04/25/not-all-were-stars-but-nrl-coaches-make-dream-team/", "urlToImage": null, "publishedAt": "2020-04-24T22:01:22Z", "content": "What would you know? Youve never played the game.\r\nEvery sports journalist has heard that comment at least once during their career (unless of course they did play the game.)\r\nSo how good were the current crop of NRL coaches at playing the game? Pretty damn g… [+17450 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Martyn Herman", "title": "Nadal may play as Kyrgios in virtual Open - Wide World of Sports", "description": "Stars to battle it out in Tennis World Tour video game", "url": "https://wwos.nine.com.au/tennis/nadal-may-play-as-kyrgios-in-virtual-open/9ebea14b-6b13-46cd-b26a-52c027b0dbcb", "urlToImage": null, "publishedAt": "2020-04-24T22:00:12Z", "content": "When discussing the favourites to win the Madrid Open the first name on most people's lips would usually be claycourt king Rafa Nadal. Things are a little different this year though.\r\nThe Spaniard, who has won the tournament five times, will have his work cut… [+2597 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Ex-Glory player Torres sentenced to jail for match-fixing - SBS - The World Game", "description": "Former Perth Glory midfielder Xavi Torres has been handed a prison sentence along with an ex-Real Betis teammate and five former directors of Osasuna after being found guilty on corruption charges in Spain.", "url": "https://theworldgame.sbs.com.au/ex-glory-player-torres-sentenced-to-jail-for-match-fixing", "urlToImage": null, "publishedAt": "2020-04-24T21:51:35Z", "content": "The two former La Liga footballers have been given one-year prison sentences in a landmark case marking the first successful prosecution for match-fixing in Spain.\r\nThe former Real Betis players Xabi Torres and Antonio Amaya were on Friday convicted of fixing… [+1480 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Alex Raskin Sports News Editor For Dailymail.com Associated Press", "title": "Video shows Bucs rookie and Tom Brady's newest blocker Tristan Wirfs jumping out of pool - Daily Mail", "description": "Tampa Bay Buccaneers first-round pick Tristan Wirfs weighs well over 300 pounds, but the offensive tackle and Tom Brady's newest blocker is still athletic enough to jump out of a pool onto his feet.", "url": "https://www.dailymail.co.uk/news/article-8254551/Video-shows-Bucs-rookie-Tom-Bradys-newest-blocker-Tristan-Wirfs-jumping-pool.html", "urlToImage": null, "publishedAt": "2020-04-24T20:51:27Z", "content": "The Buccaneers drafted Tristan Wirfs to address an opening at right tackle \r\nTampa Bay Buccaneers first-round pick Tristan Wirfs weighs well over 300 pounds, but the offensive tackle and Tom Brady's newest blocker is still athletic enough to launch himself ou… [+3438 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Nic Savage", "title": "Cricket 2020, news: ICC consider legalising ball-tampering, coronavirus, COVID-19, Australia - NEWS.com.au", "description": "ICC considers legalising ball-tampering amid COVID-19 health concerns", "url": "https://www.news.com.au/sport/cricket/icc-considers-legalising-balltampering-amid-covid19-health-concerns/news-story/af5f4eb787ad85a594e955d2dd5be752", "urlToImage": null, "publishedAt": "2020-04-24T20:34:18Z", "content": "Steve Smith, David Warner and Cameron Bancroft faced immense public scrutiny and copped lengthy bans for the censured action, yet a form of legalised ball-tampering could prove a catalyst for crickets return from lockdown, ESPNcricinfo reported.Like most of s… [+3580 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "‘What the f*** am I doing?’ The Christmas Day epiphany that changed Rob Whittaker’s life - Fox Sports", "description": "Robert Whittaker had not once quit on running up this sand dune in Sydney’s Sutherland Shire.", "url": "https://www.foxsports.com.au/ufc/what-the-f-am-i-doing-the-christmas-day-epiphany-that-changed-rob-whittakers-life/news-story/cad4632c55311f95e02d455205242887", "urlToImage": null, "publishedAt": "2020-04-24T20:00:20Z", "content": "That was until Christmas Day last year, when he just stopped.\r\nThen (I) stood there, asking what the f**k am I doing? he told The Saturday Telegraph.\r\nIt was Christmas Day.\r\nMy family was somewhere else.\r\nThat moment, its when everything crashed.\r\nWatch Foxte… [+1979 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Bret Harris", "title": "Raelene Castle becomes latest casualty of Australia's flawed rugby system - The Guardian", "description": "Did the tenure of the first woman to fill the role of Rugby Australia chief executive really end in failure?", "url": "https://www.theguardian.com/sport/2020/apr/25/raelene-castle-becomes-latest-casualty-of-australias-flawed-rugby-system", "urlToImage": null, "publishedAt": "2020-04-24T20:00:00Z", "content": "Under siege for several months, Raelene Castle tendered her resignation to Rugby Australia just three days after the publication of a letter co-authored by 11 unhappy former Wallabies captains calling for leadership change. The letter was the last straw for C… [+4817 chars]"}, {"source": {"id": null, "name": "Afl.com.au"}, "author": "Staff writers", "title": "News Viewed Who is your club's best forward of the 21st century? - Australian Football League", "description": "We select the best forward at your club from 2000-onwards", "url": "https://www.afl.com.au/news/391795/who-is-your-club-s-best-forward-of-the-21st-century-", "urlToImage": null, "publishedAt": "2020-04-24T20:00:00Z", "content": "THEY'RE the stars who drive your club to glory.\r\nThe team at AFL.com.au has dissected every club's records to name the best forward at each since the turn of the century. \r\n&gt;&gt; HAVE YOUR SAY on the who is the best in the poll at the bottom\r\nIn making our… [+14168 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Raelene Castle was simply the scapegoat, says Andrew Forrest - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-24T12:15:00Z", "content": null}, {"source": {"id": null, "name": "Nrl.com"}, "author": "NRL.com", "title": "NRL 2020: Latrell Mitchell 2021 contract, South Sydney Rabbitohs star staying - NRL.COM", "description": "South Sydney have announced star fullback Latrell Mitchell will be remaining in the red and green in 2021 after the club activated a clause for the second season in his two-year deal.", "url": "https://www.nrl.com/news/2020/04/24/latrell-staying-for-2021-after-rabbitohs-activate-contract-clause/", "urlToImage": null, "publishedAt": "2020-04-24T11:01:00Z", "content": "South Sydney have announced star fullback Latrell Mitchell will be remaining in the red and green in 2021 after the club activated a clause for the second season in his two-year deal.\r\nThe Rabbitohs posted on social media on Friday night to say the NSW and Au… [+732 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Australian Associated Press", "title": "Broadcasters agree to May 28 NRL restart, says Peter V'landys - The Guardian", "description": "ARL Commission chairman Peter V’landys has reiterated the NRL competition intends to resume on 28 May and the length of the season will be determined next week", "url": "https://www.theguardian.com/sport/2020/apr/24/nrl-2020-season-return-plans", "urlToImage": null, "publishedAt": "2020-04-24T10:29:57Z", "content": "The structure of a revised NRL competition is imminent after television broadcasters agreed to recognise 28 May as the optimal season restart date. After a high-powered meeting on Friday, Channel Nine and Foxtel could not reach an agreement on the length of t… [+2613 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Marc Churches", "title": "EXCLUSIVE: Andrew Johns urges NRL to reduce the interchange rule down to six - Wide World of Sports", "description": "'We've got to talk about duty of care'", "url": "https://wwos.nine.com.au/nrl/andrew-johns-urges-nrl-to-reduce-interchange-rule-down-to-six/33132628-66e3-4669-b004-28a6f31b5494", "urlToImage": null, "publishedAt": "2020-04-24T09:59:43Z", "content": "Rugby league immortal Andrew Johns has challenged the NRL to consider bringing down the number of interchanges teams are allowed to make in a bid to increase fatigue in the game.\r\nTeams are currently allowed to make eight interchanges each match after the NRL… [+1404 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "Daniel Brettig", "title": "India tour of Australia travel exemptions to be considered | ESPNcricinfo.com - ESPNcricinfo", "description": "Governments in Australia and abroad have asserted the importance of finding ways for sport to return | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29091871/india-tour-australia-travel-exemptions-considered", "urlToImage": null, "publishedAt": "2020-04-24T09:38:37Z", "content": "International exemptions to allow an India touring party to arrive in Australia next summer would be seriously considered by the federal government in the event of wider travel bans, strongly suggesting that Cricket Australia will be able to avoid losing up t… [+4434 chars]"}, {"source": {"id": null, "name": "Adelaidenow.com.au"}, "author": null, "title": "Port Adelaide cuts five staff members including former premiership hero Michael Wilson and midfield coach Scott Thompson - The Advertiser", "description": "Subscribe to The Advertiser to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.adelaidenow.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-24T09:13:00Z", "content": null}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Live: Legend believes NRL restart is AFL’s ‘blessing’ as Suns coach pushes for hubs - Fox Sports", "description": "Gold Coast Suns coach Stuart Dew has put in a strong case for Queensland as an AFL hub option.", "url": "https://www.foxsports.com.au/afl/afl-live-coronavirus-news-updates-when-will-season-2020-start-hub-model-june-start-date/news-story/808f8d513b538e51a80baf59840f3ba0", "urlToImage": null, "publishedAt": "2020-04-24T08:10:00Z", "content": "Meanwhile, Victorias Chief Medical Officer is cautiously optimistic about an AFL return in June, but is wary of todays COVID-19 spike.\r\nFollow all of the latest AFL updates below.\r\nWatch Foxtel in an instant. Catch up and settle in with no installation &amp; … [+9552 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Peter FitzSimons", "title": "Why it's high time Gladys put the NRL in its place - Sydney Morning Herald", "description": "Giving the green light to rugby league while the rest of us will have been stuck on red at the traffic lights for the past two months seems to be taking an insane and unnecessary risk.", "url": "https://www.smh.com.au/sport/why-it-s-high-time-gladys-put-the-nrl-in-its-place-20200424-p54n1f.html", "urlToImage": null, "publishedAt": "2020-04-24T08:00:27Z", "content": "Essentially, the NRL chair Peter Vlandys is arguing the case of rugby league exceptionalism, that the social isolation rules that apply to everyone else should not apply to them. AFL has much less contact than NRL and even they cant contemplate coming back be… [+11509 chars]"}, {"source": {"id": null, "name": "Afl.com.au"}, "author": "Damian Barrett", "title": "News Viewed When will footy return - Australian Football League", "description": "Clubs to be told week beginning May 11 when footy is to return", "url": "https://www.afl.com.au/news/391993/when-will-footy-return-afl-delays-big-reveal", "urlToImage": null, "publishedAt": "2020-04-24T07:30:00Z", "content": "THE AFL has delayed revealing its return to play plans until the week beginning May 11.\r\nHaving two weeks ago told clubs it would outline its course out of the COVID-19 enforced shutdown by the start of next week, AFL chief executive officer Gillon McLachlan … [+2226 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "How Liverpool tricked Chelsea into blowing $100m on PL’s biggest flop - Fox Sports", "description": "Liverpool knew they had “kidded” Chelsea when they flogged them Fernando Torres for &pound;50million, revealed Jamie Carragher.", "url": "https://www.foxsports.com.au/football/premier-league/how-liverpool-tricked-chelsea-into-blowing-100m-on-pls-biggest-flop/news-story/4ec9174618fccb292132e6b2d7ba1a83", "urlToImage": null, "publishedAt": "2020-04-24T07:19:00Z", "content": "The Anfield legend, 42, claimed the striker was a shadow of his former self when he moved to Stamford Bridge in 2011.\r\nTorres established himself as one of the best strikers in the world after he joined Liverpool from Atletico Madrid in 2007.\r\nThe Spaniard sc… [+2091 chars]"}, {"source": {"id": null, "name": "Racing.com"}, "author": "Ryan Reynolds - @Reynolds_R", "title": "Russian Camelot scratched - Racing.com", "description": "O'Brien galloper headed straight to SA Derby", "url": "https://www.racing.com/news/2020-04-24/news-russian-camelot-scratched-beasy", "urlToImage": null, "publishedAt": "2020-04-24T07:09:00Z", "content": "Danny O'Brien-trained star Russian Camelot will not run at Flemington on Saturday and will instead head straight to the Group 1 South Australian Derby.\r\nO'Brien's assistant trainer Ben Gleeson confirmed the decision to scratch on Friday afternoon with the hor… [+356 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Scott Morrison takes over as federal and state leaders plot sports’ return - 7NEWS.com.au", "description": "The AFL and NRL will soon have guidelines endorsed by federal and state leaders as the sports look to return during the coronavirus pandemic.", "url": "https://7news.com.au/sport/afl/scott-morrison-takes-over-as-federal-and-state-leaders-plot-sports-return-c-997177", "urlToImage": null, "publishedAt": "2020-04-24T07:05:00Z", "content": "Australias major sporting codes will have to meet a number of federal guidelines in order to return from the coronavirus pandemic.\r\nPrime minister Scott Morrison confirmed on Friday new national principles would be set up for sport and recreation to assist st… [+5328 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Heartwarming act from young Docker to save fan’s membership - Fox Sports", "description": "There are many people across Australia doing it tough during the coronavirus crisis.", "url": "https://www.foxsports.com.au/afl/afl-2020-coronavirus-covid19-sam-switkowski-dockers-fremantle-membership/news-story/33a8d0647dfeffe4d30115560236b118", "urlToImage": null, "publishedAt": "2020-04-24T06:51:00Z", "content": "But one act from a Fremantle Dockers player has lifted the spirits of a club member who had been forced to cancel her membership.\r\nLiving partially on a disability pension for an autoimmune deficiency, Linda Reynolds has been unable to continue her casual wor… [+1961 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "Racenet", "title": "BETTING Early market movers - Saturday April 25 There's been plenty of action on the Rosehill and - Racenet", "description": "There’s been plenty of action on the Rosehill and Flemington cards while early bird shoppers have been more selective when wagering on the Sunshine Coast, Morphettville and Ascot programmes.", "url": "https://www.racenet.com.au/news/early-market-movers---saturday-april-25-20200424", "urlToImage": null, "publishedAt": "2020-04-24T06:22:58Z", "content": "There’s been plenty of action on the Rosehill and Flemington cards while early bird shoppers have been more selective when wagering on the Sunshine Coast, Morphettville Parks and Ascot programmes.\r\nHere are Saturday’s early market movers. Correct at 4pm Frida… [+3938 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Brush up on your German. European football is set to return in 16 DAYS - Fox Sports", "description": "The Bundesliga is ready to return on May 9 if the German government gives it the green light, league officials have confirmed.", "url": "https://www.foxsports.com.au/football/bundesliga/bundesliga-2020-football-news-coronavirus-updates-league-to-return-on-may-9-if-government-gives-green-light/news-story/58e304fcb7a1e48ac8b4132d78307634", "urlToImage": null, "publishedAt": "2020-04-24T06:10:00Z", "content": "The league has been suspended since mid-March due to the outbreak of coronavirus, which has infected more than 148,000 and killed over 5,000 people in Germany.\r\nIts resumption, behind closed doors, remains dependent on government and all federal states approv… [+3358 chars]"}, {"source": {"id": null, "name": "Afl.com.au"}, "author": "Rob Forsaith, AAP", "title": "News Viewed Giants running machine trains with Demon and Hawk Lachie Whitfield keeps sharp with former - AFL", "description": "Lachie Whitfield keeps sharp with former Giants teammates Adam Tomlinson and Jon Patton", "url": "https://www.afl.com.au/news/391990/giants-running-machine-trains-with-demon-and-hawk", "urlToImage": null, "publishedAt": "2020-04-24T05:54:00Z", "content": "THE AFL shutdown has forced players to do things differently and in GWS star Lachie Whitfield's case that has included training with former teammates Adam Tomlinson and Jon Patton.\r\nWhitfield, one of the Giants' most important players who signed a seven-year … [+2115 chars]"}, {"source": {"id": null, "name": "Afl.com.au"}, "author": "Jason Phelan, AAP", "title": "News Viewed 'It has been taxing': The coach who's training like his players Rhyce Shaw has - Australian Football League", "description": "Rhyce Shaw has been going the extra mile to guide his players through the shutdown period", "url": "https://www.afl.com.au/news/391988/-it-has-been-taxing-the-coach-who-s-training-like-his-players", "urlToImage": null, "publishedAt": "2020-04-24T05:11:00Z", "content": "RHYCE Shaw is going the extra mile to help guide his players through the shutdown with the North Melbourne coach completing the same fitness program as some of his charges.\r\nShaw, who played the last of his 237 career AFL games in 2015, believes the move help… [+1567 chars]"}, {"source": {"id": null, "name": "Sen.com.au"}, "author": null, "title": "Which AFL players are the best media performers? - SEN", "description": "Garry Lyon and Tim Watson name their favourites.", "url": "https://www.sen.com.au/news/2020/04/24/which-afl-players-are-the-best-media-performers/", "urlToImage": null, "publishedAt": "2020-04-24T04:40:03Z", "content": "Which AFL players are the best performers in the media and give the best interviews?\r\nSEN Breakfast co-hosts Garry Lyon and Tim Watson have named their top picks, saying veteran players are usually better in this space.\r\nWatson named three that stand out to h… [+1164 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "’You were 100 per cent out of line’: Caro and ex-Crow’s heated radio clash - Fox Sports", "description": "Former Crow Stephen Rowe has had a heated debate with veteran AFL journalist Caroline Wilson over Adelaide’s handling of Tyson Stengle’s drink-driving incident, labelling her views “out of line”.", "url": "https://www.foxsports.com.au/afl/afl-2020-caroline-wilson-vs-stephen-rowe-radio-clash-transcript-tyson-stengle-adelaide-crows/news-story/3565c770754fd83076dc170c410eb02d", "urlToImage": null, "publishedAt": "2020-04-24T04:20:00Z", "content": "Stengle was caught drink-driving in an unregistered vehicle on April 9. He took two days to inform the club, with the Crows then not releasing a statement on the incident until the evening of Friday, April 18 the same day Western Bulldogs vice-captain Lachie … [+3697 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "Racenet", "title": "Apprentice Zoe White has disqualification reduced to three months - Racenet", "description": "A Queensland Racing Integrity Commission (QRIC) Internal Review decision has confirmed the Steward’s charge against apprentice jockey Zoe White.", "url": "https://www.racenet.com.au/news/internal-review-confirms-apprentice-jockey-charge---but-reduced-sentence-20200424", "urlToImage": null, "publishedAt": "2020-04-24T03:22:08Z", "content": "A Queensland Racing Integrity Commission (QRIC) Internal Review decision has confirmed the Steward’s charge against apprentice jockey Zoe White.\r\nMs White breached AR 232(b) on 1 April 2020 when she defied a Steward’s direction to stand down from riding and t… [+1925 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Jon Pierik", "title": "No Bull: Missing a New York 'dance' with Jordan a regret - Sydney Morning Herald", "description": "As a young reporter I was fortunate to witness first hand the phenomenon of Michael Jordan and the Bulls - but there's one game that still haunts me.", "url": "https://www.smh.com.au/sport/basketball/no-bull-missing-a-new-york-dance-with-jordan-a-regret-20200423-p54mml.html", "urlToImage": null, "publishedAt": "2020-04-24T02:44:25Z", "content": "A big Saturday night would turn into a lather of panic come Sunday afternoon when I awoke and switched on the television ... halfway through the damn game. Jordan put up 42 points in a 102-89 win, complete with a back-to-the-basket scoop in the lane that woul… [+3755 chars]"}, {"source": {"id": null, "name": "Afl.com.au"}, "author": "Mitch Cleary", "title": "'It's a very, very strong chance': Suns push case for hub Gold Coast boss - Australian Football League", "description": "Gold Coast boss Mark Evans is confident Queensland is at the front of the queue to host a quarantine hub", "url": "https://www.afl.com.au/news/391957/-it-s-a-very-very-strong-chance-suns-push-case-for-hub", "urlToImage": null, "publishedAt": "2020-04-24T02:27:00Z", "content": "GOLD Coast chief executive Mark Evans believes south-east Queensland is firming as a leading destination to host an AFL quarantine hub.  \r\nAs the League scours the country to determine ideal locations to house teams, Evans continued to push his region's case … [+1870 chars]"}, {"source": {"id": null, "name": "Sen.com.au"}, "author": null, "title": "Matthew Richardson's 2003 AFL re-draft - SEN", "description": "Richardson is worried Adam Cooney won't be happy with him.", "url": "https://www.sen.com.au/news/2020/04/24/matthew-richardsons-2003-afl-re-draft/", "urlToImage": null, "publishedAt": "2020-04-24T02:22:17Z", "content": "Richmond legend Matthew Richardson has re-drafted the top 10 of the 2003 National Draft.\r\nOne of the weaker drafts of the 21st century, Richardson has changed seven of the top 10 players from the original draft.\r\nOriginal top 10: Adam Cooney, Andrew Walker, C… [+1862 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Jai Bednall and James Matthey", "title": "NFL Draft 2020: Live coverage of first round picks, trades, Joe Burrow - NEWS.com.au", "description": "NFL Draft 2020: Wrap of first round picks", "url": "https://www.news.com.au/sport/american-sports/nfl/nfl-draft-2020-live-coverage-of-first-round-picks-trades/news-story/b145f07b6aa20cc0fe3c3aa31fa9397c", "urlToImage": null, "publishedAt": "2020-04-24T01:45:28Z", "content": "Joe Burrow has joined some very exclusive company after the LSU Tigers quarterback went No. 1 overall to Cincinnati in todays NFL Draft.Burrow joins Cam Newton (2011) as the only quarterbacks since 1967 to become the NFL’s first overall draft pick right after… [+5608 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Michael Gleeson", "title": "Anzac Day 1995: How Brereton helped Rocca tame the big bad wolf - The Age", "description": "On this day, indeed in his year as a Magpie, Dermott Brereton was influential in the moulding of one of the game’s under-rated stars. Sav Rocca.", "url": "https://www.theage.com.au/sport/afl/anzac-day-1995-how-brereton-helped-rocca-tame-the-big-bad-wolf-20200424-p54mv6.html", "urlToImage": null, "publishedAt": "2020-04-24T01:05:12Z", "content": "Saverio Rocca flies on Anzac Day in 1995.Credit:Jack Atley\r\nBrereton was and is an utterly Hawthorn figure after five premierships. But he started his football life a Collingwood fan and ended it a Collingwood player.\r\nOn this day, indeed in his year as a Mag… [+3687 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "AAP", "title": "Former St Kilda AFL player among Australian punters in NFL Draft - Wide World of Sports", "description": "Strong interest in former AFL player revealed", "url": "https://wwos.nine.com.au/news/australian-punters-await-virtual-nfl-draft/937942d5-c93d-4852-a47a-b46df8f5c897", "urlToImage": null, "publishedAt": "2020-04-24T00:19:20Z", "content": "Australian punters Arryn Siposs, Dane Roy and Joel Whitford will have a nervous wait as the NFL Draft gets underway on Friday morning.\r\nThe draft is usually held in packed venues with thousands of screaming fans, but the coronavirus pandemic has forced it to … [+1292 chars]"}, {"source": {"id": null, "name": "Espn.com.au"}, "author": "ESPN staff", "title": "2020 NFL draft trade tracker - Every deal for a first-round pick - ESPN Australia", "description": "Follow along for every trade involving Day 1 NFL draft picks. Which teams made moves for first-rounders?", "url": "https://www.espn.com.au/nfl/draft2020/story/_/id/29045298/2020-nfl-draft-trade-tracker-every-deal-first-round-pick", "urlToImage": null, "publishedAt": "2020-04-24T00:16:13Z", "content": "We tracked every first-round trade made leading up to the 2020 NFL draft. Here are all of the latest draft-pick deals for Day 1 selections, dating back to the Bears-Raiders trade in 2018 for the No. 19 pick in this year's draft. Follow along through Round 1 f… [+5237 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": "David Zita", "title": "AFL 2020, AFL, Matthew Primus Port Adelaide coach sacking - NEWS.com.au", "description": "Kane Cornes lifts lid on brutal 4am punishment ‘pathetic’ stars endured after coach’s shock axing", "url": "https://www.foxsports.com.au/afl/afl-2020-afl-matthew-primus-port-adelaide-coach-sacking/news-story/ef62cd376a3f0eeaf731621b597b3bf7", "urlToImage": null, "publishedAt": "2020-04-23T23:45:15Z", "content": "Port Adelaide great Kane Cornes has revealed the remarkable fallout from former coach Matthew Primus sacking in 2012.Primus, also a club great, was senior coach of the Power from 2010 before a Round 19 loss to a struggling Greater Western Sydney outfit saw hi… [+3616 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": "Laine Clark", "title": "NRL 2020: State of Origin, Steve Price dog act, Justin Poore Darren Lockyer, Justin Hodges, rugby league - NEWS.com.au", "description": "How Maroons 2009 Origin square-up for ‘dog act’ on Steve Price backfired", "url": "https://www.foxsports.com.au/nrl/nrl-premiership/nrl-2020-state-of-origin-steve-price-dog-act-justin-poore-darren-lockyer-justin-hodges-rugby-league/news-story/1947e93419acd7506921032e3148b6e3", "urlToImage": null, "publishedAt": "2020-04-23T23:38:54Z", "content": "It is considered one of the great State of Origin square ups.But Darren Lockyer has revealed Queensland’s payback for NSW’s “dog act” on an unconscious Steve Price in 2009 didn’t go to plan at all.\r\nWatch Foxtel in an instant. Catch up and settle in with no i… [+2142 chars]"}, {"source": {"id": null, "name": "Afl.com.au"}, "author": "Callum Twomey", "title": "News Viewed 'Signs are good': Longmuir backs Hogan return New Dockers coach Justin Longmuir hopes star - AFL", "description": "New Dockers coach Justin Longmuir hopes star forward Jesse Hogan will be back at the club soon", "url": "https://www.afl.com.au/news/391940/-signs-are-good-longmuir-backs-hogan-return", "urlToImage": null, "publishedAt": "2020-04-23T23:09:00Z", "content": "A TIMEFRAME on Jesse Hogan's return to playing remains unclear, but Fremantle coach Justin Longmuir expects the key forward to be back at the club when training recommences.\r\nHogan took leave away from the Dockers in February to deal with his mental health, a… [+2873 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Sam Goodwin", "title": "Neymar's mother, 52, reportedly dumps 23-year-old boyfriend - Yahoo Sport Australia", "description": "Neymar's mother has reportedly split from her 23-year-old boyfriend amid scandalous reports.", "url": "https://au.sports.yahoo.com/neymar-mother-dumps-young-boyfriend-tiago-ramos-230304432.html", "urlToImage": null, "publishedAt": "2020-04-23T23:03:00Z", "content": "The mother of football superstar Neymar has reportedly split with her 23-year-old boyfriend just days after their relationship caused a major stir in the sporting world.\r\nNeymars mother Nadine Goncalves, 52, took to social media recently to make her relations… [+3130 chars]"}, {"source": {"id": null, "name": "Cricket.com.au"}, "author": "AAP", "title": "ICC considering 'bio-bubbles' for T20 World Cup - cricket.com.au", "description": "Cricket officials say planning continues for the 2020 World Cup as they delay a call on the 2021 World Test Championship final", "url": "https://www.cricket.com.au/news/2020-t20-world-cup-in-australia-planning-coronavirus-bio-bubbles-womens-world-cup-test-championship/2020-04-24", "urlToImage": null, "publishedAt": "2020-04-23T21:26:43Z", "content": "The ICC say planning for this year's men's Twenty20 World Cup and next year's women's 50-over World Cup is going ahead despite the coronavirus outbreak.\r\nThe men's T20 World Cup is scheduled to be played in Australia from October 18 to November 15 while the w… [+2992 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": null, "title": "Crusaders coach Scott Robertson says 10-week Super Rugby competition possible - Stuff.co.nz", "description": "A domestic Super Rugby competition when Level One is declared, says Crusaders coach Scott Robertson.", "url": "https://www.stuff.co.nz/sport/rugby/super-rugby/121238329/crusaders-coach-scott-robertson-says-10week-super-rugby-competition-possible", "urlToImage": null, "publishedAt": "2020-04-23T20:57:00Z", "content": "Crusaders coach Scott Robertson says a \"brutal\" 10-week Super Rugby domestic competition is on the cards in New Zealand.\r\n Robertson, speaking to Will Greenwood's Podcast on Sky Sports, has been in lockdown in Christchurch since Covid-19 forced New Zealand to… [+4228 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Mal Meninga calls for longer NRL season or winless sides have no chance - Fox Sports", "description": "<b>Tune into our new show Fox League Live on Channel 502 Monday to Friday at 6.30pm and on Saturday at 3pm and Sunday at 5pm.</b>", "url": "https://www.foxsports.com.au/nrl/nrl-premiership/nrl-2020-mal-meninga-longer-nrl-season-titans-winless-teams-may-28-restart-22-rounds-rugby-league/news-story/ebd6df8ef5b378780607415022e40ee2", "urlToImage": null, "publishedAt": "2020-04-23T20:50:23Z", "content": "Mal Meninga insists the reworked NRL competition needs to go for as long as possible or else he claims winless sides like his Gold Coast will have no chance of making the finals.\r\nThe NRL are expected to determine their season structure by mid-next week, as n… [+2580 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": null, "title": "Project Apollo representative hits back at Queensland Premier Annastacia Palaszczuk with bombshell claim - Sporting News AU", "description": "Project Apollo representative Troy Grant has sensationally called out Queensland Premier Annastacia Palaszczuk after she demanded a ‘detailed plan’ from the NRL.", "url": "https://www.sportingnews.com/au/league/news/project-apollo-representative-hits-back-at-queensland-premier-annastacia-palaszczuk-with-bombshell-claim/1dhib8yws94p318rbje126iixc", "urlToImage": null, "publishedAt": "2020-04-23T18:55:00Z", "content": "Project Apollo representative Troy Grant has sensationally called out Queensland Premier Annastacia Palaszczuk after she demanded a detailed plan from the NRL.\r\nPalaszczuk has been vocal in her opposition to the NRLs bold bid to restart the 2020 season on May… [+2033 chars]"}, {"source": {"id": null, "name": "Heraldsun.com.au"}, "author": null, "title": "AFL considers restarting season with 18 clubs based in Victoria - Herald Sun", "description": "Subscribe to the Herald Sun to get unrestricted digital access, home paper delivery, Foxsports.com.au subscription,  Apps for iPad and Android and much more...", "url": "https://www.heraldsun.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-23T15:43:00Z", "content": null}, {"source": {"id": null, "name": "Espn.com.au"}, "author": "Jenna Laine", "title": "Bad house call: Buccaneers' Tom Brady mistakenly enters wrong home - ESPN Australia", "description": "New Buccaneers quarterback Tom Brady walked into the wrong house thinking it belonged to offensive coordinator Byron Leftwich, a source with knowledge of the situation confirmed to ESPN.", "url": "https://www.espn.com.au/nfl/story/_/id/29086979/buccaneers-tom-brady-mistakenly-enters-wrong-home", "urlToImage": null, "publishedAt": "2020-04-23T14:31:50Z", "content": "TAMPA, Fla. -- Tampa Bay Buccaneers quarterback Tom Brady is finding that, after spending 20 years in New England, moving to a new city doesn't come without an adjustment period.\r\nBrady was told this past week by a city employee that he couldn't work out in a… [+2495 chars]"}, {"source": {"id": null, "name": "9news.com.au"}, "author": "AAP", "title": "Ben Cousins to fight stalking, drugs charges - 9News", "description": "<p>Fallen AFL champion Ben Cousins will spend at least one more night in prison pending a bail application and has indicated he&#x27;ll fight nearly all new charges against him, including aggravated stalking in Perth.</p>", "url": "https://www.9news.com.au/national/ben-cousins-stalking-drugs-charges-to-contest-perth/6595ede6-2ce5-4126-be0a-83770a9b5ad2", "urlToImage": null, "publishedAt": "2020-04-23T11:57:00Z", "content": "Property News: How different households are coping with isolation and social distancing - domain.com.au"}, {"source": {"id": null, "name": "Nrl.com"}, "author": "Dan Walsh", "title": "NRL 2020: May 28 return date can be moved says RLPA - NRL.COM", "description": "The RLPA has backed the NRL's \"optimism\" in targeting a May 28 return to play date, but says no face will be lost if that date is pushed back into June to ensure player welfare needs are met.", "url": "https://www.nrl.com/news/2020/04/23/rlpa-happy-to-adjust-goalposts-on-may-28-return-if-necessary/", "urlToImage": null, "publishedAt": "2020-04-23T10:49:00Z", "content": "The RLPA has backed the NRL's \"optimism\" in targeting a May 28 return-to-play date, but cautioned a delay may still be needed to ensure player welfare needs are met.\r\nProject Apollo head Wayne Pearce told media on Wednesday that clubs could work towards havin… [+3521 chars]"}, {"source": {"id": null, "name": "Heraldsun.com.au"}, "author": null, "title": "Former AFL star Ben Cousins to return to court, aims to fight charges - Herald Sun", "description": "Subscribe to the Herald Sun to get unrestricted digital access, home paper delivery, Foxsports.com.au subscription,  Apps for iPad and Android and much more...", "url": "https://www.heraldsun.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-23T09:40:00Z", "content": null}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Andrew Wu", "title": "Cricket Australia, players in stand-off over potential pay cuts - Sydney Morning Herald", "description": "A meeting between Cricket Australia and the players union on Friday is set to be postponed.", "url": "https://www.smh.com.au/sport/cricket/cricket-australia-players-in-stand-off-over-potential-pay-cuts-20200423-p54mox.html", "urlToImage": null, "publishedAt": "2020-04-23T08:55:49Z", "content": "Reducing player pay is one of the four levers CA is pulling in order to cut costs to safeguard the game against financial disaster should the coronavirus pandemic prevent India from taking part in Tests and one-day series worth $300 million to the game's bott… [+2623 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "‘Don’t know how he came out alive’: Brutal ‘Jordan Rules’ turned MJ into ‘screaming devil’ - Fox Sports", "description": "If you can’t beat them, beat them up.", "url": "https://www.foxsports.com.au/basketball/nba/the-last-dance-episode-3-episode-4-michael-jordan-chicago-bulls-vs-detroit-pistons/news-story/a543e00a926c79110ea7b71fcdf48091", "urlToImage": null, "publishedAt": "2020-04-23T07:06:00Z", "content": "It may be a bit simplistic, but that was essentially the Detroit Pistons approach back in the late 80s and early 90s.\r\nAnd it worked.\r\nThe Bad Boys reached the NBA Finals three times winning it all twice and took down some historically great teams in the proc… [+4842 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "AAP", "title": "North Queensland coach Paul Green says he will understand if Cowboys players don't want to relocate to Sydney - Wide World of Sports", "description": "'It's a big commitment'", "url": "https://wwos.nine.com.au/nrl/unfair-for-relocating-nrl-teams-nq-coach/ec103733-0911-4908-a3da-20c0fdb44c6f", "urlToImage": null, "publishedAt": "2020-04-23T06:33:13Z", "content": "North Queensland coach Paul Green says it is \"not fair\" that teams have been asked to relocate to NSW for the NRL's restart and will understand if a Cowboys player refuses to travel.\r\nBut Green said his team was prepared to set up camp in Sydney if that ensur… [+2031 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Phil Lutton", "title": "Kyrgios not on board with Federer's vision of merged tennis tour - Sydney Morning Herald", "description": "Roger Federer has been supported in his desire to merge the ATP and WTA Tours but not everyone is fully convinced, including Australia's Nick Kyrgios.", "url": "https://www.smh.com.au/sport/tennis/nick-kyrgios-not-on-board-with-federer-s-vision-of-merged-tennis-tour-20200423-p54mm1.html", "urlToImage": null, "publishedAt": "2020-04-23T06:26:43Z", "content": "Tennis remains a convoluted sport, with the grand slams (run by their own boards) and the International Tennis Federation (ITF) also in play. It's not always seamless, with the ATP Cup's shared arrangement with the WTA's Brisbane International generating fric… [+2931 chars]"}, {"source": {"id": null, "name": "Sen.com.au"}, "author": null, "title": "What is the \"most overrated thing in footy\"? - SEN", "description": "Malcolm Blight makes his pick.", "url": "https://www.sen.com.au/news/2020/04/23/what-is-the-most-overrated-thing-in-footy/", "urlToImage": null, "publishedAt": "2020-04-23T05:58:05Z", "content": "AFL legend Malcolm Blight has called leadership groups the most overrated thing in football.\r\nMost teams have a squad of players behind their captain(s) who help make decisions around the club, the notable exception being Richmond who simply run with Trent Co… [+707 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "AFL great Sam Newman shut down over brazen coronavirus claim - Fox Sports", "description": "Sam Newman has been shut down for claiming he knows as much about the coronavirus as medical experts advising Australia’s politicians.", "url": "https://www.news.com.au/sport/sports-life/afl-great-sam-newman-shut-down-over-brazen-coronavirus-claim/news-story/ec9e13a72f0c1924d1ef2e3a97cf3769", "urlToImage": null, "publishedAt": "2020-04-23T05:49:00Z", "content": "The AFL great turned outspoken media personality has been in the headlines this month as he protests against the closure of golf courses in Victoria because of social distancing measures, complaining its an unfair restriction when people in other states are a… [+3639 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "Brad Waters", "title": "TIPS Top bets from Brad Waters for Flemington Saturday I'm back on the Racenet tipsters - Racenet", "description": "I'm back on the Racenet tipsters' panel after a hiatus and I'm tipping a minor upset in Saturday's VRC St Leger at Flemington.", "url": "https://www.racenet.com.au/news/top-bets-from-brad-waters-for-flemington-saturday-20200423", "urlToImage": null, "publishedAt": "2020-04-23T05:15:19Z", "content": "I'm back on the Racenet tipsters' panel after a hiatus and I'm tipping a minor upset in Saturday's VRC St Leger at Flemington.\r\nEXTREME PRIDE (Race 2 No 6)\r\nThe presence of Vow And Declare and Russian Camelot at Flemington on Saturday has kept trainer Danny O… [+1767 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Chris Young", "title": "'Love this': Shane Warne shamed by ripped 20-year-old son - Yahoo Sport Australia", "description": "Shane Warne wasn't quite as ripped as his son Jackson is now when he was the same age.", "url": "https://au.sports.yahoo.com/shane-warne-stunned-pics-jackson-warne-modelling-042226255.html", "urlToImage": null, "publishedAt": "2020-04-23T04:22:00Z", "content": "Shane Warne has made no bones about his struggles with his weight throughout his playing days - but now his son might have put him to the ultimate shame.\r\nJackson Warne has taken to Instagram with a series of steamy shots, the 20-year-old hinting at a potenti… [+2213 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Gronk domino effect; shock QB trade calls emerge: NFL Draft Late Mail - Fox Sports", "description": "If there’s one universal truth in the NFL, it’s that you can’t believe everything you read the week before Draft day.", "url": "https://www.foxsports.com.au/nfl/gronk-domino-effect-shock-qb-trade-calls-emerge-nfl-draft-late-mail/news-story/8cae46d46a4e115ab1b0fc3d020d73f9", "urlToImage": null, "publishedAt": "2020-04-23T04:01:00Z", "content": "And so here we are, within 24 hours of the Cincinnati Bengals going on the clock with the first pick of the 2020 NFL Draft, which will be conducted virtually like one big, awkward, extremely rich Zoom meeting.\r\nThe blockbuster return of Rob Gronkowski out of … [+6176 chars]"}, {"source": {"id": null, "name": "Racenet.com.au"}, "author": "Brad Waters", "title": "Jake Toeroek to ride Warning in Chairman's Stakes - Racenet", "description": "Adelaide jockey Jake Toeroek is keen to make his sole shot count aboard Victoria Derby winner Warning in Saturday’s Group III Chairman’s Stakes (2035m) at Morphettville.", "url": "https://www.racenet.com.au/news/jake-toeroek-out-to-make-warning-ride-count-in-chairman-s-20200423", "urlToImage": null, "publishedAt": "2020-04-23T03:54:41Z", "content": "Adelaide jockey Jake Toeroek is keen to make his sole shot count aboard Victoria Derby winner Warning in Saturday’s Group III Chairman’s Stakes (2035m) at Morphettville.\r\nThe Anthony Freedman stable booked Toeroek to ride Warning in his South Australian Derby… [+1560 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "‘We manage to eat our own’: Freddy’s incredible spray at ‘impatient’ NRL clubs - Fox Sports", "description": "<b>Tune into our new show Fox League Live on Channel 502 Monday to Friday at 6.30pm and on Saturday at 3pm and Sunday at 5pm.</b>", "url": "https://www.foxsports.com.au/nrl/nrl-premiership/fittler-slams-impatient-nrl-clubs-and-says-greenberg-shouldnt-be-blamed-for-wasted-money/news-story/37cb06ce6ba6170c52b2b8d121950b2a", "urlToImage": null, "publishedAt": "2020-04-23T02:04:00Z", "content": "Brad Fittler believes former NRL CEO Todd Greenberg can walk away with his head held high, saying incredible club spending contributed to the games financial plight exposed by the coronavirus crisis.\r\nAfter months of speculation that he was losing support, br… [+2172 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "‘You kick people to death’: Eddie and Caro’s explosive on-air feud over drink-driving star - Fox Sports", "description": "Eddie McGuire and Caroline Wilson have clashed over whether the lack of openness to media was appropriate following Lachie Hunter’s sanctions.", "url": "https://www.foxsports.com.au/afl/afl-2020-lachie-hunter-eddie-mcguire-caroline-wilson-western-bulldogs/news-story/136a4602f521a542667616fcf263705d", "urlToImage": null, "publishedAt": "2020-04-23T00:42:00Z", "content": "Hunter was handed a four-game suspension by the Western Bulldogs and relinquished his role as vice-captain after his alleged drink-driving car crash last week.\r\nThe Western Bulldogs elected to not put Hunter through a virtual press conference online, instead … [+5130 chars]"}]}