{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "20minutes.fr"}, "author": "20 Minutes avec AFP", "title": "ASSE : Le mythique entraîneur des Verts, Robert Herbin, a été hospitalisé à Saint-Etienne - 20 Minutes", "description": "Il a été admis au CHU de Saint-Étienne pour de sérieuses insuffisances cardiaques et pulmonaires", "url": "https://www.20minutes.fr/sport/2767691-20200425-asse-ex-mythique-entraineur-verts-robert-herblin-hospitalise-saint-etienne", "urlToImage": null, "publishedAt": "2020-04-25T16:11:09Z", "content": "Robert Herbin, ici le 4 mars 2003 à Meylan avec Thierry Roland, a été hospitalisé à Saint-Etienne, le 21 avril 2020. PHILIPPE MERLE / AFP\r\nRobert Herbin, entraîneur emblématique de la grande époque de lAS Saint-Etienne, est hospitalisé depuis mardi au CHU de … [+1572 chars]"}, {"source": {"id": null, "name": "Dailymercato.com"}, "author": "", "title": "Mercato OM : Thauvin toujours associé à l'AS Roma - Daily Mercato", "description": "Florian Thauvin fait parler de lui en Italie ce samedi. Selon La Gazzetta dello Sport, l'AS Roma pense toujours &agrave; l'ailier de l'OM et aimerait ...", "url": "https://www.dailymercato.com/news/mercato-om-thauvin-toujours-associe-a-l-as-roma", "urlToImage": null, "publishedAt": "2020-04-25T14:47:16Z", "content": "Florian Thauvin fait parler de lui en Italie ce samedi. Selon La Gazzetta dello Sport, l'AS Roma pense toujours à l'ailier de l'OM et aimerait profiter de sa fin de contrat en 2021 pour tenter sa chance cet été.\"De la fantaisie, des buts et des passes décisiv… [+1910 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "La Fédération appelle à autoriser le cyclisme dès le 11 mai - Cyclisme - L'Équipe.fr", "description": "La FFC estime dans un communiqué qu'un non-retour de l'activité cycliste à la date de démarrage du déconfinement, le 11 mai, <i>« constituerait une véritable discrimination vis-à-vis de (son) sport » </i>et rappelle les bienfaits du vélo pour toute la société.", "url": "https://www.lequipe.fr/Cyclisme-sur-route/Actualites/La-federation-appelle-a-autoriser-le-cyclisme-des-le-11-mai/1129716", "urlToImage": null, "publishedAt": "2020-04-25T14:46:33Z", "content": "La Fédération française de cyclisme a appelé samedi les autorités à autoriser la pratique du vélo dès le 11 mai, date annoncée de début du déconfinement, et dit espérer une reprise des compétitions « dans le respect des mesures sanitaires définies par l'État,… [+2468 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "B.C.", "title": "Mercato - PSG : Leonardo voudrait s'attaquer à un joueur du FC Barcelone ! - Le 10 Sport", "description": "Alors que le PSG est à la recherche d'un milieu de terrain, Arthur Melo plairait fortement à Leonardo.", "url": "https://le10sport.com/football/mercato/mercato-psg-leonardo-voudrait-sattaquer-a-un-joueur-du-fc-barcelone-501114", "urlToImage": null, "publishedAt": "2020-04-25T14:45:00Z", "content": "Publié le 25 avril 2020 à 16h45 par B.C. Alors que le PSG est à la recherche d'un milieu de terrain, Arthur Melo plairait fortement à Leonardo.\r\nMalgré les arrivées d'Ander Herrera et d'Idrissa Gueye l'été dernier, Leonardo souhaiterait toujours renforcer l'e… [+838 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/marc.alvarez1", "title": "Hermel : “A aucun moment le Real Madrid va vouloir une guerre avec le PSG” - Canal Supporters", "description": "\"A aucun moment le Real Madrid va vouloir une guerre avec le PSG comme le Barça a pu le faire avec Neymar. Les relations entre les présidents", "url": "https://canal-supporters.com/2020/04/hermel-a-aucun-moment-le-real-madrid-va-vouloir-une-guerre-avec-le-psg/", "urlToImage": null, "publishedAt": "2020-04-25T14:32:05Z", "content": "Kylian Mbappé (21 ans) est sous contrat jusqu’en 2022 avec le PSG. S’il ne prolonge pas d’ici l’été 2021, le club francilien risque d’être coincé et d’accepter de négocier avec un Real Madrid qui ne fera qu’un deal propre en cas de transfert décidé par l’atta… [+1956 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Mathieu Rault", "title": "PSG : Mauro Icardi pourrait coûter plus cher que prévu ! - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a6086381562833370238-psg-mauro-icardi-pourrait-couter-plus-cher-que-prevu", "urlToImage": null, "publishedAt": "2020-04-25T14:14:36Z", "content": "Où évoluera Mauro Icardi la saison prochaine ? Nul ne le sait. Propriété de l'Inter de Milan, l'attaquant argentin a été prêté au Paris Saint-Germain cette saison, avec qui il a inscrit la bagatelle de 20 buts en 31 matches. A l'issue de la saison, dont on ig… [+1004 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Sambia, pour que la danse reprenne / France / Montpellier / SOFOOT.com - SO FOOT", "description": "Espoirs et attente pour Junior Sambia, atteint du coronavirus et en réanimation.", "url": "https://www.sofoot.com/junior-sambia-atteint-du-coronavirus-et-hospitalise-devrait-s-en-sortir-482668.html", "urlToImage": null, "publishedAt": "2020-04-25T14:00:00Z", "content": "Atteint du coronavirus et hospitalisé en réanimation, Junior Sambia se bat actuellement contre la maladie pour rester en vie. Et si les proches du milieu de terrain de Montpellier se montrent optimistes à son sujet, tout le monde attend avec impatience des no… [+4006 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": null, "title": "Geler les classements au soir de la 28e journée et une L1 à 22 clubs : notre solution idéale - Eurosport - FRANCE (FR)", "description": "FC STREAM TEAM - Dans notre émission hebdomadaire, nos journalistes Martin Mosnier et Maxime Dupuis ont évoqué leur solution si la L1 ne s'achevait pas en raison de la pandémie de Coronavirus. Quand faudrait-il arrêter le championnat ? Qui faudrait-il qualifi…", "url": "https://www.eurosport.fr/football/ligue-1/2018-2019/geler-les-classements-au-soir-de-la-28e-journee-et-une-l1-a-22-clubs--notre-solution-ideale_vid1311459/video.shtml", "urlToImage": null, "publishedAt": "2020-04-25T13:58:12Z", "content": "Football\r\nFC STREAM TEAM - Dans notre émission hebdomadaire, nos journalistes Martin Mosnier et Maxime Dupuis ont évoqué leur solution si la L1 ne s'achevait pas en raison de la pandémie de Coronavirus. Quand faudrait-il arrêter le championnat ? Qui faudrait-… [+47 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Fusion ATP/WTA : Dirk Hordoff est contre l'idée de Roger Federer - Tennis - ATP/WTA - L'Équipe.fr", "description": "Pour le vice-président de la fédération allemande de tennis, la fusion entre l'ATP et la WTA évoquée par Roger Federer lui semble une très mauvaise idée.", "url": "https://www.lequipe.fr/Tennis/Actualites/Fusion-atp-wta-dirk-hordoff-est-contre-l-idee-de-roger-federer/1129711", "urlToImage": null, "publishedAt": "2020-04-25T13:49:10Z", "content": "Le vice-président de la fédération allemande de tennis, Dirk Hordorff, a ouvertement critiqué la proposition de Roger Federer de fusionner l'ATP et la WTA : « C'est une idée à court terme, et ce n'est pas suffisant. La fusion de l'ATP et de la WTA ne résoudra… [+267 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Guillaume Issner", "title": "Chelsea : finalement pas de baisse des salaires pour les joueurs - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a3809579051356298061-chelsea-finalement-pas-de-baisse-des-salaires-pour-les-joueurs", "urlToImage": null, "publishedAt": "2020-04-25T13:38:11Z", "content": "Rebondissement dans le dossier de la baisse des salaires à Chelsea. Alors que le Daily Mail annonçait la semaine passée un accord entre la direction et les joueurs pour une réduction de 10% des émoluments sur les quatre prochains mois, l'initiative n'aura fin… [+675 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Yannick Sagorin", "title": "Aulas, des recours « sans fondement juridique » - Sports.fr", "description": "Le président Aulas a brandi la menace de recours juridiques si toutefois l’OL était écarté de la scène européenne la saison prochaine. Au regard du droit, toute procédure serait cependant vaine selon l’avocat Thierry Granturco. L’UEFA a insisté jeudi sur la n…", "url": "https://www.sports.fr/football/aulas-recours-fondement-juridique-349566.html", "urlToImage": null, "publishedAt": "2020-04-25T13:38:00Z", "content": "Le président Aulas a brandi la menace de recours juridiques si toutefois lOL était écarté de la scène européenne la saison prochaine. Au regard du droit, toute procédure serait cependant vaine selon lavocat Thierry Granturco.\r\nLUEFA a insisté jeudi sur la not… [+3339 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "A.C.", "title": "Mercato - Real Madrid : Ça se confirme pour Paul Pogba ! - Le 10 Sport", "description": "Zinedine Zidane, coach du Real Madrid, devra bel et bien faire face à un obstacle de taille pour Paul Pogba.", "url": "https://le10sport.com/football/mercato/mercato-real-madrid-ca-se-confirme-pour-paul-pogba-501079", "urlToImage": null, "publishedAt": "2020-04-25T13:30:00Z", "content": "Foot - Mercato - Real Madrid\r\nPublié le 25 avril 2020 à 15h30 par A.C. Zinedine Zidane, coach du Real Madrid, devra bel et bien faire face à un obstacle de taille pour Paul Pogba. \r\nOù jouera Paul Pogba la saison prochaine ? Tout portait à croire que le Franç… [+799 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Coronavirus : une reprise de la Premier League le 8 juin ? - Foot - ANG - Coronavirus - L'Équipe.fr", "description": "D'après le journal britannique The Times, le Championnat d'Angleterre pourrait redémarrer le 8 juin et s'achever le 27 juillet.", "url": "https://www.lequipe.fr/Football/Actualites/Coronavirus-une-reprise-de-la-premier-league-le-8-juin/1129704", "urlToImage": null, "publishedAt": "2020-04-25T13:04:46Z", "content": "Leur « restart project », proposé avec le soutien de plusieurs actionnaires de club, prévoit un maximum de 400 personnes par stade, obligatoirement testées négatives au virus pour pouvoir être présentes dans des enceintes elles-mêmes soigneusement sélectionné… [+114 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": null, "title": "Football : finalement, Olivier Giroud va prolonger son séjour à Chelsea - Le Monde", "description": "Le club anglais a décidé de prolonger d’un an, jusqu’à juin 2021, le contrat de l’international français.", "url": "https://www.lemonde.fr/sport/article/2020/04/25/football-finalement-olivier-giroud-prolonge-son-sejour-a-chelsea_6037765_3242.html", "urlToImage": null, "publishedAt": "2020-04-25T12:55:03Z", "content": "Olivier Giroud célébrant un but lors dun match amical France-Paraguay le 2 juin 2017 à Rennes. FRANCK FIFE / AFP\r\nFinalement, il reste. Et prolonge même son bail. Olivier Giroud continuera de jouer à Chelsea jusquen juin 2021. La direction du club anglais de … [+2835 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Coronavirus : le Championnat de Pologne devrait reprendre fin mai - Foot - POL - Coronavirus - L'Équipe.fr", "description": "Le Premier ministre polonais Mateusz Morawiecki a annoncé un probable redémarrage de l'élite polonaise le 29 mai.", "url": "https://www.lequipe.fr/Football/Actualites/Coronavirus-le-championnat-de-pologne-devrait-reprendre-fin-mai/1129700", "urlToImage": null, "publishedAt": "2020-04-25T12:36:45Z", "content": "Le Championnat de football de Pologne, suspendu à cause de la pandémie de coronavirus, devrait reprendre le 29 mai en l'absence de public, a annoncé samedi le Premier ministre polonais Mateusz Morawiecki. « Nous avons un plan précis pour arriver au premier ma… [+587 chars]"}, {"source": {"id": null, "name": "Sportune.fr"}, "author": null, "title": "OM - Combien ça coûte de recruter Jimmy Cabot (FC Lorient) ? - Sportune.fr, le spécialiste de l'économie du sport business", "description": "Contraint d'oeuvrer à moindre frais, l'OM doit restreindre le champ de ses recherches à des joueurs peu voire plus valorisés sur le marché, pour recruter", "url": "https://www.sportune.fr/business/om-combien-ca-coute-de-recruter-jimmy-cabot-fc-lorient-233532", "urlToImage": null, "publishedAt": "2020-04-25T12:00:00Z", "content": "25 avril 2020 à 14:00 par Thomas\r\n0\r\nL’OM suit Jimmy Cabot qui sera bientôt en fin de contrat, avec le FC Lorient.\r\nContraint d’oeuvrer à moindre frais, l’OM doit restreindre le champ de ses recherches à des joueurs peu voire plus valorisés sur le marché, pou… [+1543 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "PSG : Neymar au Barça, Tebas fait enfin plaisir à Paris - Foot01.com", "description": "Habitué à tacler le Paris Saint-Germain, Javier Tebas a cette fois apporté une excellente nouvelle au club de la capitale. Selon lui, Neymar n’a aucune chance de revenir au FC Barcelone cet été.\r\nPendant que la presse madrilène se concentre sur le feuilleton…", "url": "https://www.foot01.com/equipe/paris/psg-neymar-au-barca-tebas-fait-enfin-plaisir-a-paris,347941", "urlToImage": null, "publishedAt": "2020-04-25T11:31:02Z", "content": "Habitué à tacler le Paris Saint-Germain, Javier Tebas a cette fois apporté une excellente nouvelle au club de la capitale. Selon lui, Neymar na aucune chance de revenir au FC Barcelone cet été.\r\nPendant que la presse madrilène se concentre sur le feuilleton K… [+1266 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Manchester United - Neville : \"Sancho est loin d'Aguero, Higuain, Messi ou Di Maria\" - Goal.com", "description": "If the Bundesliga season got back underway tomorrow, RB Leipzig would be ready - according to U.S. national team midfielder Tyler Adams.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T11:16:00Z", "content": "More"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "ASSE : Offrir un ticket européen à Lyon, Caïazzo tousse - Foot01.com", "description": "L'AS Saint-Etienne ne pourra pas offrir le stade de France au Peuple Vert, mais priver l'OL d'un ticket européen sera un vrai plaisir.\r\nCe samedi 25 avril 2020 devait être une date marquante dans la longue histoire de l’AS Saint-Etienne, puisque les Verts…", "url": "https://www.foot01.com/equipe/st-etienne/asse-offrir-un-ticket-europeen-a-lyon-caiazzo-tousse,347939", "urlToImage": null, "publishedAt": "2020-04-25T11:08:55Z", "content": "L'AS Saint-Etienne ne pourra pas offrir le stade de France au Peuple Vert, mais priver l'OL d'un ticket européen sera un vrai plaisir.\r\nCe samedi 25 avril 2020 devait être une date marquante dans la longue histoire de lAS Saint-Etienne, puisque les Verts deva… [+1421 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Ziyech ne digère pas pour le titre / Pays-Bas / Ajax / SOFOOT.com - SO FOOT", "description": "Hakim ne sera pas suprême leader, cette saison. À égalité de points avec l'AZ Alkmaar mais premier d'Eredivise grâce à la différence de buts, ...", "url": "https://www.sofoot.com/hakim-ziyech-ne-digere-pas-que-le-titre-passe-sous-le-nez-de-l-ajax-amsterdam-482662.html", "urlToImage": null, "publishedAt": "2020-04-25T11:00:00Z", "content": "Hakim ne sera pas suprême leader, cette saison.À égalité de points avec l'AZ Alkmaar mais premier d'Eredivise grâce à la différence de buts, l'Ajax Amsterdam ne sera pas sacré champion. Le championnat hollandais a définitivement été interrompu, et c'est le sc… [+1082 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Expulsé pendant le Tournoi, Haouas a purgé sa suspension pendant le confinement - Le Figaro", "description": "Expulsé lors de la rencontre du Tournoi Ecosse-France le 8 mars dernier pour un coup de poing sur le deuxième ligne du XV au Chardon Jamie Ritchie, Mohamed Haouas avait écopé d'une suspension de trois semaines. Bonne nouvelle pour le joueur de Montpellier : c…", "url": "https://sport24.lefigaro.fr/rugby/top-14/fil-info/expulse-pendant-le-tournoi-haouas-a-purge-sa-suspension-pendant-le-confinement-1000260", "urlToImage": null, "publishedAt": "2020-04-25T10:46:00Z", "content": "Expulsé lors de la rencontre du Tournoi Ecosse-France le 8 mars dernier pour un coup de poing sur le deuxième ligne du XV au Chardon Jamie Ritchie, Mohamed Haouas avait écopé d'une suspension de trois semaines. Bonne nouvelle pour le joueur de Montpellier : c… [+746 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Yannick Sagorin", "title": "Ce qu’ont versé Canal+ et beIN Sports à la LFP - Sports.fr", "description": "Les groupes Canal+ et beIN Sports ont obtenu une belle ristourne auprès de la LFP pour les matches de championnat déjà diffusés. Les négociations des présidents Nasser al-Khelaïfi (PSG), Jacques-Henri Eyraud (OM), Olivier Sadran (Toulouse) et Jean-Pierre Rivè…", "url": "https://www.sports.fr/football/quont-verse-canal-bein-sports-a-lfp-349556.html", "urlToImage": null, "publishedAt": "2020-04-25T10:44:47Z", "content": "Les groupes Canal+ et beIN Sports ont obtenu une belle ristourne auprès de la LFP pour les matches de championnat déjà diffusés.\r\nLes négociations des présidents Nasser al-Khelaïfi (PSG), Jacques-Henri Eyraud (OM), Olivier Sadran (Toulouse) et Jean-Pierre Riv… [+857 chars]"}, {"source": {"id": null, "name": "Paddock-gp.com"}, "author": null, "title": "MotoGP : Valentino Rossi va devoir se décider sans avoir fait de courses et voilà ce qu'il compte faire - Media Service", "description": "Valentino Rossi fait le point sur la suite de sa carrière...", "url": "https://www.paddock-gp.com/motogp-valentino-rossi-va-devoir-se-decider-sans-avoir-fait-de-courses-et-voila-ce-quil-compte-faire/", "urlToImage": null, "publishedAt": "2020-04-25T10:27:09Z", "content": "Dans un entretien organisé par Yamaha et avec son équipier Maverick Vinales, Valentino Rossi a parlé de sa situation générale dans cette conjoncture particulière du confinement imposé par les affres du Coronavirus, mais aussi du cas particulier de la suite de… [+1577 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "OL : Entre Lyon et Kalulu, ça sent le déconfinement compliqué - Foot01.com", "description": "En discussions avec Pierre Kalulu pour la signature d’un premier contrat professionnel, l’Olympique Lyonnais rencontre certains obstacles dont le Bayern Munich fait partie.\r\nPlus que jamais, le marché des tout jeunes joueurs est à la mode. Sans parler…", "url": "https://www.foot01.com/equipe/ol/ol-entre-lyon-et-kalulu-ca-sent-le-deconfinement-complique,347919", "urlToImage": null, "publishedAt": "2020-04-25T10:06:32Z", "content": "En discussions avec Pierre Kalulu pour la signature dun premier contrat professionnel, lOlympique Lyonnais rencontre certains obstacles dont le Bayern Munich fait partie.\r\nPlus que jamais, le marché des tout jeunes joueurs est à la mode. Sans parler du contex… [+1217 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/marc.alvarez1", "title": "Kehrer préfère étudier et faire travailler son cerveau aux écrans - Canal Supporters", "description": "Jeune père confiné en Allemagne, Thilo Kehrer (23 ans) est un professionnel au profil un peu inhabituel. Pendant la suspension des...", "url": "https://canal-supporters.com/2020/04/kehrer-prefere-etudier-et-faire-travailler-son-cerveau-aux-ecrans/", "urlToImage": null, "publishedAt": "2020-04-25T10:03:06Z", "content": "Jeune père confiné en Allemagne, Thilo Kehrer (23 ans) est un professionnel au profil un peu inhabituel. Pendant la suspension des compétitions liée à la pandémie de Covid-19, le défenseur du PSG ne lâche pas les études de management via l’Université Lunex au… [+2135 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Alkiviades David se positionne sur le naming du Camp Nou - SO FOOT", "description": "La course est lancée. Pour la toute première fois de son histoire, le FC Barcelone a annoncé vouloir recourir au procédé du naming concernant ...", "url": "https://www.sofoot.com/alkiviades-david-se-positionne-deja-sur-le-naming-du-camp-nou-482660.html", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": "La course est lancée. Pour la toute première fois de son histoire, le FC Barcelone a annoncé vouloir recourir au procédé du naming concernant son Camp Nou afin d'engendrer des fonds pour lutter contre le Covid-19. Avec un premier candidat d'ores et déjà intér… [+874 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Les Herbiers : que sont devenus les finalistes de la Coupe de France 2018 face au PSG ? - Foot - Coupe - Les Herbiers - L'Équipe.fr", "description": "Deux ans après la finale de Coupe de France perdue par le club vendéen face au PSG (0-2), retour sur les trajectoires empruntées par les protagonistes de l'épopée.", "url": "https://www.lequipe.fr/Football/Actualites/Les-herbiers-que-sont-devenus-les-finalistes-de-la-coupe-de-france-2018-face-au-psg/1129404", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": "Ils devaient se retrouver à la fin du mois de mai pour fêter les 70 ans du club. En raison de la pandémie de Covid-19, les Herbretais ne pourront pas célébrer de nouveau leur exploit mais ils ont, de toute façon, laissé une trace. C'était il y a deux ans : co… [+10018 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "A.D.", "title": "Mercato - Juventus : Cristiano Ronaldo aurait pris une décision pour son avenir ! - Le 10 Sport", "description": "Alors qu'un retour au Real Madrid a été évoqué dernièrement, Cristiano Ronaldo n'aurait pas du tout l'intention de quitter la Juventus. La star portugaise aimerait aller au bout de son contrat avec…", "url": "https://le10sport.com/football/mercato/mercato-juventus-ronaldo-aurait-pris-une-decision-radicale-pour-son-avenir-501059", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": "Foot - Mercato - Juventus\r\nPublié le 25 avril 2020 à 12h00 par A.D. Alors qu'un retour au Real Madrid a été évoqué dernièrement, Cristiano Ronaldo n'aurait pas du tout l'intention de quitter la Juventus. La star portugaise aimerait aller au bout de son contra… [+1001 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Bixente Lizarazu : « En 1998, on avait un mutant, Zinédine Zidane » - Foot - CM - Bleus - L'Équipe.fr", "description": "Dans le cadre d'un échange avec les abonnés de L'Équipe, Bixente Lizarazu a fait un comparatif entre les Bleus de 1998 et ceux de 2018.", "url": "https://www.lequipe.fr/Football/Actualites/Bixente-lizarazu-en-1998-on-avait-un-mutant-zinedine-zidane/1129667", "urlToImage": null, "publishedAt": "2020-04-25T09:55:01Z", "content": "Dans le cadre d'un échange avec les abonnés de L'Équipe jeudi, Bixente Lizarazu s'est lancé dans un comparatif entre l'équipe de France 1998 et celle de 2018, toutes les deux championnes du monde. « On était plus forts en défense, on était plus expérimentés. … [+137 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "OM : Eyraud paye les employés de sa poche à Marseille ! - Foot01.com", "description": "Voilà une révélation surprenante qui démontre qu’à l’OM, malgré les difficultés financières, les petits salaires ne sont pas à l’abandon.\r\n Parmi les premières mesures prises par les clubs face à l’arrêt des matchs et donc de nombreuses rentrées d’argent…", "url": "https://www.foot01.com/equipe/marseille/om-eyraud-paye-les-employes-de-sa-poche-a-marseille,347899", "urlToImage": null, "publishedAt": "2020-04-25T09:31:15Z", "content": "Voilà une révélation surprenante qui démontre quà lOM, malgré les difficultés financières, les petits salaires ne sont pas à labandon.\r\n Parmi les premières mesures prises par les clubs face à larrêt des matchs et donc de nombreuses rentrées dargent, lensembl… [+1437 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Programme TV du samedi 25 avril : que regarder en sport à la télé ? - Tous sports - L'Équipe.fr", "description": "Retrouvez le meilleur des programmes de sport à suivre à la télé ce samedi 25 avril.", "url": "https://www.lequipe.fr/Medias/Actualites/Programme-tv-du-samedi-25-avril-que-regarder-en-sport-a-la-tele/1129569", "urlToImage": null, "publishedAt": "2020-04-25T09:30:00Z", "content": "Pendant la période de confinement, L'Équipe vous propose, chaque jour, une sélection de quelques programmes sportifs à suivre sur les chaînes de télé françaises. Retrouvez notamment, sur la chaîne L'Équipe, à partir de 13 heures, la 8e étape du Tour de France… [+1488 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "En pleine gloire avec le Barça en 2009, Andrés Iniesta «a pensé au suicide» - Le Figaro", "description": "LE SCAN SPORT - Alors qu'il était au sommet avec le club espagnol à l'issue d'une saison 2008-2009 couronnée de succès, le milieu de terrain a avoué avoir souffert d'une sévère dépression pendant plusieurs mois.", "url": "https://sport24.lefigaro.fr/scan-sport/actualites/en-pleine-gloire-avec-le-barca-iniesta-a-pense-au-suicide-1000247", "urlToImage": null, "publishedAt": "2020-04-25T09:24:00Z", "content": "LE SCAN SPORT - Alors qu'il était au sommet avec le club espagnol à l'issue d'une saison 2008-2009 couronnée de succès, le milieu de terrain a avoué avoir souffert d'une sévère dépression pendant plusieurs mois.On peut être un des plus grands footballeur de l… [+2821 chars]"}, {"source": {"id": null, "name": "Sudouest.fr"}, "author": "Sud Ouest", "title": "Pro D2 / Stade Montois Rugby : plusieurs départs de joueurs et une arrivée - Sud Ouest", "description": "Le départ de huit joueurs est déjà acquis, alors que le jeune Simon Desaubies va être prêté au club landais par Bordeaux-Bègles", "url": "https://www.sudouest.fr/2020/04/24/pro-d2-stade-montois-rugby-plusieurs-departs-de-joueurs-et-une-arrivee-7437638-4567.php", "urlToImage": null, "publishedAt": "2020-04-25T08:41:53Z", "content": "Alors que la saison de Pro D2 est définitivement terminée pour lui, le Stade Montois s’est muré dans le silence. Tant au sujet de ses entraîneurs David Auradou et David Darricarrère, qui se dirigent vers un départ anticipé, que de son effectif.\r\n&gt;&gt; Retr… [+1128 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Max Franco Sanchez", "title": "Arsenal : les prétendants d'Aubameyang se frottent les mains - Foot Mercato", "description": "Selon la presse britannique, le club de la capitale anglaise pourrait être contraint de vendre son attaquant vedette au rabais lors du prochain mercato.", "url": "https://www.footmercato.net/a8421960661787500460-arsenal-les-pretendants-daubameyang-se-frottent-les-mains", "urlToImage": null, "publishedAt": "2020-04-25T08:16:29Z", "content": "Si la crise financière liée à l'arrêt total du football frappe tous les clubs sans exception, certains sont forcément plus touchés que d'autres. En Espagne par exemple, le Real Madrid semble s'en sortir bien mieux que ses rivaux, le FC Barcelone et l'Atlético… [+2294 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Coronavirus : les joueurs d'Amiens ont été testés vendredi - Foot - Coronavirus - Amiens - L'Équipe.fr", "description": "Les joueurs d'Amiens ont effectué des tests PCR et sérologiques dans le cadre d'une prochaine reprise de l'entraînement.", "url": "https://www.lequipe.fr/Football/Actualites/Coronavirus-les-joueurs-d-amiens-ont-ete-testes-vendredi/1129652", "urlToImage": null, "publishedAt": "2020-04-25T08:07:13Z", "content": "En cours d'élaboration avec la Commission médicale de la FFF et les médecins des clubs professionnels, un protocole prévoit un retour des joueurs au centre d'entraînement la semaine du 11 mai pour effectuer un bilan médical complet (cardiologique, virologique… [+76 chars]"}, {"source": {"id": null, "name": "Onzemondial.com"}, "author": "La rédaction", "title": "PSG - ASSE : \"J'aurais préféré jouer contre un autre club\", Rocheteau raconte la finale d... - Onze Mondial", "description": "Alors que la finale 2020 aurait dû se jouer ce soir, Dominique Rocheteau se rappelle de sa victoire en 1982", "url": "http://www.onzemondial.com/ligue-1/2019-2020/psg-asse-j-aurais-prefere-jouer-contre-un-autre-club-rocheteau-raconte-la-finale-de-1982-216460", "urlToImage": null, "publishedAt": "2020-04-25T08:01:35Z", "content": "Zapping Onze Mondial Real Madrid : Federico Valverde, joueur clé du milieu de terrain ?\r\nC'était il y a presque 40 ans maintenant. En 1982, Dominique Rocheteau affronte son club de coeur de l'AS Saint-Etienne avec le Paris Saint-Germain, en finale de Coupe de… [+1267 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Meunier, destination Tottenham ? / France / PSG / SOFOOT.com - SO FOOT", "description": "Même pas peur du Brexit. Alors que son contrat expire au mois de juin prochain, Thomas Meunier a maintes fois clamé son désir de rester au ...", "url": "https://www.sofoot.com/thomas-meunier-destination-tottenham-pour-le-lateral-du-paris-saint-germain-482646.html", "urlToImage": null, "publishedAt": "2020-04-25T08:00:00Z", "content": "Même pas peur du Brexit. Alors que son contrat expire au mois de juin prochain, Thomas Meunier a maintes fois clamé son désir de rester au PSG. Mais malgré des convoitises d'autres clubs européens, le staff parisien tarde à le prolonger. \r\nAprès le Borussia D… [+445 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Max Franco Sanchez", "title": "Coronavirus : le FC Barcelone est prêt à défier la Liga ! - Foot Mercato", "description": "Le club catalan pourrait bien refuser de rejouer cette saison selon les informations publiées de l'autre côté des Pyrénées ce week-end.", "url": "https://www.footmercato.net/a4824490865944862132-coronavirus-le-fc-barcelone-est-pret-a-defier-la-liga", "urlToImage": null, "publishedAt": "2020-04-25T07:38:49Z", "content": "« Si un club refuse de jouer ? Il aura un dossier disciplinaire, et celui à la fédération. Quand ils (les pouvoirs publics) nous donnent l'ordre de pouvoir jouer et qu'il y en a un qui ne veut pas jouer, c'est comme une absence. Ils resteront chez eux. Vous n… [+2406 chars]"}, {"source": {"id": null, "name": "Maxifoot.fr"}, "author": null, "title": "Barça : Setién sait comment relancer Coutinho - Maxifoot", "description": "Trop irrégulier pendant son prêt au Bayern Munich cette saison, Philippe Coutinho ne sera pas conservé. Une mauvaise nouvelle pour les dirig ...", "url": "http://www.maxifoot.fr/football/article-43523.htm", "urlToImage": null, "publishedAt": "2020-04-25T07:14:00Z", "content": "Trop irrégulier pendant son prêt au Bayern Munich cette saison, Philippe Coutinho ne sera pas conservé. Une mauvaise nouvelle pour les dirigeants du FC Barcelone qui souhaitent s'en séparer. Mais pas forcément pour l'entraîneur Quique Setién, persuadé de pouv… [+2743 chars]"}, {"source": {"id": null, "name": "Rugbyrama.fr"}, "author": "Rugbyrama", "title": "Coupe d’Europe : les finales le 17 et 18 octobre prochain ? - Rugbyrama.fr", "description": "L’EPCR, l’instance qui organise les Coupe d’Europe de rugby a planché sur un nouveau calendrier de fin de compétition de la saison 2019-2020 à l’automne prochain.", "url": "https://www.rugbyrama.fr/rugby/champions-cup/2019-2020/coupe-deurope-les-finales-le-17-et-18-octobre-prochain_sto7734390/story.shtml", "urlToImage": null, "publishedAt": "2020-04-25T07:03:38Z", "content": "Les quarts de finales pourraient être joués le weekend du 12 et 13 septembre, les demies quinze jours plus tard et les finales (de Challenge Cup et Champions Cup) les 17 et 18 octobre prochain.\r\nCes rencontres étaient programmées initialement le 23 et 23 mai … [+351 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Oriane Alcarini", "title": "Hugo Lloris confiné avec ses trois enfants, \"une source d'évasion\" - Pure People", "description": "Hugo Lloris (33 ans) a raconté son confinement au \"Parisien\", le 23 avril 2020. Le footballeur français dit s'occuper activement de sa petite famille, lui qui est papa d'un tout jeune Léandro (7 mois).", "url": "https://www.purepeople.com/article/hugo-lloris-confine-avec-ses-trois-enfants-une-source-d-evasion_a385670/1", "urlToImage": null, "publishedAt": "2020-04-25T06:45:00Z", "content": "Au cours d'un long entretien accordé au Parisien, Hugo Lloris s'est confié sur son confinement, qu'il vit à Londres et en famille. Le capitaine des Bleus s'agace d'abord de se faire narguer par un merveilleux ciel bleu. \"En huit ans à Londres, je n'ai jamais … [+1611 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Vincent Bregevin", "title": "Saga Bulls, conciergerie de luxe, MotoGP et Juventus : Le plateau du jour - Eurosport - FRANCE (FR)", "description": "Bulls, Pogba, Mercato, MotoGP, Ligue 1... le plateau du jour tombe à point nommé pour bien démarrer le week-end.", "url": "https://www.eurosport.fr/omnisport/saga-bulls-conciergerie-de-luxe-motogp-et-juventus-le-plateau-du-jour_sto7734383/story.shtml", "urlToImage": null, "publishedAt": "2020-04-25T06:44:48Z", "content": "De la fin de notre saga consacrée aux Chicago Bulls à un gros plan sur le mercato de la Juventus Turin, en passant par une interview de Jordan Veretout ou notre reportage sur les demandes parfois extravagantes des sportifs, entre autres, à une conciergerie de… [+6626 chars]"}, {"source": {"id": null, "name": "Basketusa.com"}, "author": "Fabrice Auclert", "title": "Draft 2020 : le Français Yves Pons va tester sa cote - BasketUSA", "description": "Meilleur défenseur de sa conférence, l'ailier de Tennessee s'est inscrit à la Draft 2020 mais il se donne la possibilité de faire marche arrière.", "url": "https://www.basketusa.com/news/593880/draft-2020-le-francais-yves-pons-va-tester-sa-cote/", "urlToImage": null, "publishedAt": "2020-04-25T06:40:01Z", "content": "Élu « Defensive Player of the Year » de la SEC, Yves Pons (1m98, 21 ans) annonce à nos confrères d’Envergure qu’il s’est inscrit à la Draft, mais qu’il se laisse la possibilité d’effectuer sa quatrième et dernière année à Tennessee. \r\nEn clair, l’ailier franç… [+376 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "L'UFC annonce une soirée de combats à Jacksonville le 9 mai à huis clos - MMA - UFC - L'Équipe.fr", "description": "L'Ultimate Fighting Championship (UFC) a officiellement annoncé vendredi la tenue de l'UFC 249, le 9 mai prochain dans la Veterans Memorials Arena de Jacksonville. Les combats se dérouleront à huis clos.", "url": "https://www.lequipe.fr/Mma/Actualites/L-ufc-annonce-une-soiree-de-combats-a-jacksonville-le-9-mai-a-huis-clos/1129627", "urlToImage": null, "publishedAt": "2020-04-25T06:30:46Z", "content": "Après plusieurs tentatives infructueuses pour organiser des combats en pleine pandémie de coronavirus, l'UFC, la plus importante ligue professionnelle de MMA, a annoncé vendredi la tenue d'une soirée à huis clos, le 9 mai prochain en Floride. L'UFC 249 se tie… [+1941 chars]"}, {"source": {"id": null, "name": "Basketsession.com"}, "author": "BasketSession.com - Le meilleur de la NBA : news, rumeurs, vidéos, analyses", "title": "NEWS Dwyane Wade se souvient quand il a gagné le respect de Kobe Bryant - BasketSession", "description": "A l'occasion d'un live sur Instagram, l'ancien joueur du Miami Heat Dwyane Wade a partagé une anecdote concernant Kobe Bryant.", "url": "https://www.basketsession.com/actu/dwyane-wade-respect-kobe-bryant-544674/", "urlToImage": null, "publishedAt": "2020-04-25T06:30:04Z", "content": "Tragiquement disparu en janvier dernier, Kobe Bryant représentait une véritable source d'inspiration en NBA. Plusieurs joueurs, au moment d'arriver dans cette Ligue, avaient l'ambition de gagner son respect. Et c'était notamment le cas de Dwyane Wade. A l'occ… [+1192 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "\"Les années à venir du sport féminin ne vont pas être sympathiques\" : les sportives redoutent de subir les premières les conséquences du coronavirus - franceinfo", "description": "", "url": "https://www.francetvinfo.fr/sante/maladie/coronavirus/les-annees-a-venir-du-sport-feminin-ne-vont-pas-etre-sympathiques-les-sportives-redoutent-de-subir-les-premiers-les-consequences-du-coronavirus_3932703.html", "urlToImage": null, "publishedAt": "2020-04-25T06:24:41Z", "content": "Avec son lot dannulations de compétitions, de baisse des salaires ou de partenaires qui rompent leurs contrats publicitaires, clubs féminins et sportives craignent dêtre les premiers à payer les pots cassés.\r\nLes conséquences de la crise du coronavirus Covid-… [+2625 chars]"}, {"source": {"id": null, "name": "Nextgen-auto.com"}, "author": "Emmanuel Touzot", "title": "Leclerc : Ce serait bien de courir contre Verstappen en ligne - Nextgen-Auto.com", "description": "Formule 1 | Charles Leclerc court avec six autres pilotes lors des courses officielles virtuelles de la F1, et d'autres devraient rejoindre le groupe, mais (...)", "url": "https://motorsport.nextgen-auto.com/fr/formule-1/leclerc-ce-serait-bien-de-courir-contre-verstappen-en-ligne,148020.html", "urlToImage": null, "publishedAt": "2020-04-25T06:12:00Z", "content": "Charles Leclerc court avec six autres pilotes lors des courses officielles virtuelles de la F1, et d’autres devraient rejoindre le groupe, mais Max Verstappen n’en fera pas partie, bien qu’il soit un aficionado des compétitions en ligne.\r\n\"Je ne sais pas trop… [+1147 chars]"}, {"source": {"id": null, "name": "Creusot-infos.com"}, "author": null, "title": "RUGBY : Le Creusot a refusé de monter en Fédérale 1 - Creusot-infos.com", "description": "", "url": "https://www.creusot-infos.com/news/sport/rugby/rugby-le-creusot-a-refuse-de-monter-en-federale-1.html", "urlToImage": null, "publishedAt": "2020-04-25T01:17:00Z", "content": null}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "Th.B.", "title": "Mercato - PSG : Mourinho aurait pris une grande décision pour Ndombele… - Le 10 Sport", "description": "Le PSG et le FC Barcelone s’intéresseraient au profil de Tanguy Ndombele. Entraîneur de Tottenham, José Mourinho n’aurait nullement l’intention de témoigner du départ de l’intention français, comme…", "url": "https://le10sport.com/football/mercato/mercato-psg-mourinho-aurait-pris-une-grande-decision-pour-ndombele-501025", "urlToImage": null, "publishedAt": "2020-04-24T23:45:00Z", "content": "Publié le 25 avril 2020 à 1h45 par Th.B. Le PSG et le FC Barcelone sintéresseraient au profil de Tanguy Ndombele. Entraîneur de Tottenham, José Mourinho naurait nullement lintention de témoigner du départ de lintention français, comme le 10 Sport vous le révé… [+1358 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Guillaume Maillard-Pacini", "title": "Serie A - Jordan Veretout : \"Il ne faudra pas jouer avec notre santé\" - Eurosport - FRANCE (FR)", "description": "SERIE A - Confiné chez lui avec sa compagne et ses deux enfants depuis maintenant six semaines, Jordan Veretout a accepté de se confier longuement à Eurosport.", "url": "https://www.eurosport.fr/football/serie-a/2019-2020/serie-a-jordan-veretout-rome-c-est-comme-une-ville-morte_sto7733133/story.shtml", "urlToImage": null, "publishedAt": "2020-04-24T22:03:30Z", "content": "En Italie, le confinement a été décrété le 9 mars dernier. Comment le vivez-vous ?\r\nJordan Veretout : C'est un peu long. Je suis avec ma famille et tout le monde est en bonne santé, c'est le principal. Mais c'est certain que la vie d'avant me manque. On espèr… [+6160 chars]"}, {"source": {"id": null, "name": "Football365.fr"}, "author": "Rédaction", "title": "Pays-Bas : un club dénonce « le plus gros scandale de l’histoire » - Football365", "description": "La décision des instances néerlandaises de geler la saison d'Eredivisie a engendré de multiples réactions aux Pays-Bas.", "url": "https://www.football365.fr/saison-annulee-aux-pays-bas-un-club-denonce-le-plus-gros-scandale-de-lhistoire-9821276.html", "urlToImage": null, "publishedAt": "2020-04-24T21:40:02Z", "content": "Pour la première fois depuis 1945, une saison d’Eredivisie sera annulée. Les instances néerlandaises ont acté cette décision ce vendredi, quelques jours après avoir annoncé que le championnat n’irait pas à son terme. Cette décision a évidemment engendré de mu… [+904 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "De nouvelles mesures économiques en faveur du sport - Tous sports - L'Équipe.fr", "description": "A l'issue d'une réunion avec d'autres ministres et divers acteurs du sport, ce vendredi, Roxana Maracineanu a annoncé de nouvelles mesures d'accompagnement pour le secteur.", "url": "https://www.lequipe.fr/Tous-sports/Actualites/De-nouvelles-mesures-economiques-en-faveur-du-sport/1129608", "urlToImage": null, "publishedAt": "2020-04-24T21:27:04Z", "content": "Alors que les inquiétudes se sont renforcées ces derniers jours face à la crise économique générée par l'épidémie de Covid-19, la ministre des Sports Roxana Maracineanu a annoncé dans un tweet, ce vendredi soir, de nouvelles mesures d'accompagnement du secteu… [+577 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "Covid-19 : Gardez vos salaires, Roy Keane dénonce l'arnaque - Foot01.com", "description": "Confrontés à d’énormes pertes financières pendant la crise sanitaire, les clubs négocient des baisses de salaire avec leurs joueurs. Une initiative qui agace l’ancien Mancunien Roy Keane.\r\nEn difficulté sur le plan financier, de nombreux clubs ne se contenten…", "url": "https://www.foot01.com/foot-europeen/covid-19-gardez-vos-salaires-roy-keane-denonce-l-arnaque,347911", "urlToImage": null, "publishedAt": "2020-04-24T21:09:46Z", "content": "Confrontés à dénormes pertes financières pendant la crise sanitaire, les clubs négocient des baisses de salaire avec leurs joueurs. Une initiative qui agace lancien Mancunien Roy Keane.\r\nEn difficulté sur le plan financier, de nombreux clubs ne se contentent … [+1255 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "Equipe de France: Le malaise Gourcuff-Ribéry raconté de l'intérieur - RMC Sport", "description": "L'histoire de Yoann Gourcuff en équipe de France a notamment été marquée par sa relation houleuse avec Franck Ribéry. Des rapports tendus sur lesquels s'est exprimé François Manardo, ancien chef de presse des Bleus, dans l'émission Rothen Régale ce vendredi.", "url": "https://rmcsport.bfmtv.com/football/equipe-de-france-le-malaise-gourcuff-ribery-raconte-de-l-interieur-1900414.html", "urlToImage": null, "publishedAt": "2020-04-24T20:21:15Z", "content": null}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Emilie FLORES", "title": "Tous en cuisine avec Cyril Lignac : Estelle Mossely et Tony Yoka dévoilent le sexe de leur second enfant en di - Télé Loisirs.fr", "description": "Invitée à cuisiner en direct avec Cyril Lignac sur M6, Estelle Mossely a dévoilé son baby bump et sa petite famille à l'antenne. Loin de garder le mystère autour de sa grossesse, la boxeuse a dévoilé le sexe de son second enfant.", "url": "https://www.programme-tv.net/news/people/253592-tous-en-cuisine-avec-cyril-lignac-estelle-mossely-et-tony-yoka-devoile-le-sexe-de-leur-second-enfant-en-direct/", "urlToImage": null, "publishedAt": "2020-04-24T18:06:48Z", "content": "Fille ou garçon ? Les fans de boxe ont enfin la réponse. Pour sa nouvelle recette de cuisine en direct sur M6, Cyril Lignac a décidé d'être accompagné d'une flopée de stars. En plus de son co-animateur Jérôme Anthony, Elodie Gossuin et le couple Estelle Mosse… [+1708 chars]"}, {"source": {"id": null, "name": "Topmercato.com"}, "author": null, "title": "Rennes : Camavinga retenu à tout prix si... - Top Mercato.com", "description": "Alors que le Real Madrid prépare son offensive pour Eduardo Camavinga et serait prêt à mettre 60 millions d'euros sur l...", "url": "http://www.topmercato.com/219572,1/rennes---camavinga-retenu-a-tout-prix-si---.html", "urlToImage": null, "publishedAt": "2020-04-24T18:02:00Z", "content": "Article lu 2550 fois - Rédigé le 24 avril 2020 à 20h02 par Romain Boselli"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "J.-G.D.", "title": "Mercato - ASSE : Puel s’enflamme pour cette nouvelle prolongation ! - Le 10 Sport", "description": "En réponse à la prolongation de Mahdi Camara jusqu'en 2024, Claude Puel ne tarit pas d'éloges à l'égard de son jeune milieu de terrain (21 ans).", "url": "https://le10sport.com/football/mercato/mercato-asse-puel-senflamme-pour-cette-nouvelle-prolongation-501027", "urlToImage": null, "publishedAt": "2020-04-24T17:40:00Z", "content": "Publié le 24 avril 2020 à 19h40 par J.-G.D. En réponse à la prolongation de Mahdi Camara jusqu'en 2024, Claude Puel ne tarit pas d'éloges à l'égard de son jeune milieu de terrain (21 ans).\r\nAprès WesleyFofana et CharlesAbi, lASSE vient de prolonger un troisiè… [+798 chars]"}, {"source": {"id": null, "name": "Football365.fr"}, "author": "Rédaction", "title": "Mercato : le prix que l’OL aurait fixé pour Houssem Aouar - Football365", "description": "Selon les informations de RMC, l'Olympique Lyonnais ne compterait pas céder son milieu de terrain Houssem Aouar à moins de 50 millions d'euros.", "url": "https://www.football365.fr/mercato-le-prix-que-lol-aurait-fixe-pour-houssem-aouar-9821186.html", "urlToImage": null, "publishedAt": "2020-04-24T16:46:58Z", "content": "Lancé dans le grand bain il y a deux ans et demi, Houssem Aouar est une valeur montante du championnat de France. Polyvalent, très propre techniquement, le milieu de terrain formé à l’OL dispose d’une marge de progression importante, notamment sur le plan de … [+806 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Avec l’arrêt de la lutte antidopage, l’inquiétude du sport grandit pour l’après Covid-19 - Le Figaro", "description": "Le confinement actuel laisse planer le risque d’une recrudescence du dopage en l’absence de contrôles. Inquiétant à un an des Jeux olympiques de Tokyo.", "url": "https://sport24.lefigaro.fr/athletisme/actualites/avec-l-arret-de-la-lutte-antidopage-l-inquietude-du-sport-grandit-pour-l-apres-covid-19-1000119", "urlToImage": null, "publishedAt": "2020-04-24T16:42:00Z", "content": "Le confinement actuel laisse planer le risque dune recrudescence du dopage en labsence de contrôles. Inquiétant à un an des Jeux olympiques de Tokyo.«Le bar nest pas ouvert!» Dans un entretien accordé à Europe 1 il y a une semaine, Olivier Niggli, le directeu… [+5209 chars]"}, {"source": {"id": null, "name": "Intensite.net"}, "author": null, "title": "EURE-ET-LOIR - Des excès de vitesse sur les routes euréliennes - Radio Intensité", "description": "Un automobiliste contrôlé en excès de vitesse ce vendredi après-midi à Friaize près de Champrond-en-Gâtine. L'homme, un habitant de la Seine-Saint-Denis, roulait à 160 km/h au lieu des 80 km/h régleme", "url": "https://intensite.net/2009/actu2020/eure-et-loir-des-exces-de-vitesse-sur-les-routes-eureliennes-314434", "urlToImage": null, "publishedAt": "2020-04-24T16:23:13Z", "content": "Pour adresser à Radio Intensité, un communiqué, un commentaire, une précision, ou une info, merci d'utiliser notre formulaire : ICI. ou adressez un mail à redaction@intensite.net.\r\nPour figurer dans notre agenda en ligne gratuitement, il suffit de nous adress… [+197 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Bundesliga : appel aux footballeurs pour qu'ils portent des masques en cas de reprise - Eurosport - FRANCE (FR)", "description": "BUNDESLIGA - Le gouvernement allemand souhaiterait que les joueurs portent des masques en cas de reprise des championnats", "url": "https://www.eurosport.fr/football/bundesliga/2019-2020/budesliga-appel-aux-footballeurs-pour-qu-ils-portent-des-masques-en-cas-de-reprise_sto7734092/story.shtml", "urlToImage": null, "publishedAt": "2020-04-24T15:22:48Z", "content": "BUNDESLIGA - Le ministère allemand du travail souhaite que les footballeurs portent des masques pour se protéger contre le coronavirus si le gouvernement d'Angela Merkel autorise une reprise des championnats en mai comme la Ligue le désire.\r\nLa Ligue allemand… [+2637 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Didier Lacroix (Stade Toulousain) : « Incroyable de reprendre par des phases finales » - Rugby - Top 14 - ST - L'Équipe.fr", "description": "Dans un rendez-vous fixé en ligne aux supporters du Stade Toulousain, le président Didier Lacroix a abordé plusieurs sujets, de la suite du Top 14 aux finances du club en passant par une harmonisation des calendriers.", "url": "https://www.lequipe.fr/Rugby/Actualites/Didier-lacroix-stade-toulousain-incroyable-de-reprendre-par-des-phases-finales/1129476", "urlToImage": null, "publishedAt": "2020-04-24T15:15:16Z", "content": "« Le Stade Toulousain s'acheminait avant l'épisode Covid vers une situation à l'équilibre après des périodes difficiles. Les performances sportives, l'assiduité des supporters, la bonne tenue de nos organisations commerciales (brasserie, boutiques etc.)... To… [+342 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/marc.alvarez1", "title": "Maguire : “La Champions League 19/20 reprendra sous une forme ou une autre” - Canal Supporters", "description": "Les enjeux sont trop importants pour que l'UEFA tire un trait sur la Ligue des champions 2019/2020. Tout sera fait, qu'importe le calendrier,", "url": "https://canal-supporters.com/2020/04/maguire-la-champions-league-19-20-reprendra-sous-une-forme-ou-une-autre/", "urlToImage": null, "publishedAt": "2020-04-24T14:54:14Z", "content": "Les enjeux sont trop importants pour que l’UEFA tire un trait sur la Ligue des champions 2019/2020. Tout sera fait, qu’importe le calendrier, pour que la compétition continentale suspendue depuis la mi-mars aille à son terme. Le spécialiste de l’économie du f… [+1420 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Ligue des champions : La Fédération européenne qualifie directement le PSG pour le Final Four - Eurosport - FRANCE (FR)", "description": "Dans l'incapacité de jouer les huitièmes et quarts de la compétition, la Fédération européenne de handball a décidé de qualifier directement quatre équipes.", "url": "https://www.eurosport.fr/handball/ligue-des-champions/2019-2020/ligue-des-champions-la-federation-europeenne-qualifie-directement-le-psg-pour-le-final-four_sto7734057/story.shtml", "urlToImage": null, "publishedAt": "2020-04-24T14:43:59Z", "content": "Voilà une décision de la Fédération européenne de handball qui ne devrait pas plaire à toutes les équipes encore engagées en Ligue des champions. Dans la un communiqué, la Fédération a décidé d'annuler les huitièmes et quarts de finale de la compétition pour … [+769 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "A.D.", "title": "Mercato - PSG : Leonardo engagé dans une bataille XXL pour Paul Pogba ? - Le 10 Sport", "description": "Leonardo verrait les choses en grand pour espérer attirer Paul Pogba. Toutefois, le Real Madrid, la Juventus et l'Inter, qui seraient également sur les traces du Français, auraient également de…", "url": "https://le10sport.com/football/mercato/mercato-psg-une-bataille-royale-pour-leonardo-avec-paul-pogba-500968", "urlToImage": null, "publishedAt": "2020-04-24T13:45:00Z", "content": "Publié le 24 avril 2020 à 15h45 par A.D. Leonardo verrait les choses en grand pour espérer attirer Paul Pogba. Toutefois, le Real Madrid, la Juventus et l'Inter, qui seraient également sur les traces du Français, auraient également de sérieux arguments à fair… [+1042 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Matthieu Margueritte", "title": "Zlatan Ibrahimovic dézingue les détracteurs de sa statue - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a4767850825177325603-zlatan-ibrahimovic-dezingue-les-detracteurs-de-sa-statue", "urlToImage": null, "publishedAt": "2020-04-24T12:44:04Z", "content": "Pour saluer l'idole de la ville de Malmö, une statue de Zlatan Ibrahimovic avait été érigée dans la ville suédoise. Cependant, le choix du buteur de l'AC Milan d'investir dans le club rival d'Hammarby a provoqué la colère des fans de Malmö et certains en ont … [+558 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "Officiel : L'ASSE prolonge une troisième pépite - Foot01.com", "description": "A chaque jour ou presque sa prolongation de contrat à l’AS Saint-Etienne. Après Wesley Fofana et Charles Abi, c’est Mahdi Camara qui a signé un nouveau bail avec les Verts. Le jeune milieu de terrain, qui fait partie de la génération dorée de l’ASSE,…", "url": "https://www.foot01.com/equipe/st-etienne/officiel-l-asse-prolonge-une-troisieme-pepite,347891", "urlToImage": null, "publishedAt": "2020-04-24T10:41:33Z", "content": "A chaque jour ou presque sa prolongation de contrat à lAS Saint-Etienne. Après Wesley Fofana et Charles Abi, cest Mahdi Camara qui a signé un nouveau bail avec les Verts. Le jeune milieu de terrain, qui fait partie de la génération dorée de lASSE, a su saisir… [+524 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "Gil Bousquet @Gil_Bousquet", "title": "Top 14 : éviter le scénario du pire - LaDepeche.fr", "description": "Le rugby professionnel est tétanisé par la crise sanitaire. Aucun scénario de sortie de crise stabilisé n’émerge. Les clubs s’inquiètent des conséquences économiques qui pourraient être délétères.", "url": "https://www.ladepeche.fr/2020/04/24/top-14-eviter-le-scenario-du-pire,8860476.php", "urlToImage": null, "publishedAt": "2020-04-24T05:39:11Z", "content": "l'essentiel\r\n Le rugby professionnel est tétanisé par la crise sanitaire. Aucun scénario de sortie de crise stabilisé némerge. Les clubs sinquiètent des conséquences économiques qui pourraient être délétères.\r\n Le chemin de la reprise des matchs de rugby sera… [+4208 chars]"}, {"source": {"id": null, "name": "Welovetennis.fr"}, "author": null, "title": "Roland Garros > Roland Garros sera décalé d'une semaine - We Love Tennis !", "description": "Nous pouvons vous confirmer l’information du Parisien selon laquelle le tournoi de Roland-Garros sera décalé d’une semaine par rapport à la première date évoquée. Les Internationaux de France débuteront donc le 28 septembre pour finir le 11 Octobre. Le 28 est…", "url": "https://www.welovetennis.fr/roland-garros/roland-garros-sera-decale-dune-semaine", "urlToImage": null, "publishedAt": "2020-04-23T23:54:00Z", "content": "Nous pouvons vous confirmer l’information du Parisien selon laquelle le tournoi de Roland-Garros sera décalé d’une semaine par rapport à la première date évoquée. Les Internationaux de France débuteront donc le 28 septembre pour finir le 11 Octobre. Le 28 est… [+750 chars]"}, {"source": {"id": null, "name": "Maxifoot.fr"}, "author": null, "title": "Mercato : Werner souhaite jouer pour Klopp... mais Liverpool veut attendre - Maxifoot", "description": "Très performant ces derniers mois, Timo Werner pourrait quitter le RB Leipzig cet été. L'attaquant allemand, courtisé par le Bay ...", "url": "http://www.maxifoot.fr/football/article-43512.htm", "urlToImage": null, "publishedAt": "2020-04-23T20:35:00Z", "content": "Très performant ces derniers mois, Timo Werner pourrait quitter le RB Leipzig cet été. L'attaquant allemand, courtisé par le Bayern Munich, donne sa priorité à Liverpool, qui pourrait toutefois attendre avant de passer à l'action.\r\nTimo Werner a bel et bien d… [+2087 chars]"}]}