{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Eurosport.fr"}, "author": "Cyril Morin", "title": "Coiffures et confinement : \"Areola se laisse pousser les cheveux, on dirait une peluche Kiki\" - Eurosport - FRANCE (FR)", "description": "Alors que le confinement s’éternise, les stars du sport s'adapent pour trouver des solutions pour leurs coiffures. Entretien qui décoiffe avec Caiolas Barber.", "url": "https://www.eurosport.fr/football/coiffures-et-confinement-areola-se-laisse-pousser-les-cheveux-on-dirait-une-peluche-kiki_sto7733774/story.shtml", "urlToImage": null, "publishedAt": "2020-04-26T12:17:57Z", "content": "59%. Si la France saccorde sur un point, cest celui-ci. Dès la levée du confinement, 59% des Français affirment vouloir se rendre chez le coiffeur pour rafraîchir leurs coupes, \r\nselon un sondage Harris. Les stars du sport ne dérogent pas à la règle. Confinée… [+4156 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "ASSE : Robert Herbin hospitalité, le splendide hommage de Paga - Foot01.com", "description": "Hospitalisé depuis mardi au CHU de Saint-Etienne, Robert Herbin se bat pour survivre. Souffrant de graves problèmes cardiaques, l’ancien coach des Verts est dans un état très inquiétant.\r\nAssurément, le monde du football dans sa globalité et plus encore…", "url": "https://www.foot01.com/equipe/st-etienne/asse-robert-herbin-hospitalite-le-splendide-hommage-de-paga,348015", "urlToImage": null, "publishedAt": "2020-04-26T11:51:00Z", "content": "Hospitalisé depuis mardi au CHU de Saint-Etienne, Robert Herbin se bat pour survivre. Souffrant de graves problèmes cardiaques, lancien coach des Verts est dans un état très inquiétant.\r\nAssurément, le monde du football dans sa globalité et plus encore les fa… [+1261 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Max Franco Sanchez", "title": "L'Atlético de Madrid veut mettre 6 joueurs à la porte - Foot Mercato", "description": "L'Atlético de Madrid pourrait se séparer de six joueurs lors du prochain mercato estival. Et il y a de jolis noms dans cette liste...", "url": "https://www.footmercato.net/a5779458041016280335-latletico-de-madrid-veut-mettre-6-joueurs-a-la-porte", "urlToImage": null, "publishedAt": "2020-04-26T11:43:50Z", "content": "Les effets de la crise de coronavirus risquent d'être pour le moins difficiles à encaisser, d'un point de vue financier comme sportif, puisque les directeurs sportifs et les recruteurs naviguent dans le flou pour la préparation de la prochaine saison. Ce n'es… [+2499 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Dominic Thiem ne souhaite pas contribuer au fonds de solidarité pour les joueurs mal classés - Tennis - Fonds de solidarité - L'Équipe.fr", "description": "Alors qu'un fonds de solidarité a été créé pour venir en aide aux joueurs mal classés, privés de revenus durant l'arrêt de toutes les compétitions, Dominic Thiem fait entendre une voix discordante avec la solidarité générale.", "url": "https://www.lequipe.fr/Tennis/Actualites/Dominic-thiem-ne-souhaite-pas-contribuer-au-fonds-de-solidarite-pour-les-joueurs-mal-classes/1129875", "urlToImage": null, "publishedAt": "2020-04-26T11:36:44Z", "content": "Alors que le monde du tennis s'est organisé pour venir en aide aux joueurs les plus mal classés, privés de tout revenu durant la période de confinement actuelle, l'Autrichien a fait valoir un avis qui tranche avec l'élan de générosité général. Alors qu'un fon… [+1278 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "OM : Thauvin reste, Eyraud va faire la grimace - Foot01.com", "description": "Longtemps blessé cette saison et en fin de contrat dans un an, Florian Thauvin ne quittera pas l’OM cet été au mercato.\r\nC’est le joueur lui-même qui a annoncé la nouvelle sur les réseaux sociaux. Pour l’international tricolore, il est tout simplement…", "url": "https://www.foot01.com/equipe/marseille/om-thauvin-reste-eyraud-va-faire-la-grimace,347997", "urlToImage": null, "publishedAt": "2020-04-26T11:26:27Z", "content": "Longtemps blessé cette saison et en fin de contrat dans un an, Florian Thauvin ne quittera pas lOM cet été au mercato.\r\nCest le joueur lui-même qui a annoncé la nouvelle sur les réseaux sociaux. Pour linternational tricolore, il est tout simplement inenvisage… [+1879 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "A.C.", "title": "Mercato - PSG : Le Real Madrid a tranché pour Pogba ! - Le 10 Sport", "description": "Florentino Pérez, président du Real Madrid, ne serait finalement pas totalement opposé à une arrivée de Paul Pogba.", "url": "https://le10sport.com/football/mercato/mercato-psg-le-real-madrid-a-tranche-pour-pogba-501169", "urlToImage": null, "publishedAt": "2020-04-26T11:15:00Z", "content": "Publié le 26 avril 2020 à 13h15 par A.C. Florentino Pérez, président du Real Madrid, ne serait finalement pas totalement opposé à une arrivée de Paul Pogba. \r\nLété dernier, Zinedine Zidane a cru jusquau dernier moment pouvoir rafler la mise pour Paul Pogba. I… [+760 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Max Franco Sanchez", "title": "Le FC Barcelone commence à y croire pour Matthijs de Ligt - Foot Mercato", "description": "Selon la presse catalane, le club barcelonais serait très intéressé par Matthijs de Ligt. Et c'est réciproque.", "url": "https://www.footmercato.net/a2285554260204442366-le-fc-barcelone-commence-a-y-croire-pour-matthijs-de-ligt", "urlToImage": null, "publishedAt": "2020-04-26T11:05:56Z", "content": "Le FC Barcelone a beau être dans une situation financière tendue, les médias locaux continuent d'annoncer un mercato très mouvementé sur la cote catalane. En plus des pistes Lautaro Martinez et Neymar qui font les unes des journaux barcelonais au quotidien, u… [+2153 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "PSG : Thiago Silva et Paris, encore une décision choc à venir ! - Foot01.com", "description": "En fin de contrat au Paris Saint-Germain, Thiago Silva serait proche d'une prolongation, le défenseur et le PSG étant sur la même longueur d'onde.\r\nTout comme pour Edinson Cavani, le Paris Saint-Germain a visiblement changé son fusil d’épaule concernant…", "url": "https://www.foot01.com/equipe/paris/psg-thiago-silva-et-paris-encore-une-decision-choc-a-venir,347983", "urlToImage": null, "publishedAt": "2020-04-26T11:01:52Z", "content": "En fin de contrat au Paris Saint-Germain, Thiago Silva serait proche d'une prolongation, le défenseur et le PSG étant sur la même longueur d'onde.\r\nTout comme pour Edinson Cavani, le Paris Saint-Germain a visiblement changé son fusil dépaule concernant Thiago… [+1694 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Rétro : Revivez la 12e étape du Tour de France 2017 - Cyclisme - Rétro - L'Équipe.fr", "description": "Revivez en vidéo sur le site et la chaîne L'Équipe, ce dimanche à partir de 13 heures, la 12e étape du Tour de 2017 entre Pau et Peyragudes.", "url": "https://www.lequipe.fr/Cyclisme-sur-route/Actualites/Retro-revivez-la-12e-etape-du-tour-de-france-2017/1129869", "urlToImage": null, "publishedAt": "2020-04-26T10:56:21Z", "content": "En cette période de confinement, le site et la chaîne L'Équipe rediffusent les étapes marquantes de l'histoire du Tour de France. Au programme de ce dimanche 26 avril, la 12e étape de la Grande Boucle 2017. C'est le coureur AG2R La Mondiale, Romain Bardet, qu… [+98 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Pour Guy Drut, le projet de Paris 2024 est désormais «obsolète, dépassé et déconnecté de la réalité» - Le Figaro", "description": "L'ancien ministre des Sports appelle à une réforme en profondeur des Jeux olympiques et de leur organisation.", "url": "https://sport24.lefigaro.fr/jeux-olympiques/jo-2024/actualites/pour-guy-drut-le-projet-de-paris-2024-est-desormais-obsolete-depasse-et-deconnecte-de-la-realite-1000341", "urlToImage": null, "publishedAt": "2020-04-26T10:48:00Z", "content": "L'ancien ministre des Sports appelle à une réforme en profondeur des Jeux olympiques et de leur organisation.Dans une tribune publiée par France Info, Guy Drut plaide pour une refonte organisationnelle des Jeux olympiques, conséquence de la crise sanitaire et… [+1253 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Guillaume Issner", "title": "Ciro Immobile s'en prend à Unai Emery - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a4113109770665649915-ciro-immobile-sen-prend-a-unai-emery", "urlToImage": null, "publishedAt": "2020-04-26T10:47:08Z", "content": "Ciro Immobile marche sur l'eau cette saison avec la Lazio. L'attaquant est le meilleur buteur de Serie A avec 27 buts en 26 matches. Une résurrection pour celui qui a connu des périodes plus difficiles au Borussia Dortmund et au FC Séville il y a quelques ann… [+739 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Bayern Munich : Salihamidzic optimiste pour une prolongation de Manuel Neuer - Foot - ALL - Bayern - L'Équipe.fr", "description": "Le directeur sportif du club allemand, Hasan Salihamidzic, pense qu'une issue favorable pourra être trouvée au sujet de l'avenir du gardien international.", "url": "https://www.lequipe.fr/Football/Actualites/Bayern-munich-salihamidzic-optimiste-pour-une-prolongation-de-manuel-neuer/1129867", "urlToImage": null, "publishedAt": "2020-04-26T10:44:09Z", "content": "Le directeur sportif du Bayern Munich Hasan Salihamidzic s'est dit « optimiste » quant à une prolongation de contrat du gardien et capitaine Manuel Neuer, indiquant que des divergences ont été « clarifiées en interne », dans un entretien au journal Die Welt d… [+166 chars]"}, {"source": {"id": null, "name": "Lesviolets.com"}, "author": "https://facebook.com/lesvioletscom/", "title": "Olivier Sadran qui resterait président du TFC, êtes-vous déçu par cette information - LesViolets.Com", "description": "Apr&egrave;s plusieurs semaines sans aucune information concernant la vente du TFC...", "url": "https://www.lesviolets.com/actu/olivier-sadran-qui-resterait-president-du-tfc-etes-vous-decu-par-cette-information-,53415.html", "urlToImage": null, "publishedAt": "2020-04-26T10:43:00Z", "content": "Après plusieurs semaines sans aucune information concernant la vente du TFC, L’Équipe a expliqué samedi soir qu’aucun accord n’avait été trouvé entre Olivier Sadran et le groupe sino-américain intéressé par le rachat du club. Le président toulousain serait mê… [+492 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "Real Madrid: des envies de départ pour Varane? - RMC Sport", "description": "Sous contrat au Real Madrid jusqu'en juin 2022, Raphaël Varane n'aurait pas encore eu d'offre pour prolonger selon le quotidien AS. Le défenseur français pourrait chercher un nouveau challenge.", "url": "https://rmcsport.bfmtv.com/football/real-madrid-des-envies-de-depart-pour-varane-1901660.html", "urlToImage": null, "publishedAt": "2020-04-26T10:38:09Z", "content": null}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Coronavirus : Romain Philippoteaux (Nîmes) trouve le plan de reprise de la L1 « ahurissant » - Foot - L1 - Coronavirus - L'Équipe.fr", "description": "Face à la menace de l'épidémie de coronavirus, le milieu offensif de Nîmes est opposé à un redémarrage de la L1 à court terme.", "url": "https://www.lequipe.fr/Football/Actualites/Coronavirus-romain-philippoteaux-nimes-trouve-le-plan-de-reprise-de-la-l1-ahurissant/1129863", "urlToImage": null, "publishedAt": "2020-04-26T10:31:24Z", "content": "Interrogé par La Provence, Romain Philippoteaux, le milieu offensif de Nîmes, n'a pas caché son scepticisme et même son opposition à une reprise de la L1 dans les semaines qui viennent. « J'ai du mal à y croire, lance-t-il. Les instances nationales insistent,… [+1416 chars]"}, {"source": {"id": null, "name": "Topmercato.com"}, "author": null, "title": "PSG : Verratti se paye l'OM sur sa LdC - Top Mercato.com", "description": "Marco Verratti (27 ans) s'est exprimé sur la Ligue des Champions remportée par l'OM, en 1993. Il a rappelé que le club ...", "url": "http://www.topmercato.com/219624,1/psg---verratti-se-paye-l-om-sur-sa-ldc.html", "urlToImage": null, "publishedAt": "2020-04-26T10:20:00Z", "content": "Marco Verratti (27 ans) s'est exprimé sur la Ligue des Champions remportée par l'OM, en 1993. Il a rappelé que le club phocéen n'avait plus gagné contre le PSG depuis longtemps.\"Il faut gagner deux Ligues des Champions pour arrêter de faire parler l'OM ? On v… [+359 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "A.D.", "title": "Mercato - PSG : Varane aurait snobé le PSG... à cause de Zidane ! - Le 10 Sport", "description": "A la fin de la dernière saison, Raphaël Varane aurait pu se laisser tenter par le PSG. Alors que Zinedine Zidane a fait son retour au Real Madrid, le champion du monde français aurait finalement…", "url": "https://le10sport.com/football/mercato/mercato-psg-varane-aurait-snobe-le-psg-a-cause-de-zidane-501175", "urlToImage": null, "publishedAt": "2020-04-26T10:15:00Z", "content": "Publié le 26 avril 2020 à 12h15 par A.D. A la fin de la dernière saison, Raphaël Varane aurait pu se laisser tenter par le PSG. Alors que Zinedine Zidane a fait son retour au Real Madrid, le champion du monde français aurait finalement décidé de recaler le cl… [+1052 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/marc.alvarez1", "title": "Sanfourche explique la logique de Le Graët sur les finales - Canal Supporters", "description": "Noël Le Graët, le président de la FFF, est désireux de reprendre la saison 2019/2020 suspendue par la finale de la Coupe de France...", "url": "https://canal-supporters.com/2020/04/sanfourche-explique-la-logique-de-le-graet-sur-les-finales/", "urlToImage": null, "publishedAt": "2020-04-26T10:02:40Z", "content": "Noël Le Graët, le président de la FFF, est désireux de reprendre la saison 2019/2020 suspendue par la finale de la Coupe de France (le 13 ou 20 juin) puis la finale de la Coupe de la Ligue, trois jours après, à huis clos. Ce qui voudrait dire que le PSG jouer… [+1112 chars]"}, {"source": {"id": null, "name": "Cyclismactu.net"}, "author": null, "title": "Route: Les coureurs français pourront retourner s'entraîner le 11 mai - Cyclism'Actu", "description": "Toute l'actu du Cyclisme", "url": "https://www.cyclismactu.net/news-route-les-coureurs-francais-pourront-retourner-s-entrainer-le-11-mai-90711.html", "urlToImage": null, "publishedAt": "2020-04-26T10:02:00Z", "content": "Alors qu'un plan de déconfinement sera présenté mardi par le Premier ministre Edouard Philippe devant l'Assemblée nationale, le journal L'Equipe affirme, de source ministérielle, que la pratique du vélo en extérieur devrait être autorisée dès le 11 mai procha… [+2252 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Maradona : « Ronaldinho n'est pas un criminel » / Paraguay / SOFOOT.com - SO FOOT", "description": "Deux génies sur le terrain et dans les excès. S'il a pu quitter la prison après avoir été arrêté en possession d'un faux passeport, Ronaldinho ...", "url": "https://www.sofoot.com/maradona-ronaldinho-n-est-pas-un-criminel-482684.html", "urlToImage": null, "publishedAt": "2020-04-26T10:00:00Z", "content": "Deux génies sur le terrain et dans les excès.S'il a pu quitter la prison après avoir été arrêté en possession d'un faux passeport, Ronaldinho est toujours assigné à résidence au Paraguay. Une situation que regrette Diego Maradona, comme ce dernier l'a confié … [+248 chars]"}, {"source": {"id": null, "name": "Rugbyrama.fr"}, "author": "Rugbyrama", "title": "Transferts - L’ASBH dément la signature d’Alex Tulou - Rugbyrama.fr", "description": "TRANSFERTS - Alors que l’info concernant la signature du Castrais Alex Tulou à Béziers était relayée depuis hier sur Internet, le club héraultais a préféré couper court à toutes spéculations, ce matin, par le biais d’un communiqué officiel. Bien que certains …", "url": "https://www.rugbyrama.fr/rugby/transferts/2018-2019/transferts-lasbh-dement-la-signature-dalex-tulou_sto7735167/story.shtml", "urlToImage": null, "publishedAt": "2020-04-26T09:18:26Z", "content": "Après les pertes de Kelly Meafua, qui rejoindra Montauban à partir de la saison prochaine et de Tyrone Viiga, en partance pour Provence Rugby, lASBH confirme cependant avoir pris contact avec plusieurs joueurs dans le but de palier à ces départs. Camille Géro… [+325 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "L1 : « Trop payés », un sondage terrible pour les footballeurs - Foot01.com", "description": "Un sondage réalisé pour RTL montre que les Français attendent que le sport soit moins un business, et surtout ils estiment que les footballeurs doivent accepter de gagner moins.\r\nLe célèbre « trop payé » lancé parfois par des supporters énervés à des joueurs…", "url": "https://www.foot01.com/ligue1/l1-trop-payes-un-sondage-terrible-pour-les-footballeurs,347987", "urlToImage": null, "publishedAt": "2020-04-26T09:08:48Z", "content": "Un sondage réalisé pour RTL montre que les Français attendent que le sport soit moins un business, et surtout ils estiment que les footballeurs doivent accepter de gagner moins.\r\nLe célèbre « trop payé » lancé parfois par des supporters énervés à des joueurs … [+1339 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Guillaume Issner", "title": "L'anecdote de Benjamin Lecomte sur Zlatan Ibrahimovic - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a2277600576927442635-as-monaco-lanecdote-de-benjamin-lecomte-sur-zlatan-ibrahimovic", "urlToImage": null, "publishedAt": "2020-04-26T09:07:57Z", "content": "Benjamin Lecomte s'est confié le temps d'un live Instagram à Hugo Guillemet, journaliste pour L'Équipe. Au cours de cet entretien, le gardien de l'AS Monaco passé par le FC Lorient, a partagé une anecdote assez marrante sur Zlatan Ibrahimovic, lors d'un match… [+504 chars]"}, {"source": {"id": null, "name": "Welovetennis.fr"}, "author": null, "title": "ATP > Jarry et le coup de pouce de Roger Federer - We Love Tennis !", "description": "Tout le monde sur le circuit évoque la gentillesse de Roger Federer et sa capacité à dire quelques mots dans les vestiaires, mieux à prodiguer quelques conseils au détour d’une rencontre ou d’une conversation. C’est exactement ce qu’il s’est passé l’an dernie…", "url": "https://www.welovetennis.fr/atp/jarry-et-le-coup-de-pouce-de-roger-federer", "urlToImage": null, "publishedAt": "2020-04-26T08:41:00Z", "content": "Tout le monde sur le circuit évoque la gentillesse de Roger Federer et sa capacité à dire quelques mots dans les vestiaires, mieux à prodiguer quelques conseils au détour d’une rencontre ou d’une conversation. \r\nC’est exactement ce qu’il s’est passé l’an dern… [+862 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "OL : Proche de Garcia et Houllier, un nouveau candidat en or à Lyon ? - Foot01.com", "description": "Pour remplacer Florian Maurice, un nouveau nom est sorti ce dimanche. Et ce candidat a deux atouts du côté de l'Olympique Lyonnais.\r\nJean-Michel Aulas l’a confié vendredi sur OLTV, le recrutement du remplaçant de Florian Maurice n’est pas acté, d’autant…", "url": "https://www.foot01.com/equipe/ol/ol-proche-de-garcia-et-houllier-un-candidat-en-or-a-lyon,347981", "urlToImage": null, "publishedAt": "2020-04-26T08:36:50Z", "content": "Pour remplacer Florian Maurice, un nouveau nom est sorti ce dimanche. Et ce candidat a deux atouts du côté de l'Olympique Lyonnais.\r\nJean-Michel Aulas la confié vendredi sur OLTV, le recrutement du remplaçant de Florian Maurice nest pas acté, dautant plus que… [+1282 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Erling Haaland (Borussia Dortmund) : « Ce que je préfère manger, c'est la pizza kebab » - Foot - ALL - Dortmund - L'Équipe.fr", "description": "Dans une vidéo publiée par le Borussia Dortmund, le jeune attaquant norvégien Erling Haaland répond aux questions des supporters du club allemand.", "url": "https://www.lequipe.fr/Football/Actualites/Erling-haaland-borussia-dortmund-ce-que-je-prefere-manger-c-est-la-pizza-kebab/1129843", "urlToImage": null, "publishedAt": "2020-04-26T08:33:45Z", "content": "Ses sensations quand le stade crie son nom, son plat favori, ses occupations pendant le confinement, ses idoles, ses rituels ou encore sa musique préférée... Tout, tout, tout, vous saurez tout sur Erling Haaland. L'attaquant du Borussia Dortmund (19 ans) s'es… [+72 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Everton consterné après la fête organisée par Moise Kean - SO FOOT", "description": "Prophète de l'imbécilité. Le confinement ? Ce n'est pas le problème de Moise Kean, visiblement. L'attaquant italien a en effet organisé une ...", "url": "https://www.sofoot.com/everton-consterne-apres-la-fete-organisee-par-moise-kean-482682.html", "urlToImage": null, "publishedAt": "2020-04-26T08:30:00Z", "content": "Prophète de l'imbécilité.Le confinement ? Ce n'est pas le problème de Moise Kean, visiblement. L'attaquant italien a en effet organisé une bonne petite bringue cette semaine à son domicile, bravant toutes les consignes du gouvernement britannique. Comble de l… [+821 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Cavani, un coup de tonnerre qui se confirme ! - Sports.fr", "description": "Longtemps promis à un départ au terme de la saison, Edinson Cavani, en fin de contrat, pourrait finalement bel et bien rempiler au PSG. Meilleur buteur de l’histoire du PSG avec 200 buts au compteur et parmi les meilleurs réalisateurs de l’histoire du champio…", "url": "https://www.sports.fr/football/cavani-coup-de-tonnerre-se-confirme-349718.html", "urlToImage": null, "publishedAt": "2020-04-26T08:15:13Z", "content": "Longtemps promis à un départ au terme de la saison, Edinson Cavani, en fin de contrat, pourrait finalement bel et bien rempiler au PSG.\r\nMeilleur buteur de lhistoire du PSG avec 200 buts au compteur et parmi les meilleurs réalisateurs de lhistoire du champion… [+1771 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "ENTRETIEN. Stade Rennais. Bourigeaud : « En finale de la Coupe de France, j'ai demandé à sortir… » - Ouest-France", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMilwFodHRwczovL3d3dy5vdWVzdC1mcmFuY2UuZnIvc3BvcnQvZm9vdGJhbGwvc3RhZGUtcmVubmFpcy9lbnRyZXRpZW4tc3RhZGUtcmVubmFpcy1ib3VyaWdlYXVkLWVuLWZpbmFsZS1kZS1sYS1jb3VwZS1kZS1mcmFuY2Utai1haS1kZW1hbmRlLXNvcnRpci02ODE3ODc40gEA?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T08:00:00Z", "content": null}, {"source": {"id": null, "name": "Parisfans.fr"}, "author": null, "title": "Mercato - Le Barça n'a pas parlé à l'agent de Pjanic, qui pourrait plutôt aller au PSG selon Schira - Parisfans.fr", "description": "Miralem Pjanic, milieu de 30 ans de la Juventus Turin et de la Bosnie, est régulièrement évoqué dans les rumeurs de transferts ces dernières semaines. Il ferait partie des joueurs turinois « vendables » pour financer d’autres venues et serait visé par plusieu…", "url": "http://www.parisfans.fr/transferts/mercato-le-barca-na-pas-parle-a-lagent-de-pjanic-qui-pourrait-plutot-aller-au-psg-selon-schira-460996.html", "urlToImage": null, "publishedAt": "2020-04-26T08:00:00Z", "content": "Miralem Pjanic, milieu de 30 ans de la Juventus Turin et de la Bosnie, est régulièrement évoqué dans les rumeurs de transferts ces dernières semaines. Il ferait partie des joueurs turinois « vendables » pour financer d’autres venues et serait visé par plusieu… [+1371 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Les médecins recommandent une distance de 4m entre les joueurs pour la reprise - SO FOOT", "description": "Casse-tête à venir. L’association des médecins des clubs professionnels (AMCFP) a détaillé samedi ses recommandations pour la reprise de la ...", "url": "https://www.sofoot.com/les-medecins-de-ligue-1-recommandent-une-distance-de-quatre-metres-entre-les-joueurs-aux-entrainements-482681.html", "urlToImage": null, "publishedAt": "2020-04-26T07:45:00Z", "content": "Casse-tête à venir.Lassociation des médecins des clubs professionnels (AMCFP) a détaillé samedi ses recommandations pour la reprise de la Ligue 1 et de la Ligue 2, alors que les mesures de déconfinement vont se préciser la semaine prochaine. Elle conseille d'… [+1106 chars]"}, {"source": {"id": null, "name": "Orange.fr"}, "author": "Media365", "title": "Borussia Dortmund : Haaland se confie en répondant aux questions des supporters - Toute l'actualité sportive sur Orange", "description": "Dans une vidéo publiée par le Borussia Dortmund, Erling Haaland s'est confié sur ses idoles, ses rituels ou encore sa musique préférée.", "url": "https://sports.orange.fr/football/allemagne/borussia-dortmund/article/borussia-dortmund-haaland-se-confie-en-repondant-aux-questions-des-supporters-exclu-CNT000001pIJmA.html", "urlToImage": null, "publishedAt": "2020-04-26T07:30:00Z", "content": "Mathieu WARNIER : publié le dimanche 26 avril 2020 à 09h30\r\nDans une vidéo publiée par le Borussia Dortmund, Erling Haaland s'est confié sur ses idoles, ses rituels ou encore sa musique préférée.\r\nAlors que la Bundesliga espère reprendre la compétition au déb… [+685 chars]"}, {"source": {"id": null, "name": "Www.dna.fr"}, "author": "AFP", "title": "Coronavirus. Quid des 300 footballeurs du championnat de France en fin de contrat ? - DNA - Dernières Nouvelles d'Alsace", "description": "La pandémie de coronavirus bouscule le calendrier du foot mais aussi son cadre juridique habituel, comme l’illustre l’épineuse question des joueurs en fin de contrat au 30 juin. Décryptage des enjeux soulevés en cas de poursuite de la saison au-delà du 1er ju…", "url": "https://www.dna.fr/sport/2020/04/26/quid-des-300-footballeurs-du-championnat-de-france-en-fin-de-contrat", "urlToImage": null, "publishedAt": "2020-04-26T07:10:42Z", "content": "Combien de joueurs sont concernés ?\r\nEn France, les contrats des joueurs \"expirent le 30 juin de la dernière saison\" prévue dans la transaction, selon la Charte du football professionnel. Or, à cette date, la saison 2019/20 ne sera pas terminée. La Ligue de f… [+3542 chars]"}, {"source": {"id": null, "name": "Football365.fr"}, "author": "Rédaction", "title": "PSG ou Barcelone ? De nouvelles révélations sur l’avenir de Neymar - Football365", "description": "Le feuilleton Neymar continue d'alimenter la presse catalane, alors que l'hypothèse d'une prolongation au PSG se renforce.", "url": "https://www.football365.fr/psg-ou-barcelone-de-nouvelles-revelations-sur-lavenir-de-neymar-9821816.html", "urlToImage": null, "publishedAt": "2020-04-26T07:09:19Z", "content": "Où évoluera Neymar la saison prochaine ? Après le premier épisode d’un feuilleton digne d’une télénovela, la seconde saison l’été prochain devrait être moins intense. La star a montré son attachement au Paris Saint-Germain avant que le football ne s’arrête, t… [+1027 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Guillaume Issner", "title": "Man United : Ed Woodward annonce la couleur pour le mercato - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a2987772919757341771-man-united-ed-woodward-annonce-la-couleur-pour-le-mercato", "urlToImage": null, "publishedAt": "2020-04-26T07:04:31Z", "content": "Face à la crise financière liée à la pandémie de coronavirus, les clubs professionnels auront un budget très restreint cet été pour le mercato. Les cadors n'y échapperont pas, à l'image de Manchester United. Ed Woodward, le vice-président exécutif, s'est adre… [+638 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Max Franco Sanchez", "title": "Real Madrid : Florentino Pérez veut faire de Kylian Mbappé le leader des Galactiques 2.0 - Foot Mercato", "description": "Le président du Real Madrid veut confier les clés du camion de son futur projet au joueur du Paris Saint-Germain, dont l'avenir du côté de la capitale française semble s'assombrir de jour en jour.", "url": "https://www.footmercato.net/a1925138170706919783-real-madrid-florentino-perez-veut-faire-de-kylian-mbappe-le-leader-des-galactiques-2-0", "urlToImage": null, "publishedAt": "2020-04-26T07:04:28Z", "content": "Du côté de Madrid, on voit les choses en grand pour lavenir. Il faut dire que le Real Madrid compte, dans son effectif actuel ou un peu partout en Europe sous forme de prêt, un vivier incroyable de jeunes joueurs talentueux, à limage de Ferland Mendy, Achraf … [+2971 chars]"}, {"source": {"id": null, "name": "Maligue2.fr"}, "author": "https://www.facebook.com/Laurent-Mazure-pro-1015203075191053/", "title": "Ligue 1/Ligue 2 - Un scénario en cas d'arrêt de championnat voté mi-mai - MaLigue2", "description": "La LFP se réunira en assemblée générale à la mi-mai pour définir les modalités en cas d'arrêt de championnat. Le scénario sera voté.", "url": "https://maligue2.fr/2020/04/26/ligue-1-ligue-2-un-scenario-en-cas-darret-de-championnat-vote-mi-mai/", "urlToImage": null, "publishedAt": "2020-04-26T06:45:48Z", "content": null}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Béatrice Houchard", "title": "\"Neige - Bastogne - Neige\" : Il y a 40 ans, le chef-d'oeuvre de Bernard Hinault - Eurosport - FRANCE (FR)", "description": "LIEGE-BASTOGNE-LIEGE - Il y a quarante ans, Bernard Hinault bravait le froid et la neige pour s'imposer dans des conditions dantesques.", "url": "https://www.eurosport.fr/cyclisme/liege-bastogne-liege/2020/neige-bastogne-neige-il-y-a-40-ans-le-chef-d-oeuvre-de-bernard-hinault_sto7734659/story.shtml", "urlToImage": null, "publishedAt": "2020-04-26T05:29:35Z", "content": "LIEGE-BASTOGNE-LIEGE - Il y a quarante ans, Bernard Hinault bravait le froid et la neige pour s'imposer dans des conditions dantesques et signer sa deuxième victoire sur la Doyenne. L'occasion pour notre chroniqueuse Béatrice Houchard d'ouvrir une boîte à sou… [+6932 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Icardi, la clause qui change encore la donne - Sports.fr", "description": "Alors que le PSG devrait vraisemblablement lever l’option d’achat dont est assorti le prêt de Mauro Icardi, son prix ne sera pas le même si les Parisiens décident de le revendre dans la foulée. Le contrat entourant le prêt de Mauro Icardi au PSG aura décidéme…", "url": "https://www.sports.fr/football/icardi-clause-change-donne-349662.html", "urlToImage": null, "publishedAt": "2020-04-26T03:28:22Z", "content": "Alors que le PSG devrait vraisemblablement lever loption dachat dont est assorti le prêt de Mauro Icardi, son prix ne sera pas le même si les Parisiens décident de le revendre dans la foulée.\r\nLe contrat entourant le prêt de Mauro Icardi au PSG aura décidémen… [+1615 chars]"}, {"source": {"id": null, "name": "Intensite.net"}, "author": null, "title": "ORLÉANS - Disparition inquiétante d'une femme : Retrouvée saine et sauve - Radio Intensité", "description": "MISE A JOUR - 9H00&amp;nbsp; - Une disparition inquiétante à Orléans, une femme avait disparu hier matin. Sa famille la recherchait activement. Elle nous signale qu'elle a été retrouvée ce matin saine et", "url": "https://intensite.net/2009/actu2020/orleans-disparition-inquietante-d-une-femme-retrouvee-saine-et-sauve-314452", "urlToImage": null, "publishedAt": "2020-04-26T02:52:47Z", "content": "Pour adresser à Radio Intensité, un communiqué, un commentaire, une précision, ou une info, merci d'utiliser notre formulaire : ICI. ou adressez un mail à redaction@intensite.net.\r\nPour figurer dans notre agenda en ligne gratuitement, il suffit de nous adress… [+197 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "T.M.", "title": "Mercato - PSG : La guerre est déclarée entre Mbappé et le PSG ! - Le 10 Sport", "description": "La prolongation de Kylian Mbappé est actuellement la priorité du PSG. Intransigeant à ce sujet, le club de la capitale pourrait toutefois avoir déclenché la guerre avec son joyau.", "url": "https://le10sport.com/football/mercato/mercato-psg-la-guerre-est-declaree-entre-mbappe-et-le-psg-501143", "urlToImage": null, "publishedAt": "2020-04-26T02:30:00Z", "content": "Publié le 26 avril 2020 à 4h30 par T.M. La prolongation de Kylian Mbappé est actuellement la priorité du PSG. Intransigeant à ce sujet, le club de la capitale pourrait toutefois avoir déclenché la guerre avec son joyau.\r\nCet été, avec les répercussions financ… [+1109 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "Th.B.", "title": "Mercato - Barcelone : Le Barça est prévenu pour Lautaro Martinez ! - Le 10 Sport", "description": "Pour parvenir à obtenir l’aval de l’Inter pour le transfert de Lautaro Martinez, le FC Barcelone prévoirait d’inclure Arthur Melo ainsi qu’Arturo Vidal dans l’opération. Cependant, le Barça ne…", "url": "https://le10sport.com/football/mercato/mercato-barcelone-le-barca-est-prevenu-pour-lautaro-martinez-501150", "urlToImage": null, "publishedAt": "2020-04-25T23:30:00Z", "content": "Foot - Mercato - Barcelone\r\nPublié le 26 avril 2020 à 1h30 par Th.B. Pour parvenir à obtenir laval de lInter pour le transfert de Lautaro Martinez, le FC Barcelone prévoirait dinclure Arthur Melo ainsi quArturo Vidal dans lopération. Cependant, le Barça ne po… [+971 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Quels sont les points les plus mythiques de l'histoire ? - Eurosport - FRANCE (FR)", "description": "Nouvel épisode de notre rubrique \"On refait l'Histoire\". Cette fois, Laurent Vergne et Bertrand Milliard vous dévoilent les points qui les ont marqué.", "url": "https://www.eurosport.fr/tennis/quels-sont-les-points-les-plus-mythiques-de-l-histoire_sto7734788/story.shtml", "urlToImage": null, "publishedAt": "2020-04-25T22:41:15Z", "content": "ON REFAIT L'HISTOIRE - Nouvel épisode de notre rubrique \"On refait l'Histoire\". Cette fois, Laurent Vergne et Bertrand Milliard vous dévoilent les points qui ont particulièrement marqué leur mémoire. Première partie ce dimanche avec, notamment, un certain éch… [+19480 chars]"}, {"source": {"id": null, "name": "Onzemondial.com"}, "author": "La rédaction", "title": "Rennes : Manchester United viendrait concurrencer le Barça et le Real Madrid pour Camavinga ! - Onze Mondial", "description": "Le milieu de terrain attise la convoitise en Europe. Les Red Devils seraient également intéressé par la pépite rennaise.", "url": "http://www.onzemondial.com/transferts/rennes-manchester-united-viendrait-concurrencer-le-barca-et-le-real-madrid-pour-camavinga-216523", "urlToImage": null, "publishedAt": "2020-04-25T22:29:27Z", "content": "Zapping Onze Mondial Real Madrid : Federico Valverde, joueur clé du milieu de terrain ?\r\nSans aucun doute, Eduardo Camavinga (17 ans) est la révélation de ce début de saison en Ligue 1. Son match face au Paris Saint-Germain (2-1) en début de saison avait impr… [+860 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "Pendant le confinement, ce vainqueur de Roland-Garros travaille... dans un supermarché - RMC Sport", "description": "Vainqueur de Roland-Garros l'année dernière en double, Kevin Krawietz a souhaité profiter de l'interruption de la saison de tennis pour découvrir « un travail normal ». Dans une interview au magazine Der Spiegel, le joueur allemand explique qu'il travaille de…", "url": "https://rmcsport.bfmtv.com/tennis/pendant-le-confinement-ce-vainqueur-de-roland-garros-travaille-dans-un-supermarche-1901057.html", "urlToImage": null, "publishedAt": "2020-04-25T21:22:42Z", "content": null}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "Th.B.", "title": "Mercato - PSG : Thomas Meunier déjà fixé pour son avenir ? - Le 10 Sport", "description": "Alors que le Borussia Dortmund et Tottenham se bousculeraient en coulisse pour s’attacher ses services, Thomas Meunier ferait toujours d’une prolongation au PSG sa priorité. Cependant, le Belge…", "url": "https://le10sport.com/football/mercato/mercato-psg-thomas-meunier-deja-fixe-pour-son-avenir-501115", "urlToImage": null, "publishedAt": "2020-04-25T20:45:00Z", "content": "Publié le 25 avril 2020 à 22h45 par Th.B. Alors que le Borussia Dortmund et Tottenham se bousculeraient en coulisse pour sattacher ses services, Thomas Meunier ferait toujours dune prolongation au PSG sa priorité. Cependant, le Belge saurait déjà de quoi il e… [+1231 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "« La volonté de rachat est toujours là », rassurent les investisseurs intéressés par l'AS Nancy - Foot - Nancy - L'Équipe.fr", "description": "Proche d'être finalisé avant le confinement, le rachat de Nancy (L2) par le City Football Group n'a pas eu lieu. Inquiétant ? Les investisseurs, tout en reconnaissant une « nouvelle donne », se veulent rassurants.", "url": "https://www.lequipe.fr/Football/Actualites/-la-volonte-de-rachat-est-toujours-la-rassurent-les-investisseurs-interesses-par-l-as-nancy/1129789", "urlToImage": null, "publishedAt": "2020-04-25T20:01:56Z", "content": "En voie de finalisation avant le début de la crise sanitaire mondiale, le rachat de l'AS Nancy Lorraine (L2) par le City Football Group, géré par un fonds souverain d'Abu Dhabi, et déjà propriétaire de 8 clubs dans le monde dont Manchester City (Angleterre), … [+1916 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "OL : Mohamed Bouhafsi fan d'Aulas « le génie du foot » - Foot01.com", "description": "A l'heure où les critiques sont souvent virulentes à son encontre, Jean-Michel Aulas peut compter sur un fan revendiqué au sein des médias.\r\nHabile en communication, Jean-Michel Aulas est capable de découper en morceaux L’Equipe via Twitter, puis le lendemain…", "url": "https://www.foot01.com/equipe/ol/ol-mohamed-bouhafsi-fan-d-aulas-le-genie-du-foot,347975", "urlToImage": null, "publishedAt": "2020-04-25T19:04:56Z", "content": "A l'heure où les critiques sont souvent virulentes à son encontre, Jean-Michel Aulas peut compter sur un fan revendiqué au sein des médias.\r\nHabile en communication, Jean-Michel Aulas est capable de découper en morceaux LEquipe via Twitter, puis le lendemain … [+1242 chars]"}, {"source": {"id": null, "name": "Orange.fr"}, "author": "Media365", "title": "ATP : Paire et Wawrinka en couple, la rumeur lancée par Radwanska - Toute l'actualité sportive sur Orange", "description": "Grand et bel épisode du #StanPairo samedi soir, de retour sur Instagram entre Benoit Paire et Stan Wawrinka après quinze jours de pause. C'est surtout Paire, encore, qui a subi les belles réparties du Suisse.", "url": "https://sports.orange.fr/tennis/atp/article/atp-paire-et-wawrinka-en-couple-la-rumeur-lancee-par-radwanska-exclu-CNT000001pHl9i.html", "urlToImage": null, "publishedAt": "2020-04-25T18:37:00Z", "content": "Thomas Siniecki : publié le samedi 25 avril 2020 à 20h37\r\nGrand et bel épisode du #StanPairo samedi soir, de retour sur Instagram entre Benoit Paire et Stan Wawrinka après quinze jours de pause. C'est surtout Paire, encore, qui a subi les belles réparties du … [+1391 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "«On va vers des bonnes nouvelles», rapporte l’agent de Sambia - Le Figaro", "description": "Frédéric Guerra donne des nouvelles rassurantes du milieu montpelliérain, positif au coronavirus.", "url": "https://sport24.lefigaro.fr/football/ligue-1/actualites/on-va-vers-des-bonnes-nouvelles-rapporte-l-agent-de-sambia-1000318", "urlToImage": null, "publishedAt": "2020-04-25T18:35:00Z", "content": "Frédéric Guerra donne des nouvelles rassurantes du milieu montpelliérain, positif au coronavirus.Bonne nouvelle pour Junior Sambia ? Hospitalisé depuis mardi et positif au Covid-19, le joueur de Montpellier était en réanimation depuis jeudi et placé en coma a… [+2178 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "ASC : Ses joueurs testés au Covid-19, Amiens est prêt à sauver sa tête - Foot01.com", "description": "En plus du protocole médical préparé par la Ligue de Football Professionnel, les joueurs d’Amiens ont passé des tests de dépistage. L’objectif est de permettre une reprise dans les meilleures conditions.\r\nA chaque sortie médiatique ou presque, les acteurs…", "url": "https://www.foot01.com/equipe/amiens/asc-ses-joueurs-testes-au-covid-19-amiens-est-pret-a-sauver-sa-tete,347963", "urlToImage": null, "publishedAt": "2020-04-25T18:10:55Z", "content": "En plus du protocole médical préparé par la Ligue de Football Professionnel, les joueurs dAmiens ont passé des tests de dépistage. Lobjectif est de permettre une reprise dans les meilleures conditions.\r\nA chaque sortie médiatique ou presque, les acteurs de Li… [+1802 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Premier League : Les joueurs de Chelsea conservent l'intégralité de leurs salaires - Eurosport - FRANCE (FR)", "description": "PREMIER LEAGUE - Dans un communiqué publié samedi, Chelsea a annoncé que ses joueurs n'allaient pas subir de baisse de salaire en lien avec le Covid 19.", "url": "https://www.eurosport.fr/football/premier-league/2019-2020/premier-league-les-joueurs-de-chelsea-conservent-l-integralite-de-leurs-salaires_sto7734824/story.shtml", "urlToImage": null, "publishedAt": "2020-04-25T16:55:14Z", "content": "Si leurs voisins d'Arsenal ont récemment accepté de baisser leurs salaires de 12,5%, ce n'est pas la voie qu'ont décidé de prendre les joueurs de Chelsea. Dans un communiqué publié samedi, le club londonnien a fait un point sur une éventuelle réduction de sal… [+1035 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "F.H. avec AFP", "title": "Chelsea a levé l’option pour prolonger Olivier Giroud d’un an - 20 Minutes", "description": "L’attaquant de l’équipe de France débutera-t-il le championnat anglais sur le banc comme lors de la saison 2019-2020 ?", "url": "https://www.20minutes.fr/sport/2767667-20200425-chelsea-leve-option-prolonger-olivier-giroud-an", "urlToImage": null, "publishedAt": "2020-04-25T16:50:45Z", "content": "Olivier Giroud. (Illustration) Mark Greenwood/IPS/REX/SIPA\r\nQuel rôle va lui donner Frank Lampard ? Titulaire ou remplaçant ? Chelsea a levé loption pour prolonger dun an \r\nOlivier Giroud, annonce l'AFP. Lattaquant de \r\nl'équipe de France est lié au club lond… [+741 chars]"}, {"source": {"id": null, "name": "Www.lci.fr"}, "author": "La rédaction de LCI", "title": "Coronavirus : vers une reprise de la Premier League le 8 juin ? - LCI", "description": "HYPOTHÈSE - Ce samedi, le Times indique que les instances du football anglais envisagent une reprise de la Premier League le 8 juin prochain, le tout à huis clos, avec des mesures sanitaires strictes. L'objectif est de finir la saison le 27 juillet, pour lais…", "url": "https://www.lci.fr/football/coronavirus-vers-une-reprise-de-la-premier-league-le-8-juin-2152038.html", "urlToImage": null, "publishedAt": "2020-04-25T16:42:14Z", "content": "Suspendue depuis le 13 mars dernier en raison de l'épidémie de Covid-19, la Premier League anglaise pourrait reprendre le 8 juin prochain, affirme le Times ce samedi. Selon le journal britannique, les instances du football anglais ainsi que d'autres sports on… [+1464 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "ASSE : Romeyer refuse une finale sans les supporters stéphanois - Foot01.com", "description": "Prenant une position inverse à Bernard Caïazzo, Roland Romeyer refuse de voir la finale de Coupe de France entre l'ASSE et le PSG se disputer à huis clos.\r\nEntre Roland Romeyer et Bernard Caïazzo, il y a de l’eau dans le gaz. Et même si les deux présidents…", "url": "https://www.foot01.com/equipe/st-etienne/asse-romeyer-refuse-une-finale-sans-les-supporters-stephanois,347957", "urlToImage": null, "publishedAt": "2020-04-25T16:37:13Z", "content": "Prenant une position inverse à Bernard Caïazzo, Roland Romeyer refuse de voir la finale de Coupe de France entre l'ASSE et le PSG se disputer à huis clos.\r\nEntre Roland Romeyer et Bernard Caïazzo, il y a de leau dans le gaz. Et même si les deux présidents de … [+1391 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Le Barça serait prêt à sécher la possible reprise de la Liga - SO FOOT", "description": "Sur un terrain ou en dehors, le Barça n'est pas facile à maîtriser. Vendredi, lors d'une conférence téléphonique, le président de la Liga ...", "url": "https://www.sofoot.com/le-barca-serait-pret-a-secher-la-possible-reprise-de-la-liga-482674.html", "urlToImage": null, "publishedAt": "2020-04-25T16:15:00Z", "content": "Sur un terrain ou en dehors, le Barça n'est pas facile à maîtriser.Vendredi, lors d'une conférence téléphonique, le président de la Liga Javier Tebas s'est montré très clair : une non-reprise du championnat est pour lui inenvisageable. « Les clubs qui refuser… [+680 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "Esp : Avec le « Swissx Camp Nou », le Barça s'expose à un scandale - Foot01.com", "description": "Le FC Barcelone a trouvé un candidat pour le naming de son stade la saison prochaine. Mais la réputation de cet investisseur risque de faire parler en Espagne.\r\nCe qui devait être un très beau geste pourrait vite provoquer une polémique au FC Barcelone…", "url": "https://www.foot01.com/foot-europeen/espagne/esp-avec-le-swissx-camp-nou-le-barca-s-expose-a-un-scandale,347953", "urlToImage": null, "publishedAt": "2020-04-25T15:05:00Z", "content": "Le FC Barcelone a trouvé un candidat pour le naming de son stade la saison prochaine. Mais la réputation de cet investisseur risque de faire parler en Espagne.\r\nCe qui devait être un très beau geste pourrait vite provoquer une polémique au FC Barcelone. En dé… [+1358 chars]"}, {"source": {"id": null, "name": "Footradio.com"}, "author": "Alexis Rose", "title": "OL : Mohamed Bouhafsi est fan d’Aulas, il lui propose un dîner à Paris - FootRadio.com", "description": "Président de l’Olympique Lyonnais depuis 1987, Jean-Michel Aulas est un personnage central au sein du football français. Même si certains suiveurs de la Ligue 1, comme Daniel Riolo, l’estiment un peu sur le déclin, à l’image de son OL qui n’a plus gagné de tr…", "url": "https://footradio.com/ol/ol-mohamed-bouhafsi-est-fan-daulas-il-lui-propose-un-diner-a-paris/", "urlToImage": null, "publishedAt": "2020-04-25T15:02:55Z", "content": "Président de lOlympique Lyonnais depuis 1987, Jean-Michel Aulas est un personnage central au sein du football français.\r\nMême si certains suiveurs de la Ligue 1, comme Daniel Riolo, lestiment un peu sur le déclin, à limage de son OL qui na plus gagné de troph… [+1127 chars]"}, {"source": {"id": null, "name": "Lephoceen.fr"}, "author": "Le Phocéen", "title": "Cabella : \"Une fierté d'avoir joué à l'OM\" - Le Phoceen", "description": "L'ancien Olympien se souvient de son passage à l'OM.", "url": "https://www.lephoceen.fr/infos-om/autour-de-l-om/cabella-une-fierte-d-avoir-joue-a-l-om-178268", "urlToImage": null, "publishedAt": "2020-04-25T14:24:20Z", "content": "Sur son compte Instagram, Rémy Cabella a répondu à plusieurs questions à l'occasion d'un live. L'ancien Olympien est notamment revenu sur son passage à Marseille entre 2015 et 2018.\r\nCabella explique que son expérience à l'OM a été un peu compliquée, mais il … [+1141 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Les gants de Lloris aux enchères / Angleterre / Tottenham / SOFOOT.com - SO FOOT", "description": "Lier l'utile à l'agréable. Selon Woodward, les clubs dépenseront beaucoup moins Homme réfléchi, Hugo Lloris a officialisé sa bonne idée qui ...", "url": "https://www.sofoot.com/les-gants-de-la-finale-de-ligue-des-champions-d-hugo-lloris-aux-encheres-482665.html", "urlToImage": null, "publishedAt": "2020-04-25T13:00:00Z", "content": "Lier l'utile à l'agréable.Homme réfléchi, Hugo Lloris a officialisé sa bonne idée qui va lui permettre à la fois de se débarrasser d'un objet encombrant et d'aider à combattre la pandémie de coronavirus. Le gardien de but de Tottenham a en effet décidé de met… [+398 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Yannick Sagorin", "title": "L’Ajax privé de titre, Ziyech ne digère pas - Sports.fr", "description": "Les responsables de l’Eredivisie ont pris la décision vendredi de ne pas désigner de champion alors que la saison aux Pays-Bas ne reprendra pas. Malgré son statut de leader après 25 journées sur 34 au programme, l’Ajax n’étoffe donc pas son palmarès. Logique …", "url": "https://www.sports.fr/football/lajax-prive-de-titre-ziyech-ne-digere-349562.html", "urlToImage": null, "publishedAt": "2020-04-25T11:50:44Z", "content": "Les responsables de lEredivisie ont pris la décision vendredi de ne pas désigner de champion alors que la saison aux Pays-Bas ne reprendra pas. Malgré son statut de leader après 25 journées sur 34 au programme, lAjax nétoffe donc pas son palmarès. Logique pou… [+935 chars]"}, {"source": {"id": null, "name": "Nextgen-auto.com"}, "author": "Emmanuel Touzot", "title": "Leclerc compare la prudence de Hamilton à l'agressivité de Verstappen - Nextgen-Auto.com", "description": "Formule 1 | Charles Leclerc a été interrogé pendant son confinement en cours à Monaco sur les différences de pilotage entre ses rivaux. A la question de savoir (...)", "url": "https://motorsport.nextgen-auto.com/fr/formule-1/leclerc-compare-la-prudence-de-hamilton-a-l-agressivite-de-verstappen,148015.html", "urlToImage": null, "publishedAt": "2020-04-25T11:36:00Z", "content": "Charles Leclerc a été interrogé pendant son confinement en cours à Monaco sur les différences de pilotage entre ses rivaux.\r\nA la question de savoir contre qui il préférait se battre entre Lewis Hamilton et Max Verstappen, il a donné deux réponses.\r\n\"Si je ve… [+984 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Yannick Sagorin", "title": "Ce qu’ont versé Canal+ et beIN Sports à la LFP - Sports.fr", "description": "Les groupes Canal+ et beIN Sports ont obtenu une belle ristourne auprès de la LFP pour les matches de championnat déjà diffusés. Les négociations des présidents Nasser al-Khelaïfi (PSG), Jacques-Henri Eyraud (OM), Olivier Sadran (Toulouse) et Jean-Pierre Rivè…", "url": "https://www.sports.fr/football/quont-verse-canal-bein-sports-a-lfp-349556.html", "urlToImage": null, "publishedAt": "2020-04-25T10:44:47Z", "content": "Les groupes Canal+ et beIN Sports ont obtenu une belle ristourne auprès de la LFP pour les matches de championnat déjà diffusés.\r\nLes négociations des présidents Nasser al-Khelaïfi (PSG), Jacques-Henri Eyraud (OM), Olivier Sadran (Toulouse) et Jean-Pierre Riv… [+857 chars]"}, {"source": {"id": null, "name": "Lerugbynistere.fr"}, "author": "Thibault Perrin", "title": "Lacroix : ''Incompréhensible de reprendre une compétition par des phases finales'' [VIDEO] - Le Rugbynistère", "description": "Le président du Stade Toulousain Didier Lacroix a répondu aux questions que pouvaient se poser les supporters quant à la reprise et à la situation du club.", "url": "https://www.lerugbynistere.fr/videos/lacroix-incomprehensible-de-reprendre-une-competition-par-des-phases-finales-video-2504201209.php", "urlToImage": null, "publishedAt": "2020-04-25T10:10:00Z", "content": "Le président du Stade Toulousain Didier Lacroix a répondu aux questions que pouvaient se poser les supporters quant à la reprise et à la situation du club.Face aux nombreuses incertitudes qui entourent la reprise des matchs, le président du Stade Toulousain D… [+1887 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Programme TV du samedi 25 avril : que regarder en sport à la télé ? - Tous sports - L'Équipe.fr", "description": "Retrouvez le meilleur des programmes de sport à suivre à la télé ce samedi 25 avril.", "url": "https://www.lequipe.fr/Medias/Actualites/Programme-tv-du-samedi-25-avril-que-regarder-en-sport-a-la-tele/1129569", "urlToImage": null, "publishedAt": "2020-04-25T09:30:00Z", "content": "Pendant la période de confinement, L'Équipe vous propose, chaque jour, une sélection de quelques programmes sportifs à suivre sur les chaînes de télé françaises. Retrouvez notamment, sur la chaîne L'Équipe, à partir de 13 heures, la 8e étape du Tour de France… [+1488 chars]"}, {"source": {"id": null, "name": "Foot-sur7.fr"}, "author": "FOOT-SUR7.fr", "title": "PSG Mercato : Neymar, Sport en flagrant délit de mensonge ? - Foot Sur 7", "description": "Neymar fait de nouveau l’actualité en Espagne. Le quotidien espagnol Sport annonce qu’une fois revenu à Paris, Neymar demandera à partir du PSG. Une rumeur de plus qui sera bientôt démentie par les faits.", "url": "https://www.foot-sur7.fr/445656-psg-mercato-neymar-sport", "urlToImage": null, "publishedAt": "2020-04-25T08:55:00Z", "content": "Neymar fait de nouveau lactualité en Espagne. Le quotidien espagnol Sport annonce quune fois revenu à Paris, Neymar demandera à partir du PSG. Une rumeur de plus qui sera bientôt démentie par les faits.\r\nPSG, Neymar va-t-il demander à partir ?\r\nLe brésilien e… [+1769 chars]"}, {"source": {"id": null, "name": "Rugbyrama.fr"}, "author": "Leo Faure", "title": "International - Suspendu pour dix matchs, Joe Marler n'en purgera finalement aucun - Rugbyrama.fr", "description": "INTERNATIONAL - L'affaire a fait sourire sur la forme, puis débattre sur le fond. Auteur d'un geste facétieux pour certains, déplacé pour d'autres (il avait touché le sexe de Alun Wyn Jones en plein match du Tournoi des 6 nations) Joe Marler avait écopé de 10…", "url": "https://www.rugbyrama.fr/rugby/international/2018-2019/international-suspendu-pour-dix-matchs-joe-marler-n-en-purgera-finalement-aucun_sto7734448/story.shtml", "urlToImage": null, "publishedAt": "2020-04-25T08:37:35Z", "content": "« Joe Marler sera libre de jouer dès que le rugby reprendra ses droits. » C'est par ces mots que le Times débute son article. Selon les informations du quotidien anglais, le pilier des Harlequins, qui avait écopé de dix semaines de suspension pour avoir « pin… [+1266 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "D.M.", "title": "Mercato - Barcelone : Le Barça prêt à s'attaquer à une piste du PSG ? - Le 10 Sport", "description": "Alors que Leonardo ciblerait Douglas Costa, le FC Barcelone aurait l'intention de s'immiscer dans ce dossier et tenter de recruter l’ailier lors du prochain mercato.", "url": "https://le10sport.com/football/mercato/mercato-psg-le-barca-pret-a-concurrencer-leonardo-dans-ce-dossier-xxl-501016", "urlToImage": null, "publishedAt": "2020-04-25T05:30:00Z", "content": "Foot - Mercato - Barcelone\r\nPublié le 25 avril 2020 à 7h30 par D.M. Alors que Leonardo ciblerait Douglas Costa, le FC Barcelone aurait l'intention de s'immiscer dans ce dossier et tenter de recruter lailier lors du prochain mercato.\r\nLe FC Barcelone pourrait … [+1159 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "De nouvelles mesures économiques en faveur du sport - Tous sports - L'Équipe.fr", "description": "A l'issue d'une réunion avec d'autres ministres et divers acteurs du sport, ce vendredi, Roxana Maracineanu a annoncé de nouvelles mesures d'accompagnement pour le secteur.", "url": "https://www.lequipe.fr/Tous-sports/Actualites/De-nouvelles-mesures-economiques-en-faveur-du-sport/1129608", "urlToImage": null, "publishedAt": "2020-04-24T21:27:04Z", "content": "Alors que les inquiétudes se sont renforcées ces derniers jours face à la crise économique générée par l'épidémie de Covid-19, la ministre des Sports Roxana Maracineanu a annoncé dans un tweet, ce vendredi soir, de nouvelles mesures d'accompagnement du secteu… [+577 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/marc.alvarez1", "title": "Maguire : “La Champions League 19/20 reprendra sous une forme ou une autre” - Canal Supporters", "description": "Les enjeux sont trop importants pour que l'UEFA tire un trait sur la Ligue des champions 2019/2020. Tout sera fait, qu'importe le calendrier,", "url": "https://canal-supporters.com/2020/04/maguire-la-champions-league-19-20-reprendra-sous-une-forme-ou-une-autre/", "urlToImage": null, "publishedAt": "2020-04-24T14:54:14Z", "content": "Les enjeux sont trop importants pour que l’UEFA tire un trait sur la Ligue des champions 2019/2020. Tout sera fait, qu’importe le calendrier, pour que la compétition continentale suspendue depuis la mi-mars aille à son terme. Le spécialiste de l’économie du f… [+1420 chars]"}]}