{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Rugbyrama.fr"}, "author": "Marc Duzan", "title": "Top 14 et Pro D2 : le Ministère des Sports refuse pour l'instant de donner l'accès aux tests - Rugbyrama.fr", "description": "CORONAVIRUS - TOP 14 / PRO D2 - La reprise du Top 14 et du Pro D2, toujours espérée début septembre, est en grande partie soumise à l'accès prochain aux tests Covid 19. Mais pour l'instant, le gouvernement refuse toujours de donner la priorité aux sportifs pr…", "url": "https://www.rugbyrama.fr/rugby/coronavirus/2020/reprise-du-top-et-pro-d2-le-ministere-des-sports-refuse-pour-l-instant-de-donner-l-acces-aux-tests_sto7744577/story.shtml", "urlToImage": "https://i.rugbyrama.fr/2020/04/22/2809685-57958735-1600-900.jpg", "publishedAt": "2020-05-08T17:24:31Z", "content": "Mercredi soir, la Ministre des Sports Roxana Maracineanu a tenu une réunion auprès des dirigeants du sport professionnel en France. Pour le monde du rugby, l'enjeu du meeting était le suivant : les clubs de Top 14 et Pro D2 disposeront-ils prochainement des t… [+1618 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Real Madrid : Jovic se fracture le talon chez lui - Foot - ESP - Real Madrid - L'Équipe.fr", "description": "L'attaquant du Real, blessé, devrait être indisponible pendant deux mois.", "url": "https://www.lequipe.fr/Football/Actualites/Real-madrid-jovic-se-fracture-le-talon-chez-lui/1133171", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/luka-jovic-attaquant-du-real-madrid-a-reau-l-equipe/1500000001334274/0:0,1998:1332-640-427-75/e32fa.jpg", "publishedAt": "2020-05-08T16:56:29Z", "content": "Le Real Madrid a annoncé la blessure de Luka Jovic, son attaquant serbe de 22 ans. Revenu de Serbie en début de semaine, il s'est fait, selon un communiqué de son club, une « fracture extra-articulaire de l'os calcanéum du pied droit (le talon) » à son domici… [+538 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Bernard Laporte lance l'idée d'un deuxième Tournoi des Six Nations à l'automne - Rugby - Six Nations - L'Équipe.fr", "description": "Face à la perspective d'une annulation des tournées d'été et d'automne, les dirigeants de World Rugby, dont Bernard Laporte est désormais vice-président, travaillent sur plusieurs hypothèses, dont un deuxième Tournoi des Six Nations à l'automne.", "url": "https://www.lequipe.fr/Rugby/Actualites/Bernard-laporte-lance-l-idee-d-un-deuxieme-tournoi-des-six-nations-a-l-automne/1133167", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/bernard-laporte-pense-a-un-deuxieme-tournoi-des-six-nations-pour-compenser-l-annulation-des-tournees/1500000001334271/0:0,1998:1332-640-427-75/80d3e.jpg", "publishedAt": "2020-05-08T16:50:46Z", "content": "Lors d'un entretien en direct sur le site du Figaro.fr, ce vendredi, le président de la Fédération française de rugby (FFR), Bernard Laporte, a estimé qu'« il était extrêmement peu probable que les tournées prévues au mois de juillet aient lieu », même si ces… [+1864 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Arnaud Hermant", "title": "Le PSG veut une ristourne pour Icardi - Foot - L1 - L'Équipe.fr", "description": "Le Paris-Saint-Germain souhaite conserver l'Argentin prêté par l'Inter Milan qui semble lui aussi vouloir rester. Mais avec la crise du coronavirus, Paris estime son prix inférieur à 70 M€.", "url": "https://www.lequipe.fr/Football/Article/Le-psg-veut-une-ristourne-pour-icardi/1133164", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/mauro-icardi-devant-le-gardien-anthony-lopes-lors-de-la-victoire-du-psg-au-parc-des-princes-contre-l/1500000001334269/482:129,1565:1212-640-640-75/d4113.jpg", "publishedAt": "2020-05-08T16:50:00Z", "content": "Ça bouge dans le dossier Mauro Icardi. Comme l'a annoncé la Gazzetta dello Sport dans son édition de vendredi, l'avenir du buteur parisien (27 ans), prêté par l'Inter Milan au Paris-Saint-Germain cette saison, a connu des avancées ces dernières heures. Le cha… [+320 chars]"}, {"source": {"id": null, "name": "Dailymercato.com"}, "author": "", "title": "Mercato Juve : Pjanic dit oui au Barça, mais... - Daily Mercato", "description": "La presse italienne continue de sp&eacute;culer sur un possible chass&eacute;-crois&eacute; estival entre Miralem Pjanic et un joueur du Bar&ccedil;a....", "url": "https://www.dailymercato.com/news/mercato-juve-pjanic-dit-oui-au-barca-mais", "urlToImage": "https://www.dailymercato.com/storage/icon-sport/pjanic-sourire-juve-pluie.jpeg", "publishedAt": "2020-05-08T16:26:22Z", "content": "La presse italienne continue de spéculer sur un possible chassé-croisé estival entre Miralem Pjanic et un joueur du Barça. La Juventus aimerait récupérer Arthur, mais ce dernier veut absolument rester au Barça.Pjanic a dit oui au Barça. C'est la grosse inform… [+1669 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Mathieu Rault", "title": "Ligue 1 : Jean-Michel Aulas détaille les recours intentés par l'OL - Foot Mercato", "description": "Estimant son club lésé par la décision de la LFP de mettre un terme à la saison de Ligue 1, Jean-Michel Aulas est en guerre. Par la voie d'un communiqué, le président de l'Olympique Lyonnais a détaillé les recours qu'il intente, avec comme objectifs obtenir r…", "url": "https://www.footmercato.net/a6592536338600783326-ligue-1-jean-michel-aulas-detaille-les-recours-intentes-par-lol", "urlToImage": "https://assets-fr.imgfoot.com/media/cache/1200x675/jm-aulas.jpg", "publishedAt": "2020-05-08T16:19:14Z", "content": "S'il est un personnage actif de notre championnat, alors que le 30 avril dernier le Conseil d'Administration de la Ligue de Football Professionnel a mis un terme à la saison 2019/2020 et arrêté le classement, c'est bien Jean-Michel Aulas. Septième au soir de … [+3408 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Augustin Delaporte", "title": "Le Championnat des Îles Féroé reprend à son tour ! - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a2991161829307775029-le-championnat-des-iles-feroe-reprend-a-son-tour", "urlToImage": "https://assets-fr.imgfoot.com/media/cache/1200x675/ballon-foot-terrain.jpg", "publishedAt": "2020-05-08T16:19:09Z", "content": "Ce samedi, le Championnat des Îles Féroé va reprendre. Si cela peut paraître anecdotique, il est à noter quil sagit de la première fédération membre de l'UEFA à relancer son championnat domestique. Hormis celle de la Biélorussie, bien sûr, qui est la seule li… [+515 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "A.D.", "title": "Mercato - PSG : Cette nouvelle sortie forte sur le retour de Neymar au Barça ! - Le 10 Sport", "description": "Lors du dernier mercato estival, Neymar serait passé tout près de faire son retour au FC Barcelone. Alors qu'un rapatriement au Barça serait toujours d'actualité, Robert Moreno, le coach de l'AS…", "url": "https://le10sport.com/football/mercato/mercato-psg-cette-nouvelle-sortie-forte-sur-le-retour-de-neymar-au-barca-502725", "urlToImage": "https://le10static.com/img/master/0000/0016/167480.jpeg", "publishedAt": "2020-05-08T16:15:00Z", "content": "Publié le 8 mai 2020 à 19h15 par A.D. Lors du dernier mercato estival, Neymar serait passé tout près de faire son retour au FC Barcelone. Alors qu'un rapatriement au Barça serait toujours d'actualité, Robert Moreno, le coach de l'AS Monaco, a pris positon sur… [+872 chars]"}, {"source": {"id": null, "name": "Footradio.com"}, "author": "Hadrien Rivayrand", "title": "OM : Marseille finalement privé de C1, c’est une possibilité - FootRadio.com", "description": "L'Olympique de Marseille devrait disputer la prochaine Ligue des champions. Devrait, car les Phocéens sont toujours surveillés de près par les instances du fair-play financier. Sur la Canebière, on a pris avec joie l'annonce de la fin du championnat par la Li…", "url": "https://footradio.com/presse/om-marseille-finalement-prive-de-c1-cest-une-possibilite/", "urlToImage": "https://footradio.com/wp-content/uploads/2019/08/Dario-Benedetto-OM.jpg", "publishedAt": "2020-05-08T15:43:06Z", "content": "L’Olympique de Marseille devrait disputer la prochaine Ligue des champions. Devrait, car les Phocéens sont toujours surveillés de près par les instances du fair-play financier. \r\nSur la Canebière, on a pris avec joie l’annonce de la fin du championnat par la … [+1213 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Antoine Griezmann, Lionel Messi et les stars du Barça de retour à l'entraînement - Foot - ESP - L'Équipe.fr", "description": "Découvrez en vidéo quelques moments de la séance d'entraînement du FC Barcelone.", "url": "https://www.lequipe.fr/Football/Actualites/Antoine-griezmann-lionel-messi-et-les-stars-du-barca-de-retour-a-l-entrainement/1133148", "urlToImage": "https://medias.lequipe.fr/img-video-cover/1500000001334241/640/0", "publishedAt": "2020-05-08T15:40:44Z", "content": "Rassuré sur l'état de santé du groupe après les tests passés cette semaine, le staff technique du Barça a donc décidé de convoquer les joueurs ce vendredi matin à 9h30. Afin de respecter les normes sanitaires liées au coronavirus, les joueurs ont été répartis… [+55 chars]"}, {"source": {"id": null, "name": "Basketusa.com"}, "author": "Jonathan Demay", "title": "Le journaliste Sam Smith regrette certains oublis sur les « Bad Boys » dans « The Last Dance » - BasketUSA", "description": "L'auteur de \"The Jordan Rules\" souligne que tout n'a pas été dit autour de la rivalité entre les Pistons et Michael Jordan. Et surtout les commentaires de l'arrière des Bulls en 1991.", "url": "https://www.basketusa.com/news/594697/le-journaliste-sam-smith-regrette-certains-oublis-sur-les-bad-boys-dans-the-last-dance/", "urlToImage": "https://www.basketusa.com/wp-content/uploads/2020/05/michael-jordan-isiah-thomas-570x325.jpg", "publishedAt": "2020-05-08T15:05:27Z", "content": "Le départ des Pistons, qui quittent la scène sans serrer la main des Bulls en 1991, est resté dans les mémoires. Et « The Last Dance » a relancé le débat et ravivé les plaies entre Michael Jordan et Isiah Thomas.\r\nMichael Jordan n’a pas hésité, dans le docume… [+2511 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Tesson", "title": "Un Final 8 pour la Ligue des champions, ça se précise - Sports.fr", "description": "L’UEFA envisage toujours trois possibilités pour la suite de la Ligue des champions: un déroulement classique, un Final 8 sur terrain neutre, ou une annulation. La saison 2019-2020 n’est pas terminée pour le PSG et l’OL. L’UEFA prévoit toujours d’organiser la…", "url": "https://www.sports.fr/football/final-8-ligue-champions-ca-se-precise-352042.html", "urlToImage": "https://sf.sports.fr/wp-content/uploads/2020/04/panoramic_PANOpsgpool11032020_072-1.jpg", "publishedAt": "2020-05-08T15:00:35Z", "content": "L’UEFA envisage toujours trois possibilités pour la suite de la Ligue des champions: un déroulement classique, un Final 8 sur terrain neutre, ou une annulation.\r\nLa saison 2019-2020 n’est pas terminée pour le PSG et l’OL. L’UEFA prévoit toujours d’organiser l… [+1254 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Coronavirus : l'incertitude plane sur l'Amstel Gold Race - Cyclisme - Amstel Gold Race - L'Équipe.fr", "description": "Décalée au 10 octobre dans le nouveau calendrier World Tour, l'Amstel Gold Race pourrait être menacée par une décision gouvernementale en faveur du report de grands événements sportifs en attendant un vaccin contre le coronavirus.", "url": "https://www.lequipe.fr/Cyclisme-sur-route/Actualites/Coronavirus-l-incertitude-plane-sur-l-amstel-gold-race/1133140", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/remportee-par-mathieu-van-der-poel-main-sur-le-casque-en-2019-l-amstel-gold-race-2020-est-encore/1500000001334233/0:0,1998:1332-640-427-75/04ff7.jpg", "publishedAt": "2020-05-08T14:53:11Z", "content": "Dans une missive adressée au Parlement néerlandais, Hugo de Jonge a demandé que les événements sportifs de masse en plein air comme les marathons et les courses cyclistes ne puissent pas avoir lieu « tant qu'un vaccin ou un médicament contre le Covid-19 n'aie… [+286 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Guillaume Issner", "title": "Franck Haise confirmé au poste d'entraineur du RC Lens ! - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a7064780479738533859-franck-haise-confirme-au-poste-dentraineur-du-rc-lens", "urlToImage": "https://assets-fr.imgfoot.com/media/cache/1200x675/maxnewsspecial423902.jpg", "publishedAt": "2020-05-08T14:40:26Z", "content": "Franck Haise accompagnera le RC Lens en Ligue 1 ! Le technicien dont le contrat expire en juin avec les Sang et Or a prolongé de deux ans comme vient de le dévoiler le club artésien par le biais d'un communiqué publié sur son site officiel. L'homme de 49 ans … [+1826 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Coronavirus : toujours pas de \"feu vert\" du gouvernement à la reprise en Premier League - Eurosport - FRANCE (FR)", "description": "PREMIER LEAGUE - Oliver Dowden a rappelé vendredi que le gouvernement britannique n'avait pas encoré donné son feu vert pour la reprise du football.", "url": "https://www.eurosport.fr/football/premier-league/2019-2020/coronavirus-toujours-pas-de-feu-vert-du-gouvernement-a-la-reprise-en-premier-league_sto7744419/story.shtml", "urlToImage": "https://i.eurosport.com/2020/03/08/2791351-57611030-2560-1440.jpg", "publishedAt": "2020-05-08T14:13:03Z", "content": "La reprise de la Premier League, ce n'est pas pour tout de suite. Oliver Dowden a indiqué que le gouvernement britannique n'avait pas encore donné accord pour redémarrer le championnat, arrrêté en raison de la pandémie du coronavirus. \"Ils n'ont pas reçu le f… [+1132 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "L'agent de Karl Toko Ekambi pense qu'il va rester à l'OL - Foot - Transferts - OL - L'Équipe.fr", "description": "Samir Khiat, l'agent de Karl Toko Ekambi, est confiant sur le fait de voir le Camerounais rester à l'OL, où il est prêté, cet été.", "url": "https://www.lequipe.fr/Football/Actualites/L-agent-de-karl-toko-ekambi-pense-qu-il-va-rester-a-l-ol/1133130", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/karl-toko-ekambi-pourrait-rester-a-lyon-p-lahalle-l-equipe/1500000001334223/144:94,1815:1208-640-427-75/6c723.jpg", "publishedAt": "2020-05-08T14:07:58Z", "content": "Prêté par Villarreal à l'OL en janvier avec une option d'achat fixée à 11,5 M, Karl Toko Ekambi sera-t-il toujours à Lyon la saison prochaine ? Dans une interview à L'Équipe du Soir, son agent Samir Khiat s'est montré plutôt confiant : « L'OL est satisfait du… [+322 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Brest ne prolonge pas Mathias Autret, en fin de contrat - Foot - L1 - Brest - L'Équipe.fr", "description": "Selon <i>le Télégramme</i>, l'attaquant Mathias Autret n'a pas reçu de proposition de prolongation de la part du Stade Brestois. Il se retrouve libre.", "url": "https://www.lequipe.fr/Football/Actualites/Brest-ne-prolonge-pas-mathias-autret-en-fin-de-contrat/1133116", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/autret-et-brest-c-est-fini-v-michel-l-equipe/1500000001334206/188:218,1629:1179-640-427-75/3fcd9.jpg", "publishedAt": "2020-05-08T13:26:43Z", "content": "Formé au Stade Brestois, Autret avait quitté le club en 2010 pour évoluer à Lorient, Caen et Lens, avant de revenir en 2017. Il a disputé 23 matches cette saison en Ligue 1, portant à certaines reprises le brassard de capitaine."}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "La rédaction", "title": "Mercato - OM : M'Baye Niang prend une décision fracassante ! - Le 10 Sport", "description": "Alors qu’André Villas-Boas souhaite recruter un attaquant pour la saison prochaine, l’une des pistes de l’entraîneur portugais, M’Baye Niang, aurait résilié le bail de son domicile à Rennes…", "url": "https://le10sport.com/football/mercato/mercato-om-un-message-clair-pour-lavenir-de-cette-piste-offensive-502737", "urlToImage": "https://le10static.com/img/master/0000/0016/168876.jpeg", "publishedAt": "2020-05-08T13:15:00Z", "content": "Publié le 8 mai 2020 à 15h15 par La rédaction Alors quAndré Villas-Boas souhaite recruter un attaquant pour la saison prochaine, lune des pistes de lentraîneur portugais, MBaye Niang, aurait résilié le bail de son domicile à Rennes\r\nSi ce nest pas un appel du… [+1121 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Le VAR peut être abandonné à la reprise des compétitions - Foot - L'Équipe.fr", "description": "L'International Board (IFAB), qui régit les lois du jeu, vient d'annoncer que l'assistance à l'arbitrage vidéo pourra être suspendue provisoirement si des compétitions reprennent pendant la pandémie de coronavirus.", "url": "https://www.lequipe.fr/Football/Actualites/Le-var-peut-etre-abandonne-a-la-reprise-des-competitions/1133111", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/les-competitions-qui-le-souhaitent-pourront-cesser-d-utiliser-le-var-a-leur-reprise-j-prevost-l-eq/1500000001334197/0:0,1995:1330-640-427-75/4c1ff.jpg", "publishedAt": "2020-05-08T13:11:40Z", "content": "« Si les organisateurs de compétitions en décident ainsi, les compétitions dans lesquelles l'assistance vidéo à l'arbitrage est mise en oeuvre peuvent cesser d'utiliser cette technologie dès leur reprise (et temporairement). Toutefois, si le recours à l'assis… [+244 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Tesson", "title": "Selon Maldini, la France « a fait une erreur » - Sports.fr", "description": "L’ancien défenseur de l’AC Milan estime que les autorités français ont pris leur décision trop rapidement concernant l’arrêt de la saison.  Paolo Maldini, légende du football italien et de l’AC Milan, milite pour une tentative de reprise du championnat en Ser…", "url": "https://www.sports.fr/football/maldini-france-a-erreur-352016.html", "urlToImage": "https://sf.sports.fr/wp-content/uploads/2020/05/panoramic_PANOTORMIL26092019_036-1.jpg", "publishedAt": "2020-05-08T12:51:59Z", "content": "L’ancien défenseur de l’AC Milan estime que les autorités français ont pris leur décision trop rapidement concernant l’arrêt de la saison. \r\nPaolo Maldini, légende du football italien et de l’AC Milan, milite pour une tentative de reprise du championnat en Se… [+1491 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "D.M.", "title": "Mercato - PSG : Une décision retentissante prise pour l’avenir de Pogba ! - Le 10 Sport", "description": "Le Real Madrid aurait fait une croix sur un transfert de Paul Pogba. Plusieurs raisons sont évoquées par la presse espagnole pour justifier ce choix.", "url": "https://le10sport.com/football/mercato/mercato-psg-une-decision-retentissante-pris-pour-lavenir-de-pogba-502713", "urlToImage": "https://le10static.com/img/master/0000/0016/168861.jpeg", "publishedAt": "2020-05-08T12:15:00Z", "content": "Publié le 8 mai 2020 à 14h15 par D.M. Le Real Madrid aurait fait une croix sur un transfert de Paul Pogba. Plusieurs raisons sont évoquées par la presse espagnole pour justifier ce choix.\r\nA la recherche de « nouveaux défis », Paul Pogba semblait tout proche … [+1265 chars]"}, {"source": {"id": null, "name": "Maxifoot.fr"}, "author": null, "title": "Rennes : Camavinga sort du silence pour son avenir ! - Maxifoot", "description": "Dans les colonnes du journal Ouest-France ce vendredi, le jeune milieu de terrain du Stade Rennais Eduardo Camavinga a commenté les rumeurs concernant&nb ...", "url": "http://www.maxifoot.fr/football/article-43642.htm", "urlToImage": "http://images3.maxifoot.fr/camavinga-rennes-13.jpg", "publishedAt": "2020-05-08T11:58:00Z", "content": "Dans les colonnes du journal Ouest-France ce vendredi, le jeune milieu de terrain du Stade Rennais Eduardo Camavinga a commenté les rumeurs concernant son avenir. Un brin évasif, le prodige breton a toutefois pris le soin de démentir quelques fausses affirmat… [+2752 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Après avoir brisé le confinement trois fois en 24 heures, un joueur de Manchester City dénonce un harcèlement - Le Figaro", "description": "Après s'être retrouvé au cœur d'un scandale sexuel il y a quelques semaines, pour avoir notamment passé la soirée avec deux escort-girls en plein confinement, Kyle Walker, le défenseur de Manchester City, a de nouveau enfreint les règles ces derniers jours. T…", "url": "https://sport24.lefigaro.fr/football/etranger/angleterre/fil-info/apres-avoir-brise-le-confinement-trois-fois-en-24-heures-un-joueur-de-manchester-city-denonce-un-harcelement-1001363", "urlToImage": null, "publishedAt": "2020-05-08T11:56:00Z", "content": "Après s'être retrouvé au cur d'un scandale sexuel il y a quelques semaines, pour avoir notamment passé la soirée avec deux escort-girls en plein confinement, Kyle Walker, le défenseur de Manchester City, a de nouveau enfreint les règles ces derniers jours. Th… [+1170 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "La rédaction", "title": "PSG - Malaise : Angel Di Maria se fait fracasser par une légende de Manchester United ! - Le 10 Sport", "description": "Après les aveux de la femme d'Angel Di Maria sur son passage à Manchester United, l’ancienne légende du club du nord de l'Angleterre, Gary Neville, est revenu sur le passage de l’international…", "url": "https://le10sport.com/buzz/psg-malaise-cette-legende-de-manchester-qui-dezingue-di-maria-502706", "urlToImage": "https://le10static.com/img/master/0000/0016/168858.jpeg", "publishedAt": "2020-05-08T11:45:00Z", "content": "Publié le 8 mai 2020 à 13h45 par La rédaction Après les aveux de la femme d'Angel Di Maria sur son passage à Manchester United, lancienne légende du club du nord de l'Angleterre, Gary Neville, est revenu sur le passage de linternational argentin chez les Red … [+944 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "PSG : Mbappé en rock-star, le juteux plan du Real dévoilé - Foot01.com", "description": "En 2022, le Real Madrid aura la chance d’évoluer dans un stade Bernabeu flambant neuf. Et pour Florentino Pérez, il est inenvisageable d’entrer dans ce magnifique écrin… sans Kylian Mbappé.\r\n« Kylian Mbappé et le nouveau Bernabeu » sont associés par le…", "url": "https://www.foot01.com/equipe/paris/psg-mbappe-en-rock-star-le-juteux-plan-du-real-devoile,348769", "urlToImage": "https://www.foot01.com/img/images/1920x1080/2020/May/08/psg-mbappe-rock-star-du-futur-bernabeu-au-real-icon_0248_127142247,284371.jpg", "publishedAt": "2020-05-08T11:38:25Z", "content": "En 2022, le Real Madrid aura la chance dévoluer dans un stade Bernabeu flambant neuf. Et pour Florentino Pérez, il est inenvisageable dentrer dans ce magnifique écrin sans Kylian Mbappé.\r\n« Kylian Mbappé et le nouveau Bernabeu » sont associés par le journal A… [+1568 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Cedric Rablat", "title": "Mercato : vers une grande braderie estivale en Bundesliga - Foot Mercato", "description": "Jeudi, la Ligue de football allemande annonçait le retour de la Bundesliga à partir du 16 mai. Une excellente nouvelle pour les clubs concernés mais cela ne devrait pas masquer l'obligation du moment : renflouer les caisses. Pour y parvenir, les clubs vont de…", "url": "https://www.footmercato.net/a3632421776450522503-mercato-vers-une-grande-braderie-estivale-en-bundesliga", "urlToImage": "https://assets-fr.imgfoot.com/media/cache/1200x675/corentin-tolisso-1920.jpg", "publishedAt": "2020-05-08T11:36:39Z", "content": "« La DFL a décidé de continuer la saison «à partir du 15 mai». Le 16 mai a finalement été retenu comme la date exacte. Le DFL a été guidé par la décision des gouvernements fédéraux et des Länders selon laquelle \"à partir de la seconde moitié de mai\", un retou… [+3704 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Juliette Meurin", "title": "Rugby et coronavirus : le Stade Toulousain demande de l'aide aux supporters en créant un \"mur de soutien\" - France 3 Régions", "description": "Avec la fin du championnat de rugby, de nombreux clubs se retrouvent en difficulté financière. Le Stade Toulousain lance un appel à l'aide à ses supporters en créant un \"mur de soutien\" au stade Ernest Wallon.", "url": "https://france3-regions.francetvinfo.fr/occitanie/haute-garonne/toulouse/rugby-coronavirus-stade-toulousain-demande-aide-aux-supporters-creant-mur-soutien-1826280.html", "urlToImage": "https://france3-regions.francetvinfo.fr/occitanie/sites/regions_france3/files/styles/top_big/public/assets/images/2020/05/08/stade_17-4807680.jpg?itok=ZdV7CKmM", "publishedAt": "2020-05-08T11:31:24Z", "content": "Le Stade Toulousain a lancé ce jeudi \"un appel au soutien de sa communauté de supporters\" pour la construction d'un \"Mur de Soutien\", dans l'enceinte du stade Ernest Wallon, avec la possibilité d'acheter une brique gravée à son nom. Depuis les mesures de conf… [+1199 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "Barça: Rakitic raconte le phénomène Messi « qui ne veut même pas perdre à l'entraînement » - RMC Sport", "description": "Interrogé jeudi sur Sky Deutschland, le milieu de terrain du FC Barcelone Ivan Rakitic a encensé son partenaire Lionel Messi. Pour le Croate, le génie de l’Argentin ne doit rien au hasard.", "url": "https://rmcsport.bfmtv.com/football/barca-rakitic-raconte-le-phenomene-messi-qui-ne-veut-meme-pas-perdre-a-l-entrainement-1909881.html", "urlToImage": "https://www.bfmtv.com/i/0/0/f15/560ef3fd593bb43418108a04f49d5.jpeg", "publishedAt": "2020-05-08T11:18:21Z", "content": null}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "\"C'est un exemple pour le football\" : Aleksander Ceferin salue la reprise de la Bundesliga - Eurosport - FRANCE (FR)", "description": "BUNDESLIGA - Le président de l'UEFA Aleksander Ceferin a salué la décision de reprendre la Bundesliga le 16 mai prochain.", "url": "https://www.eurosport.fr/football/bundesliga/2019-2020/c-est-un-exemple-pour-le-football-aleksander-ceferin-salue-la-reprise-de-la-bundesliga_sto7744228/story.shtml", "urlToImage": "https://i.eurosport.com/2020/04/23/2810076-57966548-2560-1440.jpg", "publishedAt": "2020-05-08T11:15:51Z", "content": null}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Coronavirus : tous les joueurs de l'Inter Milan testés négatifs - Foot - ITA - Inter - L'Équipe.fr", "description": "L'Inter Milan a annoncé que tous ses joueurs ont été testés négatifs au Covid-19. Ils vont donc reprendre l'entraînement individuel, ce vendredi.", "url": "https://www.lequipe.fr/Football/Actualites/Coronavirus-tous-les-joueurs-de-l-inter-milan-testes-negatifs/1133080", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/pas-de-cas-positif-a-l-inter-r-ramaccia-presse-sports/1500000001334167/0:0,1995:1330-640-427-75/16bf1.jpg", "publishedAt": "2020-05-08T11:09:32Z", "content": "Troisième du Championnat au moment de l'interruption de la saison pour cause de pandémie de coronavirus, l'Inter Milan va faire reprendre l'entraînement individuel à ses joueurs ce vendredi après-midi, après avoir communiqué une bonne nouvelle. Le club milana… [+116 chars]"}, {"source": {"id": null, "name": "Basket-infos.com"}, "author": null, "title": "Les Warriors prépareraient le terrain pour Giannis Antetokounmpo - Basket Infos", "description": "Si la free agency 2020 ne changera sans doute pas le visage de la ligue vu le peu de stars sur le ma...", "url": "https://basket-infos.com/2020/05/08/les-warriors-prepareraient-le-terrain-pour-giannis-antetokounmpo/", "urlToImage": "https://basket-infos.com/wp-content/uploads/2019/02/Stephen-Curry-et-Giannis-Antetokounmpo-660x330.jpg", "publishedAt": "2020-05-08T10:40:00Z", "content": "Si la free agency 2020 ne changera sans doute pas le visage de la ligue vu le peu de stars sur le marché, celle de 2021 pourrait être un remake de celle de 2019, avec potentiellement un joueur comme Giannis Antetokounmpo sur le marché. L’ailier grec des Bucks… [+1707 chars]"}, {"source": {"id": null, "name": "Welovetennis.fr"}, "author": null, "title": "ATP > Nadal : \"Bien sûr que j'aimerais terminer en étant le joueur avec le plus de titres du Grand Chelem\" - We Love Tennis !", "description": "Rafael Nadal s’exprime énormément depuis le début de la crise dans les médias espagnols. Le Majorquin s’est confié à La Vox de Galicia où il est notamment interrogé sur la course aux titres du Grand Chelem. L’actuel numéro 2 mondial, qui en compte 19 soit un …", "url": "https://www.welovetennis.fr/atp/nadal-bien-sur-que-jaimerais-terminer-en-etant-le-joueur-avec-le-plus-de-titres-du-grand-chelem", "urlToImage": "https://www.welovetennis.fr/wp-content/uploads/2020/01/Nadal-AO-2020-5.jpeg", "publishedAt": "2020-05-08T10:16:00Z", "content": "Rafael Nadal sexprime énormément depuis le début de la crise dans les médias espagnols. Le Majorquin sest confié à La Vox de Galicia où il est notamment interrogé sur la course aux titres du Grand Chelem. Lactuel numéro 2 mondial, qui en compte 19 soit un de … [+717 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "La star du foot sud-coréen, Son Heung-min, a fait forte impression pendant son service militaire - Le Figaro", "description": "L’attaquant de Tottenham a terminé ses trois semaines de formation militaire. Il a reçu les félicitations du corps des Marines.", "url": "https://sport24.lefigaro.fr/football/etranger/actualites/la-star-du-foot-sud-coreen-son-heung-min-a-fait-forte-impression-pendant-son-service-militaire-1001354", "urlToImage": "http://sport24.lefigaro.fr/var/plain_site/storage/images/football/etranger/actualites/la-star-du-foot-sud-coreen-son-heung-min-a-fait-forte-impression-pendant-son-service-militaire-1001354/27098249-1-fre-FR/La-star-du-foot-sud-coreen-Son-Heung-min-a-fait-forte-impression-pendant-son-service-militaire.jpg", "publishedAt": "2020-05-08T09:53:00Z", "content": "Lattaquant de Tottenham a terminé ses trois semaines de formation militaire. Il a reçu les félicitations du corps des Marines.Démobilisé avec les honneurs des Marines. La star du football sud-coréen Son Heung-min a achevé vendredi avec les honneurs sa formati… [+2784 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/marc.alvarez1", "title": "LaLiga pense redémarrer le 19-20 juin et finir en cinq semaines - Canal Supporters", "description": "D'autres Ligues européennens souhaitent reprendre le mois prochain. Parmi elles, LaLiga, où les clubs ont déjà repris leur activité.", "url": "https://canal-supporters.com/2020/05/laliga-pense-redemarrer-le-19-20-juin-et-finir-en-cinq-semaines/", "urlToImage": "https://canal-supporters.com/wp-content/uploads/2020/04/liga.png", "publishedAt": "2020-05-08T09:47:41Z", "content": "La semaine prochaine la Bundesliga reprendra. Un petit événement dans le monde du football et du sport salué par Aleksander Ceferin, président de l’UEFA (voir ici). D’autres Ligues européennes souhaitent reprendre le mois prochain. Parmi elles, LaLiga, où les… [+1144 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Coronavirus : la Premier League investit 4,5 millions d'euros dans des tests - Foot - ANG - Coronavirus - L'Équipe.fr", "description": "Selon le <i>Telegraph</i>, la Premier League a investi 4,5 millions d'euros pour acheter des tests de dépistage au coronavirus.", "url": "https://www.lequipe.fr/Football/Actualites/Coronavirus-la-premier-league-investit-4-5-millions-d-euros-dans-des-tests/1133057", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/la-premier-league-a-passe-une-grosse-commande-de-tests-f-porcu-l-equipe/1500000001334141/0:0,1995:1330-640-427-75/5759e.jpg", "publishedAt": "2020-05-08T09:22:21Z", "content": "Alors que la Premier League avance sur son protocole de reprise du Championnat, interrompu par la pandémie de coronavirus, le Telegraph révèle ce samedi que les clubs ont conclu un accord de 4 millions de livres sterling (4,5 M) avec la société de biotechnolo… [+87 chars]"}, {"source": {"id": null, "name": "Larepubliquedespyrenees.fr"}, "author": "La République des Pyrénées", "title": "Basket. Léo Cavalière : « L’Elan Béarnais ne m’a rien proposé » - La République des Pyrénées", "description": "Longtemps érigé en totem des valeurs ancestrales de l’Élan Béarnais, l’intérieur Léo Cavalière ne portera plus le maillot palois. À 24 ans, le capitaine s’est engagé pour les trois prochaines saisons avec Strasbourg. L’heure de revenir avec émotions sur un lo…", "url": "https://www.larepubliquedespyrenees.fr/2020/05/08/basket-leo-cavaliere-l-elan-bearnais-ne-m-a-rien-propose,2695347.php", "urlToImage": "https://images.larepubliquedespyrenees.fr/2020/05/08/5eb51e2aa43f5eea6e2803c8/golden/pendant-neuf-ans-dont.jpg", "publishedAt": "2020-05-08T09:05:24Z", "content": "Pendant neuf ans, dont sept saisons chez les pros, Léo Cavalière a défendu les couleurs de lElan Béarnais avec ardeur et passion.\r\nPar Propos recueillis par Jean Fauret,\r\n publié le 8 mai 2020 à 11h05, modifié à12h00.\r\nLongtemps érigé en totem des valeurs anc… [+280 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Henry : « De Bruyne est sur une autre planète » - SO FOOT", "description": "Gros coup de foudre. Dans une longue interview accordée à Sky Sports, Thierry Henry s'est notamment confié sur un certain Kevin De Bruyne. ...", "url": "https://www.sofoot.com/henry-de-bruyne-est-sur-une-autre-planete-483145.html", "urlToImage": "https://www.sofoot.com/IMG/img-twitter-483145.png", "publishedAt": "2020-05-08T08:46:00Z", "content": "Gros coup de foudre. Dans une longue interview accordée à Sky Sports, Thierry Henry s'est notamment confié sur un certain Kevin De Bruyne. \r\nLa légende d'Arsenal a littéralement été sous le charme du Citizen, qu'il a déjà connu lorsqu'il était l'adjoint de Ro… [+980 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Olivier Delcourt (Dijon) : « Certains collègues sont obsédés par la fin du Championnat » - Foot - L1 - L'Équipe.fr", "description": "Dans un entretien à <i>Libération</i>, le président de Dijon a critiqué l'attitude de certains dirigeants concernant l'arrêt de la Ligue 1, pour cause de pandémie de coronavirus.", "url": "https://www.lequipe.fr/Football/Actualites/Olivier-delcourt-dijon-certains-collegues-sont-obsedes-par-la-fin-du-championnat/1133029", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/olivier-delcourt-aurait-aime-l-union-sacree-a-martin-l-equipe/1500000001334117/0:0,1995:1330-640-427-75/6c0d0.jpg", "publishedAt": "2020-05-08T08:26:48Z", "content": "« Certains collègues sont obsédés par la fin du Championnat, alors que ça devrait être l'union sacrée, a-t-il confié, dans un portrait dressé par Libération. La priorité, aujourd'hui, ce n'est pas le football mais se débarrasser du virus. Nos anciens ont vécu… [+159 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "Une grande espoir du ski autrichien retrouvée morte - RMC Sport", "description": "Johanna Bassani, grande espoir du ski autrichien spécialisée dans le combiné nordique, a été retrouvée morte. Âgée de 18 ans, elle se serait suicidée en raison de la très forte pression exercée sur sa carrière.", "url": "https://rmcsport.bfmtv.com/sports-d-hiver/une-grande-espoir-du-ski-autrichien-retrouvee-morte-1909736.html", "urlToImage": "https://www.bfmtv.com/i/0/0/97b/9339649fd6541deefac8dbbd6e416.jpg", "publishedAt": "2020-05-08T07:29:13Z", "content": null}, {"source": {"id": null, "name": "Nextgen-auto.com"}, "author": "A. Combralier", "title": "Optimisme ou déni ? La F1 prévoit toujours 22 courses et un calendrier record en 2021 - Nextgen-Auto.com", "description": "Formule 1 | Si le plan de la F1 se déroule comme prévu, ce qui est encore loin d'être acquis, le calendrier 2020 devrait se clore à la mi-décembre avec le Grand (...)", "url": "https://motorsport.nextgen-auto.com/fr/formule-1/optimisme-ou-deni-la-f1-prevoit-toujours-22-courses-et-un-calendrier-record-en,148301.html", "urlToImage": "https://motorsport.nextgen-auto.com/IMG/arton148301.jpg", "publishedAt": "2020-05-08T07:01:03Z", "content": "Si le plan de la F1 se déroule comme prévu, ce qui est encore loin dêtre acquis, le calendrier 2020 devrait se clore à la mi-décembre avec le Grand Prix dAbu Dhabi.\r\nMais tout en préparant 2020, il faut aussi dores et déjà penser à l’an prochain Et cela sanno… [+3347 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Consultation : votez pour les meilleurs ailiers de la saison de Ligue 1 - Foot - L1 - Consultation - L'Équipe.fr", "description": "Depuis mardi et jusqu'à samedi, « L'Équipe » vous propose de voter pour l'équipe type de la saison de Ligue 1, qui a pris fin prématurément à cause de la crise sanitaire. Ce vendredi, vous pouvez choisir les meilleurs ailiers.", "url": "https://www.lequipe.fr/Football/Actualites/Consultation-votez-pour-les-meilleurs-ailiers-de-la-saison-de-ligue-1/1132166", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/di-maria-et-neymar-sont-tous-les-deux-nommes-s-mantey-l-equipe/1500000001333166/109:122,1438:1007-640-427-75/65dd7.jpg", "publishedAt": "2020-05-08T07:00:00Z", "content": "Angel Di Maria (PSG). Le meilleur passeur du Championnat (14 passes décisives en plus de ses 7 buts) n'attire pas autant la lumière que ses compagnons d'attaque, mais il a encore livré une saison de haute volée. Chouchou de Thomas Tuchel, l'Argentin a tenté (… [+3264 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Nouveaux cas de Covid-19 à la Fiorentina et la Sampdoria - SO FOOT", "description": "Retour à la case départ. Voilà la reprise de Serie A qui s'éloigne à nouveau. Dans un communiqué publié ce jeudi sur son site officiel, la ...", "url": "https://www.sofoot.com/nouveaux-cas-de-covid-19-a-la-fiorentina-et-la-sampdoria-483139.html", "urlToImage": "https://www.sofoot.com/IMG/img-twitter-483139.png", "publishedAt": "2020-05-08T07:00:00Z", "content": "Retour à la case départ. Voilà la reprise de Serie A qui s'éloigne à nouveau. Dans un communiqué publié ce jeudi sur son site officiel, la Fiorentina a annoncé avoir découvert que six de ses membres, dont trois joueurs, ont été testés positifs au coronavirus.… [+732 chars]"}, {"source": {"id": null, "name": "Rugbyrama.fr"}, "author": "Rugbyrama", "title": "Un nouveau Super Rugby en juillet, Slade signe au Japon... Les 5 infos de ce jeudi - Rugbyrama.fr", "description": "Un Super Rugby 100% néo-zélandais va se tenir en juillet, le médecin de World Rugby serait \"très surpris qu’il n’y ait pas de rugby de compétition avant la fin de l’année\", Colin Slade signe dans un club japonais.", "url": "https://www.rugbyrama.fr/rugby/un-nouveau-super-rugby-en-juillet-slade-signe-au-japon.-les-5-infos-de-ce-jeudi_sto7743826/story.shtml", "urlToImage": "https://i.rugbyrama.fr/2020/05/07/2815797-58080975-1600-900.jpg", "publishedAt": "2020-05-08T06:53:24Z", "content": "Un Super Rugby néo-zélandais en juillet\r\nActuellement en niveau 3, le gouvernement néo-zélandais a annoncé que le rugby faisait partie des sports autorisés à reprendre lorsque le pays repasserait en niveau 2. Une version très locale du Super Rugby appelée \"In… [+2205 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Kevin Saccani", "title": "Le vice-président d'Amiens dézingue le président de l'UNFP ! - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a1956516663164052021-le-vice-president-damiens-dezingue-le-president-de-lunfp", "urlToImage": "https://assets-fr.imgfoot.com/media/cache/1200x675/mulazzi.jpg", "publishedAt": "2020-05-08T06:12:30Z", "content": "La relégation en Ligue 2 d'Amiens, après l'arrêt du championnat de France de Ligue 1, ne passe toujours pas au sein de la formation picarde. Dans une déclaration sur les réseaux sociaux du club, le vice-président, Luigi Mulazzi, a pris la suite de son entraîn… [+1532 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "francetv sport", "title": "Coronavirus : le développement du sport au féminin est-il en péril ? - Franceinfo", "description": "À l’arrêt forcé depuis près de deux mois, les sportives de haut niveau prennent, à l’instar de leurs homologues masculins, leur mal en patience. Mais les inquiétudes quant à la reprise sont d’autant plus fortes que pour l’immense majorité d’entre elles, le mo…", "url": "https://sport.francetvinfo.fr/sport-feminin/coronavirus-le-developpement-du-sport-au-feminin-est-il-en-peril", "urlToImage": "https://assets.sport.francetvinfo.fr/sites/default/files/styles/large_16_9/public/2020-05/066_dppi_20319061_043.jpg?itok=79SDGo2T", "publishedAt": "2020-05-08T06:05:53Z", "content": "À larrêt forcé depuis près de deux mois, les sportives de haut niveau prennent, à linstar de leurs homologues masculins, leur mal en patience. Mais les inquiétudes quant à la reprise sont dautant plus fortes que pour limmense majorité dentre elles, le modèle … [+14301 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "francetv sport", "title": "\"Les frontières de l'intimité sont plus poreuses\" : quand les sportifs se mettent à nu - Franceinfo", "description": "Avec le confinement, les sportifs se sont retrouvés, comme les autres, chez eux. Leur cadre de vie a changé, ce qu'ils ont donné à voir d'eux-mêmes, aussi. De Stan Wawrinka à Sandrine Gruda, en passant par des sportifs professionnels plus confidentiels, ils o…", "url": "https://sport.francetvinfo.fr/omnisport/les-frontieres-de-lintimite-sont-plus-poreuses-quand-les-sportifs-se-mettent-nu", "urlToImage": "https://assets.sport.francetvinfo.fr/sites/default/files/styles/large_16_9/public/2020-01/000_1o47ck.jpg?h=fe53e6ed&itok=oSJycZMx", "publishedAt": "2020-05-08T05:05:26Z", "content": "Avec le confinement, les sportifs se sont retrouvés, comme les autres, chez eux. Leur cadre de vie a changé, ce qu'ils ont donné à voir d'eux-mêmes, aussi. De Stan Wawrinka à Sandrine Gruda, en passant par des sportifs professionnels plus confidentiels, ils o… [+11079 chars]"}, {"source": {"id": null, "name": "Peuple-vert.fr"}, "author": "Alexandre S.", "title": "#Mercato : L'ASSE transforme le prêt pour Timothée Kolodziejczak ! ⋆ Peuple-Vert.fr - Foot - ASSE - Actualité - Peuple Vert", "description": "Timothée Kolodziejczak sera bien stéphanois la saison prochaine. Mis à l'écart par Claude Puel durant une partie de la saison, le défenseur a été définitivement transféré à St-Etienne qui possédait une option d'achat rendue automatique après un certain nombre…", "url": "https://peuple-vert.fr/actualite/mercato-lasse-transforme-le-pret-pour-timothee-kolodziejczak/", "urlToImage": "https://peuple-vert.fr/wp-content/uploads/2020/02/Icon_DIB_011219_11_100.jpg", "publishedAt": "2020-05-08T04:56:26Z", "content": "Timothée Kolodziejczak a joué 25 rencontres avec l'AS St-Etienne la saison passée. Ce nombre correspond-t-il à celui obligeant l'ASSE à acheter automatiquement le désormais ex-défenseur des Tigres de Monterrey ? Difficile à savoir. Macky Diong, journaliste au… [+528 chars]"}, {"source": {"id": null, "name": "Girondins4ever.com"}, "author": null, "title": "Hugo Gambor s’engage au Paris FC malgré les sollicitations de Bordeaux - Girondins4Ever", "description": "08/05 - 6h30 - Selon L'Equipe, Hugo Gambor va s'engager en faveur du Paris FC. Ce jeune défenseur central de 17 ans, international U18 français, évoluait à l'US Orléans,", "url": "https://www.girondins4ever.com/breves/20200508/344252-hugo-gambor-sengage-au-paris-fc-malgre-les-sollicitations-de-bordeaux/", "urlToImage": "https://www.girondins4ever.com/wp-content/uploads/2020/05/Hugo-Gambor.jpg", "publishedAt": "2020-05-08T04:30:00Z", "content": "Selon L’Equipe, Hugo Gambor va s’engager en faveur du Paris FC. Ce jeune défenseur central de 17 ans, international U18 français, évoluait à l’US Orléans, et va signer son premier contrat professionnel. Toujours selon le quotidien national, ce joueur était so… [+217 chars]"}, {"source": {"id": null, "name": "Centre-presse.fr"}, "author": null, "title": "À Poitiers, la rentrée scolaire se fera tout en prudence - Centre Presse", "description": "Les 45 écoles de Poitiers seront ouvertes le 12 mai prochain, la restauration scolaire aussi. La préparation de cette rentrée « inédite » mo", "url": "https://www.centre-presse.fr/article-740850-a-poitiers-la-rentree-scolaire-se-fera-tout-en-prudence.html", "urlToImage": "https://www.centre-presse.fr/images/articles/800x600_345884.jpg", "publishedAt": "2020-05-08T03:04:11Z", "content": "Habituellement, la rentrée scolaire après les vacances de printemps est une formalité. Celle du 12 mai 2020 sera exceptionnelle. Après deux mois de confinement pour lutter contre la propagation du coronavirus, ce sont des écoles d'une forme totalement inédite… [+2473 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Céline Dumerc (future manager générale des Bleues) : « J'espère être à la hauteur » - Basket - Bleues - L'Équipe.fr", "description": "Céline Dumerc, l'ancienne capitaine des Bleues (37 ans), est ravie de devenir dans les prochains mois la future « General manager » de l'équipe de France.", "url": "https://www.lequipe.fr/Basket/Actualites/Celine-dumerc-future-manager-generale-des-bleues-j-espere-etre-a-la-hauteur/1132973", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/celine-dumerc-occupera-chez-les-bleues-la-meme-fonction-que-boris-diaw-aupres-de-l-equipe-de-france/1500000001334068/0:427,1998:1759-640-427-75/f3cc4.jpg", "publishedAt": "2020-05-07T21:54:35Z", "content": "« Avez-vous déjà une idée du contenu de ce poste de manager général des Bleues ?C'est encore assez flou, je ne sais pas quelles cases je dois remplir. Ce sont des choses qui vont se dessiner avec le staff. J'ai hâte de commencer même si je dois attendre un pe… [+2167 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Cedric Rablat", "title": "CdF, CdL : et si les finales se disputaient finalement en juillet ? - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a1244633169460909714-cdf-cdl-et-si-les-finales-se-disputaient-finalement-en-juillet", "urlToImage": "https://assets-fr.imgfoot.com/media/cache/1200x675/coupe.jpg", "publishedAt": "2020-05-07T21:15:03Z", "content": "Noël Le Graët a évoqué à plusieurs reprises la possibilité de disputer les finales de coupes nationales en août à huis clos. Le président de la FFF espère secrètement que le premier match qui marque la reprise du football en France soit la finale de Coupe de … [+809 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "Ligue des champions: « Ce qu'a accompli Zidane au Real ne sera jamais égalé », selon Cannavaro - RMC Sport", "description": "Adversaire de Zinédine Zidane pendant des années, Fabio Cannavaro était très fan du milieu offensif français. Et il semble aussi grandement apprécier l'entraîneur.", "url": "https://rmcsport.bfmtv.com/football/ligue-des-champions-ce-qu-a-accompli-zidane-au-real-ne-sera-jamais-egale-selon-cannavaro-1909688.html", "urlToImage": "https://www.bfmtv.com/i/0/0/782/92e349962db4148a7b1c209eb3ba6.jpeg", "publishedAt": "2020-05-07T21:14:46Z", "content": null}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Déconfinement : les sportifs de haut niveau vont pouvoir reprendre en salle - Le Parisien", "description": "Il sera possible de pratiquer du sport seulement en extérieur dès lundi. Sauf pour les athlètes de haut niveau qui pourront bientôt s’entraî", "url": "http://www.leparisien.fr/sports/deconfinement-les-sportifs-de-haut-niveau-vont-pouvoir-reprendre-en-salle-07-05-2020-8312979.php", "urlToImage": "https://arc-anglerfish-eu-central-1-prod-leparisien.s3.amazonaws.com/public/CYLF5UCB6K3734RBXWDUOSVTW4.jpg", "publishedAt": "2020-05-07T20:13:00Z", "content": "Une reprise de la pratique sportive « individuelle et en extérieur » Le gouvernement a confirmé ce jeudi la piste qui était envisagée depuis plusieurs jours. Les piscines, les gymnases et tous les espaces couverts resteront fermés, au moins jusqu'au 2 juin; m… [+2006 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Coronavirus : bientôt un décret pour interdire le foot pendant l’état d’urgence sanitaire - Le Parisien", "description": "Malgré tout un dispositif législatif prévu par l’Etat, l’arrêt des compétitions ne passe pas pour certains clubs de football qui préparent d", "url": "http://www.leparisien.fr/sports/football/coronavirus-bientot-un-decret-pour-interdire-le-foot-pendant-l-etat-d-urgence-sanitaire-07-05-2020-8312913.php", "urlToImage": "https://arc-anglerfish-eu-central-1-prod-leparisien.s3.amazonaws.com/public/D2FXN4X3YSCDETA37WD5CVB3OA.jpg", "publishedAt": "2020-05-07T19:34:00Z", "content": "Les clubs contestataires vont pouvoir organiser leurs défenses et préparer leurs attaques, pas sur les pelouses mais sur le terrain judiciaire. Selon nos informations, le gouvernement français prépare des arrêtés qui vont interdire les compétitions sportives … [+3515 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Emmanuel Magdelaine", "title": "VIDEO. \"Une belle bande d'amateurs\" : regardez le documentaire sur l'épopée de Calais en 2000 - France 3 Régions", "description": "La FFF a réalisé un documentaire d'1h30 sur l'épopée de Calais en 2000. \r\n<div id=\"gtx-trans\" style=\"position: absolute; left: -47px; top: 19px;\">\r\n<div class=\"gtx-trans-icon\"> </div>\r\n</div>", "url": "https://france3-regions.francetvinfo.fr/hauts-de-france/pas-calais/calais/video-belle-bande-amateurs-regardez-documentaire-epopee-calais-2000-1826154.html", "urlToImage": "https://france3-regions.francetvinfo.fr/hauts-de-france/sites/regions_france3/files/styles/top_big/public/assets/images/2020/05/07/sans-titre-6_1-4807020.jpg?itok=TCLWdWzD", "publishedAt": "2020-05-07T18:33:22Z", "content": "7 mai 2000 - 7 mai 2020. 20 ans après, l'exploit continue à retentir. Calais en finale de la Coupe de France. Un club amateur de 4ème division. Avec un parcours incroyable, fait de victoires face à Bordeaux, Lille, Strasbourg ou Cannes. La magie de la Coupe d… [+1343 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "Spectacles annulés : les organisateurs pourront proposer un avoir, ou bien rembourser, selon une ordonnance... - franceinfo", "description": "", "url": "https://www.francetvinfo.fr/culture/spectacles-annules-les-organisateurs-pourront-proposer-un-avoir-ou-bien-rembourser-selon-une-ordonnance-du-gouvernement_3953327.html", "urlToImage": "https://www.francetvinfo.fr/image/75rzgcb7d-439f/1500/843/21477215.jpg", "publishedAt": "2020-05-07T17:33:01Z", "content": "Ceux qui avaient acheté un billet pour une représentation artistique, annulée entre le 12 mars et le 15 septembre 2020, pourront se voir proposer un avoir. Ils pourront aussi se faire rembourser.Le gouvernement a pris jeudi 7 mai une ordonnance qui autorise l… [+1493 chars]"}, {"source": {"id": null, "name": "Sudouest.fr"}, "author": "Sud Ouest", "title": "Rugby : Bernard Laporte \"prend acte du choix des clubs\" - Sud Ouest", "description": "Au terme d'une réunion expéditive, le président de la Fédération a demandé à la Ligue de lui notifier son refus de faire passer la Pro D2 de 16 à 18 clubs.", "url": "https://www.sudouest.fr/2020/05/07/rugby-bernard-laporte-prend-acte-du-choix-des-clubs-7467236-773.php", "urlToImage": "https://images.sudouest.fr/2020/05/07/5eb4399e66a4bd8265411500/golden/bernard-laporte-lors.jpg", "publishedAt": "2020-05-07T16:48:44Z", "content": "Le clash n’a pas eu lieu. Bernard Laporte, le président de la fédération française de rugby, a pris acte ce mercredi du refus des clubs de Pro D2 et de Top 14, de passer de 30 à 32 clubs professionnels pour permettre l’accession en Pro D2 d’Albi et Massy, les… [+1357 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Une préparation de dix semaines au FC Lorient - Foot - L1 - Lorient - L'Équipe.fr", "description": "De retour dans l'élite du football français à la suite de l'interruption de la Ligue 2, Lorient doit reprendre l'entraînement à la mi-juin pour une préparation de dix semaines, afin de préparer la prochaine saison de Ligue 1.", "url": "https://www.lequipe.fr/Football/Actualites/Une-preparation-de-dix-semaines-au-fc-lorient/1132889", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/christophe-pelissier-a-concocte-une-tres-longue-preparation-pour-le-promu-lorientais-l-argueyroll/1500000001333950/0:0,1995:1330-640-427-75/6170e.jpg", "publishedAt": "2020-05-07T16:35:03Z", "content": "Alors que le FC Lorient a été sacré champion de Ligue 2 et promu dans l'élite, à l'issue de l'arrêt des compétitions après 28 journées, en raison de la pandémie du coronavirus, son entraîneur, Christophe Pelissier, a concocté une préparation inhabituelle pour… [+762 chars]"}, {"source": {"id": null, "name": "Observalgerie.com"}, "author": null, "title": "Exhibition sexuelle en France : L’Algérien Farid El Melali rompt le silence - Observ'Algérie - Algérie Actualité ", "description": "Coupable d’exhibition sexuelle en France, le jeune international algérien du d’Angers SCO, Farid El Melali, a décidé de sortir de son silence", "url": "https://www.observalgerie.com/exhibition-sexuelle-en-france-lalgerien-farid-el-melali-rompt-le-silence/2020/", "urlToImage": "https://i0.wp.com/www.observalgerie.com/wp-content/uploads/2020/05/Farid-El-Melali.jpg?fit=1920%2C1080&ssl=1", "publishedAt": "2020-05-07T16:10:21Z", "content": "Coupable dexhibition sexuelle en France, le jeune international algérien dAngers SCO, Farid El Melali, a décidé de sortir de son silence mercredi 6 mai. Le footballeur de 22 ans sest dit très affecté par cette affaire et tient à présenter ses excuses à tout l… [+1560 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Vendée. Les premiers masques lavables commandés par le Département arrivent - Ouest-France", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMihgFodHRwczovL3d3dy5vdWVzdC1mcmFuY2UuZnIvcGF5cy1kZS1sYS1sb2lyZS92ZW5kZWUvdmVuZGVlLWxlcy1wcmVtaWVycy1tYXNxdWVzLWxhdmFibGVzLWNvbW1hbmRlcy1wYXItbGUtZGVwYXJ0ZW1lbnQtYXJyaXZlbnQtNjgyODA1OdIBAA?oc=5", "urlToImage": null, "publishedAt": "2020-05-07T15:57:00Z", "content": null}, {"source": {"id": null, "name": "Footballclubdemarseille.fr"}, "author": "Articles FCM", "title": "Mercato OM: « Oui, je serais là » un olympien scelle son avenir ! - Football Club de Marseille", "description": "L'attaquant de l'Olympique de Marseille Valère Germain s'est exprimé concernant son avenir. Il a affirmé reste", "url": "https://www.footballclubdemarseille.fr/om-fil-info/mercato-om-oui-je-serais-la-un-olympien-scelle-son-avenir.html", "urlToImage": "https://www.footballclubdemarseille.fr/wp-content/uploads/2020/03/AMIENS-OM.jpg", "publishedAt": "2020-05-07T15:06:27Z", "content": "L’attaquant de l’Olympique de Marseille Valère Germain s’est exprimé concernant son avenir. Il a affirmé rester à Marseille la saison prochaine et se dit prêt à jouer la Ligue des Champions…\r\nValère Germain joue dans le club marseillais depuis 2017. Alors qu’… [+1003 chars]"}, {"source": {"id": null, "name": "Onzemondial.com"}, "author": "La rédaction", "title": "OL : Jean-Michel Aulas s’en remet à l’UEFA pour finir la saison ! - Onze Mondial", "description": "Jean-Michel Aulas a une nouvelle fois utilisé Twitter afin de montrer son mécontentement suite aux décisions de la LFP.", "url": "https://www.onzemondial.com/ligue-1/2019-2020/ol-jean-michel-aulas-s-en-remet-a-l-uefa-pour-finir-la-saison-217554", "urlToImage": "https://static.onzemondial.com/photo_article/217554/121934/1200-L-ligue-1.jpg", "publishedAt": "2020-05-07T14:24:40Z", "content": "Zapping Onze Mondial Onze Demande - Real Madrid : Zidane a sauvé sa tête grâce à la victoire dans le Clasico ?\r\nJean-Michel Aulas ne lâchera pas le morceau ! Alors que depuis jeudi dernier, la LFP a officiellement figer le championnat et proclamer la fin de l… [+1194 chars]"}, {"source": {"id": null, "name": "Autohebdo.fr"}, "author": "Rédaction AUTOhebdo", "title": "Porsche confirme son intérêt pour le LMDh - AUTOhebdo.fr", "description": "", "url": "https://www.autohebdo.fr/wec/actualites/porsche-confirme-son-interet-pour-le-lmdh-210552.html", "urlToImage": "https://www.autohebdo.fr/sites/default/files/actualites/wec-porsche-919-hybrid.jpg", "publishedAt": "2020-05-07T14:13:32Z", "content": "Quelques minutes après les précisions de lACO et lIMSA concernant le règlement technique du LMDh, Porsche Motorsport a confirmé son intérêt pour la future catégorie qui pourra se battre pour la victoire au classement général en WEC et dans le championnat amér… [+931 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/profile.php?id=100010643894333", "title": "Officiel – La Bundesliga va reprendre le 16 mai - Canal Supporters", "description": "La Bundesliga est le premier championnat qui va reprendre officiellement, le 16 mai. Le patron de la Bundesliga a officialisé les dates.", "url": "https://canal-supporters.com/2020/05/officiel-la-bundesliga-va-reprendre-le-16-mai/", "urlToImage": "https://canal-supporters.com/wp-content/uploads/2020/04/Bundesliga.jpg", "publishedAt": "2020-05-07T12:25:24Z", "content": "Championnat le plus proche d’un retour depuis plusieurs semaines, la Bundesliga va bien reprendre, dans des stades à huis clos évidemment. Le patron de la Ligue allemande – Christian Seifert – a dévoilé les dates de reprise de la 27e journée du championnat al… [+851 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Coronavirus : Roland-Garros va rembourser tous les billets vendus - Roland-Garros - L'Équipe.fr", "description": "Roland-Garros va annuler et donc rembourser les billets vendus pour son édition 2020, qui devait initialement avoir lieu du 24 mai au 7 juin.", "url": "https://www.lequipe.fr/Tennis/Actualites/Coronavirus-roland-garros-va-rembourser-tous-les-billets-vendus/1132794", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/roland-garros-a-ete-deplace-en-septembre-r-martin-l-equipe/1500000001333850/0:0,1995:1330-640-427-75/bfd47.jpg", "publishedAt": "2020-05-07T12:21:27Z", "content": "« La situation actuelle génère trop d'incertitudes pour tous les événements rassemblant du public partout dans le monde », a détaillé le Grand Chelem parisien sur les réseaux sociaux. En attendant de définir « les mesures adaptées qui garantiront la santé et … [+287 chars]"}, {"source": {"id": null, "name": "Foot-national.com"}, "author": "foot-national.com", "title": "Chambly : Bruno Luzi, finalement il reste (off) - Foot National", "description": "Nouveau revirement de situation sur le banc de Chambly. Après l'annonce surp", "url": "http://www.foot-national.com/foot-chambly-bruno-luzi-finalement-il-reste-off-133210.html", "urlToImage": "http://www.foot-national.com/content/photos/700/20190729Icon_DES_260719_08_37.jpg", "publishedAt": "2020-05-07T11:17:51Z", "content": "Foot-National a été crée en 2001. En Juin 2013, nous avons mis en place un nouveau servicede relation entre joueurs et clubs. Nous sommes tout simplement devenu la plateforme N°1dans le monde du football français, l\u0092outil que nous proposons estLa référence po… [+498 chars]"}, {"source": {"id": null, "name": "Paddock-gp.com"}, "author": null, "title": "MotoGP : deux Grands Prix à Jerez en juillet et du WSBK c'est presque fait - Media Service", "description": "C'est la bonne nouvelle du jour !", "url": "https://www.paddock-gp.com/motogp-deux-grands-prix-a-jerez-en-juillet-et-du-wsbk-cest-presque-fait/", "urlToImage": "https://www.paddock-gp.com/wp-content/uploads/2020/05/portada-jerez-1024x683-1.jpg", "publishedAt": "2020-05-07T11:00:55Z", "content": "Cette fois, on a du concret et cest une très bonne nouvelle. On espère que laccord entre les autorités régionales, communales et Dorna seront validés par le gouvernement espagnol. Car dans ce cas, la saison MotoGP sera lancée le 19 juillet à Jerez, site qui r… [+1502 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Top 14 : 2020 sera une saison sans champion de France - Le Figaro", "description": "Les présidents des clubs ont décidé mercredi que le titre ne sera pas attribué, ni en Top 14, ni en Pro D2. Une décision acceptée par l’UBB, largement en tête avant l’arrêt du championnat, mais avec un gros pincement au cœur.", "url": "https://sport24.lefigaro.fr/rugby/top-14/actualites/top-14-2020-sera-une-saison-sans-champion-de-france-1001262", "urlToImage": "http://sport24.lefigaro.fr/var/plain_site/storage/images/rugby/top-14/actualites/top-14-2020-sera-une-saison-sans-champion-de-france-1001262/27095592-1-fre-FR/Top-14-2020-sera-une-saison-sans-champion-de-France.jpg", "publishedAt": "2020-05-07T10:59:00Z", "content": "Les présidents des clubs ont décidé mercredi que le titre ne sera pas attribué, ni en Top 14, ni en Pro D2. Une décision acceptée par lUBB, largement en tête avant larrêt du championnat, mais avec un gros pincement au cur.Il ny aura donc pas de nom déquipe gr… [+6503 chars]"}, {"source": {"id": null, "name": "Mmadeferlante.com"}, "author": null, "title": "Khabib anticipe un retour dès juillet pour \"fracasser tout le monde\" - MMA DEFERLANTE", "description": "Khabib Nurmagomedov annonce qu'il serait prêt pour un retour dans l'octogone plus tôt que prévu, dès le mois de juillet.", "url": "https://www.mmadeferlante.com/55033/khabib-anticipe-un-retour-des-juillet-pour-fracasser-tout-le-monde/", "urlToImage": "https://www.mmadeferlante.com/wp-content/uploads/2019/10/khabib-nurmagomedov-belt-2.jpg", "publishedAt": "2020-05-07T10:13:35Z", "content": "Au moins, il commence à mieux gérer sa communication face aux medias, et ne laisse plus Ali Abdelaziz Tweeter à sa place (en tous cas, ça a lair).\r\nQuant aux simples desprit qui disent quil a « peur »Mais peur de quoi en fait ? Son coach a dit quil avait pas … [+1560 chars]"}, {"source": {"id": null, "name": "Lerugbynistere.fr"}, "author": "Boukercha Oussama", "title": "Sonny Bill Williams va-t-il se frotter à la légende de la boxe Mike Tyson ? - Le Rugbynistère", "description": "L'ancien all black Sonny Bill Williams pourrait se retrouver sur un ring avec Mike Tyson, 53 ans, et légende de la boxe.", "url": "https://www.lerugbynistere.fr/videos/sonny-bill-williams-va-t-il-se-frotter-a-la-legende-de-la-boxe-mike-tyson-0705201102.php", "urlToImage": "https://www.lerugbynistere.fr/photos/620_px/sonny-bill-williams-va-t-il-se-frotter-a-la-legende-de-la-boxe-mike-tyson-07-05-20-7610.jpg", "publishedAt": "2020-05-07T09:15:00Z", "content": "L'ancien all black Sonny Bill Williams pourrait se retrouver sur un ring avec Mike Tyson, 53 ans, et légende de la boxe.Mike Tyson at 53 years old is still scary \r\n(via @miketyson, h/t @ESPNRingside) pic.twitter.com/XlfHvCRU4N\r\nSportsCenter (@SportsCenter) Ma… [+1499 chars]"}]}