{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Eurosport.fr"}, "author": "Cyril Morin", "title": "Officiel : Carlos Sainz remplacera Sebastian Vettel chez Ferrari - Eurosport - FRANCE (FR)", "description": "Le suspense était limité, il est désormais terminé. Ce jeudi, la Formule 1 a officialisé l'arrivée de Carlos Sainz chez Ferrari à partir de 2021.", "url": "https://www.eurosport.fr/formule-1/saison-2021/2021/officiel-carlos-sainz-remplacera-sebastian-vettel-chez-ferrari_sto7748726/story.shtml", "urlToImage": "https://i.eurosport.com/2020/02/13/2774386-57309730-2560-1440.jpg", "publishedAt": "2020-05-14T10:10:25Z", "content": "Il était le favori logique. Il est bien lélu final. Dans sa quête de coéquipier pour épauler Charles Leclerc à partir de 2021, Ferrari a choisi Carlos Sainz. LEspagnol de 25 ans, qui en aura 26 lorsquil débarquera chez la Scuderia, s'installera dans le baquet… [+1537 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Aurélien Léger-Moëc", "title": "Mercato : la Juventus chamboule déjà ses plans pour Adrien Rabiot ! - Foot Mercato", "description": "La polémique sur son retour tardif en Italie continue d'être alimentée. Et pourrait bien avoir des conséquences sur l'avenir d'Adrien Rabiot, que la Juventus ne retiendrait déjà plus.", "url": "https://www.footmercato.net/a8073614364940779164-mercato-la-juventus-chamboule-deja-ses-plans-pour-adrien-rabiot", "urlToImage": "https://assets-fr.imgfoot.com/media/cache/1200x675/rabiot.jpg", "publishedAt": "2020-05-14T10:05:47Z", "content": "Adrien Rabiot a fait preuve d'humour en répondant à la polémique lancée par le quotidien italien La Stampa via un message sur Instagram. Mais le milieu français aurait peut-être dû commencer par écouter les recommandations de son club, la Juventus Turin, pour… [+2156 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Guillaume Issner", "title": "Bordeaux : Christophe Dugarry exaspéré par les pratiques controversées du club - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a4065321562795995305-bordeaux-christophe-dugarry-exaspere-par-les-pratiques-controversees-du-club", "urlToImage": "https://assets-fr.imgfoot.com/media/cache/1200x675/christophe-dugarry1.jpg", "publishedAt": "2020-05-14T10:05:44Z", "content": "Une information dévoilée par RMC Sport à propos des pratiques controversées des Girondins de Bordeaux en interne a secoué Christophe Dugarry. Le consultant, qui a porté le maillot du club entre 2000 et 2003, a exprimé sa stupéfaction à ce sujet sur les ondes … [+1117 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "PSG : Paris c'est nul, le Barça l'a mauvaise avec Neymar - Foot01.com", "description": "Au top de sa forme avant l’interruption des compétitions, Neymar n’est pas certain de poursuivre sa carrière au PSG la saison prochaine.\r\nEt pour cause, Barcelone est toujours très intéressé par un come-back de l’international brésilien. Mais en raison…", "url": "https://www.foot01.com/equipe/paris/psg-paris-c-est-nul-le-barca-l-a-mauvaise-avec-neymar,349149", "urlToImage": "https://www.foot01.com/img/images/1920x1080/2020/May/14/psg-neymar-de-retour-barcelone-brise-la-glace-icon_win_080917_01_17321,284755.jpg", "publishedAt": "2020-05-14T09:43:22Z", "content": "Au top de sa forme avant linterruption des compétitions, Neymar nest pas certain de poursuivre sa carrière au PSG la saison prochaine.\r\nEt pour cause, Barcelone est toujours très intéressé par un come-back de linternational brésilien. Mais en raison de limpac… [+1539 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "Le Barça déçu par l'attitude d'Umtiti et Dembélé à la reprise de l'entraînement? - RMC Sport", "description": "Selon ESPN Argentina, Samuel Umtiti et Ousmane Dembélé se seraient fait remarquer par leur indiscipline depuis la reprise de l’entraînement avec le FC Barcelone. Une attitude qui aurait déplu à la direction du Barça.", "url": "https://rmcsport.bfmtv.com/football/le-barca-decu-par-l-attitude-d-umtiti-et-dembele-a-la-reprise-de-l-entrainement-1913644.html", "urlToImage": "https://www.bfmtv.com/i/0/0/83f/1d2fdc49cdd1c963462fbfc329fe5.jpeg", "publishedAt": "2020-05-14T09:23:01Z", "content": null}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "T.M.", "title": "Mercato - PSG : Al-Khelaïfi pourrait donner un gros coup de main à l'OM ! - Le 10 Sport", "description": "Alors que le PSG serait sur les traces de Boubacar Kamara, cet intérêt pour le joueur de l’OM n’aurait pas seulement des fins sportives.", "url": "https://le10sport.com/football/mercato/mercato-psg-al-khelaifi-aurait-une-idee-derriere-la-tete-avec-boubacar-kamara-503395", "urlToImage": "https://le10static.com/img/master/0000/0016/169202.jpeg", "publishedAt": "2020-05-14T09:15:00Z", "content": "Publié le 14 mai 2020 à 11h15 par T.M. Alors que le PSG serait sur les traces de Boubacar Kamara, cet intérêt pour le joueur de lOM naurait pas seulement des fins sportives.\r\nPour la saison prochaine, le PSG et Leonardo semblent vouloir se renforcer défensive… [+1063 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Matthieu Margueritte", "title": "Lourde amende en vue pour Zlatan Ibrahimovic - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a1124705989213285755-lourde-amende-en-vue-pour-zlatan-ibrahimovic", "urlToImage": "https://assets-fr.imgfoot.com/media/cache/1200x675/zlatan-ibrahimovic-5eaedaac2db39.jpg", "publishedAt": "2020-05-14T09:12:10Z", "content": "Ces derniers temps, Zlatan Ibrahimovic (38 ans) faisait parler de lui par rapport à son avenir. Parti en Suède s'entraîner avec la formation d'Hammarby durant la période de confinement, le géant scandinave maintient toujours le suspens quant à la suite à donn… [+631 chars]"}, {"source": {"id": null, "name": "Maxifoot.fr"}, "author": null, "title": "Montpellier : les trois dossiers chauds du mercato - Maxifoot", "description": "Montpellier prépare son mercato estival et s'est fixé trois priorités : un gardien en cas de départ de Geronimo Rulli, un d&eacu ...", "url": "http://www.maxifoot.fr/football/article-43693.htm", "urlToImage": "http://images3.maxifoot.fr/michel-der-zakarian-3.jpg", "publishedAt": "2020-05-14T09:12:00Z", "content": "Montpellier prépare son mercato estival et s'est fixé trois priorités : un gardien en cas de départ de Geronimo Rulli, un défenseur central et un attaquant. Le MHSC a déjà plusieurs pistes.\r\nHuitième de Ligue 1 après l'arrêt définitif de la saison à la 28e jo… [+3281 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Ricciardo quittera Renault pour McLaren en 2021 (officiel) - Fil Info - Formule 1 - Auto/Moto - Le Figaro", "description": "McLaren a annoncé ce jeudi matin le recrutement de Daniel Ricciardo pour la saison 2021. L’Australien fera équipe avec Lando Norris et succédera à Carlos Sainz Jr, en partance pour Ferrari. Ricciardo, 30 ans, avait quitté Red Bull fin 2018 pour tenter l’avent…", "url": "https://sport24.lefigaro.fr/auto-moto/formule-1/fil-info/ricciardo-quitte-renault-pour-mclaren-officiel-1001835", "urlToImage": null, "publishedAt": "2020-05-14T09:05:00Z", "content": "McLaren a annoncé ce jeudi matin le recrutement de Daniel Ricciardo pour la saison 2021. LAustralien fera équipe avec Lando Norris et succédera à Carlos Sainz Jr, en partance pour Ferrari. Ricciardo, 30 ans, avait quitté Red Bull fin 2018 pour tenter laventur… [+315 chars]"}, {"source": {"id": null, "name": "Trashtalk.co"}, "author": "Clément Labonne", "title": "La NBA jouera avec des ballons Wilson à partir de 2021 : Tom Hanks a accepté de partager son ami - TrashTalk", "description": "Voici notre nouveau meilleur ami.", "url": "https://trashtalk.co/2020/05/14/la-nba-jouera-avec-des-ballons-wilson-a-partir-de-2021-tom-hanks-a-accepte-de-partager-son-ami/", "urlToImage": "https://trashtalk.co/wp-content/uploads/2020/05/Ballon-Wilson-1000x600.png", "publishedAt": "2020-05-14T08:57:37Z", "content": "Oh non pas ça, pas aujourdhui pas maintenant pas après tout ce que tu as fait… Depuis lannonce du changement de marque des ballons officiels de la NBA, les aficionados de la balle orange pleurent déjà un petit ange parti trop tôt. La saison 2021-22 commencera… [+3247 chars]"}, {"source": {"id": null, "name": "Lephoceen.fr"}, "author": "Le Phocéen", "title": "Vente OM : McCourt aurait décliné l'offre saoudienne - Le Phoceen", "description": "Selon Challenges, l'intérêt saoudien se serait heurté au refus de Franck McCourt.", "url": "https://www.lephoceen.fr/infos-om/autour-de-l-om/vente-om-mccourt-aurait-decline-l-offre-saoudienne-178672", "urlToImage": "https://static.lephoceen.net/images/une/160909_mccourt.jpg", "publishedAt": "2020-05-14T08:49:03Z", "content": "La rumeur saoudienne concernant la rachat de l'OM continue de faire couler de l'encre. Ce jeudi, c'est au tour du magazine économique Challenges d'apporter sa pierre à l'édifice en révélant que c'est lhomme daffaires français Kacy Grine qui a suggéré au milli… [+1981 chars]"}, {"source": {"id": null, "name": "Nextgen-auto.com"}, "author": "Olivier Ferret", "title": "Contactée par Vettel, Red Bull Racing confirme lui avoir dit 'non' - Nextgen-Auto.com", "description": "Formule 1 | Le Dr Helmut Marko a confirmé que Sebastian Vettel a bien pris contact avec Red Bull ces derniers jours pour une place en 2021. L'Autrichien (...)", "url": "https://motorsport.nextgen-auto.com/fr/formule-1/contactee-par-vettel-red-bull-racing-confirme-lui-avoir-dit-non,148414.html", "urlToImage": "https://motorsport.nextgen-auto.com/IMG/arton148414.jpg", "publishedAt": "2020-05-14T08:42:00Z", "content": "Le Dr Helmut Marko a confirmé que Sebastian Vettel a bien pris contact avec Red Bull ces derniers jours pour une place en 2021.\r\nL’Autrichien s’exprime après la confirmation par Ferrari et Vettel que leur aventure commune ne se prolongera pas l’année prochain… [+572 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/marc.alvarez1", "title": "Roustan : “On est arrivé au bout du bout avec Thiago Silva” - Canal Supporters", "description": "En fin de contrat au PSG, Thiago Silva (35 ans) ne sait toujours pas s'il finira par pouvoir prolonger son contrat. La situation reste floue,", "url": "https://canal-supporters.com/2020/05/roustan-on-est-arrive-au-bout-du-bout-avec-thiago-silva/", "urlToImage": "https://canal-supporters.com/wp-content/uploads/2020/05/roustan.png", "publishedAt": "2020-05-14T08:40:21Z", "content": "En fin de contrat au PSG, Thiago Silva (35 ans) ne sait toujours pas s’il finira par pouvoir prolonger son contrat. La situation reste floue, encore plus dans un contexte de crise économique qui ne permettra pas de folies sur le marché. Quoi qu’il en soit, po… [+904 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Le sort de Tuchel est scellé - Sports.fr", "description": "Un temps menacé cette saison, Thomas Tuchel sera bien l’entraîneur du PSG la saison prochaine. Les conséquences de la crise engendrée par la pandémie de coronavirus n’ont pas fini de se faire sentir. C’est tout particulièrement le cas au PSG, où le manque à g…", "url": "https://www.sports.fr/football/sort-de-tuchel-scelle-353091.html", "urlToImage": "https://sf.sports.fr/wp-content/uploads/2020/02/tuchel.jpg", "publishedAt": "2020-05-14T08:37:04Z", "content": "Un temps menacé cette saison, Thomas Tuchel sera bien lentraîneur du PSG la saison prochaine.\r\nLes conséquences de la crise engendrée par la pandémie de coronavirus nont pas fini de se faire sentir. Cest tout particulièrement le cas au PSG, où le manque à gag… [+1483 chars]"}, {"source": {"id": null, "name": "Webgirondins.com"}, "author": "WebGirondins", "title": "Bruno Fievet répond à Antony Thiodet - Girondins - WebGirondins", "description": "L'homme d'affaires qui souhaite racheter les Girondins de Bordeaux, Bruno Fievet, a répondu aux paroles d'Antony Thiodet qui ont été dévoilées par les Ultramarines.", "url": "https://www.webgirondins.com/actualite-girondins-bruno-fievet-repond-a-antony-thiodet-104131", "urlToImage": "https://www.webgirondins.com/cache/images/_54767bf084d948f298de6b8523645270.png", "publishedAt": "2020-05-14T08:30:00Z", "content": "L'homme d'affaires qui souhaite racheter les Girondins de Bordeaux, Bruno Fievet, a répondu aux paroles d'Antony Thiodet qui ont été dévoilées par les Ultramarines. Le directeur stade et réseau des Girondins a dévalorisé l'entreprise de Bruno Fievet, tout en … [+660 chars]"}, {"source": {"id": null, "name": "Laprovence.com"}, "author": "La Provence", "title": "OM : Paris Turf, le groupe de presse détenu par Eyraud, est en dépôt de bilan - La Provence", "description": "Paris Turf, leader français de l'information hippique dont Jacques-Henri Eyraud (par ailleurs président de l'OM) est actionnaire majoritaire, est en cessation de paiement, selon La Lettre A. \"JHE\" pourrait céder le groupe d'ici fin juin via un \"prépack cessio…", "url": "https://www.laprovence.com/actu/en-direct/5988449/om-paris-turf-le-groupe-de-presse-detenu-par-eyraud-est-en-depot-de-bilan.html", "urlToImage": "https://images.laprovence.com/v1/focus=765.5x481/cover=993x520/image:media/2020/01/21/1579625801_850_1209.jpg", "publishedAt": "2020-05-14T08:26:08Z", "content": "Vous avez trouvé sur notre site internet un contenu ou un message manifestement illicite et/ou portant atteinte à la dignité humaine ?"}, {"source": {"id": null, "name": "Paris-normandie.fr"}, "author": null, "title": "Football - N2 : Fred Dembi veut quitter le FC Rouen - Paris-Normandie", "description": "Après deux saisons pleines sous le maillot rouge et blanc, Fred Dembi a envie de goûter à autre chose. Bien que lié contractuellement au FC Rouen, le milieu de terrain veut rejoindre un club plus huppé. La sortie du confinement étant désormais effective, alle…", "url": "https://www.paris-normandie.fr/sport/football-n2-fred-dembi-veut-quitter-le-fc-rouen-HH16775705", "urlToImage": "https://www.paris-normandie.fr/binrepository/600x430/0c0/600d338/none/10904/WMAL/a20200107t070054-m-10-65-52-136-kh-1943-2234-25-f_26868956_20200513152016.jpg", "publishedAt": "2020-05-14T08:18:16Z", "content": "Après deux saisons pleines sous le maillot rouge et blanc, Fred Dembi a envie de goûter à autre chose. Bien que lié contractuellement au FC Rouen, le milieu de terrain veut rejoindre un club plus huppé.\r\nLa sortie du confinement étant désormais effective, all… [+3255 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Lewis Hamilton est le sportif britannique le plus riche de l'histoire - F1 - L'Équipe.fr", "description": "Selon la <i>Rich List</i> du <i>Sunday Times</i>, Lewis Hamilton est devenu le sportif britannique le plus riche de l'histoire, à la place de David Beckham.", "url": "https://www.lequipe.fr/Formule-1/Actualites/Lewis-hamilton-est-le-sportif-britannique-le-plus-riche-de-l-histoire/1134492", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/le-sunday-times-estime-la-fortune-personnelle-de-lewis-hamilton-a-224-millions-de-livres-s-boue-l/1500000001335901/0:0,1998:1332-640-427-75/dd5ce.jpg", "publishedAt": "2020-05-14T08:14:43Z", "content": "Grâce à son dernier contrat, signé en 2018, il a gagné 37 millions de livres supplémentaires, ce qui lui a permis de dépasser David Beckham, l'ancien joueur de foot de Manchester United et du Real Madrid. En 2013, au moment de sa retraite, ce dernier valait 2… [+123 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "N.C. avec AFP", "title": "Didier Gailhaguet refuse de quitter le CNOSF et « réclame un peu de décence » - 20 Minutes", "description": "« Bien amicalement à vous et à demain »", "url": "https://www.20minutes.fr/sport/2778787-20200514-didier-gailhaguet-refuse-quitter-cnosf-reclame-peu-decence", "urlToImage": "https://img.20mn.fr/XRL2FKM4TS63b8qaDFHbmw/648x360_didier-gailhaguet-ancien-president-federation-francaise-sports-glace-5-fevrier-2020.jpg", "publishedAt": "2020-05-14T08:06:43Z", "content": "Didier Gailhaguet, l'ancien président de la fédération française des sports de glace, le 5 février 2020. Francois Mori/AP/SIPA\r\nLancien patron du patinage français, Didier Gailhaguet, contraint à la démission de la Fédération française des sports de glace (FF… [+3105 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "W.P, avec AFP", "title": "Tottenham : Grosse frayeur pour Dele Alli, cambriolé par deux hommes armés de couteaux - 20 Minutes", "description": "Le joueur des Spurs a été agressé dans la nuit de mardi à mercredi", "url": "https://www.20minutes.fr/sport/2778775-20200514-tottenham-grosse-frayeur-dele-alli-cambriole-deux-hommes-armes-couteaux", "urlToImage": "https://img.20mn.fr/Gbj0EWKDR1SKQYwaGy06Pg/648x360_dele-alli.jpg", "publishedAt": "2020-05-14T07:58:35Z", "content": "Dele Alli Ian Tuttle/BPI/REX/SIPA\r\nCommençons par lessentiel. Le milieu de Tottenham, Dele Alli, ne souffre daucune blessure sérieuse. Mais il a eu peur, très peur. \r\nL'international anglais a été victime dune agression lors du cambriolage de son domicile dan… [+960 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Giroud voit les choses en très grand - Sports.fr", "description": "Malgré ses difficultés à Chelsea, Olivier Giroud entend un peu plus marquer l’histoire de l’équipe de France. La saison est décidément particulièrement compliquée pour Olivier Giroud. Longtemps réduit à la portion congrue par Frank Lampard, qui lui préférait …", "url": "https://www.sports.fr/football/giroud-voit-choses-tres-grand-353082.html", "urlToImage": "https://sf.sports.fr/wp-content/uploads/2020/01/giroud_panoramic-2.jpg", "publishedAt": "2020-05-14T07:46:38Z", "content": "Malgré ses difficultés à Chelsea, Olivier Giroud entend un peu plus marquer lhistoire de léquipe de France.\r\nLa saison est décidément particulièrement compliquée pour Olivier Giroud. Longtemps réduit à la portion congrue par Frank Lampard, qui lui préférait T… [+1542 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Saint-Étienne : le coup de fil de Claude Puel à Stéphane Ruffier - Foot - L1 - ASSE - L'Équipe.fr", "description": "Claude Puel, l'entraîneur de l'ASSE, a appelé Stéphane Ruffier pour lui signifier que Jessy Moulin serait le gardien numéro 1 des Verts la saison prochaine.", "url": "https://www.lequipe.fr/Football/Actualites/Saint-etienne-le-coup-de-fil-de-claude-puel-a-stephane-ruffier/1134482", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/l-avenir-de-stephane-ruffier-est-plus-que-jamais-incertain-a-mounic-l-equipe/1500000001335873/424:329,1667:1158-640-427-75/c0790.jpg", "publishedAt": "2020-05-14T07:27:33Z", "content": "Capitaine un temps la saison dernière, en l'absence de Loïc Perrin, avant d'être relégué derrière Jessy Moulin au poste de gardien, Stéphane Ruffier s'est vu confirmer sa rétrogradation par Claude Puel. L'entraîneur stéphanois a appelé Ruffier (33 ans), mercr… [+130 chars]"}, {"source": {"id": null, "name": "Maligue2.fr"}, "author": "https://www.facebook.com/Laurent-Mazure-pro-1015203075191053/", "title": "Jonathan Martins-Pereira met un terme à sa carrière et rentre à Guingamp - MaLigue2", "description": "Fin de carrière pour Jonathan Martins-Pereira. Le joueur, déclaré inapte au sport de haut niveau, va devenir éducateur à Guingamp.", "url": "https://maligue2.fr/2020/05/14/jonathan-martins-pereira-met-un-terme-a-sa-carriere-et-rentre-a-guingamp/", "urlToImage": "https://maligue2.fr/wp-content/uploads/2018/07/Ligue-2-entraînement-chaussure.jpg", "publishedAt": "2020-05-14T07:23:00Z", "content": null}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "OL: Juninho, une intégration compliquée - RMC Sport", "description": "Invité de Team Duga mercredi soir, Grégory Coupet est revenu sur les premiers pas compliqués de Juninho au sein de l'Olympique Lyonnais.", "url": "https://rmcsport.bfmtv.com/football/ol-juninho-une-integration-compliquee-1913581.html", "urlToImage": "https://www.bfmtv.com/i/0/0/73a/ca3f418c9d01ea1faa25e3dcfbe2b.jpeg", "publishedAt": "2020-05-14T07:22:37Z", "content": null}, {"source": {"id": null, "name": "Maxifoot.fr"}, "author": null, "title": "Ligue 1 : une fronde anti-Aulas a-t-elle privé Lyon de Coupe d'Europe ? - Maxifoot", "description": "Selon le quotidien Le Parisien, la décision d'arrêter la saison de Ligue 1 après la 28e journée, qui prive Lyon de Coupe d'Eu ...", "url": "http://www.maxifoot.fr/football/article-43692.htm", "urlToImage": "http://images3.maxifoot.fr/aulas-803.jpg", "publishedAt": "2020-05-14T07:13:00Z", "content": "Selon le quotidien Le Parisien, la décision d'arrêter la saison de Ligue 1 après la 28e journée, qui prive Lyon de Coupe d'Europe, serait liée à une fronde des présidents de clubs contre Jean-Michel Aulas.\r\nLa décision du conseil d'administration de la LFP d'… [+2163 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/marc.alvarez1", "title": "Selon Di Marzio, le PSG est vraiment tenté par Pjanic - Canal Supporters", "description": "Après la très grande liste de pistes pour le PSG proposée par L'Equipe, un nom supplémentaire s'ajoute, celui de Miralem Pjanic (30 ans).", "url": "https://canal-supporters.com/2020/05/selon-di-marzio-le-psg-est-vraiment-tente-par-pjanic/", "urlToImage": "https://canal-supporters.com/wp-content/uploads/2020/03/pjanic.png", "publishedAt": "2020-05-14T07:02:39Z", "content": "Auteur : Marc Alvarez 14 mai 2020\r\nAprès la très grande liste de pistes pour le PSG proposée par L’Equipe ce jeudi, un nom supplémentaire s’ajoute, celui de Miralem Pjanic (30 ans). Gianluca Di Marzio, journaliste italien spécialiste de mercato pour Sky, affi… [+632 chars]"}, {"source": {"id": null, "name": "Madeinlens.com"}, "author": "J.H.", "title": "Cyrille Bayala vers un transfert définitif à Ajaccio? - MadeInLens.com", "description": "Demandeur de temps de jeu en début de saison, Cyrille Bayala a été prêté à l'AC Ajaccio avec une belle réussite à la clef. Et selon MaLigue2, le club corse souhaiterait logiquement conserver l'ailier...", "url": "https://www.madeinlens.com/actualite-rclens/saison-2019-2020/transferts/51211-cyrille-bayala-vers-un-transfert-definitif-a-ajaccio.html", "urlToImage": "https://www.madeinlens.com/images/MadeInLens-2019-2020/Joueurs/Cyrille-Bayala-RC-Lens-01.jpg", "publishedAt": "2020-05-14T06:48:43Z", "content": "Demandeur de temps de jeu en début de saison, Cyrille Bayala a été prêté à l'AC Ajaccio avec une belle réussite à la clef. Et selon MaLigue2, le club corse souhaiterait logiquement conserver l'ailier droit burkinabé lors du mercato estival.\r\nActeur d'une sais… [+471 chars]"}, {"source": {"id": null, "name": "Onzemondial.com"}, "author": "La rédaction", "title": "Barça : « J’étais bien meilleur que Messi et Ronaldo » - Onze Mondial", "description": "Edilson, champion du monde 2002 avec le Brésil, s’estimait « bien meilleur » que Lionel Messi et Cristiano Ronaldo.", "url": "https://www.onzemondial.com/barca-j-etais-bien-meilleur-que-messi-et-ronaldo-218162", "urlToImage": "https://static.onzemondial.com/photo_article/218162/123143/1200-L-autres-championnats.jpg", "publishedAt": "2020-05-14T06:42:26Z", "content": "Zapping Onze Mondial Onze Demande - PSG : Cavani doit-il être titulaire ?\r\nChampion du monde 2002 avec le Brésil, Edilson s’est confié en toute sérénité au média Infobae. Invoquant son titre de champion du monde, le Brésilien assure être au-dessus de Lionel M… [+835 chars]"}, {"source": {"id": null, "name": "Rugbyrama.fr"}, "author": "Rugbyrama", "title": "World Rugby supprime une règle, ça bouge au niveau du mercato... Les 5 infos de ce mercredi - Rugbyrama.fr", "description": "C'est terminé pour les essais marqués à la base des poteaux, une nouvelle équipe pour Gio Aplon, les joueurs toulonnais baissent à leur tour leurs salaires.", "url": "https://www.rugbyrama.fr/rugby/world-rugby-supprime-une-regle-ca-bouge-au-niveau-du-mercato.-les-5-infos-de-ce-mercredi_sto7748210/story.shtml", "urlToImage": "https://i.rugbyrama.fr/2016/11/13/1968793-41371354-1600-900.jpg", "publishedAt": "2020-05-14T06:39:39Z", "content": "La règle de l'essai à la base du poteau abolie\r\nComptant parmi les bizarreries des règles du rugby, celle permettant à une équipe attaquante d'aplatir un essai à la base du poteau, sans avoir à franchir la ligne d'en-but, n'est plus. Elle a été officiellement… [+2468 chars]"}, {"source": {"id": null, "name": "Lephoceen.fr"}, "author": "Le Phocéen", "title": "Mercato OM : Thomasson proposé à un club de L1 - Le Phoceen", "description": "L'OM n'est pas seul sur la piste du milieu offensif de Strasbourg.", "url": "https://www.lephoceen.fr/infos-om/mercato/mercato-om-thomasson-propose-a-un-club-de-l1-178669", "urlToImage": "https://static.lephoceen.net/images/une/200417_thomasson.jpg", "publishedAt": "2020-05-14T06:17:19Z", "content": "Forcé à chercher des pistes à moindre coût cet été, l'OM se penche sur le dossier Adrien Thomasson depuis plusieurs semaines. En effet, le milieu offensif du RC Strasbourg plait à André Villas-Boas, comme il l'avait affirmé en conférence de presse en janvier … [+960 chars]"}, {"source": {"id": null, "name": "Buzzsport.fr"}, "author": "Stéphane Laurent", "title": "Mercato - OM : Le projet McCourt bientôt anéanti ? - buzzsport.fr", "description": "Les informations se multiplient autour d’un avenir sombre pour l’OM. L’UEFA doit trancher dans un mois et le risque est grand pour", "url": "https://www.buzzsport.fr/buzz/foot/mercato-om-le-projet-mccourt-bientot-aneanti-106120", "urlToImage": "https://www.buzzsport.fr/wp-content/uploads/2019/10/1200-iconsport_noe_180212_30_40.jpg", "publishedAt": "2020-05-14T06:01:00Z", "content": "Et si lOM ne voyait finalement pas la Ligue des Champions la saison prochaine ? Qualifiée après une belle deuxième place en ligue 1, la bande à Dimitri Payet pourrait voir son rêve se briser dici un mois. LUEFA doit en effet trancher sur les sanctions liées a… [+419 chars]"}, {"source": {"id": null, "name": "Dailymercato.com"}, "author": "", "title": "Mercato OL : Samuel Gigot dans le viseur - Daily Mercato", "description": "En qu&ecirc;te d'un d&eacute;fenseur central cet &eacute;t&eacute;, l'Olympique Lyonnais multiplie les pistes. Derni&egrave;re en date, celle menant a...", "url": "https://www.dailymercato.com/news/mercato-ol-samuel-gigot-dans-le-viseur", "urlToImage": "https://www.dailymercato.com/storage/icon-sport/samuel-gigot.jpeg", "publishedAt": "2020-05-14T06:00:09Z", "content": "En quête d'un défenseur central cet été, l'Olympique Lyonnais multiplie les pistes. Dernière en date, celle menant au Français Samuel Gigot (26 ans), du Spartak Moscou.Ce n'est pas le Français évoluant à l'étranger le plus connu. À 26 ans, Samuel Gigot réalis… [+1593 chars]"}, {"source": {"id": null, "name": "Lensois.com"}, "author": null, "title": "Comme Gillet et Costa, Madri ne restera pas non plus au RC Lens - Lensois.com", "description": "Le mercato du RC Lens, ce sera des arrivées, mais aussi des départs. Notamment pour des joueurs en fin de contrat. Le milieu Guillaume Gillet a déjà annoncé lui-même que le club ne le prolongera pas. Comme nous l’évoquions, l’arrière gauche prêté par l’Intern…", "url": "https://www.lensois.com/comme-gillet-et-costa-madri-ne-restera-pas-non-plus-au-rc-lens/", "urlToImage": "https://www.lensois.com/wp-content/uploads/2019/07/Mouaad_Madri_Lens_02062019.jpg", "publishedAt": "2020-05-14T05:34:28Z", "content": "Le mercato du RC Lens, ce sera des arrivées, mais aussi des départs. Notamment pour des joueurs en fin de contrat.\r\nLe milieu Guillaume Gillet a déjà annoncé lui-même que le club ne le prolongera pas. Comme nous lévoquions, larrière gauche prêté par lInternat… [+965 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Les records de transfert club par club - Sports.fr", "description": "Certains clubs ont bien plus l’habitude de dépenser que d’autres… Demi-finaliste de la Ligue des champions la saison dernière, l’Ajax Amsterdam a réalisé une vraie prouesse. Aucun joueur de l’effectif des Lanciers n’avait en effet coûté plus de 16 millions d’…", "url": "https://www.sports.fr/football/records-de-transfert-club-club-352968.html", "urlToImage": "https://sf.sports.fr/wp-content/uploads/2020/05/iPiccy-collage-10.jpg", "publishedAt": "2020-05-14T04:35:37Z", "content": "Certains clubs ont bien plus l’habitude de dépenser que d’autres…\r\nDemi-finaliste de la Ligue des champions la saison dernière, l’Ajax Amsterdam a réalisé une vraie prouesse. Aucun joueur de l’effectif des Lanciers n’avait en effet coûté plus de 16 millions d… [+718 chars]"}, {"source": {"id": null, "name": "Ledauphine.com"}, "author": "AFP", "title": "Sport | Ligue 2 : passé par Saint-Etienne, Paul-Goerges Ntep se relance à Guingamp - Le Dauphiné Libéré", "description": "", "url": "https://www.ledauphine.com/sport/2020/05/14/ligue-2-passe-par-saint-etienne-paul-goerges-ntep-se-relance-a-guingamp", "urlToImage": "https://cdn-s-www.ledauphine.com/images/063BB32E-E594-4B2E-98FA-94D0FC266C85/FB1200/photo-1535470761.jpg", "publishedAt": "2020-05-14T04:06:02Z", "content": "L’international franco-camerounais Paul-Georges Ntep, sans club depuis la résiliation de son contrat avec Wolsfburg en février, s’est engagé mercredi pour une saison à Guingamp afin de se relancer en Ligue 2 après l’échec de son passage en Allemagne. « \"Tu sa… [+1378 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "La Dépêche du midi", "title": "Castres. CO : Moreaux licencié - LaDepeche.fr", "description": "", "url": "https://www.ladepeche.fr/2020/05/14/co-moreaux-licencie,8886939.php", "urlToImage": "https://images.ladepeche.fr/api/v1/images/view/5ebcb7bb8fe56f46425d27e8/large/image.jpg?v=1", "publishedAt": "2020-05-14T03:19:05Z", "content": "Le 2e ligne du Castres Olympique Victor Moreaux ne ferait plus partie de leffectif castrais alors quil lui restait un an de contrat. Le club lui reprocherait en effet son comportement extra-sportif.\r\nLe joueur de 26 ans avait été placé mi-mars en garde à vue … [+834 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "François Verdenet", "title": "Le PSG pense à Pepe Reina comme gardien numéro 2 - Foot - Transferts - PSG - L'Équipe.fr", "description": "Le PSG ne gardera pas Sergio Rico et cherche une nouvelle doublure à Keylor Navas. Pepe Reina, l'international espagnol de 37 ans, est une possibilité.", "url": "https://www.lequipe.fr/Football/Article/Transferts-le-psg-pense-a-pepe-reina-comme-gardien-numero-2/1134344", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/pepe-reina-ici-lors-d-un-match-face-au-genoa-ipp-presse-sports/1500000001335765/362:5,1691:1335-640-640-75/0f247.jpg", "publishedAt": "2020-05-13T22:15:00Z", "content": "Confiné au Costa Rica, Keylor Navas peut regarder son avenir sereinement, malgré la pandémie de Covid-19. Le gardien est une des principales satisfactions de cette saison au Paris-SG. Recruté pour 13 millions d'euros au Real dans les ultimes heures du marché … [+104 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "Mondial 2006: Coupet fustige la gestion de Domenech vis-à-vis de Barthez - RMC Sport", "description": "Dans Team Duga ce mercredi, l'ancien gardien de l'OL Grégory Coupet a déploré la gestion de Raymond Domenech lors de la préparation des Bleus pour la Coupe du monde 2006. Il estime ne pas avoir été traité de façon égale par rapport à Fabien Barthez, le titula…", "url": "https://rmcsport.bfmtv.com/football/mondial-2006-coupet-fustige-la-gestion-de-domenech-vis-a-vis-de-barthez-1913475.html", "urlToImage": "https://www.bfmtv.com/i/0/0/649/218b9949985d5bee103a4c1839264.jpeg", "publishedAt": "2020-05-13T21:34:37Z", "content": null}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Floréal Hernandez", "title": "Football : Ezequiel Lavezzi menacé de chantage à la sextape - 20 Minutes", "description": "L’ancien attaquant du PSG Ezequiel Lavezzi a porté plainte après avoir reçu des messages le menaçant de la diffusion de vidéos intimes", "url": "https://www.20minutes.fr/sport/2778515-20200513-football-ezequiel-lavezzi-menace-chantage-sextape", "urlToImage": "https://img.20mn.fr/_MNv001jQWuu88BTJRVTsg/648x360_ezequiel-lavezzi-illustration.jpg", "publishedAt": "2020-05-13T21:27:12Z", "content": "Ezequiel Lavezzi. (Illustration) Eugenio Savio/AP/SIPA\r\nEzequiel Lavezzi victime dans une affaire de chantage à la \r\nsextape. Lancien attaquant argentin du \r\nPSG, 35 ans, a porté plainte à Buenos Aires. Il explique avoir reçu des messages dune ou de plusieurs… [+833 chars]"}, {"source": {"id": null, "name": "Football365.fr"}, "author": "Axel Allag", "title": "Les reproches de Thierry Laurey envers le football français - Football365", "description": "Le coach de Strasbourg est revenu sur l'attitude du football français en général alors que le championnat a été arrêté de façon définitive en raison de la crise sanitaire.", "url": "https://www.football365.fr/reproches-de-thierry-laurey-envers-football-francais-9831788.html", "urlToImage": "https://cdn.football365.fr/wp-content/uploads/se/2019/08/strasbourg_laurey.jpg", "publishedAt": "2020-05-13T20:45:47Z", "content": "Thierry Laurey, l’entraîneur de Strasbourg, n’est pas connu pour avoir la langue dans sa poche. Si la fin de saison de Ligue 1 a pu engendrer de nombreux débats, il y a des choses qu’il n’a pas apprécié. Notamment la façon de défendre trop souvent son propre … [+776 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Henri Leconte : « Il vaut mieux annuler Roland-Garros que de jouer à huis clos » - Roland-Garros - Coronavirus - L'Équipe.fr", "description": "Le finaliste de Roland-Garros en 1988 estime qu'il est inconcevable de maintenir le tournoi sans public.", "url": "https://www.lequipe.fr/Tennis/Actualites/Henri-leconte-il-vaut-mieux-annuler-roland-garros-que-de-jouer-a-huis-clos/1134431", "urlToImage": "https://medias.lequipe.fr/img-video-cover/1500000001335787/640/0", "publishedAt": "2020-05-13T20:21:35Z", "content": "Pour Henri Leconte, finaliste du simple messieurs en 1988 et victorieux du double en 1984, Roland-Garros ne peut pas avoir lieu à huis clos : « Je pense que faire Roland-Garros à huis clos, ça n'a aucun intérêt. Un intérêt pour qui ? Pour les partenaires, cer… [+332 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "PSG : Prolongation, départ, retraite… Cavani s'avoue en plein doute - Foot01.com", "description": "Bientôt en fin de contrat, Edinson Cavani ne sait pas encore s’il restera au Paris Saint-Germain la saison prochaine. L’Uruguayen se dit en pleine réflexion sur son avenir.\r\nOù jouera Edinson Cavani (33 ans) la saison prochaine ? Le principal intéressé…", "url": "https://www.foot01.com/equipe/paris/psg-prolongation-depart-retraite-cavani-s-avoue-en-plein-doute,349117", "urlToImage": "https://www.foot01.com/img/images/1920x1080/2020/May/13/psg-prolongation-depart-retraite-cavani-s-avoue-en-plein-doute-cavani-83,284723.jpg", "publishedAt": "2020-05-13T20:12:08Z", "content": "Bientôt en fin de contrat, Edinson Cavani ne sait pas encore sil restera au Paris Saint-Germain la saison prochaine. LUruguayen se dit en pleine réflexion sur son avenir.\r\nOù jouera Edinson Cavani (33 ans) la saison prochaine ? Le principal intéressé nen a au… [+2118 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Disparition de Robert Herbin : une bâche déployée sur l'hôtel de ville de Saint-Etienne - Foot - Saint-Etienne - L'Équipe.fr", "description": "La ville de Saint-Etienne a déployé une bâche sur la façade de son hôtel de ville en l'honneur de Robert Herbin, ancienne gloire des Verts décédé le 27 avril.", "url": "https://www.lequipe.fr/Football/Actualites/Disparition-de-robert-herbin-une-bache-deployee-sur-l-hotel-de-ville-de-saint-etienne/1134420", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/la-bache-deployee-sur-l-hotel-de-ville-de-saint-etienne-la-ville-de-saint-etienne/1500000001335832/0:0,1525:1017-640-427-75/42e73.jpg", "publishedAt": "2020-05-13T19:54:07Z", "content": "La mort de Robert Herbin, à l'âge de 81 ans, est encore dans tous les esprits. Surtout à Saint-Etienne. Deux semaines et demie après le décès de son ancienne gloire, qui a joué pour les Verts et entraîné le club par la suite, la ville lui a rendu un nouvel ho… [+133 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "FC Metz : Kévin Lejeune est nommé « Team manager » - Foot - L1 - Metz - L'Équipe.fr", "description": "Tout frais retraité, l'ex-milieu offensif Kévin Lejeune, qui évoluait depuis trois ans à l'AC Ajaccio (L2), après cinq saisons passées au FC Metz (2012-2017), retourne en Lorraine pour y occuper le tout nouveau poste de Team manager, sorte de super-intendant,…", "url": "https://www.lequipe.fr/Football/Actualites/Fc-metz-kevin-lejeune-est-nomme-team-manager/1134398", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/lejeune-a-passe-5-saisons-a-metz-mao-l-equipe/1500000001335818/187:122,1783:1186-640-427-75/61879.jpg", "publishedAt": "2020-05-13T18:55:54Z", "content": "Le milieu offensif de l'AC Ajaccio (3e de Ligue 2), Kévin Lejeune (35 ans, formé à Auxerre puis notamment passé par Nantes et Tours), qui vient de mettre un terme à sa carrière, va intégrer l'encadrement du FC Metz en tant que « team manager » de l'équipe pro… [+739 chars]"}, {"source": {"id": null, "name": "Footballclubdemarseille.fr"}, "author": "La Redaction FC Marseille", "title": "Mercato Ex OM : Djibril Cissé veut rejouer en Ligue 1, et fait un appel du pied à un club… - Football Club de Marseille", "description": "L'ancien buteur de l'Olympique de Marseille Djibril Cissé veut rejouer en Ligue 1. Il l'a encore confirmé à la", "url": "https://www.footballclubdemarseille.fr/om-fil-info/home/mercato-ex-om-djibril-cisse-veut-rejouer-en-ligue-1-et-fait-un-appel-du-pied-a-un-club.html", "urlToImage": "https://www.footballclubdemarseille.fr/wp-content/uploads/2019/04/cisse.jpg", "publishedAt": "2020-05-13T18:50:00Z", "content": "L’ancien buteur de l’Olympique de Marseille Djibril Cissé veut rejouer en Ligue 1. Il l’a encore confirmé à la Provence ce mercredi. \r\nA 38 ans, l’ancien buteur de l’OM Djibril Cissé n’a pas abandonné l’idée de rejouer au football. Comme il l’a répété dans le… [+654 chars]"}, {"source": {"id": null, "name": "Parlons-basket.com"}, "author": "Mathieu Seguin", "title": "NBA - Barkley tacle le comportement de Michael Jordan - Parlons Basket", "description": "L’épisode 8 de The Last Dance a mis en lumière la fameuse bagarre intervenue entre Michael Jordan et Steve Kerr. Selon Charles Barkley, His Airness n’a peut-être pas choisi l’actuel coach des Warriors au hasard. Diffusé sur ESPN depuis quelques semaines désor…", "url": "https://www.parlons-basket.com/2020/05/13/nba-charles-barkley-tacle-comportement-de-jordan/", "urlToImage": "https://www.parlons-basket.com/wp-content/uploads/2020/05/Charles-Barkley-michael-jordan-bulls-nba.jpg", "publishedAt": "2020-05-13T18:39:00Z", "content": "L’épisode 8 de The Last Dance a mis en lumière la fameuse bagarre intervenue entre Michael Jordan et Steve Kerr. Selon Charles Barkley, His Airness n’a peut-être pas choisi l’actuel coach des Warriors au hasard.\r\nDiffusé sur ESPN depuis quelques semaines déso… [+1793 chars]"}, {"source": {"id": null, "name": "Www.lci.fr"}, "author": "Yohan ROBLIN", "title": "\"Je l'ai tué parce que je ne l'aimais pas\" : un footballeur turc avoue avoir étouffé son fils hospitalisé - LCI", "description": "EFFROI - Modeste joueur turc, Cevher Toktaş a avoué le meurtre de son fils de 5 ans. L'enfant, soupçonné d'être atteint du coronavirus, avait été hospitalisé. Le père du garçon a expliqué ne jamais l'avoir aimé.", "url": "https://www.lci.fr/football/je-ne-l-aimais-pas-un-footballeur-turc-cevher-toktas-avoue-le-meurtre-de-son-enfant-malade-du-covid-19-2153721.html", "urlToImage": "https://photos.lci.fr/images/613/344/football-turquie-federation-f2c4c1-0@1x.jpeg", "publishedAt": "2020-05-13T18:35:14Z", "content": "\"Je l'ai tué parce que je ne l'aimais pas\". Cevher Toktaş, un joueur du club amateur de Bursa Yıldırımspor, en Turquie, a avoué la semaine passée le meurtre de son fils Kasim. L'enfant, âgé de 5 ans, avait été hospitalisé le 23 avril dernier, alors qu'il prés… [+2517 chars]"}, {"source": {"id": null, "name": "Rugbyrama.fr"}, "author": "Marc Duzan", "title": "Champions Cup - Deux poules de 12 et 8 équipes françaises, la proposition des présidents du Top 14 - Rugbyrama.fr", "description": "INFORMATION MIDI OLYMPIQUE - Lors de la traditionnelle réunion de mercredi soir, les trente présidents du rugby français ont déroulé la proposition qu'ils viennent de faire à l'EPCR, l'organisateur des coupes d'Europe, pour la prochaine Champion's Cup. Plutôt…", "url": "https://www.rugbyrama.fr/rugby/champions-cup/2018-2019/champions-cup-deux-poules-de-12-et-8-equipes-francaises-la-proposition-des-presidents-du-top-14_sto7748277/story.shtml", "urlToImage": "https://i.rugbyrama.fr/2020/01/15/2753672-56895457-1600-900.jpg", "publishedAt": "2020-05-13T16:54:41Z", "content": "Ce mercredi soir, les trente présidents du rugby professionnel étaient réunis autour de Paul Goze, en visioconférence, afin d'évoquer notamment le futur format des coupes d'Europe. Selon nos informations, la proposition française, qui a récemment été présenté… [+2056 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "francetv sport", "title": "\"Arrêtez le football\", les ultras européens s'unissent contre la reprise des matches à huis clos - Franceinfo", "description": "Des ultras de toute l'Europe se sont unis contre la reprise des championnats à huis clos. Près de 400 groupes d'ultras de 150 clubs venant des quatre coins de l'Europe, sont signataires du document : \"Arrêtez le football, pas de football sans supporters\".", "url": "https://sport.francetvinfo.fr/football/arretez-le-football-les-ultras-europeens-sunissent-contre-la-reprise-des-matches-huis-clos", "urlToImage": "https://assets.sport.francetvinfo.fr/sites/default/files/styles/large_16_9/public/2020-05/075_militellomirto-ssdpaler190922_npkta_1.jpg?itok=8CM2jOTa", "publishedAt": "2020-05-13T16:45:07Z", "content": "Des ultras de toute l'Europe se sont unis contre la reprise des championnats à huis clos. Près de 400 groupes d'ultras de 150 clubs venant des quatre coins de l'Europe, sont signataires du document : \"Arrêtez le football, pas de football sans supporters\".Le f… [+3867 chars]"}, {"source": {"id": null, "name": "Ledauphine.com"}, "author": null, "title": "Biathlon et ski. Martin Fourcade a retrouvé la neige après le confinement ! - Le Dauphiné Libéré", "description": "Jeune retraité après une dernière victoire et confiné dans la foulée, Martin Fourcade a retrouvé le contact avec la neige lors d'une sortie de ski de randonnée en Savoie, en compagnie de Michel Lanne..", "url": "https://www.ledauphine.com/skichrono/2020/05/13/martin-fourcade-a-retrouve-la-neige", "urlToImage": "https://cdn-s-www.ledauphine.com/images/23E44C04-9F4A-42AC-B207-1A3F557159AB/FB1200/photo-1589385331.jpg", "publishedAt": "2020-05-13T15:55:00Z", "content": "Il en rêvait, il l'a fait ! Après des semaines de confinement, avec de l'activité physique autour de chez lui, Martin Fourcade, tout frais retraité après sa dernière victoire lors de la poursuite de Kontiolahti, espérait au plus vite rechausser les skis. De r… [+308 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Dopage : Ophélie Claude-Boxberger «ne veut pas payer pour tout» - Le Figaro", "description": "L'athlète Ophélie Claude-Boxberger, dont le dossier pour dopage à l'EPO a été transmis à la commission des sanctions de l'AFLD, explique à l'AFP vouloir prouver son innocence à l'issue d'une période douloureuse.", "url": "https://sport24.lefigaro.fr/athletisme/actualites/dopage-ophelie-claude-boxberger-ne-veut-pas-payer-pour-tout-1001787", "urlToImage": "http://sport24.lefigaro.fr/var/plain_site/storage/images/athletisme/actualites/dopage-ophelie-claude-boxberger-ne-veut-pas-payer-pour-tout-1001787/27111044-1-fre-FR/Dopage-Ophelie-Claude-Boxberger-ne-veut-pas-payer-pour-tout.jpg", "publishedAt": "2020-05-13T15:25:00Z", "content": "L'athlète Ophélie Claude-Boxberger, dont le dossier pour dopage à l'EPO a été transmis à la commission des sanctions de l'AFLD, explique à l'AFP vouloir prouver son innocence à l'issue d'une période douloureuse.La spécialiste du 3.000 m steeple, qui risque qu… [+4330 chars]"}, {"source": {"id": null, "name": "Foot-national.com"}, "author": "foot-national.com", "title": "Dunkerque : Claude Robin réagit après l'annonce de son départ - Foot National", "description": "A la surprise générale, l'USL Dunkerque a décidé de ne", "url": "http://www.foot-national.com/foot-dunkerque-claude-robin-reagit-apres-l-annonce-de-son-depart-133433.html", "urlToImage": "http://www.foot-national.com/content/photos/700/20170217iconsport_win_170217_01_22784.jpg", "publishedAt": "2020-05-13T15:00:41Z", "content": "mercredi 13 mai 2020 à 17:00 -Article écrit par La Rédaction - Réagir à cet article\r\n + DE LIENS :|Compétition \u009bLigue 2 |\r\nA la surprise générale, l'USL Dunkerque a décidé de ne pas prolonger son entraîneur Claude Robin et ce malgré l'officialisation de la mo… [+1571 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "Alexis Bernard", "title": "EXCLU - Mercato : Nice discute pour un joyau à 15 millions d’euros… - Le 10 Sport", "description": "Révélée par A Bola, la piste menant à Gustavo Assunção est bien réelle pour l’OGC Nice. Et les dirigeants niçois commencent le prix à payer pour se l’offrir.", "url": "https://le10sport.com/football/mercato/exclu-mercato-nice-sur-un-joyau-a-15-millions-deuros-503346", "urlToImage": "https://le10static.com/img/master/0000/0016/169174.jpeg", "publishedAt": "2020-05-13T14:15:00Z", "content": "Publié le 13 mai 2020 à 16h15 par Alexis Bernard mis à jour le 13 mai 2020 à 16h28 Révélée par A Bola, la piste menant à Gustavo Assunção est bien réelle pour lOGC Nice. Et les dirigeants niçois commencent le prix à payer pour se loffrir.\r\nAvec une belle enve… [+1599 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Le ministre des Sports italien prudent sur une reprise de la Serie A - Foot - ITA - L'Équipe.fr", "description": "Le ministre des Sports italien, Vincenzo Spadafora, a réaffirmé qu'une reprise de la Serie A ne pourrait avoir lieu que si les conditions sanitaires étaient respectées, alors que le football nécessite proximité et contacts.", "url": "https://www.lequipe.fr/Football/Actualites/Le-ministre-des-sports-italien-prudent-sur-une-reprise-de-la-serie-a/1134274", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/vincenzo-spadafora-le-ministre-des-sports-italien-paolo-bona-presse-sports/1500000001335676/0:0,1949:1300-640-427-75/aba1d.jpg", "publishedAt": "2020-05-13T12:23:57Z", "content": "Le ministre italien des Sports Vincenzo Spadafora a réaffirmé mercredi la ligne prudente du gouvernement quant à une possible reprise du Championnat, qui ne se fera qu' « en sécurité, pour tous ». « Si le Championnat reprend, comme nous l'espérons tous, ce se… [+2142 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Ligue 1 - Ligue 2 - D1 féminine : les Trophées UNFP 2019-2020 annulés - Foot - UNFP - L'Équipe.fr", "description": "Les instances ont décidé d'annuler les Trophées UNFP 2019-2020, la saison n'ayant pu aller à son terme en raison du coronavirus.", "url": "https://www.lequipe.fr/Football/Actualites/Ligue-1-ligue-2-d1-feminine-les-trophees-unfp-2019-2020-annules/1134270", "urlToImage": "https://medias.lequipe.fr/img-video-cover/1500000001335814/640/0", "publishedAt": "2020-05-13T12:03:44Z", "content": "Le coronavirus bouscule tout. Les saisons de Ligue 1, Ligue 2 et Division 1 féminine n'ayant pu aller à leur terme, les instances du foot français ont décidé de ne pas attribuer les récompenses pour la saison 2019-2020. L'UNFP (le syndicat des joueurs), organ… [+434 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Toulon : les joueurs ont proposé «une baisse significative» de leurs salaires - Le Figaro", "description": "Dans un communiqué, le club varois a annoncé que les négociations concernant la baisse de salaires des joueurs étaient pratiquement bouclées. Toulon devient ainsi le deuxième club de Top 14, après Castres, à finaliser un accord. «Les joueurs professionnels du…", "url": "https://sport24.lefigaro.fr/rugby/top-14/fil-info/toulon-les-joueurs-ont-propose-une-baisse-significative-de-leurs-salaires-1001752", "urlToImage": null, "publishedAt": "2020-05-13T10:45:00Z", "content": "Dans un communiqué, le club varois a annoncé que les négociations concernant la baisse de salaires des joueurs étaient pratiquement bouclées. Toulon devient ainsi le deuxième club de Top 14, après Castres, à finaliser un accord. «Les joueurs professionnels du… [+1287 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Arrêté dans une opération antidrogue, Edwin Congo clame son innocence - Eurosport - FRANCE (FR)", "description": "Arrêté dans une opération antidrogue, Edwin Congo clame son innocence.", "url": "https://www.eurosport.fr/football/liga/2019-2020/arrete-dans-une-operation-antidrogue-edwin-congo-clame-son-innocence_sto7747719/story.shtml", "urlToImage": "https://i.eurosport.com/2020/05/12/2817857-58122168-2560-1440.jpg", "publishedAt": "2020-05-13T10:00:50Z", "content": "LIGA - L'ancien footballeur colombien Edwin Congo, remis en liberté après son arrestation en Espagne mardi lors d'une opération antidrogue, a dit être \"innocent\" et n'avoir aucun lien avec le trafic de cocaïne.\r\n\"Je suis innocent, je n'ai absolument rien fait… [+1727 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "24 Heures du Mans. C’est au tour de Corvette racing de déclarer officiellement forfait - Ouest-France", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMirgFodHRwczovL3d3dy5vdWVzdC1mcmFuY2UuZnIvc3BvcnQvMjQtaGV1cmVzLWR1LW1hbnMvMjQtaGV1cmVzLWR1LW1hbnMtYy1lc3QtYXUtdG91ci1kZS1jb3J2ZXR0ZS1yYWNpbmctZGUtZGVjbGFyZXItb2ZmaWNpZWxsZW1lbnQtZm9yZmFpdC1iYTE0MzQ1NC05NGZhLTExZWEtOWJmOS1hOTEwMThlOWMyYWTSAa4BaHR0cHM6Ly9hbXAub3Vlc3QtZnJhbmNlLmZyL3Nwb3J0LzI0LWhldXJlcy1kdS1tYW5zLzI0LWhldXJlcy1kdS1tYW5zLWMtZXN0LWF1LXRvdXItZGUtY29ydmV0dGUtcmFjaW5nLWRlLWRlY2xhcmVyLW9mZmljaWVsbGVtZW50LWZvcmZhaXQtYmExNDM0NTQtOTRmYS0xMWVhLTliZjktYTkxMDE4ZTljMmFk?oc=5", "urlToImage": null, "publishedAt": "2020-05-13T09:51:00Z", "content": null}, {"source": {"id": null, "name": "Foot-national.com"}, "author": "foot-national.com", "title": "St Malo : Fabien Pujo arrive sur le banc (off) - Foot National", "description": "Son passage n'aura été que de courte durée  à Auri", "url": "http://www.foot-national.com/foot-st-malo-fabien-pujo-arrive-sur-le-banc-off-133420.html", "urlToImage": "http://www.foot-national.com/content/photos/700/20170314iconsport_fer_190217_11_16.jpg", "publishedAt": "2020-05-13T09:20:18Z", "content": "Foot-National a été crée en 2001. En Juin 2013, nous avons mis en place un nouveau servicede relation entre joueurs et clubs. Nous sommes tout simplement devenu la plateforme N°1dans le monde du football français, l\u0092outil que nous proposons estLa référence po… [+498 chars]"}, {"source": {"id": null, "name": "Parlons-basket.com"}, "author": "Pierre-Andréa Fraile", "title": "NBA - Perkins donne ses 5 joueurs les plus talentueux all-time, LeBron snobé ! - Parlons Basket", "description": "Fervent défenseur de LeBron James en temps normal, Kendrick Perkins s’est cette fois-ci attiré les foudres de la toile en excluant le King d’un nouveau Top 5 all-time : celui des joueurs les plus talentueux. Lorsque LeBron James fait l’objet de vives critique…", "url": "https://www.parlons-basket.com/2020/05/13/nba-perkins-donne-ses-5-joueurs-les-plus-talentueux-all-time-lebron-snobe/", "urlToImage": "https://www.parlons-basket.com/wp-content/uploads/2020/05/kendrick-perkins-lebron-james-cleveland-cavaliers.jpg", "publishedAt": "2020-05-13T09:11:00Z", "content": "Fervent défenseur de LeBron James en temps normal, Kendrick Perkins sest cette fois-ci attiré les foudres de la toile en excluant le King dun nouveau Top 5 all-time : celui des joueurs les plus talentueux.\r\nLorsque LeBron James fait lobjet de vives critiques … [+1527 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Real Madrid: Bonne nouvelle pour Zidane - Sports.fr", "description": "Alors que le Real Madrid a retrouvé le chemin de l’entraînement en vue d’une probable reprise le mois prochain, Marco Asension a fait son grand retour.  L’arrêt brutal de la saison, mi-mars, en raison de la pandémie de coronavirus aura fait quelques heureux. …", "url": "https://www.sports.fr/football/real-madrid-bonne-nouvelle-zidane-2-352857.html", "urlToImage": "https://sf.sports.fr/wp-content/uploads/2020/03/Zinedine-Zidane.jpg", "publishedAt": "2020-05-13T09:10:12Z", "content": "Alors que le Real Madrid a retrouvé le chemin de lentraînement en vue dune probable reprise le mois prochain, Marco Asension a fait son grand retour. \r\nLarrêt brutal de la saison, mi-mars, en raison de la pandémie de coronavirus aura fait quelques heureux. Ce… [+693 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Rugby. Le projet de Pro D3 voulu par Laporte séduit et s’accélère - Ouest-France", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMicGh0dHBzOi8vd3d3Lm91ZXN0LWZyYW5jZS5mci9zcG9ydC9ydWdieS9ydWdieS1sZS1wcm9qZXQtZGUtcHJvLWQzLXZvdWx1LXBhci1sYXBvcnRlLXNlZHVpdC1ldC1zLWFjY2VsZXJlLTY4MzM4OTTSAXBodHRwczovL2FtcC5vdWVzdC1mcmFuY2UuZnIvc3BvcnQvcnVnYnkvcnVnYnktbGUtcHJvamV0LWRlLXByby1kMy12b3VsdS1wYXItbGFwb3J0ZS1zZWR1aXQtZXQtcy1hY2NlbGVyZS02ODMzODk0?oc=5", "urlToImage": null, "publishedAt": "2020-05-13T08:57:15Z", "content": null}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "Fifa: Platini demande à Infantino de démissionner - RMC Sport", "description": "Dans un entretien accordé à un magazine suisse, l'ancien président de l'UEFA Michel Platini estime que le patron de la Fifa, Gianni Infantino, devrait quitter ses fonctions, compte tenu des soupçons de collusion avec le procureur général suisse Michael Lauber.", "url": "https://rmcsport.bfmtv.com/football/fifa-platini-demande-a-infantino-de-demissionner-1913167.html", "urlToImage": "https://www.bfmtv.com/i/0/0/aad/7e2621935f8998f1473096b9b832c.jpeg", "publishedAt": "2020-05-13T08:55:54Z", "content": null}, {"source": {"id": null, "name": "Basketusa.com"}, "author": "Samuel Hauraix", "title": "Très optimiste, la NBA se donne encore deux à quatre semaines pour décider une éventuelle reprise - BasketUSA", "description": "L'optimisme est de mise parmi les dirigeants de la ligue, à l'issue d'une réunion virtuelle avec le conseil d'administration et Adam Silver.", "url": "https://www.basketusa.com/news/594974/tres-optimiste-la-nba-se-donne-encore-deux-a-quatre-semaines-pour-decider-une-eventuelle-reprise/", "urlToImage": "https://www.basketusa.com/wp-content/uploads/2020/05/chase-center-vide-570x325.jpg", "publishedAt": "2020-05-13T05:55:18Z", "content": "Alors que l’union des joueurs a réalisé un sondage informel sur la volonté de reprise des joueurs NBA, l’optimisme semble déjà de mise du côté des sphères dirigeantes. ESPN rapporte que ce sentiment a émergé cette nuit à l’issue d’une réunion virtuelle avec l… [+1818 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Amiens, la ligue des 22 justiciers / France / Amiens / SOFOOT.com - SO FOOT", "description": "Conférence de presse, pétition... La ficelle picarde ne veut pas se laisser dévorer, mais a-t-elle les arguments pour s’agiter ainsi ...", "url": "https://www.sofoot.com/amiens-la-ligue-des-22-justiciers-483305.html", "urlToImage": "https://www.sofoot.com/IMG/img-twitter-483305.png", "publishedAt": "2020-05-13T04:00:00Z", "content": "Relégué en Ligue 2 à larrêt des championnats, le club picard et son président Bernard Joannin sont devenus de véritables bêtes médiatiques. Facebook live, conférence de presse, pétition, saisie du tribunal administratif... Amiens fait « all-in » , tel Patrick… [+6528 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "G.d.S.S.", "title": "Mercato - PSG : Le Real Madrid est prévenu pour Kylian Mbappé ! - Le 10 Sport", "description": "Sans cesse annoncé sur les traces de Kylian Mbappé, le Real Madrid devrait toutefois avoir du mal à convaincre le PSG ce lui céder l’attaquant français.", "url": "https://le10sport.com/football/mercato/mercato-psg-le-real-madrid-est-prevenu-pour-kylian-mbappe-503269", "urlToImage": "https://le10static.com/img/master/0000/0016/167219.jpeg", "publishedAt": "2020-05-13T00:00:00Z", "content": "Publié le 13 mai 2020 à 2h00 par G.d.S.S. Sans cesse annoncé sur les traces de Kylian Mbappé, le Real Madrid devrait toutefois avoir du mal à convaincre le PSG ce lui céder lattaquant français.\r\nDepuis plusieurs mois, la presse espagnole ne cesse de senflamme… [+854 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "La Rédaction FM", "title": "Le PSG furieux après une entreprise de coques de téléphone en or - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a3484394919466461972-le-psg-furieux-apres-une-entreprise-de-coques-de-telephone", "urlToImage": "https://assets-fr.imgfoot.com/media/cache/1200x675/mbappe-neymar.jpg", "publishedAt": "2020-05-12T17:43:03Z", "content": "Un peu plus tôt dans la journée, on apprenait l'existence d'un cadeau un peu spéciale à destination des joueurs du PSG. D'après l'entreprise anglaise iDesign Gold, qui s'en est félicitée sur les réseaux sociaux, les récents champions de France allaient recevo… [+717 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Redon, l'intello au service du foot / France / Mort de Philippe Redon / SOFOOT.com - SO FOOT", "description": "Retour sur la vie de Philippe Redon, décédé à l'âge de 69 ans ce mardi.", "url": "https://www.sofoot.com/philippe-redon-l-intello-au-service-du-foot-483301.html", "urlToImage": "https://www.sofoot.com/IMG/img-twitter-483301.png", "publishedAt": "2020-05-12T17:00:00Z", "content": "Décédé à l'âge de 69 ans ce mardi, Philippe Redon était un dingue de foot. Sans jamais arrêter ses études, il aura réussi à se faire une place dans le monde professionnel en collectionnant les matchs dans l'élite et fêtant sa première apparition dans la cour … [+6287 chars]"}, {"source": {"id": null, "name": "Sudouest.fr"}, "author": "Sud Ouest", "title": "Rugby : \"Si Pro D3 il y a, Dax y sera\", assure le président Benoît August - Sud Ouest", "description": "Alors que le projet de \"Pro D3\" ou \"National\" voulu par Bernard Laporte est encore très flou, le président de l'US Dax, Benoît August, assure que s'il se concrétise le club rouge et blanc sera de la partie", "url": "https://www.sudouest.fr/2020/05/12/rugby-si-pro-d3-il-y-a-dax-y-sera-assure-le-president-benoit-august-7478854-773.php", "urlToImage": "https://images.sudouest.fr/2020/05/12/5ebac36f66a4bd7c324114ff/golden/benoit-august-est-president.jpg?v1", "publishedAt": "2020-05-12T16:22:56Z", "content": "Un peu sur le modèle du National du football, niveau intermédiaire entre son dernier championnat amateur et la Ligue 2, le président de la Fédération Française de Rugby Bernard Laporte voudrait un National ou \"Pro D3\" pour le rugby.\r\n\"J’ai demandé à la Ligue … [+2323 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Boxe : attention, Mike Tyson est de retour sur le ring ! - Le Parisien", "description": "L’ancien champion du monde des poids lourds a annoncé qu’il reprenait la boxe sur le ring pour des combats caritatifs dans un premier temps.", "url": "http://www.leparisien.fr/sports/boxe-attention-mike-tyson-est-de-retour-sur-le-ring-12-05-2020-8315715.php", "urlToImage": "https://cloudfront-eu-central-1.images.arcpublishing.com/leparisien/EYZN5STQ5DLKOBHYB55L7FMZ4U.jpg", "publishedAt": "2020-05-12T15:30:00Z", "content": "C'est une courte séquence vidéo de quelques secondes qui a déjà été vue plus de 6 millions de fois en quelques heures. Sur son compte Instagram, on y voit un vieux boxeur affûté comme jamais frapper comme un sourd contre un sparring-partner. Quand il se relèv… [+3286 chars]"}]}