{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Footmercato.net"}, "author": "Tom Monegier", "title": "PSG : gros retournement de situation pour l’avenir d'Edinson Cavani - Foot Mercato", "description": "En fin de contrat en juin prochain au Paris Saint-Germain, Edinson Cavani sera donc bientôt libre et les écuries intéressées ne manquent pas. Mais de son côté, l'Uruguayen n'aurait pas encore dit non à une prolongation de contrat afin de rester encore un peu …", "url": "https://www.footmercato.net/a4616925907730920363-psg-gros-retournement-de-situation-pour-lavenir-dedinson-cavani", "urlToImage": null, "publishedAt": "2020-04-25T18:20:45Z", "content": "Depuis son arrivée en 2013 en provenance du Napoli, Edinson Cavani en a joué des matches avec le Paris Saint-Germain. Auteur de 301 apparitions au total sous le maillot parisien, l'avant-centre uruguayen a trouvé le chemin des filets à 200 reprises. Mais cett… [+1774 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Paroles d'ex en vidéo : Bathenay, Fernandez, Castaneda et Lopez refont la finale de la Coupe de France 1982 PSG - Saint-Étienne - Foot - Coupe - Paroles d'ex - L'Équipe.fr", "description": "« L'Equipe » a réuni quatre acteurs de la finale de la Coupe de France 1982 : Dominique Bathenay et Luis Fernandez côté parisien, Jean Castaneda et Christian Lopez côté stéphanois. Un échange d'une heure riche en souvenirs et anecdotes, rythmé par quelques ta…", "url": "https://www.lequipe.fr/Football/Actualites/Paroles-d-ex-en-video-bathenay-fernandez-castaneda-et-lopez-refont-la-finale-de-la-coupe-de-france-1982-psg-saint-etienne/1129761", "urlToImage": null, "publishedAt": "2020-04-25T17:25:41Z", "content": "Chaque dimanche, depuis 2013, un ancien joueur du Championnat de France de football égrène souvenirs et anecdotes dans la rubrique « Paroles d'ex » de L'Équipe. Devenue incontournable, cette rubrique trouve aujourd'hui son prolongement sur le numérique, dans … [+1005 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Mathieu Rault", "title": "Premier League : un scénario de reprise se précise - Foot Mercato", "description": "L'Angleterre se prépare à retrouver le football. C'est en tout cas ce sur quoi travaille le gouvernement britannique, qui lors d'une réunion tenue la semaine dernière a dessiné les contours de la reprise de la Premier League. Dates, lieux, programmation tv et…", "url": "https://www.footmercato.net/a8397470620323522256-premier-league-un-scenario-de-reprise-se-precise", "urlToImage": null, "publishedAt": "2020-04-25T17:16:44Z", "content": "Quatre-vingt-douze matches restent à disputer en Premier League. Un championnat qui comme de nombreux autres s'était arrêté le vendredi 13 mars, alors que Liverpool caracolait en tête du classement, 25 points devant Manchester City. Si en Belgique ou aux Pays… [+3087 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Touché par le coronavirus, Junior Sambia (Montpellier) respire seul - Foot - L1 - Montpellier - L'Équipe.fr", "description": "L'état du jeune milieu montpelliérain s'est amélioré : il n'est plus placé sous assistance respiratoire.", "url": "https://www.lequipe.fr/Football/Actualites/Touche-par-le-coronavirus-junior-sambia-montpellier-respire-seul/1129753", "urlToImage": null, "publishedAt": "2020-04-25T17:15:30Z", "content": "Les dernières nouvelles de l'état de santé de Junior Sambia, touché par le Covid-19, plongé dans un coma artificiel et intubé depuis jeudi après-midi, sont rassurantes. Le protocole de réveil initié ce vendredi soir par le service médical a bien fonctionné."}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "PSG : Neymar c'est 164ME, la FIFA a tranché - Foot01.com", "description": "Retenu par le Paris Saint-Germain l’été dernier, Neymar sera un peu plus accessible au prochain mercato. Pour le recruter, il faudra bien payer le prix fixé par la FIFA, un montant révélé par son ancien agent Wagner Ribeiro.\r\nParmi les nombreuses rumeurs…", "url": "https://www.foot01.com/equipe/paris/psg-neymar-c-est-164me-la-fifa-a-tranche,347961", "urlToImage": null, "publishedAt": "2020-04-25T17:12:18Z", "content": "Retenu par le Paris Saint-Germain lété dernier, Neymar sera un peu plus accessible au prochain mercato. Pour le recruter, il faudra bien payer le prix fixé par la FIFA, un montant révélé par son ancien agent Wagner Ribeiro.\r\nParmi les nombreuses rumeurs qui c… [+1569 chars]"}, {"source": {"id": null, "name": "Maxifoot.fr"}, "author": null, "title": "Man Utd : Keane voit un problème à régler - Maxifoot", "description": "Lors du prochain mercato d'été, Manchester United risque de se montrer actif avec notamment un intérêt pour l'ailier du ...", "url": "https://news.maxifoot.fr/man-utd/keane-voit-un-probleme-a-regler-foot-325250.htm", "urlToImage": null, "publishedAt": "2020-04-25T17:10:00Z", "content": "Lors du prochain mercato d'été, Manchester United risque de se montrer actif avec notamment un intérêt pour l'ailier du Borussia Dortmund Jadon Sancho. Mais pour l'ancien joueur des Red Devils Roy Keane, le club mancunien doit surtout renforcer son secteur dé… [+550 chars]"}, {"source": {"id": null, "name": "Topmercato.com"}, "author": null, "title": "PSG : l'Inter Milan aurait ajouté une clause spéciale pour Icardi - Top Mercato.com", "description": "Le transfert de l'attaquant argentin Mauro Icardi pourrait être plus important que prévu pour le Paris Saint-Germain.", "url": "http://www.topmercato.com/219608,1/psg---l-inter-milan-aurait-ajoute-une-clause-speciale-pour-icardi.html", "urlToImage": null, "publishedAt": "2020-04-25T16:52:00Z", "content": "Le transfert de l'attaquant argentin Mauro Icardi pourrait être plus important que prévu pour le Paris Saint-Germain.Intéressé par le recrutement définitif du footballeur de 27 ans, prêté depuis le début de saison par l'Inter Milan, le club de la capitale tri… [+660 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Le Barça serait prêt à sécher la possible reprise de la Liga - SO FOOT", "description": "Sur un terrain ou en dehors, le Barça n'est pas facile à maîtriser. Vendredi, lors d'une conférence téléphonique, le président de la Liga ...", "url": "https://www.sofoot.com/le-barca-serait-pret-a-secher-la-possible-reprise-de-la-liga-482674.html", "urlToImage": null, "publishedAt": "2020-04-25T16:15:00Z", "content": "Sur un terrain ou en dehors, le Barça n'est pas facile à maîtriser.Vendredi, lors d'une conférence téléphonique, le président de la Liga Javier Tebas s'est montré très clair : une non-reprise du championnat est pour lui inenvisageable. « Les clubs qui refuser… [+680 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "20 Minutes avec AFP", "title": "ASSE : Le mythique entraîneur des Verts, Robert Herbin, a été hospitalisé à Saint-Etienne - 20 Minutes", "description": "Il a été admis au CHU de Saint-Étienne pour de sérieuses insuffisances cardiaques et pulmonaires", "url": "https://www.20minutes.fr/sport/2767691-20200425-asse-ex-mythique-entraineur-verts-robert-herblin-hospitalise-saint-etienne", "urlToImage": null, "publishedAt": "2020-04-25T16:11:09Z", "content": "Robert Herbin, ici le 4 mars 2003 à Meylan avec Thierry Roland, a été hospitalisé à Saint-Etienne, le 21 avril 2020. PHILIPPE MERLE / AFP\r\nRobert Herbin, entraîneur emblématique de la grande époque de lAS Saint-Etienne, est hospitalisé depuis mardi au CHU de … [+1572 chars]"}, {"source": {"id": null, "name": "Sudouest.fr"}, "author": "Sud Ouest", "title": "Coronavirus : Emma et Katy, ces jumelles de 37 ans sont décédées à trois jours d’intervalle - Sud Ouest", "description": "Inséparables depuis leur naissance, ces deux Britanniques étaient infirmières et ont succombé à l'épidémie de coronavirus cette semaine, à trois jours d'intervalle.", "url": "https://www.sudouest.fr/2020/04/25/emma-et-katy-ces-jumelles-de-37-ans-sont-decedees-a-trois-jours-d-intervalle-du-coronavirus-7439350-10997.php", "urlToImage": null, "publishedAt": "2020-04-25T15:53:00Z", "content": "Soeurs jumelles jusque dans la mort. Emma et Katy Davies, 37 ans, sont décédées cette semaine à trois jours d’intervalle des suites de l’épidémie de coronavirus à Southampton, en Grande-Bretagne. Leur jeune sœur Zoé s’est confiée à la BBC (voir la vidéo ci-de… [+1159 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Cedric Rablat", "title": "FC Barcelone : la stratégie de Quique Setién pour relancer Philippe Coutinho - Foot Mercato", "description": "Le milieu offensif brésilien, actuellement en prêt au Bayern Munich, ne sait pas encore ce que lui réserve l'avenir. Mais l'entraîneur catalan aurait déjà sa petite idée pour relancer la carrière de l'intéressé au Barça.", "url": "https://www.footmercato.net/a1406994864420996443-fc-barcelone-la-strategie-de-quique-setien-pour-relancer-philippe-coutinho", "urlToImage": null, "publishedAt": "2020-04-25T15:12:51Z", "content": "Et si le FC Barcelone tendait la main à Philippe Coutinho (27 ans) pour relancer sa carrière en Catalogne ? Prêté l'été dernier par le Barça au Bayern Munich, le milieu offensif brésilien réalise un exercice plutôt satisfaisant sous les couleurs bavaroises (2… [+2205 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Saint-Étienne : Mahdi Camara prolonge jusqu'en 2024 - Foot - L1 - Saint-Etienne - L'Équipe.fr", "description": "Le milieu stéphanois a prolongé de deux ans le contrat qui le lie à son club formateur.", "url": "https://www.lequipe.fr/Football/Actualites/Saint-etienne-mahdi-camara-prolonge-jusqu-en-2024/1129719", "urlToImage": null, "publishedAt": "2020-04-25T15:00:47Z", "content": "L'AS Saint-Étienne profite du confinement pour s'inscrire dans la durée avec ses jeunes joueurs formés au club : après l'attaquant Charles Abi et le défenseur Wesley Fofana, c'est le milieu Mahdi Camara (21 ans) qui a prolongé vendredi son contrat avec les Ve… [+68 chars]"}, {"source": {"id": null, "name": "Dailymercato.com"}, "author": "", "title": "Mercato OM : Thauvin toujours associé à l'AS Roma - Daily Mercato", "description": "Florian Thauvin fait parler de lui en Italie ce samedi. Selon La Gazzetta dello Sport, l'AS Roma pense toujours &agrave; l'ailier de l'OM et aimerait ...", "url": "https://www.dailymercato.com/news/mercato-om-thauvin-toujours-associe-a-l-as-roma", "urlToImage": null, "publishedAt": "2020-04-25T14:47:16Z", "content": "Florian Thauvin fait parler de lui en Italie ce samedi. Selon La Gazzetta dello Sport, l'AS Roma pense toujours à l'ailier de l'OM et aimerait profiter de sa fin de contrat en 2021 pour tenter sa chance cet été.\"De la fantaisie, des buts et des passes décisiv… [+1910 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "La Fédération appelle à autoriser le cyclisme dès le 11 mai - Cyclisme - L'Équipe.fr", "description": "La FFC estime dans un communiqué qu'un non-retour de l'activité cycliste à la date de démarrage du déconfinement, le 11 mai, <i>« constituerait une véritable discrimination vis-à-vis de (son) sport » </i>et rappelle les bienfaits du vélo pour toute la société.", "url": "https://www.lequipe.fr/Cyclisme-sur-route/Actualites/La-federation-appelle-a-autoriser-le-cyclisme-des-le-11-mai/1129716", "urlToImage": null, "publishedAt": "2020-04-25T14:46:33Z", "content": "La Fédération française de cyclisme a appelé samedi les autorités à autoriser la pratique du vélo dès le 11 mai, date annoncée de début du déconfinement, et dit espérer une reprise des compétitions « dans le respect des mesures sanitaires définies par l'État,… [+2468 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "B.C.", "title": "Mercato - PSG : Leonardo voudrait s'attaquer à un joueur du FC Barcelone ! - Le 10 Sport", "description": "Alors que le PSG est à la recherche d'un milieu de terrain, Arthur Melo plairait fortement à Leonardo.", "url": "https://le10sport.com/football/mercato/mercato-psg-leonardo-voudrait-sattaquer-a-un-joueur-du-fc-barcelone-501114", "urlToImage": null, "publishedAt": "2020-04-25T14:45:00Z", "content": "Publié le 25 avril 2020 à 16h45 par B.C. Alors que le PSG est à la recherche d'un milieu de terrain, Arthur Melo plairait fortement à Leonardo.\r\nMalgré les arrivées d'Ander Herrera et d'Idrissa Gueye l'été dernier, Leonardo souhaiterait toujours renforcer l'e… [+838 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "OL : Depay refuse toutes ses offres, Aulas ne lâche pas l'affaire - Foot01.com", "description": "Lié à l’Olympique Lyonnais jusqu’en 2021, Memphis Depay a refusé plusieurs offres de prolongation. Pas de quoi décourager son président Jean-Michel Aulas.\r\nToujours en convalescence après sa rupture des ligaments croisés d’un genou en décembre dernier…", "url": "https://www.foot01.com/equipe/ol/ol-depay-refuse-toutes-ses-offres-aulas-ne-lache-pas-l-affaire,347947", "urlToImage": null, "publishedAt": "2020-04-25T14:31:54Z", "content": "Lié à lOlympique Lyonnais jusquen 2021, Memphis Depay a refusé plusieurs offres de prolongation. Pas de quoi décourager son président Jean-Michel Aulas.\r\nToujours en convalescence après sa rupture des ligaments croisés dun genou en décembre dernier, Memphis D… [+1360 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "La rédaction", "title": "Mercato - PSG : Le Barça a établi sa stratégie pour le retour de Neymar... - Le 10 Sport", "description": "Alors que l’avenir de Neymar reste toujours flou du côté du PSG, le FC Barcelone serait en train de préparer un plan pour essayer d’attirer l’international brésilien dans ses rangs.", "url": "https://le10sport.com/football/mercato/mercato-barcelone-la-strategie-du-barca-pour-attirer-neymar-501081", "urlToImage": null, "publishedAt": "2020-04-25T13:15:00Z", "content": "Publié le 25 avril 2020 à 15h15 par La rédaction Alors que lavenir de Neymar reste toujours flou du côté du PSG, le FC Barcelone serait en train de préparer un plan pour essayer dattirer linternational brésilien dans ses rangs. \r\nLe Barça aurait monté un plan… [+1303 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/profile.php?id=100010643894333", "title": "Selon un avocat spécialisé, un joueur en fin de contrat le 30 juin “sera libre de ne pas prolonger” - Canal Supporters", "description": "Pour Sevan Karian les joueurs en fin de contrat le 30 juin ne seront pas obligés de prolonger jusqu’à la fin des championnats.", "url": "https://canal-supporters.com/2020/04/pour-un-avocat-specialise-en-droit-du-sport-un-joueur-en-fin-de-contrat-le-30-juin-sera-libre-de-ne-pas-signer-une-prolongation-jusqua-la-fin-de-la-saison-2019-2020/", "urlToImage": null, "publishedAt": "2020-04-25T13:02:56Z", "content": "C’est l’une des questions qui agitent le monde du football au moment où des dates de reprises sont évoquées. Comment gérer les joueurs en fin de contrat le 30 juin2020 ? Pour rappel, cela concerne neuf joueurs au PSG. Dans les colonnes de Ouest FranceSevan Ka… [+977 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": null, "title": "Football : finalement, Olivier Giroud va prolonger son séjour à Chelsea - Le Monde", "description": "Le club anglais a décidé de prolonger d’un an, jusqu’à juin 2021, le contrat de l’international français.", "url": "https://www.lemonde.fr/sport/article/2020/04/25/football-finalement-olivier-giroud-prolonge-son-sejour-a-chelsea_6037765_3242.html", "urlToImage": null, "publishedAt": "2020-04-25T12:55:03Z", "content": "Olivier Giroud célébrant un but lors dun match amical France-Paraguay le 2 juin 2017 à Rennes. FRANCK FIFE / AFP\r\nFinalement, il reste. Et prolonge même son bail. Olivier Giroud continuera de jouer à Chelsea jusquen juin 2021. La direction du club anglais de … [+2835 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Coronavirus : le Championnat de Pologne devrait reprendre fin mai - Foot - POL - Coronavirus - L'Équipe.fr", "description": "Le Premier ministre polonais Mateusz Morawiecki a annoncé un probable redémarrage de l'élite polonaise le 29 mai.", "url": "https://www.lequipe.fr/Football/Actualites/Coronavirus-le-championnat-de-pologne-devrait-reprendre-fin-mai/1129700", "urlToImage": null, "publishedAt": "2020-04-25T12:36:45Z", "content": "Le Championnat de football de Pologne, suspendu à cause de la pandémie de coronavirus, devrait reprendre le 29 mai en l'absence de public, a annoncé samedi le Premier ministre polonais Mateusz Morawiecki. « Nous avons un plan précis pour arriver au premier ma… [+587 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "Ita : Séparés, Cristiano Ronaldo et la Juve entretiennent la flamme - Foot01.com", "description": "Touchée par la crise sanitaire et financière, la Juventus Turin ne tentera pas de vendre Cristiano Ronaldo cet été. Les deux parties sont satisfaites et d’accord pour continuer ensemble.\r\nLes conséquences de l’interruption de la saison n’épargnent personne…", "url": "https://www.foot01.com/foot-europeen/italie/ita-separes-cristiano-ronaldo-et-la-juve-entretiennent-la-flamme,347943", "urlToImage": null, "publishedAt": "2020-04-25T12:03:35Z", "content": "Touchée par la crise sanitaire et financière, la Juventus Turin ne tentera pas de vendre Cristiano Ronaldo cet été. Les deux parties sont satisfaites et daccord pour continuer ensemble.\r\nLes conséquences de linterruption de la saison népargnent personne, pas … [+1190 chars]"}, {"source": {"id": null, "name": "Sportune.fr"}, "author": null, "title": "OM - Combien ça coûte de recruter Jimmy Cabot (FC Lorient) ? - Sportune.fr, le spécialiste de l'économie du sport business", "description": "Contraint d'oeuvrer à moindre frais, l'OM doit restreindre le champ de ses recherches à des joueurs peu voire plus valorisés sur le marché, pour recruter", "url": "https://www.sportune.fr/business/om-combien-ca-coute-de-recruter-jimmy-cabot-fc-lorient-233532", "urlToImage": null, "publishedAt": "2020-04-25T12:00:00Z", "content": "25 avril 2020 à 14:00 par Thomas\r\n0\r\nL’OM suit Jimmy Cabot qui sera bientôt en fin de contrat, avec le FC Lorient.\r\nContraint d’oeuvrer à moindre frais, l’OM doit restreindre le champ de ses recherches à des joueurs peu voire plus valorisés sur le marché, pou… [+1543 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Yannick Sagorin", "title": "L’Ajax privé de titre, Ziyech ne digère pas - Sports.fr", "description": "Les responsables de l’Eredivisie ont pris la décision vendredi de ne pas désigner de champion alors que la saison aux Pays-Bas ne reprendra pas. Malgré son statut de leader après 25 journées sur 34 au programme, l’Ajax n’étoffe donc pas son palmarès. Logique …", "url": "https://www.sports.fr/football/lajax-prive-de-titre-ziyech-ne-digere-349562.html", "urlToImage": null, "publishedAt": "2020-04-25T11:50:44Z", "content": "Les responsables de lEredivisie ont pris la décision vendredi de ne pas désigner de champion alors que la saison aux Pays-Bas ne reprendra pas. Malgré son statut de leader après 25 journées sur 34 au programme, lAjax nétoffe donc pas son palmarès. Logique pou… [+935 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "ASSE - Caïazzo prévient : la CDF doit pouvoir offrir l'Europe - Goal.com", "description": "Memphis Depay has rejected \"a number\" of contract offers from Lyon but the club is not giving up hope of securing him to a new deal, according to president Jean-Michel Aulas.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T11:18:00Z", "content": "More"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Sasha Beckermann", "title": "Concierge de luxe au temps du confinement : \"Un client nous a demandé de lui faire livrer un chat\" - Eurosport - FRANCE (FR)", "description": "Covid19 oblige, Jérémy Vosse, patron de Premium Conciergerie, une conciergerie de luxe, a dû adapter ses services aux demandes de ses clients.", "url": "https://www.eurosport.fr/football/concierge-de-luxe-au-temps-du-confinement-un-client-nous-a-demande-de-lui-faire-livrer-un-chat_sto7733070/story.shtml", "urlToImage": null, "publishedAt": "2020-04-25T10:59:22Z", "content": "Covid19 oblige, Jérémy Vosse, patron de Premium Conciergerie, une conciergerie de luxe, a dû adapter ses services aux demandes - parfois déraisonnables - de ses clients, dont une bonne partie sont des sportifs : footballeurs des championnats européens et du M… [+3916 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Max Franco Sanchez", "title": "Eredivisie : l'annulation du championnat fait polémique - Foot Mercato", "description": "La décision d'annuler la saison fait beaucoup parler aux Pays-Bas, où de nombreux joueurs et clubs s'estiment lésés et désavantagés.", "url": "https://www.footmercato.net/a7504463592023464225-eredivisie-lannulation-du-championnat-fait-polemique", "urlToImage": null, "publishedAt": "2020-04-25T10:54:25Z", "content": "C'est le premier championnat de l'ouest-européen qui a déjà fait savoir qu'il ne reprendra pas. Alors que le gouvernement avait annoncé l'annulation des différents événements sportifs et culturels à travers le pays plus tôt dans la semaine, la Fédération Néer… [+3055 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Expulsé pendant le Tournoi, Haouas a purgé sa suspension pendant le confinement - Le Figaro", "description": "Expulsé lors de la rencontre du Tournoi Ecosse-France le 8 mars dernier pour un coup de poing sur le deuxième ligne du XV au Chardon Jamie Ritchie, Mohamed Haouas avait écopé d'une suspension de trois semaines. Bonne nouvelle pour le joueur de Montpellier : c…", "url": "https://sport24.lefigaro.fr/rugby/top-14/fil-info/expulse-pendant-le-tournoi-haouas-a-purge-sa-suspension-pendant-le-confinement-1000260", "urlToImage": null, "publishedAt": "2020-04-25T10:46:00Z", "content": "Expulsé lors de la rencontre du Tournoi Ecosse-France le 8 mars dernier pour un coup de poing sur le deuxième ligne du XV au Chardon Jamie Ritchie, Mohamed Haouas avait écopé d'une suspension de trois semaines. Bonne nouvelle pour le joueur de Montpellier : c… [+746 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Yannick Sagorin", "title": "Ce qu’ont versé Canal+ et beIN Sports à la LFP - Sports.fr", "description": "Les groupes Canal+ et beIN Sports ont obtenu une belle ristourne auprès de la LFP pour les matches de championnat déjà diffusés. Les négociations des présidents Nasser al-Khelaïfi (PSG), Jacques-Henri Eyraud (OM), Olivier Sadran (Toulouse) et Jean-Pierre Rivè…", "url": "https://www.sports.fr/football/quont-verse-canal-bein-sports-a-lfp-349556.html", "urlToImage": null, "publishedAt": "2020-04-25T10:44:47Z", "content": "Les groupes Canal+ et beIN Sports ont obtenu une belle ristourne auprès de la LFP pour les matches de championnat déjà diffusés.\r\nLes négociations des présidents Nasser al-Khelaïfi (PSG), Jacques-Henri Eyraud (OM), Olivier Sadran (Toulouse) et Jean-Pierre Riv… [+857 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "OL : Entre Lyon et Kalulu, ça sent le déconfinement compliqué - Foot01.com", "description": "En discussions avec Pierre Kalulu pour la signature d’un premier contrat professionnel, l’Olympique Lyonnais rencontre certains obstacles dont le Bayern Munich fait partie.\r\nPlus que jamais, le marché des tout jeunes joueurs est à la mode. Sans parler…", "url": "https://www.foot01.com/equipe/ol/ol-entre-lyon-et-kalulu-ca-sent-le-deconfinement-complique,347919", "urlToImage": null, "publishedAt": "2020-04-25T10:06:32Z", "content": "En discussions avec Pierre Kalulu pour la signature dun premier contrat professionnel, lOlympique Lyonnais rencontre certains obstacles dont le Bayern Munich fait partie.\r\nPlus que jamais, le marché des tout jeunes joueurs est à la mode. Sans parler du contex… [+1217 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Alkiviades David se positionne sur le naming du Camp Nou - SO FOOT", "description": "La course est lancée. Pour la toute première fois de son histoire, le FC Barcelone a annoncé vouloir recourir au procédé du naming concernant ...", "url": "https://www.sofoot.com/alkiviades-david-se-positionne-deja-sur-le-naming-du-camp-nou-482660.html", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": "La course est lancée. Pour la toute première fois de son histoire, le FC Barcelone a annoncé vouloir recourir au procédé du naming concernant son Camp Nou afin d'engendrer des fonds pour lutter contre le Covid-19. Avec un premier candidat d'ores et déjà intér… [+874 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Bixente Lizarazu : « En 1998, on avait un mutant, Zinédine Zidane » - Foot - CM - Bleus - L'Équipe.fr", "description": "Dans le cadre d'un échange avec les abonnés de L'Équipe, Bixente Lizarazu a fait un comparatif entre les Bleus de 1998 et ceux de 2018.", "url": "https://www.lequipe.fr/Football/Actualites/Bixente-lizarazu-en-1998-on-avait-un-mutant-zinedine-zidane/1129667", "urlToImage": null, "publishedAt": "2020-04-25T09:55:01Z", "content": "Dans le cadre d'un échange avec les abonnés de L'Équipe jeudi, Bixente Lizarazu s'est lancé dans un comparatif entre l'équipe de France 1998 et celle de 2018, toutes les deux championnes du monde. « On était plus forts en défense, on était plus expérimentés. … [+137 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Olivia Maunoury", "title": "Estelle Mossely et Tony Yoka : sexe de leur bébé révélé en direct, avec Lignac - Pure People", "description": "Vendredi 24 avril 2020, Cyril Lignac a proposé un nouveau numéro de son émission \"Tous en cuisine, en direct avec Cyril Lignac\" sur M6. Pour préparer son taboulé vert aux crevettes, le célèbre chef a pu compter sur la participation d'Estelle Mossely, Tony Yok…", "url": "https://www.purepeople.com/article/estelle-mossely-et-tony-yoka-sexe-de-leur-bebe-revele-en-direct-avec-lignac_a385709/1", "urlToImage": null, "publishedAt": "2020-04-25T09:52:00Z", "content": "C'est ce que l'on appelle la magie du direct ! En invitant Estelle Mossely et Tony Yoka dans son émission quotidienne de cuisine sur M6, Tous en cuisine, en direct avec Cyril Lignac, le célèbre chef ne s'attendait surement pas à obtenir une information exclus… [+1652 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "OM : Eyraud paye les employés de sa poche à Marseille ! - Foot01.com", "description": "Voilà une révélation surprenante qui démontre qu’à l’OM, malgré les difficultés financières, les petits salaires ne sont pas à l’abandon.\r\n Parmi les premières mesures prises par les clubs face à l’arrêt des matchs et donc de nombreuses rentrées d’argent…", "url": "https://www.foot01.com/equipe/marseille/om-eyraud-paye-les-employes-de-sa-poche-a-marseille,347899", "urlToImage": null, "publishedAt": "2020-04-25T09:31:15Z", "content": "Voilà une révélation surprenante qui démontre quà lOM, malgré les difficultés financières, les petits salaires ne sont pas à labandon.\r\n Parmi les premières mesures prises par les clubs face à larrêt des matchs et donc de nombreuses rentrées dargent, lensembl… [+1437 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Programme TV du samedi 25 avril : que regarder en sport à la télé ? - Tous sports - L'Équipe.fr", "description": "Retrouvez le meilleur des programmes de sport à suivre à la télé ce samedi 25 avril.", "url": "https://www.lequipe.fr/Medias/Actualites/Programme-tv-du-samedi-25-avril-que-regarder-en-sport-a-la-tele/1129569", "urlToImage": null, "publishedAt": "2020-04-25T09:30:00Z", "content": "Pendant la période de confinement, L'Équipe vous propose, chaque jour, une sélection de quelques programmes sportifs à suivre sur les chaînes de télé françaises. Retrouvez notamment, sur la chaîne L'Équipe, à partir de 13 heures, la 8e étape du Tour de France… [+1488 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "En pleine gloire avec le Barça en 2009, Andrés Iniesta «a pensé au suicide» - Le Figaro", "description": "LE SCAN SPORT - Alors qu'il était au sommet avec le club espagnol à l'issue d'une saison 2008-2009 couronnée de succès, le milieu de terrain a avoué avoir souffert d'une sévère dépression pendant plusieurs mois.", "url": "https://sport24.lefigaro.fr/scan-sport/actualites/en-pleine-gloire-avec-le-barca-iniesta-a-pense-au-suicide-1000247", "urlToImage": null, "publishedAt": "2020-04-25T09:24:00Z", "content": "LE SCAN SPORT - Alors qu'il était au sommet avec le club espagnol à l'issue d'une saison 2008-2009 couronnée de succès, le milieu de terrain a avoué avoir souffert d'une sévère dépression pendant plusieurs mois.On peut être un des plus grands footballeur de l… [+2821 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Michael Balcaen", "title": "Les Red Devils ne voudraient plus de Pogba… - Sports.fr", "description": "Paul Pogba a toujours autant envie de quitter Manchester United. Un départ qui paraît inéluctable. Mais le Real Madrid et la Juventus ne sont pas seuls sur le coup. L’Inter Milan  a également des vues sur le milieu de terrain tricolore. Le chantier du transfe…", "url": "https://www.sports.fr/football/real-a-de-concurrence-pogba-349548.html", "urlToImage": null, "publishedAt": "2020-04-25T09:09:22Z", "content": "Paul Pogba a toujours autant envie de quitter Manchester United. Un départ qui paraît inéluctable. Mais le Real Madrid et la Juventus ne sont pas seuls sur le coup. L’Inter Milan  a également des vues sur le milieu de terrain tricolore.\r\nLe chantier du transf… [+1418 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "PSG-ASSE le 13 juin et PSG-OL le 16 juin, les complotistes adorent - Foot01.com", "description": "Le président de la FFF veut faire des finales des coupes nationales les deux premiers matchs après la reprise, si reprise il y a. Mais cela fait tousser.\r\nLe football français est visiblement très impatient de reprendre le chemin de la compétition, et…", "url": "https://www.foot01.com/coupe/psg-asse-le-13-juin-et-psg-ol-le-16-juin-les-complotistes-adorent,347935", "urlToImage": null, "publishedAt": "2020-04-25T09:09:09Z", "content": "Le président de la FFF veut faire des finales des coupes nationales les deux premiers matchs après la reprise, si reprise il y a. Mais cela fait tousser.\r\nLe football français est visiblement très impatient de reprendre le chemin de la compétition, et cela al… [+1735 chars]"}, {"source": {"id": null, "name": "Nextgen-auto.com"}, "author": "A. Combralier", "title": "La F1 ‘restera comme une expérience hyperdésagréable' pour Bourdais - Nextgen-Auto.com", "description": "Formule 1 | A l'image d'un autre Français avant lui – Pierre Gasly – Sébastien Bourdais a expérimenté par lui-même la dureté de la filière Red Bull et du Docteur (...)", "url": "https://motorsport.nextgen-auto.com/fr/formule-1/la-f1-restera-comme-une-experience-hyperdesagreable-pour-bourdais,147478.html", "urlToImage": null, "publishedAt": "2020-04-25T08:33:00Z", "content": "A limage dun autre Français avant lui Pierre Gasly Sébastien Bourdais a expérimenté par lui-même la dureté de la filière Red Bull et du Docteur Marko. Malgré des performances encourageantes par moments, Bourdais avait en effet été remercié, en pleine saison, … [+3018 chars]"}, {"source": {"id": null, "name": "Rugbyrama.fr"}, "author": "Rugbyrama", "title": "Transferts - Pau : Smith prolonge, Slade vers le Japon - Rugbyrama.fr", "description": "TRANSFERTS - Cette semaine, la Section paloise a officialisé l’avenir de ses deux doubles champions du monde All Blacks, Conrad Smith et Colin Slade.", "url": "https://www.rugbyrama.fr/rugby/transferts/2018-2019/transferts-pau-smith-prolonge-slade-vers-le-japon_sto7734434/story.shtml", "urlToImage": null, "publishedAt": "2020-04-25T08:27:17Z", "content": "Pour le trois-quarts centre Conrad Smith, qui depuis deux saisons intervient en tant quentraîneur adjoint chargé des trois-quarts aux prérogatives assez large, son contrat a été prolongé pour deux années supplémentaire. Le travail de lavocat de formation est … [+363 chars]"}, {"source": {"id": null, "name": "Welovetennis.fr"}, "author": null, "title": "ATP > Wilander : \"Cette pause est un avantage pour des joueurs comme Roger Federer\" - We Love Tennis !", "description": "Logiquement l’ex-joueur suédois qui est confiné tranquillement aux Etats-Unis a été intérrogé par la très sérieuse agence Reuters sur la récente idée de fusion entre l’ATP et la WTA. Mais aussi sur les conséquences de la situation actuelle au niveau sportif e…", "url": "https://www.welovetennis.fr/atp/wilander-cette-pause-est-un-avantage-pour-des-joueurs-comme-roger-federer", "urlToImage": null, "publishedAt": "2020-04-25T08:18:00Z", "content": "Logiquement l’ex-joueur suédois qui est confiné tranquillement aux Etats-Unis a été intérrogé par la très sérieuse agence Reuters sur la récente idée de fusion entre l’ATP et la WTA. Mais aussi sur les conséquences de la situation actuelle au niveau sportif e… [+531 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Max Franco Sanchez", "title": "Arsenal : les prétendants d'Aubameyang se frottent les mains - Foot Mercato", "description": "Selon la presse britannique, le club de la capitale anglaise pourrait être contraint de vendre son attaquant vedette au rabais lors du prochain mercato.", "url": "https://www.footmercato.net/a8421960661787500460-arsenal-les-pretendants-daubameyang-se-frottent-les-mains", "urlToImage": null, "publishedAt": "2020-04-25T08:16:29Z", "content": "Si la crise financière liée à l'arrêt total du football frappe tous les clubs sans exception, certains sont forcément plus touchés que d'autres. En Espagne par exemple, le Real Madrid semble s'en sortir bien mieux que ses rivaux, le FC Barcelone et l'Atlético… [+2294 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Coronavirus : les joueurs d'Amiens ont été testés vendredi - Foot - Coronavirus - Amiens - L'Équipe.fr", "description": "Les joueurs d'Amiens ont effectué des tests PCR et sérologiques dans le cadre d'une prochaine reprise de l'entraînement.", "url": "https://www.lequipe.fr/Football/Actualites/Coronavirus-les-joueurs-d-amiens-ont-ete-testes-vendredi/1129652", "urlToImage": null, "publishedAt": "2020-04-25T08:07:13Z", "content": "En cours d'élaboration avec la Commission médicale de la FFF et les médecins des clubs professionnels, un protocole prévoit un retour des joueurs au centre d'entraînement la semaine du 11 mai pour effectuer un bilan médical complet (cardiologique, virologique… [+76 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Meunier, destination Tottenham ? / France / PSG / SOFOOT.com - SO FOOT", "description": "Même pas peur du Brexit. Alors que son contrat expire au mois de juin prochain, Thomas Meunier a maintes fois clamé son désir de rester au ...", "url": "https://www.sofoot.com/thomas-meunier-destination-tottenham-pour-le-lateral-du-paris-saint-germain-482646.html", "urlToImage": null, "publishedAt": "2020-04-25T08:00:00Z", "content": "Même pas peur du Brexit. Alors que son contrat expire au mois de juin prochain, Thomas Meunier a maintes fois clamé son désir de rester au PSG. Mais malgré des convoitises d'autres clubs européens, le staff parisien tarde à le prolonger. \r\nAprès le Borussia D… [+445 chars]"}, {"source": {"id": null, "name": "Actufoot.com"}, "author": null, "title": "Patrick Gonzalez (Saint-Priest) : \"Les décisions ont été prises comme au temps des rois !\" - Actufoot", "description": "Des décisions « prises en oligarchie » « Nous n’avons jamais été concertés, les décisions ont été prises en oligarchie comme au temps des rois. La FFF est loin d’être une démocratie. Tous...", "url": "http://www.actufoot.com/33/patrick-gonzalez-saint-priest-decisions-ont-ete-prises-temps-rois", "urlToImage": null, "publishedAt": "2020-04-25T07:56:37Z", "content": "Reléguée en National 3 de manière forcée à neuf journées de la fin du championnat par les décisions du COMEX, l'AS Saint-Priest digère mal la pillule. Alors que club rhodanien n'a été relégable qu'à quatre reprises en 21 matches, il s'estime lésé et pas consi… [+1474 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "A.D.", "title": "Mercato - Barcelone : Vers un nouveau départ du Barça pour Todibo ? - Le 10 Sport", "description": "Au mois de janvier, Schalke 04 a obtenu le prêt avec option d'achat de Jean-Clair Todibo. Alors qu'il n'aurait pas les moyens de payer les 25M€ négociés avec le FC Barcelone, le club allemand…", "url": "https://le10sport.com/football/mercato/mercato-barcelone-un-pretendant-afficherait-sa-confiance-pour-todibo-501046", "urlToImage": null, "publishedAt": "2020-04-25T07:30:00Z", "content": "Foot - Mercato - Barcelone\r\nPublié le 25 avril 2020 à 9h30 par A.D. Au mois de janvier, Schalke 04 a obtenu le prêt avec option d'achat de Jean-Clair Todibo. Alors qu'il n'aurait pas les moyens de payer les 25M négociés avec le FC Barcelone, le club allemand … [+1132 chars]"}, {"source": {"id": null, "name": "Rugbyrama.fr"}, "author": "Rugbyrama", "title": "Coupe d’Europe : les finales le 17 et 18 octobre prochain ? - Rugbyrama.fr", "description": "L’EPCR, l’instance qui organise les Coupe d’Europe de rugby a planché sur un nouveau calendrier de fin de compétition de la saison 2019-2020 à l’automne prochain.", "url": "https://www.rugbyrama.fr/rugby/champions-cup/2019-2020/coupe-deurope-les-finales-le-17-et-18-octobre-prochain_sto7734390/story.shtml", "urlToImage": null, "publishedAt": "2020-04-25T07:03:38Z", "content": "Les quarts de finales pourraient être joués le weekend du 12 et 13 septembre, les demies quinze jours plus tard et les finales (de Challenge Cup et Champions Cup) les 17 et 18 octobre prochain.\r\nCes rencontres étaient programmées initialement le 23 et 23 mai … [+351 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Oriane Alcarini", "title": "Hugo Lloris confiné avec ses trois enfants, \"une source d'évasion\" - Pure People", "description": "Hugo Lloris (33 ans) a raconté son confinement au \"Parisien\", le 23 avril 2020. Le footballeur français dit s'occuper activement de sa petite famille, lui qui est papa d'un tout jeune Léandro (7 mois).", "url": "https://www.purepeople.com/article/hugo-lloris-confine-avec-ses-trois-enfants-une-source-d-evasion_a385670/1", "urlToImage": null, "publishedAt": "2020-04-25T06:45:00Z", "content": "Au cours d'un long entretien accordé au Parisien, Hugo Lloris s'est confié sur son confinement, qu'il vit à Londres et en famille. Le capitaine des Bleus s'agace d'abord de se faire narguer par un merveilleux ciel bleu. \"En huit ans à Londres, je n'ai jamais … [+1611 chars]"}, {"source": {"id": null, "name": "Basketusa.com"}, "author": "Fabrice Auclert", "title": "Draft 2020 : le Français Yves Pons va tester sa cote - BasketUSA", "description": "Meilleur défenseur de sa conférence, l'ailier de Tennessee s'est inscrit à la Draft 2020 mais il se donne la possibilité de faire marche arrière.", "url": "https://www.basketusa.com/news/593880/draft-2020-le-francais-yves-pons-va-tester-sa-cote/", "urlToImage": null, "publishedAt": "2020-04-25T06:40:01Z", "content": "Élu « Defensive Player of the Year » de la SEC, Yves Pons (1m98, 21 ans) annonce à nos confrères d’Envergure qu’il s’est inscrit à la Draft, mais qu’il se laisse la possibilité d’effectuer sa quatrième et dernière année à Tennessee. \r\nEn clair, l’ailier franç… [+376 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "L'UFC annonce une soirée de combats à Jacksonville le 9 mai à huis clos - MMA - UFC - L'Équipe.fr", "description": "L'Ultimate Fighting Championship (UFC) a officiellement annoncé vendredi la tenue de l'UFC 249, le 9 mai prochain dans la Veterans Memorials Arena de Jacksonville. Les combats se dérouleront à huis clos.", "url": "https://www.lequipe.fr/Mma/Actualites/L-ufc-annonce-une-soiree-de-combats-a-jacksonville-le-9-mai-a-huis-clos/1129627", "urlToImage": null, "publishedAt": "2020-04-25T06:30:46Z", "content": "Après plusieurs tentatives infructueuses pour organiser des combats en pleine pandémie de coronavirus, l'UFC, la plus importante ligue professionnelle de MMA, a annoncé vendredi la tenue d'une soirée à huis clos, le 9 mai prochain en Floride. L'UFC 249 se tie… [+1941 chars]"}, {"source": {"id": null, "name": "Nextgen-auto.com"}, "author": "Emmanuel Touzot", "title": "Leclerc : Ce serait bien de courir contre Verstappen en ligne - Nextgen-Auto.com", "description": "Formule 1 | Charles Leclerc court avec six autres pilotes lors des courses officielles virtuelles de la F1, et d'autres devraient rejoindre le groupe, mais (...)", "url": "https://motorsport.nextgen-auto.com/fr/formule-1/leclerc-ce-serait-bien-de-courir-contre-verstappen-en-ligne,148020.html", "urlToImage": null, "publishedAt": "2020-04-25T06:12:00Z", "content": "Charles Leclerc court avec six autres pilotes lors des courses officielles virtuelles de la F1, et d’autres devraient rejoindre le groupe, mais Max Verstappen n’en fera pas partie, bien qu’il soit un aficionado des compétitions en ligne.\r\n\"Je ne sais pas trop… [+1147 chars]"}, {"source": {"id": null, "name": "Paddock-gp.com"}, "author": null, "title": "MotoGP : pour son œuvre globale, Pol Espargaró considère Valentino Rossi comme le plus grand - Media Service", "description": "Pour certains pilotes, quoi qu'il advienne, la messe est dite : Valentino Rossi est le plus grand d'entre tous...", "url": "https://www.paddock-gp.com/motogp-pour-son-oeuvre-globale-pol-espargaro-considere-valentino-rossi-comme-le-plus-grand/", "urlToImage": null, "publishedAt": "2020-04-25T05:03:00Z", "content": "Valentino Rossi nest pas encore à la retraite, mais au vu de ce quil a déjà accompli durant son parcours, on peut dresser un bilan de son uvre. Un exercice qui amène à passer au-delà des statistiques et du palmarès. On considère ici ce que le champion a globa… [+1857 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "Th.B.", "title": "Mercato - Barcelone : Une voie royale pour le Barça avec Timo Werner ? - Le 10 Sport", "description": "Le FC Barcelone penserait à Timo Werner pour renforcer le secteur offensif blaugrana et Liverpool ne serait pas en course pour accueillir le buteur de Leipzig.", "url": "https://le10sport.com/football/mercato/mercato-barcelone-une-voie-royale-pour-le-barca-avec-timo-werner-501022", "urlToImage": null, "publishedAt": "2020-04-24T23:30:00Z", "content": "Foot - Mercato - Barcelone\r\nPublié le 25 avril 2020 à 1h30 par Th.B. Le FC Barcelone penserait à Timo Werner pour renforcer le secteur offensif blaugrana et Liverpool ne serait pas en course pour accueillir le buteur de Leipzig.\r\nEt si le FC Barcelone raflait… [+1261 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Vincent Bregevin", "title": "Le rêve Pogba et l'acolyte de CR7 : A quoi devrait ressembler le mercato de la Juventus ? - Eurosport - FRANCE (FR)", "description": "TRANSFERTS - Le football est à l’arrêt mais le marché des transferts ne cesse de s’agiter, et certains clubs anticipent déjà le prochain mercato d’été.", "url": "https://www.eurosport.fr/football/serie-a/2019-2020/le-reve-pogba-et-l-acolyte-de-cr7-a-quoi-devrait-ressembler-le-mercato-de-la-juventus_sto7732722/story.shtml", "urlToImage": null, "publishedAt": "2020-04-24T22:03:43Z", "content": "TRANSFERTS - Le football est à larrêt mais le marché des transferts ne cesse de sagiter, et certains clubs anticipent déjà le prochain mercato dété. Quid de la Juventus Turin ? La Vieille Dame tente de séduire les meilleurs avant-centres de la planète pour tr… [+5294 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "B.C.", "title": "Mercato - PSG : Leonardo serait fixé sur les plans d'Aulas avec Aouar… - Le 10 Sport", "description": "Alors que le PSG s'intéresse à Houssem Aouar, l'OL ne devrait pas s'opposer au départ de son milieu de terrain, mais il faudra mettre le prix.", "url": "https://le10sport.com/football/mercato/mercato-psg-leonardo-serait-fixe-sur-les-plans-daulas-avec-aouar-501014", "urlToImage": null, "publishedAt": "2020-04-24T21:45:00Z", "content": "Publié le 24 avril 2020 à 23h45 par B.C. Alors que le PSG s'intéresse à Houssem Aouar, l'OL ne devrait pas s'opposer au départ de son milieu de terrain, mais il faudra mettre le prix.\r\nComme annoncé par le 10 Sport dès janvier, le PSG s'intéresse de près à Ho… [+799 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "De nouvelles mesures économiques en faveur du sport - Tous sports - L'Équipe.fr", "description": "A l'issue d'une réunion avec d'autres ministres et divers acteurs du sport, ce vendredi, Roxana Maracineanu a annoncé de nouvelles mesures d'accompagnement pour le secteur.", "url": "https://www.lequipe.fr/Tous-sports/Actualites/De-nouvelles-mesures-economiques-en-faveur-du-sport/1129608", "urlToImage": null, "publishedAt": "2020-04-24T21:27:04Z", "content": "Alors que les inquiétudes se sont renforcées ces derniers jours face à la crise économique générée par l'épidémie de Covid-19, la ministre des Sports Roxana Maracineanu a annoncé dans un tweet, ce vendredi soir, de nouvelles mesures d'accompagnement du secteu… [+577 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Suède : Zlatan Ibrahimovic marque avec Hammarby en amical - Foot - SUE - L'Équipe.fr", "description": "L'attaquant, qui s'entraîne en Suède avec Hammarby, un club dont il possède des parts, a inscrit un but en amical.", "url": "https://www.lequipe.fr/Football/Actualites/Suede-zlatan-ibrahimovic-marque-avec-hammarby-en-amical/1129591", "urlToImage": null, "publishedAt": "2020-04-24T20:42:22Z", "content": "Aujourd'hui, l'attaquant a d'ailleurs participé à une triangulaire amicale avec deux autres équipes locales, Bajans et IK Frej. Durant ces oppositions, l'attaquant de 38 ans est même parvenu à inscrire un but. Ibrahimovic s'est dit très heureux de pouvoir s'e… [+113 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "Equipe de France: Le malaise Gourcuff-Ribéry raconté de l'intérieur - RMC Sport", "description": "L'histoire de Yoann Gourcuff en équipe de France a notamment été marquée par sa relation houleuse avec Franck Ribéry. Des rapports tendus sur lesquels s'est exprimé François Manardo, ancien chef de presse des Bleus, dans l'émission Rothen Régale ce vendredi.", "url": "https://rmcsport.bfmtv.com/football/equipe-de-france-le-malaise-gourcuff-ribery-raconte-de-l-interieur-1900414.html", "urlToImage": null, "publishedAt": "2020-04-24T20:21:15Z", "content": null}, {"source": {"id": null, "name": "Topmercato.com"}, "author": null, "title": "Rennes : Camavinga retenu à tout prix si... - Top Mercato.com", "description": "Alors que le Real Madrid prépare son offensive pour Eduardo Camavinga et serait prêt à mettre 60 millions d'euros sur l...", "url": "http://www.topmercato.com/219572,1/rennes---camavinga-retenu-a-tout-prix-si---.html", "urlToImage": null, "publishedAt": "2020-04-24T18:02:00Z", "content": "Article lu 2550 fois - Rédigé le 24 avril 2020 à 20h02 par Romain Boselli"}, {"source": {"id": null, "name": "Intensite.net"}, "author": null, "title": "EURE-ET-LOIR - Des excès de vitesse sur les routes euréliennes - Radio Intensité", "description": "Un automobiliste contrôlé en excès de vitesse ce vendredi après-midi à Friaize près de Champrond-en-Gâtine. L'homme, un habitant de la Seine-Saint-Denis, roulait à 160 km/h au lieu des 80 km/h régleme", "url": "https://intensite.net/2009/actu2020/eure-et-loir-des-exces-de-vitesse-sur-les-routes-eureliennes-314434", "urlToImage": null, "publishedAt": "2020-04-24T16:23:13Z", "content": "Pour adresser à Radio Intensité, un communiqué, un commentaire, une précision, ou une info, merci d'utiliser notre formulaire : ICI. ou adressez un mail à redaction@intensite.net.\r\nPour figurer dans notre agenda en ligne gratuitement, il suffit de nous adress… [+197 chars]"}, {"source": {"id": null, "name": "Footamateur.fr"}, "author": "Jérome Bouchacourt", "title": "La communication bancale de la DNCG aux clubs de National 2 - FootAmateur", "description": "Ce jeudi, les clubs de National 2 ont reçu un courrier de la FFF concernant le contrôle des clubs. Ce qui ne manque pas d'interroger sur la démarche.", "url": "https://www.footamateur.fr/la-communication-bancale-de-la-la-dncg-aux-clubs-de-national-2/", "urlToImage": null, "publishedAt": "2020-04-24T15:57:00Z", "content": "Ce jeudi, les clubs de National 2 ont reçu un courrier de la FFF concernant le contrôle des clubs.\r\n« La situation sanitaire actuelle liée au COVID 19 affecte profondément notre société, la Commission Fédérale de Contrôle des Clubs de la D.N.C.G. reste consci… [+2595 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "H.G.", "title": "Mercato - PSG : Bartomeu voudrait réaliser un grand rêve avec Neymar ! - Le 10 Sport", "description": "Alors que le FC Barcelone est annoncé avec insistance sur les traces de Lautaro Martinez, Josep Maria Bartomeu serait prêt à laisser tomber la piste menant à l’attaquant argentin dans le but…", "url": "https://le10sport.com/football/mercato/mercato-psg-bartomeu-pret-a-abandonner-lautaro-martinez-pour-neymar-500978", "urlToImage": null, "publishedAt": "2020-04-24T15:45:00Z", "content": "Publié le 24 avril 2020 à 17h45 par H.G. Alors que le FC Barcelone est annoncé avec insistance sur les traces de Lautaro Martinez, Josep Maria Bartomeu serait prêt à laisser tomber la piste menant à lattaquant argentin dans le but darracher Neymar au PSG.\r\nEn… [+1473 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Bundesliga : appel aux footballeurs pour qu'ils portent des masques en cas de reprise - Eurosport - FRANCE (FR)", "description": "BUNDESLIGA - Le gouvernement allemand souhaiterait que les joueurs portent des masques en cas de reprise des championnats", "url": "https://www.eurosport.fr/football/bundesliga/2019-2020/budesliga-appel-aux-footballeurs-pour-qu-ils-portent-des-masques-en-cas-de-reprise_sto7734092/story.shtml", "urlToImage": null, "publishedAt": "2020-04-24T15:22:48Z", "content": "BUNDESLIGA - Le ministère allemand du travail souhaite que les footballeurs portent des masques pour se protéger contre le coronavirus si le gouvernement d'Angela Merkel autorise une reprise des championnats en mai comme la Ligue le désire.\r\nLa Ligue allemand… [+2637 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Didier Lacroix (Stade Toulousain) : « Incroyable de reprendre par des phases finales » - Rugby - Top 14 - ST - L'Équipe.fr", "description": "Dans un rendez-vous fixé en ligne aux supporters du Stade Toulousain, le président Didier Lacroix a abordé plusieurs sujets, de la suite du Top 14 aux finances du club en passant par une harmonisation des calendriers.", "url": "https://www.lequipe.fr/Rugby/Actualites/Didier-lacroix-stade-toulousain-incroyable-de-reprendre-par-des-phases-finales/1129476", "urlToImage": null, "publishedAt": "2020-04-24T15:15:16Z", "content": "« Le Stade Toulousain s'acheminait avant l'épisode Covid vers une situation à l'équilibre après des périodes difficiles. Les performances sportives, l'assiduité des supporters, la bonne tenue de nos organisations commerciales (brasserie, boutiques etc.)... To… [+342 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/marc.alvarez1", "title": "Maguire : “La Champions League 19/20 reprendra sous une forme ou une autre” - Canal Supporters", "description": "Les enjeux sont trop importants pour que l'UEFA tire un trait sur la Ligue des champions 2019/2020. Tout sera fait, qu'importe le calendrier,", "url": "https://canal-supporters.com/2020/04/maguire-la-champions-league-19-20-reprendra-sous-une-forme-ou-une-autre/", "urlToImage": null, "publishedAt": "2020-04-24T14:54:14Z", "content": "Les enjeux sont trop importants pour que l’UEFA tire un trait sur la Ligue des champions 2019/2020. Tout sera fait, qu’importe le calendrier, pour que la compétition continentale suspendue depuis la mi-mars aille à son terme. Le spécialiste de l’économie du f… [+1420 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Ligue des champions : La Fédération européenne qualifie directement le PSG pour le Final Four - Eurosport - FRANCE (FR)", "description": "Dans l'incapacité de jouer les huitièmes et quarts de la compétition, la Fédération européenne de handball a décidé de qualifier directement quatre équipes.", "url": "https://www.eurosport.fr/handball/ligue-des-champions/2019-2020/ligue-des-champions-la-federation-europeenne-qualifie-directement-le-psg-pour-le-final-four_sto7734057/story.shtml", "urlToImage": null, "publishedAt": "2020-04-24T14:43:59Z", "content": "Voilà une décision de la Fédération européenne de handball qui ne devrait pas plaire à toutes les équipes encore engagées en Ligue des champions. Dans la un communiqué, la Fédération a décidé d'annuler les huitièmes et quarts de finale de la compétition pour … [+769 chars]"}, {"source": {"id": null, "name": "Madeinfoot.com"}, "author": null, "title": "Mercato - Le FC Barcelone propose deux joueurs en échange de Tanguy Ndombele - madeinfoot.com", "description": "Très porté sur les échanges de joueurs, le FC Barcelone a proposé deux de...", "url": "http://www.madeinfoot.com/infos/article-mercato-le-fc-barcelone-propose-deux-joueurs-en-echange-de-tanguy-ndombele-309466.html", "urlToImage": null, "publishedAt": "2020-04-24T13:49:22Z", "content": null}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "TV : Marina Lorenzo, la dernière cible de Mediapro - Foot01.com", "description": "Impossible de savoir pour le moment quand la prochaine saison de football démarrera, sachant que l’exercice actuel est à l’arrêt complet. Une situation inédite qui ne semble pas déranger Mediapro, le futur détenteur des droits TV en France pour la Ligue…", "url": "https://www.foot01.com/info/tv-marina-lorenzo-la-derniere-cible-de-mediapro,347875", "urlToImage": null, "publishedAt": "2020-04-24T10:28:58Z", "content": "Impossible de savoir pour le moment quand la prochaine saison de football démarrera, sachant que lexercice actuel est à larrêt complet. Une situation inédite qui ne semble pas déranger Mediapro, le futur détenteur des droits TV en France pour la Ligue 1 et la… [+903 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "Gil Bousquet @Gil_Bousquet", "title": "Top 14 : éviter le scénario du pire - LaDepeche.fr", "description": "Le rugby professionnel est tétanisé par la crise sanitaire. Aucun scénario de sortie de crise stabilisé n’émerge. Les clubs s’inquiètent des conséquences économiques qui pourraient être délétères.", "url": "https://www.ladepeche.fr/2020/04/24/top-14-eviter-le-scenario-du-pire,8860476.php", "urlToImage": null, "publishedAt": "2020-04-24T05:39:11Z", "content": "l'essentiel\r\n Le rugby professionnel est tétanisé par la crise sanitaire. Aucun scénario de sortie de crise stabilisé némerge. Les clubs sinquiètent des conséquences économiques qui pourraient être délétères.\r\n Le chemin de la reprise des matchs de rugby sera… [+4208 chars]"}, {"source": {"id": null, "name": "Welovetennis.fr"}, "author": null, "title": "Roland Garros > Roland Garros sera décalé d'une semaine - We Love Tennis !", "description": "Nous pouvons vous confirmer l’information du Parisien selon laquelle le tournoi de Roland-Garros sera décalé d’une semaine par rapport à la première date évoquée. Les Internationaux de France débuteront donc le 28 septembre pour finir le 11 Octobre. Le 28 est…", "url": "https://www.welovetennis.fr/roland-garros/roland-garros-sera-decale-dune-semaine", "urlToImage": null, "publishedAt": "2020-04-23T23:54:00Z", "content": "Nous pouvons vous confirmer l’information du Parisien selon laquelle le tournoi de Roland-Garros sera décalé d’une semaine par rapport à la première date évoquée. Les Internationaux de France débuteront donc le 28 septembre pour finir le 11 Octobre. Le 28 est… [+750 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "J.-G.D.", "title": "Mercato - ASSE : La mise au point de cette pépite de Puel sur son avenir ! - Le 10 Sport", "description": "Récemment prolongé par l’ASSE, Wesley Fofana, formé dans le Forez, ne cache pas son bien-être chez les Verts.", "url": "https://le10sport.com/football/mercato/mercato-asse-la-mise-au-point-de-cette-pepite-de-puel-sur-son-avenir-500878", "urlToImage": null, "publishedAt": "2020-04-23T20:30:00Z", "content": "Publié le 23 avril 2020 à 22h30 par J.-G.D. Récemment prolongé par lASSE, Wesley Fofana, formé dans le Forez, ne cache pas son bien-être chez les Verts.\r\nComme vous lindique Le 10 Sport en exclusivité, lASSE va sonder le marché des transferts afin de trouver … [+1283 chars]"}]}