{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Footballclubdemarseille.fr"}, "author": "La Redaction FC Marseille", "title": "Mercato OM : Thauvin met les choses au clair concernant son avenir ! - Football Club de Marseille", "description": "Ce samedi soir, Florian Thauvin était en live sur son compte Instagram avec Malik Bentalha. L'ailier de l'OM a", "url": "https://www.footballclubdemarseille.fr/om-fil-info/mercato-om-thauvin-met-les-choses-au-clair-concernant-son-avenir.html", "urlToImage": null, "publishedAt": "2020-04-26T03:10:26Z", "content": "Ce samedi soir, Florian Thauvin était en live sur son compte Instagram avec Malik Bentalha. L’ailier de l’OM a affirmé qu’il resterait à Marseille !\r\nAprès toutes les rumeurs venant d’Italie affirmant qu’il était proche de l’AS Roma, Florian Thauvin a décidé … [+883 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Des tensions entre Mbappé et le PSG ? - Sports.fr", "description": "Les dernières manigances des dirigeants parisiens n’auraient pas été du goût de Kylian Mbappé. Si confinement oblige, les joueurs parisiens sont au chômage technique, obligés de se contenter de séances individuelles à leur domicile, leurs dirigeants du PSG ne…", "url": "https://www.sports.fr/football/tensions-entre-mbappe-psg-349660.html", "urlToImage": null, "publishedAt": "2020-04-26T03:00:27Z", "content": "Les dernières manigances des dirigeants parisiens nauraient pas été du goût de Kylian Mbappé.\r\nSi confinement oblige, les joueurs parisiens sont au chômage technique, obligés de se contenter de séances individuelles à leur domicile, leurs dirigeants du PSG ne… [+1469 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "A.M.", "title": "Mercato - ASSE : Claude Puel a une stratégie très claire pour le mercato ! - Le 10 Sport", "description": "Bien que le mercato estival s'annonce particulièrement compliqué pour l'AS Saint-Etienne, Claude Puel ne change pas ses plans et a bien misé sur un rajeunissement de son effectif. Les dernières…", "url": "https://le10sport.com/football/mercato/mercato-asse-claude-puel-a-une-strategie-tres-claire-pour-le-mercato-501107", "urlToImage": null, "publishedAt": "2020-04-26T02:00:00Z", "content": "Publié le 26 avril 2020 à 4h00 par A.M. Bien que le mercato estival s'annonce particulièrement compliqué pour l'AS Saint-Etienne, Claude Puel ne change pas ses plans et a bien misé sur un rajeunissement de son effectif. Les dernières manuvres des Verts confir… [+1793 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "G.d.S.S.", "title": "Mercato - Real Madrid : Zidane tente un énorme pari avec un gardien français ! - Le 10 Sport", "description": "Zinedine Zidane pourrait essayer un coup très surprenant l’été prochain au Real Madrid en tentant d’attirer… Alban Lafont !", "url": "https://le10sport.com/football/mercato/mercato-real-madrid-zidane-tente-un-enorme-pari-avec-un-gardien-francais-501157", "urlToImage": null, "publishedAt": "2020-04-26T00:45:00Z", "content": "Foot - Mercato - Real Madrid\r\nPublié le 26 avril 2020 à 2h45 par G.d.S.S. Zinedine Zidane pourrait essayer un coup très surprenant lété prochain au Real Madrid en tentant dattirer Alban Lafont !\r\nPrêté par le PSG depuis lété dernier, Alphonse Areola ne sait p… [+732 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "G.d.S.S.", "title": "Mercato - PSG : Un dossier brûlant de Leonardo est en bonne voie ! - Le 10 Sport", "description": "Le PSG a entamé les démarches pour finalement prolonger Thiago Silva, et le défenseur brésilien fait du club de la capitale sa grande priorité.", "url": "https://le10sport.com/football/mercato/mercato-psg-un-dossier-brulant-de-leonardo-est-en-bonne-voie-501153", "urlToImage": null, "publishedAt": "2020-04-26T00:00:00Z", "content": "Publié le 26 avril 2020 à 2h00 par G.d.S.S. Le PSG a entamé les démarches pour finalement prolonger Thiago Silva, et le défenseur brésilien fait du club de la capitale sa grande priorité.\r\nComme Le 10 Sport vous la révélé en exclusivité mi-avril, le PSG a fin… [+1112 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "J.-G.D.", "title": "Mercato - Real Madrid : Zidane aurait trouvé sa nouvelle pépite ! - Le 10 Sport", "description": "Toujours à l’affût afin de dénicher des talents sud-américains, le Real Madrid aurait jeté son dévolu sur le profil de Facundo Pellistri, jeune joueur uruguayen de 18 ans.", "url": "https://le10sport.com/football/mercato/mercato-real-madrid-zidane-aurait-trouve-sa-nouvelle-pepite-501121", "urlToImage": null, "publishedAt": "2020-04-25T22:30:00Z", "content": "Foot - Mercato - Real Madrid\r\nPublié le 26 avril 2020 à 0h30 par J.-G.D. Toujours à laffût afin de dénicher des talents sud-américains, le Real Madrid aurait jeté son dévolu sur le profil de Facundo Pellistri, jeune joueur uruguayen de 18 ans.\r\nEntre Vinicius… [+1012 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "Mbappé, Haaland, nouveau Bernabeu... le Real aurait un plan XXL pour 2022 - RMC Sport", "description": "Marca rapporte que le Real Madrid a pour ambition de constituer une nouvelle équipe de Galactiques pour l'année 2022, en parallèle de la livraison de la rénovation de son stade Santiago-Bernabéu. Parmi les noms cités, ceux de Mbappé et Haaland.", "url": "https://rmcsport.bfmtv.com/football/mbappe-haaland-nouveau-bernabeu-le-real-aurait-un-plan-xxl-pour-2022-1901073.html", "urlToImage": null, "publishedAt": "2020-04-25T21:08:19Z", "content": null}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "WTF : Charles Leclerc (Ferrari) pilote déguisé en banane - F1 - WTF - L'Équipe.fr", "description": "Le pilote Ferrari Charles Leclerc (22 ans) s'est montré aux fans sur sa chaîne Twitch, un service de streaming de jeux vidéo, en costume de banane", "url": "https://www.lequipe.fr/Formule-1/Actualites/Wtf-charles-leclerc-ferrari-pilote-deguise-en-banane/1129798", "urlToImage": null, "publishedAt": "2020-04-25T21:06:15Z", "content": "Durant cette pause forcée due à la pandémie, le pilote Ferrari Charles Leclerc, 22 ans, s'est engagé dans l'esport et transfère temporairement ses compétences de pilote sur circuit virtuel. Le Monégasque a déjà enregistré quatre victoires pour son écurie."}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Jean-Sébastien Grond", "title": "La bombe lâchée par l’ex-agent de Neymar - Sports.fr", "description": "Selon Wagner Ribeiro, qui conseillait Neymar il y a quelques années, le président du Real Madrid Florentino Pérez rêve depuis toujours du prodige brésilien… Voilà de quoi perturber la presse madrilène ! Alors qu’As et Marca s’accordent à dire que le Real Madr…", "url": "https://www.sports.fr/football/bombe-lachee-lex-agent-de-neymar-349622.html", "urlToImage": null, "publishedAt": "2020-04-25T20:55:23Z", "content": "Selon Wagner Ribeiro, qui conseillait Neymar il y a quelques années, le président du Real Madrid Florentino Pérez rêve depuis toujours du prodige brésilien\r\nVoilà de quoi perturber la presse madrilène ! Alors quAs et Marca saccordent à dire que le Real Madrid… [+954 chars]"}, {"source": {"id": null, "name": "Lesviolets.com"}, "author": "https://facebook.com/lesvioletscom/", "title": "Vente du TFC : Sadran recule, les possibles repreneurs dans l'incertitude, mais toujours intéressés - LesViolets.Com", "description": "D&eacute;but mars, Olivier Sadran et un consortium d'investisseurs sino-am&eacute;ricains avaient sign&eacute; un accord de n&eacute;gociations exclusives de 45 jours...", "url": "https://www.lesviolets.com/actu/vente-du-tfc-sadran-recule-les-possibles-repreneurs-dans-l-incertitude-mais-toujours-interesses,53413.html", "urlToImage": null, "publishedAt": "2020-04-25T20:49:00Z", "content": "Début mars, Olivier Sadran et un consortium d'investisseurs sino-américains avaient signé un accord de négociations exclusives de 45 jours concernant une possible vente du TFC. L'Equipe annonce ce soir que le président toulousain et les potentiels repreneurs … [+1350 chars]"}, {"source": {"id": null, "name": "Foot-sur7.fr"}, "author": "FOOT-SUR7.fr", "title": "Juventus Mercato : Départ de Ronaldo, le rebondissement - Foot Sur 7", "description": "Avec la crise financière, des sources en Italie annoncent que la Juventus pourrait se débarrasser de Cristiano Ronaldo. Mais Tuttosport apporte un démenti formel face à cette rumeur. Pour le journal, le Portugais ne sera pas sacrifié par le club", "url": "https://www.foot-sur7.fr/445676-juventus-annonce-pour-cristiano-ronaldo", "urlToImage": null, "publishedAt": "2020-04-25T20:34:09Z", "content": "Avec la crise financière, des sources en Italie annoncent que la Juventus pourrait se débarrasser de Cristiano Ronaldo. Mais Tuttosport apporte un démenti formel face à cette rumeur. Pour le journal, le Portugais ne sera pas sacrifié par le club turinois.\r\nLa… [+1129 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "La rédaction", "title": "Mercato - Barcelone : Un cador européen s’attaque à un cadre du Barça ! - Le 10 Sport", "description": "Alors que Sergi Roberto aurait été placé sur la liste des transferts, la Juventus se serait renseignée pour le milieu de terrain et latéral droit du FC Barcelone.", "url": "https://le10sport.com/football/mercato/mercato-barcelone-sergi-roberto-dans-le-viseur-de-la-juventus-501095", "urlToImage": null, "publishedAt": "2020-04-25T20:30:00Z", "content": "Foot - Mercato - Barcelone\r\nPublié le 25 avril 2020 à 22h30 par La rédaction Alors que Sergi Roberto aurait été placé sur la liste des transferts, la Juventus se serait renseignée pour le milieu de terrain et latéral droit du FC Barcelone.\r\nIl aura fait faire… [+1074 chars]"}, {"source": {"id": null, "name": "Football365.fr"}, "author": "Rédaction", "title": "Et si Cavani restait au PSG ? - Football365", "description": "Edinson Cavani se verrait finalement bien rester au PSG encore un peu plus alors que son contrat parisien expire le 30 juin prochain.", "url": "https://www.football365.fr/cavani-restait-psg-9821753.html", "urlToImage": null, "publishedAt": "2020-04-25T20:22:24Z", "content": "L’Equipe avance l’hypothèse selon laquelle Edinson Cavani ne quitterait pas le PSG cet été. Pourtant, le Matador était sur le point de s’engager à l’Atlético Madrid en janvier dernier et n’a pas reçu depuis de proposition concrète de la part de Paris pour pro… [+756 chars]"}, {"source": {"id": null, "name": "Francefootball.fr"}, "author": "Nabil Djellit", "title": "Mercato : Dries Mertens a l'embarras du choix - France Football", "description": "A moins d'une prolongation surprise avec Naples, Dries Mertens, en fin de contrat, devrait relever un nouveau challenge la saison prochaine. Le Belge est très sollicité.  En Ligue 1, Monaco est intéressé et doit faire face à la concurrence de l'Inter Milan, C…", "url": "https://www.francefootball.fr/news/Mercato-dries-mertens-a-l-embarras-du-choix/1129717", "urlToImage": null, "publishedAt": "2020-04-25T20:10:17Z", "content": "A moins d'une prolongation surprise avec Naples, Dries Mertens, en fin de contrat, devrait relever un nouveau challenge la saison prochaine. Le Belge est très sollicité. En Ligue 1, Monaco est intéressé et doit faire face à la concurrence de l'Inter Milan, Ch… [+2110 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Benjamin Lecomte (Monaco) : « J'envoie ma force et mon courage à Junior Sambia » - Foot - Coronavirus - L'Équipe.fr", "description": "Lors d'un live Instagram avec le journaliste de « L'Équipe » Hugo Guillemet, le gardien de but monégasque a tenu à témoigner son soutien à son ancien coéquipier Junior Sambia, touché par le coronavirus.", "url": "https://www.lequipe.fr/Football/Actualites/Benjamin-lecomte-monaco-j-envoie-ma-force-et-mon-courage-a-junior-sambia/1129790", "urlToImage": null, "publishedAt": "2020-04-25T20:09:27Z", "content": "Benjamin Lecomte (Monaco) : « Je voudrais envoyer toute ma force et mon courage à Junior (Sambia) et à ses proches, et lui dire que je le soutiens. Cela fait toujours bizarre quand c'est un joueur avec qui l'on a joué qui attrape le coronavirus et qui est hos… [+222 chars]"}, {"source": {"id": null, "name": "Foot-national.com"}, "author": "foot-national.com", "title": "Saint-Etienne : Les supporters en colère contre la proposition de Le Graët - Foot National", "description": "Les supporters de l'ASSE ont réagi vivement à la proposition de No&eu", "url": "http://www.foot-national.com/foot-saint-etienne-les-supporters-en-colere-contre-la-proposition-de-le-graet-132747.html", "urlToImage": null, "publishedAt": "2020-04-25T20:01:51Z", "content": "samedi 25 avril 2020 à 22:00 -Article écrit par La Rédaction - Réagir à cet article\r\n + DE LIENS :|Compétition \u009bCoupe de France |\r\nLes supporters de l'ASSE ont réagi vivement à la proposition de Noël Le Graët de reprendre la saison par la finale de la Coupe d… [+2053 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Coronavirus : le centre d'entraînement d'Arsenal rouvre la semaine prochaine - Foot - ANG - Arsenal - L'Équipe.fr", "description": "Les Gunners ont annoncé que le centre d'entraînement du club allait à nouveau pouvoir accueillir des joueurs, même s'ils ne pourront pas se croiser.", "url": "https://www.lequipe.fr/Football/Actualites/Coronavirus-le-centre-d-entrainement-d-arsenal-rouvre-la-semaine-prochaine/1129787", "urlToImage": null, "publishedAt": "2020-04-25T19:55:25Z", "content": "Les joueurs d'Arsenal seront autorisés à retourner sur leur terrain d'entraînement à partir de la semaine prochaine, a annoncé ce samedi le club anglais, soulignant que cela se fera dans un strict respect des directives sanitaires visant à lutter contre la pr… [+757 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "B.C.", "title": "Mercato - OM : Cabella se prononce sur un retour à Marseille ! - Le 10 Sport", "description": "S'il se réjouit d'avoir porté les couleurs de l'OM durant sa carrière, Rémy Cabella estime qu'il est difficile d'envisager un retour à Marseille.", "url": "https://le10sport.com/football/mercato/mercato-om-cabella-se-prononce-sur-un-retour-a-marseille-501139", "urlToImage": null, "publishedAt": "2020-04-25T19:30:00Z", "content": "Publié le 25 avril 2020 à 21h30 par B.C. S'il se réjouit d'avoir porté les couleurs de l'OM durant sa carrière, Rémy Cabella estime qu'il est difficile d'envisager un retour à Marseille.\r\nRecruté par l'OM en 2015, Rémy Cabella espérait surement mieux pour son… [+994 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Diogo Jota (Wolverhampton) gagne la finale du tournoi de FIFA 20 organisé en Premier League - Foot - ANG - L'Équipe.fr", "description": "L'attaquant de Wolverhampton a remporté le tournoi virtuel de FIFA 20, organisé en Premier League pour trouver des fonds dans la lutte contre le coronavirus.", "url": "https://www.lequipe.fr/Football/Actualites/Diogo-jota-wolverhampton-gagne-la-finale-du-tournoi-de-fifa-20-organise-en-premier-league/1129780", "urlToImage": null, "publishedAt": "2020-04-25T19:19:41Z", "content": "Chaque club était représenté par un joueur et l'attaquant de Wolverhampton Diogo Jota a gagné la finale ce samedi contre le latéral de Liverpool Trent Alexander-Arnold. L'international anglais avait battu Raheem Sterling, son compatriote de Manchester City, e… [+14 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "OL : Mohamed Bouhafsi fan d'Aulas « le génie du foot » - Foot01.com", "description": "A l'heure où les critiques sont souvent virulentes à son encontre, Jean-Michel Aulas peut compter sur un fan revendiqué au sein des médias.\r\nHabile en communication, Jean-Michel Aulas est capable de découper en morceaux L’Equipe via Twitter, puis le lendemain…", "url": "https://www.foot01.com/equipe/ol/ol-mohamed-bouhafsi-fan-d-aulas-le-genie-du-foot,347975", "urlToImage": null, "publishedAt": "2020-04-25T19:04:56Z", "content": "A l'heure où les critiques sont souvent virulentes à son encontre, Jean-Michel Aulas peut compter sur un fan revendiqué au sein des médias.\r\nHabile en communication, Jean-Michel Aulas est capable de découper en morceaux LEquipe via Twitter, puis le lendemain … [+1242 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Le «peuple vert» au soutien de Robert Herbin - Le Figaro", "description": "Depuis l'annonce vendredi après-midi de l'hospitalisation de Robert Herbin à Saint-Étienne dans un état jugé préoccupant, les messages de soutien affluent.", "url": "https://sport24.lefigaro.fr/football/ligue-1/actualites/le-peuple-vert-au-soutien-de-robert-herbin-1000317", "urlToImage": null, "publishedAt": "2020-04-25T18:43:00Z", "content": "Depuis l'annonce vendredi après-midi de l'hospitalisation de Robert Herbin à Saint-Étienne dans un état jugé préoccupant, les messages de soutien affluent.Hospitalisé depuis mardi au CHU de l'hôpital nord dans un état jugé préoccupant, lentraîneur de la grand… [+1358 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Coronavirus : les joueurs d'Amiens ont été testés - SO FOOT", "description": "Ils vont savoir. En France, les tests de dépistage du Covid-19 restent réservés aux personnes présentant des symptômes. Pas au Amiens SC. ...", "url": "https://www.sofoot.com/coronavirus-les-joueurs-d-amiens-ont-ete-testes-482676.html", "urlToImage": null, "publishedAt": "2020-04-25T17:25:00Z", "content": "Ils vont savoir.En France, les tests de dépistage du Covid-19 restent réservés aux personnes présentant des symptômes. Pas au Amiens SC. Déterminé à reprendre l'entraînement dès le 11 mai, le club de Picardie a trouvé le moyen de faire passer ces fameux tests… [+896 chars]"}, {"source": {"id": null, "name": "Maxifoot.fr"}, "author": null, "title": "Mercato : le Barça a proposé deux joueurs pour Ndombélé ! - Maxifoot", "description": "Intéressé par le milieu de terrain de Tottenham Tanguy Ndombélé, le FC Barcelone a proposé le défenseur central Samuel ...", "url": "http://www.maxifoot.fr/football/article-43528.htm", "urlToImage": null, "publishedAt": "2020-04-25T17:00:00Z", "content": "Intéressé par le milieu de terrain de Tottenham Tanguy Ndombélé, le FC Barcelone a proposé le défenseur central Samuel Umtiti et le latéral droit Nelson Semedo au club londonien. Le signe de l'intérêt concret des Blaugrana pour l'ancien Amiénois.\r\nIl ne s'agi… [+1952 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Premier League : Les joueurs de Chelsea conservent l'intégralité de leurs salaires - Eurosport - FRANCE (FR)", "description": "PREMIER LEAGUE - Dans un communiqué publié samedi, Chelsea a annoncé que ses joueurs n'allaient pas subir de baisse de salaire en lien avec le Covid 19.", "url": "https://www.eurosport.fr/football/premier-league/2019-2020/premier-league-les-joueurs-de-chelsea-conservent-l-integralite-de-leurs-salaires_sto7734824/story.shtml", "urlToImage": null, "publishedAt": "2020-04-25T16:55:14Z", "content": "Si leurs voisins d'Arsenal ont récemment accepté de baisser leurs salaires de 12,5%, ce n'est pas la voie qu'ont décidé de prendre les joueurs de Chelsea. Dans un communiqué publié samedi, le club londonnien a fait un point sur une éventuelle réduction de sal… [+1035 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "F.H. avec AFP", "title": "Chelsea a levé l’option pour prolonger Olivier Giroud d’un an - 20 Minutes", "description": "L’attaquant de l’équipe de France débutera-t-il le championnat anglais sur le banc comme lors de la saison 2019-2020 ?", "url": "https://www.20minutes.fr/sport/2767667-20200425-chelsea-leve-option-prolonger-olivier-giroud-an", "urlToImage": null, "publishedAt": "2020-04-25T16:50:45Z", "content": "Olivier Giroud. (Illustration) Mark Greenwood/IPS/REX/SIPA\r\nQuel rôle va lui donner Frank Lampard ? Titulaire ou remplaçant ? Chelsea a levé loption pour prolonger dun an \r\nOlivier Giroud, annonce l'AFP. Lattaquant de \r\nl'équipe de France est lié au club lond… [+741 chars]"}, {"source": {"id": null, "name": "Www.lci.fr"}, "author": "La rédaction de LCI", "title": "Coronavirus : vers une reprise de la Premier League le 8 juin ? - LCI", "description": "HYPOTHÈSE - Ce samedi, le Times indique que les instances du football anglais envisagent une reprise de la Premier League le 8 juin prochain, le tout à huis clos, avec des mesures sanitaires strictes. L'objectif est de finir la saison le 27 juillet, pour lais…", "url": "https://www.lci.fr/football/coronavirus-vers-une-reprise-de-la-premier-league-le-8-juin-2152038.html", "urlToImage": null, "publishedAt": "2020-04-25T16:42:14Z", "content": "Suspendue depuis le 13 mars dernier en raison de l'épidémie de Covid-19, la Premier League anglaise pourrait reprendre le 8 juin prochain, affirme le Times ce samedi. Selon le journal britannique, les instances du football anglais ainsi que d'autres sports on… [+1464 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "ASSE : Romeyer refuse une finale sans les supporters stéphanois - Foot01.com", "description": "Prenant une position inverse à Bernard Caïazzo, Roland Romeyer refuse de voir la finale de Coupe de France entre l'ASSE et le PSG se disputer à huis clos.\r\nEntre Roland Romeyer et Bernard Caïazzo, il y a de l’eau dans le gaz. Et même si les deux présidents…", "url": "https://www.foot01.com/equipe/st-etienne/asse-romeyer-refuse-une-finale-sans-les-supporters-stephanois,347957", "urlToImage": null, "publishedAt": "2020-04-25T16:37:13Z", "content": "Prenant une position inverse à Bernard Caïazzo, Roland Romeyer refuse de voir la finale de Coupe de France entre l'ASSE et le PSG se disputer à huis clos.\r\nEntre Roland Romeyer et Bernard Caïazzo, il y a de leau dans le gaz. Et même si les deux présidents de … [+1391 chars]"}, {"source": {"id": null, "name": "Paddock-gp.com"}, "author": null, "title": "MotoGP : Pol Espargaró et les hooligans de Valentino Rossi - Media Service", "description": "Pol Espargaro a-t-il appuyé où ça fait mal concernant Valentino Rossi ?", "url": "https://www.paddock-gp.com/motogp-pol-espargaro-et-les-hooligans-de-valentino-rossi/", "urlToImage": null, "publishedAt": "2020-04-25T16:33:00Z", "content": "Dans un entretien débridé entre les quatre murs dun domicile dans lequel le Coronavirus lassigne, Pol Espargaró a déconfiné un sujet sensible : celui des supporters de Valentino Rossi. Ils sont nombreux, ils sont bruyants, mais sont-ils tous bon-enfant ? Depu… [+1737 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "PSG-Dortmund: Kehrer calme le jeu après le chambrage d'Haaland - RMC Sport", "description": "Dans la presse allemande, Thilo Kehrer est revenu sur les célébrations moqueuses du PSG vis-à-vis du Borussia Dortmund lors du huitième de finale retour de Ligue des champions au Parc des Princes (2-0). Le jeune latéral droit assure qu'il n'y a de tensions.", "url": "https://rmcsport.bfmtv.com/football/psg-dortmund-kehrer-calme-le-jeu-apres-le-chambrage-d-haaland-1900847.html", "urlToImage": null, "publishedAt": "2020-04-25T16:23:10Z", "content": null}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Le Barça serait prêt à sécher la possible reprise de la Liga - SO FOOT", "description": "Sur un terrain ou en dehors, le Barça n'est pas facile à maîtriser. Vendredi, lors d'une conférence téléphonique, le président de la Liga ...", "url": "https://www.sofoot.com/le-barca-serait-pret-a-secher-la-possible-reprise-de-la-liga-482674.html", "urlToImage": null, "publishedAt": "2020-04-25T16:15:00Z", "content": "Sur un terrain ou en dehors, le Barça n'est pas facile à maîtriser.Vendredi, lors d'une conférence téléphonique, le président de la Liga Javier Tebas s'est montré très clair : une non-reprise du championnat est pour lui inenvisageable. « Les clubs qui refuser… [+680 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Le championnat de Biélorussie arrêté, William Accambray champion avec Brest - Hand - L'Équipe.fr", "description": "Après l'arrêt du championnat de Biélorussie en raison de l'épidémie de coronavirus, William Accambray est sacré champion avec le Meshkov Brest.", "url": "https://www.lequipe.fr/Handball/Actualites/Le-championnat-de-bielorussie-arrete-william-accambray-champion-avec-brest/1129731", "urlToImage": null, "publishedAt": "2020-04-25T15:54:10Z", "content": "« Nous sommes donc champions dès à présent ! Et la Coupe est reportée au début de la saison prochaine », a réagi l'ancien international sur les réseaux sociaux. Le triple champion du monde, également champion olympique et d'Europe, arrivé à Brest il y a un an… [+140 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Roy Keane conseille Manchester United pour le mercato - Le Figaro", "description": "L’ancien capitaine des Red Devils a détaillé à Sky Sports la stratégie que devait adopter Manchester United pour le prochain mercato. Alors que les médias anglais évoquent l’intérêt de Man United pour Jadon Sancho (Borussia Dortmund), Jack Grealish (Aston Vil…", "url": "https://sport24.lefigaro.fr/football/transferts/fil-info/roy-keane-conseille-man-united-pour-le-mercato-1000304", "urlToImage": null, "publishedAt": "2020-04-25T15:40:00Z", "content": "Lancien capitaine des Red Devils a détaillé à Sky Sports la stratégie que devait adopter Manchester United pour le prochain mercato. Alors que les médias anglais évoquent lintérêt de Man United pour Jadon Sancho (Borussia Dortmund), Jack Grealish (Aston Villa… [+1173 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Cedric Rablat", "title": "FC Barcelone : la stratégie de Quique Setién pour relancer Philippe Coutinho - Foot Mercato", "description": "Le milieu offensif brésilien, actuellement en prêt au Bayern Munich, ne sait pas encore ce que lui réserve l'avenir. Mais l'entraîneur catalan aurait déjà sa petite idée pour relancer la carrière de l'intéressé au Barça.", "url": "https://www.footmercato.net/a1406994864420996443-fc-barcelone-la-strategie-de-quique-setien-pour-relancer-philippe-coutinho", "urlToImage": null, "publishedAt": "2020-04-25T15:12:51Z", "content": "Et si le FC Barcelone tendait la main à Philippe Coutinho (27 ans) pour relancer sa carrière en Catalogne ? Prêté l'été dernier par le Barça au Bayern Munich, le milieu offensif brésilien réalise un exercice plutôt satisfaisant sous les couleurs bavaroises (2… [+2205 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "Esp : Avec le « Swissx Camp Nou », le Barça s'expose à un scandale - Foot01.com", "description": "Le FC Barcelone a trouvé un candidat pour le naming de son stade la saison prochaine. Mais la réputation de cet investisseur risque de faire parler en Espagne.\r\nCe qui devait être un très beau geste pourrait vite provoquer une polémique au FC Barcelone…", "url": "https://www.foot01.com/foot-europeen/espagne/esp-avec-le-swissx-camp-nou-le-barca-s-expose-a-un-scandale,347953", "urlToImage": null, "publishedAt": "2020-04-25T15:05:00Z", "content": "Le FC Barcelone a trouvé un candidat pour le naming de son stade la saison prochaine. Mais la réputation de cet investisseur risque de faire parler en Espagne.\r\nCe qui devait être un très beau geste pourrait vite provoquer une polémique au FC Barcelone. En dé… [+1358 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Chelsea : Aubameyang plutôt que Dembélé ou Werner ? - Fil Info - Transferts - Football - Le Figaro", "description": "Les Blues sont en quête de renfort devant. Reste à savoir qui sera l’heureux élu… D’après ESPN, les Blues s’intéressent de près au Lyonnais Moussa Dembélé, dont les Gones attendrait 80 M€, ou encore à l’international allemand de Leipzig Timo Werner, annoncé p…", "url": "https://sport24.lefigaro.fr/football/transferts/fil-info/chelsea-aubameyang-plutot-que-dembele-ou-werner-1000298", "urlToImage": null, "publishedAt": "2020-04-25T14:21:00Z", "content": "Les Blues sont en quête de renfort devant. Reste à savoir qui sera lheureux élu Daprès ESPN, les Blues sintéressent de près au Lyonnais Moussa Dembélé, dont les Gones attendrait 80 M, ou encore à linternational allemand de Leipzig Timo Werner, annoncé proche … [+426 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Mathieu Rault", "title": "PSG : Mauro Icardi pourrait coûter plus cher que prévu ! - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a6086381562833370238-psg-mauro-icardi-pourrait-couter-plus-cher-que-prevu", "urlToImage": null, "publishedAt": "2020-04-25T14:14:36Z", "content": "Où évoluera Mauro Icardi la saison prochaine ? Nul ne le sait. Propriété de l'Inter de Milan, l'attaquant argentin a été prêté au Paris Saint-Germain cette saison, avec qui il a inscrit la bagatelle de 20 buts en 31 matches. A l'issue de la saison, dont on ig… [+1004 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Fusion ATP/WTA : Dirk Hordoff est contre l'idée de Roger Federer - Tennis - ATP/WTA - L'Équipe.fr", "description": "Pour le vice-président de la fédération allemande de tennis, la fusion entre l'ATP et la WTA évoquée par Roger Federer lui semble une très mauvaise idée.", "url": "https://www.lequipe.fr/Tennis/Actualites/Fusion-atp-wta-dirk-hordoff-est-contre-l-idee-de-roger-federer/1129711", "urlToImage": null, "publishedAt": "2020-04-25T13:49:10Z", "content": "Le vice-président de la fédération allemande de tennis, Dirk Hordorff, a ouvertement critiqué la proposition de Roger Federer de fusionner l'ATP et la WTA : « C'est une idée à court terme, et ce n'est pas suffisant. La fusion de l'ATP et de la WTA ne résoudra… [+267 chars]"}, {"source": {"id": null, "name": "Olympique-et-lyonnais.com"}, "author": "La Rédaction", "title": "Mercato – Ligue 1 : l’épineuse question des joueurs en fin de contrat au 30 juin - Olympique et Lyonnais", "description": "La crise sanitaire bouscule le calendrier de Ligue 1 mais aussi son cadre juridique habituel, comme l’illustre l’épineuse question des joueurs en fin de contrat au 30 juin. Décryptage. Combien de joueurs sont concernés ? En France, les contrats des joueurs « …", "url": "https://www.olympique-et-lyonnais.com/mercato-ligue-1-lepineuse-question-des-joueurs-en-fin-de-contrat-au-30-juin,191249.html", "urlToImage": null, "publishedAt": "2020-04-25T13:41:55Z", "content": "Combien de joueurs sont concernés ?\r\nEn France, les contrats des joueurs « expirent le 30 juin de la dernière saison » prévue dans la transaction, selon la Charte du football professionnel. Or, à cette date, la saison 2019/20 ne sera pas terminée. La Ligue de… [+3635 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "PSG : A genoux devant Leonardo, Meunier met Mourinho en attente - Foot01.com", "description": "Bientôt en fin de contrat au Paris Saint-Germain, Thomas Meunier intéresse du beau monde, à commencer par le Tottenham de José Mourinho. Mais le latéral droit attend toujours un geste de ses supérieurs.\r\nPas toujours tendres avec Thomas Meunier, les supporter…", "url": "https://www.foot01.com/equipe/paris/psg-a-genoux-devant-leonardo-meunier-met-mourinho-en-attente,347949", "urlToImage": null, "publishedAt": "2020-04-25T13:01:03Z", "content": "Bientôt en fin de contrat au Paris Saint-Germain, Thomas Meunier intéresse du beau monde, à commencer par le Tottenham de José Mourinho. Mais le latéral droit attend toujours un geste de ses supérieurs.\r\nPas toujours tendres avec Thomas Meunier, les supporter… [+1218 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Coronavirus : le Championnat de Pologne devrait reprendre fin mai - Foot - POL - Coronavirus - L'Équipe.fr", "description": "Le Premier ministre polonais Mateusz Morawiecki a annoncé un probable redémarrage de l'élite polonaise le 29 mai.", "url": "https://www.lequipe.fr/Football/Actualites/Coronavirus-le-championnat-de-pologne-devrait-reprendre-fin-mai/1129700", "urlToImage": null, "publishedAt": "2020-04-25T12:36:45Z", "content": "Le Championnat de football de Pologne, suspendu à cause de la pandémie de coronavirus, devrait reprendre le 29 mai en l'absence de public, a annoncé samedi le Premier ministre polonais Mateusz Morawiecki. « Nous avons un plan précis pour arriver au premier ma… [+587 chars]"}, {"source": {"id": null, "name": "90min.com"}, "author": "Clément Siéper", "title": "MERCATO : Le PSG cible un jeune milieu de Serie A - 90min", "description": "", "url": "https://www.90min.com/fr/posts/6599738-mercato-le-psg-cible-un-jeune-milieu-de-serie-a", "urlToImage": null, "publishedAt": "2020-04-25T12:24:40Z", "content": "Toujours en quête de renfort au milieu de terrain, le PSG aurait dans sa ligne de mire un joueur de l'AS Rome à en croire Sky Italia.\r\nLe PSG et la révolution du milieu de terrain. Mercato après mercato, c'est le même refrain. Malgré l'arrivée d'Idrissa Gueye… [+1128 chars]"}, {"source": {"id": null, "name": "Sport.fr"}, "author": null, "title": "Ribéry et Gourcuff ne partiront jamais en vacance ensemble, Manardo confirme - Sport.fr", "description": "La relation entre Franck Ribéry et Yoann Gourcuff n’a jamais été très bonne. Il y a quelques années, les deux hommes ont même eu une brouille en Equipe de France. Invité de Rothen régale sur “RMC”, François Manardo, ancien chef de presse de l’Equipe de France…", "url": "https://www.sport.fr/football/ribery-et-gourcuff-ne-partiront-jamais-en-vacance-ensemble-manardo-confirme-683698.shtm", "urlToImage": null, "publishedAt": "2020-04-25T12:19:00Z", "content": "La relation entre Franck Ribéry et Yoann Gourcuff n’a jamais été très bonne. Il y a quelques années, les deux hommes ont même eu une brouille en Equipe de France. \r\nInvité de Rothen régale sur “RMC”, François Manardo, ancien chef de presse de l’Equipe de Fran… [+1079 chars]"}, {"source": {"id": null, "name": "Topmercato.com"}, "author": null, "title": "ASSE : l'énorme don de M'Vila au CHU de Saint-Etienne - Top Mercato.com", "description": "Le milieu de terrain de l'AS Saint-Etienne, Yann M'Vila, est venu en aide au personnel soignant de la cité forézienne.", "url": "http://www.topmercato.com/219594,1/asse---l-enorme-don-de-m-vila-au-chu-de-saint-etienne.html", "urlToImage": null, "publishedAt": "2020-04-25T11:58:00Z", "content": "Le milieu de terrain de l'AS Saint-Etienne, Yann M'Vila, est venu en aide au personnel soignant de la cité forézienne.Le footballeur de 29 ans a effectué un don de 15 000 masques au CHU de Saint-Etienne, comme l'a relayé la formation stéphanoise sur son compt… [+249 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Manchester United - Neville : \"Sancho est loin d'Aguero, Higuain, Messi ou Di Maria\" - Goal.com", "description": "Musa Barrow hopes he can make strides with Bologna.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T11:16:00Z", "content": "More"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Expulsé pendant le Tournoi, Haouas a purgé sa suspension pendant le confinement - Le Figaro", "description": "Expulsé lors de la rencontre du Tournoi Ecosse-France le 8 mars dernier pour un coup de poing sur le deuxième ligne du XV au Chardon Jamie Ritchie, Mohamed Haouas avait écopé d'une suspension de trois semaines. Bonne nouvelle pour le joueur de Montpellier : c…", "url": "https://sport24.lefigaro.fr/rugby/top-14/fil-info/expulse-pendant-le-tournoi-haouas-a-purge-sa-suspension-pendant-le-confinement-1000260", "urlToImage": null, "publishedAt": "2020-04-25T10:46:00Z", "content": "Expulsé lors de la rencontre du Tournoi Ecosse-France le 8 mars dernier pour un coup de poing sur le deuxième ligne du XV au Chardon Jamie Ritchie, Mohamed Haouas avait écopé d'une suspension de trois semaines. Bonne nouvelle pour le joueur de Montpellier : c… [+746 chars]"}, {"source": {"id": null, "name": "Lerugbynistere.fr"}, "author": "Thibault Perrin", "title": "Lacroix : ''Incompréhensible de reprendre une compétition par des phases finales'' [VIDEO] - Le Rugbynistère", "description": "Le président du Stade Toulousain Didier Lacroix a répondu aux questions que pouvaient se poser les supporters quant à la reprise et à la situation du club.", "url": "https://www.lerugbynistere.fr/videos/lacroix-incomprehensible-de-reprendre-une-competition-par-des-phases-finales-video-2504201209.php", "urlToImage": null, "publishedAt": "2020-04-25T10:10:00Z", "content": "Le président du Stade Toulousain Didier Lacroix a répondu aux questions que pouvaient se poser les supporters quant à la reprise et à la situation du club.Face aux nombreuses incertitudes qui entourent la reprise des matchs, le président du Stade Toulousain D… [+1887 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Paolo Maldini : «Je suis le joueur le plus perdant de l'histoire» - Le Figaro", "description": "L’ancienne gloire du Milan AC et de l’équipe nationale italienne, Paolo Maldini s’est récemment désolé dans un live Instagram, en revendiquant le triste titre du «joueur le plus perdant de l’histoire». Une déclaration étonnante, lorsque l’on connaît le palmar…", "url": "https://sport24.lefigaro.fr/football/etranger/italie/fil-info/paolo-maldini-je-suis-le-joueur-le-plus-perdant-de-l-histoire-1000250", "urlToImage": null, "publishedAt": "2020-04-25T09:37:00Z", "content": "Lancienne gloire du Milan AC et de léquipe nationale italienne, Paolo Maldini sest récemment désolé dans un live Instagram, en revendiquant le triste titre du «joueur le plus perdant de lhistoire». Une déclaration étonnante, lorsque lon connaît le palmarès du… [+679 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Michael Balcaen", "title": "Mercato Barça: Todibo trop cher pour Schalke ? - Sports.fr", "description": "Jean-Clair Todibo plaît beaucoup à Schalke qui l’a récupéré en prêt en janvier dernier. Mais le club allemand ne compte pas lever l’option de 25 millions d’euros prévue par contrat. Après quelques semaines d’adaptation pour trouver le bon tempo, Jean-Clair To…", "url": "https://www.sports.fr/football/mercato-barca-todibo-cher-schalke-349551.html", "urlToImage": null, "publishedAt": "2020-04-25T09:33:32Z", "content": "Jean-Clair Todibo plaît beaucoup à Schalke qui l’a récupéré en prêt en janvier dernier. Mais le club allemand ne compte pas lever l’option de 25 millions d’euros prévue par contrat.\r\nAprès quelques semaines d’adaptation pour trouver le bon tempo, Jean-Clair T… [+919 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Michael Balcaen", "title": "Les Red Devils ne voudraient plus de Pogba… - Sports.fr", "description": "Paul Pogba a toujours autant envie de quitter Manchester United. Un départ qui paraît inéluctable. Mais le Real Madrid et la Juventus ne sont pas seuls sur le coup. L’Inter Milan  a également des vues sur le milieu de terrain tricolore. Le chantier du transfe…", "url": "https://www.sports.fr/football/real-a-de-concurrence-pogba-349548.html", "urlToImage": null, "publishedAt": "2020-04-25T09:09:22Z", "content": "Paul Pogba a toujours autant envie de quitter Manchester United. Un départ qui paraît inéluctable. Mais le Real Madrid et la Juventus ne sont pas seuls sur le coup. L’Inter Milan  a également des vues sur le milieu de terrain tricolore.\r\nLe chantier du transf… [+1418 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "Ajax: Ziyech ne digère pas d'être privé du titre de champion - RMC Sport", "description": "Hakim Ziyech a réagi ce vendredi à la décision d'interrompre définitivement la saison de football aux Pays-Bas en raison de l'épidémie de coronavirus. Le milieu offensif marocain a exprimé sa frustration à l'idée de ne pas être sacré champion malgré la premiè…", "url": "https://rmcsport.bfmtv.com/football/ajax-ziyech-ne-digere-pas-d-etre-prive-du-titre-de-champion-1900518.html", "urlToImage": null, "publishedAt": "2020-04-25T08:58:23Z", "content": null}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Maxime Barbaud", "title": "Le Real Madrid rassure Luka Jovic - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a2293788211737076323-le-real-madrid-rassure-luka-jovic", "urlToImage": null, "publishedAt": "2020-04-25T07:38:52Z", "content": "La suspension des compétitions et la crise économique que traverse le football en ce moment même changent un peu la donne avec la perspective du mercato. Alors que le Real Madrid aurait vraisemblablement tout essayé pour la venue de Kylian Mbappé, le club esp… [+395 chars]"}, {"source": {"id": null, "name": "Basketusa.com"}, "author": "Jonathan Demay", "title": "Un documentaire à venir sur la dernière saison de Kobe Bryant avec des images inédites ? - BasketUSA", "description": "Une équipe a également suivi l'arrière des Lakers lors de sa dernière saison en NBA, en 2015-2016, avec une grande liberté. Un documentaire, à la façon de \"The Last Dance\", serait en préparation.", "url": "https://www.basketusa.com/news/593881/un-documentaire-a-venir-sur-la-derniere-saison-de-kobe-bryant-avec-des-images-inedites/", "urlToImage": null, "publishedAt": "2020-04-25T07:21:55Z", "content": "Le documentaire « The Last Dance » permet de ressortir des tiroirs des informations qui n’avaient pas filtré jusqu’alors. On a par exemple appris que les Warriors, en 2018-2019, avaient refusé d’être filmés comme les Bulls.\r\nMaintenant, c’est ESPN qui nous in… [+1203 chars]"}, {"source": {"id": null, "name": "Topmercato.com"}, "author": null, "title": "OM : Eyraud fait passer un message aux supporters - Top Mercato.com", "description": "Le président de l'Olympique de Marseille, Jacques-Henri Eyraud a balayé l'actualité du club marseillais à l'occasion d...", "url": "http://www.topmercato.com/219580,1/om---eyraud-fait-passer-un-message-aux-supporters.html", "urlToImage": null, "publishedAt": "2020-04-25T06:58:00Z", "content": "Article lu 3320 fois - Rédigé le 25 avril 2020 à 08h58 par Romain Boselli"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Oriane Alcarini", "title": "Hugo Lloris confiné avec ses trois enfants, \"une source d'évasion\" - Pure People", "description": "Hugo Lloris (33 ans) a raconté son confinement au \"Parisien\", le 23 avril 2020. Le footballeur français dit s'occuper activement de sa petite famille, lui qui est papa d'un tout jeune Léandro (7 mois).", "url": "https://www.purepeople.com/article/hugo-lloris-confine-avec-ses-trois-enfants-une-source-d-evasion_a385670/1", "urlToImage": null, "publishedAt": "2020-04-25T06:45:00Z", "content": "Au cours d'un long entretien accordé au Parisien, Hugo Lloris s'est confié sur son confinement, qu'il vit à Londres et en famille. Le capitaine des Bleus s'agace d'abord de se faire narguer par un merveilleux ciel bleu. \"En huit ans à Londres, je n'ai jamais … [+1611 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "L'UFC annonce une soirée de combats à Jacksonville le 9 mai à huis clos - MMA - UFC - L'Équipe.fr", "description": "L'Ultimate Fighting Championship (UFC) a officiellement annoncé vendredi la tenue de l'UFC 249, le 9 mai prochain dans la Veterans Memorials Arena de Jacksonville. Les combats se dérouleront à huis clos.", "url": "https://www.lequipe.fr/Mma/Actualites/L-ufc-annonce-une-soiree-de-combats-a-jacksonville-le-9-mai-a-huis-clos/1129627", "urlToImage": null, "publishedAt": "2020-04-25T06:30:46Z", "content": "Après plusieurs tentatives infructueuses pour organiser des combats en pleine pandémie de coronavirus, l'UFC, la plus importante ligue professionnelle de MMA, a annoncé vendredi la tenue d'une soirée à huis clos, le 9 mai prochain en Floride. L'UFC 249 se tie… [+1941 chars]"}, {"source": {"id": null, "name": "Onzemondial.com"}, "author": "La rédaction", "title": "Barça : l'éloge d'Ernesto Valverde envers Lionel Messi - Onze Mondial", "description": "L'ancien entraîneur du FC Barcelone, Ernesto Valverde, a dit tout le bien qu'il pense de son ancien élément majeur chez les Blaugranas, Lionel Messi.", "url": "http://www.onzemondial.com/liga/2019-2020/barca-l-eloge-d-ernesto-valverde-envers-lionel-messi-216451", "urlToImage": null, "publishedAt": "2020-04-25T06:20:23Z", "content": "Zapping Onze Mondial Stade Rennais : candidat sérieux à la Ligue des Champions ?\r\nLicencié en janvier dernier du FC Barcelone, Ernesto Valverde continue d’avoir un œil attentif sur l’évolution des Catalans. Celui qui a profité de son temps libre pour enchaîne… [+1172 chars]"}, {"source": {"id": null, "name": "Lensois.com"}, "author": null, "title": "La LFP dévoile son protocole médical de reprise pour la Ligue 1 et la Ligue 2 - Lensois.com", "description": "Ce vendredi, la Ligue de football professionnel (LFP) a publié un communiqué important. Celui-ci dévoile le protocole d’un scénario de reprise des championnats de Ligue 1 et de Ligue 2. Présenté par le docteur Eric Rolland, représentant des médecins des clubs…", "url": "https://www.lensois.com/la-lfp-devoile-son-protocole-medical-de-reprise-pour-la-ligue-1-et-la-ligue-2/", "urlToImage": null, "publishedAt": "2020-04-25T05:13:53Z", "content": "Ce vendredi, la Ligue de football professionnel (LFP) a publié un communiqué important. Celui-ci dévoile le protocole dun scénario de reprise des championnats de Ligue 1 et de Ligue 2.\r\nPrésenté par le docteur Eric Rolland, représentant des médecins des clubs… [+608 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "Th.B.", "title": "Mercato - Barcelone : Le Barça prêt à piocher… au LOSC ? - Le 10 Sport", "description": "Déterminée à dénicher un successeur à Luis Suarez sur le marché des transferts, la direction du FC Barcelone se pencherait sur la situation de Victor Osimhen contractuellement lié au LOSC. Mais le…", "url": "https://le10sport.com/football/mercato/mercato-barcelone-le-barca-pret-a-piocher-au-losc-500944", "urlToImage": null, "publishedAt": "2020-04-25T04:00:00Z", "content": "Foot - Mercato - Barcelone\r\nPublié le 25 avril 2020 à 6h00 par Th.B. Déterminée à dénicher un successeur à Luis Suarez sur le marché des transferts, la direction du FC Barcelone se pencherait sur la situation de Victor Osimhen contractuellement lié au LOSC. M… [+1309 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "T.M.", "title": "Mercato - Barcelone : Une énorme surprise à prévoir pour la succession de Luis Suarez ? - Le 10 Sport", "description": "Depuis de longues semaines, Lautaro Martinez est annoncé comme le successeur parfait de Luis Suarez au FC Barcelone. Toutefois, on ne serait pas à l’abri d’une surprise dans ce dossier.", "url": "https://le10sport.com/football/mercato/mercato-barcelone-une-enorme-surprise-a-prevoir-pour-la-succession-de-luis-suarez-500999", "urlToImage": null, "publishedAt": "2020-04-25T03:15:00Z", "content": "Foot - Mercato - Barcelone\r\nPublié le 25 avril 2020 à 5h15 par T.M. Depuis de longues semaines, Lautaro Martinez est annoncé comme le successeur parfait de Luis Suarez au FC Barcelone. Toutefois, on ne serait pas à labri dune surprise dans ce dossier.\r\nA 33 a… [+1184 chars]"}, {"source": {"id": null, "name": "Creusot-infos.com"}, "author": null, "title": "RUGBY : Le Creusot a refusé de monter en Fédérale 1 - Creusot-infos.com", "description": "", "url": "https://www.creusot-infos.com/news/sport/rugby/rugby-le-creusot-a-refuse-de-monter-en-federale-1.html", "urlToImage": null, "publishedAt": "2020-04-25T01:17:00Z", "content": null}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "Th.B.", "title": "Mercato - Barcelone : Une voie royale pour le Barça avec Timo Werner ? - Le 10 Sport", "description": "Le FC Barcelone penserait à Timo Werner pour renforcer le secteur offensif blaugrana et Liverpool ne serait pas en course pour accueillir le buteur de Leipzig.", "url": "https://le10sport.com/football/mercato/mercato-barcelone-une-voie-royale-pour-le-barca-avec-timo-werner-501022", "urlToImage": null, "publishedAt": "2020-04-24T23:30:00Z", "content": "Foot - Mercato - Barcelone\r\nPublié le 25 avril 2020 à 1h30 par Th.B. Le FC Barcelone penserait à Timo Werner pour renforcer le secteur offensif blaugrana et Liverpool ne serait pas en course pour accueillir le buteur de Leipzig.\r\nEt si le FC Barcelone raflait… [+1261 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "De nouvelles mesures économiques en faveur du sport - Tous sports - L'Équipe.fr", "description": "A l'issue d'une réunion avec d'autres ministres et divers acteurs du sport, ce vendredi, Roxana Maracineanu a annoncé de nouvelles mesures d'accompagnement pour le secteur.", "url": "https://www.lequipe.fr/Tous-sports/Actualites/De-nouvelles-mesures-economiques-en-faveur-du-sport/1129608", "urlToImage": null, "publishedAt": "2020-04-24T21:27:04Z", "content": "Alors que les inquiétudes se sont renforcées ces derniers jours face à la crise économique générée par l'épidémie de Covid-19, la ministre des Sports Roxana Maracineanu a annoncé dans un tweet, ce vendredi soir, de nouvelles mesures d'accompagnement du secteu… [+577 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Suède : Zlatan Ibrahimovic marque avec Hammarby en amical - Foot - SUE - L'Équipe.fr", "description": "L'attaquant, qui s'entraîne en Suède avec Hammarby, un club dont il possède des parts, a inscrit un but en amical.", "url": "https://www.lequipe.fr/Football/Actualites/Suede-zlatan-ibrahimovic-marque-avec-hammarby-en-amical/1129591", "urlToImage": null, "publishedAt": "2020-04-24T20:42:22Z", "content": "Aujourd'hui, l'attaquant a d'ailleurs participé à une triangulaire amicale avec deux autres équipes locales, Bajans et IK Frej. Durant ces oppositions, l'attaquant de 38 ans est même parvenu à inscrire un but. Ibrahimovic s'est dit très heureux de pouvoir s'e… [+113 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "T.M.", "title": "Mercato - Real Madrid : Setien et Guardiola pourraient avoir leur mot à dire pour Camavinga ! - Le 10 Sport", "description": "Alors qu’Eduardo Camavinga se rapproche un peu plus chaque jour du Real Madrid, le FC Barcelone et Manchester City pourraient encore relancer l’avenir de la pépite de Rennes.", "url": "https://le10sport.com/football/mercato/mercato-real-madrid-setien-et-guardiola-pourraient-avoir-leur-mot-a-dire-pour-camavinga-500980", "urlToImage": null, "publishedAt": "2020-04-24T18:30:00Z", "content": "Foot - Mercato - Real Madrid\r\nPublié le 24 avril 2020 à 20h30 par T.M. Alors quEduardo Camavinga se rapproche un peu plus chaque jour du Real Madrid, le FC Barcelone et Manchester City pourraient encore relancer lavenir de la pépite de Rennes.\r\n« Espérons-nou… [+1056 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "OL : 50 ME, Aouar a son bon de sortie, le PSG sur le coup - Foot01.com", "description": "Houssem Aouar a l'accord de l'Olympique Lyonnais pour partir cet été. Trois clubs sont à l'affût, dont le PSG, et le tarif est déjà connu. \r\nChaque été, l’Olympique Lyonnais réalise une ou deux grosses ventes, ce qui explique aussi pourquoi Jean-Michel…", "url": "https://www.foot01.com/equipe/ol/ol-50-me-aouar-a-son-bon-de-sortie-le-psg-sur-le-coup,347909", "urlToImage": null, "publishedAt": "2020-04-24T16:37:11Z", "content": "Houssem Aouar a l'accord de l'Olympique Lyonnais pour partir cet été. Trois clubs sont à l'affût, dont le PSG, et le tarif est déjà connu. \r\nChaque été, lOlympique Lyonnais réalise une ou deux grosses ventes, ce qui explique aussi pourquoi Jean-Michel Aulas p… [+1874 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Rafael égratigne Neymar / France / Ligue 1 / SOFOOT.com - SO FOOT", "description": "Faut bien s'occuper. Pour tuer le temps en confinement, Rafael, le défenseur brésilien de l'OL, a donné une interview à ESPN cette semaine, ...", "url": "https://www.sofoot.com/rafael-egratigne-neymar-482648.html", "urlToImage": null, "publishedAt": "2020-04-24T16:15:00Z", "content": "Faut bien s'occuper.Pour tuer le temps en confinement, Rafael, le défenseur brésilien de l'OL, a donné une interview à ESPN cette semaine, notamment pour évoquer l'avenir de la Seleção.L'occasion pour le Rhodanien de parler de l'épineux cas de Neymar, qui ne … [+879 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/marc.alvarez1", "title": "Maguire : “La Champions League 19/20 reprendra sous une forme ou une autre” - Canal Supporters", "description": "Les enjeux sont trop importants pour que l'UEFA tire un trait sur la Ligue des champions 2019/2020. Tout sera fait, qu'importe le calendrier,", "url": "https://canal-supporters.com/2020/04/maguire-la-champions-league-19-20-reprendra-sous-une-forme-ou-une-autre/", "urlToImage": null, "publishedAt": "2020-04-24T14:54:14Z", "content": "Les enjeux sont trop importants pour que l’UEFA tire un trait sur la Ligue des champions 2019/2020. Tout sera fait, qu’importe le calendrier, pour que la compétition continentale suspendue depuis la mi-mars aille à son terme. Le spécialiste de l’économie du f… [+1420 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Ligue des champions : La Fédération européenne qualifie directement le PSG pour le Final Four - Eurosport - FRANCE (FR)", "description": "Dans l'incapacité de jouer les huitièmes et quarts de la compétition, la Fédération européenne de handball a décidé de qualifier directement quatre équipes.", "url": "https://www.eurosport.fr/handball/ligue-des-champions/2019-2020/ligue-des-champions-la-federation-europeenne-qualifie-directement-le-psg-pour-le-final-four_sto7734057/story.shtml", "urlToImage": null, "publishedAt": "2020-04-24T14:43:59Z", "content": "Voilà une décision de la Fédération européenne de handball qui ne devrait pas plaire à toutes les équipes encore engagées en Ligue des champions. Dans la un communiqué, la Fédération a décidé d'annuler les huitièmes et quarts de finale de la compétition pour … [+769 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Les joueurs forcés de porter des masques en cas de reprise de la Bundesliga ? - SO FOOT", "description": "Fußball masqué ohé ohé ! En Allemagne, si on se dirige progressivement vers une reprise de la Bundesliga, les modalités de ce retour restent à ...", "url": "https://www.sofoot.com/les-joueurs-forces-de-porter-des-masques-en-cas-de-reprise-de-la-bundesliga-482630.html", "urlToImage": null, "publishedAt": "2020-04-24T12:25:00Z", "content": "Fußball masqué ohé ohé !En Allemagne, si on se dirige progressivement vers une reprise de la Bundesliga, les modalités de ce retour restent à préciser et pourraient être plus drastiques qu'attendu, dans un pays où le nombre d'infections repart à la hausse. Ce… [+1666 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "sdenis", "title": "Médiapro lorgne du côté de Canal+ pour se renforcer - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a4977268563619275871-mediapro-lorgne-du-cote-de-canal-pour-se-renforcer", "urlToImage": null, "publishedAt": "2020-04-24T11:40:52Z", "content": "Si la journaliste de beIN Sports Anne Laure Bonnet a été récemment approchée pour renforcer Mediapro dans les prochaines semaines, le groupe média espagnol qui est le futur diffuseur de la Ligue 1 et de la Ligue 2 continue de prospecter en vue de renforcer la… [+665 chars]"}]}