{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "PSG : Ça sent bon la reprise, Paris rappelle Neymar ! - Foot01.com", "description": "Les joueurs de Ligue 1 de retour à l’entraînement le 11 mai prochain, cela se précise sérieusement alors que le plan de déconfinement sera annoncé mardi par Edouard Philippe.\r\nA en croire les informations obtenues par Le Parisien, le Premier Ministre souhaite…", "url": "https://www.foot01.com/equipe/paris/psg-ca-sent-bon-la-reprise-paris-rappelle-neymar,348033", "urlToImage": null, "publishedAt": "2020-04-26T16:09:27Z", "content": "Les joueurs de Ligue 1 de retour à lentraînement le 11 mai prochain, cela se précise sérieusement alors que le plan de déconfinement sera annoncé mardi par Edouard Philippe.\r\nA en croire les informations obtenues par Le Parisien, le Premier Ministre souhaite … [+1534 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Mathieu Grégoire et Hugo Delom", "title": "Transferts : Sarr-Amavi (OM), deux affaires à saisir - Foot - Transferts - OM - L'Équipe.fr", "description": "Auteurs de saisons consistantes avec Marseille, les deux latéraux sont perçus comme des affaires potentielles sur le marché des transferts estival.", "url": "https://www.lequipe.fr/Football/Article/Transferts-sarr-amavi-om-deux-affaires-a-saisir/1129927", "urlToImage": null, "publishedAt": "2020-04-26T16:00:00Z", "content": "Intercalé entre les valeurs marchandes les plus élevées de l'effectif (Boubacar Kamara, Morgan Sanson, Duje Caleta-Car) et les gros contrats guère liquides (Florian Thauvin, Dimitri Payet, Kevin Strootman), Bouna Sarr relève du bon plan malin. Avec son profil… [+144 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "\"Il ne tiendrait pas une seconde au Real Madrid\" : Diego Costa dresse les limites d'Antonio Conte - Eurosport - FRANCE (FR)", "description": "Dans un entretien accordé à ESPN, Diego Costa est revenu sur la relation compliquée qu'il a entretenu avec Antonio Conte lors de son passage à Chelsea.", "url": "https://www.eurosport.fr/football/il-ne-tiendrait-pas-une-seconde-au-real-madrid-diego-costa-dresse-les-limites-d-antonio-conte_sto7735375/story.shtml", "urlToImage": null, "publishedAt": "2020-04-26T15:38:00Z", "content": null}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "Coronavirus: Thiem ne veut pas donner au fonds de solidarité entre joueurs - RMC Sport", "description": "Dominic Thiem a fait entendre une voix discordante dans ce contexte de crise sanitaire liée au coronavirus, en assurant qu’il ne versera pas un centime au fonds de solidarité créé pour aider les joueurs en difficulté.", "url": "https://rmcsport.bfmtv.com/tennis/coronavirus-thiem-ne-veut-pas-donner-au-fonds-de-solidarite-entre-joueurs-1901930.html", "urlToImage": null, "publishedAt": "2020-04-26T15:31:53Z", "content": null}, {"source": {"id": null, "name": "Cyclismactu.net"}, "author": null, "title": "Route: Les coureurs français de retour à l'entraînement le 11 mai ! - Cyclism'Actu", "description": "Toute l'actu du Cyclisme", "url": "https://www.cyclismactu.net/news-route-les-coureurs-francais-de-retour-a-l-entrainement-le-11-mai-90711.html", "urlToImage": null, "publishedAt": "2020-04-26T15:27:00Z", "content": "Alors qu'un plan de déconfinement sera présenté mardi par le Premier ministre Edouard Philippe devant l'Assemblée nationale, le journal L'Equipe affirme, de source ministérielle, que la pratique du vélo en extérieur devrait être autorisée dès le 11 mai procha… [+2252 chars]"}, {"source": {"id": null, "name": "Footradio.com"}, "author": "Alexis Rose", "title": "PSG : Mbappé au Real Madrid ? Fred Hermel fait des annonces - FootRadio.com", "description": "Confiné avec sa famille, en cette période de pandémie de coronavirus, Kylian Mbappé ne sait pas encore de quoi son avenir sera fait au Paris Saint-Germain. Sous contrat jusqu’en 2022, Kylian Mbappé pourrait bientôt recevoir une énorme proposition de prolongat…", "url": "https://footradio.com/rmc/psg-mbappe-au-real-madrid-fred-hermel-fait-des-annonces/", "urlToImage": null, "publishedAt": "2020-04-26T14:32:18Z", "content": "Confiné avec sa famille, en cette période de pandémie de coronavirus, Kylian Mbappé ne sait pas encore de quoi son avenir sera fait au Paris Saint-Germain.\r\nSous contrat jusquen 2022, Kylian Mbappé pourrait bientôt recevoir une énorme proposition de prolongat… [+2356 chars]"}, {"source": {"id": null, "name": "Lephoceen.fr"}, "author": "Le Phocéen", "title": "Quelles solutions pour Thauvin - Le Phoceen", "description": "Le point sur le dossier Florian Thauvin, après les déclarations du joueur.", "url": "https://www.lephoceen.fr/infos-om/saison/quelles-solutions-pour-thauvin-178287", "urlToImage": null, "publishedAt": "2020-04-26T14:17:07Z", "content": "Ces dernières heures, Florian Thauvin a mis les choses au clair concernant son avenir. À l'occasion d'un live Instagram en compagnie de Malik Bentalha, Thauvin a expliqué qu'il comptait bien rester à l'OM la saison prochaine : \"Moi ici je suis bien, en plus j… [+1294 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "Mercato : Raphaël Varane au PSG, dossier relancé ! - Foot01.com", "description": "L’été dernier, le Paris Saint-Germain s’était penché sur le cas de Raphaël Varane mais à l’époque, le défenseur du Real Madrid était resté fidèle au club espagnol.\r\nQu’en sera-t-il lors du prochain mercato ? Visiblement, le feuilleton pourrait être relancé…", "url": "https://www.foot01.com/equipe/paris/mercato-raphael-varane-au-psg-dossier-relance,348019", "urlToImage": null, "publishedAt": "2020-04-26T14:10:47Z", "content": "Lété dernier, le Paris Saint-Germain sétait penché sur le cas de Raphaël Varane mais à lépoque, le défenseur du Real Madrid était resté fidèle au club espagnol.\r\nQuen sera-t-il lors du prochain mercato ? Visiblement, le feuilleton pourrait être relancé puisqu… [+1508 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "WTF : Neymar (PSG) se prend pour John Legend au piano - Foot - WTF - PSG - L'Équipe.fr", "description": "L'attaquant brésilien du Paris Saint-Germain s'essaie à une reprise d'« All of Me », le célèbre titre du chanteur et compositeur américain.", "url": "https://www.lequipe.fr/Football/Actualites/Wtf-neymar-psg-se-prend-pour-john-legend-au-piano/1129914", "urlToImage": null, "publishedAt": "2020-04-26T14:08:37Z", "content": "Pendant que son coéquipier Kylian Mbappé se prend pour LeBron James, Neymar se la joue John Legend. L'attaquant brésilien du PSG, rentré au pays pendant le confinement, s'est assis derrière un piano pour tenter une reprise d'« All of Me », le célèbre titre du… [+34 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Jeux olympiques. « Le dossier de Paris 2024 est obsolète, dépassé, déconnecté de la réalité… » - Ouest-France", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMigAFodHRwczovL3d3dy5vdWVzdC1mcmFuY2UuZnIvc3BvcnQvamV1eC1vbHltcGlxdWVzLWxlLWRvc3NpZXItZGUtcGFyaXMtMjAyNC1lc3Qtb2Jzb2xldGUtZGVwYXNzZS1kZWNvbm5lY3RlLWRlLWxhLXJlYWxpdGUtNjgxNzk1NNIBgAFodHRwczovL2FtcC5vdWVzdC1mcmFuY2UuZnIvc3BvcnQvamV1eC1vbHltcGlxdWVzLWxlLWRvc3NpZXItZGUtcGFyaXMtMjAyNC1lc3Qtb2Jzb2xldGUtZGVwYXNzZS1kZWNvbm5lY3RlLWRlLWxhLXJlYWxpdGUtNjgxNzk1NA?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T14:03:02Z", "content": null}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "OL : Un procès pour aller en Coupe d'Europe, Lyon a zéro chance ! - Foot01.com", "description": "En cas d’interruption définitive de la Ligue 1, l’Olympique Lyonnais a peu de chances d’être qualifié en Coupe d’Europe la saison prochaine.\r\nEffectivement, l’OL était 7e de Ligue 1 au moment où le championnat a été interrompu, et il a d’ores et déjà été…", "url": "https://www.foot01.com/equipe/ol/ol-un-proces-pour-aller-en-coupe-d-europe-lyon-a-zero-chance,348003", "urlToImage": null, "publishedAt": "2020-04-26T13:34:05Z", "content": "En cas dinterruption définitive de la Ligue 1, lOlympique Lyonnais a peu de chances dêtre qualifié en Coupe dEurope la saison prochaine.\r\nEffectivement, lOL était 7e de Ligue 1 au moment où le championnat a été interrompu, et il a dores et déjà été acté que l… [+1608 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "A.M.", "title": "Mercato - OM : Cette sortie qui en dit long sur les intentions de Frank McCourt... - Le 10 Sport", "description": "Alors que la situation financière de l'Olympique de Marseille ne s'est pas améliorée, Frank McCourt perd beaucoup d'argent comme le souligne Romain Molina qui ne change pas de discours concernant la…", "url": "https://le10sport.com/football/mercato/mercato-om-cette-sortie-qui-en-dit-long-sur-les-intentions-de-frank-mccourt-501224", "urlToImage": null, "publishedAt": "2020-04-26T13:30:00Z", "content": "Publié le 26 avril 2020 à 15h30 par A.M. Alors que la situation financière de l'Olympique de Marseille ne s'est pas améliorée, Frank McCourt perd beaucoup d'argent comme le souligne Romain Molina qui ne change pas de discours concernant la volonté de l'homme … [+1593 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Maxime Barbaud", "title": "Nîmes : Romain Philippoteaux tacle Pierre Ménès - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a2015558475467328478-nimes-romain-philippoteaux-tacle-pierre-menes", "urlToImage": null, "publishedAt": "2020-04-26T13:09:39Z", "content": "Le coronavirus touche tout le monde, y compris ceux dont la situation est plutôt avantageuse comme les joueurs de football. Le dernier exemple Junior Sambia (Montpellier), tout juste sorti du coma, en est la parfaite illustration. Voilà pourquoi Romain Philip… [+922 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Haouas et son coup de poing contre l’Ecosse : «Tout le monde a cherché à me faire passer pour un sale type» - Le Figaro", "description": "Le pilier du XV de France revient pour la première fois sur son coup de sang à Murrayfield dans un entretien à L’Equipe.", "url": "https://sport24.lefigaro.fr/rugby/6-nations/actualites/haouas-et-son-coup-de-poing-contre-l-ecosse-tout-le-monde-a-cherche-a-me-faire-passer-pour-un-sale-type-1000353", "urlToImage": null, "publishedAt": "2020-04-26T13:04:00Z", "content": "Le pilier du XV de France revient pour la première fois sur son coup de sang à Murrayfield dans un entretien à LEquipe.8 mars dernier, au Murrayfield Stadium dEdimbourg. Alors que la France mène au score (7-6) contre lEcosse dans le Tournoi des Six Nations, M… [+2182 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Éric Thomas critique les « décisions arbitraires » de la FFF dans la crise du coronavirus - Foot - Coronavirus - L'Équipe.fr", "description": "Dans un courrier adressé à Noël Le Graët, patron de la FFF, le président de l'Association Française de Football Amateur s'élève contre les décisions du 16 avril sur l'arrêt des compétitions.", "url": "https://www.lequipe.fr/Football/Actualites/Eric-thomas-critique-les-decisions-arbitraires-de-la-fff-dans-la-crise-du-coronavirus/1129887", "urlToImage": null, "publishedAt": "2020-04-26T12:47:52Z", "content": "Éric Thomas, président de l'Association Française de Football Amateur, a envoyé samedi un troisième courrier en quelques semaines à Noël Le Graët, le président de la FFF, ainsi qu'au Comité exécutif. Son objet : la décision prise par la Fédération, le 16 avri… [+1947 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Mercato, De Ligt vers le Barça ? - Goal.com", "description": "Jack Wilshere has revealed he was reluctant to join Arsenal when he received an offer from the club.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T12:43:00Z", "content": "More"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Cyril Morin", "title": "Coiffures et confinement : \"Areola se laisse pousser les cheveux, on dirait une peluche Kiki\" - Eurosport - FRANCE (FR)", "description": "Alors que le confinement s’éternise, les stars du sport s'adapent pour trouver des solutions pour leurs coiffures. Entretien qui décoiffe avec Caiolas Barber.", "url": "https://www.eurosport.fr/football/coiffures-et-confinement-areola-se-laisse-pousser-les-cheveux-on-dirait-une-peluche-kiki_sto7733774/story.shtml", "urlToImage": null, "publishedAt": "2020-04-26T12:17:57Z", "content": "59%. Si la France saccorde sur un point, cest celui-ci. Dès la levée du confinement, 59% des Français affirment vouloir se rendre chez le coiffeur pour rafraîchir leurs coupes, \r\nselon un sondage Harris. Les stars du sport ne dérogent pas à la règle. Confinée… [+4156 chars]"}, {"source": {"id": null, "name": "Onzemondial.com"}, "author": "La rédaction", "title": "Rennes : les anecdotes croustillantes de Bourigeaud sur la finale face au PSG - Onze Mondial", "description": "Grand bonhomme de la superbe saison 2018-2019 du Stade Rennais, Benjamin Bourigeaud s'est repenché sur la finale de Coupe de France remportée face au Paris Saint-Germain.", "url": "http://www.onzemondial.com/coupe-de-france/rennes-les-anecdotes-croustillantes-de-bourigeaud-sur-la-finale-face-au-psg-216558", "urlToImage": null, "publishedAt": "2020-04-26T12:14:01Z", "content": "Zapping Onze Mondial Adrien Rabiot à la Juventus Turin : le mauvais choix ? L'avis de Philippe Genin\r\nAprès un superbe parcours en Ligue Europa, le Stade Rennais s'imposait finalement face au Paris Saint-Germain en finale de la Coupe de France pour mettre un … [+3271 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Max Franco Sanchez", "title": "L'Atlético de Madrid veut mettre 6 joueurs à la porte - Foot Mercato", "description": "L'Atlético de Madrid pourrait se séparer de six joueurs lors du prochain mercato estival. Et il y a de jolis noms dans cette liste...", "url": "https://www.footmercato.net/a5779458041016280335-latletico-de-madrid-veut-mettre-6-joueurs-a-la-porte", "urlToImage": null, "publishedAt": "2020-04-26T11:43:50Z", "content": "Les effets de la crise de coronavirus risquent d'être pour le moins difficiles à encaisser, d'un point de vue financier comme sportif, puisque les directeurs sportifs et les recruteurs naviguent dans le flou pour la préparation de la prochaine saison. Ce n'es… [+2499 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Le City Football Group réaffirme sa volonté de racheter l'ASNL - SO FOOT", "description": "Ce virus a vraiment tout arrêté. En passe d'être officiellement racheté par le City Football Group avant le début de la crise sanitaire, l'AS ...", "url": "https://www.sofoot.com/le-city-football-group-reaffirme-sa-volonte-de-racheter-l-as-nancy-lorraine-482686.html", "urlToImage": null, "publishedAt": "2020-04-26T11:30:00Z", "content": "Ce virus a vraiment tout arrêté.En passe d'être officiellement racheté par le City Football Group avant le début de la crise sanitaire, l'AS Nancy Lorraine est désormais dans le flou quant à son avenir proche. Son président, Jacques Rousselot s'en est ouverte… [+1562 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Andy Murray chambre Rafael Nadal avant l'Open virtuel de Madrid - Tennis - WTF - L'Équipe.fr", "description": "Avant de participer en ligne à l'Open de Madrid, épreuve virtuelle du tournoi, Andy Murray et Rafael Nadal échangent quelques mots sur leur niveau respectif.", "url": "https://www.lequipe.fr/Tennis/Actualites/Andy-murray-chambre-rafael-nadal-avant-l-open-virtuel-de-madrid/1129873", "urlToImage": null, "publishedAt": "2020-04-26T11:26:56Z", "content": "Coronavirus oblige, le Masters 1000 de Madrid a été annulé. Mais la semaine prochaine (27 au 30 avril) verra se dérouler une édition virtuelle du tournoi avec un joli plateau. Alors que Rafael Nadal a avoué avoir terminé son tout premier match de tennis virtu… [+204 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "A.C.", "title": "Mercato - PSG : Le Real Madrid a tranché pour Pogba ! - Le 10 Sport", "description": "Florentino Pérez, président du Real Madrid, ne serait finalement pas totalement opposé à une arrivée de Paul Pogba.", "url": "https://le10sport.com/football/mercato/mercato-psg-le-real-madrid-a-tranche-pour-pogba-501169", "urlToImage": null, "publishedAt": "2020-04-26T11:15:00Z", "content": "Publié le 26 avril 2020 à 13h15 par A.C. Florentino Pérez, président du Real Madrid, ne serait finalement pas totalement opposé à une arrivée de Paul Pogba. \r\nLété dernier, Zinedine Zidane a cru jusquau dernier moment pouvoir rafler la mise pour Paul Pogba. I… [+760 chars]"}, {"source": {"id": null, "name": "Allezpaillade.com"}, "author": null, "title": "L’agent de Junior Sambia évoque les jours avant l’hospitalisation - AllezPaillade.com", "description": "Pour L'Equipe, l'agent de Junior Sambia, Frédéric Guerra, racontait les jours qui ont précédé l'hospitalisation du Paillain. Un discours effrayant montrant la gravité du virus qui sévit", "url": "https://www.allezpaillade.com/actualites/breves/lagent-de-junior-sambia-evoque-les-jours-avant-lhospitalisation/", "urlToImage": null, "publishedAt": "2020-04-26T11:00:00Z", "content": "Pour L’Equipe, l’agent de Junior Sambia, Frédéric Guerra, racontait les jours qui ont précédé l’hospitalisation du Paillain. Un discours effrayant montrant la gravité du virus qui sévit aujourd’hui:\r\n« Junior est resté confiné avec sa copine à Montpellier dep… [+1165 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Rétro : Revivez la 12e étape du Tour de France 2017 - Cyclisme - Rétro - L'Équipe.fr", "description": "Revivez en vidéo sur le site et la chaîne L'Équipe, ce dimanche à partir de 13 heures, la 12e étape du Tour de 2017 entre Pau et Peyragudes.", "url": "https://www.lequipe.fr/Cyclisme-sur-route/Actualites/Retro-revivez-la-12e-etape-du-tour-de-france-2017/1129869", "urlToImage": null, "publishedAt": "2020-04-26T10:56:21Z", "content": "En cette période de confinement, le site et la chaîne L'Équipe rediffusent les étapes marquantes de l'histoire du Tour de France. Au programme de ce dimanche 26 avril, la 12e étape de la Grande Boucle 2017. C'est le coureur AG2R La Mondiale, Romain Bardet, qu… [+98 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Guillaume Issner", "title": "Ciro Immobile s'en prend à Unai Emery - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a4113109770665649915-ciro-immobile-sen-prend-a-unai-emery", "urlToImage": null, "publishedAt": "2020-04-26T10:47:08Z", "content": "Ciro Immobile marche sur l'eau cette saison avec la Lazio. L'attaquant est le meilleur buteur de Serie A avec 27 buts en 26 matches. Une résurrection pour celui qui a connu des périodes plus difficiles au Borussia Dortmund et au FC Séville il y a quelques ann… [+739 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Bayern Munich : Salihamidzic optimiste pour une prolongation de Manuel Neuer - Foot - ALL - Bayern - L'Équipe.fr", "description": "Le directeur sportif du club allemand, Hasan Salihamidzic, pense qu'une issue favorable pourra être trouvée au sujet de l'avenir du gardien international.", "url": "https://www.lequipe.fr/Football/Actualites/Bayern-munich-salihamidzic-optimiste-pour-une-prolongation-de-manuel-neuer/1129867", "urlToImage": null, "publishedAt": "2020-04-26T10:44:09Z", "content": "Le directeur sportif du Bayern Munich Hasan Salihamidzic s'est dit « optimiste » quant à une prolongation de contrat du gardien et capitaine Manuel Neuer, indiquant que des divergences ont été « clarifiées en interne », dans un entretien au journal Die Welt d… [+166 chars]"}, {"source": {"id": null, "name": "Lesviolets.com"}, "author": "https://facebook.com/lesvioletscom/", "title": "Olivier Sadran qui resterait président du TFC, êtes-vous déçu par cette information - LesViolets.Com", "description": "Apr&egrave;s plusieurs semaines sans aucune information concernant la vente du TFC...", "url": "https://www.lesviolets.com/actu/olivier-sadran-qui-resterait-president-du-tfc-etes-vous-decu-par-cette-information-,53415.html", "urlToImage": null, "publishedAt": "2020-04-26T10:43:00Z", "content": "Après plusieurs semaines sans aucune information concernant la vente du TFC, L’Équipe a expliqué samedi soir qu’aucun accord n’avait été trouvé entre Olivier Sadran et le groupe sino-américain intéressé par le rachat du club. Le président toulousain serait mê… [+492 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "L1 : Le plan des médecins pour la reprise, quelle galère ! - Foot01.com", "description": "Reprise des entraînements le 11 mai et retour de la Ligue 1 le 17 juin prochain, tel est le plan de la Ligue de Football Professionnel pour terminer le championnat en cours.\r\nBien évidemment, ce scénario est conditionné par les décisions gouvernementales…", "url": "https://www.foot01.com/ligue1/l1-le-plan-des-medecins-pour-la-reprise-quelle-galere,347993", "urlToImage": null, "publishedAt": "2020-04-26T10:41:16Z", "content": "Reprise des entraînements le 11 mai et retour de la Ligue 1 le 17 juin prochain, tel est le plan de la Ligue de Football Professionnel pour terminer le championnat en cours.\r\nBien évidemment, ce scénario est conditionné par les décisions gouvernementales en c… [+1882 chars]"}, {"source": {"id": null, "name": "Football365.fr"}, "author": "Rédaction", "title": "La nouvelle cible de l’OL pour remplacer Maurice - Football365", "description": "Selon les informations du quotidien régional Le Progrès, l'OL aurait coché le nom de Jean-Luc Buisine pour succéder à Florian Maurice.", "url": "https://www.football365.fr/la-nouvelle-cible-de-lol-pour-remplacer-maurice-9821981.html", "urlToImage": null, "publishedAt": "2020-04-26T10:30:20Z", "content": "La situation de Florian Maurice est confuse. Cette semaine, Jean-Michel Aulas s’est encore exprimé sur ce dossier sensible. « Pour le moment, il ny a pas de décision prise pour Florian Maurice, a-t-il expliqué sur OL TV en fin de semaine. Le deuxième jour du … [+882 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Everton \"consterné\" par une fête organisée par Moise Kean en plein confinement - Eurosport - FRANCE (FR)", "description": "PREMIER LEAGUE  - Le club d'Everton s'est dit dimanche \"consterné\" par le fait qu'un de ses joueurs, qui serait Moise Keane, ait organisé une fête.", "url": "https://www.eurosport.fr/football/premier-league/2019-2020/everton-consterne-par-une-fete-organisee-par-moise-kean-en-plein-confinement_sto7735217/story.shtml", "urlToImage": null, "publishedAt": "2020-04-26T10:30:15Z", "content": null}, {"source": {"id": null, "name": "Welovetennis.fr"}, "author": null, "title": "ATP - WTA > Mats Wilander pense qu'une possible fusion ATP/WTA permettra de digérer la fin de la carrière de Federer - We Love Tennis !", "description": "Dans ses analyses, Mats Wilander essaye souvent de prévoir les grandes tendances. L’avenir ne lui donne pas toujours raison mais il a le mérite de poser toujours quelques concepts importants. Concernant la fameuse fusion ATP/WTA, il y voit la possibilité de p…", "url": "https://www.welovetennis.fr/atp-wta/mats-wilander-pense-quune-possible-fusion-atp-wta-permettra-de-digerer-la-fin-de-la-carriere-de-federer", "urlToImage": null, "publishedAt": "2020-04-26T10:21:00Z", "content": "Dans ses analyses, Mats Wilander essaye souvent de prévoir les grandes tendances. L’avenir ne lui donne pas toujours raison mais il a le mérite de poser toujours quelques concepts importants. \r\nConcernant la fameuse fusion ATP/WTA, il y voit la possibilité de… [+572 chars]"}, {"source": {"id": null, "name": "Topmercato.com"}, "author": null, "title": "PSG : Verratti se paye l'OM sur sa LdC - Top Mercato.com", "description": "Marco Verratti (27 ans) s'est exprimé sur la Ligue des Champions remportée par l'OM, en 1993. Il a rappelé que le club ...", "url": "http://www.topmercato.com/219624,1/psg---verratti-se-paye-l-om-sur-sa-ldc.html", "urlToImage": null, "publishedAt": "2020-04-26T10:20:00Z", "content": "Marco Verratti (27 ans) s'est exprimé sur la Ligue des Champions remportée par l'OM, en 1993. Il a rappelé que le club phocéen n'avait plus gagné contre le PSG depuis longtemps.\"Il faut gagner deux Ligues des Champions pour arrêter de faire parler l'OM ? On v… [+359 chars]"}, {"source": {"id": null, "name": "Paristeam.fr"}, "author": "Paristeam", "title": "Areola, le Real a tranché - Transferts - Paris PSG - paristeam.fr", "description": "Areola, le Real a tranché", "url": "https://www.paristeam.fr/actu-psg/transferts/areola-le-real-a-tranche-46725", "urlToImage": null, "publishedAt": "2020-04-26T10:10:00Z", "content": "Quid d'Alphonse Areola pour la saison prochaine ? Les rumeurs fusent concernant le gardien de but prêté par le PSG au Real Madrid cette saison. Son avenir semble bouché à Paris.\r\nSelon AS, journal madrilène, le Real ne souhaite pas garder Areola et donnera sa… [+435 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/marc.alvarez1", "title": "Sanfourche explique la logique de Le Graët sur les finales - Canal Supporters", "description": "Noël Le Graët, le président de la FFF, est désireux de reprendre la saison 2019/2020 suspendue par la finale de la Coupe de France...", "url": "https://canal-supporters.com/2020/04/sanfourche-explique-la-logique-de-le-graet-sur-les-finales/", "urlToImage": null, "publishedAt": "2020-04-26T10:02:40Z", "content": "Noël Le Graët, le président de la FFF, est désireux de reprendre la saison 2019/2020 suspendue par la finale de la Coupe de France (le 13 ou 20 juin) puis la finale de la Coupe de la Ligue, trois jours après, à huis clos. Ce qui voudrait dire que le PSG jouer… [+1112 chars]"}, {"source": {"id": null, "name": "Cyclismactu.net"}, "author": null, "title": "Route: Les coureurs français pourront retourner s'entraîner le 11 mai - Cyclism'Actu", "description": "Toute l'actu du Cyclisme", "url": "https://www.cyclismactu.net/news-route-les-coureurs-francais-pourront-retourner-s-entrainer-le-11-mai-90711.html", "urlToImage": null, "publishedAt": "2020-04-26T10:02:00Z", "content": "Alors qu'un plan de déconfinement sera présenté mardi par le Premier ministre Edouard Philippe devant l'Assemblée nationale, le journal L'Equipe affirme, de source ministérielle, que la pratique du vélo en extérieur devrait être autorisée dès le 11 mai procha… [+2252 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Maradona : « Ronaldinho n'est pas un criminel » / Paraguay / SOFOOT.com - SO FOOT", "description": "Deux génies sur le terrain et dans les excès. S'il a pu quitter la prison après avoir été arrêté en possession d'un faux passeport, Ronaldinho ...", "url": "https://www.sofoot.com/maradona-ronaldinho-n-est-pas-un-criminel-482684.html", "urlToImage": null, "publishedAt": "2020-04-26T10:00:00Z", "content": "Deux génies sur le terrain et dans les excès.S'il a pu quitter la prison après avoir été arrêté en possession d'un faux passeport, Ronaldinho est toujours assigné à résidence au Paraguay. Une situation que regrette Diego Maradona, comme ce dernier l'a confié … [+248 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Tom Murday devrait quitter Agen et rejoindre le Japon - Rugby - Transferts - L'Équipe.fr", "description": "Le deuxième-ligne australien du SUA devrait jouer en Top League la saison prochaine.", "url": "https://www.lequipe.fr/Rugby/Actualites/Tom-murday-devrait-quitter-agen-et-rejoindre-le-japon/1129854", "urlToImage": null, "publishedAt": "2020-04-26T09:46:51Z", "content": "« Tom a reçu récemment une très belle offre d'une franchise japonaise, précise-t-il. Ils lui proposent trois ans et un contrat beaucoup plus intéressant que chez nous. Ce n'est pas encore fait mais, si ça se confirme, je me suis engagé à le libérer gratuiteme… [+116 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/marc.alvarez1", "title": "Lecomte : “Ibra était venu me féliciter après un triplé au Parc des Princes” - Canal Supporters", "description": "Ibra a été un cauchemar pour les gardiens de but et les défenses de la Ligue 1. Benjamin Lecomte, actuel portier de l'AS Monaco, en convient.", "url": "https://canal-supporters.com/2020/04/lecomte-ibra-etait-venu-me-feliciter-apres-un-triple-au-parc-des-princes/", "urlToImage": null, "publishedAt": "2020-04-26T09:28:13Z", "content": "Zlatan Ibrahimovic a été un cauchemar pour les gardiens de but et les défenses de la Ligue 1. Benjamin Lecomte, actuel portier de l’AS Monaco, en convient. Dans un live Instagram du journaliste de L’Équipe Hugo Guillemet, le gardien de but s’est souvenu du ph… [+382 chars]"}, {"source": {"id": null, "name": "Rugbyrama.fr"}, "author": "Rugbyrama", "title": "Transferts - L’ASBH dément la signature d’Alex Tulou - Rugbyrama.fr", "description": "TRANSFERTS - Alors que l’info concernant la signature du Castrais Alex Tulou à Béziers était relayée depuis hier sur Internet, le club héraultais a préféré couper court à toutes spéculations, ce matin, par le biais d’un communiqué officiel. Bien que certains …", "url": "https://www.rugbyrama.fr/rugby/transferts/2018-2019/transferts-lasbh-dement-la-signature-dalex-tulou-castres_sto7735167/story.shtml", "urlToImage": null, "publishedAt": "2020-04-26T09:18:26Z", "content": "Après les pertes de Kelly Meafua, qui rejoindra Montauban à partir de la saison prochaine et de Tyrone Viiga, en partance pour Provence Rugby, lASBH confirme cependant avoir pris contact avec plusieurs joueurs dans le but de palier à ces départs. Camille Géro… [+325 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Diacre : « J'espère que, dans ces deux ans, des jeunes vont émerger » - SO FOOT", "description": "Tournée vers l'avenir. Dans un entretien accordé à L'Équipe ce dimanche, Corinne Diacre revient sur son confinement, celui de ses joueuses, ...", "url": "https://www.sofoot.com/diacre-j-espere-que-dans-ces-deux-ans-des-jeunes-vont-emerger-482683.html", "urlToImage": null, "publishedAt": "2020-04-26T09:15:00Z", "content": "Tournée vers l'avenir.Dans un entretien accordé à L'Équipe ce dimanche, Corinne Diacre revient sur son confinement, celui de ses joueuses, mais aussi sur le décalage de l'Euro 2021 d'un an (du 6 au 31 juillet 2022). Un report qui n'affecte en rien les objecti… [+1010 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Mercato OM: Cabella répond sur un retour - Sports.fr", "description": "Interrogé sur un éventuel retour à l’Olympique de Marseille, Rémy Cabella n’y croit pas. Désormais à Krasnodar, Rémy Cabella ne se voit pas revenir à l’Olympique de Marseille. A Marseille entre 2015 et 2017 avant d’être prêté puis transféré à Saint-Etienne, l…", "url": "https://www.sports.fr/football/mercato-om-cabella-repond-retour-349721.html", "urlToImage": null, "publishedAt": "2020-04-26T08:34:35Z", "content": "Interrogé sur un éventuel retour à lOlympique de Marseille, Rémy Cabella ny croit pas.\r\nDésormais à Krasnodar, Rémy Cabella ne se voit pas revenir à lOlympique de Marseille. A Marseille entre 2015 et 2017 avant dêtre prêté puis transféré à Saint-Etienne, lint… [+825 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Erling Haaland (Borussia Dortmund) : « Ce que je préfère manger, c'est la pizza kebab » - Foot - ALL - Dortmund - L'Équipe.fr", "description": "Dans une vidéo publiée par le Borussia Dortmund, le jeune attaquant norvégien Erling Haaland répond aux questions des supporters du club allemand.", "url": "https://www.lequipe.fr/Football/Actualites/Erling-haaland-borussia-dortmund-ce-que-je-prefere-manger-c-est-la-pizza-kebab/1129843", "urlToImage": null, "publishedAt": "2020-04-26T08:33:45Z", "content": "Ses sensations quand le stade crie son nom, son plat favori, ses occupations pendant le confinement, ses idoles, ses rituels ou encore sa musique préférée... Tout, tout, tout, vous saurez tout sur Erling Haaland. L'attaquant du Borussia Dortmund (19 ans) s'es… [+72 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Le plan pour déterminer le classement de la L1 si la saison s’arrête - Sports.fr", "description": "Bertrand Desplat, le président de Guingamp, a proposé un plan en cas d’arrêt définitif de la saison de Ligue 1. Si le déconfinement devrait permettre aux joueurs de Ligue 1 (et Ligue 2, voire national) de retrouver le chemin des centres d’entraînement, une re…", "url": "https://www.sports.fr/football/plan-determiner-classement-de-l1-saison-sarrete-349753.html", "urlToImage": null, "publishedAt": "2020-04-26T08:18:23Z", "content": "Bertrand Desplat, le président de Guingamp, a proposé un plan en cas d’arrêt définitif de la saison de Ligue 1.\r\nSi le déconfinement devrait permettre aux joueurs de Ligue 1 (et Ligue 2, voire national) de retrouver le chemin des centres dentraînement, une re… [+1621 chars]"}, {"source": {"id": null, "name": "Parisfans.fr"}, "author": null, "title": "Mercato - Le Barça n'a pas parlé à l'agent de Pjanic, qui pourrait plutôt aller au PSG selon Schira - Parisfans.fr", "description": "Miralem Pjanic, milieu de 30 ans de la Juventus Turin et de la Bosnie, est régulièrement évoqué dans les rumeurs de transferts ces dernières semaines. Il ferait partie des joueurs turinois « vendables » pour financer d’autres venues et serait visé par plusieu…", "url": "http://www.parisfans.fr/transferts/mercato-le-barca-na-pas-parle-a-lagent-de-pjanic-qui-pourrait-plutot-aller-au-psg-selon-schira-460996.html", "urlToImage": null, "publishedAt": "2020-04-26T08:00:00Z", "content": "Miralem Pjanic, milieu de 30 ans de la Juventus Turin et de la Bosnie, est régulièrement évoqué dans les rumeurs de transferts ces dernières semaines. Il ferait partie des joueurs turinois « vendables » pour financer d’autres venues et serait visé par plusieu… [+1371 chars]"}, {"source": {"id": null, "name": "Trashtalk.co"}, "author": "Arthur Baudin", "title": "Officiel, Joël Ayayi se présente à la Draft NBA 2020 : le nom est dans l'urne, mais la tête encore à Gonzaga - TrashTalk", "description": "NBA, je te veux si tu veux de moi.", "url": "https://trashtalk.co/2020/04/26/officiel-joel-ayayi-se-presente-a-la-draft-nba-2020-le-nom-est-dans-lurne-mais-la-tete-encore-a-gonzaga/", "urlToImage": null, "publishedAt": "2020-04-26T07:18:27Z", "content": "À quelques mois (années ?) de la cérémonie fatidique, les jeunes prospects du monde entier déclarent tour à tour leurs intentions de candidater à la Draft. Certains se présentent sans grandes ambitions tandis que d’autres y vont d’un pas assuré. Joël Ayayi a … [+2953 chars]"}, {"source": {"id": null, "name": "Football365.fr"}, "author": "Rédaction", "title": "PSG ou Barcelone ? De nouvelles révélations sur l’avenir de Neymar - Football365", "description": "Le feuilleton Neymar continue d'alimenter la presse catalane, alors que l'hypothèse d'une prolongation au PSG se renforce.", "url": "https://www.football365.fr/psg-ou-barcelone-de-nouvelles-revelations-sur-lavenir-de-neymar-9821816.html", "urlToImage": null, "publishedAt": "2020-04-26T07:09:19Z", "content": "Où évoluera Neymar la saison prochaine ? Après le premier épisode d’un feuilleton digne d’une télénovela, la seconde saison l’été prochain devrait être moins intense. La star a montré son attachement au Paris Saint-Germain avant que le football ne s’arrête, t… [+1027 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Guillaume Issner", "title": "Man United : Ed Woodward annonce la couleur pour le mercato - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a2987772919757341771-man-united-ed-woodward-annonce-la-couleur-pour-le-mercato", "urlToImage": null, "publishedAt": "2020-04-26T07:04:31Z", "content": "Face à la crise financière liée à la pandémie de coronavirus, les clubs professionnels auront un budget très restreint cet été pour le mercato. Les cadors n'y échapperont pas, à l'image de Manchester United. Ed Woodward, le vice-président exécutif, s'est adre… [+638 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Coronavirus : «Ces tests de dépistage nous font gagner 15 jours», assure le président d’Amiens - Le Parisien", "description": "Bernard Joannin explique pourquoi il a demandé à ce que les joueurs et le staff technique du club passent des tests de dépistage du Covid-19", "url": "http://www.leparisien.fr/sports/football/coronavirus-ces-tests-de-depistage-nous-font-gagner-15-jours-assure-le-president-d-amiens-26-04-2020-8305920.php", "urlToImage": null, "publishedAt": "2020-04-26T06:19:00Z", "content": "Il assume. « Gouverner c'est prévoir », affirme Bernard Joannin, le président du club d'Amiens SC. 19e et avant-dernier de Ligue 1 au moment de la suspension du championnat en raison du confinement, le club a été le premier en France à imposer des tests de dé… [+4059 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Les monuments qui sentent le neuf - Actualité - DirectVélo", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiTGh0dHBzOi8vd3d3LmRpcmVjdHZlbG8uY29tL2FjdHVhbGl0ZS84MTczNC9sZXMtbW9udW1lbnRzLXF1aS1zZW50ZW50LWxlLW5ldWbSAQA?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T05:23:00Z", "content": null}, {"source": {"id": null, "name": "Basketusa.com"}, "author": "Emmanuel Laurin", "title": "La NBA autorise la réouverture des centres d’entraînement dans quelques États - BasketUSA", "description": "Sans signifier que la saison va reprendre de sitôt, la NBA va autoriser ses franchises NBA à rouvrir leur centre d'entraînement dans les États qui le permettent, à partir du 1er mai prochain.", "url": "https://www.basketusa.com/news/593927/la-nba-autorise-la-reouverture-des-centres-dentrainement-dans-quelques-etats/", "urlToImage": null, "publishedAt": "2020-04-26T05:17:45Z", "content": "Face à l’épidémie du Covid-19, la NBA avait mis sa saison en pause puis demandé à toutes les franchises de fermer leurs centres d’entraînement. Mais ESPN annonce qu’à partir du 1er mai, certains gymnases vont pouvoir rouvrir, pour les franchises situées dans … [+1498 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Laissez Camavinga tranquille ! / France / Stade rennais / SOFOOT.com - SO FOOT", "description": "Le Real Madrid, c'est trop tôt : Eduardo Camavinga doit rester à Rennes.", "url": "https://www.sofoot.com/laissez-eduardo-camavinga-tranquille-482667.html", "urlToImage": null, "publishedAt": "2020-04-26T04:00:00Z", "content": "Cette semaine, les journaux espagnols ont fait enfler la rumeur : le Real Madrid s'intéresserait de très près à Eduardo Camavinga, pour le prochain mercato. La saison n'est pas encore terminée, mais le joueur de 17 ans est déjà promis à un cador européen dans… [+4635 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Ces transferts de stars ratés par les clubs de Ligue 1 - Sports.fr", "description": "De nombreux clubs de Ligue 1 auraient pu accueillir des stars du football mondial. Que ce soit au début de leur carrière ou même parfois, pour ce qui est des cadors du championnat, à leur sommet. Invité d’un pocast diffusé par le club mancunien, Paul Pogba es…", "url": "https://www.sports.fr/football/transferts-de-stars-rates-clubs-de-ligue-1-349626.html", "urlToImage": null, "publishedAt": "2020-04-26T03:54:49Z", "content": "De nombreux clubs de Ligue 1 auraient pu accueillir des stars du football mondial. Que ce soit au début de leur carrière ou même parfois, pour ce qui est des cadors du championnat, à leur sommet.\r\nInvité dun pocast diffusé par le club mancunien, Paul Pogba es… [+1050 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Icardi, la clause qui change encore la donne - Sports.fr", "description": "Alors que le PSG devrait vraisemblablement lever l’option d’achat dont est assorti le prêt de Mauro Icardi, son prix ne sera pas le même si les Parisiens décident de le revendre dans la foulée. Le contrat entourant le prêt de Mauro Icardi au PSG aura décidéme…", "url": "https://www.sports.fr/football/icardi-clause-change-donne-349662.html", "urlToImage": null, "publishedAt": "2020-04-26T03:28:22Z", "content": "Alors que le PSG devrait vraisemblablement lever loption dachat dont est assorti le prêt de Mauro Icardi, son prix ne sera pas le même si les Parisiens décident de le revendre dans la foulée.\r\nLe contrat entourant le prêt de Mauro Icardi au PSG aura décidémen… [+1615 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "T.M.", "title": "Mercato - PSG : La guerre est déclarée entre Mbappé et le PSG ! - Le 10 Sport", "description": "La prolongation de Kylian Mbappé est actuellement la priorité du PSG. Intransigeant à ce sujet, le club de la capitale pourrait toutefois avoir déclenché la guerre avec son joyau.", "url": "https://le10sport.com/football/mercato/mercato-psg-la-guerre-est-declaree-entre-mbappe-et-le-psg-501143", "urlToImage": null, "publishedAt": "2020-04-26T02:30:00Z", "content": "Publié le 26 avril 2020 à 4h30 par T.M. La prolongation de Kylian Mbappé est actuellement la priorité du PSG. Intransigeant à ce sujet, le club de la capitale pourrait toutefois avoir déclenché la guerre avec son joyau.\r\nCet été, avec les répercussions financ… [+1109 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "G.d.S.S.", "title": "Mercato - PSG : Un dossier brûlant de Leonardo est en bonne voie ! - Le 10 Sport", "description": "Le PSG a entamé les démarches pour finalement prolonger Thiago Silva, et le défenseur brésilien fait du club de la capitale sa grande priorité.", "url": "https://le10sport.com/football/mercato/mercato-psg-un-dossier-brulant-de-leonardo-est-en-bonne-voie-501153", "urlToImage": null, "publishedAt": "2020-04-26T00:00:00Z", "content": "Publié le 26 avril 2020 à 2h00 par G.d.S.S. Le PSG a entamé les démarches pour finalement prolonger Thiago Silva, et le défenseur brésilien fait du club de la capitale sa grande priorité.\r\nComme Le 10 Sport vous la révélé en exclusivité mi-avril, le PSG a fin… [+1112 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Quels sont les points les plus mythiques de l'histoire ? - Eurosport - FRANCE (FR)", "description": "Nouvel épisode de notre rubrique \"On refait l'Histoire\". Cette fois, Laurent Vergne et Bertrand Milliard vous dévoilent les points qui les ont marqué.", "url": "https://www.eurosport.fr/tennis/quels-sont-les-points-les-plus-mythiques-de-l-histoire_sto7734788/story.shtml", "urlToImage": null, "publishedAt": "2020-04-25T22:41:15Z", "content": "ON REFAIT L'HISTOIRE - Nouvel épisode de notre rubrique \"On refait l'Histoire\". Cette fois, Laurent Vergne et Bertrand Milliard vous dévoilent les points qui ont particulièrement marqué leur mémoire. Première partie ce dimanche avec, notamment, un certain éch… [+19480 chars]"}, {"source": {"id": null, "name": "Onzemondial.com"}, "author": "La rédaction", "title": "PSG - Borussia Dortmund : Kehrer revient sur le chambrage vis-à-vis d'Haaland - Onze Mondial", "description": "Le défenseur du PSG, Thilo Kehrer, a assuré qu'il n'existait pas de tensions entre les joueurs de Paris et de Dortmund, malgré le chambrage des Parisiens envers Haaland lors du 8e retour de C1.", "url": "http://www.onzemondial.com/ligue-des-champions/psg-borussia-dortmund-kehrer-revient-sur-le-chambrage-vis-a-vis-d-haaland-216509", "urlToImage": null, "publishedAt": "2020-04-25T19:49:10Z", "content": "Zapping Onze Mondial Stade Rennais : candidat sérieux à la Ligue des Champions ?\r\nL’attitude des Parisiens avait beaucoup fait parler. Le 11 mars dernier, lors du 8e de finale retour de Ligue des champions contre le Borussia Dortmund (2-0), les joueurs du PSG… [+919 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Ligue Magnus : Cergy-Pontoise officiellement promu - Hockey - L'Équipe.fr", "description": "La Fédération française de hockey sur glace (FFHG) a confirmé que Cergy-Pontoise évoluera en Ligue Magnus la saison prochaine.", "url": "https://www.lequipe.fr/Hockey-sur-glace/Actualites/Ligue-magnus-cergy-pontoise-officiellement-promu/1129785", "urlToImage": null, "publishedAt": "2020-04-25T19:44:31Z", "content": "« Le Bureau directeur a entendu l'avis de la CSNCG et des commissions sportives en charge des championnats concernés et a décidé à l'unanimité de valider la promotion en division supérieure pour les clubs de Cergy-Pontoise en Ligue Magnus, d'Epinal en D1 et d… [+48 chars]"}, {"source": {"id": null, "name": "Www.lci.fr"}, "author": "La rédaction de LCI", "title": "Coronavirus : vers une reprise de la Premier League le 8 juin ? - LCI", "description": "HYPOTHÈSE - Ce samedi, le Times indique que les instances du football anglais envisagent une reprise de la Premier League le 8 juin prochain, le tout à huis clos, avec des mesures sanitaires strictes. L'objectif est de finir la saison le 27 juillet, pour lais…", "url": "https://www.lci.fr/football/coronavirus-vers-une-reprise-de-la-premier-league-le-8-juin-2152038.html", "urlToImage": null, "publishedAt": "2020-04-25T16:42:14Z", "content": "Suspendue depuis le 13 mars dernier en raison de l'épidémie de Covid-19, la Premier League anglaise pourrait reprendre le 8 juin prochain, affirme le Times ce samedi. Selon le journal britannique, les instances du football anglais ainsi que d'autres sports on… [+1464 chars]"}, {"source": {"id": null, "name": "Olympique-et-lyonnais.com"}, "author": "La Rédaction", "title": "Mercato – Ligue 1 : l’épineuse question des joueurs en fin de contrat au 30 juin - Olympique et Lyonnais", "description": "La crise sanitaire bouscule le calendrier de Ligue 1 mais aussi son cadre juridique habituel, comme l’illustre l’épineuse question des joueurs en fin de contrat au 30 juin. Décryptage. Combien de joueurs sont concernés ? En France, les contrats des joueurs « …", "url": "https://www.olympique-et-lyonnais.com/mercato-ligue-1-lepineuse-question-des-joueurs-en-fin-de-contrat-au-30-juin,191249.html", "urlToImage": null, "publishedAt": "2020-04-25T13:41:55Z", "content": "Combien de joueurs sont concernés ?\r\nEn France, les contrats des joueurs « expirent le 30 juin de la dernière saison » prévue dans la transaction, selon la Charte du football professionnel. Or, à cette date, la saison 2019/20 ne sera pas terminée. La Ligue de… [+3635 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "La rédaction", "title": "Mercato - PSG : Le Barça a établi sa stratégie pour le retour de Neymar... - Le 10 Sport", "description": "Alors que l’avenir de Neymar reste toujours flou du côté du PSG, le FC Barcelone serait en train de préparer un plan pour essayer d’attirer l’international brésilien dans ses rangs.", "url": "https://le10sport.com/football/mercato/mercato-barcelone-la-strategie-du-barca-pour-attirer-neymar-501081", "urlToImage": null, "publishedAt": "2020-04-25T13:15:00Z", "content": "Publié le 25 avril 2020 à 15h15 par La rédaction Alors que lavenir de Neymar reste toujours flou du côté du PSG, le FC Barcelone serait en train de préparer un plan pour essayer dattirer linternational brésilien dans ses rangs. \r\nLe Barça aurait monté un plan… [+1303 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Yannick Sagorin", "title": "L’Ajax privé de titre, Ziyech ne digère pas - Sports.fr", "description": "Les responsables de l’Eredivisie ont pris la décision vendredi de ne pas désigner de champion alors que la saison aux Pays-Bas ne reprendra pas. Malgré son statut de leader après 25 journées sur 34 au programme, l’Ajax n’étoffe donc pas son palmarès. Logique …", "url": "https://www.sports.fr/football/lajax-prive-de-titre-ziyech-ne-digere-349562.html", "urlToImage": null, "publishedAt": "2020-04-25T11:50:44Z", "content": "Les responsables de lEredivisie ont pris la décision vendredi de ne pas désigner de champion alors que la saison aux Pays-Bas ne reprendra pas. Malgré son statut de leader après 25 journées sur 34 au programme, lAjax nétoffe donc pas son palmarès. Logique pou… [+935 chars]"}, {"source": {"id": null, "name": "Onzemondial.com"}, "author": "La rédaction", "title": "Real Madrid : Pogba, Camavinga, Hakimi… le onze de rêve de Zidane pour 2020 - Onze Mondial", "description": "Le prochain mercato pourrait permettre à Zinedine Zidane d'aligner un onze de rêve tout simplement fabuleux.", "url": "http://www.onzemondial.com/liga/2019-2020/real-madrid-pogba-camavinga-hakimi-le-onze-de-reve-de-zidane-pour-2020-216473", "urlToImage": null, "publishedAt": "2020-04-25T11:04:37Z", "content": "Zapping Onze Mondial Stade Rennais : candidat sérieux à la Ligue des Champions ?\r\nIl faut toujours se permettre de rêver. Les championnats arrêtés, les rumeurs mercato se succèdent depuis plusieurs semaines, et le Real Madrid est comme toujours lié à plusieur… [+590 chars]"}, {"source": {"id": null, "name": "Lerugbynistere.fr"}, "author": "Thibault Perrin", "title": "Lacroix : ''Incompréhensible de reprendre une compétition par des phases finales'' [VIDEO] - Le Rugbynistère", "description": "Le président du Stade Toulousain Didier Lacroix a répondu aux questions que pouvaient se poser les supporters quant à la reprise et à la situation du club.", "url": "https://www.lerugbynistere.fr/videos/lacroix-incomprehensible-de-reprendre-une-competition-par-des-phases-finales-video-2504201209.php", "urlToImage": null, "publishedAt": "2020-04-25T10:10:00Z", "content": "Le président du Stade Toulousain Didier Lacroix a répondu aux questions que pouvaient se poser les supporters quant à la reprise et à la situation du club.Face aux nombreuses incertitudes qui entourent la reprise des matchs, le président du Stade Toulousain D… [+1887 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Alkiviades David se positionne sur le naming du Camp Nou - SO FOOT", "description": "La course est lancée. Pour la toute première fois de son histoire, le FC Barcelone a annoncé vouloir recourir au procédé du naming concernant ...", "url": "https://www.sofoot.com/alkiviades-david-se-positionne-deja-sur-le-naming-du-camp-nou-482660.html", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": "La course est lancée. Pour la toute première fois de son histoire, le FC Barcelone a annoncé vouloir recourir au procédé du naming concernant son Camp Nou afin d'engendrer des fonds pour lutter contre le Covid-19. Avec un premier candidat d'ores et déjà intér… [+874 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Guillaume Issner", "title": "Javier Tebas crucifie le Barça pour Neymar et Lautaro Martinez - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a2987062811023732559-javier-tebas-crucifie-le-barca-pour-neymar-et-lautaro-martinez", "urlToImage": null, "publishedAt": "2020-04-25T07:58:58Z", "content": "Depuis plusieurs semaines et malgré l'arrêt du football, le FC Barcelone est l'un des clubs les plus actifs en coulisses, notamment sur le mercato. Le club catalan tente d'avancer dans les dossiers Neymar et Lautaro Martinez. C'est ce que l'on croyait en effe… [+800 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "AS Saint-Etienne : l'ancien entraîneur Robert Herbin dans un état grave - Le Figaro", "description": "L'ex-entraîneur emblématique des Verts dans les années 70, âgé de 81 ans, est hospitalisé depuis mardi. Il souffre de problèmes cardiaques et pulmonaires.", "url": "https://sport24.lefigaro.fr/football/ligue-1/actualites/as-saint-etienne-l-ancien-entraineur-robert-herbin-dans-un-etat-grave-1000239", "urlToImage": null, "publishedAt": "2020-04-25T07:39:00Z", "content": "L'ex-entraîneur emblématique des Verts dans les années 70, âgé de 81 ans, est hospitalisé depuis mardi. Il souffre de problèmes cardiaques et pulmonaires.L'inquiétude grandit autour de l'état de santé de l'une des légendes de la grande épopée de l'AS Saint-Et… [+2116 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Oriane Alcarini", "title": "Hugo Lloris confiné avec ses trois enfants, \"une source d'évasion\" - Pure People", "description": "Hugo Lloris (33 ans) a raconté son confinement au \"Parisien\", le 23 avril 2020. Le footballeur français dit s'occuper activement de sa petite famille, lui qui est papa d'un tout jeune Léandro (7 mois).", "url": "https://www.purepeople.com/article/hugo-lloris-confine-avec-ses-trois-enfants-une-source-d-evasion_a385670/1", "urlToImage": null, "publishedAt": "2020-04-25T06:45:00Z", "content": "Au cours d'un long entretien accordé au Parisien, Hugo Lloris s'est confié sur son confinement, qu'il vit à Londres et en famille. Le capitaine des Bleus s'agace d'abord de se faire narguer par un merveilleux ciel bleu. \"En huit ans à Londres, je n'ai jamais … [+1611 chars]"}, {"source": {"id": null, "name": "Lensois.com"}, "author": null, "title": "La LFP dévoile son protocole médical de reprise pour la Ligue 1 et la Ligue 2 - Lensois.com", "description": "Ce vendredi, la Ligue de football professionnel (LFP) a publié un communiqué important. Celui-ci dévoile le protocole d’un scénario de reprise des championnats de Ligue 1 et de Ligue 2. Présenté par le docteur Eric Rolland, représentant des médecins des clubs…", "url": "https://www.lensois.com/la-lfp-devoile-son-protocole-medical-de-reprise-pour-la-ligue-1-et-la-ligue-2/", "urlToImage": null, "publishedAt": "2020-04-25T05:13:53Z", "content": "Ce vendredi, la Ligue de football professionnel (LFP) a publié un communiqué important. Celui-ci dévoile le protocole dun scénario de reprise des championnats de Ligue 1 et de Ligue 2.\r\nPrésenté par le docteur Eric Rolland, représentant des médecins des clubs… [+608 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "De nouvelles mesures économiques en faveur du sport - Tous sports - L'Équipe.fr", "description": "A l'issue d'une réunion avec d'autres ministres et divers acteurs du sport, ce vendredi, Roxana Maracineanu a annoncé de nouvelles mesures d'accompagnement pour le secteur.", "url": "https://www.lequipe.fr/Tous-sports/Actualites/De-nouvelles-mesures-economiques-en-faveur-du-sport/1129608", "urlToImage": null, "publishedAt": "2020-04-24T21:27:04Z", "content": "Alors que les inquiétudes se sont renforcées ces derniers jours face à la crise économique générée par l'épidémie de Covid-19, la ministre des Sports Roxana Maracineanu a annoncé dans un tweet, ce vendredi soir, de nouvelles mesures d'accompagnement du secteu… [+577 chars]"}]}