{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "ASSE : Robert Herbin, des « dégâts irréversibles » liés à son passé ? - Foot01.com", "description": "On l'a appris vendredi, Robert Herbin a été hospitalisé d'urgence à Saint-Étienne pour des graves problèmes cardiaques et pulmonaires. Le coach mythique de l'ASSE est dans un état très préoccupant.\r\nPour les amateurs de football, Robert Herbin est une…", "url": "https://www.foot01.com/equipe/st-etienne/asse-robert-herbin-des-degats-irreversibles-lies-a-son-passe,347945", "urlToImage": null, "publishedAt": "2020-04-25T13:34:30Z", "content": "On l'a appris vendredi, Robert Herbin a été hospitalisé d'urgence à Saint-Étienne pour des graves problèmes cardiaques et pulmonaires. Le coach mythique de l'ASSE est dans un état très préoccupant.\r\nPour les amateurs de football, Robert Herbin est une figure … [+1487 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "A.C.", "title": "Mercato - Real Madrid : Ça se confirme pour Paul Pogba ! - Le 10 Sport", "description": "Zinedine Zidane, coach du Real Madrid, devra bel et bien faire face à un obstacle de taille pour Paul Pogba.", "url": "https://le10sport.com/football/mercato/mercato-real-madrid-ca-se-confirme-pour-paul-pogba-501079", "urlToImage": null, "publishedAt": "2020-04-25T13:30:00Z", "content": "Foot - Mercato - Real Madrid\r\nPublié le 25 avril 2020 à 15h30 par A.C. Zinedine Zidane, coach du Real Madrid, devra bel et bien faire face à un obstacle de taille pour Paul Pogba. \r\nOù jouera Paul Pogba la saison prochaine ? Tout portait à croire que le Franç… [+799 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Coronavirus : une reprise de la Premier League le 8 juin ? - Foot - ANG - Coronavirus - L'Équipe.fr", "description": "D'après le journal britannique The Times, le Championnat d'Angleterre pourrait redémarrer le 8 juin et s'achever le 27 juillet.", "url": "https://www.lequipe.fr/Football/Actualites/Coronavirus-une-reprise-de-la-premier-league-le-8-juin/1129704", "urlToImage": null, "publishedAt": "2020-04-25T13:04:46Z", "content": "Leur « restart project », proposé avec le soutien de plusieurs actionnaires de club, prévoit un maximum de 400 personnes par stade, obligatoirement testées négatives au virus pour pouvoir être présentes dans des enceintes elles-mêmes soigneusement sélectionné… [+114 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/profile.php?id=100010643894333", "title": "Selon un avocat spécialisé, un joueur en fin de contrat le 30 juin “sera libre de ne pas prolonger” - Canal Supporters", "description": "Pour Sevan Karian les joueurs en fin de contrat le 30 juin ne seront pas obligés de prolonger jusqu’à la fin des championnats.", "url": "https://canal-supporters.com/2020/04/pour-un-avocat-specialise-en-droit-du-sport-un-joueur-en-fin-de-contrat-le-30-juin-sera-libre-de-ne-pas-signer-une-prolongation-jusqua-la-fin-de-la-saison-2019-2020/", "urlToImage": null, "publishedAt": "2020-04-25T13:02:56Z", "content": "C’est l’une des questions qui agitent le monde du football au moment où des dates de reprises sont évoquées. Comment gérer les joueurs en fin de contrat le 30 juin2020 ? Pour rappel, cela concerne neuf joueurs au PSG. Dans les colonnes de Ouest FranceSevan Ka… [+977 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "F.H. avec AFP", "title": "Chelsea aurait levé l’option pour prolonger Olivier Giroud d’un an - 20 Minutes", "description": "L’attaquant de l’équipe de France débutera-t-il le championnat anglais sur le banc comme lors de la saison 2019-2020 ?", "url": "https://www.20minutes.fr/sport/2767667-20200425-chelsea-leve-option-prolonger-olivier-giroud-an", "urlToImage": null, "publishedAt": "2020-04-25T13:02:25Z", "content": "Olivier Giroud. (Illustration) Mark Greenwood/IPS/REX/SIPA\r\nQuel rôle va lui donner Frank Lampard ? Titulaire ou remplaçant ? Selon lAFP, Chelsea a levé loption pour prolonger dun an \r\nOlivier Giroud. Lattaquant de \r\nl'équipe de France est lié au club londoni… [+699 chars]"}, {"source": {"id": null, "name": "Maxifoot.fr"}, "author": null, "title": "Mercato - PSG : Icardi recruté puis revendu ? L'Inter a anticipé le coup - Maxifoot", "description": "Prêté cette saison, Mauro Icardi pourrait définitivement être recruté pour 70 millions d'euros par le Paris Saint-Germain.  ...", "url": "http://www.maxifoot.fr/football/article-43526.htm", "urlToImage": null, "publishedAt": "2020-04-25T12:58:00Z", "content": "Prêté cette saison, Mauro Icardi pourrait définitivement être recruté pour 70 millions d'euros par le Paris Saint-Germain. Alors que des rumeurs évoquent une possible revente dans la foulée de l'attaquant argentin, l'Inter Milan a pris le soin de surveiller s… [+1765 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "T.M.", "title": "Mercato - PSG : Mourinho aurait lâché un énorme conseil à Thomas Meunier ! - Le 10 Sport", "description": "Pour convaincre de Thomas Meunier de le rejoindre à Tottenham, José Mourinho aurait personnellement appelé Thomas Meunier. Une discussion durant laquelle le Special One aurait lâché un message fort…", "url": "https://le10sport.com/football/mercato/mercato-psg-mourinho-aurait-lache-un-enorme-conseil-a-thomas-meunier-501090", "urlToImage": null, "publishedAt": "2020-04-25T12:15:00Z", "content": "Publié le 25 avril 2020 à 14h15 par T.M. Pour convaincre de Thomas Meunier de le rejoindre à Tottenham, José Mourinho aurait personnellement appelé Thomas Meunier. Une discussion durant laquelle le Special One aurait lâché un message fort au Belge.\r\nOù sécrir… [+1316 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "A.C.", "title": "Mercato - OM : L’avenir de Thauvin réglé... pour moins de 20M€ ? - Le 10 Sport", "description": "Il y a un club de Serie A qui semble particulièrement déterminé pour Florian Thauvin, sous contrat avec l’Olympique de Marseille jusqu’en 2021.", "url": "https://le10sport.com/football/mercato/mercato-om-lavenir-de-thauvin-regle-pour-moins-de-20meur-501064", "urlToImage": null, "publishedAt": "2020-04-25T12:00:00Z", "content": "Publié le 25 avril 2020 à 14h00 par A.C. Il y a un club de Serie A qui semble particulièrement déterminé pour Florian Thauvin, sous contrat avec lOlympique de Marseille jusquen 2021. \r\nAprès léchec anglais, Florian Thauvin pourrait retenter une nouvelle fois … [+1132 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Max Franco Sanchez", "title": "PSG : Wagner Ribeiro fait des révélations fracassantes sur l'avenir de Neymar - Foot Mercato", "description": "Wagner Ribeiro, agent proche du clan Neymar et qui a participé à différentes opérations autour du joueur, s'est exprimé sur l'avenir du joueur du PSG au Brésil.", "url": "https://www.footmercato.net/a548476582556551850-psg-wagner-ribeiro-fait-des-revelations-fracassantes-sur-lavenir-de-neymar", "urlToImage": null, "publishedAt": "2020-04-25T11:51:51Z", "content": "En Espagne, il n'y a pas un jour sans que la presse catalane ne dévoile de nouvelles informations sur Neymar. Ce n'est un secret pour personne, Josep Maria Bartomeu et ses équipes veulent tout faire pour rapatrier leur ancien numéro 11, parti en 2017 après un… [+2121 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/profile.php?id=100010643894333", "title": "Aulas : “Notre volonté c’est évidemment d’essayer de garder Aouar” - Canal Supporters", "description": "Jean-Michel Aulas explique que Lyon souhaite conserver Houssem Aouar, pisté par le PSG, La Juve et Manchester City.", "url": "https://canal-supporters.com/2020/04/aulas-notre-volonte-cest-evidemment-dessayer-de-garder-aouar/", "urlToImage": null, "publishedAt": "2020-04-25T11:50:34Z", "content": "Hier, RMC Sport expliquait que le PSG – avec Manchester City et Juventus Turin – était intéressé par le recrutement d’Houssem Aouar. Il y a plusieurs semaines, Canal Supporters vous avait informé dun rapprochement entre le PSG et le milieu lyonnais. Jamais av… [+616 chars]"}, {"source": {"id": null, "name": "Dailymercato.com"}, "author": "", "title": "Mercato PSG : Tebas démonte la rumeur Neymar au Barça - Daily Mercato", "description": "Pr&eacute;sident de LaLiga, Javier Tebas a donn&eacute; son avis sur les rumeurs envoyant Neymar et Lautaro Martinez au Bar&ccedil;a. Selon le dirigea...", "url": "https://www.dailymercato.com/news/mercato-psg-tebas-demonte-la-rumeur-neymar-au-barca", "urlToImage": null, "publishedAt": "2020-04-25T11:32:34Z", "content": "Président de LaLiga, Javier Tebas a donné son avis sur les rumeurs envoyant Neymar et Lautaro Martinez au Barça. Selon le dirigeant espagnol, tout cela n'est que du pipeau.La presse catalane a beau s'efforcer de faire vivre la rumeur d'un retour de Neymar au … [+1291 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "ASSE : Offrir un ticket européen à Lyon, Caïazzo tousse - Foot01.com", "description": "L'AS Saint-Etienne ne pourra pas offrir le stade de France au Peuple Vert, mais priver l'OL d'un ticket européen sera un vrai plaisir.\r\nCe samedi 25 avril 2020 devait être une date marquante dans la longue histoire de l’AS Saint-Etienne, puisque les Verts…", "url": "https://www.foot01.com/equipe/st-etienne/asse-offrir-un-ticket-europeen-a-lyon-caiazzo-tousse,347939", "urlToImage": null, "publishedAt": "2020-04-25T11:08:55Z", "content": "L'AS Saint-Etienne ne pourra pas offrir le stade de France au Peuple Vert, mais priver l'OL d'un ticket européen sera un vrai plaisir.\r\nCe samedi 25 avril 2020 devait être une date marquante dans la longue histoire de lAS Saint-Etienne, puisque les Verts deva… [+1421 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Ziyech ne digère pas pour le titre / Pays-Bas / Ajax / SOFOOT.com - SO FOOT", "description": "Hakim ne sera pas suprême leader, cette saison. À égalité de points avec l'AZ Alkmaar mais premier d'Eredivise grâce à la différence de buts, ...", "url": "https://www.sofoot.com/hakim-ziyech-ne-digere-pas-que-le-titre-passe-sous-le-nez-de-l-ajax-amsterdam-482662.html", "urlToImage": null, "publishedAt": "2020-04-25T11:00:00Z", "content": "Hakim ne sera pas suprême leader, cette saison.À égalité de points avec l'AZ Alkmaar mais premier d'Eredivise grâce à la différence de buts, l'Ajax Amsterdam ne sera pas sacré champion. Le championnat hollandais a définitivement été interrompu, et c'est le sc… [+1082 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Max Franco Sanchez", "title": "Eredivisie : l'annulation du championnat fait polémique - Foot Mercato", "description": "La décision d'annuler la saison fait beaucoup parler aux Pays-Bas, où de nombreux joueurs et clubs s'estiment lésés et désavantagés.", "url": "https://www.footmercato.net/a7504463592023464225-eredivisie-lannulation-du-championnat-fait-polemique", "urlToImage": null, "publishedAt": "2020-04-25T10:54:25Z", "content": "C'est le premier championnat de l'ouest-européen qui a déjà fait savoir qu'il ne reprendra pas. Alors que le gouvernement avait annoncé l'annulation des différents événements sportifs et culturels à travers le pays plus tôt dans la semaine, la Fédération Néer… [+3055 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Expulsé pendant le Tournoi, Haouas a purgé sa suspension pendant le confinement - Le Figaro", "description": "Expulsé lors de la rencontre du Tournoi Ecosse-France le 8 mars dernier pour un coup de poing sur le deuxième ligne du XV au Chardon Jamie Ritchie, Mohamed Haouas avait écopé d'une suspension de trois semaines. Bonne nouvelle pour le joueur de Montpellier : c…", "url": "https://sport24.lefigaro.fr/rugby/top-14/fil-info/expulse-pendant-le-tournoi-haouas-a-purge-sa-suspension-pendant-le-confinement-1000260", "urlToImage": null, "publishedAt": "2020-04-25T10:46:00Z", "content": "Expulsé lors de la rencontre du Tournoi Ecosse-France le 8 mars dernier pour un coup de poing sur le deuxième ligne du XV au Chardon Jamie Ritchie, Mohamed Haouas avait écopé d'une suspension de trois semaines. Bonne nouvelle pour le joueur de Montpellier : c… [+746 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Yannick Sagorin", "title": "Ce qu’ont versé Canal+ et beIN Sports à la LFP - Sports.fr", "description": "Les groupes Canal+ et beIN Sports ont obtenu une belle ristourne auprès de la LFP pour les matches de championnat déjà diffusés. Les négociations des présidents Nasser al-Khelaïfi (PSG), Jacques-Henri Eyraud (OM), Olivier Sadran (Toulouse) et Jean-Pierre Rivè…", "url": "https://www.sports.fr/football/quont-verse-canal-bein-sports-a-lfp-349556.html", "urlToImage": null, "publishedAt": "2020-04-25T10:44:47Z", "content": "Les groupes Canal+ et beIN Sports ont obtenu une belle ristourne auprès de la LFP pour les matches de championnat déjà diffusés.\r\nLes négociations des présidents Nasser al-Khelaïfi (PSG), Jacques-Henri Eyraud (OM), Olivier Sadran (Toulouse) et Jean-Pierre Riv… [+857 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "PSG : Neymar surclasse Mbappé, Kylian va adorer - Foot01.com", "description": "Pour l’entraîneur de l’AS Monaco Robert Moreno, il n’y a pas photo entre Neymar et Kylian Mbappé. Le technicien estime le Brésilien supérieur et surtout plus complet.\r\nArrivé en tant que joueur le plus cher de l’histoire, Neymar s’est fait voler la vedette…", "url": "https://www.foot01.com/equipe/paris/psg-neymar-surclasse-mbappe-kylian-va-adorer,347915", "urlToImage": null, "publishedAt": "2020-04-25T10:36:47Z", "content": "Pour lentraîneur de lAS Monaco Robert Moreno, il ny a pas photo entre Neymar et Kylian Mbappé. Le technicien estime le Brésilien supérieur et surtout plus complet.\r\nArrivé en tant que joueur le plus cher de lhistoire, Neymar sest fait voler la vedette au Pari… [+1228 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Les Herbiers : que sont devenus les finalistes de la Coupe de France 2018 face au PSG ? - Foot - Coupe - Les Herbiers - L'Équipe.fr", "description": "Deux ans après la finale de Coupe de France perdue par le club vendéen face au PSG (0-2), retour sur les trajectoires empruntées par les protagonistes de l'épopée.", "url": "https://www.lequipe.fr/Football/Actualites/Les-herbiers-que-sont-devenus-les-finalistes-de-la-coupe-de-france-2018-face-au-psg/1129404", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": "Ils devaient se retrouver à la fin du mois de mai pour fêter les 70 ans du club. En raison de la pandémie de Covid-19, les Herbretais ne pourront pas célébrer de nouveau leur exploit mais ils ont, de toute façon, laissé une trace. C'était il y a deux ans : co… [+10018 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Bixente Lizarazu : « En 1998, on avait un mutant, Zinédine Zidane » - Foot - CM - Bleus - L'Équipe.fr", "description": "Dans le cadre d'un échange avec les abonnés de L'Équipe, Bixente Lizarazu a fait un comparatif entre les Bleus de 1998 et ceux de 2018.", "url": "https://www.lequipe.fr/Football/Actualites/Bixente-lizarazu-en-1998-on-avait-un-mutant-zinedine-zidane/1129667", "urlToImage": null, "publishedAt": "2020-04-25T09:55:01Z", "content": "Dans le cadre d'un échange avec les abonnés de L'Équipe jeudi, Bixente Lizarazu s'est lancé dans un comparatif entre l'équipe de France 1998 et celle de 2018, toutes les deux championnes du monde. « On était plus forts en défense, on était plus expérimentés. … [+137 chars]"}, {"source": {"id": null, "name": "Football365.fr"}, "author": "Axel Allag", "title": "Courtisé par le Real Madrid, Mbappé serait agacé par le PSG - Football365", "description": "Kylian Mbappé aurait une relation assez froide avec le PSG et n'aurait pas apprécié les dernières informations parues dans les médias à son sujet.", "url": "https://www.football365.fr/courtise-real-madrid-mbappe-serait-agace-psg-9821501.html", "urlToImage": null, "publishedAt": "2020-04-25T09:40:26Z", "content": "Kylian Mbappé ne cesse de faire parler. Que ce soit du côté de Paris, de Madrid, et dans le monde du football en général. Le Real Madrid, d’ailleurs, envisage l’éventuel transfert de Mbappé au Santiago Bernabeu de façon optimiste étant donné que le contrat du… [+1023 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "OM : Eyraud paye les employés de sa poche à Marseille ! - Foot01.com", "description": "Voilà une révélation surprenante qui démontre qu’à l’OM, malgré les difficultés financières, les petits salaires ne sont pas à l’abandon.\r\n Parmi les premières mesures prises par les clubs face à l’arrêt des matchs et donc de nombreuses rentrées d’argent…", "url": "https://www.foot01.com/equipe/marseille/om-eyraud-paye-les-employes-de-sa-poche-a-marseille,347899", "urlToImage": null, "publishedAt": "2020-04-25T09:31:15Z", "content": "Voilà une révélation surprenante qui démontre quà lOM, malgré les difficultés financières, les petits salaires ne sont pas à labandon.\r\n Parmi les premières mesures prises par les clubs face à larrêt des matchs et donc de nombreuses rentrées dargent, lensembl… [+1437 chars]"}, {"source": {"id": null, "name": "Rugbyrama.fr"}, "author": "Rugbyrama", "title": "Transferts - Pau : Smith prolonge, Slade vers le Japon - Rugbyrama.fr", "description": "TRANSFERTS - Cette semaine, la Section paloise a officialisé l’avenir de ses deux doubles champions du monde All Blacks, Conrad Smith et Colin Slade.", "url": "https://www.rugbyrama.fr/rugby/transferts/2018-2019/transferts-pau-smith-prolonge-slade-vers-le-japon_sto7734434/story.shtml", "urlToImage": null, "publishedAt": "2020-04-25T09:15:41Z", "content": "Pour le trois-quarts centre Conrad Smith, qui depuis deux saisons intervient en tant quentraîneur adjoint chargé des trois-quarts aux prérogatives assez large, son contrat a été prolongé pour deux années supplémentaire. Le travail de lavocat de formation est … [+363 chars]"}, {"source": {"id": null, "name": "Sudouest.fr"}, "author": "Sud Ouest", "title": "Pro D2 / Stade Montois Rugby : plusieurs départs de joueurs et une arrivée - Sud Ouest", "description": "Le départ de huit joueurs est déjà acquis, alors que le jeune Simon Desaubies va être prêté au club landais par Bordeaux-Bègles", "url": "https://www.sudouest.fr/2020/04/24/pro-d2-stade-montois-rugby-plusieurs-departs-de-joueurs-et-une-arrivee-7437638-4567.php", "urlToImage": null, "publishedAt": "2020-04-25T08:41:53Z", "content": "Alors que la saison de Pro D2 est définitivement terminée pour lui, le Stade Montois s’est muré dans le silence. Tant au sujet de ses entraîneurs David Auradou et David Darricarrère, qui se dirigent vers un départ anticipé, que de son effectif.\r\n&gt;&gt; Retr… [+1128 chars]"}, {"source": {"id": null, "name": "Rugbyrama.fr"}, "author": "Leo Faure", "title": "International - Suspendu pour dix matchs, Joe Marler n'en purgera finalement aucun - Rugbyrama.fr", "description": "INTERNATIONAL - L'affaire a fait sourire sur la forme, puis débattre sur le fond. Auteur d'un geste facétieux pour certains, déplacé pour d'autres (il avait touché le sexe de Alun Wyn Jones en plein match du Tournoi des 6 nations) Joe Marler avait écopé de 10…", "url": "https://www.rugbyrama.fr/rugby/international/2018-2019/international-suspendu-pour-dix-matchs-joe-marler-n-en-purgera-finalement-aucun_sto7734448/story.shtml", "urlToImage": null, "publishedAt": "2020-04-25T08:40:06Z", "content": "« Joe Marler sera libre de jouer dès que le rugby reprendra ses droits. » C'est par ces mots que le Times débute son article. Selon les informations du quotidien anglais, le pilier des Harlequins, qui avait écopé de dix semaines de suspension pour avoir « pin… [+1266 chars]"}, {"source": {"id": null, "name": "Topmercato.com"}, "author": null, "title": "OM : un ailier de Ligue 2 sur les tablettes ? - Top Mercato.com", "description": "La direction de l'Olympique de Marseille s'intéresse à un milieu de terrain offensif qui évolue à l'étage inférieur....", "url": "http://www.topmercato.com/219584,1/om---un-ailier-de-ligue-2-sur-les-tablettes.html", "urlToImage": null, "publishedAt": "2020-04-25T08:26:00Z", "content": "La direction de l'Olympique de Marseille s'intéresse à un milieu de terrain offensif qui évolue à l'étage inférieur.D'après les informations de France Football, le club des Bouches-du-Rhône a pris des renseignements sur Jimmy Cabot, l'ailier du FC Lorient. Le… [+359 chars]"}, {"source": {"id": null, "name": "Maxifoot.fr"}, "author": null, "title": "Mercato : changement de programme pour Sancho ? - Maxifoot", "description": "Promis à Manchester United, Jadon Sancho pourrait finalement rester au Borussia Dortmund une saison supplémentaire. En effet, le club allemand d&e ...", "url": "http://www.maxifoot.fr/football/article-43524.htm", "urlToImage": null, "publishedAt": "2020-04-25T08:20:00Z", "content": "Promis à Manchester United, Jadon Sancho pourrait finalement rester au Borussia Dortmund une saison supplémentaire. En effet, le club allemand désire profiter de la crise actuelle pour inciter l'ailier anglais à poursuivre sa carrière du côté du Signal Iduna … [+2457 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Max Franco Sanchez", "title": "Arsenal : les prétendants d'Aubameyang se frottent les mains - Foot Mercato", "description": "Selon la presse britannique, le club de la capitale anglaise pourrait être contraint de vendre son attaquant vedette au rabais lors du prochain mercato.", "url": "https://www.footmercato.net/a8421960661787500460-arsenal-les-pretendants-daubameyang-se-frottent-les-mains", "urlToImage": null, "publishedAt": "2020-04-25T08:16:29Z", "content": "Si la crise financière liée à l'arrêt total du football frappe tous les clubs sans exception, certains sont forcément plus touchés que d'autres. En Espagne par exemple, le Real Madrid semble s'en sortir bien mieux que ses rivaux, le FC Barcelone et l'Atlético… [+2294 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Michael Balcaen", "title": "Arthur, ce joueur qui pourrait rapporter gros au Barça - Sports.fr", "description": "Le Barça n’est pas vendeur pour Arthur. Mais les propositions affluent pour le milieu de terrain brésilien. Et la Juve n’est pas la moins bien placée dans ce dossier.  Et si le Barça n’était pas meilleur pour vendre des joueurs dont elle ne veut pas se sépare…", "url": "https://www.sports.fr/football/arthur-joueur-pourrait-rapporter-gros-barca-349544.html", "urlToImage": null, "publishedAt": "2020-04-25T08:11:02Z", "content": "Le Barça n’est pas vendeur pour Arthur. Mais les propositions affluent pour le milieu de terrain brésilien. Et la Juve n’est pas la moins bien placée dans ce dossier. \r\nEt si le Barça n’était pas meilleur pour vendre des joueurs dont elle ne veut pas se sépar… [+1127 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Cyril Morin", "title": "OL - Jean-Michel Aulas : \"Marseille souhaite évidemment qu’on s’arrête là…\" - Eurosport - FRANCE (FR)", "description": "Jean-Michel Aulas a de nouveau évoqué les possibles solutions qui s’offrent à la Ligue 1, fortement impactée par la pandémie de Covid-19. En évoquant l'OM...", "url": "https://www.eurosport.fr/football/ligue-1/2019-2020/ol-jean-michel-aulas-marseille-souhaite-evidemment-quon-sarrete-la._sto7734415/story.shtml", "urlToImage": null, "publishedAt": "2020-04-25T08:08:55Z", "content": "Jean-Michel Aulas ne désarme pas. Toujours aussi présent dans les médias, le président lyonnais était linvité vendredi dOLTV pour évoquer la suite des opérations en Ligue 1, notamment après le communiqué de lUEFA jeudi, \r\nflou mais pas forcément rassurant pou… [+1263 chars]"}, {"source": {"id": null, "name": "Welovetennis.fr"}, "author": null, "title": "ATP > Wilander : \"Cette pause est un avantage pour des joueurs comme Roger Federer\" - We Love Tennis !", "description": "Logiquement l’ex-joueur suédois qui est confiné tranquillement aux Etats-Unis a été intérrogé par la très sérieuse agence Reuters sur la récente idée de fusion entre l’ATP et la WTA. Mais aussi sur les conséquences de la situation actuelle au niveau sportif e…", "url": "https://www.welovetennis.fr/atp/wilander-cette-pause-est-un-avantage-pour-des-joueurs-comme-roger-federer", "urlToImage": null, "publishedAt": "2020-04-25T08:07:27Z", "content": "Logiquement l’ex-joueur suédois qui est confiné tranquillement aux Etats-Unis a été intérrogé par la très sérieuse agence Reuters sur la récente idée de fusion entre l’ATP et la WTA. Mais aussi sur les conséquences de la situation actuelle au niveau sportif e… [+531 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Coronavirus : les joueurs d'Amiens ont été testés vendredi - Foot - Coronavirus - Amiens - L'Équipe.fr", "description": "Les joueurs d'Amiens ont effectué des tests PCR et sérologiques dans le cadre d'une prochaine reprise de l'entraînement.", "url": "https://www.lequipe.fr/Football/Actualites/Coronavirus-les-joueurs-d-amiens-ont-ete-testes-vendredi/1129652", "urlToImage": null, "publishedAt": "2020-04-25T08:07:13Z", "content": "En cours d'élaboration avec la Commission médicale de la FFF et les médecins des clubs professionnels, un protocole prévoit un retour des joueurs au centre d'entraînement la semaine du 11 mai pour effectuer un bilan médical complet (cardiologique, virologique… [+76 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Naming du Camp Nou : un premier candidat connu pour le stade du Barça - Foot - ESP - FC Barcelone - L'Équipe.fr", "description": "Le milliardaire britannique Alkiviades David a révélé avoir discuté avec le FC Barcelone au sujet d'un éventuel partenariat pour la saison prochaine.", "url": "https://www.lequipe.fr/Football/Actualites/Naming-du-camp-nou-un-premier-candidat-connu-pour-le-stade-du-barca/1129638", "urlToImage": null, "publishedAt": "2020-04-25T07:24:24Z", "content": "L'entrepreneur d'origine grecque, né au Nigéria, pourrait faire l'acquisition des droits liés au nom de l'enceinte blaugrana avec son entreprise de streaming « FilmOn TV » ou plus probablement sa société pharmaceutique « Swissx ». « Le contact s'est établi en… [+276 chars]"}, {"source": {"id": null, "name": "Basketusa.com"}, "author": "Jonathan Demay", "title": "Un documentaire à venir sur la dernière saison de Kobe Bryant avec des images inédites ? - BasketUSA", "description": "Une équipe a également suivi l'arrière des Lakers lors de sa dernière saison en NBA, en 2015-2016, avec une grande liberté. Un documentaire, à la façon de \"The Last Dance\", serait en préparation.", "url": "https://www.basketusa.com/news/593881/un-documentaire-a-venir-sur-la-derniere-saison-de-kobe-bryant-avec-des-images-inedites/", "urlToImage": null, "publishedAt": "2020-04-25T07:21:55Z", "content": "Le documentaire « The Last Dance » permet de ressortir des tiroirs des informations qui n’avaient pas filtré jusqu’alors. On a par exemple appris que les Warriors, en 2018-2019, avaient refusé d’être filmés comme les Bulls.\r\nMaintenant, c’est ESPN qui nous in… [+1203 chars]"}, {"source": {"id": null, "name": "Maxifoot.fr"}, "author": null, "title": "Barça : Setién sait comment relancer Coutinho - Maxifoot", "description": "Trop irrégulier pendant son prêt au Bayern Munich cette saison, Philippe Coutinho ne sera pas conservé. Une mauvaise nouvelle pour les dirig ...", "url": "http://www.maxifoot.fr/football/article-43523.htm", "urlToImage": null, "publishedAt": "2020-04-25T07:14:00Z", "content": "Trop irrégulier pendant son prêt au Bayern Munich cette saison, Philippe Coutinho ne sera pas conservé. Une mauvaise nouvelle pour les dirigeants du FC Barcelone qui souhaitent s'en séparer. Mais pas forcément pour l'entraîneur Quique Setién, persuadé de pouv… [+2743 chars]"}, {"source": {"id": null, "name": "Rugbyrama.fr"}, "author": "Rugbyrama", "title": "Coupe d’Europe : les finales le 17 et 18 octobre prochain ? - Rugbyrama.fr", "description": "L’EPCR, l’instance qui organise les Coupe d’Europe de rugby a planché sur un nouveau calendrier de fin de compétition de la saison 2019-2020 à l’automne prochain.", "url": "https://www.rugbyrama.fr/rugby/champions-cup/2019-2020/coupe-deurope-les-finales-le-17-et-18-octobre-prochain_sto7734390/story.shtml", "urlToImage": null, "publishedAt": "2020-04-25T07:03:38Z", "content": "Les quarts de finales pourraient être joués le weekend du 12 et 13 septembre, les demies quinze jours plus tard et les finales (de Challenge Cup et Champions Cup) les 17 et 18 octobre prochain.\r\nCes rencontres étaient programmées initialement le 23 et 23 mai … [+351 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "« L'Équipe Explore » : L'audacieux périple de deux jeunes guides de montagne raconté dans un documentaire numérique - Alpinisme - Documentaire - L'Équipe.fr", "description": "Montées en cordée, descentes à skis : au printemps dernier, Vivian Bruchez et Mathéo Jacquemoud, deux jeunes guides de haute montagne, ont entrepris un audacieux périple sur les sommets légendaires des Alpes. Un feuilleton numérique en a été tiré. Que vous po…", "url": "https://www.lequipe.fr/Adrenaline/Alpinisme/Actualites/-l-equipe-explore-l-audacieux-periple-de-deux-jeunes-guides-de-montagne-raconte-dans-un-documentaire-numerique/1129632", "urlToImage": null, "publishedAt": "2020-04-25T06:50:00Z", "content": "Aujourd'hui, comme nous tous, ils vivent en reclus. Mais, et ils en ont bien conscience, leur enfermement est sans doute plus léger que d'autres. Vivian Bruchez, 33 ans, et Mathéo Jacquemoud, quatre ans de moins, vivent au pied de ces massifs qui protègent de… [+7519 chars]"}, {"source": {"id": null, "name": "Rugbyrama.fr"}, "author": "Rugbyrama", "title": "L'EPCR met la pression sur World Rugby, clap de fin pour Barnes... Les 5 infos de ce vendredi - Rugbyrama.fr", "description": "L'EPCR ne veut pas de matchs internationaux  cet automne, Berrick Barnes prend sa retraite à 33 ans, Sale condamné à une amende de 23 000 €.", "url": "https://www.rugbyrama.fr/rugby/l-epcr-met-la-pression-sur-world-rugby-clap-de-fin-pour-barnes.-les-5-infos-de-ce-vendredi_sto7734240/story.shtml", "urlToImage": null, "publishedAt": "2020-04-25T06:49:58Z", "content": "L'EPCR entre en conflit avec World Rugby\r\nLEPCR, linstance européenne qui gère les Coupes dEurope ne veut pas dune reprise du calendrier international cet automne. Elle la fait savoir à World Rugby par lintermédiaire de son président Simon Halliday : \"Nous na… [+2576 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Oriane Alcarini", "title": "Hugo Lloris confiné avec ses trois enfants, \"une source d'évasion\" - Pure People", "description": "Hugo Lloris (33 ans) a raconté son confinement au \"Parisien\", le 23 avril 2020. Le footballeur français dit s'occuper activement de sa petite famille, lui qui est papa d'un tout jeune Léandro (7 mois).", "url": "https://www.purepeople.com/article/hugo-lloris-confine-avec-ses-trois-enfants-une-source-d-evasion_a385670/1", "urlToImage": null, "publishedAt": "2020-04-25T06:45:00Z", "content": "Au cours d'un long entretien accordé au Parisien, Hugo Lloris s'est confié sur son confinement, qu'il vit à Londres et en famille. Le capitaine des Bleus s'agace d'abord de se faire narguer par un merveilleux ciel bleu. \"En huit ans à Londres, je n'ai jamais … [+1611 chars]"}, {"source": {"id": null, "name": "Basketusa.com"}, "author": "Fabrice Auclert", "title": "Draft 2020 : le Français Yves Pons va tester sa cote - BasketUSA", "description": "Meilleur défenseur de sa conférence, l'ailier de Tennessee s'est inscrit à la Draft 2020 mais il se donne la possibilité de faire marche arrière.", "url": "https://www.basketusa.com/news/593880/draft-2020-le-francais-yves-pons-va-tester-sa-cote/", "urlToImage": null, "publishedAt": "2020-04-25T06:40:01Z", "content": "Élu « Defensive Player of the Year » de la SEC, Yves Pons (1m98, 21 ans) annonce à nos confrères d’Envergure qu’il s’est inscrit à la Draft, mais qu’il se laisse la possibilité d’effectuer sa quatrième et dernière année à Tennessee. \r\nEn clair, l’ailier franç… [+376 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "\"Les années à venir du sport féminin ne vont pas être sympathiques\" : les sportives redoutent de subir les premières les conséquences du coronavirus - franceinfo", "description": "", "url": "https://www.francetvinfo.fr/sante/maladie/coronavirus/les-annees-a-venir-du-sport-feminin-ne-vont-pas-etre-sympathiques-les-sportives-redoutent-de-subir-les-premiers-les-consequences-du-coronavirus_3932703.html", "urlToImage": null, "publishedAt": "2020-04-25T06:24:41Z", "content": "Avec son lot dannulations de compétitions, de baisse des salaires ou de partenaires qui rompent leurs contrats publicitaires, clubs féminins et sportives craignent dêtre les premiers à payer les pots cassés.\r\nLes conséquences de la crise du coronavirus Covid-… [+2625 chars]"}, {"source": {"id": null, "name": "Nextgen-auto.com"}, "author": "Emmanuel Touzot", "title": "Leclerc : Ce serait bien de courir contre Verstappen en ligne - Nextgen-Auto.com", "description": "Formule 1 | Charles Leclerc court avec six autres pilotes lors des courses officielles virtuelles de la F1, et d'autres devraient rejoindre le groupe, mais (...)", "url": "https://motorsport.nextgen-auto.com/fr/formule-1/leclerc-ce-serait-bien-de-courir-contre-verstappen-en-ligne,148020.html", "urlToImage": null, "publishedAt": "2020-04-25T06:12:00Z", "content": "Charles Leclerc court avec six autres pilotes lors des courses officielles virtuelles de la F1, et d’autres devraient rejoindre le groupe, mais Max Verstappen n’en fera pas partie, bien qu’il soit un aficionado des compétitions en ligne.\r\n\"Je ne sais pas trop… [+1147 chars]"}, {"source": {"id": null, "name": "Lensois.com"}, "author": null, "title": "Arnaud Pouille : « Remettre le RC Lens à sa place dans l’échiquier du football » - Lensois.com", "description": "Président et actionnaire du RC Lens, Joseph Oughourlian s’apprête à procéder à une augmentation de capital. Un investissement de plusieurs millions d’euros est prévu. Directeur général du RCL, Arnaud Pouille explique le projet Sang et Or dans une longue inter…", "url": "https://www.lensois.com/arnaud-pouille-remettre-le-rc-lens-sa-place-dans-lechiquier-du-football/", "urlToImage": null, "publishedAt": "2020-04-25T06:00:48Z", "content": "Président et actionnaire du RC Lens, Joseph Oughourlian sapprête à procéder à une augmentation de capital. Un investissement de plusieurs millions deuros est prévu.\r\nDirecteur général du RCL, Arnaud Pouille explique le projet Sang et Or dans une longue interv… [+1880 chars]"}, {"source": {"id": null, "name": "Allezpaillade.com"}, "author": null, "title": "Romain Thomas (SCO): « On est tous avec Junior Sambia » - AllezPaillade.com", "description": "Interrogé par L'Equipe, l'angevin Romain Thomas a évoqué l'hospitalisation de Junior Sambia et ses craintes sur une éventuelle reprise de la Ligue 1: \"Quand j'ai appris que Ju", "url": "https://www.allezpaillade.com/actualites/breves/romain-thomas-sco-on-est-tous-avec-junior-sambia/", "urlToImage": null, "publishedAt": "2020-04-25T05:30:00Z", "content": "Interrogé par L’Equipe, l’angevin Romain Thomas a évoqué l’hospitalisation de Junior Sambia et ses craintes sur une éventuelle reprise de la Ligue 1:\r\n« Quand j’ai appris que Junior Sambia était en réanimation, ça m’a alerté, ça veut dire qu’il a de graves pr… [+649 chars]"}, {"source": {"id": null, "name": "Creusot-infos.com"}, "author": null, "title": "RUGBY : Le Creusot a refusé de monter en Fédérale 1 - Creusot-infos.com", "description": "", "url": "https://www.creusot-infos.com/news/sport/rugby/rugby-le-creusot-a-refuse-de-monter-en-federale-1.html", "urlToImage": null, "publishedAt": "2020-04-25T01:17:00Z", "content": null}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "Th.B.", "title": "Mercato - PSG : Mourinho aurait pris une grande décision pour Ndombele… - Le 10 Sport", "description": "Le PSG et le FC Barcelone s’intéresseraient au profil de Tanguy Ndombele. Entraîneur de Tottenham, José Mourinho n’aurait nullement l’intention de témoigner du départ de l’intention français, comme…", "url": "https://le10sport.com/football/mercato/mercato-psg-mourinho-aurait-pris-une-grande-decision-pour-ndombele-501025", "urlToImage": null, "publishedAt": "2020-04-24T23:45:00Z", "content": "Publié le 25 avril 2020 à 1h45 par Th.B. Le PSG et le FC Barcelone sintéresseraient au profil de Tanguy Ndombele. Entraîneur de Tottenham, José Mourinho naurait nullement lintention de témoigner du départ de lintention français, comme le 10 Sport vous le révé… [+1358 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "Th.B.", "title": "Mercato - Barcelone : Une voie royale pour le Barça avec Timo Werner ? - Le 10 Sport", "description": "Le FC Barcelone penserait à Timo Werner pour renforcer le secteur offensif blaugrana et Liverpool ne serait pas en course pour accueillir le buteur de Leipzig.", "url": "https://le10sport.com/football/mercato/mercato-barcelone-une-voie-royale-pour-le-barca-avec-timo-werner-501022", "urlToImage": null, "publishedAt": "2020-04-24T23:30:00Z", "content": "Foot - Mercato - Barcelone\r\nPublié le 25 avril 2020 à 1h30 par Th.B. Le FC Barcelone penserait à Timo Werner pour renforcer le secteur offensif blaugrana et Liverpool ne serait pas en course pour accueillir le buteur de Leipzig.\r\nEt si le FC Barcelone raflait… [+1261 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Guillaume Maillard-Pacini", "title": "Serie A - Jordan Veretout : \"Il ne faudra pas jouer avec notre santé\" - Eurosport - FRANCE (FR)", "description": "SERIE A - Confiné chez lui avec sa compagne et ses deux enfants depuis maintenant six semaines, Jordan Veretout a accepté de se confier longuement à Eurosport.", "url": "https://www.eurosport.fr/football/serie-a/2019-2020/serie-a-jordan-veretout-rome-c-est-comme-une-ville-morte_sto7733133/story.shtml", "urlToImage": null, "publishedAt": "2020-04-24T22:03:30Z", "content": "En Italie, le confinement a été décrété le 9 mars dernier. Comment le vivez-vous ?\r\nJordan Veretout : C'est un peu long. Je suis avec ma famille et tout le monde est en bonne santé, c'est le principal. Mais c'est certain que la vie d'avant me manque. On espèr… [+6160 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "De nouvelles mesures économiques en faveur du sport - Tous sports - L'Équipe.fr", "description": "A l'issue d'une réunion avec d'autres ministres et divers acteurs du sport, ce vendredi, Roxana Maracineanu a annoncé de nouvelles mesures d'accompagnement pour le secteur.", "url": "https://www.lequipe.fr/Tous-sports/Actualites/De-nouvelles-mesures-economiques-en-faveur-du-sport/1129608", "urlToImage": null, "publishedAt": "2020-04-24T21:27:04Z", "content": "Alors que les inquiétudes se sont renforcées ces derniers jours face à la crise économique générée par l'épidémie de Covid-19, la ministre des Sports Roxana Maracineanu a annoncé dans un tweet, ce vendredi soir, de nouvelles mesures d'accompagnement du secteu… [+577 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "Covid-19 : Gardez vos salaires, Roy Keane dénonce l'arnaque - Foot01.com", "description": "Confrontés à d’énormes pertes financières pendant la crise sanitaire, les clubs négocient des baisses de salaire avec leurs joueurs. Une initiative qui agace l’ancien Mancunien Roy Keane.\r\nEn difficulté sur le plan financier, de nombreux clubs ne se contenten…", "url": "https://www.foot01.com/foot-europeen/covid-19-gardez-vos-salaires-roy-keane-denonce-l-arnaque,347911", "urlToImage": null, "publishedAt": "2020-04-24T21:09:46Z", "content": "Confrontés à dénormes pertes financières pendant la crise sanitaire, les clubs négocient des baisses de salaire avec leurs joueurs. Une initiative qui agace lancien Mancunien Roy Keane.\r\nEn difficulté sur le plan financier, de nombreux clubs ne se contentent … [+1255 chars]"}, {"source": {"id": null, "name": "Parlons-basket.com"}, "author": "Mathieu Seguin", "title": "NBA - Quand Michael Jordan donnait les 4 joueurs modernes qui auraient réussi à son époque - Parlons Basket", "description": "Directement concerné par la génération actuelle de joueurs, Michael Jordan s’était exprimé en 2013 pour lister les joueurs qui auraient pu cartonner à son époque d’après lui. Et il y a forcément du beau monde. Michael Jordan est incontestablement l’homme du m…", "url": "https://www.parlons-basket.com/2020/04/24/nba-quand-michael-jordan-donnait-les-4-joueurs-modernes-qui-auraient-reussi-a-son-epoque/", "urlToImage": null, "publishedAt": "2020-04-24T20:18:00Z", "content": "Directement concerné par la génération actuelle de joueurs, Michael Jordan s’était exprimé en 2013 pour lister les joueurs qui auraient pu cartonner à son époque d’après lui. Et il y a forcément du beau monde.\r\nMichael Jordan est incontestablement l’homme du … [+1973 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Emilie FLORES", "title": "Tous en cuisine avec Cyril Lignac : Estelle Mossely et Tony Yoka dévoilent le sexe de leur second enfant en di - Télé Loisirs.fr", "description": "Invitée à cuisiner en direct avec Cyril Lignac sur M6, Estelle Mossely a dévoilé son baby bump et sa petite famille à l'antenne. Loin de garder le mystère autour de sa grossesse, la boxeuse a dévoilé le sexe de son second enfant.", "url": "https://www.programme-tv.net/news/people/253592-tous-en-cuisine-avec-cyril-lignac-estelle-mossely-et-tony-yoka-devoile-le-sexe-de-leur-second-enfant-en-direct/", "urlToImage": null, "publishedAt": "2020-04-24T18:06:48Z", "content": "Fille ou garçon ? Les fans de boxe ont enfin la réponse. Pour sa nouvelle recette de cuisine en direct sur M6, Cyril Lignac a décidé d'être accompagné d'une flopée de stars. En plus de son co-animateur Jérôme Anthony, Elodie Gossuin et le couple Estelle Mosse… [+1708 chars]"}, {"source": {"id": null, "name": "Topmercato.com"}, "author": null, "title": "Rennes : Camavinga retenu à tout prix si... - Top Mercato.com", "description": "Alors que le Real Madrid prépare son offensive pour Eduardo Camavinga et serait prêt à mettre 60 millions d'euros sur l...", "url": "http://www.topmercato.com/219572,1/rennes---camavinga-retenu-a-tout-prix-si---.html", "urlToImage": null, "publishedAt": "2020-04-24T18:02:00Z", "content": "Article lu 2550 fois - Rédigé le 24 avril 2020 à 20h02 par Romain Boselli"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Sacha Nokovitch", "title": "Les grandes manoeuvres de Mediapro - Foot - Médias - L'Équipe.fr", "description": "Mediapro, future chaîne de la Ligue 1 et de la Ligue 2, élabore actuellement les contours de la grille. Mais le recrutement des journalistes et consultants n'est pas si facile...", "url": "https://www.lequipe.fr/Medias/Article/Les-grandes-manoeuvres-de-mediapro/1129543", "urlToImage": null, "publishedAt": "2020-04-24T17:42:09Z", "content": "Comme tout le monde, Mediapro, futur diffuseur de la Ligue 1 et de la Ligue 2 (huit matches par journée de chaque Championnat), attend de savoir quand la prochaine saison pourra débuter. Le confinement et les incertitudes liées à l'épidémie de Covid-19 ne l'e… [+416 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/profile.php?id=100010643894333", "title": "Larqué : “S’il veut terminer sur une bonne note son extraordinaire carrière, il ne faut pas que Cavani reste au PSG” - Canal Supporters", "description": "Pour Jean-Michel Larqué, Si Edinson Cavani veut finir sur une bonne note son extraordinaire carrière, il doit quitter le PSG.", "url": "https://canal-supporters.com/2020/04/larque-sil-veut-terminer-sur-une-bonne-note-son-extraordinaire-carriere-il-ne-faut-pas-que-cavani-reste-au-psg/", "urlToImage": null, "publishedAt": "2020-04-24T17:05:02Z", "content": "C’est l’un des noms qui revient régulièrement dans l’actualité mercato du PSG. En fin de contrat le 30 juin – où plus certainement quand les compétitions pourront se terminer – Edinson Cavani ne sait pas encore sous quel maillot il jouera la saison prochaine.… [+1018 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Avec l’arrêt de la lutte antidopage, l’inquiétude du sport grandit pour l’après Covid-19 - Le Figaro", "description": "Le confinement actuel laisse planer le risque d’une recrudescence du dopage en l’absence de contrôles. Inquiétant à un an des Jeux olympiques de Tokyo.", "url": "https://sport24.lefigaro.fr/athletisme/actualites/avec-l-arret-de-la-lutte-antidopage-l-inquietude-du-sport-grandit-pour-l-apres-covid-19-1000119", "urlToImage": null, "publishedAt": "2020-04-24T16:42:00Z", "content": "Le confinement actuel laisse planer le risque dune recrudescence du dopage en labsence de contrôles. Inquiétant à un an des Jeux olympiques de Tokyo.«Le bar nest pas ouvert!» Dans un entretien accordé à Europe 1 il y a une semaine, Olivier Niggli, le directeu… [+5209 chars]"}, {"source": {"id": null, "name": "Intensite.net"}, "author": null, "title": "EURE-ET-LOIR - Des excès de vitesse sur les routes euréliennes - Radio Intensité", "description": "Un automobiliste contrôlé en excès de vitesse ce vendredi après-midi à Friaize près de Champrond-en-Gâtine. L'homme, un habitant de la Seine-Saint-Denis, roulait à 160 km/h au lieu des 80 km/h régleme", "url": "https://intensite.net/2009/actu2020/eure-et-loir-des-exces-de-vitesse-sur-les-routes-eureliennes-314434", "urlToImage": null, "publishedAt": "2020-04-24T16:23:13Z", "content": "Pour adresser à Radio Intensité, un communiqué, un commentaire, une précision, ou une info, merci d'utiliser notre formulaire : ICI. ou adressez un mail à redaction@intensite.net.\r\nPour figurer dans notre agenda en ligne gratuitement, il suffit de nous adress… [+197 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "Mercato: Le Bayern Munich fait une offre pour Pierre Kalulu (OL) - RMC Sport", "description": "L'arrière droit de l'Olympique Lyonnais a joué 7 matchs de Youth league cette saison.", "url": "https://rmcsport.bfmtv.com/football/mercato-le-bayern-munich-fait-une-offre-pour-pierre-kalulu-ol-1900312.html", "urlToImage": null, "publishedAt": "2020-04-24T15:43:39Z", "content": null}, {"source": {"id": null, "name": "Football365.fr"}, "author": "Rédaction", "title": "Andrés Iniesta (ex-Barcelone) se confie sur sa dépression - Football365", "description": "Andrés Iniesta est revenu sur la période très difficile qui a suivi le décès de son ami Dani Jarque, tragiquement disparu en 2009.", "url": "https://www.football365.fr/andres-iniesta-ex-barcelone-se-confie-sur-sa-depression-9821138.html", "urlToImage": null, "publishedAt": "2020-04-24T15:30:04Z", "content": "Dans une carrière de footballeur, un traumatisme personnel peut prendre le pas sur les plus belles épopées sportives. Il y a onze ans, Barcelone était la meilleure équipe du monde. Le club catalan avait réalisé un fantastique sextuplé venant couronner une cam… [+1317 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Bundesliga : appel aux footballeurs pour qu'ils portent des masques en cas de reprise - Eurosport - FRANCE (FR)", "description": "BUNDESLIGA - Le gouvernement allemand souhaiterait que les joueurs portent des masques en cas de reprise des championnats", "url": "https://www.eurosport.fr/football/bundesliga/2019-2020/budesliga-appel-aux-footballeurs-pour-qu-ils-portent-des-masques-en-cas-de-reprise_sto7734092/story.shtml", "urlToImage": null, "publishedAt": "2020-04-24T15:22:48Z", "content": "BUNDESLIGA - Le ministère allemand du travail souhaite que les footballeurs portent des masques pour se protéger contre le coronavirus si le gouvernement d'Angela Merkel autorise une reprise des championnats en mai comme la Ligue le désire.\r\nLa Ligue allemand… [+2637 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Didier Lacroix (Stade Toulousain) : « Incroyable de reprendre par des phases finales » - Rugby - Top 14 - ST - L'Équipe.fr", "description": "Dans un rendez-vous fixé en ligne aux supporters du Stade Toulousain, le président Didier Lacroix a abordé plusieurs sujets, de la suite du Top 14 aux finances du club en passant par une harmonisation des calendriers.", "url": "https://www.lequipe.fr/Rugby/Actualites/Didier-lacroix-stade-toulousain-incroyable-de-reprendre-par-des-phases-finales/1129476", "urlToImage": null, "publishedAt": "2020-04-24T15:15:16Z", "content": "« Le Stade Toulousain s'acheminait avant l'épisode Covid vers une situation à l'équilibre après des périodes difficiles. Les performances sportives, l'assiduité des supporters, la bonne tenue de nos organisations commerciales (brasserie, boutiques etc.)... To… [+342 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/marc.alvarez1", "title": "Maguire : “La Champions League 19/20 reprendra sous une forme ou une autre” - Canal Supporters", "description": "Les enjeux sont trop importants pour que l'UEFA tire un trait sur la Ligue des champions 2019/2020. Tout sera fait, qu'importe le calendrier,", "url": "https://canal-supporters.com/2020/04/maguire-la-champions-league-19-20-reprendra-sous-une-forme-ou-une-autre/", "urlToImage": null, "publishedAt": "2020-04-24T14:54:14Z", "content": "Les enjeux sont trop importants pour que l’UEFA tire un trait sur la Ligue des champions 2019/2020. Tout sera fait, qu’importe le calendrier, pour que la compétition continentale suspendue depuis la mi-mars aille à son terme. Le spécialiste de l’économie du f… [+1420 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Ligue des champions : La Fédération européenne qualifie directement le PSG pour le Final Four - Eurosport - FRANCE (FR)", "description": "Dans l'incapacité de jouer les huitièmes et quarts de la compétition, la Fédération européenne de handball a décidé de qualifier directement quatre équipes.", "url": "https://www.eurosport.fr/handball/ligue-des-champions/2019-2020/ligue-des-champions-la-federation-europeenne-qualifie-directement-le-psg-pour-le-final-four_sto7734057/story.shtml", "urlToImage": null, "publishedAt": "2020-04-24T14:43:59Z", "content": "Voilà une décision de la Fédération européenne de handball qui ne devrait pas plaire à toutes les équipes encore engagées en Ligue des champions. Dans la un communiqué, la Fédération a décidé d'annuler les huitièmes et quarts de finale de la compétition pour … [+769 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "A.D.", "title": "Mercato - PSG : Leonardo engagé dans une bataille XXL pour Paul Pogba ? - Le 10 Sport", "description": "Leonardo verrait les choses en grand pour espérer attirer Paul Pogba. Toutefois, le Real Madrid, la Juventus et l'Inter, qui seraient également sur les traces du Français, auraient également de…", "url": "https://le10sport.com/football/mercato/mercato-psg-une-bataille-royale-pour-leonardo-avec-paul-pogba-500968", "urlToImage": null, "publishedAt": "2020-04-24T13:45:00Z", "content": "Publié le 24 avril 2020 à 15h45 par A.D. Leonardo verrait les choses en grand pour espérer attirer Paul Pogba. Toutefois, le Real Madrid, la Juventus et l'Inter, qui seraient également sur les traces du Français, auraient également de sérieux arguments à fair… [+1042 chars]"}, {"source": {"id": null, "name": "Foot-national.com"}, "author": "foot-national.com", "title": "Jérémy Ménez : \"Quand Ancelotti vient à tes barbecues...\" - Foot National", "description": "Il y a des coachs qui marquent la carrière, voire la vie, de certains footballeu", "url": "http://www.foot-national.com/foot-jeremy-menez-quand-ancelotti-vient-a-tes-barbecues-132698.html", "urlToImage": null, "publishedAt": "2020-04-24T13:19:31Z", "content": "vendredi 24 avril 2020 à 15:18 -Article écrit par La Rédaction - Réagir à cet article\r\n + DE LIENS :|Compétition \u009bLigue 1 | | Joueurs \u009bMenez Jérémy |\r\nIl y a des coachs qui marquent la carrière, voire la vie, de certains footballeurs. Passé au Paris Saint-Ger… [+860 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "Officiel : L'ASSE prolonge une troisième pépite - Foot01.com", "description": "A chaque jour ou presque sa prolongation de contrat à l’AS Saint-Etienne. Après Wesley Fofana et Charles Abi, c’est Mahdi Camara qui a signé un nouveau bail avec les Verts. Le jeune milieu de terrain, qui fait partie de la génération dorée de l’ASSE,…", "url": "https://www.foot01.com/equipe/st-etienne/officiel-l-asse-prolonge-une-troisieme-pepite,347891", "urlToImage": null, "publishedAt": "2020-04-24T10:41:33Z", "content": "A chaque jour ou presque sa prolongation de contrat à lAS Saint-Etienne. Après Wesley Fofana et Charles Abi, cest Mahdi Camara qui a signé un nouveau bail avec les Verts. Le jeune milieu de terrain, qui fait partie de la génération dorée de lASSE, a su saisir… [+524 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "TV : Marina Lorenzo, la dernière cible de Mediapro - Foot01.com", "description": "Impossible de savoir pour le moment quand la prochaine saison de football démarrera, sachant que l’exercice actuel est à l’arrêt complet. Une situation inédite qui ne semble pas déranger Mediapro, le futur détenteur des droits TV en France pour la Ligue…", "url": "https://www.foot01.com/info/tv-marina-lorenzo-la-derniere-cible-de-mediapro,347875", "urlToImage": null, "publishedAt": "2020-04-24T10:28:58Z", "content": "Impossible de savoir pour le moment quand la prochaine saison de football démarrera, sachant que lexercice actuel est à larrêt complet. Une situation inédite qui ne semble pas déranger Mediapro, le futur détenteur des droits TV en France pour la Ligue 1 et la… [+903 chars]"}, {"source": {"id": null, "name": "Peuple-vert.fr"}, "author": "Alexandre S.", "title": "Exclu PVfr : Claude Puel n'envisage pas de quitter l'ASSE ! ⋆ Peuple-Vert.fr - Foot - ASSE - Actualité - Peuple Vert", "description": "La saison 2019/20 trouvera-t-elle un épilogue ? Rien n'est moins sûr. Cela n'empêche pas Claude Puel et Xavier Thuilot d'imaginer la suite et de préparer la saison 2020/21. Les deux hommes forts du club stéphanois sont concentrés sur la stratégie à mettre en …", "url": "https://peuple-vert.fr/actualite/exclu-pvfr-claude-puel-nenvisage-pas-de-quitter-lasse/", "urlToImage": null, "publishedAt": "2020-04-24T06:12:00Z", "content": "Claude Puel sera-t-il stéphanois la saison prochaine ? Absolument, sauf cataclysme. Quoiqu'il en soit, après les rumeurs qui ont circulé ces dernières heures au sujet d'une éventuelle réflexion des dirigeants de l'ASSE ou de Claude Puel de cesser leur collabo… [+4507 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "Gil Bousquet @Gil_Bousquet", "title": "Top 14 : éviter le scénario du pire - LaDepeche.fr", "description": "Le rugby professionnel est tétanisé par la crise sanitaire. Aucun scénario de sortie de crise stabilisé n’émerge. Les clubs s’inquiètent des conséquences économiques qui pourraient être délétères.", "url": "https://www.ladepeche.fr/2020/04/24/top-14-eviter-le-scenario-du-pire,8860476.php", "urlToImage": null, "publishedAt": "2020-04-24T05:39:11Z", "content": "l'essentiel\r\n Le rugby professionnel est tétanisé par la crise sanitaire. Aucun scénario de sortie de crise stabilisé némerge. Les clubs sinquiètent des conséquences économiques qui pourraient être délétères.\r\n Le chemin de la reprise des matchs de rugby sera… [+4208 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Les Championnats d'Europe à Paris sont annulés - Athlé - ChE - L'Équipe.fr", "description": "Prévus du 25 au 30 août au stade Charléty à Paris, les Championnats d'Europe d'athlétisme n'auront pas lieu cet été en raison de la situation sanitaire. Ils ont été annulés, et non reportés à 2021.", "url": "https://www.lequipe.fr/Athletisme/Actualites/Les-championnats-d-europe-a-paris-sont-annules/1129282", "urlToImage": null, "publishedAt": "2020-04-23T19:06:22Z", "content": "La pandémie de coronavirus aura eu raison des espoirs des athlètes. La Fédération européenne et la Fédération française ont en effet annoncé jeudi en milieu de soirée que les Championnats d'Europe prévus du 25 au 30 août au stade Charléty à Paris étaient annu… [+2558 chars]"}, {"source": {"id": null, "name": "Letemps.ch"}, "author": "Laurent Favre", "title": "Le monde du tennis reprend l'idée de Federer au bond - Le Temps", "description": "Le Bâlois a suggéré mercredi de fusionner l’ATP et la WTA afin d’unir joueurs et joueuses dans la relance du tennis professionnel après la pandémie. Un «premier service» gagnant", "url": "https://www.letemps.ch/node/1206753", "urlToImage": null, "publishedAt": "2020-04-23T17:05:00Z", "content": "Quand les types de 130 millions de dollars de gains disent certaines choses, ceux de 6 millions de dollars les écoutent. Ces derniers jours, Rafael Nadal, Roger Federer et Novak Djokovic se sont pas mal exprimés, alors le monde du tennis a écouté. Surtout Fed… [+3407 chars]"}]}