{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Footmercato.net"}, "author": "Maxime Barbaud", "title": "Les fracassantes déclarations de Diego Costa - Foot Mercato", "description": "Confiné chez lui, Diego Costa en a profité pour accorder une interview. L'attaquant est revenu sur ses brouilles passées, notamment celles avec Antonio Conte du temps de Chelsea, et la polémique autour de son choix de sélection à quelques semaines de la Coupe…", "url": "https://www.footmercato.net/a992159731756507358-les-fracassantes-declarations-de-diego-costa", "urlToImage": null, "publishedAt": "2020-04-26T13:49:03Z", "content": "C'est bien connu, Diego Costa n'a pas la langue dans sa poche. Il avait d'ailleurs débuté cette période de confinement par l'une de ses blagues toujours aussi douteuses : tousser en direction des journalistes tous alignés en zone mixte après la qualification … [+3146 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Et si Raphaël Varane quittait Madrid ? / Espagne / Real Madrid / SOFOOT.com - SO FOOT", "description": "Quand la victoire finit par te lasser. Pourtant bien installé au Real depuis maintenant neuf saisons, Raphaël Varane se questionnerait sur un ...", "url": "https://www.sofoot.com/et-si-raphael-varane-quittait-le-real-madrid-482690.html", "urlToImage": null, "publishedAt": "2020-04-26T13:45:00Z", "content": "Quand la victoire finit par te lasser.Pourtant bien installé au Real depuis maintenant neuf saisons, Raphaël Varane se questionnerait sur un éventuel départ. C'est en tout cas ce que révèle AS ce dimanche.\r\nD'après le média espagnol, le défenseur français, qu… [+1050 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "A.M.", "title": "Mercato - OM : Cette sortie qui en dit long sur les intentions de Frank McCourt... - Le 10 Sport", "description": "Alors que la situation financière de l'Olympique de Marseille ne s'est pas améliorée, Frank McCourt perd beaucoup d'argent comme le souligne Romain Molina qui ne change pas de discours concernant la…", "url": "https://le10sport.com/football/mercato/mercato-om-cette-sortie-qui-en-dit-long-sur-les-intentions-de-frank-mccourt-501224", "urlToImage": null, "publishedAt": "2020-04-26T13:30:00Z", "content": "Publié le 26 avril 2020 à 15h30 par A.M. Alors que la situation financière de l'Olympique de Marseille ne s'est pas améliorée, Frank McCourt perd beaucoup d'argent comme le souligne Romain Molina qui ne change pas de discours concernant la volonté de l'homme … [+1593 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Pouille, l'e-interview avant le Madrid Open Virtual Pro - Tennis - Madrid Open Virtual Pro - L'Équipe.fr", "description": "Le tournoi virtuel de Madrid commence lundi avec la participation de quelques champions du vrai Tour. L'occasion de parler en virtuel avec Lucas Pouille.", "url": "https://www.lequipe.fr/Tennis/Actualites/Pouille-l-e-interview-avant-le-madrid-open-virtual-pro/1129894", "urlToImage": null, "publishedAt": "2020-04-26T13:16:46Z", "content": "Le tournoi Masters 1000 de Madrid sur terre battue aurait dû avoir lieu du 3 au 10 mai. À la place débutera lundi le Madrid open virtual pro, un tournoi e-sport sur console pour pimenter d'un zeste de réalité une bien terne actualité. Seize \"vrais\" joueurs et… [+6612 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Maxime Barbaud", "title": "Nîmes : Romain Philippoteaux tacle Pierre Ménès - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a2015558475467328478-nimes-romain-philippoteaux-tacle-pierre-menes", "urlToImage": null, "publishedAt": "2020-04-26T13:09:39Z", "content": "Le coronavirus touche tout le monde, y compris ceux dont la situation est plutôt avantageuse comme les joueurs de football. Le dernier exemple Junior Sambia (Montpellier), tout juste sorti du coma, en est la parfaite illustration. Voilà pourquoi Romain Philip… [+922 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Dominic Thiem ne souhaite pas contribuer au fonds de solidarité pour les joueurs mal classés - Tennis - Fonds de solidarité - L'Équipe.fr", "description": "Alors qu'un fonds de solidarité a été créé pour venir en aide aux joueurs mal classés, privés de revenus durant l'arrêt de toutes les compétitions, Dominic Thiem fait entendre une voix discordante avec la solidarité générale.", "url": "https://www.lequipe.fr/Tennis/Actualites/Dominic-thiem-ne-souhaite-pas-contribuer-au-fonds-de-solidarite-pour-les-joueurs-mal-classes/1129889", "urlToImage": null, "publishedAt": "2020-04-26T13:00:20Z", "content": "Alors que le monde du tennis s'est organisé pour venir en aide aux joueurs les plus mal classés, privés de tout revenu durant la période de confinement actuelle, l'Autrichien a fait valoir un avis qui tranche avec l'élan de générosité général. Alors qu'un fon… [+1849 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "PSG : Paris doit virer Cavani et Icardi, Larqué conseille Leonardo - Foot01.com", "description": "En cette fin du mois d’avril et à l’approche du mercato, les dossiers chauds s’empilent sur le bureau du directeur sportif parisien Leonardo.\r\nA la recherche d’une doublure à Keylor Navas mais également de latéraux pour renforcer sa défense, le patron…", "url": "https://www.foot01.com/equipe/paris/psg-paris-doit-virer-cavani-et-icardi-larque-conseille-leonardo,347999", "urlToImage": null, "publishedAt": "2020-04-26T12:39:31Z", "content": "En cette fin du mois davril et à lapproche du mercato, les dossiers chauds sempilent sur le bureau du directeur sportif parisien Leonardo.\r\nA la recherche dune doublure à Keylor Navas mais également de latéraux pour renforcer sa défense, le patron du secteur … [+1593 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Cyril Morin", "title": "Coiffures et confinement : \"Areola se laisse pousser les cheveux, on dirait une peluche Kiki\" - Eurosport - FRANCE (FR)", "description": "Alors que le confinement s’éternise, les stars du sport s'adapent pour trouver des solutions pour leurs coiffures. Entretien qui décoiffe avec Caiolas Barber.", "url": "https://www.eurosport.fr/football/coiffures-et-confinement-areola-se-laisse-pousser-les-cheveux-on-dirait-une-peluche-kiki_sto7733774/story.shtml", "urlToImage": null, "publishedAt": "2020-04-26T12:17:57Z", "content": "59%. Si la France saccorde sur un point, cest celui-ci. Dès la levée du confinement, 59% des Français affirment vouloir se rendre chez le coiffeur pour rafraîchir leurs coupes, \r\nselon un sondage Harris. Les stars du sport ne dérogent pas à la règle. Confinée… [+4156 chars]"}, {"source": {"id": null, "name": "Onzemondial.com"}, "author": "La rédaction", "title": "Rennes : les anecdotes croustillantes de Bourigeaud sur la finale face au PSG - Onze Mondial", "description": "Grand bonhomme de la superbe saison 2018-2019 du Stade Rennais, Benjamin Bourigeaud s'est repenché sur la finale de Coupe de France remportée face au Paris Saint-Germain.", "url": "http://www.onzemondial.com/coupe-de-france/rennes-les-anecdotes-croustillantes-de-bourigeaud-sur-la-finale-face-au-psg-216558", "urlToImage": null, "publishedAt": "2020-04-26T12:14:01Z", "content": "Zapping Onze Mondial Adrien Rabiot à la Juventus Turin : le mauvais choix ? L'avis de Philippe Genin\r\nAprès un superbe parcours en Ligue Europa, le Stade Rennais s'imposait finalement face au Paris Saint-Germain en finale de la Coupe de France pour mettre un … [+3271 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "C.G.", "title": "Marseille : Florian Thauvin annonce qu'il reste à l'OM - 20 Minutes", "description": "Interrogé lors d'une séance live sur les réseaux sociaux, le milieu offensif a confirmé son souhait de rester à Marseille la saison prochaine", "url": "https://www.20minutes.fr/sport/2768055-20200426-marseille-florian-thauvin-annonce-reste-om", "urlToImage": null, "publishedAt": "2020-04-26T12:04:50Z", "content": "Florian Thauvin avec l'OM lors d'un match au Parc des Princes. NICOLAS MESSYASZ/SIPA\r\nLes spéculations vont toujours bon train. Interrogé sur son avenir à lOlympique de Marseille, \r\n Florian Thauvin a mis fin aux rumeurs lors dune séance de discussion sur les… [+564 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Max Franco Sanchez", "title": "L'Atlético de Madrid veut mettre 6 joueurs à la porte - Foot Mercato", "description": "L'Atlético de Madrid pourrait se séparer de six joueurs lors du prochain mercato estival. Et il y a de jolis noms dans cette liste...", "url": "https://www.footmercato.net/a5779458041016280335-latletico-de-madrid-veut-mettre-6-joueurs-a-la-porte", "urlToImage": null, "publishedAt": "2020-04-26T11:43:50Z", "content": "Les effets de la crise de coronavirus risquent d'être pour le moins difficiles à encaisser, d'un point de vue financier comme sportif, puisque les directeurs sportifs et les recruteurs naviguent dans le flou pour la préparation de la prochaine saison. Ce n'es… [+2499 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Andy Murray chambre Rafael Nadal avant l'Open virtuel de Madrid - Tennis - WTF - L'Équipe.fr", "description": "Avant de participer en ligne à l'Open de Madrid, épreuve virtuelle du tournoi, Andy Murray et Rafael Nadal échangent quelques mots sur leur niveau respectif.", "url": "https://www.lequipe.fr/Tennis/Actualites/Andy-murray-chambre-rafael-nadal-avant-l-open-virtuel-de-madrid/1129873", "urlToImage": null, "publishedAt": "2020-04-26T11:26:56Z", "content": "Coronavirus oblige, le Masters 1000 de Madrid a été annulé. Mais la semaine prochaine (27 au 30 avril) verra se dérouler une édition virtuelle du tournoi avec un joli plateau. Alors que Rafael Nadal a avoué avoir terminé son tout premier match de tennis virtu… [+204 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Maxime Raulin", "title": "Mohamed Haouas : « J'ai fait une erreur, je l'assume » - Rugby - Bleus - L'Équipe.fr", "description": "Silencieux depuis son carton rouge face à l'Écosse avec le XV de France lors du Tournoi des Six Nations, Mohamed Haouas revient pour la première fois, dans un entretien à « L'Équipe », sur ce coup de poing au troisième-ligne écossais Jamie Ritchie. Le pilier …", "url": "https://www.lequipe.fr/Rugby/Article/Mohamed-haouas-j-ai-fait-une-erreur-je-l-assume/1129871", "urlToImage": null, "publishedAt": "2020-04-26T11:18:29Z", "content": "La dernière fois qu'on a vu, ou plutôt aperçu, Mohamed Haouas, c'était dans les entrailles du stade de Murrayfield. Le pilier de l'équipe de France (26 ans, 4 sélections), en costume, se dirigeait lentement vers la réception d'après-match avec la tête des mau… [+104 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "A.C.", "title": "Mercato - PSG : Le Real Madrid a tranché pour Pogba ! - Le 10 Sport", "description": "Florentino Pérez, président du Real Madrid, ne serait finalement pas totalement opposé à une arrivée de Paul Pogba.", "url": "https://le10sport.com/football/mercato/mercato-psg-le-real-madrid-a-tranche-pour-pogba-501169", "urlToImage": null, "publishedAt": "2020-04-26T11:15:00Z", "content": "Publié le 26 avril 2020 à 13h15 par A.C. Florentino Pérez, président du Real Madrid, ne serait finalement pas totalement opposé à une arrivée de Paul Pogba. \r\nLété dernier, Zinedine Zidane a cru jusquau dernier moment pouvoir rafler la mise pour Paul Pogba. I… [+760 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Max Franco Sanchez", "title": "Le FC Barcelone commence à y croire pour Matthijs de Ligt - Foot Mercato", "description": "Selon la presse catalane, le club barcelonais serait très intéressé par Matthijs de Ligt. Et c'est réciproque.", "url": "https://www.footmercato.net/a2285554260204442366-le-fc-barcelone-commence-a-y-croire-pour-matthijs-de-ligt", "urlToImage": null, "publishedAt": "2020-04-26T11:05:56Z", "content": "Le FC Barcelone a beau être dans une situation financière tendue, les médias locaux continuent d'annoncer un mercato très mouvementé sur la cote catalane. En plus des pistes Lautaro Martinez et Neymar qui font les unes des journaux barcelonais au quotidien, u… [+2153 chars]"}, {"source": {"id": null, "name": "Allezpaillade.com"}, "author": null, "title": "L’agent de Junior Sambia évoque les jours avant l’hospitalisation - AllezPaillade.com", "description": "Pour L'Equipe, l'agent de Junior Sambia, Frédéric Guerra, racontait les jours qui ont précédé l'hospitalisation du Paillain. Un discours effrayant montrant la gravité du virus qui sévit", "url": "https://www.allezpaillade.com/actualites/breves/lagent-de-junior-sambia-evoque-les-jours-avant-lhospitalisation/", "urlToImage": null, "publishedAt": "2020-04-26T11:00:00Z", "content": "Pour L’Equipe, l’agent de Junior Sambia, Frédéric Guerra, racontait les jours qui ont précédé l’hospitalisation du Paillain. Un discours effrayant montrant la gravité du virus qui sévit aujourd’hui:\r\n« Junior est resté confiné avec sa copine à Montpellier dep… [+1165 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Rétro : Revivez la 12e étape du Tour de France 2017 - Cyclisme - Rétro - L'Équipe.fr", "description": "Revivez en vidéo sur le site et la chaîne L'Équipe, ce dimanche à partir de 13 heures, la 12e étape du Tour de 2017 entre Pau et Peyragudes.", "url": "https://www.lequipe.fr/Cyclisme-sur-route/Actualites/Retro-revivez-la-12e-etape-du-tour-de-france-2017/1129869", "urlToImage": null, "publishedAt": "2020-04-26T10:56:21Z", "content": "En cette période de confinement, le site et la chaîne L'Équipe rediffusent les étapes marquantes de l'histoire du Tour de France. Au programme de ce dimanche 26 avril, la 12e étape de la Grande Boucle 2017. C'est le coureur AG2R La Mondiale, Romain Bardet, qu… [+98 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Guillaume Issner", "title": "Ciro Immobile s'en prend à Unai Emery - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a4113109770665649915-ciro-immobile-sen-prend-a-unai-emery", "urlToImage": null, "publishedAt": "2020-04-26T10:47:08Z", "content": "Ciro Immobile marche sur l'eau cette saison avec la Lazio. L'attaquant est le meilleur buteur de Serie A avec 27 buts en 26 matches. Une résurrection pour celui qui a connu des périodes plus difficiles au Borussia Dortmund et au FC Séville il y a quelques ann… [+739 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Bayern Munich : Salihamidzic optimiste pour une prolongation de Manuel Neuer - Foot - ALL - Bayern - L'Équipe.fr", "description": "Le directeur sportif du club allemand, Hasan Salihamidzic, pense qu'une issue favorable pourra être trouvée au sujet de l'avenir du gardien international.", "url": "https://www.lequipe.fr/Football/Actualites/Bayern-munich-salihamidzic-optimiste-pour-une-prolongation-de-manuel-neuer/1129867", "urlToImage": null, "publishedAt": "2020-04-26T10:44:09Z", "content": "Le directeur sportif du Bayern Munich Hasan Salihamidzic s'est dit « optimiste » quant à une prolongation de contrat du gardien et capitaine Manuel Neuer, indiquant que des divergences ont été « clarifiées en interne », dans un entretien au journal Die Welt d… [+166 chars]"}, {"source": {"id": null, "name": "Lesviolets.com"}, "author": "https://facebook.com/lesvioletscom/", "title": "Olivier Sadran qui resterait président du TFC, êtes-vous déçu par cette information - LesViolets.Com", "description": "Apr&egrave;s plusieurs semaines sans aucune information concernant la vente du TFC...", "url": "https://www.lesviolets.com/actu/olivier-sadran-qui-resterait-president-du-tfc-etes-vous-decu-par-cette-information-,53415.html", "urlToImage": null, "publishedAt": "2020-04-26T10:43:00Z", "content": "Après plusieurs semaines sans aucune information concernant la vente du TFC, L’Équipe a expliqué samedi soir qu’aucun accord n’avait été trouvé entre Olivier Sadran et le groupe sino-américain intéressé par le rachat du club. Le président toulousain serait mê… [+492 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "L1 : Le plan des médecins pour la reprise, quelle galère ! - Foot01.com", "description": "Reprise des entraînements le 11 mai et retour de la Ligue 1 le 17 juin prochain, tel est le plan de la Ligue de Football Professionnel pour terminer le championnat en cours.\r\nBien évidemment, ce scénario est conditionné par les décisions gouvernementales…", "url": "https://www.foot01.com/ligue1/l1-le-plan-des-medecins-pour-la-reprise-quelle-galere,347993", "urlToImage": null, "publishedAt": "2020-04-26T10:41:16Z", "content": "Reprise des entraînements le 11 mai et retour de la Ligue 1 le 17 juin prochain, tel est le plan de la Ligue de Football Professionnel pour terminer le championnat en cours.\r\nBien évidemment, ce scénario est conditionné par les décisions gouvernementales en c… [+1882 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Everton \"consterné\" par une fête organisée par Moise Kean en plein confinement - Eurosport - FRANCE (FR)", "description": "PREMIER LEAGUE  - Le club d'Everton s'est dit dimanche \"consterné\" par le fait qu'un de ses joueurs, qui serait Moise Keane, ait organisé une fête.", "url": "https://www.eurosport.fr/football/premier-league/2019-2020/everton-consterne-par-une-fete-organisee-par-moise-kean-en-plein-confinement_sto7735217/story.shtml", "urlToImage": null, "publishedAt": "2020-04-26T10:30:15Z", "content": null}, {"source": {"id": null, "name": "Welovetennis.fr"}, "author": null, "title": "ATP - WTA > Mats Wilander pense qu'une possible fusion ATP/WTA permettra de digérer la fin de la carrière de Federer - We Love Tennis !", "description": "Dans ses analyses, Mats Wilander essaye souvent de prévoir les grandes tendances. L’avenir ne lui donne pas toujours raison mais il a le mérite de poser toujours quelques concepts importants. Concernant la fameuse fusion ATP/WTA, il y voit la possibilité de p…", "url": "https://www.welovetennis.fr/atp-wta/mats-wilander-pense-quune-possible-fusion-atp-wta-permettra-de-digerer-la-fin-de-la-carriere-de-federer", "urlToImage": null, "publishedAt": "2020-04-26T10:21:00Z", "content": "Dans ses analyses, Mats Wilander essaye souvent de prévoir les grandes tendances. L’avenir ne lui donne pas toujours raison mais il a le mérite de poser toujours quelques concepts importants. \r\nConcernant la fameuse fusion ATP/WTA, il y voit la possibilité de… [+572 chars]"}, {"source": {"id": null, "name": "Topmercato.com"}, "author": null, "title": "PSG : Verratti se paye l'OM sur sa LdC - Top Mercato.com", "description": "Marco Verratti (27 ans) s'est exprimé sur la Ligue des Champions remportée par l'OM, en 1993. Il a rappelé que le club ...", "url": "http://www.topmercato.com/219624,1/psg---verratti-se-paye-l-om-sur-sa-ldc.html", "urlToImage": null, "publishedAt": "2020-04-26T10:20:00Z", "content": "Marco Verratti (27 ans) s'est exprimé sur la Ligue des Champions remportée par l'OM, en 1993. Il a rappelé que le club phocéen n'avait plus gagné contre le PSG depuis longtemps.\"Il faut gagner deux Ligues des Champions pour arrêter de faire parler l'OM ? On v… [+359 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "PSG : Mbappé patron des Galactiques 2022, le rêve fou de Madrid - Foot01.com", "description": "Patron du Real Madrid depuis 20 ans, Florentino Perez semble vouloir faire renaître les Galactiques dans une version 2022 avec Kylian Mbappé en patron.\r\nLe 17 juillet prochain, Florentino Perez fêtera ses 20 ans à la présidence du Real Madrid, un anniversaire…", "url": "https://www.foot01.com/foot-europeen/espagne/psg-mbappe-patron-des-galactiques-2022-le-reve-fou-de-madrid,347989", "urlToImage": null, "publishedAt": "2020-04-26T10:05:46Z", "content": "Patron du Real Madrid depuis 20 ans, Florentino Perez semble vouloir faire renaître les Galactiques dans une version 2022 avec Kylian Mbappé en patron.\r\nLe 17 juillet prochain, Florentino Perez fêtera ses 20 ans à la présidence du Real Madrid, un anniversaire… [+1504 chars]"}, {"source": {"id": null, "name": "Cyclismactu.net"}, "author": null, "title": "Route: Les coureurs français pourront retourner s'entraîner le 11 mai - Cyclism'Actu", "description": "Toute l'actu du Cyclisme", "url": "https://www.cyclismactu.net/news-route-les-coureurs-francais-pourront-retourner-s-entrainer-le-11-mai-90711.html", "urlToImage": null, "publishedAt": "2020-04-26T10:02:00Z", "content": "Alors qu'un plan de déconfinement sera présenté mardi par le Premier ministre Edouard Philippe devant l'Assemblée nationale, le journal L'Equipe affirme, de source ministérielle, que la pratique du vélo en extérieur devrait être autorisée dès le 11 mai procha… [+2252 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/marc.alvarez1", "title": "Lecomte : “Ibra était venu me féliciter après un triplé au Parc des Princes” - Canal Supporters", "description": "Ibra a été un cauchemar pour les gardiens de but et les défenses de la Ligue 1. Benjamin Lecomte, actuel portier de l'AS Monaco, en convient.", "url": "https://canal-supporters.com/2020/04/lecomte-ibra-etait-venu-me-feliciter-apres-un-triple-au-parc-des-princes/", "urlToImage": null, "publishedAt": "2020-04-26T09:28:13Z", "content": "Zlatan Ibrahimovic a été un cauchemar pour les gardiens de but et les défenses de la Ligue 1. Benjamin Lecomte, actuel portier de l’AS Monaco, en convient. Dans un live Instagram du journaliste de L’Équipe Hugo Guillemet, le gardien de but s’est souvenu du ph… [+382 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Diacre : « J'espère que, dans ces deux ans, des jeunes vont émerger » - SO FOOT", "description": "Tournée vers l'avenir. Dans un entretien accordé à L'Équipe ce dimanche, Corinne Diacre revient sur son confinement, celui de ses joueuses, ...", "url": "https://www.sofoot.com/diacre-j-espere-que-dans-ces-deux-ans-des-jeunes-vont-emerger-482683.html", "urlToImage": null, "publishedAt": "2020-04-26T09:15:00Z", "content": "Tournée vers l'avenir.Dans un entretien accordé à L'Équipe ce dimanche, Corinne Diacre revient sur son confinement, celui de ses joueuses, mais aussi sur le décalage de l'Euro 2021 d'un an (du 6 au 31 juillet 2022). Un report qui n'affecte en rien les objecti… [+1010 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Coupe de la Ligue : retour en images sur la victoire de Gueugnon en 2000 - Foot - Coupe de la Ligue - L'Équipe.fr", "description": "Il y a vingt ans, le FC Gueugnon, alors en D2, remportait la Coupe de la Ligue. Retour sur la victoire surprise des Forgerons en finale, le 22 avril 2000, face au PSG (2-0).", "url": "https://www.lequipe.fr/Football/Actualites/Coupe-de-la-ligue-retour-en-images-sur-la-victoire-de-gueugnon-en-2000/1129847", "urlToImage": null, "publishedAt": "2020-04-26T09:14:43Z", "content": "Après avoir éliminé Niort (1-0), Toulouse (1-0), Strasbourg (2-0) et le Red Star (2-2, 9-8 aux t.a.b.) aux tours précédents, le FC Gueugnon de Sylvain Distin (cheveux teints en blond), alors en D2, accède à la finale, où il est opposé au PSG."}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "L1 : « Trop payés », un sondage terrible pour les footballeurs - Foot01.com", "description": "Un sondage réalisé pour RTL montre que les Français attendent que le sport soit moins un business, et surtout ils estiment que les footballeurs doivent accepter de gagner moins.\r\nLe célèbre « trop payé » lancé parfois par des supporters énervés à des joueurs…", "url": "https://www.foot01.com/ligue1/l1-trop-payes-un-sondage-terrible-pour-les-footballeurs,347987", "urlToImage": null, "publishedAt": "2020-04-26T09:08:48Z", "content": "Un sondage réalisé pour RTL montre que les Français attendent que le sport soit moins un business, et surtout ils estiment que les footballeurs doivent accepter de gagner moins.\r\nLe célèbre « trop payé » lancé parfois par des supporters énervés à des joueurs … [+1339 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Max Franco Sanchez", "title": "PSG : le Real Madrid change complètement son fusil d'épaule pour Alphonse Areola - Foot Mercato", "description": "Selon la presse espagnole, le Real Madrid a définitivement tranché pour l'avenir du portier français. Ce dernier reviendra à Paris cet été.", "url": "https://www.footmercato.net/a2613310446699898177-psg-le-real-madrid-change-completement-son-fusil-depaule-pour-alphonse-areola", "urlToImage": null, "publishedAt": "2020-04-26T09:08:00Z", "content": "Où jouera Alphonse Areola la saison prochaine ? C'est une question que beaucoup se posaient ces dernières semaines. Prêté sans option d'achat au Real Madrid cette saison, dans le rôle de deuxième gardien derrière Thibaut Courtois, le Français semblait promis … [+2182 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Alex Tulou à Béziers ? Le club calme le jeu - Rugby - Transferts - L'Équipe.fr", "description": "Sans nier s'intéresser au troisième-ligne de Castres, Béziers (Pro D2) a tenu à calmer le jeu sur certaines rumeurs de transferts.", "url": "https://www.lequipe.fr/Rugby/Actualites/Alex-tulou-a-beziers-le-club-calme-le-jeu/1129845", "urlToImage": null, "publishedAt": "2020-04-26T09:05:31Z", "content": "« Malgré la situation actuelle, tout est mis en oeuvre pour construire un effectif de qualité (pour la saison prochaine) tout en s'appuyant sur la jeunesse et les talents du centre de formation, écrit le club dans un communiqué. De nombreux contacts ont été p… [+432 chars]"}, {"source": {"id": null, "name": "Footmarseille.com"}, "author": null, "title": "Covid-19 : Appadoo comprend la LFP - Foot Marseille", "description": "Dave Appadoo \r \r Cette annonce de la LFP est logique. La Ligue essaye d'établir tous les protocoles toutes les possibilités pour mettre en place une reprise du foot. Le foot ne doit p", "url": "http://www.footmarseille.com/news-52196/covid-19-appadoo-comprend-la-lfp.html", "urlToImage": null, "publishedAt": "2020-04-26T08:42:00Z", "content": "Dave Appadoo s'est exprimé sur le communiqué publié par la LFP, concernant la possible reprise du championnat. Il comprend que les instances tentent de tout planifier.\r\nFootMarseille a besoin de vous ! On vous explique pourquoi ici.\r\n\"Cette annonce de la LFP … [+874 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "OL : Proche de Garcia et Houllier, un nouveau candidat en or à Lyon ? - Foot01.com", "description": "Pour remplacer Florian Maurice, un nouveau nom est sorti ce dimanche. Et ce candidat a deux atouts du côté de l'Olympique Lyonnais.\r\nJean-Michel Aulas l’a confié vendredi sur OLTV, le recrutement du remplaçant de Florian Maurice n’est pas acté, d’autant…", "url": "https://www.foot01.com/equipe/ol/ol-proche-de-garcia-et-houllier-un-candidat-en-or-a-lyon,347981", "urlToImage": null, "publishedAt": "2020-04-26T08:36:50Z", "content": "Pour remplacer Florian Maurice, un nouveau nom est sorti ce dimanche. Et ce candidat a deux atouts du côté de l'Olympique Lyonnais.\r\nJean-Michel Aulas la confié vendredi sur OLTV, le recrutement du remplaçant de Florian Maurice nest pas acté, dautant plus que… [+1282 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Mercato OM: Cabella répond sur un retour - Sports.fr", "description": "Interrogé sur un éventuel retour à l’Olympique de Marseille, Rémy Cabella n’y croit pas. Désormais à Krasnodar, Rémy Cabella ne se voit pas revenir à l’Olympique de Marseille. A Marseille entre 2015 et 2017 avant d’être prêté puis transféré à Saint-Etienne, l…", "url": "https://www.sports.fr/football/mercato-om-cabella-repond-retour-349721.html", "urlToImage": null, "publishedAt": "2020-04-26T08:34:35Z", "content": "Interrogé sur un éventuel retour à lOlympique de Marseille, Rémy Cabella ny croit pas.\r\nDésormais à Krasnodar, Rémy Cabella ne se voit pas revenir à lOlympique de Marseille. A Marseille entre 2015 et 2017 avant dêtre prêté puis transféré à Saint-Etienne, lint… [+825 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Le plan pour déterminer le classement de la L1 si la saison s’arrête - Sports.fr", "description": "Bertrand Desplat, le président de Guingamp, a proposé un plan en cas d’arrêt définitif de la saison de Ligue 1. Si le déconfinement devrait permettre aux joueurs de Ligue 1 (et Ligue 2, voire national) de retrouver le chemin des centres d’entraînement, une re…", "url": "https://www.sports.fr/football/plan-determiner-classement-de-l1-saison-sarrete-349753.html", "urlToImage": null, "publishedAt": "2020-04-26T08:18:23Z", "content": "Bertrand Desplat, le président de Guingamp, a proposé un plan en cas d’arrêt définitif de la saison de Ligue 1.\r\nSi le déconfinement devrait permettre aux joueurs de Ligue 1 (et Ligue 2, voire national) de retrouver le chemin des centres dentraînement, une re… [+1621 chars]"}, {"source": {"id": null, "name": "Parisfans.fr"}, "author": null, "title": "Mercato - Le Barça n'a pas parlé à l'agent de Pjanic, qui pourrait plutôt aller au PSG selon Schira - Parisfans.fr", "description": "Miralem Pjanic, milieu de 30 ans de la Juventus Turin et de la Bosnie, est régulièrement évoqué dans les rumeurs de transferts ces dernières semaines. Il ferait partie des joueurs turinois « vendables » pour financer d’autres venues et serait visé par plusieu…", "url": "http://www.parisfans.fr/transferts/mercato-le-barca-na-pas-parle-a-lagent-de-pjanic-qui-pourrait-plutot-aller-au-psg-selon-schira-460996.html", "urlToImage": null, "publishedAt": "2020-04-26T08:00:00Z", "content": "Miralem Pjanic, milieu de 30 ans de la Juventus Turin et de la Bosnie, est régulièrement évoqué dans les rumeurs de transferts ces dernières semaines. Il ferait partie des joueurs turinois « vendables » pour financer d’autres venues et serait visé par plusieu… [+1371 chars]"}, {"source": {"id": null, "name": "Www.dna.fr"}, "author": "AFP", "title": "Coronavirus. Quid des 300 footballeurs du championnat de France en fin de contrat ? - DNA - Dernières Nouvelles d'Alsace", "description": "La pandémie de coronavirus bouscule le calendrier du foot mais aussi son cadre juridique habituel, comme l’illustre l’épineuse question des joueurs en fin de contrat au 30 juin. Décryptage des enjeux soulevés en cas de poursuite de la saison au-delà du 1er ju…", "url": "https://www.dna.fr/sport/2020/04/26/quid-des-300-footballeurs-du-championnat-de-france-en-fin-de-contrat", "urlToImage": null, "publishedAt": "2020-04-26T07:10:42Z", "content": "Combien de joueurs sont concernés ?\r\nEn France, les contrats des joueurs \"expirent le 30 juin de la dernière saison\" prévue dans la transaction, selon la Charte du football professionnel. Or, à cette date, la saison 2019/20 ne sera pas terminée. La Ligue de f… [+3542 chars]"}, {"source": {"id": null, "name": "Football365.fr"}, "author": "Rédaction", "title": "PSG ou Barcelone ? De nouvelles révélations sur l’avenir de Neymar - Football365", "description": "Le feuilleton Neymar continue d'alimenter la presse catalane, alors que l'hypothèse d'une prolongation au PSG se renforce.", "url": "https://www.football365.fr/psg-ou-barcelone-de-nouvelles-revelations-sur-lavenir-de-neymar-9821816.html", "urlToImage": null, "publishedAt": "2020-04-26T07:09:19Z", "content": "Où évoluera Neymar la saison prochaine ? Après le premier épisode d’un feuilleton digne d’une télénovela, la seconde saison l’été prochain devrait être moins intense. La star a montré son attachement au Paris Saint-Germain avant que le football ne s’arrête, t… [+1027 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Guillaume Issner", "title": "Man United : Ed Woodward annonce la couleur pour le mercato - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a2987772919757341771-man-united-ed-woodward-annonce-la-couleur-pour-le-mercato", "urlToImage": null, "publishedAt": "2020-04-26T07:04:31Z", "content": "Face à la crise financière liée à la pandémie de coronavirus, les clubs professionnels auront un budget très restreint cet été pour le mercato. Les cadors n'y échapperont pas, à l'image de Manchester United. Ed Woodward, le vice-président exécutif, s'est adre… [+638 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Coronavirus : «Ces tests de dépistage nous font gagner 15 jours», assure le président d’Amiens - Le Parisien", "description": "Bernard Joannin explique pourquoi il a demandé à ce que les joueurs et le staff technique du club passent des tests de dépistage du Covid-19", "url": "http://www.leparisien.fr/sports/football/coronavirus-ces-tests-de-depistage-nous-font-gagner-15-jours-assure-le-president-d-amiens-26-04-2020-8305920.php", "urlToImage": null, "publishedAt": "2020-04-26T06:19:00Z", "content": "Il assume. « Gouverner c'est prévoir », affirme Bernard Joannin, le président du club d'Amiens SC. 19e et avant-dernier de Ligue 1 au moment de la suspension du championnat en raison du confinement, le club a été le premier en France à imposer des tests de dé… [+4059 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "TRIBUNE. \"Les Jeux d'hier ne seront pas les Jeux de demain\" : l'appel de Guy Drut, champion olympique et an... - franceinfo", "description": "", "url": "https://www.francetvinfo.fr/sante/maladie/coronavirus/tribune-les-jeux-d-hier-ne-seront-pas-les-jeux-de-demain-l-appel-de-guy-drut-champion-olympique-et-ancien-ministre-des-sports-pour-des-jo-plus-responsables_3934291.html", "urlToImage": null, "publishedAt": "2020-04-26T05:36:20Z", "content": "Champion olympique du 110 mètres haies et ancien ministre des Sports de Jacques Chirac, Guy Drut plaide, dans cette tribune publiée sur franceinfo, pour un renouvellement des Jeux olympiques, dont l'édition 2020, prévue à Tokyo, a été reportée à cause du coro… [+5210 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Béatrice Houchard", "title": "\"Neige - Bastogne - Neige\" : Il y a 40 ans, le chef-d'oeuvre de Bernard Hinault - Eurosport - FRANCE (FR)", "description": "LIEGE-BASTOGNE-LIEGE - Il y a quarante ans, Bernard Hinault bravait le froid et la neige pour s'imposer dans des conditions dantesques.", "url": "https://www.eurosport.fr/cyclisme/liege-bastogne-liege/2020/neige-bastogne-neige-il-y-a-40-ans-le-chef-d-oeuvre-de-bernard-hinault_sto7734659/story.shtml", "urlToImage": null, "publishedAt": "2020-04-26T05:29:35Z", "content": "LIEGE-BASTOGNE-LIEGE - Il y a quarante ans, Bernard Hinault bravait le froid et la neige pour s'imposer dans des conditions dantesques et signer sa deuxième victoire sur la Doyenne. L'occasion pour notre chroniqueuse Béatrice Houchard d'ouvrir une boîte à sou… [+6932 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Les monuments qui sentent le neuf - Actualité - DirectVélo", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiTGh0dHBzOi8vd3d3LmRpcmVjdHZlbG8uY29tL2FjdHVhbGl0ZS84MTczNC9sZXMtbW9udW1lbnRzLXF1aS1zZW50ZW50LWxlLW5ldWbSAQA?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T05:23:00Z", "content": null}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "« Ce n'est pas un criminel », Maradona défend Ronaldinho, assigné à résidence au Paraguay - RMC Sport", "description": "Diego Maradona s'est dit « triste » des problèmes judiciaires de Ronaldinho, assigné à résidence au Paraguay après avoir été placé en détention provisoire pour une affaire de faux passeport.", "url": "https://rmcsport.bfmtv.com/football/ce-n-est-pas-un-criminel-maradona-defend-ronaldinho-assigne-a-residence-au-paraguay-1901148.html", "urlToImage": null, "publishedAt": "2020-04-26T05:20:44Z", "content": null}, {"source": {"id": null, "name": "Ledauphine.com"}, "author": "AFP", "title": "Cyclisme. Déconfinement : sortir à vélo sera-t-il autorisé le 11 mai ? - Le Dauphiné Libéré", "description": "Il serait impensable que les restrictions de pratique individuelle du cyclisme puissent perdurer au-delà du 11 mai, a estimé samedi la Fédération française de cyclisme (FFC).", "url": "https://www.ledauphine.com/sport/2020/04/26/deconfinement-les-sorties-velo-seront-elles-autorisees-le-11-mai", "urlToImage": null, "publishedAt": "2020-04-26T04:05:01Z", "content": "Il serait impensable que les restrictions de pratique individuelle du cyclisme puissent perdurer au-delà du 11 mai, a estimé samedi la Fédération française de cyclisme (FFC).\r\n«Cela constituerait une véritable discrimination vis-à-vis de notre sport alors, qu… [+1887 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Laissez Camavinga tranquille ! / France / Stade rennais / SOFOOT.com - SO FOOT", "description": "Le Real Madrid, c'est trop tôt : Eduardo Camavinga doit rester à Rennes.", "url": "https://www.sofoot.com/laissez-eduardo-camavinga-tranquille-482667.html", "urlToImage": null, "publishedAt": "2020-04-26T04:00:00Z", "content": "Cette semaine, les journaux espagnols ont fait enfler la rumeur : le Real Madrid s'intéresserait de très près à Eduardo Camavinga, pour le prochain mercato. La saison n'est pas encore terminée, mais le joueur de 17 ans est déjà promis à un cador européen dans… [+4635 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Ces transferts de stars ratés par les clubs de Ligue 1 - Sports.fr", "description": "De nombreux clubs de Ligue 1 auraient pu accueillir des stars du football mondial. Que ce soit au début de leur carrière ou même parfois, pour ce qui est des cadors du championnat, à leur sommet. Invité d’un pocast diffusé par le club mancunien, Paul Pogba es…", "url": "https://www.sports.fr/football/transferts-de-stars-rates-clubs-de-ligue-1-349626.html", "urlToImage": null, "publishedAt": "2020-04-26T03:54:49Z", "content": "De nombreux clubs de Ligue 1 auraient pu accueillir des stars du football mondial. Que ce soit au début de leur carrière ou même parfois, pour ce qui est des cadors du championnat, à leur sommet.\r\nInvité dun pocast diffusé par le club mancunien, Paul Pogba es… [+1050 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Icardi, la clause qui change encore la donne - Sports.fr", "description": "Alors que le PSG devrait vraisemblablement lever l’option d’achat dont est assorti le prêt de Mauro Icardi, son prix ne sera pas le même si les Parisiens décident de le revendre dans la foulée. Le contrat entourant le prêt de Mauro Icardi au PSG aura décidéme…", "url": "https://www.sports.fr/football/icardi-clause-change-donne-349662.html", "urlToImage": null, "publishedAt": "2020-04-26T03:28:22Z", "content": "Alors que le PSG devrait vraisemblablement lever loption dachat dont est assorti le prêt de Mauro Icardi, son prix ne sera pas le même si les Parisiens décident de le revendre dans la foulée.\r\nLe contrat entourant le prêt de Mauro Icardi au PSG aura décidémen… [+1615 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Des tensions entre Mbappé et le PSG ? - Sports.fr", "description": "Les dernières manigances des dirigeants parisiens n’auraient pas été du goût de Kylian Mbappé. Si confinement oblige, les joueurs parisiens sont au chômage technique, obligés de se contenter de séances individuelles à leur domicile, leurs dirigeants du PSG ne…", "url": "https://www.sports.fr/football/tensions-entre-mbappe-psg-349660.html", "urlToImage": null, "publishedAt": "2020-04-26T03:00:29Z", "content": "Les dernières manigances des dirigeants parisiens nauraient pas été du goût de Kylian Mbappé.\r\nSi confinement oblige, les joueurs parisiens sont au chômage technique, obligés de se contenter de séances individuelles à leur domicile, leurs dirigeants du PSG ne… [+1469 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "G.d.S.S.", "title": "Mercato - PSG : Un dossier brûlant de Leonardo est en bonne voie ! - Le 10 Sport", "description": "Le PSG a entamé les démarches pour finalement prolonger Thiago Silva, et le défenseur brésilien fait du club de la capitale sa grande priorité.", "url": "https://le10sport.com/football/mercato/mercato-psg-un-dossier-brulant-de-leonardo-est-en-bonne-voie-501153", "urlToImage": null, "publishedAt": "2020-04-26T00:00:00Z", "content": "Publié le 26 avril 2020 à 2h00 par G.d.S.S. Le PSG a entamé les démarches pour finalement prolonger Thiago Silva, et le défenseur brésilien fait du club de la capitale sa grande priorité.\r\nComme Le 10 Sport vous la révélé en exclusivité mi-avril, le PSG a fin… [+1112 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Quels sont les points les plus mythiques de l'histoire ? - Eurosport - FRANCE (FR)", "description": "Nouvel épisode de notre rubrique \"On refait l'Histoire\". Cette fois, Laurent Vergne et Bertrand Milliard vous dévoilent les points qui les ont marqué.", "url": "https://www.eurosport.fr/tennis/quels-sont-les-points-les-plus-mythiques-de-l-histoire_sto7734788/story.shtml", "urlToImage": null, "publishedAt": "2020-04-25T22:41:15Z", "content": "ON REFAIT L'HISTOIRE - Nouvel épisode de notre rubrique \"On refait l'Histoire\". Cette fois, Laurent Vergne et Bertrand Milliard vous dévoilent les points qui ont particulièrement marqué leur mémoire. Première partie ce dimanche avec, notamment, un certain éch… [+19480 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Ligue Magnus : Cergy-Pontoise officiellement promu - Hockey - L'Équipe.fr", "description": "La Fédération française de hockey sur glace (FFHG) a confirmé que Cergy-Pontoise évoluera en Ligue Magnus la saison prochaine.", "url": "https://www.lequipe.fr/Hockey-sur-glace/Actualites/Ligue-magnus-cergy-pontoise-officiellement-promu/1129785", "urlToImage": null, "publishedAt": "2020-04-25T19:44:31Z", "content": "« Le Bureau directeur a entendu l'avis de la CSNCG et des commissions sportives en charge des championnats concernés et a décidé à l'unanimité de valider la promotion en division supérieure pour les clubs de Cergy-Pontoise en Ligue Magnus, d'Epinal en D1 et d… [+48 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "OL : Mohamed Bouhafsi fan d'Aulas « le génie du foot » - Foot01.com", "description": "A l'heure où les critiques sont souvent virulentes à son encontre, Jean-Michel Aulas peut compter sur un fan revendiqué au sein des médias.\r\nHabile en communication, Jean-Michel Aulas est capable de découper en morceaux L’Equipe via Twitter, puis le lendemain…", "url": "https://www.foot01.com/equipe/ol/ol-mohamed-bouhafsi-fan-d-aulas-le-genie-du-foot,347975", "urlToImage": null, "publishedAt": "2020-04-25T19:04:56Z", "content": "A l'heure où les critiques sont souvent virulentes à son encontre, Jean-Michel Aulas peut compter sur un fan revendiqué au sein des médias.\r\nHabile en communication, Jean-Michel Aulas est capable de découper en morceaux LEquipe via Twitter, puis le lendemain … [+1242 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Premier League : Les joueurs de Chelsea conservent l'intégralité de leurs salaires - Eurosport - FRANCE (FR)", "description": "PREMIER LEAGUE - Dans un communiqué publié samedi, Chelsea a annoncé que ses joueurs n'allaient pas subir de baisse de salaire en lien avec le Covid 19.", "url": "https://www.eurosport.fr/football/premier-league/2019-2020/premier-league-les-joueurs-de-chelsea-conservent-l-integralite-de-leurs-salaires_sto7734824/story.shtml", "urlToImage": null, "publishedAt": "2020-04-25T16:55:14Z", "content": "Si leurs voisins d'Arsenal ont récemment accepté de baisser leurs salaires de 12,5%, ce n'est pas la voie qu'ont décidé de prendre les joueurs de Chelsea. Dans un communiqué publié samedi, le club londonnien a fait un point sur une éventuelle réduction de sal… [+1035 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "F.H. avec AFP", "title": "Chelsea a levé l’option pour prolonger Olivier Giroud d’un an - 20 Minutes", "description": "L’attaquant de l’équipe de France débutera-t-il le championnat anglais sur le banc comme lors de la saison 2019-2020 ?", "url": "https://www.20minutes.fr/sport/2767667-20200425-chelsea-leve-option-prolonger-olivier-giroud-an", "urlToImage": null, "publishedAt": "2020-04-25T16:50:45Z", "content": "Olivier Giroud. (Illustration) Mark Greenwood/IPS/REX/SIPA\r\nQuel rôle va lui donner Frank Lampard ? Titulaire ou remplaçant ? Chelsea a levé loption pour prolonger dun an \r\nOlivier Giroud, annonce l'AFP. Lattaquant de \r\nl'équipe de France est lié au club lond… [+741 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Yannick Sagorin", "title": "Aulas, des recours « sans fondement juridique » - Sports.fr", "description": "Le président Aulas a brandi la menace de recours juridiques si toutefois l’OL était écarté de la scène européenne la saison prochaine. Au regard du droit, toute procédure serait cependant vaine selon l’avocat Thierry Granturco. L’UEFA a insisté jeudi sur la n…", "url": "https://www.sports.fr/football/aulas-recours-fondement-juridique-349566.html", "urlToImage": null, "publishedAt": "2020-04-25T13:38:00Z", "content": "Le président Aulas a brandi la menace de recours juridiques si toutefois lOL était écarté de la scène européenne la saison prochaine. Au regard du droit, toute procédure serait cependant vaine selon lavocat Thierry Granturco.\r\nLUEFA a insisté jeudi sur la not… [+3339 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Les gants de Lloris aux enchères / Angleterre / Tottenham / SOFOOT.com - SO FOOT", "description": "Lier l'utile à l'agréable. Selon Woodward, les clubs dépenseront beaucoup moins Homme réfléchi, Hugo Lloris a officialisé sa bonne idée qui ...", "url": "https://www.sofoot.com/les-gants-de-la-finale-de-ligue-des-champions-d-hugo-lloris-aux-encheres-482665.html", "urlToImage": null, "publishedAt": "2020-04-25T13:00:00Z", "content": "Lier l'utile à l'agréable.Homme réfléchi, Hugo Lloris a officialisé sa bonne idée qui va lui permettre à la fois de se débarrasser d'un objet encombrant et d'aider à combattre la pandémie de coronavirus. Le gardien de but de Tottenham a en effet décidé de met… [+398 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/profile.php?id=100010643894333", "title": "Pour Romeyer “jouer la finale de Coupe de France à huis clos n’a pas de sens” - Canal Supporters", "description": "Pour Roland Romeyer, jouer la finale de Coupe de France sans supporters et à huis clos est un non-sens total.", "url": "https://canal-supporters.com/2020/04/si-la-finale-de-coupe-de-france-ne-se-joue-pas-caiazzo-souhaite-que-lasse-se-qualifie-pour-leuropa-league/", "urlToImage": null, "publishedAt": "2020-04-25T12:14:28Z", "content": "Ce soir, le stade de France devait accueillir la finale de Coupe de France entre le PSG et Saint-Etienne. On ne sait pas encore quand cette dernière se jouera, même si Noël Le Graët souhaite que ce soit le premier match joué quand les compétitions pourront re… [+1733 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "VIDÉO- Bougez chez vous #36. Testez ce mix de course à pied et crossfit pour garder la forme - Ouest-France", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMilgFodHRwczovL3d3dy5vdWVzdC1mcmFuY2UuZnIvc3BvcnQvZml0bmVzcy9jcm9zc2ZpdC92aWRlby1ib3VnZXotY2hlei12b3VzLTM2LW5vdHJlLXNlcmllLWRlLXNwb3J0LWxhLW1haXNvbi1wcmVuZC1sLWFpci1hdmVjLWRlLWxhLWNvdXJzZS1waWVkLTY4MTc2NzHSAZYBaHR0cHM6Ly9hbXAub3Vlc3QtZnJhbmNlLmZyL3Nwb3J0L2ZpdG5lc3MvY3Jvc3NmaXQvdmlkZW8tYm91Z2V6LWNoZXotdm91cy0zNi1ub3RyZS1zZXJpZS1kZS1zcG9ydC1sYS1tYWlzb24tcHJlbmQtbC1haXItYXZlYy1kZS1sYS1jb3Vyc2UtcGllZC02ODE3Njcx?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T11:58:00Z", "content": null}, {"source": {"id": null, "name": "Nextgen-auto.com"}, "author": "Emmanuel Touzot", "title": "Leclerc compare la prudence de Hamilton à l'agressivité de Verstappen - Nextgen-Auto.com", "description": "Formule 1 | Charles Leclerc a été interrogé pendant son confinement en cours à Monaco sur les différences de pilotage entre ses rivaux. A la question de savoir (...)", "url": "https://motorsport.nextgen-auto.com/fr/formule-1/leclerc-compare-la-prudence-de-hamilton-a-l-agressivite-de-verstappen,148015.html", "urlToImage": null, "publishedAt": "2020-04-25T11:36:00Z", "content": "Charles Leclerc a été interrogé pendant son confinement en cours à Monaco sur les différences de pilotage entre ses rivaux.\r\nA la question de savoir contre qui il préférait se battre entre Lewis Hamilton et Max Verstappen, il a donné deux réponses.\r\n\"Si je ve… [+984 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "PSG : Neymar au Barça, Tebas fait enfin plaisir à Paris - Foot01.com", "description": "Habitué à tacler le Paris Saint-Germain, Javier Tebas a cette fois apporté une excellente nouvelle au club de la capitale. Selon lui, Neymar n’a aucune chance de revenir au FC Barcelone cet été.\r\nPendant que la presse madrilène se concentre sur le feuilleton…", "url": "https://www.foot01.com/equipe/paris/psg-neymar-au-barca-tebas-fait-enfin-plaisir-a-paris,347941", "urlToImage": null, "publishedAt": "2020-04-25T11:31:02Z", "content": "Habitué à tacler le Paris Saint-Germain, Javier Tebas a cette fois apporté une excellente nouvelle au club de la capitale. Selon lui, Neymar na aucune chance de revenir au FC Barcelone cet été.\r\nPendant que la presse madrilène se concentre sur le feuilleton K… [+1266 chars]"}, {"source": {"id": null, "name": "Onzemondial.com"}, "author": "La rédaction", "title": "Real Madrid : Pogba, Camavinga, Hakimi… le onze de rêve de Zidane pour 2020 - Onze Mondial", "description": "Le prochain mercato pourrait permettre à Zinedine Zidane d'aligner un onze de rêve tout simplement fabuleux.", "url": "http://www.onzemondial.com/liga/2019-2020/real-madrid-pogba-camavinga-hakimi-le-onze-de-reve-de-zidane-pour-2020-216473", "urlToImage": null, "publishedAt": "2020-04-25T11:04:37Z", "content": "Zapping Onze Mondial Stade Rennais : candidat sérieux à la Ligue des Champions ?\r\nIl faut toujours se permettre de rêver. Les championnats arrêtés, les rumeurs mercato se succèdent depuis plusieurs semaines, et le Real Madrid est comme toujours lié à plusieur… [+590 chars]"}, {"source": {"id": null, "name": "Lerugbynistere.fr"}, "author": "Thibault Perrin", "title": "Lacroix : ''Incompréhensible de reprendre une compétition par des phases finales'' [VIDEO] - Le Rugbynistère", "description": "Le président du Stade Toulousain Didier Lacroix a répondu aux questions que pouvaient se poser les supporters quant à la reprise et à la situation du club.", "url": "https://www.lerugbynistere.fr/videos/lacroix-incomprehensible-de-reprendre-une-competition-par-des-phases-finales-video-2504201209.php", "urlToImage": null, "publishedAt": "2020-04-25T10:10:00Z", "content": "Le président du Stade Toulousain Didier Lacroix a répondu aux questions que pouvaient se poser les supporters quant à la reprise et à la situation du club.Face aux nombreuses incertitudes qui entourent la reprise des matchs, le président du Stade Toulousain D… [+1887 chars]"}, {"source": {"id": null, "name": "Parisfans.fr"}, "author": null, "title": "Mercato - Neymar demanderait à quitter le PSG quand il rentre à Paris, Sport relance son histoire - Parisfans.fr", "description": "Neymar, attaquant de 28 ans du Paris Saint-Germain et du Brésil, est un des sujets principaux de la presse espagnole depuis son arrivée au FC Barcelone en 2013 et cela ne s’est pas arrêté avec son transfert à Paris en 2017. Cela parce que les journaux ibériqu…", "url": "http://www.parisfans.fr/une/mercato-neymar-demanderait-a-quitter-le-psg-quand-il-rentre-a-paris-sport-relance-son-histoire-460878.html", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": "Neymar, attaquant de 28 ans du Paris Saint-Germain et du Brésil, est un des sujets principaux de la presse espagnole depuis son arrivée au FC Barcelone en 2013 et cela ne s’est pas arrêté avec son transfert à Paris en 2017. Cela parce que les journaux ibériqu… [+2239 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Programme TV du samedi 25 avril : que regarder en sport à la télé ? - Tous sports - L'Équipe.fr", "description": "Retrouvez le meilleur des programmes de sport à suivre à la télé ce samedi 25 avril.", "url": "https://www.lequipe.fr/Medias/Actualites/Programme-tv-du-samedi-25-avril-que-regarder-en-sport-a-la-tele/1129569", "urlToImage": null, "publishedAt": "2020-04-25T09:30:00Z", "content": "Pendant la période de confinement, L'Équipe vous propose, chaque jour, une sélection de quelques programmes sportifs à suivre sur les chaînes de télé françaises. Retrouvez notamment, sur la chaîne L'Équipe, à partir de 13 heures, la 8e étape du Tour de France… [+1488 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "Ajax: Ziyech ne digère pas d'être privé du titre de champion - RMC Sport", "description": "Hakim Ziyech a réagi ce vendredi à la décision d'interrompre définitivement la saison de football aux Pays-Bas en raison de l'épidémie de coronavirus. Le milieu offensif marocain a exprimé sa frustration à l'idée de ne pas être sacré champion malgré la premiè…", "url": "https://rmcsport.bfmtv.com/football/ajax-ziyech-ne-digere-pas-d-etre-prive-du-titre-de-champion-1900518.html", "urlToImage": null, "publishedAt": "2020-04-25T08:58:23Z", "content": null}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "AS Saint-Etienne : l'ancien entraîneur Robert Herbin dans un état grave - Le Figaro", "description": "L'ex-entraîneur emblématique des Verts dans les années 70, âgé de 81 ans, est hospitalisé depuis mardi. Il souffre de problèmes cardiaques et pulmonaires.", "url": "https://sport24.lefigaro.fr/football/ligue-1/actualites/as-saint-etienne-l-ancien-entraineur-robert-herbin-dans-un-etat-grave-1000239", "urlToImage": null, "publishedAt": "2020-04-25T07:39:00Z", "content": "L'ex-entraîneur emblématique des Verts dans les années 70, âgé de 81 ans, est hospitalisé depuis mardi. Il souffre de problèmes cardiaques et pulmonaires.L'inquiétude grandit autour de l'état de santé de l'une des légendes de la grande épopée de l'AS Saint-Et… [+2116 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "De nouvelles mesures économiques en faveur du sport - Tous sports - L'Équipe.fr", "description": "A l'issue d'une réunion avec d'autres ministres et divers acteurs du sport, ce vendredi, Roxana Maracineanu a annoncé de nouvelles mesures d'accompagnement pour le secteur.", "url": "https://www.lequipe.fr/Tous-sports/Actualites/De-nouvelles-mesures-economiques-en-faveur-du-sport/1129608", "urlToImage": null, "publishedAt": "2020-04-24T21:27:04Z", "content": "Alors que les inquiétudes se sont renforcées ces derniers jours face à la crise économique générée par l'épidémie de Covid-19, la ministre des Sports Roxana Maracineanu a annoncé dans un tweet, ce vendredi soir, de nouvelles mesures d'accompagnement du secteu… [+577 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Cedric Rablat", "title": "FC Barcelone : ça s'agite pour le naming du Camp Nou - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a2233622010630339715-fc-barcelone-ca-sagite-pour-le-naming-du-camp-nou", "urlToImage": null, "publishedAt": "2020-04-24T21:03:02Z", "content": "Depuis plusieurs semaines, le FC Barcelone a officialisé son désir de procéder au naming pour le Camp Nou. Une démarche qui permettra aux Blaugranas de percevoir une nouvelle source de revenus. Mais dans cette période si particulière avec la pandémie de coron… [+648 chars]"}]}