{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Footmercato.net"}, "author": "Mathieu Rault", "title": "Covid-19 : la FIFA fait un chèque à chaque nation ! - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a5632554053881641054-covid-19-la-fifa-verse-500-000-a-chaque-nation", "urlToImage": "https://assets-fr.imgfoot.com/media/cache/1200x675/gianni-infantino-5ea2afe09c694.jpg", "publishedAt": "2020-04-24T13:39:28Z", "content": "Dans un communiqué, la FIFA a annoncé qu'elle débloquera tous les fonds opérationnels dus aux associations membres pour les années 2019 et 2020 dans les prochains jours, première étape d'un plan de secours pour venir en aide à la communauté du football touché… [+830 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Alban Lagoutte", "title": "Le PSG en négociation avec Man Utd ? - Sports.fr", "description": "Le Paris Saint-Germain et Manchester United discuteraient actuellement d’une éventuelle transaction. Un défenseur serait concerné… Le mercato estival sera très probablement retardé et décalé, du fait de compétitions qui vont se jouer plus tardivement au sorti…", "url": "https://www.sports.fr/football/psg-negociation-man-utd-349428.html", "urlToImage": "https://sf.sports.fr/wp-content/uploads/2020/04/dalot_panoramic.jpg", "publishedAt": "2020-04-24T13:28:31Z", "content": "Le Paris Saint-Germain et Manchester United discuteraient actuellement d’une éventuelle transaction. Un défenseur serait concerné…\r\nLe mercato estival sera très probablement retardé et décalé, du fait de compétitions qui vont se jouer plus tardivement au sort… [+1317 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Andrés Iniesta raconte son épisode dépressif en 2009 - Foot - ESP - Barça - L'Équipe.fr", "description": "Le génial milieu de terrain a évoqué la période « sombre » qu'il a connue après la saison riche en trophées du Barça en 2009 puis la mort de son ami Dani Jarque.", "url": "https://www.lequipe.fr/Football/Actualites/Andres-iniesta-raconte-son-episode-depressif-en-2009/1129435", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/andres-iniesta-a-souffert-de-depression-peu-apres-avoir-remporte-la-ligue-des-champions-2009-cordo/1500000001330007/0:0,1995:1330-640-427-75/97e53.jpg", "publishedAt": "2020-04-24T13:14:51Z", "content": "L'ancien international espagnol, Andrés Iniesta, qui aura 36 ans le 11 mai, a reconnu avoir souffert de dépression, à 25 ans, peu après avoir remporté la Ligue des champions avec le FC Barcelone, en 2009.\r\n« Les jours passaient et je me rendais compte que ma … [+1779 chars]"}, {"source": {"id": null, "name": "Maxifoot.fr"}, "author": null, "title": "Mercato : le PSG relance la piste Pellegrini - Maxifoot", "description": "Pour renforcer son milieu de terrain, le Paris Saint-Germain songe à Lorenzo Pellegrini. Le joueur de l'AS Rome plaît beaucoup au directeur spo ...", "url": "http://www.maxifoot.fr/football/article-43518.htm", "urlToImage": "http://images3.maxifoot.fr/pellegrini-43.jpg", "publishedAt": "2020-04-24T13:10:00Z", "content": "Pour renforcer son milieu de terrain, le Paris Saint-Germain songe à Lorenzo Pellegrini. Le joueur de l'AS Rome plaît beaucoup au directeur sportif parisien Leonardo.\r\nEn pleine préparation du mercato du Paris Saint-Germain, Leonardo travaille sur trois prior… [+1807 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Matthieu Margueritte", "title": "Zlatan Ibrahimovic dézingue les détracteurs de sa statue - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a4767850825177325603-zlatan-ibrahimovic-dezingue-les-detracteurs-de-sa-statue", "urlToImage": "https://assets-fr.imgfoot.com/media/cache/1200x675/zlatan-ibrahimovic.jpg", "publishedAt": "2020-04-24T12:44:04Z", "content": "Pour saluer l'idole de la ville de Malmö, une statue de Zlatan Ibrahimovic avait été érigée dans la ville suédoise. Cependant, le choix du buteur de l'AC Milan d'investir dans le club rival d'Hammarby a provoqué la colère des fans de Malmö et certains en ont … [+558 chars]"}, {"source": {"id": null, "name": "Footradio.com"}, "author": "Hadrien Rivayrand", "title": "OM : Lihadji met les voiles, Romain Canuti dit bon débarras - FootRadio.com", "description": "L'Olympique de Marseille devrait vivre un mercato estival mouvementé. Les dirigeants phocéens devront réaliser des opérations intéressantes mais peu onéreuses. A Marseille, les périodes de mercato sont toujours très attendues. Malgré tout, depuis quelques ann…", "url": "https://footradio.com/presse/om-lihadji-met-les-voiles-romain-canuti-dit-bon-debarras/", "urlToImage": "https://footradio.com/wp-content/uploads/2019/10/Icon_ADIM_040819_34_122.jpg", "publishedAt": "2020-04-24T12:11:40Z", "content": "L’Olympique de Marseille devrait vivre un mercato estival mouvementé. Les dirigeants phocéens devront réaliser des opérations intéressantes mais peu onéreuses. \r\nA Marseille, les périodes de mercato sont toujours très attendues. Malgré tout, depuis quelques a… [+1137 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "OM : Bouna Sarr prêt à briser son rêve pour sauver le club ! - Foot01.com", "description": "Avec 27 apparitions en Ligue 1, Bouna Sarr est le joueur le plus utilisé par André Villas-Boas cette saison à l’OM. Ce qui ne manque pas de faire grimper sa cote au mercato…\r\nDans le viseur de certaines écuries anglaises, le polyvalent milieu droit de…", "url": "https://www.foot01.com/equipe/marseille/om-bouna-sarr-pret-a-briser-son-reve-pour-sauver-le-club,347863", "urlToImage": "https://www.foot01.com/img/images/1920x1080/2020/Apr/24/om-bouna-sarr-sacrifie-pour-remplir-les-caisses-ca-se-discute-icon_bap_170120_93_090,283453.jpg", "publishedAt": "2020-04-24T12:06:22Z", "content": "Avec 27 apparitions en Ligue 1, Bouna Sarr est le joueur le plus utilisé par André Villas-Boas cette saison à lOM. Ce qui ne manque pas de faire grimper sa cote au mercato\r\nDans le viseur de certaines écuries anglaises, le polyvalent milieu droit de lOlympiqu… [+1818 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/murvin.armoogum", "title": "Lizarazu : “La qualification en quarts de finale de C1 est un premier déclic psychologique” - Canal Supporters", "description": "Pour Lizarazu, la qualification en quarts de finale de C1 du PSG face au BVB peut être considérée comme un premier déclic psychologique", "url": "https://canal-supporters.com/2020/04/lizarazu-la-qualification-en-quarts-de-finale-de-c1-est-un-premier-declic-psychologique/", "urlToImage": "https://canal-supporters.com/wp-content/uploads/2020/02/liza.png", "publishedAt": "2020-04-24T11:47:55Z", "content": "Après trois échecs en huitièmes de finale de Ligue des champions, le PSG s’était qualifié en quarts de finale de C1 – avant le début du confinement – suite à sa double confrontation face au Borussia Dortmund (3-2 score cumulé). Un match retour notamment marqu… [+991 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "Football Montpellier - Covid-19 : Junior Sambia placé en coma artificiel - Foot01.com", "description": "Les nouvelles ne sont pas bonnes concernant Junior Sambia. Le joueur de Montpellier, qui s’est plaint de problèmes respiratoires et de vomissements en début de semaine, a tout d’abord été admis en clinique à Castelnau-le-Lez avant que la situation ne…", "url": "https://www.foot01.com/equipe/montpellier/covid-19-junior-sambia-place-en-coma-artificiel,347895", "urlToImage": "https://www.foot01.com/img/images/1920x1080/2020/Apr/24/covid-19-junior-sambia-place-en-coma-artificiel-icon_dim_301119_33_190,283485.jpg", "publishedAt": "2020-04-24T11:44:59Z", "content": "Les nouvelles ne sont pas bonnes concernant Junior Sambia. Le joueur de Montpellier, qui sest plaint de problèmes respiratoires et de vomissements en début de semaine, a tout dabord été admis en clinique à Castelnau-le-Lez avant que la situation ne se dégrade… [+286 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "sdenis", "title": "Médiapro lorgne du côté de Canal+ pour se renforcer - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a4977268563619275871-mediapro-lorgne-du-cote-de-canal-pour-se-renforcer", "urlToImage": "https://assets-fr.imgfoot.com/media/cache/1200x675/camera-droits-tv-lfp.jpg", "publishedAt": "2020-04-24T11:40:52Z", "content": "Si la journaliste de beIN Sports Anne Laure Bonnet a été récemment approchée pour renforcer Mediapro dans les prochaines semaines, le groupe média espagnol qui est le futur diffuseur de la Ligue 1 et de la Ligue 2 continue de prospecter en vue de renforcer la… [+665 chars]"}, {"source": {"id": null, "name": "Maxifoot.fr"}, "author": null, "title": "Rennes : son arrivée, l'objectif C1, le mercato... Les confidences du président Holveck - Maxifoot", "description": "Nommé président du Stade Rennais depuis plus d'un mois, Nicolas Holveck connaît des débuts particuliers. Forcé au travail  ...", "url": "http://www.maxifoot.fr/football/article-43516.htm", "urlToImage": "http://images3.maxifoot.fr/holveck-3.jpg", "publishedAt": "2020-04-24T11:40:00Z", "content": "Nommé président du Stade Rennais depuis plus d'un mois, Nicolas Holveck connaît des débuts particuliers. Forcé au travail à distance, avec le confinement, le nouveau patron des Rouge et Noir garde le cap et compte bien remplir sa mission.\r\nEn acceptant la suc… [+2755 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "H.G.", "title": "Mercato - PSG : La tendance se confirme pour Kylian Mbappé ! - Le 10 Sport", "description": "Alors que le Real Madrid aurait aimé enrôler Kylian Mbappé cet été, le club madrilène n’aurait eu d’autre choix que de remettre à plus tard sa venue en raison du contexte économique actuel.", "url": "https://le10sport.com/football/mercato/mercato-psg-la-tendance-se-confirme-pour-kylian-mbappe-500965", "urlToImage": "https://le10static.com/img/master/0000/0016/167917.jpeg", "publishedAt": "2020-04-24T11:15:00Z", "content": "Publié le 24 avril 2020 à 13h15 par H.G. Alors que le Real Madrid aurait aimé enrôler Kylian Mbappé cet été, le club madrilène naurait eu dautre choix que de remettre à plus tard sa venue en raison du contexte économique actuel. \r\nKylian Mbappé rêve du Real M… [+1631 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "PSG : Haaland va plier Mbappé, c'est écrit - Foot01.com", "description": "La rivalité entre Haaland et Mbappé pourrait bien être celle de la prochaine décennie. Et le Norvégien a ses fervents partisans. \r\nNouveau venu sur la scène des buteurs européens, Erling Haaland a fait une entrée fracassante en Ligue des Champions. S’il…", "url": "https://www.foot01.com/equipe/paris/psg-haaland-va-plier-mbappe-c-est-ecrit,347867", "urlToImage": "https://www.foot01.com/img/images/1920x1080/2020/Apr/24/psg-haaland-va-plier-mbappe-c-est-ecrit-icon_bap_180220_93_255,283459.jpg", "publishedAt": "2020-04-24T11:01:56Z", "content": "La rivalité entre Haaland et Mbappé pourrait bien être celle de la prochaine décennie. Et le Norvégien a ses fervents partisans.\r\nNouveau venu sur la scène des buteurs européens, Erling Haaland a fait une entrée fracassante en Ligue des Champions. Sil est déj… [+1363 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "Alexis Bernard", "title": "EXCLU - Mercato - Real Madrid : Aubameyang promis à l’Inter Milan ? - Le 10 Sport", "description": "Comme révélé par le10sport.com, Pierre-Emerick Aubameyang est sur le départ à Arsenal et l’Inter Milan est aujourd’hui une destination qui se détache.", "url": "https://le10sport.com/football/mercato/exclu-mercato-real-madrid-aubameyang-promis-a-linter-milan-500961", "urlToImage": "https://le10static.com/img/master/0000/0016/167914.jpeg", "publishedAt": "2020-04-24T11:00:00Z", "content": "Foot - Mercato - Real Madrid\r\nPublié le 24 avril 2020 à 13h00 par Alexis Bernard Comme révélé par le10sport.com, Pierre-Emerick Aubameyang est sur le départ à Arsenal et lInter Milan est aujourdhui une destination qui se détache.\r\nLe contrat de Pierre-Emerick… [+1806 chars]"}, {"source": {"id": null, "name": "Basketsession.com"}, "author": "BasketSession.com - Le meilleur de la NBA : news, rumeurs, vidéos, analyses", "title": "Article Shaq a pris une leçon dès sa première action contre Michael Jordan - BasketSession", "description": "La première rencontre entre Shaq et Michael Jordan sur le terrain a démarré en fanfare et de manière un peu humiliante pour le Big Cactus.", "url": "https://www.basketsession.com/actu/shaq-michael-jordan-block-contre-544622/", "urlToImage": "https://www.basketsession.com/statics/uploads/2020/03/shaq.jpg", "publishedAt": "2020-04-24T10:50:51Z", "content": "Shaquille O'Neal a toujours été fan de Michael Jordan. Avant même qu'il n'arrive en NBA, le \"Big Cactus\" regardait la star des Chicago Bulls avec admiration et appréhendait sa première rencontre en match officiel avec l'icône. L'affrontement est survenu dès s… [+1556 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Aurélien Léger-Moëc", "title": "Les mesures dingues préconisées par le ministère du travail allemand pour reprendre la Bundesliga - Foot Mercato", "description": "Les dirigeants du football allemand se sont fixés comme objectif de reprendre la saison de Bundesliga le 9 mai prochain. Mais ils attendent encore le feu vert gouvernemental. Et les mesures préconisées par le ministère du travail risquent de rendre les choses…", "url": "https://www.footmercato.net/a1558171706424559220-les-mesures-dingues-preconisees-par-le-ministere-du-travail-allemand-pour-reprendre-la-bundesliga", "urlToImage": "https://assets-fr.imgfoot.com/media/cache/1200x675/bundesliga.jpg", "publishedAt": "2020-04-24T10:44:17Z", "content": "C'est d'un il jaloux que les dirigeants de clubs français et certains observateurs regardent vers l'Allemagne. Comment font-ils pour être si proches d'un retour sur les terrains ? L'Allemagne a effectivement un temps d'avance sur la plupart des pays européens… [+2189 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Antoine Grasland", "title": "Mercato : l'alléchant échange envisagé entre le Barça et la Juve - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a6578910117913414370-mercato-lallechant-echange-envisage-entre-le-barca-et-la-juve", "urlToImage": "https://assets-fr.imgfoot.com/media/cache/1200x675/miralem-pjanic-5e9ed41e743ba.jpg", "publishedAt": "2020-04-24T10:44:08Z", "content": "La pandémie du coronavirus qui touche le monde actuellement pourrait rebattre les cartes pour le mercato dans le football. En effet, les clubs vont devoir se montrer imaginatifs pour se renforcer à moindre coût. Et depuis quelques semaines, c'est le FC Barcel… [+819 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "OL : Memphis Depay renfort de luxe de Lyon, ça se confirme ! - Foot01.com", "description": "En cas de reprise de la Ligue 1 mi-juin, plusieurs clubs pourraient bénéficier de retours de joueurs blessés de longue date. C’est notamment le cas de l’OL.\r\nEt pour cause, l’Olympique Lyonnais avait vécu une après-midi tragique le 15 décembre dernier…", "url": "https://www.foot01.com/equipe/ol/ol-memphis-depay-renfort-de-luxe-de-lyon-ca-se-confirme,347869", "urlToImage": "https://www.foot01.com/img/images/1920x1080/2020/Apr/24/ol-depay-renfort-de-luxe-de-lyon-ca-se-confirme-icon_blo_021119_08_35,283457.jpg", "publishedAt": "2020-04-24T10:41:39Z", "content": "En cas de reprise de la Ligue 1 mi-juin, plusieurs clubs pourraient bénéficier de retours de joueurs blessés de longue date. Cest notamment le cas de lOL.\r\nEt pour cause, lOlympique Lyonnais avait vécu une après-midi tragique le 15 décembre dernier avec les g… [+1690 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "A.D.", "title": "Mercato - PSG : Mauro Icardi afficherait une énorme certitude pour son avenir… - Le 10 Sport", "description": "Prêté avec option d'achat au PSG, Mauro Icardi ne s'imaginerait pas rester dans la capitale française la saison prochaine. A moins que Leonardo et Nasser Al-Khelaïfi ne décident de se séparer de…", "url": "https://le10sport.com/football/mercato/mercato-psg-mauro-icardi-afficherait-une-certitude-pour-son-avenir-500946", "urlToImage": "https://le10static.com/img/master/0000/0016/167904.jpeg", "publishedAt": "2020-04-24T10:15:00Z", "content": "Publié le 24 avril 2020 à 12h15 par A.D. Prêté avec option d'achat au PSG, Mauro Icardi ne s'imaginerait pas rester dans la capitale française la saison prochaine. A moins que Leonardo et Nasser Al-Khelaïfi ne décident de se séparer de Thomas Tuchel. \r\nMauro … [+797 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "L1 : Des garanties signées Macron pour la reprise du foot le 11 mai ? - Foot01.com", "description": "Le monde du football s’organise pour l’après-confinement. En France, les présidents de Ligue 1 souhaitent dans une grande majorité terminer la saison en cours.\r\nL’idée est toujours de reprendre le championnat mi-juin afin de le terminer en août et de laisser…", "url": "https://www.foot01.com/ligue1/l1-des-garanties-signees-macron-pour-la-reprise-du-foot-le-11-mai,347865", "urlToImage": "https://www.foot01.com/img/images/1920x1080/2020/Apr/24/l1-feu-vert-d-emmanuel-macron-pour-la-reprise-du-foot-icon_190607p107770,283455.jpg", "publishedAt": "2020-04-24T10:08:37Z", "content": "Le monde du football sorganise pour laprès-confinement. En France, les présidents de Ligue 1 souhaitent dans une grande majorité terminer la saison en cours.\r\nLidée est toujours de reprendre le championnat mi-juin afin de le terminer en août et de laisser la … [+1709 chars]"}, {"source": {"id": null, "name": "Touchdownactu.com"}, "author": "Jean-Michel Bougeard", "title": "Draft NFL 2020 : les meilleurs joueurs encore disponibles - Touchdown Actu", "description": "Alors que les 32 premiers joueurs ont été choisis, il reste de quoi améliorer les effectifs à toutes les positions.", "url": "https://www.touchdownactu.com/234997/draft-nfl-2020-les-meilleurs-joueurs-encore-disponibles/", "urlToImage": "https://www.touchdownactu.com/wp-content/uploads/2020/04/jalen_hurts_day_2-1000x600.jpg", "publishedAt": "2020-04-24T10:02:15Z", "content": "Le premier tour est passé mais la draft est loin d’être terminée : ce vendredi 24, place aux tours 2 et 3. 74 choix en comptant les choix compensatoires de certaines équipes. Quels joueurs votre équipe va-t’elle sélectionner pour continuer à se renforcer ? Qu… [+7466 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Sun Yang convoqué pour préparer les JO malgré sa suspension pour dopage, la Fédération chinoise rectifie - Natation - L'Équipe.fr", "description": "Le triple champion olympique Sun Yang, suspendu huit ans par le Tribunal arbitral du sport, figurait sur une liste d'athlètes convoqués à un stage de préparation. Une liste invalide selon la Fédération chinoise.", "url": "https://www.lequipe.fr/Natation/Actualites/Sun-yang-convoque-pour-preparer-les-jo-malgre-sa-suspension-pour-dopage-la-federation-chinoise-rectifie/1129386", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/sun-yang-aux-championnats-du-monde-de-gwengju-coree-du-sud-en-juillet-2019-sebastien-boue-l-equi/1500000001329917/0:0,1996:1331-640-427-75/eae3d.jpg", "publishedAt": "2020-04-24T09:38:15Z", "content": "Erreur ou message ? Selon la presse chinoise, Sun Yang, suspendu fin février huit ans pour dopage, faisait partie des nageurs convoqués par la Fédération chinoise de natation (CSA) pour participer à un stage d'entraînement national du 1er avril au 30 juin, av… [+863 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "F1 - Zak Brown (patron de McLaren) : « Ferrari vit dans le déni » - F1 - Coronavirus - L'Équipe.fr", "description": "Le patron de McLaren, Zak Brown, a peu goûté les propos de Mattia Binotto suggérant que la F1 devait prendre son temps avant de décider de poursuivre la réduction des budgets.", "url": "https://www.lequipe.fr/Formule-1/Actualites/F1-zak-brown-patron-de-mclaren-ferrari-vit-dans-le-deni/1129377", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/brown-milite-pour-une-reponse-rapide-et-forte-face-a-la-crise-actuelle-neis-eibner-expa-presse-spo/1500000001329910/0:0,1996:1331-640-427-75/5272b.jpg", "publishedAt": "2020-04-24T09:16:02Z", "content": "Même si une unité de façade est affichée par les dix écuries du paddock depuis le début de la crise du coronavirus, par moments, les dissensions réapparaissent au grand jour. Et, comme souvent, l'argent est le sujet de la discorde. Alors que certaines écuries… [+2067 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Guillaume Vigier", "title": "Ça s'agite pour le futur de Luka Modric, 6 clubs espagnols défient la Liga - Foot Mercato", "description": "Le destin de Modric pose question au Real Madrid, plusieurs équipes espagnoles ne veulent pas reprendre la saison et l'annonce de l'UEFA fait les gros titres en Europe, voici votre revue de presse du 24 avril 2020.", "url": "https://www.footmercato.net/a2996374867346028502-ca-sagite-pour-le-futur-de-luka-modric-6-clubs-espagnols-defient-la-liga", "urlToImage": "https://assets-fr.imgfoot.com/media/cache/1200x675/photo-rvp.jpg", "publishedAt": "2020-04-24T09:05:30Z", "content": "La peur de la reprise\r\nEn Espagne, si les fans de foot attendent comme partout le retour du foot, un tel scénario ne semble pas donner envie à tout le monde, en tout cas pas aux acteurs directement concernés. En effet, d'après le journal Sport, les joueurs de… [+2693 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "sdenis", "title": "Mercato : le PSG a pris sa décision pour Alphonse Aréola - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a1107627603334958189-mercato-le-psg-a-pris-sa-decision-pour-alphonse-areola", "urlToImage": "https://assets-fr.imgfoot.com/media/cache/1200x675/alphonse-areola-5ea0b91411cea.jpg", "publishedAt": "2020-04-24T09:05:26Z", "content": "Parti en prêt du côté du Real Madrid dans le cadre du transfert de Keylor Navas au PSG, Alphonse Areola a dû se contenter de miettes derrière Thibaut Courtois. Avec 8 apparitions avec le Real Madrid dont 135 minutes de jeu en Ligue des Champions, le gardien f… [+523 chars]"}, {"source": {"id": null, "name": "Foot-sur7.fr"}, "author": "FOOT-SUR7.fr", "title": "ASSE Mercato : Les plans de Puel pour la saison prochaine - Foot Sur 7", "description": "Manager général de l’ASSE, Claude Puel a bel et bien un plan pour constituer son équipe la saison prochaine. Le grand nettoyage annoncé l’hiver dernier devrait être mis à exécution, lors du mercato estival.", "url": "https://www.foot-sur7.fr/445619-asse-mercato-plan-puel-saison", "urlToImage": "https://cdn.foot-sur7.fr/700x400/articles/2020/01/Claude%20Puel%20Icon__MG_0387%20copie.jpg", "publishedAt": "2020-04-24T09:04:16Z", "content": "Manager général de lASSE, Claude Puel a bel et bien un plan pour constituer son équipe la saison prochaine. Le grand nettoyage annoncé lhiver dernier devrait être mis à exécution, lors du mercato estival.\r\nASSE : Puel et Thuilot partis pour le grand dégraissa… [+2312 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "La rédaction", "title": "Mercato - PSG : Un énorme danger se profile pour Tanguy Ndombele ! - Le 10 Sport", "description": "Alors que le PSG souhaiterait tenter le coup avec Tanguy Ndombele la saison prochaine, le FC Barcelone pourrait avoir un atout de taille pour récupérer le joueur de Tottenham…", "url": "https://le10sport.com/football/mercato/mercato-psg-un-nouveau-danger-dans-le-dossier-ndombele-500927", "urlToImage": "https://le10static.com/img/master/0000/0016/167891.jpeg", "publishedAt": "2020-04-24T08:45:00Z", "content": "Publié le 24 avril 2020 à 10h45 par La rédaction mis à jour le 24 avril 2020 à 14h18 Alors que le PSG souhaiterait tenter le coup avec Tanguy Ndombele la saison prochaine, le FC Barcelone pourrait avoir un atout de taille pour récupérer le joueur de Tottenham… [+1168 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Ligue 1 - Rafael tacle Neymar : \"Ce n'est pas un leader\" - Eurosport - FRANCE (FR)", "description": "LIGUE 1 - OL - Rafael tacle Neymar : \"Ce n'est pas un leader\".", "url": "https://www.eurosport.fr/football/ligue-1/2019-2020/ligue-1-rafael-tacle-neymar-ce-n-est-pas-un-leader_sto7733659/story.shtml", "urlToImage": "https://i.eurosport.com/2020/02/19/2779809-57380190-2560-1440.jpg", "publishedAt": "2020-04-24T08:24:35Z", "content": "LIGUE 1 - Alors que le Brésil espère compter sur Neymar lors de ses prochaines échéances internationales, Rafael, lui, ne croit visiblement pas en ses capacités de leader. Pour le latéral de l'OL, le football n'est tout simplement pas \"la priorité\" du numéro … [+1847 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "J.L. avec AFP", "title": "Un élu de Liverpool veut enquêter sur la tenue du match contre l'Atlético - 20 Minutes", "description": "Le gouvernement conservateur de Boris Johnson avait expliqué qu'il n'avait fait que suivre les conseils des scientifiques en laissant ce match se dérouler normalement", "url": "https://www.20minutes.fr/sport/2767003-20200424-coronavirus-elu-liverpool-demande-enquete-contamination-ville-apres-match-contre-atletico", "urlToImage": "https://img.20mn.fr/44HsAiQTR-GBVNu3XER1tA/648x360_marco-llorente-permis-atletico-qualifier-prolongations-anfield.jpg", "publishedAt": "2020-04-24T08:24:12Z", "content": "Marco Llorente avait permis à l'Atletico de se qualifier en prolongations à Anfield. Jon Super/AP/SIPA\r\nLe maire de la métropole de Liverpool, Steve Rotheram, a réclamé jeudi une enquête sur le rôle qu'a pu jouer le match de Ligue des champions de football le… [+1812 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Stade Toulousain : une pétition pour ne pas demander le remboursement des abonnements - Rugby - Top 14 - ST - L'Équipe.fr", "description": "Des abonnés du Stade Toulousain appellent à ne pas demander le remboursement des abonnements pour aider financièrement leur club.", "url": "https://www.lequipe.fr/Rugby/Actualites/Stade-toulousain-une-petition-pour-ne-pas-demander-le-remboursement-des-abonnements/1129365", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/certains-abonnes-du-stade-toulousain-veulent-etre-solidaires-avec-leur-club-f-lancelot-l-equipe/1500000001329895/0:0,1995:1330-640-427-75/70466.jpg", "publishedAt": "2020-04-24T08:12:51Z", "content": "À Toulouse, un groupe d'abonnés, a ainsi lancé une pétition « pour renoncer au remboursement de l'abonnement au Stade Toulousain pour cette saison. En ces temps de solidarité, nous trouvons que cette idée est plus que généreuse pour aider le Stade Toulousain.… [+216 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "sdenis", "title": "OL : un ancien attaquant du PSG dans le viseur - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a6425769495824051365-ol-un-ancien-attaquant-du-psg-dans-le-viseur", "urlToImage": "https://assets-fr.imgfoot.com/media/cache/1200x675/odsonne-edouard.jpg", "publishedAt": "2020-04-24T08:03:55Z", "content": "Moussa Dembelé sur le départ l'été prochain (Chelsea et Manchester United sont sur le coup), l'Olympique Lyonnais creuse des pistes en vue de lui trouver un remplaçant. Et le club rhodanien aurait coché sur ses tablettes un ancien attaquant du PSG, un certain… [+446 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Luca ANDREOLLI", "title": "Kylian Mbappé : cette vidéo au milieu de sa famille déclenche le buzz... et en dit long sur son confinement - Télé Loisirs.fr", "description": "L'attaquant star du PSG et des Bleus a partagé un moment d'intimité au milieu de la cuisine familiale, entouré de plusieurs membres de son clan. En quelques heures, ce post est devenu gigantesque.", "url": "https://www.programme-tv.net/news/sport/253535-kylian-mbappe-cette-video-au-milieu-de-sa-famille-declenche-le-buzz-et-en-dit-long-sur-son-confinement/", "urlToImage": "https://tel.img.pmdstatic.net/fit/http.3A.2F.2Fprd2-bone-image.2Es3-website-eu-west-1.2Eamazonaws.2Ecom.2Ftel.2F2020.2F04.2F24.2F07298573-c07a-47e0-917e-e3d0a0d2ecc6.2Ejpeg/1200x500/crop-from/top/quality/80/kylian-mbappe-cette-video-au-milieu-de-sa-famille-declenche-le-buzz-et-en-dit-long-sur-son-confinement.jpg", "publishedAt": "2020-04-24T07:51:50Z", "content": "Ce mercredi 22 avril, Neymar exprimait pour la première fois depuis son confinement au Brésil ses angoisses et surtout sa frustration de ne pas pouvoir jouer au football. Trépignant d'impatience de revenir en France, la star du Paris Saint-Germain affirmait m… [+1868 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "Coronavirus: la crainte d'un Tour de France sans coureur français - RMC Sport", "description": "Pascal Chanteur, président du syndicat des coureurs français, s'inquiète du flou sur les conditions de retour à l'entraînement des Français et craint qu'ils ne puissent pas participer au Tour de France.", "url": "https://rmcsport.bfmtv.com/cyclisme/coronavirus-la-crainte-d-un-tour-de-france-sans-coureur-francais-1899832.html", "urlToImage": "https://www.bfmtv.com/i/0/0/9ba/48aeacc548aed9842501c06520788.jpeg", "publishedAt": "2020-04-24T07:42:29Z", "content": null}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "T.M.", "title": "Mercato - PSG : Maxwell revient sur son transfert au PSG… - Le 10 Sport", "description": "Aujourd’hui ambassadeur du PSG, Maxwell avait rejoint le club de la capitale en 2012 en provenance du FC Barcelone. Un choix sur lequel est revenu le Brésilien.", "url": "https://le10sport.com/football/mercato/mercato-psg-maxwell-revient-sur-son-transfert-au-psg-500930", "urlToImage": "https://le10static.com/img/master/0000/0016/167894.jpeg", "publishedAt": "2020-04-24T07:05:00Z", "content": "Publié le 24 avril 2020 à 9h05 par T.M. Aujourdhui ambassadeur du PSG, Maxwell avait rejoint le club de la capitale en 2012 en provenance du FC Barcelone. Un choix sur lequel est revenu le Brésilien.\r\nJoueur du PSG entre 2012 et 2017, Maxwell a énormément app… [+1073 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "Football Ligue 1 - TV : Zéro solidarité, Canal+ et BeIN défoncés - Foot01.com", "description": "Les difficultés financières des clubs français sont la conséquences directe de la crise mondiale de Coronavirus. Mais Canal+ comme BeIN Sports n'ont clairement pas aidé. \r\nC’est l’annonce qui a fait basculer les clubs professionnels dans le rouge. Peu…", "url": "https://www.foot01.com/ligue1/tv-zero-solidarite-canal-et-bein-defonces,347849", "urlToImage": "https://www.foot01.com/img/images/1920x1080/2020/Apr/23/tv-zero-solidarite-canal-et-bein-defonces-icon_ruh_270319_12_47,283439.jpg", "publishedAt": "2020-04-24T07:04:09Z", "content": "Les difficultés financières des clubs français sont la conséquences directe de la crise mondiale de Coronavirus. Mais Canal+ comme BeIN Sports n'ont clairement pas aidé.\r\nCest lannonce qui a fait basculer les clubs professionnels dans le rouge. Peu après lint… [+1418 chars]"}, {"source": {"id": null, "name": "Lesviolets.com"}, "author": "https://facebook.com/lesvioletscom/", "title": "Le TFC à l'arrêt total, l'incertitude plane, l'inquiétude monte, la L2 pointe le bout de son nez - LesViolets.Com", "description": "Petit &agrave; petit, on y voit plus clair et, heureusement ou malheureusement, le maintien du TFC semble de plus en plus compromis...", "url": "https://www.lesviolets.com/actu/le-tfc-a-l-arret-total-l-incertitude-plane-l-inquietude-monte-la-l2-pointe-le-bout-de-son-nez,53401.html", "urlToImage": "https://www.lesviolets.com/../imagesV2/20192020/TFC_Rennes/boisgard-sangare-tfc-rennes-camavinga.png", "publishedAt": "2020-04-24T06:30:00Z", "content": "Petit à petit, on y voit plus clair et, heureusement ou malheureusement, le maintien du TFC semble de plus en plus compromis. D’abord, parce que la priorité de la Ligue reste la reprise de la saison, et l’écart est bien trop important pour parvenir à un énièm… [+2269 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Augustin Delaporte", "title": "La fédération anglaise inculpe Eric Dier pour son comportement - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a3513988886731996059-la-federation-anglaise-inculpe-eric-dier-pour-son-comportement-lors-du-match-face-a-norwich", "urlToImage": "https://assets-fr.imgfoot.com/media/cache/1200x675/dier1.jpg", "publishedAt": "2020-04-24T06:22:24Z", "content": "La réponse aura mis le temps mais elle est arrivée. Plus dun mois après lincident intervenu lors du 8e de finale de FA Cup entre Tottenham et Norwich du 4 mars (victoire aux tirs aux buts des Canaries), qui avait vu Eric Dier régler ses comptes avec un suppor… [+515 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "francetv sport", "title": "Des députés plaident pour plus de sport à l'école lors du déconfinement - France tv sport", "description": "Lundi dernier, 21 députés ont adressé une lettre aux ministres Roxana Maracineanu et Jean-Michel Blanquer afin de leur proposer un renforcement du sport à l’école pendant le déconfinement et le retour à l’école progressif dès le 11 mai. Cette solution pourrai…", "url": "https://sport.francetvinfo.fr/omnisport/des-deputes-plaident-pour-plus-de-sport-lecole-lors-du-deconfinement", "urlToImage": "https://assets.sport.francetvinfo.fr/sites/default/files/styles/large_16_9/public/2020-04/guillaume_bonnefontip3.jpg?itok=jdaWu1Lo", "publishedAt": "2020-04-24T06:20:34Z", "content": "Lundi dernier, 21 députés ont adressé une lettre aux ministres Roxana Maracineanu et Jean-Michel Blanquer afin de leur proposer un renforcement du sport à lécole pendant le déconfinement et le retour à lécole progressif dès le 11 mai. Cette solution pourrait,… [+11044 chars]"}, {"source": {"id": null, "name": "Laprovence.com"}, "author": "Ludovic Ferro (avec J.Lo.)", "title": "Coronavirus : pas de saison blanche pour l'UEFA - La Provence", "description": "Ils n'auront au moins pas fait tout ce chemin pour rien. Les hommes d'André Villas-Boas, auteurs d'un parcours remarquable depuis août, ne seront pas victimes d'une saison blanche s'il s'avérait impossible de terminer le championnat de France. C'est ce qu'a c…", "url": "https://www.laprovence.com/article/om/5970353/coronavirus-pas-de-saison-blanche-pour-luefa.html", "urlToImage": "https://images.laprovence.com/media/hermes/2020-04/2020-04-24/20200424_1_7_1_1_0_obj22510843_1.jpg?twic=v1/focus=0x0/cover=993x520", "publishedAt": "2020-04-24T06:09:26Z", "content": "Ils n'auront au moins pas fait tout ce chemin pour rien. Les hommes d'André Villas-Boas, auteurs d'un parcours remarquable depuis août, ne seront pas victimes d'une saison blanche s'il s'avérait impossible de terminer le championnat de France. C'est ce qu'a c… [+3064 chars]"}, {"source": {"id": null, "name": "Lephoceen.fr"}, "author": "Le Phocéen", "title": "Pour Griezmann, le Vélodrome, c'est le top - Le Phoceen", "description": "L'attaquant des Bleus et du Barça ne cache pas son amour pour le stade de l'OM.", "url": "https://www.lephoceen.fr/infos-om/autour-de-l-om/pour-griezmann-le-velodrome-c-est-le-top-178234", "urlToImage": "https://static.lephoceen.net/images/une/180807_Velodrome.jpg", "publishedAt": "2020-04-24T06:03:32Z", "content": "Antoine Griezmann fan de l'OM, ce n'est un secret pour personne. La star des Bleus n'a jamais caché son attirance pour le club olympien et a même déjà diffusé des photos de lui portant le maillot Ciel-et-Blanc dans son enfance.\r\nHier jeudi, répondant à des fa… [+239 chars]"}, {"source": {"id": null, "name": "Francefootball.fr"}, "author": "Olivier Bossard", "title": "Jérémy Ménez : «Quand Carlo Ancelotti vient à tes barbecues...» - France Football", "description": "Passé par Rome, Milan où Paris, Jérémy Ménez a vu Carlo Ancelotti donner de la voix pendant un barbecue, a enchaîné les parties de pokers avec Francesco Totti ou accueilli Alex Ferguson dans le salon de ses parents. Une confession à retrouver dans le numéro d…", "url": "https://www.francefootball.fr/news/Jeremy-menez-quand-carlo-ancelotti-vient-a-tes-barbecues/1129151", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/menez-jeremy/1500000001329640/0:0,2496:1664-650-400-75/270ea.jpg", "publishedAt": "2020-04-24T06:03:14Z", "content": "Passé par Rome, Milan où Paris, Jérémy Ménez a vu Carlo Ancelotti donner de la voix pendant un barbecue, a enchaîné les parties de pokers avec Francesco Totti ou accueilli Alex Ferguson dans le salon de ses parents. Une confession à retrouver dans le numéro d… [+4677 chars]"}, {"source": {"id": null, "name": "Footballclubdemarseille.fr"}, "author": "Articles FCM", "title": "OM: Didier Roustan dézingue Jacques-Henri Eyraud ! - Football Club de Marseille", "description": "Le président de l'Olympique de Marseille s'est exprimé ce mercredi  pour évoquer la reprise du championnat. Un", "url": "https://www.footballclubdemarseille.fr/om-fil-info/om-didier-roustan-dezingue-jacques-henri-eyraud.html", "urlToImage": "https://www.footballclubdemarseille.fr/wp-content/uploads/2019/06/conf-eyraud-2-910.jpg", "publishedAt": "2020-04-24T05:58:00Z", "content": "Le président de l’Olympique de Marseille s’est exprimé ce mercredi  pour évoquer la reprise du championnat. Une communication que ne comprend pas Didier Roustan…\r\nLe dirigeant de l’OM a donné son sentiment sur le scénario de reprise envisagé actuellement la L… [+849 chars]"}, {"source": {"id": null, "name": "Sudouest.fr"}, "author": "Sud Ouest", "title": "Une étude américaine affirme que la chaleur et les rayons du soleil pourraient affaiblir le coronavirus - Sud Ouest", "description": "Les scientifiques s'interrogent depuis son apparition sur la possibilité que le coronavirus s'affaiblisse avec l'arrivée de l'été dans l'hémisphère nord. Mais même si c'était le cas, cela n'empêcherait pas une deuxième vague à l'automne en l'absence de vaccin.", "url": "https://www.sudouest.fr/2020/04/24/une-etude-americaine-affirme-que-a-chaleur-et-les-rayons-du-soleil-pourraient-affaiblir-le-coronavirus-7435737-10861.php", "urlToImage": "https://images.sudouest.fr/2020/04/24/5ea27b0266a4bdbd63411502/golden/meme-si-le-virus-faiblissait.jpg", "publishedAt": "2020-04-24T05:40:00Z", "content": "Le nouveau coronavirus, responsable de la pandémie de Covid-19, s’affaiblit dans une atmosphère chaude et humide ainsi que sous les rayons du soleil, affirme une étude du gouvernement américain présentée jeudi à la Maison Blanche.\r\n\"Notre observation la plus … [+3217 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "J.-G.D.", "title": "Mercato - Barcelone : Werner aurait définitivement tranché pour son avenir ! - Le 10 Sport", "description": "Malgré des sollicitations du Barça à son égard, en tant que plan B à Lautaro Martinez, Timo Werner, avant-centre de Leipzig, donnerait sa préférence à Liverpool.", "url": "https://le10sport.com/football/mercato/mercato-barcelone-werner-aurait-definitivement-tranche-pour-son-avenir-500904", "urlToImage": "https://le10static.com/img/master/0000/0016/167878.jpeg", "publishedAt": "2020-04-24T05:30:00Z", "content": "Foot - Mercato - Barcelone\r\nPublié le 24 avril 2020 à 7h30 par J.-G.D. Malgré des sollicitations du Barça à son égard, en tant que plan B à Lautaro Martinez, Timo Werner, avant-centre de Leipzig, donnerait sa préférence à Liverpool.\r\nAuteur dune saison pleine… [+1066 chars]"}, {"source": {"id": null, "name": "Topmercato.com"}, "author": null, "title": "Man Utd : un nouveau club est entré en lice pour Pogba - Top Mercato.com", "description": "Une nouvelle formation de premier plan envisage le recrutement de Paul Pogba, le milieu de terrain français de Manchester...", "url": "http://www.topmercato.com/219536,1/man-utd---un-nouveau-club-est-entre-en-lice-pour-pogba.html", "urlToImage": "http://cdr.topmercato.com/medias/images2017/2019-12-23-paul-pogba.jpg", "publishedAt": "2020-04-24T05:19:00Z", "content": "Une nouvelle formation de premier plan envisage le recrutement de Paul Pogba, le milieu de terrain français de Manchester United.Après le Paris Saint-Germain, la Juventus Turin et le Real Madrid, l'Inter Milan songe à son tour au footballeur de 27 ans, selon … [+654 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Quels clubs ont le plus dépensé en transferts au 21e siècle ? - Sports.fr", "description": "Pas moins de 15 clubs ont déjà dépensé plus d’un milliard d’euros au 21e siècle sur le marché des transferts. A en croire certains analystes, la crise financière provoquée par la pandémie de coronavirus va provoquer un effondrement des prix pratiqués sur le m…", "url": "https://www.sports.fr/football/clubs-plus-depensiers-21e-siecle-349287.html", "urlToImage": "https://sf.sports.fr/wp-content/uploads/2020/04/iPiccy-collage-10.jpg", "publishedAt": "2020-04-24T05:08:08Z", "content": "Pas moins de 15 clubs ont déjà dépensé plus d’un milliard d’euros au 21e siècle sur le marché des transferts.\r\nA en croire certains analystes, la crise financière provoquée par la pandémie de coronavirus va provoquer un effondrement des prix pratiqués sur le … [+1195 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "20 Minutes avec AFP", "title": "Coronavirus: Le foot français ne rouvrira pas ses centres de formation cette saison - 20 Minutes", "description": "Les structures assureront cependant le suivi scolaire et sportif individualisé des jeunes en formation jusqu’à juillet", "url": "https://www.20minutes.fr/sport/2766951-20200424-coronavirus-foot-francais-rouvrira-centres-formation-saison", "urlToImage": "https://img.20mn.fr/zFj1EHP9S42BlkTmJ1O5vw/648x360_le-siege-de-la-federation-francaise-de-football-a-paris-illustration.jpg", "publishedAt": "2020-04-24T04:48:28Z", "content": "Le siège de la Fédération Française de Football à Paris (illustration). VINCENT WARTNER / 20 Minutes\r\nLa direction technique nationale de la Fédération française de football (FFF) a annoncé jeudi la fermeture jusquà la fin de saison de ses centres de préforma… [+1485 chars]"}, {"source": {"id": null, "name": "Footballclubdemarseille.fr"}, "author": "La Redaction FC Marseille", "title": "Concurrents OM : Aulas a une nouvelle idée pour tenter de jouer la Coupe d’Europe - Football Club de Marseille", "description": "Le président du club de Lyon s'est exprimé sur nouvelle fois dans les colonnes du journal L'Equipe après avoir", "url": "https://www.footballclubdemarseille.fr/om-fil-info/concurrents-om-aulas-a-une-nouvelle-idee-pour-tenter-de-jouer-la-coupe-deurope.html", "urlToImage": "https://www.footballclubdemarseille.fr/wp-content/uploads/2015/03/Aulas2013.jpg", "publishedAt": "2020-04-24T04:19:19Z", "content": "Le président du club de Lyon s’est exprimé sur nouvelle fois dans les colonnes du journal L’Equipe après avoir pris connaissance du scénario préconisé par l’UEFA en cas d’arrêt définitif des championnats. L’instance du football européen veut une qualification… [+1002 chars]"}, {"source": {"id": null, "name": "Welovetennis.fr"}, "author": null, "title": "Roland Garros > Roland Garros sera décalé d'une semaine - We Love Tennis !", "description": "Nous pouvons vous confirmer l’information du Parisien selon laquelle le tournoi de Roland-Garros sera décalé d’une semaine par rapport à la première date évoquée. Les Internationaux de France débuteront donc le 28 septembre pour finir le 11 Octobre. Le 28 est…", "url": "https://www.welovetennis.fr/roland-garros/roland-garros-sera-decale-dune-semaine", "urlToImage": "https://www.welovetennis.fr/wp-content/uploads/2020/03/Ambiance-7626.jpeg", "publishedAt": "2020-04-23T23:54:00Z", "content": "Nous pouvons vous confirmer l’information du Parisien selon laquelle le tournoi de Roland-Garros sera décalé d’une semaine par rapport à la première date évoquée. Les Internationaux de France débuteront donc le 28 septembre pour finir le 11 Octobre. Le 28 est… [+750 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": null, "title": "Coronavirus : les championnats d'Europe d'athlétisme 2020 annulés - Le Monde", "description": "La compétition, qui devait se dérouler à Paris dans la foulée des Jeux olympiques, du 25 au 30 août, n’aura finalement pas lieu. Un temps envisagé, le report à 2021 a été abandonné.", "url": "https://www.lemonde.fr/sport/article/2020/04/24/coronavirus-les-championnats-d-europe-d-athletisme-2-020-annules_6037581_3242.html", "urlToImage": "https://img.lemde.fr/2017/08/14/74/0/1960/980/1440/720/60/0/a25932c_3630-cik9ia.4h0hrara4i.jpg", "publishedAt": "2020-04-23T23:13:39Z", "content": "Mélina Robert-Michon et les athlètes de léquipe de France ne disputeront pas les championnats dEurope à Paris, annulés à cause de la pandémie de Covid-19. FABRIZIO BENSCH / REUTERS\r\nMaintenus ou reportés ? Cest finalement une troisième option, plus radicale e… [+5117 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": null, "title": "\"Je vais te tuer\" : Monzon - Benvenuti, naissance d'un roi et chute d'une idole - Eurosport - FRANCE (FR)", "description": null, "url": "https://www.eurosport.fr/unsupported.html", "urlToImage": null, "publishedAt": "2020-04-23T22:39:36Z", "content": "Your browser is not supported by Eurosport.\r\nPlease ensure you are using a recent version of\r\n Chrome or Firefox."}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Hugo Lloris (Tottenham) à propos de la reprise : « La santé est au-dessus » de l'aspect économique - Foot - Coronavirus - L'Équipe.fr", "description": "Le capitaine de l'équipe de France Hugo Lloris estime que la santé est plus importante que l'aspect économique en ce qui concerne la reprise du football malgré l'épidémie de Covid-19.", "url": "https://www.lequipe.fr/Football/Actualites/Hugo-lloris-tottenham-a-propos-de-la-reprise-la-sante-est-au-dessus-de-l-aspect-economique/1129333", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/lloris-est-admiratif-des-soignants-p-gherdoussi-l-equipe/1500000001329864/0:0,1995:1330-640-427-75/56222.jpg", "publishedAt": "2020-04-23T21:05:04Z", "content": "Le gardien de Tottenham a longuement évoqué son admiration pour le personnel soignant : « Notre fierté, ce sont ces gens en première ligne. Il faut les encourager, les soutenir et les mettre en avant. Leur action est incroyable. Nos vrais héros, ce sont les s… [+183 chars]"}, {"source": {"id": null, "name": "Lacommere43.fr"}, "author": "Redaction", "title": "Coronavirus : un joueur de l'ASSE offre 15000 masques au CHU de Saint-Etienne - La Commère 43", "description": "C'est un cadeau bienvenu pour l'Hôpital Nord de Saint-Etienne qui consomme plusieurs dizaines de milliers de masques chaque semaine. Ce don de 15 000 masques émane d'un joueur professionnel de l'AS Saint-Etienne, en l'occurence Yann M'Vila. Le milieu de terra…", "url": "https://www.lacommere43.fr/actualites/item/30763-coronavirus-un-joueur-de-l-asse-offre-15000-masques-au-chu-de-saint-etienne.html", "urlToImage": "https://www.lacommere43.fr/media/k2/items/cache/a91a06745097f8b3b9523f24f782c476_M.jpg", "publishedAt": "2020-04-23T20:45:00Z", "content": "C'est un cadeau bienvenu pour l'Hôpital Nord de Saint-Etienne qui consomme plusieurs dizaines de milliers de masques chaque semaine.\r\nCe don de 15 000 masques émane d'un joueur professionnel de l'AS Saint-Etienne, en l'occurence Yann M'Vila. Le milieu de terr… [+1152 chars]"}, {"source": {"id": null, "name": "Lephoceen.fr"}, "author": "Le Phocéen", "title": "Thauvin prêt à partir libre dans un an ? - Le Phoceen", "description": "L'avenir de Florian Thauvin à l'OM reste flou...", "url": "https://www.lephoceen.fr/infos-om/saison/thauvin-pret-a-partir-libre-dans-un-an-178231", "urlToImage": "https://static.lephoceen.net/images/une/200308_thauvin.jpg", "publishedAt": "2020-04-23T20:37:33Z", "content": "Le dossier Florian Thauvin a été évoqué dans l'émission Team Duga sur RMC ce jeudi soir. Alors que Le 10 Sport glissait il y a quelques jours que la prolongation de Thauvin était au coeur des préoccupations des dirigeants de lOM, le journaliste et corresponda… [+1799 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "J.-G.D.", "title": "Mercato - ASSE : La mise au point de cette pépite de Puel sur son avenir ! - Le 10 Sport", "description": "Récemment prolongé par l’ASSE, Wesley Fofana, formé dans le Forez, ne cache pas son bien-être chez les Verts.", "url": "https://le10sport.com/football/mercato/mercato-asse-la-mise-au-point-de-cette-pepite-de-puel-sur-son-avenir-500878", "urlToImage": "https://le10static.com/img/master/0000/0016/167866.jpeg", "publishedAt": "2020-04-23T20:30:00Z", "content": "Publié le 23 avril 2020 à 22h30 par J.-G.D. Récemment prolongé par lASSE, Wesley Fofana, formé dans le Forez, ne cache pas son bien-être chez les Verts.\r\nComme vous lindique Le 10 Sport en exclusivité, lASSE va sonder le marché des transferts afin de trouver … [+1283 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Marc Ventouillac", "title": "Coronavirus : les propos sur le sport de la ministre Roxana Maracineanu ont créé de sacrés remous - Tous sports - L'Équipe.fr", "description": "Les formules chocs de la ministre sur le sport qui n'est pas prioritaire ou l'annulation possible de certains grands événements ont fait réagir.", "url": "https://www.lequipe.fr/Tous-sports/Article/Coronavirus-les-propos-sur-le-sport-de-la-ministre-roxana-maracineanu-ont-cree-de-sacres-remous/1129317", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/les-propos-tenus-par-roxana-maracineanu-ont-fortement-perturbe-le-monde-du-sport-face-a-l-emotion-s/1500000001329845/320:110,1469:1259-640-640-75/bc0f8.jpg", "publishedAt": "2020-04-23T20:24:00Z", "content": "Les smartphones de Roxana Maracineanu et des membres de son cabinet ont beaucoup sonné jeudi. « Énormément de messages, confie un proche. Pour s'indigner ou pour la remercier d'avoir tenu un message franc. »"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Cedric Rablat", "title": "FC Barcelone : Naples prêt à lancer l'offensive pour Samuel Umtiti - Foot Mercato", "description": "Le Barça ne verrait pas d'un mauvais œil le départ de son champion du monde français. Très apprécié en Premier League, l'ancien Lyonnais voit un nouveau prétendant se manifester pour l'accueillir l'été prochain. Mais le club acquéreur devra se montrer généreu…", "url": "https://www.footmercato.net/a6362077995552762459-fc-barcelone-naples-pret-a-lancer-loffensive-pour-samuel-umtiti", "urlToImage": "https://assets-fr.imgfoot.com/media/cache/1200x675/umtiti.jpg", "publishedAt": "2020-04-23T19:30:09Z", "content": "La pandémie de coronavirus a plongé le FC Barcelone dans une crise financière sans précédent. Le champion d'Espagne qui a déjà dû demander à ses ouailles de baisser sensiblement leurs émoluments, se montrera moins offensif que prévu lors du prochain mercato e… [+2094 chars]"}, {"source": {"id": null, "name": "Orange.fr"}, "author": "Media365", "title": "Mercato : Le PSG pense à un latéral français - Toute l'actualité sportive sur Orange", "description": "A la recherche d'un latéral, le PSG aurait jeté son dévolu sur Théo Hernandez d'après Tutto Sport.", "url": "https://sports.orange.fr/football/italie/article/mercato-le-psg-pense-a-un-lateral-francais-CNT000001pEnpb.html", "urlToImage": "http://media3.woopic.com/api/v1/images/504%2Fmedia365-sport-news%2F301%2Fc5f%2Fe95f07095b0bdf57c5bcb88d37%2Fmercato-le-psg-pense-a-un-lateral-francais%7C9740042_theo-hernandez-1024x425_ext.jpg?format=470x264&facedetect=1&quality=85", "publishedAt": "2020-04-23T19:00:00Z", "content": "Rédaction , publié le jeudi 23 avril 2020 à 21h00\r\nA la recherche d'un latéral, le PSG aurait jeté son dévolu sur Théo Hernandez d'après Tutto Sport.\r\nLe Paris Saint-Germain pourrait se renforcer sur les flancs de sa défense l'été prochain. Les départs de Tho… [+855 chars]"}, {"source": {"id": null, "name": "Dzfoot.com"}, "author": null, "title": "Pays Bas : Vers l'annulation des championnats ? - DZ Foot", "description": "Le championnat hollandais de football (Eredivisie) est suspendu jusqu'au mois de septembre. C'est ce qu'a indiqué le premier ministre néerlandais, Mark Rutte. À vrai dire aucun événement sportif n'aura lieu avant le mois de septembre à cause du COVID-19. La f…", "url": "http://www.dzfoot.com/2020/04/23/pays-bas-vers-lannulation-des-championnats-180468.php", "urlToImage": "http://www.dzfoot.com/wp-content/uploads/2020/02/ddarfalou.jpg", "publishedAt": "2020-04-23T16:37:10Z", "content": "Le championnat hollandais de football (Eredivisie) est suspendu jusqu'au mois de septembre. C'est ce qu'a indiqué le premier ministre néerlandais, Mark Rutte. À vrai dire aucun événement sportif n'aura lieu avant le mois de septembre à cause du COVID-19.\r\nLa … [+639 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "UEFA : reporté en 2021, l'Euro 2020 ne change pas de nom - Foot - UEFA - L'Équipe.fr", "description": "L'UEFA a confirmé que l'Euro 2020, bien que reporté à l'été 2021 en raison de la pandémie de coronavirus, conserverait son appellation.", "url": "https://www.lequipe.fr/Football/Actualites/Uefa-reporte-en-2021-l-euro-2020-ne-change-pas-de-nom/1129229", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/meme-joue-en-2021-ce-sera-l-euro-2020-silvia-lore-presse-sports/1500000001329753/150:316,1074:931-640-427-75/53a0c.jpg", "publishedAt": "2020-04-23T16:04:55Z", "content": "L'UEFA a confirmé jeudi que l'Euro 2020, bien que reporté à l'été 2021 en raison du coronavirus, conserverait son appellation. Son Comité exécutif, réuni par visioconférence, a bien validé le statu quo.\r\nIl permet à l'UEFA de « maintenir sa vision originelle … [+649 chars]"}, {"source": {"id": null, "name": "Francebleu.fr"}, "author": "Alexandre Audabram", "title": "Le Stade de Reims vers une qualification en Coupe d'Europe ? Ca se précise... - France Bleu", "description": "Si le championnat de Ligue 1 ne pouvait pas reprendre, les methodes de calcul du classement, préconisées ce jeudi par l'UEFA, permettent au club rémois de terminer la saison à la 5e place et de rejoindre la phase de poules de la Ligue Europa. L'instance exclu…", "url": "https://www.francebleu.fr/sports/football/le-stade-de-reims-vers-une-qualification-en-coupe-d-europe-ca-se-precise-1587647940", "urlToImage": "https://cdn.radiofrance.fr/s3/cruiser-production/2020/04/5f6761b5-0eaf-4178-a46e-ac15807c6ad4/870x489_000_1oq4nj.jpg", "publishedAt": "2020-04-23T14:56:40Z", "content": "Même si l'on est encore loin du dénouement de cette saison 2019-2020 de Ligue 1, tant sur le terrain que sur le plan administratif si besoin, les préconisations de l'UEFA (l'instance européenne du football) pourraient permettre au Stade de Reims de disputer u… [+3287 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/marc.alvarez1", "title": "La Bundesliga est “prête” à redémarrer le 9 mai - Canal Supporters", "description": "L’Allemagne montrera-t-elle la voie ? La Bundesliga est prête à reprendre à huis clos dès le 9 mai. Le président de la Ligue allemande (LDF), Christian Seifert, l’a annoncé lors d’une conférence de presse au terme d’une assemblée générale avec les 36 clubs du…", "url": "https://canal-supporters.com/2020/04/la-bundesliga-est-prete-a-redemarrer-le-9-mai/", "urlToImage": "https://canal-supporters.com/wp-content/uploads/2020/04/Bundesliga.jpg", "publishedAt": "2020-04-23T14:16:07Z", "content": "Auteur : Marc Alvarez 23 avril 2020\r\nL’Allemagne montrera-t-elle la voie ? La Bundesliga est prête à reprendre à huis clos dès le 9 mai. Le président de la Ligue allemande (LDF), Christian Seifert, l’a annoncé lors d’une conférence de presse au terme d’une as… [+590 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": null, "title": "Le football allemand est prêt à rejouer à compter du 9 mai - Le Monde", "description": "Les clubs de la Bundesliga ont adopté, jeudi, le principe d’une reprise à huis clos si les autorités le permettent. Ils seraient les premiers, parmi les principaux championnats européens, à renouer avec la compétition.", "url": "https://www.lemonde.fr/sport/article/2020/04/23/le-football-allemand-est-pret-a-rejouer-a-compter-du-9-mai_6037547_3242.html", "urlToImage": "https://img.lemde.fr/2020/04/22/380/0/5305/2652/1440/720/60/0/a529e1d_5562190-01-06.jpg", "publishedAt": "2020-04-23T13:12:49Z", "content": "Les grands rassemblements populaires restant interdits en Allemagne au moins jusquau 31 août, la reprise du championnat de football ne pourra se faire quà huis clos. INA FASSBENDER / AFP\r\nIls avaient déjà retrouvé, ces dernières semaines, le chemin des terrai… [+6211 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Alban Lagoutte", "title": "Ces joueurs décédés d’un accident cardiaque - Sports.fr", "description": "Ils sont censés être en parfaite santé, mais malgré une condition physique exemplaire, ont perdu la vie bien trop tôt, rattrapés par un accident cardiaque fatal. Depuis toujours, la pratique intensive du sport, aussi bon soit-il pour la santé, a aussi provoqu…", "url": "https://www.sports.fr/football/joueurs-decedes-dun-accident-cardiaque-349178.html", "urlToImage": "https://sf.sports.fr/wp-content/uploads/2020/04/astori_couv_panoramic.jpg", "publishedAt": "2020-04-23T12:58:07Z", "content": "Ils sont censés être en parfaite santé, mais malgré une condition physique exemplaire, ont perdu la vie bien trop tôt, rattrapés par un accident cardiaque fatal.\r\nDepuis toujours, la pratique intensive du sport, aussi bon soit-il pour la santé, a aussi provoq… [+1690 chars]"}, {"source": {"id": null, "name": "Parlons-basket.com"}, "author": "Guillaume Kagni", "title": "NBA - L'incident qui a cimenté la relation entre Jordan et Steve Kerr - Parlons Basket", "description": "Plus grand compétiteur de l’histoire du basket, Michael Jordan était quasiment aussi exigeant avec ses coéquipiers qu’il ne l’était avec lui-même. À l’entrainement, cela s’est souvent traduit par une intensité hors normes, et donc, de nombreuses incidents… D’…", "url": "https://www.parlons-basket.com/2020/04/23/nba-ce-qui-a-cimente-la-relation-entre-michael-jordan-et-steve-kerr/", "urlToImage": "https://www.parlons-basket.com/wp-content/uploads/2017/06/kerrjojo-e1587635248699.jpg", "publishedAt": "2020-04-23T12:39:00Z", "content": "Plus grand compétiteur de l’histoire du basket, Michael Jordan était quasiment aussi exigeant avec ses coéquipiers qu’il ne l’était avec lui-même. À l’entrainement, cela s’est souvent traduit par une intensité hors normes, et donc, de nombreuses incidents… D’… [+3005 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "La rédaction", "title": "Mercato - PSG : Icardi est bien déterminé à rejoindre l’Italie… - Le 10 Sport", "description": "Un élément semble confirmer que Mauro Icardi est déterminé à rejoindre la Serie A la saison prochaine. Analyse.", "url": "https://le10sport.com/football/mercato/mercato-psg-icardi-est-bien-determine-a-rejoindre-litalie-500823", "urlToImage": "https://le10static.com/img/master/0000/0016/167021.jpeg", "publishedAt": "2020-04-23T12:15:00Z", "content": "Publié le 23 avril 2020 à 14h15 par La rédaction Un élément semble confirmer que Mauro Icardi est déterminé à rejoindre la Serie A la saison prochaine. Analyse.\r\nLe conseiller juridique de Wanda Nara, la compagne et agent de Mauro Icardi, sest exprimé en Ital… [+1101 chars]"}, {"source": {"id": null, "name": "Welovetennis.fr"}, "author": null, "title": "WTA > Le drôle de tweet effacé par Serena Williams - We Love Tennis !", "description": "Après la pluie de commentaires positifs au sujet du projet de Roger Federer de fusionner l’ATP et la WTA, tous les observateurs attendaient avec impatience la réaction de la plus grande joueuse de tous les temps Serena Williams. Ils n’ont pas été déçus puisqu…", "url": "https://www.welovetennis.fr/wta/le-drole-de-tweet-efface-par-serena-williams", "urlToImage": "https://www.welovetennis.fr/wp-content/uploads/2020/01/Serena-Williams-AO-2020-1.jpeg", "publishedAt": "2020-04-23T08:22:00Z", "content": "Après la pluie de commentaires positifs au sujet du projet de Roger Federer de fusionner l’ATP et la WTA, tous les observateurs attendaient avec impatience la réaction de la plus grande joueuse de tous les temps Serena Williams. \r\nIls n’ont pas été déçus puis… [+1045 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Sophie Dorgan", "title": "Jean-François Caujolle, à propos d'une éventuelle fusion ATP/WTA : « C'est la même famille » - Tennis - ATP/WTA - L'Équipe.fr", "description": "Jean-François Caujolle est un fin connaisseur des arcanes du circuit. Le directeur de l'Open 13 voit d'un très bon oeil la fusion du tennis féminin et masculin.", "url": "https://www.lequipe.fr/Tennis/Article/Jean-francois-caujolle-c-est-la-meme-famille/1129093", "urlToImage": "https://medias.lequipe.fr/img-photo-jpg/jean-francois-caujolle-directeur-de-l-open-13-a-aussi-dirige-un-tournoi-feminin-a-bruxelles-n-l/1500000001329523/328:0,1659:1331-640-640-75/4586c.jpg", "publishedAt": "2020-04-23T06:00:00Z", "content": "« Que pensez-vous de la proposition de Roger Federer de fusionner les circuits WTA et ATP ?C'est une très bonne idée. Je suis un peu triste de ne pas y avoir pensé avant Roger (sourire). Cette démarche avait déjà été entamée par Chris Kermode (ancien patron d… [+458 chars]"}, {"source": {"id": null, "name": "Ledauphine.com"}, "author": "Florian LEYVASTRE", "title": "Rugby. Il n'y aura pas de Top 14 ni de Pro D2 avant la fin de l'été - Le Dauphiné Libéré", "description": "Le premier scénario de reprise mi-juillet ayant été abandonné mercredi par la LNR, les phases finales du Top 14 pourraient se dérouler fin août entre quatre équipes. Tout comme celles de ProD2, mais sans montée au bout.", "url": "https://www.ledauphine.com/sport/2020/04/23/il-n-y-aura-pas-de-top-14-ni-de-pro-d2-avant-la-fin-de-l-ete", "urlToImage": "https://cdn-s-www.ledauphine.com/images/995F5EEE-E917-40EE-9894-4ED9A2CD72B3/FB1200/photo-1582930392.jpg", "publishedAt": "2020-04-23T04:04:19Z", "content": "À l’arrêt depuis le 1er mars à cause de la pandémie de coronavirus, le Top 14 est toujours dans le flou concernant une éventuelle reprise. Mais l’horizon s’est un peu éclairci depuis mercredi. En effet, la Ligue nationale de rugby a décidé d’enterrer le proje… [+2207 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "N.C.", "title": "Coronavirus : Le ministère propose une reprise de l’entraînement le 11 mai et des compétitions à huis clos - 20 Minutes", "description": "C’est ce qui ressort du compte rendu d’une réunion sur la reprise des activités en France après le 11 mai publié mardi soir", "url": "https://www.20minutes.fr/sport/2765899-20200422-coronavirus-ministere-propose-reprise-entrainement-11-mai-competitions-huis-clos", "urlToImage": "https://img.20mn.fr/bkjM-MlNR_6obGGmfFg0QA/648x360_ministre-sports-roxana-maracineanu-lors-conference-presse-20-fevrier-2020-paris.jpg", "publishedAt": "2020-04-22T16:52:19Z", "content": "La ministre des Sports Roxana Maracineanu lors d'une conférence de presse, le 20 février 2020 à Paris. Tristan Reynaud/SIPA\r\nLa reprise des activités sportives en France se précise. En tout cas, un projet a été mis sur la table pour laprès 11 mai et la minist… [+2347 chars]"}]}