{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Footballclubdemarseille.fr"}, "author": "La Redaction FC Marseille", "title": "Mercato : L'OM se renseigne sur le meilleur dribbleur de Ligue 2 - Football Club de Marseille", "description": "Bien que l'incertitude demeure grande sur la fin de saison à cause de la pandémie du coronavirus, Marseille se", "url": "https://www.footballclubdemarseille.fr/om-fil-info/mercato-lom-se-renseigne-sur-le-meilleur-dribbleur-de-ligue-2.html", "urlToImage": null, "publishedAt": "2020-04-25T06:05:00Z", "content": "Bien que l’incertitude demeure grande sur la fin de saison à cause de la pandémie du coronavirus, Marseille semble toujours travailler sur le mercato en vu du prochain exercice. L’OM serait ainsi intéressé par un milieu de terrain évoluant en seconde division… [+990 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "B.C.", "title": "Mercato - PSG : Leonardo prêt à sauter sur une énorme occasion à 30M€ ? - Le 10 Sport", "description": "Déjà pisté par Antero Henrique du temps où il officiait au PSG, Lorenzo Pellegrini figurerait aujourd'hui dans les petits papiers de Leonardo. Et un détail pourrait inciter le directeur sportif…", "url": "https://le10sport.com/football/mercato/mercato-psg-leonardo-pret-a-sauter-sur-une-enorme-occasion-a-30meur-501031", "urlToImage": null, "publishedAt": "2020-04-25T05:45:00Z", "content": "Publié le 25 avril 2020 à 7h45 par B.C. Déjà pisté par Antero Henrique du temps où il officiait au PSG, Lorenzo Pellegrini figurerait aujourd'hui dans les petits papiers de Leonardo. Et un détail pourrait inciter le directeur sportif parisien à accélérer.\r\nC'… [+977 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "Th.B.", "title": "Mercato - PSG : Le dossier Jadon Sancho ne serait pas encore bouclé ! - Le 10 Sport", "description": "Bien que tout porterait à croire que Jadon Sancho s’engagera en faveur de Manchester United plutôt qu’au PSG, Chelsea ne lâcherait pas l’affaire pour la pépite du Borussia Dortmund.", "url": "https://le10sport.com/football/mercato/mercato-psg-le-dossier-jadon-sancho-ne-serait-pas-encore-boucle-501007", "urlToImage": null, "publishedAt": "2020-04-25T05:15:00Z", "content": "Publié le 25 avril 2020 à 7h15 par Th.B. Bien que tout porterait à croire que Jadon Sancho sengagera en faveur de Manchester United plutôt quau PSG, Chelsea ne lâcherait pas laffaire pour la pépite du Borussia Dortmund.\r\nÀ la mi-mars, ESPN révélait que Leonar… [+1011 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "T.M.", "title": "Mercato - Real Madrid : Zidane ouvre la porte à un départ d’une de ses stars ! - Le 10 Sport", "description": "Le lifting du Real Madrid ne serait clairement pas terminé. Et un gros nom pourrait bien quitter l’effectif de Zinedine Zidane cet été.", "url": "https://le10sport.com/football/mercato/mercato-real-madrid-zidane-ouvre-la-porte-a-un-depart-dune-de-ses-stars-500995", "urlToImage": null, "publishedAt": "2020-04-25T02:45:00Z", "content": "Foot - Mercato - Real Madrid\r\nPublié le 25 avril 2020 à 4h45 par T.M. Le lifting du Real Madrid ne serait clairement pas terminé. Et un gros nom pourrait bien quitter leffectif de Zinedine Zidane cet été.\r\nAprès avoir dépensé plus de 300M lété dernier, le Rea… [+1060 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "20 Minutes avec AFP", "title": "Bayern Munich: Le milieu de terrain Philippe Coutinho opéré d’une cheville - 20 Minutes", "description": "Bien que qualifiée de succès par le club, l’opération devrait empêcher le joueur de participer à la reprise du championnat allemand", "url": "https://www.20minutes.fr/sport/2767587-20200425-bayern-munich-milieu-terrain-philippe-coutinho-opere-cheville", "urlToImage": null, "publishedAt": "2020-04-25T02:43:39Z", "content": "Le milieu de terrain du Bayern Munich, Philippe Coutinho, lors d'un entrainement le 24 avril 2020. Ulrich Gamel/Action press/SIPA\r\nLe milieu de terrain du Bayern Munich Philippe Coutinho a subi une légère intervention chirurgicale à la cheville droite qui va … [+841 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "A.M.", "title": "Mercato - PSG : Les coulisses de ce très joli coup de Leonardo ! - Le 10 Sport", "description": "Arrivé en janvier 2012 en provenance du FC Barcelone, Maxwell s'est rapidement imposé comme l'une des icônes du projet QSI. Plus de hui ans après son arrivée, le Brésilien a dévoilé les coulisses de…", "url": "https://le10sport.com/football/mercato/mercato-psg-les-coulisses-de-ce-tres-joli-coup-de-leonardo-500989", "urlToImage": null, "publishedAt": "2020-04-25T02:15:00Z", "content": "Publié le 25 avril 2020 à 4h15 par A.M. Arrivé en janvier 2012 en provenance du FC Barcelone, Maxwell s'est rapidement imposé comme l'une des icônes du projet QSI. Plus de hui ans après son arrivée, le Brésilien a dévoilé les coulisses de son arrivée.\r\nC'est … [+1788 chars]"}, {"source": {"id": null, "name": "Onzemondial.com"}, "author": "La rédaction", "title": "Real Madrid : Kylian Mbappé, ça serait du sérieux ! - Onze Mondial", "description": "L'avenir de Kylian Mbappé pourrait bel et bien s'écrire du côté du Real Madrid plus tôt que prévu, si l'on en croit la nouvelle une du journal Marca.", "url": "http://www.onzemondial.com/transferts/real-madrid-kylian-mbappe-ca-serait-du-serieux-216455", "urlToImage": null, "publishedAt": "2020-04-24T22:58:58Z", "content": "Zapping Onze Mondial Onze Demande - PSG : Cavani doit-il être titulaire ?\r\nKylian Mbappé ne l'a jamais caché, il a toujours aimé Cristiano Ronaldo et rêvé du Real Madrid. A l'époque déjà, où il a quitté Monaco, il a déjà eu une proposition des Merengue, qu'il… [+627 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Maxime Barbaud", "title": "Javier Tebas prévient les clubs de Liga - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a6152603095407602721-javier-tebas-previent-les-clubs-de-liga", "urlToImage": null, "publishedAt": "2020-04-24T22:04:28Z", "content": "La Liga est encore dans le flou. Javier Tebas, le président de la ligue espagnole, a tenu une réunion téléphonique dans laquelle il donne plusieurs directives pour la suite. L'une d'elles menace clairement les clubs qui s'opposeront à la reprise de la compéti… [+365 chars]"}, {"source": {"id": null, "name": "Football365.fr"}, "author": "Rédaction", "title": "Pays-Bas : un club dénonce « le plus gros scandale de l’histoire » - Football365", "description": "La décision des instances néerlandaises de geler la saison d'Eredivisie a engendré de multiples réactions aux Pays-Bas.", "url": "https://www.football365.fr/saison-annulee-aux-pays-bas-un-club-denonce-le-plus-gros-scandale-de-lhistoire-9821276.html", "urlToImage": null, "publishedAt": "2020-04-24T21:40:02Z", "content": "Pour la première fois depuis 1945, une saison d’Eredivisie sera annulée. Les instances néerlandaises ont acté cette décision ce vendredi, quelques jours après avoir annoncé que le championnat n’irait pas à son terme. Cette décision a évidemment engendré de mu… [+904 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "Saint-Étienne: Robert Herbin hospitalisé dans un état grave - RMC Sport", "description": "Robert Herbin, 81 ans, ancien joueur et entraîneur historique de l'AS Saint-Étienne, est hospitalisé depuis plusieurs jours. Son état de santé est jugé grave.", "url": "https://rmcsport.bfmtv.com/football/saint-etienne-robert-herbin-hospitalise-dans-un-etat-grave-1900428.html", "urlToImage": null, "publishedAt": "2020-04-24T21:39:35Z", "content": null}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Angleterre : Chelsea a levé son option de prolongation pour Olivier Giroud - Foot - ANG - L'Équipe.fr", "description": "Les dirigeants anglais ont décidé de lever l'option qu'ils avaient sur l'avenir de l'attaquant français, désormais lié avec les Blues jusqu'en juin 2021.", "url": "https://www.lequipe.fr/Football/Actualites/Angleterre-chelsea-a-leve-son-option-de-prolongation-pour-olivier-giroud/1129610", "urlToImage": null, "publishedAt": "2020-04-24T21:28:05Z", "content": "Les choses changent vite dans la carrière d'Olivier Giroud. Il y a quelques mois, on évoquait son départ de Chelsea, une relation compliquée avec l'entraîneur Frank Lampard, et une signature dans un club italien. L'Inter Milan et la Lazio semblaient tenir la … [+704 chars]"}, {"source": {"id": null, "name": "Lephoceen.fr"}, "author": "Le Phocéen", "title": "Eyraud a fait le point avec les supporters - Le Phoceen", "description": "Le président de l'OM a échangé avec les supporters marseillais.", "url": "https://www.lephoceen.fr/infos-om/saison/eyraud-a-fait-le-point-avec-les-supporters-178257", "urlToImage": null, "publishedAt": "2020-04-24T21:17:02Z", "content": "La crise sanitaire n'empêche pas la direction de l'OM de maintenir le lien avec ses supporters. RMC Sport dévoile en effet que Jacques-Henri Eyraud a échangé avec les principaux groupes de supporters, en visioconférence, ce vendredi soir.\r\nLe président marsei… [+611 chars]"}, {"source": {"id": null, "name": "Allezpaillade.com"}, "author": null, "title": "[Junior Sambia] Des nouvelles un peu plus rassurantes - AllezPaillade.com", "description": "Frédéric Guerra est l'agent de Junior Sambia. Pour L'Equipe, il a rapporté des nouvelles rassurantes du Pailladin. Si les résultats ne sont pas encore connus, les médecins ont lancé un proto", "url": "https://www.allezpaillade.com/actualites/breves/junior-sambia-des-nouvelles-un-peu-plus-rassurantes/", "urlToImage": null, "publishedAt": "2020-04-24T21:16:00Z", "content": "Frédéric Guerra est l’agent de Junior Sambia. Pour L’Equipe, il a rapporté des nouvelles rassurantes du Pailladin. Si les résultats ne sont pas encore connus, les médecins ont lancé un protocole de réveil dans la soirée:\r\n« J’ai des nouvelles par Bruno Carott… [+697 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Yannick Sagorin", "title": "Aulas, le nouveau taquet à l’OM - Sports.fr", "description": "Le président de l’OL Jean-Michel Aulas ne manque jamais une occasion de tacler son rival marseillais. Ce vendredi encore sur la chaîne de son club. « Gouverner, c’est prévoir », consent ce vendredi soir Jean-Michel Aulas au détour d’un entretien diffusé sur l…", "url": "https://www.sports.fr/football/aulas-nouveau-taquet-a-lom-349466.html", "urlToImage": null, "publishedAt": "2020-04-24T21:13:47Z", "content": "Le président de lOL Jean-Michel Aulas ne manque jamais une occasion de tacler son rival marseillais. Ce vendredi encore sur la chaîne de son club.\r\n« Gouverner, cest prévoir », consent ce vendredi soir Jean-Michel Aulas au détour dun entretien diffusé sur la … [+1967 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "NBA : Kobe Bryant avait filmé sa dernière saison avec les Los Angeles Lakers - Basket - NBA - L'Équipe.fr", "description": "La sortie de « The Last Dance », documentaire racontant la saison 1997-1998 des Chicago Bulls de Michael Jordan, pourrait appeler un autre film, relatant la dernière saison de Kobe Bryant.", "url": "https://www.lequipe.fr/Basket/Actualites/Nba-kobe-bryant-avait-filme-sa-derniere-saison-avec-les-los-angeles-lakers/1129599", "urlToImage": null, "publishedAt": "2020-04-24T21:05:51Z", "content": "Alors que la planète basket découvre les premiers épisodes de « The Last Dance », documentaire qui nous plonge dans les coulisses de la saison 1997-1998 des Chicago Bulls (celle d'un sixième titre), la promesse d'un récit similaire autour de Kobe Bryant, mort… [+1136 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "A.D.", "title": "Mercato - Real Madrid : Raiola pourrait totalement chambouler le dossier Van de Beek ! - Le 10 Sport", "description": "La Juventus serait prête à concurrence le Real Madrid pour Donny Van de Beek. Pour devancer le club merengue, La Vieille Dame aurait un soutien de poids : Mino Raiola.", "url": "https://le10sport.com/football/mercato/mercato-real-madrid-raiola-pourrait-totalement-chambouler-le-dossier-van-de-beek-500937", "urlToImage": null, "publishedAt": "2020-04-24T21:00:00Z", "content": "Foot - Mercato - Real Madrid\r\nPublié le 24 avril 2020 à 23h00 par A.D. La Juventus serait prête à concurrence le Real Madrid pour Donny Van de Beek. Pour devancer le club merengue, La Vieille Dame aurait un soutien de poids : Mino Raiola. \r\nMino Raiola pourra… [+1246 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Bleus : Antoine Griezmann, un indispensable de Didier Deschamps - Foot - Bleus - L'Équipe.fr", "description": "Depuis qu'il a pris la tête des Bleus en 2012, Didier Deschamps a l'habitude de faire confiance à des fidèles soldats, des joueurs qu'il a toujours défendus contre vents et marées et qui, bien souvent, lui ont rendu sa confiance. Une liste dans laquelle figur…", "url": "https://www.lequipe.fr/Football/Actualites/Bleus-antoine-griezmann-un-indispensable-de-didier-deschamps/1129592", "urlToImage": null, "publishedAt": "2020-04-24T20:44:04Z", "content": "Avec les Bleus, Antoine Griezmann a connu les larmes lors de la Coupe du monde 2014 et l'Euro 2016, et la joie du titre de champion du monde en Russie, en 2018. Trois campagnes qui prouvent à quel point l'attaquant de l'équipe de France fait partie des plans … [+41 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Suède : Zlatan Ibrahimovic marque avec Hammarby en amical - Foot - SUE - L'Équipe.fr", "description": "L'attaquant, qui s'entraîne en Suède avec Hammarby, un club dont il possède des parts, a inscrit un but en amical.", "url": "https://www.lequipe.fr/Football/Actualites/Suede-zlatan-ibrahimovic-marque-avec-hammarby-en-amical/1129591", "urlToImage": null, "publishedAt": "2020-04-24T20:42:22Z", "content": "Aujourd'hui, l'attaquant a d'ailleurs participé à une triangulaire amicale avec deux autres équipes locales, Bajans et IK Frej. Durant ces oppositions, l'attaquant de 38 ans est même parvenu à inscrire un but. Ibrahimovic s'est dit très heureux de pouvoir s'e… [+113 chars]"}, {"source": {"id": null, "name": "Parlons-basket.com"}, "author": "Mathieu Seguin", "title": "NBA - Quand Michael Jordan donnait les 4 joueurs modernes qui auraient réussi à son époque - Parlons Basket", "description": "Directement concerné par la génération actuelle de joueurs, Michael Jordan s’était exprimé en 2013 pour lister les joueurs qui auraient pu cartonner à son époque d’après lui. Et il y a forcément du beau monde. Michael Jordan est incontestablement l’homme du m…", "url": "https://www.parlons-basket.com/2020/04/24/nba-quand-michael-jordan-donnait-les-4-joueurs-modernes-qui-auraient-reussi-a-son-epoque/", "urlToImage": null, "publishedAt": "2020-04-24T20:18:00Z", "content": "Directement concerné par la génération actuelle de joueurs, Michael Jordan s’était exprimé en 2013 pour lister les joueurs qui auraient pu cartonner à son époque d’après lui. Et il y a forcément du beau monde.\r\nMichael Jordan est incontestablement l’homme du … [+1973 chars]"}, {"source": {"id": null, "name": "Lephoceen.fr"}, "author": "Le Phocéen", "title": "La LFP fixe une possible date de reprise des entraînements - Le Phoceen", "description": "La LFP espère que les entraînements reprendront au mois de mai.", "url": "https://www.lephoceen.fr/infos-om/autour-de-l-om/la-lfp-fixe-une-possible-date-de-reprise-des-entrainements-178256", "urlToImage": null, "publishedAt": "2020-04-24T20:08:09Z", "content": "Réuni ce vendredi, le bureau du conseil d'administration de la LFP a poursuivi ses travaux sur la possible reprise du championnat à la mi-juin, sous réserve de connaître les modalités de déconfinement. En ce sens, la date d'une reprise des entraînements a été… [+714 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Pourquoi les clubs de foot de Ligue 1 s'obstinent-ils à vouloir reprendre malgré le Covid-19 ? - Edition du soir Ouest France - 24/04/2020 - Ouest-France", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMijQFodHRwczovL3d3dy5vdWVzdC1mcmFuY2UuZnIvc3BvcnQvZm9vdGJhbGwvcG91cnF1b2ktbGVzLWNsdWJzLWRlLWZvb3QtZGUtbGlndWUtMS1zLW9ic3RpbmVudC1pbHMtdm91bG9pci1yZXByZW5kcmUtbWFsZ3JlLWxlLWNvdmlkLTE5LTY4MTcxOTbSAQA?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T20:00:29Z", "content": null}, {"source": {"id": "liberation", "name": "Libération"}, "author": "Etienne Baldit", "title": "Covid-19 : Roxana Maracineanu chahutée pour avoir dit que «le sport n'est pas prioritaire» - Libération", "description": "Parlant cash de la sortie de crise sanitaire, la ministre des Sports s'est attirée les foudres de certaines figures du monde du sport et de ses prédécesseurs.", "url": "https://www.liberation.fr/politiques/2020/04/24/covid-19-roxana-maracineanu-chahutee-pour-avoir-dit-que-le-sport-n-est-pas-prioritaire_1786285", "urlToImage": null, "publishedAt": "2020-04-24T19:28:12Z", "content": "Search\r\nDirect\r\nUser\r\n100\r\nZoom\r\nQuiz\r\n?\r\nLibération Diamond\r\nclock\r\nxml\r\nnetvibes\r\nlive\r\nanciens-numeros\r\ndata\r\ndesintox\r\ndiapo\r\nedito\r\nelection-2017\r\nelection\r\nessentiel\r\ngenerique\r\nidee\r\njo\r\nnext\r\nportrait\r\nradio\r\nson\r\nalerte\r\ntop-100\r\nstar\r\nune\r\nvideo\r\nsc… [+398 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "OM : Thauvin est bien gentil, Dugarry règle son cas - Foot01.com", "description": "L'avenir de Florian Thauvin interpelle à l'OM, où un transfert pour un montant record n'est plus du tout à l'ordre du jour.\r\nLa pause forcée dans le monde du football va permettre à plusieurs blessés de longue date de repartir sur de bonnes bases. C’est…", "url": "https://www.foot01.com/equipe/marseille/om-thauvin-est-bien-gentil-dugarry-regle-son-cas,347893", "urlToImage": null, "publishedAt": "2020-04-24T18:46:50Z", "content": "L'avenir de Florian Thauvin interpelle à l'OM, où un transfert pour un montant record n'est plus du tout à l'ordre du jour.\r\nLa pause forcée dans le monde du football va permettre à plusieurs blessés de longue date de repartir sur de bonnes bases. Cest le cas… [+1664 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "J.-G.D.", "title": "Mercato - PSG : Mourinho serait passé à l'action pour Meunier ! - Le 10 Sport", "description": "Toujours dans l’attente de nouvelles du PSG concernant sa prolongation, Thomas Meunier en aurait profité afin de s’entretenir avec José Mourinho entraîneur de Tottenham.", "url": "https://le10sport.com/football/mercato/mercato-psg-mourinho-aurait-bouge-ses-pions-pour-meunier-501030", "urlToImage": null, "publishedAt": "2020-04-24T18:45:00Z", "content": "Publié le 24 avril 2020 à 20h45 par J.-G.D. Toujours dans lattente de nouvelles du PSG concernant sa prolongation, Thomas Meunier en aurait profité afin de sentretenir avec José Mourinho entraîneur de Tottenham.\r\nÀ quelques semaines de la fin de son contrat a… [+1126 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "T.M.", "title": "Mercato - Real Madrid : Setien et Guardiola pourraient avoir leur mot à dire pour Camavinga ! - Le 10 Sport", "description": "Alors qu’Eduardo Camavinga se rapproche un peu plus chaque jour du Real Madrid, le FC Barcelone et Manchester City pourraient encore relancer l’avenir de la pépite de Rennes.", "url": "https://le10sport.com/football/mercato/mercato-real-madrid-setien-et-guardiola-pourraient-avoir-leur-mot-a-dire-pour-camavinga-500980", "urlToImage": null, "publishedAt": "2020-04-24T18:30:00Z", "content": "Foot - Mercato - Real Madrid\r\nPublié le 24 avril 2020 à 20h30 par T.M. Alors quEduardo Camavinga se rapproche un peu plus chaque jour du Real Madrid, le FC Barcelone et Manchester City pourraient encore relancer lavenir de la pépite de Rennes.\r\n« Espérons-nou… [+1056 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "PSG : La Juve a 4 arguments pour Icardi, Leonardo risque de craquer - Foot01.com", "description": "Intéressée par l’attaquant Mauro Icardi, que le Paris Saint-Germain devrait recruter via l’option d’achat de son prêt, la Juventus Turin possède plusieurs atouts pour convaincre le club de la capitale.\r\nLa tendance se confirme pour Mauro Icardi. Malgré…", "url": "https://www.foot01.com/equipe/paris/psg-la-juve-a-4-arguments-pour-icardi-leonardo-risque-de-craquer,347907", "urlToImage": null, "publishedAt": "2020-04-24T18:24:58Z", "content": "Intéressée par lattaquant Mauro Icardi, que le Paris Saint-Germain devrait recruter via loption dachat de son prêt, la Juventus Turin possède plusieurs atouts pour convaincre le club de la capitale.\r\nLa tendance se confirme pour Mauro Icardi. Malgré un début … [+1216 chars]"}, {"source": {"id": null, "name": "Rugbyrama.fr"}, "author": "Rugbyrama", "title": "Coronavirus - FFR : le congrès fédéral annuel est annulé - Rugbyrama.fr", "description": "CORONAVIRUS - Alors que le congrès fédéral annuel devait se tenir à Marseille, du 2 au 4 juillet prochain, le bureau a fait le choix ce vendredi de l'annuler \"suite aux dernières directives gouvernementales interdisant tout rassemblement jusqu’à mi-juillet.\" …", "url": "https://www.rugbyrama.fr/rugby/coronavirus/2020/coronavirus-ffr-le-congres-federal-annuel-est-annule_sto7734276/story.shtml", "urlToImage": null, "publishedAt": "2020-04-24T18:23:03Z", "content": "Deux décisions fortes, en temps de crise, que le président de la FFR Bernard Laporte a commenté via un communiqué : \"Lannulation du Congrès, le grand rassemblement annuel du rugby français fut une décision difficile à prendre mais indispensable eu égard des d… [+538 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "D.M.", "title": "Mercato - PSG : Excellente nouvelle pour Leonardo avec Pjanic ! - Le 10 Sport", "description": "Alors que la presse espagnole annonçait qu’un échange entre Miralem Pjanic et le joueur du FC Barcelone Arthur était en préparation, la Juventus opterait finalement pour un transfert sec de son…", "url": "https://le10sport.com/football/mercato/mercato-psg-excellente-nouvelle-pour-leonardo-avec-pjanic-501012", "urlToImage": null, "publishedAt": "2020-04-24T18:15:00Z", "content": "Publié le 24 avril 2020 à 20h15 par D.M. Alors que la presse espagnole annonçait quun échange entre Miralem Pjanic et le joueur du FC Barcelone Arthur était en préparation, la Juventus opterait finalement pour un transfert sec de son milieu de terrain.\r\nLe PS… [+1515 chars]"}, {"source": {"id": null, "name": "Lebuteur.com"}, "author": "Kreo", "title": "International : OL : Aulas donne des précisions concernant Houssem Aouar - Le Buteur", "description": "International A l'occasion d'une interview accordée à OL-TV, Jean-Michel Aulas a évoqué le prochain mercato estival et plus particulièrement l'avenir de son milieu de terrain Houssem Aouar", "url": "http://www.lebuteur.com/article/detail?titre=ol-aulas-donne-des-precisions-concernant-houssem-aouar&id=95723", "urlToImage": null, "publishedAt": "2020-04-24T18:12:00Z", "content": "Dans le viseur de plusieurs grands clubs européens dont la Juventus Turin et Manchester City notamment, le jeune lyonnais pourrait néanmoins rester au moins une saison supplémentaire du coté de l'Olympique Lyonnais. \"C'est un des grands talents de l'effectif.… [+290 chars]"}, {"source": {"id": null, "name": "Orange.fr"}, "author": "Media365", "title": "Tour de Suisse : Bardet forfait, Latour disqualifié ! - Toute l'actualité sportive sur Orange", "description": "Romain Bardet sans réseau, Pierre Latour qui ne respecte pas les instructions... AG2R-La Mondiale a donné du fil à retordre aux organisateurs du Tour de Suisse virtuel, lors de la troisième étape courue vendredi.", "url": "https://sports.orange.fr/cyclisme/article/tour-de-suisse-bardet-forfait-latour-disqualifie-exclu-CNT000001pGzks.html", "urlToImage": null, "publishedAt": "2020-04-24T17:58:00Z", "content": "Thomas Siniecki : publié le vendredi 24 avril 2020 à 19h58\r\nRomain Bardet sans réseau, Pierre Latour qui ne respecte pas les instructions... AG2R-La Mondiale a donné du fil à retordre aux organisateurs du Tour de Suisse virtuel, lors de la troisième étape cou… [+1207 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "Maldini: « Mon pire souvenir est à Marseille » - RMC Sport", "description": "Dans une conversation sur Instagram avec Christian Vieri, son ancien coéquipier en sélection, Paolo Maldini a révélé que son pire souvenir footballistique demeurait l'imbroglio en Ligue des champions face à l'OM en 91.", "url": "https://rmcsport.bfmtv.com/football/maldini-mon-pire-souvenir-est-a-marseille-1900265.html", "urlToImage": null, "publishedAt": "2020-04-24T17:04:20Z", "content": null}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Formule 1 : Pour le patron de McLaren, Ferrari \"vit dans le déni\" - Eurosport - FRANCE (FR)", "description": "En pleine crise sanitaire et éconimique liée au coronavirus, le petit monde du sport automobile se déchire. Face à la menace de Ferrari de quitter la Formule 1", "url": "https://www.eurosport.fr/formule-1/formule-1-pour-le-patron-de-mclaren-ferrari-vit-dans-le-deni_sto7734139/story.shtml", "urlToImage": null, "publishedAt": "2020-04-24T16:22:58Z", "content": "En pleine crise sanitaire et éconimique liée au coronavirus, le petit monde du sport automobile se déchire. Face à la menace de Ferrari de quitter la Formule 1 à cause de la réduction des budgets, Zak Brown, le PDG de McLaren n'a pas hésité à dénoncer le manq… [+2215 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Coronavirus : la FIFA débloque 138 millions d'euros pour les Fédérations - Foot - Coronavirus - L'Équipe.fr", "description": "Pour venir en aide à ses Fédérations, l'institution internationale a décidé d'avancer le versement de sommes d'argent qu'elle devait régler plus tard.", "url": "https://www.lequipe.fr/Football/Actualites/Coronavirus-la-fifa-debloque-138-millions-d-euros-pour-les-federations/1129480", "urlToImage": null, "publishedAt": "2020-04-24T15:19:49Z", "content": "La FIFA vient d'annoncer ce vendredi le versement par anticipation « dans les prochains jours » de 138 millions d'euros à ses 211 Fédérations membres, soit l'ensemble des aides pour les années 2019 et 2020, afin de faire face aux conséquences de la pandémie d… [+1188 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "De la prison ferme pour des ex-dirigeants d'Osasuna et des footballeurs du Bétis - SO FOOT", "description": "Jouer avec le feu. Cinq anciens dirigeants d'Osasuna, ainsi que deux ex-joueurs du Betis Séville, ont été condamnés ce vendredi à des peines ...", "url": "https://www.sofoot.com/de-la-prison-ferme-pour-des-ex-dirigeants-d-osasuna-et-des-footballeurs-du-betis-482639.html", "urlToImage": null, "publishedAt": "2020-04-24T15:00:00Z", "content": "Jouer avec le feu. Cinq anciens dirigeants d'Osasuna, ainsi que deux ex-joueurs du Betis Séville, ont été condamnés ce vendredi à des peines allant jusqu'à huit ans de prison ferme pour des faits de corruption. \r\nD'après Marca, les faits reprochés remontent p… [+738 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "La fin des qualifications annulée, les Bleues à l'Euro, les Bleus au Mondial - Hand - Equipes de France - L'Équipe.fr", "description": "Le Comité exécutif de la Fédération européenne a annulé la fin des qualifications pour l'Euro 2020 femmes et les playoffs pour le Mondial masculin 2021, du fait de la pandémie de coronavirus. Les équipes de France sont qualifiées.", "url": "https://www.lequipe.fr/Handball/Actualites/La-fin-des-qualifications-annulee-les-bleues-a-l-euro-les-bleus-au-mondial/1129471", "urlToImage": null, "publishedAt": "2020-04-24T14:58:18Z", "content": "Critiquée pour avoir alourdi le calendrier de fin d'année en raison de la pandémie de coronavirus, notamment en déplaçant à septembre le Final Four de la Ligue des champions féminine et à fin décembre celui de la C1 hommes (auquel participera le PSG), la Fédé… [+1880 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/marc.alvarez1", "title": "Maguire : “La Champions League 19/20 reprendra sous une forme ou une autre” - Canal Supporters", "description": "Les enjeux sont trop importants pour que l'UEFA tire un trait sur la Ligue des champions 2019/2020. Tout sera fait, qu'importe le calendrier,", "url": "https://canal-supporters.com/2020/04/maguire-la-champions-league-19-20-reprendra-sous-une-forme-ou-une-autre/", "urlToImage": null, "publishedAt": "2020-04-24T14:54:14Z", "content": "Les enjeux sont trop importants pour que l’UEFA tire un trait sur la Ligue des champions 2019/2020. Tout sera fait, qu’importe le calendrier, pour que la compétition continentale suspendue depuis la mi-mars aille à son terme. Le spécialiste de l’économie du f… [+1420 chars]"}, {"source": {"id": null, "name": "Clubpoker.net"}, "author": "SuperCaddy", "title": "Poker Express et Dans la tête d'un pro : Winamax débarque sur M6 et W9 - Club Poker", "description": "Dans la tête d'un pro n'avait jamais eu les honneurs d'une diffusion à la télévision. Cet écueil sera corrigé dans la nuit de samedi à dimanche sur W9, avec en guise de galop d'essai un épisode consacré à Patrick Bruel. Mais ce n'est pas tout puisque notre Po…", "url": "https://www.clubpoker.net/poker-express-tete-d-pro-winamax-debarque-m6-w9/n-15272", "urlToImage": null, "publishedAt": "2020-04-24T14:53:00Z", "content": "Vous l'avez connu tout petit dans les confins du Zoo sur le forum, puis à la tête de la Minute FU au micro de Club Poker. De La Maison du Bluff (en tant que coach) jusqu'à Top of the Pok ou au Winamax Stream Gang, PonceP a depuis parcouru un sacré bout de che… [+1143 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Ligue des champions : La Fédération européenne qualifie directement le PSG pour le Final Four - Eurosport - FRANCE (FR)", "description": "Dans l'incapacité de jouer les huitièmes et quarts de la compétition, la Fédération européenne de handball a décidé de qualifier directement quatre équipes.", "url": "https://www.eurosport.fr/handball/ligue-des-champions/2019-2020/ligue-des-champions-la-federation-europeenne-qualifie-directement-le-psg-pour-le-final-four_sto7734057/story.shtml", "urlToImage": null, "publishedAt": "2020-04-24T14:43:59Z", "content": "Voilà une décision de la Fédération européenne de handball qui ne devrait pas plaire à toutes les équipes encore engagées en Ligue des champions. Dans la un communiqué, la Fédération a décidé d'annuler les huitièmes et quarts de finale de la compétition pour … [+769 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "ASSE : Puel prépare la grande lessive du mercato - Foot01.com", "description": "Malgré le confinement et le contexte économique très difficile, Saint-Etienne prépare activement son mercato estival sous l’impulsion du manager Claude Puel.\r\nA l’origine des prolongations de contrat de Wesley Fofana, Charles Abi et Mahdi Camara, l’entraîneur…", "url": "https://www.foot01.com/equipe/st-etienne/asse-puel-prepare-la-grande-lessive-du-mercato,347885", "urlToImage": null, "publishedAt": "2020-04-24T14:38:08Z", "content": "Malgré le confinement et le contexte économique très difficile, Saint-Etienne prépare activement son mercato estival sous limpulsion du manager Claude Puel.\r\nA lorigine des prolongations de contrat de Wesley Fofana, Charles Abi et Mahdi Camara, lentraîneur de… [+1623 chars]"}, {"source": {"id": null, "name": "Dailymercato.com"}, "author": "", "title": "PSG : Koulibaly, pas une priorité pour MU - Daily Mercato", "description": "Pressenti pour quitter Naples cet &eacute;t&eacute;, Kalidou Koulibaly a principalement &eacute;t&eacute; annonc&eacute; dans le viseur du PSG et de M...", "url": "https://www.dailymercato.com/news/mercato-psg-koulibaly-pas-une-priorite-pour-mu", "urlToImage": null, "publishedAt": "2020-04-24T14:18:07Z", "content": "Pressenti pour quitter Naples cet été, Kalidou Koulibaly a principalement été annoncé dans le viseur du PSG et de Manchester United ces dernières semaines. Mais l'intérêt des Red Devils ne serait pas si pressant à en croire un média mancunien.Le Manchester Ev… [+1225 chars]"}, {"source": {"id": null, "name": "Madeinfoot.com"}, "author": null, "title": "Mercato - Le FC Barcelone propose deux joueurs en échange de Tanguy Ndombele - madeinfoot.com", "description": "Très porté sur les échanges de joueurs, le FC Barcelone a proposé deux de...", "url": "http://www.madeinfoot.com/infos/article-mercato-le-fc-barcelone-propose-deux-joueurs-en-echange-de-tanguy-ndombele-309466.html", "urlToImage": null, "publishedAt": "2020-04-24T13:49:22Z", "content": "Très porté sur les échanges de joueurs, le FC Barcelone a proposé deux de ses ouailles à Tottenham, en échange de Tanguy Ndombele.\r\nPeut-être plus que d'autres clubs du même standing, le FC Barcelone est contraint par la crise économique actuelle. Celle-ci es… [+2044 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "A.D.", "title": "Mercato - PSG : Leonardo engagé dans une bataille XXL pour Paul Pogba ? - Le 10 Sport", "description": "Leonardo verrait les choses en grand pour espérer attirer Paul Pogba. Toutefois, le Real Madrid, la Juventus et l'Inter, qui seraient également sur les traces du Français, auraient également de…", "url": "https://le10sport.com/football/mercato/mercato-psg-une-bataille-royale-pour-leonardo-avec-paul-pogba-500968", "urlToImage": null, "publishedAt": "2020-04-24T13:45:00Z", "content": "Publié le 24 avril 2020 à 15h45 par A.D. Leonardo verrait les choses en grand pour espérer attirer Paul Pogba. Toutefois, le Real Madrid, la Juventus et l'Inter, qui seraient également sur les traces du Français, auraient également de sérieux arguments à fair… [+1042 chars]"}, {"source": {"id": null, "name": "Foot-national.com"}, "author": "foot-national.com", "title": "Jérémy Ménez : \"Quand Ancelotti vient à tes barbecues...\" - Foot National", "description": "Il y a des coachs qui marquent la carrière, voire la vie, de certains footballeu", "url": "http://www.foot-national.com/foot-jeremy-menez-quand-ancelotti-vient-a-tes-barbecues-132698.html", "urlToImage": null, "publishedAt": "2020-04-24T13:19:31Z", "content": "vendredi 24 avril 2020 à 15:18 -Article écrit par La Rédaction - Réagir à cet article\r\n + DE LIENS :|Compétition \u009bLigue 1 | | Joueurs \u009bMenez Jérémy |\r\nIl y a des coachs qui marquent la carrière, voire la vie, de certains footballeurs. Passé au Paris Saint-Ger… [+860 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Arsenal prêt à écouter les offres pour Aumabeyang - SO FOOT", "description": "&laquo;&thinsp;C'est l'occasion rêvée de changer de partenaires...&thinsp;&raquo; Selon le Daily Mail, Arsenal va écouter les offres soumises ...", "url": "https://www.sofoot.com/arsenal-pret-a-ecouter-les-offres-pour-aumabeyang-482632.html", "urlToImage": null, "publishedAt": "2020-04-24T13:15:00Z", "content": "« C'est l'occasion rêvée de changer de partenaires... » Selon le Daily Mail, Arsenal va écouter les offres soumises pour Pierre-Emerick Aubameyang lors du prochain mercato. Le Gabonais, en fin de contrat à l'été 2021, souhaite une augmentation conséquente de … [+641 chars]"}, {"source": {"id": null, "name": "Paristeam.fr"}, "author": "Paristeam", "title": "Le PSG se cherche déjà un deuxième gardien - paristeam.fr", "description": "Leonardo aurait déjà tranché pour Sergio Rico, le directeur sportif du PSG lui cherche déjà un remplaçant...", "url": "https://www.paristeam.fr/actu-psg/transferts/le-psg-se-cherche-deja-un-deuxieme-gardien-46695", "urlToImage": null, "publishedAt": "2020-04-24T12:50:00Z", "content": "Leonardo aurait déjà tranché pour Sergio Rico, prêté par le FC Séville, qui devrait repartir en Espagne. Pour cause, le directeur sportif du PSG lui cherche déjà un remplaçant. Un casting est ainsi lancé à moins d'une solution en interne...\r\nSi le PSG ne sait… [+2213 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Masque obligatoire pour les joueurs en match ? - Sports.fr", "description": "Alors que la Bundesliga pourrait reprendre dès le 9 mai prochain, les contraintes voulues par le ministère du Travail allemand risquent de poser problème. Dernier championnat parmi les principales ligues européennes à se résoudre à suspendre sa saison, la Bun…", "url": "https://www.sports.fr/football/masque-obligatoire-joueurs-match-349423.html", "urlToImage": null, "publishedAt": "2020-04-24T12:29:36Z", "content": "Alors que la Bundesliga pourrait reprendre dès le 9 mai prochain, les contraintes voulues par le ministère du Travail allemand risquent de poser problème.\r\nDernier championnat parmi les principales ligues européennes à se résoudre à suspendre sa saison, la Bu… [+1842 chars]"}, {"source": {"id": null, "name": "Footradio.com"}, "author": "Hadrien Rivayrand", "title": "OM : Lihadji met les voiles, Romain Canuti dit bon débarras - FootRadio.com", "description": "L'Olympique de Marseille devrait vivre un mercato estival mouvementé. Les dirigeants phocéens devront réaliser des opérations intéressantes mais peu onéreuses. A Marseille, les périodes de mercato sont toujours très attendues. Malgré tout, depuis quelques ann…", "url": "https://footradio.com/presse/om-lihadji-met-les-voiles-romain-canuti-dit-bon-debarras/", "urlToImage": null, "publishedAt": "2020-04-24T12:11:40Z", "content": "L’Olympique de Marseille devrait vivre un mercato estival mouvementé. Les dirigeants phocéens devront réaliser des opérations intéressantes mais peu onéreuses. \r\nA Marseille, les périodes de mercato sont toujours très attendues. Malgré tout, depuis quelques a… [+1137 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Timo Werner dans le viseur du Barça ? / Allemagne / RB Leipzig / SOFOOT.com - SO FOOT", "description": "À la recherche de la perle rare. Alors que le FC Barcelone tente de se remettre de ses multiples crises internes, cela ne l'empêche pas pour ...", "url": "https://www.sofoot.com/timo-werner-dans-le-viseur-du-barca-482629.html", "urlToImage": null, "publishedAt": "2020-04-24T12:00:00Z", "content": "À la recherche de la perle rare. Alors que le FC Barcelone tente de se remettre de ses multiples crises internes, cela ne l'empêche pas pour autant de s'activer en coulisses. \r\nMundo Deportivo annonce qu'Éric Abidal, secrétaire technique du club, et son adjoi… [+539 chars]"}, {"source": {"id": null, "name": "Intensite.net"}, "author": null, "title": "BARJOUVILLE - Des permanences de la gendarmerie dans la galerie marchande du centre commercial - Radio Intensité", "description": "Les gendarmes de Lucé organisent des permanences pour aller à la rencontre de la population. Elle se déroulent les mercredis et les vendredis de 10 heures à 12 heures&amp;nbsp;dans la galerie marchande du", "url": "https://intensite.net/2009/actu2020/barjouville-des-permanences-de-la-gendarmerie-dans-la-galerie-marchande-du-centre", "urlToImage": null, "publishedAt": "2020-04-24T11:52:58Z", "content": "Pour adresser à Radio Intensité, un communiqué, un commentaire, une précision, ou une info, merci d'utiliser notre formulaire : ICI. ou adressez un mail à redaction@intensite.net.\r\nPour figurer dans notre agenda en ligne gratuitement, il suffit de nous adress… [+197 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Pro D2 : Franck Pourteau de Grenoble à Montauban - Rugby - Pro D2 - Transferts - L'Équipe.fr", "description": "L'USM (Pro D2) a officialisé, vendredi, la signature de l'ouvreur âgé de 24 ans en provenance de Grenoble.", "url": "https://www.lequipe.fr/Rugby/Actualites/Pro-d2-franck-pourteau-de-grenoble-a-montauban/1129409", "urlToImage": null, "publishedAt": "2020-04-24T11:24:42Z", "content": "Montauban, 13e de Pro D2 au moment de son interruption, a annoncé, vendredi, l'arrivée pour la saison prochaine de Franck Pourteau. L'ouvreur, âgé de 24 ans, évoluait depuis trois saisons à Grenoble, troisième de Pro D2. La durée du contrat n'a pas été précis… [+2 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Mercato Barça: Une nouvelle piste prestigieuse en attaque - Sports.fr", "description": "Lautaro Martinez et Neymar ne sont pas les deux seuls attaquants de renom convoités par le Barça. Déterminé à se renforcer en attaque, et ce malgré la présence de Lionel Messi, Luis Suarez, Antoine Griezmann ou Ousmane Dembélé, le FC Barcelone se montre pour …", "url": "https://www.sports.fr/football/mercato-barca-nouvelle-piste-attaque-349386.html", "urlToImage": null, "publishedAt": "2020-04-24T10:34:45Z", "content": "Lautaro Martinez et Neymar ne sont pas les deux seuls attaquants de renom convoités par le Barça.\r\nDéterminé à se renforcer en attaque, et ce malgré la présence de Lionel Messi, Luis Suarez, Antoine Griezmann ou Ousmane Dembélé, le FC Barcelone se montre pour… [+777 chars]"}, {"source": {"id": null, "name": "Touchdownactu.com"}, "author": "Jean-Michel Bougeard", "title": "Draft NFL 2020 : les meilleurs joueurs encore disponibles - Touchdown Actu", "description": "Alors que les 32 premiers joueurs ont été choisis, il reste de quoi améliorer les effectifs à toutes les positions.", "url": "https://www.touchdownactu.com/234997/draft-nfl-2020-les-meilleurs-joueurs-encore-disponibles/", "urlToImage": null, "publishedAt": "2020-04-24T10:07:22Z", "content": "Le premier tour est passé mais la draft est loin d’être terminée : ce vendredi 24, place aux tours 2 et 3. 74 choix en comptant les choix compensatoires de certaines équipes. Quels joueurs votre équipe va-t’elle sélectionner pour continuer à se renforcer ? Qu… [+7466 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "Florent Duprat", "title": "US Montauban : un trio arrive pour renforcer le staff sportif - LaDepeche.fr", "description": "INFO LA DÉPÊCHE / L'US Montauban a annoncé à ses joueurs, membres du conseil d'administration et partenaires la composition du staff pour la saison 2020-2021. Il y a trois nouveaux entrants : Florent Wieczorek, Mourad Abed et Julien Gauthier.", "url": "https://www.ladepeche.fr/2020/04/24/us-montauban-un-trio-arrive-pour-renforcer-le-staff-sportif,8860772.php", "urlToImage": null, "publishedAt": "2020-04-24T10:02:23Z", "content": "l'essentiel\r\n INFO LA DÉPÊCHE / L'US Montauban a annoncé à ses joueurs, membres du conseil d'administration et partenaires la composition du staff pour la saison 2020-2021. Il y a trois nouveaux entrants : Florent Wieczorek, Mourad Abed et Julien Gauthier.\r\n … [+4794 chars]"}, {"source": {"id": null, "name": "Lephoceen.fr"}, "author": "Le Phocéen", "title": "Les trois classements possibles si la Ligue 1 s'arrête - Le Phoceen", "description": "Pour qui les places européennes en cas d'arrêt de la Ligue 1 ?", "url": "https://www.lephoceen.fr/infos-om/autour-de-l-om/les-trois-classements-possibles-si-la-ligue-1-s-arrete-178241", "urlToImage": null, "publishedAt": "2020-04-24T09:34:49Z", "content": "En se basant sur les directives de lUEFA qui veut quen cas de non-reprise des championnats, les places européennes soient déterminées par le classement, la Ligue 1 se voit face à trois possibilités : soit prendre en compte le classement à la 19e journée (fin … [+1349 chars]"}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "La rédaction", "title": "Hugo Lloris fait de rares confidences sur sa vie de couple - Closer France", "description": "Dans les colonnes du Parisien, ce vendredi 24 avril, Hugo Lloris se confie sur son quotidien de confiné avec son épouse, Marine, et leurs trois enfants.", "url": "https://www.closermag.fr/people/hugo-lloris-fait-de-rares-confidences-sur-sa-vie-de-couple-1105991", "urlToImage": null, "publishedAt": "2020-04-24T09:24:36Z", "content": "C'est à Londres, où il est le capitaine de l'équipe de Tottenham, qu'Hugo Lloris est confiné, depuis plusieurs semaines. Dans les colonnes du Parisien, ce vendredi 24 avril, le gardien de l'équipe de France s'est confié, comme rarement, sur sa vie de couple a… [+1648 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Guillaume Issner", "title": "FC Barcelone : le prix de Nelson Semedo est fixé - Foot Mercato", "description": "", "url": "https://www.footmercato.net/a5988444720080167804-fc-barcelone-le-prix-de-nelson-semedo-est-fixe", "urlToImage": null, "publishedAt": "2020-04-24T08:03:48Z", "content": "Plusieurs joueurs sont cités pour quitter le FC Barcelone cet été, dans le cadre de la massive opération de dégraissage. C'est le cas de Samuel Umtiti, Ousmane Dembélé ou encore Nelson Semedo. Ce dernier, intransférable il y a encore quelques mois, ne sera pa… [+563 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "PSG : Violente critique contre Neymar, elle vient de l'OL - Foot01.com", "description": "Le défenseur de l’Olympique Lyonnais Rafael s’est longuement confié au sujet de Neymar, et il se montre sans pitié envers le joueur du PSG, son niveau et son comportement.\r\nTrès sage pendant cette période de confinement, Neymar a envie de se racheter une…", "url": "https://www.foot01.com/equipe/paris/psg-violente-critique-contre-neymar-elle-vient-de-l-ol,347853", "urlToImage": null, "publishedAt": "2020-04-24T07:38:09Z", "content": "Le défenseur de lOlympique Lyonnais Rafael sest longuement confié au sujet de Neymar, et il se montre sans pitié envers le joueur du PSG, son niveau et son comportement.\r\nTrès sage pendant cette période de confinement, Neymar a envie de se racheter une image … [+1895 chars]"}, {"source": {"id": null, "name": "Motorsport.com"}, "author": "Emmanuel Touzot", "title": "Il y a 15 ans : le duel entre Alonso et Schumacher à Imola - Motorsport.com, Édition: France", "description": "Le premier Grand Prix européen de la saison 2005 se disputait sur le circuit d'Imola, et il a proposé un duel qui est devenu légendaire dans l'Histoire moderne de la F1.", "url": "https://fr.motorsport.com/f1/news/alonso-schumacher-saint-marin-2005-imola/4783751/", "urlToImage": null, "publishedAt": "2020-04-24T07:26:00Z", "content": "Le début de saison 2005 de Formule 1 a été marqué par la domination de Renault, et en particulier de Fernando Alonso, qui a aitgagné deux des trois premières courses, pendant que Michael Schumacher faisait face à un manque de performance de la Ferrari F2004M … [+3065 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Télévision : Marina Lorenzo intéresse Mediapro, future chaîne de Ligue 1 et Ligue 2 - Le Parisien", "description": "La journaliste de Canal +, contactée par Mediapro, pourrait rejoindre le futur diffuseur de la Ligue 1 et de la Ligue 2.", "url": "http://www.leparisien.fr/culture-loisirs/tv/television-marina-lorenzo-interesse-mediapro-future-chaine-de-ligue-1-et-ligue-2-24-04-2020-8304912.php", "urlToImage": null, "publishedAt": "2020-04-24T05:59:00Z", "content": "Mediapro continue à éplucher de nombreuses pistes pour constituer sa rédaction. Si de nombreux journalistes et consultants ont été approchés ces dernières semaines par le futur diffuseur de la Ligue 1 et de la Ligue 2, le nom de Marina Lorenzo revient, fréque… [+1216 chars]"}, {"source": {"id": null, "name": "Footballclubdemarseille.fr"}, "author": "Articles FCM", "title": "OM: Didier Roustan dézingue Jacques-Henri Eyraud ! - Football Club de Marseille", "description": "Le président de l'Olympique de Marseille s'est exprimé ce mercredi  pour évoquer la reprise du championnat. Un", "url": "https://www.footballclubdemarseille.fr/om-fil-info/om-didier-roustan-dezingue-jacques-henri-eyraud.html", "urlToImage": null, "publishedAt": "2020-04-24T05:58:00Z", "content": "Le président de l’Olympique de Marseille s’est exprimé ce mercredi  pour évoquer la reprise du championnat. Une communication que ne comprend pas Didier Roustan…\r\nLe dirigeant de l’OM a donné son sentiment sur le scénario de reprise envisagé actuellement la L… [+849 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "Gil Bousquet @Gil_Bousquet", "title": "Top 14 : éviter le scénario du pire - LaDepeche.fr", "description": "Le rugby professionnel est tétanisé par la crise sanitaire. Aucun scénario de sortie de crise stabilisé n’émerge. Les clubs s’inquiètent des conséquences économiques qui pourraient être délétères.", "url": "https://www.ladepeche.fr/2020/04/24/top-14-eviter-le-scenario-du-pire,8860476.php", "urlToImage": null, "publishedAt": "2020-04-24T05:39:11Z", "content": "l'essentiel\r\n Le rugby professionnel est tétanisé par la crise sanitaire. Aucun scénario de sortie de crise stabilisé némerge. Les clubs sinquiètent des conséquences économiques qui pourraient être délétères.\r\n Le chemin de la reprise des matchs de rugby sera… [+4208 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "François Kulawik", "title": "Quels clubs ont le plus dépensé en transferts au 21e siècle ? - Sports.fr", "description": "Pas moins de 15 clubs ont déjà dépensé plus d’un milliard d’euros au 21e siècle sur le marché des transferts. A en croire certains analystes, la crise financière provoquée par la pandémie de coronavirus va provoquer un effondrement des prix pratiqués sur le m…", "url": "https://www.sports.fr/football/clubs-plus-depensiers-21e-siecle-349287.html", "urlToImage": null, "publishedAt": "2020-04-24T05:08:08Z", "content": "Pas moins de 15 clubs ont déjà dépensé plus d’un milliard d’euros au 21e siècle sur le marché des transferts.\r\nA en croire certains analystes, la crise financière provoquée par la pandémie de coronavirus va provoquer un effondrement des prix pratiqués sur le … [+1195 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "20 Minutes avec AFP", "title": "Coronavirus: Le foot français ne rouvrira pas ses centres de formation cette saison - 20 Minutes", "description": "Les structures assureront cependant le suivi scolaire et sportif individualisé des jeunes en formation jusqu’à juillet", "url": "https://www.20minutes.fr/sport/2766951-20200424-coronavirus-foot-francais-rouvrira-centres-formation-saison", "urlToImage": null, "publishedAt": "2020-04-24T04:48:28Z", "content": "Le siège de la Fédération Française de Football à Paris (illustration). VINCENT WARTNER / 20 Minutes\r\nLa direction technique nationale de la Fédération française de football (FFF) a annoncé jeudi la fermeture jusquà la fin de saison de ses centres de préforma… [+1485 chars]"}, {"source": {"id": null, "name": "Welovetennis.fr"}, "author": null, "title": "Roland Garros > Roland Garros sera décalé d'une semaine - We Love Tennis !", "description": "Nous pouvons vous confirmer l’information du Parisien selon laquelle le tournoi de Roland-Garros sera décalé d’une semaine par rapport à la première date évoquée. Les Internationaux de France débuteront donc le 28 septembre pour finir le 11 Octobre. Le 28 est…", "url": "https://www.welovetennis.fr/roland-garros/roland-garros-sera-decale-dune-semaine", "urlToImage": null, "publishedAt": "2020-04-23T23:54:00Z", "content": "Nous pouvons vous confirmer l’information du Parisien selon laquelle le tournoi de Roland-Garros sera décalé d’une semaine par rapport à la première date évoquée. Les Internationaux de France débuteront donc le 28 septembre pour finir le 11 Octobre. Le 28 est… [+750 chars]"}, {"source": {"id": null, "name": "Lacommere43.fr"}, "author": "Redaction", "title": "Coronavirus : un joueur de l'ASSE offre 15000 masques au CHU de Saint-Etienne - La Commère 43", "description": "C'est un cadeau bienvenu pour l'Hôpital Nord de Saint-Etienne qui consomme plusieurs dizaines de milliers de masques chaque semaine. Ce don de 15 000 masques émane d'un joueur professionnel de l'AS Saint-Etienne, en l'occurence Yann M'Vila. Le milieu de terra…", "url": "https://www.lacommere43.fr/actualites/item/30763-coronavirus-un-joueur-de-l-asse-offre-15000-masques-au-chu-de-saint-etienne.html", "urlToImage": null, "publishedAt": "2020-04-23T20:45:00Z", "content": "C'est un cadeau bienvenu pour l'Hôpital Nord de Saint-Etienne qui consomme plusieurs dizaines de milliers de masques chaque semaine.\r\nCe don de 15 000 masques émane d'un joueur professionnel de l'AS Saint-Etienne, en l'occurence Yann M'Vila. Le milieu de terr… [+1152 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "20 Minutes avec AFP", "title": "Top 14 : Le président du Stade Toulousain Didier Lacroix ne veut pas de phases finales cet été - 20 Minutes", "description": "Didier Lacroix, président du Stade Toulousain, s’est exprimé dans « Midi Olympique », alors que l’incertitude plane sur la reprise du Top 14", "url": "https://www.20minutes.fr/sport/2766683-20200423-top-14-president-stade-toulousain-didier-lacroix-veut-phases-finales", "urlToImage": null, "publishedAt": "2020-04-23T19:16:20Z", "content": "Didier Lacroix, le président du Stade Toulousain, le 4 juillet 2017 au stade Ernest-Wallon. N. Stival / 20 Minutes\r\nAlors que la saison de Top 14 est arrêtée depuis le 13 mars à cause de lépidémie de \r\ncoronavirus, la Ligue nationale de rugby (LNR) envisage c… [+1843 chars]"}, {"source": {"id": null, "name": "Letemps.ch"}, "author": "Laurent Favre", "title": "Le monde du tennis reprend l'idée de Federer au bond - Le Temps", "description": "Le Bâlois a suggéré mercredi de fusionner l’ATP et la WTA afin d’unir joueurs et joueuses dans la relance du tennis professionnel après la pandémie. Un «premier service» gagnant", "url": "https://www.letemps.ch/node/1206753", "urlToImage": null, "publishedAt": "2020-04-23T17:05:00Z", "content": "Quand les types de 130 millions de dollars de gains disent certaines choses, ceux de 6 millions de dollars les écoutent. Ces derniers jours, Rafael Nadal, Roger Federer et Novak Djokovic se sont pas mal exprimés, alors le monde du tennis a écouté. Surtout Fed… [+3407 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "UEFA : reporté en 2021, l'Euro 2020 ne change pas de nom - Foot - UEFA - L'Équipe.fr", "description": "L'UEFA a confirmé que l'Euro 2020, bien que reporté à l'été 2021 en raison de la pandémie de coronavirus, conserverait son appellation.", "url": "https://www.lequipe.fr/Football/Actualites/Uefa-reporte-en-2021-l-euro-2020-ne-change-pas-de-nom/1129229", "urlToImage": null, "publishedAt": "2020-04-23T16:04:55Z", "content": "L'UEFA a confirmé jeudi que l'Euro 2020, bien que reporté à l'été 2021 en raison du coronavirus, conserverait son appellation. Son Comité exécutif, réuni par visioconférence, a bien validé le statu quo.\r\nIl permet à l'UEFA de « maintenir sa vision originelle … [+649 chars]"}, {"source": {"id": null, "name": "Francebleu.fr"}, "author": "Alexandre Audabram", "title": "Le Stade de Reims vers une qualification en Coupe d'Europe ? Ca se précise... - France Bleu", "description": "Si le championnat de Ligue 1 ne pouvait pas reprendre, les methodes de calcul du classement, préconisées ce jeudi par l'UEFA, permettent au club rémois de terminer la saison à la 5e place et de rejoindre la phase de poules de la Ligue Europa. L'instance exclu…", "url": "https://www.francebleu.fr/sports/football/le-stade-de-reims-vers-une-qualification-en-coupe-d-europe-ca-se-precise-1587647940", "urlToImage": null, "publishedAt": "2020-04-23T14:56:40Z", "content": "Même si l'on est encore loin du dénouement de cette saison 2019-2020 de Ligue 1, tant sur le terrain que sur le plan administratif si besoin, les préconisations de l'UEFA (l'instance européenne du football) pourraient permettre au Stade de Reims de disputer u… [+3287 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Prête à reprendre à huis clos, la Bundesliga attend le feu vert des politiques - Foot - ALL - Coronavirus - L'Équipe.fr", "description": "La Ligue allemande a annoncé ce jeudi son intention de relancer la compétition en prenant des mesures sanitaires pour se prémunir du coronavirus. Mais aucune date n'est annoncée.", "url": "https://www.lequipe.fr/Football/Actualites/Prete-a-reprendre-a-huis-clos-la-bundesliga-attend-le-feu-vert-des-politiques/1129197", "urlToImage": null, "publishedAt": "2020-04-23T14:01:19Z", "content": "L'assemblée générale des 36 clubs de première et deuxième division, qui s'est tenue ce jeudi par visioconférence, n'a pas débouché sur la nouvelle attendue : lors de sa conférence de presse, le président de la Ligue allemande (DFL), Christian Seifert, n'a pas… [+1821 chars]"}]}