{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Ligue 1 : quatre mètres de distance entre les joueurs à l'entraînement ? - Foot - L1 - L'Équipe.fr", "description": "Alors que le protocole de reprise de l'entraînement se dessine après le 11 mai, l'association des médecins des clubs professionnels a précisé les consignes que devraient suivre les joueurs de L1.", "url": "https://www.lequipe.fr/Football/Actualites/Ligue-1-quatre-metres-de-distance-entre-les-joueurs-a-l-entrainement/1129803", "urlToImage": null, "publishedAt": "2020-04-25T21:40:17Z", "content": "Quatre étapes de reprise seraient ainsi fixées après le déconfinement qui aura lieu le 11 mai, avec des tests médicaux puis une reprise individuelle. Viendrait ensuite la reprise par petits groupes qui précéderait les entraînements collectifs, fin mai. Pendan… [+128 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "J.-G.D.", "title": "Mercato - PSG : Mbappé ne lâcherait rien pour son avenir ! - Le 10 Sport", "description": "Malgré la volonté du PSG de le prolonger, Kylian Mbappé jouerait la montre comme vous l'a expliqué le 10 Sport. Et le Real Madrid ne lâcherait rien pour l’attaquant parisien.", "url": "https://le10sport.com/football/mercato/mercato-psg-une-decision-radicale-de-mbappe-pour-son-avenir-501116", "urlToImage": null, "publishedAt": "2020-04-25T21:15:00Z", "content": "Publié le 25 avril 2020 à 23h15 par J.-G.D. Malgré la volonté du PSG de le prolonger, Kylian Mbappé jouerait la montre comme vous l'a expliqué le 10 Sport. Et le Real Madrid ne lâcherait rien pour lattaquant parisien.\r\nComme Le 10 Sport vous lexpliquait en ex… [+1250 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "WTF : Charles Leclerc (Ferrari) pilote déguisé en banane - F1 - WTF - L'Équipe.fr", "description": "Le pilote Ferrari Charles Leclerc (22 ans) s'est montré aux fans sur sa chaîne Twitch, un service de streaming de jeux vidéo, en costume de banane", "url": "https://www.lequipe.fr/Formule-1/Actualites/Wtf-charles-leclerc-ferrari-pilote-deguise-en-banane/1129798", "urlToImage": null, "publishedAt": "2020-04-25T21:06:15Z", "content": "Durant cette pause forcée due à la pandémie, le pilote Ferrari Charles Leclerc, 22 ans, s'est engagé dans l'esport et transfère temporairement ses compétences de pilote sur circuit virtuel. Le Monégasque a déjà enregistré quatre victoires pour son écurie."}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Benjamin Lecomte (Monaco) : « Ibra m'a mis un triplé... et il m'a ensuite félicité » - Foot - L1 - L'Équipe.fr", "description": "Lors d'un live Instagram avec le journaliste de « L'Équipe » Hugo Guillemet, le gardien de but monégasque a évoqué les joueurs et les attaquants qui l'ont le plus impressionné.", "url": "https://www.lequipe.fr/Football/Actualites/Benjamin-lecomte-monaco-ibra-m-a-mis-un-triple-et-il-m-a-ensuite-felicite/1129796", "urlToImage": null, "publishedAt": "2020-04-25T20:40:30Z", "content": "Benjamin Lecomte (Monaco) : « Le coéquipier qui m'a le plus impressionné, c'est Falcao. Devant le but, dans le jeu et au niveau des appels, c'est un truc de malade. Il fait partie, avec Ibrahimovic, des attaquants qui m'ont posé le plus de problèmes. Avec ce … [+266 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Etienne Moatti et Arnaud Hermant", "title": "Une semaine décisive s'annonce pour la Ligue - Foot - L1 - L'Équipe.fr", "description": "Dans une « contribution » transmise à la LFP, Bertrand Desplat, le président de Guingamp, a proposé une méthodologie pour établir le classement si la saison ne va pas à son terme.", "url": "https://www.lequipe.fr/Football/Article/Une-semaine-decisive-s-annonce-pour-la-ligue/1129795", "urlToImage": null, "publishedAt": "2020-04-25T20:30:34Z", "content": "La semaine qui débute lundi va compter pour la fin de saison. D'ici jeudi, le gouvernement doit normalement dévoiler les modalités de son plan de déconfinement et dire si le sport, et en particulier le football, peut reprendre. Le lendemain de la sortie offic… [+443 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Jean-Sébastien Grond", "title": "Ronaldo et le PSG, c’est non ? - Sports.fr", "description": "L’avenir de Cristiano Ronaldo se précise. Du moins, selon la presse italienne… Cristiano Ronaldo, la nouvelle star du PSG en cas de départ de Neymar (ou de Kylian Mbappé) ? Si la presse française évoque rarement la possible venue du quintuple Ballon d’or dans…", "url": "https://www.sports.fr/football/ronaldo-psg-cest-decide-349616.html", "urlToImage": null, "publishedAt": "2020-04-25T20:19:04Z", "content": "Lavenir de Cristiano Ronaldo se précise. Du moins, selon la presse italienne\r\nCristiano Ronaldo, la nouvelle star du PSG en cas de départ de Neymar (ou de Kylian Mbappé) ? Si la presse française évoque rarement la possible venue du quintuple Ballon dor dans l… [+855 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Toulouse, la vente du club s'éloigne - Foot - L1 - Toulouse - L'Équipe.fr", "description": "Olivier Sadran devrait rester président de Toulouse encore un certain temps. La période de négociation avec le groupe sino-américain intéressé par le club a expiré.", "url": "https://www.lequipe.fr/Football/Actualites/Toulouse-la-vente-du-club-s-eloigne/1129792", "urlToImage": null, "publishedAt": "2020-04-25T20:14:56Z", "content": "Ces derniers jours, le président du TFC, Olivier Sadran, a fait partie des acteurs majeurs des négociations avec les représentants des détenteurs de droits télé. Une activité intense bien loin de celle d'un homme sur le point de vendre son club. Le propriétai… [+1234 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Benjamin Lecomte (Monaco) : « J'envoie ma force et mon courage à Junior Sambia » - Foot - Coronavirus - L'Équipe.fr", "description": "Lors d'un live Instagram avec le journaliste de « L'Équipe » Hugo Guillemet, le gardien de but monégasque a tenu à témoigner son soutien à son ancien coéquipier Junior Sambia, touché par le coronavirus.", "url": "https://www.lequipe.fr/Football/Actualites/Benjamin-lecomte-monaco-j-envoie-ma-force-et-mon-courage-a-junior-sambia/1129790", "urlToImage": null, "publishedAt": "2020-04-25T20:09:27Z", "content": "Benjamin Lecomte (Monaco) : « Je voudrais envoyer toute ma force et mon courage à Junior (Sambia) et à ses proches, et lui dire que je le soutiens. Cela fait toujours bizarre quand c'est un joueur avec qui l'on a joué qui attrape le coronavirus et qui est hos… [+222 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "PSG : Paris lésé contre l'OL, un ancien Lyonnais la joue fair-play - Foot01.com", "description": "Lors de la réunion de la Ligue de Football Professionnel vendredi, Noël Le Graët a proposé de reprendre la saison avec les finales des coupes nationales. Une idée qui risque de ne pas plaire au Paris Saint-Germain.\r\nLe déconfinement étant prévu pour le…", "url": "https://www.foot01.com/equipe/paris/psg-paris-lese-contre-l-ol-un-ancien-lyonnais-la-joue-fair-play,347969", "urlToImage": null, "publishedAt": "2020-04-25T20:06:15Z", "content": "Lors de la réunion de la Ligue de Football Professionnel vendredi, Noël Le Graët a proposé de reprendre la saison avec les finales des coupes nationales. Une idée qui risque de ne pas plaire au Paris Saint-Germain.\r\nLe déconfinement étant prévu pour le 11 mai… [+1570 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "« La volonté de rachat est toujours là », rassurent les investisseurs intéressés par l'AS Nancy - Foot - Nancy - L'Équipe.fr", "description": "Proche d'être finalisé avant le confinement, le rachat de Nancy (L2) par le City Football Group n'a pas eu lieu. Inquiétant ? Les investisseurs, tout en reconnaissant une « nouvelle donne », se veulent rassurants.", "url": "https://www.lequipe.fr/Football/Actualites/-la-volonte-de-rachat-est-toujours-la-rassurent-les-investisseurs-interesses-par-l-as-nancy/1129789", "urlToImage": null, "publishedAt": "2020-04-25T20:01:56Z", "content": "En voie de finalisation avant le début de la crise sanitaire mondiale, le rachat de l'AS Nancy Lorraine (L2) par le City Football Group, géré par un fonds souverain d'Abu Dhabi, et déjà propriétaire de 8 clubs dans le monde dont Manchester City (Angleterre), … [+1916 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "La Premier League envisage une reprise à huis clos début juin - Eurosport - FRANCE (FR)", "description": "PREMIER LEAGUE - La reprise du championnat est envisagée le 8 juin, à huis clos en raison de la pandémie due au coronavirus, affirme le Times samedi.", "url": "https://www.eurosport.fr/football/premier-league/2019-2020/la-premier-league-envisage-une-reprise-le-8-juin-a-huis-clos_sto7734758/story.shtml", "urlToImage": null, "publishedAt": "2020-04-25T19:55:04Z", "content": "PREMIER LEAGUE - La reprise du championnat est envisagée le 8 juin, à huis clos en raison de la pandémie due au coronavirus, pour espérer terminer la saison le 27 juillet, affirme le Times samedi.\r\nUne éclaircie au Royaume-Uni ? Selon le Times ce samedi, les … [+2248 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Jean-Sébastien Grond", "title": "Ronaldinho « largement plus fort que Neymar » - Sports.fr", "description": "Gardien du PSG de 2001 à 2008, Jérôme Alonzo se souvient parfaitement du passage de Ronaldinho dans la capitale (2001-2003). L’ancien gardien nous a notamment raconté la relation entre le prodige brésilien et Luis Fernandez à l’époque. «J’en parle tout le tem…", "url": "https://www.sports.fr/football/ronaldinho-largement-plus-fort-neymar-349611.html", "urlToImage": null, "publishedAt": "2020-04-25T19:49:14Z", "content": "Gardien du PSG de 2001 à 2008, Jérôme Alonzo se souvient parfaitement du passage de Ronaldinho dans la capitale (2001-2003). Lancien gardien nous a notamment raconté la relation entre le prodige brésilien et Luis Fernandez à lépoque.\r\n«Jen parle tout le temps… [+3567 chars]"}, {"source": {"id": null, "name": "Dailymercato.com"}, "author": "", "title": "Finalement, Cavani se verrait bien prolonger le plaisir au PSG - Daily Mercato", "description": "Promis &agrave; un d&eacute;part cet &eacute;t&eacute;, Edinson Cavani se verrait finalement bien rester au PSG encore un peu....", "url": "https://www.dailymercato.com/news/finalement-cavani-se-verrait-bien-prolonger-le-plaisir-au-psg", "urlToImage": null, "publishedAt": "2020-04-25T19:29:04Z", "content": "Promis à un départ cet été, Edinson Cavani se verrait finalement bien rester au PSG encore un peu.Et si Cavani restait au PSG ? Selon L'Equipe, cette hypothèse n'est pas à exclure et c'est une petite surprise en soi puisque le buteur uruguayen avait voulu par… [+1101 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "RMC SPORT", "title": "Ligue 1-Ligue 2: tests, distances, le protocole de reprise des joueurs se précise - RMC Sport", "description": "Alors que le début du déconfinement s'annonce, les conditions de reprise des joueurs de football se précisent. Si d'autres précisions seront faites d'ici le 11 mai, l'association des médecins des clubs professionnels en a dit plus sur la politique de tests, l…", "url": "https://rmcsport.bfmtv.com/football/ligue-1-tests-distances-le-protocole-de-reprise-pour-les-joueurs-se-precise-1901019.html", "urlToImage": null, "publishedAt": "2020-04-25T19:27:50Z", "content": null}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Diogo Jota (Wolverhampton) gagne la finale du tournoi de FIFA 20 organisé en Premier League - Foot - ANG - L'Équipe.fr", "description": "L'attaquant de Wolverhampton a remporté le tournoi virtuel de FIFA 20, organisé en Premier League pour trouver des fonds dans la lutte contre le coronavirus.", "url": "https://www.lequipe.fr/Football/Actualites/Diogo-jota-wolverhampton-gagne-la-finale-du-tournoi-de-fifa-20-organise-en-premier-league/1129780", "urlToImage": null, "publishedAt": "2020-04-25T19:19:41Z", "content": "Chaque club était représenté par un joueur et l'attaquant de Wolverhampton Diogo Jota a gagné la finale ce samedi contre le latéral de Liverpool Trent Alexander-Arnold. L'international anglais avait battu Raheem Sterling, son compatriote de Manchester City, e… [+14 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "B.C.", "title": "Mercato - PSG : Leonardo passe à l'action pour Thiago Silva ! - Le 10 Sport", "description": "Comme indiqué en exclusivité par le 10 Sport il y a quelques jours, le PSG a changé de stratégie concernant Thiago Silva et souhaite désormais prolonger le contrat du défenseur brésilien.", "url": "https://le10sport.com/football/mercato/mercato-psg-leonardo-passe-a-laction-pour-thiago-silva-501146", "urlToImage": null, "publishedAt": "2020-04-25T19:15:00Z", "content": "Publié le 25 avril 2020 à 21h15 par B.C. Comme indiqué en exclusivité par le 10 Sport il y a quelques jours, le PSG a changé de stratégie concernant Thiago Silva et souhaite désormais prolonger le contrat du défenseur brésilien.\r\nSon destin semblait scellé, m… [+1497 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "OL : Mohamed Bouhafsi fan d'Aulas « le génie du foot » - Foot01.com", "description": "A l'heure où les critiques sont souvent virulentes à son encontre, Jean-Michel Aulas peut compter sur un fan revendiqué au sein des médias.\r\nHabile en communication, Jean-Michel Aulas est capable de découper en morceaux L’Equipe via Twitter, puis le lendemain…", "url": "https://www.foot01.com/equipe/ol/ol-mohamed-bouhafsi-fan-d-aulas-le-genie-du-foot,347975", "urlToImage": null, "publishedAt": "2020-04-25T19:04:56Z", "content": "A l'heure où les critiques sont souvent virulentes à son encontre, Jean-Michel Aulas peut compter sur un fan revendiqué au sein des médias.\r\nHabile en communication, Jean-Michel Aulas est capable de découper en morceaux LEquipe via Twitter, puis le lendemain … [+1242 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Le «peuple vert» au soutien de Robert Herbin - Le Figaro", "description": "Depuis l'annonce vendredi après-midi de l'hospitalisation de Robert Herbin à Saint-Étienne dans un état jugé préoccupant, les messages de soutien affluent.", "url": "https://sport24.lefigaro.fr/football/ligue-1/actualites/le-peuple-vert-au-soutien-de-robert-herbin-1000317", "urlToImage": null, "publishedAt": "2020-04-25T18:43:00Z", "content": "Depuis l'annonce vendredi après-midi de l'hospitalisation de Robert Herbin à Saint-Étienne dans un état jugé préoccupant, les messages de soutien affluent.Hospitalisé depuis mardi au CHU de l'hôpital nord dans un état jugé préoccupant, lentraîneur de la grand… [+1358 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "J.-G.D.", "title": "Mercato - Real Madrid : Zidane aurait validé un gros départ ! - Le 10 Sport", "description": "Incapable de s’imposer au Real Madrid depuis son arrivée en 2014, James Rodriguez ne devrait pas continuer l’aventure chez les Merengue. Une aubaine pour les prétendants du Colombien.", "url": "https://le10sport.com/football/mercato/mercato-real-madrid-la-sentence-serait-tombee-pour-james-rodriguez-501112", "urlToImage": null, "publishedAt": "2020-04-25T18:30:00Z", "content": "Foot - Mercato - Real Madrid\r\nPublié le 25 avril 2020 à 20h30 par J.-G.D. Incapable de simposer au Real Madrid depuis son arrivée en 2014, James Rodriguez ne devrait pas continuer laventure chez les Merengue. Une aubaine pour les prétendants du Colombien.\r\nÀ … [+1081 chars]"}, {"source": {"id": null, "name": "Sport.fr"}, "author": null, "title": "Payé 14 millions d’euros par an, il refuse de quitter le Real Madrid… - Sport.fr", "description": "Ce joueur, vous l’avez reconnu. Il s’agit de Gareth Bale. La Gallois, recruté en 2013 pour 100 millions d’euros, ce qui en avait fait à l’époque le joueur le plus cher du monde, a l’intention d’aller au bout de son contrat avec le Real Madrid. Un contrat qui …", "url": "https://www.sport.fr/football/paye-14-millions-deuros-par-an-il-refuse-de-quitter-le-real-madrid-683753.shtm", "urlToImage": null, "publishedAt": "2020-04-25T18:25:00Z", "content": "Ce joueur, vous l’avez reconnu. Il s’agit de Gareth Bale. \r\nLa Gallois, recruté en 2013 pour 100 millions d’euros, ce qui en avait fait à l’époque le joueur le plus cher du monde, a l’intention d’aller au bout de son contrat avec le Real Madrid. Un contrat qu… [+333 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "ASC : Ses joueurs testés au Covid-19, Amiens est prêt à sauver sa tête - Foot01.com", "description": "En plus du protocole médical préparé par la Ligue de Football Professionnel, les joueurs d’Amiens ont passé des tests de dépistage. L’objectif est de permettre une reprise dans les meilleures conditions.\r\nA chaque sortie médiatique ou presque, les acteurs…", "url": "https://www.foot01.com/equipe/amiens/asc-ses-joueurs-testes-au-covid-19-amiens-est-pret-a-sauver-sa-tete,347963", "urlToImage": null, "publishedAt": "2020-04-25T18:10:55Z", "content": "En plus du protocole médical préparé par la Ligue de Football Professionnel, les joueurs dAmiens ont passé des tests de dépistage. Lobjectif est de permettre une reprise dans les meilleures conditions.\r\nA chaque sortie médiatique ou presque, les acteurs de Li… [+1802 chars]"}, {"source": {"id": null, "name": "Peuple-vert.fr"}, "author": "Alexandre S.", "title": "#ASSEPSG : La finale de la coupe de France aura bien lieu ce soir ! ⋆ Peuple-Vert.fr - Foot - ASSE - Actualité - Peuple Vert", "description": "La finale de la coupe de France aura bien lieu... mais sur le jeu vidéo FIFA 2020. A l'initiative du Progrès, cette finale opposera deux gamers professionnels, l'un de Paris, l'autre de St-Etienne. Coup d'envoi à 20h. Cela ne replacera pas la véritable finale…", "url": "https://peuple-vert.fr/breves/assepsg-la-finale-de-la-coupe-de-france-aura-bien-lieu-ce-soir/", "urlToImage": null, "publishedAt": "2020-04-25T17:54:00Z", "content": "Cela ne replacera pas la véritable finale de coupe de France à laquelle nous aurions dû assister ce soir aux alentours de 21h. L'initiative a le mérite de créer un mini événement qui fera peut-être retrouver quelques sensations aux supporters privés de footba… [+436 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Premier League : Les joueurs de Chelsea conservent l'intégralité de leurs salaires - Eurosport - FRANCE (FR)", "description": "PREMIER LEAGUE - Dans un communiqué publié samedi, Chelsea a annoncé que ses joueurs n'allaient pas subir de baisse de salaire en lien avec le Covid 19.", "url": "https://www.eurosport.fr/football/premier-league/2019-2020/premier-league-les-joueurs-de-chelsea-conservent-l-integralite-de-leurs-salaires_sto7734824/story.shtml", "urlToImage": null, "publishedAt": "2020-04-25T17:37:17Z", "content": "Si leurs voisins d'Arsenal ont récemment accepté de baisser leurs salaires de 12,5%, ce n'est pas la voie qu'ont décidé de prendre les joueurs de Chelsea. Dans un communiqué publié samedi, le club londonnien a fait un point sur une éventuelle réduction de sal… [+1035 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "PSG : Neymar c'est 164ME, la FIFA a tranché - Foot01.com", "description": "Retenu par le Paris Saint-Germain l’été dernier, Neymar sera un peu plus accessible au prochain mercato. Pour le recruter, il faudra bien payer le prix fixé par la FIFA, un montant révélé par son ancien agent Wagner Ribeiro.\r\nParmi les nombreuses rumeurs…", "url": "https://www.foot01.com/equipe/paris/psg-neymar-c-est-164me-la-fifa-a-tranche,347961", "urlToImage": null, "publishedAt": "2020-04-25T17:12:18Z", "content": "Retenu par le Paris Saint-Germain lété dernier, Neymar sera un peu plus accessible au prochain mercato. Pour le recruter, il faudra bien payer le prix fixé par la FIFA, un montant révélé par son ancien agent Wagner Ribeiro.\r\nParmi les nombreuses rumeurs qui c… [+1569 chars]"}, {"source": {"id": null, "name": "Footballclubdemarseille.fr"}, "author": "La Redaction FC Marseille", "title": "Mercato OM : « Thauvin l’a en travers de la gorge » - Football Club de Marseille", "description": "Cette semaine dans Team Duga, Jérôme Rothen s'est exprimé sur le dossier Thauvin. Etant proche du joueur, il a", "url": "https://www.footballclubdemarseille.fr/om-fil-info/mercato-om-thauvin-la-en-travers-de-la-gorge.html", "urlToImage": null, "publishedAt": "2020-04-25T16:50:58Z", "content": "Cette semaine dans Team Duga, Jérôme Rothen s’est exprimé sur le dossier Thauvin. Etant proche du joueur, il a confirmé qu’il avait en travers de la gorge la mauvaise gestion de sa blessure. \r\nFlorian Thauvin a réalisé une saison quasiment blanche à cause de … [+844 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "F.H. avec AFP", "title": "Chelsea a levé l’option pour prolonger Olivier Giroud d’un an - 20 Minutes", "description": "L’attaquant de l’équipe de France débutera-t-il le championnat anglais sur le banc comme lors de la saison 2019-2020 ?", "url": "https://www.20minutes.fr/sport/2767667-20200425-chelsea-leve-option-prolonger-olivier-giroud-an", "urlToImage": null, "publishedAt": "2020-04-25T16:50:45Z", "content": "Olivier Giroud. (Illustration) Mark Greenwood/IPS/REX/SIPA\r\nQuel rôle va lui donner Frank Lampard ? Titulaire ou remplaçant ? Chelsea a levé loption pour prolonger dun an \r\nOlivier Giroud, annonce l'AFP. Lattaquant de \r\nl'équipe de France est lié au club lond… [+741 chars]"}, {"source": {"id": null, "name": "Paddock-gp.com"}, "author": null, "title": "MotoGP : Pol Espargaró et les hooligans de Valentino Rossi - Media Service", "description": "Pol Espargaro a-t-il appuyé où ça fait mal concernant Valentino Rossi ?", "url": "https://www.paddock-gp.com/motogp-pol-espargaro-et-les-hooligans-de-valentino-rossi/", "urlToImage": null, "publishedAt": "2020-04-25T16:33:00Z", "content": "Dans un entretien débridé entre les quatre murs dun domicile dans lequel le Coronavirus lassigne, Pol Espargaró a déconfiné un sujet sensible : celui des supporters de Valentino Rossi. Ils sont nombreux, ils sont bruyants, mais sont-ils tous bon-enfant ? Depu… [+1737 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Le Barça serait prêt à sécher la possible reprise de la Liga - SO FOOT", "description": "Sur un terrain ou en dehors, le Barça n'est pas facile à maîtriser. Vendredi, lors d'une conférence téléphonique, le président de la Liga ...", "url": "https://www.sofoot.com/le-barca-serait-pret-a-secher-la-possible-reprise-de-la-liga-482674.html", "urlToImage": null, "publishedAt": "2020-04-25T16:15:00Z", "content": "Sur un terrain ou en dehors, le Barça n'est pas facile à maîtriser.Vendredi, lors d'une conférence téléphonique, le président de la Liga Javier Tebas s'est montré très clair : une non-reprise du championnat est pour lui inenvisageable. « Les clubs qui refuser… [+680 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Le Lorientais Cabot à Marseille la saison prochaine ? - Le Figaro", "description": "Jimmy Cabot de retour en Ligue 1 la saison prochaine ? Oui, mais peut-être pas avec Lorient (Ligue 2). L’ailier de 26 ans, libre à la fin de la saison, ne devrait en tout cas pas rester au Moustoir. Il est d'ailleurs courtisé par l’OM, comme le rapporte Franc…", "url": "https://sport24.lefigaro.fr/football/transferts/fil-info/l-om-suivrait-jimmy-cabot-lorient-1000305", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "Jimmy Cabot de retour en Ligue 1 la saison prochaine ? Oui, mais peut-être pas avec Lorient (Ligue 2). Lailier de 26 ans, libre à la fin de la saison, ne devrait en tout cas pas rester au Moustoir. Il est d'ailleurs courtisé par lOM, comme le rapporte France … [+318 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Le championnat de Biélorussie arrêté, William Accambray champion avec Brest - Hand - L'Équipe.fr", "description": "Après l'arrêt du championnat de Biélorussie en raison de l'épidémie de coronavirus, William Accambray est sacré champion avec le Meshkov Brest.", "url": "https://www.lequipe.fr/Handball/Actualites/Le-championnat-de-bielorussie-arrete-william-accambray-champion-avec-brest/1129731", "urlToImage": null, "publishedAt": "2020-04-25T15:54:10Z", "content": "« Nous sommes donc champions dès à présent ! Et la Coupe est reportée au début de la saison prochaine », a réagi l'ancien international sur les réseaux sociaux. Le triple champion du monde, également champion olympique et d'Europe, arrivé à Brest il y a un an… [+140 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "La rédaction", "title": "Mercato - Barcelone : Un prétendant se positionnerait pour cette pépite du Barça ! - Le 10 Sport", "description": "Joueur du FC Barcelone et actuellement prêté à Schalke 04, Juan Miranda est en perte de vitesse. Les dirigeants du Barça souhaiteraient qu’il gagne en temps de jeu et un nouveau départ se…", "url": "https://le10sport.com/football/mercato/mercato-barcelone-cette-pepite-dabidal-dans-le-viseur-de-la-sampdoria-501088", "urlToImage": null, "publishedAt": "2020-04-25T15:30:00Z", "content": "Foot - Mercato - Barcelone\r\nPublié le 25 avril 2020 à 17h30 par La rédaction Joueur du FC Barcelone et actuellement prêté à Schalke 04, Juan Miranda est en perte de vitesse. Les dirigeants du Barça souhaiteraient quil gagne en temps de jeu et un nouveau dépar… [+940 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Cedric Rablat", "title": "FC Barcelone : la stratégie de Quique Setién pour relancer Philippe Coutinho - Foot Mercato", "description": "Le milieu offensif brésilien, actuellement en prêt au Bayern Munich, ne sait pas encore ce que lui réserve l'avenir. Mais l'entraîneur catalan aurait déjà sa petite idée pour relancer la carrière de l'intéressé au Barça.", "url": "https://www.footmercato.net/a1406994864420996443-fc-barcelone-la-strategie-de-quique-setien-pour-relancer-philippe-coutinho", "urlToImage": null, "publishedAt": "2020-04-25T15:12:51Z", "content": "Et si le FC Barcelone tendait la main à Philippe Coutinho (27 ans) pour relancer sa carrière en Catalogne ? Prêté l'été dernier par le Barça au Bayern Munich, le milieu offensif brésilien réalise un exercice plutôt satisfaisant sous les couleurs bavaroises (2… [+2205 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "Esp : Avec le « Swissx Camp Nou », le Barça s'expose à un scandale - Foot01.com", "description": "Le FC Barcelone a trouvé un candidat pour le naming de son stade la saison prochaine. Mais la réputation de cet investisseur risque de faire parler en Espagne.\r\nCe qui devait être un très beau geste pourrait vite provoquer une polémique au FC Barcelone…", "url": "https://www.foot01.com/foot-europeen/espagne/esp-avec-le-swissx-camp-nou-le-barca-s-expose-a-un-scandale,347953", "urlToImage": null, "publishedAt": "2020-04-25T15:05:00Z", "content": "Le FC Barcelone a trouvé un candidat pour le naming de son stade la saison prochaine. Mais la réputation de cet investisseur risque de faire parler en Espagne.\r\nCe qui devait être un très beau geste pourrait vite provoquer une polémique au FC Barcelone. En dé… [+1358 chars]"}, {"source": {"id": null, "name": "Francefootball.fr"}, "author": "Nabil Djellit", "title": "Mercato : Dries Mertens a l'embarras du choix - France Football", "description": "A moins d'une prolongation surprise avec Naples, Dries Mertens, en fin de contrat, devrait relever un nouveau challenge la saison prochaine. Le Belge est très sollicité.  En Ligue 1, Monaco est intéressé et doit faire face à la concurrence de l'Inter Milan, C…", "url": "https://www.francefootball.fr/news/Mercato-dries-mertens-a-l-embarras-du-choix/1129717", "urlToImage": null, "publishedAt": "2020-04-25T14:53:07Z", "content": "A moins d'une prolongation surprise avec Naples, Dries Mertens, en fin de contrat, devrait relever un nouveau challenge la saison prochaine. Le Belge est très sollicité. En Ligue 1, Monaco est intéressé et doit faire face à la concurrence de l'Inter Milan, Ch… [+2110 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Chelsea : Aubameyang plutôt que Dembélé ou Werner ? - Fil Info - Transferts - Football - Le Figaro", "description": "Les Blues sont en quête de renfort devant. Reste à savoir qui sera l’heureux élu… D’après ESPN, les Blues s’intéressent de près au Lyonnais Moussa Dembélé, dont les Gones attendrait 80 M€, ou encore à l’international allemand de Leipzig Timo Werner, annoncé p…", "url": "https://sport24.lefigaro.fr/football/transferts/fil-info/chelsea-aubameyang-plutot-que-dembele-ou-werner-1000298", "urlToImage": null, "publishedAt": "2020-04-25T14:21:00Z", "content": "Les Blues sont en quête de renfort devant. Reste à savoir qui sera lheureux élu Daprès ESPN, les Blues sintéressent de près au Lyonnais Moussa Dembélé, dont les Gones attendrait 80 M, ou encore à linternational allemand de Leipzig Timo Werner, annoncé proche … [+426 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "La rédaction", "title": "Mercato - Real Madrid : La dernière pépite de Zidane proche d’un départ ? - Le 10 Sport", "description": "Arrivé cet hiver au Real Madrid, Reinier Jesus pourrait déjà être prêté, notamment en raison de son statut d’extra-communautaire.", "url": "https://le10sport.com/football/mercato/mercato-real-madrid-un-pret-envisage-pour-cette-pepite-501085", "urlToImage": null, "publishedAt": "2020-04-25T14:00:00Z", "content": "Foot - Mercato - Real Madrid\r\nPublié le 25 avril 2020 à 16h00 par La rédaction Arrivé cet hiver au Real Madrid, Reinier Jesus pourrait déjà être prêté, notamment en raison de son statut dextra-communautaire.\r\nReinier Jesus va-t-il être prêté ? Arrivé cet hive… [+1143 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Fusion ATP/WTA : Dirk Hordoff est contre l'idée de Roger Federer - Tennis - ATP/WTA - L'Équipe.fr", "description": "Pour le vice-président de la fédération allemande de tennis, la fusion entre l'ATP et la WTA évoquée par Roger Federer lui semble une très mauvaise idée.", "url": "https://www.lequipe.fr/Tennis/Actualites/Fusion-atp-wta-dirk-hordoff-est-contre-l-idee-de-roger-federer/1129711", "urlToImage": null, "publishedAt": "2020-04-25T13:49:10Z", "content": "Le vice-président de la fédération allemande de tennis, Dirk Hordorff, a ouvertement critiqué la proposition de Roger Federer de fusionner l'ATP et la WTA : « C'est une idée à court terme, et ce n'est pas suffisant. La fusion de l'ATP et de la WTA ne résoudra… [+267 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Kevin Lebreton (Aurillac) à Rouen - Rugby - Transferts - L'Équipe.fr", "description": "Le jeune troisième-ligne quitte Aurillac pour Rouen.", "url": "https://www.lequipe.fr/Rugby/Actualites/Kevin-lebreton-aurillac-a-rouen/1129709", "urlToImage": null, "publishedAt": "2020-04-25T13:47:01Z", "content": "Rouen (Pro D2) a annoncé ce samedi la signature pour la saison prochaine du troisième-ligne Kevin Lebreton (25 ans, 1,80 m, 90 kg). Ce joueur évoluait jusque-là à Aurillac, également en Pro D2, où il a cumulé cette saison seize feuilles de match."}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/profile.php?id=100010643894333", "title": "Selon un avocat spécialisé, un joueur en fin de contrat le 30 juin “sera libre de ne pas prolonger” - Canal Supporters", "description": "Pour Sevan Karian les joueurs en fin de contrat le 30 juin ne seront pas obligés de prolonger jusqu’à la fin des championnats.", "url": "https://canal-supporters.com/2020/04/pour-un-avocat-specialise-en-droit-du-sport-un-joueur-en-fin-de-contrat-le-30-juin-sera-libre-de-ne-pas-signer-une-prolongation-jusqua-la-fin-de-la-saison-2019-2020/", "urlToImage": null, "publishedAt": "2020-04-25T13:02:56Z", "content": "C’est l’une des questions qui agitent le monde du football au moment où des dates de reprises sont évoquées. Comment gérer les joueurs en fin de contrat le 30 juin2020 ? Pour rappel, cela concerne neuf joueurs au PSG. Dans les colonnes de Ouest FranceSevan Ka… [+977 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "PSG : A genoux devant Leonardo, Meunier met Mourinho en attente - Foot01.com", "description": "Bientôt en fin de contrat au Paris Saint-Germain, Thomas Meunier intéresse du beau monde, à commencer par le Tottenham de José Mourinho. Mais le latéral droit attend toujours un geste de ses supérieurs.\r\nPas toujours tendres avec Thomas Meunier, les supporter…", "url": "https://www.foot01.com/equipe/paris/psg-a-genoux-devant-leonardo-meunier-met-mourinho-en-attente,347949", "urlToImage": null, "publishedAt": "2020-04-25T13:01:03Z", "content": "Bientôt en fin de contrat au Paris Saint-Germain, Thomas Meunier intéresse du beau monde, à commencer par le Tottenham de José Mourinho. Mais le latéral droit attend toujours un geste de ses supérieurs.\r\nPas toujours tendres avec Thomas Meunier, les supporter… [+1218 chars]"}, {"source": {"id": null, "name": "Maxifoot.fr"}, "author": null, "title": "Mercato - PSG : Icardi recruté puis revendu ? L'Inter a anticipé le coup - Maxifoot", "description": "Prêté cette saison, Mauro Icardi pourrait définitivement être recruté pour 70 millions d'euros par le Paris Saint-Germain.  ...", "url": "http://www.maxifoot.fr/football/article-43526.htm", "urlToImage": null, "publishedAt": "2020-04-25T12:58:00Z", "content": "Prêté cette saison, Mauro Icardi pourrait définitivement être recruté pour 70 millions d'euros par le Paris Saint-Germain. Alors que des rumeurs évoquent une possible revente dans la foulée de l'attaquant argentin, l'Inter Milan a pris le soin de surveiller s… [+1765 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "Coronavirus : le Championnat de Pologne devrait reprendre fin mai - Foot - POL - Coronavirus - L'Équipe.fr", "description": "Le Premier ministre polonais Mateusz Morawiecki a annoncé un probable redémarrage de l'élite polonaise le 29 mai.", "url": "https://www.lequipe.fr/Football/Actualites/Coronavirus-le-championnat-de-pologne-devrait-reprendre-fin-mai/1129700", "urlToImage": null, "publishedAt": "2020-04-25T12:36:45Z", "content": "Le Championnat de football de Pologne, suspendu à cause de la pandémie de coronavirus, devrait reprendre le 29 mai en l'absence de public, a annoncé samedi le Premier ministre polonais Mateusz Morawiecki. « Nous avons un plan précis pour arriver au premier ma… [+587 chars]"}, {"source": {"id": null, "name": "Maxifoot.fr"}, "author": null, "title": "Strasbourg : D. Liénard - pas des cobayes - Maxifoot", "description": "Alors que la Ligue de Football Professionnel prépare une reprise du championnat le 17 juin, de nombreux joueurs affichen...", "url": "https://news.maxifoot.fr/strasbourg/d-lienard-pas-des-cobayes-foot-325224.htm", "urlToImage": null, "publishedAt": "2020-04-25T12:24:00Z", "content": "Alors que la Ligue de Football Professionnel prépare une reprise du championnat le 17 juin, de nombreux joueurs affichent leurs craintes. Du côté de Strasbourg, Dimitri Liénard (32 ans, 22 matchs et 2 buts en L1 cette saison) estime que les conditions sanitai… [+808 chars]"}, {"source": {"id": null, "name": "Sport.fr"}, "author": null, "title": "Ribéry et Gourcuff ne partiront jamais en vacance ensemble, Manardo confirme - Sport.fr", "description": "La relation entre Franck Ribéry et Yoann Gourcuff n’a jamais été très bonne. Il y a quelques années, les deux hommes ont même eu une brouille en Equipe de France. Invité de Rothen régale sur “RMC”, François Manardo, ancien chef de presse de l’Equipe de France…", "url": "https://www.sport.fr/football/ribery-et-gourcuff-ne-partiront-jamais-en-vacance-ensemble-manardo-confirme-683698.shtm", "urlToImage": null, "publishedAt": "2020-04-25T12:19:00Z", "content": "La relation entre Franck Ribéry et Yoann Gourcuff n’a jamais été très bonne. Il y a quelques années, les deux hommes ont même eu une brouille en Equipe de France. \r\nInvité de Rothen régale sur “RMC”, François Manardo, ancien chef de presse de l’Equipe de Fran… [+1079 chars]"}, {"source": {"id": null, "name": "Topmercato.com"}, "author": null, "title": "ASSE : l'énorme don de M'Vila au CHU de Saint-Etienne - Top Mercato.com", "description": "Le milieu de terrain de l'AS Saint-Etienne, Yann M'Vila, est venu en aide au personnel soignant de la cité forézienne.", "url": "http://www.topmercato.com/219594,1/asse---l-enorme-don-de-m-vila-au-chu-de-saint-etienne.html", "urlToImage": null, "publishedAt": "2020-04-25T11:58:00Z", "content": "Le milieu de terrain de l'AS Saint-Etienne, Yann M'Vila, est venu en aide au personnel soignant de la cité forézienne.Le footballeur de 29 ans a effectué un don de 15 000 masques au CHU de Saint-Etienne, comme l'a relayé la formation stéphanoise sur son compt… [+249 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Yannick Sagorin", "title": "L’Ajax privé de titre, Ziyech ne digère pas - Sports.fr", "description": "Les responsables de l’Eredivisie ont pris la décision vendredi de ne pas désigner de champion alors que la saison aux Pays-Bas ne reprendra pas. Malgré son statut de leader après 25 journées sur 34 au programme, l’Ajax n’étoffe donc pas son palmarès. Logique …", "url": "https://www.sports.fr/football/lajax-prive-de-titre-ziyech-ne-digere-349562.html", "urlToImage": null, "publishedAt": "2020-04-25T11:50:44Z", "content": "Les responsables de lEredivisie ont pris la décision vendredi de ne pas désigner de champion alors que la saison aux Pays-Bas ne reprendra pas. Malgré son statut de leader après 25 journées sur 34 au programme, lAjax nétoffe donc pas son palmarès. Logique pou… [+935 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/profile.php?id=100010643894333", "title": "Aulas : “Notre volonté c’est évidemment d’essayer de garder Aouar” - Canal Supporters", "description": "Jean-Michel Aulas explique que Lyon souhaite conserver Houssem Aouar, pisté par le PSG, La Juve et Manchester City.", "url": "https://canal-supporters.com/2020/04/aulas-notre-volonte-cest-evidemment-dessayer-de-garder-aouar/", "urlToImage": null, "publishedAt": "2020-04-25T11:50:34Z", "content": "Hier, RMC Sport expliquait que le PSG – avec Manchester City et Juventus Turin – était intéressé par le recrutement d’Houssem Aouar. Il y a plusieurs semaines, Canal Supporters vous avait informé dun rapprochement entre le PSG et le milieu lyonnais. Jamais av… [+616 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Manchester United - Neville : \"Sancho est loin d'Aguero, Higuain, Messi ou Di Maria\" - Goal.com", "description": "Musa Barrow hopes he can make strides with Bologna.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T11:16:00Z", "content": "More"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Max Franco Sanchez", "title": "Eredivisie : l'annulation du championnat fait polémique - Foot Mercato", "description": "La décision d'annuler la saison fait beaucoup parler aux Pays-Bas, où de nombreux joueurs et clubs s'estiment lésés et désavantagés.", "url": "https://www.footmercato.net/a7504463592023464225-eredivisie-lannulation-du-championnat-fait-polemique", "urlToImage": null, "publishedAt": "2020-04-25T10:54:25Z", "content": "C'est le premier championnat de l'ouest-européen qui a déjà fait savoir qu'il ne reprendra pas. Alors que le gouvernement avait annoncé l'annulation des différents événements sportifs et culturels à travers le pays plus tôt dans la semaine, la Fédération Néer… [+3055 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Expulsé pendant le Tournoi, Haouas a purgé sa suspension pendant le confinement - Le Figaro", "description": "Expulsé lors de la rencontre du Tournoi Ecosse-France le 8 mars dernier pour un coup de poing sur le deuxième ligne du XV au Chardon Jamie Ritchie, Mohamed Haouas avait écopé d'une suspension de trois semaines. Bonne nouvelle pour le joueur de Montpellier : c…", "url": "https://sport24.lefigaro.fr/rugby/top-14/fil-info/expulse-pendant-le-tournoi-haouas-a-purge-sa-suspension-pendant-le-confinement-1000260", "urlToImage": null, "publishedAt": "2020-04-25T10:46:00Z", "content": "Expulsé lors de la rencontre du Tournoi Ecosse-France le 8 mars dernier pour un coup de poing sur le deuxième ligne du XV au Chardon Jamie Ritchie, Mohamed Haouas avait écopé d'une suspension de trois semaines. Bonne nouvelle pour le joueur de Montpellier : c… [+746 chars]"}, {"source": {"id": null, "name": "Sports.fr"}, "author": "Yannick Sagorin", "title": "Ce qu’ont versé Canal+ et beIN Sports à la LFP - Sports.fr", "description": "Les groupes Canal+ et beIN Sports ont obtenu une belle ristourne auprès de la LFP pour les matches de championnat déjà diffusés. Les négociations des présidents Nasser al-Khelaïfi (PSG), Jacques-Henri Eyraud (OM), Olivier Sadran (Toulouse) et Jean-Pierre Rivè…", "url": "https://www.sports.fr/football/quont-verse-canal-bein-sports-a-lfp-349556.html", "urlToImage": null, "publishedAt": "2020-04-25T10:44:47Z", "content": "Les groupes Canal+ et beIN Sports ont obtenu une belle ristourne auprès de la LFP pour les matches de championnat déjà diffusés.\r\nLes négociations des présidents Nasser al-Khelaïfi (PSG), Jacques-Henri Eyraud (OM), Olivier Sadran (Toulouse) et Jean-Pierre Riv… [+857 chars]"}, {"source": {"id": null, "name": "Lerugbynistere.fr"}, "author": "Thibault Perrin", "title": "Lacroix : ''Incompréhensible de reprendre une compétition par des phases finales'' [VIDEO] - Le Rugbynistère", "description": "Le président du Stade Toulousain Didier Lacroix a répondu aux questions que pouvaient se poser les supporters quant à la reprise et à la situation du club.", "url": "https://www.lerugbynistere.fr/videos/lacroix-incomprehensible-de-reprendre-une-competition-par-des-phases-finales-video-2504201209.php", "urlToImage": null, "publishedAt": "2020-04-25T10:10:00Z", "content": "Le président du Stade Toulousain Didier Lacroix a répondu aux questions que pouvaient se poser les supporters quant à la reprise et à la situation du club.Face aux nombreuses incertitudes qui entourent la reprise des matchs, le président du Stade Toulousain D… [+1887 chars]"}, {"source": {"id": null, "name": "Nextgen-auto.com"}, "author": "Emmanuel Touzot", "title": "Gasly : Quand les gens parlent sans savoir, ils se trompent - Nextgen-Auto.com", "description": "Formule 1 | Pierre Gasly a connu une saison 2019 compliquée et avec elle, son lot de critiques quant à ses performances et à sa rétrogradation chez Toro Rosso en (...)", "url": "https://motorsport.nextgen-auto.com/fr/formule-1/gasly-quand-les-gens-parlent-sans-savoir-ils-se-trompent,148019.html", "urlToImage": null, "publishedAt": "2020-04-25T10:04:00Z", "content": "Pierre Gasly a connu une saison 2019 compliquée et avec elle, son lot de critiques quant à ses performances et à sa rétrogradation chez Toro Rosso en cours de saison. Le pilote AlphaTauri juge toutefois que les réseaux sociaux sont une partie normale de la vi… [+3491 chars]"}, {"source": {"id": null, "name": "Footamateur.fr"}, "author": "Jérome Bouchacourt", "title": "Le CS Sedan accuse un arbitre d’être à l’origine de sa mauvaise série - FootAmateur", "description": "Le club ardennais a publié un communiqué assez lunaire ce vendredi en mettant notamment en cause l'arbitre du match contre Haguenau.", "url": "https://www.footamateur.fr/le-cs-sedan-accuse-un-arbitre-detre-a-lorigine-de-sa-mauvaise-serie/", "urlToImage": null, "publishedAt": "2020-04-25T10:01:00Z", "content": "Le club ardennais a publié un communiqué assez lunaire ce vendredi en mettant notamment en cause l’arbitre du match contre Haguenau.\r\nLe CS Sedan-Ardennes n’a toujours pas digéré la pilule de sa non montée en National. Dans un communiqué publié ce vendredi, l… [+2456 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": null, "title": "Paolo Maldini : «Je suis le joueur le plus perdant de l'histoire» - Le Figaro", "description": "L’ancienne gloire du Milan AC et de l’équipe nationale italienne, Paolo Maldini s’est récemment désolé dans un live Instagram, en revendiquant le triste titre du «joueur le plus perdant de l’histoire». Une déclaration étonnante, lorsque l’on connaît le palmar…", "url": "https://sport24.lefigaro.fr/football/etranger/italie/fil-info/paolo-maldini-je-suis-le-joueur-le-plus-perdant-de-l-histoire-1000250", "urlToImage": null, "publishedAt": "2020-04-25T09:37:00Z", "content": "Lancienne gloire du Milan AC et de léquipe nationale italienne, Paolo Maldini sest récemment désolé dans un live Instagram, en revendiquant le triste titre du «joueur le plus perdant de lhistoire». Une déclaration étonnante, lorsque lon connaît le palmarès du… [+679 chars]"}, {"source": {"id": null, "name": "Footmercato.net"}, "author": "Max Franco Sanchez", "title": "Le FC Barcelone et la Juventus préparent un drôle d'échange - Foot Mercato", "description": "La presse catalane dévoile que la Juventus et le FC Barcelone travaillent sur un échange qui mènerait Arthur Melo à Turin.", "url": "https://www.footmercato.net/a4630454773724485785-le-fc-barcelone-et-la-juventus-preparent-un-drole-dechange", "urlToImage": null, "publishedAt": "2020-04-25T09:12:31Z", "content": "C'est une information qui surprend tout le monde en Espagne, et surtout à Barcelone. Depuis quelques jours déjà, différents médias européens évoquent un possible départ d'Arthur Melo, qui aurait été mis en vente par le FC Barcelone, et ce alors que le Brésili… [+2330 chars]"}, {"source": {"id": null, "name": "Laprovence.com"}, "author": "La Provence", "title": "OM : Eyraud a évoqué la crise en visioconférence avec les supporters marseillais - La Provence", "description": "L'OM utilise les moyens du bord. En cette période de confinement liée à la crise sanitaire du coronavirus, Jacques-Henri Eyraud a échangé hier en visioconférence avec les principaux leaders des groupes de supporters marseillais.", "url": "https://www.laprovence.com/actu/en-direct/5971488/om-eyraud-a-evoque-la-crise-en-visioconference-avec-les-supporters-marseillais.html", "urlToImage": null, "publishedAt": "2020-04-25T07:11:47Z", "content": "L'OM utilise les moyens du bord. En cette période de confinement liée à la crise sanitaire du coronavirus, Jacques-Henri Eyraud a échangé hier en visioconférence avec les principaux leaders des groupes de supporters marseillais. Selon RMC Sport, le président … [+1298 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Oriane Alcarini", "title": "Hugo Lloris confiné avec ses trois enfants, \"une source d'évasion\" - Pure People", "description": "Hugo Lloris (33 ans) a raconté son confinement au \"Parisien\", le 23 avril 2020. Le footballeur français dit s'occuper activement de sa petite famille, lui qui est papa d'un tout jeune Léandro (7 mois).", "url": "https://www.purepeople.com/article/hugo-lloris-confine-avec-ses-trois-enfants-une-source-d-evasion_a385670/1", "urlToImage": null, "publishedAt": "2020-04-25T06:45:00Z", "content": "Au cours d'un long entretien accordé au Parisien, Hugo Lloris s'est confié sur son confinement, qu'il vit à Londres et en famille. Le capitaine des Bleus s'agace d'abord de se faire narguer par un merveilleux ciel bleu. \"En huit ans à Londres, je n'ai jamais … [+1611 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "L'UFC annonce une soirée de combats à Jacksonville le 9 mai à huis clos - MMA - UFC - L'Équipe.fr", "description": "L'Ultimate Fighting Championship (UFC) a officiellement annoncé vendredi la tenue de l'UFC 249, le 9 mai prochain dans la Veterans Memorials Arena de Jacksonville. Les combats se dérouleront à huis clos.", "url": "https://www.lequipe.fr/Mma/Actualites/L-ufc-annonce-une-soiree-de-combats-a-jacksonville-le-9-mai-a-huis-clos/1129627", "urlToImage": null, "publishedAt": "2020-04-25T06:30:46Z", "content": "Après plusieurs tentatives infructueuses pour organiser des combats en pleine pandémie de coronavirus, l'UFC, la plus importante ligue professionnelle de MMA, a annoncé vendredi la tenue d'une soirée à huis clos, le 9 mai prochain en Floride. L'UFC 249 se tie… [+1941 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "\"Les années à venir du sport féminin ne vont pas être sympathiques\" : les sportives redoutent de subir les ... - franceinfo", "description": "", "url": "https://www.francetvinfo.fr/sante/maladie/coronavirus/les-annees-a-venir-du-sport-feminin-ne-vont-pas-etre-sympathiques-les-sportives-redoutent-de-subir-les-premiers-les-consequences-du-coronavirus_3932703.html", "urlToImage": null, "publishedAt": "2020-04-25T06:24:41Z", "content": "Avec son lot dannulations de compétitions, de baisse des salaires ou de partenaires qui rompent leurs contrats publicitaires, clubs féminins et sportives craignent dêtre les premiers à payer les pots cassés.\r\nLes conséquences de la crise du coronavirus Covid-… [+2625 chars]"}, {"source": {"id": null, "name": "Onzemondial.com"}, "author": "La rédaction", "title": "Barça : l'éloge d'Ernesto Valverde envers Lionel Messi - Onze Mondial", "description": "L'ancien entraîneur du FC Barcelone, Ernesto Valverde, a dit tout le bien qu'il pense de son ancien élément majeur chez les Blaugranas, Lionel Messi.", "url": "http://www.onzemondial.com/liga/2019-2020/barca-l-eloge-d-ernesto-valverde-envers-lionel-messi-216451", "urlToImage": null, "publishedAt": "2020-04-25T06:20:23Z", "content": "Zapping Onze Mondial Stade Rennais : candidat sérieux à la Ligue des Champions ?\r\nLicencié en janvier dernier du FC Barcelone, Ernesto Valverde continue d’avoir un œil attentif sur l’évolution des Catalans. Celui qui a profité de son temps libre pour enchaîne… [+1172 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "Th.B.", "title": "Mercato - Barcelone : Une voie royale pour le Barça avec Timo Werner ? - Le 10 Sport", "description": "Le FC Barcelone penserait à Timo Werner pour renforcer le secteur offensif blaugrana et Liverpool ne serait pas en course pour accueillir le buteur de Leipzig.", "url": "https://le10sport.com/football/mercato/mercato-barcelone-une-voie-royale-pour-le-barca-avec-timo-werner-501022", "urlToImage": null, "publishedAt": "2020-04-24T23:30:00Z", "content": "Foot - Mercato - Barcelone\r\nPublié le 25 avril 2020 à 1h30 par Th.B. Le FC Barcelone penserait à Timo Werner pour renforcer le secteur offensif blaugrana et Liverpool ne serait pas en course pour accueillir le buteur de Leipzig.\r\nEt si le FC Barcelone raflait… [+1261 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Vincent Bregevin", "title": "Le rêve Pogba et l'acolyte de CR7 : A quoi devrait ressembler le mercato de la Juventus ? - Eurosport - FRANCE (FR)", "description": "TRANSFERTS - Le football est à l’arrêt mais le marché des transferts ne cesse de s’agiter, et certains clubs anticipent déjà le prochain mercato d’été.", "url": "https://www.eurosport.fr/football/serie-a/2019-2020/le-reve-pogba-et-l-acolyte-de-cr7-a-quoi-devrait-ressembler-le-mercato-de-la-juventus_sto7732722/story.shtml", "urlToImage": null, "publishedAt": "2020-04-24T22:03:43Z", "content": "TRANSFERTS - Le football est à larrêt mais le marché des transferts ne cesse de sagiter, et certains clubs anticipent déjà le prochain mercato dété. Quid de la Juventus Turin ? La Vieille Dame tente de séduire les meilleurs avant-centres de la planète pour tr… [+5294 chars]"}, {"source": {"id": "lequipe", "name": "L'equipe"}, "author": "Rédaction", "title": "De nouvelles mesures économiques en faveur du sport - Tous sports - L'Équipe.fr", "description": "A l'issue d'une réunion avec d'autres ministres et divers acteurs du sport, ce vendredi, Roxana Maracineanu a annoncé de nouvelles mesures d'accompagnement pour le secteur.", "url": "https://www.lequipe.fr/Tous-sports/Actualites/De-nouvelles-mesures-economiques-en-faveur-du-sport/1129608", "urlToImage": null, "publishedAt": "2020-04-24T21:27:04Z", "content": "Alors que les inquiétudes se sont renforcées ces derniers jours face à la crise économique générée par l'épidémie de Covid-19, la ministre des Sports Roxana Maracineanu a annoncé dans un tweet, ce vendredi soir, de nouvelles mesures d'accompagnement du secteu… [+577 chars]"}, {"source": {"id": null, "name": "Foot01.com"}, "author": "Rédaction", "title": "Covid-19 : Gardez vos salaires, Roy Keane dénonce l'arnaque - Foot01.com", "description": "Confrontés à d’énormes pertes financières pendant la crise sanitaire, les clubs négocient des baisses de salaire avec leurs joueurs. Une initiative qui agace l’ancien Mancunien Roy Keane.\r\nEn difficulté sur le plan financier, de nombreux clubs ne se contenten…", "url": "https://www.foot01.com/foot-europeen/covid-19-gardez-vos-salaires-roy-keane-denonce-l-arnaque,347911", "urlToImage": null, "publishedAt": "2020-04-24T21:09:46Z", "content": "Confrontés à dénormes pertes financières pendant la crise sanitaire, les clubs négocient des baisses de salaire avec leurs joueurs. Une initiative qui agace lancien Mancunien Roy Keane.\r\nEn difficulté sur le plan financier, de nombreux clubs ne se contentent … [+1255 chars]"}, {"source": {"id": null, "name": "Topmercato.com"}, "author": null, "title": "Rennes : Camavinga retenu à tout prix si... - Top Mercato.com", "description": "Alors que le Real Madrid prépare son offensive pour Eduardo Camavinga et serait prêt à mettre 60 millions d'euros sur l...", "url": "http://www.topmercato.com/219572,1/rennes---camavinga-retenu-a-tout-prix-si---.html", "urlToImage": null, "publishedAt": "2020-04-24T18:02:00Z", "content": "Article lu 2550 fois - Rédigé le 24 avril 2020 à 20h02 par Romain Boselli"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "J.-G.D.", "title": "Mercato - ASSE : Puel s’enflamme pour cette nouvelle prolongation ! - Le 10 Sport", "description": "En réponse à la prolongation de Mahdi Camara jusqu'en 2024, Claude Puel ne tarit pas d'éloges à l'égard de son jeune milieu de terrain (21 ans).", "url": "https://le10sport.com/football/mercato/mercato-asse-puel-senflamme-pour-cette-nouvelle-prolongation-501027", "urlToImage": null, "publishedAt": "2020-04-24T17:40:00Z", "content": "Publié le 24 avril 2020 à 19h40 par J.-G.D. En réponse à la prolongation de Mahdi Camara jusqu'en 2024, Claude Puel ne tarit pas d'éloges à l'égard de son jeune milieu de terrain (21 ans).\r\nAprès WesleyFofana et CharlesAbi, lASSE vient de prolonger un troisiè… [+798 chars]"}, {"source": {"id": null, "name": "Le10sport.com"}, "author": "H.G.", "title": "Mercato - PSG : Bartomeu voudrait réaliser un grand rêve avec Neymar ! - Le 10 Sport", "description": "Alors que le FC Barcelone est annoncé avec insistance sur les traces de Lautaro Martinez, Josep Maria Bartomeu serait prêt à laisser tomber la piste menant à l’attaquant argentin dans le but…", "url": "https://le10sport.com/football/mercato/mercato-psg-bartomeu-pret-a-abandonner-lautaro-martinez-pour-neymar-500978", "urlToImage": null, "publishedAt": "2020-04-24T15:45:00Z", "content": "Publié le 24 avril 2020 à 17h45 par H.G. Alors que le FC Barcelone est annoncé avec insistance sur les traces de Lautaro Martinez, Josep Maria Bartomeu serait prêt à laisser tomber la piste menant à lattaquant argentin dans le but darracher Neymar au PSG.\r\nEn… [+1473 chars]"}, {"source": {"id": null, "name": "Canal-supporters.com"}, "author": "https://www.facebook.com/marc.alvarez1", "title": "Maguire : “La Champions League 19/20 reprendra sous une forme ou une autre” - Canal Supporters", "description": "Les enjeux sont trop importants pour que l'UEFA tire un trait sur la Ligue des champions 2019/2020. Tout sera fait, qu'importe le calendrier,", "url": "https://canal-supporters.com/2020/04/maguire-la-champions-league-19-20-reprendra-sous-une-forme-ou-une-autre/", "urlToImage": null, "publishedAt": "2020-04-24T14:54:14Z", "content": "Les enjeux sont trop importants pour que l’UEFA tire un trait sur la Ligue des champions 2019/2020. Tout sera fait, qu’importe le calendrier, pour que la compétition continentale suspendue depuis la mi-mars aille à son terme. Le spécialiste de l’économie du f… [+1420 chars]"}, {"source": {"id": null, "name": "Eurosport.fr"}, "author": "Eurosport", "title": "Ligue des champions : La Fédération européenne qualifie directement le PSG pour le Final Four - Eurosport - FRANCE (FR)", "description": "Dans l'incapacité de jouer les huitièmes et quarts de la compétition, la Fédération européenne de handball a décidé de qualifier directement quatre équipes.", "url": "https://www.eurosport.fr/handball/ligue-des-champions/2019-2020/ligue-des-champions-la-federation-europeenne-qualifie-directement-le-psg-pour-le-final-four_sto7734057/story.shtml", "urlToImage": null, "publishedAt": "2020-04-24T14:43:59Z", "content": "Voilà une décision de la Fédération européenne de handball qui ne devrait pas plaire à toutes les équipes encore engagées en Ligue des champions. Dans la un communiqué, la Fédération a décidé d'annuler les huitièmes et quarts de finale de la compétition pour … [+769 chars]"}]}