{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Thesun.co.uk"}, "author": "SunSport Reporters", "title": "Chelsea news LIVE: Ziyech could join THIS season, Mertens move ‘extremely aggressive’, no Blues pay cuts - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11431850/chelsea-news-live-ziyech-transfer-mertens-pay-cut/", "urlToImage": null, "publishedAt": "2020-04-26T18:48:10Z", "content": "BLUES WANTED NEYMAR\r\nChelsea made a serious attempt to sign Neymar back in 2010, the Brazilian's former agent has revealed. \r\nThen just 18, the Santos trickster was already one of world football's hottest properties, having dazzled with his incredible skills … [+605 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Alex Milne", "title": "Gary Lineker recalls moment he soiled his pants at World Cup in 1990 - Mirror Online", "description": "The former Three Lions striker suffered a somewhat embarrassing mishap during a group stage game against the Republic of Ireland and has revealed all about the incident", "url": "https://www.mirror.co.uk/sport/football/news/gary-lineker-recalls-moment-soiled-21929243", "urlToImage": null, "publishedAt": "2020-04-26T18:44:22Z", "content": "Match of the Day presenter Gary Lineker has opened up about the traumatic moment when he soiled himself at the World Cup in Italy in 1990.\r\nThe former forward is regularly taunted by social media users about the incident, and he has been unable to shake off j… [+2098 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Alex Dicken", "title": "Gary Neville demands action over clubs taking Aston Villa's stance - Birmingham Live", "description": "Aston Villa chief executive Christian Purslow revealed on Saturday that the first team and senior staff members have all agreed to take a 25 per cent wage deferral for the next four months", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/gary-neville-demands-action-over-18153459", "urlToImage": null, "publishedAt": "2020-04-26T18:31:03Z", "content": "Aston Villas first team squad have agreed to take a 25 per cent wage deferral for the next four months.\r\nVirtually every football club across the country is feeling the financial strain of the coronavirus pandemic with games suspended indefinitely.\r\nVilla are… [+4724 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Bill Belichick admits New England Patriots not drafting a quarterback was 'not by design' - Sky Sports", "description": "New England head coach Bill Belichick has admitted not taking a quarterback in the Patriots' first post-Tom Brady draft \"was not by design\".", "url": "https://www.skysports.com/nfl/news/12118/11979177/bill-belichick-admits-new-england-patriots-not-drafting-a-quarterback-was-not-by-design", "urlToImage": null, "publishedAt": "2020-04-26T17:59:35Z", "content": "New England head coach Bill Belichick has admitted not taking a quarterback in the Patriots' first post-Tom Brady draft \"was not by design\".\r\nThe Patriots selected 10 players in the 2020 NFL Draft, but no quarterbacks to compete for the starting job that was … [+2213 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Matt Porter For Mailonline", "title": "Gary Neville on why he hated sharing a hotel room with David Beckham - Daily Mail", "description": "Gary Neville and David Beckham shared a hotel room for six months on Manchester United away days when they first broke into the team, and it was apparently quite a strain for both of them.", "url": "https://www.dailymail.co.uk/sport/football/article-8258539/Gary-Neville-hated-sharing-hotel-room-David-Beckham.html", "urlToImage": null, "publishedAt": "2020-04-26T17:24:57Z", "content": "Gary Neville and David Beckham shared a hotel room for six months on Manchester United away days when they first broke into the team, and it apparently put quite a strain on both of them.\r\nWhile they linked up well together down United's right flank, Neville … [+1815 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Daniel Davis For Mailonline Sebastian Murphy-bates For Mailonline", "title": "Pictured: Female guests give lap dances at Moise Kean's lockdown house party - Daily Mail", "description": "Everton labelled the behaviour  'unacceptable' after the £27million striker, who  earns £53,000 a week, sent footage of himself partying at his Cheshire apartment on social media.", "url": "https://www.dailymail.co.uk/news/article-8258715/Pictured-Female-guests-lap-dances-Moise-Keans-lockdown-house-party.html", "urlToImage": null, "publishedAt": "2020-04-26T17:16:01Z", "content": "Female guests have been pictured giving lap dances to Premier League footballer Moise Kean during lockdown.\r\nThe Everton star has 'appalled' his club by sharing social media footage of him at a private party. \r\nHis club labelled the behaviour 'unacceptable' a… [+3090 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Rangers: Club intend to provide evidence supporting inquiry ahead of SPFL meeting - BBC News", "description": "Rangers say they will produce evidence supporting their push for an independent investigation of the SPFL \"well in advance of a general meeting\".", "url": "https://www.bbc.co.uk/sport/football/52434111", "urlToImage": null, "publishedAt": "2020-04-26T17:13:10Z", "content": "Interim Rangers chairman Douglas Park had called for the suspension of SPFL chief executive Neil Doncaster\r\nRangers say they will produce evidence supporting their push for an independent investigation of the SPFL \"well in advance of a general meeting\".\r\nOn F… [+1769 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Luke Gardener", "title": "Man Utd chief Ed Woodward wants one of FIVE Juventus stars in Paul Pogba transfer deal - Express", "description": "Manchester United could sell Paul Pogba in the summer transfer window with a Juventus return for the World Cup winner on the cards.", "url": "https://www.express.co.uk/sport/football/1274102/Man-Utd-Ed-Woodward-FIVE-Juventus-Paul-Pogba-transfer-deal-swap-latest-news-gossip", "urlToImage": null, "publishedAt": "2020-04-26T17:11:41Z", "content": "Meanwhile, French football expert Julien Laurens believes Real Madrid will go all out to sign Pogba.\r\n\"I think they will still have some room for other eggs in that basket to be fair because I still think, like other clubs in Europe, Real Madrid have cash res… [+648 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Bobby Vincent", "title": "Liverpool's most dangerous Premier League team revealed - Liverpool Echo", "description": "We've built a side capable of scoring - here's an XI based on the highest scoring players per position for Liverpool", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpools-most-dangerous-premier-league-18124414", "urlToImage": null, "publishedAt": "2020-04-26T17:11:03Z", "content": "Liverpool supporters have been lucky enough to see some clinical goalscorers grace the Anfield turf since the Premier League began.\r\nBelow is a team of players, with the highest-scoring player past or present for each position.\r\nHowever, this is not of all-ti… [+7496 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Paul Ince sends warning to Manchester United over Jack Grealish transfer - Metro.co.uk", "description": "They have to get the balance right!", "url": "https://metro.co.uk/2020/04/26/paul-ince-sends-warning-manchester-united-70m-move-jack-grealish-12612852/", "urlToImage": null, "publishedAt": "2020-04-26T16:44:48Z", "content": "Jack Grealish is one of Manchester Uniteds top transfer targets (Picture: Getty)\r\nPaul Ince believes Jack Grealish would fit in with any team in the top five but has urged Ole Gunnar Solskjaer to strongly consider his options before spending big on the Aston … [+2213 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Jesse Lingard and Ravel Morrison step up their fitness ahead of return to action - Mirror Online", "description": "Jesse Lingard and Ravel Morrison are getting ready to return to action as they work on their fitness levels despite no date set for ending the lockdown", "url": "https://www.mirror.co.uk/sport/football/news/jesse-lingard-ravel-morrison-step-21929356", "urlToImage": null, "publishedAt": "2020-04-26T16:41:35Z", "content": "Jesse Lingard and Ravel Morrison have been seen preparing for football's return as they keep fit.\r\n Both players are products of the Manchester United academy, although the latter has since moved on. \r\nIn accordance with social distancing guidelines the pair … [+1597 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Paul Gorst", "title": "Jurgen Klopp's quiet Philippe Coutinho statement gave Liverpool the recipe for success - Liverpool Echo", "description": "A player of Philippe Coutinho's ilk is no longer viewed as a necessity for success at Liverpool", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/jurgen-klopps-quiet-philippe-coutinho-18153555", "urlToImage": null, "publishedAt": "2020-04-26T16:12:44Z", "content": "Rewind the clock back to January 2018 and Jurgen Klopp was being questioned.\r\n The Liverpool manager's role at Anfield was as safe as houses, of course, but with the transfer window still wide open and the Reds without Philippe Coutinho, fans wanted a replace… [+3436 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Diogo Jota: Wolves forward believes Premier League will be completed - BBC Sport", "description": "Wolves and Portugal forward Diogo Jota believes the Premier League will be completed despite the cancellation of some other European leagues because of coronavirus.", "url": "https://www.bbc.co.uk/sport/football/52435195", "urlToImage": null, "publishedAt": "2020-04-26T16:03:50Z", "content": "Diogo Jota joined Wolves from Atletico Madrid - initially on loan - in 2017\r\nWolves and Portugal forward Diogo Jota believes the Premier League will be completed despite the cancellation of some other European leagues because of coronavirus.\r\nThe Dutch Erediv… [+2904 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Sean McCormick", "title": "Newcastle United takeover news RECAP: Timescale latest as Premier League checks near completion - ChronicleLive", "description": "The latest NUFC takeover news as Amanda Staveley, the Reuben brothers and the Saudi Public Investment Fund close in on Newcastle United", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/newcastle-united-takeover-news-recap-18149994", "urlToImage": null, "publishedAt": "2020-04-26T15:49:00Z", "content": "“Personally, I’ve been talking to a couple of strong American bids, one with sporting connections and one incredibly wealthy individual, even by American standards, but in this period of exclusivity, they cannot move.\r\n“I think the takeover will be waved thro… [+1344 chars]"}, {"source": {"id": null, "name": "Mmamania.com"}, "author": "Ryan Harkness", "title": "Video: Mayweather trains through pandemic, taunts McGregor - MMA Mania", "description": "Coronavirus can’t keep Floyd Mayweather out of the boxing gym, and it sounds like his mind is still on Conor McGregor.", "url": "https://www.mmamania.com/2020/4/26/21237334/video-mayweather-taunts-mcgregor-during-pandemic-training-session", "urlToImage": null, "publishedAt": "2020-04-26T15:19:12Z", "content": "Coronavirus cant keep Floyd Mayweather out of the boxing gym, and it sounds like his mind is still on Conor McGregor."}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nJason Burt,", "title": "Premier League needs 300 people per match to end lockdown and reboot season - Telegraph.co.uk", "description": "Some clubs will not play home matches in their own grounds if authorities believe that is safest approach to completing fixtures", "url": "https://www.telegraph.co.uk/football/2020/04/26/premier-league-says-needs-just-300-people-per-match-reboot-season/", "urlToImage": null, "publishedAt": "2020-04-26T15:15:00Z", "content": "Tom Harrison, the chief executive of the ECB, said: Clearly there will need to be a significant testing regime in place. I'm not sure if quarantined is the right word but there will need to be areas of the ground where only certain people are allowed to go at… [+4303 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Celtic player slammed for saying eight-year-old \"will be peng when she's older\" - Daily Record", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiXGh0dHBzOi8vd3d3LmRhaWx5cmVjb3JkLmNvLnVrL25ld3Mvc2NvdHRpc2gtbmV3cy9jZWx0aWMtcGxheWVyLXNsYW1tZWQtc2F5aW5nLWVpZ2h0LTIxOTI4OTMx0gFgaHR0cHM6Ly93d3cuZGFpbHlyZWNvcmQuY28udWsvbmV3cy9zY290dGlzaC1uZXdzL2NlbHRpYy1wbGF5ZXItc2xhbW1lZC1zYXlpbmctZWlnaHQtMjE5Mjg5MzEuYW1w?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T15:14:48Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Manchester United clear out: Anthony Martial, David De Gea & Juan Mata to stay? | Premier League - ESPN UK", "description": "ESPN FC’s Mark Ogden joins Mark Donaldson to muse over potential Manchester United departures once the transfer window eventually opens. Ogden thinks there’s...", "url": "https://www.youtube.com/watch?v=Y5pOteM-zd0", "urlToImage": null, "publishedAt": "2020-04-26T15:00:21Z", "content": "ESPN FCs Mark Ogden joins Mark Donaldson to muse over potential Manchester United departures once the transfer window eventually opens. Ogden thinks theres no chance Argentinian defender Marcos Rojo will stay the club and thinks Anthony Martials Old Trafford … [+415 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Chelsea made Neymar transfer offer, confirms agent Wagner Ribeiro - Mirror Online", "description": "Neymar was once the hottest property in world football and attracted interest from several of Europe's elite clubs before moving to Barcelona, but not before a failed approach from Chelsea", "url": "https://www.mirror.co.uk/sport/football/news/chelsea-made-neymar-transfer-offer-21928879", "urlToImage": null, "publishedAt": "2020-04-26T14:41:27Z", "content": "Neymar's former agent Wagner Ribeiro has confirmed Chelsea once made a serious offer to sign the Brazilian superstar. \r\n The PSG forward has had no shortage of admirers throughout his career, and it was back when he was learning his trade at Santos that Chels… [+1917 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Jofra Archer: England World Cup winner finds medal in guest bedroom - BBC Sport", "description": "England World Cup winner Jofra Archer has finally found the medal he lost in his house move.", "url": "https://www.bbc.co.uk/sport/cricket/52434308", "urlToImage": null, "publishedAt": "2020-04-26T14:28:06Z", "content": "Jofra Archer with World Cup trophy and medal\r\nThe old saying goes that a missing object is always in the last place you look. For World Cup winner Jofra Archer, that was in his guest bedroom.\r\nArcher helped make English cricket history when he bowled the supe… [+885 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Dan Ripley for MailOnline", "title": "How Tottenham Hotspur have become football's pariahs during the coronavirus pandemic - Daily Mail", "description": "During the coronavirus pandemic Spurs have walked into one PR gaffe after another ranging from cutting non-playing staff pay, to multiple training sessions breaking social distancing rules.", "url": "https://www.dailymail.co.uk/sport/football/article-8245133/How-Tottenham-Hotspur-footballs-pariahs-coronavirus-pandemic.html", "urlToImage": null, "publishedAt": "2020-04-26T14:18:10Z", "content": "2020 OLYMPIC GAMES  \r\nThe 2020 Olympic Games has been postponed until 2021 on March 24 - becoming one of the last major sporting events this summer to fall victim to the coronavirus.\r\nJapanese prime minister Shinzo Abe held a crucial conference call with Olym… [+24811 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Football's biggest losers after Paolo Maldini's surprise confession - Mirror Online", "description": "Paolo Maldini has labelled himself \"the biggest loser in history\" despite a trophy-laden career, but several other legends could also challenge him for such a title", "url": "https://www.mirror.co.uk/sport/football/news/footballs-biggest-losers-after-paolo-21928806", "urlToImage": null, "publishedAt": "2020-04-26T14:14:04Z", "content": "\"No one ever remembers who finishes second\" is a quote that will stand the test of time.\r\nSome of the greatest prizes in football have eluded the all time greats.\r\nItalian legend Paolo Maldini surprised many when he recently declared himself \"the biggest lose… [+4630 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Coronavirus: Nicaraguan boxing event goes ahead with masks and temperature checks - BBC News", "description": "A boxing show with a somewhat different look goes ahead in Nicaragua - despite the sport being largely shut down globally.", "url": "https://www.bbc.co.uk/sport/boxing/52432485", "urlToImage": null, "publishedAt": "2020-04-26T13:19:08Z", "content": "Referees and ring girls kept their face masks on at all times\r\nBoxing action may have ground to a halt in the United Kingdom and across the world because of the coronavirus pandemic - but in Nicaragua, it is business as usual.\r\nWell, almost.\r\nOn Saturday nigh… [+2347 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Mark Fleming", "title": "Mo Salah works out at 2:40am at home as Liverpool star does pull-ups to keep physique in amazing shape during - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11483583/mo-salah-physique-liverpool-pull-ups-night/", "urlToImage": null, "publishedAt": "2020-04-26T13:15:03Z", "content": "LIVERPOOL star Mo Salah has proved his commitment to keeping himself fit by going through an intense workout at 2:40am\r\nSalah, 27, posted a photo of himself doing chin-ups using a pull-up bar at his home, in the middle of the night.\r\n Mohamed Salah performs p… [+1972 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Reuters", "title": "Alan Pardew denies he will receive bonus for avoiding Eredivisie relegation - The Guardian", "description": "Den Haag were seven points from safety before Eredivisie’s was cancelled and a report claimed Alan Pardew was due £100,000", "url": "https://www.theguardian.com/football/2020/apr/26/alan-pardew-denies-he-will-receive-bonus-for-avoiding-dutch-relegation", "urlToImage": null, "publishedAt": "2020-04-26T13:14:00Z", "content": "Den Haags manager, Alan Pardew, has denied reports stating he will receive a bonus for avoiding relegation after the Eredivisie season was terminated because of the Covid-19 pandemic.\r\nThe decision to scrap the season meant Den Haag, who were second from bott… [+1137 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Neil Moxley", "title": "Forget Allegri - Steve Bruce deserves Newcastle chance he's waited his whole life for - Mirror Online", "description": "Bruce has left every club he's managed in a better state than he found it in - but he's never had the chance to work with the riches he could be about to enjoy at St James' Park", "url": "https://www.mirror.co.uk/sport/football/news/forget-allegri-steve-bruce-deserves-21927929", "urlToImage": null, "publishedAt": "2020-04-26T13:05:12Z", "content": "Max Allegri, Mauricio Pochettino, Roberto Mancini all poised to become the next Newcastle United manager.\r\nSteve Bruce must feel honoured.\r\nEight months ago, the trio would have struggled to pin-point the city on a map now theyre being shortlisted for a job t… [+3480 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Manchester United quiz! ESPN FC's Mark Ogden takes on Danny Higginbotham | Premier League - ESPN UK", "description": "The latest ESPN FC quiz is a Manchester United feast! Mark Ogden and former Premier League defender Danny Higginbotham face each other in a test of Man Unite...", "url": "https://www.youtube.com/watch?v=ekm-1cRn4u0", "urlToImage": null, "publishedAt": "2020-04-26T13:00:30Z", "content": "The latest ESPN FC quiz is a Manchester United feast! Mark Ogden and former Premier League defender Danny Higginbotham face each other in a test of Man United IQ. \r\nSubscribe to ESPN UK: http://bit.ly/1oGUzVA\r\nFollow ESPN UK across multiple platforms:\r\nhttps:… [+74 chars]"}, {"source": {"id": null, "name": "Leeds-live.co.uk"}, "author": "Josh Challies", "title": "Latest EFL plan would see big change to relegation places in 2020/21 Championship season - Leeds Live", "description": "The number of relegation spots in the Championship during the 2020/21 season could be increased by two", "url": "https://www.leeds-live.co.uk/sport/leeds-united/latest-efl-plan-would-see-18152488", "urlToImage": null, "publishedAt": "2020-04-26T13:00:00Z", "content": "Leagues One and Two could be decided by the top eight sides from each division taking part in a mini-tournament to decide who is promoted.\r\n The idea is one of three contingency plans being considered by the EFL, Sky Sports reports\r\n, and was presented during… [+1242 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Stars join general public to take on 2.6 challenge following London Marathon postponement - ITV News", "description": "With the London Marathon postponed due to the coronavirus crisis, sports stars answered the call to take part in the 2.6 challenge on Sunday.\n\nRaising money for the charities missing out as a result of the race being off, various big names stepped up to take …", "url": "https://www.itv.com/news/2020-04-26/stars-and-general-public-take-on-2-6-challenge-following-marathon-postponement/", "urlToImage": null, "publishedAt": "2020-04-26T12:59:00Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Jake Polden", "title": "Cristiano Ronaldo's telling reaction to Lionel Messi winning sixth Ballon d'Or award - Mirror Online", "description": "Last year's Ballon d'Or ceremony was one of the most important in recent history because it separated Lionel Messi and Cristiano Ronaldo - perhaps even for good", "url": "https://www.mirror.co.uk/sport/football/news/cristiano-ronaldos-telling-reacting-lionel-21928148", "urlToImage": null, "publishedAt": "2020-04-26T12:43:40Z", "content": "Lionel Messi or Cristiano Ronaldo?\r\nIt's one of football's biggest debates, with fans on both side of the fence putting forward convincing arguments as to why their favourite is the best player on the planet.\r\nThe careers of the two footballing Goliaths have … [+1698 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Tumaini Carayol", "title": "Kyla Ross: 'In college, I was more nervous to train than compete' - The Guardian", "description": "The gymnast, a US Olympic gold medallist and last person to beat Simone Biles, has seen her last year of competition come to abrupt close", "url": "https://www.theguardian.com/sport/2020/apr/26/kyla-ross-college-more-nervous-to-train-than-compete-us-gymnastics-coronavirus", "urlToImage": null, "publishedAt": "2020-04-26T12:26:00Z", "content": "For most of the past 20 years, gymnastics is the only thing that Kyla Ross has known. She was doing handstands by four years old, she was an Olympic gold medallist by 15 and this year at 23 she was finishing an exceptional college gymnastics career at UCLA. T… [+6460 chars]"}, {"source": {"id": "talksport", "name": "TalkSport"}, "author": "Jackson Cole", "title": "Liverpool boss Jurgen Klopp ‘calls Kylian Mbappe’s dad’ in bid to sign Paris Saint-Germain superstar - talkSPORT.com", "description": "", "url": "http://talksport.com/football/699164/liverpool-boss-jurgen-klopp-kylian-mbappe-paris-saint-germain/", "urlToImage": null, "publishedAt": "2020-04-26T12:23:34Z", "content": "Liverpool boss Jurgen Klopp is pulling out all the stops to sign Kylian Mbappe having reportedly contacted the player’s dad.\r\nMbappe, 21, is one of the world’s most sought-after players and has been linked with a move to Real Madrid in a move that could eclip… [+2926 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Simon Bajkowski", "title": "Raheem Sterling lifts lid on Man City dressing room when they lose - Manchester Evening News", "description": "Manchester City forward Raheem Sterling has spoken about a key change that Pep Guardiola has made at the club.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-city-dressing-room-sterling-18152466", "urlToImage": null, "publishedAt": "2020-04-26T12:11:42Z", "content": "Raheem Sterling has learnt the importance of winning under Pep Guardiola at Manchester City.\r\nThe Blues set a Premier League record of 18 consecutive victories in the 2017/18 campaign on their stroll to the title and then won 14 straight games the following y… [+2520 chars]"}, {"source": {"id": null, "name": "Thecelticstar.com"}, "author": "Lubo98", "title": "‘This is the best team I’ve played with’, Christopher Jullien - The Celtic Star", "description": "CHRISTOPHER JULLIEN has discussed the prospect of returning to football without supporters, his goal against Rangers and how much he is loving life in Glasgow with Celtic in a wide ranging interview.", "url": "https://thecelticstar.com/this-is-the-best-team-ive-played-with-christopher-jullien/", "urlToImage": null, "publishedAt": "2020-04-26T12:09:48Z", "content": "CHRISTOPHER JULLIEN has discussed the prospect of returning to football without supporters, his goal against Rangers and how much he is loving life in Glasgow with Celtic in a wide ranging interview. Jullien has become a favourite since arriving from Toulouse… [+4593 chars]"}, {"source": {"id": null, "name": "Autosport.com"}, "author": "Alex Kalinauckas", "title": "The new factor boosting Sergio Perez - F1 - autosport.com", "description": "Assuming Formula 1's 'normal' calendar returns, soon there will be several drivers with hundreds of starts at a very young age. One of those drivers has already achieved much success, but now has a new ingredient to enhance his next chapter", "url": "https://www.autosport.com/f1/feature/10096/the-new-factor-boosting-sergio-perez", "urlToImage": null, "publishedAt": "2020-04-26T12:09:18Z", "content": "A relatively new phenomenon is taking hold in Formula 1. In the last 15 or so years, even more drivers have made their grand prix racing debuts at the very start of their third decade - and in several cases before the end of their second.\r\nYoung drivers gradu… [+433 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Tom Brady: Tampa mayor Jane Castor writes witty letter to Buccaneers - BBC News", "description": "The mayor of Tampa hints she is open to renaming the Tampa Bay area as she writes a witty apology to Tom Brady after he is thrown out of a city park.", "url": "https://www.bbc.co.uk/sport/american-football/52431025", "urlToImage": null, "publishedAt": "2020-04-26T10:29:22Z", "content": "Media playback is not supported on this device\r\nWatch: Tom Brady's top 10 moments\r\nOne minute Tom Brady is being thrown out of a Tampa park, the next the city's mayor is cheerfully apologising and hinting the area could one day be renamed if the quarterback d… [+1899 chars]"}, {"source": {"id": null, "name": "Motorsport.com"}, "author": "Jonathan Noble", "title": "Leclerc: Bianchi deserved Ferrari seat more than me - Motorsport.com", "description": "Charles Leclerc says close friend Jules Bianchi probably deserved a Ferrari Formula 1 race seat more than him – and would have delivered better results than he has so far.", "url": "https://www.motorsport.com/f1/news/leclerc-jules-bianchi-ferrari-todt/4784955/", "urlToImage": null, "publishedAt": "2020-04-26T10:14:00Z", "content": "Last week, Renault driver Daniel Ricciardo listed Bianchi as one of his most underrated rivals, and suggested that the Frenchman would have been as big a star at Ferrari as Leclerc has become, were it not for his death as the result of injuries sustained in a… [+1681 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Barney Ronay", "title": "World Cup questions: Were England robbed by Argentina at Mexico 86? - The Guardian", "description": "With the help of the Fifa archive we rewatch a series of memorable games in search of answers we didn’t find at the time", "url": "https://www.theguardian.com/football/2020/apr/26/world-cup-questions-were-england-robbed-by-argentina-at-mexico-86", "urlToImage": null, "publishedAt": "2020-04-26T10:03:00Z", "content": "You can take our freedom. But you cant take our grainy old football videos. In this short series I will be exploring the contents of Fifas newly released World Cup archive; revisiting World Cup lore and World Cup truisms, and finding out if staring at them in… [+15862 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Colin Millar", "title": "Man City morning headlines as Pep Guardiola linked with transfer swoop for Juventus and Benfica defenders - Manchester Evening News", "description": "Here are your Manchester City morning headlines for Sunday, April 26.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-city-headlines-guardiola-juventus-18152107", "urlToImage": null, "publishedAt": "2020-04-26T09:55:05Z", "content": "Fernandinho key for City\r\nThere are many other City stars who regularly feature in the headlines and get their share of plaudits, but Fernandinho is just as vital as any of them and his role has continually been undervalued.\r\nThe 34-year-old has consistently … [+3361 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Rafael sends Manchester United summer transfer warning - Goal.com", "description": "Jack Wilshere has revealed he was reluctant to join Arsenal when he received an offer from the club.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T09:41:00Z", "content": "More"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Melissa Reddy", "title": "Arsenal players allowed to return to training 46 days after Mikel Arteta contracted coronavirus - The Independent", "description": "Premier League was suspended after Arteta was diagnosed with Covid-19, with players set to be allowed to return to the club’s London Colney base with strict guidelines in place and a rotation schedule", "url": "https://www.independent.co.uk/sport/football/premier-league/arsenal-training-coronavirus-mikel-arteta-london-colney-a9484396.html", "urlToImage": null, "publishedAt": "2020-04-26T09:33:01Z", "content": "Arsenals squad will be permitted to train at their London Colney base from Monday under carefully controlled conditions for the first time since Mikel Arteta tested positive for coronavirus.\r\nThe partial reopening of the facility comes 46 days after the manag… [+1503 chars]"}, {"source": {"id": null, "name": "Planetf1.com"}, "author": "", "title": "McLaren receive £300million cash injection - Planet F1", "description": "The McLaren Group have confirmed a cash injection of £300m from its shareholders as they look to navigate through the COVID-19 pandemic.", "url": "https://www.planetf1.com/news/mclaren-300million-cash-injection/", "urlToImage": null, "publishedAt": "2020-04-26T09:14:12Z", "content": "The McLaren Group have confirmed a cash injection of £300m from its shareholders as they look to navigate through the COVID-19 pandemic.\r\nOn top of the investment from its shareholders, McLaren are talking to third parties about boosting its working capital.\r… [+2033 chars]"}, {"source": {"id": null, "name": "Bournemouthecho.co.uk"}, "author": "Dan Rose", "title": "Premier League inching closer to televised return behind closed doors - Bournemouth Echo", "description": "THE Premier League is in discussions with UK rights holders about how best to broadcast the season's remaining fixtures as the campaign edges closer…", "url": "https://www.bournemouthecho.co.uk/sport/18406283.premier-league-inching-closer-televised-return-behind-closed-doors/", "urlToImage": null, "publishedAt": "2020-04-26T09:00:00Z", "content": "THE Premier League is in discussions with UK rights holders about how best to broadcast the season's remaining fixtures as the campaign edges closer to a return behind closed doors, the PA news agency understands.\r\nIt is six weeks since the English top-flight… [+1606 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ashley Preece", "title": "EFL issue statement as West Brom hero pokes fun at Wolves - Birmingham Live", "description": "West Bromwich Albion daily digest - Here's a round-up of the latest Albion stories via BirminghamLive, including goal-hero Robert Earnshaw reliving The Great Escape", "url": "https://www.birminghammail.co.uk/sport/football/football-news/efl-issue-statement-west-brom-18151514", "urlToImage": null, "publishedAt": "2020-04-26T08:43:33Z", "content": "Reidy\r\nSteven Reid is still fondly remembered within the ranks of the West Bromwich Albion fanbase.\r\nThe versatile Irishman, who played at right-back and in defensive midfield during his four year stay at The Hawthorns returned to aid Jimmy Shan in a coaching… [+6844 chars]"}, {"source": {"id": null, "name": "Sportinglife.com"}, "author": null, "title": "FWD Champions Mile (Group 1): Fownes hails a Legend as Southern slays Beauty Generation in Champions Mile - Sportinglife.com", "description": "Persistence finally paid off for Southern Legend in the FWD Champions Mile at Sha Tin on Sunday as one of Hong Kong's best supporting actors finally got the better of local hero Beauty Generation in the FWD Champions Mile.", "url": "https://www.sportinglife.com/racing/news/southern-slays-beauty-generation/179438", "urlToImage": null, "publishedAt": "2020-04-26T08:28:22Z", "content": "Persistence finally paid off for Southern Legend in the FWD Champions Mile at Sha Tin on Sunday as one of Hong Kong's best supporting actors finally got the better of local hero Beauty Generation in the FWD Champions Mile.Beauty Generation was bidding to beco… [+3148 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Tyrone Marshall", "title": "Scott McTominay reveals what he's learned from Manchester United great Cristiano Ronaldo - Manchester Evening News", "description": "Man Utd academy graduate Scott McTominay looks up to one aspect of Cristiano Ronaldo's game.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-utd-mctominay-cristiano-ronaldo-18151630", "urlToImage": null, "publishedAt": "2020-04-26T08:24:35Z", "content": "Scott McTominay and Cristiano Ronaldo might not share many similarities when it comes to their style of play, but the Manchester United academy graduate looks up the Old Trafford great in one way. \r\n The Scottish midfielder has won plenty of praise for his me… [+1280 chars]"}, {"source": {"id": null, "name": "Hammers.news"}, "author": "Antony Martin", "title": "West Ham fans split on report claiming Fabian Balbuena could be sold - Hammers News - West Ham United FC", "description": "Football.London have claimed that West Ham could be looking to sell Fabian Balbuena this summer, and some Hammers fans have taken to Twitter in reaction to the speculation. The 28-year-old, who earns £40,000 per week (Spotrac) joined the Hammers from Brazilia…", "url": "https://www.hammers.news/club-news/west-ham-fans-split-on-report-claiming-fabian-balbuena-could-be-sold/", "urlToImage": null, "publishedAt": "2020-04-26T08:23:24Z", "content": "Football.London have claimed that West Ham could be looking to sell Fabian Balbuena this summer, and some Hammers fans have taken to Twitter in reaction to the speculation.\r\nThe 28-year-old, who earns £40,000 per week (Spotrac) joined the Hammers from Brazili… [+2279 chars]"}, {"source": {"id": null, "name": "Dartsnews.com"}, "author": null, "title": "Schedule PDC Home Tour – Night Ten with Aspinall among line-up - Dartsnews.com", "description": "Schedule PDC Home Tour – Night Ten with Aspinall among line-up Aspinall will aim to not suffer the same fate as the other star names who have been involved.", "url": "https://dartsnews.com/schedule-pdc-home-tour-night-ten-with-aspinall-among-line-up/", "urlToImage": null, "publishedAt": "2020-04-26T08:07:44Z", "content": "The tenth PDC Home Tour group is here with Premier League star Nathan Aspinall the star name on Sunday night.\r\nAspinall will aim to not suffer the same fate as the other star names who have been involved such as Peter Wright, Gerwyn Price and last night Micha… [+1728 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Mark Douglas", "title": "'Everyone hopes for it': Jetro Willems sends a transfer message to Newcastle United - Chronicle Live", "description": "Newcastle United loanee Jetro Willems says he absolutely wants to return to the club where he enjoyed a decent temporary spell", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/everyone-hopes-it-jetro-willems-18150981", "urlToImage": null, "publishedAt": "2020-04-26T08:01:55Z", "content": "Jetro Willems has re-stated his number one priority is to sign and play for Newcastle United in an impromptu Twitter question and answer session.\r\nThe popular wing-back had made a fine impression at St James Park before a serious injury suffered at the turn o… [+1177 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Nathan Bliss", "title": "We simulated Tottenham vs Arsenal to see what could have happened in the North London Derby - Football.London", "description": "The Tottenham Hotspur Stadium would have hosted its first North London Derby this weekend, with Jose Mourinho and Mikel Arteta locking horns, but what would the score have been? We used FIFA 20 to find out.", "url": "https://www.football.london/tottenham-hotspur-fc/fixtures-results/tottenham-hotspur-arsenal-match-simulated-18146941", "urlToImage": null, "publishedAt": "2020-04-26T07:06:39Z", "content": "WIth the UK still in lockdown due to the ongoing coronavirus pandemic, this weekend's planned North London Derby between Tottenham Hotspur and Arsenal will not be played, with the safety of fans, players and staff of paramount importance.\r\nBut even though the… [+3118 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Vic Marks", "title": "ECB sticking with the Hundred risks twisting cricket further into chaos - The Guardian", "description": "With cricket in turmoil the tournament’s architects have unwisely opted against shifting to a more pragmatic course", "url": "https://www.theguardian.com/sport/2020/apr/26/ecb-sticking-with-the-hundred-risks-twisting-cricket-further-into-chaos", "urlToImage": null, "publishedAt": "2020-04-26T07:00:00Z", "content": "A little window of opportunity for the England and Wales Cricket Board has been rapidly slammed shut. Everything is up for grabs; the sheets of paper in front of those in charge of our summer game have never been blanker. On Friday the ECB said there would be… [+4561 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "World Rugby must not be afraid to act and lead - here's my 10-point plan to save the sport - Telegraph.co.uk", "description": "The imminent appointment of World Rugby's chairman has highlighted, in the current climate, the very real opportunities for appraisal and change in the global game.", "url": "https://www.telegraph.co.uk/rugby-union/2020/04/26/world-rugby-must-not-afraid-act-lead-10-point-plan-save-sport/", "urlToImage": null, "publishedAt": "2020-04-26T07:00:00Z", "content": "The imminent appointment of World Rugby's chairman has highlighted, in the current climate, the very real opportunities for appraisal and change in the global game.\r\nA pivotal moment in many respects. I really hope the coming weeks and months will see all inv… [+1459 chars]"}, {"source": {"id": null, "name": "Leeds-live.co.uk"}, "author": "Ibrahim Mustapha", "title": "Leeds United get unlikely promotion backing as new club badge remains under wraps - Leeds Live", "description": "All your latest Leeds United news and views round-up from Leeds Live", "url": "https://www.leeds-live.co.uk/sport/leeds-united/leeds-united-news-robbie-savage-18151652", "urlToImage": null, "publishedAt": "2020-04-26T06:00:00Z", "content": "Here is your Leeds United morning digest for Sunday, April 26.\r\nWhites players in WhatsApp group chat banter\r\nLeeds players appear to be keeping themselves entertained during the current football hiatus through the players Whatsapp group chat. \r\nDespite being… [+2467 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Adam Jones", "title": "Romelu Lukaku, Carlo Ancelotti and Everton's most exciting ever transfers - Liverpool Echo", "description": "We asked Everton fans what is the most excited they have ever been for a Blues signing and the results make for interesting reading", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/romelu-lukaku-carlo-ancelotti-evertons-18151281", "urlToImage": null, "publishedAt": "2020-04-26T04:12:20Z", "content": "The arrival of a new signing can work wonders for a side.\r\nEverton fans in the past have seen transfers be able to add quality to the squad in much-needed areas of the pitch - with countless going on to be heroes at Goodison Park.\r\nBut, who caused the most fu… [+5301 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Ex-Chelsea striker Diego Costa reignites feud with 'suspicious' Antonio Conte - Mirror Online", "description": "Costa blames Conte for his exit from Stamford Bridge, and says the Inter Milan boss wouldn't last one season at a club like Real Madrid", "url": "https://www.mirror.co.uk/sport/football/news/ex-chelsea-striker-diego-costa-21927801", "urlToImage": null, "publishedAt": "2020-04-26T02:05:22Z", "content": "Former Chelsea star Diego Costa has reignited his feud with 'suspicious' Antonio Conte - saying the Inter Milan boss wouldn't last one season at Real Madrid. \r\n Conte and Costa won the Premier League title together at Chelsea, but the two had several run-ins … [+1779 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Who is the greatest British manager? - BBC Sport", "description": "BBC Sport's chief football writer has made a shortlist of the greatest post-war British managers, now it's turn to vote for the best.", "url": "https://www.bbc.co.uk/sport/football/52371056", "urlToImage": null, "publishedAt": "2020-04-26T01:32:45Z", "content": "Who do you think is Britain's greatest manager of the post-war era\r\nIt's one of those debates that is very difficult to win. Just who is Britain's greatest post-war manager?\r\nFrom a World Cup win, to European successes, to lifting domestic titles, there are a… [+17447 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By James Sharpe For The Mail On Sunday", "title": "Bundesliga bosses outline their blueprint for football's return on May 9 - Daily Mail", "description": "A document from the German football federation has mapped out how the game can return safely, how players will train and play matches as well as what happens if someone contracts Covid-19.", "url": "https://www.dailymail.co.uk/sport/football/article-8257259/Bundesliga-bosses-outline-blueprint-footballs-return-9.html", "urlToImage": null, "publishedAt": "2020-04-25T22:57:58Z", "content": "Football could be coming back. Fans and players in England will be holding their breath as Germanys Bundesliga aims to restart on May 9.\r\nA document released by the German FA and the DFL has mapped out how the game can return safely amid the coronavirus crisi… [+5975 chars]"}, {"source": {"id": "talksport", "name": "TalkSport"}, "author": "Sean Gallagher", "title": "Eddie Hearn claims he REJECTED chance to sign Tyson Fury in 2017 because he thought ‘Gypsy King’ would never r - talkSPORT.com", "description": "", "url": "http://talksport.com/sport/boxing/699050/hearn-rejected-chance-sign-fury-2017-overweight/", "urlToImage": null, "publishedAt": "2020-04-25T21:29:52Z", "content": "Matchroom chief Eddie Hearn has claimed he turned down the chance to sign Tyson Fury back in 2017 because he was so overweight.\r\nBoth Hearn and Fury were in attendance for Derek Chisora’s showdown with Agit Kabayel – with the former losing to the European hea… [+2386 chars]"}, {"source": {"id": null, "name": "Justarsenal.com"}, "author": "Admin Martin", "title": "Did Chelsea just teach Arsenal how to deal with the players during a pandemic? - Just Arsenal News", "description": "While Arsenal has struggled to enforce a 12.5% pay cut on their top stars, Chelsea has just told their players to forget about contributing to the club and instead make contributions personally to the coronavirus pandemic.", "url": "https://www.justarsenal.com/did-chelsea-just-teach-arsenal-how-to-deal-with-the-players-during-a-pandemic/242915", "urlToImage": null, "publishedAt": "2020-04-25T21:00:24Z", "content": "While Arsenal has struggled to enforce a 12.5% pay cut on their top stars, Chelsea has just told their players to forget about contributing to the club and instead make contributions personally to the coronavirus pandemic.\r\nArsenal has recently announced that… [+2282 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Report: Barcelona make Coutinho transfer decision that could impact Tottenham - The Spurs Web", "description": "Tottenham Hotspur's chances of landing Philippe Coutinho have just received a huge blow as the latest reports from Spain indicate that Barcelona have U-turned on their original plans to sell the star. Spurs have been linked with a move for Coutinho since it e…", "url": "https://www.spurs-web.com/spurs-news/report-barcelona-make-coutinho-transfer-decision-that-could-impact-tottenham/", "urlToImage": null, "publishedAt": "2020-04-25T21:00:00Z", "content": "Tottenham Hotspurs chances of landing Philippe Coutinho have just received a huge blow as the latest reports from Spain indicate that Barcelona have U-turned on their original plans to sell the star.\r\nSpurs have been linked with a move for Coutinho since it e… [+928 chars]"}, {"source": {"id": null, "name": "Edp24.co.uk"}, "author": "Emma Lee", "title": "When is London Marathon 2020 taking place now? | Norfolk and Suffolk Lifestyle News - Eastern Daily Press", "description": "On Sunday, April 26, for thousands of runners months of training, pounding the pavements in all weathers, was supposed to culminate in the London Marathon. With the event postponed until October, we meet some of the Norfolk runners who were due to take part.", "url": "https://www.edp24.co.uk/features/norfolk-runners-on-london-marathon-postponement-1-6622394", "urlToImage": null, "publishedAt": "2020-04-25T18:00:00Z", "content": "PUBLISHED: 19:00 25 April 2020\r\nEmma Lee\r\nJack Stuttle, Lenne Borwright and Chloe Tovell who were due to run the London Marathon this weekend.\r\nArchant\r\nOn Sunday, April 26, for thousands of runners months of training, pounding the pavements in all weathers, … [+20974 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "Seb Jenkins", "title": "Report: Tottenham 'ramp up bid' to sign 21-year-old Premier League playmaker - The Spurs Web", "description": "Football Insider have now reported that Tottenham Hotspur are ramping up their bid to sign Norwich City playmaker, Todd Cantwell, this summer. The 21-year-old attacker caught the eye in his first Premier League season this year as he recorded six goals across…", "url": "https://www.spurs-web.com/spurs-news/report-tottenham-ramp-up-bid-to-sign-21-year-old-premier-league-playmaker/", "urlToImage": null, "publishedAt": "2020-04-25T17:43:13Z", "content": "Football Insider have now reported that Tottenham Hotspur are ramping up their bid to sign Norwich City playmaker, Todd Cantwell, this summer.\r\nThe 21-year-old attacker caught the eye in his first Premier League season this year as he recorded six goals acros… [+790 chars]"}, {"source": {"id": null, "name": "Sportwitness.co.uk"}, "author": "Sean Lunt", "title": "Defender reveals leaving Rangers 'high and dry' to sign for West Ham - Calls Hammers a 'godsend' during injury layoff - Sport Witness", "description": "Former West Ham defender Julien Faubert has revealed he walked out of a meeting with Rangers to sign for the Hammers. Faubert joined West Ham in an £8.24m deal from Girondins Bordeaux in August 2007 as the Hammers looked to add a new full-back to their squad.…", "url": "https://sportwitness.co.uk/defender-reveals-leaving-rangers-high-dry-sign-west-ham-calls-hammers-godsend-injury-layoff/", "urlToImage": null, "publishedAt": "2020-04-25T17:05:33Z", "content": "Former West Ham defender Julien Faubert has revealed he walked out of a meeting with Rangers to sign for the Hammers.\r\nFaubert joined West Ham in an £8.24m deal from Girondins Bordeaux in August 2007 as the Hammers looked to add a new full-back to their squad… [+1688 chars]"}, {"source": {"id": null, "name": "Paddypower.com"}, "author": "Rob Catterson", "title": "Horse racing tips: 5 who'll thrive in the din at Sha Tin on Sunday - Paddy Power News", "description": "In case you hadn't already heard, it's Champions Day.", "url": "https://news.paddypower.com/horse-racing/2020/04/25/horse-racing-tips-champions-day-sha-tin/", "urlToImage": null, "publishedAt": "2020-04-25T14:40:47Z", "content": "The first of the Group 1 action is the Chairmans Sprint Prize, where eight of the 11 runners contested the Group 2 Sprint Cup three weeks ago over C&amp;D. On that occasion, Voyage Warrior was a surprise winner but there was nothing fluky about his performanc… [+3274 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Elliott Jackson", "title": "Dimitar Berbatov sends transfer warning to Newcastle with Man City comparison - Manchester Evening News", "description": "The former Manchester United striker has had his say on Newcastle's potential takeover.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/berbatov-newcastle-manchester-city-takeover-18147091", "urlToImage": null, "publishedAt": "2020-04-25T14:36:51Z", "content": "Dimitar Berbatov has insisted it will take time for Newcastle United to attract top players to the club.\r\nNewcastle are in talks over a potential Saudi Arabia-backed takeover. Manchester City, of course, were subject to a takeover of their own in 2008 which d… [+1174 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Dani Ceballos shares Zinedine Zidane message on future amid Arsenal transfer talk - Mirror Online", "description": "Arsenal are believed to be keen on signing Real Madrid midfielder permanently following loan spell, but Ceballos has revealed Zidane conversation which could decide his future", "url": "https://www.mirror.co.uk/sport/football/transfer-news/dani-ceballos-shares-zinedine-zidane-21924432", "urlToImage": null, "publishedAt": "2020-04-25T12:57:55Z", "content": "Dani Ceballos has shared a message from Zinedine Zidane about his Real Madrid future amid speculation Arsenal will bid to sign him permanently. \r\nCeballos has spent the season on loan with the Gunners from Madrid, and Arsenal are believed to be keen on signin… [+1801 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Coronavirus: EFL warns 'suitable testing' must be in place before football returns - Sky Sports", "description": "The English Football League (EFL) has warned that football cannot resume before adequate testing arrangements are in place for coronavirus.", "url": "https://www.skysports.com/football/news/11095/11978675/coronavirus-efl-warns-suitable-testing-must-be-in-place-before-football-returns", "urlToImage": null, "publishedAt": "2020-04-25T12:55:49Z", "content": "The English Football League (EFL) has warned that football cannot resume before adequate testing arrangements are in place for coronavirus.\r\nIt follows reports that the Premier League has stepped up planning for a return behind closed doors as early as June.\r… [+1282 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Chelsea: No wage cuts for first team as players asked to support charities instead - Sky Sports", "description": "Chelsea say first-team players will not be taking wage cuts following discussions amid the coronavirus crisis but have been asked to support charities instead.", "url": "https://www.skysports.com/football/news/11668/11978660/chelsea-no-wage-cuts-for-first-team-as-players-asked-to-support-charities-instead", "urlToImage": null, "publishedAt": "2020-04-25T12:21:15Z", "content": "Chelsea say first-team players \"will not be contributing towards the club financially\" following discussions amid the coronavirus crisis, but have been asked to support charities instead. \r\nEarlier this month, Sky Sports News reported that Chelsea's players w… [+3443 chars]"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Daniel Marland", "title": "Cristiano Ronaldo Rejoining Man Utd This Summer ‘Would Not Be A Surprise’ - SPORTbible", "description": "This would be one of the biggest transfer stories of all time.", "url": "https://www.sportbible.com/football/football-news-transfers-ronaldo-rejoining-man-utd-this-summer-would-not-be-a-surprise-20200425", "urlToImage": null, "publishedAt": "2020-04-25T12:07:11Z", "content": "Manchester United completing the shock re-signing of Cristiano Ronaldo this summer 'would not be a surprise' according says to a top European club chief.\r\nThe 35-year-old has been linked with a move away from current club Juventus due to their current financi… [+2326 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Report: Spurs could suffer major financial blow after UEFA decision - The Spurs Web", "description": "Tottenham Hotspur could be set to suffer a major financial blow in revenue generated from European football if the season is decided on a points-per-game basis, the Evening Standard report. It was revealed on Thursday that UEFA were considering using a points…", "url": "https://www.spurs-web.com/spurs-news/report-spurs-could-suffer-major-financial-blow-after-uefa-decision/", "urlToImage": null, "publishedAt": "2020-04-25T11:00:00Z", "content": "Tottenham Hotspur could be set to suffer a major financial blow in revenue generated from European football if the season is decided on a points-per-game basis, the Evening Standard report.\r\nIt was revealed on Thursday that UEFA were considering using a point… [+1358 chars]"}]}