{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Alex Dicken", "title": "Manchester United hand Birmingham City a huge Jude Bellingham boost - Birmingham Live", "description": "Birmingham City transfer news - MUFC CEO Ed Woodward has been speaking ahead of the transfer window", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/manchester-united-hand-birmingham-city-18151782", "urlToImage": null, "publishedAt": "2020-04-26T06:44:56Z", "content": "Manchester United could struggle to pull off the signing of Jude Bellingham in the next transfer window.\r\nUnited are desperate to sign Birmingham City teenager Bellingham and gave the midfielder a tour of Carrington recently in a bid to impress him and his fa… [+901 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Alex Dicken", "title": "Aston Villa linked with shock change as Man United send Jack Grealish update - Birmingham Live", "description": "Aston Villa news - A round-up of AVFC headlines from BirminghamLive and elsewhere", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/aston-villa-linked-shock-change-18151831", "urlToImage": null, "publishedAt": "2020-04-26T06:09:40Z", "content": "Shock Dyche link\r\nAston Villa have been linked with a shock interest in Burnley manager Sean Dyche. \r\nLike the rest of the Premier League, Villa are currently on lockdown and waiting to learn when their season will resume. \r\nDean Smith and his players have a … [+5293 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Liverpool boss Jurgen Klopp 'calls Kylian Mbappe's dad' in bid to win transfer race - Mirror Online", "description": "PSG star Mbappe has long been linked with a move to either Real Madrid or Liverpool, and Klopp has reportedly made a move as he tries to gain the upper hand over rivals", "url": "https://www.mirror.co.uk/sport/football/transfer-news/liverpool-boss-jurgen-klopp-calls-21927940", "urlToImage": null, "publishedAt": "2020-04-26T05:51:26Z", "content": "Liverpool boss Jurgen Klopp has reportedly called Kylian Mbappe's father in a bid to convince the PSG star to move to Anfield.\r\nMbappe is one of the world's most sought-after players, and has long been linked to Real Madrid in a move that some have suggested … [+2028 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "James Robson", "title": "Five Manchester United academy stars who could save the club millions in transfer fees - Evening Standard", "description": "", "url": "https://www.standard.co.uk/sport/football/manchester-united-academy-five-stars-who-could-save-transfer-millions-a4423626.html", "urlToImage": null, "publishedAt": "2020-04-26T05:28:41Z", "content": "Manchester United had big plans for the next transfer window, though the coronavirus shutdown has thrown the season into flux.\r\nWith huge numbers of clubs now facing an uncertain financial future, the transfer market will feel the repercussions of Covid-19 fo… [+8624 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Charities fundraiser to begin on London Marathon day - BBC News", "description": "Thousands of runners would have been taking part in the London Marathon but it has been postponed.", "url": "https://www.bbc.co.uk/news/uk-wales-52415890", "urlToImage": null, "publishedAt": "2020-04-26T05:20:37Z", "content": "Image copyrightKerrie AldridgeImage caption\r\n Kerrie Aldridge, who is taking part in the 2.6 Challenge, with her son Osian\r\nA fundraising challenge to help charities losing out on cash that would have been raised through cancelled sporting events has begun. \r… [+2877 chars]"}, {"source": {"id": null, "name": "Newcastletoons.com"}, "author": "Durim Halimi", "title": "The misconception several pundits have about Newcastle’s takeover - Newcastle Toons", "description": "Several pundits have expressed their opinions regarding the takeover of Newcastle United, but most of them share a common misconception. The takeover of Ne...", "url": "https://newcastletoons.com/2020/04/26/misconception-many-pundits-have-newcastles-takeover/", "urlToImage": null, "publishedAt": "2020-04-26T05:20:33Z", "content": "The takeover of Newcastle United has generated excitement, anxiety and frustration among a wide range of fans, pundits, and various groups and organizations. The Toon Army is rightfully excited about this takeover.\r\nSome pundits are also excited about the clu… [+2947 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Liverpool superstar steps out of Mohamed Salah shadow to become best player in best team in the world - Liverpool Echo", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMia2h0dHBzOi8vd3d3LmxpdmVycG9vbGVjaG8uY28udWsvc3BvcnQvZm9vdGJhbGwvZm9vdGJhbGwtbmV3cy9saXZlcnBvb2wtc3VwZXJzdGFyLXN0ZXBzLW91dC1tb2hhbWVkLTE4MTUxMTgy0gFvaHR0cHM6Ly93d3cubGl2ZXJwb29sZWNoby5jby51ay9zcG9ydC9mb290YmFsbC9mb290YmFsbC1uZXdzL2xpdmVycG9vbC1zdXBlcnN0YXItc3RlcHMtb3V0LW1vaGFtZWQtMTgxNTExODIuYW1w?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T05:11:39Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Alex Richards", "title": "Diogo Jota crowned Premier League's best FIFA 20 player after five-day charity tournament - Mirror Online", "description": "The tournament, spread across five days, led to Wolves' Portuguese forward Diogo Jota meeting Liverpool's Trent Alexander-Arnold in the final of the ePremier League Invitational", "url": "https://www.mirror.co.uk/sport/football/news/breaking-premier-leagues-best-fifa-21926048", "urlToImage": null, "publishedAt": "2020-04-26T03:33:13Z", "content": "It was football, but not quite as we know it, as Wolves striker Diogo Jota was crowned the Premier League's best FIFA 20 player after claiming victory in the ePremier League invitational charity tournament.\r\nAfter a five-day tournament, he claimed a golden go… [+2465 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Arsenal 'pull out' of Pierre-Emerick Aubameyang contract talks despite dad's hint - Mirror Online", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiXmh0dHBzOi8vd3d3Lm1pcnJvci5jby51ay9zcG9ydC9mb290YmFsbC90cmFuc2Zlci1uZXdzL2Fyc2VuYWwtcHVsbC1vdXQtcGllcnJlLWVtZXJpY2stMjE5Mjc3ODXSAWJodHRwczovL3d3dy5taXJyb3IuY28udWsvc3BvcnQvZm9vdGJhbGwvdHJhbnNmZXItbmV3cy9hcnNlbmFsLXB1bGwtb3V0LXBpZXJyZS1lbWVyaWNrLTIxOTI3Nzg1LmFtcA?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T03:10:21Z", "content": null}, {"source": {"id": null, "name": "Theguardian.comsport"}, "author": "Guardian sport", "title": "Patriots' new kicker Rohrwasser denies tattoo represents rightwing militia - The Guardian", "description": "The post-Tom Brady era is off to a shaky start at the New England Patriots after a controversy surrounding their new kicker", "url": "https://amp.theguardian.comsport/2020/apr/25/justin-rohrwasser-new-england-patriots-kicker-tattoo-three-percenters-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-26T02:32:49Z", "content": "The post-Tom Brady era is off to a shaky start at the New England Patriots after a controversy surrounding their new kicker.\r\nAs part of the Patriots rebuild they selected Marshall kicker Justin Rohrwasser in the fifth round of this weeks draft. However, it s… [+1753 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Ex-Chelsea striker Diego Costa reignites feud with 'suspicious' Antonio Conte - Mirror Online", "description": "Costa blames Conte for his exit from Stamford Bridge, and says the Inter Milan boss wouldn't last one season at a club like Real Madrid", "url": "https://www.mirror.co.uk/sport/football/news/ex-chelsea-striker-diego-costa-21927801", "urlToImage": null, "publishedAt": "2020-04-26T02:05:22Z", "content": "Former Chelsea star Diego Costa has reignited his feud with 'suspicious' Antonio Conte - saying the Inter Milan boss wouldn't last one season at Real Madrid. \r\n Conte and Costa won the Premier League title together at Chelsea, but the two had several run-ins … [+1779 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Paul Gorst", "title": "Unpaid wages and baffling criticism - how Loris Karius Besiktas loan from Liverpool became a nightmare - Liverpool Echo", "description": "Loris Karius' loan move was meant to herald a fresh start, but it hasn't quite worked out like that, writes Paul Gorst", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/unpaid-wages-baffling-criticism-how-18150220", "urlToImage": null, "publishedAt": "2020-04-26T00:02:14Z", "content": "It was supposed to be a fresh start for Loris Karius.\r\nWhen the Liverpool goalkeeper traded Merseyside for Turkey in August 2018, the loan deal the Reds struck with Besiktas was meant to be one that breathed fresh life into a career that was flatlining.\r\nJust… [+5349 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Elliott Jackson", "title": "Liverpool legend Steven Gerrard compares Jordan Henderson to Paul Scholes - Liverpool Echo", "description": "The Liverpool captain is in the running to win the PFA Player of the Year award this season", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/gerrard-makes-henderson-scholes-comparison-18150146", "urlToImage": null, "publishedAt": "2020-04-26T00:02:09Z", "content": "Steven Gerrard has claimed that Liverpool captain Jordan Henderson is now running matches in the same fashion as former Manchester United midfielder Paul Scholes.\r\nHenderson has had a fantastic season for the Reds who sit top of the Premier League table by 25… [+1556 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Luke Gardener", "title": "Man Utd make Pogba swap transfer decision, Aubameyang to Chelsea, Mourinho agrees deal - Express", "description": "The transfer window is fast approaching with Premier League sides such as Manchester United, Chelsea, Arsenal and Liverpool all looking to strengthen. Express Sport brings you updates throughout the day.", "url": "https://www.express.co.uk/sport/football/1273851/Transfer-news-LIVE-Man-Utd-Pogba-swap-Spurs-agree-Aubameyang-Chelsea-latest-updates-gossip", "urlToImage": null, "publishedAt": "2020-04-25T23:16:09Z", "content": null}, {"source": {"id": null, "name": "Theguardian.comfootball"}, "author": "Guardian staff reporter", "title": "Everton 'appalled' after Moise Kean hosts coronavirus lockdown party - The Guardian", "description": "Everton have labelled Moise Kean’s actions ‘unacceptable’ after he flouted coronavirus lockdown restrictions", "url": "https://amp.theguardian.comfootball/2020/apr/26/everton-appalled-moise-kean-hosts-coronavirus-lockdown-party", "urlToImage": null, "publishedAt": "2020-04-25T23:14:54Z", "content": "Everton have labelled Moise Keans actions unacceptable after he flouted coronavirus lockdown restrictions.\r\nThe striker filmed himself partying at home with guests in a breach of social distancing regulations during the coronavirus pandemic. Kean, who joined … [+1170 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Tom Leach", "title": "Chelsea get Jadon Sancho boost as Liverpool eye Dries Mertens - Premier League transfer rumours - Football.London", "description": "Here are the latest Premier League rumours as football awaits news of a Premier League return", "url": "https://www.football.london/premier-league/chelsea-jadon-sancho-boost-liverpool-18151779", "urlToImage": null, "publishedAt": "2020-04-25T22:11:07Z", "content": "The Premier League may be on hold for now with plans to spark a return said to be ramping up.\r\nThat is the big rumour in the media this weekend, with a government meeting said to be on the cards.\r\nBut there is still plenty of transfer talk filling the inside … [+2958 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Michael Gannon", "title": "Roy MacGregor tells Rangers to 'put up or shut up' as Ross County chief demands to see alleged evidence - Daily Record", "description": "The Ross County chairman is fed up of the \"tedious\" stand off between Rangers and the SPFL.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/roy-macgregor-tells-rangers-put-21926481", "urlToImage": null, "publishedAt": "2020-04-25T22:10:12Z", "content": "Roy MacGregor has told Rangers to put up or shut up in their crusade against the SPFL.\r\nThe Ibrox club has stepped up their demands for an independent inquiry in to the voting process behind the decision to call the lower leagues with a view to drawing a line… [+2535 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Sean Ingle", "title": "Olympic hopeful Eleanor Davis puts Tokyo ambition on hold to save lives - The Guardian", "description": "Eleanor Davis intended to spend Sunday running the London Marathon but the Olympic hopeful will instead be on a Covid-19 ward helping patients", "url": "https://www.theguardian.com/sport/2020/apr/25/olympic-athletics-hopeful-eleanor-davis-puts-tokyo-ambition-on-hold-to-save-lives", "urlToImage": null, "publishedAt": "2020-04-25T21:30:00Z", "content": "Eleanor Davis had intended to spend Sunday on a 42,000-step journey towards Team GBs squad for the 2020 Olympics. Instead, at 8.55am, when the London Marathon elite womens race was due to start, Davis will be on a Covid-19 ward saving lives. Its gutting that … [+4724 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Report: Barcelona make Coutinho transfer decision that could impact Tottenham - The Spurs Web", "description": "Tottenham Hotspur's chances of landing Philippe Coutinho have just received a huge blow as the latest reports from Spain indicate that Barcelona have U-turned on their original plans to sell the star. Spurs have been linked with a move for Coutinho since it e…", "url": "https://www.spurs-web.com/spurs-news/report-barcelona-make-coutinho-transfer-decision-that-could-impact-tottenham/", "urlToImage": null, "publishedAt": "2020-04-25T21:00:00Z", "content": "Tottenham Hotspurs chances of landing Philippe Coutinho have just received a huge blow as the latest reports from Spain indicate that Barcelona have U-turned on their original plans to sell the star.\r\nSpurs have been linked with a move for Coutinho since it e… [+928 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Andrew Beasley", "title": "Chelsea's cause for concern in Champions League race with Man United when Premier League returns - Football.London", "description": "Frank Lampard's side are three points ahead of Manchester United in fourth place, with nine games of the 2019/20 Premier League season remaining", "url": "https://www.football.london/chelsea-fc/news/chelseas-cause-concern-champions-league-18118068", "urlToImage": null, "publishedAt": "2020-04-25T20:53:07Z", "content": "With football on hold, fans are waiting to see how the 2019/20 Premier League season will end. \r\nThe clubs are committed to completing the season properly if they can, so if football is given the all clear to resume then focus will swiftly switch to the remai… [+3373 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Ex-Spurs striker reveals what Newcastle must do to convince Pochettino to join - The Spurs Web", "description": "Former Tottenham striker, Dimitar Berbatov, believes that Newcastle United need to convince Mauricio Pochettino that they are ready to spend big on top players in order to get the former Spurs boss to join. A £300 million takeover of Newcastle United is said …", "url": "https://www.spurs-web.com/spurs-news/ex-spurs-striker-reveals-what-newcastle-must-do-to-convince-pochettino-to-join/", "urlToImage": null, "publishedAt": "2020-04-25T20:41:49Z", "content": "Former Tottenham striker, Dimitar Berbatov, believes that Newcastle United need to convince Mauricio Pochettino that they are ready to spend big on top players in order to get the former Spurs boss to join.\r\nA £300 million takeover of Newcastle United is said… [+2624 chars]"}, {"source": {"id": null, "name": "Eadt.co.uk"}, "author": "Andy Warren", "title": "Coronavirus: League One and League Two could be decided by promotion tournament | Ipswich Town FC and Suffolk & Essex Sport - East Anglian Daily Times", "description": "Promotion from both League One and League Two could be decided by mini tournaments involving eight teams, according to reports.", "url": "https://www.eadt.co.uk/sport/league-one-and-two-promotion-tournament-1-6624349", "urlToImage": null, "publishedAt": "2020-04-25T20:17:00Z", "content": "PUBLISHED: 21:17 25 April 2020 | UPDATED: 21:41 25 April 2020\r\nAndy Warren\r\nIpswich Town slipped from 1st to 10th in the League One table under Paul Lambert at the start of 2020. Photo: Pagepix\r\nPagepix Ltd 07976 935738\r\nPromotion from both League One and Lea… [+4435 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Luke Gardener", "title": "Tottenham boss Jose Mourinho convinces PSG ace to make transfer but has Daniel Levy issue - Express", "description": "Tottenham boss Jose Mourinho has convinced Paris Saint-Germain full-back Thomas Meunier to join the club in the summer transfer window.", "url": "https://www.express.co.uk/sport/football/1273871/Tottenham-news-Jose-Mourinho-PSG-transfer-Daniel-Levy-issue-Thomas-Meunier-latest-gossip", "urlToImage": null, "publishedAt": "2020-04-25T20:08:00Z", "content": "“As ever, our priority is the success of the team, but we need visibility of the impact across the whole industry, including timings of the transfer window, and the wider financial picture, before we can talk about a return to normality.\r\n“On this basis, I ca… [+501 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Mark Douglas", "title": "'Everyone hopes for it': Jetro Willems sends a transfer message to Newcastle United - Chronicle Live", "description": "Newcastle United loanee Jetro Willems says he absolutely wants to return to the club where he enjoyed a decent temporary spell", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/everyone-hopes-it-jetro-willems-18150981", "urlToImage": null, "publishedAt": "2020-04-25T19:50:04Z", "content": "Jetro Willems has re-stated his number one priority is to sign and play for Newcastle United in an impromptu Twitter question and answer session.\r\nThe popular wing-back had made a fine impression at St James Park before a serious injury suffered at the turn o… [+1177 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Eight players you forgot were in Being: Liverpool - Liverpool Echo", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMicGh0dHBzOi8vd3d3LmxpdmVycG9vbGVjaG8uY28udWsvc3BvcnQvZm9vdGJhbGwvZm9vdGJhbGwtbmV3cy90cmFuc2Zlci1taXN0YWtlcy1zdXJwcmlzZS1qYW1pZS1jYXJyYWdoZXItMTgxMjgwNzTSAXRodHRwczovL3d3dy5saXZlcnBvb2xlY2hvLmNvLnVrL3Nwb3J0L2Zvb3RiYWxsL2Zvb3RiYWxsLW5ld3MvdHJhbnNmZXItbWlzdGFrZXMtc3VycHJpc2UtamFtaWUtY2FycmFnaGVyLTE4MTI4MDc0LmFtcA?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T19:21:55Z", "content": null}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Arsenal players will be allowed back to club's training ground next week - Metro.co.uk", "description": "This is a very positive sign.", "url": "https://metro.co.uk/2020/04/25/arsenal-players-will-allowed-back-clubs-training-ground-next-week-12610468/", "urlToImage": null, "publishedAt": "2020-04-25T18:42:12Z", "content": "Arsenals players will be allowed back to the clubs London Colney training ground from next week (Picture: Getty)\r\nArsenals players will be allowed to return to train at London Colney from next week while Aston Villas squad have agreed a 25 per cent wage defer… [+2524 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "Jofra Archer reveals he has lost his Cricket World Cup winner's medal - The Guardian", "description": "England paceman Jofra Archer revealed he has ‘gone mad’ searching for his World Cup winner’s medal after losing it during a recent house move", "url": "https://www.theguardian.com/sport/2020/apr/25/jofra-archer-reveals-he-has-lost-his-england-cricket-world-cup-winners-medal", "urlToImage": null, "publishedAt": "2020-04-25T18:41:53Z", "content": "England pace bowler Jofra Archer revealed he has gone mad searching for his Cricket World Cup winners medal after losing it during a recent house move. Archer rose from relative obscurity to become a household name at last years tournament, finishing as Engla… [+1949 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Joseph Chapman", "title": "Robert Earnshaw makes startling West Brom admission about that day at Charlton - Birmingham Live", "description": "Earnshaw was considering his future and after being informed by Bryan Robson that he’d been left out of the starting XI once again in London that day, it was a mindset that only intensified", "url": "https://www.birminghammail.co.uk/sport/football/football-news/robert-earnshaw-makes-startling-west-18150125", "urlToImage": null, "publishedAt": "2020-04-25T18:39:56Z", "content": "West Broms Great Escape hero Robert Earnshaw has revealed that he was actually thinking about leaving the club on the same day that he bagged an unforgettable hat-trick at Charlton Athletic.\r\n The former Albion striker was competing for a place in the startin… [+4514 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "FULL GAME: WEST HAM V EVERTON | 21 SEPTEMBER 2013 - Everton Football Club", "description": "Subscribe to Everton Football Club's official YouTube Channel: http://bit.ly/2wtCEbB Follow us on Facebook: http://facebook.com/everton Follow us on Twitter:...", "url": "https://www.youtube.com/watch?v=7U1emuqMqzE", "urlToImage": null, "publishedAt": "2020-04-25T18:00:14Z", "content": null}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "Petec21", "title": "Raheem Sterling: There’s Only One Shirt I Want - Bitter and Blue", "description": "City Winger Wants Barca Legend Shirt", "url": "https://bitterandblue.sbnation.com/2020/4/25/21236328/raheem-sterling-theres-only-one-shirt-i-want", "urlToImage": null, "publishedAt": "2020-04-25T17:48:16Z", "content": "Manchester City winger Raheem Sterling has revealed the one shirt he wants to obtain from his playing days for his collections. Despite gathering a collection of medals, trophies and players shirts, Sterling has said the one he really wants is a shirt off the… [+1452 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "Seb Jenkins", "title": "Report: Tottenham 'ramp up bid' to sign 21-year-old Premier League playmaker - The Spurs Web", "description": "Football Insider have now reported that Tottenham Hotspur are ramping up their bid to sign Norwich City playmaker, Todd Cantwell, this summer. The 21-year-old attacker caught the eye in his first Premier League season this year as he recorded six goals across…", "url": "https://www.spurs-web.com/spurs-news/report-tottenham-ramp-up-bid-to-sign-21-year-old-premier-league-playmaker/", "urlToImage": null, "publishedAt": "2020-04-25T17:43:13Z", "content": "Football Insider have now reported that Tottenham Hotspur are ramping up their bid to sign Norwich City playmaker, Todd Cantwell, this summer.\r\nThe 21-year-old attacker caught the eye in his first Premier League season this year as he recorded six goals acros… [+790 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Reece Chambers", "title": "Man City evening headlines as Sadio Mane verdict explained and Celtic transfer suggestion made - Manchester Evening News", "description": "All the latest Manchester City news, views and transfer rumours from the MEN", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-city-mane-de-bruyne-18150755", "urlToImage": null, "publishedAt": "2020-04-25T17:25:12Z", "content": "Here are your Manchester City evening headlines on Saturday, April 25.\r\nDe Bruyne explains Mane verdict\r\nManchester City midfielder Kevin De Bruyne said Liverpools Sadio Mane would have earned his vote if the PFA Player of the Year award had taken place as or… [+2410 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Mikael McKenzie", "title": "Roy Keane opens up on the two Man Utd team-mates he did not get on with - Express.co.uk", "description": "Roy Keane has named two former Manchester United team-mates he could not warm too.", "url": "https://www.express.co.uk/sport/football/1273852/Roy-Keane-Man-Utd-news", "urlToImage": null, "publishedAt": "2020-04-25T17:16:00Z", "content": "Ex-Manchester United captain Roy Keane has revealed he did not get on with Wayne Rooney or Rio Ferdinand during his latter years at the club - both of which went on to become legends at Old Trafford.Keane won seven Premier League titles and the 1999 Champions… [+1373 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Richard Fay", "title": "Manchester United news and transfers LIVE Fred and Mejbri latest as fans react to Di Maria rumours - Manchester Evening News", "description": "Follow for all the latest Man Utd transfer rumours, injury latest and breaking news throughout the day.", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/man-utd-news-transfers-live-18151300", "urlToImage": null, "publishedAt": "2020-04-25T17:10:00Z", "content": "Louis van Gaal was only half right about why Angel Di Maria failed at Manchester United\r\n“Di Maria had a problem with the English football culture and the climate. You cannot buy players and know, for sure, that they can deliver. You cannot know because footb… [+912 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "ePL Invitational: Diogo Jota crowned FIFA king after golden goal victory over Trent Alexander-Arnold - Sky Sports", "description": "Diogo Jota is the inaugural ePremier League Invitational champion after a golden goal win over Liverpool's Trent Alexander-Arnold.", "url": "https://www.skysports.com/football/news/11095/11978772/epl-invitational-diogo-jota-crowned-fifa-king-after-golden-goal-victory-over-trent-alexander-arnold", "urlToImage": null, "publishedAt": "2020-04-25T17:09:07Z", "content": "Diogo Jota is the inaugural ePremier League Invitational champion after a golden goal win over Liverpool's Trent Alexander-Arnold.\r\nFresh from beating Raheem Sterling with a golden goal himself in the semi-finals, Alexander-Arnold took the lead in the final w… [+728 chars]"}, {"source": {"id": null, "name": "Racingpost.com"}, "author": "David Carr", "title": "Racing's return: what we know so far about how and when the sport will resume - Racing Post", "description": "There has been no racing in Britain since the behind-closed-doors meetings at Taunton and Wetherby on March 17, as the BHA called a halt until the end of April", "url": "https://www.racingpost.com/news/racings-return-what-we-know-so-far-about-how-and-when-the-sport-will-resume/432394", "urlToImage": null, "publishedAt": "2020-04-25T16:46:05Z", "content": "By David Carr \r\n UPDATED 5:46PM, APR 25 2020\r\nThere has been no racing in Britain since the behind-closed-doors meetings at Taunton and Wetherby on March 17, as the BHA called a halt to protect essential emergency services and the health and welfare of staff … [+4907 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Ian Doyle", "title": "Bobby Duncan, major setbacks and what happened next for Liverpool FA Youth Cup winners - Liverpool Echo", "description": "Exactly one year has passed since Liverpool lifted the FA Youth Cup against Manchester City", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/pep-lijnders-impressed-breakout-star-18143544", "urlToImage": null, "publishedAt": "2020-04-25T16:43:34Z", "content": "Champions League glory was more than a month away, but already Liverpool could celebrate claiming prestigious silverware.\r\nExactly a year has passed since the Reds claimed the FA Youth Cup for only the fourth time in their history.\r\nUnder the tutelage of coac… [+4773 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ashley Preece", "title": "Jack Grealish pokes fun at Birmingham City with blunt three-word message - Birmingham Live", "description": "Aston Villa on social media - Jack Grealish is Villa through and through and sarcastically had a dig at Birmingham City following a nostalgic video of James Milner's match-winning penalty 10 years ago", "url": "https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-jack-grealish-blues-18150166", "urlToImage": null, "publishedAt": "2020-04-25T16:40:16Z", "content": "Jack Grealish has claret and blue veins and, 10 years on from Aston Villa's 1-0 win over Blues, the skipper couldn't resist a pop at those across the Second City divide.\r\nJames Milner slammed home a controversial penalty in the 83rd minute after Gabby Agbonla… [+1059 chars]"}, {"source": {"id": null, "name": "Leeds-live.co.uk"}, "author": "Beren Cross", "title": "Robbie Savage's passionate defence of Leeds United's Premier League claim - Leeds Live", "description": "FIFA, UEFA, The FA, Premier League and EFL may yet consider voiding 2019/20", "url": "https://www.leeds-live.co.uk/sport/leeds-united/robbie-savage-leeds-united-promotion-18150697", "urlToImage": null, "publishedAt": "2020-04-25T14:49:00Z", "content": "Outspoken pundit Robbie Savage has leapt to Leeds Uniteds defence in light of speculation the current season may yet be scrubbed entirely from history.\r\nOf the various options open to footballs authorities while coronavirus has the world on lockdown, voiding … [+2146 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Elliott Jackson", "title": "Dimitar Berbatov sends transfer warning to Newcastle with Man City comparison - Manchester Evening News", "description": "The former Manchester United striker has had his say on Newcastle's potential takeover.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/berbatov-newcastle-manchester-city-takeover-18147091", "urlToImage": null, "publishedAt": "2020-04-25T14:36:51Z", "content": "Dimitar Berbatov has insisted it will take time for Newcastle United to attract top players to the club.\r\nNewcastle are in talks over a potential Saudi Arabia-backed takeover. Manchester City, of course, were subject to a takeover of their own in 2008 which d… [+1174 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Elliott Jackson", "title": "What Jurgen Klopp said to Liverpool before historic Barcelona comeback - Liverpool Echo", "description": "The Reds beat Barcelona 4-0 to reach the Champions League final", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/klopp-liverpool-talk-barcelona-comeback-18148913", "urlToImage": null, "publishedAt": "2020-04-25T14:08:58Z", "content": "James Milner has revealed what Jurgen Klopp said to his players in training before their unforgettable comeback against Barcelona in the Champions League. \r\nThe Reds remarkably beat the Spanish giants 4-0 at Anfield in the second leg of their Championship Lea… [+1744 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Liverpool 'eye Joaquin Correa transfer' in search for Sadio Mane backup - Mirror Online", "description": "The Reds need quality reserves for their fearsome first-choice frontline and have identified Lazio forward as potential transfer target, according to reports from Italy", "url": "https://www.mirror.co.uk/sport/football/transfer-news/liverpool-eye-joaquin-correa-transfer-21924641", "urlToImage": null, "publishedAt": "2020-04-25T14:06:03Z", "content": "Liverpool have earmarked Lazio forward Joaquin Correa as a potential transfer target, according to reports from Italy.\r\n The Argentina international is regarded as one of the most exciting talents in Serie A on his day, and could be available for as little as… [+1891 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Marcus Banks", "title": "Manchester United fans cannot believe new Angel Di Maria transfer rumour - Manchester Evening News", "description": "Angel Di Maria signed for United in 2014 but left in 2015 to join Paris Saint-Germain.", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/pogba-di-maria-man-utd-18149406", "urlToImage": null, "publishedAt": "2020-04-25T13:42:51Z", "content": "Speculation over the future of Manchester United midfielder Paul Pogba refuses to die down. \r\nThe World Cup winner continues to be heavily linked with an exit, with Real Madrid, Juventus and Paris Saint-Germain believed to be interested in acquiring his servi… [+1452 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Liverpool vs Atletico Madrid under investigation following coronavirus outbreak - Mirror Online", "description": "Liverpool's Champions League exit to Atletico Madrid is one of the last games to be played amid the coronavirus pandemic and has come in for plenty of criticism", "url": "https://www.mirror.co.uk/sport/football/news/liverpool-vs-atletico-madrid-under-21925450", "urlToImage": null, "publishedAt": "2020-04-25T13:32:00Z", "content": "Liverpool's Champions League match with Atletico Madrid is under investigation regarding its impact on the spread of coronavirus. \r\nThe last 16 clash took place on March 11 - the same day the World Health Organisation declared Covid-19 a global pandemic.\r\nSpa… [+1670 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Dani Ceballos shares Zinedine Zidane message on future amid Arsenal transfer talk - Mirror Online", "description": "Arsenal are believed to be keen on signing Real Madrid midfielder permanently following loan spell, but Ceballos has revealed Zidane conversation which could decide his future", "url": "https://www.mirror.co.uk/sport/football/transfer-news/dani-ceballos-shares-zinedine-zidane-21924432", "urlToImage": null, "publishedAt": "2020-04-25T12:57:55Z", "content": "Dani Ceballos has shared a message from Zinedine Zidane about his Real Madrid future amid speculation Arsenal will bid to sign him permanently. \r\nCeballos has spent the season on loan with the Gunners from Madrid, and Arsenal are believed to be keen on signin… [+1801 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Sean Dyche explains why he had to apologise to Arsene Wenger after Arsenal clash - Mirror Online", "description": "Burnley manager said he gave former Gunners boss Wenger a 'rubbish' claret following a game at Turf Moor, as he opened up on his own taste in wine", "url": "https://www.mirror.co.uk/sport/football/news/sean-dyche-explains-apologise-arsene-21924463", "urlToImage": null, "publishedAt": "2020-04-25T12:57:52Z", "content": "Burnley manager Sean Dyche has revealed he had to apologise to former Arsenal boss Arsene Wenger - for giving him a \"rubbish\" red wine after a game. \r\nDyche, who admits he is \"certainly not an aficionado\" of fine wines, says all rival managers are offered the… [+2225 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Jon Doel", "title": "Wales on brink of stunning world rugby and ditching Bill Beaumont amid late drama - reports - Wales Online", "description": "The race to become World Rugby chairman may be about to take a huge twist", "url": "https://www.walesonline.co.uk/sport/rugby/rugby-news/wales-brink-stunning-world-rugby-18149672", "urlToImage": null, "publishedAt": "2020-04-25T12:15:32Z", "content": "Wales could be the country to blow apart Bill Beaumont's hopes of winning the race to remain World Rugby chairman, according to reports.\r\nBeaumont has widely been expected to receive the backing of all Six Nations countries in his battle with Agustin Pichot, … [+1060 chars]"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Daniel Marland", "title": "Cristiano Ronaldo Rejoining Man Utd This Summer ‘Would Not Be A Surprise’ - SPORTbible", "description": "This would be one of the biggest transfer stories of all time.", "url": "https://www.sportbible.com/football/football-news-transfers-ronaldo-rejoining-man-utd-this-summer-would-not-be-a-surprise-20200425", "urlToImage": null, "publishedAt": "2020-04-25T12:07:11Z", "content": "Manchester United completing the shock re-signing of Cristiano Ronaldo this summer 'would not be a surprise' according says to a top European club chief.\r\nThe 35-year-old has been linked with a move away from current club Juventus due to their current financi… [+2326 chars]"}, {"source": {"id": "talksport", "name": "TalkSport"}, "author": "Joe Coleman", "title": "David Haye considering incredible boxing comeback to fight the winner of Tyson Fury vs Anthony Joshua - talkSPORT.com", "description": "", "url": "http://talksport.com/sport/boxing/698874/haye-boxing-comeback-news-fight-tyson-fury-joshua/", "urlToImage": null, "publishedAt": "2020-04-25T11:56:55Z", "content": "David Haye has admitted he would only consider a return to boxing if he was guaranteed to fight the winner of Anthony Joshua vs Tyson Fury.\r\nHowever, the Bermondsey-born slugger admitted it was unlikely the call would ever come and says he was content with st… [+2425 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Report: Spurs could suffer major financial blow after UEFA decision - The Spurs Web", "description": "Tottenham Hotspur could be set to suffer a major financial blow in revenue generated from European football if the season is decided on a points-per-game basis, the Evening Standard report. It was revealed on Thursday that UEFA were considering using a points…", "url": "https://www.spurs-web.com/spurs-news/report-spurs-could-suffer-major-financial-blow-after-uefa-decision/", "urlToImage": null, "publishedAt": "2020-04-25T11:00:00Z", "content": "Tottenham Hotspur could be set to suffer a major financial blow in revenue generated from European football if the season is decided on a points-per-game basis, the Evening Standard report.\r\nIt was revealed on Thursday that UEFA were considering using a point… [+1358 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Mike Phelan explains Manchester United formation changes - Manchester Evening News", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiaWh0dHBzOi8vd3d3Lm1hbmNoZXN0ZXJldmVuaW5nbmV3cy5jby51ay9zcG9ydC9mb290YmFsbC9mb290YmFsbC1uZXdzL3BoZWxhbi1tYW4tdXRkLXRhY3RpY3MtbmV3cy0xODE0OTc0MtIBbWh0dHBzOi8vd3d3Lm1hbmNoZXN0ZXJldmVuaW5nbmV3cy5jby51ay9zcG9ydC9mb290YmFsbC9mb290YmFsbC1uZXdzL3BoZWxhbi1tYW4tdXRkLXRhY3RpY3MtbmV3cy0xODE0OTc0Mi5hbXA?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T10:55:14Z", "content": null}, {"source": {"id": "talksport", "name": "TalkSport"}, "author": "Joe Coleman", "title": "Mike Tyson in training ahead of sensational return to boxing – but Anthony Joshua and Tyson Fury do not need t - talkSPORT.com", "description": "", "url": "http://talksport.com/sport/boxing/698854/mike-tyson-training-return-boxing-anthony-joshua-tyson-fury/", "urlToImage": null, "publishedAt": "2020-04-25T10:26:10Z", "content": "Mike Tyson is currently training ahead of a sensational return to boxing later in 2020.However, the likes of Tyson Fury and Anthony Joshua can breathe a sigh of relief as the former undisputed heavyweight champion is only planning to compete in four-round cha… [+2050 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "UFC to stage three events in Florida in May - BBC News", "description": "UFC president Dan White announces UFC 249 for 9 May and two other events without fans next month.", "url": "https://www.bbc.co.uk/sport/mixed-martial-arts/52424303", "urlToImage": null, "publishedAt": "2020-04-25T10:17:54Z", "content": "Tony Ferguson will be in action at UFC 249 on 9 May at VyStar Veterans Memorial Arena in Jacksonville\r\nUFC president Dana White has announced plans for three events in Jacksonville, Florida, next month.\r\nThey will be closed to the public and \"produced with on… [+2003 chars]"}, {"source": {"id": null, "name": "Autosport.com"}, "author": "Pablo Elizalde", "title": "F1 News: Sainz Jr says losing 2020 season over coronavirus would be hard to accept - Autosport", "description": "McLaren driver Carlos Sainz Jr says the 2020 Formula 1 season being cancelled because of the coronavirus crisis would be a \"hard blow that would be difficult to accept\"", "url": "https://www.autosport.com/f1/news/149146/sainz-losing-20-f1-season-would-be-hard-to-accept", "urlToImage": null, "publishedAt": "2020-04-25T10:02:44Z", "content": "McLaren driver Carlos Sainz Jr says the 2020 Formula 1 season being cancelled because of the coronavirus crisis would be a \"hard blow that would be difficult to accept\". \r\nThe first nine races of the season have already been cancelled or postponed, with the F… [+2679 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "NFL Draft 2020: Teams set wide receiver record on Day Two - Sky Sports", "description": "Wide receivers flew off the board on a busy Day Two of the 2020 NFL Draft.", "url": "https://www.skysports.com/nfl/news/12118/11978575/nfl-draft-2020-teams-set-wide-receiver-record-on-day-two", "urlToImage": null, "publishedAt": "2020-04-25T09:58:40Z", "content": "Teams continued to dip into the 2020 NFL Draft's deep receiver class on Friday, with the Cincinnati Bengals kicking off the run at the top of Round Two by grabbing Clemson wideout Tee Higgins.\r\nAfter six wideouts went in Round One, Round Two began with two in… [+4635 chars]"}, {"source": {"id": null, "name": "Sportinglife.com"}, "author": null, "title": "FWD Champions Day: Sha Tin tips for the three Group Ones - Sportinglife.com", "description": "Neil Morrice previews the three Group Ones on FWD Champions Day at Sha Tin on Sunday, featuring Beauty Generation in the Champions Mile.", "url": "https://www.sportinglife.com/racing/news/fwd-champions-day-sha-tin-tips/179422", "urlToImage": null, "publishedAt": "2020-04-25T09:57:18Z", "content": "Neil Morrice previews the three Group Ones on FWD Champions Day at Sha Tin on Sunday, featuring Beauty Generation in the Champions Mile.Hong Kong race fans are probably the most enthusiastic punters in the world, but as well as the massive betting handle that… [+4343 chars]"}, {"source": {"id": null, "name": "Justarsenal.com"}, "author": "Admin Pat", "title": "The Dutch FA cancel the League (without naming a Champion) and expect more to follow - Just Arsenal News", "description": "Just Arsenal News, Transfer Rumours And Discussion about all matters relating to Arsenal Football Club", "url": "https://www.justarsenal.com/the-dutch-fa-cancel-the-league-without-naming-a-champion-and-expect-more-to-follow/242859", "urlToImage": null, "publishedAt": "2020-04-25T09:54:17Z", "content": "The Dutch FA has become the second European League to cancel the remaining games, but with the new guidelines from UEFA, they have decide not to name any club as Champions.\r\nBelgium announced Bruges as Champions but they were only one game from the end of the… [+2326 chars]"}, {"source": {"id": null, "name": "Leicestermercury.co.uk"}, "author": "Richard Cusack", "title": "Manchester United transfer chief makes worrying claim amid Leicester City links - Leicestershire Live", "description": "Leicester City transfer news: Man United have been heavily linked with a move for the King Power Stadium playmaker but coronavirus could scupper their summer plans", "url": "https://www.leicestermercury.co.uk/sport/football/transfer-news/james-maddison-man-united-transfer-4078285", "urlToImage": null, "publishedAt": "2020-04-25T08:59:00Z", "content": "Manchester United have been heavily linked with a move for Leicester City playmaker James Maddison - but the coronavirus pandemic is set to drastically affect the transfer market this summer.\r\nMaddison has long been a target for Ole Gunnar Solskjaer, who is s… [+1937 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "When Yuvraj smashed Broad for six sixes in a row - BBC News", "description": "Relive the moment when Yuvraj Singh became the first player in Twenty20 history to hit six sixes in an over.", "url": "https://www.bbc.co.uk/sport/av/cricket/52397653", "urlToImage": null, "publishedAt": "2020-04-25T07:57:37Z", "content": null}, {"source": {"id": null, "name": "Tbrfootball.com"}, "author": "Giuseppe Labellarte", "title": "Report: Rangers in talks with 6ft 4in prodigy over new contract, but English club is lurking - TBR - The Boot Room - Football News", "description": "Glasgow Rangers prodigy Robby McCrorie, who came through the ranks at Ibrox, has been linked away from Steven Gerrard’s side with a move south of the border, according to the Daily Record. The 22-year-old Gers ace is believed to be on the radar of English Pre…", "url": "https://tbrfootball.com/report-rangers-in-talks-with-6ft-4in-prodigy-over-new-contract-but-english-club-is-lurking/", "urlToImage": null, "publishedAt": "2020-04-25T07:54:05Z", "content": "Glasgow Rangers prodigy Robby McCrorie, who came through the ranks at Ibrox, has been linked away from Steven Gerrards side with a move south of the border, according to the Daily Record.\r\nThe 22-year-old Gers ace is believed to be on the radar of English Pre… [+1305 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "NFL Draft: Tee Higgins joins Joe Burrow at Cincinnati Bengals - Sky Sports", "description": "The Cincinnati Bengals followed up their first-round pick of Joe Burrow by selecting Tee Higgins, who has declared the duo are \"about to tear it up\".", "url": "https://www.skysports.com/nfl/news/12118/11978531/nfl-draft-tee-higgins-joins-joe-burrow-at-cincinnati-bengals", "urlToImage": null, "publishedAt": "2020-04-25T07:29:15Z", "content": "The Cincinnati Bengals followed up their first-round pick of quarterback Joe Burrow by selecting wide receiver Tee Higgins, who has declared the duo are \"about to tear it up\" in the NFL.\r\nThe Bengals picked Clemson's Higgins - who grew up supporting the side … [+1441 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Guardian sport", "title": "Philadelphia Eagles surprise with Jalen Hurts pick on day two of NFL draft - The Guardian", "description": "The Eagles selected Oklahoma quarterback Jalen Hurts in the second round of the NFL draft on Friday, a stunning move for a team with more pressing needs", "url": "https://www.theguardian.com/sport/2020/apr/25/nfl-draft-picks-day-two-jalen-hurts", "urlToImage": null, "publishedAt": "2020-04-25T04:20:00Z", "content": "After giving Carson Wentz a playmaker, the Philadelphia Eagles drafted his backup.\r\nThe Eagles selected Oklahoma quarterback Jalen Hurts in the second round of the NFL draft on Friday night, a stunning move for a team with more pressing needs.\r\nPhiladelphia h… [+10012 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Guardian sport", "title": "West Indies say Test tour of England has been postponed due to Covid-19 - The Guardian", "description": "The three-Test series between England and West Indies in June has been postponed due to the coronavirus outbreak", "url": "https://www.theguardian.com/sport/2020/apr/24/west-indies-test-tour-england-postponed-covid-19-cricket", "urlToImage": null, "publishedAt": "2020-04-24T23:20:55Z", "content": "The three-Test series between England and West Indies in June has been postponed due to the coronavirus outbreak, Cricket West Indies (CWI) said on Friday.\r\nWest Indies had been scheduled to play on 4-8 June at The Oval, 12-16 June at Edgbaston and 25-29 June… [+1600 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Alex Raskin Sports News Editor For Dailymail.com Associated Press", "title": "Video shows Bucs rookie and Tom Brady's newest blocker Tristan Wirfs jumping out of pool - Daily Mail", "description": "Tampa Bay Buccaneers first-round pick Tristan Wirfs weighs well over 300 pounds, but the offensive tackle and Tom Brady's newest blocker is still athletic enough to jump out of a pool onto his feet.", "url": "https://www.dailymail.co.uk/news/article-8254551/Video-shows-Bucs-rookie-Tom-Bradys-newest-blocker-Tristan-Wirfs-jumping-pool.html", "urlToImage": null, "publishedAt": "2020-04-24T20:51:27Z", "content": "The Buccaneers drafted Tristan Wirfs to address an opening at right tackle \r\nTampa Bay Buccaneers first-round pick Tristan Wirfs weighs well over 300 pounds, but the offensive tackle and Tom Brady's newest blocker is still athletic enough to launch himself ou… [+3438 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Is Jamie Carragher RIGHT?! Fernando Torres' flabbergasting move from Liverpool to Chelsea | ESPN FC - ESPN UK", "description": "Craig Burley and Julien Laurens join Dan Thomas on ESPN FC to react to recent comments made by former Liverpool defender Jamie Carragher and former Chelsea c...", "url": "https://www.youtube.com/watch?v=hoRBD5aVqVk", "urlToImage": null, "publishedAt": "2020-04-24T19:51:55Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Suzanne Wrack", "title": "Who could replace Phil Neville as England Women's manager? - The Guardian", "description": "We run the rule over leading candidates, including a two-times World Cup winner and a woman who worked as Neville’s No 2", "url": "https://www.theguardian.com/football/2020/apr/24/who-could-replace-phil-neville-as-england-womens-manager", "urlToImage": null, "publishedAt": "2020-04-24T18:00:00Z", "content": "The Football Associations hunt for a successor to Mark Sampson in 2017 quickly became a circus. Names flew out of the ring as fast as they stepped in. Increased scrutiny on the person in charge, with the game professionalising, led some of those on the shortl… [+4734 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Matthew Southcombe", "title": "Marler won't miss a game despite long ban for grabbing Alun Wyn Jones' genitals - Wales Online", "description": "The England prop was banned for 10 weeks after grabbing the Wales skipper's penis, but will be free to play as soon as rugby recommences", "url": "https://www.walesonline.co.uk/sport/rugby/rugby-news/joe-marler-wont-miss-game-18148172", "urlToImage": null, "publishedAt": "2020-04-24T17:41:14Z", "content": "England prop Joe Marler will not miss a single game of rugby despite grabbing Alun Wyn Jones' genitals in a Six Nations match last month, according to reports. \r\nMarler received a 10-week ban after he was found guilty of 'grabbing, twisting or squeezing' the … [+1782 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Green Bay Packers' Aaron Rodgers within rights to be annoyed by Jordan Love pick, says Neil Reynolds - Sky Sports", "description": "Neil Reynolds and Jeff Reinebold analyse the Green Bay Packers' shock selection of Utah State quarterback Jordan Love.", "url": "https://www.skysports.com/nfl/news/12118/11978237/green-bay-packers-aaron-rodgers-within-rights-to-be-annoyed-by-jordan-love-pick-says-neil-reynolds", "urlToImage": null, "publishedAt": "2020-04-24T17:15:29Z", "content": "Aaron Rodgers is the same age as Brett Favre was when he was selected as his eventual successor by the Green Bay Packers with the No 24 pick at the 2005 NFL Draft.\r\nThat nugget became relevant with pick No 26 on day one of the 2020 Draft as the Packers produc… [+2899 chars]"}, {"source": {"id": null, "name": "Gazettelive.co.uk"}, "author": "Dominic Shaw", "title": "Middlesbrough's relegation rivals Luton Town sack manager Graeme Jones in shock move - Gazette Live", "description": "The Hatters had only lost one of their last six games before the coronavirus pandemic stopped play in the Championship", "url": "https://www.gazettelive.co.uk/sport/football/football-news/middlesbroughs-relegation-rivals-luton-town-18147205", "urlToImage": null, "publishedAt": "2020-04-24T15:47:43Z", "content": "Middlesbrough's relegation rivals Luton Town have parted company with manager Graeme Jones, in a shock move.\r\nWith football currently on hold, the Hatters say they have made the decision to restructure and reduce costs.\r\nWhen the Championship was halted, Luto… [+2206 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "National League board to discuss next steps after ending season - BBC News", "description": "The National League board will meet on Friday to discuss the next steps after the decision to end their regulation season.", "url": "https://www.bbc.co.uk/sport/football/52409558", "urlToImage": null, "publishedAt": "2020-04-24T14:44:29Z", "content": "Barrow are top of the National League table, four points above second-placed Harrogate\r\nThe National League board will meet on Friday to discuss the next steps after deciding to end their regulation season earlier this week.\r\nIn addition to discussing whether… [+761 chars]"}]}