{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ben Husband", "title": "'Look at what Klopp has done' - Man United sent clear Aston Villa transfer warning - Birmingham Live", "description": "Aston Villa news - Manchester United have been extensively linked with the AVFC skipper, but Ince believes Liverpool or Man City could swoop", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/manchester-united-transfers-grealish-villa-18151905", "urlToImage": null, "publishedAt": "2020-04-26T08:43:53Z", "content": "Manchester United have been warned that Jack Grealish could go to Liverpool or Man City and they should focus instead on a defensive midfielder.\r\n Ole Gunnar Solskjaer has been extensively linked with a move for the Aston Villa captain, with claims he has at … [+1981 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ashley Preece", "title": "EFL issue statement as West Brom hero pokes fun at Wolves - Birmingham Live", "description": "West Bromwich Albion daily digest - Here's a round-up of the latest Albion stories via BirminghamLive, including goal-hero Robert Earnshaw reliving The Great Escape", "url": "https://www.birminghammail.co.uk/sport/football/football-news/efl-issue-statement-west-brom-18151514", "urlToImage": null, "publishedAt": "2020-04-26T08:43:33Z", "content": "Reidy\r\nSteven Reid is still fondly remembered within the ranks of the West Bromwich Albion fanbase.\r\nThe versatile Irishman, who played at right-back and in defensive midfield during his four year stay at The Hawthorns returned to aid Jimmy Shan in a coaching… [+6844 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Kinnersley For Mailonline", "title": "Diego Costa reopens feud with 'suspicious' former Chelsea boss Antonio Conte - Daily Mail", "description": "The pair fell out at Stamford Bridge which resulted in the now Atletico Madrid forward being tossed out of the club. Costa went AWOL just months after Chelsea won the league title in 2017.", "url": "https://www.dailymail.co.uk/sport/football/article-8258047/Diego-Costa-reopens-feud-suspicious-former-Chelsea-boss-Antonio-Conte.html", "urlToImage": null, "publishedAt": "2020-04-26T08:41:07Z", "content": "Diego Costa has yet again taken another swipe at his former Chelsea manager Antonio Conte.\r\nThe pair fell out at Stamford Bridge after they won the Premier League in 2017, with Conte famously text messaging him to suggest he wanted the Spain striker to leave.… [+2978 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ben Husband", "title": "'Let's face it' - Aston Villa fans divided over massive Dean Smith claim - Birmingham Live", "description": "Aston Villa news - Claims in the national press have emerged, suggesting Sean Dyche could be lined up as a replacement for Dean Smith", "url": "https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-news-sean-dyche-18151896", "urlToImage": null, "publishedAt": "2020-04-26T08:31:25Z", "content": "Aston Villa fans have been having their say on claims that Sean Dyche could be lined up as a shock replacement for Dean Smith.\r\n The Villa boss had come under scrutiny prior to the season being suspended, losing five games on the spin before football in the U… [+2563 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Leeds United could sign another Wolves star if they’re promoted - reports - Birmingham Live", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiZ2h0dHBzOi8vd3d3LmJpcm1pbmdoYW1tYWlsLmNvLnVrL3Nwb3J0L2Zvb3RiYWxsL3RyYW5zZmVyLW5ld3MvbGVlZHMtdW5pdGVkLXRyYW5zZmVyLWpvaG4tcnVkZHktMTgxNTE0MDfSAWtodHRwczovL3d3dy5iaXJtaW5naGFtbWFpbC5jby51ay9zcG9ydC9mb290YmFsbC90cmFuc2Zlci1uZXdzL2xlZWRzLXVuaXRlZC10cmFuc2Zlci1qb2huLXJ1ZGR5LTE4MTUxNDA3LmFtcA?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T08:31:03Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Jon Boon", "title": "Mike Tyson’s three wives including one he caught having sex with Brad Pitt, one who is a doctor and ex-con s - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/11472016/mike-tyson-wives-brad-pitt-sex/", "urlToImage": null, "publishedAt": "2020-04-26T08:02:36Z", "content": "BOXING legend Mike Tyson is the most settled he's ever been.\r\nAnd that could be because of the influence of his new wife, Lakiha Spicer.\r\n Mike Tyson has married three different women in his lifetimeCredit: New York Daily News - Getty\r\nTyson's first wife Robi… [+5436 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Roy Keane", "title": "Roy Keane didn't get Wayne Rooney and Rio Ferdinand banter at Manchester United - Sky Sports", "description": "Roy Keane says he didn't have a lot in common with a number of his Manchester United team-mates towards the end of his career at Old Trafford.", "url": "https://www.skysports.com/football/news/11667/11978661/roy-keane-didnt-get-wayne-rooney-and-rio-ferdinand-banter-at-manchester-united", "urlToImage": null, "publishedAt": "2020-04-26T07:37:25Z", "content": "Roy Keane says he didn't have a lot in common with a number of his Manchester United team-mates towards the end of his career at Old Trafford, admitting he struggled to understand the banter of the likes of Wayne Rooney and Rio Ferdinand.\r\nKeane saw a number … [+5140 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Mark McDougall", "title": "Scottish football crisis LIVE as Rangers SPFL calls are slammed by chairman - Scottish Daily Record", "description": "All the latest from the world of Scottish football as clubs look to deal with the shutdown.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/scottish-football-crisis-live-rangers-21928048", "urlToImage": null, "publishedAt": "2020-04-26T07:35:58Z", "content": "MacGregor: Put up or shut up\r\nRoy MacGregor has told Rangers to put up or shut up in their crusade against the SPFL.\r\nThe Ibrox club has stepped up their demands for an independent inquiry in to the voting process behind the decision to call the lower leagues… [+1080 chars]"}, {"source": {"id": null, "name": "Shieldsgazette.com"}, "author": "Liam Kennedy", "title": "Anti-Saudi takeover Richard Keys has been talking about Newcastle United – AGAIN! - Shields Gazette", "description": "Newcastle United and their potential new Saudi Arabian majority shareholders seem to be living in banished former Sky Sports presenter Richard Keys’ head.", "url": "https://www.shieldsgazette.com/sport/football/newcastle-united/anti-saudi-takeover-richard-keys-has-been-talking-about-newcastle-united-again-2549850", "urlToImage": null, "publishedAt": "2020-04-26T07:03:41Z", "content": "Saudi Arabia's Crown Prince Mohammed bin Salman speaks to Russian President during the talks in Riyadh, Saudi Arabia, on October 14, 2019. (Photo by Alexander Zemlianichenko / POOL / AFP) (Photo by ALEXANDER ZEMLIANICHENKO/POOL/AFP via Getty Images) Copyright… [+771 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Alex Dicken", "title": "Manchester United hand Birmingham City a huge Jude Bellingham boost - Birmingham Live", "description": "Birmingham City transfer news - MUFC CEO Ed Woodward has been speaking ahead of the transfer window", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/manchester-united-hand-birmingham-city-18151782", "urlToImage": null, "publishedAt": "2020-04-26T06:44:56Z", "content": "Manchester United could struggle to pull off the signing of Jude Bellingham in the next transfer window.\r\nUnited are desperate to sign Birmingham City teenager Bellingham and gave the midfielder a tour of Carrington recently in a bid to impress him and his fa… [+901 chars]"}, {"source": {"id": null, "name": "Hitc.com"}, "author": "Shane Callaghan", "title": "‘Time to say goodbye’: Spurs fans want Mourinho to sell Comolli signing - HITC - Football, Gaming, Movies, TV, Music", "description": "Is Danny Rose on borrowed time at Tottenham Hotspur? Some fans reckon so.", "url": "https://www.hitc.com/en-gb/2020/04/26/time-to-say-goodbye-spurs-fans-want-mourinho-to-sell-comolli-sig/", "urlToImage": null, "publishedAt": "2020-04-26T06:38:28Z", "content": "Is Danny Rose on borrowed time at Tottenham Hotspur? Some fans reckon so.\r\nTottenham Hotspur fans on Twitter aren't expecting to see Danny Rose play for the club again.\r\nRose joined Newcastle United on a half-season loan in January after falling out of favour… [+1427 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Man Utd 'offered Old Trafford flop Angel Di Maria' in Paul Pogba transfer swap bid - Mirror Online", "description": "Pogba could leave Manchester United in a swap deal this summer, and PSG have reportedly offered Di Maria and Julian Draxler in exchange for the French World Cup winner", "url": "https://www.mirror.co.uk/sport/football/transfer-news/man-utd-offered-old-trafford-21927916", "urlToImage": null, "publishedAt": "2020-04-26T06:32:23Z", "content": "Manchester United flop Angel Di Maria has reportedly been offered back to the club by Paris-Saint Germain as the French club eye a shock swap deal for Paul Pogba.\r\nAccording to reports from France, PSG have offered winger Di Maria and midfielder Julian Draxle… [+1933 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "SunSport Reporters", "title": "7am Man Utd news LIVE: Sancho transfer put in doubt by Woodward, Pogba to PSG, Koulibaly boost, Ronaldo LATEST - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11431662/man-utd-news-live-sancho-fernandes-transfer-latest-koulibaly/", "urlToImage": null, "publishedAt": "2020-04-26T06:27:59Z", "content": "MORNING MAN UTD FANS,\r\nEd Woodward has warned that the clubs big-money summer transfer plans for the likes of Jadon Sancho, Jack Grealish and Kalidou Koulibaly could be in jeopardy because of the coronavirus pandemic.\r\nUnited are set to tie up a permanent mov… [+1067 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Theo Squires", "title": "Virgil van Dijk threatening to do what just one man has done before at Liverpool - Liverpool Echo", "description": "No defender has ever scored a hat-trick in Premier League history but today marks 34-years since a Liverpool centre-back achieved such a feat", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpools-unlikeliest-ever-hat-trick-18124296", "urlToImage": null, "publishedAt": "2020-04-26T06:10:45Z", "content": "It is a rare feat to score a hat-trick in football. \r\nFrom the current Liverpool squad, only four players have bagged trebles and it should come as no surprise to their identities.\r\nMohamed Salah (vs Bournemouth, December 2018, and a four-goal haul vs Watford… [+3709 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Tyrone Marshall", "title": "Man United midfield production line might be about to take off - Manchester Evening News", "description": "Man Utd have always been blessed with excellent midfielders and the current crop look like they could follow that tradition.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-utd-midfielders-next-generation-18150917", "urlToImage": null, "publishedAt": "2020-04-26T06:04:30Z", "content": "Manchester United's next crop of promising midfielders are certainly going to be in good hands when they reach the first-team squad.\r\nUnited have had some brilliant midfielders over the last three decades, but Michael Carrick might have been one of the most u… [+2928 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Everton 'appalled' by Moise Kean for 'unacceptable' partying during coronavirus lockdown - ITV News", "description": "Everton have labelled Moise Kean's actions \"unacceptable\" after he flouted coronavirus lockdown restrictions.\n\nThe striker filmed himself partying at home with guests in a breach of social distancing regulations during the coronavirus pandemic.\n\nKean, who joi…", "url": "https://www.itv.com/news/2020-04-26/coronavirus-everton-moise-kean-party-lockdown/", "urlToImage": null, "publishedAt": "2020-04-26T06:04:00Z", "content": "Everton have labelled Moise Kean's actions \"unacceptable\" after he flouted coronavirus lockdown restrictions.\r\nThe striker filmed himself partying at home with guests in a breach of social distancing regulations during the coronavirus pandemic.\r\nKean, who joi… [+1195 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Liverpool boss Jurgen Klopp 'calls Kylian Mbappe's dad' in bid to win transfer race - Mirror Online", "description": "PSG star Mbappe has long been linked with a move to either Real Madrid or Liverpool, and Klopp has reportedly made a move as he tries to gain the upper hand over rivals", "url": "https://www.mirror.co.uk/sport/football/transfer-news/liverpool-boss-jurgen-klopp-calls-21927940", "urlToImage": null, "publishedAt": "2020-04-26T05:51:26Z", "content": "Liverpool boss Jurgen Klopp has reportedly called Kylian Mbappe's father in a bid to convince the PSG star to move to Anfield.\r\nMbappe is one of the world's most sought-after players, and has long been linked to Real Madrid in a move that some have suggested … [+2028 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Charities fundraiser to begin on London Marathon day - BBC News", "description": "Thousands of runners would have been taking part in the London Marathon but it has been postponed.", "url": "https://www.bbc.co.uk/news/uk-wales-52415890", "urlToImage": null, "publishedAt": "2020-04-26T05:20:37Z", "content": "Image copyrightKerrie AldridgeImage caption\r\n Kerrie Aldridge, who is taking part in the 2.6 Challenge, with her son Osian\r\nA fundraising challenge to help charities losing out on cash that would have been raised through cancelled sporting events has begun. \r… [+2877 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Real Madrid eye 'dream' Neymar transfer after Barcelona told funding deal is 'impossible' - Mirror Online", "description": "Real Madrid supremo Florentino Perez still hopes of a dream move for Neymar despite Barcelona's interest in re-signing the forward", "url": "https://www.mirror.co.uk/sport/football/news/real-madrid-eye-dream-neymar-21926057", "urlToImage": null, "publishedAt": "2020-04-26T02:00:31Z", "content": "Real Madrid president Florentino Perez \"still dreams\" of signing PSG star Neymar after previously missing out on the Brazilian.\r\nLos Blancos chased Neymar back when he was at Santos before losing out to rivals Barcelona.\r\nBut the Parisians secured his signatu… [+1793 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Who is the greatest British manager? - BBC Sport", "description": "BBC Sport's chief football writer has made a shortlist of the greatest post-war British managers, now it's turn to vote for the best.", "url": "https://www.bbc.co.uk/sport/football/52371056", "urlToImage": null, "publishedAt": "2020-04-26T01:32:45Z", "content": "Who do you think is Britain's greatest manager of the post-war era\r\nIt's one of those debates that is very difficult to win. Just who is Britain's greatest post-war manager?\r\nFrom a World Cup win, to European successes, to lifting domestic titles, there are a… [+17447 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Leeds face nightmare scenario if Premier League follow Eredivisie and deny promotion gamble - Mirror Online", "description": "Leeds were poised to end their Premier League exile before the coronavirus pandemic hit and the Eredivisie's decision has cast doubt over their promotion", "url": "https://www.mirror.co.uk/sport/football/news/leeds-face-nightmare-scenario-premier-21925320", "urlToImage": null, "publishedAt": "2020-04-26T00:28:53Z", "content": "Leeds and West Brom will be waiting with bated breath after the Eredivisie became the first European league to blink in light of the coronavirus pandemic. \r\nThe Dutch authorities announced the end of the current campaign on Friday night claiming \"it has becom… [+5257 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Paul Gorst", "title": "Unpaid wages and baffling criticism - how Loris Karius Besiktas loan from Liverpool became a nightmare - Liverpool Echo", "description": "Loris Karius' loan move was meant to herald a fresh start, but it hasn't quite worked out like that, writes Paul Gorst", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/unpaid-wages-baffling-criticism-how-18150220", "urlToImage": null, "publishedAt": "2020-04-26T00:02:14Z", "content": "It was supposed to be a fresh start for Loris Karius.\r\nWhen the Liverpool goalkeeper traded Merseyside for Turkey in August 2018, the loan deal the Reds struck with Besiktas was meant to be one that breathed fresh life into a career that was flatlining.\r\nJust… [+5349 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Elliott Jackson", "title": "Liverpool legend Steven Gerrard compares Jordan Henderson to Paul Scholes - Liverpool Echo", "description": "The Liverpool captain is in the running to win the PFA Player of the Year award this season", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/gerrard-makes-henderson-scholes-comparison-18150146", "urlToImage": null, "publishedAt": "2020-04-26T00:02:09Z", "content": "Steven Gerrard has claimed that Liverpool captain Jordan Henderson is now running matches in the same fashion as former Manchester United midfielder Paul Scholes.\r\nHenderson has had a fantastic season for the Reds who sit top of the Premier League table by 25… [+1556 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Kieran Lynch For Mailonline", "title": "Eddie Hearn 'rejected chance to sign Tyson Fury because the Gypsy King was overweight' - Daily Mail", "description": "Eddie Hearn held talks with Tyson Fury about becoming his promoter before the Gypsy King's return to the ring. He turned down the chance as he felt Fury would not make his return.", "url": "https://www.dailymail.co.uk/sport/boxing/article-8257077/Eddie-Hearn-rejected-chance-sign-Tyson-Fury-Gypsy-King-overweight.html", "urlToImage": null, "publishedAt": "2020-04-25T23:11:07Z", "content": "Eddie Hearn has revealed his regret about not signing Tyson Fury in 2017, because of his weight issues at the time.\r\nThe Matchroom promoter held talks with the Gypsy King seven months before Fury made his return to the ring.\r\nAnd Hearn has revealed that Fury … [+2453 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Jonathan Northcroft", "title": "'Project Restart' in fight against time and social distancing - The Times", "description": "English football faces a June 1 deadline to get back to full training or finishing the 2019-20 season may become impossible.While the Premier League and Football League have moved closer to resuming", "url": "https://www.thetimes.co.uk/article/project-restart-in-fight-against-time-and-social-distancing-hl3dnd8md", "urlToImage": null, "publishedAt": "2020-04-25T23:01:00Z", "content": "English football faces a June 1 deadline to get back to full training or finishing the 2019-20 season may become impossible.\r\nWhile the Premier League and Football League have moved closer to resuming after a cross-sport group began working with the governmen… [+493 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Ryan Taylor", "title": "What Timo Werner said about Man Utd transfer two years ago now says more about Liverpool - Express", "description": "Timo Werner looks set to move to the Premier League in the future, but his stance on which club looks like it may have changed.", "url": "https://www.express.co.uk/sport/football/1273897/Liverpool-transfer-news-Timo-Werner-said-Man-Utd-move-comments-gossip", "urlToImage": null, "publishedAt": "2020-04-25T22:19:00Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Simon Mullock", "title": "Scott McTominay taking on lessons from Man Utd great Cristiano Ronaldo during lockdown - Mirror Online", "description": "The central midfielder has been staying in shape amid the coronavirus crisis and revealed he has been looking to one of the very best for tips", "url": "https://www.mirror.co.uk/sport/football/news/scott-mctominay-inspired-man-utd-21925823", "urlToImage": null, "publishedAt": "2020-04-25T21:57:29Z", "content": "Manchester United's Scott McTominay has been taking lessons from Cristiano Ronaldo on how to keep himself fit and focused during lockdown.\r\nThe Scottish midfielder reckons the former United No. 7 is the master when it comes to steering well clear of his comfo… [+1736 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Sean Ingle", "title": "Olympic hopeful Eleanor Davis puts Tokyo ambition on hold to save lives - The Guardian", "description": "Eleanor Davis intended to spend Sunday running the London Marathon but the Olympic hopeful will instead be on a Covid-19 ward helping patients", "url": "https://www.theguardian.com/sport/2020/apr/25/olympic-athletics-hopeful-eleanor-davis-puts-tokyo-ambition-on-hold-to-save-lives", "urlToImage": null, "publishedAt": "2020-04-25T21:30:00Z", "content": "Eleanor Davis had intended to spend Sunday on a 42,000-step journey towards Team GBs squad for the 2020 Olympics. Instead, at 8.55am, when the London Marathon elite womens race was due to start, Davis will be on a Covid-19 ward saving lives. Its gutting that … [+4724 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Report: Barcelona make Coutinho transfer decision that could impact Tottenham - The Spurs Web", "description": "Tottenham Hotspur's chances of landing Philippe Coutinho have just received a huge blow as the latest reports from Spain indicate that Barcelona have U-turned on their original plans to sell the star. Spurs have been linked with a move for Coutinho since it e…", "url": "https://www.spurs-web.com/spurs-news/report-barcelona-make-coutinho-transfer-decision-that-could-impact-tottenham/", "urlToImage": null, "publishedAt": "2020-04-25T21:00:00Z", "content": "Tottenham Hotspurs chances of landing Philippe Coutinho have just received a huge blow as the latest reports from Spain indicate that Barcelona have U-turned on their original plans to sell the star.\r\nSpurs have been linked with a move for Coutinho since it e… [+928 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Ex-Spurs striker reveals what Newcastle must do to convince Pochettino to join - The Spurs Web", "description": "Former Tottenham striker, Dimitar Berbatov, believes that Newcastle United need to convince Mauricio Pochettino that they are ready to spend big on top players in order to get the former Spurs boss to join. A £300 million takeover of Newcastle United is said …", "url": "https://www.spurs-web.com/spurs-news/ex-spurs-striker-reveals-what-newcastle-must-do-to-convince-pochettino-to-join/", "urlToImage": null, "publishedAt": "2020-04-25T20:41:49Z", "content": "Former Tottenham striker, Dimitar Berbatov, believes that Newcastle United need to convince Mauricio Pochettino that they are ready to spend big on top players in order to get the former Spurs boss to join.\r\nA £300 million takeover of Newcastle United is said… [+2624 chars]"}, {"source": {"id": null, "name": "Eadt.co.uk"}, "author": "Andy Warren", "title": "Coronavirus: League One and League Two could be decided by promotion tournament | Ipswich Town FC and Suffolk & Essex Sport - East Anglian Daily Times", "description": "Promotion from both League One and League Two could be decided by mini tournaments involving eight teams, according to reports.", "url": "https://www.eadt.co.uk/sport/league-one-and-two-promotion-tournament-1-6624349", "urlToImage": null, "publishedAt": "2020-04-25T20:17:00Z", "content": "PUBLISHED: 21:17 25 April 2020 | UPDATED: 21:41 25 April 2020\r\nAndy Warren\r\nIpswich Town slipped from 1st to 10th in the League One table under Paul Lambert at the start of 2020. Photo: Pagepix\r\nPagepix Ltd 07976 935738\r\nPromotion from both League One and Lea… [+4435 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Mark Douglas", "title": "'Everyone hopes for it': Jetro Willems sends a transfer message to Newcastle United - Chronicle Live", "description": "Newcastle United loanee Jetro Willems says he absolutely wants to return to the club where he enjoyed a decent temporary spell", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/everyone-hopes-it-jetro-willems-18150981", "urlToImage": null, "publishedAt": "2020-04-25T19:50:04Z", "content": "Jetro Willems has re-stated his number one priority is to sign and play for Newcastle United in an impromptu Twitter question and answer session.\r\nThe popular wing-back had made a fine impression at St James Park before a serious injury suffered at the turn o… [+1177 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Liam Bryce", "title": "Julien Faubert claims he used toilet break to escape Rangers transfer talks - Daily Record", "description": "The Frenchman almost joined Rangers in 2007 before a late swoop from the Hammers.", "url": "https://www.dailyrecord.co.uk/sport/football/football-transfer-news/julien-faubert-dramatic-rangers-snub-21926616", "urlToImage": null, "publishedAt": "2020-04-25T18:42:26Z", "content": "Julien Faubert has revisited his dramatic decision to walk out of Rangers transfer talks to join West Ham. \r\n The former Kilmarnock midfielder has previously revealed he turned his back on a move to Ibrox in 2007 after learning the Hammers and Ligue 1 side Bo… [+1604 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Arsenal players will be allowed back to club's training ground next week - Metro.co.uk", "description": "This is a very positive sign.", "url": "https://metro.co.uk/2020/04/25/arsenal-players-will-allowed-back-clubs-training-ground-next-week-12610468/", "urlToImage": null, "publishedAt": "2020-04-25T18:42:12Z", "content": "Arsenals players will be allowed back to the clubs London Colney training ground from next week (Picture: Getty)\r\nArsenals players will be allowed to return to train at London Colney from next week while Aston Villas squad have agreed a 25 per cent wage defer… [+2524 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "Jofra Archer reveals he has lost his Cricket World Cup winner's medal - The Guardian", "description": "England paceman Jofra Archer revealed he has ‘gone mad’ searching for his World Cup winner’s medal after losing it during a recent house move", "url": "https://www.theguardian.com/sport/2020/apr/25/jofra-archer-reveals-he-has-lost-his-england-cricket-world-cup-winners-medal", "urlToImage": null, "publishedAt": "2020-04-25T18:41:53Z", "content": "England pace bowler Jofra Archer revealed he has gone mad searching for his Cricket World Cup winners medal after losing it during a recent house move. Archer rose from relative obscurity to become a household name at last years tournament, finishing as Engla… [+1949 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Joseph Chapman", "title": "Robert Earnshaw makes startling West Brom admission about that day at Charlton - Birmingham Live", "description": "Earnshaw was considering his future and after being informed by Bryan Robson that he’d been left out of the starting XI once again in London that day, it was a mindset that only intensified", "url": "https://www.birminghammail.co.uk/sport/football/football-news/robert-earnshaw-makes-startling-west-18150125", "urlToImage": null, "publishedAt": "2020-04-25T18:39:56Z", "content": "West Broms Great Escape hero Robert Earnshaw has revealed that he was actually thinking about leaving the club on the same day that he bagged an unforgettable hat-trick at Charlton Athletic.\r\n The former Albion striker was competing for a place in the startin… [+4514 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Associated Press", "title": "NFL's remote draft concludes as 49ers acquire star tackle Trent Williams - The Guardian", "description": "The NFL draft entered its third and final day with Cincinnati selecting an Appalachian State linebacker on Saturday afternoon", "url": "https://www.theguardian.com/sport/2020/apr/25/nfl-draft-saturday-picks-day-three", "urlToImage": null, "publishedAt": "2020-04-25T18:34:00Z", "content": "Maybe the Southeastern Conference should simply hold onto its players and become part of the NFL.\r\nThe home of national champion LSU and perennial contenders Alabama, Georgia and Auburn, the SEC dominated the first four rounds of the NFL draft before the flow… [+5706 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Harry Shepherd", "title": "The Last Dance makes it hard to like the players at the heart of this documentary - TechRadar India", "description": "Opinion: MJ and the Chicago Bulls are tough to cheer for in this dramatic account of their 97/98 NBA season", "url": "https://www.techradar.com/news/the-last-dance-makes-it-hard-to-like-the-players-at-the-heart-of-the-documentary", "urlToImage": null, "publishedAt": "2020-04-25T18:29:00Z", "content": "Sports documentaries, for the most part, need to do two things: be accessible to you even if you know nothing about the discipline, and give you someone to root for. You cant beat an underdog story like Sunderland Til I Die, but the drama is bound up in your … [+5267 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "FULL GAME: WEST HAM V EVERTON | 21 SEPTEMBER 2013 - Everton Football Club", "description": "Subscribe to Everton Football Club's official YouTube Channel: http://bit.ly/2wtCEbB Follow us on Facebook: http://facebook.com/everton Follow us on Twitter:...", "url": "https://www.youtube.com/watch?v=7U1emuqMqzE", "urlToImage": null, "publishedAt": "2020-04-25T18:00:14Z", "content": null}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "Petec21", "title": "Raheem Sterling: There’s Only One Shirt I Want - Bitter and Blue", "description": "City Winger Wants Barca Legend Shirt", "url": "https://bitterandblue.sbnation.com/2020/4/25/21236328/raheem-sterling-theres-only-one-shirt-i-want", "urlToImage": null, "publishedAt": "2020-04-25T17:48:16Z", "content": "Manchester City winger Raheem Sterling has revealed the one shirt he wants to obtain from his playing days for his collections. Despite gathering a collection of medals, trophies and players shirts, Sterling has said the one he really wants is a shirt off the… [+1452 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "Seb Jenkins", "title": "Report: Tottenham 'ramp up bid' to sign 21-year-old Premier League playmaker - The Spurs Web", "description": "Football Insider have now reported that Tottenham Hotspur are ramping up their bid to sign Norwich City playmaker, Todd Cantwell, this summer. The 21-year-old attacker caught the eye in his first Premier League season this year as he recorded six goals across…", "url": "https://www.spurs-web.com/spurs-news/report-tottenham-ramp-up-bid-to-sign-21-year-old-premier-league-playmaker/", "urlToImage": null, "publishedAt": "2020-04-25T17:43:13Z", "content": "Football Insider have now reported that Tottenham Hotspur are ramping up their bid to sign Norwich City playmaker, Todd Cantwell, this summer.\r\nThe 21-year-old attacker caught the eye in his first Premier League season this year as he recorded six goals acros… [+790 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "ePL Invitational: Diogo Jota crowned FIFA king after golden goal victory over Trent Alexander-Arnold - Sky Sports", "description": "Diogo Jota is the inaugural ePremier League Invitational champion after a golden goal win over Liverpool's Trent Alexander-Arnold.", "url": "https://www.skysports.com/football/news/11095/11978772/epl-invitational-diogo-jota-crowned-fifa-king-after-golden-goal-victory-over-trent-alexander-arnold", "urlToImage": null, "publishedAt": "2020-04-25T17:09:07Z", "content": "Diogo Jota is the inaugural ePremier League Invitational champion after a golden goal win over Liverpool's Trent Alexander-Arnold.\r\nFresh from beating Raheem Sterling with a golden goal himself in the semi-finals, Alexander-Arnold took the lead in the final w… [+728 chars]"}, {"source": {"id": null, "name": "Racingpost.com"}, "author": "David Carr", "title": "Racing's return: what we know so far about how and when the sport will resume - Racing Post", "description": "There has been no racing in Britain since the behind-closed-doors meetings at Taunton and Wetherby on March 17, as the BHA called a halt until the end of April", "url": "https://www.racingpost.com/news/racings-return-what-we-know-so-far-about-how-and-when-the-sport-will-resume/432394", "urlToImage": null, "publishedAt": "2020-04-25T16:46:05Z", "content": "By David Carr \r\n UPDATED 5:46PM, APR 25 2020\r\nThere has been no racing in Britain since the behind-closed-doors meetings at Taunton and Wetherby on March 17, as the BHA called a halt to protect essential emergency services and the health and welfare of staff … [+4907 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ashley Preece", "title": "Jack Grealish pokes fun at Birmingham City with blunt three-word message - Birmingham Live", "description": "Aston Villa on social media - Jack Grealish is Villa through and through and sarcastically had a dig at Birmingham City following a nostalgic video of James Milner's match-winning penalty 10 years ago", "url": "https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-jack-grealish-blues-18150166", "urlToImage": null, "publishedAt": "2020-04-25T16:40:16Z", "content": "Jack Grealish has claret and blue veins and, 10 years on from Aston Villa's 1-0 win over Blues, the skipper couldn't resist a pop at those across the Second City divide.\r\nJames Milner slammed home a controversial penalty in the 83rd minute after Gabby Agbonla… [+1059 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Marcus Banks", "title": "Todd Cantwell makes David de Gea Manchester United admission - Manchester Evening News", "description": "Manchester United cruised to a 4-0 victory against Norwich City in the Premier League earlier this season but had David de Gea to thank for keeping a clean sheet.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/cantwell-de-gea-man-utd-18150525", "urlToImage": null, "publishedAt": "2020-04-25T15:25:42Z", "content": "Norwich City star Todd Cantwell admitted Manchester United goalkeeper David de Gea \"read him like a book\" during their Premier League clash in January. \r\nThe England U21 international has been one of the stand-out performers for the Canaries this season and i… [+1334 chars]"}, {"source": {"id": null, "name": "Paddypower.com"}, "author": "Rob Catterson", "title": "Horse racing tips: 5 who'll thrive in the din at Sha Tin on Sunday - Paddy Power News", "description": "In case you hadn't already heard, it's Champions Day.", "url": "https://news.paddypower.com/horse-racing/2020/04/25/horse-racing-tips-champions-day-sha-tin/", "urlToImage": null, "publishedAt": "2020-04-25T14:40:47Z", "content": "The first of the Group 1 action is the Chairmans Sprint Prize, where eight of the 11 runners contested the Group 2 Sprint Cup three weeks ago over C&amp;D. On that occasion, Voyage Warrior was a surprise winner but there was nothing fluky about his performanc… [+3274 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Elliott Jackson", "title": "Dimitar Berbatov sends transfer warning to Newcastle with Man City comparison - Manchester Evening News", "description": "The former Manchester United striker has had his say on Newcastle's potential takeover.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/berbatov-newcastle-manchester-city-takeover-18147091", "urlToImage": null, "publishedAt": "2020-04-25T14:36:51Z", "content": "Dimitar Berbatov has insisted it will take time for Newcastle United to attract top players to the club.\r\nNewcastle are in talks over a potential Saudi Arabia-backed takeover. Manchester City, of course, were subject to a takeover of their own in 2008 which d… [+1174 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Elliott Jackson", "title": "What Jurgen Klopp said to Liverpool before historic Barcelona comeback - Liverpool Echo", "description": "The Reds beat Barcelona 4-0 to reach the Champions League final", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/klopp-liverpool-talk-barcelona-comeback-18148913", "urlToImage": null, "publishedAt": "2020-04-25T14:08:58Z", "content": "James Milner has revealed what Jurgen Klopp said to his players in training before their unforgettable comeback against Barcelona in the Champions League. \r\nThe Reds remarkably beat the Spanish giants 4-0 at Anfield in the second leg of their Championship Lea… [+1744 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Liverpool 'eye Joaquin Correa transfer' in search for Sadio Mane backup - Mirror Online", "description": "The Reds need quality reserves for their fearsome first-choice frontline and have identified Lazio forward as potential transfer target, according to reports from Italy", "url": "https://www.mirror.co.uk/sport/football/transfer-news/liverpool-eye-joaquin-correa-transfer-21924641", "urlToImage": null, "publishedAt": "2020-04-25T14:06:03Z", "content": "Liverpool have earmarked Lazio forward Joaquin Correa as a potential transfer target, according to reports from Italy.\r\n The Argentina international is regarded as one of the most exciting talents in Serie A on his day, and could be available for as little as… [+1891 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Marcus Banks", "title": "Manchester United fans cannot believe new Angel Di Maria transfer rumour - Manchester Evening News", "description": "Angel Di Maria signed for United in 2014 but left in 2015 to join Paris Saint-Germain.", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/pogba-di-maria-man-utd-18149406", "urlToImage": null, "publishedAt": "2020-04-25T13:42:51Z", "content": "Speculation over the future of Manchester United midfielder Paul Pogba refuses to die down. \r\nThe World Cup winner continues to be heavily linked with an exit, with Real Madrid, Juventus and Paris Saint-Germain believed to be interested in acquiring his servi… [+1452 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Liverpool vs Atletico Madrid under investigation following coronavirus outbreak - Mirror Online", "description": "Liverpool's Champions League exit to Atletico Madrid is one of the last games to be played amid the coronavirus pandemic and has come in for plenty of criticism", "url": "https://www.mirror.co.uk/sport/football/news/liverpool-vs-atletico-madrid-under-21925450", "urlToImage": null, "publishedAt": "2020-04-25T13:32:00Z", "content": "Liverpool's Champions League match with Atletico Madrid is under investigation regarding its impact on the spread of coronavirus. \r\nThe last 16 clash took place on March 11 - the same day the World Health Organisation declared Covid-19 a global pandemic.\r\nSpa… [+1670 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Dani Ceballos shares Zinedine Zidane message on future amid Arsenal transfer talk - Mirror Online", "description": "Arsenal are believed to be keen on signing Real Madrid midfielder permanently following loan spell, but Ceballos has revealed Zidane conversation which could decide his future", "url": "https://www.mirror.co.uk/sport/football/transfer-news/dani-ceballos-shares-zinedine-zidane-21924432", "urlToImage": null, "publishedAt": "2020-04-25T12:57:55Z", "content": "Dani Ceballos has shared a message from Zinedine Zidane about his Real Madrid future amid speculation Arsenal will bid to sign him permanently. \r\nCeballos has spent the season on loan with the Gunners from Madrid, and Arsenal are believed to be keen on signin… [+1801 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Sean Dyche explains why he had to apologise to Arsene Wenger after Arsenal clash - Mirror Online", "description": "Burnley manager said he gave former Gunners boss Wenger a 'rubbish' claret following a game at Turf Moor, as he opened up on his own taste in wine", "url": "https://www.mirror.co.uk/sport/football/news/sean-dyche-explains-apologise-arsene-21924463", "urlToImage": null, "publishedAt": "2020-04-25T12:57:52Z", "content": "Burnley manager Sean Dyche has revealed he had to apologise to former Arsenal boss Arsene Wenger - for giving him a \"rubbish\" red wine after a game. \r\nDyche, who admits he is \"certainly not an aficionado\" of fine wines, says all rival managers are offered the… [+2225 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Olivier Giroud: Chelsea striker set to extend contract - BBC Sport", "description": "Chelsea striker Olivier Giroud is set to extend his contract, keeping him at the club until 2021.", "url": "https://www.bbc.co.uk/sport/football/52418829", "urlToImage": null, "publishedAt": "2020-04-25T12:24:49Z", "content": "Olivier Giroud joined Chelsea from Arsenal in 2018\r\nChelsea striker Olivier Giroud is set to extend his contract, keeping him at the club until 2021.\r\nThe Frenchman, 33, looked like he would leave in January after making five Premier League appearances and en… [+808 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Jon Doel", "title": "Wales on brink of stunning world rugby and ditching Bill Beaumont amid late drama - reports - Wales Online", "description": "The race to become World Rugby chairman may be about to take a huge twist", "url": "https://www.walesonline.co.uk/sport/rugby/rugby-news/wales-brink-stunning-world-rugby-18149672", "urlToImage": null, "publishedAt": "2020-04-25T12:15:32Z", "content": "Wales could be the country to blow apart Bill Beaumont's hopes of winning the race to remain World Rugby chairman, according to reports.\r\nBeaumont has widely been expected to receive the backing of all Six Nations countries in his battle with Agustin Pichot, … [+1060 chars]"}, {"source": {"id": "talksport", "name": "TalkSport"}, "author": "Joe Coleman", "title": "David Haye considering incredible boxing comeback to fight the winner of Tyson Fury vs Anthony Joshua - talkSPORT.com", "description": "", "url": "http://talksport.com/sport/boxing/698874/haye-boxing-comeback-news-fight-tyson-fury-joshua/", "urlToImage": null, "publishedAt": "2020-04-25T11:56:55Z", "content": "David Haye has admitted he would only consider a return to boxing if he was guaranteed to fight the winner of Anthony Joshua vs Tyson Fury.\r\nHowever, the Bermondsey-born slugger admitted it was unlikely the call would ever come and says he was content with st… [+2425 chars]"}, {"source": {"id": null, "name": "Autosport.com"}, "author": "Luke Smith", "title": "Brazil 2012: The race that could have changed an F1 nearly-man's career - Autosport", "description": "The 2012 Brazilian Grand Prix, which is being live-streamed by Formula 1 today, is upheld as one of F1's most dramatic title-deciders", "url": "https://www.autosport.com/f1/news/149147/the-race-that-could-have-changed-an-f1-nearlyman", "urlToImage": null, "publishedAt": "2020-04-25T11:33:15Z", "content": "The 2012 Brazilian Grand Prix, which is being live-streamed by Formula 1 today, is upheld as one of F1's most dramatic title-deciders. The fight for the victory was no less exciting, as yet another chance slipped through the fingers of an F1 nearly-man\r\nThe 2… [+9660 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Report: Spurs could suffer major financial blow after UEFA decision - The Spurs Web", "description": "Tottenham Hotspur could be set to suffer a major financial blow in revenue generated from European football if the season is decided on a points-per-game basis, the Evening Standard report. It was revealed on Thursday that UEFA were considering using a points…", "url": "https://www.spurs-web.com/spurs-news/report-spurs-could-suffer-major-financial-blow-after-uefa-decision/", "urlToImage": null, "publishedAt": "2020-04-25T11:00:00Z", "content": "Tottenham Hotspur could be set to suffer a major financial blow in revenue generated from European football if the season is decided on a points-per-game basis, the Evening Standard report.\r\nIt was revealed on Thursday that UEFA were considering using a point… [+1358 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "UFC to stage three events in Florida in May - BBC News", "description": "UFC president Dan White announces UFC 249 for 9 May and two other events without fans next month.", "url": "https://www.bbc.co.uk/sport/mixed-martial-arts/52424303", "urlToImage": null, "publishedAt": "2020-04-25T10:17:54Z", "content": "Tony Ferguson will be in action at UFC 249 on 9 May at VyStar Veterans Memorial Arena in Jacksonville\r\nUFC president Dana White has announced plans for three events in Jacksonville, Florida, next month.\r\nThey will be closed to the public and \"produced with on… [+2003 chars]"}, {"source": {"id": null, "name": "Justarsenal.com"}, "author": "Admin Pat", "title": "The Dutch FA cancel the League (without naming a Champion) and expect more to follow - Just Arsenal News", "description": "Just Arsenal News, Transfer Rumours And Discussion about all matters relating to Arsenal Football Club", "url": "https://www.justarsenal.com/the-dutch-fa-cancel-the-league-without-naming-a-champion-and-expect-more-to-follow/242859", "urlToImage": null, "publishedAt": "2020-04-25T09:54:17Z", "content": "The Dutch FA has become the second European League to cancel the remaining games, but with the new guidelines from UEFA, they have decide not to name any club as Champions.\r\nBelgium announced Bruges as Champions but they were only one game from the end of the… [+2326 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Pierre-Emerick Aubameyang's dad sends message to Arsenal striker after Chelsea transfer link - Metro.co.uk", "description": "'You know what you have to do bro.'", "url": "https://metro.co.uk/2020/04/25/pierre-emerick-aubameyangs-dad-sends-message-arsenal-striker-chelsea-transfer-link-12607946/", "urlToImage": null, "publishedAt": "2020-04-25T08:20:35Z", "content": "Pierre-Emerick Aubameyang could leave Arsenal at the end of the season (Getty Images)\r\nPierre-Emerick Aubameyangs father has appeared to urge the Arsenal striker to sign a new contract after he was linked with a move to Chelsea.\r\nThe 30-year-old will have jus… [+1242 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "NFL Draft: Tee Higgins joins Joe Burrow at Cincinnati Bengals - Sky Sports", "description": "The Cincinnati Bengals followed up their first-round pick of Joe Burrow by selecting Tee Higgins, who has declared the duo are \"about to tear it up\".", "url": "https://www.skysports.com/nfl/news/12118/11978531/nfl-draft-tee-higgins-joins-joe-burrow-at-cincinnati-bengals", "urlToImage": null, "publishedAt": "2020-04-25T07:29:15Z", "content": "The Cincinnati Bengals followed up their first-round pick of quarterback Joe Burrow by selecting wide receiver Tee Higgins, who has declared the duo are \"about to tear it up\" in the NFL.\r\nThe Bengals picked Clemson's Higgins - who grew up supporting the side … [+1441 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Guardian sport", "title": "Philadelphia Eagles surprise with Jalen Hurts pick on day two of NFL draft - The Guardian", "description": "The Eagles selected Oklahoma quarterback Jalen Hurts in the second round of the NFL draft on Friday, a stunning move for a team with more pressing needs", "url": "https://www.theguardian.com/sport/2020/apr/25/nfl-draft-picks-day-two-jalen-hurts", "urlToImage": null, "publishedAt": "2020-04-25T04:20:00Z", "content": "After giving Carson Wentz a playmaker, the Philadelphia Eagles drafted his backup.\r\nThe Eagles selected Oklahoma quarterback Jalen Hurts in the second round of the NFL draft on Friday night, a stunning move for a team with more pressing needs.\r\nPhiladelphia h… [+10012 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Guardian sport", "title": "West Indies say Test tour of England has been postponed due to Covid-19 - The Guardian", "description": "The three-Test series between England and West Indies in June has been postponed due to the coronavirus outbreak", "url": "https://www.theguardian.com/sport/2020/apr/24/west-indies-test-tour-england-postponed-covid-19-cricket", "urlToImage": null, "publishedAt": "2020-04-24T23:20:55Z", "content": "The three-Test series between England and West Indies in June has been postponed due to the coronavirus outbreak, Cricket West Indies (CWI) said on Friday.\r\nWest Indies had been scheduled to play on 4-8 June at The Oval, 12-16 June at Edgbaston and 25-29 June… [+1600 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Alex Raskin Sports News Editor For Dailymail.com Associated Press", "title": "Video shows Bucs rookie and Tom Brady's newest blocker Tristan Wirfs jumping out of pool - Daily Mail", "description": "Tampa Bay Buccaneers first-round pick Tristan Wirfs weighs well over 300 pounds, but the offensive tackle and Tom Brady's newest blocker is still athletic enough to jump out of a pool onto his feet.", "url": "https://www.dailymail.co.uk/news/article-8254551/Video-shows-Bucs-rookie-Tom-Bradys-newest-blocker-Tristan-Wirfs-jumping-pool.html", "urlToImage": null, "publishedAt": "2020-04-24T20:51:27Z", "content": "The Buccaneers drafted Tristan Wirfs to address an opening at right tackle \r\nTampa Bay Buccaneers first-round pick Tristan Wirfs weighs well over 300 pounds, but the offensive tackle and Tom Brady's newest blocker is still athletic enough to launch himself ou… [+3438 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Is Jamie Carragher RIGHT?! Fernando Torres' flabbergasting move from Liverpool to Chelsea | ESPN FC - ESPN UK", "description": "Craig Burley and Julien Laurens join Dan Thomas on ESPN FC to react to recent comments made by former Liverpool defender Jamie Carragher and former Chelsea c...", "url": "https://www.youtube.com/watch?v=hoRBD5aVqVk", "urlToImage": null, "publishedAt": "2020-04-24T19:51:55Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Suzanne Wrack", "title": "Who could replace Phil Neville as England Women's manager? - The Guardian", "description": "We run the rule over leading candidates, including a two-times World Cup winner and a woman who worked as Neville’s No 2", "url": "https://www.theguardian.com/football/2020/apr/24/who-could-replace-phil-neville-as-england-womens-manager", "urlToImage": null, "publishedAt": "2020-04-24T18:00:00Z", "content": "The Football Associations hunt for a successor to Mark Sampson in 2017 quickly became a circus. Names flew out of the ring as fast as they stepped in. Increased scrutiny on the person in charge, with the game professionalising, led some of those on the shortl… [+4734 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Matthew Southcombe", "title": "Marler won't miss a game despite long ban for grabbing Alun Wyn Jones' genitals - Wales Online", "description": "The England prop was banned for 10 weeks after grabbing the Wales skipper's penis, but will be free to play as soon as rugby recommences", "url": "https://www.walesonline.co.uk/sport/rugby/rugby-news/joe-marler-wont-miss-game-18148172", "urlToImage": null, "publishedAt": "2020-04-24T17:41:14Z", "content": "England prop Joe Marler will not miss a single game of rugby despite grabbing Alun Wyn Jones' genitals in a Six Nations match last month, according to reports. \r\nMarler received a 10-week ban after he was found guilty of 'grabbing, twisting or squeezing' the … [+1782 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Green Bay Packers' Aaron Rodgers within rights to be annoyed by Jordan Love pick, says Neil Reynolds - Sky Sports", "description": "Neil Reynolds and Jeff Reinebold analyse the Green Bay Packers' shock selection of Utah State quarterback Jordan Love.", "url": "https://www.skysports.com/nfl/news/12118/11978237/green-bay-packers-aaron-rodgers-within-rights-to-be-annoyed-by-jordan-love-pick-says-neil-reynolds", "urlToImage": null, "publishedAt": "2020-04-24T17:15:29Z", "content": "Aaron Rodgers is the same age as Brett Favre was when he was selected as his eventual successor by the Green Bay Packers with the No 24 pick at the 2005 NFL Draft.\r\nThat nugget became relevant with pick No 26 on day one of the 2020 Draft as the Packers produc… [+2899 chars]"}, {"source": {"id": null, "name": "Derbytelegraph.co.uk"}, "author": "Chris Watson", "title": "Derby County favourite has contract terminated by Championship club - Derbyshire Live", "description": "The former Rams midfielder and coach had been part of Graeme Jones' backroom staff at Luton Town", "url": "https://www.derbytelegraph.co.uk/sport/football/football-news/inigo-idiakez-derby-luton-harford-4076842", "urlToImage": null, "publishedAt": "2020-04-24T15:19:00Z", "content": "Derby County favourite Inigo Idiakez has lost his job at Sky Bet Championship club Luton Town.\r\nIdiakez had been first-team coach at Kenilworth Road but has had his contract terminated with immediate effect, along with manager Graeme Jones, assistant boss Gar… [+2928 chars]"}]}