{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Thesun.co.uk"}, "author": "SunSport Reporters", "title": "9am Man Utd news LIVE: Pogba and Lingard to be sold for Sancho funds, Ramsey and Pjanic exchanges offered - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11484628/man-utd-news-live-pogba-lingard-sancho-transfer-ramsey-pjanic/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/04/pogba-lingard-sancho.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-04-27T08:43:44Z", "content": "PREM PUZZLE\r\nPremier League players who went abroad during the UK lockdown could find themselves in a two-week quarantine headache.\r\nClubs are hoping to be able to start recalling their stars to training, initially for individuals and then small group session… [+497 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "F1 2020 plans being put in place for proposed July season start - Sky Sports", "description": "Formula 1's plans to potentially start the 2020 season behind closed doors in Europe in July are gathering pace.", "url": "https://www.skysports.com/f1/news/12433/11979273/f1-2020-plans-being-put-in-place-for-proposed-july-season-start", "urlToImage": "https://e1.365dm.com/20/02/1600x900/skysports-bottas-vettel-mercedes_4926450.jpg", "publishedAt": "2020-04-27T08:37:02Z", "content": "Formula 1's plans to potentially start the 2020 season in Europe in July are gathering pace, with behind-closed-doors double headers understood to be pencilled in for Austria and Silverstone.\r\nFormula 1's plans to potentially start the 2020 season in Europe i… [+2618 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Harry Slavin For Mailonline", "title": "Michael Jordan dragged Dennis Rodman out of a Vegas hotel bed while Carmen Electra hid - Daily Mail", "description": "ESPN's The Last Dance series, which focuses on Michael Jordan and the Chicago Bulls' 1997-98 season, has shines a light on the episode which saw the franchise allow Rodman to take a holiday.", "url": "https://www.dailymail.co.uk/sport/nba/article-8260221/Michael-Jordan-dragged-Dennis-Rodman-Vegas-hotel-bed-Carmen-Elektra-hid.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/04/27/08/27692608-0-image-a-71_1587972350498.jpg", "publishedAt": "2020-04-27T08:35:34Z", "content": "Michael Jordan once had to travel from Chicago to Las Vegas to pull team-mate Dennis Rodman out of bed and get him to practice, a ew documentary has revealed.\r\nESPN's The Last Dance series, which focuses on Michael Jordan and the Chicago Bulls' winning 1997-9… [+2035 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Sean McCormick", "title": "The crazy names linked with a move to Newcastle United as PiF takeover nears completion - Chronicle Live", "description": "The Newcastle United transfer gossip is already ramping up ahead of the imminent completion of the takeover", "url": "https://www.chroniclelive.co.uk/sport/football/transfer-news/crazy-names-linked-move-newcastle-18154877", "urlToImage": "https://i2-prod.chroniclelive.co.uk/incoming/article18155164.ece/ALTERNATES/s1200/0_Links.jpg", "publishedAt": "2020-04-27T08:13:44Z", "content": "Newcastle United's takeover is still in the hands of the Premier League but that hasn't stopped the transfer rumour mill going into overdrive.\r\n News emerged almost a fortnight ago that PCP Capital Partners' takeover bid for the club had reached the Premier L… [+5878 chars]"}, {"source": {"id": null, "name": "Formula1.com"}, "author": "F1", "title": "Organisers confirm 2020 French Grand Prix will not go ahead - Formula 1", "description": "It becomes the 10th race of the 2020 season to have been cancelled or postponed in light of the current health crisis.", "url": "https://www.formula1.com/en/latest/article.organisers-confirm-2020-french-grand-prix-will-not-go-ahead.6kEi9Sb68ZPJxlxgsgm4nQ.html", "urlToImage": "https://www.formula1.com/content/dam/fom-website/sutton/2019/France/Sunday/1017567761-LAT-20190623-SNE20122.jpg", "publishedAt": "2020-04-27T08:06:54Z", "content": "The organisers of the French Grand Prix have confirmed the event will not go ahead in 2020, in light of the coronavirus pandemic.\r\nThe race was due to take place at Circuit Paul Ricard at the end of June, but officials announced on Monday morning that the dec… [+1527 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Project Restart: More subs, no sex and the Premier League's new rules - Metro.co.uk", "description": "Football could look very different when the season resumes in June.", "url": "https://metro.co.uk/2020/04/27/project-restart-12614208/", "urlToImage": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2020/04/GettyImages-1216565738-1_1587973327.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "publishedAt": "2020-04-27T08:00:09Z", "content": "Premier League football could look very different come Junes proposed start date (Picture: Getty)\r\nThe Premier League is ramping up their plan to resume the season at the start of June in an operation that has been titled Project Restart, which will see a hos… [+6224 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Alex Dicken", "title": "Gary Neville demands action over clubs taking Aston Villa's stance - Birmingham Live", "description": "Aston Villa chief executive Christian Purslow revealed on Saturday that the first team and senior staff members have all agreed to take a 25 per cent wage deferral for the next four months", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/gary-neville-demands-action-over-18153459", "urlToImage": "https://i2-prod.birminghammail.co.uk/incoming/article18106773.ece/ALTERNATES/s1200/0_GettyImages-1200786965.jpg", "publishedAt": "2020-04-27T07:54:51Z", "content": "Aston Villas first team squad have agreed to take a 25 per cent wage deferral for the next four months.\r\nVirtually every football club across the country is feeling the financial strain of the coronavirus pandemic with games suspended indefinitely.\r\nVilla are… [+4724 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Daniel Hammond", "title": "Everton ‘appalled’ at flop Moise Kean hosting ‘wild’ lockdown party with lapdancing that went on until early h - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11482019/moise-kean-lockdown-party-everton-lapdancing/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/04/NINTCHDBPICT000579425813-e1587968117543.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-04-27T07:53:09Z", "content": "FOOTIE Covidiot Moise Kean has thrown a raunchy party at home during lockdown, it has emerged.\r\nThe Everton flop, 20, who is thought to earn £50,000 a week, filmed himself at the bash in his Cheshire apartment.\r\nEverton flop Moise Kean has been blasted by his… [+1711 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Will Griffee For Mailonline", "title": "Arsenal back in training TODAY but will still follow strict coronavirus isolation rules - Daily Mail", "description": "Arsenal players are back in training today after 47 days of isolation but strict coronavirus isolation rules will still be enforced. Mikel Arteta's men will all have a pitch to themselves.", "url": "https://www.dailymail.co.uk/sport/football/article-8260237/Arsenal-training-TODAY-follow-strict-coronavirus-isolation-rules.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/04/27/08/27692112-0-image-a-8_1587971884823.jpg", "publishedAt": "2020-04-27T07:47:44Z", "content": "Arsenal players are back in training today after 47 days of isolation but strict coronavirus isolation rules will still be enforced. \r\nMikel Arteta's men will all have a pitch to themselves at the ten-pitch Hertfordshire complex in Colney. \r\nThe return to wor… [+1443 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Connor O'Neill", "title": "New Premier League return plan emerges that will affect Arsenal, Chelsea and Tottenham - Football.London", "description": "The government has urged the Premier League to step up its plans to return in a bid to lift the mood of the nation", "url": "https://www.football.london/premier-league/breaking-premier-league-return-date-18154903", "urlToImage": "https://i2-prod.football.london/premier-league/article18135911.ece/ALTERNATES/s1200/0_Untitled-design-11.jpg", "publishedAt": "2020-04-27T07:19:47Z", "content": "The Premier League and other sporting competitions in England have been urged by the government to significantly step up their planning for a return to action behind closed doors.\r\nIn a new report, it is claimed that the government believes the return of live… [+3789 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Richard Fay", "title": "Manchester United urged to repeat Javier Hernandez transfer tactic - Manchester Evening News", "description": "Man Utd signed Javier 'Chicharito' Hernandez a decade ago and his legacy is still fondly remembered at the club.", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/man-utd-hernandez-transfer-news-18153165", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/incoming/article18153186.ece/ALTERNATES/s1200/0_GettyImages-167215163.jpg", "publishedAt": "2020-04-27T07:11:36Z", "content": "Rafael da Silva has challenged Manchester United to try and find more players like Javier Hernandez in the summer transfer window.\r\nMexican great Hernandez joined United a decade ago when Sir Alex Ferguson recruited him from Chivas Guadalajara, and he made qu… [+1247 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Premier League Classic: Newcastle 0-6 Liverpool | Six of the best against the Toon - Liverpool FC", "description": "Rewatch one of the most incredible away wins in the Premier League era. The Reds produced a simply unforgettable performance at St James' Park in April 2013 ...", "url": "https://www.youtube.com/watch?v=z32rH8B0ULc", "urlToImage": "https://i.ytimg.com/vi/z32rH8B0ULc/maxresdefault.jpg", "publishedAt": "2020-04-27T07:00:18Z", "content": "Rewatch one of the most incredible away wins in the Premier League era. The Reds produced a simply unforgettable performance at St James' Park in April 2013 with goals from Daniel Sturridge, Jordan Henderson, Daniel Agger and Fabio Borini. This was Newcastle'… [+307 chars]"}, {"source": {"id": null, "name": "Footballinsider247.com"}, "author": null, "title": "‘Won’t see it anywhere else’ – Newcastle Exclusive: Pundit drools amid big Sky update - Football Insider", "description": "Michael Brown has told Football Insider how the passion among the Newcastle United fanbase is unmatched as he reacted to takeover update", "url": "https://www.footballinsider247.com/brown-makes-incredible-newcastle-united-takeover-claim/", "urlToImage": "/static/uploads/1/2020/04/Amanda-Staveley.jpg", "publishedAt": "2020-04-27T06:45:00Z", "content": "Michael Brown has claimed the passion among the Newcastle United fanbase is unmatched as he tipped the takeover to take the club to stunning new heights.\r\nSpeaking exclusively to Football Insider assistant editor Russell Edge, the ex-Man City and Tottenham mi… [+1367 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Jake Polden", "title": "Jurgen Klopp made accurate Bruno Fernandes prediction before transfer to Man Utd - Mirror Online", "description": "Jurgen Klopp came face to face with Bruno Fernandes when Liverpool drew 2-2 with his former team Sporting Lisbon during pre-season at the New York Yankee Stadium", "url": "https://www.mirror.co.uk/sport/football/news/jurgen-klopp-made-accurate-bruno-21931181", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21931154.ece/ALTERNATES/s1200/0_Screen-Shot-2020-04-27-at-070711.jpg", "publishedAt": "2020-04-27T06:44:18Z", "content": "Jurgen Klopp feared Bruno Fernandes would make Manchester United stronger after seeing him in action during pre-season.\r\nLiverpool faced off against Fernandes' former side Sporting Lisbon at the New York Yankee Stadium before the current campaign got underway… [+1428 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Mark McDougall", "title": "Scottish football crisis LIVE as Rangers promise SPFL rivals their evidence - Scottish Daily Record", "description": "All the latest from the world of Scottish football as clubs look to deal with the shutdown.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/scottish-football-crisis-live-rangers-21931173", "urlToImage": "https://i2-prod.dailyrecord.co.uk/incoming/article21715727.ece/ALTERNATES/s1200/11_JS209167111.jpg", "publishedAt": "2020-04-27T06:33:32Z", "content": "EXC! SPFL left out of Downing Street talks\r\n (Image: SNS Group)\r\nScottish football has been shut out of crunch talks with the UK government about how to bring the game safely back out of lockdown.\r\nOfficials from No.10 will this week hold conversations with t… [+947 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Richard Fay", "title": "Manchester United news and transfers LIVE Aubameyang boost plus Jadon Sancho to Man Utd latest - Manchester Evening News", "description": "Follow for all the latest Man Utd transfer rumours, injury latest and breaking news throughout the day.", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/man-utd-news-transfers-live-18153366", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/incoming/article18153381.ece/ALTERNATES/s1200/0_UtdBlogPic1.png", "publishedAt": "2020-04-27T06:25:26Z", "content": "Manchester United goalkeeper David de Gea says he intends to stay at the club for more than 10 years amid the challenge of Dean Henderson.\r\n\"Yeah, I'm getting older!\" De Gea said. \"Just to be a part of this club is amazing. So imagine, 10 years, it's like a d… [+535 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Joe Rimmer", "title": "Xabi Alonso and forgotten former Liverpool coach 'in running' to become Pep Guardiola's assistant - Liverpool Echo", "description": "Man City boss Pep Guardiola is on the lookout for a new assistant manager", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/xabi-alonso-forgotten-former-liverpool-18153523", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article16803596.ece/ALTERNATES/s1200/0_GettyImages-1013271618.jpg", "publishedAt": "2020-04-27T06:16:41Z", "content": "Xabi Alonso is still revered at Anfield but he could soon help plot Liverpool's downfall.\r\nThe former Red could be in the running to replace Mikel Arteta as Manchester City assistant manager, according to a report by Goal.\r\nAnd he's not the only man with Live… [+1852 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Riath Al-Samarrai for the Daily Mail", "title": "Anthony Yarde opens up on how boxing is helping him cope with his own coronavirus tragedy - Daily Mail", "description": "EXCLUSIVE BY RIATH AL-SAMARRAI: Running in the park has become a blessing for Anthony Yarde to cope with his grief, but the sight of so many people mingling reminds him of the problem.", "url": "https://www.dailymail.co.uk/sport/boxing/article-8258207/Anthony-Yarde-opens-boxing-helping-cope-coronavirus-tragedy.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/04/26/11/27666132-0-image-a-29_1587896126176.jpg", "publishedAt": "2020-04-27T06:14:28Z", "content": "Running in the park has become a blessing and a curse for Anthony Yarde. With each stride he feels the grief departing through his feet, but then the sight of so many people mingling reminds him of the problem all over again.\r\nWhy don't they listen, he asks h… [+5843 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Sunday Supplement: Who should be the next England Women manager and what is Phil Neville's legacy? - Sky Sports", "description": "The Sunday Supplement panel on who should be the next England Women boss, if it should be based on gender and Phil Neville's legacy...", "url": "https://www.skysports.com/football/news/28508/11979130/sunday-supplement-who-should-be-the-next-england-women-manager-and-what-is-phil-nevilles-legacy", "urlToImage": "https://e2.365dm.com/20/02/1600x900/skysports-casey-stoney-manchester-united-women_4913760.jpg", "publishedAt": "2020-04-27T06:12:41Z", "content": "The Sunday Supplement panel discuss who should be the next England Women manager, whether it should be based on gender and what Phil Neville's legacy will be.\r\nIt was announced on Friday that Neville would be stepping aside as England Women head coach at the … [+7514 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Jake Polden", "title": "Philippe Coutinho told he has three options after making transfer contact with Liverpool - Mirror Online", "description": "Former Liverpool star Philippe Coutinho is certain to leave Barcelona when the summer transfer window opens, but it is unclear where the Brazilian will be heading", "url": "https://www.mirror.co.uk/sport/football/news/philippe-coutinho-told-three-options-21931116", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article20008841.ece/ALTERNATES/s1200/0_Bayern-Munich-unveil-Philippe-Coutinho.jpg", "publishedAt": "2020-04-27T06:12:28Z", "content": "The three options on the table for Philippe Coutinho this summer have finally been outlined by Barcelona, according to reports. \r\n Spanish publication Sport claims Barcelona will allow Coutinho to complete a permanent transfer away from the Camp Nou if they c… [+1562 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Alex Dicken, Tom Leach", "title": "'May be different' - The government issue key update to West Brom and Leeds United - Birmingham Live", "description": "West Bromwich Albion and Leeds are both on course for automatic promotion from the Championship", "url": "https://www.birminghammail.co.uk/sport/football/football-news/may-different-government-issue-key-18154218", "urlToImage": "https://i2-prod.birminghammail.co.uk/sport/football/football-news/article17563749.ece/ALTERNATES/s1200/0_Bilic-Bielsa.jpg", "publishedAt": "2020-04-27T06:02:44Z", "content": "First secretary of state Dominic Raab has explained how ramped up testing will allow West Bromwich Albion to finish their season.\r\nThe Premier League and EFL remain suspended for the time being as the country attempts to slow the spread of the virus.\r\nThat ha… [+1291 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Josh Williams, David Alexander Hughes, Matt Addison, Josh Williams, David Alexander Hughes", "title": "Liverpool wildcard signing would make perfect sense as Jurgen Klopp successor - Liverpool Echo", "description": "Jurgen Klopp is contracted until 2024 but Liverpool will already be eyeing up potential future candidates", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-wildcard-signing-would-make-18135708", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article16645152.ece/ALTERNATES/s1200/0_GettyImages-1153417461.jpg", "publishedAt": "2020-04-27T04:10:44Z", "content": "When Liverpool are searching for a new manager, you can expect the same rigorous procedure of stylistic matching, footballing capabilities, and background checks on personality to be stringently performed as when a player is brought to Anfield.\r\nThe exact cri… [+3221 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Jonathan Humphries", "title": "Terrified dad called son to say 'I'm not ready to go' before dying of coronavirus - Liverpool Echo", "description": "David Clark fought many health battles and won but coronavirus was a step too far", "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/scared-dad-called-son-say-18154392", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article18154515.ece/ALTERNATES/s1200/0_WhatsApp-Image-2020-04-26-at-160627jpeg.jpg", "publishedAt": "2020-04-27T04:10:23Z", "content": "The son of a devoted family man described the moment his dad called to say 'I'm not ready to go\" as he was transferred into a coronavirus ward.\r\nPopular \"adopted Scouser\" David Clark, 57, had survived many health battles related to his Type 1 diabetes over th… [+5503 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Tom Leach, George Smith", "title": "Tottenham step up Meunier pursuit, Liverpool chase Mbappe - Premier League transfer rumours - Football.London", "description": "Here are the latest Premier League rumours as football awaits news of a Premier League return", "url": "https://www.football.london/premier-league/premier-league-rumours-tottenham-meunier-18153806", "urlToImage": "https://i2-prod.birminghammail.co.uk/incoming/article18079172.ece/ALTERNATES/s1200/0_GettyImages-1182843825.jpg", "publishedAt": "2020-04-27T03:09:38Z", "content": "The Premier League may be on hold for now with plans to spark a return said to be ramping up.\r\nThat is the big rumour in the media this weekend, with a government meeting said to be on the cards.\r\nBut there is still plenty of transfer talk filling the inside … [+2029 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Jack Wilshere 'didn't want' Arsenal transfer after being scouted by referee - Mirror Online", "description": "Jack Wilshere moved to Arsenal as a kid after being spotted by a referee but was apprehensive about making the switch", "url": "https://www.mirror.co.uk/sport/football/news/jack-wilshere-didnt-want-arsenal-21929501", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article19967024.ece/ALTERNATES/s1200/0_Arsenal-versus-Rangers-August-2009.jpg", "publishedAt": "2020-04-27T02:39:27Z", "content": "Jack Wilshere admits he didn't initially want to sign for Arsenal after being scouted by a referee as a kid. \r\nThe 28-year-old burst onto the scene at the Emirates and looked to have the world at his feet.\r\n A succession of injuries have hindered his progress… [+1565 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Virtual Madrid Open: Rafael Nadal, Andy Murray, Johanna Konta among ATP & WTA stars 'in action' - BBC News", "description": "On Tuesday, 32 of the world's best tennis players will compete against each other for the Madrid Open title - on their games consoles.", "url": "https://www.bbc.co.uk/sport/tennis/52434238", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/9265/production/_111977473_peel.jpg", "publishedAt": "2020-04-27T01:15:44Z", "content": "Andy Murray lifted the 2015 Madrid Open title by beating Rafael Nadal in the final - can the Scot beat him on the PlayStation?\r\nWhen Rafael Nadal claimed during an Instagram chat with Andy Murray that he had only begun preparing that day for the upcoming virt… [+9164 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Scottish gossip: Celtic, Rangers, Hearts, Aberdeen, Bayern Munich - BBC News", "description": "Bayern Munich eye Celtic winger and Hearts players still refusing wage cut as deadline looms.", "url": "https://www.bbc.co.uk/sport/football/52360849", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/5844/production/_102969522_fgsdgd.jpg", "publishedAt": "2020-04-27T01:05:00Z", "content": "Scottish football has been shut out of talks with the UK government about how to bring the game out of lockdown. (Daily Record)\r\nBayern Munich are preparing a move for 16-year-old Celtic winger Barry Hepburn.(Scottish Sun)\r\nSeveral Hearts players are still re… [+719 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Luke Gardener", "title": "Man Utd chief Ed Woodward wants one of FIVE Juventus stars in Paul Pogba transfer deal - Express", "description": "Manchester United could sell Paul Pogba in the summer transfer window with a Juventus return for the World Cup winner on the cards.", "url": "https://www.express.co.uk/sport/football/1274102/Man-Utd-Ed-Woodward-FIVE-Juventus-Paul-Pogba-transfer-deal-swap-latest-news-gossip", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/67/750x445/1274102.jpg", "publishedAt": "2020-04-27T00:01:00Z", "content": "Meanwhile, French football expert Julien Laurens believes Real Madrid will go all out to sign Pogba.\r\n\"I think they will still have some room for other eggs in that basket to be fair because I still think, like other clubs in Europe, Real Madrid have cash res… [+648 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Jamie Roberts: Centre reluctantly accepts Wales career over - BBC South East Wales", "description": "Centre Jamie Roberts tells the Scrum V podcast that while he is still available for Wales, his international days could be over.", "url": "https://www.bbc.co.uk/sport/rugby-union/52426250", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/130F1/production/_111956087_cdf_251117_dg_wales_vnew_zealand_48.jpg", "publishedAt": "2020-04-26T23:11:18Z", "content": "Media playback is not supported on this device\r\nJamie Roberts says Covid-19 means he might not be paid once rugby starts in South Africa.\r\nJamie Roberts has admitted his Test career could be over as he does not expect to be called up by Wales again.\r\nThe 94-c… [+2877 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Manchester United transfer news: Scott McTominay turned down Celtic move - Metro.co.uk", "description": "Celtic were desperate to sign the midfielder.", "url": "https://metro.co.uk/2020/04/26/scott-mctominay-confirms-turned-celtic-loan-12613729/", "urlToImage": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2020/03/GettyImages-1211192688_1587940605.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "publishedAt": "2020-04-26T23:03:24Z", "content": "MANCHESTER, ENGLAND MARCH 08: Scott McTominay of Manchester United celebrates after he scores his sides second goal during the Premier League match between Manchester United and Manchester City at Old Trafford on March 08, 2020 in Manchester, United Kingdom. … [+1795 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Tom Ball", "title": "What marathon? Public put the fun into fundraising - The Times", "description": "For the tens of thousands of people supposed to be taking part in the London Marathon yesterday, its postponement was a bitter blow. But for the charities that rely on the huge amounts of money it", "url": "https://www.thetimes.co.uk/article/what-marathon-public-put-the-fun-into-fundraising-h2zdhnbw0", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2Fbef927f2-87ff-11ea-8030-261bf7d8ac38.jpg?crop=4843%2C2724%2C44%2C379&resize=685", "publishedAt": "2020-04-26T23:00:00Z", "content": "For the tens of thousands of people supposed to be taking part in the London Marathon yesterday, its postponement was a bitter blow. But for the charities that rely on the huge amounts of money it raises, it presented an existential threat.\r\nIn an attempt to … [+453 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Bill Belichick admits New England Patriots not drafting a quarterback was 'not by design' - Sky Sports", "description": "New England head coach Bill Belichick has admitted not taking a quarterback in the Patriots' first post-Tom Brady draft \"was not by design\".", "url": "https://www.skysports.com/nfl/news/12118/11979177/bill-belichick-admits-new-england-patriots-not-drafting-a-quarterback-was-not-by-design", "urlToImage": "https://e1.365dm.com/19/12/1600x900/skysports-bill-belichick-new-england-patriots_4857303.jpg", "publishedAt": "2020-04-26T22:41:46Z", "content": "New England head coach Bill Belichick has admitted not taking a quarterback in the Patriots' first post-Tom Brady draft \"was not by design\".\r\nThe Patriots selected 10 players in the 2020 NFL Draft, but no quarterbacks to compete for the starting job that was … [+2213 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "PDC Home Tour: Nathan Aspinall tops Group 10 despite injury - Sky Sports", "description": "Nathan Aspinall avoided joining the list of high-profile names who have crashed out of the PDC Home Tour as he topped Group 10.", "url": "https://www.skysports.com/darts/news/12288/11979172/pdc-home-tour-nathan-aspinall-tops-group-10-despite-injury", "urlToImage": "https://e1.365dm.com/20/04/1600x900/skysports-premierleague-darts_4969375.jpg", "publishedAt": "2020-04-26T22:16:34Z", "content": "Nathan Aspinall avoided joining the list of high-profile names who have crashed out of the PDC Home Tour, as he topped Group 10 on Sunday night.\r\nThe Stockport native won all three of his matches, despite his preparation being far from ideal as he sustained a… [+3469 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Matt Barlow for the Daily Mail", "title": "Alan Pardew sets the record straight as he opens up on his Dutch adventure so far - Daily Mail", "description": "EXCLUSIVE INTERVIEW: Alan Pardew could only sit and wait for the phone call. There was nothing else to do as the fate of ADO Den Haag's season was debated in a series of video conference calls.", "url": "https://www.dailymail.co.uk/sport/football/article-8259085/Alan-Pardew-sets-record-straight-opens-Dutch-adventure-far.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/04/26/22/27679664-0-image-a-54_1587935283504.jpg", "publishedAt": "2020-04-26T22:02:45Z", "content": "Alan Pardew could only sit and wait for the phone call. There was nothing else to do as the fate of ADO Den Haag's season was debated and then fixed in a series of video conference calls involving the Dutch football authorities.\r\nWhen it came, on Friday, the … [+9190 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Ex-Spurs man claims 'it would help' to offload Tanguy Ndombele this summer in swap deal - The Spurs Web", "description": "Darren Bent believes it will be in Tottenham's best interest to accept Barcelona's rumoured offer of Samuel Umtiti and Nelson Semedo in a swap deal to sign Tanguy Ndombele. Ndombele's relationship with Jose Mourinho is said to be strained and the midfielder i…", "url": "https://www.spurs-web.com/spurs-news/ex-spurs-man-claims-it-would-help-to-offload-tanguy-ndombele-this-summer-in-swap-deal/", "urlToImage": "https://www.spurs-web.com/wp-content/uploads/2020/04/ndombele.jpg", "publishedAt": "2020-04-26T21:30:00Z", "content": "Darren Bent believes it will be in Tottenhams best interest to accept Barcelonas rumoured offer of Samuel Umtiti and Nelson Semedo in a swap deal to sign Tanguy Ndombele.\r\nNdombeles relationship with Jose Mourinho is said to be strained and the midfielder is … [+1602 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Joe Miles", "title": "Jesse Lingard goes for run with fellow Man Utd youth team star Ravel Morrison as pals keep fit during lockdown - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11484425/jesse-lingard-ravel-morrison-man-utd/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/04/SPORT-PREVIEW-MORRISON-LINGARD.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-04-26T20:34:25Z", "content": "JESSE LINGARD was spotted out on a run with Ravel Marrison - but the pair appeared to abide by social distancing guidelines.\r\nThe duo, who played together in the youth ranks at Manchester United, are on a mission to keep fit while on lockdown.\r\n Jesse Lingard… [+1371 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Jake Polden", "title": "Liverpool boss Jurgen Klopp had two reasons for contacting Kylian Mbappe's dad - Mirror Online", "description": "Liverpool's Sadio Mane has been linked with a £150m transfer to Real Madrid in recent weeks, and the Reds are reportedly looking at Kylian Mbappe as a replacement", "url": "https://www.mirror.co.uk/sport/football/news/liverpool-boss-jurgen-klopp-two-21928577", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article13267314.ece/ALTERNATES/s1200/0_MAIN-Mbappe-charmed-by-Klopp-but-they-couldnt-sign-him-for-one-reason.jpg", "publishedAt": "2020-04-26T19:38:11Z", "content": "Jurgen Klopp reportedly called Kylian Mbappe's dad as speculation grows Liverpool are keen on signing the Frenchman. \r\n Liverpool's Sadio Mane has been linked with a £150million transfer to Real Madrid in recent weeks, after Zinedine Zidane allegedly made the… [+1590 chars]"}, {"source": {"id": null, "name": "Theguardian.comsport"}, "author": "Chris Cook", "title": "MPs back BHA chief Nick Rust as trainer calls him a 'lame-duck leader' - The Guardian", "description": "Cheltenham’s MP insists the under-fire BHA chief Nick Rust is protecting racing’s interest during the virus crisis", "url": "https://amp.theguardian.comsport/2020/apr/26/mps-back-bha-chief-nick-rust-as-trainer-calls-him-a-lame-duck-leader-horse-racing", "urlToImage": "https://i.guim.co.uk/img/media/55e39d79aa63a8080caf80877a828e68ce2b389a/0_0_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=69bd64e6fce84b4029f9695691922c91", "publishedAt": "2020-04-26T18:48:02Z", "content": "Politicians spoke up in support of racings ruling body and its chief executive, Nick Rust, after leaked emails showed high-profile trainers had called on Rust to quit and criticised him for a lack of leadership during the coronavirus crisis.\r\nLaurence Roberts… [+4451 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Amie Wilson", "title": "How Roy Keane reacted to Juan Sebastian Veron signing for Manchester United - Manchester Evening News", "description": "The Argentinian midfielder arrived at Old Trafford in 2001 with the Man Utd team already packed with midfield quality", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-roy-keane-veron-18153124", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/incoming/article11703137.ece/ALTERNATES/s1200/GettyImages-1248575.jpg", "publishedAt": "2020-04-26T18:34:14Z", "content": "Former Manchester United Roy Keane has said that he relished the battle for a place in the starting eleven at Old Trafford, especially when Argentinian Juan Sebastian Veron came to the club. \r\nVeron signed for United from Lazio in 2001, joining the likes of K… [+2010 chars]"}, {"source": {"id": null, "name": "Footballinsider247.com"}, "author": null, "title": "‘They’ve as much money as Man City’ – Exclusive: Phillips reacts to ESPN’s Newcastle reveal - Football Insider", "description": "In the latest Newcastle United news Kevin Phillips claims British managers are not afforded the same opportunities as their foreign counterparts", "url": "https://www.footballinsider247.com/theyve-as-much-money-as-man-city-exclusive-phillips-reacts-to-espns-newcastle-reveal/", "urlToImage": "/static/uploads/1/2019/11/Bruce.jpg", "publishedAt": "2020-04-26T18:27:00Z", "content": "Kevin Phillips urged Newcastle United to stick with Steve Bruce post-takeover and insisted British managers do not get “a fair crack” in the Premier League.\r\nThe former England international, speaking exclusively to Football Insider correspondent Dylan Childs… [+1705 chars]"}, {"source": {"id": null, "name": "Manutd.com"}, "author": "Adam Marshall", "title": "Michael Carrick and Bryan Robson discuss midfield options - Manchester United", "description": "Michael Carrick feels the blend and balance of our players in the engine room gives Ole a lovely dilemma.", "url": "https://www.manutd.com/en/news/detail/michael-carrick-and-bryan-robson-discuss-man-utd-midfield-options", "urlToImage": "https://assets.manutd.com/AssetPicker/images/0/0/13/192/901357/AV8U0548_2020030845528016_202003080457301583686937716_large.jpg", "publishedAt": "2020-04-26T18:24:26Z", "content": "Reds legend Robson offered his opinion on the midfield situation and feels a regular run of games brought the best out of Matic and Fred. \r\nMatic wasn't getting too many games and, every time he came, in he looked a bit rusty, to me, and Fred was exactly the … [+878 chars]"}, {"source": {"id": null, "name": "Football365.com"}, "author": "Steve Pearson", "title": "Liverpool veteran Milner divulges Klopp methods; talks unbelievable record - Football365.com", "description": "Liverpool veteran James Milner gave his thoughts on a remarkable ongoing record, and divulged secrets of Jurgen Klopp's training sessions.", "url": "https://www.football365.com/news/liverpool-milner-klopp-methods-unbelievable-record", "urlToImage": "https://d2x51gyc4ptf2q.cloudfront.net/content/uploads/2020/04/26175022/Milner.Klopp_.Liverpool.Getty_.jpg", "publishedAt": "2020-04-26T17:41:04Z", "content": "Liverpoolveteran James Milner gave his thoughts on his ongoing Premier League record you have to read to believe, and detailed the secrets behind why Jurgen Klopps training sessions are so good.\r\nThe ever-reliable Milner, 34, will go down as one of the greate… [+2694 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Chelsea made Neymar transfer offer, confirms agent Wagner Ribeiro - Mirror Online", "description": "Neymar was once the hottest property in world football and attracted interest from several of Europe's elite clubs before moving to Barcelona, but not before a failed approach from Chelsea", "url": "https://www.mirror.co.uk/sport/football/news/chelsea-made-neymar-transfer-offer-21928879", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21928872.ece/ALTERNATES/s1200/0_FILE-PHOTO-Paris-St-Germains-Neymar-celebrates-scoring-in-Coupe-de-France-semi-final-v-Olympique-L.jpg", "publishedAt": "2020-04-26T14:41:27Z", "content": "Neymar's former agent Wagner Ribeiro has confirmed Chelsea once made a serious offer to sign the Brazilian superstar. \r\n The PSG forward has had no shortage of admirers throughout his career, and it was back when he was learning his trade at Santos that Chels… [+1917 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Jofra Archer: England World Cup winner finds medal in guest bedroom - BBC Sport", "description": "England World Cup winner Jofra Archer has finally found the medal he lost in his house move.", "url": "https://www.bbc.co.uk/sport/cricket/52434308", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/00E3/production/_111972200_52434308.jpg", "publishedAt": "2020-04-26T14:28:06Z", "content": "Jofra Archer with World Cup trophy and medal\r\nThe old saying goes that a missing object is always in the last place you look. For World Cup winner Jofra Archer, that was in his guest bedroom.\r\nArcher helped make English cricket history when he bowled the supe… [+885 chars]"}, {"source": {"id": null, "name": "Derbytelegraph.co.uk"}, "author": "Josh Challies, Jordan Blackwell", "title": "Derby County at greater risk of Championship relegation in EFL's proposed 2020-21 plan - Derbyshire Live", "description": "Derby County will have a greater chance of dropping down a division next term if the EFL chooses a contingency plan that will see no clubs relegated this season", "url": "https://www.derbytelegraph.co.uk/sport/football/football-news/derby-county-greater-risk-championship-4080140", "urlToImage": "https://i2-prod.derbytelegraph.co.uk/incoming/article3800792.ece/ALTERNATES/s1200/0_Cocu.jpg", "publishedAt": "2020-04-26T14:07:00Z", "content": "Derby County could be at a greater risk of Championship relegation next season if a proposed EFL plan goes through.\r\nWhile the EFL is committed to completing the season across all three of their divisions, the challenges of doing so increase lower down the le… [+1164 chars]"}, {"source": {"id": null, "name": "Boxingscene.com"}, "author": null, "title": "Breazeale: Fury Might Stop Wilder Even Sooner In Third Fight Than In Rematch - BoxingScene.com", "description": "After what Dominic Breazeale witnessed February 22, the heavyweight contender cannot see the third Tyson Fury-Deontay Wilder fight unfolding more favorably for Wilder. In fact, Breazeale wouldn’t be surprised if Fury defeats Wilder even easier in their third …", "url": "https://www.boxingscene.com/breazeale-fury-stop-wilder-even-sooner-third-fight-rematch--148505", "urlToImage": "https://photo.boxingscene.com/uploads/fury-wilder-rematch%20(12).jpg", "publishedAt": "2020-04-26T13:35:00Z", "content": "After what Dominic Breazeale witnessed February 22, the heavyweight contender cannot see the third Tyson Fury-Deontay Wilder fight unfolding more favorably for Wilder.\r\nIn fact, Breazeale wouldn’t be surprised if Fury defeats Wilder even easier in their third… [+2746 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Gabriel Baumgaertner", "title": "NFL draft winners and losers: Ravens' wisdom to the new Aaron Rodgers - The Guardian", "description": "This year’s event was a welcome tonic to fans deprived of live sports. But not every team covered themselves in glory over the weekend", "url": "https://www.theguardian.com/sport/2020/apr/26/nfl-draft-winners-and-losers-ravens-wisdom-to-the-new-aaron-rodgers", "urlToImage": "https://i.guim.co.uk/img/media/caa42ea2a8bef1a3c03d779756058d8eb94d6d23/0_154_4264_2560/master/4264.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a0b4bb3af8b0761de903ff83f7f3b649", "publishedAt": "2020-04-26T13:27:00Z", "content": "The 2020 NFL draft wasnt quite a live sporting event, but it was enough to distract fans from the global pandemic that has kept major leagues indefinitely suspended. Here are the teams that we think did the best and worst jobs of improving their future.\r\nWinn… [+6715 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Jake Polden", "title": "Cristiano Ronaldo's telling reaction to Lionel Messi winning sixth Ballon d'Or award - Mirror Online", "description": "Last year's Ballon d'Or ceremony was one of the most important in recent history because it separated Lionel Messi and Cristiano Ronaldo - perhaps even for good", "url": "https://www.mirror.co.uk/sport/football/news/cristiano-ronaldos-telling-reacting-lionel-21928148", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21928154.ece/ALTERNATES/s1200/0_Screen-Shot-2020-04-26-at-085626.jpg", "publishedAt": "2020-04-26T12:43:40Z", "content": "Lionel Messi or Cristiano Ronaldo?\r\nIt's one of football's biggest debates, with fans on both side of the fence putting forward convincing arguments as to why their favourite is the best player on the planet.\r\nThe careers of the two footballing Goliaths have … [+1698 chars]"}, {"source": {"id": "talksport", "name": "TalkSport"}, "author": "Oliver Dawnay", "title": "Tony Cascarino lauds Roman Abramovich’s ‘incredible’ ownership of Chelsea and claims Blues chief has led by ex - talkSPORT.com", "description": "", "url": "http://talksport.com/football/699154/tony-cascarino-roman-abramovichs-chelsea-coronavirus/", "urlToImage": "https://talksport.com/wp-content/uploads/sites/5/2019/02/Abramovich.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-04-26T12:40:37Z", "content": "talkSPORT host Tony Cascarino has lauded Chelsea owner Roman Abramovich for the ‘incredible’ way he has run the club since his takeover in 2003.\r\nSince buying the club, the Blues have been one of the most successful clubs in England, winning five Premier Leag… [+3627 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Charlie Malam", "title": "Arsenal have Pierre-Emerick Aubameyang transfer hope as Chelsea consider raiding rivals - Express", "description": "Chelsea are keeping tabs on Pierre-Emerick Aubameyang, who could leave Arsenal at the end of the season.", "url": "https://www.express.co.uk/sport/football/1274028/Arsenal-news-Pierre-Emerick-Aubameyang-transfer-hope-Chelsea-Premier-League", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/67/750x445/1274028.jpg", "publishedAt": "2020-04-26T12:17:30Z", "content": "The Arsenal captain is said to be happy in London and it is added that he has not sought to force an exit - at least not yet.\r\nThe north London club had pushed talks back until the end of the season but with the coronavirus pandemic causing heavy disruption t… [+918 chars]"}, {"source": {"id": null, "name": "Thecelticstar.com"}, "author": "Lubo98", "title": "‘This is the best team I’ve played with’, Christopher Jullien - The Celtic Star", "description": "CHRISTOPHER JULLIEN has discussed the prospect of returning to football without supporters, his goal against Rangers and how much he is loving life in Glasgow with Celtic in a wide ranging interview.", "url": "https://thecelticstar.com/this-is-the-best-team-ive-played-with-christopher-jullien/", "urlToImage": "https://icdn.thecelticstar.com/wp-content/uploads/2019/12/LCF_RANGERS_CELTIC_1765.jpeg", "publishedAt": "2020-04-26T12:09:48Z", "content": "CHRISTOPHER JULLIEN has discussed the prospect of returning to football without supporters, his goal against Rangers and how much he is loving life in Glasgow with Celtic in a wide ranging interview. Jullien has become a favourite since arriving from Toulouse… [+4593 chars]"}, {"source": {"id": null, "name": "Racingpost.com"}, "author": "Jonathan Harding", "title": "Redemption for Zac Purton as Exultant claims the QEII Cup with dominant display - Racing Post", "description": "Exultant bounced back to form with a commanding display to land the QEII Cup under top jockey Zac Purton at Sha Tin on Sunday", "url": "https://www.racingpost.com/news/redemption-for-purton-as-exultant-claims-the-qeii-cup/432448", "urlToImage": null, "publishedAt": "2020-04-26T12:07:00Z", "content": "Exultant bounced back to form with a commanding display to land the Group 1 QEII Cup under Zac Purton at Sha Tin on Sunday.\r\nSix-year-old Exultant, who finished second in the Group 1 last year, was narrowly beaten on his previous start but made no mistake thi… [+1930 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Leicester fan jokes with James Maddison over Man Utd transfer during video call - Metro.co.uk", "description": "Will the midfielder still be playing his football at the King Power Stadium next season?", "url": "https://metro.co.uk/2020/04/26/leicester-fan-jokes-james-maddison-manchester-united-transfer-move-12611537/", "urlToImage": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2020/04/Screen-Shot-2020-04-26-at-12.12.55-7f77_1587902142.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "publishedAt": "2020-04-26T11:53:34Z", "content": "James Maddison has been heavily linked with Manchester United in recent months (Picture: Getty)\r\nArdent Leicester fan Roy Fellows was given the shock of his life as James Maddison and BT Sport dropped in with a surprise video call this weekend and he simply c… [+3000 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Mark McDougall", "title": "Ann Budge makes doomsday 2020 SPFL prediction as Hearts chief explains need for wage cut - Daily Record", "description": "Budge has tried to get players to agree a wage cut and believes it's a necessity to survive.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/ann-budge-makes-doomsday-2020-21928574", "urlToImage": "https://i2-prod.dailyrecord.co.uk/incoming/article4739417.ece/ALTERNATES/s1200/1_JS42119887.jpg", "publishedAt": "2020-04-26T11:21:28Z", "content": "Hearts owner Ann Budge insists it's vital players agree a wage cut because a deferral just pushes the problem further down the line. \r\n The Tynecastle chief has also warned that she doesn't believe that football will be played in front of a normal crowd for t… [+2608 chars]"}, {"source": {"id": null, "name": "Pinkun.com"}, "author": "David Freezer", "title": "Norwich City chief will not consider return from coronavirus shutdown until players feel safe | Norwich City News - PinkUn", "description": "Everyone involved in football may be frustrated by the coronavirus shutdown but Norwich City will not contemplate a restart until their players are satisfied they are not putting their health at risk.", "url": "https://www.pinkun.com/norwich-city/city-chief-prioritises-players-health-1-6623934", "urlToImage": "https://www.pinkun.com/polopoly_fs/1.6623936!/image/image.jpg", "publishedAt": "2020-04-26T11:05:29Z", "content": "Norwich City's players will have health concerns which must be satisfied before they can start training and playing \r\nPicture: Paul Chesterton/Focus Images\r\nPaul Chesterton\r\nEveryone involved in football may be frustrated by the coronavirus shutdown but Norwi… [+2447 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Tom Brady: Tampa mayor Jane Castor writes witty letter to Buccaneers - BBC News", "description": "The mayor of Tampa hints she is open to renaming the Tampa Bay area as she writes a witty apology to Tom Brady after he is thrown out of a city park.", "url": "https://www.bbc.co.uk/sport/american-football/52431025", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/5CA5/production/_111871732_tom_brady_getty.jpg", "publishedAt": "2020-04-26T10:29:22Z", "content": "Media playback is not supported on this device\r\nWatch: Tom Brady's top 10 moments\r\nOne minute Tom Brady is being thrown out of a Tampa park, the next the city's mayor is cheerfully apologising and hinting the area could one day be renamed if the quarterback d… [+1899 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "What about players with uncertain futures amid Scottish football chaos? - BBC News", "description": "Amid the furore in Scottish football the players, many of whom are out of contract, face uncertainty, so what do they think about the current crisis?", "url": "https://www.bbc.co.uk/sport/football/52430876", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/2CBF/production/_111955411_playersgraphic.jpg", "publishedAt": "2020-04-26T10:15:02Z", "content": "Scotland striker Lawrence Shanland knows what it's like to be without a club and says out of contract players need help\r\nAround 500 players in Scottish football become free agents at the end of every season and, with the coronavirus pandemic inflicting dire f… [+4925 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Barney Ronay", "title": "World Cup questions: Were England robbed by Argentina at Mexico 86? - The Guardian", "description": "With the help of the Fifa archive we rewatch a series of memorable games in search of answers we didn’t find at the time", "url": "https://www.theguardian.com/football/2020/apr/26/world-cup-questions-were-england-robbed-by-argentina-at-mexico-86", "urlToImage": "https://i.guim.co.uk/img/media/9515f356afd7e57eb5d1e1768871cc032e747758/0_304_2048_1228/master/2048.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e0bb8e6b3d76af7d910366029911bacf", "publishedAt": "2020-04-26T10:03:00Z", "content": "In his brilliant, dashed-off book U and I the novelist Nicholson Baker invented something called closed book examination. This involves taking a much-cherished object in his case the books of John Updike and writing down everything you can remember about it w… [+15495 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Tom Leach", "title": "Raheem Sterling explain how relationship with his Liverpool hero Steven Gerrard has changed - Liverpool Echo", "description": "Sterling spent five years on Merseyside with the Reds, climbing from a highly-rated youth prospect poached from QPR to the club's most exciting first-team player.", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/steven-gerrard-raheem-sterling-liverpool-18150425", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article8788047.ece/ALTERNATES/s1200/JS58484633.jpg", "publishedAt": "2020-04-26T09:45:30Z", "content": "Manchester City star Raheem Sterling has described how his relationship with Liverpool legend Steven Gerrard has developed from childhood hero status to nothing more thnt a professional rival. \r\n The 25-year-old England forward was telling BBC Radio 5 Live al… [+1394 chars]"}, {"source": {"id": null, "name": "Planetf1.com"}, "author": "", "title": "McLaren receive £300million cash injection - Planet F1", "description": "The McLaren Group have confirmed a cash injection of £300m from its shareholders as they look to navigate through the COVID-19 pandemic.", "url": "https://www.planetf1.com/news/mclaren-300million-cash-injection/", "urlToImage": "https://d3cm515ijfiu6w.cloudfront.net/wp-content/uploads/2020/02/19204111/McLaren-F1-logo.jpg", "publishedAt": "2020-04-26T09:14:12Z", "content": "The McLaren Group have confirmed a cash injection of £300m from its shareholders as they look to navigate through the COVID-19 pandemic.\r\nOn top of the investment from its shareholders, McLaren are talking to third parties about boosting its working capital.\r… [+2033 chars]"}, {"source": {"id": null, "name": "Bournemouthecho.co.uk"}, "author": "Dan Rose", "title": "Premier League inching closer to televised return behind closed doors - Bournemouth Echo", "description": "THE Premier League is in discussions with UK rights holders about how best to broadcast the season's remaining fixtures as the campaign edges closer…", "url": "https://www.bournemouthecho.co.uk/sport/18406283.premier-league-inching-closer-televised-return-behind-closed-doors/", "urlToImage": "https://www.bournemouthecho.co.uk/resources/images/11171125/", "publishedAt": "2020-04-26T09:00:00Z", "content": "THE Premier League is in discussions with UK rights holders about how best to broadcast the season's remaining fixtures as the campaign edges closer to a return behind closed doors, the PA news agency understands.\r\nIt is six weeks since the English top-flight… [+1606 chars]"}, {"source": {"id": null, "name": "Thescottishsun.co.uk"}, "author": "Alan Nixon", "title": "Ex-Celtic boss Rodgers eyes up cut-price move for Rangers star Morelos - The Scottish Sun", "description": "", "url": "http://www.thescottishsun.co.uk/sport/football/5531346/celtic-rodgers-transfer-rangers-morelos/", "urlToImage": "https://www.thescottishsun.co.uk/wp-content/uploads/sites/2/2020/04/pmrodgers.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-04-26T08:40:56Z", "content": "BRENDAN RODGERS is on red alert to swoop for Rangers strike star Alfredo Morelos.\r\nThe Leicester boss could pounce with a cut-price bid when the Covid-19 crisis loosens its grip on football.\r\n Rangers ace Alfredo Morelos could move on this summerCredit: Willi… [+1801 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Rishi Karthikeyan", "title": "“He Has Never Cooked For Me” – Rafael Nadal Unsure If Roger Federer Can Cook - Essentially Sports", "description": "What skill would be the easiest one to teach Roger Federer? Rafael Nadal has answered this question in a recent Twitter post. Check it out.", "url": "https://www.essentiallysports.com/he-has-never-cooked-for-me-before-rafael-nadal-unsure-if-roger-federer-can-cook-atp-tennis-news/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200426135723/5b76c0f30ce5f51f008b56bd.jpg", "publishedAt": "2020-04-26T08:33:00Z", "content": "Swiss Maestro Roger Federer has demonstrated his amazing skill at the sport of tennis throughout his career. But what other skill would be easy for him to learn, to add to this? Let’s hear Rafael Nadal answer this question in a recent Twitter post.\r\nthe og qu… [+1691 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "World Rugby must not be afraid to act and lead - here's my 10-point plan to save the sport - Telegraph.co.uk", "description": "The imminent appointment of World Rugby's chairman has highlighted, in the current climate, the very real opportunities for appraisal and change in the global game.", "url": "https://www.telegraph.co.uk/rugby-union/2020/04/26/world-rugby-must-not-afraid-act-lead-10-point-plan-save-sport/", "urlToImage": "https://www.telegraph.co.uk/content/dam/rugby-union/2020/01/30/TELEMMGLPICT000214877760_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg?impolicy=logo-overlay", "publishedAt": "2020-04-26T07:00:00Z", "content": "The imminent appointment of World Rugby's chairman has highlighted, in the current climate, the very real opportunities for appraisal and change in the global game.\r\nA pivotal moment in many respects. I really hope the coming weeks and months will see all inv… [+1459 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Abhishek Bharadwaj", "title": "Lewis Hamilton: Former F1 Driver Believes Hamilton’s Future Depends on Toto Wolff - Essentially Sports", "description": "Former F1 driver Marc Surer believes the Mercedes and Lewis Hamilton partnership hinges on Toto Wolff's next move in Formula 1.", "url": "https://www.essentiallysports.com/f1-news-lewis-hamilton-former-f1-driver-believes-hamiltons-future-depends-on-toto-wolff/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200426120150/wolf-1.jpg", "publishedAt": "2020-04-26T06:40:00Z", "content": "Former F1 driver Marc Surer believes Lewis Hamiltons contract extension with Mercedes hinges on Toto Wolffs next move. Surer is of the opinion that Lewis Hamilton will remain at Mercedes should Toto Wolff do the same. Wolffs future at Mercedes has been a topi… [+2307 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nNick Hoult,", "title": "ECB should become bank to help cricket survive coronavirus crisis, says report - Telegraph.co.uk", "description": "Exclusive: Catastrophic financial future for the counties can be avoided if governing body borrows against TV contract to lend to 18 clubs", "url": "https://www.telegraph.co.uk/cricket/2020/04/26/exclusive-ecb-should-become-counties-bank-help-game-survive/", "urlToImage": "https://www.telegraph.co.uk/content/dam/cricket/2020/04/25/TELEMMGLPICT000196449772-xlarge_trans_NvBQzQNjv4BqBIhf9vY3F0gQVGEB0QvnDpxWLfs5mAvkbXYQqrLnBas.jpeg?imwidth=1200", "publishedAt": "2020-04-26T06:30:00Z", "content": "The England &amp; Wales Cricket Board should become a bank lending money to its counties to help the game survive enormous losses caused by the coronavirus pandemic, according to a leading sports advisory firm.\r\nA report by Oakwell Sports Advisory, seen by Te… [+1352 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Alex Richards", "title": "Diogo Jota crowned Premier League's best FIFA 20 player after five-day charity tournament - Mirror Online", "description": "The tournament, spread across five days, led to Wolves' Portuguese forward Diogo Jota meeting Liverpool's Trent Alexander-Arnold in the final of the ePremier League Invitational", "url": "https://www.mirror.co.uk/sport/football/news/breaking-premier-leagues-best-fifa-21926048", "urlToImage": "https://i2-prod.mirror.co.uk/article21926191.ece/ALTERNATES/s1200/0_Screen-Shot-2020-04-25-at-165656.jpg", "publishedAt": "2020-04-26T03:33:13Z", "content": "It was football, but not quite as we know it, as Wolves striker Diogo Jota was crowned the Premier League's best FIFA 20 player after claiming victory in the ePremier League invitational charity tournament.\r\nAfter a five-day tournament, he claimed a golden go… [+2465 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Will McGee", "title": "Army veteran meant to be running London Marathon is doing the 26-mile race in his garden - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11482614/army-veteran-garden-marathon/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/04/NINTCHDBPICT000579317414-e1587862900283.jpg?strip=all&quality=100&w=523&h=737&crop=1", "publishedAt": "2020-04-26T02:04:12Z", "content": "ARMY veteran Oli Doherty was meant to be running the London Marathon today but after it was postponed hes now doing the 26 mile run in his back garden.\r\nThe 39-year-old, who now works as a lawyer for The Sun, is raising money for Harrys Giant Pledge.\r\n Army v… [+748 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Who is the greatest British manager? - BBC Sport", "description": "BBC Sport's chief football writer has made a shortlist of the greatest post-war British managers, now it's turn to vote for the best.", "url": "https://www.bbc.co.uk/sport/football/52371056", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/F708/production/_111904236_managers.jpg", "publishedAt": "2020-04-26T01:32:45Z", "content": "Who do you think is Britain's greatest manager of the post-war era\r\nIt's one of those debates that is very difficult to win. Just who is Britain's greatest post-war manager?\r\nFrom a World Cup win, to European successes, to lifting domestic titles, there are a… [+17447 chars]"}, {"source": {"id": null, "name": "Teamtalk.com"}, "author": null, "title": "Man Utd transfer stance revealed on Solskjaer favourite Koulibaly - Teamtalk.com", "description": "The chances of seeing Napoli superstar Kalidou Koulibaly in a Man Utd shirt have been revealed after a recent report outlined the club's transfer window intentions.", "url": "https://www.teamtalk.com/news/man-utd-stance-revealed-solskjaer-favourite-koulibaly", "urlToImage": "https://d3vlf99qeg6bpx.cloudfront.net/content/uploads/2019/11/27201242/Roberto-Firmino-Kalidou-Koulibaly-Liverpool-Napoli.jpg", "publishedAt": "2020-04-25T17:44:53Z", "content": "The chances of seeing Napoli superstar Kalidou Koulibaly in a Man Utd shirt have been revealed after a recent report outlined the club’s transfer window intentions.\r\nThe Senegalese international, 28, has developed into one of the world’s premier centre-halves… [+2129 chars]"}]}