{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Phil Thomas", "title": "Jadon Sancho clause could see Man City hike price and start bidding war for Chelsea and Man Utd transfer - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11480888/jadon-sancho-transfer-clause-man-city-utd-chelsea/", "urlToImage": null, "publishedAt": "2020-04-26T00:26:22Z", "content": "MANCHESTER CITY can land a bigger jackpot if they force a Jadon Sancho bidding war this summer.\r\nThe England winger, 20, is high on the wanted list for Manchester United and Chelsea and a £100million fee was being quoted before the lockdown.\r\n A clause in San… [+1264 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Theo Squires", "title": "Liverpool problem position Jurgen Klopp still hasn't found answer to and why that needs to change - Liverpool Echo", "description": "Jurgen Klopp might be about to address a problem position that has been troubling Liverpool since he first arrived at the club", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-problem-position-jurgen-klopp-18126046", "urlToImage": null, "publishedAt": "2020-04-26T00:04:31Z", "content": "In Trent Alexander Arnold and Andy Robertson, Jurgen Klopp boasts two of the best full-backs in world football.\r\nThe duo have reinvented how to play the position in the past two seasons, recording an astonishing 50 assists between them as Liverpool lifted the… [+4407 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Paul Gorst", "title": "Unpaid wages and baffling criticism - how Loris Karius Besiktas loan from Liverpool became a nightmare - Liverpool Echo", "description": "Loris Karius' loan move was meant to herald a fresh start, but it hasn't quite worked out like that, writes Paul Gorst", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/unpaid-wages-baffling-criticism-how-18150220", "urlToImage": null, "publishedAt": "2020-04-26T00:02:14Z", "content": "It was supposed to be a fresh start for Loris Karius.\r\nWhen the Liverpool goalkeeper traded Merseyside for Turkey in August 2018, the loan deal the Reds struck with Besiktas was meant to be one that breathed fresh life into a career that was flatlining.\r\nJust… [+5349 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Elliott Jackson", "title": "Liverpool legend Steven Gerrard compares Jordan Henderson to Paul Scholes - Liverpool Echo", "description": "The Liverpool captain is in the running to win the PFA Player of the Year award this season", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/gerrard-makes-henderson-scholes-comparison-18150146", "urlToImage": null, "publishedAt": "2020-04-26T00:02:09Z", "content": "Steven Gerrard has claimed that Liverpool captain Jordan Henderson is now running matches in the same fashion as former Manchester United midfielder Paul Scholes.\r\nHenderson has had a fantastic season for the Reds who sit top of the Premier League table by 25… [+1556 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Kathryn Batte For Mailonline", "title": "Inter Milan 'lead race for £56m Pierre-Emerick Aubameyang' with Arsenal ready to listen to offers - Daily Mail", "description": "The Gunners are thought to be willing to listen to offers for the £200,000-a-week star who is out of contract in 2021 with a new deal proving difficult to agree.", "url": "https://www.dailymail.co.uk/sport/football/article-8257511/Inter-Milan-lead-race-56m-Pierre-Emerick-Aubameyang-Arsenal-ready-listen-offers.html", "urlToImage": null, "publishedAt": "2020-04-25T23:51:12Z", "content": "Inter Milan lead the race to sign Arsenal striker Pierre-Emerick Aubameyang, according to reports.\r\nThe Gunners are thought to be willing to listen to offers for the £200,000-a-week star who is out of contract in 2021 with a new deal proving difficult to agre… [+1347 chars]"}, {"source": {"id": null, "name": "Theguardian.comfootball"}, "author": "Guardian staff reporter", "title": "Everton 'appalled' after Moise Kean hosts coronavirus lockdown party - The Guardian", "description": "Everton have labelled Moise Kean’s actions ‘unacceptable’ after he flouted coronavirus lockdown restrictions", "url": "https://amp.theguardian.comfootball/2020/apr/26/everton-appalled-moise-kean-hosts-coronavirus-lockdown-party", "urlToImage": null, "publishedAt": "2020-04-25T23:14:54Z", "content": "Everton have labelled Moise Keans actions unacceptable after he flouted coronavirus lockdown restrictions.\r\nThe striker filmed himself partying at home with guests in a breach of social distancing regulations during the coronavirus pandemic. Kean, who joined … [+1170 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Neil Moxley, John Richardson", "title": "Kevin Keegan lined up for Newcastle return when £300million Saudi takeover goes through - Mirror Online", "description": "EXCLUSIVE: The 69-year-old made 78 appearances for the Magpies as a player and also had two spells in charge as a manager at St James' Park", "url": "https://www.mirror.co.uk/sport/football/news/kevin-keegan-lined-up-newcastle-21926877", "urlToImage": null, "publishedAt": "2020-04-25T22:16:16Z", "content": "Kevin Keegan is being lined for a sensational return to Newcastle and the Saudi takeover could even be rubber-stamped later this week. \r\nThe man idolised as The Messiah by the Toon Army will be invited to take up an ambassadorial role when the £300m buy-out i… [+2466 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Michael Gannon", "title": "Roy MacGregor tells Rangers to 'put up or shut up' as Ross County chief demands to see alleged evidence - Daily Record", "description": "The Ross County chairman is fed up of the \"tedious\" stand off between Rangers and the SPFL.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/roy-macgregor-tells-rangers-put-21926481", "urlToImage": null, "publishedAt": "2020-04-25T22:10:12Z", "content": "Roy MacGregor has told Rangers to put up or shut up in their crusade against the SPFL.\r\nThe Ibrox club has stepped up their demands for an independent inquiry in to the voting process behind the decision to call the lower leagues with a view to drawing a line… [+2535 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Alex Dicken", "title": "Aston Villa linked with shock move to replace Dean Smith - reports - Birmingham Live", "description": "Aston Villa news - Reports have emerged in the national press to suggest AVFC are keeping tabs on another manager", "url": "https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-news-sean-dyche-18151836", "urlToImage": null, "publishedAt": "2020-04-25T22:07:29Z", "content": "Aston Villa have been linked with a shock interest in Burnley manager Sean Dyche. \r\nLike the rest of the Premier League, Villa are currently on lockdown and waiting to learn when their season will resume. \r\nDean Smith and his players have a huge task awaiting… [+858 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Alex Dicken", "title": "Leeds United could sign another Wolves star if they’re promoted - reports - Birmingham Live", "description": "Wolverhampton Wanderers transfer news - John Ruddy has played second fiddle to Rui Patricio over the past two seasons", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/leeds-united-transfer-john-ruddy-18151407", "urlToImage": null, "publishedAt": "2020-04-25T22:07:27Z", "content": "Leeds United will be offered Wolves goalkeeper John Ruddy ahead of their potential Premier League return, according to reports.\r\nLeeds are in line to seal promotion from the Championship once the football season resumes, with ex-Wolves stars Barry Douglas and… [+634 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Alex Dicken", "title": "Man Utd chief Ed Woodward makes transfer revelation that concerns Jack Grealish - Birmingham Live", "description": "Aston Villa transfer news - Man United chief Ed Woodward has made some interesting claims concerning their pursuit of transfer targets", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/manchester-united-aston-villa-grealish-18151320", "urlToImage": null, "publishedAt": "2020-04-25T22:07:25Z", "content": "Manchester United could be forced to put their pursuit of Jack Grealish on hold, Ed Woodward has warned. \r\nUnited boss Ole Gunnar Solskjaer has made signing Aston Villa captain Grealish a top priority heading into the next window. \r\nThe 24-year-old playmaker … [+1083 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Ryan Taylor", "title": "What Timo Werner said about Man Utd transfer two years ago now says more about Liverpool - Express", "description": "Timo Werner looks set to move to the Premier League in the future, but his stance on which club looks like it may have changed.", "url": "https://www.express.co.uk/sport/football/1273897/Liverpool-transfer-news-Timo-Werner-said-Man-Utd-move-comments-gossip", "urlToImage": null, "publishedAt": "2020-04-25T21:52:43Z", "content": null}, {"source": {"id": null, "name": "Football.london"}, "author": "Andrew Beasley", "title": "Chelsea's cause for concern in Champions League race with Man United when Premier League returns - Football.London", "description": "Frank Lampard's side are three points ahead of Manchester United in fourth place, with nine games of the 2019/20 Premier League season remaining", "url": "https://www.football.london/chelsea-fc/news/chelseas-cause-concern-champions-league-18118068", "urlToImage": null, "publishedAt": "2020-04-25T20:53:07Z", "content": "With football on hold, fans are waiting to see how the 2019/20 Premier League season will end. \r\nThe clubs are committed to completing the season properly if they can, so if football is given the all clear to resume then focus will swiftly switch to the remai… [+3373 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Report: Barcelona make Coutinho transfer decision that could impact Tottenham - The Spurs Web", "description": "Tottenham Hotspur's chances of landing Philippe Coutinho have just received a huge blow as the latest reports from Spain indicate that Barcelona have U-turned on their original plans to sell the star. Spurs have been linked with a move for Coutinho since it e…", "url": "https://www.spurs-web.com/spurs-news/report-barcelona-make-coutinho-transfer-decision-that-could-impact-tottenham/", "urlToImage": null, "publishedAt": "2020-04-25T20:38:46Z", "content": "Tottenham Hotspurs chances of landing Philippe Coutinho have just received a huge blow as the latest reports from Spain indicate that Barcelona have U-turned on their original plans to sell the star.\r\nSpurs have been linked with a move for Coutinho since it e… [+928 chars]"}, {"source": {"id": null, "name": "Eadt.co.uk"}, "author": "Andy Warren", "title": "Coronavirus: League One and League Two could be decided by promotion tournament | Ipswich Town FC and Suffolk & Essex Sport - East Anglian Daily Times", "description": "Promotion from both League One and League Two could be decided by mini tournaments involving eight teams, according to reports.", "url": "https://www.eadt.co.uk/sport/league-one-and-two-promotion-tournament-1-6624349", "urlToImage": null, "publishedAt": "2020-04-25T20:17:00Z", "content": "PUBLISHED: 21:17 25 April 2020 | UPDATED: 21:41 25 April 2020\r\nAndy Warren\r\nIpswich Town slipped from 1st to 10th in the League One table under Paul Lambert at the start of 2020. Photo: Pagepix\r\nPagepix Ltd 07976 935738\r\nPromotion from both League One and Lea… [+4435 chars]"}, {"source": {"id": null, "name": "Justarsenal.com"}, "author": "Admin Martin", "title": "Jose Mourinho phones Arsenal target to convince him to move to Tottenham instead - Just Arsenal News", "description": "Jose Mourinho is hoping to steal a march on Arsenal in their race for Thomas Meunier and has phoned the defender to join him at Spurs. Meunier is in the final months of his current PSG deal and it looks certain that he would leave the French capital.", "url": "https://www.justarsenal.com/jose-mourinho-phones-arsenal-target-to-convince-him-to-move-to-tottenham-instead/242913", "urlToImage": null, "publishedAt": "2020-04-25T20:15:37Z", "content": "Jose Mourinho is hoping to steal a march on Arsenal in the race for Thomas Meunier and has phoned the defender to join him at Spurs, claims the Daily Mail.\r\nMeunier is in the final months of his current PSG deal and it looks certain that he would leave the Fr… [+1045 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Daniel Murphy", "title": "Real Madrid stance on Erling Haaland hands transfer boost to Manchester United and more rumours - Manchester Evening News", "description": "Man Utd are continuing to be linked with a move for Erling Braut Haaland despite his January move to Borussia Dortmund and more gossip.", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/manchester-united-transfers-latest-haaland-18150546", "urlToImage": null, "publishedAt": "2020-04-25T19:55:14Z", "content": "Real Madrid have dropped their interest in Erling Braut Haaland, opening the door for Manchester United, according to reports.\r\nHaaland announced himself on the world stage this season with a freakishly impressive scoring-rate and brilliant displays in the Ch… [+1619 chars]"}, {"source": {"id": null, "name": "Bjpenn.com"}, "author": "Chris Taylor", "title": "Report | Khabib Nurmagomedov’s father hospitalized due to suspected pneumonia and flu - BJPENN.COM", "description": "The father of current UFC lightweight champion Khabib Nurmagomedov, Abdulmanap, has been hospitalized due to a suspected pneumonia and flu.", "url": "https://www.bjpenn.com/mma-news/khabib-nurmagomedov/report-khabib-nurmagomedovs-father-hospitalized-due-to-suspected-pneumonia-and-flu/", "urlToImage": null, "publishedAt": "2020-04-25T19:51:35Z", "content": "The father of current UFC lightweight champion Khabib Nurmagomedov, Abdulmanap, has been hospitalized due to a suspected pneumonia and flu.\r\nThe news comes from Ramazan Rabadanov, a sports commentator from Dagestan, Russia.\r\nSharing a pic of himself with Abdu… [+1621 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Mark Douglas", "title": "'Everyone hopes for it': Jetro Willems sends a transfer message to Newcastle United - Chronicle Live", "description": "Newcastle United loanee Jetro Willems says he absolutely wants to return to the club where he enjoyed a decent temporary spell", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/everyone-hopes-it-jetro-willems-18150981", "urlToImage": null, "publishedAt": "2020-04-25T19:50:04Z", "content": "Jetro Willems has re-stated his number one priority is to sign and play for Newcastle United in an impromptu Twitter question and answer session.\r\nThe popular wing-back had made a fine impression at St James Park before a serious injury suffered at the turn o… [+1177 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Real Madrid eye 'dream' Neymar transfer after Barcelona told funding deal is 'impossible' - Mirror Online", "description": "Real Madrid supremo Florentino Perez still hopes of a dream move for Neymar despite Barcelona's interest in re-signing the forward", "url": "https://www.mirror.co.uk/sport/football/news/real-madrid-eye-dream-neymar-21926057", "urlToImage": null, "publishedAt": "2020-04-25T19:18:28Z", "content": "Real Madrid president Florentino Perez \"still dreams\" of signing PSG star Neymar after previously missing out on the Brazilian.\r\nLos Blancos chased Neymar back when he was at Santos before losing out to rivals Barcelona.\r\nBut the Parisians secured his signatu… [+1793 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Arsenal players will be allowed back to club's training ground next week - Metro.co.uk", "description": "This is a very positive sign.", "url": "https://metro.co.uk/2020/04/25/arsenal-players-will-allowed-back-clubs-training-ground-next-week-12610468/", "urlToImage": null, "publishedAt": "2020-04-25T18:42:12Z", "content": "Arsenals players will be allowed back to the clubs London Colney training ground from next week (Picture: Getty)\r\nArsenals players will be allowed to return to train at London Colney from next week while Aston Villas squad have agreed a 25 per cent wage defer… [+2524 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Joseph Chapman", "title": "Robert Earnshaw makes startling West Brom admission about that day at Charlton - Birmingham Live", "description": "Earnshaw was considering his future and after being informed by Bryan Robson that he’d been left out of the starting XI once again in London that day, it was a mindset that only intensified", "url": "https://www.birminghammail.co.uk/sport/football/football-news/robert-earnshaw-makes-startling-west-18150125", "urlToImage": null, "publishedAt": "2020-04-25T18:39:56Z", "content": "West Broms Great Escape hero Robert Earnshaw has revealed that he was actually thinking about leaving the club on the same day that he bagged an unforgettable hat-trick at Charlton Athletic.\r\n The former Albion striker was competing for a place in the startin… [+4514 chars]"}, {"source": {"id": null, "name": "Theguardian.comsport"}, "author": "Guardian staff reporter", "title": "NFL draft enters day three as 49ers acquire star tackle Trent Williams - The Guardian", "description": "The NFL draft entered its third and final day with Cincinnati selecting an Appalachian State linebacker on Saturday afternoon", "url": "https://amp.theguardian.comsport/2020/apr/25/nfl-draft-saturday-picks-day-three", "urlToImage": null, "publishedAt": "2020-04-25T18:34:00Z", "content": "Clunky at times, poignant at others, and exceptionally entertaining in spots, the NFL draft entered its third and final day with Cincinnati selecting an Appalachian State linebacker on Saturday.\r\nCommissioner Roger Goodell has insisted the sporting world need… [+2895 chars]"}, {"source": {"id": "talksport", "name": "TalkSport"}, "author": "Josh Fordham", "title": "Football news and transfer gossip: Everton make Philippe Coutinho loan bid, Paris Saint-Germain offer - talkSPORT.com", "description": "", "url": "http://talksport.com/football/698991/football-news-gossip-everton-coutinho-psg-united-pogba/", "urlToImage": null, "publishedAt": "2020-04-25T18:18:07Z", "content": "talkSPORT.com rounds up all the latest transfer news and football gossip from Saturdays papers and online\r\nDimitar Berbatov believes appointing Mauricio Pochettino as Newcastle manager would give the club the chance to sign players like Gareth Bale. A Saudi c… [+2582 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Ieuan Ivett For Mailonline", "title": "Roy Keane reveals he didn't warm to Rooney and Ferdinand during their time together at Man United - Daily Mail", "description": "Roy Keane admitted that he never got on well with former Manchester United teammates Wayne Rooney or Rio Ferdinand as he never understood their 'banter'.", "url": "https://www.dailymail.co.uk/sport/football/article-8256779/Roy-Keane-reveals-didnt-warm-Rooney-Ferdinand-time-Man-United.html", "urlToImage": null, "publishedAt": "2020-04-25T18:15:59Z", "content": "Roy Keane has admitted that he never got on well with former Manchester United team-mates Wayne Rooney or Rio Ferdinand as he never understood their 'banter'.\r\nFormer United skipper Keane, who is well known for not pulling any punches, revealed he did not mis… [+2357 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Frederick Clayton", "title": "Sissoko, Lamela, Vertonghen: The Tottenham players Mauricio Pochettino could lure to Newcastle - Football.London", "description": "Pochettino has been touted to take the reigns at St James' Park, but which of his former Spurs players would he reacquaint himself with?", "url": "https://www.football.london/tottenham-hotspur-fc/transfer-news/tottenham-newcastle-takeover-pochettino-players-18138517", "urlToImage": null, "publishedAt": "2020-04-25T18:03:40Z", "content": "Newcastle are on the verge of a £300m takeover by a Saudi-backed consortium and an announcement is expected soon after an agreement was reached between Mike Ashley and PCP Capital Partners.\r\n And the Daily Mirror reports that Newcastles new owners want to bri… [+3878 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "FULL GAME: WEST HAM V EVERTON | 21 SEPTEMBER 2013 - Everton Football Club", "description": "Subscribe to Everton Football Club's official YouTube Channel: http://bit.ly/2wtCEbB Follow us on Facebook: http://facebook.com/everton Follow us on Twitter:...", "url": "https://www.youtube.com/watch?v=7U1emuqMqzE", "urlToImage": null, "publishedAt": "2020-04-25T18:00:14Z", "content": null}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Joe Rimmer", "title": "Luis Alberto masterstroke could make Liverpool millions this summer - Liverpool Echo", "description": "Luis Alberto's Liverpool departure may have gone under the radar - but a clause could result in Liverpool making millions", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-luis-alberto-transfer-clause-17881222", "urlToImage": null, "publishedAt": "2020-04-25T17:56:54Z", "content": "Michael Edwards doesn't do interviews. The Liverpool sporting director just doesn't want the headlines.\r\nNor does Edwards appear publicly, and anyone searching for a picture of him will only find a select few.\r\nYou won't find much about him on the club site, … [+3728 chars]"}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "Petec21", "title": "Raheem Sterling: There’s Only One Shirt I Want - Bitter and Blue", "description": "City Winger Wants Barca Legend Shirt", "url": "https://bitterandblue.sbnation.com/2020/4/25/21236328/raheem-sterling-theres-only-one-shirt-i-want", "urlToImage": null, "publishedAt": "2020-04-25T17:48:16Z", "content": "Manchester City winger Raheem Sterling has revealed the one shirt he wants to obtain from his playing days for his collections. Despite gathering a collection of medals, trophies and players shirts, Sterling has said the one he really wants is a shirt off the… [+1452 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "Seb Jenkins", "title": "Report: Tottenham 'ramp up bid' to sign 21-year-old Premier League playmaker - The Spurs Web", "description": "Football Insider have now reported that Tottenham Hotspur are ramping up their bid to sign Norwich City playmaker, Todd Cantwell, this summer. The 21-year-old attacker caught the eye in his first Premier League season this year as he recorded six goals across…", "url": "https://www.spurs-web.com/spurs-news/report-tottenham-ramp-up-bid-to-sign-21-year-old-premier-league-playmaker/", "urlToImage": null, "publishedAt": "2020-04-25T17:43:13Z", "content": "Football Insider have now reported that Tottenham Hotspur are ramping up their bid to sign Norwich City playmaker, Todd Cantwell, this summer.\r\nThe 21-year-old attacker caught the eye in his first Premier League season this year as he recorded six goals acros… [+790 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Alec Fenn For Mailonline", "title": "PSG 'table bid for Paul Pogba and offer flop Angel Di Maria AND Julian Draxler' to Manchester United - Daily Mail", "description": "Pogba's future at United is uncertain after he revealed his desire to leave the club last summer and continued links with other European sides, as well as a lengthy absence with a mysterious ankle injury.", "url": "https://www.dailymail.co.uk/sport/football/article-8256663/PSG-table-bid-Paul-Pogba-offer-flop-Angel-Di-Maria-Julian-Draxler-Manchester-United.html", "urlToImage": null, "publishedAt": "2020-04-25T17:31:26Z", "content": "Paris Saint-Germain have reportedly made a bid for Manchester United's Paul Pogba but surprisingly offered Old Trafford flop Angel Di Maria as part of the deal.\r\nPogba's future at United is uncertain after he revealed his desire to leave the club last summer … [+2058 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "ePL Invitational: Diogo Jota crowned FIFA king after golden goal victory over Trent Alexander-Arnold - Sky Sports", "description": "Diogo Jota is the inaugural ePremier League Invitational champion after a golden goal win over Liverpool's Trent Alexander-Arnold.", "url": "https://www.skysports.com/football/news/11095/11978772/epl-invitational-diogo-jota-crowned-fifa-king-after-golden-goal-victory-over-trent-alexander-arnold", "urlToImage": null, "publishedAt": "2020-04-25T17:09:07Z", "content": "Diogo Jota is the inaugural ePremier League Invitational champion after a golden goal win over Liverpool's Trent Alexander-Arnold.\r\nFresh from beating Raheem Sterling with a golden goal himself in the semi-finals, Alexander-Arnold took the lead in the final w… [+728 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nDaniel Schofield,", "title": "Doubts grow over Agustin Pichot's plan for World Rugby revolution - Telegraph.co.uk", "description": "Campaign reveals contradictions in the former Argentina scrum-half's manifesto to replace Sir Bill Beaumont", "url": "https://www.telegraph.co.uk/rugby-union/2020/04/25/doubts-grow-agustin-pichots-plan-world-rugby-revolution/", "urlToImage": null, "publishedAt": "2020-04-25T16:55:00Z", "content": "Agustin Pichot likes to project himself as a white knight coming to rescue rugby in the moment of its greatest crisis.\r\nFrom announcing his candidacy for World Rugby chairman at the last minute, Pichot now has momentum firmly on his side in the race against i… [+1967 chars]"}, {"source": {"id": null, "name": "Racingpost.com"}, "author": "David Carr", "title": "Racing's return: what we know so far about how and when the sport will resume - Racing Post", "description": "There has been no racing in Britain since the behind-closed-doors meetings at Taunton and Wetherby on March 17, as the BHA called a halt until the end of April", "url": "https://www.racingpost.com/news/racings-return-what-we-know-so-far-about-how-and-when-the-sport-will-resume/432394", "urlToImage": null, "publishedAt": "2020-04-25T16:46:05Z", "content": "By David Carr \r\n UPDATED 5:46PM, APR 25 2020\r\nThere has been no racing in Britain since the behind-closed-doors meetings at Taunton and Wetherby on March 17, as the BHA called a halt to protect essential emergency services and the health and welfare of staff … [+4907 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Ian Doyle", "title": "Bobby Duncan, major setbacks and what happened next for Liverpool FA Youth Cup winners - Liverpool Echo", "description": "Exactly one year has passed since Liverpool lifted the FA Youth Cup against Manchester City", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/pep-lijnders-impressed-breakout-star-18143544", "urlToImage": null, "publishedAt": "2020-04-25T16:43:34Z", "content": "Champions League glory was more than a month away, but already Liverpool could celebrate claiming prestigious silverware.\r\nExactly a year has passed since the Reds claimed the FA Youth Cup for only the fourth time in their history.\r\nUnder the tutelage of coac… [+4773 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ashley Preece", "title": "Jack Grealish pokes fun at Birmingham City with blunt three-word message - Birmingham Live", "description": "Aston Villa on social media - Jack Grealish is Villa through and through and sarcastically had a dig at Birmingham City following a nostalgic video of James Milner's match-winning penalty 10 years ago", "url": "https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-jack-grealish-blues-18150166", "urlToImage": null, "publishedAt": "2020-04-25T16:40:16Z", "content": "Jack Grealish has claret and blue veins and, 10 years on from Aston Villa's 1-0 win over Blues, the skipper couldn't resist a pop at those across the Second City divide.\r\nJames Milner slammed home a controversial penalty in the 83rd minute after Gabby Agbonla… [+1059 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Paul Wilson", "title": "Premier League completion 'probably not realistic', says Dutch FA president - The Guardian", "description": "The KNVB president, who presided over the Dutch season being declared null and void, said he thought the English season will not restart but talks between the Premier League and authorities continued", "url": "https://www.theguardian.com/football/2020/apr/25/premier-league-completion-probably-not-realistic-says-dutch-fa-president-just-spee", "urlToImage": null, "publishedAt": "2020-04-25T16:14:58Z", "content": "The president of the Dutch football association, the KNVB, has cast doubt on the feasibility of the Premier League playing matches behind closed doors in June, even as the British government suggested it might be possible for some sports to resume within a fe… [+3288 chars]"}, {"source": {"id": null, "name": "Leicestermercury.co.uk"}, "author": "Jordan Blackwell", "title": "Leicester City's James Maddison makes new transfer promise as Manchester United circle - Leicestershire Live", "description": "The England international midfielder, who is a target for Manchester United, spoke to a Leicester City supporter about his future and his Champions League dream", "url": "https://www.leicestermercury.co.uk/sport/football/transfer-news/leicester-citys-james-maddison-makes-4079012", "urlToImage": null, "publishedAt": "2020-04-25T15:39:00Z", "content": "James Maddison has rejected talk of a summer transfer and has said he will stay at Leicester City.\r\nThe England international midfielder is a target for Manchester United after an excellent two seasons at the King Power Stadium.\r\nBut the 23-year-old, in talks… [+1424 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Jofra Archer loses Cricket World Cup medal after moving house - Sky Sports", "description": "Jofra Archer is searching for his 2019 Cricket World Cup winner's medal after losing it during a recent house move.", "url": "https://www.skysports.com/cricket/news/12123/11978696/jofra-archer-loses-cricket-world-cup-medal-after-moving-house", "urlToImage": null, "publishedAt": "2020-04-25T14:42:29Z", "content": "Jofra Archer is searching for his 2019 Cricket World Cup winner's medal after losing it during a recent house move.\r\nLast year's tournament was where Archer rose from relative obscurity to a household name, finishing as England's leading wicket-taker with 20 … [+1627 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Elliott Jackson", "title": "Dimitar Berbatov sends transfer warning to Newcastle with Man City comparison - Manchester Evening News", "description": "The former Manchester United striker has had his say on Newcastle's potential takeover.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/berbatov-newcastle-manchester-city-takeover-18147091", "urlToImage": null, "publishedAt": "2020-04-25T14:36:51Z", "content": "Dimitar Berbatov has insisted it will take time for Newcastle United to attract top players to the club.\r\nNewcastle are in talks over a potential Saudi Arabia-backed takeover. Manchester City, of course, were subject to a takeover of their own in 2008 which d… [+1174 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Kieran Lynch For Mailonline", "title": "'Tito, forever eternal': Barcelona pay tribute to Vilanova six years on from beloved coach's death - Daily Mail", "description": "Tito Vilanova died aged 45, on April 25, 2014, after a long battle with cancer that cut short the life of a coach in his prime. Vilanova played a part in Barcelona's most successful era.", "url": "https://www.dailymail.co.uk/sport/football/article-8256525/Tito-forever-eternal-Barcelona-pay-tribute-Vilanova-six-years-beloved-coachs-death.html", "urlToImage": null, "publishedAt": "2020-04-25T14:10:51Z", "content": "Barcelona have paid homage to their former head coach Tito Vilanova, six years following his death.   \r\nVilanova died aged 45 on April 25, 2014, after a long battle against parotid gland cancer that cut short the life of a coach in his prime.\r\nThe Spaniard's … [+2529 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Elliott Jackson", "title": "What Jurgen Klopp said to Liverpool before historic Barcelona comeback - Liverpool Echo", "description": "The Reds beat Barcelona 4-0 to reach the Champions League final", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/klopp-liverpool-talk-barcelona-comeback-18148913", "urlToImage": null, "publishedAt": "2020-04-25T14:08:58Z", "content": "James Milner has revealed what Jurgen Klopp said to his players in training before their unforgettable comeback against Barcelona in the Champions League. \r\nThe Reds remarkably beat the Spanish giants 4-0 at Anfield in the second leg of their Championship Lea… [+1744 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Liverpool vs Atletico Madrid under investigation following coronavirus outbreak - Irish Mirror", "description": "Liverpool's Champions League exit to Atletico Madrid is one of the last games to be played amid the coronavirus pandemic and has come in for plenty of criticism", "url": "https://www.mirror.co.uk/sport/football/news/liverpool-vs-atletico-madrid-under-21925450", "urlToImage": null, "publishedAt": "2020-04-25T13:42:35Z", "content": "Liverpool's Champions League match with Atletico Madrid is under investigation regarding its impact on the spread of coronavirus. \r\nThe last 16 clash took place on March 11 - the same day the World Health Organisation declared Covid-19 a global pandemic.\r\nSpa… [+1612 chars]"}, {"source": {"id": null, "name": "Dartsnews.com"}, "author": null, "title": "PDC issue statement regarding cheating allegations surrounding Klaasen in Home Tour - Dartsnews.com", "description": "Jelle Klaasen claimed Group Seven in the PDC Home Tour on Thursday night but cheating allegations were levelled at the former Lakeside champion", "url": "https://dartsnews.com/pdc-issue-statement-regarding-cheating-allegations-surrounding-klaasen-in-home-tour/", "urlToImage": null, "publishedAt": "2020-04-25T13:13:28Z", "content": "Jelle Klaasen claimed Group Seven in the PDC Home Tour on Thursday night but cheating allegations were levelled at the former Lakeside champion; regarding a 70 checkout during his match against Gabriel Clemens.\r\nDarts fans took to social media to say that the… [+906 chars]"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Daniel Marland", "title": "Cristiano Ronaldo Rejoining Man Utd This Summer ‘Would Not Be A Surprise’ - SPORTbible", "description": "This would be one of the biggest transfer stories of all time.", "url": "https://www.sportbible.com/football/football-news-transfers-ronaldo-rejoining-man-utd-this-summer-would-not-be-a-surprise-20200425", "urlToImage": null, "publishedAt": "2020-04-25T12:07:11Z", "content": "Manchester United completing the shock re-signing of Cristiano Ronaldo this summer 'would not be a surprise' according says to a top European club chief.\r\nThe 35-year-old has been linked with a move away from current club Juventus due to their current financi… [+2326 chars]"}, {"source": {"id": "talksport", "name": "TalkSport"}, "author": "Joe Coleman", "title": "David Haye considering incredible boxing comeback to fight the winner of Tyson Fury vs Anthony Joshua - talkSPORT.com", "description": "", "url": "http://talksport.com/sport/boxing/698874/haye-boxing-comeback-news-fight-tyson-fury-joshua/", "urlToImage": null, "publishedAt": "2020-04-25T11:56:55Z", "content": "David Haye has admitted he would only consider a return to boxing if he was guaranteed to fight the winner of Anthony Joshua vs Tyson Fury.\r\nHowever, the Bermondsey-born slugger admitted it was unlikely the call would ever come and says he was content with st… [+2425 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "James Benge", "title": "Dani Ceballos sets out his plans for Arsenal future as Edu monitors new signings - Football.London", "description": "The Spaniard is on loan at Arsenal until the end of the season", "url": "https://www.football.london/arsenal-fc/players/dani-ceballos-arsenal-transfer-madrid-18149648", "urlToImage": null, "publishedAt": "2020-04-25T11:37:44Z", "content": "Zinedine Zidane has assured Arsenal loanee Dani Ceballos that his future is at Real Madrid with the Gunners now facing the dilemma of replacing their on-loan playmaker next season.\r\nCeballos has performed impressively during an injury-afflicted season on loan… [+2162 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Report: Spurs could suffer major financial blow after UEFA decision - The Spurs Web", "description": "Tottenham Hotspur could be set to suffer a major financial blow in revenue generated from European football if the season is decided on a points-per-game basis, the Evening Standard report. It was revealed on Thursday that UEFA were considering using a points…", "url": "https://www.spurs-web.com/spurs-news/report-spurs-could-suffer-major-financial-blow-after-uefa-decision/", "urlToImage": null, "publishedAt": "2020-04-25T11:00:00Z", "content": "Tottenham Hotspur could be set to suffer a major financial blow in revenue generated from European football if the season is decided on a points-per-game basis, the Evening Standard report.\r\nIt was revealed on Thursday that UEFA were considering using a point… [+1358 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "UFC to stage three events in Florida in May - BBC News", "description": "UFC president Dan White announces UFC 249 for 9 May and two other events without fans next month.", "url": "https://www.bbc.co.uk/sport/mixed-martial-arts/52424303", "urlToImage": null, "publishedAt": "2020-04-25T10:17:54Z", "content": "Tony Ferguson will be in action at UFC 249 on 9 May at VyStar Veterans Memorial Arena in Jacksonville\r\nUFC president Dana White has announced plans for three events in Jacksonville, Florida, next month.\r\nThey will be closed to the public and \"produced with on… [+2003 chars]"}, {"source": {"id": null, "name": "Autosport.com"}, "author": "Pablo Elizalde", "title": "F1 News: Sainz Jr says losing 2020 season over coronavirus would be hard to accept - Autosport", "description": "McLaren driver Carlos Sainz Jr says the 2020 Formula 1 season being cancelled because of the coronavirus crisis would be a \"hard blow that would be difficult to accept\"", "url": "https://www.autosport.com/f1/news/149146/sainz-losing-20-f1-season-would-be-hard-to-accept", "urlToImage": null, "publishedAt": "2020-04-25T10:02:44Z", "content": "McLaren driver Carlos Sainz Jr says the 2020 Formula 1 season being cancelled because of the coronavirus crisis would be a \"hard blow that would be difficult to accept\". \r\nThe first nine races of the season have already been cancelled or postponed, with the F… [+2679 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Every Goal of LFC's 98/99 Season | Berger's unstoppable strikes - Liverpool FC", "description": "Michael Owen would be in scintillating form throughout the 98/99 season notching 18 Premier League goals in the process with strike partner Robbie Fowler hit...", "url": "https://www.youtube.com/watch?v=Td0c_imaZ_U", "urlToImage": null, "publishedAt": "2020-04-25T10:00:27Z", "content": null}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Reece Chambers", "title": "Everton morning headlines as £15m Cengiz Under move 'considered' transfer department restructure - Liverpool Echo", "description": "All the latest Everton news and views from the ECHO", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/everton-morning-headlines-15m-cengiz-18149482", "urlToImage": null, "publishedAt": "2020-04-25T09:57:12Z", "content": "Here are the Everton morning headlines for Saturday April 25.\r\nGabriel agrees personal terms\r\nLong-term transfer target Gabriel has agreed personal terms with Everton, according to reports.\r\nThe Lille defender has been heavily linked with a move to Goodison P… [+2145 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "London Marathon: Back-garden runners prepare for 2.6 Challenge - BBC Sport", "description": "The London Marathon might be postponed but runners are still getting in the miles and raising money for charity - here are some of their inspiring stories.", "url": "https://www.bbc.co.uk/sport/athletics/52418660", "urlToImage": null, "publishedAt": "2020-04-25T09:51:00Z", "content": "Sunday was supposed to be the culmination of more than a million training miles and the collection of many millions more for good causes around the country and world.\r\nFor some, despite the London Marathons postponement until October, it still will be.\r\nThe 2… [+8354 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "London Marathon: Delayed race could feature elite athletes only - BBC News", "description": "This year's postponed London Marathon could be staged with elite athletes only, says race director Hugh Brasher.", "url": "https://www.bbc.co.uk/sport/athletics/52423940", "urlToImage": null, "publishedAt": "2020-04-25T09:14:00Z", "content": "Kenyan world record holders Kipchoge and Brigid Kosgei are due to defend their titles at the 40th London Marathon\r\nThis year's postponed London Marathon could be staged with elite athletes only, says race director Hugh Brasher.\r\nBrasher said that was one of 1… [+1103 chars]"}, {"source": {"id": null, "name": "Portsmouth.co.uk"}, "author": "Jordan Cross", "title": "Revealed: The true cost of voiding the Football League season to Portsmouth, Sunderland and Ipswich Town - Portsmouth News", "description": "League One clubs would be looking at a bill of up to £850,000 is the season is voided.", "url": "https://www.portsmouth.co.uk/sport/football/portsmouth-fc/revealed-true-cost-voiding-football-league-season-portsmouth-sunderland-and-ipswich-town-2549772", "urlToImage": null, "publishedAt": "2020-04-25T08:53:00Z", "content": "Thats the view of Peterborough owner Darragh MacAnthony, who believes third-tier sides would be left to foot that sizeable bill if the decision is made not to complete the campaign.\r\nMacAnthony reckons outfits would be forced to repay EFL and Premier League s… [+2887 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Coronavirus and sport: Meetings due to take place to discuss restart - BBC News", "description": "Medical directors are due to meet in the coming week to discuss how sport could restart, even if only behind closed doors.", "url": "https://www.bbc.co.uk/sport/52423767", "urlToImage": null, "publishedAt": "2020-04-25T08:48:20Z", "content": "Top level football is on hold indefinitely due to the coronavirus pandemic\r\nThe government plans to set up the first of a series of regular meetings involving senior medical directors of the major sports this week in a bid to return to action as soon as possi… [+3868 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "West Indies 'flexible' on new Test dates against England - Sky Sports", "description": "Cricket West Indies says it is \"flexible\" about rearranging a Test tour of England but the governing body insists it will not jeopardise the safety of players.", "url": "https://www.skysports.com/cricket/news/12123/11978552/west-indies-flexible-on-new-test-dates-against-england", "urlToImage": null, "publishedAt": "2020-04-25T08:42:39Z", "content": "Cricket West Indies says it is \"flexible\" about rearranging a Test tour of England but the governing body insists it will not jeopardise the safety of players in order to complete the three-match series.\r\nIn a series that counts towards the World Test Champio… [+2902 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "When Yuvraj smashed Broad for six sixes in a row - BBC News", "description": "Relive the moment when Yuvraj Singh became the first player in Twenty20 history to hit six sixes in an over.", "url": "https://www.bbc.co.uk/sport/av/cricket/52397653", "urlToImage": null, "publishedAt": "2020-04-25T07:57:37Z", "content": null}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "NFL Draft: Tee Higgins joins Joe Burrow at Cincinnati Bengals - Sky Sports", "description": "The Cincinnati Bengals followed up their first-round pick of Joe Burrow by selecting Tee Higgins, who has declared the duo are \"about to tear it up\".", "url": "https://www.skysports.com/nfl/news/12118/11978531/nfl-draft-tee-higgins-joins-joe-burrow-at-cincinnati-bengals", "urlToImage": null, "publishedAt": "2020-04-25T07:29:15Z", "content": "The Cincinnati Bengals followed up their first-round pick of quarterback Joe Burrow by selecting wide receiver Tee Higgins, who has declared the duo are \"about to tear it up\" in the NFL.\r\nThe Bengals picked Clemson's Higgins - who grew up supporting the side … [+1441 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Guardian sport", "title": "Philadelphia Eagles surprise with Jalen Hurts pick on day two of NFL draft - The Guardian", "description": "The Eagles selected Oklahoma quarterback Jalen Hurts in the second round of the NFL draft on Friday, a stunning move for a team with more pressing needs", "url": "https://www.theguardian.com/sport/2020/apr/25/nfl-draft-picks-day-two-jalen-hurts", "urlToImage": null, "publishedAt": "2020-04-25T04:20:00Z", "content": "After giving Carson Wentz a playmaker, the Philadelphia Eagles drafted his backup.\r\nThe Eagles selected Oklahoma quarterback Jalen Hurts in the second round of the NFL draft on Friday night, a stunning move for a team with more pressing needs.\r\nPhiladelphia h… [+10012 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Jacob Steinberg", "title": "Chelsea to activate clause to extend Olivier Giroud's contract until 2021 - The Guardian", "description": "Chelsea are preparing to activate a clause that will allow them to extend Olivier Giroud’s contract by a year", "url": "https://www.theguardian.com/football/2020/apr/24/chelsea-to-activate-clause-to-extend-olivier-giroud-contract-until-2021", "urlToImage": null, "publishedAt": "2020-04-24T22:26:53Z", "content": "Chelsea are preparing to activate a clause that will allow them to extend Olivier Girouds contract by a year and stop the striker leaving on a free transfer this summer.\r\nWhile the France international could yet push for a move away from Stamford Bridge, Chel… [+1834 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Alex Raskin Sports News Editor For Dailymail.com Associated Press", "title": "Video shows Bucs rookie and Tom Brady's newest blocker Tristan Wirfs jumping out of pool - Daily Mail", "description": "Tampa Bay Buccaneers first-round pick Tristan Wirfs weighs well over 300 pounds, but the offensive tackle and Tom Brady's newest blocker is still athletic enough to jump out of a pool onto his feet.", "url": "https://www.dailymail.co.uk/news/article-8254551/Video-shows-Bucs-rookie-Tom-Bradys-newest-blocker-Tristan-Wirfs-jumping-pool.html", "urlToImage": null, "publishedAt": "2020-04-24T20:51:27Z", "content": "The Buccaneers drafted Tristan Wirfs to address an opening at right tackle \r\nTampa Bay Buccaneers first-round pick Tristan Wirfs weighs well over 300 pounds, but the offensive tackle and Tom Brady's newest blocker is still athletic enough to launch himself ou… [+3438 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Jamie Carragher confirms wife tested positive for coronavirus in second family diagnosis - Mirror Online", "description": "Former Liverpool defender Carragher made the announcement when discussing how the football season in the UK can be resumed safely amid the current pandemic", "url": "https://www.mirror.co.uk/sport/football/news/jamie-carragher-confirms-wife-coronavirus-21921317", "urlToImage": null, "publishedAt": "2020-04-24T19:59:48Z", "content": "Jamie Carragher has revealed his wife Nicola has tested positive for coronavirus, becoming the second person in his family to contract the illness. \r\n The former Liverpool defender turned Sky Sports pundit also explained that his aunt had been receiving treat… [+2284 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Is Jamie Carragher RIGHT?! Fernando Torres' flabbergasting move from Liverpool to Chelsea | ESPN FC - ESPN UK", "description": "Craig Burley and Julien Laurens join Dan Thomas on ESPN FC to react to recent comments made by former Liverpool defender Jamie Carragher and former Chelsea c...", "url": "https://www.youtube.com/watch?v=hoRBD5aVqVk", "urlToImage": null, "publishedAt": "2020-04-24T19:51:55Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Mike Tyson confirms he's training to get back in the boxing ring - Mirror Online", "description": "Tyson has not fought since 2005 but explained how he was putting his body through intense workouts in a bid to get fighting fit ahead of a potential comeback for charity", "url": "https://www.mirror.co.uk/sport/boxing/mike-tyson-confirms-hes-training-21921811", "urlToImage": null, "publishedAt": "2020-04-24T19:38:14Z", "content": "Mike Tyson has revealed he has been training with view to making a return to the ring in some boxing exhibitions. \r\nThe former undisputed world heavyweight champion has not fought professionally since retiring after the sixth round of his bout with Kevin McBr… [+1731 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Suzanne Wrack", "title": "Who could replace Phil Neville as England Women's manager? - The Guardian", "description": "We run the rule over leading candidates, including a two-times World Cup winner and a woman who worked as Neville’s No 2", "url": "https://www.theguardian.com/football/2020/apr/24/who-could-replace-phil-neville-as-england-womens-manager", "urlToImage": null, "publishedAt": "2020-04-24T18:00:00Z", "content": "The Football Associations hunt for a successor to Mark Sampson in 2017 quickly became a circus. Names flew out of the ring as fast as they stepped in. Increased scrutiny on the person in charge, with the game professionalising, led some of those on the shortl… [+4734 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Matthew Southcombe", "title": "Marler won't miss a game despite long ban for grabbing Alun Wyn Jones' genitals - Wales Online", "description": "The England prop was banned for 10 weeks after grabbing the Wales skipper's penis, but will be free to play as soon as rugby recommences", "url": "https://www.walesonline.co.uk/sport/rugby/rugby-news/joe-marler-wont-miss-game-18148172", "urlToImage": null, "publishedAt": "2020-04-24T17:41:14Z", "content": "England prop Joe Marler will not miss a single game of rugby despite grabbing Alun Wyn Jones' genitals in a Six Nations match last month, according to reports. \r\nMarler received a 10-week ban after he was found guilty of 'grabbing, twisting or squeezing' the … [+1782 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Joe Brophy", "title": "Bundesliga stars may have to play in MASKS with games stopped if they slip off and breaks every 15 mins to - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11472378/bundesliga-play-in-masks-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-24T16:20:47Z", "content": "BUNDESLIGA stars may have to wear masks during matches with games to be stopped if they slip off after the coronavirus lockdown.\r\nSpiegel Sports revealed that leaked documents in Germany from the Ministry of Labour have disclosed plans to equip both players a… [+2347 chars]"}, {"source": {"id": null, "name": "Derbytelegraph.co.uk"}, "author": "Chris Watson", "title": "Derby County favourite has contract terminated by Championship club - Derbyshire Live", "description": "The former Rams midfielder and coach had been part of Graeme Jones' backroom staff at Luton Town", "url": "https://www.derbytelegraph.co.uk/sport/football/football-news/inigo-idiakez-derby-luton-harford-4076842", "urlToImage": null, "publishedAt": "2020-04-24T15:19:00Z", "content": "Derby County favourite Inigo Idiakez has lost his job at Sky Bet Championship club Luton Town.\r\nIdiakez had been first-team coach at Kenilworth Road but has had his contract terminated with immediate effect, along with manager Graeme Jones, assistant boss Gar… [+2928 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Oliver Connolly", "title": "The NFL's virtual draft was dry, boring and everything we needed right now - The Guardian", "description": "The NFL’s lockdown draft felt slapdash, a little weird and less eventful than those in recent years. It was also the first time in a month things felt slightly back to normal", "url": "https://www.theguardian.com/sport/2020/apr/24/nfl-virtual-draft-television-abc-espn", "urlToImage": null, "publishedAt": "2020-04-24T09:00:00Z", "content": "The first round of the NFL draft should have been a series of fireworks, owing as much to do with the wonky set-up the league found itself in. The mock run-through had been a veritable disaster a spouse pulling a plug on a GMs computer, the technology choppin… [+5289 chars]"}]}