{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Freddie Keighley", "title": "Ole Gunnar Solskjaer's plan to fit transfer target Jack Grealish into Man Utd team - Mirror Online", "description": "The Red Devils are in pole position to sign the Aston Villa captain - and they have decided he will line up in an unconventional role should he move to Old Trafford", "url": "https://www.mirror.co.uk/sport/football/transfer-news/ole-gunnar-solskjaers-plan-fit-21924780", "urlToImage": null, "publishedAt": "2020-04-25T10:33:54Z", "content": "Manchester United are already planning which position long-term transfer target Jack Grealish will be deployed in ahead of a potential move this summer. \r\nAston Villa star Grealish is contracted until 2023, but is heavily linked with a £60m transfer to Old Tr… [+2022 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Pierre-Emerick Aubameyang's father drops hint over new Arsenal contract - Mirror Online", "description": "Aubameyang has been considering his options with little over a year left on his current deal with Arsenal, but the striker could now be prepared to commit his future to the club", "url": "https://www.mirror.co.uk/sport/football/news/pierre-emerick-aubameyangs-father-drops-21924834", "urlToImage": null, "publishedAt": "2020-04-25T10:33:53Z", "content": "Pierre-Emerick Aubameyang's father has urged his son to sign a new contract at Arsenal by dropping a huge hint on Instagram. \r\nThe Gabonese striker is out of contract in 2021, but has been linked with a move elsewhere this summer amid interest from several el… [+2136 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Shane Ireland", "title": "Pundit Stan Collymore sends Premier League a relegation message involving West Brom and Leeds United - Birmingham Live", "description": "West Brom news includes Collymore on why promotion and relegation should operate as normal even if the campaign isn't finished in full", "url": "https://www.birminghammail.co.uk/sport/football/football-news/stan-collymore-west-brom-leeds-18122947", "urlToImage": null, "publishedAt": "2020-04-25T10:04:50Z", "content": "Stan Collymore believes clubs must still be promoted and relegated as normal - even if the full 38-game Premier League season isn't completed.\r\nWest Bromwich Albion sit comfortably in second place in the Championship, requiring one final push to realise their… [+3128 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Joseph Chapman", "title": "Wolves agree on Liverpool transfer ahead of summer window - reports - Birmingham Live", "description": "Wolves transfer news - Liverpool goalkeeper Loris Karius has been linked with a move to Molineux in the next transfer window", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/wolves-transfers-karius-liverpool-klopp-18130415", "urlToImage": null, "publishedAt": "2020-04-25T10:04:48Z", "content": "The latest rumour in the bizarre transfer triangle that is developing involving Wolves has linked them with Liverpool goalkeeper Loris Karius.\r\n In the last week or so, Wolves have been regularly mentioned in the same sentence as Besiktas, when their goalkeep… [+2317 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Joe Rimmer", "title": "Luis Alberto masterstroke could make Liverpool millions this summer - Liverpool Echo", "description": "Luis Alberto's Liverpool departure may have gone under the radar - but a clause could result in Liverpool making millions", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-luis-alberto-transfer-clause-17881222", "urlToImage": null, "publishedAt": "2020-04-25T10:03:36Z", "content": "Michael Edwards doesn't do interviews. The Liverpool sporting director just doesn't want the headlines.\r\nNor does Edwards appear publicly, and anyone searching for a picture of him will only find a select few.\r\nYou won't find much about him on the club site, … [+3728 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Greg Lea", "title": "Liverpool morning headlines as Peter Moore met with 'awkward silence' over Premier League completion - Liverpool Echo", "description": "Here is the latest Liverpool round-up from the ECHO", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-morning-headlines-peter-moore-18149201", "urlToImage": null, "publishedAt": "2020-04-25T10:03:34Z", "content": "Here are your Liverpool morning headlines for Saturday 25th April.\r\nLineker defends Liverpool\r\nHe may have been a Everton hero during his playing career, but Gary Lineker has defended Liverpool after controversial remarks from Piers Morgan.\r\nOn Friday, the Du… [+2706 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "NFL Draft 2020: Teams set wide receiver record on Day Two - Sky Sports", "description": "Wide receivers flew off the board on a busy Day Two of the 2020 NFL Draft.", "url": "https://www.skysports.com/nfl/news/12118/11978575/nfl-draft-2020-teams-set-wide-receiver-record-on-day-two", "urlToImage": null, "publishedAt": "2020-04-25T09:58:40Z", "content": "Teams continued to dip into the 2020 NFL Draft's deep receiver class on Friday, with the Cincinnati Bengals kicking off the run at the top of Round Two by grabbing Clemson wideout Tee Higgins.\r\nAfter six wideouts went in Round One, Round Two began with two in… [+4635 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "REPLAYED: West Ham 0-2 Liverpool | Ox & Salah make it 19 points at the London Stadium - Liverpool FC", "description": "Relive the Reds' victory at the London Stadium, as Alex Oxlade-Chamberlain's well-taken goal was added to by a Mo Salah penalty to stretch LFC's lead at the ...", "url": "https://www.youtube.com/watch?v=knNR4bd5Dd8", "urlToImage": null, "publishedAt": "2020-04-25T09:57:14Z", "content": "Relive the Reds' victory at the London Stadium, as Alex Oxlade-Chamberlain's well-taken goal was added to by a Mo Salah penalty to stretch LFC's lead at the top of the Premier League.\r\nEnjoy more content and get exclusive perks in our Liverpool FC Members Are… [+197 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Olivier Giroud: Chelsea intend to take up option to extend striker's contract - Sky Sports", "description": "Chelsea intend to take up their option to extend Olivier Giroud's contract by a year to prevent him becoming a free agent in the summer.", "url": "https://www.skysports.com/football/news/11668/11978581/olivier-giroud-chelsea-intend-to-take-up-option-to-extend-strikers-contract", "urlToImage": null, "publishedAt": "2020-04-25T09:45:31Z", "content": "Chelsea intend to take up their option to extend Olivier Giroud's contract by a year to prevent him becoming a free agent in the summer.\r\nThe 33-year-old's deal is due to expire on June 30, but, by extending it, Chelsea will be able to ask for a transfer fee … [+542 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "ePL Invitational: Trent Alexander-Arnold's competitive juices flowing ahead of Raheem Sterling showdown - Sky Sports", "description": "Trent Alexander-Arnold's competitive juices are flowing ahead of an ePL Finals Day showdown with Raheem Sterling, who says: \"Trent will not beat me.\"", "url": "https://www.skysports.com/more-sports/football/news/33554/11978221/epl-invitational-trent-alexander-arnolds-competitive-juices-flowing-ahead-of-raheem-sterling-showdown", "urlToImage": null, "publishedAt": "2020-04-25T09:45:20Z", "content": "Trent Alexander-Arnold's competitive juices are flowing ahead of the ePL Finals Day showdown with Raheem Sterling, who says: \"Trent will not beat me.\"\r\nThose looking for a football fix should be pointed in the direction of the ePL Invitational on Saturday as … [+3099 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Marcus Banks", "title": "Manchester United fans cannot believe new Angel Di Maria transfer rumour - Manchester Evening News", "description": "Angel Di Maria signed for United in 2014 but left in 2015 to join Paris Saint-Germain.", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/pogba-di-maria-man-utd-18149406", "urlToImage": null, "publishedAt": "2020-04-25T09:24:29Z", "content": "Speculation over the future of Manchester United midfielder Paul Pogba refuses to die down.\r\nThe World Cup winner continues to be heavily linked with an exit, with Real Madrid, Juventus and Paris Saint-Germain believed to be interested in acquiring his servic… [+1449 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Dave Fraser", "title": "Mike Tyson vs Tyson Fury, Anthony Joshua and Deontay Wilder: How boxing legend thinks he’d fare against t - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/boxing/11464196/mike-tyson-vs-fury-anthony-joshua-deontay-wilder/", "urlToImage": null, "publishedAt": "2020-04-25T09:19:43Z", "content": "WITH 44 KOs across 50 wins in his career, it's fair to say Mike Tyson will forever be known as one of boxing's greatest heavyweights ever.\r\nFans forever argue as to who would win in their prime: Iron Mike or Muhammad Ali.\r\n Mike Tyson has revealed how he thin… [+4372 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Lewis Winter", "title": "Man Utd legend Roy Keane sends Man City and Liverpool warning to Ole Gunnar Solskjaer - Express", "description": "Manchester United still have a lot to do to catch Manchester City and Liverpool according to Roy Keane.", "url": "https://www.express.co.uk/sport/football/1273735/Man-Utd-news-Roy-Keane-Man-City-Liverpool-warning-Ole-Gunnar-Solskjaer", "urlToImage": null, "publishedAt": "2020-04-25T09:17:05Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "London Marathon: Delayed race could feature elite athletes only - BBC News", "description": "This year's postponed London Marathon could be staged with elite athletes only, says race director Hugh Brasher.", "url": "https://www.bbc.co.uk/sport/athletics/52423940", "urlToImage": null, "publishedAt": "2020-04-25T09:14:00Z", "content": "Kenyan world record holders Kipchoge and Brigid Kosgei are due to defend their titles at the 40th London Marathon\r\nThis year's postponed London Marathon could be staged with elite athletes only, says race director Hugh Brasher.\r\nBrasher said that was one of 1… [+1098 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Ollie Lewis For Mailonline", "title": "Newcastle could sign stars like Gareth Bale if they appoint Mauricio Pochettino, says Berbatov - Daily Mail", "description": "The Premier League club are nearing a change of ownership after a £300million bid by a Saudi Arabia-lead consortium was accepted by controversial owner Mike Ashley.", "url": "https://www.dailymail.co.uk/sport/football/article-8256061/Newcastle-sign-major-stars-like-Gareth-Bale-appoint-Mauricio-Pochettino.html", "urlToImage": null, "publishedAt": "2020-04-25T09:13:15Z", "content": "Dimitar Berbatov believes Newcastle United could attract an array of top class talent, including Real Madrid attacker Gareth Bale, if they recruit Mauricio Pochettino as manager. \r\nThe Premier League club are nearing a change of ownership after a £300million … [+2210 chars]"}, {"source": {"id": null, "name": "Autosport.com"}, "author": "Jonathan Noble", "title": "F1 News: Ferrari's Vettel set to join rivals in Esports competitions - Autosport", "description": "Ferrari driver Sebastian Vettel says he will join many of his Formula 1 rivals and start sim racing soon, after recently taking delivery of his own rig", "url": "https://www.autosport.com/f1/news/149143/vettel-set-to-join-rivals-in-esports-competitions", "urlToImage": null, "publishedAt": "2020-04-25T09:10:40Z", "content": "Ferrari driver Sebastian Vettel says he will join many of his Formula 1 rivals and start sim racing soon, after recently taking delivery of his own rig.\r\nThe four-time world champion has so far steered clear of joining in with the recent rush to take part in … [+1695 chars]"}, {"source": {"id": null, "name": "Heraldscotland.com"}, "author": "Stephen Mcilkenny", "title": "Gossip: SPFL desperate to end season claims Steven Gerrard | Celtic the 'rightful champions' says Ryan Christie - HeraldScotland", "description": "The latest news and gossip from Scottish football as Steven Gerrard accuses the SPFL of lacking the will to finish the season proper.", "url": "https://www.heraldscotland.com/sport/18405403.spfl-desperate-end-season-claims-steven-gerrard-celtic-rightful-champions-says-ryan-christie/", "urlToImage": null, "publishedAt": "2020-04-25T08:58:21Z", "content": "The latest news and gossip from Scottish football as Steven Gerrard accuses the SPFL of lacking the will to finish the season proper. \r\nRangers manager Steven Gerrard has accused the SPFL hierarchy of showing a \"lack of energy\" and being \"desperate\" to finish… [+4077 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Simon Peach", "title": "Premier League moves closer to behind closed doors return in June - The Independent", "description": "Discussions with broadcasters are ongoing to determine the best way to televise the season’s remaining matches", "url": "https://www.independent.co.uk/sport/football/premier-league/premier-league-coronavirus-restart-behind-closed-doors-june-tv-epl-a9483566.html", "urlToImage": null, "publishedAt": "2020-04-25T08:52:43Z", "content": "The Premier League is in discussions with UK rights holders about how best to broadcast the seasons remaining fixtures as the campaign edges closer to a return behind closed doors.\r\nIt is six weeks since the English top-flight was suspended in a bid to curb t… [+2018 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "george harrison", "title": "Inside Mike Tyson’s £890k abandoned mansion that had tiger cages and basketball court before being converted i - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/1285850/mike-tyson-mansion-house-tiger-king-cage-church/", "urlToImage": null, "publishedAt": "2020-04-25T08:31:50Z", "content": "THIS is the spectacular mansion Mike Tyson abandoned during his rapid fall from grace.\r\nThe former professional boxer - who was convicted of rape in 1992 - had no choice but to sell this palatial property as financial ruin loomed, and the imposing Ohio mansio… [+2954 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Bezants for MailOnline", "title": "20 years ago, Pep Guardiola and Jose Mourinho were friends at Barcelona - Daily Mail", "description": "It's a picture that shows a different time and frankly, one that  people nowadays might find hard to imagine; Pep Guardiola and Jose Mourinho, sat side-by-side as friends, wearing crests of the same club.", "url": "https://www.dailymail.co.uk/sport/football/article-8095753/20-years-ago-Pep-Guardiola-Jose-Mourinho-friends-Barcelona.html", "urlToImage": null, "publishedAt": "2020-04-25T08:08:58Z", "content": "It's a picture that shows a different time and frankly, one that people nowadays might find hard to imagine; Pep Guardiola and Jose Mourinho, sat side-by-side as friends, wearing crests of the same club.\r\nIt was April 16, 2000, that such a snap was taken, 20 … [+6834 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Ben Grounds", "title": "Barcelona transfer Q&A: Key questions on Neymar, Antoine Griezmann, Philippe Coutinho - Sky Sports", "description": "Sky Sports assess what surgery is needed to the Barcelona squad and what transfer activity can be expected.", "url": "https://www.skysports.com/football/news/11095/11976997/barcelona-transfer-qa-key-questions-on-neymar-philippe-coutinho-lautaro-martinez", "urlToImage": null, "publishedAt": "2020-04-25T08:06:43Z", "content": "Barcelona are in a state of flux. Quique Setien was the temporary manager who has unexpectedly found himself in long-term control owing to the uncertainty surrounding the coronavirus pandemic.\r\nSince arriving as Ernesto Valverde's successor, Setien has found … [+15079 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "“The Winner Will Fight Khabib For the Title”- Dana White makes a huge statement - India Gone Viral", "description": "UFC 249 finally has a new venue. The event will take place at VyStar Veterans Memorial Arena in Jacksonville, Florida. The UFC pounced on a chance to hold their events in the Sunshine State as sports", "url": "https://indiagoneviral.com/sports/2020/04/25/the-winner-will-fight-khabib-for-the-title/42011/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T08:05:16Z", "content": "UFC 249 finally has a new venue. The event will take place at VyStar Veterans Memorial Arena in Jacksonville, Florida. The UFC pounced on a chance to hold their events in the Sunshine State as sports activities were deemed essential businesses. Dana White app… [+1803 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "EXCLUSIVE: Harvey Elliott and Pep Lijnders | \"Klopp is every player's dream to play under\" - Liverpool FC", "description": "Liverpool's Assistant Manager, Pepijn Lijnders talks exclusively to teenage forward Harvey Elliott about finding his place in the squad, always being first i...", "url": "https://www.youtube.com/watch?v=oPrfsrtXT7k", "urlToImage": null, "publishedAt": "2020-04-25T08:00:20Z", "content": "Liverpool's Assistant Manager, Pepijn Lijnders talks exclusively to teenage forward Harvey Elliott about finding his place in the squad, always being first in the dreaded rondos, Harvey's idols and his goals for the future.\r\nEnjoy more content and get exclusi… [+237 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Kathryn Batte For Mailonline", "title": "Raheem Sterling reveals Lionel Messi is the only shirt missing from his incredible collection - Daily Mail", "description": "The Manchester City winger revealed his desire to have a room in his house dedicated to trophies and another for the shirts he has picked up throughout his career.", "url": "https://www.dailymail.co.uk/sport/football/article-8255647/Raheem-Sterling-reveals-Lionel-Messi-shirt-missing-incredible-collection.html", "urlToImage": null, "publishedAt": "2020-04-25T08:00:01Z", "content": "Raheem Sterling is desperate to add a Lionel Messi shirt to his incredible match-worn collection.\r\nThe Manchester City winger revealed his desire to have a room in his house dedicated to trophies and another for the shirts he has picked up throughout his care… [+1598 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Birmingham City and Leeds United hit back at 'embarrassing' transfer claim - Birmingham Live", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiZ2h0dHBzOi8vd3d3LmJpcm1pbmdoYW1tYWlsLmNvLnVrL3Nwb3J0L2Zvb3RiYWxsL2Zvb3RiYWxsLW5ld3MvYmlybWluZ2hhbS1jaXR5LWxlZWRzLXVuaXRlZC1oaXQtMTgxNDg0NDjSAWtodHRwczovL3d3dy5iaXJtaW5naGFtbWFpbC5jby51ay9zcG9ydC9mb290YmFsbC9mb290YmFsbC1uZXdzL2Jpcm1pbmdoYW0tY2l0eS1sZWVkcy11bml0ZWQtaGl0LTE4MTQ4NDQ4LmFtcA?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T07:23:05Z", "content": null}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Gary Ralston", "title": "Robby McCrorie on West Ham's transfer radar as Rangers keeper attracts Premier League interest - Daily Record", "description": "David Moyes has been impressed by the keeper's form on-loan at Livingston.", "url": "https://www.dailyrecord.co.uk/sport/football/football-transfer-news/robbie-mccrorie-west-hams-transfer-21923361", "urlToImage": null, "publishedAt": "2020-04-25T07:14:29Z", "content": "West Ham are on the trail of Rangers keeper Robby McCrorie.\r\nThe Hammers have been impressed by the form of the Scotland under-21 starlet and see him as a long term successor to Lukasz Fabianski.\r\nMcCrorie, 22, is currently on loan at Livingston after spendin… [+1022 chars]"}, {"source": {"id": null, "name": "Hitc.com"}, "author": "Shane Callaghan", "title": "Joey Barton saw one current Rangers star in tears over Celtic snub - HITC - Football, Gaming, Movies, TV, Music", "description": "Ibrox side Glasgow Rangers have been sharing the league with Celtic again since 2016.", "url": "https://www.hitc.com/en-gb/2020/04/25/joey-barton-saw-one-current-rangers-star-in-tears-over-celtic-sn/", "urlToImage": null, "publishedAt": "2020-04-25T07:09:22Z", "content": "Ibrox side Glasgow Rangers have been sharing the league with Celtic again since 2016.\r\nJoey Barton has revealed that former Rangers boss Mark Warburton made Andy Halliday cry on the eve of an Old Firm game against Celtic in 2016.\r\nThe Gers were given a huge w… [+1541 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Graham Ruthven", "title": "Manchester United might have a surprise right wing solution - Manchester Evening News", "description": "United are targeting Jadon Sancho in the transfer market but the club have a left-field option within their ranks if Borussia Dortmund stand firm.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/dalot-wan-bissaka-manchester-united-18137487", "urlToImage": null, "publishedAt": "2020-04-25T07:09:01Z", "content": "In Diogo Dalot and Aaron Wan-Bissaka, Manchester United boast two young full-backs from two very different moulds. \r\nWhile the former's strength lies in his attacking skills, the latter is arguably the best one-on-one defender currently playing in the Premier… [+2843 chars]"}, {"source": {"id": null, "name": "Football365.com"}, "author": "Matthew Stead", "title": "Spurs offered Barcelona trio in exchange for Ndombele; Auba to Chelsea - Football365.com", "description": "Football365 - Barcelona want to tempt Spurs into a Tanguy Ndombele deal. And Pierre-Emerick Aubameyang is 'a serious' Chelsea alternative.", "url": "https://www.football365.com/news/transfer-gossip-aubameyang-ndombele-spurs-barcelona-arsenal", "urlToImage": null, "publishedAt": "2020-04-25T06:36:56Z", "content": "Spurs have been offered three players by Barcelona in exchange for Ndombele. And Chelsea want Aubameyang.\r\nAUBA THE HILLThe last player to transfer between Arsenal and Chelsea was Olivier Giroud in January 2018. While there is news concerning the Frenchman on… [+3335 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Alexis Sanchez facing uncertain future as 'neither Man Utd or Inter want him' - Mirror Online", "description": "Manchester United will struggle to find a club prepared to match forward's mammoth wages in the wake of the coronavirus pandemic, and costly flop may have to train with youngsters", "url": "https://www.mirror.co.uk/sport/football/transfer-news/alexis-sanchez-facing-uncertain-future-21924263", "urlToImage": null, "publishedAt": "2020-04-25T05:17:11Z", "content": "Alexis Sanchez is facing an uncertain future as neither Manchester United or Inter Milan want him, according to reports. \r\nSanchez has spent the season on loan at Inter, but has failed to impress in Italy after becoming one of the costliest transfer flops in … [+2311 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ashley Preece", "title": "Aston Villa linked with shock move for Liverpool transfer flop - Birmingham Live", "description": "Aston Villa transfer gossip - The former Sunderland striker joined Hellas Verona from AC Milan in January - but his contract is set to expire sparking interest from Villa and Crystal Palace", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/aston-villa-liverpool-crystal-palace-18148709", "urlToImage": null, "publishedAt": "2020-04-25T05:03:00Z", "content": "Aston Villa are eyeing a surprising move for Liverpool flop Fabio Borini, an Italian newspaper has claimed.\r\n The 29-year-old is, according to L'Arena, being monitored by Villa and Crystal Palace ahead of a free transfer in the summer. \r\nReports suggest Villa… [+1295 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Guardian sport", "title": "Philadelphia Eagles surprise with Jalen Hurts pick on day two of NFL draft - The Guardian", "description": "The Eagles selected Oklahoma quarterback Jalen Hurts in the second round of the NFL draft on Friday, a stunning move for a team with more pressing needs", "url": "https://www.theguardian.com/sport/2020/apr/25/nfl-draft-picks-day-two-jalen-hurts", "urlToImage": null, "publishedAt": "2020-04-25T04:20:00Z", "content": "After giving Carson Wentz a playmaker, the Philadelphia Eagles drafted his backup.\r\nThe Eagles selected Oklahoma quarterback Jalen Hurts in the second round of the NFL draft on Friday night, a stunning move for a team with more pressing needs.\r\nPhiladelphia h… [+10018 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Liam Thorp", "title": "Who could and should have stopped controversial Liverpool v Atletico Madrid match - Liverpool Echo", "description": "The ECHO asks who was behind decision to go ahead with the fixture", "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/who-could-should-stopped-controversial-18137084", "urlToImage": null, "publishedAt": "2020-04-25T04:07:52Z", "content": "\"An interesting hypothesis\"\r\nThis was the response of the government's deputy chief scientific adviser, Angela McLean, when the ECHO asked whether the decision to allow 3,000 Atletico Madrid fans to travel to watch the Liverpool game on March 11 may have adde… [+10555 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Daniel Blackham", "title": "Chelsea turned down chance to sign Arrizabalaga replacement despite Lampard's wishes - Express", "description": "Chelsea's board don't want to sell Kepa Arrizabalaga, despite Frank Lampard's feelings towards the Spaniard.", "url": "https://www.express.co.uk/sport/football/1273677/Chelsea-Frank-Lampard-Kepa-Arrizabalaga-transfer", "urlToImage": null, "publishedAt": "2020-04-25T04:01:38Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Dani Ceballos shares Zinedine Zidane message on future amid Arsenal transfer talk - Mirror Online", "description": "Arsenal are believed to be keen on signing Real Madrid midfielder permanently following loan spell, but Ceballos has revealed Zidane conversation which could decide his future", "url": "https://www.mirror.co.uk/sport/football/transfer-news/dani-ceballos-shares-zinedine-zidane-21924432", "urlToImage": null, "publishedAt": "2020-04-25T03:08:04Z", "content": "Dani Ceballos has shared a message from Zinedine Zidane about his Real Madrid future amid speculation Arsenal will bid to sign him permanently. \r\nCeballos has spent the season on loan with the Gunners from Madrid, and Arsenal are believed to be keen on signin… [+1801 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Coronavirus and sport: Meetings due to take place to discuss restart - BBC News", "description": "Medical directors are due to meet in the coming week to discuss how sport could restart, even if only behind closed doors.", "url": "https://www.bbc.co.uk/sport/52423767", "urlToImage": null, "publishedAt": "2020-04-25T01:58:04Z", "content": "Top level football is on hold indefinitely due to the coronavirus pandemic\r\nThe government plans to set up the first of a series of regular meetings involving senior medical directors of the major sports this week in a bid to return to action as soon as possi… [+3014 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Sean Dyche explains why he had to apologise to Arsene Wenger after Arsenal clash - Mirror Online", "description": "Burnley manager said he gave former Gunners boss Wenger a 'rubbish' claret following a game at Turf Moor, as he opened up on his own taste in wine", "url": "https://www.mirror.co.uk/sport/football/news/sean-dyche-explains-apologise-arsene-21924463", "urlToImage": null, "publishedAt": "2020-04-25T01:48:30Z", "content": "Burnley manager Sean Dyche has revealed he had to apologise to former Arsenal boss Arsene Wenger - for giving him a \"rubbish\" red wine after a game. \r\nDyche, who admits he is \"certainly not an aficionado\" of fine wines, says all rival managers are offered the… [+2225 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Norwich City defend furlough decision and could lose up to £35m - BBC Sport", "description": "Norwich City will \"stick to their guns\" on a decision to furlough non-playing staff and expect to lose up to £35m.", "url": "https://www.bbc.co.uk/sport/football/52409583", "urlToImage": null, "publishedAt": "2020-04-25T01:41:53Z", "content": "Norwich's last game before the suspension of English football was a 1-0 loss at Sheffield United on 7 March\r\nNorwich City will \"stick to their guns\" on a decision to furlough non-playing staff, with the club expected to lose up to £35m because of coronavirus.… [+2176 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "All eyes on Germany & no non-league matches until 2021? What next for football? - BBC Sport", "description": "As Uefa attempts to offer some clarity about what next for football, BBC Sport's Simon Stone takes a look at some of the big questions that remain.", "url": "https://www.bbc.co.uk/sport/football/52413053", "urlToImage": null, "publishedAt": "2020-04-25T01:37:50Z", "content": "Liverpool are the current European champions after beating Tottenham in last season's Champions League final\r\nAt the end of a busy week of meetings and discussions, European football's governing body, Uefa, offered some clarity over how they hope the game wil… [+7026 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Justin Allen", "title": "Bury hope FA put them in National League next season with chairman Dale willing to step down - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11474335/bury-national-league-steve-dale/", "urlToImage": null, "publishedAt": "2020-04-24T23:53:22Z", "content": "BURY owner Steve Dale has amazingly revealed he is waiting fortheFA to put his club into the National League for next season.\r\nAnd Dale would be prepared to step down as chairman of the expelled EFL outfit to make it happen.\r\n Steve Dale hopes Bury are placed… [+2817 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Guardian sport", "title": "West Indies say Test tour of England has been postponed due to Covid-19 - The Guardian", "description": "The three-Test series between England and West Indies in June has been postponed due to the coronavirus outbreak", "url": "https://www.theguardian.com/sport/2020/apr/24/west-indies-test-tour-england-postponed-covid-19-cricket", "urlToImage": null, "publishedAt": "2020-04-24T23:20:55Z", "content": "The three-Test series between England and West Indies in June has been postponed due to the coronavirus outbreak, Cricket West Indies (CWI) said on Friday.\r\nWest Indies had been scheduled to play on 4-8 June at The Oval, 12-16 June at Edgbaston and 25-29 June… [+1600 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Tashan Deniran-Alleyne", "title": "How the Dutch FA's decision would affect Chelsea's top-four battle with Man United and Tottenham - Football.London", "description": "The Eredivisie have become the first major European division to decide against crowning a league champion for the 2019/20 season, and the decision could impact English football", "url": "https://www.football.london/chelsea-fc/news/chelsea-champions-league-man-united-18148939", "urlToImage": null, "publishedAt": "2020-04-24T22:55:13Z", "content": "The big news in the world of football on Friday surrounding a massive decision made by the Dutch FA.\r\nIt was announced that the 2019/20 Eredivisie season has been ended.\r\nLast season's Champions League semi-finalists Ajax had led the table on goal difference … [+2396 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Dominic King for the Daily Mail", "title": "Former Liverpool star Dominic Matteo and his wife on how he beat a brain tumour and is on the mend - Daily Mail", "description": "EXCLUSIVE INTERVIEW BY DOMINIC KING: This story will conclude with a ringing bell and thunderous applause but it must start with a blaring siren and flashing blue lights.", "url": "https://www.dailymail.co.uk/sport/football/article-8255097/Former-Liverpool-star-Dominic-Matteo-wife-beat-brain-tumour-mend.html", "urlToImage": null, "publishedAt": "2020-04-24T21:52:31Z", "content": "This story will conclude with a ringing bell and thunderous applause but it must start with a blaring siren and flashing blue lights.\r\nIt was Monday, November 11 when the ballet class Jessica Matteo was teaching was interrupted by a phone call. Her husband Do… [+9654 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Matt Davies", "title": "PDC Darts Home Tour 2020 results LIVE: Stream, latest scores on Day 8, watch free online and TV channel - Evening Standard", "description": "", "url": "https://www.standard.co.uk/sport/darts-pdc-home-tour-2020-live-stream-results-day-8-latest-scores-watch-free-tv-a4423691.html", "urlToImage": null, "publishedAt": "2020-04-24T21:44:58Z", "content": "Welcome to Day 8 of our PDCdarts Home Tour LIVE coverage.\r\nOn Friday night, world number 15 Jonny Clayton progressed to the next round with a perfect record of three straight victories.\r\nIt was a close encounter, however, the group undecided until the final g… [+7879 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Barcelona's handling of Lionel Messi is the way forward for rugby, says Agustin Pichot - Sky Sports", "description": "Agustin Pichot believes rugby can learn some valuable lessons from Barcelona's handling of Lionel Messi in terms of player management.", "url": "https://www.skysports.com/rugby-union/news/12321/11978415/barcelonas-handling-of-lionel-messi-is-the-way-forward-for-rugby-says-agustin-pichot", "urlToImage": null, "publishedAt": "2020-04-24T21:24:05Z", "content": "Agustin Pichot believes rugby can learn some valuable lessons from Barcelona's handling of Lionel Messi in terms of player management.\r\nPichot is hoping to unsurp current chairman Sir Bill Beaumont for the top job in World Rugby, with a global season being on… [+5067 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Mark Wakefield", "title": "Danny Murphy details Liverpool secret to beating Manchester United - Liverpool Echo", "description": "The former Reds midfielder enjoyed regular success against Liverpool's arch rivals, particularly away from home", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/danny-murphy-details-liverpool-secret-18143075", "urlToImage": null, "publishedAt": "2020-04-24T20:32:34Z", "content": "Former Liverpool midfielder Danny Murphy has revealed the tactical insight into the success the Reds had against Manchester United.\r\n During Murphys time on Merseyside, Liverpool enjoyed a number of successful matches against their old foes, particularly at O… [+2234 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Ryan Taylor", "title": "Recent Liverpool signing influencing Michael Edwards' stance on Timo Werner transfer - Express", "description": "Liverpool's summer transfer plans are likely to be affected by the coronavirus crisis.", "url": "https://www.express.co.uk/sport/football/1273628/Liverpool-signing-influencing-Michael-Edwards-Timo-Werner-transfer-gossip", "urlToImage": null, "publishedAt": "2020-04-24T20:17:51Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Is Jamie Carragher RIGHT?! Fernando Torres' flabbergasting move from Liverpool to Chelsea | ESPN FC - ESPN UK", "description": "Craig Burley and Julien Laurens join Dan Thomas on ESPN FC to react to recent comments made by former Liverpool defender Jamie Carragher and former Chelsea c...", "url": "https://www.youtube.com/watch?v=hoRBD5aVqVk", "urlToImage": null, "publishedAt": "2020-04-24T19:51:55Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Charlotte Daly For Mailonline", "title": "Mohamed Salah is one of football's leading names marking the beginning of Ramadan - Daily Mail", "description": "Mohamed Salah, Mesut Ozil and Antonio Rudiger will be celebrating Ramadan like no other as the Holy Month begins amid unprecedented restrictions due to Coronavirus", "url": "https://www.dailymail.co.uk/sport/football/article-8254103/Mohamed-Salah-one-footballs-leading-names-marking-beginning-Ramadan.html", "urlToImage": null, "publishedAt": "2020-04-24T19:13:02Z", "content": "Mohamed Salah, Mesut Ozil and Antonio Rudiger will be celebrating Ramadan like no other as the Holy Month begins amid unprecedented restrictions due to coronavirus. \r\nWith Ramadan beginning on Thursday April 23 and lasting until Saturday May 23, the fasting p… [+3194 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Mark Jones", "title": "Premier League ref Mark Clattenburg \"told you to f*** off\", says Kasper Schmeichel - Mirror Online", "description": "The Leicester City goalkeeper said that the County Durham official was his favourite top-flight ref before his sudden departure from the Premier League in 2017", "url": "https://www.mirror.co.uk/sport/football/news/premier-league-ref-mark-clattenburg-21921136", "urlToImage": null, "publishedAt": "2020-04-24T19:12:04Z", "content": "Leicester City goalkeeper Kasper Schmeichel says that former Premier League referee Mark Clattenburg was his favourite top-flight official because \"he'd tell you to f*** off\" if he felt that you deserved it.\r\nCounty Durham official Clattenburg was once seen a… [+1738 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Suzanne Wrack", "title": "Who could replace Phil Neville as England Women's manager? - The Guardian", "description": "We run the rule over leading candidates, including a two-times World Cup winner and a woman who worked as Neville’s No 2", "url": "https://www.theguardian.com/football/2020/apr/24/who-could-replace-phil-neville-as-england-womens-manager", "urlToImage": null, "publishedAt": "2020-04-24T18:00:00Z", "content": "The Football Associations hunt for a successor to Mark Sampson in 2017 quickly became a circus. Names flew out of the ring as fast as they stepped in. Increased scrutiny on the person in charge, with the game professionalising, led some of those on the shortl… [+4734 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Jamie Carragher confirms wife tested positive for coronavirus in second family diagnosis - Mirror Online", "description": "Former Liverpool defender Carragher made the announcement when discussing how the football season in the UK can be resumed safely amid the current pandemic", "url": "https://www.mirror.co.uk/sport/football/news/jamie-carragher-confirms-wife-coronavirus-21921317", "urlToImage": null, "publishedAt": "2020-04-24T17:42:56Z", "content": "Jamie Carragher has revealed his wife Nicola has tested positive for coronavirus, becoming the second person in his family to contract the illness. \r\n The former Liverpool defender turned Sky Sports pundit also explained that his aunt had been receiving treat… [+2284 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Matthew Southcombe", "title": "Marler won't miss a game despite long ban for grabbing Alun Wyn Jones' genitals - Wales Online", "description": "The England prop was banned for 10 weeks after grabbing the Wales skipper's penis, but will be free to play as soon as rugby recommences", "url": "https://www.walesonline.co.uk/sport/rugby/rugby-news/joe-marler-wont-miss-game-18148172", "urlToImage": null, "publishedAt": "2020-04-24T17:41:14Z", "content": "England prop Joe Marler will not miss a single game of rugby despite grabbing Alun Wyn Jones' genitals in a Six Nations match last month, according to reports. \r\nMarler received a 10-week ban after he was found guilty of 'grabbing, twisting or squeezing' the … [+1782 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Green Bay Packers' Aaron Rodgers within rights to be annoyed by Jordan Love pick, says Neil Reynolds - Sky Sports", "description": "Neil Reynolds and Jeff Reinebold analyse the Green Bay Packers' shock selection of Utah State quarterback Jordan Love.", "url": "https://www.skysports.com/nfl/news/12118/11978237/green-bay-packers-aaron-rodgers-within-rights-to-be-annoyed-by-jordan-love-pick-says-neil-reynolds", "urlToImage": null, "publishedAt": "2020-04-24T17:15:29Z", "content": "Aaron Rodgers is the same age as Brett Favre was when he was selected as his eventual successor by the Green Bay Packers with the No 24 pick at the 2005 NFL Draft.\r\nThat nugget became relevant with pick No 26 on day one of the 2020 Draft as the Packers produc… [+2899 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Joe Brophy", "title": "Bundesliga stars may have to play in MASKS with games stopped if they slip off and breaks every 15 mins to - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11472378/bundesliga-play-in-masks-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-24T16:20:47Z", "content": "BUNDESLIGA stars may have to wear masks during matches with games to be stopped if they slip off after the coronavirus lockdown.\r\nSpiegel Sports revealed that leaked documents in Germany from the Ministry of Labour have disclosed plans to equip both players a… [+2347 chars]"}, {"source": {"id": null, "name": "Derbytelegraph.co.uk"}, "author": "Chris Watson", "title": "Derby County favourite has contract terminated by Championship club - Derbyshire Live", "description": "The former Rams midfielder and coach had been part of Graeme Jones' backroom staff at Luton Town", "url": "https://www.derbytelegraph.co.uk/sport/football/football-news/inigo-idiakez-derby-luton-harford-4076842", "urlToImage": null, "publishedAt": "2020-04-24T15:19:00Z", "content": "Derby County favourite Inigo Idiakez has lost his job at Sky Bet Championship club Luton Town.\r\nIdiakez had been first-team coach at Kenilworth Road but has had his contract terminated with immediate effect, along with manager Graeme Jones, assistant boss Gar… [+2928 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Isabella Nikolic For Mailonline", "title": "Serena Williams turns princess as she and her two-year-old daughter Olympia dress up - Daily Mail", "description": "Serena Williams, 38, uploaded an adorable video to her Instagram of her and her daughter, Olympia, dancing along to I Have A Dream from the Disney princess film Tangled on Thursday.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8253889/Serena-Williams-turns-princess-two-year-old-daughter-Olympia-dress-up.html", "urlToImage": null, "publishedAt": "2020-04-24T15:06:54Z", "content": "Serena Williams has been isolating with her husband Alexis Ohanian and daughter Olympia in their Florida home.\r\nAnd to keep her two-year-old entertained, the tennis star has been getting into the Disney spirit with her little one.\r\nSerena, 38, uploaded an ado… [+2881 chars]"}, {"source": {"id": null, "name": "Football365.com"}, "author": "Joe Williams", "title": "Neville predicts 'absolute carnage' unless the Premier League act - Football365.com", "description": "Football365 - \"The future revenues are into the 10s of billions in the Premier League.\"", "url": "https://www.football365.com/news/gary-neville-predicts-absolute-carnage-unless-the-premier-league-act", "urlToImage": null, "publishedAt": "2020-04-24T13:58:20Z", "content": "The Premier League should borrow against future television earnings to safeguard English football’s financial survival amid the coronavirus pandemic, according to former Manchester United defender Gary Neville.\r\nThe Sky Sports pundit believes the league and i… [+2621 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Shane Ireland", "title": "Manchester United sent stunning message over '£130m' Wolves transfer - Birmingham Live", "description": "Wolves transfer news includes pundit's message to Raul Jimenez suitors as Man Utd and Real Madrid linked", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/raul-jimenez-man-utd-wolves-18142364", "urlToImage": null, "publishedAt": "2020-04-24T12:15:27Z", "content": "Wolverhampton Wanderers striker Raul Jimenez would cost suitors well over £100million, according to former Premier League defender Alex Bruce.\r\nJimenez's form has been one of the many highlights of a terrific campaign for Wolves, who are sixth in the table an… [+1600 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Tom Leach", "title": "Gary Neville explains what is remarkable about 'sensational' Liverpool - Liverpool Echo", "description": "The 45-year-old was in action for United at some of the world's biggest and best stadiums during his long career, including Barcelona's Nou Camp.", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-manchester-united-anfield-neville-18137466", "urlToImage": null, "publishedAt": "2020-04-24T10:54:36Z", "content": "Manchester United legend Gary Neville has revealed what it is really like playing against Liverpool at Anfield. \r\nThe former Old Trafford right-back was speaking to Sky Sports' Football Show when he was asked to lift the lid on how it felt to be the bad guy i… [+1472 chars]"}, {"source": {"id": null, "name": "Gloucesterrugby.co.uk"}, "author": null, "title": "Club Statement: RFU Hearing Decision - Gloucester Rugby", "description": "Gloucester Rugby notes the sanctions, imposed on 24 April 2020 by an independent disciplinary panel on the three Respondents in the case of the RFU v Rohan Janse van Rensburg, Sale Sharks and Matthew Ginvert relating to breaches by those Respondents which too…", "url": "https://www.gloucesterrugby.co.uk/2020/04/24/club-statement-rfu-hearing-decision/", "urlToImage": null, "publishedAt": "2020-04-24T10:31:17Z", "content": "Inter Services rugby returned to Kingsholm in 2019 when the Army took on the RAF, and the event was such a success that a long-term agreement has been reached to host fixtures at the home of Gloucester Rugby going forward.\r\nThe Women’s match kicks off at 11:3… [+255 chars]"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Ryan Sidle", "title": "Jelle Klaasen Accused Of Cheating During PDC Home Tour Match - SPORTbible", "description": "The Dutchman went through after topping the group by one leg but fans were quick to point out that his leg finishing double was dodgy.", "url": "https://www.sportbible.com/other/foul-play-jelle-klaasen-appears-to-cheat-during-pdc-home-tour-match-20200424", "urlToImage": null, "publishedAt": "2020-04-24T10:09:21Z", "content": "Former BDO World Champion Jelle Klaasen qualified top from his PDC Home Tour group on Thursday night but was accused of cheating after claiming a double he seemingly missed.\r\nYou've probably wondered at least some point during lockdown if your colleague has c… [+1856 chars]"}, {"source": {"id": null, "name": "Unitedinfocus.com"}, "author": "Dan Coombs", "title": "Manchester United planning tactics with returning Pogba and Rashford, says McKenna - United In Focus - Manchester United FC News", "description": "For the past six weeks Manchester United’s players have been focusing on keeping as fit as possible during a national lockdown. For the club’s coaches, the break has provided a different type of challenge, with added man-management to keep in touch with all o…", "url": "https://www.unitedinfocus.com/news/manchester-united-planning-tactics-with-returning-pogba-and-rashford-says-mckenna/", "urlToImage": null, "publishedAt": "2020-04-24T09:57:42Z", "content": "For the past six weeks Manchester United’s players have been focusing on keeping as fit as possible during a national lockdown.\r\nFor the club’s coaches, the break has provided a different type of challenge, with added man-management to keep in touch with all … [+2127 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Oliver Connolly", "title": "The NFL's virtual draft was dry, boring and everything we needed right now - The Guardian", "description": "The NFL’s lockdown draft felt slapdash, a little weird and less eventful than those in recent years. It was also the first time in a month things felt slightly back to normal", "url": "https://www.theguardian.com/sport/2020/apr/24/nfl-virtual-draft-television-abc-espn", "urlToImage": null, "publishedAt": "2020-04-24T09:00:00Z", "content": "The first round of the NFL draft should have been a series of fireworks, owing as much to do with the wonky set-up the league found itself in. The mock run-through had been a veritable disaster a spouse pulling a plug on a GMs computer, the technology choppin… [+5289 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Mark Wakefield", "title": "Adama Traore agent makes transfer admission amid Liverpool links - Liverpool Echo", "description": "Jurgen Klopp's Liverpool have been linked with a summer move for Adama Traore and his agent has spoken out", "url": "https://www.liverpoolecho.co.uk/sport/football/transfer-news/adama-traore-agent-makes-transfer-18142069", "urlToImage": null, "publishedAt": "2020-04-24T08:36:04Z", "content": "Adama Traore's agent has addressed the future of his client and indicated he still believes there could be a \"market\" for him this summer.\r\n Liverpool and other top teams have been tentatively linked with a move for the Wolverhampton Wanderers winger, with Fo… [+1717 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "John Cross", "title": "Eric Dier facing lengthy ban after being hit with FA charge over fan confrontation - Mirror Online", "description": "Eric Dier has been charged by the FA after he clashed with a fan in the aftermath of Tottenham's FA Cup defeat to Norwich", "url": "https://www.mirror.co.uk/sport/football/news/eric-dier-facing-lengthy-ban-21916800", "urlToImage": null, "publishedAt": "2020-04-24T07:03:13Z", "content": "Eric Dier is facing a lengthy ban after being hit with an FA misconduct charge.\r\nTottenham midfielder Dier climbed into the stand to confront a fan who was having a row with his brother after their FA Cup exit to Norwich last month. \r\nDier has until May 8 to … [+1927 chars]"}, {"source": {"id": null, "name": "Espn.co.uk"}, "author": "NFL Nation", "title": "2020 NFL draft - Pros and cons for every first-round pick - ESPN.co.uk", "description": "Happy with Joe Burrow in Cincinnati? Surprised at Jordan Love to Green Bay? Our NFL Nation reporters analyze how all the top picks fit their new teams.", "url": "https://www.espn.co.uk/nfl/draft2020/story/_/id/29011670/2020-nfl-draft-live-updates-pros-cons-every-first-round-pick", "urlToImage": null, "publishedAt": "2020-04-24T01:47:26Z", "content": "The 2020 NFL draft is one round down, and we have the pros and cons for each of the 32 first-round picks. The Cincinnati Bengals kicked off Thursday's draft by selecting LSU quarterback Joe Burrow, who won a national championship with the Tigers in January, w… [+36693 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Mark McDougall", "title": "Joey Barton blasts Rangers captain James Tavernier over his defending and hair obsession - Daily Record", "description": "The controversial Ibrox flop didn't hold back as he hit out at Tavernier for his defending skills and his lack of preparation for big games.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/joey-barton-blasts-rangers-captain-21916970", "urlToImage": null, "publishedAt": "2020-04-23T21:58:11Z", "content": "Rangers flop Joey Barton has lifted the lid on his controversial spell at Ibrox and blasted skipper James Tavernier for caring more about his hair than football.\r\nBarton has rarely spoken about his time in Glasgow prior to this but opened up in an explosive i… [+1965 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Lee Ryder", "title": "American consortium chief reveals he 'dodged bullet' after talks with Mike Ashley to buy Newcastle United - Chronicle Live", "description": "The New York-born figurehead was eager to take on the job of transforming Newcastle United", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/american-consortium-chief-reveals-dodged-18140537", "urlToImage": null, "publishedAt": "2020-04-23T21:07:57Z", "content": "GACP Sports Capital chairman Joseph DaGrosa has revealed he \"dodged a bullet\" when not buying Newcastle United from Mike Ashley.\r\nThe chairman and CEO of Great American Capital Partners, who sold a stake in Ligue 1 side Bordeaux, held discussions with Justin … [+1193 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Shocks and plenty of goals in Fifa tournament last 16 | ePremier League - BBC Sport", "description": "A shock for one of the favourites as the quarter-final line-up of the ePremier League Invitational tournament is finalised. WATCH LIVE COVERAGE OF THE TOURNA...", "url": "https://www.youtube.com/watch?v=0ujwkpCOCBM", "urlToImage": null, "publishedAt": "2020-04-23T17:40:20Z", "content": null}]}