{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Ian Doyle", "title": "Liverpool goalkeeper Alisson Becker subject of strong claim from Premier League rival - Liverpool Echo", "description": "Liverpool goalkeeper Alisson Becker has been given strong backing from a Premier League rival", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-goalkeeper-alisson-becker-subject-18227684", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article17879023.ece/ALTERNATES/s1200/0_GettyImages-1186140736.jpg", "publishedAt": "2020-05-11T04:04:28Z", "content": "Liverpool's Alisson Becker has been hailed the best goalkeeper in the Premier League by Arsenal counterpart Bernd Leno.\r\nAlisson has proven an outstanding success since arriving from Roma for £65million in the summer of 2018. \r\n The Brazil international earne… [+957 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Quek, Sam Meade", "title": "The Premier League cannot find a fair way to restart games - so it must be voided - Irish Mirror", "description": "Liverpool, Leeds and co would suffer from a voided campaign in England, but finding a fair solution to restart games is becoming impossible meaning authorities could be backed into a corner", "url": "https://www.mirror.co.uk/sport/football/news/premier-league-cannot-find-fair-22006304", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21993382.ece/ALTERNATES/s1200/0_FILES-BRITAIN-HEALTH-VIRUS-ENG-PL.jpg", "publishedAt": "2020-05-11T03:57:22Z", "content": "The return of Germanys Bundesliga next Saturday, added to live football in Asian leagues, suggests the green shoots of recovery are beginning to emerge across the globe.\r\nWhile it feels as though the rest of the world is getting on with it however, the Premie… [+2658 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Jake Polden", "title": "Gary Neville picks between Trent Alexander-Arnold and Aaron Wan-Bissaka - Mirror Online", "description": "England international defenders Trent Alexander-Arnold and Aaron Wan-Bissaka are widely considered to be two of the best right-backs on the planet", "url": "https://www.mirror.co.uk/sport/football/news/gary-neville-picks-between-trent-22005215", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article13742652.ece/ALTERNATES/s1200/0_Gary-Neville-speaking-on-Sky-Sports.jpg", "publishedAt": "2020-05-11T03:18:28Z", "content": "Gary Neville believes Aaron Wan-Bissaka is a better defender than Trent Alexander-Arnold - but admits the Liverpool star is much better at going forward. \r\nEngland international defenders Alexander-Arnold and Wan-Bissaka are widely considered two of the best … [+1566 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Bobby Vincent", "title": "Liverpool denied Man City perfection and avoided the unthinkable with Jurgen Klopp's best transfer - Liverpool Echo", "description": "Liverpool have won three trophies in 12 months and are on course to lift a fourth with van Dijk leading their team", "url": "https://www.liverpoolecho.co.uk/sport/football/transfer-news/liverpool-virgil-van-dijk-transfer-17994635", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article17913288.ece/ALTERNATES/s1200/0_GettyImages-1076891758.jpg", "publishedAt": "2020-05-11T02:06:01Z", "content": "Liverpool sent shockwaves throughout the world of football in late December 2017.\r\nThe Reds, long plagued by defensive issues, made a statement in the transfer market by breaking the world record for a defender when Virgil van Dijk arrived from Southampton fo… [+3992 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Theo Squires", "title": "Xherdan Shaqiri transfer hint and what it could mean for Timo Werner and Milot Rashica at Liverpool - Liverpool Echo", "description": "A transfer trend is emerging at Anfield and could be revisited this summer as Liverpool links to Timo Werner and Milot Rashica persist", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/xherdan-shaqiri-transfer-hint-what-18226536", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article18226560.ece/ALTERNATES/s1200/0_Werner-Shaqiri-Klopp-Rashica.jpg", "publishedAt": "2020-05-11T02:05:39Z", "content": "Liverpool have established themselves as rather opportunistic in the transfer market since Jurgen Klopp arrived at Anfield.\r\nSure, theyre not afraid of spending the big money when they see fit, Virgil van Dijk and Alisson are evidence of that.\r\nTheyre not afr… [+4533 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "David Hughes, Daniel Smith", "title": "Full lockdown will return to avoid 'madness' of second Covid peak - Hull Daily Mail", "description": "If clusters of cases are identified in an area, lockdown measures could be reinstated", "url": "https://www.walesonline.co.uk/news/uk-news/full-lockdown-return-avoid-madness-18229666", "urlToImage": "https://i2-prod.bristolpost.co.uk/incoming/article4101713.ece/ALTERNATES/s1200/0_Coronavirus-Mon-May-4-2020.jpg", "publishedAt": "2020-05-11T00:05:43Z", "content": "Boris Johnson promised to \"put on the brakes\" if Covid-19 cases show signs of increasing as lockdown measures are eased.\r\nIn an effort to reassure a nervous public about adjusting to living with coronavirus, the Prime Minister insisted he would not do anythin… [+2151 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Ryan Taylor", "title": "Liverpool chief Michael Edwards teased as Lyon transfer list £42m Houssem Aouar - Express", "description": "Liverpool's transfer plans may have changed in the wake of the coronavirus crisis.", "url": "https://www.express.co.uk/sport/football/1280394/Liverpool-transfer-news-Michael-Edwards-teased-Lyon-transfer-list-Houssem-Aouar", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/67/750x445/1280394.jpg", "publishedAt": "2020-05-11T00:01:00Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Ryan Taylor", "title": "Five potential transfer targets Liverpool will watch closely when Bundesliga returns - Express", "description": "The Bundesliga is back next weekend and Liverpool could do most of their summer shopping in Germany.", "url": "https://www.express.co.uk/sport/football/1280377/Liverpool-transfer-news-Bundesliga-return-Timo-Werner-Jadon-Sancho-Milot-Rashica", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/67/750x445/1280377.jpg", "publishedAt": "2020-05-11T00:01:00Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Kieran Tierney hints at what Arsenal boss Mikel Arteta has learned from Pep Guardiola - Mirror Online", "description": "Mikel Arteta's coaching education came under Pep Guardiola and Arsenal's Kieran Tierney is keen to learn from the Spaniard", "url": "https://www.mirror.co.uk/sport/football/news/kieran-tierney-hints-what-arsenal-22006072", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21455420.ece/ALTERNATES/s1200/0_Arsenal-Training-Session.jpg", "publishedAt": "2020-05-10T23:22:50Z", "content": "Kieran Tierney has detailed some of the main aspects Mikel Arteta has focused on at Arsenal. \r\nThe Spaniard took over at the Emirates in December after more than three years as Pep Guardiola's No 2.\r\nAnd the Catalan's influence is clear with Tierney discussin… [+1689 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Toby Miles For Mailonline", "title": "'He's the most talented player I've played with': Harry Maguire reveals Marcus Rashford admiration - Daily Mail", "description": "Manchester United captain Harry Maguire has sung the praises of team-mate Marcus Rashford, calling his countryman the most talented player he's played with and praising his dedication.", "url": "https://www.dailymail.co.uk/sport/football/article-8305803/Hes-talented-player-Ive-played-Harry-Maguire-reveals-Marcus-Rashford-admiration.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/10/23/28237176-0-image-a-63_1589150959632.jpg", "publishedAt": "2020-05-10T23:20:26Z", "content": "Manchester United captain Harry Maguire has sung the praises of Marcus Rashford, calling his countryman the most talented player he's played with. \r\nThe pair linked up for England during the Three Lions' run to the semi-finals at the 2018 World Cup finals, be… [+1921 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Gaughan for the Daily Mail", "title": "The inside story of Manchester City's 2012 Premier League title and Sergio Aguero's Hollywood moment - Daily Mail", "description": "The actual defining moment, the most spine-tinglingly bewildering single piece of action in Premier League history, was choreographed seconds beforehand.", "url": "https://www.dailymail.co.uk/sport/football/article-8305479/The-inside-story-Manchester-Citys-2012-Premier-League-title-Sergio-Agueros-Hollywood-moment.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/10/22/28235588-0-image-a-6_1589146692684.jpg", "publishedAt": "2020-05-10T23:20:05Z", "content": "The actual defining moment, the most spine-tinglingly bewildering single piece of action in Premier League history, was choreographed seconds beforehand. All seemingly lost, Manchester City supporters busy thumping seats in anger, Edin Dzeko equalises with 92… [+9631 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "David Maddock", "title": "Andy Robertson tips 'best in the world' Trent Alexander-Arnold for new Liverpool role - Mirror Online", "description": "The Liverpool duo have established themselves as two of the top full backs in world football, though Alexander-Arnold could be poised for a change in his position", "url": "https://www.mirror.co.uk/sport/football/news/andy-robertson-tips-best-world-22004083", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article22004077.ece/ALTERNATES/s1200/0_Liverpool-v-Chelsea-UEFA-Super-Cup-Vodafone-Park-14819.jpg", "publishedAt": "2020-05-10T23:03:32Z", "content": "Trent Alexander-Arnold is the best full back in world footballaccording to someone who really should know. \r\nLiverpool s Andy Robertson has also been touted as a contender for that honour, with some incredible performances from the left back position to draw … [+1697 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Atletico Madrid 'offer Thomas Partey to Liverpool in Alex Oxlade-Chamberlain swap deal' - Mirror Online", "description": "Atletico Madrid and Liverpool could be involved in summer transfer action with the Spaniards keen to swap Thomas Partey for Alex Oxlade-Chamberlain", "url": "https://www.mirror.co.uk/sport/football/news/atletico-madrid-offer-thomas-partey-22006018", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21951053.ece/ALTERNATES/s1200/0_Club-Atletico-de-Madrid-v-Real-Madrid-CF-La-Liga.jpg", "publishedAt": "2020-05-10T22:52:45Z", "content": "Atletico Madrid are eyeing a move for Liverpool's Alex Oxlade-Chamberlain and are prepared to offer Thomas Partey in exchange.\r\nThe Ghanaian was part of the Atletico side that won 3-2 at Anfield back in March.\r\nBut he has been linked with a move away and is k… [+1991 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Charlie Wyett", "title": "Boris Johnson warns all sports will be behind closed doors until coronavirus vaccine is found - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11591922/boris-johnson-sports-behind-closed-doors-coronavirus-vaccine/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/05/SPORT-PREVIEW-no-virus-no-fans.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-05-10T22:52:11Z", "content": "FOOTBALL and all other major sports are set to be warned: No vaccine, no fans.\r\nPM Boris Johnson and his Government believe it is unlikely to be safe to stage events with crowds until a Covid-19 cure is found.\r\nFootball fans could be waiting for more than a y… [+1507 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Mike Keegan For The Daily Mail", "title": "SPORTS AGENDA: Pearce reveals Beckham went to the FA behind his back over London 2012 omission - Daily Mail", "description": "SPORTS AGENDA: Stuart Pearce recalled the furore around his decision to omit David Beckham from the Team GB football squad for London 2012.", "url": "https://www.dailymail.co.uk/sport/football/article-8305459/SPORTS-AGENDA-Pearce-reveals-Beckham-went-FA-London-2012-omission.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/10/23/28236694-0-image-a-5_1589149450934.jpg", "publishedAt": "2020-05-10T22:48:32Z", "content": "Stuart Pearce has claimed David Beckham's agent went to the FA to try and get him into the 2012 Olympic Games squad. \r\nThe former Nottingham Forest hardman has emerged as one of talkSPORTS lockdown stars and previously told the hilarious story of how he craft… [+5913 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Jake Polden", "title": "Bruno Fernandes 'immediately showed up' Paul Pogba when he arrived at Man Utd - Mirror Online", "description": "Manchester United signed Bruno Fernandes from Sporting Lisbon in the January window, and are yet to experience defeat when the Portuguese midfielder has been on the pitch", "url": "https://www.mirror.co.uk/sport/football/news/bruno-fernandes-immediately-showed-up-22005925", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21225837.ece/ALTERNATES/s1200/0_FRANCE-GUINEA-FBL-FRA-GUI-CHARITY.jpg", "publishedAt": "2020-05-10T22:31:00Z", "content": "Bruno Fernandes immediately showed Manchester United what they'd signed, unlike his Red Devils team-mate Paul Pogba.\r\nThat's according to France World Cup winner Frank Leboeuf, who says his compatriot hasn't shown the world he's a \"technical leader\" like Fern… [+2376 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Stephen Mcgowan For The Scottish Daily Mail", "title": "SPFL chief executive Neil Doncaster hits out at Rangers chairman Douglas Park over 'serious threat' - Daily Mail", "description": "Neil Doncaster has insisted that Rangers interim chairman Douglas Park 'crossed the line' by making an alleged threat towards him during a telephone call.", "url": "https://www.dailymail.co.uk/sport/football/article-8305763/SPFL-chief-executive-Neil-Doncaster-hits-Rangers-chairman-Douglas-Park-threat.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/10/23/28235730-0-image-a-34_1589148463577.jpg", "publishedAt": "2020-05-10T22:17:02Z", "content": "Neil Doncaster has insisted that Rangers interim chairman Douglas Park 'crossed the line' by making an alleged threat towards him during a telephone call.\r\nThe Ibrox chief has been accused of making a serious allegation and threating to act in a particular wa… [+4190 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ashley Preece", "title": "Stan Collymore issues scathing attack on Premier League in support of Aston Villa and Leeds United - Birmingham Live", "description": "Aston Villa latest - Collymore says the game we cherish will be \"clunky, awkward-looking and a shadow of a sport\" if play gets the go-ahead. The pundit has issued his own mock Premier League statement, too", "url": "https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-leeds-premier-league-18228314", "urlToImage": "https://i2-prod.birminghammail.co.uk/incoming/article15706296.ece/ALTERNATES/s1200/0_JS172475839.jpg", "publishedAt": "2020-05-10T21:31:14Z", "content": "Former Aston Villa striker Stan Collymore believes the Premier League should be scrapped, ordering chiefs to \"swallow the losses\".\r\nThe pundit insists the show cannot go on given 1,612 reported Covid deaths in the UK in May alone.\r\nIn Germany, the Bundesliga … [+3340 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Formula 1: Sergio Aguero stars in Virtual F1, but Ian Poulter's motors steal the show - BBC Sport", "description": "Sergio Aguero is good at something else - shock - but Ian Poulter has more Ferraris... probably.", "url": "https://www.bbc.co.uk/sport/motorsport/52596357", "urlToImage": "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/E9B7/production/_112213895_ianpoulter.jpg", "publishedAt": "2020-05-10T21:09:00Z", "content": "Ian Poulter shared a glimpse of his garage\r\nSometimes it's not what's right in front of you that catches the eye.\r\nAnd if it's not what is surely the longest-ever running crash in motorsport history, or one of the world's greatest footballers overtaking estab… [+3221 chars]"}, {"source": {"id": null, "name": "Randa.org"}, "author": null, "title": "Response from UK golf bodies to PM announcement - R&A", "description": "A statement on the playing of golf in the UK has been issued following the announcement made by the UK Government on 10 May.", "url": "https://www.randa.org/News/2020/05/UK-Golf-and-the-Coronavirus-Group-statement", "urlToImage": "/~/media/images/site-images/championship-updates-18-19/silhouette-123.ashx", "publishedAt": "2020-05-10T20:47:40Z", "content": "The UK Government has announced that golf will be able to resume in England on Wednesday, 13 May 2020. All outdoor sport must be done alone or within a household group and that includes golf. There is no change to the current position in Northern Ireland, Sco… [+2093 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Josh Challies, Shane Ireland", "title": "Boris Johnson delivers update on West Brom & Leeds United Championship tussle restarting - Birmingham Live", "description": "Prime Minister has addressed the nation to unveil a roadmap of how the UK will slowly exit lockdown, which includes live sporting events such as the Championship as WBA and Leeds United plot promotion", "url": "https://www.birminghammail.co.uk/sport/football/football-news/johnson-speech-wba-leeds-united-18229991", "urlToImage": "https://i2-prod.birminghammail.co.uk/sport/football/football-news/article18230037.ece/ALTERNATES/s1200/0_JS211745999.jpg", "publishedAt": "2020-05-10T20:38:35Z", "content": "Prime Minister Boris Johnson has issued an update on the governments response to the coronavirus crisis ahead of a key week for football's governing bodies.\r\nIt seems unlikely that Premier League or EFL football will be played in June, with the current measur… [+2359 chars]"}, {"source": {"id": null, "name": "Coventrytelegraph.net"}, "author": "Chris Watson", "title": "'Left unhappy' - Manager reacts to plan that would see Coventry City promoted - Coventry Telegraph", "description": "The Sky Blues currently sit top of the League One table with 10 games of the season remaining", "url": "https://www.coventrytelegraph.net/sport/football/football-news/coventry-city-points-per-game-18229755", "urlToImage": "https://i2-prod.coventrytelegraph.net/sport/football/football-news/article18077235.ece/ALTERNATES/s1200/0_23445758-1.jpg", "publishedAt": "2020-05-10T20:29:34Z", "content": "When the coronavirus crisis brought Coventry City's promotion charge to a grinding half, the Sky Blues were five points clear at the top of the League One table.\r\nMark Robins' men also have a game in hand over second-placed Rotherham United, and their other c… [+1230 chars]"}, {"source": {"id": null, "name": "Coventrytelegraph.net"}, "author": "Chris Watson", "title": "'Anger' - Coventry City old boy opens up about leaving Liverpool and Sky Blues shock - Coventry Telegraph", "description": "The midfielder made 72 appearances for the club and scored 16 goals", "url": "https://www.coventrytelegraph.net/sport/football/football-news/david-thompson-liverpool-coventry-city-18229387", "urlToImage": "https://i2-prod.coventrytelegraph.net/sport/football/football-news/article18229423.ece/ALTERNATES/s1200/0_David-Thompson.jpg", "publishedAt": "2020-05-10T20:29:09Z", "content": "David Thompson admits it was a \"shock to the system\" when he left Liverpool to join Coventry City.\r\n Thompson signed for the Sky Blues for £3million in 2000, having come up through the ranks at Anfield. \r\nThe midfielder went on to make 72 appearances for Cove… [+1468 chars]"}, {"source": {"id": null, "name": "Weallfollowunited.com"}, "author": "Pranav Nair", "title": "Manchester United ace Dean Henderson believes he is better than De Gea - We All Follow United", "description": "Dean Henderson believes he should be starting over David de Gea as number one According to Duncan Castles (h/t Express), on loan goalkeeper Dean Henderson believes he is better than current Manchester United number one David de Gea. Currently on loan at Sheff…", "url": "https://weallfollowunited.com/2020/05/11/manchester-united-ace-dean-henderson-believes-he-is-better-than-de-gea/", "urlToImage": "https://weallfollowunited.com/wp-content/uploads/2017/10/Dean-Henderson-2.jpg", "publishedAt": "2020-05-10T20:17:14Z", "content": "According to Duncan Castles (h/t Express), on loan goalkeeper Dean Henderson believes he is better than current Manchester United number one David de Gea.\r\nCurrently on loan at Sheffield United, Henderson has impressed in his first season in the top-flight. H… [+1937 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Aguer-NO! Man City striker off the pace in F1's Virtual Spanish Grand Prix - Goal.com", "description": "Real Madrid captain Sergio Ramos said Spain needs football to boost the economy and distract fans as LaLiga eyes a June return following the COVID-19 crisis", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2020-05-10T20:13:00Z", "content": "More"}, {"source": {"id": null, "name": "Justarsenal.com"}, "author": "Admin Martin", "title": "Ryan Giggs recommends Arsenal target to Manchester United - Just Arsenal News", "description": "Ryan Giggs has urged Manchester United to make a move for Swansea’s Joe Rodon, who has been linked with a move to Arsenal reports the Mirror. Rodon has been one of Arsenal’s main transfer target as Mikel Arteta looks to add more quality to his defence in the …", "url": "https://www.justarsenal.com/ryan-giggs-recommends-arsenal-target-to-manchester-united/244629", "urlToImage": "https://icdn.justarsenal.com/wp-content/uploads/2020/02/rodon.jpg", "publishedAt": "2020-05-10T20:00:22Z", "content": "Ryan Giggs has urged Manchester United to make a move for Swanseas Joe Rodon, who has been linked with a move to Arsenal, reports the Mirror.\r\nRodon has been one of Arsenals main transfer target as Mikel Arteta looks to add more quality to his defence in the … [+1011 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Coronavirus: Five La Liga players return positive tests - Sky Sports", "description": "La Liga has confirmed that five unnamed players across Spain's top two divisions have tested positive for coronavirus.", "url": "https://www.skysports.com/football/news/11827/11986156/coronavirus-five-la-liga-players-return-positive-tests", "urlToImage": "https://e0.365dm.com/19/05/1600x900/skysports-la-liga-laliga-logo_4680358.jpg", "publishedAt": "2020-05-10T19:58:37Z", "content": "La Liga has confirmed that five players have tested positive for coronavirus.\r\nAll five unnamed players - across the Spanish league's top two divisions - are asymptomatic and in the final phase of having the disease, but will now go into quarantine and will b… [+5072 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Premier League restart plan still has a lot of hoops to go through - Ian Darke | ESPN FC - ESPN UK", "description": "ESPN FC's Ian Darke and Julien Laurens give the latest updates on the Premier League's plans to resume play. Darke says the players' main concern is safety, ...", "url": "https://www.youtube.com/watch?v=CQ32ej1dPfM", "urlToImage": "https://i.ytimg.com/vi/CQ32ej1dPfM/maxresdefault.jpg", "publishedAt": "2020-05-10T19:58:18Z", "content": null}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Josh Challies", "title": "Ian Wright admits he could see Liverpool signing Paris Saint-Germain star Kylian Mbappe - Liverpool Echo", "description": "Liverpool have been continuously linked with a move for Paris Saint-Germain forward Kylian Mbappe", "url": "https://www.liverpoolecho.co.uk/sport/football/transfer-news/ian-wright-admits-could-see-18229043", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/sport/football/football-news/article18180513.ece/ALTERNATES/s1200/0_GettyImages-1093410566.jpg", "publishedAt": "2020-05-10T19:25:22Z", "content": "Former Arsenal and England striker Ian Wright has admitted he could see Liverpool signing Kylian Mbappe from Paris Saint-Germain in the near future.\r\nThe World Cup winner has established himself as the finest young forward in world football, with a remarkable… [+956 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nJeremy Wilson,", "title": "Golf, tennis and angling among those racing to be ready for return of recreational sports - Telegraph.co.uk", "description": "Governing bodies discovered late on Sunday they will be allowed to open up facilities", "url": "https://www.telegraph.co.uk/sport/2020/05/10/golf-tennis-angling-among-racing-ready-return-recreational-sports/", "urlToImage": "https://www.telegraph.co.uk/content/dam/sport/2020/05/10/TELEMMGLPICT000230978654_1_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg?impolicy=logo-overlay", "publishedAt": "2020-05-10T19:21:00Z", "content": "Although many sports will be delighted to again be able to offer availability to their members, many clubs will struggle to reopen as quickly as Wednesday,\r\nThis is because many staff have been furloughed and facilities have been shut for the past seven weeks… [+2705 chars]"}, {"source": {"id": null, "name": "Autosport.com"}, "author": "Adam Cooper", "title": "F1 News: F1 is in discussions with UK government about quarantine for arrivals - Autosport", "description": "Formula 1 is in discussions with the British government about the implications of a quarantine on those arriving from overseas, which is set to be imposed in the coming weeks", "url": "https://www.autosport.com/f1/news/149367/f1-in-discussion-with-uk-government-over-quarantine", "urlToImage": "https://d2d0b2rxqzh1q5.cloudfront.net/sv/2.183/dir/971/image/97125c300d4ed7b8d37e35ae34796d9b.jpg", "publishedAt": "2020-05-10T19:18:49Z", "content": "Formula 1 is in discussions with the British government about the implications of a quarantine on those arriving from overseas, which is set to be imposed in the coming weeks. \r\nUnlike many other countries, the UK has imposed no restrictions on arrivals since… [+1322 chars]"}, {"source": {"id": null, "name": "Hitc.com"}, "author": "Shane Callaghan", "title": "Report makes claim about Newcastle boss - HITC - Football, Gaming, Movies, TV, Music", "description": "It must be a difficult time for Newcastle United boss Steve Bruce. The veteran English manager has seen his long-term future at St James’s Park come under serious doubt in recent weeks. Newcastle are set for a £300 million takeover by a Saudi-led group who wi…", "url": "https://www.hitc.com/en-gb/2020/05/10/report-makes-claim-about-newcastle-boss/", "urlToImage": "https://www.hitc.com/static/uploads/hitcn/1815/steve_bruce_manager_of_newcastle_united_shakes_hands_with_brenda_1543841.jpg", "publishedAt": "2020-05-10T19:17:43Z", "content": "Steve Bruce, Manager of Newcastle United reacts as Carlo Ancelotti, Manager of Everton looks on during the Premier League match between Everton FC and Newcastle United at Goodison Park on (Alex Livesey/Getty Images)\r\nIt must be a difficult time for Newcastle … [+1474 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Daniel Murphy", "title": "Manchester United fans make Odion Ighalo transfer plea as loan approaches end - Manchester Evening News", "description": "Odion Ighalo's loan spell at Man Utd is reaching its conclusion", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/manchester-united-transfers-odion-ighalo-18229115", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/incoming/article18229181.ece/ALTERNATES/s1200/0_GettyImages-1212035356.jpg", "publishedAt": "2020-05-10T18:55:06Z", "content": "Manchester United fans have made it clear that they want Odion Ighalo to stay at the club when his loan spell ends. \r\n After opting against signing Erling Braut Haaland in January as they looked to bolster their attacking ranks, United instead made the surpri… [+1565 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Shafiqullah Shafaq: Afghanistan wicketkeeper-batsman handed six-year ban - BBC Sport", "description": "Afghanistan wicketkeeper-batsman Shafiqullah Shafaq has been banned for six years from all forms of cricket after breaching anti-corruption rules.", "url": "https://www.bbc.co.uk/sport/cricket/52609990", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/02D2/production/_112222700_shafaq_getty.jpg", "publishedAt": "2020-05-10T18:33:56Z", "content": "Shafiqullah Shafaq has played 24 one-day internationals and 46 Twenty20s for Afghanistan\r\nAfghanistan wicketkeeper-batsman Shafiqullah Shafaq has been banned for six years from all forms of cricket after breaching anti-corruption rules.\r\nShafaq admitted to fo… [+868 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Giggs names four Man Utd players who were immune from Sir Alex's 'hairdryer treatment' - Goal", "description": "Real Madrid captain Sergio Ramos said Spain needs football to boost the economy and distract fans as LaLiga eyes a June return following the COVID-19 crisis", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2020-05-10T17:49:29Z", "content": "More"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Adnan Riaz", "title": "Liverpool Fans Named The 'Sexiest' Supporters In The Premier League - SPORTbible", "description": "Liverpool fans received 26 per cent of the votes, with 55 per cent of supporters admitting they would love to have sex with a rival fan.", "url": "https://www.sportbible.com/football/pub-talk-news-liverpool-fans-named-the-sexiest-supporters-in-the-premier-league-20200510", "urlToImage": "https://images.ladbible.com/thumbnail?type=jpeg&url=http://beta.ems.ladbiblegroup.com/s3/content/b7e9c1265eb81d573dae790929973797.png&quality=70&width=808", "publishedAt": "2020-05-10T17:20:42Z", "content": "Liverpool fans have climbed to the top of the table for the 'sexiest' supporters for any Premier League team.\r\nAccording to a survey from Free Super Tips, the Reds are top of the list for the best-looking fans and the ones that supporters would want to sleep … [+1731 chars]"}, {"source": {"id": null, "name": "Racingpost.com"}, "author": "Racing Post staff", "title": "How to watch, bet and find the winners: your guide to enjoying the French action - Racing Post", "description": "Live racing returns from France on Monday after the coronavirus-enforced shutdown of the sport.", "url": "https://www.racingpost.com/news/how-to-watch-bet-and-find-the-winners-your-guide-to-enjoying-the-french-action/433587", "urlToImage": null, "publishedAt": "2020-05-10T17:15:00Z", "content": "Live racing returns from France on Monday after the coronavirus-enforced shutdown of the sport. Three meetings take place at Longchamp, Toulouse and Compiegne and here we guide you through what you need to know to enjoy the action in full.\r\nHow to watch\r\nSky … [+2132 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Dominic Booth", "title": "Ryan Giggs explains big difference between him and Paul Scholes at Manchester United - Manchester Evening News", "description": "The two Man Utd legends won everything at Old Trafford under Sir Alex Ferguson with Giggs now the Wales international manager.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-utd-giggs-scholes-news-18228406", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/incoming/article18228411.ece/ALTERNATES/s1200/0_GettyImages-486628675.jpg", "publishedAt": "2020-05-10T17:10:45Z", "content": "Ryan Giggs has revealed that Paul Scholes was still pushing to play every week for Manchester United in the twilight of his career.\r\nBoth Giggs and Scholes elongated their United careers under Sir Alex Ferguson, with the Welshman breaking the club's appearanc… [+1321 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Marcus Christenson", "title": "Bundesliga CEO adamant season will restart despite positive tests at Dresden - The Guardian", "description": "The Bundesliga was keen to press ahead with plans to restart the season despite the Dynamo Dresden squad being quarantined", "url": "https://www.theguardian.com/football/2020/may/10/bundesliga-ceo-adamant-season-restart-dynamo-dresden-quarantine", "urlToImage": "https://i.guim.co.uk/img/media/f423ff94614863682886f10d41ea2779d20dbafa/0_545_4310_2586/master/4310.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d4480e8f8016426f5c8cc6204e1dc6b3", "publishedAt": "2020-05-10T17:08:55Z", "content": "The Bundesliga is keen to press ahead with plans to restart the season for the top two tiers next weekend, despite Dynamo Dresdens squad being quarantined for two weeks.\r\nDresdens players were sent home after two tested positive for coronavirus. This means th… [+1498 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Free Fight: Alistair Overeem vs Brock Lesnar - UFC - Ultimate Fighting Championship", "description": "Alistair Overeem headlines Saturday's Fight Night event in a heavyweight matchup with Walt Harris. Take a look back at when Overeem defeated one of the bigge...", "url": "https://www.youtube.com/watch?v=B-1Ef2EMPxM", "urlToImage": "https://i.ytimg.com/vi/B-1Ef2EMPxM/maxresdefault.jpg", "publishedAt": "2020-05-10T17:00:04Z", "content": null}, {"source": {"id": null, "name": "Footballfancast.com"}, "author": null, "title": "Newcastle fans left stunned by links with Odion Ighalo - FootballFanCast.com", "description": "Newcastle fans react on social media as Sky Sports claim the club are interested in signing Odion Ighalo if the takeover gets complete.", "url": "https://www.footballfancast.com/newcastle-united-news/newcastle-odion-ighalo-transfer-loan-man-utd-shanghai-shenhua-fans-react", "urlToImage": "https://cdn.footballfancast.com/wp-content/uploads/2020/03/Odion-Ighalo-Manchester-United-600x310.jpg", "publishedAt": "2020-05-10T16:30:00Z", "content": "With the club on the verge of being taken over, naturally, Newcastle have been linked with a whole host of players in recent weeks, with names like Edinson Cavani and Philippe Coutinho being bandied about.\r\nBut according to a report from Sky Sports, the Magpi… [+2282 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Jack Figg", "title": "Henry Cejudo makes shock RETIREMENT from UFC in Octagon following controversial win over legend Dominick Cruz - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/mma/11588388/henry-cejudo-retires-ufc-dominick-cruz/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/05/GettyImages-1223917907.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-05-10T16:07:57Z", "content": "HENRY CEJUDO cemented his place as undisputed king of the bantamweights after beating all-time great Dominick Cruz - before announcing plans to walk away from the sport.\r\nCruz, the UFC's inaugural 135lb champion, stepped in on late notice to replace Jose Aldo… [+2999 chars]"}, {"source": {"id": null, "name": "Planetf1.com"}, "author": "", "title": "Don't expect to see Hamilton in virtual races - PlanetF1", "description": "Lewis Hamilton has been doing his own virtual racing, but don't expect to see him getting involved in the current competitions.", "url": "https://www.planetf1.com/news/lewis-hamilton-virtual-races/", "urlToImage": "https://d3cm515ijfiu6w.cloudfront.net/wp-content/uploads/2020/03/16110815/Max-Verstappen-and-Lewis-Hamilton-2020.jpg", "publishedAt": "2020-05-10T16:07:09Z", "content": "Lewis Hamilton has been doing his own virtual racing, but don’t expect to see him getting involved in the current competitions.\r\nWith the real-life racing on hold, several Formula 1 drivers have taken to virtual racing in a bid to pass the time and also keep … [+2543 chars]"}, {"source": {"id": null, "name": "Justarsenal.com"}, "author": "Admin Martin", "title": "Pierre-Emerick Aubameyang’s transfer promise to his grandfather revealed - Just Arsenal News", "description": "Pierre-Emerick Aubameyang may look to keep the promise he made to his granddad before he died and that will be bad news for the Gunners The Gabonese attacker has been one of the most sought-after players in the last few months as he enters the final year of h…", "url": "https://www.justarsenal.com/pierre-emerick-aubameyangs-transfer-promise-to-his-grandfather-revealed/244589", "urlToImage": "https://icdn.justarsenal.com/wp-content/uploads/2020/02/aubameyang-vs-west-ham.jpg", "publishedAt": "2020-05-10T14:01:46Z", "content": "Pierre-Emerick Aubameyang may look to keep the promise he made to his grandad before he died and that will be bad news for the Gunners\r\nThe Gabonese attacker has been one of the most sought-after players in the last few months as he enters the final year of h… [+1041 chars]"}, {"source": {"id": null, "name": "Whufc.com"}, "author": null, "title": "A personal tribute from the family of John Lyall - West Ham United F.C.", "description": "Murray Lyall - on behalf of his mum Yvonne, wife Samantha, and sons Scott, Charlie and Sam – has written the following tribute to the much-loved man and manager who led West Ham United to FA Cup glory 40 years ago today, to share with Hammers fans everywhere…", "url": "https://www.whufc.com/news/articles/2020/may/10-may/personal-tribute-family-john-lyall", "urlToImage": "https://www.whufc.com/sites/default/files/2020-05/Lyall1220_1.jpg", "publishedAt": "2020-05-10T13:30:49Z", "content": "Murray Lyall - on behalf of his mum Yvonne, wife Samantha, and sons Scott, Charlie and Sam has written the following tribute to the much-loved man and manager who led West Ham United to FA Cup glory 40 years ago today, to share with Hammers fans everywhere\r\nT… [+2728 chars]"}, {"source": {"id": null, "name": "Scotsman.com"}, "author": "Barry Anderson", "title": "Ian Murray: Big questions to be asked at Hearts - Ann Budge must delay FoH handover - Edinburgh News", "description": "Former Foundation chair says fans shouldn’t be owners during coronavirus crisis", "url": "https://www.edinburghnews.scotsman.com/sport/football/hearts/ian-murray-big-questions-be-asked-hearts-ann-budge-must-delay-foh-handover-2848262", "urlToImage": "https://www.edinburghnews.scotsman.com/webimg/b25lY21zOjkyYjIwYzVjLWNiNGYtNDZmYy05YTM2LTBhZjM0ZjBmYzI4ZToyNDliMTU3MC1hYWVhLTQ1ZGItYjlmZS02YjQ4MDdmODNmM2U=.jpg", "publishedAt": "2020-05-10T12:55:00Z", "content": "Ian Murray MP was Foundation of Hearts chairman in 2014 and 2015. Copyright: Other 3rd Party\r\nFormer Hearts director Ian Murray MP believes Ann Budge should not hand ownership of the Edinburgh club to Foundation of Hearts during the coronavirus crisis.\r\nMurra… [+4725 chars]"}, {"source": {"id": null, "name": "Planetf1.com"}, "author": "", "title": "Silverstone marshals call British GP 'unnecessary risk' - PlanetF1", "description": "The British GP could go ahead this season behind closed doors, but marshals still have safety concerns for the event.", "url": "https://www.planetf1.com/news/british-gp-an-unnecessary-risk/", "urlToImage": "https://d3cm515ijfiu6w.cloudfront.net/wp-content/uploads/2019/07/10073932/Silverstone-logo-PA.jpg", "publishedAt": "2020-05-10T12:38:40Z", "content": "The British GP could go ahead this season behind closed doors, but marshals still have safety concerns for the event.\r\nUnder their plans Formula 1 want to create a “bubble of isolation“, placing strict limits on who is allowed into the paddock on race weekend… [+2703 chars]"}, {"source": {"id": null, "name": "Manutd.com"}, "author": "Mark Froggatt", "title": "Solskjaer compares Jordan to a fearless United great - Manchester United", "description": "Ole has been inspired by The Last Dance and admits the NBA legend is similar to an iconic former team-mate.", "url": "https://www.manutd.com/en/news/detail/ole-gunnar-solskjaer-compares-nba-legend-michael-jordan-to-roy-keane", "urlToImage": "https://assets.manutd.com/AssetPicker/images/0/0/13/207/905173/GettyImages-3297591589101882270_large.jpg", "publishedAt": "2020-05-10T11:45:00Z", "content": "Meanwhile, from the squad, Aaron Wan-Bissaka revealed to us that he’s also been motivated by Jordan’s unrelenting desire to win at all costs. \r\n“I started watching The Last Dance, a big documentary about Michael Jordan and the Chicago Bulls,” the young defend… [+473 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Joe Miles", "title": "Mike Tyson piles praise on ‘vicious’ Francis Ngannou after stunning 19-second win over Jairzinho Rozenstruik a - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/11588789/mike-tyson-francis-ngannou-ufc/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/05/sport-preview-Ngannou.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-05-10T11:41:53Z", "content": "MIKE TYSON tipped Francis Ngannou to be a future UFC champion after his incredible win over Jairzinho Rozenstruik.\r\nIt took the hard-hitting heavyweight just 19 seconds to knock his opponent out cold at the behind closed doors event in Florida.\r\n Francis Ngan… [+1552 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Evander Holyfield challenges Mike Tyson to trilogy fight - Metro.co.uk", "description": "Will these two legends get it on again?", "url": "https://metro.co.uk/2020/05/10/evander-holyfield-challenges-mike-tyson-trilogy-fight-12681207/", "urlToImage": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2020/05/evander-6278_1589108513.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "publishedAt": "2020-05-10T11:35:00Z", "content": "Heavyweight boxing legend Evander Holyfield is ready to follow Mike Tyson and come out of retirement (Picture: TMZ)\r\nEvander Holyfield insists he is ready to come out of retirement and fight fellow heavyweight legend Mike Tyson for a third time. \r\nIron Mike t… [+1987 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Lee Ryder", "title": "How Newcastle United's transfer narrative has been transformed this summer - Chronicle Live", "description": "The Magpies could now get a huge transfer kitty with names like Philippe Coutinho and Kalidou Koulibaly linked", "url": "https://www.chroniclelive.co.uk/sport/football/transfer-news/how-newcastle-uniteds-transfer-narrative-18225321", "urlToImage": "https://i2-prod.chroniclelive.co.uk/incoming/article18155164.ece/ALTERNATES/s1200/0_Links.jpg", "publishedAt": "2020-05-10T11:23:41Z", "content": "Napoli defender Kalidou Koulibaly would cost Newcastle United a cool £90million this summer.\r\nThat is the price tag that the likes of Liverpool and Paris Saint-Germain have been quoted in recent weeks as transfer talk hots up ahead of what will be an unusual … [+2921 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Philip O'Connor", "title": "UFC fighters ‘could lose purses and bonuses’ for criticising coronavirus health and safety measures - The Independent", "description": "Before competing, fighters taking part at UFC 249 were asked to sign an eight-page event participation agreement", "url": "https://www.independent.co.uk/sport/general/mma/ufc-249-results-coronavirus-tony-ferguson-justin-gaethje-criticism-dana-white-a9507226.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/05/10/11/pri151314866.jpg", "publishedAt": "2020-05-10T10:54:11Z", "content": "Fighters taking part at UFC 249 could lose their purses and bonuses if they publicly criticise the fight promotions health and safety precautions for Covid-19.\r\nWith sporting events cancelled around the globe due to the novel coronavirus outbreak, the UFC is … [+2101 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Uche Amako", "title": "Chelsea boss Frank Lampard sent Hakim Ziyech message ahead of summer move - Express", "description": "With the signing of Hakim Ziyech, Chelsea will soon be welcoming one of the most creative talents in European football.", "url": "https://www.express.co.uk/sport/football/1280236/Chelsea-transfer-news-Frank-Lampard-Hakim-Ziyech-Jesper-Gronkjaer-gossip-rumours", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/67/750x445/1280236.jpg", "publishedAt": "2020-05-10T10:15:09Z", "content": null}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Tyrone Marshall", "title": "Louis van Gaal says his Manchester United replacement Jose Mourinho owes him explanation over sacking - Manchester Evening News", "description": "Jose Mourinho replaced Louis van Gaal as Man Utd manager in the summer of 2016 but the Dutchman hasn't forgotten his unsavoury Old Trafford exit.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-utd-van-gaal-mourinho-18227625", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/incoming/article11435259.ece/ALTERNATES/s1200/JS91173215.jpg", "publishedAt": "2020-05-10T10:02:48Z", "content": "Louis van Gaal has called for Jose Mourinho to explain the circumstances behind replacing him as Manchester United manager in the summer of 2016. \r\n The Dutchman was axed by United within hours of the FA Cup in 2016, the first silverware since Sir Alex Fergus… [+2493 chars]"}, {"source": {"id": null, "name": "Racefans.net"}, "author": "https://www.facebook.com/racefansdotnet/", "title": "F1 one of the hardest sports to hold amid pandemic - Webber - RaceFans", "description": "Formula 1 is \"probably the worst sport in the world\" to try to hold during the pandemic, says former driver Mark Webber.", "url": "https://www.racefans.net/2020/05/10/f1-one-of-the-hardest-sports-to-hold-amid-pandemic-webber/", "urlToImage": "https://www.racefans.net/wp-content/uploads/2019/05/racefansdotnet-20190512-124917-5.jpg", "publishedAt": "2020-05-10T09:47:00Z", "content": "Formula 1’s global nature will make it one of the hardest sports to hold amid the pandemic, former driver Mark Webber has warned.\r\nThe nine-times grand prix winner told Australian news channel 9now he expects F1 will be able to hold races this year, but “in a… [+2127 chars]"}, {"source": {"id": null, "name": "Yorkshireeveningpost.co.uk"}, "author": "James Copley", "title": "Leeds United receive TRIPLE transfer blow as Manchester United fend off Whites interest in starlet - gossip - Yorkshire Evening Post", "description": "With the Bundesliga set to return to action next week, will the Premier League and Championship follow suit?", "url": "https://www.yorkshireeveningpost.co.uk/sport/football/leeds-united/leeds-united-receive-triple-transfer-blow-manchester-united-fend-whites-interest-starlet-gossip-2848165", "urlToImage": "https://www.yorkshireeveningpost.co.uk/webimg/QVNIMTE0ODk3MjQz.jpg", "publishedAt": "2020-05-10T09:44:47Z", "content": "In the meantime, speculation is showing no signs of slowing down when it comes to the upcoming transfer window and weve got all the latest gossip!\r\nWere sharing the latest rumours from around the Championship so scroll and click through the pages to see the l… [+907 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Dominic Booth", "title": "Manchester United great Bryan Robson highlights key Ole Gunnar Solskjaer decision - Manchester Evening News", "description": "The former Man Utd captain has been talking about a vital Ole Gunnar Solskjaer that came midway through the Premier League season.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-utd-captain-solskjaer-news-18227585", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/incoming/article18227591.ece/ALTERNATES/s1200/0_GettyImages-1177962941.jpg", "publishedAt": "2020-05-10T09:29:41Z", "content": "Bryan Robson believes it was a good move by Ole Gunnar Solskjaer to hand the Manchester United captaincy to Harry Maguire earlier this season.\r\n United needed a new club captain in January when Ashley Young sealed a transfer to Inter Milan, bringing to an end… [+1455 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Mark Jones", "title": "Christian Eriksen living at Inter Milan training ground and stopped by police - Mirror Online", "description": "The former Tottenham star has had a nightmare few months since swapping life in the Premier League for Serie A, and has had to abandon his plans to go house hunting", "url": "https://www.mirror.co.uk/sport/football/news/christian-eriksen-living-inter-milan-22003422", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article22003442.ece/ALTERNATES/s1200/0_Christian-Eriksen-Undergoes-Medical-At-Inter-Milan.jpg", "publishedAt": "2020-05-10T09:27:40Z", "content": "Christian Eriksen has been spending lockdown at Inter Milan's training ground as the coronavirus crisis has caused him to abandon house hunting in Italy. \r\n The former Tottenham star joined the Serie A giants in January, but managed just eight appearances for… [+1609 chars]"}, {"source": {"id": null, "name": "Trendswide.com"}, "author": "souhaib", "title": "Transfer rumours: Meunier, De Gea, Martinez, Milinkovic-Savic, Magno, Saka - Trends Wide", "description": "Tottenham are currently leading Manchester United in the race to sign Paris St-Germain's Belgium right-back Thomas Meunier, 28. (Sun)", "url": "https://trendswide.com/transfer-rumours-meunier-de-gea-martinez-milinkovic-savic-magno-saka/", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/B325/production/_112216854_52602669.jpg", "publishedAt": "2020-05-10T09:24:26Z", "content": "Tottenham are currently leading Manchester United in the race to sign Paris St-Germain’s Belgium right-back Thomas Meunier, 28. (Sun) \r\nManchester United are considering replacements for David de Gea, even though the 29-year-old Spain goalkeeper signed a new … [+1306 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Matt Porter For Mailonline", "title": "Manchester City 'fully prepared to appeal Champions League ban' - Daily Mail", "description": "Manchester City's lawyers are raring to go when it comes to appealing the club's two-year Champions League ban, according to The Mirror. The club also received a £25million fine for FPP breaches.", "url": "https://www.dailymail.co.uk/sport/sportsnews/article-8304153/Manchester-City-fully-prepared-appeal-Champions-League-ban.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/10/00/28208286-0-image-a-12_1589066197975.jpg", "publishedAt": "2020-05-10T09:09:15Z", "content": "Manchester City's lawyers are raring to go when it comes to appealing the club's two-year Champions League ban, according to The Mirror. \r\nCity were hoping to have their case heard by the Court of Arbitration for Sport (CAS) this month, however the coronaviru… [+1731 chars]"}, {"source": {"id": null, "name": "Coventrytelegraph.net"}, "author": "Tom Leach", "title": "The big roadblock standing in the way of promotion for Coventry City - Coventry Telegraph", "description": "Mark Robins Coventry City would win the division comfortable if 'weighted PPG' was introduced to decide the final stands, promoting the Sky Blues to the Championship.", "url": "https://www.coventrytelegraph.net/sport/football/football-news/coventry-city-championship-promotion-latest-18225424", "urlToImage": "https://i2-prod.chroniclelive.co.uk/incoming/article17179143.ece/ALTERNATES/s1200/0_GettyImages-631220542.jpg", "publishedAt": "2020-05-10T08:02:20Z", "content": "Coventry City's League One rivals Peterborough United have threatened to launch a \"legal battle of epic proportions\" if the EFL hold a vote to decide who will be promoted next week - a move that could prove to be a big roadblock between the Sky Blues and thei… [+2405 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "European Classic: Liverpool 1-0 Club Brugge | Kenny retains the European Cup at Wembley - Liverpool FC", "description": "Relive the key moments from the 1978 European Cup final, as Kenny Dalglish's delicate finish gave the Reds another European success against Ernst Happel's Br...", "url": "https://www.youtube.com/watch?v=yaXGLt9D9Dw", "urlToImage": "https://i.ytimg.com/vi/yaXGLt9D9Dw/maxresdefault.jpg", "publishedAt": "2020-05-10T08:00:20Z", "content": "Relive the key moments from the 1978 European Cup final, as Kenny Dalglish's delicate finish gave the Reds another European success against Ernst Happel's Brugge.\r\nEnjoy more content and get exclusive perks in our Liverpool FC Members Area, click here to find… [+176 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Gavin Berry", "title": "Gary Mackay backs Hearts fan to dig deep for legal fight fund with club on brink of relegation - Daily Record", "description": "Ann Budge assessing her next move to “formally challenge” the decision after her club were pushed closer to the drop.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/gary-mackay-backs-hearts-fan-22002359", "urlToImage": "https://i2-prod.dailyrecord.co.uk/incoming/article1959427.ece/ALTERNATES/s1200/Gary-Mackay.jpg", "publishedAt": "2020-05-10T05:04:08Z", "content": "Hearts legend Gary Mackay insists fans are ready to dig deep to fund a legal fight if the club decide to take such a route.\r\nIt comes after Ann Budge had threatened action at the start of the shutdown and Mackay said: If it comes to it, I know within the Hear… [+3071 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Connor O'Neill", "title": "How Arsenal, Chelsea and Tottenham fans can watch the Bundesliga on TV - Football.London", "description": "The Bundesliga is due to resume on May 16 - the first major European league to do so", "url": "https://www.football.london/premier-league/bundesliga-live-stream-matches-channel-18226028", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/sport/football/article18178030.ece/ALTERNATES/s1200/2_Bundesliga.jpg", "publishedAt": "2020-05-10T03:10:06Z", "content": "Live European football is set to return to TV screens on May 16 as the Bundesliga restarts behind-closed-doors.\r\nGermany's top- flight football season will return under strict health and safety rules and with no fans attending games, a move that the Premier L… [+2423 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Ian Doyle", "title": "Barcelona told to agree Liverpool transfer for Roberto Firmino and ditch Argentina forward - Liverpool Echo", "description": "Barcelona have been told to make a move for Liverpool forward Roberto Firmino", "url": "https://www.liverpoolecho.co.uk/sport/football/transfer-news/barcelona-told-agree-liverpool-transfer-18224646", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article17908725.ece/ALTERNATES/s1200/3_JS208826516.jpg", "publishedAt": "2020-05-10T02:00:45Z", "content": "Barcelona have been told to forget signing Inter Milan forward Lautaro Martinez and instead make a move for Liverpool forward Roberto Firmino.\r\nFirmino has been an integral part for the Reds since arriving almost five years ago, and scored the winner in the F… [+1405 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Mark Jones", "title": "Chelsea's Christian Pulisic sends message to Liverpool boss Jurgen Klopp - Mirror Online", "description": "The American international broke through at Borussia Dortmund when Klopp was still in charge, and was introduced to first-team training by the now Liverpool boss", "url": "https://www.mirror.co.uk/sport/football/news/chelseas-christian-pulisic-sends-message-22000140", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article22000178.ece/ALTERNATES/s1200/0_christianpulisic.jpg", "publishedAt": "2020-05-09T21:27:36Z", "content": "Chelsea's Christian Pulisic says he'll be forever grateful to Jurgen Klopp for introducing him to the first-team environment at Borussia Dortmund.\r\nPulisic joined Dortmund as a 16-year-old in February 2015, shortly before Klopp ended his seven-year stay at th… [+1614 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Report: New rule change confirmed if Premier League season resumes - The Spurs Web", "description": "While there is no confirmation yet on if and when the Premier League season will resume, plans are being discussed to complete the campaign behind closed doors. Clubs will reportedly be allowed to begin full training three weeks before the restart date to giv…", "url": "https://www.spurs-web.com/spurs-news/report-new-rule-change-confirmed-if-premier-league-season-resumes/", "urlToImage": "https://www.spurs-web.com/wp-content/uploads/2020/02/josem.jpg", "publishedAt": "2020-05-09T21:00:00Z", "content": "While there is no confirmation yet on if and when the Premier League season will resume, plans are being discussed to complete the campaign behind closed doors.\r\nClubs will reportedly be allowed to begin full training three weeks before the restart date to gi… [+1497 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Edgbaston Rewind: Steve Harmison reflects on dismissing Michael Clarke with great slower ball - Sky Sports", "description": "Steve Harmison talks removing Michael Clarke with a superb slower ball as England headed into day four with victory in sight.", "url": "https://www.skysports.com/cricket/news/12123/11985632/edgbaston-rewind-steve-harmison-reflects-on-dismissing-michael-clarke-with-great-slower-ball", "urlToImage": "https://e0.365dm.com/20/05/1600x900/skysports-steve-harmison-ashes-2005_4987009.jpg", "publishedAt": "2020-05-09T18:21:38Z", "content": "We are replaying the epic Edgbaston Ashes Test from 2005 on Sky Sports this week, culminating in a thrilling day four on Sunday.\r\nEngland seamer Steve Harmison struck with the final delivery of day three - bowling a befuddled Michael Clarke with a delicious s… [+2394 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The REAL reason why Alexis Sanchez, not Angel Di Maria, is Man United's biggest flop | ESPN FC - ESPN UK", "description": "Former Manchester United player Danny Higginbotham joins ESPN FC’s Mark Donaldson to discuss whether or not Angel Di Maria has been Man United’s biggest flop...", "url": "https://www.youtube.com/watch?v=FfGkzrFExA4", "urlToImage": "https://i.ytimg.com/vi/FfGkzrFExA4/maxresdefault.jpg", "publishedAt": "2020-05-09T18:00:04Z", "content": "Former Manchester United player Danny Higginbotham joins ESPN FCs Mark Donaldson to discuss whether or not Angel Di Maria has been Man Uniteds biggest flop in the post Sir Alex Ferguson era at Old Trafford. Higginbotham believes Di Maria started off well at t… [+320 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Jack Slater", "title": "Who is Frank Soo and why is he today's Google Doodle? - Metro.co.uk", "description": "A beautiful doodle for the beautiful game.", "url": "https://metro.co.uk/2020/05/09/who-frank-soo-featured-todays-google-doodle-12675017/", "urlToImage": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2020/05/frank-soo-google-doodle-095e_1589008926.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "publishedAt": "2020-05-09T08:00:09Z", "content": "Frank Soo as the Google Doodle (Picture: Google)\r\nYou can always rely on Google Doodle to come up with something entertaining, engaging or educational theyve provided games to help those bored in lockdown, celebrated teachers and introduced us to pioneers in … [+2465 chars]"}]}