{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Mark McDougall", "title": "The two Premiership clubs Rangers can't rely on for SPFL EGM vote - Daily Record", "description": "The Ibrox club need 32 clubs to vote yes but at least two Premiership clubs are unlikely to be on Rangers' side.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/two-premiership-clubs-rangers-cant-21928090", "urlToImage": null, "publishedAt": "2020-04-26T10:47:51Z", "content": "Rangers won't be able to rely on Motherwell and Hamilton to back their call for an independent investigation in to the SPFL. \r\n The two Premiership clubs have SPFL board members in the shape of Alan Burrows and Les Gray. \r\nAnd according to a report, they aren… [+1735 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ben Husband", "title": "West Brom and Leeds United decision could lead to 'legal challenges' - Birmingham Live", "description": "The Liverpool legend has suggested that the season must be completed, even if fans can't be in attendance", "url": "https://www.birminghammail.co.uk/sport/football/football-news/west-brom-leeds-united-decision-18152046", "urlToImage": null, "publishedAt": "2020-04-26T10:29:57Z", "content": "Liverpool legend Robbie Fowler has warned the Football Association that they will be subject to legal challenges, if they void the season.\r\nAll elite football in the UK has been suspended since mid-March, with fears now rising that the season could be cancell… [+2219 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Alex Dicken", "title": "Wolves deal Liverpool a blow as Leeds United plot transfer move - Birmingham Live", "description": "Wolverhampton Wanderers news - All the latest WWFC headlines from BirminghamLive and beyond", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/wolves-deal-liverpool-blow-leeds-18151599", "urlToImage": null, "publishedAt": "2020-04-26T10:29:46Z", "content": "Wolves topple Liverpool\r\nDiogo Jota has clinched the EPL Invitational trophy for Wolverhampton Wanderers.\r\nThe Wolves forward defeated Liverpools Trent Alexander-Arnold with a golden goal in Saturday afternoon's final after the 90 minutes ended 1-1.\r\nJota def… [+3331 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Alex Dicken", "title": "Former West Brom boss Alan Pardew picks up astonishing bonus - despite terrible record - Birmingham Live", "description": "West Bromwich Albion news - Former WBA boss Alan Pardew has received a huge bonus", "url": "https://www.birminghammail.co.uk/sport/football/football-news/former-west-brom-boss-alan-18151531", "urlToImage": null, "publishedAt": "2020-04-26T10:29:40Z", "content": "Alan Pardew will receive a £100,000 bonus from ADO den Haag after successfully keeping the Dutch club in the Eredivisie.\r\nThe Eredivisie was cancelled on Friday meaning former West Bromwich Albion boss Pardew completed his mission.\r\nHe will therefore be rewar… [+1847 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Richard Forrester", "title": "Newcastle ‘lining up sensational return of Kevin Keegan’ if £300million takeover by Saudis goes through - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11482921/newcastle-return-kevin-keegan-takeover/", "urlToImage": null, "publishedAt": "2020-04-26T10:29:32Z", "content": "NEWCASTLE will make a sensational bid to bring club legend Kevin Keegan back once their takeover is finally completed, according to reports.\r\nThe Toon are on the brink of being bought by a Saudi consortium in a £300million deal.\r\n Kevin Keegan is being lined … [+1602 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Kinnersley For Mailonline", "title": "Mohamed Salah puts himself through an intense workout at 2am - Daily Mail", "description": "The Liverpool forward is training at home with the Premier League season suspended amid the coronavirus pandemic.\nSalah captioned the photo 'mood' whilst he used a pull-up bar at his home.", "url": "https://www.dailymail.co.uk/sport/football/article-8258125/Mohamed-Salah-puts-intense-workout-2am.html", "urlToImage": null, "publishedAt": "2020-04-26T10:22:41Z", "content": "Mohamed Salah has uploaded a photo on Instagram of him undergoing a vigorous workout regime at 2.40am.\r\nThe Liverpool forward is training at home with the Premier League season suspended amid the coronavirus pandemic.\r\nSalah captioned the photo 'mood' while h… [+1330 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Dan Kay", "title": "Roberto Firmino's tunnel reaction to Sadio Mane and Mohamed Salah row set tone for stellar Liverpool season - Liverpool Echo", "description": "Bobby's 'side-eye' to camera was one of funniest moments of Liverpool's season but also gave snapshot into mentality which has proved so successful", "url": "https://www.liverpoolecho.co.uk/sport/football/liverpool-mane-firmino-salah-burnley-18151271", "urlToImage": null, "publishedAt": "2020-04-26T10:22:12Z", "content": "If there is one thing this Liverpool team is renowned for, it is their unity, togetherness and team spirit. \r\n There have been numerous examples of it on and off the field and is one of the aspects Liverpudlians have enjoyed most during the rise to top of the… [+6710 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Samuel Luckhurst", "title": "David de Gea speaks out on Manchester United future amid Dean Henderson challenge - Manchester Evening News", "description": "Man United agreed a new contract with David de Gea last year but Dean Henderson has been in fabulous form on loan at Sheffield United.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-united-de-gea-henderson-18152297", "urlToImage": null, "publishedAt": "2020-04-26T10:17:33Z", "content": "David de Gea intends to stay at Manchester United for more than 10 years amid the challenge of Dean Henderson.\r\nDe Gea, 29, signed a new four-year contract with United in September and will celebrate 10 years at the club next year, having arrived as a 20-year… [+2407 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Danny Gallagher For Mailonline", "title": "Liverpool manager Jurgen Klopp 'contacts father of Kylian Mbappe' in transfer hope - Daily Mail", "description": "Liverpool could be poised to show real interest in Kylian Mbappe after manager Jurgen Klopp reportedly contacted the player's father for a general chat about his future.", "url": "https://www.dailymail.co.uk/sport/football/article-8258151/Liverpool-manager-Jurgen-Klopp-contacts-father-Kylian-Mbappe-transfer-hope.html", "urlToImage": null, "publishedAt": "2020-04-26T10:11:19Z", "content": "Liverpool could be poised to show real interest in Kylian Mbappe after manager Jurgen Klopp reportedly contacted the player's father for a chat about his future.\r\nThe high-flying Reds have long been linked with the France superstar, with Klopp making no secre… [+2548 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Richard Fay", "title": "Manchester United transfer target James Maddison drops fresh hint on his future - Manchester Evening News", "description": "Man Utd are interested in a move for Leicester midfielder James Maddison once the transfer market opens.", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/man-utd-maddison-transfer-news-18152223", "urlToImage": null, "publishedAt": "2020-04-26T10:06:28Z", "content": "Manchester United target James Maddison insists he is still very happy to be playing for Leicester despite strong suggestions he could leave this summer.\r\nThe 23-year-old is a current target for United ahead of the summer transfer window as Ole Gunnar Solskja… [+1284 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Phil Kirkbride", "title": "Everton to hit Moise Kean with heavy sanctions as punishment for flouting lockdown rules - Liverpool Echo", "description": "Everton were left 'appalled' after Moise Kean hosted a party at his home", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/everton-hit-moise-kean-heavy-18152257", "urlToImage": null, "publishedAt": "2020-04-26T09:45:48Z", "content": "Everton are ready to fine Moise Kean after he flouted coronavirus lockdown rules by hosting a party at his home.\r\nThe Blues say they are \"appalled\" by Kean's actions, which came to light in a national newspaper on Saturday evening, and the 20-year-old is now … [+1105 chars]"}, {"source": {"id": "talksport", "name": "TalkSport"}, "author": "Jackson Cole", "title": "Liverpool, Arsenal and Manchester United – Who are the best home performers in Premier League history? - talkSPORT.com", "description": "", "url": "http://talksport.com/football/697858/liverpool-arsenal-and-manchester-united-who-are-the-best-home-performers-in-premier-league-history/", "urlToImage": null, "publishedAt": "2020-04-26T09:04:44Z", "content": "If you want to succeed in football then you have to win your home games for starters.\r\nIn the Premier League, Liverpool’s home form has set a solid foundation towards them establishing a huge lead at the top of the table, having won all 15 of their matches at… [+5492 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ben Husband", "title": "'Look at what Klopp has done' - Man United sent clear Aston Villa transfer warning - Birmingham Live", "description": "Aston Villa news - Manchester United have been extensively linked with the AVFC skipper, but Ince believes Liverpool or Man City could swoop", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/manchester-united-transfers-grealish-villa-18151905", "urlToImage": null, "publishedAt": "2020-04-26T08:43:53Z", "content": "Manchester United have been warned that Jack Grealish could go to Liverpool or Man City and they should focus instead on a defensive midfielder.\r\n Ole Gunnar Solskjaer has been extensively linked with a move for the Aston Villa captain, with claims he has at … [+1981 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ashley Preece", "title": "EFL issue statement as West Brom hero pokes fun at Wolves - Birmingham Live", "description": "West Bromwich Albion daily digest - Here's a round-up of the latest Albion stories via BirminghamLive, including goal-hero Robert Earnshaw reliving The Great Escape", "url": "https://www.birminghammail.co.uk/sport/football/football-news/efl-issue-statement-west-brom-18151514", "urlToImage": null, "publishedAt": "2020-04-26T08:43:33Z", "content": "Reidy\r\nSteven Reid is still fondly remembered within the ranks of the West Bromwich Albion fanbase.\r\nThe versatile Irishman, who played at right-back and in defensive midfield during his four year stay at The Hawthorns returned to aid Jimmy Shan in a coaching… [+6844 chars]"}, {"source": {"id": null, "name": "Thescottishsun.co.uk"}, "author": "Alan Nixon", "title": "Ex-Celtic boss Rodgers eyes up cut-price Leicester transfer for Rangers star Morelos - The Scottish Sun", "description": "", "url": "http://www.thescottishsun.co.uk/sport/football/5531346/celtic-rodgers-transfer-rangers-morelos/", "urlToImage": null, "publishedAt": "2020-04-26T08:40:56Z", "content": "BRENDAN RODGERS is on red alert to swoop for Rangers strike star Alfredo Morelos.\r\nThe Leicester boss could pounce with a cut-price bid when the Covid-19 crisis loosens its grip on football.\r\n Rangers ace Alfredo Morelos could move on this summerCredit: Willi… [+1801 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Leeds United could sign another Wolves star if they’re promoted - reports - Birmingham Live", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiZ2h0dHBzOi8vd3d3LmJpcm1pbmdoYW1tYWlsLmNvLnVrL3Nwb3J0L2Zvb3RiYWxsL3RyYW5zZmVyLW5ld3MvbGVlZHMtdW5pdGVkLXRyYW5zZmVyLWpvaG4tcnVkZHktMTgxNTE0MDfSAWtodHRwczovL3d3dy5iaXJtaW5naGFtbWFpbC5jby51ay9zcG9ydC9mb290YmFsbC90cmFuc2Zlci1uZXdzL2xlZWRzLXVuaXRlZC10cmFuc2Zlci1qb2huLXJ1ZGR5LTE4MTUxNDA3LmFtcA?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T08:31:03Z", "content": null}, {"source": {"id": null, "name": "Tbrfootball.com"}, "author": "Lee Connor", "title": "Aubameyang being on the way out gives Arsenal upper hand in Myron Boadu race - TBR - The Boot Room - Football News", "description": "Arsenal could have an ace up their sleeve in Pierre-Emerick Aubameyang when it comes to landing AZ Alkmaar striker, Myron Boadu. The Gunners want to sign the 19-year-old striker this summer according to a number of reports. However, AC Milan have also added B…", "url": "https://tbrfootball.com/aubameyang-being-on-the-way-out-gives-arsenal-upper-hand-in-myron-boadu-race/", "urlToImage": null, "publishedAt": "2020-04-26T08:30:38Z", "content": "Arsenal could have an ace up their sleeve in Pierre-Emerick Aubameyang when it comes to landing AZ Alkmaar striker, Myron Boadu.\r\nThe Gunners want to sign the 19-year-old striker this summer according to a number of reports. However, AC Milan have also added … [+1674 chars]"}, {"source": {"id": null, "name": "Hammers.news"}, "author": "Damien Charles Lucas", "title": "Aston Villa star John McGinn backed for shock West Ham move - Hammers News - West Ham United FC", "description": "West Ham United have been backed to sign one of Aston Villa’s star players in the next transfer window. Basement side Norwich City look destined for a swift return to the Championship. And West Ham and Aston Villa are locked in a five-team battle to avoid fil…", "url": "https://www.hammers.news/transfer-news/aston-villa-star-john-mcginn-backed-for-shock-west-ham-move/", "urlToImage": null, "publishedAt": "2020-04-26T08:23:41Z", "content": "West Ham United have been backed to sign one of Aston Villas star players in the next transfer window.\r\nBasement side Norwich City look destined for a swift return to the Championship.\r\nAnd West Ham and Aston Villa are locked in a five-team battle to avoid fi… [+2264 chars]"}, {"source": {"id": null, "name": "Teamtalk.com"}, "author": null, "title": "Paper Talk: Tottenham ready to gazump Man Utd for Barcelona standout - Teamtalk.com", "description": "Tottenham have emerged as major suitors to sign a standout Barcelona star, while Liverpool had a firm answer for Philippe Coutinho when a return was discussed.", "url": "https://www.teamtalk.com/news/transfer-gossip-tottenham-gazump-man-utd-ivan-rakitic-liverpool-coutinho-answer", "urlToImage": null, "publishedAt": "2020-04-26T08:01:38Z", "content": "Tottenham have emerged as major suitors to sign a standout Barcelona star, while Liverpool had a firm answer for Philippe Coutinho when a return was discussed, according to Sunday’s paper gossip.\r\nTOTTENHAM MAKE MOVE FOR BARCELONA ACE\r\nTottenham have reported… [+4234 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Roy Keane", "title": "Roy Keane didn't get Wayne Rooney and Rio Ferdinand banter at Manchester United - Sky Sports", "description": "Roy Keane says he didn't have a lot in common with a number of his Manchester United team-mates towards the end of his career at Old Trafford.", "url": "https://www.skysports.com/football/news/11667/11978661/roy-keane-didnt-get-wayne-rooney-and-rio-ferdinand-banter-at-manchester-united", "urlToImage": null, "publishedAt": "2020-04-26T07:37:25Z", "content": "Roy Keane says he didn't have a lot in common with a number of his Manchester United team-mates towards the end of his career at Old Trafford, admitting he struggled to understand the banter of the likes of Wayne Rooney and Rio Ferdinand.\r\nKeane saw a number … [+5140 chars]"}, {"source": {"id": null, "name": "Tbrfootball.com"}, "author": "Giuseppe Labellarte", "title": "£10m man wants to sign for Newcastle, once tipped to become as good as Roberto Carlos - TBR - The Boot Room - Football News", "description": "Newcastle United on-loan left-back Jetro Willems has admitting that he wants to sign for the St James’ Park outfit on a permanent basis, as per his personal Twitter account. The Magpies brought the 26-year-old on loan to St James’ Park from Eintracht Frankfur…", "url": "https://tbrfootball.com/10m-man-wants-to-sign-for-newcastle-once-tipped-to-become-as-good-as-roberto-carlos/", "urlToImage": null, "publishedAt": "2020-04-26T07:33:52Z", "content": "Newcastle United on-loan left-back Jetro Willems has admitting that he wants to sign for the St James Park outfit on a permanent basis, as per his personal Twitter account.\r\nThe Magpies brought the 26-year-old on loan to St James Park from Eintracht Frankfurt… [+1504 chars]"}, {"source": {"id": null, "name": "Watfordobserver.co.uk"}, "author": "Watford Observer Staff", "title": "Coronavirus: Arsenal to return to training at London Colney next to Watford's training ground - Watford Observer", "description": "Arsenal's players will be allowed to return to train at London Colney, right next to where Watford train, from next week.", "url": "https://www.watfordobserver.co.uk/sport/18406224.arsenal-return-training-london-colney-next-watfords-training-ground/", "urlToImage": null, "publishedAt": "2020-04-26T07:28:00Z", "content": "Arsenal's players will be allowed to return to train at London Colney, right next to where Watford train, from next week.\r\nThe Gunners' squad will undertake some light running individually in line with the government's coronavirus regulations.\r\nA club spokesp… [+940 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Nathan Bliss", "title": "We simulated Tottenham vs Arsenal to see what could have happened in the North London Derby - Football.London", "description": "The Tottenham Hotspur Stadium would have hosted its first North London Derby this weekend, with Jose Mourinho and Mikel Arteta locking horns, but what would the score have been? We used FIFA 20 to find out.", "url": "https://www.football.london/tottenham-hotspur-fc/fixtures-results/tottenham-hotspur-arsenal-match-simulated-18146941", "urlToImage": null, "publishedAt": "2020-04-26T07:06:39Z", "content": "WIth the UK still in lockdown due to the ongoing coronavirus pandemic, this weekend's planned North London Derby between Tottenham Hotspur and Arsenal will not be played, with the safety of fans, players and staff of paramount importance.\r\nBut even though the… [+3118 chars]"}, {"source": {"id": null, "name": "Hammers.news"}, "author": "Antony Martin", "title": "Report claims West Ham want to sign Rangers hitman Alfredo Morelos - Hammers News - West Ham United FC", "description": "According to a report from the Sun, West Ham are interested in signing Rangers striker Alfredo Morelos this summer. Click HERE to read also: David Moyes very concerned by £3.5m West Ham man’s form, wants to sell him Hammers boss David Moyes will be keen to bo…", "url": "https://www.hammers.news/club-news/report-claims-west-ham-want-to-sign-rangers-hitman-alfredo-morelos/", "urlToImage": null, "publishedAt": "2020-04-26T07:06:06Z", "content": "According to a report from the Sun, West Ham are interested in signing Rangers striker Alfredo Morelos this summer.\r\nHammers boss David Moyes will be keen to bolster his attacking ranks this summer. But he might find it hard to prise Morelos away from Ibrox, … [+1545 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Classic Match: West Brom 0-6 Liverpool | Owen hits 100th PL goal as Reds run riot - Liverpool FC", "description": "Michael Owen netted his 100th Premier League goal as he struck four past WBA at the Hawthorns. Strike-partner Milan Baros got the other two for Gerard Houlli...", "url": "https://www.youtube.com/watch?v=UAmZPV3VOVQ", "urlToImage": null, "publishedAt": "2020-04-26T07:00:11Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Man Utd 'offered Old Trafford flop Angel Di Maria' in Paul Pogba transfer swap bid - Mirror Online", "description": "Pogba could leave Manchester United in a swap deal this summer, and PSG have reportedly offered Di Maria and Julian Draxler in exchange for the French World Cup winner", "url": "https://www.mirror.co.uk/sport/football/transfer-news/man-utd-offered-old-trafford-21927916", "urlToImage": null, "publishedAt": "2020-04-26T06:32:23Z", "content": "Manchester United flop Angel Di Maria has reportedly been offered back to the club by Paris-Saint Germain as the French club eye a shock swap deal for Paul Pogba.\r\nAccording to reports from France, PSG have offered winger Di Maria and midfielder Julian Draxle… [+1933 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "SunSport Reporters", "title": "7am Man Utd news LIVE: Sancho transfer put in doubt by Woodward, Pogba to PSG, Koulibaly boost, Ronaldo LATEST - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11431662/man-utd-news-live-sancho-fernandes-transfer-latest-koulibaly/", "urlToImage": null, "publishedAt": "2020-04-26T06:27:59Z", "content": "MORNING MAN UTD FANS,\r\nEd Woodward has warned that the clubs big-money summer transfer plans for the likes of Jadon Sancho, Jack Grealish and Kalidou Koulibaly could be in jeopardy because of the coronavirus pandemic.\r\nUnited are set to tie up a permanent mov… [+1067 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Charities fundraiser to begin on London Marathon day - BBC News", "description": "Thousands of runners would have been taking part in the London Marathon but it has been postponed.", "url": "https://www.bbc.co.uk/news/uk-wales-52415890", "urlToImage": null, "publishedAt": "2020-04-26T05:20:37Z", "content": "Image copyrightKerrie AldridgeImage caption\r\n Kerrie Aldridge, who is taking part in the 2.6 Challenge, with her son Osian\r\nA fundraising challenge to help charities losing out on cash that would have been raised through cancelled sporting events has begun. \r… [+2877 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Richard Fay", "title": "Manchester United news and transfers LIVE Fred and Mejbri latest as fans react to Di Maria rumours - Manchester Evening News", "description": "Follow for all the latest Man Utd transfer rumours, injury latest and breaking news throughout the day.", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/man-utd-news-transfers-live-18151300", "urlToImage": null, "publishedAt": "2020-04-26T04:01:47Z", "content": "Louis van Gaal was only half right about why Angel Di Maria failed at Manchester United\r\n“Di Maria had a problem with the English football culture and the climate. You cannot buy players and know, for sure, that they can deliver. You cannot know because footb… [+912 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Simon Bajkowski", "title": "Raheem Sterling reveals which two players' shirts he wants in his trophy room - Manchester Evening News", "description": "Manchester City star Raheem Sterling has spoken about the shirts that would get into his trophy room at the end of his career", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-city-sterling-messi-neymar-18147494", "urlToImage": null, "publishedAt": "2020-04-26T03:02:19Z", "content": "Raheem Sterling is craving one football shirt in particular for the trophy room he plans to build at the end of his career.\r\nManchester City forward Sterling has matured to become one of the best players in the world under the guidance of Pep Guardiola and ha… [+1305 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: UK's Raab seeks 'sure-footed' way out - BBC News", "description": "The UK foreign secretary appears on the Andrew Marr show as death toll worldwide tops 200,000.", "url": "https://www.bbc.co.uk/news/live/world-52430713", "urlToImage": null, "publishedAt": "2020-04-26T02:38:00Z", "content": "The state of New York, the epicentre of the Covid-19 outbreak in the US, is planning to allow pharmacies to carry out tests for the virus. \r\nGovernor Andrew Cuomo said some 5,000 pharmacies would be able to carry out testing, with the aim to provide 40,000 pe… [+739 chars]"}, {"source": {"id": null, "name": "Theguardian.comsport"}, "author": "Guardian sport", "title": "Patriots' new kicker Rohrwasser denies tattoo represents rightwing militia - The Guardian", "description": "The post-Tom Brady era is off to a shaky start at the New England Patriots after a controversy surrounding their new kicker", "url": "https://amp.theguardian.comsport/2020/apr/25/justin-rohrwasser-new-england-patriots-kicker-tattoo-three-percenters-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-26T02:32:49Z", "content": "The post-Tom Brady era is off to a shaky start at the New England Patriots after a controversy surrounding their new kicker.\r\nAs part of the Patriots rebuild they selected Marshall kicker Justin Rohrwasser in the fifth round of this weeks draft. However, it s… [+1753 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Ex-Chelsea striker Diego Costa reignites feud with 'suspicious' Antonio Conte - Mirror Online", "description": "Costa blames Conte for his exit from Stamford Bridge, and says the Inter Milan boss wouldn't last one season at a club like Real Madrid", "url": "https://www.mirror.co.uk/sport/football/news/ex-chelsea-striker-diego-costa-21927801", "urlToImage": null, "publishedAt": "2020-04-26T02:05:22Z", "content": "Former Chelsea star Diego Costa has reignited his feud with 'suspicious' Antonio Conte - saying the Inter Milan boss wouldn't last one season at Real Madrid. \r\n Conte and Costa won the Premier League title together at Chelsea, but the two had several run-ins … [+1779 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Real Madrid eye 'dream' Neymar transfer after Barcelona told funding deal is 'impossible' - Mirror Online", "description": "Real Madrid supremo Florentino Perez still hopes of a dream move for Neymar despite Barcelona's interest in re-signing the forward", "url": "https://www.mirror.co.uk/sport/football/news/real-madrid-eye-dream-neymar-21926057", "urlToImage": null, "publishedAt": "2020-04-26T02:00:31Z", "content": "Real Madrid president Florentino Perez \"still dreams\" of signing PSG star Neymar after previously missing out on the Brazilian.\r\nLos Blancos chased Neymar back when he was at Santos before losing out to rivals Barcelona.\r\nBut the Parisians secured his signatu… [+1793 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Who is the greatest British manager? - BBC Sport", "description": "BBC Sport's chief football writer has made a shortlist of the greatest post-war British managers, now it's turn to vote for the best.", "url": "https://www.bbc.co.uk/sport/football/52371056", "urlToImage": null, "publishedAt": "2020-04-26T01:32:45Z", "content": "Who do you think is Britain's greatest manager of the post-war era\r\nIt's one of those debates that is very difficult to win. Just who is Britain's greatest post-war manager?\r\nFrom a World Cup win, to European successes, to lifting domestic titles, there are a… [+17447 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Simon Mullock", "title": "Scott McTominay taking on lessons from Man Utd great Cristiano Ronaldo during lockdown - Mirror Online", "description": "The central midfielder has been staying in shape amid the coronavirus crisis and revealed he has been looking to one of the very best for tips", "url": "https://www.mirror.co.uk/sport/football/news/scott-mctominay-inspired-man-utd-21925823", "urlToImage": null, "publishedAt": "2020-04-25T21:57:29Z", "content": "Manchester United's Scott McTominay has been taking lessons from Cristiano Ronaldo on how to keep himself fit and focused during lockdown.\r\nThe Scottish midfielder reckons the former United No. 7 is the master when it comes to steering well clear of his comfo… [+1736 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Report: Barcelona make Coutinho transfer decision that could impact Tottenham - The Spurs Web", "description": "Tottenham Hotspur's chances of landing Philippe Coutinho have just received a huge blow as the latest reports from Spain indicate that Barcelona have U-turned on their original plans to sell the star. Spurs have been linked with a move for Coutinho since it e…", "url": "https://www.spurs-web.com/spurs-news/report-barcelona-make-coutinho-transfer-decision-that-could-impact-tottenham/", "urlToImage": null, "publishedAt": "2020-04-25T21:00:00Z", "content": "Tottenham Hotspurs chances of landing Philippe Coutinho have just received a huge blow as the latest reports from Spain indicate that Barcelona have U-turned on their original plans to sell the star.\r\nSpurs have been linked with a move for Coutinho since it e… [+928 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Ex-Spurs striker reveals what Newcastle must do to convince Pochettino to join - The Spurs Web", "description": "Former Tottenham striker, Dimitar Berbatov, believes that Newcastle United need to convince Mauricio Pochettino that they are ready to spend big on top players in order to get the former Spurs boss to join. A £300 million takeover of Newcastle United is said …", "url": "https://www.spurs-web.com/spurs-news/ex-spurs-striker-reveals-what-newcastle-must-do-to-convince-pochettino-to-join/", "urlToImage": null, "publishedAt": "2020-04-25T20:41:49Z", "content": "Former Tottenham striker, Dimitar Berbatov, believes that Newcastle United need to convince Mauricio Pochettino that they are ready to spend big on top players in order to get the former Spurs boss to join.\r\nA £300 million takeover of Newcastle United is said… [+2624 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "Jofra Archer reveals he has lost his Cricket World Cup winner's medal - The Guardian", "description": "England paceman Jofra Archer revealed he has ‘gone mad’ searching for his World Cup winner’s medal after losing it during a recent house move", "url": "https://www.theguardian.com/sport/2020/apr/25/jofra-archer-reveals-he-has-lost-his-england-cricket-world-cup-winners-medal", "urlToImage": null, "publishedAt": "2020-04-25T18:41:53Z", "content": "England pace bowler Jofra Archer revealed he has gone mad searching for his Cricket World Cup winners medal after losing it during a recent house move. Archer rose from relative obscurity to become a household name at last years tournament, finishing as Engla… [+1949 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Associated Press", "title": "NFL's remote draft concludes as 49ers acquire star tackle Trent Williams - The Guardian", "description": "The NFL draft entered its third and final day with Cincinnati selecting an Appalachian State linebacker on Saturday afternoon", "url": "https://www.theguardian.com/sport/2020/apr/25/nfl-draft-saturday-picks-day-three", "urlToImage": null, "publishedAt": "2020-04-25T18:34:00Z", "content": "Maybe the Southeastern Conference should simply hold onto its players and become part of the NFL.\r\nThe home of national champion LSU and perennial contenders Alabama, Georgia and Auburn, the SEC dominated the first four rounds of the NFL draft before the flow… [+5706 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Harry Shepherd", "title": "The Last Dance makes it hard to like the players at the heart of this documentary - TechRadar India", "description": "Opinion: MJ and the Chicago Bulls are tough to cheer for in this dramatic account of their 97/98 NBA season", "url": "https://www.techradar.com/news/the-last-dance-makes-it-hard-to-like-the-players-at-the-heart-of-the-documentary", "urlToImage": null, "publishedAt": "2020-04-25T18:29:00Z", "content": "Sports documentaries, for the most part, need to do two things: be accessible to you even if you know nothing about the discipline, and give you someone to root for. You cant beat an underdog story like Sunderland Til I Die, but the drama is bound up in your … [+5267 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "FULL GAME: WEST HAM V EVERTON | 21 SEPTEMBER 2013 - Everton Football Club", "description": "Subscribe to Everton Football Club's official YouTube Channel: http://bit.ly/2wtCEbB Follow us on Facebook: http://facebook.com/everton Follow us on Twitter:...", "url": "https://www.youtube.com/watch?v=7U1emuqMqzE", "urlToImage": null, "publishedAt": "2020-04-25T18:00:14Z", "content": null}, {"source": {"id": null, "name": "Boxingnews24.com"}, "author": "Boxing News", "title": "Joseph Parker: ‘I can beat Dillian Whyte in REMATCH’ - Boxing News 24", "description": "By Matt Lieberman: Joseph Parker would like a chance to avenge his loss to Dillian Whyte from 2018 by facing him in a rematch. Parker says he knows he can", "url": "https://www.boxingnews24.com/2020/04/joseph-parker-i-can-beat-dillian-whyte-in-rematch/", "urlToImage": null, "publishedAt": "2020-04-25T17:57:32Z", "content": "By Matt Lieberman: Joseph Parker would like a chance to avenge his loss to Dillian Whyte from 2018 by facing him in a rematch. Parker says he knows he can beat Whyte if given another opportunity at meeting him.\r\nWhyte has no interest in facing Parker (27-2, 2… [+2975 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "Seb Jenkins", "title": "Report: Tottenham 'ramp up bid' to sign 21-year-old Premier League playmaker - The Spurs Web", "description": "Football Insider have now reported that Tottenham Hotspur are ramping up their bid to sign Norwich City playmaker, Todd Cantwell, this summer. The 21-year-old attacker caught the eye in his first Premier League season this year as he recorded six goals across…", "url": "https://www.spurs-web.com/spurs-news/report-tottenham-ramp-up-bid-to-sign-21-year-old-premier-league-playmaker/", "urlToImage": null, "publishedAt": "2020-04-25T17:43:13Z", "content": "Football Insider have now reported that Tottenham Hotspur are ramping up their bid to sign Norwich City playmaker, Todd Cantwell, this summer.\r\nThe 21-year-old attacker caught the eye in his first Premier League season this year as he recorded six goals acros… [+790 chars]"}, {"source": {"id": null, "name": "Footballinsider247.com"}, "author": null, "title": "Update on Leeds & West Brom joining 22-team league after BBC update - Football Insider", "description": "Leeds United and West Brom hopes of a 22-team Premier League next season has all but fizzled away, Football Insider understands", "url": "https://www.footballinsider247.com/update-on-leeds-west-brom-joining-22-team-league-after-bbc-update/", "urlToImage": null, "publishedAt": "2020-04-25T17:13:00Z", "content": "Any hope Leeds United and West Brom may have had of being part of a 22-team Premier League next season is all but over, Football Insider understands.\r\nThe possibility of a no-relegation-and-restructure option was floated after football’s initial suspension in… [+1590 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nDaniel Schofield,", "title": "Doubts grow over Agustin Pichot's plan for World Rugby revolution - Telegraph.co.uk", "description": "Campaign reveals contradictions in the former Argentina scrum-half's manifesto to replace Sir Bill Beaumont", "url": "https://www.telegraph.co.uk/rugby-union/2020/04/25/doubts-grow-agustin-pichots-plan-world-rugby-revolution/", "urlToImage": null, "publishedAt": "2020-04-25T16:55:00Z", "content": "Agustin Pichot likes to project himself as a white knight coming to rescue rugby in the moment of its greatest crisis.\r\nFrom announcing his candidacy for World Rugby chairman at the last minute, Pichot now has momentum firmly on his side in the race against i… [+1967 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Freddie Keighley", "title": "Eddie Hearn admits Tyson Fury proved him wrong after ignoring chance to sign heavyweight - Mirror Online", "description": "The promoter discussed his regret about not signing the Gypsy King and admitted he did not believe Fury would be able to recover after his struggles in 2016 and 2017", "url": "https://www.mirror.co.uk/sport/boxing/eddie-hearn-admits-tyson-fury-21924943", "urlToImage": null, "publishedAt": "2020-04-25T16:29:30Z", "content": "Promoter Eddie Hearn has singled out Tyson Fury as the boxer he regrets passing up the opportunity to sign and admitted that the Gypsy King proved him wrong by coming back to become a heavyweight champion. \r\nFury was forced to vacate his unified heavyweight b… [+1896 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Elliott Jackson", "title": "Dimitar Berbatov sends transfer warning to Newcastle with Man City comparison - Manchester Evening News", "description": "The former Manchester United striker has had his say on Newcastle's potential takeover.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/berbatov-newcastle-manchester-city-takeover-18147091", "urlToImage": null, "publishedAt": "2020-04-25T14:36:51Z", "content": "Dimitar Berbatov has insisted it will take time for Newcastle United to attract top players to the club.\r\nNewcastle are in talks over a potential Saudi Arabia-backed takeover. Manchester City, of course, were subject to a takeover of their own in 2008 which d… [+1174 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Elliott Jackson", "title": "What Jurgen Klopp said to Liverpool before historic Barcelona comeback - Liverpool Echo", "description": "The Reds beat Barcelona 4-0 to reach the Champions League final", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/klopp-liverpool-talk-barcelona-comeback-18148913", "urlToImage": null, "publishedAt": "2020-04-25T14:08:58Z", "content": "James Milner has revealed what Jurgen Klopp said to his players in training before their unforgettable comeback against Barcelona in the Champions League. \r\nThe Reds remarkably beat the Spanish giants 4-0 at Anfield in the second leg of their Championship Lea… [+1744 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Marcus Banks", "title": "Manchester United fans cannot believe new Angel Di Maria transfer rumour - Manchester Evening News", "description": "Angel Di Maria signed for United in 2014 but left in 2015 to join Paris Saint-Germain.", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/pogba-di-maria-man-utd-18149406", "urlToImage": null, "publishedAt": "2020-04-25T13:42:51Z", "content": "Speculation over the future of Manchester United midfielder Paul Pogba refuses to die down. \r\nThe World Cup winner continues to be heavily linked with an exit, with Real Madrid, Juventus and Paris Saint-Germain believed to be interested in acquiring his servi… [+1452 chars]"}, {"source": {"id": null, "name": "Boxingscene.com"}, "author": null, "title": "Paulie Malignaggi: Deontay Wilder Will Never Beat Tyson Fury Again - BoxingScene.com", "description": "If former two-division champion and current Showtime boxing analyst Paulie Malignaggi were to wear his prognosticator hat, he believes Tyson Fury will always end up on the winning column against archrival Deontay Wilder.", "url": "https://www.boxingscene.com/paulie-malignaggi-deontay-wilder-never-beat-tyson-fury-again--148487", "urlToImage": null, "publishedAt": "2020-04-25T13:36:00Z", "content": "If former two-division champion and current Showtime boxing analyst Paulie Malignaggi were to wear his prognosticator hat, he believes Tyson Fury will always end up on the winning column against archrival Deontay Wilder.\r\nMalignaggi said Fury was robbed of a … [+2310 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Liverpool vs Atletico Madrid under investigation following coronavirus outbreak - Mirror Online", "description": "Liverpool's Champions League exit to Atletico Madrid is one of the last games to be played amid the coronavirus pandemic and has come in for plenty of criticism", "url": "https://www.mirror.co.uk/sport/football/news/liverpool-vs-atletico-madrid-under-21925450", "urlToImage": null, "publishedAt": "2020-04-25T13:32:00Z", "content": "Liverpool's Champions League match with Atletico Madrid is under investigation regarding its impact on the spread of coronavirus. \r\nThe last 16 clash took place on March 11 - the same day the World Health Organisation declared Covid-19 a global pandemic.\r\nSpa… [+1670 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Dani Ceballos shares Zinedine Zidane message on future amid Arsenal transfer talk - Mirror Online", "description": "Arsenal are believed to be keen on signing Real Madrid midfielder permanently following loan spell, but Ceballos has revealed Zidane conversation which could decide his future", "url": "https://www.mirror.co.uk/sport/football/transfer-news/dani-ceballos-shares-zinedine-zidane-21924432", "urlToImage": null, "publishedAt": "2020-04-25T12:57:55Z", "content": "Dani Ceballos has shared a message from Zinedine Zidane about his Real Madrid future amid speculation Arsenal will bid to sign him permanently. \r\nCeballos has spent the season on loan with the Gunners from Madrid, and Arsenal are believed to be keen on signin… [+1801 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Tom Leach", "title": "Frank Lampard opens talks with Belgium star as Chelsea look to seal free transfer - Football.London", "description": "The Napoli star was a Chelsea target in the January transfer window, but decided to stay in Italy until the end of the season", "url": "https://www.football.london/chelsea-fc/transfer-news/chelsea-napoli-lampard-dries-mertens-18149824", "urlToImage": null, "publishedAt": "2020-04-25T12:20:38Z", "content": "Chelsea boss Frank Lampard has held talks with Napoli star Dries Mertens, according to reports in Italy.\r\nMertens has been linked with a move to the Premier League on a number of occasions in recent seasons with Manchester City and Manchester United both also… [+1029 chars]"}, {"source": {"id": null, "name": "Autosport.com"}, "author": "Luke Smith", "title": "Brazil 2012: The race that could have changed an F1 nearly-man's career - Autosport", "description": "The 2012 Brazilian Grand Prix, which is being live-streamed by Formula 1 today, is upheld as one of F1's most dramatic title-deciders", "url": "https://www.autosport.com/f1/news/149147/the-race-that-could-have-changed-an-f1-nearlyman", "urlToImage": null, "publishedAt": "2020-04-25T11:33:15Z", "content": "The 2012 Brazilian Grand Prix, which is being live-streamed by Formula 1 today, is upheld as one of F1's most dramatic title-deciders. The fight for the victory was no less exciting, as yet another chance slipped through the fingers of an F1 nearly-man\r\nThe 2… [+9660 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Report: Spurs could suffer major financial blow after UEFA decision - The Spurs Web", "description": "Tottenham Hotspur could be set to suffer a major financial blow in revenue generated from European football if the season is decided on a points-per-game basis, the Evening Standard report. It was revealed on Thursday that UEFA were considering using a points…", "url": "https://www.spurs-web.com/spurs-news/report-spurs-could-suffer-major-financial-blow-after-uefa-decision/", "urlToImage": null, "publishedAt": "2020-04-25T11:00:00Z", "content": "Tottenham Hotspur could be set to suffer a major financial blow in revenue generated from European football if the season is decided on a points-per-game basis, the Evening Standard report.\r\nIt was revealed on Thursday that UEFA were considering using a point… [+1358 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Every Goal of LFC's 98/99 Season | Berger's unstoppable strikes - Liverpool FC", "description": "Michael Owen would be in scintillating form throughout the 98/99 season notching 18 Premier League goals in the process with strike partner Robbie Fowler hit...", "url": "https://www.youtube.com/watch?v=Td0c_imaZ_U", "urlToImage": null, "publishedAt": "2020-04-25T10:00:27Z", "content": "Michael Owen would be in scintillating form throughout the 98/99 season notching 18 Premier League goals in the process with strike partner Robbie Fowler hitting 14. Watch out for some Patrik Berger thunderbolts thrown in for good measure as well!\r\nEnjoy more… [+261 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "NFL Draft 2020: Teams set wide receiver record on Day Two - Sky Sports", "description": "Wide receivers flew off the board on a busy Day Two of the 2020 NFL Draft.", "url": "https://www.skysports.com/nfl/news/12118/11978575/nfl-draft-2020-teams-set-wide-receiver-record-on-day-two", "urlToImage": null, "publishedAt": "2020-04-25T09:58:40Z", "content": "Teams continued to dip into the 2020 NFL Draft's deep receiver class on Friday, with the Cincinnati Bengals kicking off the run at the top of Round Two by grabbing Clemson wideout Tee Higgins.\r\nAfter six wideouts went in Round One, Round Two began with two in… [+4635 chars]"}, {"source": {"id": null, "name": "Sportinglife.com"}, "author": null, "title": "FWD Champions Day: Sha Tin tips for the three Group Ones - Sportinglife.com", "description": "Neil Morrice previews the three Group Ones on FWD Champions Day at Sha Tin on Sunday, featuring Beauty Generation in the Champions Mile.", "url": "https://www.sportinglife.com/racing/news/fwd-champions-day-sha-tin-tips/179422", "urlToImage": null, "publishedAt": "2020-04-25T09:57:18Z", "content": "Neil Morrice previews the three Group Ones on FWD Champions Day at Sha Tin on Sunday, featuring Beauty Generation in the Champions Mile.Hong Kong race fans are probably the most enthusiastic punters in the world, but as well as the massive betting handle that… [+4343 chars]"}, {"source": {"id": null, "name": "Justarsenal.com"}, "author": "Admin Pat", "title": "The Dutch FA cancel the League (without naming a Champion) and expect more to follow - Just Arsenal News", "description": "Just Arsenal News, Transfer Rumours And Discussion about all matters relating to Arsenal Football Club", "url": "https://www.justarsenal.com/the-dutch-fa-cancel-the-league-without-naming-a-champion-and-expect-more-to-follow/242859", "urlToImage": null, "publishedAt": "2020-04-25T09:54:17Z", "content": "The Dutch FA has become the second European League to cancel the remaining games, but with the new guidelines from UEFA, they have decide not to name any club as Champions.\r\nBelgium announced Bruges as Champions but they were only one game from the end of the… [+2326 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "When Yuvraj smashed Broad for six sixes in a row - BBC News", "description": "Relive the moment when Yuvraj Singh became the first player in Twenty20 history to hit six sixes in an over.", "url": "https://www.bbc.co.uk/sport/av/cricket/52397653", "urlToImage": null, "publishedAt": "2020-04-25T07:57:37Z", "content": null}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "NFL Draft: Tee Higgins joins Joe Burrow at Cincinnati Bengals - Sky Sports", "description": "The Cincinnati Bengals followed up their first-round pick of Joe Burrow by selecting Tee Higgins, who has declared the duo are \"about to tear it up\".", "url": "https://www.skysports.com/nfl/news/12118/11978531/nfl-draft-tee-higgins-joins-joe-burrow-at-cincinnati-bengals", "urlToImage": null, "publishedAt": "2020-04-25T07:29:15Z", "content": "The Cincinnati Bengals followed up their first-round pick of quarterback Joe Burrow by selecting wide receiver Tee Higgins, who has declared the duo are \"about to tear it up\" in the NFL.\r\nThe Bengals picked Clemson's Higgins - who grew up supporting the side … [+1441 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Reubyn Coutinho", "title": "“The Winner Will Fight Khabib For the Title”- Dana White makes a huge statement - Essentially Sports", "description": "UFC President Dana White made a huge statement regarding UFC Lightweight division. He said the winner of Ferguson-Gaethje will fight Khabib for the title.", "url": "https://www.essentiallysports.com/ufc-news-the-winner-will-fight-khabib-for-the-title-dana-white-makes-a-huge-statement-tony-ferguson-justin-gaethje/", "urlToImage": null, "publishedAt": "2020-04-25T05:00:00Z", "content": "UFC 249 finally has a new venue. The event will take place at VyStar Veterans Memorial Arena in Jacksonville, Florida. The UFC pounced on a chance to hold their events in the Sunshine State as sports activities were deemed essential businesses. Dana White app… [+1819 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "George Dobell", "title": "UK government hands ECB lead on viability of 'bio-secure' sport | ESPNcricinfo.com - ESPNcricinfo", "description": "England will play at as few grounds as possible if cricket goes behind closed doors, says ECB CEO | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29094232/uk-government-hands-ecb-lead-viability-bio-secure-sport", "urlToImage": null, "publishedAt": "2020-04-25T02:19:30Z", "content": "The ECB has been asked by the UK government to lead the way into investigating the viability of playing sport in a bio-secure environment.\r\nWith an increasing acceptance that the best chance of fulfilling the broadcast deals that keep nearly all sport afloat … [+8018 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Justin Allen", "title": "Bury hope FA put them in National League next season with chairman Dale willing to step down - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11474335/bury-national-league-steve-dale/", "urlToImage": null, "publishedAt": "2020-04-24T23:53:22Z", "content": "BURY owner Steve Dale has amazingly revealed he is waiting fortheFA to put his club into the National League for next season.\r\nAnd Dale would be prepared to step down as chairman of the expelled EFL outfit to make it happen.\r\n Steve Dale hopes Bury are placed… [+2817 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Alex Raskin Sports News Editor For Dailymail.com Associated Press", "title": "Video shows Bucs rookie and Tom Brady's newest blocker Tristan Wirfs jumping out of pool - Daily Mail", "description": "Tampa Bay Buccaneers first-round pick Tristan Wirfs weighs well over 300 pounds, but the offensive tackle and Tom Brady's newest blocker is still athletic enough to jump out of a pool onto his feet.", "url": "https://www.dailymail.co.uk/news/article-8254551/Video-shows-Bucs-rookie-Tom-Bradys-newest-blocker-Tristan-Wirfs-jumping-pool.html", "urlToImage": null, "publishedAt": "2020-04-24T20:51:27Z", "content": "The Buccaneers drafted Tristan Wirfs to address an opening at right tackle \r\nTampa Bay Buccaneers first-round pick Tristan Wirfs weighs well over 300 pounds, but the offensive tackle and Tom Brady's newest blocker is still athletic enough to launch himself ou… [+3438 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Mikael McKenzie", "title": "Mike Tyson announces plans for shock boxing return aged 53 as he reveals training regime - Express", "description": "Mike Tyson is set for a sensational return to boxing.", "url": "https://www.express.co.uk/sport/boxing/1273622/Mike-Tyson-announces-plans-return-boxing-news", "urlToImage": null, "publishedAt": "2020-04-24T20:05:25Z", "content": "“I do two hours on cardio, I do the bike and the treadmill for an hour, then I do some light weights, 300, 250 reps.\r\n“Then I start my day with the boxing thing, I go in there and hit the mits, 30 minutes, 25 minutes, start getting in better condition.\r\n“I’m … [+246 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Is Jamie Carragher RIGHT?! Fernando Torres' flabbergasting move from Liverpool to Chelsea | ESPN FC - ESPN UK", "description": "Craig Burley and Julien Laurens join Dan Thomas on ESPN FC to react to recent comments made by former Liverpool defender Jamie Carragher and former Chelsea c...", "url": "https://www.youtube.com/watch?v=hoRBD5aVqVk", "urlToImage": null, "publishedAt": "2020-04-24T19:51:55Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Suzanne Wrack", "title": "Who could replace Phil Neville as England Women's manager? - The Guardian", "description": "We run the rule over leading candidates, including a two-times World Cup winner and a woman who worked as Neville’s No 2", "url": "https://www.theguardian.com/football/2020/apr/24/who-could-replace-phil-neville-as-england-womens-manager", "urlToImage": null, "publishedAt": "2020-04-24T18:00:00Z", "content": "The Football Associations hunt for a successor to Mark Sampson in 2017 quickly became a circus. Names flew out of the ring as fast as they stepped in. Increased scrutiny on the person in charge, with the game professionalising, led some of those on the shortl… [+4734 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Matthew Southcombe", "title": "Marler won't miss a game despite long ban for grabbing Alun Wyn Jones' genitals - Wales Online", "description": "The England prop was banned for 10 weeks after grabbing the Wales skipper's penis, but will be free to play as soon as rugby recommences", "url": "https://www.walesonline.co.uk/sport/rugby/rugby-news/joe-marler-wont-miss-game-18148172", "urlToImage": null, "publishedAt": "2020-04-24T17:41:14Z", "content": "England prop Joe Marler will not miss a single game of rugby despite grabbing Alun Wyn Jones' genitals in a Six Nations match last month, according to reports. \r\nMarler received a 10-week ban after he was found guilty of 'grabbing, twisting or squeezing' the … [+1782 chars]"}]}