{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Mark Wakefield", "title": "Jonjoe Kenny reveals Everton frustration and makes admission about Germany move - Liverpool Echo", "description": "The 23-year-old defender is currently on loan at Bundesliga club Schalke", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/jonjoe-kenny-reveals-everton-frustration-18218968", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article18138560.ece/ALTERNATES/s1200/0_GettyImages-1205273325.jpg", "publishedAt": "2020-05-08T02:10:39Z", "content": "Everton defender Jonjoe Kenny has opened up on his Goodison Park struggles, and settling in to life on loan in Germany.\r\n The Toffees full-back signed for Schalke on loan for the season last summer, and has gone on to establish himself as a regular under mana… [+1735 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Chris Beesley", "title": "Timo Werner 'decision', Milot Rashica claim and other Liverpool transfer rumours rated - Liverpool Echo", "description": "A round-up of the latest Liverpool transfer rumours including updates on Timo Werner and Milot Rashica", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/timo-werner-decision-i-know-18214294", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article18214376.ece/ALTERNATES/s1200/0_LFCrumours070520.jpg", "publishedAt": "2020-05-08T02:04:40Z", "content": "With hopes gathering that some lockdown restrictions might soon be eased and Project Restart could soon be implemented to see Premier League action return, fans thoughts are turning to the prospect of seeing Liverpool wrap up their first title in 30 years alb… [+4625 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Mark Jones", "title": "Bruno Fernandes and Paul Scholes comparison dismissed by Man Utd coach Michael Carrick - Irish Mirror", "description": "The United coach and Scholes' former Old Trafford teammate says that it isn't right to compare one player to the other while Fernandes is finding his feet in England", "url": "https://www.mirror.co.uk/sport/football/news/bruno-fernandes-paul-scholes-comparison-21993142", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21993187.ece/ALTERNATES/s1200/0_carrickmutv.jpg", "publishedAt": "2020-05-08T01:42:02Z", "content": "Former Manchester United midfielder Michael Carrick says it is \"a little bit unfair\" to compare Bruno Fernandes to his former Old Trafford teammate Paul Scholes.\r\nUnited fans have been indulging in the comparison during Fernandes' first few months in English … [+1489 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Kate Mcgreavy For Mailonline", "title": "Kyle Walker opens up on his mental health anguish after breaking lockdown rules - Daily Mail", "description": "The Sun reported that the 29-year-old had flouted Government guidelines just weeks after he apologised for holding a sex party with two escorts. Walker released a statement on social media.", "url": "https://www.dailymail.co.uk/sport/sportsnews/article-8298657/Kyle-Walker-opens-mental-health-anguish-breaking-lockdown-rules.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/08/01/28139350-0-image-a-42_1588896220287.jpg", "publishedAt": "2020-05-08T00:44:05Z", "content": "Manchester City and England defender Kyle Walker has opened up on his mental health anguish after breaking coronavirus lockdown rules to visit family this week.\r\nThe Sun reported that the 29-year-old had flouted Government guidelines just weeks after he apolo… [+5003 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Liverpool dominate Match of the Day fans' team of the season - Mirror Online", "description": "Supporters voted seven players from the runaway Premier League leaders into the team, while the one Manchester United star selected has caused controversy among some punters", "url": "https://www.mirror.co.uk/sport/football/news/liverpool-dominate-match-day-fans-21993636", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21993687.ece/ALTERNATES/s1200/0_FBL-ENG-PR-LIVERPOOL-TOTTENHAM.jpg", "publishedAt": "2020-05-08T00:31:59Z", "content": "Liverpool players unsurprisingly dominate Match of the Day's Premier League team of the season - while the one Manchester United player selected has caused controversy among fans. \r\n The BBC show put the team to the public vote, with supporters choosing seven… [+2879 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Toby Miles For Mailonline", "title": "Premier League club executive worried Liverpool could field C-team after wrapping up the title - Daily Mail", "description": "Jurgen Klopp's starting XI in Liverpool's last nine games could be the deciding factor in the Premier League European qualification and relegation battles this season, a club executive claims.", "url": "https://www.dailymail.co.uk/sport/football/article-8298999/Premier-League-club-executive-worried-Liverpool-field-C-team-wrapping-title.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/08/00/28138234-0-image-a-155_1588893269745.jpg", "publishedAt": "2020-05-08T00:00:04Z", "content": "Jurgen Klopp's starting XI could be the deciding factor in the Premier League's European qualification and relegation battles this season, one club executive claims.  \r\nLiverpool sit six points away from glory, and could have the title wrapped up with eight g… [+1898 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Mark Clattenburg For Mailonline", "title": "Swearing in Spanish and hugs with Ronnie: Mark Clattenburg selects the FIVE best players he refereed - Daily Mail", "description": "Taking charge of football's heavyweights heaps pressure on a referee, but Mark Clattenburg looks back fondly on his encounters with legends of the game in the Premier League and abroad.", "url": "https://www.dailymail.co.uk/sport/football/article-8298559/Swearing-Spanish-hugs-Ronnie-Mark-Clattenburg-selects-FIVE-best-players-refereed.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/08/00/28138468-0-image-a-22_1588893796293.jpg", "publishedAt": "2020-05-07T23:47:10Z", "content": "Taking charge of football's heavyweights heaps pressure on a referee, but Mark Clattenburg looks back fondly on his encounters with legends of the game. \r\nThe former Premier League official's career highlights include the Champions League and European Champio… [+6258 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Sir Alex Ferguson's X-rated Man Utd teamtalk warning stars not to 'f*** up his Sunday' - Mirror Online", "description": "Ferguson was no stranger to a dressing down during his time as United manager, particularly when it came to matches against their rivals, who didn't come much bigger than Arsenal", "url": "https://www.mirror.co.uk/sport/football/news/sir-alex-fergusons-x-rated-21990703", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21990661.ece/ALTERNATES/s1200/0_Manchester-United-v-Aston-Villa.jpg", "publishedAt": "2020-05-07T23:34:30Z", "content": "Sir Alex Ferguson fired an x-rated warning to his Man Utd stars not to 'f*** up his Sunday' during a pre-match teamtalk ahead of a clash with rivals Arsenal. \r\nThe legendary boss had a reputation for dishing out his famed 'hairdryer treatment' in the dressing… [+2385 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Keith Jackson, Gary Ralston", "title": "Rangers MD Stewart Robertson ducks out of SPFL meeting as whistle-blower faces axe over classified leak - Daily Record", "description": "Robertson staggered his colleagues on the league’s board by going public with an avalanche of commercially sensitive information.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/rangers-md-stewart-robertson-ducks-21993218", "urlToImage": "https://i2-prod.dailyrecord.co.uk/incoming/article12081135.ece/ALTERNATES/s1200/14625032.jpg", "publishedAt": "2020-05-07T22:22:27Z", "content": "Rangers managing director Stewart Robertson has claimed the SPFLs governance was the worst hes ever known as his position on the league board hung in the balance.\r\nThe Ibrox MD turned whistle-blower to leak classified material straight from the Hampden boardr… [+4987 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "UFC 249 Cold Open - UFC - Ultimate Fighting Championship", "description": "Ron Perlman is back to get us ready for a stacked card from top to bottom. UFC 249: Ferguson vs Gaethje is Saturday, May 9. Subscribe to get all the latest U...", "url": "https://www.youtube.com/watch?v=vdZ8UrXSrSA", "urlToImage": "https://i.ytimg.com/vi/vdZ8UrXSrSA/maxresdefault.jpg", "publishedAt": "2020-05-07T22:00:22Z", "content": null}, {"source": {"id": null, "name": "Motorsport.com"}, "author": "Lewis Duncan", "title": "Watch: A shocking moment in 500cc MotoGP history - Motorsport.com", "description": "In the second installment of free episodes from Motorsport.tv's Duke archive, relive a farcical 1989 US Motorcycle Grand Prix which offers a stark reminder of how far MotoGP safety standards have come.", "url": "https://www.motorsport.com/motogp/news/shocking-moment-video-500cc-motogp/4789666/", "urlToImage": "https://cdn-1.motorsport.com/images/amp/Yv83EM70/s6/kevin-magee-and-wayne-rainey-1.jpg", "publishedAt": "2020-05-07T21:36:05Z", "content": "The 1989 American Motorcycle Grand Prix isn't history's most significant race, but a re-watch of the event offered up a grim reminder of what MotoGP used to be like.\r\nThe 500cc American Grand Prix was round three of a 1989 season that was already shaping up t… [+5539 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ben Husband", "title": "'It's on!' - West Brom and Leeds United fans go nuts after FA promotion update - Birmingham Live", "description": "West Brom and Leeds United are separated by just a point at the top of the Championship", "url": "https://www.birminghammail.co.uk/sport/football/football-news/its-on-west-brom-leeds-18219129", "urlToImage": "https://i2-prod.birminghammail.co.uk/sport/football/football-news/article17563749.ece/ALTERNATES/s1200/0_Bilic-Bielsa.jpg", "publishedAt": "2020-05-07T20:56:49Z", "content": "West Brom and Leeds United fans have had their say, after reports emerged that the Football Association will block any plans to void the Premier League season and cancel relegations.\r\nThe Times have reported that powers given to the FA in 1991, means the gove… [+1573 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Associated Press", "title": "Ravens' Earl Thomas held at gunpoint by wife over alleged affair, police say - The Guardian", "description": "Future Hall of Fame safety Earl Thomas was held at gunpoint by his wife after he was found with another woman and his brother, according to an affidavit", "url": "https://www.theguardian.com/sport/2020/may/07/earl-thomas-held-gunpoint-affair-felony", "urlToImage": "https://i.guim.co.uk/img/media/437339f3522c5a2447a5e6cd3a2beecd884a5f86/0_149_3598_2159/master/3598.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2ba24902ff5280a15519544597928b26", "publishedAt": "2020-05-07T20:51:00Z", "content": "The lawyer for the wife of Baltimore Ravens safety Earl Thomas said she is being subjected to an unfounded ongoing investigation by Texas police after she allegedly pointed a gun at her husbands head upon finding him in bed with another woman last month.\r\nAcc… [+3446 chars]"}, {"source": {"id": null, "name": "Justarsenal.com"}, "author": "Admin Martin", "title": "Thierry Henry risks angering Arsenal’s fans by making Liverpool admission - Just Arsenal News", "description": "Thierry Henry has risked the wrath of Arsenal fans by insisting that he wanted Liverpool to match Arsenal’s unbeaten run. The Gunners won the Premier League without tasting defeat in the 2003/2004 season, and Liverpool came close to matching that this season.", "url": "https://www.justarsenal.com/thierry-henry-risks-angering-arsenals-fans-by-making-liverpool-admission/244346", "urlToImage": "https://icdn.justarsenal.com/wp-content/uploads/2018/05/henry-arsenal.jpg", "publishedAt": "2020-05-07T20:45:38Z", "content": "Thierry Henry has risked the wrath of Arsenal fans by insisting that he wanted Liverpool to match Arsenals unbeaten run.\r\nThe Gunners won the Premier League without tasting defeat in the 2003/2004 season, and Liverpool came close to matching that this season.… [+1739 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "UFC 249: Ngannou vs Rozenstruik - Preview - UFC - Ultimate Fighting Championship", "description": "Preview the explosive heavyweight matchup set to go down at UFC 249 between Francis Ngannou and Jairzinho Rozenstruik on Saturday night. Subscribe to get all...", "url": "https://www.youtube.com/watch?v=gEa0Cj3JoXg", "urlToImage": "https://i.ytimg.com/vi/gEa0Cj3JoXg/maxresdefault.jpg", "publishedAt": "2020-05-07T20:35:49Z", "content": "Preview the explosive heavyweight matchup set to go down at UFC 249 between Francis Ngannou and Jairzinho Rozenstruik on Saturday night.\r\nSubscribe to get all the latest UFC content: http://bit.ly/2uJRzRR\r\nExperience UFC live with UFC FIGHT PASS, the digital … [+628 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ben Husband", "title": "FA to scrap proposal that would see Aston Villa stay in the Premier League - reports - Birmingham Live", "description": "Aston Villa news - Dean Smith's team are battling relegation, while Liverpool are just a few weeks away from winning the title", "url": "https://www.birminghammail.co.uk/sport/football/football-news/fa-scrap-proposal-would-see-18218579", "urlToImage": "https://i2-prod.birminghammail.co.uk/incoming/article17802513.ece/ALTERNATES/s1200/0_GettyImages-1206698278.jpg", "publishedAt": "2020-05-07T20:27:29Z", "content": "The Football Association will block any move to make the season null and void, with relegations definitely taking place at the end of the campaign.\r\nThe Times have reported that powers given to the FA in 1991, means the governing body would need to consent to… [+1889 chars]"}, {"source": {"id": null, "name": "Hitc.com"}, "author": "Danny Owen", "title": "Report: Growing optimism that Liverpool will sign PL rivals’ £200k-a-week target - HITC - Football, Gaming, Movies, TV, Music", "description": "Liverpool’s hopes of signing Kalidou Koulibaly appear to be growing, with Le10 Sport reporting that the Premier League leaders are in pole position to sign the Napoli centre-back ahead of Newcastle United. The Magpies may be about to become one of the richest…", "url": "https://www.hitc.com/en-gb/2020/05/07/report-growing-optimism-that-liverpool-will-sign-pl-rivals-200k-a-week-target/", "urlToImage": "https://www.hitc.com/static/uploads/hitcn/1732/jurgen_klopp_manager_of_liverpool_celebrates_after_the_premier_l_1470778.jpg", "publishedAt": "2020-05-07T20:26:59Z", "content": "Justin Setterfield/Getty Images\r\nLiverpools hopes of signing Kalidou Koulibaly appear to be growing, with Le10 Sport reporting that the Premier League leaders are in pole position to sign the Napoli centre-back ahead of Newcastle United.\r\nThe Magpies may be a… [+1276 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Charlotte Daly For Mailonline", "title": "Who will Mike Tyson fight in charity boxing match? Here's 5 legendary names he could come up against - Daily Mail", "description": "Mike Tyson showed off his remarkable body transformation at 53-years-old as the heavyweight icon prepares to return to the boxing ring for four-round exhibition fights", "url": "https://www.dailymail.co.uk/sport/boxing/article-8288267/Who-Mike-Tyson-fight-charity-boxing-match-Heres-5-legendary-names-come-against.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/05/16/28033394-0-image-a-60_1588690827670.jpg", "publishedAt": "2020-05-07T20:15:45Z", "content": "Mike Tyson has shown off his remarkable body transformation in preparation for a return to the boxing ring to raise money for charity in four-round exhibition fights, but the question remains... just who will 'Iron Mike' face?\r\nThe former heavyweight champion… [+6308 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Man Utd news: Sir Alex Ferguson swore at 15-year-old Darren Fletcher for thinking about rejecting club - Metro.co.uk", "description": "A tense phone call for the teenager...", "url": "https://metro.co.uk/2020/05/07/sir-alex-ferguson-swore-15-year-old-darren-fletcher-thinking-about-rejecting-manchester-united-12670956/", "urlToImage": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2020/05/GettyImages-141929313_1588880116.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "publishedAt": "2020-05-07T20:05:38Z", "content": "Sir Alex Ferguson and Darren Fletcher struck up a close friendshipeventually (Picture: getty)\r\nFormer Manchester United midfielder Darren Fletcher has revealed Sir Alex Ferguson launched a foul-mouthed rant at him when he was just 15 years old because he was … [+3738 chars]"}, {"source": {"id": null, "name": "Tbrfootball.com"}, "author": "Giuseppe Labellarte", "title": "Report: Spurs in pole position for world-class player ‘attracted by prospect’ of Mourinho and London - TBR - The Boot Room - Football News", "description": "Tottenham Hotspur are now leading the race to sign Thomas Meunier on a free transfer this summer, according to Le Parisien. The outlet claims that Paris Saint-Germain are looking to cut their losses and won’t be offering the right-back a new deal, while at th…", "url": "https://tbrfootball.com/report-spurs-in-pole-position-for-world-class-player-attracted-by-prospect-of-mourinho-and-london/", "urlToImage": "/static/uploads/2019/06/GettyImages-1127648426-1000x600.jpg", "publishedAt": "2020-05-07T19:45:46Z", "content": "Tottenham Hotspur are now leading the race to sign Thomas Meunier on a free transfer this summer, according to Le Parisien.\r\nThe outlet claims that Paris Saint-Germain are looking to cut their losses and wont be offering the right-back a new deal, while at th… [+1816 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Vic Marks", "title": "Joe Root says England are ready to go into isolation to save summer Tests - The Guardian", "description": "The England captain is optimistic about the possibility of Tests being played this summer with a 30-man squad staying in the same hotel", "url": "https://www.theguardian.com/sport/2020/may/07/cricket-joe-root-england-ready-for-isolation-to-save-tests-west-indies-pakistan", "urlToImage": "https://i.guim.co.uk/img/media/3252cd550689b8c47d36744682478fbea5d283bf/125_437_3590_2153/master/3590.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3da72c05792beacef6f576b02e5775a6", "publishedAt": "2020-05-07T19:32:51Z", "content": "Joe Root says England are ready to go into isolation to save this summers Test series against the West Indies and Pakistan. That could mean the Test captain also missing the birth of his second child but he is ready to make that sacrifice for a return to live… [+3751 chars]"}, {"source": {"id": null, "name": "Autosport.com"}, "author": "Luke Smith", "title": "F1 News: Williams fears F1 could lose 'an awful lot of teams' - Autosport", "description": "Claire Williams fears F1 could lose \"an awful lot of teams\" if it is unable to race this year", "url": "https://www.autosport.com/f1/news/149337/williams-fears-f1-could-lose-an-awful-lot-of-teams", "urlToImage": "https://d2d0b2rxqzh1q5.cloudfront.net/sv/2.183/dir/4c9/image/4c949b68827d372cb43c697d86b20444.jpg", "publishedAt": "2020-05-07T19:32:48Z", "content": "Claire Williams fears Formula 1 could lose \"an awful lot of teams\" if it is unable to race this year as plans evolve to get the season started.\r\nThe COVID-19 pandemic has caused the opening 10 races of the 2020 season to be called off, which is set to hit tea… [+2448 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Chris Knight", "title": "Newcastle takeover headlines with 'massive investment' reportedly planned by would-be owners - Chronicle Live", "description": "All the latest Newcastle United takeover headlines including updates on the manager search and Saudi Arabia's Public Investment Fund", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/newcastle-takeover-latest-saudi-pif-18218694", "urlToImage": "https://i2-prod.chroniclelive.co.uk/incoming/article18145753.ece/ALTERNATES/s1200/1_Takeover4.jpg", "publishedAt": "2020-05-07T19:18:38Z", "content": "The would-be owners of Newcastle United are plotting 'massive investment' into the club - according to reports in French media.\r\nElsewhere, Saudi Arabia's Public Investment Fund have reportedly lodged a bid for Warner Music Group.\r\nHere are your top Newcastle… [+8372 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "https://www.facebook.com/rishabh.singh96387", "title": "Dustin Poirier Replies to Conor McGregor in the Cheekiest Way Possible - Essentially Sports", "description": "In a deleted tweet, Conor McGregor was unhappy with the UFC rankings because Dustin Poirier was ahead of him. Subsequently, Poirier gave the cheekiest reply", "url": "https://www.essentiallysports.com/ufc-news-dustin-poirier-replies-to-conor-mcgregor-in-the-cheekiest-way-possible/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200508001609/456100670.jpg.0.jpg", "publishedAt": "2020-05-07T19:17:00Z", "content": "For the past few months, Conor McGregor has been in news majorly for his efforts against battling Coronavirus. However, now as the UFC looks back to restore normalcy in business, its biggest draw is hinting at a comeback. In his latest attempt, he has aimed t… [+2472 chars]"}, {"source": {"id": null, "name": "Teamtalk.com"}, "author": null, "title": "Sancho makes major Dortmund contract decision amid Man Utd links - Teamtalk.com", "description": "Borussia Dortmund are not planning for Jadon Sancho to leave this summer - although the player still hopes for a move, according to a report.", "url": "https://www.teamtalk.com/news/jadon-sancho-dortmund-contract-decision-man-utd-links", "urlToImage": "https://d3vlf99qeg6bpx.cloudfront.net/content/uploads/2020/04/25132423/Jadon.Sancho1.jpg", "publishedAt": "2020-05-07T19:02:00Z", "content": "Borussia Dortmund are not planning for Jadon Sancho to leave this summer – although the player still hopes for a move, according to a report.\r\nEngland winger Sancho is being heavily linked with a return to the Premier League when the transfer window re-opens,… [+1219 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Ben Hayward", "title": "Manchester United to sign Barcelona teenager Marc Jurado - Evening Standard", "description": "", "url": "https://www.standard.co.uk/sport/football/manchester-united-fc-barcelona-transfer-latest-marc-jurado-a4435396.html", "urlToImage": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2020/05/07/16/marc-jurado.jpg", "publishedAt": "2020-05-07T18:39:42Z", "content": "Manchester United are set to sign 16-year-old right-back Marc Jurado from Barcelona.\r\nBarca were hoping to tie down the talented defender with a new three-year contract, but the Catalan has turned down a lucrative offer from the Blaugrana and is expected to l… [+768 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Every Bantamweight Champion in UFC History - UFC - Ultimate Fighting Championship", "description": "Take a look back through all the bantamweight champions in UFC history. The first and most champion face off at UFC 249 this weekend in Dominick Cruz and Hen...", "url": "https://www.youtube.com/watch?v=D8HK1ou2G_4", "urlToImage": "https://i.ytimg.com/vi/D8HK1ou2G_4/maxresdefault.jpg", "publishedAt": "2020-05-07T18:36:12Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Formula 1 may not race in 2020, say bosses - BBC Sport", "description": "Formula 1 chairman Chase Carey has admitted that the sport's owners are preparing for \"the remote possibility of no racing in 2020\".", "url": "https://www.bbc.co.uk/sport/formula1/52568642", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/9D92/production/_112183304_chasecarey.jpg", "publishedAt": "2020-05-07T18:27:01Z", "content": "Testing times: will February's test sessions in Barcelona be the only on-track action we will see this year?\r\nFormula 1 chairman Chase Carey has admitted that the sport's owners are preparing for \"the remote possibility of no racing in 2020\".\r\nHe said they di… [+2648 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Coronavirus: Saracens players apologise after meeting for coffee - Sky Sports", "description": "England international Billy Vunipola was among five Saracens players who have apologised for violating lockdown rules.", "url": "https://www.skysports.com/rugby-union/news/12572/11984901/coronavirus-saracens-players-apologise-after-meeting-for-coffee", "urlToImage": "https://e0.365dm.com/20/01/1600x900/skysports-rugby-billy-vunipola_4896015.jpg", "publishedAt": "2020-05-07T18:25:09Z", "content": "England international Billy Vunipola was among five Saracens players who have apologised for violating the lockdown rules that are in place to curb the spread of coronavirus.\r\nVunipola and team-mates Alex Goode, Sean Maitland, Nick Isiekwe and Josh Ibuanokpe … [+1251 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Freddie Keighley", "title": "Gary Neville slams 'awful' Angel Di Maria after wife's criticism of Manchester - Mirror Online", "description": "The Manchester United legend has hit back at Di Maria and his wife - admitting that they had a bad experience in the city but claiming the Argentine \"played like a drain\"", "url": "https://www.mirror.co.uk/sport/football/news/gary-neville-slams-awful-angel-21988625", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21916918.ece/ALTERNATES/s1200/0_FILES-FBL-ENG-PR-NEVILLE-TRANSFERS-HEALTH-VIRUS.jpg", "publishedAt": "2020-05-07T18:06:07Z", "content": "Gary Neville has blasted Angel Di Maria after his wife launched a scathing verbal assault on Manchester.\r\n Di Maria endured a torrid time in the city after joining Manchester United from Real Madrid for £59.7million in 2014. \r\nThe Argentina winger scored only… [+1792 chars]"}, {"source": {"id": null, "name": "Sportwitness.co.uk"}, "author": "Lucas Sposito", "title": "Transfer fee revealed as player set to join Man United - 'Different sources' back deal up - Sport Witness", "description": "On Thursday morning, Catalan outlet Sport broke the news Manchester United are signing the Barcelona youngster Marc Jurado. It’s been claimed that after failed negotiations to extend his contract with the Camp Nou side, the 16-year-old has decided to move to …", "url": "http://sportwitness.co.uk/transfer-fee-revealed-player-set-join-man-united-different-sources-back-deal/", "urlToImage": "http://sportwitness.co.uk/wp-content/uploads/2018/12/Screen-Shot-2018-12-16-at-20.01.30.png", "publishedAt": "2020-05-07T17:40:54Z", "content": "On Thursday morning, Catalan outlet Sport broke the news Manchester United are signing the Barcelona youngster Marc Jurado.\r\nIt’s been claimed that after failed negotiations to extend his contract with the Camp Nou side, the 16-year-old has decided to move to… [+821 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Graeme Young", "title": "UEFA break silence on football's return as Aleksander Ceferin shares delight over key update - Daily Record", "description": "Fixtures in Germany will recommence on May 16 as the beautiful game exits cold storage after two months on the shelf.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/uefa-break-silence-footballs-return-21992093", "urlToImage": "https://i2-prod.dailyrecord.co.uk/incoming/article21705091.ece/ALTERNATES/s1200/0_UEFA-Congress.jpg", "publishedAt": "2020-05-07T16:59:08Z", "content": "Delighted UEFA president Aleksander Ceferin has hailed German football as an example for others to follow after they announced the return of the Bundesliga. \r\nFixtures will recommence on May 16 as the beautiful game exits cold storage after two months on the … [+1199 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ben Husband", "title": "'I am sure' - President makes huge Liverpool transfer claim that will interest Wolves - Birmingham Live", "description": "Wolves and Liverpool have been heavily linked with the Werder Bremen forward in recent months", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/liverpool-transfer-news-rashica-wolves-18216155", "urlToImage": "https://i2-prod.birminghammail.co.uk/incoming/article16937063.ece/ALTERNATES/s1200/0_Liverpool-v-Stoke-City-Premier-League.jpg", "publishedAt": "2020-05-07T16:52:23Z", "content": "The President of the Kosovan Football Federation has claimed that Liverpool are interested in signing Milot Rashica from Werder Bremen.\r\n Liverpool, along with Wolverhampton Wanderers and Aston Villa, have been credited with an interest in bringing the forwar… [+1499 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Michael Carrick: Manchester United coach admits uncertainty 'difficult' for players - Sky Sports", "description": "Michael Carrick believes the uncertainty around the season's resumption is the \"biggest challenge\" for Premier League players.", "url": "https://www.skysports.com/football/news/11667/11984819/michael-carrick-manchester-united-coach-admits-uncertainty-difficult-for-players", "urlToImage": "https://e0.365dm.com/20/02/1600x900/skysports-fred-michael-carrick_4919857.jpg", "publishedAt": "2020-05-07T16:35:49Z", "content": "Manchester United assistant coach Michael Carrick believes the uncertainty around the season's resumption is the \"biggest challenge\" for Premier League players during the lockdown.\r\nCoronavirus has seen football in England suspended indefinitely since March, … [+2799 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Carrie Dunn", "title": "'Shove it' - Alan Shearer's most outspoken moments against Mike Ashley - Chronicle Live", "description": "In the 14 years since his retirement, Shearer has never been shy about directing some cutting words towards Newcastle United owner Ashley", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/shove-it-alan-shearers-most-18215264", "urlToImage": "https://i2-prod.chroniclelive.co.uk/incoming/article3187133.ece/ALTERNATES/s1200/alan-shearer.jpg", "publishedAt": "2020-05-07T16:32:29Z", "content": "Alan Shearer isnt very fond of Newcastle United owner Mike Ashley to say the least. \r\nThe Magpies legend spent the final decade of his club career at St James Park, becoming their record goalscorer and took over as manager for a handful of games at the end of… [+2979 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Mark Jones", "title": "Dean Henderson \"will expect\" to replace David de Gea as Man Utd No.1 next season - Mirror Online", "description": "The Englishman has enjoyed a stellar season on loan at Sheffield United, and will have his eye on De Gea's shirt for the 2020/21 campaign according to Eric Steele", "url": "https://www.mirror.co.uk/sport/football/news/dean-henderson-will-expect-replace-21991735", "urlToImage": "https://i2-prod.dailystar.co.uk/incoming/article21223332.ece/ALTERNATES/s1200/0_GettyImages-1190729636.jpg", "publishedAt": "2020-05-07T16:03:16Z", "content": "Dean Henderson will have no qualms about taking on David de Gea for Manchester United's No1 shirt next season, according to the man who signed him at Old Trafford.\r\nEnglish goalkeeper Henderson has been in fine form during his second season on loan at Sheffie… [+1705 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Jake Polden", "title": "Barcelona right-back set for Man Utd transfer - and Spanish club are 'not happy' - Mirror Online", "description": "Barcelona were hoping to tie Marc Jurado down to a new contract, but the right-back opted against signing fresh terms. He is now expected to join Manchester United", "url": "https://www.mirror.co.uk/sport/football/news/barcelona-right-back-set-man-21990589", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21778402.ece/ALTERNATES/s1200/0_LASK-v-Manchester-United-UEFA-Europa-League-Round-of-16-First-Leg-Linzer-Stadion.jpg", "publishedAt": "2020-05-07T15:58:45Z", "content": "Barcelona right-back Marc Jurado is set to sign for Manchester United after rejecting a new deal to stay in Spain, according to reports.\r\nThe La Liga giants were hoping to tie the 16-year-old down to a new contract, and were locked in negotiations with him fo… [+1532 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Richard Fay", "title": "Who is Marc Jurado? Manchester United future signing profiled - Manchester Evening News", "description": "Man Utd are expected to sign young full-back Marc Jurado from FC Barcelona ahead of the new academy season.", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/man-utd-marc-jurado-wiki-18214565", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/incoming/article18214792.ece/ALTERNATES/s1200/0_Screenshot_20200507_130211.jpg", "publishedAt": "2020-05-07T15:03:12Z", "content": "Manchester United are planning for the future with the capture of Marc Jurado from FC Barcelona.\r\nThe 16-year-old is expected to join United at the end of the season after rejecting a new contract offer from the Spanish giants to keep him at the club.\r\nJurado… [+1314 chars]"}, {"source": {"id": null, "name": "Teamtalk.com"}, "author": null, "title": "Barcelona left shocked as Man Utd reach deal for prized academy asset - Teamtalk.com", "description": "Manchester United have reached an agreement to sign promising Barcelona youngster Marc Jurado this summer, according to a report.", "url": "https://www.teamtalk.com/news/barcelona-shocked-man-utd-marc-jurado-deal", "urlToImage": "https://d3vlf99qeg6bpx.cloudfront.net/content/uploads/2020/01/11163023/Ole.Gunnar.Solskjaer.Man_.Utd_.TEAMtalk-1.jpg", "publishedAt": "2020-05-07T14:50:25Z", "content": "Manchester United have reached an agreement to sign promising Barcelona youngster Marc Jurado this summer, according to a report.\r\nThe 16-year-old, who plays at right-back, has been in the Barcelona ranks for nine years and has become one of the club’s most p… [+1478 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Leicester City set deadline for decisions on five players – report - Leicestershire Live", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMibWh0dHBzOi8vd3d3LmxlaWNlc3Rlcm1lcmN1cnkuY28udWsvc3BvcnQvZm9vdGJhbGwvdHJhbnNmZXItbmV3cy9sZWljZXN0ZXItY2l0eS1zZXQtZGVhZGxpbmUtZGVjaXNpb25zLTQxMTQwNjLSAXFodHRwczovL3d3dy5sZWljZXN0ZXJtZXJjdXJ5LmNvLnVrL3Nwb3J0L2Zvb3RiYWxsL3RyYW5zZmVyLW5ld3MvbGVpY2VzdGVyLWNpdHktc2V0LWRlYWRsaW5lLWRlY2lzaW9ucy00MTE0MDYyLmFtcA?oc=5", "urlToImage": null, "publishedAt": "2020-05-07T14:12:00Z", "content": null}, {"source": {"id": null, "name": "Coventrytelegraph.net"}, "author": "Elliott Jackson, James Rushton", "title": "Coventry City to receive massive Government boost - report - Coventry Telegraph", "description": "Boris Johnson is set to address the country on Sunday over lockdown measures", "url": "https://www.coventrytelegraph.net/sport/football/football-news/coventry-city-receive-massive-government-18212094", "urlToImage": "https://i2-prod.birminghammail.co.uk/incoming/article17760895.ece/ALTERNATES/s1200/0_JS206467845.jpg", "publishedAt": "2020-05-07T14:09:18Z", "content": "Coventry City supporters could be back in football stadiums by October with Boris Johnson set to lay out a six-month plan to get the United Kingdom out of lockdown.\r\nThere is a massive caveat involving the Sky Blues though - as their season hinges on an EFL v… [+2887 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Paul Pogba and Marcus Rashford can return Manchester United to glory - Ander Herrera | ESPN FC - ESPN UK", "description": "Ander Herrera reflects on his time at Manchester United with ESPN FC’s Alexis Nunes. The PSG midfielder admits he never intended to leave Man United, and say...", "url": "https://www.youtube.com/watch?v=Oia5cHE2s_s", "urlToImage": "https://i.ytimg.com/vi/Oia5cHE2s_s/maxresdefault.jpg", "publishedAt": "2020-05-07T14:00:09Z", "content": null}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Samuel Luckhurst", "title": "Manchester United set to sign Marc Jurado from FC Barcelona - Manchester Evening News", "description": "Man United signed Gerard Pique from the Barcelona academy in 2004 - the year Marc Jurado was born.", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/man-utd-transfer-news-jurado-18214325", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/incoming/article18214464.ece/ALTERNATES/s1200/0_juradoJPG.jpg", "publishedAt": "2020-05-07T13:40:20Z", "content": "Manchester United are close to finalising a deal for Barcelona defender Marc Jurado.\r\n Right-back Jurado, 16, is understood to have rejected a professional contract at Barca and is expected to be named among United's academy intake for next season.\r\nSources i… [+1516 chars]"}, {"source": {"id": null, "name": "Football365.com"}, "author": "Matthew Stead", "title": "Manchester United anger Barcelona by signing youth 'emblem' for £1.3m - Football365.com", "description": "Football365 - Manchester United have p*ssed Barcelona off a little by bringing in 16-year-old right-back Marc Jurado for absolute peanuts.", "url": "https://www.football365.com/news/barcelona-furious-manchester-united-marc-jurado-1-3m", "urlToImage": "https://d2x51gyc4ptf2q.cloudfront.net/content/uploads/2020/02/20170134/Ole-Gunnar-Solskjaer-Football365.jpg", "publishedAt": "2020-05-07T12:25:14Z", "content": "Manchester United have agreed a deal to sign Marc Jurado from Barcelona for little over £1.3m.\r\nJurado, the 16-year-old right-back, is considered one of the best current talents in Barcelona’s famed development system.\r\nHaving spent almost a decade with the c… [+1446 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Mark Wakefield", "title": "Liverpool legend Steven Gerrard had big question for Jurgen Klopp after bumping into him during lockdown - Liverpool Echo", "description": "Gerrard enjoyed 17 years at Anfield, and he says the Reds still hold a special place in his heart", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-legend-steven-gerrard-big-18211693", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/sport/football/article17248542.ece/ALTERNATES/s1200/0_GettyImages-962401528.jpg", "publishedAt": "2020-05-07T12:18:15Z", "content": "Liverpool legend Steven Gerrard has opened up on a conversation he had with Reds boss Jurgen Klopp during lockdown. \r\nElite football across the UK, including the Premier League, is currently suspended due to the coronavirus pandemic, with no clear return date… [+2883 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Tyrone Marshall", "title": "The tactical change Ole Gunnar Solskjaer must make to take Manchester United to the next level - Manchester Evening News", "description": "Man Utd have been in great form recently under Ole Gunnar Solskjaer but there was one big shift they can make to progress further.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-utd-tactics-under-solskjaer-18214327", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/article17108295.ece/ALTERNATES/s1200/0_GettyImages-1075929390.jpg", "publishedAt": "2020-05-07T11:56:14Z", "content": "Ole Gunnar Solskjaer has struck upon a couple of systems that have served Manchester United well this season, but there may well be another change required to take this side to the next level. \r\n United have thrived recently in the bigger games with a back th… [+3589 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Macclesfield Town given further seven-point deduction - Sky Sports", "description": "Macclesfield have been hit with an immediate seven-point deduction after admitting two misconduct charges.", "url": "https://www.skysports.com/football/news/36067/11984560/macclesfield-town-given-immediate-seven-point-deduction", "urlToImage": "https://e1.365dm.com/20/05/1600x900/skysports-football-macclesfield_4985208.jpg", "publishedAt": "2020-05-07T11:37:30Z", "content": "Macclesfield have been hit with an immediate seven-point deduction which leaves them three points off the bottom of Sky Bet League Two.\r\nTown had admitted two misconduct charges relating to an unfulfilled fixture against Plymouth on December 21 and non-paymen… [+1813 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Caoimhe O'Neill, Mark Wakefield", "title": "James Rodriguez battle, Moise Kean offer and other Everton transfer rumours rated - Liverpool Echo", "description": "Here we bring you a full round-up of the latest Everton transfer rumours doing the rounds and we rate them for you", "url": "https://www.liverpoolecho.co.uk/sport/football/transfer-news/james-rodriguez-battle-moise-kean-18208849", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article17602289.ece/ALTERNATES/s1200/0_GettyImages-1182147310.jpg", "publishedAt": "2020-05-07T11:11:54Z", "content": "Moise Kean\r\nWho?\r\nItalian striker who Everton signed from Juventus last summer.\r\nWhere?\r\nLa Gazzetta dello Sport have reported AS Roma are looking to offload Justin Kluivert in order to fund a move for Moise Kean this summer. \r\nWhat?\r\nThis isn't the first tim… [+2208 chars]"}, {"source": {"id": null, "name": "Leicestertigers.com"}, "author": null, "title": "Leicester lock in quintet of young Tigers - Leicester Tigers", "description": "The club have agreed new deals with five members of the Tigers Development Squad ahead of the 2020/21 season.", "url": "https://www.leicestertigers.com/news/leicester-lock-in-quintet-of-young-tigers", "urlToImage": "https://darkroom.leicestertigers.com/1000/cf0b63c73e77c0254b10eab0d35d20d7:69ce39dc46c3535e1696bb245f15d44f/lead-renewals-developmentsquad-200507.jpg", "publishedAt": "2020-05-07T11:05:29Z", "content": "Tigers head coach Geordan Murphy said the five players have “earned” the new deals and represented the club’s commitment to developing from within if the player show the attributes and characteristics expected of players in Leicester.\r\n“We are passionate abou… [+1311 chars]"}, {"source": {"id": null, "name": "Eadt.co.uk"}, "author": "Mark Heath", "title": "Coronavirus: 2020/21 EFL season could be delayed until fans can attend games | Ipswich Town FC and Suffolk & Essex Sport - East Anglian Daily Times", "description": "The 2020/21 League One season could be delayed until fans can attend games again, EFL chairman Rick Parry has said.", "url": "https://www.eadt.co.uk/sport/2020-21-efl-season-could-be-delayed-1-6640323", "urlToImage": "https://www.eadt.co.uk/polopoly_fs/1.6640325!/image/image.jpg", "publishedAt": "2020-05-07T11:00:00Z", "content": "PollPUBLISHED: 12:00 07 May 2020 | UPDATED: 12:05 07 May 2020\r\nThe 2020/21 EFL season could be delayed until fans are allowed to return to grounds, according to EFL chaurman Rick Parry\r\nRachel Edge\r\nWhile discussions are ongoing about how and when to finish t… [+2484 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Etienne Fermie", "title": "Son Heung-min carries gun and wears a bulletproof helmet with camouflage uniform at firing range during - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11561821/son-heung-min-spurs-military-service-gun-uniform/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/05/SPORT-PREVIEW-Heung-min-Son-Marine-Corps-Firing-Range.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-05-07T10:49:57Z", "content": "SON HEUNG-MIN has been pictured carrying a gun while being put through his paces during military training in South Korea.\r\nThe Tottenham star is currently at a base in Seogwipo on Jeju Island off the south coast of his home country.\r\n Son has been pictured in… [+1893 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "James Dielhenn", "title": "Anthony Joshua vs Kubrat Pulev has option of Roman amphitheatre in Croatia - Sky Sports", "description": "Anthony Joshua's world heavyweight title defence vs Kubrat Pulev has been suggested to take place at a Roman amphitheatre in Croatia by the challenger's team.", "url": "https://www.skysports.com/boxing/news/12183/11984520/anthony-joshua-vs-kubrat-pulev-has-option-of-roman-amphitheatre-in-croatia", "urlToImage": "https://e2.365dm.com/19/12/1600x900/skysports-anthony-joshua-boxing_4880066.jpg", "publishedAt": "2020-05-07T10:37:15Z", "content": "Anthony Joshua's world heavyweight title defence against Kubrat Pulev has been suggested to take place at a Roman amphitheatre in Croatia by the challenger's team.\r\nJoshua was originally scheduled to put his IBF, WBA and WBO belts on the line at the Tottenham… [+2048 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Samuel Luckhurst", "title": "Alexis Sanchez could play for Manchester United if Premier League season restarts - Manchester Evening News", "description": "Man United have deemed Alexis Sanchez as surplus but he could be available for their Premier League, FA Cup and Europa League run-in if the season restarts.", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/man-united-news-alexis-sanchez-18207693", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/incoming/article18207887.ece/ALTERNATES/s1200/0_GettyImages-1206109598.jpg", "publishedAt": "2020-05-07T10:25:32Z", "content": "Alexis Sanchez could play an unlikely role in Manchester United's run-in if the Premier League stages a successful restart.\r\nSanchez, 31, is on loan at Inter Milan but his contract with the Italian club expires on June 30 and English top-flight clubs are prep… [+2683 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "\"It's My Honour\" | Frank Lampard Calls NHS Doctor & Lifelong Chelsea Fan - Chelsea Football Club", "description": "Frank Lampard sat down for a video call this week with NHS heart surgeon and Chelsea supporter Dr. Panos Theodoropoulos. In a deeply engaging must-watch conv...", "url": "https://www.youtube.com/watch?v=M6DQAoKKqOs", "urlToImage": "https://i.ytimg.com/vi/M6DQAoKKqOs/maxresdefault.jpg", "publishedAt": "2020-05-07T10:00:10Z", "content": "Frank Lampard sat down for a video call this week with NHS heart surgeon and Chelsea supporter Dr. Panos Theodoropoulos.\r\nIn a deeply engaging must-watch conversation which can be viewed above, the doctor described life on the frontline of the Covid-19 pandem… [+1076 chars]"}, {"source": {"id": null, "name": "Racefans.net"}, "author": "https://www.facebook.com/racefansdotnet/", "title": "Three footballers join same 6 F1 drivers for Virtual Spanish GP - RaceFans", "description": "The same six Formula 1 drivers who contested the last Virtual Grand Prix have been confirmed for this weekend's Spanish round of the series.", "url": "https://www.racefans.net/2020/05/07/three-footballers-join-same-six-f1-drivers-for-virtual-spanish-grand-prix/", "urlToImage": "https://www.racefans.net/wp-content/uploads/2020/04/Screenshot-2020-04-19-18.49.20.jpg", "publishedAt": "2020-05-07T09:20:00Z", "content": "The same six Formula 1 drivers who contested the last Virtual Grand Prix have been confirmed for this weekend’s Spanish round of the series.\r\nThree footballers have accepted invitations to join the race, which will be held on Circuit de Catalunya using the of… [+966 chars]"}, {"source": {"id": null, "name": "Shieldsgazette.com"}, "author": "Jordan Cronin", "title": "Fresh reports suggest timescale on Newcastle United takeover, Top target 'very close' to joining Magpies - gossip - Shields Gazette", "description": "The Bundesliga is set to resume on May 15 with the Premier League aiming to get back underway in June with plans called ‘Project Restart’.", "url": "https://www.shieldsgazette.com/sport/football/newcastle-united/fresh-reports-suggest-timescale-newcastle-united-takeover-top-target-very-close-joining-magpies-gossip-2845482", "urlToImage": "https://www.shieldsgazette.com/webimg/QVNIMTE0ODY4NjY0.jpg", "publishedAt": "2020-05-07T09:09:45Z", "content": "But In the meantime, speculation is showing no signs of slowing down when it comes to the upcoming transfer window or in Newcastle Uniteds case, a takeover.\r\nAnd as ever, were sharing the latest rumours from around the Premier League so scroll and click throu… [+928 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Daniel Murphy", "title": "Man City fans in disbelief over Leroy Sane report - Manchester Evening News", "description": "Manchester City have made it clear that they won't be letting Leroy Sane join Bayern Munich on the cheap.", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/man-city-transfers-leroy-sane-18210810", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/incoming/article18210731.ece/ALTERNATES/s1200/0_GettyImages-1159679538.jpg", "publishedAt": "2020-05-07T08:09:21Z", "content": "Manchester City fans have sided with the club over their stance on Leroy Sane and don't want the winger sold to Bayern Munich on the cheap.\r\nThe German champions have made no secret of their desire to sign Sane, having conducted an extremely public pursuit ov… [+2084 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Mark Wakefield", "title": "Turkish coach claims Trabzonspor goalkeeper has 'told him' he's signing for Liverpool this summer - Liverpool Echo", "description": "The Reds have been linked with a move for goalkeeper Uğurcan Cakir, who currently plays for Turkish club Trabzonspor", "url": "https://www.liverpoolecho.co.uk/sport/football/transfer-news/turkish-coach-claims-trabzonspor-goalkeeper-18210236", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article17932125.ece/ALTERNATES/s1200/0_GettyImages-1206707067-1.jpg", "publishedAt": "2020-05-07T07:34:02Z", "content": "Liverpool will sign goalkeeper Uurcan Cakir when the transfer window opens, according to one of the players former coaches.\r\n Cakir was very tentatively linked with a move to the Premier League in recent months, with Anfield tipped to be a potential destinati… [+1261 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Daniel Blackham", "title": "Man Utd make surprise decision over Odion Ighalo and Dean Henderson's futures - Express", "description": "Manchester United might not keep hold of Odion Ighalo for too long.", "url": "https://www.express.co.uk/sport/football/1278931/Man-Utd-surprise-decision-Odion-Ighalo-Dean-Henderson", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/67/750x445/1278931.jpg", "publishedAt": "2020-05-07T05:32:58Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Nick Ames", "title": "England women's cricket team could be sacrificed as potential £380m loss looms - The Guardian", "description": "The England women’s cricket team could in effect be sacrificed this summer as the England and Wales Cricket Board seeks to mitigate a potential £380m loss", "url": "https://www.theguardian.com/sport/2020/may/06/england-women-cricket-team-could-be-sacrificed-as-potential-380m-loss-looms-ecb-coronavirus", "urlToImage": "https://i.guim.co.uk/img/media/4a6b5d5f974606408208d6779d0aad921f3d6b2d/14_517_3651_2191/master/3651.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ea7cbf23d93ac9bf2b8cef2f17f4c2ad", "publishedAt": "2020-05-06T19:50:55Z", "content": "The England womens cricket team could in effect be sacrificed this summer as the England and Wales Cricket Board seeks to mitigate a potential £380m loss caused by the Covid-19 pandemic.\r\nEnglands women were due to face India across June and July, but that se… [+3156 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Ben Youngs on Eddie Jones, missing the Lions tour and England's World Cup | House of Rugby S2 E40 - JOE", "description": "Alex Payne and James Haskell are joined by England’s most capped scrum-half of all-time, Mr Ben Youngs, to discuss England, Lions, Leicester and Eddie Jones’...", "url": "https://www.youtube.com/watch?v=roCQBNLr8UM", "urlToImage": "https://i.ytimg.com/vi/roCQBNLr8UM/maxresdefault.jpg", "publishedAt": "2020-05-06T19:32:42Z", "content": "Alex Payne and James Haskell are joined by Englands most capped scrum-half of all-time, Mr Ben Youngs, to discuss England, Lions, Leicester and Eddie Jones trainer collection. \r\nDenied his 100th cap when Englands Six Nations trip to Rome was postponed in Marc… [+1254 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Jake Polden", "title": "Philippe Coutinho's release clause highlights full extent of his demise after Liverpool - Mirror Online", "description": "Barcelona president Josep Maria Bartomeu made it clear the club would only sell Philippe Coutinho for his release clause back in 2018 - two years later and things are very different", "url": "https://www.mirror.co.uk/sport/football/news/philippe-coutinhos-release-clause-highlights-21982699", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21480463.ece/ALTERNATES/s1200/0_Bundesliga-Bayern-Munich-v-RB-Leipzig.jpg", "publishedAt": "2020-05-06T19:02:50Z", "content": "Philippe Coutinho had the world at his feet when he completed a £142million move to Barcelona from Liverpool back in 2018. \r\nBut the Brazilian struggled to live up to the billing in Spain and after falling down the pecking order at the Nou Camp was shipped ou… [+1705 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "EUROPEAN GIANTS KNOCKED OUT! WE SIM THE CHAMPIONS LEAGUE LAST 16 ON FIFA 20 - Dream Team", "description": "The boys are back for a very special midweek edition of #DTSimSaturday as we sim the Champions League last 16 on FIFA 20 including a huge exit! SUBSCRIBE HER...", "url": "https://www.youtube.com/watch?v=QpxGnIhnyvY", "urlToImage": "https://i.ytimg.com/vi/QpxGnIhnyvY/maxresdefault.jpg", "publishedAt": "2020-05-06T19:00:11Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "PGA Tour 2K21 - Official Teaser Trailer - IGN", "description": "Watch the teaser trailer for the upcoming PGA Tour 2K21. The full release will happen on May 14, 2020. #ign", "url": "https://www.youtube.com/watch?v=X48vvYhmajY", "urlToImage": "https://i.ytimg.com/vi/X48vvYhmajY/maxresdefault.jpg", "publishedAt": "2020-05-06T18:00:09Z", "content": "Watch the teaser trailer for the upcoming PGA Tour 2K21. The full release will happen on May 14, 2020.\r\n#ign"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Caoimhe O'Neill", "title": "Kylian Mbappe clause, Man City battle and other Liverpool transfer rumours rated - Liverpool Echo", "description": "Here we bring you a round up of all the latest Liverpool transfer rumours and we rate them for you", "url": "https://www.liverpoolecho.co.uk/sport/football/transfer-news/kylian-mbappe-clause-man-city-18205911", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/sport/football/transfer-news/article17692327.ece/ALTERNATES/s1200/1_Kylian-Mbappe-Liverpool.jpg", "publishedAt": "2020-05-06T17:47:10Z", "content": "Aster Vranckx\r\nWho?\r\nBelgian outfit KV Mechelen's breakout starlet.\r\nWhere?\r\nThe Mirror report Manchester City are set to battle Liverpool in the race to sign the teenage talent. \r\nBoth clubs have reportedly been keeping a close eye on 17-year-old midfielder.… [+2026 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Alex Dicken", "title": "What makes Mohamed Salah so special? Team-mates, rivals and managers lift lid on Liverpool superstar - Liverpool Echo", "description": "Mohamed Salah has scored 70 goals in his first 100 Premier League appearances for Liverpool", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/mohamed-salah-news-liverpool-klopp-18023544", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article17595149.ece/ALTERNATES/s1200/0_GettyImages-1200558767.jpg", "publishedAt": "2020-05-06T16:06:57Z", "content": "Mohamed Salah has been the Premier Leagues best player since he signed for Liverpool. \r\nHe claimed the prestigious PFA Player of the Year award in his first season at Anfield, pipping Manchester Citys Kevin De Bruyne thanks to a stunning 32-goal haul in the P… [+5507 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Should Esports Incidents Be Taken As Seriously As Real Racing? | Is It Just Me? With Jess & Luke - Autosport", "description": "EVERYONE has been talking about *those* Indycar Esports collisions between Pagenaud/Norris and Ferrucci/Askew. Should they have been taken more seriously, or...", "url": "https://www.youtube.com/watch?v=snJxuQOAyU8", "urlToImage": "https://i.ytimg.com/vi/snJxuQOAyU8/maxresdefault.jpg", "publishedAt": "2020-05-06T15:31:44Z", "content": "EVERYONE has been talking about *those* Indycar Esports collisions between Pagenaud/Norris and Ferrucci/Askew. Should they have been taken more seriously, or should we be taking less notice of esports incidents...after all, it's \"just a game\"...right?\r\nOn thi… [+666 chars]"}, {"source": {"id": null, "name": "Mmamania.com"}, "author": "Jesse Holland", "title": "Dana White couldn’t stomach the ‘(expletive) goofballs’ on ‘Tiger King,’ bailed after two episodes - MMA Mania", "description": "UFC President Dana White was not a fan of the “(expletive) goofballs” on the “Tiger King” documentary on Netflix and bailed after two episodes.", "url": "https://www.mmamania.com/2020/5/6/21249141/dana-white-couldnt-stomach-expletive-goofballs-tiger-king-bailed-after-two-episodes-mma", "urlToImage": "https://cdn.vox-cdn.com/thumbor/e_Oe5BCX9vk_xIe91F_aK5JWPU0=/0x289:4827x3004/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/66758523/1181652037.jpg.0.jpg", "publishedAt": "2020-05-06T14:02:08Z", "content": "Skip to main contentclock\r\nmenu\r\nmore-arrow\r\nno\r\nyes"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Mikel Arteta warns Pierre-Emerick Aubameyang over forcing Arsenal transfer exit - Mirror Online", "description": "Aubameyang is out of contract in 2021 and continues to delay penning a fresh deal amid transfer interest from Barcelona, Real Madrid and some of Arsenal's Premier League rivals", "url": "https://www.mirror.co.uk/sport/football/transfer-news/mikel-arteta-warns-pierre-emerick-21981168", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21981161.ece/ALTERNATES/s1200/0_Arsenal-FC-v-Manchester-United-Premier-League.jpg", "publishedAt": "2020-05-06T12:37:45Z", "content": "Mikel Arteta has fired a subtle warning to Pierre-Emerick Aubameyang that Arsenal will not pander to players who do not want to be at the club. \r\nThe Gabonese striker is stalling over a new contract at Arsenal with little over a year remaining on his current … [+1755 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Agbonlahor names the Manchester United defender he used to 'pick on' - Metro.co.uk", "description": "'Because of my pace I fancied myself against anyone, to be honest.'", "url": "https://metro.co.uk/2020/05/06/agbonlahor-names-manchester-united-defender-used-pick-12661126/", "urlToImage": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2020/05/GettyImages-826764832_1588758169.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "publishedAt": "2020-05-06T10:08:54Z", "content": "Agbonlahor used to target Neville (Picture: Getty)\r\nGabby Agbonlahor has revealed he used to pick on Gary Neville whenever Aston Villa played Manchester United. \r\nThe former England international used to select a player usually the slowest of the opposition d… [+1120 chars]"}]}