{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Theo Squires", "title": "Liverpool problem position Jurgen Klopp still hasn't found answer to and why that needs to change - Liverpool Echo", "description": "Jurgen Klopp might be about to address a problem position that has been troubling Liverpool since he first arrived at the club", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-problem-position-jurgen-klopp-18126046", "urlToImage": null, "publishedAt": "2020-04-26T00:04:31Z", "content": "In Trent Alexander Arnold and Andy Robertson, Jurgen Klopp boasts two of the best full-backs in world football.\r\nThe duo have reinvented how to play the position in the past two seasons, recording an astonishing 50 assists between them as Liverpool lifted the… [+4407 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Paul Gorst", "title": "Unpaid wages and baffling criticism - how Loris Karius Besiktas loan from Liverpool became a nightmare - Liverpool Echo", "description": "Loris Karius' loan move was meant to herald a fresh start, but it hasn't quite worked out like that, writes Paul Gorst", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/unpaid-wages-baffling-criticism-how-18150220", "urlToImage": null, "publishedAt": "2020-04-26T00:02:14Z", "content": "It was supposed to be a fresh start for Loris Karius.\r\nWhen the Liverpool goalkeeper traded Merseyside for Turkey in August 2018, the loan deal the Reds struck with Besiktas was meant to be one that breathed fresh life into a career that was flatlining.\r\nJust… [+5349 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Elliott Jackson", "title": "Liverpool legend Steven Gerrard compares Jordan Henderson to Paul Scholes - Liverpool Echo", "description": "The Liverpool captain is in the running to win the PFA Player of the Year award this season", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/gerrard-makes-henderson-scholes-comparison-18150146", "urlToImage": null, "publishedAt": "2020-04-26T00:02:09Z", "content": "Steven Gerrard has claimed that Liverpool captain Jordan Henderson is now running matches in the same fashion as former Manchester United midfielder Paul Scholes.\r\nHenderson has had a fantastic season for the Reds who sit top of the Premier League table by 25… [+1556 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Kathryn Batte For Mailonline", "title": "Inter Milan 'lead race for £56m Pierre-Emerick Aubameyang' with Arsenal ready to listen to offers - Daily Mail", "description": "The Gunners are thought to be willing to listen to offers for the £200,000-a-week star who is out of contract in 2021 with a new deal proving difficult to agree.", "url": "https://www.dailymail.co.uk/sport/football/article-8257511/Inter-Milan-lead-race-56m-Pierre-Emerick-Aubameyang-Arsenal-ready-listen-offers.html", "urlToImage": null, "publishedAt": "2020-04-25T23:51:12Z", "content": "Inter Milan lead the race to sign Arsenal striker Pierre-Emerick Aubameyang, according to reports.\r\nThe Gunners are thought to be willing to listen to offers for the £200,000-a-week star who is out of contract in 2021 with a new deal proving difficult to agre… [+1347 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Nick Harris for MailOnline", "title": "Premier League and UEFA insist that Newcastle must adhere to spending restrictions - Daily Mail", "description": "Both bodies have their versions of 'financial fair play' (FFP), with the Premier League limiting owner-subsidised losses to £105million over three years and UEFA limiting three-year losses to £26m.", "url": "https://www.dailymail.co.uk/sport/football/article-8257335/Premier-League-UEFA-insist-Newcastle-adhere-spending-restrictions.html", "urlToImage": null, "publishedAt": "2020-04-25T23:45:52Z", "content": "Newcastle fans hoping for a major spree by their club's perspective Saudi Arabian owners are set to be disappointed as the Premier League and UEFA insist spending restrictions will stay in place.\r\nBoth governing bodies have their own versions of 'financial fa… [+3564 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Luke Gardener", "title": "Man Utd make Pogba swap transfer decision, Aubameyang to Chelsea, Mourinho agrees deal - Express", "description": "The transfer window is fast approaching with Premier League sides such as Manchester United, Chelsea, Arsenal and Liverpool all looking to strengthen. Express Sport brings you updates throughout the day.", "url": "https://www.express.co.uk/sport/football/1273851/Transfer-news-LIVE-Man-Utd-Pogba-swap-Spurs-agree-Aubameyang-Chelsea-latest-updates-gossip", "urlToImage": null, "publishedAt": "2020-04-25T23:16:09Z", "content": null}, {"source": {"id": null, "name": "Theguardian.comfootball"}, "author": "Guardian staff reporter", "title": "Everton 'appalled' after Moise Kean hosts coronavirus lockdown party - The Guardian", "description": "Everton have labelled Moise Kean’s actions ‘unacceptable’ after he flouted coronavirus lockdown restrictions", "url": "https://amp.theguardian.comfootball/2020/apr/26/everton-appalled-moise-kean-hosts-coronavirus-lockdown-party", "urlToImage": null, "publishedAt": "2020-04-25T23:14:54Z", "content": "Everton have labelled Moise Keans actions unacceptable after he flouted coronavirus lockdown restrictions.\r\nThe striker filmed himself partying at home with guests in a breach of social distancing regulations during the coronavirus pandemic. Kean, who joined … [+1170 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Kieran Lynch For Mailonline", "title": "Eddie Hearn 'rejected chance to sign Tyson Fury because the Gypsy King was overweight' - Daily Mail", "description": "Eddie Hearn held talks with Tyson Fury about becoming his promoter before the Gypsy King's return to the ring. He turned down the chance as he felt Fury would not make his return.", "url": "https://www.dailymail.co.uk/sport/boxing/article-8257077/Eddie-Hearn-rejected-chance-sign-Tyson-Fury-Gypsy-King-overweight.html", "urlToImage": null, "publishedAt": "2020-04-25T23:11:07Z", "content": "Eddie Hearn has revealed his regret about not signing Tyson Fury in 2017, because of his weight issues at the time.\r\nThe Matchroom promoter held talks with the Gypsy King seven months before Fury made his return to the ring.\r\nAnd Hearn has revealed that Fury … [+2453 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Neil Moxley, John Richardson", "title": "Kevin Keegan lined up for Newcastle return when £300million Saudi takeover goes through - Mirror Online", "description": "EXCLUSIVE: The 69-year-old made 78 appearances for the Magpies as a player and also had two spells in charge as a manager at St James' Park", "url": "https://www.mirror.co.uk/sport/football/news/kevin-keegan-lined-up-newcastle-21926877", "urlToImage": null, "publishedAt": "2020-04-25T22:16:16Z", "content": "Kevin Keegan is being lined for a sensational return to Newcastle and the Saudi takeover could even be rubber-stamped later this week. \r\nThe man idolised as The Messiah by the Toon Army will be invited to take up an ambassadorial role when the £300m buy-out i… [+2466 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Michael Gannon", "title": "Roy MacGregor tells Rangers to 'put up or shut up' as Ross County chief demands to see alleged evidence - Daily Record", "description": "The Ross County chairman is fed up of the \"tedious\" stand off between Rangers and the SPFL.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/roy-macgregor-tells-rangers-put-21926481", "urlToImage": null, "publishedAt": "2020-04-25T22:10:12Z", "content": "Roy MacGregor has told Rangers to put up or shut up in their crusade against the SPFL.\r\nThe Ibrox club has stepped up their demands for an independent inquiry in to the voting process behind the decision to call the lower leagues with a view to drawing a line… [+2535 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Alex Dicken", "title": "Aston Villa linked with shock move to replace Dean Smith - reports - Birmingham Live", "description": "Aston Villa news - Reports have emerged in the national press to suggest AVFC are keeping tabs on another manager", "url": "https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-news-sean-dyche-18151836", "urlToImage": null, "publishedAt": "2020-04-25T22:07:29Z", "content": "Aston Villa have been linked with a shock interest in Burnley manager Sean Dyche. \r\nLike the rest of the Premier League, Villa are currently on lockdown and waiting to learn when their season will resume. \r\nDean Smith and his players have a huge task awaiting… [+858 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Alex Dicken", "title": "Leeds United could sign another Wolves star if they’re promoted - reports - Birmingham Live", "description": "Wolverhampton Wanderers transfer news - John Ruddy has played second fiddle to Rui Patricio over the past two seasons", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/leeds-united-transfer-john-ruddy-18151407", "urlToImage": null, "publishedAt": "2020-04-25T22:07:27Z", "content": "Leeds United will be offered Wolves goalkeeper John Ruddy ahead of their potential Premier League return, according to reports.\r\nLeeds are in line to seal promotion from the Championship once the football season resumes, with ex-Wolves stars Barry Douglas and… [+634 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Alex Dicken", "title": "Man Utd chief Ed Woodward makes transfer revelation that concerns Jack Grealish - Birmingham Live", "description": "Aston Villa transfer news - Man United chief Ed Woodward has made some interesting claims concerning their pursuit of transfer targets", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/manchester-united-aston-villa-grealish-18151320", "urlToImage": null, "publishedAt": "2020-04-25T22:07:25Z", "content": "Manchester United could be forced to put their pursuit of Jack Grealish on hold, Ed Woodward has warned. \r\nUnited boss Ole Gunnar Solskjaer has made signing Aston Villa captain Grealish a top priority heading into the next window. \r\nThe 24-year-old playmaker … [+1083 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Ryan Taylor", "title": "What Timo Werner said about Man Utd transfer two years ago now says more about Liverpool - Express", "description": "Timo Werner looks set to move to the Premier League in the future, but his stance on which club looks like it may have changed.", "url": "https://www.express.co.uk/sport/football/1273897/Liverpool-transfer-news-Timo-Werner-said-Man-Utd-move-comments-gossip", "urlToImage": null, "publishedAt": "2020-04-25T21:52:43Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Alex Milne", "title": "James Maddison speaks on future amid speculation linking him with Man Utd transfer - Irish Mirror", "description": "The Leicester midfielder has been continuously linked with a move to Old Trafford in recent times but has insisted he is still committed to the Foxes", "url": "https://www.mirror.co.uk/sport/football/news/james-maddison-drops-hint-over-21927407", "urlToImage": null, "publishedAt": "2020-04-25T21:34:55Z", "content": "Leicester City attacking midfielder James Maddison has insisted he wants to stay at the club despite rumours suggesting he could move to Manchester United. \r\nThe Foxes star was enjoying a superb season before football was suspended, with the 23-year-old scori… [+1757 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Sean Ingle", "title": "Olympic hopeful Eleanor Davis puts Tokyo ambition on hold to save lives - The Guardian", "description": "Eleanor Davis intended to spend Sunday running the London Marathon but the Olympic hopeful will instead be on a Covid-19 ward helping patients", "url": "https://www.theguardian.com/sport/2020/apr/25/olympic-athletics-hopeful-eleanor-davis-puts-tokyo-ambition-on-hold-to-save-lives", "urlToImage": null, "publishedAt": "2020-04-25T21:30:00Z", "content": "Eleanor Davis had intended to spend Sunday on a 42,000-step journey towards Team GBs squad for the 2020 Olympics. Instead, at 8.55am, when the London Marathon elite womens race was due to start, Davis will be on a Covid-19 ward saving lives. Its gutting that … [+4724 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Lee Wilmot", "title": "Man United chief Ed Woodward opens the door to Chelsea and huge Jadon Sancho transfer - Football.London", "description": "The Borussia Dortmund forward will be a big topic of conversation during the summer transfer window", "url": "https://www.football.london/chelsea-fc/transfer-news/man-united-chief-ed-woodward-18151791", "urlToImage": null, "publishedAt": "2020-04-25T21:03:54Z", "content": "Jadon Sancho will be hot property this summer.\r\nThe teenager has been in flying form for Borussia Dortmund this season, following up his impressive breakthrough season last year.\r\nThe recently turned 20-year-old has scored 17 goals and laid on as many assists… [+1932 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Andrew Beasley", "title": "Chelsea's cause for concern in Champions League race with Man United when Premier League returns - Football.London", "description": "Frank Lampard's side are three points ahead of Manchester United in fourth place, with nine games of the 2019/20 Premier League season remaining", "url": "https://www.football.london/chelsea-fc/news/chelseas-cause-concern-champions-league-18118068", "urlToImage": null, "publishedAt": "2020-04-25T20:53:07Z", "content": "With football on hold, fans are waiting to see how the 2019/20 Premier League season will end. \r\nThe clubs are committed to completing the season properly if they can, so if football is given the all clear to resume then focus will swiftly switch to the remai… [+3373 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Report: Club to activate clause to deny Spurs the chance to complete free transfer - The Spurs Web", "description": "Chelsea are preparing to activate a clause in Olivier Giroud's contract which could prevent the striker from joining Tottenham Hotspur on a free transfer this summer, the Guardian have revealed. Spurs were heavily linked with Giroud in January as they looked …", "url": "https://www.spurs-web.com/spurs-news/report-club-to-activate-clause-to-deny-spurs-the-chance-to-complete-free-transfer/", "urlToImage": null, "publishedAt": "2020-04-25T20:30:00Z", "content": "Chelsea are preparing to activate a clause in Olivier Girouds contract which could prevent the striker from joining Tottenham Hotspur on a free transfer this summer, the Guardian have revealed.\r\nSpurs were heavily linked with Giroud in January as they looked … [+1175 chars]"}, {"source": {"id": null, "name": "Eadt.co.uk"}, "author": "Andy Warren", "title": "Coronavirus: League One and League Two could be decided by promotion tournament | Ipswich Town FC and Suffolk & Essex Sport - East Anglian Daily Times", "description": "Promotion from both League One and League Two could be decided by mini tournaments involving eight teams, according to reports.", "url": "https://www.eadt.co.uk/sport/league-one-and-two-promotion-tournament-1-6624349", "urlToImage": null, "publishedAt": "2020-04-25T20:17:00Z", "content": "PUBLISHED: 21:17 25 April 2020 | UPDATED: 21:41 25 April 2020\r\nAndy Warren\r\nIpswich Town slipped from 1st to 10th in the League One table under Paul Lambert at the start of 2020. Photo: Pagepix\r\nPagepix Ltd 07976 935738\r\nPromotion from both League One and Lea… [+4435 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Luke Gardener", "title": "Tottenham boss Jose Mourinho convinces PSG ace to make transfer but has Daniel Levy issue - Express", "description": "Tottenham boss Jose Mourinho has convinced Paris Saint-Germain full-back Thomas Meunier to join the club in the summer transfer window.", "url": "https://www.express.co.uk/sport/football/1273871/Tottenham-news-Jose-Mourinho-PSG-transfer-Daniel-Levy-issue-Thomas-Meunier-latest-gossip", "urlToImage": null, "publishedAt": "2020-04-25T20:08:00Z", "content": "“As ever, our priority is the success of the team, but we need visibility of the impact across the whole industry, including timings of the transfer window, and the wider financial picture, before we can talk about a return to normality.\r\n“On this basis, I ca… [+501 chars]"}, {"source": {"id": null, "name": "Bjpenn.com"}, "author": "Chris Taylor", "title": "Report | Khabib Nurmagomedov’s father hospitalized due to suspected pneumonia and flu - BJPENN.COM", "description": "The father of current UFC lightweight champion Khabib Nurmagomedov, Abdulmanap, has been hospitalized due to a suspected pneumonia and flu.", "url": "https://www.bjpenn.com/mma-news/khabib-nurmagomedov/report-khabib-nurmagomedovs-father-hospitalized-due-to-suspected-pneumonia-and-flu/", "urlToImage": null, "publishedAt": "2020-04-25T19:51:35Z", "content": "The father of current UFC lightweight champion Khabib Nurmagomedov, Abdulmanap, has been hospitalized due to a suspected pneumonia and flu.\r\nThe news comes from Ramazan Rabadanov, a sports commentator from Dagestan, Russia.\r\nSharing a pic of himself with Abdu… [+1621 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Mark Douglas", "title": "'Everyone hopes for it': Jetro Willems sends a transfer message to Newcastle United - Chronicle Live", "description": "Newcastle United loanee Jetro Willems says he absolutely wants to return to the club where he enjoyed a decent temporary spell", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/everyone-hopes-it-jetro-willems-18150981", "urlToImage": null, "publishedAt": "2020-04-25T19:50:04Z", "content": "Jetro Willems has re-stated his number one priority is to sign and play for Newcastle United in an impromptu Twitter question and answer session.\r\nThe popular wing-back had made a fine impression at St James Park before a serious injury suffered at the turn o… [+1177 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Real Madrid eye 'dream' Neymar transfer after Barcelona told funding deal is 'impossible' - Mirror Online", "description": "Real Madrid supremo Florentino Perez still hopes of a dream move for Neymar despite Barcelona's interest in re-signing the forward", "url": "https://www.mirror.co.uk/sport/football/news/real-madrid-eye-dream-neymar-21926057", "urlToImage": null, "publishedAt": "2020-04-25T19:18:28Z", "content": "Real Madrid president Florentino Perez \"still dreams\" of signing PSG star Neymar after previously missing out on the Brazilian.\r\nLos Blancos chased Neymar back when he was at Santos before losing out to rivals Barcelona.\r\nBut the Parisians secured his signatu… [+1793 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Arsenal players will be allowed back to club's training ground next week - Metro.co.uk", "description": "This is a very positive sign.", "url": "https://metro.co.uk/2020/04/25/arsenal-players-will-allowed-back-clubs-training-ground-next-week-12610468/", "urlToImage": null, "publishedAt": "2020-04-25T18:42:12Z", "content": "Arsenals players will be allowed back to the clubs London Colney training ground from next week (Picture: Getty)\r\nArsenals players will be allowed to return to train at London Colney from next week while Aston Villas squad have agreed a 25 per cent wage defer… [+2524 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "Jofra Archer reveals he has lost his Cricket World Cup winner's medal - The Guardian", "description": "England paceman Jofra Archer revealed he has ‘gone mad’ searching for his World Cup winner’s medal after losing it during a recent house move", "url": "https://www.theguardian.com/sport/2020/apr/25/jofra-archer-reveals-he-has-lost-his-england-cricket-world-cup-winners-medal", "urlToImage": null, "publishedAt": "2020-04-25T18:41:53Z", "content": "England pace bowler Jofra Archer revealed he has gone mad searching for his Cricket World Cup winners medal after losing it during a recent house move. Archer rose from relative obscurity to become a household name at last years tournament, finishing as Engla… [+1949 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Joseph Chapman", "title": "Robert Earnshaw makes startling West Brom admission about that day at Charlton - Birmingham Live", "description": "Earnshaw was considering his future and after being informed by Bryan Robson that he’d been left out of the starting XI once again in London that day, it was a mindset that only intensified", "url": "https://www.birminghammail.co.uk/sport/football/football-news/robert-earnshaw-makes-startling-west-18150125", "urlToImage": null, "publishedAt": "2020-04-25T18:39:56Z", "content": "West Broms Great Escape hero Robert Earnshaw has revealed that he was actually thinking about leaving the club on the same day that he bagged an unforgettable hat-trick at Charlton Athletic.\r\n The former Albion striker was competing for a place in the startin… [+4514 chars]"}, {"source": {"id": null, "name": "Theguardian.comsport"}, "author": "Guardian staff reporter", "title": "NFL draft enters day three as 49ers acquire star tackle Trent Williams - The Guardian", "description": "The NFL draft entered its third and final day with Cincinnati selecting an Appalachian State linebacker on Saturday afternoon", "url": "https://amp.theguardian.comsport/2020/apr/25/nfl-draft-saturday-picks-day-three", "urlToImage": null, "publishedAt": "2020-04-25T18:34:00Z", "content": "Clunky at times, poignant at others, and exceptionally entertaining in spots, the NFL draft entered its third and final day with Cincinnati selecting an Appalachian State linebacker on Saturday.\r\nCommissioner Roger Goodell has insisted the sporting world need… [+2895 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Ieuan Ivett For Mailonline", "title": "Roy Keane reveals he didn't warm to Rooney and Ferdinand during their time together at Man United - Daily Mail", "description": "Roy Keane admitted that he never got on well with former Manchester United teammates Wayne Rooney or Rio Ferdinand as he never understood their 'banter'.", "url": "https://www.dailymail.co.uk/sport/football/article-8256779/Roy-Keane-reveals-didnt-warm-Rooney-Ferdinand-time-Man-United.html", "urlToImage": null, "publishedAt": "2020-04-25T18:15:59Z", "content": "Roy Keane has admitted that he never got on well with former Manchester United team-mates Wayne Rooney or Rio Ferdinand as he never understood their 'banter'.\r\nFormer United skipper Keane, who is well known for not pulling any punches, revealed he did not mis… [+2357 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Frederick Clayton", "title": "Sissoko, Lamela, Vertonghen: The Tottenham players Mauricio Pochettino could lure to Newcastle - Football.London", "description": "Pochettino has been touted to take the reigns at St James' Park, but which of his former Spurs players would he reacquaint himself with?", "url": "https://www.football.london/tottenham-hotspur-fc/transfer-news/tottenham-newcastle-takeover-pochettino-players-18138517", "urlToImage": null, "publishedAt": "2020-04-25T18:03:40Z", "content": "Newcastle are on the verge of a £300m takeover by a Saudi-backed consortium and an announcement is expected soon after an agreement was reached between Mike Ashley and PCP Capital Partners.\r\n And the Daily Mirror reports that Newcastles new owners want to bri… [+3878 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "FULL GAME: WEST HAM V EVERTON | 21 SEPTEMBER 2013 - Everton Football Club", "description": "Subscribe to Everton Football Club's official YouTube Channel: http://bit.ly/2wtCEbB Follow us on Facebook: http://facebook.com/everton Follow us on Twitter:...", "url": "https://www.youtube.com/watch?v=7U1emuqMqzE", "urlToImage": null, "publishedAt": "2020-04-25T18:00:14Z", "content": null}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Joe Rimmer", "title": "Luis Alberto masterstroke could make Liverpool millions this summer - Liverpool Echo", "description": "Luis Alberto's Liverpool departure may have gone under the radar - but a clause could result in Liverpool making millions", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-luis-alberto-transfer-clause-17881222", "urlToImage": null, "publishedAt": "2020-04-25T17:56:54Z", "content": "Michael Edwards doesn't do interviews. The Liverpool sporting director just doesn't want the headlines.\r\nNor does Edwards appear publicly, and anyone searching for a picture of him will only find a select few.\r\nYou won't find much about him on the club site, … [+3728 chars]"}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "Petec21", "title": "Raheem Sterling: There’s Only One Shirt I Want - Bitter and Blue", "description": "City Winger Wants Barca Legend Shirt", "url": "https://bitterandblue.sbnation.com/2020/4/25/21236328/raheem-sterling-theres-only-one-shirt-i-want", "urlToImage": null, "publishedAt": "2020-04-25T17:48:16Z", "content": "Manchester City winger Raheem Sterling has revealed the one shirt he wants to obtain from his playing days for his collections. Despite gathering a collection of medals, trophies and players shirts, Sterling has said the one he really wants is a shirt off the… [+1452 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "Seb Jenkins", "title": "Report: Tottenham 'ramp up bid' to sign 21-year-old Premier League playmaker - The Spurs Web", "description": "Football Insider have now reported that Tottenham Hotspur are ramping up their bid to sign Norwich City playmaker, Todd Cantwell, this summer. The 21-year-old attacker caught the eye in his first Premier League season this year as he recorded six goals across…", "url": "https://www.spurs-web.com/spurs-news/report-tottenham-ramp-up-bid-to-sign-21-year-old-premier-league-playmaker/", "urlToImage": null, "publishedAt": "2020-04-25T17:43:13Z", "content": "Football Insider have now reported that Tottenham Hotspur are ramping up their bid to sign Norwich City playmaker, Todd Cantwell, this summer.\r\nThe 21-year-old attacker caught the eye in his first Premier League season this year as he recorded six goals acros… [+790 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Alec Fenn For Mailonline", "title": "PSG 'table bid for Paul Pogba and offer flop Angel Di Maria AND Julian Draxler' to Manchester United - Daily Mail", "description": "Pogba's future at United is uncertain after he revealed his desire to leave the club last summer and continued links with other European sides, as well as a lengthy absence with a mysterious ankle injury.", "url": "https://www.dailymail.co.uk/sport/football/article-8256663/PSG-table-bid-Paul-Pogba-offer-flop-Angel-Di-Maria-Julian-Draxler-Manchester-United.html", "urlToImage": null, "publishedAt": "2020-04-25T17:31:26Z", "content": "Paris Saint-Germain have reportedly made a bid for Manchester United's Paul Pogba but surprisingly offered Old Trafford flop Angel Di Maria as part of the deal.\r\nPogba's future at United is uncertain after he revealed his desire to leave the club last summer … [+2058 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "ePL Invitational: Diogo Jota crowned FIFA king after golden goal victory over Trent Alexander-Arnold - Sky Sports", "description": "Diogo Jota is the inaugural ePremier League Invitational champion after a golden goal win over Liverpool's Trent Alexander-Arnold.", "url": "https://www.skysports.com/football/news/11095/11978772/epl-invitational-diogo-jota-crowned-fifa-king-after-golden-goal-victory-over-trent-alexander-arnold", "urlToImage": null, "publishedAt": "2020-04-25T17:09:07Z", "content": "Diogo Jota is the inaugural ePremier League Invitational champion after a golden goal win over Liverpool's Trent Alexander-Arnold.\r\nFresh from beating Raheem Sterling with a golden goal himself in the semi-finals, Alexander-Arnold took the lead in the final w… [+728 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nDaniel Schofield,", "title": "Doubts grow over Agustin Pichot's plan for World Rugby revolution - Telegraph.co.uk", "description": "Campaign reveals contradictions in the former Argentina scrum-half's manifesto to replace Sir Bill Beaumont", "url": "https://www.telegraph.co.uk/rugby-union/2020/04/25/doubts-grow-agustin-pichots-plan-world-rugby-revolution/", "urlToImage": null, "publishedAt": "2020-04-25T16:55:00Z", "content": "Agustin Pichot likes to project himself as a white knight coming to rescue rugby in the moment of its greatest crisis.\r\nFrom announcing his candidacy for World Rugby chairman at the last minute, Pichot now has momentum firmly on his side in the race against i… [+1967 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Ian Doyle", "title": "Bobby Duncan, major setbacks and what happened next for Liverpool FA Youth Cup winners - Liverpool Echo", "description": "Exactly one year has passed since Liverpool lifted the FA Youth Cup against Manchester City", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/pep-lijnders-impressed-breakout-star-18143544", "urlToImage": null, "publishedAt": "2020-04-25T16:43:34Z", "content": "Champions League glory was more than a month away, but already Liverpool could celebrate claiming prestigious silverware.\r\nExactly a year has passed since the Reds claimed the FA Youth Cup for only the fourth time in their history.\r\nUnder the tutelage of coac… [+4773 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ashley Preece", "title": "Jack Grealish pokes fun at Birmingham City with blunt three-word message - Birmingham Live", "description": "Aston Villa on social media - Jack Grealish is Villa through and through and sarcastically had a dig at Birmingham City following a nostalgic video of James Milner's match-winning penalty 10 years ago", "url": "https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-jack-grealish-blues-18150166", "urlToImage": null, "publishedAt": "2020-04-25T16:40:16Z", "content": "Jack Grealish has claret and blue veins and, 10 years on from Aston Villa's 1-0 win over Blues, the skipper couldn't resist a pop at those across the Second City divide.\r\nJames Milner slammed home a controversial penalty in the 83rd minute after Gabby Agbonla… [+1059 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Ray Parlour slams Arsenal leadership in passionate defence of Mesut Ozil - Mirror Online", "description": "Ozil is one of three Arsenal players to reject pay cut proposals put forward by the board but Parlour believes the star has been unnecessarily made a scapegoat as a result", "url": "https://www.mirror.co.uk/sport/football/news/ray-parlour-slams-arsenal-leadership-21924954", "urlToImage": null, "publishedAt": "2020-04-25T16:30:35Z", "content": "Ray Parlour has leapt to the defence of Mesut Ozil and criticised the lack of leadership at Arsenal amid the recent disagreement regarding player pay cuts. \r\n Ozil is one of three Arsenal stars to decide against taking a deduction in their salary despite the … [+2410 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Marcus Banks", "title": "Kleberson pinpoints how Fred transformed his Manchester United career - Manchester Evening News", "description": "Former Manchester United midfielder Kleberson is pleased to see Fred bounce back from a difficult start in England.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/fred-kleberson-man-utd-news-18150347", "urlToImage": null, "publishedAt": "2020-04-25T15:25:25Z", "content": "Former Manchester United player Kleberson believes Fred is thriving after adapting to a new defensive role under Ole Gunnar Solskjaer.\r\nFredendured a dismal start to his United career after joining from Shakhtar Donetsk in the summer of 2018 and looked set to… [+1976 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Elliott Jackson", "title": "Dimitar Berbatov sends transfer warning to Newcastle with Man City comparison - Manchester Evening News", "description": "The former Manchester United striker has had his say on Newcastle's potential takeover.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/berbatov-newcastle-manchester-city-takeover-18147091", "urlToImage": null, "publishedAt": "2020-04-25T14:36:51Z", "content": "Dimitar Berbatov has insisted it will take time for Newcastle United to attract top players to the club.\r\nNewcastle are in talks over a potential Saudi Arabia-backed takeover. Manchester City, of course, were subject to a takeover of their own in 2008 which d… [+1174 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Elliott Jackson", "title": "What Jurgen Klopp said to Liverpool before historic Barcelona comeback - Liverpool Echo", "description": "The Reds beat Barcelona 4-0 to reach the Champions League final", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/klopp-liverpool-talk-barcelona-comeback-18148913", "urlToImage": null, "publishedAt": "2020-04-25T14:08:58Z", "content": "James Milner has revealed what Jurgen Klopp said to his players in training before their unforgettable comeback against Barcelona in the Champions League. \r\nThe Reds remarkably beat the Spanish giants 4-0 at Anfield in the second leg of their Championship Lea… [+1744 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Philippe Coutinho snubbed by Liverpool after contacting club over potential transfer - Mirror Online", "description": "Philippe Coutinho is deemed surplus to requirements at Barcelona but is not wanted by former club Liverpool despite his best efforts", "url": "https://www.mirror.co.uk/sport/football/transfer-news/philippe-coutinho-snubbed-liverpool-after-21925640", "urlToImage": null, "publishedAt": "2020-04-25T13:43:28Z", "content": "Liverpool told Philippe Coutinho they were not interest in re-signing him when he discussed a potential return.\r\n The Brazilian is on loan at Bayern Munich from Barcelona but the German side are not interested in making the move permanent. \r\nCoutinho has stru… [+1485 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Liverpool vs Atletico Madrid under investigation following coronavirus outbreak - Irish Mirror", "description": "Liverpool's Champions League exit to Atletico Madrid is one of the last games to be played amid the coronavirus pandemic and has come in for plenty of criticism", "url": "https://www.mirror.co.uk/sport/football/news/liverpool-vs-atletico-madrid-under-21925450", "urlToImage": null, "publishedAt": "2020-04-25T13:42:35Z", "content": "Liverpool's Champions League match with Atletico Madrid is under investigation regarding its impact on the spread of coronavirus. \r\nThe last 16 clash took place on March 11 - the same day the World Health Organisation declared Covid-19 a global pandemic.\r\nSpa… [+1612 chars]"}, {"source": {"id": null, "name": "Dartsnews.com"}, "author": null, "title": "PDC issue statement regarding cheating allegations surrounding Klaasen in Home Tour - Dartsnews.com", "description": "Jelle Klaasen claimed Group Seven in the PDC Home Tour on Thursday night but cheating allegations were levelled at the former Lakeside champion", "url": "https://dartsnews.com/pdc-issue-statement-regarding-cheating-allegations-surrounding-klaasen-in-home-tour/", "urlToImage": null, "publishedAt": "2020-04-25T13:13:28Z", "content": "Jelle Klaasen claimed Group Seven in the PDC Home Tour on Thursday night but cheating allegations were levelled at the former Lakeside champion; regarding a 70 checkout during his match against Gabriel Clemens.\r\nDarts fans took to social media to say that the… [+906 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Dani Ceballos shares Zinedine Zidane message on future amid Arsenal transfer talk - Mirror Online", "description": "Arsenal are believed to be keen on signing Real Madrid midfielder permanently following loan spell, but Ceballos has revealed Zidane conversation which could decide his future", "url": "https://www.mirror.co.uk/sport/football/transfer-news/dani-ceballos-shares-zinedine-zidane-21924432", "urlToImage": null, "publishedAt": "2020-04-25T12:57:55Z", "content": "Dani Ceballos has shared a message from Zinedine Zidane about his Real Madrid future amid speculation Arsenal will bid to sign him permanently. \r\nCeballos has spent the season on loan with the Gunners from Madrid, and Arsenal are believed to be keen on signin… [+1801 chars]"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Daniel Marland", "title": "Cristiano Ronaldo Rejoining Man Utd This Summer ‘Would Not Be A Surprise’ - SPORTbible", "description": "This would be one of the biggest transfer stories of all time.", "url": "https://www.sportbible.com/football/football-news-transfers-ronaldo-rejoining-man-utd-this-summer-would-not-be-a-surprise-20200425", "urlToImage": null, "publishedAt": "2020-04-25T12:07:11Z", "content": "Manchester United completing the shock re-signing of Cristiano Ronaldo this summer 'would not be a surprise' according says to a top European club chief.\r\nThe 35-year-old has been linked with a move away from current club Juventus due to their current financi… [+2326 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Report: Spurs could suffer major financial blow after UEFA decision - The Spurs Web", "description": "Tottenham Hotspur could be set to suffer a major financial blow in revenue generated from European football if the season is decided on a points-per-game basis, the Evening Standard report. It was revealed on Thursday that UEFA were considering using a points…", "url": "https://www.spurs-web.com/spurs-news/report-spurs-could-suffer-major-financial-blow-after-uefa-decision/", "urlToImage": null, "publishedAt": "2020-04-25T11:00:00Z", "content": "Tottenham Hotspur could be set to suffer a major financial blow in revenue generated from European football if the season is decided on a points-per-game basis, the Evening Standard report.\r\nIt was revealed on Thursday that UEFA were considering using a point… [+1358 chars]"}, {"source": {"id": null, "name": "Autosport.com"}, "author": "Pablo Elizalde", "title": "F1 News: Sainz Jr says losing 2020 season over coronavirus would be hard to accept - Autosport", "description": "McLaren driver Carlos Sainz Jr says the 2020 Formula 1 season being cancelled because of the coronavirus crisis would be a \"hard blow that would be difficult to accept\"", "url": "https://www.autosport.com/f1/news/149146/sainz-losing-20-f1-season-would-be-hard-to-accept", "urlToImage": null, "publishedAt": "2020-04-25T10:02:44Z", "content": "McLaren driver Carlos Sainz Jr says the 2020 Formula 1 season being cancelled because of the coronavirus crisis would be a \"hard blow that would be difficult to accept\". \r\nThe first nine races of the season have already been cancelled or postponed, with the F… [+2679 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Every Goal of LFC's 98/99 Season | Berger's unstoppable strikes - Liverpool FC", "description": "Michael Owen would be in scintillating form throughout the 98/99 season notching 18 Premier League goals in the process with strike partner Robbie Fowler hit...", "url": "https://www.youtube.com/watch?v=Td0c_imaZ_U", "urlToImage": null, "publishedAt": "2020-04-25T10:00:27Z", "content": null}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "NFL Draft 2020: Teams set wide receiver record on Day Two - Sky Sports", "description": "Wide receivers flew off the board on a busy Day Two of the 2020 NFL Draft.", "url": "https://www.skysports.com/nfl/news/12118/11978575/nfl-draft-2020-teams-set-wide-receiver-record-on-day-two", "urlToImage": null, "publishedAt": "2020-04-25T09:58:40Z", "content": "Teams continued to dip into the 2020 NFL Draft's deep receiver class on Friday, with the Cincinnati Bengals kicking off the run at the top of Round Two by grabbing Clemson wideout Tee Higgins.\r\nAfter six wideouts went in Round One, Round Two began with two in… [+4635 chars]"}, {"source": {"id": null, "name": "Justarsenal.com"}, "author": "Admin Pat", "title": "The Dutch FA cancel the League (without naming a Champion) and expect more to follow - Just Arsenal News", "description": "Just Arsenal News, Transfer Rumours And Discussion about all matters relating to Arsenal Football Club", "url": "https://www.justarsenal.com/the-dutch-fa-cancel-the-league-without-naming-a-champion-and-expect-more-to-follow/242859", "urlToImage": null, "publishedAt": "2020-04-25T09:54:17Z", "content": "The Dutch FA has become the second European League to cancel the remaining games, but with the new guidelines from UEFA, they have decide not to name any club as Champions.\r\nBelgium announced Bruges as Champions but they were only one game from the end of the… [+2326 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "London Marathon: Back-garden runners prepare for 2.6 Challenge - BBC Sport", "description": "The London Marathon might be postponed but runners are still getting in the miles and raising money for charity - here are some of their inspiring stories.", "url": "https://www.bbc.co.uk/sport/athletics/52418660", "urlToImage": null, "publishedAt": "2020-04-25T09:51:00Z", "content": "Sunday was supposed to be the culmination of more than a million training miles and the collection of many millions more for good causes around the country and world.\r\nFor some, despite the London Marathons postponement until October, it still will be.\r\nThe 2… [+8354 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "When Yuvraj smashed Broad for six sixes in a row - BBC News", "description": "Relive the moment when Yuvraj Singh became the first player in Twenty20 history to hit six sixes in an over.", "url": "https://www.bbc.co.uk/sport/av/cricket/52397653", "urlToImage": null, "publishedAt": "2020-04-25T07:57:37Z", "content": null}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "NFL Draft: Tee Higgins joins Joe Burrow at Cincinnati Bengals - Sky Sports", "description": "The Cincinnati Bengals followed up their first-round pick of Joe Burrow by selecting Tee Higgins, who has declared the duo are \"about to tear it up\".", "url": "https://www.skysports.com/nfl/news/12118/11978531/nfl-draft-tee-higgins-joins-joe-burrow-at-cincinnati-bengals", "urlToImage": null, "publishedAt": "2020-04-25T07:29:15Z", "content": "The Cincinnati Bengals followed up their first-round pick of quarterback Joe Burrow by selecting wide receiver Tee Higgins, who has declared the duo are \"about to tear it up\" in the NFL.\r\nThe Bengals picked Clemson's Higgins - who grew up supporting the side … [+1441 chars]"}, {"source": {"id": null, "name": "Paisleygates.com"}, "author": "ThemeGrill", "title": "£120000-a-week star in encouraging talks to secure Liverpool move – Report - Paisley Gates", "description": "If reports in Spain are anything to go by then Liverpool are interested in hiring the services of Chelsea star Willian in the summer. According to Sport (via Sport Witness), the Brazilian internati…", "url": "https://paisleygates.com/archives/37352", "urlToImage": null, "publishedAt": "2020-04-25T06:30:00Z", "content": "If reports in Spain are anything to go by then Liverpool are interested in hiring the services of Chelsea star Willian in the summer.\r\nAccording to Sport (via Sport Witness), the Brazilian international is in encouraging talks to secure a free transfer to Liv… [+1782 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Reubyn Coutinho", "title": "“The Winner Will Fight Khabib For the Title”- Dana White makes a huge statement - Essentially Sports", "description": "UFC President Dana White made a huge statement regarding UFC Lightweight division. He said the winner of Ferguson-Gaethje will fight Khabib for the title.", "url": "https://www.essentiallysports.com/ufc-news-the-winner-will-fight-khabib-for-the-title-dana-white-makes-a-huge-statement-tony-ferguson-justin-gaethje/", "urlToImage": null, "publishedAt": "2020-04-25T05:00:00Z", "content": "UFC 249 finally has a new venue. The event will take place at VyStar Veterans Memorial Arena in Jacksonville, Florida. The UFC pounced on a chance to hold their events in the Sunshine State as sports activities were deemed essential businesses. Dana White app… [+1819 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Guardian sport", "title": "Philadelphia Eagles surprise with Jalen Hurts pick on day two of NFL draft - The Guardian", "description": "The Eagles selected Oklahoma quarterback Jalen Hurts in the second round of the NFL draft on Friday, a stunning move for a team with more pressing needs", "url": "https://www.theguardian.com/sport/2020/apr/25/nfl-draft-picks-day-two-jalen-hurts", "urlToImage": null, "publishedAt": "2020-04-25T04:20:00Z", "content": "After giving Carson Wentz a playmaker, the Philadelphia Eagles drafted his backup.\r\nThe Eagles selected Oklahoma quarterback Jalen Hurts in the second round of the NFL draft on Friday night, a stunning move for a team with more pressing needs.\r\nPhiladelphia h… [+10012 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "George Dobell", "title": "UK government hands ECB lead on viability of 'bio-secure' sport | ESPNcricinfo.com - ESPNcricinfo", "description": "England will play at as few grounds as possible if cricket goes behind closed doors, says ECB CEO | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29094232/uk-government-hands-ecb-lead-viability-bio-secure-sport", "urlToImage": null, "publishedAt": "2020-04-25T02:19:30Z", "content": "The ECB has been asked by the UK government to lead the way into investigating the viability of playing sport in a bio-secure environment.\r\nWith an increasing acceptance that the best chance of fulfilling the broadcast deals that keep nearly all sport afloat … [+8018 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "England's Joe Marler to complete 10-week ban during coronavirus shutdown - Sky Sports", "description": "England prop Joe Marler will complete his 10-week ban from rugby without missing a match due to the coronavirus shutdown.", "url": "https://www.skysports.com/rugby-union/news/12504/11978488/englands-joe-marler-to-complete-10-week-ban-during-coronavirus-shutdown", "urlToImage": null, "publishedAt": "2020-04-24T21:30:40Z", "content": "England prop Joe Marler will complete his 10-week ban from rugby without missing a match due to the coronavirus shutdown.\r\nMarler was handed the suspension on March 12 after being found guilty of grabbing Wales captain Alun Wyn Jones by the genitals during En… [+640 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Alex Raskin Sports News Editor For Dailymail.com Associated Press", "title": "Video shows Bucs rookie and Tom Brady's newest blocker Tristan Wirfs jumping out of pool - Daily Mail", "description": "Tampa Bay Buccaneers first-round pick Tristan Wirfs weighs well over 300 pounds, but the offensive tackle and Tom Brady's newest blocker is still athletic enough to jump out of a pool onto his feet.", "url": "https://www.dailymail.co.uk/news/article-8254551/Video-shows-Bucs-rookie-Tom-Bradys-newest-blocker-Tristan-Wirfs-jumping-pool.html", "urlToImage": null, "publishedAt": "2020-04-24T20:51:27Z", "content": "The Buccaneers drafted Tristan Wirfs to address an opening at right tackle \r\nTampa Bay Buccaneers first-round pick Tristan Wirfs weighs well over 300 pounds, but the offensive tackle and Tom Brady's newest blocker is still athletic enough to launch himself ou… [+3438 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Jamie Carragher confirms wife tested positive for coronavirus in second family diagnosis - Mirror Online", "description": "Former Liverpool defender Carragher made the announcement when discussing how the football season in the UK can be resumed safely amid the current pandemic", "url": "https://www.mirror.co.uk/sport/football/news/jamie-carragher-confirms-wife-coronavirus-21921317", "urlToImage": null, "publishedAt": "2020-04-24T19:59:48Z", "content": "Jamie Carragher has revealed his wife Nicola has tested positive for coronavirus, becoming the second person in his family to contract the illness. \r\n The former Liverpool defender turned Sky Sports pundit also explained that his aunt had been receiving treat… [+2284 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Is Jamie Carragher RIGHT?! Fernando Torres' flabbergasting move from Liverpool to Chelsea | ESPN FC - ESPN UK", "description": "Craig Burley and Julien Laurens join Dan Thomas on ESPN FC to react to recent comments made by former Liverpool defender Jamie Carragher and former Chelsea c...", "url": "https://www.youtube.com/watch?v=hoRBD5aVqVk", "urlToImage": null, "publishedAt": "2020-04-24T19:51:55Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Suzanne Wrack", "title": "Who could replace Phil Neville as England Women's manager? - The Guardian", "description": "We run the rule over leading candidates, including a two-times World Cup winner and a woman who worked as Neville’s No 2", "url": "https://www.theguardian.com/football/2020/apr/24/who-could-replace-phil-neville-as-england-womens-manager", "urlToImage": null, "publishedAt": "2020-04-24T18:00:00Z", "content": "The Football Associations hunt for a successor to Mark Sampson in 2017 quickly became a circus. Names flew out of the ring as fast as they stepped in. Increased scrutiny on the person in charge, with the game professionalising, led some of those on the shortl… [+4734 chars]"}, {"source": {"id": null, "name": "Derbytelegraph.co.uk"}, "author": "Chris Watson", "title": "Derby County favourite has contract terminated by Championship club - Derbyshire Live", "description": "The former Rams midfielder and coach had been part of Graeme Jones' backroom staff at Luton Town", "url": "https://www.derbytelegraph.co.uk/sport/football/football-news/inigo-idiakez-derby-luton-harford-4076842", "urlToImage": null, "publishedAt": "2020-04-24T15:19:00Z", "content": "Derby County favourite Inigo Idiakez has lost his job at Sky Bet Championship club Luton Town.\r\nIdiakez had been first-team coach at Kenilworth Road but has had his contract terminated with immediate effect, along with manager Graeme Jones, assistant boss Gar… [+2928 chars]"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Daniel Marland", "title": "Mike Tyson Reveals He Is Training For A Surprise Return To Boxing - SPORTbible", "description": "'Iron Mike' is stepping back into the ring and boxing fans should be excited.", "url": "https://www.sportbible.com/boxing/boxing-news-legends-mike-tyson-reveals-he-is-training-for-surprise-return-to-boxing-20200424", "urlToImage": null, "publishedAt": "2020-04-24T15:09:27Z", "content": "Mike Tyson has revealed he is training for a sensational return to boxing and plans to take part in four round exhibition fights for charity.\r\n'Iron Mike' fell to defeat against Kevin McBride back in 2005 which proved to be the final professional fight of his… [+1694 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Mark Wakefield", "title": "Adama Traore agent makes transfer admission amid Liverpool links - Liverpool Echo", "description": "Jurgen Klopp's Liverpool have been linked with a summer move for Adama Traore and his agent has spoken out", "url": "https://www.liverpoolecho.co.uk/sport/football/transfer-news/adama-traore-agent-makes-transfer-18142069", "urlToImage": null, "publishedAt": "2020-04-24T14:59:41Z", "content": "Adama Traore's agent has addressed the future of his client and indicated he still believes there could be a \"market\" for him this summer.\r\n Liverpool and other top teams have been tentatively linked with a move for the Wolverhampton Wanderers winger, with Fo… [+1717 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Shane Ireland", "title": "Manchester United sent stunning message over '£130m' Wolves transfer - Birmingham Live", "description": "Wolves transfer news includes pundit's message to Raul Jimenez suitors as Man Utd and Real Madrid linked", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/raul-jimenez-man-utd-wolves-18142364", "urlToImage": null, "publishedAt": "2020-04-24T14:25:53Z", "content": "Wolverhampton Wanderers striker Raul Jimenez would cost suitors well over £100million, according to former Premier League defender Alex Bruce.\r\nJimenez's form has been one of the many highlights of a terrific campaign for Wolves, who are sixth in the table an… [+1600 chars]"}, {"source": {"id": null, "name": "Yorkshirepost.co.uk"}, "author": "Jordan Cronin", "title": "Exclusive: The date EFL fans could be let back into their club's ground as EFL consider options - Yorkshire Post", "description": "Fans of EFL clubs won’t be allowed into their respective stadiums until October under current EFL plans.", "url": "https://www.yorkshirepost.co.uk/sport/football/leeds-united/exclusive-date-efl-fans-could-be-let-back-their-clubs-ground-efl-consider-options-2548946", "urlToImage": null, "publishedAt": "2020-04-24T12:39:10Z", "content": "Fans of EFL clubs wont be allowed into their respective stadiums until October under current EFL plans.\r\nExclusive: The date Championshipfans will be let back into their club's stadiumas EFL plan fixtures Copyright: Getty\r\nThe Yorkshire Post understands that … [+1848 chars]"}]}