{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Daniel Hammond", "title": "Everton ‘appalled’ at flop Moise Kean hosting a ‘wild’ lockdown party that had lapdancing and went on until ea - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11482019/moise-kean-party-lockdown-lapdancing/", "urlToImage": null, "publishedAt": "2020-04-26T14:46:46Z", "content": "FOOTIE Covidiot Moise Kean has thrown a raunchy party at home in lockdown, it has emerged.\r\nThe Everton player, 20, who is thought to earn £50,000 a week, filmed himself at the bash in his Cheshire apartment.\r\nEverton flop Moise Kean has been blasted by his c… [+1709 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "David McDonnell", "title": "David De Gea drops hint over his long-term Man Utd future - Mirror Online", "description": "The Manchester United keeper is contracted to the Red Devils until 2023", "url": "https://www.mirror.co.uk/sport/football/news/david-de-gea-drops-hint-21928499", "urlToImage": null, "publishedAt": "2020-04-26T14:44:57Z", "content": "David De Gea has reaffirmed his commitment to Manchester United and given the clearest hint he wants to finish his career at Old Trafford.\r\nDe Gea has endured a difficult campaign, with some high-profile mistakes, but has retained the full support of United b… [+1971 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Chelsea made Neymar transfer offer, confirms agent Wagner Ribeiro - Mirror Online", "description": "Neymar was once the hottest property in world football and attracted interest from several of Europe's elite clubs before moving to Barcelona, but not before a failed approach from Chelsea", "url": "https://www.mirror.co.uk/sport/football/news/chelsea-made-neymar-transfer-offer-21928879", "urlToImage": null, "publishedAt": "2020-04-26T14:41:27Z", "content": "Neymar's former agent Wagner Ribeiro has confirmed Chelsea once made a serious offer to sign the Brazilian superstar. \r\n The PSG forward has had no shortage of admirers throughout his career, and it was back when he was learning his trade at Santos that Chels… [+1917 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Burnley fans are all making the same point about Aston Villa and Sean Dyche - Birmingham Live", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiZWh0dHBzOi8vd3d3LmJpcm1pbmdoYW1tYWlsLmNvLnVrL3Nwb3J0L2Zvb3RiYWxsL2Zvb3RiYWxsLW5ld3MvYnVybmxleS1mYW5zLW1ha2luZy1zYW1lLXBvaW50LTE4MTUyNDE10gFpaHR0cHM6Ly93d3cuYmlybWluZ2hhbW1haWwuY28udWsvc3BvcnQvZm9vdGJhbGwvZm9vdGJhbGwtbmV3cy9idXJubGV5LWZhbnMtbWFraW5nLXNhbWUtcG9pbnQtMTgxNTI0MTUuYW1w?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T14:37:02Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Adam Shergold for MailOnline", "title": "The good, bad and ugly of the Premier League's foreign owners after Newcastle takeover - Daily Mail", "description": "Newcastle United's ambitions may be about to be transformed by their £300m Saudi takeover. But there are plenty of cautionary tales from previous foreign owners in the Premier League.", "url": "https://www.dailymail.co.uk/sport/football/article-8249801/The-good-bad-ugly-Premier-Leagues-foreign-owners-Newcastle-takeover.html", "urlToImage": null, "publishedAt": "2020-04-26T14:36:28Z", "content": "Newcastle United are on the verge of a £300million takeover by a consortium backed by money from Saudi Arabia's sovereign wealth fund.\r\nIf the deal is completed, Newcastle would pass from the hands of retail tycoon Mike Ashley to the control of Saudi Crown Pr… [+15641 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Scott Brown: Celtic captain says title won't be diminished if season called early - BBC News", "description": "Celtic's record-equalling ninth title in a row would not be a lesser achievement if it is secured by default, says captain Scott Brown.", "url": "https://www.bbc.co.uk/sport/football/52432407", "urlToImage": null, "publishedAt": "2020-04-26T14:01:10Z", "content": "Celtic's League Cup success in December was their 10th consecutive trophy in domestic football\r\nCeltic's record-equalling ninth title in a row would not be a lesser achievement if the season is called early, says captain Scott Brown.\r\nNeil Lennon's side were … [+2430 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Gabriel Baumgaertner", "title": "NFL draft winners and losers: Ravens' wisdom to the new Aaron Rodgers - The Guardian", "description": "This year’s event was a welcome tonic to fans deprived of live sports. But not every team covered themselves in glory over the weekend", "url": "https://www.theguardian.com/sport/2020/apr/26/nfl-draft-winners-and-losers-ravens-wisdom-to-the-new-aaron-rodgers", "urlToImage": null, "publishedAt": "2020-04-26T13:27:00Z", "content": "The 2020 NFL draft wasnt quite a live sporting event, but it was enough to distract fans from the global pandemic that has kept major leagues indefinitely suspended. Here are the teams that we think did the best and worst jobs of improving their future.\r\nWinn… [+6707 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Sunday Supplement: Voiding the season would be surrender, says Henry Winter - Sky Sports", "description": "Henry Winter says voiding the current campaign \"would be a surrender\" as the Supplement panel debated football's restart.", "url": "https://www.skysports.com/football/news/11095/11979020/sunday-supplement-voiding-the-season-would-be-surrender-says-henry-winter", "urlToImage": null, "publishedAt": "2020-04-26T13:03:20Z", "content": "Henry Winter says voiding the current campaign in England \"would be a surrender\" as the Sunday Supplement panel debated the future of the season.\r\nThe Sky Sports show returned at the weekend with chief football writer at The Times, Winter, chief sports writer… [+9913 chars]"}, {"source": {"id": null, "name": "Football365.com"}, "author": "Joe Williams", "title": "Neville explains why Sancho is 'nowhere near' Man Utd flop - Football365.com", "description": "Football365 - Gary Neville has warned that Jadon Sancho is still \"nowhere near\" a player who flopped during his time at Man Utd.", "url": "https://www.football365.com/news/gary-neville-jadon-sancho-angel-di-maria-man-utd-flop", "urlToImage": null, "publishedAt": "2020-04-26T12:56:37Z", "content": "Gary Neville has warned that Jadon Sancho is still “nowhere near” Angel di Maria, who only lasted a year at Man Utd before being shipped out.\r\nAt just 20 years of age, Sancho has become one of European footballs hottest properties since his departure to the B… [+2269 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Jake Polden", "title": "Liverpool boss Jurgen Klopp had two reasons for contacting Kylian Mbappe's dad - Mirror Online", "description": "Liverpool's Sadio Mane has been linked with a £150m transfer to Real Madrid in recent weeks, and the Reds are reportedly looking at Kylian Mbappe as a replacement", "url": "https://www.mirror.co.uk/sport/football/news/liverpool-boss-jurgen-klopp-two-21928577", "urlToImage": null, "publishedAt": "2020-04-26T12:43:52Z", "content": "Jurgen Klopp reportedly called Kylian Mbappe's dad as speculation grows Liverpool are keen on signing the Frenchman. \r\n Liverpool's Sadio Mane has been linked with a £150million transfer to Real Madrid in recent weeks, after Zinedine Zidane allegedly made the… [+1590 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Lewis Winter", "title": "Arsenal slammed for being 'selfish' and 'greedy' by allowing players to return to training - Express", "description": "Arsenal players are set to return to training in the coming days.", "url": "https://www.express.co.uk/sport/football/1274029/Arsenal-news-training-ground-return-coronavirus", "urlToImage": null, "publishedAt": "2020-04-26T12:32:58Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Tumaini Carayol", "title": "Kyla Ross: 'In college, I was more nervous to train than compete' - The Guardian", "description": "The gymnast, a US Olympic gold medallist and last person to beat Simone Biles, has seen her last year of competition come to abrupt close", "url": "https://www.theguardian.com/sport/2020/apr/26/kyla-ross-college-more-nervous-to-train-than-compete-us-gymnastics-coronavirus", "urlToImage": null, "publishedAt": "2020-04-26T12:26:00Z", "content": "For most of the past 20 years, gymnastics is the only thing that Kyla Ross has known. She was doing handstands by four years old, she was an Olympic gold medallist by 15 and this year at 23 she was finishing an exceptional college gymnastics career at UCLA. T… [+6460 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Gary Neville explains why he hated rooming with David Beckham - Mirror Online", "description": "The duo were teammates for Man Utd and England for the best part of two decades having come through the youth ranks together, but were not an ideal match as roommates", "url": "https://www.mirror.co.uk/sport/football/news/gary-neville-explains-hated-rooming-21928697", "urlToImage": null, "publishedAt": "2020-04-26T12:16:00Z", "content": "Gary Neville has admitted he used to hate rooming with David Beckham on Man Utd away trips. \r\nThe pair spent 11 years together in United's senior side after graduating from the club's academy.\r\nAt the time of their breakthrough into the first-team, United wou… [+1869 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Richard Fay", "title": "Rafael blames Manchester United transfer strategy for club failings - Manchester Evening News", "description": "Man Utd have not won the Premier League title in seven years since Sir Alex Ferguson retired.", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/man-utd-transfer-news-rafael-18152569", "urlToImage": null, "publishedAt": "2020-04-26T12:11:37Z", "content": "Rafael da Silva believes Manchester United's flawed transfer strategy has been to blame for seven years without winning the Premier League.\r\nThe former United full-back was part of the last team which won the English top-flight under Sir Alex Ferguson during … [+1135 chars]"}, {"source": {"id": null, "name": "Coventrytelegraph.net"}, "author": "Jordan Blackwell", "title": "Coventry's Championship bid could be decided by mini-tournament as EFL release new statement - Coventry Telegraph", "description": "The latest Coventry City headlines,", "url": "https://www.coventrytelegraph.net/sport/football/football-news/coventrys-championship-bid-could-decided-18151874", "urlToImage": null, "publishedAt": "2020-04-26T11:55:28Z", "content": "Mini-tournament to decide promotion proposed\r\nCoventry Citys season could be concluded with a mini-tournament between League Ones top eight clubs.\r\nWhile the EFL aim to finish the campaign with the remaining fixtures played as normal, contingency plans have b… [+3581 chars]"}, {"source": {"id": null, "name": "Thescottishsun.co.uk"}, "author": "David Irvine", "title": "Julian Faubert says he left Rangers ‘high and dry’ in dramatic transfer U-turn after toilet negotiations with - The Scottish Sun", "description": "", "url": "http://www.thescottishsun.co.uk/sport/football/5532491/julian-faubert-rangers-transfer-u-turn-west-ham/", "urlToImage": null, "publishedAt": "2020-04-26T11:38:52Z", "content": "JULIAN FAUBERT has revealed he left Rangers 'high and dry' in a dramatic transfer U-turn after toilet negotiations with his agent.\r\nThe full-back was deep into talks with the Light Blues in 2007 and was set to pen a deal at Ibrox before a bathroom break resul… [+1560 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Alan Pardew: Den Haag manager rubbishes bonus payment claims - BBC Sport", "description": "Alan Pardew says he will not take a bonus payment for keeping Den Haag up after the Dutch Eredivisie is abandoned.", "url": "https://www.bbc.co.uk/sport/football/52431031", "urlToImage": null, "publishedAt": "2020-04-26T11:21:09Z", "content": "Pardew took charge of ADO Den Haag in December\r\nAlan Pardew says reports stating he will receive a bonus payment for avoiding relegation with Den Haag are \"nonsense\".\r\nThe Dutch Eredivisie season was abandoned on Friday because of coronavirus with no sides re… [+2014 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": null, "title": "Former Man Utd star Ben Foster names Red Devils legend as 'the best player I've ever seen' - Express", "description": "Manchester United great Paul Scholes receives huge praise from one of his former team-mates.", "url": "https://www.express.co.uk/sport/football/1274001/Man-Utd-news-Paul-Scholes-Ben-Foster-Manchester-United", "urlToImage": null, "publishedAt": "2020-04-26T10:53:21Z", "content": null}, {"source": {"id": null, "name": "Sky.com"}, "author": "Isobel Frodsham, news reporter", "title": "Coronavirus: London Marathon runners undertake 2.6 Challenge to help charities - Sky News", "description": "With the London Marathon cancelled amid the coronavirus background, many are taking in part in the 2.6 Challenge instead.", "url": "https://news.sky.com/story/coronavirus-london-marathon-runners-undertake-2-6-challenge-to-help-charities-11978979", "urlToImage": null, "publishedAt": "2020-04-26T10:51:05Z", "content": null}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Jonathan McFarlane", "title": "Rangers coach Michael Beale describes Celtic cup final as most one-sided 'maybe in history' - Daily Record", "description": "The former Liverpool and Chelsea tactician has backed the progress made at Ibrox under Steven Gerrard.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/rangers-coach-micheal-beale-describes-21928310", "urlToImage": null, "publishedAt": "2020-04-26T10:47:54Z", "content": "Michael Beale has defended the record of Rangers ' management team and described the 1-0 Betfred Cup Final defeat to Celtic as one of the most one-sided showpiece matches in history. \r\nCeltic won the trophy after Christopher Julien scored with one of only two… [+3627 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Tom Brady: Tampa mayor Jane Castor writes witty letter to Buccaneers - BBC News", "description": "The mayor of Tampa hints she is open to renaming the Tampa Bay area as she writes a witty apology to Tom Brady after he is thrown out of a city park.", "url": "https://www.bbc.co.uk/sport/american-football/52431025", "urlToImage": null, "publishedAt": "2020-04-26T10:29:22Z", "content": "Media playback is not supported on this device\r\nWatch: Tom Brady's top 10 moments\r\nOne minute Tom Brady is being thrown out of a Tampa park, the next the city's mayor is cheerfully apologising and hinting the area could one day be renamed if the quarterback d… [+1899 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Danny Gallagher For Mailonline", "title": "Juventus want Paul Pogba swap deal with Aaron Ramsey, Miralem Pjanic and Adrien Rabiot offered - Daily Mail", "description": "Juventus are reportedly ready to pull out all the stops in order to bring Paul Pogba back to Serie A and a whole host of stars are being lined up to tempt Manchester United to part with their prized asset.", "url": "https://www.dailymail.co.uk/sport/football/article-8258221/Juventus-want-Paul-Pogba-swap-deal-Aaron-Ramsey-Miralem-Pjanic-Adrien-Rabiot-offered.html", "urlToImage": null, "publishedAt": "2020-04-26T10:22:43Z", "content": "Juventus are reportedly ready to pull out all the stops in order to bring Paul Pogba back to Serie A.\r\nWhile Manchester United remain keen to hold on to their star midfielder, the minds of the Old Trafford chiefs may be swayed when Juve table a tempting swap … [+2794 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Richard Fay", "title": "Manchester United transfer target James Maddison drops fresh hint on his future - Manchester Evening News", "description": "Man Utd are interested in a move for Leicester midfielder James Maddison once the transfer market opens.", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/man-utd-maddison-transfer-news-18152223", "urlToImage": null, "publishedAt": "2020-04-26T10:06:28Z", "content": "Manchester United target James Maddison insists he is still very happy to be playing for Leicester despite strong suggestions he could leave this summer.\r\nThe 23-year-old is a current target for United ahead of the summer transfer window as Ole Gunnar Solskja… [+1284 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Barney Ronay", "title": "World Cup questions: Were England robbed by Argentina at Mexico 86? - The Guardian", "description": "With the help of the Fifa archive we rewatch a series of memorable games in search of answers we didn’t find at the time", "url": "https://www.theguardian.com/football/2020/apr/26/world-cup-questions-were-england-robbed-by-argentina-at-mexico-86", "urlToImage": null, "publishedAt": "2020-04-26T10:03:00Z", "content": "You can take our freedom. But you cant take our grainy old football videos. In this short series I will be exploring the contents of Fifas newly released World Cup archive; revisiting World Cup lore and World Cup truisms, and finding out if staring at them in… [+15862 chars]"}, {"source": {"id": null, "name": "Football365.com"}, "author": "Matthew Stead", "title": "Premier League XIs: A grand old G team - Football365.com", "description": "Football365 - Would Steven Gerrard inspire this great little G team to victory? Or might David Ginola and Ryan Giggs still clash over 1999?", "url": "https://www.football365.com/news/premier-league-xis-steven-gerrard-paul-gascoigne", "urlToImage": null, "publishedAt": "2020-04-26T09:20:17Z", "content": "We’re up to the Gs and this midfield – including Steven Gerrard and Paul Gascoigne – is rather bloody good…\r\nGoalkeeper: Shay GivenThe finest Irish goalkeeper of the Premier League era, Shay Given was Newcastle United’s No. 1 for over a decade. He made 451 ap… [+8103 chars]"}, {"source": {"id": null, "name": "Planetf1.com"}, "author": "", "title": "McLaren receive £300million cash injection - Planet F1", "description": "The McLaren Group have confirmed a cash injection of £300m from its shareholders as they look to navigate through the COVID-19 pandemic.", "url": "https://www.planetf1.com/news/mclaren-300million-cash-injection/", "urlToImage": null, "publishedAt": "2020-04-26T09:14:12Z", "content": "The McLaren Group have confirmed a cash injection of £300m from its shareholders as they look to navigate through the COVID-19 pandemic.\r\nOn top of the investment from its shareholders, McLaren are talking to third parties about boosting its working capital.\r… [+2033 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ashley Preece", "title": "EFL issue statement as West Brom hero pokes fun at Wolves - Birmingham Live", "description": "West Bromwich Albion daily digest - Here's a round-up of the latest Albion stories via BirminghamLive, including goal-hero Robert Earnshaw reliving The Great Escape", "url": "https://www.birminghammail.co.uk/sport/football/football-news/efl-issue-statement-west-brom-18151514", "urlToImage": null, "publishedAt": "2020-04-26T08:43:33Z", "content": "Reidy\r\nSteven Reid is still fondly remembered within the ranks of the West Bromwich Albion fanbase.\r\nThe versatile Irishman, who played at right-back and in defensive midfield during his four year stay at The Hawthorns returned to aid Jimmy Shan in a coaching… [+6844 chars]"}, {"source": {"id": null, "name": "Shieldsgazette.com"}, "author": "James Copley", "title": "Rumours of TWO takeovers, Newcastle linked with TRIPLE £149m deal, Kevin Keegan tipped to make stunning return - Premier League gossip - Shields Gazette", "description": "The Premier League football season may be on ice due to COVID-19 but there’s still plenty for Newcastle United fans to be excited about at the moment.", "url": "https://www.shieldsgazette.com/sport/football/newcastle-united/mike-ashleys-go-man-confident-takeover-newcastle-linked-triple-ps149m-deal-and-kevin-keegan-return-premier-league-gossip-2550101", "urlToImage": null, "publishedAt": "2020-04-26T08:39:45Z", "content": "Weve rounded up all of the latest Sunday morning takeover and transfer news swirling around the web and beyond as the Magpies look set to become the richest club in the top-tier.\r\nSimply scroll down and click through the pages to view the latest transfer and … [+935 chars]"}, {"source": {"id": null, "name": "Tbrfootball.com"}, "author": "Lee Connor", "title": "Aubameyang being on the way out gives Arsenal upper hand in Myron Boadu race - TBR - The Boot Room - Football News", "description": "Arsenal could have an ace up their sleeve in Pierre-Emerick Aubameyang when it comes to landing AZ Alkmaar striker, Myron Boadu. The Gunners want to sign the 19-year-old striker this summer according to a number of reports. However, AC Milan have also added B…", "url": "https://tbrfootball.com/aubameyang-being-on-the-way-out-gives-arsenal-upper-hand-in-myron-boadu-race/", "urlToImage": null, "publishedAt": "2020-04-26T08:30:38Z", "content": "Arsenal could have an ace up their sleeve in Pierre-Emerick Aubameyang when it comes to landing AZ Alkmaar striker, Myron Boadu.\r\nThe Gunners want to sign the 19-year-old striker this summer according to a number of reports. However, AC Milan have also added … [+1674 chars]"}, {"source": {"id": null, "name": "Racingpost.com"}, "author": "Jonathan Harding", "title": "Southern Legend causes Champions Mile upset to down top miler Beauty Generation - Racing Post", "description": "Southern Legend caused a major upset to deny Beauty Generation in a photo finish and claim the Group 1 Champions Mile at Sha Tin", "url": "https://www.racingpost.com/news/southern-legend-causes-champions-mile-upset-to-down-top-miler-beauty-generation/432440", "urlToImage": null, "publishedAt": "2020-04-26T08:30:02Z", "content": "Southern Legend caused a major upset to deny Beauty Generation in a photo-finish and claim Sunday's Champions Mile at Sha Tin. \r\nThe pair pulled clear in the straight and it looked as though Beauty Generation would power clear and land a historic third victor… [+2496 chars]"}, {"source": {"id": null, "name": "Hitc.com"}, "author": "Subhankar Mondal", "title": "Arsenal and Carlo Ancelotti reportedly want Newcastle United’s most talented player - HITC - Football, Gaming, Movies, TV, Music", "description": "Arsenal and Everton are among the clubs linked with Newcastle United’s Matty Longstaff.", "url": "https://www.hitc.com/en-gb/2020/04/26/arsenal-and-carlo-ancelotti-reportedly-want-newcastle-uniteds-mo/", "urlToImage": null, "publishedAt": "2020-04-26T08:19:56Z", "content": "Arsenal and Everton are among the clubs linked with Newcastle Uniteds Matty Longstaff.\r\nJetro Willems has said on Twitter that reported Arsenal, Everton and West Ham United target Matty Longstaff is the most talented player at Newcastle United.\r\nLongstaff is … [+1136 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Jon Boon", "title": "Mike Tyson’s three wives including one he caught having sex with Brad Pitt, one who is a doctor and ex-con s - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/11472016/mike-tyson-wives-brad-pitt-sex/", "urlToImage": null, "publishedAt": "2020-04-26T08:02:36Z", "content": "BOXING legend Mike Tyson is the most settled he's ever been.\r\nAnd that could be because of the influence of his new wife, Lakiha Spicer.\r\n Mike Tyson has married three different women in his lifetimeCredit: New York Daily News - Getty\r\nTyson's first wife Robi… [+5436 chars]"}, {"source": {"id": null, "name": "Teamtalk.com"}, "author": null, "title": "Paper Talk: Tottenham ready to gazump Man Utd for Barcelona standout - Teamtalk.com", "description": "Tottenham have emerged as major suitors to sign a standout Barcelona star, while Liverpool had a firm answer for Philippe Coutinho when a return was discussed.", "url": "https://www.teamtalk.com/news/transfer-gossip-tottenham-gazump-man-utd-ivan-rakitic-liverpool-coutinho-answer", "urlToImage": null, "publishedAt": "2020-04-26T08:01:38Z", "content": "Tottenham have emerged as major suitors to sign a standout Barcelona star, while Liverpool had a firm answer for Philippe Coutinho when a return was discussed, according to Sunday’s paper gossip.\r\nTOTTENHAM MAKE MOVE FOR BARCELONA ACE\r\nTottenham have reported… [+4234 chars]"}, {"source": {"id": null, "name": "Liverpoolfc.com"}, "author": null, "title": "James Milner on Klopp's training methods, fitness secrets and more - Liverpool FC", "description": "James Milner has described the intensity of the training sessions implemented by Jürgen Klopp and his coaches, and revealed the mentality behind his own remarkable fitness levels.", "url": "https://www.liverpoolfc.com/news/first-team/394005-james-milner-on-klopp-s-training-methods-fitness-secrets-and-more", "urlToImage": null, "publishedAt": "2020-04-26T08:00:00Z", "content": "James Milner has described the intensity of the training sessions implemented by Jürgen Klopp and his coaches, and revealed the mentality behind his own remarkable fitness levels.\r\n The Liverpool vice-captain, now 34, has made 33 appearances so far in 2019-20… [+5884 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Naming Barcelona's Nou Camp after Mike Tyson's cannabis company 'an amazing idea' - BBC Sport", "description": "Mike Tyson's business partner Alki David says naming Barcelona's Nou Camp after their cannabis company is \"an amazing idea\".", "url": "https://www.bbc.co.uk/sport/football/52428730", "urlToImage": null, "publishedAt": "2020-04-26T07:48:40Z", "content": "Barcelona's current stadium opened in 1957\r\nMike Tyson's business partner Alki David says naming Barcelona's Nou Camp after their cannabis company is \"an amazing idea\".\r\nBarcelona announced on Tuesday they would sell naming rights to the stadium for the first… [+962 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Roy Keane", "title": "Roy Keane didn't get Wayne Rooney and Rio Ferdinand banter at Manchester United - Sky Sports", "description": "Roy Keane says he didn't have a lot in common with a number of his Man Utd team-mates towards the end of his career at Old Trafford.", "url": "https://www.skysports.com/football/news/11667/11978661/roy-keane-didnt-get-wayne-rooney-and-rio-ferdinand-banter-at-manchester-united", "urlToImage": null, "publishedAt": "2020-04-26T07:37:25Z", "content": "Roy Keane says he didn't have a lot in common with a number of his Manchester United team-mates towards the end of his career at Old Trafford, admitting he struggled to understand the banter of the likes of Wayne Rooney and Rio Ferdinand.\r\nKeane saw a number … [+5140 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Nathan Bliss", "title": "We simulated Tottenham vs Arsenal to see what could have happened in the North London Derby - Football.London", "description": "The Tottenham Hotspur Stadium would have hosted its first North London Derby this weekend, with Jose Mourinho and Mikel Arteta locking horns, but what would the score have been? We used FIFA 20 to find out.", "url": "https://www.football.london/tottenham-hotspur-fc/fixtures-results/tottenham-hotspur-arsenal-match-simulated-18146941", "urlToImage": null, "publishedAt": "2020-04-26T07:06:39Z", "content": "WIth the UK still in lockdown due to the ongoing coronavirus pandemic, this weekend's planned North London Derby between Tottenham Hotspur and Arsenal will not be played, with the safety of fans, players and staff of paramount importance.\r\nBut even though the… [+3118 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Vic Marks", "title": "ECB sticking with the Hundred risks twisting cricket further into chaos - The Guardian", "description": "With cricket in turmoil the tournament’s architects have unwisely opted against shifting to a more pragmatic course", "url": "https://www.theguardian.com/sport/2020/apr/26/ecb-sticking-with-the-hundred-risks-twisting-cricket-further-into-chaos", "urlToImage": null, "publishedAt": "2020-04-26T07:00:00Z", "content": "A little window of opportunity for the England and Wales Cricket Board has been rapidly slammed shut. Everything is up for grabs; the sheets of paper in front of those in charge of our summer game have never been blanker. On Friday the ECB said there would be… [+4561 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "World Rugby must not be afraid to act and lead - here's my 10-point plan to save the sport - Telegraph.co.uk", "description": "The imminent appointment of World Rugby's chairman has highlighted, in the current climate, the very real opportunities for appraisal and change in the global game.", "url": "https://www.telegraph.co.uk/rugby-union/2020/04/26/world-rugby-must-not-afraid-act-lead-10-point-plan-save-sport/", "urlToImage": null, "publishedAt": "2020-04-26T07:00:00Z", "content": "The imminent appointment of World Rugby's chairman has highlighted, in the current climate, the very real opportunities for appraisal and change in the global game.\r\nA pivotal moment in many respects. I really hope the coming weeks and months will see all inv… [+1459 chars]"}, {"source": {"id": null, "name": "Hitc.com"}, "author": "Subhankar Mondal", "title": "£120m reported Jurgen Klopp target mocks Raheem Sterling, mentions a Liverpool player - HITC - Football, Gaming, Movies, TV, Music", "description": "Liverpool ace Trent Alexander-Arnold won against Manchester City star Raheem Sterling in the ePremier League Invitational.", "url": "https://www.hitc.com/en-gb/2020/04/26/120m-reported-jurgen-klopp-target-mocks-raheem-sterling-mentions/", "urlToImage": null, "publishedAt": "2020-04-26T06:15:42Z", "content": "Liverpool ace Trent Alexander-Arnold won against Manchester City star Raheem Sterling in the ePremier League Invitational.\r\nJadon Sancho has taken a playful dig at Manchester City attacking midfielder Raheem Sterling on Twitter for losing to Liverpool defende… [+1177 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Theo Squires", "title": "Virgil van Dijk threatening to do what just one man has done before at Liverpool - Liverpool Echo", "description": "No defender has ever scored a hat-trick in Premier League history but today marks 34-years since a Liverpool centre-back achieved such a feat", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpools-unlikeliest-ever-hat-trick-18124296", "urlToImage": null, "publishedAt": "2020-04-26T06:10:45Z", "content": "It is a rare feat to score a hat-trick in football. \r\nFrom the current Liverpool squad, only four players have bagged trebles and it should come as no surprise to their identities.\r\nMohamed Salah (vs Bournemouth, December 2018, and a four-goal haul vs Watford… [+3709 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Lee Wilmot", "title": "Chelsea suffer Philippe Coutinho transfer setback - Football.London", "description": "Former Liverpool man has been tipped to return to the Premier League this summer", "url": "https://www.football.london/chelsea-fc/transfer-news/chelsea-suffer-philippe-coutinho-transfer-18151832", "urlToImage": null, "publishedAt": "2020-04-26T06:05:29Z", "content": "Chelsea have been tipped to make a move for Philippe Coutinho this summer.\r\nThe Brazilian playmaker has struggled for form and regular game time since making a £142million move from Liverpool to Barcelona in 2018.\r\nCoutinho has spent this season on loan with … [+1212 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Match of Their Day: Danny Murphy picks his classic Premier League games - BBC News", "description": "In the latest Match of Their Day with BBC pundits, Danny Murphy selects his three classic Premier League games.", "url": "https://www.bbc.co.uk/sport/football/52417224", "urlToImage": null, "publishedAt": "2020-04-26T05:02:39Z", "content": "Media playback is not supported on this device\r\nMatch Of Their Day: Danny Murphy admits he regrets leaving Liverpool\r\nYou can’t pick a list of classic Premier League fixtures without including at least one Merseyside derby.\r\nDanny Murphy has done just that in… [+6322 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Ex-Chelsea striker Diego Costa reignites feud with 'suspicious' Antonio Conte - Mirror Online", "description": "Costa blames Conte for his exit from Stamford Bridge, and says the Inter Milan boss wouldn't last one season at a club like Real Madrid", "url": "https://www.mirror.co.uk/sport/football/news/ex-chelsea-striker-diego-costa-21927801", "urlToImage": null, "publishedAt": "2020-04-26T02:05:22Z", "content": "Former Chelsea star Diego Costa has reignited his feud with 'suspicious' Antonio Conte - saying the Inter Milan boss wouldn't last one season at Real Madrid. \r\n Conte and Costa won the Premier League title together at Chelsea, but the two had several run-ins … [+1779 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Who is the greatest British manager? - BBC Sport", "description": "BBC Sport's chief football writer has made a shortlist of the greatest post-war British managers, now it's turn to vote for the best.", "url": "https://www.bbc.co.uk/sport/football/52371056", "urlToImage": null, "publishedAt": "2020-04-26T01:32:45Z", "content": "Who do you think is Britain's greatest manager of the post-war era\r\nIt's one of those debates that is very difficult to win. Just who is Britain's greatest post-war manager?\r\nFrom a World Cup win, to European successes, to lifting domestic titles, there are a… [+17447 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Elliott Jackson", "title": "James Milner lifts lid on what Liverpool agreed in team meeting ahead of Champions League final - Liverpool Echo", "description": "The Reds beat Tottenham Hotspur 2-0 to win the competition last year", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/milner-surprise-admission-champions-league-18148967", "urlToImage": null, "publishedAt": "2020-04-26T00:01:59Z", "content": "James Milner has admitted he believes Liverpool's early goal against Tottenham Hotspur in the Champions League played a major role in their low-key performance.\r\nThe Reds went on to win the match 2-0 after Mohamed Salah had scored from the penalty spot after … [+1760 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Arsenal transfer news: Dortmund eyeing shock move for Bukayo Saka - Metro.co.uk", "description": "Dortmund interested in Saka.", "url": "https://metro.co.uk/2020/04/25/borussia-dortmund-shock-move-arsenal-star-bukayo-saka-12610909/", "urlToImage": null, "publishedAt": "2020-04-25T23:31:29Z", "content": "Saka has been on fire for Arsenal this season (Picture: Getty Images)\r\nBorussia Dortmund have set their sights on Arsenal wonderkid Bukayo Saka, with the wingers contract set to expire in 2021, according to reports.\r\nThe 18-year-old has been in scintillating … [+1762 chars]"}, {"source": {"id": null, "name": "Celtsarehere.com"}, "author": null, "title": "Brendan Rodgers House Burglary Update - CeltsAreHere", "description": "It was not long after Brendan Rodgers had left the club to become the Leicester boss when his home was burgled in the small hours of the morning. Brendan’s wife Charlotte, 36, and her daughte…", "url": "https://celtsarehere.com/brendan-rodgers-house-burglary-update/", "urlToImage": null, "publishedAt": "2020-04-25T23:23:00Z", "content": "It was not long after Brendan Rodgers had left the club to become the Leicester boss when his home was burgled in the small hours of the morning.\r\nBrendan’s wife Charlotte, 36, and her daughter Lola who was six at the time were in the house and locked themsel… [+837 chars]"}, {"source": {"id": null, "name": "Espn.co.uk"}, "author": "Adrian Wojnarowski", "title": "NBA reopening team practice facilities Friday where local restrictions eased, sources say - ESPN.co.uk", "description": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.", "url": "https://www.espn.co.uk/nba/story/_/id/29099194/nba-reopening-team-practice-facilities-friday-where-local-restrictions-eased-sources-say", "urlToImage": null, "publishedAt": "2020-04-25T23:09:06Z", "content": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.\r\nPlayers can return to team facilities in states such as … [+2131 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Sean Ingle", "title": "Olympic hopeful Eleanor Davis puts Tokyo ambition on hold to save lives - The Guardian", "description": "Eleanor Davis intended to spend Sunday running the London Marathon but the Olympic hopeful will instead be on a Covid-19 ward helping patients", "url": "https://www.theguardian.com/sport/2020/apr/25/olympic-athletics-hopeful-eleanor-davis-puts-tokyo-ambition-on-hold-to-save-lives", "urlToImage": null, "publishedAt": "2020-04-25T21:30:00Z", "content": "Eleanor Davis had intended to spend Sunday on a 42,000-step journey towards Team GBs squad for the 2020 Olympics. Instead, at 8.55am, when the London Marathon elite womens race was due to start, Davis will be on a Covid-19 ward saving lives. Its gutting that … [+4724 chars]"}, {"source": {"id": "talksport", "name": "TalkSport"}, "author": "Sean Gallagher", "title": "Eddie Hearn claims he REJECTED chance to sign Tyson Fury in 2017 because he thought ‘Gypsy King’ would never r - talkSPORT.com", "description": "", "url": "http://talksport.com/sport/boxing/699050/hearn-rejected-chance-sign-fury-2017-overweight/", "urlToImage": null, "publishedAt": "2020-04-25T21:29:52Z", "content": "Matchroom chief Eddie Hearn has claimed he turned down the chance to sign Tyson Fury back in 2017 because he was so overweight.\r\nBoth Hearn and Fury were in attendance for Derek Chisora’s showdown with Agit Kabayel – with the former losing to the European hea… [+2386 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Report: Barcelona make Coutinho transfer decision that could impact Tottenham - The Spurs Web", "description": "Tottenham Hotspur's chances of landing Philippe Coutinho have just received a huge blow as the latest reports from Spain indicate that Barcelona have U-turned on their original plans to sell the star. Spurs have been linked with a move for Coutinho since it e…", "url": "https://www.spurs-web.com/spurs-news/report-barcelona-make-coutinho-transfer-decision-that-could-impact-tottenham/", "urlToImage": null, "publishedAt": "2020-04-25T21:00:00Z", "content": "Tottenham Hotspurs chances of landing Philippe Coutinho have just received a huge blow as the latest reports from Spain indicate that Barcelona have U-turned on their original plans to sell the star.\r\nSpurs have been linked with a move for Coutinho since it e… [+928 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "Jofra Archer reveals he has lost his Cricket World Cup winner's medal - The Guardian", "description": "England paceman Jofra Archer revealed he has ‘gone mad’ searching for his World Cup winner’s medal after losing it during a recent house move", "url": "https://www.theguardian.com/sport/2020/apr/25/jofra-archer-reveals-he-has-lost-his-england-cricket-world-cup-winners-medal", "urlToImage": null, "publishedAt": "2020-04-25T18:41:53Z", "content": "England pace bowler Jofra Archer revealed he has gone mad searching for his Cricket World Cup winners medal after losing it during a recent house move. Archer rose from relative obscurity to become a household name at last years tournament, finishing as Engla… [+1949 chars]"}, {"source": {"id": null, "name": "Theguardian.comsport"}, "author": "Guardian staff reporter", "title": "NFL's remote draft concludes as 49ers acquire star tackle Trent Williams - The Guardian", "description": "The NFL draft entered its third and final day with Cincinnati selecting an Appalachian State linebacker on Saturday afternoon", "url": "https://amp.theguardian.comsport/2020/apr/25/nfl-draft-saturday-picks-day-three", "urlToImage": null, "publishedAt": "2020-04-25T18:34:00Z", "content": "Maybe the Southeastern Conference should simply hold onto its players and become part of the NFL.\r\nThe home of national champion LSU and perennial contenders Alabama, Georgia and Auburn, the SEC dominated the first four rounds of the NFL draft before the flow… [+5706 chars]"}, {"source": {"id": null, "name": "Planetf1.com"}, "author": "", "title": "Charles Leclerc: Max Verstappen for fun, Lewis Hamilton for points - PlanetF1", "description": "Charles Leclerc says he gets the most enjoyment from battling Max Verstappen, but Lewis Hamilton is the best for scoring points.", "url": "https://www.planetf1.com/news/charles-leclerc-f1-rivals/", "urlToImage": null, "publishedAt": "2020-04-25T18:05:03Z", "content": "Charles Leclerc says he gets the most enjoyment from battling Max Verstappen, but Lewis Hamilton is the best for scoring points.\r\nLeclerc stepped up to the second Ferrari seat in 2019 and gave us a glimpse of the future by taking it to both Verstappen and Ham… [+1488 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "FULL GAME: WEST HAM V EVERTON | 21 SEPTEMBER 2013 - Everton Football Club", "description": "Subscribe to Everton Football Club's official YouTube Channel: http://bit.ly/2wtCEbB Follow us on Facebook: http://facebook.com/everton Follow us on Twitter:...", "url": "https://www.youtube.com/watch?v=7U1emuqMqzE", "urlToImage": null, "publishedAt": "2020-04-25T18:00:14Z", "content": null}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "Seb Jenkins", "title": "Report: Tottenham 'ramp up bid' to sign 21-year-old Premier League playmaker - The Spurs Web", "description": "Football Insider have now reported that Tottenham Hotspur are ramping up their bid to sign Norwich City playmaker, Todd Cantwell, this summer. The 21-year-old attacker caught the eye in his first Premier League season this year as he recorded six goals across…", "url": "https://www.spurs-web.com/spurs-news/report-tottenham-ramp-up-bid-to-sign-21-year-old-premier-league-playmaker/", "urlToImage": null, "publishedAt": "2020-04-25T17:43:13Z", "content": "Football Insider have now reported that Tottenham Hotspur are ramping up their bid to sign Norwich City playmaker, Todd Cantwell, this summer.\r\nThe 21-year-old attacker caught the eye in his first Premier League season this year as he recorded six goals acros… [+790 chars]"}, {"source": {"id": null, "name": "Paddypower.com"}, "author": "Rob Catterson", "title": "Horse racing tips: 5 who'll thrive in the din at Sha Tin on Sunday - Paddy Power News", "description": "In case you hadn't already heard, it's Champions Day.", "url": "https://news.paddypower.com/horse-racing/2020/04/25/horse-racing-tips-champions-day-sha-tin/", "urlToImage": null, "publishedAt": "2020-04-25T14:40:47Z", "content": "The first of the Group 1 action is the Chairmans Sprint Prize, where eight of the 11 runners contested the Group 2 Sprint Cup three weeks ago over C&amp;D. On that occasion, Voyage Warrior was a surprise winner but there was nothing fluky about his performanc… [+3274 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Elliott Jackson", "title": "Dimitar Berbatov sends transfer warning to Newcastle with Man City comparison - Manchester Evening News", "description": "The former Manchester United striker has had his say on Newcastle's potential takeover.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/berbatov-newcastle-manchester-city-takeover-18147091", "urlToImage": null, "publishedAt": "2020-04-25T14:36:51Z", "content": "Dimitar Berbatov has insisted it will take time for Newcastle United to attract top players to the club.\r\nNewcastle are in talks over a potential Saudi Arabia-backed takeover. Manchester City, of course, were subject to a takeover of their own in 2008 which d… [+1174 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Elliott Jackson", "title": "What Jurgen Klopp said to Liverpool before historic Barcelona comeback - Liverpool Echo", "description": "The Reds beat Barcelona 4-0 to reach the Champions League final", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/klopp-liverpool-talk-barcelona-comeback-18148913", "urlToImage": null, "publishedAt": "2020-04-25T14:08:58Z", "content": "James Milner has revealed what Jurgen Klopp said to his players in training before their unforgettable comeback against Barcelona in the Champions League. \r\nThe Reds remarkably beat the Spanish giants 4-0 at Anfield in the second leg of their Championship Lea… [+1744 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Chelsea: No wage cuts for first team as players asked to support charities instead - Sky Sports", "description": "Chelsea say first-team players will not be taking wage cuts following discussions amid the coronavirus crisis but have been asked to support charities instead.", "url": "https://www.skysports.com/football/news/11668/11978660/chelsea-no-wage-cuts-for-first-team-as-players-asked-to-support-charities-instead", "urlToImage": null, "publishedAt": "2020-04-25T12:21:15Z", "content": "Chelsea say first-team players \"will not be contributing towards the club financially\" following discussions amid the coronavirus crisis, but have been asked to support charities instead. \r\nEarlier this month, Sky Sports News reported that Chelsea's players w… [+3443 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Frank Lampard opens talks with Belgium star as Chelsea look to seal free transfer - Football.London", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiYmh0dHBzOi8vd3d3LmZvb3RiYWxsLmxvbmRvbi9jaGVsc2VhLWZjL3RyYW5zZmVyLW5ld3MvY2hlbHNlYS1uYXBvbGktbGFtcGFyZC1kcmllcy1tZXJ0ZW5zLTE4MTQ5ODI00gFmaHR0cHM6Ly93d3cuZm9vdGJhbGwubG9uZG9uL2NoZWxzZWEtZmMvdHJhbnNmZXItbmV3cy9jaGVsc2VhLW5hcG9saS1sYW1wYXJkLWRyaWVzLW1lcnRlbnMtMTgxNDk4MjQuYW1w?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T12:20:38Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Charlie Malam", "title": "UK government officials have Liverpool and Leeds title concern as football return debated - Express", "description": "Government officials are concerned about the prospect of title celebrations if the Premier League and Championship seasons are resumed.", "url": "https://www.express.co.uk/sport/football/1273772/Premier-League-Liverpool-title-Leeds-Championship-UK-government-coronavirus-football", "urlToImage": null, "publishedAt": "2020-04-25T12:10:36Z", "content": null}, {"source": {"id": null, "name": "Autosport.com"}, "author": "Luke Smith", "title": "Brazil 2012: The race that could have changed an F1 nearly-man's career - Autosport", "description": "The 2012 Brazilian Grand Prix, which is being live-streamed by Formula 1 today, is upheld as one of F1's most dramatic title-deciders", "url": "https://www.autosport.com/f1/news/149147/the-race-that-could-have-changed-an-f1-nearlyman", "urlToImage": null, "publishedAt": "2020-04-25T11:33:15Z", "content": "The 2012 Brazilian Grand Prix, which is being live-streamed by Formula 1 today, is upheld as one of F1's most dramatic title-deciders. The fight for the victory was no less exciting, as yet another chance slipped through the fingers of an F1 nearly-man\r\nThe 2… [+9660 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Report: Spurs could suffer major financial blow after UEFA decision - The Spurs Web", "description": "Tottenham Hotspur could be set to suffer a major financial blow in revenue generated from European football if the season is decided on a points-per-game basis, the Evening Standard report. It was revealed on Thursday that UEFA were considering using a points…", "url": "https://www.spurs-web.com/spurs-news/report-spurs-could-suffer-major-financial-blow-after-uefa-decision/", "urlToImage": null, "publishedAt": "2020-04-25T11:00:00Z", "content": "Tottenham Hotspur could be set to suffer a major financial blow in revenue generated from European football if the season is decided on a points-per-game basis, the Evening Standard report.\r\nIt was revealed on Thursday that UEFA were considering using a point… [+1358 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Daniel Davis For Mailonline", "title": "Bury owner Steve Dale reveals that club hope to be placed in the National League next season - Daily Mail", "description": "The former League One outfit were kicked out of the division in August after failing to provide proof of funding, but are entitled to be placed into the upper reaches of the non-league setup.", "url": "https://www.dailymail.co.uk/sport/sportsnews/article-8255587/Bury-owner-Steve-Dale-reveals-club-hope-placed-National-League-season.html", "urlToImage": null, "publishedAt": "2020-04-25T09:18:02Z", "content": "Bury owner Steve Dale has revealed that the expelled EFL club are hoping to be placed into the National League next season.\r\nThe former League One outfit were kicked out of the division in August after failing to provide proof of funding, but are entitled to … [+2269 chars]"}, {"source": {"id": null, "name": "Lancs.live"}, "author": "Elliott Jackson", "title": "The dangerous precedent set for Liverpool, Leeds United and the Lancashire clubs - LancsLive", "description": "The Premier League and EFL remain committed to completing the 2019/20 season.", "url": "https://www.lancs.live/sport/football/football-news/dangerous-precedent-set-liverpool-leeds-18149139", "urlToImage": null, "publishedAt": "2020-04-25T06:12:00Z", "content": "Dutch giants Ajax have been denied the Eredivisie title after it was confirmed there would be no 2019/20 league champions in the Netherlands.\r\nLast season's Champions League semi-finalists lead the table on goal difference over AZ Alkmaar with nine league mat… [+1244 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Reubyn Coutinho", "title": "“The Winner Will Fight Khabib For the Title”- Dana White makes a huge statement - Essentially Sports", "description": "UFC President Dana White made a huge statement regarding UFC Lightweight division. He said the winner of Ferguson-Gaethje will fight Khabib for the title.", "url": "https://www.essentiallysports.com/ufc-news-the-winner-will-fight-khabib-for-the-title-dana-white-makes-a-huge-statement-tony-ferguson-justin-gaethje/", "urlToImage": null, "publishedAt": "2020-04-25T05:00:00Z", "content": "UFC 249 finally has a new venue. The event will take place at VyStar Veterans Memorial Arena in Jacksonville, Florida. The UFC pounced on a chance to hold their events in the Sunshine State as sports activities were deemed essential businesses. Dana White app… [+1819 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Suzanne Wrack", "title": "Who could replace Phil Neville as England Women's manager? - The Guardian", "description": "We run the rule over leading candidates, including a two-times World Cup winner and a woman who worked as Neville’s No 2", "url": "https://www.theguardian.com/football/2020/apr/24/who-could-replace-phil-neville-as-england-womens-manager", "urlToImage": null, "publishedAt": "2020-04-24T18:00:00Z", "content": "The Football Associations hunt for a successor to Mark Sampson in 2017 quickly became a circus. Names flew out of the ring as fast as they stepped in. Increased scrutiny on the person in charge, with the game professionalising, led some of those on the shortl… [+4734 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Andy Murray to play Rafael Nadal in virtual version of Madrid Open - BBC Sport", "description": "Andy Murray will play Rafael Nadal next week - in the online video game version of the Madrid Open.", "url": "https://www.bbc.co.uk/sport/tennis/52419379", "urlToImage": null, "publishedAt": "2020-04-24T17:21:57Z", "content": "Andy Murray and Rafael Nadal will compete from their own homes via an online video game\r\nAndy Murray will play Rafael Nadal next week - from his own home, in a virtual version of the Madrid Open.\r\nGael Monfils and Denis Shapovalov are also in his group, while… [+689 chars]"}]}