{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Paul Gorst", "title": "Unpaid wages and baffling criticism - how Loris Karius Besiktas loan from Liverpool became a nightmare - Liverpool Echo", "description": "Loris Karius' loan move was meant to herald a fresh start, but it hasn't quite worked out like that, writes Paul Gorst", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/unpaid-wages-baffling-criticism-how-18150220", "urlToImage": null, "publishedAt": "2020-04-26T00:02:14Z", "content": "It was supposed to be a fresh start for Loris Karius.\r\nWhen the Liverpool goalkeeper traded Merseyside for Turkey in August 2018, the loan deal the Reds struck with Besiktas was meant to be one that breathed fresh life into a career that was flatlining.\r\nJust… [+5349 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Elliott Jackson", "title": "Liverpool legend Steven Gerrard compares Jordan Henderson to Paul Scholes - Liverpool Echo", "description": "The Liverpool captain is in the running to win the PFA Player of the Year award this season", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/gerrard-makes-henderson-scholes-comparison-18150146", "urlToImage": null, "publishedAt": "2020-04-26T00:02:09Z", "content": "Steven Gerrard has claimed that Liverpool captain Jordan Henderson is now running matches in the same fashion as former Manchester United midfielder Paul Scholes.\r\nHenderson has had a fantastic season for the Reds who sit top of the Premier League table by 25… [+1556 chars]"}, {"source": {"id": null, "name": "Theguardian.comfootball"}, "author": "Guardian staff reporter", "title": "Everton 'appalled' after Moise Kean hosts coronavirus lockdown party - The Guardian", "description": "Everton have labelled Moise Kean’s actions ‘unacceptable’ after he flouted coronavirus lockdown restrictions", "url": "https://amp.theguardian.comfootball/2020/apr/26/everton-appalled-moise-kean-hosts-coronavirus-lockdown-party", "urlToImage": null, "publishedAt": "2020-04-25T23:14:54Z", "content": "Everton have labelled Moise Keans actions unacceptable after he flouted coronavirus lockdown restrictions.\r\nThe striker filmed himself partying at home with guests in a breach of social distancing regulations during the coronavirus pandemic. Kean, who joined … [+1170 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Matt Dathan", "title": "Premier League football to return ‘within weeks’ with behind closed doors matches but may be shown on fre - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/11476053/premier-league-return-tv-weeks/", "urlToImage": null, "publishedAt": "2020-04-25T22:53:18Z", "content": "PREMIER League football could be back on TV within weeks in a major boost to bored Brits.Boris Johnson has been briefed on plans for fixtures to be played behind closed doors and sees the resumption of live sport as key to boosting the morale of the nation af… [+9612 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Neil Moxley, John Richardson", "title": "Kevin Keegan lined up for Newcastle return when £300million Saudi takeover goes through - Mirror Online", "description": "EXCLUSIVE: The 69-year-old made 78 appearances for the Magpies as a player and also had two spells in charge as a manager at St James' Park", "url": "https://www.mirror.co.uk/sport/football/news/kevin-keegan-lined-up-newcastle-21926877", "urlToImage": null, "publishedAt": "2020-04-25T22:16:16Z", "content": "Kevin Keegan is being lined for a sensational return to Newcastle and the Saudi takeover could even be rubber-stamped later this week. \r\nThe man idolised as The Messiah by the Toon Army will be invited to take up an ambassadorial role when the £300m buy-out i… [+2466 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Michael Gannon", "title": "Roy MacGregor tells Rangers to 'put up or shut up' as Ross County chief demands to see alleged evidence - Daily Record", "description": "The Ross County chairman is fed up of the \"tedious\" stand off between Rangers and the SPFL.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/roy-macgregor-tells-rangers-put-21926481", "urlToImage": null, "publishedAt": "2020-04-25T22:10:12Z", "content": "Roy MacGregor has told Rangers to put up or shut up in their crusade against the SPFL.\r\nThe Ibrox club has stepped up their demands for an independent inquiry in to the voting process behind the decision to call the lower leagues with a view to drawing a line… [+2535 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Alex Dicken", "title": "Aston Villa linked with shock move to replace Dean Smith - reports - Birmingham Live", "description": "Aston Villa news - Reports have emerged in the national press to suggest AVFC are keeping tabs on another manager", "url": "https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-news-sean-dyche-18151836", "urlToImage": null, "publishedAt": "2020-04-25T22:07:29Z", "content": "Aston Villa have been linked with a shock interest in Burnley manager Sean Dyche. \r\nLike the rest of the Premier League, Villa are currently on lockdown and waiting to learn when their season will resume. \r\nDean Smith and his players have a huge task awaiting… [+858 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Alex Dicken", "title": "Man Utd chief Ed Woodward makes transfer revelation that concerns Jack Grealish - Birmingham Live", "description": "Aston Villa transfer news - Man United chief Ed Woodward has made some interesting claims concerning their pursuit of transfer targets", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/manchester-united-aston-villa-grealish-18151320", "urlToImage": null, "publishedAt": "2020-04-25T22:07:25Z", "content": "Manchester United could be forced to put their pursuit of Jack Grealish on hold, Ed Woodward has warned. \r\nUnited boss Ole Gunnar Solskjaer has made signing Aston Villa captain Grealish a top priority heading into the next window. \r\nThe 24-year-old playmaker … [+1083 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Arsenal star Pierre-Emerick Aubameyang should aim higher than Chelsea, says Craig Burley - Metro.co.uk", "description": "'Chelsea are a project at the moment.'", "url": "https://metro.co.uk/2020/04/25/arsenal-star-pierre-emerick-aubameyang-aim-higher-chelsea-craig-burley-12610672/", "urlToImage": null, "publishedAt": "2020-04-25T21:15:29Z", "content": "Aubameyang could leave the Emirates this summer (Picture: Getty Images)\r\nFormer Chelsea midfielder Craig Burley believes Arsenal striker Pierre-Emerick Aubameyang should be aiming for a club challenging for titles, rather than joining Frank Lampards project a… [+2204 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Leeds face nightmare scenario if Premier League follow Eredivisie and deny promotion gamble - Irish Mirror", "description": "Leeds were poised to end their Premier League exile before the coronavirus pandemic hit and the Eredivisie's decision has cast doubt over their promotion", "url": "https://www.mirror.co.uk/sport/football/news/leeds-face-nightmare-scenario-premier-21925320", "urlToImage": null, "publishedAt": "2020-04-25T21:07:58Z", "content": "Leeds and West Brom will be waiting with bated breath after the Eredivisie became the first European league to blink in light of the coronavirus pandemic. \r\nThe Dutch authorities announced the end of the current campaign on Friday night claiming \"it has becom… [+5257 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Lee Wilmot", "title": "Man United chief Ed Woodward opens the door to Chelsea and huge Jadon Sancho transfer - Football.London", "description": "The Borussia Dortmund forward will be a big topic of conversation during the summer transfer window", "url": "https://www.football.london/chelsea-fc/transfer-news/man-united-chief-ed-woodward-18151791", "urlToImage": null, "publishedAt": "2020-04-25T21:03:54Z", "content": "Jadon Sancho will be hot property this summer.\r\nThe teenager has been in flying form for Borussia Dortmund this season, following up his impressive breakthrough season last year.\r\nThe recently turned 20-year-old has scored 17 goals and laid on as many assists… [+1932 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Report: Barcelona make Coutinho transfer decision that could impact Tottenham - The Spurs Web", "description": "Tottenham Hotspur's chances of landing Philippe Coutinho have just received a huge blow as the latest reports from Spain indicate that Barcelona have U-turned on their original plans to sell the star. Spurs have been linked with a move for Coutinho since it e…", "url": "https://www.spurs-web.com/spurs-news/report-barcelona-make-coutinho-transfer-decision-that-could-impact-tottenham/", "urlToImage": null, "publishedAt": "2020-04-25T20:38:46Z", "content": "Tottenham Hotspurs chances of landing Philippe Coutinho have just received a huge blow as the latest reports from Spain indicate that Barcelona have U-turned on their original plans to sell the star.\r\nSpurs have been linked with a move for Coutinho since it e… [+928 chars]"}, {"source": {"id": null, "name": "Eadt.co.uk"}, "author": "Andy Warren", "title": "Coronavirus: League One and League Two could be decided by promotion tournament | Ipswich Town FC and Suffolk & Essex Sport - East Anglian Daily Times", "description": "Promotion from both League One and League Two could be decided by mini tournaments involving eight teams, according to reports.", "url": "https://www.eadt.co.uk/sport/league-one-and-two-promotion-tournament-1-6624349", "urlToImage": null, "publishedAt": "2020-04-25T20:17:00Z", "content": "PUBLISHED: 21:17 25 April 2020 | UPDATED: 21:41 25 April 2020\r\nAndy Warren\r\nIpswich Town slipped from 1st to 10th in the League One table under Paul Lambert at the start of 2020. Photo: Pagepix\r\nPagepix Ltd 07976 935738\r\nPromotion from both League One and Lea… [+4435 chars]"}, {"source": {"id": null, "name": "Justarsenal.com"}, "author": "Admin Martin", "title": "Jose Mourinho phones Arsenal target to convince him to move to Tottenham instead - Just Arsenal News", "description": "Jose Mourinho is hoping to steal a march on Arsenal in their race for Thomas Meunier and has phoned the defender to join him at Spurs. Meunier is in the final months of his current PSG deal and it looks certain that he would leave the French capital.", "url": "https://www.justarsenal.com/jose-mourinho-phones-arsenal-target-to-convince-him-to-move-to-tottenham-instead/242913", "urlToImage": null, "publishedAt": "2020-04-25T20:15:37Z", "content": "Jose Mourinho is hoping to steal a march on Arsenal in the race for Thomas Meunier and has phoned the defender to join him at Spurs, claims the Daily Mail.\r\nMeunier is in the final months of his current PSG deal and it looks certain that he would leave the Fr… [+1045 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Daniel Murphy", "title": "Real Madrid stance on Erling Haaland hands transfer boost to Manchester United and more rumours - Manchester Evening News", "description": "Man Utd are continuing to be linked with a move for Erling Braut Haaland despite his January move to Borussia Dortmund and more gossip.", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/manchester-united-transfers-latest-haaland-18150546", "urlToImage": null, "publishedAt": "2020-04-25T19:55:14Z", "content": "Real Madrid have dropped their interest in Erling Braut Haaland, opening the door for Manchester United, according to reports.\r\nHaaland announced himself on the world stage this season with a freakishly impressive scoring-rate and brilliant displays in the Ch… [+1619 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Mark Douglas", "title": "'Everyone hopes for it': Jetro Willems sends a transfer message to Newcastle United - Chronicle Live", "description": "Newcastle United loanee Jetro Willems says he absolutely wants to return to the club where he enjoyed a decent temporary spell", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/everyone-hopes-it-jetro-willems-18150981", "urlToImage": null, "publishedAt": "2020-04-25T19:50:04Z", "content": "Jetro Willems has re-stated his number one priority is to sign and play for Newcastle United in an impromptu Twitter question and answer session.\r\nThe popular wing-back had made a fine impression at St James Park before a serious injury suffered at the turn o… [+1177 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Report: Club to activate clause to deny Spurs the chance to complete free transfer - The Spurs Web", "description": "Chelsea are preparing to activate a clause in Olivier Giroud's contract which could prevent the striker from joining Tottenham Hotspur on a free transfer this summer, the Guardian have revealed. Spurs were heavily linked with Giroud in January as they looked …", "url": "https://www.spurs-web.com/spurs-news/report-club-to-activate-clause-to-deny-spurs-the-chance-to-complete-free-transfer/", "urlToImage": null, "publishedAt": "2020-04-25T19:37:36Z", "content": "Chelsea are preparing to activate a clause in Olivier Girouds contract which could prevent the striker from joining Tottenham Hotspur on a free transfer this summer, the Guardian have revealed.\r\nSpurs were heavily linked with Giroud in January as they looked … [+1175 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Dan Kay", "title": "Roberto Firmino's tunnel reaction to Sadio Mane and Mohamed Salah row set tone for stellar Liverpool season - Liverpool Echo", "description": "Bobby's 'side-eye' to camera was one of funniest moments of Liverpool's season but also gave snapshot into mentality which has proved so successful", "url": "https://www.liverpoolecho.co.uk/sport/football/liverpool-mane-firmino-salah-burnley-18151271", "urlToImage": null, "publishedAt": "2020-04-25T19:33:41Z", "content": "If there is one thing this Liverpool team is renowned for, it is their unity, togetherness and team spirit. \r\n There have been numerous examples of it on and off the field and is one of the aspects Liverpudlians have enjoyed most during the rise to top of the… [+6710 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Theo Squires", "title": "Eight players you forgot were in Being: Liverpool - Liverpool Echo", "description": "Alberto Aquilani was still a Liverpool player - but do you remember the other seven stars?", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/transfer-mistakes-surprise-jamie-carragher-18128074", "urlToImage": null, "publishedAt": "2020-04-25T19:21:55Z", "content": "Jurgen Klopp is not too fond of fly-on-the-wall documentaries. Well not ones that would invade his Liverpool dressing room anyway.\r\nThe Reds have resisted offers from TV companies in the past as the likes of Netflix and Amazon Prime enjoy success with the lik… [+9946 chars]"}, {"source": {"id": null, "name": "Tbrfootball.com"}, "author": "https://www.facebook.com/mathew.r.nash", "title": "Toon Army cult figure Aleksandar Mitrovic is huge fan of Newcastle United managerial target Mauricio Pochettino - TBR - The Boot Room - Football News", "description": "Newcastle United are reportedly keen on the Argentine.", "url": "https://tbrfootball.com/toon-army-cult-figure-aleksandar-mitrovic-is-huge-fan-of-newcastle-united-managerial-target-mauricio-pochettino/", "urlToImage": null, "publishedAt": "2020-04-25T18:50:59Z", "content": "Newcastle United are reportedly eyeing up a potential move to make Mauricio Pochettino their new manager once a Saudi-backed takeover of the club is completed. \r\nAccording to ESPN, the Argentine is one of four big names on a shortlist of potential future Tott… [+1430 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Joseph Chapman", "title": "Robert Earnshaw makes startling West Brom admission about that day at Charlton - Birmingham Live", "description": "Earnshaw was considering his future and after being informed by Bryan Robson that he’d been left out of the starting XI once again in London that day, it was a mindset that only intensified", "url": "https://www.birminghammail.co.uk/sport/football/football-news/robert-earnshaw-makes-startling-west-18150125", "urlToImage": null, "publishedAt": "2020-04-25T18:39:56Z", "content": "West Broms Great Escape hero Robert Earnshaw has revealed that he was actually thinking about leaving the club on the same day that he bagged an unforgettable hat-trick at Charlton Athletic.\r\n The former Albion striker was competing for a place in the startin… [+4514 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Arsenal to open London Colney training ground to players on limited basis - BBC Sport", "description": "Arsenal's players will be allowed to return to limited training sessions from next week.", "url": "https://www.bbc.co.uk/sport/football/52428362", "urlToImage": null, "publishedAt": "2020-04-25T18:35:02Z", "content": "Arsenal were ninth in the Premier League when the season was halted\r\nArsenal's players will return to light training sessions from next week.\r\nPlayers will undertake individual running at London Colney, in line with government coronavirus regulations.\r\n\"Playe… [+971 chars]"}, {"source": {"id": null, "name": "Theguardian.comsport"}, "author": "Guardian staff reporter", "title": "NFL draft enters day three as 49ers acquire star tackle Trent Williams - The Guardian", "description": "The NFL draft entered its third and final day with Cincinnati selecting an Appalachian State linebacker on Saturday afternoon", "url": "https://amp.theguardian.comsport/2020/apr/25/nfl-draft-saturday-picks-day-three", "urlToImage": null, "publishedAt": "2020-04-25T18:34:00Z", "content": "Clunky at times, poignant at others, and exceptionally entertaining in spots, the NFL draft entered its third and final day with Cincinnati selecting an Appalachian State linebacker on Saturday.\r\nCommissioner Roger Goodell has insisted the sporting world need… [+2895 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Luke Gardener", "title": "Man Utd make Pogba swap transfer decision, Aubameyang to Chelsea, Mourinho agrees deal - Express", "description": "The transfer window is fast approaching with Premier League sides such as Manchester United, Chelsea, Arsenal and Liverpool all looking to strengthen. Express Sport brings you updates throughout the day.", "url": "https://www.express.co.uk/sport/football/1273851/Transfer-news-LIVE-Man-Utd-Pogba-swap-Spurs-agree-Aubameyang-Chelsea-latest-updates-gossip", "urlToImage": null, "publishedAt": "2020-04-25T18:29:09Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Ieuan Ivett For Mailonline", "title": "Roy Keane reveals he didn't warm to Rooney and Ferdinand during their time together at Man United - Daily Mail", "description": "Roy Keane admitted that he never got on well with former Manchester United teammates Wayne Rooney or Rio Ferdinand as he never understood their 'banter'.", "url": "https://www.dailymail.co.uk/sport/football/article-8256779/Roy-Keane-reveals-didnt-warm-Rooney-Ferdinand-time-Man-United.html", "urlToImage": null, "publishedAt": "2020-04-25T18:15:59Z", "content": "Roy Keane has admitted that he never got on well with former Manchester United team-mates Wayne Rooney or Rio Ferdinand as he never understood their 'banter'.\r\nFormer United skipper Keane, who is well known for not pulling any punches, revealed he did not mis… [+2357 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "FULL GAME: WEST HAM V EVERTON | 21 SEPTEMBER 2013 - Everton Football Club", "description": "Subscribe to Everton Football Club's official YouTube Channel: http://bit.ly/2wtCEbB Follow us on Facebook: http://facebook.com/everton Follow us on Twitter:...", "url": "https://www.youtube.com/watch?v=7U1emuqMqzE", "urlToImage": null, "publishedAt": "2020-04-25T18:00:14Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Simon Burnton", "title": "Premier League's virtual comeback a triumph – especially for Diogo Jota - The Guardian", "description": "The Wolves man’s golden-goal win against Trent Alexander-Arnold kept Liverpool waiting for a title at the climax of a pound-shop version of MTV Cribs", "url": "https://www.theguardian.com/sport/2020/apr/25/diogo-jota-wins-virtual-football-final-against-trent-alexander-arnold", "urlToImage": null, "publishedAt": "2020-04-25T18:00:00Z", "content": "It was the least fitting of finals: after a tournament that had featured a net-busting 106 goals in just 18 matches when the best players met there were just two in the final, shared between Trent Alexander-Arnold and Diogo Jota, with the latter eventually wi… [+4250 chars]"}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "Petec21", "title": "Raheem Sterling: There’s Only One Shirt I Want - Bitter and Blue", "description": "City Winger Wants Barca Legend Shirt", "url": "https://bitterandblue.sbnation.com/2020/4/25/21236328/raheem-sterling-theres-only-one-shirt-i-want", "urlToImage": null, "publishedAt": "2020-04-25T17:48:16Z", "content": "Manchester City winger Raheem Sterling has revealed the one shirt he wants to obtain from his playing days for his collections. Despite gathering a collection of medals, trophies and players shirts, Sterling has said the one he really wants is a shirt off the… [+1452 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "Seb Jenkins", "title": "Report: Tottenham 'ramp up bid' to sign 21-year-old Premier League playmaker - The Spurs Web", "description": "Football Insider have now reported that Tottenham Hotspur are ramping up their bid to sign Norwich City playmaker, Todd Cantwell, this summer. The 21-year-old attacker caught the eye in his first Premier League season this year as he recorded six goals across…", "url": "https://www.spurs-web.com/spurs-news/report-tottenham-ramp-up-bid-to-sign-21-year-old-premier-league-playmaker/", "urlToImage": null, "publishedAt": "2020-04-25T17:43:13Z", "content": "Football Insider have now reported that Tottenham Hotspur are ramping up their bid to sign Norwich City playmaker, Todd Cantwell, this summer.\r\nThe 21-year-old attacker caught the eye in his first Premier League season this year as he recorded six goals acros… [+790 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Ian Doyle", "title": "Bobby Duncan, major setbacks and what happened next for Liverpool FA Youth Cup winners - Liverpool Echo", "description": "Exactly one year has passed since Liverpool lifted the FA Youth Cup against Manchester City", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/pep-lijnders-impressed-breakout-star-18143544", "urlToImage": null, "publishedAt": "2020-04-25T16:43:34Z", "content": "Champions League glory was more than a month away, but already Liverpool could celebrate claiming prestigious silverware.\r\nExactly a year has passed since the Reds claimed the FA Youth Cup for only the fourth time in their history.\r\nUnder the tutelage of coac… [+4773 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ashley Preece", "title": "Jack Grealish pokes fun at Birmingham City with blunt three-word message - Birmingham Live", "description": "Aston Villa on social media - Jack Grealish is Villa through and through and sarcastically had a dig at Birmingham City following a nostalgic video of James Milner's match-winning penalty 10 years ago", "url": "https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-jack-grealish-blues-18150166", "urlToImage": null, "publishedAt": "2020-04-25T16:40:16Z", "content": "Jack Grealish has claret and blue veins and, 10 years on from Aston Villa's 1-0 win over Blues, the skipper couldn't resist a pop at those across the Second City divide.\r\nJames Milner slammed home a controversial penalty in the 83rd minute after Gabby Agbonla… [+1059 chars]"}, {"source": {"id": null, "name": "Leicestermercury.co.uk"}, "author": "Jordan Blackwell", "title": "Leicester City's James Maddison makes new transfer promise as Manchester United circle - Leicestershire Live", "description": "The England international midfielder, who is a target for Manchester United, spoke to a Leicester City supporter about his future and his Champions League dream", "url": "https://www.leicestermercury.co.uk/sport/football/transfer-news/leicester-citys-james-maddison-makes-4079012", "urlToImage": null, "publishedAt": "2020-04-25T15:39:00Z", "content": "James Maddison has rejected talk of a summer transfer and has said he will stay at Leicester City.\r\nThe England international midfielder is a target for Manchester United after an excellent two seasons at the King Power Stadium.\r\nBut the 23-year-old, in talks… [+1424 chars]"}, {"source": {"id": null, "name": "Motorsport.com"}, "author": "Pablo Elizalde", "title": "F1 drivers will \"struggle\" with necks after hiatus ends - Motorsport.com", "description": "Carlos Sainz believes Formula 1 drivers will struggle with their necks in the first race of 2020 when the sport finally resumes following the COVID-19 crisis.", "url": "https://www.motorsport.com/f1/news/sainz-driver-collapse-neck-2020-races/4783526/", "urlToImage": null, "publishedAt": "2020-04-25T15:14:56Z", "content": "With F1 races already cancelled or postponed until at least July, drivers are set to face at least some five months without getting behind the wheel of a grand prix car.\r\nWhile all of them keep working out from home to stay in shape for when F1 resumes, Sainz… [+1701 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Freddie Keighley", "title": "Premier League chiefs' dismissive reaction to Liverpool CEO's call to complete season - Mirror Online", "description": "Reds boss Peter Moore was left high and dry by his Premier League colleagues during a video call last week - with an increasing number wanting to abandon the season", "url": "https://www.mirror.co.uk/sport/football/news/premier-league-chiefs-reaction-liverpool-21925308", "urlToImage": null, "publishedAt": "2020-04-25T15:02:24Z", "content": "Liverpool CEO Peter Moore was reportedly met with silence last Friday as he reaffirmed the importance of finishing the Premier League season to fellow club bosses.\r\n The Reds have a 25-point lead at the summit of the league but concerns are growing about whet… [+2297 chars]"}, {"source": {"id": null, "name": "Mmafighting.com"}, "author": "Alexander K. Lee", "title": "Chael Sonnen warns of potential ‘screw job’ if Conor McGregor is thrown into Khabib-Ferguson plans - MMA Fighting", "description": "Chael Sonnen is looking out for Tony Ferguson.", "url": "https://www.mmafighting.com/2020/4/25/21234587/chael-sonnen-warns-of-potential-screw-job-if-conor-mcgregor-is-thrown-into-khabib-ferguson-plans", "urlToImage": null, "publishedAt": "2020-04-25T15:00:00Z", "content": "Chael Sonnen is wary of the UFCs potential plans when it comes to lightweight stars Khabib Nurmagomedov, Tony Ferguson, and Conor McGregor.\r\nNo stranger to promotional politics himself, Sonnen wondered how the influence of McGregor could affect a re-booking o… [+4778 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Jofra Archer loses Cricket World Cup medal after moving house - Sky Sports", "description": "Jofra Archer is searching for his 2019 Cricket World Cup winner's medal after losing it during a recent house move.", "url": "https://www.skysports.com/cricket/news/12123/11978696/jofra-archer-loses-cricket-world-cup-medal-after-moving-house", "urlToImage": null, "publishedAt": "2020-04-25T14:42:29Z", "content": "Jofra Archer is searching for his 2019 Cricket World Cup winner's medal after losing it during a recent house move.\r\nLast year's tournament was where Archer rose from relative obscurity to a household name, finishing as England's leading wicket-taker with 20 … [+1627 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "William Pugh", "title": "Fears for Premier League and Liverpool that season will be scrapped after Holland and Belgium axe campaigns - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11478910/premier-league-season-scrapped-holland-belgium/", "urlToImage": null, "publishedAt": "2020-04-25T14:21:02Z", "content": "THERE are fears the Premier League will be scrapped and Liverpool denied the title after Holland and Belgium's top flights were both cancelled because of coronavirus.\r\nDutch football chiefs pulled the plug on the 2019/20 Eredivisie yesterday after Netherlands… [+2768 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Elliott Jackson", "title": "What Jurgen Klopp said to Liverpool before historic Barcelona comeback - Liverpool Echo", "description": "The Reds beat Barcelona 4-0 to reach the Champions League final", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/klopp-liverpool-talk-barcelona-comeback-18148913", "urlToImage": null, "publishedAt": "2020-04-25T14:08:58Z", "content": "James Milner has revealed what Jurgen Klopp said to his players in training before their unforgettable comeback against Barcelona in the Champions League. \r\nThe Reds remarkably beat the Spanish giants 4-0 at Anfield in the second leg of their Championship Lea… [+1744 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Liverpool 'eye Joaquin Correa transfer' in search for Sadio Mane backup - Mirror Online", "description": "The Reds need quality reserves for their fearsome first-choice frontline and have identified Lazio forward as potential transfer target, according to reports from Italy", "url": "https://www.mirror.co.uk/sport/football/transfer-news/liverpool-eye-joaquin-correa-transfer-21924641", "urlToImage": null, "publishedAt": "2020-04-25T14:06:03Z", "content": "Liverpool have earmarked Lazio forward Joaquin Correa as a potential transfer target, according to reports from Italy.\r\n The Argentina international is regarded as one of the most exciting talents in Serie A on his day, and could be available for as little as… [+1891 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Oliver Young-Myles", "title": "What happened to Rafa Benitez's Newcastle United promotion heroes - Chronicle Live", "description": "An emphatic 4-1 win over Preston on this day in 2017 secured promotion for Newcastle with two games to spare, but what happened to the players involved that day?", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/what-happened-rafa-benitezs-newcastle-18146145", "urlToImage": null, "publishedAt": "2020-04-25T13:28:33Z", "content": "Despite Rafa Benitez s best efforts, Newcastle United were relegated from the Premier League for the second time in seven years back in 2016. \r\nA mass exodus followed with Moussa Sissoko, Georginio Wijnaldum and Andros Townsend, among a host of high-profile s… [+4647 chars]"}, {"source": {"id": null, "name": "Dartsnews.com"}, "author": null, "title": "PDC issue statement regarding cheating allegations surrounding Klaasen in Home Tour - Dartsnews.com", "description": "Jelle Klaasen claimed Group Seven in the PDC Home Tour on Thursday night but cheating allegations were levelled at the former Lakeside champion", "url": "https://dartsnews.com/pdc-issue-statement-regarding-cheating-allegations-surrounding-klaasen-in-home-tour/", "urlToImage": null, "publishedAt": "2020-04-25T13:13:28Z", "content": "Jelle Klaasen claimed Group Seven in the PDC Home Tour on Thursday night but cheating allegations were levelled at the former Lakeside champion; regarding a 70 checkout during his match against Gabriel Clemens.\r\nDarts fans took to social media to say that the… [+906 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Dani Ceballos shares Zinedine Zidane message on future amid Arsenal transfer talk - Mirror Online", "description": "Arsenal are believed to be keen on signing Real Madrid midfielder permanently following loan spell, but Ceballos has revealed Zidane conversation which could decide his future", "url": "https://www.mirror.co.uk/sport/football/transfer-news/dani-ceballos-shares-zinedine-zidane-21924432", "urlToImage": null, "publishedAt": "2020-04-25T12:57:55Z", "content": "Dani Ceballos has shared a message from Zinedine Zidane about his Real Madrid future amid speculation Arsenal will bid to sign him permanently. \r\nCeballos has spent the season on loan with the Gunners from Madrid, and Arsenal are believed to be keen on signin… [+1801 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Coronavirus: EFL warns 'suitable testing' must be in place before football returns - Sky Sports", "description": "The English Football League (EFL) has warned that football cannot resume before adequate testing arrangements are in place for coronavirus.", "url": "https://www.skysports.com/football/news/11095/11978675/coronavirus-efl-warns-suitable-testing-must-be-in-place-before-football-returns", "urlToImage": null, "publishedAt": "2020-04-25T12:55:49Z", "content": "The English Football League (EFL) has warned that football cannot resume before adequate testing arrangements are in place for coronavirus.\r\nIt follows reports that the Premier League has stepped up planning for a return behind closed doors as early as June.\r… [+1282 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Joe Marler: England prop will not miss match during 10-week ban for genital grab - BBC South East Wales", "description": "England prop Joe Marler's 10-week ban for grabbing Alun Wyn Jones' genitals will end without him missing a match because of the coronavirus lockdown.", "url": "https://www.bbc.co.uk/sport/rugby-union/52424599", "urlToImage": null, "publishedAt": "2020-04-25T12:28:39Z", "content": "Joe Marler's grab on Alun Wyn Jones went unnoticed by officials at the time\r\nEngland prop Joe Marler's 10-week ban for grabbing Alun Wyn Jones' genitals will end without him missing a match because of the coronavirus lockdown.\r\nMarler was suspended on 12 Marc… [+946 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Tom Leach", "title": "Frank Lampard opens talks with Belgium star as Chelsea look to seal free transfer - Football.London", "description": "The Napoli star was a Chelsea target in the January transfer window, but decided to stay in Italy until the end of the season", "url": "https://www.football.london/chelsea-fc/transfer-news/chelsea-napoli-lampard-dries-mertens-18149824", "urlToImage": null, "publishedAt": "2020-04-25T12:20:38Z", "content": "Chelsea boss Frank Lampard has held talks with Napoli star Dries Mertens, according to reports in Italy.\r\nMertens has been linked with a move to the Premier League on a number of occasions in recent seasons with Manchester City and Manchester United both also… [+1029 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Jon Doel", "title": "Wales on brink of stunning world rugby and ditching Bill Beaumont amid late drama - reports - Wales Online", "description": "The race to become World Rugby chairman may be about to take a huge twist", "url": "https://www.walesonline.co.uk/sport/rugby/rugby-news/wales-brink-stunning-world-rugby-18149672", "urlToImage": null, "publishedAt": "2020-04-25T12:15:32Z", "content": "Wales could be the country to blow apart Bill Beaumont's hopes of winning the race to remain World Rugby chairman, according to reports.\r\nBeaumont has widely been expected to receive the backing of all Six Nations countries in his battle with Agustin Pichot, … [+1060 chars]"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Daniel Marland", "title": "Cristiano Ronaldo Rejoining Man Utd This Summer ‘Would Not Be A Surprise’ - SPORTbible", "description": "This would be one of the biggest transfer stories of all time.", "url": "https://www.sportbible.com/football/football-news-transfers-ronaldo-rejoining-man-utd-this-summer-would-not-be-a-surprise-20200425", "urlToImage": null, "publishedAt": "2020-04-25T12:07:11Z", "content": "Manchester United completing the shock re-signing of Cristiano Ronaldo this summer 'would not be a surprise' according says to a top European club chief.\r\nThe 35-year-old has been linked with a move away from current club Juventus due to their current financi… [+2326 chars]"}, {"source": {"id": "talksport", "name": "TalkSport"}, "author": "Joe Coleman", "title": "David Haye considering incredible boxing comeback to fight the winner of Tyson Fury vs Anthony Joshua - talkSPORT.com", "description": "", "url": "http://talksport.com/sport/boxing/698874/haye-boxing-comeback-news-fight-tyson-fury-joshua/", "urlToImage": null, "publishedAt": "2020-04-25T11:56:55Z", "content": "David Haye has admitted he would only consider a return to boxing if he was guaranteed to fight the winner of Anthony Joshua vs Tyson Fury.\r\nHowever, the Bermondsey-born slugger admitted it was unlikely the call would ever come and says he was content with st… [+2425 chars]"}, {"source": {"id": null, "name": "Chelseafc.com"}, "author": null, "title": "Coronavirus update: Chelsea statement on employees, tickets, men's first team and community help - Chelsea FC", "description": "The board of Chelsea Football Club would like to update our fans, our staff, our community and our other stakeholders of certain actions the club is taking during the coronavirus crisis.", "url": "https://www.chelseafc.com/en/news/2020/04/25/club-update-on-coronavirus-initiatives-for-staff--supporters-and", "urlToImage": null, "publishedAt": "2020-04-25T11:17:31Z", "content": "The board, guided by club owner Roman Abramovich, has agreed on a number of initiatives aimed at ensuring the financial well-being of our staff as well as supporting our fans and the wider community.Employees\r\nThe club can confirm we will not be taking advant… [+2981 chars]"}, {"source": {"id": null, "name": "Dartsnews.com"}, "author": null, "title": "Kleermaker doesn't need a 'kick up the backside' anymore due to PDC Home Tour: 'There is finally something to look forward to' - Dartsnews.com", "description": "Martijn Kleermaker says he occasionally needed 'a kick up the backside' to start practicing. The PDC Home Tour gives him some new motivation.", "url": "https://dartsnews.com/kleermaker-doesnt-need-a-kick-up-the-backside-anymore-due-to-pdc-home-tour-there-is-finally-something-to-look-forward-to/", "urlToImage": null, "publishedAt": "2020-04-25T11:08:38Z", "content": "Martijn Kleermaker made the switch to the PDC at the beginning of this year to compete against the world’s best players every week. However, the Dutch Giant has been at home for weeks due to the corona crisis.\r\nThe 29-year-old Dutchman claimed his PDC Tour Ca… [+6800 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Report: Spurs could suffer major financial blow after UEFA decision - The Spurs Web", "description": "Tottenham Hotspur could be set to suffer a major financial blow in revenue generated from European football if the season is decided on a points-per-game basis, the Evening Standard report. It was revealed on Thursday that UEFA were considering using a points…", "url": "https://www.spurs-web.com/spurs-news/report-spurs-could-suffer-major-financial-blow-after-uefa-decision/", "urlToImage": null, "publishedAt": "2020-04-25T11:00:00Z", "content": "Tottenham Hotspur could be set to suffer a major financial blow in revenue generated from European football if the season is decided on a points-per-game basis, the Evening Standard report.\r\nIt was revealed on Thursday that UEFA were considering using a point… [+1358 chars]"}, {"source": {"id": null, "name": "Autosport.com"}, "author": "Pablo Elizalde", "title": "F1 News: Sainz Jr says losing 2020 season over coronavirus would be hard to accept - Autosport", "description": "McLaren driver Carlos Sainz Jr says the 2020 Formula 1 season being cancelled because of the coronavirus crisis would be a \"hard blow that would be difficult to accept\"", "url": "https://www.autosport.com/f1/news/149146/sainz-losing-20-f1-season-would-be-hard-to-accept", "urlToImage": null, "publishedAt": "2020-04-25T10:02:44Z", "content": "McLaren driver Carlos Sainz Jr says the 2020 Formula 1 season being cancelled because of the coronavirus crisis would be a \"hard blow that would be difficult to accept\". \r\nThe first nine races of the season have already been cancelled or postponed, with the F… [+2679 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Every Goal of LFC's 98/99 Season | Berger's unstoppable strikes - Liverpool FC", "description": "Michael Owen would be in scintillating form throughout the 98/99 season notching 18 Premier League goals in the process with strike partner Robbie Fowler hit...", "url": "https://www.youtube.com/watch?v=Td0c_imaZ_U", "urlToImage": null, "publishedAt": "2020-04-25T10:00:27Z", "content": null}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "NFL Draft 2020: Teams set wide receiver record on Day Two - Sky Sports", "description": "Wide receivers flew off the board on a busy Day Two of the 2020 NFL Draft.", "url": "https://www.skysports.com/nfl/news/12118/11978575/nfl-draft-2020-teams-set-wide-receiver-record-on-day-two", "urlToImage": null, "publishedAt": "2020-04-25T09:58:40Z", "content": "Teams continued to dip into the 2020 NFL Draft's deep receiver class on Friday, with the Cincinnati Bengals kicking off the run at the top of Round Two by grabbing Clemson wideout Tee Higgins.\r\nAfter six wideouts went in Round One, Round Two began with two in… [+4635 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "London Marathon: Back-garden runners prepare for 2.6 Challenge - BBC Sport", "description": "The London Marathon might be postponed but runners are still getting in the miles and raising money for charity - here are some of their inspiring stories.", "url": "https://www.bbc.co.uk/sport/athletics/52418660", "urlToImage": null, "publishedAt": "2020-04-25T09:51:00Z", "content": "Sunday was supposed to be the culmination of more than a million training miles and the collection of many millions more for good causes around the country and world.\r\nFor some, despite the London Marathons postponement until October, it still will be.\r\nThe 2… [+8354 chars]"}, {"source": {"id": null, "name": "Derrynow.com"}, "author": "Staff reporter", "title": "Police hand out 166 notices in the Derry council area to people who have broken coronavirus lockdown restrictions - Derry Now", "description": "Public urged to follow the guidelines and stop the spread of the disease", "url": "https://www.derrynow.com/news/news/537819/police-hand-out-166-notices-in-the-derry-council-area-to-people-who-have-broken-coronavirus-lockdown-restrictions.html", "urlToImage": null, "publishedAt": "2020-04-25T09:42:00Z", "content": "Police have handed out 166 notices in the Derry council area to people who have broken lockdown restrictions.\r\nThe PSNI said that from the period between March 30 and April 24 its officers handed out a total of 52 Penalty Notices for Disorder (PND) in the Der… [+1123 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Kit Holden for MailOnline", "title": "German fans are NOT happy that the Bundesliga set to return with concerns growing over May 9 date - Daily Mail", "description": "KIT HOLDEN: With the Olympics and the Euros suspended and no end in sight to the freeze on other football leagues, there will be millions hoping to get some kind of fix from Germany.", "url": "https://www.dailymail.co.uk/sport/sportsnews/article-8253367/German-fans-NOT-happy-Bundesliga-set-return-concerns-growing-9-date.html", "urlToImage": null, "publishedAt": "2020-04-25T09:33:17Z", "content": "With the Bundesliga planning to resume behind closed doors from May 9, the eyes of sports fans across the world could be trained on Germany next month.\r\nWith the Olympics and the Euros suspended, the global tennis tours on hold and no end in sight to the free… [+5770 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "London Marathon: Delayed race could feature elite athletes only - BBC News", "description": "This year's postponed London Marathon could be staged with elite athletes only, says race director Hugh Brasher.", "url": "https://www.bbc.co.uk/sport/athletics/52423940", "urlToImage": null, "publishedAt": "2020-04-25T09:14:00Z", "content": "Kenyan world record holders Kipchoge and Brigid Kosgei are due to defend their titles at the 40th London Marathon\r\nThis year's postponed London Marathon could be staged with elite athletes only, says race director Hugh Brasher.\r\nBrasher said that was one of 1… [+1103 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "West Indies 'flexible' on new Test dates against England - Sky Sports", "description": "Cricket West Indies says it is \"flexible\" about rearranging a Test tour of England but the governing body insists it will not jeopardise the safety of players.", "url": "https://www.skysports.com/cricket/news/12123/11978552/west-indies-flexible-on-new-test-dates-against-england", "urlToImage": null, "publishedAt": "2020-04-25T08:42:39Z", "content": "Cricket West Indies says it is \"flexible\" about rearranging a Test tour of England but the governing body insists it will not jeopardise the safety of players in order to complete the three-match series.\r\nIn a series that counts towards the World Test Champio… [+2902 chars]"}, {"source": {"id": null, "name": "Football365.com"}, "author": "Matthew Stead", "title": "Man Utd offered Di Maria and six other players in part-exchange for Pogba - Football365.com", "description": "Football365 - Man Utd might find Douglas Costa and Alex Sandro 'pleasing' options for a Paul Pogba swap. Angel di Maria? Surely less so.", "url": "https://www.football365.com/news/paul-pogba-man-utd-swap-angel-di-maria-alex-sandro", "urlToImage": null, "publishedAt": "2020-04-25T08:33:45Z", "content": "Angel di Maria is one of a number of players that could be offered to Man Utd in part-exchange for Paul Pogba.\r\nPogba still seems likely to leave Man Utd this summer, with the club thus far opting not to activate the automatic one-year extension option in his… [+1285 chars]"}, {"source": {"id": null, "name": "Tennisworldusa.org"}, "author": "Simone Brugnoli", "title": "Novak Djokovic reveals the key behind his supreme mental strength - Tennis World USA", "description": "The Serbian is well-known for being perhaps the toughest player tennis has ever seen in the biggest moments", "url": "https://www.tennisworldusa.org/tennis/news/Novak_Djokovic/86873/novak-djokovic-reveals-the-key-behind-his-supreme-mental-strength/", "urlToImage": null, "publishedAt": "2020-04-25T08:18:25Z", "content": "Novak Djokovic has shown on more than one occasion that he is one of the mentally strongest tennis players in the history of this sport. Just think of the two match points canceled in the 2019 Wimbledon final, when everything now seemed set for Roger Federer'… [+1440 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "NFL Draft: Tee Higgins joins Joe Burrow at Cincinnati Bengals - Sky Sports", "description": "The Cincinnati Bengals followed up their first-round pick of Joe Burrow by selecting Tee Higgins, who has declared the duo are \"about to tear it up\".", "url": "https://www.skysports.com/nfl/news/12118/11978531/nfl-draft-tee-higgins-joins-joe-burrow-at-cincinnati-bengals", "urlToImage": null, "publishedAt": "2020-04-25T07:29:15Z", "content": "The Cincinnati Bengals followed up their first-round pick of quarterback Joe Burrow by selecting wide receiver Tee Higgins, who has declared the duo are \"about to tear it up\" in the NFL.\r\nThe Bengals picked Clemson's Higgins - who grew up supporting the side … [+1441 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Guardian sport", "title": "Philadelphia Eagles surprise with Jalen Hurts pick on day two of NFL draft - The Guardian", "description": "The Eagles selected Oklahoma quarterback Jalen Hurts in the second round of the NFL draft on Friday, a stunning move for a team with more pressing needs", "url": "https://www.theguardian.com/sport/2020/apr/25/nfl-draft-picks-day-two-jalen-hurts", "urlToImage": null, "publishedAt": "2020-04-25T04:20:00Z", "content": "After giving Carson Wentz a playmaker, the Philadelphia Eagles drafted his backup.\r\nThe Eagles selected Oklahoma quarterback Jalen Hurts in the second round of the NFL draft on Friday night, a stunning move for a team with more pressing needs.\r\nPhiladelphia h… [+10012 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Liverpool's Champions League match with Atletico Madrid to be investigated by city's council - Sky Sports", "description": "Liverpool's Champions League match against Atletico Madrid will be investigated by the city's council.", "url": "https://www.skysports.com/football/news/11669/11978495/liverpools-champions-league-match-with-atletico-madrid-to-be-investigated-by-citys-council", "urlToImage": null, "publishedAt": "2020-04-24T22:15:01Z", "content": "An academic study into the impact Liverpool's Champions League match against Atletico Madrid might have had on the spread of coronavirus will be undertaken by the city's council.\r\nOver 52,000 fans, 3,000 of them from Madrid which was under a partial lockdown,… [+1211 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Alex Raskin Sports News Editor For Dailymail.com Associated Press", "title": "Video shows Bucs rookie and Tom Brady's newest blocker Tristan Wirfs jumping out of pool - Daily Mail", "description": "Tampa Bay Buccaneers first-round pick Tristan Wirfs weighs well over 300 pounds, but the offensive tackle and Tom Brady's newest blocker is still athletic enough to jump out of a pool onto his feet.", "url": "https://www.dailymail.co.uk/news/article-8254551/Video-shows-Bucs-rookie-Tom-Bradys-newest-blocker-Tristan-Wirfs-jumping-pool.html", "urlToImage": null, "publishedAt": "2020-04-24T20:51:27Z", "content": "The Buccaneers drafted Tristan Wirfs to address an opening at right tackle \r\nTampa Bay Buccaneers first-round pick Tristan Wirfs weighs well over 300 pounds, but the offensive tackle and Tom Brady's newest blocker is still athletic enough to launch himself ou… [+3438 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Is Jamie Carragher RIGHT?! Fernando Torres' flabbergasting move from Liverpool to Chelsea | ESPN FC - ESPN UK", "description": "Craig Burley and Julien Laurens join Dan Thomas on ESPN FC to react to recent comments made by former Liverpool defender Jamie Carragher and former Chelsea c...", "url": "https://www.youtube.com/watch?v=hoRBD5aVqVk", "urlToImage": null, "publishedAt": "2020-04-24T19:51:55Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Mike Tyson confirms he's training to get back in the boxing ring - Mirror Online", "description": "Tyson has not fought since 2005 but explained how he was putting his body through intense workouts in a bid to get fighting fit ahead of a potential comeback for charity", "url": "https://www.mirror.co.uk/sport/boxing/mike-tyson-confirms-hes-training-21921811", "urlToImage": null, "publishedAt": "2020-04-24T19:38:14Z", "content": "Mike Tyson has revealed he has been training with view to making a return to the ring in some boxing exhibitions. \r\nThe former undisputed world heavyweight champion has not fought professionally since retiring after the sixth round of his bout with Kevin McBr… [+1731 chars]"}, {"source": {"id": null, "name": "Tbrfootball.com"}, "author": "Will Butcher", "title": "Tottenham fans react as club reportedly offered Barcelona duo Semedo and Umtiti - TBR - The Boot Room - Football News", "description": "Tottenham Hotspur have reportedly been offered the chance to sign Barcelona duo Nelson Semedo and Samuel Umtiti in a swap deal for midfielder Tanguy Ndombele – and Spurs supporters have reacted on Twitter. Sky Sports have claimed that 23-year-old, club-record…", "url": "https://tbrfootball.com/tottenham-fans-react-as-club-reportedly-offered-barcelona-duo-semedo-and-umtiti/", "urlToImage": null, "publishedAt": "2020-04-24T19:10:38Z", "content": "Tottenham Hotspur have reportedly been offered the chance to sign Barcelona duo Nelson Semedo and Samuel Umtiti in a swap deal for midfielder Tanguy Ndombele and Spurs supporters have reacted on Twitter.\r\nSky Sports have claimed that 23-year-old, club-record … [+1749 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Suzanne Wrack", "title": "Who could replace Phil Neville as England Women's manager? - The Guardian", "description": "We run the rule over leading candidates, including a two-times World Cup winner and a woman who worked as Neville’s No 2", "url": "https://www.theguardian.com/football/2020/apr/24/who-could-replace-phil-neville-as-england-womens-manager", "urlToImage": null, "publishedAt": "2020-04-24T18:00:00Z", "content": "The Football Associations hunt for a successor to Mark Sampson in 2017 quickly became a circus. Names flew out of the ring as fast as they stepped in. Increased scrutiny on the person in charge, with the game professionalising, led some of those on the shortl… [+4734 chars]"}, {"source": {"id": null, "name": "Derbytelegraph.co.uk"}, "author": "Chris Watson", "title": "Derby County favourite has contract terminated by Championship club - Derbyshire Live", "description": "The former Rams midfielder and coach had been part of Graeme Jones' backroom staff at Luton Town", "url": "https://www.derbytelegraph.co.uk/sport/football/football-news/inigo-idiakez-derby-luton-harford-4076842", "urlToImage": null, "publishedAt": "2020-04-24T15:19:00Z", "content": "Derby County favourite Inigo Idiakez has lost his job at Sky Bet Championship club Luton Town.\r\nIdiakez had been first-team coach at Kenilworth Road but has had his contract terminated with immediate effect, along with manager Graeme Jones, assistant boss Gar… [+2928 chars]"}]}