{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Liverpool boss Jurgen Klopp had two reasons for contacting Kylian Mbappe's dad - Mirror Online", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiVWh0dHBzOi8vd3d3Lm1pcnJvci5jby51ay9zcG9ydC9mb290YmFsbC9uZXdzL2xpdmVycG9vbC1ib3NzLWp1cmdlbi1rbG9wcC10d28tMjE5Mjg1NzfSAVlodHRwczovL3d3dy5taXJyb3IuY28udWsvc3BvcnQvZm9vdGJhbGwvbmV3cy9saXZlcnBvb2wtYm9zcy1qdXJnZW4ta2xvcHAtdHdvLTIxOTI4NTc3LmFtcA?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T12:43:52Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Jake Polden", "title": "Cristiano Ronaldo's telling reaction to Lionel Messi winning sixth Ballon d'Or award - Mirror Online", "description": "Last year's Ballon d'Or ceremony was one of the most important in recent history because it separated Lionel Messi and Cristiano Ronaldo - perhaps even for good", "url": "https://www.mirror.co.uk/sport/football/news/cristiano-ronaldos-telling-reacting-lionel-21928148", "urlToImage": null, "publishedAt": "2020-04-26T12:43:40Z", "content": "Lionel Messi or Cristiano Ronaldo?\r\nIt's one of football's biggest debates, with fans on both side of the fence putting forward convincing arguments as to why their favourite is the best player on the planet.\r\nThe careers of the two footballing Goliaths have … [+1698 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Roy Keane's harshest put downs as Jamie Carragher and Paul Pogba among those slated - Mirror Online", "description": "A number of figures across football have been on the receiving end of a tongue-lashing from Keane, who went via the dugout to swap life as Man Utd's skipper for a spot in the pundits chair", "url": "https://www.mirror.co.uk/sport/football/news/roy-keanes-harshest-put-downs-21905979", "urlToImage": null, "publishedAt": "2020-04-26T12:43:38Z", "content": "Roy Keane has never been a man to mince his words - be it on the pitch or off the pitch. \r\n The Irishman helped form the backbone of the Man Utd side which was dominant in the 90s, with Keane chief disciplinarian in his role as captain. \r\nHis penchant to dish… [+6496 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Neil Moxley", "title": "Forget Allegri - Steve Bruce deserves Newcastle chance he's waited his whole life for - Mirror Online", "description": "Bruce has left every club he's managed in a better state than he found it in - but he's never had the chance to work with the riches he could be about to enjoy at St James' Park", "url": "https://www.mirror.co.uk/sport/football/news/forget-allegri-steve-bruce-deserves-21927929", "urlToImage": null, "publishedAt": "2020-04-26T12:43:31Z", "content": "Max Allegri, Mauricio Pochettino, Roberto Mancini all poised to become the next Newcastle United manager.\r\nSteve Bruce must feel honoured.\r\nEight months ago, the trio would have struggled to pin-point the city on a map now theyre being shortlisted for a job t… [+3480 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Paul Gorst", "title": "Liverpool prove Pep Guardiola's Premier League title theory wrong and set new standards - Liverpool Echo", "description": "Twelve months ago, the battle for the Premier League title was well and truly on - but it is much different this time around", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-prove-pep-guardiolas-premier-18152485", "urlToImage": null, "publishedAt": "2020-04-26T12:31:46Z", "content": "Twelve months ago, the battle for the Premier League title was well and truly on.\r\nIn the red corner, Jurgen Klopp's Liverpool, top of the table on 91 points having beaten Huddersfield at Anfield 5-0.\r\nIn the blue corner, Pep Guardiola and his Manchester City… [+3319 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Newcastle takeover: The Sunday Supplement view on Saudi-based consortium amid scrutiny - Sky Sports", "description": "Newcastle's proposed takeover by a Saudi-backed consortium has come under widespread scrutiny - but what do the Sunday Supplement panel make of it?", "url": "https://www.skysports.com/football/news/11678/11979008/newcastle-takeover-the-sunday-supplement-view-on-saudi-based-consortium-amid-scrutiny", "urlToImage": null, "publishedAt": "2020-04-26T12:23:18Z", "content": "Newcastle's proposed takeover by a Saudi-backed consortium has come under widespread scrutiny - but what do the Sunday Supplement panel make of the Premier League's prospective newest owners?\r\nSky Sports News has reported that PCP Capital Partners' proposed t… [+6523 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Jonathan McFarlane", "title": "Neil McCann teases Scott Brown over Rangers past with quick-witted response to Celtic skipper's joke - Daily Record", "description": "The pair were on BBC radio and shared a laugh during the debate on the SPFL.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/neil-mccann-teases-scott-brown-21928622", "urlToImage": null, "publishedAt": "2020-04-26T12:15:09Z", "content": "Rangers legend Neil McCann has teased Celtic skipper Scott Brown over images of him in the Govan club's strip. \r\n Pictures of the veteran midfielder wearing a Rangers top as a youth regularly circulate social media in a bid to wind up opposition fans and McCa… [+2142 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "ALEX YOUNG", "title": "Heung-min Son military training: Tottenham star shows off new haircut after first week - Evening Standard", "description": "", "url": "https://www.standard.co.uk/sport/football/tottenham-heungmin-son-military-training-pictures-south-korea-hair-cut-a4424341.html", "urlToImage": null, "publishedAt": "2020-04-26T12:13:29Z", "content": "Tottenham star Heung-min Son isn't the only one sporting a sharper look during the coronavirus lockdown.\r\nSon, though, has not been forced to go clippers in hand due to a lack of available hairdressers, rather photos have emerged of Son with a supposed milita… [+844 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Ollie Lewis For Mailonline", "title": "Coronavirus: Boxing event takes place in Nicaragua with fighters sprayed in disinfectant - Daily Mail", "description": "With the world pretty much devoid of sports events because of the spread of the deadly disease, an eight-fight card was televised in front of a live, though sparse audience in Managua.", "url": "https://www.dailymail.co.uk/sport/sportsnews/article-8258251/Coronavirus-Boxing-event-takes-place-Nicaragua-promotor-insists-boxers-need-eat.html", "urlToImage": null, "publishedAt": "2020-04-26T12:09:58Z", "content": "Boxing continued in a surprise location on Saturday night with Nicaragua hosting a controversial event that saw fighters sprayed with disinfectant and ring girls donning face masks amid the coronavirus pandemic. \r\nWith the world pretty much devoid of sports e… [+3959 chars]"}, {"source": {"id": null, "name": "Coventrytelegraph.net"}, "author": "Jordan Blackwell", "title": "Coventry's Championship bid could be decided by mini-tournament as EFL release new statement - Coventry Telegraph", "description": "The latest Coventry City headlines,", "url": "https://www.coventrytelegraph.net/sport/football/football-news/coventrys-championship-bid-could-decided-18151874", "urlToImage": null, "publishedAt": "2020-04-26T11:55:28Z", "content": "Mini-tournament to decide promotion proposed\r\nCoventry Citys season could be concluded with a mini-tournament between League Ones top eight clubs.\r\nWhile the EFL aim to finish the campaign with the remaining fixtures played as normal, contingency plans have b… [+3581 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Richard Forrester", "title": "England hero Gary Lineker reveals all about moment he pooed himself on pitch at Italia ’90 and says it ‘just w - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11483219/england-gary-lineker-moment-pooed-himself/", "urlToImage": null, "publishedAt": "2020-04-26T11:51:44Z", "content": "ENGLAND hero Gary Lineker has recalled how his performance at the World Cup in 1990 got off to a stinker - after pooing himself on the pitch.\r\nThe striker helped the Three Lions reach the semi-final of the tournament in Italy under legendary boss Sir Bobby Ro… [+2686 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ben Husband", "title": "The Sean Dyche comments which prompted Aston Villa 'interest' - Birmingham Live", "description": "Reports in the national press have suggested Aston Villa bosses could look towards the Burnley manager", "url": "https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-news-sean-dyche-18152247", "urlToImage": null, "publishedAt": "2020-04-26T11:43:18Z", "content": "Sean Dyche has emerged as a shock candidate to replace Aston Villa boss Dean Smith, according to reports in the national press. \r\nThe Burnley manager has guided the Clarets to a period of real success, taking them to their highest league finish in over 40 yea… [+1983 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Caoimhe O'Neill", "title": "Liverpool news and transfers LIVE - Depay's transfer message - Liverpool Echo", "description": "Latest Liverpool news and transfer rumours as Memphis Depay sends Virgil van Dijk transfer message, Kylian Mbappe 'call made' and Dries Mertens linked", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-news-transfers-live-mbappe-18150227", "urlToImage": null, "publishedAt": "2020-04-26T11:29:11Z", "content": "Lyon winger Memphis Depay has sent Virgil van Dijk a very inspired transfer rap message.The former Man United player shared a clip to social media rapping about his Netherlands team-mate.As cited by the MEN, Depay began: “It is on. Captain of the nation, What… [+670 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Alan Pardew: Den Haag manager rubbishes bonus payment claims - BBC Sport", "description": "Alan Pardew says he will not take a bonus payment for keeping Den Haag up after the Dutch Eredivisie is abandoned.", "url": "https://www.bbc.co.uk/sport/football/52431031", "urlToImage": null, "publishedAt": "2020-04-26T11:21:09Z", "content": "Pardew took charge of ADO Den Haag in December\r\nAlan Pardew says reports stating he will receive a bonus payment for avoiding relegation with Den Haag are \"nonsense\".\r\nThe Dutch Eredivisie season was abandoned on Friday because of coronavirus with no sides re… [+2014 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Dan Ripley for MailOnline", "title": "How Tottenham Hotspur have become football's pariahs during the coronavirus pandemic - Daily Mail", "description": "During the coronavirus pandemic Spurs have walked into one PR gaffe after another ranging from cutting non-playing staff pay, to multiple training sessions breaking social distancing rules.", "url": "https://www.dailymail.co.uk/sport/football/article-8245133/How-Tottenham-Hotspur-footballs-pariahs-coronavirus-pandemic.html", "urlToImage": null, "publishedAt": "2020-04-26T10:59:52Z", "content": "2020 OLYMPIC GAMES  \r\nThe 2020 Olympic Games has been postponed until 2021 on March 24 - becoming one of the last major sporting events this summer to fall victim to the coronavirus.\r\nJapanese prime minister Shinzo Abe held a crucial conference call with Olym… [+24811 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Isobel Frodsham, news reporter", "title": "Coronavirus: London Marathon runners undertake 2.6 Challenge to help charities - Sky News", "description": "With the London Marathon cancelled amid the coronavirus background, many are taking in part in the 2.6 Challenge instead.", "url": "https://news.sky.com/story/coronavirus-london-marathon-runners-undertake-2-6-challenge-to-help-charities-11978979", "urlToImage": null, "publishedAt": "2020-04-26T10:51:05Z", "content": null}, {"source": {"id": null, "name": "Teamtalk.com"}, "author": null, "title": "Solskjaer had nine player Man Utd shortlist before Woodward statement - Teamtalk.com", "description": "Manchester United boss Ole Gunnar Solskjaer has reportedly been forced to rip up his transfer plans due to the current financial effects on the game.", "url": "https://www.teamtalk.com/news/woodward-scuppers-solskjaer-nine-player-man-utd-shortlist", "urlToImage": null, "publishedAt": "2020-04-26T10:31:08Z", "content": "Manchester United boss Ole Gunnar Solskjaer has reportedly been forced to rip up his transfer plans due to the current financial effects on the game.\r\nExecutive vice-chairman Ed Woodward has played down expectations that United will spend big this summer, tel… [+2141 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ben Husband", "title": "West Brom and Leeds United decision could lead to 'legal challenges' - Birmingham Live", "description": "The Liverpool legend has suggested that the season must be completed, even if fans can't be in attendance", "url": "https://www.birminghammail.co.uk/sport/football/football-news/west-brom-leeds-united-decision-18152046", "urlToImage": null, "publishedAt": "2020-04-26T10:29:57Z", "content": "Liverpool legend Robbie Fowler has warned the Football Association that they will be subject to legal challenges, if they void the season.\r\nAll elite football in the UK has been suspended since mid-March, with fears now rising that the season could be cancell… [+2219 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Tom Brady: Tampa mayor Jane Castor writes witty letter to Buccaneers - BBC News", "description": "The mayor of Tampa hints she is open to renaming the Tampa Bay area as she writes a witty apology to Tom Brady after he is thrown out of a city park.", "url": "https://www.bbc.co.uk/sport/american-football/52431025", "urlToImage": null, "publishedAt": "2020-04-26T10:29:22Z", "content": "Media playback is not supported on this device\r\nWatch: Tom Brady's top 10 moments\r\nOne minute Tom Brady is being thrown out of a Tampa park, the next the city's mayor is cheerfully apologising and hinting the area could one day be renamed if the quarterback d… [+1899 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Dan Kay", "title": "Roberto Firmino's tunnel reaction to Sadio Mane and Mohamed Salah row set tone for stellar Liverpool season - Liverpool Echo", "description": "Bobby's 'side-eye' to camera was one of funniest moments of Liverpool's season but also gave snapshot into mentality which has proved so successful", "url": "https://www.liverpoolecho.co.uk/sport/football/liverpool-mane-firmino-salah-burnley-18151271", "urlToImage": null, "publishedAt": "2020-04-26T10:22:12Z", "content": "If there is one thing this Liverpool team is renowned for, it is their unity, togetherness and team spirit. \r\n There have been numerous examples of it on and off the field and is one of the aspects Liverpudlians have enjoyed most during the rise to top of the… [+6710 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Samuel Luckhurst", "title": "David de Gea speaks out on Manchester United future amid Dean Henderson challenge - Manchester Evening News", "description": "Man United agreed a new contract with David de Gea last year but Dean Henderson has been in fabulous form on loan at Sheffield United.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-united-de-gea-henderson-18152297", "urlToImage": null, "publishedAt": "2020-04-26T10:17:33Z", "content": "David de Gea intends to stay at Manchester United for more than 10 years amid the challenge of Dean Henderson.\r\nDe Gea, 29, signed a new four-year contract with United in September and will celebrate 10 years at the club next year, having arrived as a 20-year… [+2407 chars]"}, {"source": {"id": null, "name": "Racingpost.com"}, "author": "Peter Scargill", "title": "Ralph Beckett and Mark Johnston call for resignation of BHA chief executive - Racing Post", "description": "A group of leading trainers have called for the immediate resignation of BHA chief executive Nick Rust", "url": "https://www.racingpost.com/news/beckett-and-johnston-call-for-resignation-of-bha-chief-executive/432444", "urlToImage": null, "publishedAt": "2020-04-26T10:15:35Z", "content": "By Peter Scargill \r\n UPDATED 11:19AM, APR 26 2020\r\nRalph Beckett and Mark Johnston have written to the BHA asking for the immediate resignation of its chief executive Nick Rust in the midst of the coronavirus crisis, according to a report in the Sunday Telegr… [+3386 chars]"}, {"source": {"id": null, "name": "Motorsport.com"}, "author": "Jonathan Noble", "title": "Leclerc: Bianchi deserved Ferrari seat more than me - Motorsport.com", "description": "Charles Leclerc says close friend Jules Bianchi probably deserved a Ferrari Formula 1 race seat more than him – and would have delivered better results than he has so far.", "url": "https://www.motorsport.com/f1/news/leclerc-jules-bianchi-ferrari-todt/4784955/", "urlToImage": null, "publishedAt": "2020-04-26T10:14:00Z", "content": "Last week, Renault driver Daniel Ricciardo listed Bianchi as one of his most underrated rivals, and suggested that the Frenchman would have been as big a star at Ferrari as Leclerc has become, were it not for his death as the result of injuries sustained in a… [+1681 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Richard Fay", "title": "Manchester United transfer target James Maddison drops fresh hint on his future - Manchester Evening News", "description": "Man Utd are interested in a move for Leicester midfielder James Maddison once the transfer market opens.", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/man-utd-maddison-transfer-news-18152223", "urlToImage": null, "publishedAt": "2020-04-26T10:06:28Z", "content": "Manchester United target James Maddison insists he is still very happy to be playing for Leicester despite strong suggestions he could leave this summer.\r\nThe 23-year-old is a current target for United ahead of the summer transfer window as Ole Gunnar Solskja… [+1284 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Barney Ronay", "title": "World Cup questions: Were England robbed by Argentina at Mexico 86? - The Guardian", "description": "With the help of the Fifa archive we rewatch a series of memorable games in search of answers we didn’t find at the time", "url": "https://www.theguardian.com/football/2020/apr/26/world-cup-questions-were-england-robbed-by-argentina-at-mexico-86", "urlToImage": null, "publishedAt": "2020-04-26T10:03:00Z", "content": "You can take our freedom. But you cant take our grainy old football videos. In this short series I will be exploring the contents of Fifas newly released World Cup archive; revisiting World Cup lore and World Cup truisms, and finding out if staring at them in… [+15862 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Melissa Reddy", "title": "Arsenal players allowed to return to training 46 days after Mikel Arteta contracted coronavirus - The Independent", "description": "Premier League was suspended after Arteta was diagnosed with Covid-19, with players set to be allowed to return to the club’s London Colney base with strict guidelines in place and a rotation schedule", "url": "https://www.independent.co.uk/sport/football/premier-league/arsenal-training-coronavirus-mikel-arteta-london-colney-a9484396.html", "urlToImage": null, "publishedAt": "2020-04-26T09:33:01Z", "content": "Arsenals squad will be permitted to train at their London Colney base from Monday under carefully controlled conditions for the first time since Mikel Arteta tested positive for coronavirus.\r\nThe partial reopening of the facility comes 46 days after the manag… [+1503 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ashley Preece", "title": "EFL issue statement as West Brom hero pokes fun at Wolves - Birmingham Live", "description": "West Bromwich Albion daily digest - Here's a round-up of the latest Albion stories via BirminghamLive, including goal-hero Robert Earnshaw reliving The Great Escape", "url": "https://www.birminghammail.co.uk/sport/football/football-news/efl-issue-statement-west-brom-18151514", "urlToImage": null, "publishedAt": "2020-04-26T08:43:33Z", "content": "Reidy\r\nSteven Reid is still fondly remembered within the ranks of the West Bromwich Albion fanbase.\r\nThe versatile Irishman, who played at right-back and in defensive midfield during his four year stay at The Hawthorns returned to aid Jimmy Shan in a coaching… [+6844 chars]"}, {"source": {"id": null, "name": "Tbrfootball.com"}, "author": "Lee Connor", "title": "Aubameyang being on the way out gives Arsenal upper hand in Myron Boadu race - TBR - The Boot Room - Football News", "description": "Arsenal could have an ace up their sleeve in Pierre-Emerick Aubameyang when it comes to landing AZ Alkmaar striker, Myron Boadu. The Gunners want to sign the 19-year-old striker this summer according to a number of reports. However, AC Milan have also added B…", "url": "https://tbrfootball.com/aubameyang-being-on-the-way-out-gives-arsenal-upper-hand-in-myron-boadu-race/", "urlToImage": null, "publishedAt": "2020-04-26T08:30:38Z", "content": "Arsenal could have an ace up their sleeve in Pierre-Emerick Aubameyang when it comes to landing AZ Alkmaar striker, Myron Boadu.\r\nThe Gunners want to sign the 19-year-old striker this summer according to a number of reports. However, AC Milan have also added … [+1674 chars]"}, {"source": {"id": null, "name": "Racingpost.com"}, "author": "Jonathan Harding", "title": "Southern Legend causes Champions Mile upset to down top miler Beauty Generation - Racing Post", "description": "Southern Legend caused a major upset to deny Beauty Generation in a photo finish and claim the Group 1 Champions Mile at Sha Tin", "url": "https://www.racingpost.com/news/southern-legend-causes-champions-mile-upset-to-down-top-miler-beauty-generation/432440", "urlToImage": null, "publishedAt": "2020-04-26T08:30:02Z", "content": "Southern Legend caused a major upset to deny Beauty Generation in a photo-finish and claim Sunday's Champions Mile at Sha Tin. \r\nThe pair pulled clear in the straight and it looked as though Beauty Generation would power clear and land a historic third victor… [+2496 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Kyle Hightower", "title": "New England Patriots draft pick Justin Rohrwasser will cover up tattoo of right-wing militia group symbol - The Independent", "description": "The 159th overall pick of the 2020 Draft found himself clouded in controversy for a past tattoo that mirrors the symbol of The Three Percenters organised group", "url": "https://www.independent.co.uk/sport/us-sport/national-football-league/justin-rohrwasser-tattoo-right-wing-three-percenters-new-england-patriots-a9484366.html", "urlToImage": null, "publishedAt": "2020-04-26T08:26:47Z", "content": "New England Patriots kicker Justin Rohrwasser says a tattoo on his arm is not representative of a loosely organised right-wing militia group that has adopted the symbol.\r\nRohrwasser, who played at Rhode Island and Marshall, was taken 159th overall in the fift… [+1264 chars]"}, {"source": {"id": null, "name": "Hitc.com"}, "author": "Subhankar Mondal", "title": "Arsenal and Carlo Ancelotti reportedly want Newcastle United’s most talented player - HITC - Football, Gaming, Movies, TV, Music", "description": "Arsenal and Everton are among the clubs linked with Newcastle United’s Matty Longstaff.", "url": "https://www.hitc.com/en-gb/2020/04/26/arsenal-and-carlo-ancelotti-reportedly-want-newcastle-uniteds-mo/", "urlToImage": null, "publishedAt": "2020-04-26T08:19:56Z", "content": "Arsenal and Everton are among the clubs linked with Newcastle Uniteds Matty Longstaff.\r\nJetro Willems has said on Twitter that reported Arsenal, Everton and West Ham United target Matty Longstaff is the most talented player at Newcastle United.\r\nLongstaff is … [+1136 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Jon Boon", "title": "Mike Tyson’s three wives including one he caught having sex with Brad Pitt, one who is a doctor and ex-con s - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/11472016/mike-tyson-wives-brad-pitt-sex/", "urlToImage": null, "publishedAt": "2020-04-26T08:02:36Z", "content": "BOXING legend Mike Tyson is the most settled he's ever been.\r\nAnd that could be because of the influence of his new wife, Lakiha Spicer.\r\n Mike Tyson has married three different women in his lifetimeCredit: New York Daily News - Getty\r\nTyson's first wife Robi… [+5436 chars]"}, {"source": {"id": null, "name": "Leicestermercury.co.uk"}, "author": "Andy Turner", "title": "Leicester City face battle for 29-goal striker - reports - Leicestershire Live", "description": "Leicester City transfer news: According to fresh reports the Rangers star is back in City's sights after rumours linking him with a move to the King Power Stadium last year", "url": "https://www.leicestermercury.co.uk/sport/football/transfer-news/leicester-city-alfredo-morelos-rangers-4079441", "urlToImage": null, "publishedAt": "2020-04-26T07:44:00Z", "content": "Leicester City will have a battle on their hands to sign Rangers striker Alfredo Morelos, according to reports.\r\nThe Foxes were this week again connected with the prolific Columbian front man who was first linked with a move to City in March last year, shortl… [+2118 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Nathan Bliss", "title": "We simulated Tottenham vs Arsenal to see what could have happened in the North London Derby - Football.London", "description": "The Tottenham Hotspur Stadium would have hosted its first North London Derby this weekend, with Jose Mourinho and Mikel Arteta locking horns, but what would the score have been? We used FIFA 20 to find out.", "url": "https://www.football.london/tottenham-hotspur-fc/fixtures-results/tottenham-hotspur-arsenal-match-simulated-18146941", "urlToImage": null, "publishedAt": "2020-04-26T07:06:39Z", "content": "WIth the UK still in lockdown due to the ongoing coronavirus pandemic, this weekend's planned North London Derby between Tottenham Hotspur and Arsenal will not be played, with the safety of fans, players and staff of paramount importance.\r\nBut even though the… [+3118 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Classic Match: West Brom 0-6 Liverpool | Owen hits 100th PL goal as Reds run riot - Liverpool FC", "description": "Michael Owen netted his 100th Premier League goal as he struck four past WBA at the Hawthorns. Strike-partner Milan Baros got the other two for Gerard Houlli...", "url": "https://www.youtube.com/watch?v=UAmZPV3VOVQ", "urlToImage": null, "publishedAt": "2020-04-26T07:00:11Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Vic Marks", "title": "ECB sticking with the Hundred risks twisting cricket further into chaos - The Guardian", "description": "With cricket in turmoil the tournament’s architects have unwisely opted against shifting to a more pragmatic course", "url": "https://www.theguardian.com/sport/2020/apr/26/ecb-sticking-with-the-hundred-risks-twisting-cricket-further-into-chaos", "urlToImage": null, "publishedAt": "2020-04-26T07:00:00Z", "content": "A little window of opportunity for the England and Wales Cricket Board has been rapidly slammed shut. Everything is up for grabs; the sheets of paper in front of those in charge of our summer game have never been blanker. On Friday the ECB said there would be… [+4561 chars]"}, {"source": {"id": null, "name": "Chelseafc.com"}, "author": null, "title": "Quiz! Name every Chelsea player to make the PFA Team of the Year - Chelsea FC", "description": "On the day the PFA Awards were due to be held, we have a quiz testing your knowledge of Chelsea players to have made the Team of the Year in the Premier League era...", "url": "https://www.chelseafc.com/en/news/2020/04/26/quiz--name-every-chelsea-player-to-make-the-pfa-team-of-the-year", "urlToImage": null, "publishedAt": "2020-04-26T06:30:46Z", "content": "There are 20 Chelsea players who have been voted into a PFA Team of the Year since the formation the Premier League in 1992/93, some of them on more than one occasion. Your test in this quiz is to name as many of them as you can!To help you work them out, we … [+1297 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "SunSport Reporters", "title": "7am Man Utd news LIVE: Sancho transfer put in doubt by Woodward, Pogba to PSG, Koulibaly boost, Ronaldo LATEST - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11431662/man-utd-news-live-sancho-fernandes-transfer-latest-koulibaly/", "urlToImage": null, "publishedAt": "2020-04-26T06:27:59Z", "content": "MORNING MAN UTD FANS,\r\nEd Woodward has warned that the clubs big-money summer transfer plans for the likes of Jadon Sancho, Jack Grealish and Kalidou Koulibaly could be in jeopardy because of the coronavirus pandemic.\r\nUnited are set to tie up a permanent mov… [+1067 chars]"}, {"source": {"id": null, "name": "Hitc.com"}, "author": "Subhankar Mondal", "title": "£120m reported Jurgen Klopp target mocks Raheem Sterling, mentions a Liverpool player - HITC - Football, Gaming, Movies, TV, Music", "description": "Liverpool ace Trent Alexander-Arnold won against Manchester City star Raheem Sterling in the ePremier League Invitational.", "url": "https://www.hitc.com/en-gb/2020/04/26/120m-reported-jurgen-klopp-target-mocks-raheem-sterling-mentions/", "urlToImage": null, "publishedAt": "2020-04-26T06:15:42Z", "content": "Liverpool ace Trent Alexander-Arnold won against Manchester City star Raheem Sterling in the ePremier League Invitational.\r\nJadon Sancho has taken a playful dig at Manchester City attacking midfielder Raheem Sterling on Twitter for losing to Liverpool defende… [+1177 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Theo Squires", "title": "Virgil van Dijk threatening to do what just one man has done before at Liverpool - Liverpool Echo", "description": "No defender has ever scored a hat-trick in Premier League history but today marks 34-years since a Liverpool centre-back achieved such a feat", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpools-unlikeliest-ever-hat-trick-18124296", "urlToImage": null, "publishedAt": "2020-04-26T06:10:45Z", "content": "It is a rare feat to score a hat-trick in football. \r\nFrom the current Liverpool squad, only four players have bagged trebles and it should come as no surprise to their identities.\r\nMohamed Salah (vs Bournemouth, December 2018, and a four-goal haul vs Watford… [+3709 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Lee Wilmot", "title": "Chelsea suffer Philippe Coutinho transfer setback - Football.London", "description": "Former Liverpool man has been tipped to return to the Premier League this summer", "url": "https://www.football.london/chelsea-fc/transfer-news/chelsea-suffer-philippe-coutinho-transfer-18151832", "urlToImage": null, "publishedAt": "2020-04-26T06:05:29Z", "content": "Chelsea have been tipped to make a move for Philippe Coutinho this summer.\r\nThe Brazilian playmaker has struggled for form and regular game time since making a £142million move from Liverpool to Barcelona in 2018.\r\nCoutinho has spent this season on loan with … [+1212 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Adam Jones", "title": "Romelu Lukaku, Carlo Ancelotti and Everton's most exciting ever transfers - Liverpool Echo", "description": "We asked Everton fans what is the most excited they have ever been for a Blues signing and the results make for interesting reading", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/romelu-lukaku-carlo-ancelotti-evertons-18151281", "urlToImage": null, "publishedAt": "2020-04-26T04:12:20Z", "content": "The arrival of a new signing can work wonders for a side.\r\nEverton fans in the past have seen transfers be able to add quality to the squad in much-needed areas of the pitch - with countless going on to be heroes at Goodison Park.\r\nBut, who caused the most fu… [+5301 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Ex-Chelsea striker Diego Costa reignites feud with 'suspicious' Antonio Conte - Mirror Online", "description": "Costa blames Conte for his exit from Stamford Bridge, and says the Inter Milan boss wouldn't last one season at a club like Real Madrid", "url": "https://www.mirror.co.uk/sport/football/news/ex-chelsea-striker-diego-costa-21927801", "urlToImage": null, "publishedAt": "2020-04-26T02:05:22Z", "content": "Former Chelsea star Diego Costa has reignited his feud with 'suspicious' Antonio Conte - saying the Inter Milan boss wouldn't last one season at Real Madrid. \r\n Conte and Costa won the Premier League title together at Chelsea, but the two had several run-ins … [+1779 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Real Madrid eye 'dream' Neymar transfer after Barcelona told funding deal is 'impossible' - Mirror Online", "description": "Real Madrid supremo Florentino Perez still hopes of a dream move for Neymar despite Barcelona's interest in re-signing the forward", "url": "https://www.mirror.co.uk/sport/football/news/real-madrid-eye-dream-neymar-21926057", "urlToImage": null, "publishedAt": "2020-04-26T02:00:31Z", "content": "Real Madrid president Florentino Perez \"still dreams\" of signing PSG star Neymar after previously missing out on the Brazilian.\r\nLos Blancos chased Neymar back when he was at Santos before losing out to rivals Barcelona.\r\nBut the Parisians secured his signatu… [+1793 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Who is the greatest British manager? - BBC Sport", "description": "BBC Sport's chief football writer has made a shortlist of the greatest post-war British managers, now it's turn to vote for the best.", "url": "https://www.bbc.co.uk/sport/football/52371056", "urlToImage": null, "publishedAt": "2020-04-26T01:32:45Z", "content": "Who do you think is Britain's greatest manager of the post-war era\r\nIt's one of those debates that is very difficult to win. Just who is Britain's greatest post-war manager?\r\nFrom a World Cup win, to European successes, to lifting domestic titles, there are a… [+17447 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Leeds face nightmare scenario if Premier League follow Eredivisie and deny promotion gamble - Mirror Online", "description": "Leeds were poised to end their Premier League exile before the coronavirus pandemic hit and the Eredivisie's decision has cast doubt over their promotion", "url": "https://www.mirror.co.uk/sport/football/news/leeds-face-nightmare-scenario-premier-21925320", "urlToImage": null, "publishedAt": "2020-04-26T00:28:53Z", "content": "Leeds and West Brom will be waiting with bated breath after the Eredivisie became the first European league to blink in light of the coronavirus pandemic. \r\nThe Dutch authorities announced the end of the current campaign on Friday night claiming \"it has becom… [+5257 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Elliott Jackson", "title": "James Milner lifts lid on what Liverpool agreed in team meeting ahead of Champions League final - Liverpool Echo", "description": "The Reds beat Tottenham Hotspur 2-0 to win the competition last year", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/milner-surprise-admission-champions-league-18148967", "urlToImage": null, "publishedAt": "2020-04-26T00:01:59Z", "content": "James Milner has admitted he believes Liverpool's early goal against Tottenham Hotspur in the Champions League played a major role in their low-key performance.\r\nThe Reds went on to win the match 2-0 after Mohamed Salah had scored from the penalty spot after … [+1760 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Luke Gardener", "title": "Man Utd make Pogba swap transfer decision, Aubameyang to Chelsea, Mourinho agrees deal - Express", "description": "The transfer window is fast approaching with Premier League sides such as Manchester United, Chelsea, Arsenal and Liverpool all looking to strengthen. Express Sport brings you updates throughout the day.", "url": "https://www.express.co.uk/sport/football/1273851/Transfer-news-LIVE-Man-Utd-Pogba-swap-Spurs-agree-Aubameyang-Chelsea-latest-updates-gossip", "urlToImage": null, "publishedAt": "2020-04-26T00:00:00Z", "content": null}, {"source": {"id": null, "name": "Football.london"}, "author": "Tom Leach", "title": "Chelsea get Jadon Sancho boost as Liverpool eye Dries Mertens - Premier League transfer rumours - Football.London", "description": "Here are the latest Premier League rumours as football awaits news of a Premier League return", "url": "https://www.football.london/premier-league/chelsea-jadon-sancho-boost-liverpool-18151779", "urlToImage": null, "publishedAt": "2020-04-25T22:11:07Z", "content": "The Premier League may be on hold for now with plans to spark a return said to be ramping up.\r\nThat is the big rumour in the media this weekend, with a government meeting said to be on the cards.\r\nBut there is still plenty of transfer talk filling the inside … [+2958 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Sean Ingle", "title": "Olympic hopeful Eleanor Davis puts Tokyo ambition on hold to save lives - The Guardian", "description": "Eleanor Davis intended to spend Sunday running the London Marathon but the Olympic hopeful will instead be on a Covid-19 ward helping patients", "url": "https://www.theguardian.com/sport/2020/apr/25/olympic-athletics-hopeful-eleanor-davis-puts-tokyo-ambition-on-hold-to-save-lives", "urlToImage": null, "publishedAt": "2020-04-25T21:30:00Z", "content": "Eleanor Davis had intended to spend Sunday on a 42,000-step journey towards Team GBs squad for the 2020 Olympics. Instead, at 8.55am, when the London Marathon elite womens race was due to start, Davis will be on a Covid-19 ward saving lives. Its gutting that … [+4724 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Report: Barcelona make Coutinho transfer decision that could impact Tottenham - The Spurs Web", "description": "Tottenham Hotspur's chances of landing Philippe Coutinho have just received a huge blow as the latest reports from Spain indicate that Barcelona have U-turned on their original plans to sell the star. Spurs have been linked with a move for Coutinho since it e…", "url": "https://www.spurs-web.com/spurs-news/report-barcelona-make-coutinho-transfer-decision-that-could-impact-tottenham/", "urlToImage": null, "publishedAt": "2020-04-25T21:00:00Z", "content": "Tottenham Hotspurs chances of landing Philippe Coutinho have just received a huge blow as the latest reports from Spain indicate that Barcelona have U-turned on their original plans to sell the star.\r\nSpurs have been linked with a move for Coutinho since it e… [+928 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "Jofra Archer reveals he has lost his Cricket World Cup winner's medal - The Guardian", "description": "England paceman Jofra Archer revealed he has ‘gone mad’ searching for his World Cup winner’s medal after losing it during a recent house move", "url": "https://www.theguardian.com/sport/2020/apr/25/jofra-archer-reveals-he-has-lost-his-england-cricket-world-cup-winners-medal", "urlToImage": null, "publishedAt": "2020-04-25T18:41:53Z", "content": "England pace bowler Jofra Archer revealed he has gone mad searching for his Cricket World Cup winners medal after losing it during a recent house move. Archer rose from relative obscurity to become a household name at last years tournament, finishing as Engla… [+1949 chars]"}, {"source": {"id": null, "name": "Boxingnews24.com"}, "author": "Boxing News", "title": "Joseph Parker: ‘I can beat Dillian Whyte in REMATCH’ - Boxing News 24", "description": "By Matt Lieberman: Joseph Parker would like a chance to avenge his loss to Dillian Whyte from 2018 by facing him in a rematch. Parker says he knows he can", "url": "https://www.boxingnews24.com/2020/04/joseph-parker-i-can-beat-dillian-whyte-in-rematch/", "urlToImage": null, "publishedAt": "2020-04-25T17:57:32Z", "content": "By Matt Lieberman: Joseph Parker would like a chance to avenge his loss to Dillian Whyte from 2018 by facing him in a rematch. Parker says he knows he can beat Whyte if given another opportunity at meeting him.\r\nWhyte has no interest in facing Parker (27-2, 2… [+2975 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "Seb Jenkins", "title": "Report: Tottenham 'ramp up bid' to sign 21-year-old Premier League playmaker - The Spurs Web", "description": "Football Insider have now reported that Tottenham Hotspur are ramping up their bid to sign Norwich City playmaker, Todd Cantwell, this summer. The 21-year-old attacker caught the eye in his first Premier League season this year as he recorded six goals across…", "url": "https://www.spurs-web.com/spurs-news/report-tottenham-ramp-up-bid-to-sign-21-year-old-premier-league-playmaker/", "urlToImage": null, "publishedAt": "2020-04-25T17:43:13Z", "content": "Football Insider have now reported that Tottenham Hotspur are ramping up their bid to sign Norwich City playmaker, Todd Cantwell, this summer.\r\nThe 21-year-old attacker caught the eye in his first Premier League season this year as he recorded six goals acros… [+790 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Haye would come out of retirement to fight Anthony Joshua v Tyson Fury winner - Metro.co.uk", "description": "Would he stand a chance?", "url": "https://metro.co.uk/2020/04/25/david-haye-retired-tyson-fury-anthony-joshua-12609927/", "urlToImage": null, "publishedAt": "2020-04-25T17:12:43Z", "content": "Haye isnt planning a return (Picture: Getty)\r\nDavid Haye is not tempted by a return to the ring, but revealed a potential showdown with the winner of a fight between Anthony Joshua and Tyson Fury would entice him to put his gloves back on. \r\nThe former Britis… [+1608 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Freddie Keighley", "title": "Eddie Hearn admits Tyson Fury proved him wrong after ignoring chance to sign heavyweight - Mirror Online", "description": "The promoter discussed his regret about not signing the Gypsy King and admitted he did not believe Fury would be able to recover after his struggles in 2016 and 2017", "url": "https://www.mirror.co.uk/sport/boxing/eddie-hearn-admits-tyson-fury-21924943", "urlToImage": null, "publishedAt": "2020-04-25T16:29:30Z", "content": "Promoter Eddie Hearn has singled out Tyson Fury as the boxer he regrets passing up the opportunity to sign and admitted that the Gypsy King proved him wrong by coming back to become a heavyweight champion. \r\nFury was forced to vacate his unified heavyweight b… [+1896 chars]"}, {"source": {"id": null, "name": "Paddypower.com"}, "author": "Rob Catterson", "title": "Horse racing tips: 5 who'll thrive in the din at Sha Tin on Sunday - Paddy Power News", "description": "In case you hadn't already heard, it's Champions Day.", "url": "https://news.paddypower.com/horse-racing/2020/04/25/horse-racing-tips-champions-day-sha-tin/", "urlToImage": null, "publishedAt": "2020-04-25T14:40:47Z", "content": "The first of the Group 1 action is the Chairmans Sprint Prize, where eight of the 11 runners contested the Group 2 Sprint Cup three weeks ago over C&amp;D. On that occasion, Voyage Warrior was a surprise winner but there was nothing fluky about his performanc… [+3274 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Elliott Jackson", "title": "Dimitar Berbatov sends transfer warning to Newcastle with Man City comparison - Manchester Evening News", "description": "The former Manchester United striker has had his say on Newcastle's potential takeover.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/berbatov-newcastle-manchester-city-takeover-18147091", "urlToImage": null, "publishedAt": "2020-04-25T14:36:51Z", "content": "Dimitar Berbatov has insisted it will take time for Newcastle United to attract top players to the club.\r\nNewcastle are in talks over a potential Saudi Arabia-backed takeover. Manchester City, of course, were subject to a takeover of their own in 2008 which d… [+1174 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Dani Ceballos shares Zinedine Zidane message on future amid Arsenal transfer talk - Mirror Online", "description": "Arsenal are believed to be keen on signing Real Madrid midfielder permanently following loan spell, but Ceballos has revealed Zidane conversation which could decide his future", "url": "https://www.mirror.co.uk/sport/football/transfer-news/dani-ceballos-shares-zinedine-zidane-21924432", "urlToImage": null, "publishedAt": "2020-04-25T12:57:55Z", "content": "Dani Ceballos has shared a message from Zinedine Zidane about his Real Madrid future amid speculation Arsenal will bid to sign him permanently. \r\nCeballos has spent the season on loan with the Gunners from Madrid, and Arsenal are believed to be keen on signin… [+1801 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Jon Doel", "title": "Wales on brink of stunning world rugby and ditching Bill Beaumont amid late drama - reports - Wales Online", "description": "The race to become World Rugby chairman may be about to take a huge twist", "url": "https://www.walesonline.co.uk/sport/rugby/rugby-news/wales-brink-stunning-world-rugby-18149672", "urlToImage": null, "publishedAt": "2020-04-25T12:15:32Z", "content": "Wales could be the country to blow apart Bill Beaumont's hopes of winning the race to remain World Rugby chairman, according to reports.\r\nBeaumont has widely been expected to receive the backing of all Six Nations countries in his battle with Agustin Pichot, … [+1060 chars]"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Daniel Marland", "title": "Cristiano Ronaldo Rejoining Man Utd This Summer ‘Would Not Be A Surprise’ - SPORTbible", "description": "This would be one of the biggest transfer stories of all time.", "url": "https://www.sportbible.com/football/football-news-transfers-ronaldo-rejoining-man-utd-this-summer-would-not-be-a-surprise-20200425", "urlToImage": null, "publishedAt": "2020-04-25T12:07:11Z", "content": "Manchester United completing the shock re-signing of Cristiano Ronaldo this summer 'would not be a surprise' according says to a top European club chief.\r\nThe 35-year-old has been linked with a move away from current club Juventus due to their current financi… [+2326 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Freddie Keighley", "title": "Fred explains Michael Carrick's role in turning round his Man Utd career - Mirror Online", "description": "The Brazil midfielder has enjoyed a much-improved campaign after struggling during his first season at Old Trafford - and he has identified Carrick as the man responsible", "url": "https://www.mirror.co.uk/sport/football/news/fred-explains-michael-carricks-role-21925188", "urlToImage": null, "publishedAt": "2020-04-25T11:56:44Z", "content": "Manchester United midfielder Fred has heaped praise on Michael Carrick for helping him drastically improve his performances after a difficult first season at Old Trafford. \r\nMuch was expected of the Brazilian after his £52m move from Shakhtar Donetsk in 2018,… [+1687 chars]"}, {"source": {"id": null, "name": "Autosport.com"}, "author": "Luke Smith", "title": "Brazil 2012: The race that could have changed an F1 nearly-man's career - Autosport", "description": "The 2012 Brazilian Grand Prix, which is being live-streamed by Formula 1 today, is upheld as one of F1's most dramatic title-deciders", "url": "https://www.autosport.com/f1/news/149147/the-race-that-could-have-changed-an-f1-nearlyman", "urlToImage": null, "publishedAt": "2020-04-25T11:33:15Z", "content": "The 2012 Brazilian Grand Prix, which is being live-streamed by Formula 1 today, is upheld as one of F1's most dramatic title-deciders. The fight for the victory was no less exciting, as yet another chance slipped through the fingers of an F1 nearly-man\r\nThe 2… [+9660 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Report: Spurs could suffer major financial blow after UEFA decision - The Spurs Web", "description": "Tottenham Hotspur could be set to suffer a major financial blow in revenue generated from European football if the season is decided on a points-per-game basis, the Evening Standard report. It was revealed on Thursday that UEFA were considering using a points…", "url": "https://www.spurs-web.com/spurs-news/report-spurs-could-suffer-major-financial-blow-after-uefa-decision/", "urlToImage": null, "publishedAt": "2020-04-25T11:00:00Z", "content": "Tottenham Hotspur could be set to suffer a major financial blow in revenue generated from European football if the season is decided on a points-per-game basis, the Evening Standard report.\r\nIt was revealed on Thursday that UEFA were considering using a point… [+1358 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "NFL Draft 2020: Teams set wide receiver record on Day Two - Sky Sports", "description": "Wide receivers flew off the board on a busy Day Two of the 2020 NFL Draft.", "url": "https://www.skysports.com/nfl/news/12118/11978575/nfl-draft-2020-teams-set-wide-receiver-record-on-day-two", "urlToImage": null, "publishedAt": "2020-04-25T09:58:40Z", "content": "Teams continued to dip into the 2020 NFL Draft's deep receiver class on Friday, with the Cincinnati Bengals kicking off the run at the top of Round Two by grabbing Clemson wideout Tee Higgins.\r\nAfter six wideouts went in Round One, Round Two began with two in… [+4635 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Daniel Davis For Mailonline", "title": "Bury owner Steve Dale reveals that club hope to be placed in the National League next season - Daily Mail", "description": "The former League One outfit were kicked out of the division in August after failing to provide proof of funding, but are entitled to be placed into the upper reaches of the non-league setup.", "url": "https://www.dailymail.co.uk/sport/sportsnews/article-8255587/Bury-owner-Steve-Dale-reveals-club-hope-placed-National-League-season.html", "urlToImage": null, "publishedAt": "2020-04-25T09:18:02Z", "content": "Bury owner Steve Dale has revealed that the expelled EFL club are hoping to be placed into the National League next season.\r\nThe former League One outfit were kicked out of the division in August after failing to provide proof of funding, but are entitled to … [+2269 chars]"}, {"source": {"id": null, "name": "Lancs.live"}, "author": "Elliott Jackson", "title": "The dangerous precedent set for Liverpool, Leeds United and the Lancashire clubs - LancsLive", "description": "The Premier League and EFL remain committed to completing the 2019/20 season.", "url": "https://www.lancs.live/sport/football/football-news/dangerous-precedent-set-liverpool-leeds-18149139", "urlToImage": null, "publishedAt": "2020-04-25T06:12:00Z", "content": "Dutch giants Ajax have been denied the Eredivisie title after it was confirmed there would be no 2019/20 league champions in the Netherlands.\r\nLast season's Champions League semi-finalists lead the table on goal difference over AZ Alkmaar with nine league mat… [+1244 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Reubyn Coutinho", "title": "“The Winner Will Fight Khabib For the Title”- Dana White makes a huge statement - Essentially Sports", "description": "UFC President Dana White made a huge statement regarding UFC Lightweight division. He said the winner of Ferguson-Gaethje will fight Khabib for the title.", "url": "https://www.essentiallysports.com/ufc-news-the-winner-will-fight-khabib-for-the-title-dana-white-makes-a-huge-statement-tony-ferguson-justin-gaethje/", "urlToImage": null, "publishedAt": "2020-04-25T05:00:00Z", "content": "UFC 249 finally has a new venue. The event will take place at VyStar Veterans Memorial Arena in Jacksonville, Florida. The UFC pounced on a chance to hold their events in the Sunshine State as sports activities were deemed essential businesses. Dana White app… [+1819 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Ryan Taylor", "title": "Liverpool force Chelsea owner Roman Abramovich to change summer transfer plans - Express", "description": "Chelsea and Liverpool both share an interest in RB Leipzig striker Timo Werner.", "url": "https://www.express.co.uk/sport/football/1273601/Liverpool-Chelsea-Roman-Abramovich-transfer-plans-Timo-Werner-gossip", "urlToImage": null, "publishedAt": "2020-04-24T19:10:52Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Suzanne Wrack", "title": "Who could replace Phil Neville as England Women's manager? - The Guardian", "description": "We run the rule over leading candidates, including a two-times World Cup winner and a woman who worked as Neville’s No 2", "url": "https://www.theguardian.com/football/2020/apr/24/who-could-replace-phil-neville-as-england-womens-manager", "urlToImage": null, "publishedAt": "2020-04-24T18:00:00Z", "content": "The Football Associations hunt for a successor to Mark Sampson in 2017 quickly became a circus. Names flew out of the ring as fast as they stepped in. Increased scrutiny on the person in charge, with the game professionalising, led some of those on the shortl… [+4734 chars]"}]}