{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Mark Jones", "title": "Nicky Butt blasts Jose Mourinho and Louis van Gaal \"myth\" at Man Utd - Irish Mirror", "description": "It was often claimed that neither Mourinho nor Van Gaal had much time for the youngsters at United, but head of first-team development Butt has suggested otherwise", "url": "https://www.mirror.co.uk/sport/football/news/nicky-butt-blasts-jose-mourinho-21937071", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21937088.ece/ALTERNATES/s1200/0_Soccer-Barclays-Premier-League-Manchester-United-v-Chelsea-Old-Trafford.jpg", "publishedAt": "2020-04-28T06:41:20Z", "content": "Nicky Butt says it is a \"myth\" that Manchester United's recent managers were only focused on short-term gains and big money signings.\r\nFormer United midfielder Butt is the head of first-team development at the club these days, and has overseen the smooth tran… [+1617 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "SunSport Reporters", "title": "11pm Arsenal news LIVE: Players training, Luiz convinced squad to accept pay cut, Willian transfer boost, - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11484639/arsenal-news-live-aubameyang-willian-luiz-transfer/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/04/aubameyang-willian.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-04-28T06:37:21Z", "content": "Good morning Gunners fans,\r\nYesterday was a busy day as Premier League stars abroad face a two-week quarantine headache with clubs set to recall stars for training restart.\r\nPrem chiefs have also been given a four week deadline by Uefa to produce restart plan… [+1446 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Newcastle takeover will return club to Premier League title contention, says Demba Ba - Sky Sports", "description": "Demba Ba is adamant Newcastle will compete for Premier League titles and return to the Champions League if its proposed takeover is completed.", "url": "https://www.skysports.com/football/news/11678/11979706/newcastle-takeover-will-return-club-to-premier-league-title-contention-says-demba-ba", "urlToImage": "https://e0.365dm.com/13/01/1600x900/Ba2_2880947.jpg", "publishedAt": "2020-04-28T06:33:06Z", "content": "Former Newcastle striker Demba Ba thinks the club will compete for Premier League titles and return to the Champions League if the proposed takeover by a Saudi-backed consortium is completed. \r\nPCP Capital Partners' proposed takeover of the club is nearing co… [+1654 chars]"}, {"source": {"id": null, "name": "Footballinsider247.com"}, "author": null, "title": "Ibrox Exclusive: SPFL ridiculed amid Rangers whistleblower update, Celtic ‘don’t want this’ - Football Insider", "description": "In the latest Rangers news Noel Whelan is unsurprised the investigation into Dundee's vote found no wrongdoing when it was commissioned by the SPFL", "url": "https://www.footballinsider247.com/exclusive-spfl-probe-ridiculed-as-rangers-share-whistleblower-update-celtic-view-shared/", "urlToImage": "/static/uploads/1/2020/04/Neil-Doncaster-Peter-Lawwell.jpg", "publishedAt": "2020-04-28T06:17:14Z", "content": "Noel Whelan has ridiculed the SPFL’s probe into Dundee’s vote that found no wrongdoing as Rangers push for an inquiry to avoid a scenario even Celtic don’t want.\r\nThe former Aberdeen and Leeds striker, speaking exclusively to Football Insider correspondent Dy… [+1961 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Samuel Luckhurst", "title": "Manchester United should listen to Rio Ferdinand on midfield transfer options - Manchester Evening News", "description": "Atletico Madrid have become organ donors for the rich but Man United have not signed a player from the Spanish side since David de Gea.", "url": "https://www.manchestereveningnews.co.uk/sport/football/man-united-transfer-news-partey-18157095", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/incoming/article18158001.ece/ALTERNATES/s1200/0_GettyImages-1206652589.jpg", "publishedAt": "2020-04-28T06:09:24Z", "content": "When David Moyes pulled back the curtain at Carrington the wizard was no longer there at the controls. Sir Alex Ferguson did not require a private hub with hi-definition screens tracking talent and instead relied on his teeming contacts book.\r\nThat was anathe… [+4995 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Shane Ireland", "title": "UK government provides significant update for West Brom and Leeds United - Birmingham Live", "description": "West Brom news includes Culture Secretary revealing talks with Premier League as WBA hope to complete promotion bid", "url": "https://www.birminghammail.co.uk/sport/football/football-news/west-brom-news-premier-league-18160009", "urlToImage": "https://i2-prod.birminghammail.co.uk/sport/football/football-news/article18160046.ece/ALTERNATES/s1200/0_JS206286408.jpg", "publishedAt": "2020-04-28T06:07:25Z", "content": "The Government have entered talks with the Premier League for football to resume \"as soon as possible.\"\r\nDigital, Culture, Media and Sport Secretary Oliver Dowden issued the update during a House of Commons parliamentary session on Monday.\r\n Elite level footb… [+958 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Matt Addison", "title": "Only way Kylian Mbappe Liverpool transfer could happen as Nike claim quashed - Liverpool Echo", "description": "PSG forward Kylian Mbappe is a player that Jurgen Klopp has admired for a long time, with many Liverpool fans desperate to see the Reds make a summer transfer move", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/only-way-kylian-mbappe-liverpool-18156155", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article18156302.ece/ALTERNATES/s1200/0_GettyImages-1211840618.jpg", "publishedAt": "2020-04-28T05:21:58Z", "content": "Liverpool and Kylian Mbappe: it could be a match made in heaven, but it could just as easily be a fantasy signing that will never come true.\r\nThe attraction is simple: at the age of 21, the heir to Lionel Messi's crown as the world's greatest footballer for t… [+4218 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Man Utd, Arsenal and Chelsea on transfer alert as West Ham 'consider Declan Rice sale' - Mirror Online", "description": "Premier League rivals are ready to pounce for star midfielder as West Ham face a tightening the belt due to the financial effects of the coronavirus pandemic", "url": "https://www.mirror.co.uk/sport/football/transfer-news/man-utd-arsenal-chelsea-transfer-21936854", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21769156.ece/ALTERNATES/s1200/0_West-Ham-United-v-Southampton-FC-Premier-League.jpg", "publishedAt": "2020-04-28T05:00:01Z", "content": "West Ham are reportedly considering selling Declan Rice with Manchester United, Arsenal and Chelsea all keen on the England midfielder.\r\n The Hammers face a tightening of the belt due to their big spending last summer and the financial implications of the cor… [+2183 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ashley Preece", "title": "The most-likely Aston Villa team Dean Smith will pick after lockdown - Birmingham Live", "description": "Aston Villa news - With the Premier League pushing for a return date in June, we look at how Dean Smith's Aston Villa might line up if and when action resumes in the summer", "url": "https://www.birminghammail.co.uk/sport/football/football-news/most-likely-aston-villa-team-18160003", "urlToImage": "https://i2-prod.birminghammail.co.uk/incoming/article16843575.ece/ALTERNATES/s1200/1_GettyImages-1163401627.jpg", "publishedAt": "2020-04-28T04:08:26Z", "content": "Forty-nine days have passed since Aston Villa's shocking 4-0 defeat by Leicester at a soaking-wet King Power Stadium.\r\nDean Smith will be braced for the very latest in terms of returning back to action following this Friday's all-important Premier League meet… [+4830 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Bobby Vincent", "title": "Liverpool admiration for Timo Werner and the reasons behind FSG's Anfield decision - Liverpool Echo", "description": "Here is your Liverpool morning digest for Tuesday, April 28", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-morning-digest-werner-fsg-18160555", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article18019026.ece/ALTERNATES/s1200/0_GettyImages-1206547771.jpg", "publishedAt": "2020-04-28T03:09:28Z", "content": "Werner transfer update\r\nJurgen Klopp is a keen admirer of RB Leipzig striker Timo Werner, although the current transfer saga remains to be just a rumour.\r\nThere have been rumours that Werner is the Reds main target for the summer transfer window and it appear… [+3006 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "George Flood", "title": "Tottenham follow Arsenal and West Ham by allowing players to make training ground return - Evening Standard", "description": "", "url": "https://www.standard.co.uk/sport/football/tottenham-allowing-players-return-training-ground-a4425476.html", "urlToImage": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2020/04/27/19/harrykanetottenham2704a.jpg", "publishedAt": "2020-04-28T00:09:00Z", "content": "Tottenham have become the latest Premier League club to allow players to return to their training ground.\r\nLondon rivals Arsenal and West Ham - as well as Brighton - have already permitted players to return on a limited and individual basis as English footbal… [+1442 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Ollie Lewis For Mailonline", "title": "Dimitar Berbatov details 'painful' realisation he had not made squad for Champions League final - Daily Mail", "description": "Despite enjoying a strong campaign, Dimitar Berbatov narrowly missed out on the final squad, with Ferguson opting for Wayne Rooney, Javier Hernandez and Michael Owen instead.", "url": "https://www.dailymail.co.uk/sport/football/article-8262931/Dimitar-Berbatov-details-painful-realisation-not-squad-Champions-League-final.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/04/27/23/27722804-0-image-a-75_1588027045200.jpg", "publishedAt": "2020-04-28T00:00:05Z", "content": "Dimitar Berbatov has revealed the difficult conversation he had with Sir Alex Ferguson as he found out he hadn't made the squad for Manchester United's Champions League 2011 final defeat to Barcelona.\r\nDespite enjoying a strong campaign which saw the Bulgaria… [+1670 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Ronaldinho opens up on life in prison in first interview since his release - Mirror Online", "description": "The Barcelona legend spent 32 days behind bars in Paraguay after being arrested for allegedly using a false passport to enter the country last month, and is now out on bail", "url": "https://www.mirror.co.uk/sport/football/news/ronaldinho-opens-up-life-prison-21933887", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21933842.ece/ALTERNATES/s1200/0_FBL-PARAGUAY-BRAZIL-RONALDINHO.jpg", "publishedAt": "2020-04-27T23:32:14Z", "content": "Ronaldinho has admitted he was shocked to be arrested over allegedly using a falsified passport, as he was under the impression the documents were completely certified. \r\n The former Barcelona and Brazil legend spent a month behind bars in Paraguay after bein… [+2397 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Mike Keegan For The Daily Mail", "title": "Physios on £191,000 and kit men on £56,000! Crazy wages don't add up in EFL with clubs on the brink - Daily Mail", "description": "SPECIAL REPORT: Each year, the EFL ask clubs how much they pay playing and non-playing staff. The resulting report is sensitive and is not meant to fall into the hands of a newspaper.", "url": "https://www.dailymail.co.uk/sport/football/article-8262315/Physios-191-000-kit-men-56-000-Crazy-wages-dont-add-EFL-clubs-brink.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/04/27/21/27719234-0-image-a-45_1588019864929.jpg", "publishedAt": "2020-04-27T23:30:58Z", "content": "The coronavirus crisis has pushed clubs outside the Premier League precariously close to the cliff edge. Many are looking at meltdown. The administrators are on standby. Decades of history not to mention scores of jobs are at risk. Looking at these figures, i… [+6951 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Arsenal shocked by wage demands of Chelsea star Willian during transfer talks - Metro.co.uk", "description": "One of them must back down...", "url": "https://metro.co.uk/2020/04/27/arsenal-shocked-willians-wage-demands-opening-talks-free-transfer-12618871/", "urlToImage": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2020/02/GettyImages-1207018041_1588026550.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "publishedAt": "2020-04-27T23:08:37Z", "content": "Willian wants a three-year deal (Picture: Getty)\r\nArsenal are unlikely to sanction a deal for Chelsea star Willian unless the Brazilian lowers his wage demands.\r\nThe winger is set to end his seven-year stay at Stamford Bridge this summer after talks over a ne… [+1504 chars]"}, {"source": {"id": null, "name": "Racefans.net"}, "author": "https://www.facebook.com/racefansdotnet/", "title": "\"Very encouraging\" signs British GP could go ahead behind closed doors - RaceFans", "description": "In the round-up: \"Very encouraging\" signs British GP will happen • Spain offers to hold summer race • Audi DTM exit disappoints Berger", "url": "https://www.racefans.net/2020/04/28/racefans-round-up-28-04-3/", "urlToImage": "https://www.racefans.net/wp-content/uploads/2019/07/racefansdotnet-20190714-170050-42.jpg", "publishedAt": "2020-04-27T23:01:00Z", "content": "In the round-up: Silverstone managing director Stuart Pringle says he’s seen encouraging signs from the government that the British Grand Prix will be able to go ahead behind closed cdoors.Social media\r\nNotable posts from Twitter, Instagram and more:\r\npic.twi… [+1124 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sam Mcevoy For Mailonline", "title": "Here are the dates for every fan's diary as officials plot football's return after COVID-19 lockdown - Daily Mail", "description": "According to The Times, contingency plans to bring the beautiful game back to life is becoming a reality, with government ministers recognising that an injection of positivity and hope is sorely needed.", "url": "https://www.dailymail.co.uk/sport/football/article-8260747/Here-dates-fans-diary-officials-plot-footballs-return-COVID-19-lockdown.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/04/27/22/27721014-0-image-a-5_1588022952175.jpg", "publishedAt": "2020-04-27T22:43:18Z", "content": "After six weeks of no action, Premier League officials have drawn up plans to see the return of top-flight football in England.\r\nFollowing Mikel Arteta's positive coronavirus test on March 12, the Premier League came to an abrupt halt in a bid to stop the dea… [+6301 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Lee Ryder", "title": "Jamaal Lascelles hails \"fantastic job\" performed by Steve Bruce as Newcastle United boss - Chronicle Live", "description": "Toon skipper Jamaal Lascelles feels that Steve Bruce deserves credit for keeping Magpies out of trouble this term", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/jamaal-lascelles-newcastle-steve-bruce-18160327", "urlToImage": "https://i2-prod.chroniclelive.co.uk/incoming/article16607722.ece/ALTERNATES/s1200/0_Premier-League-Asia-Trophy.jpg", "publishedAt": "2020-04-27T22:20:22Z", "content": "Newcastle United skipper Jamaal Lascelles has heaped praise on Steve Bruce after his first season in charge of the Magpies.\r\nBruce replaced Rafa Benitez last summer despite receiving a frosty reception from some fans after resigning from Sheffield Wednesday t… [+1285 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "Alex Neil", "title": "Video: Tanguy Ndombele issues three-word update on Instagram - The Spurs Web", "description": "Tanguy Ndombele has taken to Instagram with a rare update which featured a three-word caption. The Tottenham Hotspur midfielder posted a video compilation of some of his best highlights from his first season in North London along witht he caption 'Rien à sign…", "url": "https://www.spurs-web.com/spurs-news/video-tanguy-ndombele-issues-three-word-update-on-instagram/", "urlToImage": "https://www.spurs-web.com/wp-content/uploads/2020/04/ndombele.jpg", "publishedAt": "2020-04-27T21:07:00Z", "content": "Tanguy Ndombele has taken to Instagram with a rare update which featured a three-word caption.\r\nThe Tottenham Hotspur midfielder posted a video compilation of some of his best highlights from his first season in North London along witht he caption Rien à sign… [+569 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Alex Milne", "title": "Wojciech Szczesny details Arsene Wenger's furious reaction to infamous White Hart Lane selfie - Mirror Online", "description": "The Polish goalkeeper was jubilant after the Gunners sealed an away win over their bitter rivals in 2014 and snapped a picture to remember the moment", "url": "https://www.mirror.co.uk/sport/football/news/wojciech-szczesny-details-arsene-wengers-21935926", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article3250774.ece/ALTERNATES/s1200/0_Arsenal-selfie.png", "publishedAt": "2020-04-27T20:42:06Z", "content": "Former Arsenal goalkeeper Wojciech Szczesny has revealed that the only time Arsene Wenger ever lost his temper with him was after he took a famous selfie following a win over Tottenham. \r\n An early goal from Tomas Rosicky gave the Gunners a 1-0 win over their… [+1635 chars]"}, {"source": {"id": null, "name": "Formula1.com"}, "author": "F1", "title": "‘It’s unprecedented’ – James Allison reveals what marks Hamilton out from other F1 champs - Formula 1", "description": "To the mind of Mercedes’ Technical Director James Allison, there’s one particular characteristic of Lewis Hamilton that marks him out as one of the greatest drivers in the history of Formula 1.", "url": "https://www.formula1.com/en/latest/article.its-unprecedented-james-allison-reveals-what-marks-hamilton-out-from-other.6oqNjmeKSCanPVLqF5eR6.html", "urlToImage": "https://www.formula1.com/content/dam/fom-website/manual/Misc/2020/Misc/GettyImages-1207500832.jpg", "publishedAt": "2020-04-27T20:39:40Z", "content": "You dont win six world championships without having some pretty stand-out qualities. But to the mind of Mercedes Technical Director James Allison, theres one particular characteristic possessed by Lewis Hamilton that marks him out as one of the greatest drive… [+2657 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Leicester Tigers: 'Time to shake up rugby scene' - Ellis Genge on new union plans - BBC Sport", "description": "Leicester and England prop Ellis Genge says it is time to “shake up the rugby scene” after confirming he plans to set up a new union.", "url": "https://www.bbc.co.uk/sport/rugby-union/52449455", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/121FE/production/_111983247_whatsubject.jpg", "publishedAt": "2020-04-27T20:15:21Z", "content": "Ellis Genge has been capped eight times by England\r\nEngland's Ellis Genge says it is time to \"shake up the rugby scene\" after confirming plans to set up a new union, designed to provide elite players with improved commercial and legal advice. \r\nHe feels playe… [+3965 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Simon Burnton", "title": "Football must not restart until strain on NHS eases, says Watford chairman - The Guardian", "description": "Watford chairman and CEO Scott Duxbury said: ‘I feel uncomfortable even talking about football’ given the current demands placed on the NHS by the coronavirus crisis", "url": "https://www.theguardian.com/football/2020/apr/27/football-not-restart-until-strain-nhs-eases-says-watford-chairman-scott-duxbury", "urlToImage": "https://i.guim.co.uk/img/media/6bcce9da7a5bf8d7017dca44e51fd484d22d6901/0_81_5568_3341/master/5568.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3d0987f3d157f5d6aae3888262ff8ce6", "publishedAt": "2020-04-27T20:06:48Z", "content": "The Watford chairman and CEO, Scott Duxbury, has said that a resumption of top-level football in England should be off the agenda until the burden on the NHS has become less severe, adding that he does not think football is important at the moment.\r\nBefore th… [+3441 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Funny Andy Murray commentary at the Mutua Madrid Open Virtual Pro - LTA", "description": "Andy Murray takes on Benoit Paire in the first round of the Mutua Madrid Open Virtual Pro and commentates on his game throughout. Keep up to date with the la...", "url": "https://www.youtube.com/watch?v=WGvd977FKjo", "urlToImage": "https://i.ytimg.com/vi/WGvd977FKjo/maxresdefault.jpg", "publishedAt": "2020-04-27T19:59:38Z", "content": "Andy Murray takes on Benoit Paire in the first round of the Mutua Madrid Open Virtual Pro and commentates on his game throughout. \r\nKeep up to date with the latest from tennis in Britain at www.lta.org.uk"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "F1 2020 season start plans: Martin Brundle, Karun Chandhok's verdicts - Sky Sports", "description": "Sky F1's Martin Brundle believes F1 was right to set a 'template' for a targeted return to racing later this year.", "url": "https://www.skysports.com/f1/news/12433/11979664/f1-2020-season-start-plans-martin-brundle-karun-chandhoks-verdicts", "urlToImage": "https://e2.365dm.com/20/03/1600x900/skysports-sebastian-vettel_4945797.jpg", "publishedAt": "2020-04-27T19:55:17Z", "content": "F1 is right to set a 'template' for a targeted return to racing later this year even though the global environment remains uncertain, according to Sky F1's Martin Brundle.\r\nThe sport announced on Monday that it was aiming to begin the season behind closed doo… [+2353 chars]"}, {"source": {"id": null, "name": "Theguardian.comsport"}, "author": "Ali Martin", "title": "ECB advised to allow private investment to boost the Hundred - The Guardian", "description": "The England and Wales Cricket Board has been urged to open up the Hundred to private investment in response to the coronavirus crisis", "url": "https://amp.theguardian.comsport/2020/apr/27/ecb-private-investment-boost-the-hundred-cricket", "urlToImage": "https://i.guim.co.uk/img/media/aeea94a8894e133efc4dbaf3301aa23ca08f878a/0_221_5632_3379/master/5632.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=04947482754c610259b8ed795b1550f2", "publishedAt": "2020-04-27T19:32:57Z", "content": "The England and Wales Cricket Board has been urged to open up the Hundred to private investment including equity stakes for counties and even Indian Premier League team owners in response to the coronavirus crisis.\r\nAn ECB board meeting on Wednesday will disc… [+2451 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Rise Of Justin Gaethje - UFC - Ultimate Fighting Championship", "description": "UFC lightweight Justin Gaethje has made a big splash in a relatively short amount of time fighting for the promotion after coming in as an undefeated (17-0) ...", "url": "https://www.youtube.com/watch?v=_JkmztvtzX0", "urlToImage": "https://i.ytimg.com/vi/_JkmztvtzX0/maxresdefault.jpg", "publishedAt": "2020-04-27T19:30:06Z", "content": null}, {"source": {"id": null, "name": "Football.london"}, "author": "Karl Matchett", "title": "Chelsea evening headlines as Philippe Coutinho price given, Jadon Sancho update and Kante boost - Football.London", "description": "All the latest Chelsea news, views and transfer rumours from football.london as the future of two players are discussed", "url": "https://www.football.london/chelsea-fc/news/chelsea-evening-headlines-ziyech-coutinho-18158860", "urlToImage": "https://i2-prod.football.london/incoming/article18160341.ece/ALTERNATES/s1200/0_GettyImages-1211850221.jpg", "publishedAt": "2020-04-27T19:26:03Z", "content": "Like most of the rest of the Premier League, Chelsea are trying to keep their planning up-to-date pending a confirmed return to group training, while away from the pitch conversations are ongoing about potential summer activity.\r\nHere are your Chelsea evening… [+2535 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "NFL Draft 2020: The life of an undrafted free agent in the NFL - Sky Sports", "description": "With the NFL Draft done, attention turns to those college players without a team - being an undrafted free agent is a tough gig, perhaps more so in 2020.", "url": "https://www.skysports.com/nfl/news/12118/11979000/nfl-draft-2020-the-life-of-an-undrafted-free-agent-in-the-nfl", "urlToImage": "https://e2.365dm.com/20/04/1600x900/skysports-adam-thielen-minnesota-vikings_4977368.jpg", "publishedAt": "2020-04-27T19:13:46Z", "content": "Becoming an undrafted free agent in the NFL is no easy gig, particularly in 2020. \r\nAn undrafted free agent is a Draft-eligible prospect who is not selected across the seven rounds, and instead left to negotiate with multiple teams before opting who to sign w… [+6179 chars]"}, {"source": {"id": null, "name": "Planetf1.com"}, "author": "", "title": "Lewis Hamilton struggling with racing hiatus - PlanetF1", "description": "Lewis Hamilton revealed that he's \"missing racing every day\" before pushing a more positive message in a lengthy Twitter post.", "url": "https://www.planetf1.com/news/lewis-hamilton-twitter/", "urlToImage": "https://d3cm515ijfiu6w.cloudfront.net/wp-content/uploads/2019/10/16084513/Lewis-Hamilton-downbeat.jpg", "publishedAt": "2020-04-27T19:02:29Z", "content": "Lewis Hamilton revealed that he’s “missing racing every day” before pushing a more positive message in a lengthy Twitter post.\r\nUnlike many drivers, the Mercedes man has largely stayed out of the public eye since the Formula 1 season was postponed, steering c… [+1348 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nJamie Johnson", "title": "Spitting should be outlawed on resumption and punished by yellow card, says Fifa's chief medic - Telegraph.co.uk", "description": "Saliva could stay on pitch for hours and spread coronavirus, scientists say", "url": "https://www.telegraph.co.uk/football/2020/04/27/spitting-should-outlawed-resumption-punished-yellow-card-says/", "urlToImage": "https://www.telegraph.co.uk/content/dam/football/2020/04/27/TELEMMGLPICT000206209878_trans_NvBQzQNjv4Bqe8EOArUxzcOfIfa2qlTi9V6U2SePB5BAfCc4_pXVBIQ.jpeg?impolicy=logo-overlay", "publishedAt": "2020-04-27T19:01:00Z", "content": "The globules of saliva carrying the virus could remain on the playing surface for hours until it dries out.\r\nThere is also the risk that it becomes aerosolised, where the lighter spray from the spit can float around in the air for a while and potentially come… [+1201 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "James Walters", "title": "Man Utd chief Ed Woodward has one key advantage over rivals in £61m transfer race - Express", "description": "Manchester United could hold an advantage in their pursuit of a summer transfer target.", "url": "https://www.express.co.uk/sport/football/1274581/Man-Utd-news-Ed-Woodward-Federico-Chiesa-Fiorentina-transfer-Chelsea-rumours-gossip", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/67/750x445/1274581.jpg", "publishedAt": "2020-04-27T18:56:39Z", "content": "He told The Beautiful Game Podcast: \"Every week this changes, but I'd definitely buy Sancho.\r\n\"Can you imagine Sancho in that team? He draws two or three players to him and Marcus Rashford's playing one versus one? Oh God, it's over.\r\n\"I would maybe go and ge… [+294 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Virgin Media goes offline for thousands - BBC News", "description": "The broadband outage began just after 17:00, coinciding with the government's daily coronavirus press briefing.", "url": "https://www.bbc.co.uk/news/technology-52448607", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/20EC/production/_111982480_gettyimages-498870347.jpg", "publishedAt": "2020-04-27T18:23:44Z", "content": "Image copyrightGetty Images\r\nVirgin Media, one of the UK's largest broadband providers, has gone offline for thousands of users, at peak time.\r\nThe outage began just after 17:00 on Monday, coinciding with the government daily coronavirus press briefing.\r\nThe … [+820 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Adam Shergold for MailOnline", "title": "Dillian Whyte challenges Tyson Fury to fight him if Deontay Wilder pulls out of Trilogy bout - Daily Mail", "description": "Whyte, who is guaranteed a shot at the winner of Fury-Wilder 3 by February 2021 at the latest as the WBC mandatory challenger, believes he should be stepping into the ring with Fury sooner.", "url": "https://www.dailymail.co.uk/sport/boxing/article-8261367/Dillian-Whyte-challenges-Tyson-Fury-fight-Deontay-Wilder-pulls-Trilogy-bout.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/04/27/15/27705456-0-image-a-13_1587997041980.jpg", "publishedAt": "2020-04-27T18:08:50Z", "content": "Dillian Whyte has laid down the gauntlet to Tyson Fury by saying 'let's just have the fight' as his British rival waits to see if Deontay Wilder is fit enough for their October trilogy.\r\nFury beat Wilder in Las Vegas back in February and their third meeting h… [+2077 chars]"}, {"source": {"id": null, "name": "Belfasttelegraph.co.uk"}, "author": "By Donna Deeney", "title": "Tributes paid to 'gentleman' ex-footballer Thomas Burke at funeral service - Belfast Telegraph", "description": "Mourners at the funeral of a former footballer from Londonderry were told he was someone who \"loved life and lived it to the full\".", "url": "https://www.belfasttelegraph.co.uk/news/northern-ireland/tributes-paid-to-gentleman-ex-footballer-thomas-burke-at-funeral-service-39161938.html", "urlToImage": "https://www.belfasttelegraph.co.uk/news/northern-ireland/28d8c/39161937.ece/AUTOCROP/w1240h700/2020-04-28_new_58540799_I2.JPG", "publishedAt": "2020-04-27T18:00:00Z", "content": "Mourners at the funeral of a former footballer from Londonderry were told he was someone who \"loved life and lived it to the full\".\r\nThomas Burke (29), who had played for a number of football teams, including Ballymena United, Derry City and Trojans, suffered… [+892 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Ed Aarons", "title": "Colchester release four first-team players due to financial pressure - The Guardian", "description": "The coronavirus pandemic has affected football finances and Colchester have become the first English club to release players due to the uncertainty created", "url": "https://www.theguardian.com/football/2020/apr/27/colchester-release-four-first-team-players-due-to-financial-pressure", "urlToImage": "https://i.guim.co.uk/img/media/6a014d760ef49fa17f5a4abbed112ea4d4d9f2da/0_72_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6313d95ce202e3cbe258808d521b5eec", "publishedAt": "2020-04-27T17:41:57Z", "content": "Colchester United have become the first club in the EFL to release players due to the financial impact of the coronavirus pandemic, with the chairman, Robbie Cowling, admitting he could not afford to offer them new deals.\r\nA club statement on Monday confirmed… [+1904 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Virtual Madrid Open: Rafael Nadal asks to postpone charity match because of 'back issue' - BBC Sport", "description": "Rafael Nadal asks to postpone a virtual charity match, leading to a \"joke\" from Madrid Open Virtual Pro tournament director Feliciano Lopez.", "url": "https://www.bbc.co.uk/sport/tennis/52447785", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/14C39/production/_111994058_rafael_nadal_getty_01.jpg", "publishedAt": "2020-04-27T17:26:42Z", "content": "What the virtual Madrid Open court looks like\r\nRafael Nadal has suffered more than a fair share of injuries during his tennis career and his Davis Cup team-mate Feliciano Lopez tried to add a new one to the list on Monday.\r\nWhen the Spanish great asked to pos… [+2093 chars]"}, {"source": {"id": null, "name": "Coventrytelegraph.net"}, "author": "Elliott Jackson, Tom Leach", "title": "UK government provide huge update for Liverpool, Leeds United and Coventry City fans - Coventry Telegraph", "description": "Football in England has been suspended since the middle of March.", "url": "https://www.coventrytelegraph.net/sport/football/football-news/coventry-city-liverpool-fixture-news-18159873", "urlToImage": "https://i2-prod.leeds-live.co.uk/sport/leeds-united/article18134622.ece/ALTERNATES/s1200/0_JS206288506.jpg", "publishedAt": "2020-04-27T17:21:26Z", "content": "The government has revealed that talks have started with the Premier League to get football back up and running \"as soon as possible\".\r\n That news will be welcomed by Coventry City supporters, keen to receive clarity that promotion push at the top of League O… [+1288 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Joe Rimmer", "title": "Xabi Alonso and forgotten former Liverpool coach 'in running' to become Pep Guardiola's assistant - Liverpool Echo", "description": "Man City boss Pep Guardiola is on the lookout for a new assistant manager", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/xabi-alonso-forgotten-former-liverpool-18153523", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article16803596.ece/ALTERNATES/s1200/0_GettyImages-1013271618.jpg", "publishedAt": "2020-04-27T17:13:11Z", "content": "Xabi Alonso is still revered at Anfield but he could soon help plot Liverpool's downfall.\r\nThe former Red could be in the running to replace Mikel Arteta as Manchester City assistant manager, according to a report by Goal.\r\nAnd he's not the only man with Live… [+1852 chars]"}, {"source": {"id": null, "name": "Leeds-live.co.uk"}, "author": "Beren Cross", "title": "'Leeds are an irrelevance' - Brighton fans tear into Leeds United over Ben White - Leeds Live", "description": "Brighton & Hove Albion fans are not happy with how the Ben White debate is being told", "url": "https://www.leeds-live.co.uk/sport/leeds-united/brighton-ben-white-leeds-united-18159134", "urlToImage": "https://i2-prod.leeds-live.co.uk/sport/leeds-united/article17715665.ece/ALTERNATES/s1200/1_JS205767440.jpg", "publishedAt": "2020-04-27T17:00:00Z", "content": "Triggered Brighton &amp; Hove Albion fans have not been impressed with the narrative building around Leeds United and Ben Whites future.\r\nThe defender has had a wildly successful campaign on loan with the Whites at the top of the Championship and, naturally, … [+2856 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Associated Press", "title": "Tulane college basketball star Teshaun Hightower charged with murder - The Guardian", "description": "A Tulane University basketball player who recently declared for the NBA draft has been charged with murder and other counts in a Georgia homicide", "url": "https://www.theguardian.com/sport/2020/apr/27/tulane-college-basketball-star-teshaun-hightower-charged-with", "urlToImage": "https://i.guim.co.uk/img/media/c4e421d83c5440ae8579423b481d35414e55cb28/150_0_4500_2700/master/4500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2647a409d201dcf42587c6051b197256", "publishedAt": "2020-04-27T16:41:52Z", "content": "A Tulane University basketball player who recently declared for the NBA draft has been charged with murder and other counts in a Georgia homicide.\r\nTeshaun Hightower, who led the Green Wave in scoring last season, was booked into jail on Saturday on multiple … [+1732 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Should Manchester United sell Paul Pogba and Jesse Lingard to invest in transfer targets? | ESPN FC - ESPN UK", "description": "ESPN FC’s Gab Marcotti and Julien Laurens discuss whether Manchester United’s Ed Woodward will be willing to let Paul Pogba and Jesse Lingard leave the club ...", "url": "https://www.youtube.com/watch?v=9vM-mGWd2PE", "urlToImage": "https://i.ytimg.com/vi/9vM-mGWd2PE/maxresdefault.jpg", "publishedAt": "2020-04-27T16:30:00Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "TOP 5 RIGHT WINGERS IN THE WORLD! Is Mo Salah 2nd Only To Messi? Is Jadon Sancho World Class Yet? - 90min Football", "description": "Welcome to World Class is a series on 90min where we discuss who the top 5 players in each position are. Who are the top 5 left wingers at the moment? Barcel...", "url": "https://www.youtube.com/watch?v=JXuFjcIHmpI", "urlToImage": "https://i.ytimg.com/vi/JXuFjcIHmpI/maxresdefault.jpg", "publishedAt": "2020-04-27T16:09:51Z", "content": "Welcome to World Class is a series on 90min where we discuss who the top 5 players in each position are. Who are the top 5 left wingers at the moment? Barcelonas Lionel Messi is the best, but is Liverpools Mohamed Salah 2nd?Is Borussia Dortmund and England wi… [+506 chars]"}, {"source": {"id": null, "name": "Hitc.com"}, "author": "Danny Owen", "title": "Report: Everton eyeing three-man transfer deal which could cost £130m - HITC - Football, Gaming, Movies, TV, Music", "description": "Premier League Everton reportedly want to reunite Carlo Ancelotti with Napoli's Serie A duo Allan and Hirving Lozano - what does this mean for Moise Kean?", "url": "https://www.hitc.com/en-gb/2020/04/27/report-everton-eyeing-three-man-transfer-deal-which-could-cost-1/", "urlToImage": "https://cdn.hitc-s.com/i/1692/carlo_ancelotti_during_the_his_unveiling_press_conference_at_goo_1435432.jpg", "publishedAt": "2020-04-27T16:07:38Z", "content": "Premier LeagueEverton reportedly want to reunite Carlo Ancelotti with Napoli's Serie A duo Allan and Hirving Lozano - what does this mean for Moise Kean?\r\nA stunning triple deal involving Everton and Napoli could cost £130 million this summer, according to Co… [+1488 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Max Rushden, Barry Glendenning, Nicky Bandini, John Brewin, Jonathan Fisher", "title": "The Manchester United v Arsenal rivalry revisited – Football Weekly - The Guardian", "description": "Max Rushden, Barry Glendenning, Nicky Bandini and John Brewin discuss Manchester United 0-1 Arsenal from 2002, Sir Alex Ferguson v Arsène Wenger, legacies, tackles, Mark Venus, ‘Project Restart’ and Detective Wilson", "url": "https://www.theguardian.com/football/audio/2020/apr/27/football-weekly-manchester-united-arsenal-rivalry-project-restart-covid-19-podcast", "urlToImage": "https://i.guim.co.uk/img/media/249e52c02374af0af4d36289e9577f5037dcf560/0_0_1024_614/master/1024.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6fb445bbd032bae48bbe04458ce8393c", "publishedAt": "2020-04-27T15:49:00Z", "content": "Join the conversation on Facebook, Twitter and email.\r\nMax, Barry, Nicky and John discuss the game between United and Arsenal towards the end of the 2001-02 season, where it sat in the evolution of the rivalry between Arsène Wenger and Sir Alex Ferguson, viol… [+401 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Chelsea 2-1 Man Utd | Ballack Blows Title Race Wide Open | Classic Premier League Highlights 2007/08 - Chelsea Football Club", "description": "Michael Ballack's penalty blew the title race open as Chelsea moved level on points with leaders Manchester United with only two matches left. Download Chels...", "url": "https://www.youtube.com/watch?v=ZrwHo7fH5ms", "urlToImage": "https://i.ytimg.com/vi/ZrwHo7fH5ms/maxresdefault.jpg", "publishedAt": "2020-04-27T15:30:13Z", "content": null}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Mark Wakefield", "title": "Liverpool boss Jurgen Klopp questions Trent Alexander-Arnold over defeat in final of FIFA 20 tournament - Liverpool Echo", "description": "Liverpool have released yet another brilliant video from their online yoga sessions", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-boss-jurgen-klopp-questions-18157659", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/sport/football/article18157820.ece/ALTERNATES/s1200/1_Klopp-video.jpg", "publishedAt": "2020-04-27T15:14:04Z", "content": "As the UK lockdown rumbles on, Liverpool continue to provide more uplifting content from the squads online yoga sessions.\r\nThe coronavirus pandemic has led to all professional football in England being suspended indefinitely, with the Reds waiting to find out… [+1975 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Sports Hotline", "title": "The question over Rangers whistleblower dossier that doesn't add up - Hotline - Daily Record", "description": "Fraser Wilson mans the phones as the Ibrox club's fight with the SPFL rumbles on.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/question-over-rangers-whistleblower-dossier-21932496", "urlToImage": "https://i2-prod.dailyrecord.co.uk/incoming/article18777861.ece/ALTERNATES/s1200/0_19159020.jpg", "publishedAt": "2020-04-27T14:29:10Z", "content": "Rangers have vowed to present evidence they claim to have of SPFL skulduggery to all 42 clubs should an EGM over an investigation into the leagues season-ending resolution get the green light. \r\nBut Hotline callers remain split over who is complicit in underh… [+4798 chars]"}, {"source": {"id": null, "name": "Chelseafc.com"}, "author": null, "title": "Billy Gilmour exclusive: 'I was raging after my debut but all I can do is thank the manager for trusting me' | Official Site - Chelsea FC", "description": "In an exclusive interview, Billy Gilmour discusses mixed emotions after his senior debut, Frank Lampard's faith in him, why he didn't go out on loan this season and dealing with the hype after back-to-back standout performances for the Blues...", "url": "https://www.chelseafc.com/en/news/2020/04/27/billy-gilmour-exclusive---i-was-raging-after-my-debut-but-all-i-", "urlToImage": "https://res.cloudinary.com/chelsea-production/image/upload/c_fill,dpr_auto,f_auto,fl_lossy,g_auto,h_320,q_auto,w_640,z_1.0/v1/editorial/news/2020/04/Gilmour_Everton_home", "publishedAt": "2020-04-27T13:49:09Z", "content": "I felt I did well in pre-season but I did think when we came back that Id be going on loan. The gaffer and Jody spoke to me and said they thought it was best for me to stay, play games with the Under-23s and train with the first team a lot more. I was happy w… [+2473 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Man Utd legend Rio Ferdinand slams Graeme Souness over Paul Pogba feud - Metro.co.uk", "description": "'My man's got a World Cup winners' medal!'", "url": "https://metro.co.uk/2020/04/27/rio-ferdinand-hits-graeme-souness-criticism-paul-pogba-defends-manchester-united-star-12616302/", "urlToImage": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2020/04/PRC_149126473_1587992937.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "publishedAt": "2020-04-27T13:41:15Z", "content": "The Scot has been a very vocal critic of the French midfielder (Pictures: Getty / Sky Sports)\r\nRio Ferdinand has waded into Paul Pogbas feud with Graeme Souness, slamming the pundit for his criticism of the Manchester United star and suggesting he is stuck in… [+4640 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Oliver Connolly", "title": "The Green Bay Packers stiffed Aaron Rodgers again and now divorce beckons - The Guardian", "description": "Green Bay failed to give the star quarterback the receivers he needs in last week’s draft. It could be the final straw as the end of his career nears", "url": "https://www.theguardian.com/sport/2020/apr/27/aaron-rodgers-green-bay-packers-nfl-draft-jordan-love", "urlToImage": "https://i.guim.co.uk/img/media/bc71742027789c9ded38ae6da4af0db7e2c1bbf1/0_71_5320_3193/master/5320.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=caad5ed16538d8a5120ae90103e4064e", "publishedAt": "2020-04-27T12:41:00Z", "content": "In 2019, the Green Bay Packers no longer needed Aaron Rodgers to be Aaron Rodgers. Now it seems theyre closer than ever to not needing Aaron Rodgers at all.\r\nMake no mistake, the Packers moving up to select quarterback Jordan Love in the first round of last w… [+5756 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "David McDonnell", "title": "Man Utd's Scott McTominay insists coronavirus lockdown is a reality check for stars - Mirror Online", "description": "Premier League stars who have every whim catered for have had to become self-sufficient - and McTominay says its vital players remember where they came from", "url": "https://www.mirror.co.uk/sport/football/news/man-utds-scott-mctominay-insists-21930632", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21928909.ece/ALTERNATES/s1200/2_Derby-County-v-Manchester-United-FA-Cup-Fifth-Round.jpg", "publishedAt": "2020-04-27T12:09:19Z", "content": "Scott McTominay says footballs enforced break due to the coronavirus has proved a reality check for the Premier Leagues top stars.\r\nPlayers who have everything done for them on a daily basis and every whim catered for, have had to become self-sufficient durin… [+3616 chars]"}, {"source": {"id": "talksport", "name": "TalkSport"}, "author": "Michael Benson", "title": "Watch as Tyson Fury makes “p***ed off” wife Paris do press-ups in lateness spat, but pair make up aft - talkSPORT.com", "description": "", "url": "http://talksport.com/sport/boxing/699451/watch-tyson-fury-paris-press-ups/", "urlToImage": "https://talksport.com/wp-content/uploads/sites/5/2020/04/furythumb.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-04-27T11:43:05Z", "content": "Tyson Fury left his wife Paris Fury “royally p***ed off” after a disagreement during their Instagram Live workout on Monday morning.\r\nThe ‘Gypsy King’ has been running stay-at-home sessions almost every morning during the coronavirus lockdown and punished his… [+2298 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "BBC News", "title": "'I ran the London Marathon on my treadmill' - BBC News", "description": "Complete with fake London landmarks and commentary from legendary voice of the marathon Steve Cram.", "url": "https://www.bbc.co.uk/news/av/newsbeat-52443075/coronavirus-i-ran-the-london-marathon-on-my-treadmill", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/30D1/production/_111979421_p08blqrw.jpg", "publishedAt": "2020-04-27T11:18:52Z", "content": null}, {"source": {"id": null, "name": "Racingpost.com"}, "author": "Jonathan Harding", "title": "Boris Johnson warns against premature end to the coronavirus lockdown - Racing Post", "description": "Boris Johnson believes the UK is \"turning the tide\" against the coronavirus pandemic but has called for patience as the government", "url": "https://www.racingpost.com/news/boris-johnson-warns-against-premature-end-to-the-coronavirus-lockdown/432543", "urlToImage": null, "publishedAt": "2020-04-27T10:23:21Z", "content": "Boris Johnson believes Britain is \"turning the tide\" against the coronavirus pandemic but has called for patience as the government prepares to enter the second phase of its handling of the crisis.\r\nSpeaking outside Downing Street for the first time since rec… [+3455 chars]"}, {"source": {"id": null, "name": "Bavarianfootballworks.com"}, "author": "Ineednoname", "title": "Daily Schmankerl: Bayern Munich set to sign another Celtic prospect, Upamecano’s price could go lower, Hoenes… - Bavarian Football Works", "description": "Somehow there’s still transfer news coming out while all of Europe is under lockdown. Oh and Thomas Muller is a horse.", "url": "https://www.bavarianfootballworks.com/2020/4/27/21238018/bayern-munich-transfer-signing-celtic-barry-hepburn-dayot-upamecano-manuel-neuer-thomas-muller", "urlToImage": "https://cdn.vox-cdn.com/thumbor/jxIdqpyBTiyvloHvakO_49TRSjM=/0x0:3000x1571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19927499/1199710359.jpg.jpg", "publishedAt": "2020-04-27T10:00:00Z", "content": "After signing Liam Morrison last year, it looks like Bayern are set to snatch another youngster away from Celtic Park. According to The Scottish Sun, 16-year-old winger Barry Hepburn is on the German giants radar after rejecting a professional contract with t… [+1976 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Coronavirus: Australia internationals apologise after breaking social distancing rules on camping trip - Sky Sports", "description": "Australia internationals Latrell Mitchell and Josh Addo-Carr have apologised for breaching social distancing rules by going camping in rural New South Wales (NSW).", "url": "https://www.skysports.com/rugby-league/news/12196/11979253/coronavirus-australia-internationals-apologise-after-breaking-social-distancing-rules-on-camping-trip", "urlToImage": "https://e1.365dm.com/20/04/1600x900/skysports-josh-addo-carr-indigenous-all-stars_4977619.jpg", "publishedAt": "2020-04-27T09:03:26Z", "content": "Australia internationals Latrell Mitchell and Josh Addo-Carr have apologised for breaching social distancing rules by going camping in rural New South Wales (NSW). \r\nWith the National Rugby League (NRL) season suspended due to coronavirus, the duo camped at M… [+2460 chars]"}, {"source": {"id": null, "name": "Yorkshireeveningpost.co.uk"}, "author": "James Copley", "title": "Leeds United linked with £22m TRIPLE deal, 22-team Premier League 'unlikely', players and EFL set for contract clash - gossip - Yorkshire Evening Post", "description": "Leeds United's Premier League promotion push is on ice due to the COVID-19 outbreak but there's still plenty of transfer gossip swirling around the web.", "url": "https://www.yorkshireeveningpost.co.uk/sport/football/leeds-united/leeds-united-linked-ps22m-triple-deal-22-team-premier-league-unlikely-players-and-efl-set-contract-clash-gossip-2550533", "urlToImage": "https://www.yorkshireeveningpost.co.uk/webimg/QVNIMTE0NzIzMTA3.jpg", "publishedAt": "2020-04-27T08:04:12Z", "content": "And we've got all the latest Sunday morning news and rumour - including stories from Leeds United, Derby County, Wolves and more!\r\nSimply scroll down and click through the pages to view the latest transfer news and gossip from around the web - and don't forge… [+1034 chars]"}, {"source": {"id": null, "name": "Expressandstar.com"}, "author": null, "title": "Alan Pardew: I will not take survival bonus - expressandstar.com", "description": "Ado Den Haag manager Alan Pardew insists he will not be taking a bonus from the Dutch club for avoiding relegation.", "url": "https://www.expressandstar.com/sport/football/west-bromwich-albion/2020/04/27/alan-pardew-i-will-not-take-survival-bonus/", "urlToImage": "https://www.expressandstar.com/resizer/Ptzipn_IJZZDDs8CY3vQNxJz5QU=/1200x0/filters:quality(100)/arc-anglerfish-arc2-prod-expressandstar-mna.s3.amazonaws.com/public/BUYS5PPY3BBHHEPWNPNURCL3FM.jpg", "publishedAt": "2020-04-27T07:52:00Z", "content": "Ex-Albion boss Pardew, who took charge of the Dutch outfit in December, was reported to have received a sizeable bonus following the Royal Dutch Football Associations (KNVB) decision to cancel the season without promotion or relegation. \r\nPardews side were se… [+472 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Alex Harris", "title": "Newcastle table huge contract proposal to Man Utd target Kalidou Koulibaly - Express", "description": "Newcastle United are reportedly looking to sign Manchester United and Manchester City target Kalidou Koulibaly from Napoli.", "url": "https://www.express.co.uk/sport/football/1274211/Newcastle-News-Kalidou-Koulibaly-Transfer-Man-Utd-Rumours-Gossip", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/67/750x445/1274211.jpg", "publishedAt": "2020-04-27T06:54:00Z", "content": "Newcastle United have tabled a huge contract offer to Napoli superstar Kalidou Koulibaly. The Magpies look set to make a splash if the Premier League approve the £300million takeover bankrolled by Saudi Arabia. Manchester United and Manchester City also hold … [+650 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Robert Warlow", "title": "Crystal Palace and Southampton target drops transfer hint as ex-Eagle names key factor in move - Football.London", "description": "Crystal Palace have been linked with a number of players ahead of the summer transfer window, but one reported target has hinted at a move to join one of the Eagles' rivals", "url": "https://www.football.london/crystal-palace-fc/news/palace-southampton-target-transfer-hint-18152749", "urlToImage": "https://i2-prod.football.london/incoming/article18152715.ece/ALTERNATES/s1200/0_GettyImages-1194779741.jpg", "publishedAt": "2020-04-27T06:10:11Z", "content": "It should have been match day for Crystal Palace as they were scheduled to face Aston Villa in the Premier League this evening in a Monday night clash at Villa Park.\r\nBut with the Premier League and all other professional football leagues in England currently… [+3749 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": null, "title": "The Buzz: Freaky Friday with David and Candice Warner | ESPNcricinfo.com - ESPNcricinfo.com", "description": "All the bantz, the jousts, and little bit of eavesdropping from the social media playground and beyond | https://www.espncricinfo.com/story/_/id/29102611/ravi-bopara-shares-photo-all-round-days", "url": "https://www.espncricinfo.com/story/_/id/29102611/ravi-bopara-shares-photo-all-round-days", "urlToImage": "https://img1.hscicdn.com/image/upload/f_auto/esci/i/cricket/cricinfo/1079150_900x506.jpg", "publishedAt": "2020-04-27T06:05:30Z", "content": "All the world's cricketers walked into a bar. The LOLs, the chatter, and the occasional mini-brawls, they were endless. And the news cycle was never the same again! Welcome to ESPNcricinfo's Social Buzz, your go-to destination for all the bantz, the jousts, a… [+823 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus updates: New Zealand eases lockdown as it 'eliminates' virus - BBC News", "description": "Construction and some non-essential business, healthcare and education activity can now resume.", "url": "https://www.bbc.co.uk/news/live/world-52450742", "urlToImage": "https://m.files.bbci.co.uk/modules/bbc-morph-news-waf-page-meta/4.1.2/bbc_news_logo.png", "publishedAt": "2020-04-27T02:33:09Z", "content": "It seems a lifetime ago. But its just a few months since the biggest story in Australia - and for a few days the world - was the bushfires that burned so fiercely here.\r\nIt followed a long drought, and the role of climate change was heavily debated. Protests … [+1037 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Bill Belichick admits New England Patriots not drafting a quarterback was 'not by design' - Sky Sports", "description": "New England head coach Bill Belichick has admitted not taking a quarterback in the Patriots' first post-Tom Brady draft \"was not by design\".", "url": "https://www.skysports.com/nfl/news/12118/11979177/bill-belichick-admits-new-england-patriots-not-drafting-a-quarterback-was-not-by-design", "urlToImage": "https://e1.365dm.com/19/12/1600x900/skysports-bill-belichick-new-england-patriots_4857303.jpg", "publishedAt": "2020-04-26T22:41:46Z", "content": "New England head coach Bill Belichick has admitted not taking a quarterback in the Patriots' first post-Tom Brady draft \"was not by design\".\r\nThe Patriots selected 10 players in the 2020 NFL Draft, but no quarterbacks to compete for the starting job that was … [+2213 chars]"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Ryan Sidle", "title": "Floyd Mayweather Says Conor McGregor 'Don't Want This' During Training - SPORTbible", "description": "The undefeated boxer might be retired but still found time to taunt his former opponent during a training session on Instagram Live.", "url": "https://www.sportbible.com/boxing/mma-rivalries-floyd-mayweather-says-conor-mcgregor-dont-want-this-during-training-20200426", "urlToImage": "https://images.ladbible.com/thumbnail?type=jpeg&url=http://beta.ems.ladbiblegroup.com/s3/content/3315ea845ea589a8ae4b58e415493829.png&quality=70&width=808", "publishedAt": "2020-04-26T18:22:27Z", "content": "Floyd Mayweather might be retired but he's once again got people thinking about a rematch with Conor McGregor by taking a shot at the UFC star during a training session. \r\nThe American boxer's last professional fight was in 2017 when he beat McGregor, in the … [+2076 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Mikael McKenzie", "title": "Man Utd chief Ed Woodward makes transfer decision which could end Jadon Sancho pursuit - Express", "description": "Manchester United have set out the maximum price they are willing to spend on a player this summer.", "url": "https://www.express.co.uk/sport/football/1274107/Man-Utd-Ed-Woodward-transfer-decision-Jadon-Sancho", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/67/750x445/1274107.jpg", "publishedAt": "2020-04-26T18:02:21Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Jake Polden", "title": "Cristiano Ronaldo's telling reaction to Lionel Messi winning sixth Ballon d'Or award - Mirror Online", "description": "Last year's Ballon d'Or ceremony was one of the most important in recent history because it separated Lionel Messi and Cristiano Ronaldo - perhaps even for good", "url": "https://www.mirror.co.uk/sport/football/news/cristiano-ronaldos-telling-reacting-lionel-21928148", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21928154.ece/ALTERNATES/s1200/0_Screen-Shot-2020-04-26-at-085626.jpg", "publishedAt": "2020-04-26T15:40:43Z", "content": "Lionel Messi or Cristiano Ronaldo?\r\nIt's one of football's biggest debates, with fans on both side of the fence putting forward convincing arguments as to why their favourite is the best player on the planet.\r\nThe careers of the two footballing Goliaths have … [+1698 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Manchester United clear out: Anthony Martial, David De Gea & Juan Mata to stay? | Premier League - ESPN UK", "description": "ESPN FC’s Mark Ogden joins Mark Donaldson to muse over potential Manchester United departures once the transfer window eventually opens. Ogden thinks there’s...", "url": "https://www.youtube.com/watch?v=Y5pOteM-zd0", "urlToImage": "https://i.ytimg.com/vi/Y5pOteM-zd0/maxresdefault.jpg", "publishedAt": "2020-04-26T15:00:21Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Roy Keane's harshest put downs as Jamie Carragher and Paul Pogba among those slated - Mirror Online", "description": "A number of figures across football have been on the receiving end of a tongue-lashing from Keane, who went via the dugout to swap life as Man Utd's skipper for a spot in the pundits chair", "url": "https://www.mirror.co.uk/sport/football/news/roy-keanes-harshest-put-downs-21905979", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21656778.ece/ALTERNATES/s1200/0_Chelsea-vs-Everton-Live.jpg", "publishedAt": "2020-04-26T14:20:19Z", "content": "Roy Keane has never been a man to mince his words - be it on the pitch or off the pitch. \r\n The Irishman helped form the backbone of the Man Utd side which was dominant in the 90s, with Keane chief disciplinarian in his role as captain. \r\nHis penchant to dish… [+6496 chars]"}, {"source": {"id": null, "name": "Examinerlive.co.uk"}, "author": "Josh Challies", "title": "Gary Lineker fears Huddersfield Town and Sheffield Wednesday's league season could be cancelled - ExaminerLive", "description": "The Championship is currently suspended indefinitely due to the coronavirus crisis", "url": "https://www.examinerlive.co.uk/sport/football/news/gary-lineker-fears-huddersfield-town-18152707", "urlToImage": "https://i2-prod.examinerlive.co.uk/incoming/article18152761.ece/ALTERNATES/s1200/0_Gary-Lineker.jpg", "publishedAt": "2020-04-26T12:00:00Z", "content": "Former England and Tottenham striker Gary Lineker has expressed his concern that the 2019/20 Championship campaign may be unable to be completed.\r\nDivisions across England are currently suspended due to the coronavirus crisis, although discussions are ongoing… [+1115 chars]"}]}