{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Oli Gamp For Mailonline", "title": "Adrien Rabiot 'tells Juventus he is on STRIKE and refuses to return' in protest against salary cut - Daily Mail", "description": "The midfielder is said to be in France where he has been isolating after the pandemic halted Italian football on March 9, but he is reportedly refusing to return to Italy amid a disagreement over wages.", "url": "https://www.dailymail.co.uk/sport/football/article-8310773/Adrien-Rabiot-tells-Juventus-STRIKE-refuses-return-protest-against-salary-cut.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/12/10/28294356-0-image-a-17_1589275702845.jpg", "publishedAt": "2020-05-12T10:36:52Z", "content": "Juventus star Adrien Rabiot is reportedly on strike over having his wages cut by £7million in the wake of the coronavirus crisis. \r\nThe midfielder is said to be in France where he has been isolating after the pandemic halted Italian football on March 9, but h… [+2473 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Jamie Anderson", "title": "Man Utd 'very close' to £70m transfer agreement, announcement plan, Chelsea, Arsenal news - Express", "description": "All the latest rumours and gossip coming out of Manchester United, Chelsea, Liverpool, Arsenal, Barcelona and Real Madrid.", "url": "https://www.express.co.uk/sport/football/1280950/Transfer-News-Live-Updates-Man-Utd-Chelsea-Arsenal-Liverpool-Barcelona-Latest", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/67/750x445/1280950.jpg", "publishedAt": "2020-05-12T10:34:19Z", "content": null}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "James Rushton", "title": "'I wish I had known' - Darren Fletcher reveals his biggest West Brom regret - Birmingham Live", "description": "West Brom news | The dressing room culture set the two clubs apart", "url": "https://www.birminghammail.co.uk/sport/football/football-news/i-wish-known-darren-fletcher-18236662", "urlToImage": "https://i2-prod.birminghammail.co.uk/incoming/article18236648.ece/ALTERNATES/s1200/0_West-Bromwich-Albion-v-Tottenham-Hotspur-Premier-League.jpg", "publishedAt": "2020-05-12T10:23:29Z", "content": "If you're going to leave West Bromwich Albion, you need to think twice according to Darren Fletcher. \r\nThe Manchester United trainee turned out over two-hundred times for the Red Devils before making nearly another one-hundred appearances for West Brom during… [+2079 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Ian Doyle", "title": "Diego Simeone hits back at 'lucky' Liverpool critics in fresh Champions League claim - Liverpool Echo", "description": "Liverpool were beaten by Atletico Madrid in the Champions League earlier this year", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/diego-simeone-hits-back-lucky-18237129", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article17908783.ece/ALTERNATES/s1200/0_JS208827823.jpg", "publishedAt": "2020-05-12T10:16:27Z", "content": "Diego Simeone has once again hit back at those who consider Atletico Madrid's Champions League win over Liverpool as being \"lucky\".\r\n The Reds lost their grip on the European Cup when they were beaten 4-2 on aggregate by the La Liga side in the round of 16 in… [+1223 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Danny Rose criticises Premier League restart plans amid coronavirus pandemic - BBC Sport", "description": "England defender Danny Rose criticises the Premier League's plans to restart the season amid the coronavirus pandemic.", "url": "https://www.bbc.co.uk/sport/football/52630497", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/10BF1/production/_112239586_dannyrose.jpg", "publishedAt": "2020-05-12T10:14:51Z", "content": "Danny Rose is on a season-long loan deal at Newcastle United\r\nEngland and Tottenham defender Danny Rose has criticised the Premier League's plans to restart the season amid the coronavirus pandemic.\r\nClub officials met on Monday to continue talks on \"Project … [+2066 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "THROWBACK |BRIGHTON 1-4 CITY | PL TITLE #4 | On This Day 12th May 2019 - Man City", "description": "We retained the Premier League title and finally ended Liverpool's challenge after surviving a scare to come from behind and outclass Brighton at the Amex. P...", "url": "https://www.youtube.com/watch?v=uFH9oW6VDc0", "urlToImage": "https://i.ytimg.com/vi/uFH9oW6VDc0/maxresdefault.jpg", "publishedAt": "2020-05-12T10:00:11Z", "content": null}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Keith Jackson, Michael Gannon", "title": "The Inverness null and void plan as Scottish football civil war takes new twist - Daily Record", "description": "The bombshell plan would have cost Caley £175,000.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/secret-inverness-plan-null-void-22011151", "urlToImage": "https://i2-prod.dailyrecord.co.uk/incoming/article21875307.ece/ALTERNATES/s1200/0_18912753.jpg", "publishedAt": "2020-05-12T09:22:59Z", "content": "Scottish footballs raging civil war has taken an explosive twist after a group of Championship clubs confirmed Inverness Caley Thistle attempted to null and void the entire league season across all four divisions.\r\nThe Highlanders were caught up in the eye of… [+5150 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sam Baker For Mailonline", "title": "'No FUR-loughs': BBC commentator stages hilarious Zoom 'business meeting' with his two dogs - Daily Mail", "description": "BBC sports commentator Andrew Cotter, 46, and his labradors Olive and Mabel have entertained fans on Twitter after posting a video of their business meeting held on Zoom at home in Cheshire.", "url": "https://www.dailymail.co.uk/news/article-8310535/No-FUR-loughs-BBC-commentator-stages-hilarious-Zoom-business-meeting-two-dogs.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/12/08/28291446-0-image-a-7_1589269838381.jpg", "publishedAt": "2020-05-12T09:20:59Z", "content": "A BBC Sport commentator and his two labradors have entertained fans on Twitter with a hilarious video of a team meeting on Zoom.\r\nAndrew Cotter, 46, who lives in Cheshire, posted a video last month of his dogs Olive and Mabel competing in an eating race and a… [+3218 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Mark McDougall", "title": "Stenhousemuir deliver Rangers resolution support as they slam 'embarrassing' SPFL rows - Daily Record", "description": "The Warriors insist they aren't taking sides in the debate but will vote yes to the resolution put forward by Rangers, Hearts and Stranraer.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/stenhousemuir-deliver-rangers-resolution-support-22012761", "urlToImage": "https://i2-prod.dailyrecord.co.uk/incoming/article21727361.ece/ALTERNATES/s1200/0_14805407.jpg", "publishedAt": "2020-05-12T09:04:38Z", "content": "Stenhousemuir have become the latest club to throw their weight behind an independent investigation after confirming they will vote in favour of today's resolution.\r\n The 42 clubs will meet via video call at 11am with a ballot to be held on the resolution put… [+3922 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Jürgen Klopp's heartwarming surprise calls to three Liverpool fans - Liverpool FC", "description": "Watch as Jürgen Klopp, along with the LFC Foundation, called up three supporters, who were currently isolating for a variety of reasons to check up on their ...", "url": "https://www.youtube.com/watch?v=FcC7DsQM55c", "urlToImage": "https://i.ytimg.com/vi/FcC7DsQM55c/maxresdefault.jpg", "publishedAt": "2020-05-12T09:00:08Z", "content": "Watch as Jürgen Klopp, along with the LFC Foundation, called up three supporters, who were currently isolating for a variety of reasons to check up on their progress in lockdown.\r\nEnjoy more content and get exclusive perks in our Liverpool FC Members Area, cl… [+192 chars]"}, {"source": {"id": null, "name": "Football365.com"}, "author": "Joe Williams", "title": "Wenger picks his best mid-season signing for Arsenal; snubs Auba - Football365.com", "description": "Football365 - Arsene Wenger has picked his best mid-season signing at Arsenal with Pierre-Emerick Aubameyang missing out.", "url": "https://www.football365.com/news/arsene-wenger-best-mid-season-signing-arsenal-pierre-emerick-aubameyang-kanu", "urlToImage": "https://d2x51gyc4ptf2q.cloudfront.net/content/uploads/2019/06/27144947/Arsene-Wenger-Arsenal-F365.jpg", "publishedAt": "2020-05-12T08:40:32Z", "content": "Arsene Wenger has picked Kanu as his best mid-season signing at Arsenal with Pierre-Emerick Aubameyang not making the cut.\r\nThe Frenchman brought in Aubameyang in January 2018 but Wenger only enjoyed his performances at close quarters for six months before le… [+1239 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Kaveh Solhekol", "title": "Premier League clubs facing 'summer of chaos' without season restart, says club owner - Sky Sports", "description": "A Premier League club owner warns teams are facing \"a summer of chaos\" if the season is not restarted.", "url": "https://www.skysports.com/football/news/11661/11986833/premier-league-clubs-facing-summer-of-chaos-without-season-restart-says-club-owner", "urlToImage": "https://e2.365dm.com/20/05/1600x900/skysports-premier-league-coronavirus_4988466.jpg", "publishedAt": "2020-05-12T08:35:33Z", "content": "A Premier League club owner warns teams are facing \"a summer of chaos\" if the season is not restarted and says there is a \"40 per cent\" chance the campaign will be cancelled.\r\nThe owner, who did not want to be named, says many players do not want to go back t… [+2317 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Eric Cantona told he's 'not in the same league' as Thierry Henry - Mirror Online", "description": "The Frenchmen were pivotal figures for Man Utd and Arsenal respectively during dominant periods in both clubs' histories, though Redknapp feels Henry had more than an edge over his compatriot", "url": "https://www.mirror.co.uk/sport/football/news/eric-cantona-told-hes-not-22012425", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article22012409.ece/ALTERNATES/s1200/0_Soccer-FA-Carling-Premiership-Manchester-United-v-Sunderland-Old-Trafford.jpg", "publishedAt": "2020-05-12T08:28:12Z", "content": "Jamie Redknapp has claimed that Eric Cantona was 'not in the same league' as Thierry Henry as a player. \r\n The former Man Utd captain is regarded as one of the club's all-time greats, and won four Premier League titles before hanging up his boots prematurely … [+2569 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Reuters", "title": "Laporta wants Guardiola back if he wins election to be Barcelona president - The Guardian", "description": "Joan Laporta has said he will attempt to bring Pep Guardiola back to Barcelona as manager if his push to return as president in 2021 is successful", "url": "https://www.theguardian.com/football/2020/may/12/joan-laporta-wants-pep-guardiola-back-if-he-wins-election-to-be-barcelona-president-manchester-city", "urlToImage": "https://i.guim.co.uk/img/media/98517fa39691134bc5e87adf3d895e8420b20276/0_73_3480_2088/master/3480.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=76982a57c83dfc128b463378933a714b", "publishedAt": "2020-05-12T07:47:55Z", "content": "Joan Laporta has said he will attempt to bring Pep Guardiola back to Barcelona if his push to return as president of the club in 2021 is successful.\r\nLaporta was Barcelonas president from 2003 to 2010 and was at the helm when Guardiola was promoted to manager… [+1054 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Coronavirus: As golf courses reopen in England, new guidelines must be followed - Sky Sports", "description": "Golf courses in England are set to reopen on Wednesday, but what new rules, regulations and guidelines do you need to know?", "url": "https://www.skysports.com/golf/news/12177/11984203/coronavirus-as-golf-courses-reopen-in-england-new-guidelines-must-be-followed", "urlToImage": "https://e2.365dm.com/20/01/1600x900/skysports-golf-generic-ball_4902276.jpg", "publishedAt": "2020-05-12T07:17:10Z", "content": "Golf courses in England are set to reopen on Wednesday, but what new rules, regulations and guidelines do you need to know about before dusting off your clubs?\r\nThe government announced on Sunday that \"some sports activity\" will be permitted from this week, w… [+3002 chars]"}, {"source": {"id": null, "name": "Liverpoolfc.com"}, "author": null, "title": "'Immense' - Jordan Henderson on Virgil van Dijk's impact at LFC - Liverpool FC", "description": "Virgil van Dijk’s ‘immense’ contribution on the pitch has been matched by his impact off it at Liverpool, Jordan Henderson has explained.", "url": "https://www.liverpoolfc.com/news/first-team/395050-jordan-henderson-virgil-van-dijk-immense-impact-liverpool", "urlToImage": "https://d3j2s6hdd6a7rg.cloudfront.net/v2/uploads/media/default/0002/06/thumb_105156_default_news_size_5.jpeg", "publishedAt": "2020-05-12T07:15:00Z", "content": "Virgil van Dijks immense contribution on the pitch has been matched by his impact off it at Liverpool, Jordan Henderson has explained.\r\n Since arriving at Anfield in January 2018, Van Dijk has been a cornerstone of a side that has won three major trophies, re… [+1475 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Joe Bray", "title": "Manchester United fans hit back as Twitter user calls Marcus Rashford overrated - Manchester Evening News", "description": "Man United striker Marcus Rashford is enjoying his most prolific season at the club, but some feel fans are exaggerating his abilities.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-utd-rashford-ronaldo-news-18235865", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/sport/football/football-news/article18235876.ece/ALTERNATES/s1200/0_rashford-overrated.jpg", "publishedAt": "2020-05-12T07:09:58Z", "content": "Manchester United fans have leapt to the defence of striker Marcus Rashford after a Twitter thread appeared arguing that he is overrated.\r\nThe provocative thread from user @ballrespect - which received thousands of reactions - was titled: \"marcus rashford. th… [+2243 chars]"}, {"source": {"id": null, "name": "Formula1.com"}, "author": "F1", "title": "Sebastian Vettel to leave Ferrari at the end of 2020 F1 season, team confirm - Formula 1", "description": "Sebastian Vettel’s future in Formula 1 beyond the end of 2020 has been thrown into doubt after it was announced the German and Ferrari will part ways at the end of the year…", "url": "https://www.formula1.com/en/latest/article.breaking-news-sebastian-vettel-to-leave-ferrari-at-the-end-of-2020-f1-season.KBuBQw6AsUvOhB6p7IU9c.html", "urlToImage": "https://www.formula1.com/content/dam/fom-website/sutton/2020/Australia/Thursday/1211948251.jpg", "publishedAt": "2020-05-12T07:06:13Z", "content": "Sebastian Vettels future in Formula 1 beyond the end of 2020 has been thrown into doubt after it was announced the German and Ferrari will part ways at the end of the year\r\nVettel and Ferrari have been in talks for several months about an extension, with Team… [+3743 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "FA Cup Classic: Arsenal 1-2 Liverpool | Late comeback helps towards cup treble - Liverpool FC", "description": "Relive Liverpool's dramatic FA Cup final comeback at Cardiff's Millenium Stadium, as Michael Owen's double strike ensured the cup returned to Merseyside, add...", "url": "https://www.youtube.com/watch?v=y54DrDfVTtc", "urlToImage": "https://i.ytimg.com/vi/y54DrDfVTtc/maxresdefault.jpg", "publishedAt": "2020-05-12T07:00:22Z", "content": "Relive Liverpool's dramatic FA Cup final comeback at Cardiff's Millenium Stadium, as Michael Owen's double strike ensured the cup returned to Merseyside, adding to that season's League Cup success to make it two wins in Wales. \r\nEnjoy more content and get exc… [+241 chars]"}, {"source": {"id": null, "name": "Liverpool.com"}, "author": "David Alexander Hughes", "title": "Liverpool have chance to sign final piece of midfield jigsaw, but vocal opposition provides problem - Liverpool.com", "description": "It's easy to see why Liverpool want this Lyon midfielder, but do they want to go through the same tedious negotiations", "url": "https://www.liverpool.com/liverpool-fc-news/transfer-news/houssem-aouar-liverpool-news-lyon-18235452", "urlToImage": "https://i2-prod.liverpool.com/liverpool-fc-news/transfer-news/article18235398.ece/ALTERNATES/s1200/0_A3PNG.png", "publishedAt": "2020-05-12T07:00:00Z", "content": "Lyons disappointing campaign was brought to an abrupt end earlier this month when Ligue 1 officials opted to end the campaign on a Points-Per-Game (PPG) basis as a result of the breakout of COVID-19.\r\nThe French side sat seventh in the table and as a result h… [+4896 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Reubyn Coutinho", "title": "“He Was Never the Level Perceived” – Conor McGregor on Tony Ferguson - Essentially Sports", "description": "Conor Mcgregor offered his sympathies to the fallen Tony Ferguson and opined that his preparations may have resulted in his downfall at UFC 249.", "url": "https://www.essentiallysports.com/ufc-news-he-was-never-the-level-perceived-conor-mcgregor-on-tony-ferguson/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200408194631/Conor-McGregor-at-Boston-press-conference-Jeff-Bottari-Zuffa-LLC-1.jpg", "publishedAt": "2020-05-12T06:23:22Z", "content": "Tony Ferguson fell to Justin Gaethje at UFC 249 and lost a hard-earned opportunity at Khabib Nurmagomedov. Additionally, his nearly 8 year long 12-fight undefeated streak came to an end. As a result, he has earned a lot of sympathy from all quarters around th… [+2559 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Antonio Conte: Coaching a Chelsea legend like John Terry was a great privilege - Sky Sports", "description": "Antonio Conte says phasing out John Terry during his title-winning first season was a simple process because of the Chelsea legend's professionalism.", "url": "https://www.skysports.com/football/news/11668/11986801/antonio-conte-coaching-a-chelsea-legend-like-john-terry-was-a-great-privilege", "urlToImage": "https://e1.365dm.com/20/05/1600x900/skysports-john-terry-antonio-conte_4988414.jpg", "publishedAt": "2020-05-12T05:23:29Z", "content": "Antonio Conte has revealed the phasing out of John Terry during his title-winning first season was a simple process because of the Chelsea legend's professionalism.\r\nMichy Batshuayi's late goal at West Brom confirmed the Blues as champions exactly three years… [+1595 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Round Three: Mike Tyson hints at new bout with old rival Evander Holyfield - Sky News", "description": "Since hinting at a return, opponents have been lining up to fight Tyson including rugby stars Sonny Bill Williams and Paul Gallen.", "url": "https://news.sky.com/story/round-three-mike-tyson-hints-at-new-bout-with-old-rival-evander-holyfield-11986823", "urlToImage": "https://e3.365dm.com/20/05/1600x900/skynews-tyson-holyfield-19971_4988449.jpg?20200512044743", "publishedAt": "2020-05-12T04:54:37Z", "content": null}, {"source": {"id": null, "name": "Liverpool.com"}, "author": "Andrew Beasley", "title": "Liverpool can follow Man City and create relationship to unearth Anfield's own Kevin de Bruyne - Liverpool.com", "description": "With Manchester City announcing yet another 'feeder club' link-up, could Liverpool look across Europe to strike a similar relationship?", "url": "https://www.liverpool.com/liverpool-fc-news/transfer-news/liverpool-man-city-premier-league-18233637", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article17482891.ece/ALTERNATES/s1200/2_GettyImages-1193718299.jpg", "publishedAt": "2020-05-12T04:00:00Z", "content": "Manchester Citys parent company, the City Football Group (CFG), have agreed a deal for Lommel SK, a second tier Belgian side. They have become the ninth team in the CFG portfolio, alongside clubs such as New York City FC, Melbourne City FC, Yokohama F. Marino… [+3223 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Brian Dick", "title": "West Brom 'intend to buy' the €6.5m international who escaped Manchester United - report - Birmingham Live", "description": "It is claimed Baggies boss Slaven Bilic was interested in the attacking midfielder when he was manager at West Ham", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/west-brom-manchester-united-bilic-18234566", "urlToImage": "https://i2-prod.birminghammail.co.uk/incoming/article18234590.ece/ALTERNATES/s1200/0_Serbia-v-Georgia-FIFA-2018-World-Cup-Qualifier.jpg", "publishedAt": "2020-05-12T03:09:18Z", "content": "The transfer window isnt open - who knows when that will happen - but that hasnt stopped the Turkish rumour mill going into overdrive.\r\n Particularly where West Bromwich Albion are concerned - with several outlets crediting Slaven Bilic with an interest in de… [+1254 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Ian Wright 'fighting' after racist messages sent to him on social media - BBC Sport", "description": "Arsenal legend Ian Wright says he is \"fighting all the way\" after being sent \"humiliating\" and \"dehumanising\" racist abuse.", "url": "https://www.bbc.co.uk/sport/football/52625946", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/13BC1/production/_112233808_whatsubject.jpg", "publishedAt": "2020-05-12T02:14:10Z", "content": "Ian Wright was Arsenal's record goalscorer with 185 until he was surpassed by Thierry Henry\r\nFormer Arsenal and England striker Ian Wright says he is \"fighting this all the way\" after being sent \"humiliating\" and \"dehumanising\" racist abuse on social media. \r… [+2209 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Ian Doyle", "title": "Sadio Mane made Liverpool boss Jurgen Klopp want to punch himself over transfer mistake - Liverpool Echo", "description": "Liverpool's feared strikeforce didn't happen overnight - and the second part wasn't one Jurgen Klopp had prioritised", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/sadio-mane-made-liverpool-boss-18223211", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article11748115.ece/ALTERNATES/s1200/JS97112560.jpg", "publishedAt": "2020-05-12T02:06:47Z", "content": "They are the arguably the most celebrated attacking trio in Premier League history, the strikeforce that shot Liverpool towards becoming European and world champions and frightened Pep Guardiola in the process. But it didnt happen overnight. The Reds already … [+7000 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Oscar Paul", "title": "Newcastle’s £300million Saudi takeover facing more delays over PIRACY accusations sent to Premier League - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11600945/newcastle-takeover-saudi-piracy-beoutq/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/05/NINTCHDBPICT000568931495.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-05-12T00:27:36Z", "content": "NEWCASTLES £300million Saudi Arabia-funded takeover faces further delays after the Premier League received new documents over piracy accusations.\r\nThe evidence is claimed to establish a clear link between the Saudi state and a pirate TV service which streams … [+1885 chars]"}, {"source": {"id": null, "name": "Theguardian.comsport"}, "author": "Guardian sport", "title": "Australia-only Super Rugby competition to include axed Western Force - The Guardian", "description": "A version of Super Rugby will recommence with an Australian-only competition comprising five teams, including the Western Force, being planned according to reports", "url": "https://amp.theguardian.comsport/2020/may/11/australian-only-super-rugby-competition-to-include-axed-western-force", "urlToImage": "https://i.guim.co.uk/img/media/eb70f410717435ffb6f927fa011a8b0cd1cfa2d9/0_308_4645_2787/master/4645.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=bc2027d9aecda74eb65741d51c8ab707", "publishedAt": "2020-05-11T23:14:57Z", "content": "An adapted version of Super Rugby will recommence with an Australian-only competition comprising five or six teams, including the Western Force, being planned to start in early July.\r\nRA has released a return-to-play strategy with the aim of starting a 12-wee… [+2940 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Formula 1: British Grand Prix under threat over money - BBC Sport", "description": "The British Grand Prix is under threat this year because of a financial stand-off between Formula 1 and Silverstone.", "url": "https://www.bbc.co.uk/sport/formula1/52612210", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/544E/production/_112228512_lewishamilton.jpg", "publishedAt": "2020-05-11T23:01:54Z", "content": "Silverstone has held the British Grand Prix every year since 1987\r\nThe British Grand Prix is under threat this year because of a financial stand-off between Formula 1 and Silverstone.\r\nF1 believes Silverstone is making unreasonable demands to host races on co… [+4112 chars]"}, {"source": {"id": null, "name": "Theguardian.comsport"}, "author": "Greg Wood", "title": "Racing committed to June return after sport sent back to drawing board - The Guardian", "description": "The British Horseracing Authority to publish new timeline for disrupted season within seven days after government thwarts plans for sport to return this month", "url": "https://amp.theguardian.comsport/2020/may/11/horse-racing-hope-of-return-sent-back-drawing-board-government-sport-june", "urlToImage": "https://i.guim.co.uk/img/media/d1a7a623bad4744510e370b9f95750fbe995dbec/279_0_3145_1887/master/3145.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=47671f7086c2665c1aae3208d56dbb56", "publishedAt": "2020-05-11T22:38:54Z", "content": "The British Horseracing Authority said on Monday that the sport is committed to plan for resumption on 1 June and will agree a timeline to achieve that target within seven days, after the publication of a government roadmap out of lockdown which ruled out the… [+3708 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Jake Polden", "title": "How Kylian Mbappe 'responded' to Liverpool boss Jurgen Klopp phoning his dad - Mirror Online", "description": "Liverpool have been linked with a sensational transfer for PSG's Kylian Mbappe in recent weeks, amid claims Real Madrid are ready to go all out to sign Sadio Mane", "url": "https://www.mirror.co.uk/sport/football/news/how-kylian-mbappe-responded-liverpool-22011428", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article13267314.ece/ALTERNATES/s1200/0_MAIN-Mbappe-charmed-by-Klopp-but-they-couldnt-sign-him-for-one-reason.jpg", "publishedAt": "2020-05-11T21:42:49Z", "content": "Kylian Mbappe was reportedly 'flattered' that Jurgen Klopp called his father to register his interest in signing him.\r\nLiverpool have been linked with a sensational transfer for Mbappe in recent weeks, amid claims Real Madrid are ready to go all out to sign S… [+1401 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Shane Ireland", "title": "Piers Morgan makes three-word demand with major implications for Aston Villa - Birmingham Live", "description": "Aston Villa news - Piers Morgan wants to see the Premier League season cancelled as AVFC battle relegation", "url": "https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-news-piers-morgan-18235734", "urlToImage": "https://i2-prod.birminghammail.co.uk/incoming/article17993611.ece/ALTERNATES/s1200/4_RLP_MDG_21879221162315526742JPG.jpg", "publishedAt": "2020-05-11T21:33:15Z", "content": "Piers Morgan has called for the 2019/20 season to be cancelled due to the coronavirus pandemic.\r\nAston Villa's bid for Premier League survival has been on hold since mid-March, when football in England was suspended.\r\nDean Smith's side, who are 19th in the ta… [+1563 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "UEFA warns it will not amend Champions League qualification process - Sky Sports", "description": "UEFA has insisted it is not thinking about amending any qualification for the\nChampions League.", "url": "https://www.skysports.com/football/news/11945/11986770/uefa-warns-it-will-not-amend-champions-league-qualification-process", "urlToImage": "https://e1.365dm.com/19/12/1600x900/skysports-liverpool-champions-league_4868261.jpg", "publishedAt": "2020-05-11T21:12:10Z", "content": "UEFA has insisted it is not thinking about amending any qualification for the\r\nChampions League.\r\nEurope's football governing body says it is monitoring the situation, with the coronavirus pandemic having stopped football across the world.\r\n\"UEFA has never co… [+848 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Sean Ingle", "title": "New shape of sport begins to emerge: team games and elite level set to lose out - The Guardian", "description": "Monday’s announcements from the government offer a little clarity but while some sports can see green shoots of recovery, for others there are few reasons for optimism", "url": "https://www.theguardian.com/sport/2020/may/11/new-shape-of-sport-begins-to-emerge-team-games-and-elite-level-set-to-lose-out", "urlToImage": "https://i.guim.co.uk/img/media/96d66e8d1cdcd222e2491ddf2c6678afe998870a/162_184_3216_1930/master/3216.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8f79d1e32afc4e57d601c4c67c02b6b3", "publishedAt": "2020-05-11T20:47:00Z", "content": "Finally, after weeks of claustrophobia and a weekend of confusion, some clarity. From Wednesday, tennis players and golfers in England will be able to lubricate rusty swings and overly tight hips again. Basketball players will be able to dunk and shoot from d… [+4774 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Julien Laurens has 'NO SYMPATHY' for Manchester City's Kyle Walker | ESPN FC - ESPN UK", "description": "ESPN FC’s Gabriel Marcotti and Julien Laurens give their ‘quick hits' including Juventus’ Giorgio Chiellini’s comments about Mario Balotelli and Felipe Melo,...", "url": "https://www.youtube.com/watch?v=j2vZ7sUkiv4", "urlToImage": "https://i.ytimg.com/vi/j2vZ7sUkiv4/maxresdefault.jpg", "publishedAt": "2020-05-11T20:30:02Z", "content": "ESPN FCs Gabriel Marcotti and Julien Laurens give their quick hits' including Juventus Giorgio Chiellinis comments about Mario Balotelli and Felipe Melo, Louis van Gaal calling out Ed Woodward for being an evil genius, and Manchester Citys Kyle Walker claimin… [+453 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Andrew Dowdeswell", "title": "Arsenal evening headlines as Arteta closes in on signing and Edu could land next Martinelli - Football.London", "description": "All the latest Arsenal news. views and transfer rumours from football.london", "url": "https://www.football.london/arsenal-fc/news/arsenal-evening-headlines-martinelli-tierney-18233809", "urlToImage": "https://i2-prod.football.london/incoming/article18235766.ece/ALTERNATES/s1200/0_george-lewis-arsenal-gfx_1u6n6dbq4fnkl16q0s9zf3l28j.jpg", "publishedAt": "2020-05-11T19:01:00Z", "content": "Here are your Arsenal evening headlines for Monday, May 11th.\r\nArsenal eye next Gabriel Martinelli\r\nAfter pulling the rabbit out of the hat by signing starlet Gabriel Martinelli from the fourth tier of Brazilian football last summer, Arsenal are looking to re… [+3292 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Ryder Cup: Zach Johnson and Davis Love III named US vice-captains - Sky Sports", "description": "US Ryder Cup captain Steve Stricker has announced Davis Love III and Zach Johnson as his next two vice-captains.", "url": "https://www.skysports.com/golf/news/12176/11986713/ryder-cup-zach-johnson-and-davis-love-iii-named-us-vice-captains", "urlToImage": "https://e1.365dm.com/20/03/1600x900/skysports-davis-love-iii_4956810.jpg", "publishedAt": "2020-05-11T18:30:27Z", "content": "US Ryder Cup captain Steve Stricker has announced Davis Love III and Zach Johnson as his next two vice-captains.\r\nLove and Johnson join Jim Furyk - who led the 2018 team - after he was named as Stricker's first pick, while European captain Padraig Harrington … [+2614 chars]"}, {"source": {"id": null, "name": "Autosport.com"}, "author": "Gary Watkins", "title": "Le Mans News: Corvette Racing withdraws from 2020 Le Mans 24 Hours - Autosport", "description": "Corvette Racing has withdrawn its pair of GTE Pro class C8.Rs from the rescheduled Le Mans 24 Hours in September", "url": "https://www.autosport.com/wec/news/149385/corvette-withdraws-from-2020-le-mans-24-hours", "urlToImage": "https://d2d0b2rxqzh1q5.cloudfront.net/sv/1.67/dir/39a/image/39af875413170b35e1f6b3c33a7d6e50.jpg", "publishedAt": "2020-05-11T18:29:59Z", "content": "Corvette Racing has withdrawn its pair of GTE Pro class C8.Rs from the rescheduled Le Mans 24 Hours in September.\r\nA statement from Jim Campbell, vice-president of motorsports and performance, said that \"several factors played into our decision, including cur… [+1838 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Lee Ryder", "title": "Gossip: The clause in Gareth Bale's Real Madrid deal that may give revamped Newcastle hope - Chronicle Live", "description": "Newcastle United have been linked with Gareth Bale but a deal for the Welsh wizard is not as crazy as you think", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/gareth-bale-newcastle-real-madrid-18232893", "urlToImage": "https://i2-prod.chroniclelive.co.uk/incoming/article18233236.ece/ALTERNATES/s1200/0_Bale-copy.jpg", "publishedAt": "2020-05-11T17:29:34Z", "content": "Newcastle United would get a fair crack at signing Gareth Bale if their £300million takeover deal goes through.\r\nThe out-of-favour Real Madrid man at one stage had a clause in his contract that allowed his old club Tottenham Hotspur to be notified if the La L… [+1879 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How the Bundesliga plans to deal with potential cases of coronavirus | ESPN FC - ESPN UK", "description": "ESPN FC’s Gab Marcotti and Julien Laurens discuss how the Bundesliga is planning on dealing with any cases of coronavirus within players and clubs. Marcotti ...", "url": "https://www.youtube.com/watch?v=d7WkQkK-WVw", "urlToImage": "https://i.ytimg.com/vi/d7WkQkK-WVw/maxresdefault.jpg", "publishedAt": "2020-05-11T17:00:26Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Isabelle Barker", "title": "Ighalo joined by mystery female training partner as Man Utd ace exercises in public park with his future - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/11597758/ighalo-female-training-utd-future/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/05/SPORT-PREVIEW-Ighalo.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-05-11T17:00:14Z", "content": "MANCHESTER UNITED ace Odion Ighalo was pictured with a mystery female training partner as he exercised in a public park in Cheshire. \r\nThe on-loan striker's Old Trafford future is hanging in the balance with Shanghai Shenhua looking to snare the Nigeria ace b… [+2650 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Chris Beesley", "title": "RB Leipzig make Werner admission, Liverpool look to raid Arsenal and other transfer rumours rated - Liverpool Echo", "description": "A round-up of the latest Liverpool transfer rumours including Timo Werner and Houssem Aouar", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/rb-leipzig-make-werner-admission-18230916", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/sport/football/football-news/article18189892.ece/ALTERNATES/s1200/0_JS206835931.jpg", "publishedAt": "2020-05-11T16:39:45Z", "content": "Premier League clubs are thrashing out how to bring the 2019/20 season to a satisfactory conclusion through Project Restart but even though weve been without on-the-field action for a couple of months now, Liverpool transfer speculation remains rife.\r\nHeres a… [+3836 chars]"}, {"source": {"id": null, "name": "Yorkshireeveningpost.co.uk"}, "author": "Lee Sobot", "title": "When can fans watch Leeds United live again? - Yorkshire Evening Post", "description": "AFTER an important 24 hours for football in the country's battle against coronavirus, Lee Sobot looks at the current state of play and when supporters might be able to watch the Whites next.", "url": "https://www.yorkshireeveningpost.co.uk/sport/football/leeds-united/when-can-fans-watch-leeds-united-live-again-2849624", "urlToImage": "https://www.yorkshireeveningpost.co.uk/webimg/QVNIMTE0OTE3MDg4.jpg", "publishedAt": "2020-05-11T16:33:09Z", "content": "Will the current season be properly concluded?\r\nThat remains the million dollar question but both the Premier League and EFL have always maintained a desire to fulfil their remaining fixtures when it is safe to do so.\r\nThere have, however, been reports that t… [+6092 chars]"}, {"source": {"id": null, "name": "Planetf1.com"}, "author": "", "title": "Rosberg pinpoints 2014 as Hamilton turning point | PlanetF1 - PlanetF1", "description": "Nico Rosberg has said that he felt the 2014 season was the turning point from friends to rivals with Mercedes team-mate Lewis Hamilton.", "url": "https://www.planetf1.com/news/nico-rosberg-lewis-hamilton-rivalry/", "urlToImage": "https://d3cm515ijfiu6w.cloudfront.net/wp-content/uploads/2020/01/23093339/Lewis-Hamilton-and-Nico-Rosberg-PA.jpg", "publishedAt": "2020-05-11T16:13:43Z", "content": "Nico Rosberg has said that he felt the 2014 season was the turning point from friends to rivals with Mercedes team-mate Lewis Hamilton.\r\nRosberg and Hamilton were childhood friends as they climbed the ranks together all the way to Formula 1 and, following Mic… [+1747 chars]"}, {"source": {"id": "talksport", "name": "TalkSport"}, "author": "Jake Bacon", "title": "Borussia Dortmund eye Chelsea youngster Charlie Webster dubbed ‘next Jadon Sancho’ - talkSPORT.com", "description": "", "url": "http://talksport.com/football/704631/borussia-dortmund-chelsea-charlie-webster-jadon-sancho/", "urlToImage": "https://talksport.com/wp-content/uploads/sites/5/2020/05/NINTCHDBPICT000581570533.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-05-11T15:57:52Z", "content": "Borussia Dortmund are interested in signing Chelsea wonderkid Charlie Webster, according to reports.\r\nThe Bundesliga giants are renowned for giving youth a chance with Jadon Sancho starring in Germany.\r\nCharlie Webster, 16, is one of several talented youngste… [+1403 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Jake Polden", "title": "Andrea Rinaldi dead: Atalanta midfielder, 19, dies from brain aneurysm - Mirror Online", "description": "Andrea Rinaldi, who had been on loan at Legnano from Atalana, fell ill on Friday while training at home during the coronavirus lockdown and died in hospital in Varese", "url": "https://www.mirror.co.uk/sport/football/news/andrea-rinaldi-dead-atalanta-midfielder-22009807", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article22009804.ece/ALTERNATES/s1200/0_Andrea-Rinaldi.jpg", "publishedAt": "2020-05-11T15:08:14Z", "content": "Atalanta midfielder Andrea Rinaldi has died from a brain aneurysm aged 19.\r\n The teenager fell ill on Friday while training at home during the coronavirus lockdown and was taken to hospital in Varese, where he passed away on Monday. \r\nRinaldi had been on loan… [+1631 chars]"}, {"source": {"id": null, "name": "Football365.com"}, "author": "Joe Williams", "title": "Maguire picks out Man Utd man as most talented he's played with - Football365.com", "description": "Football365 - Club captain Harry Maguire says one Man Utd forward is the most talented player he has ever played with.", "url": "https://www.football365.com/news/harry-maguire-marcus-rashford-man-utd-most-talented", "urlToImage": "https://d2x51gyc4ptf2q.cloudfront.net/content/uploads/2020/05/11151817/Harry-Maguire-Man-Utd-F365.jpg", "publishedAt": "2020-05-11T14:48:20Z", "content": "Man Utd and England defender Harry Maguire says Marcus Rashford is the most talented player he has ever played with.\r\nThe forward, still only 22, was enjoying a fine season for Ole Gunnar Solskjaer’s men until a back issue struck him down in January.\r\nThe Pre… [+1821 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Euro 96: How life has changed in the UK in almost 25 years - BBC News", "description": "As Euro 96 returns to terrestrial TV, BBC Sport looks at how life in the UK was different almost a quarter of a century ago.", "url": "https://www.bbc.co.uk/sport/football/52550863", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/E274/production/_112227975_euro96index.jpg", "publishedAt": "2020-05-11T14:34:39Z", "content": "The Spice Girls' debut single Wannabe was released a week after the Euro 96 final\r\nThis summer, we're going back in time to Euro 96.\r\nIt was 24 years ago - before some of you were even born. So how different was life in the UK back then? \r\nIn a sense, it's a … [+5646 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Arsenal, Chelsea and Tottenham learn decision on Premier League return - Football.London", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiWWh0dHBzOi8vd3d3LmZvb3RiYWxsLmxvbmRvbi9wcmVtaWVyLWxlYWd1ZS9icmVha2luZy1wcmVtaWVyLWxlYWd1ZS1zZWFzb24tcmV0dXJuLTE4MjMzMjcw0gFdaHR0cHM6Ly93d3cuZm9vdGJhbGwubG9uZG9uL3ByZW1pZXItbGVhZ3VlL2JyZWFraW5nLXByZW1pZXItbGVhZ3VlLXNlYXNvbi1yZXR1cm4tMTgyMzMyNzAuYW1w?oc=5", "urlToImage": null, "publishedAt": "2020-05-11T14:14:51Z", "content": null}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Ian Doyle", "title": "Liverpool and Everton given further Premier League return hint by radical La Liga plan - Liverpool Echo", "description": "Liverpool and Everton are waiting to discover if and when the Premier League will return this season", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-everton-given-further-premier-18232962", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article18054333.ece/ALTERNATES/s1200/0_GettyImages-1215186455-1.jpg", "publishedAt": "2020-05-11T13:50:59Z", "content": "Liverpool and Everton have been given a further hint about how the Premier League campaign could look as more details emerge about plans for La Liga. \r\nThe Spanish top flight has been suspended since March 12 due to the coronavirus outbreak, a day before elit… [+1817 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Coronavirus: Pro sport in England could resume on June 1 - Sky Sports", "description": "Top-level sport in England could restart behind closed doors from June 1 but spectators may not be able to attend venues until a vaccine is found.", "url": "https://www.skysports.com/football/news/11095/11986561/coronavirus-pro-sport-in-england-could-resume-from-june-1", "urlToImage": "https://e0.365dm.com/20/05/1600x900/skysports-raheem-sterling-ben-stokes_4988129.jpg", "publishedAt": "2020-05-11T13:40:28Z", "content": "Top-level sport in England could restart behind closed doors from June 1 but spectators may not be able to attend venues until a coronavirus vaccine is found.\r\nThe government's road map for exiting the lockdown, imposed to limit the spread of coronavirus, was… [+9295 chars]"}, {"source": {"id": null, "name": "Scotsman.com"}, "author": "Joel Sked", "title": "Scottish Football LIVE: Dunfermline hit out at 'tiresome point scoring', English football could return in June, Celtic get Champions League boost, Partick Thistle confirm support of Rangers' SPFL investigation - Scotland on Sunday", "description": "All the latest news, transfer speculation and more from around the SPFL", "url": "https://www.scotsman.com/sport/football/celtic/scottish-football-live-dunfermline-hit-out-tiresome-point-scoring-english-football-could-return-june-celtic-get-champions-league-boost-partick-thistle-confirm-support-rangers-spfl-investigation-2848717", "urlToImage": "https://www.scotsman.com/webimg/b25lY21zOjg2YTE3NjhhLTU5NjctNDhjNS1hNDJkLWI2NWEzM2U5MzIxZDozZjhmZjgxZS0yMDhkLTQ0MzctOTRhOS1iZDc5NjQxODRjYjg=.jpg", "publishedAt": "2020-05-11T13:40:00Z", "content": "Ex-Celtic forward Kris Commons has backed Rangers' request for an independent investigation into the SPFL's handling of the resolution.\r\nCommons has admitted he has changed his mind regarding the Ibrox club's stance.\r\nWriting in the Daily Mail he said: \"\"If I… [+621 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Steven Mair", "title": "Dunfermline hit back at Inverness Caledonian Thistle as chairman addresses 'threats' claim - Daily Record", "description": "Pars chairman Ross McArthur has responded to allegations made by Inverness on Friday.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/dunfermline-hit-back-inverness-caledonian-22008009", "urlToImage": "https://i2-prod.dailyrecord.co.uk/incoming/article1784671.ece/ALTERNATES/s1200/15163063_15-10-11%20CLYDESDALE%20BANK%20PREMIER%20LEAGUE%20DUNFERMLINE%20V%20HEARTS%200-2%20EAST%20END%20PARK%20-%20DUNFERML.jpg", "publishedAt": "2020-05-11T12:56:05Z", "content": "Dunfermline Athletic chairman Ross McArthur has launched a scathing attack on Inverness as Scottish football's civil war rages on.\r\nMcArthur has revealed himself as the man the Highland club were referring to in their statement on Friday that alleged \"bullyin… [+4096 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Shane Ireland", "title": "Man Utd and Liverpool prepare 'angry' Aston Villa plea at crucial Project Restart meeting - Birmingham Live", "description": "Aston Villa news includes Premier League frustrated 'Big Six' set to plead with AVFC and other clubs opposing Project Restart plan", "url": "https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-news-project-restart-18229580", "urlToImage": "https://i2-prod.birminghammail.co.uk/incoming/article16350073.ece/ALTERNATES/s1200/0_JS183973446.jpg", "publishedAt": "2020-05-11T12:54:26Z", "content": "The Premier League's 'Big Six' will plead with relegation-threatened clubs to change their mind on Project Restart at Monday's meeting.\r\nAston Villa are among the clubs to have voiced their opposition to the plan to finish the season by playing the remaining … [+1848 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "EFL: Rotherham chairman expects League One and League Two to be cancelled - Sky Sports", "description": "Rotherham chairman Tony Stewart says he would be \"amazed\" if the League One and League Two seasons are not cancelled.", "url": "https://www.skysports.com/football/news/11747/11986525/efl-rotherham-chairman-expects-league-one-and-league-two-to-be-cancelled", "urlToImage": "https://e1.365dm.com/20/05/1600x900/skysports-rotherma-blackpool_4988037.jpg", "publishedAt": "2020-05-11T12:38:22Z", "content": "Rotherham chairman Tony Stewart expects a decision to be made on the fate of the League One and League Two seasons by Thursday and would be \"amazed\" if they are not cancelled.\r\nThe English Football League is due to meet later this week and it has been widely … [+1790 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "BBC News", "title": "Skateboarder, 11, lands record 1080-degree turn - BBC News", "description": "Gui Khury from Brazil achieved the goal after using his time in lockdown to practise.", "url": "https://www.bbc.com/news/av/world-latin-america-52615515/skateboarder-11-lands-record-1080-degree-turn", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/172A2/production/_112228849_p08cvgfg.jpg", "publishedAt": "2020-05-11T12:37:15Z", "content": null}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Richard Fay", "title": "Sir Alex Ferguson treated four players differently at Manchester United - Manchester Evening News", "description": "Man Utd legend Ryan Giggs has spoken about his time at Old Trafford playing for Sir Alex Ferguson.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-utd-news-giggs-ferguson-18231033", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/incoming/article18231240.ece/ALTERNATES/s1200/0_GettyImages-84669432.jpg", "publishedAt": "2020-05-11T12:17:28Z", "content": "Ryan Giggs has claimed Sir Alex Ferguson treated four of his former teammates differently to everybody else during his illustrious spell at Manchester United.\r\nWales manager Giggs played with hundreds of different players during his 24 years at Old Trafford, … [+1590 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Richard Fay", "title": "Jaap Stam tells Manchester United what to do with Paul Pogba - Manchester Evening News", "description": "Manchester United treble winner Jaap Stam has spoken about Paul Pogba and his future at Old Trafford.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-utd-news-pogba-latest-18231716", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/incoming/article18231798.ece/ALTERNATES/s1200/0_GettyImages-1190054632.jpg", "publishedAt": "2020-05-11T11:47:43Z", "content": "Jaap Stam has urged Manchester United to keep Paul Pogba at the club and build their next great team around him.\r\nThe French midfielder continues to be linked with an Old Trafford exit at the end of the season, a year on from admitting he was looking for a 'n… [+1518 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Great Steffi Graf Forehands at Wimbledon - Wimbledon", "description": "This is the official Wimbledon YouTube page. To keep up with Wimbledon throughout the year, visit wimbledon.com/mywimbledon", "url": "https://www.youtube.com/watch?v=vTdAW0XazRo", "urlToImage": "https://i.ytimg.com/vi/vTdAW0XazRo/maxresdefault.jpg", "publishedAt": "2020-05-11T10:59:41Z", "content": null}, {"source": {"id": null, "name": "Yorkshireeveningpost.co.uk"}, "author": "Graham Smyth", "title": "Leeds United's Tyler Roberts reveals Marcelo Bielsa's life-changing impact and buzz for first training session - Yorkshire Evening Post", "description": "Tyler Roberts is excited about the ‘buzz’ he will feel when he first walks out onto the Thorp Arch training pitches again to work with the man who has changed his life.", "url": "https://www.yorkshireeveningpost.co.uk/sport/football/leeds-united/leeds-uniteds-tyler-roberts-reveals-marcelo-bielsas-life-changing-impact-and-buzz-first-training-session-2848668", "urlToImage": "https://www.yorkshireeveningpost.co.uk/webimg/QVNIMTE0OTA1OTY5.jpg", "publishedAt": "2020-05-11T10:36:00Z", "content": "IN FORM - Leeds United's Tyler Roberts was going through a 'little good spell' when football was suspended. Copyright: jpimedia\r\nLeeds United signed the attacker, from West Brom on the final day of the January 2018 transfer window. \r\nThe Baggies had sent him … [+3298 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "THROWBACK CITY 2-0 WEST HAM | PL TITLE #2 | On This Day 11th May 2014 - Man City", "description": "Manchester City secured their second Premier League title in three seasons after goals from Samir Nasri and captain Vincent Kompany saw them stroll to victor...", "url": "https://www.youtube.com/watch?v=8gCnlWmmGJA", "urlToImage": "https://i.ytimg.com/vi/8gCnlWmmGJA/maxresdefault.jpg", "publishedAt": "2020-05-11T10:00:12Z", "content": null}, {"source": {"id": null, "name": "Paddypower.com"}, "author": "Adam Houghton", "title": "Horse Racing tips: Your 3 best bets at Longchamp today - Paddy Power News", "description": "View more on the Paddy Power Blog.", "url": "https://news.paddypower.com/horse-racing/2020/05/11/horse-racing-tips-your-3-best-bets-at-longchamp-today/", "urlToImage": "https://news.paddypower.com/wp-content/uploads/2020/05/Longchamp-Horse-Racing-1.jpg", "publishedAt": "2020-05-11T09:46:48Z", "content": "Khayzaraan and Tropbeau look the pair to focus on here, with preference for the former at the current prices. She created a deep impression in winning her last two starts as a juvenile by an aggregate distance of 13 and a half lengths, just needing to be shak… [+2196 chars]"}, {"source": {"id": null, "name": "Chelseafc.com"}, "author": null, "title": "FRANK LAMPARD INTERVIEW: HIS RECORD CHELSEA GOALS | Official Site - Chelsea FC", "description": "It was on this day in 2013 that Frank Lampard became Chelsea's all-time highest scorer courtesy of two goals scored in a 2-1 win at Villa Park.", "url": "https://www.chelseafc.com/en/news/2020/05/11/looking-back-to-lampard-s-words-on-the-day-he-broke-the-record", "urlToImage": "https://res.cloudinary.com/chelsea-production/image/upload/c_fill,dpr_auto,f_auto,fl_lossy,g_auto,h_320,q_auto,w_640,z_1.0/v1/editorial/news/2020/05/GettyImages-611813618", "publishedAt": "2020-05-11T08:17:18Z", "content": "'When you're young and fans boo you maybe give them a little look back, but when you get a bit older you don't get into all that nonsense so much, so it was a really nice thing to have done for me.'To become record goalscorer for a club is undoubtedly a remar… [+2217 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Karim Zidan", "title": "Why did UFC try to silence journalists and fighters as it returned to action? - The Guardian", "description": "Saturday night saw a major live sports event staged in America for the first time in weeks. But Dana White wanted some details kept quiet", "url": "https://www.theguardian.com/sport/2020/may/11/ufc-249-mma-dana-white-legal-waiver", "urlToImage": "https://i.guim.co.uk/img/media/ff21876c6e7495f938b9795b73ac7acef0c8b374/0_26_4584_2750/master/4584.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c8fd5ce3f57c237e5af503025669ba46", "publishedAt": "2020-05-11T08:00:00Z", "content": "On Saturday night, the Ultimate Fighting Championship became the first major organization to hold a live sports event in the US during the height of the Covid-19 pandemic. However, rather than being hailed as an entertaining night of cagefighting designed to … [+5055 chars]"}, {"source": {"id": null, "name": "Yorkshirepost.co.uk"}, "author": "Jordan Cronin", "title": "Leeds United star admits uncertainty over future, Manchester United consider mega £94m bid - gossip - Yorkshire Post", "description": "The Premier League are continuing to discuss ways to resume the 2019/20 campaign under the name ‘Project Restart’, aiming to get fixtures back underway in June.", "url": "https://www.yorkshirepost.co.uk/sport/football/sheffield-united/leeds-united-star-admits-uncertainty-over-future-manchester-united-consider-mega-ps94m-bid-gossip-2848602", "urlToImage": "https://www.yorkshirepost.co.uk/webimg/b25lY21zOmYzN2JhODgwLTM2NTItNDU1NS04ZDYwLTQ4N2FjNmFkYTBlMzo5NmJjYzM2ZC1hZWY1LTRkYTktYjJiYS05OTJlYTVhMGY4OTc=.jpg", "publishedAt": "2020-05-11T07:56:00Z", "content": "But in the meantime, speculation is showing no signs of slowing down when it comes to the upcoming transfer window and the proposed takeover of Newcastle United.\r\nAnd as ever, were sharing the latest rumours from around the Premier League so scroll and click … [+1015 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Coronavirus and sport - Monday's updates as sports discuss return - BBC News", "description": "The latest updates on how the coronavirus pandemic is affecting sport.", "url": "https://www.bbc.co.uk/sport/live/52614800", "urlToImage": "https:////m.files.bbci.co.uk/modules/bbc-morph-sport-seo-meta/1.13.4/images/bbc-sport-logo.png", "publishedAt": "2020-05-11T07:41:11Z", "content": "Manchester\r\nCity defender Kyle Walker has written to some of the clubs supporters to\r\napologise for twice flouting COVID-19 lockdown rules.\r\nWalker\r\nreceived at least one message personally and others via City from fans\r\nexpressing their displeasure at his ac… [+785 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Jake Polden", "title": "Philippe Coutinho transfer stance suggests he's changed his opinion on Liverpool - Mirror Online", "description": "Philippe Coutinho completed a £142m transfer to Barcelona in 2018, but fell down the pecking order at an alarming rate in Spain and was sent out on loan in 2019", "url": "https://www.mirror.co.uk/sport/football/news/philippe-coutinho-transfer-stance-suggests-22004515", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article18826111.ece/ALTERNATES/s1200/3_FBL-WC-2018-BRA.jpg", "publishedAt": "2020-05-11T05:54:49Z", "content": "Philippe Coutinho found himself on Barcelona's scrapheap in the summer of 2019.\r\n The Brazilian, who had only completed a £142million transfer from Liverpool in January 2018, had fallen down the pecking order at an alarming rate in Spain. \r\nAnd his agent Kia … [+3112 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Atletico Madrid 'offer Thomas Partey to Liverpool in Alex Oxlade-Chamberlain swap deal' - Mirror Online", "description": "Atletico Madrid and Liverpool could be involved in summer transfer action with the Spaniards keen to swap Thomas Partey for Alex Oxlade-Chamberlain", "url": "https://www.mirror.co.uk/sport/football/news/atletico-madrid-offer-thomas-partey-22006018", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21951053.ece/ALTERNATES/s1200/0_Club-Atletico-de-Madrid-v-Real-Madrid-CF-La-Liga.jpg", "publishedAt": "2020-05-10T22:52:45Z", "content": "Atletico Madrid are eyeing a move for Liverpool's Alex Oxlade-Chamberlain and are prepared to offer Thomas Partey in exchange.\r\nThe Ghanaian was part of the Atletico side that won 3-2 at Anfield back in March.\r\nBut he has been linked with a move away and is k… [+1991 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Top 10: Adam Lallana Goals | Long-range strikes and late show at Norwich - Liverpool FC", "description": "Watch as we bring you Adam Lallana's best goals for the Reds, including that memorable strike at Carrow Road, and some skilful finishes against Manchester Ci...", "url": "https://www.youtube.com/watch?v=FyLooHbJ1uU", "urlToImage": "https://i.ytimg.com/vi/FyLooHbJ1uU/maxresdefault.jpg", "publishedAt": "2020-05-10T11:00:08Z", "content": "Watch as we bring you Adam Lallana's best goals for the Reds, including that memorable strike at Carrow Road, and some skilful finishes against Manchester City and more.\r\nEnjoy more content and get exclusive perks in our Liverpool FC Members Area, click here … [+183 chars]"}]}