{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Manchester United morning digest as Roy Keane gives surprise transfer verdict - Manchester Evening News", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMieGh0dHBzOi8vd3d3Lm1hbmNoZXN0ZXJldmVuaW5nbmV3cy5jby51ay9zcG9ydC9mb290YmFsbC9mb290YmFsbC1uZXdzL21hbmNoZXN0ZXItdW5pdGVkLW1vcm5pbmctZGlnZXN0LWZlcm5hbmRlcy0xODE0ODg1NdIBfGh0dHBzOi8vd3d3Lm1hbmNoZXN0ZXJldmVuaW5nbmV3cy5jby51ay9zcG9ydC9mb290YmFsbC9mb290YmFsbC1uZXdzL21hbmNoZXN0ZXItdW5pdGVkLW1vcm5pbmctZGlnZXN0LWZlcm5hbmRlcy0xODE0ODg1NS5hbXA?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T04:09:53Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Jamie Carragher identifies \"massive mistake\" Chelsea made with Fernando Torres - Mirror Online", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiYGh0dHBzOi8vd3d3Lm1pcnJvci5jby51ay9zcG9ydC9mb290YmFsbC9uZXdzL2phbWllLWNhcnJhZ2hlci1pZGVudGlmaWVzLW1hc3NpdmUtbWlzdGFrZS0yMTkyMjI4NNIBZGh0dHBzOi8vd3d3Lm1pcnJvci5jby51ay9zcG9ydC9mb290YmFsbC9uZXdzL2phbWllLWNhcnJhZ2hlci1pZGVudGlmaWVzLW1hc3NpdmUtbWlzdGFrZS0yMTkyMjI4NC5hbXA?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T02:24:59Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Sean Dyche explains why he had to apologise to Arsene Wenger after Arsenal clash - Mirror Online", "description": "Burnley manager said he gave former Gunners boss Wenger a 'rubbish' claret following a game at Turf Moor, as he opened up on his own taste in wine", "url": "https://www.mirror.co.uk/sport/football/news/sean-dyche-explains-apologise-arsene-21924463", "urlToImage": null, "publishedAt": "2020-04-25T01:48:30Z", "content": "Burnley manager Sean Dyche has revealed he had to apologise to former Arsenal boss Arsene Wenger - for giving him a \"rubbish\" red wine after a game. \r\nDyche, who admits he is \"certainly not an aficionado\" of fine wines, says all rival managers are offered the… [+2225 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "ePremier League Invitational Fifa 20: I only want a Messi shirt, says Raheem Sterling - BBC Sport", "description": "Manchester City's Raheem Sterling says the only shirt he wants before he retires is Lionel Messi's.", "url": "https://www.bbc.co.uk/sport/football/52421270", "urlToImage": null, "publishedAt": "2020-04-25T01:17:04Z", "content": "Media playback is not supported on this device\r\nWatch highlights as Raheem Sterling and Trent Alexander-Arnold reach the ePL semi-finals\r\n<table><tr><th>ePremier League Invitational Fifa 20 tournament</th></tr>\r\n<tr><td>Watch live coverage of the semi-finals … [+2911 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ben Husband", "title": "Wolves given major Adama Traore boost after shock Liverpool transfer claim - Birmingham Live", "description": "The Wolves winger has enjoyed a stunning season under Nuno and has been linked with a mega-money move to Anfield", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/liverpool-transfers-adama-traore-wolves-18148756", "urlToImage": null, "publishedAt": "2020-04-25T01:15:12Z", "content": "Liverpool could be set for a quiet transfer window, despite links suggesting Jurgen Klopp could sanction a £70m for Adama Traore.\r\n The Spaniard has emerged as a shock target for the Reds after a stunning second season for Wolverhampton Wanderers.\r\nUnder Nuno… [+1507 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Ian Doyle", "title": "Only realistic way Liverpool can now lose Premier League title - Liverpool Echo", "description": "Ian Doyle discusses Liverpool, the Premier League title and the void in the latest Blood Red column", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/only-realistic-way-liverpool-can-18148023", "urlToImage": null, "publishedAt": "2020-04-25T00:08:28Z", "content": "It's all about the void for Liverpool at present.\r\nAnd we're not talking about the prospect of the Premier League season being scrapped.\r\nWell, not exclusively, at any rate.\r\nInstead, it's the huge chasm that has been left by the absence of football - and, ju… [+3501 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Bobby Vincent", "title": "Liverpool squad numbers available if Timo Werner or summer signings arrive - Liverpool Echo", "description": "Which shirt numbers are available if Liverpool make a move in the transfer market?", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-shirt-numbers-timo-werner-18138544", "urlToImage": null, "publishedAt": "2020-04-25T00:08:14Z", "content": "Liverpool's transfer business this summer remains uncertain in the light if the ongoing coronavirus pandemic.\r\nTimo Werner continues to be the main name linked with a potential move to Anfield.\r\nUnsurprisingly, Reds fans are excited about the possibility of t… [+2964 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Matt Dathan", "title": "Premier League football back ‘within weeks’ with games on TV as grounds stay shut - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/11476053/premier-league-games-back-tv-within-weeks/", "urlToImage": null, "publishedAt": "2020-04-24T23:53:30Z", "content": "PREMIER League football could be back on TV within weeks in a major boost for bored Brits.\r\nBoris Johnson has been briefed on plans for matches to be played behind closed doors and sees the resumption of live sport as key to boosting the moral of the nation a… [+9699 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Neil Custis", "title": "Ed Woodward rules out big-money transfers as Man Utd chief warns fans must accept post-coronavirus - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11475831/man-utd-transfers-woodward-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-24T23:53:26Z", "content": "ED WOODWARD says football needs to forget about big money transfer business this summer.\r\nThe Manchester United chief laid out the stark realities for all clubs in lockdown as he addressed a fans forum on Friday.\r\n Ed Woodward is intent on fans understanding … [+3684 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Justin Allen", "title": "Bury hope FA put them in National League next season with chairman Dale willing to step down - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11474335/bury-national-league-steve-dale/", "urlToImage": null, "publishedAt": "2020-04-24T23:53:22Z", "content": "BURY owner Steve Dale has amazingly revealed he is waiting fortheFA to put his club into the National League for next season.\r\nAnd Dale would be prepared to step down as chairman of the expelled EFL outfit to make it happen.\r\n Steve Dale hopes Bury are placed… [+2817 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By James Ayles For Mailonline", "title": "Liverpool vs Atletico to be investigated amid concerns it helped spread coronavirus - Daily Mail", "description": "Liverpool's Champions League quarter-final at home to Atletico Madrid will be the focus of an inquiry by the city council over concerns it spread coronavirus in the area.", "url": "https://www.dailymail.co.uk/sport/football/article-8255417/City-council-investigate-impact-staging-Liverpool-v-Atletico-Madrid-spreading-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-24T23:01:14Z", "content": "Liverpool's Champions League quarter-final clash with Atletico Madrid will be the focus of an inquiry by the city council amid concerns it could have led to a high number of coronavirus infections in the area. \r\nThe game, held on March 11, was attended by 52,… [+3215 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Tashan Deniran-Alleyne", "title": "How the Dutch FA's decision would affect Chelsea's top-four battle with Man United and Tottenham - Football.London", "description": "The Eredivisie have become the first major European division to decide against crowning a league champion for the 2019/20 season, and the decision could impact English football", "url": "https://www.football.london/chelsea-fc/news/chelsea-champions-league-man-united-18148939", "urlToImage": null, "publishedAt": "2020-04-24T22:55:13Z", "content": "The big news in the world of football on Friday surrounding a massive decision made by the Dutch FA.\r\nIt was announced that the 2019/20 Eredivisie season has been ended.\r\nLast season's Champions League semi-finalists Ajax had led the table on goal difference … [+2396 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "george harrison", "title": "Inside Mike Tyson’s £890k abandoned mansion that had tiger cages and basketball court before being converted t - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/1285850/mike-tyson-mansion-house-tiger-cage/", "urlToImage": null, "publishedAt": "2020-04-24T22:24:37Z", "content": "THIS is the spectacular mansion Mike Tyson abandoned during his rapid fall from grace.\r\nThe former professional boxer - who was convicted of rape in 1992 - had no choice but to sell this palatial property as financial ruin loomed, and the imposing Ohio mansio… [+2838 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Dominic King for the Daily Mail", "title": "Former Liverpool star Dominic Matteo and his wife on how he beat a brain tumour and is on the mend - Daily Mail", "description": "EXCLUSIVE INTERVIEW BY DOMINIC KING: This story will conclude with a ringing bell and thunderous applause but it must start with a blaring siren and flashing blue lights.", "url": "https://www.dailymail.co.uk/sport/football/article-8255097/Former-Liverpool-star-Dominic-Matteo-wife-beat-brain-tumour-mend.html", "urlToImage": null, "publishedAt": "2020-04-24T21:52:31Z", "content": "This story will conclude with a ringing bell and thunderous applause but it must start with a blaring siren and flashing blue lights.\r\nIt was Monday, November 11 when the ballet class Jessica Matteo was teaching was interrupted by a phone call. Her husband Do… [+9654 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Matt Davies", "title": "PDC Darts Home Tour 2020 results LIVE: Stream, latest scores on Day 8, watch free online and TV channel - Evening Standard", "description": "", "url": "https://www.standard.co.uk/sport/darts-pdc-home-tour-2020-live-stream-results-day-8-latest-scores-watch-free-tv-a4423691.html", "urlToImage": null, "publishedAt": "2020-04-24T21:44:58Z", "content": "Welcome to Day 8 of our PDCdarts Home Tour LIVE coverage.\r\nOn Friday night, world number 15 Jonny Clayton progressed to the next round with a perfect record of three straight victories.\r\nIt was a close encounter, however, the group undecided until the final g… [+7879 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Matt Hughes For The Daily Mail", "title": "Sky and BT not keen on showing Premier League games for free when season resumes - Daily Mail", "description": "AHEAD OF THE GAME - MATT HUGHES: Sky Sports and BT Sport will resist pressure to screen for free the 47 Premier League matches they have left this season.", "url": "https://www.dailymail.co.uk/sport/sportsnews/article-8255195/Sky-BT-not-keen-showing-Premier-League-games-free-season-resumes.html", "urlToImage": null, "publishedAt": "2020-04-24T21:44:06Z", "content": "Sky Sports and BT Sport will resist pressure to screen for free the 47 Premier League matches they have left this season, despite calls from Culture Secretary Oliver Dowden this week for any remaining games played this season to be made available to all.\r\nThe… [+4327 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ben Husband", "title": "Championship boss calls for Birmingham City and Leeds United transfer ban - Birmingham Live", "description": "Blues were proactive in taking steps to ensure the long-term viability of the club, with players agreeing to a wage deferral last month", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/championship-boss-calls-birmingham-city-18146044", "urlToImage": null, "publishedAt": "2020-04-24T21:33:37Z", "content": "Preston boss Alex Neil has urged the EFL to enforce a transfer embargo on teams that have furloughed staff or implemented wage cuts.\r\nBirmingham City were the first team in the second tier to agree to wage deferrals, with all players earning over £6,000 agree… [+1709 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Ed Woodward: Man Utd chief says big-money transfer talk ignores financial reality - BBC News", "description": "Manchester United executive vice-chairman Ed Woodward says speculation about transfers for \"hundreds of millions of pounds this summer\" is ignoring the \"realities that face the sport\".", "url": "https://www.bbc.co.uk/sport/football/52418826", "urlToImage": null, "publishedAt": "2020-04-24T21:31:20Z", "content": "United were linked with a £200m move for Tottenham and England striker Harry Kane\r\nManchester United executive vice-chairman Ed Woodward says speculation about transfers for \"hundreds of millions of pounds this summer\" is ignoring the \"realities that face the… [+2830 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Mark Wakefield", "title": "Danny Murphy details Liverpool secret to beating Manchester United - Liverpool Echo", "description": "The former Reds midfielder enjoyed regular success against Liverpool's arch rivals, particularly away from home", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/danny-murphy-details-liverpool-secret-18143075", "urlToImage": null, "publishedAt": "2020-04-24T20:32:34Z", "content": "Former Liverpool midfielder Danny Murphy has revealed the tactical insight into the success the Reds had against Manchester United.\r\n During Murphys time on Merseyside, Liverpool enjoyed a number of successful matches against their old foes, particularly at O… [+2234 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Ryan Taylor", "title": "Recent Liverpool signing influencing Michael Edwards' stance on Timo Werner transfer - Express", "description": "Liverpool's summer transfer plans are likely to be affected by the coronavirus crisis.", "url": "https://www.express.co.uk/sport/football/1273628/Liverpool-signing-influencing-Michael-Edwards-Timo-Werner-transfer-gossip", "urlToImage": null, "publishedAt": "2020-04-24T20:17:51Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Ewan Murray", "title": "Rangers call for general meeting to discuss investigation over vote - The Guardian", "description": "Rangers have invited all 42 league clubs in Scotland to discuss the season-ending vote and have been vociferous in their call for an independent inquiry", "url": "https://www.theguardian.com/football/2020/apr/24/rangers-call-for-general-meeting-to-discuss-investigation-over-vote", "urlToImage": null, "publishedAt": "2020-04-24T19:47:59Z", "content": "Rangers have requested a general meeting of all 42 league clubs in Scotland with a view to allowing an independent investigation into the handling of a vote to abandon the 2019-20 season. The Ibrox club expressed their disdain towards the tight parameters of … [+2357 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Marc Mayo", "title": "David Haye ponders incredible return to fight winner of Tyson Fury vs Anthony Joshua now ‘injuries have h - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/boxing/11475466/david-haye-comeback-joshua-fury/", "urlToImage": null, "publishedAt": "2020-04-24T19:35:26Z", "content": "DAVID HAYE will only return to the ring to fight either Anthony Joshua or Tyson Fury having overcome the injury problems that ended his boxing career.\r\nLast seen coming a cropper in a pair of bouts with Tony Bellew, the former heavyweight champion says only t… [+3145 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "George Dobell", "title": "UK government hands ECB lead on viability of 'bio-secure' sport | ESPNcricinfo.com - ESPNcricinfo", "description": "England will play at as few grounds as possible if cricket goes behind closed doors, says ECB CEO | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29094232/uk-government-hands-ecb-lead-viability-bio-secure-sport", "urlToImage": null, "publishedAt": "2020-04-24T19:28:39Z", "content": "The ECB has been asked by the UK government to lead the way into investigating the viability of playing sport in a bio-secure environment.\r\nWith an increasing acceptance that the best chance of fulfilling the broadcast deals that keep nearly all sport afloat … [+8018 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Mark Jones", "title": "Premier League ref Mark Clattenburg \"told you to f*** off\", says Kasper Schmeichel - Mirror Online", "description": "The Leicester City goalkeeper said that the County Durham official was his favourite top-flight ref before his sudden departure from the Premier League in 2017", "url": "https://www.mirror.co.uk/sport/football/news/premier-league-ref-mark-clattenburg-21921136", "urlToImage": null, "publishedAt": "2020-04-24T19:12:04Z", "content": "Leicester City goalkeeper Kasper Schmeichel says that former Premier League referee Mark Clattenburg was his favourite top-flight official because \"he'd tell you to f*** off\" if he felt that you deserved it.\r\nCounty Durham official Clattenburg was once seen a… [+1738 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Liam Corless", "title": "Manchester United coach Mike Phelan identifies change in Solskjaer mentality - Manchester Evening News", "description": "Mike Phelan returned to Manchester United at the same time as Ole Gunnar Solskjaer after Jose Mourinho was sacked in December 2018.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-utd-news-phelan-solskjaer-18148705", "urlToImage": null, "publishedAt": "2020-04-24T18:54:13Z", "content": "Manchester United coach Mike Phelan suggested Ole Gunnar Solskjaer's mentality has changed and that the Norwegian is now more thoughtful than he was during his playing career.\r\nSolskjaer restored Phelan to the role of United's assistant manager when he return… [+1360 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Andrew Dowdeswell", "title": "Marcus Rashford's style highlights the type of centre forward Manchester United need - Manchester Evening News", "description": "Rashford's ability to adapt and evolve make him the primary candidate to take Man Utd forward.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/rashford-martial-manchester-united-solskjaer-18138069", "urlToImage": null, "publishedAt": "2020-04-24T18:54:11Z", "content": "Marcus Rashford was enjoying the best season of his career before he suffered a back injury in January. \r\nThe 22-year-old scored 14 goals in 1,882 Premier League minutes, the highest tally of his career, as well as five goals across 482 minutes in all other c… [+4301 chars]"}, {"source": {"id": null, "name": "Ufc.com"}, "author": null, "title": "Official Statement on UFC 249 - UFC", "description": "An interim lightweight title bout headlines a stacked card on May 9.", "url": "https://www.ufc.com/news/official-statement-ufc-249-may-9-gaethje-ferguson-ngannou-cejudo", "urlToImage": null, "publishedAt": "2020-04-24T18:22:46Z", "content": "Las Vegas UFC® returns with one of the most stacked cards in recent history, set to be headlined by a bout guaranteed to deliver fireworks as No. 1 ranked lightweight contender Tony Fergusonand No. 4 ranked Justin Gaethje battle for the interim championship. … [+6665 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Matt Davies", "title": "Philippe Coutinho or Jadon Sancho? Chelsea face transfer decision as Manchester United battle heats up - Evening Standard", "description": "", "url": "https://www.standard.co.uk/sport/football/jadon-sancho-philippe-coutinho-chelsea-face-decision-manchester-united-battle-heats-a4423686.html", "urlToImage": null, "publishedAt": "2020-04-24T18:10:42Z", "content": "While the Premier League was still up and running, Chelsea and Manchester United were locked in a fierce battle for a Champions League spot. But with football suspended indefinitely, a new fight has emerged: the race for Jadon Sancho's signature.\r\nThe Borussi… [+3126 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Jamie Carragher confirms wife tested positive for coronavirus in second family diagnosis - Mirror Online", "description": "Former Liverpool defender Carragher made the announcement when discussing how the football season in the UK can be resumed safely amid the current pandemic", "url": "https://www.mirror.co.uk/sport/football/news/jamie-carragher-confirms-wife-coronavirus-21921317", "urlToImage": null, "publishedAt": "2020-04-24T17:42:56Z", "content": "Jamie Carragher has revealed his wife Nicola has tested positive for coronavirus, becoming the second person in his family to contract the illness. \r\n The former Liverpool defender turned Sky Sports pundit also explained that his aunt had been receiving treat… [+2284 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Green Bay Packers' Aaron Rodgers within rights to be annoyed by Jordan Love pick, says Neil Reynolds - Sky Sports", "description": "Neil Reynolds and Jeff Reinebold analyse the Green Bay Packers' shock selection of Utah State quarterback Jordan Love.", "url": "https://www.skysports.com/nfl/news/12118/11978237/green-bay-packers-aaron-rodgers-within-rights-to-be-annoyed-by-jordan-love-pick-says-neil-reynolds", "urlToImage": null, "publishedAt": "2020-04-24T17:15:29Z", "content": "Aaron Rodgers is the same age as Brett Favre was when he was selected as his eventual successor by the Green Bay Packers with the No 24 pick at the 2005 NFL Draft.\r\nThat nugget became relevant with pick No 26 on day one of the 2020 Draft as the Packers produc… [+2899 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Arsenal ready to listen to offers for Chelsea & Man U target Aubameyang - Metro.co.uk", "description": "Is Aubameyang poised to leave Arsenal?", "url": "https://metro.co.uk/2020/04/24/transfer-arsenal-chelsea-man-utd-pierre-emerick-aubameyang-12605032/", "urlToImage": null, "publishedAt": "2020-04-24T17:12:57Z", "content": "Aubameyang has many suitors (Picture: Getty)\r\nArsenal are ready to listen to offers for Pierre-Emerick Aubameyang after shelving contract talks with the striker, according to reports.\r\nAubameyang has been the subject of intense transfer speculation this seaso… [+1914 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Shane Ireland", "title": "'No no no!' - New EFL proposal slammed by West Brom and Leeds United fans - Birmingham Live", "description": "West Brom news includes reaction to reports the Championship could be regionalised into two sub-divisions splitting promotion rivals WBA and Leeds United", "url": "https://www.birminghammail.co.uk/sport/football/football-news/west-brom-promotion-championship-efl-18124456", "urlToImage": null, "publishedAt": "2020-04-24T16:48:47Z", "content": "Promotion rivals West Bromwich Albion and Leeds United could be split under plans to regionalise the Championship.\r\n One suggestion being explored amid the coronavirus pandemic is to divide the Championship, League One and League Two into split sub-divisions,… [+1604 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Jack Rosser", "title": "Hakim Ziyech set to seal Chelsea transfer on July 1 as Eredivisie is cancelled - Evening Standard", "description": "", "url": "https://www.standard.co.uk/sport/football/hakim-ziyech-chelsea-transfer-news-latest-ajax-dutch-football-a4423676.html", "urlToImage": null, "publishedAt": "2020-04-24T16:47:55Z", "content": "Hakim Ziyech will be free to join Chelsea without delay this summer after the Eredivisie season was cancelled.\r\nThe Dutch FA and clubs have ratified the decision to end the season prematurely after major events were banned in the Netherlands until September 1… [+968 chars]"}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "David Pasztor", "title": "Chelsea reportedly exercise Giroud contract option that no one mentioned before - We Ain't Got No History", "description": "Hmmm...", "url": "https://weaintgotnohistory.sbnation.com/chelsea-fc-transfer-rumours-news/2020/4/24/21234612/chelsea-reportedly-exercise-giroud-contract-option-that-no-one-mentioned-before", "urlToImage": null, "publishedAt": "2020-04-24T16:41:25Z", "content": "According to Transfer Oracle Di Marzio, Chelsea have exercised a one-year club option on Olivier Girouds contract to extend it through 2021.\r\nWhile this is not seen as an end to the transfer rumors that have linked the veteran striker with various teams in It… [+982 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Kate Mcgreavy For Mailonline", "title": "Phil Neville will NOT take charge of England Women at Euros in 2022 - Daily Mail", "description": "Neville was due to be in charge for the home Euros next year but this will not be the case after the tournament was put back 12 months due to the impact of the coronavirus pandemic.", "url": "https://www.dailymail.co.uk/sport/football/article-8252969/Phil-Neville-NOT-charge-England-Women-Euros-2022.html", "urlToImage": null, "publishedAt": "2020-04-24T15:24:13Z", "content": "Phil Neville will not take charge of England Women at the rearranged home Euros in 2022 as the Football Association has confirmed he will leave his post when his contract expires next year.  \r\nReports emerged that the former Manchester United and Everton play… [+2658 chars]"}, {"source": {"id": null, "name": "Derbytelegraph.co.uk"}, "author": "Chris Watson", "title": "Derby County favourite has contract terminated by Championship club - Derbyshire Live", "description": "The former Rams midfielder and coach had been part of Graeme Jones' backroom staff at Luton Town", "url": "https://www.derbytelegraph.co.uk/sport/football/football-news/inigo-idiakez-derby-luton-harford-4076842", "urlToImage": null, "publishedAt": "2020-04-24T15:19:00Z", "content": "Derby County favourite Inigo Idiakez has lost his job at Sky Bet Championship club Luton Town.\r\nIdiakez had been first-team coach at Kenilworth Road but has had his contract terminated with immediate effect, along with manager Graeme Jones, assistant boss Gar… [+2928 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Chelsea Season So Far | December 19/20 - Chelsea Football Club", "description": "We take a look at Frank Lampard's first season as Chelsea Manager. Up next is the month of December which included big wins against Arsenal & Spurs. Download...", "url": "https://www.youtube.com/watch?v=Ei3zOe4_4p4", "urlToImage": null, "publishedAt": "2020-04-24T15:00:07Z", "content": "We take a look at Frank Lampard's first season as Chelsea Manager. Up next is the month of December which included big wins against Arsenal &amp; Spurs.\r\nDownload Chelsea FC's official mobile app:-App Store https://apple.co/2vvlN9t-Play Store http://bit.ly/2M… [+840 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Sean Ingle", "title": "London Marathon race director admits event may include only elite runners - The Guardian", "description": "The race director of the London Marathon has refused to rule out staging the event as an elite-only race in the autumn if social distancing rules make it impossible to run as normal", "url": "https://www.theguardian.com/sport/2020/apr/24/london-marathon-race-director-admits-event-may-include-only-elite-runners", "urlToImage": null, "publishedAt": "2020-04-24T13:41:52Z", "content": "The race director of the London Marathon has refused to rule out staging the event as an elite-only race in the autumn if social distancing rules make it impossible to run as normal.\r\nHugh Brasher told the Guardian that while organisers still hoped to hold th… [+3659 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Joseph Chapman, Ashley Preece", "title": "West Brom trio discussed as Charlie Austin backed to join Celtic - Birmingham Live", "description": "West Bromwich Albion daily digest - Here's a rundown of the biggest Albion stories via BirminghamLive, including Neil Warnock admitting West Brom and Leeds United should still see out the season", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/west-brom-celtic-leeds-united-18141870", "urlToImage": null, "publishedAt": "2020-04-24T12:45:47Z", "content": "Option\r\nAlan Hutton can see Charlie Austin being a good fit for Celtic, if they were to pursue a deal with West Brom this summer.\r\nAlbion  striker Austin, who has scored nine goals this term in all competitions, revealed recently that, if ever a chance to exp… [+4535 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Ian Doyle", "title": "Harvey Elliott reveals Mohamed Salah message and makes Steven Gerrard target at Liverpool - Liverpool Echo", "description": "Liverpool youngster Harvey Elliott has opened up on his first season working under Jurgen Klopp", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/harvey-elliott-reveals-mohamed-salah-18143937", "urlToImage": null, "publishedAt": "2020-04-24T12:40:31Z", "content": "Harvey Elliott has revealed the impact Mohamed Salah is having on his development at Liverpool - as he outlined his desire to follow in the footsteps of Steven Gerrard.\r\nElliott has made an encouraging start to his Reds career having arrived from Fulham when … [+2921 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Shane Ireland", "title": "Manchester United sent stunning message over '£130m' Wolves transfer - Birmingham Live", "description": "Wolves transfer news includes pundit's message to Raul Jimenez suitors as Man Utd and Real Madrid linked", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/raul-jimenez-man-utd-wolves-18142364", "urlToImage": null, "publishedAt": "2020-04-24T12:15:27Z", "content": "Wolverhampton Wanderers striker Raul Jimenez would cost suitors well over £100million, according to former Premier League defender Alex Bruce.\r\nJimenez's form has been one of the many highlights of a terrific campaign for Wolves, who are sixth in the table an… [+1600 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Callum Hudson-Odoi sends Chelsea transfer message to close friend Jadon Sancho - Mirror Online", "description": "Sancho and Hudson-Odoi came through the England youth ranks together and have been speaking \"every other day\" during lockdown amid rumours linking the Dortmund star with Chelsea and Man Utd", "url": "https://www.mirror.co.uk/sport/football/news/callum-hudson-odoi-sends-chelsea-21919060", "urlToImage": null, "publishedAt": "2020-04-24T11:41:09Z", "content": "Callum Hudson-Odoi has revealed he is in constant communication with Jadon Sancho and admitted he would love for the Borussia Dortmund star to join him at Chelsea. \r\nThe international teammates share a good relationship from their England youth days, and both… [+2016 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "VOTE: Who has been the best No 1 NFL Draft pick in the last decade? - Sky Sports", "description": "With the 2020 NFL Draft underway, we ask you: who has been the best No 1 pick in the last decade?", "url": "https://www.skysports.com/nfl/news/12118/11976556/vote-who-has-been-the-best-no-1-nfl-draft-pick-in-the-last-decade", "urlToImage": null, "publishedAt": "2020-04-24T11:24:33Z", "content": "With the 2020 NFL Draft underway, we ask you: who has been the best No 1 pick in the last decade?\r\nThis year the Cincinnati Bengals selected LSU quarterback Joe Burrow with the No 1 overall pick. Here, we ask you to evaluate the top picks over the last decade… [+861 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Tom Leach", "title": "Gary Neville explains what is remarkable about 'sensational' Liverpool - Liverpool Echo", "description": "The 45-year-old was in action for United at some of the world's biggest and best stadiums during his long career, including Barcelona's Nou Camp.", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-manchester-united-anfield-neville-18137466", "urlToImage": null, "publishedAt": "2020-04-24T10:54:36Z", "content": "Manchester United legend Gary Neville has revealed what it is really like playing against Liverpool at Anfield. \r\nThe former Old Trafford right-back was speaking to Sky Sports' Football Show when he was asked to lift the lid on how it felt to be the bad guy i… [+1472 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Stuart Jamieson", "title": "'He would be adored like you wouldn’t believe' - Pochettino backed for United job - Chronicle Live", "description": "Don Hutchison reveals why he is backing Mauricio Pochettino for Newcastle - but not former Juventus manager Massimiliano Allegri", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/newcastle-pochettino-allegri-favre-hutchison-18142105", "urlToImage": null, "publishedAt": "2020-04-24T10:03:08Z", "content": "Don Hutchison believes Massimiliano Allegri would not be interested in the Newcastle United job should it become available under any new owners.\r\nBut the former Liverpool, West Ham and Sunderland midfielder has backed either former Tottenham boss Mauricio Poc… [+1359 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Robert Warlow", "title": "Crystal Palace receive financial boost ahead of the summer as Eagles ace makes Arsenal admission - Football.London", "description": "Crystal Palace are set to receive a slice of money released by UEFA to help clubs across Europe during the current financial crisis caused by the coronavirus pandemic", "url": "https://www.football.london/crystal-palace-fc/news/crystal-palace-receive-financial-boost-18140151", "urlToImage": null, "publishedAt": "2020-04-24T09:35:56Z", "content": "Crystal Palace and other Premier League clubs are still awaiting news over the return of top flight football.\r\nThe Premier League and all other professional football leagues in England are currently suspended indefinitely, with no games taking place in the to… [+3358 chars]"}, {"source": {"id": null, "name": "Dartsnews.com"}, "author": null, "title": "Klaasen posts proof after accusations of cheating during PDC Home Tour group win - Dartsnews.com", "description": "Jelle Klaasen claimed a group win last night in the PDC Home Tour but this was marred by accusations of cheating which stemmed from his match", "url": "https://dartsnews.com/klaasen-posts-proof-after-accusations-of-cheating-during-pdc-home-tour-group-win/", "urlToImage": null, "publishedAt": "2020-04-24T09:28:36Z", "content": "Jelle Klaasen claimed a group win last night in the PDC Home Tour but this was marred by accusations of cheating which stemmed from his match against Gabriel Clemens where he hit a 70 finish but on the initial PDC stream it didn’t look to be fully in to some.… [+1224 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Oliver Connolly", "title": "The NFL's virtual draft was dry, boring and everything we needed right now - The Guardian", "description": "The NFL’s lockdown draft felt slapdash, a little weird and less eventful than those in recent years. It was also the first time in a month things felt slightly back to normal", "url": "https://www.theguardian.com/sport/2020/apr/24/nfl-virtual-draft-television-abc-espn", "urlToImage": null, "publishedAt": "2020-04-24T09:00:29Z", "content": "The first round of the NFL draft should have been a series of fireworks, owing as much to do with the wonky set-up the league found itself in. The mock run-through had been a veritable disaster a spouse pulling a plug on a GMs computer, the technology choppin… [+5289 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Mark Jones", "title": "British billionaire Alki David hints at Nou Camp name choice as he eyes Barcelona deal - Mirror Online", "description": "Barcelona have announced that they will sell naming rights to the Nou Camp for the 2020/21 season, with the proceeds going towards fighting coronavirus", "url": "https://www.mirror.co.uk/sport/football/news/british-billionaire-alki-david-hints-21919101", "urlToImage": null, "publishedAt": "2020-04-24T08:43:29Z", "content": "A British billionaire linked to Mike Tyson says he's \"quietly confident\" that he can complete a naming rights deal for Barcelona's Nou Camp stadium, and has suggested what he could call it.\r\nAlki David, who was born in Nigeria but holds a British passport, is… [+2377 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Mark Wakefield", "title": "Adama Traore agent makes transfer admission amid Liverpool links - Liverpool Echo", "description": "Jurgen Klopp's Liverpool have been linked with a summer move for Adama Traore and his agent has spoken out", "url": "https://www.liverpoolecho.co.uk/sport/football/transfer-news/adama-traore-agent-makes-transfer-18142069", "urlToImage": null, "publishedAt": "2020-04-24T08:36:04Z", "content": "Adama Traore's agent has addressed the future of his client and indicated he still believes there could be a \"market\" for him this summer.\r\n Liverpool and other top teams have been tentatively linked with a move for the Wolverhampton Wanderers winger, with Fo… [+1717 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Joseph Chapman", "title": "EFL under pressure to scrap financial rules after Birmingham City charge - Birmingham Live", "description": "BCFC were docked nine points last season, and the EFL have contested a fresh charge this season, after Blues were originally found not guilty", "url": "https://www.birminghammail.co.uk/sport/football/football-news/efl-under-pressure-scrap-financial-18138760", "urlToImage": null, "publishedAt": "2020-04-24T07:31:23Z", "content": "A number of Championship clubs have thrown their support behind the idea of the EFL making amendments to their controversial Profitability and Sustainability regulations, or to get rid of that particular set of rules entirely.\r\nBirmingham City are one of a nu… [+1899 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "John Cross", "title": "Eric Dier facing lengthy ban after being hit with FA charge over fan confrontation - Mirror Online", "description": "Eric Dier has been charged by the FA after he clashed with a fan in the aftermath of Tottenham's FA Cup defeat to Norwich", "url": "https://www.mirror.co.uk/sport/football/news/eric-dier-facing-lengthy-ban-21916800", "urlToImage": null, "publishedAt": "2020-04-24T07:03:13Z", "content": "Eric Dier is facing a lengthy ban after being hit with an FA misconduct charge.\r\nTottenham midfielder Dier climbed into the stand to confront a fan who was having a row with his brother after their FA Cup exit to Norwich last month. \r\nDier has until May 8 to … [+1927 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Arsenal speak to players after quartet break social distancing guidelines - BBC Sport", "description": "Arsenal have spoken to all their players after Alexandre Lacazette, David Luiz, Nicolas Pepe and Granit Xhaka were pictured breaking social distancing guidelines.", "url": "https://www.bbc.co.uk/sport/football/52400817", "urlToImage": null, "publishedAt": "2020-04-24T04:28:46Z", "content": "Pepe (left), Luiz (centre) and Lacazette were three of Arsenal's players who broke social distancing rules\r\nArsenal have spoken to all their players after Alexandre Lacazette, David Luiz, Nicolas Pepe and Granit Xhaka were pictured breaking social distancing … [+880 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "The 2020 NFL Draft - Joe Burrow goes at number one to the Bengals as virtual draft passes without a hitch - The Telegraph", "description": "LSU quarterback Joe Burrow was the No.", "url": "https://www.telegraph.co.uk/american-football/2020/04/23/2020-nfl-draft-live-updates-latest-selections/", "urlToImage": null, "publishedAt": "2020-04-24T04:16:35Z", "content": "Good evening - given the total lack of sport taking place in the world right now, for some reason the NFL draft seems more important and more welcome than ever.\r\nNot that we're about to see any touchdown passes or forced fumbles. No, what we're here for are p… [+1132 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Mark McDougall", "title": "Joey Barton blasts Rangers captain James Tavernier over his defending and hair obsession - Daily Record", "description": "The controversial Ibrox flop didn't hold back as he hit out at Tavernier for his defending skills and his lack of preparation for big games.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/joey-barton-blasts-rangers-captain-21916970", "urlToImage": null, "publishedAt": "2020-04-23T21:58:11Z", "content": "Rangers flop Joey Barton has lifted the lid on his controversial spell at Ibrox and blasted skipper James Tavernier for caring more about his hair than football.\r\nBarton has rarely spoken about his time in Glasgow prior to this but opened up in an explosive i… [+1965 chars]"}, {"source": {"id": null, "name": "Spurs-web.com"}, "author": "T.A Bharadwaj", "title": "Report: New Premier League 'big six' club enters the race for Willian free transfer - The Spurs Web", "description": "Tottenham Hotspur's hopes of signing Willian in the summer could soon be dealt a massive blow, with reports from Spain claiming that the Chelsea star is in negotiations with Liverpool over a deal. Willian's contract with Chelsea runs out in the summer, and To…", "url": "https://www.spurs-web.com/spurs-news/report-new-premier-league-big-six-club-enters-the-race-for-willian-free-transfer/", "urlToImage": null, "publishedAt": "2020-04-23T21:30:00Z", "content": "Tottenham Hotspurs hopes of signing Willian in the summer could soon be dealt a massive blow, with reports from Spain claiming that the Chelsea star is in negotiations with Liverpool over a deal.\r\nWillians contract with Chelsea runs out in the summer, and Tot… [+978 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Lee Ryder", "title": "American consortium chief reveals he 'dodged bullet' after talks with Mike Ashley to buy Newcastle United - Chronicle Live", "description": "The New York-born figurehead was eager to take on the job of transforming Newcastle United", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/american-consortium-chief-reveals-dodged-18140537", "urlToImage": null, "publishedAt": "2020-04-23T21:07:57Z", "content": "GACP Sports Capital chairman Joseph DaGrosa has revealed he \"dodged a bullet\" when not buying Newcastle United from Mike Ashley.\r\nThe chairman and CEO of Great American Capital Partners, who sold a stake in Ligue 1 side Bordeaux, held discussions with Justin … [+1193 chars]"}, {"source": {"id": null, "name": "Racefans.net"}, "author": "https://www.facebook.com/fritzdieter.rencken/", "title": "F1: McLaren's Brown blasts Ferrari over budget cap stance - RaceFans", "description": "McLaren team principal Zak Brown vehemently criticised Ferrari's opposition to a budget cap reduction, and challenged the team to reveal details of its power unit settlement with the FIA.", "url": "https://www.racefans.net/2020/04/23/mclaren-brown-blasts-ferrari/", "urlToImage": null, "publishedAt": "2020-04-23T20:02:00Z", "content": "McLaren team principal Zak Brown has vehemently criticised Ferrari’s opposition to a further reduction in Formula 1’s budget cap.\r\nIn a press conference on Thursday evening Brown dismissed Ferrari’s arguments against lowering the cap, saying they “don’t stack… [+7515 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "On This Day: Ronaldo's hat trick vs. Man United receives standing ovation (2003) | Champions League - ESPN UK", "description": "ESPN FC’s Alejandro Moreno and Sid Lowe take a nostalgic look back to 2003 when Brazilian Ronaldo scored a brilliant hat trick vs. Manchester United at Old T...", "url": "https://www.youtube.com/watch?v=i1ssR46tgQI", "urlToImage": null, "publishedAt": "2020-04-23T18:33:11Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Shocks and plenty of goals in Fifa tournament last 16 | ePremier League - BBC Sport", "description": "A shock for one of the favourites as the quarter-final line-up of the ePremier League Invitational tournament is finalised. WATCH LIVE COVERAGE OF THE TOURNA...", "url": "https://www.youtube.com/watch?v=0ujwkpCOCBM", "urlToImage": null, "publishedAt": "2020-04-23T17:40:20Z", "content": null}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Shane Ireland", "title": "Agent reveals dispute amid claim Liverpool star has completed Wolves transfer - Birmingham Live", "description": "Wolves transfer news includes agent of Loris Karius responding to claims made by Besiktas amid rumours goalkeeper is wanted by Wolves", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/loris-karius-wolves-transfer-liverpool-18135473", "urlToImage": null, "publishedAt": "2020-04-23T17:03:46Z", "content": "Loris Karius has not left Besiktas amid speculation linking the Liverpool goalkeeper with a move to Wolverhampton Wanderers, his agent has said.\r\nThe 26-year-old is locked in a bitter row with loan side Besiktas after the Turkish club's director Erda Torunogu… [+1955 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Wayne Rooney: Derby captain not leading player wage deferral rebellion, says spokesperson - BBC News", "description": "Ex-England captain Wayne Rooney is not leading a player rebellion at Derby over wage deferral talks, his spokesman tells BBC Sport.", "url": "https://www.bbc.co.uk/sport/football/52398549", "urlToImage": null, "publishedAt": "2020-04-23T16:24:18Z", "content": "Wayne Rooney has scored four goals in 15 appearances since joining Derby as player-coach in January\r\nFormer England captain Wayne Rooney is not leading a player rebellion at Derby County over wage deferral talks, his spokesman has told BBC Sport.\r\nRooney, 34,… [+1499 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Phil Neville's results never matched his rhetoric as England Women's manager - Telegraph.co.uk", "description": "Time becomes a slippery concept in a locked-down world.", "url": "https://www.telegraph.co.uk/football/2020/04/23/phil-nevilles-results-never-matched-rhetoric-england-womens/", "urlToImage": null, "publishedAt": "2020-04-23T15:47:00Z", "content": "Time becomes a slippery concept in a locked-down world. The longer the shutters are drawn, the more certainties dwindle about whether you have woken up on a Wednesday, a Sunday, or in the winter of 1993. In a realm as cyclical and diarised as sport, this effe… [+1335 chars]"}, {"source": {"id": null, "name": "Belfastlive.co.uk"}, "author": "Sheena McStravick", "title": "Thirteen more Coronavirus related deaths recorded in Northern Ireland - Belfast Live", "description": "There have also been a further 142 positive cases of the virus detected", "url": "https://www.belfastlive.co.uk/news/health/thirteen-more-coronavirus-related-deaths-18139736", "urlToImage": null, "publishedAt": "2020-04-23T15:19:04Z", "content": "A further 13 people have died here from Coronavirus, according to latest figures released by Department of Health.\r\n The latest fatalities brings the total number of Covid-19 related deaths here to 263. \r\nThe Department say the latest deaths occurred between … [+287 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Bundesliga make season announcement that could point to Premier League plan - Liverpool Echo", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMib2h0dHBzOi8vd3d3LmxpdmVycG9vbGVjaG8uY28udWsvc3BvcnQvZm9vdGJhbGwvZm9vdGJhbGwtbmV3cy9idW5kZXNsaWdhLW1ha2Utc2Vhc29uLWFubm91bmNlbWVudC1jb3VsZC0xODEzODk5NNIBc2h0dHBzOi8vd3d3LmxpdmVycG9vbGVjaG8uY28udWsvc3BvcnQvZm9vdGJhbGwvZm9vdGJhbGwtbmV3cy9idW5kZXNsaWdhLW1ha2Utc2Vhc29uLWFubm91bmNlbWVudC1jb3VsZC0xODEzODk5NC5hbXA?oc=5", "urlToImage": null, "publishedAt": "2020-04-23T14:56:05Z", "content": null}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ashley Preece", "title": "Key Aston Villa transfer decision made as Gabby Agbonlahor reveals Tottenham and West Brom interest - Birmingham Live", "description": "Aston Villa daily digest - Here's a round-up of some of the most-read stories via BirminghamLive, including a blast from the past in the form of one-time reserve-team regular Danny Jackman", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/key-aston-villa-transfer-decision-18135134", "urlToImage": null, "publishedAt": "2020-04-23T13:44:57Z", "content": "Exciting\r\nDarren Bent has urged Aston Villa to finally sign Said Benrahma from Brentford this summer.\r\nBenrahma was a top target for Dean Smith last summer but Villa refused to meet the Bees £20million asking price for the attacker.\r\nDespite missing the openi… [+6964 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Liverpool FC Quiz: Reds legend Steve Nicol vs. Michael Nicol ... his son! | Premier League - ESPN UK", "description": "The ESPN FC quiz is back, and this time former Liverpool great Steve Nicol takes on his son Michael to see who has the highest Liverpool IQ in the Nicol fami...", "url": "https://www.youtube.com/watch?v=iZAKKSVS1MM", "urlToImage": null, "publishedAt": "2020-04-23T11:00:30Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "CITY 4-0 STOKE HIGHLIGHTS | On This Day 23rd April 2016 - Man City", "description": "Kelechi Iheanacho struck twice as Manchester City moved up to third after condemning Stoke to their second 4-0 defeat in a week. SUBSCRIBE! http://www.youtub...", "url": "https://www.youtube.com/watch?v=keefD2Jzf14", "urlToImage": null, "publishedAt": "2020-04-23T10:00:11Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "National League: Barrow manager Ian Evatt says his side should go up - BBC News", "description": "Barrow manager Ian Evatt says his side should be promoted to League Two after the National League season was ended.", "url": "https://www.bbc.co.uk/sport/football/52394133", "urlToImage": null, "publishedAt": "2020-04-23T09:53:01Z", "content": "Barrow were top of the National League when the season was suspended\r\nBarrow manager Ian Evatt says his side should be promoted to League Two after the National League season was ended because of the coronavirus pandemic. \r\nBarrow led England's fifth tier by … [+5044 chars]"}, {"source": {"id": null, "name": "Teamtalk.com"}, "author": null, "title": "Solskjaer on brink of Man Utd sack before two things saved his job - Teamtalk.com", "description": "Manchester United boss Ole Gunnar Solskjaer nearly lost his job earlier this season before two things came to his rescue, according to reports.", "url": "https://www.teamtalk.com/news/two-things-saved-ole-gunnar-solskjaer-from-man-utd-sack", "urlToImage": null, "publishedAt": "2020-04-23T09:38:15Z", "content": "Manchester United boss Ole Gunnar Solskjaer nearly lost his job earlier this season before two things came to his rescue, according to reports.\r\nThat’s according to ESPN pundit Mark Ogden, who believes the Norwegian still has plenty to prove t0 the Old Traffo… [+2257 chars]"}]}