{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ben Husband", "title": "Wolves given major Adama Traore boost after shock Liverpool transfer claim - Birmingham Live", "description": "The Wolves winger has enjoyed a stunning season under Nuno and has been linked with a mega-money move to Anfield", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/liverpool-transfers-adama-traore-wolves-18148756", "urlToImage": null, "publishedAt": "2020-04-25T01:15:12Z", "content": "Liverpool could be set for a quiet transfer window, despite links suggesting Jurgen Klopp could sanction a £70m for Adama Traore.\r\n The Spaniard has emerged as a shock target for the Reds after a stunning second season for Wolverhampton Wanderers.\r\nUnder Nuno… [+1507 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ben Husband", "title": "Liverpool boss Jurgen Klopp could land Wolves transfer target for just €15m - reports - Birmingham Live", "description": "Aston Villa, Wolves and Liverpool have been linked with the forward, although there is interest from the Bundesliga as well", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/liverpool-transfers-wolves-milot-rashica-18148120", "urlToImage": null, "publishedAt": "2020-04-25T01:15:02Z", "content": "Milot Rashicas transfer value could plummet this summer, if Werder Bremen are relegated from the Bundesliga.\r\nThe forward has been linked with a number of clubs across Europe, including Wolverhampton Wanderers.\r\n Along with Wolves Liverpool and Aston Villa ha… [+1344 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Shane Ireland", "title": "Final Premier League table using points-per-game revealed - where Aston Villa and Wolves finish - Birmingham Live", "description": "UEFA has confirmed sporting merit would be used to determine European qualification for Premier League clubs if season is cancelled while Jamie Carragher wants to see it used for the entire table", "url": "https://www.birminghammail.co.uk/sport/football/football-news/final-premier-league-table-using-18144676", "urlToImage": null, "publishedAt": "2020-04-25T01:14:34Z", "content": "The final Premier League positions for Aston Villa and Wolverhampton Wanderers could be decided on points-per-game if the season is halted early.\r\nUEFA held its latest meeting on Thursday to discuss potential outcomes if the coronarivus pandemic means the cam… [+2178 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Ian Doyle", "title": "Only realistic way Liverpool can now lose Premier League title - Liverpool Echo", "description": "Ian Doyle discusses Liverpool, the Premier League title and the void in the latest Blood Red column", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/only-realistic-way-liverpool-can-18148023", "urlToImage": null, "publishedAt": "2020-04-25T00:08:28Z", "content": "It's all about the void for Liverpool at present.\r\nAnd we're not talking about the prospect of the Premier League season being scrapped.\r\nWell, not exclusively, at any rate.\r\nInstead, it's the huge chasm that has been left by the absence of football - and, ju… [+3501 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Bobby Vincent", "title": "Liverpool squad numbers available if Timo Werner or summer signings arrive - Liverpool Echo", "description": "Which shirt numbers are available if Liverpool make a move in the transfer market?", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-shirt-numbers-timo-werner-18138544", "urlToImage": null, "publishedAt": "2020-04-25T00:08:14Z", "content": "Liverpool's transfer business this summer remains uncertain in the light if the ongoing coronavirus pandemic.\r\nTimo Werner continues to be the main name linked with a potential move to Anfield.\r\nUnsurprisingly, Reds fans are excited about the possibility of t… [+2964 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Tashan Deniran-Alleyne", "title": "How the Dutch FA's decision would affect Chelsea's top-four battle with Man United and Tottenham - Football.London", "description": "The Eredivisie have become the first major European division to decide against crowning a league champion for the 2019/20 season, and the decision could impact English football", "url": "https://www.football.london/chelsea-fc/news/chelsea-champions-league-man-united-18148939", "urlToImage": null, "publishedAt": "2020-04-24T22:55:13Z", "content": "The big news in the world of football on Friday surrounding a massive decision made by the Dutch FA.\r\nIt was announced that the 2019/20 Eredivisie season has been ended.\r\nLast season's Champions League semi-finalists Ajax had led the table on goal difference … [+2396 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Newcastle told appointing Mauricio Pochettino would make Gareth Bale transfer possible - Mirror Online", "description": "Newcastle could be set for a multi-million pound takeover which could see big names head to St.James' Park with Gareth Bale linked", "url": "https://www.mirror.co.uk/sport/football/transfer-news/newcastle-told-appointing-mauricio-pochettino-21922862", "urlToImage": null, "publishedAt": "2020-04-24T22:38:20Z", "content": "Newcastle would have a chance of landing Gareth Bale were they to employ Mauricio Pochettino claims Dimitar Berbatov.\r\nThe Magpies are in the midst of a potential takeover from a Saudi Arabian consortium.\r\n Their millions have led to inevitable comparisons wi… [+1899 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Kishan Vaghela For Mailonline", "title": "Prime Minister Boris Johnson 'briefed on plans to have Premier League football return within weeks' - Daily Mail", "description": "The Prime Minister has been informed of the proposals for matches to be played behind closed doors. And Mr Johnson sees the resumption of live sport as key to boosting the moral of the nation.", "url": "https://www.dailymail.co.uk/sport/football/article-8255287/Prime-Minister-Boris-Johnson-briefed-plans-Premier-League-football-return-weeks.html", "urlToImage": null, "publishedAt": "2020-04-24T22:28:34Z", "content": "2020 OLYMPIC GAMES  \r\nThe 2020 Olympic Games has been postponed until 2021 on March 24 - becoming one of the last major sporting events this summer to fall victim to the coronavirus.\r\nJapanese prime minister Shinzo Abe held a crucial conference call with Olym… [+24811 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Jacob Steinberg", "title": "Chelsea to activate clause to extend Olivier Giroud's contract until 2021 - The Guardian", "description": "Chelsea are preparing to activate a clause that will allow them to extend Olivier Giroud’s contract by a year", "url": "https://www.theguardian.com/football/2020/apr/24/chelsea-to-activate-clause-to-extend-olivier-giroud-contract-until-2021", "urlToImage": null, "publishedAt": "2020-04-24T22:26:53Z", "content": "Chelsea are preparing to activate a clause that will allow them to extend Olivier Girouds contract by a year and stop the striker leaving on a free transfer this summer.\r\nWhile the France international could yet push for a move away from Stamford Bridge, Chel… [+1834 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "george harrison", "title": "Inside Mike Tyson’s £890k abandoned mansion that had tiger cages and basketball court before being converted t - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/1285850/mike-tyson-mansion-house-tiger-cage/", "urlToImage": null, "publishedAt": "2020-04-24T22:24:37Z", "content": "THIS is the spectacular mansion Mike Tyson abandoned during his rapid fall from grace.\r\nThe former professional boxer - who was convicted of rape in 1992 - had no choice but to sell this palatial property as financial ruin loomed, and the imposing Ohio mansio… [+2838 chars]"}, {"source": {"id": null, "name": "Theguardian.comfootball"}, "author": "Jamie Jackson", "title": "Raheem Sterling still setting himself a target of 35 goals this season - The Guardian", "description": "The break in the Premier League has not diminished Raheem Sterling’s ambition to score goals for Manchester City", "url": "https://amp.theguardian.comfootball/2020/apr/24/raheem-sterling-still-setting-himself-a-target-of-35-goals-this-season", "urlToImage": null, "publishedAt": "2020-04-24T22:20:56Z", "content": "Raheem Sterling believes he is 15 goals away from his target for the season, with the Manchester City forward having scored 20 times when the campaign was postponed six weeks ago due to coronavirus.\r\nThe 25-year-old registered a career-best 25 last season wit… [+1986 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Dominic King for the Daily Mail", "title": "Former Liverpool star Dominic Matteo and his wife on how he beat a brain tumour and is on the mend - Daily Mail", "description": "EXCLUSIVE INTERVIEW BY DOMINIC KING: This story will conclude with a ringing bell and thunderous applause but it must start with a blaring siren and flashing blue lights.", "url": "https://www.dailymail.co.uk/sport/football/article-8255097/Former-Liverpool-star-Dominic-Matteo-wife-beat-brain-tumour-mend.html", "urlToImage": null, "publishedAt": "2020-04-24T21:52:31Z", "content": "This story will conclude with a ringing bell and thunderous applause but it must start with a blaring siren and flashing blue lights.\r\nIt was Monday, November 11 when the ballet class Jessica Matteo was teaching was interrupted by a phone call. Her husband Do… [+9654 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ben Husband", "title": "Championship boss calls for Birmingham City and Leeds United transfer ban - Birmingham Live", "description": "Blues were proactive in taking steps to ensure the long-term viability of the club, with players agreeing to a wage deferral last month", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/championship-boss-calls-birmingham-city-18146044", "urlToImage": null, "publishedAt": "2020-04-24T21:33:37Z", "content": "Preston boss Alex Neil has urged the EFL to enforce a transfer embargo on teams that have furloughed staff or implemented wage cuts.\r\nBirmingham City were the first team in the second tier to agree to wage deferrals, with all players earning over £6,000 agree… [+1709 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Ed Woodward: Man Utd chief says big-money transfer talk ignores financial reality - BBC News", "description": "Manchester United executive vice-chairman Ed Woodward says speculation about transfers for \"hundreds of millions of pounds this summer\" is ignoring the \"realities that face the sport\".", "url": "https://www.bbc.co.uk/sport/football/52418826", "urlToImage": null, "publishedAt": "2020-04-24T21:31:20Z", "content": "United were linked with a £200m move for Tottenham and England striker Harry Kane\r\nManchester United executive vice-chairman Ed Woodward says speculation about transfers for \"hundreds of millions of pounds this summer\" is ignoring the \"realities that face the… [+2830 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Elliott Jackson", "title": "What Jurgen Klopp said to Liverpool before historic Barcelona comeback - Liverpool Echo", "description": "The Reds beat Barcelona 4-0 to reach the Champions League final", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/klopp-liverpool-talk-barcelona-comeback-18148913", "urlToImage": null, "publishedAt": "2020-04-24T20:35:00Z", "content": "James Milner has revealed what Jurgen Klopp said to his players in training before their unforgettable comeback against Barcelona in the Champions League. \r\nThe Reds remarkably beat the Spanish giants 4-0 at Anfield in the second leg of their Championship Lea… [+1744 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Mark Wakefield", "title": "Danny Murphy details Liverpool secret to beating Manchester United - Liverpool Echo", "description": "The former Reds midfielder enjoyed regular success against Liverpool's arch rivals, particularly away from home", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/danny-murphy-details-liverpool-secret-18143075", "urlToImage": null, "publishedAt": "2020-04-24T20:32:34Z", "content": "Former Liverpool midfielder Danny Murphy has revealed the tactical insight into the success the Reds had against Manchester United.\r\n During Murphys time on Merseyside, Liverpool enjoyed a number of successful matches against their old foes, particularly at O… [+2234 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Liverpool v Atletico Madrid: Coronavirus impact to be investigated by council - BBC News", "description": "Liverpool City Council will investigate whether the staging of a Champions League fixture had any impact on the spread of coronavirus in the city.", "url": "https://www.bbc.co.uk/sport/football/52420677", "urlToImage": null, "publishedAt": "2020-04-24T20:22:32Z", "content": "The match was the last major fixture played in England before the season was suspended\r\nThe impact of Liverpool's Champions League fixture with Atletico Madrid on the spread of coronavirus is being investigated by the city's council.\r\nThe move follows calls f… [+2278 chars]"}, {"source": {"id": null, "name": "Scotsman.com"}, "author": "Andrew Smith", "title": "Comment: Increasingly furtive SPFL is becoming a bastion of opacity - The Scotsman", "description": "League’s latest missive fails to address key issues around flawed vote to end season early", "url": "https://www.scotsman.com/sport/football/celtic/comment-increasingly-furtive-spfl-becoming-bastion-opacity-2549685", "urlToImage": null, "publishedAt": "2020-04-24T20:22:00Z", "content": "Leagues latest missive fails to address key issues around flawed vote to end season early\r\nFriday, 24th April 2020, 9:12 pm\r\nUpdated Friday, 24th April 2020, 9:22 pm\r\nSPFL chairman Murdoch MacLennan has been in post for nearly three years but is rarely seen a… [+4293 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "James Laird", "title": "2020 NFL Draft live stream: how to watch online from anywhere in the world - Techradar", "description": "Joe Burrow is the new face of the Cincinnati Bengals", "url": "https://www.techradar.com/news/2020-nfl-draft-live-stream-how-to-watch-online-from-anywhere-in-the-world", "urlToImage": null, "publishedAt": "2020-04-24T20:20:00Z", "content": "The 2020 NFL Draft is the first virtual player selection event in the league's history, but despite this year's proceedings being unprecedented in so many ways, some things about the draft never change: a stud QB goes at number one, the Patriots trade out of … [+10540 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Arsenal transfer news: Dani Ceballos drops major hint on future - Metro.co.uk", "description": "'He always told me that my future is in Real Madrid.'", "url": "https://metro.co.uk/2020/04/24/dani-ceballos-drops-major-hint-arsenal-future-12607215/", "urlToImage": null, "publishedAt": "2020-04-24T19:57:03Z", "content": "Ceballos has impressed in spells at Arsenal (Picture: Getty Images)\r\nReal Madrid boss Zinedine Zidane has told Dani Ceballos his future lies at the Bernabeu, amid speculation that Arsenal are keen on making his loan move permanent.\r\nThe Spain international ha… [+1869 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Is Jamie Carragher RIGHT?! Fernando Torres' flabbergasting move from Liverpool to Chelsea | ESPN FC - ESPN UK", "description": "Craig Burley and Julien Laurens join Dan Thomas on ESPN FC to react to recent comments made by former Liverpool defender Jamie Carragher and former Chelsea c...", "url": "https://www.youtube.com/watch?v=hoRBD5aVqVk", "urlToImage": null, "publishedAt": "2020-04-24T19:51:55Z", "content": "Craig Burley and Julien Laurens join Dan Thomas on ESPN FC to react to recent comments made by former Liverpool defender Jamie Carragher and former Chelsea captain John Terry about Fernando Torres £50 million move to Stamford Bridge from Anfield. Both Laurens… [+348 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Marc Mayo", "title": "David Haye ponders incredible return to fight winner of Tyson Fury vs Anthony Joshua now ‘injuries have h - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/boxing/11475466/david-haye-comeback-joshua-fury/", "urlToImage": null, "publishedAt": "2020-04-24T19:35:26Z", "content": "DAVID HAYE will only return to the ring to fight either Anthony Joshua or Tyson Fury having overcome the injury problems that ended his boxing career.\r\nLast seen coming a cropper in a pair of bouts with Tony Bellew, the former heavyweight champion says only t… [+3145 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "George Dobell", "title": "UK government hands ECB lead on viability of 'bio-secure' sport | ESPNcricinfo.com - ESPNcricinfo", "description": "England will play at as few grounds as possible if cricket goes behind closed doors, says ECB CEO | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29094232/uk-government-hands-ecb-lead-viability-bio-secure-sport", "urlToImage": null, "publishedAt": "2020-04-24T19:28:39Z", "content": "The ECB has been asked by the UK government to lead the way into investigating the viability of playing sport in a bio-secure environment.\r\nWith an increasing acceptance that the best chance of fulfilling the broadcast deals that keep nearly all sport afloat … [+8018 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Mark Jones", "title": "Premier League ref Mark Clattenburg \"told you to f*** off\", says Kasper Schmeichel - Mirror Online", "description": "The Leicester City goalkeeper said that the County Durham official was his favourite top-flight ref before his sudden departure from the Premier League in 2017", "url": "https://www.mirror.co.uk/sport/football/news/premier-league-ref-mark-clattenburg-21921136", "urlToImage": null, "publishedAt": "2020-04-24T19:12:04Z", "content": "Leicester City goalkeeper Kasper Schmeichel says that former Premier League referee Mark Clattenburg was his favourite top-flight official because \"he'd tell you to f*** off\" if he felt that you deserved it.\r\nCounty Durham official Clattenburg was once seen a… [+1738 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Liam Corless", "title": "Manchester United coach Mike Phelan identifies change in Solskjaer mentality - Manchester Evening News", "description": "Mike Phelan returned to Manchester United at the same time as Ole Gunnar Solskjaer after Jose Mourinho was sacked in December 2018.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-utd-news-phelan-solskjaer-18148705", "urlToImage": null, "publishedAt": "2020-04-24T18:54:13Z", "content": "Manchester United coach Mike Phelan suggested Ole Gunnar Solskjaer's mentality has changed and that the Norwegian is now more thoughtful than he was during his playing career.\r\nSolskjaer restored Phelan to the role of United's assistant manager when he return… [+1360 chars]"}, {"source": {"id": null, "name": "Ufc.com"}, "author": null, "title": "Official Statement on UFC 249 - UFC", "description": "An interim lightweight title bout headlines a stacked card on May 9.", "url": "https://www.ufc.com/news/official-statement-ufc-249-may-9-gaethje-ferguson-ngannou-cejudo", "urlToImage": null, "publishedAt": "2020-04-24T18:22:46Z", "content": "Las Vegas UFC® returns with one of the most stacked cards in recent history, set to be headlined by a bout guaranteed to deliver fireworks as No. 1 ranked lightweight contender Tony Fergusonand No. 4 ranked Justin Gaethje battle for the interim championship. … [+6665 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Matt Davies", "title": "Philippe Coutinho or Jadon Sancho? Chelsea face transfer decision as Manchester United battle heats up - Evening Standard", "description": "", "url": "https://www.standard.co.uk/sport/football/jadon-sancho-philippe-coutinho-chelsea-face-decision-manchester-united-battle-heats-a4423686.html", "urlToImage": null, "publishedAt": "2020-04-24T18:10:42Z", "content": "While the Premier League was still up and running, Chelsea and Manchester United were locked in a fierce battle for a Champions League spot. But with football suspended indefinitely, a new fight has emerged: the race for Jadon Sancho's signature.\r\nThe Borussi… [+3126 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Suzanne Wrack", "title": "Who could replace Phil Neville as England Women's manager? - The Guardian", "description": "We run the rule over leading candidates, including a two-times World Cup winner and a woman who worked as Neville’s No 2", "url": "https://www.theguardian.com/football/2020/apr/24/who-could-replace-phil-neville-as-england-womens-manager", "urlToImage": null, "publishedAt": "2020-04-24T18:00:00Z", "content": "The Football Associations hunt for a successor to Mark Sampson in 2017 quickly became a circus. Names flew out of the ring as fast as they stepped in. Increased scrutiny on the person in charge, with the game professionalising, led some of those on the shortl… [+4734 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Jamie Carragher confirms wife tested positive for coronavirus in second family diagnosis - Mirror Online", "description": "Former Liverpool defender Carragher made the announcement when discussing how the football season in the UK can be resumed safely amid the current pandemic", "url": "https://www.mirror.co.uk/sport/football/news/jamie-carragher-confirms-wife-coronavirus-21921317", "urlToImage": null, "publishedAt": "2020-04-24T17:42:56Z", "content": "Jamie Carragher has revealed his wife Nicola has tested positive for coronavirus, becoming the second person in his family to contract the illness. \r\n The former Liverpool defender turned Sky Sports pundit also explained that his aunt had been receiving treat… [+2284 chars]"}, {"source": {"id": null, "name": "Racingpost.com"}, "author": "Peter Scargill", "title": "Majority of jockeys expected to be allowed to ride when British racing returns - Racing Post", "description": "A significant number of jockeys will be able to participate in races once the sport resumes with inexperienced claiming riders the only ones like to initially", "url": "https://www.racingpost.com/news/majority-of-jockeys-expected-to-be-allowed-to-ride-when-british-racing-returns/432315", "urlToImage": null, "publishedAt": "2020-04-24T17:22:07Z", "content": "A significant number of jockeys will be able to participate in races once the sport resumes in Britain, with inexperienced claiming riders the only ones likely to initially miss out.\r\nThere had been confusion over who would be permitted to ride when racing re… [+2454 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Green Bay Packers' Aaron Rodgers within rights to be annoyed by Jordan Love pick, says Neil Reynolds - Sky Sports", "description": "Neil Reynolds and Jeff Reinebold analyse the Green Bay Packers' shock selection of Utah State quarterback Jordan Love.", "url": "https://www.skysports.com/nfl/news/12118/11978237/green-bay-packers-aaron-rodgers-within-rights-to-be-annoyed-by-jordan-love-pick-says-neil-reynolds", "urlToImage": null, "publishedAt": "2020-04-24T17:15:29Z", "content": "Aaron Rodgers is the same age as Brett Favre was when he was selected as his eventual successor by the Green Bay Packers with the No 24 pick at the 2005 NFL Draft.\r\nThat nugget became relevant with pick No 26 on day one of the 2020 Draft as the Packers produc… [+2899 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Arsenal ready to listen to offers for Chelsea & Man U target Aubameyang - Metro.co.uk", "description": "Is Aubameyang poised to leave Arsenal?", "url": "https://metro.co.uk/2020/04/24/transfer-arsenal-chelsea-man-utd-pierre-emerick-aubameyang-12605032/", "urlToImage": null, "publishedAt": "2020-04-24T17:12:57Z", "content": "Aubameyang has many suitors (Picture: Getty)\r\nArsenal are ready to listen to offers for Pierre-Emerick Aubameyang after shelving contract talks with the striker, according to reports.\r\nAubameyang has been the subject of intense transfer speculation this seaso… [+1914 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Shane Ireland", "title": "'No no no!' - New EFL proposal slammed by West Brom and Leeds United fans - Birmingham Live", "description": "West Brom news includes reaction to reports the Championship could be regionalised into two sub-divisions splitting promotion rivals WBA and Leeds United", "url": "https://www.birminghammail.co.uk/sport/football/football-news/west-brom-promotion-championship-efl-18124456", "urlToImage": null, "publishedAt": "2020-04-24T16:48:47Z", "content": "Promotion rivals West Bromwich Albion and Leeds United could be split under plans to regionalise the Championship.\r\n One suggestion being explored amid the coronavirus pandemic is to divide the Championship, League One and League Two into split sub-divisions,… [+1604 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Jack Rosser", "title": "Hakim Ziyech set to seal Chelsea transfer on July 1 as Eredivisie is cancelled - Evening Standard", "description": "", "url": "https://www.standard.co.uk/sport/football/hakim-ziyech-chelsea-transfer-news-latest-ajax-dutch-football-a4423676.html", "urlToImage": null, "publishedAt": "2020-04-24T16:47:55Z", "content": "Hakim Ziyech will be free to join Chelsea without delay this summer after the Eredivisie season was cancelled.\r\nThe Dutch FA and clubs have ratified the decision to end the season prematurely after major events were banned in the Netherlands until September 1… [+968 chars]"}, {"source": {"id": null, "name": "Teamtalk.com"}, "author": null, "title": "Roy Keane reveals first thoughts when Juan Veron walked into Man Utd - Teamtalk.com", "description": "Roy Keane says he was \"excited\" when Manchester United signed Juan Veron and saw his arrival as a \"challenge\" to keep his place in the starting lineup.", "url": "https://www.teamtalk.com/news/keane-thoughts-juan-veron-man-utd", "urlToImage": null, "publishedAt": "2020-04-24T16:02:55Z", "content": "Roy Keane says he was “excited” when Manchester United signed Juan Veron and saw his arrival as a “challenge” to keep his place in the starting lineup. \r\nVeron moved to Old Trafford in in June 2001 for a fee of £28.1million, breaking the record for the highes… [+3634 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Mark Wakefield", "title": "Alvaro Morata perfectly describes what it is like to face Liverpool star Virgil van Dijk - Liverpool Echo", "description": "The Reds centre-back recently faced Morata in the last-16 tie against Atletico Madrid in the Champions League", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/alvaro-morata-perfectly-describes-what-18142366", "urlToImage": null, "publishedAt": "2020-04-24T15:46:44Z", "content": "Atletico Madrid striker Alvaro Morata has explained why Liverpool star Virgil van Dijk is difficult to play against.\r\nThe Reds centre-back has been a revelation since his £75m move from Southampton in 2018. \r\nVan Dijk has helped the club win three major troph… [+920 chars]"}, {"source": {"id": null, "name": "Derbytelegraph.co.uk"}, "author": "Chris Watson", "title": "Derby County favourite has contract terminated by Championship club - Derbyshire Live", "description": "The former Rams midfielder and coach had been part of Graeme Jones' backroom staff at Luton Town", "url": "https://www.derbytelegraph.co.uk/sport/football/football-news/inigo-idiakez-derby-luton-harford-4076842", "urlToImage": null, "publishedAt": "2020-04-24T15:19:00Z", "content": "Derby County favourite Inigo Idiakez has lost his job at Sky Bet Championship club Luton Town.\r\nIdiakez had been first-team coach at Kenilworth Road but has had his contract terminated with immediate effect, along with manager Graeme Jones, assistant boss Gar… [+2928 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Chelsea Season So Far | December 19/20 - Chelsea Football Club", "description": "We take a look at Frank Lampard's first season as Chelsea Manager. Up next is the month of December which included big wins against Arsenal & Spurs. Download...", "url": "https://www.youtube.com/watch?v=Ei3zOe4_4p4", "urlToImage": null, "publishedAt": "2020-04-24T15:00:07Z", "content": "We take a look at Frank Lampard's first season as Chelsea Manager. Up next is the month of December which included big wins against Arsenal &amp; Spurs.\r\nDownload Chelsea FC's official mobile app:-App Store https://apple.co/2vvlN9t-Play Store http://bit.ly/2M… [+840 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Shane Ireland", "title": "England make decision on Aston Villa star Jack Grealish after lockdown controversy - reports - Birmingham Live", "description": "Aston Villa news includes Gareth Southgate's stance on AVFC captain Grealish", "url": "https://www.birminghammail.co.uk/sport/football/football-news/england-make-decision-aston-villa-18142235", "urlToImage": null, "publishedAt": "2020-04-24T14:13:03Z", "content": "Aston Villa captain Jack Grealish will not be frozen out by England despite flouting lockdown rules, according to reports.\r\n The 24-year-old has shone on the Premier League stage this season even though Villa are locked in a relegation battle. \r\n With seven l… [+1587 chars]"}, {"source": {"id": null, "name": "Football365.com"}, "author": "Joe Williams", "title": "Neville predicts 'absolute carnage' unless the Premier League act - Football365.com", "description": "Football365 - \"The future revenues are into the 10s of billions in the Premier League.\"", "url": "https://www.football365.com/news/gary-neville-predicts-absolute-carnage-unless-the-premier-league-act", "urlToImage": null, "publishedAt": "2020-04-24T13:58:20Z", "content": "The Premier League should borrow against future television earnings to safeguard English football’s financial survival amid the coronavirus pandemic, according to former Manchester United defender Gary Neville.\r\nThe Sky Sports pundit believes the league and i… [+2621 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Sean Ingle", "title": "London Marathon race director admits event may include only elite runners - The Guardian", "description": "The race director of the London Marathon has refused to rule out staging the event as an elite-only race in the autumn if social distancing rules make it impossible to run as normal", "url": "https://www.theguardian.com/sport/2020/apr/24/london-marathon-race-director-admits-event-may-include-only-elite-runners", "urlToImage": null, "publishedAt": "2020-04-24T13:41:52Z", "content": "The race director of the London Marathon has refused to rule out staging the event as an elite-only race in the autumn if social distancing rules make it impossible to run as normal.\r\nHugh Brasher told the Guardian that while organisers still hoped to hold th… [+3659 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Joseph Chapman, Ashley Preece", "title": "West Brom trio discussed as Charlie Austin backed to join Celtic - Birmingham Live", "description": "West Bromwich Albion daily digest - Here's a rundown of the biggest Albion stories via BirminghamLive, including Neil Warnock admitting West Brom and Leeds United should still see out the season", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/west-brom-celtic-leeds-united-18141870", "urlToImage": null, "publishedAt": "2020-04-24T12:45:47Z", "content": "Option\r\nAlan Hutton can see Charlie Austin being a good fit for Celtic, if they were to pursue a deal with West Brom this summer.\r\nAlbion  striker Austin, who has scored nine goals this term in all competitions, revealed recently that, if ever a chance to exp… [+4535 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Ian Doyle", "title": "Harvey Elliott reveals Mohamed Salah message and makes Steven Gerrard target at Liverpool - Liverpool Echo", "description": "Liverpool youngster Harvey Elliott has opened up on his first season working under Jurgen Klopp", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/harvey-elliott-reveals-mohamed-salah-18143937", "urlToImage": null, "publishedAt": "2020-04-24T12:40:31Z", "content": "Harvey Elliott has revealed the impact Mohamed Salah is having on his development at Liverpool - as he outlined his desire to follow in the footsteps of Steven Gerrard.\r\nElliott has made an encouraging start to his Reds career having arrived from Fulham when … [+2921 chars]"}, {"source": {"id": null, "name": "Portsmouth.co.uk"}, "author": "Jordan Cronin", "title": "Exclusive: The date Portsmouth fans will be let back into Fratton Park as EFL plan fixtures - Portsmouth News", "description": "Portsmouth fans won’t be allowed into Fratton Park until October under current EFL plans.", "url": "https://www.portsmouth.co.uk/sport/football/portsmouth-fc/exclusive-date-portsmouth-fans-will-be-let-back-fratton-park-efl-plan-fixtures-2548930", "urlToImage": null, "publishedAt": "2020-04-24T12:27:00Z", "content": "(Photo by Dan Istitene/Getty Images) Copyright: Getty Images\r\nThe News understands that the EFL have set a date of October 1 as the earliest opportunity when supporters could return to stadiums, with all fixtures played prior to that date whether as part of t… [+1687 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Shane Ireland", "title": "Manchester United sent stunning message over '£130m' Wolves transfer - Birmingham Live", "description": "Wolves transfer news includes pundit's message to Raul Jimenez suitors as Man Utd and Real Madrid linked", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/raul-jimenez-man-utd-wolves-18142364", "urlToImage": null, "publishedAt": "2020-04-24T12:15:27Z", "content": "Wolverhampton Wanderers striker Raul Jimenez would cost suitors well over £100million, according to former Premier League defender Alex Bruce.\r\nJimenez's form has been one of the many highlights of a terrific campaign for Wolves, who are sixth in the table an… [+1600 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Rohan Janse van Rensburg: Sale player sanctioned for signing deals with two clubs - BBC Sport", "description": "Rohan Janse van Rensburg is fined and given a two-week ban for signing contracts with both Sale and Gloucester.", "url": "https://www.bbc.co.uk/sport/rugby-union/52413671", "urlToImage": null, "publishedAt": "2020-04-24T11:56:57Z", "content": "Rohan Janse van Rensburg played for South African side Lions before moving to the English Premiership\r\nCentre Rohan Janse van Rensburg has been fined £32,500 and handed a two-week ban for signing contracts with Premiership clubs Sale and Gloucester.\r\nVan Rens… [+1582 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Callum Hudson-Odoi sends Chelsea transfer message to close friend Jadon Sancho - Mirror Online", "description": "Sancho and Hudson-Odoi came through the England youth ranks together and have been speaking \"every other day\" during lockdown amid rumours linking the Dortmund star with Chelsea and Man Utd", "url": "https://www.mirror.co.uk/sport/football/news/callum-hudson-odoi-sends-chelsea-21919060", "urlToImage": null, "publishedAt": "2020-04-24T11:41:09Z", "content": "Callum Hudson-Odoi has revealed he is in constant communication with Jadon Sancho and admitted he would love for the Borussia Dortmund star to join him at Chelsea. \r\nThe international teammates share a good relationship from their England youth days, and both… [+2016 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Who is Joe Burrow, Cincinnati's No 1 overall draft pick? - Sky Sports", "description": "The Cincinnati Bengals selected Joe Burrow as the No 1 overall pick at the 2020 NFL Draft.", "url": "https://www.skysports.com/nfl/news/12118/11977214/who-is-joe-burrow-cincinnatis-no-1-overall-draft-pick", "urlToImage": null, "publishedAt": "2020-04-24T11:31:01Z", "content": "Remember the name Joe Burrow, because in 10 years' time NFL fans far and wide will be analysing his success among history's No 1 overall draft picks. \r\nThe Cincinnati Bengals resisted temptation to spring a surprise during the most unorthodox of NFL Drafts as… [+6106 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Tom Leach", "title": "Gary Neville explains what is remarkable about 'sensational' Liverpool - Liverpool Echo", "description": "The 45-year-old was in action for United at some of the world's biggest and best stadiums during his long career, including Barcelona's Nou Camp.", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-manchester-united-anfield-neville-18137466", "urlToImage": null, "publishedAt": "2020-04-24T10:54:36Z", "content": "Manchester United legend Gary Neville has revealed what it is really like playing against Liverpool at Anfield. \r\nThe former Old Trafford right-back was speaking to Sky Sports' Football Show when he was asked to lift the lid on how it felt to be the bad guy i… [+1472 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Stuart Jamieson", "title": "'He would be adored like you wouldn’t believe' - Pochettino backed for United job - Chronicle Live", "description": "Don Hutchison reveals why he is backing Mauricio Pochettino for Newcastle - but not former Juventus manager Massimiliano Allegri", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/newcastle-pochettino-allegri-favre-hutchison-18142105", "urlToImage": null, "publishedAt": "2020-04-24T10:03:08Z", "content": "Don Hutchison believes Massimiliano Allegri would not be interested in the Newcastle United job should it become available under any new owners.\r\nBut the former Liverpool, West Ham and Sunderland midfielder has backed either former Tottenham boss Mauricio Poc… [+1359 chars]"}, {"source": {"id": null, "name": "Dartsnews.com"}, "author": null, "title": "Klaasen posts proof after accusations of cheating during PDC Home Tour group win - Dartsnews.com", "description": "Jelle Klaasen claimed a group win last night in the PDC Home Tour but this was marred by accusations of cheating which stemmed from his match", "url": "https://dartsnews.com/klaasen-posts-proof-after-accusations-of-cheating-during-pdc-home-tour-group-win/", "urlToImage": null, "publishedAt": "2020-04-24T09:28:36Z", "content": "Jelle Klaasen claimed a group win last night in the PDC Home Tour but this was marred by accusations of cheating which stemmed from his match against Gabriel Clemens where he hit a 70 finish but on the initial PDC stream it didn’t look to be fully in to some.… [+1224 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Mark Jones", "title": "British billionaire Alki David hints at Nou Camp name choice as he eyes Barcelona deal - Mirror Online", "description": "Barcelona have announced that they will sell naming rights to the Nou Camp for the 2020/21 season, with the proceeds going towards fighting coronavirus", "url": "https://www.mirror.co.uk/sport/football/news/british-billionaire-alki-david-hints-21919101", "urlToImage": null, "publishedAt": "2020-04-24T08:43:29Z", "content": "A British billionaire linked to Mike Tyson says he's \"quietly confident\" that he can complete a naming rights deal for Barcelona's Nou Camp stadium, and has suggested what he could call it.\r\nAlki David, who was born in Nigeria but holds a British passport, is… [+2377 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Mark Wakefield", "title": "Adama Traore agent makes transfer admission amid Liverpool links - Liverpool Echo", "description": "Jurgen Klopp's Liverpool have been linked with a summer move for Adama Traore and his agent has spoken out", "url": "https://www.liverpoolecho.co.uk/sport/football/transfer-news/adama-traore-agent-makes-transfer-18142069", "urlToImage": null, "publishedAt": "2020-04-24T08:36:04Z", "content": "Adama Traore's agent has addressed the future of his client and indicated he still believes there could be a \"market\" for him this summer.\r\n Liverpool and other top teams have been tentatively linked with a move for the Wolverhampton Wanderers winger, with Fo… [+1717 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Marcus Banks", "title": "Manchester United considering tactical change on Premier League return - Manchester Evening News", "description": "Manchester United coach Kieran McKenna opened up on the talks between the club's coaches during the break from Premier League action.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-utd-news-tactics-mckenna-18142137", "urlToImage": null, "publishedAt": "2020-04-24T07:52:49Z", "content": "Manchester United are considering adopting new tactical approaches when they return to action, according to coach Kieran McKenna. \r\nThe UK lockdown was recently extended until May 7 at the earliest and United have been out of action since the 5-0 win against … [+1344 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "EFL under pressure to scrap financial rules after Birmingham City charge - Birmingham Live", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiaWh0dHBzOi8vd3d3LmJpcm1pbmdoYW1tYWlsLmNvLnVrL3Nwb3J0L2Zvb3RiYWxsL2Zvb3RiYWxsLW5ld3MvZWZsLXVuZGVyLXByZXNzdXJlLXNjcmFwLWZpbmFuY2lhbC0xODEzODc2MNIBbWh0dHBzOi8vd3d3LmJpcm1pbmdoYW1tYWlsLmNvLnVrL3Nwb3J0L2Zvb3RiYWxsL2Zvb3RiYWxsLW5ld3MvZWZsLXVuZGVyLXByZXNzdXJlLXNjcmFwLWZpbmFuY2lhbC0xODEzODc2MC5hbXA?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T07:31:23Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "John Cross", "title": "Eric Dier facing lengthy ban after being hit with FA charge over fan confrontation - Mirror Online", "description": "Eric Dier has been charged by the FA after he clashed with a fan in the aftermath of Tottenham's FA Cup defeat to Norwich", "url": "https://www.mirror.co.uk/sport/football/news/eric-dier-facing-lengthy-ban-21916800", "urlToImage": null, "publishedAt": "2020-04-24T07:03:13Z", "content": "Eric Dier is facing a lengthy ban after being hit with an FA misconduct charge.\r\nTottenham midfielder Dier climbed into the stand to confront a fan who was having a row with his brother after their FA Cup exit to Norwich last month. \r\nDier has until May 8 to … [+1927 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Mark Douglas", "title": "'It was once in a lifetime': The story of Daryl Murphy, the signing who proved Mike Ashley wrong - Chronicle Live", "description": "When Newcastle United signed Daryl Murphy, it wasn't a transfer to get fans excited but he proved a vital signing who confounded expectations", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/it-once-lifetime-story-daryl-18135058", "urlToImage": null, "publishedAt": "2020-04-24T02:18:06Z", "content": "Daryl Murphys car rolled into the Newcastle United training ground a few days after sealing a move that came like a bolt from the blue.\r\nThe first thing you notice when you sign for Newcastle and you come in for training is everyone waiting to get autographs … [+7214 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Mark McDougall", "title": "Joey Barton blasts Rangers captain James Tavernier over his defending and hair obsession - Daily Record", "description": "The controversial Ibrox flop didn't hold back as he hit out at Tavernier for his defending skills and his lack of preparation for big games.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/joey-barton-blasts-rangers-captain-21916970", "urlToImage": null, "publishedAt": "2020-04-23T21:58:11Z", "content": "Rangers flop Joey Barton has lifted the lid on his controversial spell at Ibrox and blasted skipper James Tavernier for caring more about his hair than football.\r\nBarton has rarely spoken about his time in Glasgow prior to this but opened up in an explosive i… [+1965 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Lee Ryder", "title": "American consortium chief reveals he 'dodged bullet' after talks with Mike Ashley to buy Newcastle United - Chronicle Live", "description": "The New York-born figurehead was eager to take on the job of transforming Newcastle United", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/american-consortium-chief-reveals-dodged-18140537", "urlToImage": null, "publishedAt": "2020-04-23T21:07:57Z", "content": "GACP Sports Capital chairman Joseph DaGrosa has revealed he \"dodged a bullet\" when not buying Newcastle United from Mike Ashley.\r\nThe chairman and CEO of Great American Capital Partners, who sold a stake in Ligue 1 side Bordeaux, held discussions with Justin … [+1193 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Stephen Moyes", "title": "Arsenal aces Xhaka, Pepe, Luiz and Lacazette are latest Premier League Covidiots to flout coronavirus lockdown - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11458411/xhaka-pepe-lacazette-luiz-arsenal-players-coronavirus-lockdown/", "urlToImage": null, "publishedAt": "2020-04-23T20:54:41Z", "content": "FOUR Arsenal stars have become the latest Premier League Covidiots to break the government's lockdown rules.\r\nClub-record £72million signing Nicolas Pepe was filmed having a kickabout with a dozen pals in North London, with footage shared on WhatsApp.\r\n Nicol… [+3652 chars]"}, {"source": {"id": null, "name": "Racefans.net"}, "author": "https://www.facebook.com/fritzdieter.rencken/", "title": "F1: McLaren's Brown blasts Ferrari over budget cap stance - RaceFans", "description": "McLaren team principal Zak Brown vehemently criticised Ferrari's opposition to a budget cap reduction, and challenged the team to reveal details of its power unit settlement with the FIA.", "url": "https://www.racefans.net/2020/04/23/mclaren-brown-blasts-ferrari/", "urlToImage": null, "publishedAt": "2020-04-23T20:02:00Z", "content": "McLaren team principal Zak Brown has vehemently criticised Ferrari’s opposition to a further reduction in Formula 1’s budget cap.\r\nIn a press conference on Thursday evening Brown dismissed Ferrari’s arguments against lowering the cap, saying they “don’t stack… [+7515 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "On This Day: Ronaldo's hat trick vs. Man United receives standing ovation (2003) | Champions League - ESPN UK", "description": "ESPN FC’s Alejandro Moreno and Sid Lowe take a nostalgic look back to 2003 when Brazilian Ronaldo scored a brilliant hat trick vs. Manchester United at Old T...", "url": "https://www.youtube.com/watch?v=i1ssR46tgQI", "urlToImage": null, "publishedAt": "2020-04-23T18:33:11Z", "content": null}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Mark Wakefield", "title": "PSG make drastic Kylian Mbappe transfer 'decision' that could benefit Liverpool - Liverpool Echo", "description": "Liverpool and Real Madrid have been rumoured to be interested in the Paris Saint-Germain star's services in recent months", "url": "https://www.liverpoolecho.co.uk/sport/football/transfer-news/psg-make-drastic-kylian-mbappe-18135428", "urlToImage": null, "publishedAt": "2020-04-23T18:04:08Z", "content": "Paris Saint-Germain are reportedly willing to resort to drastic measures in order to keep hold of Kylian Mbappe. \r\nLiverpool, as well as Real Madrid, have been tentatively linked with a move for the France international for a number of months.\r\nAfter signing … [+1856 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Mark Wakefield", "title": "Liverpool concept kits ranked as fans rave about Nike designs - Liverpool Echo", "description": "Reds fans have been creative in producing designs which show Nike strips Jurgen Klopp's side could wear during the 2020/21 season", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-concept-kits-ranked-fans-18124985", "urlToImage": null, "publishedAt": "2020-04-23T17:58:06Z", "content": "With the new Liverpool kit for the 2020/21 season yet to be released, fans continue to be creative with their online edits.\r\nThe Reds struck a deal with Nike last year after winning a High Court battle against current manufacturers New Balance.\r\nAfter a week-… [+1080 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Shocks and plenty of goals in Fifa tournament last 16 | ePremier League - BBC Sport", "description": "A shock for one of the favourites as the quarter-final line-up of the ePremier League Invitational tournament is finalised. WATCH LIVE COVERAGE OF THE TOURNA...", "url": "https://www.youtube.com/watch?v=0ujwkpCOCBM", "urlToImage": null, "publishedAt": "2020-04-23T17:40:20Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Adam Shergold for MailOnline", "title": "Coronavirus: Bundesliga bosses sign off on a May 9 return with 25,000 tests needed - Daily Mail", "description": "Matches will continue behind closed doors with a maximum of 322 people in and around stadiums for top-flight Bundesliga matches and 270 for second-tier games.", "url": "https://www.dailymail.co.uk/sport/football/article-8248727/Coronavirus-Bundesliga-bosses-sign-9-return-25-000-tests-needed.html", "urlToImage": null, "publishedAt": "2020-04-23T16:20:46Z", "content": "Germany's Bundesliga is set to be the first major European league to resume amid the coronavirus pandemic after the 36 clubs in the top two divisions decided on a May 9 restart.\r\nMatches will take place behind closed doors with a maximum of 322 people allowed… [+6707 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Should The Premier League Be Decided On Points Per Game? + Reviewing Goal, The Best Football Film? - 90min Football", "description": "Should we finish the Premier League 2019/20 season by ranking the teams based on points per game? Liverpool would still win the Premier League this season, b...", "url": "https://www.youtube.com/watch?v=c-XWEYBjdAY", "urlToImage": null, "publishedAt": "2020-04-23T16:16:51Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Mark Jones", "title": "Steven Gerrard vs El-Hadji Diouf rivalry sparked by key Liverpool transfer failure - Irish Mirror", "description": "Gerard Houllier's transfer decision in the summer of 2002 is still coming back to haunt the Reds now, as stories of Diouf's time at Anfield continue to be told", "url": "https://www.mirror.co.uk/sport/football/news/steven-gerrard-vs-el-hadji-21913290", "urlToImage": null, "publishedAt": "2020-04-23T16:10:25Z", "content": "Only 23,576 fans had been at Anfield on a cold December night in 2002 to watch Liverpool beat the Dutch side Vitesse Arnhem 1-0 in a UEFA Cup third round tie, when El-Hadji Diouf strode into the players' lounge and stared around the room.\r\n\"Oh God, here he is… [+6049 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mesut Ozil 'correct' to refuse pay cut – Gab Marcotti | ESPN FC - ESPN UK", "description": "ESPN FC’s Gab Marcotti and Julien Laurens discuss the financial crisis at Arsenal caused by the coronavirus pandemic and Mesut Ozil’s refusal to take a pay c...", "url": "https://www.youtube.com/watch?v=F_bMdiVmwEI", "urlToImage": null, "publishedAt": "2020-04-23T12:33:55Z", "content": "ESPN FCs Gab Marcotti and Julien Laurens discuss the financial crisis at Arsenal caused by the coronavirus pandemic and Mesut Ozils refusal to take a pay cut at this time. Gab defends Ozil, saying that there is no need for him to take a full pay cut as the se… [+344 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "League One & League Two clubs write to EFL over salary cap introduction - BBC Sport", "description": "Clubs in League One and League Two write to the English Football League asking for salary caps to be introduced next season.", "url": "https://www.bbc.co.uk/sport/football/52398548", "urlToImage": null, "publishedAt": "2020-04-23T12:20:59Z", "content": "John Radford sent to the letter on behalf of 37 teams across League One and League Two\r\nClubs in League One and League Two have written to the English Football League asking for salary caps to be introduced next season.\r\nThe letter was sent on behalf of 37 of… [+1852 chars]"}]}