{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Danny Gallagher For Mailonline", "title": "Olympiacos set to be relegated to the second tier and chief Evangelos Marinakis facing lifetime ban - Daily Mail", "description": "Greek giants Olympiacos stand on the brink after reports emerged they that are to be relegated to the lower tiers and hit with hefty fines following historic match-fixing allegations.", "url": "https://www.dailymail.co.uk/sport/sportsnews/article-8256305/Olympiacos-set-relegated-second-tier-chief-Evangelos-Marinakis-facing-lifetime-ban.html", "urlToImage": null, "publishedAt": "2020-04-25T12:43:33Z", "content": "Greek giants Olympiacos stand on the brink after reports emerged they that are to be relegated to the lower tiers and hit with hefty fines following historic match-fixing allegations.\r\nAccording to Corriere dello sport the club are on the precipice of free-fa… [+3825 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Freddie Keighley", "title": "Chelsea 'risk losing Christian Pulisic' if Philippe Coutinho transfer goes ahead - Mirror Online", "description": "The Blues are heavily linked with the out of favour Barcelona man - but signing the Brazilian could endanger the minutes of existing Stamford Bridge playmaker Pulisic", "url": "https://www.mirror.co.uk/sport/football/transfer-news/chelsea-risk-losing-christian-pulisic-21924734", "urlToImage": null, "publishedAt": "2020-04-25T12:39:18Z", "content": "Chelsea have been warned that signing Barcelona midfielder Philippe Coutinho could lead to Christian Pulisic leaving Stamford Bridge.\r\n Coutinho has struggled to settle at the Spanish giants since his £142m move from Liverpool in January 2018 and was sent out… [+1887 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ben Husband", "title": "'I'm an impatient man' - Aston Villa owners have this incredible plan for the club - Birmingham Live", "description": "The Aston Villa co-owner was speaking on the US network about his business ventures, when his two sport teams were mentioned", "url": "https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-owners-edens-sawiris-18128536", "urlToImage": null, "publishedAt": "2020-04-25T12:35:54Z", "content": "Wes Edens has outlined his plan for Aston Villa to become one of the biggest teams in the world - and when he hopes to achieve it by. \r\nEdens along with Nassef Sawiris, bought the club from Dr Tony Xia in the summer of 2018, helping Villa stave off the immine… [+2201 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Ian Doyle", "title": "Bobby Duncan, major setbacks and what happened next for Liverpool FA Youth Cup winners - Liverpool Echo", "description": "Exactly one year has passed since Liverpool lifted the FA Youth Cup against Manchester City", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/pep-lijnders-impressed-breakout-star-18143544", "urlToImage": null, "publishedAt": "2020-04-25T12:25:33Z", "content": "Champions League glory was more than a month away, but already Liverpool could celebrate claiming prestigious silverware.\r\nExactly a year has passed since the Reds claimed the FA Youth Cup for only the fourth time in their history.\r\nUnder the tutelage of coac… [+4773 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Jon Doel", "title": "Wales on brink of stunning world rugby and ditching Bill Beaumont amid late drama - reports - Wales Online", "description": "The race to become World Rugby chairman may be about to take a huge twist", "url": "https://www.walesonline.co.uk/sport/rugby/rugby-news/wales-brink-stunning-world-rugby-18149672", "urlToImage": null, "publishedAt": "2020-04-25T12:15:32Z", "content": "Wales could be the country to blow apart Bill Beaumont's hopes of winning the race to remain World Rugby chairman, according to reports.\r\nBeaumont has widely been expected to receive the backing of all Six Nations countries in his battle with Agustin Pichot, … [+1060 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Paul Gorst", "title": "Manchester United chief Ed Woodward sends warning and Liverpool's plans could change - Liverpool Echo", "description": "Manchester United chief Ed Woodward believes the transfer market might look a lot different", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpools-plans-could-change-manchester-18149564", "urlToImage": null, "publishedAt": "2020-04-25T12:07:25Z", "content": "It's been 44 days since a ball has been kicked across any of Europe's top leagues.\r\nBut despite the inactivity, the ongoing uncertainty and crippling financial impact because of the coronavirus pandemic, there is one element of the modern game that simply ref… [+3869 chars]"}, {"source": {"id": null, "name": "Autosport.com"}, "author": "Luke Smith", "title": "Brazil 2012: The race that could have changed an F1 nearly-man's career - Autosport", "description": "The 2012 Brazilian Grand Prix, which is being live-streamed by Formula 1 today, is upheld as one of F1's most dramatic title-deciders", "url": "https://www.autosport.com/f1/news/149147/the-race-that-could-have-changed-an-f1-nearlyman", "urlToImage": null, "publishedAt": "2020-04-25T11:33:15Z", "content": "The 2012 Brazilian Grand Prix, which is being live-streamed by Formula 1 today, is upheld as one of F1's most dramatic title-deciders. The fight for the victory was no less exciting, as yet another chance slipped through the fingers of an F1 nearly-man\r\nThe 2… [+9660 chars]"}, {"source": {"id": null, "name": "Chelseafc.com"}, "author": null, "title": "Coronavirus update: Chelsea statement on employees, tickets, men's first team and community help - Chelsea FC", "description": "The board of Chelsea Football Club would like to update our fans, our staff, our community and our other stakeholders of certain actions the club is taking during the coronavirus crisis.", "url": "https://www.chelseafc.com/en/news/2020/04/25/club-update-on-coronavirus-initiatives-for-staff--supporters-and", "urlToImage": null, "publishedAt": "2020-04-25T11:17:31Z", "content": "The board, guided by club owner Roman Abramovich, has agreed on a number of initiatives aimed at ensuring the financial well-being of our staff as well as supporting our fans and the wider community.Employees\r\nThe club can confirm we will not be taking advant… [+2981 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Tom Victor", "title": "Tottenham wanted to sign Atletico Madrid and Liverpool wingers but here's who they got instead - Football.London", "description": "Martin Jol’s team had some big names in mind in the summer of 2006 to take another run at the Champions League spots", "url": "https://www.football.london/tottenham-hotspur-fc/news/tottenham-transfer-news-petrov-kewell-18132075", "urlToImage": null, "publishedAt": "2020-04-25T11:08:02Z", "content": "Fans of every Premier League club will have stories of players they might have signed, and the transfer deals that went through when they missed out on primary targets, and Tottenham Hotspur supporters are no exception.\r\nSpurs have done some great business ov… [+4553 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Marcus Banks", "title": "Mike Phelan explains Manchester United formation changes - Manchester Evening News", "description": "Manchester United assistant manager Mike Phelan has discussed the systems used by Ole Gunnar Solskjaer this season.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/phelan-man-utd-tactics-news-18149742", "urlToImage": null, "publishedAt": "2020-04-25T10:55:14Z", "content": "Manchester United assistant manager Mike Phelan has revealed he is a fan of the 3-4-3 formation but believes that 4-3-3 is best suited to the current squad.\r\nOle Gunnar Solskjaerhas used a wide variety of formations over the course of the season - using a 3-5… [+1155 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Reubyn Coutinho", "title": "“If You Hit Him On The Side of His Head”- Dillian Whyte Reveals Anthony Joshua’s Weakness - Essentially Sports", "description": "WBC Interim Heavyweight Champion Dillian Whyte has reviewed Anthony Joshua's matchhes and revealed the Unified World Champion's vulnerability.", "url": "https://www.essentiallysports.com/boxing-news-if-you-hit-him-on-the-side-of-his-head-dillian-whyte-reveals-anthony-joshuas-weakness/", "urlToImage": null, "publishedAt": "2020-04-25T10:44:00Z", "content": "Heavyweight Boxer Dillian Whyte aired views on how the unified champion Anthony Joshua can be brought down. In a chat with Matchroom Boxing ‘The Villain’ revealed that he looked at several of AJ’s fights and came to the following conclusion.\r\nHe said, “Listen… [+1677 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Lucy Campbell", "title": "Coronavirus UK: test slots run out for second day running – latest updates - The Guardian", "description": "Questions over independence of Sage group come as UK death toll nears 20,000", "url": "https://www.theguardian.com/world/live/2020/apr/25/coronavirus-uk-calls-for-transparency-over-scientific-advice-to-ministers-latest-updates", "urlToImage": null, "publishedAt": "2020-04-25T10:41:00Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "UFC to stage three events in Florida in May - BBC News", "description": "UFC president Dan White announces UFC 249 for 9 May and two other events without fans next month.", "url": "https://www.bbc.co.uk/sport/mixed-martial-arts/52424303", "urlToImage": null, "publishedAt": "2020-04-25T10:17:54Z", "content": "Tony Ferguson will be in action at UFC 249 on 9 May at VyStar Veterans Memorial Arena in Jacksonville\r\nUFC president Dana White has announced plans for three events in Jacksonville, Florida, next month.\r\nThey will be closed to the public and \"produced with on… [+2003 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Ray Parlour slams Arsenal leadership in passionate defence of Mesut Ozil - Mirror Online", "description": "Ozil is one of three Arsenal players to reject pay cut proposals put forward by the board but Parlour believes the star has been unnecessarily made a scapegoat as a result", "url": "https://www.mirror.co.uk/sport/football/news/ray-parlour-slams-arsenal-leadership-21924954", "urlToImage": null, "publishedAt": "2020-04-25T10:15:52Z", "content": "Ray Parlour has leapt to the defence of Mesut Ozil and criticised the lack of leadership at Arsenal amid the recent disagreement regarding player pay cuts. \r\n Ozil is one of three Arsenal stars to decide against taking a deduction in their salary despite the … [+2410 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Shane Ireland", "title": "Pundit Stan Collymore sends Premier League a relegation message involving West Brom and Leeds United - Birmingham Live", "description": "West Brom news includes Collymore on why promotion and relegation should operate as normal even if the campaign isn't finished in full", "url": "https://www.birminghammail.co.uk/sport/football/football-news/stan-collymore-west-brom-leeds-18122947", "urlToImage": null, "publishedAt": "2020-04-25T10:04:50Z", "content": "Stan Collymore believes clubs must still be promoted and relegated as normal - even if the full 38-game Premier League season isn't completed.\r\nWest Bromwich Albion sit comfortably in second place in the Championship, requiring one final push to realise their… [+3128 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Joseph Chapman", "title": "Wolves agree on Liverpool transfer ahead of summer window - reports - Birmingham Live", "description": "Wolves transfer news - Liverpool goalkeeper Loris Karius has been linked with a move to Molineux in the next transfer window", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/wolves-transfers-karius-liverpool-klopp-18130415", "urlToImage": null, "publishedAt": "2020-04-25T10:04:48Z", "content": "The latest rumour in the bizarre transfer triangle that is developing involving Wolves has linked them with Liverpool goalkeeper Loris Karius.\r\n In the last week or so, Wolves have been regularly mentioned in the same sentence as Besiktas, when their goalkeep… [+2317 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Joe Rimmer", "title": "Luis Alberto masterstroke could make Liverpool millions this summer - Liverpool Echo", "description": "Luis Alberto's Liverpool departure may have gone under the radar - but a clause could result in Liverpool making millions", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-luis-alberto-transfer-clause-17881222", "urlToImage": null, "publishedAt": "2020-04-25T10:03:36Z", "content": "Michael Edwards doesn't do interviews. The Liverpool sporting director just doesn't want the headlines.\r\nNor does Edwards appear publicly, and anyone searching for a picture of him will only find a select few.\r\nYou won't find much about him on the club site, … [+3728 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "BLACKBURN 0-1 MAN CITY HIGHLIGHTS | DZEKO'S FIRST CITY GOAL | ON THIS DAY 25th April 2011 - Man City", "description": "Extended highlights of the game in 2011 that saw Dzeko bag his first goal for Manchester City as we continued to push for a Champions League qualifying posit...", "url": "https://www.youtube.com/watch?v=fpo5T5s_3jI", "urlToImage": null, "publishedAt": "2020-04-25T10:00:08Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Joel Golby", "title": "‘Children in football kits start kicking me up the bum’: my life as a mascot - The Guardian", "description": "Remember football – the crowds, the noise, the goofy beaver dancing on the touchline? Welcome to the weird world of the matchday mascot", "url": "https://www.theguardian.com/sport/2020/apr/25/children-in-football-kits-start-kicking-me-up-the-bum-my-life-as-a-mascot", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": "There is no force in the universe more irresistible than a high five from Reading FCs lion mascot, Kingsley. The only thing that comes close is a hug from Kingsleys mascot wife, Queensley. Do not ask why a mascot needs a mascot wife, because I cannot explain … [+12086 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "REPLAYED: West Ham 0-2 Liverpool | Ox & Salah make it 19 points at the London Stadium - Liverpool FC", "description": "Relive the Reds' victory at the London Stadium, as Alex Oxlade-Chamberlain's well-taken goal was added to by a Mo Salah penalty to stretch LFC's lead at the ...", "url": "https://www.youtube.com/watch?v=knNR4bd5Dd8", "urlToImage": null, "publishedAt": "2020-04-25T09:57:14Z", "content": "Relive the Reds' victory at the London Stadium, as Alex Oxlade-Chamberlain's well-taken goal was added to by a Mo Salah penalty to stretch LFC's lead at the top of the Premier League.\r\nEnjoy more content and get exclusive perks in our Liverpool FC Members Are… [+197 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Aubameyang discussing Arsenal exit amid Chelsea & Man Utd links - Metro.co.uk", "description": "Will he leave?", "url": "https://metro.co.uk/2020/04/25/pierre-emerick-aubameyang-talking-inter-milan-12608142/", "urlToImage": null, "publishedAt": "2020-04-25T09:53:04Z", "content": "Aubameyang is tipped to leave Arsenal (Picture: Getty)\r\nPierre-Emerick Aubameyang has reportedly discussed leaving Arsenal with Inter Milan players as the Serie A side looks to beat Manchester United and Chelsea to his signature.\r\nArsenal are ready to listen … [+1692 chars]"}, {"source": {"id": null, "name": "Football365.com"}, "author": "Seb Stafford Bloor", "title": "Tanguy Ndombele is Tottenham's Taarabt MkII - only worse - Football365.com", "description": "Football365 - If Barcelona want Tanguy Ndombele after these troublesome months, how will he still be compelled to perform for Tottenham?", "url": "https://www.football365.com/news/tanguy-ndombele-adel-taarabt-spurs-jose-mourinho", "urlToImage": null, "publishedAt": "2020-04-25T09:48:16Z", "content": "Tanguy Ndombele might face a terminal situation at Tottenham. Not because his levels of performance or fitness haven’t been anything close to adequate, or even because his relationship with Jose Mourinho already appears so sour and adversarial. Instead, it’s … [+5210 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Olivier Giroud: Chelsea intend to take up option to extend striker's contract - Sky Sports", "description": "Chelsea intend to take up their option to extend Olivier Giroud's contract by a year to prevent him becoming a free agent in the summer.", "url": "https://www.skysports.com/football/news/11668/11978581/olivier-giroud-chelsea-intend-to-take-up-option-to-extend-strikers-contract", "urlToImage": null, "publishedAt": "2020-04-25T09:45:31Z", "content": "Chelsea intend to take up their option to extend Olivier Giroud's contract by a year to prevent him becoming a free agent in the summer.\r\nThe 33-year-old's deal is due to expire on June 30, but, by extending it, Chelsea will be able to ask for a transfer fee … [+542 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "ePL Invitational: Trent Alexander-Arnold's competitive juices flowing ahead of Raheem Sterling showdown - Sky Sports", "description": "Trent Alexander-Arnold's competitive juices are flowing ahead of an ePL Finals Day showdown with Raheem Sterling, who says: \"Trent will not beat me.\"", "url": "https://www.skysports.com/more-sports/football/news/33554/11978221/epl-invitational-trent-alexander-arnolds-competitive-juices-flowing-ahead-of-raheem-sterling-showdown", "urlToImage": null, "publishedAt": "2020-04-25T09:45:20Z", "content": "Trent Alexander-Arnold's competitive juices are flowing ahead of the ePL Finals Day showdown with Raheem Sterling, who says: \"Trent will not beat me.\"\r\nThose looking for a football fix should be pointed in the direction of the ePL Invitational on Saturday as … [+3099 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Tom Kershaw", "title": "Newcastle supporters 97% in favour of takeover despite concerns over Saudi Arabia’s human rights record - The Independent", "description": "Alex Hurst, Trust chair, said: ‘This survey shows that the appetite for change at Newcastle United is enormous’", "url": "https://www.independent.co.uk/sport/football/premier-league/newcastle-takeover-supporters-premier-league-saudi-arabia-a9483621.html", "urlToImage": null, "publishedAt": "2020-04-25T09:41:22Z", "content": "A Newcastle United Supporters Trust survey of over 3,000 fans found that 96.7% of fans are in favour of the clubs controversial takeover.\r\nA consortium led by Amanda Staveley and backed by the Saudi Arabian sovereign wealth fund are on the verge of completing… [+3059 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Tyson Fury's remarkable return surprised Eddie Hearn who regrets not signing the WBC champion - Sky Sports", "description": "Promoter Eddie Hearn has revealed his regret about not signing Tyson Fury, a few months before the world heavyweight champion started his remarkable return.", "url": "https://www.skysports.com/boxing/news/12040/11978281/tyson-furys-remarkable-return-surprised-eddie-hearn-who-regrets-not-signing-the-wbc-champion", "urlToImage": null, "publishedAt": "2020-04-25T09:38:47Z", "content": "Promoter Eddie Hearn has revealed his regret about not signing Tyson Fury, a few months before the world heavyweight champion started his remarkable return.\r\nFury completed a sensational resurgence by defeating Deontay Wilder to claim the WBC title in Februar… [+1962 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Marcus Banks", "title": "Manchester United fans cannot believe new Angel Di Maria transfer rumour - Manchester Evening News", "description": "Angel Di Maria signed for United in 2014 but left in 2015 to join Paris Saint-Germain.", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/pogba-di-maria-man-utd-18149406", "urlToImage": null, "publishedAt": "2020-04-25T09:24:29Z", "content": "Speculation over the future of Manchester United midfielder Paul Pogba refuses to die down.\r\nThe World Cup winner continues to be heavily linked with an exit, with Real Madrid, Juventus and Paris Saint-Germain believed to be interested in acquiring his servic… [+1449 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Dave Fraser", "title": "Mike Tyson vs Tyson Fury, Anthony Joshua and Deontay Wilder: How boxing legend thinks he’d fare against t - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/boxing/11464196/mike-tyson-vs-fury-anthony-joshua-deontay-wilder/", "urlToImage": null, "publishedAt": "2020-04-25T09:19:43Z", "content": "WITH 44 KOs across 50 wins in his career, it's fair to say Mike Tyson will forever be known as one of boxing's greatest heavyweights ever.\r\nFans forever argue as to who would win in their prime: Iron Mike or Muhammad Ali.\r\n Mike Tyson has revealed how he thin… [+4372 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Lewis Winter", "title": "Man Utd legend Roy Keane sends Man City and Liverpool warning to Ole Gunnar Solskjaer - Express", "description": "Manchester United still have a lot to do to catch Manchester City and Liverpool according to Roy Keane.", "url": "https://www.express.co.uk/sport/football/1273735/Man-Utd-news-Roy-Keane-Man-City-Liverpool-warning-Ole-Gunnar-Solskjaer", "urlToImage": null, "publishedAt": "2020-04-25T09:17:05Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "London Marathon: Delayed race could feature elite athletes only - BBC News", "description": "This year's postponed London Marathon could be staged with elite athletes only, says race director Hugh Brasher.", "url": "https://www.bbc.co.uk/sport/athletics/52423940", "urlToImage": null, "publishedAt": "2020-04-25T09:14:00Z", "content": "Kenyan world record holders Kipchoge and Brigid Kosgei are due to defend their titles at the 40th London Marathon\r\nThis year's postponed London Marathon could be staged with elite athletes only, says race director Hugh Brasher.\r\nBrasher said that was one of 1… [+1098 chars]"}, {"source": {"id": null, "name": "Autosport.com"}, "author": "Jonathan Noble", "title": "F1 News: Ferrari's Vettel set to join rivals in Esports competitions - Autosport", "description": "Ferrari driver Sebastian Vettel says he will join many of his Formula 1 rivals and start sim racing soon, after recently taking delivery of his own rig", "url": "https://www.autosport.com/f1/news/149143/vettel-set-to-join-rivals-in-esports-competitions", "urlToImage": null, "publishedAt": "2020-04-25T09:10:40Z", "content": "Ferrari driver Sebastian Vettel says he will join many of his Formula 1 rivals and start sim racing soon, after recently taking delivery of his own rig.\r\nThe four-time world champion has so far steered clear of joining in with the recent rush to take part in … [+1695 chars]"}, {"source": {"id": null, "name": "Hitc.com"}, "author": "Shane Callaghan", "title": "Newcastle reportedly want manager who blows Poch out of the water - HITC - Football, Gaming, Movies, TV, Music", "description": "Massimiliano Allegri has been linked with a move to Newcastle United.", "url": "https://www.hitc.com/en-gb/2020/04/25/newcastle-reportedly-get-sign-manager-who-blows-poch-out-of-the/", "urlToImage": null, "publishedAt": "2020-04-25T08:43:22Z", "content": "Massimiliano Allegri has been linked with a move to Newcastle United.\r\nNewcastle United fans are in dreamland at the moment.\r\nNot only does the villainous Mike Ashley have one foot out the door in the North-East, but they're being linked to some unbelievable … [+1339 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "West Indies 'flexible' on new Test dates against England - Sky Sports", "description": "Cricket West Indies says it is \"flexible\" about rearranging a Test tour of England but the governing body insists it will not jeopardise the safety of players.", "url": "https://www.skysports.com/cricket/news/12123/11978552/west-indies-flexible-on-new-test-dates-against-england", "urlToImage": null, "publishedAt": "2020-04-25T08:42:39Z", "content": "Cricket West Indies says it is \"flexible\" about rearranging a Test tour of England but the governing body insists it will not jeopardise the safety of players in order to complete the three-match series.\r\nIn a series that counts towards the World Test Champio… [+2902 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "george harrison", "title": "Inside Mike Tyson’s £890k abandoned mansion that had tiger cages and basketball court before being converted i - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/1285850/mike-tyson-mansion-house-tiger-king-cage-church/", "urlToImage": null, "publishedAt": "2020-04-25T08:31:50Z", "content": "THIS is the spectacular mansion Mike Tyson abandoned during his rapid fall from grace.\r\nThe former professional boxer - who was convicted of rape in 1992 - had no choice but to sell this palatial property as financial ruin loomed, and the imposing Ohio mansio… [+2954 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Bezants for MailOnline", "title": "20 years ago, Pep Guardiola and Jose Mourinho were friends at Barcelona - Daily Mail", "description": "It's a picture that shows a different time and frankly, one that  people nowadays might find hard to imagine; Pep Guardiola and Jose Mourinho, sat side-by-side as friends, wearing crests of the same club.", "url": "https://www.dailymail.co.uk/sport/football/article-8095753/20-years-ago-Pep-Guardiola-Jose-Mourinho-friends-Barcelona.html", "urlToImage": null, "publishedAt": "2020-04-25T08:08:58Z", "content": "It's a picture that shows a different time and frankly, one that people nowadays might find hard to imagine; Pep Guardiola and Jose Mourinho, sat side-by-side as friends, wearing crests of the same club.\r\nIt was April 16, 2000, that such a snap was taken, 20 … [+6834 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "EXCLUSIVE: Harvey Elliott and Pep Lijnders | \"Klopp is every player's dream to play under\" - Liverpool FC", "description": "Liverpool's Assistant Manager, Pepijn Lijnders talks exclusively to teenage forward Harvey Elliott about finding his place in the squad, always being first i...", "url": "https://www.youtube.com/watch?v=oPrfsrtXT7k", "urlToImage": null, "publishedAt": "2020-04-25T08:00:20Z", "content": "Liverpool's Assistant Manager, Pepijn Lijnders talks exclusively to teenage forward Harvey Elliott about finding his place in the squad, always being first in the dreaded rondos, Harvey's idols and his goals for the future.\r\nEnjoy more content and get exclusi… [+237 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "When Yuvraj smashed Broad for six sixes in a row - BBC News", "description": "Relive the moment when Yuvraj Singh became the first player in Twenty20 history to hit six sixes in an over.", "url": "https://www.bbc.co.uk/sport/av/cricket/52397653", "urlToImage": null, "publishedAt": "2020-04-25T07:57:37Z", "content": null}, {"source": {"id": null, "name": "Tbrfootball.com"}, "author": "Giuseppe Labellarte", "title": "Scott Brown raves about ‘phenomenal’ Celtic man who was previously slated - TBR - The Boot Room - Football News", "description": "Celtic captain Scott Brown has hailed Hoops manager Neil Lennon, describing him as “phenomenal” for his work since returning to Parkhead. Last season, Lennon returned to Celtic following Brendan Rodgers’ mid-season exit, and his arrival was met with a mixed r…", "url": "https://tbrfootball.com/scott-brown-raves-about-phenomenal-celtic-man-who-previously-came-under-heavy-criticism/", "urlToImage": null, "publishedAt": "2020-04-25T07:31:28Z", "content": "Celtic captain Scott Brown has hailed Hoops manager Neil Lennon, describing him as phenomenal for his work since returning to Parkhead.\r\nLast season, Lennon returned to Celtic following Brendan Rodgers mid-season exit, and his arrival was met with a mixed rea… [+1556 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "NFL Draft: Tee Higgins joins Joe Burrow at Cincinnati Bengals - Sky Sports", "description": "The Cincinnati Bengals followed up their first-round pick of Joe Burrow by selecting Tee Higgins, who has declared the duo are \"about to tear it up\".", "url": "https://www.skysports.com/nfl/news/12118/11978531/nfl-draft-tee-higgins-joins-joe-burrow-at-cincinnati-bengals", "urlToImage": null, "publishedAt": "2020-04-25T07:29:15Z", "content": "The Cincinnati Bengals followed up their first-round pick of quarterback Joe Burrow by selecting wide receiver Tee Higgins, who has declared the duo are \"about to tear it up\" in the NFL.\r\nThe Bengals picked Clemson's Higgins - who grew up supporting the side … [+1441 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Gary Ralston", "title": "Robby McCrorie on West Ham's transfer radar as Rangers keeper attracts Premier League interest - Daily Record", "description": "David Moyes has been impressed by the keeper's form on-loan at Livingston.", "url": "https://www.dailyrecord.co.uk/sport/football/football-transfer-news/robbie-mccrorie-west-hams-transfer-21923361", "urlToImage": null, "publishedAt": "2020-04-25T07:14:29Z", "content": "West Ham are on the trail of Rangers keeper Robby McCrorie.\r\nThe Hammers have been impressed by the form of the Scotland under-21 starlet and see him as a long term successor to Lukasz Fabianski.\r\nMcCrorie, 22, is currently on loan at Livingston after spendin… [+1022 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Alexis Sanchez facing uncertain future as 'neither Man Utd or Inter want him' - Mirror Online", "description": "Manchester United will struggle to find a club prepared to match forward's mammoth wages in the wake of the coronavirus pandemic, and costly flop may have to train with youngsters", "url": "https://www.mirror.co.uk/sport/football/transfer-news/alexis-sanchez-facing-uncertain-future-21924263", "urlToImage": null, "publishedAt": "2020-04-25T05:17:11Z", "content": "Alexis Sanchez is facing an uncertain future as neither Manchester United or Inter Milan want him, according to reports. \r\nSanchez has spent the season on loan at Inter, but has failed to impress in Italy after becoming one of the costliest transfer flops in … [+2311 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ashley Preece", "title": "Aston Villa linked with shock move for Liverpool transfer flop - Birmingham Live", "description": "Aston Villa transfer gossip - The former Sunderland striker joined Hellas Verona from AC Milan in January - but his contract is set to expire sparking interest from Villa and Crystal Palace", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/aston-villa-liverpool-crystal-palace-18148709", "urlToImage": null, "publishedAt": "2020-04-25T05:03:00Z", "content": "Aston Villa are eyeing a surprising move for Liverpool flop Fabio Borini, an Italian newspaper has claimed.\r\n The 29-year-old is, according to L'Arena, being monitored by Villa and Crystal Palace ahead of a free transfer in the summer. \r\nReports suggest Villa… [+1295 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Guardian sport", "title": "Philadelphia Eagles surprise with Jalen Hurts pick on day two of NFL draft - The Guardian", "description": "The Eagles selected Oklahoma quarterback Jalen Hurts in the second round of the NFL draft on Friday, a stunning move for a team with more pressing needs", "url": "https://www.theguardian.com/sport/2020/apr/25/nfl-draft-picks-day-two-jalen-hurts", "urlToImage": null, "publishedAt": "2020-04-25T04:20:00Z", "content": "After giving Carson Wentz a playmaker, the Philadelphia Eagles drafted his backup.\r\nThe Eagles selected Oklahoma quarterback Jalen Hurts in the second round of the NFL draft on Friday night, a stunning move for a team with more pressing needs.\r\nPhiladelphia h… [+10018 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Daniel Blackham", "title": "Chelsea turned down chance to sign Arrizabalaga replacement despite Lampard's wishes - Express", "description": "Chelsea's board don't want to sell Kepa Arrizabalaga, despite Frank Lampard's feelings towards the Spaniard.", "url": "https://www.express.co.uk/sport/football/1273677/Chelsea-Frank-Lampard-Kepa-Arrizabalaga-transfer", "urlToImage": null, "publishedAt": "2020-04-25T04:01:38Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Dani Ceballos shares Zinedine Zidane message on future amid Arsenal transfer talk - Mirror Online", "description": "Arsenal are believed to be keen on signing Real Madrid midfielder permanently following loan spell, but Ceballos has revealed Zidane conversation which could decide his future", "url": "https://www.mirror.co.uk/sport/football/transfer-news/dani-ceballos-shares-zinedine-zidane-21924432", "urlToImage": null, "publishedAt": "2020-04-25T03:08:04Z", "content": "Dani Ceballos has shared a message from Zinedine Zidane about his Real Madrid future amid speculation Arsenal will bid to sign him permanently. \r\nCeballos has spent the season on loan with the Gunners from Madrid, and Arsenal are believed to be keen on signin… [+1801 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Sean Dyche explains why he had to apologise to Arsene Wenger after Arsenal clash - Mirror Online", "description": "Burnley manager said he gave former Gunners boss Wenger a 'rubbish' claret following a game at Turf Moor, as he opened up on his own taste in wine", "url": "https://www.mirror.co.uk/sport/football/news/sean-dyche-explains-apologise-arsene-21924463", "urlToImage": null, "publishedAt": "2020-04-25T01:48:30Z", "content": "Burnley manager Sean Dyche has revealed he had to apologise to former Arsenal boss Arsene Wenger - for giving him a \"rubbish\" red wine after a game. \r\nDyche, who admits he is \"certainly not an aficionado\" of fine wines, says all rival managers are offered the… [+2225 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Norwich City defend furlough decision and could lose up to £35m - BBC Sport", "description": "Norwich City will \"stick to their guns\" on a decision to furlough non-playing staff and expect to lose up to £35m.", "url": "https://www.bbc.co.uk/sport/football/52409583", "urlToImage": null, "publishedAt": "2020-04-25T01:41:53Z", "content": "Norwich's last game before the suspension of English football was a 1-0 loss at Sheffield United on 7 March\r\nNorwich City will \"stick to their guns\" on a decision to furlough non-playing staff, with the club expected to lose up to £35m because of coronavirus.… [+2176 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "All eyes on Germany & no non-league matches until 2021? What next for football? - BBC Sport", "description": "As Uefa attempts to offer some clarity about what next for football, BBC Sport's Simon Stone takes a look at some of the big questions that remain.", "url": "https://www.bbc.co.uk/sport/football/52413053", "urlToImage": null, "publishedAt": "2020-04-25T01:37:50Z", "content": "Liverpool are the current European champions after beating Tottenham in last season's Champions League final\r\nAt the end of a busy week of meetings and discussions, European football's governing body, Uefa, offered some clarity over how they hope the game wil… [+7026 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Justin Allen", "title": "Bury hope FA put them in National League next season with chairman Dale willing to step down - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11474335/bury-national-league-steve-dale/", "urlToImage": null, "publishedAt": "2020-04-24T23:53:22Z", "content": "BURY owner Steve Dale has amazingly revealed he is waiting fortheFA to put his club into the National League for next season.\r\nAnd Dale would be prepared to step down as chairman of the expelled EFL outfit to make it happen.\r\n Steve Dale hopes Bury are placed… [+2817 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Matt Davies", "title": "PDC Darts Home Tour 2020 results LIVE: Stream, latest scores on Day 8, watch free online and TV channel - Evening Standard", "description": "", "url": "https://www.standard.co.uk/sport/darts-pdc-home-tour-2020-live-stream-results-day-8-latest-scores-watch-free-tv-a4423691.html", "urlToImage": null, "publishedAt": "2020-04-24T21:44:58Z", "content": "Welcome to Day 8 of our PDCdarts Home Tour LIVE coverage.\r\nOn Friday night, world number 15 Jonny Clayton progressed to the next round with a perfect record of three straight victories.\r\nIt was a close encounter, however, the group undecided until the final g… [+7879 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Alex Raskin Sports News Editor For Dailymail.com Associated Press", "title": "Video shows Bucs rookie and Tom Brady's newest blocker Tristan Wirfs jumping out of pool - Daily Mail", "description": "Tampa Bay Buccaneers first-round pick Tristan Wirfs weighs well over 300 pounds, but the offensive tackle and Tom Brady's newest blocker is still athletic enough to jump out of a pool onto his feet.", "url": "https://www.dailymail.co.uk/news/article-8254551/Video-shows-Bucs-rookie-Tom-Bradys-newest-blocker-Tristan-Wirfs-jumping-pool.html", "urlToImage": null, "publishedAt": "2020-04-24T20:51:27Z", "content": "The Buccaneers drafted Tristan Wirfs to address an opening at right tackle \r\nTampa Bay Buccaneers first-round pick Tristan Wirfs weighs well over 300 pounds, but the offensive tackle and Tom Brady's newest blocker is still athletic enough to launch himself ou… [+3438 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Elliott Jackson", "title": "What Jurgen Klopp said to Liverpool before historic Barcelona comeback - Liverpool Echo", "description": "The Reds beat Barcelona 4-0 to reach the Champions League final", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/klopp-liverpool-talk-barcelona-comeback-18148913", "urlToImage": null, "publishedAt": "2020-04-24T20:35:00Z", "content": "James Milner has revealed what Jurgen Klopp said to his players in training before their unforgettable comeback against Barcelona in the Champions League. \r\nThe Reds remarkably beat the Spanish giants 4-0 at Anfield in the second leg of their Championship Lea… [+1744 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Is Jamie Carragher RIGHT?! Fernando Torres' flabbergasting move from Liverpool to Chelsea | ESPN FC - ESPN UK", "description": "Craig Burley and Julien Laurens join Dan Thomas on ESPN FC to react to recent comments made by former Liverpool defender Jamie Carragher and former Chelsea c...", "url": "https://www.youtube.com/watch?v=hoRBD5aVqVk", "urlToImage": null, "publishedAt": "2020-04-24T19:51:55Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Paul MacInnes, Sid Lowe", "title": "Eredivisie cancels season without any champion, relegation and promotion - The Guardian", "description": "The Dutch Eredivisie has become the first major European football league to cancel its season although it will retain its European qualification", "url": "https://www.theguardian.com/football/2020/apr/24/eredivisie-cancels-season-without-any-champion-relegation-and-promotion", "urlToImage": null, "publishedAt": "2020-04-24T19:35:56Z", "content": "The Dutch Eredivisie has become the first major European football league to cancel its season in response to the coronavirus crisis. For the first time since 1944-45, the Dutch top flight will not have a champion and there will be no relegation or promotion e… [+3614 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Suzanne Wrack", "title": "Who could replace Phil Neville as England Women's manager? - The Guardian", "description": "We run the rule over leading candidates, including a two-times World Cup winner and a woman who worked as Neville’s No 2", "url": "https://www.theguardian.com/football/2020/apr/24/who-could-replace-phil-neville-as-england-womens-manager", "urlToImage": null, "publishedAt": "2020-04-24T18:00:00Z", "content": "The Football Associations hunt for a successor to Mark Sampson in 2017 quickly became a circus. Names flew out of the ring as fast as they stepped in. Increased scrutiny on the person in charge, with the game professionalising, led some of those on the shortl… [+4734 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Jamie Carragher confirms wife tested positive for coronavirus in second family diagnosis - Mirror Online", "description": "Former Liverpool defender Carragher made the announcement when discussing how the football season in the UK can be resumed safely amid the current pandemic", "url": "https://www.mirror.co.uk/sport/football/news/jamie-carragher-confirms-wife-coronavirus-21921317", "urlToImage": null, "publishedAt": "2020-04-24T17:42:56Z", "content": "Jamie Carragher has revealed his wife Nicola has tested positive for coronavirus, becoming the second person in his family to contract the illness. \r\n The former Liverpool defender turned Sky Sports pundit also explained that his aunt had been receiving treat… [+2284 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Matthew Southcombe", "title": "Marler won't miss a game despite long ban for grabbing Alun Wyn Jones' genitals - Wales Online", "description": "The England prop was banned for 10 weeks after grabbing the Wales skipper's penis, but will be free to play as soon as rugby recommences", "url": "https://www.walesonline.co.uk/sport/rugby/rugby-news/joe-marler-wont-miss-game-18148172", "urlToImage": null, "publishedAt": "2020-04-24T17:41:14Z", "content": "England prop Joe Marler will not miss a single game of rugby despite grabbing Alun Wyn Jones' genitals in a Six Nations match last month, according to reports. \r\nMarler received a 10-week ban after he was found guilty of 'grabbing, twisting or squeezing' the … [+1782 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Green Bay Packers' Aaron Rodgers within rights to be annoyed by Jordan Love pick, says Neil Reynolds - Sky Sports", "description": "Neil Reynolds and Jeff Reinebold analyse the Green Bay Packers' shock selection of Utah State quarterback Jordan Love.", "url": "https://www.skysports.com/nfl/news/12118/11978237/green-bay-packers-aaron-rodgers-within-rights-to-be-annoyed-by-jordan-love-pick-says-neil-reynolds", "urlToImage": null, "publishedAt": "2020-04-24T17:15:29Z", "content": "Aaron Rodgers is the same age as Brett Favre was when he was selected as his eventual successor by the Green Bay Packers with the No 24 pick at the 2005 NFL Draft.\r\nThat nugget became relevant with pick No 26 on day one of the 2020 Draft as the Packers produc… [+2899 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Elliott Jackson", "title": "Ajax star Hakim Ziyech handed major blow ahead of Chelsea transfer - Football.London", "description": "The Moroccan playmaker won't be leaving Amsterdam with another league title", "url": "https://www.football.london/chelsea-fc/news/hakim-ziyech-dutch-football-chelsea-18147795", "urlToImage": null, "publishedAt": "2020-04-24T17:02:06Z", "content": "Hakim Ziyech has been handed a blow after Ajax were denied the 2019/20 Eredivisie title ahead of his move to Chelsea.\r\nThe Moroccan will move to Stamford Bridge at the end of the season after a deal between the two clubs was agreed earlier this year.\r\nHowever… [+955 chars]"}, {"source": {"id": null, "name": "Derbytelegraph.co.uk"}, "author": "Chris Watson", "title": "Derby County favourite has contract terminated by Championship club - Derbyshire Live", "description": "The former Rams midfielder and coach had been part of Graeme Jones' backroom staff at Luton Town", "url": "https://www.derbytelegraph.co.uk/sport/football/football-news/inigo-idiakez-derby-luton-harford-4076842", "urlToImage": null, "publishedAt": "2020-04-24T15:19:00Z", "content": "Derby County favourite Inigo Idiakez has lost his job at Sky Bet Championship club Luton Town.\r\nIdiakez had been first-team coach at Kenilworth Road but has had his contract terminated with immediate effect, along with manager Graeme Jones, assistant boss Gar… [+2928 chars]"}, {"source": {"id": null, "name": "Football365.com"}, "author": "Joe Williams", "title": "Neville predicts 'absolute carnage' unless the Premier League act - Football365.com", "description": "Football365 - \"The future revenues are into the 10s of billions in the Premier League.\"", "url": "https://www.football365.com/news/gary-neville-predicts-absolute-carnage-unless-the-premier-league-act", "urlToImage": null, "publishedAt": "2020-04-24T13:58:20Z", "content": "The Premier League should borrow against future television earnings to safeguard English football’s financial survival amid the coronavirus pandemic, according to former Manchester United defender Gary Neville.\r\nThe Sky Sports pundit believes the league and i… [+2621 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Rohan Janse van Rensburg: Sale player sanctioned for signing deals with two clubs - BBC Sport", "description": "Rohan Janse van Rensburg is fined and given a two-week ban for signing contracts with both Sale and Gloucester.", "url": "https://www.bbc.co.uk/sport/rugby-union/52413671", "urlToImage": null, "publishedAt": "2020-04-24T11:56:57Z", "content": "Rohan Janse van Rensburg played for South African side Lions before moving to the English Premiership\r\nCentre Rohan Janse van Rensburg has been fined £32,500 and handed a two-week ban for signing contracts with Premiership clubs Sale and Gloucester.\r\nVan Rens… [+1582 chars]"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Ryan Sidle", "title": "Jelle Klaasen Accused Of Cheating During PDC Home Tour Match - SPORTbible", "description": "The Dutchman went through after topping the group by one leg but fans were quick to point out that his leg finishing double was dodgy.", "url": "https://www.sportbible.com/other/foul-play-jelle-klaasen-appears-to-cheat-during-pdc-home-tour-match-20200424", "urlToImage": null, "publishedAt": "2020-04-24T10:09:21Z", "content": "Former BDO World Champion Jelle Klaasen qualified top from his PDC Home Tour group on Thursday night but was accused of cheating after claiming a double he seemingly missed.\r\nYou've probably wondered at least some point during lockdown if your colleague has c… [+1856 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Robert Warlow", "title": "Crystal Palace receive financial boost ahead of the summer as Eagles ace makes Arsenal admission - Football.London", "description": "Crystal Palace are set to receive a slice of money released by UEFA to help clubs across Europe during the current financial crisis caused by the coronavirus pandemic", "url": "https://www.football.london/crystal-palace-fc/news/crystal-palace-receive-financial-boost-18140151", "urlToImage": null, "publishedAt": "2020-04-24T09:35:56Z", "content": "Crystal Palace and other Premier League clubs are still awaiting news over the return of top flight football.\r\nThe Premier League and all other professional football leagues in England are currently suspended indefinitely, with no games taking place in the to… [+3358 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Mark Wakefield", "title": "Adama Traore agent makes transfer admission amid Liverpool links - Liverpool Echo", "description": "Jurgen Klopp's Liverpool have been linked with a summer move for Adama Traore and his agent has spoken out", "url": "https://www.liverpoolecho.co.uk/sport/football/transfer-news/adama-traore-agent-makes-transfer-18142069", "urlToImage": null, "publishedAt": "2020-04-24T08:36:04Z", "content": "Adama Traore's agent has addressed the future of his client and indicated he still believes there could be a \"market\" for him this summer.\r\n Liverpool and other top teams have been tentatively linked with a move for the Wolverhampton Wanderers winger, with Fo… [+1717 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "John Cross", "title": "Eric Dier facing lengthy ban after being hit with FA charge over fan confrontation - Mirror Online", "description": "Eric Dier has been charged by the FA after he clashed with a fan in the aftermath of Tottenham's FA Cup defeat to Norwich", "url": "https://www.mirror.co.uk/sport/football/news/eric-dier-facing-lengthy-ban-21916800", "urlToImage": null, "publishedAt": "2020-04-24T07:03:13Z", "content": "Eric Dier is facing a lengthy ban after being hit with an FA misconduct charge.\r\nTottenham midfielder Dier climbed into the stand to confront a fan who was having a row with his brother after their FA Cup exit to Norwich last month. \r\nDier has until May 8 to … [+1927 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "John Cross", "title": "Premier League clubs worried overseas players will not get back to restart season - Mirror Online", "description": "JOHN CROSS COLUMN: Players and clubs are going above and beyond during the coronavirus lockdown - including Brighton plus Liverpool star Ben Woodburn", "url": "https://www.mirror.co.uk/sport/football/news/premier-league-clubs-worried-overseas-21916210", "urlToImage": null, "publishedAt": "2020-04-24T00:53:07Z", "content": "Premier League clubs are concerned some of their overseas players will not be able to get back to restart games.\r\nMany foreign stars fled England to get home before lockdowns were imposed - but could be stuck there with the Premier League hoping that training… [+4501 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Mark McDougall", "title": "Joey Barton blasts Rangers captain James Tavernier over his defending and hair obsession - Daily Record", "description": "The controversial Ibrox flop didn't hold back as he hit out at Tavernier for his defending skills and his lack of preparation for big games.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/joey-barton-blasts-rangers-captain-21916970", "urlToImage": null, "publishedAt": "2020-04-23T21:58:11Z", "content": "Rangers flop Joey Barton has lifted the lid on his controversial spell at Ibrox and blasted skipper James Tavernier for caring more about his hair than football.\r\nBarton has rarely spoken about his time in Glasgow prior to this but opened up in an explosive i… [+1965 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Lee Ryder", "title": "American consortium chief reveals he 'dodged bullet' after talks with Mike Ashley to buy Newcastle United - Chronicle Live", "description": "The New York-born figurehead was eager to take on the job of transforming Newcastle United", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/american-consortium-chief-reveals-dodged-18140537", "urlToImage": null, "publishedAt": "2020-04-23T21:07:57Z", "content": "GACP Sports Capital chairman Joseph DaGrosa has revealed he \"dodged a bullet\" when not buying Newcastle United from Mike Ashley.\r\nThe chairman and CEO of Great American Capital Partners, who sold a stake in Ligue 1 side Bordeaux, held discussions with Justin … [+1193 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Andy Brassell", "title": "Bundesliga return in May now looks inevitable but fans are far from happy - The Guardian", "description": "Games could resume next month with just over 300 people in the ground and strict safety measures in place", "url": "https://www.theguardian.com/football/2020/apr/23/bundesliga-return-in-may-now-looks-inevitable-but-fans-are-far-from-happy", "urlToImage": null, "publishedAt": "2020-04-23T19:18:00Z", "content": "The historic is about to become the everyday in Germany. As it stands, the derby between Borussia Mönchengladbach and Cologne the last Bundesliga match played before the shutdown is the only Geisterspiel (ghost game, without fans) ever to have taken place in … [+5994 chars]"}]}