{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Theguardian.com"}, "author": "Paul Wilson", "title": "Premier League completion 'probably not realistic', says Dutch FA president - The Guardian", "description": "The KNVB president, who presided over the Dutch season being declared null and void, said he thought the English season will not restart but talks between the Premier League and authorities continued", "url": "https://www.theguardian.com/football/2020/apr/25/premier-league-completion-probably-not-realistic-says-dutch-fa-president-just-spee", "urlToImage": null, "publishedAt": "2020-04-25T14:29:53Z", "content": "The president of the Dutch football association, the KNVB, has cast doubt on the feasibility of the Premier League playing matches behind closed doors in June, even as the British government suggested it might be possible for some sports to resume within a fe… [+3288 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Watch FIFA20 ePL Invitational with Sky Sports: The Finals - Sky Sports", "description": "Missing football? Watch the action live from the ePL Invitational as professional footballers represent their clubs in a FIFA20 tournament.", "url": "https://www.skysports.com/football/news/11661/11978658/watch-fifa20-epl-invitational-with-sky-sports-the-finals", "urlToImage": null, "publishedAt": "2020-04-25T14:11:49Z", "content": "Missing football? Well get your fix here! Watch the action live from the ePL Invitational: The Finals as professional footballers represent their clubs in a FIFA20 tournament. \r\nCompetitive juices will be flowing and rivalries revisited as clubs take part in … [+893 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Elliott Jackson", "title": "Manchester United fans mock Steven Gerrard over Paul Scholes comment - Manchester Evening News", "description": "Steven Gerrard drew similarities between Paul Scholes and Jordan Henderson, much to the amusement of United's fans.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-fans-gerrard-scholes-18150280", "urlToImage": null, "publishedAt": "2020-04-25T13:59:02Z", "content": "Steven Gerrard has claimed that Liverpool captain Jordan Henderson is now running matches in a similar manner to how Paul Scholes used to for Manchester United.\r\nHenderson has featured in all but four of Liverpool's Premier League games this season and they s… [+1455 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Freddie Keighley", "title": "Man Utd target Thomas Meunier 'in talks with Tottenham' over transfer - Mirror Online", "description": "The Paris Saint-Germain right-back is out of contract this summer and has reportedly had a phone call with Spurs boss Jose Mourinho about a move to the Tottenham Hotspur Stadium", "url": "https://www.mirror.co.uk/sport/football/transfer-news/man-utd-target-thomas-meunier-21925032", "urlToImage": null, "publishedAt": "2020-04-25T13:55:33Z", "content": "Thomas Meunier has spoken to Tottenham Hotspur manager Jose Mourinho about a transfer this summer, according to a report from France. \r\nThe Belgian right-back is set to leave Paris Saint-Germain when his contract expires in June, after four years with the Lig… [+1889 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Theo Squires", "title": "Eight players you forgot were in Being: Liverpool - Liverpool Echo", "description": "Alberto Aquilani was still a Liverpool player - but do you remember the other seven stars?", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/transfer-mistakes-surprise-jamie-carragher-18128074", "urlToImage": null, "publishedAt": "2020-04-25T13:15:22Z", "content": "Jurgen Klopp is not too fond of fly-on-the-wall documentaries. Well not ones that would invade his Liverpool dressing room anyway.\r\nThe Reds have resisted offers from TV companies in the past as the likes of Netflix and Amazon Prime enjoy success with the lik… [+9946 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Freddie Keighley", "title": "Man Utd No.2 Mike Phelan explains Ole Gunnar Solskjaer's thinking behind formation changes - Mirror Online", "description": "The Red Devils assistant manager opened up about the variety of systems his side have played this season - also identifying one formation which is best-suited to the players", "url": "https://www.mirror.co.uk/sport/football/news/man-utd-no2-mike-phelan-21925453", "urlToImage": null, "publishedAt": "2020-04-25T13:09:44Z", "content": "Manchester United assistant manager Mike Phelan has outlined the reasons for the Red Devils regularly changing formations this season under Ole Gunnar Solskjaer. \r\nUnited have experimented with three-man and four-man defences and tinkered with the shape of th… [+1721 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Raheem Sterling admits he is no longer \"in awe\" of ex-Liverpool teammate Steven Gerrard - Mirror Online", "description": "The pair played together for club and country at the start of the Man City forwards career, but Sterling has since gone on to greater things while Gerrard has stepped into management", "url": "https://www.mirror.co.uk/sport/football/news/raheem-sterling-admits-no-longer-21925499", "urlToImage": null, "publishedAt": "2020-04-25T12:51:10Z", "content": "Raheem Sterling has admitted he is no longer \"in awe\" of football legends like his former Liverpool captain Steven Gerrard. \r\nThe Man City star has been playing at the top level for close to a decade now, despite still being only 25.\r\n Sterling broke into the… [+1812 chars]"}, {"source": {"id": null, "name": "Teamtalk.com"}, "author": null, "title": "Dortmund play tempting ace card in bid to keep Sancho from Man Utd - Teamtalk.com", "description": "Borussia Dortmund reckon they can still persuade Jadon Sancho to stay at the Westfalenstadion this summer despite heightening speculation a move to Manchester United had been agreed.", "url": "https://www.teamtalk.com/news/dortmund-huge-wage-increase-halt-jadon-sancho-man-utd-transfer", "urlToImage": null, "publishedAt": "2020-04-25T12:44:06Z", "content": "Borussia Dortmund reckon they can still persuade Jadon Sancho to stay at the Westfalenstadion this summer despite heightening speculation a move to Manchester United had been agreed.\r\nEngland winger Sancho, 20, has become one of European footballs hottest pro… [+2532 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Danny Gallagher For Mailonline", "title": "Olympiacos set to be relegated to the second tier and chief Evangelos Marinakis facing lifetime ban - Daily Mail", "description": "Greek giants Olympiacos stand on the brink after reports emerged they that are to be relegated to the lower tiers and hit with hefty fines following historic match-fixing allegations.", "url": "https://www.dailymail.co.uk/sport/sportsnews/article-8256305/Olympiacos-set-relegated-second-tier-chief-Evangelos-Marinakis-facing-lifetime-ban.html", "urlToImage": null, "publishedAt": "2020-04-25T12:43:33Z", "content": "Greek giants Olympiacos stand on the brink after reports emerged they that are to be relegated to the lower tiers and hit with hefty fines following historic match-fixing allegations.\r\nAccording to Corriere dello sport the club are on the precipice of free-fa… [+3825 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ben Husband", "title": "'I'm an impatient man' - Aston Villa owners have this incredible plan for the club - Birmingham Live", "description": "The Aston Villa co-owner was speaking on the US network about his business ventures, when his two sport teams were mentioned", "url": "https://www.birminghammail.co.uk/sport/football/football-news/aston-villa-owners-edens-sawiris-18128536", "urlToImage": null, "publishedAt": "2020-04-25T12:35:54Z", "content": "Wes Edens has outlined his plan for Aston Villa to become one of the biggest teams in the world - and when he hopes to achieve it by. \r\nEdens along with Nassef Sawiris, bought the club from Dr Tony Xia in the summer of 2018, helping Villa stave off the immine… [+2201 chars]"}, {"source": {"id": null, "name": "Leeds-live.co.uk"}, "author": "Beren Cross", "title": "EFL publishes new statement on Leeds United's promotion chances - Leeds Live", "description": "After Premier League and FA developments the Championship's bosses have released an update", "url": "https://www.leeds-live.co.uk/sport/leeds-united/breaking-efl-statement-leeds-united-18150175", "urlToImage": null, "publishedAt": "2020-04-25T12:34:00Z", "content": "EFL remains committed to seeing out the 2019/20 season in full and giving Leeds United every chance to seal promotion to the Premier League.\r\nAfter major developments in the national press on Saturday morning, the Championships ruling body released a new stat… [+3821 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Coronavirus and sport: Chelsea's first-team squad will not take pay cut - BBC News", "description": "Chelsea's first-team players will not be taking a pay cut during the coronavirus pandemic, but will \"focus on further supporting other charitable causes\".", "url": "https://www.bbc.co.uk/sport/football/52425899", "urlToImage": null, "publishedAt": "2020-04-25T12:30:45Z", "content": "Chelsea players have been supporting various charities during the pandemic\r\nChelsea's first-team players will not be taking a pay cut to contribute to the club during the coronavirus pandemic, but will \"focus on further supporting other charitable causes\".\r\nI… [+1824 chars]"}, {"source": {"id": null, "name": "Football365.com"}, "author": "Matthew Stead", "title": "Liverpool star not called Van Dijk named best in Premier League by Silva - Football365.com", "description": "Football365 - The best in the world that David Silva's never played with? Lionel Messi. In England? It's Liverpool, but not Virgil van Dijk.", "url": "https://www.football365.com/news/david-silva-sadio-mane-liverpool-lionel-messi", "urlToImage": null, "publishedAt": "2020-04-25T12:30:21Z", "content": "David Silva has named Liverpool forward Sadio Mane as the best non-Manchester City player in the Premier League.\r\nBefore the suspension of all football, Mane was one of the frontrunners to win the PFA Player of the Year award, and perhaps one of the best in t… [+1420 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Ian Doyle", "title": "Bobby Duncan, major setbacks and what happened next for Liverpool FA Youth Cup winners - Liverpool Echo", "description": "Exactly one year has passed since Liverpool lifted the FA Youth Cup against Manchester City", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/pep-lijnders-impressed-breakout-star-18143544", "urlToImage": null, "publishedAt": "2020-04-25T12:25:33Z", "content": "Champions League glory was more than a month away, but already Liverpool could celebrate claiming prestigious silverware.\r\nExactly a year has passed since the Reds claimed the FA Youth Cup for only the fourth time in their history.\r\nUnder the tutelage of coac… [+4773 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Olivier Giroud: Chelsea striker set to sign contract extension - BBC Sport", "description": "Chelsea striker Olivier Giroud is set to sign a contract extension, keeping him at the club until 2021.", "url": "https://www.bbc.co.uk/sport/football/52418829", "urlToImage": null, "publishedAt": "2020-04-25T12:24:49Z", "content": "Olivier Giroud joined Chelsea from Arsenal in 2018\r\nChelsea striker Olivier Giroud is set to sign a contract extension, keeping him at the club until 2021.\r\nThe Frenchman, 33, looked like he would leave in January after making five Premier League appearances … [+814 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Jon Doel", "title": "Wales on brink of stunning world rugby and ditching Bill Beaumont amid late drama - reports - Wales Online", "description": "The race to become World Rugby chairman may be about to take a huge twist", "url": "https://www.walesonline.co.uk/sport/rugby/rugby-news/wales-brink-stunning-world-rugby-18149672", "urlToImage": null, "publishedAt": "2020-04-25T12:15:32Z", "content": "Wales could be the country to blow apart Bill Beaumont's hopes of winning the race to remain World Rugby chairman, according to reports.\r\nBeaumont has widely been expected to receive the backing of all Six Nations countries in his battle with Agustin Pichot, … [+1060 chars]"}, {"source": {"id": null, "name": "Motorsport.com"}, "author": "Pablo Elizalde", "title": "F1 drivers will \"struggle\" with necks after hiatus ends - Motorsport.com, Edition: Global", "description": "Carlos Sainz believes Formula 1 drivers will struggle with their necks in the first race of 2020 when the sport finally resumes following the COVID-19 crisis.", "url": "https://www.motorsport.com/f1/news/sainz-driver-collapse-neck-2020-races/4783526/", "urlToImage": null, "publishedAt": "2020-04-25T12:15:12Z", "content": "With F1 races already cancelled or postponed until at least July, drivers are set to face at least some five months without getting behind the wheel of a grand prix car.\r\nWhile all of them keep working out from home to stay in shape for when F1 resumes, Sainz… [+1701 chars]"}, {"source": {"id": null, "name": "Theguardian.comfootball"}, "author": "Guardian staff reporter", "title": "Norwich will not go back on decision to furlough non-playing staff - The Guardian", "description": "Club are budgeting for a shortfall between £18-£35m but won’t follow the three clubs who went back on decisions to furlough", "url": "https://amp.theguardian.comfootball/2020/apr/25/norwich-will-not-go-back-on-decision-to-furlough-non-playing-staff", "urlToImage": null, "publishedAt": "2020-04-25T12:12:00Z", "content": "Norwich have defended their decision to place some of their non-playing staff on furlough leave during the coronavirus pandemic. The Canaries are one of only two Premier League clubs using the scheme, where employees receive 80% of wages from the government u… [+1780 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Tania Snuggs", "title": "Coronavirus: Premier League football could return 'within weeks' with matches behind closed doors - Sky News", "description": "A government source has told Sky News it is \"working hard to get live sport back on the TV\" to give the country a morale boost.", "url": "https://news.sky.com/story/coronavirus-premier-league-football-could-return-within-weeks-with-matches-behind-closed-doors-11978631", "urlToImage": null, "publishedAt": "2020-04-25T12:08:26Z", "content": null}, {"source": {"id": "talksport", "name": "TalkSport"}, "author": "Joe Coleman", "title": "David Haye considering incredible boxing comeback to fight the winner of Tyson Fury vs Anthony Joshua - talkSPORT.com", "description": "", "url": "http://talksport.com/sport/boxing/698874/boxing-comeback-news-fight-tyson-fury-vs-anthony-joshua/", "urlToImage": null, "publishedAt": "2020-04-25T11:56:55Z", "content": "David Haye has admitted he would only consider a return to boxing if he was guaranteed to fight the winner of Anthony Joshua vs Tyson Fury.\r\nHowever, the Bermondsey-born slugger admitted it was unlikely the call would ever come and admitted he was content wit… [+2429 chars]"}, {"source": {"id": null, "name": "Hitc.com"}, "author": "Subhankar Mondal", "title": "‘Get it out’: Rangers sent message on Twitter by ex-Dundee forward - HITC - Football, Gaming, Movies, TV, Music", "description": "Glasgow Rangers are not happy with the SPFL investigation.", "url": "https://www.hitc.com/en-gb/2020/04/25/get-it-out-rangers-sent-message-on-twitter-by-ex-dundee-forward/", "urlToImage": null, "publishedAt": "2020-04-25T11:48:23Z", "content": "Glasgow Rangers are not happy with the SPFL investigation.\r\nTam McManus has urged Rangers on Twitter to show evidence of any improper conduct by the SPFL regarding the Dundee vote.\r\nThe former Dundee forward believes that if Rangers have any evidence, then th… [+1284 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Jon Boon", "title": "Mike Tyson’s three wives including one he caught having sex with Brad Pitt, one who’s a doctor and ex-con spo - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/11472016/mike-tyson-wives-brad-pitt/", "urlToImage": null, "publishedAt": "2020-04-25T11:47:12Z", "content": "BOXING legend Mike Tyson is the most settled he's ever been.\r\nAnd that could be because of the influence of his new wife, Lakiha Spicer.\r\n Mike Tyson has married three different women in his lifetimeCredit: New York Daily News - Getty\r\nTyson's first wife Robi… [+5540 chars]"}, {"source": {"id": null, "name": "Autosport.com"}, "author": "Luke Smith", "title": "Brazil 2012: The race that could have changed an F1 nearly-man's career - Autosport", "description": "The 2012 Brazilian Grand Prix, which is being live-streamed by Formula 1 today, is upheld as one of F1's most dramatic title-deciders", "url": "https://www.autosport.com/f1/news/149147/the-race-that-could-have-changed-an-f1-nearlyman", "urlToImage": null, "publishedAt": "2020-04-25T11:33:15Z", "content": "The 2012 Brazilian Grand Prix, which is being live-streamed by Formula 1 today, is upheld as one of F1's most dramatic title-deciders. The fight for the victory was no less exciting, as yet another chance slipped through the fingers of an F1 nearly-man\r\nThe 2… [+9660 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Tom Leach", "title": "Man City star Raheem Sterling sends warning to Liverpool FC player Trent Alexander-Arnold - Manchester Evening News", "description": "Raheem Sterling and Trent Alexander-Arnold will face off in the last four of a FIFA 20 tournament on Saturday afternoon.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-city-news-liverpool-fc-18149680", "urlToImage": null, "publishedAt": "2020-04-25T11:08:10Z", "content": "Manchester City star Raheem Sterling has warned Liverpool favourite Trent Alexander-Arnold that he will not beat him when the two players lock horns in the last four of a FIFA 20 competition on Saturday afternoon. \r\nTheir meeting will be the first of two semi… [+1095 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Tom Victor", "title": "Tottenham wanted to sign Atletico Madrid and Liverpool wingers but here's who they got instead - Football.London", "description": "Martin Jol’s team had some big names in mind in the summer of 2006 to take another run at the Champions League spots", "url": "https://www.football.london/tottenham-hotspur-fc/news/tottenham-transfer-news-petrov-kewell-18132075", "urlToImage": null, "publishedAt": "2020-04-25T11:08:02Z", "content": "Fans of every Premier League club will have stories of players they might have signed, and the transfer deals that went through when they missed out on primary targets, and Tottenham Hotspur supporters are no exception.\r\nSpurs have done some great business ov… [+4553 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Phil Thompson", "title": "Timo Werner would be 'fantastic' signing for Liverpool, says Phil Thompson - Sky Sports", "description": "Timo Werner is good enough to challenge Liverpool's front three and would be a \"fantastic\" signing for the club, according to Phil Thompson.", "url": "https://www.skysports.com/football/news/11669/11978627/timo-werner-would-be-fantastic-signing-for-liverpool-says-phil-thompson", "urlToImage": null, "publishedAt": "2020-04-25T11:02:27Z", "content": "Timo Werner is good enough to challenge Liverpool's front three and would be a \"fantastic\" signing for the club, according to former Reds defender Phil Thompson.\r\nThe RB Leipzig forward is ready to sign for Liverpool if they pay his £52m release clause before… [+3565 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Kate Mcgreavy For Mailonline", "title": "Jose Mourinho 'phones PSG defender Thomas Meunier' to convince him to join Spurs - Daily Mail", "description": "The Belgian full back is entering the final months of his contract at the Parc des Princes. Spurs manager Mourinho is reportedly keen on bringing Meunier to the Premier League.", "url": "https://www.dailymail.co.uk/sport/football/article-8256151/Jose-Mourinho-phones-PSG-defender-Thomas-Meunier-convince-join-Spurs.html", "urlToImage": null, "publishedAt": "2020-04-25T10:59:51Z", "content": "Jose Mourinho has reportedly called Paris Saint-Germain defender Thomas Meunier to convince him to join Tottenham once his contract expires this summer.\r\nThe Belgian full back is entering the final months of his contract at the Parc des Princes.\r\nSpurs manage… [+1097 chars]"}, {"source": {"id": null, "name": "Teamtalk.com"}, "author": null, "title": "Klopp fell in love with 'little diamond' after first training session - Ljinders - Teamtalk.com", "description": "Jurgen Klopp believes Liverpool have a star for many years to come in the shape of \"little diamond\" Harvey Elliott, according to the German's trusted assistant Pep Lijnders.", "url": "https://www.teamtalk.com/news/klopp-in-love-little-diamond-elliott-liverpool-ljinders", "urlToImage": null, "publishedAt": "2020-04-25T10:27:07Z", "content": "Jurgen Klopp believes Liverpool have a star for many years to come in the shape of “little diamond” Harvey Elliott, according to the German’s trusted assistant Pep Lijnders.\r\nThe 17-year-old moved to Anfield from Fulham last summer in a deal still to be settl… [+1908 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Ray Parlour slams Arsenal leadership in passionate defence of Mesut Ozil - Mirror Online", "description": "Ozil is one of three Arsenal players to reject pay cut proposals put forward by the board but Parlour believes the star has been unnecessarily made a scapegoat as a result", "url": "https://www.mirror.co.uk/sport/football/news/ray-parlour-slams-arsenal-leadership-21924954", "urlToImage": null, "publishedAt": "2020-04-25T10:15:52Z", "content": "Ray Parlour has leapt to the defence of Mesut Ozil and criticised the lack of leadership at Arsenal amid the recent disagreement regarding player pay cuts. \r\n Ozil is one of three Arsenal stars to decide against taking a deduction in their salary despite the … [+2410 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Joseph Chapman", "title": "Wolves agree on Liverpool transfer ahead of summer window - reports - Birmingham Live", "description": "Wolves transfer news - Liverpool goalkeeper Loris Karius has been linked with a move to Molineux in the next transfer window", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/wolves-transfers-karius-liverpool-klopp-18130415", "urlToImage": null, "publishedAt": "2020-04-25T10:04:48Z", "content": "The latest rumour in the bizarre transfer triangle that is developing involving Wolves has linked them with Liverpool goalkeeper Loris Karius.\r\n In the last week or so, Wolves have been regularly mentioned in the same sentence as Besiktas, when their goalkeep… [+2317 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Joe Rimmer", "title": "Luis Alberto masterstroke could make Liverpool millions this summer - Liverpool Echo", "description": "Luis Alberto's Liverpool departure may have gone under the radar - but a clause could result in Liverpool making millions", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-luis-alberto-transfer-clause-17881222", "urlToImage": null, "publishedAt": "2020-04-25T10:03:36Z", "content": "Michael Edwards doesn't do interviews. The Liverpool sporting director just doesn't want the headlines.\r\nNor does Edwards appear publicly, and anyone searching for a picture of him will only find a select few.\r\nYou won't find much about him on the club site, … [+3728 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Joel Golby", "title": "‘Children in football kits start kicking me up the bum’: my life as a mascot - The Guardian", "description": "Remember football – the crowds, the noise, the goofy beaver dancing on the touchline? Welcome to the weird world of the matchday mascot", "url": "https://www.theguardian.com/sport/2020/apr/25/children-in-football-kits-start-kicking-me-up-the-bum-my-life-as-a-mascot", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": "There is no force in the universe more irresistible than a high five from Reading FCs lion mascot, Kingsley. The only thing that comes close is a hug from Kingsleys mascot wife, Queensley. Do not ask why a mascot needs a mascot wife, because I cannot explain … [+12086 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "NFL Draft 2020: Teams set wide receiver record on Day Two - Sky Sports", "description": "Wide receivers flew off the board on a busy Day Two of the 2020 NFL Draft.", "url": "https://www.skysports.com/nfl/news/12118/11978575/nfl-draft-2020-teams-set-wide-receiver-record-on-day-two", "urlToImage": null, "publishedAt": "2020-04-25T09:58:40Z", "content": "Teams continued to dip into the 2020 NFL Draft's deep receiver class on Friday, with the Cincinnati Bengals kicking off the run at the top of Round Two by grabbing Clemson wideout Tee Higgins.\r\nAfter six wideouts went in Round One, Round Two began with two in… [+4635 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "REPLAYED: West Ham 0-2 Liverpool | Ox & Salah make it 19 points at the London Stadium - Liverpool FC", "description": "Relive the Reds' victory at the London Stadium, as Alex Oxlade-Chamberlain's well-taken goal was added to by a Mo Salah penalty to stretch LFC's lead at the ...", "url": "https://www.youtube.com/watch?v=knNR4bd5Dd8", "urlToImage": null, "publishedAt": "2020-04-25T09:57:14Z", "content": "Relive the Reds' victory at the London Stadium, as Alex Oxlade-Chamberlain's well-taken goal was added to by a Mo Salah penalty to stretch LFC's lead at the top of the Premier League.\r\nEnjoy more content and get exclusive perks in our Liverpool FC Members Are… [+197 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Aubameyang discussing Arsenal exit amid Chelsea & Man Utd links - Metro.co.uk", "description": "Will he leave?", "url": "https://metro.co.uk/2020/04/25/pierre-emerick-aubameyang-talking-inter-milan-12608142/", "urlToImage": null, "publishedAt": "2020-04-25T09:53:04Z", "content": "Aubameyang is tipped to leave Arsenal (Picture: Getty)\r\nPierre-Emerick Aubameyang has reportedly discussed leaving Arsenal with Inter Milan players as the Serie A side looks to beat Manchester United and Chelsea to his signature.\r\nArsenal are ready to listen … [+1692 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Elliott Jackson", "title": "Newcastle United told the one thing they must ensure to lure Mauricio Pochettino to the club - Chronicle Live", "description": "The former Tottenham Hotspur boss has been linked with a move to St James' Park", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/newcastle-takeover-pochettino-berbatov-transfers-18148235", "urlToImage": null, "publishedAt": "2020-04-25T09:43:23Z", "content": "Former Manchester United striker Dimitar Berbatov has insisted that Mauricio Pochettino would need to be reassured over transfer funds if he was to join Newcastle United. \r\nThe Magpies are in talks over a proposed £300m takeover which would see them become on… [+1829 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Marcus Banks", "title": "Manchester United fans cannot believe new Angel Di Maria transfer rumour - Manchester Evening News", "description": "Angel Di Maria signed for United in 2014 but left in 2015 to join Paris Saint-Germain.", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/pogba-di-maria-man-utd-18149406", "urlToImage": null, "publishedAt": "2020-04-25T09:24:29Z", "content": "Speculation over the future of Manchester United midfielder Paul Pogba refuses to die down.\r\nThe World Cup winner continues to be heavily linked with an exit, with Real Madrid, Juventus and Paris Saint-Germain believed to be interested in acquiring his servic… [+1449 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "London Marathon: Delayed race could feature elite athletes only - BBC News", "description": "This year's postponed London Marathon could be staged with elite athletes only, says race director Hugh Brasher.", "url": "https://www.bbc.co.uk/sport/athletics/52423940", "urlToImage": null, "publishedAt": "2020-04-25T09:14:00Z", "content": "Kenyan world record holders Kipchoge and Brigid Kosgei are due to defend their titles at the 40th London Marathon\r\nThis year's postponed London Marathon could be staged with elite athletes only, says race director Hugh Brasher.\r\nBrasher said that was one of 1… [+1098 chars]"}, {"source": {"id": null, "name": "Autosport.com"}, "author": "Jonathan Noble", "title": "F1 News: Ferrari's Vettel set to join rivals in Esports competitions - Autosport", "description": "Ferrari driver Sebastian Vettel says he will join many of his Formula 1 rivals and start sim racing soon, after recently taking delivery of his own rig", "url": "https://www.autosport.com/f1/news/149143/vettel-set-to-join-rivals-in-esports-competitions", "urlToImage": null, "publishedAt": "2020-04-25T09:10:40Z", "content": "Ferrari driver Sebastian Vettel says he will join many of his Formula 1 rivals and start sim racing soon, after recently taking delivery of his own rig.\r\nThe four-time world champion has so far steered clear of joining in with the recent rush to take part in … [+1695 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Ben Grounds", "title": "Barcelona transfer Q&A: Key questions on Neymar, Philippe Coutinho, Lautaro Martinez - Sky Sports", "description": "Sky Sports assess what surgery is needed to the Barcelona squad and what transfer activity can be expected.", "url": "https://www.skysports.com/football/news/11095/11976997/barcelona-transfer-qa-key-questions-on-neymar-philippe-coutinho-lautaro-martinez", "urlToImage": null, "publishedAt": "2020-04-25T08:06:43Z", "content": "Barcelona are in a state of flux. Quique Setien was the temporary manager who has unexpectedly found himself in long-term control owing to the uncertainty surrounding the coronavirus pandemic.\r\nSince arriving as Ernesto Valverde's successor, Setien has found … [+15079 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "“The Winner Will Fight Khabib For the Title”- Dana White makes a huge statement - India Gone Viral", "description": "UFC 249 finally has a new venue. The event will take place at VyStar Veterans Memorial Arena in Jacksonville, Florida. The UFC pounced on a chance to hold their events in the Sunshine State as sports", "url": "https://indiagoneviral.com/sports/2020/04/25/the-winner-will-fight-khabib-for-the-title/42011/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T08:05:16Z", "content": "UFC 249 finally has a new venue. The event will take place at VyStar Veterans Memorial Arena in Jacksonville, Florida. The UFC pounced on a chance to hold their events in the Sunshine State as sports activities were deemed essential businesses. Dana White app… [+1803 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "When Yuvraj smashed Broad for six sixes in a row - BBC News", "description": "Relive the moment when Yuvraj Singh became the first player in Twenty20 history to hit six sixes in an over.", "url": "https://www.bbc.co.uk/sport/av/cricket/52397653", "urlToImage": null, "publishedAt": "2020-04-25T07:57:37Z", "content": null}, {"source": {"id": null, "name": "Hitc.com"}, "author": "Subhankar Mondal", "title": "‘He told me’: 23-year-old might’ve played final Arsenal game – Our View - HITC - Football, Gaming, Movies, TV, Music", "description": "Daniel Ceballos is on loan at Arsenal from Real Madrid.", "url": "https://www.hitc.com/en-gb/2020/04/25/he-told-me-23-year-old-mightve-played-final-arsenal-game-our-vie/", "urlToImage": null, "publishedAt": "2020-04-25T07:21:27Z", "content": "Daniel Ceballos is on loan at Arsenal from Real Madrid.\r\nDaniel Ceballos has suggested that he will return to Real Madrid when his loan spell at Arsenal runs out, as quoted in The Mirror.\r\nCeballos joined Premier League outfit Arsenal on a season-long loan de… [+1543 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Gary Ralston", "title": "Robby McCrorie on West Ham's transfer radar as Rangers keeper attracts Premier League interest - Daily Record", "description": "David Moyes has been impressed by the keeper's form on-loan at Livingston.", "url": "https://www.dailyrecord.co.uk/sport/football/football-transfer-news/robbie-mccrorie-west-hams-transfer-21923361", "urlToImage": null, "publishedAt": "2020-04-25T07:14:29Z", "content": "West Ham are on the trail of Rangers keeper Robby McCrorie.\r\nThe Hammers have been impressed by the form of the Scotland under-21 starlet and see him as a long term successor to Lukasz Fabianski.\r\nMcCrorie, 22, is currently on loan at Livingston after spendin… [+1022 chars]"}, {"source": {"id": null, "name": "Lancs.live"}, "author": "Luke Beardsworth", "title": "Leeds United fans can cry all they like - Alex Neil has a point - LancsLive", "description": "Alex Neil's comments, not aimed at but inclusive of Leeds United, caused a stir yesterday", "url": "https://www.lancs.live/sport/football/football-news/leeds-united-fans-can-cry-18149143", "urlToImage": null, "publishedAt": "2020-04-25T07:06:00Z", "content": "That was all very dramatic and petty wasn't it? \r\nAlex Neil appears to have annoyed the thousands of Leeds United fans on Twitter in insinuating that clubs who furlough staff or defer wages should be given a transfer ban.\r\nIt makes sense, right? How does a cl… [+3270 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Hakim Ziyech explains impact coronavirus has had on his Chelsea transfer - Mirror.co.uk", "description": "Ajax winger is adamant his move to Stamford Bridge will still go ahead - as he slammed Eredivisie for failing to award Dutch table-toppers the title", "url": "https://www.mirror.co.uk/sport/football/transfer-news/hakim-ziyech-explains-impact-coronavirus-21924663", "urlToImage": null, "publishedAt": "2020-04-25T05:55:00Z", "content": "Hakim Ziyech is adamant he will still become a Chelsea player this summer amid fears his move from Ajax could be impacted by the coronavirus pandemic. \r\nChelsea agreed a £37million deal for Ziyech in January that saw Ajax keep the Morocco international for th… [+1881 chars]"}, {"source": {"id": null, "name": "Sportslens.com"}, "author": "Sri Aswin", "title": "Manchester United decide against signing Napoli defender Kalidou Koulibaly: report - Sportslens.com", "description": "Manchester United have decided against making a move to sign Kalidou Koulibaly from Napoli during this summer'", "url": "https://sportslens.com/manchester-united-decide-against-signing-napoli-defender-kalidou-koulibaly-report/294729/", "urlToImage": null, "publishedAt": "2020-04-25T04:45:00Z", "content": "Manchester United have decided against making a move to sign Kalidou Koulibaly from Napoli during this summer’s transfer window, Manchester Evening News reports.\r\nThe Senegal international has made 233 appearances during his six-and-a-half stay in Naples wher… [+1520 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Guardian sport", "title": "Philadelphia Eagles surprise with Jalen Hurts pick on day two of NFL draft - The Guardian", "description": "The Eagles selected Oklahoma quarterback Jalen Hurts in the second round of the NFL draft on Friday, a stunning move for a team with more pressing needs", "url": "https://www.theguardian.com/sport/2020/apr/25/nfl-draft-picks-day-two-jalen-hurts", "urlToImage": null, "publishedAt": "2020-04-25T04:20:00Z", "content": "After giving Carson Wentz a playmaker, the Philadelphia Eagles drafted his backup.\r\nThe Eagles selected Oklahoma quarterback Jalen Hurts in the second round of the NFL draft on Friday night, a stunning move for a team with more pressing needs.\r\nPhiladelphia h… [+10018 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Josh Challies", "title": "Premier League appoint man who will be key to Liverpool decision - Liverpool Echo", "description": "Gary Hoffman has been confirmed as the new Premier League chairman and faces a wealth of challenges", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/premier-league-appoint-man-who-18144058", "urlToImage": null, "publishedAt": "2020-04-25T03:06:08Z", "content": "The Premier League has confirmed the appointment of Gary Hoffman as new chairman following a unanimous vote on Friday.\r\nHoffman, currently chairman of Monzo Bank, will take up his new position on June 1 and the announcement comes during an incredibly testing … [+2147 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Gareth Bicknell", "title": "Sean Dyche explains why he had to apologise to Arsene Wenger after Arsenal clash - Mirror Online", "description": "Burnley manager said he gave former Gunners boss Wenger a 'rubbish' claret following a game at Turf Moor, as he opened up on his own taste in wine", "url": "https://www.mirror.co.uk/sport/football/news/sean-dyche-explains-apologise-arsene-21924463", "urlToImage": null, "publishedAt": "2020-04-25T01:48:30Z", "content": "Burnley manager Sean Dyche has revealed he had to apologise to former Arsenal boss Arsene Wenger - for giving him a \"rubbish\" red wine after a game. \r\nDyche, who admits he is \"certainly not an aficionado\" of fine wines, says all rival managers are offered the… [+2225 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "All eyes on Germany & no non-league matches until 2021? What next for football? - BBC Sport", "description": "As Uefa attempts to offer some clarity about what next for football, BBC Sport's Simon Stone takes a look at some of the big questions that remain.", "url": "https://www.bbc.co.uk/sport/football/52413053", "urlToImage": null, "publishedAt": "2020-04-25T01:37:50Z", "content": "Liverpool are the current European champions after beating Tottenham in last season's Champions League final\r\nAt the end of a busy week of meetings and discussions, European football's governing body, Uefa, offered some clarity over how they hope the game wil… [+7026 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Guardian sport", "title": "West Indies say Test tour of England has been postponed due to Covid-19 - The Guardian", "description": "The three-Test series between England and West Indies in June has been postponed due to the coronavirus outbreak", "url": "https://www.theguardian.com/sport/2020/apr/24/west-indies-test-tour-england-postponed-covid-19-cricket", "urlToImage": null, "publishedAt": "2020-04-24T23:20:55Z", "content": "The three-Test series between England and West Indies in June has been postponed due to the coronavirus outbreak, Cricket West Indies (CWI) said on Friday.\r\nWest Indies had been scheduled to play on 4-8 June at The Oval, 12-16 June at Edgbaston and 25-29 June… [+1600 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Matt Davies", "title": "PDC Darts Home Tour 2020 results LIVE: Stream, latest scores on Day 8, watch free online and TV channel - Evening Standard", "description": "", "url": "https://www.standard.co.uk/sport/darts-pdc-home-tour-2020-live-stream-results-day-8-latest-scores-watch-free-tv-a4423691.html", "urlToImage": null, "publishedAt": "2020-04-24T21:44:58Z", "content": "Welcome to Day 8 of our PDCdarts Home Tour LIVE coverage.\r\nOn Friday night, world number 15 Jonny Clayton progressed to the next round with a perfect record of three straight victories.\r\nIt was a close encounter, however, the group undecided until the final g… [+7879 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Alex Raskin Sports News Editor For Dailymail.com Associated Press", "title": "Video shows Bucs rookie and Tom Brady's newest blocker Tristan Wirfs jumping out of pool - Daily Mail", "description": "Tampa Bay Buccaneers first-round pick Tristan Wirfs weighs well over 300 pounds, but the offensive tackle and Tom Brady's newest blocker is still athletic enough to jump out of a pool onto his feet.", "url": "https://www.dailymail.co.uk/news/article-8254551/Video-shows-Bucs-rookie-Tom-Bradys-newest-blocker-Tristan-Wirfs-jumping-pool.html", "urlToImage": null, "publishedAt": "2020-04-24T20:51:27Z", "content": "The Buccaneers drafted Tristan Wirfs to address an opening at right tackle \r\nTampa Bay Buccaneers first-round pick Tristan Wirfs weighs well over 300 pounds, but the offensive tackle and Tom Brady's newest blocker is still athletic enough to launch himself ou… [+3438 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Elliott Jackson", "title": "What Jurgen Klopp said to Liverpool before historic Barcelona comeback - Liverpool Echo", "description": "The Reds beat Barcelona 4-0 to reach the Champions League final", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/klopp-liverpool-talk-barcelona-comeback-18148913", "urlToImage": null, "publishedAt": "2020-04-24T20:35:00Z", "content": "James Milner has revealed what Jurgen Klopp said to his players in training before their unforgettable comeback against Barcelona in the Champions League. \r\nThe Reds remarkably beat the Spanish giants 4-0 at Anfield in the second leg of their Championship Lea… [+1744 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Is Jamie Carragher RIGHT?! Fernando Torres' flabbergasting move from Liverpool to Chelsea | ESPN FC - ESPN UK", "description": "Craig Burley and Julien Laurens join Dan Thomas on ESPN FC to react to recent comments made by former Liverpool defender Jamie Carragher and former Chelsea c...", "url": "https://www.youtube.com/watch?v=hoRBD5aVqVk", "urlToImage": null, "publishedAt": "2020-04-24T19:51:55Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Marcus Rashford's style highlights the type of centre forward Manchester United need - Manchester Evening News", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiemh0dHBzOi8vd3d3Lm1hbmNoZXN0ZXJldmVuaW5nbmV3cy5jby51ay9zcG9ydC9mb290YmFsbC9mb290YmFsbC1uZXdzL3Jhc2hmb3JkLW1hcnRpYWwtbWFuY2hlc3Rlci11bml0ZWQtc29sc2tqYWVyLTE4MTM4MDY50gF-aHR0cHM6Ly93d3cubWFuY2hlc3RlcmV2ZW5pbmduZXdzLmNvLnVrL3Nwb3J0L2Zvb3RiYWxsL2Zvb3RiYWxsLW5ld3MvcmFzaGZvcmQtbWFydGlhbC1tYW5jaGVzdGVyLXVuaXRlZC1zb2xza2phZXItMTgxMzgwNjkuYW1w?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T18:54:11Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Suzanne Wrack", "title": "Who could replace Phil Neville as England Women's manager? - The Guardian", "description": "We run the rule over leading candidates, including a two-times World Cup winner and a woman who worked as Neville’s No 2", "url": "https://www.theguardian.com/football/2020/apr/24/who-could-replace-phil-neville-as-england-womens-manager", "urlToImage": null, "publishedAt": "2020-04-24T18:00:00Z", "content": "The Football Associations hunt for a successor to Mark Sampson in 2017 quickly became a circus. Names flew out of the ring as fast as they stepped in. Increased scrutiny on the person in charge, with the game professionalising, led some of those on the shortl… [+4734 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Darren Wells", "title": "Jamie Carragher confirms wife tested positive for coronavirus in second family diagnosis - Mirror Online", "description": "Former Liverpool defender Carragher made the announcement when discussing how the football season in the UK can be resumed safely amid the current pandemic", "url": "https://www.mirror.co.uk/sport/football/news/jamie-carragher-confirms-wife-coronavirus-21921317", "urlToImage": null, "publishedAt": "2020-04-24T17:42:56Z", "content": "Jamie Carragher has revealed his wife Nicola has tested positive for coronavirus, becoming the second person in his family to contract the illness. \r\n The former Liverpool defender turned Sky Sports pundit also explained that his aunt had been receiving treat… [+2284 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Matthew Southcombe", "title": "Marler won't miss a game despite long ban for grabbing Alun Wyn Jones' genitals - Wales Online", "description": "The England prop was banned for 10 weeks after grabbing the Wales skipper's penis, but will be free to play as soon as rugby recommences", "url": "https://www.walesonline.co.uk/sport/rugby/rugby-news/joe-marler-wont-miss-game-18148172", "urlToImage": null, "publishedAt": "2020-04-24T17:41:14Z", "content": "England prop Joe Marler will not miss a single game of rugby despite grabbing Alun Wyn Jones' genitals in a Six Nations match last month, according to reports. \r\nMarler received a 10-week ban after he was found guilty of 'grabbing, twisting or squeezing' the … [+1782 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Marc Mayo", "title": "Luton sack manager Graeme Jones due to financial hit caused by coronavirus despite being in best form of the - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11474684/luton-sack-graeme-jones-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-24T17:38:21Z", "content": "LUTON manager Graeme Jones has left his role with the Championship club after his contract was terminated by mutual consent - owing to the coronavirus crisis.\r\nFootball's finances have been rocked by the game's shutdown amid the pandemic and relegation-threat… [+3076 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Green Bay Packers' Aaron Rodgers within rights to be annoyed by Jordan Love pick, says Neil Reynolds - Sky Sports", "description": "Neil Reynolds and Jeff Reinebold analyse the Green Bay Packers' shock selection of Utah State quarterback Jordan Love.", "url": "https://www.skysports.com/nfl/news/12118/11978237/green-bay-packers-aaron-rodgers-within-rights-to-be-annoyed-by-jordan-love-pick-says-neil-reynolds", "urlToImage": null, "publishedAt": "2020-04-24T17:15:29Z", "content": "Aaron Rodgers is the same age as Brett Favre was when he was selected as his eventual successor by the Green Bay Packers with the No 24 pick at the 2005 NFL Draft.\r\nThat nugget became relevant with pick No 26 on day one of the 2020 Draft as the Packers produc… [+2899 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Joe Brophy", "title": "Bundesliga stars may have to play in MASKS with games stopped if they slip off and breaks every 15 mins to - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11472378/bundesliga-play-in-masks-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-24T16:20:47Z", "content": "BUNDESLIGA stars may have to wear masks during matches with games to be stopped if they slip off after the coronavirus lockdown.\r\nSpiegel Sports revealed that leaked documents in Germany from the Ministry of Labour have disclosed plans to equip both players a… [+2347 chars]"}, {"source": {"id": null, "name": "Football365.com"}, "author": "Joe Williams", "title": "Keane: Ferdinand, Rooney 'not for me' in Man Utd dressing room - Football365.com", "description": "Football365 - Roy Keane says that certain players, including Wayne Rooney and Rio Ferdinand, were \"not for him\" at Man Utd.", "url": "https://www.football365.com/news/roy-keane-rio-ferdinand-wayne-rooney-man-utd-dressing-room", "urlToImage": null, "publishedAt": "2020-04-24T10:01:54Z", "content": "Roy Keane says that certain players, including Wayne Rooney and Rio Ferdinand, were “not for him” during his later years as Man Utd captain.\r\nThe former Republic of Ireland international won seven Premier League titles, four FA Cups and a Champions League dur… [+2321 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Robert Warlow", "title": "Crystal Palace receive financial boost ahead of the summer as Eagles ace makes Arsenal admission - Football.London", "description": "Crystal Palace are set to receive a slice of money released by UEFA to help clubs across Europe during the current financial crisis caused by the coronavirus pandemic", "url": "https://www.football.london/crystal-palace-fc/news/crystal-palace-receive-financial-boost-18140151", "urlToImage": null, "publishedAt": "2020-04-24T09:35:56Z", "content": "Crystal Palace and other Premier League clubs are still awaiting news over the return of top flight football.\r\nThe Premier League and all other professional football leagues in England are currently suspended indefinitely, with no games taking place in the to… [+3358 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "John Cross", "title": "Eric Dier facing lengthy ban after being hit with FA charge over fan confrontation - Mirror Online", "description": "Eric Dier has been charged by the FA after he clashed with a fan in the aftermath of Tottenham's FA Cup defeat to Norwich", "url": "https://www.mirror.co.uk/sport/football/news/eric-dier-facing-lengthy-ban-21916800", "urlToImage": null, "publishedAt": "2020-04-24T07:03:13Z", "content": "Eric Dier is facing a lengthy ban after being hit with an FA misconduct charge.\r\nTottenham midfielder Dier climbed into the stand to confront a fan who was having a row with his brother after their FA Cup exit to Norwich last month. \r\nDier has until May 8 to … [+1927 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "John Cross", "title": "Premier League clubs worried overseas players will not get back to restart season - Mirror Online", "description": "JOHN CROSS COLUMN: Players and clubs are going above and beyond during the coronavirus lockdown - including Brighton plus Liverpool star Ben Woodburn", "url": "https://www.mirror.co.uk/sport/football/news/premier-league-clubs-worried-overseas-21916210", "urlToImage": null, "publishedAt": "2020-04-24T00:53:07Z", "content": "Premier League clubs are concerned some of their overseas players will not be able to get back to restart games.\r\nMany foreign stars fled England to get home before lockdowns were imposed - but could be stuck there with the Premier League hoping that training… [+4501 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Mark McDougall", "title": "Joey Barton blasts Rangers captain James Tavernier over his defending and hair obsession - Daily Record", "description": "The controversial Ibrox flop didn't hold back as he hit out at Tavernier for his defending skills and his lack of preparation for big games.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/joey-barton-blasts-rangers-captain-21916970", "urlToImage": null, "publishedAt": "2020-04-23T21:58:11Z", "content": "Rangers flop Joey Barton has lifted the lid on his controversial spell at Ibrox and blasted skipper James Tavernier for caring more about his hair than football.\r\nBarton has rarely spoken about his time in Glasgow prior to this but opened up in an explosive i… [+1965 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Lee Ryder", "title": "American consortium chief reveals he 'dodged bullet' after talks with Mike Ashley to buy Newcastle United - Chronicle Live", "description": "The New York-born figurehead was eager to take on the job of transforming Newcastle United", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/american-consortium-chief-reveals-dodged-18140537", "urlToImage": null, "publishedAt": "2020-04-23T21:07:57Z", "content": "GACP Sports Capital chairman Joseph DaGrosa has revealed he \"dodged a bullet\" when not buying Newcastle United from Mike Ashley.\r\nThe chairman and CEO of Great American Capital Partners, who sold a stake in Ligue 1 side Bordeaux, held discussions with Justin … [+1193 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Shocks and plenty of goals in Fifa tournament last 16 | ePremier League - BBC Sport", "description": "A shock for one of the favourites as the quarter-final line-up of the ePremier League Invitational tournament is finalised. WATCH LIVE COVERAGE OF THE TOURNA...", "url": "https://www.youtube.com/watch?v=0ujwkpCOCBM", "urlToImage": null, "publishedAt": "2020-04-23T17:40:20Z", "content": "A shock for one of the favourites as the quarter-final line-up of the ePremier League Invitational tournament is finalised.\r\nWATCH LIVE COVERAGE OF THE TOURNAMENT ON IPLAYER AND AT http://www.bbc.co.uk/sport\r\nFixtures:Diogo Jota (Wolves) v Wilfried Ndidi (Lei… [+601 chars]"}]}