{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Indianexpress.com"}, "author": "Sports Desk", "title": "Felt very good when Bangladesh fans chanted ‘Mauka Mauka’ after India’s loss: Nasir Hossain - The Indian Express", "description": "Nasir Hossain, who was part of the Bangladesh squad that defeated MS Dhoni-led India 2-1 in ODIs back in 2015, relished the time when the fans chanted 'Mauka Mauka' against the Men In Blue.", "url": "https://indianexpress.com/article/sports/cricket/india-vs-bangladesh-fans-mauka-mauka-6415679/", "urlToImage": "https://images.indianexpress.com/2020/05/india-vs-bangladesh.jpg?w=759", "publishedAt": "2020-05-18T16:22:35Z", "content": "Bangladesh outplayed India in all departments in the Mirpur ODI. (Source: File Photo AP)Mauka Mauka was a banter that was specifically started to highlight the India-Pakistan rivalry during the ICC Cricket World Cup but its popularity soared among the cricket… [+1779 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Not 'a gora' who knows English completely, my job is to play cricket : Babar Azam hits back at Tanvir Ahmed - India Today", "description": "Pakistan captain Babar Azam said his primary job was to play cricket and and he was not 'a gora' who would know English language completely.", "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-job-is-to-play-i-am-not-gora-dont-know-english-completely-tanvir-ahmed-1679326-2020-05-18", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/AP1_25_2020_000151B-770x433__1-647x363.jpeg?8k_21pzs8PdmdTqbeCpe9OVYnoheBz.o", "publishedAt": "2020-05-18T14:24:38Z", "content": "Pakistan's swashbuckling batsman was appointed the captain of the ODI team last week and was congratulated worldwide for his new role. The 25-year-old batsman has proved himself across all the formats and he got what he truly deserved.\r\nBut former Pakistan cr… [+1609 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "The curious case of Markram: a star in the making, now for six years - Cricbuzz - Cricbuzz", "description": "A lot has happened with Aiden Markram since leading South Africa to their only World Cup title in 2014. Will the post-Corona world provide a fresh start", "url": "https://www.cricbuzz.com/cricket-news/113068/the-curious-case-of-markram-a-star-in-the-making-now-for-six-years", "urlToImage": "http://www.cricbuzz.com/a/img/v1/600x400/i1/c189119/only-elgar-r-has-more-captai.jpg", "publishedAt": "2020-05-18T13:52:57Z", "content": "Only Elgar (r) has more captaincies to his credit than Markram among the leadership hopefuls. ©Getty \r\nA lot can happen in six years of a top player's career, especially in their 20s. They can find their way, lose it, rediscover it, never stray from it, or st… [+7577 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Worst complaint ever: Ben Stokes on Virat Kohli's comments on Edgbaston size at 2019 World Cup - India Today", "description": "Ben Stokes, in his book 'Ben Stokes on Fire', recalls Virat Kohli's post-match comments after India's loss to England in a group stage match in the 2019 World Cup.", "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-virat-kohli-edgbaston-worst-complaint-world-cup-2019-book-on-fire-1679303-2020-05-18", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/RTS2KALL-647x363.png?sRXjWOr95T8mmlXF2C5SU6.yNh_uaq9X", "publishedAt": "2020-05-18T13:11:48Z", "content": "England all-rounder Ben Stokes said it was weird to see Virat Kohli talking about the size of the Edgbaston cricket ground after India's 31-run defeat to England in a World Cup 2019 encounter in Birmingham.\r\nIn his book 'Ben Stokes on Fire', the World Cup-win… [+3196 chars]"}, {"source": {"id": null, "name": "Chess.com"}, "author": "Peter Doggers", "title": "Carlsen, Lagno Winners Steinitz Memorial - Chess.com", "description": "The FIDE Online Steinitz Memorial, an online blitz tournament held over the weekend, was clinched by the two reigning world blitz champions. Magnus Carlsen won the men's event with a round to spare while the women's section was won by Kateryna Lagno. Sunday a…", "url": "https://www.chess.com/news/view/carlsen-lagno-win-steinitz-memorial-chess", "urlToImage": "https://images.chesscomfiles.com/uploads/v1/news/641886.4783fdab.5000x5000o.ea650c1b7c8b.jpeg", "publishedAt": "2020-05-18T12:57:29Z", "content": "The FIDE Online Steinitz Memorial, an online blitz tournament held over the weekend, was clinched by the two reigning world blitz champions. Magnus Carlsen won the men's event with a round to spare while the women's section was won by Kateryna Lagno.\r\nSunday … [+7738 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "Anushka Sharma Calls Virat Kohli \"Jhootha\" During Instagram Live With Sunil Chhetri. Watch Video - NDTV Tamil", "description": "Sunil Chhetri couldn't stop laughing when Anushka Sharma chipped into his chat with Virat Kohli to call her husband \"jhootha\".", "url": "https://sports.ndtv.com/cricket/virat-kohli-jhootha-anushka-sharma-crashes-husbands-instagram-live-with-sunil-chhetri-watch-video-2230981", "urlToImage": "https://c.ndtvimg.com/2020-05/8hpd4me8_virat-kohli-anushka-sharma-instagram_625x300_18_May_20.jpg", "publishedAt": "2020-05-18T12:41:23Z", "content": "Virat Kohli was left stumped after his wife Anushka Sharma called him \"jhootha (liar)\" during his Instagram live session with India football captain Sunil Chhetri on Sunday. During the long conversation, Sunil Chhetri came up with a segment in which he asked … [+1080 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Hope some sort of training plan comes up: Vinesh Phogat - Hindustan Times", "description": "Vinesh remains hopeful of an official decision regarding resumption of training at some level.", "url": "https://www.hindustantimes.com/cricket/hope-some-sort-of-training-plan-comes-up-vinesh-phogat/story-Ppq6jRIeTWrkzYok0uSi3H.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/18/Pictures/authority-significant-photograph-conservative-gymnasium-merciless-wrestling_479e284a-98ff-11ea-bab9-2a7e8acfdee5.jpg", "publishedAt": "2020-05-18T12:33:00Z", "content": "Opening of stadiums and sports complexes for athletes was among the latest guidelines issued by the government on Sunday and ace wrestler Vinesh Phogat believes it had to be done sooner than later as sportspersons would otherwise start getting frustrated at h… [+3553 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "\"I have five girlfriends in my bag but only 1 in real life\" : Manish Pandey opens up about the love for... - The Cricket Times", "description": "For any batter, his or her piece of willow holds a special place in their life. And why not? It is one of the tools of their trade. There are cricketers like Steve Smith, Sachin Tendulkar and many others who are pretty meticulous about the dimensions and weig…", "url": "https://crickettimes.com/2020/05/i-have-five-girlfriends-in-my-bag-but-only-1-in-real-life-manish-pandey-opens-up-about-the-love-for-his-bats/", "urlToImage": "https://crickettimes.com/wp-content/uploads/2020/05/Manish-Pandey-Ashrita-Shetty-1.jpg", "publishedAt": "2020-05-18T12:27:02Z", "content": "For any batter, his or her piece of willow holds a special place in their life. And why not? It is one of the tools of their trade.\r\nThere are cricketers like Steve Smith, Sachin Tendulkar and many others who are pretty meticulous about the dimensions and wei… [+1946 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "RCB 0, KKR 100, MI 80 percent: How teams have fared in IPL finals over the years - India Today", "description": "While Chennai Super Kings have been consistent in reaching the finals of the Indian Premier League, they are ranked lowly-ranked when it comes to winning the percentage of teams in the finals.", "url": "https://www.indiatoday.in/sports/cricket/story/indian-premier-league-ipl-stats-winning-percentage-finals-kkr-rcb-csk-mi-1679273-2020-05-18", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/iplmicover-647x363.jpeg?aRWRGaKP69RLZjQ.cKg8w0YYNGkTNrWF", "publishedAt": "2020-05-18T11:40:51Z", "content": "Mumbai Indians and Chennai Super Kings have been two of the most dominant teams in the history of the Indian Premier League. There was a genuine buzz in the lead up to the scheduled start date of IPL 2020 as these two teams were set to resume their rivalry on… [+5208 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "\"Virat Kohli Is The Best. That's Unquestionable\": Australia Legend Salutes India Captain - NDTV Sports", "description": "Ian Chappell believes India captain Virat Kohli is unquestionably the best across the three formats.", "url": "https://sports.ndtv.com/cricket/virat-kohli-is-the-best-thats-unquestionable-australia-legend-salutes-india-skipper-2230776", "urlToImage": "https://c.ndtvimg.com/2020-03/bthb68ug_virat-kohli-afp_625x300_27_March_20.jpg", "publishedAt": "2020-05-18T11:25:40Z", "content": "Former Australian captain Ian Chappell feels India skipper Virat Kohli's penchant for playing copybook cricketing shots and his incredible fitness make him the world's best batsman across formats among the current generation of cricketers. \"Of that group (inc… [+2089 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "Rahul Dravid Expects Sense Of Hesitancy, Fear When Sport Resumes Post Coronavirus - NDTV Sports", "description": "The unexpected break in competitions could help extend the careers of a few sportspersons, according to Rahul Dravid.", "url": "https://sports.ndtv.com/cricket/rahul-dravid-expects-sense-of-hesitancy-fear-when-sport-resumes-post-coronavirus-2230420", "urlToImage": "https://c.ndtvimg.com/2020-05/929qlb5o_rahul-dravid_625x300_17_May_20.jpg", "publishedAt": "2020-05-18T11:25:27Z", "content": "Cricket legend Rahul Dravid reckons there could be \"a sense of doubt, hesitancy and fear\" initially in the minds of athletes as well as people in general when sport resumes in the post COVID-19 pandemic world. The novel coronavirus pandemic has led to either … [+3040 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "James Olley", "title": "Chelsea's Hudson-Odoi arrested on rape suspicion - sources - ESPN India", "description": "Chelsea winger Callum Hudson-Odoi was arrested on suspicion of rape in the early hours of Sunday morning.", "url": "https://www.espn.in/football/chelsea/story/4096142/chelseas-hudson-odoi-arrested-after-incident-with-woman", "urlToImage": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0313%2Fr678939_1296x729_16%2D9.jpg", "publishedAt": "2020-05-18T11:23:19Z", "content": "Chelsea winger Callum Hudson-Odoi has been arrested. Robbie Jay Barratt - AMA/Getty Images\r\nChelsea winger Callum Hudson-Odoi was arrested on suspicion of rape in the early hours of Sunday morning after police were called to his house by a woman who told poli… [+1326 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "Rob Key hospitalised after suffering a mini stroke - Cricbuzz - Cricbuzz", "description": "The former England and Kent batsman has been on air at Sky Sports chairing watch-along screenings of classic cricket matches", "url": "https://www.cricbuzz.com/cricket-news/113066/rob-key-hospitalised-after-suffering-a-mini-stroke", "urlToImage": "http://www.cricbuzz.com/a/img/v1/600x400/i1/c189118/rob-key-in-action-during-a-tes.jpg", "publishedAt": "2020-05-18T11:23:06Z", "content": "Rob Key in action during a Test against West Indies at Old Trafford in 2004. © Getty\r\nFormer England and Kent batsman Rob Key has been hospitalised after suffering a \"mini-stroke\" over the weekend, the cricketer revealed in an Instagram post on Monday (May 18… [+1305 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Playing cricket in empty stadium like marriage without bride: Akhtar - Hindustan Times", "description": "“Playing cricket in the empty stadiums may be viable and durable for cricket boards. But I do not think we can market this,” said Akhtar", "url": "https://www.hindustantimes.com/cricket/playing-cricket-in-empty-stadium-like-marriage-without-bride-akhtar/story-QX7EpwwsaKFraCdEm0WE8L.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/18/Pictures/mazak-mazak-with-harbhajan-and-shoaib-akhtar_070d4d5e-98f2-11ea-b5cf-22f71a9413fe.jpg", "publishedAt": "2020-05-18T10:48:19Z", "content": "Former Pakistan pacer Shoaib Akhtar believes playing cricket before empty stands would be without much excitement and something difficult to market.\r\nAmid the ongoing COVID-19 pandemic, many sports have resumed behind closed doors and cricket is also supposed… [+596 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindustantimes.com", "title": "‘Will think about those 20 centimetres for the next 50 years,’ Jimmy Neesham on World Cup final - Hindustan Times", "description": "New Zealand tied with England as Martin Guptill’s desperate attempt to dive back into the crease was not enough to prevent a run-out.", "url": "https://www.hindustantimes.com/cricket/will-think-about-those-20-centimetres-for-the-next-50-years-jimmy-neesham-on-world-cup-final/story-JE1I1mTOQFoTkct6I6PP2K.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/18/Pictures/_073d9cc0-98f2-11ea-bab9-2a7e8acfdee5.jpg", "publishedAt": "2020-05-18T10:48:15Z", "content": "Allrounder Jimmy Neesham recalled New Zealand’s heart-breaking Super-Over loss to England in the final of the World Cup, saying the 20-cm gap between a diving Martin Guptill’s bat and the crease will probably haunt him for the rest of his life. \r\nNeesham foun… [+2132 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "Sania Mirza As Penny From 'The Big Bang Theory' Is Winning TikTok - NDTV", "description": "Tennis star Sania Mirza has been delighting fans with hilarious TikTok videos, and her latest clip is no exception.", "url": "https://www.ndtv.com/offbeat/sania-mirza-as-penny-from-the-big-bang-theory-is-winning-tiktok-2230856", "urlToImage": "https://c.ndtvimg.com/2020-05/19q0cda_sania-mirza-tiktok-video_625x300_18_May_20.jpg", "publishedAt": "2020-05-18T10:37:52Z", "content": "Screenshots from a video shared on TikTok by Sania Mirza.\r\nTennis star Sania Mirza has been delighting fans with hilarious TikTok videos, and her latest clip is no exception. The TikTok video shows Sania Mirza taking on the role of Penny from the superhit com… [+1420 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "https://www.facebook.com/varun.khanna123", "title": "“It’s Player’s Own Responsibility” – Serbian Player Takes a Dig at Novak Djokovic’s Player Relief Fund - Essentially Sports", "description": "WTA Players' Council member Aleksandra Krunic dismissed the Player Relief Fund program proposed by Novak Djokovic to help the lower-ranked players.", "url": "https://www.essentiallysports.com/its-players-own-responsibility-serbian-player-aleksandra-krunic-takes-a-dig-at-novak-djokovic-player-relief-fund-atp-wta-tennis-news/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200518153755/PicsArt_05-18-03.37.28.jpg", "publishedAt": "2020-05-18T10:37:00Z", "content": "The President of the ATP Player Council Novak Djokovic planned a Player Relief Fund along with the seven governing bodies of tennis to financially help the lower-ranked players during the coronavirus pandemic. While the program received widespread support fro… [+2424 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Barcelona offer Rakitic to Juventus in Pjanic deal but Serie A champions are not interested - Goal India", "description": "Bundesliga is the first European soccer league to return to competition since the COVID-19 pandemic paused sports in March.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2020-05-18T09:59:00Z", "content": "More"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Can football survive without fans? Mixed reactions as Bundesliga restarts in front of empty stands - India Today", "description": "While fans from across the globe tuned in to their television sets to watch Bundesliga restart, a section of fans and experts are of the opinion that football behind closed doors is only a short-term solution.", "url": "https://www.indiatoday.in/sports/football/story/bundesliga-restart-no-fans-empty-stadiums-reaction-experts-germany-arsene-wenger-1679225-2020-05-18", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/dortmund-647x363.png?9CvWpcDjT07ERFzza7CoJBzUgkpDiGKW", "publishedAt": "2020-05-18T09:36:14Z", "content": "Top-flight football returned for the first time since the Covid-19 pandemic brought the sporting calendar to a grinding halt across the globe. The Bundesliga returned in Germany in empty stadiums as sport-starved fans got a taste of what the future of sport w… [+4744 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "New Revelations from World Military Games' Participants Hint at Covid-19 Spread in China in October - News18", "description": "Athletes Elodie Clouvel and Tagliariol claimed they contracted coronavirus in Wuhan in October during the World Military Games while Oliver Gorges said the city was a 'ghost town' then.", "url": "https://www.news18.com/news/sports/new-revelations-from-world-military-games-participants-hint-at-covid-19-spread-in-china-in-october-2625391.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/05/1589790878_elodie-clouvel.png", "publishedAt": "2020-05-18T08:54:11Z", "content": "Athletes revealing they fell ill at the World Military Games in Wuhan in October is adding to fears that the coronavirus was spreading within China months before the country accepted it to the world.\r\nAmid 10,000 competitors from over a 100 countries, many fe… [+1894 chars]"}, {"source": {"id": null, "name": "Managingmadrid.com"}, "author": "Lucas Navarrete", "title": "Real Madrid want to unite Hazard, Haaland and Mbape in 2021 - Managing Madrid", "description": "Haaland and Mbappe are on Madrid’s shortlist, according to AS. Los Blancos will likely have to save some money this summer in order to achieve their signings.", "url": "https://www.managingmadrid.com/2020/5/18/21262040/real-madrid-haaland-mbappe-news-rumors-2021", "urlToImage": "https://cdn.vox-cdn.com/thumbor/y5QVfVzCY5fTqIF2l4M1dsCkRnA=/0x0:3678x1926/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19983900/1213174530.jpg.jpg", "publishedAt": "2020-05-18T08:08:18Z", "content": "Real Madrid have set their eyes on signing both Erling Haaland and Kylian Mbappe in 2021, according to a report from AS. Los Blancos want those two players to lead their offensive line in the 2021-2022 season alongside Eden Hazard, per that same report. \r\nWhi… [+1237 chars]"}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "David Pasztor", "title": "First stage of Premier League’s Project Restart to start today - We Ain't Got No History", "description": "Five-week plan", "url": "https://weaintgotnohistory.sbnation.com/2020/5/18/21262028/first-stage-of-premier-leagues-project-restart-to-start-today-report", "urlToImage": "https://cdn.vox-cdn.com/thumbor/keSr0ZOBcEU_qRsRZcjAAyAdmMk=/0x353:5250x3102/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19894510/1216367958.jpg.jpg", "publishedAt": "2020-05-18T07:28:13Z", "content": "Its Monday, May 18, and its the first day of the rest of our football lives. Or at least for the foreseeable future of our football lives, in the time of COVID-19.\r\nToday, the Premier Leagues set to meet with all teams and is expecting to get their approval t… [+948 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Kobé Tong", "title": "Cristiano Ronaldo's greatest assists have been compiled in viral Twitter video - GIVEMESPORT", "description": "Cristiano Ronaldo's greatest assists have been compiled in viral Twitter video", "url": "https://www.givemesport.com/1569020-cristiano-ronaldos-greatest-assists-have-been-compiled-in-viral-twitter-video", "urlToImage": "https://gmsrp.cachefly.net/images/20/05/17/e087e7a8aaf24dad493c06ffcf709d86/1200.jpg", "publishedAt": "2020-05-18T06:48:24Z", "content": "Cristiano Ronaldo is always compared unfavourably to Lionel Messi in the assists department.\r\nIt often feels as though the two footballing legends are hotly debated in just about every data-set and statistic imaginable, only Messi seems to get a free pass whe… [+2427 chars]"}, {"source": {"id": null, "name": "Newsbytesapp.com"}, "author": "Parth Dhall", "title": "No training camps for contracted players: BCCI - NewsBytes", "description": "BCCI has put on hold the plans to commence skill-based training camp for the centrally contracted players", "url": "https://www.newsbytesapp.com/timeline/Sports/61160/286217/no-training-camps-for-players-bcci", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l197_25221589779086.jpg", "publishedAt": "2020-05-18T06:34:13Z", "content": "<li>The Board of Control for Cricket in India (BCCI) has put on hold the plans to commence skill-based training camps for the centrally contracted players.\r\nThe decision comes after the extension of nationwide lockdown by the BJP-led government.\r\nNotably, as … [+1663 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Sports Desk", "title": "Yuvraj Singh reveals how Andrew Flintoff inspired the six sixes moment - The Indian Express", "description": "In an Instagram Live session with Kevin Pietersen, who also was part of England's playing XI in that contest, Yuvraj Singh recalled the glorious chapter and revealed what exactly inspired the moment.", "url": "https://indianexpress.com/article/sports/cricket/yuvraj-singh-andrew-flintoff-fight-stuart-broad-six-sixes-6415234/", "urlToImage": "https://images.indianexpress.com/2020/05/flintoff-yuv-759.jpg?w=759", "publishedAt": "2020-05-18T06:28:54Z", "content": "Andrew Flintoff exchanges words with Yuvraj Singh. (Screengrab)Yuvraj Singh slamming Stuart Broad for six consecutive maximums in an over will always remain an iconic moment in the history of cricket. The episode took place in the inaugural edition of the T20… [+1865 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "Khawaja will find it difficult to return to the Test side: Ponting - Cricbuzz - Cricbuzz", "description": "The 33-year-old lost his place in the Test side during the 2019 Ashes and was subsequently overlooked for the home summer", "url": "https://www.cricbuzz.com/cricket-news/113064/khawaja-will-find-it-difficult-to-return-to-the-test-side-ponting", "urlToImage": "http://www.cricbuzz.com/a/img/v1/600x400/i1/c189113/khawaja-missed-out-on-a-centra.jpg", "publishedAt": "2020-05-18T06:25:18Z", "content": "Khawaja missed out on a central contract for the 2020-21 season © AFP\r\nRicky Ponting, the former Australia captain, believes it is difficult for Usman Khawaja to make it back to the Test team. The left-hander lost his place in the Test side during the 2019 As… [+1147 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindustantimes.com", "title": "‘Players should see commentators as garnish, we are unimportant’: Sanjay Manjrekar - Hindustan Times", "description": "Manjrekar was on the receiving end of criticism from India cricket fans after he referred to allrounder Ravindra Jadeja as “bits and pieces” cricketer during commentary in one of India’s World Cup match last year.", "url": "https://www.hindustantimes.com/cricket/players-should-see-commentators-as-garnish-we-are-unimportant-sanjay-manjrekar/story-ChMCzaZvmf9P5tp1RHvnQP.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/18/Pictures/_c6e23976-98cc-11ea-871b-70b2176894d0.jpg", "publishedAt": "2020-05-18T06:21:50Z", "content": "India cricketer-turned-commentator Sanjay Manjrekar on Sunday said that the cricketers on the field are sensitive and hence are unable to ignore the criticism made by the commentators. Speaking in an Instagram Live chat with off-spinner Ravichandran Ashwin on… [+2064 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindustantimes.com", "title": "Before Ganguly, India were a humble, polite team: Nasser Hussain explains how Sourav ‘changed Indian... - Hindustan Times", "description": "Hussain, who has played a lot of cricket against Ganguly, said the left-hander brought aggression into the game and before him India was a humble and polite team.", "url": "https://www.hindustantimes.com/cricket/before-ganguly-india-were-a-humble-polite-team-nasser-hussain-explains-how-sourav-changed-indian-cricket/story-4hArmEBw4P6eyfxPm8O3dM.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/18/Pictures/_f4acf00a-98ca-11ea-b5cf-22f71a9413fe.jpg", "publishedAt": "2020-05-18T05:59:00Z", "content": "The likes of Sunil Gavaskar, Anil Kumble, VVS Laxman, Yuvraj Singh, Harbhajan Singh have often credited former India captain and current BCCI president Sourav Gangluly for changing the face of Indian cricket. The aggression and positivity with which Ganguly l… [+2770 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Lance Klusener appointed Bangla Tigers director in Abu Dhabi T10 League - Hindustan Times", "description": "Klusener is currently serving as the head coach of Afghanistan following his appointment in September last year. Before that he was the batting coach of Zimbabwe.", "url": "https://www.hindustantimes.com/cricket/lance-klusener-appointed-bangla-tigers-director-in-abu-dhabi-t10-league/story-MtL6PCAQpx0r7rk1dj7IXP.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/18/Pictures/south-africa-training-session_26148202-98c1-11ea-b5cf-22f71a9413fe.jpg", "publishedAt": "2020-05-18T05:41:36Z", "content": "Former South Africa all-rounder Lance Klusener has been roped in as the new team director of Bangla Tigers, a franchise of Abu Dhabi T10 cricket tournament.\r\n“Bangla Tigers is working on to make the team one of strongest in the tournament and for this reason … [+926 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindistantimes.com", "title": "‘They’ve been phenomenal,’: Gautam Gambhir explains the reason behind Mumbai Indians’ IPL success - Hindustan Times", "description": "After making it to just one final in the first five editions, MI’s fortunes changed significantly after they appointed Rohit Sharma the captain midway through the IPL 2013, which Gambhir reckons was a tough call to make", "url": "https://www.hindustantimes.com/cricket/they-ve-been-phenomenal-gautam-gambhir-explains-the-reason-behind-mumbai-indians-ipl-success/story-If129UuPPOMEV5RDWsTfqO.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/18/Pictures/ipl-10-final_0c715c1a-98be-11ea-b5cf-22f71a9413fe.jpg", "publishedAt": "2020-05-18T04:23:24Z", "content": "Gautam Gambhir has credited Mumbai Indians’ IPL dominance to the fact that the franchise has not shied away from making the tough calls when needed. Gambhir said the reason MI has become a strong IPL side is because the management has always been able to diff… [+1395 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Sports Desk", "title": "‘Wanted to play vs CSK’: Sreesanth responds to claims he abused Rahul Dravid - The Indian Express", "description": "Paddy Upton had claimed that Sreesanth had an extraordinary outburst against Dravid after being dropped for a match - a few days before being arrested for match-fixing. Sreesanth says he never abused Dravid and that he just wanted to play against CSK.", "url": "https://indianexpress.com/article/sports/cricket/sreesanth-abused-rahul-dravid-wanted-to-play-csk-6413131/", "urlToImage": "https://images.indianexpress.com/2020/05/Sreesanth-759.jpg?w=759", "publishedAt": "2020-05-18T03:42:34Z", "content": "Sreesanth says he asked the Rajasthan Royals team management in 2013 why he was not being played against CSK when he had taken MS Dhoni’s wicket in Durban. (File Photo/BCCI)Responding to claims that Sreesanthabused Rahul Dravid and Paddy Upton in public for b… [+2074 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "NBA Insiders", "title": "How 'The Last Dance' changed the way we think about Michael Jordan - ESPN India", "description": "What will be the legacy of \"The Last Dance\"? Our NBA experts weigh in.", "url": "https://www.espn.in/nba/story/_/id/29180240/how-last-dance-changed-way-think-michael-jordan", "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0516%2Fr699226_1296x729_16%2D9.jpg", "publishedAt": "2020-05-18T03:04:27Z", "content": "What will be the legacy of \"The Last Dance\"? ESPN's 10-part documentary series about Michael Jordan and the 1990s Chicago Bulls concluded on Sunday night, offering unprecedented access to one of the greatest dynasties and players of all time. With the NBA sea… [+17023 chars]"}, {"source": {"id": null, "name": "Dawn.com"}, "author": "AFP", "title": "German football champs return to action as deaths decline in Spain, UK - DAWN.com", "description": "Infections, however, continue to surge outside Europe.", "url": "https://www.dawn.com/news/1557916", "urlToImage": "https://i.dawn.com/large/2020/05/5ec200739c067.jpg", "publishedAt": "2020-05-18T02:05:10Z", "content": "BERLIN: German football champions Bayern Munich kicked off their first match in more than two months on Sunday as Spain and Britain recorded their lowest daily coronavirus death tolls since March, but the devastating pandemic remained on the march elsewhere. … [+4890 chars]"}, {"source": {"id": null, "name": "Bavarianfootballworks.com"}, "author": "TomAdams71", "title": "Karl-Heinz Rummenigge irritated by DFB president Fritz Keller’s comments about players being too “pretentious” - Bavarian Football Works", "description": "Rummenigge did not take too kindly to Keller’s comments and fired back at the DFB as a whole.", "url": "https://www.bavarianfootballworks.com/2020/5/18/21261869/karl-heinz-rummenigge-criticizes-dfb-president-fritz-keller-comments-interview-spiegel-bayern-munich", "urlToImage": "https://cdn.vox-cdn.com/thumbor/bIXNwx3fXqowmG7cJkwA7adA_rs=/0x0:5497x2878/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19983549/1212217741.jpg.jpg", "publishedAt": "2020-05-18T01:39:47Z", "content": "Bayern Munich picked up right where they left off before the corona crisis with a routine 2-0 win over Union Berlin as the Bundesliga resumed this weekend. The absence of fans is a bizarre reality that took some getting used to, but competitive football is ba… [+2126 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Salah's agent rejects Real Madrid claim made by former assistant coach - Goal India", "description": "Bundesliga is the first European soccer league to return to competition since the COVID-19 pandemic paused sports in March.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2020-05-18T01:12:00Z", "content": "More"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'Bundesliga is the example to follow' - La Liga chief Tebas offers congratulations after season restart - Goal", "description": "Bundesliga is the first European soccer league to return to competition since the COVID-19 pandemic paused sports in March.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2020-05-18T00:18:46Z", "content": "More"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'Ferguson killed me!' - Nani was 'scared' of Man Utd boss - Goal India", "description": "Bundesliga is the first European soccer league to return to competition since the COVID-19 pandemic paused sports in March.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2020-05-17T21:31:40Z", "content": "More"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindustantimes.com | Edited by Saumya Sharma", "title": "Michael Jordan’s sneakers fetch record $560,000 at Sotheby’s - Hindustan Times", "description": "A game-worn pair of Nike sneakers from Michael Jordan’s glory days sold for a record $560,000 -- almost four times the initial estimate for the autographed shoes, Sotheby’s said.", "url": "https://www.hindustantimes.com/art-and-culture/michael-jordan-s-sneakers-fetch-record-560-000-at-sotheby-s/story-h13JlxagdK1wYQBGwvpEhK.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/18/Pictures/_984cc89e-987a-11ea-a091-8eb61e4add3b.JPG", "publishedAt": "2020-05-17T21:19:25Z", "content": "A game-worn pair of Nike sneakers from Michael Jordan’s glory days sold for a record $560,000 -- almost four times the initial estimate for the autographed shoes, Sotheby’s said.\r\nBidding for the “Air Jordan 1s,” custom-made for the Hall of Famer in sizes 13 … [+1623 chars]"}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "TrustMeI'mLying., David Pasztor", "title": "Project Restart unknowns could force further Premier League delays - We Ain't Got No History", "description": "The wait keeps getting longer", "url": "https://weaintgotnohistory.sbnation.com/2020/5/17/21261591/project-restart-unknowns-could-force-further-premier-league-delays-report", "urlToImage": "https://cdn.vox-cdn.com/thumbor/lwi-dNW3I_vP-NsuUf2QoAsxSC4=/0x132:5330x2923/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19962205/1223633673.jpg.jpg", "publishedAt": "2020-05-17T20:04:30Z", "content": "The Bundesliga has already come back to life this weekend, but the Premier Leagues restart is still more than a month away. \r\nUnfortunately, according to the Mirror, even that could be pushed back and thats on top of the expected one-week delay from the initi… [+1707 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "Football But Not As We Know It: Odd Sights From Bundesliga Comeback - NDTV Sports", "description": "Bundesliga became the first top football league to resume play since the coronavirus pandemic forced the season to be put on hold in March.", "url": "https://sports.ndtv.com/football/football-but-not-as-we-know-it-odd-sights-from-bundesliga-comeback-2230112", "urlToImage": "https://c.ndtvimg.com/2020-05/64tk3tt4_bundesliga-balls-disinfected-afp_625x300_17_May_20.jpg", "publishedAt": "2020-05-17T19:27:34Z", "content": "Germany gave football-starved fans reason to be cheerful on Saturday with the Bundesliga's return to action behind closed doors, on a day in which Borussia Dortmund hammered local rivals Schalke in an echoing Signal Iduna Park. Borussia Dortmund's coach and c… [+4506 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Mahalakshmi Murali", "title": "“Now Revenue Has Gone to Basically Zero” – Roger Federer’s Personal Stringer - Essentially Sports", "description": "For the last 15-years, Ron Yu has been stringing Roger Federer’s racquets. With no tennis happening his source of income has been majorly affected.", "url": "https://www.essentiallysports.com/tennis-news-atp-now-revenue-has-gone-to-basically-zero-roger-federers-personal-stringer/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200518002812/Screenshot-2020-05-17-at-8.56.54-PM.png", "publishedAt": "2020-05-17T19:16:00Z", "content": "By the time the 20-time Grand Slam champion gets on-board to the tennis court, it has already been a long day for 52-year-old Ron Yu, who is his personal racquet stringer. For the last 15-years, Yu has been stringing Roger Federer‘s racquets. He wakes up at 4… [+2652 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "Sri Lanka eye new 40000 seater stadium in Homagama - Cricbuzz - Cricbuzz", "description": "Mahela Jayawardene expressed his surprise at this need of a new cricketing facility", "url": "https://www.cricbuzz.com/cricket-news/113063/sri-lanka-eye-new-40000-seater-stadium-in-homagama", "urlToImage": "http://www.cricbuzz.com/a/img/v1/600x400/i1/c171648/representational-image-sri-la.jpg", "publishedAt": "2020-05-17T16:58:07Z", "content": "Representational Image: Sri Lanka Cricket Team © Getty\r\nThe Sri Lankan government, in collaboration with Sri Lanka Cricket, is aiming to build a 40,000-capacity stadium in Homagama, it was announced on Sunday. This will be the largest cricket ground in Sri La… [+2267 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "‘He’s taken some fantastic catches,’ Jonty Rhodes picks India allrounder to be one of his favourite... - Hindustan Times", "description": "Rhodes also lavished praise on 2011 ODI World Cup winner Raina, who himself is one of the finest fielders India has produced.", "url": "https://www.hindustantimes.com/cricket/he-s-taken-some-fantastic-catches-jonty-rhodes-picks-india-allrounder-to-be-one-of-his-favourite-fielders/story-rC9CfCwItmeE5IwJbd0uZN.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/17/Pictures/_ce90a8b6-985d-11ea-a091-8eb61e4add3b.jpg", "publishedAt": "2020-05-17T16:56:00Z", "content": "South African fielding great Jonty Rhodes on Sunday rated Ravindra Jadeja among the best fielders in the world, saying the Indian allrounder has great commitment and anticipation skill.\r\n“Jaddu has taken some fantastic catches. The key is he is very committed… [+1778 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Dhruv George", "title": "McLaren CEO Tips Daniel Ricciardo to be Able to Win a Championship Immediately - Essentially Sports", "description": "Following Carlos Sainz' 2021 Ferrari recruitment, McLaren brought in Daniel Ricciardo to succeed him. According to CEO Zak Brown...", "url": "https://www.essentiallysports.com/f1-news-mclaren-ceo-tips-daniel-ricciardo-to-be-able-to-win-a-championship-immediately/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200512155318/dr1-6.jpg", "publishedAt": "2020-05-17T16:48:00Z", "content": "Following Carlos Sainz‘ 2021 Ferrari recruitment, McLaren brought in Daniel Ricciardo to succeed him. According to CEO Zak Brown, the Australian has that capacity to immediately be World Champion if he has the right car.\r\nWhen Sebastian Vettel announced that … [+1928 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindustantimes.com", "title": "Sports stadiums, complexes allowed to reopen under new lockdown guidelines - Hindustan Times", "description": "Under the new guidelines, sports stadiums and complexes will be allowed to open across the country.", "url": "https://www.hindustantimes.com/sports/sports-stadiums-complexes-allowed-to-reopen-under-new-guidelines/story-TWx3LDO1JZe2Uj42RLHaHO.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/17/Pictures/_35082d24-984c-11ea-b40c-d7c2b81d84c3.jpg", "publishedAt": "2020-05-17T16:05:00Z", "content": "The Ministry of Home Affairs on Sunday announced that stadiums across the country are allowed to open but will see no gathering of crowd. The relaxation is part of the fourth phase of the nation-wide lockdown due to the COVID-19, and could potentially lead to… [+1711 chars]"}, {"source": {"id": null, "name": "Everythingbarca.com"}, "author": "Atharva Khadilkar", "title": "Quique Setien and Josep Maria Bartomeu plan to shut Lionel Messi’s dominance - Everything Barca", "description": "Barcelona manager Quique Setien has displayed resentment against Lionel Messi by raising issues against the forward with the board of directors. Lionel Mes...", "url": "https://everythingbarca.com/2020/05/17/quique-setien-josep-maria-bartomeu-plan-shut-lionel-messi/", "urlToImage": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Feverythingbarca.com%2Fwp-content%2Fuploads%2Fgetty-images%2F2016%2F04%2F1196292269.jpeg", "publishedAt": "2020-05-17T15:47:36Z", "content": "Lionel Messi was once again in the media, this time after very long, following his interview wherein he stated that Barcelona will not be able to win the UEFA Champions League this year either. The Argentina international was critical of the club in the candi… [+2605 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "Hardik Pandya Shares Karaoke Video, Fiancee Natasa Stankovic Comes Up With Cute Reply - NDTV Khabar", "description": "Hardik Pandya delighted his fans on Instagram with a \"lockdown special\" karaoke video, in which he can be heard singing 'Teri Mitti' from Bollywood film Kesari.", "url": "https://sports.ndtv.com/cricket/hardik-pandya-shares-karaoke-video-fiancee-natasa-stankovic-comes-up-with-cute-reply-2230411", "urlToImage": "https://c.ndtvimg.com/2020-05/nne6dea8_hardik-pandya-instagram_625x300_17_May_20.jpg", "publishedAt": "2020-05-17T15:35:22Z", "content": "Hardik Pandya delighted his fans on Instagram with a \"lockdown special\" karaoke video, in which he can be heard singing 'Teri Mitti' from Bollywood film Kesari along with his cricketer brother Krunal. \"#PandyaBrothers karaoke time. lockdown special @krunalpan… [+1506 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "Lockdown 4.0 Guidelines: MHA Allows Sports Complexes, Stadiums To Open And Restart Training of Athletes - ABP Live", "description": "Lockdown 4.0 Guidelines - Ministry of Home Affairs permitted sports complexes to open in the fourth phase of the coronavirus-forced lockdown,", "url": "https://news.abplive.com/news/lockdown-4-0-mha-allows-sports-complexes-stadiums-to-open-and-restart-training-of-athletes-1237105", "urlToImage": "https://static.abplive.com/wp-content/uploads/2020/05/18020405/lockdown-stadium-afp.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2020-05-17T15:05:22Z", "content": "Lockdown 4.0 guidelines: Ministry of Home Affairs on Sunday allowed Sports Complexes to resume in order to restart the training of athletes which came to a halt in mid-March due the nationwide lockdown enforced in wake of coronavirus.The development has come … [+2995 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "T20 WC postponement could pave the way for IPL: Mark Taylor - Cricbuzz - Cricbuzz", "description": "The IPL and India's tour of Australia will significantly influence Cricket's roadmap out of the COVID-19 crisis", "url": "https://www.cricbuzz.com/cricket-news/113061/t20-world-cup-postponement-could-pave-the-way-for-ipl-mark-taylor", "urlToImage": "http://www.cricbuzz.com/a/img/v1/600x400/i1/c189110/i-have-no-doubt-that-ca-will-n.jpg", "publishedAt": "2020-05-17T12:52:40Z", "content": "I have no doubt that CA will now be thinking about IPL and maybe not the T20 World Cup - Mark Taylor © Getty\r\nFormer Australia captain Mark Taylor has acknowledged the increased likelihood of cricket seeing a late IPL in 2020 as opposed to the men's T20 World… [+3819 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Rishi Karthikeyan", "title": "“Alexander Zverev and Stefanos Tsitsipas Hate Each Other” – Nick Kyrgios Bashes European Players - Essentially Sports", "description": "Nick kyrgios said a lot of things in his chat with Andy Murray especially about the European players at the Laver Cup. Check it out.", "url": "https://www.essentiallysports.com/alexander-zverev-and-stefanos-tsitsipas-hate-each-other-nick-kyrgios-bashes-european-players-atp-tennis-news/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200517172948/TELEMMGLPICT000210819820_transpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08-504x315.jpeg", "publishedAt": "2020-05-17T12:03:00Z", "content": "As we have seen in the last few weeks, many tennis players have been hosting live chats with others. Many people have been enjoying this which is why Andy Murray and Nick Kyrgios decided to do one. Check out some of the interesting things that were said in th… [+1576 chars]"}, {"source": {"id": null, "name": "Newsbytesapp.com"}, "author": "Parth Dhall", "title": "When MS Dhoni missed a chance to stump Sabbir Rahman - NewsBytes", "description": "Sabbir Rahman described the incident from 2019 World Cup, when Indian legend Mahendra Singh Dhoni missed a chance to stump him", "url": "https://www.newsbytesapp.com/timeline/Sports/61141/286113/sabbir-rahman-opens-up-on-dhoni-s-stumping", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l197_6611589714893.jpg", "publishedAt": "2020-05-17T11:50:55Z", "content": "<li>Bangladesh batsman Sabbir Rahman described the incident from 2019 World Cup, when Indian legend Mahendra Singh Dhoni missed a chance to stump him.\r\nSpeaking in a Facebook Live session, he opened up on how the former Indian skipper outfoxed him in the Worl… [+1758 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindustantimes.com", "title": "‘Not much emphasis on world events,’ Ravi Shastri picks series he thinks should restart cricket - Hindustan Times", "description": "Shastri suggested resumption of  the game by taking one step at a time if and when the authorities give the go-ahead.", "url": "https://www.hindustantimes.com/cricket/not-much-emphasis-on-world-events-ravi-shastri-picks-series-he-thinks-should-restart-cricket/story-uZ3otqGjFA2TnEZwNEHUMO.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/17/Pictures/_cab4d006-9825-11ea-a968-2ed746e9a968.jpg", "publishedAt": "2020-05-17T11:24:00Z", "content": "India head coach Ravi Shastri believes that should cricket resume, bilateral/domestic series should take precedence over ICC or other international events so that it allows players to gain some momentum upon their return to top-flight cricket.\r\nShastri’s comm… [+2101 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindustantimes.com", "title": "Can assure RCB will be ready: Mike Hesson hopeful of IPL taking place - Hindustan Times", "description": "The IPL, which was originally scheduled to be held from March 29 to May 24, was indefinitely postponed by the BCCI due to the outbreak of the novel coronavirus in India and subsequent lockdown announced by the government.", "url": "https://www.hindustantimes.com/cricket/can-assure-rcb-will-be-ready-mike-hesson-hopeful-of-ipl-taking-place/story-IYytdvtA8MwKsr1CWYtXbJ.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/17/Pictures/new-zealand-v-west-indies-1st-t20_ab6bdec2-981d-11ea-a968-2ed746e9a968.jpg", "publishedAt": "2020-05-17T09:52:25Z", "content": "The Indian Premier League was cancelled by the government of India as the situation regarding the Covid-19 pandemic was still developing in the country. The league was originally supposed to take place at the end of March but was postponed indefinitely due to… [+1670 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "https://www.facebook.com/profile.php?id=100009654009663", "title": "“It is a Good Marketing Story”: Toto Wolff Reacts on the Possibility of Sebastian Vettel Joining Lewis Hamilton at Mercedes for 2021 - Essentially Sports", "description": "Toto Wolff says that Sebastian Vettel is an awesome F1 driver. He says that the potential arrival of the driver will be a marketing story for Mercedes.", "url": "https://www.essentiallysports.com/f1-news-it-is-a-good-marketing-story-toto-wolff-reacts-on-the-possibility-of-sebastian-vettel-joining-lewis-hamilton-at-mercedes-for-2021/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200517133026/sv-12.jpg", "publishedAt": "2020-05-17T09:11:00Z", "content": "Four-time title-holder Sebastian Vettel will leave Ferrari toward the finish of the 2020 season. It comes as Vettel failed to secure the Championship since joining the Italian group in 2015. Carlos Sainz will replace him after the 2020 season. He will pair up… [+1898 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Was Steyn Close to Dismissing Tendulkar in 190s as he Claims During Gwalior Double Ton? Not Really - News18", "description": "As it turns out, the events mentioned by Steyn, never transpired on the field. In fact, Steyn bowled only three deliveries at Tendulkar, when the latter was in his 190s, in the 47th over.", "url": "https://www.news18.com/cricketnext/news/was-dale-steyn-close-to-dismissing-sachin-tendulkar-in-190s-as-he-claims-during-gwalior-double-ton-not-really-2623671.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/05/1589696840_steyn-759.jpg", "publishedAt": "2020-05-17T09:07:28Z", "content": "On Saturday, South Africa fast bowler Dale Steyn created quite a stir in the cricketing world, when he accused umpire Ian Gould of not ruling Sachin Tendulkar out LBW when he was in his 190s, in the iconic match at Gwalior.\r\n\"Tendulkar scored the first double… [+1652 chars]"}, {"source": {"id": null, "name": "Gqindia.com"}, "author": "Yash Bharati", "title": "Take a tour of Rohit Sharma’s luxurious ₹30 crore apartment in Mumbai - GQ India", "description": "The apartment offers a 270º view of the Arabian Sea", "url": "https://www.gqindia.com/live-well/content/rohit-sharma-rs-30-crore-apartment-in-mumbai", "urlToImage": "https://assets.gqindia.com/photos/5ebced1ef56081a5baf7a138/16:9/w_1920,c_limit/Rohit-Sharma.jpg", "publishedAt": "2020-05-17T08:04:59Z", "content": "The vice-captain of the Indian cricket team and captain of IPL outfit Mumbai Indians, Rohit Sharma has set base in a splendid apartment in Worli, Mumbai. According to a report in The Economic Times, the cricketer made this real estate investment back in 2017,… [+1756 chars]"}, {"source": {"id": null, "name": "Sportscafe.in"}, "author": "SportsCafe Desk", "title": "Sunil Gavaskar picks combined India-Pakistan XI; no place for Rahul Dravid and MS Dhoni - SportsCafe", "description": "Legendary Indian cricketer Sunil Gavaskar has picked his combined India-Pakistan XI and has made some surprising choices, including picking Virender Sehwag to open, whilst omitting both Dravid and Dhoni. Gavaskar’s XI features five Indians, including Sachin, …", "url": "https://sportscafe.in/cricket/articles/2020/may/17/sunil-gavaskar-picks-combined-india-pakistan-xi-no-place-for-rahul-dravid-and-ms-dhoni", "urlToImage": "https://cdn-images.spcafe.in/img/es3-cfill-w800-h418/articles/Cricket_1/Sunil_Gavaskar_news_batting_cricket_Getty.jpg", "publishedAt": "2020-05-17T07:36:59Z", "content": "Legendary Indian cricketer Sunil Gavaskar has picked his combined India-Pakistan XI and has made some surprising choices, including picking Virender Sehwag to open, whilst omitting both Dravid and Dhoni. Gavaskars XI features five Indians, including Sachin, K… [+1699 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Anirudh Singh", "title": "'Don't know when Izhaan will be able to see his father again' : Sania Mirza leaves family reunion to... - The Cricket Times", "description": "The novel coronavirus pandemic induced lockdown has thrown the healthy life of many people out of gear and power couple - Sania Mirza and Shoaib Malik - is no exception. Sania, the Indian Tennis ace, and her husband - former Pakistan cricket team skipper Shoa…", "url": "https://crickettimes.com/2020/05/dont-know-when-izhaan-will-be-able-to-see-his-father-again-sania-mirza-leaves-family-reunion-to-fate/", "urlToImage": "https://crickettimes.com/wp-content/uploads/2020/05/Sania-Mirza-Izhaan-Shoaib-Malik.jpg", "publishedAt": "2020-05-17T07:36:12Z", "content": "The novel coronavirus pandemic induced lockdown has thrown the healthy life of many people out of gear and power couple – Sania Mirza and Shoaib Malik – is no exception.\r\nSania, the Indian Tennis ace, and her husband – former Pakistan cricket team skipper Sho… [+1674 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Sports Desk", "title": "Went looking for Harbhajan Singh in hotel room to fight with him: Shoaib Akhtar - The Indian Express", "description": "Shoaib Akhtar speaks about the time he had gone to look for Harbhajan Singh in a Sri Lanka hotel to take revenge for what happened on the cricket field.", "url": "https://indianexpress.com/article/sports/cricket/shoaib-akhtar-harbhajan-singh-fight-hotel-room-6412859/", "urlToImage": "https://images.indianexpress.com/2016/07/harbhajan_shoaib-akhtar-m.jpg?w=759", "publishedAt": "2020-05-17T06:57:21Z", "content": "Harbhajan Singh and Shoaib Akhtar had a blistering individual duel in the 2010 Asia Cup match. (File Photo/AP)Shoaib Akhtar threw some light on the incident from 2010 when he had threatened to beat Harbhajan Singh, saying he had gone to look for the India spi… [+2159 chars]"}, {"source": {"id": null, "name": "Tribuneindia.com"}, "author": "Tribune India", "title": "Sachin Tendulkar adds a twist to Yuvraj Singh's challenge - The Tribune India", "description": "", "url": "https://www.tribuneindia.com/news/sports/sachin-tendulkar-adds-a-twist-to-yuvraj-singhs-challenge-85975", "urlToImage": "https://cms.tribuneindia.com/gallary_content/2020/5/2020_5$largeimg_1291143980.jpg", "publishedAt": "2020-05-17T05:31:53Z", "content": "Tribune Web Desk\r\nChandigarh, May 17\r\nCricket legend Sachin Tendulkar doesn't shy away from a challenge. So when former India all-rounder Yuvraj Singh challenged him as part of the '#KeepItUp challenge', Tendulkar not only completed the task but added a twist… [+1220 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Pakistan to tour England in July, matches to be played in bio-secure environment - India Today", "description": "Pakistan would tour England in July for 3 Tests and 3 T20Is that will be played behind closed doors at grounds that have hotels inside the ground.", "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-to-play-england-in-july-in-bio-secure-environment-pcb-agrees-1678899-2020-05-17", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/PAk_cricket-647x363.png?Xt5LhfVbHKL5MrT72eN4K5Bvj3xzEXqy", "publishedAt": "2020-05-17T05:17:58Z", "content": "Pakistan is all set to tour England in July to play three Tests and three T20 internationals in a bio-secure environment with the PCB giving its approval to their English counterparts during a video link meeting on Friday.\r\nPakistan Cricket Board chief execut… [+2235 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "David Warner Channels His Inner Baahubali in Video with Daughter, Prabhas Fans Overjoyed - News18", "description": "David Warner's new 'Baahubali' inspired video has left Prabhas fans gushing over the Australian cricketer.", "url": "https://www.news18.com/news/movies/david-warner-channels-his-inner-baahubali-in-video-with-daughter-prabhas-fans-overjoyed-2623573.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/05/1589690627_david-warner.jpg", "publishedAt": "2020-05-17T04:57:27Z", "content": "Australian cricketer David Warner seems to be taking his love for TikTok videos and South Indian cinema to new heights each day. After grooving to a couple of chartburster Allu Arjun songs, David now features in a clip inspired by blockbuster Baahubali, featu… [+609 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindustantimes.com", "title": "‘He likes spotlight’: Kesrick Williams responds to Kevin Pietersen’s ‘not good enough’ remark - Hindustan Times", "description": "Now, the West Indies fast bowler has opened up on Pietersen’s remarks and said that the former England cricketer enjoys being in the spotlight", "url": "https://www.hindustantimes.com/cricket/he-likes-spotlight-kesrick-williams-responds-to-kevin-pietersen-s-not-good-enough-remark/story-TMY5x5flzI8OJ7znO1BXfM.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/17/Pictures/_7a47fe1e-97f7-11ea-b40c-d7c2b81d84c3.jpg", "publishedAt": "2020-05-17T04:46:00Z", "content": "West Indies pacer Kesrick Williams became a popular name last year in December after his on-field battles with India captain Virat Kohli. With the Indian Premier League auctions around the corner, former India captain Sanjay Manjrekar tweeted that Williams sh… [+2157 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindustantimes.com", "title": "I knew if MS Dhoni is playing, I won’t get to play: Saha on how he made most of opportunities - Hindustan Times", "description": "Saha, in a recent interview, said that he started playing frequently for the team after Dhoni’s retirement from the longest format in 2014.", "url": "https://www.hindustantimes.com/cricket/i-knew-if-ms-dhoni-is-playing-i-won-t-get-to-play-saha-on-how-he-made-most-of-opportunities/story-dNsyoHx7aTE1ENqcEBQ3iK.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/17/Pictures/_382a2702-97f0-11ea-b40c-d7c2b81d84c3.jpg", "publishedAt": "2020-05-17T04:15:47Z", "content": "India wicketkeeper Wriddhiman Saha on Sunday said that he learnt the most from former India captain Mahendra Singh Dhoni, as he knew that he will not be included in the team till Dhoni is in the team. It comes off as a little surprise that the two keepers hav… [+1997 chars]"}, {"source": {"id": null, "name": "Dawn.com"}, "author": "AFP", "title": "Gayle regrets Sarwan virus comments - DAWN.com", "description": "Says his description of former West Indies team-mate Ramnaresh Sarwan as ‘worse than the coronavirus’ were ‘damaging’.", "url": "https://www.dawn.com/news/1557670", "urlToImage": "https://i.dawn.com/large/2020/05/5ec0cd0435a8d.png", "publishedAt": "2020-05-17T03:45:00Z", "content": "LONDON: Flamboyant batsman Chris Gayle said on Friday he stood by his comments over feelings of resentment at his exit from the Jamaica Tallawahs team in the Caribbean Premier League. \r\nHowever, he admitted that his description of former West Indies team-mate… [+2133 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindustantimes.com", "title": "‘Of course there is pressure’: Ahmed Shehzad on comparisons with Virat Kohli - Hindustan Times", "description": "Shehzad and Kohli came through the ranks at nearly the same time, and this may surprise you, but the Pakistan opener had a better start to Test cricket as compared to Kohli.", "url": "https://www.hindustantimes.com/cricket/of-course-there-is-pressure-ahmed-shehzad-on-comparisons-with-virat-kohli/story-C5mKrl75RDZlQLIR37XE4L.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/17/Pictures/_b0c8f7f0-97e7-11ea-a968-2ed746e9a968.jpg", "publishedAt": "2020-05-17T03:01:39Z", "content": "Ahmed Shehzad, the batsman from Pakistan has revealed it wasn’t easy for him to prosper as a batsman due to the comparison people made between him and Virat Kohli. Shehzad and Kohli came through the ranks at nearly the same time, and this may surprise you, bu… [+1746 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "Stephan Uersfeld", "title": "Bundesliga: Hertha Berlin goal celebrations will not be punished, says DFL - ESPN India", "description": "The German Football League will take no action against Hertha Berlin after the club's players celebrated their goals with physical contact Saturday.", "url": "https://www.espn.in/football/german-bundesliga/story/4095715/bundesliga-hertha-berlin-goal-celebrations-will-not-be-punishedsays-dfl", "urlToImage": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0516%2Fr699369_1296x729_16%2D9.jpg", "publishedAt": "2020-05-16T22:46:51Z", "content": "The German Football League (DFL) will take no action against Bundesliga side Hertha Berlin after the club's players celebrated their goals in the 3-0 win at Hoffenheim and challenged the league's recommendations to avoid group celebrations.\r\n- Stream new epis… [+1882 chars]"}, {"source": {"id": null, "name": "Wordlift.io"}, "author": "Chris Smith", "title": "Frankfurt 1-3 Gladbach: The 'most-hyped coach right now' (according to Klopp) leapfrog's Leipzig into third - Squawka", "description": "Borussia Monchengladbach returned to action on Saturday with a comfortable 3-1 win over Eintracht Frankfurt.  After two months off away from the pitch, you'd have forgiven Gladbach for showing signs of rustiness as they seek to close the gap on their fellow B…", "url": "http://data.wordlift.io/wl01348/post/frankfurt_1-3_gladbach__the_most-hyped_coach_right_now_according_to_klopp_leapfrogs_leipzig_into_third", "urlToImage": "https://media.squawka.com/images/en/2020/05/16191928/1142014_1142014_feature_match-result-feature-1.png", "publishedAt": "2020-05-16T18:31:58Z", "content": "Borussia Monchengladbach returned to action on Saturday with a comfortable 3-1 win over Eintracht Frankfurt. \r\nAfter two months off away from the pitch, you’d have forgiven Gladbach for showing signs of rustiness as they seek to close the gap on their fellow … [+5473 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Elliott Jackson", "title": "Five big changes to behind-closed-doors football as Premier League eagerly watch Bundesliga return - Manchester Evening News", "description": "The Bundesliga returned on Saturday and there were some less-than-subtle differences.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/five-big-changes-behind-closed-18263494", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/sport/football/article18263488.ece/ALTERNATES/s1200/1_Haaland.jpg", "publishedAt": "2020-05-16T16:18:22Z", "content": "Football is back but not quite as we all know and love it.\r\nThe Bundesliga launched its return on Saturday, with the whole world - and particularly those in the Premier League - watching on.\r\nFootball authorities will be keeping a close eye on the German game… [+2690 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Rasesh Mandani", "title": "BCCI weighs financial impact of freeze in cricket - Hindustan Times", "description": "The BCCI last week discussed the possible financial hit the cricket body would take due to cancelled matches.", "url": "https://www.hindustantimes.com/cricket/bcci-weighs-financial-impact-of-freeze-in-cricket/story-ZHk4GEvuMwS29D2xf3vThO.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/16/Pictures/_113e9b4e-978e-11ea-a091-8eb61e4add3b.jpg", "publishedAt": "2020-05-16T16:04:14Z", "content": "It is the world’s richest cricket board, but even BCCI has conceded the Covid-19 pandemic could take a toll on its finances.\r\nIts Apex Council meeting held last week discussed the possible financial hit the cricket body would take due to cancelled matches. \r\n… [+1715 chars]"}]}