{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Gaurav Gupta", "title": "IPL: Summer of discontent for young Indian cricketers - Times of India", "description": "Cricket News: Many young Indian cricketers were eager to sizzle in the IPL. However, the coronavirus outbreak and the all-India lockdown has postponed the glitzy ev", "url": "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/ipl-summer-of-discontent-for-young-indian-cricketers/articleshow/75398433.cms", "urlToImage": null, "publishedAt": "2020-04-27T04:39:24Z", "content": "Many young Indian cricketers were eager to sizzle in the IPL. However, the coronavirus outbreak and the all-India lockdown has postponed the glitzy event indefinitely.\r\nTOI spoke to four such talented 'wonderkids,' to find out how they're coping with it and k… [+6850 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "His graph went up & mine went down, but friendship is intact: Former India pacer on MS Dhoni - Hindustan Times", "description": "During his playing days, he developed a strong friendship with Mahendra Singh Dhoni and the two share a bond even now.", "url": "https://www.hindustantimes.com/cricket/his-graph-went-up-mine-went-down-but-friendship-is-intact-former-india-pacer-on-ms-dhoni/story-vY4D2VOTe6L8xZmwZYYAwI.html", "urlToImage": null, "publishedAt": "2020-04-27T04:17:13Z", "content": "Former India paceman RP Singh had a great start to his international career and was even part of the team that won the 2007 ICC World T20. The left-arm paceman though failed to fulfil the early promise he showed, although he continued to perform well in the d… [+1293 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Kohli or Tendulkar? Yuvraj or Dhoni? Yuvraj Singh corners Jasprit Bumrah with rapid-fire questions - India Today", "description": "It was Jasprit Bumrah’s turn to duck bouncers as he was cornered with some ‘tricky’ rapid-fire questions during an Instagram live session with World Cup-winning all-rounder Yuvraj Singh.", "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-yuvarj-singh-instagram-live-rapid-fire-session-virat-kohli-or-sachin-tendulkar-1671494-2020-04-27", "urlToImage": null, "publishedAt": "2020-04-27T04:07:01Z", "content": "Yuvraj Singh revealed Jasprit Bumrah had troubled him with bouncers and yorkers from the time he saw him as a budding fast bowler at the nets in Mumbai but on Sunday, it was the former India all-rounders time to corner Bumrah. Not with his fluent batting skil… [+2935 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Have learnt a lot from Kohli’s preparation, work ethic: Vihari - Hindustan Times", "description": "On being labelled as a Test specialist, the technically sound right-hander said while he cannot change perception, he knows he has it in him to be an all-format batter.", "url": "https://www.hindustantimes.com/cricket/have-learnt-a-lot-from-kohli-s-preparation-work-ethic-vihari/story-XwMMgyvReCMzoJxC4y1P8O.html", "urlToImage": null, "publishedAt": "2020-04-27T03:08:01Z", "content": "India skipper Virat Kohli’s preparation ahead of a game and work ethic are the two takeaways for Test batsman Hanuma Vihari, he said on Sunday.\r\n“The best part of Kohli’s game is his preparation. I have learnt that from him. His work ethic is also amazing,” V… [+1461 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘He has set the bar so high’: Kane Williamson picks best batsman in world cricket - Hindustan Times", "description": "The Kiwi is known for his sharp cricketing brain and he was on an Instagram live session recently with his SRH teammate David Warner.", "url": "https://www.hindustantimes.com/cricket/he-has-set-the-bar-so-high-kane-williamson-picks-best-batsman-in-world-cricket/story-d9ZoSJyYfsPznZh9UoH1UO.html", "urlToImage": null, "publishedAt": "2020-04-27T03:07:13Z", "content": "There is no doubt about the fact that Kane Williamson is one of the nicest guys around in international cricket. It’s not just his demeanour on the pitch but off it as well, that makes him special. The New Zealand captain’s sportsman spirit and control over h… [+2049 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "'My golf substituted for the lack of cricket' - Cricbuzz - Cricbuzz", "description": "In a chat with Cricbuzz, Greg Blewett recalls how he got himself over his disgruntled retirement", "url": "https://www.cricbuzz.com/cricket-news/112939/my-golf-substituted-for-the-lack-of-cricket", "urlToImage": null, "publishedAt": "2020-04-27T01:47:31Z", "content": "Commentary, golf and coaching assignments have kept Greg Blewett busy after retirement ©Getty \r\nSuch has been the effect of COVID-19 that the world has changed overnight, forever. While this is a new sensation for many people, it's the type of reality shift t… [+8800 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Pavni Ahuja", "title": "The Real Story of the Ugly Walk Off by Bad Boys Piston on Micheal Jordan’s Chicago Bulls in 1991 - Essentially Sports", "description": "The 1991 NBA Playoffs, Detroit Pistons vs Chicago Bulls is a game to rather not forget. The Bad Boys Piston were very bad indeed.", "url": "https://www.essentiallysports.com/nba-news-the-real-story-of-the-ugly-walk-off-by-bad-boys-piston-on-micheal-jordans-chicago-bulls-in-1991/", "urlToImage": null, "publishedAt": "2020-04-27T01:04:00Z", "content": "Some of the intriguing anecdotes in the NBA remain untold stories of the past. Moreover, there are various versions to it from different players and coaches. One of the prominent incidents for the Detroit Pistons was the 1991 Eastern Conference Finals against… [+3884 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Transfer news and rumours LIVE: Newcastle in shock talks for Koulibaly - Goal India", "description": "Borussia Dortmund chief executive Hans-Joachim Watzke claimed the Bundesliga \"will go under\" if the season does not resume in the next few months.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-27T01:00:00Z", "content": "More"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Mahalakshmi Murali", "title": "“I Am Very Pessimistic” – Rafael Nadal - Essentially Sports", "description": "Rafael Nadal has been confined in his residence in Mallorca, and he is not sure about the tennis tour returning to normalcy in the near future.", "url": "https://www.essentiallysports.com/tennis-news-atp-i-am-very-pessimistic-rafael-nadal/", "urlToImage": null, "publishedAt": "2020-04-26T20:18:00Z", "content": "19-time Grand Slam champion Rafael Nadal has been confined in his residence in Mallorca, Spain and he hasnt touched a tennis racquet since Indian Wells tournaments cancelation in March. Also, his nation, Spain is one of the worst-hit areas by the coronavirus … [+1778 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Deepit Sharma", "title": "“Now, I’m Gonna Knock Him Out!”- Dominick Reyes Talks Jon Jones Rematch - Essentially Sports", "description": "Dominick Reyes is planning on coming back stronger than ever to beat Jon Jones after he lost out in the close toe-to-toe match they had in February.", "url": "https://www.essentiallysports.com/now-im-gonna-knock-him-out-dominick-reyes-talks-jon-jones-rematch-ufc-news/", "urlToImage": null, "publishedAt": "2020-04-26T19:04:00Z", "content": "Dominick Reyes shook the world when he went face-to-face with Jon “Bones” Jones. While the UFC Universe did expect Reyes to put on a spectacular show, nobody could have thought that he would give Jone Jones such a run for his money.\r\nThe two faced off in the … [+1828 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Aryan Sharma", "title": "Marat Safin And Mikhail Youzhny Troll WTA Players On Live Chat - Essentially Sports", "description": "Russian tennis star Mikhail Youzhny was live with Russian tennis star Marat Safin as he claimed that he could not name the top 10 players of WTA.", "url": "https://www.essentiallysports.com/marat-safin-and-mikhail-youzhny-troll-wta-players-on-live-chat-wta-atp-tennis-news/", "urlToImage": null, "publishedAt": "2020-04-26T17:56:00Z", "content": "The recent ATP-WTA merger idea floated by some tennis stars is a great move as per two former players in the form of Marat Safin and Mikhail Youzhny. While they certainly called the idea interesting, it was accompanied by some scathing criticism of women’s te… [+1666 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Never seen anything like that: Virat Kohli picks best shot in cricket in Instagram live with AB de ... - Hindustan Times", "description": "Virat Kohli and AB de Villiers played some scintillating strokes that day to leave the Gujarat Lions attack clueless but there was one particular shot from de Villiers which Kohli rated as the highest.", "url": "https://www.hindustantimes.com/cricket/never-seen-anything-like-that-virat-kohli-picks-the-best-shot-in-instagram-live-with-ab-de-villiers/story-8d4tdN2avaA4ZxlImptFXP.html", "urlToImage": null, "publishedAt": "2020-04-26T16:08:00Z", "content": "When Virat Kohli and AB de Villiers bat together in the IPL, more often than not fireworks follow. The duo over the years have played some memorable innings for the Royal Challengers Bangalore and most of it came when they were batting together. But none is m… [+2271 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Chartered flights and isolation: Tim Paine reveals how CA is planning to ensure India tour Australia - India Today", "description": "Australia Test team captain Tim Paine said that India's tour of Australia is financially worth somewhere around 300 million dollars and the series will help Cricket Australia (CA) solve their financial problems.", "url": "https://www.indiatoday.in/sports/cricket/story/tim-paine-india-tour-of-australia-ca-financial-issues-pay-cut-charter-plane-coronavirus-outbreak-cricket-kohli-1671402-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T15:59:56Z", "content": "It's not been long that Tim Paine, the Australian Test team captain almost gave Team India a warning of sorts and said that his current team with Steve Smith and David Warner back in it will be a 'different kettle of fish' in the upcoming Test series in Decem… [+2363 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "Sachin Tendulkar picks his five favourite all-rounders in the... - The Cricket Times", "description": "Master Blaster Sachin Tendulkar, on Saturday, hand-picked his five favourite all-rounders in the world. Sachin, who recently celebrated his 47th birthday, graced Star Sports show ‘Cricket Connected’ with his presence. In that show, he named Kapil Dev as his f…", "url": "https://crickettimes.com/2020/04/sachin-tendulkar-picks-his-five-favourite-all-rounders-in-the-world/", "urlToImage": null, "publishedAt": "2020-04-26T15:49:58Z", "content": "Master Blaster Sachin Tendulkar, on Saturday, hand-picked his five favourite all-rounders in the world. Sachin, who recently celebrated his 47th birthday, graced Star Sports show Cricket Connected with his presence. In that show, he named Kapil Dev as his fav… [+1647 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Ashwin remains India's best spinner, you can't keep him out of shorter formats: Saqlain Mushtaq - Times of India", "description": "Cricket News: Pakistan spin great Saqlain Mushtaq fails to understand how a proven performer like R Ashwin has been kept out of India's limited-overs set-up, saying", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/ashwin-remains-indias-best-spinner-you-cant-keep-him-out-of-shorter-formats-saqlain-mushtaq/articleshow/75390065.cms", "urlToImage": null, "publishedAt": "2020-04-26T15:26:18Z", "content": "NEW DELHI: Pakistan spin great Saqlain Mushtaq fails to understand how a proven performer like Ravichandran Ashwin has been kept out of India's limited-overs set-up, saying a successful Test bowler is bound to succeed in the shorter formats.\r\nAshwin, a regula… [+3975 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "James Stroud", "title": "Paul Pogba's best passes for Manchester United have been put into a video - GIVEMESPORT", "description": "Paul Pogba's best passes for Manchester United have been put into a video", "url": "https://www.givemesport.com/1565035-paul-pogbas-best-passes-for-manchester-united-have-been-put-into-a-video", "urlToImage": null, "publishedAt": "2020-04-26T14:56:14Z", "content": "Paul Pogba has had a frustrating season.\r\nThe Frenchman wound up a lot of Manchester United fans when he stated he wanted to leave last summer.\r\nBut, despite his desire to leave, United had no intention of letting him go.\r\nPogba therefore stayed at United but… [+1672 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Jofra Archer finds lost World Cup 2019 medal: Randomly searching and boom - India Today", "description": "Jofra Archer had revealed he lost his World Cup 2019 medal after moving to his new residence and that he had 'gone mad' searching for it.", "url": "https://www.indiatoday.in/sports/cricket/story/jofra-archer-finds-lost-world-cup-2019-medal-new-residence-guest-room-1671383-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T14:46:54Z", "content": "England pacer Jofra Archer revealed 'he went mad' by searching for his World Cup medal that he had lost while moving flats. However, on Sunday, Archer said he reunited with his precious medal while searching his 'guest bedroom'.\r\n\"Randomly searching the guest… [+1495 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Lockdown has made me more dedicated and taught me that we can survive without eating outside, Hima Das te - Times of India", "description": "More sports News: From crying after meeting idol Sachin Tendulkar to learning how to be more dedicated during the coronavirus lockdown, India's star sprinter Hima Das o", "url": "https://timesofindia.indiatimes.com/sports/more-sports/athletics/lockdown-has-made-me-more-dedicated-and-taught-me-that-we-can-survive-without-eating-outside-hima-das-tells-suresh-raina/articleshow/75391961.cms", "urlToImage": null, "publishedAt": "2020-04-26T14:31:03Z", "content": "NEW DELHI: From crying after meeting idol Sachin Tendulkar to learning how to be more dedicated during the coronavirus lockdown, India's star sprinter Hima Das opened up about her life in a candid chat with Indian cricketer Suresh Raina on Sunday.\r\nThe two In… [+3156 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Vinayak Manoj", "title": "Is UFC Endangering Lives By Announcing Multiple Events During a Pandemic - Essentially Sports", "description": "The UFC has revealed that it will organize UFC 249 on May 9th despite the prevalent health concens and stay-at-home orders from the government.", "url": "https://www.essentiallysports.com/ufc-coronavirus-news-is-ufc-endangering-lives-by-announcing-multiple-events-during-a-pandemic/", "urlToImage": null, "publishedAt": "2020-04-26T14:23:00Z", "content": "When it comes to sports, all major leagues have either postponed their events or canceled their season altogether. However, the UFC has been pushing to organize events relentlessly.\r\nThe Coronavirus epidemic has brought the entire world to down its knees. Eve… [+3292 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Kobé Tong", "title": "Barcelona's Lionel Messi has faced 'crazy ways' to stop him from rival players - GIVEMESPORT", "description": "Barcelona's Lionel Messi has faced 'crazy ways' to stop him from rival players", "url": "https://www.givemesport.com/1565022-barcelonas-lionel-messi-has-faced-crazy-ways-to-stop-him-from-rival-players", "urlToImage": null, "publishedAt": "2020-04-26T14:14:56Z", "content": "Lionel Messi is every defender's nightmare.\r\nSome of the greatest centre-backs to ever play the beautiful game have vouched for how near-impossible it is to stop Messi when he's at the top of his game.\r\nThere are times when the ball seems to be superglued to … [+2529 chars]"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Adnan Riaz", "title": "Neymar Breaks Down In Tears While Talking About Lionel Messi During His Barcelona Days - SPORTbible", "description": "It's safe to say that Lionel Messi has left a long, lasting impression on Paris Saint-Germain star Neymar when he was at Barcelona.", "url": "https://www.sportbible.com/football/reactions-news-neymar-breaks-down-in-tears-while-talking-about-lionel-messi-20200426", "urlToImage": null, "publishedAt": "2020-04-26T13:55:52Z", "content": "A teary-eyed Neymar spoke candidly about his time at Barcelona and the impact of Lionel Messi.\r\nThe 28-year-old Brazilian forward arrived at the Spanish club from Santos in 2013 and made 123 appearances and scored 68 times during his four-year stint at the Ca… [+1199 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "Sachin Tendulkar has his say on the fate of IPL and T20 World... - The Cricket Times", "description": "Legendary Indian batsman Sachin Tendulkar, who recently celebrated his 47th birthday, has presented the fate of the impending 2020 season of Indian Premier League (IPL) and ICC T20 World Cup this year. The cricketing world has been put on hold indefinitely du…", "url": "https://crickettimes.com/2020/04/sachin-tendulkar-has-his-say-on-the-fate-of-ipl-and-t20-world-cup/", "urlToImage": null, "publishedAt": "2020-04-26T13:48:21Z", "content": "Legendary Indian batsman Sachin Tendulkar, who recently celebrated his 47th birthday, has presented the fate of the impending 2020 season of Indian Premier League (IPL) and ICC T20 World Cup this year.\r\nThe cricketing world has been put on hold indefinitely d… [+1611 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Sports in times of COVID-19: Top Indian stars foresee new normal once pandemic mayhem ends - Times of India", "description": "More sports News: Will sports and watching sports ever be the same again in a world scarred by the COVID-19 pandemic? India's sportspersons -- current and former -- gaz", "url": "https://timesofindia.indiatimes.com/sports/more-sports/others/sports-in-times-of-covid-19-top-indian-stars-foresee-new-normal-once-pandemic-mayhem-ends/articleshow/75388631.cms", "urlToImage": null, "publishedAt": "2020-04-26T13:31:24Z", "content": "NEW DELHI: Will the fans rush back? Will training abroad be as hassle-free as it used to be? What about contact sports where social distancing can't really be practised?\r\nIn a nutshell, will sports and watching sports ever be the same again in a world scarred… [+6513 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Asian News International", "title": "Was not able to get into my domestic side as spinner: Vijay Shankar - Hindustan Times", "description": "“I was not able to get into my domestic team when I was the spinner, I used to score runs but I did not manage to get into the side. Then I started bowling medium pace, and things really changed for me,” Shankar told Warner during the Instagram Live session.", "url": "https://www.hindustantimes.com/cricket/was-not-able-to-get-into-my-domestic-side-as-spinner-vijay-shankar/story-uMtu5gSWjzmvAyqEJ3zrsO.html", "urlToImage": null, "publishedAt": "2020-04-26T12:56:04Z", "content": "All-rounder Vijay Shankar on Sunday revealed that he was not able to make it to his domestic side as a spinner and this prompted him to become a medium-pacer.\r\nShankar was doing an Instagram Live session with Australian batsman David Warner on the official ha… [+971 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Too many selfie requests and player pressure - Why Arsenal are returning to their training ground and how it will work - Goal India", "description": "Jack Wilshere has revealed he was reluctant to join Arsenal when he received an offer from the club.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T12:47:00Z", "content": "More"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "De Gea plans to stay at Manchester United for 'many years' - Goal India", "description": "Borussia Dortmund chief executive Hans-Joachim Watzke claimed the Bundesliga \"will go under\" if the season does not resume in the next few months.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T12:41:00Z", "content": "More"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "‘Humein to pata hi nahi tha’: Shikhar Dhawan hilariously trolls Cheteshwar Pujara - Hindustan Times", "description": "With no cricket being played due to coronavirus pandemic, Pujara uploaded a picture of himself batting in the nets and his post read: “The thing I miss the most in this lockdown is being on the cricket field.”", "url": "https://www.hindustantimes.com/cricket/humein-to-pata-hi-nahi-tha-shikhar-dhawan-hilariously-trolls-cheteshwar-pujara/story-wdFBZqAL032Z76ORKpmeEP.html", "urlToImage": null, "publishedAt": "2020-04-26T12:29:28Z", "content": "India opener Shikhar Dhawan hilariously trolled Test specialist Cheteshwar Pujara after the latter shared a photograph of himself on social media recently.\r\nWith no cricket being played due to coronavirus pandemic, Pujara uploaded a picture of himself batting… [+989 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Sports Desk", "title": "Boxer Dingko Singh airlifted to Delhi for cancer treatment - The Indian Express", "description": "Dingko Singh was airlifted on Saturday from Imphal to Delhi during the nationwide lockdown due to coronavirus pandemic for his liver cancer treatment.", "url": "https://indianexpress.com/article/sports/sport-others/boxer-dingko-singh-airlifted-to-delhi-for-cancer-treatment-6380046/", "urlToImage": null, "publishedAt": "2020-04-26T10:38:42Z", "content": "Dingko Singh has reached Delhi and is in the hospital for further treatment. (Source: BFI Twitter)Indian boxer Dingko Singh was airlifted on Saturday from Imphal to Delhi during the nationwide lockdown due to coronaviruspandemic for his liver cancer treatment… [+1725 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Sakshi Jain", "title": "”It will be different” – Hardik Pandya on IPL 2020 behind closed doors - Essentially Sports", "description": "In an Instagram live session with Dinesh Karthik, Hardik Pandya revealed his stand on conducting IPL behind closed doors.", "url": "https://www.essentiallysports.com/cricket-news-it-will-be-different-hardik-pandya-on-ipl-2020-behind-closed-doors/", "urlToImage": null, "publishedAt": "2020-04-26T10:30:00Z", "content": "Indian all-rounder Hardik Pandya supports the idea of conducting the Indian Premier League behind closed doors. In a live session with Dinesh Karthik, Hardik proposed the idea of conducting the tournament without the fan crowd. \r\nThe IPL 2020 was earlier sche… [+1684 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Kobé Tong", "title": "Cristiano Ronaldo: Football fan's video of Juventus 3-0 Atletico Madrid in 2019 - GIVEMESPORT", "description": "Cristiano Ronaldo: Football fan's video of Juventus 3-0 Atletico Madrid in 2019", "url": "https://www.givemesport.com/1564970-cristiano-ronaldo-football-fans-video-of-juventus-30-atletico-madrid-in-2019", "urlToImage": null, "publishedAt": "2020-04-26T10:29:08Z", "content": "Atletico Madrid fans must wake up in hot sweats thinking about Cristiano Ronaldo.\r\nAs well as being the greatest goal-scorer to ever play for their bitter rivals Real Madrid, you'd be forgiven for thinking that Ronaldo had a personal vendetta against Los Roji… [+2876 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Minamino can save Liverpool millions despite unusual start - Goal India", "description": "Borussia Dortmund chief executive Hans-Joachim Watzke claimed the Bundesliga \"will go under\" if the season does not resume in the next few months.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T10:00:00Z", "content": "More"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "https://www.facebook.com/varun.khanna123", "title": "“I Don’t See Why I Should Give Them Money” – Dominic Thiem Against Novak Djokovic’s Player Relief Fund - Essentially Sports", "description": "Dominic Thiem disagreed to contribute for the Player relief fund campaign led by Novak Djokovic to help the lower-ranked players during the coronavirus.", "url": "https://www.essentiallysports.com/i-dont-see-why-i-should-give-them-money-dominic-thiem-against-novak-djokovic-player-relief-fund-atp-tennis-news/", "urlToImage": null, "publishedAt": "2020-04-26T09:51:03Z", "content": "The governing bodies of tennis created a relief fund plan to financially help lower-level professionals during the coronavirus pandemic. The program received a lot of support from various stakeholders of the sport. However, World No.3 Dominic Thiem does not f… [+1894 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘You almost finished my son’s career,’ Yuvraj Singh recalls 2007 six sixes, reveals chat with Broad... - Hindustan Times", "description": "Yuvraj slammed six maximums in one Broad over during his majestic 14-ball 58 which ultimately proved to be the difference between the two sides as India won the match by 18 runs.", "url": "https://www.hindustantimes.com/cricket/you-almost-finished-my-son-s-career-yuvraj-singh-recalls-2007-six-sixes-reveals-chat-with-broad-senior/story-9tCJTh6ddis6UBw9JpmstJ.html", "urlToImage": null, "publishedAt": "2020-04-26T08:55:46Z", "content": "One of the most iconic moments in world cricket is Yuvraj Singh hitting Stuart Broad for six sixes in an over at the 2007 T20 World Cup. India were in a strong position in the match against England but Yuvraj propelled his country to a mammoth score with six … [+1870 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "ESPN", "title": "Coronavirus Everton appalled at Moise Kean house party - ESPN India", "description": "Everton have condemned Moise Kean after he appeared to flout coronavirus lockdown restrictions by hosting a house party.", "url": "https://www.espn.in/football/everton/story/4089204/coronavirus-everton-appalled-at-moise-kean-house-party", "urlToImage": null, "publishedAt": "2020-04-26T08:46:34Z", "content": "Everton have condemned Moise Kean after he appeared to disregard coronavirus lockdown restrictions by hosting a house party.\r\n-Stream new episodes of ESPN FC Monday-Friday on ESPN+- Stream every episode of 30 for 30: Soccer Stories on ESPN+\r\nThe striker was f… [+1523 chars]"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Gill Clark", "title": "Papers: De Ligt attentive to Barcelona, Ter Stegen on the edge - Barca Blaugranes", "description": "A look at the front pages in Spain", "url": "https://www.barcablaugranes.com/fc-barcelona-transfer-rumors-news/2020/4/26/21236769/papers-de-ligt-attentive-to-barcelona-ter-stegen-on-the-edge", "urlToImage": null, "publishedAt": "2020-04-26T08:38:04Z", "content": "Sundays front pages bring some interesting news regarding Juventus defender Matthijs de Ligt and Barcelona goalkeeper Marc-Andre ter Stegen.\r\nMundo Deportivo have the Dutchman on their front page with the headline De Ligt, Alert and a report that he is aware … [+871 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Will Tell TikTok to Block You because You're Annoying: Chris Gayle Trolls Yuzvendra Chahal - News18", "description": "Gayle referred to Chahal as 'annoying' and went on to the extent of saying that he is going to block him.", "url": "https://www.news18.com/news/buzz/will-tell-tiktok-to-block-you-because-youre-annoying-chris-gayle-trolls-yuzvendra-chahal-2593275.html", "urlToImage": null, "publishedAt": "2020-04-26T08:34:30Z", "content": "West Indies batsman Chris Gayle brutally roasted India spinner Yuzvendra Chahal for his social media posts during a live session on popular social media platform Instagram. With no cricket going due to coronavirus pandemic, players are engaging with fans thes… [+1055 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "Rob Dawson", "title": "Rafael: Man United's slump centred on flawed transfer policy - ESPN India", "description": "Rafael talks to ESPN about Manchester United's struggles after Sir Alex Ferguson retired from the game seven years ago.", "url": "https://www.espn.in/football/manchester-united/story/4088767/rafael-man-uniteds-slump-centred-on-flawed-transfer-policy", "urlToImage": null, "publishedAt": "2020-04-26T08:28:58Z", "content": "Rafael Da Silva describes himself as a \"quiet guy\" but that doesn't mean he has nothing to say. Part of Manchester United's last Premier League title-winning squad in 2013, he has watched from afar as his former club have slipped from the top of domestic and … [+6737 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "ESPN", "title": "LIVE Transfer Talk: Barcelona to swap Sergi Roberto for Juventus' Pjanic - ESPN India", "description": "Could Barcelona tempt Juventus into swapping Miralem Pjanic for Sergi Roberto? As always, Transfer Talk has the latest.", "url": "https://www.espn.in/football/soccer-transfers/story/4089180/live-transfer-talk-barcelona-to-swap-sergi-roberto-for-juventus-pjanic", "urlToImage": null, "publishedAt": "2020-04-26T08:25:35Z", "content": "The coronavirus pandemic has made the summer transfer window uncertain, but here are the new rumours floating around Europe's big leagues and beyond.\r\nTOP STORY: Juve and Barca discuss Roberto-Pjanic swap\r\nJuventus are in talks with Barcelona about several po… [+10286 chars]"}, {"source": {"id": null, "name": "Icc-cricket.com"}, "author": null, "title": "Media release ICC congratulates Sana Mir for a superb career 26 Apr 20 - International Cricket Council", "description": "The International Cricket Council (ICC) has congratulated former Pakistan captain Sana Mir for an excellent career that saw her play 226 international matches, including 137 as captain.", "url": "https://www.icc-cricket.com/media-releases/1661161", "urlToImage": null, "publishedAt": "2020-04-26T07:14:34Z", "content": "Sana, who was the first female bowler from Pakistan to take 100 ODI wickets, announced her retirement on Saturday. Her list of achievements include becoming the first from her country to top the MRF Tyres ICC Womens ODI Rankings, reaching number one in the bo… [+1139 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Anirudh Singh", "title": "R Ashwin reveals how MS Dhoni helped him to dismiss Jonathan Trott in Champion Trophy 2013... - The Cricket Times", "description": "Ravichandran Ashwin and his former India teammate Suresh Raina had a live Instagram session on Friday evening. And, the duo recalled some cherishing memories while they used to play together for Team India and Chennai Super Kings (CSK) in IPL. During the inte…", "url": "https://crickettimes.com/2020/04/r-ashwin-reveals-how-ms-dhoni-helped-him-to-dismiss-jonathan-trott-in-champion-trophy-2013-final/", "urlToImage": null, "publishedAt": "2020-04-26T05:07:40Z", "content": "Ravichandran Ashwin and his former India teammate Suresh Raina had a live Instagram session on Friday evening. And, the duo recalled some cherishing memories while they used to play together for Team India and Chennai Super Kings (CSK) in IPL.\r\nDuring the int… [+2463 chars]"}, {"source": {"id": null, "name": "Tribalfootball.com"}, "author": "Carlos Volcano", "title": "Raiola and Alfie force Real Madrid president Florentino to go cold on Haaland - Tribal Football", "description": "Real Madrid president Florentino Perez is pulling back from plans of a move for Borussia Dortmund striker Erling Haaland.Mundo Deportivo says fees that will be", "url": "https://www.tribalfootball.com/articles/raiola-and-alfie-force-real-madrid-president-florentino-to-go-cold-on-haaland-4323870", "urlToImage": null, "publishedAt": "2020-04-26T04:45:14Z", "content": "Real Madrid president Florentino Perez is pulling back from plans of a move for Borussia Dortmund striker Erling Haaland.\r\nMundo Deportivo says fees that will be owed to agent Mino Raiola along with the player's father, Alf-inge has put Madrid off from signin… [+526 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "New look inspired by heroes Viv Richards and MS Dhoni: Kapil Dev - Hindustan Times", "description": "Kapil’s bald look with a beard is also quite similar to what Richards has carried for the better part of his retired life.", "url": "https://www.hindustantimes.com/cricket/new-look-inspired-by-heroes-viv-richards-and-ms-dhoni-kapil-dev/story-iAiOxFnW2fWTZFRqVKdcHK.html", "urlToImage": null, "publishedAt": "2020-04-26T04:32:26Z", "content": "Former Indian captain Kapil Dev said that his new bald look with a beard is inspired by West Indies great Viv Richards whom he described as his hero and 2011 World Cup winning Indian captain M.S. Dhoni.\r\n“I had seen Sir Vivian Richards on your Instagram. He i… [+1093 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "David Warner shares adorable dance video with wife Candice, daughters--Watch - Zee News", "description": "Warner was set to represent Sunrisers Hyderabad in the IPL 2020, which was due to take place from March 29 but it has now been postponed indefinitely due to coronavirus.", "url": "https://zeenews.india.com/cricket/david-warner-shares-adorable-dance-video-with-wife-candice-daughters-watch-2279018.html", "urlToImage": null, "publishedAt": "2020-04-26T04:02:33Z", "content": "As all the sporting activities across the globe are currently at standstill due to coronavirus pandemic, swashbuckling Australian opener David Warner is keeping his fans entertained by constantly posting videos with his family on social media.\r\nFrom shaking l… [+1516 chars]"}, {"source": {"id": null, "name": "Cricket.com.au"}, "author": "Cricket Network", "title": "Australia offer to host England fixtures: ECB - cricket.com.au", "description": "England cricket chief confirms Australia have tabled offer to host England fixtures impacted by coronavirus pandemic", "url": "https://www.cricket.com.au/news/australia-offer-to-host-england-games-covid19-pandemic-rescheduled-cricket-world-t20-india-tests/2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T03:44:48Z", "content": "The England and Wales Cricket Board have revealed Australia and New Zealand have emerged as contenders to host matches to help England complete its season. \r\nThe ECB on Friday extended the delay to the start of its season until July 1 at the earliest, with Au… [+3630 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "ESPNcricinfo staff", "title": "Pick the readers' all-time CSK XI | ESPNcricinfo.com - ESPNcricinfo", "description": "Who would make it to your all-time Chennai Super Kings XI? | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29096845/pick-readers-all-csk-xi", "urlToImage": null, "publishedAt": "2020-04-26T02:47:31Z", "content": "Wouldn't it be fun to pick an all-time Chennai Super Kings' XI, based on player stats for the franchise? We've picked ours, now it's your turn to participate in choosing the readers' XI.\r\nThe readers' CSK XI will consist of the 11 players with the most votes,… [+405 chars]"}, {"source": {"id": null, "name": "Chessbase.com"}, "author": "", "title": "Magnus Carlsen Invitational: Nakamura in sole second place - Chessbase News", "description": "Hikaru Nakamura and Ding Liren obtained key victories in round four of the Magnus Carlsen Invitational. Nakamura took down Ian Nepomniachtchi 2½:1½, while Ding had black and drew Anish Giri in the Armageddon decider of their match-up. Nakamura is now in sole …", "url": "https://en.chessbase.com/post/magnus-carlsen-invitational-2020-r4-b", "urlToImage": null, "publishedAt": "2020-04-26T01:59:35Z", "content": "Ding wins in Armageddon\r\nThe fight to reach the final-four knockout of the Magnus Carlsen Invitational has almost completely been narrowed down to six players. Carlsen and Nakamura are favourites to qualify, while Ding and Fabiano Caruana are leading the race… [+5829 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Referee reveals why he could have sent Maradona off before 1990 World Cup final - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T01:55:00Z", "content": "More"}, {"source": {"id": null, "name": "Tennisworldusa.org"}, "author": "Dzevad Mesic", "title": "Tennis Australia chief backs Roger Federer's proposal - Tennis World USA", "description": "Federer proposed the merge of the ATP and WTA.", "url": "https://www.tennisworldusa.org/tennis/news/Roger_Federer/86858/tennis-australia-chief-backs-roger-federer-s-proposal/", "urlToImage": null, "publishedAt": "2020-04-26T01:11:52Z", "content": "Tennis Australia chief Craig Tiley backs Roger Federer's proposal to merge the men's and women's tours. On Wednesday, the Swiss suggested this could be perfect time to do some major things. \r\nJust wondering…..am I the only one thinking that now is the time fo… [+1433 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "Members question HCA move to fund clubs - Cricbuzz - Cricbuzz", "description": "The Hyderabad Cricket Association paid Rs 50,000 each to nearly 160 private clubs and district associations - amounting to Rs 80 lakh", "url": "https://www.cricbuzz.com/cricket-news/112932/members-question-hca-move-to-fund-clubs", "urlToImage": null, "publishedAt": "2020-04-26T01:08:26Z", "content": "Though some members had stated that they were not interested in the money, the HCA deposited it in their account. © Getty\r\nDefying logic, the Hyderabad Cricket Association (HCA) paid Rs 50,000 each to nearly 160 private clubs and district associations - amoun… [+2326 chars]"}, {"source": {"id": null, "name": "Espn.co.uk"}, "author": "Adrian Wojnarowski", "title": "NBA reopening team practice facilities Friday where local restrictions eased, sources say - ESPN.co.uk", "description": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.", "url": "https://www.espn.co.uk/nba/story/_/id/29099194/nba-reopening-team-practice-facilities-friday-where-local-restrictions-eased-sources-say", "urlToImage": null, "publishedAt": "2020-04-25T23:09:06Z", "content": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.\r\nPlayers can return to team facilities in states such as … [+2131 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "ESPN", "title": "Ex-Chelsea forward Costa: Conte would never last as Real Madrid boss - ESPN India", "description": "Former Chelsea forwarded Diego Costa told ESPN Brasil that he thinks Antonio Conte could never last a full season at a club like Real Madrid.", "url": "https://www.espn.in/football/chelsea/story/4088814/ex-chelsea-forward-costa-conte-would-never-last-as-real-madrid-boss", "urlToImage": null, "publishedAt": "2020-04-25T21:38:12Z", "content": "Former Chelsea forward Diego Costa told ESPN Brasil that he thinks Antonio Conte could never last a full season at a club like Real Madrid.\r\nCosta left Chelsea at the end of the 2016-17 season following a row with Conte and returned to Atletico Madrid -- the … [+2163 chars]"}, {"source": {"id": null, "name": "Trendinindia.in"}, "author": "sourav chowdhury", "title": "PV Sindhu says was desperate to win World Championships as people started calling her 'silver Sindhu' - Trendinindia", "description": "Star shuttler P V Sindhu says she was desperate to win the World Championships title final yr after a string of runner-up finishes as people started calling her \"silver Sindhu\".Sindhu, who additionally gained a silver medal within the 2016 Rio Olympics, admit…", "url": "https://trendinindia.in/pv-sindhu-says-was-desperate-to-win-world-championships-as-people-started-calling-her-silver-sindhu/", "urlToImage": null, "publishedAt": "2020-04-25T19:36:04Z", "content": "Star shuttler P V Sindhu says she was desperate to win the World Championships title final yr after a string of runner-up finishes as people started calling her “silver Sindhu”.\r\nSindhu, who additionally gained a silver medal within the 2016 Rio Olympics, adm… [+2142 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'Very doubtful' Premier League will play again in 2019-20, says Dutch FA chief - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T18:27:00Z", "content": "More"}, {"source": {"id": null, "name": "Theprideoflondon.com"}, "author": "Travis Tyler", "title": "Chelsea what ifs: Michael Ballack and Michael Essien hold up - The Pride of London", "description": "The midfield of Michael Ballack, Michael Essien, and Frank Lampard is regarded as Chelsea's best ever. What if the former two stayed healthy? Michael Essie...", "url": "https://theprideoflondon.com/2020/04/25/chelsea-ifs-michael-ballack-michael-essien-hold/", "urlToImage": null, "publishedAt": "2020-04-25T17:25:32Z", "content": "Michael Essien wins the ball back. Michael Ballack makes an inch perfect pass. Frank Lampard bangs it into the top corner. That is the stuff Chelsea dreams are made of.\r\nTechnically, the three spent four seasons together. Realistically, it was really only abo… [+2670 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Rohit Sharma picks his top 5 India batsmen of all time - Hindustan Times", "description": "Sourav Ganguly, Sachin Tendulkar, Rahul Dravid, VVS Laxman and Virender Sehwag all made the list but Rohit included the caveat that these are the players that he has seen in action.", "url": "https://www.hindustantimes.com/cricket/rohit-sharma-picks-his-top-5-india-batsmen-of-all-time/story-kPLmdYWE0Bb4VrtVrA1DOP.html", "urlToImage": null, "publishedAt": "2020-04-25T17:14:00Z", "content": "Indian cricket team batsman Rohit Sharma was asked to pick the top five India batsman and he decided to include five modern legends in his name. Sourav Ganguly, Sachin Tendulkar, Rahul Dravid, VVS Laxman and Virender Sehwag all made the list but Rohit include… [+1998 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Anirudh Singh", "title": "Actress Nidhhi Agerwal clears the air about unfollowing KL Rahul on social... - The Cricket Times", "description": "Cricketers link-up with Bollywood actresses is very commonly seen days. Even though Virat Kohli and Anushka Sharma are right now termed as the 'power couple', there is much more to that. There have been many other successful couples and sad breakups seen by c…", "url": "https://crickettimes.com/2020/04/nidhhi-agerwal-clears-the-air-about-unfollowing-kl-rahul-on-social-media/", "urlToImage": null, "publishedAt": "2020-04-25T15:03:35Z", "content": "Cricketers link-up with Bollywood actresses is very commonly seen days. Even though Virat Kohli and Anushka Sharma are right now termed as the ‘power couple’, there is much more to that.\r\nThere have been many other successful couples and sad breakups seen by … [+1428 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "Ian Chappell", "title": "My roomie 'Beatle' | ESPNcricinfo.com - ESPNcricinfo", "description": "Ian Chappell pays tribute to his first touring room-mate Graeme Watson | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29096786/my-roomie-beatle", "urlToImage": null, "publishedAt": "2020-04-25T15:03:23Z", "content": "You never forget your first touring room-mate; it's not quite a love-of-your-life remembrance but a fond recall.\r\nMy first room-mate on a five-month tour of Rhodesia (modern-day Zimbabwe) and South Africa in 1966-67 was Graeme Donald Watson. His nickname was … [+6344 chars]"}, {"source": {"id": null, "name": "Bayernstrikes.com"}, "author": "Kiran Thakare", "title": "What went wrong for Philippe Coutinho at Bayern Munich? - Bayern Strikes", "description": "Philippe Coutinho showed glimpses of his brilliance, but couldn't shine over a season for Bayern Munich. Bayern Munich delivered their biggest win of the d...", "url": "https://bayernstrikes.com/2020/04/25/philippe-coutinho-struggles-bayern-munich/", "urlToImage": null, "publishedAt": "2020-04-25T14:51:17Z", "content": "Bayern Munich delivered their biggest win of the domestic season against Werder Bremen in December. The defending champions desperately needed this victory after suffering consecutive defeats against Borussia Monchengladbach and Bayer Leverkusen.\r\nPhilippe Co… [+3550 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": "", "title": "Taipei T10 League 2020, Match 6: TCA Indians vs Taiwan Dragons – Dream11 Fantasy Cricket Tips – Playing XI, Pitch Report & Injury Update - CricTracker", "description": "Taipei T10 League 2020: Dream11 Fantasy Cricket Tips, Playing XIs, Best XIs, Yingfeng Pitch Report & Injury News for Match 6, TCA Indians vs Taiwan Dragons.", "url": "https://www.crictracker.com/taipei-t10-league-2020-match-6-tca-indians-vs-taiwan-dragons-dream11-fantasy-cricket-tips-playing-xi-pitch-report-injury-update/", "urlToImage": null, "publishedAt": "2020-04-25T13:12:49Z", "content": "Yingfeng Cricket Ground in Songshan District. (Photo Source: Twitter)\r\nMatch Details:\r\nThe 6th match of the Taipei T10 League 2020 will be played between TCA Indians and Taiwan Dragons at the Yingfeng Cricket Ground in Songshan District.\r\nThe match starts at … [+3739 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Miscreants attempt to rob stumper Saha's Siliguri home, says relative - Hindustan Times", "description": "Saha, 35, lives in South Kolkata with his wife and children. The experienced stumper’s parents, who live in their Ward No.31 Shaktigarh area house in Siliguri, are at present staying with their son in Kolkata.", "url": "https://www.hindustantimes.com/cricket/miscreants-attempt-to-rob-stumper-saha-s-siliguri-home-says-relative/story-tRusZSKZV1FBBTmYrEWIlO.html", "urlToImage": null, "publishedAt": "2020-04-25T12:04:21Z", "content": "A relative of Wriddhiman Saha has alleged that a few miscreants tried to break into the India Test wicketkeeper’s ancestral home in Siliguri, North Bengal, on Friday in a bungled attempt to rob the place.\r\nSaha, 35, lives in South Kolkata with his wife and ch… [+1344 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Three Things We Want To See From the Kobe Bryant Documentary - India Gone Viral", "description": "‘The Last Dance,’ a ten-part documentary on Michael Jordan’s final season with the Chicago Bulls was released recently. Ever since the series claimed a massive following, fans have been chirping for a", "url": "https://indiagoneviral.com/sports/2020/04/25/three-things-we-want-to-see-from-the-kobe-bryant-documentary/42125/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T12:02:27Z", "content": "The Last Dance, a ten-part documentary on Michael Jordans final season with the Chicago Bulls was released recently. Ever since the series claimed a massive following, fans have been chirping for a similar documentary to be made on the legacy of the late Kobe… [+5755 chars]"}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "David Pasztor", "title": "Premier League, UK government, other sports working together on ‘Project Restart’ - We Ain't Got No History", "description": "Can football return anytime soon?", "url": "https://weaintgotnohistory.sbnation.com/2020/4/25/21235853/premier-league-uk-government-other-sports-working-together-on-project-restart-report", "urlToImage": null, "publishedAt": "2020-04-25T11:07:56Z", "content": "As some leagues trend towards reopening the Bundesliga might be back in a couple weeks! but others trend the opposite direction the Eredivisie became the first league to officially cancel the 2019-20 season on Friday the Premier League remains very much in li… [+1817 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Oliver Browning", "title": "WWE news: The 30 greatest pro wrestlers of all-time have been ranked - GIVEMESPORT", "description": "WWE news: The 30 greatest pro wrestlers of all-time have been ranked", "url": "https://www.givemesport.com/1564783-wwe-news-the-30-greatest-pro-wrestlers-of-alltime-have-been-ranked", "urlToImage": null, "publishedAt": "2020-04-25T10:59:58Z", "content": "There are so many legendary names linked with professional wrestling. \r\nWWE stars like Hulk Hogan, The Undertaker, Andre the Giant and The Rock instantly spring to mind. \r\nThen, of course, there are some that have made a name for themselves outside of America… [+1569 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "https://www.facebook.com/Firstshopp1/", "title": "Happy Birthday Sachin Tendulkar - 47 Interesting Facts About The Master Blaster - firstshopp", "description": "No cricketer has ever captured the hearts and minds and time of a billion people like the little man. No cricketer has matched the popularity and created so much mass hysteria. No cricketer has been the soul and spirit of a nation like he was for most of his …", "url": "https://www.news18.com/cricketnext/news/47-interesting-facts-about-sachin-tendulkar-2590827.html", "urlToImage": null, "publishedAt": "2020-04-25T10:29:00Z", "content": "No cricketer has ever captured the hearts and minds and time of a billion people like the little man. No cricketer has matched the popularity and created so much mass hysteria. No cricketer has been the soul and spirit of a nation like he was for most of his … [+7773 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "Ryan O'Hanlon", "title": "Premier League scouting: Why identifying similar clubs could be the key to the transfer window - ESPN India", "description": "With football shut down and no games to attend, scouts need to creatively identify transfer targets. One way to do so? Find playing-style proxies.", "url": "https://www.espn.in/football/english-premier-league/story/4086053/premier-league-scouting-why-identifying-similar-clubs-could-be-the-key-to-the-transfer-window", "urlToImage": null, "publishedAt": "2020-04-25T10:26:13Z", "content": "Traditional scouting is gone. During a global pandemic, there are no games for talent identifiers to watch -- outside of Belarus, that is. And whenever games do return, they will presumably be played in empty stadiums, with nowhere for outside employees from … [+13243 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "“It Was Not an Easy Night”: Steve Kerr Narrates a Hilarious Betting Story of Michael Jordan From Their College Days - India Gone Viral", "description": "Golden State Warriors coach Steve Kerr revealed a funny betting story with his former teammate Michael Jordan. It was during a game when Kerr was playing for the University of Arizona while Jordan was", "url": "https://indiagoneviral.com/sports/2020/04/25/it-was-not-an-easy-night-steve-kerr-narrates-a-hilarious-betting-story-of-michael-jordan-from-their-college-days/42065/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T10:04:23Z", "content": "Golden State Warriors coach Steve Kerr revealed a funny betting story with his former teammate Michael Jordan.\r\nIt was during a game when Kerr was playing for the University of Arizona while Jordan was at the University of North Carolina. Kerrs Wildcats defea… [+2049 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "‘You don’t want the fear,’ Yuvraj Singh explains why cricket should return only after Covid-19 is e... - Hindustan Times", "description": "Like other sports, international and domestic cricket too has been disrupted leading the national boards to contemplate resuming the game in empty stadiums, without fans.", "url": "https://www.hindustantimes.com/cricket/you-don-t-want-the-fear-yuvraj-singh-explains-why-cricket-should-return-only-after-covid-19-is-eradicated/story-7okHJdLw1JTTSzbxY9JJ6L.html", "urlToImage": null, "publishedAt": "2020-04-25T09:34:05Z", "content": "Former India star Yuvraj Singh wants cricket to resume only when the world becomes COVD-19 free as players’ health and safety should be paramount for the custodians of the game.\r\nLike other sports, international and domestic cricket too has been disrupted lea… [+1271 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": null, "title": "‘He was a real pain in the back for us’ – Pat Cummins picks Cheteshwar Pujara as the toughest batsman to bowl - CricTracker", "description": "Pat Cummins, who is the World's number 1 Test bowler, recalled the painstaking series for Australia in 2018-19 season which India", "url": "https://m.crictracker.com/he-was-a-real-pain-in-the-back-for-us-pat-cummins-picks-cheteshwar-pujara-as-the-toughest-batsman-to-bowl/", "urlToImage": null, "publishedAt": "2020-04-25T09:04:22Z", "content": "Pat Cummins and Cheteshwar Pujara. (Photo Source: Getty Images)\r\nTeam India scripted history during their previous Australia tour by winning their first ever Test series down under. Though the hosts missed their best batsman in David Warner and Steve Smith, A… [+1980 chars]"}, {"source": {"id": null, "name": "Sportskeeda.com"}, "author": "Dibyadarshan Das", "title": "AKM vs M416: Which gun is better in PUBG Mobile? - Sportskeeda", "description": "Here, we take a look at the AKM and the M416 guns in PUBG Mobile, and when to use them.", "url": "https://www.sportskeeda.com/esports/akm-vs-m416-which-gun-is-better-in-pubg-mobile", "urlToImage": null, "publishedAt": "2020-04-25T08:07:36Z", "content": "AKM vs M416\r\nA popular conundrum among PUBG Mobile players is the choice of weapon between the M416 and the AKM. \r\nOn the battleground, players have to take their chances with whatever they find early in the game. At some stage, they might get the opportunity… [+2960 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "From Chess to cricket - The chronicles of Chahal - Cricbuzz - Cricbuzz", "description": "The legspinner talks about his cricketing journey - captaining Haryana at the junior level and how he started off as a medium pacer before switching over to spin", "url": "https://www.cricbuzz.com/cricket-news/112927/from-chess-to-cricket-the-chronicles-of-chahal", "urlToImage": null, "publishedAt": "2020-04-25T05:55:57Z", "content": "From being a chess player (he still has a FIDE rating of 1956) to becoming an international cricketer of repute, Yuzvendra Chahal, India's premier white-ball spinner, has come a long way. A veteran of 52 One Day Internationals and 42 Twenty20 internationals, … [+2072 chars]"}]}