{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Yuvraj Singh begins `Keep It Up` challenge, Sachin Tendulkar gives it a twist--Watch - Zee News", "description": "Yuvraj nominated legendary cricketer Sachin Tendulkar, Indian opener Rohit Sharma and veteran off-spinner Harbhajan Singh to take up the challenge.", "url": "https://zeenews.india.com/cricket/yuvraj-singh-begins-keep-it-up-challenge-sachin-tendulkar-gives-it-a-twist-watch-2284151.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2020/05/17/861358-ssssssssssssssssssssssssssssssssssss.jpg", "publishedAt": "2020-05-17T10:05:45Z", "content": "While most of the sporting activities across the world continue to remain at standstill, former Indian all-round Yuvraj Singh has kickstarted a new challenge on social media, 'Keep It Up'.\r\nTaking to his official Twitter handle, Yuvraj shared a video of himse… [+2335 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindustantimes.com", "title": "Can assure RCB will be ready: Mike Hesson hopeful of IPL taking place - Hindustan Times", "description": "The IPL, which was originally scheduled to be held from March 29 to May 24, was indefinitely postponed by the BCCI due to the outbreak of the novel coronavirus in India and subsequent lockdown announced by the government.", "url": "https://www.hindustantimes.com/cricket/can-assure-rcb-will-be-ready-mike-hesson-hopeful-of-ipl-taking-place/story-IYytdvtA8MwKsr1CWYtXbJ.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/17/Pictures/new-zealand-v-west-indies-1st-t20_ab6bdec2-981d-11ea-a968-2ed746e9a968.jpg", "publishedAt": "2020-05-17T09:52:25Z", "content": "The Indian Premier League was cancelled by the government of India as the situation regarding the Covid-19 pandemic was still developing in the country. The league was originally supposed to take place at the end of March but was postponed indefinitely due to… [+1670 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Pavni Ahuja", "title": "“I Haven’t Been Doing a Great Job”: Stephen Curry on How Lockdown is Further Hampering Golden State Warriors Revival - Essentially Sports", "description": "Golden State Warriors went through a tough season this year. With its suspension Stephen Curry is finding it difficult to keep up with his teammates.", "url": "https://www.essentiallysports.com/nba-news-i-havent-been-doing-a-great-job-stephen-curry-on-how-lockdown-is-further-hampering-golden-state-warriors-revival/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200517122722/GettyImages-1150633541.jpg", "publishedAt": "2020-05-17T09:30:00Z", "content": "The season suspension has been particularly tough for the teams. Keeping up with the spirit and coordination within players has become a task for the leaders. Well, Stephen Curry is no different. The Warriors star is facing issues with connecting to his young… [+2185 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "https://www.facebook.com/profile.php?id=100009654009663", "title": "“It is a Good Marketing Story”: Toto Wolff Reacts on the Possibility of Sebastian Vettel Joining Lewis Hamilton at Mercedes for 2021 - Essentially Sports", "description": "Toto Wolff says that Sebastian Vettel is an awesome F1 driver. He says that the potential arrival of the driver will be a marketing story for Mercedes.", "url": "https://www.essentiallysports.com/f1-news-it-is-a-good-marketing-story-toto-wolff-reacts-on-the-possibility-of-sebastian-vettel-joining-lewis-hamilton-at-mercedes-for-2021/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200517133026/sv-12.jpg", "publishedAt": "2020-05-17T09:11:00Z", "content": "Four-time title-holder Sebastian Vettel will leave Ferrari toward the finish of the 2020 season. It comes as Vettel failed to secure the Championship since joining the Italian group in 2015. Carlos Sainz will replace him after the 2020 season. He will pair up… [+1898 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindustantimes.com", "title": "Improve your English, personality: Former Pakistan cricketer’s advice to Babar Azam - Hindustan Times", "description": "Speaking in a Youtube video, the former Pakistan bowler said that Babar will need to be communicate with media as captain of the team, and hence also work on improving his English.", "url": "https://www.hindustantimes.com/cricket/improve-your-english-personality-former-pakistan-cricketer-s-advice-to-babar-azam/story-zCXHptoEbdxk7w39GdHkJN.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/01/23/Pictures/pakistan-cricket-bangladesh_38ab1bda-3dde-11ea-bfbd-f812f33ac46f.jpg", "publishedAt": "2020-05-17T08:49:00Z", "content": "Pakistan limited-overs captain Babar Azam is regarded as one of the best batsmen in cricket at the moment. Babar often sees himself being compared to India cricket team captain Virat Kohli. But former Pakistan cricketer Tanvir Ahmed believes that the player n… [+1641 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": "", "title": "'He shouldn't be the water boy' - Mohammad Kaif slams Virat Kohli for not backing players - CricTracker", "description": "Former Indian batsman Mohammad Kaif has now expressed his criticism towards some of the tactics of Kohli. The former Indian cricketer said that the current", "url": "https://www.crictracker.com/he-shouldnt-be-the-water-boy-mohammad-kaif-slams-virat-kohli-for-not-backing-players/", "urlToImage": "https://www.crictracker.com/wp-content/uploads/2018/04/Mohammad-Kaif-2.jpg", "publishedAt": "2020-05-17T08:39:03Z", "content": "Mohammad Kaif. (Photo Source: Twitter)\r\nCriticisms of Virat Kohli’s captaincy have been very rare. But, one thing which many experts have said about the Indian captain is regarding his selection choices. Former Indian batsman Mohammad Kaif has now expressed h… [+2130 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "Rohit Sharma, Anil Kumble Ace \"Keep It Up\" Challenge With Unique Twists. Watch - NDTVSports.com", "description": "Rohit Sharma and Anil Kumble took up the \"keep it up\" challenge and brought in their own brilliant modifications to it.", "url": "https://sports.ndtv.com/cricket/rohit-sharma-anil-kumble-ace-keep-it-up-challenge-with-unique-twists-watch-2230235", "urlToImage": "https://c.ndtvimg.com/2020-05/sk49s9r_rohit-sharma-twitter_625x300_17_May_20.jpg", "publishedAt": "2020-05-17T08:24:08Z", "content": "Rohit Sharma and Anil Kumble left their mark on the \"keep it up\" challenge on Sunday, bringing in their own unique twists. While Rohit Sharma bounced the ball on his bat's handle, Anil Kumble, who was nominated by Harbhajan Singh to take up the challenge, cou… [+1561 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Reubyn Coutinho", "title": "“It’s Horrible What He’s Been Through- Alistair Overeem Reflects Upon His Win Over Walt Harris - Essentially Sports", "description": "Alistair Ovreem offered words of praise to his fallen opponent Walt Harris after their main event clash at UFC Fight Night\" Overeem vs Harris", "url": "https://www.essentiallysports.com/ufc-fight-night-news-its-horrible-what-hes-been-through-alistair-overeem-reflects-upon-his-win-over-walt-harris/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200517132951/Annotation-2020-05-17-132835.jpg", "publishedAt": "2020-05-17T08:02:00Z", "content": "Walt Harris and Alistair Overeem finally fought at UFC Fight Night: Overeem vs Harris after their matchups were canceled twice. The first was due to Harris’ stepdaughter’s disappearance. A few weeks later, the MMA world was shocked to hear of the 19-year-old’… [+2272 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": "", "title": "Harsha Bhogle picks current best 'fab four' of bowlers - CricTracker", "description": "Harsha Bhogle, the renowned cricket journalist, reckons that Pakistan fast bowler Shaheen Afridi has every chance or making the ‘fab four’ in the list of", "url": "https://www.crictracker.com/harsha-bhogle-picks-current-best-fab-four-of-bowlers/", "urlToImage": "https://www.crictracker.com/wp-content/uploads/2019/10/Harsha-Bhogle.jpg", "publishedAt": "2020-05-17T08:00:31Z", "content": "Harsha Bhogle. (Photo Source: Twitter)\r\nHarsha Bhogle, the renowned cricket journalist, reckons that Pakistan fast bowler Shaheen Afridi has every chance or making the fab four in the list of bowlers. The list currently has Indias Jasprit Bumrah, Australias P… [+2008 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "‘They want India in this country’: Former Australia captain thinks T20 WC postponement would a boon... - Hindustan Times", "description": "The ICC T20 World Cup, scheduled to be held in Australia from October 18 to November 15, is shrouded in uncertainty even as some sporting action has begun with strict guidelines in place.", "url": "https://www.hindustantimes.com/cricket/they-want-india-in-this-country-former-australia-captain-thinks-t20-wc-postponement-would-a-boon-for-ipl/story-qJ8aTm6q9DQJjLu6dgkASO.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/17/Pictures/ipl-10-final_f956706c-9812-11ea-a968-2ed746e9a968.jpg", "publishedAt": "2020-05-17T07:58:49Z", "content": "Former Australia captain Mark Taylor feels eventually this year’s ICC T20 World Cup would be postponed because of the COVID-19 pandemic, opening the doors for BCCI to host lucrative Indian Premier League (IPL) in that time slot.\r\nThe ICC T20 World Cup, schedu… [+2132 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Bus driver drives a convertible now: Mohammad Kaif's reply to Nasser Hussain on his 18-year-old sledge - India Today", "description": "Former England captain Nasser Hussain said that defeat at the hands of India in 2002 NatWest final still gives him sleepless nights.", "url": "https://www.indiatoday.in/sports/cricket/story/driver-drives-convertible-mohammad-kaif-nasser-hussain-sledging-natwest-final-2002-1678928-2020-05-17", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/RTRXHQR-647x363.jpeg?1_MADyVzEuKqFX8DbXXpJwzvEqPm44bs", "publishedAt": "2020-05-17T07:44:09Z", "content": "\"I think he must drive the bus; he drives Tendulkar around.\" These were the welcome words of former England cricketer Nasser Hussain for a very young player from Allahabad in Uttar Pradesh. The young 'lad' heard what was said to him but remained calm to cruis… [+2157 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Anirudh Singh", "title": "'Don't know when Izhaan will be able to see his father again' : Sania Mirza leaves family reunion to... - The Cricket Times", "description": "The novel coronavirus pandemic induced lockdown has thrown the healthy life of many people out of gear and power couple - Sania Mirza and Shoaib Malik - is no exception. Sania, the Indian Tennis ace, and her husband - former Pakistan cricket team skipper Shoa…", "url": "https://crickettimes.com/2020/05/dont-know-when-izhaan-will-be-able-to-see-his-father-again-sania-mirza-leaves-family-reunion-to-fate/", "urlToImage": "https://crickettimes.com/wp-content/uploads/2020/05/Sania-Mirza-Izhaan-Shoaib-Malik.jpg", "publishedAt": "2020-05-17T07:36:12Z", "content": "The novel coronavirus pandemic induced lockdown has thrown the healthy life of many people out of gear and power couple – Sania Mirza and Shoaib Malik – is no exception.\r\nSania, the Indian Tennis ace, and her husband – former Pakistan cricket team skipper Sho… [+1674 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Saketh Kandadai", "title": "“I am the One Who Won it For You”: When Michael Jordan Poked Fun of His Teammate Upon Winning the Title - Essentially Sports", "description": "When Joe Kleine was crying after winning the title in 1998, Michael Jordan had a typical response saying he was the won who won it for the Bulls", "url": "https://www.essentiallysports.com/nba-news-i-am-the-one-who-won-it-for-you-when-michael-jordan-poked-fun-of-his-teammate-upon-winning-the-title/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200422141403/Jordan-1.jpeg", "publishedAt": "2020-05-17T07:29:00Z", "content": "When Joe Kleine was crying after winning the title in 1998, Michael Jordan had a typical response.\r\nIt was the Bulls’ third consecutive title in 1998. With stars like Scottie Pippen, Denis Rodman apart from Jordan in the team, Kleine was far from being amongs… [+1654 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Rob Hoskin", "title": "Erling Haaland is being compared to Zlatan Ibrahimovic after post-match interview - GIVEMESPORT", "description": "Erling Haaland is being compared to Zlatan Ibrahimovic after post-match interview", "url": "https://www.givemesport.com/1568876-erling-haaland-is-being-compared-to-zlatan-ibrahimovic-after-postmatch-interview", "urlToImage": "https://gmsrp.cachefly.net/images/20/05/17/8e2fdeb53f4934746b786e5edb419e73/1200.jpg", "publishedAt": "2020-05-17T07:02:29Z", "content": "It just had to be wonderkid Erling Braut Haaland who would score the first goal of Bundesliga’s return to action following the coronavirus pandemic, didn't it?\r\nIn strange scenes at the Signal Iduna Park, Borussia Dortmund ran out 4-0 winners at the Revierder… [+1810 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Sports Desk", "title": "Went looking for Harbhajan Singh in hotel room to fight with him: Shoaib Akhtar - The Indian Express", "description": "Shoaib Akhtar speaks about the time he had gone to look for Harbhajan Singh in a Sri Lanka hotel to take revenge for what happened on the cricket field.", "url": "https://indianexpress.com/article/sports/cricket/shoaib-akhtar-harbhajan-singh-fight-hotel-room-6412859/", "urlToImage": "https://images.indianexpress.com/2016/07/harbhajan_shoaib-akhtar-m.jpg?w=759", "publishedAt": "2020-05-17T06:57:21Z", "content": "Harbhajan Singh and Shoaib Akhtar had a blistering individual duel in the 2010 Asia Cup match. (File Photo/AP)Shoaib Akhtar threw some light on the incident from 2010 when he had threatened to beat Harbhajan Singh, saying he had gone to look for the India spi… [+2159 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "Rameez Raja picks his combined India-Pakistan ODI XI; Rohit Sharma, Shahid Afridi... - The Cricket Times", "description": "Former Pakistan cricketer turner commentator, Rameez Raja, has picked his combined lineup of India and Pakistan in ODI format. The two arch-rivals have locked horns against each other since time immemorial to produce some of the finest cricketing action. Raja…", "url": "https://crickettimes.com/2020/05/rameez-raja-picks-his-combined-india-pakistan-odi-xi-rohit-sharma-shahid-afridi-snubbed/", "urlToImage": "https://crickettimes.com/wp-content/uploads/2020/05/Rameez-Raja-Shahid-Afridi-and-Rohit-Sharma.jpg", "publishedAt": "2020-05-17T06:55:27Z", "content": "Former Pakistan cricketer turner commentator, Rameez Raja, has picked his combined lineup of India and Pakistan in ODI format.\r\nThe two arch-rivals have locked horns against each other since time immemorial to produce some of the finest cricketing action.\r\nRa… [+1838 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Maitreyee Joshi", "title": "“Always Learning From the Best” : Vanessa Remembers Kobe Bryant Through His Literature - Essentially Sports", "description": "Vanessa Bryant remember her late husband Kobe Bryant through his literary works as she reads them and finds knowledge through them.", "url": "https://www.essentiallysports.com/nba-news-los-angeles-lakers-always-learning-from-the-best-vanessa-remembers-kobe-bryant-through-his-literature/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200517120823/kobe-bryant-wife-vanessa-would-absolutely-love-to-have-a-son-they-arent-done-having-kids-ftr.jpg", "publishedAt": "2020-05-17T06:43:00Z", "content": "When Kobe Bryant retired, the NBA community lost a great player, however, the literary community gained a new author. He worked on several personal, as well as professional projects, alongside other authors. His wife, Vanessa Bryant, has always been a dedicat… [+2062 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Cristiano Ronaldo is the king, says Rohit Sharma - Times of India", "description": "Cricket News: \"Cristiano Ronaldo is the king,\" said opening batsman Rohit Sharma when he was asked whether he is a fan of the Portuguese star or not. Rohit was doin", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/cristiano-ronaldo-is-the-king-says-rohit-sharma/articleshow/75784431.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75784611,width-1070,height-580,imgsize-1641150,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-05-17T06:38:52Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Was Steyn Close to Dismissing Tendulkar in 190s as he Claims During Gwalior Double Ton? Not Really - News18", "description": "As it turns out, the events mentioned by Steyn, never transpired on the field. In fact, Steyn bowled only three deliveries at Tendulkar, when the latter was in his 190s, in the 47th over.", "url": "https://www.news18.com/cricketnext/news/was-dale-steyn-close-to-dismissing-sachin-tendulkar-in-190s-as-he-claims-during-gwalior-double-ton-not-really-2623671.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/05/1589696840_steyn-759.jpg", "publishedAt": "2020-05-17T06:31:03Z", "content": "On Saturday, South Africa fast bowler Dale Steyn created quite a stir in the cricketing world, when he accused umpire Ian Gould of not ruling Sachin Tendulkar out LBW when he was in his 190s, in the iconic match at Gwalior.\r\n\"Tendulkar scored the first double… [+1652 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Moushumi Bora", "title": "Bundesliga: It's live, and it's kicking! - Times of India", "description": "Football News: Football is LIVE, it is alive and back on television. Saturday, May 16, 2020, was the restart fans all over the world were looking for. In usual times", "url": "https://timesofindia.indiatimes.com/sports/football/top-stories/bundesliga-its-live-and-its-kicking/articleshow/75783644.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75783633,width-1070,height-580,imgsize-1445772,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-05-17T06:22:26Z", "content": "The red four-letter word on the screen said it all. Football is LIVE, it is alive and back on television. Saturday, May 16, 2020 was the restart fans all over the world were looking for, although there were still dissenting voices of \"what is Bundesliga witho… [+2066 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Saketh Kandadai", "title": "“Ni***s Look Happy as S**t”: Kevin Durant Takes a Dig at Warriors’ GM - Essentially Sports", "description": "Kevin Durant responded to Golden State Warriors GM Bob Myers saying the 2017/18 victory was not very joypus & something they were supposed to do", "url": "https://www.essentiallysports.com/nba-news-nis-look-happy-as-st-kevin-durant-takes-a-dig-at-warriors-gm/", "urlToImage": "https://www.essentiallysports.com/wp-content/uploads/1061305170.jpg.0.jpg", "publishedAt": "2020-05-17T05:54:00Z", "content": "After an incredible last few seasons, Golden State Warriors General Manager Bob Myers felt the 2017/18 victory was something they were supposed to do. It was their second season with Kevin Durant and Myers felt it didn’t give a huge amount of joy as it was by… [+1797 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Pakistan to tour England in July, matches to be played in bio-secure environment - India Today", "description": "Pakistan would tour England in July for 3 Tests and 3 T20Is that will be played behind closed doors at grounds that have hotels inside the ground.", "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-to-play-england-in-july-in-bio-secure-environment-pcb-agrees-1678899-2020-05-17", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/PAk_cricket-647x363.png?Xt5LhfVbHKL5MrT72eN4K5Bvj3xzEXqy", "publishedAt": "2020-05-17T05:17:58Z", "content": "Pakistan is all set to tour England in July to play three Tests and three T20 internationals in a bio-secure environment with the PCB giving its approval to their English counterparts during a video link meeting on Friday.\r\nPakistan Cricket Board chief execut… [+2235 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "David Warner Channels His Inner Baahubali in Video with Daughter, Prabhas Fans Overjoyed - News18", "description": "David Warner's new 'Baahubali' inspired video has left Prabhas fans gushing over the Australian cricketer.", "url": "https://www.news18.com/news/movies/david-warner-channels-his-inner-baahubali-in-video-with-daughter-prabhas-fans-overjoyed-2623573.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/05/1589690627_david-warner.jpg", "publishedAt": "2020-05-17T04:57:27Z", "content": "Australian cricketer David Warner seems to be taking his love for TikTok videos and South Indian cinema to new heights each day. After grooving to a couple of chartburster Allu Arjun songs, David now features in a clip inspired by blockbuster Baahubali, featu… [+609 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Amit Bhardwaj", "title": "Shahid Afridi travels to PoK to puppet Pak Army venom, doesnt care for social distancing - Republic World - Republic World", "description": "In the name of providing relief material to the people living in PoK (Pakistan Occupied Kashmir), Afridi paid a visit to the territory and addressed the locals", "url": "https://www.republicworld.com/world-news/pakistan-news/shahid-afridi-travels-to-pok-puppets-pakistan-army-venom-and-propaganda.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/zpk8n7qftz6cw7ei_1589686171.jpeg?tr=f-jpeg", "publishedAt": "2020-05-17T04:28:23Z", "content": "Since the start of this year, the whole world is fighting against COVID-19 Crisis and countries like India are trying their level best to tackle it. However, certain Pakistanis are still busy in mongering their propaganda on the Kashmir issue. This time it is… [+1984 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindustantimes.com", "title": "I knew if MS Dhoni is playing, I won’t get to play: Saha on how he made most of opportunities - Hindustan Times", "description": "Saha, in a recent interview, said that he started playing frequently for the team after Dhoni’s retirement from the longest format in 2014.", "url": "https://www.hindustantimes.com/cricket/i-knew-if-ms-dhoni-is-playing-i-won-t-get-to-play-saha-on-how-he-made-most-of-opportunities/story-dNsyoHx7aTE1ENqcEBQ3iK.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/17/Pictures/_382a2702-97f0-11ea-b40c-d7c2b81d84c3.jpg", "publishedAt": "2020-05-17T04:15:47Z", "content": "India wicketkeeper Wriddhiman Saha on Sunday said that he learnt the most from former India captain Mahendra Singh Dhoni, as he knew that he will not be included in the team till Dhoni is in the team. It comes off as a little surprise that the two keepers hav… [+1997 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Transfer news and rumours LIVE: Man Utd targeting Bayern's Tolisso - Goal India", "description": "Bundesliga is the first European soccer league to return to competition since the COVID-19 pandemic paused sports in March.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2020-05-17T04:00:00Z", "content": "More"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindustantimes.com", "title": "‘Wanted to play against CSK’: Sreesanth denies claims he argued with Rajasthan Royals coach Rahul D... - Hindustan Times", "description": "“I could never disrespect a man like Rahul Dravid. He is the best captain. I was angry because I was not part of the squad during the CSK match. I asked the reason for the same,” he said on the HELO app.", "url": "https://www.hindustantimes.com/cricket/wanted-to-play-against-csk-sreesanth-denies-claims-he-aruged-with-rajasthan-royals-caoch-rahul-dravid/story-8gV3hwdLn7V9xnVdP9uegI.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/17/Pictures/_006fdff8-97ed-11ea-a968-2ed746e9a968.jpg", "publishedAt": "2020-05-17T03:33:45Z", "content": "Fast bowler S Sreesanth has dismissed Paddy Upton’s claims that he had beef with his Rajasthan Royals coach Rahul Dravid. Upton, the mental conditioning coach of the Royals, had in his book ‘The Barefoot Coach’, written that Sreesanth had an ugly spat with Dr… [+1711 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Shivani Naik", "title": "Behind closed doors, hoopsters prepare to chase their American dream - The Indian Express", "description": "From Kapurthala to Nagpur to Bengaluru to Kottayam, the American dream is well spread out in the country with teenage basketball players trying to crack a college scholarship in NCAA.", "url": "https://indianexpress.com/article/sports/basketball/indian-hoopsters-american-dream-ncaa-behind-closed-doors-6413461/", "urlToImage": "https://images.indianexpress.com/2020/05/Grishma-Niranjan.jpg?w=759", "publishedAt": "2020-05-17T03:20:45Z", "content": "Written by Shivani Naik\r\n | Mumbai | \r\nUpdated: May 17, 2020 8:45:29 am\r\nGrishma Niranjan is primed for an off-year at a prep school in Connecticut this August. (Special Arrangement)Siya Deodhar is in Class 12, but getting good grades although important is on… [+5750 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindustantimes.com", "title": "‘Of course there is pressure’: Ahmed Shehzad on comparisons with Virat Kohli - Hindustan Times", "description": "Shehzad and Kohli came through the ranks at nearly the same time, and this may surprise you, but the Pakistan opener had a better start to Test cricket as compared to Kohli.", "url": "https://www.hindustantimes.com/cricket/of-course-there-is-pressure-ahmed-shehzad-on-comparisons-with-virat-kohli/story-C5mKrl75RDZlQLIR37XE4L.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/17/Pictures/_b0c8f7f0-97e7-11ea-a968-2ed746e9a968.jpg", "publishedAt": "2020-05-17T03:01:39Z", "content": "Ahmed Shehzad, the batsman from Pakistan has revealed it wasn’t easy for him to prosper as a batsman due to the comparison people made between him and Virat Kohli. Shehzad and Kohli came through the ranks at nearly the same time, and this may surprise you, bu… [+1746 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Majority of Premier League players uncomfortable about returning - Willian - Goal India", "description": "Bundesliga is the first European soccer league to return to competition since the COVID-19 pandemic paused sports in March.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2020-05-17T02:35:00Z", "content": "More"}, {"source": {"id": null, "name": "Cricket.com.au"}, "author": "Cricket Network", "title": "Cricket set for return to action in Darwin - cricket.com.au", "description": "The Northern Territory capital's grade competition leading the way with a return to play under strict health guidelines next month", "url": "https://www.cricket.com.au/news/darwin-cricket-return-covid19-pandemic-ball-shining-guidelines/2020-05-17", "urlToImage": "https://www.cricket.com.au/~/-/media/News/2020/05/17Darwin.ashx?w=1600", "publishedAt": "2020-05-16T23:48:45Z", "content": "Competitive cricket is set to resume in Australia next month with the Darwin &amp; District Cricket Competition season scheduled to begin on June 6. \r\nThe competition's Premier grade will begin with a T20 tournament over the Queen's Birthday long weekend, bef… [+3109 chars]"}, {"source": {"id": null, "name": "Bavarianfootballworks.com"}, "author": "TomAdams71", "title": "Hertha Berlin first team to break goal celebration guidelines as Bundesliga restarts - Bavarian Football Works", "description": "It didn’t take long for these guidelines to be broken...", "url": "https://www.bavarianfootballworks.com/2020/5/17/21261194/hertha-berlin-first-team-break-guidlines-goal-celebration-hoffenheim-bundesliga-boyata-grujic-thuram", "urlToImage": "https://cdn.vox-cdn.com/thumbor/zemFQCPjYY-xPk2NPny1gufVkqA=/0x0:2866x1501/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19982187/1213174782.jpg.jpg", "publishedAt": "2020-05-16T22:10:39Z", "content": "The Bundesliga is finally back and the footballing world now has competitive action for which weve all been so desperately starving for. The restart could not have been possible with all of the proactive decisions made by the DFL and the medical task force th… [+2651 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Spencer Morgan For Mailonline", "title": "Eintracht Frankfurt vs Monchengladbach - Bundesliga: Live score and updates - Daily Mail", "description": "Eintracht Frankfurt host Borussia Monchengladbach in the final Bundesliga clash on Saturday restart. Follow SPENCER MORGAN for live score, lineups and build-up.", "url": "https://www.dailymail.co.uk/sport/football/article-8323469/Eintracht-Frankfurt-vs-Monchengladbach-Bundesliga-Live-score-updates.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/16/16/28470640-0-image-a-9_1589641905085.jpg", "publishedAt": "2020-05-16T18:32:08Z", "content": "Do you want to automatically post your MailOnline comments to your Facebook Timeline?\r\nYour comment will be posted to MailOnline as usual\r\n We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is p… [+367 chars]"}, {"source": {"id": null, "name": "Managingmadrid.com"}, "author": "Lucas Navarrete", "title": "Casemiro: “It’s easy to tell the players trained at home” - Managing Madrid", "description": "The midfielder was Real Madrid’s last player to discuss the team’s return to training.", "url": "https://www.managingmadrid.com/2020/5/16/21261089/casemiro-real-madrid-return-training-2020-quotes", "urlToImage": "https://cdn.vox-cdn.com/thumbor/xxsRzlThe68uJTMpG4rMlo1Eerw=/0x0:1879x984/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19962448/1212769038.jpg.jpg", "publishedAt": "2020-05-16T18:28:00Z", "content": "Real Madrid midfielder Casemiro talked to the teams TV station and revealed how the teams return to training at Valdebebas is going. Los Blancos have been training this whole week and will have one more month to get ready before La Liga restarts.\r\nThe work we… [+772 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": null, "title": "Chris Gayle stands by Ramnaresh Sarwan rant, but escapes CPL sanction | ESPNcricinfo.com - ESPNcricinfo", "description": "Batsman says he realises his comments could harm the CPL, which he doesn't intend to do | https://www.espncricinfo.com/story/_/id/29181555/chris-gayle-stands-ramnaresh-sarwan-rant-escapes-cpl-sanction", "url": "https://www.espncricinfo.com/story/_/id/29181555/chris-gayle-stands-ramnaresh-sarwan-rant-escapes-cpl-sanction", "urlToImage": "https://img1.hscicdn.com/image/upload/f_auto/esci/i/cricket/cricinfo/1222834_1296x729.jpg", "publishedAt": "2020-05-16T17:04:24Z", "content": "Chris Gayle has avoided sanction for his public criticism of Ramnaresh Sarwan and other Jamaica Tallawahs personnel, after the CPL Tournament Committee (CTC) said in a media release on Friday that it was satisfied with the batsman's statement, even though he … [+4853 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Aryan Sharma", "title": "Nick Kyrgios Takes Another Cheeky Dig At Novak Djokovic – Says Andy Murray Is Better - Essentially Sports", "description": "Novak Djokovic might be considered as the best player in the world by many people but Nick Kyrgios believes that Andy Murray is the better player.", "url": "https://www.essentiallysports.com/nick-kyrgios-takes-another-cheeky-dig-at-novak-djokovic-says-andy-murray-is-better-atp-tennis-news/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200516215344/sjkdfv-315x315.jpg", "publishedAt": "2020-05-16T16:46:00Z", "content": "Andy Murray and Novak Djokovic have a pretty similar playing style. However, somewhere down the line, Djokovic found his groove and began to win grand slams on a much more consistent basis.\r\nThat’s why, even after heavy comparisons between the two and numerou… [+1953 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Elliott Jackson", "title": "Five big changes to behind-closed-doors football as Premier League eagerly watch Bundesliga return - Manchester Evening News", "description": "The Bundesliga returned on Saturday and there were some less-than-subtle differences.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/five-big-changes-behind-closed-18263494", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/sport/football/article18263488.ece/ALTERNATES/s1200/1_Haaland.jpg", "publishedAt": "2020-05-16T16:18:22Z", "content": "Football is back but not quite as we all know and love it.\r\nThe Bundesliga launched its return on Saturday, with the whole world - and particularly those in the Premier League - watching on.\r\nFootball authorities will be keeping a close eye on the German game… [+2690 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Rasesh Mandani", "title": "BCCI weighs financial impact of freeze in cricket - Hindustan Times", "description": "The BCCI last week discussed the possible financial hit the cricket body would take due to cancelled matches.", "url": "https://www.hindustantimes.com/cricket/bcci-weighs-financial-impact-of-freeze-in-cricket/story-ZHk4GEvuMwS29D2xf3vThO.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/16/Pictures/_113e9b4e-978e-11ea-a091-8eb61e4add3b.jpg", "publishedAt": "2020-05-16T16:04:14Z", "content": "It is the world’s richest cricket board, but even BCCI has conceded the Covid-19 pandemic could take a toll on its finances.\r\nIts Apex Council meeting held last week discussed the possible financial hit the cricket body would take due to cancelled matches. \r\n… [+1715 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "https://www.facebook.com/profile.php?id=100009654009663", "title": "Schumacher Believes Sebastian Vettel Has a Back up Plan in F1 - Essentially Sports", "description": "Ralf Schumacher doesn't think Sebastian Vettel would leave Ferrari without an alternative drive arranged. He also mentions that there is lack of hype of F1.", "url": "https://www.essentiallysports.com/f1-news-schumacher-believes-sebastian-vettel-has-a-back-up-plan-in-f1/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200516191545/sv-11.jpg", "publishedAt": "2020-05-16T15:46:00Z", "content": "For the first time since 1990, a Formula 1 season could occur without a German driver one year from now. Sebastian Vettel will leave Ferrari toward the end of the 2020 season. It is open whether the 32-year-old will join some other team.\r\nRalf Schumacher thin… [+1768 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Jitesh Vachhatani", "title": "Rohit Sharma reveals the only country where Team India does not get crowd support - Republic World - Republic World", "description": "During an Instagram live session with Bangladesh's Tamim Iqbal, Rohit Sharma stated that the Indian team is not used to playing without any crowd support", "url": "https://www.republicworld.com/sports-news/cricket-news/rohit-sharma-reveals-the-only-country-where-team-india-does-not-get-cr.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/hq6o99jdjeokdkff_1589641973.jpeg?tr=f-jpeg", "publishedAt": "2020-05-16T15:43:06Z", "content": "The Indian Cricket Team has received immense support from citizens across the country with fans flocking stadiums in huge numbers every time Team India plays in any part of the country. The team has also received unbelievable crowd support on foreign tours. I… [+2845 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "RB Leipzig 1-1 Freiburg: Title setback for hosts as Bundesliga resumes with VAR drama - Goal India", "description": "Bundesliga is the first European soccer league to return to competition since the COVID-19 pandemic paused sports in March.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2020-05-16T15:32:00Z", "content": "More"}, {"source": {"id": null, "name": "Bavarianfootballworks.com"}, "author": "Ineednoname", "title": "Union Berlin vs Bayern Munich: Lineups, team news, injuries, and more! (Updated) - Bavarian Football Works", "description": "We already did one of these back in March. Hopefully this game goes ahead without incident!", "url": "https://www.bavarianfootballworks.com/2020/5/16/21260871/union-berlin-vs-bayern-munich-lineups-injuries-thomas-muller-philippe-coutinho-alphonso-davies", "urlToImage": "https://cdn.vox-cdn.com/thumbor/wgsg4kp_mKMHRLF_kf4D1KlAzA0=/0x0:3621x1896/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19933312/1221758147.jpg.jpg", "publishedAt": "2020-05-16T15:30:00Z", "content": "Whats that familiar feeling? Is it deja-vu? Oh wait, weve been here before back in March, when we previewed Union Berlin vs Bayern Munich hours before it ended up being canceled. Its been such a long time since then, Ive almost forgotten what a football match… [+2242 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "‘Sell Ramsey & Rabiot to get Pogba back’ – Juventus offered transfer advice by Tacchinardi - Goal India", "description": "Bundesliga is the first European soccer league to return to competition since the COVID-19 pandemic paused sports in March.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2020-05-16T14:29:00Z", "content": "More"}, {"source": {"id": null, "name": "Everythingbarca.com"}, "author": "Ranoveer Neogi", "title": "Lionel Messi vetoes the arrival of the best centre back at Barcelona - Everything Barca", "description": "Lionel Messi prevents Barcelona from making another blunder in the transfer market after vetoing the best centre back in the world. Lionel Messi had made h...", "url": "https://everythingbarca.com/2020/05/16/lionel-messi-vetoes-arrival-best-centre-back-barcelona/", "urlToImage": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Feverythingbarca.com%2Fwp-content%2Fuploads%2Fgetty-images%2F2016%2F04%2F1211140295.jpeg", "publishedAt": "2020-05-16T14:11:21Z", "content": "Lionel Messi had made his point while on an interview with Mundo Deportivo after the sacking of Ernesto Valverde following the loss in the semi-final on the Spanish Super Cup final to Athletic Bilbao. The captain of the squad stated in the interview with Mund… [+1892 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": "", "title": "Taipei T10 League 2020: 7th place-playoff, Taiwan Daredevils vs ICCT Smashers: Dream11 Fantasy Cricket Tips – Playing XI, Pitch Report & Injury Update - CricTracker", "description": "Taipei T10 League 2020 | TDR v ISM | Daredevils vs Smashers | Dream11 Fantasy Cricket Tips, Pitch Report, Probable XIs, Weather", "url": "https://www.crictracker.com/taipei-t10-league-2020-7th-place-playoff-taiwan-daredevils-vs-icct-smashers-dream11-fantasy-cricket-tips-playing-xi-pitch-report-injury-update/", "urlToImage": "https://www.crictracker.com/wp-content/uploads/2020/03/Cricket-Stadium-pic.jpg", "publishedAt": "2020-05-16T13:56:00Z", "content": "Cricket Stadium. (Photo by Robert Cianflone/Getty Images)\r\nMatch Details\r\nThe 7th place play-off of the Taipei T10 League 2020 will be played between Taiwan Daredevils and ICCT Smashers at the Yingfeng Cricket Ground in Songshan District.\r\nThe match starts at… [+3520 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "\"Doesn't Even Come Close\": Kevin Pietersen's Big Statement On Virat Kohli-Steve Smith Debate - NDTV Sports", "description": "In an Instagram Live chat, Pommie Mbangwa asked Kevin Pietersen to pick between Virat Kohli and Steve Smith.", "url": "https://sports.ndtv.com/cricket/doesnt-even-come-close-kevin-pietersens-big-statement-on-virat-kohli-steve-smith-debate-2229750", "urlToImage": "https://c.ndtvimg.com/2020-05/gdcn65g_virat-kohli-steve-smith-afp_625x300_16_May_20.jpg", "publishedAt": "2020-05-16T13:25:26Z", "content": "The Virat Kohli vs Steve Smith debate is one for the ages and while many have been asked to pick one over another, most have decided to sit on the fence and not give an definitive answer. But not Kevin Pietersen. The former England batsman, in a freewheeling … [+1882 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "Virat Kohli's Lookalike In TV Series Leaves Mohammad Amir \"Confused\". See Picture - NDTV Sports", "description": "Mohammad Amir, while watching a popular Turkish TV series, posted a picture on Twitter after spotting Virat Kohli's lookalike.", "url": "https://sports.ndtv.com/cricket/virat-kohlis-lookalike-in-tv-series-leaves-mohammad-amir-confused-see-picture-2229749", "urlToImage": "https://c.ndtvimg.com/2020-05/d0788h7g_virat-kohli-mohammad-amir-afp_625x300_16_May_20.jpg", "publishedAt": "2020-05-16T13:25:22Z", "content": "Mohammad Amir, Pakistan fast-bowler, took to Twitter to post a picture of Virat Kohli's lookalike while he was watching a popular Turkish TV series 'Dirilis: Ertugrul'. \"@imVkohli brother is it you m confused,\" Mohammad Amir posted a picture with a laughing e… [+1306 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "“West Indies cricket in ‘ICU’ due to COVID-19 pandemic” - Hindustan Times", "description": "The coronavirus outbreak, which has infected over 45 lakh people globally, has forced a global sporting shutdown, including cricket.", "url": "https://www.hindustantimes.com/cricket/west-indies-cricket-in-icu-due-to-covid-19-pandemic/story-Lcu9glhpNIXPuZ3Q1ZmxUN.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/16/Pictures/assignment-name-in-brief_516fb1ce-9772-11ea-b40c-d7c2b81d84c3.jpg", "publishedAt": "2020-05-16T13:23:25Z", "content": "Cricket West Indies (CWI) chief Ricky Skerritt has said that the COVID-19 pandemic has put the region’s already ailing cricket body into “Intensive Care Unit” and it will have to go for cost cutting measures to ride out the financial crisis.\r\nThe coronavirus … [+1736 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "MSK Prasad Proposes Ban on Using Saliva or Sweat to Shine The Ball - News18", "description": "The sport of cricket has been on hold due to the coronavirus pandemic. The 2020 edition of the IPL was called off and the ICC T20 World Cup scheduled to be held this year may be postponed.", "url": "https://www.news18.com/cricketnext/news/msk-prasad-proposes-ban-on-using-saliva-or-sweat-to-shine-the-ball-2623047.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/02/125515-xjnxmgkwve-1565711916.jpg", "publishedAt": "2020-05-16T13:23:21Z", "content": "Former BCCI chief of selectors MSK Prasad believes the ICC must come up with alternative ways for players to shine the ball since the use of saliva and sweat isn't possible in the wake of the Covid-19 pandemic.\r\nThe rules of the game state that external sourc… [+1302 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Entertainment Desk", "title": "Anushka Sharma-Virat Kohli spotted playing cricket at home amid lockdown, fans can’t believe how huge... - Hindustan Times", "description": "Anushka Sharma and Virat Kohli enjoyed their Saturday morning playing cricket at home. Check out their video.", "url": "https://www.hindustantimes.com/bollywood/anushka-sharma-virat-kohli-spotted-playing-cricket-at-home-amid-lockdown-fans-can-t-believe-how-huge-their-house-is/story-Ic0NdvjxtDI3HqrEvNxvlN.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/16/Pictures/_828e3c1a-9774-11ea-a968-2ed746e9a968.jpg", "publishedAt": "2020-05-16T13:13:37Z", "content": "Actor Anushka Sharma and her cricketer husband Virat Kohli were spotted playing cricket at their home on Saturday. A sneaky paparazzi video shows the couple taking turns at bowling and batting during their game. \r\nThe couple is seen at their lavish bungalow w… [+1519 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Akshat Gaur", "title": "Manish Pandey names the cricketer he looked up to when he was a... - The Cricket Times", "description": "The supremely talented Manish Pandey has been performing well for Team India from the past many days. His growth as an aggressive middle-order batsman and an athletic fielder impresses one to all. He will always be remembered as the first Indian to score a ce…", "url": "https://crickettimes.com/2020/05/manish-pandey-names-the-cricketer-he-looked-up-to-when-he-was-a-kid/", "urlToImage": "https://crickettimes.com/wp-content/uploads/2020/05/Manish-Pandey.jpg", "publishedAt": "2020-05-16T11:48:21Z", "content": "The supremely talented Manish Pandey has been performing well for Team India from the past many days. His growth as an aggressive middle-order batsman and an athletic fielder impresses one to all. He will always be remembered as the first Indian to score a ce… [+2658 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": "", "title": "Host IPL 2020 without overseas players in Sri Lanka: Matthew Hayden - CricTracker", "description": "However, the former Australian opener Matthew Hayden has suggested that IPL 2020 can go ahead without foreign players this year behind closed doors", "url": "https://www.crictracker.com/host-ipl-2020-without-overseas-players-in-sri-lanka-matthew-hayden/", "urlToImage": "https://www.crictracker.com/wp-content/uploads/2017/04/Matthew-Hayden.jpg", "publishedAt": "2020-05-16T11:42:05Z", "content": "Former Australia cricketer Matthew Hayden. (Photo Source: TNPL)\r\nThe world has come to a screeching halt due to the coronavirus pandemic. The COVID-19 outbreak has taken over three lakh lives with more than 4.5 million getting infected with the virus. Governm… [+1845 chars]"}, {"source": {"id": null, "name": "Tribuneindia.com"}, "author": "Tribune India", "title": "Balbir Singh Sr continues to be on ventilator in Mohali, condition stabilising - The Tribune India", "description": "Balbir Singh has suffered from three cardiac arrests", "url": "https://www.tribuneindia.com/news/sports/balbir-singh-sr-continues-to-be-on-ventilator-in-mohali-condition-stabilising-85623", "urlToImage": "https://cms.tribuneindia.com/gallary_content/2020/5/2020_5$largeimg_1319901320.jpg", "publishedAt": "2020-05-16T11:06:32Z", "content": "Chandigarh, May 16\r\nHockey legend Balbir Singh Senior, who has been admitted since last week at the Fortis Mohali, continues to be ventilator assistance. However, he has not suffered from anymore cardiac arrests since Thursday and his condition is stabilising… [+1480 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "https://www.facebook.com/varun.khanna123", "title": "Novak Djokovic Reveals the Most Heartbreaking Moment of His Career - Essentially Sports", "description": "Novak Djokovic recalled getting knocked out in the opening round of the Rio Olympics 2016 was one of the most heartbreaking moments of his career.", "url": "https://www.essentiallysports.com/novak-djokovic-reveals-the-most-heartbreaking-moment-of-his-career-at-rio-olympics-2016-atp-tennis-news/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200516160539/images-28-50.jpeg", "publishedAt": "2020-05-16T10:41:00Z", "content": "In spite of having a pile of records, Novak Djokovic has had a fair share of crushing and sometimes devitalizing defeats in his 17-year-old professional tennis career spanning around 1,100 matches.\r\nHowever, the Serbian was devastated after his loss at the 20… [+1963 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindustantimes.com", "title": "Sachin said ‘bowl like this when you get a game’: R Ashwin on how Tendulkar helped in 2011 World Cup - Hindustan Times", "description": "Ravichandran Ashwin narrates how Sachin Tendulkar and MS Dhoni helped him during his hard times.", "url": "https://www.hindustantimes.com/cricket/sachin-said-bowl-like-this-when-you-get-a-game-r-ashwin-on-how-tendulkar-helped-in-2011-world-cup/story-dDpEgpwORfwEopmbNOj14L.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/16/Pictures/_718e2574-975b-11ea-a091-8eb61e4add3b.jpg", "publishedAt": "2020-05-16T10:16:46Z", "content": "Apart from being regarded as one of the best spinners in world cricket currently, India off-spinner Ravichandran is also renowned for his mental strength, his tactical abilities and crystal-clear thought process. Despite these qualities, there were times when… [+1759 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Watch: Virat Kohli prepares for cricket return, shares video doing laps - Times of India", "description": "Cricket News: Virat Kohli gave cricket fans a big morale booster and something to cheer about, as the Indian captain was seen doing laps in an open area in his soci", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/watch-virat-kohli-prepares-for-cricket-return-shares-video-doing-laps/articleshow/75770341.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75770352,width-1070,height-580,imgsize-1109058,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-05-16T10:15:24Z", "content": null}, {"source": {"id": null, "name": "Who.int"}, "author": "World Health Organization: WHO", "title": "WHO and International Olympic Committee team up to improve health through sport - World Health Organization", "description": "<p>The World Health Organization (WHO) and the International Olympic Committee (IOC) today signed an agreement to work together to promote health through sport and physical activity.</p><p>\"I am pleased to formalize this longstanding partnership with the Inte…", "url": "https://www.who.int/news-room/detail/16-05-2020-who-and-international-olympic-committee-team-up-to-improve-health-through-sport", "urlToImage": "https://www.who.int/images/default-source/imported/physical-activity-russia-weight-lifting.tmb-1200v.jpg?Culture=en&sfvrsn=422cf185_25", "publishedAt": "2020-05-16T10:09:48Z", "content": "The World Health Organization (WHO) and the International Olympic Committee (IOC) today signed an agreement to work together to promote health through sport and physical activity.\r\n\"I am pleased to formalize this longstanding partnership with the Internationa… [+2164 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "MS Dhoni Gave Sabbir Rahman His Bat On 'This Condition' - Cricket Addictor", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiTmh0dHBzOi8vY3JpY2tldGFkZGljdG9yLmNvbS9jcmlja2V0L21zLWRob25pLWdhdmUtc2FiYmlyLXJhaG1hbi1iYXQtY29uZGl0aW9uL9IBUmh0dHBzOi8vY3JpY2tldGFkZGljdG9yLmNvbS9jcmlja2V0L21zLWRob25pLWdhdmUtc2FiYmlyLXJhaG1hbi1iYXQtY29uZGl0aW9uLz9hbXA?oc=5", "urlToImage": null, "publishedAt": "2020-05-16T08:06:09Z", "content": null}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Deepit Sharma", "title": "“Glad Your Pops is Doing Better”- Tony Ferguson Sends Khabib Nurmagomedov a Message - Essentially Sports", "description": "Tony Ferguson took to social media to congratulate Khabib Nurmagomedov as his father, Abdulmanap Nurmagomedov recovered from his coma.", "url": "https://www.essentiallysports.com/glad-your-pops-is-doing-better-tony-ferguson-sends-khabib-nurmagomedov-a-message-ufc-news/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200420013233/TONY-FERGUSON-VS.-KHABIB-NURMAGOMEDOV.jpg", "publishedAt": "2020-05-16T07:23:00Z", "content": "If there is one value in the field of sports that outweighs every other, it is respect. And when one affiliates oneself to the sport of Mixed Martial Arts, respect is paramount. In a show of the same value, Tony Ferguson took to social media to congratulate K… [+2139 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindustantimes.com", "title": "‘Most selfish cricketer I played with’: Shane Warne cites Steve Waugh’s run-out record - Hindustan Times", "description": "Shane Warne cited former Australia skipper Steve Waugh’s run out record to term him ‘most selfish cricket he played with’", "url": "https://www.hindustantimes.com/cricket/most-selfish-cricketer-i-played-with-shane-warne-cites-steve-waugh-s-run-out-record/story-D4W9U2jD4f5mLvfU0nLsAK.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/16/Pictures/cricket-aus-eng-warne_b0a34a70-9736-11ea-b40c-d7c2b81d84c3.jpg", "publishedAt": "2020-05-16T06:28:00Z", "content": "Former Australia cricketer Steve Waugh is regarded as one of the batting legends of his time. He is also hailed as one of the best captains in the history of world cricket. In 1999, Waugh brilliantly led his troops into the territory of arch rivals England, a… [+1318 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Anirudh Singh", "title": "'Believe me, he ate all the items my mother cooked' : Ashraful surprised to see Sachin eating so... - The Cricket Times", "description": "'Master Blaster' Sachin Tendulkar has been a role model for every aspiring cricketer who wants to break at the international stage. Bangladesh cricketer Mohammad Ashraful, who was once a 'ball boy' in international matches, first saw the glimpse of Tendulkar'…", "url": "https://crickettimes.com/2020/05/believe-me-he-ate-all-the-items-my-mother-cooked-ashraful-surprised-to-see-sachin-eating-so-much/", "urlToImage": "https://crickettimes.com/wp-content/uploads/2020/05/Mohammad-Ashraful-Sachin-Tendulkar.png", "publishedAt": "2020-05-16T04:47:49Z", "content": "‘Master Blaster’ Sachin Tendulkar has been a role model for every aspiring cricketer who wants to break at the international stage. Bangladesh cricketer Mohammad Ashraful, who was once a ‘ball boy’ in international matches, first saw the glimpse of Tendulkar’… [+2003 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "PTI", "title": "Sachin Tendulkar settles lawsuit with Australian bat-maker Spartan Sports International - Zee News", "description": "Sachin Tendulkar has decided to settle his lawsuit against bat-maker Spartan Sports International in the Federal Court of Australia after the company apologised for breach of contract. In 2016, Tendulkar entered into a worldwide exclusive sponsorship agreemen…", "url": "https://zeenews.india.com/cricket/sachin-tendulkar-settles-lawsuit-with-australian-bat-maker-spartan-sports-international-2283830.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2020/05/15/861087-sachintendulkarzee.jpg", "publishedAt": "2020-05-16T04:06:51Z", "content": "New Delhi: Sachin Tendulkar has decided to settle his lawsuit against bat-maker Spartan Sports International in the Federal Court of Australia after the company apologised for \"breach of contract\". In 2016, Tendulkar entered into a worldwide exclusive sponsor… [+1627 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "MS Dhoni to lead combined Mumbai Indians-CSK side named by Rohit Sharma, Suresh Raina - Zee News", "description": "Rohit chose to be the assistant batting coach and asked Raina to be the fielding and batting coach of this side.", "url": "https://zeenews.india.com/cricket/ms-dhoni-to-lead-combined-mumbai-indians-csk-side-named-by-rohit-sharma-suresh-raina-2283813.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2020/05/15/861070-msdhoniiii.jpg", "publishedAt": "2020-05-16T04:06:47Z", "content": "Rohit Sharma and Suresh Raina picked a combined Mumbai Indians (MI) and Chennai Super Kings (CSK) side with Mahendra Singh Dhoni as the captain during an Instagram Live chat. The team selection part was posted by CSK on their official Twitter handle.\r\nMumbai … [+1647 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "For humanity's sake: Danish Kaneria pleads for lifting of lifetime ban on him - India Today", "description": "After six years of denial, In 2018, Danish Kaneria admitted to spot-fixing in 2009 and had also apologized to former Essex team-mate Mervyn Westfield, who was sent to jail after Kaneria encouraged him to spot-fix.", "url": "https://www.indiatoday.in/sports/cricket/story/danish-kaneria-regrets-spot-fixing-asks-for-restrictions-to-be-lifted-1678608-2020-05-16", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/kaneria-647x363.png?1e1spUGQ8BaaGgK4YKGUrDRPwoF_0Pt1", "publishedAt": "2020-05-16T03:56:17Z", "content": "Former Pakistan spinner Danish Kaneria has said that he regrets spot-fixing in 2009 he has already paid a big price for that so the restrictions on him should be lifted now so that he could start fresh.\r\nAfter six years of denial, In 2018, Kaneria admitted to… [+1706 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Nihal Koshie", "title": "Staggered start for 800m, skin-tight gloves: World Athletics studying possible safety options - The Indian Express", "description": "\"The immediate future of the sport will be behind closed doors and the need of the hour is 'ingenuity' to ensure athletes can compete without compromising on safety,\" said president Sebastian Coe.", "url": "https://indianexpress.com/article/sports/sport-others/world-athletics-safety-options-800m-staggered-start-skin-tight-gloves-6411911/", "urlToImage": "https://images.indianexpress.com/2020/03/world-athletics.jpg?w=759", "publishedAt": "2020-05-16T02:27:42Z", "content": "Written by Nihal Koshie\r\n | New Delhi | \r\nUpdated: May 16, 2020 7:52:37 am\r\nThe coronavirus pandemic might change the world of track and field. (Source: Reuters)When baton exchanges are made in relay events of the future, athletes could look at wearing very l… [+6252 chars]"}, {"source": {"id": null, "name": "Tribalfootball.com"}, "author": "Paul Vegas", "title": "UNCOVERED: What Giggs has said about Man Utd target Matondo - Tribal Football", "description": "Wales coach Ryan Giggs is happy counting on Schalke winger Rabbi Matondo.Matondo is a transfer target for Manchester United, on reportedly advice from Giggs.&#3", "url": "https://www.tribalfootball.com/articles/uncovered-what-giggs-has-said-about-man-utd-target-matondo-4326211", "urlToImage": "https://images.tribalfootball.com/default/0001/06/thumb_5025_default_large.jpeg", "publishedAt": "2020-05-16T00:19:17Z", "content": "Wales coach Ryan Giggs is happy counting on Schalke winger Rabbi Matondo.\r\nMatondo is a transfer target for Manchester United, on reportedly advice from Giggs.\r\n\"I was slightly surprised when he went [to Schalke], but he is a talent,\" Giggs has said. \"If he i… [+421 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Sports Desk", "title": "Virat Kohli or Ravindra Jadeja? Indian captain settles best fielder debate - The Indian Express", "description": "Virat Kohli made his choice after the official Instagram handle of StarSports asked the cricket fans to pick the best fielder between Kohli and Ravindra Jadeja.", "url": "https://indianexpress.com/article/sports/cricket/virat-kohli-or-ravindra-jadeja-india-cricket-team-best-fielder-6410235/", "urlToImage": "https://images.indianexpress.com/2020/01/virat-kohli-jadeja.jpg?w=759", "publishedAt": "2020-05-15T17:05:48Z", "content": "Virat Kohli has settled Team India’s best fielder debate. (Source: File Photo/Twitter)Virat Kohli, captain of the India cricket team, along with his predecessor MS Dhoni are often credited as the men behind India’s rise in fielding standards of across all for… [+1613 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "West Indies players to undergo 14-day quarantine ahead of England Tests - Cricbuzz - Cricbuzz", "description": "Cricket West Indies' CEO has revealed they are working with ECB to find practice facility and hotel accommodation in a bio-secure environment", "url": "https://www.cricbuzz.com/cricket-news/113054/west-indies-players-to-undergo-14-day-quarantine-ahead-of-england-tests", "urlToImage": "http://www.cricbuzz.com/a/img/v1/600x400/i1/c189077/cwi-have-identified-a-pool-of.jpg", "publishedAt": "2020-05-15T15:44:17Z", "content": "CWI have identified a pool of 30 probables for the tour. © AFP\r\nCricket West Indies have identified 30 players for the tour of England, yet to be formally confirmed, where the side will play three Tests. The tour, which was originally scheduled to start on Ju… [+2078 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Rishi Karthikeyan", "title": "“I Don’t Think It’s Possible”- Roger Federer Didn’t Believe He Could Win 100 Titles - Essentially Sports", "description": "Roger Federer is one of 2 men to win a 100 titles on the ATP tour but would you belive that he didn't think he could do it?", "url": "https://www.essentiallysports.com/i-dont-think-its-possible-roger-federer-didnt-believe-he-could-win-100-titles-atp-tennis-news/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200515202217/Part-HKG-APH1280294-1-1-1.jpg", "publishedAt": "2020-05-15T14:54:00Z", "content": "Swiss Maestro Roger Federer has set many records in the sport of tennis. Winning 100 titles on the ATP Tour is one of them and he is the only man apart from Jimmy Connors to do this. But would you believe there was a time he thought he could not do it? Check … [+1757 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": "", "title": "Kevin Pietersen weighs in on the possibility of Virat Kohli breaking Sachin Tendulkar's record of 100 centuries - CricTracker", "description": "Virat Kohli has been in amazing form with the bat across all the formats over the years. He has simply taken the batsmanship to another", "url": "https://www.crictracker.com/kevin-pietersen-weighs-in-on-the-possibility-of-virat-kohli-breaking-sachin-tendulkars-record-of-100-centuries/", "urlToImage": "https://www.crictracker.com/wp-content/uploads/2020/05/Sachin-Tendulkar-Kevin-Pietersen-and-Virat-Kohli.jpg", "publishedAt": "2020-05-15T12:12:19Z", "content": "Sachin Tendulkar, Kevin Pietersen and Virat Kohli. (Photo Source: Getty Images)\r\nVirat Kohli has been in amazing form with the bat across all the formats over the years. He has simply taken the batsmanship to another level with supreme consistency and his num… [+2085 chars]"}]}