{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Top 10 most iconic Premier League goal celebrations including Liverpool and Man Utd - Mirror Online", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiS2h0dHBzOi8vd3d3Lm1pcnJvci5jby51ay9zcG9ydC9mb290YmFsbC90b3AtMTAtbW9zdC1pY29uaWMtcHJlbWllci0yMTkwMDkyMNIBT2h0dHBzOi8vd3d3Lm1pcnJvci5jby51ay9zcG9ydC9mb290YmFsbC90b3AtMTAtbW9zdC1pY29uaWMtcHJlbWllci0yMTkwMDkyMC5hbXA?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T12:30:46Z", "content": null}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "India Today League PUBG Mobile Invitational Day 3: SynerGE pip TSM ENTITY to win final Match - India Today", "description": "India Today League PUBG Mobile Invitational: In a gripping battle in Match 4 in Sanhok, SynerGE won their first chicken dinner of the tournament after they edged out TSM ENTITY who have been the most impressive team on Day 3.", "url": "https://www.indiatoday.in/sports/other-sports/story/itpubl-match-4-day-3-synerge-pip-tsm-entity-pubg-mobile-invitational-1671018-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T12:23:37Z", "content": "It looked like TSM ENTITY would take their third 3rd Chicken Dinner of Day 3 of India Today League PUBG Mobile Invitational but Team SynerGE spoiled their party by winning Match 4 in Sanhok.\r\nWith 11 kills and a total of 31 points SynerGe took the top spot an… [+1675 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nMatt Law,", "title": "Chelsea reject squad's offer of 10 per cent pay cut - Telegraph.co.uk", "description": "Club has told players to continue with their charitable donations while they try to strike an agreement over way forward on pay", "url": "https://www.telegraph.co.uk/football/2020/04/25/chelsea-reject-squads-offer-10-per-cent-pay-cut/", "urlToImage": null, "publishedAt": "2020-04-25T12:06:00Z", "content": "Chelsea have rejected the 10 per cent wage cut proposed by their first-team squad but negotiations are expected to continue during the coronavirus crisis.\r\nAs first revealed by Telegraph Sport, captain César Azpilicueta suggested a 10 per cent reduction in wa… [+1713 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Miscreants attempt to rob stumper Saha's Siliguri home, says relative - Hindustan Times", "description": "Saha, 35, lives in South Kolkata with his wife and children. The experienced stumper’s parents, who live in their Ward No.31 Shaktigarh area house in Siliguri, are at present staying with their son in Kolkata.", "url": "https://www.hindustantimes.com/cricket/miscreants-attempt-to-rob-stumper-saha-s-siliguri-home-says-relative/story-tRusZSKZV1FBBTmYrEWIlO.html", "urlToImage": null, "publishedAt": "2020-04-25T12:04:21Z", "content": "A relative of Wriddhiman Saha has alleged that a few miscreants tried to break into the India Test wicketkeeper’s ancestral home in Siliguri, North Bengal, on Friday in a bungled attempt to rob the place.\r\nSaha, 35, lives in South Kolkata with his wife and ch… [+1344 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Three Things We Want To See From the Kobe Bryant Documentary - India Gone Viral", "description": "‘The Last Dance,’ a ten-part documentary on Michael Jordan’s final season with the Chicago Bulls was released recently. Ever since the series claimed a massive following, fans have been chirping for a", "url": "https://indiagoneviral.com/sports/2020/04/25/three-things-we-want-to-see-from-the-kobe-bryant-documentary/42125/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T12:02:27Z", "content": "The Last Dance, a ten-part documentary on Michael Jordans final season with the Chicago Bulls was released recently. Ever since the series claimed a massive following, fans have been chirping for a similar documentary to be made on the legacy of the late Kobe… [+5755 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "“There’s No Doubt!”- Mike Tyson Opens Up on Fighting Tyson Fury and Anthony Joshua - India Gone Viral", "description": "The Baddest Man on the Planet, Mike Tyson is undeniably one of the greatest heavyweight boxers of all time. With 44 KO’s from just 50 fights, anyone who says otherwise is either lying or is not right", "url": "https://indiagoneviral.com/sports/2020/04/25/theres-no-doubt/42132/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T12:01:31Z", "content": "The Baddest Man on the Planet, Mike Tyson is undeniably one of the greatest heavyweight boxers of all time. With 44 KOs from just 50 fights, anyone who says otherwise is either lying or is not right in the head.\r\nTyson has been Furys fan for long before his s… [+1987 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "ESPNcricinfo staff", "title": "Sana Mir retires from international cricket | ESPNcricinfo.com - ESPNcricinfo", "description": "Mir, who made her debut in 2005, took 151 wickets in 120 ODIs and 89 wickets in 106 T20Is | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29097056/sana-mir-retires-international-cricket", "urlToImage": null, "publishedAt": "2020-04-25T11:58:05Z", "content": "Sana Mir, arguably the greatest woman cricketer Pakistan has produced, has announced her retirement from international cricket, bringing an end to a 15-year career. Mir, who made her international debut in 2005, took 151 wickets at an average of 24.27 in 120 … [+2756 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Rishi Karthikeyan", "title": "Venus Williams Reveals Her Best Friend On The WTA Tour - Essentially Sports", "description": "Venus Williams has great relationships with everyone on the WTA tour but who is her best friend on the tour? Read more to find out.", "url": "https://www.essentiallysports.com/venus-williams-reveals-her-best-friend-on-the-wta-tour-serena-williams-wta-tennis-news/", "urlToImage": null, "publishedAt": "2020-04-25T11:42:00Z", "content": "We have seen Venus Williams have great relationships with almost everybody on the WTA tour but who’s her best friend on the tour? Venus Williams has given the answer to this question in a recent Q&amp;A session she conducted on YouTube.\r\nRecently, Venus Willi… [+1412 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "Legalising ball tampering: Saliva is must and vaseline is no replacement, feel Ashish Nehra, Harbhajan Singh - Hindustan Times", "description": "Former India pacer Ashish Nehra and spinner Harbhajan Singh feel that saliva’s use in shining the ball is a “must”. Ex-opener Aakash Chopra, while beng open to the idea, wants to know where one can draw the line.", "url": "https://www.hindustantimes.com/cricket/legalising-ball-tampering-saliva-is-must-and-vaseline-is-no-replacement-feel-ashish-nehra-harbhajan-singh/story-6sGuYrV3wtqCeH94TJ9N9K.html", "urlToImage": null, "publishedAt": "2020-04-25T11:23:53Z", "content": "Saliva and sweat are components that cannot be entirely done away with, insist a few distinguished India cricketers, as the ICC contemplates legalising ball tampering post COVID-19 by using artificial substances to prevent virus spread. Former India pacer Ash… [+3372 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "‘If You Need Money Then You Should Stop Activities At The Border’: Kapil Dev - Swarajya", "description": "", "url": "https://swarajyamag.com/insta/if-you-need-money-then-you-should-stop-activities-at-the-border-kapil-dev", "urlToImage": null, "publishedAt": "2020-04-25T10:36:52Z", "content": null}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Washing vegetables more than I have washed my head: Suresh Raina on e-Agenda Aaj Tak - India Today", "description": "Suresh Raina and Harbhajan Singh were speaking about their life in the coronavirus lockdown while talking on e-Agenda Aaj Tak.", "url": "https://www.indiatoday.in/sports/cricket/story/suresh-rain-cleaning-toilets-washing-vegetables-more-than-i-have-ever-washed-my-head-humanity-harbhajan-singh-cricket-coronavirus-lockdown-pandemic-1670953-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T10:27:22Z", "content": "India bastman Suresh Raina was one of the first cricketers to contribute in the fight against the coronavirus pandemic in the country.\r\nThe swashbuckling left-hand batsman has also been very active on his social media handles and have spread out the messages … [+1206 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "“It Was Not an Easy Night”: Steve Kerr Narrates a Hilarious Betting Story of Michael Jordan From Their College Days - India Gone Viral", "description": "Golden State Warriors coach Steve Kerr revealed a funny betting story with his former teammate Michael Jordan. It was during a game when Kerr was playing for the University of Arizona while Jordan was", "url": "https://indiagoneviral.com/sports/2020/04/25/it-was-not-an-easy-night-steve-kerr-narrates-a-hilarious-betting-story-of-michael-jordan-from-their-college-days/42065/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T10:04:23Z", "content": "Golden State Warriors coach Steve Kerr revealed a funny betting story with his former teammate Michael Jordan.\r\nIt was during a game when Kerr was playing for the University of Arizona while Jordan was at the University of North Carolina. Kerrs Wildcats defea… [+2049 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Australian Government looking at travel exemptions for Indian cricket team’s Test tour: Reports - India Gone Viral", "description": "Home / Cricket / Australian Government looking at travel exemptions for Indian cricket team’s Test tour: Reports The Australian government might make travel exemptions for the Indian team’s tour Down", "url": "https://indiagoneviral.com/sports/2020/04/25/australian-government-looking-at-travel-exemptions-for-indian-cricket-teams-test-tour-reports/42066/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T10:04:18Z", "content": "Home / Cricket / Australian Government looking at travel exemptions for Indian cricket teams Test tour: ReportsThe Australian government might make travel exemptions for the Indian teams tour Down Under later this year to save the cricket board from losing a … [+2291 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "‘You don’t want the fear,’ Yuvraj Singh explains why cricket should return only after Covid-19 is e... - Hindustan Times", "description": "Like other sports, international and domestic cricket too has been disrupted leading the national boards to contemplate resuming the game in empty stadiums, without fans.", "url": "https://www.hindustantimes.com/cricket/you-don-t-want-the-fear-yuvraj-singh-explains-why-cricket-should-return-only-after-covid-19-is-eradicated/story-7okHJdLw1JTTSzbxY9JJ6L.html", "urlToImage": null, "publishedAt": "2020-04-25T09:34:05Z", "content": "Former India star Yuvraj Singh wants cricket to resume only when the world becomes COVD-19 free as players’ health and safety should be paramount for the custodians of the game.\r\nLike other sports, international and domestic cricket too has been disrupted lea… [+1271 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Mahalakshmi Murali", "title": "REPORTS: US Open 2020 To Be Relocated To California - Essentially Sports", "description": "US Open 2020 will be moved to Indian Wells Tennis Garden in California. The venue hosts America’s second-biggest tennis tournament, BNP Paribas Open.", "url": "https://www.essentiallysports.com/tennis-news-atp-wta-reports-us-open-2020-to-be-relocated-to-california/", "urlToImage": null, "publishedAt": "2020-04-25T09:12:00Z", "content": "The biggest tennis stadium in the United States,  USTA Billie Jean King National Tennis Center has been temporarily converted into a hospital amid the coronavirus pandemic. More than 450 beds have been laid down in the stadium and around 25,000 people are fed… [+2001 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Wasim Jaffer Reveals the First Thing He Will Do Once the Lockdown is Lifted in India - News18", "description": "The former Indian cricketer took to Twitter and asked fans and followers to list the first thing they would do after the lockdown restrictions were lifted from the country.", "url": "https://www.news18.com/news/buzz/wasim-jaffer-reveals-the-first-thing-he-will-do-once-the-lockdown-is-lifted-in-india-2592255.html", "urlToImage": null, "publishedAt": "2020-04-25T08:54:15Z", "content": "Former India cricketer Wasim Jaffer has revealed the first thing he would do once the nationwide lockdown is lifted amid the coronavirus outbreak.\r\nJaffer said he will take his family out for dinner once the lockdown ends on May 3. After that, he will bat in … [+2086 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "‘It still haunts us sometimes’: KL Rahul reveals which match gives him ‘nightmares’ - Hindustan Times", "description": "In the fifth episode of ‘The Mind Behind. Red Bull athlete, K.L. Rahul revealed how he is spending time amidst the lockdown, his experience playing for RCB, and his formative years in the cricket field.", "url": "https://www.hindustantimes.com/cricket/it-still-haunts-us-sometimes-kl-rahul-reveals-which-match-still-gives-him-nightmares/story-ZxVNtUBbfZgIxSu1Yp17aM.html", "urlToImage": null, "publishedAt": "2020-04-25T08:52:41Z", "content": "India’s star player KL Rahul got up close and personal with television presenter and commentator Suhail Chandhok in the fifth episode of ‘The Mind Behind’. Red Bull athlete, K.L. Rahul revealed how he is spending time amidst the lockdown, his experience playi… [+2847 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Akshat Gaur", "title": "Pat Cummins picks an Indian as the toughest batsman to bowl; terms him as 'pain in the... - The Cricket Times", "description": "Amid Coronavirus pandemic, cricketers are advancing towards social media platforms to engage with their fans and followers. In the process, Australia paceman Pat Cummins participated in an Instagram live Q/A session organised by the Australian Cricketers Asso…", "url": "https://crickettimes.com/2020/04/pat-cummins-picks-an-indian-as-the-toughest-batsman-to-bowl-terms-him-as-pain-in-the-back/", "urlToImage": null, "publishedAt": "2020-04-25T08:50:42Z", "content": "Amid Coronavirus pandemic, cricketers are advancing towards social media platforms to engage with their fans and followers. In the process, Australia paceman Pat Cummins participated in an Instagram live Q/A session organised by the Australian Cricketers Asso… [+1536 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Anushka Sharma’s Small Gesture During Virat Kohli’s Live Chat Leaves Him Blushing, Watch Here - News18", "description": "Virat Kohli was having an Instagram Live session when his wife helped him by turning on the lights of the room.", "url": "https://www.news18.com/news/movies/anushka-sharmas-small-gesture-during-virat-kohlis-live-chat-leaves-him-blushing-watch-here-2592223.html", "urlToImage": null, "publishedAt": "2020-04-25T08:34:28Z", "content": "Lovebirds Anushka Sharma and Virat Kohli are spending the lockdown time together at their home. The duo is having quite fun in their day to day routine, making each day special for each other.\r\nThe Indian cricket team captain recently had a live chat session … [+1684 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Can someone go better than God, we'll wait and see: Brett Lee on Sachin Tendulkar - Times of India", "description": "Cricket News: Former Australia speedster Brett Lee believes Virat Kohli can surpass the extraordinary feat of \"god\" Sachin Tendulkar. \"But, how can you say someone", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/can-someone-go-better-than-god-well-wait-and-see-brett-lee-on-sachin-tendulkar/articleshow/75371307.cms", "urlToImage": null, "publishedAt": "2020-04-25T08:25:39Z", "content": "NEW DELHI: Former Australia speedster Brett Lee believes Virat Kohli can surpass the extraordinary feats of \"god\" Sachin Tendulkar.\r\n\"We are talking about phenomenal numbers here, so you mentioned seven to eight years of cricket and at the rate he (Virat Kohl… [+2009 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "“The Winner Will Fight Khabib For the Title”- Dana White makes a huge statement - India Gone Viral", "description": "UFC 249 finally has a new venue. The event will take place at VyStar Veterans Memorial Arena in Jacksonville, Florida. The UFC pounced on a chance to hold their events in the Sunshine State as sports", "url": "https://indiagoneviral.com/sports/2020/04/25/the-winner-will-fight-khabib-for-the-title/42011/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T08:05:16Z", "content": "UFC 249 finally has a new venue. The event will take place at VyStar Veterans Memorial Arena in Jacksonville, Florida. The UFC pounced on a chance to hold their events in the Sunshine State as sports activities were deemed essential businesses. Dana White app… [+1803 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Maitreyee Joshi", "title": "“I Remember When Kobe First Picked Me..”: NBA Star Recalls Getting Respect and Validation From Kobe Bryant - Essentially Sports", "description": "Former Miami Heat star recalls the time when the NBA legend Kobe Bryant gave him validation that he had made it, without saying a word.", "url": "https://www.essentiallysports.com/nba-miami-heat-i-remember-when-kob-first-picked-me-nba-star-recalls-getting-respect-and-validation-from-kobe-bryant/", "urlToImage": null, "publishedAt": "2020-04-25T08:01:00Z", "content": "Rookies and veterans alike have always sought validation from NBA legends. Such validations were a dream come true when it came from someone like Kobe Bryant. Dwyane Wade was one such star, who received wordless recognition of his abilities from the late lege… [+1864 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "ESPNcricinfo staff", "title": "Former Australia allrounder Graeme Watson dies at 75 | ESPNcricinfo.com - ESPNcricinfo", "description": "He played five Tests for Australia in an injury-plagued career | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29096744/former-australia-allrounder-graeme-watson-dies-75", "urlToImage": null, "publishedAt": "2020-04-25T07:59:56Z", "content": "Graeme Watson, the former Australia allrounder who was battling cancer, has died at the age of 75. Primarily a middle-order batsman and a medium-pace bowler, he played five Tests from 1967 to 1972 and two ODIs in 1972.\r\nAfter starting his domestic career at V… [+1316 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "Saurabh Somani, Gaurav Sundararaman", "title": "Who is in our all-time Chennai Super Kings XI? | ESPNcricinfo.com - ESPNcricinfo", "description": "Plenty of straightforward picks for the three-time IPL-winning side, but who makes it as their final overseas batsman? | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29096846/ms-dhoni-leads-power-packed-all-chennai-super-kings-xi", "urlToImage": null, "publishedAt": "2020-04-25T07:59:47Z", "content": "In this new series, we compile all-time XIs for each IPL team. The rules are simple: the player has to have played at least 20 matches for the franchise (across the IPL and the Champions League T20); one player is eligible for selection in multiple franchises… [+3928 chars]"}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "Rohaan1997", "title": "Chelsea find no takers for Kepa, so he gets another chance to save his job - We Ain't Got No History", "description": "Chelsea will look to upgrade the backup goalkeeper position instead this summer", "url": "https://weaintgotnohistory.sbnation.com/chelsea-fc-transfer-rumours-news/2020/4/25/21232438/chelsea-find-no-takers-for-kepa-so-he-gets-another-chance-to-save-his-job-reports", "urlToImage": null, "publishedAt": "2020-04-25T06:50:22Z", "content": "Despite Kepas mixed performances since his arrival from Athletic Bilbao two years, it doesnt take rocket science to figure out that offloading him in order to make space for a new goalkeeper would be enormously difficult due to his world-record 80m fee and £1… [+1484 chars]"}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "Rohaan1997", "title": "Chelsea ‘direct contacts’ for Dries Mertens - We Ain't Got No History", "description": "Never-ending links!", "url": "https://weaintgotnohistory.sbnation.com/chelsea-fc-transfer-rumours-news/2020/4/25/21235807/chelsea-direct-contacts-for-dries-mertens-reports", "urlToImage": null, "publishedAt": "2020-04-25T06:16:28Z", "content": "Despite Chelsea reportedly agreeing a one-year extension with Olivier Giroud, the veteran strikers future is hardly certain, with the move (if true) largely seen as Chelsea ensuring that we dont lose him for free in the summer.\r\nIn the meantime, Chelsea conti… [+1274 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": null, "title": "Taipei T10 League 2020: Fixtures, Schedule, Squads, Broadcast & Live Streaming Details - CricTracker", "description": "Finally, some cricketing action is resuming amid the Coronavirus pandemic. Taiwan is set to host the first of its kind, Taipei T10 League", "url": "https://m.crictracker.com/taipei-t10-league-2020-fixtures-schedule-squads-broadcast-live-streaming-details/", "urlToImage": null, "publishedAt": "2020-04-25T05:51:02Z", "content": "Yingfeng Cricket Ground in Songshan District. (Photo Source: Twitter)\r\nFinally, some cricketing action is resuming amid the Coronavirus pandemic. Taiwan is set to host the first of its kind, Taipei T10 League which will commence on April 25. As many as eight … [+5130 chars]"}, {"source": {"id": null, "name": "Thesportsrush.com"}, "author": "Gautam Kapoor", "title": "GAL vs DRG Premium Dream11 Prediction : Galkan Vs Dragon Oil Best Dream 11 Team for Turkmenistan Basketball League Match - The Sportsrush", "description": "GAL Vs DRG Dream11 Team Overview, Match Centre And Probable Playing 5: Fifth and sixth go at loggerheads in what promises to be an enticing encounter On a two game losing spree at the moment, for Dragon Oil, the last week has been nothing short of an aberrati…", "url": "https://thesportsrush.com/gal-vs-drd-premium-dream11-prediction-galkan-vs-dragon-oil-best-dream-11-team-for-turkmenistan-basketball-league-match/", "urlToImage": null, "publishedAt": "2020-04-25T05:08:00Z", "content": "GAL Vs DRG Dream11 Team Overview, Match Centre And Probable Playing 5: Fifth and sixth go at loggerheads in what promises to be an enticing encounter \r\nOn a two game losing spree at the moment, for Dragon Oil, the last week has been nothing short of an aberra… [+4424 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Akshat Gaur", "title": "Prithvi Shaw names his favourite opening... - The Cricket Times", "description": "The lockdown was extended in India to May 3 after seeing the rise in Coronavirus affected patients. Amid the lockdown, many cricketers have rolled over towards social media to interact with their fans and followers. Not so long ago, cricketers like Virat Kohl…", "url": "https://crickettimes.com/2020/04/prithvi-shaw-names-his-favourite-opening-partner/", "urlToImage": null, "publishedAt": "2020-04-25T04:41:49Z", "content": "The lockdown was extended in India to May 3 after seeing the rise in Coronavirus affected patients. Amid the lockdown, many cricketers have rolled over towards social media to interact with their fans and followers. Not so long ago, cricketers like Virat Kohl… [+1500 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "No to saliva, yes to shine: Ball-tampering laws in cricket may change - Times of India", "description": "Cricket News: Cricket may change ball-tampering laws and approve external method to help polish the red cherry in proposed post-corona measures. The matter of saliv", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/no-to-saliva-yes-to-shine-ball-tampering-laws-in-cricket-may-change/articleshow/75367490.cms", "urlToImage": null, "publishedAt": "2020-04-25T04:40:29Z", "content": "NEW DELHI: The coronavirus pandemic may force cricket's world governing body to tweak one of its oldest rules and approve the use of an artificial substance to help shine the ball, effectively legalizing what has for long been a core tenet of the sport's anti… [+4836 chars]"}, {"source": {"id": null, "name": "Thesportreview.com"}, "author": "Transfer Agent", "title": "Man United have plan to accommodate Jack Grealish in their line-up – report - The Sport Review", "description": "Manchester United will deploy Jack Grealish as a right winger if they sign him from Aston Villa this summer, according to reports. The Athletic, as quoted", "url": "https://www.thesportreview.com/2020/04/man-united-news-jack-grealish-report/", "urlToImage": null, "publishedAt": "2020-04-25T03:30:00Z", "content": "Manchester United will deploy Jack Grealish as a right winger if they sign him from Aston Villa this summer, according to reports.\r\nThe Athletic, as quoted by the Birmingham Mail, is reporting that the Red Devils are already thinking about ways that they can … [+989 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "George Dobell", "title": "UK government hands ECB lead on viability of 'bio-secure' sport | ESPNcricinfo.com - ESPNcricinfo", "description": "England will play at as few grounds as possible if cricket goes behind closed doors, says ECB CEO | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29094232/uk-government-hands-ecb-lead-viability-bio-secure-sport", "urlToImage": null, "publishedAt": "2020-04-25T02:19:30Z", "content": "The ECB has been asked by the UK government to lead the way into investigating the viability of playing sport in a bio-secure environment.\r\nWith an increasing acceptance that the best chance of fulfilling the broadcast deals that keep nearly all sport afloat … [+8018 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "FIDE Chess.com Online Nations Cup: Teams Revealed - India Gone Viral", "description": "The line-ups for the six teams that will play the FIDE Chess.com Nations Cup have been revealed. There are big stars among both the team captains and players. The FIDE Chess.com Online Nations Cup is", "url": "https://indiagoneviral.com/sports/2020/04/25/fide-chess-com-online-nations-cup-teams-revealed/41810/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T01:58:01Z", "content": "The line-ups for the six teams that will play the FIDE Chess.com Nations Cup have been revealed. There are big stars among both the team captains and players.\r\nThe FIDE Chess.com Online Nations Cup is a team competition held from May 5-10, 2020 on Chess.com f… [+8388 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Transfer news and rumours LIVE: Chelsea launch Mertens bid - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T01:50:00Z", "content": "More"}, {"source": {"id": null, "name": "Dawn.com"}, "author": "AFP", "title": "‘Dhoni unlikely to play for India again’ - DAWN.com", "description": "Dhoni, 38, has not appeared for club or country since last year’s 50-over World Cup.", "url": "https://www.dawn.com/news/1551986", "urlToImage": null, "publishedAt": "2020-04-25T01:43:50Z", "content": "NEW DELHI: Veteran off-spinner Harbhajan Singh said he doesnt think Mahendra Singh Dhoni will play for India again, adding to the guessing game over the future of the superstar former captain. \r\nDhoni, 38, has not appeared for club or country since last years… [+1135 chars]"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Barca Blaugranes Staff", "title": "Barcelona want €45m for Nelson Semedo - report - Barca Blaugranes", "description": "The defender is  up for sale", "url": "https://www.barcablaugranes.com/fc-barcelona-transfer-rumors-news/2020/4/25/21234908/barcelona-want-45m-for-nelson-semedo-report", "urlToImage": null, "publishedAt": "2020-04-25T01:14:53Z", "content": "Barcelona are reportedly willing to sell Nelson Semedo in the summer transfer window but want 45 million for the right-back.\r\nThe club have brought a halt to talks over a new contract because of the coronavirus pandemic which has prompted his agent Jorge Mend… [+477 chars]"}, {"source": {"id": null, "name": "Chessbase.com"}, "author": "", "title": "Magnus Carlsen Invitational: Carlsen and Caruana score convincing wins - Chessbase News", "description": "World numbers one and two, Magnus Carlsen and Fabiano Caruana, won their round-four matches without needing tiebreaks, thus collecting three points each. Carlsen has won all his confrontations so far and is the clear leader with eleven points. He defeated Max…", "url": "https://en.chessbase.com/post/magnus-carlsen-invitational-2020-r4-a", "urlToImage": null, "publishedAt": "2020-04-25T00:34:12Z", "content": "4/25/2020 – World numbers one and two, Magnus Carlsen and Fabiano Caruana, won their round-four matches without needing tiebreaks, thus collecting three points each. Carlsen has won all his confrontations so far and is the clear leader with eleven points. He … [+5679 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Manchester City star Raheem Sterling admits he wants to own shirt from Barcelona star Lionel Messi - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T22:53:08Z", "content": "More"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Manchester United chief Woodward warns transfer market won't be 'business as usual' for his side - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T22:10:42Z", "content": "More"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Kho kho captain strikes gold, lands in penury - Times of India", "description": "The Covid-19 pandemic brought despair for Nasreen and her family. She landed a contractual job with Airports Authority of India (AAI) last year, but s", "url": "https://timesofindia.indiatimes.com/city/delhi/kho-kho-captain-strikes-gold-lands-in-penury/articleshow/75362916.cms", "urlToImage": null, "publishedAt": "2020-04-24T22:04:42Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Liverpool city council to investigate Atletico Madrid match over potential Covid-19 impact - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T21:20:38Z", "content": "More"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'On July 1, I'll be a Chelsea player' - Ziyech prepped for Stamford Bridge move despite uncertainty - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T20:26:22Z", "content": "More"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Adnan Riaz", "title": "Ronaldo And Ronaldinho Finally Answer GOAT Debate Between Lionel Messi And Cristiano Ronaldo - SPORTbible", "description": "Ronaldinho and Ronaldo praised Lionel Messi and Cristiano Ronaldo, but they both chose the same player in the footballing GOAT debate.", "url": "https://www.sportbible.com/football/news-rivalries-ronaldo-and-ronaldinho-answer-goat-debate-between-messi-and-cristiano-20200424", "urlToImage": null, "publishedAt": "2020-04-24T18:53:18Z", "content": "Brazilian legends Ronaldinho and Ronaldo revealed that they would choose Lionel Messi ahead of Cristiano Ronaldo as the 'GOAT of football.'\r\nMessi and Ronaldo's status as two of the best players in the history of the sport has led to many debating who is the … [+1624 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": null, "title": "Vanuatu Women’s T20 Super League 2020, Playoff Final – Powerhouse Sharks vs Tafea Blackbirds: Dream11 Fantasy Cricket Tips – Playing XI, Pitch Report & Injury Update - CricTracker", "description": "Vanuatu Women’s T20 Super League: Dream11 Fantasy Cricket Tips, Playing XIs, Vanuatu Pitch Report & Injury News for Powerhouse Sharks vs Tafea Blackbirds", "url": "https://m.crictracker.com/vanuatu-womens-t20-super-league-2020-playoff-final-powerhouse-sharks-vs-tafea-blackbirds-dream11-fantasy-cricket-tips-playing-xi-pitch-report-injury-update/", "urlToImage": null, "publishedAt": "2020-04-24T17:45:37Z", "content": "Vanuatu Women’s team in 2019. (Photo Source: Twitter)\r\nMatch Details:\r\nThe Playoff final of Vanuatu Womens T20 Super League 2020 will be played between Powerhouse Sharks Women and Tafea Blackbirds Women at the Vanuatu Cricket Ground Second Oval.\r\nThe match st… [+3857 chars]"}, {"source": {"id": null, "name": "Football-espana.net"}, "author": "Colin Millar", "title": "La Liga president Tebas confirms promotion and relegation if 'season is not completed' - Football Espana", "description": "La Liga president Javier Tebas has said that in the event of the 2019/20 campaign not being concluded, there would be promotion and relegation in place. There are growing fears that the 2019/20 campaign will not be completed due to the indefinite suspension o…", "url": "https://www.football-espana.net/2020/04/24/la-liga-president-tebas-confirms-promotion-and-relegation-if-season-is-not-completed", "urlToImage": null, "publishedAt": "2020-04-24T17:01:00Z", "content": "La Liga president Javier Tebas has said that in the event of the 2019/20 campaign not being concluded, there would be promotion and relegation in place.\r\nThere are growing fears that the 2019/20 campaign will not be completed due to the indefinite suspension … [+1091 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Ibrahimovic slams 'kindergarten-level' vandals who attacked AC Milan forward's statue in Malmo - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T16:14:00Z", "content": "More"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Ajax denied title as Eredivisie ends season without promotion and relegation - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T15:34:00Z", "content": "More"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "‘Moving Asia Cup to accommodate IPL unacceptable for PCB’ - Hindustan Times", "description": "The PCB had initially wanted the Asia Cup to be held in Pakistan but it was eventually decided to be held in the United Arab Emirates in September.", "url": "https://www.hindustantimes.com/cricket/moving-asia-cup-to-accommodate-ipl-unacceptable-for-pcb/story-WiidgvAiwFQb2hzALI686H.html", "urlToImage": null, "publishedAt": "2020-04-24T15:16:23Z", "content": "Making any change to the schedule of the Asia Cup to accommodate the Indian Premier League (IPL) will be objected by the Pakistan Cricket Board (PCB), CEO Wasim Khan said.\r\n“Our stance is absolutely clear, the Asia Cup is set for September and the only reason… [+1250 chars]"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Barca Blaugranes Staff", "title": "Bayern announce Philippe Coutinho has undergone ankle surgery - Barca Blaugranes", "description": "The Barcelona loanee has gone under the knife", "url": "https://www.barcablaugranes.com/2020/4/24/21234464/philippe-coutinho-undergoes-successful-ankle-surgery", "urlToImage": null, "publishedAt": "2020-04-24T15:07:34Z", "content": "Bayern Munich have announced that Philippe Coutinho has undergone ankle surgery and will be sidelined for a couple of weeks before beginning his recovery.\r\nThe Brazilian, who is on a season-long loan from Barcelona, went under the knife during which loose joi… [+601 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Keane sees 'long way back' for Man Utd & remains unconvinced by Shaw - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T14:54:00Z", "content": "More"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Lucky to get team management's backing after injuries: Bhuvneshwar Kumar - Times of India", "description": "Cricket News: It is tough to make a comeback after a lengthy injury layoff but the team management's support makes the job easier, says right-arm medium pacer Bhuvn", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/lucky-to-get-team-managements-backing-after-injuries-bhuvneshwar-kumar/articleshow/75352116.cms", "urlToImage": null, "publishedAt": "2020-04-24T14:14:00Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Rohit Sharma picks his top 5 India batsmen of all time - Hindustan Times", "description": "Sourav Ganguly, Sachin Tendulkar, Rahul Dravid, VVS Laxman and Virender Sehwag all made the list but Rohit included the caveat that these are the players that he has seen in action.", "url": "https://www.hindustantimes.com/cricket/rohit-sharma-picks-his-top-5-india-batsmen-of-all-time/story-kPLmdYWE0Bb4VrtVrA1DOP.html", "urlToImage": null, "publishedAt": "2020-04-24T14:10:00Z", "content": "Indian cricket team batsman Rohit Sharma was asked to pick the top five India batsman and he decided to include five modern legends in his name. Sourav Ganguly, Sachin Tendulkar, Rahul Dravid, VVS Laxman and Virender Sehwag all made the list but Rohit include… [+1908 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "James Olley", "title": "Chelsea want Arsenal's Aubameyang as alternative to Werner, Dembele - sources - ESPN India", "description": "Chelsea are monitoring Pierre-Emerick Aubameyang's contract situation at Arsenal with a view to making a move this summer, sources have told ESPN.", "url": "https://www.espn.in/football/soccer-transfers/story/4088766/chelsea-want-arsenals-aubameyang-as-alternative-to-wernerdembele-sources", "urlToImage": null, "publishedAt": "2020-04-24T14:04:26Z", "content": "Chelsea are closely monitoring Pierre-Emerick Aubameyang's contract situation at Arsenal with a view to making a move this summer, sources have told ESPN.\r\n-Stream new episodes of ESPN FC Monday-Friday on ESPN+- Stream every episode of 30 for 30: Soccer Stori… [+3918 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Scroll Staff", "title": "Felt embarrassed after Sachin Tendulkar spoke to me about my sledging: Saqlain Mushtaq - Scroll.in", "description": "Former Pakistan off-spinner recalls an incident with the Indian batting legend during a match in the Sahara Cup in Canada.", "url": "https://scroll.in/field/960158/felt-embarrassed-after-sachin-tendulkar-spoke-to-me-about-my-sledging-saqlain-mushtaq", "urlToImage": null, "publishedAt": "2020-04-24T13:54:00Z", "content": "Former Pakistan off-spinner Saqlain Mushtaq on Friday remembered a tense battle with Indian batting legend Sachin Tendulkar in 1990s, leaving him embarrassed following a war of words. \r\nIn one of his early battles with Tendulkar during the Sahara Cup in Canad… [+3279 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'Mane has been the total package' - De Bruyne names Liverpool forward as his player of the season - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T13:12:00Z", "content": "More"}, {"source": {"id": null, "name": "Tbrfootball.com"}, "author": "Will Butcher", "title": "Report: Tottenham offered two Barcelona stars in return for Tanguy Ndombele - TBR - The Boot Room - Football News", "description": "Sky Sports have claimed that Tottenham Hotspur have been offered the chance to sign Barcelona duo Nelson Semedo and Samuel Umtiti, in a swap deal for Tanguy Ndombele. Ndombele, 23, has struggled in his first season at Tottenham since joining the club from a c…", "url": "https://tbrfootball.com/report-tottenham-offered-two-barcelona-stars-in-return-for-tanguy-ndombele/", "urlToImage": null, "publishedAt": "2020-04-24T12:50:00Z", "content": "Sky Sports have claimed that Tottenham Hotspur have been offered the chance to sign Barcelona duo Nelson Semedo and Samuel Umtiti, in a swap deal for Tanguy Ndombele.\r\nNdombele, 23, has struggled in his first season at Tottenham since joining the club from a … [+1183 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "Kevin Pietersen reacts to Michael Vaughan's 'jealousy'... - The Cricket Times", "description": "Former England batsman Kevin Pietersen responded to Michael Vaughan spilling beans about the atmosphere of the England side when the former bagged a lucrative IPL contract in 2009. Vaughan claimed about factions in the team envious about KP being recruited by…", "url": "https://crickettimes.com/2020/04/kevin-pietersen-reacts-to-michael-vaughans-jealousy-statement/", "urlToImage": null, "publishedAt": "2020-04-24T12:26:46Z", "content": "Former England batsman Kevin Pietersen responded to Michael Vaughan spilling beans about the atmosphere of the England side when the former bagged a lucrative IPL contract in 2009.\r\nVaughan claimed about factions in the team envious about KP being recruited b… [+2074 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Pornographic images pop-up as top badminton coaches left red-faced during online training session - India Today", "description": "An online training session held by Sports Authority of India (SAI) and Badminton Association of India (BAI) was abruptly ended of Thursday after pornographic images popped up on the screens.", "url": "https://www.indiatoday.in/sports/badminton/story/pornographic-images-bai-sai-online-training-session-pullela-gopichand-coach-badminton-zoom-videoconferencing-app-coronavirus-pandemic-1670627-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T12:13:35Z", "content": "The online training session held by Sports Authority of India (SAI) and Badminton Association of India (BAI) found itself in an unwanted situation after pornographic images suddenly flashed on the screens of 700-plus coaches across the country on Thursday.\r\nT… [+2211 chars]"}, {"source": {"id": null, "name": "Sportscafe.in"}, "author": "SportsCafe Desk", "title": "Reports | Post COVID-19, ICC might legalise ball tampering to compensate for no saliva use - SportsCafe", "description": "As Coronavirus outbreak created a ripple around the world of cricket, the ICC is contemplating to legalise ball tampering to compensate for no saliva use in the immediate aftermath of the sport. If that happens, one of the greatest taboos of the sport will fo…", "url": "https://sportscafe.in/cricket/articles/2020/apr/24/post-covid-19-icc-might-allow-ball-tampering-to-compensate-for-no-saliva-use", "urlToImage": null, "publishedAt": "2020-04-24T11:59:12Z", "content": "As Coronavirus outbreak created a ripple around the world of cricket, the ICC is contemplating to legalise ball tampering to compensate for no saliva use in the immediate aftermath of the sport. If that happens, one of the greatest taboos of the sport will fo… [+1635 chars]"}, {"source": {"id": null, "name": "Icc-cricket.com"}, "author": "ICC", "title": "Live cricket resumes this weekend in Vanuatu - International Cricket Council", "description": "Live cricket action returns this weekend in Vanuatu, with many of the country's best players in action – and doing so for a good cause.", "url": "https://www.icc-cricket.com/news/1660447/live-cricket-resumes-this-weekend-in-vanuatu", "urlToImage": null, "publishedAt": "2020-04-24T10:48:55Z", "content": "Live cricket action returns this weekend in Vanuatu, with many of the country's best players in action and doing so for a good cause.COVID-19 has brought live sports to a grinding halt globally even as governments and frontline workers strive to fight the pan… [+2666 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘He was a nightmare’: James Anderson, Stuart Broad name toughest batsman to bowl at - Hindustan Times", "description": "When asked about which batsman was the toughest to bowl against in their career, both had the same answer, former South Africa opener and captain Graeme Smith.", "url": "https://www.hindustantimes.com/cricket/he-was-a-nightmare-james-anderson-stuart-broad-name-toughest-batsman-to-bowl-at/story-QL2mlt84USC8Ay8K9e1g8O.html", "urlToImage": null, "publishedAt": "2020-04-24T09:28:05Z", "content": "James Anderson and Stuart Broad together form one of the most successful new ball duos in Test cricket. Both have bowled in tandem and wreaked havoc on touring batsmen in the helpful English conditions for many years now. Anderson has a record 584 wickets to … [+1507 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express News Service", "title": "BCCI proposed new revenue sharing model at ICC meet - The Indian Express", "description": "It is learnt that during the global body’s Chief Executives’ Committee (CEC) meeting on Thursday, BCCI secretary Jay Shah proposed a new revenue distribution system that will look after all cricket boards.", "url": "https://indianexpress.com/article/sports/cricket/bcci-proposed-new-revenue-sharing-model-at-icc-meet-6376608/", "urlToImage": null, "publishedAt": "2020-04-24T07:57:33Z", "content": "BCCI has assured the other cricket boards, feeling the pinch of a global economic meltdown, of its support. (File)The BCCI wants to lead the post Covid-19 cricket world, as it has laid out the roadmap for the future ICC functioning. It is learnt that during t… [+2213 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Rob Hoskin", "title": "Liverpool set to be crowned 2019/20 champions after UEFA effectively remove 'null and void' - GIVEMESPORT", "description": "Liverpool set to be crowned 2019/20 champions after UEFA effectively remove 'null and void'", "url": "https://www.givemesport.com/1564557-liverpool-set-to-be-crowned-201920-champions-after-uefa-effectively-remove-null-and-void", "urlToImage": null, "publishedAt": "2020-04-24T07:02:19Z", "content": "If at the start of March you’d have told any Liverpool fan they wouldn’t have won the Premier League title by now, they’d never have believed you.\r\nIt was just a matter of time before Jurgen Klopp's side were crowned champions in sensational style, winning 27… [+1657 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "Middlesex opt to furlough players and staff - Cricbuzz - Cricbuzz", "description": "The club has also announced pay cuts across spectrum with the senior management taking the biggest cut", "url": "https://www.cricbuzz.com/cricket-news/112921/middlesex-opt-to-furlough-players-and-staff", "urlToImage": null, "publishedAt": "2020-04-24T04:57:09Z", "content": "A general view outside Lord's Cricket Ground, home of Middlesex County Cricket Club © Getty\r\nMiddlesex, the 2016 County Championship winners, have announced the decision to furlough players and most of their operating staff (including administrative and suppo… [+2889 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Tyler Lauletta", "title": "The 26 best players still available after the first round of the NFL draft - Insider - INSIDER", "description": "The first round of the 2020 NFL draft is in the books, but there's still plenty of talent left on the board.", "url": "https://www.insider.com/nfl-draft-best-players-available-round-2-3-2020-4", "urlToImage": null, "publishedAt": "2020-04-24T04:49:46Z", "content": "The first round of the 2020 NFL draft went about as smoothly as one could have imagined.\r\nDespite being forced to overhaul the broadcast because of the coronavirus pandemic, the NFL pulled off an impressive feat, getting through all 32 first-round picks with … [+469 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "ESPN", "title": "LIVE Transfer Talk: Man United's Paul Pogba now a target for Inter Milan - ESPN India", "description": "Juventus and Real Madrid were seen as front-runners for Paul Pogba, but now Inter Milan are in the mix. Transfer Talk is LIVE with the latest.", "url": "https://www.espn.in/football/soccer-transfers/story/4088511/transfer-talk-manchester-uniteds-paul-pogba-now-a-target-for-inter-milan", "urlToImage": null, "publishedAt": "2020-04-23T22:15:48Z", "content": "The winter transfer window is closed, but now it's time to look ahead to the summer! Here are the new rumours floating around Europe's big leagues and beyond.\r\nTOP STORY: Inter Milan enter Pogba race\r\nInter Milan are said to have entered the race to sign Manc… [+13403 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Harbhajan Singh points out differences between Mumbai Indians and Chennai Super Kings - Hindustan Times", "description": "Harbhajan Singh has won the tournament with both the teams and he pointed out the differences in approach when it comes to the two sides.", "url": "https://www.hindustantimes.com/cricket/harbhajan-singh-points-out-differences-between-mumbai-indians-and-chennai-super-kings/story-FvFBGZlIqmwZmafXTozD1M.html", "urlToImage": null, "publishedAt": "2020-04-23T16:13:37Z", "content": "Senior India spinner Harbhajan Singh has been a part of the Indian Premier League (IPL) since its inception and he has played for both Chennai Super Kings and Mumbai Indians - the two most successful sides in the tournament. When MI have won the tournament fo… [+1589 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Agence France-Presse", "title": "German football targets May 9 restart but needs political green light - Hindustan Times", "description": "Following a meeting with Germany’s top clubs, Christian Seifert said the league was “ready” to return next month, which would make it the first major European football competition to do so.", "url": "https://www.hindustantimes.com/cricket/german-football-targets-may-9-restart-but-needs-political-green-light/story-t7DwBJCXabWw5ZQPilIZXN.html", "urlToImage": null, "publishedAt": "2020-04-23T15:43:51Z", "content": "German league football is ready to resume without spectators on May 9 but the final say rests with political leaders, the Bundesliga’s chief executive said Thursday.\r\nFollowing a meeting with Germany’s top clubs, Christian Seifert said the league was “ready” … [+3383 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "India Today League PUBG MOBILE Invitational match reports: SouL top Day 1 despite losing Chicken Dinner - India Today", "description": "All four match reports of India Today League PUBG Mobile Invitational: Team Soul finished on top with 61 points followed by TSM Entity with 52 points (27 kill pts, 25 position pts), Fnatic (49 pts), Celtz (43 pts) and Powerhouse (43 pts).", "url": "https://www.indiatoday.in/sports/gaming/story/india-today-league-itpubl-pubg-mobile-invitational-day-1-match-reports-soul-celtz-mayhem-powerhouse-fnatic-1670248-2020-04-23", "urlToImage": null, "publishedAt": "2020-04-23T13:29:55Z", "content": "Team SouL topped the standings after 4 matches on Day 1 of the India Today League PUBG Mobile Invitational tournament without even winning a single Chicken Dinner on Thursday.\r\nSouL finished with 61 points with 31 kill points and 30 position points. TSM Entit… [+3232 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Pakistan batsmen’s 30s, 40s was for team, Indian players’ 100s was for themselves: Inzamam - Hindustan Times", "description": "Former Pakistan captain Inzamam-ul-Haq played in an era where his side had a better record over India as compared to the recent times.", "url": "https://www.hindustantimes.com/cricket/pakistan-batsmen-s-30s-40s-was-for-team-indian-players-100s-was-for-themselves-inzamam/story-4HQnGc5wJwWbnZhwlQqyGL.html", "urlToImage": null, "publishedAt": "2020-04-23T11:02:00Z", "content": "Former Pakistan captain Inzamam-ul-Haq played in an era where his side had a better record over India as compared to the recent times. Speaking about the same with Rameez Raja on his YouTube show, Inzamam said that despite the fact that India’s batting order … [+1687 chars]"}]}