{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Standard.co.uk"}, "author": "ALEX YOUNG", "title": "Heung-min Son military training: Tottenham star shows off new haircut after first week - Evening Standard", "description": "", "url": "https://www.standard.co.uk/sport/football/tottenham-heungmin-son-military-training-pictures-south-korea-hair-cut-a4424341.html", "urlToImage": null, "publishedAt": "2020-04-26T12:13:29Z", "content": "Tottenham star Heung-min Son isn't the only one sporting a sharper look during the coronavirus lockdown.\r\nSon, though, has not been forced to go clippers in hand due to a lack of available hairdressers, rather photos have emerged of Son with a supposed milita… [+844 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Kobé Tong", "title": "Cristiano Ronaldo: Football fan's video of Juventus 3-0 Atletico Madrid in 2019 - GIVEMESPORT", "description": "Cristiano Ronaldo: Football fan's video of Juventus 3-0 Atletico Madrid in 2019", "url": "https://www.givemesport.com/1564970-cristiano-ronaldo-football-fans-video-of-juventus-30-atletico-madrid-in-2019", "urlToImage": null, "publishedAt": "2020-04-26T10:29:08Z", "content": "Atletico Madrid fans must wake up in hot sweats thinking about Cristiano Ronaldo.\r\nAs well as being the greatest goal-scorer to ever play for their bitter rivals Real Madrid, you'd be forgiven for thinking that Ronaldo had a personal vendetta against Los Roji… [+2876 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Sports in times of COVID-19: Top Indian stars foresee new normal once pandemic mayhem ends - Times of India", "description": "More sports News: Will sports and watching sports ever be the same again in a world scarred by the COVID-19 pandemic? India's sportspersons -- current and former -- gaz", "url": "https://timesofindia.indiatimes.com/sports/more-sports/others/sports-in-times-of-covid-19-top-indian-stars-foresee-new-normal-once-pandemic-mayhem-ends/articleshow/75388631.cms", "urlToImage": null, "publishedAt": "2020-04-26T10:26:04Z", "content": "NEW DELHI: Will the fans rush back? Will training abroad be as hassle-free as it used to be? What about contact sports where social distancing can't really be practised?\r\nIn a nutshell, will sports and watching sports ever be the same again in a world scarred… [+6513 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "MS Dhoni always takes responsibility when team loses, says Mohit Sharma - Times of India", "description": "Cricket News: He has played most of his cricket under MS Dhoni and pacer Mohit Sharma says the revered former India skipper is a true leader who does not back off w", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/ms-dhoni-always-takes-responsibility-when-team-loses-says-mohit-sharma/articleshow/75388665.cms", "urlToImage": null, "publishedAt": "2020-04-26T10:26:03Z", "content": "NEW DELHI: He has played most of his cricket under MS Dhoni and pacer Mohit Sharma says the revered former India skipper is a true leader who does not back off when it comes to taking responsibility in challenging times.\r\nThe 31-year-old pacer has played unde… [+2580 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "India Today League PUBG Mobile Invitational Day 4 live: SouL win Miramar after TSM ENTITY's perfect start - India Today", "description": "India Today League PUBG Mobile Invitational Final Day Live: Team SouL have added spice to what looked like a 1-way race to the finish line. After TSM ENTITY won the Match 1 in Sanhok to extend the lead, SouL win Match 2 in Miramar to make a strong comeback. C…", "url": "https://www.indiatoday.in/sports/story/india-today-league-pubg-mobile-invitational-2020-final-day-live-updates-1671231-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T10:02:03Z", "content": "Hello and Welcome to live updates of crucial final day of India Today League PUBG Mobile Invitational where teams will look to give a final push to gain massive lead in the points table and clinch the unprecedented prize money.\r\nIndia Today League PUBG Mobile… [+8801 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Minamino can save Liverpool millions despite unusual start - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T10:00:00Z", "content": "More"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Sports Desk", "title": "'Don't talk to Sachin, if you do..': Brett Lee reveals Glenn McGrath's warning to bowlers for Tendulkar - India TV News", "description": "Brett Lee has revealed what Glenn McGrath used to tell the Australian bowlers before facing Sachin Tendulkar.", "url": "https://www.indiatvnews.com/sports/cricket-brett-lee-reveals-glenn-mcgrath-s-warning-to-bowlers-for-sachin-tendulkar-611457", "urlToImage": null, "publishedAt": "2020-04-26T09:20:14Z", "content": "Image Source : GETTY IMAGESBrett Lee has revealed what Glenn McGrath used to tell the Australian bowlers before facing Sachin Tendulkar.\r\nThe Australian cricket team has always been high on energy on the field -- both, with their skills and demeanour. The sid… [+1748 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘You almost finished my son’s career,’ Yuvraj Singh recalls 2007 six sixes, reveals chat with Broad... - Hindustan Times", "description": "Yuvraj slammed six maximums in one Broad over during his majestic 14-ball 58 which ultimately proved to be the difference between the two sides as India won the match by 18 runs.", "url": "https://www.hindustantimes.com/cricket/you-almost-finished-my-son-s-career-yuvraj-singh-recalls-2007-six-sixes-reveals-chat-with-broad-senior/story-9tCJTh6ddis6UBw9JpmstJ.html", "urlToImage": null, "publishedAt": "2020-04-26T08:55:46Z", "content": "One of the most iconic moments in world cricket is Yuvraj Singh hitting Stuart Broad for six sixes in an over at the 2007 T20 World Cup. India were in a strong position in the match against England but Yuvraj propelled his country to a mammoth score with six … [+1870 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Divya Goyal", "title": "‘Waheguru Baba’ to friends in Glasgow, ‘ustad’ to world’s oldest marathoner dies of Covid-19 - The Indian Express", "description": "Amrik Singh, 89, passed away at Birmingham's City Hospital with doctors struggling to understand his last words.", "url": "https://indianexpress.com/article/sports/waheguru-baba-to-friends-ustad-to-worlds-oldest-marathoner-dies-6379611/", "urlToImage": null, "publishedAt": "2020-04-26T08:48:06Z", "content": "Written by Divya Goyal\r\n | Ludhiana | \r\nUpdated: April 26, 2020 2:17:07 pm\r\nAmrik Singh, a Sikh marathon runner who was known as Waheguru Baba, had moved to Glasgow in Scotland in 1970. (Express photo)Sagey bhraavan vich khaar hundi hai, saada taan imaandaari… [+6933 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "He will give all to save me: KL Rahul names one cricketer he would pick to bat for life - Hindustan Times", "description": "In the ODI series against New Zealand earlier this year, which India lost 3-0, Rahul scored an unbeaten 88 in the first ODI and then followed it up with a ton in the 3rd ODI.", "url": "https://www.hindustantimes.com/cricket/he-will-give-all-to-save-me-kl-rahul-names-one-cricketer-he-would-pick-to-bat-for-life/story-8lmr6y3FAT3HOk20LyzyEK.html", "urlToImage": null, "publishedAt": "2020-04-26T08:36:00Z", "content": "India batsman KL Rahul had been in tremendous form in the year 2020. The right-handed batsman was given the task of playing an opening batsman, a wicketkeeper, batting at no. 5 position, and also to hold the captaincy position in a match this year - and the K… [+1248 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Will Tell TikTok to Block You because You're Annoying: Chris Gayle Trolls Yuzvendra Chahal - News18", "description": "Gayle referred to Chahal as 'annoying' and went on to the extent of saying that he is going to block him.", "url": "https://www.news18.com/news/buzz/will-tell-tiktok-to-block-you-because-youre-annoying-chris-gayle-trolls-yuzvendra-chahal-2593275.html", "urlToImage": null, "publishedAt": "2020-04-26T08:34:30Z", "content": "West Indies batsman Chris Gayle brutally roasted India spinner Yuzvendra Chahal for his social media posts during a live session on popular social media platform Instagram. With no cricket going due to coronavirus pandemic, players are engaging with fans thes… [+1055 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Rishi Karthikeyan", "title": "“He Has Never Cooked For Me” – Rafael Nadal Unsure If Roger Federer Can Cook - Essentially Sports", "description": "What skill would be the easiest to teach Roger Federer? Rafael Nadal has answered this question in a recent Twitter post. Check it out.", "url": "https://www.essentiallysports.com/he-has-never-cooked-for-me-before-rafael-nadal-unsure-if-roger-federer-can-cook-atp-tennis-news/", "urlToImage": null, "publishedAt": "2020-04-26T08:33:00Z", "content": "Swiss Maestro Roger Federer has demonstrated his amazing skill at the sport of tennis throughout his career. But what other skill could he learn easily to add to this? Let’s hear Rafael Nadal answer this question in a recent Twitter post.\r\nthe og question was… [+1643 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Anirudh Singh", "title": "Virat Kohli among the three players David Warner picks to bat for his... - The Cricket Times", "description": "Australia's David Warner, who is regarded as one of the most threatening openers in modern-day cricket, has picked three greatest batsmen of the world right now. Warner named his prime three in an Instagram Live session with New Zealand captain and Sunrisers …", "url": "https://crickettimes.com/2020/04/virat-kohli-among-the-three-players-david-warner-picks-to-bat-for-his-life/", "urlToImage": null, "publishedAt": "2020-04-26T08:07:27Z", "content": "Australia’s David Warner, who is regarded as one of the most threatening openers in modern-day cricket, has picked three greatest batsmen of the world right now.\r\nWarner named his prime three in an Instagram Live session with New Zealand captain and Sunrisers… [+2194 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Keane: I didn't have much in common with Rooney and Ferdinand - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T08:05:00Z", "content": "More"}, {"source": {"id": null, "name": "Dawn.com"}, "author": "Images Staff", "title": "Tributes for Sana Mir pour in from around the world after retirement announcement - DAWN.com", "description": "What an absolute trailblazer.", "url": "https://images.dawn.com/news/1185144", "urlToImage": null, "publishedAt": "2020-04-26T07:22:11Z", "content": "Former captain of the Pakistan National's Cricket Team, Sana Mir just announced her retirement from the field. \r\nTaking to Twitter, she wrote, \"Words fall short when I want to thank you all for the love, support and encouragement in the past 15 years. It has … [+929 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Abhishek Bharadwaj", "title": "Lewis Hamilton: Former F1 Driver Believes Hamilton’s Future Depends on Toto Wolff - Essentially Sports", "description": "Former F1 driver Marc Surer believes the Mercedes and Lewis Hamilton partnership hinges on Toto Wolff's next move in Formula 1.", "url": "https://www.essentiallysports.com/f1-news-lewis-hamilton-former-f1-driver-believes-hamiltons-future-depends-on-toto-wolff/", "urlToImage": null, "publishedAt": "2020-04-26T06:40:00Z", "content": "Former F1 driver Marc Surer believes Lewis Hamiltons contract extension with Mercedes hinges on Toto Wolffs next move. Surer is of the opinion that Lewis Hamilton will remain at Mercedes should Toto Wolff do the same. Wolffs future at Mercedes has been a topi… [+2307 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Pat Cummins recalls Cheteshwar Pujara's exploits Down Under, picks him as toughest batsman to bowl - India Today", "description": "Australian fast bowler Pat Cummins said that Cheteshwar Pujara remains one of the toughest he has ever bowled to especially Test cricket.", "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-recalls-cheteshwar-pujara-exploits-australia-picks-him-toughest-batsman-to-bowl-in-tests-1671223-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T06:32:34Z", "content": "World No.1 Test bowler Pat Cummins has revealed that India's Cheteshwar Pujara is the toughest batsman to bowl to in the longest format of the game.\r\nCheteshwar Pujara had helped India orchestrate their maiden Test series victory in Australia last year as he … [+1384 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "New look inspired by heroes Viv Richards and MS Dhoni: Kapil Dev - Times of India", "description": "Cricket News: India's 1983 World Cup-winning captain, Kapil Dev, is sporting a new look these days, having shaved his head bald while keeping a beard, somewhat simi", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/new-look-inspired-by-heroes-viv-richards-and-ms-dhoni-kapil-dev/articleshow/75386212.cms", "urlToImage": null, "publishedAt": "2020-04-26T06:16:33Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Coffee Proved Too Costly for Me, I Drink Green Tea: Hardik Pandya - News18", "description": "India all-rounder Hardik Pandya has joked that a cup of coffee proved too costly for him and he now drinks green tea instead in an Instagram live chat with wicket-keeper Dinesh Karthik. Pandya was referring to the controversy he landed in due to his comments …", "url": "https://www.news18.com/cricketnext/news/coffee-proved-too-costly-for-me-i-drink-green-tea-hardik-2593101.html", "urlToImage": null, "publishedAt": "2020-04-26T05:30:44Z", "content": "New Delhi: India all-rounder Hardik Pandya has joked that a cup of coffee proved too costly for him and he now drinks green tea instead in an Instagram live chat with wicket-keeper Dinesh Karthik. Pandya was referring to the controversy he landed in due to hi… [+1475 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Anirudh Singh", "title": "R Ashwin reveals how MS Dhoni helped him to dismiss Jonathan Trott in Champion Trophy 2013... - The Cricket Times", "description": "Ravichandran Ashwin and his former India teammate Suresh Raina had a live Instagram session on Friday evening. And, the duo recalled some cherishing memories while they used to play together for Team India and Chennai Super Kings (CSK) in IPL. During the inte…", "url": "https://crickettimes.com/2020/04/r-ashwin-reveals-how-ms-dhoni-helped-him-to-dismiss-jonathan-trott-in-champion-trophy-2013-final/", "urlToImage": null, "publishedAt": "2020-04-26T05:07:40Z", "content": "Ravichandran Ashwin and his former India teammate Suresh Raina had a live Instagram session on Friday evening. And, the duo recalled some cherishing memories while they used to play together for Team India and Chennai Super Kings (CSK) in IPL.\r\nDuring the int… [+2463 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Sports Desk", "title": "Messi or Ronaldo? Brazilian legends Pele, Ronaldinho and Ronaldo answer - The Indian Express", "description": "Who is a more complete player - Lionel Messi or Cristiano Ronaldo? Brazilian legends Pele, Ronaldinho and Ronaldo pick their side.", "url": "https://indianexpress.com/article/sports/football/messi-or-ronaldo-brazilian-legends-pele-ronaldinho-and-ronaldo-answer-6378475/", "urlToImage": null, "publishedAt": "2020-04-26T05:04:15Z", "content": "Messi or Ronaldo? Brazilian legends Pele, Ronaldinho and Ronaldo pick their sideWith coronavirus bringing sports and life in general to a halt in the entire world, football stars have started answering difficult questions: Who is the best in the world – Lione… [+2552 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Daniel Blackham", "title": "Man Utd boss Solskjaer has NINE stars on transfer shortlist despite Ed Woodward comments - Express.co.uk", "description": "Manchester United boss Ole Gunnar Solskjaer wants a big summer spending spree, despite Ed Woodward's comments.", "url": "https://www.express.co.uk/sport/football/1273927/Man-Utd-Ole-Gunnar-Solskjaer-nine-stars-transfer-shortlist", "urlToImage": null, "publishedAt": "2020-04-26T05:00:00Z", "content": "Aston Villa are believed to have conceded defeat over Grealish's future, but will still ask for a hefty fee this summer.\r\nRegarding some of their targets, the likes of Haaland, Werner and Dembele, it seems United are planning for every eventuality and will po… [+350 chars]"}, {"source": {"id": null, "name": "Tribalfootball.com"}, "author": "Carlos Volcano", "title": "Raiola and Alfie force Real Madrid president Florentino to go cold on Haaland - Tribal Football", "description": "Real Madrid president Florentino Perez is pulling back from plans of a move for Borussia Dortmund striker Erling Haaland.Mundo Deportivo says fees that will be", "url": "https://www.tribalfootball.com/articles/raiola-and-alfie-force-real-madrid-president-florentino-to-go-cold-on-haaland-4323870", "urlToImage": null, "publishedAt": "2020-04-26T04:45:14Z", "content": "Real Madrid president Florentino Perez is pulling back from plans of a move for Borussia Dortmund striker Erling Haaland.\r\nMundo Deportivo says fees that will be owed to agent Mino Raiola along with the player's father, Alf-inge has put Madrid off from signin… [+526 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "David Warner shares adorable dance video with wife Candice, daughters--Watch - Zee News", "description": "Warner was set to represent Sunrisers Hyderabad in the IPL 2020, which was due to take place from March 29 but it has now been postponed indefinitely due to coronavirus.", "url": "https://zeenews.india.com/cricket/david-warner-shares-adorable-dance-video-with-wife-candice-daughters-watch-2279018.html", "urlToImage": null, "publishedAt": "2020-04-26T04:02:33Z", "content": "As all the sporting activities across the globe are currently at standstill due to coronavirus pandemic, swashbuckling Australian opener David Warner is keeping his fans entertained by constantly posting videos with his family on social media.\r\nFrom shaking l… [+1516 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Rasesh Mandani", "title": "Bailout plan: Play more matches with India - Hindustan Times", "description": "Later this year, the new Future Tours Programme (FTP) for the years 2023-2031 will be finalised; the ICC continues to be heavily dependent on the BCCI for revenue.", "url": "https://www.hindustantimes.com/cricket/bailout-plan-play-more-matches-with-india/story-VRqndyDqK1aBAy0bT21qoO.html", "urlToImage": null, "publishedAt": "2020-04-26T02:57:47Z", "content": "The Board of Control for Cricket in India (BCCI), the richest body in world cricket, has come up with a plan to help countries facing losses due to the cancellation of cricket worldwide -- although the idea is contingent on games resuming.\r\nAccording to BCCI … [+4642 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "ESPNcricinfo staff", "title": "Pick the readers' all-time CSK XI | ESPNcricinfo.com - ESPNcricinfo", "description": "Who would make it to your all-time Chennai Super Kings XI? | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29096845/pick-readers-all-csk-xi", "urlToImage": null, "publishedAt": "2020-04-26T02:47:31Z", "content": "Wouldn't it be fun to pick an all-time Chennai Super Kings' XI, based on player stats for the franchise? We've picked ours, now it's your turn to participate in choosing the readers' XI.\r\nThe readers' CSK XI will consist of the 11 players with the most votes,… [+405 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Transfer news and rumours LIVE: Klopp calls Mbappe's dad over Liverpool switch - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T02:30:00Z", "content": "More"}, {"source": {"id": null, "name": "Chessbase.com"}, "author": "", "title": "Magnus Carlsen Invitational: Nakamura in sole second place - Chessbase News", "description": "Hikaru Nakamura and Ding Liren obtained key victories in round four of the Magnus Carlsen Invitational. Nakamura took down Ian Nepomniachtchi 2½:1½, while Ding had black and drew Anish Giri in the Armageddon decider of their match-up. Nakamura is now in sole …", "url": "https://en.chessbase.com/post/magnus-carlsen-invitational-2020-r4-b", "urlToImage": null, "publishedAt": "2020-04-26T01:59:35Z", "content": "Ding wins in Armageddon\r\nThe fight to reach the final-four knockout of the Magnus Carlsen Invitational has almost completely been narrowed down to six players. Carlsen and Nakamura are favourites to qualify, while Ding and Fabiano Caruana are leading the race… [+5829 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Referee reveals why he could have sent Maradona off before 1990 World Cup final - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T01:55:00Z", "content": "More"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "Kohli's motivational songs, and an unforgettable AB experience - Cricbuzz - Cricbuzz", "description": "RCB's tale of 2016 - a wretched start, a flying comeback, a misstep at the final hurdle, and an emotional Chris Gayle speech", "url": "https://www.cricbuzz.com/cricket-news/112934/kohlis-motivational-songs-and-an-unforgettable-ab-experience", "urlToImage": null, "publishedAt": "2020-04-26T01:37:11Z", "content": "\"I broke down because it was like we had such a big family and we couldn't do it for them. It's the best team I've played for.\" ©BCCI \r\nIn this new Cricbuzz series - Once upon an IPL final - we get some of the younger cricketers to retell tales of an IPL fina… [+8457 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "Members question HCA move to fund clubs - Cricbuzz - Cricbuzz", "description": "The Hyderabad Cricket Association paid Rs 50,000 each to nearly 160 private clubs and district associations - amounting to Rs 80 lakh", "url": "https://www.cricbuzz.com/cricket-news/112932/members-question-hca-move-to-fund-clubs", "urlToImage": null, "publishedAt": "2020-04-26T01:08:26Z", "content": "Though some members had stated that they were not interested in the money, the HCA deposited it in their account. © Getty\r\nDefying logic, the Hyderabad Cricket Association (HCA) paid Rs 50,000 each to nearly 160 private clubs and district associations - amoun… [+2326 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "ESPN", "title": "Transfer Talk: Juventus' Miralem Pjanic to trade places with Barcelona utility Sergi Roberto? - ESPN India", "description": "Could Barcelona tempt Juventus into swapping Miralem Pjanic for Sergi Roberto? As always, Transfer Talk has the latest.", "url": "https://www.espn.in/football/soccer-transfers/story/4089180/live-transfer-talk-barcelona-to-swap-sergi-roberto-for-juventus-pjanic", "urlToImage": null, "publishedAt": "2020-04-26T00:56:29Z", "content": "The coronavirus pandemic has made the summer transfer window uncertain, but here are the new rumours floating around Europe's big leagues and beyond.\r\nTOP STORY: Juve and Barca discuss Roberto-Pjanic swap\r\nJuventus are in talks with Barcelona about several po… [+6626 chars]"}, {"source": {"id": null, "name": "Espn.com.au"}, "author": "Adrian Wojnarowski", "title": "NBA reopening team practice facilities Friday where local restrictions eased, sources say - ESPN Australia", "description": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.", "url": "https://www.espn.com.au/nba/story/_/id/29099194/nba-reopening-team-practice-facilities-friday-where-local-restrictions-eased-sources-say", "urlToImage": null, "publishedAt": "2020-04-25T23:03:22Z", "content": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.\r\nPlayers can return to team facilities in states such as … [+2131 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Everton 'appalled' after Kean breaks coronavirus guidelines to throw lockdown party - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T22:56:34Z", "content": "More"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Maitreyee Joshi", "title": "When Eminem Tried to Trash Talk Michael Jordan, But Regretted it Immediately - Essentially Sports", "description": "American rap icon Eminem describes the moment he almost blew his shot at a collaboration with NBA legend Michael Jordan by joking aboout dunking on him.", "url": "https://www.essentiallysports.com/nba-news-chicago-bulls-eminem-once-tried-to-trash-talk-michael-jordan-but-regretted-it-immediately/", "urlToImage": null, "publishedAt": "2020-04-25T22:38:00Z", "content": "Celebrities from the music industry are a common presence at NBA games. However, rarely does a musician talks trash to an actual NBA legend. Michael Jordan once experienced such a situation first hand.\r\nRecently, In an interview with SiriusXM’s “Sway in the M… [+1699 chars]"}, {"source": {"id": null, "name": "Thesportsrush.com"}, "author": "Jatin Hasija", "title": "YD vs TB Dream11 Prediction : Yulon Luxgen Dinos Vs Taiwan Beer Best Dream 11 Team for Final Game 4 of Super Basketball League 2019-20 - The Sportsrush", "description": "YD Vs TB Dream11 Team Overview, Match Centre and Probable Play 5: Taiwan finally unlock the true potential of their unit to hit back and restore parity in the finals Stunned by Yulon in the first two clashes of the final series, it took Taiwan Beer until the …", "url": "https://thesportsrush.com/yd-vs-tb-dream11-prediction-yulon-luxgen-dinos-vs-taiwan-beer-best-dream-11-team-for-final-game-4-of-super-basketball-league-2019-20/", "urlToImage": null, "publishedAt": "2020-04-25T22:23:00Z", "content": "YD Vs TB Dream11 Team Overview, Match Centre and Probable Play 5: Taiwan finally unlock the true potential of their unit to hit back and restore parity in the finals \r\nStunned by Yulon in the first two clashes of the final series, it took Taiwan Beer until th… [+4412 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Conte wouldn't last a season at Real Madrid, says Diego Costa - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T21:35:00Z", "content": "More"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'My biggest mistake was joining Inter – I could've gone to Madrid, Barca or Man Utd' - Pancev regrets Italy move - Goal India", "description": "Antonio Conte may have won league titles in Italy and England, but the Inter coach would not last a season in charge of Real Madrid, according to Diego Costa.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T18:54:24Z", "content": "More"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'Very doubtful' Premier League will play again in 2019-20, says Dutch FA chief - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T18:27:00Z", "content": "More"}, {"source": {"id": null, "name": "Espn.in"}, "author": "Julien Laurens", "title": "Arsenal to return to training despite UK's coronavirus lockdown - ESPN India", "description": "Arsenal players will make a staggered return to training at their London Colney training ground next week, sources have told ESPN.", "url": "https://www.espn.in/football/arsenal/story/4089033/arsenal-to-return-to-training-despite-uks-coronavirus-lockdown-sources", "urlToImage": null, "publishedAt": "2020-04-25T18:24:56Z", "content": "Arsenal players will make a return to training at their London Colney training ground next week despite the UK still being on a government-imposed lockdown amid the coronavirus pandemic.\r\n- Stream every episode of 30 for 30: Soccer Stories on ESPN+\r\nThey are … [+2027 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Akshat Gaur", "title": "Saqlain Mushtaq reveals the incident after which he never sledged Sachin... - The Cricket Times", "description": "Just a few hours down the line, Sachin Tendulkar turned 47, but due to the coronavirus pandemic, he didn't celebrate his birthday. However, his fans across the globe recalled the famous India versus Australia ODI game held at Sharjah when the cricketing world…", "url": "https://crickettimes.com/2020/04/saqlain-mushtaq-reveals-the-incident-after-which-he-never-sledged-sachin-tendulkar/", "urlToImage": null, "publishedAt": "2020-04-25T16:45:45Z", "content": "Just a few hours down the line, Sachin Tendulkar turned 47, but due to the coronavirus pandemic, he didn’t celebrate his birthday. However, his fans across the globe recalled the famous India versus Australia ODI game held at Sharjah when the cricketing world… [+2392 chars]"}, {"source": {"id": null, "name": "Dawn.com"}, "author": "AFP", "title": "Chelsea opt against pay cut, tell players to donate to charity - DAWN.com", "description": "Newcastle and Norwich are currently the only two Premier League clubs using the furlough for some of their staff.", "url": "https://www.dawn.com/news/1552184", "urlToImage": null, "publishedAt": "2020-04-25T16:22:22Z", "content": "English Premier League side Chelsea have said they won't impose a pay cut on their first-team squad in response to the coronavirus outbreak.\r\nBut the club added on Saturday they had asked players to continue donating to charities during the ongoing pandemic.\r… [+2170 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Asian Games gold medalist Dingko Singh airlifted to Delhi for cancer treatment - India Today", "description": "At a time when no airline is operational due to the Covid-19 lockdown, Dingko Singh was airlifted from Imphal for his cancer treatment in New Delhi.", "url": "https://www.indiatoday.in/sports/other-sports/story/dingko-singh-boxing-cancer-treatment-airlifted-imphal-delhi-lockdown-1671075-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T15:35:31Z", "content": "Asian Games Gold Medallist Dingko Singh was flown today from Imphal to Delhi by SpiceJet's air ambulance service for his liver cancer treatment. At a time when no airline is operational due to lockdown, the airline provided the air ambulance service free of c… [+975 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Anirudh Singh", "title": "Actress Nidhhi Agerwal clears the air about unfollowing KL Rahul on social... - The Cricket Times", "description": "Cricketers link-up with Bollywood actresses is very commonly seen days. Even though Virat Kohli and Anushka Sharma are right now termed as the 'power couple', there is much more to that. There have been many other successful couples and sad breakups seen by c…", "url": "https://crickettimes.com/2020/04/nidhhi-agerwal-clears-the-air-about-unfollowing-kl-rahul-on-social-media/", "urlToImage": null, "publishedAt": "2020-04-25T15:03:35Z", "content": "Cricketers link-up with Bollywood actresses is very commonly seen days. Even though Virat Kohli and Anushka Sharma are right now termed as the ‘power couple’, there is much more to that.\r\nThere have been many other successful couples and sad breakups seen by … [+1428 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Gambhir, Akram had big influence on me at KKR: Kuldeep - Hindustan Times", "description": "Kuldeep says that Gambhir continues to talk to him even after the end of the latter’s stint at KKR and his playing career itself.", "url": "https://www.hindustantimes.com/cricket/gambhir-akram-had-big-influence-on-me-at-kkr-kuldeep/story-s71gC0msbyMC3lgxHBY2yM.html", "urlToImage": null, "publishedAt": "2020-04-25T14:49:16Z", "content": "Indian sinner Kuldeep Yadav spoke about the influence that Gautam Gambhir and Wasim Akram had on him in his early days at the Kolkata Knight Riders. Kuldeep said that Gambhir, who captained KKR to two titles in 2012 and 2014, gave him confidence by assuring h… [+2136 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "COVID-19: James Anderson to auction signed Test shirt, bat to raise funds - Times of India", "description": "Cricket News: England pacer James Anderson has announced that he will auction his signed Test shirt and a cricket bat, which he used in the last game to raise funds", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/covid-19-james-anderson-to-auction-signed-test-shirt-bat-to-raise-funds/articleshow/75377219.cms", "urlToImage": null, "publishedAt": "2020-04-25T14:31:56Z", "content": "NEW DELHI: England pacer James Anderson has announced that he will auction his signed Test shirt and a cricket bat, which he used in the last game to raise funds for the coronavirus relief.\r\nThe 37-year-old played his last Test against South Africa in Cape To… [+1498 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": "", "title": "Taipei T10 League 2020, Match 6: TCA Indians vs Taiwan Dragons – Dream11 Fantasy Cricket Tips – Playing XI, Pitch Report & Injury Update - CricTracker", "description": "Taipei T10 League 2020: Dream11 Fantasy Cricket Tips, Playing XIs, Best XIs, Yingfeng Pitch Report & Injury News for Match 6, TCA Indians vs Taiwan Dragons.", "url": "https://www.crictracker.com/taipei-t10-league-2020-match-6-tca-indians-vs-taiwan-dragons-dream11-fantasy-cricket-tips-playing-xi-pitch-report-injury-update/", "urlToImage": null, "publishedAt": "2020-04-25T13:12:49Z", "content": "Yingfeng Cricket Ground in Songshan District. (Photo Source: Twitter)\r\nMatch Details:\r\nThe 6th match of the Taipei T10 League 2020 will be played between TCA Indians and Taiwan Dragons at the Yingfeng Cricket Ground in Songshan District.\r\nThe match starts at … [+3739 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Vinayak Manoj", "title": "WATCH: UFC Drops a Chilling Promo For Tony Ferguson vs Justin Gaethje - Essentially Sports", "description": "Ahead of UFC 249, the promotion have dropped an insane video as an effort to promote the upcoming star studded event that will take place on May 9th.", "url": "https://www.essentiallysports.com/ufc-249-news-watch-ufc-drops-a-chilling-promo-for-tony-ferguson-vs-justin-gaethje/", "urlToImage": null, "publishedAt": "2020-04-25T12:45:00Z", "content": "With a lot of uncertainty looming over the future of the UFC lightweight division, a new promotional video for the headliner comes as a sign of relief for fans all over the world.\r\nGuaranteeing fireworks, the star-studded UFC 249 roster is one of the greatest… [+2051 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Miscreants attempt to rob stumper Saha's Siliguri home, says relative - Hindustan Times", "description": "Saha, 35, lives in South Kolkata with his wife and children. The experienced stumper’s parents, who live in their Ward No.31 Shaktigarh area house in Siliguri, are at present staying with their son in Kolkata.", "url": "https://www.hindustantimes.com/cricket/miscreants-attempt-to-rob-stumper-saha-s-siliguri-home-says-relative/story-tRusZSKZV1FBBTmYrEWIlO.html", "urlToImage": null, "publishedAt": "2020-04-25T12:04:21Z", "content": "A relative of Wriddhiman Saha has alleged that a few miscreants tried to break into the India Test wicketkeeper’s ancestral home in Siliguri, North Bengal, on Friday in a bungled attempt to rob the place.\r\nSaha, 35, lives in South Kolkata with his wife and ch… [+1344 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "‘Didn’t want people to say Silver Sindhu,’ Talk of final phobia propelled PV Sindhu to World Championship... - Hindustan Times", "description": "Sindhu, who had already won two silver and two bronze medals at the event, defeated her nemesis Nozomi Okuhara 21-7 21-7 in the summit clash that lasted just 38 minutes on August 26 last year.", "url": "https://www.hindustantimes.com/other-sports/didn-t-want-people-to-say-silver-sindhu-talk-of-final-phobia-propelled-pv-sindhu-to-world-championship-glory/story-9daLENyFdFsDbf4qp35ELI.html", "urlToImage": null, "publishedAt": "2020-04-25T11:59:43Z", "content": "Ace shuttler PV Sindhu, who had created history by becoming the first Indian to win gold medal at the World Championships last year, has revealed that she didnt want people to call her “silver Sindhu” and thats why she was desperate to clinch the top honours … [+1477 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "Legalising ball tampering: Saliva is must and vaseline is no replacement, feel Ashish Nehra, Harbhajan Singh - Hindustan Times", "description": "Former India pacer Ashish Nehra and spinner Harbhajan Singh feel that saliva’s use in shining the ball is a “must”. Ex-opener Aakash Chopra, while beng open to the idea, wants to know where one can draw the line.", "url": "https://www.hindustantimes.com/cricket/legalising-ball-tampering-saliva-is-must-and-vaseline-is-no-replacement-feel-ashish-nehra-harbhajan-singh/story-6sGuYrV3wtqCeH94TJ9N9K.html", "urlToImage": null, "publishedAt": "2020-04-25T11:23:53Z", "content": "Saliva and sweat are components that cannot be entirely done away with, insist a few distinguished India cricketers, as the ICC contemplates legalising ball tampering post COVID-19 by using artificial substances to prevent virus spread. Former India pacer Ash… [+3372 chars]"}, {"source": {"id": null, "name": "Sempreinter.com"}, "author": null, "title": "Chelsea Join Inter In Race To Sign 70M Rated Arsenal Striker Aubameyang - SempreInter", "description": "Chelsea are interested in Inter target Pierre Emerick Aubameyang, according to a report from international broadcaster ESPN earlier today. The report", "url": "https://sempreinter.com/2020/04/25/chelsea-join-inter-in-race-to-sign-70m-rated-arsenal-striker-aubameyang/", "urlToImage": null, "publishedAt": "2020-04-25T11:21:28Z", "content": "Chelsea are interested in Inter target Pierre Emerick Aubameyang, according to a report from international broadcaster ESPN earlier today.\r\nThe report details how the Blues have identified the Gabonese striker as the ideal player to reinforce their attack nex… [+784 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Oliver Browning", "title": "WWE news: The 30 greatest pro wrestlers of all-time have been ranked - GIVEMESPORT", "description": "WWE news: The 30 greatest pro wrestlers of all-time have been ranked", "url": "https://www.givemesport.com/1564783-wwe-news-the-30-greatest-pro-wrestlers-of-alltime-have-been-ranked", "urlToImage": null, "publishedAt": "2020-04-25T10:59:58Z", "content": "There are so many legendary names linked with professional wrestling. \r\nWWE stars like Hulk Hogan, The Undertaker, Andre the Giant and The Rock instantly spring to mind. \r\nThen, of course, there are some that have made a name for themselves outside of America… [+1569 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Sancho is nowhere near Aguero, Higuain, Messi & Di Maria - Neville - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T10:18:00Z", "content": "More"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Barca Blaugranes Staff", "title": "FC Barcelona News: 25 April 2020; PSG won’t talk Neymar - Barca Blaugranes", "description": "A round-up of the latest Barcelona news and transfer rumors", "url": "https://www.barcablaugranes.com/2020/4/25/21235862/fc-barcelona-news-25-april-2020-psg-wont-talk-neymar-sterling-wants-messis-shirt", "urlToImage": null, "publishedAt": "2020-04-25T09:49:32Z", "content": "PSG will refuse to negotiate a deal to sell Neymar until September | Sport\r\nPSG are refusing to negotiate Neymars exit currently. The French champions have told the Brazilian they do not want to sell and now is not the time to discuss the future.\r\nNewcastle d… [+1245 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Arjun Athreya", "title": "Three Things We Want To See From the Kobe Bryant Documentary - Essentially Sports", "description": "Kobe Bryant spent 20 years with the Los Angeles Lakers. It has now been confirmed that his last season was being completely documented by a film crew.", "url": "https://www.essentiallysports.com/nba-news-three-things-we-want-to-see-from-the-kobe-bryant-documentary/", "urlToImage": null, "publishedAt": "2020-04-25T09:40:00Z", "content": "The Last Dance, a ten-part documentary on Michael Jordans final season with the Chicago Bulls was released recently. Ever since the series claimed a massive following, fans have been chirping for a similar documentary to be made on the legacy of the late Kobe… [+5764 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "‘You don’t want the fear,’ Yuvraj Singh explains why cricket should return only after Covid-19 is e... - Hindustan Times", "description": "Like other sports, international and domestic cricket too has been disrupted leading the national boards to contemplate resuming the game in empty stadiums, without fans.", "url": "https://www.hindustantimes.com/cricket/you-don-t-want-the-fear-yuvraj-singh-explains-why-cricket-should-return-only-after-covid-19-is-eradicated/story-7okHJdLw1JTTSzbxY9JJ6L.html", "urlToImage": null, "publishedAt": "2020-04-25T09:34:05Z", "content": "Former India star Yuvraj Singh wants cricket to resume only when the world becomes COVD-19 free as players’ health and safety should be paramount for the custodians of the game.\r\nLike other sports, international and domestic cricket too has been disrupted lea… [+1271 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": null, "title": "‘He was a real pain in the back for us’ – Pat Cummins picks Cheteshwar Pujara as the toughest batsman to bowl - CricTracker", "description": "Pat Cummins, who is the World's number 1 Test bowler, recalled the painstaking series for Australia in 2018-19 season which India", "url": "https://m.crictracker.com/he-was-a-real-pain-in-the-back-for-us-pat-cummins-picks-cheteshwar-pujara-as-the-toughest-batsman-to-bowl/", "urlToImage": null, "publishedAt": "2020-04-25T09:04:22Z", "content": "Pat Cummins and Cheteshwar Pujara. (Photo Source: Getty Images)\r\nTeam India scripted history during their previous Australia tour by winning their first ever Test series down under. Though the hosts missed their best batsman in David Warner and Steve Smith, A… [+1980 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Saketh Kandadai", "title": "“It Was Not an Easy Night”: Steve Kerr Narrates a Hilarious Betting Story of Michael Jordan From Their College Days - Essentially Sports", "description": "Golden State Warriors coach Steve Kerr revealed a funny betting story with his former Chicago Bulls teammate Michael Jordan.", "url": "https://www.essentiallysports.com/nba-news-chicago-bulls-it-was-not-an-easy-night-steve-kerr-narrates-a-hilarious-betting-story-of-michael-jordan-from-their-college-days/", "urlToImage": null, "publishedAt": "2020-04-25T07:25:11Z", "content": "Golden State Warriors coach Steve Kerr revealed a funny betting story with his former teammate Michael Jordan.\r\nIt was during a game when Kerr was playing for the University of Arizona while Jordan was at the University of North Carolina. Kerr’s Wildcats defe… [+2070 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Rob Swan", "title": "Premier League football could be back on live TV ‘within weeks’ - GIVEMESPORT", "description": "Premier League football could be back on live TV ‘within weeks’", "url": "https://www.givemesport.com/1564740-premier-league-football-could-be-back-on-live-tv-within-weeks", "urlToImage": null, "publishedAt": "2020-04-25T07:13:11Z", "content": "It seems increasingly likely that the 2019-20 Premier League season will be concluded, according to fresh reports.\r\nNo top-flight football has been played in England since March 9 due to the ongoing coronavirus pandemic, which has threatened to lead to the ca… [+2264 chars]"}, {"source": {"id": null, "name": "Icc-cricket.com"}, "author": "ICC", "title": "Obituary: Graeme Watson - International Cricket Council", "description": "Graeme Watson, an all-rounder who featured in five Tests and two ODIs for Australia, died at 75 following a battle with cancer.", "url": "https://www.icc-cricket.com/news/1660856/obituary-graeme-watson", "urlToImage": null, "publishedAt": "2020-04-25T07:10:21Z", "content": "Graeme Watson, an all-rounder who featured in five Tests and two ODIs for Australia, died at 75 following a battle with cancer.Watson, a middle-order batsman and medium-pace bowler, finished his career with 4,674 runs and 186 wickets from 107 first-class game… [+1984 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "No to saliva, yes to shine: Ball-tampering laws in cricket may change - Times of India", "description": "Cricket News: Cricket may change ball-tampering laws and approve external method to help polish the red cherry in proposed post-corona measures. The matter of saliv", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/no-to-saliva-yes-to-shine-ball-tampering-laws-in-cricket-may-change/articleshow/75367490.cms", "urlToImage": null, "publishedAt": "2020-04-25T04:40:29Z", "content": "NEW DELHI: The coronavirus pandemic may force cricket's world governing body to tweak one of its oldest rules and approve the use of an artificial substance to help shine the ball, effectively legalizing what has for long been a core tenet of the sport's anti… [+4836 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Daniel Blackham", "title": "Chelsea ace Christian Pulisic won't 'stay around' if club signs Philippe Coutinho - Express", "description": "Chelsea are interested in signing Philippe Coutinho, but could lose an existing winger if they do sign him.", "url": "https://www.express.co.uk/sport/football/1273679/Chelsea-Christian-Pulisic-Philippe-Coutinho", "urlToImage": null, "publishedAt": "2020-04-25T04:27:35Z", "content": "He has only started 12 games this season, scoring five goals in 16 appearances.\r\nAnd due to his inability to break into the starting XI consistently, he has been tipped to leave if Coutinho joins.\r\n\"I would love to sit down with Jody Morris, who is a friend o… [+323 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "George Dobell", "title": "UK government hands ECB lead on viability of 'bio-secure' sport | ESPNcricinfo.com - ESPNcricinfo", "description": "England will play at as few grounds as possible if cricket goes behind closed doors, says ECB CEO | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29094232/uk-government-hands-ecb-lead-viability-bio-secure-sport", "urlToImage": null, "publishedAt": "2020-04-25T02:19:30Z", "content": "The ECB has been asked by the UK government to lead the way into investigating the viability of playing sport in a bio-secure environment.\r\nWith an increasing acceptance that the best chance of fulfilling the broadcast deals that keep nearly all sport afloat … [+8018 chars]"}, {"source": {"id": "marca", "name": "Marca"}, "author": "Christian Gaudioso, Adapted by Billy Munday", "title": "Tebas: Once we're allowed to restart the season, clubs will be punished if they refuse to play - MARCA.com", "description": "LaLiga president Javier Tebas has insisted that teams who refuse to play the rest of the season will be punished.\n\nOrganisations like the Spanish...", "url": "https://www.marca.com/en/football/spanish-football/2020/04/24/5ea335ee46163fd4248b4661.html", "urlToImage": null, "publishedAt": "2020-04-24T18:58:00Z", "content": "LaLiga president Javier Tebas has insisted that teams who refuse to play the rest of the season will be punished.\r\nOrganisations like the Spanish Footballers' Association (AFE) have expressed their concern over player safety once the season resumes.\r\n\"If a cl… [+2899 chars]"}, {"source": {"id": null, "name": "Atptour.com"}, "author": null, "title": "Virtual Blockbuster! Rafael Nadal & Andy Murray In Same Group In Mutua Madrid Open Virtual Pro - ATP Tour", "description": "The draw for the Mutua Madrid Open Virtual Pro has been made, and although the action will be played in a video game, there is a round-robin blockbuster that jumps off the page. Five-time Madrid champion Rafael Nadal is joined by another former World No. 1, A…", "url": "https://www.atptour.com/en/news/mutua-madrid-open-virtual-pro-2020-draw", "urlToImage": null, "publishedAt": "2020-04-24T18:30:30Z", "content": "The draw for the Mutua Madrid Open Virtual Pro has been made, and although the action will be played in a video game, there is a round-robin blockbuster that jumps off the page.\r\nFive-time Madrid champion Rafael Nadal is joined by another former World No. 1, … [+3125 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": "India Today Television", "title": "Absolutely priceless: Sachin Tendulkar spends a quiet 47th birthday with his mother - India Today", "description": "Sachin Tendulkar turned 47 on Friday. The Master Blaster decided not to celebrate his birthday this year as a mark of respect towards the Covid-19 warriors. In fact he has tweeted on the occasion with a picture with his mother captioning it: \"Started my day b…", "url": "https://www.indiatoday.in/sports/video/absolutely-priceless-sachin-tendulkar-spends-a-quiet-47th-birthday-with-his-mother-1670812-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T18:15:45Z", "content": "Sachin Tendulkar turned 47 on Friday. The Master Blaster decided not to celebrate his birthday this year as a mark of respect towards the Covid-19 warriors. In fact he has tweeted on the occasion with a picture with his mother captioning it: \"Started my day b… [+491 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Ibrahimovic slams 'kindergarten-level' vandals who attacked AC Milan forward's statue in Malmo - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T16:14:00Z", "content": "More"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Island of Vanuatu becomes 1st nation to resume cricket, live actions to start this week - India Today", "description": "Vanuatu Cricket Association chief executive Shane Deitz said that the country is going to showcase a bit of cricket for everyone who is in lockdown.", "url": "https://www.indiatoday.in/sports/cricket/story/live-cricket-to-resume-in-vanuatu-as-country-control-coronavirus-enough-to-hold-live-matches-cricket-covid-19-pandemic-1670724-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T14:16:21Z", "content": "They're ready to go live in Vanuatu.\r\nA tropical island in the South Pacific is very likely to be the only venue in the world hosting a competitive cricket final on Saturday, as most international sport remains shuttered around the globe.\r\nVanuatu Cricket Ass… [+3173 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Rohit Sharma picks his top 5 India batsmen of all time - Hindustan Times", "description": "Sourav Ganguly, Sachin Tendulkar, Rahul Dravid, VVS Laxman and Virender Sehwag all made the list but Rohit included the caveat that these are the players that he has seen in action.", "url": "https://www.hindustantimes.com/cricket/rohit-sharma-picks-his-top-5-india-batsmen-of-all-time/story-kPLmdYWE0Bb4VrtVrA1DOP.html", "urlToImage": null, "publishedAt": "2020-04-24T14:10:00Z", "content": "Indian cricket team batsman Rohit Sharma was asked to pick the top five India batsman and he decided to include five modern legends in his name. Sourav Ganguly, Sachin Tendulkar, Rahul Dravid, VVS Laxman and Virender Sehwag all made the list but Rohit include… [+1998 chars]"}]}