{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "Ian Chappell", "title": "When Colin Milburn went berserk at the Gabba | ESPNcricinfo.com - ESPNcricinfo", "description": "The hard-hitting Englishman produced one of the best batting sessions ever, in a Shield game in 1968-69 | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29099941/colin-milburn-went-berserk-gabba", "urlToImage": null, "publishedAt": "2020-04-26T06:28:48Z", "content": "In these sport-less days it's timely to ask: \"Is this the best batting in a session ever?\"\r\nNo, I'm not talking about Sir Donald Bradman's 304 in a day at Headingley in 1930, where he scored a century in each of the first two sessions.\r\nI'm not reminiscing ab… [+3882 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "New look inspired by heroes Viv Richards and MS Dhoni: Kapil Dev - Times of India", "description": "Cricket News: India's 1983 World Cup-winning captain, Kapil Dev, is sporting a new look these days, having shaved his head bald while keeping a beard, somewhat simi", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/new-look-inspired-by-heroes-viv-richards-and-ms-dhoni-kapil-dev/articleshow/75386212.cms", "urlToImage": null, "publishedAt": "2020-04-26T06:16:33Z", "content": null}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Alex Dicken", "title": "Aston Villa linked with shock change as Man United send Jack Grealish update - Birmingham Live", "description": "Aston Villa news - A round-up of AVFC headlines from BirminghamLive and elsewhere", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/aston-villa-linked-shock-change-18151831", "urlToImage": null, "publishedAt": "2020-04-26T06:09:40Z", "content": "Shock Dyche link\r\nAston Villa have been linked with a shock interest in Burnley manager Sean Dyche. \r\nLike the rest of the Premier League, Villa are currently on lockdown and waiting to learn when their season will resume. \r\nDean Smith and his players have a … [+5293 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "https://www.facebook.com/varun.khanna123", "title": "Stan Wawrinka Picks the Toughest Player to Beat at Prime Amongst ‘Big 3’ - Essentially Sports", "description": "Former World No.3 Stan Wawrinka picked the most challenging player to face at their prime among Roger Federer, Rafael Nadal, and Novak Djokovic.", "url": "https://www.essentiallysports.com/stan-wawrinka-picks-the-toughest-player-to-beat-at-prime-amongst-big-3-roger-federer-rafael-nadal-novak-djokovic-atp-tennis-news/", "urlToImage": null, "publishedAt": "2020-04-26T05:56:00Z", "content": "The battle between the ‘Big 3’ – Roger Federer, Rafael Nadal, and Novak Djokovic is arguably the closest contest ever seen in the legacies of sports. It is almost impossible to discern which player is the best amongst the ‘Big 3’. Nevertheless, former World N… [+1826 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "You are very annoying on social media man: Chris Gayle brutally trolls Yuzvendra Chahal - India Today", "description": "Yuzvendra Chahal was recently roasted by India skipper Virat Kohli and opener Rohit Sharma over his hilarious Tik Tok videos and now Chris Gayle as trolled the 29-year-old for the same.", "url": "https://www.indiatoday.in/sports/cricket/story/chris-gayle-trolls-chahal-for-tik-tok-videos-saya-he-is-very-annoying-1671205-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T05:38:14Z", "content": "Yuzvendra Chahal is quite active on social media platforms like Tik Tok where he keeps on posting funny content but it seems like his fellow teammates and other cricketers are annoyed with the India leg-spinner over his social media activities.\r\nEarlier, Chah… [+1165 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Coffee Proved Too Costly for Me, I Drink Green Tea: Hardik Pandya - News18", "description": "India all-rounder Hardik Pandya has joked that a cup of coffee proved too costly for him and he now drinks green tea instead in an Instagram live chat with wicket-keeper Dinesh Karthik. Pandya was referring to the controversy he landed in due to his comments …", "url": "https://www.news18.com/cricketnext/news/coffee-proved-too-costly-for-me-i-drink-green-tea-hardik-2593101.html", "urlToImage": null, "publishedAt": "2020-04-26T05:30:44Z", "content": "New Delhi: India all-rounder Hardik Pandya has joked that a cup of coffee proved too costly for him and he now drinks green tea instead in an Instagram live chat with wicket-keeper Dinesh Karthik. Pandya was referring to the controversy he landed in due to hi… [+1475 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Saketh Kandadai", "title": "Why Did Kobe Bryant Choose No. 8 to Start His Career at Los Angeles Lakers? - Essentially Sports", "description": "The reason why Kobe Bryant used the No. 8 jersey when he started his NBA career with the Los Angeles Lakers and later changed to No. 24", "url": "https://www.essentiallysports.com/nba-news-why-did-kobe-bryant-choose-no-8-to-start-his-career-at-los-angeles-lakers/", "urlToImage": null, "publishedAt": "2020-04-26T05:18:00Z", "content": "Kobe Bryant is the only NBA player to have the same team retiring two different jerseys. Bryant played 20 years for Los Angeles Lakers sporting the No. 8 and No. 24 jerseys in either halves of his career.\r\nBryant was among the very few players who had come in… [+2227 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Pujara was a real pain in the back: Pat Cummins - Hindustan Times", "description": "Cheteshwar Pujara was one of the defining factors of India’s historic win over Australia in the 2018/19 four-match Test series.", "url": "https://www.hindustantimes.com/cricket/pujara-was-a-real-pain-in-the-back-pat-cummins/story-qqlUgtZZEpIwgIs03k6IfM.html", "urlToImage": null, "publishedAt": "2020-04-26T05:15:19Z", "content": "Cheteshwar Pujara was one of the defining factors of India’s historic win over Australia in the 2018/19 four-match Test series. More than a year later, Australian fast bowler Pat Cummins said that Pujara remains one of the toughest he has ever bowled to.\r\nCum… [+951 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Anirudh Singh", "title": "R Ashwin reveals how MS Dhoni helped him to dismiss Jonathan Trott in Champion Trophy 2013... - The Cricket Times", "description": "Ravichandran Ashwin and his former India teammate Suresh Raina had a live Instagram session on Friday evening. And, the duo recalled some cherishing memories while they used to play together for Team India and Chennai Super Kings (CSK) in IPL. During the inte…", "url": "https://crickettimes.com/2020/04/r-ashwin-reveals-how-ms-dhoni-helped-him-to-dismiss-jonathan-trott-in-champion-trophy-2013-final/", "urlToImage": null, "publishedAt": "2020-04-26T05:07:40Z", "content": "Ravichandran Ashwin and his former India teammate Suresh Raina had a live Instagram session on Friday evening. And, the duo recalled some cherishing memories while they used to play together for Team India and Chennai Super Kings (CSK) in IPL.\r\nDuring the int… [+2463 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Sports Desk", "title": "Messi or Ronaldo? Brazilian legends Pele, Ronaldinho and Ronaldo answer - The Indian Express", "description": "Who is a more complete player - Lionel Messi or Cristiano Ronaldo? Brazilian legends Pele, Ronaldinho and Ronaldo pick their side.", "url": "https://indianexpress.com/article/sports/football/messi-or-ronaldo-brazilian-legends-pele-ronaldinho-and-ronaldo-answer-6378475/", "urlToImage": null, "publishedAt": "2020-04-26T05:04:15Z", "content": "Messi or Ronaldo? Brazilian legends Pele, Ronaldinho and Ronaldo pick their sideWith coronavirus bringing sports and life in general to a halt in the entire world, football stars have started answering difficult questions: Who is the best in the world – Lione… [+2552 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Play short ball or forget internationals: Kohli on 3 coaches who shaped his career - Hindustan Times", "description": "The Indian captain also spoke about the sessions with former South Africa wicket-keeper and current coach Mark Boucher and recalled how he was asked to improve his game against the short ball.", "url": "https://www.hindustantimes.com/cricket/play-short-ball-or-forget-about-internationals-virat-kohli-names-3-coaches-who-shaped-his-career/story-7E2ZPKC50CDugVaPcJZnoO.html", "urlToImage": null, "publishedAt": "2020-04-26T04:09:31Z", "content": "Team India captain Virat Kohli hailed the impact of different coaches in shaping his career and said that these people understood his game and they made him a better player. He spoke about former India captain Gary Kirsten and the impact he had on his career.… [+2232 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "KL Rahul raises nearly Rs 8 lakh to aid vulnerable children - Hindustan Times", "description": "Among other memorabilia that were auctioned were his helmet, which he sold for Rs 1,22,677, his pads for Rs 33,028, his ODI jersey for Rs 1,13,240, his T20 jersey for Rs 1,04,824, his Test jersey for Rs 1,32,774 and his gloves for Rs 28,782.", "url": "https://www.hindustantimes.com/cricket/kl-rahul-raises-nearly-rs-8-lakh-to-aid-vulnerable-children/story-ZZhHgEkkX0tO0bULOjRsjP.html", "urlToImage": null, "publishedAt": "2020-04-26T04:09:27Z", "content": "KL Rahul has auctioned the bat he used in the 2019 World Cup for Rs 2,64,228. He also auctioned a slew of other equipment with his brand Gully with the proceeds going to the “Aware Foundation” to help vulnerable children during the ongoing coronavirus pandemi… [+1825 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "David Warner shares adorable dance video with wife Candice, daughters--Watch - Zee News", "description": "Warner was set to represent Sunrisers Hyderabad in the IPL 2020, which was due to take place from March 29 but it has now been postponed indefinitely due to coronavirus.", "url": "https://zeenews.india.com/cricket/david-warner-shares-adorable-dance-video-with-wife-candice-daughters-watch-2279018.html", "urlToImage": null, "publishedAt": "2020-04-26T04:02:33Z", "content": "As all the sporting activities across the globe are currently at standstill due to coronavirus pandemic, swashbuckling Australian opener David Warner is keeping his fans entertained by constantly posting videos with his family on social media.\r\nFrom shaking l… [+1516 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Rasesh Mandani", "title": "Bailout plan: Play more matches with India - Hindustan Times", "description": "Later this year, the new Future Tours Programme (FTP) for the years 2023-2031 will be finalised; the ICC continues to be heavily dependent on the BCCI for revenue.", "url": "https://www.hindustantimes.com/cricket/bailout-plan-play-more-matches-with-india/story-VRqndyDqK1aBAy0bT21qoO.html", "urlToImage": null, "publishedAt": "2020-04-26T02:57:47Z", "content": "The Board of Control for Cricket in India (BCCI), the richest body in world cricket, has come up with a plan to help countries facing losses due to the cancellation of cricket worldwide -- although the idea is contingent on games resuming.\r\nAccording to BCCI … [+4642 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Transfer news and rumours LIVE: Klopp calls Mbappe's dad over Liverpool switch - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T02:30:00Z", "content": "More"}, {"source": {"id": null, "name": "Chessbase.com"}, "author": "", "title": "Magnus Carlsen Invitational: Nakamura in sole second place - Chessbase News", "description": "Hikaru Nakamura and Ding Liren obtained key victories in round four of the Magnus Carlsen Invitational. Nakamura took down Ian Nepomniachtchi 2½:1½, while Ding had black and drew Anish Giri in the Armageddon decider of their match-up. Nakamura is now in sole …", "url": "https://en.chessbase.com/post/magnus-carlsen-invitational-2020-r4-b", "urlToImage": null, "publishedAt": "2020-04-26T01:59:35Z", "content": "Ding wins in Armageddon\r\nThe fight to reach the final-four knockout of the Magnus Carlsen Invitational has almost completely been narrowed down to six players. Carlsen and Nakamura are favourites to qualify, while Ding and Fabiano Caruana are leading the race… [+5829 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Reubyn Coutinho", "title": "Is The Latest Draft Signing of New England Patriots a Far-Right Militia Supporter? - Essentially Sports", "description": "The New England Patriots latest draft pick Jordan Rohrwasser has a 'III' tattoo which led to speculation that he is a far-right milita supporter.", "url": "https://www.essentiallysports.com/nfl-news-is-the-latest-draft-signing-of-new-england-patriots-a-far-right-militia-supporter/", "urlToImage": null, "publishedAt": "2020-04-26T01:59:00Z", "content": "The New England Patriots used the 159th pick in the 5th round to draft Justin Rohrwasser. The Marshall University prospect is a placekicker who will have big shoes to fill at the Massachusetts based team. Also, he is the 2020 NFL draft’s highest-drafted place… [+2010 chars]"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Gill Clark", "title": "Lionel Messi is a very easy player to coach, says Ernesto Valverde - Barca Blaugranes", "description": "The former boss has been talking about the GOAT", "url": "https://www.barcablaugranes.com/2020/4/26/21236217/lionel-messi-is-a-very-easy-player-to-coach-says-ernesto-valverde", "urlToImage": null, "publishedAt": "2020-04-25T23:11:34Z", "content": "Former Barcelona manager Ernesto Valverde has been talking about what its like to manage Lionel Messi and how easy it is to coach the Argentina international.\r\nValverde was fired in January after two-and-a-half years at the club where he won two league titles… [+1091 chars]"}, {"source": {"id": null, "name": "Espn.co.uk"}, "author": "Adrian Wojnarowski", "title": "NBA reopening team practice facilities Friday where local restrictions eased, sources say - ESPN.co.uk", "description": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.", "url": "https://www.espn.co.uk/nba/story/_/id/29099194/nba-reopening-team-practice-facilities-friday-where-local-restrictions-eased-sources-say", "urlToImage": null, "publishedAt": "2020-04-25T23:09:06Z", "content": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.\r\nPlayers can return to team facilities in states such as … [+2131 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "ESPN", "title": "Ex-Chelsea forward Costa: Conte would never last as Real Madrid boss - ESPN India", "description": "Former Chelsea forwarded Diego Costa told ESPN Brasil that he thinks Antonio Conte could never last a full season at a club like Real Madrid.", "url": "https://www.espn.in/football/chelsea/story/4088814/ex-chelsea-forward-costa-conte-would-never-last-as-real-madrid-boss", "urlToImage": null, "publishedAt": "2020-04-25T21:38:12Z", "content": "Former Chelsea forward Diego Costa told ESPN Brasil that he thinks Antonio Conte could never last a full season at a club like Real Madrid.\r\nCosta left Chelsea at the end of the 2016-17 season following a row with Conte and returned to Atletico Madrid -- the … [+2163 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'My biggest mistake was joining Inter – I could've gone to Madrid, Barca or Man Utd' - Pancev regrets Italy move - Goal India", "description": "Antonio Conte may have won league titles in Italy and England, but the Inter coach would not last a season in charge of Real Madrid, according to Diego Costa.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T18:54:24Z", "content": "More"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'Very doubtful' Premier League will play again in 2019-20, says Dutch FA chief - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T18:27:00Z", "content": "More"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Romain Grosjean Reveals an Insider Analysis of Kimi Raikkonen and Fernando Alonso as Teammates - India Gone Viral", "description": "From the outset, Kimi Raikkonen and Fernando Alonso are exact opposites. The Finn seems cold, while the Spanish is a passionate driver. However, Romain Grosjean offers a striking perspective on both.", "url": "https://indiagoneviral.com/sports/2020/04/25/romain-grosjean-reveals-an-insider-analysis-of-kimi-raikkonen-and-fernando-alonso-as-teammates/42331/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T18:06:41Z", "content": "From the outset, Kimi Raikkonen and Fernando Alonso are exact opposites. The Finn seems cold, while the Spanish is a passionate driver. However, Romain Grosjean offers a striking perspective on both. He accepts the two are surprisingly the same somehow or ano… [+2002 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'Of course I am!' - Maddison reacts to Leicester fan asking if he's staying amid Man Utd links - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T17:27:00Z", "content": "More"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "ESPNcricinfo staff", "title": "Sana Mir retires from international cricket | ESPNcricinfo.com - ESPNcricinfo", "description": "Mir, who made her debut in 2005, took 151 wickets in 120 ODIs and 89 wickets in 106 T20Is | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29097056/sana-mir-retires-international-cricket", "urlToImage": null, "publishedAt": "2020-04-25T17:03:37Z", "content": "Sana Mir, arguably the greatest woman cricketer Pakistan has produced, has announced her retirement from international cricket, bringing an end to a 15-year career. Mir, who made her international debut in 2005, took 151 wickets at an average of 24.27 in 120 … [+2839 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "I was clueless on Test debut, thought had played my last game: Sachin Tendulkar - Times of India", "description": "Cricket News: In his first Test in 1989, Sachin Tendulkar was up against a Pakistan pace attack of Imran Khan, Wasim Akram & Waqar Younis. Recalling the outing, he", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/i-was-clueless-on-test-debut-thought-had-played-my-last-game-sachin-tendulkar/articleshow/75378166.cms", "urlToImage": null, "publishedAt": "2020-04-25T16:40:51Z", "content": "LONDON: Sachin Tendulkar says he was \"clueless\" on his Test debut and almost cried thinking it was all over for him.\r\nWhen he walked out for the last time 24 years later, Tendulkar would do so as a batting great with a record 200 Test appearances to his name.… [+2404 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Have gone mad searching for it: Jofra Archer reveals he has lost his World Cup 2019 medal - India Today", "description": "England fast bowler Jofra Archer said he has been searching for his World Cup medal at his new place over the last week without much success.", "url": "https://www.indiatoday.in/sports/cricket/story/jofra-archer-world-cup-2019-medal-lost-searching-new-flat-super-over-final-1671093-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T16:38:48Z", "content": "England fast bowler Jofra Archer said he misplaced his World Cup 2019 medal after he shifted his flat recently. Archer, who played a key role in England's historic triumph, added he has 'gone mad' searching for it at his new place.\r\nJofra Archer revealed he h… [+1644 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "https://www.facebook.com/mrinal.kuniyal", "title": "Mclaren F1 Denies Receiving Any Aid From Liberty Media - Essentially Sports", "description": "McLaren F1 has denied receiving any payment from Liberty Media. Zak Brown says that the Formula 1 owners are offering assistance to 'certain teams'.", "url": "https://www.essentiallysports.com/f1-news-liberty-media-not-paying-mclaren-f1-any-money/", "urlToImage": null, "publishedAt": "2020-04-25T15:19:00Z", "content": "McLaren F1 has denied receiving any payment from Liberty Media. Team boss Zak Brown says that the Formula 1 owners are offering assistance to ‘certain teams’.\r\nMcLaren, CEO Zak Brown was talking to Motorsport-Total.com. He said, “We have not received any adva… [+1473 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Anirudh Singh", "title": "Actress Nidhhi Agerwal clears the air about unfollowing KL Rahul on social... - The Cricket Times", "description": "Cricketers link-up with Bollywood actresses is very commonly seen days. Even though Virat Kohli and Anushka Sharma are right now termed as the 'power couple', there is much more to that. There have been many other successful couples and sad breakups seen by c…", "url": "https://crickettimes.com/2020/04/nidhhi-agerwal-clears-the-air-about-unfollowing-kl-rahul-on-social-media/", "urlToImage": null, "publishedAt": "2020-04-25T15:03:35Z", "content": "Cricketers link-up with Bollywood actresses is very commonly seen days. Even though Virat Kohli and Anushka Sharma are right now termed as the ‘power couple’, there is much more to that.\r\nThere have been many other successful couples and sad breakups seen by … [+1428 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Real Madrid president Perez still 'dreams' of signing Neymar, says PSG star's former agent - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T14:38:00Z", "content": "More"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Sakshi Jain", "title": "Rohit Sharma Takes a Friendly Jibe at Questions on MS Dhoni - Essentially Sports", "description": "Indian vice-captain Rohit Sharma gives a fitting reply to the fans asking about the comeback of India's former skipper MS Dhoni in the team.", "url": "https://www.essentiallysports.com/cricket-news-rohit-sharma-takes-a-friendly-jibe-at-questions-on-ms-dhoni/", "urlToImage": null, "publishedAt": "2020-04-25T14:31:00Z", "content": "There is a big question mark on the future of MS Dhoni in the Indian cricket team. MS Dhoni hasn’t revealed his plans yet. As a result, there is a curiosity among the fans related to the fate of their favorite Mahi in cricket. Recently, Indian team vice-capta… [+1821 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "PV Sindhu says was desperate to win World Championships as people started calling her 'silver Sindhu' - India Today", "description": "PV Sindhu, who beat her nemesis Nozomi Okuhara of Japan 21-7 21-7 to win World Championships, admitted that she felt bad when people said she has a \"final phobia\".", "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-says-was-desperate-to-win-world-championships-as-people-started-calling-her-silver-sindhu-1671055-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T14:03:03Z", "content": "Star shuttler P V Sindhu says she was desperate to win the World Championships title last year after a string of runner-up finishes as people started calling her \"silver Sindhu\".\r\nSindhu, who also won a silver medal in the 2016 Rio Olympics, admitted that she… [+1999 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "Kane Williamson relives emotions of World Cup 2019 final loss - Cricbuzz - Cricbuzz", "description": "New Zealand captain stressed he was proud of the way his players adapted throughout the tournament to different conditions", "url": "https://www.cricbuzz.com/cricket-news/112930/kane-williamson-relives-emotions-of-world-cup-2019-final-loss", "urlToImage": null, "publishedAt": "2020-04-25T13:54:23Z", "content": "\"I think the thing we can reflect upon and be proud of the way we played the entire tournament.\" © Getty\r\nThere is a certain wave of calmness about Kane Williamson. On or off the cricket field, the New Zealand skipper is known for his composed approach and on… [+3431 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "COVID-19: James Anderson to raise funds by auctioning shirt, bat and wicket - Hindustan Times", "description": "", "url": "https://www.hindustantimes.com/cricket/covid-19-james-anderson-to-raise-funds-by-auctioning-shirt-bat-and-wicket/story-OiuT4s6FUKuDCVLkgn0tgJ.html", "urlToImage": null, "publishedAt": "2020-04-25T13:34:42Z", "content": "London, April 25 (IANS) With the coronavirus outbreak bringing the world to a standstill, sportspersons have tried their best to help the poor and needy and English pacer James Anderson is now set to auction his shirt, bat and a wicket from the last Test that… [+2011 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": null, "title": "Taipei T10 League 2020: Match 6, TCA Indians vs Taiwan Dragons: MyTeam11 Fantasy Cricket Tips – Playing XI, Pitch Report & Injury Update - CricTracker", "description": "Taipei T10 League 2020: MyTeam11 Fantasy Cricket Tips, Playing XIs, Yingfeng Pitch Report & Injury News for Match 6, TCA Indians vs Taiwan Dragons", "url": "https://m.crictracker.com/taipei-t10-league-2020-match-6-tca-indians-vs-taiwan-dragons-myteam11-fantasy-cricket-tips-playing-xi-pitch-report-injury-update/", "urlToImage": null, "publishedAt": "2020-04-25T13:13:30Z", "content": "Cricket Stadium. (Photo by Robert Cianflone/Getty Images)\r\nMatch Details:\r\nThe 6th match of the Taipei T10 League 2020 will be played between TCA Indians and Taiwan Dragons at the Yingfeng Cricket Ground in Songshan District.\r\nThe match starts at 3:30 PM loca… [+3728 chars]"}, {"source": {"id": null, "name": "Thesportsrush.com"}, "author": "Tanish Chachra", "title": "Manchester City star David Silva names best Premier League player of his era - The Sportsrush", "description": "Manchester City star David Silva picks best Premier League player to play in his era as he goes live on for an AMA on social media. Manchester City's captain David Silva has completed 10 years in the Premier League this year and in his time with the Citizens,…", "url": "https://thesportsrush.com/manchester-city-star-david-silva-names-best-premier-league-player-of-his-era/", "urlToImage": null, "publishedAt": "2020-04-25T13:12:00Z", "content": "Manchester City star David Silva picks best Premier League player to play in his era as he goes live on for an AMA on social media.\r\nManchester City’s captain David Silva has completed 10 years in the Premier League this year and in his time with the Citizens… [+1530 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Vinayak Manoj", "title": "WATCH: UFC Drops a Chilling Promo For Tony Ferguson vs Justin Gaethje - Essentially Sports", "description": "Ahead of UFC 249, the promotion have dropped an insane video as an effort to promote the upcoming star studded event that will take place on May 9th.", "url": "https://www.essentiallysports.com/ufc-249-news-watch-ufc-drops-a-chilling-promo-for-tony-ferguson-vs-justin-gaethje/", "urlToImage": null, "publishedAt": "2020-04-25T12:45:00Z", "content": "With a lot of uncertainty looming over the future of the UFC lightweight division, a new promotional video for the headliner comes as a sign of relief for fans all over the world.\r\nGuaranteeing fireworks, the star-studded UFC 249 roster is one of the greatest… [+2051 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Deepit Sharma", "title": "“He’s One of the Best in the World!”- Dana White Weighs in on Dominick Cruz vs Henry Cejudo - Essentially Sports", "description": "Dominick Cruz will make a much-awaited return to the octagon at UFC 249 on 9 May, and Dana White believes he is just as deserving of a title shot as always.", "url": "https://www.essentiallysports.com/ufc-news-hes-one-of-the-best-in-the-world-dana-white-weighs-in-on-dominick-cruz-vs-henry-cejudo/", "urlToImage": null, "publishedAt": "2020-04-25T12:29:00Z", "content": "Dominick Cruz associates with the UFC and MMA on many levels. His varied roles include appearing as a ringside commentator and a sports analyst at ESPN. However, as a fighter, he last made his appearance in December 2016.\r\nThe 35-year-old is a two-time Bantam… [+1993 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "India Today League PUBG Mobile Invitational Day 3: SynerGE pip TSM ENTITY to win final Match - India Today", "description": "India Today League PUBG Mobile Invitational: In a gripping battle in Match 4 in Sanhok, SynerGE won their first chicken dinner of the tournament after they edged out TSM ENTITY who have been the most impressive team on Day 3.", "url": "https://www.indiatoday.in/sports/other-sports/story/itpubl-match-4-day-3-synerge-pip-tsm-entity-pubg-mobile-invitational-1671018-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T12:23:37Z", "content": "It looked like TSM ENTITY would take their third 3rd Chicken Dinner of Day 3 of India Today League PUBG Mobile Invitational but Team SynerGE spoiled their party by winning Match 4 in Sanhok.\r\nWith 11 kills and a total of 31 points SynerGe took the top spot an… [+1675 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Miscreants attempt to rob stumper Saha's Siliguri home, says relative - Hindustan Times", "description": "Saha, 35, lives in South Kolkata with his wife and children. The experienced stumper’s parents, who live in their Ward No.31 Shaktigarh area house in Siliguri, are at present staying with their son in Kolkata.", "url": "https://www.hindustantimes.com/cricket/miscreants-attempt-to-rob-stumper-saha-s-siliguri-home-says-relative/story-tRusZSKZV1FBBTmYrEWIlO.html", "urlToImage": null, "publishedAt": "2020-04-25T12:04:21Z", "content": "A relative of Wriddhiman Saha has alleged that a few miscreants tried to break into the India Test wicketkeeper’s ancestral home in Siliguri, North Bengal, on Friday in a bungled attempt to rob the place.\r\nSaha, 35, lives in South Kolkata with his wife and ch… [+1344 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "Legalising ball tampering: Saliva is must and vaseline is no replacement, feel Ashish Nehra, Harbhajan Singh - Hindustan Times", "description": "Former India pacer Ashish Nehra and spinner Harbhajan Singh feel that saliva’s use in shining the ball is a “must”. Ex-opener Aakash Chopra, while beng open to the idea, wants to know where one can draw the line.", "url": "https://www.hindustantimes.com/cricket/legalising-ball-tampering-saliva-is-must-and-vaseline-is-no-replacement-feel-ashish-nehra-harbhajan-singh/story-6sGuYrV3wtqCeH94TJ9N9K.html", "urlToImage": null, "publishedAt": "2020-04-25T11:23:53Z", "content": "Saliva and sweat are components that cannot be entirely done away with, insist a few distinguished India cricketers, as the ICC contemplates legalising ball tampering post COVID-19 by using artificial substances to prevent virus spread. Former India pacer Ash… [+3372 chars]"}, {"source": {"id": null, "name": "Sempreinter.com"}, "author": null, "title": "Chelsea Join Inter In Race To Sign 70M Rated Arsenal Striker Aubameyang - SempreInter", "description": "Chelsea are interested in Inter target Pierre Emerick Aubameyang, according to a report from international broadcaster ESPN earlier today. The report", "url": "https://sempreinter.com/2020/04/25/chelsea-join-inter-in-race-to-sign-70m-rated-arsenal-striker-aubameyang/", "urlToImage": null, "publishedAt": "2020-04-25T11:21:28Z", "content": "Chelsea are interested in Inter target Pierre Emerick Aubameyang, according to a report from international broadcaster ESPN earlier today.\r\nThe report details how the Blues have identified the Gabonese striker as the ideal player to reinforce their attack nex… [+784 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Oliver Browning", "title": "WWE news: The 30 greatest pro wrestlers of all-time have been ranked - GIVEMESPORT", "description": "WWE news: The 30 greatest pro wrestlers of all-time have been ranked", "url": "https://www.givemesport.com/1564783-wwe-news-the-30-greatest-pro-wrestlers-of-alltime-have-been-ranked", "urlToImage": null, "publishedAt": "2020-04-25T10:59:58Z", "content": "There are so many legendary names linked with professional wrestling. \r\nWWE stars like Hulk Hogan, The Undertaker, Andre the Giant and The Rock instantly spring to mind. \r\nThen, of course, there are some that have made a name for themselves outside of America… [+1569 chars]"}, {"source": {"id": null, "name": "Juvefc.com"}, "author": "juvefcdotcom", "title": "Cristiano Ronaldo will remain with Juventus - JuveFC", "description": "Cristiano Ronaldo will remain with Juventus until 2022, according to Tuttosport.", "url": "https://www.juvefc.com/cristiano-ronaldo-will-remain-with-juventus/", "urlToImage": null, "publishedAt": "2020-04-25T09:42:58Z", "content": "Cristiano Ronaldo will remain with Juventus until 2022, according to Tuttosport.\r\nThe 34-year-old has been with the Bianconeri for two seasons of his four-year contract after a big money move from Real Madrid in 2018.\r\nReports in Spanish and Italian press hav… [+409 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "‘You don’t want the fear,’ Yuvraj Singh explains why cricket should return only after Covid-19 is e... - Hindustan Times", "description": "Like other sports, international and domestic cricket too has been disrupted leading the national boards to contemplate resuming the game in empty stadiums, without fans.", "url": "https://www.hindustantimes.com/cricket/you-don-t-want-the-fear-yuvraj-singh-explains-why-cricket-should-return-only-after-covid-19-is-eradicated/story-7okHJdLw1JTTSzbxY9JJ6L.html", "urlToImage": null, "publishedAt": "2020-04-25T09:34:05Z", "content": "Former India star Yuvraj Singh wants cricket to resume only when the world becomes COVD-19 free as players’ health and safety should be paramount for the custodians of the game.\r\nLike other sports, international and domestic cricket too has been disrupted lea… [+1271 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "Dinesh Karthik picks his best IPL XI; expresses disappointment for not including MS Dhoni and R... - The Cricket Times", "description": "India wicket-keeper batsman Dinesh Karthik, recently picked his all-time T20 XI in the Indian Premier League (IPL). The only criterion for his selection was having played at least one game with the players. Karthik, renowned for his finishing abilities lower …", "url": "https://crickettimes.com/2020/04/dinesh-karthik-picks-his-best-ipl-xi-expresses-disappointment-for-not-including-ms-dhoni-and-r-ashwin/", "urlToImage": null, "publishedAt": "2020-04-25T09:33:01Z", "content": "India wicket-keeper batsman Dinesh Karthik, recently picked his all-time T20 XI in the Indian Premier League (IPL). The only criterion for his selection was having played at least one game with the players.\r\nKarthik, renowned for his finishing abilities lower… [+1972 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": null, "title": "‘He was a real pain in the back for us’ – Pat Cummins picks Cheteshwar Pujara as the toughest batsman to bowl - CricTracker", "description": "Pat Cummins, who is the World's number 1 Test bowler, recalled the painstaking series for Australia in 2018-19 season which India", "url": "https://m.crictracker.com/he-was-a-real-pain-in-the-back-for-us-pat-cummins-picks-cheteshwar-pujara-as-the-toughest-batsman-to-bowl/", "urlToImage": null, "publishedAt": "2020-04-25T09:04:22Z", "content": "Pat Cummins and Cheteshwar Pujara. (Photo Source: Getty Images)\r\nTeam India scripted history during their previous Australia tour by winning their first ever Test series down under. Though the hosts missed their best batsman in David Warner and Steve Smith, A… [+1980 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Clubs will not splurge on transfer when football resumes: Manchester United chief Ed Woodward - India Today", "description": "Manchester United chief executive Ed Woodward said it may not be business as usual for Premier League teams when football resumes after the Covid-19 crisis eases out.", "url": "https://www.indiatoday.in/sports/football/story/manchester-united-transfer-spending-no-business-as-usual-ed-woodward-coronavirus-1670930-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T08:36:23Z", "content": "Manchester United chief executive Ed Woodward says clubs will not spend \"hundreds of millions\" when signing new players in the transfer window as they will be mindful of the financial impact of the COVID-19 pandemic.\r\nProfessional football in England has been… [+2057 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Saketh Kandadai", "title": "“It Was Not an Easy Night”: Steve Kerr Narrates a Hilarious Betting Story of Michael Jordan From Their College Days - Essentially Sports", "description": "Golden State Warriors coach Steve Kerr revealed a funny betting story with his former Chicago Bulls teammate Michael Jordan.", "url": "https://www.essentiallysports.com/nba-news-chicago-bulls-it-was-not-an-easy-night-steve-kerr-narrates-a-hilarious-betting-story-of-michael-jordan-from-their-college-days/", "urlToImage": null, "publishedAt": "2020-04-25T07:25:11Z", "content": "Golden State Warriors coach Steve Kerr revealed a funny betting story with his former teammate Michael Jordan.\r\nIt was during a game when Kerr was playing for the University of Arizona while Jordan was at the University of North Carolina. Kerr’s Wildcats defe… [+2070 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Rob Swan", "title": "Premier League football could be back on live TV ‘within weeks’ - GIVEMESPORT", "description": "Premier League football could be back on live TV ‘within weeks’", "url": "https://www.givemesport.com/1564740-premier-league-football-could-be-back-on-live-tv-within-weeks", "urlToImage": null, "publishedAt": "2020-04-25T07:13:11Z", "content": "It seems increasingly likely that the 2019-20 Premier League season will be concluded, according to fresh reports.\r\nNo top-flight football has been played in England since March 9 due to the ongoing coronavirus pandemic, which has threatened to lead to the ca… [+2264 chars]"}, {"source": {"id": null, "name": "Icc-cricket.com"}, "author": "ICC", "title": "Obituary: Graeme Watson - International Cricket Council", "description": "Graeme Watson, an all-rounder who featured in five Tests and two ODIs for Australia, died at 75 following a battle with cancer.", "url": "https://www.icc-cricket.com/news/1660856/obituary-graeme-watson", "urlToImage": null, "publishedAt": "2020-04-25T07:10:21Z", "content": "Graeme Watson, an all-rounder who featured in five Tests and two ODIs for Australia, died at 75 following a battle with cancer.Watson, a middle-order batsman and medium-pace bowler, finished his career with 4,674 runs and 186 wickets from 107 first-class game… [+1984 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "No to saliva, yes to shine: Ball-tampering laws in cricket may change - Times of India", "description": "Cricket News: Cricket may change ball-tampering laws and approve external method to help polish the red cherry in proposed post-corona measures. The matter of saliv", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/no-to-saliva-yes-to-shine-ball-tampering-laws-in-cricket-may-change/articleshow/75367490.cms", "urlToImage": null, "publishedAt": "2020-04-25T04:40:29Z", "content": "NEW DELHI: The coronavirus pandemic may force cricket's world governing body to tweak one of its oldest rules and approve the use of an artificial substance to help shine the ball, effectively legalizing what has for long been a core tenet of the sport's anti… [+4836 chars]"}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "David Pasztor", "title": "Ziyech looking forward to normalcy with Chelsea after abrupt end with Ajax - We Ain't Got No History", "description": "Chelsea’s new signing reflects on a most strange end to his Ajax career, and the big step ahead of him", "url": "https://weaintgotnohistory.sbnation.com/2020/4/25/21235599/ziyech-looking-forward-to-normalcy-with-chelsea-after-abrupt-end-with-ajax", "urlToImage": null, "publishedAt": "2020-04-25T03:15:22Z", "content": "This is not how Hakim Ziyech planned to say goodbye. On March 7, with his team leading 3-1 in the 68th minute, he saw his number go up on the substitution board. On came 17-year-old Ryan Gravenberch, and off went Ziyech for, as it turns out, the last time as … [+3911 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "George Dobell", "title": "UK government hands ECB lead on viability of 'bio-secure' sport | ESPNcricinfo.com - ESPNcricinfo", "description": "England will play at as few grounds as possible if cricket goes behind closed doors, says ECB CEO | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29094232/uk-government-hands-ecb-lead-viability-bio-secure-sport", "urlToImage": null, "publishedAt": "2020-04-25T02:19:30Z", "content": "The ECB has been asked by the UK government to lead the way into investigating the viability of playing sport in a bio-secure environment.\r\nWith an increasing acceptance that the best chance of fulfilling the broadcast deals that keep nearly all sport afloat … [+8018 chars]"}, {"source": {"id": null, "name": "Trendinindia.in"}, "author": "sourav chowdhury", "title": "Island of Vanuatu becomes 1st nation to resume cricket, live actions to start this week - Trendinindia", "description": "They're prepared to go live in Vanuatu.A tropical island within the South Pacific may be very seemingly to be the one venue on the earth internet hosting a aggressive cricket ultimate on Saturday, as most worldwide sport stays shuttered across the globe.Vanua…", "url": "https://trendinindia.in/island-of-vanuatu-becomes-1st-nation-to-resume-cricket-live-actions-to-start-this-week/", "urlToImage": null, "publishedAt": "2020-04-24T23:18:47Z", "content": "They’re prepared to go live in Vanuatu.\r\nA tropical island within the South Pacific may be very seemingly to be the one venue on the earth internet hosting a aggressive cricket ultimate on Saturday, as most worldwide sport stays shuttered across the globe.\r\nV… [+3446 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Kho kho captain strikes gold, lands in penury - Times of India", "description": "The Covid-19 pandemic brought despair for Nasreen and her family. She landed a contractual job with Airports Authority of India (AAI) last year, but s", "url": "https://timesofindia.indiatimes.com/city/delhi/kho-kho-captain-strikes-gold-lands-in-penury/articleshow/75362916.cms", "urlToImage": null, "publishedAt": "2020-04-24T22:04:42Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "marca", "name": "Marca"}, "author": "Christian Gaudioso, Adapted by Billy Munday", "title": "Tebas: Once we're allowed to restart the season, clubs will be punished if they refuse to play - MARCA.com", "description": "LaLiga president Javier Tebas has insisted that teams who refuse to play the rest of the season will be punished.\n\nOrganisations like the Spanish...", "url": "https://www.marca.com/en/football/spanish-football/2020/04/24/5ea335ee46163fd4248b4661.html", "urlToImage": null, "publishedAt": "2020-04-24T18:58:00Z", "content": "LaLiga president Javier Tebas has insisted that teams who refuse to play the rest of the season will be punished.\r\nOrganisations like the Spanish Footballers' Association (AFE) have expressed their concern over player safety once the season resumes.\r\n\"If a cl… [+2899 chars]"}, {"source": {"id": null, "name": "Atptour.com"}, "author": null, "title": "Virtual Blockbuster! Rafael Nadal & Andy Murray In Same Group In Mutua Madrid Open Virtual Pro - ATP Tour", "description": "The draw for the Mutua Madrid Open Virtual Pro has been made, and although the action will be played in a video game, there is a round-robin blockbuster that jumps off the page. Five-time Madrid champion Rafael Nadal is joined by another former World No. 1, A…", "url": "https://www.atptour.com/en/news/mutua-madrid-open-virtual-pro-2020-draw", "urlToImage": null, "publishedAt": "2020-04-24T18:30:30Z", "content": "The draw for the Mutua Madrid Open Virtual Pro has been made, and although the action will be played in a video game, there is a round-robin blockbuster that jumps off the page.\r\nFive-time Madrid champion Rafael Nadal is joined by another former World No. 1, … [+3125 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": "India Today Television", "title": "Absolutely priceless: Sachin Tendulkar spends a quiet 47th birthday with his mother - India Today", "description": "Sachin Tendulkar turned 47 on Friday. The Master Blaster decided not to celebrate his birthday this year as a mark of respect towards the Covid-19 warriors. In fact he has tweeted on the occasion with a picture with his mother captioning it: \"Started my day b…", "url": "https://www.indiatoday.in/sports/video/absolutely-priceless-sachin-tendulkar-spends-a-quiet-47th-birthday-with-his-mother-1670812-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T18:15:45Z", "content": "Sachin Tendulkar turned 47 on Friday. The Master Blaster decided not to celebrate his birthday this year as a mark of respect towards the Covid-19 warriors. In fact he has tweeted on the occasion with a picture with his mother captioning it: \"Started my day b… [+491 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "Daniel Brettig", "title": "Cricket to consider legalised ball-tampering in wake of coronavirus | ESPNcricinfo.com - ESPNcricinfo", "description": "There are concerns about using saliva when cricket resumes due to the risks posed by Covid-19 | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29091809/cricket-consider-legalised-ball-tampering-wake-coronavirus", "urlToImage": null, "publishedAt": "2020-04-24T18:07:58Z", "content": "Coronavirus may force the busting of one of cricket's greatest taboos, as authorities consider the possibility of allowing the use of artificial substances to help polish the red ball under the supervision of umpires in long-form matches, in order to end the … [+6202 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Ibrahimovic slams 'kindergarten-level' vandals who attacked AC Milan forward's statue in Malmo - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T16:14:00Z", "content": "More"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Barca Blaugranes Staff", "title": "Bayern announce Philippe Coutinho has undergone ankle surgery - Barca Blaugranes", "description": "The Barcelona loanee has gone under the knife", "url": "https://www.barcablaugranes.com/2020/4/24/21234464/philippe-coutinho-undergoes-successful-ankle-surgery", "urlToImage": null, "publishedAt": "2020-04-24T15:07:34Z", "content": "Bayern Munich have announced that Philippe Coutinho has undergone ankle surgery and will be sidelined for a couple of weeks before beginning his recovery.\r\nThe Brazilian, who is on a season-long loan from Barcelona, went under the knife during which loose joi… [+601 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "Rohit Sharma tags Shubman Gill as the future of Indian... - The Cricket Times", "description": "During a recent interaction between former India and Mumbai Indians colleagues Harbhajan Singh and Rohit Sharma, the latter tagged Punjab batsman Shubman Gill as the future of Indian cricket. Gill was an integral part of India' A' setup where he accumulated h…", "url": "https://crickettimes.com/2020/04/rohit-sharma-tags-shubman-gill-as-the-future-of-indian-cricket/", "urlToImage": null, "publishedAt": "2020-04-24T14:38:17Z", "content": "During a recent interaction between former India and Mumbai Indians colleagues Harbhajan Singh and Rohit Sharma, the latter tagged Punjab batsman Shubman Gill as the future of Indian cricket.\r\nGill was an integral part of India’ A’ setup where he accumulated … [+1583 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Amit Kumar", "title": "EXCLUSIVE: Fully recovered from injury and raring to go, says Bhuvneshwar Kumar - Times of India", "description": "Cricket News: Bhuvneshwar Kumar is fully fit now and desperately wants to make a comeback to the Indian side. “While it’s hard to keep indoors for a person like me", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/fully-recovered-from-injury-and-raring-to-go-says-bhuvneshwar-kumar/articleshow/75343641.cms", "urlToImage": null, "publishedAt": "2020-04-24T13:04:19Z", "content": "NEW DELHI: Fast bowlers and injuries go hand in hand. And it's no different for Indian cricketer Bhuvneshwar Kumar. Bhuvneshwar picked up a groin injury, which was later diagnosed to be a sports hernia and he had to miss the tour of New Zealand at the beginni… [+3535 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "Kevin Pietersen reacts to Michael Vaughan's 'jealousy'... - The Cricket Times", "description": "Former England batsman Kevin Pietersen responded to Michael Vaughan spilling beans about the atmosphere of the England side when the former bagged a lucrative IPL contract in 2009. Vaughan claimed about factions in the team envious about KP being recruited by…", "url": "https://crickettimes.com/2020/04/kevin-pietersen-reacts-to-michael-vaughans-jealousy-statement/", "urlToImage": null, "publishedAt": "2020-04-24T12:26:46Z", "content": "Former England batsman Kevin Pietersen responded to Michael Vaughan spilling beans about the atmosphere of the England side when the former bagged a lucrative IPL contract in 2009.\r\nVaughan claimed about factions in the team envious about KP being recruited b… [+2074 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Liverpool set to be crowned champions if season doesn’t finish: Report - Hindustan Times", "description": "Liverpool were on the threshold of ending their 30-year drought before the season was stalled because of the Coronavirus outbreak.", "url": "https://www.hindustantimes.com/football/liverpool-set-to-be-crowned-champions-if-season-doesn-t-finish-report/story-6U2KPVQl4Y7SGDwt7wXQ4N.html", "urlToImage": null, "publishedAt": "2020-04-24T12:15:13Z", "content": "English giants Liverpool will be crowned Premier League champions if the season cannot be completed, according to local media reports. The Premier League had to be stopped after matchday 29 as a precautionary measure against coronavirus pandemic.\r\nLiverpool w… [+1010 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Pornographic images pop-up as top badminton coaches left red-faced during online training session - India Today", "description": "An online training session held by Sports Authority of India (SAI) and Badminton Association of India (BAI) was abruptly ended of Thursday after pornographic images popped up on the screens.", "url": "https://www.indiatoday.in/sports/badminton/story/pornographic-images-bai-sai-online-training-session-pullela-gopichand-coach-badminton-zoom-videoconferencing-app-coronavirus-pandemic-1670627-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T12:13:35Z", "content": "The online training session held by Sports Authority of India (SAI) and Badminton Association of India (BAI) found itself in an unwanted situation after pornographic images suddenly flashed on the screens of 700-plus coaches across the country on Thursday.\r\nT… [+2211 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "Tim Keown", "title": "'The Last Dance' - Dennis Rodman embodied the pop culture phenomenon of the '90s Bulls - ESPN India", "description": "Spending time with Dennis Rodman in the mid-1990s meant having a front-row seat to the basketball/pop culture phenomenon of the Bulls, an experience that can only be described as surreal.", "url": "https://www.espn.in/nba/story/_/id/29083157/the-last-dance-dennis-rodman-embodied-pop-culture-phenomenon-90s-bulls", "urlToImage": null, "publishedAt": "2020-04-24T12:05:53Z", "content": "MY OLDEST SON was 5, in his second month of kindergarten, when his teacher asked why his dad hadn't been seen in the pickup line for a couple of weeks. \"He's living with Dennis Rodman,\" my son answered, dripping nonchalance, as if this were a task every Catho… [+16407 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "Fully fit Bhuvneshwar focusing on fitness with cricket on hold - Cricbuzz - Cricbuzz", "description": "The India pacer underwent surgery for sports hernia in January and has been out of action since", "url": "https://www.cricbuzz.com/cricket-news/112924/fully-fit-bhuvneshwar-focusing-on-fitness-with-cricket-on-hold", "urlToImage": null, "publishedAt": "2020-04-24T10:29:56Z", "content": "Bhuvneshwar underwent surgery for sports hernia in January and has been out of action since. © BCCI\r\nFast bowlers and injuries go hand in hand. And it's no different for Bhuvneshwar Kumar. The pacer picked up a groin injury, which was later diagnosed to be a … [+3079 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘He was a nightmare’: James Anderson, Stuart Broad name toughest batsman to bowl at - Hindustan Times", "description": "When asked about which batsman was the toughest to bowl against in their career, both had the same answer, former South Africa opener and captain Graeme Smith.", "url": "https://www.hindustantimes.com/cricket/he-was-a-nightmare-james-anderson-stuart-broad-name-toughest-batsman-to-bowl-at/story-QL2mlt84USC8Ay8K9e1g8O.html", "urlToImage": null, "publishedAt": "2020-04-24T09:28:05Z", "content": "James Anderson and Stuart Broad together form one of the most successful new ball duos in Test cricket. Both have bowled in tandem and wreaked havoc on touring batsmen in the helpful English conditions for many years now. Anderson has a record 584 wickets to … [+1507 chars]"}]}