{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "Jofra Archer reveals he’s lost his World Cup medal - Hindustan Times", "description": "“I moved flat and the picture is on the new wall but there’s no medal. I turned the house upside down for about a week but I still haven’t managed to find it,” said Jofra Archer.", "url": "https://www.hindustantimes.com/cricket/jofra-archer-reveals-he-s-lost-his-world-cup-medal/story-4beO8dQFZasGvfO16dS0cP.html", "urlToImage": null, "publishedAt": "2020-04-25T15:20:52Z", "content": "England fast bowler Jofra Archer said Saturday he’d “gone mad” looking for his World Cup winner’s medal after losing the prized piece of silverware while moving house.\r\nLast year saw the Sussex quick establish himself on the global stage as he helped England … [+2111 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "https://www.facebook.com/mrinal.kuniyal", "title": "Mclaren F1 Denies Receiving Any Aid From Liberty Media - Essentially Sports", "description": "McLaren F1 has denied receiving any payment from Liberty Media. Zak Brown says that the Formula 1 owners are offering assistance to 'certain teams'.", "url": "https://www.essentiallysports.com/f1-news-liberty-media-not-paying-mclaren-f1-any-money/", "urlToImage": null, "publishedAt": "2020-04-25T15:19:00Z", "content": "McLaren F1 has denied receiving any payment from Liberty Media. Team boss Zak Brown says that the Formula 1 owners are offering assistance to ‘certain teams’.\r\nMcLaren, CEO Zak Brown was talking to Motorsport-Total.com. He said, “We have not received any adva… [+1473 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "MS Dhoni and Rohit Sharma have similarities in their captaincy styles: Deepak Chahar - India Today", "description": "Highlighting the difference between MS Dhoni and Rohit Sharma's captaincy, India fast bowler Deepak Chahar said the former believes in not making changes if he finds a winning formula.", "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-rohit-sharma-captaincy-comparison-deepak-chahar-india-interview-1671066-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T15:09:09Z", "content": "India fast bowler Deepak Chahar said he sees a lot of similarities between MS Dhoni and Rohit Sharma's captaincy styles, saying both the India stars helped him flourish as a fast bowler at the international level.\r\nDeepak Chahar said both MS Dhoni and Rohit S… [+2349 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Vinayak Manoj", "title": "“I Would Do it For the Winner of Anthony Joshua and Tyson Fury”- Former Champion Hints Boxing Return - Essentially Sports", "description": "David Haye revealed he is willing to make a return to the boxing ring to fight the next heavyweight champion, Tyson Fury or Anthony Joshua", "url": "https://www.essentiallysports.com/boxing-news-i-would-do-it-for-the-winner-of-anthony-joshua-and-tyson-fury-former-champion-hints-boxing-return/", "urlToImage": null, "publishedAt": "2020-04-25T15:02:00Z", "content": "Having ducked out of professional boxing back in 2018. ‘Hayemaker’ David Haye is seemingly thinking of making a return to the ring. However, he only wants to take on the best of the best, which is either Tyson Fury or Anthony Joshua.\r\nThe Londoner took up ret… [+2410 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "I was clueless on Test debut, thought had played my last game: Sachin Tendulkar - Times of India", "description": "Cricket News: In his first Test in 1989, Sachin Tendulkar was up against a Pakistan pace attack of Imran Khan, Wasim Akram & Waqar Younis. Recalling the outing, he", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/i-was-clueless-on-test-debut-thought-had-played-my-last-game-sachin-tendulkar/articleshow/75378166.cms", "urlToImage": null, "publishedAt": "2020-04-25T14:04:29Z", "content": "LONDON: Sachin Tendulkar says he was \"clueless\" on his Test debut and almost cried thinking it was all over for him.\r\nWhen he walked out for the last time 24 years later, Tendulkar would do so as a batting great with a record 200 Test appearances to his name.… [+2404 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "https://www.facebook.com/profile.php?id=100009654009663", "title": "Romain Grosjean Reveals an Insider Analysis of Kimi Raikkonen and Fernando Alonso as Teammates - Essentially Sports", "description": "Romain Grosjean provides an Insider Analysis of Kimi Raikkonen and Fernando Alonso as he has driven with both the drivers", "url": "https://www.essentiallysports.com/f1-news-romain-grosjean-reveals-an-insider-analysis-of-kimi-raikkonen-and-fernando-alonso-as-teammates/", "urlToImage": null, "publishedAt": "2020-04-25T14:04:00Z", "content": "From the outset, Kimi Raikkonen and Fernando Alonso are exact opposites. The Finn seems cold, while the Spanish is a passionate driver. However, Romain Grosjean offers a striking perspective on both. He accepts the two are “surprisingly” the same somehow or a… [+2005 chars]"}, {"source": {"id": null, "name": "Trendinindia.in"}, "author": "sourav chowdhury", "title": "India Today League PUBG Mobile Invitational Day 3 wrap: TSM ENTITY top table with stunning show on Saturday - Trendinindia", "description": "India Today League PUBG Mobile Invitational is headed in direction of a gripping last day after three days of intense motion. TSM ENTITY, one in all India's top groups within the PUBG Mobile circuit, will head into the ultimate with a substantial lead on the …", "url": "https://trendinindia.in/india-today-league-pubg-mobile-invitational-day-3-wrap-tsm-entity-top-table-with-stunning-show-on-saturday/", "urlToImage": null, "publishedAt": "2020-04-25T13:30:49Z", "content": "India Today League PUBG Mobile Invitational is headed in direction of a gripping last day after three days of intense motion. TSM ENTITY, one in all India’s top groups within the PUBG Mobile circuit, will head into the ultimate with a substantial lead on the … [+3931 chars]"}, {"source": {"id": null, "name": "Sportskeeda.com"}, "author": "Prasen Moudgal", "title": "TDR vs TCI Taipei T10 League Dream11 Fantasy Predictions & Playing XI Updates for Today's T10 Match - Apr 26th, 2020 - Sportskeeda", "description": "Here are a few tips to help you pick your Dream11 team for Match 4 of the Taipei T10 League between TDR and TCI.", "url": "https://www.sportskeeda.com/fantasy-cricket-mantra/tdr-vs-tci-taipei-t10-league-dream11-fantasy-predictions-playing-xi-updates-for-today-s-t10-match-apr-26th-2020", "urlToImage": null, "publishedAt": "2020-04-25T13:25:53Z", "content": "Dream11 Taipei T10 League Fantasy Tips\r\nIn the first match of Taipei T10 League 2020's second day, the Taiwan Daredevils will take on the TCA Indians at the Yingfeng Ground in Songshan.\r\nThe Daredevils will be looking to bounce back to winning ways having los… [+2648 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Too early to talk about playing 5 Tests in Australia: BCCI official - Hindustan Times", "description": "A BCCI official said that a decision on that can be taken at the right time and any planning at this stage would be too early in the wake of the pandemic.", "url": "https://www.hindustantimes.com/cricket/too-early-to-talk-about-playing-5-tests-in-australia-bcci-official/story-7EezwXRXeWtEuIBD0F6cpN.html", "urlToImage": null, "publishedAt": "2020-04-25T12:58:55Z", "content": "The outbreak of the coronavirus has seen the Australian government seal the international boundaries till September 30. But Cricket Australia is not only keen to conduct the T20 World Cup in October, but also have India travel Down Under for the bilateral ser… [+1881 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Vinayak Manoj", "title": "WATCH: UFC Drops a Chilling Promo For Tony Ferguson vs Justin Gaethje - Essentially Sports", "description": "Ahead of UFC 249, the promotion have dropped an insane video as an effort to promote the upcoming star studded event that will take place on May 9th.", "url": "https://www.essentiallysports.com/ufc-249-news-watch-ufc-drops-a-chilling-promo-for-tony-ferguson-vs-justin-gaethje/", "urlToImage": null, "publishedAt": "2020-04-25T12:45:00Z", "content": "With a lot of uncertainty looming over the future of the UFC lightweight division, a new promotional video for the headliner comes as a sign of relief for fans all over the world.\r\nGuaranteeing fireworks, the star-studded UFC 249 roster is one of the greatest… [+2051 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Freddie Keighley", "title": "Top 10 most iconic Premier League goal celebrations including Liverpool and Man Utd - Mirror Online", "description": "From camera kisses and trademark dances to knockout punches and emphatic top-off antics, the Premier League has seen some of the wildest and most iconic celebrations over the years", "url": "https://www.mirror.co.uk/sport/football/top-10-most-iconic-premier-21900920", "urlToImage": null, "publishedAt": "2020-04-25T12:30:46Z", "content": "A great goal should always be followed up with a great celebration - whether a player has just scored a stoppage-time winner to secure the league title or reached a personal landmark.\r\nAnd Premier League stars have regularly stepped up to the challenge of pro… [+7596 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Shame I won't be returning to Chelmsford this year: Peter Siddle - Hindustan Times", "description": "Siddle first signed for the club in 2018 where he took 37 wickets. He then committed his future to Essex in 2019 by signing a two-year contract.", "url": "https://www.hindustantimes.com/cricket/shame-i-won-t-be-returning-to-chelmsford-this-year-peter-siddle/story-T0kBG7x3u3N62sFKP4rGIJ.html", "urlToImage": null, "publishedAt": "2020-04-25T12:26:26Z", "content": "Former Australian pacer Peter Siddle, whose contract with the Essex has been deferred until 2021, has said “it’s a shame he won’t be returning” to the club this year.\r\nOn Friday, Essex announced that Siddle will not join up with the side during the 2020 campa… [+1463 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nMatt Law,", "title": "Chelsea reject squad's offer of 10 per cent pay cut - Telegraph.co.uk", "description": "Club has told players to continue with their charitable donations while they try to strike an agreement over way forward on pay", "url": "https://www.telegraph.co.uk/football/2020/04/25/chelsea-reject-squads-offer-10-per-cent-pay-cut/", "urlToImage": null, "publishedAt": "2020-04-25T12:06:00Z", "content": "Chelsea have rejected the 10 per cent wage cut proposed by their first-team squad but negotiations are expected to continue during the coronavirus crisis.\r\nAs first revealed by Telegraph Sport, captain César Azpilicueta suggested a 10 per cent reduction in wa… [+1713 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Miscreants attempt to rob stumper Saha's Siliguri home, says relative - Hindustan Times", "description": "Saha, 35, lives in South Kolkata with his wife and children. The experienced stumper’s parents, who live in their Ward No.31 Shaktigarh area house in Siliguri, are at present staying with their son in Kolkata.", "url": "https://www.hindustantimes.com/cricket/miscreants-attempt-to-rob-stumper-saha-s-siliguri-home-says-relative/story-tRusZSKZV1FBBTmYrEWIlO.html", "urlToImage": null, "publishedAt": "2020-04-25T12:04:21Z", "content": "A relative of Wriddhiman Saha has alleged that a few miscreants tried to break into the India Test wicketkeeper’s ancestral home in Siliguri, North Bengal, on Friday in a bungled attempt to rob the place.\r\nSaha, 35, lives in South Kolkata with his wife and ch… [+1344 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "I still wake up to that nightmare of losing 2019 World Cup semi-final match vs New Zealand: KL Rahul - India Today", "description": "Team India batsman KL Rahul said that if given a chance he would change the result of the 2019 World Cup semifinal match against New Zealand.", "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-2019-world-cup-semifinal-lock-hurts-haunts-cricket-covid-19-lockdown-1670997-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T12:03:04Z", "content": "Star India batsman KL Rahul said the heartbreaking World Cup semifinal loss to New Zealand, especially after a near-perfect show in the group stages, continues to haunt him and his teammates.\r\nIn a special chat show, 'The Mind Behind', Rahul said if he was gi… [+1110 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Three Things We Want To See From the Kobe Bryant Documentary - India Gone Viral", "description": "‘The Last Dance,’ a ten-part documentary on Michael Jordan’s final season with the Chicago Bulls was released recently. Ever since the series claimed a massive following, fans have been chirping for a", "url": "https://indiagoneviral.com/sports/2020/04/25/three-things-we-want-to-see-from-the-kobe-bryant-documentary/42125/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T12:02:27Z", "content": "The Last Dance, a ten-part documentary on Michael Jordans final season with the Chicago Bulls was released recently. Ever since the series claimed a massive following, fans have been chirping for a similar documentary to be made on the legacy of the late Kobe… [+5755 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "Legalising ball tampering: Saliva is must and vaseline is no replacement, feel Ashish Nehra, Harbhajan Singh - Hindustan Times", "description": "Former India pacer Ashish Nehra and spinner Harbhajan Singh feel that saliva’s use in shining the ball is a “must”. Ex-opener Aakash Chopra, while beng open to the idea, wants to know where one can draw the line.", "url": "https://www.hindustantimes.com/cricket/legalising-ball-tampering-saliva-is-must-and-vaseline-is-no-replacement-feel-ashish-nehra-harbhajan-singh/story-6sGuYrV3wtqCeH94TJ9N9K.html", "urlToImage": null, "publishedAt": "2020-04-25T11:23:53Z", "content": "Saliva and sweat are components that cannot be entirely done away with, insist a few distinguished India cricketers, as the ICC contemplates legalising ball tampering post COVID-19 by using artificial substances to prevent virus spread. Former India pacer Ash… [+3372 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Transfer news and rumours LIVE: Chelsea launch Mertens bid - Goal.com", "description": "If the Bundesliga season got back underway tomorrow, RB Leipzig would be ready - according to U.S. national team midfielder Tyler Adams.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T10:59:00Z", "content": "More"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Dhruv George", "title": "Rubens Barrichello Accuses Williams F1 of Taking Wrong Decisions with Money - Essentially Sports", "description": "Recently, former F1 driver Rubens Barrichello appeared in a podcast and spoke on various topics of interest. Among them, he opened up on his Williams F1...", "url": "https://www.essentiallysports.com/f1-news-rubens-barrichello-accuses-williams-f1-of-taking-wrong-decisions-with-money/", "urlToImage": null, "publishedAt": "2020-04-25T10:46:00Z", "content": "Recently, former F1 driver Rubens Barrichello appeared in a podcast and spoke on various topics of interest. Among them, he opened up on his Williams F1 stint and reflected on its current sorry state. The Brazilian veteran revealed that he worked a lot on the… [+1641 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "‘If You Need Money Then You Should Stop Activities At The Border’: Kapil Dev - Swarajya", "description": "", "url": "https://swarajyamag.com/insta/if-you-need-money-then-you-should-stop-activities-at-the-border-kapil-dev", "urlToImage": null, "publishedAt": "2020-04-25T10:36:52Z", "content": null}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Washing vegetables more than I have washed my head: Suresh Raina on e-Agenda Aaj Tak - India Today", "description": "Suresh Raina and Harbhajan Singh were speaking about their life in the coronavirus lockdown while talking on e-Agenda Aaj Tak.", "url": "https://www.indiatoday.in/sports/cricket/story/suresh-rain-cleaning-toilets-washing-vegetables-more-than-i-have-ever-washed-my-head-humanity-harbhajan-singh-cricket-coronavirus-lockdown-pandemic-1670953-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T10:27:22Z", "content": "India bastman Suresh Raina was one of the first cricketers to contribute in the fight against the coronavirus pandemic in the country.\r\nThe swashbuckling left-hand batsman has also been very active on his social media handles and have spread out the messages … [+1206 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Sancho is nowhere near Aguero, Higuain, Messi & Di Maria - Neville - Goal India", "description": "If the Bundesliga season got back underway tomorrow, RB Leipzig would be ready - according to U.S. national team midfielder Tyler Adams.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T10:18:00Z", "content": "More"}, {"source": {"id": null, "name": "Juvefc.com"}, "author": "juvefcdotcom", "title": "Cristiano Ronaldo will remain with Juventus - JuveFC", "description": "Cristiano Ronaldo will remain with Juventus until 2022, according to Tuttosport.", "url": "https://www.juvefc.com/cristiano-ronaldo-will-remain-with-juventus/", "urlToImage": null, "publishedAt": "2020-04-25T09:42:58Z", "content": "Cristiano Ronaldo will remain with Juventus until 2022, according to Tuttosport.\r\nThe 34-year-old has been with the Bianconeri for two seasons of his four-year contract after a big money move from Real Madrid in 2018.\r\nReports in Spanish and Italian press hav… [+409 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "‘You don’t want the fear,’ Yuvraj Singh explains why cricket should return only after Covid-19 is e... - Hindustan Times", "description": "Like other sports, international and domestic cricket too has been disrupted leading the national boards to contemplate resuming the game in empty stadiums, without fans.", "url": "https://www.hindustantimes.com/cricket/you-don-t-want-the-fear-yuvraj-singh-explains-why-cricket-should-return-only-after-covid-19-is-eradicated/story-7okHJdLw1JTTSzbxY9JJ6L.html", "urlToImage": null, "publishedAt": "2020-04-25T09:34:05Z", "content": "Former India star Yuvraj Singh wants cricket to resume only when the world becomes COVD-19 free as players’ health and safety should be paramount for the custodians of the game.\r\nLike other sports, international and domestic cricket too has been disrupted lea… [+1271 chars]"}, {"source": {"id": null, "name": "Icc-cricket.com"}, "author": "ICC", "title": "Pakistan Women news Sana Mir announces retirement 25 Apr 20 - International Cricket Council", "description": "Sana Mir, the former Pakistan captain and world No.1, has announced her decision to retire from international cricket.", "url": "https://www.icc-cricket.com/news/1660868/sana-mir-announces-retirement", "urlToImage": null, "publishedAt": "2020-04-25T09:22:30Z", "content": "Sana Mir, the former Pakistan captain and world No.1, has announced her decision to retire from international cricket.An ambassador for the sport both within Pakistan and around the world, Mir, 34, has represented Pakistan in 226 internationals since her debu… [+3078 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Wasim Jaffer Reveals the First Thing He Will Do Once the Lockdown is Lifted in India - News18", "description": "The former Indian cricketer took to Twitter and asked fans and followers to list the first thing they would do after the lockdown restrictions were lifted from the country.", "url": "https://www.news18.com/news/buzz/wasim-jaffer-reveals-the-first-thing-he-will-do-once-the-lockdown-is-lifted-in-india-2592255.html", "urlToImage": null, "publishedAt": "2020-04-25T08:54:15Z", "content": "Former India cricketer Wasim Jaffer has revealed the first thing he would do once the nationwide lockdown is lifted amid the coronavirus outbreak.\r\nJaffer said he will take his family out for dinner once the lockdown ends on May 3. After that, he will bat in … [+2086 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Akshat Gaur", "title": "Pat Cummins picks an Indian as the toughest batsman to bowl; terms him as 'pain in the... - The Cricket Times", "description": "Amid Coronavirus pandemic, cricketers are advancing towards social media platforms to engage with their fans and followers. In the process, Australia paceman Pat Cummins participated in an Instagram live Q/A session organised by the Australian Cricketers Asso…", "url": "https://crickettimes.com/2020/04/pat-cummins-picks-an-indian-as-the-toughest-batsman-to-bowl-terms-him-as-pain-in-the-back/", "urlToImage": null, "publishedAt": "2020-04-25T08:50:42Z", "content": "Amid Coronavirus pandemic, cricketers are advancing towards social media platforms to engage with their fans and followers. In the process, Australia paceman Pat Cummins participated in an Instagram live Q/A session organised by the Australian Cricketers Asso… [+1536 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Anushka Sharma’s Small Gesture During Virat Kohli’s Live Chat Leaves Him Blushing, Watch Here - News18", "description": "Virat Kohli was having an Instagram Live session when his wife helped him by turning on the lights of the room.", "url": "https://www.news18.com/news/movies/anushka-sharmas-small-gesture-during-virat-kohlis-live-chat-leaves-him-blushing-watch-here-2592223.html", "urlToImage": null, "publishedAt": "2020-04-25T08:34:28Z", "content": "Lovebirds Anushka Sharma and Virat Kohli are spending the lockdown time together at their home. The duo is having quite fun in their day to day routine, making each day special for each other.\r\nThe Indian cricket team captain recently had a live chat session … [+1684 chars]"}, {"source": {"id": null, "name": "Tennisworldusa.org"}, "author": "Simone Brugnoli", "title": "Novak Djokovic reveals the key behind his supreme mental strength - Tennis World USA", "description": "The Serbian is well-known for being perhaps the toughest player tennis has ever seen in the biggest moments", "url": "https://www.tennisworldusa.org/tennis/news/Novak_Djokovic/86873/novak-djokovic-reveals-the-key-behind-his-supreme-mental-strength/", "urlToImage": null, "publishedAt": "2020-04-25T08:18:25Z", "content": "Novak Djokovic has shown on more than one occasion that he is one of the mentally strongest tennis players in the history of this sport. Just think of the two match points canceled in the 2019 Wimbledon final, when everything now seemed set for Roger Federer'… [+1440 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "ESPNcricinfo staff", "title": "Former Australia allrounder Graeme Watson dies at 75 | ESPNcricinfo.com - ESPNcricinfo", "description": "He played five Tests for Australia in an injury-plagued career | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29096744/former-australia-allrounder-graeme-watson-dies-75", "urlToImage": null, "publishedAt": "2020-04-25T07:59:56Z", "content": "Graeme Watson, the former Australia allrounder who was battling cancer, has died at the age of 75. Primarily a middle-order batsman and a medium-pace bowler, he played five Tests from 1967 to 1972 and two ODIs in 1972.\r\nAfter starting his domestic career at V… [+1316 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Saketh Kandadai", "title": "“It Was Not an Easy Night”: Steve Kerr Narrates a Hilarious Betting Story of Michael Jordan From Their College Days - Essentially Sports", "description": "Golden State Warriors coach Steve Kerr revealed a funny betting story with his former Chicago Bulls teammate Michael Jordan.", "url": "https://www.essentiallysports.com/nba-news-chicago-bulls-it-was-not-an-easy-night-steve-kerr-narrates-a-hilarious-betting-story-of-michael-jordan-from-their-college-days/", "urlToImage": null, "publishedAt": "2020-04-25T07:25:11Z", "content": "Golden State Warriors coach Steve Kerr revealed a funny betting story with his former teammate Michael Jordan.\r\nIt was during a game when Kerr was playing for the University of Arizona while Jordan was at the University of North Carolina. Kerr’s Wildcats defe… [+2070 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'It was easy to recruit for Chelsea' - How Mourinho helped attract Abraham & Mount to Stamford Bridge - Goal India", "description": "If the Bundesliga season got back underway tomorrow, RB Leipzig would be ready - according to U.S. national team midfielder Tyler Adams.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T07:00:00Z", "content": "More"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Arjun Athreya", "title": "Steph Curry Challenges Dwyane Wade to Settle the Debate of the Best Trio in an Amusing Way - Essentially Sports", "description": "Steph Curry joined Miami Heat legend Dwyane Wade on Instragram live recently. The pair had a friendly banter over the best trio in the NBA.", "url": "https://www.essentiallysports.com/nba-news-steph-curry-challenges-dwyane-wade-to-settle-the-debate-of-the-best-trio-in-an-amusing-way-golden-state-warriors-miami-heat/", "urlToImage": null, "publishedAt": "2020-04-25T06:34:00Z", "content": "Two greats of the game, Dwyane Wade and Steph Curry, connected with each other on an Instagram live video chat, recently. Partnered with their spouses, Wade and Curry spoke about a variety of topics and indulged in a cook-off challenge.\r\nAt one point during t… [+1965 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sabi Hussain", "title": "Severely ill Limba Ram struggling for treatment - Times of India", "description": "More sports News: The nationwide lockdown due to the spread of Covid-19 pandemic has affected people from all walks of life, especially patients with critical illness w", "url": "https://timesofindia.indiatimes.com/sports/more-sports/others/severely-ill-limba-ram-struggling-for-treatment/articleshow/75368043.cms", "urlToImage": null, "publishedAt": "2020-04-25T06:32:55Z", "content": null}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "Rohaan1997", "title": "Chelsea ‘direct contacts’ for Dries Mertens - We Ain't Got No History", "description": "Never-ending links!", "url": "https://weaintgotnohistory.sbnation.com/chelsea-fc-transfer-rumours-news/2020/4/25/21235807/chelsea-direct-contacts-for-dries-mertens-reports", "urlToImage": null, "publishedAt": "2020-04-25T06:16:28Z", "content": "Despite Chelsea reportedly agreeing a one-year extension with Olivier Giroud, the veteran strikers future is hardly certain, with the move (if true) largely seen as Chelsea ensuring that we dont lose him for free in the summer.\r\nIn the meantime, Chelsea conti… [+1274 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "West Indies postpone three-Test tour of England due to COVID-19 - Hindustan Times", "description": "The decision to postpone the tour, taken by the Cricket West Indies, came as a result of the uncertainty for the safe resumption of cricket in the United Kingdom, as well as international air travel.", "url": "https://www.hindustantimes.com/cricket/west-indies-postpone-three-test-tour-of-england-due-to-covid-19/story-ikmGdEwLpukQTNOTydenFJ.html", "urlToImage": null, "publishedAt": "2020-04-25T05:42:48Z", "content": "The three-Test series between West Indies and England, slated to be held in June, has been postponed due to the novel coronavirus outbreak. Both the teams were scheduled to play first Test from June 4-8 at The Oval, second Test from June 12-16 at Edgbaston an… [+1224 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Akshat Gaur", "title": "Prithvi Shaw names his favourite opening... - The Cricket Times", "description": "The lockdown was extended in India to May 3 after seeing the rise in Coronavirus affected patients. Amid the lockdown, many cricketers have rolled over towards social media to interact with their fans and followers. Not so long ago, cricketers like Virat Kohl…", "url": "https://crickettimes.com/2020/04/prithvi-shaw-names-his-favourite-opening-partner/", "urlToImage": null, "publishedAt": "2020-04-25T04:41:49Z", "content": "The lockdown was extended in India to May 3 after seeing the rise in Coronavirus affected patients. Amid the lockdown, many cricketers have rolled over towards social media to interact with their fans and followers. Not so long ago, cricketers like Virat Kohl… [+1500 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "No to saliva, yes to shine: Ball-tampering laws in cricket may change - Times of India", "description": "Cricket News: Cricket may change ball-tampering laws and approve external method to help polish the red cherry in proposed post-corona measures. The matter of saliv", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/no-to-saliva-yes-to-shine-ball-tampering-laws-in-cricket-may-change/articleshow/75367490.cms", "urlToImage": null, "publishedAt": "2020-04-25T04:40:29Z", "content": "NEW DELHI: The coronavirus pandemic may force cricket's world governing body to tweak one of its oldest rules and approve the use of an artificial substance to help shine the ball, effectively legalizing what has for long been a core tenet of the sport's anti… [+4836 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Barcelona not in the process of signing Neymar or Lautaro, claims La Liga chief Tebas - Goal India", "description": "If the Bundesliga season got back underway tomorrow, RB Leipzig would be ready - according to U.S. national team midfielder Tyler Adams.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T03:45:00Z", "content": "More"}, {"source": {"id": null, "name": "Thesportreview.com"}, "author": "Transfer Agent", "title": "Man United have plan to accommodate Jack Grealish in their line-up – report - The Sport Review", "description": "Manchester United will deploy Jack Grealish as a right winger if they sign him from Aston Villa this summer, according to reports. The Athletic, as quoted", "url": "https://www.thesportreview.com/2020/04/man-united-news-jack-grealish-report/", "urlToImage": null, "publishedAt": "2020-04-25T03:30:00Z", "content": "Manchester United will deploy Jack Grealish as a right winger if they sign him from Aston Villa this summer, according to reports.\r\nThe Athletic, as quoted by the Birmingham Mail, is reporting that the Red Devils are already thinking about ways that they can … [+989 chars]"}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "David Pasztor", "title": "Ziyech looking forward to normalcy with Chelsea after abrupt end with Ajax - We Ain't Got No History", "description": "Chelsea’s new signing reflects on a most strange end to his Ajax career, and the big step ahead of him", "url": "https://weaintgotnohistory.sbnation.com/2020/4/25/21235599/ziyech-looking-forward-to-normalcy-with-chelsea-after-abrupt-end-with-ajax", "urlToImage": null, "publishedAt": "2020-04-25T03:15:22Z", "content": "This is not how Hakim Ziyech planned to say goodbye. On March 7, with his team leading 3-1 in the 68th minute, he saw his number go up on the substitution board. On came 17-year-old Ryan Gravenberch, and off went Ziyech for, as it turns out, the last time as … [+3911 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "FIDE Chess.com Online Nations Cup: Teams Revealed - India Gone Viral", "description": "The line-ups for the six teams that will play the FIDE Chess.com Nations Cup have been revealed. There are big stars among both the team captains and players. The FIDE Chess.com Online Nations Cup is", "url": "https://indiagoneviral.com/sports/2020/04/25/fide-chess-com-online-nations-cup-teams-revealed/41810/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T01:58:01Z", "content": "The line-ups for the six teams that will play the FIDE Chess.com Nations Cup have been revealed. There are big stars among both the team captains and players.\r\nThe FIDE Chess.com Online Nations Cup is a team competition held from May 5-10, 2020 on Chess.com f… [+8388 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Transfer news and rumours LIVE: Chelsea launch Mertens bid - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T01:50:00Z", "content": "More"}, {"source": {"id": null, "name": "Chessbase.com"}, "author": "", "title": "Magnus Carlsen Invitational: Carlsen and Caruana score convincing wins - Chessbase News", "description": "World numbers one and two, Magnus Carlsen and Fabiano Caruana, won their round-four matches without needing tiebreaks, thus collecting three points each. Carlsen has won all his confrontations so far and is the clear leader with eleven points. He defeated Max…", "url": "https://en.chessbase.com/post/magnus-carlsen-invitational-2020-r4-a", "urlToImage": null, "publishedAt": "2020-04-25T00:34:12Z", "content": "4/25/2020 – World numbers one and two, Magnus Carlsen and Fabiano Caruana, won their round-four matches without needing tiebreaks, thus collecting three points each. Carlsen has won all his confrontations so far and is the clear leader with eleven points. He … [+5679 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Manchester City star Raheem Sterling admits he wants to own shirt from Barcelona star Lionel Messi - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T22:53:08Z", "content": "More"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Kho kho captain strikes gold, lands in penury - Times of India", "description": "The Covid-19 pandemic brought despair for Nasreen and her family. She landed a contractual job with Airports Authority of India (AAI) last year, but s", "url": "https://timesofindia.indiatimes.com/city/delhi/kho-kho-captain-strikes-gold-lands-in-penury/articleshow/75362916.cms", "urlToImage": null, "publishedAt": "2020-04-24T22:04:42Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Liverpool city council to investigate Atletico Madrid match over potential Covid-19 impact - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T21:20:38Z", "content": "More"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Adnan Riaz", "title": "Ronaldo And Ronaldinho Finally Answer GOAT Debate Between Lionel Messi And Cristiano Ronaldo - SPORTbible", "description": "Ronaldinho and Ronaldo praised Lionel Messi and Cristiano Ronaldo, but they both chose the same player in the footballing GOAT debate.", "url": "https://www.sportbible.com/football/news-rivalries-ronaldo-and-ronaldinho-answer-goat-debate-between-messi-and-cristiano-20200424", "urlToImage": null, "publishedAt": "2020-04-24T18:53:18Z", "content": "Brazilian legends Ronaldinho and Ronaldo revealed that they would choose Lionel Messi ahead of Cristiano Ronaldo as the 'GOAT of football.'\r\nMessi and Ronaldo's status as two of the best players in the history of the sport has led to many debating who is the … [+1624 chars]"}, {"source": {"id": null, "name": "Atptour.com"}, "author": null, "title": "Virtual Blockbuster! Rafael Nadal & Andy Murray In Same Group In Mutua Madrid Open Virtual Pro - ATP Tour", "description": "The draw for the Mutua Madrid Open Virtual Pro has been made, and although the action will be played in a video game, there is a round-robin blockbuster that jumps off the page. Five-time Madrid champion Rafael Nadal is joined by another former World No. 1, A…", "url": "https://www.atptour.com/en/news/mutua-madrid-open-virtual-pro-2020-draw", "urlToImage": null, "publishedAt": "2020-04-24T18:30:30Z", "content": "The draw for the Mutua Madrid Open Virtual Pro has been made, and although the action will be played in a video game, there is a round-robin blockbuster that jumps off the page.\r\nFive-time Madrid champion Rafael Nadal is joined by another former World No. 1, … [+3125 chars]"}, {"source": {"id": null, "name": "Football-espana.net"}, "author": "Colin Millar", "title": "La Liga president Tebas confirms promotion and relegation if 'season is not completed' - Football Espana", "description": "La Liga president Javier Tebas has said that in the event of the 2019/20 campaign not being concluded, there would be promotion and relegation in place. There are growing fears that the 2019/20 campaign will not be completed due to the indefinite suspension o…", "url": "https://www.football-espana.net/2020/04/24/la-liga-president-tebas-confirms-promotion-and-relegation-if-season-is-not-completed", "urlToImage": null, "publishedAt": "2020-04-24T17:01:00Z", "content": "La Liga president Javier Tebas has said that in the event of the 2019/20 campaign not being concluded, there would be promotion and relegation in place.\r\nThere are growing fears that the 2019/20 campaign will not be completed due to the indefinite suspension … [+1091 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Ibrahimovic slams 'kindergarten-level' vandals who attacked AC Milan forward's statue in Malmo - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T16:14:00Z", "content": "More"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Ajax denied title as Eredivisie ends season without promotion and relegation - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T15:34:00Z", "content": "More"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": "", "title": "‘I was so embarrassed that I never sledged him again’ – Saqlain Mushtaq recalls a sledging duel against Sachin Tendulkar in 1997 - CricTracker", "description": "Saqlain Mushtaq also revealed that Sachin Tendulkar was probably the best when it came to reading his 'doosra' while noticing his fingers.", "url": "https://www.crictracker.com/i-was-so-embarrassed-that-i-never-sledged-him-again-saqlain-mushtaq-recalls-a-sledging-duel-against-sachin-tendulkar-in-1997/", "urlToImage": null, "publishedAt": "2020-04-24T15:25:40Z", "content": "Saqlain Mushtaq and Sachin Tendulkar. (Photo Source: Twitter)\r\nSachin Tendulkar is regarded as one of the most successful cricketers to have braced the game. Impeccable technique and gritty on-field temperament– the Master Blaster started hogging the headline… [+2445 chars]"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Barca Blaugranes Staff", "title": "Bayern announce Philippe Coutinho has undergone ankle surgery - Barca Blaugranes", "description": "The Barcelona loanee has gone under the knife", "url": "https://www.barcablaugranes.com/2020/4/24/21234464/philippe-coutinho-undergoes-successful-ankle-surgery", "urlToImage": null, "publishedAt": "2020-04-24T15:07:34Z", "content": "Bayern Munich have announced that Philippe Coutinho has undergone ankle surgery and will be sidelined for a couple of weeks before beginning his recovery.\r\nThe Brazilian, who is on a season-long loan from Barcelona, went under the knife during which loose joi… [+601 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Keane sees 'long way back' for Man Utd & remains unconvinced by Shaw - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T14:54:00Z", "content": "More"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Lucky to get team management's backing after injuries: Bhuvneshwar Kumar - Times of India", "description": "Cricket News: It is tough to make a comeback after a lengthy injury layoff but the team management's support makes the job easier, says right-arm medium pacer Bhuvn", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/lucky-to-get-team-managements-backing-after-injuries-bhuvneshwar-kumar/articleshow/75352116.cms", "urlToImage": null, "publishedAt": "2020-04-24T14:14:00Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Rohit Sharma picks his top 5 India batsmen of all time - Hindustan Times", "description": "Sourav Ganguly, Sachin Tendulkar, Rahul Dravid, VVS Laxman and Virender Sehwag all made the list but Rohit included the caveat that these are the players that he has seen in action.", "url": "https://www.hindustantimes.com/cricket/rohit-sharma-picks-his-top-5-india-batsmen-of-all-time/story-kPLmdYWE0Bb4VrtVrA1DOP.html", "urlToImage": null, "publishedAt": "2020-04-24T14:10:00Z", "content": "Indian cricket team batsman Rohit Sharma was asked to pick the top five India batsman and he decided to include five modern legends in his name. Sourav Ganguly, Sachin Tendulkar, Rahul Dravid, VVS Laxman and Virender Sehwag all made the list but Rohit include… [+1908 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "James Olley", "title": "Chelsea want Arsenal's Aubameyang as alternative to Werner, Dembele - sources - ESPN India", "description": "Chelsea are monitoring Pierre-Emerick Aubameyang's contract situation at Arsenal with a view to making a move this summer, sources have told ESPN.", "url": "https://www.espn.in/football/soccer-transfers/story/4088766/chelsea-want-arsenals-aubameyang-as-alternative-to-wernerdembele-sources", "urlToImage": null, "publishedAt": "2020-04-24T14:04:26Z", "content": "Chelsea are closely monitoring Pierre-Emerick Aubameyang's contract situation at Arsenal with a view to making a move this summer, sources have told ESPN.\r\n-Stream new episodes of ESPN FC Monday-Friday on ESPN+- Stream every episode of 30 for 30: Soccer Stori… [+3918 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "Susan Ninan", "title": "Check, mates: Yuzvendra Chahal and Viswanathan Anand talk chess, cricket and more | ESPNcricinfo.com - ESPNcricinfo.com", "description": "Chess-enthusiast-turned-cricketer Yuzvendra Chahal strikes up a conversation with India's ultimate grandmaster. | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29048934/check-mates-yuzvendra-chahal-viswanathan-anand-talk-chess-cricket-more", "urlToImage": null, "publishedAt": "2020-04-24T14:03:45Z", "content": "They are stars but move in different orbits; their success means they share a lot of traits but don't often get to chat about them, especially for the benefit of sports fans. We brought together Viswanathan Anand - India's greatest chess player - and Yuzvendr… [+6217 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'Mane has been the total package' - De Bruyne names Liverpool forward as his player of the season - Goal India", "description": "If the Bundesliga season got back underway tomorrow, RB Leipzig would be ready - according to U.S. national team midfielder Tyler Adams.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T13:12:00Z", "content": "More"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Pornographic images pop-up as top badminton coaches left red-faced during online training session - India Today", "description": "An online training session held by Sports Authority of India (SAI) and Badminton Association of India (BAI) was abruptly ended of Thursday after pornographic images popped up on the screens.", "url": "https://www.indiatoday.in/sports/badminton/story/pornographic-images-bai-sai-online-training-session-pullela-gopichand-coach-badminton-zoom-videoconferencing-app-coronavirus-pandemic-1670627-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T12:13:35Z", "content": "The online training session held by Sports Authority of India (SAI) and Badminton Association of India (BAI) found itself in an unwanted situation after pornographic images suddenly flashed on the screens of 700-plus coaches across the country on Thursday.\r\nT… [+2211 chars]"}, {"source": {"id": null, "name": "Sportscafe.in"}, "author": "SportsCafe Desk", "title": "Reports | Post COVID-19, ICC might legalise ball tampering to compensate for no saliva use - SportsCafe", "description": "As Coronavirus outbreak created a ripple around the world of cricket, the ICC is contemplating to legalise ball tampering to compensate for no saliva use in the immediate aftermath of the sport. If that happens, one of the greatest taboos of the sport will fo…", "url": "https://sportscafe.in/cricket/articles/2020/apr/24/post-covid-19-icc-might-allow-ball-tampering-to-compensate-for-no-saliva-use", "urlToImage": null, "publishedAt": "2020-04-24T11:59:12Z", "content": "As Coronavirus outbreak created a ripple around the world of cricket, the ICC is contemplating to legalise ball tampering to compensate for no saliva use in the immediate aftermath of the sport. If that happens, one of the greatest taboos of the sport will fo… [+1635 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "Rob Dawson", "title": "Man United boss Solskjaer needs backing from board after surviving bad times Rafael - ESPN India", "description": "Rafael has told ESPN that Manchester United boss Ole Gunnar Solskjaer needs backing from the board after surviving \"bad times\" at Old Trafford.", "url": "https://www.espn.in/football/manchester-united/story/4088671/man-united-boss-solskjaer-needs-backing-from-board-after-surviving-bad-times-rafael", "urlToImage": null, "publishedAt": "2020-04-24T11:37:11Z", "content": "Former Manchester United defender Rafael has told ESPN that Ole Gunnar Solskjaer is the right man to lead the club but said he needs backing from the board after surviving \"bad times\" at Old Trafford.\r\nThe Brazilian, now at Lyon, worked with Solskjaer during … [+2006 chars]"}, {"source": {"id": null, "name": "Icc-cricket.com"}, "author": "ICC", "title": "Live cricket resumes this weekend in Vanuatu - International Cricket Council", "description": "Live cricket action returns this weekend in Vanuatu, with many of the country's best players in action – and doing so for a good cause.", "url": "https://www.icc-cricket.com/news/1660447/live-cricket-resumes-this-weekend-in-vanuatu", "urlToImage": null, "publishedAt": "2020-04-24T10:48:55Z", "content": "Live cricket action returns this weekend in Vanuatu, with many of the country's best players in action and doing so for a good cause.COVID-19 has brought live sports to a grinding halt globally even as governments and frontline workers strive to fight the pan… [+2666 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘He was a nightmare’: James Anderson, Stuart Broad name toughest batsman to bowl at - Hindustan Times", "description": "When asked about which batsman was the toughest to bowl against in their career, both had the same answer, former South Africa opener and captain Graeme Smith.", "url": "https://www.hindustantimes.com/cricket/he-was-a-nightmare-james-anderson-stuart-broad-name-toughest-batsman-to-bowl-at/story-QL2mlt84USC8Ay8K9e1g8O.html", "urlToImage": null, "publishedAt": "2020-04-24T09:28:05Z", "content": "James Anderson and Stuart Broad together form one of the most successful new ball duos in Test cricket. Both have bowled in tandem and wreaked havoc on touring batsmen in the helpful English conditions for many years now. Anderson has a record 584 wickets to … [+1507 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Rob Hoskin", "title": "Liverpool set to be crowned 2019/20 champions after UEFA effectively remove 'null and void' - GIVEMESPORT", "description": "Liverpool set to be crowned 2019/20 champions after UEFA effectively remove 'null and void'", "url": "https://www.givemesport.com/1564557-liverpool-set-to-be-crowned-201920-champions-after-uefa-effectively-remove-null-and-void", "urlToImage": null, "publishedAt": "2020-04-24T07:02:19Z", "content": "If at the start of March you’d have told any Liverpool fan they wouldn’t have won the Premier League title by now, they’d never have believed you.\r\nIt was just a matter of time before Jurgen Klopp's side were crowned champions in sensational style, winning 27… [+1657 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "Middlesex opt to furlough players and staff - Cricbuzz - Cricbuzz", "description": "The club has also announced pay cuts across spectrum with the senior management taking the biggest cut", "url": "https://www.cricbuzz.com/cricket-news/112921/middlesex-opt-to-furlough-players-and-staff", "urlToImage": null, "publishedAt": "2020-04-24T04:57:09Z", "content": "A general view outside Lord's Cricket Ground, home of Middlesex County Cricket Club © Getty\r\nMiddlesex, the 2016 County Championship winners, have announced the decision to furlough players and most of their operating staff (including administrative and suppo… [+2889 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "Nagraj Gollapudi, Osman Samiuddin", "title": "BCCI suggests deferring World Test Championship | ESPNcricinfo.com - ESPNcricinfo", "description": "Men's T20 World Cup remains on course for now, but ICC members agree to review situation regularly | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29088129/bcci-suggests-deferring-world-test-championship", "urlToImage": null, "publishedAt": "2020-04-24T01:58:21Z", "content": "The BCCI has suggested the World Test Championship (WTC) be postponed as the cricket world grapples with a calendar vastly disrupted by the ongoing Covid-19 pandemic. India sits atop the WTC points table currently, in prime position to qualify for the final, … [+4175 chars]"}, {"source": {"id": null, "name": "Talkesport.com"}, "author": null, "title": "Fnatic players \"reminded of their obligations\" following growing misconduct in PUBGM roster - TalkEsport", "description": "In an official statement, Fnatic PUBG Mobile talked about their vision as a brand, how they want to standout from the rest and accepted about the fact that everything is not right between the players in the roster!", "url": "https://www.talkesport.com/news/fnatic-players-reminded-of-their-obligations-following-growing-misconduct-in-pubgm-roster/", "urlToImage": null, "publishedAt": "2020-04-23T18:12:00Z", "content": "Fnatic PUBG Mobile recently posted an official statement on their Instagram handle where they acknowledged that everything is not okay among the members of their PUBG Mobile roster. Heres what all they had to say in their official statement:\r\n View this post … [+2802 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Harbhajan Singh points out differences between Mumbai Indians and Chennai Super Kings - Hindustan Times", "description": "Harbhajan Singh has won the tournament with both the teams and he pointed out the differences in approach when it comes to the two sides.", "url": "https://www.hindustantimes.com/cricket/harbhajan-singh-points-out-differences-between-mumbai-indians-and-chennai-super-kings/story-FvFBGZlIqmwZmafXTozD1M.html", "urlToImage": null, "publishedAt": "2020-04-23T16:13:37Z", "content": "Senior India spinner Harbhajan Singh has been a part of the Indian Premier League (IPL) since its inception and he has played for both Chennai Super Kings and Mumbai Indians - the two most successful sides in the tournament. When MI have won the tournament fo… [+1589 chars]"}]}