{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Conte wouldn't last a season at Real Madrid, says Diego Costa - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T21:35:00Z", "content": "More"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'My biggest mistake was joining Inter – I could've gone to Madrid, Barca or Man Utd' - Pancev regrets Italy move - Goal India", "description": "Antonio Conte may have won league titles in Italy and England, but the Inter coach would not last a season in charge of Real Madrid, according to Diego Costa.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T18:54:24Z", "content": "More"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Romain Grosjean Reveals an Insider Analysis of Kimi Raikkonen and Fernando Alonso as Teammates - India Gone Viral", "description": "From the outset, Kimi Raikkonen and Fernando Alonso are exact opposites. The Finn seems cold, while the Spanish is a passionate driver. However, Romain Grosjean offers a striking perspective on both.", "url": "https://indiagoneviral.com/sports/2020/04/25/romain-grosjean-reveals-an-insider-analysis-of-kimi-raikkonen-and-fernando-alonso-as-teammates/42331/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T18:06:41Z", "content": "From the outset, Kimi Raikkonen and Fernando Alonso are exact opposites. The Finn seems cold, while the Spanish is a passionate driver. However, Romain Grosjean offers a striking perspective on both. He accepts the two are surprisingly the same somehow or ano… [+2002 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "West Indies ‘flexible’ over England tour as ECB weigh overseas offers - Hindustan Times", "description": "CWI chief executive Johnny Grave insisted while the West Indies were open to a change of dates, player safety remained the priority.", "url": "https://www.hindustantimes.com/cricket/west-indies-flexible-over-england-tour-as-ecb-weigh-overseas-offers/story-wpJLafjIXTVJmWL2a42NOO.html", "urlToImage": null, "publishedAt": "2020-04-25T17:48:48Z", "content": "Cricket West Indies have said they are “flexible” about rearranging their tour of England but will not risk their players’ health just to complete a three-Test series.\r\n The fixtures were all due to take place in June but Friday saw the England and Wales Cric… [+1969 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "MS Dhoni's career graph kept going up and mine down but friendship remained intact: RP Singh - India Today", "description": "Former India pacer RP Singh told that he himself wonders what happened to his career and how he lost his place from the all the formats of the game.", "url": "https://www.indiatoday.in/sports/cricket/story/rp-singh-says-ms-dhoni-s-graph-kept-going-up-and-his-down-friendship-intact-cricket-ipl-t20-world-cup-1671112-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T17:42:04Z", "content": "India's T20 World Cup-winning pacer RP Singh, who was once seen as the bright replacement of legendary left-arm pacer Zaheer Khan, has revealed that he himself had no answer as in why his career was cut short early.\r\nWhile in a conversation with former India … [+1618 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "ESPNcricinfo staff", "title": "Sana Mir retires from international cricket | ESPNcricinfo.com - ESPNcricinfo", "description": "Mir, who made her debut in 2005, took 151 wickets in 120 ODIs and 89 wickets in 106 T20Is | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29097056/sana-mir-retires-international-cricket", "urlToImage": null, "publishedAt": "2020-04-25T17:03:37Z", "content": "Sana Mir, arguably the greatest woman cricketer Pakistan has produced, has announced her retirement from international cricket, bringing an end to a 15-year career. Mir, who made her international debut in 2005, took 151 wickets at an average of 24.27 in 120 … [+2839 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Trends Desk", "title": "Nurse runs solo marathon amid Covid-19, maps ‘Boston strong’ with spelling error - The Indian Express", "description": "Lindsey Devers ran 26.2 miles through a custom route to spell out \"BOSTON STRONG\" and realised she misspelt it to “Boston Strog” when it was too late to start over.", "url": "https://indianexpress.com/article/trending/trending-globally/boston-nurse-boston-marathon-coronavirus-lockdown-covid-19-6378825/", "urlToImage": null, "publishedAt": "2020-04-25T17:01:32Z", "content": "By: Trends Desk | New Delhi | \r\nUpdated: April 25, 2020 10:29:57 pm\r\nDespite hilariously omitting the very important N in her cheer for her city, Lindsay Dever received heaps of praise online for her solo marathon attempt.A nurse in Massachusetts was supposed… [+3496 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘Since then I stay away from coffee,’ Hardik Pandya opens up on the ‘Koffee with Karan’ controversy - Hindustan Times", "description": "Hardik said on a lighter note that one cup of coffee proved very costly for him, referring to his controversial remark on TV show ‘Koffee With Karan’, which created a furore.", "url": "https://www.hindustantimes.com/cricket/since-then-i-stay-away-from-coffee-hardik-pandya-opens-up-on-the-koffee-with-karan-controversy/story-IBXLQ15vwDdElLh6IlC5hM.html", "urlToImage": null, "publishedAt": "2020-04-25T16:55:00Z", "content": "India all-rounder Hardik Pandya opened up for the first time on the Koffee With Karan episode that almost pushed his and teammate KL Rahul’s professional cricketing career on the brink. \r\nDuring an Instagram chat with Dinesh Karthik, Hardik also said on a lig… [+1207 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Akshat Gaur", "title": "Saqlain Mushtaq reveals the incident after which he never sledged Sachin... - The Cricket Times", "description": "Just a few hours down the line, Sachin Tendulkar turned 47, but due to the coronavirus pandemic, he didn't celebrate his birthday. However, his fans across the globe recalled the famous India versus Australia ODI game held at Sharjah when the cricketing world…", "url": "https://crickettimes.com/2020/04/saqlain-mushtaq-reveals-the-incident-after-which-he-never-sledged-sachin-tendulkar/", "urlToImage": null, "publishedAt": "2020-04-25T16:45:45Z", "content": "Just a few hours down the line, Sachin Tendulkar turned 47, but due to the coronavirus pandemic, he didn’t celebrate his birthday. However, his fans across the globe recalled the famous India versus Australia ODI game held at Sharjah when the cricketing world… [+2392 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Have gone mad searching for it: Jofra Archer reveals he has lost his World Cup 2019 medal - India Today", "description": "England fast bowler Jofra Archer said he has been searching for his World Cup medal at his new place over the last week without much success.", "url": "https://www.indiatoday.in/sports/cricket/story/jofra-archer-world-cup-2019-medal-lost-searching-new-flat-super-over-final-1671093-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T16:38:48Z", "content": "England fast bowler Jofra Archer said he misplaced his World Cup 2019 medal after he shifted his flat recently. Archer, who played a key role in England's historic triumph, added he has 'gone mad' searching for it at his new place.\r\nJofra Archer revealed he h… [+1644 chars]"}, {"source": {"id": null, "name": "Dawn.com"}, "author": "AFP", "title": "Chelsea opt against pay cut, tell players to donate to charity - DAWN.com", "description": "Newcastle and Norwich are currently the only two Premier League clubs using the furlough for some of their staff.", "url": "https://www.dawn.com/news/1552184", "urlToImage": null, "publishedAt": "2020-04-25T16:22:22Z", "content": "English Premier League side Chelsea have said they won't impose a pay cut on their first-team squad in response to the coronavirus outbreak.\r\nBut the club added on Saturday they had asked players to continue donating to charities during the ongoing pandemic.\r… [+2170 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "https://www.facebook.com/mrinal.kuniyal", "title": "Mclaren F1 Denies Receiving Any Aid From Liberty Media - Essentially Sports", "description": "McLaren F1 has denied receiving any payment from Liberty Media. Zak Brown says that the Formula 1 owners are offering assistance to 'certain teams'.", "url": "https://www.essentiallysports.com/f1-news-liberty-media-not-paying-mclaren-f1-any-money/", "urlToImage": null, "publishedAt": "2020-04-25T15:19:00Z", "content": "McLaren F1 has denied receiving any payment from Liberty Media. Team boss Zak Brown says that the Formula 1 owners are offering assistance to ‘certain teams’.\r\nMcLaren, CEO Zak Brown was talking to Motorsport-Total.com. He said, “We have not received any adva… [+1473 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Anirudh Singh", "title": "Actress Nidhhi Agerwal clears the air about unfollowing KL Rahul on social... - The Cricket Times", "description": "Cricketers link-up with Bollywood actresses is very commonly seen days. Even though Virat Kohli and Anushka Sharma are right now termed as the 'power couple', there is much more to that. There have been many other successful couples and sad breakups seen by c…", "url": "https://crickettimes.com/2020/04/nidhhi-agerwal-clears-the-air-about-unfollowing-kl-rahul-on-social-media/", "urlToImage": null, "publishedAt": "2020-04-25T15:03:35Z", "content": "Cricketers link-up with Bollywood actresses is very commonly seen days. Even though Virat Kohli and Anushka Sharma are right now termed as the ‘power couple’, there is much more to that.\r\nThere have been many other successful couples and sad breakups seen by … [+1428 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "ESPNcricinfo staff", "title": "Former Australia allrounder Graeme Watson dies at 75 | ESPNcricinfo.com - ESPNcricinfo", "description": "He played five Tests for Australia in an injury-plagued career | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29096744/former-australia-allrounder-graeme-watson-dies-75", "urlToImage": null, "publishedAt": "2020-04-25T15:03:25Z", "content": "Graeme Watson, the former Australia allrounder who was battling cancer, has died at the age of 75. Primarily a middle-order batsman and a medium-pace bowler, he played five Tests from 1967 to 1972 and two ODIs in 1972.\r\nAfter starting his domestic career at V… [+1316 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Vinayak Manoj", "title": "“I Would Do it For the Winner of Anthony Joshua and Tyson Fury”- Former Champion Hints Boxing Return - Essentially Sports", "description": "David Haye revealed he is willing to make a return to the boxing ring to fight the next heavyweight champion, Tyson Fury or Anthony Joshua", "url": "https://www.essentiallysports.com/boxing-news-i-would-do-it-for-the-winner-of-anthony-joshua-and-tyson-fury-former-champion-hints-boxing-return/", "urlToImage": null, "publishedAt": "2020-04-25T15:02:00Z", "content": "Having ducked out of professional boxing back in 2018. ‘Hayemaker’ David Haye is seemingly thinking of making a return to the ring. However, he only wants to take on the best of the best, which is either Tyson Fury or Anthony Joshua.\r\nThe Londoner took up ret… [+2410 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Gambhir, Akram had big influence on me at KKR: Kuldeep - Hindustan Times", "description": "Kuldeep says that Gambhir continues to talk to him even after the end of the latter’s stint at KKR and his playing career itself.", "url": "https://www.hindustantimes.com/cricket/gambhir-akram-had-big-influence-on-me-at-kkr-kuldeep/story-s71gC0msbyMC3lgxHBY2yM.html", "urlToImage": null, "publishedAt": "2020-04-25T14:49:16Z", "content": "Indian sinner Kuldeep Yadav spoke about the influence that Gautam Gambhir and Wasim Akram had on him in his early days at the Kolkata Knight Riders. Kuldeep said that Gambhir, who captained KKR to two titles in 2012 and 2014, gave him confidence by assuring h… [+2136 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "Kane Williamson relives emotions of World Cup 2019 final loss - Cricbuzz - Cricbuzz", "description": "New Zealand captain stressed he was proud of the way his players adapted throughout the tournament to different conditions", "url": "https://www.cricbuzz.com/cricket-news/112930/kane-williamson-relives-emotions-of-world-cup-2019-final-loss", "urlToImage": null, "publishedAt": "2020-04-25T13:54:23Z", "content": "\"I think the thing we can reflect upon and be proud of the way we played the entire tournament.\" © Getty\r\nThere is a certain wave of calmness about Kane Williamson. On or off the cricket field, the New Zealand skipper is known for his composed approach and on… [+3431 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "How a chat with Ravi Shastri helped Sachin Tendulkar after his Test debut against Pakistan - India Today", "description": "Sachin Tendulkar revealed Ravi Shastri had told him that he played against Pakistan in his Test debut like a 'school match'.", "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkar-reveals-chat-ravi-shastri-test-debut-pakistan-1671050-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T13:35:46Z", "content": "Sachin Tendulkar says he was \"clueless\" on his Test debut and almost cried thinking it was all over for him.\r\nWhen he walked out for the last time 24 years later, Tendulkar would do so as a batting great with a record 200 Test appearances to his name.\r\n\"I was… [+2436 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "COVID-19: James Anderson to raise funds by auctioning shirt, bat and wicket - Hindustan Times", "description": "", "url": "https://www.hindustantimes.com/cricket/covid-19-james-anderson-to-raise-funds-by-auctioning-shirt-bat-and-wicket/story-OiuT4s6FUKuDCVLkgn0tgJ.html", "urlToImage": null, "publishedAt": "2020-04-25T13:34:42Z", "content": "London, April 25 (IANS) With the coronavirus outbreak bringing the world to a standstill, sportspersons have tried their best to help the poor and needy and English pacer James Anderson is now set to auction his shirt, bat and a wicket from the last Test that… [+2011 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": null, "title": "Taipei T10 League 2020: Match 6, TCA Indians vs Taiwan Dragons: MyTeam11 Fantasy Cricket Tips – Playing XI, Pitch Report & Injury Update - CricTracker", "description": "Taipei T10 League 2020: MyTeam11 Fantasy Cricket Tips, Playing XIs, Yingfeng Pitch Report & Injury News for Match 6, TCA Indians vs Taiwan Dragons", "url": "https://m.crictracker.com/taipei-t10-league-2020-match-6-tca-indians-vs-taiwan-dragons-myteam11-fantasy-cricket-tips-playing-xi-pitch-report-injury-update/", "urlToImage": null, "publishedAt": "2020-04-25T13:13:30Z", "content": "Cricket Stadium. (Photo by Robert Cianflone/Getty Images)\r\nMatch Details:\r\nThe 6th match of the Taipei T10 League 2020 will be played between TCA Indians and Taiwan Dragons at the Yingfeng Cricket Ground in Songshan District.\r\nThe match starts at 3:30 PM loca… [+3728 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "India Today League PUBG Mobile Invitational Day 3 wrap: TSM ENTITY top table with stunning show on Saturday - India Today", "description": "India Today League PUBG Mobile Invitational: While team SouL made a fine comeback in the final match of Day 3, TSM ENTITY dominated Saturday with their aggressive show to finish on top of the overall standings.", "url": "https://www.indiatoday.in/sports/other-sports/story/itpubl-day-3-round-up-tsm-entity-2-chicken-dinners-soul-comeback-pubg-mobile-invitational-1671028-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T12:59:53Z", "content": "India Today League PUBG Mobile Invitational is headed towards a gripping final day after three days of intense action. TSM ENTITY, one of India's top teams in the PUBG Mobile circuit, will head into the final with a considerable lead on the overall points tab… [+3725 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Too early to talk about playing 5 Tests in Australia: BCCI official - Hindustan Times", "description": "A BCCI official said that a decision on that can be taken at the right time and any planning at this stage would be too early in the wake of the pandemic.", "url": "https://www.hindustantimes.com/cricket/too-early-to-talk-about-playing-5-tests-in-australia-bcci-official/story-7EezwXRXeWtEuIBD0F6cpN.html", "urlToImage": null, "publishedAt": "2020-04-25T12:58:55Z", "content": "The outbreak of the coronavirus has seen the Australian government seal the international boundaries till September 30. But Cricket Australia is not only keen to conduct the T20 World Cup in October, but also have India travel Down Under for the bilateral ser… [+1881 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Akshat Gaur", "title": "Top 5 batsmen with most runs in wins for India across... - The Cricket Times", "description": "India arose as a significant cricket-playing nation after the 1983 World Cup win. However, even before the mega event, Indian batsmen were always on top of their games, it's just as a team, the 1983 WC gave them global limelight. From the likes of CK Nayudu, …", "url": "https://crickettimes.com/2020/04/top-5-batsmen-with-most-runs-in-wins-for-india-across-formats/", "urlToImage": null, "publishedAt": "2020-04-25T12:29:29Z", "content": "India arose as a significant cricket-playing nation after the 1983 World Cup win. However, even before the mega event, Indian batsmen were always on top of their games, it’s just as a team, the 1983 WC gave them global limelight.\r\nFrom the likes of CK Nayudu,… [+4183 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Deepit Sharma", "title": "“He’s One of the Best in the World!”- Dana White Weighs in on Dominick Cruz vs Henry Cejudo - Essentially Sports", "description": "Dominick Cruz will make a much-awaited return to the octagon at UFC 249 on 9 May, and Dana White believes he is just as deserving of a title shot as always.", "url": "https://www.essentiallysports.com/ufc-news-hes-one-of-the-best-in-the-world-dana-white-weighs-in-on-dominick-cruz-vs-henry-cejudo/", "urlToImage": null, "publishedAt": "2020-04-25T12:29:00Z", "content": "Dominick Cruz associates with the UFC and MMA on many levels. His varied roles include appearing as a ringside commentator and a sports analyst at ESPN. However, as a fighter, he last made his appearance in December 2016.\r\nThe 35-year-old is a two-time Bantam… [+1993 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Miscreants attempt to rob stumper Saha's Siliguri home, says relative - Hindustan Times", "description": "Saha, 35, lives in South Kolkata with his wife and children. The experienced stumper’s parents, who live in their Ward No.31 Shaktigarh area house in Siliguri, are at present staying with their son in Kolkata.", "url": "https://www.hindustantimes.com/cricket/miscreants-attempt-to-rob-stumper-saha-s-siliguri-home-says-relative/story-tRusZSKZV1FBBTmYrEWIlO.html", "urlToImage": null, "publishedAt": "2020-04-25T12:04:21Z", "content": "A relative of Wriddhiman Saha has alleged that a few miscreants tried to break into the India Test wicketkeeper’s ancestral home in Siliguri, North Bengal, on Friday in a bungled attempt to rob the place.\r\nSaha, 35, lives in South Kolkata with his wife and ch… [+1344 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "I still wake up to that nightmare of losing 2019 World Cup semi-final match vs New Zealand: KL Rahul - India Today", "description": "Team India batsman KL Rahul said that if given a chance he would change the result of the 2019 World Cup semifinal match against New Zealand.", "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-2019-world-cup-semifinal-lock-hurts-haunts-cricket-covid-19-lockdown-1670997-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T12:03:04Z", "content": "Star India batsman KL Rahul said the heartbreaking World Cup semifinal loss to New Zealand, especially after a near-perfect show in the group stages, continues to haunt him and his teammates.\r\nIn a special chat show, 'The Mind Behind', Rahul said if he was gi… [+1110 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "‘Didn’t want people to say Silver Sindhu,’ Talk of final phobia propelled PV Sindhu to World Championship... - Hindustan Times", "description": "Sindhu, who had already won two silver and two bronze medals at the event, defeated her nemesis Nozomi Okuhara 21-7 21-7 in the summit clash that lasted just 38 minutes on August 26 last year.", "url": "https://www.hindustantimes.com/other-sports/didn-t-want-people-to-say-silver-sindhu-talk-of-final-phobia-propelled-pv-sindhu-to-world-championship-glory/story-9daLENyFdFsDbf4qp35ELI.html", "urlToImage": null, "publishedAt": "2020-04-25T11:59:43Z", "content": "Ace shuttler PV Sindhu, who had created history by becoming the first Indian to win gold medal at the World Championships last year, has revealed that she didnt want people to call her “silver Sindhu” and thats why she was desperate to clinch the top honours … [+1477 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "Legalising ball tampering: Saliva is must and vaseline is no replacement, feel Ashish Nehra, Harbhajan Singh - Hindustan Times", "description": "Former India pacer Ashish Nehra and spinner Harbhajan Singh feel that saliva’s use in shining the ball is a “must”. Ex-opener Aakash Chopra, while beng open to the idea, wants to know where one can draw the line.", "url": "https://www.hindustantimes.com/cricket/legalising-ball-tampering-saliva-is-must-and-vaseline-is-no-replacement-feel-ashish-nehra-harbhajan-singh/story-6sGuYrV3wtqCeH94TJ9N9K.html", "urlToImage": null, "publishedAt": "2020-04-25T11:23:53Z", "content": "Saliva and sweat are components that cannot be entirely done away with, insist a few distinguished India cricketers, as the ICC contemplates legalising ball tampering post COVID-19 by using artificial substances to prevent virus spread. Former India pacer Ash… [+3372 chars]"}, {"source": {"id": null, "name": "Sempreinter.com"}, "author": null, "title": "Chelsea Join Inter In Race To Sign 70M Rated Arsenal Striker Aubameyang - SempreInter", "description": "Chelsea are interested in Inter target Pierre Emerick Aubameyang, according to a report from international broadcaster ESPN earlier today. The report", "url": "https://sempreinter.com/2020/04/25/chelsea-join-inter-in-race-to-sign-70m-rated-arsenal-striker-aubameyang/", "urlToImage": null, "publishedAt": "2020-04-25T11:21:28Z", "content": "Chelsea are interested in Inter target Pierre Emerick Aubameyang, according to a report from international broadcaster ESPN earlier today.\r\nThe report details how the Blues have identified the Gabonese striker as the ideal player to reinforce their attack nex… [+784 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Oliver Browning", "title": "WWE news: The 30 greatest pro wrestlers of all-time have been ranked - GIVEMESPORT", "description": "WWE news: The 30 greatest pro wrestlers of all-time have been ranked", "url": "https://www.givemesport.com/1564783-wwe-news-the-30-greatest-pro-wrestlers-of-alltime-have-been-ranked", "urlToImage": null, "publishedAt": "2020-04-25T10:59:58Z", "content": "There are so many legendary names linked with professional wrestling. \r\nWWE stars like Hulk Hogan, The Undertaker, Andre the Giant and The Rock instantly spring to mind. \r\nThen, of course, there are some that have made a name for themselves outside of America… [+1569 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "‘If You Need Money Then You Should Stop Activities At The Border’: Kapil Dev - Swarajya", "description": "", "url": "https://swarajyamag.com/insta/if-you-need-money-then-you-should-stop-activities-at-the-border-kapil-dev", "urlToImage": null, "publishedAt": "2020-04-25T10:36:52Z", "content": null}, {"source": {"id": null, "name": "Espn.in"}, "author": "ESPN", "title": "Coronavirus: Liverpool vs. Atletico Madrid to be investigated by council - ESPN India", "description": "Liverpool's vs. Atletico Madrid in the Champions League will be investigated regarding any impact it may have had on the spread of coronavirus.", "url": "https://www.espn.in/football/uefa-champions-league/story/4088954/coronavirus-liverpool-vs-atletico-madrid-to-be-investigated-by-council", "urlToImage": null, "publishedAt": "2020-04-25T10:21:19Z", "content": "Liverpool's match with Atletico Madrid in the Champions League on March 11 will be investigated by the city's council regarding any impact it may have had on the spread of coronavirus.\r\n-Stream new episodes of ESPN FC Monday-Friday on ESPN+- Stream every epis… [+2050 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Sancho is nowhere near Aguero, Higuain, Messi & Di Maria - Neville - Goal India", "description": "If the Bundesliga season got back underway tomorrow, RB Leipzig would be ready - according to U.S. national team midfielder Tyler Adams.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T10:18:00Z", "content": "More"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Barca Blaugranes Staff", "title": "FC Barcelona News: 25 April 2020; PSG won’t talk Neymar - Barca Blaugranes", "description": "A round-up of the latest Barcelona news and transfer rumors", "url": "https://www.barcablaugranes.com/2020/4/25/21235862/fc-barcelona-news-25-april-2020-psg-wont-talk-neymar-sterling-wants-messis-shirt", "urlToImage": null, "publishedAt": "2020-04-25T09:49:32Z", "content": "PSG will refuse to negotiate a deal to sell Neymar until September | Sport\r\nPSG are refusing to negotiate Neymars exit currently. The French champions have told the Brazilian they do not want to sell and now is not the time to discuss the future.\r\nNewcastle d… [+1245 chars]"}, {"source": {"id": null, "name": "Juvefc.com"}, "author": "juvefcdotcom", "title": "Cristiano Ronaldo will remain with Juventus - JuveFC", "description": "Cristiano Ronaldo will remain with Juventus until 2022, according to Tuttosport.", "url": "https://www.juvefc.com/cristiano-ronaldo-will-remain-with-juventus/", "urlToImage": null, "publishedAt": "2020-04-25T09:42:58Z", "content": "Cristiano Ronaldo will remain with Juventus until 2022, according to Tuttosport.\r\nThe 34-year-old has been with the Bianconeri for two seasons of his four-year contract after a big money move from Real Madrid in 2018.\r\nReports in Spanish and Italian press hav… [+409 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Arjun Athreya", "title": "Three Things We Want To See From the Kobe Bryant Documentary - Essentially Sports", "description": "Kobe Bryant spent 20 years with the Los Angeles Lakers. It has now been confirmed that his last season was being completely documented by a film crew.", "url": "https://www.essentiallysports.com/nba-news-three-things-we-want-to-see-from-the-kobe-bryant-documentary/", "urlToImage": null, "publishedAt": "2020-04-25T09:40:00Z", "content": "The Last Dance, a ten-part documentary on Michael Jordans final season with the Chicago Bulls was released recently. Ever since the series claimed a massive following, fans have been chirping for a similar documentary to be made on the legacy of the late Kobe… [+5764 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "‘You don’t want the fear,’ Yuvraj Singh explains why cricket should return only after Covid-19 is e... - Hindustan Times", "description": "Like other sports, international and domestic cricket too has been disrupted leading the national boards to contemplate resuming the game in empty stadiums, without fans.", "url": "https://www.hindustantimes.com/cricket/you-don-t-want-the-fear-yuvraj-singh-explains-why-cricket-should-return-only-after-covid-19-is-eradicated/story-7okHJdLw1JTTSzbxY9JJ6L.html", "urlToImage": null, "publishedAt": "2020-04-25T09:34:05Z", "content": "Former India star Yuvraj Singh wants cricket to resume only when the world becomes COVD-19 free as players’ health and safety should be paramount for the custodians of the game.\r\nLike other sports, international and domestic cricket too has been disrupted lea… [+1271 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "Dinesh Karthik picks his best IPL XI; expresses disappointment for not including MS Dhoni and R... - The Cricket Times", "description": "India wicket-keeper batsman Dinesh Karthik, recently picked his all-time T20 XI in the Indian Premier League (IPL). The only criterion for his selection was having played at least one game with the players. Karthik, renowned for his finishing abilities lower …", "url": "https://crickettimes.com/2020/04/dinesh-karthik-picks-his-best-ipl-xi-expresses-disappointment-for-not-including-ms-dhoni-and-r-ashwin/", "urlToImage": null, "publishedAt": "2020-04-25T09:33:01Z", "content": "India wicket-keeper batsman Dinesh Karthik, recently picked his all-time T20 XI in the Indian Premier League (IPL). The only criterion for his selection was having played at least one game with the players.\r\nKarthik, renowned for his finishing abilities lower… [+1972 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": null, "title": "‘He was a real pain in the back for us’ – Pat Cummins picks Cheteshwar Pujara as the toughest batsman to bowl - CricTracker", "description": "Pat Cummins, who is the World's number 1 Test bowler, recalled the painstaking series for Australia in 2018-19 season which India", "url": "https://m.crictracker.com/he-was-a-real-pain-in-the-back-for-us-pat-cummins-picks-cheteshwar-pujara-as-the-toughest-batsman-to-bowl/", "urlToImage": null, "publishedAt": "2020-04-25T09:04:22Z", "content": "Pat Cummins and Cheteshwar Pujara. (Photo Source: Getty Images)\r\nTeam India scripted history during their previous Australia tour by winning their first ever Test series down under. Though the hosts missed their best batsman in David Warner and Steve Smith, A… [+1980 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Wasim Jaffer Reveals the First Thing He Will Do Once the Lockdown is Lifted in India - News18", "description": "The former Indian cricketer took to Twitter and asked fans and followers to list the first thing they would do after the lockdown restrictions were lifted from the country.", "url": "https://www.news18.com/news/buzz/wasim-jaffer-reveals-the-first-thing-he-will-do-once-the-lockdown-is-lifted-in-india-2592255.html", "urlToImage": null, "publishedAt": "2020-04-25T08:54:15Z", "content": "Former India cricketer Wasim Jaffer has revealed the first thing he would do once the nationwide lockdown is lifted amid the coronavirus outbreak.\r\nJaffer said he will take his family out for dinner once the lockdown ends on May 3. After that, he will bat in … [+2086 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Anushka Sharma’s Small Gesture During Virat Kohli’s Live Chat Leaves Him Blushing, Watch Here - News18", "description": "Virat Kohli was having an Instagram Live session when his wife helped him by turning on the lights of the room.", "url": "https://www.news18.com/news/movies/anushka-sharmas-small-gesture-during-virat-kohlis-live-chat-leaves-him-blushing-watch-here-2592223.html", "urlToImage": null, "publishedAt": "2020-04-25T08:34:28Z", "content": "Lovebirds Anushka Sharma and Virat Kohli are spending the lockdown time together at their home. The duo is having quite fun in their day to day routine, making each day special for each other.\r\nThe Indian cricket team captain recently had a live chat session … [+1684 chars]"}, {"source": {"id": null, "name": "Tennisworldusa.org"}, "author": "Simone Brugnoli", "title": "Novak Djokovic reveals the key behind his supreme mental strength - Tennis World USA", "description": "The Serbian is well-known for being perhaps the toughest player tennis has ever seen in the biggest moments", "url": "https://www.tennisworldusa.org/tennis/news/Novak_Djokovic/86873/novak-djokovic-reveals-the-key-behind-his-supreme-mental-strength/", "urlToImage": null, "publishedAt": "2020-04-25T08:18:25Z", "content": "Novak Djokovic has shown on more than one occasion that he is one of the mentally strongest tennis players in the history of this sport. Just think of the two match points canceled in the 2019 Wimbledon final, when everything now seemed set for Roger Federer'… [+1440 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Saketh Kandadai", "title": "“It Was Not an Easy Night”: Steve Kerr Narrates a Hilarious Betting Story of Michael Jordan From Their College Days - Essentially Sports", "description": "Golden State Warriors coach Steve Kerr revealed a funny betting story with his former Chicago Bulls teammate Michael Jordan.", "url": "https://www.essentiallysports.com/nba-news-chicago-bulls-it-was-not-an-easy-night-steve-kerr-narrates-a-hilarious-betting-story-of-michael-jordan-from-their-college-days/", "urlToImage": null, "publishedAt": "2020-04-25T07:25:11Z", "content": "Golden State Warriors coach Steve Kerr revealed a funny betting story with his former teammate Michael Jordan.\r\nIt was during a game when Kerr was playing for the University of Arizona while Jordan was at the University of North Carolina. Kerr’s Wildcats defe… [+2070 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Rob Swan", "title": "Premier League football could be back on live TV ‘within weeks’ - GIVEMESPORT", "description": "Premier League football could be back on live TV ‘within weeks’", "url": "https://www.givemesport.com/1564740-premier-league-football-could-be-back-on-live-tv-within-weeks", "urlToImage": null, "publishedAt": "2020-04-25T07:13:11Z", "content": "It seems increasingly likely that the 2019-20 Premier League season will be concluded, according to fresh reports.\r\nNo top-flight football has been played in England since March 9 due to the ongoing coronavirus pandemic, which has threatened to lead to the ca… [+2264 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "From Chess to cricket - The chronicles of Chahal - Cricbuzz - Cricbuzz", "description": "The legspinner talks about his cricketing journey - captaining Haryana at the junior level and how he started off as a medium pacer before switching over to spin", "url": "https://www.cricbuzz.com/cricket-news/112927/from-chess-to-cricket-the-chronicles-of-chahal", "urlToImage": null, "publishedAt": "2020-04-25T05:55:57Z", "content": "From being a chess player (he still has a FIDE rating of 1956) to becoming an international cricketer of repute, Yuzvendra Chahal, India's premier white-ball spinner, has come a long way. A veteran of 52 One Day Internationals and 42 Twenty20 internationals, … [+2072 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": null, "title": "Messi or Ronaldo? Brazilian legends Pele, Ronaldinho and Ronaldo answer - Top Live News", "description": "", "url": "https://indianexpress.com/article/sports/football/messi-or-ronaldo-brazilian-legends-pele-ronaldinho-and-ronaldo-answer-6378475/", "urlToImage": null, "publishedAt": "2020-04-25T05:35:09Z", "content": "Messi or Ronaldo? Brazilian legends Pele, Ronaldinho and Ronaldo choose their aspect\r\nWith coronavirus bringing sports activities and life typically to a halt in the complete world, soccer stars have began answering troublesome questions: Who is the most effe… [+2661 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Reubyn Coutinho", "title": "“The Winner Will Fight Khabib For the Title”- Dana White makes a huge statement - Essentially Sports", "description": "UFC President Dana White made a huge statement regarding UFC Lightweight division. He said the winner of Ferguson-Gaethje will fight Khabib for the title.", "url": "https://www.essentiallysports.com/ufc-news-the-winner-will-fight-khabib-for-the-title-dana-white-makes-a-huge-statement-tony-ferguson-justin-gaethje/", "urlToImage": null, "publishedAt": "2020-04-25T05:00:00Z", "content": "UFC 249 finally has a new venue. The event will take place at VyStar Veterans Memorial Arena in Jacksonville, Florida. The UFC pounced on a chance to hold their events in the Sunshine State as sports activities were deemed essential businesses. Dana White app… [+1819 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "No to saliva, yes to shine: Ball-tampering laws in cricket may change - Times of India", "description": "Cricket News: Cricket may change ball-tampering laws and approve external method to help polish the red cherry in proposed post-corona measures. The matter of saliv", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/no-to-saliva-yes-to-shine-ball-tampering-laws-in-cricket-may-change/articleshow/75367490.cms", "urlToImage": null, "publishedAt": "2020-04-25T04:40:29Z", "content": "NEW DELHI: The coronavirus pandemic may force cricket's world governing body to tweak one of its oldest rules and approve the use of an artificial substance to help shine the ball, effectively legalizing what has for long been a core tenet of the sport's anti… [+4836 chars]"}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "David Pasztor", "title": "Ziyech looking forward to normalcy with Chelsea after abrupt end with Ajax - We Ain't Got No History", "description": "Chelsea’s new signing reflects on a most strange end to his Ajax career, and the big step ahead of him", "url": "https://weaintgotnohistory.sbnation.com/2020/4/25/21235599/ziyech-looking-forward-to-normalcy-with-chelsea-after-abrupt-end-with-ajax", "urlToImage": null, "publishedAt": "2020-04-25T03:15:22Z", "content": "This is not how Hakim Ziyech planned to say goodbye. On March 7, with his team leading 3-1 in the 68th minute, he saw his number go up on the substitution board. On came 17-year-old Ryan Gravenberch, and off went Ziyech for, as it turns out, the last time as … [+3911 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Transfer news and rumours LIVE: Chelsea launch Mertens bid - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T01:50:00Z", "content": "More"}, {"source": {"id": null, "name": "Chessbase.com"}, "author": "", "title": "Magnus Carlsen Invitational: Carlsen and Caruana score convincing wins - Chessbase News", "description": "World numbers one and two, Magnus Carlsen and Fabiano Caruana, won their round-four matches without needing tiebreaks, thus collecting three points each. Carlsen has won all his confrontations so far and is the clear leader with eleven points. He defeated Max…", "url": "https://en.chessbase.com/post/magnus-carlsen-invitational-2020-r4-a", "urlToImage": null, "publishedAt": "2020-04-25T00:34:12Z", "content": "4/25/2020 – World numbers one and two, Magnus Carlsen and Fabiano Caruana, won their round-four matches without needing tiebreaks, thus collecting three points each. Carlsen has won all his confrontations so far and is the clear leader with eleven points. He … [+5679 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Kho kho captain strikes gold, lands in penury - Times of India", "description": "The Covid-19 pandemic brought despair for Nasreen and her family. She landed a contractual job with Airports Authority of India (AAI) last year, but s", "url": "https://timesofindia.indiatimes.com/city/delhi/kho-kho-captain-strikes-gold-lands-in-penury/articleshow/75362916.cms", "urlToImage": null, "publishedAt": "2020-04-24T22:04:42Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "marca", "name": "Marca"}, "author": "Christian Gaudioso, Adapted by Billy Munday", "title": "Tebas: Once we're allowed to restart the season, clubs will be punished if they refuse to play - MARCA.com", "description": "LaLiga president Javier Tebas has insisted that teams who refuse to play the rest of the season will be punished.\n\nOrganisations like the Spanish...", "url": "https://www.marca.com/en/football/spanish-football/2020/04/24/5ea335ee46163fd4248b4661.html", "urlToImage": null, "publishedAt": "2020-04-24T18:58:00Z", "content": "LaLiga president Javier Tebas has insisted that teams who refuse to play the rest of the season will be punished.\r\nOrganisations like the Spanish Footballers' Association (AFE) have expressed their concern over player safety once the season resumes.\r\n\"If a cl… [+2899 chars]"}, {"source": {"id": null, "name": "Atptour.com"}, "author": null, "title": "Virtual Blockbuster! Rafael Nadal & Andy Murray In Same Group In Mutua Madrid Open Virtual Pro - ATP Tour", "description": "The draw for the Mutua Madrid Open Virtual Pro has been made, and although the action will be played in a video game, there is a round-robin blockbuster that jumps off the page. Five-time Madrid champion Rafael Nadal is joined by another former World No. 1, A…", "url": "https://www.atptour.com/en/news/mutua-madrid-open-virtual-pro-2020-draw", "urlToImage": null, "publishedAt": "2020-04-24T18:30:30Z", "content": "The draw for the Mutua Madrid Open Virtual Pro has been made, and although the action will be played in a video game, there is a round-robin blockbuster that jumps off the page.\r\nFive-time Madrid champion Rafael Nadal is joined by another former World No. 1, … [+3125 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Harbhajan Singh names five toughest batsmen he has... - India Gone Viral", "description": "Arguably one of the most skilful off-spinners the Indian cricket ever produced, Harbhajan Singh has played against some of the greatest batsmen of the game. During his long 18-year international caree", "url": "https://indiagoneviral.com/sports/2020/04/24/harbhajan-singh-names-five-toughest-batsmen-he-has/41261/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-24T18:12:27Z", "content": "Arguably one of the most skilful off-spinners the Indian cricket ever produced, Harbhajan Singh has played against some of the greatest batsmen of the game. During his long 18-year international career, Harbhajan has faced top-quality batsmen like Ricky Ponti… [+2661 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": null, "title": "Vanuatu Women’s T20 Super League 2020, Playoff Final – Powerhouse Sharks vs Tafea Blackbirds: Dream11 Fantasy Cricket Tips – Playing XI, Pitch Report & Injury Update - CricTracker", "description": "Vanuatu Women’s T20 Super League: Dream11 Fantasy Cricket Tips, Playing XIs, Vanuatu Pitch Report & Injury News for Powerhouse Sharks vs Tafea Blackbirds", "url": "https://m.crictracker.com/vanuatu-womens-t20-super-league-2020-playoff-final-powerhouse-sharks-vs-tafea-blackbirds-dream11-fantasy-cricket-tips-playing-xi-pitch-report-injury-update/", "urlToImage": null, "publishedAt": "2020-04-24T17:45:37Z", "content": "Vanuatu Women’s team in 2019. (Photo Source: Twitter)\r\nMatch Details:\r\nThe Playoff final of Vanuatu Womens T20 Super League 2020 will be played between Powerhouse Sharks Women and Tafea Blackbirds Women at the Vanuatu Cricket Ground Second Oval.\r\nThe match st… [+3857 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'The biggest disgrace in the history of Dutch sports!' - Cambuur boss rages after his side denied promotion - Goal India", "description": "Antonio Conte may have won league titles in Italy and England, but the Inter coach would not last a season in charge of Real Madrid, according to Diego Costa.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T17:10:00Z", "content": "More"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Ibrahimovic slams 'kindergarten-level' vandals who attacked AC Milan forward's statue in Malmo - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T16:14:00Z", "content": "More"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Barca Blaugranes Staff", "title": "Bayern announce Philippe Coutinho has undergone ankle surgery - Barca Blaugranes", "description": "The Barcelona loanee has gone under the knife", "url": "https://www.barcablaugranes.com/2020/4/24/21234464/philippe-coutinho-undergoes-successful-ankle-surgery", "urlToImage": null, "publishedAt": "2020-04-24T15:07:34Z", "content": "Bayern Munich have announced that Philippe Coutinho has undergone ankle surgery and will be sidelined for a couple of weeks before beginning his recovery.\r\nThe Brazilian, who is on a season-long loan from Barcelona, went under the knife during which loose joi… [+601 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Don't know what's happening with Dhoni, haven't heard since World Cup: Rohit Sharma - Times of India", "description": "Cricket News: There have been a lot of talk about the fate of former India skipper MS Dhoni especially with the IPL being postponed due to the coronavirus outbreak", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/from-world-cup-till-now-we-havent-heard-anything-rohit-sharma-on-ms-dhoni/articleshow/75353013.cms", "urlToImage": null, "publishedAt": "2020-04-24T14:42:44Z", "content": "NEW DELHI: India's limited-overs vice-captain Rohit Sharma says he has no idea \"what's happening\" with elusive former captain Mahendra Singh Dhoni, about whom he hasn't heard anything since India's semi-final exit from the World Cup last year.\r\nWith the IPL p… [+1156 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Amit Kumar", "title": "EXCLUSIVE: Fully recovered from injury and raring to go, says Bhuvneshwar Kumar - Times of India", "description": "Cricket News: Bhuvneshwar Kumar is fully fit now and desperately wants to make a comeback to the Indian side. “While it’s hard to keep indoors for a person like me", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/fully-recovered-from-injury-and-raring-to-go-says-bhuvneshwar-kumar/articleshow/75343641.cms", "urlToImage": null, "publishedAt": "2020-04-24T13:04:19Z", "content": "NEW DELHI: Fast bowlers and injuries go hand in hand. And it's no different for Indian cricketer Bhuvneshwar Kumar. Bhuvneshwar picked up a groin injury, which was later diagnosed to be a sports hernia and he had to miss the tour of New Zealand at the beginni… [+3535 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "Kevin Pietersen reacts to Michael Vaughan's 'jealousy'... - The Cricket Times", "description": "Former England batsman Kevin Pietersen responded to Michael Vaughan spilling beans about the atmosphere of the England side when the former bagged a lucrative IPL contract in 2009. Vaughan claimed about factions in the team envious about KP being recruited by…", "url": "https://crickettimes.com/2020/04/kevin-pietersen-reacts-to-michael-vaughans-jealousy-statement/", "urlToImage": null, "publishedAt": "2020-04-24T12:26:46Z", "content": "Former England batsman Kevin Pietersen responded to Michael Vaughan spilling beans about the atmosphere of the England side when the former bagged a lucrative IPL contract in 2009.\r\nVaughan claimed about factions in the team envious about KP being recruited b… [+2074 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "When Pakistan's Saqlain Mushtaq Learnt to Not Sledge Sachin Tendulkar Ever Again - News18", "description": "Saqlain was expected to play a lot more than the 49 Tests and 169 ODIs he eventually did.", "url": "https://www.news18.com/cricketnext/news/when-pakistans-saqlain-mushtaq-learnt-to-not-sledge-sachin-tendulkar-ever-again-2591371.html", "urlToImage": null, "publishedAt": "2020-04-24T12:26:20Z", "content": "Sachin Tendulkar and Saqlain Mushtaq were involved in umpteen intense battles in the '90s but one such duel left the star Pakistan off-spinner deeply embarrassed.\r\nIn one of his early battles with Tendulkar during the Sahara Cup in Canada, Saqlain thought it … [+3121 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Pornographic images pop-up as top badminton coaches left red-faced during online training session - India Today", "description": "An online training session held by Sports Authority of India (SAI) and Badminton Association of India (BAI) was abruptly ended of Thursday after pornographic images popped up on the screens.", "url": "https://www.indiatoday.in/sports/badminton/story/pornographic-images-bai-sai-online-training-session-pullela-gopichand-coach-badminton-zoom-videoconferencing-app-coronavirus-pandemic-1670627-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T12:13:35Z", "content": "The online training session held by Sports Authority of India (SAI) and Badminton Association of India (BAI) found itself in an unwanted situation after pornographic images suddenly flashed on the screens of 700-plus coaches across the country on Thursday.\r\nT… [+2211 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "Tim Keown", "title": "'The Last Dance' - Dennis Rodman embodied the pop culture phenomenon of the '90s Bulls - ESPN India", "description": "Spending time with Dennis Rodman in the mid-1990s meant having a front-row seat to the basketball/pop culture phenomenon of the Bulls, an experience that can only be described as surreal.", "url": "https://www.espn.in/nba/story/_/id/29083157/the-last-dance-dennis-rodman-embodied-pop-culture-phenomenon-90s-bulls", "urlToImage": null, "publishedAt": "2020-04-24T12:05:53Z", "content": "MY OLDEST SON was 5, in his second month of kindergarten, when his teacher asked why his dad hadn't been seen in the pickup line for a couple of weeks. \"He's living with Dennis Rodman,\" my son answered, dripping nonchalance, as if this were a task every Catho… [+16407 chars]"}, {"source": {"id": null, "name": "Sportscafe.in"}, "author": "SportsCafe Desk", "title": "Reports | Post COVID-19, ICC might legalise ball tampering to compensate for no saliva use - SportsCafe", "description": "As Coronavirus outbreak created a ripple around the world of cricket, the ICC is contemplating to legalise ball tampering to compensate for no saliva use in the immediate aftermath of the sport. If that happens, one of the greatest taboos of the sport will fo…", "url": "https://sportscafe.in/cricket/articles/2020/apr/24/post-covid-19-icc-might-allow-ball-tampering-to-compensate-for-no-saliva-use", "urlToImage": null, "publishedAt": "2020-04-24T11:59:12Z", "content": "As Coronavirus outbreak created a ripple around the world of cricket, the ICC is contemplating to legalise ball tampering to compensate for no saliva use in the immediate aftermath of the sport. If that happens, one of the greatest taboos of the sport will fo… [+1635 chars]"}, {"source": {"id": null, "name": "Icc-cricket.com"}, "author": "ICC", "title": "Live cricket resumes this weekend in Vanuatu - International Cricket Council", "description": "Live cricket action returns this weekend in Vanuatu, with many of the country's best players in action – and doing so for a good cause.", "url": "https://www.icc-cricket.com/news/1660447/live-cricket-resumes-this-weekend-in-vanuatu", "urlToImage": null, "publishedAt": "2020-04-24T10:48:55Z", "content": "Live cricket action returns this weekend in Vanuatu, with many of the country's best players in action and doing so for a good cause.COVID-19 has brought live sports to a grinding halt globally even as governments and frontline workers strive to fight the pan… [+2666 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "Fully fit Bhuvneshwar focusing on fitness with cricket on hold - Cricbuzz - Cricbuzz", "description": "The India pacer underwent surgery for sports hernia in January and has been out of action since", "url": "https://www.cricbuzz.com/cricket-news/112924/fully-fit-bhuvneshwar-focusing-on-fitness-with-cricket-on-hold", "urlToImage": null, "publishedAt": "2020-04-24T10:29:56Z", "content": "Bhuvneshwar underwent surgery for sports hernia in January and has been out of action since. © BCCI\r\nFast bowlers and injuries go hand in hand. And it's no different for Bhuvneshwar Kumar. The pacer picked up a groin injury, which was later diagnosed to be a … [+3079 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘He was a nightmare’: James Anderson, Stuart Broad name toughest batsman to bowl at - Hindustan Times", "description": "When asked about which batsman was the toughest to bowl against in their career, both had the same answer, former South Africa opener and captain Graeme Smith.", "url": "https://www.hindustantimes.com/cricket/he-was-a-nightmare-james-anderson-stuart-broad-name-toughest-batsman-to-bowl-at/story-QL2mlt84USC8Ay8K9e1g8O.html", "urlToImage": null, "publishedAt": "2020-04-24T09:28:05Z", "content": "James Anderson and Stuart Broad together form one of the most successful new ball duos in Test cricket. Both have bowled in tandem and wreaked havoc on touring batsmen in the helpful English conditions for many years now. Anderson has a record 584 wickets to … [+1507 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Rob Hoskin", "title": "Liverpool set to be crowned 2019/20 champions after UEFA effectively remove 'null and void' - GIVEMESPORT", "description": "Liverpool set to be crowned 2019/20 champions after UEFA effectively remove 'null and void'", "url": "https://www.givemesport.com/1564557-liverpool-set-to-be-crowned-201920-champions-after-uefa-effectively-remove-null-and-void", "urlToImage": null, "publishedAt": "2020-04-24T07:02:19Z", "content": "If at the start of March you’d have told any Liverpool fan they wouldn’t have won the Premier League title by now, they’d never have believed you.\r\nIt was just a matter of time before Jurgen Klopp's side were crowned champions in sensational style, winning 27… [+1657 chars]"}]}