{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "ESPNcricinfo staff", "title": "Finishing season in Abu Dhabi 'has to be considered' - Surrey chairman | ESPNcricinfo.com - ESPNcricinfo", "description": "Richard Thompson says ECB and counties will have to be \"creative\" in staging fixtures | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29092795/finishing-season-abu-dhabi-considered-surrey-chairman", "urlToImage": null, "publishedAt": "2020-04-25T02:19:13Z", "content": "Surrey chairman Richard Thompson says that the possibility of finishing the county season in the UAE \"has to be considered\", after ESPNcricinfo revealed that Abu Dhabi Cricket will offer the ECB its facilities to use between October and January.\r\nAbu Dhabi ha… [+3840 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Saketh Kandadai", "title": "Kobe Bryant’s Cameo in The Last Dance of Michael Jordan Leaked - Essentially Sports", "description": "Late Los Angeles Lakers legend Kobe Bryant had a part to play in the first episode of The Last Dance- ESPN's documentary on Michael Jordan", "url": "https://www.essentiallysports.com/nba-news-kobe-bryant-cameo-in-the-last-dance-of-michael-jordan-leaked/", "urlToImage": null, "publishedAt": "2020-04-24T23:01:00Z", "content": "When Michael Jordan and co were getting ready for a second three-peat in the 1997/98 season, Kobe Bryant was a young boy with the Los Angeles Lakers in his second season. That is during the period depicted in the latest documentary The Last Dance, Bryant was … [+1850 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Kho kho captain strikes gold, lands in penury - Times of India", "description": "The Covid-19 pandemic brought despair for Nasreen and her family. She landed a contractual job with Airports Authority of India (AAI) last year, but s", "url": "https://timesofindia.indiatimes.com/city/delhi/kho-kho-captain-strikes-gold-lands-in-penury/articleshow/75362916.cms", "urlToImage": null, "publishedAt": "2020-04-24T22:04:42Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Kuldeep Yadav names three batsmen he wouldn't like to ball in a super... - India Gone Viral", "description": "The Coronavirus pandemic has forced all the countries affected by it to enforce the lockdown. In India, the lockdown has been extended to May 3. Meanwhile, several cricketers are spending time at thei", "url": "https://indiagoneviral.com/sports/2020/04/25/kuldeep-yadav-names-three-batsmen-he-wouldnt-like-to-ball-in-a-super/41431/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-24T20:04:54Z", "content": "The Coronavirus pandemic has forced all the countries affected by it to enforce the lockdown. In India, the lockdown has been extended to May 3. Meanwhile, several cricketers are spending time at their homes and trying to find ways to interact with fans. One … [+1646 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": null, "title": "Recent Match Report - Australia vs India Final, Sharjah Cup 2020 - ESPNcricinfo", "description": "Read the detailed Reports & Articles of Australia vs India Final, Sharjah Cup 2020, RetroLive 2019/20 only on ESPNcricinfo.com", "url": "https://www.espncricinfo.com/series/19832/report/1221310/australia-vs-india-final-sharjah-cup-retrolive-2019-20", "urlToImage": null, "publishedAt": "2020-04-24T19:28:33Z", "content": "India 275 for 4 (Tendulkar 134, Azharuddin 58, Fleming 2-47, Kasprowicz 2-48) beat Australia 272 for 9 (S Waugh 70, Lehmann 70, Prasad 2-32, Kanitkar 2-58, Agarkar 2-61) by six wickets\r\nIs sport at its best when it throws up the unpredictable? Or does it reac… [+7498 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "ESPNcricinfo staff", "title": "MS Dhoni 'doesn't want to' play for India again, says Harbhajan Singh | ESPNcricinfo.com - ESPNcricinfo", "description": "The offspinner speaks to Rohit Sharma on Dhoni's future and India's 2019 World Cup exit | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29093560/ms-dhoni-want-play-india-hints-harbhajan-singh", "urlToImage": null, "publishedAt": "2020-04-24T19:28:28Z", "content": "As far as Harbhajan Singh is concerned, MS Dhoni will never play for India again. Harbhajan, who trained with Dhoni in March at the Chennai Super Kings' preparatory camp for the IPL, said the former India captain had \"played enough\" for India.\r\nRecently, as s… [+4213 chars]"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Adnan Riaz", "title": "Ronaldo And Ronaldinho Finally Answer GOAT Debate Between Lionel Messi And Cristiano Ronaldo - SPORTbible", "description": "Ronaldinho and Ronaldo praised Lionel Messi and Cristiano Ronaldo, but they both chose the same player in the footballing GOAT debate.", "url": "https://www.sportbible.com/football/news-rivalries-ronaldo-and-ronaldinho-answer-goat-debate-between-messi-and-cristiano-20200424", "urlToImage": null, "publishedAt": "2020-04-24T18:53:18Z", "content": "Brazilian legends Ronaldinho and Ronaldo revealed that they would choose Lionel Messi ahead of Cristiano Ronaldo as the 'GOAT of football.'\r\nMessi and Ronaldo's status as two of the best players in the history of the sport has led to many debating who is the … [+1624 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "Umar Farooq", "title": "Saleem Malik 'wants to serve' again but PCB averse | ESPNcricinfo.com - ESPNcricinfo", "description": "ESPNcricinfo understands there are still inquiries pending against Malik beyond allegations of match-fixing in 2000 | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29093697/saleem-malik-wants-serve-again-pcb-averse", "urlToImage": null, "publishedAt": "2020-04-24T18:08:07Z", "content": "A movement appears to have begun urging the PCB to reintegrate Saleem Malik, the former batsman and captain who was banned for life in 2000 after being found guilty of attempting to fix a Test in Justice Qayyum's report. It has gained prominence with support … [+3396 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": null, "title": "Vanuatu Women’s T20 Super League 2020, Playoff Final – Powerhouse Sharks vs Tafea Blackbirds: Dream11 Fantasy Cricket Tips – Playing XI, Pitch Report & Injury Update - CricTracker", "description": "Vanuatu Women’s T20 Super League: Dream11 Fantasy Cricket Tips, Playing XIs, Vanuatu Pitch Report & Injury News for Powerhouse Sharks vs Tafea Blackbirds", "url": "https://m.crictracker.com/vanuatu-womens-t20-super-league-2020-playoff-final-powerhouse-sharks-vs-tafea-blackbirds-dream11-fantasy-cricket-tips-playing-xi-pitch-report-injury-update/", "urlToImage": null, "publishedAt": "2020-04-24T17:45:37Z", "content": "Vanuatu Women’s team in 2019. (Photo Source: Twitter)\r\nMatch Details:\r\nThe Playoff final of Vanuatu Womens T20 Super League 2020 will be played between Powerhouse Sharks Women and Tafea Blackbirds Women at the Vanuatu Cricket Ground Second Oval.\r\nThe match st… [+3857 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Covid-19 outbreak: Ajax denied title as Dutch Eredivisie season declared void - India Today", "description": "The Dutch Eredivisie season has been ended with immediate effect, meaning league leaders Ajax have been denied the title.", "url": "https://www.indiatoday.in/sports/football/story/covid-19-outbreak-ajax-denied-title-as-dutch-eredivisie-season-declared-void-1670775-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T16:33:44Z", "content": "No top-flight league title will be awarded in the Netherlands after the COVID-19 pandemic brought the campaign to a premature close but Ajax Amsterdam and AZ Alkmaar will qualify for next season's Champions League, Dutch media reported on Friday.\r\nThe reports… [+560 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "‘The way you’re playing...’: Sachin Tendulkar’s prediction for Hardik Pandya in 2015 revealed by Mumbai... - Hindustan Times", "description": "Pandya is now an integral part of the Indian team and made his return to the side for the series against South Africa which had to be called off midway due to the coronavirus outbreak.", "url": "https://www.hindustantimes.com/cricket/the-way-you-re-playing-sachin-tendulkar-s-prediction-for-hardik-pandya-in-2015-revealed-by-mumbai-indians/story-Ezpq0xtY943ryfxFsrsZvO.html", "urlToImage": null, "publishedAt": "2020-04-24T15:53:00Z", "content": "With legend Sachin Tendulkar turning 47 on Friday, the whole cricket fraternity has been wishing him and Mumbai Indians have tweeted a special message that the Little Master had given to India all-rounder Hardik Pandya when the latter was still looking to bre… [+2092 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘It has been such an amazing journey’: Virat Kohli talks about his future with RCB - Hindustan Times", "description": "He has only played for one franchise in his career and has openly professed his love for RCB. He was not made the captain of RCB in 2013 and took the team to the final in 2016.", "url": "https://www.hindustantimes.com/cricket/it-has-been-such-an-amazing-journey-virat-kohli-talks-about-his-future-with-rcb/story-YJDyXlQbhTH1mawWsmbnsO.html", "urlToImage": null, "publishedAt": "2020-04-24T15:46:47Z", "content": "Virat Kohli has been a stalwart of the Indian Premier League since being signed by Royal Challengers Bangalore. He has only played for one franchise in his career and has openly professed his love for RCB. He was not made the captain of RCB in 2013 and took t… [+2758 chars]"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Barca Blaugranes Staff", "title": "Bayern announce Philippe Coutinho has undergone ankle surgery - Barca Blaugranes", "description": "The Barcelona loanee has gone under the knife", "url": "https://www.barcablaugranes.com/2020/4/24/21234464/philippe-coutinho-undergoes-successful-ankle-surgery", "urlToImage": null, "publishedAt": "2020-04-24T15:07:34Z", "content": "Bayern Munich have announced that Philippe Coutinho has undergone ankle surgery and will be sidelined for a couple of weeks before beginning his recovery.\r\nThe Brazilian, who is on a season-long loan from Barcelona, went under the knife during which loose joi… [+601 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Lucky to get team management's backing after injuries: Bhuvneshwar Kumar - Times of India", "description": "Cricket News: It is tough to make a comeback after a lengthy injury layoff but the team management's support makes the job easier, says right-arm medium pacer Bhuvn", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/lucky-to-get-team-managements-backing-after-injuries-bhuvneshwar-kumar/articleshow/75352116.cms", "urlToImage": null, "publishedAt": "2020-04-24T14:14:00Z", "content": null}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Scroll Staff", "title": "Felt embarrassed after Sachin Tendulkar spoke to me about my sledging: Saqlain Mushtaq - Scroll.in", "description": "Former Pakistan off-spinner recalls an incident with the Indian batting legend during a match in the Sahara Cup in Canada.", "url": "https://scroll.in/field/960158/felt-embarrassed-after-sachin-tendulkar-spoke-to-me-about-my-sledging-saqlain-mushtaq", "urlToImage": null, "publishedAt": "2020-04-24T13:54:00Z", "content": "Former Pakistan off-spinner Saqlain Mushtaq on Friday remembered a tense battle with Indian batting legend Sachin Tendulkar in 1990s, leaving him embarrassed following a war of words. \r\nIn one of his early battles with Tendulkar during the Sahara Cup in Canad… [+3279 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "I smacked 25-ball 87 after watching Sehwag’s ton: Raina tells Ashwin - Hindustan Times", "description": "Raina joined Ashwin for a live video chat session on popular social media platform Instagram and the duo spoke about various things during their time together at CSK.", "url": "https://www.hindustantimes.com/cricket/i-smacked-25-ball-87-after-watching-sehwag-s-ton-raina-tells-ashwin/story-YvYyAFxheOlWJzrIvWvaBK.html", "urlToImage": null, "publishedAt": "2020-04-24T13:38:13Z", "content": "Former Chennai Super Kings teammates Suresh Raina and Ravichandran Ashwin recalled the southpaw’s whirlwind innings against Kings XI Punjab during the 2014 edition of the Indian Premier League. With no cricket being played due to coronavirus pandemic, former … [+1897 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Rob Hoskin", "title": "Neymar's mum dumps 23-year-old boyfriend after discovering he dated men - GIVEMESPORT", "description": "Neymar's mum dumps 23-year-old boyfriend after discovering he dated men", "url": "https://www.givemesport.com/1564639-neymars-mum-dumps-23yearold-boyfriend-after-discovering-he-dated-men", "urlToImage": null, "publishedAt": "2020-04-24T13:27:09Z", "content": "Neymar’s mother has dumped her 23-year-old lover after discovering he had ‘dated a string of men’, according to reports in Brazil.\r\n52-year-old mother Nadine Goncalves declared her love for Tiago Ramos earlier this month, with Neymar giving his approval recen… [+1625 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": null, "title": "Taipei T10 League 2020: Match 1, Hsinchu Titans vs Taiwan Daredevils: MyTeam11 Fantasy Cricket Tips – Playing XI, Pitch Report & Injury Update - CricTracker", "description": "Taipei T10 League 2020 | Match 1, Hsinchu Titans vs Taiwan Daredevils | MyTeam11 Fantasy Cricket Tips, Pitch Report, Probable Playing XIs, Weather report", "url": "https://m.crictracker.com/taipei-t10-league-2020-match-1-hsinchu-titans-vs-taiwan-daredevils-myteam11-fantasy-cricket-tips-playing-xi-pitch-report-injury-update/", "urlToImage": null, "publishedAt": "2020-04-24T13:25:54Z", "content": "Cricket stadium. (Photo Source: Twitter)\r\nMatch Details:\r\nThe 1st match of the Taipei T10 League 2020 will be played between Hsinchu Titans and Taiwan Daredevils at the Yingfeng Cricket Ground in Songshan District.\r\nThe match starts at 11:30 AM local time (3:… [+3488 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "Zach Lowe", "title": "Lowe: Five NBA things I like and don't like, including Michael Jordan and the Bulls' thrilling lineup intros - ESPN India", "description": "Let's talk about the electrifying way Michael Jordan and the Bulls hit the court, plus the Hall of Fame case of Derrick Rose.", "url": "https://www.espn.in/nba/story/_/id/29070989/five-nba-things-like-including-michael-jordan-chicago-bulls-thrilling-lineup-intros", "urlToImage": null, "publishedAt": "2020-04-24T13:14:35Z", "content": "Let's punctuate the waiting game with five things from actual NBA games:\r\n1. Bring back great starting lineup introductions\r\nThis is one of the most important takeaways from \"The Last Dance\": We need to restore starting lineup introductions to their Jordan-er… [+13489 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Rishi Karthikeyan", "title": "“Roger Federer Is The Best Player Ever” – Stan Wawrinka - Essentially Sports", "description": "The GOAT debate has been going on for a long time with people having different opinions. Let's hear who Stan Wawrinka thinks is the GOAT.", "url": "https://www.essentiallysports.com/roger-federer-is-the-best-player-ever-stan-wawrinka-atp-tennis-news/", "urlToImage": null, "publishedAt": "2020-04-24T13:14:00Z", "content": "The most important debate in tennis right now is the GOAT debate. For a long time, the debate was between Rafael Nadal and Roger Federer but now Novak Djokovic has joined the party. Each person has their own opinion about who is the best. Let’s see who Stan W… [+1462 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "David Warner reveals his ‘most annoying’ teammate in Sunrisers Hyderabad - Hindustan Times", "description": "Bhuvneshwar asked Warner to pick a dance teacher for himself and the most annoying cricketer in the SRH squad and on both occasions, he took the name of young Indian cricket team fast bowler Khaleel Ahmed.", "url": "https://www.hindustantimes.com/cricket/david-warner-reveals-his-most-annoying-teammate-in-sunrisers-hyderabad/story-staMlg6NSGhSuMWSkEVvjJ.html", "urlToImage": null, "publishedAt": "2020-04-24T12:37:02Z", "content": "Sunrisers Hyderabad teammates David Warner and Bhuvneshwar Kumar engaged in a casual chat on Instagram on Friday and the two cricketers talked about their careers and about their teammates in the Indian Premier League franchise. The two cricketers have had on… [+1653 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "Kevin Pietersen reacts to Michael Vaughan's 'jealousy'... - The Cricket Times", "description": "Former England batsman Kevin Pietersen responded to Michael Vaughan spilling beans about the atmosphere of the England side when the former bagged a lucrative IPL contract in 2009. Vaughan claimed about factions in the team envious about KP being recruited by…", "url": "https://crickettimes.com/2020/04/kevin-pietersen-reacts-to-michael-vaughans-jealousy-statement/", "urlToImage": null, "publishedAt": "2020-04-24T12:26:46Z", "content": "Former England batsman Kevin Pietersen responded to Michael Vaughan spilling beans about the atmosphere of the England side when the former bagged a lucrative IPL contract in 2009.\r\nVaughan claimed about factions in the team envious about KP being recruited b… [+2074 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'Ronaldinho told me to join Man Utd!' - Kleberson recalls Old Trafford transfer - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T12:00:00Z", "content": "More"}, {"source": {"id": null, "name": "Icc-cricket.com"}, "author": "ICC", "title": "Live cricket resumes this weekend in Vanuatu - International Cricket Council", "description": "Live cricket action returns this weekend in Vanuatu, with many of the country's best players in action – and doing so for a good cause.", "url": "https://www.icc-cricket.com/news/1660447/live-cricket-resumes-this-weekend-in-vanuatu", "urlToImage": null, "publishedAt": "2020-04-24T10:48:55Z", "content": "Live cricket action returns this weekend in Vanuatu, with many of the country's best players in action and doing so for a good cause.COVID-19 has brought live sports to a grinding halt globally even as governments and frontline workers strive to fight the pan… [+2666 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Reubyn Coutinho", "title": "“It’s Just Pathetic”- Frank Warren Slams Deontay Wilder’s Excuses - Essentially Sports", "description": "Tyson Fury's promoter Frank Warren slammed Deontay Wilder after he put forward a plethora of excuses to dismiss his humbling earlier in the year.", "url": "https://www.essentiallysports.com/boxing-news-its-just-pathetic-frank-warren-slams-deontay-wilder-excuses/", "urlToImage": null, "publishedAt": "2020-04-24T10:32:00Z", "content": "Deontay Wilder suffered his first professional defeat this year. He lost to Tyson Fury after this corner three in the towel in the 7th round. ‘The Bronze Bomber’ has been making excuses ever since his loss. These haven’t gone down well with the boxing communi… [+1662 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Sports Desk", "title": "People started calling me ‘Silver Sindhu’: PV Sindhu talks about overcoming losses in finals - The Indian Express", "description": "Badminton star PV Sindhu gets candid with cricketers Smriti Mandhana and Jemimah Rodrigues in their show 'Double Trouble', where she calls beating the reigning Olympic champion Li Xuerui in 2012 a turning point in her career.", "url": "https://indianexpress.com/article/sports/cricket/people-had-started-calling-me-silver-sindhu-pv-sindhu-talks-about-overcoming-losses-in-finals-6377267/", "urlToImage": null, "publishedAt": "2020-04-24T10:16:39Z", "content": "Indian cricketers Jemimah Rodriques and Smriti Mandhana have come up with a new web show ‘Double Trouble’ and PV Sindhu (centre) was their first guest. (Screengrabs)Current badminton world champion PV Sindhu revealed just how desperately she wanted to win gol… [+1891 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "Manohar may continue as ICC chairman for 2 extra months, Graves favourite to take over - Hindustan Times", "description": "England and Wales Cricket Board (ECB) chairman Colin Graves will replace the former BCCI president, who, it is learnt, has decided against seeking an extension for a third two-year-term.", "url": "https://www.hindustantimes.com/cricket/manohar-may-continue-as-icc-chairman-for-2-extra-months-graves-favourite-to-take-over/story-imDPWLWK47VXngOoeeAPZN.html", "urlToImage": null, "publishedAt": "2020-04-24T10:06:42Z", "content": "International Cricket Council chairman Shashank Manohar, who is expected to step down in June, might get a couple of months’ extension as the ICC’s Board Meeting is set to be postponed due to the COVID-19 pandemic.\r\n In all likelihood, England and Wales Crick… [+1899 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Rob Hoskin", "title": "The best 25 players in the last 25 years have been ranked - GIVEMESPORT", "description": "The best 25 players in the last 25 years have been ranked", "url": "https://www.givemesport.com/1564596-the-best-25-players-in-the-last-25-years-have-been-ranked", "urlToImage": null, "publishedAt": "2020-04-24T09:40:11Z", "content": "'Who is the greatest player of all-time?'\r\nIt's a question that every football fan has attempted to answer at some point.\r\nYounger fans simply won't look beyond Lionel Messi or Cristiano Ronaldo, who have won 11 Ballon d'Ors between them since 2008.\r\nBut thos… [+9961 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘He was a nightmare’: James Anderson, Stuart Broad name toughest batsman to bowl at - Hindustan Times", "description": "When asked about which batsman was the toughest to bowl against in their career, both had the same answer, former South Africa opener and captain Graeme Smith.", "url": "https://www.hindustantimes.com/cricket/he-was-a-nightmare-james-anderson-stuart-broad-name-toughest-batsman-to-bowl-at/story-QL2mlt84USC8Ay8K9e1g8O.html", "urlToImage": null, "publishedAt": "2020-04-24T09:28:05Z", "content": "James Anderson and Stuart Broad together form one of the most successful new ball duos in Test cricket. Both have bowled in tandem and wreaked havoc on touring batsmen in the helpful English conditions for many years now. Anderson has a record 584 wickets to … [+1507 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Transfer news and rumours LIVE: Zidane wants Real Madrid to sign Pogba this summer - Goal India", "description": "Kevin De Bruyne says Sadio Mane has been “the total package” for Liverpool this year, and would be his Premier League Player of the Season.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T09:00:00Z", "content": "More"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Anushka Sharma makes another failed attempt at the Gibberish filter but husband Virat Kohli gets it right - PINKVILLA", "description": "Anushka Sharma has our attention with the Gibberish filter once again, but this time, Virat Kohli has the answer. Check it out right here.", "url": "https://www.pinkvilla.com/entertainment/news/anushka-sharma-makes-another-failed-attempt-gibberish-filter-husband-virat-kohli-gets-it-right-526975", "urlToImage": null, "publishedAt": "2020-04-24T08:49:29Z", "content": null}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Rooney & Man Utd stars 'erupted' in hotel to celebrate Liverpool win over Chelsea - Carragher - Goal India", "description": "Goal takes a look at the next FIFA release date, how much it will cost, consoles it will be playable on and more.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T08:30:00Z", "content": "More"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Dipankar Lahiri", "title": "The 7-year-old who has professional cricketers like Michael Atherton praising her technique - The Indian Express", "description": "Pari, who lives in Haryana's Rohtak, is coached by her father Pardeep Sharma, a former cricketer whose teammates at the university level included former Indian cricketers Ajay Ratra and Joginder Sharma.", "url": "https://indianexpress.com/article/sports/cricket/pari-sharma-7-year-old-indian-girl-batting-technique-6375360/", "urlToImage": null, "publishedAt": "2020-04-24T08:27:12Z", "content": "Written by Dipankar Lahiri\r\n | New Delhi | \r\nUpdated: April 24, 2020 1:52:52 pm\r\nPari Sharma trains in Rohtak’s Roop Nagar (Special Arrangement)“When I grow up I want to be like Pari Sharma,” said West Indies cricketer Shai Hope. England’s Michael Atherton ca… [+2242 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "Daniel Brettig", "title": "Cricket to consider legalised ball tampering in wake of coronavirus | ESPNcricinfo.com - ESPNcricinfo", "description": "There are concerns about using saliva when cricket resumes due to the risks posed by Covid-19 | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29091809/cricket-consider-legalised-ball-tampering-wake-coronavirus", "urlToImage": null, "publishedAt": "2020-04-24T08:15:29Z", "content": "Coronavirus may force the busting of one of cricket's greatest taboos, as authorities consider the possibility of allowing the use of artificial substances to help polish the red ball under the supervision of umpires in long-form matches, in order to end the … [+6099 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Who Are The Highest Paid UFC Fighters – These Names Will Surprise You - India Gone Viral", "description": "UFC fighters certainly make a lot of money every time they step into the Octagon. Their salaries range from 5 figures to 6 figures. Some of the biggest draws in the company like Conor McGregor and Kha", "url": "https://indiagoneviral.com/sports/2020/04/24/who-are-the-highest-paid-ufc-fighters-these-names-will-surprise-you/40513/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-24T08:14:31Z", "content": "UFC fighters certainly make a lot of money every time they step into the Octagon. Their salaries range from 5 figures to 6 figures. Some of the biggest draws in the company like Conor McGregor and Khabib Nurmagomedov even take home 7 figure sums for a single … [+9060 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Abhishek Bharadwaj", "title": "McLaren CEO Takes a Cheeky Dig at Ferrari Boss Binotto, Reminding Him of the FIA Controversy - Essentially Sports", "description": "McLaren CEO Zak Brown took a sly dig at Ferrari team principal Mattia Binotto over the latter's remarks on the ongoing F1 budget cap debate.", "url": "https://www.essentiallysports.com/f1-news-mclaren-ceo-takes-a-cheeky-dig-at-ferrari-boss-binotto-reminding-him-of-the-fia-controversy/", "urlToImage": null, "publishedAt": "2020-04-24T07:47:00Z", "content": "McLaren CEO Zak Brown took a cheeky dig at Ferrari team principal Mattia Binotto over the latters views on the budget cap. Binotto is currently under fire from several portions of the F1 world and media over his remarks on the ongoing cost cap. When speaking … [+1908 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Won't Accept Change of Asia Cup Schedule to Accommodate IPL: PCB CEO - News18", "description": "Khan said the BCCI representative did not raise the IPL window issue at Thursday's ICC Chief Executives virtual meeting where he took part as PCB's representative.", "url": "https://www.news18.com/cricketnext/news/wont-accept-change-of-asia-cup-schedule-to-accommodate-ipl-pcb-ceo-2590777.html", "urlToImage": null, "publishedAt": "2020-04-24T07:30:14Z", "content": "The Pakistan Cricket Board will object to any change in the schedule of Asia Cup to accommodate the currently-suspended Indian Premier League (IPL), PCB CEO Wasim Khan has asserted.\r\nKhan said the PCB is hoping to hold the Asia Cup T20 tournament in the UAE a… [+2405 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Rob Hoskin", "title": "Liverpool set to be crowned 2019/20 champions after UEFA effectively remove 'null and void' - GIVEMESPORT", "description": "Liverpool set to be crowned 2019/20 champions after UEFA effectively remove 'null and void'", "url": "https://www.givemesport.com/1564557-liverpool-set-to-be-crowned-201920-champions-after-uefa-effectively-remove-null-and-void", "urlToImage": null, "publishedAt": "2020-04-24T07:02:19Z", "content": "If at the start of March you’d have told any Liverpool fan they wouldn’t have won the Premier League title by now, they’d never have believed you.\r\nIt was just a matter of time before Jurgen Klopp's side were crowned champions in sensational style, winning 27… [+1657 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": null, "title": "‘He used to make me feel like crying’ – Harbhajan Singh reveals five toughest batsmen he has ever bowled at - CricTracker", "description": "On Thursday, he again conducted a live session and this time he was involved in a chat with veteran Indian spinner Harbhajan Singh.", "url": "https://m.crictracker.com/he-used-to-make-me-feel-like-crying-harbhajan-singh-reveals-five-toughest-batsmen-he-has-ever-bowled-at/", "urlToImage": null, "publishedAt": "2020-04-24T06:33:54Z", "content": "Harbhajan Singh. (Photo by Visionhaus/Getty Images)\r\nIn the ongoing lockdown, the Indian cricketers have become more active on social media platforms where they interact with their fans and teammates. Meanwhile, Rohit Sharma is one of those players, who is co… [+1865 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "“Just Making Myself at Home”- Tom Brady Gives a Humorous Reply on Trespassing - India Gone Viral", "description": "Tom Brady is arguably the most successful player in the NFL. He achieved stupendous success in 2 decades with the AFC side New England Patriots. Later, he decided to make a move and joined the NFC sid", "url": "https://indiagoneviral.com/sports/2020/04/24/just-making-myself-at-home/40386/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-24T06:14:28Z", "content": "Tom Brady is arguably the most successful player in the NFL. He achieved stupendous success in 2 decades with the AFC side New England Patriots. Later, he decided to make a move and joined the NFC side Tampa Bay Buccaneers on a 2-year deal worth $50 million.\r… [+1865 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "ESPN staff", "title": "2020 NFL draft trade tracker - Every deal for a first-round pick - ESPN India", "description": "Follow along for every trade involving Day 1 NFL draft picks. Which teams made moves for first-rounders?", "url": "https://www.espn.in/nfl/draft2020/story/_/id/29045298/2020-nfl-draft-trade-tracker-every-deal-first-round-pick", "urlToImage": null, "publishedAt": "2020-04-24T05:24:16Z", "content": "We tracked every first-round trade made leading up to the 2020 NFL draft. Here are all of the latest draft-pick deals for Day 1 selections, dating back to the Bears-Raiders trade in 2018 for the No. 19 pick in this year's draft. Follow along through Round 1 f… [+5237 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "Middlesex opt to furlough players and staff - Cricbuzz - Cricbuzz", "description": "The club has also announced pay cuts across spectrum with the senior management taking the biggest cut", "url": "https://www.cricbuzz.com/cricket-news/112921/middlesex-opt-to-furlough-players-and-staff", "urlToImage": null, "publishedAt": "2020-04-24T04:57:09Z", "content": "A general view outside Lord's Cricket Ground, home of Middlesex County Cricket Club © Getty\r\nMiddlesex, the 2016 County Championship winners, have announced the decision to furlough players and most of their operating staff (including administrative and suppo… [+2889 chars]"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Gill Clark", "title": "La Liga to be played behind closed doors until 2021 - report - Barca Blaugranes", "description": "Plans are being put in place for football to return", "url": "https://www.barcablaugranes.com/barcelona-la-liga/2020/4/24/21233337/la-liga-to-be-played-behind-closed-doors-until-2021-report", "urlToImage": null, "publishedAt": "2020-04-24T02:09:02Z", "content": "La Liga games will be played without fans and behind closed doors until next year because of the coronavirus pandemc, according to ESPN.\r\nThe report claims La Liga clubs have already been told of the decision and that stadiums will only reopen under strict sa… [+789 chars]"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Gill Clark", "title": "Barcelona rumors: Saul Niguez, Samuel Umtiti, Inaki Pena and Lautaro - Barca Blaugranes", "description": "The gossip just keeps on coming...", "url": "https://www.barcablaugranes.com/fc-barcelona-transfer-rumors-news/2020/4/24/21233283/barcelona-rumor-round-up-saul-niguez-samuel-umtiti-inaki-pena-and-lautaro-latest", "urlToImage": null, "publishedAt": "2020-04-23T23:13:29Z", "content": "Messi wants Neymar over Lautaro\r\nTodays rumors start with Barcelonas hunt for new attacking reinforcements and with a report that reckons Lionel Messi wants Neymar over Lautaro Martinez.\r\nCadena SER report that sources from the Catalan giants have made it cle… [+2474 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'There is no reason to wait' - Zidane should try to lure Pogba to Madrid this summer, says Dugarry - Goal India", "description": "Raheem Sterling believes he can be a more successful goalscorer with Manchester City, but vowed his focus is not on personal success.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-23T22:48:44Z", "content": "More"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'I'd love Sancho to come to Chelsea' - Hudson-Odoi eager to link up with England team-mate at Stamford Bridge - Goal India", "description": "Goal takes a look at the next FIFA release date, how much it will cost, consoles it will be playable on and more.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-23T22:08:36Z", "content": "More"}, {"source": {"id": null, "name": "Thesportsrush.com"}, "author": "Jatin Hasija", "title": "TB vs YD Dream11 Prediction : Taiwan Beer Vs Yulon Luxgen Dinos Best Dream 11 Team for Final of Game 3 Super Basketball League 2019-20 - The Sportsrush", "description": "TB Vs YD Dream11 Team Overview, Match Centre And Probable Playing 5: Yulon take an unprecedented 2-1 lead in the finals ahead of today’s third tie. When the league was been talked about and dissected a week back, there was only one clear cut winner who sat on…", "url": "https://thesportsrush.com/tb-vs-yd-dream11-prediction-taiwan-beer-vs-yulon-luxgen-dinos-best-dream-11-team-for-final-of-game-3-super-basketball-league-2019-20/", "urlToImage": null, "publishedAt": "2020-04-23T21:23:00Z", "content": "TB Vs YD Dream11 Team Overview, Match Centre And Probable Playing 5: Yulon take an unprecedented 2-1 lead in the finals ahead of todays third tie.\r\nWhen the league was been talked about and dissected a week back, there was only one clear cut winner who sat on… [+4668 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Mahalakshmi Murali", "title": "French Open 2020 Gets Postponed Once Again - Essentially Sports", "description": "The very first tennis tournament to be rescheduled this year, French Open 2020 has once again changed its dates amid the coronavirus pandemic.", "url": "https://www.essentiallysports.com/tennis-news-atp-wta-french-open-2020-gets-postponed-once-again/", "urlToImage": null, "publishedAt": "2020-04-23T21:00:00Z", "content": "The very first tennis tournament to be rescheduled this year, French Open 2020 has once again changed its dates amid the coronavirus pandemic. The clay-court major was supposed to start on September 20, 2020. But now the main draw events have been postponed b… [+1488 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Liverpool mayor calls for inquiry into why Champions League tie with Atletico Madrid took place amid coronavirus crisis - Goal India", "description": "Inter vice-president Javier Zanetti believes Lautaro Martinez is happy at the Serie A club amid strong links to Barcelona.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-23T18:25:00Z", "content": "More"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Qatar, Saudi Arabia bid to host 2030 Asian Games - Aljazeera.com", "description": "The decision about the host city will be announced at the Olympic Council of Asia General Assembly meeting in November.", "url": "https://www.aljazeera.com/ajimpact/qatar-saudi-arabia-bid-host-2030-asian-games-200423164028858.html", "urlToImage": null, "publishedAt": "2020-04-23T18:00:00Z", "content": "Qatar and Saudi Arabia will compete for the hosting rights of the Asian Games in 2030, the Olympic Council of Asia (OCA) has announced.\r\nIn a statement on Thursday, the OCA said it had received bids from Doha and Riyadh, the capital cities of the two neighbou… [+1947 chars]"}, {"source": {"id": null, "name": "Sempremilan.com"}, "author": null, "title": "Sky: Liverpool refuse to pay €60m clause despite striker’s desire to join – opening for Milan? - SempreMilan", "description": "Liverpool may have hit a hurdle in their pursuit of RB Leipzig star Timo Werner, a report claims, which could be good news for AC Milan.", "url": "https://sempremilan.com/sky-liverpool-refuse-to-pay-e60m-clause-despite-strikers-desire-to-join-opening-for-milan", "urlToImage": null, "publishedAt": "2020-04-23T16:40:13Z", "content": "Liverpool may have hit a hurdle in their pursuit of RB Leipzig star Timo Werner, a report claims, which could be good news for AC Milan.\r\nMilan have been linked with a move for Werner by a number of different outlets over the past week amid widespread reports… [+748 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Agence France-Presse", "title": "German football targets May 9 restart but needs political green light - Hindustan Times", "description": "Following a meeting with Germany’s top clubs, Christian Seifert said the league was “ready” to return next month, which would make it the first major European football competition to do so.", "url": "https://www.hindustantimes.com/cricket/german-football-targets-may-9-restart-but-needs-political-green-light/story-t7DwBJCXabWw5ZQPilIZXN.html", "urlToImage": null, "publishedAt": "2020-04-23T15:43:51Z", "content": "German league football is ready to resume without spectators on May 9 but the final say rests with political leaders, the Bundesliga’s chief executive said Thursday.\r\nFollowing a meeting with Germany’s top clubs, Christian Seifert said the league was “ready” … [+3383 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "Contingency planning for T20 WC continuing as scheduled - ICC - Cricbuzz - Cricbuzz", "description": null, "url": "https://www.cricbuzz.com/cricket-news/112916/contingency-planning-t20-world-cup-cricket-australia-scheduled-icc-cricbuzzcom", "urlToImage": null, "publishedAt": "2020-04-23T15:25:29Z", "content": "The International Cricket Council will continue to plan for the staging of the men's T20 WC later this year as well as the Women's World Cup of 2021 with representatives of 12 full member playing countries as well as three associates reiterating their commitm… [+2996 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "Mark Ogden", "title": "Newcastle can't buy into Premier League elite after takeover like Manchester City did - ESPN India", "description": "Newcastle fans are right to be excited by the club's proposed takeover, but don't expect them to follow Manchester City's fast track to the top.", "url": "https://www.espn.in/football/newcastle-united/story/4088345/newcastle-cant-buy-into-premier-league-elite-after-takeover-like-manchester-city-did", "urlToImage": null, "publishedAt": "2020-04-23T15:04:10Z", "content": "What do Antoine Griezmann, Edinson Cavani, Timo Werner, Dries Mertens, Mauricio Pochettino and Massimiliano Allegri all have in common? Over the past week, all have been linked with moves to Newcastle United once owner Mike Ashley completes his proposed sale … [+5759 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "https://www.facebook.com/profile.php?id=100009654009663", "title": "Jules Bianchi Deserved the Ferrari Seat Even More, Feels Charles Leclerc - Essentially Sports", "description": "Charles Leclerc has straightforwardly surrendered that Jules Bianchi was deserving of a Formula 1 drive with Ferrari than himself.", "url": "https://www.essentiallysports.com/f1-news-jules-bianchi-deserved-the-ferrari-seat-even-more-feels-charles-leclerc/", "urlToImage": null, "publishedAt": "2020-04-23T14:47:00Z", "content": "Charles Leclerc has straightforwardly surrendered that Jules Bianchi was deserving of a Formula 1 drive with Ferrari than himself.\r\nApplauding Bianchi’s ability, Leclerc said that there was “a lot more to come” from the Frenchman. Jules had just intrigued eve… [+1793 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "Michael Hussey reveals his two favourite... - The Cricket Times", "description": "Mr Cricket ‘Michael Hussey’, during a recent interaction, named his favourite captain. Hussey has played under the inspirational leadership of several world-class captains. Out of them, Hussey chose his Chennai Super Kings captain MS Dhoni and Australia capta…", "url": "https://crickettimes.com/2020/04/michael-hussey-reveals-his-two-favourite-captains/", "urlToImage": null, "publishedAt": "2020-04-23T14:37:37Z", "content": "Mr Cricket Michael Hussey, during a recent interaction, named his favourite captain. Hussey has played under the inspirational leadership of several world-class captains.\r\nOut of them, Hussey chose his Chennai Super Kings captain MS Dhoni and Australia captai… [+1619 chars]"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Josh Suttr", "title": "Former Real Madrid keeper Dudek calls Messi ‘deceptive and provocative’ - Barca Blaugranes", "description": "The former goalkeeper has a book out...", "url": "https://www.barcablaugranes.com/2020/4/23/21232483/former-real-madrid-keeper-dudek-says-messi-was-deceptive-and-provocative", "urlToImage": null, "publishedAt": "2020-04-23T14:34:43Z", "content": "Wanna hear a name you havent heard in a bit? Jerzy Dudek. The former Real Madrid goalkeeper recently wrote a book. A tale, about the life and times of Jerzy Dudek. In this book, Dudek hit out at Lionel Messi. \r\nThe former Madrid keeper was Iker Casillas backu… [+573 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "India Today League PUBG MOBILE Invitational match reports: SouL top Day 1 despite losing Chicken Dinner - India Today", "description": "All four match reports of India Today League PUBG Mobile Invitational: Team Soul finished on top with 61 points followed by TSM Entity with 52 points (27 kill pts, 25 position pts), Fnatic (49 pts), Celtz (43 pts) and Powerhouse (43 pts).", "url": "https://www.indiatoday.in/sports/gaming/story/india-today-league-itpubl-pubg-mobile-invitational-day-1-match-reports-soul-celtz-mayhem-powerhouse-fnatic-1670248-2020-04-23", "urlToImage": null, "publishedAt": "2020-04-23T13:29:55Z", "content": "Team SouL topped the standings after 4 matches on Day 1 of the India Today League PUBG Mobile Invitational tournament without even winning a single Chicken Dinner on Thursday.\r\nSouL finished with 61 points with 31 kill points and 30 position points. TSM Entit… [+3232 chars]"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Gill Clark", "title": "Luiz Felipe Scolari tells Neymar to go back to Barcelona - Barca Blaugranes", "description": "The former Brazil boss has offered his thoughts", "url": "https://www.barcablaugranes.com/fc-barcelona-transfer-rumors-news/2020/4/23/21232411/luiz-felipe-scolari-tells-neymar-to-go-back-to-barcelona", "urlToImage": null, "publishedAt": "2020-04-23T12:10:53Z", "content": "Former Brazil manager Luiz Felipe Scolari has told Neymar its time to leave Paris Saint-Germain and return to Barcelona.\r\nThere has been renewed speculation the Brazilian will head back to the Camp Nou in the summer transfer window after three seasons in Ligu… [+543 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Rishi Karthikeyan", "title": "“I Needed To Win It” – Stan Wawrinka On Beating Novak Djokovic At The Australian Open - Essentially Sports", "description": "Recently, Stan Wawrinka had a chat with Chris Evert where he talked about his win at the 2014 Australian Open. Check out what he said.", "url": "https://www.essentiallysports.com/i-needed-to-win-it-stan-wawrinka-on-beating-novak-djokovic-at-the-australian-open-atp-tennis-news/", "urlToImage": null, "publishedAt": "2020-04-23T11:36:00Z", "content": "2014 was just another year for most of us but not for Stan Wawrinka. 2014 was the year he won his first grand slam at the Australian Open and became a major figure on the ATP tour. He recently talked about his victory there with Chris Evert. Check out what he… [+1360 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘Had stuffed up for RCB two years ago’: Shane Watson recalls redemptive ton for CSK in 2018 final - Hindustan Times", "description": "CSK, who were banned from the tournament for two years after a corruption scandal, were returning to the franchise, and were vying for the title.", "url": "https://www.hindustantimes.com/cricket/had-stuffed-up-for-rcb-two-years-ago-shane-watson-recalls-redemptive-ton-for-csk-in-2018-final/story-GAXdhzjfHZ8mrY6oEo1hrI.html", "urlToImage": null, "publishedAt": "2020-04-23T10:37:16Z", "content": "Former Australia batsman Shane Watson on Thursday recalled his match-winning century for Chennai Super Kings in the Indian Premier League 2018 final. CSK, who were making a return to IPL after completing a two-year ban were vying to win the title. After winni… [+1895 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Don’t think cricket boards can survive for long like this: Rameez Raja - India Gone Viral", "description": "Home / Cricket / Don’t think cricket boards can survive for long like this: Rameez Raja Former Pakistan captain-turned-commentator Rameez Raja believes boards cannot survive for long without resuming", "url": "https://indiagoneviral.com/sports/2020/04/23/dont-think-cricket-boards-can-survive-for-long-like-this-rameez-raja/38665/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-23T10:10:43Z", "content": "Home / Cricket / Dont think cricket boards can survive for long like this: Rameez RajaFormer Pakistan captain-turned-commentator Rameez Raja believes boards cannot survive for long without resuming cricket and urged the PCB to hold talks with other associatio… [+2011 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Mrigank Pandey", "title": "Shikhar Dhawan plays Quarantine Premier League with son Zoravar at home; watch video - Republic World - Republic World", "description": "Shikhar Dhawan would be vital to the Delhi Capitals' top order during IPL 2020. The fate of the tournament is now unknown as the India lockdown continues.", "url": "https://www.republicworld.com/sports-news/cricket-news/shikhar-dhawan-plays-quarantine-premier-league-with-son-zoravar-watch.html", "urlToImage": null, "publishedAt": "2020-04-23T08:31:16Z", "content": "If normal circumstances persisted at present, Shikhar Dhawan would be travelling around with the Delhi Capitals on the team's quest for its first-ever IPL trophy. But the circumstances today are far from normal as the coronavirus pandemic is tightening its gr… [+1882 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "India's batting was more powerful than ours on paper, but they played for themselves: Inzamam-ul-Haq - India Today", "description": "Inzamam-ul-Haq claimed that Indian batsmen scored hundreds but played mainly for themselves whereas Pakistani batters scored every run for the team whenever they played together.", "url": "https://www.indiatoday.in/sports/cricket/story/indian-batsmen-scored-hundreds-for-themselves-says-inzamam-ul-haq-india-vs-pakistan-cricket-1670107-2020-04-23", "urlToImage": null, "publishedAt": "2020-04-23T08:07:03Z", "content": "Former Pakistan captain Inzamam-ul-Haq believes that Indian batsmen he played against scored hundreds for themselves instead of the team while the players from his side were exactly the opposite.\r\nInzamam was speaking to Ramiz Raja on his Youtube channel, lis… [+1286 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "No cricket in India in the near future: Ganguly - Tamil News - IndiaGlitz.com", "description": "While the ICC and BCCI have been deliberating over the fate of the T20 World Cup that has been scheduled to take place from October 18", "url": "https://www.indiaglitz.com/bcci-president-sourav-ganguly-no-cricket-in-india-near-future-cant-risk-human-lives-icc-t20-world-cup-ipl-2020-tamil-news-258758", "urlToImage": null, "publishedAt": "2020-04-23T07:21:34Z", "content": "While the ICC and BCCI have been deliberating over the fate of the T20 World Cup that has been scheduled to take place from October 18 to November 15 in Australia and the IPL 2020 that was rescheduled to begin on April 15 respectively, BCCI's president Sourav… [+1349 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "I probably didn’t need to pull out of IPL: Chris Woakes - Hindustan Times", "description": "Woakes was bought for Rs 1.5 crore by Delhi Capitals at the IPL auction last year, but pulled out of the tournament saying that he wanted to stay fresh for England’s home Test summer, which is also currently on hold due to the pandemic.", "url": "https://www.hindustantimes.com/cricket/i-probably-didn-t-need-to-pull-out-of-ipl-chris-woakes/story-lheL53Us3IP38ftSquI3sK.html", "urlToImage": null, "publishedAt": "2020-04-23T06:45:25Z", "content": "England all-rounder Chris Woakes has revealed that he pulled out of this year’s IPL primarily to be with his pregnant wife but need not have officially announced his withdrawal from the event, which was suspended indefinitely due to the coronavirus pandemic.\r… [+2753 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "This day, 7 years ago: Chris Gayle hits fastest hundred in cricket history during IPL - India Today", "description": "During IPL 2013, Chris Gayle slammed 66-ball 175 that included 17 sixes and 13 boundaries which took RCB to a record-breaking 263/5 in 20 overs against Pune Warriors.", "url": "https://www.indiatoday.in/sports/cricket/story/on-this-day-chris-gayle-hits-fastest-hundred-cricket-history-highest-ipl-score-1670030-2020-04-23", "urlToImage": null, "publishedAt": "2020-04-23T05:09:23Z", "content": "On April 23, 2013, Chris Gayle broke the record for the fastest hundred in the history of cricket with his 30-ball hundred during the IPL clash between Royal Challengers Bangalore and Pune Warriors. The West Indian remained unbeaten on 175 that still holds th… [+1313 chars]"}, {"source": {"id": null, "name": "Bangkokpost.com"}, "author": "Bangkok Post Public Company Limited", "title": "Players back Federer over tennis merger as Kyrgios hits out - Bangkok Post", "description": "PARIS - WTA founder Billie Jean King and Rafael Nadal led a wave of support on Thursday for Roger Federer's suggestion that \"now is the time\" to merge the men's and women's governing bodies, while tennis is at a standstill because of the coronavirus pandemic.", "url": "https://www.bangkokpost.com/world/1906020/players-back-federer-over-tennis-merger-as-kyrgios-hits-out", "urlToImage": null, "publishedAt": "2020-04-23T04:45:00Z", "content": "PARIS - WTA founder Billie Jean King and Rafael Nadal led a wave of support on Thursday for Roger Federer's suggestion that \"now is the time\" to merge the men's and women's governing bodies, while tennis is at a standstill because of the coronavirus pandemic.… [+3342 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "Smith took the 'sandpaper gate' blame to save his team: Flintoff - Cricbuzz - Cricbuzz", "description": "Smith, Warner and Bancroft subsequently received bans from Cricket Australia for their roles in the ball-tampering fiasco", "url": "https://www.cricbuzz.com/cricket-news/112913/smith-took-the-sandpaper-gate-blame-to-save-his-team-flintoff", "urlToImage": null, "publishedAt": "2020-04-23T03:46:31Z", "content": "Smith, Warner and Bancroft subsequently received bans from Cricket Australia for their roles in the ball-tampering fiasco © AFP\r\nAndrew Flintoff, England's former all-rounder, believes that the entire Australian team were involved in the infamous 'sandpaper g… [+1825 chars]"}, {"source": {"id": null, "name": "Nst.com.my"}, "author": "Fabian Peter", "title": "Badminton in 2 hours Badminton won't be so smashing anymore - New Straits Times", "description": "Badminton will lose its identity if too many changes are introduced.", "url": "https://www.nst.com.my/sports/badminton/2020/04/586790/badminton-wont-be-so-smashing-anymore", "urlToImage": null, "publishedAt": "2020-04-23T02:40:01Z", "content": null}]}