{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Crictracker.com"}, "author": "https://www.facebook.com/contact.akashghosh", "title": "Facing Jasprit Bumrah or bowling to Virat Kohli? Ellyse Perry makes her pick - CricTracker", "description": "Recently, Australian all-rounder Ellyse Perry had a session with TV presenter Ridhima Pathak where she discussed several aspects of the game and also", "url": "https://m.crictracker.com/facing-jasprit-bumrah-or-bowling-to-virat-kohli-ellyse-perry-makes-her-pick/", "urlToImage": "https://www.crictracker.com/wp-content/uploads/2020/05/Virat-Kohli-Ellyse-Perry-and-Jasprit-Bumrah.jpg", "publishedAt": "2020-05-04T08:32:26Z", "content": "Virat Kohli, Ellyse Perry and Jasprit Bumrah. (Photo Source: Twitter)\r\nDue to the coronavirus threat, no sporting events are taking place across the globe. The COVID-19 scare has now restricted players from coming up and talking to the media as well. However,… [+2271 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Adam Shergold for MailOnline", "title": "Neymar 'willing to accept 50 per cent wage cut' to force through Barcelona move - Daily Mail", "description": "The Brazilian star has been regularly linked with a return to the Nou Camp though PSG's £175million asking price was likely to prove a stumbling block. But Neymar will make a financial sacrifice.", "url": "https://www.dailymail.co.uk/sport/football/article-8283761/Neymar-willing-accept-50-cent-wage-cut-force-Barcelona-move.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/04/07/27971922-0-image-a-46_1588574992122.jpg", "publishedAt": "2020-05-04T08:26:48Z", "content": "Neymar is reportedly willing to accept a 50 per cent wage cut to secure a summer move from Paris Saint-Germain back to Barcelona.\r\nThe Brazilian star has been regularly linked with a return to the Nou Camp though PSG's £175million asking price was likely to p… [+2327 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Rohit Sharma abuses fans for asking illogical questions during recent Instagram live chat - Republic World - India Gone Viral", "description": "Cricket News Rohit Sharma was talking with India teammate Mohammad Shami on Instagram live when the session was brought to an abrupt end because of network issues. Written By Jatin Malu | Mumbai | Upd", "url": "https://indiagoneviral.com/sports/2020/05/04/rohit-sharma-abuses-fans-for-asking-illogical-questions-during-recent-instagram-live-chat/50115/india-gone-viral/", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/qoefcjwslj1sscdo_1588543226.jpeg?tr=w-812,h-464", "publishedAt": "2020-05-04T08:10:30Z", "content": "The coronavirus pandemic has brought life to a standstill across the world. All the major sports tournaments have been cancelled for quite some time now and it doesn’t look like the sporting action will resume anytime soon. The cricketing community is also qu… [+2108 chars]"}, {"source": {"id": null, "name": "Thenewsopediaindia.co.in"}, "author": "rishixkumar00", "title": "On this day: Pakistan’s Sohail Tanvir set an IPL bowling record that stood for over a decade - The Newsopedia", "description": "By: Sports Desk | Published: May 4, 2020 11:15:45 am Sohail Tanvir finished as highest wicket-taker in IPL 2008 (Express Archive) On this day, 13 years ago, Pakistan fast", "url": "https://www.thenewsopediaindia.co.in/news/sports/on-this-day-pakistans-sohail-tanvir-set-an-ipl-bowling-record-that-stood-for-over-a-decade/", "urlToImage": "https://images.indianexpress.com/2020/05/Sohail-Tanvir-Archive.jpg?w=759", "publishedAt": "2020-05-04T07:35:10Z", "content": "Sohail Tanvir finished as highest wicket-taker in IPL 2008 (Express Archive)\r\nOn this day, 13 years ago, Pakistan fast bowler Sohail Tanvir set a record in Indian Premier Leagues (IPL) inaugural edition that stood for more almost 11 years. The left-arm wrong-… [+3178 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "All-time KKR Playing XI: Andre Russell, Sunil Narine blind picks, toss-up for all-rounders role - India Today", "description": "While Gautam Gambhir doubles up as opener and captain, the bowling options in our all-time best KKR XI might surprise you.", "url": "https://www.indiatoday.in/sports/cricket/story/all-time-kkr-team-11-ipl-gambhir-russell-narine-karthik-1674138-2020-05-04", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/DQ0Q3575-647x363.jpeg?5GRnCK.ytBOm8no28vRXuFXUbdEnM.Pb", "publishedAt": "2020-05-04T07:34:54Z", "content": "With 2 IPL titles under their belt, Kolkata Knight Riders (KKR) are the 3rd most successful team in the tournament history behind leaders Mumbai Indians and Chennai Super Kings. While KKR hung around in the bottom rung in the initial 3 seasons of the IPL, sin… [+3957 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Fate of the European Super League will define the future of football - Goal.com", "description": "Stephan El Shaarawy confirmed he was close to returning to Roma in January in a bid to earn a place in Italy's squad for the European Championship.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2020-05-04T07:00:00Z", "content": "More"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Suresh Raina explains difference between Sachin Tendulkar and Virat Kohli - Hindustan Times", "description": "Suresh Raina opened about his experience of playing with both Sachin Tendulkar and Virat Kohli explained how differently the two crickets approach the game.", "url": "https://www.hindustantimes.com/cricket/suresh-raina-explains-difference-between-sachin-tendulkar-and-virat-kohli/story-XZ84QPGfB9nP9GXvJzQFLI.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/04/Pictures/britain-england-india-cricket_ce602cbe-8dd0-11ea-85c6-561c42737975.jpg", "publishedAt": "2020-05-04T06:47:52Z", "content": "Virat Kohli and Sachin Tendulkar - there are only a few bigger names than these two in Indian cricket. While Kohli defines the modern era of Indian cricket - Tendulkar brings back memories of the golden age of Indian cricket. Suresh Raina, who was part of Ind… [+1391 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "We took Bedi, Prasanna to the cleaners; robbed them: Javed Miandad recounts India’s 1978-79 tour to... - Hindustan Times", "description": "Pakistan won the three-match Test series 2-0 and both Miandad and Abbas were severe against the famous Indian spin troika - Bedi, Prasanna and Chandrasekhar.", "url": "https://www.hindustantimes.com/cricket/we-took-bedi-prasanna-to-cleaners-robbed-them-javed-miandad-recounts-india-s-1978-79-tour-to-pakistan/story-xq2ifjLCYaCceXgeKrEcwJ.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/04/Pictures/_8bc0738c-8dc1-11ea-85c6-561c42737975.jpg", "publishedAt": "2020-05-04T06:32:39Z", "content": "Recounting India’s tour of Pakistan in 1978-79, former Pakistan captain and coach Javed Miandad said tackling the famous Indian spinners of that time was a cakewalk for them and in fact, the likes of Bishan Singh Bedi, Bhagwath Chandrasekhar and Erapalli Pras… [+3161 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "Kohli, Rohit, Sania take part in online concert to raise funds for COVID-19 pandemic - Hindustan Times", "description": "The proceeds from the concert will go to the India COVID Response Fund set up by GiveIndia, a donation platform.", "url": "https://www.hindustantimes.com/cricket/kohli-rohit-sania-take-part-in-online-concert-to-raise-funds-for-covid-19-pandemic/story-b1rjxD39vZhbH4Hg5gk9PL.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/04/Pictures/icc-cricket-awards-2020_9cd5b26c-8db8-11ea-85c6-561c42737975.jpg", "publishedAt": "2020-05-04T06:23:39Z", "content": "India skipper Virat Kohli, limited overs vice-captain Rohit Sharma and tennis star Sania Mirza were among sports personalities, who took part in an online concert to raise funds to fight the COVID-19 pandemic, which has killed over 2 lakh people globally.\r\n A… [+955 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Abhishek Bharadwaj", "title": "“Mercedes Will Sell Their Team to Stroll”- Jordan Makes a Bold F1 Prediction - Essentially Sports", "description": "Former F1 team principal Eddie Jordan believes Mercedes will exit the sport in 2 years , with Lawrence Stroll taking over the team.", "url": "https://www.essentiallysports.com/f1-news-mercedes-will-sell-their-team-to-stroll-jordan-makes-a-bold-f1-prediction/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200504114059/merc-20.jpg", "publishedAt": "2020-05-04T06:19:00Z", "content": "Former F1 team principal Eddie Jordan believes Mercedes, Renault, and Honda will leave Formula 1 in 2 years. According to Jordan, Mercedes will sell its team to Canadian billionaire Lance Stroll. Additionally, Eddie believes the Mercedes name will live on F1 … [+2179 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "Players fixed before me, even after me, should’ve got a second chance: Mohammad Asif - Hindustan Times", "description": "Asif, banned for seven years for his role in the 2010 spot-fixing scandal during Pakistan’s tour of England, said he should have got a second chance like many others, whom he did not name.", "url": "https://www.hindustantimes.com/cricket/players-fixed-before-me-even-after-me-should-ve-got-a-second-chance-mohammad-asif/story-J6QUMU0RNAK7mXwsBAmDjI.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/04/Pictures/pakistan-v-australia-2nd-test-day-three_d53253be-8dcb-11ea-85c6-561c42737975.jpg", "publishedAt": "2020-05-04T05:55:49Z", "content": "Tainted former Pakistan pacer Mohammad Asif says he wasn’t the first nor would be the last to have indulged in spot-fixing and should have been treated better by his country’s Cricket Board, which gave “everyone a second chance” except for him.\r\n Asif was ban… [+3203 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Let's do Insta: Nick Kyrgios asks Rafael Nadal for video chat despite bitter on-court rivalry - dineshr", "description": "With the tennis season being suspended until at least July 13, players are taking to social media to interact with each other and are also conducting live video sessions on Instagram.", "url": "https://www.indiatoday.in/sports/tennis/story/nick-kyrgios-invites-rafael-nadal-for-live-instagram-session-despite-bitter-on-court-relation-1674102-2020-05-04", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/nadal-647x363.png?5bCFlqvrGa8RbHUQXTM3TiVGGWxGRq6S", "publishedAt": "2020-05-04T05:43:05Z", "content": "Nick Kyrgios and Rafael Nadal have had a hostile relationship on the court in the past but it seems like the Australian tennis star is ready to put their bitter rivalry behind as he has invited world No.2 for a live Instagram session.\r\nThe coronavirus outbrea… [+1647 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Akshat Gaur", "title": "Mohammad Yousuf names his all-time favourite cricketers; picks the best captain in white-ball cricket at... - The Cricket Times", "description": "Several countries are facing lockdown due to the spread of coronavirus which has been declared as a pandemic by WHO. In the meantime, cricketers are trying different ways to interact with their fans via social media platforms. Some are taking part in live cha…", "url": "https://crickettimes.com/2020/05/mohammad-yousuf-names-his-all-time-favourite-cricketers-picks-the-best-captain-in-white-ball-cricket-at-present/", "urlToImage": "https://crickettimes.com/wp-content/uploads/2020/05/Mohammad-Yousuf-picks-his-favourite-captain.jpg", "publishedAt": "2020-05-04T05:21:04Z", "content": "Several countries are facing lockdown due to the spread of coronavirus which has been declared as a pandemic by WHO. In the meantime, cricketers are trying different ways to interact with their fans via social media platforms. \r\nSome are taking part in live c… [+1974 chars]"}, {"source": {"id": null, "name": "Thenews.com.pk"}, "author": "Web  Desk", "title": "DJ Bravo working on a song for MS Dhoni: Windies cricketer tells Sunny Leone - The News International", "description": "Sunny Leone was let in on a special surprise on Indian cricket champ MS Dhoni by DJ Bravo", "url": "https://www.thenews.com.pk/latest/654020-dj-bravo-working-on-a-song-for-ms-dhoni-windies-cricketer-tells-sunny-leone", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2020-05-04/l_654020_093851_updates.jpg", "publishedAt": "2020-05-04T04:54:25Z", "content": "B-Town diva Sunny Leone and West Indies cricketer DJ Bravo gushed over Indian cricket champ MS Dhoni as the actor was told a special surprise is in store for the Indian batsman.\r\nDuring an Instagram Live session, Sunny was told by Dwayne Bravo, former captain… [+599 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Anirudh Singh", "title": "Gautam Gambhir picks his all-time India Test XI; names Anil Kumble... - The Cricket Times", "description": "Former India opener Gautam Gambhir has been quite vocal about various issues on social media these days. The BJP MP from East Delhi has been at the forefront of helping out the needy suffering amid Coronavirus outbreak. Gambhir had a fulfilling career from 20…", "url": "https://crickettimes.com/2020/05/gautam-gambhir-picks-his-all-time-india-test-xi-names-anil-kumble-captain/", "urlToImage": "https://crickettimes.com/wp-content/uploads/2020/05/gautam-gambhir.jpg", "publishedAt": "2020-05-04T03:58:23Z", "content": "Former India opener Gautam Gambhir has been quite vocal about various issues on social media these days. The BJP MP from East Delhi has been at the forefront of helping out the needy suffering amid Coronavirus outbreak.\r\nGambhir had a fulfilling career from 2… [+2301 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "100 Hours 100 Stars: 'Was a team effort, proud moment' - Pujara recalls 2018 Test series win against Australia - Hindustan Times", "description": "100 Hours 100 Stars: Pujara further applauded India’s bowling effort throughout the Tour Down Under. “Our fast bowling was another important aspect of the series. They have improved a lot - and they got us over the line in Australia,” he added.", "url": "https://www.hindustantimes.com/cricket/100-hours-100-stars-was-a-team-effort-proud-moment-pujara-recalls-2018-test-series-win-against-australia/story-GkMpiCQYASfYC6YkOtakQP.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/03/Pictures/_77f5e468-8d30-11ea-8f61-783f666b6086.jpg", "publishedAt": "2020-05-04T03:34:57Z", "content": "India batsman Cheteshwar Pujara recalled the historic 2018 Test series win over Australia - India’s first Test win on Australian soil. Speaking on 100 Hours 100 Stars, an initiative started by Fever Network, Pujara called the series win a proud moment, and ad… [+1931 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "Pat Cummins reacts to David Warner's Tik-Tok... - The Cricket Times", "description": "Ever since the world of cricket took a back seat amid global lockdown, Australia's star opener David Warner has been extensively uploading hilarious videos on social media, notably, Tik-Tok. Warner also took the 'Switch' challenge with wife Candice, where he …", "url": "https://crickettimes.com/2020/05/pat-cummins-reacts-to-david-warners-tik-tok-videos/", "urlToImage": "https://crickettimes.com/wp-content/uploads/2020/05/Pat-Cummins-and-David-Warner.jpg", "publishedAt": "2020-05-04T03:12:57Z", "content": "Ever since the world of cricket took a back seat amid global lockdown, Australia’s star opener David Warner has been extensively uploading hilarious videos on social media, notably, Tik-Tok.\r\nWarner also took the ‘Switch’ challenge with wife Candice, where he… [+1873 chars]"}, {"source": {"id": null, "name": "Atptour.com"}, "author": null, "title": "Running With The Bull: Rafael Nadal, Roger Federer Polar Opposites In Set 2 | Infosys ATP Beyond The Numbers - ATP Tour", "description": "Infosys ATP Beyond The Numbers looks at the distance run in sets by Rafael Nadal, Roger Federer, Novak Djokovic and other top players.", "url": "https://www.atptour.com/en/news/nadal-infosys-beyond-the-numbers-may-2020", "urlToImage": "https://www.atptour.com/-/media/images/news/2020/05/04/01/00/nadal-bull-btn.jpg", "publishedAt": "2020-05-04T01:13:26Z", "content": "An Infosys ATP Beyond The Numbers analysis of distance run in the first two sets of matches by the current Top 10 in the FedEx ATP Rankings from 2018-2020 identifies that almost all run less in the second set than the first. Rafael Nadal leads the pack by run… [+3412 chars]"}, {"source": {"id": null, "name": "Chessbase.com"}, "author": "", "title": "Magnus Carlsen Invitational: Carlsen beats Nakamura to take first prize - Chessbase News", "description": "The first Magnus Carlsen Invitational was won by none other than world champion Magnus Carlsen. The Norwegian defeated Hikaru Nakamura 2½:1½ in a closely disputed final match. The confrontation was highly technical, as all the games went relatively deep into …", "url": "https://en.chessbase.com/post/magnus-carlsen-invitational-2020-final", "urlToImage": "https://en.chessbase.com/thumb/87496_l200", "publishedAt": "2020-05-04T00:43:59Z", "content": "Grinding it out\r\nMagnus Carlsen made a name for himself by outplaying elite opponents in apparently lifeless positions. After reaching the pinnacle of the game and especially after his World Championship match against Fabiano Caruana he turned to a different … [+5798 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "https://www.facebook.com/mrinal.kuniyal", "title": "Watch: Matt Kenseth Decides to Sit on Jimmy Johnson’s Lap in Between the Media Session - Essentially Sports", "description": "Matt Kenseth will be back on the NASCAR grid soon and with him comes his brand of humor. Watch his funny interview moments.", "url": "https://www.essentiallysports.com/nascar-news-watch-matt-kenseth-decides-to-sit-on-jimmy-johnsons-lap-in-between-the-media-session/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200503224425/NASCAR_Ganassi_Kenseth_Auto_Racing.0-1.jpg", "publishedAt": "2020-05-04T00:30:00Z", "content": "Matt Kenseth will be back on the NASCAR grid soon and with him comes his brand of humor. In an old media appearance, Kenseth interrupts the group mid-interview and sits on Jimmy Johnson‘s lap.\r\nThe video is from a 2011 interview featuring Kurt Busch, Jimmy Jo… [+1487 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Overpriced Sane is not an 'absolute top player', says former Bayern boss Heynckes - Goal India", "description": "Stephan El Shaarawy confirmed he was close to returning to Roma in January in a bid to earn a place in Italy's squad for the European Championship.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2020-05-03T22:40:08Z", "content": "More"}, {"source": {"id": null, "name": "Espn.in"}, "author": "Rob Dawson", "title": "Patrice Evra: Sir Alex Ferguson ripped us for not signing autographs - ESPN India", "description": "Patrice Evra also told Manchester United players to concentrate on winning, not on gaining social media followers.", "url": "https://www.espn.in/football/manchester-united/story/4091487/patrice-evra-sir-alex-ferguson-ripped-us-for-not-signing-for-fans", "urlToImage": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0503%2Fr695136_1296x729_16%2D9.jpg", "publishedAt": "2020-05-03T21:54:23Z", "content": "Patrice Evra has told Manchester United's current crop not to \"use\" the club to grow their social media followings and instead concentrate on winning trophies for the fans.\r\nEvra won 10 major honours during eight-and-a-half years at Old Trafford and has warne… [+2809 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "‘Rohit Sharma learnt about captaincy from MS Dhoni’: Ambati Rayudu - India Gone Viral", "description": "Home / Cricket / ‘Rohit Sharma learnt about captaincy from MS Dhoni’: Ambati Rayudu On being asked the difference in captaincy between Rohit and Dhoni, Rayudu said: “Dhoni has been captain for all of", "url": "https://indiagoneviral.com/sports/2020/05/04/rohit-sharma-learnt-about-captaincy-from-ms-dhoni-ambati-rayudu/49677/india-gone-viral/", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/03/Pictures/_7139e5ca-8d58-11ea-8bae-d48e751bd032.jpg", "publishedAt": "2020-05-03T20:16:35Z", "content": "Home / Cricket / Rohit Sharma learnt about captaincy from MS Dhoni: Ambati RayuduChennai Super Kings batsman Ambati Rayudu on Sunday said that Mumbai Indians skipper Rohit Sharma has learn about captaincy from MS Dhoni. Rohit is currently the most successful … [+1221 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Saketh Kandadai", "title": "“I Literally Had to Call my Mom”:Jordan’s Son Reveals How Fierce Michael Jordan Was Even as a Father - Essentially Sports", "description": "Marcus, Jeffrey, and Jasmine, children of Michael Jordan, made an appearance on a show to discuss the latest documentary on their father- The Last Dance", "url": "https://www.essentiallysports.com/nba-news-i-literally-had-to-call-my-mom-jordans-son-on-michael-jordan-being-fierce-even-against-him/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200504014041/d718e903930d224da40d34ffd83f0b59943751575321335.jpg", "publishedAt": "2020-05-03T20:11:00Z", "content": "Michael Jordan is known to be one of the most competitive players in the NBA. Watching him play would always give you the idea of how fierce he always was. So fierce that he didn’t even take his own children lightly.\r\nHe would treat us exactly the same as any… [+1996 chars]"}, {"source": {"id": null, "name": "Bavarianfootballworks.com"}, "author": "TomAdams71", "title": "Jose Mourinho admits Bayern Munich Champions League defeat in 2012 made him cry - Bavarian Football Works", "description": "It takes a lot to make the “Special One” shed tears, but Bayern made him do so in 2012.", "url": "https://www.bavarianfootballworks.com/2020/5/3/21245762/jose-mourinho-admits-bayern-munich-defeat-in-2012-real-madrid-champions-league-semi-finals-cry", "urlToImage": "https://cdn.vox-cdn.com/thumbor/2u2bwul0GWm8iQJmvy8EKHeds6Q=/0x0:2178x1140/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19940299/1209773333.jpg.jpg", "publishedAt": "2020-05-03T19:30:00Z", "content": "Jose Mourinho is one of the most interesting characters in world football. The Special One is one of the most well-decorated, well-respected managers in the game, but hes no stranger to unorthodox moments on the touchlines, in press conferences, and in interv… [+2177 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Dhruv George", "title": "“The White Helmet with the Flag is Now his Distinctive Mark” – Helmet Designer on Sebastian Vettel - Essentially Sports", "description": "Back in his Red Bull days, Sebastian Vettel was well-known for changing his helmet design at the drop of a hat. As a result, the FIA came up with..", "url": "https://www.essentiallysports.com/f1-news-the-white-helmet-with-the-flag-is-now-his-distinctive-mark-helmet-designer-on-sebastian-vettel/", "urlToImage": "https://www.essentiallysports.com/wp-content/uploads/skysports-sebastian-vettel_4816029.jpg", "publishedAt": "2020-05-03T19:09:00Z", "content": "Back in his Red Bull days, Sebastian Vettel was well-known for changing his helmet design at the drop of a hat. As a result, the FIA came up with the ‘Sebastian Vettel Rule’ forcing drivers to avoid changing their helmets too often.\r\nSo, drivers have to stick… [+1547 chars]"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Barca Blaugranes Staff", "title": "Ronald Koeman hospitalised with chest problems - Barca Blaugranes", "description": "The Netherlands boss has undergone a procedure in Amsterdam", "url": "https://www.barcablaugranes.com/2020/5/3/21245791/ronald-koeman-hospitalised-with-chest-problems", "urlToImage": "https://cdn.vox-cdn.com/thumbor/_SwbIfP-CXMSZ_IQ_kIC_0ZWnvU=/0x350:4873x2901/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19765039/1210163347.jpg.jpg", "publishedAt": "2020-05-03T18:33:45Z", "content": "Former Barcelona defender and current Netherlands boss Ronald Koeman has been hospitalised in Amsterdam with chest problems.\r\nThe 57-year-olds wife, Bartina, and agent Rob Jansen, have confirmed to De Telegraaf that he was rushed to hospital and underwent car… [+867 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Manchester United to remind Rojo of responsibilities after he broke lockdown rules - Goal India", "description": "Manchester City star Leroy Sane has yet to become an 'absolute top player' and is overpriced in the transfer market, according to former Bayern Munich manager Jupp Heynckes.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2020-05-03T18:25:00Z", "content": "More"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Juventus recalls players from abroad as Serie A prepares for return - Goal India", "description": "Stephan El Shaarawy confirmed he was close to returning to Roma in January in a bid to earn a place in Italy's squad for the European Championship.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2020-05-03T18:07:00Z", "content": "More"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "World Test Championship's points system is ridiculous: Holding - Times of India", "description": "Cricket News: West Indies bowling great Michael Holding has termed the World Test Championship's points system as \"ridiculous\", where some of Tests will be rendered", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/world-test-championships-points-system-is-ridiculous-holding/articleshow/75519568.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75519585,width-1070,height-580,imgsize-1222415,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-05-03T17:43:21Z", "content": "NEW DELHI: West Indies fast bowling great Michael Holding has termed the World Test Championship's points system as \"ridiculous\", where some of the Tests will be rendered inconsequential once teams realise that they can't finish in top two in the points table… [+1934 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": null, "title": "Ramnaresh Sarwan hits back at Chris Gayle for 'scandalous' allegations - ESPNcricinfo", "description": "Sarwan has \"categorically\" denied he had any role to play Gayle being released by the Tallawahs | https://www.espncricinfo.com/story/_/id/29121573/ramnaresh-sarwan-hits-back-chris-gayle-scandalous-allegations", "url": "https://www.espncricinfo.com/story/_/id/29121573/ramnaresh-sarwan-hits-back-chris-gayle-scandalous-allegations", "urlToImage": "https://img1.hscicdn.com/image/upload/f_auto/esci/i/cricket/cricinfo/1221959_1296x729.jpg", "publishedAt": "2020-05-03T17:42:52Z", "content": "Calling the allegations levelled against him by Chris Gayle as \"scandalous\", former West Indies batsman and Jamaica Tallawahs assistant coach Ramnaresh Sarwan has \"categorically\" denied he had any role to play in the former being released by the franchise for… [+5153 chars]"}, {"source": {"id": null, "name": "Juvefc.com"}, "author": "Administrator", "title": "Paratici: 'Fewer clubs to pay Pogba money' - JuveFC", "description": "Juventus Chief Football Officer Fabio Paratici believes the transfer market will change post-coronavirus resulting in fewer clubs able to pay big fees for likes of Paul Pogba.", "url": "https://www.juvefc.com/paratici-fewer-clubs-to-pay-pogba-money/", "urlToImage": "https://www.juvefc.com/wp-content/uploads/2016/04/pogba-1-1024x682.jpg", "publishedAt": "2020-05-03T17:38:43Z", "content": "Juventus Chief Football Officer Fabio Paratici believes the transfer market will change post-coronavirus resulting in fewer clubs able to pay big fees for likes of Paul Pogba.\r\nSpeaking to Sky Sport Italia, Paratici outlined the changes he believes will come … [+2481 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": null, "title": "Former Pakistan bowler says players underperformed in 2009 in a ‘conspiracy’ against captain Younis... - FUTURE TV", "description": "Former Pakistan fast bowler Rana Navd-ul-Hasan has reportedly revealed that some of the team’s players underperformed deliberately in the ODI", "url": "https://www.hindustantimes.com/cricket/former-pakistan-bowler-says-players-underperformed-in-2009-in-a-conspiracy-against-captain-younis-khan-report/story-OWFQxuTnQdfQfPFpKtWRON.html", "urlToImage": null, "publishedAt": "2020-05-03T16:35:01Z", "content": "Former Pakistan fast bowler Rana Navd-ul-Hasan has reportedly revealed that some of the teams players underperformed deliberately in the ODI series against New Zealand in the UAE back in 2009. According to a report in Cricket Pakistan, Rana told a Pakistani n… [+2209 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Sandra Brobbey", "title": "Cristiano Ronaldo proves he doesn’t skip leg day in pictures of mountain hike with Georgina and son Cristiano - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/football/11533702/cristiano-ronaldo-leg-day-georgina-rodriguez-mountain/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/05/SPORT-PREVIEW-ronaldo-hike.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-05-03T14:55:29Z", "content": "CRISTIANO RONALDO is keeping his muscular physique in peak condition.\r\nAnd he proved it in stunning mountain-top photos with his glamourous partner Georgina Rodriguez and son Cristiano Jr.\r\n Ronaldo and partner Georgina have been keeping themselves busy durin… [+2595 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "Cricket Australia secures USD 50 million loan as safety cover for India Tests: Report - Hindustan Times", "description": "According to a report published in ‘The Sydney Morning Herald’, stakeholders have been informed that the loan with the Commonwealth Bank is a “done deal”.", "url": "https://www.hindustantimes.com/cricket/cricket-australia-secures-usd-50-million-loan-as-safety-cover-for-india-tests-report/story-wFsOGQO2qWXQnBJ69AdpRO.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/03/26/Pictures/australia-press-conference_16f5bd6e-6f3f-11ea-9530-7febd198d354.jpg", "publishedAt": "2020-05-03T13:23:01Z", "content": "Cricket Australia has secured a loan of USD 50 million, an upfront payment as part of a larger USD 200 million credit, which it has sought to cover the losses if India fail to tour the country later this year due to the COVID-19 pandemic. According to a repor… [+1249 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Trends Desk", "title": "Banter between Netflix and Sunil Chhetri ends up with ‘double bonanza’ for fan - The Indian Express", "description": "And the exchange between the two, soon resulted in the fan not only getting a signed Jersey from Sunil Chhetri but also a free Netflix subscription.", "url": "https://indianexpress.com/article/trending/trending-in-india/exchange-between-netflix-and-sunil-chhetris-ends-up-with-fan-getting-a-signed-jersey-and-subcription-card-6391671/", "urlToImage": "https://images.indianexpress.com/2020/05/sunil-c_759_PTI-file.jpg?w=759", "publishedAt": "2020-05-03T12:53:38Z", "content": "By: Trends Desk | New Delhi | \r\nUpdated: May 3, 2020 6:18:50 pm\r\nThe exchange between the two soon went viral, triggering several reactions among followers who praised the gesture.(Source: PTI)With all sporting events cancelled around the world due to the ong… [+2737 chars]"}, {"source": {"id": null, "name": "Everythingbarca.com"}, "author": "Ranoveer Neogi", "title": "Sergio Aguero spills the beans on Lionel Messi’s future in Barcelona - Everything Barca", "description": "Sergio Aguero leaked information about Lionel Messi's future at Barcelona while on a live video game stream in Manchester. The speculation regarding Lionel...", "url": "https://everythingbarca.com/2020/05/03/sergio-aguero-spills-beans-lionel-messis-future-barcelona/", "urlToImage": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Feverythingbarca.com%2Fwp-content%2Fuploads%2Fgetty-images%2F2018%2F08%2F1210135840.jpeg", "publishedAt": "2020-05-03T12:48:37Z", "content": "The speculation regarding Lionel Messi leaving Barcelona has been going around for the last few months after the rumours state that the player has a strained relationship with debutant Frenkie de Jong, Marc Andre Ter Stegen and Josep Maria Bartomeu.\r\nMore fro… [+2011 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "ESPN", "title": "LIVE Transfer Talk: Barcelona to swoop on Manchester United target Jadon Sancho - ESPN India", "description": "Barcelona could ditch their pursuit of Neymar and Lautaro Martinez if Jadon Sancho is available at the right price. Transfer Talk has the latest.", "url": "https://www.espn.in/football/soccer-transfers/story/4091387/transfer-talk-barcelona-to-swoop-on-manchester-united-target-jadon-sancho", "urlToImage": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0518%2Fr544816_1296x729_16%2D9.jpg", "publishedAt": "2020-05-03T12:45:52Z", "content": "The coronavirus pandemic has made the summer transfer window uncertain, but here are the new rumours floating around Europe's big leagues and beyond.\r\nTOP STORY: Barca considering move for Sancho\r\nBarcelona are looking to raise cash to fund their summer spend… [+12338 chars]"}, {"source": {"id": null, "name": "Trendinindia.in"}, "author": "sourav chowdhury", "title": "When a first-class New Zealand cricketer regretted smashing Wasim Akram for 1st-ball boundary - Trendinindia", "description": "Former New Zealand first-class cricketer James Pamment didn't get a likelihood to play any worldwide match however then he certainly has obtained the style of what it's wish to face a world-class worldwide bowler like Wasim Akram.The former Auckland batsman h…", "url": "https://trendinindia.in/when-a-first-class-new-zealand-cricketer-regretted-smashing-wasim-akram-for-1st-ball-boundary/", "urlToImage": "https://trendinindia.in/wp-content/uploads/2020/05/When-a-first-class-New-Zealand-cricketer-regretted-smashing-Wasim-Akram.VzhMXR.webp", "publishedAt": "2020-05-03T12:44:16Z", "content": "Former New Zealand first-class cricketer James Pamment didn’t get a likelihood to play any worldwide match however then he certainly has obtained the style of what it’s wish to face a world-class worldwide bowler like Wasim Akram.\r\nThe former Auckland batsman… [+2757 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Current situation is like Test match on dangerous wicket: Sourav Ganguly on COVID-19 pandemic - Times of India", "description": "Cricket News: BCCI president Sourav Ganguly is deeply saddened and intimidated by the devastation caused because of the Covid-19 pandemic and has equated the unprec", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/situation-upsets-me-want-this-to-end-quickly-sourav-ganguly-on-covid-19/articleshow/75514593.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75514644,width-1070,height-580,imgsize-1439689,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-05-03T11:43:26Z", "content": "NEW DELHI: BCCI president Sourav Ganguly is deeply saddened and intimidated by the devastation caused because of the COVID-19 pandemic and has equated the unprecedented crisis to playing a Test match on a dangerous wicket.\r\nThe decorated former player opened … [+2690 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": null, "title": "‘Miss being called tilli from behind the stumps’ – Yuzvendra Chahal missing MS Dhoni amid lockdown - CricTracker", "description": "MS Dhoni hasn't played a competitive game since the World Cup semi-final last year in England. He was supposed to play in the Indian Premier League", "url": "https://m.crictracker.com/miss-being-called-tilli-from-behind-the-stumps-yuzvendra-chahal-missing-ms-dhoni-amid-lockdown/", "urlToImage": "https://www.crictracker.com/wp-content/uploads/2020/05/MS-Dhoni-and-Yuzvendra-Chahal.jpg", "publishedAt": "2020-05-03T10:21:33Z", "content": "MS Dhoni and Yuzvendra Chahal. (Photo Source: Twitter)\r\nMS Dhoni hasn’t played a competitive game since the World Cup semi-final last year in England. He was supposed to play in the Indian Premier League (IPL) this year which has now been postponed until furt… [+2149 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Reubyn Coutinho", "title": "“Don’t Try and be Fake Like Jones” – Israel Adesanya Offers Words of Wisdom to Aspiring Fighters - Essentially Sports", "description": "UFC Middleweight Champion Israel Adesanya has offered young fighters some advice and taken yet another shot at the \"fake\" Jon Jones.", "url": "https://www.essentiallysports.com/ufc-news-dont-try-and-be-fake-like-jones-israel-adesanya-offers-words-of-wisdom-to-aspiring-fighters/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200503151721/1136963510.jpg.0.jpg", "publishedAt": "2020-05-03T09:48:00Z", "content": "Israel Adesanya has had a stellar rise to the top of the Middleweight Division. As Champion, he constantly positions himself as one who is real. It is evident by his claims of finding it odd that reporters think he wanted Kamaru Usman to lose at UFC 235 so th… [+1943 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "ESPN", "title": "Man Citys De Bruyne I could leave if Champions League ban is upheld - ESPN India", "description": "Manchester City midfielder Kevin De Bruyne has hinted that he could leave the club if their two-year Champions League ban is upheld.", "url": "https://www.espn.in/football/manchester-city/story/4091394/man-citys-de-bruyne-i-could-leave-if-champions-league-ban-is-upheld", "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0503%2Fr695107_1296x729_16%2D9.jpg", "publishedAt": "2020-05-03T09:35:55Z", "content": "Manchester City midfielder Kevin De Bruyne has hinted that he could leave the club if their two-year Champions League ban is upheld.\r\nIn February, UEFA announced that City will be excluded from the Champions League for the 2020-21 and 2021-22 campaigns and ha… [+2484 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Shuvangi Sen Chaudhury", "title": "“When You’re No.1, You’re Always Hunted” – Justin Langer Comments On Australia Climbing The Ranking Charts - Essentially Sports", "description": "Justin Langer says that while the Australian team is happy to make it to the top, to continue to be there they need to beat the best - India.", "url": "https://www.essentiallysports.com/cricket-news-when-youre-no-1-youre-always-hunted-justin-langer-comments-on-australia-climbing-the-ranking-charts/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200503140053/2A896499-E57B-4507-801F-5C7DA72B1315.png", "publishedAt": "2020-05-03T08:32:00Z", "content": "The International Cricket Council released their annual rankings. Justin Langer coached Australian team has jumped its way to the top.The top three teams – Australia, New Zealand, and India are separated by a small margin of 2 points. Since 2003, this is just… [+1464 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "Roy ready to play 'behind closed doors' - Cricbuzz - Cricbuzz", "description": "The England opener recounted the experience of playing without spectators in the stands during this year's Pakistan Super League", "url": "https://www.cricbuzz.com/cricket-news/112978/roy-ready-to-play-behind-closed-doors", "urlToImage": "http://www.cricbuzz.com/a/img/v1/600x400/i1/c188827/ive-been-selected-to-play-t.jpg", "publishedAt": "2020-05-03T08:22:32Z", "content": "\"I've been selected (to play Tests) but I want to succeed. I've got to fight for my spot again and who knows how long that'll take\" - Roy © Getty\r\nIf England do get out on to the field this summer, the likelihood is that they will not be playing in front of a… [+5013 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "The Mountain from Game of Thrones deadlifts 501 kg, breaks world record - India Today", "description": "Actor Hafthor Bjornsson, who played The Mountain in Game of Thrones, broke the deadlift world record by lifting 501 kg.", "url": "https://www.indiatoday.in/trending-news/story/the-mountain-from-game-of-thrones-deadlifts-501-kg-breaks-world-record-1673885-2020-05-03", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/snippp-647x363.png?dGmo7372EMhj_3sdtHKhBiQ4evcsisCz", "publishedAt": "2020-05-03T08:09:49Z", "content": "The Mountain is at the top of the deadlift world. Game of Thrones actor Hafthor Bjornsson, who played Gregor The Mountain Clegane in the series, set a deadlift world record by lifting 501 kilograms (1,104 pounds) on Saturday.\r\nBjornsson, the 2018 World's Stro… [+889 chars]"}, {"source": {"id": null, "name": "Theprideoflondon.com"}, "author": "Gabe Henderson", "title": "Assessing Chelsea’s back line moving forward - The Pride of London", "description": "The back line for Chelsea remains a giant question mark heading into next season. With a plethora of options in the squad and even more transfer rumors, he...", "url": "https://theprideoflondon.com/2020/05/03/assessing-chelseas-back-line-moving-forward/", "urlToImage": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Ftheprideoflondon.com%2Fwp-content%2Fuploads%2Fgetty-images%2F2017%2F07%2F1195443803.jpeg", "publishedAt": "2020-05-03T07:51:09Z", "content": "Frank Lampard has used many combinations of players in defense this season—specifically at center back. The central defensive spots are seemingly there for the taking. Each individual has their flaws, but also presents a reasonable case to be the central defe… [+4559 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'Kane's head is not in the right place' - Berbatov urges Tottenham star to take up chance to join Man Utd - Goal India", "description": "Former Milan boss Carlo Ancelotti says supporters of the Rossoneri should not worry about a foreign coach coming in, amid speculation surrounding Ralf Rangnick.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2020-05-03T06:56:00Z", "content": "More"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘Cricket will literally be governed by government,’ Stuart Broad on cricket’s return after Covid-19... - Hindustan Times", "description": "England cricketer Stuart Broad had earlier said that chances of cricket returning soon are slim. However, Broad recently commented that he is ready to turn out for his country if ECB’s medical team deems it appropriate.", "url": "https://www.hindustantimes.com/cricket/cricket-will-literally-be-governed-by-government-stuart-broad-on-cricket-s-return-after-covid-19-pandemic/story-eAfd4afFDAm4Kxwt9is65M.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/03/Pictures/south-africa-v-england-fourth-test_411267c4-8d07-11ea-8bae-d48e751bd032.jpg", "publishedAt": "2020-05-03T06:35:10Z", "content": "With the whole sporting world is halted due to the novel coronavirus, several players are working out at home to keep themselves fit. In normal circumstances, cricketers would have been preparing for the Indian Premier League but Covid-19 has scrapped all tho… [+2974 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Umar Akmal threatened me so much that I had to leave series midway and flee to London: Zulqarnain Haider - India Today", "description": "Former Pakistan wicketkeeper-batsman Zulqarnain Haider has revealed that during the 2010 South Africa series in Dubai, he was asked by Umar Akmal to fix matches and later threatened by him and few others for not adhering to their instructions.", "url": "https://www.indiatoday.in/sports/cricket/story/zulqarnain-haider-says-umar-akmal-threatened-him-ran-to-london-psychological-pressure-match-fixing-1673861-2020-05-03", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/RTX1MO5M-647x363.png?m.RVhT2M4Gpt55.NBvWchpwuvCKFcW48", "publishedAt": "2020-05-03T06:10:54Z", "content": "Pakistan's former wicketkeeper-batsman Zulqarnain Haider has blamed Umar Akmal for his disappearing act during an ODI series against South Africa in 2010, saying he was threatened by the tainted player for not conniving with him to lose a match.\r\nZulqarnain c… [+1654 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": null, "title": "Mohammad Yousuf picks his fab four batsmen at the moment - CricTracker", "description": "Mohammad Yussuf, the former Pakistan cricketer also joined the bandwagon, who picked his fab-four batsmen during the question and answer round-up.", "url": "https://m.crictracker.com/mohammad-yousuf-picks-his-fab-four-batsmen-at-the-moment/", "urlToImage": "https://www.crictracker.com/wp-content/uploads/2020/04/Mohammad-Yousuf.jpg", "publishedAt": "2020-05-03T06:03:01Z", "content": "Mohammad Yousuf. (Photo by Matt King/Getty Images)\r\nCOVID-19 outbreak has left no option for cricketers but to stay inside their houses in quarantine. And, every player is finding it hard enough to pass their time in their own backyards. So, they have become … [+1985 chars]"}, {"source": {"id": null, "name": "Cricket.com.au"}, "author": "Louis Cameron", "title": "Breaking a hoodoo: '95 Windies tour oral history, Pt 1 - cricket.com.au", "description": "On the 25th anniversary of Australia lifting the Frank Worrell Trophy in 1995, we begin a three-part feature on how one dynasty ended and another began, as told by those who played in it", "url": "https://www.cricket.com.au/news/feature/oral-history-australia-west-indies-1995-caribbean-waugh-warne-taylor-healy-ambrose-lara-richardson/2020-05-03", "urlToImage": "https://www.cricket.com.au/~/-/media/News/2020/05/02GlennMcGrathPart1Main1995.ashx?w=1600", "publishedAt": "2020-05-03T05:17:56Z", "content": "The 1990s would prove to be a decade of immense change. The Cold War ended, the internet era began, and an emboldened Australian cricket team arrived in the Caribbean in March 1995 intent on ending the game's most iconic dynasty.\r\nA collection of a little mor… [+18580 chars]"}, {"source": {"id": null, "name": "Tennisworldusa.org"}, "author": "Jovica Ilic", "title": "Boris Becker: 'Maybe Roger Federer is enjoying as none of his records can't be..' - Tennis World USA", "description": "Tennis - The season has been on hold ever since early March due to a pandemic, with no clear return date", "url": "https://www.tennisworldusa.org/tennis/news/Roger_Federer/87246/boris-becker-maybe-roger-federer-is-enjoying-as-none-of-his-records-can-t-be-/", "urlToImage": "https://www.tennisworldusa.org/imgb/92216/boris-becker-maybe-roger-federer-is-enjoying-as-none-of-his-records-can-t-be-.jpg", "publishedAt": "2020-05-03T04:57:45Z", "content": "Instead of making the final preparations for the Masters 1000 events in Madrid and Rome, the players have been forced to sit at their homes ever since the first days of March, with the coronavirus pandemic putting everything on hold for the last two months.\r\n… [+1851 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Still feel I’m one of the top six batsmen: Usman Khawaja after Cricket Australia contract snub - Hindustan Times", "description": "“My playing against spin has been right up there as some of the best in the county. Bar maybe Steve Smith, who is an absolute genius, said Usman Khawaja", "url": "https://www.hindustantimes.com/cricket/still-feel-i-m-one-of-the-top-six-batsmen-usman-khawaja-after-cricket-australia-contract-snub/story-KxDh5dgdN9GcPBA6bwaBGL.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/03/Pictures/icc-cricket-world-cup-new-zealand-australia_aa180e4e-8cf4-11ea-bfc8-a8b22bcdbb5c.jpg", "publishedAt": "2020-05-03T04:49:46Z", "content": "Australia left-handed batsman Usman Khawaja, who was not given a central contract by Cricket Australia, on Saturday said that he still feels he is one of the top six batsmen. Speaking in an interview with Fox Sports, Khawaja said that he believes he can bounc… [+1594 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Press Trust Of India", "title": "Really hope there are not more leagues than international cricket after pandemic: Ashwin - Republic World - Republic World", "description": "India's premier off-spinner Ashwin doesn't want a post-COVID-19 world that is more conducive for organising T20 leagues at the expense of international cricket", "url": "https://www.republicworld.com/sports-news/cricket-news/really-hope-there-are-not-more-leagues-than-international-cricket-afte.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/bipcqw1rgmnjvt0j_1588474338.jpeg?tr=f-jpeg", "publishedAt": "2020-05-03T02:53:00Z", "content": "India's premier off-spinner Ravichandran Ashwin doesn't want a post-COVID-19 world that is more conducive for organising T20 leagues at the expense of international cricket. The fastest Indian to 350 Test wickets, the seasoned spinner said on Saturday he fors… [+3179 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "A message from Stokes, and the Dhoni consolation - Cricbuzz - Cricbuzz", "description": "Here we have Rahul Tripathi recounting the 'so close yet so far' experience that was the final of IPL 2017", "url": "https://www.cricbuzz.com/cricket-news/112977/a-message-from-stokes-and-the-dhoni-consolation", "urlToImage": "http://www.cricbuzz.com/a/img/v1/600x400/i1/c188825/in-my-first-innings-i-played.jpg", "publishedAt": "2020-05-03T01:01:58Z", "content": "\"In my first innings I played in the middle order only. Opening was a different kind of experience for me.\" ©AFP \r\nIn this new Cricbuzz series - Once upon an IPL final - we get some of the younger cricketers to retell tales of an IPL final they were part of. … [+7584 chars]"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Gill Clark", "title": "Spanish Prime Minister Pedro Sanchez hopes La Liga will resume soon - Barca Blaugranes", "description": "Clubs can resume training from next week", "url": "https://www.barcablaugranes.com/barcelona-la-liga/2020/5/3/21245304/spanish-prime-minister-pedro-sanchez-hopes-la-liga-will-resume-soon", "urlToImage": "https://cdn.vox-cdn.com/thumbor/xLP81qEIUC9bf5HES3qdi_SThtk=/0x207:2896x1723/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19939583/1204100378.jpg.jpg", "publishedAt": "2020-05-03T01:01:57Z", "content": "Spanish Prime Minister Pedro Sanchez says he hopes top-flight football can return soon but says its up to La Liga and the RFEF to decide when to resume the 2019-20 campaign.\r\nThe season has been suspended due to the coronavirus pandemic, but Spain is beginnin… [+569 chars]"}, {"source": {"id": null, "name": "Mundoalbiceleste.com"}, "author": null, "title": "Roberto Ayala: “Maradona was pure art, Messi is Speedy Gonzalez” - mundoalbiceleste.com", "description": "Roberto Ayala spoke with Fox Sports and gave his opinion on both Diego Maradona and Lionel Messi. Ayala played with both legendary players in the Argentina national team. Here's what he had to say: \"They are different. Diego for me was art in its purest form …", "url": "https://mundoalbiceleste.com/2020/05/02/roberto-ayala-maradona-was-pure-art-messi-is-speedy-gonzalez/", "urlToImage": "https://mundoalbiceleste.com/wp-content/uploads/2020/05/20200502_185457_compress18.jpg", "publishedAt": "2020-05-02T23:00:07Z", "content": "Roberto Ayala spoke with Fox Sports and gave his opinion on both Diego Maradona and Lionel Messi.\r\nAyala played with both legendary players in the Argentina national team. Here’s what he had to say:\r\n“They are different. Diego for me was art in its purest for… [+902 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Premier League bound for Perth? Australian city offers to host rest of season - Goal India", "description": "Former Milan boss Carlo Ancelotti says supporters of the Rossoneri should not worry about a foreign coach coming in, amid speculation surrounding Ralf Rangnick.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2020-05-02T22:56:24Z", "content": "More"}, {"source": {"id": null, "name": "Tennisworldusa.org"}, "author": "Simone Brugnoli", "title": "AC Milan manager: 'Roger Federer worked every day to become the GOAT' - Tennis World USA", "description": "The 20-time Grand Slam winner is fighting Rafael Nadal and Novak Djokovic to go down as the GOAT", "url": "https://www.tennisworldusa.org/tennis/news/Roger_Federer/87197/ac-milan-manager-roger-federer-worked-every-day-to-become-the-goat-/", "urlToImage": "https://www.tennisworldusa.org/imgb/92170/ac-milan-manager-roger-federer-worked-every-day-to-become-the-goat-.jpg", "publishedAt": "2020-05-02T22:35:39Z", "content": "AC Milan manager Stefano Pioli has compared his star Zlatan Ibrahimovic to tennis legend Roger Federer. Both players continue to express an incredible performance for their age, as well as being driven by a motivation that allows them to make a difference des… [+1689 chars]"}, {"source": {"id": null, "name": "Managingmadrid.com"}, "author": "Matt_Wiltse", "title": "Figo: “I played with a lot of great players, but I would always back Raul to score” - Managing Madrid", "description": "The Portuguese only had words of praise about his former Real Madrid teammate", "url": "https://www.managingmadrid.com/2020/5/3/21245382/figo-i-played-with-a-lot-of-great-players-but-i-would-always-back-raul-to-score", "urlToImage": "https://cdn.vox-cdn.com/thumbor/9xDbn3t1IU44-RzwKPS-JSTpUoQ=/0x136:2048x1208/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19939731/51506385.jpg.jpg", "publishedAt": "2020-05-02T22:34:28Z", "content": "Luis Figo took to Instagram Live to answer questions on his football career. During his time at Real Madrid, Figo formed a strong bond with Raul and their chemistry on the pitch was crucial to the clubs s success in the early 2000s. When asked about his the f… [+640 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Liverpool star Salah laughs off suggestion he could leave Anfield - Goal India", "description": "Manchester City star Leroy Sane has yet to become an 'absolute top player' and is overpriced in the transfer market, according to former Bayern Munich manager Jupp Heynckes.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2020-05-02T20:38:23Z", "content": "More"}, {"source": {"id": null, "name": "Dawn.com"}, "author": "AFP", "title": "India to step up battle for 2032 Olympics after pandemic: sports chief - DAWN.com", "description": "“We are serious and definitely pitching for the 2026 Youth Olympic Games and the 2032 Olympics,” says Narinder Batra.", "url": "https://www.dawn.com/news/1554060", "urlToImage": "https://i.dawn.com/large/2020/05/5eadb8e23f00c.jpg?r=794776869", "publishedAt": "2020-05-02T18:27:12Z", "content": "India will step up its battle to win the 2032 Olympic Games and other international events when the global coronavirus pandemic eases, its top sports leader Narinder Batra told AFP.\r\nTen years after hosting the Commonwealth Games, the Indian Olympic Associati… [+3046 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Karthik  Nair", "title": "MSK Prasad says he regrets veteran batsman Ambati Rayudus World Cup 2019 snub - Republic World - Republic World", "description": "Former chief selector MSK Prasad has revealed that he regrets veteran middle-order Ambati Rayudu's snub from Team India's World Cup 2019 squad", "url": "https://www.republicworld.com/sports-news/cricket-news/msk-prasad-on-ambati-rayudus-world-cup-2019-snub.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/wqnlselnyxjy45xd_1588437082.jpeg?tr=f-jpeg", "publishedAt": "2020-05-02T16:49:48Z", "content": "Former Indian chief selector MSK Prasad has said that he regrets axing veteran batsman Ambati Rayudu's name from Team India's World Cup 2019 squad. Heading into the showpiece event it was reportedly confirmed that the Andhra cricketer was in the scheme of thi… [+2222 chars]"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Gill Clark", "title": "Timo Werner ‘more tempted by a move abroad’ than joining Bayern Munich - Barca Blaugranes", "description": "Barcelona have been linked with the striker", "url": "https://www.barcablaugranes.com/fc-barcelona-transfer-rumors-news/2020/5/2/21245065/timo-werner-more-tempted-by-a-move-abroad-than-joining-bayern-munich", "urlToImage": "https://cdn.vox-cdn.com/thumbor/2njmBhwtvloA6Tae6o9l5x_-B2k=/0x0:2554x1337/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19939222/1209773301.jpg.jpg", "publishedAt": "2020-05-02T15:20:10Z", "content": "RB Leipzig striker Timo Werner, who is reportedly on Barcelonas radar ahead of the summer transfer window, says hed rather move abroad than join Bundesliga champions Bayern Munich.\r\nMundo Deportivo have reported recently that Barcelona have met with Werners f… [+1079 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Anirudh Singh", "title": "'Sanju udhar jaa' : Sanju Samson reveals his dream that came true under MS Dhoni's... - The Cricket Times", "description": "Wicketkeeper-batsman Sanju Samson has made giant strides in domestic cricket and the Indian Premier League (IPL). He is knocking the doors for a consistent run in the national team for a long period now. Despite being called up to the side for the first time …", "url": "https://crickettimes.com/2020/05/sanju-udhar-jaa-sanju-samson-reveals-his-dream-that-came-true-under-ms-dhonis-captaincy/", "urlToImage": "https://crickettimes.com/wp-content/uploads/2020/05/Sanju-Samson-MS-Dhoni.png", "publishedAt": "2020-05-02T14:28:40Z", "content": "Wicketkeeper-batsman Sanju Samson has made giant strides in domestic cricket and the Indian Premier League (IPL). He is knocking the doors for a consistent run in the national team for a long period now.\r\nDespite being called up to the side for the first time… [+1561 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Danny Ryan", "title": "Ranking every transfer in Premier League history over £50m from worst to best - GIVEMESPORT", "description": "Ranking every transfer in Premier League history over £50m from worst to best", "url": "https://www.givemesport.com/1566412-ranking-every-transfer-in-premier-league-history-over-50m-from-worst-to-best", "urlToImage": "https://gmsrp.cachefly.net/images/20/05/02/4122d04e1d2278dba8d25c6246f0128e/1200.jpg", "publishedAt": "2020-05-02T12:23:47Z", "content": "Transfer fees in the Premier League have increased rapidly over the past decade.\r\nIn the present day, the concept of a £50m deal is far from alien and it's almost at the point where the figure is commonplace.\r\nIt's highly likely in the near future that a Prem… [+9029 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Mike Tyson shows off explosive punches in training video as he prepares for boxing return - India Today", "description": "Mike Tyson's last professional fight was back in 2005 against Kevin McBride after which he called curtains to his 20-year-long decorated career.", "url": "https://www.indiatoday.in/sports/other-sports/story/mike-tyson-explosive-punches-training-video-boxing-comeback-after-15-years-1673634-2020-05-02", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/tyson-647x363.png?icrM_uDIsH4sO3h3yTU0oUYCl1DjUWQU", "publishedAt": "2020-05-02T10:13:33Z", "content": "Mike Tyson had announced his retirement 15 years ago but the heavyweight legend still seems to be in perfect shape for his sensational comeback for exhibition bouts.\r\nIn a recent video uploaded by Tyson on his official social media accounts, the 53-old could … [+1415 chars]"}, {"source": {"id": null, "name": "As.com"}, "author": "Sergio Santos", "title": "Real Madrid need to save money on wages to buy new players - AS English", "description": "Real Madrid planning on shedding five players as revenue losses kick in. They have to sell or loan players in order to bring in fresh talent.", "url": "https://en.as.com/en/2020/05/02/football/1588407594_401372.html", "urlToImage": "https://as01.epimg.net/futbol/imagenes/2020/05/01/primera/1588359164_781413_1588359468_noticia_normal.jpg", "publishedAt": "2020-05-02T09:48:14Z", "content": "Before anyone comes in, someone has to leave. That's the message coming from the Bernabéu ahead of the next transfer window. The club want to sell at least five players. There are four on the market: James, Bale, Lucas Vazquez and Mariano. They will let Marce… [+2144 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Scroll Staff", "title": "Rishabh Pant explains why MS Dhoni never offers complete solutions to his problems - Scroll.in", "description": "Pant says that Dhoni is a mentor to him and is always available to offer his advice.", "url": "https://scroll.in/field/960852/rishabh-pant-explains-why-ms-dhoni-never-offers-him-complete-solutions-to-his-problems", "urlToImage": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/124086-ggjombvwms-1563517613.jpg", "publishedAt": "2020-05-02T08:06:00Z", "content": "Calling Mahendra Singh Dhoni his mentor, wicketkeeper-batsman Rishabh Pant said the World Cup-winning skipper has his own way of helping the younger crop as he never provides a full solution to a problem, encouraging them to look for answers.\r\nPant, was the h… [+988 chars]"}]}