{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Romain Grosjean Reveals an Insider Analysis of Kimi Raikkonen and Fernando Alonso as Teammates - India Gone Viral", "description": "From the outset, Kimi Raikkonen and Fernando Alonso are exact opposites. The Finn seems cold, while the Spanish is a passionate driver. However, Romain Grosjean offers a striking perspective on both.", "url": "https://indiagoneviral.com/sports/2020/04/25/romain-grosjean-reveals-an-insider-analysis-of-kimi-raikkonen-and-fernando-alonso-as-teammates/42331/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T18:06:41Z", "content": "From the outset, Kimi Raikkonen and Fernando Alonso are exact opposites. The Finn seems cold, while the Spanish is a passionate driver. However, Romain Grosjean offers a striking perspective on both. He accepts the two are surprisingly the same somehow or ano… [+2002 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "TDR vs TCI Taipei T10 League Dream11 Fantasy Predictions & Playing XI Updates for Today's T10 Match - Apr 26th, 2020 - India Gone Viral", "description": "Preview Modified 25 Apr 2020, 13:54 IST Dream11 Taipei T10 League Fantasy TipsIn the first match of Taipei T10 League 2020's second day, the Taiwan Daredevils will take on the TCA Indians at the Yingf", "url": "https://indiagoneviral.com/sports/2020/04/25/tdr-vs-tci-taipei-t10-league-dream11-fantasy-predictions-playing-xi-updates-for-todays-t10-match/42333/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T18:06:30Z", "content": "” width=”800″&gt;\r\nDream11 Taipei T10 League Fantasy Tips\r\nIn the first match of Taipei T10 League 2020’s second day, the Taiwan Daredevils will take on the TCA Indians at the Yingfeng Ground in Songshan.\r\nThe Daredevils will be looking to bounce back to winn… [+2686 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Alec Fenn For Mailonline", "title": "PSG 'table bid for Paul Pogba and offer flop Angel Di Maria AND Julian Draxler' to Manchester United - Daily Mail", "description": "Pogba's future at United is uncertain after he revealed his desire to leave the club last summer and continued links with other European sides, as well as a lengthy absence with a mysterious ankle injury.", "url": "https://www.dailymail.co.uk/sport/football/article-8256663/PSG-table-bid-Paul-Pogba-offer-flop-Angel-Di-Maria-Julian-Draxler-Manchester-United.html", "urlToImage": null, "publishedAt": "2020-04-25T17:31:26Z", "content": "Paris Saint-Germain have reportedly made a bid for Manchester United's Paul Pogba but surprisingly offered Old Trafford flop Angel Di Maria as part of the deal.\r\nPogba's future at United is uncertain after he revealed his desire to leave the club last summer … [+2058 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘Since then I stay away from coffee,’ Hardik Pandya opens up on the ‘Koffee with Karan’ controversy - Hindustan Times", "description": "Hardik said on a lighter note that one cup of coffee proved very costly for him, referring to his controversial remark on TV show ‘Koffee With Karan’, which created a furore.", "url": "https://www.hindustantimes.com/cricket/since-then-i-stay-away-from-coffee-hardik-pandya-opens-up-on-the-koffee-with-karan-controversy/story-IBXLQ15vwDdElLh6IlC5hM.html", "urlToImage": null, "publishedAt": "2020-04-25T16:55:00Z", "content": "India all-rounder Hardik Pandya opened up for the first time on the Koffee With Karan episode that almost pushed his and teammate KL Rahul’s professional cricketing career on the brink. \r\nDuring an Instagram chat with Dinesh Karthik, Hardik also said on a lig… [+1207 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Have gone mad searching for it: Jofra Archer reveals he has lost his World Cup 2019 medal - India Today", "description": "England fast bowler Jofra Archer said he has been searching for his World Cup medal at his new place over the last week without much success.", "url": "https://www.indiatoday.in/sports/cricket/story/jofra-archer-world-cup-2019-medal-lost-searching-new-flat-super-over-final-1671093-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T16:38:48Z", "content": "England fast bowler Jofra Archer said he misplaced his World Cup 2019 medal after he shifted his flat recently. Archer, who played a key role in England's historic triumph, added he has 'gone mad' searching for it at his new place.\r\nJofra Archer revealed he h… [+1644 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "https://www.facebook.com/mrinal.kuniyal", "title": "Mclaren F1 Denies Receiving Any Aid From Liberty Media - Essentially Sports", "description": "McLaren F1 has denied receiving any payment from Liberty Media. Zak Brown says that the Formula 1 owners are offering assistance to 'certain teams'.", "url": "https://www.essentiallysports.com/f1-news-liberty-media-not-paying-mclaren-f1-any-money/", "urlToImage": null, "publishedAt": "2020-04-25T15:19:00Z", "content": "McLaren F1 has denied receiving any payment from Liberty Media. Team boss Zak Brown says that the Formula 1 owners are offering assistance to ‘certain teams’.\r\nMcLaren, CEO Zak Brown was talking to Motorsport-Total.com. He said, “We have not received any adva… [+1473 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Followed my heroes Vivian Richards and MS Dhoni: Kapil Dev on his lockdown look - India Today", "description": "Kapil Dev, who was known for his curls during his playing days, has always been open to trying new looks. The lockdown period in the country has given the legendary all-rounder the time to experiment with his looks.", "url": "https://www.indiatoday.in/sports/cricket/story/followed-my-heroes-vivian-richards-and-ms-dhoni-kapil-dev-on-his-lockdown-look-1671071-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T15:09:12Z", "content": "Former India captain and World Cup-winner Kapil Dev has revealed that his new lockdown look has been inspired by Vivian Richards and MS Dhoni. Kapil Dev said that he had seen MS Dhoni sporting bald look after 2011 World Cup and had thought that he will also d… [+1312 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "MS Dhoni and Rohit Sharma have similarities in their captaincy styles: Deepak Chahar - India Today", "description": "Highlighting the difference between MS Dhoni and Rohit Sharma's captaincy, India fast bowler Deepak Chahar said the former believes in not making changes if he finds a winning formula.", "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-rohit-sharma-captaincy-comparison-deepak-chahar-india-interview-1671066-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T15:09:09Z", "content": "India fast bowler Deepak Chahar said he sees a lot of similarities between MS Dhoni and Rohit Sharma's captaincy styles, saying both the India stars helped him flourish as a fast bowler at the international level.\r\nDeepak Chahar said both MS Dhoni and Rohit S… [+2349 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Anirudh Singh", "title": "Actress Nidhhi Agerwal clears the air about unfollowing KL Rahul on social... - The Cricket Times", "description": "Cricketers link-up with Bollywood actresses is very commonly seen days. Even though Virat Kohli and Anushka Sharma are right now termed as the 'power couple', there is much more to that. There have been many other successful couples and sad breakups seen by c…", "url": "https://crickettimes.com/2020/04/nidhhi-agerwal-clears-the-air-about-unfollowing-kl-rahul-on-social-media/", "urlToImage": null, "publishedAt": "2020-04-25T15:03:35Z", "content": "Cricketers link-up with Bollywood actresses is very commonly seen days. Even though Virat Kohli and Anushka Sharma are right now termed as the ‘power couple’, there is much more to that.\r\nThere have been many other successful couples and sad breakups seen by … [+1428 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Vinayak Manoj", "title": "“I Would Do it For the Winner of Anthony Joshua and Tyson Fury”- Former Champion Hints Boxing Return - Essentially Sports", "description": "David Haye revealed he is willing to make a return to the boxing ring to fight the next heavyweight champion, Tyson Fury or Anthony Joshua", "url": "https://www.essentiallysports.com/boxing-news-i-would-do-it-for-the-winner-of-anthony-joshua-and-tyson-fury-former-champion-hints-boxing-return/", "urlToImage": null, "publishedAt": "2020-04-25T15:02:00Z", "content": "Having ducked out of professional boxing back in 2018. ‘Hayemaker’ David Haye is seemingly thinking of making a return to the ring. However, he only wants to take on the best of the best, which is either Tyson Fury or Anthony Joshua.\r\nThe Londoner took up ret… [+2410 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "I was clueless on Test debut, thought had played my last game: Sachin Tendulkar - Times of India", "description": "Cricket News: In his first Test in 1989, Sachin Tendulkar was up against a Pakistan pace attack of Imran Khan, Wasim Akram & Waqar Younis. Recalling the outing, he", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/i-was-clueless-on-test-debut-thought-had-played-my-last-game-sachin-tendulkar/articleshow/75378166.cms", "urlToImage": null, "publishedAt": "2020-04-25T14:04:29Z", "content": "LONDON: Sachin Tendulkar says he was \"clueless\" on his Test debut and almost cried thinking it was all over for him.\r\nWhen he walked out for the last time 24 years later, Tendulkar would do so as a batting great with a record 200 Test appearances to his name.… [+2404 chars]"}, {"source": {"id": null, "name": "Trendinindia.in"}, "author": "sourav chowdhury", "title": "India Today League PUBG Mobile Invitational Day 3 wrap: TSM ENTITY top table with stunning show on Saturday - Trendinindia", "description": "India Today League PUBG Mobile Invitational is headed in direction of a gripping last day after three days of intense motion. TSM ENTITY, one in all India's top groups within the PUBG Mobile circuit, will head into the ultimate with a substantial lead on the …", "url": "https://trendinindia.in/india-today-league-pubg-mobile-invitational-day-3-wrap-tsm-entity-top-table-with-stunning-show-on-saturday/", "urlToImage": null, "publishedAt": "2020-04-25T13:30:49Z", "content": "India Today League PUBG Mobile Invitational is headed in direction of a gripping last day after three days of intense motion. TSM ENTITY, one in all India’s top groups within the PUBG Mobile circuit, will head into the ultimate with a substantial lead on the … [+3931 chars]"}, {"source": {"id": null, "name": "Dawn.com"}, "author": "AFP | Abu Bakar Bilal", "title": "Sana Mir announces retirement from international cricket - DAWN.com", "description": "Mir ends a glittering career that saw her become the most successful female spinner in one-day international history.", "url": "https://www.dawn.com/news/1552161", "urlToImage": null, "publishedAt": "2020-04-25T12:59:39Z", "content": "Former Pakistan women's captain Sana Mir announced retirement from international cricket on Saturday after a glittering career that saw her become the most successful female spinner in one-day international history.\r\nThe 34-year-old took the top spot in women… [+1413 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Too early to talk about playing 5 Tests in Australia: BCCI official - Hindustan Times", "description": "A BCCI official said that a decision on that can be taken at the right time and any planning at this stage would be too early in the wake of the pandemic.", "url": "https://www.hindustantimes.com/cricket/too-early-to-talk-about-playing-5-tests-in-australia-bcci-official/story-7EezwXRXeWtEuIBD0F6cpN.html", "urlToImage": null, "publishedAt": "2020-04-25T12:58:55Z", "content": "The outbreak of the coronavirus has seen the Australian government seal the international boundaries till September 30. But Cricket Australia is not only keen to conduct the T20 World Cup in October, but also have India travel Down Under for the bilateral ser… [+1881 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Vinayak Manoj", "title": "WATCH: UFC Drops a Chilling Promo For Tony Ferguson vs Justin Gaethje - Essentially Sports", "description": "Ahead of UFC 249, the promotion have dropped an insane video as an effort to promote the upcoming star studded event that will take place on May 9th.", "url": "https://www.essentiallysports.com/ufc-249-news-watch-ufc-drops-a-chilling-promo-for-tony-ferguson-vs-justin-gaethje/", "urlToImage": null, "publishedAt": "2020-04-25T12:45:00Z", "content": "With a lot of uncertainty looming over the future of the UFC lightweight division, a new promotional video for the headliner comes as a sign of relief for fans all over the world.\r\nGuaranteeing fireworks, the star-studded UFC 249 roster is one of the greatest… [+2051 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Freddie Keighley", "title": "Top 10 most iconic Premier League goal celebrations including Liverpool and Man Utd - Mirror Online", "description": "From camera kisses and trademark dances to knockout punches and emphatic top-off antics, the Premier League has seen some of the wildest and most iconic celebrations over the years", "url": "https://www.mirror.co.uk/sport/football/top-10-most-iconic-premier-21900920", "urlToImage": null, "publishedAt": "2020-04-25T12:30:46Z", "content": "A great goal should always be followed up with a great celebration - whether a player has just scored a stoppage-time winner to secure the league title or reached a personal landmark.\r\nAnd Premier League stars have regularly stepped up to the challenge of pro… [+7596 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Akshat Gaur", "title": "Top 5 batsmen with most runs in wins for India across... - The Cricket Times", "description": "India arose as a significant cricket-playing nation after the 1983 World Cup win. However, even before the mega event, Indian batsmen were always on top of their games, it's just as a team, the 1983 WC gave them global limelight. From the likes of CK Nayudu, …", "url": "https://crickettimes.com/2020/04/top-5-batsmen-with-most-runs-in-wins-for-india-across-formats/", "urlToImage": null, "publishedAt": "2020-04-25T12:29:29Z", "content": "India arose as a significant cricket-playing nation after the 1983 World Cup win. However, even before the mega event, Indian batsmen were always on top of their games, it’s just as a team, the 1983 WC gave them global limelight.\r\nFrom the likes of CK Nayudu,… [+4183 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Deepit Sharma", "title": "“He’s One of the Best in the World!”- Dana White Weighs in on Dominick Cruz vs Henry Cejudo - Essentially Sports", "description": "Dominick Cruz will make a much-awaited return to the octagon at UFC 249 on 9 May, and Dana White believes he is just as deserving of a title shot as always.", "url": "https://www.essentiallysports.com/ufc-news-hes-one-of-the-best-in-the-world-dana-white-weighs-in-on-dominick-cruz-vs-henry-cejudo/", "urlToImage": null, "publishedAt": "2020-04-25T12:29:00Z", "content": "Dominick Cruz associates with the UFC and MMA on many levels. His varied roles include appearing as a ringside commentator and a sports analyst at ESPN. However, as a fighter, he last made his appearance in December 2016.\r\nThe 35-year-old is a two-time Bantam… [+1993 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Shame I won't be returning to Chelmsford this year: Peter Siddle - Hindustan Times", "description": "Siddle first signed for the club in 2018 where he took 37 wickets. He then committed his future to Essex in 2019 by signing a two-year contract.", "url": "https://www.hindustantimes.com/cricket/shame-i-won-t-be-returning-to-chelmsford-this-year-peter-siddle/story-T0kBG7x3u3N62sFKP4rGIJ.html", "urlToImage": null, "publishedAt": "2020-04-25T12:26:26Z", "content": "Former Australian pacer Peter Siddle, whose contract with the Essex has been deferred until 2021, has said “it’s a shame he won’t be returning” to the club this year.\r\nOn Friday, Essex announced that Siddle will not join up with the side during the 2020 campa… [+1463 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nMatt Law,", "title": "Chelsea reject squad's offer of 10 per cent pay cut - Telegraph.co.uk", "description": "Club has told players to continue with their charitable donations while they try to strike an agreement over way forward on pay", "url": "https://www.telegraph.co.uk/football/2020/04/25/chelsea-reject-squads-offer-10-per-cent-pay-cut/", "urlToImage": null, "publishedAt": "2020-04-25T12:06:00Z", "content": "Chelsea have rejected the 10 per cent wage cut proposed by their first-team squad but negotiations are expected to continue during the coronavirus crisis.\r\nAs first revealed by Telegraph Sport, captain César Azpilicueta suggested a 10 per cent reduction in wa… [+1713 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Miscreants attempt to rob stumper Saha's Siliguri home, says relative - Hindustan Times", "description": "Saha, 35, lives in South Kolkata with his wife and children. The experienced stumper’s parents, who live in their Ward No.31 Shaktigarh area house in Siliguri, are at present staying with their son in Kolkata.", "url": "https://www.hindustantimes.com/cricket/miscreants-attempt-to-rob-stumper-saha-s-siliguri-home-says-relative/story-tRusZSKZV1FBBTmYrEWIlO.html", "urlToImage": null, "publishedAt": "2020-04-25T12:04:21Z", "content": "A relative of Wriddhiman Saha has alleged that a few miscreants tried to break into the India Test wicketkeeper’s ancestral home in Siliguri, North Bengal, on Friday in a bungled attempt to rob the place.\r\nSaha, 35, lives in South Kolkata with his wife and ch… [+1344 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Three Things We Want To See From the Kobe Bryant Documentary - India Gone Viral", "description": "‘The Last Dance,’ a ten-part documentary on Michael Jordan’s final season with the Chicago Bulls was released recently. Ever since the series claimed a massive following, fans have been chirping for a", "url": "https://indiagoneviral.com/sports/2020/04/25/three-things-we-want-to-see-from-the-kobe-bryant-documentary/42125/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T12:02:27Z", "content": "The Last Dance, a ten-part documentary on Michael Jordans final season with the Chicago Bulls was released recently. Ever since the series claimed a massive following, fans have been chirping for a similar documentary to be made on the legacy of the late Kobe… [+5755 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "REPORTS: US Open 2020 To Be Relocated To California - India Gone Viral", "description": "The biggest tennis stadium in the United States,  USTA Billie Jean King National Tennis Center has been temporarily converted into a hospital amid the coronavirus pandemic. More than 450 beds have bee", "url": "https://indiagoneviral.com/sports/2020/04/25/reports-us-open-2020-to-be-relocated-to-california/42128/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T12:02:12Z", "content": "The biggest tennis stadium in the United States,  USTA Billie Jean King National Tennis Center has been temporarily converted into a hospital amid the coronavirus pandemic. More than 450 beds have been laid down in the stadium and around 25,000 people are fed… [+1999 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "‘It still haunts us sometimes’: KL Rahul reveals which match gives him ‘nightmares’ - India Gone Viral", "description": "Home / Cricket / ‘It still haunts us sometimes’: KL Rahul reveals which match gives him ‘nightmares’ India’s star player KL Rahul got up close and personal with television presenter and commentator Su", "url": "https://indiagoneviral.com/sports/2020/04/25/it-still-haunts-us-sometimes-kl-rahul-reveals-which-match-gives-him-nightmares/42130/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T12:01:39Z", "content": "Home / Cricket / It still haunts us sometimes: KL Rahul reveals which match gives him nightmaresIndias star player KL Rahul got up close and personal with television presenter and commentator Suhail Chandhok in the fifth episode of The Mind Behind. Red Bull a… [+2906 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "Legalising ball tampering: Saliva is must and vaseline is no replacement, feel Ashish Nehra, Harbhajan Singh - Hindustan Times", "description": "Former India pacer Ashish Nehra and spinner Harbhajan Singh feel that saliva’s use in shining the ball is a “must”. Ex-opener Aakash Chopra, while beng open to the idea, wants to know where one can draw the line.", "url": "https://www.hindustantimes.com/cricket/legalising-ball-tampering-saliva-is-must-and-vaseline-is-no-replacement-feel-ashish-nehra-harbhajan-singh/story-6sGuYrV3wtqCeH94TJ9N9K.html", "urlToImage": null, "publishedAt": "2020-04-25T11:23:53Z", "content": "Saliva and sweat are components that cannot be entirely done away with, insist a few distinguished India cricketers, as the ICC contemplates legalising ball tampering post COVID-19 by using artificial substances to prevent virus spread. Former India pacer Ash… [+3372 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Dhruv George", "title": "Rubens Barrichello Accuses Williams F1 of Taking Wrong Decisions with Money - Essentially Sports", "description": "Recently, former F1 driver Rubens Barrichello appeared in a podcast and spoke on various topics of interest. Among them, he opened up on his Williams F1...", "url": "https://www.essentiallysports.com/f1-news-rubens-barrichello-accuses-williams-f1-of-taking-wrong-decisions-with-money/", "urlToImage": null, "publishedAt": "2020-04-25T10:46:00Z", "content": "Recently, former F1 driver Rubens Barrichello appeared in a podcast and spoke on various topics of interest. Among them, he opened up on his Williams F1 stint and reflected on its current sorry state. The Brazilian veteran revealed that he worked a lot on the… [+1641 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Washing vegetables more than I have washed my head: Suresh Raina on e-Agenda Aaj Tak - India Today", "description": "Suresh Raina and Harbhajan Singh were speaking about their life in the coronavirus lockdown while talking on e-Agenda Aaj Tak.", "url": "https://www.indiatoday.in/sports/cricket/story/suresh-rain-cleaning-toilets-washing-vegetables-more-than-i-have-ever-washed-my-head-humanity-harbhajan-singh-cricket-coronavirus-lockdown-pandemic-1670953-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T10:27:22Z", "content": "India bastman Suresh Raina was one of the first cricketers to contribute in the fight against the coronavirus pandemic in the country.\r\nThe swashbuckling left-hand batsman has also been very active on his social media handles and have spread out the messages … [+1206 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "ESPN", "title": "Coronavirus: Liverpool vs. Atletico Madrid to be investigated by council - ESPN India", "description": "Liverpool's vs. Atletico Madrid in the Champions League will be investigated regarding any impact it may have had on the spread of coronavirus.", "url": "https://www.espn.in/football/uefa-champions-league/story/4088954/coronavirus-liverpool-vs-atletico-madrid-to-be-investigated-by-council", "urlToImage": null, "publishedAt": "2020-04-25T10:21:19Z", "content": "Liverpool's match with Atletico Madrid in the Champions League on March 11 will be investigated by the city's council regarding any impact it may have had on the spread of coronavirus.\r\n-Stream new episodes of ESPN FC Monday-Friday on ESPN+- Stream every epis… [+2050 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Sancho is nowhere near Aguero, Higuain, Messi & Di Maria - Neville - Goal India", "description": "If the Bundesliga season got back underway tomorrow, RB Leipzig would be ready - according to U.S. national team midfielder Tyler Adams.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T10:18:00Z", "content": "More"}, {"source": {"id": null, "name": "Juvefc.com"}, "author": "juvefcdotcom", "title": "Cristiano Ronaldo will remain with Juventus - JuveFC", "description": "Cristiano Ronaldo will remain with Juventus until 2022, according to Tuttosport.", "url": "https://www.juvefc.com/cristiano-ronaldo-will-remain-with-juventus/", "urlToImage": null, "publishedAt": "2020-04-25T09:42:58Z", "content": "Cristiano Ronaldo will remain with Juventus until 2022, according to Tuttosport.\r\nThe 34-year-old has been with the Bianconeri for two seasons of his four-year contract after a big money move from Real Madrid in 2018.\r\nReports in Spanish and Italian press hav… [+409 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "‘You don’t want the fear,’ Yuvraj Singh explains why cricket should return only after Covid-19 is e... - Hindustan Times", "description": "Like other sports, international and domestic cricket too has been disrupted leading the national boards to contemplate resuming the game in empty stadiums, without fans.", "url": "https://www.hindustantimes.com/cricket/you-don-t-want-the-fear-yuvraj-singh-explains-why-cricket-should-return-only-after-covid-19-is-eradicated/story-7okHJdLw1JTTSzbxY9JJ6L.html", "urlToImage": null, "publishedAt": "2020-04-25T09:34:05Z", "content": "Former India star Yuvraj Singh wants cricket to resume only when the world becomes COVD-19 free as players’ health and safety should be paramount for the custodians of the game.\r\nLike other sports, international and domestic cricket too has been disrupted lea… [+1271 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "Dinesh Karthik picks his best IPL XI; expresses disappointment for not including MS Dhoni and R... - The Cricket Times", "description": "India wicket-keeper batsman Dinesh Karthik, recently picked his all-time T20 XI in the Indian Premier League (IPL). The only criterion for his selection was having played at least one game with the players. Karthik, renowned for his finishing abilities lower …", "url": "https://crickettimes.com/2020/04/dinesh-karthik-picks-his-best-ipl-xi-expresses-disappointment-for-not-including-ms-dhoni-and-r-ashwin/", "urlToImage": null, "publishedAt": "2020-04-25T09:33:01Z", "content": "India wicket-keeper batsman Dinesh Karthik, recently picked his all-time T20 XI in the Indian Premier League (IPL). The only criterion for his selection was having played at least one game with the players.\r\nKarthik, renowned for his finishing abilities lower… [+1972 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": null, "title": "‘He was a real pain in the back for us’ – Pat Cummins picks Cheteshwar Pujara as the toughest batsman to bowl - CricTracker", "description": "Pat Cummins, who is the World's number 1 Test bowler, recalled the painstaking series for Australia in 2018-19 season which India", "url": "https://m.crictracker.com/he-was-a-real-pain-in-the-back-for-us-pat-cummins-picks-cheteshwar-pujara-as-the-toughest-batsman-to-bowl/", "urlToImage": null, "publishedAt": "2020-04-25T09:04:22Z", "content": "Pat Cummins and Cheteshwar Pujara. (Photo Source: Getty Images)\r\nTeam India scripted history during their previous Australia tour by winning their first ever Test series down under. Though the hosts missed their best batsman in David Warner and Steve Smith, A… [+1980 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Wasim Jaffer Reveals the First Thing He Will Do Once the Lockdown is Lifted in India - News18", "description": "The former Indian cricketer took to Twitter and asked fans and followers to list the first thing they would do after the lockdown restrictions were lifted from the country.", "url": "https://www.news18.com/news/buzz/wasim-jaffer-reveals-the-first-thing-he-will-do-once-the-lockdown-is-lifted-in-india-2592255.html", "urlToImage": null, "publishedAt": "2020-04-25T08:54:15Z", "content": "Former India cricketer Wasim Jaffer has revealed the first thing he would do once the nationwide lockdown is lifted amid the coronavirus outbreak.\r\nJaffer said he will take his family out for dinner once the lockdown ends on May 3. After that, he will bat in … [+2086 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Anushka Sharma’s Small Gesture During Virat Kohli’s Live Chat Leaves Him Blushing, Watch Here - News18", "description": "Virat Kohli was having an Instagram Live session when his wife helped him by turning on the lights of the room.", "url": "https://www.news18.com/news/movies/anushka-sharmas-small-gesture-during-virat-kohlis-live-chat-leaves-him-blushing-watch-here-2592223.html", "urlToImage": null, "publishedAt": "2020-04-25T08:34:28Z", "content": "Lovebirds Anushka Sharma and Virat Kohli are spending the lockdown time together at their home. The duo is having quite fun in their day to day routine, making each day special for each other.\r\nThe Indian cricket team captain recently had a live chat session … [+1684 chars]"}, {"source": {"id": null, "name": "Tennisworldusa.org"}, "author": "Simone Brugnoli", "title": "Novak Djokovic reveals the key behind his supreme mental strength - Tennis World USA", "description": "The Serbian is well-known for being perhaps the toughest player tennis has ever seen in the biggest moments", "url": "https://www.tennisworldusa.org/tennis/news/Novak_Djokovic/86873/novak-djokovic-reveals-the-key-behind-his-supreme-mental-strength/", "urlToImage": null, "publishedAt": "2020-04-25T08:18:25Z", "content": "Novak Djokovic has shown on more than one occasion that he is one of the mentally strongest tennis players in the history of this sport. Just think of the two match points canceled in the 2019 Wimbledon final, when everything now seemed set for Roger Federer'… [+1440 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "ESPNcricinfo staff", "title": "Former Australia allrounder Graeme Watson dies at 75 | ESPNcricinfo.com - ESPNcricinfo", "description": "He played five Tests for Australia in an injury-plagued career | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29096744/former-australia-allrounder-graeme-watson-dies-75", "urlToImage": null, "publishedAt": "2020-04-25T07:59:56Z", "content": "Graeme Watson, the former Australia allrounder who was battling cancer, has died at the age of 75. Primarily a middle-order batsman and a medium-pace bowler, he played five Tests from 1967 to 1972 and two ODIs in 1972.\r\nAfter starting his domestic career at V… [+1316 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Saketh Kandadai", "title": "“It Was Not an Easy Night”: Steve Kerr Narrates a Hilarious Betting Story of Michael Jordan From Their College Days - Essentially Sports", "description": "Golden State Warriors coach Steve Kerr revealed a funny betting story with his former Chicago Bulls teammate Michael Jordan.", "url": "https://www.essentiallysports.com/nba-news-chicago-bulls-it-was-not-an-easy-night-steve-kerr-narrates-a-hilarious-betting-story-of-michael-jordan-from-their-college-days/", "urlToImage": null, "publishedAt": "2020-04-25T07:25:11Z", "content": "Golden State Warriors coach Steve Kerr revealed a funny betting story with his former teammate Michael Jordan.\r\nIt was during a game when Kerr was playing for the University of Arizona while Jordan was at the University of North Carolina. Kerr’s Wildcats defe… [+2070 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'It was easy to recruit for Chelsea' - How Mourinho helped attract Abraham & Mount to Stamford Bridge - Goal India", "description": "If the Bundesliga season got back underway tomorrow, RB Leipzig would be ready - according to U.S. national team midfielder Tyler Adams.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T07:00:00Z", "content": "More"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sabi Hussain", "title": "Severely ill Limba Ram struggling for treatment - Times of India", "description": "More sports News: The nationwide lockdown due to the spread of Covid-19 pandemic has affected people from all walks of life, especially patients with critical illness w", "url": "https://timesofindia.indiatimes.com/sports/more-sports/others/severely-ill-limba-ram-struggling-for-treatment/articleshow/75368043.cms", "urlToImage": null, "publishedAt": "2020-04-25T06:32:55Z", "content": null}, {"source": {"id": null, "name": "Tennisworldusa.org"}, "author": "Simone Brugnoli", "title": "Godsick: 'One of the reasons why Roger Federer still continues to compete is...' - Tennis World USA", "description": "Federer and Nadal set the new crowd record for a tennis match thanks to a beneficial exhibition staged in Cape Town", "url": "https://www.tennisworldusa.org/tennis/news/Roger_Federer/86878/godsick-one-of-the-reasons-why-roger-federer-still-continues-to-compete-is-/", "urlToImage": null, "publishedAt": "2020-04-25T06:13:38Z", "content": "A few weeks before the suspension of the pandemic circuit, Roger Federer and Rafael Nadal set the new crowd record for a tennis match thanks to a beneficial exhibition staged in Cape Town. During a long interview with Tennis.com, the agent of the Swiss Tony G… [+1346 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "From Chess to cricket - The chronicles of Chahal - Cricbuzz - Cricbuzz", "description": "The legspinner talks about his cricketing journey - captaining Haryana at the junior level and how he started off as a medium pacer before switching over to spin", "url": "https://www.cricbuzz.com/cricket-news/112927/from-chess-to-cricket-the-chronicles-of-chahal", "urlToImage": null, "publishedAt": "2020-04-25T05:55:57Z", "content": "From being a chess player (he still has a FIDE rating of 1956) to becoming an international cricketer of repute, Yuzvendra Chahal, India's premier white-ball spinner, has come a long way. A veteran of 52 One Day Internationals and 42 Twenty20 internationals, … [+2072 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "No to saliva, yes to shine: Ball-tampering laws in cricket may change - Times of India", "description": "Cricket News: Cricket may change ball-tampering laws and approve external method to help polish the red cherry in proposed post-corona measures. The matter of saliv", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/no-to-saliva-yes-to-shine-ball-tampering-laws-in-cricket-may-change/articleshow/75367490.cms", "urlToImage": null, "publishedAt": "2020-04-25T04:40:29Z", "content": "NEW DELHI: The coronavirus pandemic may force cricket's world governing body to tweak one of its oldest rules and approve the use of an artificial substance to help shine the ball, effectively legalizing what has for long been a core tenet of the sport's anti… [+4836 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Barcelona not in the process of signing Neymar or Lautaro, claims La Liga chief Tebas - Goal India", "description": "If the Bundesliga season got back underway tomorrow, RB Leipzig would be ready - according to U.S. national team midfielder Tyler Adams.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T03:45:00Z", "content": "More"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Asian News International", "title": "COVID-19: Ajax denied Eredivise title as league’s season comes to an end - Hindustan Times", "description": "The decision to finalise the table was made after the UEFA asked the Dutch federation to maintain the current standings.", "url": "https://www.hindustantimes.com/football/covid-19-ajax-denied-eredivise-title-as-league-s-season-comes-to-an-end/story-Y7K7MRhfLCxJgGYYoY5XrN.html", "urlToImage": null, "publishedAt": "2020-04-25T03:30:20Z", "content": "AFC Ajax has been denied the Eredivisie (Netherlands domestic competition) title despite the final standings being recognised as final.\r\nThe Eredivisie on Friday decided to end the league’s season following an announcement from Netherlands Prime Minister Mark… [+1268 chars]"}, {"source": {"id": null, "name": "Thesportreview.com"}, "author": "Transfer Agent", "title": "Man United have plan to accommodate Jack Grealish in their line-up – report - The Sport Review", "description": "Manchester United will deploy Jack Grealish as a right winger if they sign him from Aston Villa this summer, according to reports. The Athletic, as quoted", "url": "https://www.thesportreview.com/2020/04/man-united-news-jack-grealish-report/", "urlToImage": null, "publishedAt": "2020-04-25T03:30:00Z", "content": "Manchester United will deploy Jack Grealish as a right winger if they sign him from Aston Villa this summer, according to reports.\r\nThe Athletic, as quoted by the Birmingham Mail, is reporting that the Red Devils are already thinking about ways that they can … [+989 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "George Dobell", "title": "UK government hands ECB lead on viability of 'bio-secure' sport | ESPNcricinfo.com - ESPNcricinfo", "description": "England will play at as few grounds as possible if cricket goes behind closed doors, says ECB CEO | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29094232/uk-government-hands-ecb-lead-viability-bio-secure-sport", "urlToImage": null, "publishedAt": "2020-04-25T02:19:30Z", "content": "The ECB has been asked by the UK government to lead the way into investigating the viability of playing sport in a bio-secure environment.\r\nWith an increasing acceptance that the best chance of fulfilling the broadcast deals that keep nearly all sport afloat … [+8018 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "FIDE Chess.com Online Nations Cup: Teams Revealed - India Gone Viral", "description": "The line-ups for the six teams that will play the FIDE Chess.com Nations Cup have been revealed. There are big stars among both the team captains and players. The FIDE Chess.com Online Nations Cup is", "url": "https://indiagoneviral.com/sports/2020/04/25/fide-chess-com-online-nations-cup-teams-revealed/41810/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T01:58:01Z", "content": "The line-ups for the six teams that will play the FIDE Chess.com Nations Cup have been revealed. There are big stars among both the team captains and players.\r\nThe FIDE Chess.com Online Nations Cup is a team competition held from May 5-10, 2020 on Chess.com f… [+8388 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Transfer news and rumours LIVE: Chelsea launch Mertens bid - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T01:50:00Z", "content": "More"}, {"source": {"id": null, "name": "Dawn.com"}, "author": "AFP", "title": "‘Dhoni unlikely to play for India again’ - DAWN.com", "description": "Dhoni, 38, has not appeared for club or country since last year’s 50-over World Cup.", "url": "https://www.dawn.com/news/1551986", "urlToImage": null, "publishedAt": "2020-04-25T01:43:50Z", "content": "NEW DELHI: Veteran off-spinner Harbhajan Singh said he doesnt think Mahendra Singh Dhoni will play for India again, adding to the guessing game over the future of the superstar former captain. \r\nDhoni, 38, has not appeared for club or country since last years… [+1135 chars]"}, {"source": {"id": null, "name": "Chessbase.com"}, "author": "", "title": "Magnus Carlsen Invitational: Carlsen and Caruana score convincing wins - Chessbase News", "description": "World numbers one and two, Magnus Carlsen and Fabiano Caruana, won their round-four matches without needing tiebreaks, thus collecting three points each. Carlsen has won all his confrontations so far and is the clear leader with eleven points. He defeated Max…", "url": "https://en.chessbase.com/post/magnus-carlsen-invitational-2020-r4-a", "urlToImage": null, "publishedAt": "2020-04-25T00:34:12Z", "content": "4/25/2020 – World numbers one and two, Magnus Carlsen and Fabiano Caruana, won their round-four matches without needing tiebreaks, thus collecting three points each. Carlsen has won all his confrontations so far and is the clear leader with eleven points. He … [+5679 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Manchester City star Raheem Sterling admits he wants to own shirt from Barcelona star Lionel Messi - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T22:53:08Z", "content": "More"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Kho kho captain strikes gold, lands in penury - Times of India", "description": "The Covid-19 pandemic brought despair for Nasreen and her family. She landed a contractual job with Airports Authority of India (AAI) last year, but s", "url": "https://timesofindia.indiatimes.com/city/delhi/kho-kho-captain-strikes-gold-lands-in-penury/articleshow/75362916.cms", "urlToImage": null, "publishedAt": "2020-04-24T22:04:42Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'On July 1, I'll be a Chelsea player' - Ziyech prepped for Stamford Bridge move despite uncertainty - Goal India", "description": "Memphis Depay has rejected \"a number\" of contract offers from Lyon but the club is not giving up hope of securing him to a new deal, according to president Jean-Michel Aulas.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T20:26:22Z", "content": "More"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Adnan Riaz", "title": "Ronaldo And Ronaldinho Finally Answer GOAT Debate Between Lionel Messi And Cristiano Ronaldo - SPORTbible", "description": "Ronaldinho and Ronaldo praised Lionel Messi and Cristiano Ronaldo, but they both chose the same player in the footballing GOAT debate.", "url": "https://www.sportbible.com/football/news-rivalries-ronaldo-and-ronaldinho-answer-goat-debate-between-messi-and-cristiano-20200424", "urlToImage": null, "publishedAt": "2020-04-24T18:53:18Z", "content": "Brazilian legends Ronaldinho and Ronaldo revealed that they would choose Lionel Messi ahead of Cristiano Ronaldo as the 'GOAT of football.'\r\nMessi and Ronaldo's status as two of the best players in the history of the sport has led to many debating who is the … [+1624 chars]"}, {"source": {"id": null, "name": "Football-espana.net"}, "author": "Colin Millar", "title": "La Liga president Tebas confirms promotion and relegation if 'season is not completed' - Football Espana", "description": "La Liga president Javier Tebas has said that in the event of the 2019/20 campaign not being concluded, there would be promotion and relegation in place. There are growing fears that the 2019/20 campaign will not be completed due to the indefinite suspension o…", "url": "https://www.football-espana.net/2020/04/24/la-liga-president-tebas-confirms-promotion-and-relegation-if-season-is-not-completed", "urlToImage": null, "publishedAt": "2020-04-24T17:01:00Z", "content": "La Liga president Javier Tebas has said that in the event of the 2019/20 campaign not being concluded, there would be promotion and relegation in place.\r\nThere are growing fears that the 2019/20 campaign will not be completed due to the indefinite suspension … [+1091 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Ibrahimovic slams 'kindergarten-level' vandals who attacked AC Milan forward's statue in Malmo - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T16:14:00Z", "content": "More"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Barca Blaugranes Staff", "title": "Bayern announce Philippe Coutinho has undergone ankle surgery - Barca Blaugranes", "description": "The Barcelona loanee has gone under the knife", "url": "https://www.barcablaugranes.com/2020/4/24/21234464/philippe-coutinho-undergoes-successful-ankle-surgery", "urlToImage": null, "publishedAt": "2020-04-24T15:07:34Z", "content": "Bayern Munich have announced that Philippe Coutinho has undergone ankle surgery and will be sidelined for a couple of weeks before beginning his recovery.\r\nThe Brazilian, who is on a season-long loan from Barcelona, went under the knife during which loose joi… [+601 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "Rohit Sharma tags Shubman Gill as the future of Indian... - The Cricket Times", "description": "During a recent interaction between former India and Mumbai Indians colleagues Harbhajan Singh and Rohit Sharma, the latter tagged Punjab batsman Shubman Gill as the future of Indian cricket. Gill was an integral part of India' A' setup where he accumulated h…", "url": "https://crickettimes.com/2020/04/rohit-sharma-tags-shubman-gill-as-the-future-of-indian-cricket/", "urlToImage": null, "publishedAt": "2020-04-24T14:38:17Z", "content": "During a recent interaction between former India and Mumbai Indians colleagues Harbhajan Singh and Rohit Sharma, the latter tagged Punjab batsman Shubman Gill as the future of Indian cricket.\r\nGill was an integral part of India’ A’ setup where he accumulated … [+1583 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Lucky to get team management's backing after injuries: Bhuvneshwar Kumar - Times of India", "description": "Cricket News: It is tough to make a comeback after a lengthy injury layoff but the team management's support makes the job easier, says right-arm medium pacer Bhuvn", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/lucky-to-get-team-managements-backing-after-injuries-bhuvneshwar-kumar/articleshow/75352116.cms", "urlToImage": null, "publishedAt": "2020-04-24T14:14:00Z", "content": null}, {"source": {"id": null, "name": "Espn.in"}, "author": "James Olley", "title": "Chelsea want Arsenal's Aubameyang as alternative to Werner, Dembele - sources - ESPN India", "description": "Chelsea are monitoring Pierre-Emerick Aubameyang's contract situation at Arsenal with a view to making a move this summer, sources have told ESPN.", "url": "https://www.espn.in/football/soccer-transfers/story/4088766/chelsea-want-arsenals-aubameyang-as-alternative-to-wernerdembele-sources", "urlToImage": null, "publishedAt": "2020-04-24T14:04:26Z", "content": "Chelsea are closely monitoring Pierre-Emerick Aubameyang's contract situation at Arsenal with a view to making a move this summer, sources have told ESPN.\r\n-Stream new episodes of ESPN FC Monday-Friday on ESPN+- Stream every episode of 30 for 30: Soccer Stori… [+3918 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "When Saqlain Mushtaq sledged Sachin Tendulkar only to never sledge him again - Hindustan Times", "description": "In one of his early battles with Tendulkar during the Sahara Cup in Canada, Saqlain thought it would be a good idea to sledge the champion batsman. As it panned out, the wily off-spinner sledged to never sledge the then Indian captain again.", "url": "https://www.hindustantimes.com/cricket/when-saqlain-mushtaq-sledged-sachin-tendulkar-only-to-never-sledge-him-again/story-49B4FOTLWL2bJyBWNia1dM.html", "urlToImage": null, "publishedAt": "2020-04-24T13:06:55Z", "content": "Sachin Tendulkar and Saqlain Mushtaq were involved in umpteen intense battles in the ‘90s but one such duel left the star Pakistan off-spinner deeply embarrassed. In one of his early battles with Tendulkar during the Sahara Cup in Canada, Saqlain thought it w… [+3282 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Pornographic images pop-up as top badminton coaches left red-faced during online training session - India Today", "description": "An online training session held by Sports Authority of India (SAI) and Badminton Association of India (BAI) was abruptly ended of Thursday after pornographic images popped up on the screens.", "url": "https://www.indiatoday.in/sports/badminton/story/pornographic-images-bai-sai-online-training-session-pullela-gopichand-coach-badminton-zoom-videoconferencing-app-coronavirus-pandemic-1670627-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T12:13:35Z", "content": "The online training session held by Sports Authority of India (SAI) and Badminton Association of India (BAI) found itself in an unwanted situation after pornographic images suddenly flashed on the screens of 700-plus coaches across the country on Thursday.\r\nT… [+2211 chars]"}, {"source": {"id": null, "name": "Sportscafe.in"}, "author": "SportsCafe Desk", "title": "Reports | Post COVID-19, ICC might legalise ball tampering to compensate for no saliva use - SportsCafe", "description": "As Coronavirus outbreak created a ripple around the world of cricket, the ICC is contemplating to legalise ball tampering to compensate for no saliva use in the immediate aftermath of the sport. If that happens, one of the greatest taboos of the sport will fo…", "url": "https://sportscafe.in/cricket/articles/2020/apr/24/post-covid-19-icc-might-allow-ball-tampering-to-compensate-for-no-saliva-use", "urlToImage": null, "publishedAt": "2020-04-24T11:59:12Z", "content": "As Coronavirus outbreak created a ripple around the world of cricket, the ICC is contemplating to legalise ball tampering to compensate for no saliva use in the immediate aftermath of the sport. If that happens, one of the greatest taboos of the sport will fo… [+1635 chars]"}, {"source": {"id": null, "name": "Icc-cricket.com"}, "author": "ICC", "title": "Live cricket resumes this weekend in Vanuatu - International Cricket Council", "description": "Live cricket action returns this weekend in Vanuatu, with many of the country's best players in action – and doing so for a good cause.", "url": "https://www.icc-cricket.com/news/1660447/live-cricket-resumes-this-weekend-in-vanuatu", "urlToImage": null, "publishedAt": "2020-04-24T10:48:55Z", "content": "Live cricket action returns this weekend in Vanuatu, with many of the country's best players in action and doing so for a good cause.COVID-19 has brought live sports to a grinding halt globally even as governments and frontline workers strive to fight the pan… [+2666 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘He was a nightmare’: James Anderson, Stuart Broad name toughest batsman to bowl at - Hindustan Times", "description": "When asked about which batsman was the toughest to bowl against in their career, both had the same answer, former South Africa opener and captain Graeme Smith.", "url": "https://www.hindustantimes.com/cricket/he-was-a-nightmare-james-anderson-stuart-broad-name-toughest-batsman-to-bowl-at/story-QL2mlt84USC8Ay8K9e1g8O.html", "urlToImage": null, "publishedAt": "2020-04-24T09:28:05Z", "content": "James Anderson and Stuart Broad together form one of the most successful new ball duos in Test cricket. Both have bowled in tandem and wreaked havoc on touring batsmen in the helpful English conditions for many years now. Anderson has a record 584 wickets to … [+1507 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Rob Hoskin", "title": "Liverpool set to be crowned 2019/20 champions after UEFA effectively remove 'null and void' - GIVEMESPORT", "description": "Liverpool set to be crowned 2019/20 champions after UEFA effectively remove 'null and void'", "url": "https://www.givemesport.com/1564557-liverpool-set-to-be-crowned-201920-champions-after-uefa-effectively-remove-null-and-void", "urlToImage": null, "publishedAt": "2020-04-24T07:02:19Z", "content": "If at the start of March you’d have told any Liverpool fan they wouldn’t have won the Premier League title by now, they’d never have believed you.\r\nIt was just a matter of time before Jurgen Klopp's side were crowned champions in sensational style, winning 27… [+1657 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": null, "title": "‘He used to make me feel like crying’ – Harbhajan Singh reveals five toughest batsmen he has ever bowled at - CricTracker", "description": "On Thursday, he again conducted a live session and this time he was involved in a chat with veteran Indian spinner Harbhajan Singh.", "url": "https://m.crictracker.com/he-used-to-make-me-feel-like-crying-harbhajan-singh-reveals-five-toughest-batsmen-he-has-ever-bowled-at/", "urlToImage": null, "publishedAt": "2020-04-24T06:33:54Z", "content": "Harbhajan Singh. (Photo by Visionhaus/Getty Images)\r\nIn the ongoing lockdown, the Indian cricketers have become more active on social media platforms where they interact with their fans and teammates. Meanwhile, Rohit Sharma is one of those players, who is co… [+1865 chars]"}, {"source": {"id": null, "name": "Dawn.com"}, "author": "Agencies", "title": "ICC still planning for T20 World Cup in October - DAWN.com", "description": "Global cricket is at a standstill as a result of the coronavirus.", "url": "https://www.dawn.com/news/1551828", "urlToImage": null, "publishedAt": "2020-04-24T00:39:07Z", "content": "DUBAI: Planning for this years mens Twenty20 World Cup and next years womens 50-over World Cup is going ahead even though cricket remains suspended due to the Covid-19 pandemic, the International Cricket Council (ICC) said on Thursday. \r\nThe ICC hosted a Chie… [+3892 chars]"}, {"source": {"id": null, "name": "Talkesport.com"}, "author": null, "title": "Fnatic players \"reminded of their obligations\" following growing misconduct in PUBGM roster - TalkEsport", "description": "In an official statement, Fnatic PUBG Mobile talked about their vision as a brand, how they want to standout from the rest and accepted about the fact that everything is not right between the players in the roster!", "url": "https://www.talkesport.com/news/fnatic-players-reminded-of-their-obligations-following-growing-misconduct-in-pubgm-roster/", "urlToImage": null, "publishedAt": "2020-04-23T18:12:00Z", "content": "Fnatic PUBG Mobile recently posted an official statement on their Instagram handle where they acknowledged that everything is not okay among the members of their PUBG Mobile roster. Heres what all they had to say in their official statement:\r\n View this post … [+2802 chars]"}]}