{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Never seen anything like that: Virat Kohli picks best shot in cricket in Instagram live with AB de ... - Hindustan Times", "description": "Virat Kohli and AB de Villiers played some scintillating strokes that day to leave the Gujarat Lions attack clueless but there was one particular shot from de Villiers which Kohli rated as the highest.", "url": "https://www.hindustantimes.com/cricket/never-seen-anything-like-that-virat-kohli-picks-the-best-shot-in-instagram-live-with-ab-de-villiers/story-8d4tdN2avaA4ZxlImptFXP.html", "urlToImage": null, "publishedAt": "2020-04-26T16:08:00Z", "content": "When Virat Kohli and AB de Villiers bat together in the IPL, more often than not fireworks follow. The duo over the years have played some memorable innings for the Royal Challengers Bangalore and most of it came when they were batting together. But none is m… [+2271 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "Sachin Tendulkar picks his five favourite all-rounders in the... - The Cricket Times", "description": "Master Blaster Sachin Tendulkar, on Saturday, hand-picked his five favourite all-rounders in the world. Sachin, who recently celebrated his 47th birthday, graced Star Sports show ‘Cricket Connected’ with his presence. In that show, he named Kapil Dev as his f…", "url": "https://crickettimes.com/2020/04/sachin-tendulkar-picks-his-five-favourite-all-rounders-in-the-world/", "urlToImage": null, "publishedAt": "2020-04-26T15:49:58Z", "content": "Master Blaster Sachin Tendulkar, on Saturday, hand-picked his five favourite all-rounders in the world. Sachin, who recently celebrated his 47th birthday, graced Star Sports show Cricket Connected with his presence. In that show, he named Kapil Dev as his fav… [+1647 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Ashwin remains India's best spinner, you can't keep him out of shorter formats: Saqlain Mushtaq - Times of India", "description": "Cricket News: Pakistan spin great Saqlain Mushtaq fails to understand how a proven performer like R Ashwin has been kept out of India's limited-overs set-up, saying", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/ashwin-remains-indias-best-spinner-you-cant-keep-him-out-of-shorter-formats-saqlain-mushtaq/articleshow/75390065.cms", "urlToImage": null, "publishedAt": "2020-04-26T15:26:18Z", "content": "NEW DELHI: Pakistan spin great Saqlain Mushtaq fails to understand how a proven performer like Ravichandran Ashwin has been kept out of India's limited-overs set-up, saying a successful Test bowler is bound to succeed in the shorter formats.\r\nAshwin, a regula… [+3975 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Tim Paine reveals how CA is planning to ensure India tours Australia - Hindustan Times", "description": "Cricket Australia too (CA) is feeling the pressure ahead of the deadline for announcing the annual player contracts. It is currently in talks with the Australian Cricketers’ Association (ACA) about the matter.", "url": "https://www.hindustantimes.com/cricket/tim-paine-reveals-how-ca-is-planning-to-ensure-india-tours-australia/story-mSa5FTiVagPTftEldYZ6uI.html", "urlToImage": null, "publishedAt": "2020-04-26T15:11:23Z", "content": "Sports bodies all over the world are feeling the pinch of the economic slowdown caused due to the coronavirus pandemic. Sports all over the world is highly dependent on revenue generated from sponsorships and with no sport happening anywhere, everyone is taki… [+1628 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Jofra Archer finds lost World Cup 2019 medal: Randomly searching and boom - India Today", "description": "Jofra Archer had revealed he lost his World Cup 2019 medal after moving to his new residence and that he had 'gone mad' searching for it.", "url": "https://www.indiatoday.in/sports/cricket/story/jofra-archer-finds-lost-world-cup-2019-medal-new-residence-guest-room-1671383-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T14:46:54Z", "content": "England pacer Jofra Archer revealed 'he went mad' by searching for his World Cup medal that he had lost while moving flats. However, on Sunday, Archer said he reunited with his precious medal while searching his 'guest bedroom'.\r\n\"Randomly searching the guest… [+1495 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Reece Chambers", "title": "Three ways Solskjaer is restoring Manchester United qualities of Sir Alex Ferguson era - Manchester Evening News", "description": "The two Man Utd greats share a number of similarities including their belief in younger players.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-utd-solskjaer-alex-ferguson-18150053", "urlToImage": null, "publishedAt": "2020-04-26T14:37:00Z", "content": "Assistant manager Mike Phelan has drawn similarities between Ole Gunnar Solskjaer and Sir Alex Ferguson by suggesting that the two have very similar managerial styles.\r\nPhelan has experienced life under both managers, having been alongside Solskjaer since Dec… [+3190 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Lockdown has made me more dedicated and taught me that we can survive without eating outside, Hima Das te - Times of India", "description": "More sports News: From crying after meeting idol Sachin Tendulkar to learning how to be more dedicated during the coronavirus lockdown, India's star sprinter Hima Das o", "url": "https://timesofindia.indiatimes.com/sports/more-sports/athletics/lockdown-has-made-me-more-dedicated-and-taught-me-that-we-can-survive-without-eating-outside-hima-das-tells-suresh-raina/articleshow/75391961.cms", "urlToImage": null, "publishedAt": "2020-04-26T14:31:03Z", "content": "NEW DELHI: From crying after meeting idol Sachin Tendulkar to learning how to be more dedicated during the coronavirus lockdown, India's star sprinter Hima Das opened up about her life in a candid chat with Indian cricketer Suresh Raina on Sunday.\r\nThe two In… [+3156 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Transfer news and rumours LIVE: Klopp calls Mbappe's dad over Liverpool switch - Goal India", "description": "Jack Wilshere has revealed he was reluctant to join Arsenal when he received an offer from the club.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T14:10:00Z", "content": "More"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Adnan Riaz", "title": "Neymar Breaks Down In Tears While Talking About Lionel Messi During His Barcelona Days - SPORTbible", "description": "It's safe to say that Lionel Messi has left a long, lasting impression on Paris Saint-Germain star Neymar when he was at Barcelona.", "url": "https://www.sportbible.com/football/reactions-news-neymar-breaks-down-in-tears-while-talking-about-lionel-messi-20200426", "urlToImage": null, "publishedAt": "2020-04-26T13:55:52Z", "content": "A teary-eyed Neymar spoke candidly about his time at Barcelona and the impact of Lionel Messi.\r\nThe 28-year-old Brazilian forward arrived at the Spanish club from Santos in 2013 and made 123 appearances and scored 68 times during his four-year stint at the Ca… [+1199 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Kishan Vaghela For Mailonline", "title": "Jose Mourinho names Ronaldo the best player he's ever seen... but he doesn't mean Cristiano! - Daily Mail", "description": "Cristiano Ronaldo and Lionel Messi have ruled the football globe for more than a decade, but Jose Mourinho believes Ronaldo Nazario eclipses both the Juventus and Barcelona stars.", "url": "https://www.dailymail.co.uk/sport/football/article-8258441/Jose-Mourinho-names-Ronaldo-best-player-hes-seen-doesnt-mean-Cristiano.html", "urlToImage": null, "publishedAt": "2020-04-26T13:52:31Z", "content": "Jose Mourinho believes neither Cristiano Ronaldo nor Lionel Messi are the best players to have ever graced the game.\r\nThe Portuguese and Argentine duo have ruled the globe with their mesmerising football prowess for more than a decade.\r\nBut Tottenham manager … [+1855 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Asian News International", "title": "Umpires don’t let bowlers use too much saliva these days: Mohit Sharma - Hindustan Times", "description": "Australian pacer Josh Hazlewood said that using saliva on the ball is something that needs to be discussed after the world comes back to normal.", "url": "https://www.hindustantimes.com/cricket/umpires-don-t-let-bowlers-use-too-much-saliva-these-days-mohit-sharma/story-45hNFdRmWxUKlol6pvFrAK.html", "urlToImage": null, "publishedAt": "2020-04-26T13:34:31Z", "content": "India pacer Mohit Sharma said umpires these days don’t allow bowlers to use saliva on the ball due to the threat of the coronavirus.\r\n“It will be interesting to see what decision is made. Every bowler has their personal choices in this matter. I don’t use a l… [+1723 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "India Today League PUBG Mobile Invitational wrap: TSM ENTITY win championship, grand cash prize, MVP - India Today", "description": "India Today League PUBG Mobile Invitational: TSM ENTITY won the Championship and walked away with a cash prize of Rs 1.3 Lakh. Team SouL finished second and Team IND finished 3rd after 4 days of action-pakced gaming.", "url": "https://www.indiatoday.in/sports/other-sports/story/itpubl-tsm-entity-winnners-points-table-mvp-cash-prize-complete-list-pubg-mobile-invitational-1671358-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T13:07:41Z", "content": "TSM ENTITY won the championship and unprecedented prize money of Rs 1.3 Lakh at the India Today League PUBG Mobile Invitational that was held over four days from April 23 to 26. TSM ENTITY won 3 Chicken Dinners, including 1 on the final day, to finish with a … [+4183 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Manchester United quiz! ESPN FC's Mark Ogden takes on Danny Higginbotham | Premier League - ESPN UK", "description": "The latest ESPN FC quiz is a Manchester United feast! Mark Ogden and former Premier League defender Danny Higginbotham face each other in a test of Man Unite...", "url": "https://www.youtube.com/watch?v=ekm-1cRn4u0", "urlToImage": null, "publishedAt": "2020-04-26T13:00:30Z", "content": "The latest ESPN FC quiz is a Manchester United feast! Mark Ogden and former Premier League defender Danny Higginbotham face each other in a test of Man United IQ. \r\nSubscribe to ESPN UK: http://bit.ly/1oGUzVA\r\nFollow ESPN UK across multiple platforms:\r\nhttps:… [+74 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Asian News International", "title": "Was not able to get into my domestic side as spinner: Vijay Shankar - Hindustan Times", "description": "“I was not able to get into my domestic team when I was the spinner, I used to score runs but I did not manage to get into the side. Then I started bowling medium pace, and things really changed for me,” Shankar told Warner during the Instagram Live session.", "url": "https://www.hindustantimes.com/cricket/was-not-able-to-get-into-my-domestic-side-as-spinner-vijay-shankar/story-uMtu5gSWjzmvAyqEJ3zrsO.html", "urlToImage": null, "publishedAt": "2020-04-26T12:56:04Z", "content": "All-rounder Vijay Shankar on Sunday revealed that he was not able to make it to his domestic side as a spinner and this prompted him to become a medium-pacer.\r\nShankar was doing an Instagram Live session with Australian batsman David Warner on the official ha… [+971 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Too many selfie requests and player pressure - Why Arsenal are returning to their training ground and how it will work - Goal India", "description": "Jack Wilshere has revealed he was reluctant to join Arsenal when he received an offer from the club.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T12:47:00Z", "content": "More"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "MS Dhoni always takes responsibility when team loses, says Mohit Sharma - Times of India", "description": "Cricket News: He has played most of his cricket under MS Dhoni and pacer Mohit Sharma says the revered former India skipper is a true leader who does not back off w", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/ms-dhoni-always-takes-responsibility-when-team-loses-says-mohit-sharma/articleshow/75388665.cms", "urlToImage": null, "publishedAt": "2020-04-26T12:43:49Z", "content": "NEW DELHI: He has played most of his cricket under MS Dhoni and pacer Mohit Sharma says the revered former India skipper is a true leader who does not back off when it comes to taking responsibility in challenging times.\r\nThe 31-year-old pacer has played unde… [+2580 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "‘Humein to pata hi nahi tha’: Shikhar Dhawan hilariously trolls Cheteshwar Pujara - Hindustan Times", "description": "With no cricket being played due to coronavirus pandemic, Pujara uploaded a picture of himself batting in the nets and his post read: “The thing I miss the most in this lockdown is being on the cricket field.”", "url": "https://www.hindustantimes.com/cricket/humein-to-pata-hi-nahi-tha-shikhar-dhawan-hilariously-trolls-cheteshwar-pujara/story-wdFBZqAL032Z76ORKpmeEP.html", "urlToImage": null, "publishedAt": "2020-04-26T12:29:28Z", "content": "India opener Shikhar Dhawan hilariously trolled Test specialist Cheteshwar Pujara after the latter shared a photograph of himself on social media recently.\r\nWith no cricket being played due to coronavirus pandemic, Pujara uploaded a picture of himself batting… [+989 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Sports Desk", "title": "Boxer Dingko Singh airlifted to Delhi for cancer treatment - The Indian Express", "description": "Dingko Singh was airlifted on Saturday from Imphal to Delhi during the nationwide lockdown due to coronavirus pandemic for his liver cancer treatment.", "url": "https://indianexpress.com/article/sports/sport-others/boxer-dingko-singh-airlifted-to-delhi-for-cancer-treatment-6380046/", "urlToImage": null, "publishedAt": "2020-04-26T10:38:42Z", "content": "Dingko Singh has reached Delhi and is in the hospital for further treatment. (Source: BFI Twitter)Indian boxer Dingko Singh was airlifted on Saturday from Imphal to Delhi during the nationwide lockdown due to coronaviruspandemic for his liver cancer treatment… [+1725 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Sports in times of COVID-19: Top Indian stars foresee new normal once pandemic mayhem ends - Times of India", "description": "More sports News: Will sports and watching sports ever be the same again in a world scarred by the COVID-19 pandemic? India's sportspersons -- current and former -- gaz", "url": "https://timesofindia.indiatimes.com/sports/more-sports/others/sports-in-times-of-covid-19-top-indian-stars-foresee-new-normal-once-pandemic-mayhem-ends/articleshow/75388631.cms", "urlToImage": null, "publishedAt": "2020-04-26T10:26:04Z", "content": "NEW DELHI: Will the fans rush back? Will training abroad be as hassle-free as it used to be? What about contact sports where social distancing can't really be practised?\r\nIn a nutshell, will sports and watching sports ever be the same again in a world scarred… [+6513 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "https://www.facebook.com/varun.khanna123", "title": "“I Don’t See Why I Should Give Them Money” – Dominic Thiem Against Novak Djokovic’s Player Relief Fund - Essentially Sports", "description": "Dominic Thiem disagreed to contribute for the Player relief fund campaign led by Novak Djokovic to help the lower-ranked players during the coronavirus.", "url": "https://www.essentiallysports.com/i-dont-see-why-i-should-give-them-money-dominic-thiem-against-novak-djokovic-player-relief-fund-atp-tennis-news/", "urlToImage": null, "publishedAt": "2020-04-26T09:46:00Z", "content": "The governing bodies of tennis created a relief fund plan to financially help lower-level professionals during the coronavirus pandemic. The program received a lot of support from various stakeholders of the sport. However, World No.3 Dominic Thiem does not f… [+1894 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘You almost finished my son’s career,’ Yuvraj Singh recalls 2007 six sixes, reveals chat with Broad... - Hindustan Times", "description": "Yuvraj slammed six maximums in one Broad over during his majestic 14-ball 58 which ultimately proved to be the difference between the two sides as India won the match by 18 runs.", "url": "https://www.hindustantimes.com/cricket/you-almost-finished-my-son-s-career-yuvraj-singh-recalls-2007-six-sixes-reveals-chat-with-broad-senior/story-9tCJTh6ddis6UBw9JpmstJ.html", "urlToImage": null, "publishedAt": "2020-04-26T08:55:46Z", "content": "One of the most iconic moments in world cricket is Yuvraj Singh hitting Stuart Broad for six sixes in an over at the 2007 T20 World Cup. India were in a strong position in the match against England but Yuvraj propelled his country to a mammoth score with six … [+1870 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Divya Goyal", "title": "‘Waheguru Baba’ to friends in Glasgow, ‘ustad’ to world’s oldest marathoner dies of Covid-19 - The Indian Express", "description": "Amrik Singh, 89, passed away at Birmingham's City Hospital with doctors struggling to understand his last words.", "url": "https://indianexpress.com/article/sports/waheguru-baba-to-friends-ustad-to-worlds-oldest-marathoner-dies-6379611/", "urlToImage": null, "publishedAt": "2020-04-26T08:48:06Z", "content": "Written by Divya Goyal\r\n | Ludhiana | \r\nUpdated: April 26, 2020 2:17:07 pm\r\nAmrik Singh, a Sikh marathon runner who was known as Waheguru Baba, had moved to Glasgow in Scotland in 1970. (Express photo)Sagey bhraavan vich khaar hundi hai, saada taan imaandaari… [+6933 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "ESPN", "title": "Coronavirus Everton appalled at Moise Kean house party - ESPN India", "description": "Everton have condemned Moise Kean after he appeared to flout coronavirus lockdown restrictions by hosting a house party.", "url": "https://www.espn.in/football/everton/story/4089204/coronavirus-everton-appalled-at-moise-kean-house-party", "urlToImage": null, "publishedAt": "2020-04-26T08:46:34Z", "content": "Everton have condemned Moise Kean after he appeared to disregard coronavirus lockdown restrictions by hosting a house party.\r\n-Stream new episodes of ESPN FC Monday-Friday on ESPN+- Stream every episode of 30 for 30: Soccer Stories on ESPN+\r\nThe striker was f… [+1523 chars]"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Gill Clark", "title": "Papers: De Ligt attentive to Barcelona, Ter Stegen on the edge - Barca Blaugranes", "description": "A look at the front pages in Spain", "url": "https://www.barcablaugranes.com/fc-barcelona-transfer-rumors-news/2020/4/26/21236769/papers-de-ligt-attentive-to-barcelona-ter-stegen-on-the-edge", "urlToImage": null, "publishedAt": "2020-04-26T08:38:04Z", "content": "Sundays front pages bring some interesting news regarding Juventus defender Matthijs de Ligt and Barcelona goalkeeper Marc-Andre ter Stegen.\r\nMundo Deportivo have the Dutchman on their front page with the headline De Ligt, Alert and a report that he is aware … [+871 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Will Tell TikTok to Block You because You're Annoying: Chris Gayle Trolls Yuzvendra Chahal - News18", "description": "Gayle referred to Chahal as 'annoying' and went on to the extent of saying that he is going to block him.", "url": "https://www.news18.com/news/buzz/will-tell-tiktok-to-block-you-because-youre-annoying-chris-gayle-trolls-yuzvendra-chahal-2593275.html", "urlToImage": null, "publishedAt": "2020-04-26T08:34:30Z", "content": "West Indies batsman Chris Gayle brutally roasted India spinner Yuzvendra Chahal for his social media posts during a live session on popular social media platform Instagram. With no cricket going due to coronavirus pandemic, players are engaging with fans thes… [+1055 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "ESPN", "title": "LIVE Transfer Talk: Barcelona to swap Sergi Roberto for Juventus' Pjanic - ESPN India", "description": "Could Barcelona tempt Juventus into swapping Miralem Pjanic for Sergi Roberto? As always, Transfer Talk has the latest.", "url": "https://www.espn.in/football/soccer-transfers/story/4089180/live-transfer-talk-barcelona-to-swap-sergi-roberto-for-juventus-pjanic", "urlToImage": null, "publishedAt": "2020-04-26T08:25:35Z", "content": "The coronavirus pandemic has made the summer transfer window uncertain, but here are the new rumours floating around Europe's big leagues and beyond.\r\nTOP STORY: Juve and Barca discuss Roberto-Pjanic swap\r\nJuventus are in talks with Barcelona about several po… [+9681 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Anirudh Singh", "title": "Virat Kohli among the three players David Warner picks to bat for his... - The Cricket Times", "description": "Australia's David Warner, who is regarded as one of the most threatening openers in modern-day cricket, has picked three greatest batsmen of the world right now. Warner named his prime three in an Instagram Live session with New Zealand captain and Sunrisers …", "url": "https://crickettimes.com/2020/04/virat-kohli-among-the-three-players-david-warner-picks-to-bat-for-his-life/", "urlToImage": null, "publishedAt": "2020-04-26T08:07:27Z", "content": "Australia’s David Warner, who is regarded as one of the most threatening openers in modern-day cricket, has picked three greatest batsmen of the world right now.\r\nWarner named his prime three in an Instagram Live session with New Zealand captain and Sunrisers… [+2194 chars]"}, {"source": {"id": null, "name": "Icc-cricket.com"}, "author": null, "title": "Media release ICC congratulates Sana Mir for a superb career 26 Apr 20 - International Cricket Council", "description": "The International Cricket Council (ICC) has congratulated former Pakistan captain Sana Mir for an excellent career that saw her play 226 international matches, including 137 as captain.", "url": "https://www.icc-cricket.com/media-releases/1661161", "urlToImage": null, "publishedAt": "2020-04-26T07:14:34Z", "content": "Sana, who was the first female bowler from Pakistan to take 100 ODI wickets, announced her retirement on Saturday. Her list of achievements include becoming the first from her country to top the MRF Tyres ICC Womens ODI Rankings, reaching number one in the bo… [+1139 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Reubyn Coutinho", "title": "“He’s a Technical Beast”- Dominick Reyes Lauds Jan Blachowicz Wants Him As The Next Fight - Essentially Sports", "description": "UFC Light Heavyweight fighter Dominick Reyes has expressed interest in facing Jan Blachowicz and praised the Polish fighter's abilities.", "url": "https://www.essentiallysports.com/ufc-news-hes-a-technical-beast-dominick-reyes-lauds-jan-blachowicz-wants-him-as-the-next-fight/", "urlToImage": null, "publishedAt": "2020-04-26T07:11:00Z", "content": "Dominick Reyes came agonizingly close to ending Jon Jones’ lengthy run of wins in title fights. He lost via Unanimous Decision, something many fans believe was daylight robbery. ‘The Devastator’ has been very vocal in wanting a rematch against ‘Bones.’ Howeve… [+1805 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Coffee Proved Too Costly for Me, I Drink Green Tea: Hardik Pandya - News18", "description": "India all-rounder Hardik Pandya has joked that a cup of coffee proved too costly for him and he now drinks green tea instead in an Instagram live chat with wicket-keeper Dinesh Karthik. Pandya was referring to the controversy he landed in due to his comments …", "url": "https://www.news18.com/cricketnext/news/coffee-proved-too-costly-for-me-i-drink-green-tea-hardik-2593101.html", "urlToImage": null, "publishedAt": "2020-04-26T05:30:44Z", "content": "New Delhi: India all-rounder Hardik Pandya has joked that a cup of coffee proved too costly for him and he now drinks green tea instead in an Instagram live chat with wicket-keeper Dinesh Karthik. Pandya was referring to the controversy he landed in due to hi… [+1475 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Anirudh Singh", "title": "R Ashwin reveals how MS Dhoni helped him to dismiss Jonathan Trott in Champion Trophy 2013... - The Cricket Times", "description": "Ravichandran Ashwin and his former India teammate Suresh Raina had a live Instagram session on Friday evening. And, the duo recalled some cherishing memories while they used to play together for Team India and Chennai Super Kings (CSK) in IPL. During the inte…", "url": "https://crickettimes.com/2020/04/r-ashwin-reveals-how-ms-dhoni-helped-him-to-dismiss-jonathan-trott-in-champion-trophy-2013-final/", "urlToImage": null, "publishedAt": "2020-04-26T05:07:40Z", "content": "Ravichandran Ashwin and his former India teammate Suresh Raina had a live Instagram session on Friday evening. And, the duo recalled some cherishing memories while they used to play together for Team India and Chennai Super Kings (CSK) in IPL.\r\nDuring the int… [+2463 chars]"}, {"source": {"id": null, "name": "Tribalfootball.com"}, "author": "Carlos Volcano", "title": "Raiola and Alfie force Real Madrid president Florentino to go cold on Haaland - Tribal Football", "description": "Real Madrid president Florentino Perez is pulling back from plans of a move for Borussia Dortmund striker Erling Haaland.Mundo Deportivo says fees that will be", "url": "https://www.tribalfootball.com/articles/raiola-and-alfie-force-real-madrid-president-florentino-to-go-cold-on-haaland-4323870", "urlToImage": null, "publishedAt": "2020-04-26T04:45:14Z", "content": "Real Madrid president Florentino Perez is pulling back from plans of a move for Borussia Dortmund striker Erling Haaland.\r\nMundo Deportivo says fees that will be owed to agent Mino Raiola along with the player's father, Alf-inge has put Madrid off from signin… [+526 chars]"}, {"source": {"id": null, "name": "Tennisworldusa.org"}, "author": "Claudiu Pop", "title": "Roger Federer and Rafael Nadal’s favorite movies and series revealed - Tennis World USA", "description": "Tennis - See if your taste in cinematography matches the two tennis legends’", "url": "https://www.tennisworldusa.org/tennis/news/Rafael_Nadal/86917/roger-federer-and-rafael-nadals-favorite-movies-and-series-revealed/", "urlToImage": null, "publishedAt": "2020-04-26T04:14:33Z", "content": "If you’ve ever wondered what movies do tennis legends like Roger Federer and Rafael Nadal binge-watch in their hotel rooms and, nowadays, in self-isolation, then we have the answer for you. \r\nRafael Nadal’s top movies and series\r\nI Know Who You Are\r\n In a rec… [+2376 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "David Warner shares adorable dance video with wife Candice, daughters--Watch - Zee News", "description": "Warner was set to represent Sunrisers Hyderabad in the IPL 2020, which was due to take place from March 29 but it has now been postponed indefinitely due to coronavirus.", "url": "https://zeenews.india.com/cricket/david-warner-shares-adorable-dance-video-with-wife-candice-daughters-watch-2279018.html", "urlToImage": null, "publishedAt": "2020-04-26T04:02:33Z", "content": "As all the sporting activities across the globe are currently at standstill due to coronavirus pandemic, swashbuckling Australian opener David Warner is keeping his fans entertained by constantly posting videos with his family on social media.\r\nFrom shaking l… [+1516 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Rasesh Mandani", "title": "Bailout plan: Play more matches with India - Hindustan Times", "description": "Later this year, the new Future Tours Programme (FTP) for the years 2023-2031 will be finalised; the ICC continues to be heavily dependent on the BCCI for revenue.", "url": "https://www.hindustantimes.com/cricket/bailout-plan-play-more-matches-with-india/story-VRqndyDqK1aBAy0bT21qoO.html", "urlToImage": null, "publishedAt": "2020-04-26T02:57:47Z", "content": "The Board of Control for Cricket in India (BCCI), the richest body in world cricket, has come up with a plan to help countries facing losses due to the cancellation of cricket worldwide -- although the idea is contingent on games resuming.\r\nAccording to BCCI … [+4642 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "ESPNcricinfo staff", "title": "Pick the readers' all-time CSK XI | ESPNcricinfo.com - ESPNcricinfo", "description": "Who would make it to your all-time Chennai Super Kings XI? | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29096845/pick-readers-all-csk-xi", "urlToImage": null, "publishedAt": "2020-04-26T02:47:31Z", "content": "Wouldn't it be fun to pick an all-time Chennai Super Kings' XI, based on player stats for the franchise? We've picked ours, now it's your turn to participate in choosing the readers' XI.\r\nThe readers' CSK XI will consist of the 11 players with the most votes,… [+405 chars]"}, {"source": {"id": null, "name": "Chessbase.com"}, "author": "", "title": "Magnus Carlsen Invitational: Nakamura in sole second place - Chessbase News", "description": "Hikaru Nakamura and Ding Liren obtained key victories in round four of the Magnus Carlsen Invitational. Nakamura took down Ian Nepomniachtchi 2½:1½, while Ding had black and drew Anish Giri in the Armageddon decider of their match-up. Nakamura is now in sole …", "url": "https://en.chessbase.com/post/magnus-carlsen-invitational-2020-r4-b", "urlToImage": null, "publishedAt": "2020-04-26T01:59:35Z", "content": "Ding wins in Armageddon\r\nThe fight to reach the final-four knockout of the Magnus Carlsen Invitational has almost completely been narrowed down to six players. Carlsen and Nakamura are favourites to qualify, while Ding and Fabiano Caruana are leading the race… [+5829 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Referee reveals why he could have sent Maradona off before 1990 World Cup final - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T01:55:00Z", "content": "More"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "Members question HCA move to fund clubs - Cricbuzz - Cricbuzz", "description": "The Hyderabad Cricket Association paid Rs 50,000 each to nearly 160 private clubs and district associations - amounting to Rs 80 lakh", "url": "https://www.cricbuzz.com/cricket-news/112932/members-question-hca-move-to-fund-clubs", "urlToImage": null, "publishedAt": "2020-04-26T01:08:26Z", "content": "Though some members had stated that they were not interested in the money, the HCA deposited it in their account. © Getty\r\nDefying logic, the Hyderabad Cricket Association (HCA) paid Rs 50,000 each to nearly 160 private clubs and district associations - amoun… [+2326 chars]"}, {"source": {"id": null, "name": "Dawn.com"}, "author": "Abdul Ghaffar", "title": "I will be the first to take salary cut if required: Wasim - DAWN.com", "description": "PCB chief executive says body can \"handle financial challenges for the next couple of years\".", "url": "https://www.dawn.com/news/1552231", "urlToImage": null, "publishedAt": "2020-04-26T01:03:09Z", "content": "KARACHI: Pakistan Cricket Boards Chief Executive Wasim Khan, while talking to DawnNews on Friday, said the PCB can handle financial challenges for the next couple of years, but if need be, he will himself take the lead in accepting a salary cut.\r\nWe are lucky… [+2753 chars]"}, {"source": {"id": null, "name": "Espn.co.uk"}, "author": "Adrian Wojnarowski", "title": "NBA reopening team practice facilities Friday where local restrictions eased, sources say - ESPN.co.uk", "description": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.", "url": "https://www.espn.co.uk/nba/story/_/id/29099194/nba-reopening-team-practice-facilities-friday-where-local-restrictions-eased-sources-say", "urlToImage": null, "publishedAt": "2020-04-25T23:09:06Z", "content": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.\r\nPlayers can return to team facilities in states such as … [+2131 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "ESPN", "title": "Ex-Chelsea forward Costa: Conte would never last as Real Madrid boss - ESPN India", "description": "Former Chelsea forwarded Diego Costa told ESPN Brasil that he thinks Antonio Conte could never last a full season at a club like Real Madrid.", "url": "https://www.espn.in/football/chelsea/story/4088814/ex-chelsea-forward-costa-conte-would-never-last-as-real-madrid-boss", "urlToImage": null, "publishedAt": "2020-04-25T21:38:12Z", "content": "Former Chelsea forward Diego Costa told ESPN Brasil that he thinks Antonio Conte could never last a full season at a club like Real Madrid.\r\nCosta left Chelsea at the end of the 2016-17 season following a row with Conte and returned to Atletico Madrid -- the … [+2163 chars]"}, {"source": {"id": null, "name": "Trendinindia.in"}, "author": "sourav chowdhury", "title": "PV Sindhu says was desperate to win World Championships as people started calling her 'silver Sindhu' - Trendinindia", "description": "Star shuttler P V Sindhu says she was desperate to win the World Championships title final yr after a string of runner-up finishes as people started calling her \"silver Sindhu\".Sindhu, who additionally gained a silver medal within the 2016 Rio Olympics, admit…", "url": "https://trendinindia.in/pv-sindhu-says-was-desperate-to-win-world-championships-as-people-started-calling-her-silver-sindhu/", "urlToImage": null, "publishedAt": "2020-04-25T19:36:04Z", "content": "Star shuttler P V Sindhu says she was desperate to win the World Championships title final yr after a string of runner-up finishes as people started calling her “silver Sindhu”.\r\nSindhu, who additionally gained a silver medal within the 2016 Rio Olympics, adm… [+2142 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'Very doubtful' Premier League will play again in 2019-20, says Dutch FA chief - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T18:27:00Z", "content": "More"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "West Indies ‘flexible’ over England tour as ECB weigh overseas offers - Hindustan Times", "description": "CWI chief executive Johnny Grave insisted while the West Indies were open to a change of dates, player safety remained the priority.", "url": "https://www.hindustantimes.com/cricket/west-indies-flexible-over-england-tour-as-ecb-weigh-overseas-offers/story-wpJLafjIXTVJmWL2a42NOO.html", "urlToImage": null, "publishedAt": "2020-04-25T17:48:48Z", "content": "Cricket West Indies have said they are “flexible” about rearranging their tour of England but will not risk their players’ health just to complete a three-Test series.\r\n The fixtures were all due to take place in June but Friday saw the England and Wales Cric… [+1969 chars]"}, {"source": {"id": null, "name": "Theprideoflondon.com"}, "author": "Travis Tyler", "title": "Chelsea what ifs: Michael Ballack and Michael Essien hold up - The Pride of London", "description": "The midfield of Michael Ballack, Michael Essien, and Frank Lampard is regarded as Chelsea's best ever. What if the former two stayed healthy? Michael Essie...", "url": "https://theprideoflondon.com/2020/04/25/chelsea-ifs-michael-ballack-michael-essien-hold/", "urlToImage": null, "publishedAt": "2020-04-25T17:25:32Z", "content": "Michael Essien wins the ball back. Michael Ballack makes an inch perfect pass. Frank Lampard bangs it into the top corner. That is the stuff Chelsea dreams are made of.\r\nTechnically, the three spent four seasons together. Realistically, it was really only abo… [+2670 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Rohit Sharma picks his top 5 India batsmen of all time - Hindustan Times", "description": "Sourav Ganguly, Sachin Tendulkar, Rahul Dravid, VVS Laxman and Virender Sehwag all made the list but Rohit included the caveat that these are the players that he has seen in action.", "url": "https://www.hindustantimes.com/cricket/rohit-sharma-picks-his-top-5-india-batsmen-of-all-time/story-kPLmdYWE0Bb4VrtVrA1DOP.html", "urlToImage": null, "publishedAt": "2020-04-25T17:14:00Z", "content": "Indian cricket team batsman Rohit Sharma was asked to pick the top five India batsman and he decided to include five modern legends in his name. Sourav Ganguly, Sachin Tendulkar, Rahul Dravid, VVS Laxman and Virender Sehwag all made the list but Rohit include… [+1998 chars]"}, {"source": {"id": null, "name": "Gulfnews.com"}, "author": "IANS", "title": "Gambhir, Akram had big influence on me at KKR: Kuldeep Yadav - Gulf News", "description": "Kuldeep started his Indian Premier League career at Mumbai Indians in 2012", "url": "https://gulfnews.com/sport/cricket/gambhir-akram-had-big-influence-on-me-at-kkr-kuldeep-yadav-1.1587830295394", "urlToImage": null, "publishedAt": "2020-04-25T15:55:26Z", "content": "Kuldeep Yadav\r\n Image Credit: Reuters\r\nNew Delhi: Indian sinner Kuldeep Yadav spoke about the influence that Gautam Gambhir and Wasim Akram had on him in his early days at the Kolkata Knight Riders. Kuldeep said that Gambhir, who captained KKR to two titles i… [+2097 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Followed my heroes Vivian Richards and MS Dhoni: Kapil Dev on his lockdown look - India Today", "description": "Kapil Dev, who was known for his curls during his playing days, has always been open to trying new looks. The lockdown period in the country has given the legendary all-rounder the time to experiment with his looks.", "url": "https://www.indiatoday.in/sports/cricket/story/followed-my-heroes-vivian-richards-and-ms-dhoni-kapil-dev-on-his-lockdown-look-1671071-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T15:09:12Z", "content": "Former India captain and World Cup-winner Kapil Dev has revealed that his new lockdown look has been inspired by Vivian Richards and MS Dhoni. Kapil Dev said that he had seen MS Dhoni sporting bald look after 2011 World Cup and had thought that he will also d… [+1312 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Anirudh Singh", "title": "Actress Nidhhi Agerwal clears the air about unfollowing KL Rahul on social... - The Cricket Times", "description": "Cricketers link-up with Bollywood actresses is very commonly seen days. Even though Virat Kohli and Anushka Sharma are right now termed as the 'power couple', there is much more to that. There have been many other successful couples and sad breakups seen by c…", "url": "https://crickettimes.com/2020/04/nidhhi-agerwal-clears-the-air-about-unfollowing-kl-rahul-on-social-media/", "urlToImage": null, "publishedAt": "2020-04-25T15:03:35Z", "content": "Cricketers link-up with Bollywood actresses is very commonly seen days. Even though Virat Kohli and Anushka Sharma are right now termed as the ‘power couple’, there is much more to that.\r\nThere have been many other successful couples and sad breakups seen by … [+1428 chars]"}, {"source": {"id": null, "name": "Bayernstrikes.com"}, "author": "Kiran Thakare", "title": "What went wrong for Philippe Coutinho at Bayern Munich? - Bayern Strikes", "description": "Philippe Coutinho showed glimpses of his brilliance, but couldn't shine over a season for Bayern Munich. Bayern Munich delivered their biggest win of the d...", "url": "https://bayernstrikes.com/2020/04/25/philippe-coutinho-struggles-bayern-munich/", "urlToImage": null, "publishedAt": "2020-04-25T14:51:17Z", "content": "Bayern Munich delivered their biggest win of the domestic season against Werder Bremen in December. The defending champions desperately needed this victory after suffering consecutive defeats against Borussia Monchengladbach and Bayer Leverkusen.\r\nPhilippe Co… [+3550 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": "", "title": "Taipei T10 League 2020, Match 6: TCA Indians vs Taiwan Dragons – Dream11 Fantasy Cricket Tips – Playing XI, Pitch Report & Injury Update - CricTracker", "description": "Taipei T10 League 2020: Dream11 Fantasy Cricket Tips, Playing XIs, Best XIs, Yingfeng Pitch Report & Injury News for Match 6, TCA Indians vs Taiwan Dragons.", "url": "https://www.crictracker.com/taipei-t10-league-2020-match-6-tca-indians-vs-taiwan-dragons-dream11-fantasy-cricket-tips-playing-xi-pitch-report-injury-update/", "urlToImage": null, "publishedAt": "2020-04-25T13:12:49Z", "content": "Yingfeng Cricket Ground in Songshan District. (Photo Source: Twitter)\r\nMatch Details:\r\nThe 6th match of the Taipei T10 League 2020 will be played between TCA Indians and Taiwan Dragons at the Yingfeng Cricket Ground in Songshan District.\r\nThe match starts at … [+3739 chars]"}, {"source": {"id": null, "name": "Thesportsrush.com"}, "author": "Tanish Chachra", "title": "Manchester City star David Silva names best Premier League player of his era - The Sportsrush", "description": "Manchester City star David Silva picks best Premier League player to play in his era as he goes live on for an AMA on social media. Manchester City's captain David Silva has completed 10 years in the Premier League this year and in his time with the Citizens,…", "url": "https://thesportsrush.com/manchester-city-star-david-silva-names-best-premier-league-player-of-his-era/", "urlToImage": null, "publishedAt": "2020-04-25T13:12:00Z", "content": "Manchester City star David Silva picks best Premier League player to play in his era as he goes live on for an AMA on social media.\r\nManchester City’s captain David Silva has completed 10 years in the Premier League this year and in his time with the Citizens… [+1530 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Vinayak Manoj", "title": "WATCH: UFC Drops a Chilling Promo For Tony Ferguson vs Justin Gaethje - Essentially Sports", "description": "Ahead of UFC 249, the promotion have dropped an insane video as an effort to promote the upcoming star studded event that will take place on May 9th.", "url": "https://www.essentiallysports.com/ufc-249-news-watch-ufc-drops-a-chilling-promo-for-tony-ferguson-vs-justin-gaethje/", "urlToImage": null, "publishedAt": "2020-04-25T12:45:00Z", "content": "With a lot of uncertainty looming over the future of the UFC lightweight division, a new promotional video for the headliner comes as a sign of relief for fans all over the world.\r\nGuaranteeing fireworks, the star-studded UFC 249 roster is one of the greatest… [+2051 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Miscreants attempt to rob stumper Saha's Siliguri home, says relative - Hindustan Times", "description": "Saha, 35, lives in South Kolkata with his wife and children. The experienced stumper’s parents, who live in their Ward No.31 Shaktigarh area house in Siliguri, are at present staying with their son in Kolkata.", "url": "https://www.hindustantimes.com/cricket/miscreants-attempt-to-rob-stumper-saha-s-siliguri-home-says-relative/story-tRusZSKZV1FBBTmYrEWIlO.html", "urlToImage": null, "publishedAt": "2020-04-25T12:04:21Z", "content": "A relative of Wriddhiman Saha has alleged that a few miscreants tried to break into the India Test wicketkeeper’s ancestral home in Siliguri, North Bengal, on Friday in a bungled attempt to rob the place.\r\nSaha, 35, lives in South Kolkata with his wife and ch… [+1344 chars]"}, {"source": {"id": null, "name": "Sempreinter.com"}, "author": null, "title": "Chelsea Join Inter In Race To Sign 70M Rated Arsenal Striker Aubameyang - SempreInter", "description": "Chelsea are interested in Inter target Pierre Emerick Aubameyang, according to a report from international broadcaster ESPN earlier today. The report", "url": "https://sempreinter.com/2020/04/25/chelsea-join-inter-in-race-to-sign-70m-rated-arsenal-striker-aubameyang/", "urlToImage": null, "publishedAt": "2020-04-25T11:21:28Z", "content": "Chelsea are interested in Inter target Pierre Emerick Aubameyang, according to a report from international broadcaster ESPN earlier today.\r\nThe report details how the Blues have identified the Gabonese striker as the ideal player to reinforce their attack nex… [+784 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Oliver Browning", "title": "WWE news: The 30 greatest pro wrestlers of all-time have been ranked - GIVEMESPORT", "description": "WWE news: The 30 greatest pro wrestlers of all-time have been ranked", "url": "https://www.givemesport.com/1564783-wwe-news-the-30-greatest-pro-wrestlers-of-alltime-have-been-ranked", "urlToImage": null, "publishedAt": "2020-04-25T10:59:58Z", "content": "There are so many legendary names linked with professional wrestling. \r\nWWE stars like Hulk Hogan, The Undertaker, Andre the Giant and The Rock instantly spring to mind. \r\nThen, of course, there are some that have made a name for themselves outside of America… [+1569 chars]"}, {"source": {"id": null, "name": "Liverpool.com"}, "author": "Dan Morgan", "title": "Liverpool's deadly Fab Four promised unseen greatness, and should still be Anfield's biggest regret - Liverpool.com", "description": "How the Reds' short-lived quartet promised so much until Phillipe Coutinho's departure to Barcelona.", "url": "https://www.liverpool.com/liverpool-fc-news/features/liverpool-salah-mane-firmino-coutinho-18146294", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": "When the history books are written from this Liverpool era, they will tell us that the Reds' current front three of Sadio Mané, Roberto Firmino and Mohamed Salah are up there with the very best in terms of Anfield attacks. The anniversaries of days like yeste… [+3414 chars]"}, {"source": {"id": null, "name": "Juvefc.com"}, "author": "juvefcdotcom", "title": "Cristiano Ronaldo will remain with Juventus - JuveFC", "description": "Cristiano Ronaldo will remain with Juventus until 2022, according to Tuttosport.", "url": "https://www.juvefc.com/cristiano-ronaldo-will-remain-with-juventus/", "urlToImage": null, "publishedAt": "2020-04-25T09:42:58Z", "content": "Cristiano Ronaldo will remain with Juventus until 2022, according to Tuttosport.\r\nThe 34-year-old has been with the Bianconeri for two seasons of his four-year contract after a big money move from Real Madrid in 2018.\r\nReports in Spanish and Italian press hav… [+409 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Arjun Athreya", "title": "Three Things We Want To See From the Kobe Bryant Documentary - Essentially Sports", "description": "Kobe Bryant spent 20 years with the Los Angeles Lakers. It has now been confirmed that his last season was being completely documented by a film crew.", "url": "https://www.essentiallysports.com/nba-news-three-things-we-want-to-see-from-the-kobe-bryant-documentary/", "urlToImage": null, "publishedAt": "2020-04-25T09:40:00Z", "content": "The Last Dance, a ten-part documentary on Michael Jordans final season with the Chicago Bulls was released recently. Ever since the series claimed a massive following, fans have been chirping for a similar documentary to be made on the legacy of the late Kobe… [+5764 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "‘You don’t want the fear,’ Yuvraj Singh explains why cricket should return only after Covid-19 is e... - Hindustan Times", "description": "Like other sports, international and domestic cricket too has been disrupted leading the national boards to contemplate resuming the game in empty stadiums, without fans.", "url": "https://www.hindustantimes.com/cricket/you-don-t-want-the-fear-yuvraj-singh-explains-why-cricket-should-return-only-after-covid-19-is-eradicated/story-7okHJdLw1JTTSzbxY9JJ6L.html", "urlToImage": null, "publishedAt": "2020-04-25T09:34:05Z", "content": "Former India star Yuvraj Singh wants cricket to resume only when the world becomes COVD-19 free as players’ health and safety should be paramount for the custodians of the game.\r\nLike other sports, international and domestic cricket too has been disrupted lea… [+1271 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": null, "title": "‘He was a real pain in the back for us’ – Pat Cummins picks Cheteshwar Pujara as the toughest batsman to bowl - CricTracker", "description": "Pat Cummins, who is the World's number 1 Test bowler, recalled the painstaking series for Australia in 2018-19 season which India", "url": "https://m.crictracker.com/he-was-a-real-pain-in-the-back-for-us-pat-cummins-picks-cheteshwar-pujara-as-the-toughest-batsman-to-bowl/", "urlToImage": null, "publishedAt": "2020-04-25T09:04:22Z", "content": "Pat Cummins and Cheteshwar Pujara. (Photo Source: Getty Images)\r\nTeam India scripted history during their previous Australia tour by winning their first ever Test series down under. Though the hosts missed their best batsman in David Warner and Steve Smith, A… [+1980 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Saketh Kandadai", "title": "“It Was Not an Easy Night”: Steve Kerr Narrates a Hilarious Betting Story of Michael Jordan From Their College Days - Essentially Sports", "description": "Golden State Warriors coach Steve Kerr revealed a funny betting story with his former Chicago Bulls teammate Michael Jordan.", "url": "https://www.essentiallysports.com/nba-news-chicago-bulls-it-was-not-an-easy-night-steve-kerr-narrates-a-hilarious-betting-story-of-michael-jordan-from-their-college-days/", "urlToImage": null, "publishedAt": "2020-04-25T07:25:11Z", "content": "Golden State Warriors coach Steve Kerr revealed a funny betting story with his former teammate Michael Jordan.\r\nIt was during a game when Kerr was playing for the University of Arizona while Jordan was at the University of North Carolina. Kerr’s Wildcats defe… [+2070 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Rob Swan", "title": "Premier League football could be back on live TV ‘within weeks’ - GIVEMESPORT", "description": "Premier League football could be back on live TV ‘within weeks’", "url": "https://www.givemesport.com/1564740-premier-league-football-could-be-back-on-live-tv-within-weeks", "urlToImage": null, "publishedAt": "2020-04-25T07:13:11Z", "content": "It seems increasingly likely that the 2019-20 Premier League season will be concluded, according to fresh reports.\r\nNo top-flight football has been played in England since March 9 due to the ongoing coronavirus pandemic, which has threatened to lead to the ca… [+2264 chars]"}, {"source": {"id": null, "name": "Icc-cricket.com"}, "author": "ICC", "title": "Obituary: Graeme Watson - International Cricket Council", "description": "Graeme Watson, an all-rounder who featured in five Tests and two ODIs for Australia, died at 75 following a battle with cancer.", "url": "https://www.icc-cricket.com/news/1660856/obituary-graeme-watson", "urlToImage": null, "publishedAt": "2020-04-25T07:10:21Z", "content": "Graeme Watson, an all-rounder who featured in five Tests and two ODIs for Australia, died at 75 following a battle with cancer.Watson, a middle-order batsman and medium-pace bowler, finished his career with 4,674 runs and 186 wickets from 107 first-class game… [+1984 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "No to saliva, yes to shine: Ball-tampering laws in cricket may change - Times of India", "description": "Cricket News: Cricket may change ball-tampering laws and approve external method to help polish the red cherry in proposed post-corona measures. The matter of saliv", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/no-to-saliva-yes-to-shine-ball-tampering-laws-in-cricket-may-change/articleshow/75367490.cms", "urlToImage": null, "publishedAt": "2020-04-25T04:40:29Z", "content": "NEW DELHI: The coronavirus pandemic may force cricket's world governing body to tweak one of its oldest rules and approve the use of an artificial substance to help shine the ball, effectively legalizing what has for long been a core tenet of the sport's anti… [+4836 chars]"}, {"source": {"id": null, "name": "Chessbase.com"}, "author": "", "title": "Magnus Carlsen Invitational: Carlsen and Caruana score convincing wins - Chessbase News", "description": "World numbers one and two, Magnus Carlsen and Fabiano Caruana, won their round-four matches without needing tiebreaks, thus collecting three points each. Carlsen has won all his confrontations so far and is the clear leader with eleven points. He defeated Max…", "url": "https://en.chessbase.com/post/magnus-carlsen-invitational-2020-r4-a", "urlToImage": null, "publishedAt": "2020-04-25T00:34:12Z", "content": "A memorable pawn structure\r\nJust by looking at the results of Friday's round at the Magnus Carlsen Invitational it is hard to figure out how the matches developed. Caruana got a 3:1 victory over Firouzja and even started the match-up with two wins, but the co… [+5047 chars]"}, {"source": {"id": "marca", "name": "Marca"}, "author": "Christian Gaudioso, Adapted by Billy Munday", "title": "Tebas: Once we're allowed to restart the season, clubs will be punished if they refuse to play - MARCA.com", "description": "LaLiga president Javier Tebas has insisted that teams who refuse to play the rest of the season will be punished.\n\nOrganisations like the Spanish...", "url": "https://www.marca.com/en/football/spanish-football/2020/04/24/5ea335ee46163fd4248b4661.html", "urlToImage": null, "publishedAt": "2020-04-24T18:58:00Z", "content": "LaLiga president Javier Tebas has insisted that teams who refuse to play the rest of the season will be punished.\r\nOrganisations like the Spanish Footballers' Association (AFE) have expressed their concern over player safety once the season resumes.\r\n\"If a cl… [+2899 chars]"}, {"source": {"id": null, "name": "Atptour.com"}, "author": null, "title": "Virtual Blockbuster! Rafael Nadal & Andy Murray In Same Group In Mutua Madrid Open Virtual Pro - ATP Tour", "description": "The draw for the Mutua Madrid Open Virtual Pro has been made, and although the action will be played in a video game, there is a round-robin blockbuster that jumps off the page. Five-time Madrid champion Rafael Nadal is joined by another former World No. 1, A…", "url": "https://www.atptour.com/en/news/mutua-madrid-open-virtual-pro-2020-draw", "urlToImage": null, "publishedAt": "2020-04-24T18:30:30Z", "content": "The draw for the Mutua Madrid Open Virtual Pro has been made, and although the action will be played in a video game, there is a round-robin blockbuster that jumps off the page.\r\nFive-time Madrid champion Rafael Nadal is joined by another former World No. 1, … [+3125 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": "India Today Television", "title": "Absolutely priceless: Sachin Tendulkar spends a quiet 47th birthday with his mother - India Today", "description": "Sachin Tendulkar turned 47 on Friday. The Master Blaster decided not to celebrate his birthday this year as a mark of respect towards the Covid-19 warriors. In fact he has tweeted on the occasion with a picture with his mother captioning it: \"Started my day b…", "url": "https://www.indiatoday.in/sports/video/absolutely-priceless-sachin-tendulkar-spends-a-quiet-47th-birthday-with-his-mother-1670812-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T18:15:45Z", "content": "Sachin Tendulkar turned 47 on Friday. The Master Blaster decided not to celebrate his birthday this year as a mark of respect towards the Covid-19 warriors. In fact he has tweeted on the occasion with a picture with his mother captioning it: \"Started my day b… [+491 chars]"}]}