{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Lockdown has made me more dedicated and taught me that we can survive without eating outside, Hima Das te - Times of India", "description": "More sports News: From crying after meeting idol Sachin Tendulkar to learning how to be more dedicated during the coronavirus lockdown, India's star sprinter Hima Das o", "url": "https://timesofindia.indiatimes.com/sports/more-sports/athletics/lockdown-has-made-me-more-dedicated-and-taught-me-that-we-can-survive-without-eating-outside-hima-das-tells-suresh-raina/articleshow/75391961.cms", "urlToImage": null, "publishedAt": "2020-04-26T14:31:03Z", "content": "NEW DELHI: From crying after meeting idol Sachin Tendulkar to learning how to be more dedicated during the coronavirus lockdown, India's star sprinter Hima Das opened up about her life in a candid chat with Indian cricketer Suresh Raina on Sunday.\r\nThe two In… [+3156 chars]"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Adnan Riaz", "title": "Neymar Breaks Down In Tears While Talking About Lionel Messi During His Barcelona Days - SPORTbible", "description": "It's safe to say that Lionel Messi has left a long, lasting impression on Paris Saint-Germain star Neymar when he was at Barcelona.", "url": "https://www.sportbible.com/football/reactions-news-neymar-breaks-down-in-tears-while-talking-about-lionel-messi-20200426", "urlToImage": null, "publishedAt": "2020-04-26T13:55:52Z", "content": "A teary-eyed Neymar spoke candidly about his time at Barcelona and the impact of Lionel Messi.\r\nThe 28-year-old Brazilian forward arrived at the Spanish club from Santos in 2013 and made 123 appearances and scored 68 times during his four-year stint at the Ca… [+1199 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "India Today League PUBG Mobile Invitational wrap: TSM ENTITY win championship, grand cash prize, MVP - India Today", "description": "India Today League PUBG Mobile Invitational: TSM ENTITY won the Championship and walked away with a cash prize of Rs 1.3 Lakh. Team SouL finished second and Team IND finished 3rd after 4 days of action-pakced gaming.", "url": "https://www.indiatoday.in/sports/other-sports/story/itpubl-tsm-entity-winnners-points-table-mvp-cash-prize-complete-list-pubg-mobile-invitational-1671358-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T13:07:41Z", "content": "TSM ENTITY won the championship and unprecedented prize money of Rs 1.3 Lakh at the India Today League PUBG Mobile Invitational that was held over four days from April 23 to 26. TSM ENTITY won 3 Chicken Dinners, including 1 on the final day, to finish with a … [+4183 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Asian News International", "title": "Was not able to get into my domestic side as spinner: Vijay Shankar - Hindustan Times", "description": "“I was not able to get into my domestic team when I was the spinner, I used to score runs but I did not manage to get into the side. Then I started bowling medium pace, and things really changed for me,” Shankar told Warner during the Instagram Live session.", "url": "https://www.hindustantimes.com/cricket/was-not-able-to-get-into-my-domestic-side-as-spinner-vijay-shankar/story-uMtu5gSWjzmvAyqEJ3zrsO.html", "urlToImage": null, "publishedAt": "2020-04-26T12:56:04Z", "content": "All-rounder Vijay Shankar on Sunday revealed that he was not able to make it to his domestic side as a spinner and this prompted him to become a medium-pacer.\r\nShankar was doing an Instagram Live session with Australian batsman David Warner on the official ha… [+971 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "KL Rahul names the cricketer he would pick to bat for his... - The Cricket Times", "description": "India's now first-choice wicketkeeper-batsman in coloured clothing, KL Rahul, recently selected the cricketer he would prefer to bat for his life. Rahul picked his captain and close friend Virat Kohli, while heaping praises for the prolific run-scorer in all …", "url": "https://crickettimes.com/2020/04/kl-rahul-names-the-cricketer-he-would-pick-to-bat-for-his-life/", "urlToImage": null, "publishedAt": "2020-04-26T12:34:11Z", "content": "India’s now first-choice wicketkeeper-batsman in coloured clothing, KL Rahul, recently selected the cricketer he would prefer to bat for his life.\r\nRahul picked his captain and close friend Virat Kohli, while heaping praises for the prolific run-scorer in all… [+1743 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Sports in times of COVID-19: Top Indian stars foresee new normal once pandemic mayhem ends - Times of India", "description": "More sports News: Will sports and watching sports ever be the same again in a world scarred by the COVID-19 pandemic? India's sportspersons -- current and former -- gaz", "url": "https://timesofindia.indiatimes.com/sports/more-sports/others/sports-in-times-of-covid-19-top-indian-stars-foresee-new-normal-once-pandemic-mayhem-ends/articleshow/75388631.cms", "urlToImage": null, "publishedAt": "2020-04-26T10:26:04Z", "content": "NEW DELHI: Will the fans rush back? Will training abroad be as hassle-free as it used to be? What about contact sports where social distancing can't really be practised?\r\nIn a nutshell, will sports and watching sports ever be the same again in a world scarred… [+6513 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "MS Dhoni always takes responsibility when team loses, says Mohit Sharma - Times of India", "description": "Cricket News: He has played most of his cricket under MS Dhoni and pacer Mohit Sharma says the revered former India skipper is a true leader who does not back off w", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/ms-dhoni-always-takes-responsibility-when-team-loses-says-mohit-sharma/articleshow/75388665.cms", "urlToImage": null, "publishedAt": "2020-04-26T10:26:03Z", "content": "NEW DELHI: He has played most of his cricket under MS Dhoni and pacer Mohit Sharma says the revered former India skipper is a true leader who does not back off when it comes to taking responsibility in challenging times.\r\nThe 31-year-old pacer has played unde… [+2580 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Cheteshwar Pujara was a real pain in the back: Pat Cummins - Times of India", "description": "Cricket News: Australia's world number one pacer Pat Cummins finds India's middle-order mainstay Cheteshwar Pujara the toughest batsman to bowl at in Test cricket a", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/cheteshwar-pujara-was-a-real-pain-in-the-back-pat-cummins/articleshow/75386607.cms", "urlToImage": null, "publishedAt": "2020-04-26T10:25:51Z", "content": "MELBOURNE: Australia's world number one pacer Pat Cummins finds India's middle-order mainstay Cheteshwar Pujara the toughest batsman to bowl at in Test cricket and called him a \"pain in the back\" for his team.\r\nWith his solid batting at number three, Pujara h… [+1085 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Minamino can save Liverpool millions despite unusual start - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T10:00:00Z", "content": "More"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Rafael sends Manchester United summer transfer warning - Goal India", "description": "Onome Ebi is doubtful about Nigeria's chances of maintaining its continental dominance in the coming years following a nervy triumph over South Africa at the 2018 African Women's Cup of Nations.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T09:41:00Z", "content": "More"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Sports Desk", "title": "'Don't talk to Sachin, if you do..': Brett Lee reveals Glenn McGrath's warning to bowlers for Tendulkar - India TV News", "description": "Brett Lee has revealed what Glenn McGrath used to tell the Australian bowlers before facing Sachin Tendulkar.", "url": "https://www.indiatvnews.com/sports/cricket-brett-lee-reveals-glenn-mcgrath-s-warning-to-bowlers-for-sachin-tendulkar-611457", "urlToImage": null, "publishedAt": "2020-04-26T09:20:14Z", "content": "Image Source : GETTY IMAGESBrett Lee has revealed what Glenn McGrath used to tell the Australian bowlers before facing Sachin Tendulkar.\r\nThe Australian cricket team has always been high on energy on the field -- both, with their skills and demeanour. The sid… [+1748 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘You almost finished my son’s career,’ Yuvraj Singh recalls 2007 six sixes, reveals chat with Broad... - Hindustan Times", "description": "Yuvraj slammed six maximums in one Broad over during his majestic 14-ball 58 which ultimately proved to be the difference between the two sides as India won the match by 18 runs.", "url": "https://www.hindustantimes.com/cricket/you-almost-finished-my-son-s-career-yuvraj-singh-recalls-2007-six-sixes-reveals-chat-with-broad-senior/story-9tCJTh6ddis6UBw9JpmstJ.html", "urlToImage": null, "publishedAt": "2020-04-26T08:55:46Z", "content": "One of the most iconic moments in world cricket is Yuvraj Singh hitting Stuart Broad for six sixes in an over at the 2007 T20 World Cup. India were in a strong position in the match against England but Yuvraj propelled his country to a mammoth score with six … [+1870 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Divya Goyal", "title": "‘Waheguru Baba’ to friends in Glasgow, ‘ustad’ to world’s oldest marathoner dies of Covid-19 - The Indian Express", "description": "Amrik Singh, 89, passed away at Birmingham's City Hospital with doctors struggling to understand his last words.", "url": "https://indianexpress.com/article/sports/waheguru-baba-to-friends-ustad-to-worlds-oldest-marathoner-dies-6379611/", "urlToImage": null, "publishedAt": "2020-04-26T08:48:06Z", "content": "Written by Divya Goyal\r\n | Ludhiana | \r\nUpdated: April 26, 2020 2:17:07 pm\r\nAmrik Singh, a Sikh marathon runner who was known as Waheguru Baba, had moved to Glasgow in Scotland in 1970. (Express photo)Sagey bhraavan vich khaar hundi hai, saada taan imaandaari… [+6933 chars]"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Gill Clark", "title": "Papers: De Ligt attentive to Barcelona, Ter Stegen on the edge - Barca Blaugranes", "description": "A look at the front pages in Spain", "url": "https://www.barcablaugranes.com/fc-barcelona-transfer-rumors-news/2020/4/26/21236769/papers-de-ligt-attentive-to-barcelona-ter-stegen-on-the-edge", "urlToImage": null, "publishedAt": "2020-04-26T08:38:04Z", "content": "Sundays front pages bring some interesting news regarding Juventus defender Matthijs de Ligt and Barcelona goalkeeper Marc-Andre ter Stegen.\r\nMundo Deportivo have the Dutchman on their front page with the headline De Ligt, Alert and a report that he is aware … [+871 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Will Tell TikTok to Block You because You're Annoying: Chris Gayle Trolls Yuzvendra Chahal - News18", "description": "Gayle referred to Chahal as 'annoying' and went on to the extent of saying that he is going to block him.", "url": "https://www.news18.com/news/buzz/will-tell-tiktok-to-block-you-because-youre-annoying-chris-gayle-trolls-yuzvendra-chahal-2593275.html", "urlToImage": null, "publishedAt": "2020-04-26T08:34:30Z", "content": "West Indies batsman Chris Gayle brutally roasted India spinner Yuzvendra Chahal for his social media posts during a live session on popular social media platform Instagram. With no cricket going due to coronavirus pandemic, players are engaging with fans thes… [+1055 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Rishi Karthikeyan", "title": "“He Has Never Cooked For Me” – Rafael Nadal Unsure If Roger Federer Can Cook - Essentially Sports", "description": "What skill would be the easiest to teach Roger Federer? Rafael Nadal has answered this question in a recent Twitter post. Check it out.", "url": "https://www.essentiallysports.com/he-has-never-cooked-for-me-before-rafael-nadal-unsure-if-roger-federer-can-cook-atp-tennis-news/", "urlToImage": null, "publishedAt": "2020-04-26T08:33:00Z", "content": "Swiss Maestro Roger Federer has demonstrated his amazing skill at the sport of tennis throughout his career. But what other skill could he learn easily to add to this? Let’s hear Rafael Nadal answer this question in a recent Twitter post.\r\nthe og question was… [+1643 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Keane: I didn't have much in common with Rooney and Ferdinand - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T08:05:00Z", "content": "More"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Abramovich's first signing Macho on the early days of the Chelsea revolution - Goal India", "description": "Onome Ebi is doubtful about Nigeria's chances of maintaining its continental dominance in the coming years following a nervy triumph over South Africa at the 2018 African Women's Cup of Nations.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T08:00:00Z", "content": "More"}, {"source": {"id": null, "name": "Icc-cricket.com"}, "author": null, "title": "Media release ICC congratulates Sana Mir for a superb career 26 Apr 20 - International Cricket Council", "description": "The International Cricket Council (ICC) has congratulated former Pakistan captain Sana Mir for an excellent career that saw her play 226 international matches, including 137 as captain.", "url": "https://www.icc-cricket.com/media-releases/1661161", "urlToImage": null, "publishedAt": "2020-04-26T07:14:34Z", "content": "Sana, who was the first female bowler from Pakistan to take 100 ODI wickets, announced her retirement on Saturday. Her list of achievements include becoming the first from her country to top the MRF Tyres ICC Womens ODI Rankings, reaching number one in the bo… [+1139 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "New look inspired by heroes Viv Richards and MS Dhoni: Kapil Dev - Times of India", "description": "Cricket News: India's 1983 World Cup-winning captain, Kapil Dev, is sporting a new look these days, having shaved his head bald while keeping a beard, somewhat simi", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/new-look-inspired-by-heroes-viv-richards-and-ms-dhoni-kapil-dev/articleshow/75386212.cms", "urlToImage": null, "publishedAt": "2020-04-26T06:16:33Z", "content": null}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Anirudh Singh", "title": "R Ashwin reveals how MS Dhoni helped him to dismiss Jonathan Trott in Champion Trophy 2013... - The Cricket Times", "description": "Ravichandran Ashwin and his former India teammate Suresh Raina had a live Instagram session on Friday evening. And, the duo recalled some cherishing memories while they used to play together for Team India and Chennai Super Kings (CSK) in IPL. During the inte…", "url": "https://crickettimes.com/2020/04/r-ashwin-reveals-how-ms-dhoni-helped-him-to-dismiss-jonathan-trott-in-champion-trophy-2013-final/", "urlToImage": null, "publishedAt": "2020-04-26T05:07:40Z", "content": "Ravichandran Ashwin and his former India teammate Suresh Raina had a live Instagram session on Friday evening. And, the duo recalled some cherishing memories while they used to play together for Team India and Chennai Super Kings (CSK) in IPL.\r\nDuring the int… [+2463 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Sports Desk", "title": "Messi or Ronaldo? Brazilian legends Pele, Ronaldinho and Ronaldo answer - The Indian Express", "description": "Who is a more complete player - Lionel Messi or Cristiano Ronaldo? Brazilian legends Pele, Ronaldinho and Ronaldo pick their side.", "url": "https://indianexpress.com/article/sports/football/messi-or-ronaldo-brazilian-legends-pele-ronaldinho-and-ronaldo-answer-6378475/", "urlToImage": null, "publishedAt": "2020-04-26T05:04:15Z", "content": "Messi or Ronaldo? Brazilian legends Pele, Ronaldinho and Ronaldo pick their sideWith coronavirus bringing sports and life in general to a halt in the entire world, football stars have started answering difficult questions: Who is the best in the world – Lione… [+2552 chars]"}, {"source": {"id": null, "name": "Tribalfootball.com"}, "author": "Carlos Volcano", "title": "Raiola and Alfie force Real Madrid president Florentino to go cold on Haaland - Tribal Football", "description": "Real Madrid president Florentino Perez is pulling back from plans of a move for Borussia Dortmund striker Erling Haaland.Mundo Deportivo says fees that will be", "url": "https://www.tribalfootball.com/articles/raiola-and-alfie-force-real-madrid-president-florentino-to-go-cold-on-haaland-4323870", "urlToImage": null, "publishedAt": "2020-04-26T04:45:14Z", "content": "Real Madrid president Florentino Perez is pulling back from plans of a move for Borussia Dortmund striker Erling Haaland.\r\nMundo Deportivo says fees that will be owed to agent Mino Raiola along with the player's father, Alf-inge has put Madrid off from signin… [+526 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "David Warner shares adorable dance video with wife Candice, daughters--Watch - Zee News", "description": "Warner was set to represent Sunrisers Hyderabad in the IPL 2020, which was due to take place from March 29 but it has now been postponed indefinitely due to coronavirus.", "url": "https://zeenews.india.com/cricket/david-warner-shares-adorable-dance-video-with-wife-candice-daughters-watch-2279018.html", "urlToImage": null, "publishedAt": "2020-04-26T04:02:33Z", "content": "As all the sporting activities across the globe are currently at standstill due to coronavirus pandemic, swashbuckling Australian opener David Warner is keeping his fans entertained by constantly posting videos with his family on social media.\r\nFrom shaking l… [+1516 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Rasesh Mandani", "title": "Bailout plan: Play more matches with India - Hindustan Times", "description": "Later this year, the new Future Tours Programme (FTP) for the years 2023-2031 will be finalised; the ICC continues to be heavily dependent on the BCCI for revenue.", "url": "https://www.hindustantimes.com/cricket/bailout-plan-play-more-matches-with-india/story-VRqndyDqK1aBAy0bT21qoO.html", "urlToImage": null, "publishedAt": "2020-04-26T02:57:47Z", "content": "The Board of Control for Cricket in India (BCCI), the richest body in world cricket, has come up with a plan to help countries facing losses due to the cancellation of cricket worldwide -- although the idea is contingent on games resuming.\r\nAccording to BCCI … [+4642 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "ESPNcricinfo staff", "title": "Pick the readers' all-time CSK XI | ESPNcricinfo.com - ESPNcricinfo", "description": "Who would make it to your all-time Chennai Super Kings XI? | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29096845/pick-readers-all-csk-xi", "urlToImage": null, "publishedAt": "2020-04-26T02:47:31Z", "content": "Wouldn't it be fun to pick an all-time Chennai Super Kings' XI, based on player stats for the franchise? We've picked ours, now it's your turn to participate in choosing the readers' XI.\r\nThe readers' CSK XI will consist of the 11 players with the most votes,… [+405 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Transfer news and rumours LIVE: Klopp calls Mbappe's dad over Liverpool switch - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T02:30:00Z", "content": "More"}, {"source": {"id": null, "name": "Chessbase.com"}, "author": "", "title": "Magnus Carlsen Invitational: Nakamura in sole second place - Chessbase News", "description": "Hikaru Nakamura and Ding Liren obtained key victories in round four of the Magnus Carlsen Invitational. Nakamura took down Ian Nepomniachtchi 2½:1½, while Ding had black and drew Anish Giri in the Armageddon decider of their match-up. Nakamura is now in sole …", "url": "https://en.chessbase.com/post/magnus-carlsen-invitational-2020-r4-b", "urlToImage": null, "publishedAt": "2020-04-26T01:59:35Z", "content": "Ding wins in Armageddon\r\nThe fight to reach the final-four knockout of the Magnus Carlsen Invitational has almost completely been narrowed down to six players. Carlsen and Nakamura are favourites to qualify, while Ding and Fabiano Caruana are leading the race… [+5829 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Referee reveals why he could have sent Maradona off before 1990 World Cup final - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T01:55:00Z", "content": "More"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "Members question HCA move to fund clubs - Cricbuzz - Cricbuzz", "description": "The Hyderabad Cricket Association paid Rs 50,000 each to nearly 160 private clubs and district associations - amounting to Rs 80 lakh", "url": "https://www.cricbuzz.com/cricket-news/112932/members-question-hca-move-to-fund-clubs", "urlToImage": null, "publishedAt": "2020-04-26T01:08:26Z", "content": "Though some members had stated that they were not interested in the money, the HCA deposited it in their account. © Getty\r\nDefying logic, the Hyderabad Cricket Association (HCA) paid Rs 50,000 each to nearly 160 private clubs and district associations - amoun… [+2326 chars]"}, {"source": {"id": null, "name": "Espn.co.uk"}, "author": "Adrian Wojnarowski", "title": "NBA reopening team practice facilities Friday where local restrictions eased, sources say - ESPN.co.uk", "description": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.", "url": "https://www.espn.co.uk/nba/story/_/id/29099194/nba-reopening-team-practice-facilities-friday-where-local-restrictions-eased-sources-say", "urlToImage": null, "publishedAt": "2020-04-25T23:09:06Z", "content": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.\r\nPlayers can return to team facilities in states such as … [+2131 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Everton 'appalled' after Kean breaks coronavirus guidelines to throw lockdown party - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T22:56:34Z", "content": "More"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Maitreyee Joshi", "title": "When Eminem Tried to Trash Talk Michael Jordan, But Regretted it Immediately - Essentially Sports", "description": "American rap icon Eminem describes the moment he almost blew his shot at a collaboration with NBA legend Michael Jordan by joking aboout dunking on him.", "url": "https://www.essentiallysports.com/nba-news-chicago-bulls-eminem-once-tried-to-trash-talk-michael-jordan-but-regretted-it-immediately/", "urlToImage": null, "publishedAt": "2020-04-25T22:38:00Z", "content": "Celebrities from the music industry are a common presence at NBA games. However, rarely does a musician talks trash to an actual NBA legend. Michael Jordan once experienced such a situation first hand.\r\nRecently, In an interview with SiriusXM’s “Sway in the M… [+1699 chars]"}, {"source": {"id": null, "name": "Thesportsrush.com"}, "author": "Jatin Hasija", "title": "YD vs TB Dream11 Prediction : Yulon Luxgen Dinos Vs Taiwan Beer Best Dream 11 Team for Final Game 4 of Super Basketball League 2019-20 - The Sportsrush", "description": "YD Vs TB Dream11 Team Overview, Match Centre and Probable Play 5: Taiwan finally unlock the true potential of their unit to hit back and restore parity in the finals Stunned by Yulon in the first two clashes of the final series, it took Taiwan Beer until the …", "url": "https://thesportsrush.com/yd-vs-tb-dream11-prediction-yulon-luxgen-dinos-vs-taiwan-beer-best-dream-11-team-for-final-game-4-of-super-basketball-league-2019-20/", "urlToImage": null, "publishedAt": "2020-04-25T22:23:00Z", "content": "YD Vs TB Dream11 Team Overview, Match Centre and Probable Play 5: Taiwan finally unlock the true potential of their unit to hit back and restore parity in the finals \r\nStunned by Yulon in the first two clashes of the final series, it took Taiwan Beer until th… [+4412 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "ESPN", "title": "Ex-Chelsea forward Costa: Conte would never last as Real Madrid boss - ESPN India", "description": "Former Chelsea forwarded Diego Costa told ESPN Brasil that he thinks Antonio Conte could never last a full season at a club like Real Madrid.", "url": "https://www.espn.in/football/chelsea/story/4088814/ex-chelsea-forward-costa-conte-would-never-last-as-real-madrid-boss", "urlToImage": null, "publishedAt": "2020-04-25T21:38:12Z", "content": "Former Chelsea forward Diego Costa told ESPN Brasil that he thinks Antonio Conte could never last a full season at a club like Real Madrid.\r\nCosta left Chelsea at the end of the 2016-17 season following a row with Conte and returned to Atletico Madrid -- the … [+2163 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Vinayak Manoj", "title": "“Khabib and Tony Will Never Happen”- Charles Oliveira Drops the Hammer on Khabib Nurmagomedov vs Tony Ferguson - Essentially Sports", "description": "Charles Oliveira recently revealed what he thinks about the highly elusive match-up,Tony Ferguson vs Khabib Nurmagomedov.", "url": "https://www.essentiallysports.com/ufc-249-news-khabib-and-tony-will-never-happen-charles-oliveira-drops-the-hammer-on-khabib-nurmagomedov-vs-tony-ferguson/", "urlToImage": null, "publishedAt": "2020-04-25T19:23:00Z", "content": "The fight between Tony Ferguson and Khabib Nurmagomedov fell through yet again. Following this, fans wonder whether this fight will ever happen or not. However, it seems like fellow lightweight Charles Oliveira has some clarity on this matter as MMA Fighting … [+2189 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'Very doubtful' Premier League will play again in 2019-20, says Dutch FA chief - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T18:27:00Z", "content": "More"}, {"source": {"id": null, "name": "Espn.in"}, "author": "Julien Laurens", "title": "Arsenal to return to training despite UK's coronavirus lockdown - ESPN India", "description": "Arsenal players will make a staggered return to training at their London Colney training ground next week, sources have told ESPN.", "url": "https://www.espn.in/football/arsenal/story/4089033/arsenal-to-return-to-training-despite-uks-coronavirus-lockdown-sources", "urlToImage": null, "publishedAt": "2020-04-25T18:24:56Z", "content": "Arsenal players will make a return to training at their London Colney training ground next week despite the UK still being on a government-imposed lockdown amid the coronavirus pandemic.\r\n- Stream every episode of 30 for 30: Soccer Stories on ESPN+\r\nThey are … [+2027 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "West Indies ‘flexible’ over England tour as ECB weigh overseas offers - Hindustan Times", "description": "CWI chief executive Johnny Grave insisted while the West Indies were open to a change of dates, player safety remained the priority.", "url": "https://www.hindustantimes.com/cricket/west-indies-flexible-over-england-tour-as-ecb-weigh-overseas-offers/story-wpJLafjIXTVJmWL2a42NOO.html", "urlToImage": null, "publishedAt": "2020-04-25T17:48:48Z", "content": "Cricket West Indies have said they are “flexible” about rearranging their tour of England but will not risk their players’ health just to complete a three-Test series.\r\n The fixtures were all due to take place in June but Friday saw the England and Wales Cric… [+1969 chars]"}, {"source": {"id": null, "name": "Theprideoflondon.com"}, "author": "Travis Tyler", "title": "Chelsea what ifs: Michael Ballack and Michael Essien hold up - The Pride of London", "description": "The midfield of Michael Ballack, Michael Essien, and Frank Lampard is regarded as Chelsea's best ever. What if the former two stayed healthy? Michael Essie...", "url": "https://theprideoflondon.com/2020/04/25/chelsea-ifs-michael-ballack-michael-essien-hold/", "urlToImage": null, "publishedAt": "2020-04-25T17:25:32Z", "content": "Michael Essien wins the ball back. Michael Ballack makes an inch perfect pass. Frank Lampard bangs it into the top corner. That is the stuff Chelsea dreams are made of.\r\nTechnically, the three spent four seasons together. Realistically, it was really only abo… [+2670 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘Since then I stay away from coffee,’ Hardik Pandya opens up on the ‘Koffee with Karan’ controversy - Hindustan Times", "description": "Hardik said on a lighter note that one cup of coffee proved very costly for him, referring to his controversial remark on TV show ‘Koffee With Karan’, which created a furore.", "url": "https://www.hindustantimes.com/cricket/since-then-i-stay-away-from-coffee-hardik-pandya-opens-up-on-the-koffee-with-karan-controversy/story-IBXLQ15vwDdElLh6IlC5hM.html", "urlToImage": null, "publishedAt": "2020-04-25T16:55:00Z", "content": "India all-rounder Hardik Pandya opened up for the first time on the Koffee With Karan episode that almost pushed his and teammate KL Rahul’s professional cricketing career on the brink. \r\nDuring an Instagram chat with Dinesh Karthik, Hardik also said on a lig… [+1207 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Akshat Gaur", "title": "Saqlain Mushtaq reveals the incident after which he never sledged Sachin... - The Cricket Times", "description": "Just a few hours down the line, Sachin Tendulkar turned 47, but due to the coronavirus pandemic, he didn't celebrate his birthday. However, his fans across the globe recalled the famous India versus Australia ODI game held at Sharjah when the cricketing world…", "url": "https://crickettimes.com/2020/04/saqlain-mushtaq-reveals-the-incident-after-which-he-never-sledged-sachin-tendulkar/", "urlToImage": null, "publishedAt": "2020-04-25T16:45:45Z", "content": "Just a few hours down the line, Sachin Tendulkar turned 47, but due to the coronavirus pandemic, he didn’t celebrate his birthday. However, his fans across the globe recalled the famous India versus Australia ODI game held at Sharjah when the cricketing world… [+2392 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Have gone mad searching for it: Jofra Archer reveals he has lost his World Cup 2019 medal - India Today", "description": "England fast bowler Jofra Archer said he has been searching for his World Cup medal at his new place over the last week without much success.", "url": "https://www.indiatoday.in/sports/cricket/story/jofra-archer-world-cup-2019-medal-lost-searching-new-flat-super-over-final-1671093-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T16:38:48Z", "content": "England fast bowler Jofra Archer said he misplaced his World Cup 2019 medal after he shifted his flat recently. Archer, who played a key role in England's historic triumph, added he has 'gone mad' searching for it at his new place.\r\nJofra Archer revealed he h… [+1644 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Asian Games gold medalist Dingko Singh airlifted to Delhi for cancer treatment - India Today", "description": "At a time when no airline is operational due to the Covid-19 lockdown, Dingko Singh was airlifted from Imphal for his cancer treatment in New Delhi.", "url": "https://www.indiatoday.in/sports/other-sports/story/dingko-singh-boxing-cancer-treatment-airlifted-imphal-delhi-lockdown-1671075-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T15:35:31Z", "content": "Asian Games Gold Medallist Dingko Singh was flown today from Imphal to Delhi by SpiceJet's air ambulance service for his liver cancer treatment. At a time when no airline is operational due to lockdown, the airline provided the air ambulance service free of c… [+975 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Anirudh Singh", "title": "Actress Nidhhi Agerwal clears the air about unfollowing KL Rahul on social... - The Cricket Times", "description": "Cricketers link-up with Bollywood actresses is very commonly seen days. Even though Virat Kohli and Anushka Sharma are right now termed as the 'power couple', there is much more to that. There have been many other successful couples and sad breakups seen by c…", "url": "https://crickettimes.com/2020/04/nidhhi-agerwal-clears-the-air-about-unfollowing-kl-rahul-on-social-media/", "urlToImage": null, "publishedAt": "2020-04-25T15:03:35Z", "content": "Cricketers link-up with Bollywood actresses is very commonly seen days. Even though Virat Kohli and Anushka Sharma are right now termed as the ‘power couple’, there is much more to that.\r\nThere have been many other successful couples and sad breakups seen by … [+1428 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "ESPNcricinfo staff", "title": "MS Dhoni 'doesn't want to' play for India again, says Harbhajan Singh | ESPNcricinfo.com - ESPNcricinfo", "description": "The offspinner speaks to Rohit Sharma on Dhoni's future and India's 2019 World Cup exit | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29093560/ms-dhoni-want-play-india-hints-harbhajan-singh", "urlToImage": null, "publishedAt": "2020-04-25T15:03:11Z", "content": "As far as Harbhajan Singh is concerned, MS Dhoni will never play for India again. Harbhajan, who trained with Dhoni in March at the Chennai Super Kings' preparatory camp for the IPL, said the former India captain had \"played enough\" for India.\r\nRecently, as s… [+4202 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Gambhir, Akram had big influence on me at KKR: Kuldeep - Hindustan Times", "description": "Kuldeep says that Gambhir continues to talk to him even after the end of the latter’s stint at KKR and his playing career itself.", "url": "https://www.hindustantimes.com/cricket/gambhir-akram-had-big-influence-on-me-at-kkr-kuldeep/story-s71gC0msbyMC3lgxHBY2yM.html", "urlToImage": null, "publishedAt": "2020-04-25T14:49:16Z", "content": "Indian sinner Kuldeep Yadav spoke about the influence that Gautam Gambhir and Wasim Akram had on him in his early days at the Kolkata Knight Riders. Kuldeep said that Gambhir, who captained KKR to two titles in 2012 and 2014, gave him confidence by assuring h… [+2136 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "Kane Williamson relives emotions of World Cup 2019 final loss - Cricbuzz - Cricbuzz", "description": "New Zealand captain stressed he was proud of the way his players adapted throughout the tournament to different conditions", "url": "https://www.cricbuzz.com/cricket-news/112930/kane-williamson-relives-emotions-of-world-cup-2019-final-loss", "urlToImage": null, "publishedAt": "2020-04-25T13:54:23Z", "content": "\"I think the thing we can reflect upon and be proud of the way we played the entire tournament.\" © Getty\r\nThere is a certain wave of calmness about Kane Williamson. On or off the cricket field, the New Zealand skipper is known for his composed approach and on… [+3431 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": "", "title": "Taipei T10 League 2020, Match 6: TCA Indians vs Taiwan Dragons – Dream11 Fantasy Cricket Tips – Playing XI, Pitch Report & Injury Update - CricTracker", "description": "Taipei T10 League 2020: Dream11 Fantasy Cricket Tips, Playing XIs, Best XIs, Yingfeng Pitch Report & Injury News for Match 6, TCA Indians vs Taiwan Dragons.", "url": "https://www.crictracker.com/taipei-t10-league-2020-match-6-tca-indians-vs-taiwan-dragons-dream11-fantasy-cricket-tips-playing-xi-pitch-report-injury-update/", "urlToImage": null, "publishedAt": "2020-04-25T13:12:49Z", "content": "Yingfeng Cricket Ground in Songshan District. (Photo Source: Twitter)\r\nMatch Details:\r\nThe 6th match of the Taipei T10 League 2020 will be played between TCA Indians and Taiwan Dragons at the Yingfeng Cricket Ground in Songshan District.\r\nThe match starts at … [+3739 chars]"}, {"source": {"id": null, "name": "Thesportsrush.com"}, "author": "Tanish Chachra", "title": "Manchester City star David Silva names best Premier League player of his era - The Sportsrush", "description": "Manchester City star David Silva picks best Premier League player to play in his era as he goes live on for an AMA on social media. Manchester City's captain David Silva has completed 10 years in the Premier League this year and in his time with the Citizens,…", "url": "https://thesportsrush.com/manchester-city-star-david-silva-names-best-premier-league-player-of-his-era/", "urlToImage": null, "publishedAt": "2020-04-25T13:12:00Z", "content": "Manchester City star David Silva picks best Premier League player to play in his era as he goes live on for an AMA on social media.\r\nManchester City’s captain David Silva has completed 10 years in the Premier League this year and in his time with the Citizens… [+1530 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Miscreants attempt to rob stumper Saha's Siliguri home, says relative - Hindustan Times", "description": "Saha, 35, lives in South Kolkata with his wife and children. The experienced stumper’s parents, who live in their Ward No.31 Shaktigarh area house in Siliguri, are at present staying with their son in Kolkata.", "url": "https://www.hindustantimes.com/cricket/miscreants-attempt-to-rob-stumper-saha-s-siliguri-home-says-relative/story-tRusZSKZV1FBBTmYrEWIlO.html", "urlToImage": null, "publishedAt": "2020-04-25T12:04:21Z", "content": "A relative of Wriddhiman Saha has alleged that a few miscreants tried to break into the India Test wicketkeeper’s ancestral home in Siliguri, North Bengal, on Friday in a bungled attempt to rob the place.\r\nSaha, 35, lives in South Kolkata with his wife and ch… [+1344 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "‘Didn’t want people to say Silver Sindhu,’ Talk of final phobia propelled PV Sindhu to World Championship... - Hindustan Times", "description": "Sindhu, who had already won two silver and two bronze medals at the event, defeated her nemesis Nozomi Okuhara 21-7 21-7 in the summit clash that lasted just 38 minutes on August 26 last year.", "url": "https://www.hindustantimes.com/other-sports/didn-t-want-people-to-say-silver-sindhu-talk-of-final-phobia-propelled-pv-sindhu-to-world-championship-glory/story-9daLENyFdFsDbf4qp35ELI.html", "urlToImage": null, "publishedAt": "2020-04-25T11:59:43Z", "content": "Ace shuttler PV Sindhu, who had created history by becoming the first Indian to win gold medal at the World Championships last year, has revealed that she didnt want people to call her “silver Sindhu” and thats why she was desperate to clinch the top honours … [+1477 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "Legalising ball tampering: Saliva is must and vaseline is no replacement, feel Ashish Nehra, Harbhajan Singh - Hindustan Times", "description": "Former India pacer Ashish Nehra and spinner Harbhajan Singh feel that saliva’s use in shining the ball is a “must”. Ex-opener Aakash Chopra, while beng open to the idea, wants to know where one can draw the line.", "url": "https://www.hindustantimes.com/cricket/legalising-ball-tampering-saliva-is-must-and-vaseline-is-no-replacement-feel-ashish-nehra-harbhajan-singh/story-6sGuYrV3wtqCeH94TJ9N9K.html", "urlToImage": null, "publishedAt": "2020-04-25T11:23:53Z", "content": "Saliva and sweat are components that cannot be entirely done away with, insist a few distinguished India cricketers, as the ICC contemplates legalising ball tampering post COVID-19 by using artificial substances to prevent virus spread. Former India pacer Ash… [+3372 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Oliver Browning", "title": "WWE news: The 30 greatest pro wrestlers of all-time have been ranked - GIVEMESPORT", "description": "WWE news: The 30 greatest pro wrestlers of all-time have been ranked", "url": "https://www.givemesport.com/1564783-wwe-news-the-30-greatest-pro-wrestlers-of-alltime-have-been-ranked", "urlToImage": null, "publishedAt": "2020-04-25T10:59:58Z", "content": "There are so many legendary names linked with professional wrestling. \r\nWWE stars like Hulk Hogan, The Undertaker, Andre the Giant and The Rock instantly spring to mind. \r\nThen, of course, there are some that have made a name for themselves outside of America… [+1569 chars]"}, {"source": {"id": null, "name": "Juvefc.com"}, "author": "juvefcdotcom", "title": "Cristiano Ronaldo will remain with Juventus - JuveFC", "description": "Cristiano Ronaldo will remain with Juventus until 2022, according to Tuttosport.", "url": "https://www.juvefc.com/cristiano-ronaldo-will-remain-with-juventus/", "urlToImage": null, "publishedAt": "2020-04-25T09:42:58Z", "content": "Cristiano Ronaldo will remain with Juventus until 2022, according to Tuttosport.\r\nThe 34-year-old has been with the Bianconeri for two seasons of his four-year contract after a big money move from Real Madrid in 2018.\r\nReports in Spanish and Italian press hav… [+409 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Arjun Athreya", "title": "Three Things We Want To See From the Kobe Bryant Documentary - Essentially Sports", "description": "Kobe Bryant spent 20 years with the Los Angeles Lakers. It has now been confirmed that his last season was being completely documented by a film crew.", "url": "https://www.essentiallysports.com/nba-news-three-things-we-want-to-see-from-the-kobe-bryant-documentary/", "urlToImage": null, "publishedAt": "2020-04-25T09:40:00Z", "content": "The Last Dance, a ten-part documentary on Michael Jordans final season with the Chicago Bulls was released recently. Ever since the series claimed a massive following, fans have been chirping for a similar documentary to be made on the legacy of the late Kobe… [+5764 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "‘You don’t want the fear,’ Yuvraj Singh explains why cricket should return only after Covid-19 is e... - Hindustan Times", "description": "Like other sports, international and domestic cricket too has been disrupted leading the national boards to contemplate resuming the game in empty stadiums, without fans.", "url": "https://www.hindustantimes.com/cricket/you-don-t-want-the-fear-yuvraj-singh-explains-why-cricket-should-return-only-after-covid-19-is-eradicated/story-7okHJdLw1JTTSzbxY9JJ6L.html", "urlToImage": null, "publishedAt": "2020-04-25T09:34:05Z", "content": "Former India star Yuvraj Singh wants cricket to resume only when the world becomes COVD-19 free as players’ health and safety should be paramount for the custodians of the game.\r\nLike other sports, international and domestic cricket too has been disrupted lea… [+1271 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": null, "title": "‘He was a real pain in the back for us’ – Pat Cummins picks Cheteshwar Pujara as the toughest batsman to bowl - CricTracker", "description": "Pat Cummins, who is the World's number 1 Test bowler, recalled the painstaking series for Australia in 2018-19 season which India", "url": "https://m.crictracker.com/he-was-a-real-pain-in-the-back-for-us-pat-cummins-picks-cheteshwar-pujara-as-the-toughest-batsman-to-bowl/", "urlToImage": null, "publishedAt": "2020-04-25T09:04:22Z", "content": "Pat Cummins and Cheteshwar Pujara. (Photo Source: Getty Images)\r\nTeam India scripted history during their previous Australia tour by winning their first ever Test series down under. Though the hosts missed their best batsman in David Warner and Steve Smith, A… [+1980 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Saketh Kandadai", "title": "“It Was Not an Easy Night”: Steve Kerr Narrates a Hilarious Betting Story of Michael Jordan From Their College Days - Essentially Sports", "description": "Golden State Warriors coach Steve Kerr revealed a funny betting story with his former Chicago Bulls teammate Michael Jordan.", "url": "https://www.essentiallysports.com/nba-news-chicago-bulls-it-was-not-an-easy-night-steve-kerr-narrates-a-hilarious-betting-story-of-michael-jordan-from-their-college-days/", "urlToImage": null, "publishedAt": "2020-04-25T07:25:11Z", "content": "Golden State Warriors coach Steve Kerr revealed a funny betting story with his former teammate Michael Jordan.\r\nIt was during a game when Kerr was playing for the University of Arizona while Jordan was at the University of North Carolina. Kerr’s Wildcats defe… [+2070 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Rob Swan", "title": "Premier League football could be back on live TV ‘within weeks’ - GIVEMESPORT", "description": "Premier League football could be back on live TV ‘within weeks’", "url": "https://www.givemesport.com/1564740-premier-league-football-could-be-back-on-live-tv-within-weeks", "urlToImage": null, "publishedAt": "2020-04-25T07:13:11Z", "content": "It seems increasingly likely that the 2019-20 Premier League season will be concluded, according to fresh reports.\r\nNo top-flight football has been played in England since March 9 due to the ongoing coronavirus pandemic, which has threatened to lead to the ca… [+2264 chars]"}, {"source": {"id": null, "name": "Icc-cricket.com"}, "author": "ICC", "title": "Obituary: Graeme Watson - International Cricket Council", "description": "Graeme Watson, an all-rounder who featured in five Tests and two ODIs for Australia, died at 75 following a battle with cancer.", "url": "https://www.icc-cricket.com/news/1660856/obituary-graeme-watson", "urlToImage": null, "publishedAt": "2020-04-25T07:10:21Z", "content": "Graeme Watson, an all-rounder who featured in five Tests and two ODIs for Australia, died at 75 following a battle with cancer.Watson, a middle-order batsman and medium-pace bowler, finished his career with 4,674 runs and 186 wickets from 107 first-class game… [+1984 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Reubyn Coutinho", "title": "“The Winner Will Fight Khabib For the Title”- Dana White makes a huge statement - Essentially Sports", "description": "UFC President Dana White made a huge statement regarding UFC Lightweight division. He said the winner of Ferguson-Gaethje will fight Khabib for the title.", "url": "https://www.essentiallysports.com/ufc-news-the-winner-will-fight-khabib-for-the-title-dana-white-makes-a-huge-statement-tony-ferguson-justin-gaethje/", "urlToImage": null, "publishedAt": "2020-04-25T05:00:00Z", "content": "UFC 249 finally has a new venue. The event will take place at VyStar Veterans Memorial Arena in Jacksonville, Florida. The UFC pounced on a chance to hold their events in the Sunshine State as sports activities were deemed essential businesses. Dana White app… [+1819 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "No to saliva, yes to shine: Ball-tampering laws in cricket may change - Times of India", "description": "Cricket News: Cricket may change ball-tampering laws and approve external method to help polish the red cherry in proposed post-corona measures. The matter of saliv", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/no-to-saliva-yes-to-shine-ball-tampering-laws-in-cricket-may-change/articleshow/75367490.cms", "urlToImage": null, "publishedAt": "2020-04-25T04:40:29Z", "content": "NEW DELHI: The coronavirus pandemic may force cricket's world governing body to tweak one of its oldest rules and approve the use of an artificial substance to help shine the ball, effectively legalizing what has for long been a core tenet of the sport's anti… [+4836 chars]"}, {"source": {"id": null, "name": "Chessbase.com"}, "author": "", "title": "Magnus Carlsen Invitational: Carlsen and Caruana score convincing wins - Chessbase News", "description": "World numbers one and two, Magnus Carlsen and Fabiano Caruana, won their round-four matches without needing tiebreaks, thus collecting three points each. Carlsen has won all his confrontations so far and is the clear leader with eleven points. He defeated Max…", "url": "https://en.chessbase.com/post/magnus-carlsen-invitational-2020-r4-a", "urlToImage": null, "publishedAt": "2020-04-25T00:34:12Z", "content": "A memorable pawn structure\r\nJust by looking at the results of Friday's round at the Magnus Carlsen Invitational it is hard to figure out how the matches developed. Caruana got a 3:1 victory over Firouzja and even started the match-up with two wins, but the co… [+5047 chars]"}, {"source": {"id": null, "name": "Trendinindia.in"}, "author": "sourav chowdhury", "title": "Island of Vanuatu becomes 1st nation to resume cricket, live actions to start this week - Trendinindia", "description": "They're prepared to go live in Vanuatu.A tropical island within the South Pacific may be very seemingly to be the one venue on the earth internet hosting a aggressive cricket ultimate on Saturday, as most worldwide sport stays shuttered across the globe.Vanua…", "url": "https://trendinindia.in/island-of-vanuatu-becomes-1st-nation-to-resume-cricket-live-actions-to-start-this-week/", "urlToImage": null, "publishedAt": "2020-04-24T23:18:47Z", "content": "They’re prepared to go live in Vanuatu.\r\nA tropical island within the South Pacific may be very seemingly to be the one venue on the earth internet hosting a aggressive cricket ultimate on Saturday, as most worldwide sport stays shuttered across the globe.\r\nV… [+3446 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "Rob Dawson", "title": "Manchester United transfer window won't be 'business as usual' after virus - Woodward - ESPN India", "description": "Ed Woodward says it is unlikely to be \"business as usual\" for Manchester United in the transfer market following the coronavirus crisis.", "url": "https://www.espn.in/football/manchester-united/story/4088856/manchester-united-transfer-window-wont-be-business-as-usual-after-virus-woodward", "urlToImage": null, "publishedAt": "2020-04-24T21:54:56Z", "content": "Ed Woodward says it is unlikely to be \"business as usual\" for Manchester United in the transfer market following the coronavirus crisis and hinted that the days of £100 million deals may be over.\r\nThe COVID-19 pandemic has led to panic at some clubs concerned… [+2528 chars]"}, {"source": {"id": "marca", "name": "Marca"}, "author": "Christian Gaudioso, Adapted by Billy Munday", "title": "Tebas: Once we're allowed to restart the season, clubs will be punished if they refuse to play - MARCA.com", "description": "LaLiga president Javier Tebas has insisted that teams who refuse to play the rest of the season will be punished.\n\nOrganisations like the Spanish...", "url": "https://www.marca.com/en/football/spanish-football/2020/04/24/5ea335ee46163fd4248b4661.html", "urlToImage": null, "publishedAt": "2020-04-24T18:58:00Z", "content": "LaLiga president Javier Tebas has insisted that teams who refuse to play the rest of the season will be punished.\r\nOrganisations like the Spanish Footballers' Association (AFE) have expressed their concern over player safety once the season resumes.\r\n\"If a cl… [+2899 chars]"}, {"source": {"id": null, "name": "Atptour.com"}, "author": null, "title": "Virtual Blockbuster! Rafael Nadal & Andy Murray In Same Group In Mutua Madrid Open Virtual Pro - ATP Tour", "description": "The draw for the Mutua Madrid Open Virtual Pro has been made, and although the action will be played in a video game, there is a round-robin blockbuster that jumps off the page. Five-time Madrid champion Rafael Nadal is joined by another former World No. 1, A…", "url": "https://www.atptour.com/en/news/mutua-madrid-open-virtual-pro-2020-draw", "urlToImage": null, "publishedAt": "2020-04-24T18:30:30Z", "content": "The draw for the Mutua Madrid Open Virtual Pro has been made, and although the action will be played in a video game, there is a round-robin blockbuster that jumps off the page.\r\nFive-time Madrid champion Rafael Nadal is joined by another former World No. 1, … [+3125 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": "India Today Television", "title": "Absolutely priceless: Sachin Tendulkar spends a quiet 47th birthday with his mother - India Today", "description": "Sachin Tendulkar turned 47 on Friday. The Master Blaster decided not to celebrate his birthday this year as a mark of respect towards the Covid-19 warriors. In fact he has tweeted on the occasion with a picture with his mother captioning it: \"Started my day b…", "url": "https://www.indiatoday.in/sports/video/absolutely-priceless-sachin-tendulkar-spends-a-quiet-47th-birthday-with-his-mother-1670812-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T18:15:45Z", "content": "Sachin Tendulkar turned 47 on Friday. The Master Blaster decided not to celebrate his birthday this year as a mark of respect towards the Covid-19 warriors. In fact he has tweeted on the occasion with a picture with his mother captioning it: \"Started my day b… [+491 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Ibrahimovic slams 'kindergarten-level' vandals who attacked AC Milan forward's statue in Malmo - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T16:14:00Z", "content": "More"}]}