{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "He will give all to save me: KL Rahul names one cricketer he would pick to bat for life - Hindustan Times", "description": "In the ODI series against New Zealand earlier this year, which India lost 3-0, Rahul scored an unbeaten 88 in the first ODI and then followed it up with a ton in the 3rd ODI.", "url": "https://www.hindustantimes.com/cricket/he-will-give-all-to-save-me-kl-rahul-names-one-cricketer-he-would-pick-to-bat-for-life/story-8lmr6y3FAT3HOk20LyzyEK.html", "urlToImage": null, "publishedAt": "2020-04-26T08:36:00Z", "content": "India batsman KL Rahul had been in tremendous form in the year 2020. The right-handed batsman was given the task of playing an opening batsman, a wicketkeeper, batting at no. 5 position, and also to hold the captaincy position in a match this year - and the K… [+1248 chars]"}, {"source": {"id": null, "name": "Dawn.com"}, "author": "Images Staff", "title": "Tributes for Sana Mir pour in from around the world after retirement announcement - DAWN.com", "description": "What an absolute trailblazer.", "url": "https://images.dawn.com/news/1185144", "urlToImage": null, "publishedAt": "2020-04-26T07:22:11Z", "content": "Former captain of the Pakistan National's Cricket Team, Sana Mir just announced her retirement from the field. \r\nTaking to Twitter, she wrote, \"Words fall short when I want to thank you all for the love, support and encouragement in the past 15 years. It has … [+929 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Reubyn Coutinho", "title": "“He’s a Technical Beast”- Dominick Reyes Lauds Jan Blachowicz Wants Him As The Next Fight - Essentially Sports", "description": "UFC Light Heavyweight fighter Dominick Reyes has expressed interest in facing Jan Blachowicz and praised the Polish fighter's abilities.", "url": "https://www.essentiallysports.com/ufc-news-hes-a-technical-beast-dominick-reyes-lauds-jan-blachowicz-wants-him-as-the-next-fight/", "urlToImage": null, "publishedAt": "2020-04-26T07:11:00Z", "content": "Dominick Reyes came agonizingly close to ending Jon Jones’ lengthy run of wins in title fights. He lost via Unanimous Decision, something many fans believe was daylight robbery. ‘The Devastator’ has been very vocal in wanting a rematch against ‘Bones.’ Howeve… [+1805 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "Ian Gould recalls his infamous Sachin Tendulkar’s LBW decision against... - The Cricket Times", "description": "They say that a cat has nine lives, but Indian batting maestro Sachin Tendulkar had five during the semi-final clash against Pakistan in the 2011 ODI World Cup. Pakistan fielders kept dropping catches before their captain Shahid Afridi finally held one while …", "url": "https://crickettimes.com/2020/04/ian-gould-recalls-his-infamous-sachin-tendulkars-lbw-decision-against-pakistan/", "urlToImage": null, "publishedAt": "2020-04-26T06:47:19Z", "content": "They say that a cat has nine lives, but Indian batting maestro Sachin Tendulkar had five during the semi-final clash against Pakistan in the 2011 ODI World Cup.\r\nPakistan fielders kept dropping catches before their captain Shahid Afridi finally held one while… [+2099 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Abhishek Bharadwaj", "title": "Lewis Hamilton: Former F1 Driver Believes Hamilton’s Future Depends on Toto Wolff - Essentially Sports", "description": "Former F1 driver Marc Surer believes the Mercedes and Lewis Hamilton partnership hinges on Toto Wolff's next move in Formula 1.", "url": "https://www.essentiallysports.com/f1-news-lewis-hamilton-former-f1-driver-believes-hamiltons-future-depends-on-toto-wolff/", "urlToImage": null, "publishedAt": "2020-04-26T06:40:00Z", "content": "Former F1 driver Marc Surer believes Lewis Hamiltons contract extension with Mercedes hinges on Toto Wolffs next move. Surer is of the opinion that Lewis Hamilton will remain at Mercedes should Toto Wolff do the same. Wolffs future at Mercedes has been a topi… [+2307 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Pat Cummins recalls Cheteshwar Pujara's exploits Down Under, picks him as toughest batsman to bowl - India Today", "description": "Australian fast bowler Pat Cummins said that Cheteshwar Pujara remains one of the toughest he has ever bowled to especially Test cricket.", "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-recalls-cheteshwar-pujara-exploits-australia-picks-him-toughest-batsman-to-bowl-in-tests-1671223-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T06:32:34Z", "content": "World No.1 Test bowler Pat Cummins has revealed that India's Cheteshwar Pujara is the toughest batsman to bowl to in the longest format of the game.\r\nCheteshwar Pujara had helped India orchestrate their maiden Test series victory in Australia last year as he … [+1384 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "New look inspired by heroes Viv Richards and MS Dhoni: Kapil Dev - Times of India", "description": "Cricket News: India's 1983 World Cup-winning captain, Kapil Dev, is sporting a new look these days, having shaved his head bald while keeping a beard, somewhat simi", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/new-look-inspired-by-heroes-viv-richards-and-ms-dhoni-kapil-dev/articleshow/75386212.cms", "urlToImage": null, "publishedAt": "2020-04-26T06:16:33Z", "content": null}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Koushik  Narayanan", "title": "Chris Gayle roasts annoying Chahal, threatens to block Tik Tok star on social media - Republic World - Republic World", "description": "Chris Gayle became the latest to join the bandwagon of stars roasting spinner Yuzvendra Chahal following the latter's increased presence on social media", "url": "https://www.republicworld.com/sports-news/cricket-news/chris-gayle-roasts-annoying-chahal-threatens-to-block-tik-tok-star.html", "urlToImage": null, "publishedAt": "2020-04-26T06:10:46Z", "content": "West Indies' Chris Gayle became the latest to join the bandwagon of stars roasting spinner Yuzvendra Chahal following the latter's increased presence on social media amid the coronavirus lockdown. Chahal's newfound love in Tik Tok has left many cricketers baf… [+1880 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Alex Dicken", "title": "Aston Villa linked with shock change as Man United send Jack Grealish update - Birmingham Live", "description": "Aston Villa news - A round-up of AVFC headlines from BirminghamLive and elsewhere", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/aston-villa-linked-shock-change-18151831", "urlToImage": null, "publishedAt": "2020-04-26T06:09:40Z", "content": "Shock Dyche link\r\nAston Villa have been linked with a shock interest in Burnley manager Sean Dyche. \r\nLike the rest of the Premier League, Villa are currently on lockdown and waiting to learn when their season will resume. \r\nDean Smith and his players have a … [+5293 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Tyrone Marshall", "title": "Man United midfield production line might be about to take off - Manchester Evening News", "description": "Man Utd have always been blessed with excellent midfielders and the current crop look like they could follow that tradition.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-utd-midfielders-next-generation-18150917", "urlToImage": null, "publishedAt": "2020-04-26T06:04:30Z", "content": "Manchester United's next crop of promising midfielders are certainly going to be in good hands when they reach the first-team squad.\r\nUnited have had some brilliant midfielders over the last three decades, but Michael Carrick might have been one of the most u… [+2928 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "https://www.facebook.com/varun.khanna123", "title": "Stan Wawrinka Picks the Toughest Player to Beat at Prime Amongst ‘Big 3’ - Essentially Sports", "description": "Former World No.3 Stan Wawrinka picked the most challenging player to face at their prime among Roger Federer, Rafael Nadal, and Novak Djokovic.", "url": "https://www.essentiallysports.com/stan-wawrinka-picks-the-toughest-player-to-beat-at-prime-amongst-big-3-roger-federer-rafael-nadal-novak-djokovic-atp-tennis-news/", "urlToImage": null, "publishedAt": "2020-04-26T05:56:00Z", "content": "The battle between the ‘Big 3’ – Roger Federer, Rafael Nadal, and Novak Djokovic is arguably the closest contest ever seen in the legacies of sports. It is almost impossible to discern which player is the best amongst the ‘Big 3’. Nevertheless, former World N… [+1826 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Coffee Proved Too Costly for Me, I Drink Green Tea: Hardik Pandya - News18", "description": "India all-rounder Hardik Pandya has joked that a cup of coffee proved too costly for him and he now drinks green tea instead in an Instagram live chat with wicket-keeper Dinesh Karthik. Pandya was referring to the controversy he landed in due to his comments …", "url": "https://www.news18.com/cricketnext/news/coffee-proved-too-costly-for-me-i-drink-green-tea-hardik-2593101.html", "urlToImage": null, "publishedAt": "2020-04-26T05:30:44Z", "content": "New Delhi: India all-rounder Hardik Pandya has joked that a cup of coffee proved too costly for him and he now drinks green tea instead in an Instagram live chat with wicket-keeper Dinesh Karthik. Pandya was referring to the controversy he landed in due to hi… [+1475 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Saketh Kandadai", "title": "Why Did Kobe Bryant Choose No. 8 to Start His Career at Los Angeles Lakers? - Essentially Sports", "description": "The reason why Kobe Bryant used the No. 8 jersey when he started his NBA career with the Los Angeles Lakers and later changed to No. 24", "url": "https://www.essentiallysports.com/nba-news-why-did-kobe-bryant-choose-no-8-to-start-his-career-at-los-angeles-lakers/", "urlToImage": null, "publishedAt": "2020-04-26T05:18:00Z", "content": "Kobe Bryant is the only NBA player to have the same team retiring two different jerseys. Bryant played 20 years for Los Angeles Lakers sporting the No. 8 and No. 24 jerseys in either halves of his career.\r\nBryant was among the very few players who had come in… [+2227 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Anirudh Singh", "title": "R Ashwin reveals how MS Dhoni helped him to dismiss Jonathan Trott in Champion Trophy 2013... - The Cricket Times", "description": "Ravichandran Ashwin and his former India teammate Suresh Raina had a live Instagram session on Friday evening. And, the duo recalled some cherishing memories while they used to play together for Team India and Chennai Super Kings (CSK) in IPL. During the inte…", "url": "https://crickettimes.com/2020/04/r-ashwin-reveals-how-ms-dhoni-helped-him-to-dismiss-jonathan-trott-in-champion-trophy-2013-final/", "urlToImage": null, "publishedAt": "2020-04-26T05:07:40Z", "content": "Ravichandran Ashwin and his former India teammate Suresh Raina had a live Instagram session on Friday evening. And, the duo recalled some cherishing memories while they used to play together for Team India and Chennai Super Kings (CSK) in IPL.\r\nDuring the int… [+2463 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Sports Desk", "title": "Messi or Ronaldo? Brazilian legends Pele, Ronaldinho and Ronaldo answer - The Indian Express", "description": "Who is a more complete player - Lionel Messi or Cristiano Ronaldo? Brazilian legends Pele, Ronaldinho and Ronaldo pick their side.", "url": "https://indianexpress.com/article/sports/football/messi-or-ronaldo-brazilian-legends-pele-ronaldinho-and-ronaldo-answer-6378475/", "urlToImage": null, "publishedAt": "2020-04-26T05:04:15Z", "content": "Messi or Ronaldo? Brazilian legends Pele, Ronaldinho and Ronaldo pick their sideWith coronavirus bringing sports and life in general to a halt in the entire world, football stars have started answering difficult questions: Who is the best in the world – Lione… [+2552 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Play short ball or forget internationals: Kohli on 3 coaches who shaped his career - Hindustan Times", "description": "The Indian captain also spoke about the sessions with former South Africa wicket-keeper and current coach Mark Boucher and recalled how he was asked to improve his game against the short ball.", "url": "https://www.hindustantimes.com/cricket/play-short-ball-or-forget-about-internationals-virat-kohli-names-3-coaches-who-shaped-his-career/story-7E2ZPKC50CDugVaPcJZnoO.html", "urlToImage": null, "publishedAt": "2020-04-26T04:09:31Z", "content": "Team India captain Virat Kohli hailed the impact of different coaches in shaping his career and said that these people understood his game and they made him a better player. He spoke about former India captain Gary Kirsten and the impact he had on his career.… [+2232 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "David Warner shares adorable dance video with wife Candice, daughters--Watch - Zee News", "description": "Warner was set to represent Sunrisers Hyderabad in the IPL 2020, which was due to take place from March 29 but it has now been postponed indefinitely due to coronavirus.", "url": "https://zeenews.india.com/cricket/david-warner-shares-adorable-dance-video-with-wife-candice-daughters-watch-2279018.html", "urlToImage": null, "publishedAt": "2020-04-26T04:02:33Z", "content": "As all the sporting activities across the globe are currently at standstill due to coronavirus pandemic, swashbuckling Australian opener David Warner is keeping his fans entertained by constantly posting videos with his family on social media.\r\nFrom shaking l… [+1516 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Rasesh Mandani", "title": "Bailout plan: Play more matches with India - Hindustan Times", "description": "Later this year, the new Future Tours Programme (FTP) for the years 2023-2031 will be finalised; the ICC continues to be heavily dependent on the BCCI for revenue.", "url": "https://www.hindustantimes.com/cricket/bailout-plan-play-more-matches-with-india/story-VRqndyDqK1aBAy0bT21qoO.html", "urlToImage": null, "publishedAt": "2020-04-26T02:57:47Z", "content": "The Board of Control for Cricket in India (BCCI), the richest body in world cricket, has come up with a plan to help countries facing losses due to the cancellation of cricket worldwide -- although the idea is contingent on games resuming.\r\nAccording to BCCI … [+4642 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Transfer news and rumours LIVE: Klopp calls Mbappe's dad over Liverpool switch - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-26T02:30:00Z", "content": "More"}, {"source": {"id": null, "name": "Chessbase.com"}, "author": "", "title": "Magnus Carlsen Invitational: Nakamura in sole second place - Chessbase News", "description": "Hikaru Nakamura and Ding Liren obtained key victories in round four of the Magnus Carlsen Invitational. Nakamura took down Ian Nepomniachtchi 2½:1½, while Ding had black and drew Anish Giri in the Armageddon decider of their match-up. Nakamura is now in sole …", "url": "https://en.chessbase.com/post/magnus-carlsen-invitational-2020-r4-b", "urlToImage": null, "publishedAt": "2020-04-26T01:59:35Z", "content": "Ding wins in Armageddon\r\nThe fight to reach the final-four knockout of the Magnus Carlsen Invitational has almost completely been narrowed down to six players. Carlsen and Nakamura are favourites to qualify, while Ding and Fabiano Caruana are leading the race… [+5829 chars]"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Gill Clark", "title": "Lionel Messi is a very easy player to coach, says Ernesto Valverde - Barca Blaugranes", "description": "The former boss has been talking about the GOAT", "url": "https://www.barcablaugranes.com/2020/4/26/21236217/lionel-messi-is-a-very-easy-player-to-coach-says-ernesto-valverde", "urlToImage": null, "publishedAt": "2020-04-25T23:11:34Z", "content": "Former Barcelona manager Ernesto Valverde has been talking about what its like to manage Lionel Messi and how easy it is to coach the Argentina international.\r\nValverde was fired in January after two-and-a-half years at the club where he won two league titles… [+1091 chars]"}, {"source": {"id": null, "name": "Espn.com.au"}, "author": "Adrian Wojnarowski", "title": "NBA reopening team practice facilities Friday where local restrictions eased, sources say - ESPN Australia", "description": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.", "url": "https://www.espn.com.au/nba/story/_/id/29099194/nba-reopening-team-practice-facilities-friday-where-local-restrictions-eased-sources-say", "urlToImage": null, "publishedAt": "2020-04-25T23:03:22Z", "content": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.\r\nPlayers can return to team facilities in states such as … [+2131 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Everton 'appalled' after Kean breaks coronavirus guidelines to throw lockdown party - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T22:56:34Z", "content": "More"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Conte wouldn't last a season at Real Madrid, says Diego Costa - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T21:35:00Z", "content": "More"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Mahalakshmi Murali", "title": "“It Would Happen This Year” – Alexander Zverev on Dethroning Big Three - Essentially Sports", "description": "Germany’s number one player Alexander Zverev believes the NextGen will be gate-crashing the Big Three's party soon enough.", "url": "https://www.essentiallysports.com/tennis-news-atp-roger-federer-rafael-nadal-and-novak-djokovic-it-would-happen-this-year-alexander-zverev-on-dethroning-big-three/", "urlToImage": null, "publishedAt": "2020-04-25T20:37:00Z", "content": "The tennis world is anticipating a new Grand Slam champion with every passing Major. But time and again, the titles keep revolving amongst the Big Three. The up and coming young players are unable to break their rhythm. However, Germanys number one tennis pla… [+2649 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Vinayak Manoj", "title": "“Khabib and Tony Will Never Happen”- Charles Oliveira Drops the Hammer on Khabib Nurmagomedov vs Tony Ferguson - Essentially Sports", "description": "Charles Oliveira recently revealed what he thinks about the highly elusive match-up,Tony Ferguson vs Khabib Nurmagomedov.", "url": "https://www.essentiallysports.com/ufc-249-news-khabib-and-tony-will-never-happen-charles-oliveira-drops-the-hammer-on-khabib-nurmagomedov-vs-tony-ferguson/", "urlToImage": null, "publishedAt": "2020-04-25T19:23:00Z", "content": "The fight between Tony Ferguson and Khabib Nurmagomedov fell through yet again. Following this, fans wonder whether this fight will ever happen or not. However, it seems like fellow lightweight Charles Oliveira has some clarity on this matter as MMA Fighting … [+2189 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "'My biggest mistake was joining Inter – I could've gone to Madrid, Barca or Man Utd' - Pancev regrets Italy move - Goal India", "description": "Antonio Conte may have won league titles in Italy and England, but the Inter coach would not last a season in charge of Real Madrid, according to Diego Costa.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-25T18:54:24Z", "content": "More"}, {"source": {"id": null, "name": "Espn.in"}, "author": "Julien Laurens", "title": "Arsenal to return to training despite UK's coronavirus lockdown - ESPN India", "description": "Arsenal players will make a staggered return to training at their London Colney training ground next week, sources have told ESPN.", "url": "https://www.espn.in/football/arsenal/story/4089033/arsenal-to-return-to-training-despite-uks-coronavirus-lockdown-sources", "urlToImage": null, "publishedAt": "2020-04-25T18:24:56Z", "content": "Arsenal players will make a return to training at their London Colney training ground next week despite the UK still being on a government-imposed lockdown amid the coronavirus pandemic.\r\n- Stream every episode of 30 for 30: Soccer Stories on ESPN+\r\nThey are … [+2027 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Boxer Dingko Singh airlifted to Delhi for cancer treatment - Times of India", "description": "Boxing News: Asian Games gold-winning boxer Dingko Singh was on Saturday airlifted from Imphal to the national capital for his liver cancer treatment. Dingko's tra", "url": "https://timesofindia.indiatimes.com/sports/boxing/boxer-dingko-singh-airlifted-to-delhi-for-cancer-treatment/articleshow/75380331.cms", "urlToImage": null, "publishedAt": "2020-04-25T17:49:32Z", "content": "NEW DELHI: Asian Games gold-winning boxer Dingko Singh was on Saturday airlifted from Imphal to the national capital for his liver cancer treatment.\r\nDingko's transfer to Delhi by a Spicejet air ambulance was facilitated by the Boxing Federation of India (BFI… [+1388 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "West Indies ‘flexible’ over England tour as ECB weigh overseas offers - Hindustan Times", "description": "CWI chief executive Johnny Grave insisted while the West Indies were open to a change of dates, player safety remained the priority.", "url": "https://www.hindustantimes.com/cricket/west-indies-flexible-over-england-tour-as-ecb-weigh-overseas-offers/story-wpJLafjIXTVJmWL2a42NOO.html", "urlToImage": null, "publishedAt": "2020-04-25T17:48:48Z", "content": "Cricket West Indies have said they are “flexible” about rearranging their tour of England but will not risk their players’ health just to complete a three-Test series.\r\n The fixtures were all due to take place in June but Friday saw the England and Wales Cric… [+1969 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Trends Desk", "title": "Nurse runs solo marathon amid Covid-19, maps ‘Boston strong’ with spelling error - The Indian Express", "description": "Lindsey Devers ran 26.2 miles through a custom route to spell out \"BOSTON STRONG\" and realised she misspelt it to “Boston Strog” when it was too late to start over.", "url": "https://indianexpress.com/article/trending/trending-globally/boston-nurse-boston-marathon-coronavirus-lockdown-covid-19-6378825/", "urlToImage": null, "publishedAt": "2020-04-25T17:01:32Z", "content": "By: Trends Desk | New Delhi | \r\nUpdated: April 25, 2020 10:29:57 pm\r\nDespite hilariously omitting the very important N in her cheer for her city, Lindsay Dever received heaps of praise online for her solo marathon attempt.A nurse in Massachusetts was supposed… [+3501 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Have gone mad searching for it: Jofra Archer reveals he has lost his World Cup 2019 medal - India Today", "description": "England fast bowler Jofra Archer said he has been searching for his World Cup medal at his new place over the last week without much success.", "url": "https://www.indiatoday.in/sports/cricket/story/jofra-archer-world-cup-2019-medal-lost-searching-new-flat-super-over-final-1671093-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T16:38:48Z", "content": "England fast bowler Jofra Archer said he misplaced his World Cup 2019 medal after he shifted his flat recently. Archer, who played a key role in England's historic triumph, added he has 'gone mad' searching for it at his new place.\r\nJofra Archer revealed he h… [+1644 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Anirudh Singh", "title": "Actress Nidhhi Agerwal clears the air about unfollowing KL Rahul on social... - The Cricket Times", "description": "Cricketers link-up with Bollywood actresses is very commonly seen days. Even though Virat Kohli and Anushka Sharma are right now termed as the 'power couple', there is much more to that. There have been many other successful couples and sad breakups seen by c…", "url": "https://crickettimes.com/2020/04/nidhhi-agerwal-clears-the-air-about-unfollowing-kl-rahul-on-social-media/", "urlToImage": null, "publishedAt": "2020-04-25T15:03:35Z", "content": "Cricketers link-up with Bollywood actresses is very commonly seen days. Even though Virat Kohli and Anushka Sharma are right now termed as the ‘power couple’, there is much more to that.\r\nThere have been many other successful couples and sad breakups seen by … [+1428 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Gambhir, Akram had big influence on me at KKR: Kuldeep - Hindustan Times", "description": "Kuldeep says that Gambhir continues to talk to him even after the end of the latter’s stint at KKR and his playing career itself.", "url": "https://www.hindustantimes.com/cricket/gambhir-akram-had-big-influence-on-me-at-kkr-kuldeep/story-s71gC0msbyMC3lgxHBY2yM.html", "urlToImage": null, "publishedAt": "2020-04-25T14:49:16Z", "content": "Indian sinner Kuldeep Yadav spoke about the influence that Gautam Gambhir and Wasim Akram had on him in his early days at the Kolkata Knight Riders. Kuldeep said that Gambhir, who captained KKR to two titles in 2012 and 2014, gave him confidence by assuring h… [+2136 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Sakshi Jain", "title": "Rohit Sharma Takes a Friendly Jibe at Questions on MS Dhoni - Essentially Sports", "description": "Indian vice-captain Rohit Sharma gives a fitting reply to the fans asking about the comeback of India's former skipper MS Dhoni in the team.", "url": "https://www.essentiallysports.com/cricket-news-rohit-sharma-takes-a-friendly-jibe-at-questions-on-ms-dhoni/", "urlToImage": null, "publishedAt": "2020-04-25T14:31:00Z", "content": "There is a big question mark on the future of MS Dhoni in the Indian cricket team. MS Dhoni hasn’t revealed his plans yet. As a result, there is a curiosity among the fans related to the fate of their favorite Mahi in cricket. Recently, Indian team vice-capta… [+1821 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "PV Sindhu says was desperate to win World Championships as people started calling her 'silver Sindhu' - India Today", "description": "PV Sindhu, who beat her nemesis Nozomi Okuhara of Japan 21-7 21-7 to win World Championships, admitted that she felt bad when people said she has a \"final phobia\".", "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-says-was-desperate-to-win-world-championships-as-people-started-calling-her-silver-sindhu-1671055-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T14:03:03Z", "content": "Star shuttler P V Sindhu says she was desperate to win the World Championships title last year after a string of runner-up finishes as people started calling her \"silver Sindhu\".\r\nSindhu, who also won a silver medal in the 2016 Rio Olympics, admitted that she… [+1999 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "Kane Williamson relives emotions of World Cup 2019 final loss - Cricbuzz - Cricbuzz", "description": "New Zealand captain stressed he was proud of the way his players adapted throughout the tournament to different conditions", "url": "https://www.cricbuzz.com/cricket-news/112930/kane-williamson-relives-emotions-of-world-cup-2019-final-loss", "urlToImage": null, "publishedAt": "2020-04-25T13:54:23Z", "content": "\"I think the thing we can reflect upon and be proud of the way we played the entire tournament.\" © Getty\r\nThere is a certain wave of calmness about Kane Williamson. On or off the cricket field, the New Zealand skipper is known for his composed approach and on… [+3431 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": null, "title": "Taipei T10 League 2020: Match 6, TCA Indians vs Taiwan Dragons: MyTeam11 Fantasy Cricket Tips – Playing XI, Pitch Report & Injury Update - CricTracker", "description": "Taipei T10 League 2020: MyTeam11 Fantasy Cricket Tips, Playing XIs, Yingfeng Pitch Report & Injury News for Match 6, TCA Indians vs Taiwan Dragons", "url": "https://m.crictracker.com/taipei-t10-league-2020-match-6-tca-indians-vs-taiwan-dragons-myteam11-fantasy-cricket-tips-playing-xi-pitch-report-injury-update/", "urlToImage": null, "publishedAt": "2020-04-25T13:13:30Z", "content": "Cricket Stadium. (Photo by Robert Cianflone/Getty Images)\r\nMatch Details:\r\nThe 6th match of the Taipei T10 League 2020 will be played between TCA Indians and Taiwan Dragons at the Yingfeng Cricket Ground in Songshan District.\r\nThe match starts at 3:30 PM loca… [+3728 chars]"}, {"source": {"id": null, "name": "Thesportsrush.com"}, "author": "Tanish Chachra", "title": "Manchester City star David Silva names best Premier League player of his era - The Sportsrush", "description": "Manchester City star David Silva picks best Premier League player to play in his era as he goes live on for an AMA on social media. Manchester City's captain David Silva has completed 10 years in the Premier League this year and in his time with the Citizens,…", "url": "https://thesportsrush.com/manchester-city-star-david-silva-names-best-premier-league-player-of-his-era/", "urlToImage": null, "publishedAt": "2020-04-25T13:12:00Z", "content": "Manchester City star David Silva picks best Premier League player to play in his era as he goes live on for an AMA on social media.\r\nManchester City’s captain David Silva has completed 10 years in the Premier League this year and in his time with the Citizens… [+1530 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "India Today League PUBG Mobile Invitational Day 3: SynerGE pip TSM ENTITY to win final Match - India Today", "description": "India Today League PUBG Mobile Invitational: In a gripping battle in Match 4 in Sanhok, SynerGE won their first chicken dinner of the tournament after they edged out TSM ENTITY who have been the most impressive team on Day 3.", "url": "https://www.indiatoday.in/sports/other-sports/story/itpubl-match-4-day-3-synerge-pip-tsm-entity-pubg-mobile-invitational-1671018-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T12:23:37Z", "content": "It looked like TSM ENTITY would take their third 3rd Chicken Dinner of Day 3 of India Today League PUBG Mobile Invitational but Team SynerGE spoiled their party by winning Match 4 in Sanhok.\r\nWith 11 kills and a total of 31 points SynerGe took the top spot an… [+1675 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Miscreants attempt to rob stumper Saha's Siliguri home, says relative - Hindustan Times", "description": "Saha, 35, lives in South Kolkata with his wife and children. The experienced stumper’s parents, who live in their Ward No.31 Shaktigarh area house in Siliguri, are at present staying with their son in Kolkata.", "url": "https://www.hindustantimes.com/cricket/miscreants-attempt-to-rob-stumper-saha-s-siliguri-home-says-relative/story-tRusZSKZV1FBBTmYrEWIlO.html", "urlToImage": null, "publishedAt": "2020-04-25T12:04:21Z", "content": "A relative of Wriddhiman Saha has alleged that a few miscreants tried to break into the India Test wicketkeeper’s ancestral home in Siliguri, North Bengal, on Friday in a bungled attempt to rob the place.\r\nSaha, 35, lives in South Kolkata with his wife and ch… [+1344 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "Legalising ball tampering: Saliva is must and vaseline is no replacement, feel Ashish Nehra, Harbhajan Singh - Hindustan Times", "description": "Former India pacer Ashish Nehra and spinner Harbhajan Singh feel that saliva’s use in shining the ball is a “must”. Ex-opener Aakash Chopra, while beng open to the idea, wants to know where one can draw the line.", "url": "https://www.hindustantimes.com/cricket/legalising-ball-tampering-saliva-is-must-and-vaseline-is-no-replacement-feel-ashish-nehra-harbhajan-singh/story-6sGuYrV3wtqCeH94TJ9N9K.html", "urlToImage": null, "publishedAt": "2020-04-25T11:23:53Z", "content": "Saliva and sweat are components that cannot be entirely done away with, insist a few distinguished India cricketers, as the ICC contemplates legalising ball tampering post COVID-19 by using artificial substances to prevent virus spread. Former India pacer Ash… [+3372 chars]"}, {"source": {"id": null, "name": "Sempreinter.com"}, "author": null, "title": "Chelsea Join Inter In Race To Sign 70M Rated Arsenal Striker Aubameyang - SempreInter", "description": "Chelsea are interested in Inter target Pierre Emerick Aubameyang, according to a report from international broadcaster ESPN earlier today. The report", "url": "https://sempreinter.com/2020/04/25/chelsea-join-inter-in-race-to-sign-70m-rated-arsenal-striker-aubameyang/", "urlToImage": null, "publishedAt": "2020-04-25T11:21:28Z", "content": "Chelsea are interested in Inter target Pierre Emerick Aubameyang, according to a report from international broadcaster ESPN earlier today.\r\nThe report details how the Blues have identified the Gabonese striker as the ideal player to reinforce their attack nex… [+784 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Oliver Browning", "title": "WWE news: The 30 greatest pro wrestlers of all-time have been ranked - GIVEMESPORT", "description": "WWE news: The 30 greatest pro wrestlers of all-time have been ranked", "url": "https://www.givemesport.com/1564783-wwe-news-the-30-greatest-pro-wrestlers-of-alltime-have-been-ranked", "urlToImage": null, "publishedAt": "2020-04-25T10:59:58Z", "content": "There are so many legendary names linked with professional wrestling. \r\nWWE stars like Hulk Hogan, The Undertaker, Andre the Giant and The Rock instantly spring to mind. \r\nThen, of course, there are some that have made a name for themselves outside of America… [+1569 chars]"}, {"source": {"id": null, "name": "Barcablaugranes.com"}, "author": "Barca Blaugranes Staff", "title": "FC Barcelona News: 25 April 2020; PSG won’t talk Neymar - Barca Blaugranes", "description": "A round-up of the latest Barcelona news and transfer rumors", "url": "https://www.barcablaugranes.com/2020/4/25/21235862/fc-barcelona-news-25-april-2020-psg-wont-talk-neymar-sterling-wants-messis-shirt", "urlToImage": null, "publishedAt": "2020-04-25T09:49:32Z", "content": "PSG will refuse to negotiate a deal to sell Neymar until September | Sport\r\nPSG are refusing to negotiate Neymars exit currently. The French champions have told the Brazilian they do not want to sell and now is not the time to discuss the future.\r\nNewcastle d… [+1245 chars]"}, {"source": {"id": null, "name": "Juvefc.com"}, "author": "juvefcdotcom", "title": "Cristiano Ronaldo will remain with Juventus - JuveFC", "description": "Cristiano Ronaldo will remain with Juventus until 2022, according to Tuttosport.", "url": "https://www.juvefc.com/cristiano-ronaldo-will-remain-with-juventus/", "urlToImage": null, "publishedAt": "2020-04-25T09:42:58Z", "content": "Cristiano Ronaldo will remain with Juventus until 2022, according to Tuttosport.\r\nThe 34-year-old has been with the Bianconeri for two seasons of his four-year contract after a big money move from Real Madrid in 2018.\r\nReports in Spanish and Italian press hav… [+409 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "‘You don’t want the fear,’ Yuvraj Singh explains why cricket should return only after Covid-19 is e... - Hindustan Times", "description": "Like other sports, international and domestic cricket too has been disrupted leading the national boards to contemplate resuming the game in empty stadiums, without fans.", "url": "https://www.hindustantimes.com/cricket/you-don-t-want-the-fear-yuvraj-singh-explains-why-cricket-should-return-only-after-covid-19-is-eradicated/story-7okHJdLw1JTTSzbxY9JJ6L.html", "urlToImage": null, "publishedAt": "2020-04-25T09:34:05Z", "content": "Former India star Yuvraj Singh wants cricket to resume only when the world becomes COVD-19 free as players’ health and safety should be paramount for the custodians of the game.\r\nLike other sports, international and domestic cricket too has been disrupted lea… [+1271 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "Dinesh Karthik picks his best IPL XI; expresses disappointment for not including MS Dhoni and R... - The Cricket Times", "description": "India wicket-keeper batsman Dinesh Karthik, recently picked his all-time T20 XI in the Indian Premier League (IPL). The only criterion for his selection was having played at least one game with the players. Karthik, renowned for his finishing abilities lower …", "url": "https://crickettimes.com/2020/04/dinesh-karthik-picks-his-best-ipl-xi-expresses-disappointment-for-not-including-ms-dhoni-and-r-ashwin/", "urlToImage": null, "publishedAt": "2020-04-25T09:33:01Z", "content": "India wicket-keeper batsman Dinesh Karthik, recently picked his all-time T20 XI in the Indian Premier League (IPL). The only criterion for his selection was having played at least one game with the players.\r\nKarthik, renowned for his finishing abilities lower… [+1972 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Akshat Gaur", "title": "Pat Cummins picks an Indian batsman as the toughest to... - The Cricket Times", "description": "Amid Coronavirus pandemic, cricketers are advancing towards social media platforms to engage with their fans and followers. In the process, Australia paceman Pat Cummins participated in an Instagram live Q/A session organised by the Australian Cricketers Asso…", "url": "https://crickettimes.com/2020/04/pat-cummins-picks-an-indian-as-the-toughest-batsman-to-bowl-terms-him-as-pain-in-the-back/", "urlToImage": null, "publishedAt": "2020-04-25T08:50:42Z", "content": "Amid Coronavirus pandemic, cricketers are advancing towards social media platforms to engage with their fans and followers. In the process, Australia paceman Pat Cummins participated in an Instagram live Q/A session organised by the Australian Cricketers Asso… [+1536 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Clubs will not splurge on transfer when football resumes: Manchester United chief Ed Woodward - India Today", "description": "Manchester United chief executive Ed Woodward said it may not be business as usual for Premier League teams when football resumes after the Covid-19 crisis eases out.", "url": "https://www.indiatoday.in/sports/football/story/manchester-united-transfer-spending-no-business-as-usual-ed-woodward-coronavirus-1670930-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T08:36:23Z", "content": "Manchester United chief executive Ed Woodward says clubs will not spend \"hundreds of millions\" when signing new players in the transfer window as they will be mindful of the financial impact of the COVID-19 pandemic.\r\nProfessional football in England has been… [+2057 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Saketh Kandadai", "title": "“It Was Not an Easy Night”: Steve Kerr Narrates a Hilarious Betting Story of Michael Jordan From Their College Days - Essentially Sports", "description": "Golden State Warriors coach Steve Kerr revealed a funny betting story with his former Chicago Bulls teammate Michael Jordan.", "url": "https://www.essentiallysports.com/nba-news-chicago-bulls-it-was-not-an-easy-night-steve-kerr-narrates-a-hilarious-betting-story-of-michael-jordan-from-their-college-days/", "urlToImage": null, "publishedAt": "2020-04-25T07:25:11Z", "content": "Golden State Warriors coach Steve Kerr revealed a funny betting story with his former teammate Michael Jordan.\r\nIt was during a game when Kerr was playing for the University of Arizona while Jordan was at the University of North Carolina. Kerr’s Wildcats defe… [+2070 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Rob Swan", "title": "Premier League football could be back on live TV ‘within weeks’ - GIVEMESPORT", "description": "Premier League football could be back on live TV ‘within weeks’", "url": "https://www.givemesport.com/1564740-premier-league-football-could-be-back-on-live-tv-within-weeks", "urlToImage": null, "publishedAt": "2020-04-25T07:13:11Z", "content": "It seems increasingly likely that the 2019-20 Premier League season will be concluded, according to fresh reports.\r\nNo top-flight football has been played in England since March 9 due to the ongoing coronavirus pandemic, which has threatened to lead to the ca… [+2264 chars]"}, {"source": {"id": null, "name": "Icc-cricket.com"}, "author": "ICC", "title": "Obituary: Graeme Watson - International Cricket Council", "description": "Graeme Watson, an all-rounder who featured in five Tests and two ODIs for Australia, died at 75 following a battle with cancer.", "url": "https://www.icc-cricket.com/news/1660856/obituary-graeme-watson", "urlToImage": null, "publishedAt": "2020-04-25T07:10:21Z", "content": "Graeme Watson, an all-rounder who featured in five Tests and two ODIs for Australia, died at 75 following a battle with cancer.Watson, a middle-order batsman and medium-pace bowler, finished his career with 4,674 runs and 186 wickets from 107 first-class game… [+1984 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Reubyn Coutinho", "title": "“The Winner Will Fight Khabib For the Title”- Dana White makes a huge statement - Essentially Sports", "description": "UFC President Dana White made a huge statement regarding UFC Lightweight division. He said the winner of Ferguson-Gaethje will fight Khabib for the title.", "url": "https://www.essentiallysports.com/ufc-news-the-winner-will-fight-khabib-for-the-title-dana-white-makes-a-huge-statement-tony-ferguson-justin-gaethje/", "urlToImage": null, "publishedAt": "2020-04-25T05:00:00Z", "content": "UFC 249 finally has a new venue. The event will take place at VyStar Veterans Memorial Arena in Jacksonville, Florida. The UFC pounced on a chance to hold their events in the Sunshine State as sports activities were deemed essential businesses. Dana White app… [+1819 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "No to saliva, yes to shine: Ball-tampering laws in cricket may change - Times of India", "description": "Cricket News: Cricket may change ball-tampering laws and approve external method to help polish the red cherry in proposed post-corona measures. The matter of saliv", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/no-to-saliva-yes-to-shine-ball-tampering-laws-in-cricket-may-change/articleshow/75367490.cms", "urlToImage": null, "publishedAt": "2020-04-25T04:40:29Z", "content": "NEW DELHI: The coronavirus pandemic may force cricket's world governing body to tweak one of its oldest rules and approve the use of an artificial substance to help shine the ball, effectively legalizing what has for long been a core tenet of the sport's anti… [+4836 chars]"}, {"source": {"id": "marca", "name": "Marca"}, "author": "Christian Gaudioso, Adapted by Billy Munday", "title": "Tebas: Once we're allowed to restart the season, clubs will be punished if they refuse to play - MARCA.com", "description": "LaLiga president Javier Tebas has insisted that teams who refuse to play the rest of the season will be punished.\n\nOrganisations like the Spanish...", "url": "https://www.marca.com/en/football/spanish-football/2020/04/24/5ea335ee46163fd4248b4661.html", "urlToImage": null, "publishedAt": "2020-04-24T18:58:00Z", "content": "LaLiga president Javier Tebas has insisted that teams who refuse to play the rest of the season will be punished.\r\nOrganisations like the Spanish Footballers' Association (AFE) have expressed their concern over player safety once the season resumes.\r\n\"If a cl… [+2899 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "Daniel Brettig", "title": "Cricket to consider legalised ball-tampering in wake of coronavirus | ESPNcricinfo.com - ESPNcricinfo", "description": "There are concerns about using saliva when cricket resumes due to the risks posed by Covid-19 | ESPNcricinfo.com", "url": "https://www.espncricinfo.com/story/_/id/29091809/cricket-consider-legalised-ball-tampering-wake-coronavirus", "urlToImage": null, "publishedAt": "2020-04-24T18:07:58Z", "content": "Coronavirus may force the busting of one of cricket's greatest taboos, as authorities consider the possibility of allowing the use of artificial substances to help polish the red ball under the supervision of umpires in long-form matches, in order to end the … [+6202 chars]"}, {"source": {"id": null, "name": "Everythingbarca.com"}, "author": "Aaditya Sibal", "title": "Barcelona have their ground plan ready over Philippe Coutinho’s future - Everything Barca", "description": "Barcelona has affirmed its desire to offload certain players in the summer transfer window. Barcelona have planned to offload Philippe Coutinho so that the...", "url": "https://everythingbarca.com/2020/04/24/barcelona-have-discussed-their-plans-to-release-philippe-coutinho/", "urlToImage": null, "publishedAt": "2020-04-24T16:35:52Z", "content": "More from Everything Barca\r\nBarcelona have planned to offload Philippe Coutinho so that they can generate sufficient funds to sign one of their primary transfer target Neymarover the summer transfer market.\r\nPlayers such as Ivan Rakitic, Arturo Vidal, Samuel … [+1877 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Covid-19 outbreak: Ajax denied title as Dutch Eredivisie season declared void - India Today", "description": "The Dutch Eredivisie season has been ended with immediate effect, meaning league leaders Ajax have been denied the title.", "url": "https://www.indiatoday.in/sports/football/story/covid-19-outbreak-ajax-denied-title-as-dutch-eredivisie-season-declared-void-1670775-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T16:33:44Z", "content": "No top-flight league title will be awarded in the Netherlands after the COVID-19 pandemic brought the campaign to a premature close but Ajax Amsterdam and AZ Alkmaar will qualify for next season's Champions League, Dutch media reported on Friday.\r\nThe reports… [+560 chars]"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Ibrahimovic slams 'kindergarten-level' vandals who attacked AC Milan forward's statue in Malmo - Goal India", "description": "Jill Ellis ruled the world with the U.S. women's national team, and Karen Carney says the English-born coach could be perfect for the Lionesses.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T16:14:00Z", "content": "More"}, {"source": {"id": null, "name": "Sportingnews.com"}, "author": "Sporting News", "title": "Keane sees 'long way back' for Man Utd & remains unconvinced by Shaw - Goal India", "description": "Everton have said they are \"appalled\" at striker Moise Kean after he posted videos of himself and friends throwing a party at his apartment.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": null, "publishedAt": "2020-04-24T14:54:00Z", "content": "More"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "Rohit Sharma tags Shubman Gill as the future of Indian... - The Cricket Times", "description": "During a recent interaction between former India and Mumbai Indians colleagues Harbhajan Singh and Rohit Sharma, the latter tagged Punjab batsman Shubman Gill as the future of Indian cricket. Gill was an integral part of India' A' setup where he accumulated h…", "url": "https://crickettimes.com/2020/04/rohit-sharma-tags-shubman-gill-as-the-future-of-indian-cricket/", "urlToImage": null, "publishedAt": "2020-04-24T14:38:17Z", "content": "During a recent interaction between former India and Mumbai Indians colleagues Harbhajan Singh and Rohit Sharma, the latter tagged Punjab batsman Shubman Gill as the future of Indian cricket.\r\nGill was an integral part of India’ A’ setup where he accumulated … [+1583 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India", "title": "When Saqlain Mushtaq sledged Sachin Tendulkar only to never sledge him again - Hindustan Times", "description": "In one of his early battles with Tendulkar during the Sahara Cup in Canada, Saqlain thought it would be a good idea to sledge the champion batsman. As it panned out, the wily off-spinner sledged to never sledge the then Indian captain again.", "url": "https://www.hindustantimes.com/cricket/when-saqlain-mushtaq-sledged-sachin-tendulkar-only-to-never-sledge-him-again/story-49B4FOTLWL2bJyBWNia1dM.html", "urlToImage": null, "publishedAt": "2020-04-24T13:06:55Z", "content": "Sachin Tendulkar and Saqlain Mushtaq were involved in umpteen intense battles in the ‘90s but one such duel left the star Pakistan off-spinner deeply embarrassed. In one of his early battles with Tendulkar during the Sahara Cup in Canada, Saqlain thought it w… [+3282 chars]"}, {"source": {"id": null, "name": "Crickettimes.com"}, "author": "Shubro Mukherjee", "title": "Kevin Pietersen reacts to Michael Vaughan's 'jealousy'... - The Cricket Times", "description": "Former England batsman Kevin Pietersen responded to Michael Vaughan spilling beans about the atmosphere of the England side when the former bagged a lucrative IPL contract in 2009. Vaughan claimed about factions in the team envious about KP being recruited by…", "url": "https://crickettimes.com/2020/04/kevin-pietersen-reacts-to-michael-vaughans-jealousy-statement/", "urlToImage": null, "publishedAt": "2020-04-24T12:26:46Z", "content": "Former England batsman Kevin Pietersen responded to Michael Vaughan spilling beans about the atmosphere of the England side when the former bagged a lucrative IPL contract in 2009.\r\nVaughan claimed about factions in the team envious about KP being recruited b… [+2074 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Liverpool set to be crowned champions if season doesn’t finish: Report - Hindustan Times", "description": "Liverpool were on the threshold of ending their 30-year drought before the season was stalled because of the Coronavirus outbreak.", "url": "https://www.hindustantimes.com/football/liverpool-set-to-be-crowned-champions-if-season-doesn-t-finish-report/story-6U2KPVQl4Y7SGDwt7wXQ4N.html", "urlToImage": null, "publishedAt": "2020-04-24T12:15:13Z", "content": "English giants Liverpool will be crowned Premier League champions if the season cannot be completed, according to local media reports. The Premier League had to be stopped after matchday 29 as a precautionary measure against coronavirus pandemic.\r\nLiverpool w… [+1010 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Pornographic images pop-up as top badminton coaches left red-faced during online training session - India Today", "description": "An online training session held by Sports Authority of India (SAI) and Badminton Association of India (BAI) was abruptly ended of Thursday after pornographic images popped up on the screens.", "url": "https://www.indiatoday.in/sports/badminton/story/pornographic-images-bai-sai-online-training-session-pullela-gopichand-coach-badminton-zoom-videoconferencing-app-coronavirus-pandemic-1670627-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T12:13:35Z", "content": "The online training session held by Sports Authority of India (SAI) and Badminton Association of India (BAI) found itself in an unwanted situation after pornographic images suddenly flashed on the screens of 700-plus coaches across the country on Thursday.\r\nT… [+2211 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "Tim Keown", "title": "'The Last Dance' - Dennis Rodman embodied the pop culture phenomenon of the '90s Bulls - ESPN India", "description": "Spending time with Dennis Rodman in the mid-1990s meant having a front-row seat to the basketball/pop culture phenomenon of the Bulls, an experience that can only be described as surreal.", "url": "https://www.espn.in/nba/story/_/id/29083157/the-last-dance-dennis-rodman-embodied-pop-culture-phenomenon-90s-bulls", "urlToImage": null, "publishedAt": "2020-04-24T12:05:53Z", "content": "MY OLDEST SON was 5, in his second month of kindergarten, when his teacher asked why his dad hadn't been seen in the pickup line for a couple of weeks. \"He's living with Dennis Rodman,\" my son answered, dripping nonchalance, as if this were a task every Catho… [+16407 chars]"}, {"source": {"id": null, "name": "Icc-cricket.com"}, "author": "ICC", "title": "1 Live cricket resumes this weekend in Vanuatu Live cricket action returns this weekend in Vanuatu - International Cricket Council", "description": "Live cricket action returns this weekend in Vanuatu, with many of the country's best players in action – and doing so for a good cause.", "url": "https://www.icc-cricket.com/news/1660447/live-cricket-resumes-this-weekend-in-vanuatu", "urlToImage": null, "publishedAt": "2020-04-24T10:48:55Z", "content": "Live cricket action returns this weekend in Vanuatu, with many of the country's best players in action and doing so for a good cause.COVID-19 has brought live sports to a grinding halt globally even as governments and frontline workers strive to fight the pan… [+2666 chars]"}, {"source": {"id": null, "name": "Cricbuzz.com"}, "author": null, "title": "Fully fit Bhuvneshwar focusing on fitness with cricket on hold - Cricbuzz - Cricbuzz", "description": "The India pacer underwent surgery for sports hernia in January and has been out of action since", "url": "https://www.cricbuzz.com/cricket-news/112924/fully-fit-bhuvneshwar-focusing-on-fitness-with-cricket-on-hold", "urlToImage": null, "publishedAt": "2020-04-24T10:29:56Z", "content": "Bhuvneshwar underwent surgery for sports hernia in January and has been out of action since. © BCCI\r\nFast bowlers and injuries go hand in hand. And it's no different for Bhuvneshwar Kumar. The pacer picked up a groin injury, which was later diagnosed to be a … [+3079 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘He was a nightmare’: James Anderson, Stuart Broad name toughest batsman to bowl at - Hindustan Times", "description": "When asked about which batsman was the toughest to bowl against in their career, both had the same answer, former South Africa opener and captain Graeme Smith.", "url": "https://www.hindustantimes.com/cricket/he-was-a-nightmare-james-anderson-stuart-broad-name-toughest-batsman-to-bowl-at/story-QL2mlt84USC8Ay8K9e1g8O.html", "urlToImage": null, "publishedAt": "2020-04-24T09:28:05Z", "content": "James Anderson and Stuart Broad together form one of the most successful new ball duos in Test cricket. Both have bowled in tandem and wreaked havoc on touring batsmen in the helpful English conditions for many years now. Anderson has a record 584 wickets to … [+1507 chars]"}]}