{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Fieldgulls.com"}, "author": "John P. Gilbert", "title": "Why the Seahawks selected Darrell Taylor out of Tennessee with pick 48 - Field Gulls", "description": "The Seattle Seahawks shocked not only their own fans, but observers across the league as well when they selected linebacker Jordyn Brooks out of Texas Tech in the first round of the 2020 NFL Draft....", "url": "https://www.fieldgulls.com/2020/4/24/21235429/seahawks-select-darrell-taylor-out-tennessee-with-first-of-two-second-round-picks-edge-pass-rush", "urlToImage": null, "publishedAt": "2020-04-25T00:42:59Z", "content": "The Seattle Seahawks shocked not only their own fans, but observers across the league as well when they selected linebacker Jordyn Brooks out of Texas Tech in the first round of the 2020 NFL Draft. At a position group that already has future Hall of Famer Bob… [+1064 chars]"}, {"source": {"id": null, "name": "Clevelandbrowns.com"}, "author": null, "title": "Browns select LSU S Grant Delpit with No. 44 pick in 2020 NFL Draft - clevelandbrowns.com", "description": "Cleveland adds the 2019 Jim Thorpe Award winner to its defensive backfield", "url": "https://www.clevelandbrowns.com/news/browns-select-lsu-s-grant-delpit-with-no-44-pick-in-2020-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-25T00:11:29Z", "content": "For the second year in a row, the Browns found a decorated LSU defensive back in the second round.\r\nOne year after drafting CB Greedy Williams, the Browns on Friday selected LSU S Grant Delpit with the No. 44 overall pick in the 2020 NFL Draft. Williams was s… [+876 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "James Harden's Debut For The Rockets | #NBATogetherLive Classic Game - NBA", "description": "Throwback to the first game James Harden suited up for the Houston Rockets Subscribe to the NBA: https://on.nba.com/2JX5gSN Full Game Highlights Playlist: ht...", "url": "https://www.youtube.com/watch?v=-zzSYS3DRg0", "urlToImage": null, "publishedAt": "2020-04-25T00:01:30Z", "content": null}, {"source": {"id": null, "name": "Hogshaven.com"}, "author": "Scott Jennings", "title": "Trent Williams Redskins Trade Rumors: The 49ers are interested, and the Vikings are out? - Hogs Haven", "description": "Will the saga end tonight?", "url": "https://www.hogshaven.com/2020/4/24/21235447/trent-williams-redskins-trade-rumors-the-49ers-are-interested-and-the-vikings-are-out", "urlToImage": null, "publishedAt": "2020-04-25T00:00:59Z", "content": "Another day, and another rumor surrounding the Trent Williams trade saga. The Buccaneers have been outed as a team that was interested in trading for Williams until they picked Tristan Wirfs last night. The Browns and Jets were also linked to a Trent Williams… [+1656 chars]"}, {"source": {"id": null, "name": "Detroitlions.com"}, "author": null, "title": "A CLOSER LOOK: Running back D'Andre Swift - detroitlions.com", "description": "Tim Twentyman and Mike O’Hara share their thoughts on the Lions’ second-round selection of D'Andre Swift.", "url": "https://www.detroitlions.com/news/a-closer-look-running-back-d-andre-swift", "urlToImage": null, "publishedAt": "2020-04-24T23:55:11Z", "content": "Bio: Early success for Swift, who played Pop Warner football growing up in Philadelphia and was on three state championship teams in four years of high school.\r\nRunning the ball three seasons against tough SEC competition, he rushed for 1,049 yards in 2018 an… [+528 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": null, "title": "NFL GM: Jalen Reagor is 'worst pick of the draft' - NBC Sports Philadelphia", "description": "The Eagles added a new wide receiver Thursday in Jalen Reagor, but at least one NFL decision maker thinks they made a huge mistake. By Adam Hermann", "url": "https://www.nbcsports.com/philadelphia/eagles/nfl-draft-2020-gm-eagles-jalen-reagor-choice-worst-pick", "urlToImage": null, "publishedAt": "2020-04-24T23:44:39Z", "content": "The first round of the 2020 NFL Draft is in the books. Three of the first six picks were quarterbacks and Andy Reid loves Hawaiian shirts. It was a long, eventful evening.\r\nThe first 32 selections are below as well as the remaining six rounds in current draft… [+9251 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Matt  Miller", "title": "Kyle Dugger NFL Draft 2020: Scouting Report for New England Patriots' Pick - Bleacher Report", "description": "S  Kyle Dugger , Lenoir-Rhyne          STRENGTHS   —Small-school standout who thrived against the best of the best at the 2020 Senior Bowl...", "url": "https://bleacherreport.com/articles/2884102-kyle-dugger-nfl-draft-2020-scouting-report-for-new-england-patriots-pick", "urlToImage": null, "publishedAt": "2020-04-24T23:39:31Z", "content": "Don Juan Moore/Getty Images\r\nS Kyle Dugger, Lenoir-Rhyne\r\nSTRENGTHS\r\nSmall-school standout who thrived against the best of the best at the 2020 Senior Bowl.\r\nAthletic, powerful player who can play any safety position; could also play linebacker and return pun… [+1104 chars]"}, {"source": {"id": null, "name": "Cincyjungle.com"}, "author": "Jason Marcum", "title": "Bengals draft Clemson Tigers’ Tee Higgins in 2020 NFL Draft - Cincy Jungle", "description": "The Bengals land a game-breaking receiver to give Joe Burrow a new toy.", "url": "https://www.cincyjungle.com/2020/4/24/21235323/bengals-draft-2020-picks-tee-higgins-clemson-tigers-football", "urlToImage": null, "publishedAt": "2020-04-24T23:29:26Z", "content": "With the 33rd overall pick in the 2020 NFL Draft, the Cincinnati Bengals have selected Clemson Tigers wide receiver Tee Higgins. \r\nThere was several reports today that the Bengals were trying to trade down from the 33rd pick, but they opted to keep the pick i… [+1205 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Ryan Gaydos", "title": "Aaron Rodgers gets Packers general manager's support despite Jordan Love selection - Fox News", "description": "The Green Bay Packers shocked the NFL world on Thursday night when they chose Utah State quarterback Jordan Love with their first-round pick with many thinking it was a slight to Aaron Rodgers.", "url": "https://www.foxnews.com/sports/aaron-rodgers-packers-general-managers-support-jordan-love-selection", "urlToImage": null, "publishedAt": "2020-04-24T23:25:59Z", "content": "The Green Bay Packers shocked the NFL world on Thursday night when they chose Utah State quarterback Jordan Love with their first-round pick with many thinking it was a slight to Aaron Rodgers.\r\nPackers General Manager Brian Gutekunst offered praise for Rodge… [+1420 chars]"}, {"source": {"id": null, "name": "Colts.com"}, "author": null, "title": "2020 NFL Draft: Wide receiver Michael Pittman Jr., Southern California, 34th-overall pick - Colts.com", "description": "The Indianapolis Colts tonight selected USC wide receiver Michael Pittman Jr. with their second-round (34th-overall) pick in the 2020 NFL Draft.", "url": "https://www.colts.com/news/michael-pittman-jr-nfl-draft-wide-receiver-southern-california-usc", "urlToImage": null, "publishedAt": "2020-04-24T23:23:02Z", "content": "INDIANAPOLIS The Indianapolis Colts tonight selected USC wide receiver Michael Pittman Jr. with their second-round (34th-overall) pick in the 2020 NFL Draft.\r\nPittman Jr., who will turn 23 during the 2020 season, is a 6-foot-4, 223-pound Southern California p… [+1351 chars]"}, {"source": {"id": null, "name": "Behindthesteelcurtain.com"}, "author": "Jeff.Hartman", "title": "2020 NFL Draft: Day 2 Steelers news, updates and open thread - Behind the Steel Curtain", "description": "Be sure to stay in tune with the Steelers for Day 1 selections of the 2020 NFL Draft.", "url": "https://www.behindthesteelcurtain.com/2020/4/24/21234430/2020-nfl-draft-day-2-pittsburgh-steelers-news-updates-and-open-thread-rumors", "urlToImage": null, "publishedAt": "2020-04-24T22:40:00Z", "content": "Day 2 of the 2020 NFL Draft is HERE!! No more mock drafts. No more breakdowns. No more educated guesses. No more scenarios.\r\nNo, it is time to sit back and see who the Steelers select in Rounds 2 and 3, as the Pittsburgh Steelers have two picks, one in each r… [+1084 chars]"}, {"source": {"id": null, "name": "News4jax.com"}, "author": "Justin Barney, Cole Pepper, Jamal St. Cyr", "title": "News4Jax draft reaction: CJ Henderson fills a major need for Jaguars - WJXT News4JAX ", "description": "The Jaguars made Florida cornerback CJ Henderson their draft pick at No. 9 in the opening round on Thursday night. The News4Jax sports staff offers its analysis on the selection.", "url": "https://www.news4jax.com/sports/2020/04/24/news4jax-draft-reaction-cj-henderson-fills-a-major-need-for-jaguars/", "urlToImage": null, "publishedAt": "2020-04-24T22:12:24Z", "content": "JACKSONVILLE, Fla. The Jaguars made Florida cornerback CJ Henderson their draft pick at No. 9 in the opening round on Thursday night. The News4Jax sports staff offers its analysis on the selection, the first of their two selections on Thursday night.\r\nJustin … [+2163 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Mike Bohn", "title": "'Fight Island' update: Dana White plans beachfront octagon, shows 'up and running by June' - MMA Junkie", "description": "UFC president Dana White maintains his promise that “Fight Island” is a real thing.", "url": "https://mmajunkie.usatoday.com/2020/04/fight-island-update-dana-white-beachfront-octagon-june-events", "urlToImage": null, "publishedAt": "2020-04-24T22:02:32Z", "content": "UFC president Dana White maintains “Fight Island” is a real thing, and the venue will be prepared to host events inside two months.\r\nAlthough the location is still unknown, White insists the private island he’s secured in the wake of the coronavirus pandemic … [+1597 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "Josh Edwards", "title": "2020 NFL Draft: Live tracker, picks by team, grades, analysis, order, start time for Round 2 - CBSSports.com", "description": "CBS Sports is bringing you live updates and analysis as the 2020 NFL Draft unfolds throughout the weekend", "url": "https://www.cbssports.com/nfl/news/2020-nfl-draft-live-tracker-picks-by-team-grades-analysis-order-start-time-for-round-2/live/", "urlToImage": null, "publishedAt": "2020-04-24T22:00:00Z", "content": "Hey Dan. He crushed it from what I was told. He seemed pretty confident he was going to Philly at No. 21. \r\nLove this comment from him. \r\n\"I don't look to match myself up against anyone, to be honest. I'm just going to be the best pro I can, continue to eleva… [+361 chars]"}, {"source": {"id": null, "name": "Elitesportsny.com"}, "author": "Jason Leach", "title": "New York Giants draft: Day 2 defensive targets with 1st-round talent - Elite Sports NY", "description": "After solidifying the offensive line in the first round, the New York Giants must turn their attention to the defense.", "url": "https://elitesportsny.com/2020/04/24/new-york-giants-draft-day-2-defensive-targets-with-1st-round-talent/", "urlToImage": null, "publishedAt": "2020-04-24T21:57:00Z", "content": "After solidifying the offensive line in the first round, the New York Giants must turn their attention to the defense.\r\nNew York Giants general manager Dave Gettleman had his sights on improving an offensive line that gave up 43 sacks last season. He accompli… [+2925 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Gary Neville warns people are getting \"carried away\" with Man Utd target Jadon Sancho - Mirror Online", "description": "Man Utd legend Gary Neville has put Jadon Sancho's quality into context compared to some of the world's best players", "url": "https://www.mirror.co.uk/sport/football/news/gary-neville-warns-people-getting-21923589", "urlToImage": null, "publishedAt": "2020-04-24T21:41:45Z", "content": "Gary Neville claims Manchester United target Jadon Sancho is \"nowhere near\" some of the world's elite.\r\nThe Red Devils have been linked with the Borussia Dortmund star who is likely to cost around £100m.\r\nMuch is made of the Englishman's exploits in the Bunde… [+1834 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Charean Williams", "title": "Marquise Goodwin remains with 49ers but for how long? - NBCSports.com", "description": "The 49ers got their receiver in the first round, selecting Arizona State’s Brandon Aiyuk 25th overall. What they didn’t do was trade a veteran wideout as hoped. Marquise Goodwin, whom General Manager John Lynch thought he might trade Thursday, remains on the …", "url": "https://profootballtalk.nbcsports.com/2020/04/24/marquise-goodwin-remains-with-49ers-but-for-how-long/", "urlToImage": null, "publishedAt": "2020-04-24T21:29:00Z", "content": "The 49ers got their receiver in the first round, selecting Arizona State’s Brandon Aiyuk 25th overall. What they didn’t do was trade a veteran wideout as hoped.\r\nMarquise Goodwin, whom General Manager John Lynch thought he might trade Thursday, remains on the… [+1050 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Ryan Gaydos", "title": "Tom Brady's interactions with Buccaneers coaches doesn't jibe well with rest of NFL: report - Fox News", "description": "NFL teams are reportedly perturbed that Tom Brady is visiting Tampa Bay Buccaneers coaches amid restrictions over the coronavirus pandemic and are seeking league discipline against both parties.", "url": "https://www.foxnews.com/sports/tom-brady-interactions-buccaneers-doesnt-jive-well-nfl-report", "urlToImage": null, "publishedAt": "2020-04-24T21:14:55Z", "content": "NFL teams are reportedly perturbed that Tom Brady is visiting Tampa Bay Buccaneers coaches amid restrictions over the coronavirus pandemic and are seeking league discipline against both parties.\r\nTeams have told the league they are expecting “stern” punishmen… [+1747 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Sarah Barshop", "title": "Source - Texans begin extension talks with Deshaun Watson - ESPN", "description": "The Texans have opened preliminary extension talks with quarterback Deshaun Watson, who is eligible for a new contract for the first time this offseason.", "url": "https://www.espn.com/nfl/story/_/id/29095080/source-texans-begin-extension-talks-deshaun-watson", "urlToImage": null, "publishedAt": "2020-04-24T21:07:25Z", "content": "HOUSTON -- The Texans have engaged in \"very preliminary\" discussions with quarterback Deshaun Watson about a potential contract extension, a source told ESPN's Ed Werder.\r\nOn Friday, Houston finalized a three-year, $66 million contract extension with left tac… [+1830 chars]"}, {"source": {"id": null, "name": "Clutchpoints.com"}, "author": "Skyler Carlin", "title": "Why the Cowboys got the steal of the NFL Draft in selecting CeeDee Lamb - ClutchPoints", "description": "The first round of the 2020 NFL Draft is in the rearview mirror, with quite a few surprises taking place. However, none of them might have been as shocking as the Dallas Cowboys being able to select CeeDee Lamb with the No. 17 pick. Throughout the pre-draft p…", "url": "https://clutchpoints.com/why-the-cowboys-got-the-steal-of-the-nfl-draft-in-selecting-ceedee-lamb/", "urlToImage": null, "publishedAt": "2020-04-24T21:00:31Z", "content": "The first round of the 2020 NFL Draft is in the rearview mirror, with quite a few surprises taking place. However, none of them might have been as shocking as the Dallas Cowboysbeing able to select CeeDee Lamb with the No. 17 pick.\r\nThroughout the pre-draft p… [+2494 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Rachel Handler", "title": "The Only Good Look Is Michael Jordan’s ’90s Practice Uniform - Vulture", "description": "The Last Dance has entirely changed my quarantine wardrobe.", "url": "http://www.vulture.com/2020/04/the-last-dance-michael-jordan-practice-uniform.html", "urlToImage": null, "publishedAt": "2020-04-24T20:16:21Z", "content": "Much has been written about how we should dress while social distancing. Some people believe we should wake up every morning and put on the same clothes we would normally wear to work. These people frighten me, and I am going to move on without addressing the… [+9919 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Justin Herbert compares his game to Matt Ryan, talks Draft, Chargers, Oregon & more | NFL | THE HERD - The Herd with Colin Cowherd", "description": "Justin Herbert joins Colin Cowherd to discuss football. Hear his account of draft night, who he compares his game to, his time at Oregon as well as what he l...", "url": "https://www.youtube.com/watch?v=zbpy00fDA1k", "urlToImage": null, "publishedAt": "2020-04-24T20:02:14Z", "content": "Justin Herbert joins Colin Cowherd to discuss football. Hear his account of draft night, who he compares his game to, his time at Oregon as well as what he looks forward to joining the Los Angeles Chargers.\r\n#TheHerd#NFL#JustinHerbert#MattRyan#Chargers#NFLDra… [+1275 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Marc J. Spears", "title": "All-American Greg Brown III commits to play for the Texas Longhorns - ESPN", "description": "McDonald's All-America selection Greg Brown III announced he is following in his family's footsteps by going to the University of Texas to play basketball.", "url": "https://www.espn.com/mens-college-basketball/story/_/id/29094836/all-american-greg-brown-iii-commits-play-texas-longhorns", "urlToImage": null, "publishedAt": "2020-04-24T20:01:48Z", "content": "McDonald's All-America selection Greg Brown III announced Friday that he is following in his family's footsteps by going to the University of Texas to play basketball.\r\nBrown announced, in conjunction with ESPN The Undefeated, on Instagram that he turned down… [+2480 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Kathleen Elkins", "title": "NFL player has some blunt money advice for rookies: 'Do not live a lavish lifestyle' - CNBC", "description": "Joe Burrow and the other top NFL draft picks will make millions. Current player Byron Jones took to Twitter to offer his best money advice for the incoming rookies.", "url": "https://www.cnbc.com/2020/04/24/nfl-player-gives-his-best-money-advice-to-rookies.html", "urlToImage": null, "publishedAt": "2020-04-24T19:55:16Z", "content": "The 2020 NFL draft took place virtually on Thursday night. The Cincinnati Bengals selected former LSU standout Joe Burrow with the first pick. The 23-year-old quarterback, who is among a select few to have won the Heisman Trophy and a national championship in… [+1811 chars]"}, {"source": {"id": null, "name": "Newser.com"}, "author": "Bob Cronin", "title": "Brother of Cowboys QB Dies at 31 - Newser", "description": "Jace Prescott played college ball for Northwestern State", "url": "https://www.newser.com/story/290035/brother-of-cowboys-qb-dies-at-31.html", "urlToImage": null, "publishedAt": "2020-04-24T19:45:00Z", "content": "(Newser)\r\nJace Prescott, a former offensive lineman at Northwestern State and older brother of Dallas Cowboys quarterback Dak Prescott, died Thursday. The Cowboys announced the death, CBS Sports reports, but did not give the cause. \"He was a great kid who dom… [+691 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Jeff Risdon", "title": "Lions draft 'choose your own adventure' Day 2 mock draft - Lions Wire", "description": "Lions draft ‘choose your own adventure’ Day 2 mock draft provides several different options for each Lions pick in the 2nd and 3rd rounds", "url": "https://lionswire.usatoday.com/2020/04/24/lions-draft-choose-your-own-adventure-day-2-mock-draft/", "urlToImage": null, "publishedAt": "2020-04-24T19:15:05Z", "content": "Round 1 of the 2020 NFL Draft went as expected for the Detroit Lions. The team landed Ohio State standout CB Jeff Okudah at No. 3 overall. Now comes Friday night and Rounds 2 and 3 and the Lions’ next three selections.\r\nThere are a number of different paths t… [+2682 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Brad Keselowski breakdown: Winning moves, key decisions in first victory | Talladega Superspeedway - NASCAR", "description": "Brad Keselowski's first NASCAR Cup Series win was memorable for its thrilling, controversial conclusion. The Team Penske driver sits down to analyze and expl...", "url": "https://www.youtube.com/watch?v=8EYwW6uV6s0", "urlToImage": null, "publishedAt": "2020-04-24T19:11:42Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Behind-The-Scenes Of Patrick Queen's Draft Call | Baltimore Ravens - Baltimore Ravens", "description": "Eric DeCosta said he wants to follow in Ozzie Newsome’s footsteps of drafting Pro Bowl inside linebackers but with his own twist of making the Ravens’ first ...", "url": "https://www.youtube.com/watch?v=xM_wnoRKQFc", "urlToImage": null, "publishedAt": "2020-04-24T19:04:14Z", "content": null}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Jaclyn Hendricks", "title": "Could Patriots snag Jalen Hurts in second round of 2020 NFL Draft? - New York Post ", "description": "Will Friday be Jalen Hurts’ day? The former Oklahoma Sooners quarterback, who slipped out of the first round of the 2020 NFL Draft on Thursday night, could land in New England as early as pic…", "url": "https://nypost.com/2020/04/24/jalen-hurts-could-land-with-patriots-on-day-2-of-2020-nfl-draft/", "urlToImage": null, "publishedAt": "2020-04-24T18:53:23Z", "content": "Hurts will forever remember his three years with Nick Saban and the Crimson Tide.\r\nNick Saban is a legendary guy, a stand-up guy,” Hurts said in an interview with KHOU-11, via 24/7 Sports.\r\n“Just going to the University of Alabama, I decided to go there becau… [+445 chars]"}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "CBS Boston", "title": "Report: NFL Teams ‘Miffed’ At Tom Brady, Want Bucs Penalized For Violating Social Distancing Restrictions - CBS Boston", "description": "It took Tom Brady all of five minutes to tick off the rest of the NFL with his new team.", "url": "https://boston.cbslocal.com/2020/04/24/nfl-teams-miffed-at-tom-brady-want-bucs-penalized-interactions/", "urlToImage": null, "publishedAt": "2020-04-24T18:17:45Z", "content": "BOSTON (CBS) — It took Tom Brady all of five minutes to tick off the rest of the NFL with his new team.\r\nAs you likely heard this week, Brady made the mistake of entering the wrong home when trying to visit offensive coordinator Byron Leftwich. That story cam… [+2541 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "1st Rd. Picks React to Being Drafted: Burrow, Tua, Love & More - NFL Media Originals", "description": "Subscribe to NFL Network: http://goo.gl/4GOLwY Check out our other channels: NFL Vault http://youtube.com/nflvault NFL Films http://www.youtube.com/nflfilms ...", "url": "https://www.youtube.com/watch?v=WP75lJS9P_c", "urlToImage": null, "publishedAt": "2020-04-24T18:15:55Z", "content": null}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "James Dator", "title": "Kliff Kingsbury’s mansion was the biggest flex of the NFL Draft - SB Nation", "description": "This house!", "url": "https://www.sbnation.com/nfl/2020/4/24/21234718/kliff-kingsburys-mansion-was-the-biggest-flex-of-the-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-24T18:15:19Z", "content": "Kliff Kingsbury accidentally stole the show during the NFL Draft by doing absolutely nothing other than sitting on his sofa. That sounds ridiculous until you see his house.\r\nKingsburys house is so incredible its like everyones idea of a dream home rolled into… [+1153 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "UFC Debut: Georges St-Pierre vs Karo Parisyan | Free Fight - UFC - Ultimate Fighting Championship", "description": "Georges St-Pierre, one of the greatest UFC fighters of all time, made his UFC debut at UFC 46 against Karo Parisyan as the featured bout of the preliminary c...", "url": "https://www.youtube.com/watch?v=_OE9thpvgr8", "urlToImage": null, "publishedAt": "2020-04-24T18:06:16Z", "content": "Georges St-Pierre, one of the greatest UFC fighters of all time, made his UFC debut at UFC 46 against Karo Parisyan as the featured bout of the preliminary card.\r\nSubscribe to get all the latest UFC content: http://bit.ly/2uJRzRR\r\nExperience UFC live with UFC… [+653 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Brian Costello", "title": "NFL Draft Round 2: Star running backs could create Jets' dilemma - New York Post ", "description": "The Jets filled a big hole with a big man in Round 1 of the NFL Draft 2020 by selecting Louisville tackle Mekhi Becton. Now, GM Joe Douglas has more work to do. There are many ways the Jets can go …", "url": "https://nypost.com/2020/04/24/nfl-draft-round-2-running-backs-could-create-jets-dilemma/", "urlToImage": null, "publishedAt": "2020-04-24T17:49:46Z", "content": "The Jets filled a big hole with a big man in Round 1 of the NFL Draft 2020 by selecting Louisville tackle Mekhi Becton.\r\nNow, GM Joe Douglas has more work to do.\r\nThere are many ways the Jets can go in Round 2 with the No. 48 overall pick. The obvious choice … [+3622 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Andersen reveals the best and worst part about isolating with Matthews - TSN", "description": "Maple Leafs goaltender Frederik Andersen joins James Duthie to talk about what isolation has been like with Auston Matthews down in Arizona. He also touches ...", "url": "https://www.youtube.com/watch?v=YMidEz7ODJo", "urlToImage": null, "publishedAt": "2020-04-24T17:30:31Z", "content": null}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Brooks Koepka Gets Quarantine Haircut From Model GF, 'It Did Not Go Well' - TMZ", "description": "\"It did not go well.\" That's how Brooks Koepka's model GF described the way she cut the PGA Tour star's hair during quarantine.", "url": "https://www.tmz.com/2020/04/23/brooks-keopka-pga-tour-jena-sims-quarantine-haircut/", "urlToImage": null, "publishedAt": "2020-04-24T17:22:17Z", "content": "\"It did not go well.\"\r\nThat's how Brooks Koepka's model GF described the way she cut the PGA Tour star's hair during quarantine ... and we gotta say, we agree -- but the whole process was at least funny as hell!!\r\nThe golf stud was in desperate need of a trim… [+842 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Michael Middlehurst-Schwartz", "title": "NFL draft 2020's best available players in second round: Grant Delpit, Laviska Shenault among top options on board - USA TODAY", "description": "There's still plenty of first-round talent available for teams on Day 2 of the NFL draft, including several promising options at safety and receiver.", "url": "https://www.usatoday.com/story/sports/nfl/draft/2020/04/24/nfl-draft-second-round-best-players-available-2020/3020500001/", "urlToImage": null, "publishedAt": "2020-04-24T17:10:28Z", "content": "SportsPulse: The first night of the NFL's virtual draft went off without a hitch and Mackenzie Salmon is here to break down the nights biggest winners and losers.\r\nUSA TODAY\r\nThere's still first-round talent awaiting teams on Day 2 of the 2020 NFL draft.\r\nThu… [+5255 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Chelsea know Arsenal are vulnerable & have to move Pierre-Emerick Aubameyang soon - Ogden | ESPN FC - ESPN UK", "description": "ESPN FC's Mark Ogden reacts to reports that Chelsea are planning to make a move on Arsenal's Pierre-Emerick Aubameyang during the summer transfer window. Ogd...", "url": "https://www.youtube.com/watch?v=cwci7EzTV-4", "urlToImage": null, "publishedAt": "2020-04-24T17:01:45Z", "content": "ESPN FC's Mark Ogden reacts to reports that Chelsea are planning to make a move on Arsenal's Pierre-Emerick Aubameyang during the summer transfer window. Ogden says despite Chelsea's interest, Aubameyang will probably have offers from bigger and better clubs.… [+171 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Baxter Holmes", "title": "Lakers' Kobe Bryant also documented final NBA season with all-access film crew - ESPN", "description": "As a documentary chronicling Michael Jordan's final season with the Bulls is aired, Lakers players and staffers are reminded that Kobe Bryant's final season also was captured in an all-access, behind-the-scenes look by a camera crew.", "url": "https://www.espn.com/nba/story/_/id/29094018/lakers-kobe-bryant-documented-final-nba-season-all-access-film-crew", "urlToImage": null, "publishedAt": "2020-04-24T16:36:09Z", "content": "On Sunday night, as Cleveland Cavaliers forward Larry Nance Jr. sat down with his family to watch the first two episodes of ESPN's 10-part documentary on Michael Jordan and the 1997-98 Chicago Bulls, he was suddenly transported to his rookie season playing al… [+7938 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Josh Alper", "title": "Report: Teams calling Panthers about Curtis Samuel - NBCSports.com", "description": "The Panthers have said goodbye to several players from the final years of Ron Rivera’s run as their head coach and other teams are reportedly calling to see if they’ll send another one packing during the draft. Ian Rapoport of NFL Media reports that teams hav…", "url": "https://profootballtalk.nbcsports.com/2020/04/24/report-teams-calling-panthers-about-curtis-samuel/", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "The Panthers have said goodbye to several players from the final years of Ron Rivera’s run as their head coach and other teams are reportedly calling to see if they’ll send another one packing during the draft.\r\nIan Rapoport of NFL Media reports that teams ha… [+534 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Jabari Young", "title": "Sports teams mull how to cover refunds and lost ticketing revenue - CNBC", "description": "The suspension of live events due to Cvoid-19 is hurting a sector in the sports world that, according to a study was projected to bring in $21.8 billion in 2023", "url": "https://www.cnbc.com/2020/04/24/sports-ticketing-will-look-different-as-teams-get-creative-without-fans.html", "urlToImage": null, "publishedAt": "2020-04-24T15:54:42Z", "content": "The seats are empty at the Amway Center in Orlando, home of the NBAs Orlando Magic, on Thursday, March 12, 2020. The NBA has suspended the season due to the coronavirus -- as have other sports.\r\nThere is a bubble on the verge of bursting throughout sports lea… [+10121 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Chiefs add to explosive offense with RB Clyde Edwards-Helaire | Pro Football Talk | NBC Sports - NBC Sports", "description": "RB Clyde Edwards-Helaire was selected by the Kansas City Chiefs with the last pick of the first round, adding to its already dynamic offense with Patrick Mah...", "url": "https://www.youtube.com/watch?v=7rAPMwlXk3Q", "urlToImage": null, "publishedAt": "2020-04-24T15:54:22Z", "content": "RB Clyde Edwards-Helaire was selected by the Kansas City Chiefs with the last pick of the first round, adding to its already dynamic offense with Patrick Mahomes and company. #NBCSports#ProFootballTalk#NFL» Subscribe to NBC Sports: https://www.youtube.com/nbc… [+1286 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "PFT's 2020 NFL Draft superlatives | Pro Football Talk | NBC Sports - NBC Sports", "description": "Mike Florio and Chris Simms hand out superlatives from the 2020 NFL Draft. #NBCSports #ProFootballTalk #NFL » Subscribe to NBC Sports: https://www.youtube.co...", "url": "https://www.youtube.com/watch?v=C0DomvlB-MM", "urlToImage": null, "publishedAt": "2020-04-24T15:40:39Z", "content": null}, {"source": {"id": null, "name": "Panthers.com"}, "author": null, "title": "DT Derrick Brown, first round pick in NFL Draft, Panthers pick graded - Panthers.com", "description": "Carolina's call to go with Brown at No. 7 is drawing praise from analysts around the league.", "url": "https://www.panthers.com/news/derrick-brown-defensive-tackle-grading-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-24T15:39:25Z", "content": "ERIC EDHOLM, YAHOO SPORTS\r\nWhen it comes to laying the groundwork of a new defense, there wasn't a better pick than Brown, as Edholm called the defensive tackle \"smart, safe, (and) foundational.\"\r\nEdholm's overall grade for the pick, a B+, was held back by Br… [+318 chars]"}, {"source": {"id": null, "name": "Silverandblackpride.com"}, "author": "Bill Williamson", "title": "Raiders NFL draft needs: Day 2 choices - Silver And Black Pride", "description": "Defense is top need for Las Vegas on Day 2 of NFL draft", "url": "https://www.silverandblackpride.com/2020/4/24/21234075/raiders-draft-remaining-needs-nfl-day-two", "urlToImage": null, "publishedAt": "2020-04-24T15:12:37Z", "content": "The Raiders went into the draft with receiver and cornerback being their biggest draft needs.\r\nThey addressed both positions in the first round in the form of speed players, receiver Henry Ruggs III of Alabama at No. 12 and cornerback Damon Arnette of Ohio St… [+914 chars]"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Daniel Marland", "title": "Mike Tyson Reveals He Is Training For A Surprise Return To Boxing - SPORTbible", "description": "'Iron Mike' is stepping back into the ring and boxing fans should be excited.", "url": "https://www.sportbible.com/boxing/boxing-news-legends-mike-tyson-reveals-he-is-training-for-surprise-return-to-boxing-20200424", "urlToImage": null, "publishedAt": "2020-04-24T15:09:27Z", "content": "Mike Tyson has revealed he is training for a sensational return to boxing and plans to take part in four round exhibition fights for charity.\r\n'Iron Mike' fell to defeat against Kevin McBride back in 2005 which proved to be the final professional fight of his… [+1694 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Henry Ruggs III: Las Vegas Raiders 12th overall pick | Career Highlights | CBS Sports - CBS Sports", "description": "With the 12th overall pick, the Las Vegas Raiders selected Henry Ruggs III in the 2020 NFL Draft. Re-live some of Ruggs' greatest moments from his career at ...", "url": "https://www.youtube.com/watch?v=PFWSPEXXEGs", "urlToImage": null, "publishedAt": "2020-04-24T13:08:48Z", "content": "With the 12th overall pick, the Las Vegas Raiders selected Henry Ruggs III in the 2020 NFL Draft. Re-live some of Ruggs' greatest moments from his career at Alabama.\r\nSUBSCRIBE TO OUR CHANNEL:https://www.youtube.com/user/CBSSports\r\nFOLLOW US ON:Facebook - htt… [+155 chars]"}, {"source": {"id": null, "name": "Milehighreport.com"}, "author": "Jeff Essary", "title": "2020 NFL Draft Profile: Boise State Tackle Ezra Cleveland - Mile High Report", "description": "Does the Boise State product go from one Broncos team to another?", "url": "https://www.milehighreport.com/2020/4/24/21234034/2020-nfl-draft-profile-ezra-cleveland", "urlToImage": null, "publishedAt": "2020-04-24T12:10:47Z", "content": "Ezra Cleveland is a durable and decorated left tackle out of Boise State. He has started 40 games at left tackle in his college career. Cleveland came in as a redshirt freshman and started every possible game in the freshman, sophomore, and junior year before… [+4027 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt, CNN", "title": "Hope Solo, former USWNT goalie, announces birth of twins - CNN", "description": "Former US goalkeeper Hope Solo and husband Jerramy Stevens have welcomed twins into the world, the soccer star announced on Thursday.", "url": "https://edition.cnn.com/2020/04/24/football/hope-solo-twins-intl-scli/index.html", "urlToImage": null, "publishedAt": "2020-04-24T09:45:38Z", "content": "(CNN)Former US goalkeeper Hope Solo and husband Jerramy Stevens have welcomed twins into the world, the soccer star announced on Thursday. \r\nFormer US Women's National Team goalkeeper and two-time Olympic gold medalist Solo announced the birth of her twins --… [+1149 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Sean Payton After Drafting Cesar Ruiz in 2020 NFL Draft | Saints Draft - New Orleans Saints", "description": "New Orleans Saints Head Coach Sean Payton talks to the media following day 1 of the 2020 NFL draft after the Saints selected Cesar Ruiz #24 overall with thei...", "url": "https://www.youtube.com/watch?v=zAJJfVl4fUA", "urlToImage": null, "publishedAt": "2020-04-24T05:59:21Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Minnesota Vikings add a DEPENDABLE CB with Jeff Gladney and the 31st pick | 2020 NFL Draft - CBS Sports", "description": "With the 31st pick in the 2020 NFL Draft, the Minnesota Vikings select Jeff Gladney, CB from TCU. Our CBS Sports HQ crew breaks down the selection, providing...", "url": "https://www.youtube.com/watch?v=MRqkLVGulnQ", "urlToImage": null, "publishedAt": "2020-04-24T04:28:46Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Instant Reaction: Dolphins protect Tua Tagovailoa, draft OT Austin Jackson at No. 18 | NBC Sports - NBC Sports", "description": "Peter King reacts after the Dolphins used their second first-round pick to protect Tua Tagovailoa and draft USC left tackle Austin Jackson at No. 18 overall....", "url": "https://www.youtube.com/watch?v=7jMg9qMWTjw", "urlToImage": null, "publishedAt": "2020-04-24T03:49:14Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Raiders select SPEEDSTER Henry Ruggs with the 12th overall pick | 2020 NFL Draft | CBS Sports HQ - CBS Sports", "description": "With the 12th pick in the 2020 NFL Draft, the Las Vegas Raiders select Henry Ruggs, wide receiver from Alabama. Our CBS Sports HQ crew breaks down the select...", "url": "https://www.youtube.com/watch?v=S9Bej0juDXA", "urlToImage": null, "publishedAt": "2020-04-24T02:16:50Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Instant Reaction: Arizona Cardinals take Isaiah Simmons at No. 8 | Pro Football Talk | NBC Sports - NBC Sports", "description": "Mike Florio breaks down what uber-versatile linebacker Isaiah Simmons brings to Arizona as the Cardinals draft the Clemson product at No. 8. #NBCSports #Isai...", "url": "https://www.youtube.com/watch?v=g7ia9hkYs38", "urlToImage": null, "publishedAt": "2020-04-24T02:14:41Z", "content": "Mike Florio breaks down what uber-versatile linebacker Isaiah Simmons brings to Arizona as the Cardinals draft the Clemson product at No. 8. #NBCSports#IsaiahSimmons#ArizonaCardinals» Subscribe to NBC Sports: https://www.youtube.com/nbcsports?sub...» Watch Li… [+1383 chars]"}, {"source": {"id": null, "name": "Today.com"}, "author": "Ronnie Koenig", "title": "Budweiser brings back 'whassup' commercial during coronavirus - TODAY", "description": "Former NBA stars and others unite for a reboot of the famous 'wassup' Budweiser commercial, this time with an emotional ending.", "url": "https://www.today.com/food/budweiser-brings-back-whassup-commercial-during-coronavirus-t179787", "urlToImage": null, "publishedAt": "2020-04-23T23:27:40Z", "content": "Budweiser just released a new version of its classic \"whassup\" commercial that's not only funny, but also serves as a genuinely touching public service announcement in the time of coronavirus.\r\nThe original commercial, which aired in 1999 featured a group of … [+2951 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Golf's versions of field goals - PGA TOUR", "description": "Almost like their NFL counterparts, check out these players thread the needle through some trees on course. SUBSCRIBE to PGA TOUR now: http://pgat.us/vBxcZSh...", "url": "https://www.youtube.com/watch?v=Y2QWsaAycQI", "urlToImage": null, "publishedAt": "2020-04-23T22:18:55Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Judge, Stanton, and Paxton updates from Aaron Boone and much more - YESNetwork", "description": "Yankees manager Aaron Boone on the status of Aaron Judge, Giancarlo Stanton, and James Paxton, as well as his thoughts on the punishment MLB handed the Red S...", "url": "https://www.youtube.com/watch?v=HgCi5qNcqc0", "urlToImage": null, "publishedAt": "2020-04-23T20:56:48Z", "content": "Yankees manager Aaron Boone on the status of Aaron Judge, Giancarlo Stanton, and James Paxton, as well as his thoughts on the punishment MLB handed the Red Sox and more. Subscribe for daily sports videos!\r\nYES' social media pages:TikTok: tiktok.com/@YESnetwor… [+130 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "History of the Premier League from 1992 to 2019 | NBC Sports - NBC Sports", "description": "Dive back into the Premier League's 27-season history, from its formation in 1992 through Manchester City's record-setting 2018-19 campaign. #NBCSports #Prem...", "url": "https://www.youtube.com/watch?v=E0i5JMdVHx8", "urlToImage": null, "publishedAt": "2020-04-23T20:00:08Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Burrow is going to Bengals no question, Tua could drop out of top 10 — Jay Glazer | NFL | THE HERD - The Herd with Colin Cowherd", "description": "Colin Cowherd is excited to talk the 2020 NFL Draft, and he brings on Jay Glazer to walk him through how he thinks things will play out tonight. First they t...", "url": "https://www.youtube.com/watch?v=k-rxcyENLIU", "urlToImage": null, "publishedAt": "2020-04-23T19:58:44Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "On This Day: Damian Lillard CALLS GAME To Win Series! - NBA", "description": "On this day in Damian Lillard hit the game-winning three to win the series over OKC! Subscribe to the NBA: https://on.nba.com/2JX5gSN Full Game Highlights Pl...", "url": "https://www.youtube.com/watch?v=rwXz64IXsKE", "urlToImage": null, "publishedAt": "2020-04-23T19:04:53Z", "content": "On this day in Damian Lillard hit the game-winning three to win the series over OKC!\r\nSubscribe to the NBA: https://on.nba.com/2JX5gSNFull Game Highlights Playlist: https://on.nba.com/2rjGMgeFor news, stories, highlights and more, go to our official website a… [+93 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Best of Rookies - Golden State Warriors", "description": "From behind-the-scenes moments to their hustle on the court, take a look back at some of the top moments from the Warriors' rookies.", "url": "https://www.youtube.com/watch?v=7Jilhn_-tw4", "urlToImage": null, "publishedAt": "2020-04-23T19:00:02Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "On This Day: Ronaldo's hat trick vs. Man United receives standing ovation (2003) | Champions League - ESPN UK", "description": "ESPN FC’s Alejandro Moreno and Sid Lowe take a nostalgic look back to 2003 when Brazilian Ronaldo scored a brilliant hat trick vs. Manchester United at Old T...", "url": "https://www.youtube.com/watch?v=i1ssR46tgQI", "urlToImage": null, "publishedAt": "2020-04-23T18:33:11Z", "content": null}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Scott Boeck", "title": "Hall of Fame broadcaster Vin Scully hospitalized after fall and is 'resting comfortably' - USA TODAY", "description": "Hall of Fame broadcaster Vin Scully, 92, was hospitalized after falling in his home on Tuesday. He is \"resting comfortably,\" the Dodgers tweeted.", "url": "https://www.usatoday.com/story/sports/mlb/dodgers/2020/04/23/vin-scully-hall-of-fame-dodgers-broadcaster-hospitalized/3012240001/", "urlToImage": null, "publishedAt": "2020-04-23T18:11:15Z", "content": "Rookie Charlie Culberson set up Scully with a two-out homer in the bottom of the 10th inning that lifted the Dodgers to a 4-3 victory and clinched the NL West division title.\r\nHall of Fame broadcaster Vin Scully was hospitalized after falling Tuesday in his S… [+1206 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How UEFA will determine qualification for 2020-21 events | ESPN FC - ESPN UK", "description": "ESPN FC’s Mark Ogden joins Mark Donaldson to give the latest on UEFA’s recent decision that qualification for next season's European competitions can only be...", "url": "https://www.youtube.com/watch?v=YJuEnt0pLgw", "urlToImage": null, "publishedAt": "2020-04-23T17:44:37Z", "content": "ESPN FCs Mark Ogden joins Mark Donaldson to give the latest on UEFAs recent decision that qualification for next season's European competitions can only be \"based on sporting merit in the 2019-20 domestic competitions.\" Ogden explains how this ruling will eff… [+337 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "'Great' Moments From Wayne Gretzky vs. Alexander Ovechkin NHL 20 Battle - SPORTSNET", "description": "Check out some of the key moments from The Great One taking on the Great 8 in an NHL 20 battle for charity. ---------------------------------------------- Su...", "url": "https://www.youtube.com/watch?v=9YLgv_BvkaY", "urlToImage": null, "publishedAt": "2020-04-23T16:36:25Z", "content": "Check out some of the key moments from The Great One taking on the Great 8 in an NHL 20 battle for charity.---------------------------------------------- \r\nSubscribe to Sportsnet on YouTube - http://sprtsnt.ca/2paAT2L\r\nVisit Sportsnet.ca for more sports news … [+315 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Gabe Lacques", "title": "Red Sox insist there's no 'victory laps' after soft MLB penalty: 'We have to earn back trust' - USA TODAY", "description": "The Boston Red Sox began the process of moving on from their own sign-stealing scandal after MLB issued minor penalties to team for 2018 misconduct.", "url": "https://www.usatoday.com/story/sports/mlb/columnist/gabe-lacques/2020/04/22/boston-red-sox-address-major-league-baseball-penalty/3009038001/", "urlToImage": null, "publishedAt": "2020-04-23T14:41:32Z", "content": "USA TODAY Sports' Gabe Lacques breaks down the penalties levied against participants of the MLB sign-stealing scandal.\r\nUSA TODAY\r\nToeing the line between palpable relief and giddy absolution, the Boston Red Sox began the process of moving on from their own s… [+6655 chars]"}, {"source": {"id": null, "name": "Bigblueview.com"}, "author": "Chris Pflum", "title": "2020 NFL Draft prospect profile: Tristan Wirfs, OT, Iowa - Big Blue View", "description": "Is Wirfs the tackle for the Giants?", "url": "https://www.bigblueview.com/2020/4/23/21231202/2020-nfl-draft-prospect-profile-tristan-wirfs-ot-iowa-scouting-report-ny-giants", "urlToImage": null, "publishedAt": "2020-04-23T12:09:01Z", "content": "Throughout the process leading up to the 2020 NFL Draft there have been two constants. The first is the focus upon the offensive tackle position for the Giants in the first round, and the second is that Iowas Tristan Wirfs has been one of the tackles under he… [+5086 chars]"}, {"source": {"id": null, "name": "Windycitygridiron.com"}, "author": "Ken Mitchell", "title": "Chicago Bears Latest News: April 23, 2020 - Windy City Gridiron", "description": "The 2020 NFL Draft opens today, and with the 19th overall pick, the Bears select Khalil Mack, Edge, Buffalo.", "url": "https://www.windycitygridiron.com/2020/4/23/21232027/chicago-bears-den-nagy-pace-offseason-free-agency-draft-covid-19-mocks-rumors-bass-round-one", "urlToImage": null, "publishedAt": "2020-04-23T10:10:38Z", "content": "THE DAILY SPONGIE SPECIAL \r\nThis week we are on to Bass Master... who knows, there are so many greats this may end up being a multi-week thing... todays Bass Master is John Entwistle...\r\nBEAR DOWN, CHICAGO BEARS, BEAR DOWN!!!!\r\nBEARRRSSSS\r\nWood: Where is the … [+8049 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Steve Kerr Joins Ernie Johnson On #NBATogether To Talk Bulls, Coaching & More! - NBA", "description": "#NBATogether with Ernie Johnson begins now with 8x NBA champion Steve Kerr. Subscribe to the NBA: https://on.nba.com/2JX5gSN Full Game Highlights Playlist: h...", "url": "https://www.youtube.com/watch?v=XwHgPB8tN6E", "urlToImage": null, "publishedAt": "2020-04-23T01:45:41Z", "content": null}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Steve Gardner", "title": "NHL looking at centralizing game sites when it's time to resume play - USA TODAY", "description": "The NHL is considering all options to finish its regular season, including a plan to play multiple games a day in centralized locations without fans.", "url": "https://www.usatoday.com/story/sports/nhl/2020/04/22/gary-bettman-nhl-return-four-arenas-multiple-games-per-day/3009155001/", "urlToImage": null, "publishedAt": "2020-04-23T01:36:36Z", "content": "SportsPulse: Sports plays a vital role in our day-to-day lives as a means to escape. Mental health expert Eric Kussin says it's OK to feel depressed over the loss of sports in the wake of the coronavirus outbreak and provides steps you can take to address the… [+1678 chars]"}]}