{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Sun-sentinel.com"}, "author": "Dave Hyde", "title": "No running back for Dolphins? No worries for now - South Florida Sun Sentinel", "description": "The Miami Dolphins build up the lines and the secondary through first three rounds of the NFL draft.", "url": "https://www.sun-sentinel.com/sports/dave-hyde/fl-sp-draft-hyde10-thoughts-20200425-pbufbdrydngrdpts6rj2d377sa-story.html", "urlToImage": null, "publishedAt": "2020-04-25T13:58:50Z", "content": null}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Cameron DaSilva", "title": "Grading the Rams' picks on Day 2 of 2020 NFL Draft - Rams Wire", "description": "The Rams redeemed themselves in Round 3 after a questionable start to the draft.", "url": "https://theramswire.usatoday.com/2020/04/25/nfl-draft-grades-rams-day-2-akers-jefferson-lewis-burgess/", "urlToImage": null, "publishedAt": "2020-04-25T13:58:07Z", "content": "Butch Dill-USA TODAY Sports\r\nThe Los Angeles Rams came into the 2020 NFL Draft with some pressing needs on the offensive line and at linebacker. They had four picks on Day 2, but only one of their top needs was addressed in the second and third rounds.\r\nThat … [+1246 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "'The Last Dance': Michael Jordan is still bullying Jerry Krause, who shielded the Bulls owner from any scorn - CBS Sports", "description": "In 'The Last Dance', the 10-part ESPN/Netflix documentary, the legendary Bulls executive takes yet another beating", "url": "https://www.cbssports.com/nba/news/the-last-dance-michael-jordan-is-still-bullying-jerry-krause-who-shielded-the-bulls-owner-from-any-scorn/", "urlToImage": null, "publishedAt": "2020-04-25T13:48:00Z", "content": "Jerry Krause was never cuddly. He was not a friend to the media, nor to his competition. Much like Michael Jordan, he was obsessive about his job to the point where his colleagues couldn't relate to him. The former Chicago Bulls general manager, who died in 2… [+4314 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "2020 NFL Draft Day 2 winners and losers: Packers make more head-scratching moves, Panthers load up on defense - CBS Sports", "description": "Matt Rhule is building a defense that should complement his offense for years to come", "url": "https://www.cbssports.com/nfl/news/2020-nfl-draft-day-2-winners-and-losers-packers-make-more-head-scratching-moves-panthers-load-up-on-defense/", "urlToImage": null, "publishedAt": "2020-04-25T13:41:46Z", "content": "Like Day 1, Day 2 of the 2020 NFL Draft saw several teams make very strong picks that should immediately pay dividends for the upcoming season. Conversely, several other teams made some head-scratching decisions that will surely come back to haunt them in the… [+9057 chars]"}, {"source": {"id": null, "name": "Nesn.com"}, "author": "https://nesn.com/doug-kyed/", "title": "What Did Patriots See In Dalton Keene To Make Unprecedented Draft Trade? - NESN", "description": "New England Patriots head coach Bill Belichick has never traded a future pick in the NFL Draft. He made an…", "url": "https://nesn.com/2020/04/what-did-patriots-see-in-dalton-keene-to-make-unprecedented-draft-trade/", "urlToImage": null, "publishedAt": "2020-04-25T13:26:32Z", "content": "New England Patriots head coach Bill Belichick has never traded a future pick in the NFL Draft. He made an exception for Dalton Keene on Friday night.\r\nThe Patriots traded two fourth-round picks and a future sixth to the New York Jets to move up to No. 101 ov… [+4138 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Tim Daniels", "title": "Jerry Jones Says Cowboys Had '1 Percent Chance' to Draft Trevon Diggs - Bleacher Report", "description": "Dallas Cowboys owner Jerry Jones said the team's research showed there was almost no chance Alabama cornerback Trevon Diggs would be available with the 51st overall pick...", "url": "https://bleacherreport.com/articles/2888610-jerry-jones-says-cowboys-had-1-percent-chance-to-draft-trevon-diggs", "urlToImage": null, "publishedAt": "2020-04-25T13:23:42Z", "content": "Richard Shiro/Associated Press\r\nDallas Cowboys owner Jerry Jones said the team's research showed there was almost no chance Alabama cornerback Trevon Diggs would be available with the 51st overall pick.\r\n\"We have well-done, in-depth studies and charts that we… [+1394 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "John Keim, Courtney Cronin", "title": "Redskins OT Trent Williams denies nixing potential trade to Vikings - ESPN", "description": "Trent Williams told ESPN that he did not strike down a potential trade to the Vikings, though sources confirmed that the potential trade partners were informed at some point Friday that the Redskins offensive tackle did not want to play in Minnesota.", "url": "https://www.espn.com/nfl/story/_/id/29097412/redskins-ot-trent-williams-denies-nixing-potential-trade-vikings", "urlToImage": null, "publishedAt": "2020-04-25T13:07:07Z", "content": "Washington Redskins offensive tackle Trent Williams is denying that he struck down a potential trade to the Vikings because he didn't want to play in Minnesota, he told ESPN on Saturday.\r\n\"No, that's not true,\" Williams said.\r\nHowever, sources confirmed to ES… [+4047 chars]"}, {"source": {"id": null, "name": "Kentuckysportsradio.com"}, "author": null, "title": "WATCH: The Moment Jon Gruden told Lynn Bowden he was going to be a Raider - kentuckysportsradio.com", "description": "The former Kentucky Wildcat could hardly speak.", "url": "https://kentuckysportsradio.com/football-2/watch-the-moment-jon-gruden-told-lynn-bowden-he-was-going-to-be-a-raider/", "urlToImage": null, "publishedAt": "2020-04-25T13:00:00Z", "content": "Skip to content\r\nThis is the moment Lynn Bowden’s life changed forever.\r\nLate Friday night he received a call from Jon Gruden. The head coach of the Las Vegas Raiders was excited to tell Bowden they would be selecting him with the 80th pick in the 2020 NFL Dr… [+1539 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Josh Alper", "title": "Brian Gutekunst on Day Two picks: Matt LaFleur wants to tie everything to run game - NBCSports.com", "description": "The Packers raised some eyebrows and the ire of some of their fans in the first round of the draft when they picked quarterback Jordan Love rather than a player who would be in line to help them in 2020 and their second day picks drew some similar reactions. …", "url": "https://profootballtalk.nbcsports.com/2020/04/25/brian-gutekunst-on-day-two-picks-matt-lafleur-wants-to-tie-everything-to-run-game/", "urlToImage": null, "publishedAt": "2020-04-25T12:46:00Z", "content": "I normally sit back and recognize that the personnel guys have forgotten more than I will ever know. That is still the case. However, from a strategy &amp; confidence angle, this draft is a failure. \r\nJohn Elway is giving Drew Lock weapons galore. Brian Gutek… [+575 chars]"}, {"source": {"id": null, "name": "Nesn.com"}, "author": "https://nesn.com/zack-cox/", "title": "Patriots Could Target These QBs, Receivers On Day 3 Of NFL Draft - NESN", "description": "We're through two days of the 2020 NFL Draft, and the New England Patriots have yet to address two of…", "url": "https://nesn.com/2020/04/patriots-could-target-these-qbs-receivers-on-day-3-of-nfl-draft/", "urlToImage": null, "publishedAt": "2020-04-25T12:08:17Z", "content": "We’re through two days of the 2020 NFL Draft, and the New England Patriots have yet to address two of their highest-profile roster needs:\r\nQuarterback and wide receiver.\r\nSpeaking early Saturday morning after Round 3 concluded, director of player personnel Ni… [+2487 chars]"}, {"source": {"id": null, "name": "Behindthesteelcurtain.com"}, "author": "Shannon White", "title": "2020 NFL Draft: Grading Steelers selection of OLB Alex Highsmith - Behind the Steel Curtain", "description": "The Pittsburgh Steelers select Edge Alex Highsmith with the 102nd selection of the 2020 NFL Draft.", "url": "https://www.behindthesteelcurtain.com/2020/4/25/21235633/2020-nfl-draft-grading-pittsburgh-steelers-selection-of-olb-alex-highsmith-charlotte-round-3-news", "urlToImage": null, "publishedAt": "2020-04-25T11:56:56Z", "content": "The Pittsburgh Steelers looked to further improve their already impressive defense by selecting Charlotte 49ers Edge Alex Highsmith with the 102nd pick of the 2020 NFL Draft. A former walk on who became a standout performer through hard work and perseverance,… [+3517 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Paul Schwartz", "title": "Giants could snag a center on Day 3 of NFL Draft - New York Post ", "description": "Having addressed needs on the offensive line in the first round of the 2020 NFL Draft and the defensive backfield in the second round, the Giants doubled up with another offensive tackle in the thi…", "url": "https://nypost.com/2020/04/25/giants-could-snag-a-center-on-day-3-of-nfl-draft/", "urlToImage": null, "publishedAt": "2020-04-25T11:34:48Z", "content": "Having addressed needs on the offensive line in the first round of the 2020 NFL Draft and the defensive backfield in the second round, the Giants doubled up with another offensive tackle in the third round.\r\nThis leaves the question: Who is going to snap the … [+693 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Rickie Fowler's most aggressive shots on the PGA TOUR - PGA TOUR", "description": "Rickie Fowler isn't afraid of taking chances on the golf course, watch how some of his most agressive shots on the PGA TOUR paid off. SUBSCRIBE to PGA TOUR n...", "url": "https://www.youtube.com/watch?v=0ZvotPKSoEo", "urlToImage": null, "publishedAt": "2020-04-25T11:30:01Z", "content": null}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Brian Costello", "title": "Jets could grab another receiver on Day 3 of NFL Draft - New York Post ", "description": "The Jets have six remaining picks entering Saturday Day 3 of the 2020 NFL Draft and Joe Douglas needs to add some depth to his team. Douglas can stay true to his draft board and find players to fil…", "url": "https://nypost.com/2020/04/25/jets-could-grab-another-receiver-in-day-3-of-nfl-draft/", "urlToImage": null, "publishedAt": "2020-04-25T11:05:38Z", "content": "The Jets have six remaining picks entering Saturday Day 3 of the 2020 NFL Draft and Joe Douglas needs to add some depth to his team. \r\nDouglas can stay true to his draft board and find players to fill holes for the Jets because they have so many of them. The … [+449 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Josh Keatley", "title": "2020 Browns draft grades roundup after Day 2 selections - Browns Wire", "description": "The Cleveland Browns have selected three more players on day two of the 2020 NFL Draft and they went straight defense after addressing their offensive tackle in round one. The draft was largely cha…", "url": "https://brownswire.usatoday.com/2020/04/25/2020-browns-draft-grades-roundup-after-day-2-selections/", "urlToImage": null, "publishedAt": "2020-04-25T10:36:02Z", "content": "The Cleveland Browns have selected three more players on day two of the 2020 NFL Draft and they went straight defense after addressing their offensive tackle in round one. The draft was largely chalk for Cleveland, with most Day 2 selections following their n… [+2146 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Ryan Gaydos", "title": "Eagles turn heads with Jalen Hurts selection, GM says quarterback was best on board - Fox News", "description": "The Philadelphia Eagles raised eyebrows Friday night when they selected quarterback Jalen Hurts in the second round of the 2020 NFL Draft.", "url": "https://www.foxnews.com/sports/eagles-turn-heads-with-jalen-hurts-selection-gm-says-quarterback-was-best-on-board", "urlToImage": null, "publishedAt": "2020-04-25T10:27:29Z", "content": "The Philadelphia Eagles raised eyebrows Friday night when they selected quarterback Jalen Hurts in the second round of the 2020 NFL Draft.\r\nHurts is presumably set to be the backup for quarterback Carson Wentz. However, Wentz is coming off a season where he p… [+1462 chars]"}, {"source": {"id": null, "name": "Freep.com"}, "author": "Dave Birkett", "title": "Detroit Lions eyeing WR help on Day 3 of 2020 NFL draft: 10 players to watch - Detroit Free Press", "description": "Detroit Lions have four picks on Day 3 of the 2020 NFL draft Saturday, including the No. 109 overall selection early in Round 4", "url": "https://www.freep.com/story/sports/nfl/lions/2020/04/25/detroit-lions-nfl-draft-day-3-targets/3019249001/", "urlToImage": null, "publishedAt": "2020-04-25T10:22:00Z", "content": "A look at who the Detroit Lions picked in Rounds 2-3 of the 2020 NFL draft on Friday, April 24, 2020.\r\nDetroit Free Press\r\nSeventeen wide receivers have been taken in the first three rounds of the 2020 NFL draft, and the class is so deep that 17 more could co… [+4192 chars]"}, {"source": {"id": null, "name": "Yardbarker.com"}, "author": "Erin Walsh", "title": "NFL teams reportedly not happy about Tom Brady's interactions with Bucs staff - msnNOW", "description": "Tom Brady has been enjoying himself since joining the Tampa Bay Buccaneers, and that's included walking into the wrong house and apparently trespassing in a park.  The new Bucs quarterback has been in close contact with various members of the Tampa Bay staff,…", "url": "https://www.yardbarker.com/nfl/articles/nfl_teams_reportedly_not_happy_about_tom_bradys_interactions_with_bucs_staff/s1_13132_31846868", "urlToImage": null, "publishedAt": "2020-04-25T10:05:00Z", "content": "This makes sense. Why should Brady be able to blatantly disregard social distancing protocols and get an advantage by meeting with members of the Buccaneers staff?\r\nIf he and/or the Bucs organization receives any punishment for this, it likely won't be anythi… [+364 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Dave Sturchio", "title": "2020 NFL Draft: 29 Prospects remain on Cowboys interest list for Day 3 - Cowboys Wire", "description": "With three rounds in the books of the 2020 NFL Draft, the Dallas Cowboys have come out of it walking tall. Dallas made its biggest splash in Round 1 with the selection of premier Oklahoma wide rece…", "url": "https://cowboyswire.usatoday.com/2020/04/25/dallas-cowboys-pre-draft-visit-2020-nfl-draft-remaining-prospects-day-3-round-4567/", "urlToImage": null, "publishedAt": "2020-04-25T09:43:40Z", "content": "With three rounds in the books of the 2020 NFL Draft, the Dallas Cowboys have come out of it walking tall. Dallas made its biggest splash in Round 1 with the selection of premier Oklahoma wide receiver Cee Dee Lamb. In Round 2 the Cowboys addressed a big need… [+1923 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "https://twitter.com/Ali_Thanawalla", "title": "49ers' Aiyuk reminds Whitner of former Pro Bowl Seahawks WR - NBCSports.com", "description": "Everyone has a different comp for Brandon Aiyuk.", "url": "https://www.nbcsports.com/bayarea/49ers/49ers-draft-pick-brandon-aiyuk-reminds-donte-whitner-doug-baldwin", "urlToImage": null, "publishedAt": "2020-04-25T07:24:51Z", "content": "The wait continues for the 49ers.\r\nGeneral manager John Lynch and coach Kyle Shanahan got no TV time in their home offices on Friday as the NFL buzzed through the second and third rounds of the draft.\r\nThe 49ers are not scheduled to leap into action until the… [+4087 chars]"}, {"source": {"id": null, "name": "Seahawks.com"}, "author": null, "title": "Day 2 Of The Seahawks' 2020 NFL Draft: “These Are The Kind Of Guys That You Want To Build A Team With” - Seahawks.com", "description": "Pete Carroll & John Schneider discuss Day 2 of the Seahawks’ 2020 NFL Draft.", "url": "https://www.seahawks.com/news/day-2-of-the-seahawks-2020-nfl-draft-these-are-the-kind-of-guys-that-you-want-to", "urlToImage": null, "publishedAt": "2020-04-25T07:21:02Z", "content": "\"He was in consideration last night,\" Seahawks general manager John Schneider said. \"Our guys did a great job of working their tails off trying to keep getting up to try to acquire him, and it was pretty hot. We view him as one of the very, very top pass rush… [+2488 chars]"}, {"source": {"id": null, "name": "Milehighreport.com"}, "author": "Scotty Payne", "title": "Why wide receiver K.J. Hamler was drafted by the Denver Broncos - Mile High Report", "description": "Here is why K.J. Hamler was drafted by the Denver Broncos in the second round of the 2020 NFL Draft.", "url": "https://www.milehighreport.com/2020/4/25/21235813/why-wide-receiver-k-j-hamler-was-drafted-in-the-second-round-by-the-broncos", "urlToImage": null, "publishedAt": "2020-04-25T06:39:26Z", "content": "Despite selecting Alabamas Jerry Jeudy with their 15th overall selection in the first-round of the 2020 NFL Draft, the Broncos addressed the wide receiver position in the second-round. With their 46th overall selection in the second-round of the 2020 NFL Draf… [+2421 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Ryan Pace on drafting Kmet, Johnson | Chicago Bears - Chicago Bears", "description": "General manager Ryan Pace meets with the media following the second round selections of tight end Cole Kmet and defensive back Jaylon Johnin in the 2020 NFL ...", "url": "https://www.youtube.com/watch?v=CBkUSm28AXo", "urlToImage": null, "publishedAt": "2020-04-25T05:41:42Z", "content": null}, {"source": {"id": null, "name": "Espn.com"}, "author": "Sarah Barshop", "title": "Texans' Bill O'Brien 'just messing around' by walking off NFL draft broadcast - ESPN", "description": "Houston Texans coach Bill O'Brien said he was \"just messing around on the Zoom\" when he was shown walking off the NFL draft broadcast after making the 90th pick on Friday night.", "url": "https://www.espn.com/nfl/story/_/id/29096743/texans-bill-obrien-just-messing-walking-draft-broadcast", "urlToImage": null, "publishedAt": "2020-04-25T05:25:23Z", "content": "HOUSTON -- After Bill O'Brien was shown walking off during Friday's broadcast after making the 90th pick in the 2020 NFL draft, the Houston Texans' coach and general manager downplayed the incident.\r\n\"We were messing on the Zoom, myself and [executive vice pr… [+1202 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Button takes an early look at Team Canada and Team USA if NHLers attend 2022 Olympics - TSN", "description": "With NHL players not attending the 2018 winter Olympics, we missed out on seeing Connor McDavid and Sidney Crosby team up on Team Canada. With that in mind, ...", "url": "https://www.youtube.com/watch?v=Tj4sN2_zFXg", "urlToImage": null, "publishedAt": "2020-04-25T04:32:17Z", "content": "With NHL players not attending the 2018 winter Olympics, we missed out on seeing Connor McDavid and Sidney Crosby team up on Team Canada. With that in mind, Craig Button joins Gino Reda to look ahead to the 2022 Olympics and what a few of the teams could look… [+30 chars]"}, {"source": {"id": null, "name": "Palmbeachpost.com"}, "author": "Joe Schad", "title": "Schad: Miami Dolphins add much-needed trench bullies - Palm Beach Post", "description": "NFL Draft 2020: Dolphins add to offensive, defensive lines in second", "url": "https://www.palmbeachpost.com/article/20200425/SPORTS/200428792", "urlToImage": null, "publishedAt": "2020-04-25T04:13:01Z", "content": "NFL Draft 2020: Dolphins add to offensive, defensive lines in second\r\nQuarterbacks are pretty and a running back would have been nice, but the Dolphins aren’t moving forward as a franchise any time soon until they can start moving men forward on the lines of … [+4870 chars]"}, {"source": {"id": null, "name": "Syracuse.com"}, "author": "Matt Parrino | mparrino@nyup.com", "title": "7 thoughts and a grade on Buffalo Bills drafting Iowa DE A.J. Epenesa - syracuse.com", "description": "Epenesa went at pick No. 16 in ESPN's Mel Kiper's first mock draft in January.", "url": "https://www.syracuse.com/buffalo-bills/2020/04/7-thoughts-and-a-grade-on-buffalo-bills-drafting-iowa-de-aj-epenesa.html", "urlToImage": null, "publishedAt": "2020-04-25T02:58:11Z", "content": "When the first round of the 2020 NFL Draft concluded on Thursday night, Buffalo Bills fans started combing through the list of players still left on the board.\r\nThe Bills didnt have a first-round pick after trading it in a deal for receiver Stefon Diggs last … [+7503 chars]"}, {"source": {"id": null, "name": "Sun-sentinel.com"}, "author": "Omar Kelly", "title": "Dolphins add Alabama’s Raekwon Davis, a massive defensive tackle, in second round of NFL draft - South Florida - South Florida Sun Sentinel", "description": "The Miami Dolphins added Alabama defensive tackle Raekwon Davis in the second round of the 2020 NFL draft. He'll likely compete with Christian Wilkins and Davon Godchaux for playing time, if not a starting spot.", "url": "https://www.sun-sentinel.com/sports/miami-dolphins/fl-sp-draft-dolphins-sidebar-friday-20200425-667gkvmslrcxnltm7ppisxbjlu-story.html", "urlToImage": null, "publishedAt": "2020-04-25T02:50:38Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Will NHL hockey return this season? | HC@Home - SPORTSNET", "description": "David Amber is joined by Brendan Gallagher and Kevin Bieksa to discuss dad fights, TikTok videos & Dennis Rodman….. plus the state of league amid Covid-19. -...", "url": "https://www.youtube.com/watch?v=6YZpwdpKdec", "urlToImage": null, "publishedAt": "2020-04-25T02:50:15Z", "content": null}, {"source": {"id": null, "name": "Espn.com"}, "author": "Jamison Hensley", "title": "Ravens take Buckeyes' J.K. Dobbins in NFL draft on heels of record rushing season - ESPN", "description": "After setting the NFL's single-season rushing record in 2019, the Ravens used a second-round pick on Ohio State running back J.K. Dobbins.", "url": "https://www.espn.com/nfl/story/_/id/29096045/ravens-take-buckeyes-jk-dobbins-heels-record-rushing-season", "urlToImage": null, "publishedAt": "2020-04-25T01:45:53Z", "content": "OWINGS MILLS, Md. -- After setting the NFL's single-season rushing record in 2019, the Baltimore Ravens used a second-round pick in the 2020 NFL draft on Ohio State running back J.K. Dobbins.\r\nFor some, including Dobbins himself, it was a surprise that Baltim… [+2899 chars]"}, {"source": {"id": null, "name": "Panthers.com"}, "author": null, "title": "2020 NFL Draft: S Jeremy Chinn, Southern Illinois, Round 2, Pick 64 - Panthers.com", "description": "Carolina adds another defensive piece with its third pick of the 2020 NFL Draft after trading up to No. 64 overall.", "url": "https://www.panthers.com/news/jeremy-chinn-nfl-draft-safety-southern-illinois", "urlToImage": null, "publishedAt": "2020-04-25T01:44:18Z", "content": "Chinn was a kind of wild card in the Salukis' scheme, a tremendous athlete who played both safety and cornerback. He was a two-time first-team All-Missouri Valley Football Conference honoree and was a consensus All-American in 2019.\r\nWith the Panthers, Chinn … [+1009 chars]"}, {"source": {"id": null, "name": "Musiccitymiracles.com"}, "author": "Terry A. Lambert", "title": "2020 NFL Draft: Titans take LSU CB Kristian Fulton in second round - Music City Miracles", "description": "A big need filled.", "url": "https://www.musiccitymiracles.com/2020/4/24/21231489/2020-nfl-draft-titans-take-lsu-cornerback-kristian-fulton-with-second-round-pick", "urlToImage": null, "publishedAt": "2020-04-25T01:24:11Z", "content": "The Tennessee Titans have selected LSU cornerback Kristian Fulton with the 61st pick in the 2020 NFL Draft. With Logan Ryan remaining unsigned, cornerback was a clear need for Jon Robinson. \r\nFulton checks in at 6-0, 197 pounds. As a senior, Fulton started 15… [+921 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Buccaneers select a HIGHLY SKILLED Antoine Winfield Jr. with the 45th pick | 2020 NFL Draft - CBS Sports", "description": "With the 45th pick in the 2020 NFL Draft, the Tampa Bay Buccaneers select Antoine WInfield Jr., S from Minnesota. Our CBS Sports HQ crew breaks down the sele...", "url": "https://www.youtube.com/watch?v=SkLs_JcBIYI", "urlToImage": null, "publishedAt": "2020-04-25T00:51:33Z", "content": "With the 45th pick in the 2020 NFL Draft, the Tampa Bay Buccaneers select Antoine WInfield Jr., S from Minnesota.\r\nOur CBS Sports HQ crew breaks down the selection, providing a grade for the team and what potential impact Winfield Jr. might have for the Bucca… [+262 chars]"}, {"source": {"id": null, "name": "Mmamania.com"}, "author": "Dan Hiergesell", "title": "Report: Joe Rogan expected to commentate UFC 249 after all - MMA Mania", "description": "UFC color commentator Joe Rogan is expected to be in his usual seat for UFC 249 on May 9 in Jacksonville.", "url": "https://www.mmamania.com/2020/4/24/21235035/report-joe-rogan-expected-to-commentate-ufc-249-after-all-espn-mma-ferguson-gaethje-may-9-florida", "urlToImage": null, "publishedAt": "2020-04-25T00:30:18Z", "content": null}, {"source": {"id": null, "name": "Detroitlions.com"}, "author": null, "title": "Lions draft running back D'Andre Swift - detroitlions.com", "description": "With the 35th overall pick, the Detroit Lions select running back D'Andre Swift.", "url": "https://www.detroitlions.com/news/detroit-lions-draft-running-back-d-andre-swift", "urlToImage": null, "publishedAt": "2020-04-24T23:43:59Z", "content": "The Lions addressed their defense with the third overall pick Thursday night in the first round of the 2020 NFL Draft. With the third pick in the second round Friday night, Lions general manager Bob Quinn turned to the offense with the selection of Georgia ru… [+625 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NFL Draft 2020: Chris Simms' Top 5 First Round Picks | Chris Simms Unbuttoned | NBC Sports - NBC Sports", "description": "Chris Simms shares his favorite picks from round one of the 2020 NFL Draft. #NBCSports #ChrisSimmsUnbuttoned #NFLDraft2020 » Subscribe to NBC Sports: https:/...", "url": "https://www.youtube.com/watch?v=FAeUezXIQZ8", "urlToImage": null, "publishedAt": "2020-04-24T23:05:46Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "UFC Announces 3 Cards Set for May in Jacksonville Reaction - MMA Fighting - MMAFightingonSBN", "description": "UFC president Dana White announced on Friday that the promotion would return with a trio of cards set for May 9, May 13 and May 16 with all three shows takin...", "url": "https://www.youtube.com/watch?v=RmaWCqA24CQ", "urlToImage": null, "publishedAt": "2020-04-24T22:55:15Z", "content": "UFC president Dana White announced on Friday that the promotion would return with a trio of cards set for May 9, May 13 and May 16 with all three shows taking place in Jacksonville, Fla. Now MMA Fighting's Mike Heck and Jose Youngs react to the news as the UF… [+554 chars]"}, {"source": {"id": null, "name": "Blazersedge.com"}, "author": "Dave Deckard", "title": "Trail Blazers Top 100: The Pick that Wasn’t Meant to Be - Blazer's Edge", "description": "A look at the 100 players and personnel who have influenced the Trail Blazers’ 50-year history.", "url": "https://www.blazersedge.com/2020/4/24/21233500/trail-blazers-all-time-top-players-list-countdown-sam-bowie-36", "urlToImage": null, "publishedAt": "2020-04-24T22:17:19Z", "content": "The Trail Blazers 50-year anniversary season is temporarily on pause as the NBA goes on hiatus to slow the spread of COVID-19. During that break, Blazers Edge is counting down the top 100 Blazers: players, executives, and other influencers who made the franch… [+5286 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Gary Neville warns people are getting \"carried away\" with Man Utd target Jadon Sancho - Mirror Online", "description": "Man Utd legend Gary Neville has put Jadon Sancho's quality into context compared to some of the world's best players", "url": "https://www.mirror.co.uk/sport/football/news/gary-neville-warns-people-getting-21923589", "urlToImage": null, "publishedAt": "2020-04-24T21:41:45Z", "content": "Gary Neville claims Manchester United target Jadon Sancho is \"nowhere near\" some of the world's elite.\r\nThe Red Devils have been linked with the Borussia Dortmund star who is likely to cost around £100m.\r\nMuch is made of the Englishman's exploits in the Bunde… [+1834 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Jared Dudley Talks Lakers Playoffs, His Future In L.A., Kyle Kuzma's Growth, Dwight Howard Returning - Lakers Nation", "description": "Los Angeles Lakers ✔️ Help us continue to provide Lakers coverage and SUBSCRIBE: https://goo.gl/5AXSud ✔️ Our MOST POPULAR Videos: https://goo.gl/k4Xvqq Lake...", "url": "https://www.youtube.com/watch?v=bdgNVx2wf5Y", "urlToImage": null, "publishedAt": "2020-04-24T21:09:47Z", "content": "Los Angeles Lakers\r\nHelp us continue to provide Lakers coverage and SUBSCRIBE: https://goo.gl/5AXSud\r\nOur MOST POPULAR Videos: https://goo.gl/k4Xvqq\r\nLakersNation.com on Social Media:\r\nLike on Facebook: https://goo.gl/EQ4uiG\r\nFollow us on Twitter: https://goo… [+165 chars]"}, {"source": {"id": null, "name": "Hogshaven.com"}, "author": "Scott Jennings", "title": "2020 Redskins Day 2 Mock Draft Roundup: Who is Washington’s next pick? - Hogs Haven", "description": "Day 1 of the NFL draft is over and the Redskins have selected Ohio State DE Chase Young with the #2 pick. Washington rejected trade offers that obviously weren’t enough to get them to pass on the...", "url": "https://www.hogshaven.com/2020/4/24/21234969/2020-redskins-day-2-mock-draft-roundup-who-is-washingtons-next-pick", "urlToImage": null, "publishedAt": "2020-04-24T20:21:08Z", "content": "Day 1 of the NFL draft is over and the Redskins have selected Ohio State DE Chase Young with the #2 pick. Washington rejected trade offers that obviously werent enough to get them to pass on the best player in the draft. The Redskins still have 6 draft picks,… [+3891 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Justin Herbert compares his game to Matt Ryan, talks Draft, Chargers, Oregon & more | NFL | THE HERD - The Herd with Colin Cowherd", "description": "Justin Herbert joins Colin Cowherd to discuss football. Hear his account of draft night, who he compares his game to, his time at Oregon as well as what he l...", "url": "https://www.youtube.com/watch?v=zbpy00fDA1k", "urlToImage": null, "publishedAt": "2020-04-24T20:02:14Z", "content": "Justin Herbert joins Colin Cowherd to discuss football. Hear his account of draft night, who he compares his game to, his time at Oregon as well as what he looks forward to joining the Los Angeles Chargers.\r\n#TheHerd#NFL#JustinHerbert#MattRyan#Chargers#NFLDra… [+1275 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Kathleen Elkins", "title": "NFL player has some blunt money advice for rookies: 'Do not live a lavish lifestyle' - CNBC", "description": "Joe Burrow and the other top NFL draft picks will make millions. Current player Byron Jones took to Twitter to offer his best money advice for the incoming rookies.", "url": "https://www.cnbc.com/2020/04/24/nfl-player-gives-his-best-money-advice-to-rookies.html", "urlToImage": null, "publishedAt": "2020-04-24T19:55:16Z", "content": "The 2020 NFL draft took place virtually on Thursday night. The Cincinnati Bengals selected former LSU standout Joe Burrow with the first pick. The 23-year-old quarterback, who is among a select few to have won the Heisman Trophy and a national championship in… [+1811 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Brad Keselowski breakdown: Winning moves, key decisions in first victory | Talladega Superspeedway - NASCAR", "description": "Brad Keselowski's first NASCAR Cup Series win was memorable for its thrilling, controversial conclusion. The Team Penske driver sits down to analyze and expl...", "url": "https://www.youtube.com/watch?v=8EYwW6uV6s0", "urlToImage": null, "publishedAt": "2020-04-24T19:11:42Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Greg Brown Is a TEXAS Commit! — Official Mixtape - Bleacher Report", "description": "Greg Brown can jump out of the gym! The power forward is heading to Texas and will be catching bodies all season in the Big 12 Conference. Subscribe: https:/...", "url": "https://www.youtube.com/watch?v=vzeZOf4cJu8", "urlToImage": null, "publishedAt": "2020-04-24T19:05:25Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Best Of Michael Jordan 1984 USAB Exhibitions | The Jordan Vault - NBA", "description": "Throwback to the BEST OF MJ during USAB exhibitions in 1984! Subscribe to the NBA: https://on.nba.com/2JX5gSN Full Game Highlights Playlist: https://on.nba.c...", "url": "https://www.youtube.com/watch?v=ZsTorZgOBIk", "urlToImage": null, "publishedAt": "2020-04-24T19:00:13Z", "content": "Throwback to the BEST OF MJ during USAB exhibitions in 1984!\r\nSubscribe to the NBA: https://on.nba.com/2JX5gSN\r\nFull Game Highlights Playlist: https://on.nba.com/2rjGMge\r\nFor news, stories, highlights and more, go to our official website at https://nba_webonl… [+75 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NFL Draft 2020: Bruce Arians, Bucs get protection for Tom Brady (FULL INTERVIEW) | NBC Sports - NBC Sports", "description": "Buccaneers head coach Bruce Arians joins Mike Tirico to discuss his team's decision on drafting Tristian Wirfs and what it means with the additions of Tom Br...", "url": "https://www.youtube.com/watch?v=Ni9fbdLtEnY", "urlToImage": null, "publishedAt": "2020-04-24T18:15:36Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Andersen reveals the best and worst part about isolating with Matthews - TSN", "description": "Maple Leafs goaltender Frederik Andersen joins James Duthie to talk about what isolation has been like with Auston Matthews down in Arizona. He also touches ...", "url": "https://www.youtube.com/watch?v=YMidEz7ODJo", "urlToImage": null, "publishedAt": "2020-04-24T17:30:31Z", "content": null}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Dak Prescott's Brother, Jace, Dead At 31 - TMZ", "description": "Tragic news for the Dallas Cowboys QB and his family.", "url": "https://www.tmz.com/2020/04/24/nfls-dak-prescott-s-brother-dead-at-31-cause-of-death-unknown/", "urlToImage": null, "publishedAt": "2020-04-24T17:23:20Z", "content": "Tragic news for Dak Prescottand his family ... the quarterback's older brother, Jace Prescott, died suddenly at 31 years old on Thursday, the Dallas Cowboys announced.\r\nNo cause of death was given.\r\nDak had been super close with Jace, the oldest of the Presco… [+1131 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Brooks Koepka Gets Quarantine Haircut From Model GF, 'It Did Not Go Well' - TMZ", "description": "\"It did not go well.\" That's how Brooks Koepka's model GF described the way she cut the PGA Tour star's hair during quarantine.", "url": "https://www.tmz.com/2020/04/23/brooks-keopka-pga-tour-jena-sims-quarantine-haircut/", "urlToImage": null, "publishedAt": "2020-04-24T17:22:17Z", "content": "\"It did not go well.\"\r\nThat's how Brooks Koepka's model GF described the way she cut the PGA Tour star's hair during quarantine ... and we gotta say, we agree -- but the whole process was at least funny as hell!!\r\nThe golf stud was in desperate need of a trim… [+842 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Michael Middlehurst-Schwartz", "title": "NFL draft 2020's best available players in second round: Grant Delpit, Laviska Shenault among top options on board - USA TODAY", "description": "There's still plenty of first-round talent available for teams on Day 2 of the NFL draft, including several promising options at safety and receiver.", "url": "https://www.usatoday.com/story/sports/nfl/draft/2020/04/24/nfl-draft-second-round-best-players-available-2020/3020500001/", "urlToImage": null, "publishedAt": "2020-04-24T17:10:28Z", "content": "SportsPulse: The first night of the NFL's virtual draft went off without a hitch and Mackenzie Salmon is here to break down the nights biggest winners and losers.\r\nUSA TODAY\r\nThere's still first-round talent awaiting teams on Day 2 of the 2020 NFL draft.\r\nThu… [+5255 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Chelsea know Arsenal are vulnerable & have to move Pierre-Emerick Aubameyang soon - Ogden | ESPN FC - ESPN UK", "description": "ESPN FC's Mark Ogden reacts to reports that Chelsea are planning to make a move on Arsenal's Pierre-Emerick Aubameyang during the summer transfer window. Ogd...", "url": "https://www.youtube.com/watch?v=cwci7EzTV-4", "urlToImage": null, "publishedAt": "2020-04-24T17:01:45Z", "content": null}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Jabari Young", "title": "Sports teams mull how to cover refunds and lost ticketing revenue - CNBC", "description": "The suspension of live events due to Cvoid-19 is hurting a sector in the sports world that, according to a study was projected to bring in $21.8 billion in 2023", "url": "https://www.cnbc.com/2020/04/24/sports-ticketing-will-look-different-as-teams-get-creative-without-fans.html", "urlToImage": null, "publishedAt": "2020-04-24T15:54:42Z", "content": "The seats are empty at the Amway Center in Orlando, home of the NBAs Orlando Magic, on Thursday, March 12, 2020. The NBA has suspended the season due to the coronavirus -- as have other sports.\r\nThere is a bubble on the verge of bursting throughout sports lea… [+10121 chars]"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Daniel Marland", "title": "Mike Tyson Reveals He Is Training For A Surprise Return To Boxing - SPORTbible", "description": "'Iron Mike' is stepping back into the ring and boxing fans should be excited.", "url": "https://www.sportbible.com/boxing/boxing-news-legends-mike-tyson-reveals-he-is-training-for-surprise-return-to-boxing-20200424", "urlToImage": null, "publishedAt": "2020-04-24T15:09:27Z", "content": "Mike Tyson has revealed he is training for a sensational return to boxing and plans to take part in four round exhibition fights for charity.\r\n'Iron Mike' fell to defeat against Kevin McBride back in 2005 which proved to be the final professional fight of his… [+1694 chars]"}, {"source": {"id": null, "name": "News4jax.com"}, "author": "Justin Barney, Cole Pepper, Jamal St. Cyr", "title": "News4Jax draft reaction: Chaisson readies Jaguars for life without Yannick - WJXT News4JAX ", "description": "The Jaguars made LSU linebacker/defensive end K’Lavon Chaisson their draft pick at No. 20 in the opening round on Thursday night. The News4Jax sports staff offers its analysis on the selection.", "url": "https://www.news4jax.com/sports/2020/04/24/news4jax-draft-reaction-chaisson-readies-jaguars-for-life-without-yannick/", "urlToImage": null, "publishedAt": "2020-04-24T12:24:16Z", "content": "JACKSONVILLE, Fla. The Jaguars made LSU linebacker/defensive end KLavon Chaisson their draft pick at No. 20 in the opening round on Thursday night. The News4Jax sports staff offers its analysis on the selection.\r\nAnalysis on Florida cornerback CJ Henderson, J… [+1974 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt, CNN", "title": "Hope Solo, former USWNT goalie, announces birth of twins - CNN", "description": "Former US goalkeeper Hope Solo and husband Jerramy Stevens have welcomed twins into the world, the soccer star announced on Thursday.", "url": "https://edition.cnn.com/2020/04/24/football/hope-solo-twins-intl-scli/index.html", "urlToImage": null, "publishedAt": "2020-04-24T09:45:38Z", "content": "(CNN)Former US goalkeeper Hope Solo and husband Jerramy Stevens have welcomed twins into the world, the soccer star announced on Thursday. \r\nFormer US Women's National Team goalkeeper and two-time Olympic gold medalist Solo announced the birth of her twins --… [+1149 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Sean Payton After Drafting Cesar Ruiz in 2020 NFL Draft | Saints Draft - New Orleans Saints", "description": "New Orleans Saints Head Coach Sean Payton talks to the media following day 1 of the 2020 NFL draft after the Saints selected Cesar Ruiz #24 overall with thei...", "url": "https://www.youtube.com/watch?v=zAJJfVl4fUA", "urlToImage": null, "publishedAt": "2020-04-24T05:59:21Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Chiefs add to a CROWDED BACKFIELD with Clyde Edwards-Helaire | 2020 NFL Draft | CBS Sports HQ - CBS Sports", "description": "With the 32nd pick in the 2020 NFL Draft, the Kansas City Chiefs select Clyde Edwards-Helaire, running back from LSU. Our CBS Sports HQ crew breaks down the ...", "url": "https://www.youtube.com/watch?v=F1jur2ojU0U", "urlToImage": null, "publishedAt": "2020-04-24T04:30:37Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Minnesota Vikings add a DEPENDABLE CB with Jeff Gladney and the 31st pick | 2020 NFL Draft - CBS Sports", "description": "With the 31st pick in the 2020 NFL Draft, the Minnesota Vikings select Jeff Gladney, CB from TCU. Our CBS Sports HQ crew breaks down the selection, providing...", "url": "https://www.youtube.com/watch?v=MRqkLVGulnQ", "urlToImage": null, "publishedAt": "2020-04-24T04:28:46Z", "content": "With the 31st pick in the 2020 NFL Draft, the Minnesota Vikings select Jeff Gladney, CB from TCU.\r\nOur CBS Sports HQ crew breaks down the selection, providing a grade for the team and what potential impact (player last name) might have for the (team name).\r\nS… [+244 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Instant Reaction: Dolphins protect Tua Tagovailoa, draft OT Austin Jackson at No. 18 | NBC Sports - NBC Sports", "description": "Peter King reacts after the Dolphins used their second first-round pick to protect Tua Tagovailoa and draft USC left tackle Austin Jackson at No. 18 overall....", "url": "https://www.youtube.com/watch?v=7jMg9qMWTjw", "urlToImage": null, "publishedAt": "2020-04-24T03:49:14Z", "content": "Peter King reacts after the Dolphins used their second first-round pick to protect Tua Tagovailoa and draft USC left tackle Austin Jackson at No. 18 overall. #NBCSports#MiamiDolphins#AustinJackson» Subscribe to NBC Sports: https://www.youtube.com/nbcsports?su… [+1507 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Instant Reaction: Javon Kinlaw fills need for San Francisco 49ers | Pro Football Talk | NBC Sports - NBC Sports", "description": "Locking up Javon Kinlaw for five years at reasonable salary is a smart decision for San Francisco. #NBCSports #SanFrancisco49ers #JavonKinlaw » Subscribe to ...", "url": "https://www.youtube.com/watch?v=fNfaWwMZdLs", "urlToImage": null, "publishedAt": "2020-04-24T03:15:52Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Ray Lewis Drops in on Ravens Fan Zoom Hangout | Baltimore Ravens - Baltimore Ravens", "description": "Hall of Fame linebacker Ray Lewis talks to Ravens fans watching the draft, and says he hopes the Ravens better take linebacker Kenneth Murray. #BaltimoreRave...", "url": "https://www.youtube.com/watch?v=XZue-g19Rg0", "urlToImage": null, "publishedAt": "2020-04-24T01:48:19Z", "content": null}, {"source": {"id": null, "name": "Today.com"}, "author": "Ronnie Koenig", "title": "Budweiser brings back 'whassup' commercial during coronavirus - TODAY", "description": "Former NBA stars and others unite for a reboot of the famous 'wassup' Budweiser commercial, this time with an emotional ending.", "url": "https://www.today.com/food/budweiser-brings-back-whassup-commercial-during-coronavirus-t179787", "urlToImage": null, "publishedAt": "2020-04-23T23:27:40Z", "content": "Budweiser just released a new version of its classic \"whassup\" commercial that's not only funny, but also serves as a genuinely touching public service announcement in the time of coronavirus.\r\nThe original commercial, which aired in 1999 featured a group of … [+2951 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "History of the Premier League from 1992 to 2019 | NBC Sports - NBC Sports", "description": "Dive back into the Premier League's 27-season history, from its formation in 1992 through Manchester City's record-setting 2018-19 campaign. #NBCSports #Prem...", "url": "https://www.youtube.com/watch?v=E0i5JMdVHx8", "urlToImage": null, "publishedAt": "2020-04-23T20:00:08Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Burrow is going to Bengals no question, Tua could drop out of top 10 — Jay Glazer | NFL | THE HERD - The Herd with Colin Cowherd", "description": "Colin Cowherd is excited to talk the 2020 NFL Draft, and he brings on Jay Glazer to walk him through how he thinks things will play out tonight. First they t...", "url": "https://www.youtube.com/watch?v=k-rxcyENLIU", "urlToImage": null, "publishedAt": "2020-04-23T19:58:44Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Best of Rookies - Golden State Warriors", "description": "From behind-the-scenes moments to their hustle on the court, take a look back at some of the top moments from the Warriors' rookies.", "url": "https://www.youtube.com/watch?v=7Jilhn_-tw4", "urlToImage": null, "publishedAt": "2020-04-23T19:00:02Z", "content": null}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Scott Boeck", "title": "Hall of Fame broadcaster Vin Scully hospitalized after fall and is 'resting comfortably' - USA TODAY", "description": "Hall of Fame broadcaster Vin Scully, 92, was hospitalized after falling in his home on Tuesday. He is \"resting comfortably,\" the Dodgers tweeted.", "url": "https://www.usatoday.com/story/sports/mlb/dodgers/2020/04/23/vin-scully-hall-of-fame-dodgers-broadcaster-hospitalized/3012240001/", "urlToImage": null, "publishedAt": "2020-04-23T18:11:15Z", "content": "Rookie Charlie Culberson set up Scully with a two-out homer in the bottom of the 10th inning that lifted the Dodgers to a 4-3 victory and clinched the NL West division title.\r\nHall of Fame broadcaster Vin Scully was hospitalized after falling Tuesday in his S… [+1206 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How UEFA will determine qualification for 2020-21 events | ESPN FC - ESPN UK", "description": "ESPN FC’s Mark Ogden joins Mark Donaldson to give the latest on UEFA’s recent decision that qualification for next season's European competitions can only be...", "url": "https://www.youtube.com/watch?v=YJuEnt0pLgw", "urlToImage": null, "publishedAt": "2020-04-23T17:44:37Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "'Great' Moments From Wayne Gretzky vs. Alexander Ovechkin NHL 20 Battle - SPORTSNET", "description": "Check out some of the key moments from The Great One taking on the Great 8 in an NHL 20 battle for charity. ---------------------------------------------- Su...", "url": "https://www.youtube.com/watch?v=9YLgv_BvkaY", "urlToImage": null, "publishedAt": "2020-04-23T16:36:25Z", "content": "Check out some of the key moments from The Great One taking on the Great 8 in an NHL 20 battle for charity.---------------------------------------------- \r\nSubscribe to Sportsnet on YouTube - http://sprtsnt.ca/2paAT2L\r\nVisit Sportsnet.ca for more sports news … [+315 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NFL Draft 2020: What we want to see in first round | Pro Football Talk | NBC Sports - NBC Sports", "description": "Mike Florio and Chris Simms take turns drafting the things they are looking forward to seeing the most in the opening round of the 2020 NFL Draft. #NBCSports...", "url": "https://www.youtube.com/watch?v=S3sYz0eaBQo", "urlToImage": null, "publishedAt": "2020-04-23T15:45:55Z", "content": null}]}