{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Dallascowboys.com"}, "author": null, "title": "Cowboys Trade Up To Draft Center Biadasz - DallasCowboys.com", "description": "The Cowboys traded up to the end of the fourth round to draft Wisconsin center Tyler Biadasz, adding depth there now that Travis Frederick is retiring.", "url": "https://www.dallascowboys.com/news/cowboys-trade-up-to-draft-center-biadasz", "urlToImage": null, "publishedAt": "2020-04-25T18:30:31Z", "content": "The Rundown: Biadasz (pronounced Bee-ah-DISH) started all three years at Wisconsin and won the Rimington Award last year, given to the nation's top center. A powerful blocker up front, he was an All-American and first-team All-Big-Ten selection, continuing th… [+884 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "NFL Draft 2020 trade tracker: Trent Williams, Matt Breida dealt on Day 3 and details of every trade - CBS Sports", "description": "Find out the details of every draft day trade right here", "url": "https://www.cbssports.com/nfl/draft/news/nfl-draft-2020-trade-tracker-trent-williams-matt-breida-dealt-on-day-3-and-details-of-every-trade/", "urlToImage": null, "publishedAt": "2020-04-25T18:15:37Z", "content": "After four trades on Thursday night, Day 2 of the NFL draft had nine swaps that included three deals made by the Patriots, who have moved around a total of four times in this year's draft heading into Day 3. Day 2 ended with the Saints trading all four of the… [+377 chars]"}, {"source": {"id": null, "name": "Ganggreennation.com"}, "author": "MacGregor Wells", "title": "2020 NFL Draft Results: Jets Select Cameron Clark With The 129th Overall Pick - Gang Green Nation", "description": "The New York Jets have selected guard Cameron Clark out of the University of North Carolina - Charlotte with the 129th overall pick in the fourth round of the 2020 NFL draft.  Cameron Clark is a 22...", "url": "https://www.ganggreennation.com/2020/4/25/21236333/2020-nfl-draft-results-jets-select-cameron-clark-with-the-129th-overall-pick", "urlToImage": null, "publishedAt": "2020-04-25T17:46:07Z", "content": "The New York Jets have selected guard Cameron Clark out of the University of North Carolina - Charlotte with the 129th overall pick in the fourth round of the 2020 NFL draft. \r\nCameron Clark is a 22 year old, 6 5, 310 pound guard. He is a powerful mauler in t… [+655 chars]"}, {"source": {"id": null, "name": "Fieldgulls.com"}, "author": "John P. Gilbert", "title": "2020 NFL Draft: Seattle Seahawks select Stanford tight end Colby Parkinson - Field Gulls", "description": "The 2020 NFL Draft has entered its final day, and in each of the first three rounds of the draft the Seattle Seahawks added one player in each round.  Thursday they addressed the linebacking corps...", "url": "https://www.fieldgulls.com/2020/4/25/21236323/seattle-seahawks-te-colby-parkinson-stanford-fourth-round", "urlToImage": null, "publishedAt": "2020-04-25T17:38:08Z", "content": "The 2020 NFL Draft has entered its final day, and in each of the first three rounds of the draft the Seattle Seahawks added one player in each round. \r\nThursday they addressed the linebacking corps by selecting Jordyn Brooks out of Texas Tech in the first rou… [+875 chars]"}, {"source": {"id": null, "name": "Behindthesteelcurtain.com"}, "author": "Jeff.Hartman", "title": "2020 NFL Draft: Steelers select Guard Kevin Dotson with 4th Round pick - Behind the Steel Curtain", "description": "The Pittsburgh Steelers have selected Kevin Dotson with their second 4th round pick.", "url": "https://www.behindthesteelcurtain.com/2020/4/25/21236230/2020-nfl-draft-results-pittsburgh-steelers-select-guard-kevin-dotson-with-second-4th-round-pick-news", "urlToImage": null, "publishedAt": "2020-04-25T17:37:12Z", "content": "Entering the 2020 NFL Draft, the Pittsburgh Steelers had a number of draft needs which they needed to address. With no first round selection in the draft, running back, safety and even pass rusher were still positions of need to help the black-and-gold get to… [+1513 chars]"}, {"source": {"id": null, "name": "Milehighreport.com"}, "author": "Scotty Payne", "title": "Denver Broncos select Missouri TE Albert Okwuegbunam in fourth round - Mile High Report", "description": "Denver Broncos select Albert Okwuegbunam in the fourth round of the 2020 NFL Draft", "url": "https://www.milehighreport.com/2020/4/25/21236200/denver-broncos-select-missouri-tight-end-albert-okwuegbunam-in-the-fourth-round-2020-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-25T17:32:12Z", "content": "The Denver Broncos have selected Missouri tight end Albert Okwuegbunam in the fourth round of the 2020 NFL Draft. \r\nGeneral Manager John Elway and the Denver Broncos just added Drew Locks favorite target while at Missouri here with Big Albert O. \r\nHe is a 65,… [+1189 chars]"}, {"source": {"id": null, "name": "Freep.com"}, "author": "Carlos Monarrez", "title": "Detroit Lions get a B for drafting Kentucky guard Logan Sternberg in 2020 NFL draft - Detroit Free Press", "description": "The Detroit Lions traded down and added a fifth-rounder, but they passed on a more pressing need at DT to add depth at another position of need.", "url": "https://www.freep.com/story/sports/nfl/lions/2020/04/25/detroit-lions-nfl-draft-2020-logan-stenberg-grade/3026242001/", "urlToImage": null, "publishedAt": "2020-04-25T17:27:15Z", "content": "Last SlideNext Slide\r\nFree Press sports writer Carlos Monarrez grades the Detroit Lions after selecting Kentucky guard Logan Sternberg with the No. 121 overall pick in the fourth round of the 2020 NFL draft:\r\nPick: Logan Sternberg, Kentucky guard\r\nGrade: B\r\nO… [+633 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Mike Wells", "title": "Colts select Washington QB Jacob Eason in 4th round of NFL draft - ESPN", "description": "The Colts, whose current quarterbacks are all set to become free agents at the end of the 2020 season, drafted Washington's Jacob Eason in the fourth round Saturday.", "url": "https://www.espn.com/nfl/story/_/id/29098066/colts-select-washington-qb-jacob-eason-4th-round-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-25T17:23:46Z", "content": "INDIANAPOLIS -- The Colts selected Washington quarterback Jacob Eason in the fourth round (No. 122 overall) of the NFL draft Saturday.\r\nEason was the sixth quarterback taken in the draft, behind Joe Burrow, Tua Tagovailoa, Justin Herbert, Jordan Love and Jale… [+2491 chars]"}, {"source": {"id": null, "name": "Phillyvoice.com"}, "author": null, "title": "Philadelphia Eagles select Clemson S K'Von Wallace with 127th pick of 2020 NFL Draft - PhillyVoice.com", "description": "Clemson's K'Von Wallace has some of the \"positionless\" qualities the Eagles are striving for in their secondary, in that he played safety and slot corner for Clemson. He had a productive 2019, making 72 tackles, with 2 sacks, 2 INT, and 10 pass breakups.", "url": "https://www.phillyvoice.com/philadelphia-eagles-select-clemson-s-kvon-webster-127th-pick-2020-nfl-draft/", "urlToImage": null, "publishedAt": "2020-04-25T17:12:24Z", "content": "With their first pick on Day 3 of the 2020 NFL Draft, the Philadelphia Eagles found some help for their secondary in Clemson defensive back K'Von Wallace.\r\nWallace has some of the \"positionless\" qualities the Eagles are striving for in their secondary, in tha… [+1288 chars]"}, {"source": {"id": null, "name": "Triblive.com"}, "author": "Joe Rutter", "title": "Steelers take Maryland RB Anthony McFarland with first 4th-round pick - TribLIVE", "description": "Anthony McFarland joins a crowded position room with the Pittsburgh Steelers. The former Maryland running back, who was selected by the Steelers on Saturday in the fourth round of the NFL Draft, will compete for playing time with the likes of James Conner, Be…", "url": "https://triblive.com/sports/steelers-take-maryland-rb-anthony-mcfarland-with-first-4th-round-pick/", "urlToImage": null, "publishedAt": "2020-04-25T17:12:19Z", "content": "TribLIVE's Daily and Weekly email newsletters deliver the news you want and information you need, right to your inbox.\r\nAbout an hour ago\r\nAnthony McFarland joins a crowded position room with the Pittsburgh Steelers.\r\nThe former Maryland running back, who was… [+3239 chars]"}, {"source": {"id": null, "name": "Si.com"}, "author": "Jenna West", "title": "NFL Draft Rumors: Joe Burrow Has Been Studying Bengals' Offense for Weeks - Sports Illustrated", "description": "Check out all of the latest news and rumors on day three of the NFL draft.", "url": "https://www.si.com/nfl/2020/04/25/nfl-draft-rumors-trent-williams-trade-vikings", "urlToImage": null, "publishedAt": "2020-04-25T17:04:00Z", "content": "Rounds two and three of the NFL draft went off without a hitch on Friday but were filled with plenty of surprise and drama.\r\nThe Eagles selected Oklahoma quarterback Jalen Hurts with the No. 53 pick and the Colts traded up to take Wisconsin running back Jonat… [+2182 chars]"}, {"source": {"id": null, "name": "Dailynorseman.com"}, "author": "Christopher Gates", "title": "2020 NFL Draft Grades: What do you think of the selection of D.J. Wonnum? - Daily Norseman", "description": "Give us your takes, folks!", "url": "https://www.dailynorseman.com/2020/4/25/21236293/2020-nfl-draft-grades-d-j-wonnum-minnesota-vikings", "urlToImage": null, "publishedAt": "2020-04-25T16:51:06Z", "content": "For their first pick on Day Three of the 2020 NFL Draft, the Minnesota Vikings took a player that might not have been on a lot of radars to start the day with the selection of South Carolina defensive end D.J. Wonnum.\r\nThis it the part of the draft that the V… [+1006 chars]"}, {"source": {"id": null, "name": "Clevelandbrowns.com"}, "author": null, "title": "Browns select FAU TE Harrison Bryant with No. 115 pick in 2020 NFL Draft - clevelandbrowns.com", "description": "Cleveland goes back to offense to start Day 3", "url": "https://www.clevelandbrowns.com/news/browns-select-fau-te-harrison-bryant-with-no-115-pick-in-2020-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-25T16:33:45Z", "content": "Cook said Bryant first stood out to the team at the Senior Bowl and continued to impress throughout the pre-draft process. On film, his pass-catching ability proved to be one of top skills.\r\nBryant called his six-catch, 79-yard performance against Ohio State … [+2199 chars]"}, {"source": {"id": null, "name": "Giants.com"}, "author": null, "title": "2020 NFL Draft: Cornerback Darnay Holmes, UCLA, Round 4, Pick 110 - Giants.com", "description": "Everything you need to know about the Giants' fourth-round draft choice.", "url": "https://www.giants.com/news/darnay-holmes-nfl-draft-cornerback-ucla-bruins", "urlToImage": null, "publishedAt": "2020-04-25T16:25:15Z", "content": "With the 110th pick in the 2020 NFL Draft, the New York Giants selected 5-foot-10, 195-pound cornerback Darnay Holmes out of UCLA. Here are five things to know about the new member of Big Blue:\r\n1. UCLA CAREER OVERVIEW\r\nA three-year starter, Holmes played in … [+1032 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Tom Brady, Rob Gronkowski Get Fun Warning From Tampa Bay Mayor - TMZ", "description": "Tom Brady and Gronk just got a personal welcome from none other than the Mayor of their new home -- Tampa, Florida -- but it didn't come without a warning to both.", "url": "https://www.tmz.com/2020/04/25/tampa-bay-mayor-jane-castor-welcom-tom-brady-rob-gronkowski-letter/", "urlToImage": null, "publishedAt": "2020-04-25T16:24:07Z", "content": "Tom Brady and Gronk just got a personal welcome from none other than the Mayor of their new home -- Tampa, Florida -- but it didn't come without a warning to both.\r\nMayor Jane Castor penned her open letter, telling the Boston expatriates/ex-patriots about the… [+1714 chars]"}, {"source": {"id": null, "name": "Baltimorebeatdown.com"}, "author": "Kyle P Barber", "title": "NFL Draft Day 3 Open Thread!: Recap, updates, picks and more - Baltimore Beatdown", "description": "We have all your draft rumors, trade infromation and more up-to-the-minute updates here on Baltimore Beatdown", "url": "https://www.baltimorebeatdown.com/2020/4/25/21236233/nfl-draft-day-3-open-thread-recap-updates-picks-and-more-nfl-news-trades", "urlToImage": null, "publishedAt": "2020-04-25T16:20:37Z", "content": "Welcome to Baltimore Beatdowns 2020 NFL Draft live blog! Today is Day 3 of the NFL Draft, which begins at 12:00 p.m. ET and feature rounds 4 through 7.\r\nFor all information regarding the NFL Draft, we have full schedule guide if you click here.\r\nThis post wil… [+777 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "John Keim, Nick Wagoner", "title": "Redskins trade OT Trent Williams to 49ers for pair of NFL draft picks - ESPN", "description": "The Redskins traded Pro Bowl offensive tackle Trent Williams to San Francisco in exchange for a fifth-round pick this year and a third-round pick in 2021.", "url": "https://www.espn.com/nfl/story/_/id/29097862/sources-redskins-trade-ot-trent-williams-49ers", "urlToImage": null, "publishedAt": "2020-04-25T16:17:59Z", "content": "The Washington Redskins on Saturday traded perennial Pro Bowl offensive tackle Trent Williams to the San Francisco 49ers, ending a nearly yearlong dispute with the team that drafted him.\r\nThe Redskins traded Williams to San Francisco in exchange for a fifth-r… [+4477 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Jeff Borzello", "title": "Who Wake Forest could hire to replace Danny Manning - ESPN", "description": "Wake Forest let go of Danny Manning after one NCAA tournament appearance in six seasons. Who could the Demon Deacons hire next?", "url": "https://www.espn.com/mens-college-basketball/story/_/id/29097616/who-wake-forest-hire-replace-danny-manning", "urlToImage": null, "publishedAt": "2020-04-25T16:12:02Z", "content": "A quiet college basketball coaching carousel that stopped spinning a few weeks ago received a jolt on Saturday morning when Wake Forest parted ways with Danny Manning after six seasons.\r\nManning had been on the hot seat for the last couple years, but his guar… [+6310 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Paulina Dedaj", "title": "Dallas Cowboys' Jerry Jones hails NFL Draft as 'respite' from coronavirus - Fox News", "description": "Dallas Cowboys’ owner and general manager Jerry Jones recognized the importance of the NFL Draft, not only for football fans but for everyone quarantined at home, providing a sense of “business-as-usual” during the coronavirus pandemic.", "url": "https://www.foxnews.com/sports/dallas-cowboys-jerry-jones-draft-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T15:46:55Z", "content": "Dallas Cowboys’ owner and general manager Jerry Jones recognized the importance of the NFL Draft, not only for football fans but for everyone quarantined at home, providing a sense of “business-as-usual” during the coronavirus pandemic.\r\nJones appeared sentim… [+1235 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "John Sigler", "title": "Every Day 3 draft pick the Saints have made in the last five years - Saints Wire", "description": "The final rounds of the 2020 NFL Draft always get New Orleans Saints fans excited. After all, this is an opportunity to find a diamond in the rough, like the next Marques Colston or Zach Strief, bo…", "url": "https://saintswire.usatoday.com/gallery/2020-nfl-draft-day-3-saints-pick-history/", "urlToImage": null, "publishedAt": "2020-04-25T15:41:30Z", "content": "The final rounds of the 2020 NFL Draft always get New Orleans Saints fans excited. After all, this is an opportunity to find a diamond in the rough, like the next Marques Colston or Zach Strief, both former seventh-round picks. And while each of those long-sh… [+7509 chars]"}, {"source": {"id": null, "name": "Awesemo.com"}, "author": "Staff Writer", "title": "League of Legends DFS Picks: DraftKings + FanDuel Cheatsheet | FREE | APRIL 25, 2020 - Awesemo.com", "description": "The Following FREE LoL DFS picks for EU Masters League of Legends on DraftKings and FanDuel are based directly off Awesemo’s industry-leading premium projections for April 25. Early on, we’re looking at some great top-end options like Doinb plus some excellen…", "url": "https://www.awesemo.com/esports/lol-dfs-picks-cheatsheet-league-of-legends-draftkings-fanduel-4-25-20/", "urlToImage": null, "publishedAt": "2020-04-25T15:34:57Z", "content": "The Following FREE LoL DFS picks for EU Masters League of Legends on DraftKings and FanDuel are based directly off Awesemos industry-leading premium projections for April 25. Early on, we’re looking at some great top-end options like Doinb plus some excellent… [+1728 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Zach Braziller", "title": "Texans' Bill O'Brien has meltdown during NFL Draft 2020 - New York Post ", "description": "One bonus of the virtual NFL Draft is it has given viewers a raw behind-the-scenes look at team executives and coaches. For instance, it showed Texans coach Bill O’Brien furious, slamming down his …", "url": "https://nypost.com/2020/04/25/texans-bill-obrien-has-meltdown-during-nfl-draft-2020/", "urlToImage": null, "publishedAt": "2020-04-25T15:20:06Z", "content": "One bonus of the virtual NFL Draft is it has given viewers a raw behind-the-scenes look at team executives and coaches. For instance, it showed Texans coach Bill OBrien furious, slamming down his phone Friday night during the third round.\r\nThe root of his ang… [+1125 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Cameron DaSilva", "title": "What Sean McVay and Les Snead said about Rams' Day 2 draft picks - Rams Wire", "description": "Les Snead and Sean McVay had some high praise for the team’s rookie draft picks on Friday night.", "url": "https://theramswire.usatoday.com/2020/04/25/nfl-draft-rams-mcvay-snead-picks-comments/", "urlToImage": null, "publishedAt": "2020-04-25T15:19:18Z", "content": "The Los Angeles Rams surprisingly stayed put with all four of their picks on Friday night, making each selection without trading up or down the draft board. That’s a testament to their confidence in each player they drafted, feeling good enough to stand pat a… [+1367 chars]"}, {"source": {"id": null, "name": "Patspulpit.com"}, "author": "Michael McDermott", "title": "Eight players the Patriots could target on Day 3 of the 2020 NFL draft - Pats Pulpit", "description": "Who could be on the Patriots’ radar today?", "url": "https://www.patspulpit.com/2020/4/25/21235849/2020-nfl-draft-eight-players-new-englaand-patriots-could-target-day-3", "urlToImage": null, "publishedAt": "2020-04-25T15:03:53Z", "content": "The third day of the draft kicks off later today, and the Patriots have already addressed their needs at tight end, linebacker, and edge rusher, while also getting a high-upside safety on Day Two. The team will now need to look at solving its kicker situation… [+3553 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "What if the Bulls had traded Scottie Pippen? Exploring the three blockbusters deals that never happened - CBS Sports", "description": "The entire landscape of the NBA would look different if the Bulls had traded Scottie Pippen", "url": "https://www.cbssports.com/nba/news/what-if-the-bulls-had-traded-scottie-pippen-exploring-the-three-blockbusters-deals-that-never-happened/", "urlToImage": null, "publishedAt": "2020-04-25T14:43:00Z", "content": "It is an absolute wonder that the Chicago Bulls didn't end up prematurely killing their dynasty by trading Scottie Pippen. General manager Jerry Krause shopped him to other teams on multiple occasions. Pippen publicly begged the Bulls for a trade on multiple … [+16775 chars]"}, {"source": {"id": null, "name": "Panthers.com"}, "author": null, "title": "DT Derrick Brown, first round pick in NFL Draft, Panthers pick graded - Panthers.com", "description": "Carolina made two picks in the second round on Friday, drawing positive reviews across the NFL landscape.", "url": "https://www.panthers.com/news/yetur-gross-matos-jeremy-chinn-grades-day-2-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-25T14:34:09Z", "content": "MIKE TANIER, BLEACHER REPORT\r\nOn Gross-Matos: \"Gross-Matos is a fluid, agile athlete who defeats blocks by out-positioning his opponent and using his arms to swat the blocker's hands away. He can win the leverage battle in run defense and is good at recognizi… [+1158 chars]"}, {"source": {"id": null, "name": "Hogshaven.com"}, "author": "KyleSmithforGM", "title": "Considering several players the Redskins might take in the early 4th round - Hogs Haven", "description": "The Redskins have the second pick of Day 3, round 4, pick 2, just after the Bengals. I wouldn’t be surprised to see them trade back from the spot to collect a bit more draft capital, but if they...", "url": "https://www.hogshaven.com/2020/4/25/21235976/considering-several-players-the-redskins-might-take-in-the-early-4th-round", "urlToImage": null, "publishedAt": "2020-04-25T14:33:29Z", "content": "The Redskins have the second pick of Day 3, round 4, pick 2, just after the Bengals. I wouldnt be surprised to see them trade back from the spot to collect a bit more draft capital, but if they stay put, there are still some very talented individuals left on … [+4151 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "'The Last Dance': Michael Jordan is still bullying Jerry Krause, who shielded the Bulls owner from any scorn - CBS Sports", "description": "In 'The Last Dance', the 10-part ESPN/Netflix documentary, the legendary Bulls executive takes yet another beating", "url": "https://www.cbssports.com/nba/news/the-last-dance-michael-jordan-is-still-bullying-jerry-krause-who-shielded-the-bulls-owner-from-any-scorn/", "urlToImage": null, "publishedAt": "2020-04-25T14:27:12Z", "content": "Jerry Krause was never cuddly. He was not a friend to the media, nor to his competition. Much like Michael Jordan, he was obsessive about his job to the point where his colleagues couldn't relate to him. The former Chicago Bulls general manager, who died in 2… [+4314 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Minyvonne Burke", "title": "Washington State football player Bryce Beekman died from accidental drug overdose - NBC News", "description": "Bryce Beekman, the Washington State football player found dead at his home in late March, died from an accidental overdose, the coroner said.", "url": "https://www.nbcnews.com/news/us-news/washington-state-football-player-bryce-beekman-died-accidental-drug-overdose-n1192586", "urlToImage": null, "publishedAt": "2020-04-25T14:15:22Z", "content": "Bryce Beekman, the Washington State football player found dead at his home in late March, died from an accidental overdose, the coroner said.\r\nThe 22-year-old athlete died on March 23 from acute intoxication due to a combination of fentanyl and promethazine, … [+1481 chars]"}, {"source": {"id": null, "name": "Hogshaven.com"}, "author": "Mark Tyler", "title": "Washington Redskins Select Antonio Gibson- Tyler’s Take - Hogs Haven", "description": "When the Redskins selected Antonio Gibson with the 66th(3rd round) overall pick in the 2020 NFL Draft, I was a bit disappointed. It’s not that I hated the player - but rather, it was who was on the...", "url": "https://www.hogshaven.com/2020/4/25/21235953/washington-redskins-select-antonio-gibson-tylers-take", "urlToImage": null, "publishedAt": "2020-04-25T13:49:33Z", "content": "When the Redskins selected Antonio Gibson with the 66th(3rd round) overall pick in the 2020 NFL Draft, I was a bit disappointed. Its not that I hated the player - but rather, it was who was on the board at a position of need when the selection was made. \r\n - … [+3429 chars]"}, {"source": {"id": null, "name": "Dawindycity.com"}, "author": "Vincent Parise", "title": "Chicago Bears: NFC North rivals improve in rounds two and three? - Da Windy City", "description": "The Chicago Bears have seen their division rivals really improve their teams so far. Rounds two and three are no different. The Chicago Bears and the rest ...", "url": "https://dawindycity.com/2020/04/25/chicago-bears-nfc-north-rivals-rounds-two-and-three/", "urlToImage": null, "publishedAt": "2020-04-25T13:31:19Z", "content": "Chicago Bears (Photo by Tom Pennington/Getty Images)\r\nThe Chicago Bears and the rest of the National Football League have officially completed the first three rounds of the 2020 NFL Draft. They are looking to add what they need to add in order to make their f… [+1279 chars]"}, {"source": {"id": null, "name": "Arrowheadpride.com"}, "author": "Pete Sweeney", "title": "Brett Veach, Andy Reid explain why Chiefs drafted Clyde Edwards-Helaire - Arrowhead Pride", "description": "The Kansas City Chiefs selected a running back the first round of the NFL Draft: LSU’s Clyde Edwards-Helaire. Head coach Andy Reid and general manager Brett Veach met with the media on Saturday,...", "url": "https://www.arrowheadpride.com/2020/4/25/21235941/brett-veach-andy-reid-explain-why-chiefs-drafted-clyde-edwards-helaire", "urlToImage": null, "publishedAt": "2020-04-25T13:21:19Z", "content": "The Kansas City Chiefs selected a running back the first round of the NFL Draft: LSUs Clyde Edwards-Helaire. Head coach Andy Reid and general manager Brett Veach met with the media on Saturday, explaining why he was their top choice at the position and at No.… [+3715 chars]"}, {"source": {"id": null, "name": "Ninersnation.com"}, "author": "Kyle Posey", "title": "Day 3 Bold predictions: The 49ers will make multiple trades today - Niners Nation", "description": "Will we see a tight end added?", "url": "https://www.ninersnation.com/2020/4/25/21235608/day-3-bold-predictions-the-49ers-will-make-multiple-trades-today", "urlToImage": null, "publishedAt": "2020-04-25T13:08:32Z", "content": "Friday wasnt nearly as exciting for us as the San Francisco 49ers didnt have any picks. The team is back on the clock today, but theyll have to wait until the fifth round to make their first selection after using the fourth-rounder acquired from trading down … [+2449 chars]"}, {"source": {"id": null, "name": "Kentuckysportsradio.com"}, "author": null, "title": "WATCH: The Moment Jon Gruden told Lynn Bowden he was going to be a Raider - kentuckysportsradio.com", "description": "The former Kentucky Wildcat could hardly speak.", "url": "https://kentuckysportsradio.com/football-2/watch-the-moment-jon-gruden-told-lynn-bowden-he-was-going-to-be-a-raider/", "urlToImage": null, "publishedAt": "2020-04-25T13:00:00Z", "content": "Skip to content\r\nThis is the moment Lynn Bowden’s life changed forever.\r\nLate Friday night he received a call from Jon Gruden. The head coach of the Las Vegas Raiders was excited to tell Bowden they would be selecting him with the 80th pick in the 2020 NFL Dr… [+1539 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Josh Alper", "title": "Brian Gutekunst on Day Two picks: Matt LaFleur wants to tie everything to run game - NBCSports.com", "description": "The Packers raised some eyebrows and the ire of some of their fans in the first round of the draft when they picked quarterback Jordan Love rather than a player who would be in line to help them in 2020 and their second day picks drew some similar reactions. …", "url": "https://profootballtalk.nbcsports.com/2020/04/25/brian-gutekunst-on-day-two-picks-matt-lafleur-wants-to-tie-everything-to-run-game/", "urlToImage": null, "publishedAt": "2020-04-25T12:46:00Z", "content": "pkrlvr says:April 25, 2020 at 10:47 amThere are severe ramifications to giving a player $80,000,000.00 in the first 12 months of a contract.\r\nYou talking about your team or ours?###\r\nYour’s of course.\r\nCousins only got a $1.5M signing bonus back in 2018. His … [+767 chars]"}, {"source": {"id": null, "name": "Thefalcoholic.com"}, "author": "Evan Birchfield", "title": "2020 NFL Draft: Here are the Falcons’ top remaining needs on Day 3 - The Falcoholic", "description": "The last day of the draft is upon us!", "url": "https://www.thefalcoholic.com/2020/4/25/21235670/2020-nfl-draft-falcons-top-remaining-needs-day-3", "urlToImage": null, "publishedAt": "2020-04-25T12:00:00Z", "content": "Hey Falcoholics! Its now officially Day 3 of the 2020 NFL Draft. Hopefully youve all had a tremendous nights rest and youre ready for arguable the most important rounds in the draft, rounds 4-7. These rounds arent the most exciting the draft has to offer, but… [+2272 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Rickie Fowler's most aggressive shots on the PGA TOUR - PGA TOUR", "description": "Rickie Fowler isn't afraid of taking chances on the golf course, watch how some of his most agressive shots on the PGA TOUR paid off. SUBSCRIBE to PGA TOUR n...", "url": "https://www.youtube.com/watch?v=0ZvotPKSoEo", "urlToImage": null, "publishedAt": "2020-04-25T11:30:01Z", "content": null}, {"source": {"id": null, "name": "Rotoballer.com"}, "author": "", "title": "Instant Reaction: NFL Draft Rounds 2-3 Winners/Losers - RotoBaller", "description": "Rishi Patel provides instant reaction to day two of the 2020 NFL Draft from a fantasy football viewpoint. Which players were among the biggest winners and losers in rounds 2-3?", "url": "https://www.rotoballer.com/nfl-draft-round-2-3-fantasy-winners-and-losers/734238", "urlToImage": null, "publishedAt": "2020-04-25T11:00:17Z", "content": "Rounds 2 and 3 of the 2020 NFL Draft picked up on Friday and saw plenty of talented names get selected. Teams continued to solidify their depth charts and many like the Bengals and Colts bolstered their offenses. Of course, there were a few surprises, notably… [+8939 chars]"}, {"source": {"id": null, "name": "Nj.com"}, "author": "Darryl Slater | NJ Advance Media for NJ.com", "title": "NFL Draft 2020: Ranking 50 best players still available on Day 3, including Jake Fromm, Jacob Eason, Trey Ada - NJ.com", "description": "A look at the best players still available in the 2020 NFL Draft.", "url": "https://www.nj.com/jets/2020/04/nfl-draft-2020-ranking-50-best-players-still-available-on-day-3-including-jake-fromm-jacob-eason-trey-adams-more.html", "urlToImage": null, "publishedAt": "2020-04-25T10:16:05Z", "content": "We are through three rounds of the 2020 NFL Draft, after the second and third rounds wrapped up Friday night.\r\nThe draft concludes Saturday with Rounds 4-7, beginning at noon.\r\nSo lets rank the 50 best prospects still available.\r\n1. QB Jacob Eason, Washington… [+2013 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "“The Winner Will Fight Khabib For the Title”- Dana White makes a huge statement - India Gone Viral", "description": "UFC 249 finally has a new venue. The event will take place at VyStar Veterans Memorial Arena in Jacksonville, Florida. The UFC pounced on a chance to hold their events in the Sunshine State as sports", "url": "https://indiagoneviral.com/sports/2020/04/25/the-winner-will-fight-khabib-for-the-title/42011/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T08:05:16Z", "content": "UFC 249 finally has a new venue. The event will take place at VyStar Veterans Memorial Arena in Jacksonville, Florida. The UFC pounced on a chance to hold their events in the Sunshine State as sports activities were deemed essential businesses. Dana White app… [+1803 chars]"}, {"source": {"id": null, "name": "49ers.com"}, "author": null, "title": "Top Players Available for Day 3 of the 2020 NFL Draft - 49ers.com", "description": "The 49ers own three picks in Rounds 5-7. Here's a list of the top players left on the board ahead of Day 3.", "url": "https://www.49ers.com/news/top-players-available-day-3-2020-nfl-draft-49ers", "urlToImage": null, "publishedAt": "2020-04-25T07:39:51Z", "content": "The San Francisco 49ers look to continue what they began on Thursday. To recap, the 49ers selected defensive tackle Javon Kinlaw with the 14th-overall pick and traded up to grab wide receiver Brandon Aiyuk with the 25th-overall pick in the draft. San Francisc… [+352 chars]"}, {"source": {"id": null, "name": "Theathletic.com"}, "author": "Dane Brugler", "title": "The players remaining on Dane Brugler's top 300 draft... - The Athletic", "description": "Here is how the list of top 300 prospects stands heading into the final four rounds on Saturday.", "url": "https://theathletic.com/1773033/2020/04/25/the-players-remaining-on-dane-bruglers-top-300-draft-board-entering-day-3/", "urlToImage": null, "publishedAt": "2020-04-25T05:19:12Z", "content": "Most of the top players in the NFL Draft were selected during the first two days, but as the best teams routinely demonstrate, there are plenty of quality players to be found in the later rounds.Washington’s Jacob Eason and Georgia’s Jake Fromm are among the … [+678 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Vikings select a PHYSICAL player in Cameron Dantzler with the 89th pick | 2020 NFL Draft - CBS Sports", "description": "With the 89th pick in the 2020 NFL Draft, the Minnesota Vikings select Cameron Dantzler, CB from Mississippi State. Our CBS Sports HQ crew breaks down the se...", "url": "https://www.youtube.com/watch?v=54K6rQbAsd4", "urlToImage": null, "publishedAt": "2020-04-25T04:17:28Z", "content": null}, {"source": {"id": null, "name": "Palmbeachpost.com"}, "author": "Joe Schad", "title": "Schad: Miami Dolphins add much-needed trench bullies - Palm Beach Post", "description": "NFL Draft 2020: Dolphins add to offensive, defensive lines in second", "url": "https://www.palmbeachpost.com/article/20200425/SPORTS/200428792", "urlToImage": null, "publishedAt": "2020-04-25T04:13:01Z", "content": "NFL Draft 2020: Dolphins add to offensive, defensive lines in second\r\nQuarterbacks are pretty and a running back would have been nice, but the Dolphins aren’t moving forward as a franchise any time soon until they can start moving men forward on the lines of … [+4870 chars]"}, {"source": {"id": null, "name": "Boston.com"}, "author": "nicole-yang", "title": "The Patriots select a pair of tight ends in third round of 2020 NFL Draft - Boston.com", "description": "UCLA's Devin Asiasi and Virginia Tech's Dalton Keene are heading to New England.", "url": "https://www.boston.com/sports/new-england-patriots/2020/04/24/patriots-draft-devin-asiasi", "urlToImage": null, "publishedAt": "2020-04-25T03:20:17Z", "content": "The Patriots selected a pair of tight ends UCLAs Devin Asiasi and Virginia Techs Dalton Keene in the third round of the 2020 NFL Draft Friday night.\r\nNew England traded up to secure both players, Asiasi with the 91st overall pick and Keene with the 101st. The… [+2264 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Jets CONTINUE TO FILL NEEDS by drafting Jabari Zuniga with the 79th pick | 2020 NFL Draft - CBS Sports", "description": "With the 79th pick in the 2020 NFL Draft, the NY Jets select Jabari Zuniga, EDGE from Florida. Our CBS Sports HQ crew breaks down the selection, providing a ...", "url": "https://www.youtube.com/watch?v=kJ2VicBDBw0", "urlToImage": null, "publishedAt": "2020-04-25T03:07:22Z", "content": null}, {"source": {"id": null, "name": "Syracuse.com"}, "author": "Matt Parrino | mparrino@nyup.com", "title": "7 thoughts and a grade on Buffalo Bills drafting Iowa DE A.J. Epenesa - syracuse.com", "description": "Epenesa went at pick No. 16 in ESPN's Mel Kiper's first mock draft in January.", "url": "https://www.syracuse.com/buffalo-bills/2020/04/7-thoughts-and-a-grade-on-buffalo-bills-drafting-iowa-de-aj-epenesa.html", "urlToImage": null, "publishedAt": "2020-04-25T02:58:11Z", "content": "When the first round of the 2020 NFL Draft concluded on Thursday night, Buffalo Bills fans started combing through the list of players still left on the board.\r\nThe Bills didnt have a first-round pick after trading it in a deal for receiver Stefon Diggs last … [+7503 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Will NHL hockey return this season? | HC@Home - SPORTSNET", "description": "David Amber is joined by Brendan Gallagher and Kevin Bieksa to discuss dad fights, TikTok videos & Dennis Rodman….. plus the state of league amid Covid-19. -...", "url": "https://www.youtube.com/watch?v=6YZpwdpKdec", "urlToImage": null, "publishedAt": "2020-04-25T02:50:15Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Dolphins receive a DISRUPTIVE ATHLETE in Raekwon Davis with the 56th overall pick | 2020 NFL Draft - CBS Sports", "description": "With the 56th pick in the 2020 NFL Draft, the Miami Dolphins select Raekwon Davis, defensive lineman from Alabama. Our CBS Sports HQ crew breaks down the sel...", "url": "https://www.youtube.com/watch?v=LZ82yzSt79Q", "urlToImage": null, "publishedAt": "2020-04-25T01:30:57Z", "content": null}, {"source": {"id": null, "name": "Musiccitymiracles.com"}, "author": "Terry A. Lambert", "title": "2020 NFL Draft: Titans take LSU CB Kristian Fulton in second round - Music City Miracles", "description": "A big need filled.", "url": "https://www.musiccitymiracles.com/2020/4/24/21231489/2020-nfl-draft-titans-take-lsu-cornerback-kristian-fulton-with-second-round-pick", "urlToImage": null, "publishedAt": "2020-04-25T01:24:11Z", "content": "The Tennessee Titans have selected LSU cornerback Kristian Fulton with the 61st pick in the 2020 NFL Draft. With Logan Ryan remaining unsigned, cornerback was a clear need for Jon Robinson. \r\nFulton checks in at 6-0, 197 pounds. As a senior, Fulton started 15… [+921 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Jaylon Johnson College Highlights - Chicago Bears", "description": "Check out highlights from the Bears 2nd round draft choice and 50th overall, defensive back Jaylon Johnson from Utah. Subscribe to the Bears YT Channel: http...", "url": "https://www.youtube.com/watch?v=L-7blM1_IuI", "urlToImage": null, "publishedAt": "2020-04-25T01:24:04Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Buccaneers select a HIGHLY SKILLED Antoine Winfield Jr. with the 45th pick | 2020 NFL Draft - CBS Sports", "description": "With the 45th pick in the 2020 NFL Draft, the Tampa Bay Buccaneers select Antoine WInfield Jr., S from Minnesota. Our CBS Sports HQ crew breaks down the sele...", "url": "https://www.youtube.com/watch?v=SkLs_JcBIYI", "urlToImage": null, "publishedAt": "2020-04-25T00:51:33Z", "content": "With the 45th pick in the 2020 NFL Draft, the Tampa Bay Buccaneers select Antoine WInfield Jr., S from Minnesota.\r\nOur CBS Sports HQ crew breaks down the selection, providing a grade for the team and what potential impact Winfield Jr. might have for the Bucca… [+262 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NFL Draft 2020: Chris Simms' First Round Quarterback Reactions | Chris Simms Unbuttoned | NBC Sports - NBC Sports", "description": "Chris Simms shares his thoughts on the quarterbacks taken during the first round of the 2020 NFL Draft. #NBCSports #ChrisSimmsUnbuttoned #NFLDraft2020 » Subs...", "url": "https://www.youtube.com/watch?v=Z89q_gOGcQA", "urlToImage": null, "publishedAt": "2020-04-24T22:56:47Z", "content": "Chris Simms shares his thoughts on the quarterbacks taken during the first round of the 2020 NFL Draft. #NBCSports#ChrisSimmsUnbuttoned#NFLDraft2020» Subscribe to NBC Sports: https://www.youtube.com/nbcsports» Watch Live Sports on NBCSports.com: http://www.nb… [+1224 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Gary Neville warns people are getting \"carried away\" with Man Utd target Jadon Sancho - Mirror Online", "description": "Man Utd legend Gary Neville has put Jadon Sancho's quality into context compared to some of the world's best players", "url": "https://www.mirror.co.uk/sport/football/news/gary-neville-warns-people-getting-21923589", "urlToImage": null, "publishedAt": "2020-04-24T21:41:45Z", "content": "Gary Neville claims Manchester United target Jadon Sancho is \"nowhere near\" some of the world's elite.\r\nThe Red Devils have been linked with the Borussia Dortmund star who is likely to cost around £100m.\r\nMuch is made of the Englishman's exploits in the Bunde… [+1834 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Jared Dudley Talks Lakers Playoffs, His Future In L.A., Kyle Kuzma's Growth, Dwight Howard Returning - Lakers Nation", "description": "Los Angeles Lakers ✔️ Help us continue to provide Lakers coverage and SUBSCRIBE: https://goo.gl/5AXSud ✔️ Our MOST POPULAR Videos: https://goo.gl/k4Xvqq Lake...", "url": "https://www.youtube.com/watch?v=bdgNVx2wf5Y", "urlToImage": null, "publishedAt": "2020-04-24T21:09:47Z", "content": "Los Angeles Lakers\r\nHelp us continue to provide Lakers coverage and SUBSCRIBE: https://goo.gl/5AXSud\r\nOur MOST POPULAR Videos: https://goo.gl/k4Xvqq\r\nLakersNation.com on Social Media:\r\nLike on Facebook: https://goo.gl/EQ4uiG\r\nFollow us on Twitter: https://goo… [+165 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Brad Keselowski breakdown: Winning moves, key decisions in first victory | Talladega Superspeedway - NASCAR", "description": "Brad Keselowski's first NASCAR Cup Series win was memorable for its thrilling, controversial conclusion. The Team Penske driver sits down to analyze and expl...", "url": "https://www.youtube.com/watch?v=8EYwW6uV6s0", "urlToImage": null, "publishedAt": "2020-04-24T19:11:42Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Greg Brown Is a TEXAS Commit! — Official Mixtape - Bleacher Report", "description": "Greg Brown can jump out of the gym! The power forward is heading to Texas and will be catching bodies all season in the Big 12 Conference. Subscribe: https:/...", "url": "https://www.youtube.com/watch?v=vzeZOf4cJu8", "urlToImage": null, "publishedAt": "2020-04-24T19:05:25Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NFL Draft 2020: Bruce Arians, Bucs get protection for Tom Brady (FULL INTERVIEW) | NBC Sports - NBC Sports", "description": "Buccaneers head coach Bruce Arians joins Mike Tirico to discuss his team's decision on drafting Tristian Wirfs and what it means with the additions of Tom Br...", "url": "https://www.youtube.com/watch?v=Ni9fbdLtEnY", "urlToImage": null, "publishedAt": "2020-04-24T18:15:36Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Andersen reveals the best and worst part about isolating with Matthews - TSN", "description": "Maple Leafs goaltender Frederik Andersen joins James Duthie to talk about what isolation has been like with Auston Matthews down in Arizona. He also touches ...", "url": "https://www.youtube.com/watch?v=YMidEz7ODJo", "urlToImage": null, "publishedAt": "2020-04-24T17:30:31Z", "content": null}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Dak Prescott's Brother, Jace, Dead At 31 - TMZ", "description": "Tragic news for the Dallas Cowboys QB and his family.", "url": "https://www.tmz.com/2020/04/24/nfls-dak-prescott-s-brother-dead-at-31-cause-of-death-unknown/", "urlToImage": null, "publishedAt": "2020-04-24T17:23:20Z", "content": "Tragic news for Dak Prescottand his family ... the quarterback's older brother, Jace Prescott, died suddenly at 31 years old on Thursday, the Dallas Cowboys announced.\r\nNo cause of death was given.\r\nDak had been super close with Jace, the oldest of the Presco… [+1131 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Michael Middlehurst-Schwartz", "title": "NFL draft 2020's best available players in second round: Grant Delpit, Laviska Shenault among top options on board - USA TODAY", "description": "There's still plenty of first-round talent available for teams on Day 2 of the NFL draft, including several promising options at safety and receiver.", "url": "https://www.usatoday.com/story/sports/nfl/draft/2020/04/24/nfl-draft-second-round-best-players-available-2020/3020500001/", "urlToImage": null, "publishedAt": "2020-04-24T17:10:28Z", "content": "SportsPulse: The first night of the NFL's virtual draft went off without a hitch and Mackenzie Salmon is here to break down the nights biggest winners and losers.\r\nUSA TODAY\r\nThere's still first-round talent awaiting teams on Day 2 of the 2020 NFL draft.\r\nThu… [+5255 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NFL Draft 2020: QB Justin Herbert finds new home with Chargers | Pro Football Talk | NBC Sports - NBC Sports", "description": "The Chargers selected the West Coast star from Oregon in Justin Herbert, who will most likely get the nod as the starter week one or early on in the regular ...", "url": "https://www.youtube.com/watch?v=3vcjSqlTZuk", "urlToImage": null, "publishedAt": "2020-04-24T16:19:18Z", "content": "The Chargers selected the West Coast star from Oregon in Justin Herbert, who will most likely get the nod as the starter week one or early on in the regular season. #NBCSports#ProFootballTalk#NFL» Subscribe to NBC Sports: https://www.youtube.com/nbcsports?sub… [+1277 chars]"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Daniel Marland", "title": "Mike Tyson Reveals He Is Training For A Surprise Return To Boxing - SPORTbible", "description": "'Iron Mike' is stepping back into the ring and boxing fans should be excited.", "url": "https://www.sportbible.com/boxing/boxing-news-legends-mike-tyson-reveals-he-is-training-for-surprise-return-to-boxing-20200424", "urlToImage": null, "publishedAt": "2020-04-24T15:09:27Z", "content": "Mike Tyson has revealed he is training for a sensational return to boxing and plans to take part in four round exhibition fights for charity.\r\n'Iron Mike' fell to defeat against Kevin McBride back in 2005 which proved to be the final professional fight of his… [+1694 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt, CNN", "title": "Hope Solo, former USWNT goalie, announces birth of twins - CNN", "description": "Former US goalkeeper Hope Solo and husband Jerramy Stevens have welcomed twins into the world, the soccer star announced on Thursday.", "url": "https://edition.cnn.com/2020/04/24/football/hope-solo-twins-intl-scli/index.html", "urlToImage": null, "publishedAt": "2020-04-24T09:45:38Z", "content": "(CNN)Former US goalkeeper Hope Solo and husband Jerramy Stevens have welcomed twins into the world, the soccer star announced on Thursday. \r\nFormer US Women's National Team goalkeeper and two-time Olympic gold medalist Solo announced the birth of her twins --… [+1149 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Sean Payton After Drafting Cesar Ruiz in 2020 NFL Draft | Saints Draft - New Orleans Saints", "description": "New Orleans Saints Head Coach Sean Payton talks to the media following day 1 of the 2020 NFL draft after the Saints selected Cesar Ruiz #24 overall with thei...", "url": "https://www.youtube.com/watch?v=zAJJfVl4fUA", "urlToImage": null, "publishedAt": "2020-04-24T05:59:21Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Instant Reaction: Javon Kinlaw fills need for San Francisco 49ers | Pro Football Talk | NBC Sports - NBC Sports", "description": "Locking up Javon Kinlaw for five years at reasonable salary is a smart decision for San Francisco. #NBCSports #SanFrancisco49ers #JavonKinlaw » Subscribe to ...", "url": "https://www.youtube.com/watch?v=fNfaWwMZdLs", "urlToImage": null, "publishedAt": "2020-04-24T03:15:52Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Will Isaiah Simmons be PHYSICAL ENOUGH for the Cardinals? | 2020 NFL Draft | CBS Sports HQ - CBS Sports", "description": "With the 8th pick in the 2020 NFL Draft, the Arizona Cardinals select Isaiah Simmons, from Clemson. Our CBS Sports HQ crew breaks down the selection, providi...", "url": "https://www.youtube.com/watch?v=XZwXCzr99Y8", "urlToImage": null, "publishedAt": "2020-04-24T01:52:40Z", "content": null}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Lex Pryor", "title": "Five things to know about Joe Burrow, the Bengals' new quarterback - USA TODAY", "description": "No prospect in this draft came with as much hype as Joe Burrow. Now the Cincinnati Bengals hope he becomes their long-term quarterback.", "url": "https://www.usatoday.com/story/sports/nfl/draft/2020/04/23/joe-burrow-nfl-draft-five-things-know-new-bengals-qb/2865191001/", "urlToImage": null, "publishedAt": "2020-04-24T00:31:10Z", "content": "SportsPulse: After all the deliberation and speculation, Joe Burrow is now a Cincinnati Bengals. We detail his strengths and weaknesses and the type of prospect the Bengals are getting.\r\nUSA TODAY\r\nNo prospect in the 2020 NFL draft class came with as much hyp… [+3132 chars]"}, {"source": {"id": null, "name": "Today.com"}, "author": "Ronnie Koenig", "title": "Budweiser brings back 'whassup' commercial during coronavirus - TODAY", "description": "Former NBA stars and others unite for a reboot of the famous 'wassup' Budweiser commercial, this time with an emotional ending.", "url": "https://www.today.com/food/budweiser-brings-back-whassup-commercial-during-coronavirus-t179787", "urlToImage": null, "publishedAt": "2020-04-23T23:27:40Z", "content": "Budweiser just released a new version of its classic \"whassup\" commercial that's not only funny, but also serves as a genuinely touching public service announcement in the time of coronavirus.\r\nThe original commercial, which aired in 1999 featured a group of … [+2951 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Scott Boeck", "title": "Hall of Fame broadcaster Vin Scully hospitalized after fall and is 'resting comfortably' - USA TODAY", "description": "Hall of Fame broadcaster Vin Scully, 92, was hospitalized after falling in his home on Tuesday. He is \"resting comfortably,\" the Dodgers tweeted.", "url": "https://www.usatoday.com/story/sports/mlb/dodgers/2020/04/23/vin-scully-hall-of-fame-dodgers-broadcaster-hospitalized/3012240001/", "urlToImage": null, "publishedAt": "2020-04-23T18:11:15Z", "content": "Rookie Charlie Culberson set up Scully with a two-out homer in the bottom of the 10th inning that lifted the Dodgers to a 4-3 victory and clinched the NL West division title.\r\nHall of Fame broadcaster Vin Scully was hospitalized after falling Tuesday in his S… [+1206 chars]"}]}