{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Freep.com"}, "author": "Dave Birkett", "title": "Don't expect Detroit Lions to play in packed Ford Field, Gov. Whitmer says - Detroit Free Press", "description": "The Detroit Lions are making contingency plans to host games at less than full capacity this fall because of the coronavirus pandemic", "url": "https://www.freep.com/story/sports/nfl/lions/2020/05/12/michigan-governor-gretchen-whitmer-detroit-lions-ford-field/3121905001/", "urlToImage": "https://www.gannett-cdn.com/presto/2019/11/28/PDTF/a3c9c8ca-ff07-49b6-8590-c4625d6fa4cd-SI_20191128_neb_ai5_01.jpg?crop=2399,1349,x0,y188&width=1600&height=800&fit=bounds", "publishedAt": "2020-05-13T10:27:36Z", "content": "Free Press sports writer Dave Birkett breaks down when the Detroit Lions' 2020 schedule and how that sets up for them. Filmed May 7.\r\nDetroit Free Press\r\nThe NFL may be planning for a \"traditional\" season this fall with stadiums full of fans, but chances are … [+4202 chars]"}, {"source": {"id": null, "name": "Kcra.com"}, "author": "KCRA Staff", "title": "California Collegiate Athletic Association suspends NCAA games for fall - KCRA Sacramento", "description": "The California Collegiate Athletic Association has suspended NCAA competition for Fall 2020, officials said Tuesday.", "url": "https://www.kcra.com/article/california-collegiate-athletic-association-suspends-ncaa-games-for-fall/32454883", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/ccaa-1589346042.jpg?crop=0.922xw:0.922xh;0.0457xw,0&resize=1200:*", "publishedAt": "2020-05-13T05:45:44Z", "content": "The California Collegiate Athletic Association has suspended NCAA competition for Fall 2020, officials said Tuesday.\r\nThe announcement comes after California State University Chancellor Timothy P. White said many Fall 2020 classes will be moved online due to … [+940 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Abhishek Bharadwaj", "title": "Ferrari Insider Reveals Daniel Ricciardo Has Already Signed with McLaren for 2021 to Replace Carlos Sainz - Essentially Sports", "description": "According to reputed journalist Leo Turrini, Daniel Ricciardo may have already signed with McLaren after possibly losing out on a Ferrari seat.", "url": "https://www.essentiallysports.com/f1-news-ferrari-insider-reveals-daniel-ricciardo-has-already-signed-with-mclaren-for-2021-to-replace-carlos-sainz/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200513104124/dr-18.jpg", "publishedAt": "2020-05-13T05:20:00Z", "content": "According to the latest reports, Daniel Ricciardo may have signed with McLaren. Many believe the Australian is a front-runner for the vacant seat at Ferrari in 2021. However, Ricciardo could be on his way to the Woking outfit next year. As with all rumors, ta… [+2017 chars]"}, {"source": {"id": null, "name": "Japantimes.co.jp"}, "author": "Internal Submission", "title": "Sumo wrestler Shobushi, 28, is sport's first coronavirus death - The Japan Times", "description": "The lower-ranked rikishi, who spent over three weeks in intensive care, is one of several positive cases from Takadagawa stable.", "url": "https://www.japantimes.co.jp/sports/2020/05/13/sumo/sumo-wrestler-shobushi-dies-coronavirus/", "urlToImage": "https://cdn.japantimes.2xx.jp/wp-content/uploads/2020/05/np_file_11716-870x1169.jpeg", "publishedAt": "2020-05-13T05:09:00Z", "content": "A 28-year-old sumo wrestler from the sport's fourth-tier sandanme division died early Wednesday morning due to multiple organ failure caused by the new coronavirus, the Japan Sumo Association said.\r\nShobushi, whose real name was Kiyotaka Suetake, is the first… [+1260 chars]"}, {"source": {"id": null, "name": "Boxingscene.com"}, "author": null, "title": "Dana White Pleads With Mike Tyson: You're 53, Please Don't Do It! - BoxingScene.com", "description": "UFC president Dana White says that he is pleading with former undisputed heavyweight champion Mike Tyson, advising the Hall of Famer not to step back into the ring after Tyson released another viral training video and declaring “I’m back”.", "url": "https://www.boxingscene.com/dana-white-pleads-with-mike-tyson-youre-53-please-it--148838", "urlToImage": "https://photo.boxingscene.com/uploads/mike-tyson-4.jpg", "publishedAt": "2020-05-13T04:06:49Z", "content": "UFC president Dana White says that he is pleading with former undisputed heavyweight champion Mike Tyson, advising the Hall of Famer not to step back into the ring after Tyson released another viral training video and declaring “I’m back”.\r\nTyson has been tea… [+1303 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "Richard Hamilton says Kobe Bryant is most Michael Jordan-like player: 'I was low-key scared' to face him - CBS Sports", "description": "Hamilton had plenty to say about Kobe being at No. 10 on CBS Sports' list of the top 15 players in NBA history", "url": "https://www.cbssports.com/nba/news/richard-hamilton-says-kobe-bryant-is-most-michael-jordan-like-player-i-was-low-key-scared-to-face-him/", "urlToImage": "https://sportshub.cbsistatic.com/i/r/2020/01/28/874bb7ee-a00b-4250-b03a-b520ab8c9e6a/thumbnail/1200x675/1d86540c8f8bcc2c6155511361d58211/kobe-bryant.jpg", "publishedAt": "2020-05-13T03:03:19Z", "content": "The 2019-20 NBA season is suspended due to the coronavirus pandemic, and with no live games, the easiest thing to do is go back and discuss what's happened in the past. Much of that conversation has been centered around Michael Jordan, as everyone has been tu… [+3607 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Kyle Madson", "title": "6 49ers who need to step up for Jimmy Garoppolo in 2020 - Niners Wire", "description": "Jimmy Garoppolo and the success of the San Francisco 49ers rides on these six player stepping up.", "url": "https://ninerswire.usatoday.com/2020/05/12/49ers-roster-jimmy-garoppolo-2020-stats/", "urlToImage": "https://usat49erswire.files.wordpress.com/2019/10/usatsi_13545193.jpg?w=1024&h=576&crop=1", "publishedAt": "2020-05-13T02:03:35Z", "content": "The 2020 season is an important turning point for the 49ers in their quest for an extended championship window. Perhaps no player is more important to their success in the short and long term than quarterback Jimmy Garoppolo.\r\nHe went 13-3 in his first full s… [+759 chars]"}, {"source": {"id": null, "name": "Mmamania.com"}, "author": "Patrick L. Stumberg", "title": "UFC Jacksoville odds: Latest Vegas lines and betting guide for ‘Smith vs Teixeira’ - MMA Mania", "description": "Get a detailed breakdown of the betting lines for UFC Jacksonville, which is set to hit VyStar Veterans Memorial Arena in Jacksonville, Fla., this week (Weds., May 13, 2020), including best bets, underdogs, favorites and much more!", "url": "https://www.mmamania.com/2020/5/12/21255175/ufc-jacksonville-odds-latest-vegas-lines-online-betting-guide-smith-teixeira-sportsbook-espn-mma", "urlToImage": "https://cdn.vox-cdn.com/thumbor/nWac9ansujNctw7JIzUvov0g7NQ=/0x0:5258x2753/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19963057/1147255259.jpg.jpg", "publishedAt": "2020-05-13T02:02:18Z", "content": "Why wait for the weekend to have some fun?\r\nVyStar Veterans Memorial Arena in Jacksonville, Fla., once again hosts Ultimate Fighting Championship this Wednesday evening (May 13, 2020), featuring Light Heavyweight finishers Anthony Smith and Glover Teixeira in… [+3110 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Charean Williams", "title": "Dolphins remain in play for Logan Ryan - NBCSports.com", "description": "Logan Ryan won’t return to Tennessee, and by all accounts, the Jets are favored to land him. But the Dolphins “remain in play” for the cornerback, Mike Garafolo of NFL Media reports. Ryan and the Dolphins have had recent talks despite their riches at cornerba…", "url": "https://profootballtalk.nbcsports.com/2020/05/12/dolphins-remain-in-play-for-logan-ryan/", "urlToImage": "https://profootballtalk.nbcsports.com/wp-content/uploads/sites/25/2020/05/GettyImages-1057834434-e1589335241499.jpg", "publishedAt": "2020-05-13T02:01:00Z", "content": "Logan Ryan won’t return to Tennessee, and by all accounts, the Jets are favored to land him. But the Dolphins “remain in play” for the cornerback, Mike Garafolo of NFL Media reports.\r\nRyan and the Dolphins have had recent talks despite their riches at cornerb… [+697 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Adrian Wojnarowski", "title": "NBA owners, execs hopeful for return after call with Adam Silver, sources say - ESPN", "description": "After a virtual meeting with NBA commissioner Adam Silver, participants on a Board of Governors call Tuesday left feeling increasingly positive about the league's momentum toward a return to play, sources told ESPN.", "url": "https://www.espn.com/nba/story/_/id/29167773/nba-owners-execs-hopeful-return-call-adam-silver", "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0430%2Fr694465_1296x729_16%2D9.jpg", "publishedAt": "2020-05-13T01:59:02Z", "content": "Participants on a Board of Governors call Tuesday with NBA commissioner Adam Silver left the virtual meeting increasingly positive about the league's momentum toward a resumption of play this season, sources told ESPN.\r\nOwners and executives on the call were … [+2556 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Joel Sherman", "title": "MLB doesn't make economic proposal in lengthy union meeting - New York Post ", "description": "MLB did not make a formal economic proposal as part of its presentation Tuesday to the Players Association on how it sees restarting the season. The sides met for 90 minutes, broke, then continued …", "url": "https://nypost.com/2020/05/12/mlb-doesnt-make-economic-proposal-in-lengthy-meeting-with-union/", "urlToImage": "https://thenypost.files.wordpress.com/2020/05/manfred.clark_.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-05-13T01:25:51Z", "content": "MLB did not make a formal economic proposal as part of its presentation Tuesday to the Players Association on how it sees restarting the season.\r\nThe sides met for 90 minutes, broke, then continued for another hour, with MLB focusing heavily on the protocols … [+4593 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Daniel Canova", "title": "Sammy Watkins talks about battle with alcohol, depression during time with Bills - Fox News", "description": "Kansas City Chiefs wide receiver Sammy Watkins, who added a Super Bowl title to his resume this past season, came along way since battling his own demons during his time with the Buffalo Bills.", "url": "https://www.foxnews.com/sports/sammy-watkins-alcohol-depression-battle-bills", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/072114-NFL-Bills-Sammy-Watkins-TV-P-34681eb5b5fa0510VgnVCM100000d7c1a8c0____.jpg", "publishedAt": "2020-05-13T00:54:53Z", "content": "Kansas City Chiefs wide receiver Sammy Watkins, who added a Super Bowl title to his resume this past season, has come along way since battling his demons during his time with the Buffalo Bills.\r\nWatkins was the No. 4 overall pick in the 2014 NFL Draft and was… [+2043 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Bob Harig", "title": "PGA Tour memo outlines safety protocols for upcoming tournaments - ESPN", "description": "The PGA Tour sent players a lengthy memo detailing the \"Health and Safety Plan\" it will have in place when the tour resumes its revised schedule next month.", "url": "https://www.espn.com/golf/story/_/id/29167510/pga-memo-outlines-safety-protocols-upcoming-tournaments", "urlToImage": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F0709%2Fr398654_1296x729_16%2D9.jpg", "publishedAt": "2020-05-13T00:46:32Z", "content": "With the PGA Tour set to resume its revised schedule next month in Texas, a lengthy memo was sent to players outlining the various procedures that will be put in place, highlighted by a testing approach that will include coronavirus testing as well as daily t… [+3832 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Heather Dinich", "title": "NCAA won't mandate uniform return to college sports, Mark Emmert says - ESPN", "description": "The NCAA won't mandate or oversee a uniform return to college sports, NCAA president Mark Emmert told ESPN on Tuesday, leaving decisions on start dates to state officials and university presidents.", "url": "https://www.espn.com/college-sports/story/_/id/29167509/ncaa-mandate-uniform-return-college-sports-mark-emmert-says", "urlToImage": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F0223%2Fr332316_1296x729_16%2D9.jpg", "publishedAt": "2020-05-13T00:44:29Z", "content": "The NCAA won't mandate or oversee a uniform return to college sports, NCAA president Mark Emmert said Tuesday, leaving decisions on start dates to state officials and university presidents.\r\nCollege athletics came to a halt in mid-March, when the NCAA cancele… [+4635 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Brendan Bianowicz", "title": "Tom Brady wants no part of Eli Manning, even on the golf course - New York Post ", "description": "With two Super Bowls each and a combined 18 Pro Bowls between them, Eli Manning has at least one leg up on his brother Peyton. He strikes fear in the heart of Tom Brady. Peyton Manning and Brady ar…", "url": "https://nypost.com/2020/05/12/tom-brady-wants-no-part-of-eli-manning-even-on-the-golf-course/", "urlToImage": "https://thenypost.files.wordpress.com/2020/05/elibrady.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-05-13T00:38:41Z", "content": "With two Super Bowls each and a combined 18 Pro Bowls between them, Eli Manning has at least one leg up on his brother Peyton. He strikes fear in the heart of Tom Brady.\r\nPeyton Manning and Brady are set to face off on the golf course alongside Tiger Woods an… [+868 chars]"}, {"source": {"id": null, "name": "Vikingsterritory.com"}, "author": "Joe Johnson", "title": "The \"Far Too Early\" 2020 Vikings Record Prediction Round-Table - Vikings Territory", "description": "The Vikings' 2020-21 schedule was recently released which was if nothing else a gigantic relief to Vikings fans and writers, who weren't entirely sure there'd be a 2020-21 NFL season to begin with. Un", "url": "https://vikingsterritory.com/2020/general-news/the-far-too-early-2020-vikings-record-prediction-round-table", "urlToImage": "https://i1.wp.com/vikingsterritory.com/wp-content/uploads/2019/10/Dalvin_Cook_DET.jpg?fit=1280%2C720&ssl=1", "publishedAt": "2020-05-13T00:37:39Z", "content": "The Vikings’ 2020-21 schedule was recently released which was if nothing else a gigantic relief to Vikings fans and writers, who weren’t entirely sure there’d be a 2020-21 NFL season to begin with. Unless you’ve been living under a rock, I mean before the sta… [+9957 chars]"}, {"source": {"id": null, "name": "247sports.com"}, "author": "Patrick Murphy", "title": "Chris Olave turning CFP mistake into motivation for 2020 season - 247Sports", "description": "The Buckeye receiver's worst play will only make him better.", "url": "https://247sports.com/college/ohio-state/Article/Ohio-State-football-Chris-Olave-turning-College-Football-Playoff-mistake-into-motivation-for-2020-season-147087269/", "urlToImage": "https://s3media.247sports.com/Uploads/Assets/896/763/9763896.jpg?fit=bounds&crop=1200:630,offset-y0.50&width=1200&height=630", "publishedAt": "2020-05-13T00:37:13Z", "content": "It was nearly a dream start to college football for Ohio State wide receiver Chris Olave. Despite coming to the program as a three-star recruit who barely made it inside the 247Sports Composite’s top 400 players in the 2018 recruiting class, Olave found his w… [+4629 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Jamie Kemble", "title": "Where Arsenal, Chelsea and Tottenham finish in two final Premier League table scenarios - Football.London", "description": "The Premier League season remains under threat despite the will to finish the current campaign", "url": "https://www.football.london/premier-league/confirmed-arsenal-chelsea-tottenham-finish-18239190", "urlToImage": "https://i2-prod.football.london/incoming/article18239139.ece/ALTERNATES/s1200/5_PremStuff.jpg", "publishedAt": "2020-05-13T00:21:34Z", "content": "The Premier League have a number of options at their disposal if it's decided the season cannot continue. \r\nAt this point, the top-flight bosses are still committed to finishing the season with the support of many of the clubs.\r\n But the possibility of the ca… [+2554 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Charean Williams", "title": "Giants offense will be similar to Jason Garrett’s in Dallas - NBCSports.com", "description": "The Giants likely won’t see the field until training camp. They have a second-year quarterback. Yet, their offense isn’t going to look a lot like it did last season. Instead, it’s going to look more like the 2019 Dallas offense with former Cowboys head coach …", "url": "https://profootballtalk.nbcsports.com/2020/05/12/giants-offense-will-be-similar-to-jason-garretts-in-dallas/", "urlToImage": "https://profootballtalk.nbcsports.com/wp-content/uploads/sites/25/2020/05/GettyImages-1185569230-e1589328753865.jpg", "publishedAt": "2020-05-13T00:18:00Z", "content": "The Giants likely won’t see the field until training camp. They have a second-year quarterback.\r\nYet, their offense isn’t going to look a lot like it did last season. Instead, it’s going to look more like the 2019 Dallas offense with former Cowboys head coach… [+1705 chars]"}, {"source": {"id": null, "name": "Fieldgulls.com"}, "author": "Tyler Alsin", "title": "Cam Newton rumors continue to feature the Seattle Seahawks - Field Gulls", "description": "The Seattle Seahawks have technically not needed a backup quarterback since they drafted Russell Wilson.  Wilson’s never missed an NFL game. He’s only ever missed two practices - both for funerals....", "url": "https://www.fieldgulls.com/2020/5/12/21256581/cam-newton-rumor-seattle-seahawks-carolina-panthers-russell-wilson-quarterback-greg-olsen-backup", "urlToImage": "https://cdn.vox-cdn.com/thumbor/YxQq34wlszkhaFc7NinGK0Zgm98=/0x273:3600x2158/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19963774/1184242245.jpg.jpg", "publishedAt": "2020-05-13T00:14:41Z", "content": "The Seattle Seahawks have technically not needed a backup quarterback since they drafted Russell Wilson. \r\nWilsons never missed an NFL game. Hes only ever missed two practices- both for funerals. While he has left a game before, it was only to return a couple… [+2080 chars]"}, {"source": {"id": null, "name": "Lookoutlanding.com"}, "author": "Kate Preusser, Tim Cantu", "title": "Compensation, safety sticking points in plan to get baseball back; Mariners baseball ops employees to take pa… - Lookout Landing", "description": "If I could put graphics in the dek I’d make a road sign-style one that said “Caution, Labor Strife Ahead”", "url": "https://www.lookoutlanding.com/2020/5/12/21256553/compensation-safety-sticking-points-in-plan-to-get-baseball-back-mariners-employees-to-take-pay-cut", "urlToImage": "https://cdn.vox-cdn.com/thumbor/nyTMsvoItJDSVyWDG3vAK3HkWN8=/0x348:4850x2887/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19963799/usa_today_14210445.jpg", "publishedAt": "2020-05-13T00:03:40Z", "content": "To catch you up if you havent been following along with the road to baseball coming back: On Monday, MLB owners unanimously approved a proposal to send to the MLBPA that outlines how the 2020 season would happen. We covered some aspects of the plan in previou… [+5243 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Andrea Adelson", "title": "MAC curtails basketball schedules, eliminates conference tournaments in other sports - ESPN", "description": "In an effort to stem the financial fallout from the coronavirus pandemic, the Mid-American Conference announced Tuesday it would alter its men's and women's basketball schedules and eliminate conference tournaments in eight sports.", "url": "https://www.espn.com/college-sports/story/_/id/29167377/mac-curtails-basketball-schedules-eliminates-conference-tournaments-other-sports", "urlToImage": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0512%2Fr698144_1296x729_16%2D9.jpg", "publishedAt": "2020-05-13T00:00:12Z", "content": "The Mid-American Conference announced Tuesday that it would change its men's and women's basketball schedules and conference tournaments and eliminate conference tournaments in eight sports beginning with the 2020-21 season, in a series of cost-cutting measur… [+1586 chars]"}, {"source": {"id": null, "name": "Nesn.com"}, "author": "https://nesn.com/ricky-doyle/", "title": "Ex-Patriots LB Reveals ‘Biggest Takeaway’ From Playing In New England - NESN", "description": "Suiting up for the New England Patriots means different things to different players. Some embrace the \"do your job\" mantra,…", "url": "https://nesn.com/2020/05/ex-patriots-lb-reveals-biggest-takeaway-from-playing-in-new-england/", "urlToImage": "https://nesn.com/wp-content/uploads/2018/02/new-england-patriots-helmet_opt.jpg", "publishedAt": "2020-05-12T23:22:55Z", "content": "Suiting up for the New England Patriots means different things to different players.\r\nSome embrace the “do your job” mantra, even if it means sacrificing individual accolades for the good of the organization, while others prefer a less disciplined approach.\r\n… [+1582 chars]"}, {"source": {"id": null, "name": "Wpxi.com"}, "author": "WPXI.com News Staff", "title": "Penguins furlough some employees for 4 months amid COVID-19 pandemic - WPXI Pittsburgh", "description": "The Pittsburgh Penguins are furloughing employees amid the COVID-19 pandemic that has caused all professional sports leagues in the U.S. to suspend their seasons.", "url": "https://www.wpxi.com/sports/nhl/pittsburgh-penguins/penguins-furlough-some-employees-4-months-amid-covid-19-pandemic/3WNMW4IWBNAM7L6KU2TVEM3T5Y/", "urlToImage": "https://d1hfln2sfez66z.cloudfront.net/05-13-2020/t_2e0ee9ee028d48fdb33197ea9e2d939b_name_7F1F5EBC46EB48519E5AC6EFB3241DCC.jpg", "publishedAt": "2020-05-12T23:21:53Z", "content": "PITTSBURGH — The Pittsburgh Penguins are furloughing employees amid the COVID-19 pandemic that has caused all professional sports leagues in the U.S. to suspend their seasons.\r\nIn a release Tuesday, communications director Tom McMillan said the franchise inst… [+2817 chars]"}, {"source": {"id": null, "name": "Abc6onyourside.com"}, "author": "Geoff Redick", "title": "Report: Columbus, Franklin County are 'locations to watch' for possible COVID-19 spike - ABC6OnYourSide.com", "description": "An \"unreleased\" report leaked from the White House this week identified both Columbus and Franklin County as \"locations to watch,\" after each reported COVID-19 case increases of more than 60% in the beginning of May. The document, first reported by NBC News, …", "url": "http://abc6onyourside.com/news/local/report-columbus-franklin-county-are-locations-to-watch-for-possible-covid-19-spike", "urlToImage": "http://static-38.sinclairstoryline.com/resources/media/45ad8e81-eb53-4996-b336-1798f76dcf84-large16x9_thumb_46954.png?1589323932100", "publishedAt": "2020-05-12T22:52:00Z", "content": null}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Paul Kasabian", "title": "Former Bears CB Prince Amukamara, Raiders Reportedly Agree to Contract - Bleacher Report", "description": "Free-agent cornerback  Prince Amukamara  has agreed to a deal with the  Las Vegas Raiders , per  Mike Garafolo  of NFL Network. Terms were not immediately disclosed...", "url": "https://bleacherreport.com/articles/2882211-former-bears-cb-prince-amukamara-raiders-reportedly-agree-to-contract", "urlToImage": "https://img.bleacherreport.net/img/images/photos/003/858/769/hi-res-6d633aadca41eb84f017b98d280ea625_crop_exact.jpg?w=1200&h=1200&q=75", "publishedAt": "2020-05-12T22:40:17Z", "content": "Charles Rex Arbogast/Associated Press\r\nFree-agent cornerback Prince Amukamara has agreed to a deal with the Las Vegas Raiders, per Mike Garafolo of NFL Network. Terms were not immediately disclosed.\r\nAmukamara, who turns 31 on June 6, had 10 pass breakups and… [+968 chars]"}, {"source": {"id": null, "name": "Theathletic.com"}, "author": "Sam Stejskal", "title": "Revealed: Details, dates of MLS's proposal to return to play in Orlando - The Athletic", "description": "The league's proposal has not yet been formally adopted and faces a significant amount of skepticism", "url": "https://theathletic.com/1810410/2020/05/12/revealed-details-dates-of-mlss-proposal-to-return-to-play-in-orlando/", "urlToImage": "https://cdn.theathletic.com/app/uploads/2020/05/12183550/USATSI_13116997-1024x683.jpg", "publishedAt": "2020-05-12T22:28:00Z", "content": "Details of Major League Soccer’s plan to return to play in a summer tournament in Orlando were revealed to The Athletic on Tuesday, with multiple sources saying that the league recently distributed a proposal to players and clubs that would see teams begin tr… [+701 chars]"}, {"source": {"id": null, "name": "247sports.com"}, "author": "Scott Eklund", "title": "BREAKING: UW sets NCAA record with 999 four-year APR - 247Sports", "description": "Husky football program sets NCAA record with 999 four-year APR...", "url": "https://247sports.com/college/washington/Article/Washington-Huskies-football-basketball-UW-sets-NCAA-record-with-999-four-year-APR-Chris-Petersen-Jimmy-Lake-Jen-Cohen-147083522/", "urlToImage": "https://s3media.247sports.com/Uploads/Assets/756/763/9763756.jpg?fit=bounds&crop=1200:630,offset-y0.50&width=1200&height=630", "publishedAt": "2020-05-12T22:17:28Z", "content": "(Photo: UW Athletics)\r\nThe Washington football team has earned a four-year NCAA Academic Progress Rate of 999 (out of a possible 1,000) for 2018-2019, the highest four-year score ever by an NCAA-FBS football program, the NCAA announced today.\r\nThe UW football… [+1632 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": null, "title": "Dorsett fixed 'mistake' by choosing Seahawks over Pats in free agency - NBCSports.com", "description": "Phillip Dorsett signed with the Seattle Seahawks in NFL free agency in March after spending the last three seasons with the New England Patriots, and it sure sounds like he regrets not making the move to the NFC West club sooner.", "url": "https://www.nbcsports.com/boston/patriots/phillip-dorsett-fixed-mistake-choosing-seahawks-over-patriots-free-agency", "urlToImage": "https://www.nbcsports.com/boston/sites/csnne/files/2020/05/12/phillip_dorsett_0.jpg", "publishedAt": "2020-05-12T22:17:03Z", "content": "Editors note: In the coming weeks our Patriots insiders will be speaking with beat writers from around the NFL to get an outside view on what the future holds for the Patriots. Todays team: The San Francisco 49ers with Matt Maiocco of NBC Sports Bay Area.\r\nTh… [+4055 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Dustin Long", "title": "How NASCAR will set lineups for Cup, Xfinity, Trucks at Darlington, Charlotte - NBC Sports - Misc.", "description": "Here is a detailed look at how NASCAR will set the lineups for the Cup, Xfinity and Truck Series races May 17-27 at Darlington and Charlotte.", "url": "https://nascar.nbcsports.com/2020/05/12/nascar-darlington-raceway-charlotte-motor-speedway-set-starting-lineups/", "urlToImage": "https://nascar.nbcsports.com/wp-content/uploads/sites/9/2020/05/GettyImages-1165619914-e1589319294892.jpg", "publishedAt": "2020-05-12T22:12:00Z", "content": "Editor’s Note: This is the first in a series of stories this week examining the key storylines as the Cup season resumes Sunday at Darlington Raceway (3:30 p.m. ET on FOX).\r\nAlthough it might feel much longer, it was only three months ago when the NASCAR seas… [+4366 chars]"}, {"source": {"id": null, "name": "Cleveland.com"}, "author": "Mary Kay Cabot, cleveland.com", "title": "ESPN’s Dan Orlovsky on Baker Mayfield: ‘He’s going to have a monster season’ - cleveland.com", "description": "ESPN analyst Dan Orlovsky, a former 13-year NFL quarterback, is confident Baker Mayfield is going to have a monster season.", "url": "https://www.cleveland.com/browns/2020/05/espns-dan-orlovsky-on-baker-mayfield-hes-going-to-have-a-monster-season.html", "urlToImage": "https://www.cleveland.com/resizer/go7DeujL4bhWXySFzXmusyPaPfc=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/YMMBXBEXSZGIRAJZBBP5BBYB5Y.jpg", "publishedAt": "2020-05-12T22:07:00Z", "content": "CLEVELAND, Ohio ESPNs Dan Orlovsky, a former 13-year NFL quarterback, is confident that Baker Mayfield will be feeling dangerous again in 2020 and that Browns fans will have plenty to cheer about.\r\nMayfield needs to rebound in 2020 for the Browns to make a pl… [+10450 chars]"}, {"source": {"id": null, "name": "247sports.com"}, "author": "Clint Buckley", "title": "Urban Meyer rips Redskins in defense of Dwayne Haskins - 247Sports", "description": "...", "url": "https://247sports.com/Article/Urban-Meyer-rips-Washington-Redskins-organization-defends-Dwayne-Haskins-Ohio-State-Buckeyes-Football-147083178/", "urlToImage": "https://s3media.247sports.com/Uploads/Assets/34/33/9033034.jpg?fit=bounds&crop=1200:630,offset-y0.50&width=1200&height=630", "publishedAt": "2020-05-12T21:57:17Z", "content": "When the Washington Redskins’ 2019 season ended, there was significant speculation about the franchise’s future at the quarterback position. That was despite the team spending a first-round pick on Dwayne Haskins the year before.\r\nMany wondered if Washington … [+2824 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Jeff Borzello", "title": "Purdue basketball player Nojel Eastern enters transfer portal - ESPN", "description": "Purdue junior Nojel Eastern, who has started 62 games over the past two seasons for the Boilermakers, has entered the transfer portal.", "url": "https://www.espn.com/mens-college-basketball/story/_/id/29167039/purdue-junior-guard-nojel-eastern-enters-transfer-portal", "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F0323%2Fr345658_1296x729_16%2D9.jpg", "publishedAt": "2020-05-12T21:47:56Z", "content": "Purdue basketball player Nojel Eastern entered the transfer portal on Tuesday, the school announced.\r\nEastern, a junior guard, was a staple in the Boilermakers' rotation during his career in West Lafayette, appearing in 37 games off the bench as a freshman an… [+657 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Chris Cwik", "title": "Charles Barkley calls out Michael Jordan for only bullying certain teammates: 'He knows who to pick on' - Yahoo Sports", "description": "Charles Barkley thinks Michael Jordan chose his targets carefully.", "url": "https://sports.yahoo.com/charles-barkley-calls-out-michael-jordan-for-only-bullying-certain-teammates-he-knows-who-to-pick-on-214422311.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/.TG9EHA4.lz5foRKcAG7UQ--~B/aD05ODM7dz0xNDY4O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-05/a077bbd0-9499-11ea-bef3-777b85aa6536", "publishedAt": "2020-05-12T21:44:00Z", "content": "Charles Barkley respects Michael Jordans ability, but not his methods. Barkley called out Jordan on Tuesday, saying Jordan only bullied certain teammates because he knew they wouldnt fight back.\r\nBarkley lobbed that criticism at Jordan during an appearance on… [+1401 chars]"}, {"source": {"id": null, "name": "Si.com"}, "author": "JAIME EISNER", "title": "Fantasy Fit: Baltimore Ravens Rookie Receiver Devin Duvernay - Sports Illustrated", "description": "Third-round draft pick could make an impact", "url": "https://www.si.com/nfl/ravens/news/duvernay-fantasy-value", "urlToImage": "https://imageproxy.themaven.net/https%3A%2F%2Fimages.saymedia-content.com%2F.image%2FMTcyNTA1ODc2NzI3MzQyMTYz%2Fusatsi_13327537.jpg?w=1024&q=40&h=683&auto=format&fit=max", "publishedAt": "2020-05-12T21:37:54Z", "content": "Bill Enright:The Baltimore Ravens selected Devin Duvernay out of Texas in the third round of the 2020 NFL draft, trying to give Lamar Jackson some new weapons and that passing attack. Let's find out what kind of fantasy fit Duvernay will be in his rookie seas… [+1684 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Loudest moments on the PGA TOUR - PGA TOUR", "description": "Check out the stereotype-breaking moments when the noise gets off the charts on the PGA TOUR from the likes of Tiger Woods, Rickie Fowler, Phil Mickelson and...", "url": "https://www.youtube.com/watch?v=zD5ocE_xt3A", "urlToImage": "https://i.ytimg.com/vi/zD5ocE_xt3A/maxresdefault.jpg", "publishedAt": "2020-05-12T21:14:31Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Alabama, TCU ADs respond to report about potential Week 1 matchup if Pac-12 teams can’t play - Saturday Down South", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMijgFodHRwczovL3d3dy5zYXR1cmRheWRvd25zb3V0aC5jb20vYWxhYmFtYS1mb290YmFsbC9hbGFiYW1hLXRjdS1hZHMtcmVzcG9uZC10by1yZXBvcnQtYWJvdXQtcG90ZW50aWFsLXdlZWstMS1tYXRjaHVwLWlmLXBhYy0xMi10ZWFtcy1jYW50LXBsYXkv0gGSAWh0dHBzOi8vd3d3LnNhdHVyZGF5ZG93bnNvdXRoLmNvbS9hbGFiYW1hLWZvb3RiYWxsL2FsYWJhbWEtdGN1LWFkcy1yZXNwb25kLXRvLXJlcG9ydC1hYm91dC1wb3RlbnRpYWwtd2Vlay0xLW1hdGNodXAtaWYtcGFjLTEyLXRlYW1zLWNhbnQtcGxheS9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-05-12T21:11:13Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Chris Haynes", "title": "Sources: NBA superstars establish united front to resume season on private conference call - Yahoo Sports", "description": "Chris Paul, the president of the players association, arranged the call that included LeBron James, Anthony Davis, Kevin Durant, Giannis Antetokounmpo, Kawhi Leonard, Stephen Curry, Damian Lillard and Russell Westbrook, sources said.", "url": "https://sports.yahoo.com/sources-nba-superstars-establish-united-front-on-private-conference-call-to-resume-season-210518262.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/JXDsr8VY6YBwgFx44oBanw--~B/aD0yNTI2O3c9MzI3MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-05/d872dbc0-9497-11ea-bbdc-82f1f4af97d6", "publishedAt": "2020-05-12T21:05:00Z", "content": "Some of the NBAs biggest superstars formed a united front to resume the 2019-20 season during a private conference call Monday, league sources told Yahoo Sports.\r\nToward the end of the call discussing the ramifications of the coronavirus pandemic, all parties… [+1731 chars]"}, {"source": {"id": null, "name": "Blazersedge.com"}, "author": "PeterSampson", "title": "Lillard, Walton, Drexler Named to Top All-Time List - Blazer's Edge", "description": "Several Trail Blazers made ESPN’s list of the top 74 NBA players of all-time", "url": "https://www.blazersedge.com/2020/5/12/21256448/lillard-walton-drexler-named-espn-all-time-list", "urlToImage": "https://cdn.vox-cdn.com/thumbor/DrMm-dEJBoPhaX4TL8CHf8iK80s=/0x652:4566x3043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19963450/1211701482.jpg.jpg", "publishedAt": "2020-05-12T20:57:13Z", "content": "ESPN has compiled a list of their top-74 NBA players of all-time, and several Trail Blazers made the list.\r\nCurrent Portland star point guard Damian Lillard squeaked in at 72:\r\n2012-20 Portland Trail Blazers\r\n24.0 PPG, 4.2 RPG, 6.5 APG, 2.9 3s PG\r\nNot many pl… [+2024 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": null, "title": "Report: Coyotes and president Ahron Cohen part ways amid league's pause - ESPN", "description": "With a critical offseason ahead in Arizona, when the Coyotes will try to sign former league MVP Taylor Hall long term, the organization and president Ahron Cohen parted ways, according to a report.", "url": "https://www.espn.com/nhl/story/_/id/29166827/coyotes-president-ahron-cohen-part-ways-amid-league-pause", "urlToImage": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0619%2Fr559005_1296x729_16%2D9.jpg", "publishedAt": "2020-05-12T20:33:08Z", "content": "GLENDALE, Ariz. -- Arizona Coyotes president and CEO Ahron Cohen is no longer with the NHL organization, The Athletic first reported on Tuesday.\r\nCohen had been with the Coyotes since being hired in 2015 as chief operating officer and chief legal officer. He … [+1081 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": null, "title": "Cavaliers' Larry Nance says it's important for NBA to crown a champion this season - ESPN", "description": "Although the Cavs won't be competing for a title, Larry Nance Jr. empathizes with players who may not get to finish what they started if the league winds up scrapping the season.", "url": "https://www.espn.com/nba/story/_/id/29166832/cavaliers-larry-nance-says-important-nba-crown-champion-season", "urlToImage": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2017%2F0412%2Fr199292_1296x729_16%2D9.jpg", "publishedAt": "2020-05-12T20:30:00Z", "content": "Associated Press4:30 PM ET2 Minute Read\r\nCleveland Cavaliers forward Larry Nance said it's important for the NBA to crown a champion in this pandemic-altered season.\r\nSpeaking on a Zoom conference call, Nance said he's cautiously optimistic about the league r… [+1352 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Nick Shepkowski", "title": "Notre Dame Football: Is Another Grad-Transfer in the Cards? - Fighting Irish Wire", "description": "Notre Dame has done a phenomenal job re-working their roster for 2020 by adding graduate-transfers who are eligible to play right away. Isaiah Pryor, a former top-100 recruit to Ohio State figures …", "url": "https://fightingirishwire.usatoday.com/2020/05/12/notre-dame-football-is-another-grad-transfer-in-the-cards/", "urlToImage": "https://usatfightingirishwire.files.wordpress.com/2019/11/img_1767.jpg?w=1024&h=576&crop=1", "publishedAt": "2020-05-12T20:26:13Z", "content": "Notre Dame has done a phenomenal job re-working their roster for 2020 by adding graduate-transfers who are eligible to play right away.\r\nIsaiah Pryor, a former top-100 recruit to Ohio State figures to challenge for a starting safety spot while Bennett Skowron… [+1153 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mark Sanchez: Tua is 'special,' talks Rodgers-Love, Packers, Joe Burrow & Herbert | NFL | THE HERD - The Herd with Colin Cowherd", "description": "Mark Sanchez joins Colin Cowherd to discuss NFL QBs. Hear why Mark thinks Tua Tagovailoa is a 'special' QB, his sit downs with Justin Herbert and Jordan Love...", "url": "https://www.youtube.com/watch?v=UZmJFvSNlGM", "urlToImage": "https://i.ytimg.com/vi/UZmJFvSNlGM/maxresdefault.jpg", "publishedAt": "2020-05-12T20:06:44Z", "content": "Mark Sanchez joins Colin Cowherd to discuss NFL QBs. Hear why Mark thinks Tua Tagovailoa is a 'special' QB, his sit downs with Justin Herbert and Jordan Love and his thoughts on how Aaron Rodgers will handle Love moving forward.\r\n#TheHerd#NFL#TuaTagovailoa#Ju… [+1325 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Saketh Kandadai", "title": "“He’s a Two Trick Pony”: Analyst Insults Stephen Curry, Calls Golden State Warriors’ Fans “Weak A**” - Essentially Sports", "description": "Radio host Adam Clanton wasn't happy with Stephen Curry being ranked high by ESPN in the list of best players and also criticized Golden State Warriors fans", "url": "https://www.essentiallysports.com/nba-news-hes-a-two-trick-pony-analyst-insults-stephen-curry-calls-golden-state-warriors-fans-weak-a/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200505153126/Steph-Curry-feature.jpeg", "publishedAt": "2020-05-12T19:54:44Z", "content": "Golden State Warriors star Stephen Curry isn’t even among the top 25 players of all-time according to radio host Adam Clanton.\r\nClanton wasn’t impressed when ESPN ranked Curry as 13th while ranking the top 74 players in NBA history. On Tuesday, ESPN released … [+2672 chars]"}, {"source": {"id": null, "name": "Sltrib.com"}, "author": "https://www.facebook.com/saltlaketribune", "title": "An 11-game, conference-only Pac-12 football schedule is on the table, and Utah's Kyle Whittingham is on board - Salt Lake Tribune", "description": "The Pac-12 is conducting media-only webinars this week with its football coaches, and it didn’t take long for one to make some waves.", "url": "https://www.sltrib.com/sports/utah-utes/2020/05/12/an-game-conference-only/", "urlToImage": "https://www.sltrib.com/resizer/Qzo31tWbY_t2C30bU_Au9UCisw8=/1200x630/filters:quality(85)/cloudfront-us-east-1.images.arcpublishing.com/sltrib/JIKZWOKWPBC5TKT6WRBKJXSNBI.JPG", "publishedAt": "2020-05-12T19:50:58Z", "content": "The Pac-12 is conducting media-only webinars this week with its football coaches, and it didnt take long for one to make some waves.\r\n On Monday afternoon, USC coach Clay Helton revealed that an 11-game, conference-only football schedule has been discussed. T… [+4356 chars]"}, {"source": {"id": null, "name": "Dallasnews.com"}, "author": "Calvin  Watkins", "title": "Donovan McNabb says Cowboys could have ‘major problem’ if they don’t pay Dak Prescott - The Dallas Morning News", "description": "The Cowboys currently have placed the exclusive franchise tag on quarterback Dak Prescott and have until July 15 to reach a long-term deal. If a new...", "url": "https://www.dallasnews.com/sports/cowboys/2020/05/12/donovan-mcnabb-says-cowboys-could-have-trouble-if-they-dont-pay-dak-prescott/", "urlToImage": "https://dmn-dallas-news-prod.cdn.arcpublishing.com/resizer/vz4r17YCy687UjqieCUTqU_OfQs=/1200x630/filters:focal(459x15:469x5):no_upscale()/cloudfront-us-east-1.images.arcpublishing.com/dmn/SBY36BGLUJGPLJKOC3XT4LWROI.jpg", "publishedAt": "2020-05-12T19:25:00Z", "content": "The Cowboys currently have placed the exclusive franchise tag on quarterback Dak Prescott and have until July 15 to reach a long-term deal.\r\nIf a new contract cant be obtained with Prescott by then, he will play with a salary of $31.5 million. Of course, the … [+1700 chars]"}, {"source": {"id": null, "name": "Cincinnati.com"}, "author": "Dave Clark", "title": "Cincinnati Bengals are best fit for free-agent quarterback Joe Flacco, per ESPN's Fowler - The Cincinnati Enquirer", "description": "Joe Flacco underwent neck surgery in April and reportedly is expected to be out until about Sept. 1.", "url": "https://www.cincinnati.com/story/sports/nfl/bengals/2020/05/12/joe-flacco-cincinnati-bengals-best-fit-qb-per-espns-fowler/3118235001/", "urlToImage": "https://www.gannett-cdn.com/presto/2018/09/14/PCIN/b463d71e-d13f-43a8-8282-3fcc6b4375b5-091318_BENGALS_KE_454.jpg?crop=1906,1066,x0,y0&width=1600&height=800&fit=bounds", "publishedAt": "2020-05-12T19:23:42Z", "content": "In an assessment by ESPN NFL analysts of the best fits for remaining 2020 free agents, reporter Jeremy Fowler suggested that former Baltimore Ravens quarterback Joe Flacco, who spent last season with the Denver Broncos, might make the most sense as a backup a… [+1236 chars]"}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": "John Canzano | The Oregonian/OregonLive", "title": "Canzano: Pac-12 vs. Pac-12 in football is a hopeful development - OregonLive", "description": "Pac-12 coaches", "url": "https://www.oregonlive.com/sports/2020/05/canzano-pac-12-vs-pac-12-in-football-is-a-hopeful-development.html", "urlToImage": "https://www.oregonlive.com/resizer/ksy9q7K0ql3OmYBILC2y0shhbgo=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/JG543NYS2VBWNJNJMWUNDUNHIE.JPG", "publishedAt": "2020-05-12T19:17:00Z", "content": "The Pac-12 is exploring all available options. That was evident on Monday in a scheduled webinar video conference featuring three of its head football coaches.\r\nClay Helton broke the news. The USC coach revealed that playing an 11-game, conference-only schedu… [+5846 chars]"}, {"source": {"id": null, "name": "Stampedeblue.com"}, "author": "Luke Schultheis", "title": "Colts OC Nick Sirianni Believes T.Y. Hilton is Poised for a Bounce Back Season in 2020 - Stampede Blue", "description": "According to his offensive coordinator Nick Sirianni, all signs point towards Indianapolis Colts star wide receiver T.Y. Hilton having a rebound season in 2020—pending his health:   “I expect a...", "url": "https://www.stampedeblue.com/2020/5/12/21256124/colts-oc-nick-sirianni-believes-t-y-hilton-is-poised-for-a-bounce-back-season-in-2020", "urlToImage": "https://cdn.vox-cdn.com/thumbor/IwnBo0y0488ezW_wg1c_9tp_J4I=/0x384:3780x2363/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19962875/1171385040.jpg.jpg", "publishedAt": "2020-05-12T19:05:36Z", "content": "According to his offensive coordinator Nick Sirianni, all signs point towards Indianapolis Colts star wide receiver T.Y. Hilton having a rebound season in 2020pending his health: \r\nI expect a great bounce back from a year where he had a lot of injuries, Siria… [+4518 chars]"}, {"source": {"id": null, "name": "Radio.com"}, "author": "https://facebook.com/929TheGame, https://facebook.com/929TheGame", "title": "Who Would Be The Atlanta Braves Designated Hitter? | 92.9 The - Talk Radio 1210 WPHT", "description": "If Major League Baseball's proposal is approved and there's a universal designated hitter, who would you want to be the DH for the Braves?", "url": "https://929thegame.radio.com/articles/who-would-be-the-atlanta-braves-designated-hitter", "urlToImage": "https://images.radio.com/wzgcfm/USATSI_12786927.jpg?width=1170&height=515&crop=1170:515,smart", "publishedAt": "2020-05-12T18:30:01Z", "content": "Major League Baseball's proposed plan to restart their 2020 was approved by team owners on Monday and is now in the hands of the MLB Player's Association for approval.\r\nHere's what some of the league's plan looks like?\r\n<ul><li>82-game regional schedule and u… [+1221 chars]"}, {"source": {"id": null, "name": "Footwearnews.com"}, "author": "Claudia Miller", "title": "Serena Williams Works Out With Venus in a Crop Top, Leggings + Black Nikes - Footwear News", "description": "The two sisters show how to warm up like a pro.", "url": "https://footwearnews.com/2020/fashion/celebrity-style/serena-williams-workout-venus-leggings-nike-1202984681/", "urlToImage": "https://pmcfootwearnews.files.wordpress.com/2020/05/serena-venus-williams-sister-tennis.jpg", "publishedAt": "2020-05-12T18:28:21Z", "content": "Serena Williams and her sister Venus Williams are turning you into a pro athlete one workout at a time.\r\nToday, the two tennis stars came together for a live backyard workout on Instagram. Serena prepped for the session in a red crop top over a nude sports br… [+1553 chars]"}, {"source": {"id": null, "name": "Atlantafalcons.com"}, "author": null, "title": "Falcons to feature John Cominsky in different role in Year 2 - AtlantaFalcons.com", "description": "Dan Quinn talks about how the Falcons will feature John Cominsky this season", "url": "https://www.atlantafalcons.com/news/falcons-to-feature-john-cominsky-in-different-role-in-year-2", "urlToImage": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_12_desktop/falcons/bwdod0ob9wf0ycsz2loz", "publishedAt": "2020-05-12T18:24:22Z", "content": "When the Atlanta Falcons selected John Cominsky in the fourth round of the 2019 NFL Draft, coach Dan Quinn had a vision for how he could feature him in his defense.\r\nAt 6-foot-5 and 285 pounds, Cominsky has the size to play inside and the speed to come off th… [+2322 chars]"}, {"source": {"id": null, "name": "Blackheartgoldpants.com"}, "author": "mattcabel", "title": "Jordan Bohannon, Jack Nunge have medical hardship waivers approved by Big Ten - Black Heart Gold Pants", "description": "Next years Iowa Basketball squad could have the potential to be contenders", "url": "https://www.blackheartgoldpants.com/2020/5/12/21256175/jordan-bohannon-jack-nunge-have-medical-hardship-waivers-approved-by-big-ten", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Yjw3YGSU4pKaMP-iOdRxGqClycY=/0x552:3800x2542/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19962945/1193739596.jpg.jpg", "publishedAt": "2020-05-12T18:19:02Z", "content": "In the midst of day after day of bad news in the real world and the sports world, Iowa fans were provided a glimmer of hope and a shining light on Tuesday afternoon, as the Iowa Athletics Department announced that the medical hardship waivers for Jordan Bohan… [+1552 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "John Sigler", "title": "Ranking the games on the 2020 Saints schedule, from most- to least-exciting - Saints Wire", "description": "Check out game-by-game score predictions from around the NFL Wires network: Buf / Mia / NE / NYJ // Bal / Cin / Cle / Pit // Hou / Ind / Jax / Ten // Den / KC / LV / LAC //// Dal / NYG / Phi / Was …", "url": "https://saintswire.usatoday.com/gallery/nfl-2020-saints-schedule-opponents-ranked/", "urlToImage": "https://usatsaintswire.files.wordpress.com/2019/02/usatsi_12029476.jpg?w=1024&h=576&crop=1", "publishedAt": "2020-05-12T17:50:03Z", "content": "Check out game-by-game score predictions from around the NFL Wires network:\r\nBuf / Mia / NE / NYJ // Bal / Cin / Cle / Pit // Hou / Ind / Jax / Ten // Den / KC / LV / LAC //// Dal / NYG / Phi / Was // Chi / Det / GB / Min // Atl / Car / NO / TB // Ari / LAR /… [+4670 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Dana White on UFC Fight Island, expects Khabib, Justin Gaethje to fight - Fox Business", "description": "UFC President Dana White on returning amid the coronavirus. Subscribe to Fox Business! https://bit.ly/2D9Cdse Watch more Fox Business Video: https://video.fo...", "url": "https://www.youtube.com/watch?v=YknUdDxThb8", "urlToImage": "https://i.ytimg.com/vi/YknUdDxThb8/maxresdefault.jpg", "publishedAt": "2020-05-12T17:37:24Z", "content": null}, {"source": {"id": null, "name": "Testudotimes.com"}, "author": "Wesley  Brown", "title": "Alabama grad transfer Galin Smith commits to Maryland basketball - Testudo Times", "description": "The Terps get some much needed front court depth.", "url": "https://www.testudotimes.com/maryland-terps-basketball/2020/5/12/21256015/alabama-grad-transfer-galin-smith-maryland-mens-basketball-front-court-depth-mark-turgeon", "urlToImage": "https://cdn.vox-cdn.com/thumbor/jOFVpFZGktTPKm_GHr0do9Lfc_A=/0x0:4302x2252/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19962774/usa_today_12345641.jpg", "publishedAt": "2020-05-12T16:25:23Z", "content": "Maryland mens basketball secured a 2020 frontcourt transfer as Alabama forward Galin Smith announced his commitment to the Terps Tuesday.\r\nThe 69, 240-pound Smith provides depth in the Maryland frontcourt that lost three players this offseason.\r\nIm really exc… [+1841 chars]"}, {"source": {"id": null, "name": "Caneswarning.com"}, "author": "Alan Rubenstein", "title": "Nick Saban’s comments to Jalen Hurts stark reality about Miami football - Canes Warning", "description": "Alabama head coach Nick Saban told former quarterback Jalen Hurts to chose Oklahoma over the Maryland and Miami football programs when he entered the trans...", "url": "https://caneswarning.com/2020/05/12/nick-sabans-comments-jalen-hurts-stark-reality-miami-football/", "urlToImage": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Fcaneswarning.com%2Fwp-content%2Fuploads%2Fgetty-images%2F2017%2F07%2F1067374562.jpeg", "publishedAt": "2020-05-12T16:07:33Z", "content": "When former Alabama quarterback Jalen Hurts entered the transfer portal in January 2019, he considered the Maryland, Oklahoma and Miami football programs as his next destination. Crimson Tide head coach Nick Saban steered Hurts towards the Sooners because tha… [+2729 chars]"}, {"source": {"id": null, "name": "Paulickreport.com"}, "author": "Churchill Downs Media Office", "title": "Churchill Releases Extended Schedule For Derby Points Races - Horse Racing News - Paulick Report", "description": "Churchill Downs Racetrack today released a preliminary list of races that could be used for the extension of the “Road to the Kentucky Derby presented by Woodford Reserve,” pending agreeable race placement by the host tracks. Additionally, the first race in t…", "url": "https://www.paulickreport.com/news/triple-crown/churchill-releases-extended-schedule-for-derby-points-races/", "urlToImage": "https://www.paulickreport.com/wp-content/uploads/2014/05/ChurchillDowns_DerbyScenic_mw_ew-0704-128x74.jpg", "publishedAt": "2020-05-12T16:02:00Z", "content": "Churchill Downs Racetrack today released a preliminary list of races that could be used for the extension of the Road to the Kentucky Derby presented by Woodford Reserve, pending agreeable race placement by the host tracks.\r\nAdditionally, the first race in th… [+3185 chars]"}, {"source": {"id": null, "name": "Miamidolphins.com"}, "author": null, "title": "Miami Dolphins Sign Four Draft Picks - MiamiDolphins", "description": "The Dolphins signed: QB Tua Tagovailoa, DT Raekwon Davis, DE Curtis Weaver and LS Blake Ferguson.", "url": "https://www.miamidolphins.com/news/tua-tagovailoa-signed-contract", "urlToImage": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_12_desktop/dolphins/we9tetxnoxzapaneksgm", "publishedAt": "2020-05-12T15:04:50Z", "content": "Tagovailoa was the fifth overall pick by Miami in the 2020 NFL draft. He was a three-year letterman (2017-19) and two-year starter at Alabama, where he set a school record with 87 career passing touchdowns. His 7,442 career passing yards were third in school … [+295 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": null, "title": "Ex-Suns coach: Tatum would be in Phoenix if it wasn't for owner - NBCSports.com", "description": "Former Suns coach Earl Watson claims he pushed hard for the team to draft Jayson Tatum in 2017 but was overruled by ownership.", "url": "https://www.nbcsports.com/boston/celtics/earl-watson-claims-suns-owner-stopped-team-drafting-jayson-tatum", "urlToImage": "https://www.nbcsports.com/boston/sites/csnne/files/2020/05/12/jayson_tatum_josh_jackson.jpg", "publishedAt": "2020-05-12T14:52:13Z", "content": "Kyrie Irving got the internet all worked up Monday by professing a desire for a 1-on-1 battle against Kemba Walker during an Instagram Live session.\r\nThe overworked punchline was to suggest that Irving would have to actually suit up against his former Celtics… [+3660 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Report: Alabama already working on deal to replace USC if the Trojans are not able to play to open 2020 season - Saturday Down South", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiZWh0dHBzOi8vd3d3LnNhdHVyZGF5ZG93bnNvdXRoLmNvbS9hbGFiYW1hLWZvb3RiYWxsL2FsYWJhbWEtdXNjLXRjdS1wYXVsLWZpbmViYXVtLXJlcGxhY2Utd2Vlay0xLWdhbWUv0gFpaHR0cHM6Ly93d3cuc2F0dXJkYXlkb3duc291dGguY29tL2FsYWJhbWEtZm9vdGJhbGwvYWxhYmFtYS11c2MtdGN1LXBhdWwtZmluZWJhdW0tcmVwbGFjZS13ZWVrLTEtZ2FtZS9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-05-12T14:10:00Z", "content": null}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Paulina Dedaj", "title": "NHL closes in on two options to resume season: report - Fox News", "description": "The NHL has reportedly closed in on two possible plans to resume the season and according to reports, the timing of when the league will be able to safely do so will determine which plan officials will execute", "url": "https://www.foxnews.com/sports/nhl-closes-in-on-two-options-to-resume-the-season-report", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/03/Capital-One-Arena.jpg", "publishedAt": "2020-05-12T13:52:50Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nThe NHL has reportedly closed in on two possible plans to resume the season and, according to reports, the timing of when the league will be able to safely do so wil… [+1842 chars]"}, {"source": {"id": null, "name": "247sports.com"}, "author": "Brad Crawford", "title": "Legal analyst explains Zion Williamson's NCAA situation - 247Sports", "description": ".", "url": "https://247sports.com/Article/Zion-Williamson-NCAA-violation-Duke-Blue-Devils-impermissible-benefits-Nike-Adidas-legal-analyst-147061371/", "urlToImage": "https://s3media.247sports.com/Uploads/Assets/66/763/9763066.png?fit=bounds&crop=1200:630,offset-y0.50&width=1200&height=630", "publishedAt": "2020-05-12T13:29:03Z", "content": "Tangled in a web of alleged improper benefits brought forth by his former agent, New Orleans Pelicans rookie Zion Williamson may not have to take the stand against Prime Sports Marketing, the company he originally signed with prior to last year's NBA Draft. A… [+2557 chars]"}, {"source": {"id": null, "name": "Tigernet.com"}, "author": "Tony Crumpton", "title": "Cardinals want Isaiah Simmons to focus on one position - TigerNet", "description": "The Arizona Cardinals got the most versatile player in last month's NFL Draft when they drafted former Clemson defender Isaiah Simmons with the No. 8 overall pi", "url": "https://www.tigernet.com/update/Cardinals-want-Isaiah-Simmons-to-focus-on-one-position-35531", "urlToImage": "http://2cic.nyc3.cdn.digitaloceanspaces.com/t/stories/20/football/simmons-camp.jpg", "publishedAt": "2020-05-12T13:16:39Z", "content": "The Arizona Cardinals got the most versatile player in last month's NFL Draft when they drafted former Clemson defender \r\nIsaiah Simmons with the No. 8 overall pick. \r\nHowever, will they use him properly to maximize his unique skillset?\r\nThe organization want… [+744 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Eric Pincus", "title": "B/R NBA GM Week: Is Joel Embiid Trade Next After Sixers (Fake) Roster Shakeup? - Bleacher Report", "description": "With a pair of blockbuster trades, the  NBA  (represented by the    B/R Fantasy League   ) is moving full steam toward a week of very hypothetical but still intriguing trade pyrotechnics, with stars already on the move and others on the block...", "url": "https://bleacherreport.com/articles/2891273-br-nba-gm-week-is-joel-embiid-trade-next-after-sixers-fake-roster-shakeup", "urlToImage": "https://img.bleacherreport.net/img/images/photos/003/867/784/hi-res-9e70a6dba9e9df784acf87ff5fb1dd3d_crop_exact.jpg?w=1200&h=1200&q=75", "publishedAt": "2020-05-12T12:53:41Z", "content": "Matt Slocum/Associated Press\r\nWith a pair of blockbuster trades, the NBA (represented by the B/R Fantasy League) is moving full steam toward a week of very hypothetical but still intriguing trade pyrotechnics, with stars already on the move and others on the … [+6240 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Greg Wyshynski", "title": "AHL after cancellation - A scoring champ, GM and two owners on what comes next - ESPN", "description": "Hockey's highest minor league ended its 2019-20 season on Monday. Here's how the future looks for various stakeholders.", "url": "https://www.espn.com/nhl/story/_/id/29163718/ahl-cancellation-scoring-champ-gm-two-owners-comes-next", "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0512%2Fr697871_1296x729_16%2D9.jpg", "publishedAt": "2020-05-12T10:49:30Z", "content": "The American Hockey League canceled the remainder of its 2019-20 season on Monday -- including the Calder Cup Playoffs -- due to the ongoing coronavirus pandemic. Like the NHL, the 31-team minor league had paused its season on March 12.\r\nAHL president and CEO… [+15597 chars]"}, {"source": {"id": null, "name": "Arrowheadpride.com"}, "author": "Tom Childs", "title": "Chiefs News: Adidas couldn’t turn down Michael Jordan and Patrick Mahomes - Arrowhead Pride", "description": "Chiefs headlines for Tuesday, May 12", "url": "https://www.arrowheadpride.com/2020/5/12/21255622/arrowheadlines-adidas-couldnt-lose-out-on-patrick-mahomes-after-turning-down-michael-jordan", "urlToImage": "https://cdn.vox-cdn.com/thumbor/S31QYmgNsM3fvIJShs62cGKEOjg=/0x473:2373x1715/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19962239/1090288160.jpg.jpg", "publishedAt": "2020-05-12T10:32:20Z", "content": "The latest\r\nHow Patrick Mahomes could be the next Michael Jordan | Arrowhead Addict\r\nEven Adidas wanted their shot at Mahomes, and they did not miss out. Despite Mahomes alma mater of Texas Tech being partnered with Under Armor and the NFLs partnership with N… [+8218 chars]"}, {"source": {"id": null, "name": "Theringer.com"}, "author": "Michael Baumann", "title": "Michael Jordan’s .202 Batting Average Is More Impressive Than It Seems - The Ringer", "description": "‘The Last Dance’ delved into MJ’s short-lived baseball career on Sunday, and though his Double-A numbers weren’t exactly “big-league material,” some believed he wasn’t far off", "url": "https://www.theringer.com/nba/2020/5/12/21255513/michael-jordan-baseball-the-last-dance", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ydOgI4azXaJ7q_S8VLJ3k4rP_uc=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19962048/jordan_baseball_202_getty_ringer.jpg", "publishedAt": "2020-05-12T10:20:00Z", "content": "On Sunday nights installment of The Last Dance, the ESPN docuseries about the rise of the Chicago Bulls, Michael Jordan retired from basketball to try his hand at baseball. It was an astonishing story back in 1994Jordan leaving the NBA at the top of his game … [+10045 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Kevin Stankiewicz", "title": "Mark Cuban: White House coronavirus safeguards need to be US norm before people feel comfortable - CNBC", "description": "\"Whatever the White House is doing for the president and vice president, that's the protocol I want to use for my employees,\" Mark Cuban told CNBC on Monday.", "url": "https://www.cnbc.com/2020/05/11/mark-cuban-white-house-coronavirus-safeguards-need-to-be-us-standard.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106195979-1571756914823rts2s7na.jpg?v=1589197973", "publishedAt": "2020-05-11T16:11:45Z", "content": "Billionaire entrepreneur Mark Cuban told CNBC on Monday that coronavirus safeguards in place at the White House need to become the norm before most Americans will feel comfortable going out again.\r\n\"We have to get to that point where the White House standard … [+3849 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "iRacing Pro Series Invitational from North Wilkesboro Speedway - NASCAR", "description": "Recap the iRacing Pro Series Invitational from iRacing Pro Series Invitational from North Wilkesboro Speedway in this full race replay. ---------- Subscribe ...", "url": "https://www.youtube.com/watch?v=P1GLMRae6BQ", "urlToImage": "https://i.ytimg.com/vi/P1GLMRae6BQ/hqdefault.jpg", "publishedAt": "2020-05-11T12:00:15Z", "content": null}]}