{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "NFL Draft 2020 trade tracker: Ravens-Patriots swap, Packers get Jordan Love and details of every trade - CBS Sports", "description": "Find out the details of every draft day trade right here", "url": "https://www.cbssports.com/nfl/draft/news/nfl-draft-2020-trade-tracker-ravens-patriots-swap-packers-get-jordan-love-and-details-of-every-trade/", "urlToImage": null, "publishedAt": "2020-04-25T02:21:00Z", "content": "While there wasn't much drama during the early stages of Thursday night's NFL Draft, things quickly got interesting after the first few picks went off the board. The 49ers were able to pull off two trades, while the Patriots -- who some thought would trade up… [+515 chars]"}, {"source": {"id": null, "name": "Windycitygridiron.com"}, "author": "Lester A. Wiltfong Jr.", "title": "Chicago Bears 2020 Draft Grades: Jaylon Johnson, CB, Utah - Windy City Gridiron", "description": "Our Senior Draft Analyst EJ Snyder is giving us his grades for the Bears selection of Utah corner Jaylon Johnson, but we want your grade too.", "url": "https://www.windycitygridiron.com/2020/4/24/21235117/chicago-bears-2020-nfl-draft-grades-jaylon-johnson-cb-utah-corner-back-second-round-pick-utah-utes", "urlToImage": null, "publishedAt": "2020-04-25T01:46:57Z", "content": "Were doing our grades a little different this year at WCG. Reason being, neither I nor our Senior Draft Analyst EJ Snyder thinks that giving a player an arbitrary letter grade before hes stepped onto the field is a fair way to gauge a prospects potential. \r\nG… [+2076 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Jenna Laine", "title": "Tampa Bay Bucs take DB Antoine Winfield Jr., whose dad played against Tom Brady - ESPN", "description": "Antoine Winfield Jr., who went to the Bucs with the No. 45 overall pick, said it was \"crazy\" to land on the same team as Tom Brady, who faced his dad, Antoine Winfield Sr., seven times in the NFL.", "url": "https://www.espn.com/nfl/draft2020/story/_/id/29096050/tampa-bay-bucs-take-db-antoine-winfield-jr-dad-played-tom-brady", "urlToImage": null, "publishedAt": "2020-04-25T01:45:53Z", "content": "TAMPA, Fla. -- Just how old is Tom Brady? Old enough to have once been intercepted by the father of his new teammate Antoine Winfield Jr., whom the Tampa Bay Buccaneers selected in the second round (No. 45) of the 2020 NFL draft Friday.\r\nOn Nov. 11, 2001, Win… [+2114 chars]"}, {"source": {"id": null, "name": "Panthers.com"}, "author": null, "title": "2020 NFL Draft: S Jeremy Chinn, Southern Illinois, Round 2, Pick 64 - Panthers.com", "description": "Carolina adds another defensive piece with its third pick of the 2020 NFL Draft after trading up to No. 64 overall.", "url": "https://www.panthers.com/news/jeremy-chinn-nfl-draft-safety-southern-illinois", "urlToImage": null, "publishedAt": "2020-04-25T01:44:18Z", "content": "The Panthers have selected safety Jeremy Chinn out of Southern Illinois at No. 64 overall in the second round of the 2020 NFL Draft. Carolina traded with Seattle to acquire the pick.\r\nChinn was a kind of wild card in the Salukis' scheme, a tremendous athlete … [+845 chars]"}, {"source": {"id": null, "name": "Buffalobills.com"}, "author": null, "title": "2020 NFL Draft: Defensive end, AJ Epenesa, Iowa, pick No. 54 - BuffaloBills.com", "description": "The Bills added a defensive lineman with their first pick of the 2020 NFL Draft.", "url": "https://www.buffalobills.com/news/aj-epenesa-nfl-draft-defensive-end-iowa", "urlToImage": null, "publishedAt": "2020-04-25T01:39:07Z", "content": "5. Culture on his arm\r\nA.J. has tattoos all up and down his right arm. They are a representation of his Samoan family roots.\r\n\"The birds, the tortoise shells, the fish, the leaves,\" Epenesa told the Iowa Gazette. \"All of these just have significant meaning in… [+104 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Brian Costello", "title": "Jets select Denzel Mims with No. 59 pick in NFL Draft 2020 - New York Post ", "description": "The Jets made their fans wait, but they got their wide receiver on Friday night. Gang Green selected Baylor wide receiver Denzel Mims in the second round with the 59th overall pick. Jets GM Joe Dou…", "url": "https://nypost.com/2020/04/24/jets-select-denzel-mims-with-no-59-pick-in-nfl-draft-2020/", "urlToImage": null, "publishedAt": "2020-04-25T01:20:43Z", "content": "The Jets made their fans wait, but they got their wide receiver on Friday night.\r\nGang Green selected Baylor wide receiver Denzel Mims in the second round with the 59th overall pick. Jets GM Joe Douglas traded back from No. 48 with the Seahawks, acquiring the… [+883 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Zach Braziller", "title": "Eagles create weird Carson Wentz dynamic with Jalen Hurts NFL Draft 2020 pick - New York Post ", "description": "In a second day stunner, Jalen Hurts is headed to the City of Brotherly Love, selected in the second round (53rd overall) by the Eagles, earlier than most experts expected him to go. The former Ala…", "url": "https://nypost.com/2020/04/24/eagles-create-weird-carson-wentz-dynamic-with-jalen-hurts-nfl-draft-2020-pick/", "urlToImage": null, "publishedAt": "2020-04-25T01:12:06Z", "content": "In a second day stunner, Jalen Hurts is headed to the City of Brotherly Love, selected in the second round (53rd overall) by the Eagles, earlier than most experts expected him to go.\r\nThe former Alabama and Oklahoma star quarterback could be Carson Wentzs bac… [+916 chars]"}, {"source": {"id": null, "name": "Turfshowtimes.com"}, "author": "Kenneth Arthur", "title": "Rams draft picks 2020: LA selects WR Van Jefferson with 57th pick - Turf Show Times", "description": "LA has now picked a running back and a receiver to open their 2020 draft", "url": "https://www.turfshowtimes.com/2020/4/24/21235097/rams-draft-van-jefferson-2020-nfl-2nd-round", "urlToImage": null, "publishedAt": "2020-04-25T01:09:47Z", "content": "The L.A. Rams have selected Florida wide receiver Van Jefferson with the 57th pick in the NFL draft. \r\nJefferson, 61, 200 pounds, started his career at Ole Miss and spent the last two years at Florida. He had 49 catches for 657 yards and six touchdowns as a f… [+1216 chars]"}, {"source": {"id": null, "name": "Dallascowboys.com"}, "author": null, "title": "2nd-Round Pick Trevon Diggs Addresses Big Need After taking WR CeeDee Lamb in the first - DallasCowboys.com", "description": "After taking WR CeeDee Lamb in the first round, the Cowboys have addressed cornerback with their second-round pick. Read how CB Trevon Diggs will fit into their defense.", "url": "https://www.dallascowboys.com/news/2nd-round-pick-trevon-diggs-addresses-big-need", "urlToImage": null, "publishedAt": "2020-04-25T00:56:15Z", "content": "The Rundown: Diggs thrived in arguably the nation's best college program and has all the tools to be a productive corner at the NFL level, with above-average height and arm length that's ideal for press coverage. The younger brother of Buffalo Bills star rece… [+1085 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Mike Reiss", "title": "New England Patriots take Kyle Dugger with first post-Tom Brady pick in 2020 NFL draft - ESPN", "description": "With their first pick in the post-Tom Brady era, the Patriots used the No. 37 overall pick in the NFL draft on Kyle Dugger, a safety out of Division II Lenoir-Rhyne.", "url": "https://www.espn.com/nfl/draft2020/story/_/id/29095828/new-england-patriots-take-kyle-dugger-first-post-tom-brady-pick-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-25T00:53:45Z", "content": "With his first pick as New England Patriots coach in the post-Tom Brady era, Bill Belichick had his dog, Nike, nearby and delivered a mild surprise by selecting small-school safety Kyle Dugger of Division II Lenoir-Rhyne University early in the second round (… [+2521 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Mike Wells", "title": "Colts trade up in NFL draft to take Wisconsin RB Jonathan Taylor - ESPN", "description": "The Colts traded up three spots during Friday's second round to select Wisconsin running back Jonathan Taylor at No. 41, giving new quarterback Philip Rivers another threat out of the backfield.", "url": "https://www.espn.com/nfl/story/_/id/29095812/colts-trade-draft-wisconsin-rb-jonathan-taylor", "urlToImage": null, "publishedAt": "2020-04-25T00:49:19Z", "content": "INDIANAPOLIS -- New Colts quarterback Philip Rivers will have another threat out of the backfield to turn to next season.\r\nThe Colts jumped three spots in the 2020 NFL draft to add to what was a top-10 rushing offense last season when they selected Wisconsin … [+3508 chars]"}, {"source": {"id": null, "name": "Fieldgulls.com"}, "author": "John P. Gilbert", "title": "Why the Seahawks selected Darrell Taylor out of Tennessee with pick 48 - Field Gulls", "description": "The Seattle Seahawks shocked not only their own fans, but observers across the league as well when they selected linebacker Jordyn Brooks out of Texas Tech in the first round of the 2020 NFL Draft....", "url": "https://www.fieldgulls.com/2020/4/24/21235429/seahawks-select-darrell-taylor-out-tennessee-with-first-of-two-second-round-picks-edge-pass-rush", "urlToImage": null, "publishedAt": "2020-04-25T00:42:59Z", "content": "The Seattle Seahawks shocked not only their own fans, but observers across the league as well when they selected linebacker Jordyn Brooks out of Texas Tech in the first round of the 2020 NFL Draft. At a position group that already has future Hall of Famer Bob… [+1064 chars]"}, {"source": {"id": null, "name": "Post-gazette.com"}, "author": "Gerry Dulac", "title": "Chase Claypool pick gives Ben Roethlisberger and the Steelers 'one more weapon' - Pittsburgh Post-Gazette", "description": "", "url": "https://www.post-gazette.com/sports/steelers/2020/04/24/steelers-2020-nfl-draft-picks-round-2-3-chase-claypool/stories/202004240125", "urlToImage": null, "publishedAt": "2020-04-25T00:36:02Z", "content": "MENU"}, {"source": {"id": null, "name": "Denverbroncos.com"}, "author": null, "title": "Broncos select wide receiver KJ Hamler with 46th-overall pick - DenverBroncos.com", "description": "The Broncos added another explosive player to their offense with their second-round pick.", "url": "https://www.denverbroncos.com/news/broncos-select-wide-receiver-kj-hamler-with-46th-overall-pick", "urlToImage": null, "publishedAt": "2020-04-25T00:14:43Z", "content": "ENGLEWOOD, Colo. The Broncos added another weapon to the offensive side of the ball during Friday's second round by drafting former Penn State wide receiver KJ Hamler with the 46th-overall pick in the 2020 NFL Draft.\r\nThe Broncos used their first-round pick, … [+573 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Ian Doyle", "title": "Only realistic way Liverpool can now lose Premier League title - Liverpool Echo", "description": "Ian Doyle discusses Liverpool, the Premier League title and the void in the latest Blood Red column", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/only-realistic-way-liverpool-can-18148023", "urlToImage": null, "publishedAt": "2020-04-25T00:08:28Z", "content": "It's all about the void for Liverpool at present.\r\nAnd we're not talking about the prospect of the Premier League season being scrapped.\r\nWell, not exclusively, at any rate.\r\nInstead, it's the huge chasm that has been left by the absence of football - and, ju… [+3501 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "James Harden's Debut For The Rockets | #NBATogetherLive Classic Game - NBA", "description": "Throwback to the first game James Harden suited up for the Houston Rockets Subscribe to the NBA: https://on.nba.com/2JX5gSN Full Game Highlights Playlist: ht...", "url": "https://www.youtube.com/watch?v=-zzSYS3DRg0", "urlToImage": null, "publishedAt": "2020-04-25T00:01:30Z", "content": null}, {"source": {"id": null, "name": "Hogshaven.com"}, "author": "Scott Jennings", "title": "Trent Williams Redskins Trade Rumors: The 49ers are interested, and the Vikings are out? - Hogs Haven", "description": "Will the saga end tonight?", "url": "https://www.hogshaven.com/2020/4/24/21235447/trent-williams-redskins-trade-rumors-the-49ers-are-interested-and-the-vikings-are-out", "urlToImage": null, "publishedAt": "2020-04-25T00:00:59Z", "content": "Another day, and another rumor surrounding the Trent Williams trade saga. The Buccaneers have been outed as a team that was interested in trading for Williams until they picked Tristan Wirfs last night. The Browns and Jets were also linked to a Trent Williams… [+1656 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Lions get an EXPLOSIVE player in D'Andre Swift with the 35th overall pick| 2020 NFL Draft - CBS Sports", "description": "With the 35th pick in the 2020 NFL Draft, the Detroit Lions select D'Andre Swift, RB from ALabama. Our CBS Sports HQ crew breaks down the selection, providin...", "url": "https://www.youtube.com/watch?v=x7eIE-ggmr8", "urlToImage": null, "publishedAt": "2020-04-24T23:53:43Z", "content": null}, {"source": {"id": null, "name": "Cincyjungle.com"}, "author": "Jason Marcum", "title": "Bengals draft Clemson Tigers’ Tee Higgins in 2020 NFL Draft - Cincy Jungle", "description": "The Bengals land a game-breaking receiver to give Joe Burrow a new toy.", "url": "https://www.cincyjungle.com/2020/4/24/21235323/bengals-draft-2020-picks-tee-higgins-clemson-tigers-football", "urlToImage": null, "publishedAt": "2020-04-24T23:29:26Z", "content": "With the 33rd overall pick in the 2020 NFL Draft, the Cincinnati Bengals have selected Clemson Tigers wide receiver Tee Higgins. \r\nThere was several reports today that the Bengals were trying to trade down from the 33rd pick, but they opted to keep the pick i… [+1205 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Ryan Gaydos", "title": "Aaron Rodgers gets Packers general manager's support despite Jordan Love selection - Fox News", "description": "The Green Bay Packers shocked the NFL world on Thursday night when they chose Utah State quarterback Jordan Love with their first-round pick with many thinking it was a slight to Aaron Rodgers.", "url": "https://www.foxnews.com/sports/aaron-rodgers-packers-general-managers-support-jordan-love-selection", "urlToImage": null, "publishedAt": "2020-04-24T23:25:59Z", "content": "The Green Bay Packers shocked the NFL world on Thursday night when they chose Utah State quarterback Jordan Love with their first-round pick with many thinking it was a slight to Aaron Rodgers.\r\nPackers General Manager Brian Gutekunst offered praise for Rodge… [+1420 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": null, "title": "Five things you might not know about 49ers draftee Aiyuk - NBCSports.com", "description": "Learn more about the former Arizona State Sun Devil.", "url": "https://www.nbcsports.com/bayarea/49ers/brandon-aiyuk-five-things-you-should-know-about-49ers-nfl-draft-pick", "urlToImage": null, "publishedAt": "2020-04-24T22:46:51Z", "content": "The 49ers' first pick in the 2020 NFL Draft surely made a good first impression on his new fan base. It helps when a family member is one of their own.\r\nSan Francisco selected defensive tackle Javon Kinlaw with the No. 14 overall pick Thursday, and his father… [+4517 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Mike Bohn", "title": "'Fight Island' update: Dana White plans beachfront octagon, shows 'up and running by June' - MMA Junkie", "description": "UFC president Dana White maintains his promise that “Fight Island” is a real thing.", "url": "https://mmajunkie.usatoday.com/2020/04/fight-island-update-dana-white-beachfront-octagon-june-events", "urlToImage": null, "publishedAt": "2020-04-24T22:02:32Z", "content": "UFC president Dana White maintains “Fight Island” is a real thing, and the venue will be prepared to host events inside two months.\r\nAlthough the location is still unknown, White insists the private island he’s secured in the wake of the coronavirus pandemic … [+1597 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "Josh Edwards", "title": "2020 NFL Draft: Live tracker, picks by team, grades, analysis, order, start time for Round 2 - CBSSports.com", "description": "CBS Sports is bringing you live updates and analysis as the 2020 NFL Draft unfolds throughout the weekend", "url": "https://www.cbssports.com/nfl/news/2020-nfl-draft-live-tracker-picks-by-team-grades-analysis-order-start-time-for-round-2/live/", "urlToImage": null, "publishedAt": "2020-04-24T22:00:00Z", "content": "Hey Dan. He crushed it from what I was told. He seemed pretty confident he was going to Philly at No. 21. \r\nLove this comment from him. \r\n\"I don't look to match myself up against anyone, to be honest. I'm just going to be the best pro I can, continue to eleva… [+361 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Gary Neville warns people are getting \"carried away\" with Man Utd target Jadon Sancho - Mirror Online", "description": "Man Utd legend Gary Neville has put Jadon Sancho's quality into context compared to some of the world's best players", "url": "https://www.mirror.co.uk/sport/football/news/gary-neville-warns-people-getting-21923589", "urlToImage": null, "publishedAt": "2020-04-24T21:41:45Z", "content": "Gary Neville claims Manchester United target Jadon Sancho is \"nowhere near\" some of the world's elite.\r\nThe Red Devils have been linked with the Borussia Dortmund star who is likely to cost around £100m.\r\nMuch is made of the Englishman's exploits in the Bunde… [+1834 chars]"}, {"source": {"id": null, "name": "Aseaofblue.com"}, "author": "Jason Marcum", "title": "NFL Rumors: Ravens interested in UK Wildcats’ Lynn Bowden - A Sea Of Blue", "description": "Lamar Jackson and Lynn Bowden in the same offense?", "url": "https://www.aseaofblue.com/2020/4/24/21235195/ravens-news-nfl-draft-rumors-lynn-bowden-lamar-jackson-uk-wildcats", "urlToImage": null, "publishedAt": "2020-04-24T21:41:03Z", "content": "Day 2 of the 2020 NFL Draft kicks off with Rounds 2-3, and the hope is multiple Kentucky Wildcats hear their names called.\r\nOffensive guard Logan Stenberg and wide receiver Lynn Bowden have been widely projected to go in the Round 3-4 range, so theres a decen… [+1255 chars]"}, {"source": {"id": null, "name": "Dailynorseman.com"}, "author": "wludford", "title": "Vikings Draft Day One Media Accolades - Daily Norseman", "description": "Media seemed to like the Vikings moves", "url": "https://www.dailynorseman.com/2020/4/24/21235178/vikings-draft-day-one-media-accolades", "urlToImage": null, "publishedAt": "2020-04-24T21:36:10Z", "content": "Day One of the NFL Draft is in the books, and it appears most media outlets like what the Vikings did, from here to Honolulu. Here are some quotes:\r\nSB Nation\r\nThe Minnesota Vikings played the first round perfectly while others did not. - Dan Kadar\r\nPro Footb… [+5723 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Charean Williams", "title": "Marquise Goodwin remains with 49ers but for how long? - NBCSports.com", "description": "The 49ers got their receiver in the first round, selecting Arizona State’s Brandon Aiyuk 25th overall. What they didn’t do was trade a veteran wideout as hoped. Marquise Goodwin, whom General Manager John Lynch thought he might trade Thursday, remains on the …", "url": "https://profootballtalk.nbcsports.com/2020/04/24/marquise-goodwin-remains-with-49ers-but-for-how-long/", "urlToImage": null, "publishedAt": "2020-04-24T21:29:00Z", "content": "The 49ers got their receiver in the first round, selecting Arizona State’s Brandon Aiyuk 25th overall. What they didn’t do was trade a veteran wideout as hoped.\r\nMarquise Goodwin, whom General Manager John Lynch thought he might trade Thursday, remains on the… [+1050 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Ryan Gaydos", "title": "Tom Brady's interactions with Buccaneers coaches doesn't jibe well with rest of NFL: report - Fox News", "description": "NFL teams are reportedly perturbed that Tom Brady is visiting Tampa Bay Buccaneers coaches amid restrictions over the coronavirus pandemic and are seeking league discipline against both parties.", "url": "https://www.foxnews.com/sports/tom-brady-interactions-buccaneers-doesnt-jive-well-nfl-report", "urlToImage": null, "publishedAt": "2020-04-24T21:14:55Z", "content": "NFL teams are reportedly perturbed that Tom Brady is visiting Tampa Bay Buccaneers coaches amid restrictions over the coronavirus pandemic and are seeking league discipline against both parties.\r\nTeams have told the league they are expecting “stern” punishmen… [+1747 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Charles Goldman", "title": "Clyde Edwards-Helaire to wear No. 25 jersey with Chiefs - Chiefs Wire", "description": "Clyde Edwards-Helaire took one of the best running back jersey numbers.", "url": "https://chiefswire.usatoday.com/2020/04/24/kansas-city-chiefs-clyde-edwards-helaire-jersey-number-25/", "urlToImage": null, "publishedAt": "2020-04-24T21:10:15Z", "content": "The Kansas City Chiefs have announced the jersey number of first-round draft pick Clyde Edwards-Helaire and it’s a good one.\r\nEdwards-Helaire wore the No. 22 jersey at LSU, but defensive back Juan Thornhill wears that number with Kansas City. Thornhill wasn’t… [+1136 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Sarah Barshop", "title": "Source - Texans begin extension talks with Deshaun Watson - ESPN", "description": "The Texans have opened preliminary extension talks with quarterback Deshaun Watson, who is eligible for a new contract for the first time this offseason.", "url": "https://www.espn.com/nfl/story/_/id/29095080/source-texans-begin-extension-talks-deshaun-watson", "urlToImage": null, "publishedAt": "2020-04-24T21:07:25Z", "content": "HOUSTON -- The Texans have engaged in \"very preliminary\" discussions with quarterback Deshaun Watson about a potential contract extension, a source told ESPN's Ed Werder.\r\nOn Friday, Houston finalized a three-year, $66 million contract extension with left tac… [+1830 chars]"}, {"source": {"id": null, "name": "Clutchpoints.com"}, "author": "Skyler Carlin", "title": "Why the Cowboys got the steal of the NFL Draft in selecting CeeDee Lamb - ClutchPoints", "description": "The first round of the 2020 NFL Draft is in the rearview mirror, with quite a few surprises taking place. However, none of them might have been as shocking as the Dallas Cowboys being able to select CeeDee Lamb with the No. 17 pick. Throughout the pre-draft p…", "url": "https://clutchpoints.com/why-the-cowboys-got-the-steal-of-the-nfl-draft-in-selecting-ceedee-lamb/", "urlToImage": null, "publishedAt": "2020-04-24T21:00:31Z", "content": "The first round of the 2020 NFL Draft is in the rearview mirror, with quite a few surprises taking place. However, none of them might have been as shocking as the Dallas Cowboysbeing able to select CeeDee Lamb with the No. 17 pick.\r\nThroughout the pre-draft p… [+2494 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Rachel Handler", "title": "The Only Good Look Is Michael Jordan’s ’90s Practice Uniform - Vulture", "description": "The Last Dance has entirely changed my quarantine wardrobe.", "url": "http://www.vulture.com/2020/04/the-last-dance-michael-jordan-practice-uniform.html", "urlToImage": null, "publishedAt": "2020-04-24T20:16:21Z", "content": "Much has been written about how we should dress while social distancing. Some people believe we should wake up every morning and put on the same clothes we would normally wear to work. These people frighten me, and I am going to move on without addressing the… [+9919 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Justin Herbert compares his game to Matt Ryan, talks Draft, Chargers, Oregon & more | NFL | THE HERD - The Herd with Colin Cowherd", "description": "Justin Herbert joins Colin Cowherd to discuss football. Hear his account of draft night, who he compares his game to, his time at Oregon as well as what he l...", "url": "https://www.youtube.com/watch?v=zbpy00fDA1k", "urlToImage": null, "publishedAt": "2020-04-24T20:02:14Z", "content": "Justin Herbert joins Colin Cowherd to discuss football. Hear his account of draft night, who he compares his game to, his time at Oregon as well as what he looks forward to joining the Los Angeles Chargers.\r\n#TheHerd#NFL#JustinHerbert#MattRyan#Chargers#NFLDra… [+1275 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Marc J. Spears", "title": "All-American Greg Brown III commits to play for the Texas Longhorns - ESPN", "description": "McDonald's All-America selection Greg Brown III announced he is following in his family's footsteps by going to the University of Texas to play basketball.", "url": "https://www.espn.com/mens-college-basketball/story/_/id/29094836/all-american-greg-brown-iii-commits-play-texas-longhorns", "urlToImage": null, "publishedAt": "2020-04-24T20:01:48Z", "content": "McDonald's All-America selection Greg Brown III announced Friday that he is following in his family's footsteps by going to the University of Texas to play basketball.\r\nBrown announced, in conjunction with ESPN The Undefeated, on Instagram that he turned down… [+2480 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Kathleen Elkins", "title": "NFL player has some blunt money advice for rookies: 'Do not live a lavish lifestyle' - CNBC", "description": "Joe Burrow and the other top NFL draft picks will make millions. Current player Byron Jones took to Twitter to offer his best money advice for the incoming rookies.", "url": "https://www.cnbc.com/2020/04/24/nfl-player-gives-his-best-money-advice-to-rookies.html", "urlToImage": null, "publishedAt": "2020-04-24T19:55:16Z", "content": "The 2020 NFL draft took place virtually on Thursday night. The Cincinnati Bengals selected former LSU standout Joe Burrow with the first pick. The 23-year-old quarterback, who is among a select few to have won the Heisman Trophy and a national championship in… [+1811 chars]"}, {"source": {"id": null, "name": "Newser.com"}, "author": "Bob Cronin", "title": "Brother of Cowboys QB Dies at 31 - Newser", "description": "Jace Prescott played college ball for Northwestern State", "url": "https://www.newser.com/story/290035/brother-of-cowboys-qb-dies-at-31.html", "urlToImage": null, "publishedAt": "2020-04-24T19:45:00Z", "content": "(Newser)\r\nJace Prescott, a former offensive lineman at Northwestern State and older brother of Dallas Cowboys quarterback Dak Prescott, died Thursday. The Cowboys announced the death, CBS Sports reports, but did not give the cause. \"He was a great kid who dom… [+691 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Jeff Risdon", "title": "Lions draft 'choose your own adventure' Day 2 mock draft - Lions Wire", "description": "Lions draft ‘choose your own adventure’ Day 2 mock draft provides several different options for each Lions pick in the 2nd and 3rd rounds", "url": "https://lionswire.usatoday.com/2020/04/24/lions-draft-choose-your-own-adventure-day-2-mock-draft/", "urlToImage": null, "publishedAt": "2020-04-24T19:15:05Z", "content": "Round 1 of the 2020 NFL Draft went as expected for the Detroit Lions. The team landed Ohio State standout CB Jeff Okudah at No. 3 overall. Now comes Friday night and Rounds 2 and 3 and the Lions’ next three selections.\r\nThere are a number of different paths t… [+2682 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Brad Keselowski breakdown: Winning moves, key decisions in first victory | Talladega Superspeedway - NASCAR", "description": "Brad Keselowski's first NASCAR Cup Series win was memorable for its thrilling, controversial conclusion. The Team Penske driver sits down to analyze and expl...", "url": "https://www.youtube.com/watch?v=8EYwW6uV6s0", "urlToImage": null, "publishedAt": "2020-04-24T19:11:42Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "1st Rd. Picks React to Being Drafted: Burrow, Tua, Love & More - NFL Media Originals", "description": "Subscribe to NFL Network: http://goo.gl/4GOLwY Check out our other channels: NFL Vault http://youtube.com/nflvault NFL Films http://www.youtube.com/nflfilms ...", "url": "https://www.youtube.com/watch?v=WP75lJS9P_c", "urlToImage": null, "publishedAt": "2020-04-24T18:15:55Z", "content": null}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "2020 NFL Draft: Four best Day 2 prop picks, including Jake Fromm, Jalen Hurts falling further than expected - CBS Sports", "description": "There's a second round trend worth paying attention to", "url": "https://www.cbssports.com/nfl/news/2020-nfl-draft-four-best-day-2-prop-picks-including-jake-fromm-jalen-hurts-falling-further-than-expected/", "urlToImage": null, "publishedAt": "2020-04-24T18:11:01Z", "content": "The San Francisco 49ers made an intelligent move on Thursday night. Sitting at No. 13, with the player they wanted on the board, Tampa Bay called. The Bucs asked if they could move up to No. 13 from No. 14 to take a player the Niners didn't want. In exchange,… [+4823 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "UFC Debut: Georges St-Pierre vs Karo Parisyan | Free Fight - UFC - Ultimate Fighting Championship", "description": "Georges St-Pierre, one of the greatest UFC fighters of all time, made his UFC debut at UFC 46 against Karo Parisyan as the featured bout of the preliminary c...", "url": "https://www.youtube.com/watch?v=_OE9thpvgr8", "urlToImage": null, "publishedAt": "2020-04-24T18:06:16Z", "content": "Georges St-Pierre, one of the greatest UFC fighters of all time, made his UFC debut at UFC 46 against Karo Parisyan as the featured bout of the preliminary card.\r\nSubscribe to get all the latest UFC content: http://bit.ly/2uJRzRR\r\nExperience UFC live with UFC… [+653 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Andersen reveals the best and worst part about isolating with Matthews - TSN", "description": "Maple Leafs goaltender Frederik Andersen joins James Duthie to talk about what isolation has been like with Auston Matthews down in Arizona. He also touches ...", "url": "https://www.youtube.com/watch?v=YMidEz7ODJo", "urlToImage": null, "publishedAt": "2020-04-24T17:30:31Z", "content": null}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Brooks Koepka Gets Quarantine Haircut From Model GF, 'It Did Not Go Well' - TMZ", "description": "\"It did not go well.\" That's how Brooks Koepka's model GF described the way she cut the PGA Tour star's hair during quarantine.", "url": "https://www.tmz.com/2020/04/23/brooks-keopka-pga-tour-jena-sims-quarantine-haircut/", "urlToImage": null, "publishedAt": "2020-04-24T17:22:17Z", "content": "\"It did not go well.\"\r\nThat's how Brooks Koepka's model GF described the way she cut the PGA Tour star's hair during quarantine ... and we gotta say, we agree -- but the whole process was at least funny as hell!!\r\nThe golf stud was in desperate need of a trim… [+842 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Michael Middlehurst-Schwartz", "title": "NFL draft 2020's best available players in second round: Grant Delpit, Laviska Shenault among top options on board - USA TODAY", "description": "There's still plenty of first-round talent available for teams on Day 2 of the NFL draft, including several promising options at safety and receiver.", "url": "https://www.usatoday.com/story/sports/nfl/draft/2020/04/24/nfl-draft-second-round-best-players-available-2020/3020500001/", "urlToImage": null, "publishedAt": "2020-04-24T17:10:28Z", "content": "SportsPulse: The first night of the NFL's virtual draft went off without a hitch and Mackenzie Salmon is here to break down the nights biggest winners and losers.\r\nUSA TODAY\r\nThere's still first-round talent awaiting teams on Day 2 of the 2020 NFL draft.\r\nThu… [+5255 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Chelsea know Arsenal are vulnerable & have to move Pierre-Emerick Aubameyang soon - Ogden | ESPN FC - ESPN UK", "description": "ESPN FC's Mark Ogden reacts to reports that Chelsea are planning to make a move on Arsenal's Pierre-Emerick Aubameyang during the summer transfer window. Ogd...", "url": "https://www.youtube.com/watch?v=cwci7EzTV-4", "urlToImage": null, "publishedAt": "2020-04-24T17:01:45Z", "content": "ESPN FC's Mark Ogden reacts to reports that Chelsea are planning to make a move on Arsenal's Pierre-Emerick Aubameyang during the summer transfer window. Ogden says despite Chelsea's interest, Aubameyang will probably have offers from bigger and better clubs.… [+171 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "PFT Draft: Biggest surprises from 2020 NFL Draft Round 1 | Pro Football Talk | NBC Sports - NBC Sports", "description": "Mike Florio and Chris Simms draft the biggest surprise moments from Round 1 of the 2020 NFL Draft, including Jordan Love to the Packers, Tua Tagovailoa to th...", "url": "https://www.youtube.com/watch?v=Zd0M7Kl7Cck", "urlToImage": null, "publishedAt": "2020-04-24T16:41:57Z", "content": null}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Jabari Young", "title": "Sports teams mull how to cover refunds and lost ticketing revenue - CNBC", "description": "The suspension of live events due to Cvoid-19 is hurting a sector in the sports world that, according to a study was projected to bring in $21.8 billion in 2023", "url": "https://www.cnbc.com/2020/04/24/sports-ticketing-will-look-different-as-teams-get-creative-without-fans.html", "urlToImage": null, "publishedAt": "2020-04-24T15:54:42Z", "content": "The seats are empty at the Amway Center in Orlando, home of the NBAs Orlando Magic, on Thursday, March 12, 2020. The NBA has suspended the season due to the coronavirus -- as have other sports.\r\nThere is a bubble on the verge of bursting throughout sports lea… [+10121 chars]"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Daniel Marland", "title": "Mike Tyson Reveals He Is Training For A Surprise Return To Boxing - SPORTbible", "description": "'Iron Mike' is stepping back into the ring and boxing fans should be excited.", "url": "https://www.sportbible.com/boxing/boxing-news-legends-mike-tyson-reveals-he-is-training-for-surprise-return-to-boxing-20200424", "urlToImage": null, "publishedAt": "2020-04-24T15:09:27Z", "content": "Mike Tyson has revealed he is training for a sensational return to boxing and plans to take part in four round exhibition fights for charity.\r\n'Iron Mike' fell to defeat against Kevin McBride back in 2005 which proved to be the final professional fight of his… [+1694 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NFL Draft 2020: Examining first-round WRs Henry Ruggs, Jerry Jeudy | Pro Football Talk | NBC Sports - NBC Sports", "description": "Mike Florio and Chris Simms take a look at the wide receivers selected in the first round of the NFL draft, including two from Alabama. #NBCSports #ProFootba...", "url": "https://www.youtube.com/watch?v=94XgiAUtv3c", "urlToImage": null, "publishedAt": "2020-04-24T14:32:47Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Henry Ruggs III: Las Vegas Raiders 12th overall pick | Career Highlights | CBS Sports - CBS Sports", "description": "With the 12th overall pick, the Las Vegas Raiders selected Henry Ruggs III in the 2020 NFL Draft. Re-live some of Ruggs' greatest moments from his career at ...", "url": "https://www.youtube.com/watch?v=PFWSPEXXEGs", "urlToImage": null, "publishedAt": "2020-04-24T13:08:48Z", "content": "With the 12th overall pick, the Las Vegas Raiders selected Henry Ruggs III in the 2020 NFL Draft. Re-live some of Ruggs' greatest moments from his career at Alabama.\r\nSUBSCRIBE TO OUR CHANNEL:https://www.youtube.com/user/CBSSports\r\nFOLLOW US ON:Facebook - htt… [+155 chars]"}, {"source": {"id": null, "name": "Milehighreport.com"}, "author": "Jeff Essary", "title": "2020 NFL Draft Profile: Boise State Tackle Ezra Cleveland - Mile High Report", "description": "Does the Boise State product go from one Broncos team to another?", "url": "https://www.milehighreport.com/2020/4/24/21234034/2020-nfl-draft-profile-ezra-cleveland", "urlToImage": null, "publishedAt": "2020-04-24T12:10:47Z", "content": "Ezra Cleveland is a durable and decorated left tackle out of Boise State. He has started 40 games at left tackle in his college career. Cleveland came in as a redshirt freshman and started every possible game in the freshman, sophomore, and junior year before… [+4027 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt, CNN", "title": "Hope Solo, former USWNT goalie, announces birth of twins - CNN", "description": "Former US goalkeeper Hope Solo and husband Jerramy Stevens have welcomed twins into the world, the soccer star announced on Thursday.", "url": "https://edition.cnn.com/2020/04/24/football/hope-solo-twins-intl-scli/index.html", "urlToImage": null, "publishedAt": "2020-04-24T09:45:38Z", "content": "(CNN)Former US goalkeeper Hope Solo and husband Jerramy Stevens have welcomed twins into the world, the soccer star announced on Thursday. \r\nFormer US Women's National Team goalkeeper and two-time Olympic gold medalist Solo announced the birth of her twins --… [+1149 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Sean Payton After Drafting Cesar Ruiz in 2020 NFL Draft | Saints Draft - New Orleans Saints", "description": "New Orleans Saints Head Coach Sean Payton talks to the media following day 1 of the 2020 NFL draft after the Saints selected Cesar Ruiz #24 overall with thei...", "url": "https://www.youtube.com/watch?v=zAJJfVl4fUA", "urlToImage": null, "publishedAt": "2020-04-24T05:59:21Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Instant Reaction: Dolphins protect Tua Tagovailoa, draft OT Austin Jackson at No. 18 | NBC Sports - NBC Sports", "description": "Peter King reacts after the Dolphins used their second first-round pick to protect Tua Tagovailoa and draft USC left tackle Austin Jackson at No. 18 overall....", "url": "https://www.youtube.com/watch?v=7jMg9qMWTjw", "urlToImage": null, "publishedAt": "2020-04-24T03:49:14Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Raiders select SPEEDSTER Henry Ruggs with the 12th overall pick | 2020 NFL Draft | CBS Sports HQ - CBS Sports", "description": "With the 12th pick in the 2020 NFL Draft, the Las Vegas Raiders select Henry Ruggs, wide receiver from Alabama. Our CBS Sports HQ crew breaks down the select...", "url": "https://www.youtube.com/watch?v=S9Bej0juDXA", "urlToImage": null, "publishedAt": "2020-04-24T02:16:50Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Instant Reaction: Arizona Cardinals take Isaiah Simmons at No. 8 | Pro Football Talk | NBC Sports - NBC Sports", "description": "Mike Florio breaks down what uber-versatile linebacker Isaiah Simmons brings to Arizona as the Cardinals draft the Clemson product at No. 8. #NBCSports #Isai...", "url": "https://www.youtube.com/watch?v=g7ia9hkYs38", "urlToImage": null, "publishedAt": "2020-04-24T02:14:41Z", "content": "Mike Florio breaks down what uber-versatile linebacker Isaiah Simmons brings to Arizona as the Cardinals draft the Clemson product at No. 8. #NBCSports#IsaiahSimmons#ArizonaCardinals» Subscribe to NBC Sports: https://www.youtube.com/nbcsports?sub...» Watch Li… [+1383 chars]"}, {"source": {"id": null, "name": "Today.com"}, "author": "Ronnie Koenig", "title": "Budweiser brings back 'whassup' commercial during coronavirus - TODAY", "description": "Former NBA stars and others unite for a reboot of the famous 'wassup' Budweiser commercial, this time with an emotional ending.", "url": "https://www.today.com/food/budweiser-brings-back-whassup-commercial-during-coronavirus-t179787", "urlToImage": null, "publishedAt": "2020-04-23T23:27:40Z", "content": "Budweiser just released a new version of its classic \"whassup\" commercial that's not only funny, but also serves as a genuinely touching public service announcement in the time of coronavirus.\r\nThe original commercial, which aired in 1999 featured a group of … [+2951 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Golf's versions of field goals - PGA TOUR", "description": "Almost like their NFL counterparts, check out these players thread the needle through some trees on course. SUBSCRIBE to PGA TOUR now: http://pgat.us/vBxcZSh...", "url": "https://www.youtube.com/watch?v=Y2QWsaAycQI", "urlToImage": null, "publishedAt": "2020-04-23T22:18:55Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Judge, Stanton, and Paxton updates from Aaron Boone and much more - YESNetwork", "description": "Yankees manager Aaron Boone on the status of Aaron Judge, Giancarlo Stanton, and James Paxton, as well as his thoughts on the punishment MLB handed the Red S...", "url": "https://www.youtube.com/watch?v=HgCi5qNcqc0", "urlToImage": null, "publishedAt": "2020-04-23T20:56:48Z", "content": "Yankees manager Aaron Boone on the status of Aaron Judge, Giancarlo Stanton, and James Paxton, as well as his thoughts on the punishment MLB handed the Red Sox and more. Subscribe for daily sports videos!\r\nYES' social media pages:TikTok: tiktok.com/@YESnetwor… [+130 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Burrow is going to Bengals no question, Tua could drop out of top 10 — Jay Glazer | NFL | THE HERD - The Herd with Colin Cowherd", "description": "Colin Cowherd is excited to talk the 2020 NFL Draft, and he brings on Jay Glazer to walk him through how he thinks things will play out tonight. First they t...", "url": "https://www.youtube.com/watch?v=k-rxcyENLIU", "urlToImage": null, "publishedAt": "2020-04-23T19:58:44Z", "content": null}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Gabe Lacques", "title": "Fans running out of patience as teams refuse refunds on tickets to postponed games - USA TODAY", "description": "Teams risk alienating fans when they wait to cancel games and offer refunds on the $1 billion in consumer capital they hold along with ticket brokers.", "url": "https://www.usatoday.com/story/sports/2020/04/23/coronavirus-fans-losing-patience-teams-refuse-ticket-refunds/3011642001/", "urlToImage": null, "publishedAt": "2020-04-23T19:05:54Z", "content": "Billy Blanks, the creator of Tae Bo, has three exercises to get your body moving during time spent at home during social distancing efforts.\r\nUSA TODAY\r\nSports fans are, by nature, loyal to a fault, and willing to put their faith in their teams with the promi… [+6762 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "On This Day: Damian Lillard CALLS GAME To Win Series! - NBA", "description": "On this day in Damian Lillard hit the game-winning three to win the series over OKC! Subscribe to the NBA: https://on.nba.com/2JX5gSN Full Game Highlights Pl...", "url": "https://www.youtube.com/watch?v=rwXz64IXsKE", "urlToImage": null, "publishedAt": "2020-04-23T19:04:53Z", "content": "On this day in Damian Lillard hit the game-winning three to win the series over OKC!\r\nSubscribe to the NBA: https://on.nba.com/2JX5gSNFull Game Highlights Playlist: https://on.nba.com/2rjGMgeFor news, stories, highlights and more, go to our official website a… [+93 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Best of Rookies - Golden State Warriors", "description": "From behind-the-scenes moments to their hustle on the court, take a look back at some of the top moments from the Warriors' rookies.", "url": "https://www.youtube.com/watch?v=7Jilhn_-tw4", "urlToImage": null, "publishedAt": "2020-04-23T19:00:02Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Lakers Have Assets To Make A Move This Offseason - Lakers Nation", "description": "Los Angeles Lakers ✔️ Help us continue to provide Lakers coverage and SUBSCRIBE: https://goo.gl/5AXSud ✔️ Our MOST POPULAR Videos: https://goo.gl/k4Xvqq Lake...", "url": "https://www.youtube.com/watch?v=xVzOVswWkss", "urlToImage": null, "publishedAt": "2020-04-23T18:45:32Z", "content": "Los Angeles Lakers\r\nHelp us continue to provide Lakers coverage and SUBSCRIBE: https://goo.gl/5AXSud\r\nOur MOST POPULAR Videos: https://goo.gl/k4Xvqq\r\nLakersNation.com on Social Media:\r\nLike on Facebook: https://goo.gl/EQ4uiG\r\nFollow us on Twitter: https://goo… [+165 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Scott Boeck", "title": "Hall of Fame broadcaster Vin Scully hospitalized after fall and is 'resting comfortably' - USA TODAY", "description": "Hall of Fame broadcaster Vin Scully, 92, was hospitalized after falling in his home on Tuesday. He is \"resting comfortably,\" the Dodgers tweeted.", "url": "https://www.usatoday.com/story/sports/mlb/dodgers/2020/04/23/vin-scully-hall-of-fame-dodgers-broadcaster-hospitalized/3012240001/", "urlToImage": null, "publishedAt": "2020-04-23T18:11:15Z", "content": "Rookie Charlie Culberson set up Scully with a two-out homer in the bottom of the 10th inning that lifted the Dodgers to a 4-3 victory and clinched the NL West division title.\r\nHall of Fame broadcaster Vin Scully was hospitalized after falling Tuesday in his S… [+1206 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "A Sky Full of Stars: 2020 LSU NFL Draft Class - LSUsports", "description": "LSU Football celebrates the 2020 NFL Draft Class with a video narrated by @Emeril Lagasse and music by @Coldplay", "url": "https://www.youtube.com/watch?v=HR4naUIiMb0", "urlToImage": null, "publishedAt": "2020-04-23T17:06:29Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "'Great' Moments From Wayne Gretzky vs. Alexander Ovechkin NHL 20 Battle - SPORTSNET", "description": "Check out some of the key moments from The Great One taking on the Great 8 in an NHL 20 battle for charity. ---------------------------------------------- Su...", "url": "https://www.youtube.com/watch?v=9YLgv_BvkaY", "urlToImage": null, "publishedAt": "2020-04-23T16:36:25Z", "content": "Check out some of the key moments from The Great One taking on the Great 8 in an NHL 20 battle for charity.---------------------------------------------- \r\nSubscribe to Sportsnet on YouTube - http://sprtsnt.ca/2paAT2L\r\nVisit Sportsnet.ca for more sports news … [+315 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NFL Draft 2020: What we want to see in first round | Pro Football Talk | NBC Sports - NBC Sports", "description": "Mike Florio and Chris Simms take turns drafting the things they are looking forward to seeing the most in the opening round of the 2020 NFL Draft. #NBCSports...", "url": "https://www.youtube.com/watch?v=S3sYz0eaBQo", "urlToImage": null, "publishedAt": "2020-04-23T15:45:55Z", "content": null}, {"source": {"id": null, "name": "Stampedeblue.com"}, "author": "Chris Shepherd", "title": "Conspiracy Report: Ballard leaks draft plan, AGAIN! - Stampede Blue", "description": "To the reader:  First, I’d like to start by saying this article is presented as a “conspiracy theory” because by definition that’s what it is. I’ve spent more than a dozen hours over the past week...", "url": "https://www.stampedeblue.com/2020/4/23/21221264/conspiracy-report-ballard-leaks-draft-plan-again", "urlToImage": null, "publishedAt": "2020-04-23T15:17:47Z", "content": "To the reader: \r\nFirst, Id like to start by saying this article is presented as a conspiracy theory because by definition thats what it is. Ive spent more than a dozen hours over the past week doing research, listening to old pressers and watching every relev… [+21989 chars]"}, {"source": {"id": null, "name": "Bigblueview.com"}, "author": "Chris Pflum", "title": "2020 NFL Draft prospect profile: Tristan Wirfs, OT, Iowa - Big Blue View", "description": "Is Wirfs the tackle for the Giants?", "url": "https://www.bigblueview.com/2020/4/23/21231202/2020-nfl-draft-prospect-profile-tristan-wirfs-ot-iowa-scouting-report-ny-giants", "urlToImage": null, "publishedAt": "2020-04-23T12:09:01Z", "content": "Throughout the process leading up to the 2020 NFL Draft there have been two constants. The first is the focus upon the offensive tackle position for the Giants in the first round, and the second is that Iowas Tristan Wirfs has been one of the tackles under he… [+5086 chars]"}]}