{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Espn.com"}, "author": "Adrian Wojnarowski", "title": "NBA owners, execs hopeful for return after call with Adam Silver, sources say - ESPN", "description": "After a virtual meeting with NBA commissioner Adam Silver, participants on a Board of Governors call Tuesday left feeling increasingly positive about the league's momentum toward a return to play, sources told ESPN.", "url": "https://www.espn.com/nba/story/_/id/29167773/nba-owners-execs-hopeful-return-call-adam-silver", "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0430%2Fr694465_1296x729_16%2D9.jpg", "publishedAt": "2020-05-13T01:59:02Z", "content": "Participants on a Board of Governors call Tuesday with NBA commissioner Adam Silver left the virtual meeting increasingly positive about the league's momentum toward a resumption of play this season, sources told ESPN.\r\nOwners and executives on the call were … [+2556 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": null, "title": "MLB owners give opening presentation on restarting season to players - ESPN", "description": "MLB's opening presentation on terms to start the season to the players' union on Tuesday did not include an economic proposal.", "url": "https://www.espn.com/mlb/story/_/id/29167541/mlb-owners-give-opening-presentation-restarting-season-players", "urlToImage": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2014%2F0130%2Fmlb_g_baseball01jr_1296x729.jpg", "publishedAt": "2020-05-13T01:24:08Z", "content": "NEW YORK -- Major League Baseball made an opening presentation to the players' union Tuesday on terms to start the coronavirus-delayed season.\r\nThe presentation did not include an economic proposal, a person familiar with the discussion told The Associated Pr… [+1548 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Mark Fischer", "title": "CC Sabathia's stunning weight loss causes Mike Francesa rant - New York Post ", "description": "Mike Francesa is unamused by CC Sabathia’s stunning weight loss that has been the talk of Yankees fans. “Everyone getting crazy about Sabathia losing weight, alright Sabathia lost weigh…", "url": "https://nypost.com/2020/05/12/ex-yankees-cc-sabathias-weight-loss-causes-mike-francesa-rant/", "urlToImage": "https://thenypost.files.wordpress.com/2020/05/mike-francesa-l-cc-sabathia.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-05-13T01:20:33Z", "content": "Mike Francesa is unamused by CC Sabathia’s stunning weight loss that has been the talk of Yankees fans.\r\n“Everyone getting crazy about Sabathia losing weight, alright Sabathia lost weight — it doesn’t mean he could pitch better,” the WFAN blowhard said on his… [+1020 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Heather Dinich", "title": "NCAA won't mandate uniform return to college sports, Mark Emmert says - ESPN", "description": "The NCAA won't mandate or oversee a uniform return to college sports, NCAA president Mark Emmert told ESPN on Tuesday, leaving decisions on start dates to state officials and university presidents.", "url": "https://www.espn.com/college-sports/story/_/id/29167509/ncaa-mandate-uniform-return-college-sports-mark-emmert-says", "urlToImage": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F0223%2Fr332316_1296x729_16%2D9.jpg", "publishedAt": "2020-05-13T00:44:29Z", "content": "The NCAA won't mandate or oversee a uniform return to college sports, NCAA president Mark Emmert said Tuesday, leaving decisions on start dates to state officials and university presidents.\r\nCollege athletics came to a halt in mid-March, when the NCAA cancele… [+4635 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Brendan Bianowicz", "title": "Tom Brady wants no part of Eli Manning, even on the golf course - New York Post ", "description": "With two Super Bowls each and a combined 18 Pro Bowls between them, Eli Manning has at least one leg up on his brother Peyton. He strikes fear in the heart of Tom Brady. Peyton Manning and Brady ar…", "url": "https://nypost.com/2020/05/12/tom-brady-wants-no-part-of-eli-manning-even-on-the-golf-course/", "urlToImage": "https://thenypost.files.wordpress.com/2020/05/elibrady.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-05-13T00:38:41Z", "content": "With two Super Bowls each and a combined 18 Pro Bowls between them, Eli Manning has at least one leg up on his brother Peyton. He strikes fear in the heart of Tom Brady.\r\nPeyton Manning and Brady are set to face off on the golf course alongside Tiger Woods an… [+868 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sami Mokbel for the Daily Mail", "title": "Premier League stars will tell clubs they will NOT return to training on Monday - Daily Mail", "description": "EXCLUSIVE: Premier League clubs will be told today that members of their squads do not intend to return on Monday. Players have already privately expressed reservations to managers.", "url": "https://www.dailymail.co.uk/sport/sportsnews/article-8311239/Premier-League-stars-tell-clubs-NOT-return-training-Monday.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/12/14/28303362-0-image-a-2_1589291437679.jpg", "publishedAt": "2020-05-13T00:34:46Z", "content": "Premier League players have informed their clubs they do not intend to report for training on Monday because of safety fears.\r\nTop-flight captains will hold a video conference call with league bosses, the PFA and Government officials at 10am on Wednesday as p… [+2565 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Charean Williams", "title": "Giants offense will be similar to Jason Garrett’s in Dallas - NBCSports.com", "description": "The Giants likely won’t see the field until training camp. They have a second-year quarterback. Yet, their offense isn’t going to look a lot like it did last season. Instead, it’s going to look more like the 2019 Dallas offense with former Cowboys head coach …", "url": "https://profootballtalk.nbcsports.com/2020/05/12/giants-offense-will-be-similar-to-jason-garretts-in-dallas/", "urlToImage": "https://profootballtalk.nbcsports.com/wp-content/uploads/sites/25/2020/05/GettyImages-1185569230-e1589328753865.jpg", "publishedAt": "2020-05-13T00:18:00Z", "content": "The Giants likely won’t see the field until training camp. They have a second-year quarterback.\r\nYet, their offense isn’t going to look a lot like it did last season. Instead, it’s going to look more like the 2019 Dallas offense with former Cowboys head coach… [+1705 chars]"}, {"source": {"id": null, "name": "Fieldgulls.com"}, "author": "Tyler Alsin", "title": "Cam Newton rumors continue to feature the Seattle Seahawks - Field Gulls", "description": "The Seattle Seahawks have technically not needed a backup quarterback since they drafted Russell Wilson.  Wilson’s never missed an NFL game. He’s only ever missed two practices - both for funerals....", "url": "https://www.fieldgulls.com/2020/5/12/21256581/cam-newton-rumor-seattle-seahawks-carolina-panthers-russell-wilson-quarterback-greg-olsen-backup", "urlToImage": "https://cdn.vox-cdn.com/thumbor/YxQq34wlszkhaFc7NinGK0Zgm98=/0x273:3600x2158/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19963774/1184242245.jpg.jpg", "publishedAt": "2020-05-13T00:14:41Z", "content": "The Seattle Seahawks have technically not needed a backup quarterback since they drafted Russell Wilson. \r\nWilsons never missed an NFL game. Hes only ever missed two practices- both for funerals. While he has left a game before, it was only to return a couple… [+2080 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "Raiders add cornerback help with signing of former first-round pick Prince Amukamara, per report - CBS Sports", "description": "Amukamara will play for his fourth team in six seasons", "url": "https://www.cbssports.com/nfl/news/raiders-add-cornerback-help-with-signing-of-former-first-round-pick-prince-amukamara-per-report/", "urlToImage": "https://sportshub.cbsistatic.com/i/r/2020/02/21/f008a866-8c75-48ac-b5ff-7491d068d826/thumbnail/1200x675/9c8261333189ef2818658522fe23980e/usatsi-13218902.jpg", "publishedAt": "2020-05-13T00:13:08Z", "content": "Prince Amukamarahas agreed to terms with the Las Vegas Raiders, according to NFL Network's Mike Garafolo and Ian Rapoport. A veteran cornerback and a former first-round pick, Amukamara had been on the open market after being released by the Bears on Feb. 21. … [+1843 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": null, "title": "Where Jimmy G lands in ranking of NFC West quarterbacks - NBCSports.com", "description": "Jimmy Garoppolo is miles ahead of Jared Goff at this point, and so is Kyler Murray for that matter.", "url": "https://www.nbcsports.com/bayarea/49ers/where-49ers-jimmy-garoppolo-lands-ranking-nfc-west-quarterbacks", "urlToImage": "https://www.nbcsports.com/bayarea/sites/csnbayarea/files/2020/05/12/jimmygwilsonusatsi.jpg", "publishedAt": "2020-05-12T23:51:02Z", "content": "Caesars Sportsbook released their MVP odds for the 2020 NFL season, and it doesnt come as a surprise that Kansas City Chiefs QB Patrick Mahomes is the favorite at 4-1 ($100 bet wins $400).\r\nBut what about Mahomes' Super Bowl counterpart, 49ers QB Jimmy Garopp… [+4243 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Chris Simms: 'Dak Prescott is not a top 5 quarterback to me' | Chris Simms Unbuttoned | NBC Sports - NBC Sports", "description": "Lamar Jackson, Russell Wilson, Patrick Mahomes, Aaron Rodgers and Deshaun Watson comprise Chris Simms' top 5 quarterbacks in the NFL, and he has \"no doubt\" t...", "url": "https://www.youtube.com/watch?v=ZMBUt9_4A80", "urlToImage": "https://i.ytimg.com/vi/ZMBUt9_4A80/maxresdefault.jpg", "publishedAt": "2020-05-12T23:39:46Z", "content": "Lamar Jackson, Russell Wilson, Patrick Mahomes, Aaron Rodgers and Deshaun Watson comprise Chris Simms' top 5 quarterbacks in the NFL, and he has \"no doubt\" that Dak Prescott slots somewhere in the 6-9 range. #NBCSports#ChrisSimmsUnbuttoned#DakPrescott» Subscr… [+1325 chars]"}, {"source": {"id": null, "name": "Nesn.com"}, "author": "https://nesn.com/ricky-doyle/", "title": "Ex-Patriots LB Reveals ‘Biggest Takeaway’ From Playing In New England - NESN", "description": "Suiting up for the New England Patriots means different things to different players. Some embrace the \"do your job\" mantra,…", "url": "https://nesn.com/2020/05/ex-patriots-lb-reveals-biggest-takeaway-from-playing-in-new-england/", "urlToImage": "https://nesn.com/wp-content/uploads/2018/02/new-england-patriots-helmet_opt.jpg", "publishedAt": "2020-05-12T23:22:55Z", "content": "Suiting up for the New England Patriots means different things to different players.\r\nSome embrace the “do your job” mantra, even if it means sacrificing individual accolades for the good of the organization, while others prefer a less disciplined approach.\r\n… [+1582 chars]"}, {"source": {"id": null, "name": "Theathletic.com"}, "author": "Sam Stejskal", "title": "Revealed: Details, dates of MLS's proposal to return to play in Orlando - The Athletic", "description": "The league's proposal has not yet been formally adopted and faces a significant amount of skepticism", "url": "https://theathletic.com/1810410/2020/05/12/revealed-details-dates-of-mlss-proposal-to-return-to-play-in-orlando/", "urlToImage": "https://cdn.theathletic.com/app/uploads/2020/05/12183550/USATSI_13116997-1024x683.jpg", "publishedAt": "2020-05-12T22:28:00Z", "content": "Details of Major League Soccer’s plan to return to play in a summer tournament in Orlando were revealed to The Athletic on Tuesday, with multiple sources saying that the league recently distributed a proposal to players and clubs that would see teams begin tr… [+701 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Charean Williams", "title": "Fletcher Cox to Darius Slay: If you want to win, come to Philly - NBCSports.com", "description": "Fletcher Cox and Darius Slay first met on a recruiting trip to Mississippi State. They were teammates for two seasons there after Slay went the JUCO route first. Cox can’t wait to have Slay as a teammate again after the Eagles acquired the cornerback in a tra…", "url": "https://profootballtalk.nbcsports.com/2020/05/12/fletcher-cox-to-darius-slay-if-you-want-to-win-come-to-philly/", "urlToImage": "https://profootballtalk.nbcsports.com/wp-content/uploads/sites/25/2020/05/GettyImages-1198109020-e1589322458494.jpg", "publishedAt": "2020-05-12T22:28:00Z", "content": "Fletcher Cox and Darius Slay first met on a recruiting trip to Mississippi State. They were teammates for two seasons there after Slay went the JUCO route first.\r\nCox can’t wait to have Slay as a teammate again after the Eagles acquired the cornerback in a tr… [+989 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Could TCU face Alabama at AT&T Stadium to start 2020 season? - Fort Worth Star-Telegram", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiZGh0dHBzOi8vd3d3LnN0YXItdGVsZWdyYW0uY29tL3Nwb3J0cy9jb2xsZWdlL2JpZy0xMi90ZXhhcy1jaHJpc3RpYW4tdW5pdmVyc2l0eS9hcnRpY2xlMjQyNjcxMjIxLmh0bWzSAQA?oc=5", "urlToImage": null, "publishedAt": "2020-05-12T22:19:18Z", "content": null}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Daniel Canova", "title": "Steve Nash remembers asking Michael Jordan for his sneakers during a game in 1996 - Fox News", "description": "All-time great point guard Steve Nash recalled the first time he went toe-to-toe with Michael Jordan in 1996. Nash, who was a rookie that season with the Phoenix Suns, faced the Chicago Bulls twice in the first month of the season.", "url": "https://www.foxnews.com/sports/steve-nash-michael-jordan-sneakers-game-in-1996", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/pi-nba-suns-steve-nash-062614.vresi-1750861fa13ce410VgnVCM100000d7c1a8c0____.jpg", "publishedAt": "2020-05-12T22:14:03Z", "content": "All-time great point guard Steve Nash recalled the first time he went toe-to-toe with Michael Jordan in 1996. Nash, who was a rookie with the Phoenix Suns, faced the Chicago Bulls twice in the first month of the season.\r\nIn an interview with TNT, Nash remembe… [+954 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Dustin Long", "title": "How NASCAR will set lineups for Cup, Xfinity, Trucks at Darlington, Charlotte - NBC Sports - Misc.", "description": "Here is a detailed look at how NASCAR will set the lineups for the Cup, Xfinity and Truck Series races May 17-27 at Darlington and Charlotte.", "url": "https://nascar.nbcsports.com/2020/05/12/nascar-darlington-raceway-charlotte-motor-speedway-set-starting-lineups/", "urlToImage": "https://nascar.nbcsports.com/wp-content/uploads/sites/9/2020/05/GettyImages-1165619914-e1589319294892.jpg", "publishedAt": "2020-05-12T22:12:00Z", "content": "Editor’s Note: This is the first in a series of stories this week examining the key storylines as the Cup season resumes Sunday at Darlington Raceway (3:30 p.m. ET on FOX).\r\nAlthough it might feel much longer, it was only three months ago when the NASCAR seas… [+4366 chars]"}, {"source": {"id": null, "name": "Profootballrumors.com"}, "author": null, "title": "Dolphins Still Interested In Logan Ryan? - profootballrumors.com", "description": "The team with two cornerbacks signed for more than $15MM per year may still have interest in adding another veteran. &hellip;", "url": "https://www.profootballrumors.com/2020/05/dolphins-still-interested-in-logan-ryan", "urlToImage": "https://cdn.profootballrumors.com/files/2018/12/Logan-Ryan-1024x659.jpg", "publishedAt": "2020-05-12T22:07:00Z", "content": "The team with two cornerbacks signed for more than $15MM per year may still have interest in adding another veteran. The Dolphins are still in the mix for Logan Ryan, Mike Garafolo of NFL.com notes (video link).\r\nRyan and the Dolphins have engaged in recent d… [+1542 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Nick Shepkowski", "title": "Notre Dame to Limit Attendance for 2020 Home Football Games - Fighting Irish Wire", "description": "Notre Dame spent a large chunk of their Tuesday raising money with “The Fight” which raised money for students whose families have been effected by Covid-19. The stars of the Notre Dame…", "url": "https://fightingirishwire.usatoday.com/2020/05/12/notre-dame-to-limit-attendance-for-2020-home-football-games/", "urlToImage": "https://usatfightingirishwire.files.wordpress.com/2020/05/usatsi_10373571.jpg?w=1024&h=576&crop=1", "publishedAt": "2020-05-12T21:51:02Z", "content": "Notre Dame spent a large chunk of their Tuesday raising money with “The Fight” which raised money for students whose families have been effected by Covid-19.\r\nThe stars of the Notre Dame community aligned with Brian Kelly, Pat Connaughton, Mike Brey and plent… [+1786 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Shalise Manza Young", "title": "Twitter trolls directed their vitriol at WNBA star Breanna Stewart for stating a simple truth - Yahoo Sports", "description": "Stewart was responding to media personality Joe Budden after he seemed to forget about the WNBA.", "url": "https://sports.yahoo.com/wnba-breanna-stewart-twitter-joe-budden-seattle-215007860.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/ood5R8.30y1YmVS7NPIWmQ--~B/aD0zNTIxO3c9NTA1NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-05/02636670-9498-11ea-bf8b-04b9cdad53fc", "publishedAt": "2020-05-12T21:50:00Z", "content": "Tired, tired, tired.\r\nThe online comments about womens sports not being real sports or female athletes not being real athletes are tired.\r\nNot to mention unnecessary, ridiculous, demeaning, and flat-out sexist.\r\nOn Monday, Seattle Storm star Breanna Stewart r… [+3940 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Jeff Borzello", "title": "Purdue basketball player Nojel Eastern enters transfer portal - ESPN", "description": "Purdue junior Nojel Eastern, who has started 62 games over the past two seasons for the Boilermakers, has entered the transfer portal.", "url": "https://www.espn.com/mens-college-basketball/story/_/id/29167039/purdue-junior-guard-nojel-eastern-enters-transfer-portal", "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F0323%2Fr345658_1296x729_16%2D9.jpg", "publishedAt": "2020-05-12T21:47:56Z", "content": "Purdue basketball player Nojel Eastern entered the transfer portal on Tuesday, the school announced.\r\nEastern, a junior guard, was a staple in the Boilermakers' rotation during his career in West Lafayette, appearing in 37 games off the bench as a freshman an… [+657 chars]"}, {"source": {"id": null, "name": "Si.com"}, "author": "Luke  Patterson", "title": "Six Veterans Broncos Need to Step Up as Leaders in 2020 - Sports Illustrated", "description": "Whether Vic Fangio chooses to roll with pre-selected team captains or not, here are the six veterans the Broncos need to stand up and lead the locker room in 2020.", "url": "https://www.si.com/nfl/broncos/news/six-veterans-denver-broncos-need-to-step-up-as-leaders-in-2020", "urlToImage": "https://imageproxy.themaven.net/https%3A%2F%2Fimages.saymedia-content.com%2F.image%2FMTY3MjY4NTY4OTEwNTM3OTI3%2Fusatsi_13438617_168388302_lowres.jpg?w=1024&q=40&h=682&auto=format&fit=max", "publishedAt": "2020-05-12T21:46:00Z", "content": "Denver Broncos' GM John Elway has stressed the significance of character and leadership during the 2020 NFL offseason. To support his philosophy, Elway has made various moves via trade, free agency, and the NFL Draft to bring talent and a competitive culture … [+11236 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "UFC Jacksonville: Weigh-in Faceoffs - UFC - Ultimate Fighting Championship", "description": "The UFC Jacksonville fighters faced off after today's rare Tuesday weigh-in for tomorrow's Fight Night event. Subscribe to get all the latest UFC content: ht...", "url": "https://www.youtube.com/watch?v=Kg2jgfAqFwk", "urlToImage": "https://i.ytimg.com/vi/Kg2jgfAqFwk/maxresdefault.jpg", "publishedAt": "2020-05-12T21:41:40Z", "content": "The UFC Jacksonville fighters faced off after today's rare Tuesday weigh-in for tomorrow's Fight Night event.\r\nSubscribe to get all the latest UFC content: http://bit.ly/2uJRzRR\r\nExperience UFC live with UFC FIGHT PASS, the digital subscription service of the… [+601 chars]"}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "Anthony Holzman-Escareno", "title": "All-Paid Team of Tomorrow: Next big contracts - NFL.com", "description": "Patrick Mahomes will become the NFL's highest-paid player but what's his price tag? Is a lucrative contract in Jamal Adams' future? Anthony Holzman-Escareno projects which players will reset the market at their respective positions.", "url": "http://www.nfl.com/news/story/0ap3000001113576/article/allpaid-team-of-tomorrow-projecting-next-big-nfl-contracts", "urlToImage": "http://static.nfl.com/static/content/public/photo/2020/05/12/0ap3000001113577_thumbnail_200_150.jpg", "publishedAt": "2020-05-12T21:18:00Z", "content": "As player salaries rightfully continue to trend in the same direction of the salary cap, which has grown from $120.4 million in 2011 to $198.2 million in 2020, new contract precedents are being set around the NFL with regularity.\r\nWe dropped the 2020 All-Paid… [+27204 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Loudest moments on the PGA TOUR - PGA TOUR", "description": "Check out the stereotype-breaking moments when the noise gets off the charts on the PGA TOUR from the likes of Tiger Woods, Rickie Fowler, Phil Mickelson and...", "url": "https://www.youtube.com/watch?v=zD5ocE_xt3A", "urlToImage": "https://i.ytimg.com/vi/zD5ocE_xt3A/maxresdefault.jpg", "publishedAt": "2020-05-12T21:14:31Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Chris Haynes", "title": "Sources: NBA superstars establish united front to resume season on private conference call - Yahoo Sports", "description": "Chris Paul, the president of the players association, arranged the call that included LeBron James, Anthony Davis, Kevin Durant, Giannis Antetokounmpo, Kawhi Leonard, Stephen Curry, Damian Lillard and Russell Westbrook, sources said.", "url": "https://sports.yahoo.com/sources-nba-superstars-establish-united-front-on-private-conference-call-to-resume-season-210518262.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/JXDsr8VY6YBwgFx44oBanw--~B/aD0yNTI2O3c9MzI3MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-05/d872dbc0-9497-11ea-bbdc-82f1f4af97d6", "publishedAt": "2020-05-12T21:05:00Z", "content": "Some of the NBAs biggest superstars formed a united front to resume the 2019-20 season during a private conference call Monday, league sources told Yahoo Sports.\r\nToward the end of the call discussing the ramifications of the coronavirus pandemic, all parties… [+1731 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": null, "title": "Cavaliers' Larry Nance says it's important for NBA to crown a champion this season - ESPN", "description": "Although the Cavs won't be competing for a title, Larry Nance Jr. empathizes with players who may not get to finish what they started if the league winds up scrapping the season.", "url": "https://www.espn.com/nba/story/_/id/29166832/cavaliers-larry-nance-says-important-nba-crown-champion-season", "urlToImage": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2017%2F0412%2Fr199292_1296x729_16%2D9.jpg", "publishedAt": "2020-05-12T20:32:30Z", "content": "Cleveland Cavaliers forward Larry Nance said it's important for the NBA to crown a champion in this pandemic-altered season.\r\nSpeaking on a Zoom conference call, Nance said he's cautiously optimistic about the league resuming after pausing play for two months… [+1311 chars]"}, {"source": {"id": null, "name": "Cleveland.com"}, "author": "Ellis L. Williams, cleveland.com", "title": "Is an offensive regression looming for Baltimore? What does it mean for the Cleveland Browns? - cleveland.com", "description": "Baltimore took the league by storm last year but the Ravens are poised for an offensive regression in 2020.", "url": "https://www.cleveland.com/browns/2020/05/is-an-offensive-regression-looming-for-baltimore-what-does-it-mean-for-the-cleveland-browns.html", "urlToImage": "https://www.cleveland.com/resizer/XwmDFYrGxnPnOmL2f2VG3nZZWJA=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/OPZCLIM7ZVEV7BLXDLPHKZQIUE.JPG", "publishedAt": "2020-05-12T20:17:00Z", "content": "CLEVELAND, Ohio -- The Baltimore Ravens are favored to win the AFC North and deservingly so. Trailing only Kansas City, the Ravens are a prime Vegas pick to win both the AFC championship and the Super Bowl. That trend continues in the MVP race as Patrick Maho… [+8889 chars]"}, {"source": {"id": null, "name": "Wtol.com"}, "author": null, "title": "Major changes coming to Mid-American Conference - WTOL", "description": "The MAC will be eliminating the postseason tournaments for multiple sports and are making adjustments to men’s and women’s basketball, and volleyball in 2021.", "url": "https://www.wtol.com/article/sports/major-changes-coming-to-mid-american-conference/512-0e4f0d45-546b-432f-89a1-67a5a6d8fe3c", "urlToImage": "https://media.wtol.com/assets/WTOL/images/d9e5cb8b-d342-4e20-b725-0461216a45b9/d9e5cb8b-d342-4e20-b725-0461216a45b9_1140x641.jpg", "publishedAt": "2020-05-12T20:14:00Z", "content": "The Mid-American Conference will be eliminating the postseason tournaments for multiple sports and they are making adjustments to mens and womens basketball, and Volleyball starting with the 2021 season.\r\nMAC Commissioner Jon Steinbrecher confirmed to WTOL th… [+1115 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Zachary Neel", "title": "Dwayne Haskins is 'fired up' to play with the two Antonio's in Washington - Redskins Wire", "description": "The Redskins added both Antonio Gibson and Antonio Gandy-Golden in the draft, which has Haskins fired up for the season to start.", "url": "https://redskinswire.usatoday.com/2020/05/12/haskins-excited-for-antonios-in-washington/", "urlToImage": "https://usatredskinswire.files.wordpress.com/2019/08/gettyimages-1161845719.jpg?w=1024&h=576&crop=1", "publishedAt": "2020-05-12T20:10:02Z", "content": "Throughout the 2019 NFL season, there weren’t many places for Washington Redskins quarterback Dwayne Haskins to go with the ball. That’s not to say that he would have been able to perfectly get the ball to his weapons had there been more targets, but outside … [+1135 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mark Sanchez: Tua is 'special,' talks Rodgers-Love, Packers, Joe Burrow & Herbert | NFL | THE HERD - The Herd with Colin Cowherd", "description": "Mark Sanchez joins Colin Cowherd to discuss NFL QBs. Hear why Mark thinks Tua Tagovailoa is a 'special' QB, his sit downs with Justin Herbert and Jordan Love...", "url": "https://www.youtube.com/watch?v=UZmJFvSNlGM", "urlToImage": "https://i.ytimg.com/vi/UZmJFvSNlGM/maxresdefault.jpg", "publishedAt": "2020-05-12T20:06:44Z", "content": "Mark Sanchez joins Colin Cowherd to discuss NFL QBs. Hear why Mark thinks Tua Tagovailoa is a 'special' QB, his sit downs with Justin Herbert and Jordan Love and his thoughts on how Aaron Rodgers will handle Love moving forward.\r\n#TheHerd#NFL#TuaTagovailoa#Ju… [+1325 chars]"}, {"source": {"id": null, "name": "Thelandryhat.com"}, "author": "Tyrone Starr", "title": "The Dallas Cowboys are mishandling Dak Prescott’s contract - The Landry Hat", "description": "Despite a positive offseason, unnecessary drama surrounds the Dallas Cowboys. Here's how the organization is mishandling the biggest piece of the puzzle. B...", "url": "https://thelandryhat.com/2020/05/12/dallas-cowboys-mishandling-dak-prescotts-contract/", "urlToImage": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Fthelandryhat.com%2Fwp-content%2Fuploads%2Fgetty-images%2F2019%2F08%2F1160859693.jpeg", "publishedAt": "2020-05-12T20:00:00Z", "content": "By all measures, the Dallas Cowboys have had a pretty successful offseason. From the moment the 2019 season ended with yet another 8-8 campaign, the team has made several moves to point themselves in the right direction.\r\nIt all started by getting out from un… [+5317 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": null, "title": "Former NBA guard Mo Williams named Alabama State head coach - ESPN", "description": "Mo Williams, a 13-year NBA veteran and member of the Cavs' 2015-16 championship team, has been hired as the new head coach at Alabama State.", "url": "https://www.espn.com/mens-college-basketball/story/_/id/29166761/former-nba-guard-mo-williams-named-alabama-state-head-coach", "urlToImage": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2015%2F1110%2Fr24659_1296x729_16%2D9.jpg", "publishedAt": "2020-05-12T19:56:34Z", "content": "Alabama State named former NBA point guard Mo Williams as its head coach Tuesday.\r\n\"It's a great day to be a Hornet,\" Williams said. \"I am extremely excited to become part of the family, and I am looking forward to the challenge. Go Hornets!\"\r\nIt's a great da… [+1423 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Saketh Kandadai", "title": "“He’s a Two Trick Pony”: Analyst Insults Stephen Curry, Calls Golden State Warriors’ Fans “Weak A**” - Essentially Sports", "description": "Radio host Adam Clanton wasn't happy with Stephen Curry being ranked high by ESPN in the list of best players and also criticized Golden State Warriors fans", "url": "https://www.essentiallysports.com/nba-news-hes-a-two-trick-pony-analyst-insults-stephen-curry-calls-golden-state-warriors-fans-weak-a/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200505153126/Steph-Curry-feature.jpeg", "publishedAt": "2020-05-12T19:54:44Z", "content": "Golden State Warriors star Stephen Curry isn’t even among the top 25 players of all-time according to radio host Adam Clanton.\r\nClanton wasn’t impressed when ESPN ranked Curry as 13th while ranking the top 74 players in NBA history. On Tuesday, ESPN released … [+2672 chars]"}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": "John Canzano | The Oregonian/OregonLive", "title": "Canzano: Pac-12 vs. Pac-12 in football is a hopeful development - OregonLive", "description": "Pac-12 coaches", "url": "https://www.oregonlive.com/sports/2020/05/canzano-pac-12-vs-pac-12-in-football-is-a-hopeful-development.html", "urlToImage": "https://www.oregonlive.com/resizer/ksy9q7K0ql3OmYBILC2y0shhbgo=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/JG543NYS2VBWNJNJMWUNDUNHIE.JPG", "publishedAt": "2020-05-12T19:17:00Z", "content": "The Pac-12 is exploring all available options. That was evident on Monday in a scheduled webinar video conference featuring three of its head football coaches.\r\nClay Helton broke the news. The USC coach revealed that playing an 11-game, conference-only schedu… [+5846 chars]"}, {"source": {"id": null, "name": "Stampedeblue.com"}, "author": "Luke Schultheis", "title": "Colts OC Nick Sirianni Believes T.Y. Hilton is Poised for a Bounce Back Season in 2020 - Stampede Blue", "description": "According to his offensive coordinator Nick Sirianni, all signs point towards Indianapolis Colts star wide receiver T.Y. Hilton having a rebound season in 2020—pending his health:   “I expect a...", "url": "https://www.stampedeblue.com/2020/5/12/21256124/colts-oc-nick-sirianni-believes-t-y-hilton-is-poised-for-a-bounce-back-season-in-2020", "urlToImage": "https://cdn.vox-cdn.com/thumbor/IwnBo0y0488ezW_wg1c_9tp_J4I=/0x384:3780x2363/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19962875/1171385040.jpg.jpg", "publishedAt": "2020-05-12T19:05:36Z", "content": "According to his offensive coordinator Nick Sirianni, all signs point towards Indianapolis Colts star wide receiver T.Y. Hilton having a rebound season in 2020pending his health: \r\nI expect a great bounce back from a year where he had a lot of injuries, Siria… [+4518 chars]"}, {"source": {"id": null, "name": "247sports.com"}, "author": "Jaylon Thompson", "title": "Report: Brandon Jones agrees to terms with Miami Dolphins - 247Sports", "description": "...", "url": "https://247sports.com/Article/Former-Texas-Longhorns-safety-Brandon-Jones-agrees-to-terms-with-the-Miami-Dolphins-147073703/", "urlToImage": "https://s3media.247sports.com/Uploads/Assets/123/507/9507123.jpg?fit=bounds&crop=1200:630,offset-y0.50&width=1200&height=630", "publishedAt": "2020-05-12T18:27:56Z", "content": "The Miami Dolphins continue to sign members of their 2020 NFL Draft class. On Tuesday, reports circulated that the Dolphins have agreed to terms with former Texas Longhorns safety Brandon Jones.\r\nThe Dolphins selected Jones in the third round in the NFL Draft… [+2826 chars]"}, {"source": {"id": null, "name": "Mlbtraderumors.com"}, "author": "Jeff Todd", "title": "Examining The Red Sox' Potential Trade Chips - MLB Trade Rumors", "description": "As we noted earlier today, the potential 2020 season will bring a host of new rules governing player transactions. We &hellip;", "url": "https://www.mlbtraderumors.com/2020/05/examining-the-red-sox-potential-trade-chips.html", "urlToImage": "https://cdn.mlbtraderumors.com/files/2020/01/centeno-redsox-1024x700.jpg", "publishedAt": "2020-05-12T18:22:30Z", "content": "As we noted earlier today, the potential 2020 season will bring a host of new rules governing player transactions. We haven’t heard anything yet regarding how that’ll take place. But supposing there’s an opportunity at some point to strike trades, it’s quite … [+5090 chars]"}, {"source": {"id": null, "name": "Arizonasports.com"}, "author": "Kevin Zimmerman", "title": "Arizona Cardinals re-sign CB Kevin Peterson to 1-year deal - Arizona Sports", "description": "Adding much-needed cornerback depth, the Arizona Cardinals re-signed free agent Kevin Peterson to a one-year contract on Tuesday.", "url": "https://arizonasports.com/story/2299405/arizona-cardinals-re-sign-cb-kevin-peterson-1-year-deal/", "urlToImage": "https://arizonasports.com/wp-content/uploads/2019/12/GettyImages-1174191820.jpg", "publishedAt": "2020-05-12T17:55:00Z", "content": "Adding much-needed cornerback depth, the Arizona Cardinals re-signed free agent Kevin Peterson to a one-year contract on Tuesday. In a corresponding move, they released cornerback Andre Chachere.\r\nPeterson started three games for Arizona in 2019 and appeared … [+1183 chars]"}, {"source": {"id": null, "name": "Autosport.com"}, "author": "Luke Smith", "title": "F1 News: Verstappen doesn't expect Ricciardo to get Ferrari seat in 2021 - Autosport", "description": "Max Verstappen does not expect former Red Bull Formula 1 team-mate Daniel Ricciardo will replace Sebastian Vettel at Ferrari, predicting Carlos Sainz Jr. will get the seat for 2021", "url": "https://www.autosport.com/f1/news/149399/verstappen-doesnt-expect-ricciardo-to-get-ferrari-nod", "urlToImage": "https://d2d0b2rxqzh1q5.cloudfront.net/sv/2.183/dir/60d/image/60d0489e737f18b53895d3a36f2203f2.jpg", "publishedAt": "2020-05-12T17:21:12Z", "content": "Max Verstappen does not expect former Red Bull Formula 1 team-mate Daniel Ricciardo will replace Sebastian Vettel at Ferrari, predicting Carlos Sainz Jr. will get the seat for 2021.\r\nFerrari announced on Tuesday morning that four-time world champion Vettel wo… [+1835 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": null, "title": "Iowa's Jordan Bohannon, Jack Nunge given extra year of eligibility - ESPN", "description": "Hardship waiver petitions for Iowa's Jordan Bohannon and Jack Nunge were approved by the Big Ten Conference, meaning each player gets an extra year of eligibility.", "url": "https://www.espn.com/mens-college-basketball/story/_/id/29166216/iowa-jordan-bohannon-jack-nunge-granted-extra-year-eligibility", "urlToImage": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0324%2Fr519071_1296x729_16%2D9.jpg", "publishedAt": "2020-05-12T17:12:09Z", "content": "IOWA CITY, Iowa -- The Big Ten Conference has approved hardship waiver petitions for Iowa basketball players Jordan Bohannon and Jack Nunge, giving each an extra year of eligibility.\r\nIowa made the announcement Tuesday in a news release.\r\nBohannon, a 6-foot-1… [+651 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allen Kim, CNN", "title": "Mike Tyson prepares for potential return to boxing ring, releasing a training video that says 'I'm Back' - CNN", "description": "Mike Tyson is back. The former world heavyweight boxing champion is training again, with plans to climb back into the ring to raise money for charities, after showing his power and ferocity in a pair of training videos posted on Instagram.", "url": "https://www.cnn.com/2020/05/12/us/mike-tyson-spt-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200512120234-mike-tyson-0222-super-tease.jpg", "publishedAt": "2020-05-12T17:05:54Z", "content": null}, {"source": {"id": null, "name": "Testudotimes.com"}, "author": "Wesley  Brown", "title": "Alabama grad transfer Galin Smith commits to Maryland basketball - Testudo Times", "description": "The Terps get some much needed front court depth.", "url": "https://www.testudotimes.com/maryland-terps-basketball/2020/5/12/21256015/alabama-grad-transfer-galin-smith-maryland-mens-basketball-front-court-depth-mark-turgeon", "urlToImage": "https://cdn.vox-cdn.com/thumbor/jOFVpFZGktTPKm_GHr0do9Lfc_A=/0x0:4302x2252/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19962774/usa_today_12345641.jpg", "publishedAt": "2020-05-12T16:25:23Z", "content": "Maryland mens basketball secured a 2020 frontcourt transfer as Alabama forward Galin Smith announced his commitment to the Terps Tuesday.\r\nThe 69, 240-pound Smith provides depth in the Maryland frontcourt that lost three players this offseason.\r\nIm really exc… [+1841 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Marc J. Spears", "title": "Sports Academy retires 'Mamba' name out of respect to Kobe Bryant - ESPN", "description": "Out of respect for the late Kobe Bryant, The Sports Academy is retiring \"Mamba\" from its name and will have a new website and logo rebranding.", "url": "https://www.espn.com/nba/story/_/id/29165808/sports-academy-retires-mamba-name-respect-kobe-bryant", "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0802%2Fr578436_1296x729_16%2D9.jpg", "publishedAt": "2020-05-12T16:16:59Z", "content": "The Mamba Sports Academy is retiring \"Mamba\" from its name, out of respect for the late Los Angeles Lakers great Kobe Bryant.\r\nThe Mamba Sports Academy was launched in 2018 as a joint athletic training business venture with Bryant and Sports Academy CEO Chad … [+4107 chars]"}, {"source": {"id": null, "name": "Espn.in"}, "author": "Vaughn McClure", "title": "Falcons eye Dolphins, Bills for joint practices - ESPN India", "description": "The Falcons have talked to the Dolphins and Bills about joint practices, but the decision isn't final because of the coronavirus pandemic.", "url": "https://www.espn.in/nfl/story/_/id/29165807/falcons-eye-dolphins-bills-joint-practices", "urlToImage": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F1222%2Fr644799_1296x729_16%2D9.jpg", "publishedAt": "2020-05-12T16:07:48Z", "content": "Atlanta Falcons coach Dan Quinn said the team has discussed having joint practices with both Miami and Buffalo, the first two opponents on the Falcons' preseason schedule.\r\nQuinn cautioned that the decision isn't final, however, with so much uncertainty regar… [+2241 chars]"}, {"source": {"id": null, "name": "Caneswarning.com"}, "author": "Alan Rubenstein", "title": "Nick Saban’s comments to Jalen Hurts stark reality about Miami football - Canes Warning", "description": "Alabama head coach Nick Saban told former quarterback Jalen Hurts to chose Oklahoma over the Maryland and Miami football programs when he entered the trans...", "url": "https://caneswarning.com/2020/05/12/nick-sabans-comments-jalen-hurts-stark-reality-miami-football/", "urlToImage": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Fcaneswarning.com%2Fwp-content%2Fuploads%2Fgetty-images%2F2017%2F07%2F1067374562.jpeg", "publishedAt": "2020-05-12T16:07:33Z", "content": "When former Alabama quarterback Jalen Hurts entered the transfer portal in January 2019, he considered the Maryland, Oklahoma and Miami football programs as his next destination. Crimson Tide head coach Nick Saban steered Hurts towards the Sooners because tha… [+2729 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Frank Schwab", "title": "Wild Sammy Watkins story includes how constant drinking and smoking led to his Buffalo problems - Yahoo Sports", "description": "Sammy Watkins had a tough time in Buffalo.", "url": "https://sports.yahoo.com/wild-sammy-watkins-story-includes-how-constant-drinking-and-smoking-led-to-his-buffalo-problems-155348976.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/sReZMHisvWme_tywkDrq9Q--~B/aD0zMTYzO3c9NDc0NTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-05/0efc75b0-9467-11ea-bfbf-cc3061255614", "publishedAt": "2020-05-12T15:53:00Z", "content": "Sammy Watkins has quite a personality.\r\nWatkins, who made one of the biggest plays in the Kansas City Chiefs Super Bowl LIV win, opened up to Bleacher Reports Tyler Dunne about pretty much everything. He shared his thoughts on reincarnation, how spirits move … [+3469 chars]"}, {"source": {"id": null, "name": "Mmafighting.com"}, "author": "Damon Martin", "title": "Tony Ferguson earns $500,000 payday to lead all salaries at UFC 249 - MMA Fighting", "description": "Here are the salaries for UFC 249 from Jacksonville, Fla. where Tony Ferguson led all fighters with a $500,000 payday.", "url": "https://www.mmafighting.com/2020/5/12/21255969/tony-ferguson-earns-500000-payday-to-lead-all-salaries-at-ufc-249", "urlToImage": "https://cdn.vox-cdn.com/thumbor/5mha_JwAybbX8LJ7u7ahiUnHcYA=/0x227:4602x2636/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19962706/1224290895.jpg.jpg", "publishedAt": "2020-05-12T15:48:24Z", "content": "Tony Ferguson may not have gotten the victory this past Saturday night at UFC 249, but he did walk away with the biggest payday on the entire card.\r\nThe former interim lightweight champion earned a $500,000 flat rate salary for his battle against Justin Gaeth… [+1743 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Chris Cwik", "title": "Johnny Manziel narrowly avoids disaster as cliff-diving stunt goes wrong - Yahoo Sports", "description": "Johnny Manziel is fortunate he wasn't injured.", "url": "https://sports.yahoo.com/johnny-manziel-narrowly-avoids-disaster-as-cliffdiving-stunt-goes-wrong-154153924.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/9rLOjTIE9S7KeD3_sqLFkg--~B/aD0zNjQ4O3c9NTQ3MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-05/ff11e7c0-9466-11ea-9cf7-db544319603a", "publishedAt": "2020-05-12T15:41:00Z", "content": "Former Cleveland Browns quarterback Johnny Manziel is fortunate he wasnt injured after a cliff-diving stunt nearly ended in disaster.\r\nManziel, 27, posted video of the incident on his Instagram page. In the video, Manziel can be seen trying to jump off a clif… [+556 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "John Sigler", "title": "Drew Brees finally gets respected on PFF's All-Decade Team - Saints Wire", "description": "While he was an egregious snub on the 2010s All-Decade Team produced by the NFL and the Pro Football Hall of Fame, New Orleans Saints quarterback Drew Brees did get some respect put on his name by …", "url": "https://saintswire.usatoday.com/2020/05/12/nfl-saints-drew-brees-pff-all-decade-team/", "urlToImage": "https://usatsaintswire.files.wordpress.com/2019/12/usatsi_13827964.jpg?w=1024&h=576&crop=1", "publishedAt": "2020-05-12T15:30:22Z", "content": "While he was an egregious snub on the 2010s All-Decade Team produced by the NFL and the Pro Football Hall of Fame, New Orleans Saints quarterback Drew Brees did get some respect put on his name by the analysts at Pro Football Focus.\r\nBrees was named PFF’s sec… [+1000 chars]"}, {"source": {"id": null, "name": "Theathletic.com"}, "author": "Eric Koreen", "title": "A year later, Kawhi Leonard's shot still wipes out all that came before it - The Athletic", "description": "Given how the playoffs played out, Leonard giving the Raptors and fans their Moment in mid-May was crucial.", "url": "https://theathletic.com/1805832/2020/05/12/a-year-later-kawhi-leonards-shot-still-wipes-out-all-that-came-before-it/", "urlToImage": "https://cdn.theathletic.com/app/uploads/2020/05/10221755/USATSI_12695407-1024x789.jpg", "publishedAt": "2020-05-12T15:02:53Z", "content": "How much money would you have bet that Kawhi Leonard would have knocked down the second free throw?“A lot. That would have been my guess,” said Kevin Harlan, the man who called Game 7 of last year’s Raptors-76ers series on TNT, with a laugh on this week’s epi… [+677 chars]"}, {"source": {"id": null, "name": "Si.com"}, "author": "Seth Everett", "title": "NFL Draft review: Did the Buffalo Bills have a good draft? - Sports Illustrated", "description": "A look at how AFC East favorite, the Buffalo Bills, did in the NFL Draft.", "url": "https://www.si.com/nfl/jets/news/ny-jets-nfl-draft-buffalo-bills-review", "urlToImage": "https://imageproxy.themaven.net/https%3A%2F%2Fimages.saymedia-content.com%2F.image%2FMTcyNDk4OTA4NDExMzM5ODU5%2Fusatsi_13859205_168388605_lowres.jpg?w=1024&q=40&h=683&auto=format&fit=max", "publishedAt": "2020-05-12T14:46:43Z", "content": "Team: Buffalo Bills\r\n2019 Record: 10-6\r\nState of the Team: The biggest thing to happen to this playoff team of a year ago is Tom Brady left the New England Patriots. This young up and coming team are poised to head into the 2020 season as the favorite to win … [+2666 chars]"}, {"source": {"id": null, "name": "Kentuckysportsradio.com"}, "author": null, "title": "Mike Krzyzewski could be deposed in Zion Williamson lawsuit - kentuckysportsradio.com", "description": "The legal battle between Zion Williamson and his former agent Gina Ford is going to get a lot more interesting if a settlement isn't reached. Lawyers for Ford told Pat Forde they are prepared to", "url": "https://kentuckysportsradio.com/basketball-2/mike-krzyzewski-could-be-deposed-in-zion-williamson-lawsuit/", "urlToImage": "https://kentuckysportsradio.com/wp-content/uploads/2018/11/45527697_2182895371743864_1112808180804485120_o.jpg", "publishedAt": "2020-05-12T14:45:00Z", "content": "Skip to content\r\nThe legal battle between Zion Williamson and his former agent Gina Ford is going to get a lot more interesting if a settlement isn’t reached. Lawyers for Ford told Pat Forde they are prepared to depose Mike Krzyzewski as part of the discovery… [+1902 chars]"}, {"source": {"id": null, "name": "247sports.com"}, "author": "Steve Wiltfong", "title": "Race for No. 1: Ohio State's about to have company - 247Sports", "description": "Our May update for the class of 2021's race for No. 1 reveals some challengers for Ohio State.", "url": "https://247sports.com/Article/College-football-team-recruiting-rankings-247Sports-top-classes-147064473/", "urlToImage": "https://s3media.247sports.com/Uploads/Assets/168/763/9763168.png?fit=bounds&crop=1200:630,offset-y0.50&width=1200&height=630", "publishedAt": "2020-05-12T14:18:19Z", "content": "Ohio State is chasing history on the recruiting trail. And with the way the 247Sports Composite Team Recruiting Rankings stand now, and who the Buckeyes are trending for moving forward, they could cruise into the finish line at No. 1 in 2021.\r\nHowever, if the… [+7371 chars]"}, {"source": {"id": null, "name": "Arrowheadpride.com"}, "author": "Ron Kopp Jr.", "title": "New Chiefs OL Darryl Williams professes his love for Kansas City - Arrowhead Pride", "description": "The undrafted free agent can’t wait to get to work.", "url": "https://www.arrowheadpride.com/2020/5/12/21255588/new-chiefs-offensive-lineman-darryl-williams-professes-his-love-for-kansas-city", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ig5eeyyPcgWAxsQlkF3t8sc1LoM=/0x0:4433x2321/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19962178/1177489157.jpg.jpg", "publishedAt": "2020-05-12T13:23:57Z", "content": "Miami may have the sunny beaches, Los Angeles may have the Hollywood scenery, New York City may have massive buildings, but Kansas City has some sight-seeing too. Just ask one of the Kansas City Chiefs undrafted free agent signings, offensive lineman Darryl W… [+4600 chars]"}, {"source": {"id": null, "name": "Tigernet.com"}, "author": "Tony Crumpton", "title": "Cardinals want Isaiah Simmons to focus on one position - TigerNet", "description": "The Arizona Cardinals got the most versatile player in last month's NFL Draft when they drafted former Clemson defender Isaiah Simmons with the No. 8 overall pi", "url": "https://www.tigernet.com/update/Cardinals-want-Isaiah-Simmons-to-focus-on-one-position-35531", "urlToImage": "http://2cic.nyc3.cdn.digitaloceanspaces.com/t/stories/20/football/simmons-camp.jpg", "publishedAt": "2020-05-12T13:16:39Z", "content": "The Arizona Cardinals got the most versatile player in last month's NFL Draft when they drafted former Clemson defender \r\nIsaiah Simmons with the No. 8 overall pick. \r\nHowever, will they use him properly to maximize his unique skillset?\r\nThe organization want… [+744 chars]"}, {"source": {"id": null, "name": "Denverpost.com"}, "author": "Tynin Fries", "title": "Coronavirus in Colorado, May 12: A look at the latest updates on COVID-19 - The Denver Post", "description": "Colorado is approaching nearly 1,000 coronavirus-related deaths. As of Monday, 392 ventilators were in use with 684 available statewide.", "url": "https://www.denverpost.com/2020/05/12/coronavirus-colorado-updates-may-12-covid-19/", "urlToImage": "https://www.denverpost.com/wp-content/uploads/2020/05/AP20129739463666.jpg?w=1024&h=681", "publishedAt": "2020-05-12T12:58:00Z", "content": null}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Eric Pincus", "title": "B/R NBA GM Week: Is Joel Embiid Trade Next After Sixers (Fake) Roster Shakeup? - Bleacher Report", "description": "With a pair of blockbuster trades, the  NBA  (represented by the    B/R Fantasy League   ) is moving full steam toward a week of very hypothetical but still intriguing trade pyrotechnics, with stars already on the move and others on the block...", "url": "https://bleacherreport.com/articles/2891273-br-nba-gm-week-is-joel-embiid-trade-next-after-sixers-fake-roster-shakeup", "urlToImage": "https://img.bleacherreport.net/img/images/photos/003/867/784/hi-res-9e70a6dba9e9df784acf87ff5fb1dd3d_crop_exact.jpg?w=1200&h=1200&q=75", "publishedAt": "2020-05-12T12:53:41Z", "content": "Matt Slocum/Associated Press\r\nWith a pair of blockbuster trades, the NBA (represented by the B/R Fantasy League) is moving full steam toward a week of very hypothetical but still intriguing trade pyrotechnics, with stars already on the move and others on the … [+6240 chars]"}, {"source": {"id": null, "name": "Boston.com"}, "author": "nicole-yang", "title": "Tom Brady disputes report of ‘deteriorating relationship’ with Josh McDaniels - Boston.com", "description": "\"Please stop this nonsense!”", "url": "https://www.boston.com/sports/new-england-patriots/2020/05/12/tom-brady-josh-mcdaniels-relationship", "urlToImage": "https://www.boston.com/wp-content/uploads/2017/12/download-12-850x478.jpeg", "publishedAt": "2020-05-12T12:11:03Z", "content": "Former Patriots quarterback Tom Brady took to social media on Monday night to decry a report of a deteriorating relationship with Patriots offensive coordinator Josh McDaniels.\r\nVeteran NFL writer Gary Myers of the New York Daily News who spent extensive time… [+2781 chars]"}, {"source": {"id": null, "name": "Windycitygridiron.com"}, "author": "Ken Mitchell", "title": "Chicago Bears Latest News: May 12, 2020 - Windy City Gridiron", "description": "Mitchell Trubisky talk abounds, about his future and his selection by the Bears...", "url": "https://www.windycitygridiron.com/2020/5/12/21255298/chicago-bears-den-nagy-pace-offseason-free-agency-draft-covid-19-schedule-trubisky-watson-mahomes", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Tafx7ohheWbyqaKI_525EReVMxQ=/0x81:5400x2908/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18801941/1126817303.jpg.jpg", "publishedAt": "2020-05-12T10:02:28Z", "content": "THE DAILY SPONGIE SPECIAL \r\nThis ones in honor of my wife, who was out at our place in the country and, upon her return from mowing ,said it was a real jungle out there...\r\nBEAR DOWN, CHICAGO BEARS, BEAR DOWN!!!!\r\nBEARRRSSSS\r\nChicago Bears LB Danny Trevathan … [+6702 chars]"}, {"source": {"id": null, "name": "Thevikingage.com"}, "author": "Chris Schad", "title": "5 reasons why Justin Jefferson will instantly impact the Vikings in 2020 - The Viking Age", "description": "The Minnesota Vikings are counting on their rookie receiver to have a big role in 2020, but what is it that will ensure he lives up to their expectations? ...", "url": "https://thevikingage.com/2020/05/12/why-justin-jefferson-instant-impact-minnesota-vikings/", "urlToImage": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Fthevikingage.com%2Fwp-content%2Fuploads%2Fgetty-images%2F2020%2F04%2F1192584443.jpeg", "publishedAt": "2020-05-12T10:00:00Z", "content": "(Photo by Todd Kirkland/Getty Images) Justin Jefferson\r\nOne of the biggest questions for the Minnesota Vikings leading into the 2020 NFL Draft was how they were going to replace Stefon Diggs.\r\nAfter trading the disgruntled wide receiver to the Buffalo Bills, … [+1016 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "ESPN", "title": "Man Citys Sterling Ive had family members die from coronavirus - ESPN", "description": "Manchester City forward Raheem Sterling has said some members from his family have died from the coronavirus.", "url": "https://www.espn.com/soccer/manchester-city/story/4093883/man-citys-sterling-ive-had-family-members-die-from-coronavirus", "urlToImage": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0512%2Fr697903_1296x729_16%2D9.jpg", "publishedAt": "2020-05-12T09:51:49Z", "content": "Manchester City forward Raheem Sterling has said some members from his family have died from the coronavirus and that he is \"reserved\" about plans to restart the Premier League.\r\nThe possibility of a restart next month was given a boost when the UK government… [+2641 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Phil Harrison", "title": "J.K. Dobbins signs four-year rookie deal with Baltimore Ravens - Buckeyes Wire", "description": "This one snuck in a bit under the radar, but former Ohio State running back J.K. Dobbins inked his first NFL deal last Thursday according to the Baltimore Ravens. It’s a four-year standard ro…", "url": "https://buckeyeswire.usatoday.com/2020/05/11/baltmiore-ravens-jk-dobbins-signs-rookie-contract-ohio-state-buckeyes/", "urlToImage": "https://buckeyewire.files.wordpress.com/2020/04/r2p55_bal_dobbins_hero.jpg?w=1024&h=576&crop=1", "publishedAt": "2020-05-12T00:20:51Z", "content": "This one snuck in a bit under the radar, but former Ohio State running back J.K. Dobbins inked his first NFL deal last Thursday according to the Baltimore Ravens. It’s a four-year standard rookie deal that will allow the 5-foot, 10-inch, 217-pound single-seas… [+932 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Mike Florio", "title": "Robert Kraft’s Super Bowl LI ring already has a high bid of $650,000 - NBCSports.com", "description": "The latest All-In Challenge auction is going to require someone to go more than all in. Already, bidding on Patriots owner Robert Kraft’s Super Bowl LI ring has hit $650,000. And there are still more than 10 days left in the auction, as of this posting. The r…", "url": "https://profootballtalk.nbcsports.com/2020/05/11/robert-krafts-super-bowl-li-ring-already-has-a-high-bid-of-650000/", "urlToImage": "https://profootballtalk.nbcsports.com/wp-content/uploads/sites/25/2020/05/GettyImages-633940282-e1589240230508.jpg", "publishedAt": "2020-05-11T23:38:00Z", "content": "The latest All-In Challenge auction is going to require someone to go more than all in.\r\nAlready, bidding on Patriots owner Robert Kraft’s Super Bowl LI ring has hit $650,000. And there are still more than 10 days left in the auction, as of this posting.\r\nThe… [+511 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Josh Alper", "title": "Ravens sign undrafted rookie Daishawn Dixon - Yahoo Sports", "description": "The Ravens officially announced the signing of veteran guard D.J. Fluker on Monday, but he's not the only new addition to the offensive line in Baltimore. The NFL's daily transaction report brings word that the team has signed undrafted free agent guard Daish…", "url": "https://sports.yahoo.com/ravens-sign-undrafted-rookie-daishawn-211312347.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/6y2w6d2glS9qYORgawciRA--~B/aD0zNjY7dz02NTI7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/profootballtalk.nbcsports.com/9b5a4122457dc0b6b546e6afc021ff4d", "publishedAt": "2020-05-11T21:13:00Z", "content": "The Ravens officially announced the signing of veteran guard D.J. Fluker on Monday, but hes not the only new addition to the offensive line in Baltimore.\r\nThe NFLs daily transaction report brings word that the team has signed undrafted free agent guard Daisha… [+488 chars]"}, {"source": {"id": null, "name": "Pittsburghhockeynow.com"}, "author": "Dan Kingerski", "title": "AHL Cancels Season, How it Affects Pittsburgh Penguins - Pittsburgh Hockey Now", "description": "The expected news didn’t land any softer as the American Hockey League canceled the remainder of their season on Monday. The league’s revenues are gate-driven, and the international ban on public events left the AHL with little choice. The effects are far-rea…", "url": "https://pittsburghhockeynow.com/ahl-cancels-season-how-it-affects-pittsburgh-penguins/", "urlToImage": "https://i2.wp.com/pittsburghhockeynow.com/wp-content/uploads/collage-42.jpg?resize=1000%2C512&ssl=1", "publishedAt": "2020-05-11T19:47:00Z", "content": "The expected news didnt land any softer as the American Hockey League canceled the remainder of their season on Monday. The leagues revenues are gate-driven, and the international ban on public events left the AHL with little choice. The effects are far-reach… [+2109 chars]"}, {"source": {"id": null, "name": "Mynorthwest.com"}, "author": "", "title": "How Seahawks’ deal with Bruce Irvin reveals where their priorities are - MyNorthwest.com", "description": "The Seahawks' contract with Bruce Irvin, reportedly worth $5 million guaranteed, says a lot about how their offseason with Jadeveon Clowney in free agency.", "url": "https://sports.mynorthwest.com/841366/what-seahawks-bruce-irvin-deal-reveals/?", "urlToImage": "https://sports.mynorthwest.com/wp-content/uploads/2020/05/Bruce-Irvin-getty-620.jpg", "publishedAt": "2020-05-11T18:57:14Z", "content": "The Seahawks signed linebacker/defensive end Bruce Irvin in free agency earlier this offseason, bringing a player familiar with their defense back to a team that needs all the pass-rushing help it can get after a sub-par 2019 season.\r\nSeahawks Breakdown: A cl… [+2837 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Peter King gives inside look at conversation with Dr. Anthony Fauci (FULL INTERVIEW) | NBC Sports - NBC Sports", "description": "Peter King joins Mike Tirico to talk about what he learned from Dr. Anthony Fauci concerning the steps the NFL needs to take in order to make sure the 2020 s...", "url": "https://www.youtube.com/watch?v=Npv3C1OgdcE", "urlToImage": "https://i.ytimg.com/vi/Npv3C1OgdcE/maxresdefault.jpg", "publishedAt": "2020-05-11T17:50:46Z", "content": null}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Kevin Stankiewicz", "title": "Mark Cuban: White House coronavirus safeguards need to be US norm before people feel comfortable - CNBC", "description": "\"Whatever the White House is doing for the president and vice president, that's the protocol I want to use for my employees,\" Mark Cuban told CNBC on Monday.", "url": "https://www.cnbc.com/2020/05/11/mark-cuban-white-house-coronavirus-safeguards-need-to-be-us-standard.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106195979-1571756914823rts2s7na.jpg?v=1589197973", "publishedAt": "2020-05-11T16:11:45Z", "content": "Billionaire entrepreneur Mark Cuban told CNBC on Monday that coronavirus safeguards in place at the White House need to become the norm before most Americans will feel comfortable going out again.\r\n\"We have to get to that point where the White House standard … [+3849 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "iRacing Pro Series Invitational from North Wilkesboro Speedway - NASCAR", "description": "Recap the iRacing Pro Series Invitational from iRacing Pro Series Invitational from North Wilkesboro Speedway in this full race replay. ---------- Subscribe ...", "url": "https://www.youtube.com/watch?v=P1GLMRae6BQ", "urlToImage": "https://i.ytimg.com/vi/P1GLMRae6BQ/hqdefault.jpg", "publishedAt": "2020-05-11T12:00:15Z", "content": null}]}