{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Mike Freeman", "title": "NFL Draft Day 2 Notebook: Hurts No Novelty for Eagles, and Wentz Should Know It - Bleacher Report", "description": "One of the more creative minds in football is Eagles coach Doug Pederson.  One of the most brittle quarterbacks in football is Carson Wentz.  One of the most versatile and talented athletes in the draft is Oklahoma quarterback Jalen Hurts...", "url": "https://bleacherreport.com/articles/2888469-nfl-draft-day-2-notebook-hurts-no-novelty-for-eagles-and-wentz-should-know-it", "urlToImage": null, "publishedAt": "2020-04-25T05:53:42Z", "content": "Michael Conroy/Associated Press\r\nOne of the more creative minds in football is Eagles coach Doug Pederson.\r\nOne of the most brittle quarterbacks in football is Carson Wentz.\r\nOne of the most versatile and talented athletes in the draft is Oklahoma quarterback… [+7123 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Paul Schwartz", "title": "Giants select Matt Peart with No. 99 pick in NFL Draft 2020 - New York Post ", "description": "Two is better than one? That is how the Giants looked at their offensive tackle position. After taking Andrew Thomas in the first round, they doubled up Friday night, taking Matt Peart of UConn nea…", "url": "https://nypost.com/2020/04/24/giants-select-matt-peart-with-no-99-pick-in-nfl-draft-2020/", "urlToImage": null, "publishedAt": "2020-04-25T05:05:53Z", "content": "Two is better than one?\r\nThat is how the Giants looked at their offensive tackle position. After taking Andrew Thomas in the first round, they doubled up Friday night, taking Matt Peart of UConn near the end of the third round of the 2020 NFL Draft.\r\nThe 99th… [+1770 chars]"}, {"source": {"id": null, "name": "Denverpost.com"}, "author": "Matt Schubert, Sean Keeler, Ryan O’Halloran, Mark Kiszla, Joe Nguyen", "title": "Grading Broncos’ Day 2 of the NFL draft: The Post’s sports staff weigh in on second, third rounds - The Denver Post", "description": "The Post’s sports staff weigh in with grades after the second day of the NFL draft.", "url": "https://www.denverpost.com/2020/04/24/grading-broncos-nfl-draft-day-2/", "urlToImage": null, "publishedAt": "2020-04-25T04:20:00Z", "content": "Mark Kiszla\r\nGrade:D+ \r\nOh, boy. John Elway took a trip to the dark side of the moon. When obvious choice at No. 46 was Alabama corner Trevon Diggs, Broncos took KJ Hamler, a kick-returner. Let’s hope Lloyd Cushenberry saves bad night. \r\nSean Keeler\r\nGrade: C… [+1755 chars]"}, {"source": {"id": null, "name": "Turfshowtimes.com"}, "author": "SB Nation NFL", "title": "Rams draft picks 2020: LA selects S Terrell Burgess with 104th pick - Turf Show Times", "description": "The Rams go with two defensive players in round 3", "url": "https://www.turfshowtimes.com/2020/4/24/21230468/rams-draft-terrell-burgess-round-3-2020-nfl-utah", "urlToImage": null, "publishedAt": "2020-04-25T04:11:07Z", "content": "The L.A. Rams have selected safety Terrell Burgess out of Utah with the 104th pick in the NFL draft. \r\nAnother Terrell. This time, Utah DB Terrell Burgess\r\nI dig it\r\n Cameron DaSilva (@camdasilva) April 25, 2020\r\nMore details coming ...\r\nBurgess played in thr… [+1126 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "NBC Sports Staff", "title": "2020 NFL Draft order: Latest list of all picks, selections from Round 1 through Round 7 - NBC Sports - Misc.", "description": "The 2020 NFL Draft is happening now for all 32 teams and runs through Saturday, April 25. Rounds 2 and 3 will air on Friday, while rounds 4-7 are on Saturday. For those who want to see where every pick is in the NFL Draft order, see below. For the first time …", "url": "https://sports.nbcsports.com/2020/04/25/nfl-draft-order-2020/", "urlToImage": null, "publishedAt": "2020-04-25T04:08:00Z", "content": "The 2020 NFL Draft is happening now for all 32 teams and runs through Saturday, April 25. Rounds 2 and 3 will air on Friday, while rounds 4-7 are on Saturday. For those who want to see where every pick is in the NFL Draft order, see below.\r\nFor the first time… [+9697 chars]"}, {"source": {"id": null, "name": "Hogshaven.com"}, "author": "Scott Jennings", "title": "Redskins 2018 draft results: Da’Ron Payne is Washington’s first round pick - Hogs Haven", "description": "The Washington Redskins welcome the newest member of the family, Antonio Gibson, after making him the 66th overall pick in the 2020 NFL Draft.", "url": "https://www.hogshaven.com/2020/4/24/21232383/washington-redskins-select-antonio-gibson-wr-memphis-in-the-third-round-of-2020-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-25T04:04:15Z", "content": "Day 2 is here and the Redskins have finally made their pick. Washington has added their new swiss army knife by selecting Memphis WR Antonio Gibson. Starting QB Dwayne Haskins Jr. and Offensive Coordinator Scott Turner now have a new weapon to play with.\r\nMor… [+541 chars]"}, {"source": {"id": null, "name": "Arrowheadpride.com"}, "author": "Kent Swanson", "title": "NFL Draft results: Chiefs select TCU tackle Lucas Niang at No. 96 - Arrowhead Pride", "description": "With their third pick of the NFL draft, the Chiefs get great value from a Big 12 offensive tackle.", "url": "https://www.arrowheadpride.com/2020/4/24/21235354/nfl-draft-results-chiefs-select-tcu-tackle-lucas-niang-at-no-96", "urlToImage": null, "publishedAt": "2020-04-25T03:56:25Z", "content": "The Kansas City Chiefs selected TCU tackle Lucas Niang at pick No. 96 overall in the third round of the 2020 NFL Draft.\r\nUnless the Chiefs trade back into the third round, their next pick will be on Saturday.\r\nKevin Jairaj-USA TODAY Sports\r\nTCU 66 315 pounds\r… [+1700 chars]"}, {"source": {"id": null, "name": "Behindthesteelcurtain.com"}, "author": "Jeff.Hartman", "title": "2020 NFL Draft: Steelers select OLB Alex Highsmith with 3rd round pick - Behind the Steel Curtain", "description": "The Pittsburgh Steelers have selected Alex Highsmith with their 3rd round pick.", "url": "https://www.behindthesteelcurtain.com/2020/4/24/21234488/2020-nfl-draft-results-pittsburgh-steelers-select-olb-alex-highsmith-with-3rd-round-pick-charlotte", "urlToImage": null, "publishedAt": "2020-04-25T03:50:36Z", "content": "Entering the 2020 NFL Draft, the Pittsburgh Steelers had a number of draft needs which they needed to address. With no first round selection in the draft, running back, safety and even pass rusher were still positions of need to help the black-and-gold get to… [+1540 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Ravens select a SPEEDSTER in Devin Duvernay with the 92nd overall pick | 2020 NFL Draft - CBS Sports", "description": "With the 92nd pick in the 2020 NFL Draft, the Baltimore Ravens select Devin Duvernay, wide receiver from Texas. Our CBS Sports HQ crew breaks down the select...", "url": "https://www.youtube.com/watch?v=XaGbJzoEdBE", "urlToImage": null, "publishedAt": "2020-04-25T03:44:28Z", "content": null}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Samantha Previte", "title": "Aaron Rodgers congratulates Jordan Love after 2020 NFL Draft stunner - New York Post ", "description": "Aaron Rodgers is on good terms with his potential successor — for now — after a dramatic start to Jordan Love’s career with the Packers. While the 15-year veteran was not consulte…", "url": "https://nypost.com/2020/04/24/nfl-draft-2020-aaron-rodgers-congratulates-jordan-love/", "urlToImage": null, "publishedAt": "2020-04-25T03:39:58Z", "content": "Aaron Rodgers is on good terms with his potential successor — for now — after a dramatic start to Jordan Love’s career with the Packers.\r\nWhile the 15-year veteran was not consulted about Green Bay’s first-round scheme to trade with the Dolphins and nab the s… [+1847 chars]"}, {"source": {"id": null, "name": "Clevelandbrowns.com"}, "author": null, "title": "Browns select LSU LB Jacob Phillips with No. 97 pick in 2020 NFL Draft - clevelandbrowns.com", "description": "Cleveland adds another national championship winner on Day 2", "url": "https://www.clevelandbrowns.com/news/browns-select-lsu-lb-jacob-phillips-with-no-97-pick-in-2020-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-25T03:39:20Z", "content": "Phillips, a Nashville native, started all 15 games during the Tigers' 2019 national championship season and led the team with 113 tackles. The previous year, he started 11 games and compiled 87 tackles and a pick-six interception.\r\nThe Browns acquired the No.… [+158 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Raiders select Lynn Bowden Jr. & Bryan Edwards with the 80th and 81st pick | 2020 NFL Draft - CBS Sports", "description": "With the 80th pick in the 2020 NFL Draft, the Las Vegas Raiders select Lynn Bowden Jr., WR from Kentucky. And with the 81st pick select Bryan Edwards, WR fro...", "url": "https://www.youtube.com/watch?v=l6Zn5j5V3zg", "urlToImage": null, "publishedAt": "2020-04-25T03:33:21Z", "content": "With the 80th pick in the 2020 NFL Draft, the Las Vegas Raiders select Lynn Bowden Jr., WR from Kentucky. And with the 81st pick select Bryan Edwards, WR from South Carolina\r\nOur CBS Sports HQ crew breaks down the selection, providing a grade for the team and… [+334 chars]"}, {"source": {"id": null, "name": "Raiders.com"}, "author": null, "title": "The X-Factor: Lynn Bowden Jr. brings a unique skill set to the Raiders The Las - Raiders.com", "description": "The Las Vegas Raiders have selected the Nation's Most Versatile Player with the No. 80 overall pick of the 2020 NFL Draft.", "url": "https://www.raiders.com/news/the-x-factor-lynn-bowden-jr-brings-a-unique-skill-set-to-the-raiders", "urlToImage": null, "publishedAt": "2020-04-25T03:30:00Z", "content": "Right now, Las Vegas Raiders Head Coach Jon Gruden is rubbing his palms together, grinning from ear to ear.\r\nWhy?\r\nBecause the Silver and Black just drafted the most versatile player in the country, and he's got a new toy in the sandbox.\r\nWith the No. 80 over… [+1064 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Frank Schwab", "title": "NFL draft: Bill O'Brien has a meltdown during his pick - Yahoo Sports", "description": "Bill O'Brien was not happy about something.", "url": "https://sports.yahoo.com/lets-guess-what-texans-coach-bill-o-brien-was-so-mad-about-032526904.html", "urlToImage": null, "publishedAt": "2020-04-25T03:25:00Z", "content": "Weve seen plenty of glimpses of draft rooms over the first two days of the draft. Weve seen Kliff Kingsbury with the coolest house in the NFL, and Bill Belichicks dog seemingly running the New England Patriots draft.\r\nWhat we havent seen much is any NFL coach… [+2241 chars]"}, {"source": {"id": null, "name": "Boston.com"}, "author": "nicole-yang", "title": "The Patriots select a pair of tight ends in third round of 2020 NFL Draft - Boston.com", "description": "UCLA's Devin Asiasi and Virginia Tech's Dalton Keene are heading to New England.", "url": "https://www.boston.com/sports/new-england-patriots/2020/04/24/patriots-draft-devin-asiasi", "urlToImage": null, "publishedAt": "2020-04-25T03:20:17Z", "content": "The Patriots selected a pair of tight ends UCLAs Devin Asiasi and Virginia Techs Dalton Keene in the third round of the 2020 NFL Draft Friday night.\r\nNew England traded up to secure both players, Asiasi with the 87th overall pick and Keene with the 101st. The… [+1019 chars]"}, {"source": {"id": null, "name": "Syracuse.com"}, "author": "Matt Parrino | mparrino@nyup.com", "title": "7 thoughts and a grade on Buffalo Bills drafting Iowa DE A.J. Epenesa - syracuse.com", "description": "Epenesa went at pick No. 16 in ESPN's Mel Kiper's first mock draft in January.", "url": "https://www.syracuse.com/buffalo-bills/2020/04/7-thoughts-and-a-grade-on-buffalo-bills-drafting-iowa-de-aj-epenesa.html", "urlToImage": null, "publishedAt": "2020-04-25T02:58:11Z", "content": "When the first round of the 2020 NFL Draft concluded on Thursday night, Buffalo Bills fans started combing through the list of players still left on the board.\r\nThe Bills didnt have a first-round pick after trading it in a deal for receiver Stefon Diggs last … [+7503 chars]"}, {"source": {"id": null, "name": "Seahawks.com"}, "author": null, "title": "Seahawks Select LSU Offensive Lineman Damien Lewis With Pick No. 69 In 2020 NFL Draft - Seahawks.com", "description": "The Seahawks moved back five spots, adding a fifth-round pick, and added LSU guard Damien Lewis.", "url": "https://www.seahawks.com/news/seahawks-select-lsu-offensive-lineman-damien-lewis-with-pick-no-69-in-2020-nfl-d", "urlToImage": null, "publishedAt": "2020-04-25T02:52:38Z", "content": "The Seahawks added a fifth-round pick for sending the 64th overall pick to Carolina, getting Pick No. 148 in return.\r\nAnd for Lewis, hearing his name called in the third round of the draft is something he definitely won't take for granted. After playing on a … [+478 chars]"}, {"source": {"id": null, "name": "Sun-sentinel.com"}, "author": "Omar Kelly", "title": "Dolphins add Alabama’s Raekwon Davis, a massive defensive tackle, in second round of NFL draft - South Florida - South Florida Sun Sentinel", "description": "The Miami Dolphins added Alabama defensive tackle Raekwon Davis in the second round of the 2020 NFL draft. He'll likely compete with Christian Wilkins and Davon Godchaux for playing time, if not a starting spot.", "url": "https://www.sun-sentinel.com/sports/miami-dolphins/fl-sp-draft-dolphins-sidebar-friday-20200425-667gkvmslrcxnltm7ppisxbjlu-story.html", "urlToImage": null, "publishedAt": "2020-04-25T02:50:38Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Will NHL hockey return this season? | HC@Home - SPORTSNET", "description": "David Amber is joined by Brendan Gallagher and Kevin Bieksa to discuss dad fights, TikTok videos & Dennis Rodman….. plus the state of league amid Covid-19. -...", "url": "https://www.youtube.com/watch?v=6YZpwdpKdec", "urlToImage": null, "publishedAt": "2020-04-25T02:50:15Z", "content": null}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Joseph Staszewski", "title": "Roger Goodell gets comfortable for NFL Draft third round - New York Post ", "description": "Roger Goodell is making full use of his basement during the 2020 NFL Draft – even sitting down to announce some of the picks at one point. The NFL commissioner, usually delivering the selections fr…", "url": "https://nypost.com/2020/04/24/roger-goodell-gets-comfortable-for-nfl-draft-third-round/", "urlToImage": null, "publishedAt": "2020-04-25T02:50:02Z", "content": "Roger Goodell is making full use of his basement during the 2020 NFL Draft even sitting down to announce some of the picks at one point.\r\nThe NFL commissioner, usually delivering the selections from a podium at a normal draft, has been standing near the telev… [+996 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "John Sigler", "title": "Twitter reacts to the Saints trading up for Zack Baun - Saints Wire", "description": "The New Orleans Saints finally found a trade partner in the third round of this year’s NFL draft, moving up to select Wisconsin linebacker Zack Baun. Baun was considered by some outlets to be…", "url": "https://saintswire.usatoday.com/2020/04/24/2020-nfl-draft-twitter-reactions-saints-zack-baun-trade/", "urlToImage": null, "publishedAt": "2020-04-25T02:42:10Z", "content": "It's one thing to look at a box score and learn that Zack Baun, the Wisconsin linebacker drafted by the New Orleans Saints in the third round of this year's NFL draft, racked up 12.5 sacks in his senior year. Seeing that he amassed 19.5 total tackles for loss… [+276 chars]"}, {"source": {"id": null, "name": "Detroitlions.com"}, "author": null, "title": "A CLOSER LOOK: Defensive end Julian Okwara - detroitlions.com", "description": "Tim Twentyman and Mike O’Hara share their thoughts on the Lions’ third-round selection of defensive end Julian Okwara.", "url": "https://www.detroitlions.com/news/a-closer-look-defensive-end-julian-okwara", "urlToImage": null, "publishedAt": "2020-04-25T02:32:22Z", "content": "Bio: Younger brother of Detroit Lions defensive end Romeo Okwara. Four-year player at South Bend, became a full-time starter in 2018 and had his best season: 12.5 tackles for loss with 8 sacks in 13 games, with 12 starts.\r\nOn the way to another good season bu… [+435 chars]"}, {"source": {"id": null, "name": "Cleveland.com"}, "author": "Nathan Baird, cleveland.com", "title": "What Ohio State football’s J.K. Dobbins said about playing for Michigan coach Jim Harbaugh’s brother, John, w - cleveland.com", "description": "Baltimore selected Dobbins with the 55th overall selection of NFL Draft 2020.", "url": "https://www.cleveland.com/osu/2020/04/what-ohio-state-footballs-jk-dobbins-said-about-playing-for-michigan-coach-jim-harbaughs-brother-john-with-ravens.html", "urlToImage": null, "publishedAt": "2020-04-25T02:08:00Z", "content": "COLUMBUS, Ohio -- J.K. Dobbins spent three seasons trying to run all over the Michigan team coached by Jim Harbaugh.\r\nNow a coach of the same name has summoned him to bring those running back talents to the NFL. The Baltimore Ravens and coach John Harbaugh Ji… [+1299 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Jeff Dickerson", "title": "Bears select Notre Dame's Cole Kmet in NFL Draft, giving them 10 tight ends - ESPN", "description": "After going through the 2019 season with the least productive tight end group in the NFL, the Bears continued revamping their roster by taking Notre Dame's Cole Kmet in the 2nd round of the NFL draft.", "url": "https://www.espn.com/nfl/story/_/id/29096124/bears-draft-notre-dame-cole-kmet-giving-10-tight-ends", "urlToImage": null, "publishedAt": "2020-04-25T02:03:02Z", "content": "The Chicago Bears must believe in the strength in numbers theory at tight end.\r\nOn Friday, the Bears made yet another attempt to improve their fortunes at tight end by using the 43rd overall pick of the 2020 NFL draft on Notre Dame's Cole Kmet, who became the… [+2398 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Ryan Gaydos", "title": "D'Andre Swift's dad steals the show after Lions select running back in NFL Draft - Fox News", "description": "The Detroit Lions may have found their running back of the future with D’Andre Swift, but fans had to be begging the team to take a second look at his father.", "url": "https://www.foxnews.com/sports/dandre-swift-dad-lions-select-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-25T01:53:54Z", "content": "The Detroit Lions may have found their running back of the future with D’Andre Swift, but fans had to be begging the team to take a second look at his father.\r\nESPN’s broadcast of the NFL Draft showcased Swift’s father, Darren, working out in the gym -- and h… [+1120 chars]"}, {"source": {"id": null, "name": "Catscratchreader.com"}, "author": "Brian Beversluis", "title": "2020 NFL Draft: Carolina Panthers select S Jeremy Chinn with the No. 64 overall pick - Cat Scratch Reader", "description": "The Carolina Panthers bolstered their secondary by adding versatile safety Jeremy Chinn.", "url": "https://www.catscratchreader.com/2020/4/24/21232536/2020-nfl-draft-carolina-panthers-select-jeremy-chinn-with-the-no-64-overall-pick-after-trading-up", "urlToImage": null, "publishedAt": "2020-04-25T01:49:38Z", "content": "The Carolina Panthers have selected Jeremy Chinn from Southern Illinois with the No. 64 overall pick in the 2020 NFL Draft. They traded No. 69 and 148 to get there.\r\nJeremy Chinn played four seasons at Southern Illinois, lining up all over the place in the de… [+898 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Jenna Laine", "title": "Tampa Bay Bucs take DB Antoine Winfield Jr., whose dad played against Tom Brady - ESPN", "description": "Antoine Winfield Jr., who went to the Bucs with the No. 45 overall pick, said it was \"crazy\" to land on the same team as Tom Brady, who faced his dad, Antoine Winfield Sr., seven times in the NFL.", "url": "https://www.espn.com/nfl/draft2020/story/_/id/29096050/tampa-bay-bucs-take-db-antoine-winfield-jr-dad-played-tom-brady", "urlToImage": null, "publishedAt": "2020-04-25T01:45:53Z", "content": "TAMPA, Fla. -- Just how old is Tom Brady? Old enough to have once been intercepted by the father of his new teammate Antoine Winfield Jr., whom the Tampa Bay Buccaneers selected in the second round (No. 45) of the 2020 NFL draft Friday.\r\nOn Nov. 11, 2001, Win… [+2114 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Cowboys get a TOP NOTCH player in Trevon Diggs with the 51st overall pick | 2020 NFL Draft - CBS Sports", "description": "With the 51st pick in the 2020 NFL Draft, the Dallas Cowboys select Trevon Diggs, CB from Alabama. Our CBS Sports HQ crew breaks down the selection, providin...", "url": "https://www.youtube.com/watch?v=CIPqroXgCyM", "urlToImage": null, "publishedAt": "2020-04-25T01:33:50Z", "content": null}, {"source": {"id": null, "name": "Musiccitymiracles.com"}, "author": "Terry A. Lambert", "title": "2020 NFL Draft: Titans take LSU CB Kristian Fulton in second round - Music City Miracles", "description": "A big need filled.", "url": "https://www.musiccitymiracles.com/2020/4/24/21231489/2020-nfl-draft-titans-take-lsu-cornerback-kristian-fulton-with-second-round-pick", "urlToImage": null, "publishedAt": "2020-04-25T01:24:11Z", "content": "The Tennessee Titans have selected LSU cornerback Kristian Fulton with the 61st pick in the 2020 NFL Draft. With Logan Ryan remaining unsigned, cornerback was a clear need for Jon Robinson. \r\nFulton checks in at 6-0, 197 pounds. As a senior, Fulton started 15… [+921 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": null, "title": "New DeFo: Kinlaw wants to wear Buckner's number for 49ers - NBCSports.com", "description": "Javon Kinlaw wants to fill the void left by DeForest Buckner.", "url": "https://www.nbcsports.com/bayarea/49ers/49ers-javon-kinlaw-wants-deforest-buckners-number-after-being-drafted", "urlToImage": null, "publishedAt": "2020-04-25T01:17:55Z", "content": "As a senior at South Carolina last season, defensive lineman Javon Kinlaw racked up six sacks.\r\nThat's an impressive number considering he played in the SEC, where he was going up against some of the top offensive linemen in the country.\r\nThe 49ers, who picke… [+2661 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Mike Wells", "title": "Colts trade up in NFL draft to take Wisconsin RB Jonathan Taylor - ESPN", "description": "The Colts traded up three spots during Friday's second round to select Wisconsin running back Jonathan Taylor at No. 41, giving new quarterback Philip Rivers another threat out of the backfield.", "url": "https://www.espn.com/nfl/story/_/id/29095812/colts-trade-draft-wisconsin-rb-jonathan-taylor", "urlToImage": null, "publishedAt": "2020-04-25T00:49:19Z", "content": "INDIANAPOLIS -- New Colts quarterback Philip Rivers will have another threat out of the backfield to turn to next season.\r\nThe Colts jumped three spots in the 2020 NFL draft to add to what was a top-10 rushing offense last season when they selected Wisconsin … [+3508 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": null, "title": "Report: 49ers believed to be interested in star OT Williams - NBCSports.com", "description": "Depending on Joe Staley's status, a trade for Williams might make a lot of sense, depending on the price.", "url": "https://www.nbcsports.com/bayarea/49ers/nfl-rumors-49ers-believed-have-trent-williams-trade-interest", "urlToImage": null, "publishedAt": "2020-04-25T00:38:13Z", "content": "The 49ers currently are without any picks in the second through fourth rounds, so they are not expected to be very active on Day 2 of the 2020 NFL Draft on Friday night. That said, there are potential moves to be made that don't involve the selection of prosp… [+1941 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Ian Doyle", "title": "Only realistic way Liverpool can now lose Premier League title - Liverpool Echo", "description": "Ian Doyle discusses Liverpool, the Premier League title and the void in the latest Blood Red column", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/only-realistic-way-liverpool-can-18148023", "urlToImage": null, "publishedAt": "2020-04-25T00:08:28Z", "content": "It's all about the void for Liverpool at present.\r\nAnd we're not talking about the prospect of the Premier League season being scrapped.\r\nWell, not exclusively, at any rate.\r\nInstead, it's the huge chasm that has been left by the absence of football - and, ju… [+3501 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "James Harden's Debut For The Rockets | #NBATogetherLive Classic Game - NBA", "description": "Throwback to the first game James Harden suited up for the Houston Rockets Subscribe to the NBA: https://on.nba.com/2JX5gSN Full Game Highlights Playlist: ht...", "url": "https://www.youtube.com/watch?v=-zzSYS3DRg0", "urlToImage": null, "publishedAt": "2020-04-25T00:01:30Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "UFC Announces 3 Cards Set for May in Jacksonville Reaction - MMA Fighting - MMAFightingonSBN", "description": "UFC president Dana White announced on Friday that the promotion would return with a trio of cards set for May 9, May 13 and May 16 with all three shows takin...", "url": "https://www.youtube.com/watch?v=RmaWCqA24CQ", "urlToImage": null, "publishedAt": "2020-04-24T22:55:15Z", "content": "UFC president Dana White announced on Friday that the promotion would return with a trio of cards set for May 9, May 13 and May 16 with all three shows taking place in Jacksonville, Fla. Now MMA Fighting's Mike Heck and Jose Youngs react to the news as the UF… [+554 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Paul Kasabian", "title": "Tony Dungy: Bucs 'Definitely Going' to Super Bowl After Adding Brady, Gronkowski - Bleacher Report", "description": "The  Tampa Bay Buccaneers ' hype train has left the station after the team signed six-time Super Bowl champion Tom Brady and traded for four-time All-Pro tight end  Rob Gronkowski  this offseason...", "url": "https://bleacherreport.com/articles/2888531-tony-dungy-bucs-definitely-going-to-super-bowl-after-adding-brady-gronkowski", "urlToImage": null, "publishedAt": "2020-04-24T22:25:16Z", "content": "John McCoy/Getty Images\r\nThe Tampa Bay Buccaneers' hype train has left the station after the team signed six-time Super Bowl champion Tom Brady and traded for four-time All-Pro tight end Rob Gronkowski this offseason.\r\nSuper Bowl-winning head coach and curren… [+1100 chars]"}, {"source": {"id": null, "name": "Blazersedge.com"}, "author": "Dave Deckard", "title": "Trail Blazers Top 100: The Pick that Wasn’t Meant to Be - Blazer's Edge", "description": "A look at the 100 players and personnel who have influenced the Trail Blazers’ 50-year history.", "url": "https://www.blazersedge.com/2020/4/24/21233500/trail-blazers-all-time-top-players-list-countdown-sam-bowie-36", "urlToImage": null, "publishedAt": "2020-04-24T22:17:19Z", "content": "The Trail Blazers 50-year anniversary season is temporarily on pause as the NBA goes on hiatus to slow the spread of COVID-19. During that break, Blazers Edge is counting down the top 100 Blazers: players, executives, and other influencers who made the franch… [+5286 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Mike Bohn", "title": "'Fight Island' update: Dana White plans beachfront octagon, shows 'up and running by June' - MMA Junkie", "description": "UFC president Dana White maintains his promise that “Fight Island” is a real thing.", "url": "https://mmajunkie.usatoday.com/2020/04/fight-island-update-dana-white-beachfront-octagon-june-events", "urlToImage": null, "publishedAt": "2020-04-24T22:02:32Z", "content": "UFC president Dana White maintains “Fight Island” is a real thing, and the venue will be prepared to host events inside two months.\r\nAlthough the location is still unknown, White insists the private island he’s secured in the wake of the coronavirus pandemic … [+1597 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Gary Neville warns people are getting \"carried away\" with Man Utd target Jadon Sancho - Mirror Online", "description": "Man Utd legend Gary Neville has put Jadon Sancho's quality into context compared to some of the world's best players", "url": "https://www.mirror.co.uk/sport/football/news/gary-neville-warns-people-getting-21923589", "urlToImage": null, "publishedAt": "2020-04-24T21:41:45Z", "content": "Gary Neville claims Manchester United target Jadon Sancho is \"nowhere near\" some of the world's elite.\r\nThe Red Devils have been linked with the Borussia Dortmund star who is likely to cost around £100m.\r\nMuch is made of the Englishman's exploits in the Bunde… [+1834 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Jared Dudley Talks Lakers Playoffs, His Future In L.A., Kyle Kuzma's Growth, Dwight Howard Returning - Lakers Nation", "description": "Los Angeles Lakers ✔️ Help us continue to provide Lakers coverage and SUBSCRIBE: https://goo.gl/5AXSud ✔️ Our MOST POPULAR Videos: https://goo.gl/k4Xvqq Lake...", "url": "https://www.youtube.com/watch?v=bdgNVx2wf5Y", "urlToImage": null, "publishedAt": "2020-04-24T21:09:47Z", "content": "Los Angeles Lakers\r\nHelp us continue to provide Lakers coverage and SUBSCRIBE: https://goo.gl/5AXSud\r\nOur MOST POPULAR Videos: https://goo.gl/k4Xvqq\r\nLakersNation.com on Social Media:\r\nLike on Facebook: https://goo.gl/EQ4uiG\r\nFollow us on Twitter: https://goo… [+165 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Dana White Touts 'Overabundance of Safety' Measures for UFC 249 | TMZ Sports - TMZSports", "description": "Dana White says UFC 249 won't only be the \"best card we've ever had\" but also the safest -- claiming he's spending a ton of money to ensure everyone is prope...", "url": "https://www.youtube.com/watch?v=UhiUqoHVwKc", "urlToImage": null, "publishedAt": "2020-04-24T20:48:22Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Patrick Queen Can't Wait to Trash Talk Joe Burrow | Ravens Final Drive - Baltimore Ravens", "description": "New Ravens linebacker Patrick Queen said he loves that he landed in the same division as college teammate and Bengals No. 1-overall pick Joe Burrow. #Baltimo...", "url": "https://www.youtube.com/watch?v=TqySsbOeW8g", "urlToImage": null, "publishedAt": "2020-04-24T20:25:24Z", "content": null}, {"source": {"id": null, "name": "Hogshaven.com"}, "author": "Scott Jennings", "title": "2020 Redskins Day 2 Mock Draft Roundup: Who is Washington’s next pick? - Hogs Haven", "description": "Day 1 of the NFL draft is over and the Redskins have selected Ohio State DE Chase Young with the #2 pick. Washington rejected trade offers that obviously weren’t enough to get them to pass on the...", "url": "https://www.hogshaven.com/2020/4/24/21234969/2020-redskins-day-2-mock-draft-roundup-who-is-washingtons-next-pick", "urlToImage": null, "publishedAt": "2020-04-24T20:21:08Z", "content": "Day 1 of the NFL draft is over and the Redskins have selected Ohio State DE Chase Young with the #2 pick. Washington rejected trade offers that obviously werent enough to get them to pass on the best player in the draft. The Redskins still have 6 draft picks,… [+3891 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Rachel Handler", "title": "The Only Good Look Is Michael Jordan’s ’90s Practice Uniform - Vulture", "description": "The Last Dance has entirely changed my quarantine wardrobe.", "url": "http://www.vulture.com/2020/04/the-last-dance-michael-jordan-practice-uniform.html", "urlToImage": null, "publishedAt": "2020-04-24T20:16:21Z", "content": "Much has been written about how we should dress while social distancing. Some people believe we should wake up every morning and put on the same clothes we would normally wear to work. These people frighten me, and I am going to move on without addressing the… [+9919 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Justin Herbert compares his game to Matt Ryan, talks Draft, Chargers, Oregon & more | NFL | THE HERD - The Herd with Colin Cowherd", "description": "Justin Herbert joins Colin Cowherd to discuss football. Hear his account of draft night, who he compares his game to, his time at Oregon as well as what he l...", "url": "https://www.youtube.com/watch?v=zbpy00fDA1k", "urlToImage": null, "publishedAt": "2020-04-24T20:02:14Z", "content": "Justin Herbert joins Colin Cowherd to discuss football. Hear his account of draft night, who he compares his game to, his time at Oregon as well as what he looks forward to joining the Los Angeles Chargers.\r\n#TheHerd#NFL#JustinHerbert#MattRyan#Chargers#NFLDra… [+1275 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Kathleen Elkins", "title": "NFL player has some blunt money advice for rookies: 'Do not live a lavish lifestyle' - CNBC", "description": "Joe Burrow and the other top NFL draft picks will make millions. Current player Byron Jones took to Twitter to offer his best money advice for the incoming rookies.", "url": "https://www.cnbc.com/2020/04/24/nfl-player-gives-his-best-money-advice-to-rookies.html", "urlToImage": null, "publishedAt": "2020-04-24T19:55:16Z", "content": "The 2020 NFL draft took place virtually on Thursday night. The Cincinnati Bengals selected former LSU standout Joe Burrow with the first pick. The 23-year-old quarterback, who is among a select few to have won the Heisman Trophy and a national championship in… [+1811 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Brad Keselowski breakdown: Winning moves, key decisions in first victory | Talladega Superspeedway - NASCAR", "description": "Brad Keselowski's first NASCAR Cup Series win was memorable for its thrilling, controversial conclusion. The Team Penske driver sits down to analyze and expl...", "url": "https://www.youtube.com/watch?v=8EYwW6uV6s0", "urlToImage": null, "publishedAt": "2020-04-24T19:11:42Z", "content": null}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "James Dator", "title": "Kliff Kingsbury’s mansion was the biggest flex of the NFL Draft - SB Nation", "description": "This house!", "url": "https://www.sbnation.com/nfl/2020/4/24/21234718/kliff-kingsburys-mansion-was-the-biggest-flex-of-the-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-24T18:15:19Z", "content": "Kliff Kingsbury accidentally stole the show during the NFL Draft by doing absolutely nothing other than sitting on his sofa. That sounds ridiculous until you see his house.\r\nKingsburys house is so incredible its like everyones idea of a dream home rolled into… [+1153 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Andersen reveals the best and worst part about isolating with Matthews - TSN", "description": "Maple Leafs goaltender Frederik Andersen joins James Duthie to talk about what isolation has been like with Auston Matthews down in Arizona. He also touches ...", "url": "https://www.youtube.com/watch?v=YMidEz7ODJo", "urlToImage": null, "publishedAt": "2020-04-24T17:30:31Z", "content": null}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Dak Prescott's Brother, Jace, Dead At 31 - TMZ", "description": "Tragic news for the Dallas Cowboys QB and his family.", "url": "https://www.tmz.com/2020/04/24/nfls-dak-prescott-s-brother-dead-at-31-cause-of-death-unknown/", "urlToImage": null, "publishedAt": "2020-04-24T17:23:20Z", "content": "Tragic news for Dak Prescottand his family ... the quarterback's older brother, Jace Prescott, died suddenly at 31 years old on Thursday, the Dallas Cowboys announced.\r\nNo cause of death was given.\r\nDak had been super close with Jace, the oldest of the Presco… [+1131 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Michael Middlehurst-Schwartz", "title": "NFL draft 2020's best available players in second round: Grant Delpit, Laviska Shenault among top options on board - USA TODAY", "description": "There's still plenty of first-round talent available for teams on Day 2 of the NFL draft, including several promising options at safety and receiver.", "url": "https://www.usatoday.com/story/sports/nfl/draft/2020/04/24/nfl-draft-second-round-best-players-available-2020/3020500001/", "urlToImage": null, "publishedAt": "2020-04-24T17:10:28Z", "content": "SportsPulse: The first night of the NFL's virtual draft went off without a hitch and Mackenzie Salmon is here to break down the nights biggest winners and losers.\r\nUSA TODAY\r\nThere's still first-round talent awaiting teams on Day 2 of the 2020 NFL draft.\r\nThu… [+5255 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Jabari Young", "title": "Sports teams mull how to cover refunds and lost ticketing revenue - CNBC", "description": "The suspension of live events due to Cvoid-19 is hurting a sector in the sports world that, according to a study was projected to bring in $21.8 billion in 2023", "url": "https://www.cnbc.com/2020/04/24/sports-ticketing-will-look-different-as-teams-get-creative-without-fans.html", "urlToImage": null, "publishedAt": "2020-04-24T15:54:42Z", "content": "The seats are empty at the Amway Center in Orlando, home of the NBAs Orlando Magic, on Thursday, March 12, 2020. The NBA has suspended the season due to the coronavirus -- as have other sports.\r\nThere is a bubble on the verge of bursting throughout sports lea… [+10121 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Chiefs add to explosive offense with RB Clyde Edwards-Helaire | Pro Football Talk | NBC Sports - NBC Sports", "description": "RB Clyde Edwards-Helaire was selected by the Kansas City Chiefs with the last pick of the first round, adding to its already dynamic offense with Patrick Mah...", "url": "https://www.youtube.com/watch?v=7rAPMwlXk3Q", "urlToImage": null, "publishedAt": "2020-04-24T15:54:22Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt, CNN", "title": "Hope Solo, former USWNT goalie, announces birth of twins - CNN", "description": "Former US goalkeeper Hope Solo and husband Jerramy Stevens have welcomed twins into the world, the soccer star announced on Thursday.", "url": "https://edition.cnn.com/2020/04/24/football/hope-solo-twins-intl-scli/index.html", "urlToImage": null, "publishedAt": "2020-04-24T09:45:38Z", "content": "(CNN)Former US goalkeeper Hope Solo and husband Jerramy Stevens have welcomed twins into the world, the soccer star announced on Thursday. \r\nFormer US Women's National Team goalkeeper and two-time Olympic gold medalist Solo announced the birth of her twins --… [+1149 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Sean Payton After Drafting Cesar Ruiz in 2020 NFL Draft | Saints Draft - New Orleans Saints", "description": "New Orleans Saints Head Coach Sean Payton talks to the media following day 1 of the 2020 NFL draft after the Saints selected Cesar Ruiz #24 overall with thei...", "url": "https://www.youtube.com/watch?v=zAJJfVl4fUA", "urlToImage": null, "publishedAt": "2020-04-24T05:59:21Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Instant Reaction: Dolphins protect Tua Tagovailoa, draft OT Austin Jackson at No. 18 | NBC Sports - NBC Sports", "description": "Peter King reacts after the Dolphins used their second first-round pick to protect Tua Tagovailoa and draft USC left tackle Austin Jackson at No. 18 overall....", "url": "https://www.youtube.com/watch?v=7jMg9qMWTjw", "urlToImage": null, "publishedAt": "2020-04-24T03:49:14Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Raiders select SPEEDSTER Henry Ruggs with the 12th overall pick | 2020 NFL Draft | CBS Sports HQ - CBS Sports", "description": "With the 12th pick in the 2020 NFL Draft, the Las Vegas Raiders select Henry Ruggs, wide receiver from Alabama. Our CBS Sports HQ crew breaks down the select...", "url": "https://www.youtube.com/watch?v=S9Bej0juDXA", "urlToImage": null, "publishedAt": "2020-04-24T02:16:50Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Instant Reaction: Arizona Cardinals take Isaiah Simmons at No. 8 | Pro Football Talk | NBC Sports - NBC Sports", "description": "Mike Florio breaks down what uber-versatile linebacker Isaiah Simmons brings to Arizona as the Cardinals draft the Clemson product at No. 8. #NBCSports #Isai...", "url": "https://www.youtube.com/watch?v=g7ia9hkYs38", "urlToImage": null, "publishedAt": "2020-04-24T02:14:41Z", "content": "Mike Florio breaks down what uber-versatile linebacker Isaiah Simmons brings to Arizona as the Cardinals draft the Clemson product at No. 8. #NBCSports#IsaiahSimmons#ArizonaCardinals» Subscribe to NBC Sports: https://www.youtube.com/nbcsports?sub...» Watch Li… [+1383 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Jaguars FILL A MAJOR NEED with CJ Henderson ninth overall | 2020 NFL Draft - CBS Sports", "description": "With the 9th pick in the 2020 NFL Draft, the Jacksonville Jaguars select CJ Henderson, CB from Florida. Our CBS Sports HQ crew breaks down the selection, pro...", "url": "https://www.youtube.com/watch?v=vj9SSRxAPoY", "urlToImage": null, "publishedAt": "2020-04-24T01:41:29Z", "content": null}, {"source": {"id": null, "name": "Today.com"}, "author": "Ronnie Koenig", "title": "Budweiser brings back 'whassup' commercial during coronavirus - TODAY", "description": "Former NBA stars and others unite for a reboot of the famous 'wassup' Budweiser commercial, this time with an emotional ending.", "url": "https://www.today.com/food/budweiser-brings-back-whassup-commercial-during-coronavirus-t179787", "urlToImage": null, "publishedAt": "2020-04-23T23:27:40Z", "content": "Budweiser just released a new version of its classic \"whassup\" commercial that's not only funny, but also serves as a genuinely touching public service announcement in the time of coronavirus.\r\nThe original commercial, which aired in 1999 featured a group of … [+2951 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Golf's versions of field goals - PGA TOUR", "description": "Almost like their NFL counterparts, check out these players thread the needle through some trees on course. SUBSCRIBE to PGA TOUR now: http://pgat.us/vBxcZSh...", "url": "https://www.youtube.com/watch?v=Y2QWsaAycQI", "urlToImage": null, "publishedAt": "2020-04-23T22:18:55Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Judge, Stanton, and Paxton updates from Aaron Boone and much more - YESNetwork", "description": "Yankees manager Aaron Boone on the status of Aaron Judge, Giancarlo Stanton, and James Paxton, as well as his thoughts on the punishment MLB handed the Red S...", "url": "https://www.youtube.com/watch?v=HgCi5qNcqc0", "urlToImage": null, "publishedAt": "2020-04-23T20:56:48Z", "content": "Yankees manager Aaron Boone on the status of Aaron Judge, Giancarlo Stanton, and James Paxton, as well as his thoughts on the punishment MLB handed the Red Sox and more. Subscribe for daily sports videos!\r\nYES' social media pages:TikTok: tiktok.com/@YESnetwor… [+130 chars]"}, {"source": {"id": null, "name": "Crimsonandcreammachine.com"}, "author": "Jack Shields", "title": "2020 NFL Draft Profile: Oklahoma Football DT Neville Gallimore - Crimson And Cream Machine", "description": "Big Canada finally broke out as a senior under first-year DC Alex Grinch and his new scheme.", "url": "https://www.crimsonandcreammachine.com/2020/4/23/21233097/2020-nfl-draft-profile-dt-neville-gallimore-ottawa-ontario-canada-prep-football-academy", "urlToImage": null, "publishedAt": "2020-04-23T20:30:13Z", "content": "On Jan. 3 of 2015, the Oklahoma Sooners received a commitment from a young Canadian who appeared more than cut out to be the dominant defensive lineman the program had been lacking for so long. It took longer than expected for that potential to be fully reali… [+3142 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "History of the Premier League from 1992 to 2019 | NBC Sports - NBC Sports", "description": "Dive back into the Premier League's 27-season history, from its formation in 1992 through Manchester City's record-setting 2018-19 campaign. #NBCSports #Prem...", "url": "https://www.youtube.com/watch?v=E0i5JMdVHx8", "urlToImage": null, "publishedAt": "2020-04-23T20:00:08Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Burrow is going to Bengals no question, Tua could drop out of top 10 — Jay Glazer | NFL | THE HERD - The Herd with Colin Cowherd", "description": "Colin Cowherd is excited to talk the 2020 NFL Draft, and he brings on Jay Glazer to walk him through how he thinks things will play out tonight. First they t...", "url": "https://www.youtube.com/watch?v=k-rxcyENLIU", "urlToImage": null, "publishedAt": "2020-04-23T19:58:44Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Best of Rookies - Golden State Warriors", "description": "From behind-the-scenes moments to their hustle on the court, take a look back at some of the top moments from the Warriors' rookies.", "url": "https://www.youtube.com/watch?v=7Jilhn_-tw4", "urlToImage": null, "publishedAt": "2020-04-23T19:00:02Z", "content": null}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Scott Boeck", "title": "Hall of Fame broadcaster Vin Scully hospitalized after fall and is 'resting comfortably' - USA TODAY", "description": "Hall of Fame broadcaster Vin Scully, 92, was hospitalized after falling in his home on Tuesday. He is \"resting comfortably,\" the Dodgers tweeted.", "url": "https://www.usatoday.com/story/sports/mlb/dodgers/2020/04/23/vin-scully-hall-of-fame-dodgers-broadcaster-hospitalized/3012240001/", "urlToImage": null, "publishedAt": "2020-04-23T18:11:15Z", "content": "Rookie Charlie Culberson set up Scully with a two-out homer in the bottom of the 10th inning that lifted the Dodgers to a 4-3 victory and clinched the NL West division title.\r\nHall of Fame broadcaster Vin Scully was hospitalized after falling Tuesday in his S… [+1206 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "'Great' Moments From Wayne Gretzky vs. Alexander Ovechkin NHL 20 Battle - SPORTSNET", "description": "Check out some of the key moments from The Great One taking on the Great 8 in an NHL 20 battle for charity. ---------------------------------------------- Su...", "url": "https://www.youtube.com/watch?v=9YLgv_BvkaY", "urlToImage": null, "publishedAt": "2020-04-23T16:36:25Z", "content": "Check out some of the key moments from The Great One taking on the Great 8 in an NHL 20 battle for charity.---------------------------------------------- \r\nSubscribe to Sportsnet on YouTube - http://sprtsnt.ca/2paAT2L\r\nVisit Sportsnet.ca for more sports news … [+315 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NFL Draft 2020: What we want to see in first round | Pro Football Talk | NBC Sports - NBC Sports", "description": "Mike Florio and Chris Simms take turns drafting the things they are looking forward to seeing the most in the opening round of the 2020 NFL Draft. #NBCSports...", "url": "https://www.youtube.com/watch?v=S3sYz0eaBQo", "urlToImage": null, "publishedAt": "2020-04-23T15:45:55Z", "content": null}, {"source": {"id": null, "name": "Bigblueview.com"}, "author": "Chris Pflum", "title": "2020 NFL Draft prospect profile: Tristan Wirfs, OT, Iowa - Big Blue View", "description": "Is Wirfs the tackle for the Giants?", "url": "https://www.bigblueview.com/2020/4/23/21231202/2020-nfl-draft-prospect-profile-tristan-wirfs-ot-iowa-scouting-report-ny-giants", "urlToImage": null, "publishedAt": "2020-04-23T12:09:01Z", "content": "Throughout the process leading up to the 2020 NFL Draft there have been two constants. The first is the focus upon the offensive tackle position for the Giants in the first round, and the second is that Iowas Tristan Wirfs has been one of the tackles under he… [+5086 chars]"}]}