{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Nbcsports.com"}, "author": "NBC Sports Staff", "title": "2020 NFL Draft order: Latest list of all picks, selections from Round 1 through Round 7 - NBC Sports - Misc.", "description": "The 2020 NFL Draft is happening now for all 32 teams and runs through Saturday, April 25. Rounds 2 and 3 will air on Friday, while rounds 4-7 are on Saturday. For those who want to see where every pick is in the NFL Draft order, see below. For the first time …", "url": "https://sports.nbcsports.com/2020/04/25/nfl-draft-order-2020/", "urlToImage": null, "publishedAt": "2020-04-25T04:08:00Z", "content": "The 2020 NFL Draft is happening now for all 32 teams and runs through Saturday, April 25. Rounds 2 and 3 will air on Friday, while rounds 4-7 are on Saturday. For those who want to see where every pick is in the NFL Draft order, see below.\r\nFor the first time… [+9697 chars]"}, {"source": {"id": null, "name": "Dailynorseman.com"}, "author": "Christopher Gates", "title": "2020 NFL Draft Trades: Minnesota Vikings make deal with New Orleans Saints - Daily Norseman", "description": "Another deal for Rick Spielman", "url": "https://www.dailynorseman.com/2020/4/24/21233432/2020-nfl-draft-trades-minnesota-vikings-make-deal-with-new-orleans-saints", "urlToImage": null, "publishedAt": "2020-04-25T04:03:35Z", "content": "Rick Spielman has made the decision to move around the draft board, as the Minnesota Vikings have swung a deal with the New Orleans Saints.\r\nTrade between the Minnesota Vikings and New Orleans Saints\r\nMinnesota Vikings receive: #130 (fourth round), #169 (fift… [+1075 chars]"}, {"source": {"id": null, "name": "Bigblueview.com"}, "author": "Ed Valentine", "title": "NFL Draft results: Giants select UConn OT Matt Peart in Round 3 - Big Blue View", "description": "Giants take another offensive tackle", "url": "https://www.bigblueview.com/2020/4/24/21229879/nfl-draft-results-round-3-2020-ny-giants-pick-matt-peart-uconn", "urlToImage": null, "publishedAt": "2020-04-25T03:58:54Z", "content": "The New York Giants have selected UConn offensive tackle Matt Peart in Round 3 of the 2020 NFL Draft, 99th overall. That means the Giants are doubling down on the tackle spot, having selected Andrew Thomas No. 4 overall.\r\nIn his Peart prospect profile, Chris … [+3084 chars]"}, {"source": {"id": null, "name": "Behindthesteelcurtain.com"}, "author": "Jeff.Hartman", "title": "2020 NFL Draft: Steelers select OLB Alex Highsmith with 3rd round pick - Behind the Steel Curtain", "description": "The Pittsburgh Steelers have selected Alex Highsmith with their 3rd round pick.", "url": "https://www.behindthesteelcurtain.com/2020/4/24/21234488/2020-nfl-draft-results-pittsburgh-steelers-select-olb-alex-highsmith-with-3rd-round-pick-charlotte", "urlToImage": null, "publishedAt": "2020-04-25T03:50:36Z", "content": "Entering the 2020 NFL Draft, the Pittsburgh Steelers had a number of draft needs which they needed to address. With no first round selection in the draft, running back, safety and even pass rusher were still positions of need to help the black-and-gold get to… [+1540 chars]"}, {"source": {"id": null, "name": "Clevelandbrowns.com"}, "author": null, "title": "Browns select LSU LB Jacob Phillips with No. 97 pick in 2020 NFL Draft - clevelandbrowns.com", "description": "Cleveland adds another national championship winner on Day 2", "url": "https://www.clevelandbrowns.com/news/browns-select-lsu-lb-jacob-phillips-with-no-97-pick-in-2020-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-25T03:39:20Z", "content": "Phillips, a Nashville native, started all 15 games during the Tigers' 2019 national championship season and led the team with 113 tackles. The previous year, he started 11 games and compiled 87 tackles and a pick-six interception.\r\nThe Browns acquired the No.… [+158 chars]"}, {"source": {"id": null, "name": "Raiders.com"}, "author": null, "title": "The X-Factor: Lynn Bowden Jr. brings a unique skill set to the Raiders The Las - Raiders.com", "description": "The Las Vegas Raiders have selected the Nation's Most Versatile Player with the No. 80 overall pick of the 2020 NFL Draft.", "url": "https://www.raiders.com/news/the-x-factor-lynn-bowden-jr-brings-a-unique-skill-set-to-the-raiders", "urlToImage": null, "publishedAt": "2020-04-25T03:30:00Z", "content": "Right now, Las Vegas Raiders Head Coach Jon Gruden is rubbing his palms together, grinning from ear to ear.\r\nWhy?\r\nBecause the Silver and Black just drafted the most versatile player in the country, and he's got a new toy in the sandbox.\r\nWith the No. 80 over… [+1064 chars]"}, {"source": {"id": null, "name": "Boston.com"}, "author": "nicole-yang", "title": "The Patriots select a pair of tight ends in third round of 2020 NFL Draft - Boston.com", "description": "UCLA's Devin Asiasi and Virginia Tech's Dalton Keene are heading to New England.", "url": "https://www.boston.com/sports/new-england-patriots/2020/04/24/patriots-draft-devin-asiasi", "urlToImage": null, "publishedAt": "2020-04-25T03:20:17Z", "content": "The Patriots selected a pair of tight ends UCLAs Devin Asiasi and Virginia Techs Dalton Keene in the third round of the 2020 NFL Draft Friday night.\r\nNew England traded up to secure both players, Asiasi with the 87th overall pick and Keene with the 101st. The… [+1019 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Rob Demovsky", "title": "Packers' Jordan Love says Aaron Rodgers congratulated him on pick - ESPN", "description": "Jordan Love, the Green Bay Packers' first-round pick in the NFL draft, told ESPN's Maria Taylor on Friday that he and Aaron Rodgers had a good first interaction, and Rodgers congratulated him on joining the team.", "url": "https://www.espn.com/nfl/story/_/id/29096298/packers-jordan-love-says-aaron-rodgers-congratulated-pick", "urlToImage": null, "publishedAt": "2020-04-25T03:03:45Z", "content": "GREEN BAY, Wis. -- It took less than 24 hours for the Green Bay Packers' quarterback of the future to connect with the quarterback of the present.\r\nJordan Love, the Green Bay Packers' first-round pick in the NFL draft, told ESPN's Maria Taylor on Friday that … [+1581 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "2020 NFL Draft: Cowboys pick Neville Gallimore, draft grade, scouting report and more to know - CBS Sports", "description": "Here's what you need to know about the Oklahoma defensive lineman after his selection in the NFL Draft", "url": "https://www.cbssports.com/nfl/draft/news/2020-nfl-draft-cowboys-pick-neville-gallimore-draft-grade-scouting-report-and-more-to-know/", "urlToImage": null, "publishedAt": "2020-04-25T02:57:57Z", "content": "The Cowboys selected Oklahoma defensive lineman Neville Gallimore with the No. 82 overall pick in the third round of the 2020 NFL Draft. The CBS Sports NFL Draft team breaks down the pick below, including a grade for the pick, how it affects fantasy leagues a… [+1056 chars]"}, {"source": {"id": null, "name": "Detroitlions.com"}, "author": null, "title": "A CLOSER LOOK: Defensive end Julian Okwara - detroitlions.com", "description": "Tim Twentyman and Mike O’Hara share their thoughts on the Lions’ third-round selection of defensive end Julian Okwara.", "url": "https://www.detroitlions.com/news/a-closer-look-defensive-end-julian-okwara", "urlToImage": null, "publishedAt": "2020-04-25T02:32:22Z", "content": "Bio: Younger brother of Detroit Lions defensive end Romeo Okwara. Four-year player at South Bend, became a full-time starter in 2018 and had his best season: 12.5 tackles for loss with 8 sacks in 13 games, with 12 starts.\r\nOn the way to another good season bu… [+435 chars]"}, {"source": {"id": null, "name": "Denverpost.com"}, "author": "Ryan O’Halloran", "title": "Cornerback Michael Ojemudia drafted by Denver Broncos in third round of NFL draft - The Denver Post", "description": "The Broncos started their busy third round tonight by using the 77th overall pick on Iowa cornerback Michael Ojemudia.", "url": "https://www.denverpost.com/2020/04/24/michael-ojemudia-denver-broncos-nfl-draft/", "urlToImage": null, "publishedAt": "2020-04-25T02:23:00Z", "content": "The Broncos started their busy third round Friday night by using the 77th overall pick on Iowa cornerback Michael Ojemudia. \r\nOjemudia joins receivers Jerry Jeudy (first round) and KJ Hamler (second round) as the Broncos first three picks. \r\nWhen I saw the ar… [+1704 chars]"}, {"source": {"id": null, "name": "Cleveland.com"}, "author": "Nathan Baird, cleveland.com", "title": "What Ohio State football’s J.K. Dobbins said about playing for Michigan coach Jim Harbaugh’s brother, John, w - cleveland.com", "description": "Baltimore selected Dobbins with the 55th overall selection of NFL Draft 2020.", "url": "https://www.cleveland.com/osu/2020/04/what-ohio-state-footballs-jk-dobbins-said-about-playing-for-michigan-coach-jim-harbaughs-brother-john-with-ravens.html", "urlToImage": null, "publishedAt": "2020-04-25T02:08:00Z", "content": "COLUMBUS, Ohio -- J.K. Dobbins spent three seasons trying to run all over the Michigan team coached by Jim Harbaugh.\r\nNow a coach of the same name has summoned him to bring those running back talents to the NFL. The Baltimore Ravens and coach John Harbaugh Ji… [+1299 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Jeff Dickerson", "title": "Bears select Notre Dame's Cole Kmet in NFL Draft, giving them 10 tight ends - ESPN", "description": "After going through the 2019 season with the least productive tight end group in the NFL, the Bears continued revamping their roster by taking Notre Dame's Cole Kmet in the 2nd round of the NFL draft.", "url": "https://www.espn.com/nfl/story/_/id/29096124/bears-draft-notre-dame-cole-kmet-giving-10-tight-ends", "urlToImage": null, "publishedAt": "2020-04-25T02:03:02Z", "content": "The Chicago Bears must believe in the strength in numbers theory at tight end.\r\nOn Friday, the Bears made yet another attempt to improve their fortunes at tight end by using the 43rd overall pick of the 2020 NFL draft on Notre Dame's Cole Kmet, who became the… [+2398 chars]"}, {"source": {"id": null, "name": "Cincyjungle.com"}, "author": "Jason Marcum", "title": "Bengals select Logan Wilson in Round 3 of 2020 NFL Draft - Cincy Jungle", "description": "The Bengals finally address linebacker.", "url": "https://www.cincyjungle.com/2020/4/24/21235420/bengals-picks-2020-nfl-draft-logan-wilson-wyoming-cowboys", "urlToImage": null, "publishedAt": "2020-04-25T01:58:36Z", "content": "With the 65th overall pick of the 2020 NFL Draft, the Cincinnati Bengals have selected Wyoming Cowboys linebacker Logan Wilson. \r\nAfter the Bengals addressed quarterback (Joe Burrow) and wide receiver (Tee Higgins) with their first two picks, they had a littl… [+1006 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Brian Costello", "title": "Jets select Ashtyn Davis with No. 68 pick in NFL Draft - New York Post ", "description": "After going offense on their first two picks, the Jets got a new toy for defensive coordinator Gregg Williams with their first of three picks in the third round of the NFL Draft on Friday night. Th…", "url": "https://nypost.com/2020/04/24/jets-select-ashtyn-davis-with-no-68-pick-in-nfl-draft/", "urlToImage": null, "publishedAt": "2020-04-25T01:57:35Z", "content": "After going offense on their first two picks, the Jets got a new toy for defensive coordinator Gregg Williams with their first of three picks in the third round of the NFL Draft on Friday night.\r\nThe Jets took Cal safety Ashtyn Davis with the No. 68 overall p… [+534 chars]"}, {"source": {"id": null, "name": "Catscratchreader.com"}, "author": "Brian Beversluis", "title": "2020 NFL Draft: Carolina Panthers select S Jeremy Chinn with the No. 64 overall pick - Cat Scratch Reader", "description": "The Carolina Panthers bolstered their secondary by adding versatile safety Jeremy Chinn.", "url": "https://www.catscratchreader.com/2020/4/24/21232536/2020-nfl-draft-carolina-panthers-select-jeremy-chinn-with-the-no-64-overall-pick-after-trading-up", "urlToImage": null, "publishedAt": "2020-04-25T01:49:38Z", "content": "The Carolina Panthers have selected Jeremy Chinn from Southern Illinois with the No. 64 overall pick in the 2020 NFL Draft. They traded No. 69 and 148 to get there.\r\nJeremy Chinn played four seasons at Southern Illinois, lining up all over the place in the de… [+898 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Jamison Hensley", "title": "Ravens take Buckeyes' J.K. Dobbins in NFL draft on heels of record rushing season - ESPN", "description": "A year after setting the NFL's single-season rushing record, the Ravens used a second-round pick on Ohio State running back J.K. Dobbins.", "url": "https://www.espn.com/nfl/story/_/id/29096045/ravens-take-buckeyes-jk-dobbins-heels-record-rushing-season", "urlToImage": null, "publishedAt": "2020-04-25T01:45:53Z", "content": "OWINGS MILLS, Md. -- A year after setting the NFL's single-season rushing record, the Baltimore Ravens used a second-round pick in the 2020 NFL draft on Ohio State running back J.K. Dobbins.\r\nEditor's Picks\r\nRavens general manager Eric DeCosta said he wanted … [+1437 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Jenna Laine", "title": "Tampa Bay Bucs take DB Antoine Winfield Jr., whose dad played against Tom Brady - ESPN", "description": "Antoine Winfield Jr., who went to the Bucs with the No. 45 overall pick, said it was \"crazy\" to land on the same team as Tom Brady, who faced his dad, Antoine Winfield Sr., seven times in the NFL.", "url": "https://www.espn.com/nfl/draft2020/story/_/id/29096050/tampa-bay-bucs-take-db-antoine-winfield-jr-dad-played-tom-brady", "urlToImage": null, "publishedAt": "2020-04-25T01:45:53Z", "content": "TAMPA, Fla. -- Just how old is Tom Brady? Old enough to have once been intercepted by the father of his new teammate Antoine Winfield Jr., whom the Tampa Bay Buccaneers selected in the second round (No. 45) of the 2020 NFL draft Friday.\r\nOn Nov. 11, 2001, Win… [+2114 chars]"}, {"source": {"id": null, "name": "Fieldgulls.com"}, "author": "John P. Gilbert", "title": "Why the Seahawks traded pick 64 to the Carolina Panthers - Field Gulls", "description": "After trading up to select Darrell Taylor out of Tennessee earlier in the second round, the Seattle Seahawks then trade back out of their second pick in the round.   Seattle trades: Pick 64.C...", "url": "https://www.fieldgulls.com/2020/4/24/21235427/seattle-seahawks-trade-pick-64-to-carolina-panthers", "urlToImage": null, "publishedAt": "2020-04-25T01:44:30Z", "content": "After trading up to select Darrell Taylor out of Tennessee earlier in the second round, the Seattle Seahawks then trade back out of their second pick in the round.\r\nSeattle trades: Pick 64.\r\nCarolina trades: Pick 69, Pick 148.\r\n Field Yates (@FieldYates) Apri… [+699 chars]"}, {"source": {"id": null, "name": "Buffalobills.com"}, "author": null, "title": "2020 NFL Draft: Defensive end, AJ Epenesa, Iowa, pick No. 54 - BuffaloBills.com", "description": "The Bills added a defensive lineman with their first pick of the 2020 NFL Draft.", "url": "https://www.buffalobills.com/news/aj-epenesa-nfl-draft-defensive-end-iowa", "urlToImage": null, "publishedAt": "2020-04-25T01:39:07Z", "content": "5. Culture on his arm\r\nA.J. has tattoos all up and down his right arm. They are a representation of his Samoan family roots.\r\n\"The birds, the tortoise shells, the fish, the leaves,\" Epenesa told the Iowa Gazette. \"All of these just have significant meaning in… [+104 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Cowboys get a TOP NOTCH player in Trevon Diggs with the 51st overall pick | 2020 NFL Draft - CBS Sports", "description": "With the 51st pick in the 2020 NFL Draft, the Dallas Cowboys select Trevon Diggs, CB from Alabama. Our CBS Sports HQ crew breaks down the selection, providin...", "url": "https://www.youtube.com/watch?v=CIPqroXgCyM", "urlToImage": null, "publishedAt": "2020-04-25T01:33:50Z", "content": null}, {"source": {"id": null, "name": "Espn.com"}, "author": "Tim McManus", "title": "Eagles surprisingly take Sooners QB Jalen Hurts in 2nd round of NFL draft - ESPN", "description": "In a surprise move, the Philadelphia Eagles selected Oklahoma Sooners quarterback Jalen Hurts in the second round of the NFL draft on Friday.", "url": "https://www.espn.com/nfl/story/_/id/29095862/eagles-surprisingly-take-sooners-qb-jalen-hurts-2nd-round-draft", "urlToImage": null, "publishedAt": "2020-04-25T01:27:18Z", "content": "PHILADELPHIA -- In a surprise move, the Philadelphia Eagles selected Oklahoma Sooners quarterback Jalen Hurts in the second round of the 2020 NFL draft on Friday.\r\nHurts represents good value at No. 53 overall, but the Eagles are locked into quarterback Carso… [+1259 chars]"}, {"source": {"id": null, "name": "Sfchronicle.com"}, "author": "Eric Branch", "title": "49ers draft pick Javon Kinlaw is Kyle Shanahan’s latest pass rush crush - San Francisco Chronicle", "description": "<p>Kyle Shanahan is known for his offensive mind, but he’s paid particular mind to drafting defensive linemen since he became 49ers head coach in 2017. That’s nothing new. Shanahan, dating to high school, has appreciated the importance of strong pass rushers.…", "url": "https://www.sfchronicle.com/49ers/article/49ers-draft-pick-Javon-Kinlaw-is-Kyle-15225091.php", "urlToImage": null, "publishedAt": "2020-04-25T01:22:05Z", "content": "Let’s start more than two decades ago when 49ers head coach Kyle Shanahan, now a celebrated offensive NFL mind, was attending Cherry Creek High School in suburban Denver.\r\n“Ask my high school friends when we (played) ‘Madden,’” Shanahan said. “… My first pick… [+4907 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Mike Bohn", "title": "UFC 249: Joe Rogan slated to be part of broadcast team - MMA Junkie", "description": "After all the hoopla, Joe Rogan is indeed planned to be on commentary for UFC 249.", "url": "https://mmajunkie.usatoday.com/2020/04/joe-rogan-ufc-249-commentary-team-jon-anik-daniel-cormier", "urlToImage": null, "publishedAt": "2020-04-25T01:15:22Z", "content": "After all the hoopla, Joe Rogan is indeed planned to be on commentary for UFC 249.\r\nAs the coronavirus pandemic became a bigger issue in the U.S., Rogan, the longtime UFC color commentator, expressed concern about calling fights in a time with so much uncerta… [+1376 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Mike Wells", "title": "Colts trade up in NFL draft to take Wisconsin RB Jonathan Taylor - ESPN", "description": "The Colts traded up three spots during Friday's second round to select Wisconsin running back Jonathan Taylor at No. 41, giving new quarterback Philip Rivers another threat out of the backfield.", "url": "https://www.espn.com/nfl/story/_/id/29095812/colts-trade-draft-wisconsin-rb-jonathan-taylor", "urlToImage": null, "publishedAt": "2020-04-25T00:49:19Z", "content": "INDIANAPOLIS -- New Colts quarterback Philip Rivers will have another threat out of the backfield to turn to next season.\r\nThe Colts jumped three spots in the 2020 NFL draft to add to what was a top-10 rushing offense last season when they selected Wisconsin … [+3508 chars]"}, {"source": {"id": null, "name": "Therams.com"}, "author": null, "title": "2020 NFL Draft: Running Back Cam Akers, Florida State, Round 2, Pick 52 - therams.com", "description": "Rams select Florida State RB Cam Akers with the No. 52 pick in the 2020 NFL Draft.", "url": "https://www.therams.com/news/cam-akers-nfl-draft-running-back-florida-state", "urlToImage": null, "publishedAt": "2020-04-25T00:44:53Z", "content": "The Los Angeles Rams have selected Florida State junior running back Cam Akers with the No. 52 pick in the 2020 NFL Draft.\r\nA second-team All-ACC selection, Akers rushed for 1,144 rushing yards and 14 touchdowns on 231 carries in 2019. In the passing game, he… [+477 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Ian Doyle", "title": "Only realistic way Liverpool can now lose Premier League title - Liverpool Echo", "description": "Ian Doyle discusses Liverpool, the Premier League title and the void in the latest Blood Red column", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/only-realistic-way-liverpool-can-18148023", "urlToImage": null, "publishedAt": "2020-04-25T00:08:28Z", "content": "It's all about the void for Liverpool at present.\r\nAnd we're not talking about the prospect of the Premier League season being scrapped.\r\nWell, not exclusively, at any rate.\r\nInstead, it's the huge chasm that has been left by the absence of football - and, ju… [+3501 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "James Harden's Debut For The Rockets | #NBATogetherLive Classic Game - NBA", "description": "Throwback to the first game James Harden suited up for the Houston Rockets Subscribe to the NBA: https://on.nba.com/2JX5gSN Full Game Highlights Playlist: ht...", "url": "https://www.youtube.com/watch?v=-zzSYS3DRg0", "urlToImage": null, "publishedAt": "2020-04-25T00:01:30Z", "content": null}, {"source": {"id": null, "name": "Hogshaven.com"}, "author": "Scott Jennings", "title": "Trent Williams Redskins Trade Rumors: The 49ers are interested, and the Vikings are out? - Hogs Haven", "description": "Will the saga end tonight?", "url": "https://www.hogshaven.com/2020/4/24/21235447/trent-williams-redskins-trade-rumors-the-49ers-are-interested-and-the-vikings-are-out", "urlToImage": null, "publishedAt": "2020-04-25T00:00:59Z", "content": "Another day, and another rumor surrounding the Trent Williams trade saga. The Buccaneers have been outed as a team that was interested in trading for Williams until they picked Tristan Wirfs last night. The Browns and Jets were also linked to a Trent Williams… [+1656 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": null, "title": "What the Colts got with what would have been the Redskins second-round pick - NBCSports.com", "description": "The Colts used the pick they got in the trade that allowed Washington to take Montez Sweat.", "url": "https://www.nbcsports.com/washington/redskins/heres-what-colts-got-out-what-would-have-been-redskins-second-round-pick", "urlToImage": null, "publishedAt": "2020-04-24T23:59:18Z", "content": "Thursday night was beautiful. An evening with a slice of normalcy. A sporting event that we got to watch, that we did not know the outcome to, for the first time in over a month. And for those watching the betting odds closely, after Joe Burrow and Chase Youn… [+4427 chars]"}, {"source": {"id": null, "name": "Detroitlions.com"}, "author": null, "title": "A CLOSER LOOK: Running back D'Andre Swift - detroitlions.com", "description": "Tim Twentyman and Mike O’Hara share their thoughts on the Lions’ second-round selection of D'Andre Swift.", "url": "https://www.detroitlions.com/news/a-closer-look-running-back-d-andre-swift", "urlToImage": null, "publishedAt": "2020-04-24T23:55:11Z", "content": "Bio: Early success for Swift, who played Pop Warner football growing up in Philadelphia and was on three state championship teams in four years of high school.\r\nRunning the ball three seasons against tough SEC competition, he rushed for 1,049 yards in 2018 an… [+528 chars]"}, {"source": {"id": null, "name": "Panthers.com"}, "author": null, "title": "2020 NFL Draft: DE Yetur Gross-Matos, Penn State, Round 2, Pick 38 - Panthers.com", "description": "A two-time, first-team All-Big Ten honoree, Gross-Matos recorded 19 sacks in his three seasons at Penn State.", "url": "https://www.panthers.com/news/yetur-gross-matos-nfl-draft-defensive-end-penn-state", "urlToImage": null, "publishedAt": "2020-04-24T23:41:47Z", "content": "Similar to Brown, Gross-Matos has positional flexibility along the defensive line. He's played on both the interior and as an edge rusher, and that versatility falls in line with what head coach Matt Rhule said at the about wanting to have \"positionless playe… [+766 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "UFC Announces 3 Cards Set for May in Jacksonville Reaction - MMA Fighting - MMAFightingonSBN", "description": "UFC president Dana White announced on Friday that the promotion would return with a trio of cards set for May 9, May 13 and May 16 with all three shows takin...", "url": "https://www.youtube.com/watch?v=RmaWCqA24CQ", "urlToImage": null, "publishedAt": "2020-04-24T22:55:15Z", "content": "UFC president Dana White announced on Friday that the promotion would return with a trio of cards set for May 9, May 13 and May 16 with all three shows taking place in Jacksonville, Fla. Now MMA Fighting's Mike Heck and Jose Youngs react to the news as the UF… [+554 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Paul Kasabian", "title": "Tony Dungy: Bucs 'Definitely Going' to Super Bowl After Adding Brady, Gronkowski - Bleacher Report", "description": "The  Tampa Bay Buccaneers ' hype train has left the station after the team signed six-time Super Bowl champion Tom Brady and traded for four-time All-Pro tight end  Rob Gronkowski  this offseason...", "url": "https://bleacherreport.com/articles/2888531-tony-dungy-bucs-definitely-going-to-super-bowl-after-adding-brady-gronkowski", "urlToImage": null, "publishedAt": "2020-04-24T22:25:16Z", "content": "John McCoy/Getty Images\r\nThe Tampa Bay Buccaneers' hype train has left the station after the team signed six-time Super Bowl champion Tom Brady and traded for four-time All-Pro tight end Rob Gronkowski this offseason.\r\nSuper Bowl-winning head coach and curren… [+1100 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "2020 NFL Draft: Titans coach has an explanation for that extremely awkward looking situation at his house - CBS Sports", "description": "Did someone get caught on camera using the bathroom at Mike Vrabel's house?", "url": "https://www.cbssports.com/nfl/news/2020-nfl-draft-titans-coach-has-an-explanation-for-that-extremely-awkward-looking-situation-at-his-house/", "urlToImage": null, "publishedAt": "2020-04-24T21:55:02Z", "content": "With the NFL Draft being held virtually for the first time ever this year, we got to see some interesting things during the first round on Thursday. Not only did we see Jerry Jones making picks from his $250 million yacht, but we also got to see Cardinals coa… [+1950 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Meade", "title": "Gary Neville warns people are getting \"carried away\" with Man Utd target Jadon Sancho - Mirror Online", "description": "Man Utd legend Gary Neville has put Jadon Sancho's quality into context compared to some of the world's best players", "url": "https://www.mirror.co.uk/sport/football/news/gary-neville-warns-people-getting-21923589", "urlToImage": null, "publishedAt": "2020-04-24T21:41:45Z", "content": "Gary Neville claims Manchester United target Jadon Sancho is \"nowhere near\" some of the world's elite.\r\nThe Red Devils have been linked with the Borussia Dortmund star who is likely to cost around £100m.\r\nMuch is made of the Englishman's exploits in the Bunde… [+1834 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Charles Goldman", "title": "Clyde Edwards-Helaire to wear No. 25 jersey with Chiefs - Chiefs Wire", "description": "Clyde Edwards-Helaire took one of the best running back jersey numbers.", "url": "https://chiefswire.usatoday.com/2020/04/24/kansas-city-chiefs-clyde-edwards-helaire-jersey-number-25/", "urlToImage": null, "publishedAt": "2020-04-24T21:10:15Z", "content": "The Kansas City Chiefs have announced the jersey number of first-round draft pick Clyde Edwards-Helaire and it’s a good one.\r\nEdwards-Helaire wore the No. 22 jersey at LSU, but defensive back Juan Thornhill wears that number with Kansas City. Thornhill wasn’t… [+1136 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Sarah Barshop", "title": "Source - Texans begin extension talks with Deshaun Watson - ESPN", "description": "The Texans have opened preliminary extension talks with quarterback Deshaun Watson, who is eligible for a new contract for the first time this offseason.", "url": "https://www.espn.com/nfl/story/_/id/29095080/source-texans-begin-extension-talks-deshaun-watson", "urlToImage": null, "publishedAt": "2020-04-24T21:07:25Z", "content": "HOUSTON -- The Texans have engaged in \"very preliminary\" discussions with quarterback Deshaun Watson about a potential contract extension, a source told ESPN's Ed Werder.\r\nOn Friday, Houston finalized a three-year, $66 million contract extension with left tac… [+1830 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Rachel Handler", "title": "The Only Good Look Is Michael Jordan’s ’90s Practice Uniform - Vulture", "description": "The Last Dance has entirely changed my quarantine wardrobe.", "url": "http://www.vulture.com/2020/04/the-last-dance-michael-jordan-practice-uniform.html", "urlToImage": null, "publishedAt": "2020-04-24T20:16:21Z", "content": "Much has been written about how we should dress while social distancing. Some people believe we should wake up every morning and put on the same clothes we would normally wear to work. These people frighten me, and I am going to move on without addressing the… [+9919 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Justin Herbert compares his game to Matt Ryan, talks Draft, Chargers, Oregon & more | NFL | THE HERD - The Herd with Colin Cowherd", "description": "Justin Herbert joins Colin Cowherd to discuss football. Hear his account of draft night, who he compares his game to, his time at Oregon as well as what he l...", "url": "https://www.youtube.com/watch?v=zbpy00fDA1k", "urlToImage": null, "publishedAt": "2020-04-24T20:02:14Z", "content": "Justin Herbert joins Colin Cowherd to discuss football. Hear his account of draft night, who he compares his game to, his time at Oregon as well as what he looks forward to joining the Los Angeles Chargers.\r\n#TheHerd#NFL#JustinHerbert#MattRyan#Chargers#NFLDra… [+1275 chars]"}, {"source": {"id": null, "name": "Newser.com"}, "author": "Bob Cronin", "title": "Brother of Cowboys QB Dies at 31 - Newser", "description": "Jace Prescott played college ball for Northwestern State", "url": "https://www.newser.com/story/290035/brother-of-cowboys-qb-dies-at-31.html", "urlToImage": null, "publishedAt": "2020-04-24T19:45:00Z", "content": "(Newser)\r\nJace Prescott, a former offensive lineman at Northwestern State and older brother of Dallas Cowboys quarterback Dak Prescott, died Thursday. The Cowboys announced the death, CBS Sports reports, but did not give the cause. \"He was a great kid who dom… [+691 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Brad Keselowski breakdown: Winning moves, key decisions in first victory | Talladega Superspeedway - NASCAR", "description": "Brad Keselowski's first NASCAR Cup Series win was memorable for its thrilling, controversial conclusion. The Team Penske driver sits down to analyze and expl...", "url": "https://www.youtube.com/watch?v=8EYwW6uV6s0", "urlToImage": null, "publishedAt": "2020-04-24T19:11:42Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Behind-The-Scenes Of Patrick Queen's Draft Call | Baltimore Ravens - Baltimore Ravens", "description": "Eric DeCosta said he wants to follow in Ozzie Newsome’s footsteps of drafting Pro Bowl inside linebackers but with his own twist of making the Ravens’ first ...", "url": "https://www.youtube.com/watch?v=xM_wnoRKQFc", "urlToImage": null, "publishedAt": "2020-04-24T19:04:14Z", "content": "Eric DeCosta said he wants to follow in Ozzie Newsomes footsteps of drafting Pro Bowl inside linebackers but with his own twist of making the Ravens first pick from LSU.\r\n#BaltimoreRavens#Ravens#NFL\r\nSubscribe to the Baltimore Ravens YT Channel: https://goo.g… [+436 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Andersen reveals the best and worst part about isolating with Matthews - TSN", "description": "Maple Leafs goaltender Frederik Andersen joins James Duthie to talk about what isolation has been like with Auston Matthews down in Arizona. He also touches ...", "url": "https://www.youtube.com/watch?v=YMidEz7ODJo", "urlToImage": null, "publishedAt": "2020-04-24T17:30:31Z", "content": null}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Brooks Koepka Gets Quarantine Haircut From Model GF, 'It Did Not Go Well' - TMZ", "description": "\"It did not go well.\" That's how Brooks Koepka's model GF described the way she cut the PGA Tour star's hair during quarantine.", "url": "https://www.tmz.com/2020/04/23/brooks-keopka-pga-tour-jena-sims-quarantine-haircut/", "urlToImage": null, "publishedAt": "2020-04-24T17:22:17Z", "content": "\"It did not go well.\"\r\nThat's how Brooks Koepka's model GF described the way she cut the PGA Tour star's hair during quarantine ... and we gotta say, we agree -- but the whole process was at least funny as hell!!\r\nThe golf stud was in desperate need of a trim… [+842 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Michael Middlehurst-Schwartz", "title": "NFL draft 2020's best available players in second round: Grant Delpit, Laviska Shenault among top options on board - USA TODAY", "description": "There's still plenty of first-round talent available for teams on Day 2 of the NFL draft, including several promising options at safety and receiver.", "url": "https://www.usatoday.com/story/sports/nfl/draft/2020/04/24/nfl-draft-second-round-best-players-available-2020/3020500001/", "urlToImage": null, "publishedAt": "2020-04-24T17:10:28Z", "content": "SportsPulse: The first night of the NFL's virtual draft went off without a hitch and Mackenzie Salmon is here to break down the nights biggest winners and losers.\r\nUSA TODAY\r\nThere's still first-round talent awaiting teams on Day 2 of the 2020 NFL draft.\r\nThu… [+5255 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Chelsea know Arsenal are vulnerable & have to move Pierre-Emerick Aubameyang soon - Ogden | ESPN FC - ESPN UK", "description": "ESPN FC's Mark Ogden reacts to reports that Chelsea are planning to make a move on Arsenal's Pierre-Emerick Aubameyang during the summer transfer window. Ogd...", "url": "https://www.youtube.com/watch?v=cwci7EzTV-4", "urlToImage": null, "publishedAt": "2020-04-24T17:01:45Z", "content": "ESPN FC's Mark Ogden reacts to reports that Chelsea are planning to make a move on Arsenal's Pierre-Emerick Aubameyang during the summer transfer window. Ogden says despite Chelsea's interest, Aubameyang will probably have offers from bigger and better clubs.… [+171 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "PFT Draft: Biggest surprises from 2020 NFL Draft Round 1 | Pro Football Talk | NBC Sports - NBC Sports", "description": "Mike Florio and Chris Simms draft the biggest surprise moments from Round 1 of the 2020 NFL Draft, including Jordan Love to the Packers, Tua Tagovailoa to th...", "url": "https://www.youtube.com/watch?v=Zd0M7Kl7Cck", "urlToImage": null, "publishedAt": "2020-04-24T16:41:57Z", "content": null}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Jabari Young", "title": "Sports teams mull how to cover refunds and lost ticketing revenue - CNBC", "description": "The suspension of live events due to Cvoid-19 is hurting a sector in the sports world that, according to a study was projected to bring in $21.8 billion in 2023", "url": "https://www.cnbc.com/2020/04/24/sports-ticketing-will-look-different-as-teams-get-creative-without-fans.html", "urlToImage": null, "publishedAt": "2020-04-24T15:54:42Z", "content": "The seats are empty at the Amway Center in Orlando, home of the NBAs Orlando Magic, on Thursday, March 12, 2020. The NBA has suspended the season due to the coronavirus -- as have other sports.\r\nThere is a bubble on the verge of bursting throughout sports lea… [+10121 chars]"}, {"source": {"id": null, "name": "Sportbible.com"}, "author": "Daniel Marland", "title": "Mike Tyson Reveals He Is Training For A Surprise Return To Boxing - SPORTbible", "description": "'Iron Mike' is stepping back into the ring and boxing fans should be excited.", "url": "https://www.sportbible.com/boxing/boxing-news-legends-mike-tyson-reveals-he-is-training-for-surprise-return-to-boxing-20200424", "urlToImage": null, "publishedAt": "2020-04-24T15:09:27Z", "content": "Mike Tyson has revealed he is training for a sensational return to boxing and plans to take part in four round exhibition fights for charity.\r\n'Iron Mike' fell to defeat against Kevin McBride back in 2005 which proved to be the final professional fight of his… [+1694 chars]"}, {"source": {"id": null, "name": "Milehighreport.com"}, "author": "Jeff Essary", "title": "2020 NFL Draft Profile: Boise State Tackle Ezra Cleveland - Mile High Report", "description": "Does the Boise State product go from one Broncos team to another?", "url": "https://www.milehighreport.com/2020/4/24/21234034/2020-nfl-draft-profile-ezra-cleveland", "urlToImage": null, "publishedAt": "2020-04-24T12:10:47Z", "content": "Ezra Cleveland is a durable and decorated left tackle out of Boise State. He has started 40 games at left tackle in his college career. Cleveland came in as a redshirt freshman and started every possible game in the freshman, sophomore, and junior year before… [+4027 chars]"}, {"source": {"id": null, "name": "Windycitygridiron.com"}, "author": "Ken Mitchell", "title": "Chicago Bears Latest News: April 24, 2020 - Windy City Gridiron", "description": "Everybody else got the party started last night, but there ain’t a REAL party until WE show up!", "url": "https://www.windycitygridiron.com/2020/4/24/21233214/chicago-bears-den-nagy-pace-offseason-free-agency-draft-covid-19-mocks-rumors-bass-masters-geddy-lee", "urlToImage": null, "publishedAt": "2020-04-24T10:18:24Z", "content": "THE DAILY SPONGIE SPECIAL \r\nThis week we are on to Bass Master... who knows, there are so many greats this may end up being a multi-week thing... todays Bass Master is Geddy Lee.. \r\nBEAR DOWN, CHICAGO BEARS, BEAR DOWN!!!!\r\nBEARRRSSSS\r\nTristan Wirfs pool jumps… [+4369 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt, CNN", "title": "Hope Solo, former USWNT goalie, announces birth of twins - CNN", "description": "Former US goalkeeper Hope Solo and husband Jerramy Stevens have welcomed twins into the world, the soccer star announced on Thursday.", "url": "https://edition.cnn.com/2020/04/24/football/hope-solo-twins-intl-scli/index.html", "urlToImage": null, "publishedAt": "2020-04-24T09:45:38Z", "content": "(CNN)Former US goalkeeper Hope Solo and husband Jerramy Stevens have welcomed twins into the world, the soccer star announced on Thursday. \r\nFormer US Women's National Team goalkeeper and two-time Olympic gold medalist Solo announced the birth of her twins --… [+1149 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Sean Payton After Drafting Cesar Ruiz in 2020 NFL Draft | Saints Draft - New Orleans Saints", "description": "New Orleans Saints Head Coach Sean Payton talks to the media following day 1 of the 2020 NFL draft after the Saints selected Cesar Ruiz #24 overall with thei...", "url": "https://www.youtube.com/watch?v=zAJJfVl4fUA", "urlToImage": null, "publishedAt": "2020-04-24T05:59:21Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Instant Reaction: Dolphins protect Tua Tagovailoa, draft OT Austin Jackson at No. 18 | NBC Sports - NBC Sports", "description": "Peter King reacts after the Dolphins used their second first-round pick to protect Tua Tagovailoa and draft USC left tackle Austin Jackson at No. 18 overall....", "url": "https://www.youtube.com/watch?v=7jMg9qMWTjw", "urlToImage": null, "publishedAt": "2020-04-24T03:49:14Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Falcons make a DESPERATION PICK in A.J. Terrell at 16 | 2020 NFL Draft | CBS Sports HQ - CBS Sports", "description": "With the 16th pick in the 2020 NFL Draft, the Atlanta Falcons select A.J. Terrell, cornerback from Clemson. Our CBS Sports HQ crew breaks down the selection,...", "url": "https://www.youtube.com/watch?v=r7Wf-5K3-Bc", "urlToImage": null, "publishedAt": "2020-04-24T02:57:16Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Raiders select SPEEDSTER Henry Ruggs with the 12th overall pick | 2020 NFL Draft | CBS Sports HQ - CBS Sports", "description": "With the 12th pick in the 2020 NFL Draft, the Las Vegas Raiders select Henry Ruggs, wide receiver from Alabama. Our CBS Sports HQ crew breaks down the select...", "url": "https://www.youtube.com/watch?v=S9Bej0juDXA", "urlToImage": null, "publishedAt": "2020-04-24T02:16:50Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Instant Reaction: Arizona Cardinals take Isaiah Simmons at No. 8 | Pro Football Talk | NBC Sports - NBC Sports", "description": "Mike Florio breaks down what uber-versatile linebacker Isaiah Simmons brings to Arizona as the Cardinals draft the Clemson product at No. 8. #NBCSports #Isai...", "url": "https://www.youtube.com/watch?v=g7ia9hkYs38", "urlToImage": null, "publishedAt": "2020-04-24T02:14:41Z", "content": "Mike Florio breaks down what uber-versatile linebacker Isaiah Simmons brings to Arizona as the Cardinals draft the Clemson product at No. 8. #NBCSports#IsaiahSimmons#ArizonaCardinals» Subscribe to NBC Sports: https://www.youtube.com/nbcsports?sub...» Watch Li… [+1383 chars]"}, {"source": {"id": null, "name": "Today.com"}, "author": "Ronnie Koenig", "title": "Budweiser brings back 'whassup' commercial during coronavirus - TODAY", "description": "Former NBA stars and others unite for a reboot of the famous 'wassup' Budweiser commercial, this time with an emotional ending.", "url": "https://www.today.com/food/budweiser-brings-back-whassup-commercial-during-coronavirus-t179787", "urlToImage": null, "publishedAt": "2020-04-23T23:27:40Z", "content": "Budweiser just released a new version of its classic \"whassup\" commercial that's not only funny, but also serves as a genuinely touching public service announcement in the time of coronavirus.\r\nThe original commercial, which aired in 1999 featured a group of … [+2951 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Golf's versions of field goals - PGA TOUR", "description": "Almost like their NFL counterparts, check out these players thread the needle through some trees on course. SUBSCRIBE to PGA TOUR now: http://pgat.us/vBxcZSh...", "url": "https://www.youtube.com/watch?v=Y2QWsaAycQI", "urlToImage": null, "publishedAt": "2020-04-23T22:18:55Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Judge, Stanton, and Paxton updates from Aaron Boone and much more - YESNetwork", "description": "Yankees manager Aaron Boone on the status of Aaron Judge, Giancarlo Stanton, and James Paxton, as well as his thoughts on the punishment MLB handed the Red S...", "url": "https://www.youtube.com/watch?v=HgCi5qNcqc0", "urlToImage": null, "publishedAt": "2020-04-23T20:56:48Z", "content": "Yankees manager Aaron Boone on the status of Aaron Judge, Giancarlo Stanton, and James Paxton, as well as his thoughts on the punishment MLB handed the Red Sox and more. Subscribe for daily sports videos!\r\nYES' social media pages:TikTok: tiktok.com/@YESnetwor… [+130 chars]"}, {"source": {"id": null, "name": "Crimsonandcreammachine.com"}, "author": "Jack Shields", "title": "2020 NFL Draft Profile: Oklahoma Football DT Neville Gallimore - Crimson And Cream Machine", "description": "Big Canada finally broke out as a senior under first-year DC Alex Grinch and his new scheme.", "url": "https://www.crimsonandcreammachine.com/2020/4/23/21233097/2020-nfl-draft-profile-dt-neville-gallimore-ottawa-ontario-canada-prep-football-academy", "urlToImage": null, "publishedAt": "2020-04-23T20:30:13Z", "content": "On Jan. 3 of 2015, the Oklahoma Sooners received a commitment from a young Canadian who appeared more than cut out to be the dominant defensive lineman the program had been lacking for so long. It took longer than expected for that potential to be fully reali… [+3142 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "History of the Premier League from 1992 to 2019 | NBC Sports - NBC Sports", "description": "Dive back into the Premier League's 27-season history, from its formation in 1992 through Manchester City's record-setting 2018-19 campaign. #NBCSports #Prem...", "url": "https://www.youtube.com/watch?v=E0i5JMdVHx8", "urlToImage": null, "publishedAt": "2020-04-23T20:00:08Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Best of Rookies - Golden State Warriors", "description": "From behind-the-scenes moments to their hustle on the court, take a look back at some of the top moments from the Warriors' rookies.", "url": "https://www.youtube.com/watch?v=7Jilhn_-tw4", "urlToImage": null, "publishedAt": "2020-04-23T19:00:02Z", "content": null}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Scott Boeck", "title": "Hall of Fame broadcaster Vin Scully hospitalized after fall and is 'resting comfortably' - USA TODAY", "description": "Hall of Fame broadcaster Vin Scully, 92, was hospitalized after falling in his home on Tuesday. He is \"resting comfortably,\" the Dodgers tweeted.", "url": "https://www.usatoday.com/story/sports/mlb/dodgers/2020/04/23/vin-scully-hall-of-fame-dodgers-broadcaster-hospitalized/3012240001/", "urlToImage": null, "publishedAt": "2020-04-23T18:11:15Z", "content": "Rookie Charlie Culberson set up Scully with a two-out homer in the bottom of the 10th inning that lifted the Dodgers to a 4-3 victory and clinched the NL West division title.\r\nHall of Fame broadcaster Vin Scully was hospitalized after falling Tuesday in his S… [+1206 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Dolphins are building a Patriots-like culture and will win tonight's draft — Colin | NFL | THE HERD - The Herd with Colin Cowherd", "description": "Colin Cowherd makes a prediction that the Miami Dolphins will win tonight's NFL Draft because management is crafting a New England Patriots-esque culture. #T...", "url": "https://www.youtube.com/watch?v=BkPpUqSCgWo", "urlToImage": null, "publishedAt": "2020-04-23T17:44:05Z", "content": "Colin Cowherd makes a prediction that the Miami Dolphins will win tonight's NFL Draft because management is crafting a New England Patriots-esque culture.\r\n#TheHerd#NFL#Dolphins#Patriots#NFLDraft\r\nSUBSCRIBE to get all the latest content from The Herd: http://… [+1202 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "'Great' Moments From Wayne Gretzky vs. Alexander Ovechkin NHL 20 Battle - SPORTSNET", "description": "Check out some of the key moments from The Great One taking on the Great 8 in an NHL 20 battle for charity. ---------------------------------------------- Su...", "url": "https://www.youtube.com/watch?v=9YLgv_BvkaY", "urlToImage": null, "publishedAt": "2020-04-23T16:36:25Z", "content": "Check out some of the key moments from The Great One taking on the Great 8 in an NHL 20 battle for charity.---------------------------------------------- \r\nSubscribe to Sportsnet on YouTube - http://sprtsnt.ca/2paAT2L\r\nVisit Sportsnet.ca for more sports news … [+315 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NFL Draft 2020: What we want to see in first round | Pro Football Talk | NBC Sports - NBC Sports", "description": "Mike Florio and Chris Simms take turns drafting the things they are looking forward to seeing the most in the opening round of the 2020 NFL Draft. #NBCSports...", "url": "https://www.youtube.com/watch?v=S3sYz0eaBQo", "urlToImage": null, "publishedAt": "2020-04-23T15:45:55Z", "content": null}, {"source": {"id": null, "name": "Bigblueview.com"}, "author": "Chris Pflum", "title": "2020 NFL Draft prospect profile: Tristan Wirfs, OT, Iowa - Big Blue View", "description": "Is Wirfs the tackle for the Giants?", "url": "https://www.bigblueview.com/2020/4/23/21231202/2020-nfl-draft-prospect-profile-tristan-wirfs-ot-iowa-scouting-report-ny-giants", "urlToImage": null, "publishedAt": "2020-04-23T12:09:01Z", "content": "Throughout the process leading up to the 2020 NFL Draft there have been two constants. The first is the focus upon the offensive tackle position for the Giants in the first round, and the second is that Iowas Tristan Wirfs has been one of the tackles under he… [+5086 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "QUARANTINE CHRONICLES: NHL Draft In June & Hockey In July? - SPORTSNET", "description": "Sportsnet’s Elliotte Friedman joins Tim and Sid to discuss the potential of the NHL returning in July and how the draft could go ahead before that in June. -...", "url": "https://www.youtube.com/watch?v=fLMXVAIjmG4", "urlToImage": null, "publishedAt": "2020-04-23T04:19:29Z", "content": null}]}