{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Ralph D. Russo", "title": "Pac-12 football coaches pitch uniform start to season - The Associated Press", "description": "As Pac-12 football coaches pitched an NCAA-mandated uniform start to the season, some of the latest plans to fight the coronavirus in California further muddled how college teams will return to...", "url": "https://apnews.com/bb1451bb0c5b1efcad784f4e95bc3bd1", "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac98fe927e0a4151819faed9c37e77d1/3000.jpeg", "publishedAt": "2020-05-13T08:34:31Z", "content": "As Pac-12 football coaches pitched an NCAA-mandated uniform start to the season, some of the latest plans to fight the coronavirus in California further muddled how college teams will return to play in the West.\r\nWashington coach Jimmy Lake said Tuesday in a … [+4575 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Abhishek Bharadwaj", "title": "Ferrari Insider Reveals Daniel Ricciardo Has Already Signed with McLaren for 2021 to Replace Carlos Sainz - Essentially Sports", "description": "According to reputed journalist Leo Turrini, Daniel Ricciardo may have already signed with McLaren after possibly losing out on a Ferrari seat.", "url": "https://www.essentiallysports.com/f1-news-ferrari-insider-reveals-daniel-ricciardo-has-already-signed-with-mclaren-for-2021-to-replace-carlos-sainz/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200513104124/dr-18.jpg", "publishedAt": "2020-05-13T05:20:00Z", "content": "According to the latest reports, Daniel Ricciardo may have signed with McLaren. Many believe the Australian is a front-runner for the vacant seat at Ferrari in 2021. However, Ricciardo could be on his way to the Woking outfit next year. As with all rumors, ta… [+2017 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Dom Calicchio", "title": "Michigan Gov. Whitmer says sports fans ‘not going to be filling stadiums in the fall’ - Fox News", "description": "Sports fans in Michigan who are expecting a return to normal in the months ahead from a coronavirus shutdown received some disappointing news Tuesday from Gov. Gretchen Whitmer.", "url": "https://www.foxnews.com/politics/michigan-gov-whitmer-says-sports-fans-not-going-to-be-filling-stadiums-in-the-fall", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/12/David-Blough.jpg", "publishedAt": "2020-05-13T04:59:49Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox.  Sign up here.\r\nSports fans in Michigan who are expecting a return to normal in the months ahead from a coronavirus shutdown received some disappointing news Tuesday from Gov. Gret… [+3082 chars]"}, {"source": {"id": null, "name": "247sports.com"}, "author": "Keely Eure", "title": "USC AD Mike Bohn addresses Alabama game rumors - 247Sports", "description": "USC's athletic director took to Twitter to refute reports on USC's matchup with Alabama in September.", "url": "https://247sports.com/college/usc/Article/usc-football-2020-alabama-crimson-tide-trojans-mike-bohn--147091765/", "urlToImage": "https://s3media.247sports.com/Uploads/Assets/363/507/9507363.jpg?fit=bounds&crop=1200:630,offset-y0.50&width=1200&height=630", "publishedAt": "2020-05-13T03:17:22Z", "content": "For the second time in a span of five seasons, USC is slated to open its season with a marquee matchup against Alabama at AT&amp;T Stadium in Arlington, Texas. However, multiple reports surfaced Tuesday claiming that the contest might not go on as scheduled. … [+3951 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Chris Cwik", "title": "Charles Barkley calls out Michael Jordan for only bullying certain teammates: 'He knows who to pick on' - msnNOW", "description": "Charles Barkley thinks Michael Jordan chose his targets carefully.", "url": "https://sports.yahoo.com/charles-barkley-calls-out-michael-jordan-for-only-bullying-certain-teammates-he-knows-who-to-pick-on-214422311.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/.TG9EHA4.lz5foRKcAG7UQ--~B/aD05ODM7dz0xNDY4O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-05/a077bbd0-9499-11ea-bef3-777b85aa6536", "publishedAt": "2020-05-13T02:29:00Z", "content": "Charles Barkley respects Michael Jordans ability, but not his methods. Barkley called out Jordan on Tuesday, saying Jordan only bullied certain teammates because he knew they wouldnt fight back.\r\nBarkley lobbed that criticism at Jordan during an appearance on… [+1401 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Charean Williams", "title": "Dolphins remain in play for Logan Ryan - NBCSports.com", "description": "Logan Ryan won’t return to Tennessee, and by all accounts, the Jets are favored to land him. But the Dolphins “remain in play” for the cornerback, Mike Garafolo of NFL Media reports. Ryan and the Dolphins have had recent talks despite their riches at cornerba…", "url": "https://profootballtalk.nbcsports.com/2020/05/12/dolphins-remain-in-play-for-logan-ryan/", "urlToImage": "https://profootballtalk.nbcsports.com/wp-content/uploads/sites/25/2020/05/GettyImages-1057834434-e1589335241499.jpg", "publishedAt": "2020-05-13T02:01:00Z", "content": "Logan Ryan won’t return to Tennessee, and by all accounts, the Jets are favored to land him. But the Dolphins “remain in play” for the cornerback, Mike Garafolo of NFL Media reports.\r\nRyan and the Dolphins have had recent talks despite their riches at cornerb… [+697 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Adrian Wojnarowski", "title": "NBA owners, execs hopeful for return after call with Adam Silver, sources say - ESPN", "description": "After a virtual meeting with NBA commissioner Adam Silver, participants on a Board of Governors call Tuesday left feeling increasingly positive about the league's momentum toward a return to play, sources told ESPN.", "url": "https://www.espn.com/nba/story/_/id/29167773/nba-owners-execs-hopeful-return-call-adam-silver", "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0430%2Fr694465_1296x729_16%2D9.jpg", "publishedAt": "2020-05-13T01:59:02Z", "content": "Participants on a Board of Governors call Tuesday with NBA commissioner Adam Silver left the virtual meeting increasingly positive about the league's momentum toward a resumption of play this season, sources told ESPN.\r\nOwners and executives on the call were … [+2556 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": null, "title": "MLB owners give opening presentation on restarting season to players - ESPN", "description": "MLB's opening presentation on terms to start the season to the players' union on Tuesday did not include an economic proposal.", "url": "https://www.espn.com/mlb/story/_/id/29167541/mlb-owners-give-opening-presentation-restarting-season-players", "urlToImage": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2014%2F0130%2Fmlb_g_baseball01jr_1296x729.jpg", "publishedAt": "2020-05-13T01:24:08Z", "content": "NEW YORK -- Major League Baseball made an opening presentation to the players' union Tuesday on terms to start the coronavirus-delayed season.\r\nThe presentation did not include an economic proposal, a person familiar with the discussion told The Associated Pr… [+1548 chars]"}, {"source": {"id": null, "name": "Giants.com"}, "author": null, "title": "Judge gives a sneak peek at Giants' new schemes - Giants.com", "description": "Coach Joe Judge just provided the best glimpse yet as to what anybody can expect.", "url": "https://www.giants.com/news/joe-judge-jason-garrett-daniel-jones-patrick-graham-new-scheme", "urlToImage": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_12_desktop/giants/phmeit7mmsmphpug248c", "publishedAt": "2020-05-13T01:23:08Z", "content": "It's easy to see why Judge wanted Garrett on his staff and why he would want to take large parts of his schemes to the Giants.\r\nThe Cowboys consistently had one of the NFL's most productive offenses under Garrett. In 2019, Dallas had league-high averages of 4… [+4816 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Mark Fischer", "title": "CC Sabathia's stunning weight loss causes Mike Francesa rant - New York Post ", "description": "Mike Francesa is unamused by CC Sabathia’s stunning weight loss that has been the talk of Yankees fans. “Everyone getting crazy about Sabathia losing weight, alright Sabathia lost weigh…", "url": "https://nypost.com/2020/05/12/ex-yankees-cc-sabathias-weight-loss-causes-mike-francesa-rant/", "urlToImage": "https://thenypost.files.wordpress.com/2020/05/mike-francesa-l-cc-sabathia.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-05-13T01:20:33Z", "content": "Mike Francesa is unamused by CC Sabathia’s stunning weight loss that has been the talk of Yankees fans.\r\n“Everyone getting crazy about Sabathia losing weight, alright Sabathia lost weight — it doesn’t mean he could pitch better,” the WFAN blowhard said on his… [+1020 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Kobe Bryant's sports academy retires \"Mamba\" nickname - Fox News", "description": "The Southern California sports academy previously co-owned by Kobe Bryant has retired his “Mamba” nickname and rebranded itself nearly four months after the basketball icon's death in a helicopter crash.", "url": "https://www.foxnews.com/sports/kobe-bryants-sports-academy-retires-mamba-nickname", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/02/5e4565db-AP20038078180894.jpg", "publishedAt": "2020-05-13T00:51:20Z", "content": "The Southern California sports academy previously co-owned by Kobe Bryant has retired his “Mamba” nickname and rebranded itself nearly four months after the basketball icon's death in a helicopter crash.\r\nBryant, his 13-year-old daughter Gianna and seven othe… [+3068 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Bob Harig", "title": "PGA Tour memo outlines safety protocols for upcoming tournaments - ESPN", "description": "The PGA Tour sent players a lengthy memo detailing the \"Health and Safety Plan\" it will have in place when the tour resumes its revised schedule next month.", "url": "https://www.espn.com/golf/story/_/id/29167510/pga-memo-outlines-safety-protocols-upcoming-tournaments", "urlToImage": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F0709%2Fr398654_1296x729_16%2D9.jpg", "publishedAt": "2020-05-13T00:46:32Z", "content": "With the PGA Tour set to resume its revised schedule next month in Texas, a lengthy memo was sent to players outlining the various procedures that will be put in place, highlighted by a testing approach that will include coronavirus testing as well as daily t… [+3832 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Heather Dinich", "title": "NCAA won't mandate uniform return to college sports, Mark Emmert says - ESPN", "description": "The NCAA won't mandate or oversee a uniform return to college sports, NCAA president Mark Emmert told ESPN on Tuesday, leaving decisions on start dates to state officials and university presidents.", "url": "https://www.espn.com/college-sports/story/_/id/29167509/ncaa-mandate-uniform-return-college-sports-mark-emmert-says", "urlToImage": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F0223%2Fr332316_1296x729_16%2D9.jpg", "publishedAt": "2020-05-13T00:44:29Z", "content": "The NCAA won't mandate or oversee a uniform return to college sports, NCAA president Mark Emmert said Tuesday, leaving decisions on start dates to state officials and university presidents.\r\nCollege athletics came to a halt in mid-March, when the NCAA cancele… [+4635 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Brendan Bianowicz", "title": "Tom Brady wants no part of Eli Manning, even on the golf course - New York Post ", "description": "With two Super Bowls each and a combined 18 Pro Bowls between them, Eli Manning has at least one leg up on his brother Peyton. He strikes fear in the heart of Tom Brady. Peyton Manning and Brady ar…", "url": "https://nypost.com/2020/05/12/tom-brady-wants-no-part-of-eli-manning-even-on-the-golf-course/", "urlToImage": "https://thenypost.files.wordpress.com/2020/05/elibrady.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-05-13T00:38:41Z", "content": "With two Super Bowls each and a combined 18 Pro Bowls between them, Eli Manning has at least one leg up on his brother Peyton. He strikes fear in the heart of Tom Brady.\r\nPeyton Manning and Brady are set to face off on the golf course alongside Tiger Woods an… [+868 chars]"}, {"source": {"id": null, "name": "Vikingsterritory.com"}, "author": "Joe Johnson", "title": "The \"Far Too Early\" 2020 Vikings Record Prediction Round-Table - Vikings Territory", "description": "The Vikings' 2020-21 schedule was recently released which was if nothing else a gigantic relief to Vikings fans and writers, who weren't entirely sure there'd be a 2020-21 NFL season to begin with. Un", "url": "https://vikingsterritory.com/2020/general-news/the-far-too-early-2020-vikings-record-prediction-round-table", "urlToImage": "https://i1.wp.com/vikingsterritory.com/wp-content/uploads/2019/10/Dalvin_Cook_DET.jpg?fit=1280%2C720&ssl=1", "publishedAt": "2020-05-13T00:37:39Z", "content": "The Vikings’ 2020-21 schedule was recently released which was if nothing else a gigantic relief to Vikings fans and writers, who weren’t entirely sure there’d be a 2020-21 NFL season to begin with. Unless you’ve been living under a rock, I mean before the sta… [+9957 chars]"}, {"source": {"id": null, "name": "247sports.com"}, "author": "Patrick Murphy", "title": "Chris Olave turning CFP mistake into motivation for 2020 season - 247Sports", "description": "The Buckeye receiver's worst play will only make him better.", "url": "https://247sports.com/college/ohio-state/Article/Ohio-State-football-Chris-Olave-turning-College-Football-Playoff-mistake-into-motivation-for-2020-season-147087269/", "urlToImage": "https://s3media.247sports.com/Uploads/Assets/896/763/9763896.jpg?fit=bounds&crop=1200:630,offset-y0.50&width=1200&height=630", "publishedAt": "2020-05-13T00:37:13Z", "content": "It was nearly a dream start to college football for Ohio State wide receiver Chris Olave. Despite coming to the program as a three-star recruit who barely made it inside the 247Sports Composite’s top 400 players in the 2018 recruiting class, Olave found his w… [+4629 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Jamie Kemble", "title": "Where Arsenal, Chelsea and Tottenham finish in two final Premier League table scenarios - Football.London", "description": "The Premier League season remains under threat despite the will to finish the current campaign", "url": "https://www.football.london/premier-league/confirmed-arsenal-chelsea-tottenham-finish-18239190", "urlToImage": "https://i2-prod.football.london/incoming/article18239139.ece/ALTERNATES/s1200/5_PremStuff.jpg", "publishedAt": "2020-05-13T00:21:34Z", "content": "The Premier League have a number of options at their disposal if it's decided the season cannot continue. \r\nAt this point, the top-flight bosses are still committed to finishing the season with the support of many of the clubs.\r\n But the possibility of the ca… [+2554 chars]"}, {"source": {"id": null, "name": "Fieldgulls.com"}, "author": "Tyler Alsin", "title": "Cam Newton rumors continue to feature the Seattle Seahawks - Field Gulls", "description": "The Seattle Seahawks have technically not needed a backup quarterback since they drafted Russell Wilson.  Wilson’s never missed an NFL game. He’s only ever missed two practices - both for funerals....", "url": "https://www.fieldgulls.com/2020/5/12/21256581/cam-newton-rumor-seattle-seahawks-carolina-panthers-russell-wilson-quarterback-greg-olsen-backup", "urlToImage": "https://cdn.vox-cdn.com/thumbor/YxQq34wlszkhaFc7NinGK0Zgm98=/0x273:3600x2158/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19963774/1184242245.jpg.jpg", "publishedAt": "2020-05-13T00:14:41Z", "content": "The Seattle Seahawks have technically not needed a backup quarterback since they drafted Russell Wilson. \r\nWilsons never missed an NFL game. Hes only ever missed two practices- both for funerals. While he has left a game before, it was only to return a couple… [+2080 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "https://twitter.com/RoobNBCS/", "title": "Cox shares how he convinced Slay that Eagles were right team for him - NBC Sports Philadelphia", "description": "Fletcher Cox on Tuesday shared what he said to his long-time friend Darius Slay to convince him that Philadelphia was the right place for him. By Reuben Frank", "url": "https://www.nbcsports.com/philadelphia/eagles/fletcher-cox-message-darius-slay-eagles-nfl-offseason", "urlToImage": "https://www.nbcsports.com/philadelphia/sites/csnphilly/files/2020/05/12/usa_fletcher_cox_darius_slay.jpg", "publishedAt": "2020-05-12T23:26:28Z", "content": "Fletcher Coxs eyes lit up and he broke into a huge smile on a Zoom call Tuesday when he was asked about Darius Slay.\r\nCox and Slay have known each other for 12 years, since they met as high school kids on a recruiting trip to Mississippi State, and after Slay… [+2031 chars]"}, {"source": {"id": null, "name": "Nesn.com"}, "author": "https://nesn.com/ricky-doyle/", "title": "Ex-Patriots LB Reveals ‘Biggest Takeaway’ From Playing In New England - NESN", "description": "Suiting up for the New England Patriots means different things to different players. Some embrace the \"do your job\" mantra,…", "url": "https://nesn.com/2020/05/ex-patriots-lb-reveals-biggest-takeaway-from-playing-in-new-england/", "urlToImage": "https://nesn.com/wp-content/uploads/2018/02/new-england-patriots-helmet_opt.jpg", "publishedAt": "2020-05-12T23:22:55Z", "content": "Suiting up for the New England Patriots means different things to different players.\r\nSome embrace the “do your job” mantra, even if it means sacrificing individual accolades for the good of the organization, while others prefer a less disciplined approach.\r\n… [+1582 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Daniel Canova", "title": "If Tom Brady leads Buccaneers to Super Bowl title, it could cost Las Vegas millions - Fox News", "description": "If quarterback Tom Brady manages to lead the Tampa Bay Buccaneers to a Super Bowl title this upcoming season, Las Vegas will definitely feel the impact of it.", "url": "https://www.foxnews.com/sports/tom-brady-buccaneers-win-super-bowl-it-could-cost-las-vegas-millions", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/03/Tom-Brady5.jpg", "publishedAt": "2020-05-12T23:14:04Z", "content": "If quarterback Tom Brady manages to lead the Tampa Bay Buccaneers to a Super Bowl title this upcoming season, Las Vegas will definitely feel the impact.\r\nTAMPA BAY BUCCANEERS 2020 SCHEDULE: OPPONENTS, DATES, TIMES &amp; MORE\r\nAfter the Kansas City Chiefs hois… [+1446 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": null, "title": "Mariners announce pay cuts but no layoffs - ESPN", "description": "Mariners personnel working under uniform employee contracts and making more than $60,000 will take a pay reduction of at least 20%, but there will not be any layoffs.", "url": "https://www.espn.com/mlb/story/_/id/29167292/mariners-announce-pay-cut-no-layoffs", "urlToImage": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2016%2F1024%2Fr144515_1296x729_16%2D9.jpg", "publishedAt": "2020-05-12T22:54:41Z", "content": "The Seattle Mariners have informed their personnel working under uniform employee contracts that certain employees will have a five-month reduction in pay, but there will be no furloughs or layoffs through Oct. 31.\r\nThe pay reductions of at least 20% are for … [+607 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Dave Doyle, The Blue Corner", "title": "Jon Jones and Henry Cejudo seem to understand the situation. Do other UFC stars? - MMA Junkie", "description": "Jon Jones wants would like the UFC to “make the reward worth the risk” when it comes time to fight during the coronavirus pandemic.", "url": "https://mmajunkie.usatoday.com/2020/05/ufc-star-leverage-coronavirus-jon-jones-henry-cejudo", "urlToImage": "https://usatmmajunkie.files.wordpress.com/2020/05/jon-jones-ufc-247-post-fight-press-conference-belt.jpg?w=640&h=420&crop=1", "publishedAt": "2020-05-12T22:52:05Z", "content": "The UFC’s top-tier talent seems to be awakening to the idea that the promotion’s parent company might need them every bit as much as they need the UFC right about now.\r\nOne of the running subplots in the UFC’s mad dash to become the first sport back up and ru… [+3992 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Paul Kasabian", "title": "Former Bears CB Prince Amukamara, Raiders Reportedly Agree to Contract - Bleacher Report", "description": "Free-agent cornerback  Prince Amukamara  has agreed to a deal with the  Las Vegas Raiders , per  Mike Garafolo  of NFL Network. Terms were not immediately disclosed...", "url": "https://bleacherreport.com/articles/2882211-former-bears-cb-prince-amukamara-raiders-reportedly-agree-to-contract", "urlToImage": "https://img.bleacherreport.net/img/images/photos/003/858/769/hi-res-6d633aadca41eb84f017b98d280ea625_crop_exact.jpg?w=1200&h=1200&q=75", "publishedAt": "2020-05-12T22:40:17Z", "content": "Charles Rex Arbogast/Associated Press\r\nFree-agent cornerback Prince Amukamara has agreed to a deal with the Las Vegas Raiders, per Mike Garafolo of NFL Network. Terms were not immediately disclosed.\r\nAmukamara, who turns 31 on June 6, had 10 pass breakups and… [+968 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Dustin Long", "title": "How NASCAR will set lineups for Cup, Xfinity, Trucks at Darlington, Charlotte - NBC Sports - Misc.", "description": "Here is a detailed look at how NASCAR will set the lineups for the Cup, Xfinity and Truck Series races May 17-27 at Darlington and Charlotte.", "url": "https://nascar.nbcsports.com/2020/05/12/nascar-darlington-raceway-charlotte-motor-speedway-set-starting-lineups/", "urlToImage": "https://nascar.nbcsports.com/wp-content/uploads/sites/9/2020/05/GettyImages-1165619914-e1589319294892.jpg", "publishedAt": "2020-05-12T22:12:00Z", "content": "Editor’s Note: This is the first in a series of stories this week examining the key storylines as the Cup season resumes Sunday at Darlington Raceway (3:30 p.m. ET on FOX).\r\nAlthough it might feel much longer, it was only three months ago when the NASCAR seas… [+4366 chars]"}, {"source": {"id": null, "name": "Cleveland.com"}, "author": "Mary Kay Cabot, cleveland.com", "title": "ESPN’s Dan Orlovsky on Baker Mayfield: ‘He’s going to have a monster season’ - cleveland.com", "description": "ESPN analyst Dan Orlovsky, a former 13-year NFL quarterback, is confident Baker Mayfield is going to have a monster season.", "url": "https://www.cleveland.com/browns/2020/05/espns-dan-orlovsky-on-baker-mayfield-hes-going-to-have-a-monster-season.html", "urlToImage": "https://www.cleveland.com/resizer/go7DeujL4bhWXySFzXmusyPaPfc=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/YMMBXBEXSZGIRAJZBBP5BBYB5Y.jpg", "publishedAt": "2020-05-12T22:07:00Z", "content": "CLEVELAND, Ohio ESPNs Dan Orlovsky, a former 13-year NFL quarterback, is confident that Baker Mayfield will be feeling dangerous again in 2020 and that Browns fans will have plenty to cheer about.\r\nMayfield needs to rebound in 2020 for the Browns to make a pl… [+10450 chars]"}, {"source": {"id": null, "name": "Denverbroncos.com"}, "author": null, "title": "'We're expecting big things from Noah Fant': ESPN's Matthew Berry evaluates Broncos' fantasy football options - DenverBroncos.com", "description": "Berry weighs in on Drew Lock, Courtland Sutton, Jerry Jeudy and more as the fantasy football season approaches.", "url": "https://www.denverbroncos.com/news/we-re-expecting-big-things-from-noah-fant-espn-s-matthew-berry-evaluates-broncos", "urlToImage": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_12_desktop/broncos/ojpfo0jqqaqaodwcybjm", "publishedAt": "2020-05-12T22:03:56Z", "content": "ENGLEWOOD, Colo. As the Broncos' 2020 season inches closer, so too does your fantasy football draft.\r\nAnd with a revamped offense expected in Denver when the season opens, there are plenty of Broncos to potentially add to your squad.\r\nDrew Lock, Melvin Gordon… [+1622 chars]"}, {"source": {"id": null, "name": "247sports.com"}, "author": "Clint Buckley", "title": "Urban Meyer rips Redskins in defense of Dwayne Haskins - 247Sports", "description": "...", "url": "https://247sports.com/Article/Urban-Meyer-rips-Washington-Redskins-organization-defends-Dwayne-Haskins-Ohio-State-Buckeyes-Football-147083178/", "urlToImage": "https://s3media.247sports.com/Uploads/Assets/34/33/9033034.jpg?fit=bounds&crop=1200:630,offset-y0.50&width=1200&height=630", "publishedAt": "2020-05-12T21:57:17Z", "content": "When the Washington Redskins’ 2019 season ended, there was significant speculation about the franchise’s future at the quarterback position. That was despite the team spending a first-round pick on Dwayne Haskins the year before.\r\nMany wondered if Washington … [+2824 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Jeff Borzello", "title": "Purdue basketball player Nojel Eastern enters transfer portal - ESPN", "description": "Purdue junior Nojel Eastern, who has started 62 games over the past two seasons for the Boilermakers, has entered the transfer portal.", "url": "https://www.espn.com/mens-college-basketball/story/_/id/29167039/purdue-junior-guard-nojel-eastern-enters-transfer-portal", "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F0323%2Fr345658_1296x729_16%2D9.jpg", "publishedAt": "2020-05-12T21:47:56Z", "content": "Purdue basketball player Nojel Eastern entered the transfer portal on Tuesday, the school announced.\r\nEastern, a junior guard, was a staple in the Boilermakers' rotation during his career in West Lafayette, appearing in 37 games off the bench as a freshman an… [+657 chars]"}, {"source": {"id": null, "name": "Si.com"}, "author": "JAIME EISNER", "title": "Fantasy Fit: Baltimore Ravens Rookie Receiver Devin Duvernay - Sports Illustrated", "description": "Third-round draft pick could make an impact", "url": "https://www.si.com/nfl/ravens/news/duvernay-fantasy-value", "urlToImage": "https://imageproxy.themaven.net/https%3A%2F%2Fimages.saymedia-content.com%2F.image%2FMTcyNTA1ODc2NzI3MzQyMTYz%2Fusatsi_13327537.jpg?w=1024&q=40&h=683&auto=format&fit=max", "publishedAt": "2020-05-12T21:37:54Z", "content": "Bill Enright:The Baltimore Ravens selected Devin Duvernay out of Texas in the third round of the 2020 NFL draft, trying to give Lamar Jackson some new weapons and that passing attack. Let's find out what kind of fantasy fit Duvernay will be in his rookie seas… [+1684 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Loudest moments on the PGA TOUR - PGA TOUR", "description": "Check out the stereotype-breaking moments when the noise gets off the charts on the PGA TOUR from the likes of Tiger Woods, Rickie Fowler, Phil Mickelson and...", "url": "https://www.youtube.com/watch?v=zD5ocE_xt3A", "urlToImage": "https://i.ytimg.com/vi/zD5ocE_xt3A/maxresdefault.jpg", "publishedAt": "2020-05-12T21:14:31Z", "content": null}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": null, "title": "Warriors fans roast Chance for cryptic Steph-LeBron tweet - NBCSports.com", "description": "Chance did that thing for just over 900 retweets, and Warriors fans weren’t having it.", "url": "https://www.nbcsports.com/bayarea/warriors/warriors-fans-roast-chance-rapper-cryptic-steph-curry-tweet", "urlToImage": "https://www.nbcsports.com/bayarea/sites/csnbayarea/files/2020/05/12/chancestephusatsi.jpg", "publishedAt": "2020-05-12T21:05:06Z", "content": "Patrick Ewing, a member of the Golden State Warriors?\r\nThe Hall of Fame center wanted it to happen.\r\nNo, really, the best college prospect in 1985 wanted to go to the Warriors.\r\nThe former Georgetown star was huddle with his college coach John Thompson and hi… [+2212 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Chris Haynes", "title": "Sources: NBA superstars establish united front to resume season on private conference call - Yahoo Sports", "description": "Chris Paul, the president of the players association, arranged the call that included LeBron James, Anthony Davis, Kevin Durant, Giannis Antetokounmpo, Kawhi Leonard, Stephen Curry, Damian Lillard and Russell Westbrook, sources said.", "url": "https://sports.yahoo.com/sources-nba-superstars-establish-united-front-on-private-conference-call-to-resume-season-210518262.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/JXDsr8VY6YBwgFx44oBanw--~B/aD0yNTI2O3c9MzI3MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-05/d872dbc0-9497-11ea-bbdc-82f1f4af97d6", "publishedAt": "2020-05-12T21:05:00Z", "content": "Some of the NBAs biggest superstars formed a united front to resume the 2019-20 season during a private conference call Monday, league sources told Yahoo Sports.\r\nToward the end of the call discussing the ramifications of the coronavirus pandemic, all parties… [+1731 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "UW Huskies post highest Academic Progress Rate (APR) score in FBS history - Seattle Times", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMidmh0dHBzOi8vd3d3LnNlYXR0bGV0aW1lcy5jb20vc3BvcnRzL3V3LWh1c2t5LWZvb3RiYWxsL3V3LWh1c2tpZXMtZm9vdGJhbGwtcHJvZ3JhbS13aW5zLWFjYWRlbWljLW5hdGlvbmFsLWNoYW1waW9uc2hpcC_SAXxodHRwczovL3d3dy5zZWF0dGxldGltZXMuY29tL3Nwb3J0cy91dy1odXNreS1mb290YmFsbC91dy1odXNraWVzLWZvb3RiYWxsLXByb2dyYW0td2lucy1hY2FkZW1pYy1uYXRpb25hbC1jaGFtcGlvbnNoaXAvP2FtcD0x?oc=5", "urlToImage": null, "publishedAt": "2020-05-12T21:04:00Z", "content": null}, {"source": {"id": null, "name": "Espn.com"}, "author": null, "title": "Cavaliers' Larry Nance says it's important for NBA to crown a champion this season - ESPN", "description": "Although the Cavs won't be competing for a title, Larry Nance Jr. empathizes with players who may not get to finish what they started if the league winds up scrapping the season.", "url": "https://www.espn.com/nba/story/_/id/29166832/cavaliers-larry-nance-says-important-nba-crown-champion-season", "urlToImage": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2017%2F0412%2Fr199292_1296x729_16%2D9.jpg", "publishedAt": "2020-05-12T20:32:30Z", "content": "Cleveland Cavaliers forward Larry Nance said it's important for the NBA to crown a champion in this pandemic-altered season.\r\nSpeaking on a Zoom conference call, Nance said he's cautiously optimistic about the league resuming after pausing play for two months… [+1311 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Nick Shepkowski", "title": "Notre Dame Football: Is Another Grad-Transfer in the Cards? - Fighting Irish Wire", "description": "Notre Dame has done a phenomenal job re-working their roster for 2020 by adding graduate-transfers who are eligible to play right away. Isaiah Pryor, a former top-100 recruit to Ohio State figures …", "url": "https://fightingirishwire.usatoday.com/2020/05/12/notre-dame-football-is-another-grad-transfer-in-the-cards/", "urlToImage": "https://usatfightingirishwire.files.wordpress.com/2019/11/img_1767.jpg?w=1024&h=576&crop=1", "publishedAt": "2020-05-12T20:26:13Z", "content": "Notre Dame has done a phenomenal job re-working their roster for 2020 by adding graduate-transfers who are eligible to play right away.\r\nIsaiah Pryor, a former top-100 recruit to Ohio State figures to challenge for a starting safety spot while Bennett Skowron… [+1153 chars]"}, {"source": {"id": null, "name": "Wtol.com"}, "author": null, "title": "Major changes coming to Mid-American Conference - WTOL", "description": "The MAC will be eliminating the postseason tournaments for multiple sports and are making adjustments to men’s and women’s basketball, and volleyball in 2021.", "url": "https://www.wtol.com/article/sports/major-changes-coming-to-mid-american-conference/512-0e4f0d45-546b-432f-89a1-67a5a6d8fe3c", "urlToImage": "https://media.wtol.com/assets/WTOL/images/d9e5cb8b-d342-4e20-b725-0461216a45b9/d9e5cb8b-d342-4e20-b725-0461216a45b9_1140x641.jpg", "publishedAt": "2020-05-12T20:14:00Z", "content": "The Mid-American Conference will be eliminating the postseason tournaments for multiple sports and they are making adjustments to mens and womens basketball, and Volleyball starting with the 2021 season.\r\nMAC Commissioner Jon Steinbrecher confirmed to WTOL th… [+1115 chars]"}, {"source": {"id": null, "name": "Silverandblackpride.com"}, "author": "Bill Williamson", "title": "Raiders news 2020: Three people with most pressure on them this season - Silver And Black Pride", "description": "Derek Carr, Mark Davis and Paul Guenther are in the hot seat for the first season in Las Vegas", "url": "https://www.silverandblackpride.com/2020/5/12/21256326/three-people-raiders-franchis-most-pressure-nfl", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Zt4LujtJ7Z8SI_aibKr4yNkOFw4=/0x350:4928x2930/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19963205/1018932458.jpg.jpg", "publishedAt": "2020-05-12T20:07:21Z", "content": "Assuming there are no coronavirus delays, the Raiders start their 2020 season in four months. \r\nThe heavy lifting of the offseason is over and for the third time in as many years of the Jon Gruden Part II era, there was a lot of change. \r\nThis offseason, as t… [+1779 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mark Sanchez: Tua is 'special,' talks Rodgers-Love, Packers, Joe Burrow & Herbert | NFL | THE HERD - The Herd with Colin Cowherd", "description": "Mark Sanchez joins Colin Cowherd to discuss NFL QBs. Hear why Mark thinks Tua Tagovailoa is a 'special' QB, his sit downs with Justin Herbert and Jordan Love...", "url": "https://www.youtube.com/watch?v=UZmJFvSNlGM", "urlToImage": "https://i.ytimg.com/vi/UZmJFvSNlGM/maxresdefault.jpg", "publishedAt": "2020-05-12T20:06:44Z", "content": "Mark Sanchez joins Colin Cowherd to discuss NFL QBs. Hear why Mark thinks Tua Tagovailoa is a 'special' QB, his sit downs with Justin Herbert and Jordan Love and his thoughts on how Aaron Rodgers will handle Love moving forward.\r\n#TheHerd#NFL#TuaTagovailoa#Ju… [+1325 chars]"}, {"source": {"id": null, "name": "Dallasnews.com"}, "author": "Calvin  Watkins", "title": "Donovan McNabb says Cowboys could have ‘major problem’ if they don’t pay Dak Prescott - The Dallas Morning News", "description": "The Cowboys currently have placed the exclusive franchise tag on quarterback Dak Prescott and have until July 15 to reach a long-term deal. If a new...", "url": "https://www.dallasnews.com/sports/cowboys/2020/05/12/donovan-mcnabb-says-cowboys-could-have-trouble-if-they-dont-pay-dak-prescott/", "urlToImage": "https://dmn-dallas-news-prod.cdn.arcpublishing.com/resizer/vz4r17YCy687UjqieCUTqU_OfQs=/1200x630/filters:focal(459x15:469x5):no_upscale()/cloudfront-us-east-1.images.arcpublishing.com/dmn/SBY36BGLUJGPLJKOC3XT4LWROI.jpg", "publishedAt": "2020-05-12T19:25:00Z", "content": "The Cowboys currently have placed the exclusive franchise tag on quarterback Dak Prescott and have until July 15 to reach a long-term deal.\r\nIf a new contract cant be obtained with Prescott by then, he will play with a salary of $31.5 million. Of course, the … [+1700 chars]"}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": "John Canzano | The Oregonian/OregonLive", "title": "Canzano: Pac-12 vs. Pac-12 in football is a hopeful development - OregonLive", "description": "Pac-12 coaches", "url": "https://www.oregonlive.com/sports/2020/05/canzano-pac-12-vs-pac-12-in-football-is-a-hopeful-development.html", "urlToImage": "https://www.oregonlive.com/resizer/ksy9q7K0ql3OmYBILC2y0shhbgo=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/JG543NYS2VBWNJNJMWUNDUNHIE.JPG", "publishedAt": "2020-05-12T19:17:00Z", "content": "The Pac-12 is exploring all available options. That was evident on Monday in a scheduled webinar video conference featuring three of its head football coaches.\r\nClay Helton broke the news. The USC coach revealed that playing an 11-game, conference-only schedu… [+5846 chars]"}, {"source": {"id": null, "name": "Stampedeblue.com"}, "author": "Luke Schultheis", "title": "Colts OC Nick Sirianni Believes T.Y. Hilton is Poised for a Bounce Back Season in 2020 - Stampede Blue", "description": "According to his offensive coordinator Nick Sirianni, all signs point towards Indianapolis Colts star wide receiver T.Y. Hilton having a rebound season in 2020—pending his health:   “I expect a...", "url": "https://www.stampedeblue.com/2020/5/12/21256124/colts-oc-nick-sirianni-believes-t-y-hilton-is-poised-for-a-bounce-back-season-in-2020", "urlToImage": "https://cdn.vox-cdn.com/thumbor/IwnBo0y0488ezW_wg1c_9tp_J4I=/0x384:3780x2363/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19962875/1171385040.jpg.jpg", "publishedAt": "2020-05-12T19:05:36Z", "content": "According to his offensive coordinator Nick Sirianni, all signs point towards Indianapolis Colts star wide receiver T.Y. Hilton having a rebound season in 2020pending his health: \r\nI expect a great bounce back from a year where he had a lot of injuries, Siria… [+4518 chars]"}, {"source": {"id": null, "name": "Si.com"}, "author": "Chris Mannix", "title": "SI Insider: Mike Tyson's Recent Workout Videos Are Impressive, But Anything Other Than An Exhibition Would Be Rough for the 53-Year-Old - Sports Illustrated", "description": "SI's Chris Mannix shares some thoughts on a Mike Tyson return to the ring", "url": "https://www.si.com/boxing/video/2020/05/12/mike-tyson-workout-videos", "urlToImage": "https://www.si.com/.image/t_share/MTcyNTAyNzY1ODI4ODQyNTc5/mike-tyson-return.jpg", "publishedAt": "2020-05-12T18:28:44Z", "content": "The Internet was ablaze last week after a video emerged of a 53-year-old Mike Tyson looking in shape and sharp working the pads with a former trainer. Almost immediately offers for Tyson, who has been retired since 2005, to return came in from everywhere. An … [+1094 chars]"}, {"source": {"id": null, "name": "Footwearnews.com"}, "author": "Claudia Miller", "title": "Serena Williams Works Out With Venus in a Crop Top, Leggings + Black Nikes - Footwear News", "description": "The two sisters show how to warm up like a pro.", "url": "https://footwearnews.com/2020/fashion/celebrity-style/serena-williams-workout-venus-leggings-nike-1202984681/", "urlToImage": "https://pmcfootwearnews.files.wordpress.com/2020/05/serena-venus-williams-sister-tennis.jpg", "publishedAt": "2020-05-12T18:28:21Z", "content": "Serena Williams and her sister Venus Williams are turning you into a pro athlete one workout at a time.\r\nToday, the two tennis stars came together for a live backyard workout on Instagram. Serena prepped for the session in a red crop top over a nude sports br… [+1553 chars]"}, {"source": {"id": null, "name": "Atlantafalcons.com"}, "author": null, "title": "Falcons to feature John Cominsky in different role in Year 2 - AtlantaFalcons.com", "description": "Dan Quinn talks about how the Falcons will feature John Cominsky this season", "url": "https://www.atlantafalcons.com/news/falcons-to-feature-john-cominsky-in-different-role-in-year-2", "urlToImage": "https://static.clubs.nfl.com/image/private/t_editorial_landscape_12_desktop/falcons/bwdod0ob9wf0ycsz2loz", "publishedAt": "2020-05-12T18:24:22Z", "content": "When the Atlanta Falcons selected John Cominsky in the fourth round of the 2019 NFL Draft, coach Dan Quinn had a vision for how he could feature him in his defense.\r\nAt 6-foot-5 and 285 pounds, Cominsky has the size to play inside and the speed to come off th… [+2322 chars]"}, {"source": {"id": null, "name": "Ninersnation.com"}, "author": "Jas Kang", "title": "49ers news: What if the Niners won Super Bowl XLVII? - Niners Nation", "description": "The Super Bowl loss to the Ravens still hurts until this day.", "url": "https://www.ninersnation.com/2020/5/12/21255361/what-if-the-49ers-won-super-bowl-xlvii", "urlToImage": "https://cdn.vox-cdn.com/thumbor/fk1wdK1VftxsH9ARas4c3t8Rm1c=/0x371:5184x3085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19961876/460936996.jpg.jpg", "publishedAt": "2020-05-12T18:18:27Z", "content": "Its What If? week at SB Nation, where we are looking back at how a significant event or decision impacted the future of a franchise.\r\nAs a San Francisco 49ers fan, I look back at the Super Bowl XLVII loss to the Baltimore Ravens and how things would have been… [+3981 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": null, "title": "Iowa's Jordan Bohannon, Jack Nunge given extra year of eligibility - ESPN", "description": "Hardship waiver petitions for Iowa's Jordan Bohannon and Jack Nunge were approved by the Big Ten Conference, meaning each player gets an extra year of eligibility.", "url": "https://www.espn.com/mens-college-basketball/story/_/id/29166216/iowa-jordan-bohannon-jack-nunge-granted-extra-year-eligibility", "urlToImage": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0324%2Fr519071_1296x729_16%2D9.jpg", "publishedAt": "2020-05-12T17:12:09Z", "content": "IOWA CITY, Iowa -- The Big Ten Conference has approved hardship waiver petitions for Iowa basketball players Jordan Bohannon and Jack Nunge, giving each an extra year of eligibility.\r\nIowa made the announcement Tuesday in a news release.\r\nBohannon, a 6-foot-1… [+651 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Alyssa Barbieri", "title": "Can Chicago Bears offense reverse misfortunes in 2020? - Bears Wire", "description": "Will Matt Nagy’s offense finally right the ship? That’s the million-dollar question for the Bears, and it’s more than just the QB.", "url": "https://bearswire.usatoday.com/2020/05/12/chicago-bears-offense-looking-to-reverse-misfortunes-2020/", "urlToImage": "https://usatbearswire.files.wordpress.com/2019/09/gettyimages-1172820694.jpg?w=1024&h=576&crop=1", "publishedAt": "2020-05-12T16:41:37Z", "content": "When you have a dominant defense like the Chicago Bears have, the defense tends to draw attention away from the offense’s shortcomings. But there was no hiding the offensive deficiencies that haunted this Bears team last season.\r\nWhile the defense suffered it… [+2934 chars]"}, {"source": {"id": null, "name": "Testudotimes.com"}, "author": "Wesley  Brown", "title": "Alabama grad transfer Galin Smith commits to Maryland basketball - Testudo Times", "description": "The Terps get some much needed front court depth.", "url": "https://www.testudotimes.com/maryland-terps-basketball/2020/5/12/21256015/alabama-grad-transfer-galin-smith-maryland-mens-basketball-front-court-depth-mark-turgeon", "urlToImage": "https://cdn.vox-cdn.com/thumbor/jOFVpFZGktTPKm_GHr0do9Lfc_A=/0x0:4302x2252/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19962774/usa_today_12345641.jpg", "publishedAt": "2020-05-12T16:25:23Z", "content": "Maryland mens basketball secured a 2020 frontcourt transfer as Alabama forward Galin Smith announced his commitment to the Terps Tuesday.\r\nThe 69, 240-pound Smith provides depth in the Maryland frontcourt that lost three players this offseason.\r\nIm really exc… [+1841 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "UFC Jacksonville Weigh-In Staredowns - MMA Fighting - MMAFightingonSBN", "description": "After UFC Jacksonville weigh-ins, all the UFC fighters competing on Wednesday's card squared off Tuesday morning in Jacksonville, Fla. Subscribe: http://goo....", "url": "https://www.youtube.com/watch?v=kvw1c5SiIFE", "urlToImage": "https://i.ytimg.com/vi/kvw1c5SiIFE/maxresdefault.jpg", "publishedAt": "2020-05-12T16:11:25Z", "content": "After UFC Jacksonville weigh-ins, all the UFC fighters competing on Wednesday's card squared off Tuesday morning in Jacksonville, Fla.\r\nSubscribe: http://goo.gl/dYpsgH\r\nCheck out our full video catalog: http://goo.gl/u8VvLiVisit our playlists: http://goo.gl/e… [+360 chars]"}, {"source": {"id": null, "name": "Caneswarning.com"}, "author": "Alan Rubenstein", "title": "Nick Saban’s comments to Jalen Hurts stark reality about Miami football - Canes Warning", "description": "Alabama head coach Nick Saban told former quarterback Jalen Hurts to chose Oklahoma over the Maryland and Miami football programs when he entered the trans...", "url": "https://caneswarning.com/2020/05/12/nick-sabans-comments-jalen-hurts-stark-reality-miami-football/", "urlToImage": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Fcaneswarning.com%2Fwp-content%2Fuploads%2Fgetty-images%2F2017%2F07%2F1067374562.jpeg", "publishedAt": "2020-05-12T16:07:33Z", "content": "When former Alabama quarterback Jalen Hurts entered the transfer portal in January 2019, he considered the Maryland, Oklahoma and Miami football programs as his next destination. Crimson Tide head coach Nick Saban steered Hurts towards the Sooners because tha… [+2729 chars]"}, {"source": {"id": null, "name": "Theathletic.com"}, "author": "Craig Morgan", "title": "Coyotes president, CEO Ahron Cohen no longer with organization - The Athletic", "description": "Ahron Cohen’s legacy with the Coyotes will likely be the relationship he developed with the Arizona hockey community.", "url": "https://theathletic.com/1809417/2020/05/12/coyotes-president-ceo-ahron-cohen-no-longer-with-organization/", "urlToImage": "https://cdn.theathletic.com/app/uploads/2020/05/12115555/GettyImages-1131914559-1024x683.jpg", "publishedAt": "2020-05-12T16:04:33Z", "content": "Coyotes president and CEO Ahron Cohen is no longer with the organization, multiple sources confirmed. Cohen had been with the Coyotes for nearly five years.Cohen was hired in August 2015 under previous majority owner Andrew Barroway and then-team president An… [+708 chars]"}, {"source": {"id": null, "name": "Paulickreport.com"}, "author": "Churchill Downs Media Office", "title": "Churchill Releases Extended Schedule For Derby Points Races - Horse Racing News - Paulick Report", "description": "Churchill Downs Racetrack today released a preliminary list of races that could be used for the extension of the “Road to the Kentucky Derby presented by Woodford Reserve,” pending agreeable race placement by the host tracks. Additionally, the first race in t…", "url": "https://www.paulickreport.com/news/triple-crown/churchill-releases-extended-schedule-for-derby-points-races/", "urlToImage": "https://www.paulickreport.com/wp-content/uploads/2014/05/ChurchillDowns_DerbyScenic_mw_ew-0704-128x74.jpg", "publishedAt": "2020-05-12T16:02:00Z", "content": "Churchill Downs Racetrack today released a preliminary list of races that could be used for the extension of the Road to the Kentucky Derby presented by Woodford Reserve, pending agreeable race placement by the host tracks.\r\nAdditionally, the first race in th… [+3185 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Frank Schwab", "title": "Wild Sammy Watkins story includes how constant drinking and smoking led to his Buffalo problems - Yahoo Sports", "description": "Sammy Watkins had a tough time in Buffalo.", "url": "https://sports.yahoo.com/wild-sammy-watkins-story-includes-how-constant-drinking-and-smoking-led-to-his-buffalo-problems-155348976.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/sReZMHisvWme_tywkDrq9Q--~B/aD0zMTYzO3c9NDc0NTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-05/0efc75b0-9467-11ea-bfbf-cc3061255614", "publishedAt": "2020-05-12T15:53:00Z", "content": "Sammy Watkins has quite a personality.\r\nWatkins, who made one of the biggest plays in the Kansas City Chiefs Super Bowl LIV win, opened up to Bleacher Reports Tyler Dunne about pretty much everything. He shared his thoughts on reincarnation, how spirits move … [+3469 chars]"}, {"source": {"id": null, "name": "Theathletic.com"}, "author": "Jason Quick", "title": "'Nuts and guts': An oral history of the Trail Blazers' Game 7 win in Denver - The Athletic", "description": "Winning a Game 7 on the road changes legacies and destinies. This is how CJ McCollum and the Blazers did it against the Nuggets last season.", "url": "https://theathletic.com/1805452/2020/05/12/nuts-and-guts-an-oral-history-of-the-trail-blazers-game-7-win-in-denver/", "urlToImage": "https://cdn.theathletic.com/app/uploads/2020/05/11165526/CJ-McCollum5-scaled-e1589230699790-1024x512.jpg", "publishedAt": "2020-05-12T15:11:55Z", "content": "One year ago, the two cornerstones of the Trail Blazers franchise stood alone in the bathroom of a locker room in Denver. It was moments before the team would run onto the court for Game 7 at the Pepsi Center, and as was their pregame custom, Damian Lillard a… [+657 chars]"}, {"source": {"id": null, "name": "Kentuckysportsradio.com"}, "author": null, "title": "Mike Krzyzewski could be deposed in Zion Williamson lawsuit - kentuckysportsradio.com", "description": "The legal battle between Zion Williamson and his former agent Gina Ford is going to get a lot more interesting if a settlement isn't reached. Lawyers for Ford told Pat Forde they are prepared to", "url": "https://kentuckysportsradio.com/basketball-2/mike-krzyzewski-could-be-deposed-in-zion-williamson-lawsuit/", "urlToImage": "https://kentuckysportsradio.com/wp-content/uploads/2018/11/45527697_2182895371743864_1112808180804485120_o.jpg", "publishedAt": "2020-05-12T14:45:00Z", "content": "Skip to content\r\nThe legal battle between Zion Williamson and his former agent Gina Ford is going to get a lot more interesting if a settlement isn’t reached. Lawyers for Ford told Pat Forde they are prepared to depose Mike Krzyzewski as part of the discovery… [+1902 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Kyle Crabbs", "title": "Dolphins, Bengals illustrate stark difference in handling rookie QBs - Dolphins Wire", "description": "The Miami Dolphins and Cincinnati Bengals were the first two teams to claim quarterbacks in the 2020 NFL Draft. The duo of AFC cellar dwellers plucked a pair of SEC passers with their first picks —…", "url": "https://dolphinswire.usatoday.com/2020/05/12/dolphins-bengals-illustrate-stark-difference-in-handling-rookie-qbs/", "urlToImage": "https://usatdolphinswire.files.wordpress.com/2019/11/usatsi_13645677.jpg?w=1024&h=576&crop=1", "publishedAt": "2020-05-12T14:15:55Z", "content": "The Miami Dolphins and Cincinnati Bengals were the first two teams to claim quarterbacks in the 2020 NFL Draft. The duo of AFC cellar dwellers plucked a pair of SEC passers with their first picks the additions of Joe Burrow in Cincinnati and Tua Tagovailoa in… [+1667 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Paulina Dedaj", "title": "NHL closes in on two options to resume season: report - Fox News", "description": "The NHL has reportedly closed in on two possible plans to resume the season and according to reports, the timing of when the league will be able to safely do so will determine which plan officials will execute", "url": "https://www.foxnews.com/sports/nhl-closes-in-on-two-options-to-resume-the-season-report", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/03/Capital-One-Arena.jpg", "publishedAt": "2020-05-12T13:52:50Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nThe NHL has reportedly closed in on two possible plans to resume the season and, according to reports, the timing of when the league will be able to safely do so wil… [+1842 chars]"}, {"source": {"id": null, "name": "Arrowheadpride.com"}, "author": "Ron Kopp Jr.", "title": "New Chiefs OL Darryl Williams professes his love for Kansas City - Arrowhead Pride", "description": "The undrafted free agent can’t wait to get to work.", "url": "https://www.arrowheadpride.com/2020/5/12/21255588/new-chiefs-offensive-lineman-darryl-williams-professes-his-love-for-kansas-city", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ig5eeyyPcgWAxsQlkF3t8sc1LoM=/0x0:4433x2321/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19962178/1177489157.jpg.jpg", "publishedAt": "2020-05-12T13:23:57Z", "content": "Miami may have the sunny beaches, Los Angeles may have the Hollywood scenery, New York City may have massive buildings, but Kansas City has some sight-seeing too. Just ask one of the Kansas City Chiefs undrafted free agent signings, offensive lineman Darryl W… [+4600 chars]"}, {"source": {"id": null, "name": "Tigernet.com"}, "author": "Tony Crumpton", "title": "Cardinals want Isaiah Simmons to focus on one position - TigerNet", "description": "The Arizona Cardinals got the most versatile player in last month's NFL Draft when they drafted former Clemson defender Isaiah Simmons with the No. 8 overall pi", "url": "https://www.tigernet.com/update/Cardinals-want-Isaiah-Simmons-to-focus-on-one-position-35531", "urlToImage": "http://2cic.nyc3.cdn.digitaloceanspaces.com/t/stories/20/football/simmons-camp.jpg", "publishedAt": "2020-05-12T13:16:39Z", "content": "The Arizona Cardinals got the most versatile player in last month's NFL Draft when they drafted former Clemson defender \r\nIsaiah Simmons with the No. 8 overall pick. \r\nHowever, will they use him properly to maximize his unique skillset?\r\nThe organization want… [+744 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Eric Pincus", "title": "B/R NBA GM Week: Is Joel Embiid Trade Next After Sixers (Fake) Roster Shakeup? - Bleacher Report", "description": "With a pair of blockbuster trades, the  NBA  (represented by the    B/R Fantasy League   ) is moving full steam toward a week of very hypothetical but still intriguing trade pyrotechnics, with stars already on the move and others on the block...", "url": "https://bleacherreport.com/articles/2891273-br-nba-gm-week-is-joel-embiid-trade-next-after-sixers-fake-roster-shakeup", "urlToImage": "https://img.bleacherreport.net/img/images/photos/003/867/784/hi-res-9e70a6dba9e9df784acf87ff5fb1dd3d_crop_exact.jpg?w=1200&h=1200&q=75", "publishedAt": "2020-05-12T12:53:41Z", "content": "Matt Slocum/Associated Press\r\nWith a pair of blockbuster trades, the NBA (represented by the B/R Fantasy League) is moving full steam toward a week of very hypothetical but still intriguing trade pyrotechnics, with stars already on the move and others on the … [+6240 chars]"}, {"source": {"id": null, "name": "Dirtysouthsoccer.com"}, "author": "Joe Patrick", "title": "Can MLS really just move the entire league to Disney World? - Dirty South Soccer", "description": "MLS has proposed a plan to resume the season amid the COVID-19 outbreak that would move all 26 teams to Orlando.", "url": "https://www.dirtysouthsoccer.com/2020/5/12/21255542/can-mls-really-just-move-the-entire-league-to-disney-world", "urlToImage": "https://cdn.vox-cdn.com/thumbor/TPzlu-xu1YDuIq90ncE_6MZI4bk=/0x0:4122x2158/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19314241/usa_today_13250655.jpg", "publishedAt": "2020-05-12T12:24:32Z", "content": "Stop me if youve heard this one before:\r\nAmid the COVID-19 outbreak, a major professional sports league in this case MLS has proposed a genius plan to move all players, coaches, and various personnel to a warm-weather American city, lock them there with no ac… [+6457 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Greg Wyshynski", "title": "AHL after cancellation - A scoring champ, GM and two owners on what comes next - ESPN", "description": "Hockey's highest minor league ended its 2019-20 season on Monday. Here's how the future looks for various stakeholders.", "url": "https://www.espn.com/nhl/story/_/id/29163718/ahl-cancellation-scoring-champ-gm-two-owners-comes-next", "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0512%2Fr697871_1296x729_16%2D9.jpg", "publishedAt": "2020-05-12T10:49:30Z", "content": "The American Hockey League canceled the remainder of its 2019-20 season on Monday -- including the Calder Cup Playoffs -- due to the ongoing coronavirus pandemic. Like the NHL, the 31-team minor league had paused its season on March 12.\r\nAHL president and CEO… [+15597 chars]"}, {"source": {"id": null, "name": "Arrowheadpride.com"}, "author": "Tom Childs", "title": "Chiefs News: Adidas couldn’t turn down Michael Jordan and Patrick Mahomes - Arrowhead Pride", "description": "Chiefs headlines for Tuesday, May 12", "url": "https://www.arrowheadpride.com/2020/5/12/21255622/arrowheadlines-adidas-couldnt-lose-out-on-patrick-mahomes-after-turning-down-michael-jordan", "urlToImage": "https://cdn.vox-cdn.com/thumbor/S31QYmgNsM3fvIJShs62cGKEOjg=/0x473:2373x1715/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19962239/1090288160.jpg.jpg", "publishedAt": "2020-05-12T10:32:20Z", "content": "The latest\r\nHow Patrick Mahomes could be the next Michael Jordan | Arrowhead Addict\r\nEven Adidas wanted their shot at Mahomes, and they did not miss out. Despite Mahomes alma mater of Texas Tech being partnered with Under Armor and the NFLs partnership with N… [+8218 chars]"}, {"source": {"id": null, "name": "Theringer.com"}, "author": "Michael Baumann", "title": "Michael Jordan’s .202 Batting Average Is More Impressive Than It Seems - The Ringer", "description": "‘The Last Dance’ delved into MJ’s short-lived baseball career on Sunday, and though his Double-A numbers weren’t exactly “big-league material,” some believed he wasn’t far off", "url": "https://www.theringer.com/nba/2020/5/12/21255513/michael-jordan-baseball-the-last-dance", "urlToImage": "https://cdn.vox-cdn.com/thumbor/ydOgI4azXaJ7q_S8VLJ3k4rP_uc=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19962048/jordan_baseball_202_getty_ringer.jpg", "publishedAt": "2020-05-12T10:20:00Z", "content": "On Sunday nights installment of The Last Dance, the ESPN docuseries about the rise of the Chicago Bulls, Michael Jordan retired from basketball to try his hand at baseball. It was an astonishing story back in 1994Jordan leaving the NBA at the top of his game … [+10045 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Dana White Says Sports Orgs Calling for Advice, How'd You Pull Off UFC 249? - TMZ", "description": "Dana White says his phone has been blowing up from the heads of other sports leagues looking to get back in action after the success of UFC 249 ... and he's willing to share his battle plan!", "url": "https://www.tmz.com/2020/05/11/dana-white-ufc-249-sports-organization-covid-19-coronavirus/", "urlToImage": "https://imagez.tmz.com/image/68/16by9/2020/05/11/68fe18659557403da251b34fadcd59ac_xl.jpg", "publishedAt": "2020-05-11T23:24:02Z", "content": "Dana White says his phone has been blowing up from the heads of other sports leagues looking to get back in action after the success of UFC 249 ... and he's willing to share his battle plan!\r\n\"The leagues have reached out,\" White said Monday on \"TMZ Live\" ...… [+1304 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "D.J. Fluker Can Step Into Marshal Yanda's Spot | Ravens Final Drive - Baltimore Ravens", "description": "D.J. Fluker has the talent, size and experience to handle the starting right guard spot, but he'll have to earn it because there will be strong competition. ...", "url": "https://www.youtube.com/watch?v=97sxa92OfKA", "urlToImage": "https://i.ytimg.com/vi/97sxa92OfKA/maxresdefault.jpg", "publishedAt": "2020-05-11T19:00:36Z", "content": "D.J. Fluker has the talent, size and experience to handle the starting right guard spot, but he'll have to earn it because there will be strong competition.\r\n#BaltimoreRavens#Ravens#NFL\r\nSubscribe to the Baltimore Ravens YT Channel: https://goo.gl/uhx4ksFor m… [+423 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Peter King gives inside look at conversation with Dr. Anthony Fauci (FULL INTERVIEW) | NBC Sports - NBC Sports", "description": "Peter King joins Mike Tirico to talk about what he learned from Dr. Anthony Fauci concerning the steps the NFL needs to take in order to make sure the 2020 s...", "url": "https://www.youtube.com/watch?v=Npv3C1OgdcE", "urlToImage": "https://i.ytimg.com/vi/Npv3C1OgdcE/maxresdefault.jpg", "publishedAt": "2020-05-11T17:50:46Z", "content": null}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Kevin Stankiewicz", "title": "Mark Cuban: White House coronavirus safeguards need to be US norm before people feel comfortable - CNBC", "description": "\"Whatever the White House is doing for the president and vice president, that's the protocol I want to use for my employees,\" Mark Cuban told CNBC on Monday.", "url": "https://www.cnbc.com/2020/05/11/mark-cuban-white-house-coronavirus-safeguards-need-to-be-us-standard.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106195979-1571756914823rts2s7na.jpg?v=1589197973", "publishedAt": "2020-05-11T16:11:45Z", "content": "Billionaire entrepreneur Mark Cuban told CNBC on Monday that coronavirus safeguards in place at the White House need to become the norm before most Americans will feel comfortable going out again.\r\n\"We have to get to that point where the White House standard … [+3849 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "iRacing Pro Series Invitational from North Wilkesboro Speedway - NASCAR", "description": "Recap the iRacing Pro Series Invitational from iRacing Pro Series Invitational from North Wilkesboro Speedway in this full race replay. ---------- Subscribe ...", "url": "https://www.youtube.com/watch?v=P1GLMRae6BQ", "urlToImage": "https://i.ytimg.com/vi/P1GLMRae6BQ/hqdefault.jpg", "publishedAt": "2020-05-11T12:00:15Z", "content": null}]}