{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Perry Carpenter", "title": "'The Last Dance' Finally Shows Fans the Real Michael Jordan - Showbiz Cheat Sheet", "description": "In the new ESPN/Netflix docuseries, fans finally get to meet the real Michael Jordan.", "url": "https://www.cheatsheet.com/entertainment/how-the-last-dance-finally-shows-fans-the-real-michael-jordan.html/", "urlToImage": null, "publishedAt": "2020-04-26T15:57:57Z", "content": "ESPNs documentary The Last Dance has given fans a rare look into Michael Jordans life. The 10-part documentary features rare footage of Jordan during his 1997-98 championship run with the Chicago Bulls and an in-depth interview with the NBA legend. From his q… [+5485 chars]"}, {"source": {"id": null, "name": "Cleveland.com"}, "author": "Scott Patsko, cleveland.com", "title": "Browns Draft Grades 2020: How national analysts graded the picks - cleveland.com", "description": "Browns GM Andrew Berry has some good grades on his first NFL Draft report card.", "url": "https://www.cleveland.com/browns/2020/04/browns-draft-grades-2020-how-national-analysts-graded-the-picks.html", "urlToImage": null, "publishedAt": "2020-04-26T15:45:29Z", "content": "CLEVELAND, Ohio The Browns added seven players to the roster during the 2020 NFL Draft. And if you ask readers on cleveland.com (which we did), the results were positive.\r\nIn online polling, readers gave an A to the picks of offensive tackle Jedrick Wills, sa… [+6377 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Cameron DaSilva", "title": "7 takeaways from the Rams' 2020 draft - Rams Wire", "description": "The Los Angeles Rams spent the weekend adding playmakers on offense and versatile players on defense, selecting players such as Cam Akers, Van Jefferson and Terrell Burgess. What they didn’t …", "url": "https://theramswire.usatoday.com/2020/04/26/nfl-draft-rams-takeaways-learned-2020/", "urlToImage": null, "publishedAt": "2020-04-26T15:41:29Z", "content": "Robert Hanashiro-USA TODAY Sports\r\nThe Los Angeles Rams spent the weekend adding playmakers on offense and versatile players on defense, selecting players such as Cam Akers, Van Jefferson and Terrell Burgess. What they didn’t do is make their inside linebacke… [+1059 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "2020 NFL Draft: Bill Belichick explains why Patriots didn't select QB after losing Tom Brady - CBS Sports", "description": "Belichick isn't guaranteeing the quarterback job to Jarrett Stidham either", "url": "https://www.cbssports.com/nfl/news/2020-nfl-draft-bill-belichick-explains-why-patriots-didnt-select-qb-after-losing-tom-brady/", "urlToImage": null, "publishedAt": "2020-04-26T15:27:23Z", "content": "The New England Patriots had 10 picks in the 2020 NFL Draft, a perfect opportunity for the franchise to select a quarterback in the post-Tom Brady era. Instead, Bill Belichick passed on selecting a signal caller -- leaving New England with just Jarrett Stidha… [+1797 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Delanie Walker's G-Wagon Wrecked In Scary L.A. Crash, NFL Star Uninjured - TMZ", "description": "The Titans star was involved in a car crash in L.A. last month that wrecked his G-Wagon.", "url": "https://www.tmz.com/2020/04/26/delanie-walker-g-wagon-wrecked-los-angeles-crash-injured/", "urlToImage": null, "publishedAt": "2020-04-26T15:22:41Z", "content": "Scary moment for Delanie Walker ... the NFL star was involved in a car crash in L.A. last month that wrecked his G-Wagon -- but TMZ Sports has learned the tight end made it out uninjured.\r\nWe're told Walker -- a Pomona, Calif. native -- was driving through Ho… [+1088 chars]"}, {"source": {"id": null, "name": "Dawgnation.com"}, "author": "Mike Griffith", "title": "Kirby Smart reacts to Georgia QB Jake Fromm heading to 'cold, cold Buffalo' - DawgNation", "description": "ATHENS — Jake Fromm wasn’t the only one eager to learn his future on Saturday afternoon, Kirby Smart said. “I’ve been sitting here holding my breath that he’d get picked,”...", "url": "https://www.dawgnation.com/football/kirby-smart-reacts-to-georgia-qb-jake-fromm-heading-to-cold-cold-buffalo", "urlToImage": null, "publishedAt": "2020-04-26T15:13:11Z", "content": "ATHENS Jake Fromm wasnt the only one eager to learn his future on Saturday afternoon, Kirby Smart said.\r\nIve been sitting here holding my breath that hed get picked, Smart said on NFL.com. And now hes going to cold, cold Buffalo.\r\nRELATED: Jake Fromm tells Bu… [+3325 chars]"}, {"source": {"id": null, "name": "Hogshaven.com"}, "author": "Mark Tyler", "title": "Thaddeus Moss Could Bring Incredible Versatility to Scott Turner’s Offense - Hogs Haven", "description": "When LSU tight end Thaddeus Moss went undrafted in the 2020 NFL Draft, I was in disbelief. I know about the Jones Fracture that was uncovered at the combine that required surgery and the timeline...", "url": "https://www.hogshaven.com/2020/4/26/21237253/thaddeus-moss-could-bring-incredible-versatility-to-scott-turners-offense", "urlToImage": null, "publishedAt": "2020-04-26T15:09:40Z", "content": "When LSU tight end Thaddeus Moss went undrafted in the 2020 NFL Draft, I was in disbelief. I know about the Jones Fracture that was uncovered at the combine that required surgery and the timeline to recover from that, but I still assumed hed be selected in th… [+5991 chars]"}, {"source": {"id": null, "name": "Ganggreennation.com"}, "author": "John B", "title": "2020 NFL Draft Grades: How Did the Jets Do? - Gang Green Nation", "description": "It is always a tad silly to try and grade a Draft class days after the picks are made. The only grades that matter are the ones that will come years from now once we know whether the picks were...", "url": "https://www.ganggreennation.com/2020/4/26/21237279/2020-nfl-draft-grades-how-did-the-jets-do", "urlToImage": null, "publishedAt": "2020-04-26T14:38:04Z", "content": "It is always a tad silly to try and grade a Draft class days after the picks are made. The only grades that matter are the ones that will come years from now once we know whether the picks were actually successful or not. That never stops anybody from trying,… [+8947 chars]"}, {"source": {"id": null, "name": "Palmbeachpost.com"}, "author": "Joe Schad", "title": "Did Miami Dolphins strike again with these undrafted free agents? - Palm Beach Post", "description": "NFL Draft 2020: The Dolphins have found success with UFA’s", "url": "https://www.palmbeachpost.com/article/20200426/SPORTS/200428577", "urlToImage": null, "publishedAt": "2020-04-26T14:30:51Z", "content": "NFL Draft 2020: The Dolphins have found success with UFA’s\r\nLast year, the Dolphins had only two picks in the first four rounds of the NFL Draft. But they struck gold with undrafted free agents.\r\nPreston Williams of Colorado State has the talent to be number … [+4384 chars]"}, {"source": {"id": null, "name": "Orlandosentinel.com"}, "author": "J.C. Carnahan, Chris Hays", "title": "Ocoee football player Dexter Rentz Jr. reportedly killed - Orlando Sentinel", "description": "Ocoee High football player and Louisville signee Dexter Rentz Jr. died after being shot late Saturday night, Orlando police confirmed Sunday.", "url": "https://www.orlandosentinel.com/sports/highschool/football/os-sp-hs-dexter-rentz-20200426-cesqrgufajfq5ni7npvezqxxru-story.html", "urlToImage": null, "publishedAt": "2020-04-26T14:28:19Z", "content": null}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "David Waldstein", "title": "Giants Draft Pick Andrew Thomas Is ‘Everything You Want in a Left Tackle’ - The New York Times", "description": "Thomas, the No. 4 overall pick in the N.F.L. draft, described the opportunity to block for Saquon Barkley and Daniel Jones as a “blessing.”", "url": "https://www.nytimes.com/2020/04/26/sports/football/andrew-thomas-giants-nfl-draft.html", "urlToImage": null, "publishedAt": "2020-04-26T14:15:53Z", "content": "Six days before the first round of the N.F.L. draft, Chris Slade, the head football coach at Pace Academy in Atlanta, took a phone call from someone in the Giants organization who wanted to know if there was any reason the team should not select Andrew Thomas… [+6138 chars]"}, {"source": {"id": null, "name": "Mlive.com"}, "author": "Josh Slagter | jslagter@mlive.com", "title": "2020 NFL Draft final grades: Detroit Lions get 'A' or 'B' for total haul - MLive.com", "description": "Detroit had nine picks over three days, starting with Ohio State's Jeff Okudah.", "url": "https://www.mlive.com/lions/2020/04/2020-nfl-draft-final-grades-detroit-lions-get-a-or-b-for-total-haul.html", "urlToImage": null, "publishedAt": "2020-04-26T13:44:35Z", "content": "The Detroit Lions got an instant starter with the No. 3 pick, and then started filling in the gaps -- most notably with a pass rusher and a couple interior offensive linemen.\r\nIn total, Detroit had nine picks over the three days. Heres a recap of the Lions dr… [+4917 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Robert Gearty", "title": "Tom Brady gets 'apology' from Tampa Bay mayor after ouster from coronavirus-closed park - Fox News", "description": "Tampa’s mayor is flagging herself for a penalty after NFL superstar Tom Brady was ejected from a downtown park the city shuttered to contain the spread of the coronavirus.", "url": "https://www.foxnews.com/us/tom-brady-tampa-bay-mayor-apology", "urlToImage": null, "publishedAt": "2020-04-26T13:43:57Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nTampa’s mayor is flagging herself for a penalty after NFL superstar Tom Brady was ejected from a downtown park the city shuttered to contain the spread of the corona… [+1928 chars]"}, {"source": {"id": null, "name": "Arrowheadaddict.com"}, "author": "Grant Tuttle", "title": "Willie Gay Jr. earns comparisons to Derrick Johnson and Deion Jones on film - Arrowhead Addict", "description": "As expected, the Chiefs drafted defense in the 2nd round of the 2020 NFL Draft. Surprisingly, they opted for Willie Gay Jr. Here is what to expect from the...", "url": "https://arrowheadaddict.com/2020/04/26/willie-gay-jr-film-study-breakdown-chiefs-analysis-draft/", "urlToImage": null, "publishedAt": "2020-04-26T13:41:41Z", "content": "INDIANAPOLIS, IN – FEBRUARY 29: Linebacker Willie Gay Jr. of Mississippi State runs the 40-yard dash during the NFL Combine at Lucas Oil Stadium on February 29, 2020 in Indianapolis, Indiana. (Photo by Joe Robbins/Getty Images)\r\nWhile many were hoping that th… [+1599 chars]"}, {"source": {"id": null, "name": "Theblaze.com"}, "author": "Paul Sacca", "title": "Democratic Sen. Chris Murphy says college football system is 'immoral' during the NFL draft - TheBlaze", "description": "Chris Murphy thinks college athletics is immoral except when he's rooting for his favorite college team.", "url": "https://www.theblaze.com/news/chris-murphy-nfl-draft-tweets", "urlToImage": null, "publishedAt": "2020-04-26T13:37:21Z", "content": "Sports-starved fans had enhanced excitement for this year's NFL draft, especially since the NBA suspended its season on March 11, and the NHL suspended its season on March 12. Sports addicts looked forward to this week's NFL draft as a distraction to the dail… [+2608 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eliott C. McLaughlin and Wayne Sterling, CNN", "title": "NBA to reopen facilities this week in states relaxing stay-at-home orders, according to report - CNN", "description": "The NBA plans to reopen team practice facilities Friday in areas where local governments have relaxed stay-at-home restrictions amid the coronavirus pandemic, according to an ESPN report.", "url": "https://www.cnn.com/2020/04/26/us/nba-opening-practice-facilities/index.html", "urlToImage": null, "publishedAt": "2020-04-26T13:35:49Z", "content": null}, {"source": {"id": null, "name": "Behindthesteelcurtain.com"}, "author": "Anthony Defeo", "title": "Alex Highsmith was a surprise pick by the Steelers but he really wasn’t - Behind the Steel Curtain", "description": "Alex Highsmith, the Steelers third-round pick out of Charlotte on Friday night, may have been a bit of a surprise.  But the position he’s expected to fill shouldn’t have been.", "url": "https://www.behindthesteelcurtain.com/2020/4/26/21235944/alex-highsmith-may-have-been-a-surprise-pick-by-the-steelers-but-he-really-wasnt-charlotte-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-26T13:30:00Z", "content": "Im not going to sit here and say that Im excited about the Steelers selection of Alex Highsmith, the 250-pound edge-rusher from Charlotte, in the third round of the 2020 NFL Draft on Friday. \r\nHow can I be excited about a player I dont know or never even hear… [+2795 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Martin Fenn", "title": "2020 NFL Draft: 7 Immediate Do-Overs We Would Love to See - Bleacher Report", "description": "The 2020 NFL draft has come and gone, and there are a few decisions we wish we could change to help teams improve their rosters for the upcoming season.    General managers have lots of decisions to sort out during the draft...", "url": "https://bleacherreport.com/articles/2888586-2020-nfl-draft-7-immediate-do-overs-we-would-love-to-see", "urlToImage": null, "publishedAt": "2020-04-26T12:59:11Z", "content": "Vasha Hunt/Associated Press\r\nThe Indianapolis Colts gave up the No. 13 pick to acquire defensive tackle DeForest Buckner from the San Francisco 49ers, but they had a pair of early second-round picks to address some needs.\r\nIndy took care of the first need by … [+2177 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Marcus Mosher", "title": "NFL Draft 2020: Late-Round Picks Who Could Become Pro Bowlers - Bleacher Report", "description": "Every year, a few NFL players are drafted late and go on to have stellar careers.   They don't always break out immediately, but several of the prospects selected during Day 3 of the 2020 draft will make a Pro Bowl or two...", "url": "https://bleacherreport.com/articles/2887581-nfl-draft-2020-late-round-picks-who-could-become-pro-bowlers", "urlToImage": null, "publishedAt": "2020-04-26T12:54:51Z", "content": "Stacy Bengs/Associated Press\r\nTyler Johnson's fall to the fifth round (pick No. 161) was one of the biggest surprises of the draft. However, he couldn't have landed in a better spot, as Tom Brady will throw the ball to him, Mike Evans and Chris Godwin.\r\nJohns… [+896 chars]"}, {"source": {"id": null, "name": "Bleedinggreennation.com"}, "author": "John Stolnis", "title": "2020 NFL Draft Results: 10 thoughts on the Eagles’ 10 picks - Bleeding Green Nation", "description": "The draft was... bizarre.", "url": "https://www.bleedinggreennation.com/2020/4/26/21237043/2020-nfl-draft-results-eagles-thoughts-class-picks-jalen-reagor-hurts-quarterback-wide-receiver-bgn", "urlToImage": null, "publishedAt": "2020-04-26T12:50:14Z", "content": "Perhaps the best word to sum up the Philadelphia Eagles 2020 Draft is... bizarre.\r\nThere were plenty of surprises, picks that were interesting, mystifying and also downright maddening. Starting with their first round selection of TCU wide receiver Jalen Reago… [+13214 chars]"}, {"source": {"id": null, "name": "Mercurynews.com"}, "author": "Cam Inman", "title": "49ers draft: Saturday picks yield offensive support - The Mercury News", "description": "Offensive lineman Colton McKivitz and tight end Charlie Woerner helped round out the 49ers’ small draft class.", "url": "https://www.mercurynews.com/49ers-draft-saturday-picks-yield-offensive-support", "urlToImage": null, "publishedAt": "2020-04-26T11:45:49Z", "content": "On a day defined by multiple trades and a landmark retirement, the 49ers used their final three draft picks Saturday on offensive players to round out their smallest class since 1997. \r\nOffensive lineman Colton McKivitz, tight end Charlie Woerner and wide rec… [+3438 chars]"}, {"source": {"id": null, "name": "Bigblueview.com"}, "author": "Ed Valentine", "title": "Kudos, Wet Willies and more from the New York Giants’ draft - Big Blue View", "description": "Wrapping up three days unlike anything the NFL has seen before", "url": "https://www.bigblueview.com/2020/4/26/21236305/kudos-wet-willies-more-from-ny-giants-draft-dave-gettleman-joe-judge-zoom-picks-more", "urlToImage": null, "publishedAt": "2020-04-26T11:34:55Z", "content": "The 2020 NFL Draft is over. We now enter a time where we have no idea when football will actually start, so lets be thankful for the distraction provided the last few days by the draft. As we wrap it up, here are some Kudos &amp; Wet Willies, and some other t… [+7756 chars]"}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "Kyle Hightower", "title": "Justin Rohrwasser, Patriots kicker: Tattoo doesn't represent Three Percenters - Washington Times", "description": "New Patriots kicker Justin Rohrwasser says a tattoo on his arm is not representative of a loosely organized right-wing militia group that has adopted the symbol.", "url": "https://www.washingtontimes.com/news/2020/apr/26/justin-rohrwasser-patriots-kicker-tattoo-doesnt-re/", "urlToImage": null, "publishedAt": "2020-04-26T11:27:12Z", "content": "BOSTON — New Patriots kicker Justin Rohrwasser says a tattoo on his arm is not representative of a loosely organized right-wing militia group that has adopted the symbol.\r\nRohrwasser, who played at Rhode Island and Marshall, was taken 159th overall in the fif… [+1245 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Michael Middlehurst-Schwartz", "title": "NFL draft 2020: 8 undrafted free agents who could catch on with teams - msnNOW", "description": "Many players didn't hear their names called in the 2020 NFL draft, but several could catch on with teams as undrafted free agents.", "url": "https://www.usatoday.com/story/sports/nfl/draft/2020/04/25/nfl-draft-undrafted-free-agents-best-teams-anthony-gordon/3028574001/", "urlToImage": null, "publishedAt": "2020-04-26T11:15:58Z", "content": "SportsPulse: While Tom Brady's arrival in Tampa Bay has dominated the offseason in the NFC, a plethora of other teams increased their ammunition during free agency and the draft. We recap it all.\r\nUSA TODAY\r\nEven after 255 picks in the 2020 NFL draft, the scr… [+2572 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Charles Goldman", "title": "2020 NFL Draft: Grading Chiefs' full draft class - Chiefs Wire", "description": "The Chiefs Wire staff grades the 2020 NFL Draft class of the Kansas City Chiefs.", "url": "https://chiefswire.usatoday.com/2020/04/26/kansas-city-chiefs-final-grades-2020-nfl-draft-class/", "urlToImage": null, "publishedAt": "2020-04-26T10:52:01Z", "content": "Following the 2017 NFL Draft, the Kansas City Chiefs were crushed by analysts, pundits, experts and anyone out there providing draft grades. Trading up into the top-10 to select Patrick Mahomes was considered by most accounts a risk. Three years later, the Ch… [+3875 chars]"}, {"source": {"id": null, "name": "Tennessean.com"}, "author": "Gentry Estes", "title": "Hey Titans, good luck corralling fans' Jadeveon Clowney hopes now | Estes - Tennessean", "description": "Given the lack of an edge rusher in the Titans' draft class, it's going to be impossible not to link that to the never-ending courtship with Clowney.", "url": "https://www.tennessean.com/story/sports/nfl/titans/2020/04/26/titans-jadeveon-clowney-hopes-nfl-draft-2020/5163943002/", "urlToImage": null, "publishedAt": "2020-04-26T10:18:06Z", "content": "With a nod to quarterback Cole McDonald’s shifting hairstyle, by far the most interesting storyline after Day 3 of the Titans’ 2020 NFL Draft is still developing.\r\nIt’s not a matter of what did happen in the draft but what did not.\r\nThe Titans did not draft a… [+3601 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Dustin Long", "title": "Today’s iRacing Cup race at virtual Talladega: Start time and more - NBC Sports - Misc.", "description": "Today's eNASCAR Pro Invitational Series iRacing event at a virtual Talladega Superspeedway features Jeff Gordon and Dale Earnhardt Jr.", "url": "https://nascar.nbcsports.com/2020/04/26/dale-jr-jeff-gordon-todays-iracing-cup-race-at-virtual-talladega-start-time-and-more/", "urlToImage": null, "publishedAt": "2020-04-26T10:00:00Z", "content": "Talladega.\r\nYou either love or hate the track in Alabama.\r\nAs we’ve done with with Miami, Texas, Bristol, former NASCAR tracks and Richmond, we’re taking a look at the top five NASCAR moments from the track.\r\nYou’ll either love them or hate them.\r\nHere they a… [+4686 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Charles Robinson", "title": "Sources: Jameis Winston, Saints finalizing deal - Yahoo Sports", "description": "A signing won’t guarantee him the backup job behind Drew Brees. Winston's best case scenario may ultimately be competing for the No. 2 spot with Taysom Hill", "url": "https://sports.yahoo.com/sources-jameis-winston-saints-finalizing-deal-081654906.html", "urlToImage": null, "publishedAt": "2020-04-26T08:16:00Z", "content": "Jameis Winston, one of the biggest remaining question marks in free agency, is finalizing a one-year deal to play for the New Orleans Saints in 2020, sources tell Yahoo Sports.\r\nThe deal is expected to be completed quickly now that the NFL draft has wrapped, … [+3075 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Paul Kasabian", "title": "49ers GM John Lynch: Trent Williams' New Contract Won't Be Rushed After Trade - Bleacher Report", "description": "The San Francisco dealt a fifth-round pick in this year's draft and a third-rounder in 2021 for  Washington Redskins  left tackle Trent Williams on Saturday...", "url": "https://bleacherreport.com/articles/2888731-49ers-gm-john-lynch-trent-williams-new-contract-wont-be-rushed-after-trade", "urlToImage": null, "publishedAt": "2020-04-26T04:53:39Z", "content": "Charlie Neibergall/Associated Press\r\nThe San Francisco dealt a fifth-round pick in this year's draft and a third-rounder in 2021 for Washington Redskins left tackle Trent Williams on Saturday.\r\nWilliams will replace the retired Joe Staley at left tackle in 20… [+2148 chars]"}, {"source": {"id": null, "name": "Packers.com"}, "author": null, "title": "The outlook on what the Packers got, and didn't get, in their 2020 draft Key - Packers.com", "description": "Key comments and interpretations from Green Bay’s GM and head coach", "url": "https://www.packers.com/news/the-outlook-on-what-the-packers-got-and-didn-t-get-in-their-2020-draft", "urlToImage": null, "publishedAt": "2020-04-26T04:35:20Z", "content": "After all the talk about this being the deepest wide receiver draft class in several years, the Packers didn't select a single one amongst their nine picks.\r\nTurns out, Gutekunst didn't share the opinion of the group's depth, explaining he was impressed with … [+1414 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Charean Williams", "title": "Report: Eagles, Marquise Goodwin agree to restructure - NBCSports.com", "description": "Receiver Marquise Goodwin agreed to restructure his contract after a trade to Philadelphia, Mike Kaye of nj.com reports. Goodwin, 29, will sign a one-year, $1.35 million deal. He has a chance to earn $1 million in incentives. Goodwin was scheduled to make $3.…", "url": "https://profootballtalk.nbcsports.com/2020/04/26/report-eagles-marquise-goodwin-agree-to-restructure/", "urlToImage": null, "publishedAt": "2020-04-26T04:21:00Z", "content": "Receiver Marquise Goodwin agreed to restructure his contract after a trade to Philadelphia, Mike Kaye of nj.com reports.\r\nGoodwin, 29, will sign a one-year, $1.35 million deal. He has a chance to earn $1 million in incentives.\r\nGoodwin was scheduled to make $… [+339 chars]"}, {"source": {"id": null, "name": "Milehighreport.com"}, "author": "Tim Lynch, Scotty Payne", "title": "Denver Broncos UDFA tracker: Undrafted free agent signings 2020 - Mile High Report", "description": "Tracking all of the undrafted college free agent rumors and reports tied to the Denver Broncos.", "url": "https://www.milehighreport.com/2020/4/25/21236114/denver-broncos-udfa-tracker", "urlToImage": null, "publishedAt": "2020-04-26T04:06:39Z", "content": "Tracking all of the undrafted college free agent rumors and reports tied to the Denver Broncos."}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The WAY TOO EARLY 2021 NFL Mock Draft | CBS Sports HQ - CBS Sports", "description": "It is never too early for Mock Draft season, and Ryan Wilson comes through with his 2021 NFL mock draft! The 2020 NFL Draft is now in the books, and Ryan Wil...", "url": "https://www.youtube.com/watch?v=Nzk19g4m4ZU", "urlToImage": null, "publishedAt": "2020-04-26T03:51:05Z", "content": null}, {"source": {"id": null, "name": "Nesn.com"}, "author": "https://nesn.com/doug-kyed/", "title": "Patriots Signed This Linebacker To Massive Undrafted Free-Agent Contract - NESN", "description": "The New England Patriots clearly have high hopes for undrafted Arkansas linebacker De'Jon \"Scoota\" Harris. The Patriots signed Harris to…", "url": "https://nesn.com/2020/04/patriots-signed-this-linebacker-to-massive-undrafted-free-agent-contract/", "urlToImage": null, "publishedAt": "2020-04-26T03:34:45Z", "content": "The New England Patriots clearly have high hopes for undrafted Arkansas linebacker De’Jon “Scoota” Harris.\r\nThe Patriots signed Harris to a three-year contract with a $25,000 signing bonus and $150,000 total in guarantees, according to a source. To put that i… [+1774 chars]"}, {"source": {"id": null, "name": "Theathletic.com"}, "author": "David Lombardi", "title": "Multiple trades, intriguing picks fill a busy final day of the 49ers' draft - The Athletic", "description": "The 49ers took a late-round chance on Jauan Jennings, the Tennessee receiver Kyle Shanahan called \"one of our most favorite guys to watch.\"", "url": "https://theathletic.com/1774510/2020/04/25/multiple-trades-intriguing-picks-fill-a-busy-final-day-of-the-49ers-draft/", "urlToImage": null, "publishedAt": "2020-04-26T03:16:38Z", "content": "The 49ers didn’t use a single one of their original picks during the NFL Draft and they’ll exit the weekend with a 10-year veteran set to start in place of retiring left tackle Joe Staley.That summary encapsulates the furious amount of wheeling, dealing, trad… [+681 chars]"}, {"source": {"id": null, "name": "Bjpenn.com"}, "author": "Chris Taylor", "title": "Eddie Alvarez believes Conor McGregor would “put away” Tony Ferguson - BJPENN.COM", "description": "Former UFC lightweight champion Eddie Alvarez believes that Conor McGregor would \"put away\" Tony Ferguson in a potential fight.", "url": "https://www.bjpenn.com/mma-news/conor-mcgregor/eddie-alvarez-believes-conor-mcgregor-would-put-away-tony-ferguson/", "urlToImage": null, "publishedAt": "2020-04-26T03:15:00Z", "content": "Former UFC lightweight champion Eddie Alvarez believes that Conor McGregor would “put away” Tony Ferguson in a potential fight.\r\nAlvarez, who now fights for ONE Championship, recently sat down with The Score MMA where he discussed McGregor’s chances against f… [+1576 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": null, "title": "Handing out draft grades for Raiders' 2020 rookie class - NBCSports.com", "description": "The Raiders made sure to provide Derek Carr with some new weapons, while also adding depth to the secondary.", "url": "https://www.nbcsports.com/bayarea/raiders/raiders-2020-nfl-draft-grades-how-seven-player-rookie-class-turned-out", "urlToImage": null, "publishedAt": "2020-04-26T02:58:25Z", "content": "The 2020 NFL Draft is in the rearview mirror, and once again, the Raiders move forward with another large haul from the top collegiate programs. Of the seven players they added, four attended Alabama, Ohio State or -- of course -- Clemson.\r\nLas Vegas was done… [+2510 chars]"}, {"source": {"id": null, "name": "Si.com"}, "author": "Howard Balzer", "title": "Fixing the Defense Has Consumed GM Steve Keim Since Last Season - Sports Illustrated", "description": "Arizona Cardinals general manager Steve Keim was haunted by his defense's poor performances last year and wanted a change.", "url": "https://www.si.com/nfl/cardinals/news/steve-keim-defense-draft-free-agency", "urlToImage": null, "publishedAt": "2020-04-26T02:42:35Z", "content": "While the Cardinals endured a 5-10-1 season in 2019 with rookie quarterback Kyler Murray and a head coach, Kliff Kingsbury in is first season in the NFL, general manager Steve Keim couldnt shake the feeling he often had after games as he vowed to do whatever … [+2887 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Ryan Pace and Matt Nagy recap 2020 NFL Draft | Chicago Bears - Chicago Bears", "description": "General manager Ryan Pace and head coach Matt Nagy address the media following the 2020 NFL Draft. Subscribe to the Bears YT Channel: http://chgobrs.com/1Lfm...", "url": "https://www.youtube.com/watch?v=Eg3Q008UqcU", "urlToImage": null, "publishedAt": "2020-04-26T02:22:17Z", "content": null}, {"source": {"id": null, "name": "Buffalobills.com"}, "author": null, "title": "2020 NFL Draft: QB Jake Fromm, WR Gabriel Davis and WR Isaiah Hodgins close out the Bills draft class - BuffaloBills.com", "description": "The Bills added additional weapons for the offense as well as picking up their only defensive back on the final day of the 2020 NFL Draft.", "url": "https://www.buffalobills.com/news/3-things-we-learned-on-the-final-day-of-the-2020-bills-draft", "urlToImage": null, "publishedAt": "2020-04-26T02:18:08Z", "content": "2. QB understudy\r\nBrandon Beane didn't expect Jake Fromm to be on the board by the time it was their turn to pick in round five. After the Georgia quarterback won at the highest level in the most competitive conference and beat out the likes of Jacob Eason an… [+2511 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Kyle Madson", "title": "Rams head coach Sean McVay has funny response to Trent Williams trade - Niners Wire", "description": "Sean McVay had a funny response when told about the 49ers trade for left tackle Trent Williams.", "url": "https://ninerswire.usatoday.com/2020/04/25/trent-williams-trade-49ers-rams-sean-mcvay/", "urlToImage": null, "publishedAt": "2020-04-26T01:29:53Z", "content": "The 49ers made the NFL’s biggest splash on Day 3 of the draft when they traded a 2020 fifth-round pick and a 2021 third-round pick for Washington’s seven-time Pro Bowl tackle Trent Williams.\r\nThe trade came as a precursor to Joe Staley’s retirement. With Will… [+1145 chars]"}, {"source": {"id": null, "name": "Theathletic.com"}, "author": "Sheil Kapadia, Bo Wulf and Zach Berman", "title": "Grading the Day 3 picks: Eagles close out draft with a run on speedy receivers - The Athletic", "description": "The Eagles drafted two more wide receivers Saturday and also acquired WR Marquise Goodwin. Our writers weigh in on each Day 3 move.", "url": "https://theathletic.com/1774547/2020/04/25/grading-the-eagles-day-3-picks-a-run-on-receivers/", "urlToImage": null, "publishedAt": "2020-04-26T01:23:43Z", "content": "The Eagles said they wanted volume in this draft, and they ended up selecting 10 players — six on offense, four on defense — over the three days.We’ve covered the Jalen Reagor pick and the Day 2 selections (Jalen Hurts and Davion Taylor). Below are thoughts o… [+635 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": null, "title": "What 49ers want seventh-round pick Jennings to work on - NBCSports.com", "description": "Jauan Jennings was overjoyed that the 49ers drafted him, but he already knows what the team expects of him.", "url": "https://www.nbcsports.com/bayarea/49ers/what-49ers-want-seventh-round-draft-pick-jauan-jennings-work", "urlToImage": null, "publishedAt": "2020-04-26T00:48:54Z", "content": "The joy that former Tennessee wide receiver Jauan Jennings was feeling after being drafted by the 49ers was undeniable. \r\nThe club used the No. 217 pick of the 2020 NFL Draft to select Jennings, and the receiver could not contain his enthusiasm. He had an ear… [+2639 chars]"}, {"source": {"id": null, "name": "Houstonchronicle.com"}, "author": "John McClain", "title": "McClain: Texans land a mature class - Houston Chronicle", "description": "<p>Bill O’Brien’s five picks won’t be under pressure to start as rookies but all are expected to contribute</p>", "url": "https://www.houstonchronicle.com/texas-sports-nation/john-mcclain/article/McClain-Texans-land-a-mature-class-15226539.php", "urlToImage": null, "publishedAt": "2020-04-26T00:34:48Z", "content": "In his first draft as the Texans’ general manager, Bill O’Brien made three trades on Saturday and finished with five picks who have the talent to contribute as rookies.\r\nDefensive tackle Ross Blacklock, outside linebacker Jonathan Greenard, offensive tackle C… [+4585 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Sean Payton Recaps Saints 2020 NFL Draft, Adds QB Tommy Stevens in 7th Round - New Orleans Saints", "description": "New Orleans Saints Head Coach Sean Payton recaps day 3 at the 2020 NFL draft after jumping into the 7th round and drafting Mississippi State quarterback Tomm...", "url": "https://www.youtube.com/watch?v=Iy--axAduc0", "urlToImage": null, "publishedAt": "2020-04-26T00:10:36Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Ryan Young", "title": "NFL raised more than $100 million during draft for coronavirus relief - Yahoo Sports", "description": "Roger Goodell announced that the NFL raised more than $100 million for coronavirus relief during the draft.", "url": "https://sports.yahoo.com/nfl-draft-raised-100-million-for-coronavirus-covid-19-pandemic-relief-roger-goodell-235016606.html", "urlToImage": null, "publishedAt": "2020-04-25T23:50:00Z", "content": "The COVID-19 pandemic forced the NFL to host its draft virtually this year which ended up running fairly smoothly. \r\nWhile teams were making their picks, the league simultaneously held a draft-a-thon fundraiser to help raise money for coronavirus relief in th… [+1217 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Cincinnati Bengals Draft Recap | 2020 NFL Draft Recap | CBS Sports HQ - CBS Sports", "description": "The Bengals made it official on Thursday, selecting Joe Burrow to be the new face of the franchise at the quarterback position. They followed that up by find...", "url": "https://www.youtube.com/watch?v=OqNSsoBNUrk", "urlToImage": null, "publishedAt": "2020-04-25T23:36:19Z", "content": "The Bengals made it official on Thursday, selecting Joe Burrow to be the new face of the franchise at the quarterback position. They followed that up by finding him his long-term No. 1 wide receiver and grabbing one of the best coverage linebackers for the de… [+273 chars]"}, {"source": {"id": null, "name": "Aseaofblue.com"}, "author": "Ianteasley", "title": "Kentucky Basketball should pursue Wake Forest’s Olivier Sarr ‘if’ he transfers - A Sea Of Blue", "description": "Sarr may have already decided to transfer. If so, Kentucky needs to reach out.", "url": "https://www.aseaofblue.com/2020/4/25/21236492/kentucky-wildcats-basketball-olivier-sarr-wake-forest-demon-deacons-news", "urlToImage": null, "publishedAt": "2020-04-25T23:23:57Z", "content": "On Saturday, the Wake Forest Demon Deacons fired head coach Danny Manning after a less-than-stellar stint in Winston-Salem. \r\nIt just so happens that Wake Forest has a big man by the name of Olivier Sarr, who averaged 14 points, 9.0 boards and 1.2 blocks per … [+1540 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NFL scout breaks down LB Trevis Gipson selection | Chicago Bears - Chicago Bears", "description": "Bears area scout Breck Ackley and Jeff Joniak break down the Bears 5th round draft choice and 155th overall, outside linebacker Trevis Gipson from Tulsa. Sub...", "url": "https://www.youtube.com/watch?v=YlLeuS_QsVI", "urlToImage": null, "publishedAt": "2020-04-25T23:23:05Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Lachavious Simmons College Highlights | Chicago Bears - Chicago Bears", "description": "Check out highlights from Bears 7th round pick and 227th overall, Lachavious Simmons from Tennessee State. Subscribe to the Bears YT Channel: http://chgobrs....", "url": "https://www.youtube.com/watch?v=_Q0bhoUN3fE", "urlToImage": null, "publishedAt": "2020-04-25T23:18:01Z", "content": "Check out highlights from Bears 7th round pick and 227th overall, Lachavious Simmons from Tennessee State.\r\nSubscribe to the Bears YT Channel: http://chgobrs.com/1LfmYsYMore Bears NFL Action: https://bit.ly/33gtjDp\r\n#ChicagoBears#Bears#NFL\r\nKeep up-to-date on… [+184 chars]"}, {"source": {"id": null, "name": "247sports.com"}, "author": "Christopher Stock", "title": "Four Hurricanes selected in the 2020 NFL Draft, 2nd-most in ACC - 247Sports", "description": "Linebacker Shaquille Quarterman, running back DeeJay Dallas, wide receiver K.J. Osborn, and defensive end Jonathan Garvin were selected in the 2020 NFL Draft.", "url": "https://247sports.com/college/miami/Article/Four-Miami-Hurricanes-selected-in-the-2020-NFL-Draft-2nd-most-in-ACC-146492765/", "urlToImage": null, "publishedAt": "2020-04-25T22:58:09Z", "content": "Linebacker Shaquille Quarterman, running back DeeJay Dallas, wide receiver K.J. Osborn, and defensive end Jonathan Garvin were selected in the 2020 NFL Draft.\r\nQuarterman was picked in the fourth round by Jacksonville, Dallas went to Seattle in the fourth rou… [+2083 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Ravens Review Entire 2020 Draft | Baltimore Ravens - Baltimore Ravens", "description": "General Manager Eric DeCosta, Head Coach John Harbaugh and Director of Player Personnel Joe Hortiz talk about the Day 3 picks and the work the Ravens did ove...", "url": "https://www.youtube.com/watch?v=dcWKch4xxRU", "urlToImage": null, "publishedAt": "2020-04-25T22:56:57Z", "content": "General Manager Eric DeCosta, Head Coach John Harbaugh and Director of Player Personnel Joe Hortiz talk about the Day 3 picks and the work the Ravens did over the whole weekend.\r\n#BaltimoreRavens#Ravens#NFL\r\nSubscribe to the Baltimore Ravens YT Channel: https… [+444 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Rob Demovsky", "title": "Jon Runyan Jr., Packers' 6th-round pick in NFL draft, accidentally declines team's call - ESPN", "description": "Offensive lineman Jon Runyan Jr. said he accidentally declined the call Saturday from the Packers after they picked him in the sixth round of the NFL draft.", "url": "https://www.espn.com/nfl/story/_/id/29099084/jon-runyan-jr-packers-6th-round-pick-nfl-draft-accidentally-declines-team-call", "urlToImage": null, "publishedAt": "2020-04-25T22:28:44Z", "content": "GREEN BAY, Wis. -- Jon Runyan Jr. was in the middle of a text exchange with his agent, Ken Sarnoff, when his phone screen switched to an incoming call. Unfortunately for the draft hopeful from the University of Michigan, his texting thumb just happened to be … [+3031 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "Gabriel Fernandez", "title": "'The Last Dance' documentary: The curious case of Michael Jordan's fluctuating liquor glass - CBS Sports", "description": "What's the deal with Jordan's drink of choice during his interviews?", "url": "https://www.cbssports.com/nba/news/the-last-dance-documentary-the-curious-case-of-michael-jordans-fluctuating-liquor-glass/", "urlToImage": null, "publishedAt": "2020-04-25T21:59:31Z", "content": "One of the more interesting portions of last Sunday's premiere of \"The Last Dance\", a documentary about the 1997-98 Chicago Bulls, wasn't the never-before-seen footage of Michael Jordan cursing at his teammates in practice. It wasn't the reminder of Jordan's … [+2730 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Doug Rush", "title": "See it: Giants draft pick Shane Lemieux working at center - Giants Wire", "description": "Although Shane Lemieux is listed as a guard and has never played center, the New York Giant is already working on a new craft.", "url": "https://giantswire.usatoday.com/2020/04/25/see-it-new-york-giants-draft-pick-shane-lemieux-working-at-center/", "urlToImage": null, "publishedAt": "2020-04-25T20:41:07Z", "content": "The 2020 NFL Draft has officially come and gone, and the New York Giants ultimately stayed in place and used all 10 of their picks, including each of their four in Round 7.\r\nThe team was very specific and deliberate in their approach, focusing all of their at… [+323 chars]"}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "Christian D'Andrea", "title": "NFL Draft 2020: Jake Luton can go from little-hyped QB to Jaguar bargain - SB Nation", "description": "Luton’s 28:3 TD:INT ratio makes him an intriguing prospect for any team (but maybe not the Falcons).", "url": "https://www.sbnation.com/nfl/2020/4/25/21232920/2020-nfl-draft-jake-luton-oregon-state-quarterback-highlights-jaguars", "urlToImage": null, "publishedAt": "2020-04-25T20:15:22Z", "content": "The Jaguars selected Jake Luton with the 189th overall pick in the 2020 NFL Draft. Heres what Christian DAndrea had to say about the Luton ahead of the draft.\r\nJake Luton didnt win many games in college. Spending a career at Idaho and Oregon State will do tha… [+7109 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Mark Medina", "title": "Former Laker Mychal Thompson dishes on quarantine life, LeBron James and Klay Thompson - USA TODAY", "description": "Mychal Thompson, the Lakers broadcaster, discusses his son Klay's recovery from knee surgery and how the NBA season would have played out.", "url": "https://www.usatoday.com/story/sports/nba/2020/04/25/nba-former-laker-dishes-lebron-james-and-klay-thompson/3007505001/", "urlToImage": null, "publishedAt": "2020-04-25T19:02:11Z", "content": "SportsPulse: Former Chicago Bulls teammate B.J. Armstrong breaks down the first two episodes of \"The Last Dance\" and explains why Michael Jordan's criticism of his teammates was only the \"PG\" version.\r\nUSA TODAY\r\nFor someone who cherishes life and people, Myc… [+5517 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Shaq & Charles Barkley React To Michael Jordan's 'The Last Dance' - Access", "description": "ESPN's docuseries \"The Last Dance\" examines Michael Jordan's final Chicago Bulls season using never-before-seen footage, but does the footage make him look m...", "url": "https://www.youtube.com/watch?v=iHUgXwQY-no", "urlToImage": null, "publishedAt": "2020-04-25T17:00:17Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Call: Denzel Mims Learns He's Going To Be A Jet, Tells Joe Douglas He's Found A Playmaker - New York Jets", "description": "Go behind the scenes to watch the Jets call WR Denzel Mims and tell him he'll be the team's second round pick in the 2020 NFL Draft. Subscribe to the New Yor...", "url": "https://www.youtube.com/watch?v=Gww0eDuHy00", "urlToImage": null, "publishedAt": "2020-04-25T14:00:13Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Rickie Fowler's most aggressive shots on the PGA TOUR - PGA TOUR", "description": "Rickie Fowler isn't afraid of taking chances on the golf course, watch how some of his most agressive shots on the PGA TOUR paid off. SUBSCRIBE to PGA TOUR n...", "url": "https://www.youtube.com/watch?v=0ZvotPKSoEo", "urlToImage": null, "publishedAt": "2020-04-25T11:30:01Z", "content": "Rickie Fowler isn't afraid of taking chances on the golf course, watch how some of his most agressive shots on the PGA TOUR paid off.\r\nSUBSCRIBE to PGA TOUR now: http://pgat.us/vBxcZSh\r\nWelcome to the official YouTube channel of the PGA TOUR.Here you can find… [+849 chars]"}, {"source": {"id": null, "name": "Dailyknicks.com"}, "author": "Scott Davidson", "title": "New York Knicks: Best fits in the 2020 NBA Draft - Daily Knicks", "description": "The New York Knicks are going to have favorable odds of landing the first overall pick of the 2020 NBA Draft. To help speed up the rebuild, who should the ...", "url": "https://dailyknicks.com/2020/04/25/new-york-knicks-best-fits-2020-nba-draft/", "urlToImage": null, "publishedAt": "2020-04-25T11:23:32Z", "content": "NEW YORK, NEW YORK JUNE 20: NBA Commissioner Adam Silver prepares to announce the third overall pick by the New York Knicks during the 2019 NBA Draft at the Barclays Center on June 20, 2019 in the Brooklyn borough of New York City. (Photo by Sarah Stier/Getty… [+1312 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Jerry Jones, Mike McCarthy discuss the Cowboys' second and third-round draft picks - The Dallas Morning News", "description": "After Friday's NFL Draft, Dallas Cowboys coach Mike McCarthy and owner Jerry Jones hold a press conference regarding their second and third-round draft picks...", "url": "https://www.youtube.com/watch?v=9ArbBPWGnSQ", "urlToImage": null, "publishedAt": "2020-04-25T04:32:35Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Vikings select a PHYSICAL player in Cameron Dantzler with the 89th pick | 2020 NFL Draft - CBS Sports", "description": "With the 89th pick in the 2020 NFL Draft, the Minnesota Vikings select Cameron Dantzler, CB from Mississippi State. Our CBS Sports HQ crew breaks down the se...", "url": "https://www.youtube.com/watch?v=54K6rQbAsd4", "urlToImage": null, "publishedAt": "2020-04-25T04:17:28Z", "content": "With the 89th pick in the 2020 NFL Draft, the Minnesota Vikings select Cameron Dantzler, CB from Mississippi State.\r\nOur CBS Sports HQ crew breaks down the selection, providing a grade for the team and what potential impact Dantzler might have for the Vikings… [+252 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Raiders select Lynn Bowden Jr. & Bryan Edwards with the 80th and 81st pick | 2020 NFL Draft - CBS Sports", "description": "With the 80th pick in the 2020 NFL Draft, the Las Vegas Raiders select Lynn Bowden Jr., WR from Kentucky. And with the 81st pick select Bryan Edwards, WR fro...", "url": "https://www.youtube.com/watch?v=l6Zn5j5V3zg", "urlToImage": null, "publishedAt": "2020-04-25T03:33:21Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Will NHL hockey return this season? | HC@Home - SPORTSNET", "description": "David Amber is joined by Brendan Gallagher and Kevin Bieksa to discuss dad fights, TikTok videos & Dennis Rodman….. plus the state of league amid Covid-19. -...", "url": "https://www.youtube.com/watch?v=6YZpwdpKdec", "urlToImage": null, "publishedAt": "2020-04-25T02:50:15Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Patriots select an EXPLOSIVE Josh Uche with the 60th overall pick | 2020 NFL Draft - CBS Sports", "description": "With the 60th pick in the 2020 NFL Draft, the New England Patriots select Josh Uche, EDGE from Michigan. Our CBS Sports HQ crew breaks down the selection, pr...", "url": "https://www.youtube.com/watch?v=PKMAJM5Sexg", "urlToImage": null, "publishedAt": "2020-04-25T01:48:01Z", "content": "With the 60th pick in the 2020 NFL Draft, the New England Patriots select Josh Uche, EDGE from Michigan.\r\nOur CBS Sports HQ crew breaks down the selection, providing a grade for the team and what potential impact Uche might have for the Patriots.\r\nSUBSCRIBE T… [+199 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Dolphins receive a DISRUPTIVE ATHLETE in Raekwon Davis with the 56th overall pick | 2020 NFL Draft - CBS Sports", "description": "With the 56th pick in the 2020 NFL Draft, the Miami Dolphins select Raekwon Davis, defensive lineman from Alabama. Our CBS Sports HQ crew breaks down the sel...", "url": "https://www.youtube.com/watch?v=LZ82yzSt79Q", "urlToImage": null, "publishedAt": "2020-04-25T01:30:57Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Buccaneers select a HIGHLY SKILLED Antoine Winfield Jr. with the 45th pick | 2020 NFL Draft - CBS Sports", "description": "With the 45th pick in the 2020 NFL Draft, the Tampa Bay Buccaneers select Antoine WInfield Jr., S from Minnesota. Our CBS Sports HQ crew breaks down the sele...", "url": "https://www.youtube.com/watch?v=SkLs_JcBIYI", "urlToImage": null, "publishedAt": "2020-04-25T00:51:33Z", "content": "With the 45th pick in the 2020 NFL Draft, the Tampa Bay Buccaneers select Antoine WInfield Jr., S from Minnesota.\r\nOur CBS Sports HQ crew breaks down the selection, providing a grade for the team and what potential impact Winfield Jr. might have for the Bucca… [+262 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "1st Rd. Picks React to Being Drafted: Burrow, Tua, Love & More - NFL Media Originals", "description": "Subscribe to NFL Network: http://goo.gl/4GOLwY Check out our other channels: NFL Vault http://youtube.com/nflvault NFL Films http://www.youtube.com/nflfilms ...", "url": "https://www.youtube.com/watch?v=WP75lJS9P_c", "urlToImage": null, "publishedAt": "2020-04-24T18:15:55Z", "content": null}, {"source": {"id": null, "name": "Dodgerblue.com"}, "author": "Daniel Starkand", "title": "Former Dodgers Outfielder Andre Ethier: Red Sox Investigation ‘Typical Rob Manfred Story’ - DodgerBlue.com", "description": "Former Los Angeles Dodgers outfielder Andre Ethier was hypercritical of the Boston Red Sox's sign-stealing scandal and MLB commissioner Rob Manfred.", "url": "https://dodgerblue.com/former-dodgers-outfielder-andre-ethier-red-sox-investigation-typical-rob-manfred-story/2020/04/24/", "urlToImage": null, "publishedAt": "2020-04-24T17:43:12Z", "content": "Major League Baseball recently concluded its investigation into the Boston Red Sox for potential sign-stealing during their 2018 World Series run, and like the Houston Astros the year before, they were found guilty as misconduct.\r\nThe Red Sox’s cheating was d… [+3375 chars]"}]}