{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "2020 NFL Draft winners and losers: Cowboys, AFC North dominate while the Patriots, NFC North falter - CBS Sports", "description": "Recapping three days of drafting by the NFL's 32 teams", "url": "https://www.cbssports.com/nfl/draft/news/2020-nfl-draft-winners-and-losers-cowboys-afc-north-dominate-while-the-patriots-nfc-north-falter/", "urlToImage": null, "publishedAt": "2020-04-26T12:33:00Z", "content": "After months of waiting, the 2020 NFL Draft was gone in a flash. Left in the aftermath were a handful of winners and losers. CBS Sports evaluates what each team was able to accomplish over the course of three days.  \r\nWinner: Bengals\r\nCincinnati is the bigges… [+5850 chars]"}, {"source": {"id": null, "name": "Arrowheadaddict.com"}, "author": "Matt Conner", "title": "2020 Kansas City Chiefs undrafted free agents tracker - Arrowhead Addict", "description": "The Kansas City Chiefs drafted six total players in the 2020 NFL Draft class, but they'll add several more rookies thereafter as undrafted free agents. The...", "url": "https://arrowheadaddict.com/2020/04/25/2020-kansas-city-chiefs-undrafted-free-agents-tracker/", "urlToImage": null, "publishedAt": "2020-04-26T11:40:31Z", "content": "The book is closed on the 2020 NFL Draft, but that doesn’t mean that prospects hoping to hear their name called are without options. Given that every NFL team will likely carry a few undrafted free agents onto their active rosters this fall, it’s a frenzy aft… [+3837 chars]"}, {"source": {"id": null, "name": "Sun-sentinel.com"}, "author": "Dave Hyde", "title": "Miami Dolphins draft grades from a national view - South Florida Sun Sentinel", "description": "Drafting Tagovailoa gets high marks, but overall idea is a lot of development needed", "url": "https://www.sun-sentinel.com/sports/dave-hyde/fl-sp-draft-hyde10-dolphins-draft-20200426-yqyticbbtnfczcd6wohuexwzoq-story.html", "urlToImage": null, "publishedAt": "2020-04-26T11:29:46Z", "content": null}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "Kyle Hightower", "title": "Justin Rohrwasser, Patriots kicker: Tattoo doesn't represent Three Percenters - Washington Times", "description": "New Patriots kicker Justin Rohrwasser says a tattoo on his arm is not representative of a loosely organized right-wing militia group that has adopted the symbol.", "url": "https://www.washingtontimes.com/news/2020/apr/26/justin-rohrwasser-patriots-kicker-tattoo-doesnt-re/", "urlToImage": null, "publishedAt": "2020-04-26T11:27:12Z", "content": "BOSTON — New Patriots kicker Justin Rohrwasser says a tattoo on his arm is not representative of a loosely organized right-wing militia group that has adopted the symbol.\r\nRohrwasser, who played at Rhode Island and Marshall, was taken 159th overall in the fif… [+1245 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Jake Rill", "title": "NFL Draft Grades 2020: Final Results and Team-by-Team Letter Chart - Bleacher Report", "description": "For months, NFL analysts and experts speculated over where the top college prospects would land in the 2020 draft. We now have our answers.    The seven-round draft culminated Saturday, with 255 picks taking place over three days...", "url": "https://bleacherreport.com/articles/2888724-nfl-draft-grades-2020-final-results-and-team-by-team-letter-chart", "urlToImage": null, "publishedAt": "2020-04-26T10:32:12Z", "content": "Michael Conroy/Associated Press\r\nFor months, NFL analysts and experts speculated over where the top college prospects would land in the 2020 draft. We now have our answers.\r\nThe seven-round draft culminated Saturday, with 255 picks taking place over three day… [+5042 chars]"}, {"source": {"id": null, "name": "Steelers.com"}, "author": null, "title": "Labriola on Day 3 of the NFL Draft Sarrett on Dotson: 'What really shows up on - Steelers.com", "description": "Sarrett on Dotson: 'What really shows up on his tape is that he’s a people-mover'", "url": "https://www.steelers.com/news/labriola-on-day-3-of-the-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-26T10:03:03Z", "content": "On the first day, they watched other teams try to do with their first-round picks what the Steelers already had done with theirs, which was turn it into a first-team All-Pro player at a position of significant need. \r\nOn the second day, they took a shot at do… [+11007 chars]"}, {"source": {"id": null, "name": "Nj.com"}, "author": "Matt Lombardo | NJ Advance Media for NJ.com", "title": "NFL Draft grades: Report card for Giants’ full 2020 class from Andrew Thomas, Xavier McKinney, Cam Brown, more - NJ.com", "description": "Giants general manager Dave Gettleman spent the majority of the 2020 NFL Draft fortifying two of the franchise's most glaring weaknesses: The secondary and offensive line. The resulting NFL Draft class might be the strongest in the veteran general manager's t…", "url": "https://www.nj.com/giants/2020/04/nfl-draft-grades-report-card-for-giants-full-2020-class-from-andrew-thomas-xavier-mckinney-cam-brown-more.html", "urlToImage": null, "publishedAt": "2020-04-26T09:21:20Z", "content": "Dave Gettleman entered the 2020 NFL Draft proclaiming he did not fear adding too many great players at one position.\r\nWhen the Giants general manager uttered that phrase during a pre-draft conference call, many believed Gettleman was telegraphing adding playe… [+8923 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Michael David Smith", "title": "Report: Saints, Jameis Winston negotiating one-year deal - NBCSports.com", "description": "Jameis Winston is preparing to accept a job where he’ll have no chance of starting. Winston is finalizing a one-year contract with the Saints, according to Charles Robinson of Yahoo Sports. In New Orleans, Winston would compete with Taysom Hill to back up Dre…", "url": "https://profootballtalk.nbcsports.com/2020/04/26/report-saints-jameis-winston-negotiating-one-year-deal/", "urlToImage": null, "publishedAt": "2020-04-26T09:11:00Z", "content": "Jameis Winston is preparing to accept a job where he’ll have no chance of starting.\r\nWinston is finalizing a one-year contract with the Saints, according to Charles Robinson of Yahoo Sports.\r\nIn New Orleans, Winston would compete with Taysom Hill to back up D… [+894 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Michael David Smith", "title": "Belichick shrugs off Patriots passing on QBs - NBCSports.com", "description": "The Patriots selected 10 players in the 2020 NFL draft, and despite the departure of Tom Brady, a quarterback was not one of them. Bill Belichick says that’s just the way the team’s draft board fell. “If we feel like we find the right situation, we’ll certain…", "url": "https://profootballtalk.nbcsports.com/2020/04/26/belichick-shrugs-off-patriots-passing-on-qbs/", "urlToImage": null, "publishedAt": "2020-04-26T08:24:00Z", "content": "The Patriots selected 10 players in the 2020 NFL draft, and despite the departure of Tom Brady, a quarterback was not one of them. Bill Belichick says that’s just the way the team’s draft board fell.\r\n“If we feel like we find the right situation, we’ll certai… [+729 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": null, "title": "NFL draft 2020: 8 undrafted free agents who could catch on with teams - msnNOW", "description": "Many players didn't hear their names called in the 2020 NFL draft, but several could catch on with teams as undrafted free agents.", "url": "https://www.usatoday.com/story/sports/nfl/draft/2020/04/25/nfl-draft-undrafted-free-agents-best-teams-anthony-gordon/3028574001/", "urlToImage": null, "publishedAt": "2020-04-26T08:01:59Z", "content": "Even after 255 picks in the 2020 NFL draft, the scramble to acquire talent isn't over.\r\n© Mark J. Rebilas, USA TODAY Sports\r\n Washington State Cougars quarterback Anthony Gordon (18) celebrates a touchdown against the Air Force Falcons during the first half o… [+2760 chars]"}, {"source": {"id": null, "name": "Colts.com"}, "author": null, "title": "What were the top takeaways from Indianapolis Colts GM Chris Ballard and head coach Frank Reich after selecting nine players in the 2020 NFL Draft? - Big News Network", "description": "The Indianapolis Colts on Saturday wrapped up the 2020 NFL Draft with nine new, exciting prospects — five on offense, and four on defense — to work with. What were the top takeaways from the three days of action from general manager Chris Ballard and head", "url": "https://www.colts.com/news/jacob-eason-jonathan-taylor-nfl-draft-chris-ballard-frank-reich-takeaways", "urlToImage": null, "publishedAt": "2020-04-26T07:43:46Z", "content": "» Jacob Eason has the tools to develop into a solid NFL quarterback, but for now, he's simply competing for the No. 3 quarterback job: Ballard has been saying all along that the team didn't feel pressure to get a \"quarterback of the future,\" and that he would… [+7280 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Mark Cannizzaro", "title": "Jets' Joe Douglas didn't get Sam Darnold enough weapons - New York Post ", "description": "So, how do you think they did? There’s little doubt that Joe Douglas, conducting his first NFL draft as a general manager, made the Jets better over the past three days. He targeted one of the top …", "url": "https://nypost.com/2020/04/26/jets-joe-douglas-didnt-get-sam-darnold-enough-weapons/", "urlToImage": null, "publishedAt": "2020-04-26T06:29:05Z", "content": "So, how do you think they did? \r\nTheres little doubt that Joe Douglas, conducting his first NFL draft as a general manager, made the Jets better over the past three days. \r\nHe targeted one of the top collegiate tackles and he pounced on Louisvilles Mekhi Bect… [+4301 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Charean Williams", "title": "Report: Eagles, Marquise Goodwin agree to restructure - NBCSports.com", "description": "Receiver Marquise Goodwin agreed to restructure his contract after a trade to Philadelphia, Mike Kaye of nj.com reports. Goodwin, 29, will sign a one-year, $1.35 million deal. He has a chance to earn $1 million in incentives. Goodwin was scheduled to make $3.…", "url": "https://profootballtalk.nbcsports.com/2020/04/26/report-eagles-marquise-goodwin-agree-to-restructure/", "urlToImage": null, "publishedAt": "2020-04-26T04:21:00Z", "content": "Receiver Marquise Goodwin agreed to restructure his contract after a trade to Philadelphia, Mike Kaye of nj.com reports.\r\nGoodwin, 29, will sign a one-year, $1.35 million deal. He has a chance to earn $1 million in incentives.\r\nGoodwin was scheduled to make $… [+339 chars]"}, {"source": {"id": null, "name": "Theathletic.com"}, "author": "David Lombardi", "title": "Multiple trades, intriguing picks fill a busy final day of the 49ers' draft - The Athletic", "description": "The 49ers took a late-round chance on Jauan Jennings, the Tennessee receiver Kyle Shanahan called \"one of our most favorite guys to watch.\"", "url": "https://theathletic.com/1774510/2020/04/25/multiple-trades-intriguing-picks-fill-a-busy-final-day-of-the-49ers-draft/", "urlToImage": null, "publishedAt": "2020-04-26T03:16:38Z", "content": "The 49ers didn’t use a single one of their original picks during the NFL Draft and they’ll exit the weekend with a 10-year veteran set to start in place of retiring left tackle Joe Staley.That summary encapsulates the furious amount of wheeling, dealing, trad… [+681 chars]"}, {"source": {"id": null, "name": "Bjpenn.com"}, "author": "Chris Taylor", "title": "Eddie Alvarez believes Conor McGregor would “put away” Tony Ferguson - BJPENN.COM", "description": "Former UFC lightweight champion Eddie Alvarez believes that Conor McGregor would \"put away\" Tony Ferguson in a potential fight.", "url": "https://www.bjpenn.com/mma-news/conor-mcgregor/eddie-alvarez-believes-conor-mcgregor-would-put-away-tony-ferguson/", "urlToImage": null, "publishedAt": "2020-04-26T03:15:00Z", "content": "Former UFC lightweight champion Eddie Alvarez believes that Conor McGregor would “put away” Tony Ferguson in a potential fight.\r\nAlvarez, who now fights for ONE Championship, recently sat down with The Score MMA where he discussed McGregor’s chances against f… [+1576 chars]"}, {"source": {"id": null, "name": "Azcentral.com"}, "author": "Bob McManaman", "title": "Cardinals don't waste any time adding to their roster, start adding undrafted free agents - AZCentral", "description": "The Cardinals didn’t waste any time adding to their roster following the NFL draft as they have agreed to deals with multiple undrafted free agents.", "url": "https://www.azcentral.com/story/sports/nfl/cardinals/2020/04/25/cardinals-dont-waste-any-time-adding-their-roster-start-adding-undrafted-free-agents/3028943001/", "urlToImage": null, "publishedAt": "2020-04-26T02:59:26Z", "content": "The Cardinals didn’t waste any time adding to their roster following the NFL draft as they have agreed to deals with multiple undrafted free agents.\r\nNews of the additions either came from their respective universities, agents or representatives, various medi… [+3122 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": null, "title": "Handing out draft grades for Raiders' 2020 rookie class - NBCSports.com", "description": "The Raiders made sure to provide Derek Carr with some new weapons, while also adding depth to the secondary.", "url": "https://www.nbcsports.com/bayarea/raiders/raiders-2020-nfl-draft-grades-how-seven-player-rookie-class-turned-out", "urlToImage": null, "publishedAt": "2020-04-26T02:58:25Z", "content": "The 2020 NFL Draft is in the rearview mirror, and once again, the Raiders move forward with another large haul from the top collegiate programs. Of the seven players they added, four attended Alabama, Ohio State or -- of course -- Clemson.\r\nLas Vegas was done… [+2510 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "https://www.facebook.com/JJStankevitzCSN/", "title": "5 takeaways from Bears' 2020 draft class - NBCSports.com", "description": "The Bears didn't draft a quarterback, but that's not as big a deal as it may seem. Also: Position battles at safety and guard are coming into focus.", "url": "https://www.nbcsports.com/chicago/bears/no-quarterback-5-takeaways-bears-2020-nfl-draft-picks", "urlToImage": null, "publishedAt": "2020-04-26T02:50:31Z", "content": "The Bears wrapped up the 2020 NFL Draft on Saturday having made seven picks this year: TE Cole Kmet, CB Jaylon Johnson, EDGE Trevis Gipson, CB Kindle Vildor, WR Darnell Mooney, OL Arlington Hambright and OL Lachavious Simmons. \r\nFive thoughts on that haul, an… [+4784 chars]"}, {"source": {"id": null, "name": "Buffalobills.com"}, "author": null, "title": "2020 NFL Draft: QB Jake Fromm, WR Gabriel Davis and WR Isaiah Hodgins close out the Bills draft class - BuffaloBills.com", "description": "The Bills added additional weapons for the offense as well as picking up their only defensive back on the final day of the 2020 NFL Draft.", "url": "https://www.buffalobills.com/news/3-things-we-learned-on-the-final-day-of-the-2020-bills-draft", "urlToImage": null, "publishedAt": "2020-04-26T02:18:08Z", "content": "2. QB understudy\r\nBrandon Beane didn't expect Jake Fromm to be on the board by the time it was their turn to pick in round five. After the Georgia quarterback won at the highest level in the most competitive conference and beat out the likes of Jacob Eason an… [+2511 chars]"}, {"source": {"id": null, "name": "Detroitnews.com"}, "author": "Justin Rogers", "title": "Lions' Quinn pumps brakes on defining rookie roles, but expects Okudah to start - The Detroit News", "description": "When it comes to first-round pick Jeff Okudah, there's an expectation for instant impact, regardless of what the offseason ends up looking like", "url": "https://www.detroitnews.com/story/sports/nfl/lions/2020/04/25/lions-quinn-pumps-brakes-defining-rookie-roles-but-expects-okudah-start/3028815001/", "urlToImage": null, "publishedAt": "2020-04-26T01:59:00Z", "content": "Last SlideNext Slide\r\nNow that the 2020 NFL Draft is in the books, speculation naturally shifts to how the Detroit Lions' rookie class will be able to contribute in their first season.\r\nBut in an uncertain world stemming from the COVID-19 pandemic, preventing… [+2603 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Cameron DaSilva", "title": "Rams' projected depth chart after 2020 NFL Draft - Rams Wire", "description": "Here’s what the Rams’ depth chart could look like in 2020.", "url": "https://theramswire.usatoday.com/2020/04/25/nfl-draft-rams-depth-chart-projection-2020/", "urlToImage": null, "publishedAt": "2020-04-26T01:46:05Z", "content": "The Los Angeles Rams came away with some impact players in the 2020 NFL Draft this weekend, fortifying the offense early on before adding some versatile defenders on the other side of the ball. The team still has a long way to go before the season begins, whe… [+3354 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Patrick Conn", "title": "Biggest steals of the 2020 NFL Draft - The Draft Wire", "description": "After three days of telecasts, interviews, and 255 selections the 2020 NFL Draft is now in the books. We were promised chaos, uncertainty and surprises throughout the entire process. After the firs…", "url": "https://draftwire.usatoday.com/2020/04/25/2020-nfl-draft-steals-trevon-diggs-kristian-fulton/", "urlToImage": null, "publishedAt": "2020-04-26T01:39:09Z", "content": "\"I've been in the revenge business for so long, now that it's over, I don't know what to do with the rest of my life.\"\r\nSo it was for Inigo Montoya after he slew the Six-Fingered Man to avenge his father, and so it is for me at the conclusion of every NFL dra… [+280 chars]"}, {"source": {"id": null, "name": "Dallascowboys.com"}, "author": null, "title": "Gut Feeling: Best Day 3 Draft Pick? - DallasCowboys.com", "description": "So how did the Cowboys finish up this three-day NFL Draft? Our staff writers weighed in with their favorite Day 3 picks by the Cowboys on Saturday.", "url": "https://www.dallascowboys.com/news/gut-feeling-best-day-3-draft-pick", "urlToImage": null, "publishedAt": "2020-04-26T01:37:08Z", "content": "The Cowboys' 2020 draft class is complete with seven selections, including four on Saturday: cornerback Reggie Robinson, center Tyler Biadasz, defensive end Bradlee Anae and quarterback Ben DiNucci.\r\nWhich pick was most impressive? The DallasCowboys.com staff… [+3423 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Nick Wagoner", "title": "49ers, Trent Williams in no rush on extension, GM John Lynch says - ESPN", "description": "On the day the San Francisco 49ers acquired left tackle Trent Williams from Washington, 49ers general manager John Lynch said neither Williams nor the team is focused on a contract extension. Williams will be in the final year of his deal this season.", "url": "https://www.espn.com/nfl/story/_/id/29099733/49ers-trent-williams-no-rush-extension-gm-john-lynch-says", "urlToImage": null, "publishedAt": "2020-04-26T01:30:59Z", "content": "SANTA CLARA, Calif. -- It's been 482 days since new San Francisco 49ers left tackle Trent Williams last played in an NFL football game.\r\nWith so much uncertainty surrounding when the NFL season will start because of the coronavirus pandemic, it remains to be … [+5231 chars]"}, {"source": {"id": null, "name": "Theathletic.com"}, "author": "Sheil Kapadia, Bo Wulf and Zach Berman", "title": "Grading the Day 3 picks: Eagles close out draft with a run on speedy receivers - The Athletic", "description": "The Eagles drafted two more wide receivers Saturday and also acquired WR Marquise Goodwin. Our writers weigh in on each Day 3 move.", "url": "https://theathletic.com/1774547/2020/04/25/grading-the-eagles-day-3-picks-a-run-on-receivers/", "urlToImage": null, "publishedAt": "2020-04-26T01:23:43Z", "content": "The Eagles said they wanted volume in this draft, and they ended up selecting 10 players — six on offense, four on defense — over the three days.We’ve covered the Jalen Reagor pick and the Day 2 selections (Jalen Hurts and Davion Taylor). Below are thoughts o… [+635 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Kristopher Knox", "title": "Ranking Top 6 Future Scenarios for Aaron Rodgers After Packers Draft Jordan Love - Bleacher Report", "description": "The 2020 NFL draft wrapped up on Saturday, ending one of the most entertaining and unpredictable selection processes in recent memory.   The \"virtual\" nature of the remote draft played a part, but most of the drama came from the selections themselves...", "url": "https://bleacherreport.com/articles/2888669-ranking-top-6-future-scenarios-for-aaron-rodgers-after-packers-draft-jordan-love", "urlToImage": null, "publishedAt": "2020-04-26T01:21:11Z", "content": "Marcio Jose Sanchez/Associated Press\r\nBrady may have outlasted Garoppolo in New England, but he didn't retire when it was time to walk away. Instead, he signed with the Tampa Bay Buccaneers, in part to prove that he could be successful outside of the Patriots… [+786 chars]"}, {"source": {"id": null, "name": "Denverpost.com"}, "author": "Sean Keeler", "title": "Keeler: Garett Bolles was the biggest winner of Broncos’ 2020 draft - The Denver Post", "description": "Clearly, John Elway and Vic Fangio see something at tackle that your eyes don’t. Maybe Ja’Wuan James’ knee truly is ready to catch up on all those lost snaps. Maybe offensive line coach Mike Muncha…", "url": "https://www.denverpost.com/2020/04/25/garett-bolles-john-elway-denver-broncos-2020-nfl-draft/", "urlToImage": null, "publishedAt": "2020-04-26T01:12:00Z", "content": "Shuffling deck chairs isnt an open competition. An open competition is adding a draft pick or two, maybe a free agent, to stir the pot. An open competition raises the bar. An open competition lights a fire underneath Broncos left tackle Garett Bolles.\r\nInstea… [+3146 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Pete Thamel", "title": "How Jake Fromm became the NFL draft's biggest freefall and what it means for Georgia - Yahoo Sports", "description": "Jake Fromm is the quintessential college QB who could have been a Ring of Honor legend, but instead his dive into the unknown began with a belly flop.", "url": "https://sports.yahoo.com/how-jake-fromm-became-the-nfl-drafts-biggest-freefall-and-what-it-means-for-georgia-011132331.html", "urlToImage": null, "publishedAt": "2020-04-26T01:11:00Z", "content": "As Jake Fromm slid into infamy on Saturday afternoon, Georgia fans were there wincing along with him. For as bad as it was watching Fromm leave Georgia early and end up being picked in the fifth round by the Buffalo Bills at No. 167 overall, itll be worse wat… [+6989 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Several cars involved in early 'Big One' at Talladega | iRacing's Saturday Night Thunder - NASCAR", "description": "Several cars suffered damage at the virtual Talladega Superspeedway early in iRacing's Saturday Night Thunder. ---------- Subscribe to NASCAR on YouTube: htt...", "url": "https://www.youtube.com/watch?v=mW4oXajPjxc", "urlToImage": null, "publishedAt": "2020-04-26T01:10:30Z", "content": "Several cars suffered damage at the virtual Talladega Superspeedway early in iRacing's Saturday Night Thunder.\r\n----------Subscribe to NASCAR on YouTube: https://nas.cr/youtube\r\nVisit NASCAR.com for the latest news: https://nas.cr/nascar\r\nFor more race day in… [+600 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "John Keim", "title": "Redskins agree with LSU TE Thaddeus Moss, son of ex-NFL star Randy - ESPN", "description": "Former LSU tight end Thaddeus Moss, the son of NFL Hall of Famer Randy Moss, will sign with the Redskins as an undrafted free agent, the team confirmed Saturday night.", "url": "https://www.espn.com/nfl/draft2020/story/_/id/29099683/redskins-agree-lsu-te-thaddeus-moss-son-ex-nfl-star-randy", "urlToImage": null, "publishedAt": "2020-04-26T01:10:28Z", "content": "The Washington Redskins wanted more help at tight end, so they turned to a Hall of Fame family.\r\nThe Redskins will sign former LSU tight end Thaddeus Moss, the son of former NFL great and current ESPN analyst Randy Moss, as an undrafted free agent, a source t… [+2502 chars]"}, {"source": {"id": null, "name": "Palmbeachpost.com"}, "author": "Hal Habib", "title": "Habib: GM's sleight of hand means Miami Dolphins suddenly have intriguing running attack - Palm Beach Post", "description": "RBs Matt Breida, aka Breida the Cheetah, and Jordan Howard bring unique skills to the Dolphins to take pressure off Tua Tagovailoa.", "url": "https://www.palmbeachpost.com/article/20200425/SPORTS/200428641", "urlToImage": null, "publishedAt": "2020-04-26T00:50:37Z", "content": "RBs Matt Breida, aka Breida the Cheetah, and Jordan Howard bring unique skills to the Dolphins to take pressure off Tua Tagovailoa.\r\nGood running backs know how to be where tacklers don’t expect them to be.\r\nWho knew the same applies to general managers?\r\nThe… [+5186 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": null, "title": "What 49ers want seventh-round pick Jennings to work on - NBCSports.com", "description": "Jauan Jennings was overjoyed that the 49ers drafted him, but he already knows what the team expects of him.", "url": "https://www.nbcsports.com/bayarea/49ers/what-49ers-want-seventh-round-draft-pick-jauan-jennings-work", "urlToImage": null, "publishedAt": "2020-04-26T00:48:54Z", "content": "The joy that former Tennessee wide receiver Jauan Jennings was feeling after being drafted by the 49ers was undeniable. \r\nThe club used the No. 217 pick of the 2020 NFL Draft to select Jennings, and the receiver could not contain his enthusiasm. He had an ear… [+2639 chars]"}, {"source": {"id": null, "name": "Triblive.com"}, "author": "Tim Benz", "title": "Tim Benz: You know who the Steelers got in the draft. Now let's look at who they didn't get. - TribLIVE", "description": "You know what the Pittsburgh Steelers got in the draft. A huge wide receiver from a big school. A Conference USA reserve outside linebacker. A couple of Maryland Terps at running back and safety. And a trash-talking guard who might moonlight as a bouncer at a…", "url": "https://triblive.com/sports/tim-benz-you-know-who-the-steelers-got-in-the-draft-now-lets-look-at-who-they-didnt-get/", "urlToImage": null, "publishedAt": "2020-04-26T00:39:24Z", "content": "TribLIVE's Daily and Weekly email newsletters deliver the news you want and information you need, right to your inbox.\r\nYou know what the Pittsburgh Steelers got in the draft. \r\nA huge wide receiver from a big school. A Conference USA reserve outside lineback… [+5701 chars]"}, {"source": {"id": null, "name": "Houstonchronicle.com"}, "author": "John McClain", "title": "McClain: Texans land a mature class - Houston Chronicle", "description": "<p>Bill O’Brien’s five picks won’t be under pressure to start as rookies but all are expected to contribute</p>", "url": "https://www.houstonchronicle.com/texas-sports-nation/john-mcclain/article/McClain-Texans-land-a-mature-class-15226539.php", "urlToImage": null, "publishedAt": "2020-04-26T00:34:48Z", "content": "In his first draft as the Texans’ general manager, Bill O’Brien made three trades on Saturday and finished with five picks who have the talent to contribute as rookies.\r\nDefensive tackle Ross Blacklock, outside linebacker Jonathan Greenard, offensive tackle C… [+4585 chars]"}, {"source": {"id": null, "name": "Clevelandbrowns.com"}, "author": null, "title": "2020 Draft Analysis: Browns 'trust the board,' fill key spots on both sides of the ball - clevelandbrowns.com", "description": "Cleveland added 4 offensive players, 3 defensive players with its 7 picks", "url": "https://www.clevelandbrowns.com/news/2020-draft-analysis-browns-trust-the-board-fill-key-spots-on-both-sides-of-the-b", "urlToImage": null, "publishedAt": "2020-04-26T00:28:34Z", "content": "This would have been a brand new experience for Andrew Berry, Paul DePodesta and Kevin Stefanski under completely normal conditions.\r\nThe curveball thrown their way, in the form of a completely virtual NFL Draft that anchored every important figure to a compu… [+3064 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Chavez, CNN", "title": "Tampa mayor tries to make amends with Tom Brady in welcome letter - CNN", "description": "Tom Brady has had a few mishaps since moving to Tampa, Florida, so the mayor is trying to make nice with him.", "url": "https://www.cnn.com/2020/04/25/us/tom-brady-tampa-mayor-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-26T00:14:51Z", "content": "(CNN)Tom Brady has had a few mishaps since moving to Tampa, Florida, so the mayor is trying to make nice with him.\r\nThe 42-year-old NFL star was discovered working out in a downtown park earlier this week, and park staff ordered him to leave, Mayor Jane Casto… [+1235 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Sean Payton Recaps Saints 2020 NFL Draft, Adds QB Tommy Stevens in 7th Round - New Orleans Saints", "description": "New Orleans Saints Head Coach Sean Payton recaps day 3 at the 2020 NFL draft after jumping into the 7th round and drafting Mississippi State quarterback Tomm...", "url": "https://www.youtube.com/watch?v=Iy--axAduc0", "urlToImage": null, "publishedAt": "2020-04-26T00:10:36Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Cincinnati Bengals Draft Recap | 2020 NFL Draft Recap | CBS Sports HQ - CBS Sports", "description": "The Bengals made it official on Thursday, selecting Joe Burrow to be the new face of the franchise at the quarterback position. They followed that up by find...", "url": "https://www.youtube.com/watch?v=OqNSsoBNUrk", "urlToImage": null, "publishedAt": "2020-04-25T23:36:19Z", "content": "The Bengals made it official on Thursday, selecting Joe Burrow to be the new face of the franchise at the quarterback position. They followed that up by finding him his long-term No. 1 wide receiver and grabbing one of the best coverage linebackers for the de… [+273 chars]"}, {"source": {"id": null, "name": "Aseaofblue.com"}, "author": "Ianteasley", "title": "Kentucky Basketball should pursue Wake Forest’s Olivier Sarr ‘if’ he transfers - A Sea Of Blue", "description": "Sarr may have already decided to transfer. If so, Kentucky needs to reach out.", "url": "https://www.aseaofblue.com/2020/4/25/21236492/kentucky-wildcats-basketball-olivier-sarr-wake-forest-demon-deacons-news", "urlToImage": null, "publishedAt": "2020-04-25T23:23:57Z", "content": "On Saturday, the Wake Forest Demon Deacons fired head coach Danny Manning after a less-than-stellar stint in Winston-Salem. \r\nIt just so happens that Wake Forest has a big man by the name of Olivier Sarr, who averaged 14 points, 9.0 boards and 1.2 blocks per … [+1540 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NFL scout breaks down LB Trevis Gipson selection | Chicago Bears - Chicago Bears", "description": "Bears area scout Breck Ackley and Jeff Joniak break down the Bears 5th round draft choice and 155th overall, outside linebacker Trevis Gipson from Tulsa. Sub...", "url": "https://www.youtube.com/watch?v=YlLeuS_QsVI", "urlToImage": null, "publishedAt": "2020-04-25T23:23:05Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Lachavious Simmons College Highlights | Chicago Bears - Chicago Bears", "description": "Check out highlights from Bears 7th round pick and 227th overall, Lachavious Simmons from Tennessee State. Subscribe to the Bears YT Channel: http://chgobrs....", "url": "https://www.youtube.com/watch?v=_Q0bhoUN3fE", "urlToImage": null, "publishedAt": "2020-04-25T23:18:01Z", "content": null}, {"source": {"id": null, "name": "Espn.com"}, "author": "Adrian Wojnarowski", "title": "NBA reopening team practice facilities Friday where local restrictions eased, sources say - ESPN", "description": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.", "url": "https://www.espn.com/nba/story/_/id/29099194/nba-reopening-team-practice-facilities-friday-where-local-restrictions-eased-sources-say", "urlToImage": null, "publishedAt": "2020-04-25T23:00:39Z", "content": "The NBA is reopening team practice facilities beginning on Friday for players in states and municipalities that are loosening stay-at-home restrictions amid the coronavirus pandemic, sources told ESPN.\r\nPlayers can return to team facilities in states such as … [+2131 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Ravens Review Entire 2020 Draft | Baltimore Ravens - Baltimore Ravens", "description": "General Manager Eric DeCosta, Head Coach John Harbaugh and Director of Player Personnel Joe Hortiz talk about the Day 3 picks and the work the Ravens did ove...", "url": "https://www.youtube.com/watch?v=dcWKch4xxRU", "urlToImage": null, "publishedAt": "2020-04-25T22:56:57Z", "content": "General Manager Eric DeCosta, Head Coach John Harbaugh and Director of Player Personnel Joe Hortiz talk about the Day 3 picks and the work the Ravens did over the whole weekend.\r\n#BaltimoreRavens#Ravens#NFL\r\nSubscribe to the Baltimore Ravens YT Channel: https… [+444 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Rob Demovsky", "title": "Jon Runyan Jr., Packers' 6th-round pick in NFL draft, accidentally declines team's call - ESPN", "description": "Offensive lineman Jon Runyan Jr. said he accidentally declined the call Saturday from the Packers after they picked him in the sixth round of the NFL draft.", "url": "https://www.espn.com/nfl/story/_/id/29099084/jon-runyan-jr-packers-6th-round-pick-nfl-draft-accidentally-declines-team-call", "urlToImage": null, "publishedAt": "2020-04-25T22:28:44Z", "content": "GREEN BAY, Wis. -- Jon Runyan Jr. was in the middle of a text exchange with his agent, Ken Sarnoff, when his phone screen switched to an incoming call. Unfortunately for the draft hopeful from the University of Michigan, his texting thumb just happened to be … [+3031 chars]"}, {"source": {"id": null, "name": "247sports.com"}, "author": "Brad Crawford", "title": "Zach Smith takes issue after K.J. Hill goes in seventh round - 247Sports", "description": ".", "url": "https://247sports.com/Article/2020-NFL-Draft-KJ-Hill-Los-Angeles-Chargers-Zach-Smith-seventh-round-Ohio-State-Buckeyes-146491155/", "urlToImage": null, "publishedAt": "2020-04-25T22:25:27Z", "content": "Former Ohio State assistant Zach Smith who previously coached 2020 NFL Draft pick K.J. Hill took issue on Saturday with the former four-star placement in the seventh round. At a talent-rich position this draft cycle, Hill slipped to the Los Angeles Chargers n… [+1895 chars]"}, {"source": {"id": null, "name": "Phillyvoice.com"}, "author": null, "title": "Philadelphia Eagles select Stanford LB Casey Toohill with the 233rd pick of 2020 NFL Draft - PhillyVoice.com", "description": "In 2019, Toohill had 57 tackles (11.5 for loss), 8 sacks, and a forced fumble. The Eagles are clearly drafting him for his plus athleticism.", "url": "https://www.phillyvoice.com/philadelphia-eagles-select-stanford-lb-casey-toohill-with-233rd-pick-2020-nfl-draft/", "urlToImage": null, "publishedAt": "2020-04-25T22:16:01Z", "content": "With their tenth and (presumably) final pick of the 2020 NFL Draft, the 233rd pick overall, the Philadelphia Eagles selected Stanford edge rusher Casey Toohill.\r\nIn 2019, Toohill had 57 tackles (11.5 for loss), 8 sacks, and a forced fumble. The Eagles are cle… [+1050 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Doug Rush", "title": "See it: Giants draft pick Shane Lemieux working at center - Giants Wire", "description": "Although Shane Lemieux is listed as a guard and has never played center, the New York Giant is already working on a new craft.", "url": "https://giantswire.usatoday.com/2020/04/25/see-it-new-york-giants-draft-pick-shane-lemieux-working-at-center/", "urlToImage": null, "publishedAt": "2020-04-25T20:41:07Z", "content": "The 2020 NFL Draft has officially come and gone, and the New York Giants ultimately stayed in place and used all 10 of their picks, including each of their four in Round 7.\r\nThe team was very specific and deliberate in their approach, focusing all of their at… [+323 chars]"}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "Christian D'Andrea", "title": "NFL Draft 2020: Jake Luton can go from little-hyped QB to Jaguar bargain - SB Nation", "description": "Luton’s 28:3 TD:INT ratio makes him an intriguing prospect for any team (but maybe not the Falcons).", "url": "https://www.sbnation.com/nfl/2020/4/25/21232920/2020-nfl-draft-jake-luton-oregon-state-quarterback-highlights-jaguars", "urlToImage": null, "publishedAt": "2020-04-25T20:15:22Z", "content": "The Jaguars selected Jake Luton with the 189th overall pick in the 2020 NFL Draft. Heres what Christian DAndrea had to say about the Luton ahead of the draft.\r\nJake Luton didnt win many games in college. Spending a career at Idaho and Oregon State will do tha… [+7109 chars]"}, {"source": {"id": null, "name": "Si.com"}, "author": "Michael McCann", "title": "Debunking the Michael Jordan Gambling Conspiracy - Sports Illustrated", "description": "Michael Jordan's first retirement from the NBA has led to conspiracy theories over the years to explain why he left the Chicago Bulls in October 1993.", "url": "https://www.si.com/nba/2020/04/25/michael-jordan-retirement-gambling-conspiracy", "urlToImage": null, "publishedAt": "2020-04-25T20:13:00Z", "content": "While most of The Last Dance’s commentary on Michael Jordan is flattering, Jordan’s career featured several controversies that will be explored in upcoming episodes. One was his shocking decision to retire from the NBA in October 1993. \r\nJordan was only 30 ye… [+12212 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Mark Medina", "title": "Former Laker Mychal Thompson dishes on quarantine life, LeBron James and Klay Thompson - USA TODAY", "description": "Mychal Thompson, the Lakers broadcaster, discusses his son Klay's recovery from knee surgery and how the NBA season would have played out.", "url": "https://www.usatoday.com/story/sports/nba/2020/04/25/nba-former-laker-dishes-lebron-james-and-klay-thompson/3007505001/", "urlToImage": null, "publishedAt": "2020-04-25T19:02:11Z", "content": "SportsPulse: Former Chicago Bulls teammate B.J. Armstrong breaks down the first two episodes of \"The Last Dance\" and explains why Michael Jordan's criticism of his teammates was only the \"PG\" version.\r\nUSA TODAY\r\nFor someone who cherishes life and people, Myc… [+5517 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Bubba Watson's 2011 Zurich Classic winning highlights - PGA TOUR", "description": "Watch how Bubba Watson captured his second PGA TOUR title of 2011, in a two-hole playoff over Webb Simpson at the Zurich Classic of New Orleans at TPC Louisi...", "url": "https://www.youtube.com/watch?v=pvcH5YlTSAg", "urlToImage": null, "publishedAt": "2020-04-25T19:00:11Z", "content": null}, {"source": {"id": null, "name": "Milehighreport.com"}, "author": "Tim Lynch", "title": "Denver Broncos: Albert Okwuegbunam College Highlights - Mile High Report", "description": "The Denver Broncos have selected Albert Okwuegbunam in the fourth round and will be reunited with Drew Lock after playing together in Missouri.", "url": "https://www.milehighreport.com/2020/4/25/21236338/albert-okwuegbunam-highlights", "urlToImage": null, "publishedAt": "2020-04-25T17:32:14Z", "content": "The Denver Broncos have selected Albert Okwuegbunam in the fourth round and will be reunited with Drew Lock after playing together in Missouri."}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Devin Duvernay Looked Up to Steve Smith Sr. | Baltimore Ravens - Baltimore Ravens", "description": "The Ravens' newest wide receiver chats with the Baltimore media for the first time after being drafted in the third round. #BaltimoreRavens #Ravens #NFL Subs...", "url": "https://www.youtube.com/watch?v=TFq1t7Rsl_0", "urlToImage": null, "publishedAt": "2020-04-25T17:28:24Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Shaq & Charles Barkley React To Michael Jordan's 'The Last Dance' - Access", "description": "ESPN's docuseries \"The Last Dance\" examines Michael Jordan's final Chicago Bulls season using never-before-seen footage, but does the footage make him look m...", "url": "https://www.youtube.com/watch?v=iHUgXwQY-no", "urlToImage": null, "publishedAt": "2020-04-25T17:00:17Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Nicolas Anelka's Golden Boot Winning Season | All 19 Goals | Premier League 2008/09 - Chelsea Football Club", "description": "Take a look back at Nicolas Anelka's prolific 2008/09 season where he secured the Golden Boot, beating Manchester United's Cristiano Ronaldo by 1 goal. Downl...", "url": "https://www.youtube.com/watch?v=2hKSyopwNFQ", "urlToImage": null, "publishedAt": "2020-04-25T15:00:02Z", "content": "Take a look back at Nicolas Anelka's prolific 2008/09 season where he secured the Golden Boot, beating Manchester United's Cristiano Ronaldo by 1 goal.\r\nDownload Chelsea FC's official mobile app:-App Store https://apple.co/2vvlN9t-Play Store http://bit.ly/2Mf… [+839 chars]"}, {"source": {"id": null, "name": "Mmamania.com"}, "author": "Dan Hiergesell", "title": "UFC issues statement on COVID-19 health and safety precautions leading into May 9 event - MMA Mania", "description": "UFC releases statement on COVID-19 health and safety precautions leading into the promotion’s return on May 9 in Jacksonville, Florida.", "url": "https://www.mmamania.com/2020/4/25/21236011/ufc-releases-statement-on-covid-19-health-and-safety-precautions-ufc-249-ferguson-gaethje-mma-espn", "urlToImage": null, "publishedAt": "2020-04-25T14:57:47Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Scouting Report On Jets Day 2 Draft Picks: WR Denzel Mims, DB Ashtyn Davis, DE Jabari Zuniga - New York Jets", "description": "Jets personnel members talk about WR Denzel Mims, DB Ashtyn Davis and DE Jabari Zuniga and look ahead to Day 3 of the NFL Draft. Subscribe to the New York Je...", "url": "https://www.youtube.com/watch?v=W2wP9Szsbkw", "urlToImage": null, "publishedAt": "2020-04-25T14:48:29Z", "content": "Jets personnel members talk about WR Denzel Mims, DB Ashtyn Davis and DE Jabari Zuniga and look ahead to Day 3 of the NFL Draft.\r\nSubscribe to the New York Jets YT Channel: https://bit.ly/2KRtBJd"}, {"source": {"id": null, "name": "Theathletic.com"}, "author": "Jon Machota", "title": "How Cowboys landed player with 1-percent chance of falling to them; Day 3 goals - The Athletic", "description": "“It’s like you have a wide receiver playing corner. I’m hungry for the ball. I don’t want pass breakups, I want interceptions.\"", "url": "https://theathletic.com/1774180/2020/04/25/how-cowboys-landed-player-with-1-percent-chance-of-falling-to-them-day-3-goals/", "urlToImage": null, "publishedAt": "2020-04-25T12:37:09Z", "content": "The Cowboys could not have asked for a better first two days of the NFL Draft. A day after landing the sixth-ranked player on their board, Oklahoma wide receiver CeeDee Lamb, they addressed a pair of significant needs on defense with a cornerback many experts… [+663 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Vikings select a PHYSICAL player in Cameron Dantzler with the 89th pick | 2020 NFL Draft - CBS Sports", "description": "With the 89th pick in the 2020 NFL Draft, the Minnesota Vikings select Cameron Dantzler, CB from Mississippi State. Our CBS Sports HQ crew breaks down the se...", "url": "https://www.youtube.com/watch?v=54K6rQbAsd4", "urlToImage": null, "publishedAt": "2020-04-25T04:17:28Z", "content": "With the 89th pick in the 2020 NFL Draft, the Minnesota Vikings select Cameron Dantzler, CB from Mississippi State.\r\nOur CBS Sports HQ crew breaks down the selection, providing a grade for the team and what potential impact Dantzler might have for the Vikings… [+252 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Raiders select Lynn Bowden Jr. & Bryan Edwards with the 80th and 81st pick | 2020 NFL Draft - CBS Sports", "description": "With the 80th pick in the 2020 NFL Draft, the Las Vegas Raiders select Lynn Bowden Jr., WR from Kentucky. And with the 81st pick select Bryan Edwards, WR fro...", "url": "https://www.youtube.com/watch?v=l6Zn5j5V3zg", "urlToImage": null, "publishedAt": "2020-04-25T03:33:21Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Will NHL hockey return this season? | HC@Home - SPORTSNET", "description": "David Amber is joined by Brendan Gallagher and Kevin Bieksa to discuss dad fights, TikTok videos & Dennis Rodman….. plus the state of league amid Covid-19. -...", "url": "https://www.youtube.com/watch?v=6YZpwdpKdec", "urlToImage": null, "publishedAt": "2020-04-25T02:50:15Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Atlanta Falcons select Marlon Davidson with the 47th pick | 2020 NFL Draft - CBS Sports", "description": "With the 47th pick in the 2020 NFL Draft, the Atlanta Falcons select Marlon Davidson, DL from Auburn. Our CBS Sports HQ crew breaks down the selection, provi...", "url": "https://www.youtube.com/watch?v=Gj8lPvJg_XA", "urlToImage": null, "publishedAt": "2020-04-25T01:07:03Z", "content": "With the 47th pick in the 2020 NFL Draft, the Atlanta Falcons select Marlon Davidson, DL from Auburn.\r\nOur CBS Sports HQ crew breaks down the selection, providing a grade for the team and what potential impact Davidson might have for the Falcons.\r\nSUBSCRIBE T… [+237 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Buccaneers select a HIGHLY SKILLED Antoine Winfield Jr. with the 45th pick | 2020 NFL Draft - CBS Sports", "description": "With the 45th pick in the 2020 NFL Draft, the Tampa Bay Buccaneers select Antoine WInfield Jr., S from Minnesota. Our CBS Sports HQ crew breaks down the sele...", "url": "https://www.youtube.com/watch?v=SkLs_JcBIYI", "urlToImage": null, "publishedAt": "2020-04-25T00:51:33Z", "content": "With the 45th pick in the 2020 NFL Draft, the Tampa Bay Buccaneers select Antoine WInfield Jr., S from Minnesota.\r\nOur CBS Sports HQ crew breaks down the selection, providing a grade for the team and what potential impact Winfield Jr. might have for the Bucca… [+262 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Panthers select an IMPACTFUL Yetur Gross-Matos with the 38th overall pick | 2020 NFL Draft - CBS Sports", "description": "With the 38th pick in the 2020 NFL Draft, the Carolina Panthers select Yetur Gross-Matos, defensive end from Penn State. Our CBS Sports HQ crew breaks down t...", "url": "https://www.youtube.com/watch?v=A0M-moXZl28", "urlToImage": null, "publishedAt": "2020-04-25T00:06:48Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NFL Draft 2020: Bruce Arians, Bucs get protection for Tom Brady (FULL INTERVIEW) | NBC Sports - NBC Sports", "description": "Buccaneers head coach Bruce Arians joins Mike Tirico to discuss his team's decision on drafting Tristian Wirfs and what it means with the additions of Tom Br...", "url": "https://www.youtube.com/watch?v=Ni9fbdLtEnY", "urlToImage": null, "publishedAt": "2020-04-24T18:15:36Z", "content": null}, {"source": {"id": null, "name": "Dodgerblue.com"}, "author": "Daniel Starkand", "title": "Former Dodgers Outfielder Andre Ethier: Red Sox Investigation ‘Typical Rob Manfred Story’ - DodgerBlue.com", "description": "Former Los Angeles Dodgers outfielder Andre Ethier was hypercritical of the Boston Red Sox's sign-stealing scandal and MLB commissioner Rob Manfred.", "url": "https://dodgerblue.com/former-dodgers-outfielder-andre-ethier-red-sox-investigation-typical-rob-manfred-story/2020/04/24/", "urlToImage": null, "publishedAt": "2020-04-24T17:43:12Z", "content": "Major League Baseball recently concluded its investigation into the Boston Red Sox for potential sign-stealing during their 2018 World Series run, and like the Houston Astros the year before, they were found guilty as misconduct.\r\nThe Red Sox’s cheating was d… [+3375 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Dolphins fans go nuts about Tua Tagovailoa draft pick - WPLG Local 10", "description": "Miami Dolphins fans video taped their reactions from home as the team picked Tua Tagovailoa in the first round of the NFL Draft. Spoiler alert: They were pre...", "url": "https://www.youtube.com/watch?v=ph6E57s2k84", "urlToImage": null, "publishedAt": "2020-04-24T17:34:11Z", "content": null}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Dak Prescott's Brother, Jace, Dead At 31 - TMZ", "description": "Tragic news for the Dallas Cowboys QB and his family.", "url": "https://www.tmz.com/2020/04/24/nfls-dak-prescott-s-brother-dead-at-31-cause-of-death-unknown/", "urlToImage": null, "publishedAt": "2020-04-24T17:23:20Z", "content": "Tragic news for Dak Prescottand his family ... the quarterback's older brother, Jace Prescott, died suddenly at 31 years old on Thursday, the Dallas Cowboys announced.\r\nNo cause of death was given.\r\nDak had been super close with Jace, the oldest of the Presco… [+1131 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "PFT's 2020 NFL Draft superlatives | Pro Football Talk | NBC Sports - NBC Sports", "description": "Mike Florio and Chris Simms hand out superlatives from the 2020 NFL Draft. #NBCSports #ProFootballTalk #NFL » Subscribe to NBC Sports: https://www.youtube.co...", "url": "https://www.youtube.com/watch?v=C0DomvlB-MM", "urlToImage": null, "publishedAt": "2020-04-24T15:40:39Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "JADON SANCHO AT MAN UTD: 2020/21 TEAM LINE-UP - UnitedPeoplesTV", "description": "What would Man United’s team look like if Jadon Sancho joins this summer? Let’s take a look at the best Man Utd formation including Sancho and talk about the...", "url": "https://www.youtube.com/watch?v=Q2mi_kXZiNc", "urlToImage": null, "publishedAt": "2020-04-24T13:19:49Z", "content": null}]}