{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Paul Kasabian", "title": "Fantasy Football 2020: Dynasty Rookie Rankings, 1st-Round Mock After NFL Draft - Bleacher Report", "description": "The  NFL  draft is over, which means the next drafting season will move into full swing as fantasy football players ramp up for the 2020 season...", "url": "https://bleacherreport.com/articles/2888709-fantasy-football-2020-dynasty-rookie-rankings-1st-round-mock-after-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-26T14:34:31Z", "content": "Alika Jenner/Getty Images\r\nThe NFL draft is over, which means the next drafting season will move into full swing as fantasy football players ramp up for the 2020 season.\r\nThis year's rookie class is full of skill-position players who will be afforded opportun… [+6700 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Andrea Adelson", "title": "Louisville WR signee Dexter Rentz shot and killed - ESPN", "description": "Louisville signee Dexter Rentz was shot and killed in Orlando, Florida, late Saturday night.", "url": "https://www.espn.com/college-football/story/_/id/29100913/louisville-wr-signee-dexter-rentz-shot-killed", "urlToImage": null, "publishedAt": "2020-04-26T14:03:43Z", "content": "Louisville football signee Dexter Rentz was shot and killed in Orlando, Florida, late Saturday night.\r\nThe Orlando Police Department confirmed that Rentz died in the shooting, which also injured three others. Rentz was 18.\r\nLouisville coach Scott Satterfield … [+827 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Robert Gearty", "title": "Tom Brady gets 'apology' from Tampa Bay mayor after ouster from coronavirus-closed park - Fox News", "description": "Tampa’s mayor is flagging herself for a penalty after NFL superstar Tom Brady was ejected from a downtown park the city shuttered to contain the spread of the coronavirus.", "url": "https://www.foxnews.com/us/tom-brady-tampa-bay-mayor-apology", "urlToImage": null, "publishedAt": "2020-04-26T13:43:57Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nTampa’s mayor is flagging herself for a penalty after NFL superstar Tom Brady was ejected from a downtown park the city shuttered to contain the spread of the corona… [+1928 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Zach Kruse", "title": "Why didn't the Packers draft a WR? GM Brian Gutekunst explains - Packers Wire", "description": "The Packers missed out on the best WRs early and didn’t think they’d find a contributor in the later rounds.", "url": "https://packerswire.usatoday.com/2020/04/26/why-didnt-the-packers-draft-a-wr-gm-brian-gutekunst-explains/", "urlToImage": null, "publishedAt": "2020-04-26T13:40:11Z", "content": "Green Bay Packers general manager Brian Gutekunst explained why he didn’t take a receiver in the 2020 NFL draft, stating he missed out on the team’s highest-rated receivers in the draft and didn’t see the value in adding a late-round pick to the mix.\r\nThe Pac… [+2920 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "2020 NFL Draft: 12 biggest surprises, from Packers and Eagles taking QBs early to virtual sanity and more - CBS Sports", "description": "The 2020 draft had plenty of stunning moments over the course of three days", "url": "https://www.cbssports.com/nfl/draft/news/2020-nfl-draft-12-biggest-surprises-from-packers-and-eagles-taking-qbs-early-to-virtual-sanity-and-more/", "urlToImage": null, "publishedAt": "2020-04-26T13:09:24Z", "content": "The 2020 NFL Draft has come and gone, and while we'll be breaking down all the ramifications of the 255 picks made over the coming days and weeks, we're taking a moment in the immediate afterglow to look back on the biggest surprises from draft weekend. Wheth… [+12569 chars]"}, {"source": {"id": null, "name": "Thefalcoholic.com"}, "author": "Evan Birchfield", "title": "Falcons 2020 draft class selects their jersey numbers - The Falcoholic", "description": "New players, new numbers", "url": "https://www.thefalcoholic.com/2020/4/26/21237014/falcons-2020-draft-class-selects-their-jersey-numbers", "urlToImage": null, "publishedAt": "2020-04-26T12:00:00Z", "content": "The 2020 NFL Draft is now in the books. The Atlanta Falcons selected several talented players, some of which should be immediate starters heading into this upcoming season. One of the most exciting parts of seeing new players added to your team is seeing what… [+920 chars]"}, {"source": {"id": null, "name": "Pennlive.com"}, "author": "Bob Flounders | bflounders@pennlive.com", "title": "Penn State’s Jan Johnson signs with Houston Texans, four more Lions land free-agent deals - PennLive", "description": "Johnson was Penn State's starting middle linebacker the last two seasons.", "url": "https://www.pennlive.com/pennstatefootball/2020/04/penn-states-jan-johnson-signs-with-houston-texans-four-more-lions-land-free-agent-deals.html", "urlToImage": null, "publishedAt": "2020-04-26T11:54:04Z", "content": "Penn State superfans: Get exclusive, in-depth Nittany Lions news, analysis and recruiting updates every day. Become a PennLive Sports Insider. Only $7.99 a month. Learn more.\r\nFormer Penn State linebacker Jan Johnson is joining teammate John Reid in Houston.\r… [+1264 chars]"}, {"source": {"id": null, "name": "Www.sny.tv"}, "author": null, "title": "Did Dave Gettleman fully fix the Giants offensive line during the 2020 NFL Draft? - SNY.tv", "description": "This is the draft the Giants have been waiting for since December 0f 2017, when Dave Gettleman was hired as general manager. He vowed then to fix the offensive line. And after two years, he entered this draft vowing to fix it", "url": "https://www.sny.tv/giants/news/did-dave-gettleman-fully-fix-the-giants-offensive-line-during-the-2020-nfl-draft/313342816", "urlToImage": null, "publishedAt": "2020-04-26T11:47:07Z", "content": "Ralph Vacchiano | Facebook | Twitter | Archive\r\nThis is the draft the Giants have been waiting for since December 0f 2017, when Dave Gettleman was hired as general manager. He vowed then to fix the offensive line. And after two years, he entered this draft vo… [+4020 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Josh Alper", "title": "Kyle Shanahan: Trent Williams made it clear he doesn’t want a new deal right away - NBCSports.com", "description": "The 49ers knew left tackle Joe Staley was retiring before the draft started on Thursday night and they knew there was a possibility that they could land Trent Williams in a trade with Washington, but they hadn’t sealed a deal when they went on the clock with …", "url": "https://profootballtalk.nbcsports.com/2020/04/26/kyle-shanahan-trent-williams-made-it-clear-he-doesnt-want-a-new-deal-right-away/", "urlToImage": null, "publishedAt": "2020-04-26T11:43:00Z", "content": "The 49ers knew left tackle Joe Staley was retiring before the draft started on Thursday night and they knew there was a possibility that they could land Trent Williams in a trade with Washington, but they hadn’t sealed a deal when they went on the clock with … [+1113 chars]"}, {"source": {"id": null, "name": "Sun-sentinel.com"}, "author": "Dave Hyde", "title": "Miami Dolphins draft grades from a national view - South Florida Sun Sentinel", "description": "Drafting Tagovailoa gets high marks, but overall idea is a lot of development needed", "url": "https://www.sun-sentinel.com/sports/dave-hyde/fl-sp-draft-hyde10-dolphins-draft-20200426-yqyticbbtnfczcd6wohuexwzoq-story.html", "urlToImage": null, "publishedAt": "2020-04-26T11:29:46Z", "content": null}, {"source": {"id": "the-washington-times", "name": "The Washington Times"}, "author": "Kyle Hightower", "title": "Justin Rohrwasser, Patriots kicker: Tattoo doesn't represent Three Percenters - Washington Times", "description": "New Patriots kicker Justin Rohrwasser says a tattoo on his arm is not representative of a loosely organized right-wing militia group that has adopted the symbol.", "url": "https://www.washingtontimes.com/news/2020/apr/26/justin-rohrwasser-patriots-kicker-tattoo-doesnt-re/", "urlToImage": null, "publishedAt": "2020-04-26T11:27:12Z", "content": "BOSTON — New Patriots kicker Justin Rohrwasser says a tattoo on his arm is not representative of a loosely organized right-wing militia group that has adopted the symbol.\r\nRohrwasser, who played at Rhode Island and Marshall, was taken 159th overall in the fif… [+1245 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Michael Middlehurst-Schwartz", "title": "NFL draft 2020: 8 undrafted free agents who could catch on with teams - msnNOW", "description": "Many players didn't hear their names called in the 2020 NFL draft, but several could catch on with teams as undrafted free agents.", "url": "https://www.usatoday.com/story/sports/nfl/draft/2020/04/25/nfl-draft-undrafted-free-agents-best-teams-anthony-gordon/3028574001/", "urlToImage": null, "publishedAt": "2020-04-26T11:15:58Z", "content": "SportsPulse: While Tom Brady's arrival in Tampa Bay has dominated the offseason in the NFC, a plethora of other teams increased their ammunition during free agency and the draft. We recap it all.\r\nUSA TODAY\r\nEven after 255 picks in the 2020 NFL draft, the scr… [+2572 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "James Morgan", "title": "Every quarterback drafted before Georgia's Jake Fromm - UGA Wire", "description": "Georgia Bulldogs quarterback Jake Fromm was selected 167th (fifth round) in the 2020 NFL Draft by the Buffalo Bills. Fromm fell further than expected in the NFL Draft due to his subpar junior seaso…", "url": "https://ugawire.usatoday.com/2020/04/26/2020-nfl-draft-quarterbacks-georgia-bulldogs-football-jake-fromm-buffalo-bills/", "urlToImage": null, "publishedAt": "2020-04-26T11:06:46Z", "content": "Georgia Bulldogs quarterback Jake Fromm was selected 167th (fifth round) in the 2020 NFL Draft by the Buffalo Bills. Fromm fell further than expected in the NFL Draft due to his subpar junior season and concerns over his physical talent.\r\nFromm is a proven wi… [+1026 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Charles Goldman", "title": "2020 NFL Draft: Grading Chiefs' full draft class - Chiefs Wire", "description": "The Chiefs Wire staff grades the 2020 NFL Draft class of the Kansas City Chiefs.", "url": "https://chiefswire.usatoday.com/2020/04/26/kansas-city-chiefs-final-grades-2020-nfl-draft-class/", "urlToImage": null, "publishedAt": "2020-04-26T10:52:01Z", "content": "Following the 2017 NFL Draft, the Kansas City Chiefs were crushed by analysts, pundits, experts and anyone out there providing draft grades. Trading up into the top-10 to select Patrick Mahomes was considered by most accounts a risk. Three years later, the Ch… [+3875 chars]"}, {"source": {"id": null, "name": "Steelers.com"}, "author": null, "title": "Labriola on Day 3 of the NFL Draft Sarrett on Dotson: 'What really shows up on - Steelers.com", "description": "Sarrett on Dotson: 'What really shows up on his tape is that he’s a people-mover'", "url": "https://www.steelers.com/news/labriola-on-day-3-of-the-nfl-draft", "urlToImage": null, "publishedAt": "2020-04-26T10:03:03Z", "content": "On the first day, they watched other teams try to do with their first-round picks what the Steelers already had done with theirs, which was turn it into a first-team All-Pro player at a position of significant need. \r\nOn the second day, they took a shot at do… [+11007 chars]"}, {"source": {"id": null, "name": "Cleveland.com"}, "author": "Terry Pluto, The Plain Dealer", "title": "What is the NFL draft telling us about the new Cleveland Browns regime? Can this work out? - cleveland.com", "description": "Led by Chief Strategy Officer Paul DePodesta, GM Andrew Berry and Coach Kevin Stefanski, we are learning a few things about the Browns after seeing how they handled the NFL draft, relying on both analytics and scouting.", "url": "https://www.cleveland.com/browns/2020/04/what-is-the-nfl-draft-telling-us-about-the-new-cleveland-browns-regime.html", "urlToImage": null, "publishedAt": "2020-04-26T09:17:09Z", "content": "ABOUT THE BROWNS\r\n1. The Browns have a young, technically wired front office and that should be working in their favor during the draft. Chief Strategy Officer Paul DePodesta is the old hand in the room. When I checked his age, I was surprised to see hes only… [+8524 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Charles Robinson", "title": "Jameis Winston, Saints are close on deal - Yahoo Sports", "description": "A signing won’t guarantee him the backup job behind Drew Brees. Winston's best case scenario may ultimately be competing for the No. 2 spot with Taysom Hill", "url": "https://sports.yahoo.com/sources-jameis-winston-saints-finalizing-deal-081654906.html", "urlToImage": null, "publishedAt": "2020-04-26T08:16:00Z", "content": "Jameis Winston, one of the biggest remaining question marks in free agency, is finalizing a one-year deal to play for the New Orleans Saints in 2020, sources tell Yahoo Sports.\r\nThe deal is expected to be completed quickly now that the NFL draft has wrapped, … [+3075 chars]"}, {"source": {"id": null, "name": "Colts.com"}, "author": null, "title": "What were the top takeaways from Indianapolis Colts GM Chris Ballard and head coach Frank Reich after selecting nine players in the 2020 NFL Draft? - Big News Network", "description": "The Indianapolis Colts on Saturday wrapped up the 2020 NFL Draft with nine new, exciting prospects — five on offense, and four on defense — to work with. What were the top takeaways from the three days of action from general manager Chris Ballard and head", "url": "https://www.colts.com/news/jacob-eason-jonathan-taylor-nfl-draft-chris-ballard-frank-reich-takeaways", "urlToImage": null, "publishedAt": "2020-04-26T07:43:46Z", "content": "» Jacob Eason has the tools to develop into a solid NFL quarterback, but for now, he's simply competing for the No. 3 quarterback job: Ballard has been saying all along that the team didn't feel pressure to get a \"quarterback of the future,\" and that he would… [+7280 chars]"}, {"source": {"id": null, "name": "Detroitnews.com"}, "author": "Bob Wojnowski", "title": "Wojo: In weird draft, Lions do solid job of buying in bulk - The Detroit News", "description": "Wojo approves of the job Lions GM Bob Quinn did on this years' draft because it seems the Lions got a blend of value, talent and need", "url": "https://www.detroitnews.com/story/sports/columnists/bob-wojnowski/2020/04/26/wojo-weird-draft-lions-do-solid-job-buying-bulk/3029195001/", "urlToImage": null, "publishedAt": "2020-04-26T05:17:00Z", "content": "Last SlideNext Slide\r\nDetroit — It was the strangest draft ever, with the nation peering into the basements and living rooms of GMs, coaches and players. We all became background snoops and décor snobs, didn’t we? In our new virtual reality, the NFL looked ho… [+8253 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Paul Kasabian", "title": "Raiders' Mike Mayock Says COVID-19 Pandemic Impacted Team's NFL Draft Plans - Bleacher Report", "description": "Las Vegas Raiders  general manager  Mike Mayock  spoke with reporters after the draft Sunday and said that the COVID-19 pandemic affected their draft plans, specifically their reticence to bring in players in the late rounds...", "url": "https://bleacherreport.com/articles/2888729-raiders-mike-mayock-says-covid-19-pandemic-impacted-teams-nfl-draft-plans", "urlToImage": null, "publishedAt": "2020-04-26T04:58:13Z", "content": "Charlie Neibergall/Associated Press\r\nLas Vegas Raiders general manager Mike Mayock spoke with reporters after the draft Sunday and said that the COVID-19 pandemic affected their draft plans, specifically their reticence to bring in players in the late rounds.… [+1986 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Charean Williams", "title": "Report: Eagles, Marquise Goodwin agree to restructure - NBCSports.com", "description": "Receiver Marquise Goodwin agreed to restructure his contract after a trade to Philadelphia, Mike Kaye of nj.com reports. Goodwin, 29, will sign a one-year, $1.35 million deal. He has a chance to earn $1 million in incentives. Goodwin was scheduled to make $3.…", "url": "https://profootballtalk.nbcsports.com/2020/04/26/report-eagles-marquise-goodwin-agree-to-restructure/", "urlToImage": null, "publishedAt": "2020-04-26T04:21:00Z", "content": "Receiver Marquise Goodwin agreed to restructure his contract after a trade to Philadelphia, Mike Kaye of nj.com reports.\r\nGoodwin, 29, will sign a one-year, $1.35 million deal. He has a chance to earn $1 million in incentives.\r\nGoodwin was scheduled to make $… [+339 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The WAY TOO EARLY 2021 NFL Mock Draft | CBS Sports HQ - CBS Sports", "description": "It is never too early for Mock Draft season, and Ryan Wilson comes through with his 2021 NFL mock draft! The 2020 NFL Draft is now in the books, and Ryan Wil...", "url": "https://www.youtube.com/watch?v=Nzk19g4m4ZU", "urlToImage": null, "publishedAt": "2020-04-26T03:51:05Z", "content": null}, {"source": {"id": null, "name": "Musiccitymiracles.com"}, "author": "Jimmy Morris", "title": "NFL Draft Grades 2020 Titans - Music City Miracles", "description": "You already know how I feel about draft grades - especially when you see what the guy from USA Today had to say about the Titans draft. Sometimes you have to wonder how these people have jobs for...", "url": "https://www.musiccitymiracles.com/2020/4/25/21237072/nfl-draft-grades-2020-titans", "urlToImage": null, "publishedAt": "2020-04-26T03:13:03Z", "content": "You already know how I feel about draft grades - especially when you see what the guy from USA Today had to say about the Titans draft. Sometimes you have to wonder how these people have jobs for major media outlets. Apparently you dont have to know anything … [+1815 chars]"}, {"source": {"id": null, "name": "Azcentral.com"}, "author": "Bob McManaman", "title": "Cardinals don't waste any time adding to their roster, start adding undrafted free agents - AZCentral", "description": "The Cardinals didn’t waste any time adding to their roster following the NFL draft as they have agreed to deals with multiple undrafted free agents.", "url": "https://www.azcentral.com/story/sports/nfl/cardinals/2020/04/25/cardinals-dont-waste-any-time-adding-their-roster-start-adding-undrafted-free-agents/3028943001/", "urlToImage": null, "publishedAt": "2020-04-26T02:59:26Z", "content": "The Cardinals didn’t waste any time adding to their roster following the NFL draft as they have agreed to deals with multiple undrafted free agents.\r\nNews of the additions either came from their respective universities, agents or representatives, various medi… [+3122 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Ryan Pace and Matt Nagy recap 2020 NFL Draft | Chicago Bears - Chicago Bears", "description": "General manager Ryan Pace and head coach Matt Nagy address the media following the 2020 NFL Draft. Subscribe to the Bears YT Channel: http://chgobrs.com/1Lfm...", "url": "https://www.youtube.com/watch?v=Eg3Q008UqcU", "urlToImage": null, "publishedAt": "2020-04-26T02:22:17Z", "content": null}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Cameron DaSilva", "title": "Rams' projected depth chart after 2020 NFL Draft - Rams Wire", "description": "Here’s what the Rams’ depth chart could look like in 2020.", "url": "https://theramswire.usatoday.com/2020/04/25/nfl-draft-rams-depth-chart-projection-2020/", "urlToImage": null, "publishedAt": "2020-04-26T01:46:05Z", "content": "The Los Angeles Rams came away with some impact players in the 2020 NFL Draft this weekend, fortifying the offense early on before adding some versatile defenders on the other side of the ball. The team still has a long way to go before the season begins, whe… [+3354 chars]"}, {"source": {"id": null, "name": "Masslive.com"}, "author": "Nick O'Malley | nomalley@masslive.com", "title": "Patriots 2020 undrafted free agent tracker: Full list of UDFAs signing with New England - MassLive.com", "description": "Here are all the players the Patriots added after the draft.", "url": "https://www.masslive.com/patriots/2020/04/patriots-2020-undrafted-free-agent-tracker-full-list-of-udfas-signing-with-new-england.html", "urlToImage": null, "publishedAt": "2020-04-26T01:34:00Z", "content": "Draft day doesnt end for the New England Patriots when the selection called. Its time to shift focus to undrafted free agents.\r\nAs weve seen from players like Malcolm Butler, J.C Jackson, Adam Butler and Jakobi Meyers, draft position isnt everything for Bill … [+3104 chars]"}, {"source": {"id": null, "name": "Syracuse.com"}, "author": "Ryan Talbot | rtalbot@nyup.com", "title": "Buffalo Bills Draft 2020: The Bills got a steal in Dane Jackson (What they’re saying) - syracuse.com", "description": "Jackson is a competitive CB who could contend for a role as the team's nickel cornerback.", "url": "https://www.syracuse.com/buffalo-bills/2020/04/buffalo-bills-draft-2020-the-bills-got-a-steal-in-dane-jackson-what-theyre-saying.html", "urlToImage": null, "publishedAt": "2020-04-26T01:13:00Z", "content": "Dane Jackson was always around the ball as a member of the Pittsburgh Panthers.\r\nIn his career at Pitt, Jackson recorded 39 pass breakups and four interceptions. In the last two seasons, Jackson recorded 26 of his 39 pass breakups.\r\nJackson, the Buffalo Bills… [+1059 chars]"}, {"source": {"id": null, "name": "Denverpost.com"}, "author": "Sean Keeler", "title": "Keeler: Garett Bolles was the biggest winner of Broncos’ 2020 draft - The Denver Post", "description": "Clearly, John Elway and Vic Fangio see something at tackle that your eyes don’t. Maybe Ja’Wuan James’ knee truly is ready to catch up on all those lost snaps. Maybe offensive line coach Mike Muncha…", "url": "https://www.denverpost.com/2020/04/25/garett-bolles-john-elway-denver-broncos-2020-nfl-draft/", "urlToImage": null, "publishedAt": "2020-04-26T01:12:00Z", "content": "Shuffling deck chairs isnt an open competition. An open competition is adding a draft pick or two, maybe a free agent, to stir the pot. An open competition raises the bar. An open competition lights a fire underneath Broncos left tackle Garett Bolles.\r\nInstea… [+3146 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Several cars involved in early 'Big One' at Talladega | iRacing's Saturday Night Thunder - NASCAR", "description": "Several cars suffered damage at the virtual Talladega Superspeedway early in iRacing's Saturday Night Thunder. ---------- Subscribe to NASCAR on YouTube: htt...", "url": "https://www.youtube.com/watch?v=mW4oXajPjxc", "urlToImage": null, "publishedAt": "2020-04-26T01:10:30Z", "content": "Several cars suffered damage at the virtual Talladega Superspeedway early in iRacing's Saturday Night Thunder.\r\n----------Subscribe to NASCAR on YouTube: https://nas.cr/youtube\r\nVisit NASCAR.com for the latest news: https://nas.cr/nascar\r\nFor more race day in… [+600 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "John Keim", "title": "Redskins agree with LSU TE Thaddeus Moss, son of ex-NFL star Randy - ESPN", "description": "Former LSU tight end Thaddeus Moss, the son of NFL Hall of Famer Randy Moss, will sign with the Redskins as an undrafted free agent, the team confirmed Saturday night.", "url": "https://www.espn.com/nfl/draft2020/story/_/id/29099683/redskins-agree-lsu-te-thaddeus-moss-son-ex-nfl-star-randy", "urlToImage": null, "publishedAt": "2020-04-26T01:10:28Z", "content": "The Washington Redskins wanted more help at tight end, so they turned to a Hall of Fame family.\r\nThe Redskins will sign former LSU tight end Thaddeus Moss, the son of former NFL great and current ESPN analyst Randy Moss, as an undrafted free agent, a source t… [+2502 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": null, "title": "Adrian Peterson wishes Redskins got more in exchange for Trent Williams - NBCSports.com", "description": "Adrian Peterson will miss Trent Williams but wishes the team got more in return from the 49ers.", "url": "https://www.nbcsports.com/washington/redskins/adrian-peterson-wishes-redskins-got-more-exchange-trent-williams", "urlToImage": null, "publishedAt": "2020-04-26T00:53:57Z", "content": "Hollywood makes plenty of movies about football, but they almost always center them around the quarterback. Left tackles don't often get movies, but if one ever gets made, it should be about the Trent Williams saga. \r\nWilliams sat out the entire 2019 season i… [+2580 chars]"}, {"source": {"id": null, "name": "Palmbeachpost.com"}, "author": "Hal Habib", "title": "Habib: GM's sleight of hand means Miami Dolphins suddenly have intriguing running attack - Palm Beach Post", "description": "RBs Matt Breida, aka Breida the Cheetah, and Jordan Howard bring unique skills to the Dolphins to take pressure off Tua Tagovailoa.", "url": "https://www.palmbeachpost.com/article/20200425/SPORTS/200428641", "urlToImage": null, "publishedAt": "2020-04-26T00:50:37Z", "content": "RBs Matt Breida, aka Breida the Cheetah, and Jordan Howard bring unique skills to the Dolphins to take pressure off Tua Tagovailoa.\r\nGood running backs know how to be where tacklers don’t expect them to be.\r\nWho knew the same applies to general managers?\r\nThe… [+5186 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": null, "title": "What 49ers want seventh-round pick Jennings to work on - NBCSports.com", "description": "Jauan Jennings was overjoyed that the 49ers drafted him, but he already knows what the team expects of him.", "url": "https://www.nbcsports.com/bayarea/49ers/what-49ers-want-seventh-round-draft-pick-jauan-jennings-work", "urlToImage": null, "publishedAt": "2020-04-26T00:48:54Z", "content": "The joy that former Tennessee wide receiver Jauan Jennings was feeling after being drafted by the 49ers was undeniable. \r\nThe club used the No. 217 pick of the 2020 NFL Draft to select Jennings, and the receiver could not contain his enthusiasm. He had an ear… [+2639 chars]"}, {"source": {"id": null, "name": "Houstonchronicle.com"}, "author": "John McClain", "title": "McClain: Texans land a mature class - Houston Chronicle", "description": "<p>Bill O’Brien’s five picks won’t be under pressure to start as rookies but all are expected to contribute</p>", "url": "https://www.houstonchronicle.com/texas-sports-nation/john-mcclain/article/McClain-Texans-land-a-mature-class-15226539.php", "urlToImage": null, "publishedAt": "2020-04-26T00:34:48Z", "content": "In his first draft as the Texans’ general manager, Bill O’Brien made three trades on Saturday and finished with five picks who have the talent to contribute as rookies.\r\nDefensive tackle Ross Blacklock, outside linebacker Jonathan Greenard, offensive tackle C… [+4585 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Sean Payton Recaps Saints 2020 NFL Draft, Adds QB Tommy Stevens in 7th Round - New Orleans Saints", "description": "New Orleans Saints Head Coach Sean Payton recaps day 3 at the 2020 NFL draft after jumping into the 7th round and drafting Mississippi State quarterback Tomm...", "url": "https://www.youtube.com/watch?v=Iy--axAduc0", "urlToImage": null, "publishedAt": "2020-04-26T00:10:36Z", "content": null}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": null, "title": "2020 NFL Draft Analysis: Bears select Lachavious Simmons, Tennessee State OT - NBCSports.com", "description": "Strengths and weaknesses for offensive lineman Arlington Hambright, whom the Bears drafted in the seventh round of the 2020 NFL Draft.", "url": "https://www.nbcsports.com/chicago/bears/2020-nfl-draft-analysis-bears-select-colorado-offensive-lineman-arlington-hambright", "urlToImage": null, "publishedAt": "2020-04-25T23:46:00Z", "content": "Before the draft, I laid out what Ryan Paces checklist this week should be. A recap: Try to trade down, let your needs guide you, think safe and find three players who can contribute right away. \r\nAlright, so Pace didnt trade down, despite saying he had scena… [+4082 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Cincinnati Bengals Draft Recap | 2020 NFL Draft Recap | CBS Sports HQ - CBS Sports", "description": "The Bengals made it official on Thursday, selecting Joe Burrow to be the new face of the franchise at the quarterback position. They followed that up by find...", "url": "https://www.youtube.com/watch?v=OqNSsoBNUrk", "urlToImage": null, "publishedAt": "2020-04-25T23:36:19Z", "content": "The Bengals made it official on Thursday, selecting Joe Burrow to be the new face of the franchise at the quarterback position. They followed that up by finding him his long-term No. 1 wide receiver and grabbing one of the best coverage linebackers for the de… [+273 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NBA Opening Practice Facilities In Some States - Lakers Nation", "description": "A step towards normalcy... Los Angeles Lakers ✔️ Help us continue to provide Lakers coverage and SUBSCRIBE: https://goo.gl/5AXSud ✔️ Our MOST POPULAR Videos:...", "url": "https://www.youtube.com/watch?v=Y7tGzu5exa8", "urlToImage": null, "publishedAt": "2020-04-25T23:24:22Z", "content": null}, {"source": {"id": null, "name": "Aseaofblue.com"}, "author": "Ianteasley", "title": "Kentucky Basketball should pursue Wake Forest’s Olivier Sarr ‘if’ he transfers - A Sea Of Blue", "description": "Sarr may have already decided to transfer. If so, Kentucky needs to reach out.", "url": "https://www.aseaofblue.com/2020/4/25/21236492/kentucky-wildcats-basketball-olivier-sarr-wake-forest-demon-deacons-news", "urlToImage": null, "publishedAt": "2020-04-25T23:23:57Z", "content": "On Saturday, the Wake Forest Demon Deacons fired head coach Danny Manning after a less-than-stellar stint in Winston-Salem. \r\nIt just so happens that Wake Forest has a big man by the name of Olivier Sarr, who averaged 14 points, 9.0 boards and 1.2 blocks per … [+1540 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NFL scout breaks down LB Trevis Gipson selection | Chicago Bears - Chicago Bears", "description": "Bears area scout Breck Ackley and Jeff Joniak break down the Bears 5th round draft choice and 155th overall, outside linebacker Trevis Gipson from Tulsa. Sub...", "url": "https://www.youtube.com/watch?v=YlLeuS_QsVI", "urlToImage": null, "publishedAt": "2020-04-25T23:23:05Z", "content": null}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Marc Berman", "title": "NBA's first step in coronavirus reopening doesn't include all teams - New York Post ", "description": "In a first step of progress to the reopening of the season, the NBA is planning on allowing teams in cities in which there is no longer a lockdown to open their practice facilities May 1, according…", "url": "https://nypost.com/2020/04/25/nbas-first-step-in-coronavirus-reopening-doesnt-include-all-teams/", "urlToImage": null, "publishedAt": "2020-04-25T23:19:41Z", "content": "In a first step of progress to the reopening of the season, the NBA is planning on allowing teams in cities in which there is no longer a lockdown to open their practice facilities May 1, according to ESPN.\r\nA person with knowledge of the situation told The P… [+2345 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": "Michael David Smith", "title": "Georgia LB Tae Crowder is Mr. Irrelevant - NBCSports.com", "description": "The 2020 NFL draft is in the books. The draft ended at 7 p.m. Eastern on Saturday with the announcement of Mr. Irrelevant: Georgia linebacker Tae Crowder, who went to the Giants with the 255th and final pick in the draft. The annual Irrelevant Week, in which …", "url": "https://profootballtalk.nbcsports.com/2020/04/25/georgia-lb-tae-crowder-is-mr-irrelevant/", "urlToImage": null, "publishedAt": "2020-04-25T23:05:00Z", "content": "The 2020 NFL draft is in the books.\r\nThe draft ended at 7 p.m. Eastern on Saturday with the announcement of Mr. Irrelevant: Georgia linebacker Tae Crowder, who went to the Giants with the 255th and final pick in the draft.\r\nThe annual Irrelevant Week, in whic… [+428 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Ravens Review Entire 2020 Draft | Baltimore Ravens - Baltimore Ravens", "description": "General Manager Eric DeCosta, Head Coach John Harbaugh and Director of Player Personnel Joe Hortiz talk about the Day 3 picks and the work the Ravens did ove...", "url": "https://www.youtube.com/watch?v=dcWKch4xxRU", "urlToImage": null, "publishedAt": "2020-04-25T22:56:57Z", "content": "General Manager Eric DeCosta, Head Coach John Harbaugh and Director of Player Personnel Joe Hortiz talk about the Day 3 picks and the work the Ravens did over the whole weekend.\r\n#BaltimoreRavens#Ravens#NFL\r\nSubscribe to the Baltimore Ravens YT Channel: https… [+444 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Dana White on UFC 249, Fight Island & re opening after the pandemic - Yahoo! Sports", "description": "Yahoo Sports MMA insider Kevin Iole caught up with the UFC president to talk about his decision to bring the sport back May 9 in Florida. Plus, the two take ...", "url": "https://www.youtube.com/watch?v=7vyg6Dk6P88", "urlToImage": null, "publishedAt": "2020-04-25T22:40:45Z", "content": "Yahoo Sports MMA insider Kevin Iole caught up with the UFC president to talk about his decision to bring the sport back May 9 in Florida. Plus, the two take a look at the odds for those bouts in Jacksonville, the continued construction around Fight Island and… [+417 chars]"}, {"source": {"id": null, "name": "Espn.com"}, "author": "Rob Demovsky", "title": "Jon Runyan Jr., Packers' 6th-round pick in NFL draft, accidentally declines team's call - ESPN", "description": "Offensive lineman Jon Runyan Jr. said he accidentally declined the call Saturday from the Packers after they picked him in the sixth round of the NFL draft.", "url": "https://www.espn.com/nfl/story/_/id/29099084/jon-runyan-jr-packers-6th-round-pick-nfl-draft-accidentally-declines-team-call", "urlToImage": null, "publishedAt": "2020-04-25T22:28:44Z", "content": "GREEN BAY, Wis. -- Jon Runyan Jr. was in the middle of a text exchange with his agent, Ken Sarnoff, when his phone screen switched to an incoming call. Unfortunately for the draft hopeful from the University of Michigan, his texting thumb just happened to be … [+3031 chars]"}, {"source": {"id": null, "name": "Boltsfromtheblue.com"}, "author": "Michael Peterson", "title": "Chargers Draft Results: Grade and Reactions for the K.J. Hill pick - Bolts From The Blue", "description": "Ohio state wide receiver K.J. Hill should immediately step in and compete for Chargers third WR spot", "url": "https://www.boltsfromtheblue.com/2020/4/25/21233762/nfl-draft-chargers-sixth-pick-justin-herbert-oregon-ducks-twitter-reaction", "urlToImage": null, "publishedAt": "2020-04-25T22:11:05Z", "content": "The Chargers finished the 2020 NFL Draft with one of their best picks of the entire weekend when they selected Ohio state wide receiver K.J. Hill in the seventh round. Hill comes to the Chargers after becoming the Buckeyes all-time leader in career receptions… [+1891 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "Gabriel Fernandez", "title": "'The Last Dance' documentary: The curious case of Michael Jordan's fluctuating liquor glass - CBS Sports", "description": "What's the deal with Jordan's drink of choice during his interviews?", "url": "https://www.cbssports.com/nba/news/the-last-dance-documentary-the-curious-case-of-michael-jordans-fluctuating-liquor-glass/", "urlToImage": null, "publishedAt": "2020-04-25T21:59:31Z", "content": "One of the more interesting portions of last Sunday's premiere of \"The Last Dance\", a documentary about the 1997-98 Chicago Bulls, wasn't the never-before-seen footage of Michael Jordan cursing at his teammates in practice. It wasn't the reminder of Jordan's … [+2730 chars]"}, {"source": {"id": null, "name": "Sbnation.com"}, "author": "Christian D'Andrea", "title": "NFL Draft 2020: Jake Luton can go from little-hyped QB to Jaguar bargain - SB Nation", "description": "Luton’s 28:3 TD:INT ratio makes him an intriguing prospect for any team (but maybe not the Falcons).", "url": "https://www.sbnation.com/nfl/2020/4/25/21232920/2020-nfl-draft-jake-luton-oregon-state-quarterback-highlights-jaguars", "urlToImage": null, "publishedAt": "2020-04-25T20:15:22Z", "content": "The Jaguars selected Jake Luton with the 189th overall pick in the 2020 NFL Draft. Heres what Christian DAndrea had to say about the Luton ahead of the draft.\r\nJake Luton didnt win many games in college. Spending a career at Idaho and Oregon State will do tha… [+7109 chars]"}, {"source": {"id": null, "name": "Si.com"}, "author": "Michael McCann", "title": "Debunking the Michael Jordan Gambling Conspiracy - Sports Illustrated", "description": "Michael Jordan's first retirement from the NBA has led to conspiracy theories over the years to explain why he left the Chicago Bulls in October 1993.", "url": "https://www.si.com/nba/2020/04/25/michael-jordan-retirement-gambling-conspiracy", "urlToImage": null, "publishedAt": "2020-04-25T20:13:00Z", "content": "While most of The Last Dance’s commentary on Michael Jordan is flattering, Jordan’s career featured several controversies that will be explored in upcoming episodes. One was his shocking decision to retire from the NBA in October 1993. \r\nJordan was only 30 ye… [+12212 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "", "title": "Cowboys draft Tyler Biadasz after trade with Eagles; center will compete to replace Travis Frederick - CBS Sports", "description": "2020 Cowboys draft: Tyler Biadasz heads to Dallas as potential Travis Frederick replacement after Eagles trade", "url": "https://www.cbssports.com/nfl/news/cowboys-draft-tyler-biadasz-after-trade-with-eagles-center-will-compete-to-replace-travis-frederick/", "urlToImage": null, "publishedAt": "2020-04-25T20:07:20Z", "content": "Sometimes you have to strike a deal with your enemy in order to improve your current situation, but it's rare that the Dallas Cowboys have felt obliged to do so. Having not negotiated a draft day trade with the Philadelphia Eagles since 2010, the decade-long … [+3816 chars]"}, {"source": {"id": null, "name": "Si.com"}, "author": "Jenna West", "title": "Joe Staley Announces Retirement After 13 Seasons With 49ers - Sports Illustrated", "description": "Staley made six Pro Bowls and earned three second-team All Pro nods during his career.", "url": "https://www.si.com/nfl/2020/04/25/joe-staley-retires-49ers", "urlToImage": null, "publishedAt": "2020-04-25T19:53:00Z", "content": "Veteran left tackle Joe Staley is ending his NFL career after 13 seasons with the 49ers.\r\nStaley announced his retirement on social media on Saturday afternoon, citing health concerns as the reason for his decision. \r\n\"After 13 incredible seasons with the San… [+1540 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Inside Justin Madubuike's Emotional Draft Call With Eric DeCosta | Baltimore Ravens - Baltimore Ravens", "description": "GM Eric DeCosta calls A&M DT Justin Madubuike. #BaltimoreRavens #Ravens #NFL Subscribe to the Baltimore Ravens YT Channel: https://goo.gl/uhx4ks For more Rav...", "url": "https://www.youtube.com/watch?v=BM8wXc3O1KE", "urlToImage": null, "publishedAt": "2020-04-25T19:26:11Z", "content": null}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Mark Medina", "title": "Former Laker Mychal Thompson dishes on quarantine life, LeBron James and Klay Thompson - USA TODAY", "description": "Mychal Thompson, the Lakers broadcaster, discusses his son Klay's recovery from knee surgery and how the NBA season would have played out.", "url": "https://www.usatoday.com/story/sports/nba/2020/04/25/nba-former-laker-dishes-lebron-james-and-klay-thompson/3007505001/", "urlToImage": null, "publishedAt": "2020-04-25T19:02:11Z", "content": "SportsPulse: Former Chicago Bulls teammate B.J. Armstrong breaks down the first two episodes of \"The Last Dance\" and explains why Michael Jordan's criticism of his teammates was only the \"PG\" version.\r\nUSA TODAY\r\nFor someone who cherishes life and people, Myc… [+5517 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Shaq & Charles Barkley React To Michael Jordan's 'The Last Dance' - Access", "description": "ESPN's docuseries \"The Last Dance\" examines Michael Jordan's final Chicago Bulls season using never-before-seen footage, but does the footage make him look m...", "url": "https://www.youtube.com/watch?v=iHUgXwQY-no", "urlToImage": null, "publishedAt": "2020-04-25T17:00:17Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Call: Jabari Zuniga Learns He's Being Drafted By The New York Jets | NFL Draft - New York Jets", "description": "Florida DE Jabari Zuniga gets the call from the New York Jets as he's selected in the third round of the 2020 NFL Draft. Subscribe to the New York Jets YT Ch...", "url": "https://www.youtube.com/watch?v=41tYp1_cpxA", "urlToImage": null, "publishedAt": "2020-04-25T16:30:53Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Nicolas Anelka's Golden Boot Winning Season | All 19 Goals | Premier League 2008/09 - Chelsea Football Club", "description": "Take a look back at Nicolas Anelka's prolific 2008/09 season where he secured the Golden Boot, beating Manchester United's Cristiano Ronaldo by 1 goal. Downl...", "url": "https://www.youtube.com/watch?v=2hKSyopwNFQ", "urlToImage": null, "publishedAt": "2020-04-25T15:00:02Z", "content": "Take a look back at Nicolas Anelka's prolific 2008/09 season where he secured the Golden Boot, beating Manchester United's Cristiano Ronaldo by 1 goal.\r\nDownload Chelsea FC's official mobile app:-App Store https://apple.co/2vvlN9t-Play Store http://bit.ly/2Mf… [+839 chars]"}, {"source": {"id": null, "name": "Mmamania.com"}, "author": "Dan Hiergesell", "title": "UFC issues statement on COVID-19 health and safety precautions leading into May 9 event - MMA Mania", "description": "UFC releases statement on COVID-19 health and safety precautions leading into the promotion’s return on May 9 in Jacksonville, Florida.", "url": "https://www.mmamania.com/2020/4/25/21236011/ufc-releases-statement-on-covid-19-health-and-safety-precautions-ufc-249-ferguson-gaethje-mma-espn", "urlToImage": null, "publishedAt": "2020-04-25T14:57:47Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Scouting Report On Jets Day 2 Draft Picks: WR Denzel Mims, DB Ashtyn Davis, DE Jabari Zuniga - New York Jets", "description": "Jets personnel members talk about WR Denzel Mims, DB Ashtyn Davis and DE Jabari Zuniga and look ahead to Day 3 of the NFL Draft. Subscribe to the New York Je...", "url": "https://www.youtube.com/watch?v=W2wP9Szsbkw", "urlToImage": null, "publishedAt": "2020-04-25T14:48:29Z", "content": "Jets personnel members talk about WR Denzel Mims, DB Ashtyn Davis and DE Jabari Zuniga and look ahead to Day 3 of the NFL Draft.\r\nSubscribe to the New York Jets YT Channel: https://bit.ly/2KRtBJd"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Rickie Fowler's most aggressive shots on the PGA TOUR - PGA TOUR", "description": "Rickie Fowler isn't afraid of taking chances on the golf course, watch how some of his most agressive shots on the PGA TOUR paid off. SUBSCRIBE to PGA TOUR n...", "url": "https://www.youtube.com/watch?v=0ZvotPKSoEo", "urlToImage": null, "publishedAt": "2020-04-25T11:30:01Z", "content": "Rickie Fowler isn't afraid of taking chances on the golf course, watch how some of his most agressive shots on the PGA TOUR paid off.\r\nSUBSCRIBE to PGA TOUR now: http://pgat.us/vBxcZSh\r\nWelcome to the official YouTube channel of the PGA TOUR.Here you can find… [+849 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Jerry Jones, Mike McCarthy discuss the Cowboys' second and third-round draft picks - The Dallas Morning News", "description": "After Friday's NFL Draft, Dallas Cowboys coach Mike McCarthy and owner Jerry Jones hold a press conference regarding their second and third-round draft picks...", "url": "https://www.youtube.com/watch?v=9ArbBPWGnSQ", "urlToImage": null, "publishedAt": "2020-04-25T04:32:35Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Vikings select a PHYSICAL player in Cameron Dantzler with the 89th pick | 2020 NFL Draft - CBS Sports", "description": "With the 89th pick in the 2020 NFL Draft, the Minnesota Vikings select Cameron Dantzler, CB from Mississippi State. Our CBS Sports HQ crew breaks down the se...", "url": "https://www.youtube.com/watch?v=54K6rQbAsd4", "urlToImage": null, "publishedAt": "2020-04-25T04:17:28Z", "content": "With the 89th pick in the 2020 NFL Draft, the Minnesota Vikings select Cameron Dantzler, CB from Mississippi State.\r\nOur CBS Sports HQ crew breaks down the selection, providing a grade for the team and what potential impact Dantzler might have for the Vikings… [+252 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Raiders select Lynn Bowden Jr. & Bryan Edwards with the 80th and 81st pick | 2020 NFL Draft - CBS Sports", "description": "With the 80th pick in the 2020 NFL Draft, the Las Vegas Raiders select Lynn Bowden Jr., WR from Kentucky. And with the 81st pick select Bryan Edwards, WR fro...", "url": "https://www.youtube.com/watch?v=l6Zn5j5V3zg", "urlToImage": null, "publishedAt": "2020-04-25T03:33:21Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Will NHL hockey return this season? | HC@Home - SPORTSNET", "description": "David Amber is joined by Brendan Gallagher and Kevin Bieksa to discuss dad fights, TikTok videos & Dennis Rodman….. plus the state of league amid Covid-19. -...", "url": "https://www.youtube.com/watch?v=6YZpwdpKdec", "urlToImage": null, "publishedAt": "2020-04-25T02:50:15Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Patriots select an EXPLOSIVE Josh Uche with the 60th overall pick | 2020 NFL Draft - CBS Sports", "description": "With the 60th pick in the 2020 NFL Draft, the New England Patriots select Josh Uche, EDGE from Michigan. Our CBS Sports HQ crew breaks down the selection, pr...", "url": "https://www.youtube.com/watch?v=PKMAJM5Sexg", "urlToImage": null, "publishedAt": "2020-04-25T01:48:01Z", "content": "With the 60th pick in the 2020 NFL Draft, the New England Patriots select Josh Uche, EDGE from Michigan.\r\nOur CBS Sports HQ crew breaks down the selection, providing a grade for the team and what potential impact Uche might have for the Patriots.\r\nSUBSCRIBE T… [+199 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Buccaneers select a HIGHLY SKILLED Antoine Winfield Jr. with the 45th pick | 2020 NFL Draft - CBS Sports", "description": "With the 45th pick in the 2020 NFL Draft, the Tampa Bay Buccaneers select Antoine WInfield Jr., S from Minnesota. Our CBS Sports HQ crew breaks down the sele...", "url": "https://www.youtube.com/watch?v=SkLs_JcBIYI", "urlToImage": null, "publishedAt": "2020-04-25T00:51:33Z", "content": "With the 45th pick in the 2020 NFL Draft, the Tampa Bay Buccaneers select Antoine WInfield Jr., S from Minnesota.\r\nOur CBS Sports HQ crew breaks down the selection, providing a grade for the team and what potential impact Winfield Jr. might have for the Bucca… [+262 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "1st Rd. Picks React to Being Drafted: Burrow, Tua, Love & More - NFL Media Originals", "description": "Subscribe to NFL Network: http://goo.gl/4GOLwY Check out our other channels: NFL Vault http://youtube.com/nflvault NFL Films http://www.youtube.com/nflfilms ...", "url": "https://www.youtube.com/watch?v=WP75lJS9P_c", "urlToImage": null, "publishedAt": "2020-04-24T18:15:55Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NFL Draft 2020: Bruce Arians, Bucs get protection for Tom Brady (FULL INTERVIEW) | NBC Sports - NBC Sports", "description": "Buccaneers head coach Bruce Arians joins Mike Tirico to discuss his team's decision on drafting Tristian Wirfs and what it means with the additions of Tom Br...", "url": "https://www.youtube.com/watch?v=Ni9fbdLtEnY", "urlToImage": null, "publishedAt": "2020-04-24T18:15:36Z", "content": null}, {"source": {"id": null, "name": "Dodgerblue.com"}, "author": "Daniel Starkand", "title": "Former Dodgers Outfielder Andre Ethier: Red Sox Investigation ‘Typical Rob Manfred Story’ - DodgerBlue.com", "description": "Former Los Angeles Dodgers outfielder Andre Ethier was hypercritical of the Boston Red Sox's sign-stealing scandal and MLB commissioner Rob Manfred.", "url": "https://dodgerblue.com/former-dodgers-outfielder-andre-ethier-red-sox-investigation-typical-rob-manfred-story/2020/04/24/", "urlToImage": null, "publishedAt": "2020-04-24T17:43:12Z", "content": "Major League Baseball recently concluded its investigation into the Boston Red Sox for potential sign-stealing during their 2018 World Series run, and like the Houston Astros the year before, they were found guilty as misconduct.\r\nThe Red Sox’s cheating was d… [+3375 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Dak Prescott's Brother, Jace, Dead At 31 - TMZ", "description": "Tragic news for the Dallas Cowboys QB and his family.", "url": "https://www.tmz.com/2020/04/24/nfls-dak-prescott-s-brother-dead-at-31-cause-of-death-unknown/", "urlToImage": null, "publishedAt": "2020-04-24T17:23:20Z", "content": "Tragic news for Dak Prescottand his family ... the quarterback's older brother, Jace Prescott, died suddenly at 31 years old on Thursday, the Dallas Cowboys announced.\r\nNo cause of death was given.\r\nDak had been super close with Jace, the oldest of the Presco… [+1131 chars]"}]}