{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Un.org"}, "author": null, "title": "Millions more children at risk with immunization services disrupted amid COVID-19 pandemic - UN News", "description": "Last year, over 13 million children received no vaccines at all, and the UN Children’s Fund (UNICEF) is calling on governments to step up, warning disrupting immunization services amid the COVID-19 pandemic could leave even more of the world’s most marginaliz…", "url": "https://news.un.org/en/story/2020/04/1062622", "urlToImage": null, "publishedAt": "2020-04-26T11:40:07Z", "content": "Making its call at the start of the 2020 edition of World Immunization Week, UNICEF said on Saturday that millions of children are in danger of missing life-saving vaccines against measles, diphtheria and polio due to disruptions in immunization service as th… [+3030 chars]"}, {"source": {"id": null, "name": "Ntnews.com.au"}, "author": "NATASHA EMECK", "title": "Patient mistook coronavirus for a hangover - Queensland Times", "description": "ONE of the city's first coronavirus patients says his symptoms were so mild at first that he mistook them for a hangover after a boozy night out on holiday.", "url": "https://www.ntnews.com.au/news/northern-territory/darwin-patient-says-he-mistook-coronavirus-for-a-hangover/news-story/72d6e9987cf324d159913167ceb4af12", "urlToImage": null, "publishedAt": "2020-04-26T09:51:00Z", "content": "ONE of Darwin's first coronavirus patients says his symptoms were so mild at first that he mistook them for a hangover after a boozy night out on holiday.\r\nThe man in his mid-30s, who did not wish to be named for privacy reasons, has told the NT News about hi… [+1476 chars]"}, {"source": {"id": null, "name": "Theconversation.com"}, "author": "Asha Bowen, Christopher Blyth, Kirsty Short", "title": "5 reasons it's safe for kids to go back to school - The Conversation AU", "description": "More evidence has come in and confirmed what the government has been saying for some time. Children do get infected much less than adults with COVID-19 and when they do, they hardly spread it.", "url": "https://theconversation.com/5-reasons-its-safe-for-kids-to-go-back-to-school-137064", "urlToImage": null, "publishedAt": "2020-04-26T09:02:00Z", "content": "In mid March, cases of COVID-19 the disease caused by SARS-CoV-2 dramatically increased in Australia and the government responded with an effective public health strategy. People who could, shifted to working from home, social distancing measures were applied… [+5782 chars]"}, {"source": {"id": null, "name": "Northweststar.com.au"}, "author": "Carly Waters and Benita Kolovos", "title": "No plans to relax rules, open Vic schools - The North West Star", "description": "Victoria will not follow in the footsteps of other states in easing some social distancing measures, despite a steady decline in the number of new COVID-19 ca...", "url": "https://www.northweststar.com.au/story/6735329/no-plans-to-relax-rules-open-vic-schools/?cs=9397", "urlToImage": null, "publishedAt": "2020-04-26T08:50:31Z", "content": ""}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Brittany Chain Lauren Ferri For Daily Mail Australia", "title": "Ten workers at Nepean and Sydney Adventist Hospitals quarantined after doctor caught coronavirus - Daily Mail", "description": "On Sunday, Nepean Blue Mountains Local Health District confirmed a female doctor from Nepean Hospital, at the base of the Blue Mountains in Sydney's west, tested positive for coronavirus.", "url": "https://www.dailymail.co.uk/news/article-8258071/Ten-workers-Nepean-Sydney-Adventist-Hospitals-quarantined-doctor-caught-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-26T08:42:33Z", "content": "Ten healthcare workers across two hospitals will spend the next 14 days in self-isolation after another employee tested positive to coronavirus.\r\nOn Sunday morning, Nepean Blue Mountains Local Health District confirmed a female doctor from Nepean Hospital, at… [+4220 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Alex Turner-Cohen", "title": "Coronavirus: Six-month-old baby from Manchester beats COVID-19, parents overjoyed - NEWS.com.au", "description": "Coronavirus: Six-month-old baby from Manchester beats COVID-19, parents overjoyed", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-sixmonthold-baby-from-manchester-beats-covid19-parents-overjoyed/news-story/dd23c0c28d8689c2497724fdb6291258", "urlToImage": null, "publishedAt": "2020-04-26T08:31:08Z", "content": "Already severely underweight and with other medical complications, doctors thought this six-month-old baby was done for when she contracted COVID-19. But Erin Bates pulled through and has become a symbol of hope for others.\r\nThe baby from Manchester, England,… [+3668 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Women face anxiety over pregnancy and birth in US - TRT World", "description": "For many women, being pregnant comes with its own set of fears and anxiety. But being pregnant during the Covid-19 pandemic takes those fears to a whole new ...", "url": "https://www.youtube.com/watch?v=gagwijdvCR0", "urlToImage": null, "publishedAt": "2020-04-26T08:10:16Z", "content": null}, {"source": {"id": null, "name": "Bunburymail.com.au"}, "author": null, "title": "SA hospital numbers down amid COVID-19 - Bunbury Mail", "description": "South Australia has recorded no new cases of coronavirus for the fourth consecutive day, as the state government urged people with other serious medical issue...", "url": "https://www.bunburymail.com.au/story/6735327/sa-hospital-numbers-down-amid-covid-19/", "urlToImage": null, "publishedAt": "2020-04-26T06:57:20Z", "content": "South Australia has recorded no new cases of coronavirus for the fourth consecutive day, as the state government urged people with other serious medical issues to not let the pandemic stop them seeking help.\r\nThe state has confirmed a total of 438 cases, but … [+1837 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Virus: Latest developments in the COVID-19 pandemic, 26 April | ABC News - ABC News (Australia)", "description": "Jeremy Fernandez takes you through the key developments in Australia's battle against the spread of coronavirus. In this epsiode, we look at the first human ...", "url": "https://www.youtube.com/watch?v=N446G4fqPuA", "urlToImage": null, "publishedAt": "2020-04-26T06:41:34Z", "content": null}, {"source": {"id": null, "name": "Theguardian.comuk-news"}, "author": "Jamie Doward", "title": "If ministers fail to reveal 2016 flu study they ‘will face court’ - The Guardian", "description": "Doctor’s threat over results of three-day simulation exercise that were ‘too terrifying’ to be made public", "url": "https://amp.theguardian.comuk-news/2020/apr/26/doctor-sue-results-operation-cygnus", "urlToImage": null, "publishedAt": "2020-04-26T06:24:41Z", "content": "The government faces being taken to court if it refuses to disclose the findings of an exercise confirming the UK could not cope with a flu pandemic.\r\nDr Moosa Qureshi, an NHS doctor, is demanding the government publish its report into Exercise Cygnus, a thre… [+2395 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Too early to issue 'immunity passports' - Sky News Australia", "description": "Australia’s chief medical officer says he is in agreement with the United Nations, which warned there is no scientific basis for awarding an “immunity passpo...", "url": "https://www.youtube.com/watch?v=iAF5duYNIcs", "urlToImage": null, "publishedAt": "2020-04-26T06:07:09Z", "content": null}, {"source": {"id": null, "name": "Wellingtontimes.com.au"}, "author": null, "title": "School return plan reinforced by NSW study - Wellington Times", "description": "There is no evidence students at NSW schools have infected staff with COVID-19, according to a study cited by the federal government in its push to reopen sch...", "url": "https://www.wellingtontimes.com.au/story/6735338/school-return-plan-reinforced-by-nsw-study/?cs=9397", "urlToImage": null, "publishedAt": "2020-04-26T04:45:18Z", "content": "There is no evidence students at NSW schools have infected staff with COVID-19, according to a study cited by the federal government in its push to reopen schools.\r\nThe National Centre for Immunisation Research and Surveillance probe looked at all 18 cases of… [+2384 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Entrepreneurs are 'focussed' on securing a COVID-19 vaccine - Sky News Australia", "description": "The ability “to make money and do good” is driving many entrepreneurs and venture capitalists to invest in projects designed to find a COVID-19 vaccine, acco...", "url": "https://www.youtube.com/watch?v=yIZbwEOxPxc", "urlToImage": null, "publishedAt": "2020-04-26T04:30:38Z", "content": null}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Jamie Seidel", "title": "PLAN C: Our last hope if virus vaccine comes to nothing - Ballina Shire Advocate", "description": "Coronavirus vaccines and treatment are in development, but what is the world’s Plan C?", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-vaccines-and-treatment-are-in-development-but-what-is-the-worlds-plan-c/news-story/082aa3bdda2ee957d532ec1e4605726c", "urlToImage": null, "publishedAt": "2020-04-26T04:26:00Z", "content": "Will a vaccine save us from COVID-19? What about new treatments for its symptoms?Indications are, we may have to find a Plan C.Billions of people are confined to our homes. We can’t go to the beach. The office. Or school. It’s the bluntest possible response t… [+8397 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "Coronavirus: Surprising benefit of COVID-19 lockdown restrictions - NEWS.com.au", "description": "Coronavirus: Surprising benefit of COVID-19 lockdown restrictions", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-surprising-benefit-of-covid19-lockdown-restrictions/news-story/b4a2b33b821b6e335072c84352a06242", "urlToImage": null, "publishedAt": "2020-04-26T03:10:03Z", "content": "The rate of Australians getting infected by contagious diseases has plummeted following social distancing restrictions.The transmission rate of influenza, chickenpox, measles and other communicable diseases have fallen since Australia’s COVID-19 restrictions … [+4194 chars]"}, {"source": {"id": null, "name": "Seymourtelegraph.com.au"}, "author": null, "title": "US business, beaches, start reopening - Seymour Telegraph", "description": "", "url": "https://www.seymourtelegraph.com.au/world/2020/04/26/1145571/us-business-beaches-start-reopening", "urlToImage": null, "publishedAt": "2020-04-26T02:36:00Z", "content": "As new coronavirus cases hit a record high in the United States and deaths topped 200,000 worldwide, many Americans flocked to beaches as one Florida county expanded access and California experienced a heat wave.Hair salons and other shops in Oklahoma and som… [+3026 chars]"}, {"source": {"id": null, "name": "Malaymail.com"}, "author": "Malay Mail", "title": "Mothering with a mask: Belgian with Covid-19 gives birth to healthy baby - Malay Mail", "description": "BRUSSELS, April 26 — A pregnant Belgian woman diagnosed with the coronavirus has given birth to a healthy baby daughter — but must now learn to care for her newborn wearing, and sleeping with, a protective mask. Baby Mahaut was born on April 23 in Brussels by…", "url": "https://www.malaymail.com/news/life/2020/04/26/mothering-with-a-mask-belgian-with-covid-19-gives-birth-to-healthy-baby/1860284", "urlToImage": null, "publishedAt": "2020-04-26T01:55:00Z", "content": "Amandine, who tested positive for Covid-19 just before giving birth, wears a protective face mask while holding her newborn daughter Mahaut at CHIREC Delta Hospital in Brussels, Belgium April 25, 2020. Reuters pic\r\nBRUSSELS, April 26 A pregnant Belgian woman … [+1792 chars]"}, {"source": {"id": null, "name": "Dailyadvertiser.com.au"}, "author": "Jessica McLaughlin", "title": "Wagga coronavirus: one new COVID-19 cases recorded in Murrumbidgee Local Health District - The Border Mail", "description": "This brings the total of positive cases to 46 for the MLDH.", "url": "https://www.dailyadvertiser.com.au/story/6735353/coronavirus-strikes-again-in-wagga-with-new-confirmed-case/?cs=17267", "urlToImage": null, "publishedAt": "2020-04-26T01:41:00Z", "content": ""}, {"source": {"id": null, "name": "Illawarramercury.com.au"}, "author": "Carly Waters and Benita Kolovos", "title": "One new COVID-19 death in Victoria - Illawarra Mercury", "description": "Victoria will not follow in the footsteps of other states in easing some social distancing measures, despite a steady decline in the number of new COVID-19 ca...", "url": "https://www.illawarramercury.com.au/story/6735329/no-plans-to-relax-rules-open-vic-schools/?cs=7", "urlToImage": null, "publishedAt": "2020-04-26T01:39:20Z", "content": ""}, {"source": {"id": null, "name": "Bluemountainsgazette.com.au"}, "author": "Colin Brinsden", "title": "Virus tracing app only for health use: PM - Blue Mountains Gazette", "description": "Doctors, nurses, business and bankers have been quick to back the Morrison government's COVID-19 tracer app, which aims to help health officials identify peop...", "url": "https://www.bluemountainsgazette.com.au/story/6735355/covidsafe-app-to-help-get-back-to-normal/?cs=9397", "urlToImage": null, "publishedAt": "2020-04-26T01:18:17Z", "content": "Doctors, nurses, business and bankers have been quick to back the Morrison government's COVID-19 tracer app, which aims to help health officials identify people who may have come into contact with someone with the disease.\r\nCalled COVIDSafe, the voluntary app… [+3371 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Health Officials Discuss Immunity to Coronavirus - WAAY-TV 31 News", "description": "More Data is Needed to Know if Someone is Immune to Coronavirus After Recovering From It", "url": "https://www.youtube.com/watch?v=Ekj7wGtD5B0", "urlToImage": null, "publishedAt": "2020-04-25T23:39:56Z", "content": null}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: The father of 13 self isolating with Covid-19 - BBC News", "description": "The Hann family have found lockdown a struggle but say they feel \"privileged\" as they pull together.", "url": "https://www.bbc.com/news/uk-scotland-tayside-central-52426962", "urlToImage": null, "publishedAt": "2020-04-25T23:05:02Z", "content": "Image copyrightLesley MartinImage caption\r\n The father of one of Scotland's largest families - Roy Hann - has tested positive for Covid-19\r\nWhen lockdown measures were first announced, Roy and Emma Hann gave their children strict routines and organised family… [+3801 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus Update: FDNY, Mayor Bill De Blasio Salute Brooklyn Hospital Workers - CBS New York", "description": "Some of New York's bravest joined Mayor Bill de Blasio outside Kings County Hospital in Brooklyn on Friday night to pay tribute to health care workers who ar...", "url": "https://www.youtube.com/watch?v=7cqFZknVr44", "urlToImage": null, "publishedAt": "2020-04-25T22:36:40Z", "content": null}, {"source": {"id": null, "name": "Skynews.com.au"}, "author": null, "title": "Health worker tests positive triggering fears of a new COVID-19 cluster in NSW - Sky News Australia", "description": "There are are fears a new cluster could develop West of Sydney after a worker at an aged care home tested positive for the coronavirus.\n\nUp to 100 elderly residents in addition to staff are now at risk of contracting potentially deadly disease. \n\nIt has been …", "url": "https://www.skynews.com.au/details/_6152046790001", "urlToImage": null, "publishedAt": "2020-04-25T22:36:23Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "UK doctor invents digital flashcards to help Covid-19 patients understand staff - The Guardian", "description": "Cardmedic overcomes communication barrier caused by healthcare staff wearing PPE", "url": "https://www.theguardian.com/world/2020/apr/25/uk-doctor-invents-digital-flashcards-to-help-covid-19-patients-understand-staff", "urlToImage": null, "publishedAt": "2020-04-25T21:50:36Z", "content": "A coronavirus patients terrifying hospital experience inspired an NHS doctor to create a flashcard system to improve communication with medical staff wearing face masks.\r\nAnaesthetist Rachael Grimaldi founded Cardmedic while on maternity leave after reading a… [+2712 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "'No evidence' people with coronavirus are immunised: WHO - SBS News", "description": "While the global death toll of coronavirus passes 200,000, the World Health Organization warns there is no evidence of immunity to the disease.", "url": "https://www.sbs.com.au/news/no-evidence-people-with-coronavirus-are-immunised-says-who", "urlToImage": null, "publishedAt": "2020-04-25T21:37:23Z", "content": "The World Health Organization has warned that recovering from coronavirus might not protect people from reinfection as the death toll from the pandemic passed 200,000 around the globe.\r\nGovernments are struggling to limit the economic devastation unleashed by… [+7190 chars]"}, {"source": {"id": null, "name": "Keyc.tv"}, "author": null, "title": "WHO says you Will Grab coronavirus over Formerly, warns against Thought of'Resistance passports' | - KEYC TV", "description": "Catching Covid-19 once might not protect you from accessing it, according to the World Health Organization.", "url": "http://www.keyc.tv/who-says-you-will-grab-coronavirus-over-formerly-warns-against-thought-ofresistance-passports/", "urlToImage": null, "publishedAt": "2020-04-25T21:30:17Z", "content": "Catching Covid-19 once might not protect you from accessing it, according to the World Health Organization.\r\n“There is now no evidence that those who’ve recovered from Covid-19 and also have antibodies are protected by another disease,” the United Nations age… [+661 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Mehr Gill", "title": "Explained: Types of human coronaviruses and the symptoms they cause - The Indian Express", "description": "While there are hundreds of coronaviruses, there are seven that we know can infect humans.", "url": "https://indianexpress.com/article/explained/types-of-human-coronaviruses-and-symptoms-6368444/", "urlToImage": null, "publishedAt": "2020-04-25T19:50:19Z", "content": "Written by Mehr Gill\r\n | New Delhi | \r\nUpdated: April 25, 2020 6:09:09 pm\r\nHuman coronaviruses were first characterised in the mid-1960s and they are mostly considered to be responsible for causing upper respiratory tract infections in children. (AP illustrat… [+6888 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "WHO says no evidence shows that having coronavirus prevents a second infection - KUGN", "description": "The World Health Organization is warning that people who have had Covid-19 are not necessarily immune by the presence of antibodies from getting the virus again.\"There is no evidence yet that people who have had Covid-19 will not get a second infection,\" WHO …", "url": "https://www.cnn.com/2020/04/25/us/who-immunity-antibodies-covid-19/index.html", "urlToImage": null, "publishedAt": "2020-04-25T19:25:18Z", "content": "The World Health Organization is warning that people who have had Covid-19 are not necessarily immune by the presence of antibodies from getting the virus again.\r\n“There is no evidence yet that people who have had Covid-19 will not get a second infection,” WH… [+1796 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "'No evidence' that recovered COVID-19 patients cannot be reinfected: WHO - Reuters", "description": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.", "url": "https://www.reuters.com/article/us-health-coronavirus-who-idUSKCN2270FB", "urlToImage": null, "publishedAt": "2020-04-25T19:16:55Z", "content": "GENEVA (Reuters) - The World Health Organization (WHO) said on Saturday that there was currently “no evidence” that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection. \r\nIn a scientific brief, the Uni… [+1753 chars]"}, {"source": {"id": null, "name": "Illawarramercury.com.au"}, "author": null, "title": "Global coronavirus death toll hits 200000 - Illawarra Mercury", "description": "As the global death toll from the coronavirus surpassed 200,000 on Saturday, countries took cautious steps toward easing lockdowns imposed amid the pandemic,...", "url": "https://www.illawarramercury.com.au/story/6735340/global-coronavirus-death-toll-hits-200000/?cs=298", "urlToImage": null, "publishedAt": "2020-04-25T19:09:56Z", "content": ""}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ariana Eunjung Cha", "title": "Spike in stroke deaths in patients with only minor coronavirus symptoms - The Independent", "description": "Reports of strokes in the young and middle-aged are the latest twist in our evolving understanding of the mysteries of the virus, finds Ariana Eunjung Cha", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-stroke-deaths-symptoms-covid-19-heart-a9484091.html", "urlToImage": null, "publishedAt": "2020-04-25T18:45:03Z", "content": "Thomas Oxley wasnt even on call the day he received the page to come into Mount Sinai Beth Israel Hospital in Manhattan. There werent enough doctors to treat all the emergency stroke patients, and he was needed in the operating room.\r\nThe patients chart appea… [+9849 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "2 cell types are entry points for virus - Hindustan Times", "description": "The respiratory tract is filled with numerous cells, among which are goblet cells and ciliated cells.", "url": "https://www.hindustantimes.com/india-news/2-cell-types-are-entry-points-for-virus/story-VZ250MIqdc4r0OIzxsTqPJ.html", "urlToImage": null, "publishedAt": "2020-04-25T17:54:31Z", "content": "Scientists have identified two types of cells in the nose that are likely to be point of infection for the Sars-CoV-2 virus, which causes Covid-19, in the body.\r\nThe respiratory tract is filled with numerous cells, among which are goblet cells and ciliated ce… [+2449 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Coronavirus: People with COVID-19 symptoms more than double number who tested positive, app shows - Sky News", "description": "The COVID symptom tracker has been downloaded by nearly 2.7 million people and is generating an \"unprecedented\" amount of data.", "url": "https://news.sky.com/story/coronavirus-people-with-covid-19-symptoms-more-than-double-number-who-tested-positive-app-shows-11978714", "urlToImage": null, "publishedAt": "2020-04-25T17:48:45Z", "content": null}, {"source": {"id": null, "name": "Bombalatimes.com.au"}, "author": "Carly Waters and Benita Kolovos", "title": "Victoria elective surgeries set to return - Bombala Times", "description": "Victoria will not follow in the footsteps of other states in easing some social distancing measures, despite a steady decline in the number of new COVID-19 ca...", "url": "https://www.bombalatimes.com.au/story/6735329/no-plans-to-relax-rules-open-vic-schools/?cs=7", "urlToImage": null, "publishedAt": "2020-04-25T17:30:42Z", "content": "Victoria will not follow in the footsteps of other states in easing some social distancing measures, despite a steady decline in the number of new COVID-19 cases.\r\nHealth Minister Jenny Mikakos confirmed the state recorded one death and three new coronavirus … [+2910 chars]"}, {"source": {"id": null, "name": "Theleader.com.au"}, "author": null, "title": "Contact checks on WA's latest virus case | St George & Sutherland Shire Leader | St George, NSW - St George and Sutherland Shire Leader", "description": "Western Australia will relax its coronavirus restrictions to allow up to 10 people to gather for non-work activities, as the state recorded another day of no...", "url": "https://www.theleader.com.au/story/6735328/wa-cautiously-relaxes-virus-restrictions/?cs=9397&utm_campaign=sidebar&utm_medium=index&utm_source=website", "urlToImage": null, "publishedAt": "2020-04-25T17:30:39Z", "content": "Western Australia will relax its coronavirus restrictions to allow up to 10 people to gather for non-work activities, as the state recorded another day of no new COVID-19 cases.\r\nPremier Mark McGowan said it was a \"cautious relaxation\" of restrictions, acknow… [+1570 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "DOH: More than 72000 lab tests conducted for COVID-19 in PH - INQUIRER.net", "description": "More than 72,000 laboratory tests were conducted for checking novel coronavirus or SARS-CoV-2, which causes COVID-19, in the country, the Department of Healt...", "url": "https://www.youtube.com/watch?v=fB_ScQAcFZs", "urlToImage": null, "publishedAt": "2020-04-25T11:58:23Z", "content": null}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "The Irish Times", "title": "WHO warns against idea of coronavirus ‘immunity passports’ - The Irish Times", "description": "Health agency warns governments against issuing ‘immunity passports’", "url": "https://www.irishtimes.com/news/world/coronavirus-no-evidence-that-recovered-patients-are-immune-says-who-1.4238216", "urlToImage": null, "publishedAt": "2020-04-25T11:23:08Z", "content": "The World Health Organisation (WHO) said on Saturday that there was currently no evidence that people who have recovered from coronavirus and have antibodies are protected from a second coronavirus infection.\r\nIn a scientific brief, the United Nations agency … [+1685 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: Another Sydney nursing home COVID-19 outbreak | Nine News Australia - 9 News Australia", "description": "A nursing home in Sydney’s Blue Mountains has become the latest COVID-19 nursing home outbreak, with a worker testing positive. Subscribe: https://bit.ly/2no...", "url": "https://www.youtube.com/watch?v=fd2C2IfdUbA", "urlToImage": null, "publishedAt": "2020-04-25T10:07:00Z", "content": "A nursing home in Sydneys Blue Mountains has become the latest COVID-19 nursing home outbreak, with a worker testing positive. Subscribe: https://bit.ly/2noaGhv Get more breaking news at: https://bit.ly/2nobVgF\r\nJoin Nine News for the latest in news and event… [+320 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Baby makes 'miracle' recovery to beat virus - CQ News", "description": "Doctors held grave fears for this six-month old-baby when she contracted COVID-19, but she pulled through against all odds and has become a symbol of hope.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-sixmonthold-baby-from-manchester-beats-covid19-parents-overjoyed/news-story/dd23c0c28d8689c2497724fdb6291258", "urlToImage": null, "publishedAt": "2020-04-25T09:49:00Z", "content": "Already severely underweight and with other medical complications, doctors thought this six-month-old baby was done for when she contracted COVID-19.\r\nBut Erin Bates pulled through and has become a symbol of hope for others.\r\nThe baby from Manchester, England… [+3615 chars]"}, {"source": {"id": null, "name": "Wellingtontimes.com.au"}, "author": "Gus McCubbing", "title": "Blue Mtns health worker positive for virus - Wellington Times", "description": "An 83-year-old man has died from COVID-19 at an aged care facility in western Sydney, taking the state's virus toll to 36. The man was a resident at Anglicare...", "url": "https://www.wellingtontimes.com.au/story/6734966/sixth-virus-death-at-nsw-age-care-facility/?cs=9397", "urlToImage": null, "publishedAt": "2020-04-25T09:27:18Z", "content": "An 83-year-old man has died from COVID-19 at an aged care facility in western Sydney, taking the state's virus toll to 36.\r\nThe man was a resident at Anglicare Newmarch House in Cadden and is the sixth death at the facility.\r\nThe facility is the state's large… [+2026 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": null, "title": "Coronavirus: WHO warns against idea of Covid-19 'immunity passports' - Stuff.co.nz", "description": "There is no evidence that people who have recovered from Covid-19 and have antibodies are protected against a second infection.", "url": "https://i.stuff.co.nz/national/health/coronavirus/121100571/coronavirus-who-warns-against-idea-of-covid19-immunity-passports", "urlToImage": null, "publishedAt": "2020-04-25T09:08:00Z", "content": "The World Health Organisation is cautioning against the idea of \"immunity passports.\" It says there is currently no evidence that people who have recovered from Covid-19 and have antibodies are protected against a second infection.\r\n The concept of \"immunity … [+1018 chars]"}, {"source": {"id": null, "name": "Abs-cbn.com"}, "author": "Daniel Bosque, Agence France-Presse", "title": "Why has Spain been hit so hard by the coronavirus pandemic? - ABS-CBN News", "description": "In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told AFP.", "url": "https://news.abs-cbn.com/overseas/04/25/20/why-has-spain-been-hit-so-hard-by-the-coronavirus-pandemic", "urlToImage": null, "publishedAt": "2020-04-25T08:51:00Z", "content": "In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told AFP.\r\nWhile they stressed it was too early to carry out a detailed analysis, the experts p… [+4414 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Dave Lee", "title": "Craft site Etsy sews up share bounce with homemade masks - Financial Times", "description": "News, analysis and comment from the Financial Times, the worldʼs leading global business publication", "url": "https://www.ft.com/content/075c1d10-29e4-4a52-ad67-16d3825705c8", "urlToImage": null, "publishedAt": "2020-04-25T08:43:44Z", "content": "Keep abreast of significant corporate, financial and political developments around the world.\r\nStay informed and spot emerging risks and opportunities with independent global reporting, expert\r\ncommentary and analysis you can trust."}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "France to trial nicotine patches to prevent COVID-19 - Big Rigs", "description": "Despite repeated warnings that smokers have a higher risk of severe cases one European country is hoping to trial nicotine patches on healthcare workers.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-france-to-trial-nicotine-patches-to-prevent-covid19/news-story/616d8f570780c5eba4d76b34ba015c7e", "urlToImage": null, "publishedAt": "2020-04-25T07:40:37Z", "content": "France is hoping to trial nicotine patches on healthcare workers after a study suggested that smokers may have a lesser chance of catching coronavirus.\r\nThe surprising findings come despite health officials around the world repeatedly warning that smokers who… [+2894 chars]"}, {"source": {"id": null, "name": "Newcastleherald.com.au"}, "author": "Karen Sweeney and Andi Yu", "title": "Three new COVID-19 cases in Victoria - Newcastle Herald", "description": "The stark contrast between the slow spread of coronavirus in Victoria and the pandemic internationally makes the state the \"envy of the world\". Deputy chief h...", "url": "https://www.newcastleherald.com.au/story/6734968/vic-cases-enviable-but-virus-is-not-over/", "urlToImage": null, "publishedAt": "2020-04-25T03:58:19Z", "content": ""}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": "Jane Hansen", "title": "Risky business: 100 jobs most at risk of COVID-19 - Observer", "description": "They are the 100 occupations most at risk of contracting COVID-19. And while some are obvious given their exposure to people, others far less so.", "url": "https://www.dailytelegraph.com.au/coronavirus/dentists-doctors-registered-nurses-most-at-risk-of-catching-covid19/news-story/880ffd1dc28abcf3c5b26fe6e16d773f", "urlToImage": null, "publishedAt": "2020-04-25T03:18:00Z", "content": "While doctors and nurses are the heroes on the front line, risking greater exposure to coronavirus, many other occupations also have risk and analysts have crunched the data into an occupation risk score.\r\nThe US-based Occupation Information Network has found… [+4558 chars]"}, {"source": {"id": null, "name": "Kidspot.com.au"}, "author": "Vanessa Stubbs", "title": "Nurses in tears as baby wins her coronavirus fight - Kidspot", "description": "Little Erin Bates has become a symbol of hope.", "url": "https://www.kidspot.com.au/news/nurses-in-tears-as-baby-wins-her-coronavirus-fight/news-story/7a317269d080a6ff81536cc368444940", "urlToImage": null, "publishedAt": "2020-04-25T03:07:00Z", "content": "Little Erin Bates has become a symbol of hope.Nurses formed a guard of honour and clapped as six-month-old baby Erin was wheeled out of isolation.\r\nThe baby girl was being treated at Alder Hey Children's Hospital in Liverpool in the UK, where she battled COVI… [+1996 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "G Thing: Pet fashion designer finds unique ways to give back to animal rescue crews - PIX11 News", "description": "She's one of the most in demand New York fashion designers for dog and cats.", "url": "https://www.youtube.com/watch?v=WcRkfwYZcdU", "urlToImage": null, "publishedAt": "2020-04-25T03:02:18Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": null, "title": "Dentists, doctors, registered nurses most at risk of catching COVID-19 - Daily Telegraph", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.dailytelegraph.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T03:00:00Z", "content": null}, {"source": {"id": null, "name": "Centralwesterndaily.com.au"}, "author": null, "title": "One active coronavirus case remains in Orange, no new cases reported - Central Western Daily", "description": "\"The best thing everyone can do at this point is to stay at home unless it is absolutely essential.\"", "url": "https://www.centralwesterndaily.com.au/story/6735131/one-coronavirus-case-still-active-in-orange-no-new-cases-reported/", "urlToImage": null, "publishedAt": "2020-04-25T02:55:00Z", "content": ""}, {"source": {"id": null, "name": "Gympietimes.com.au"}, "author": "", "title": "COVID-19 kills in 'brain to toe rampage' - Gympie Times", "description": "Medical experts have described how coronavirus kills its victims in “a ferocious rampage through the body, from brain to toes”.", "url": "https://www.gympietimes.com.au/news/covid-19-kills-in-brain-to-toe-rampage/4002606/", "urlToImage": null, "publishedAt": "2020-04-25T02:38:20Z", "content": "COVID-19 kills \"in a ferocious rampage through the body from brain to toes\" doctors have explained, saying the virus \"acts like no pathogen humanity has ever seen\".\r\nIn an article in sciencemag.org, frontline clinicians caring for the five per cent who become… [+7313 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Baked beans an unlikely nutrition star, and pandemic hit - Health - ABC News", "description": "While baked beans might not look particularly sexy, they're a favourite among nutrition experts. Here's why.", "url": "https://www.abc.net.au/news/health/2020-04-25/baked-beans-an-unlikely-nutrition-star/12176974", "urlToImage": null, "publishedAt": "2020-04-25T00:17:11Z", "content": "As we all fight our inner \"prepper\" and try not to succumb to panic buying, it seems many of us have turned to an old favourite: baked beans.\r\nBean production at Australia's largest fruit and vegetable cannery in Shepparton, Victoria, has doubled its usual vo… [+5001 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Plea for public to get medical care when they need it - BBC News", "description": "People needing help should not be put off by the coronavirus pandemic, say health professionals.", "url": "https://www.bbc.com/news/health-52417599", "urlToImage": null, "publishedAt": "2020-04-25T00:12:51Z", "content": "Image copyrightAFP/Oli Scarff via Getty Images\r\nPeople should seek medical care when they need it and not be put off by the coronavirus epidemic, say doctors, charities and the health service.\r\nAnyone who delays seeking treatment is putting their long-term he… [+5447 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Kate Kelland and Manas Mishra", "title": "Could warm weather help contain pandemic? - Gold Coast Bulletin", "description": "As the seasons change in the northern and southern hemispheres, questions are being asked about the influence of weather in the spread of coronavirus, which has killed more than 190,000 people and sent the global economy into a tailspin.", "url": "https://www.news.com.au/world/breaking-news/could-warm-weather-help-contain-pandemic/news-story/3151c026d02efea4a5c503ede2417b8d", "urlToImage": null, "publishedAt": "2020-04-25T00:12:00Z", "content": "As the seasons change in the northern and southern hemispheres, questions are being asked about the influence of weather in the spread of coronavirus, which has killed more than 190,000 people and sent the global economy into a tailspin.\r\nHere's what we know … [+3623 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "Popsugar.com.au"}, "author": "Maggie Ryan", "title": "If We Get a Second Wave of Coronavirus, Here's When to Expect It — and How to Stay Safe - POPSUGAR Health and Fitness Australia", "description": "A second coronavirus outbreak is possible. If it comes, doctors say it will be more important than ever to social distance and follow other precautions.", "url": "https://www.popsugar.com.au/fitness/will-there-be-second-wave-coronavirus-47420049", "urlToImage": null, "publishedAt": "2020-04-24T22:43:05Z", "content": "The coronavirus pandemic continues, but parts of the US are already considering a return to some semblance of normalcy. That means that the issue of a \"second wave\" of coronavirus cases is one we're starting to hear a lot about. What's happening, explained St… [+3528 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Sydney doctor Edward O’Neill in UK coronavirus vaccine trial - 7NEWS.com.au", "description": "Edward O'Neill believes taking part in a UK coronavirus vaccine trial is the right thing to do but admits he's taking a \"walk in faith\".", "url": "https://7news.com.au/lifestyle/health-wellbeing/aussie-to-walk-in-faith-in-vaccine-trial-c-998463", "urlToImage": null, "publishedAt": "2020-04-24T21:49:15Z", "content": "An Australian man who is testing a potential coronavirus vaccine in the UK says he is taking a walk in faith.\r\nDr Edward ONeill was one of the first two people injected as part of trials for a potential vaccine that has been developed by Oxford University.\r\nT… [+1441 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Lateshia Beachum", "title": "Researchers found coronavirus in a patient’s eyes — days after it left her nose - The Washington Post", "description": "A new medical report shows contagious particles of coronavirus can be found in the eyes.", "url": "https://www.washingtonpost.com/health/2020/04/24/researchers-found-coronavirus-patients-eyes-days-after-it-left-her-nose/", "urlToImage": null, "publishedAt": "2020-04-24T20:49:43Z", "content": "The report demonstrates that the novel coronavirus can exist in an infected persons eye fluids at probable contagious levels, increasing the need for people to be cognizant about their hand hygiene and to keep their hands away from their face, experts say.\r\nT… [+3742 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Olivia Willis", "title": "When coronavirus patients suddenly decline, their own immune system might be to blame - ABC News", "description": "In some cases of COVID-19, it may be the body's response to the virus, rather than the virus itself, that ultimately causes harm.", "url": "https://www.abc.net.au/news/health/2020-04-25/coronavirus-covid-immune-response-causes-harm/12176872", "urlToImage": null, "publishedAt": "2020-04-24T20:30:29Z", "content": "It's been described as the \"second week crash\".\r\nAbout seven days after developing symptoms of COVID-19, some people even those with mild symptoms can suddenly start to deteriorate, often with little warning.\r\n\"They end up getting admitted to hospital, and ab… [+6217 chars]"}, {"source": {"id": null, "name": "9news.com.au"}, "author": "Associated Press", "title": "France braces for second wave of infections; EPA contradicts Trump disinfectant 'cure' suggestion - 9News", "description": "<p>France is preparing for a <a href=\"https://news-website-prev.ap-southeast-2.elasticbeanstalk.com/world/worst-ways-coronavirus-pandemic-has-been-handled/c7a84cfa-a169-4fb1-bff9-a574381543de\">second wave of virus cases</a>, Britain is reporting nearly 20,000…", "url": "https://www.9news.com.au/world/france-braces-for-coronavirus-second-wave/8c127830-54ed-4fc6-97f4-f26618ab4f4e", "urlToImage": null, "publishedAt": "2020-04-24T19:54:51Z", "content": "Property News: Creative ways people are staying connected during isolation - domain.com.au"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Ellie Cambridge", "title": "Coronavirus victim, 29, told fiancee ‘thank you for the best life’ in final moments before fatal coma - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11474318/coronavirus-victim-fiancee-thank-you-life-before-coma/", "urlToImage": null, "publishedAt": "2020-04-24T18:55:09Z", "content": "A CORONAVIRUS victim messaged his fiancee saying \"thank you for the best life\" before he was put into a coma and died.\r\nRichard McKeag, 29, sent the heartbreaking final message to Katie Martin, 25, after they spoke for the last time on Facetime.\r\n Richard McK… [+4731 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Nick Hopkins", "title": "Leaked Cabinet Office briefing on UK pandemic threat – the key points - The Guardian", "description": "From management of excess deaths to public outrage, 2019 document set out likely social and economic risks", "url": "https://www.theguardian.com/world/2020/apr/24/leaked-cabinet-office-briefing-on-uk-pandemic-threat-the-key-points", "urlToImage": null, "publishedAt": "2020-04-24T18:12:46Z", "content": "The 2019 National Security Risk Assessment (NSRA) is a comprehensive planning document that sets out the risks facing the UK and what is needed to prepare for them.\r\nIt was signed off by Sir Patrick Vallance, the governments chief scientific adviser. Over 600… [+8924 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Les Steed", "title": "How does key worker testing work and what time can I apply for a coronavirus test? - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11469520/key-worker-coronavirus-testing-how-what-time/", "urlToImage": null, "publishedAt": "2020-04-24T17:35:15Z", "content": "MATT HANCOCK announced that testing can now be provided for up to seven million key workers and emergency staff.\r\nHere's how to get tested if you are an essential worker who believes that you or a household member has coronavirus.\r\n Matt Hancock said key work… [+6641 chars]"}, {"source": {"id": null, "name": "Genengnews.com"}, "author": "John Sterling", "title": "Roundworm Study May Lead to New Therapies for Allergies and Asthma - Genetic Engineering & Biotechnology News", "description": "Researchers at the Center of Allergy and Environment (ZAUM) at the Technical University of Munich and Helmholtz Zentrum München have discovered an active ingredient taken from the larvae of a worm parasite can be used to suppress inflammatory reactions.", "url": "https://www.genengnews.com/news/roundworm-study-may-lead-to-new-therapies-for-allergies-and-asthma/", "urlToImage": null, "publishedAt": "2020-04-24T16:40:00Z", "content": "Scientists at the Center of Allergy and Environment (ZAUM) at Technical University of Munich and Helmholtz Zentrum München say they have succeeded in isolating, identifying, and analyzing a protein that the larvae of a roundworm (Heligmosomoides polygyrus) us… [+3798 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "'Sage did not advise a specific target' for Covid-19 testing, says Chris Whitty - The Telegraph", "description": "Chief Medical Officer, Chris Whitty, appears in front of the Science and Tech Committee to answer questions of Covid-19 testing Get the latest headlines: htt...", "url": "https://www.youtube.com/watch?v=TXaG8YVLm8U", "urlToImage": null, "publishedAt": "2020-04-24T16:35:21Z", "content": "Chief Medical Officer, Chris Whitty, appears in front of the Science and Tech Committee to answer questions of Covid-19 testing\r\nGet the latest headlines: https://www.telegraph.co.uk/\r\nTelegraph.co.uk and YouTube.com/TelegraphTV are websites of The Telegraph,… [+137 chars]"}, {"source": {"id": null, "name": "Northernstar.com.au"}, "author": "Marc Stapelberg, Marc Stapelberg", "title": "Local clinicians welcome increased COVID-19 testing in NSW - Northern Star", "description": "‘INCREASING testing capacity will allow the community to get back towards normality faster’`", "url": "https://www.northernstar.com.au/news/local-clinicians-welcome-increased-covid-19-testin/4002050/", "urlToImage": null, "publishedAt": "2020-04-24T14:00:00Z", "content": "THE NSW Government has announced there is now capacity to double the number of COVID-19 tests in the state from around 4000 tests per day to 8000.\r\nPatients can get a referral for testing from their GP, then go to a pathology lab.\r\nNorthern NSW Local Health D… [+2053 chars]"}, {"source": {"id": null, "name": "Medicalxpress.com"}, "author": "Science X staff", "title": "Highlighting diabetes risks in COVID-19 - Medical Xpress", "description": "An international review involving Monash University has found elderly people with diabetes who contract COVID-19 are at a much higher risk of dying from the disease—and the virus may actually trigger the onset of diabetes in normally healthy people.", "url": "https://medicalxpress.com/news/2020-04-highlighting-diabetes-covid-.html", "urlToImage": null, "publishedAt": "2020-04-24T13:52:38Z", "content": "An international review involving Monash University has found elderly people with diabetes who contract COVID-19 are at a much higher risk of dying from the diseaseand the virus may actually trigger the onset of diabetes in normally healthy people.\r\nThe study… [+5594 chars]"}, {"source": {"id": null, "name": "Pressenza.com"}, "author": "https://www.facebook.com/ConversationUK", "title": "Coronavirus: are we underestimating how many people have had it? Sweden thinks so - Pressenza", "description": "Many countries around the world are now facing the difficult decision of when and how to ease lockdown restrictions due to the novel coronavirus. In the", "url": "https://www.pressenza.com/2020/04/coronavirus-are-we-underestimating-how-many-people-have-had-it-sweden-thinks-so/", "urlToImage": null, "publishedAt": "2020-04-24T13:09:10Z", "content": "Many countries around the world are now facing the difficult decision of when and how to ease lockdown restrictions due to the novel coronavirus. In the absence of a vaccine, it is likely there will be new waves of the epidemic, unless enough people have been… [+6968 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "LSHTM's COVID-19 modelling research receives Government funding boost - Mirage News", "description": "The London School of Hygiene & Tropical Medicine has been awarded £500,000 by the UK government to support its vital work in furthering our understanding...", "url": "https://www.miragenews.com/lshtm-s-covid-19-modelling-research-receives-government-funding-boost/", "urlToImage": null, "publishedAt": "2020-04-24T12:06:16Z", "content": "The London School of Hygiene &amp; Tropical Medicine has been awarded £500,000 by the UK government to support its vital work in furthering our understanding of the spread of COVID-19 how it can be controlled.\r\nLed by Professor John Edmunds, the project will … [+2737 chars]"}]}