{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Smh.com.au"}, "author": "Melissa Cunningham, Kate Aubusson", "title": "'No one dies alone': Hospitals look for solutions to connect dying COVID-19 patients with families - Sydney Morning Herald", "description": "Being unable to hold your loved one’s hand or kiss them goodbye as they die alone in a hospital bed is perhaps the most brutal and devastating hallmark of coronavirus.", "url": "https://www.smh.com.au/national/no-one-dies-alone-hospitals-look-for-solutions-to-connect-dying-covid-19-patients-with-families-20200426-p54ncw.html", "urlToImage": null, "publishedAt": "2020-04-26T14:03:08Z", "content": "At St Vincent's Hospital a priest and chaplain are on call 24 hours a day, ready to suit up in face masks, gloves and protective gowns, to give coronavirus patients their last rites.\r\nWards are being remodelled to increase capacity to isolate critically ill C… [+5593 chars]"}, {"source": {"id": null, "name": "Un.org"}, "author": null, "title": "Millions more children at risk with immunization services disrupted amid COVID-19 pandemic - UN News", "description": "Last year, over 13 million children received no vaccines at all, and the UN Children’s Fund (UNICEF) is calling on governments to step up, warning disrupting immunization services amid the COVID-19 pandemic could leave even more of the world’s most marginaliz…", "url": "https://news.un.org/en/story/2020/04/1062622", "urlToImage": null, "publishedAt": "2020-04-26T11:40:07Z", "content": "Making its call at the start of the 2020 edition of World Immunization Week, UNICEF said on Saturday that millions of children are in danger of missing life-saving vaccines against measles, diphtheria and polio due to disruptions in immunization service as th… [+3030 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": "Staff writers", "title": "Are 'covid toes' a telltale sign of virus? - Coffs Coast Advocate", "description": "Doctors have begun to notice an unusual complaint shared by patients around the world, with some speculating the symptom might be an early sign of coronavirus.", "url": "https://www.dailytelegraph.com.au/coronavirus/lesions-on-toes-could-be-linked-to-coronavirus/news-story/cb9c1e01f098d5068d4e686e4be562c0", "urlToImage": null, "publishedAt": "2020-04-26T11:05:00Z", "content": "Rumour has it an unusual new symptom of coronavirus might be afoot.\r\nDoctors have reported that some patients have been found to have red, purple or blue lesions on their feet when presenting with other coronavirus symptoms.\r\nThe lesions were first reported o… [+2074 chars]"}, {"source": {"id": null, "name": "Ntnews.com.au"}, "author": "NATASHA EMECK", "title": "Patient mistook coronavirus for a hangover - Ballina Shire Advocate", "description": "ONE of the city's first coronavirus patients says his symptoms were so mild at first that he mistook them for a hangover after a boozy night out on holiday.", "url": "https://www.ntnews.com.au/news/northern-territory/darwin-patient-says-he-mistook-coronavirus-for-a-hangover/news-story/72d6e9987cf324d159913167ceb4af12", "urlToImage": null, "publishedAt": "2020-04-26T09:51:00Z", "content": "ONE of Darwin's first coronavirus patients says his symptoms were so mild at first that he mistook them for a hangover after a boozy night out on holiday.\r\nThe man in his mid-30s, who did not wish to be named for privacy reasons, has told the NT News about hi… [+1476 chars]"}, {"source": {"id": null, "name": "Menafn.com"}, "author": "MENAFN", "title": "5 reasons it's safe for kids to go back to school - MENAFN.COM", "description": "(MENAFN - The Conversation) In mid March, cases of COVID-19 – the disease caused by SARS-CoV-2 – dramatically increased in Australia and the government responded with an effective public health strategy. People who could, shifted to working from home, social …", "url": "https://menafn.com/1100085563/5-reasons-its-safe-for-kids-to-go-back-to-school", "urlToImage": null, "publishedAt": "2020-04-26T09:20:37Z", "content": "(MENAFN - The Conversation) In mid March, cases of COVID-19 the disease caused by SARS-CoV-2 dramatically increased in Australia and the government responded with an effective public health strategy. People who could, shifted to working from home, social dist… [+5729 chars]"}, {"source": {"id": null, "name": "Nzherald.co.nz"}, "author": "Kim Moodie", "title": "Covid 19 coronavirus: The number of coronavirus cases is up, should we be worried? - New Zealand Herald", "description": "'If you look at this week's cases compared to last week, we're in a better place.'", "url": "https://www.nzherald.co.nz/nz/news/article.cfm?c_id=1&objectid=12327701", "urlToImage": null, "publishedAt": "2020-04-26T09:13:54Z", "content": "The number of new coronavirus cases announced today was the highest in nearly a week, but experts say to be vigilant, not worried.\r\n Nine new cases of the virus were announced today, the highest in the last six days.\r\n While the number of new Covid-19 cases h… [+3320 chars]"}, {"source": {"id": null, "name": "Northweststar.com.au"}, "author": "Carly Waters and Benita Kolovos", "title": "No plans to relax rules, open Vic schools - The North West Star", "description": "Victoria will not follow in the footsteps of other states in easing some social distancing measures, despite a steady decline in the number of new COVID-19 ca...", "url": "https://www.northweststar.com.au/story/6735329/no-plans-to-relax-rules-open-vic-schools/?cs=9397", "urlToImage": null, "publishedAt": "2020-04-26T08:50:31Z", "content": ""}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Brittany Chain Lauren Ferri For Daily Mail Australia", "title": "Ten workers at Nepean and Sydney Adventist Hospitals quarantined after doctor caught coronavirus - Daily Mail", "description": "On Sunday, Nepean Blue Mountains Local Health District confirmed a female doctor from Nepean Hospital, at the base of the Blue Mountains in Sydney's west, tested positive for coronavirus.", "url": "https://www.dailymail.co.uk/news/article-8258071/Ten-workers-Nepean-Sydney-Adventist-Hospitals-quarantined-doctor-caught-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-26T08:42:33Z", "content": "Ten healthcare workers across two hospitals will spend the next 14 days in self-isolation after another employee tested positive to coronavirus.\r\nOn Sunday morning, Nepean Blue Mountains Local Health District confirmed a female doctor from Nepean Hospital, at… [+4220 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Nathan Layne and Rich McKay", "title": "United States steps toward reopening amid reports health secretary Alex Azar will be sacked - Sydney Morning Herald", "description": "President Donald Trump did not host a briefing on Saturday in the wake of ridicule for his earlier comments on the prospect of treating the coronavirus with bleach.", "url": "https://www.smh.com.au/world/north-america/united-states-steps-toward-reopening-amid-reports-health-secretary-alex-azar-will-be-sacked-20200426-p54nds.html", "urlToImage": null, "publishedAt": "2020-04-26T08:22:23Z", "content": "Politico reported a short list of names to replace Azar, including Deborah Birx, the White House coronavirus co-ordinator; Centres for Medicare and Medicaid Services chief Seema Verma and deputy HHS Secretary Eric Hargan.\r\nPockets of the country sought to res… [+5635 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Women face anxiety over pregnancy and birth in US - TRT World", "description": "For many women, being pregnant comes with its own set of fears and anxiety. But being pregnant during the Covid-19 pandemic takes those fears to a whole new ...", "url": "https://www.youtube.com/watch?v=gagwijdvCR0", "urlToImage": null, "publishedAt": "2020-04-26T08:10:16Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "The Conversation", "title": "Coronavirus: Australia's four scenarios for coming out of lockdown - Yahoo News Australia", "description": "There are a number of options Australia can look at as we ease lockdown measures.", "url": "https://au.news.yahoo.com/australias-four-scenarios-for-coming-out-of-lockdown-080640423.html", "urlToImage": null, "publishedAt": "2020-04-26T08:06:00Z", "content": "Australia is effectively in lockdown. Public gatherings of more than two people are banned and people are only permitted to leave home for a limited set of reasons.\r\nThe recent tough measures appear to be having some effect and the daily growth rate of new ca… [+6147 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "AFP", "title": "Five reasons why coronavirus has spread rapidly through Spain - Yahoo News Australia", "description": "Spain is one of the worst hit countries, with more than 20,000 deaths.", "url": "https://au.news.yahoo.com/six-reason-why-coronavirus-has-spread-rapidly-through-spain-074107834.html", "urlToImage": null, "publishedAt": "2020-04-26T07:41:00Z", "content": "In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told AFP.\r\nWhile they stressed it was too early to carry out a detailed analysis, the experts p… [+5101 chars]"}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": "Simon Bourke", "title": "Figures paint positive picture as Australia plans for COVID-19 recovery - The Canberra Times", "description": "Our COVID-19 Informer will keep you up to date with everything you need to know today.", "url": "https://www.canberratimes.com.au/story/6735440/figures-paint-positive-picture-as-australia-plans-for-covid-19-recovery/", "urlToImage": null, "publishedAt": "2020-04-26T07:30:00Z", "content": ""}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Morning update as military begins mobile testing - BBC News", "description": "Five things you need to know about the coronavirus outbreak this morning.", "url": "https://www.bbc.com/news/uk-52429303", "urlToImage": null, "publishedAt": "2020-04-26T06:54:27Z", "content": "Here are five things you need to know about the coronavirus outbreak this Sunday. We'll have another update for you on Monday.\r\n1. Military pop-up testing\r\nThe military is to begin carrying out coronavirus tests in pop-up facilities. The mobile units will tra… [+2792 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Too early to issue 'immunity passports' - Sky News Australia", "description": "Australia’s chief medical officer says he is in agreement with the United Nations, which warned there is no scientific basis for awarding an “immunity passpo...", "url": "https://www.youtube.com/watch?v=iAF5duYNIcs", "urlToImage": null, "publishedAt": "2020-04-26T06:07:09Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Entrepreneurs are 'focussed' on securing a COVID-19 vaccine - Sky News Australia", "description": "The ability “to make money and do good” is driving many entrepreneurs and venture capitalists to invest in projects designed to find a COVID-19 vaccine, acco...", "url": "https://www.youtube.com/watch?v=yIZbwEOxPxc", "urlToImage": null, "publishedAt": "2020-04-26T04:30:38Z", "content": null}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Jamie Seidel", "title": "PLAN C: Our last hope if virus vaccine comes to nothing - Noosa News", "description": "Coronavirus vaccines and treatment are in development, but what is the world’s Plan C?", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-vaccines-and-treatment-are-in-development-but-what-is-the-worlds-plan-c/news-story/082aa3bdda2ee957d532ec1e4605726c", "urlToImage": null, "publishedAt": "2020-04-26T04:26:00Z", "content": "Will a vaccine save us from COVID-19? What about new treatments for its symptoms?Indications are, we may have to find a Plan C.Billions of people are confined to our homes. We can’t go to the beach. The office. Or school. It’s the bluntest possible response t… [+8397 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "Coronavirus: Surprising benefit of COVID-19 lockdown restrictions - NEWS.com.au", "description": "Coronavirus: Surprising benefit of COVID-19 lockdown restrictions", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-surprising-benefit-of-covid19-lockdown-restrictions/news-story/b4a2b33b821b6e335072c84352a06242", "urlToImage": null, "publishedAt": "2020-04-26T03:10:03Z", "content": "The rate of Australians getting infected by contagious diseases has plummeted following social distancing restrictions.The transmission rate of influenza, chickenpox, measles and other communicable diseases have fallen since Australia’s COVID-19 restrictions … [+4194 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus: People with COVID-19 symptoms more than double number who tested positive, app shows - Yahoo News UK", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_41693154-378e-4ab6-ae60-b5c546c9ea2e&lang=en-GB&inline=false", "urlToImage": null, "publishedAt": "2020-04-26T02:33:00Z", "content": "To give you a better overall experience, we want to provide relevant ads that are more useful to you. For example, when you search for a film, we use your search information and location to show the most relevant cinemas near you. We also use this information… [+258 chars]"}, {"source": {"id": null, "name": "Stawelltimes.com.au"}, "author": "Carly Waters and Benita Kolovos", "title": "One new COVID-19 death in Victoria - The Stawell Times-News", "description": "Victoria will not follow in the footsteps of other states in easing some social distancing measures, despite a steady decline in the number of new COVID-19 ca...", "url": "https://www.stawelltimes.com.au/story/6735329/no-plans-to-relax-rules-open-vic-schools/?cs=9397", "urlToImage": null, "publishedAt": "2020-04-26T02:21:00Z", "content": ""}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": "Darren Cartwright", "title": "COVID-19 restrictions to be eased in Qld - The Canberra Times", "description": "Family picnics and weekend drives are back and national parks will reopen in Queensland from next weekend after just three COVID-19 cases were recorded overni...", "url": "https://www.canberratimes.com.au/story/6735369/covid-19-restrictions-to-be-eased-in-qld/", "urlToImage": null, "publishedAt": "2020-04-26T01:19:18Z", "content": ""}, {"source": {"id": null, "name": "Theleader.com.au"}, "author": "Colin Brinsden", "title": "Virus tracing app only for health use: PM - St George and Sutherland Shire Leader", "description": "Doctors, nurses, business and bankers have been quick to back the Morrison government's COVID-19 tracer app, which aims to help health officials identify peop...", "url": "https://www.theleader.com.au/story/6735355/covidsafe-app-to-help-get-back-to-normal/?cs=9397&utm_campaign=sidebar&utm_medium=index&utm_source=website", "urlToImage": null, "publishedAt": "2020-04-26T01:18:17Z", "content": "Doctors, nurses, business and bankers have been quick to back the Morrison government's COVID-19 tracer app, which aims to help health officials identify people who may have come into contact with someone with the disease.\r\nCalled COVIDSafe, the voluntary app… [+3371 chars]"}, {"source": {"id": "xinhua-net", "name": "Xinhua Net"}, "author": null, "title": "Study reveals link between ADHD and sleeping disorder - Xinhua | English.news.cn - Xinhua", "description": null, "url": "http://www.xinhuanet.com/english/2020-04/26/c_139008340.htm", "urlToImage": null, "publishedAt": "2020-04-26T00:07:03Z", "content": "SHANGHAI, April 26 (Xinhua) -- An international team of researchers have found that Attention Deficit Hyperactivity Disorder (ADHD) is related to sleeping disorder through brain imaging analysis.\r\nADHD is seen in some children who are often accompanied by sle… [+1022 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Spain reports nearly 3,000 daily virus cases - Times of India", "description": "Europe News: MADRID: Spain's health authorities say 2,944 new Covid-19 infections were confirmed in the previous 24 hours, taking the total to nearly 206,000 cases.", "url": "https://timesofindia.indiatimes.com/world/europe/spain-reports-nearly-3000-daily-virus-cases/articleshow/75380478.cms", "urlToImage": null, "publishedAt": "2020-04-25T23:47:56Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Dailyadvertiser.com.au"}, "author": "Jessica McLaughlin", "title": "Wagga coronavirus: one new COVID-19 cases recorded in Murrumbidgee Local Health District - Daily Advertiser", "description": "This brings the total of positive cases to 46 for the MLHD.", "url": "https://www.dailyadvertiser.com.au/story/6735353/coronavirus-strikes-again-in-wagga-with-new-positive-case/", "urlToImage": null, "publishedAt": "2020-04-25T23:30:00Z", "content": ""}, {"source": {"id": null, "name": "Onenewspage.co.uk"}, "author": "BBC News", "title": "Coronavirus: Dundee father of 13 tests positive for - One News Page", "description": "The Hann family have found lockdown a struggle but say they feel privileged as they pull together.", "url": "https://www.onenewspage.co.uk/n/Front+Page/1zlreqv224/Coronavirus-Dundee-father-of-13-tests-positive-for.htm", "urlToImage": null, "publishedAt": "2020-04-25T23:05:00Z", "content": "Testing in U.S. prisons finds huge asymptomatic population\r\nAs mass coronavirus testing expands in prisons, large numbers of inmates are showing no symptoms. In four state prison systems Arkansas, North Carolina, Ohio and Virginia 96% of 3,277 inmates..\r\nCred… [+63 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Jonathan Leake, Science Editor", "title": "Tracker app suggests coronavirus arrived at new year - The Times", "description": "The coronavirus was spreading in the UK weeks before the first case was detected, according to a leading epidemiologist.Professor Tim Spector has collated reports of people falling ill with “classic", "url": "https://www.thetimes.co.uk/article/tracker-app-suggests-coronavirus-arrived-at-new-year-rcsvkdrgn", "urlToImage": null, "publishedAt": "2020-04-25T23:01:00Z", "content": "The coronavirus was spreading in the UK weeks before the first case was detected, according to a leading epidemiologist.\r\nProfessor Tim Spector has collated reports of people falling ill with classic symptoms of the disease from the start of January.\r\nIt sugg… [+504 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "UK doctor invents digital flashcards to help Covid-19 patients understand staff - The Guardian", "description": "Cardmedic overcomes communication barrier caused by healthcare staff wearing PPE", "url": "https://www.theguardian.com/world/2020/apr/25/uk-doctor-invents-digital-flashcards-to-help-covid-19-patients-understand-staff", "urlToImage": null, "publishedAt": "2020-04-25T21:50:36Z", "content": "A coronavirus patients terrifying hospital experience inspired an NHS doctor to create a flashcard system to improve communication with medical staff wearing face masks.\r\nAnaesthetist Rachael Grimaldi founded Cardmedic while on maternity leave after reading a… [+2712 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "First nationwide influenza vaccine program to target children aged 6 months to under five years - Mirage News", "description": "First nationwide influenza vaccine programto target children aged 6 months to under five years Influenza vaccination can help reduce hospitalisations,...", "url": "https://www.miragenews.com/first-nationwide-influenza-vaccine-program-to-target-children-aged-6-months-to-under-five-years-2/", "urlToImage": null, "publishedAt": "2020-04-25T21:40:08Z", "content": "to target children aged 6 months to under five years\r\nInfluenza vaccination can help reduce hospitalisations, community transmission\r\nand the “double whammy” of combined influenza and COVID-19 infection\r\n More than a million Australian children aged between 6… [+3564 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "'No evidence' people with coronavirus are immunised: WHO - SBS News", "description": "While the global death toll of coronavirus passes 200,000, the World Health Organization warns there is no evidence of immunity to the disease.", "url": "https://www.sbs.com.au/news/no-evidence-people-with-coronavirus-are-immunised-says-who", "urlToImage": null, "publishedAt": "2020-04-25T21:37:23Z", "content": "The World Health Organization has warned that recovering from coronavirus might not protect people from reinfection as the death toll from the pandemic passed 200,000 around the globe.\r\nGovernments are struggling to limit the economic devastation unleashed by… [+7190 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Mehr Gill", "title": "Explained: Types of human coronaviruses and the symptoms they cause - The Indian Express", "description": "While there are hundreds of coronaviruses, there are seven that we know can infect humans.", "url": "https://indianexpress.com/article/explained/types-of-human-coronaviruses-and-symptoms-6368444/", "urlToImage": null, "publishedAt": "2020-04-25T19:50:19Z", "content": "Written by Mehr Gill\r\n | New Delhi | \r\nUpdated: April 25, 2020 6:09:09 pm\r\nHuman coronaviruses were first characterised in the mid-1960s and they are mostly considered to be responsible for causing upper respiratory tract infections in children. (AP illustrat… [+6888 chars]"}, {"source": {"id": null, "name": "Illawarramercury.com.au"}, "author": null, "title": "Global coronavirus death toll hits 200000 - Illawarra Mercury", "description": "As the global death toll from the coronavirus surpassed 200,000 on Saturday, countries took cautious steps toward easing lockdowns imposed amid the pandemic,...", "url": "https://www.illawarramercury.com.au/story/6735340/global-coronavirus-death-toll-hits-200000/?cs=298", "urlToImage": null, "publishedAt": "2020-04-25T19:09:56Z", "content": ""}, {"source": {"id": null, "name": "Theleader.com.au"}, "author": null, "title": "COVID-19 study finds schools safe: report | St George & Sutherland Shire Leader | St George, NSW - St George and Sutherland Shire Leader", "description": "There is no evidence students at NSW schools have infected staff with COVID-19, according to a study cited by the federal government in its push to reopen sch...", "url": "https://www.theleader.com.au/story/6735338/school-return-plan-reinforced-by-nsw-study/?cs=9397", "urlToImage": null, "publishedAt": "2020-04-25T18:56:45Z", "content": "There is no evidence students at NSW schools have infected staff with COVID-19, according to a study cited by the federal government in its push to reopen schools.\r\nThe National Centre for Immunisation Research and Surveillance probe looked at all 18 cases of… [+2384 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ariana Eunjung Cha", "title": "Spike in stroke deaths in patients with only minor coronavirus symptoms - The Independent", "description": "Reports of strokes in the young and middle-aged are the latest twist in our evolving understanding of the mysteries of the virus, finds Ariana Eunjung Cha", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-stroke-deaths-symptoms-covid-19-heart-a9484091.html", "urlToImage": null, "publishedAt": "2020-04-25T18:45:03Z", "content": "Thomas Oxley wasnt even on call the day he received the page to come into Mount Sinai Beth Israel Hospital in Manhattan. There werent enough doctors to treat all the emergency stroke patients, and he was needed in the operating room.\r\nThe patients chart appea… [+9849 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "2 cell types are entry points for virus - Hindustan Times", "description": "The respiratory tract is filled with numerous cells, among which are goblet cells and ciliated cells.", "url": "https://www.hindustantimes.com/india-news/2-cell-types-are-entry-points-for-virus/story-VZ250MIqdc4r0OIzxsTqPJ.html", "urlToImage": null, "publishedAt": "2020-04-25T17:54:31Z", "content": "Scientists have identified two types of cells in the nose that are likely to be point of infection for the Sars-CoV-2 virus, which causes Covid-19, in the body.\r\nThe respiratory tract is filled with numerous cells, among which are goblet cells and ciliated ce… [+2449 chars]"}, {"source": {"id": null, "name": "Northernargus.com.au"}, "author": "Carly Waters and Benita Kolovos", "title": "Victoria elective surgeries set to return - Clare Northern Argus", "description": "Victoria will not follow in the footsteps of other states in easing some social distancing measures, despite a steady decline in the number of new COVID-19 ca...", "url": "https://www.northernargus.com.au/story/6735329/no-plans-to-relax-rules-open-vic-schools/?cs=9397", "urlToImage": null, "publishedAt": "2020-04-25T17:30:42Z", "content": "Victoria will not follow in the footsteps of other states in easing some social distancing measures, despite a steady decline in the number of new COVID-19 cases.\r\nHealth Minister Jenny Mikakos confirmed the state recorded one death and three new coronavirus … [+2910 chars]"}, {"source": {"id": null, "name": "Newcastlestar.com.au"}, "author": null, "title": "Contact checks on WA's latest virus case | The Star | Newcastle, NSW - Newcastle Star", "description": "Western Australia will relax its coronavirus restrictions to allow up to 10 people to gather for non-work activities, as the state recorded another day of no...", "url": "https://www.newcastlestar.com.au/story/6735328/wa-cautiously-relaxes-virus-restrictions/?cs=7", "urlToImage": null, "publishedAt": "2020-04-25T17:30:39Z", "content": "Western Australia will relax its coronavirus restrictions to allow up to 10 people to gather for non-work activities, as the state recorded another day of no new COVID-19 cases.\r\nPremier Mark McGowan said it was a \"cautious relaxation\" of restrictions, acknow… [+1570 chars]"}, {"source": {"id": null, "name": "Nambuccaguardian.com.au"}, "author": null, "title": "SA near end of coronavirus testing blitz | Guardian News | Nambucca Heads, NSW - Nambucca Guardian News", "description": "South Australia has recorded no new cases of coronavirus for the fourth consecutive day, as the state government urged people with other serious medical issue...", "url": "https://www.nambuccaguardian.com.au/story/6735327/sa-hospital-numbers-down-amid-covid-19/", "urlToImage": null, "publishedAt": "2020-04-25T17:30:09Z", "content": "South Australia has recorded no new cases of coronavirus for the fourth consecutive day, as the state government urged people with other serious medical issues to not let the pandemic stop them seeking help.\r\nThe state has confirmed a total of 438 cases, but … [+1837 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Jedidajah Otte", "title": "Number of people to die of Covid-19 in UK hospitals passes 20,000 - The Guardian", "description": "Britain has the fifth-highest number of coronavirus deaths after US, Italy, Spain and France", "url": "https://www.theguardian.com/world/2020/apr/25/uk-coronavirus-death-toll-passes-grim-milestone-of-20000", "urlToImage": null, "publishedAt": "2020-04-25T16:42:52Z", "content": null}, {"source": {"id": null, "name": "Independentaustralia.net"}, "author": null, "title": "Still in the dark over COVID-19, testing and re-testing is vital - Independent Australia", "description": "To hedge risk, we need to estimate the risk. Yet COVID-19 involves too much uncertainty to know.", "url": "https://independentaustralia.net/life/life-display/still-in-the-dark-over-covid-19-testing-and-re-testing-is-vital,13829", "urlToImage": null, "publishedAt": "2020-04-25T16:34:43Z", "content": "To hedge risk, we need to estimate the risk. Yet COVID-19 involves too much uncertainty to know.\r\nWe have to rely on the experience of other countries and other viruses. We know more than a month ago, but still need to know more. We need to know the likelihoo… [+6348 chars]"}, {"source": {"id": null, "name": "Registerguard.com"}, "author": "Staff, news services", "title": "Coronavirus updates, Saturday: 1 new death, 76 new cases in Oregon - The Register-Guard", "description": "Other news: U.S. hits 50,000 deaths from coronavirus; Oregon self-serve gas option extended again; UO announces 2020 commencement plans", "url": "https://www.registerguard.com/article/20200425/NEWS/200429840", "urlToImage": null, "publishedAt": "2020-04-25T13:22:20Z", "content": "Other news: U.S. hits 50,000 deaths from coronavirus; Oregon self-serve gas option extended again; UO announces 2020 commencement plans\r\n1 new death, 76 new cases of coronavirus in Oregon\r\nPORTLAND — Oregon health officials announced one new death from the no… [+11701 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Sweden goes it alone with 'relaxed' attitude to coronavirus - CGTN", "description": "Sweden's relaxed restrictions could lead to herd immunity but at what cost?", "url": "https://newseu.cgtn.com/news/2020-04-25/Sweden-goes-it-alone-with-relaxed-attitude-to-coronavirus-PYIUqQSwH6/index.html", "urlToImage": null, "publishedAt": "2020-04-25T12:41:25Z", "content": "Everyone wants immunity from the coronavirus. But there may be different ways to get it.\r\nOne is a vaccine. Clinical trials are already underway in the UK, and if all goes well, say those involved, it's possible a vaccination may be ready for production by Se… [+3523 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "DOH: More than 72000 lab tests conducted for COVID-19 in PH - INQUIRER.net", "description": "More than 72,000 laboratory tests were conducted for checking novel coronavirus or SARS-CoV-2, which causes COVID-19, in the country, the Department of Healt...", "url": "https://www.youtube.com/watch?v=fB_ScQAcFZs", "urlToImage": null, "publishedAt": "2020-04-25T11:58:23Z", "content": null}, {"source": {"id": null, "name": "Timesofmalta.com"}, "author": null, "title": "Why has Spain been so badly hit by coronavirus? - Times of Malta", "description": "In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told AFP.\nWhile they stressed it was too early to carry out a detailed analysis, the experts po…", "url": "https://timesofmalta.com/articles/view/why-has-spain-been-so-badly-hit-by-coronavirus.787880", "urlToImage": null, "publishedAt": "2020-04-25T10:06:00Z", "content": "In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told AFP.\r\nWhile they stressed it was too early to carry out a detailed analysis, the experts p… [+4518 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Baby makes 'miracle' recovery to beat virus - Chinchilla News", "description": "Doctors held grave fears for this six-month old-baby when she contracted COVID-19, but she pulled through against all odds and has become a symbol of hope.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-sixmonthold-baby-from-manchester-beats-covid19-parents-overjoyed/news-story/dd23c0c28d8689c2497724fdb6291258", "urlToImage": null, "publishedAt": "2020-04-25T09:49:00Z", "content": "Already severely underweight and with other medical complications, doctors thought this six-month-old baby was done for when she contracted COVID-19.\r\nBut Erin Bates pulled through and has become a symbol of hope for others.\r\nThe baby from Manchester, England… [+3615 chars]"}, {"source": {"id": null, "name": "Macarthuradvertiser.com.au"}, "author": "Gus McCubbing", "title": "Blue Mtns health worker positive for virus | Campbelltown - Campbelltown Macarthur Advertiser", "description": "An 83-year-old man has died from COVID-19 at an aged care facility in western Sydney, taking the state's virus toll to 36. The man was a resident at Anglicare...", "url": "https://www.macarthuradvertiser.com.au/story/6734966/sixth-virus-death-at-nsw-age-care-facility/?cs=9397", "urlToImage": null, "publishedAt": "2020-04-25T09:27:18Z", "content": "An 83-year-old man has died from COVID-19 at an aged care facility in western Sydney, taking the state's virus toll to 36.\r\nThe man was a resident at Anglicare Newmarch House in Cadden and is the sixth death at the facility.\r\nThe facility is the state's large… [+2026 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "France to trial nicotine patches to prevent COVID-19 - Big Rigs", "description": "Despite repeated warnings that smokers have a higher risk of severe cases one European country is hoping to trial nicotine patches on healthcare workers.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-france-to-trial-nicotine-patches-to-prevent-covid19/news-story/616d8f570780c5eba4d76b34ba015c7e", "urlToImage": null, "publishedAt": "2020-04-25T07:40:37Z", "content": "France is hoping to trial nicotine patches on healthcare workers after a study suggested that smokers may have a lesser chance of catching coronavirus.\r\nThe surprising findings come despite health officials around the world repeatedly warning that smokers who… [+2894 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "James Rodger", "title": "Government were 'warned to prepare for impending pandemic last year' - Birmingham Live", "description": "The National Security Risk Assessment (NSRA) - running to more than 600 pages - highlighted the devastating social and economic costs of a major disease outbreak", "url": "https://www.birminghammail.co.uk/news/midlands-news/government-were-warned-prepare-impending-18148465", "urlToImage": null, "publishedAt": "2020-04-25T06:34:57Z", "content": "Ministers were warned last year that the Government needed robust plans in place to deal with a potential pandemic virus, according to a leaked Cabinet Office briefing.\r\nThe National Security Risk Assessment (NSRA) - running to more than 600 pages - highlight… [+2462 chars]"}, {"source": {"id": null, "name": "Katherinetimes.com.au"}, "author": null, "title": "Qld virus total steady despite new cases - Katherine Times", "description": "Just two new cases of the coronavirus have been recorded in Queensland, bringing closer the possibility the state will record fewer than 10 new infections in...", "url": "https://www.katherinetimes.com.au/story/6734959/qld-virus-total-steady-despite-new-cases/", "urlToImage": null, "publishedAt": "2020-04-25T05:37:48Z", "content": ""}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Maggie Fox", "title": "COVID-19 causing blood clots, sudden strokes in young adults, doctors say - CTV News", "description": "The new coronavirus appears to be causing sudden strokes in adults in their 30s and 40s who are not otherwise terribly ill, doctors reported Wednesday.", "url": "https://www.ctvnews.ca/health/coronavirus/covid-19-causing-blood-clots-sudden-strokes-in-young-adults-doctors-say-1.4910674", "urlToImage": null, "publishedAt": "2020-04-25T03:40:15Z", "content": "The new coronavirus appears to be causing sudden strokes in adults in their 30s and 40s who are not otherwise terribly ill, doctors reported Wednesday.\r\nThey said patients may be unwilling to call 911 because they have heard hospitals are overwhelmed by coron… [+2516 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": null, "title": "Dentists, doctors, registered nurses most at risk of catching COVID-19 - Daily Telegraph", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.dailytelegraph.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T03:00:00Z", "content": null}, {"source": {"id": null, "name": "Centralwesterndaily.com.au"}, "author": null, "title": "One active coronavirus case remains in Orange, no new cases reported - Central Western Daily", "description": "\"The best thing everyone can do at this point is to stay at home unless it is absolutely essential.\"", "url": "https://www.centralwesterndaily.com.au/story/6735131/one-coronavirus-case-still-active-in-orange-no-new-cases-reported/", "urlToImage": null, "publishedAt": "2020-04-25T02:55:00Z", "content": ""}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "COVID-19 kills in 'brain to toe rampage' - Chronicle", "description": "Medical experts have described how coronavirus kills its victims in “a ferocious rampage through the body, from brain to toes”.", "url": "https://www.news.com.au/world/coronavirus/health/how-covid19-kills-in-ferocious-rampage-from-brain-to-toes/news-story/76f8edff42d1302b2c9acc8211547ea6", "urlToImage": null, "publishedAt": "2020-04-25T02:28:00Z", "content": "COVID-19 kills \"in a ferocious rampage through the body from brain to toes\" doctors have explained, saying the virus \"acts like no pathogen humanity has ever seen\".\r\nIn an article in sciencemag.org, frontline clinicians caring for the five per cent who become… [+7313 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Could rapid saliva tests be COVID-19 testing breakthrough? - ABC News", "description": "ABC News’ Devin Dwyer reports on a new rapid saliva swab tests that could help boost testing access nationwide. ABC News Live Prime, Weekdays at 7EST & 9EST ...", "url": "https://www.youtube.com/watch?v=KV-NZzSJDHg", "urlToImage": null, "publishedAt": "2020-04-25T00:57:23Z", "content": null}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Baked beans an unlikely nutrition star, and pandemic hit - Health - ABC News", "description": "While baked beans might not look particularly sexy, they're a favourite among nutrition experts. Here's why.", "url": "https://www.abc.net.au/news/health/2020-04-25/baked-beans-an-unlikely-nutrition-star/12176974", "urlToImage": null, "publishedAt": "2020-04-25T00:17:11Z", "content": "As we all fight our inner \"prepper\" and try not to succumb to panic buying, it seems many of us have turned to an old favourite: baked beans.\r\nBean production at Australia's largest fruit and vegetable cannery in Shepparton, Victoria, has doubled its usual vo… [+5001 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Kate Kelland and Manas Mishra", "title": "Could warm weather help contain pandemic? - Gold Coast Bulletin", "description": "As the seasons change in the northern and southern hemispheres, questions are being asked about the influence of weather in the spread of coronavirus, which has killed more than 190,000 people and sent the global economy into a tailspin.", "url": "https://www.news.com.au/world/breaking-news/could-warm-weather-help-contain-pandemic/news-story/3151c026d02efea4a5c503ede2417b8d", "urlToImage": null, "publishedAt": "2020-04-25T00:12:00Z", "content": "As the seasons change in the northern and southern hemispheres, questions are being asked about the influence of weather in the spread of coronavirus, which has killed more than 190,000 people and sent the global economy into a tailspin.\r\nHere's what we know … [+3623 chars]"}, {"source": {"id": null, "name": "Geelongadvertiser.com.au"}, "author": null, "title": "Active COVID-19 cases plunging in Australia - Geelong Advertiser", "description": "Subscribe to the Geelong Advertiser to get unrestricted digital access, home paper delivery, Apps for iPad and Android and much more...", "url": "https://www.geelongadvertiser.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T00:02:34Z", "content": null}, {"source": {"id": null, "name": "Startsat60.com"}, "author": "Jocelyn Nickels", "title": "Create your own fabric face mask to help prevent the spread of Covid-19 - Starts at 60", "description": "Certain fabrics will provide better protection and help slow the spread of coronavirus.", "url": "https://startsat60.com/discover/lifestyle/crafts/diy-fabric-masks-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T00:00:18Z", "content": "Simply grab your fabric of choice, fold the sides a few times into the middle and place a rubber band over each end. Then use the rubber bands to secure the mask over your ears its as easy as that!\r\nPeople have since followed Adams advice and got on board the… [+2684 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Sydney doctor Edward O’Neill in UK coronavirus vaccine trial - 7NEWS.com.au", "description": "Edward O'Neill believes taking part in a UK coronavirus vaccine trial is the right thing to do but admits he's taking a \"walk in faith\".", "url": "https://7news.com.au/lifestyle/health-wellbeing/aussie-to-walk-in-faith-in-vaccine-trial-c-998463", "urlToImage": null, "publishedAt": "2020-04-24T21:49:15Z", "content": "An Australian man who is testing a potential coronavirus vaccine in the UK says he is taking a walk in faith.\r\nDr Edward ONeill was one of the first two people injected as part of trials for a potential vaccine that has been developed by Oxford University.\r\nT… [+1441 chars]"}, {"source": {"id": null, "name": "Popsugar.com.au"}, "author": "Kate Schweitzer", "title": "Cats Can, In Fact, Get Coronavirus: Here’s What Pet Owners Need to Know - POPSUGAR Australia", "description": "What", "url": "https://www.popsugar.com.au/pets/how-to-tell-if-your-cat-has-coronavirus-47419889", "urlToImage": null, "publishedAt": "2020-04-24T21:30:35Z", "content": "It was confirmed this week that two domesticated cats had been infected with the coronavirus in the United States. Following early news reports of lions and tigers showing COVID-19 symptoms at a New York zoo, this is the first case of household pets testing p… [+4817 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Joseph Guzman", "title": "New report: Coronavirus lingers in patient's eyes days after it leaves nose | TheHill - The Hill", "description": "A new report is detailing how the coronavirus can exist in an infected person’s eye fluids at potentially contagious levels.", "url": "https://thehill.com/changing-america/well-being/prevention-cures/494586-coronavirus-found-in-patients-eyes-days-after-it", "urlToImage": null, "publishedAt": "2020-04-24T21:19:55Z", "content": "A recently published report is detailing how Italys first coronavirus patient had detectable traces of the virus in her eyes days after it had cleared from her nose, highlighting how the eyes could play a factor in the spread of COVID-19. \r\nThe patient, a 65-… [+2785 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Olivia Willis", "title": "When coronavirus patients suddenly decline, their own immune system might be to blame - ABC News", "description": "In some cases of COVID-19, it may be the body's response to the virus, rather than the virus itself, that ultimately causes harm.", "url": "https://www.abc.net.au/news/health/2020-04-25/coronavirus-covid-immune-response-causes-harm/12176872", "urlToImage": null, "publishedAt": "2020-04-24T20:30:29Z", "content": "It's been described as the \"second week crash\".\r\nAbout seven days after developing symptoms of COVID-19, some people even those with mild symptoms can suddenly start to deteriorate, often with little warning.\r\n\"They end up getting admitted to hospital, and ab… [+6217 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": null, "title": "Carrying books, not virus at school - Daily Telegraph", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.dailytelegraph.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-24T20:00:22Z", "content": null}, {"source": {"id": null, "name": "9news.com.au"}, "author": "Associated Press", "title": "France braces for second wave of infections; EPA contradicts Trump disinfectant 'cure' suggestion - 9News", "description": "<p>France is preparing for a <a href=\"https://news-website-prev.ap-southeast-2.elasticbeanstalk.com/world/worst-ways-coronavirus-pandemic-has-been-handled/c7a84cfa-a169-4fb1-bff9-a574381543de\">second wave of virus cases</a>, Britain is reporting nearly 20,000…", "url": "https://www.9news.com.au/world/france-braces-for-coronavirus-second-wave/8c127830-54ed-4fc6-97f4-f26618ab4f4e", "urlToImage": null, "publishedAt": "2020-04-24T19:54:51Z", "content": "Property News: Creative ways people are staying connected during isolation - domain.com.au"}, {"source": {"id": null, "name": "China.org.cn"}, "author": "", "title": "Sweden sees rise in coronavirus-related deaths - China.org.cn", "description": null, "url": "http://www.china.org.cn/world/Off_the_Wire/2020-04/25/content_75973508.htm", "urlToImage": null, "publishedAt": "2020-04-24T19:45:59Z", "content": "STOCKHOLM, April 24 (Xinhua) -- A new spike in COVID-19 cases in the Swedish capital of Stockholm could signal that residents have started to relax about social distancing recommendations, the country's health authorities said on Friday.\r\nA total of 1,152 peo… [+3212 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Les Steed", "title": "How does key worker testing work and what time can I apply for a coronavirus test? - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11469520/key-worker-coronavirus-testing-how-what-time/", "urlToImage": null, "publishedAt": "2020-04-24T17:35:15Z", "content": "MATT HANCOCK announced that testing can now be provided for up to seven million key workers and emergency staff.\r\nHere's how to get tested if you are an essential worker who believes that you or a household member has coronavirus.\r\n Matt Hancock said key work… [+6641 chars]"}, {"source": {"id": null, "name": "Thecourier.com.au"}, "author": "Karen Sweeney and Andi Yu", "title": "New Vic laws and virus outbreak probe - Ballarat Courier", "description": "The stark contrast between the slow spread of coronavirus in Victoria and the pandemic internationally makes the state the \"envy of the world\". Deputy chief h...", "url": "https://www.thecourier.com.au/story/6734968/vic-cases-enviable-but-virus-is-not-over/?cs=10229", "urlToImage": null, "publishedAt": "2020-04-24T17:31:40Z", "content": ""}, {"source": {"id": null, "name": "Genengnews.com"}, "author": "John Sterling", "title": "Roundworm Study May Lead to New Therapies for Allergies and Asthma - Genetic Engineering & Biotechnology News", "description": "Researchers at the Center of Allergy and Environment (ZAUM) at the Technical University of Munich and Helmholtz Zentrum München have discovered an active ingredient taken from the larvae of a worm parasite can be used to suppress inflammatory reactions.", "url": "https://www.genengnews.com/news/roundworm-study-may-lead-to-new-therapies-for-allergies-and-asthma/", "urlToImage": null, "publishedAt": "2020-04-24T16:40:00Z", "content": "Scientists at the Center of Allergy and Environment (ZAUM) at Technical University of Munich and Helmholtz Zentrum München say they have succeeded in isolating, identifying, and analyzing a protein that the larvae of a roundworm (Heligmosomoides polygyrus) us… [+3798 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "'Sage did not advise a specific target' for Covid-19 testing, says Chris Whitty - The Telegraph", "description": "Chief Medical Officer, Chris Whitty, appears in front of the Science and Tech Committee to answer questions of Covid-19 testing Get the latest headlines: htt...", "url": "https://www.youtube.com/watch?v=TXaG8YVLm8U", "urlToImage": null, "publishedAt": "2020-04-24T16:35:21Z", "content": "Chief Medical Officer, Chris Whitty, appears in front of the Science and Tech Committee to answer questions of Covid-19 testing\r\nGet the latest headlines: https://www.telegraph.co.uk/\r\nTelegraph.co.uk and YouTube.com/TelegraphTV are websites of The Telegraph,… [+137 chars]"}]}