{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Theguardian.comworld"}, "author": "Sarah Marsh, Nazia Parveen", "title": "England campaign targets seriously ill patients avoiding hospitals - The Guardian", "description": "Campaign will urge people with serious non-coronavirus-related conditions to seek help", "url": "https://amp.theguardian.comworld/2020/apr/25/england-campaign-targets-seriously-ill-patients-avoiding-hospitals", "urlToImage": null, "publishedAt": "2020-04-25T07:46:47Z", "content": "A government campaign has been launched to encourage people seriously ill with non-Covid conditions such as heart attacks to seek help amid concerns some are avoiding hospitals.\r\nThe campaign, which will be rolled out next week, aims to encourage people to us… [+4549 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Nicotine patches 'may prevent virus' - Whitsunday Times", "description": "Despite repeated warnings that smokers have a higher risk of severe cases one European country is hoping to trial nicotine patches on healthcare workers.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-france-to-trial-nicotine-patches-to-prevent-covid19/news-story/616d8f570780c5eba4d76b34ba015c7e", "urlToImage": null, "publishedAt": "2020-04-25T07:20:00Z", "content": "France is hoping to trial nicotine patches on healthcare workers after a study suggested that smokers may have a lesser chance of catching coronavirus.\r\nThe surprising findings come despite health officials around the world repeatedly warning that smokers who… [+2894 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Digital Staff", "title": "Twin sister nurses die within three days of each other from coronavirus in the UK - 7NEWS.com.au", "description": "“They always said they had come into the world together and would go out together as well.”", "url": "https://7news.com.au/lifestyle/health-wellbeing/twin-sister-nurses-die-within-three-days-of-each-other-from-coronavirus-in-the-uk-c-999118", "urlToImage": null, "publishedAt": "2020-04-25T07:19:57Z", "content": "Twin sisters have died within just three days of each other after they both contracted coronavirus.\r\nKaty and Emma Davis, 37, died at a hospital in the UK this week and their other sister Zoe said they were dedicated to helping other people.\r\nThe twin sisters… [+878 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Dailymail.com Reporter", "title": "Cyclist who confronted CNN's Chris Cuomo in his backyard says the host was like a 'boiling pot' - Daily Mail", "description": "David Whelan claimed that the anchor berated him as he asked Cuomo why he was not self-quarantining on Easter Sunday.", "url": "https://www.dailymail.co.uk/news/article-8255903/Cyclist-confronted-CNNs-Chris-Cuomo-backyard-says-host-like-boiling-pot.html", "urlToImage": null, "publishedAt": "2020-04-25T06:58:02Z", "content": "The Long Island bicyclist who got into a verbal spat with CNN anchor Chris Cuomo on Easter Sunday said the host was like a 'boiling pot' as he was confronted for not self-quarantining.\r\nDavid Whelan claimed that he had decided to go on a bike ride near where … [+4687 chars]"}, {"source": {"id": null, "name": "Rnz.co.nz"}, "author": "RNZ News", "title": "Coronavirus: US death toll passes 50000 in world's deadliest Covid-19 outbreak - RNZ", "description": "The US Covid-19 death toll has passed 50,000, according to data from Johns Hopkins University.", "url": "https://www.rnz.co.nz/news/world/415117/coronavirus-us-death-toll-passes-50-000-in-world-s-deadliest-covid-19-outbreak", "urlToImage": null, "publishedAt": "2020-04-25T06:27:56Z", "content": "The US virus death toll has surpassed 50,000, according to data from Johns Hopkins University.\r\nA New York cemetery receives the bodies of Covid-19 victims. Photo: 2020 Anadolu Agency/ AFP\r\nMore than 3,000 deaths came in the last 24 hours, and there are now o… [+2266 chars]"}, {"source": {"id": null, "name": "Brisbanetimes.com.au"}, "author": "Jocelyn Garcia", "title": "Two more COVID-19 cases confirmed as Queensland testing expands - Sydney Morning Herald", "description": "Queensland Health is still carrying out contract tracing on some passengers who flew from Melbourne to Brisbane on VA341 on April 20.", "url": "https://www.brisbanetimes.com.au/national/queensland/two-more-covid-19-cases-confirmed-as-queensland-testing-expands-20200425-p54n6d.html", "urlToImage": null, "publishedAt": "2020-04-25T05:14:19Z", "content": "\"None of this is easy - but its worth it. Its working,\" she said.\r\nQueensland authorities have carried 97,057 tests for COVID-19, including 2,093 in the previous 24 hours.\r\nDespite an expansion of testing criteria, Health Minister Steven Miles said the number… [+2114 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Victoria records three new coronavirus infections, including another inpatient at Albert Road psychiatric clinic - ABC News", "description": "The number of new coronavirus cases recorded in Victoria remains low, but authorities are still concerned about a growing cluster at a private psychiatric clinic.", "url": "https://www.abc.net.au/news/2020-04-25/victoria-coronavirus-cases/12185162", "urlToImage": null, "publishedAt": "2020-04-25T05:13:25Z", "content": "Updated \r\nApril 25, 2020 15:23:56\r\nVictoria has confirmed three more coronavirus cases, including one linked to a private psychiatric clinic which has been at the centre of a recent outbreak.\r\nKey points:\r\n<ul><li>The coronavirus cluster at the Albert Road Cl… [+5215 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Sarah McPhee", "title": "New test hot spot in 'desperate' state - Gympie Times", "description": "Coronavirus NSW: 'Desperate' state tests for COVID-19 in Blue Mountains", "url": "https://www.news.com.au/national/nsw-act/news/coronavirus-nsw-desperate-state-tests-for-covid19-in-blue-mountains/news-story/f6b83a5ea32f37a8bae2afb30bf32928", "urlToImage": null, "publishedAt": "2020-04-25T04:35:00Z", "content": "Health authorities in NSW are desperate to get much more testing done after recording 12 more cases of COVID-19.It is a significant chunk of the country’s new cases given Australia has recorded less than 50 cases each day over the past seven days.\r\nQueensland… [+2984 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": "Jane Hansen", "title": "Risky business: 100 jobs most at risk of COVID-19 - Balonne Beacon", "description": "They are the 100 occupations most at risk of contracting COVID-19. And while some are obvious given their exposure to people, others far less so.", "url": "https://www.dailytelegraph.com.au/coronavirus/dentists-doctors-registered-nurses-most-at-risk-of-catching-covid19/news-story/880ffd1dc28abcf3c5b26fe6e16d773f", "urlToImage": null, "publishedAt": "2020-04-25T03:21:02Z", "content": "While doctors and nurses are the heroes on the front line, risking greater exposure to coronavirus, many other occupations also have risk and analysts have crunched the data into an occupation risk score.\r\nThe US-based Occupation Information Network has found… [+4558 chars]"}, {"source": {"id": null, "name": "Centralwesterndaily.com.au"}, "author": null, "title": "One active coronavirus case remains in Orange, no new cases reported - Central Western Daily", "description": "\"The best thing everyone can do at this point is to stay at home unless it is absolutely essential.\"", "url": "https://www.centralwesterndaily.com.au/story/6735131/no-new-coronavirus-cases-in-region-one-case-still-active-in-orange/", "urlToImage": null, "publishedAt": "2020-04-25T02:55:00Z", "content": ""}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Leak reveals UK was 'warned of virus' - Big Rigs", "description": "A leaked document has revealed UK ministers were warned about the an impending pandemic last year and were told to stockpile PPE.", "url": "https://www.news.com.au/world/europe/coronavirus-uk-warned-of-virus-last-year-leaked-document-reveals/news-story/40a62e703cde27ad5b3f17510c901f32", "urlToImage": null, "publishedAt": "2020-04-25T02:52:18Z", "content": "UK ministers were warned about the risk of coronavirus last year and told to stockpile PPE, a leaked document has revealed.\r\nThe detailed Cabinet Office document claimed a pandemic could cost tens of thousands of lives and demanded \"capability requirements\" t… [+2774 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Summer Woolley", "title": "Coronavirus Australia: Further cases recorded at Anglicare’s Newmarch House facility - 7NEWS.com.au", "description": "It comes as authorities reveal another aged care worker at a separate facility had become symptomatic.", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-australia-further-cases-recorded-at-anglicares-newmarch-house-facility-c-998878", "urlToImage": null, "publishedAt": "2020-04-25T02:37:42Z", "content": "A Sydney aged care facility has recorded a further four cases of COVID-19 in the last 24 hours.\r\nAnglicares Newmarch House facility has recorded a total of 48 cases of coronavirus including 17 staff members and 31 residents, NSW Health Minister Brad Hazzard s… [+1519 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Candace Sutton", "title": "Coronavirus: How it kills in ‘ferocious rampage’ from brain to toes - NEWS.com.au", "description": "How COVID-19 kills in ‘ferocious rampage from brain to toes’", "url": "https://www.news.com.au/world/coronavirus/health/how-covid19-kills-in-ferocious-rampage-from-brain-to-toes/news-story/76f8edff42d1302b2c9acc8211547ea6", "urlToImage": null, "publishedAt": "2020-04-25T02:03:37Z", "content": "COVID-19 kills in a ferocious rampage through the body from brain to toes doctors have explained, saying the virus acts like no pathogen humanity has ever seen.In an article in sciencemag.org, frontline clinicians caring for the five per cent who become criti… [+7241 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Baked beans an unlikely nutrition star, and pandemic hit - Health - ABC News", "description": "While baked beans might not look particularly sexy, they're a favourite among nutrition experts. Here's why.", "url": "https://www.abc.net.au/news/health/2020-04-25/baked-beans-an-unlikely-nutrition-star/12176974", "urlToImage": null, "publishedAt": "2020-04-25T00:17:11Z", "content": "As we all fight our inner \"prepper\" and try not to succumb to panic buying, it seems many of us have turned to an old favourite: baked beans.\r\nBean production at Australia's largest fruit and vegetable cannery in Shepparton, Victoria, has doubled its usual vo… [+5001 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Could warm weather help contain pandemic? - 7NEWS.com.au", "description": "Scientists aren't certain about the link between colder conditions and the spread of coronavirus, but are hoping the northern summer will see the outbreak ease.", "url": "https://7news.com.au/news/health/could-warm-weather-help-contain-pandemic-c-998765", "urlToImage": null, "publishedAt": "2020-04-25T00:08:56Z", "content": "As the seasons change in the northern and southern hemispheres, questions are being asked about the influence of weather in the spread of coronavirus, which has killed more than 190,000 people and sent the global economy into a tailspin.\r\nHere's what we know … [+3556 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Dozens of refugee women make, donate masks during coronavirus pandemic - WGN News", "description": "Over the last couple of weeks, dozens of refugee women have been turning scraps of fabric into masks and gifting them to others, but with a common thread.", "url": "https://www.youtube.com/watch?v=EUIjgeNN-ng", "urlToImage": null, "publishedAt": "2020-04-24T23:55:31Z", "content": "Over the last couple of weeks, dozens of refugee women have been turning scraps of fabric into masks and gifting them to others, but with a common thread."}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Navy veteran recovering from COVID-19 after spending 18 days on a ventilator - FOX 8 News Cleveland", "description": "For 18 days, Loretta Novitskey sat by her telephone wondering if she would ever be able to talk to the love of her life again.", "url": "https://www.youtube.com/watch?v=KXkTYXP_p98", "urlToImage": null, "publishedAt": "2020-04-24T23:12:17Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Tariq Tahir", "title": "James Bulger killer Jon Venables launches bid for early release from jail sentence for possessing child abuse - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11476757/james-bulger-jon-venables-early-release-jail/", "urlToImage": null, "publishedAt": "2020-04-24T22:51:11Z", "content": "ONE of James Bulgers killers has applied for early release from prison where he is serving  a sentence for possessing indecent pictures of children.\r\nJon Venables was aged 10 when he and and Robert Thompson snatched James from a shopping centre in Bootle, Mer… [+2347 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "NBC", "title": "Coronavirus update: US study reveals common medical conditions in sickest COVID-19 patients - 7NEWS.com.au", "description": "Researchers have issued a warning to those with the health problems to be hyper-aware of new or unusual symptoms.", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-update-us-study-reveals-common-medical-conditions-in-sickest-covid-19-patients-c-998646", "urlToImage": null, "publishedAt": "2020-04-24T22:49:11Z", "content": "People with obesity, diabetes and high blood pressure are at greater risk for complications from coronavirus, according to a large study of patients hospitalised with the illness it causes.\r\nThe findings, published on Wednesday in the Journal of the American … [+2322 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Researchers Studying Hydroxychloroquine As Coronavirus Treatment - WJZ", "description": "Researchers at the University of Maryland School of Medicine are testing the effectiveness of the malaria drug hydroxychloroquine as a possible treatment for...", "url": "https://www.youtube.com/watch?v=LrQBPFvq9Y8", "urlToImage": null, "publishedAt": "2020-04-24T21:54:00Z", "content": "Researchers at the University of Maryland School of Medicine are testing the effectiveness of the malaria drug hydroxychloroquine as a possible treatment for the coronavirus."}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Sydney doctor Edward O’Neill in UK coronavirus vaccine trial - 7NEWS.com.au", "description": "Edward O'Neill believes taking part in a UK coronavirus vaccine trial is the right thing to do but admits he's taking a \"walk in faith\".", "url": "https://7news.com.au/lifestyle/health-wellbeing/aussie-to-walk-in-faith-in-vaccine-trial-c-998463", "urlToImage": null, "publishedAt": "2020-04-24T21:49:15Z", "content": "An Australian man who is testing a potential coronavirus vaccine in the UK says he is taking a walk in faith.\r\nDr Edward ONeill was one of the first two people injected as part of trials for a potential vaccine that has been developed by Oxford University.\r\nT… [+1441 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus Update: New Antibody Testing Site Opens In Sunset Park, Brooklyn - CBS New York", "description": "A new COVID-19 antibody testing site is now open in Brooklyn.", "url": "https://www.youtube.com/watch?v=pmtcbUHGXEA", "urlToImage": null, "publishedAt": "2020-04-24T21:15:39Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Olivia Willis", "title": "When coronavirus patients suddenly decline, their own immune system might be to blame - ABC News", "description": "In some cases of COVID-19, it may be the body's response to the virus, rather than the virus itself, that ultimately causes harm.", "url": "https://www.abc.net.au/news/health/2020-04-25/coronavirus-covid-immune-response-causes-harm/12176872", "urlToImage": null, "publishedAt": "2020-04-24T20:30:29Z", "content": "It's been described as the \"second week crash\".\r\nAbout seven days after developing symptoms of COVID-19, some people even those with mild symptoms can suddenly start to deteriorate, often with little warning.\r\n\"They end up getting admitted to hospital, and ab… [+6217 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Katie Jennings", "title": "MIT Spinoff Raises $4.2 Million To Estimate Scope Of Coronavirus Cases By Analyzing Poop - Forbes", "description": "Biobot Analytics co-founders, Mariana Matus and Newsha Ghaeli, are analyzing sewage data to help communities detect COVID-19 spread.", "url": "https://www.forbes.com/sites/katiejennings/2020/04/24/mit-spinoff-raises-42-million-to-estimate-scope-of-coronavirus-cases-by-analyzing-wastewater/", "urlToImage": null, "publishedAt": "2020-04-24T20:28:40Z", "content": "Biobot Analytics co-founders Mariana Matus (L) and Newsha Ghaeli (R) in their lab in Somerville, MA.\r\nBiobot Analytics\r\nMariana Matus says she learned firsthand what it meant not to have access to healthcare services growing up in an economically disadvantage… [+5470 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "Experts demolish studies suggesting COVID-19 is no worse than flu - Ars Technica", "description": "Authors of widely publicized antibody studies “owe us all an apology,” one expert says.", "url": "https://arstechnica.com/science/2020/04/experts-demolish-studies-suggesting-covid-19-is-no-worse-than-flu/", "urlToImage": null, "publishedAt": "2020-04-24T17:33:00Z", "content": "Enlarge/ A COVID-19 blood test is administered outside of Delmont Medical Care on April 22, 2020 in Franklin Square, New York. The test identifies antibodies to the coronavirus. \r\n135 with 85 posters participating\r\nFrustrated statisticians and epidemiologists… [+9053 chars]"}, {"source": {"id": null, "name": "Standard.net.au"}, "author": "Andi Yu", "title": "New Vic laws and virus outbreak probe - Warrnambool Standard", "description": "Emergency laws to combat the effects of coronavirus on the Victorian economy and the investigation of an outbreak at a Melbourne psychiatric facility are the...", "url": "https://www.standard.net.au/story/6734968/new-vic-laws-and-virus-outbreak-probe/?cs=10264", "urlToImage": null, "publishedAt": "2020-04-24T17:31:40Z", "content": ""}, {"source": {"id": "xinhua-net", "name": "Xinhua Net"}, "author": null, "title": "Spotlight: UK pushes forward coronavirus vaccine trial amid increasing pandemic death toll - Xinhua | English.news.cn - Xinhua", "description": null, "url": "http://www.xinhuanet.com/english/2020-04/25/c_139005832.htm", "urlToImage": null, "publishedAt": "2020-04-24T16:18:29Z", "content": "A staff member of the National Health Service (NHS) claps outside Royal Berkshire Hospital during the weekly \"Clap for Our Carers\" campaign in Reading, Britain on April 23, 2020. (Photo by Tim Ireland/Xinhua)\r\nMedical experts said only a valid vaccine or high… [+6258 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Jon Henley", "title": "Sweden queries basis of lockdowns as Germany keeps its guard up - The Guardian", "description": "Looser regime means Sweden is better placed to face second wave, says chief epidemiologist", "url": "https://www.theguardian.com/world/2020/apr/24/sweden-queries-basis-of-lockdowns-as-germany-keeps-its-guard-up", "urlToImage": null, "publishedAt": "2020-04-24T15:55:49Z", "content": "Sweden questioned the scientific basis of other EU countries strict coronavirus lockdowns as Germany said its number of cases needed to fall from about 2,000 to a few hundred a day before it could ease restrictions further.\r\nAs several European countries cont… [+4375 chars]"}, {"source": {"id": null, "name": "Guernseypress.com"}, "author": null, "title": "Coronavirus patient told fiancee 'thank you for the best life' before dying - Guernsey Press", "description": "Richard McKeag was working on-call care support shifts before he contracted Covid-19.", "url": "https://guernseypress.com/news/uk-news/2020/04/24/coronavirus-patient-told-fiancee-thank-you-for-the-best-life-before-dying/", "urlToImage": null, "publishedAt": "2020-04-24T14:59:00Z", "content": "A 29-year-old man who died after testing positive for coronavirus messaged his fiancee to say thank you for the best life before he was put into a coma.\r\nRichard McKeag, known as Ricky, had been working on-call care support shifts before he contracted Covid-1… [+2449 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "Premature Baby Contracts CCP Virus and Recovers, Becoming One of UK’s Youngest Survivors - The Epoch Times", "description": "A premature baby girl, believed to be Scotland's youngest CCP virus patient, has recovered to the great relief ...", "url": "https://www.theepochtimes.com/premature-baby-contracts-ccp-virus-and-recovers-becoming-one-of-uks-youngest-survivors_3322621.html", "urlToImage": null, "publishedAt": "2020-04-24T14:46:36Z", "content": "A premature baby girl, believed to be Scotland’s youngest CCP virus patient, has recovered to the great relief of her parents and her medical team. Now, the baby’s mother hopes that sharing their story will help reassure anxious expectant parents who might ne… [+3945 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Chris Smith", "title": "The most unusual coronavirus symptom is also the most dangerous - BGR", "description": "The newest observed coronavirus symptom is also the most dangerous one and can appear in patients who don’t even experience other symptoms. Doctors have noticed an increase in strokes caused by blood clots in young adults, who might be reluctant to seek medic…", "url": "https://bgr.com/2020/04/24/coronavirus-symptoms-stroke-after-blood-clots-in-young-patients/", "urlToImage": null, "publishedAt": "2020-04-24T14:02:10Z", "content": "<ul><li>The newest observed coronavirus symptom is also the most dangerous one and can appear in patients who don’t even experience other symptoms.</li><li>Doctors have noticed an increase in strokes caused by blood clots in young adults, who might be relucta… [+3622 chars]"}, {"source": {"id": null, "name": "Northernstar.com.au"}, "author": "Marc Stapelberg, Marc Stapelberg", "title": "Local clinicians welcome increased COVID-19 testing in NSW - Ballina Shire Advocate", "description": "‘INCREASING testing capacity will allow the community to get back towards normality faster’`", "url": "https://www.northernstar.com.au/news/local-clinicians-welcome-increased-covid-19-testin/4002050/", "urlToImage": null, "publishedAt": "2020-04-24T14:00:00Z", "content": "THE NSW Government has announced there is now capacity to double the number of COVID-19 tests in the state from around 4000 tests per day to 8000.\r\nPatients can get a referral for testing from their GP, then go to a pathology lab.\r\nNorthern NSW Local Health D… [+2053 chars]"}, {"source": {"id": null, "name": "Thenewdaily.com.au"}, "author": null, "title": "Human testing begins with Oxford COVID-19 vaccine and hopes of a big roll-out by September - The New Daily", "description": "Oxford University this week began its human trials for a COVID-19 vaccine. The researchers believe they could be delivering a million jabs from September.", "url": "https://thenewdaily.com.au/life/wellbeing/2020/04/24/coronavirus-vaccine-september-oxford/", "urlToImage": null, "publishedAt": "2020-04-24T12:15:10Z", "content": "Oxford University this week began its human trials for a COVID-19 vaccine. Of all the vaccine projects underway, none has been talked up so boldly. The researchers believe they could be delivering a million jabs from September.\r\nIt’s not all talk. Those milli… [+3916 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Aussies should brace for rolling lockdowns in years ahead - Big Rigs", "description": "Australia is preparing to cautiously lift the first virus restrictions next week – but a return to “normal” could still be years away.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-aussies-should-brace-for-rolling-lockdowns-in-years-ahead/news-story/8847b0e8f896994785239983a0e91880", "urlToImage": null, "publishedAt": "2020-04-24T11:15:08Z", "content": "ANALYSIS\r\nBrace yourselves: We're going to need more lockdowns to get on top of COVID-19.\r\nEconomists used to dream of exponential growth in relation to the economy. But that same explosive effect seems set to doom us to rolling lockdowns for years to come.\r\n… [+5660 chars]"}, {"source": {"id": null, "name": "Bendigoadvertiser.com.au"}, "author": "Natalie Croxon", "title": "Hospital first to use new telehealth platform for COVID-19 patients - Bendigo Advertiser", "description": "The new system allows health practitioners to monitor patients' conditions from afar.", "url": "https://www.bendigoadvertiser.com.au/story/6734213/hospital-first-to-use-new-telehealth-platform-for-covid-19-patients/", "urlToImage": null, "publishedAt": "2020-04-24T08:00:00Z", "content": ""}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/christina-zhou/9076506", "title": "Why are Western countries being hit harder than East Asian countries by coronavirus? - ABC News", "description": "Here we take a look at how the East has managed the outbreak compared to the West, and why the latter struggled to get a head start.", "url": "https://www.abc.net.au/news/2020-04-24/coronavirus-response-in-china-south-korea-italy-uk-us-singapore/12158504", "urlToImage": null, "publishedAt": "2020-04-24T07:49:55Z", "content": "Posted \r\nApril 24, 2020 09:49:16\r\nWhen the coronavirus initially swept across the East first China, then Thailand, Japan, and South Korea the Western countries watched on cautiously from the other side of the globe.\r\nKey points:\r\n<ul><li>Singapore, South Kore… [+14224 chars]"}, {"source": {"id": null, "name": "Denipt.com.au"}, "author": null, "title": "Install virus app to aid health carers: PM - Deniliquin Pastoral Times", "description": "", "url": "https://www.denipt.com.au/national/2020/04/24/1143612/install-virus-app-to-aid-health-carers-pm", "urlToImage": null, "publishedAt": "2020-04-24T06:46:30Z", "content": "Scott Morrison has conceded the government might not meet its goal for Australians downloading its coronavirus surveillance software.The prime minister says the app will be released imminently and is urging everyone to support the national efforts to suppress… [+2442 chars]"}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": "Simon Bourke", "title": "Lifeline picks up the phone in an age of loneliness as more than ever before call - Newcastle Herald", "description": "\"There are people out there, and the call they make to Lifeline is the only conversation they have all week.\"", "url": "https://www.canberratimes.com.au/story/6734221/covid-19-sparks-highest-ever-demand-for-lifeline-help/", "urlToImage": null, "publishedAt": "2020-04-24T06:30:00Z", "content": ""}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Scientists uncover evidence coronavirus could trigger diabetes in healthy adults - SBS News", "description": "A new study involving Australian researchers has found there is evidence COVID-19 could be causing diabetes in otherwise healthy adults.", "url": "https://www.sbs.com.au/news/scientists-uncover-evidence-coronavirus-could-trigger-diabetes-in-healthy-adults", "urlToImage": null, "publishedAt": "2020-04-24T06:10:00Z", "content": "Coronavirus may be triggering diabetes in typically healthy adults.\r\nElderly Australians with diabetes are also at an increased risk from coronavirus, a study released on Friday shows.\r\nCo-author and Monash University professor Paul Zimmet said diabetic child… [+2582 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Two pet cats contract coronavirus - Daily Mercury", "description": "Two pet cats from different homes have contracted the coronavirus with one believed to have caught the virus from someone other than its owner.", "url": "https://www.news.com.au/lifestyle/health/health-problems/two-pet-cats-contract-coronavirus-in-new-york-city/news-story/88a58061054ea124b819ddeaea6f6ec6", "urlToImage": null, "publishedAt": "2020-04-24T05:55:00Z", "content": "Those nine lives might come in handy.\r\nTwo pet cats in New York state in the US have tested positive for the coronavirus, in the first diagnoses of domestic animals on American soil, a report said this week.\r\nIt's believed that the cats contracted the illness… [+1572 chars]"}, {"source": {"id": null, "name": "Armidaleexpress.com.au"}, "author": "Newsroom", "title": "Coronavirus pandemic: Armidale Hospital opening COVID-19 testing blitz - Armidale Express", "description": "Armidale Hospital opening COVID-19 testing blitz", "url": "https://www.armidaleexpress.com.au/story/6734597/why-covid-19-testing-blitz-is-coming-to-armidale/", "urlToImage": null, "publishedAt": "2020-04-24T05:30:00Z", "content": ""}, {"source": {"id": null, "name": "Goondiwindiargus.com.au"}, "author": "Michael Ramsey", "title": "Artania passenger dies of virus in WA - Goondiwindi Argus", "description": "A fourth person from the now-departed Artania cruise ship has died of coronavirus in Western Australia, taking the state's toll to eight. Health Minister Roge...", "url": "https://www.goondiwindiargus.com.au/story/6733620/artania-passenger-dies-of-virus-in-wa/?cs=9397", "urlToImage": null, "publishedAt": "2020-04-24T05:16:34Z", "content": "A fourth person from the now-departed Artania cruise ship has died of coronavirus in Western Australia, taking the state's toll to eight.\r\nHealth Minister Roger Cook says the German passenger, a man in his 70s, died in Sir Charles Gairdner Hospital on Thursda… [+2034 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Almost all of these virus patients die - South Burnett Times", "description": "The results of a new hospital study show that when critically ill patients are put on ventilators it is highly unlikely they will survive.", "url": "https://www.news.com.au/lifestyle/health/health-problems/almost-90-per-cent-of-coronavirus-patients-put-on-ventilators-die/news-story/7d95181220848cd1d95d68319f160c2b", "urlToImage": null, "publishedAt": "2020-04-24T02:07:00Z", "content": "New research shows that critically ill coronavirus patients who are put on ventilators have a very poor chance of surviving.\r\nA newly published study revealed 90 per cent of coronavirus patients who were ventilated in New York City hospitals died, despite a h… [+2176 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Phoebe Loomes", "title": "Almost 90 per cent of coronavirus patients put on ventilators die - NEWS.com.au", "description": "Almost 90 per cent of coronavirus patients put on ventilators die", "url": "https://www.news.com.au/lifestyle/health/health-problems/almost-90-per-cent-of-coronavirus-patients-put-on-ventilators-die/news-story/7d95181220848cd1d95d68319f160c2b", "urlToImage": null, "publishedAt": "2020-04-24T01:47:40Z", "content": "New research shows that critically ill coronavirus patients who are put on ventilators have a very poor chance of surviving.A newly published study revealed 90 per cent of coronavirus patients who were ventilated in New York City hospitals died, despite a hea… [+2231 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "NBC", "title": "Coronavirus in the US: New York firefighter’s baby daughter dies from COVID-19 - 7NEWS.com.au", "description": "The baby girl spent a month in hospital before the virus took her life.", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-in-the-us-new-york-firefighters-baby-daughter-dies-from-covid-19-c-996697", "urlToImage": null, "publishedAt": "2020-04-24T01:27:25Z", "content": "A New York City firefighter and his wife have lost their four-month-old daughter to coronavirus.\r\nJay-Natalie La Santa died on April 20, nearly a month after she was rushed to the hospital with a fever.\r\nShe was very feisty. She was a little Angel with the mo… [+2705 chars]"}, {"source": {"id": null, "name": "Dailymercury.com.au"}, "author": "Melanie Whiting, Melanie Whiting", "title": "Moranbah and Proserpine to receive Covid-19 test centres - Chronicle", "description": "The service is expected to ease strain on local health units.", "url": "https://www.dailymercury.com.au/news/moranbah-and-proserpine-to-receive-covid-19-test-c/4001832/", "urlToImage": null, "publishedAt": "2020-04-24T01:17:00Z", "content": "NEW coronavirus testing centres will be set up in Moranbah and Proserpine after a mutli-million dollar funding boost from mining giant BHP.\r\nThe Covid-19 testing centres, expected to open by the end of May, will ease strain on health services and separate sus… [+1347 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Virus causing strokes in healthy young people - Daily Examiner", "description": "Doctors have sent a warning that coronavirus is causing blood clots and strokes in otherwise young, healthy patients.", "url": "https://www.news.com.au/lifestyle/health/health-problems/doctors-warn-coronavirus-causing-blood-clots-and-sudden-strokes-in-young-healthy-patients/news-story/d9d3f775f84783346d10f47229359e9a", "urlToImage": null, "publishedAt": "2020-04-24T00:38:00Z", "content": "Coronavirus can cause blood clots and sudden strokes in young, healthy patients, doctors have warned.\r\nMedics in New York have seen a sevenfold increase in stroke cases in people in their 30s and 40s who either had mild or no COVID-19 symptoms at all.\r\nIt com… [+3658 chars]"}, {"source": {"id": null, "name": "Dailyherald.com"}, "author": "Dave Oberhelman", "title": "'COVID toes' reported in some patients with the coronavirus - Chicago Daily Herald", "description": "Laying waste to lives and livelihoods, dividing people in regard to \"opening up\" states and economies, the coronavirus again looks to kick us when we're down. With COVID toes.", "url": "https://www.dailyherald.com/news/20200423/covid-toes-reported-in-some-patients-with-the-coronavirus", "urlToImage": null, "publishedAt": "2020-04-23T23:41:15Z", "content": "Just great.\r\nLaying waste to lives and livelihoods, dividing people in regard to \"opening up\" states and economies, the coronavirus again looks to kick us when we're down.\r\nWith COVID toes.\r\nYes, COVID toes, a term given to discolored toes reported in some pa… [+3192 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Will Pavia, David Charter, Henry Zeffman", "title": "Only a tenth of New York ventilator patients survive coronavirus - The Times", "description": "Little more than a tenth of Covid-19 patients who have been put on ventilators survive, according to the largest and most comprehensive study of sufferers in the United States who were admitted to", "url": "https://www.thetimes.co.uk/article/only-a-tenth-of-new-york-ventilator-patients-survive-coronavirus-920vg6dtp", "urlToImage": null, "publishedAt": "2020-04-23T23:01:00Z", "content": "Little more than a tenth of Covid-19 patients who have been put on ventilators survive, according to the largest and most comprehensive study of sufferers in the United States who were admitted to hospital.\r\nVentilators have been held up as the last hope for … [+492 chars]"}, {"source": {"id": null, "name": "Thelancet.com"}, "author": null, "title": "Practical recommendations for the management of diabetes in patients with COVID-19 - The Lancet", "description": "Diabetes is one of the most important comorbidities linked to the severity of all\nthree known human pathogenic coronavirus infections, including severe acute respiratory\nsyndrome coronavirus 2. Patients with diabetes have an increased risk of severe complicat…", "url": "https://www.thelancet.com/journals/landia/article/PIIS2213-8587(20)30152-2/fulltext", "urlToImage": null, "publishedAt": "2020-04-23T22:31:17Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. By continuing you agree to the use of cookies.\r\nCopyright © 2020 Elsevier Inc. except certain content provided by third parties.\r\nPrivacy Policy   Terms and Conditions"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "7NEWS", "title": "British mum, 29, with ‘mild’ coronavirus dies six days after giving birth - 7NEWS.com.au", "description": "Tragically the new mum was never able to see her baby and only saw pictures of him before she passed away.", "url": "https://7news.com.au/lifestyle/health-wellbeing/british-mum-29-with-mild-coronavirus-dies-six-days-after-giving-birth-c-996409", "urlToImage": null, "publishedAt": "2020-04-23T21:59:18Z", "content": "The family of a British mother who died in hospital six days after giving birth have spoken of their devastation.\r\nFozia Hanif, who had tested positive for coronavirus, died at Birminghams Heartlands Hospital on April 8 after her condition deteriorated follow… [+2875 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "CDC Director Clarifies Coronavirus Comments - HuffPost", "description": "President Donald Trump said Dr. Robert Redfield was misquoted about the coronavirus resurging in the fall, but the CDC director said his interview with The W...", "url": "https://www.youtube.com/watch?v=XhPtzNbO8iI", "urlToImage": null, "publishedAt": "2020-04-23T21:33:39Z", "content": "President Donald Trump said Dr. Robert Redfield was misquoted about the coronavirus resurging in the fall, but the CDC director said his interview with The Washington Post was accurate. \r\nSubscribe to HuffPost today: http://goo.gl/xW6HGSupport our work: https… [+134 chars]"}, {"source": {"id": null, "name": "Unsw.edu.au"}, "author": "z3525182", "title": "Vital Signs: Models show the coronavirus app needs a big take-up, economics tells us how to get it - UNSW Newsroom", "description": "For the app to work well, we might need an 80% take-up. Unless it is made mandatory, we'll need both private and social incentives.", "url": "https://newsroom.unsw.edu.au/news/business-law/vital-signs-models-show-coronavirus-app-needs-big-take-economics-tells-us-how-get", "urlToImage": null, "publishedAt": "2020-04-23T21:22:00Z", "content": "For the app to work well, we might need an 80% take-up. Unless it is made mandatory, we'll need both private and social incentives.With Australias test-confirmed daily COVID-19 infection rates continuing to fall to relatively low levels, there is considerable… [+4258 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "Most NYC Virus Patients Had Underlying Health Issues, Study Shows - The Epoch Times", "description": "Most patients in New York City hospitalized with the CCP virus suffered from at least one underlying health issue, such as obesity or kidney disease.", "url": "https://www.theepochtimes.com/most-new-york-virus-patients-had-underlying-health-issue-study_3324097.html", "urlToImage": null, "publishedAt": "2020-04-23T21:17:16Z", "content": "Most patients in New York City hospitalized with the CCP virus suffered from one or more underlying health issues, such as obesity or kidney disease, according to a new study.\r\nResearchers analyzed records from 5,700 patients and found more than 56 percent su… [+3603 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Vanessa Chalmers Health Reporter For Mailonline", "title": "Coronavirus is unlikely to be spread through semen, scientists say - but they can't rule it out - Daily Mail", "description": "A study examined semen samples of 34 men in China who had suffered with mild COVID-19 a month prior. Researchers did not find any evidence of the virus in semen.", "url": "https://www.dailymail.co.uk/news/article-8249269/Coronavirus-unlikely-spread-semen-scientists-say-rule-out.html", "urlToImage": null, "publishedAt": "2020-04-23T20:25:15Z", "content": "Coronavirus is unlikely to be spread through sex, scientists say - but they admit they can't rule it out completely. \r\nSemen samples of 34 men in China who had been diagnosed with mild symptoms of COVID-19 a month prior were analysed. Their tests were negativ… [+8598 chars]"}, {"source": {"id": null, "name": "Komonews.com"}, "author": "Denise Whitaker", "title": "New COVID-19 side effect in people under 50 - KATU", "description": "Doctors in New York say a growing number of their coronavirus patients in their 30s and 40s are suffering sudden strokes. This new side effect comes from the staff at Mt Sinai Health, after seeing blood clot in unusual ways in these younger patients who were …", "url": "http://komonews.com/news/local/new-covid-19-side-effect-in-people-under-50", "urlToImage": null, "publishedAt": "2020-04-23T18:09:00Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Blood Clots a New Surprise Side Effect in Coronavirus Patients | NBC10 Philadelphia - NBC10 Philadelphia", "description": "Doctors are noticing a new trend in COVID-19 patients in the form of blood clots. NBC10’s Matt DeLucia spoke with two local doctors about what they’re seeing...", "url": "https://www.youtube.com/watch?v=t2Bu8mqxwrg", "urlToImage": null, "publishedAt": "2020-04-23T17:56:50Z", "content": "Doctors are noticing a new trend in COVID-19 patients in the form of blood clots. NBC10s Matt DeLucia spoke with two local doctors about what theyre seeing at hospitals. \r\n_____\r\nSUBSCRIBE TO NBC10: VISIT the NBC10 channel for the latest news and exclusive re… [+437 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "French village bids adieu to doctor who succumbed to COVID-19 - Reuters", "description": "In Villers-Outreaux's village square, doctors, nurses and patients gathered, heads bowed and standing apart, to bid farewell to a local practitioner who succumbed to the new coronavirus.", "url": "https://www.reuters.com/article/us-health-coronavirus-france-doctor-fune-idUSKCN225337", "urlToImage": null, "publishedAt": "2020-04-23T17:24:00Z", "content": "VILLERS-OUTREAUX, France (Reuters) - In Villers-Outreaux’s village square, doctors, nurses and patients gathered, heads bowed and standing apart, to bid farewell to a local practitioner who succumbed to the new coronavirus. \r\nPhilippe Lerche, 63, died on Sund… [+1054 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "New York study finds worrying fatality rate on COVID-19 patients on ventilators - CGTN", "description": "", "url": "https://newsaf.cgtn.com/news/2020-04-24/NY-study-finds-worrying-death-rate-on-COVID-19-patients-on-ventilators-PVY9Kci5pK/index.html", "urlToImage": null, "publishedAt": "2020-04-23T17:16:15Z", "content": "Nearly all COVID-19 patients who needed ventilators in New York's largest health system to help them breathe died, a study found.\r\nThe study found that 88 percent of the patients placed on the breathing aids at Northwell Health died, while overall about 20% p… [+934 chars]"}, {"source": {"id": null, "name": "Pmnewsnigeria.com"}, "author": null, "title": "Doctors discover new symptom of coronavirus - P.M. News", "description": "Doctors in the U.S., the world's worst hit country by the coronavirus have found a new symptom for the virus.", "url": "https://www.pmnewsnigeria.com/2020/04/23/doctors-discover-new-symptom-of-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-23T17:02:35Z", "content": "A blistered, swollen toe: sign of the coronavirus\r\nDoctors in the U.S., the worlds worst hit country by the coronavirus have found a new symptom for the virus.\r\nThe symptom lies in the toes or fingers of the afflicted, especially in white people.\r\nIt is calle… [+1258 chars]"}, {"source": {"id": null, "name": "Clicklancashire.com"}, "author": null, "title": "Doctors Warn CCP Virus Might Cause Strokes in Young Adults - ClickLancashire", "description": "", "url": "https://clicklancashire.com/2020/04/23/doctors-warn-ccp-virus-might-cause-strokes-in-young-adults.html", "urlToImage": null, "publishedAt": "2020-04-23T16:49:09Z", "content": "Approximately 12 per cent of patients in the study needed ventilators, CNN reports. Another 41 percent had obesity, while 33 percent suffered from diabetes.\r\nDr. Terry Tsue, vice president of Clinical Services and physician in chief at the University of Kansa… [+2001 chars]"}, {"source": {"id": null, "name": "Marketresearchwriteup.com"}, "author": null, "title": "Oximeter proves to be lifesaving software for coronavirus sufferers because it helps stop loss of life by 'silent' hypoxia - Market Research Writeup", "description": null, "url": "https://www.marketresearchwriteup.com/2020/04/23/oximeter-proves-to-be-lifesaving-software-for-coronavirus-sufferers-because-it-helps-stop-loss-of-life-by-silent-hypoxia/", "urlToImage": null, "publishedAt": "2020-04-23T15:49:38Z", "content": "AN OXIMETER may quickly grow to be extra widespread than a thermometer in most properties as many high docs are touting its significance in assessing the harm coronavirus has accomplished to sufferers.\r\nIt’s a mechanism that’s used to measure the quantity of … [+2887 chars]"}, {"source": {"id": null, "name": "Straitstimes.com"}, "author": "hermesauto", "title": "Coronavirus: As virus advances, doctors rethink rush to ventilate - The Straits Times", "description": "BERLIN (REUTERS) - When he was diagnosed with Covid-19, Andre Bergmann knew exactly where he wanted to be treated: the Bethanien hospital lung clinic in Moers, near his home in northwestern Germany.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/world/coronavirus-as-virus-advances-doctors-rethink-rush-to-ventilate", "urlToImage": null, "publishedAt": "2020-04-23T15:34:38Z", "content": "BERLIN (REUTERS) - When he was diagnosed with Covid-19, Mr Andre Bergmann knew exactly where he wanted to be treated: the Bethanien hospital lung clinic in Moers, near his home in north-western Germany.\r\nThe clinic is known for its reluctance to put patients … [+16566 chars]"}, {"source": {"id": null, "name": "News4jax.com"}, "author": "Maggie Fox", "title": "Covid-19 causes sudden strokes in young adults, doctors say - WJXT News4JAX ", "description": "The new coronavirus appears to be causing sudden strokes in adults in their 30s and 40s who are not otherwise terribly ill, doctors reported Wednesday.", "url": "https://www.news4jax.com/health/2020/04/23/covid-19-causes-sudden-strokes-in-young-adults-doctors-say/", "urlToImage": null, "publishedAt": "2020-04-23T15:08:17Z", "content": "The new coronavirus appears to be causing sudden strokes in adults in their 30s and 40s who are not otherwise terribly ill, doctors reported Wednesday.\r\nThey said patients may be unwilling to call 911 because they have heard hospitals are overwhelmed by coron… [+2610 chars]"}, {"source": {"id": null, "name": "Kron4.com"}, "author": "Alexa Mae Asperin", "title": "Doctors warn of new coronavirus symptom in young adults - KRON4", "description": "Oxley said his team urged people to watch themselves for symptoms of coronavirus and to call 911 if they believe they’ve suffered a stroke.", "url": "https://www.kron4.com/health/coronavirus/doctors-warn-of-new-coronavirus-symptom-in-young-adults/", "urlToImage": null, "publishedAt": "2020-04-23T14:32:00Z", "content": "SAN FRANCISCO (KRON) – Doctors are warning of a new coronavirus symptom showing up in young adults. \r\nCNN reports doctors at Mount Sinai Health System in New York believe there is growing evidence that coronavirus may cause sudden strokes in adults in their 3… [+1322 chars]"}, {"source": {"id": null, "name": "Newstatesman.com"}, "author": null, "title": "Thousands of unexplained extra deaths are happening per week during the Covid-19 outbreak. Why? - New Statesman", "description": "Every week as the coronavirus outbreak continues, hundreds, and now thousands, more people are dying than we would normally expect in normal times. The death rate in the UK is now at its highest for more than 20 years, 75 per cent above the five-year average,…", "url": "https://www.newstatesman.com/science-tech/coronavirus/2020/04/covid-19-coronavirus-deaths-unexplained-extra", "urlToImage": null, "publishedAt": "2020-04-23T10:10:52Z", "content": "Every week as the coronavirus outbreak continues, hundreds, and now thousands, more people are dying than we would normally expect in normal times. The death rate in the UK is now at its highest for more than 20 years, 75 per cent above the five-year average,… [+3508 chars]"}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": "Andrew Brown Dan Jervis-Bardy", "title": "Canberra goes another 24 hours without new coronavirus cases - The Canberra Times", "description": "There has been just one confirmed case in the ACT in the past 10 days.", "url": "https://www.canberratimes.com.au/story/6732911/chief-health-officer-doesnt-want-to-raise-hopes-on-easing-restrictions/", "urlToImage": null, "publishedAt": "2020-04-23T10:00:00Z", "content": "Chief Health Officer Kerryn Coleman Picture: Elesa Kurtz"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ariana Eunjung Cha", "title": "Coronavirus: 88% of Covid-19 patients on ventilators didn’t survive in New York’s hospital system, study finds - The Independent", "description": "This compares with the roughly 80 per cent of patients who died on ventilators before the pandemic, according to previous studies", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-us-new-york-hospital-ventilator-death-rate-latest-a9479411.html", "urlToImage": null, "publishedAt": "2020-04-23T09:20:00Z", "content": "Throughout March, as the pandemic gained momentum in the United States, much of the preparations focused on the breathing machines that were supposed to save everyones lives.\r\nNew York State Gov. Andrew Cuomo and President Donald Trump sparred over how many v… [+3229 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Family's plea after two-year-old's death - Whitsunday Times", "description": "Little Sofie DeLuis’s flu shot this year was a “bittersweet” moment for her parents who are still grieving the loss of their other daughter.", "url": "https://www.news.com.au/lifestyle/real-life/news-life/influenza-vaccine-familys-powerful-photo-after-daughters-flu-death/news-story/6ab8b43cb585017cba2d28af6efdfcb0", "urlToImage": null, "publishedAt": "2020-04-23T08:17:00Z", "content": "Heartbroken parents who lost their two-year-old daughter due to complications from the flu want other families to get their children vaccinated before winter claims another young life.\r\nLucy DeLuis, from the town of Narembeen in Western Australia, died at Per… [+4430 chars]"}]}