{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "7news.com.au"}, "author": "Summer Woolley", "title": "Coronavirus Australia: QLD records two new COVID-19 cases - 7NEWS.com.au", "description": "‘None of this is easy - but it’s worth it. It’s working.’", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-australia-qld-records-two-new-covid-19-cases-c-998951", "urlToImage": null, "publishedAt": "2020-04-25T04:01:41Z", "content": "Queensland has recorded just two new cases of COVID-19 overnight despite record-high testing.\r\nPremier Annastacia Palaszczuk welcomed the encouraging trend and thanked Queenslanders for helping to flatten the curve.\r\nNone of this is easy - but its worth it. I… [+753 chars]"}, {"source": {"id": null, "name": "Centralwesterndaily.com.au"}, "author": null, "title": "One active coronavirus case remains in Orange, no new cases reported - Central Western Daily", "description": "\"The best thing everyone can do at this point is to stay at home unless it is absolutely essential.\"", "url": "https://www.centralwesterndaily.com.au/story/6735131/no-new-coronavirus-cases-in-region-one-case-still-active-in-orange/", "urlToImage": null, "publishedAt": "2020-04-25T02:55:00Z", "content": ""}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Summer Woolley", "title": "Coronavirus Australia: Further cases recorded at Anglicare’s Newmarch House facility - 7NEWS.com.au", "description": "It comes as authorities reveal another aged care worker at a separate facility had become symptomatic.", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-australia-further-cases-recorded-at-anglicares-newmarch-house-facility-c-998878", "urlToImage": null, "publishedAt": "2020-04-25T02:37:42Z", "content": "A Sydney aged care facility has recorded a further four cases of COVID-19 in the last 24 hours.\r\nAnglicares Newmarch House facility has recorded a total of 48 cases of coronavirus including 17 staff members and 31 residents, NSW Health Minister Brad Hazzard s… [+1519 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "COVID-19 kills in 'brain to toe rampage' - Ipswich Advertiser", "description": "Medical experts have described how coronavirus kills its victims in “a ferocious rampage through the body, from brain to toes”.", "url": "https://www.news.com.au/world/coronavirus/health/how-covid19-kills-in-ferocious-rampage-from-brain-to-toes/news-story/76f8edff42d1302b2c9acc8211547ea6", "urlToImage": null, "publishedAt": "2020-04-25T02:28:00Z", "content": "COVID-19 kills \"in a ferocious rampage through the body from brain to toes\" doctors have explained, saying the virus \"acts like no pathogen humanity has ever seen\".\r\nIn an article in sciencemag.org, frontline clinicians caring for the five per cent who become… [+7313 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": null, "title": "Coronavirus: Five new cases, one death, as recoveries surge to 77 per cent - Stuff.co.nz", "description": "About 77 per cent of all New Zealand's Covid-19 cases have recovered.", "url": "https://i.stuff.co.nz/national/health/coronavirus/121269987/coronavirus-ministry-of-health-covid19-update", "urlToImage": null, "publishedAt": "2020-04-25T02:15:00Z", "content": "There are five new coronavirus cases in New Zealand, according to the Ministry of Health.\r\n One other person, a woman in her 70s, has also died, bringing the country's Covid-19 death toll to 18. \r\n New Zealand's recovery rate continues to increase with about … [+2927 chars]"}, {"source": {"id": null, "name": "Globaltimes.cn"}, "author": null, "title": "UK pushes forward coronavirus vaccine trial amid increasing pandemic death toll - Global Times", "description": "After implementing social distancing measures for weeks, Britain has hit", "url": "https://www.globaltimes.cn/content/1186675.shtml", "urlToImage": null, "publishedAt": "2020-04-25T00:42:44Z", "content": "An ambulance is seen in Oxford, Britain, April 24, 2020. A team at the University of Oxford is starting a coronavirus vaccine trial on humans Thursday. The team started work on developing the vaccine to prevent COVID-19 on Jan. 20, 2020. (Photo by Tim Ireland… [+5600 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Baked beans an unlikely nutrition star, and pandemic hit - Health - ABC News", "description": "While baked beans might not look particularly sexy, they're a favourite among nutrition experts. Here's why.", "url": "https://www.abc.net.au/news/health/2020-04-25/baked-beans-an-unlikely-nutrition-star/12176974", "urlToImage": null, "publishedAt": "2020-04-25T00:17:11Z", "content": "As we all fight our inner \"prepper\" and try not to succumb to panic buying, it seems many of us have turned to an old favourite: baked beans.\r\nBean production at Australia's largest fruit and vegetable cannery in Shepparton, Victoria, has doubled its usual vo… [+5001 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Could warm weather help contain pandemic? - 7NEWS.com.au", "description": "Scientists aren't certain about the link between colder conditions and the spread of coronavirus, but are hoping the northern summer will see the outbreak ease.", "url": "https://7news.com.au/news/health/could-warm-weather-help-contain-pandemic-c-998765", "urlToImage": null, "publishedAt": "2020-04-25T00:08:56Z", "content": "As the seasons change in the northern and southern hemispheres, questions are being asked about the influence of weather in the spread of coronavirus, which has killed more than 190,000 people and sent the global economy into a tailspin.\r\nHere's what we know … [+3556 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Reuters", "title": "What's the next coronavirus front line? Nurses say patients' home as they recover from the hospital - Daily Mail", "description": "A network of New York home care nurses have been dispatched to treat  coronavirus patients recovering at home. Health workers say this home care is the next front line of the  pandemic.", "url": "https://www.dailymail.co.uk/news/article-8254997/Whats-coronavirus-line-Nurses-say-patients-home-recover-hospital.html", "urlToImage": null, "publishedAt": "2020-04-25T00:03:15Z", "content": "Nurse Flora Ajayi parks her car on a residential block in Queens, New York and pops open the trunk, revealing plastic bins full of personal protective gear. \r\nShe dons gloves, a blue gown, two masks, a face shield and shoe covers and turns to enter the home o… [+5820 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "France limits nicotine product sales after research suggests could protect from coronavirus - SBS News", "description": "France has limited the sale of nicotine products following research that suggested nicotine could potentially protect people from coronavirus.", "url": "https://www.sbs.com.au/news/france-limits-nicotine-product-sales-after-research-suggests-could-protect-from-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T00:02:49Z", "content": "France has limited the sale of nicotine substitutes to avoid stockpiling after research suggested the addictive substance could have the potential to protect people from contracting the coronavirus.\r\nThe government said that until 11 May, when the country's l… [+2337 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Navy veteran recovering from COVID-19 after spending 18 days on a ventilator - FOX 8 News Cleveland", "description": "For 18 days, Loretta Novitskey sat by her telephone wondering if she would ever be able to talk to the love of her life again.", "url": "https://www.youtube.com/watch?v=KXkTYXP_p98", "urlToImage": null, "publishedAt": "2020-04-24T23:12:17Z", "content": null}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Ariana Eunjung Cha", "title": "Young and middle-aged people, barely sick with covid-19, are dying from strokes - The Washington Post", "description": "Doctors sound alarm about patients in their 30s and 40s left debilitated or dead by strokes. Some didn’t even know they were infected by coronavirus.", "url": "https://www.washingtonpost.com/health/2020/04/24/strokes-coronavirus-young-patients/", "urlToImage": null, "publishedAt": "2020-04-24T22:36:00Z", "content": "Thomas Oxley wasnt even on call the day he received the page to come into Mount Sinai Beth Israel Hospital in Manhattan. There werent enough doctors to treat all the emergency stroke patients, and he was needed in the operating room.\r\nThe patients chart appea… [+9500 chars]"}, {"source": {"id": null, "name": "Thelancet.com"}, "author": null, "title": "Diagnosing malaria and other febrile illnesses during the COVID-19 pandemic - The Lancet", "description": "As the global malaria community observes World Malaria Day on April 25, 2020, we have\nplenty to celebrate. Yet this year, the coronavirus disease 2019 (COVID-19) outbreak\nis greatly dampening the spirits. While the Asia-Pacific region has made substantial\npro…", "url": "https://www.thelancet.com/journals/langlo/article/PIIS2214-109X(20)30210-2/fulltext", "urlToImage": null, "publishedAt": "2020-04-24T22:33:36Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. By continuing you agree to the use of cookies.\r\nCopyright © 2020 Elsevier Inc. except certain content provided by third parties.\r\nPrivacy Policy   Terms and Conditions"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Sydney doctor Edward O’Neill in UK coronavirus vaccine trial - 7NEWS.com.au", "description": "Edward O'Neill believes taking part in a UK coronavirus vaccine trial is the right thing to do but admits he's taking a \"walk in faith\".", "url": "https://7news.com.au/lifestyle/health-wellbeing/aussie-to-walk-in-faith-in-vaccine-trial-c-998463", "urlToImage": null, "publishedAt": "2020-04-24T21:49:15Z", "content": "An Australian man who is testing a potential coronavirus vaccine in the UK says he is taking a walk in faith.\r\nDr Edward ONeill was one of the first two people injected as part of trials for a potential vaccine that has been developed by Oxford University.\r\nT… [+1441 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "New Victorian coronavirus laws and virus outbreak probe - 7NEWS.com.au", "description": "The Victorian government has made it clear the pandemic is anything but over with new laws and an investigation into an outbreak.", "url": "https://7news.com.au/lifestyle/health-wellbeing/new-vic-laws-and-virus-outbreak-probe-c-998432", "urlToImage": null, "publishedAt": "2020-04-24T21:28:42Z", "content": "Emergency laws to combat the effects of coronavirus on the Victorian economy and the investigation of an outbreak at a Melbourne psychiatric facility are the latest indications the pandemic is far from over.\r\nHealth Minister Jenny Mikakos urged the Victorian … [+1352 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "This retired Marine gave a rousing speech to thank his health care heroes - Good Morning America", "description": "After 13 days in the hospital, 5 in intensive care, Alex Melo wanted to give a heartfelt speech to the medical staff who helped him.", "url": "https://www.youtube.com/watch?v=5axNlsS4yL4", "urlToImage": null, "publishedAt": "2020-04-24T21:09:26Z", "content": null}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Reuters", "title": "Coronavirus and COVID-19: Fact versus fiction - Deccan Herald", "description": "U.S. President Donald Trump's musings about whether disinfectants and ultraviolet light can be inserted into patients' bodies to treat COVID-19 have alarmed doctors and drawn warnings from the makers of Lysol, Dettol and Clorox. Here are some other claims tha…", "url": "https://www.deccanherald.com/science-and-environment/coronavirus-and-covid-19-fact-versus-fiction-829603.html", "urlToImage": null, "publishedAt": "2020-04-24T20:48:45Z", "content": "U.S. President Donald Trump's musings about whether disinfectants and ultraviolet light can be inserted into patients' bodies to treat COVID-19 have alarmed doctors and drawn warnings from the makers of Lysol, Dettol and Clorox.\r\nHere are some other claims th… [+3054 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Olivia Willis", "title": "When coronavirus patients suddenly decline, their own immune system might be to blame - ABC News", "description": "In some cases of COVID-19, it may be the body's response to the virus, rather than the virus itself, that ultimately causes harm.", "url": "https://www.abc.net.au/news/health/2020-04-25/coronavirus-covid-immune-response-causes-harm/12176872", "urlToImage": null, "publishedAt": "2020-04-24T20:30:29Z", "content": "It's been described as the \"second week crash\".\r\nAbout seven days after developing symptoms of COVID-19, some people even those with mild symptoms can suddenly start to deteriorate, often with little warning.\r\n\"They end up getting admitted to hospital, and ab… [+6217 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "Experts demolish studies suggesting COVID-19 is no worse than flu - Ars Technica", "description": "Authors of widely publicized antibody studies “owe us all an apology,” one expert says.", "url": "https://arstechnica.com/science/2020/04/experts-demolish-studies-suggesting-covid-19-is-no-worse-than-flu/", "urlToImage": null, "publishedAt": "2020-04-24T17:33:00Z", "content": "Enlarge/ A COVID-19 blood test is administered outside of Delmont Medical Care on April 22, 2020 in Franklin Square, New York. The test identifies antibodies to the coronavirus. \r\n135 with 85 posters participating\r\nFrustrated statisticians and epidemiologists… [+9053 chars]"}, {"source": {"id": null, "name": "Standard.net.au"}, "author": "Andi Yu", "title": "New Vic laws and virus outbreak probe - Warrnambool Standard", "description": "Emergency laws to combat the effects of coronavirus on the Victorian economy and the investigation of an outbreak at a Melbourne psychiatric facility are the...", "url": "https://www.standard.net.au/story/6734968/new-vic-laws-and-virus-outbreak-probe/?cs=10264", "urlToImage": null, "publishedAt": "2020-04-24T17:31:40Z", "content": ""}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Strokes in young patients with COVID-19 - 9NEWS", "description": "Doctors in New York are warning that COVID-19 may cause sudden strokes in young adults who aren't severely sick. 9Health Expert Dr. Payal Kohli explains.", "url": "https://www.youtube.com/watch?v=DqpQ2K6xIXM", "urlToImage": null, "publishedAt": "2020-04-24T16:36:18Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Jon Henley", "title": "Sweden queries basis of lockdowns as Germany keeps its guard up - The Guardian", "description": "Looser regime means Sweden is better placed to face second wave, says chief epidemiologist", "url": "https://www.theguardian.com/world/2020/apr/24/sweden-queries-basis-of-lockdowns-as-germany-keeps-its-guard-up", "urlToImage": null, "publishedAt": "2020-04-24T15:55:49Z", "content": "Sweden questioned the scientific basis of other EU countries strict coronavirus lockdowns as Germany said its number of cases needed to fall from about 2,000 to a few hundred a day before it could ease restrictions further.\r\nAs several European countries cont… [+4375 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Lydia Smith", "title": "More Evidence Hydroxychloroquine Leads To Heart Abnormalities Found in New York COVID-19 Patients - Newsweek", "description": "After the patients were administered the drugs in the New York facility, an electrocardiogram revealed cardiac rhythm problems in many people treated.", "url": "https://www.newsweek.com/more-evidence-hydroxychloroquine-leads-heart-abnormalities-found-new-york-covid-19-patients-1500061", "urlToImage": null, "publishedAt": "2020-04-24T15:17:42Z", "content": "Coronavirus patients who were treated with the drugs hydroxychloroquine and azithromycin experienced heart abnormalities, adding further evidence to the suggestion the medications come with unknown risks.\r\nEighty-four patients with COVID-19 were treated at a … [+5754 chars]"}, {"source": {"id": null, "name": "China.org.cn"}, "author": "", "title": "Spotlight: UK pushes forward coronavirus vaccine trial amid increasing pandemic death toll - China.org.cn", "description": null, "url": "http://www.china.org.cn/world/Off_the_Wire/2020-04/24/content_75973145.htm", "urlToImage": null, "publishedAt": "2020-04-24T15:10:56Z", "content": "by Xinhua writer Zhang Jiawei\r\nLONDON, April 24 (Xinhua) -- After implementing social distancing measures for weeks, Britain has hit \"the peak\" of the COVID-19 outbreak, according to the country's Health Secretary Matt Hancock. But medical experts said only a… [+5375 chars]"}, {"source": {"id": null, "name": "Europa.eu"}, "author": null, "title": "Questions and Answers: The Coronavirus Global Response - EU News", "description": "Highlights, press releases and speeches", "url": "https://ec.europa.eu/commission/presscorner/detail/en/qanda_20_731", "urlToImage": null, "publishedAt": "2020-04-24T15:07:16Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "TVJ 10 Minutes to Your Health: What are the Risks of COVID-19 to Pregnant Women? - April 23 2020 - Television Jamaica", "description": "Jamaica News Today - Television Jamaica a Trusted Source for News, Sports & Entertainment. Television Jamaica (TVJ) where you get Jamaican news, sports and w...", "url": "https://www.youtube.com/watch?v=Mw4-mxl2yhg", "urlToImage": null, "publishedAt": "2020-04-24T14:37:01Z", "content": "Jamaica News Today - Television Jamaica a Trusted Source for News, Sports &amp; Entertainment.\r\nTelevision Jamaica (TVJ) where you get Jamaican news, sports and weather reports and an eclectic mix of music, entertainment and information shows for the entire f… [+469 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Nick Hopkins", "title": "Revealed: UK ministers were warned last year of risks of coronavirus pandemic - The Guardian", "description": "Briefing, which recommended stockpiling PPE among other measures, intensifies focus on No 10’s handling of outbreakCoronavirus – latest updatesSee all our coronavirus coverage", "url": "https://www.theguardian.com/world/2020/apr/24/revealed-uk-ministers-were-warned-last-year-of-risks-of-coronavirus-pandemic", "urlToImage": null, "publishedAt": "2020-04-24T14:33:57Z", "content": "Ministers were warned last year the UK must have a robust plan to deal with a pandemic virus and its potentially catastrophic social and economic consequences in a confidential Cabinet Office briefing leaked to the Guardian.\r\nThe detailed document warned that… [+6557 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Fall in coronavirus hospital admissions are 'real and growing cause for optimism' - STV News", "description": "The First Minister said lower figures for hospital admissions and patients in intensive care for Covid-19 are giving 'real and growing cause for optimism'.", "url": "https://www.youtube.com/watch?v=8wf932JCVOk", "urlToImage": null, "publishedAt": "2020-04-24T12:13:01Z", "content": "The First Minister said lower figures for hospital admissions and patients in intensive care for Covid-19 are giving 'real and growing cause for optimism'."}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Aussies should brace for rolling lockdowns in years ahead - Big Rigs", "description": "Australia is preparing to cautiously lift the first virus restrictions next week – but a return to “normal” could still be years away.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-aussies-should-brace-for-rolling-lockdowns-in-years-ahead/news-story/8847b0e8f896994785239983a0e91880", "urlToImage": null, "publishedAt": "2020-04-24T11:15:08Z", "content": "ANALYSIS\r\nBrace yourselves: We're going to need more lockdowns to get on top of COVID-19.\r\nEconomists used to dream of exponential growth in relation to the economy. But that same explosive effect seems set to doom us to rolling lockdowns for years to come.\r\n… [+5660 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Erika Edwards", "title": "Doctors report uptick in surprising coronavirus complication: dangerous blood clots - NBC News", "description": "Coronavirus patients are developing blood clots at higher rates. Does the virus cause blood to clot, or is it the result of inflammation? Regular anticoagulants aren't working.", "url": "https://www.nbcnews.com/health/health-news/doctors-report-uptick-surprising-coronavirus-complication-dangerous-blood-clots-n1190491", "urlToImage": null, "publishedAt": "2020-04-24T08:33:27Z", "content": "Three weeks ago, critical care pulmonologist Hugh Cassiere encountered something he hadn't seen in 24 years of practicing medicine.\r\nA 45-year-old man arrived at the hospital where Cassiere works, North Shore University Hospital on Long Island, New York, with… [+4346 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Jessica Knibbs", "title": "Coronavirus symptoms: Do your toes look like this? Signs you could have 'COVID toes' - Express", "description": "CORONAVIRUS has caused mass havoc in its wake. The UK's updated cases of death from the deadly virus sits at an astonishing 17,337. Having toes which resemble the following could mean you're at risk of an infection.", "url": "https://www.express.co.uk/life-style/health/1272455/coronavirus-update-uk-cases-news-symptoms-covid-toes-frostbite-like-purple-red", "urlToImage": null, "publishedAt": "2020-04-24T08:14:00Z", "content": null}, {"source": {"id": null, "name": "Bendigoadvertiser.com.au"}, "author": "Natalie Croxon", "title": "Hospital first to use new telehealth platform for COVID-19 patients - Bendigo Advertiser", "description": "The new system allows health practitioners to monitor patients' conditions from afar.", "url": "https://www.bendigoadvertiser.com.au/story/6734213/hospital-first-to-use-new-telehealth-platform-for-covid-19-patients/", "urlToImage": null, "publishedAt": "2020-04-24T08:00:00Z", "content": ""}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/christina-zhou/9076506", "title": "Why are Western countries being hit harder than East Asian countries by coronavirus? - ABC News", "description": "Here we take a look at how the East has managed the outbreak compared to the West, and why the latter struggled to get a head start.", "url": "https://www.abc.net.au/news/2020-04-24/coronavirus-response-in-china-south-korea-italy-uk-us-singapore/12158504", "urlToImage": null, "publishedAt": "2020-04-24T07:49:55Z", "content": "Posted \r\nApril 24, 2020 09:49:16\r\nWhen the coronavirus initially swept across the East first China, then Thailand, Japan, and South Korea the Western countries watched on cautiously from the other side of the globe.\r\nKey points:\r\n<ul><li>Singapore, South Kore… [+14224 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Liam Mannix", "title": "Scientists dispel theory COVID-19 escaped from lab - The Age", "description": "There is overwhelming evidence the virus that causes COVID-19 jumped from animals into humans, rather than escaping a lab, virus experts said.", "url": "https://www.smh.com.au/national/scientists-dispel-theory-covid-19-escaped-from-lab-20200424-p54mun.html", "urlToImage": null, "publishedAt": "2020-04-24T07:27:49Z", "content": "\"We have been warning about this for some time now,\" said Dr Joshua Hayward, a bat virus researcher at the Burnet Institute. \"And I dont believe anyone has been listening.\"\r\nTwo virus labs are based in Wuhan. A Washington Post report suggested the US has long… [+2688 chars]"}, {"source": {"id": null, "name": "Denipt.com.au"}, "author": null, "title": "Install virus app to aid health carers: PM - Deniliquin Pastoral Times", "description": "", "url": "https://www.denipt.com.au/national/2020/04/24/1143612/install-virus-app-to-aid-health-carers-pm", "urlToImage": null, "publishedAt": "2020-04-24T06:46:30Z", "content": "Scott Morrison has conceded the government might not meet its goal for Australians downloading its coronavirus surveillance software.The prime minister says the app will be released imminently and is urging everyone to support the national efforts to suppress… [+2442 chars]"}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": "Simon Bourke", "title": "Lifeline picks up the phone in an age of loneliness as more than ever before call - Newcastle Herald", "description": "\"There are people out there, and the call they make to Lifeline is the only conversation they have all week.\"", "url": "https://www.canberratimes.com.au/story/6734221/covid-19-sparks-highest-ever-demand-for-lifeline-help/", "urlToImage": null, "publishedAt": "2020-04-24T06:30:00Z", "content": ""}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Scientists uncover evidence coronavirus could trigger diabetes in healthy adults - SBS News", "description": "A new study involving Australian researchers has found there is evidence COVID-19 could be causing diabetes in otherwise healthy adults.", "url": "https://www.sbs.com.au/news/scientists-uncover-evidence-coronavirus-could-trigger-diabetes-in-healthy-adults", "urlToImage": null, "publishedAt": "2020-04-24T06:10:00Z", "content": "Coronavirus may be triggering diabetes in typically healthy adults.\r\nElderly Australians with diabetes are also at an increased risk from coronavirus, a study released on Friday shows.\r\nCo-author and Monash University professor Paul Zimmet said diabetic child… [+2582 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Two pet cats contract coronavirus - Daily Mercury", "description": "Two pet cats from different homes have contracted the coronavirus with one believed to have caught the virus from someone other than its owner.", "url": "https://www.news.com.au/lifestyle/health/health-problems/two-pet-cats-contract-coronavirus-in-new-york-city/news-story/88a58061054ea124b819ddeaea6f6ec6", "urlToImage": null, "publishedAt": "2020-04-24T05:55:00Z", "content": "Those nine lives might come in handy.\r\nTwo pet cats in New York state in the US have tested positive for the coronavirus, in the first diagnoses of domestic animals on American soil, a report said this week.\r\nIt's believed that the cats contracted the illness… [+1572 chars]"}, {"source": {"id": null, "name": "Goldcoastbulletin.com.au"}, "author": "Sue Dunlevy and Brianna Morris-Grant", "title": "Why we're unlikely to be shaking hands 'anytime soon' - Chinchilla News", "description": "THE family dinner could be one of the first social gatherings allowed as we come out of the COVID-19 lockdown.", "url": "https://www.goldcoastbulletin.com.au/coronavirus/gold-coast-warned-against-breaching-social-distancing-laws-as-coronavirus-cases-drop/news-story/fb52d6aba701c1c79700f6d9380a3da0", "urlToImage": null, "publishedAt": "2020-04-24T04:43:00Z", "content": "THE family dinner could be one of the first social gatherings allowed as we come out of the COVID-19 lockdown.\r\nEpidemiologists advising the Federal Government said the best approach to ending the lockdown may be lifting one restriction at a time - like allow… [+5103 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Lucy Quaggin", "title": "Microbiologist claims Wuhan lab ‘did absolutely crazy things’ in coronavirus research - 7NEWS.com.au", "description": "The professor’s comments have fuelled speculation that COVID-19 originated in a laboratory and not a wet market.", "url": "https://7news.com.au/lifestyle/health-wellbeing/microbiologist-claims-wuhan-lab-did-absolutely-crazy-things-in-coronavirus-research-c-996623", "urlToImage": null, "publishedAt": "2020-04-24T03:29:00Z", "content": "A Russian microbiologist has made some controversial claims about the origin of COVID-19.\r\nWorld-leading expert Professor Petr Chumakov has fuelled speculation the virus could have accidentally originated in a Wuhan laboratory - potentially during research fo… [+2158 chars]"}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "PerthNow", "title": "Coronavirus crisis: Artania passenger adds to WA death tally - PerthNow", "description": "WA Health Minister Roger Cook has confirmed another COVID-19 death in WA.", "url": "https://www.perthnow.com.au/news/coronavirus/coronavirus-crisis-artania-passenger-adds-to-wa-death-tally-ng-b881528983z", "urlToImage": null, "publishedAt": "2020-04-24T02:40:14Z", "content": "An Artania passenger in his 70s has died, bringing WAs COVID-19 death toll to eight.\r\nThe passenger was one of the original cases taken off the ship last month but lost his fight at Sir Charles Gairdner Hospital yesterday.\r\nThe death came as two new cases of … [+1247 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Almost all of these virus patients die - Sunshine Coast Daily", "description": "The results of a new hospital study show that when critically ill patients are put on ventilators it is highly unlikely they will survive.", "url": "https://www.news.com.au/lifestyle/health/health-problems/almost-90-per-cent-of-coronavirus-patients-put-on-ventilators-die/news-story/7d95181220848cd1d95d68319f160c2b", "urlToImage": null, "publishedAt": "2020-04-24T02:07:00Z", "content": "New research shows that critically ill coronavirus patients who are put on ventilators have a very poor chance of surviving.\r\nA newly published study revealed 90 per cent of coronavirus patients who were ventilated in New York City hospitals died, despite a h… [+2176 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "NBC", "title": "Coronavirus in the US: New York firefighter’s baby daughter dies from COVID-19 - 7NEWS.com.au", "description": "The baby girl spent a month in hospital before the virus took her life.", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-in-the-us-new-york-firefighters-baby-daughter-dies-from-covid-19-c-996697", "urlToImage": null, "publishedAt": "2020-04-24T01:27:25Z", "content": "A New York City firefighter and his wife have lost their four-month-old daughter to coronavirus.\r\nJay-Natalie La Santa died on April 20, nearly a month after she was rushed to the hospital with a fever.\r\nShe was very feisty. She was a little Angel with the mo… [+2705 chars]"}, {"source": {"id": null, "name": "Dailymercury.com.au"}, "author": "Melanie Whiting, Melanie Whiting", "title": "Moranbah and Proserpine to receive Covid-19 test centres - Chronicle", "description": "The service is expected to ease strain on local health units.", "url": "https://www.dailymercury.com.au/news/moranbah-and-proserpine-to-receive-covid-19-test-c/4001832/", "urlToImage": null, "publishedAt": "2020-04-24T01:17:00Z", "content": "NEW coronavirus testing centres will be set up in Moranbah and Proserpine after a mutli-million dollar funding boost from mining giant BHP.\r\nThe Covid-19 testing centres, expected to open by the end of May, will ease strain on health services and separate sus… [+1347 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "Sylvain Peuchmaurd, AFP", "title": "Oxford University Just Injected The First Participants in a COVID-19 Vaccine Trial - ScienceAlert", "description": "Oxford University is launching a human trial of a potential coronavirus vaccine, with the daunting aim of making a successful jab available to the public later this year.", "url": "https://www.sciencealert.com/oxford-university-has-just-launched-a-human-trial-of-a-potential-covid-19-vaccine", "urlToImage": null, "publishedAt": "2020-04-24T00:42:28Z", "content": "Oxford University is launching a human trial of a potential coronavirus vaccine, with the daunting aim of making a successful jab available to the public later this year.\r\nOf the more than 100 research projects around the world to find a vaccine - described b… [+3349 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Virus causing strokes in healthy young people - News Mail", "description": "Doctors have sent a warning that coronavirus is causing blood clots and strokes in otherwise young, healthy patients.", "url": "https://www.news.com.au/lifestyle/health/health-problems/doctors-warn-coronavirus-causing-blood-clots-and-sudden-strokes-in-young-healthy-patients/news-story/d9d3f775f84783346d10f47229359e9a", "urlToImage": null, "publishedAt": "2020-04-24T00:38:00Z", "content": "Coronavirus can cause blood clots and sudden strokes in young, healthy patients, doctors have warned.\r\nMedics in New York have seen a sevenfold increase in stroke cases in people in their 30s and 40s who either had mild or no COVID-19 symptoms at all.\r\nIt com… [+3658 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Will Pavia, David Charter, Henry Zeffman", "title": "Only a tenth of New York ventilator patients survive coronavirus - The Times", "description": "Little more than a tenth of Covid-19 patients who have been put on ventilators survive, according to the largest and most comprehensive study of sufferers in the United States who were admitted to", "url": "https://www.thetimes.co.uk/article/only-a-tenth-of-new-york-ventilator-patients-survive-coronavirus-920vg6dtp", "urlToImage": null, "publishedAt": "2020-04-23T23:01:00Z", "content": "Little more than a tenth of Covid-19 patients who have been put on ventilators survive, according to the largest and most comprehensive study of sufferers in the United States who were admitted to hospital.\r\nVentilators have been held up as the last hope for … [+492 chars]"}, {"source": {"id": null, "name": "Eurekalert.org"}, "author": null, "title": "To combat COVID-19, behavioral pitfalls must be addressed - EurekAlert", "description": "In a commentary piece for The Lancet, researchers from Princeton University and the Sunnybrook Research Institute review eight behavioral pitfalls that challenge judgments made during the COVID-19 pandemic.", "url": "https://www.eurekalert.org/pub_releases/2020-04/puww-tcc042220.php", "urlToImage": null, "publishedAt": "2020-04-23T22:32:37Z", "content": "PRINCETON, N.J.--During any crisis, timely, and sometimes life-altering, decisions must be made, requiring an extreme amount of sound judgment under uncertainty. The Covid-19 pandemic is no different.\r\nIn a commentary piece for The Lancet, researchers from Pr… [+4412 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "7NEWS", "title": "British mum, 29, with ‘mild’ coronavirus dies six days after giving birth - 7NEWS.com.au", "description": "Tragically the new mum was never able to see her baby and only saw pictures of him before she passed away.", "url": "https://7news.com.au/lifestyle/health-wellbeing/british-mum-29-with-mild-coronavirus-dies-six-days-after-giving-birth-c-996409", "urlToImage": null, "publishedAt": "2020-04-23T21:59:18Z", "content": "The family of a British mother who died in hospital six days after giving birth have spoken of their devastation.\r\nFozia Hanif, who had tested positive for coronavirus, died at Birminghams Heartlands Hospital on April 8 after her condition deteriorated follow… [+2875 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "CDC Director Clarifies Coronavirus Comments - HuffPost", "description": "President Donald Trump said Dr. Robert Redfield was misquoted about the coronavirus resurging in the fall, but the CDC director said his interview with The W...", "url": "https://www.youtube.com/watch?v=XhPtzNbO8iI", "urlToImage": null, "publishedAt": "2020-04-23T21:33:39Z", "content": "President Donald Trump said Dr. Robert Redfield was misquoted about the coronavirus resurging in the fall, but the CDC director said his interview with The Washington Post was accurate. \r\nSubscribe to HuffPost today: http://goo.gl/xW6HGSupport our work: https… [+134 chars]"}, {"source": {"id": null, "name": "Unsw.edu.au"}, "author": "z3525182", "title": "Vital Signs: Models show the coronavirus app needs a big take-up, economics tells us how to get it - UNSW Newsroom", "description": "For the app to work well, we might need an 80% take-up. Unless it is made mandatory, we'll need both private and social incentives.", "url": "https://newsroom.unsw.edu.au/news/business-law/vital-signs-models-show-coronavirus-app-needs-big-take-economics-tells-us-how-get", "urlToImage": null, "publishedAt": "2020-04-23T21:22:00Z", "content": "For the app to work well, we might need an 80% take-up. Unless it is made mandatory, we'll need both private and social incentives.With Australias test-confirmed daily COVID-19 infection rates continuing to fall to relatively low levels, there is considerable… [+4258 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "Most NYC Virus Patients Had Underlying Health Issues, Study Shows - The Epoch Times", "description": "Most patients in New York City hospitalized with the CCP virus suffered from at least one underlying health issue, such as obesity or kidney disease.", "url": "https://www.theepochtimes.com/most-new-york-virus-patients-had-underlying-health-issue-study_3324097.html", "urlToImage": null, "publishedAt": "2020-04-23T21:17:16Z", "content": "Most patients in New York City hospitalized with the CCP virus suffered from one or more underlying health issues, such as obesity or kidney disease, according to a new study.\r\nResearchers analyzed records from 5,700 patients and found more than 56 percent su… [+3603 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Britons come together to Clap for our Carers and thank the NHS - The Telegraph", "description": "People across the UK came out on their doorsteps, balconies, windows and gardens to clap for our cares for the fifth week running. For all the latest on coro...", "url": "https://www.youtube.com/watch?v=XZo5XuydB9M", "urlToImage": null, "publishedAt": "2020-04-23T19:45:53Z", "content": "People across the UK came out on their doorsteps, balconies, windows and gardens to clap for our cares for the fifth week running.\r\nFor all the latest on coronavirus, head here: https://www.telegraph.co.uk/global-he...\r\nGet the latest headlines: https://www.t… [+228 chars]"}, {"source": {"id": null, "name": "Medium.com"}, "author": "Sbarlas", "title": "A New Angle on Why COVID-19 Causes Death - Elemental", "description": "Ariana Eunjung Cha exemplifies the kind of deep, interesting, breaking non-political reporting the Washington Post can excel at when it decides to give its tendentious political reporting a rest…", "url": "https://medium.com/@sbarlas/a-new-angle-on-why-covid-19-causes-death-58b260d0a275", "urlToImage": null, "publishedAt": "2020-04-23T19:22:05Z", "content": "A New Angle on Why COVID-19 Causes Death\r\nBlood clots, not pneumonia, often the villain\r\nAriana Eunjung Cha exemplifies the kind of deep, interesting, breaking non-political reporting the Washington Post can excel at when it decides to give its tendentious po… [+1584 chars]"}, {"source": {"id": null, "name": "Komonews.com"}, "author": "Denise Whitaker", "title": "New COVID-19 side effect in people under 50 - KATU", "description": "Doctors in New York say a growing number of their coronavirus patients in their 30s and 40s are suffering sudden strokes. This new side effect comes from the staff at Mt Sinai Health, after seeing blood clot in unusual ways in these younger patients who were …", "url": "http://komonews.com/news/local/new-covid-19-side-effect-in-people-under-50", "urlToImage": null, "publishedAt": "2020-04-23T18:09:00Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Blood Clots a New Surprise Side Effect in Coronavirus Patients | NBC10 Philadelphia - NBC10 Philadelphia", "description": "Doctors are noticing a new trend in COVID-19 patients in the form of blood clots. NBC10’s Matt DeLucia spoke with two local doctors about what they’re seeing...", "url": "https://www.youtube.com/watch?v=t2Bu8mqxwrg", "urlToImage": null, "publishedAt": "2020-04-23T17:56:50Z", "content": "Doctors are noticing a new trend in COVID-19 patients in the form of blood clots. NBC10s Matt DeLucia spoke with two local doctors about what theyre seeing at hospitals. \r\n_____\r\nSUBSCRIBE TO NBC10: VISIT the NBC10 channel for the latest news and exclusive re… [+437 chars]"}, {"source": {"id": null, "name": "Hotnewhiphop.com"}, "author": "Lynn S.", "title": "Coronavirus Could Cause Strokes In Young Adults, Doctors Warn - HotNewHipHop", "description": "Doctors are warning folks in their 30s and 40s that coronavirus might be the cause of a recent increase in strokes in normally healthy young adults.", "url": "https://www.hotnewhiphop.com/coronavirus-could-cause-strokes-in-young-adults-doctors-warn-news.109058.html", "urlToImage": null, "publishedAt": "2020-04-23T17:16:53Z", "content": "Health care professionals have noticed a recent increase in treatment for sudden strokes in young adults, and they worry it's a result of the coronavirus. Doctors at Mount Sinai Health System in New York City reported that they typically treat less than two s… [+1574 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "New York study finds worrying fatality rate on COVID-19 patients on ventilators - CGTN", "description": "", "url": "https://newsaf.cgtn.com/news/2020-04-24/NY-study-finds-worrying-death-rate-on-COVID-19-patients-on-ventilators-PVY9Kci5pK/index.html", "urlToImage": null, "publishedAt": "2020-04-23T17:16:15Z", "content": "Nearly all COVID-19 patients who needed ventilators in New York's largest health system to help them breathe died, a study found.\r\nThe study found that 88 percent of the patients placed on the breathing aids at Northwell Health died, while overall about 20% p… [+934 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "New research highlights blood clot dangers of COVID-19 - Science Daily", "description": "A special report published today in the journal Radiology outlines prevention, diagnosis and treatment of complications stemming from blood clots in patients with COVID-19. The journal also published two research letters and a case study on this topic.", "url": "https://www.sciencedaily.com/releases/2020/04/200423143100.htm", "urlToImage": null, "publishedAt": "2020-04-23T15:45:00Z", "content": "A special report published today in the journal Radiology outlines prevention, diagnosis and treatment of complications stemming from blood clots in patients with COVID-19. The journal also published two research letters and a case study on this topic.Clinici… [+4357 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Adam Chapman", "title": "Coronavirus warning: The deadly new symptom affecting people under the age of 50 - Express", "description": "CORONAVIRUS continues to confound health experts as it spreads through different populations, with new symptoms and complications being reported in its wake. COVID-19 has once again raised eyebrows, with doctors reporting the disease is causing a life-threate…", "url": "https://www.express.co.uk/life-style/health/1272739/coronavirus-tips-update-deaths-cases-symptoms-stroke", "urlToImage": null, "publishedAt": "2020-04-23T15:21:00Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Global Health Doctor: Hire 1000s of Contact Tracers to Stop COVID-19, Save Lives and the Economy - Democracy Now!", "description": "As parts of the United States and Europe consider reopening, most of the world’s population remains susceptible to the coronavirus. We look at new efforts to...", "url": "https://www.youtube.com/watch?v=AO6XGBfOv88", "urlToImage": null, "publishedAt": "2020-04-23T15:16:40Z", "content": "As parts of the United States and Europe consider reopening, most of the worlds population remains susceptible to the coronavirus. We look at new efforts to stop the deadly spread of COVID-19 with contact tracing finding who infected patients have been in con… [+862 chars]"}, {"source": {"id": null, "name": "Kron4.com"}, "author": "Alexa Mae Asperin", "title": "Doctors warn of new coronavirus symptom in young adults - KRON4", "description": "Oxley said his team urged people to watch themselves for symptoms of coronavirus and to call 911 if they believe they’ve suffered a stroke.", "url": "https://www.kron4.com/health/coronavirus/doctors-warn-of-new-coronavirus-symptom-in-young-adults/", "urlToImage": null, "publishedAt": "2020-04-23T14:32:00Z", "content": "SAN FRANCISCO (KRON) – Doctors are warning of a new coronavirus symptom showing up in young adults. \r\nCNN reports doctors at Mount Sinai Health System in New York believe there is growing evidence that coronavirus may cause sudden strokes in adults in their 3… [+1322 chars]"}, {"source": {"id": null, "name": "Silive.com"}, "author": "Maura Grunlund | mauragrunlund@siadvance.com", "title": "Report: Coronavirus may cause sudden strokes in younger adults - SILive.com", "description": "The strokes, mostly among people with no pre-existing conditions, might result from blood clots fueled by COVID-19.", "url": "https://www.silive.com/coronavirus/2020/04/report-coronavirus-may-cause-sudden-strokes-in-younger-adults.html", "urlToImage": null, "publishedAt": "2020-04-23T13:20:35Z", "content": "STATEN ISLAND, N.Y. -- The coronavirus could be responsible for strokes in adults in their 30s and 40s, according to alarming media reports.\r\nThe strokes, mostly among people with no pre-existing conditions, might result from blood clots fueled by COVID-19, a… [+651 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nick Statt", "title": "Boston Dynamics’ Spot robot is helping hospitals remotely treat coronavirus patients - The Verge", "description": "Robot maker Boston Dynamics announced on Thursday that it’s quadruped Spot robot is already in use at one Boston hospital to help with coronavirus treatment. The company now has ambitious plans to expand use of its robots to assist healthcare workers during t…", "url": "https://www.theverge.com/2020/4/23/21231855/boston-dynamics-spot-robot-covid-19-coronavirus-telemedicine", "urlToImage": null, "publishedAt": "2020-04-23T13:15:48Z", "content": "The company has ambitious plans for using robots to assist COVID-19 treatment\r\nPhoto: Boston Dynamics\r\nRobot maker Boston Dynamics announced on Thursday that its quadruped Spot robot is already in use at one Boston hospital to help with coronavirus treatment.… [+4911 chars]"}, {"source": {"id": null, "name": "Newstatesman.com"}, "author": null, "title": "Thousands of unexplained extra deaths are happening per week during the Covid-19 outbreak. Why? - New Statesman", "description": "Every week as the coronavirus outbreak continues, hundreds, and now thousands, more people are dying than we would normally expect in normal times. The death rate in the UK is now at its highest for more than 20 years, 75 per cent above the five-year average,…", "url": "https://www.newstatesman.com/science-tech/coronavirus/2020/04/covid-19-coronavirus-deaths-unexplained-extra", "urlToImage": null, "publishedAt": "2020-04-23T10:10:52Z", "content": "Every week as the coronavirus outbreak continues, hundreds, and now thousands, more people are dying than we would normally expect in normal times. The death rate in the UK is now at its highest for more than 20 years, 75 per cent above the five-year average,… [+3508 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ariana Eunjung Cha", "title": "Coronavirus: 88% of Covid-19 patients on ventilators didn’t survive in New York’s hospital system, study finds - The Independent", "description": "This compares with the roughly 80 per cent of patients who died on ventilators before the pandemic, according to previous studies", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-us-new-york-hospital-ventilator-death-rate-latest-a9479411.html", "urlToImage": null, "publishedAt": "2020-04-23T09:20:00Z", "content": "Throughout March, as the pandemic gained momentum in the United States, much of the preparations focused on the breathing machines that were supposed to save everyones lives.\r\nNew York State Gov. Andrew Cuomo and President Donald Trump sparred over how many v… [+3229 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Family's plea after two-year-old's death - Whitsunday Times", "description": "Little Sofie DeLuis’s flu shot this year was a “bittersweet” moment for her parents who are still grieving the loss of their other daughter.", "url": "https://www.news.com.au/lifestyle/real-life/news-life/influenza-vaccine-familys-powerful-photo-after-daughters-flu-death/news-story/6ab8b43cb585017cba2d28af6efdfcb0", "urlToImage": null, "publishedAt": "2020-04-23T08:17:00Z", "content": "Heartbroken parents who lost their two-year-old daughter due to complications from the flu want other families to get their children vaccinated before winter claims another young life.\r\nLucy DeLuis, from the town of Narembeen in Western Australia, died at Per… [+4430 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Lucy Jones", "title": "Gruelling long-term health impact of virus - Observer", "description": "Coronavirus’s long term effects: How the disease continues to affect our vital organs and bodily systems", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronaviruss-long-term-effects-how-the-disease-continues-to-affect-our-vital-organs-and-bodily-systems/news-story/8345e23fa9e31409219ce1ce3df9e9e7", "urlToImage": null, "publishedAt": "2020-04-23T07:32:00Z", "content": "Its becoming increasingly clear coronavirus is here, and its here to stay. Now doctors are warning that patients who have survived COVID-19 may be left with long-term health problems.\r\nThey say that the deadly disease can have a lasting impact on a patient’s … [+5482 chars]"}, {"source": {"id": null, "name": "Couriermail.com.au"}, "author": null, "title": "Heat maps reveal Qld regions hardest hit by coronavirus - Courier Mail", "description": "Subscribe to The Courier-Mail to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.couriermail.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-23T07:17:00Z", "content": null}]}