{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Ellen Cranley", "title": "A top public health expert says US coronavirus pandemic is 'near the end of the beginning' as states are set to reopen - Business Insider Australia", "description": "Tom Inglesby, director of the Johns Hopkins Centre for Health Security, said Sunday that despite promising indicators regarding the novel coronavirus pandemic in the US, the country is still far from the end of the outbreak.", "url": "https://www.businessinsider.com.au/health-official-inglesby-us-coronavirus-near-end-of-the-beginning-2020-4", "urlToImage": null, "publishedAt": "2020-04-26T15:51:23Z", "content": "<ul><li>\r\nTom Inglesby, director of the Johns Hopkins Centre for Health Security, said that the US is likely “near the end of the beginning” of the novel coronavirus pandemic as officials have found a nationwide plateau in new cases of the virus each day.\r\n</… [+2753 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "by Thomas Perroteau with AFP bureaus", "title": "Lockdowns ease as global infections near 3 million - Yahoo News Australia", "description": "Spanish children were allowed outside on Sunday for the first time in six weeks as countries eased lockdown measures in a bid to slowly reopen economies gutted by the coronavirus pandemic that has infected nearly three million people worldwide.", "url": "https://au.news.yahoo.com/warns-over-virus-immunity-global-death-toll-nears-163443834--spt.html", "urlToImage": null, "publishedAt": "2020-04-26T15:42:00Z", "content": "Spanish children were allowed outside on Sunday for the first time in six weeks as countries eased lockdown measures in a bid to slowly reopen economies gutted by the coronavirus pandemic that has infected nearly three million people worldwide.\r\nGovernments f… [+6257 chars]"}, {"source": {"id": null, "name": "Consultancy.com.au"}, "author": "Consultancy.com.au", "title": "Five best practices for implementing remote working - Consultancy.com.au", "description": "Covid-19 has made home-based working an imperative for organisations of all stripes.", "url": "https://www.consultancy.com.au/news/1964/five-best-practices-for-implementing-remote-working", "urlToImage": null, "publishedAt": "2020-04-26T14:56:40Z", "content": "Covid-19 has made home-based working an imperative for organisations of all stripes. But in practice, there’s more to making remote work than simply sending staff home with laptops and hoping they’ll get something done. Tim Sheedy, a Principal Advisor at Ecos… [+4771 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Daniel BOSQUE", "title": "Why has Spain been hit so hard by the coronavirus pandemic? - Yahoo News", "description": "In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, e...", "url": "https://news.yahoo.com/why-spain-hit-hard-coronavirus-pandemic-071133079.html", "urlToImage": null, "publishedAt": "2020-04-26T12:11:51Z", "content": "Barcelona (AFP) - In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told AFP.\r\nWhile they stressed it was too early to carry out a detailed analy… [+4456 chars]"}, {"source": {"id": null, "name": "Un.org"}, "author": null, "title": "Millions more children at risk with immunization services disrupted amid COVID-19 pandemic - UN News", "description": "Last year, over 13 million children received no vaccines at all, and the UN Children’s Fund (UNICEF) is calling on governments to step up, warning disrupting immunization services amid the COVID-19 pandemic could leave even more of the world’s most marginaliz…", "url": "https://news.un.org/en/story/2020/04/1062622", "urlToImage": null, "publishedAt": "2020-04-26T11:40:07Z", "content": "Making its call at the start of the 2020 edition of World Immunization Week, UNICEF said on Saturday that millions of children are in danger of missing life-saving vaccines against measles, diphtheria and polio due to disruptions in immunization service as th… [+3030 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Lauren Clark", "title": "Nurse with 13 children is self-isolating at family home after positive coronavirus test - Yahoo Lifestyle", "description": "The dad jokes they are 'going for herd immunity'.", "url": "https://au.lifestyle.yahoo.com/nurse-dad-children-coronavirus-isolation-112417770.html", "urlToImage": null, "publishedAt": "2020-04-26T11:24:00Z", "content": "A nurse - and father of 13 - is self-isolating after testing positive for coronavirus this week.\r\nRoy Hann will have to stay home in Dundee for seven days, while his wife Emma and ten children still living with them will have to remain in quarantine for two w… [+2282 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "AFP", "title": "There's Still 'No Evidence' People Who've Had COVID-19 Can't Get It Again, Warns WHO - ScienceAlert", "description": "The World Health Organization (WHO) warned on Saturday that there is no evidence that people who test positive for the new coronavirus are immunised and protected against reinfection.", "url": "https://www.sciencealert.com/there-s-still-no-evidence-people-who-ve-had-covid-19-can-t-get-it-again-warns-who", "urlToImage": null, "publishedAt": "2020-04-26T11:07:37Z", "content": "The World Health Organization (WHO) warned on Saturday that there is no evidence that people who test positive for the new coronavirus are immunised and protected against reinfection.\r\nThe warning suggests that the issuance of \"immune passports\" may promote t… [+2090 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": "Staff writers", "title": "Are 'covid toes' a telltale sign of virus? - Morning Bulletin", "description": "Doctors have begun to notice an unusual complaint shared by patients around the world, with some speculating the symptom might be an early sign of coronavirus.", "url": "https://www.dailytelegraph.com.au/coronavirus/lesions-on-toes-could-be-linked-to-coronavirus/news-story/cb9c1e01f098d5068d4e686e4be562c0", "urlToImage": null, "publishedAt": "2020-04-26T11:05:00Z", "content": "Rumour has it an unusual new symptom of coronavirus might be afoot.\r\nDoctors have reported that some patients have been found to have red, purple or blue lesions on their feet when presenting with other coronavirus symptoms.\r\nThe lesions were first reported o… [+2074 chars]"}, {"source": {"id": null, "name": "Ntnews.com.au"}, "author": "NATASHA EMECK", "title": "Patient mistook coronavirus for a hangover - Warwick Daily News", "description": "ONE of the city's first coronavirus patients says his symptoms were so mild at first that he mistook them for a hangover after a boozy night out on holiday.", "url": "https://www.ntnews.com.au/news/northern-territory/darwin-patient-says-he-mistook-coronavirus-for-a-hangover/news-story/72d6e9987cf324d159913167ceb4af12", "urlToImage": null, "publishedAt": "2020-04-26T09:51:00Z", "content": "ONE of Darwin's first coronavirus patients says his symptoms were so mild at first that he mistook them for a hangover after a boozy night out on holiday.\r\nThe man in his mid-30s, who did not wish to be named for privacy reasons, has told the NT News about hi… [+1476 chars]"}, {"source": {"id": null, "name": "Nzherald.co.nz"}, "author": "Kim Moodie", "title": "Covid 19 coronavirus: The number of coronavirus cases is up, should we be worried? - New Zealand Herald", "description": "'If you look at this week's cases compared to last week, we're in a better place.'", "url": "https://www.nzherald.co.nz/nz/news/article.cfm?c_id=1&objectid=12327701", "urlToImage": null, "publishedAt": "2020-04-26T09:13:54Z", "content": "The number of new coronavirus cases announced today was the highest in nearly a week, but experts say to be vigilant, not worried.\r\n Nine new cases of the virus were announced today, the highest in the last six days.\r\n While the number of new Covid-19 cases h… [+3320 chars]"}, {"source": {"id": null, "name": "Tenterfieldstar.com.au"}, "author": "Carly Waters and Benita Kolovos", "title": "No plans to relax rules, open Vic schools - Tenterfield Star", "description": "Victoria will not follow in the footsteps of other states in easing some social distancing measures, despite a steady decline in the number of new COVID-19 ca...", "url": "https://www.tenterfieldstar.com.au/story/6735329/no-plans-to-relax-rules-open-vic-schools/?cs=7", "urlToImage": null, "publishedAt": "2020-04-26T08:50:31Z", "content": "Victoria will not follow in the footsteps of other states in easing some social distancing measures, despite a steady decline in the number of new COVID-19 cases.\r\nHealth Minister Jenny Mikakos confirmed the state recorded one death and three new coronavirus … [+2910 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Nathan Layne and Rich McKay", "title": "United States steps toward reopening amid reports health secretary Alex Azar will be sacked - Sydney Morning Herald", "description": "President Donald Trump did not host a briefing on Saturday in the wake of ridicule for his earlier comments on the prospect of treating the coronavirus with bleach.", "url": "https://www.smh.com.au/world/north-america/united-states-steps-toward-reopening-amid-reports-health-secretary-alex-azar-will-be-sacked-20200426-p54nds.html", "urlToImage": null, "publishedAt": "2020-04-26T08:22:23Z", "content": "Politico reported a short list of names to replace Azar, including Deborah Birx, the White House coronavirus co-ordinator; Centres for Medicare and Medicaid Services chief Seema Verma and deputy HHS Secretary Eric Hargan.\r\nPockets of the country sought to res… [+5635 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Women face anxiety over pregnancy and birth in US - TRT World", "description": "For many women, being pregnant comes with its own set of fears and anxiety. But being pregnant during the Covid-19 pandemic takes those fears to a whole new ...", "url": "https://www.youtube.com/watch?v=gagwijdvCR0", "urlToImage": null, "publishedAt": "2020-04-26T08:10:16Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "The Conversation", "title": "Coronavirus: Australia's four scenarios for coming out of lockdown - Yahoo News Australia", "description": "There are a number of options Australia can look at as we ease lockdown measures.", "url": "https://au.news.yahoo.com/australias-four-scenarios-for-coming-out-of-lockdown-080640423.html", "urlToImage": null, "publishedAt": "2020-04-26T08:06:00Z", "content": "Australia is effectively in lockdown. Public gatherings of more than two people are banned and people are only permitted to leave home for a limited set of reasons.\r\nThe recent tough measures appear to be having some effect and the daily growth rate of new ca… [+6147 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "AFP", "title": "Five reasons why coronavirus has spread rapidly through Spain - Yahoo News Australia", "description": "Spain is one of the worst hit countries, with more than 20,000 deaths.", "url": "https://au.news.yahoo.com/six-reason-why-coronavirus-has-spread-rapidly-through-spain-074107834.html", "urlToImage": null, "publishedAt": "2020-04-26T07:41:00Z", "content": "In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told AFP.\r\nWhile they stressed it was too early to carry out a detailed analysis, the experts p… [+5101 chars]"}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": "Simon Bourke", "title": "Figures paint positive picture as Australia plans for COVID-19 recovery - Warrnambool Standard", "description": "Our COVID-19 Informer will keep you up to date with everything you need to know today.", "url": "https://www.canberratimes.com.au/story/6735440/figures-paint-positive-picture-as-australia-plans-for-covid-19-recovery/", "urlToImage": null, "publishedAt": "2020-04-26T07:30:00Z", "content": ""}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Morning update as military begins mobile testing - BBC News", "description": "Five things you need to know about the coronavirus outbreak this morning.", "url": "https://www.bbc.com/news/uk-52429303", "urlToImage": null, "publishedAt": "2020-04-26T06:54:27Z", "content": "Here are five things you need to know about the coronavirus outbreak this Sunday. We'll have another update for you on Monday.\r\n1. Military pop-up testing\r\nThe military is to begin carrying out coronavirus tests in pop-up facilities. The mobile units will tra… [+2792 chars]"}, {"source": {"id": null, "name": "Japantimes.co.jp"}, "author": "Internal Submission", "title": "Countries and companies risk billions in race for coronavirus vaccine - The Japan Times", "description": "Governments, charities and Big Pharma firms are making huge bets with extraordinarily low odds of success.", "url": "https://www.japantimes.co.jp/news/2020/04/26/world/science-health-world/countries-companies-billions-coronavirus-vaccine/", "urlToImage": null, "publishedAt": "2020-04-26T05:30:00Z", "content": "In the race to develop a vaccine to end the COVID-19 pandemic, governments, charities and Big Pharma firms are sinking billions of dollars into bets with extraordinarily low odds of success.\r\nTheyre fast-tracking the testing and regulatory review of vaccines … [+15656 chars]"}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": null, "title": "School return plan reinforced by NSW study - The Canberra Times", "description": "There is no evidence students at NSW schools have infected staff with COVID-19, according to a study cited by the federal government in its push to reopen sch...", "url": "https://www.canberratimes.com.au/story/6735338/school-return-plan-reinforced-by-nsw-study/?cs=14264", "urlToImage": null, "publishedAt": "2020-04-26T04:45:18Z", "content": ""}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Jamie Seidel", "title": "PLAN C: Our last hope if virus vaccine comes to nothing - Balonne Beacon", "description": "Coronavirus vaccines and treatment are in development, but what is the world’s Plan C?", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-vaccines-and-treatment-are-in-development-but-what-is-the-worlds-plan-c/news-story/082aa3bdda2ee957d532ec1e4605726c", "urlToImage": null, "publishedAt": "2020-04-26T04:36:17Z", "content": "Will a vaccine save us from COVID-19? What about new treatments for its symptoms?Indications are, we may have to find a Plan C.Billions of people are confined to our homes. We can’t go to the beach. The office. Or school. It’s the bluntest possible response t… [+8397 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Lauren Ferri For Daily Mail Australia", "title": "Sydney healthcare worker tests positive for coronavirus fears of ANOTHER hospital COVID-19 cluster - Daily Mail", "description": "The employee was working at Nepean Hospital in the Blue Mountains region, west of Sydney, undertaking non-clinical duties before she was diagnosed.", "url": "https://www.dailymail.co.uk/news/article-8257589/Sydney-healthcare-worker-tests-positive-coronavirus-fears-hospital-COVID-19-cluster.html", "urlToImage": null, "publishedAt": "2020-04-26T04:23:19Z", "content": "A female doctor has tested positive for coronavirus.\r\nThe doctor was working at Nepean Hospital in the Blue Mountains region, west of Sydney, undertaking non-clinical duties before she was diagnosed.\r\nNepean Blue Mountains Local Health District confirmed the … [+3622 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "Coronavirus: Surprising benefit of COVID-19 lockdown restrictions - NEWS.com.au", "description": "Coronavirus: Surprising benefit of COVID-19 lockdown restrictions", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-surprising-benefit-of-covid19-lockdown-restrictions/news-story/b4a2b33b821b6e335072c84352a06242", "urlToImage": null, "publishedAt": "2020-04-26T03:10:03Z", "content": "The rate of Australians getting infected by contagious diseases has plummeted following social distancing restrictions.The transmission rate of influenza, chickenpox, measles and other communicable diseases have fallen since Australia’s COVID-19 restrictions … [+4194 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus: People with COVID-19 symptoms more than double number who tested positive, app shows - Yahoo News UK", "description": "Professor Tim Spector, head of genetic epidemiology at King's College London, said the COVID symptom tracker, which has been downloaded by nearly 2.7 million people, is generating an \"unprecedented\" amount of data about the disease in the community.  It has a…", "url": "https://uk.news.yahoo.com/coronavirus-more-370-000-people-uk-symptomatic-covid-171200551.html", "urlToImage": null, "publishedAt": "2020-04-26T02:33:00Z", "content": "More than 370,000 people in the UK have symptomatic COVID-19, according to an app tracking the virus \"in real time\".\r\nProfessor Tim Spector, head of genetic epidemiology at King's College London, said the COVID symptom tracker, which has been downloaded by ne… [+3914 chars]"}, {"source": {"id": null, "name": "Stawelltimes.com.au"}, "author": "Carly Waters and Benita Kolovos", "title": "One new COVID-19 death in Victoria - The Stawell Times-News", "description": "Victoria will not follow in the footsteps of other states in easing some social distancing measures, despite a steady decline in the number of new COVID-19 ca...", "url": "https://www.stawelltimes.com.au/story/6735329/no-plans-to-relax-rules-open-vic-schools/?cs=9397", "urlToImage": null, "publishedAt": "2020-04-26T02:21:00Z", "content": ""}, {"source": {"id": null, "name": "Brisbanetimes.com.au"}, "author": "Lydia Lynch", "title": "Queensland lockdown restrictions eased: Here's what you're allowed to do - The Age", "description": "As of next Friday, Queenslanders will be allowed to go on family picnics and to shop following a week of few COVID-19 infections.", "url": "https://www.brisbanetimes.com.au/national/queensland/queensland-lockdown-restrictions-eased-here-s-what-you-re-allowed-to-do-20200426-p54naw.html", "urlToImage": null, "publishedAt": "2020-04-26T02:14:00Z", "content": "But Ms Palaszczuk said people must not travel further than 50 kilometres from home.\r\n\"This is a test-run to see what effect easing restrictions has on the containment of COVID-19,\" she said.\r\nThe Premier has given the green light for family picnics and walks … [+2526 chars]"}, {"source": {"id": null, "name": "Dailyadvertiser.com.au"}, "author": "Jessica McLaughlin", "title": "Wagga coronavirus: one new COVID-19 cases recorded in Murrumbidgee Local Health District - The Border Mail", "description": "This brings the total of positive cases to 46 for the MLDH.", "url": "https://www.dailyadvertiser.com.au/story/6735353/coronavirus-strikes-again-in-wagga-with-new-confirmed-case/?cs=17267", "urlToImage": null, "publishedAt": "2020-04-26T01:41:00Z", "content": ""}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": "Jane Hansen", "title": "One in three parents unaware flu vaccination is recommended for kids - Daily Telegraph", "description": "While influenza vaccination uptake is at record levels for adults, children under the age of five have been slow to have their shots.", "url": "https://www.dailytelegraph.com.au/news/nsw/one-in-three-parents-unaware-flu-vaccination-is-recommended-for-kids/news-story/c64564798dc4d31c269553bf9cd86093", "urlToImage": null, "publishedAt": "2020-04-26T01:36:54Z", "content": "While influenza vaccination uptake is at record levels for adults, children under the age of five have been slow to have their shots.\r\nEven though these shots are now available free on the national immunisation program, only one in 16 children have had their … [+2163 chars]"}, {"source": {"id": null, "name": "Theleader.com.au"}, "author": "Colin Brinsden", "title": "Virus tracing app only for health use: PM - St George and Sutherland Shire Leader", "description": "Doctors, nurses, business and bankers have been quick to back the Morrison government's COVID-19 tracer app, which aims to help health officials identify peop...", "url": "https://www.theleader.com.au/story/6735355/covidsafe-app-to-help-get-back-to-normal/?cs=9397&utm_campaign=sidebar&utm_medium=index&utm_source=website", "urlToImage": null, "publishedAt": "2020-04-26T01:18:17Z", "content": "Doctors, nurses, business and bankers have been quick to back the Morrison government's COVID-19 tracer app, which aims to help health officials identify people who may have come into contact with someone with the disease.\r\nCalled COVIDSafe, the voluntary app… [+3371 chars]"}, {"source": {"id": "xinhua-net", "name": "Xinhua Net"}, "author": null, "title": "Study reveals link between ADHD and sleeping disorder - Xinhua | English.news.cn - Xinhua", "description": null, "url": "http://www.xinhuanet.com/english/2020-04/26/c_139008340.htm", "urlToImage": null, "publishedAt": "2020-04-26T00:07:03Z", "content": "SHANGHAI, April 26 (Xinhua) -- An international team of researchers have found that Attention Deficit Hyperactivity Disorder (ADHD) is related to sleeping disorder through brain imaging analysis.\r\nADHD is seen in some children who are often accompanied by sle… [+1022 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Jonathan Leake, Science Editor", "title": "Tracker app suggests coronavirus arrived at new year - The Times", "description": "The coronavirus was spreading in the UK weeks before the first case was detected, according to a leading epidemiologist.Professor Tim Spector has collated reports of people falling ill with “classic", "url": "https://www.thetimes.co.uk/article/tracker-app-suggests-coronavirus-arrived-at-new-year-rcsvkdrgn", "urlToImage": null, "publishedAt": "2020-04-25T23:01:00Z", "content": "The coronavirus was spreading in the UK weeks before the first case was detected, according to a leading epidemiologist.\r\nProfessor Tim Spector has collated reports of people falling ill with classic symptoms of the disease from the start of January.\r\nIt sugg… [+504 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Summer Woolley", "title": "Coronavirus update: Six-month-old baby with heart condition survives COVID-19 - 7NEWS.com.au", "description": "The baby received a standing ovation from hospital staff but just weeks prior, her parents Emma and Wayne had been told they were going to lose her.", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-update-six-month-old-baby-with-heart-condition-survives-covid-19-c-999490", "urlToImage": null, "publishedAt": "2020-04-25T22:48:49Z", "content": "A six-month-old baby who fought through a rare heart defect, a respiratory illness and collapsed lungs has now survived COVID-19.\r\nThe baby from Manchester, England, received a standing ovation from NHS staff as she was escorted through the hospital.\r\nJust we… [+3155 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "UK doctor invents digital flashcards to help Covid-19 patients understand staff - The Guardian", "description": "Cardmedic overcomes communication barrier caused by healthcare staff wearing PPE", "url": "https://www.theguardian.com/world/2020/apr/25/uk-doctor-invents-digital-flashcards-to-help-covid-19-patients-understand-staff", "urlToImage": null, "publishedAt": "2020-04-25T21:50:36Z", "content": "A coronavirus patients terrifying hospital experience inspired an NHS doctor to create a flashcard system to improve communication with medical staff wearing face masks.\r\nAnaesthetist Rachael Grimaldi founded Cardmedic while on maternity leave after reading a… [+2712 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "'No evidence' people with coronavirus are immunised: WHO - SBS News", "description": "While the global death toll of coronavirus passes 200,000, the World Health Organization warns there is no evidence of immunity to the disease.", "url": "https://www.sbs.com.au/news/no-evidence-people-with-coronavirus-are-immunised-says-who", "urlToImage": null, "publishedAt": "2020-04-25T21:37:23Z", "content": "The World Health Organization has warned that recovering from coronavirus might not protect people from reinfection as the death toll from the pandemic passed 200,000 around the globe.\r\nGovernments are struggling to limit the economic devastation unleashed by… [+7190 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "The Mighty Staff", "title": "Doctors Report People in Their 30s and 40s With COVID-19 Are Having Strokes - Yahoo Singapore News", "description": "Doctors in New York City and around the country are now reporting that people in their 30s and 40s with COVID-19, even mild cases, are having and dying from strokes.", "url": "https://sg.news.yahoo.com/doctors-report-people-30s-40s-205330026.html", "urlToImage": null, "publishedAt": "2020-04-25T20:53:00Z", "content": "Doctors are now reporting cases where the coronavirus (COVID-19) may be causing blood clots and consequently, strokes in a small number of people in their 30s and 40s. These young and middle-aged patients, some who did not know they had COVID-19, were not oth… [+4167 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Mehr Gill", "title": "Explained: Types of human coronaviruses and the symptoms they cause - The Indian Express", "description": "While there are hundreds of coronaviruses, there are seven that we know can infect humans.", "url": "https://indianexpress.com/article/explained/types-of-human-coronaviruses-and-symptoms-6368444/", "urlToImage": null, "publishedAt": "2020-04-25T19:50:19Z", "content": "Written by Mehr Gill\r\n | New Delhi | \r\nUpdated: April 25, 2020 6:09:09 pm\r\nHuman coronaviruses were first characterised in the mid-1960s and they are mostly considered to be responsible for causing upper respiratory tract infections in children. (AP illustrat… [+6888 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "RACGP launches nationwide campaign to stop people neglecting their health due to COVID-19 - Mirage News", "description": "The Royal Australian College of General Practitioners (RACGP) has today launched a nationwide campaign to stop people from neglecting their health...", "url": "https://www.miragenews.com/racgp-launches-nationwide-campaign-to-stop-people-neglecting-their-health-due-to-covid-19/", "urlToImage": null, "publishedAt": "2020-04-25T19:36:09Z", "content": "The Royal Australian College of General Practitioners (RACGP) has today launched a nationwide campaign to stop people from neglecting their health concerns during the COVID-19 pandemic.\r\nThe campaign, Expert Advice Matters, will run for 30 days with advertise… [+5584 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "2 cell types are entry points for virus - Hindustan Times", "description": "The respiratory tract is filled with numerous cells, among which are goblet cells and ciliated cells.", "url": "https://www.hindustantimes.com/india-news/2-cell-types-are-entry-points-for-virus/story-VZ250MIqdc4r0OIzxsTqPJ.html", "urlToImage": null, "publishedAt": "2020-04-25T17:54:31Z", "content": "Scientists have identified two types of cells in the nose that are likely to be point of infection for the Sars-CoV-2 virus, which causes Covid-19, in the body.\r\nThe respiratory tract is filled with numerous cells, among which are goblet cells and ciliated ce… [+2449 chars]"}, {"source": {"id": null, "name": "Theleader.com.au"}, "author": "Carly Waters and Benita Kolovos", "title": "Victoria elective surgeries set to return | St George & Sutherland Shire Leader | St George, NSW - St George and Sutherland Shire Leader", "description": "Victoria will not follow in the footsteps of other states in easing some social distancing measures, despite a steady decline in the number of new COVID-19 ca...", "url": "https://www.theleader.com.au/story/6735329/no-plans-to-relax-rules-open-vic-schools/?cs=9397", "urlToImage": null, "publishedAt": "2020-04-25T17:30:42Z", "content": "Victoria will not follow in the footsteps of other states in easing some social distancing measures, despite a steady decline in the number of new COVID-19 cases.\r\nHealth Minister Jenny Mikakos confirmed the state recorded one death and three new coronavirus … [+2910 chars]"}, {"source": {"id": null, "name": "Newcastlestar.com.au"}, "author": null, "title": "Contact checks on WA's latest virus case | The Star | Newcastle, NSW - Newcastle Star", "description": "Western Australia will relax its coronavirus restrictions to allow up to 10 people to gather for non-work activities, as the state recorded another day of no...", "url": "https://www.newcastlestar.com.au/story/6735328/wa-cautiously-relaxes-virus-restrictions/?cs=7", "urlToImage": null, "publishedAt": "2020-04-25T17:30:39Z", "content": "Western Australia will relax its coronavirus restrictions to allow up to 10 people to gather for non-work activities, as the state recorded another day of no new COVID-19 cases.\r\nPremier Mark McGowan said it was a \"cautious relaxation\" of restrictions, acknow… [+1570 chars]"}, {"source": {"id": null, "name": "Hepburnadvocate.com.au"}, "author": null, "title": "SA near end of coronavirus testing blitz - Hepburn Advocate", "description": "South Australia has recorded no new cases of coronavirus for the fourth consecutive day, as the state government urged people with other serious medical issue...", "url": "https://www.hepburnadvocate.com.au/story/6735327/sa-hospital-numbers-down-amid-covid-19/?cs=7", "urlToImage": null, "publishedAt": "2020-04-25T17:30:09Z", "content": "South Australia has recorded no new cases of coronavirus for the fourth consecutive day, as the state government urged people with other serious medical issues to not let the pandemic stop them seeking help.\r\nThe state has confirmed a total of 438 cases, but … [+1837 chars]"}, {"source": {"id": null, "name": "Independentaustralia.net"}, "author": null, "title": "Still in the dark over COVID-19, testing and re-testing is vital - Independent Australia", "description": "To hedge risk, we need to estimate the risk. Yet COVID-19 involves too much uncertainty to know.", "url": "https://independentaustralia.net/life/life-display/still-in-the-dark-over-covid-19-testing-and-re-testing-is-vital,13829", "urlToImage": null, "publishedAt": "2020-04-25T16:34:43Z", "content": "To hedge risk, we need to estimate the risk. Yet COVID-19 involves too much uncertainty to know.\r\nWe have to rely on the experience of other countries and other viruses. We know more than a month ago, but still need to know more. We need to know the likelihoo… [+6348 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Sweden goes it alone with 'relaxed' attitude to coronavirus - CGTN", "description": "Sweden's relaxed restrictions could lead to herd immunity but at what cost?", "url": "https://newseu.cgtn.com/news/2020-04-25/Sweden-goes-it-alone-with-relaxed-attitude-to-coronavirus-PYIUqQSwH6/index.html", "urlToImage": null, "publishedAt": "2020-04-25T12:41:25Z", "content": "Everyone wants immunity from the coronavirus. But there may be different ways to get it.\r\nOne is a vaccine. Clinical trials are already underway in the UK, and if all goes well, say those involved, it's possible a vaccination may be ready for production by Se… [+3523 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What older adults need to know about COVID-19 - Bangor Daily News", "description": "Jay Butler Deputy Director for Infectious Diseases at CDC describes preventative measures to help protect older adults from COVID-19. Video by the Centers fo...", "url": "https://www.youtube.com/watch?v=p6wEOCHdEu4", "urlToImage": null, "publishedAt": "2020-04-25T12:19:04Z", "content": null}, {"source": {"id": null, "name": "Gulftoday.ae"}, "author": null, "title": "Coronavirus is not manipulated or constructed, says WHO - Gulf Today", "description": "All available evidence to date suggests that the novel coronavirus has a natural animal origin and was not a manipulated or constructed virus, the World Health Organization (WHO) said.", "url": "https://www.gulftoday.ae/lifestyle/2020/04/25/coronavirus-is-not-manipulated-or-constructed-says-who", "urlToImage": null, "publishedAt": "2020-04-25T09:56:19Z", "content": "This image has been used for illustrative purpose. \r\nAll available evidence to date suggests that the novel coronavirus has a natural animal origin and was not a manipulated or constructed virus, the World Health Organization (WHO) said.\r\n\"Many researchers ha… [+1395 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Baby makes 'miracle' recovery to beat virus - Chinchilla News", "description": "Doctors held grave fears for this six-month old-baby when she contracted COVID-19, but she pulled through against all odds and has become a symbol of hope.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-sixmonthold-baby-from-manchester-beats-covid19-parents-overjoyed/news-story/dd23c0c28d8689c2497724fdb6291258", "urlToImage": null, "publishedAt": "2020-04-25T09:49:00Z", "content": "Already severely underweight and with other medical complications, doctors thought this six-month-old baby was done for when she contracted COVID-19.\r\nBut Erin Bates pulled through and has become a symbol of hope for others.\r\nThe baby from Manchester, England… [+3615 chars]"}, {"source": {"id": null, "name": "Macarthuradvertiser.com.au"}, "author": "Gus McCubbing", "title": "Blue Mtns health worker positive for virus | Campbelltown - Campbelltown Macarthur Advertiser", "description": "An 83-year-old man has died from COVID-19 at an aged care facility in western Sydney, taking the state's virus toll to 36. The man was a resident at Anglicare...", "url": "https://www.macarthuradvertiser.com.au/story/6734966/sixth-virus-death-at-nsw-age-care-facility/?cs=9397", "urlToImage": null, "publishedAt": "2020-04-25T09:27:18Z", "content": "An 83-year-old man has died from COVID-19 at an aged care facility in western Sydney, taking the state's virus toll to 36.\r\nThe man was a resident at Anglicare Newmarch House in Cadden and is the sixth death at the facility.\r\nThe facility is the state's large… [+2026 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "France to trial nicotine patches to prevent COVID-19 - Big Rigs", "description": "Despite repeated warnings that smokers have a higher risk of severe cases one European country is hoping to trial nicotine patches on healthcare workers.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-france-to-trial-nicotine-patches-to-prevent-covid19/news-story/616d8f570780c5eba4d76b34ba015c7e", "urlToImage": null, "publishedAt": "2020-04-25T07:40:37Z", "content": "France is hoping to trial nicotine patches on healthcare workers after a study suggested that smokers may have a lesser chance of catching coronavirus.\r\nThe surprising findings come despite health officials around the world repeatedly warning that smokers who… [+2894 chars]"}, {"source": {"id": null, "name": "Couriermail.com.au"}, "author": "Janelle Miles", "title": "Qld health authorities trying to track Virgin passengers after coronavirus diagnosis - Courier Mail", "description": "QUEENSLAND recorded just 16 new cases of pandemic coronavirus in the past week, including a passenger on a Virgin Australia flight into Brisbane from Melbourne.", "url": "https://www.couriermail.com.au/coronavirus/qld-health-authorities-trying-to-track-virgin-passengers-seated-near-someone-who-later-tested-positive-to-the-novel-coronavirus/news-story/99e019f7d2757638cb147813bcae2280", "urlToImage": null, "publishedAt": "2020-04-25T07:28:00Z", "content": "QUEENSLAND recorded just 16 new cases of pandemic coronavirus in the past week, including a passenger on a Virgin Australia flight into Brisbane from Melbourne.\r\nPublic Health authorities are still trying to track down passengers from flight VA341 last Monday… [+2831 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "The Conversation", "title": "The truth about Australia's coronavirus 'exit strategy' - Yahoo News Australia", "description": "As the COVID-19 curve starts to flatten in Australia, people are rightly wondering how we will roll back the current lockdown.", "url": "https://au.news.yahoo.com/the-truth-about-australias-coronavirus-exit-strategy-072320488.html", "urlToImage": null, "publishedAt": "2020-04-25T07:23:00Z", "content": "As the COVID-19 curve starts to flatten in Australia and New Zealand, people are rightly wondering how we will roll back current lockdown policies.\r\nAustralias Federal Health Minister Greg Hunt says Australia is looking to South Korea, Japan and Singapore to … [+6727 chars]"}, {"source": {"id": null, "name": "Bendigoadvertiser.com.au"}, "author": "Karen Sweeney and Andi Yu", "title": "Three new COVID-19 cases in Victoria - Bendigo Advertiser", "description": "The stark contrast between the slow spread of coronavirus in Victoria and the pandemic internationally makes the state the \"envy of the world\". Deputy chief h...", "url": "https://www.bendigoadvertiser.com.au/story/6734968/vic-cases-enviable-but-virus-is-not-over/", "urlToImage": null, "publishedAt": "2020-04-25T03:58:00Z", "content": ""}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": null, "title": "Dentists, doctors, registered nurses most at risk of catching COVID-19 - Daily Telegraph", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.dailytelegraph.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T03:00:00Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": null, "title": "British soldiers to get insect repellant as COVID-19 protection - msnNOW", "description": "British armed forces are to be given insect repellent to protect them against COVID-19 infection, it has emerged.", "url": "https://www.theguardian.com/world/2020/apr/24/british-soldiers-to-get-insect-repellant-as-covid-19-protection", "urlToImage": null, "publishedAt": "2020-04-25T00:30:00Z", "content": "© ASSOCIATED PRESS\r\n British Army soldiers get instructions outside the ExCel center which is being turned in to a 4000 bed temporary hospital for coronavirus patients in London, Tuesday, March 31, 2020. The new coronavirus causes mild or moderate symptoms fo… [+2124 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Alexander Brown", "title": "Coronavirus: UK warned of virus last year, leaked document reveals - NT News", "description": "UK ministers were warned about the risk of coronavirus last year and told to stockpile PPE, a leaked document has revealed.", "url": "https://www.news.com.au/world/europe/coronavirus-uk-warned-of-virus-last-year-leaked-document-reveals/news-story/40a62e703cde27ad5b3f17510c901f32", "urlToImage": null, "publishedAt": "2020-04-25T00:27:00Z", "content": "UK ministers were warned about the risk of coronavirus last year and told to stockpile PPE, a leaked document has revealed.\r\nThe detailed Cabinet Office document claimed a pandemic could cost tens of thousands of lives and demanded “capability requirements” t… [+3487 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Baked beans an unlikely nutrition star, and pandemic hit - Health - ABC News", "description": "While baked beans might not look particularly sexy, they're a favourite among nutrition experts. Here's why.", "url": "https://www.abc.net.au/news/health/2020-04-25/baked-beans-an-unlikely-nutrition-star/12176974", "urlToImage": null, "publishedAt": "2020-04-25T00:17:11Z", "content": "As we all fight our inner \"prepper\" and try not to succumb to panic buying, it seems many of us have turned to an old favourite: baked beans.\r\nBean production at Australia's largest fruit and vegetable cannery in Shepparton, Victoria, has doubled its usual vo… [+5001 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": "Kate Kelland And Manas Mishra", "title": "Could warm weather help contain pandemic? - The Australian", "description": "As the seasons change in the northern and southern hemispheres, questions are being asked about the influence of weather in the spread of coronavirus, which has killed more than 190,000 people and sent the global economy into a tailspin.", "url": "https://www.theaustralian.com.au/news/latest-news/could-warm-weather-help-contain-pandemic/news-story/3151c026d02efea4a5c503ede2417b8d", "urlToImage": null, "publishedAt": "2020-04-25T00:12:00Z", "content": "<ul><li>By Kate Kelland And Manas Mishra</li><li>Reuters</li><li>10:12AM April 25, 2020</li></ul>As the seasons change in the northern and southern hemispheres, questions are being asked about the influence of weather in the spread of coronavirus, which has k… [+3653 chars]"}, {"source": {"id": null, "name": "Geelongadvertiser.com.au"}, "author": null, "title": "Active COVID-19 cases plunging in Australia - Geelong Advertiser", "description": "Subscribe to the Geelong Advertiser to get unrestricted digital access, home paper delivery, Apps for iPad and Android and much more...", "url": "https://www.geelongadvertiser.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T00:02:34Z", "content": null}, {"source": {"id": null, "name": "Startsat60.com"}, "author": "Jocelyn Nickels", "title": "Create your own fabric face mask to help prevent the spread of Covid-19 - Starts at 60", "description": "Certain fabrics will provide better protection and help slow the spread of coronavirus.", "url": "https://startsat60.com/discover/lifestyle/crafts/diy-fabric-masks-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T00:00:18Z", "content": "Simply grab your fabric of choice, fold the sides a few times into the middle and place a rubber band over each end. Then use the rubber bands to secure the mask over your ears its as easy as that!\r\nPeople have since followed Adams advice and got on board the… [+2684 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "CNN", "title": "Coronavirus update: Experts say not to wipe down groceries or takeout but wash your hands - 7NEWS.com.au", "description": "One of the scientists who found the virus might live on cardboard for up to 24 hours and metal and plastic for two to three days has spoken out.", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-update-experts-say-not-to-wipe-down-groceries-or-takeout-but-wash-your-hands-c-998677", "urlToImage": null, "publishedAt": "2020-04-24T23:12:48Z", "content": "Experts say it might be time to reconsider wiping down your groceries and take-out food.\r\nThe US Food and Drug Administration (FDA) has joined the chorus of scientific experts who say there is no real risk of getting the virus that causes COVID-19 that way.\r\n… [+3845 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "NBC", "title": "Coronavirus update: US study reveals common medical conditions in sickest COVID-19 patients - 7NEWS.com.au", "description": "Researchers have issued a warning to those with the health problems to be hyper-aware of new or unusual symptoms.", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-update-us-study-reveals-common-medical-conditions-in-sickest-covid-19-patients-c-998646", "urlToImage": null, "publishedAt": "2020-04-24T22:49:11Z", "content": "People with obesity, diabetes and high blood pressure are at greater risk for complications from coronavirus, according to a large study of patients hospitalised with the illness it causes.\r\nThe findings, published on Wednesday in the Journal of the American … [+2322 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Sydney doctor Edward O’Neill in UK coronavirus vaccine trial - 7NEWS.com.au", "description": "Edward O'Neill believes taking part in a UK coronavirus vaccine trial is the right thing to do but admits he's taking a \"walk in faith\".", "url": "https://7news.com.au/lifestyle/health-wellbeing/aussie-to-walk-in-faith-in-vaccine-trial-c-998463", "urlToImage": null, "publishedAt": "2020-04-24T21:49:15Z", "content": "An Australian man who is testing a potential coronavirus vaccine in the UK says he is taking a walk in faith.\r\nDr Edward ONeill was one of the first two people injected as part of trials for a potential vaccine that has been developed by Oxford University.\r\nT… [+1441 chars]"}, {"source": {"id": null, "name": "Popsugar.com.au"}, "author": "Kate Schweitzer", "title": "Cats Can, In Fact, Get Coronavirus: Here’s What Pet Owners Need to Know - POPSUGAR Australia", "description": "What", "url": "https://www.popsugar.com.au/pets/how-to-tell-if-your-cat-has-coronavirus-47419889", "urlToImage": null, "publishedAt": "2020-04-24T21:30:35Z", "content": "It was confirmed this week that two domesticated cats had been infected with the coronavirus in the United States. Following early news reports of lions and tigers showing COVID-19 symptoms at a New York zoo, this is the first case of household pets testing p… [+4817 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Olivia Willis", "title": "When coronavirus patients suddenly decline, their own immune system might be to blame - ABC News", "description": "In some cases of COVID-19, it may be the body's response to the virus, rather than the virus itself, that ultimately causes harm.", "url": "https://www.abc.net.au/news/health/2020-04-25/coronavirus-covid-immune-response-causes-harm/12176872", "urlToImage": null, "publishedAt": "2020-04-24T20:30:29Z", "content": "It's been described as the \"second week crash\".\r\nAbout seven days after developing symptoms of COVID-19, some people even those with mild symptoms can suddenly start to deteriorate, often with little warning.\r\n\"They end up getting admitted to hospital, and ab… [+6217 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "Dr Kathleen Matthews answers your questions about dental health - Gold Coast Bulletin", "description": "COVID-19 had brought tight restrictions on Australian dentists, limiting them to providing just urgent and emergency treatment.", "url": "https://www.news.com.au/national/dr-kathleen-matthews-answers-your-questions-about-dental-health/news-story/e429a06086e4486410137ef9883a15ed", "urlToImage": null, "publishedAt": "2020-04-24T20:06:12Z", "content": "COVID-19 had brought tight restrictions on Australian dentists, limiting them to providing just urgent and emergency treatment.\r\nBut from Monday, the Federal Government has said so-called level three restrictions can be relaxed to level two, meaning patients … [+5245 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": null, "title": "Carrying books, not virus at school - Daily Telegraph", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.dailytelegraph.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-24T20:00:22Z", "content": null}, {"source": {"id": null, "name": "9news.com.au"}, "author": "Associated Press", "title": "France braces for second wave of infections; EPA contradicts Trump disinfectant 'cure' suggestion - 9News", "description": "<p>France is preparing for a <a href=\"https://news-website-prev.ap-southeast-2.elasticbeanstalk.com/world/worst-ways-coronavirus-pandemic-has-been-handled/c7a84cfa-a169-4fb1-bff9-a574381543de\">second wave of virus cases</a>, Britain is reporting nearly 20,000…", "url": "https://www.9news.com.au/world/france-braces-for-coronavirus-second-wave/8c127830-54ed-4fc6-97f4-f26618ab4f4e", "urlToImage": null, "publishedAt": "2020-04-24T19:54:51Z", "content": "Property News: Creative ways people are staying connected during isolation - domain.com.au"}, {"source": {"id": null, "name": "China.org.cn"}, "author": "", "title": "Sweden sees rise in coronavirus-related deaths - China.org.cn", "description": null, "url": "http://www.china.org.cn/world/Off_the_Wire/2020-04/25/content_75973508.htm", "urlToImage": null, "publishedAt": "2020-04-24T19:45:59Z", "content": "STOCKHOLM, April 24 (Xinhua) -- A new spike in COVID-19 cases in the Swedish capital of Stockholm could signal that residents have started to relax about social distancing recommendations, the country's health authorities said on Friday.\r\nA total of 1,152 peo… [+3212 chars]"}, {"source": {"id": null, "name": "Thecourier.com.au"}, "author": "Karen Sweeney and Andi Yu", "title": "New Vic laws and virus outbreak probe - Ballarat Courier", "description": "The stark contrast between the slow spread of coronavirus in Victoria and the pandemic internationally makes the state the \"envy of the world\". Deputy chief h...", "url": "https://www.thecourier.com.au/story/6734968/vic-cases-enviable-but-virus-is-not-over/?cs=10229", "urlToImage": null, "publishedAt": "2020-04-24T17:31:40Z", "content": ""}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "'Sage did not advise a specific target' for Covid-19 testing, says Chris Whitty - The Telegraph", "description": "Chief Medical Officer, Chris Whitty, appears in front of the Science and Tech Committee to answer questions of Covid-19 testing Get the latest headlines: htt...", "url": "https://www.youtube.com/watch?v=TXaG8YVLm8U", "urlToImage": null, "publishedAt": "2020-04-24T16:35:21Z", "content": "Chief Medical Officer, Chris Whitty, appears in front of the Science and Tech Committee to answer questions of Covid-19 testing\r\nGet the latest headlines: https://www.telegraph.co.uk/\r\nTelegraph.co.uk and YouTube.com/TelegraphTV are websites of The Telegraph,… [+137 chars]"}, {"source": {"id": null, "name": "News4jax.com"}, "author": "Elizabeth Misson, Cleveland Clinic News Service", "title": "Seek care for heart emergencies during COVID-19 - WJXT News4JAX ", "description": "According to a recent study, since the COVID-19 crisis emerged, emergency rooms across the country are actually seeing fewer patients.", "url": "https://www.news4jax.com/health/2020/04/24/seek-care-for-heart-emergencies-during-covid-19/", "urlToImage": null, "publishedAt": "2020-04-24T16:21:07Z", "content": "According to a recent study, since the COVID-19 crisis emerged, emergency rooms across the country are actually seeing fewer patients.\r\nExperts believe people are delaying care for emergency health issues due to fears of coming in contact with the coronavirus… [+2022 chars]"}]}