{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Smh.com.au"}, "author": "Latika Bourke", "title": "Coronavirus updates LIVE: Global COVID-19 cases surpass 2.8 million, Trump claims Dettol treatment suggestion was sarcastic, Australia's death toll stands at 81 - The Sydney Morning Herald", "description": "If you suspect you or a family member has coronavirus you should call (not visit) your GP or ring the national Coronavirus Health Information Hotline on 1800 020 080.", "url": "https://www.smh.com.au/national/coronavirus-updates-live-global-covid-19-cases-surpass-2-8-million-trump-suggests-dettol-as-treatment-as-australia-s-death-toll-stands-at-81-20200425-p54n8c.html", "urlToImage": null, "publishedAt": "2020-04-25T15:39:00Z", "content": "\"We were emphasising that this was a once-in-a-century global health challenge,\" Powis said when asked about the latest figures.\r\n\"Moving past 20,000 deaths just reminds everybody that it is still absolutely critical that we continue to follow the social dist… [+567 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Maxouris, CNN", "title": "Coronavirus has killed nearly 52,000 people in the US, over a quarter of the world's deaths - CNN", "description": "Less than three months since the first known coronavirus death in the US, the country's reported fatalities make up more than a quarter of the world's known Covid-19 death toll.", "url": "https://www.cnn.com/2020/04/25/health/us-coronavirus-saturday/index.html", "urlToImage": null, "publishedAt": "2020-04-25T14:35:35Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "'No evidence' yet that recovered Covid-19 patients cannot be reinfected: WHO - Times of India", "description": "Rest of World News: The WHO said on Saturday that there was currently \"no evidence\" that people who have recovered from Covid-19 and have antibodies are protected from a", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/no-evidence-yet-that-recovered-covid-patients-cannot-be-reinfected-who/articleshow/75374877.cms", "urlToImage": null, "publishedAt": "2020-04-25T14:22:36Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Dana McCauley", "title": "Fertility patients eager to restart IVF treatment when ban lifts - Sydney Morning Herald", "description": "IVF clinics are fielding calls from patients desperate to restart their fertility treatment after the federal government lifted its ban on elective surgery, but not everyone will be able to book in when the industry restarts next week.", "url": "https://www.smh.com.au/politics/federal/fertility-patients-eager-to-restart-ivf-treatment-when-ban-lifts-20200425-p54n6w.html", "urlToImage": null, "publishedAt": "2020-04-25T14:01:14Z", "content": "While she has been given the green light to start treatment, not everyone has been so lucky.\r\nAssociate Professor Peter Illingworth, medical director of IVF Australia, wrote to patients warning that while the fertility provider was \"aiming to accommodate ever… [+2339 chars]"}, {"source": {"id": null, "name": "Thenewdaily.com.au"}, "author": null, "title": "Coronavirus vaccine: Dr Peter Doherty tells us how likely it is we’ll get one - The New Daily", "description": "This week, in a wide-ranging interview with The New Daily, Professor Peter Doherty, Nobel Laureate and immunologist, talked about the likelihood of a vaccine for COVID-19 being developed, and what happens if we don't get one.", "url": "https://thenewdaily.com.au/life/wellbeing/2020/04/25/coronavirus-vaccine-peter-doherty/", "urlToImage": null, "publishedAt": "2020-04-25T12:18:21Z", "content": "This week, in a wide-ranging interview with The New Daily, Professor Peter Doherty, Nobel Laureate and immunologist, talked about the likelihood of a vaccine for COVID-19 being developed, and what happens if we don’t get one.\r\nThe short answer is that COVID-1… [+3849 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Lauren McMah", "title": "Coronavirus: Antibodies tests could restart countries but also have dangers - NEWS.com.au", "description": "Coronavirus: Antibodies tests could restart countries but also have dangers", "url": "https://www.news.com.au/travel/travel-updates/health-safety/coronavirus-antibodies-tests-could-restart-countries-but-also-have-dangers/news-story/77beebb098069c539997a0648312cbab", "urlToImage": null, "publishedAt": "2020-04-25T12:06:42Z", "content": "As a world besieged by COVID-19 waits in hope for a vaccine that may or may not come, antibody tests could be the next best thing. The finger prick tests with rapid results, which are already being used in some populations, can detect people who have already … [+5427 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Morgan Gstalter", "title": "WHO says there's 'no evidence' recovered coronavirus patients won't get reinfected | TheHill - The Hill", "description": "The World Health Organization (WHO) says there is currently “no evidence” showing that...", "url": "https://thehill.com/homenews/news/494628-who-says-theres-no-evidence-recovered-coronavirus-patients-wont-get", "urlToImage": null, "publishedAt": "2020-04-25T12:01:30Z", "content": "The World Health Organization (WHO) says there is currently no evidence showing that people who have recovered from the coronavirus are not at risk of becoming infected again.\r\nSeveral countries, including the United States, have considered the idea of writte… [+2035 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "'No evidence' that recovered COVID-19 patients cannot be reinfected: WHO - Reuters", "description": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.", "url": "https://www.reuters.com/article/us-health-coronavirus-who-idUSKCN2270FB", "urlToImage": null, "publishedAt": "2020-04-25T11:46:58Z", "content": "GENEVA (Reuters) - The World Health Organization (WHO) said on Saturday that there was currently “no evidence” that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection. \r\nIn a scientific brief, the Uni… [+1753 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mom and Baby Who Had to Wait 3 Weeks to Meet Now Home Safe - Inside Edition", "description": "She’s the mom who’s reunion with her newborn after 25 days touched the hearts of millions. Iris Nolasco was 7 months pregnant when she was diagnosed with COV...", "url": "https://www.youtube.com/watch?v=0KRisIYu4j8", "urlToImage": null, "publishedAt": "2020-04-25T11:00:19Z", "content": null}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Baby makes 'miracle' recovery to beat virus - Balonne Beacon", "description": "Doctors held grave fears for this six-month old-baby when she contracted COVID-19, but she pulled through against all odds and has become a symbol of hope.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-sixmonthold-baby-from-manchester-beats-covid19-parents-overjoyed/news-story/dd23c0c28d8689c2497724fdb6291258", "urlToImage": null, "publishedAt": "2020-04-25T09:51:19Z", "content": "Already severely underweight and with other medical complications, doctors thought this six-month-old baby was done for when she contracted COVID-19.\r\nBut Erin Bates pulled through and has become a symbol of hope for others.\r\nThe baby from Manchester, England… [+3615 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Baby makes 'miracle' virus recovery - Noosa News", "description": "Doctors held grave fears for this six-month old-baby when she contracted COVID-19, but she pulled through against all odds and has become a symbol of hope.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-sixmonthold-baby-from-manchester-beats-covid19-parents-overjoyed/news-story/dd23c0c28d8689c2497724fdb6291258", "urlToImage": null, "publishedAt": "2020-04-25T09:49:00Z", "content": "Already severely underweight and with other medical complications, doctors thought this six-month-old baby was done for when she contracted COVID-19.\r\nBut Erin Bates pulled through and has become a symbol of hope for others.\r\nThe baby from Manchester, England… [+3615 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Calla Wahlquist", "title": "Health authorities defend handling of coronavirus cluster at Melbourne psychiatric facility - The Guardian", "description": "Fifteen people, including six patients, from the Albert Road Clinic have tested positive to Covid-19 since 24 March", "url": "https://www.theguardian.com/australia-news/2020/apr/25/health-authorities-defend-handling-of-coronavirus-cluster-at-melbourne-psychiatric-facility", "urlToImage": null, "publishedAt": "2020-04-25T09:33:43Z", "content": "Victorian health authorities have defended their response to a coronavirus outbreak in an inpatient psychiatric facility after staff and patients were not told of the cluster until one month after the first positive test.\r\nMeanwhile more than 180 Australians … [+4243 chars]"}, {"source": {"id": null, "name": "Straitstimes.com"}, "author": "hermesauto", "title": "You may catch coronavirus more than once: WHO - The Straits Times", "description": "\"There is currently no evidence that people who have recovered from Covid-19 and have antibodies are protected from a second infection,\" it said.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/world/europe/you-may-catch-coronavirus-more-than-once-who", "urlToImage": null, "publishedAt": "2020-04-25T09:29:34Z", "content": null}, {"source": {"id": null, "name": "Northerndailyleader.com.au"}, "author": "Gus McCubbing", "title": "Blue Mtns health worker positive for virus - The Northern Daily Leader", "description": "An 83-year-old man has died from COVID-19 at an aged care facility in western Sydney, taking the state's virus toll to 36. The man was a resident at Anglicare...", "url": "https://www.northerndailyleader.com.au/story/6734966/sixth-virus-death-at-nsw-age-care-facility/", "urlToImage": null, "publishedAt": "2020-04-25T09:27:18Z", "content": ""}, {"source": {"id": null, "name": "Theguardian.comworld"}, "author": "Sarah Marsh, Nazia Parveen", "title": "England campaign targets seriously ill patients avoiding hospitals - The Guardian", "description": "Campaign will urge people with serious non-coronavirus-related conditions to seek help", "url": "https://amp.theguardian.comworld/2020/apr/25/england-campaign-targets-seriously-ill-patients-avoiding-hospitals", "urlToImage": null, "publishedAt": "2020-04-25T07:46:47Z", "content": "A government campaign has been launched to encourage people seriously ill with non-Covid conditions such as heart attacks to seek help amid concerns some are avoiding hospitals.\r\nThe campaign, which will be rolled out next week, aims to encourage people to us… [+4549 chars]"}, {"source": {"id": null, "name": "Brisbanetimes.com.au"}, "author": "Jocelyn Garcia", "title": "Queensland's weekly COVID-19 tally drops by more than two thirds - Sydney Morning Herald", "description": "The coronavirus case total has risen to 1026. Police have fined 33 people in the past 24 hours for breaching public health directions. Since March 27, 1,354 fines have been dished out.", "url": "https://www.brisbanetimes.com.au/national/queensland/queensland-s-weekly-covid-19-tally-drops-by-more-than-two-thirds-20200425-p54n6y.html", "urlToImage": null, "publishedAt": "2020-04-25T07:45:50Z", "content": "Chief Health Officer Jeannette Young said 964 of the confirmed patients in Queensland had recently travelled overseas or had close contact with a confirmed case, such as their partner or flatmate.\r\nPolice have fined 33 people in the past 24 hours for breachin… [+1102 chars]"}, {"source": {"id": null, "name": "Ballinaadvocate.com.au"}, "author": "", "title": "Nicotine patches 'may prevent virus' - Ballina Shire Advocate", "description": "Despite repeated warnings that smokers have a higher risk of severe cases one European country is hoping to trial nicotine patches on healthcare workers.", "url": "https://www.ballinaadvocate.com.au/news/nicotine-patches-may-prevent-virus/4002631/", "urlToImage": null, "publishedAt": "2020-04-25T07:23:36Z", "content": "France is hoping to trial nicotine patches on healthcare workers after a study suggested that smokers may have a lesser chance of catching coronavirus.\r\nThe surprising findings come despite health officials around the world repeatedly warning that smokers who… [+2894 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Digital Staff", "title": "Twin sister nurses die within three days of each other from coronavirus in the UK - 7NEWS.com.au", "description": "“They always said they had come into the world together and would go out together as well.”", "url": "https://7news.com.au/lifestyle/health-wellbeing/twin-sister-nurses-die-within-three-days-of-each-other-from-coronavirus-in-the-uk-c-999118", "urlToImage": null, "publishedAt": "2020-04-25T07:19:57Z", "content": "Twin sisters have died within just three days of each other after they both contracted coronavirus.\r\nKaty and Emma Davis, 37, died at a hospital in the UK this week and their other sister Zoe said they were dedicated to helping other people.\r\nThe twin sisters… [+878 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Dailymail.com Reporter", "title": "Cyclist who confronted CNN's Chris Cuomo in his backyard says the host was like a 'boiling pot' - Daily Mail", "description": "David Whelan claimed that the anchor berated him as he asked Cuomo why he was not self-quarantining on Easter Sunday.", "url": "https://www.dailymail.co.uk/news/article-8255903/Cyclist-confronted-CNNs-Chris-Cuomo-backyard-says-host-like-boiling-pot.html", "urlToImage": null, "publishedAt": "2020-04-25T06:58:02Z", "content": "The Long Island bicyclist who got into a verbal spat with CNN anchor Chris Cuomo on Easter Sunday said the host was like a 'boiling pot' as he was confronted for not self-quarantining.\r\nDavid Whelan claimed that he had decided to go on a bike ride near where … [+4687 chars]"}, {"source": {"id": null, "name": "Thewest.com.au"}, "author": "The West Australian", "title": "Coronavirus crisis: WA reports only one new case of COVID-19 - The West Australian", "description": "Just one new case of COVID-19 was reported today, bringing the State’s infection total to 549.", "url": "https://thewest.com.au/news/coronavirus/coronavirus-crisis-wa-reports-only-one-new-case-of-covid-19-ng-b881530012z", "urlToImage": null, "publishedAt": "2020-04-25T06:23:11Z", "content": "A 65-year-old Perth woman, linked to a cruise ship that docked in Italy last month, is WAs latest COVID-19 case, bringing the states infections to 549.\r\nThe woman was on board the Costa Luminosa cruise ship, which docked in Italy on March 1.\r\nShe developed CO… [+1657 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Lucy Mae Beers", "title": "South Australia has zero new coronavirus cases for third day in a row - 7NEWS.com.au", "description": "A total of 92 per cent of people infected in the state have recovered.", "url": "https://7news.com.au/lifestyle/health-wellbeing/south-australia-has-zero-new-coronavirus-cases-for-third-day-in-a-row-c-999085", "urlToImage": null, "publishedAt": "2020-04-25T06:17:36Z", "content": "South Australia has recorded zero new coronavirus cases for the third day in a row.\r\nOn Saturday, Acting Chief Medical Officer Dr Michael Cusack gave an update saying the 438 cases in the state remains the same.\r\nA total of 92 per cent of people infected in t… [+316 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rosa Flores, Sara Weisfeldt and Arman Azad, CNN", "title": "2 studies show many people who tested positive for Covid-19 displayed no symptoms - CNN", "description": "Two coronavirus studies released Friday -- one involving almost 2,000 people from Florida and the other from a Washington state nursing home -- came to the same conclusion: Many of the people who tested positive for the virus didn't know it they had it becaus…", "url": "https://www.cnn.com/2020/04/24/us/2-asymptomatic-coronavirus-studies/index.html", "urlToImage": null, "publishedAt": "2020-04-25T04:54:54Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Health Headlines - 4-24-20 - FOX 47 News", "description": "In today's health headlines we talk about COVID toes, toes that are red and swollen. There is no correlation to say that people with these symptoms have COVI...", "url": "https://www.youtube.com/watch?v=laF68DLqBuA", "urlToImage": null, "publishedAt": "2020-04-25T03:33:13Z", "content": "In today's health headlines we talk about COVID toes, toes that are red and swollen. There is no correlation to say that people with these symptoms have COVID-19 but they tend to clear up in a few weeks."}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": "Jane Hansen", "title": "Risky business: 100 jobs most at risk of COVID-19 - Balonne Beacon", "description": "They are the 100 occupations most at risk of contracting COVID-19. And while some are obvious given their exposure to people, others far less so.", "url": "https://www.dailytelegraph.com.au/coronavirus/dentists-doctors-registered-nurses-most-at-risk-of-catching-covid19/news-story/880ffd1dc28abcf3c5b26fe6e16d773f", "urlToImage": null, "publishedAt": "2020-04-25T03:21:02Z", "content": "While doctors and nurses are the heroes on the front line, risking greater exposure to coronavirus, many other occupations also have risk and analysts have crunched the data into an occupation risk score.\r\nThe US-based Occupation Information Network has found… [+4558 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": null, "title": "Dentists, doctors, registered nurses most at risk of catching COVID-19 - Daily Telegraph", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.dailytelegraph.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T03:00:00Z", "content": null}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "COVID-19 kills in 'brain to toe rampage' - Daily Mercury", "description": "Medical experts have described how coronavirus kills its victims in “a ferocious rampage through the body, from brain to toes”.", "url": "https://www.news.com.au/world/coronavirus/health/how-covid19-kills-in-ferocious-rampage-from-brain-to-toes/news-story/76f8edff42d1302b2c9acc8211547ea6", "urlToImage": null, "publishedAt": "2020-04-25T02:28:00Z", "content": "COVID-19 kills \"in a ferocious rampage through the body from brain to toes\" doctors have explained, saying the virus \"acts like no pathogen humanity has ever seen\".\r\nIn an article in sciencemag.org, frontline clinicians caring for the five per cent who become… [+7313 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Baked beans an unlikely nutrition star, and pandemic hit - Health - ABC News", "description": "While baked beans might not look particularly sexy, they're a favourite among nutrition experts. Here's why.", "url": "https://www.abc.net.au/news/health/2020-04-25/baked-beans-an-unlikely-nutrition-star/12176974", "urlToImage": null, "publishedAt": "2020-04-25T00:17:11Z", "content": "As we all fight our inner \"prepper\" and try not to succumb to panic buying, it seems many of us have turned to an old favourite: baked beans.\r\nBean production at Australia's largest fruit and vegetable cannery in Shepparton, Victoria, has doubled its usual vo… [+5001 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Could warm weather help contain pandemic? - 7NEWS.com.au", "description": "Scientists aren't certain about the link between colder conditions and the spread of coronavirus, but are hoping the northern summer will see the outbreak ease.", "url": "https://7news.com.au/news/health/could-warm-weather-help-contain-pandemic-c-998765", "urlToImage": null, "publishedAt": "2020-04-25T00:08:56Z", "content": "As the seasons change in the northern and southern hemispheres, questions are being asked about the influence of weather in the spread of coronavirus, which has killed more than 190,000 people and sent the global economy into a tailspin.\r\nHere's what we know … [+3556 chars]"}, {"source": {"id": null, "name": "Startsat60.com"}, "author": "Jocelyn Nickels", "title": "Create your own fabric face mask to help prevent the spread of Covid-19 - Starts at 60", "description": "Certain fabrics will provide better protection and help slow the spread of coronavirus.", "url": "https://startsat60.com/discover/lifestyle/crafts/diy-fabric-masks-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T00:00:18Z", "content": "Simply grab your fabric of choice, fold the sides a few times into the middle and place a rubber band over each end. Then use the rubber bands to secure the mask over your ears its as easy as that!\r\nPeople have since followed Adams advice and got on board the… [+2684 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Four-month-old baby from Malappuram dies of Covid-19 - Times of India", "description": "The four-month-old girl child, who tested positive for coronavirus infection two days ago and was under treatment at Kozhikode Medical College Hospita", "url": "https://timesofindia.indiatimes.com/city/kozhikode/four-month-old-baby-from-malappuram-dies-of-covid-19/articleshow/75342997.cms", "urlToImage": null, "publishedAt": "2020-04-24T23:31:25Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "NBC", "title": "Coronavirus update: US study reveals common medical conditions in sickest COVID-19 patients - 7NEWS.com.au", "description": "Researchers have issued a warning to those with the health problems to be hyper-aware of new or unusual symptoms.", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-update-us-study-reveals-common-medical-conditions-in-sickest-covid-19-patients-c-998646", "urlToImage": null, "publishedAt": "2020-04-24T22:49:11Z", "content": "People with obesity, diabetes and high blood pressure are at greater risk for complications from coronavirus, according to a large study of patients hospitalised with the illness it causes.\r\nThe findings, published on Wednesday in the Journal of the American … [+2322 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus Update: New Antibody Testing Site Opens In Sunset Park, Brooklyn - CBS New York", "description": "A new COVID-19 antibody testing site is now open in Brooklyn.", "url": "https://www.youtube.com/watch?v=pmtcbUHGXEA", "urlToImage": null, "publishedAt": "2020-04-24T21:15:39Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Lateshia Beachum", "title": "Researchers found coronavirus in a patient’s eyes — days after it left her nose - The Washington Post", "description": "A new medical report shows contagious particles of coronavirus can be found in the eyes.", "url": "https://www.washingtonpost.com/health/2020/04/24/researchers-found-coronavirus-patients-eyes-days-after-it-left-her-nose/", "urlToImage": null, "publishedAt": "2020-04-24T20:49:43Z", "content": "The report demonstrates that the novel coronavirus can exist in an infected persons eye fluids at probable contagious levels, increasing the need for people to be cognizant about their hand hygiene and to keep their hands away from their face, experts say.\r\nT… [+3742 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Olivia Willis", "title": "When coronavirus patients suddenly decline, their own immune system might be to blame - ABC News", "description": "In some cases of COVID-19, it may be the body's response to the virus, rather than the virus itself, that ultimately causes harm.", "url": "https://www.abc.net.au/news/health/2020-04-25/coronavirus-covid-immune-response-causes-harm/12176872", "urlToImage": null, "publishedAt": "2020-04-24T20:30:29Z", "content": "It's been described as the \"second week crash\".\r\nAbout seven days after developing symptoms of COVID-19, some people even those with mild symptoms can suddenly start to deteriorate, often with little warning.\r\n\"They end up getting admitted to hospital, and ab… [+6217 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Ellie Cambridge", "title": "Coronavirus victim, 29, told fiancee ‘thank you for the best life’ in final moments before fatal coma - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11474318/coronavirus-victim-fiancee-thank-you-life-before-coma/", "urlToImage": null, "publishedAt": "2020-04-24T18:55:09Z", "content": "A CORONAVIRUS victim messaged his fiancee saying \"thank you for the best life\" before he was put into a coma and died.\r\nRichard McKeag, 29, sent the heartbreaking final message to Katie Martin, 25, after they spoke for the last time on Facetime.\r\n Richard McK… [+4731 chars]"}, {"source": {"id": null, "name": "Popculture.com"}, "author": "Anna  Rumer", "title": "Coronavirus Appears to Cause Sudden Strokes in Adults Ages 30-50, According to Doctors - PopCulture.com", "description": "Doctors have found evidence that the coronavirus is causing sudden strokes in adults in their 30s and 40s who are otherwise not debilitatingly ill, reported CNN Wednesday, some of whom are reluctant to call 911 due to concerns about hospital overcrowding due …", "url": "https://popculture.com/trending/news/coronavirus-appears-cause-sudden-strokes-adults-ages-30-50-doctors/", "urlToImage": null, "publishedAt": "2020-04-24T18:55:00Z", "content": "Doctors have found evidence that the coronavirus is causing sudden strokes in adults in their 30s and 40s who are otherwise not debilitatingly ill, reported CNN Wednesday, some of whom are reluctant to call 911 due to concerns about hospital overcrowding due … [+2190 chars]"}, {"source": {"id": null, "name": "9news.com.au"}, "author": "AAP", "title": "Australian doctor takes part in UK coronavirus vaccine trial - 9News", "description": "<p>Australian doctor Edward O&#x27;Neill believes taking part in a UK coronavirus vaccine trial is the right thing to do but admits he&#x27;s taking a &quot;walk in faith&quot;.</p>", "url": "https://www.9news.com.au/national/australian-doctor-takes-part-in-uk-coronavirus-vaccine-trial/a96835e9-93f3-40fc-8640-1ad5aede89c5", "urlToImage": null, "publishedAt": "2020-04-24T18:51:00Z", "content": "Property News: How to set up a home gym: Advice from a personal trainer - domain.com.au"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Researchers enrolling COVID-19 patients for treatment trial - Mirage News", "description": "Getty Images The trial will enroll 630 patients at sites across the country, including the University of Washington. Researchers are now enrolling...", "url": "https://www.miragenews.com/researchers-enrolling-covid-19-patients-for-treatment-trial/", "urlToImage": null, "publishedAt": "2020-04-24T17:36:14Z", "content": "Researchers are now enrolling outpatients with COVID-19 for a randomized controlled trial of the effectiveness of two drug regimens – hydroxychloroquine and hydroxychloroquine with azithromycin.\r\nHydroxychloroquine has received considerable hype as a potentia… [+4916 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "Experts demolish studies suggesting COVID-19 is no worse than flu - Ars Technica", "description": "Authors of widely publicized antibody studies “owe us all an apology,” one expert says.", "url": "https://arstechnica.com/science/2020/04/experts-demolish-studies-suggesting-covid-19-is-no-worse-than-flu/", "urlToImage": null, "publishedAt": "2020-04-24T17:33:00Z", "content": "Enlarge/ A COVID-19 blood test is administered outside of Delmont Medical Care on April 22, 2020 in Franklin Square, New York. The test identifies antibodies to the coronavirus. \r\n135 with 85 posters participating\r\nFrustrated statisticians and epidemiologists… [+9053 chars]"}, {"source": {"id": null, "name": "Thecourier.com.au"}, "author": "Karen Sweeney and Andi Yu", "title": "New Vic laws and virus outbreak probe - Ballarat Courier", "description": "The stark contrast between the slow spread of coronavirus in Victoria and the pandemic internationally makes the state the \"envy of the world\". Deputy chief h...", "url": "https://www.thecourier.com.au/story/6734968/vic-cases-enviable-but-virus-is-not-over/?cs=10229", "urlToImage": null, "publishedAt": "2020-04-24T17:31:40Z", "content": ""}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Study targets smell loss to sniff out COVID-19 - Mirage News", "description": "Researchers hope to offer an early warning sign of coronavirus infection by exploring a sudden loss of smell being experienced by a majority of COVID-19...", "url": "https://www.miragenews.com/study-targets-smell-loss-to-sniff-out-covid-19/", "urlToImage": null, "publishedAt": "2020-04-24T15:14:12Z", "content": "Researchers hope to offer an early warning sign of coronavirus infection by exploring a sudden loss of smell being experienced by a majority of COVID-19 patients. Evidence suggests that more than 60 per cent of COVID-19 patients suffer a loss of smell, called… [+2334 chars]"}, {"source": {"id": null, "name": "Gazettelive.co.uk"}, "author": "Kristy Dawson", "title": "Clap for Carers - firefighters clap for NHS workers outside hospital and carers put on a dance - Gazette Live", "description": "There were emotional scenes for the fifth week as people across Teesside clapped for NHS workers and carers", "url": "https://www.gazettelive.co.uk/news/teesside-news/clap-carers-firefighters-clap-nhs-18140761", "urlToImage": null, "publishedAt": "2020-04-24T14:18:40Z", "content": "Grateful people showed their support for NHS staff and carers by gathering outside hospitals and care homes across Teesside.  \r\n Local residents joined firefighters as they clapped for key workers at East Cleveland Hospital in Brotton. \r\n The emergency worker… [+1808 chars]"}, {"source": {"id": null, "name": "Pressenza.com"}, "author": "https://www.facebook.com/ConversationUK", "title": "Coronavirus: are we underestimating how many people have had it? Sweden thinks so - Pressenza, International Press Agency", "description": "Many countries around the world are now facing the difficult decision of when and how to ease lockdown restrictions due to the novel coronavirus. In the", "url": "https://www.pressenza.com/2020/04/coronavirus-are-we-underestimating-how-many-people-have-had-it-sweden-thinks-so/", "urlToImage": null, "publishedAt": "2020-04-24T13:09:10Z", "content": "Many countries around the world are now facing the difficult decision of when and how to ease lockdown restrictions due to the novel coronavirus. In the absence of a vaccine, it is likely there will be new waves of the epidemic, unless enough people have been… [+6968 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Adam Forrest", "title": "Coronavirus: Eyes could be contagious for weeks, study finds - The Independent", "description": "Eye fluid could may be ‘not only a site of virus entry but also a source of contagion,’ Italian study concludes", "url": "https://www.independent.co.uk/news/health/coronavirus-eyes-contagious-infection-conjunctivitis-italy-wuhan-a9482186.html", "urlToImage": null, "publishedAt": "2020-04-24T12:45:34Z", "content": "The coronavirus can linger in patients eyes for several weeks and could act as a way of spreading the Covid-19 disease, according new study from Italy.\r\nScientists at Italys National Institute for Infectious Diseases hospital in Rome studied the symptoms of a… [+1675 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Aussies should brace for rolling lockdowns in years ahead - Big Rigs", "description": "Australia is preparing to cautiously lift the first virus restrictions next week – but a return to “normal” could still be years away.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-aussies-should-brace-for-rolling-lockdowns-in-years-ahead/news-story/8847b0e8f896994785239983a0e91880", "urlToImage": null, "publishedAt": "2020-04-24T11:15:08Z", "content": "ANALYSIS\r\nBrace yourselves: We're going to need more lockdowns to get on top of COVID-19.\r\nEconomists used to dream of exponential growth in relation to the economy. But that same explosive effect seems set to doom us to rolling lockdowns for years to come.\r\n… [+5660 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Erika Edwards", "title": "Doctors report uptick in surprising coronavirus complication: dangerous blood clots - NBC News", "description": "Coronavirus patients are developing blood clots at higher rates. Does the virus cause blood to clot, or is it the result of inflammation? Regular anticoagulants aren't working.", "url": "https://www.nbcnews.com/health/health-news/doctors-report-uptick-surprising-coronavirus-complication-dangerous-blood-clots-n1190491", "urlToImage": null, "publishedAt": "2020-04-24T08:33:27Z", "content": "Three weeks ago, critical care pulmonologist Hugh Cassiere encountered something he hadn't seen in 24 years of practicing medicine.\r\nA 45-year-old man arrived at the hospital where Cassiere works, North Shore University Hospital on Long Island, New York, with… [+4346 chars]"}, {"source": {"id": null, "name": "Bendigoadvertiser.com.au"}, "author": "Natalie Croxon", "title": "Hospital first to use new telehealth platform for COVID-19 patients - Bendigo Advertiser", "description": "The new system allows health practitioners to monitor patients' conditions from afar.", "url": "https://www.bendigoadvertiser.com.au/story/6734213/hospital-first-to-use-new-telehealth-platform-for-covid-19-patients/", "urlToImage": null, "publishedAt": "2020-04-24T08:00:00Z", "content": ""}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/christina-zhou/9076506", "title": "Why are Western countries being hit harder than East Asian countries by coronavirus? - ABC News", "description": "Here we take a look at how the East has managed the outbreak compared to the West, and why the latter struggled to get a head start.", "url": "https://www.abc.net.au/news/2020-04-24/coronavirus-response-in-china-south-korea-italy-uk-us-singapore/12158504", "urlToImage": null, "publishedAt": "2020-04-24T07:49:55Z", "content": "Posted \r\nApril 24, 2020 09:49:16\r\nWhen the coronavirus initially swept across the East first China, then Thailand, Japan, and South Korea the Western countries watched on cautiously from the other side of the globe.\r\nKey points:\r\n<ul><li>Singapore, South Kore… [+14224 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Melissa Cunningham", "title": "'Things can change quickly': Complacency warning as infections drop - The Age", "description": "As Victoria's rate of coronavirus infection falls again, Chief Health Officer warns second wave of cases could happen anytime if social distancing is relaxed.", "url": "https://www.theage.com.au/national/victoria/things-can-change-quickly-complacency-warning-as-infections-drop-20200424-p54mzh.html", "urlToImage": null, "publishedAt": "2020-04-24T07:24:37Z", "content": "There were no new community transmission infections in Victoria as of Friday morning, with the number of those cases stable at 135.\r\nTwenty-seven people remain in hospital, including 11 people in intensive care.\r\nAsked if Victoria's tally might continue to tr… [+1892 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nLizzie Roberts", "title": "Contact tracing: how has it worked for other countries, and could it really help ease UK lockdown? - The Telegraph", "description": "From teams of 'corona detectives' to Army cadets making thousands of calls a day, countries are tracking the spread of Covid-19", "url": "https://www.telegraph.co.uk/news/2020/04/25/what-contact-tracing-how-work-countries-uk-lockdown/", "urlToImage": null, "publishedAt": "2020-04-24T06:57:00Z", "content": "Countries around the world are rushing to launch contact tracing apps to identify who an infected person has had contact with, as part of efforts to slow the spread of the coronavirus. \r\nThe UK Government has announced the infrastructure was being put in plac… [+1754 chars]"}, {"source": {"id": null, "name": "Denipt.com.au"}, "author": null, "title": "Install virus app to aid health carers: PM - Deniliquin Pastoral Times", "description": "", "url": "https://www.denipt.com.au/national/2020/04/24/1143612/install-virus-app-to-aid-health-carers-pm", "urlToImage": null, "publishedAt": "2020-04-24T06:46:30Z", "content": "Scott Morrison has conceded the government might not meet its goal for Australians downloading its coronavirus surveillance software.The prime minister says the app will be released imminently and is urging everyone to support the national efforts to suppress… [+2442 chars]"}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": "Simon Bourke", "title": "Lifeline picks up the phone in an age of loneliness as more than ever before call - Great Lakes Advocate", "description": "\"There are people out there, and the call they make to Lifeline is the only conversation they have all week.\"", "url": "https://www.canberratimes.com.au/story/6734221/covid-19-sparks-highest-ever-demand-for-lifeline-help/", "urlToImage": null, "publishedAt": "2020-04-24T06:30:00Z", "content": ""}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Scientists uncover evidence coronavirus could trigger diabetes in healthy adults - SBS News", "description": "A new study involving Australian researchers has found there is evidence COVID-19 could be causing diabetes in otherwise healthy adults.", "url": "https://www.sbs.com.au/news/scientists-uncover-evidence-coronavirus-could-trigger-diabetes-in-healthy-adults", "urlToImage": null, "publishedAt": "2020-04-24T06:10:00Z", "content": "Coronavirus may be triggering diabetes in typically healthy adults.\r\nElderly Australians with diabetes are also at an increased risk from coronavirus, a study released on Friday shows.\r\nCo-author and Monash University professor Paul Zimmet said diabetic child… [+2582 chars]"}, {"source": {"id": null, "name": "Voanews.com"}, "author": null, "title": "Britain Starts Testing Vaccine for Coronavirus on Humans - Malaysia Sun", "description": "WASHINGTON - Britain has performed the first human trial of a coronavirus vaccine in Europe.&nbsp;  Two volunteers were injected T", "url": "https://www.voanews.com/covid-19-pandemic/britain-starts-testing-vaccine-coronavirus-humans", "urlToImage": null, "publishedAt": "2020-04-24T06:05:00Z", "content": "WASHINGTON - Britain has performed the first human trial of a coronavirus vaccine in Europe.\r\nTwo volunteers were injected Thursday in the city of Oxford, where a university team developed the vaccine in less than three months. Hundreds of other volunteers wi… [+3915 chars]"}, {"source": {"id": null, "name": "Armidaleexpress.com.au"}, "author": "Newsroom", "title": "Coronavirus pandemic: Armidale Hospital opening COVID-19 testing blitz - Armidale Express", "description": "Armidale Hospital opening COVID-19 testing blitz", "url": "https://www.armidaleexpress.com.au/story/6734597/why-covid-19-testing-blitz-is-coming-to-armidale/", "urlToImage": null, "publishedAt": "2020-04-24T05:30:00Z", "content": ""}, {"source": {"id": null, "name": "Goldcoastbulletin.com.au"}, "author": "Sue Dunlevy and Brianna Morris-Grant", "title": "Why we're unlikely to be shaking hands 'anytime soon' - Chinchilla News", "description": "THE family dinner could be one of the first social gatherings allowed as we come out of the COVID-19 lockdown.", "url": "https://www.goldcoastbulletin.com.au/coronavirus/gold-coast-warned-against-breaching-social-distancing-laws-as-coronavirus-cases-drop/news-story/fb52d6aba701c1c79700f6d9380a3da0", "urlToImage": null, "publishedAt": "2020-04-24T04:43:00Z", "content": "THE family dinner could be one of the first social gatherings allowed as we come out of the COVID-19 lockdown.\r\nEpidemiologists advising the Federal Government said the best approach to ending the lockdown may be lifting one restriction at a time - like allow… [+5103 chars]"}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "PerthNow", "title": "Coronavirus crisis: Artania passenger adds to WA death tally - PerthNow", "description": "WA Health Minister Roger Cook has confirmed another COVID-19 death in WA.", "url": "https://www.perthnow.com.au/news/coronavirus/coronavirus-crisis-artania-passenger-adds-to-wa-death-tally-ng-b881528983z", "urlToImage": null, "publishedAt": "2020-04-24T02:40:14Z", "content": "An Artania passenger in his 70s has died, bringing WAs COVID-19 death toll to eight.\r\nThe passenger was one of the original cases taken off the ship last month but lost his fight at Sir Charles Gairdner Hospital yesterday.\r\nThe death came as two new cases of … [+1247 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Almost all of these virus patients die - Gatton Star", "description": "The results of a new hospital study show that when critically ill patients are put on ventilators it is highly unlikely they will survive.", "url": "https://www.news.com.au/lifestyle/health/health-problems/almost-90-per-cent-of-coronavirus-patients-put-on-ventilators-die/news-story/7d95181220848cd1d95d68319f160c2b", "urlToImage": null, "publishedAt": "2020-04-24T02:07:00Z", "content": "New research shows that critically ill coronavirus patients who are put on ventilators have a very poor chance of surviving.\r\nA newly published study revealed 90 per cent of coronavirus patients who were ventilated in New York City hospitals died, despite a h… [+2176 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Phoebe Loomes", "title": "Almost 90 per cent of coronavirus patients put on ventilators die - NEWS.com.au", "description": "Almost 90 per cent of coronavirus patients put on ventilators die", "url": "https://www.news.com.au/lifestyle/health/health-problems/almost-90-per-cent-of-coronavirus-patients-put-on-ventilators-die/news-story/7d95181220848cd1d95d68319f160c2b", "urlToImage": null, "publishedAt": "2020-04-24T01:47:40Z", "content": "New research shows that critically ill coronavirus patients who are put on ventilators have a very poor chance of surviving.A newly published study revealed 90 per cent of coronavirus patients who were ventilated in New York City hospitals died, despite a hea… [+2231 chars]"}, {"source": {"id": null, "name": "Dailymercury.com.au"}, "author": "Melanie Whiting, Melanie Whiting", "title": "Moranbah and Proserpine to receive Covid-19 test centres - Chronicle", "description": "The service is expected to ease strain on local health units.", "url": "https://www.dailymercury.com.au/news/moranbah-and-proserpine-to-receive-covid-19-test-c/4001832/", "urlToImage": null, "publishedAt": "2020-04-24T01:17:00Z", "content": "NEW coronavirus testing centres will be set up in Moranbah and Proserpine after a mutli-million dollar funding boost from mining giant BHP.\r\nThe Covid-19 testing centres, expected to open by the end of May, will ease strain on health services and separate sus… [+1347 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Tom Flanagan", "title": "The restrictions which could be lifted first as Australia flattens the curve - Yahoo News Australia", "description": "The majority of Australia's coronavirus restrictions could be lifted within six months, a former state chief health officer believes.", "url": "https://au.news.yahoo.com/coronavirus-restrictions-could-be-lifted-first-australia-011351455.html", "urlToImage": null, "publishedAt": "2020-04-24T01:13:00Z", "content": "One of Australias former state chief health officers believes the majority of current restrictions in place to fight the coronavirus outbreak will have been lifted within six months.\r\nQueensland University of Technology Professor Gerry Fitzgerald, Queenslands… [+2969 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Virus causing strokes in healthy young people - Coolum & North Shore News", "description": "Doctors have sent a warning that coronavirus is causing blood clots and strokes in otherwise young, healthy patients.", "url": "https://www.news.com.au/lifestyle/health/health-problems/doctors-warn-coronavirus-causing-blood-clots-and-sudden-strokes-in-young-healthy-patients/news-story/d9d3f775f84783346d10f47229359e9a", "urlToImage": null, "publishedAt": "2020-04-24T00:38:00Z", "content": "Coronavirus can cause blood clots and sudden strokes in young, healthy patients, doctors have warned.\r\nMedics in New York have seen a sevenfold increase in stroke cases in people in their 30s and 40s who either had mild or no COVID-19 symptoms at all.\r\nIt com… [+3658 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Gemma Mullin", "title": "Coronavirus causing blood clots and sudden strokes in young healthy patients - NEWS.com.au", "description": "Doctors warn coronavirus causing blood clots and sudden strokes in young healthy patients", "url": "https://www.news.com.au/lifestyle/health/health-problems/doctors-warn-coronavirus-causing-blood-clots-and-sudden-strokes-in-young-healthy-patients/news-story/d9d3f775f84783346d10f47229359e9a", "urlToImage": null, "publishedAt": "2020-04-23T23:59:35Z", "content": "Coronavirus can cause blood clots and sudden strokes in young, healthy patients, doctors have warned.Medics in New York have seen a sevenfold increase in stroke cases in people in their 30s and 40s who either had mild or no COVID-19 symptoms at all.\r\nIt comes… [+3691 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Abe Hawken", "title": "Coronavirus: Mum dies of COVID-19 days after giving birth - NEWS.com.au", "description": "Coronavirus: Mum dies of COVID-19 days after giving birth", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-mum-dies-of-covid19-days-after-giving-birth/news-story/67ec98791696d9f2b93ac98009737f44", "urlToImage": null, "publishedAt": "2020-04-23T23:40:08Z", "content": "A young mum in the UK has died from coronavirus just days after giving birth and didn't get a chance to hold her baby. Fozia Hanif, 29, was only given a picture of her son Ayaan after testing positive for COVID-19.\r\nShe was rushed to intensive care after the … [+2198 chars]"}, {"source": {"id": null, "name": "Thelancet.com"}, "author": null, "title": "Practical recommendations for the management of diabetes in patients with COVID-19 - The Lancet", "description": "Diabetes is one of the most important comorbidities linked to the severity of all\nthree known human pathogenic coronavirus infections, including severe acute respiratory\nsyndrome coronavirus 2. Patients with diabetes have an increased risk of severe complicat…", "url": "https://www.thelancet.com/journals/landia/article/PIIS2213-8587(20)30152-2/fulltext", "urlToImage": null, "publishedAt": "2020-04-23T22:31:17Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. By continuing you agree to the use of cookies.\r\nCopyright © 2020 Elsevier Inc. except certain content provided by third parties.\r\nPrivacy Policy   Terms and Conditions"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "CDC Director Clarifies Coronavirus Comments - HuffPost", "description": "President Donald Trump said Dr. Robert Redfield was misquoted about the coronavirus resurging in the fall, but the CDC director said his interview with The W...", "url": "https://www.youtube.com/watch?v=XhPtzNbO8iI", "urlToImage": null, "publishedAt": "2020-04-23T21:33:39Z", "content": "President Donald Trump said Dr. Robert Redfield was misquoted about the coronavirus resurging in the fall, but the CDC director said his interview with The Washington Post was accurate. \r\nSubscribe to HuffPost today: http://goo.gl/xW6HGSupport our work: https… [+134 chars]"}, {"source": {"id": null, "name": "Unsw.edu.au"}, "author": "z3525182", "title": "Vital Signs: Models show the coronavirus app needs a big take-up, economics tells us how to get it - UNSW Newsroom", "description": "For the app to work well, we might need an 80% take-up. Unless it is made mandatory, we'll need both private and social incentives.", "url": "https://newsroom.unsw.edu.au/news/business-law/vital-signs-models-show-coronavirus-app-needs-big-take-economics-tells-us-how-get", "urlToImage": null, "publishedAt": "2020-04-23T21:22:00Z", "content": "For the app to work well, we might need an 80% take-up. Unless it is made mandatory, we'll need both private and social incentives.With Australias test-confirmed daily COVID-19 infection rates continuing to fall to relatively low levels, there is considerable… [+4258 chars]"}, {"source": {"id": null, "name": "Prevention.com"}, "author": "Jake Smith", "title": "“COVID Toes” May Be a New, Rare Symptom of Coronavirus, According to Doctors - Prevention.com", "description": "In some patients, these lesions could be the first—or only—sign of COVID-19.", "url": "https://www.prevention.com/health/a32237221/coronavirus-symptom-covid-toes/", "urlToImage": null, "publishedAt": "2020-04-23T20:22:00Z", "content": "<ul><li>Another unusual symptom of the novel coronavirus has surfaced: discolored toes that look swollen and feel painful to the touch. </li><li>Dubbed “COVID toes,” the rare symptom presents mostly in younger patients.</li><li>Doctors explain what COVID toes… [+5789 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Blood Clots a New Surprise Side Effect in Coronavirus Patients | NBC10 Philadelphia - NBC10 Philadelphia", "description": "Doctors are noticing a new trend in COVID-19 patients in the form of blood clots. NBC10’s Matt DeLucia spoke with two local doctors about what they’re seeing...", "url": "https://www.youtube.com/watch?v=t2Bu8mqxwrg", "urlToImage": null, "publishedAt": "2020-04-23T17:56:50Z", "content": "Doctors are noticing a new trend in COVID-19 patients in the form of blood clots. NBC10s Matt DeLucia spoke with two local doctors about what theyre seeing at hospitals. \r\n_____\r\nSUBSCRIBE TO NBC10: VISIT the NBC10 channel for the latest news and exclusive re… [+437 chars]"}]}