{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Baked beans an unlikely nutrition star, and pandemic hit - Health - ABC News", "description": "While baked beans might not look particularly sexy, they're a favourite among nutrition experts. Here's why.", "url": "https://www.abc.net.au/news/health/2020-04-25/baked-beans-an-unlikely-nutrition-star/12176974", "urlToImage": null, "publishedAt": "2020-04-25T00:17:11Z", "content": "As we all fight our inner \"prepper\" and try not to succumb to panic buying, it seems many of us have turned to an old favourite: baked beans.\r\nBean production at Australia's largest fruit and vegetable cannery in Shepparton, Victoria, has doubled its usual vo… [+5001 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Could warm weather help contain pandemic? - 7NEWS.com.au", "description": "Scientists aren't certain about the link between colder conditions and the spread of coronavirus, but are hoping the northern summer will see the outbreak ease.", "url": "https://7news.com.au/news/health/could-warm-weather-help-contain-pandemic-c-998765", "urlToImage": null, "publishedAt": "2020-04-25T00:08:56Z", "content": "As the seasons change in the northern and southern hemispheres, questions are being asked about the influence of weather in the spread of coronavirus, which has killed more than 190,000 people and sent the global economy into a tailspin.\r\nHere's what we know … [+3556 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "CNN", "title": "Coronavirus update: Experts say not to wipe down groceries or takeout but wash your hands - 7NEWS.com.au", "description": "One of the scientists who found the virus might live on cardboard for up to 24 hours and metal and plastic for two to three days has spoken out.", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-update-experts-say-not-to-wipe-down-groceries-or-takeout-but-wash-your-hands-c-998677", "urlToImage": null, "publishedAt": "2020-04-24T23:12:48Z", "content": "Experts say it might be time to reconsider wiping down your groceries and take-out food.\r\nThe US Food and Drug Administration (FDA) has joined the chorus of scientific experts who say there is no real risk of getting the virus that causes COVID-19 that way.\r\n… [+3845 chars]"}, {"source": {"id": null, "name": "Thelancet.com"}, "author": null, "title": "Diagnosing malaria and other febrile illnesses during the COVID-19 pandemic - The Lancet", "description": "As the global malaria community observes World Malaria Day on April 25, 2020, we have\nplenty to celebrate. Yet this year, the coronavirus disease 2019 (COVID-19) outbreak\nis greatly dampening the spirits. While the Asia-Pacific region has made substantial\npro…", "url": "https://www.thelancet.com/journals/langlo/article/PIIS2214-109X(20)30210-2/fulltext", "urlToImage": null, "publishedAt": "2020-04-24T22:33:36Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. By continuing you agree to the use of cookies.\r\nCopyright © 2020 Elsevier Inc. except certain content provided by third parties.\r\nPrivacy Policy   Terms and Conditions"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "NBC", "title": "Coronavirus update: US study reveals common medical conditions in sickest COVID-19 patients - 7NEWS.com.au", "description": "Researchers have issued a warning to those with the health problems to be hyper-aware of new or unusual symptoms.", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-update-us-study-reveals-common-medical-conditions-in-sickest-covid-19-patients-c-998646", "urlToImage": null, "publishedAt": "2020-04-24T22:30:57Z", "content": "People with obesity, diabetes and high blood pressure are at greater risk for complications from coronavirus, according to a large study of patients hospitalised with the illness it causes.\r\nThe findings, published on Wednesday in the Journal of the American … [+2322 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "New Victorian coronavirus laws and virus outbreak probe - 7NEWS.com.au", "description": "The Victorian government has made it clear the pandemic is anything but over with new laws and an investigation into an outbreak.", "url": "https://7news.com.au/lifestyle/health-wellbeing/new-vic-laws-and-virus-outbreak-probe-c-998432", "urlToImage": null, "publishedAt": "2020-04-24T21:28:42Z", "content": "Emergency laws to combat the effects of coronavirus on the Victorian economy and the investigation of an outbreak at a Melbourne psychiatric facility are the latest indications the pandemic is far from over.\r\nHealth Minister Jenny Mikakos urged the Victorian … [+1352 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "This retired Marine gave a rousing speech to thank his health care heroes - Good Morning America", "description": "After 13 days in the hospital, 5 in intensive care, Alex Melo wanted to give a heartfelt speech to the medical staff who helped him.", "url": "https://www.youtube.com/watch?v=5axNlsS4yL4", "urlToImage": null, "publishedAt": "2020-04-24T21:09:26Z", "content": null}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Olivia Willis", "title": "When coronavirus patients suddenly decline, their own immune system might be to blame - ABC News", "description": "In some cases of COVID-19, it may be the body's response to the virus, rather than the virus itself, that ultimately causes harm.", "url": "https://www.abc.net.au/news/health/2020-04-25/coronavirus-covid-immune-response-causes-harm/12176872", "urlToImage": null, "publishedAt": "2020-04-24T20:30:29Z", "content": "It's been described as the \"second week crash\".\r\nAbout seven days after developing symptoms of COVID-19, some people even those with mild symptoms can suddenly start to deteriorate, often with little warning.\r\n\"They end up getting admitted to hospital, and ab… [+6217 chars]"}, {"source": {"id": null, "name": "Thenewdaily.com.au"}, "author": "https://www.facebook.com/TheNewDaily", "title": "Australian doctor among the first injected in coronavirus vaccine trial - The New Daily", "description": "Australian doctor Edward O'Neill believes taking part in a UK coronavirus vaccine trial is the right thing to do but admits he's taking a \"walk in faith\".", "url": "https://thenewdaily.com.au/news/national/2020/04/25/coronavirus-vaccine-australian-doctor/", "urlToImage": null, "publishedAt": "2020-04-24T19:52:30Z", "content": "An Australian doctor is one of the first two people in the world to be injected in human trials for a potential coronavirus vaccine which could be rolled out this year.\r\nSydney man Dr Edward O’Neill, who moved to the UK two years ago, has turned guinea pig fo… [+5466 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Patrick Wintour", "title": "US stays away as world leaders agree action on Covid-19 vaccine - The Guardian", "description": "Video meeting seen as global endorsement of WHO and sign of Trump’s isolation on world stage", "url": "https://www.theguardian.com/world/2020/apr/24/us-stays-away-as-world-leaders-agree-action-on-covid-19-vaccine", "urlToImage": null, "publishedAt": "2020-04-24T18:23:01Z", "content": "Global leaders have pledged to accelerate cooperation on a coronavirus vaccine and to share research, treatment and medicines across the globe. But the United States did not take part in the World Health Organization initiative, in a sign of Donald Trumps inc… [+3604 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Matthew Weaver", "title": "Twin sisters, one a nurse in Southampton, two of the latest to die from coronavirus - The Guardian", "description": "Katy and Emma Davis among recent victims, who include a BNP member who found Islam", "url": "https://www.theguardian.com/world/2020/apr/24/twin-sisters-one-a-nurse-in-southampton-two-of-the-latest-to-die-from-coronavirus", "urlToImage": null, "publishedAt": "2020-04-24T18:06:46Z", "content": null}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Researchers Develop Breakthrough Antibody Test for COVID-19 Virus - Mirage News", "description": "Several tests have been developed for detecting the genetic material of the SARS-CoV-2 coronavirus that causes COVID-19, but these generally only allow...", "url": "https://www.miragenews.com/researchers-develop-breakthrough-antibody-test-for-covid-19-virus/", "urlToImage": null, "publishedAt": "2020-04-24T17:32:12Z", "content": "Several tests have been developed for detecting the genetic material of the SARS-CoV-2 coronavirus that causes COVID-19, but these generally only allow detection of the virus during acute infection. Antibody, or serological, tests are urgently needed to deter… [+983 chars]"}, {"source": {"id": null, "name": "Standard.net.au"}, "author": "Andi Yu", "title": "New Vic laws and virus outbreak probe - Warrnambool Standard", "description": "Emergency laws to combat the effects of coronavirus on the Victorian economy and the investigation of an outbreak at a Melbourne psychiatric facility are the...", "url": "https://www.standard.net.au/story/6734968/new-vic-laws-and-virus-outbreak-probe/?cs=10264", "urlToImage": null, "publishedAt": "2020-04-24T17:31:40Z", "content": ""}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Tara Parker-Pope", "title": "What’s a Pulse Oximeter, and Do I Really Need One at Home? - The New York Times", "description": "A tiny fingertip device can give you valuable information about your health during a bout of Covid-19 or any respiratory illness.", "url": "https://www.nytimes.com/2020/04/24/well/live/coronavirus-pulse-oximeter-oxygen.html", "urlToImage": null, "publishedAt": "2020-04-24T16:05:24Z", "content": "After working for 10 days at Bellevue Hospital in New York, Dr. Richard Levitan decided to share what he had learned about Covid-19. Too many patients were showing up at the hospital with perilously low oxygen levels, putting them at risk for severe complicat… [+8004 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Nick Hopkins", "title": "Revealed: UK ministers were warned last year of risks of coronavirus pandemic - The Guardian", "description": "Briefing, which recommended stockpiling PPE among other measures, intensifies focus on No 10’s handling of outbreakCoronavirus – latest updatesSee all our coronavirus coverage", "url": "https://www.theguardian.com/world/2020/apr/24/revealed-uk-ministers-were-warned-last-year-of-risks-of-coronavirus-pandemic", "urlToImage": null, "publishedAt": "2020-04-24T14:33:57Z", "content": "Ministers were warned last year the UK must have a robust plan to deal with a pandemic virus and its potentially catastrophic social and economic consequences in a confidential Cabinet Office briefing leaked to the Guardian.\r\nThe detailed document warned that… [+6557 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Chris Smith", "title": "The most unusual coronavirus symptom is also the most dangerous - BGR", "description": "The newest observed coronavirus symptom is also the most dangerous one and can appear in patients who don’t even experience other symptoms. Doctors have noticed an increase in strokes caused by blood clots in young adults, who might be reluctant to seek medic…", "url": "https://bgr.com/2020/04/24/coronavirus-symptoms-stroke-after-blood-clots-in-young-patients/", "urlToImage": null, "publishedAt": "2020-04-24T14:02:10Z", "content": "<ul><li>The newest observed coronavirus symptom is also the most dangerous one and can appear in patients who don’t even experience other symptoms.</li><li>Doctors have noticed an increase in strokes caused by blood clots in young adults, who might be relucta… [+3622 chars]"}, {"source": {"id": null, "name": "Northernstar.com.au"}, "author": "Marc Stapelberg, Marc Stapelberg", "title": "Local clinicians welcome increased COVID-19 testing in NSW - Byron Shire News", "description": "‘INCREASING testing capacity will allow the community to get back towards normality faster’`", "url": "https://www.northernstar.com.au/news/local-clinicians-welcome-increased-covid-19-testin/4002050/", "urlToImage": null, "publishedAt": "2020-04-24T14:00:00Z", "content": "THE NSW Government has announced there is now capacity to double the number of COVID-19 tests in the state from around 4000 tests per day to 8000.\r\nPatients can get a referral for testing from their GP, then go to a pathology lab.\r\nNorthern NSW Local Health D… [+2053 chars]"}, {"source": {"id": null, "name": "Pressenza.com"}, "author": "https://www.facebook.com/ConversationUK", "title": "Coronavirus: are we underestimating how many people have had it? Sweden thinks so - Pressenza, International Press Agency", "description": "Many countries around the world are now facing the difficult decision of when and how to ease lockdown restrictions due to the novel coronavirus. In the", "url": "https://www.pressenza.com/2020/04/coronavirus-are-we-underestimating-how-many-people-have-had-it-sweden-thinks-so/", "urlToImage": null, "publishedAt": "2020-04-24T13:09:10Z", "content": "Many countries around the world are now facing the difficult decision of when and how to ease lockdown restrictions due to the novel coronavirus. In the absence of a vaccine, it is likely there will be new waves of the epidemic, unless enough people have been… [+6968 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Life After Ventilators Can Be Hell for Coronavirus Survivors - Bloomberg", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=e7dde990-862a-11ea-b2e5-cf1fa8d0eac7&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNC0yNC9saWZlLWFmdGVyLXZlbnRpbGF0b3JzLWNhbi1iZS1oZWxsLWZvci1jb3JvbmF2aXJ1cy1zdXJ2aXZvcnM=", "urlToImage": null, "publishedAt": "2020-04-24T12:21:24Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": null, "name": "Thenewdaily.com.au"}, "author": null, "title": "Human testing begins with Oxford COVID-19 vaccine and hopes of a big roll-out by September - The New Daily", "description": "Oxford University this week began its human trials for a COVID-19 vaccine. The researchers believe they could be delivering a million jabs from September.", "url": "https://thenewdaily.com.au/life/wellbeing/2020/04/24/coronavirus-vaccine-september-oxford/", "urlToImage": null, "publishedAt": "2020-04-24T12:15:10Z", "content": "Oxford University this week began its human trials for a COVID-19 vaccine. Of all the vaccine projects underway, none has been talked up so boldly. The researchers believe they could be delivering a million jabs from September.\r\nIt’s not all talk. Those milli… [+3916 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "LSHTM's COVID-19 modelling research receives Government funding boost - Mirage News", "description": "The London School of Hygiene & Tropical Medicine has been awarded £500,000 by the UK government to support its vital work in furthering our understanding...", "url": "https://www.miragenews.com/lshtm-s-covid-19-modelling-research-receives-government-funding-boost/", "urlToImage": null, "publishedAt": "2020-04-24T12:06:16Z", "content": "The London School of Hygiene &amp; Tropical Medicine has been awarded £500,000 by the UK government to support its vital work in furthering our understanding of the spread of COVID-19 how it can be controlled.\r\nLed by Professor John Edmunds, the project will … [+2737 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "New virus timeline: California had 2 deaths weeks earlier - WATE 6 On Your Side", "description": "Two people with the coronavirus died in California as much as three weeks before the U.S. reported its first death from the disease in late February — a gap ...", "url": "https://www.youtube.com/watch?v=ZJUBusJ4APc", "urlToImage": null, "publishedAt": "2020-04-24T11:16:31Z", "content": null}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Aussies should brace for rolling lockdowns in years ahead - Big Rigs", "description": "Australia is preparing to cautiously lift the first virus restrictions next week – but a return to “normal” could still be years away.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-aussies-should-brace-for-rolling-lockdowns-in-years-ahead/news-story/8847b0e8f896994785239983a0e91880", "urlToImage": null, "publishedAt": "2020-04-24T11:15:08Z", "content": "ANALYSIS\r\nBrace yourselves: We're going to need more lockdowns to get on top of COVID-19.\r\nEconomists used to dream of exponential growth in relation to the economy. But that same explosive effect seems set to doom us to rolling lockdowns for years to come.\r\n… [+5660 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Laura Geggel", "title": "SARS-CoV-2 may be exploiting our immune system's 'first responder' cells - Livescience.com", "description": "", "url": "https://www.livescience.com/coronavirus-immune-interferon-response.html", "urlToImage": null, "publishedAt": "2020-04-24T11:00:00Z", "content": "The new coronavirus\r\n, known as SARS-CoV-2, may be using part of the human body's own immune response against us, a new study suggests.\r\nThe novel coronavirus is known to use a keyhole called the ACE2 receptor to \"unlock\" a cell and get inside, where it repli… [+6132 chars]"}, {"source": {"id": null, "name": "Health24.com"}, "author": null, "title": "People are volunteering to be infected with the coronavirus, in a controversial vaccine approach - Health24", "description": "More than 2 000 people have volunteered to take part in a human-challenge trial for a potential coronavirus vaccine – and be intentionally infected with the virus – if a trial of this kind were to go ahead.", "url": "https://www.health24.com/Medical/Infectious-diseases/Coronavirus/people-are-volunteering-to-be-infected-with-the-coronavirus-in-a-controversial-vaccine-approach-20200424", "urlToImage": null, "publishedAt": "2020-04-24T10:49:06Z", "content": "While most of us are doing the best we can to stay as far away from the new coronavirus as possible, some people are willing to be infected intentionally.\r\nAs scientists are racing towards the development of a vaccine against the new coronavirus, a grassroots… [+5047 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Kansas City area doctors among first in Midwest to use plasma treatment for COVID-19 patients - KCTV5 News", "description": "There was a new sign of progress in the battle against the coronavirus Monday as physicians with Research and Menorah Medical Centers became some of the firs...", "url": "https://www.youtube.com/watch?v=UPcqgICEmbY", "urlToImage": null, "publishedAt": "2020-04-24T10:05:09Z", "content": null}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Kaiser Health News", "title": "Seniors with COVID-19 show unusual symptoms, doctors say - Raw Story", "description": "Older adults with COVID-19, the illness caused by the coronavirus, have several “atypical” symptoms, complicating efforts to ensure they get timely and appropriate treatment, according to physicians. COVID-19 is typically signaled by three symptoms: a fever, …", "url": "https://www.rawstory.com/2020/04/seniors-with-covid-19-show-unusual-symptoms-doctors-say/", "urlToImage": null, "publishedAt": "2020-04-24T09:56:16Z", "content": "Older adults with COVID-19, the illness caused by the coronavirus, have several atypical symptoms, complicating efforts to ensure they get timely and appropriate treatment, according to physicians.\r\nCOVID-19 is typically signaled by three symptoms: a fever, a… [+6329 chars]"}, {"source": {"id": null, "name": "Bendigoadvertiser.com.au"}, "author": "Natalie Croxon", "title": "Hospital first to use new telehealth platform for COVID-19 patients - Bendigo Advertiser", "description": "The new system allows health practitioners to monitor patients' conditions from afar.", "url": "https://www.bendigoadvertiser.com.au/story/6734213/hospital-first-to-use-new-telehealth-platform-for-covid-19-patients/", "urlToImage": null, "publishedAt": "2020-04-24T08:00:00Z", "content": ""}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/christina-zhou/9076506", "title": "Why are Western countries being hit harder than East Asian countries by coronavirus? - ABC News", "description": "Here we take a look at how the East has managed the outbreak compared to the West, and why the latter struggled to get a head start.", "url": "https://www.abc.net.au/news/2020-04-24/coronavirus-response-in-china-south-korea-italy-uk-us-singapore/12158504", "urlToImage": null, "publishedAt": "2020-04-24T07:49:55Z", "content": "Posted \r\nApril 24, 2020 09:49:16\r\nWhen the coronavirus initially swept across the East first China, then Thailand, Japan, and South Korea the Western countries watched on cautiously from the other side of the globe.\r\nKey points:\r\n<ul><li>Singapore, South Kore… [+14224 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Max Koslowski", "title": "Morrison says coronavirus app data will be kept in Australia - Brisbane Times", "description": "Prime Minister Scott Morrison says the data from the coronavirus tracing app will be kept in Australia despite Amazon winning the right to host it.", "url": "https://www.smh.com.au/politics/federal/morrison-says-coronavirus-app-data-will-be-kept-in-australia-20200424-p54n28.html", "urlToImage": null, "publishedAt": "2020-04-24T07:30:00Z", "content": "Prime Minister Scott Morrison has given assurances data collected from the coronavirus contact tracing app will be kept in Australia, batting away concerns it could be collected by United States' law enforcement agencies.\r\nMr Morrison said information collect… [+647 chars]"}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": "Simon Bourke", "title": "Lifeline picks up the phone in an age of loneliness as more than ever before call - Newcastle Herald", "description": "\"There are people out there, and the call they make to Lifeline is the only conversation they have all week.\"", "url": "https://www.canberratimes.com.au/story/6734221/covid-19-sparks-highest-ever-demand-for-lifeline-help/", "urlToImage": null, "publishedAt": "2020-04-24T06:30:00Z", "content": ""}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Scientists uncover evidence coronavirus could trigger diabetes in healthy adults - SBS News", "description": "A new study involving Australian researchers has found there is evidence COVID-19 could be causing diabetes in otherwise healthy adults.", "url": "https://www.sbs.com.au/news/scientists-uncover-evidence-coronavirus-could-trigger-diabetes-in-healthy-adults", "urlToImage": null, "publishedAt": "2020-04-24T06:10:00Z", "content": "Coronavirus may be triggering diabetes in typically healthy adults.\r\nElderly Australians with diabetes are also at an increased risk from coronavirus, a study released on Friday shows.\r\nCo-author and Monash University professor Paul Zimmet said diabetic child… [+2582 chars]"}, {"source": {"id": null, "name": "Weeklytimesnow.com.au"}, "author": null, "title": "Steps to combat cattle pneumonia - The Weekly Times", "description": "CATTLE restockers are being urged to consider introducing stress mitigation measures in their enterprises to help combat a rise in pneumonia-related cattle deaths in the New South Wales central west.", "url": "https://www.weeklytimesnow.com.au/news/rural-weekly/steps-to-combat-cattle-pneumonia/news-story/2180677fcd8b3348012b7cc3cf3bcd10", "urlToImage": null, "publishedAt": "2020-04-24T06:03:00Z", "content": "CATTLE restockers are being urged to consider introducing stress mitigation measures in their enterprises to help combat a rise in pneumonia-related cattle deaths in the New South Wales central west. \r\nBovine Respiratory Disease is the most common disease in … [+1931 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Two pet cats contract coronavirus - Daily Mercury", "description": "Two pet cats from different homes have contracted the coronavirus with one believed to have caught the virus from someone other than its owner.", "url": "https://www.news.com.au/lifestyle/health/health-problems/two-pet-cats-contract-coronavirus-in-new-york-city/news-story/88a58061054ea124b819ddeaea6f6ec6", "urlToImage": null, "publishedAt": "2020-04-24T05:55:00Z", "content": "Those nine lives might come in handy.\r\nTwo pet cats in New York state in the US have tested positive for the coronavirus, in the first diagnoses of domestic animals on American soil, a report said this week.\r\nIt's believed that the cats contracted the illness… [+1572 chars]"}, {"source": {"id": null, "name": "Goldcoastbulletin.com.au"}, "author": "Sue Dunlevy and Brianna Morris-Grant", "title": "Why we're unlikely to be shaking hands 'anytime soon' - Chinchilla News", "description": "THE family dinner could be one of the first social gatherings allowed as we come out of the COVID-19 lockdown.", "url": "https://www.goldcoastbulletin.com.au/coronavirus/gold-coast-warned-against-breaching-social-distancing-laws-as-coronavirus-cases-drop/news-story/fb52d6aba701c1c79700f6d9380a3da0", "urlToImage": null, "publishedAt": "2020-04-24T04:43:00Z", "content": "THE family dinner could be one of the first social gatherings allowed as we come out of the COVID-19 lockdown.\r\nEpidemiologists advising the Federal Government said the best approach to ending the lockdown may be lifting one restriction at a time - like allow… [+5103 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Lucy Quaggin", "title": "Microbiologist claims Wuhan lab ‘did absolutely crazy things’ in coronavirus research - 7NEWS.com.au", "description": "The professor’s comments have fuelled speculation that COVID-19 originated in a laboratory and not a wet market.", "url": "https://7news.com.au/lifestyle/health-wellbeing/microbiologist-claims-wuhan-lab-did-absolutely-crazy-things-in-coronavirus-research-c-996623", "urlToImage": null, "publishedAt": "2020-04-24T03:29:00Z", "content": "A Russian microbiologist has made some controversial claims about the origin of COVID-19.\r\nWorld-leading expert Professor Petr Chumakov has fuelled speculation the virus could have accidentally originated in a Wuhan laboratory - potentially during research fo… [+2158 chars]"}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "PerthNow", "title": "Coronavirus crisis: Artania passenger adds to WA death tally - PerthNow", "description": "WA Health Minister Roger Cook has confirmed another COVID-19 death in WA.", "url": "https://www.perthnow.com.au/news/coronavirus/coronavirus-crisis-artania-passenger-adds-to-wa-death-tally-ng-b881528983z", "urlToImage": null, "publishedAt": "2020-04-24T02:40:14Z", "content": "An Artania passenger in his 70s has died, bringing WAs COVID-19 death toll to eight.\r\nThe passenger was one of the original cases taken off the ship last month but lost his fight at Sir Charles Gairdner Hospital yesterday.\r\nThe death came as two new cases of … [+1247 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Almost all of these virus patients die - Sunshine Coast Daily", "description": "The results of a new hospital study show that when critically ill patients are put on ventilators it is highly unlikely they will survive.", "url": "https://www.news.com.au/lifestyle/health/health-problems/almost-90-per-cent-of-coronavirus-patients-put-on-ventilators-die/news-story/7d95181220848cd1d95d68319f160c2b", "urlToImage": null, "publishedAt": "2020-04-24T02:07:00Z", "content": "New research shows that critically ill coronavirus patients who are put on ventilators have a very poor chance of surviving.\r\nA newly published study revealed 90 per cent of coronavirus patients who were ventilated in New York City hospitals died, despite a h… [+2176 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "NBC", "title": "Coronavirus in the US: New York firefighter’s baby daughter dies from COVID-19 - 7NEWS.com.au", "description": "The baby girl spent a month in hospital before the virus took her life.", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-in-the-us-new-york-firefighters-baby-daughter-dies-from-covid-19-c-996697", "urlToImage": null, "publishedAt": "2020-04-24T01:27:25Z", "content": "A New York City firefighter and his wife have lost their four-month-old daughter to coronavirus.\r\nJay-Natalie La Santa died on April 20, nearly a month after she was rushed to the hospital with a fever.\r\nShe was very feisty. She was a little Angel with the mo… [+2705 chars]"}, {"source": {"id": null, "name": "Dailymercury.com.au"}, "author": "Melanie Whiting, Melanie Whiting", "title": "Moranbah and Proserpine to receive Covid-19 test centres - Chronicle", "description": "The service is expected to ease strain on local health units.", "url": "https://www.dailymercury.com.au/news/moranbah-and-proserpine-to-receive-covid-19-test-c/4001832/", "urlToImage": null, "publishedAt": "2020-04-24T01:17:00Z", "content": "NEW coronavirus testing centres will be set up in Moranbah and Proserpine after a mutli-million dollar funding boost from mining giant BHP.\r\nThe Covid-19 testing centres, expected to open by the end of May, will ease strain on health services and separate sus… [+1347 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Virus causing strokes in healthy young people - Coolum & North Shore News", "description": "Doctors have sent a warning that coronavirus is causing blood clots and strokes in otherwise young, healthy patients.", "url": "https://www.news.com.au/lifestyle/health/health-problems/doctors-warn-coronavirus-causing-blood-clots-and-sudden-strokes-in-young-healthy-patients/news-story/d9d3f775f84783346d10f47229359e9a", "urlToImage": null, "publishedAt": "2020-04-24T00:38:00Z", "content": "Coronavirus can cause blood clots and sudden strokes in young, healthy patients, doctors have warned.\r\nMedics in New York have seen a sevenfold increase in stroke cases in people in their 30s and 40s who either had mild or no COVID-19 symptoms at all.\r\nIt com… [+3658 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "New targeted agent produces considerable responses in patients with uterine cancer - Science Daily", "description": "The DNA repair-blocking drug adavosertib shrinks tumors in nearly one-third of patients in clinical trial data to be shared at the Society for Gynecologic Oncology (SGO) Annual Meeting on Women's Cancer.", "url": "https://www.sciencedaily.com/releases/2020/04/200423212610.htm", "urlToImage": null, "publishedAt": "2020-04-24T00:00:00Z", "content": "In its first clinical trial in patients with a hard-to-treat form of uterine cancer, a targeted drug that subjects tumor cells to staggering levels of DNA damage caused tumors to shrink in nearly one-third of patients, investigators at Dana-Farber Cancer Inst… [+2867 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Gemma Mullin", "title": "Coronavirus causing blood clots and sudden strokes in young healthy patients - NEWS.com.au", "description": "Doctors warn coronavirus causing blood clots and sudden strokes in young healthy patients", "url": "https://www.news.com.au/lifestyle/health/health-problems/doctors-warn-coronavirus-causing-blood-clots-and-sudden-strokes-in-young-healthy-patients/news-story/d9d3f775f84783346d10f47229359e9a", "urlToImage": null, "publishedAt": "2020-04-23T23:59:35Z", "content": "Coronavirus can cause blood clots and sudden strokes in young, healthy patients, doctors have warned.Medics in New York have seen a sevenfold increase in stroke cases in people in their 30s and 40s who either had mild or no COVID-19 symptoms at all.\r\nIt comes… [+3691 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Will Pavia, David Charter, Henry Zeffman", "title": "Only a tenth of New York ventilator patients survive coronavirus - The Times", "description": "Little more than a tenth of Covid-19 patients who have been put on ventilators survive, according to the largest and most comprehensive study of sufferers in the United States who were admitted to", "url": "https://www.thetimes.co.uk/article/only-a-tenth-of-new-york-ventilator-patients-survive-coronavirus-920vg6dtp", "urlToImage": null, "publishedAt": "2020-04-23T23:01:00Z", "content": "Little more than a tenth of Covid-19 patients who have been put on ventilators survive, according to the largest and most comprehensive study of sufferers in the United States who were admitted to hospital.\r\nVentilators have been held up as the last hope for … [+492 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "7NEWS", "title": "British mum, 29, with ‘mild’ coronavirus dies six days after giving birth - 7NEWS.com.au", "description": "Tragically the new mum was never able to see her baby and only saw pictures of him before she passed away.", "url": "https://7news.com.au/lifestyle/health-wellbeing/british-mum-29-with-mild-coronavirus-dies-six-days-after-giving-birth-c-996409", "urlToImage": null, "publishedAt": "2020-04-23T21:59:18Z", "content": "The family of a British mother who died in hospital six days after giving birth have spoken of their devastation.\r\nFozia Hanif, who had tested positive for coronavirus, died at Birminghams Heartlands Hospital on April 8 after her condition deteriorated follow… [+2875 chars]"}, {"source": {"id": null, "name": "Unsw.edu.au"}, "author": "z3525182", "title": "Vital Signs: Models show the coronavirus app needs a big take-up, economics tells us how to get it - UNSW Newsroom", "description": "For the app to work well, we might need an 80% take-up. Unless it is made mandatory, we'll need both private and social incentives.", "url": "https://newsroom.unsw.edu.au/news/business-law/vital-signs-models-show-coronavirus-app-needs-big-take-economics-tells-us-how-get", "urlToImage": null, "publishedAt": "2020-04-23T21:22:00Z", "content": "For the app to work well, we might need an 80% take-up. Unless it is made mandatory, we'll need both private and social incentives.With Australias test-confirmed daily COVID-19 infection rates continuing to fall to relatively low levels, there is considerable… [+4258 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "Most NYC Virus Patients Had Underlying Health Issues, Study Shows - The Epoch Times", "description": "Most patients in New York City hospitalized with the CCP virus suffered from at least one underlying health issue, such as obesity or kidney disease.", "url": "https://www.theepochtimes.com/most-new-york-virus-patients-had-underlying-health-issue-study_3324097.html", "urlToImage": null, "publishedAt": "2020-04-23T21:17:16Z", "content": "Most patients in New York City hospitalized with the CCP virus suffered from one or more underlying health issues, such as obesity or kidney disease, according to a new study.\r\nResearchers analyzed records from 5,700 patients and found more than 56 percent su… [+3603 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Michael Hollan", "title": "Flight attendant shares eerie photos of life on planes during the coronavirus outbreak - Fox News", "description": "A picture is worth a thousand words.", "url": "https://www.foxnews.com/travel/flight-attendant-eerie-photos-coronavirus-life", "urlToImage": null, "publishedAt": "2020-04-23T20:43:31Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nA picture is worth a thousand words.\r\nA flight attendant has been sharing photos that show what daily life for her has become amid the coronavirus outbreak. Working … [+2221 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Britons come together to Clap for our Carers and thank the NHS - The Telegraph", "description": "People across the UK came out on their doorsteps, balconies, windows and gardens to clap for our cares for the fifth week running. For all the latest on coro...", "url": "https://www.youtube.com/watch?v=XZo5XuydB9M", "urlToImage": null, "publishedAt": "2020-04-23T19:45:53Z", "content": "People across the UK came out on their doorsteps, balconies, windows and gardens to clap for our cares for the fifth week running.\r\nFor all the latest on coronavirus, head here: https://www.telegraph.co.uk/global-he...\r\nGet the latest headlines: https://www.t… [+228 chars]"}, {"source": {"id": null, "name": "Boston25news.com"}, "author": "Debbie Lord, Cox Media Group National Content Desk", "title": "Coronavirus: Are blood clots killing COVID-19 patients? - Boston 25 News", "description": "According to reports from doctors across the country and around the world, some patients infected with the new coronavirus appear to be developing blood clots primarily in their lungs and legs.", "url": "https://www.boston25news.com/news/trending/coronavirus-are-blood-clots-killing-covid-19-patients/UAH5GS4WK5FPJFP7YUHPYT2ZIQ/", "urlToImage": null, "publishedAt": "2020-04-23T19:20:55Z", "content": "Physicians on the front line of coronavirus treatment are seeing a new and alarming symptom among patients infected with the COVID-19 virus.\r\nAccording to reports from doctors across the country and around the world, some patients infected with the new corona… [+4405 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "French village bids adieu to doctor who succumbed to COVID-19 - Reuters", "description": "In Villers-Outreaux's village square, doctors, nurses and patients gathered, heads bowed and standing apart, to bid farewell to a local practitioner who succumbed to the new coronavirus.", "url": "https://www.reuters.com/article/us-health-coronavirus-france-doctor-fune-idUSKCN225337", "urlToImage": null, "publishedAt": "2020-04-23T17:24:00Z", "content": "VILLERS-OUTREAUX, France (Reuters) - In Villers-Outreaux’s village square, doctors, nurses and patients gathered, heads bowed and standing apart, to bid farewell to a local practitioner who succumbed to the new coronavirus. \r\nPhilippe Lerche, 63, died on Sund… [+1054 chars]"}, {"source": {"id": null, "name": "Hotnewhiphop.com"}, "author": "Lynn S.", "title": "Coronavirus Could Cause Strokes In Young Adults, Doctors Warn - HotNewHipHop", "description": "Doctors are warning folks in their 30s and 40s that coronavirus might be the cause of a recent increase in strokes in normally healthy young adults.", "url": "https://www.hotnewhiphop.com/coronavirus-could-cause-strokes-in-young-adults-doctors-warn-news.109058.html", "urlToImage": null, "publishedAt": "2020-04-23T17:16:53Z", "content": "Health care professionals have noticed a recent increase in treatment for sudden strokes in young adults, and they worry it's a result of the coronavirus. Doctors at Mount Sinai Health System in New York City reported that they typically treat less than two s… [+1574 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Soo Kim", "title": "Nearly 90 Percent of COVID-19 Patients on Ventilators in New York Died - Newsweek", "description": "The mortality rates were recorded to be higher for male patients than female patients at every adult 10-year age interval.", "url": "https://www.newsweek.com/nearly-90-percent-coronavirus-patients-put-ventilators-new-yorks-largest-health-system-died-1499845", "urlToImage": null, "publishedAt": "2020-04-23T16:51:16Z", "content": "Nearly 90 percent of coronavirus patients placed on ventilators between March 1 and April 4 at hospitals within Northwell Health, New York's largest health system, were reported to have died, according to a new study published in the Journal of the American M… [+8672 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Gemma Mullin", "title": "Coronavirus causes blood clots and sudden strokes in young, healthy patients, doctors warn - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11462002/coronavirus-blood-clots-sudden-strokes-young-healthy-patients/", "urlToImage": null, "publishedAt": "2020-04-23T14:12:43Z", "content": "CORONAVIRUS can cause blood clots and sudden strokes in young, healthy patients, doctors have warned.\r\nMedics in New York say they have seen a sevenfold increase in stroke cases in people in their 30s and 40s who either had mild or no Covid-19 symptoms at all… [+5568 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "92-year-old woman with one side of body paralysed defeats coronavirus in Pune - Times of India", "description": "PUNE: A 92-year-old Pune resident has recovered from coronavirus infection despite having suffered a stroke seven months ago which left one side of he.", "url": "https://timesofindia.indiatimes.com/city/pune/92-year-old-woman-with-one-side-of-body-paralysed-defeats-coronavirus-in-pune/articleshow/75323751.cms", "urlToImage": null, "publishedAt": "2020-04-23T13:28:43Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nick Statt", "title": "Boston Dynamics’ Spot robot is helping hospitals remotely treat coronavirus patients - The Verge", "description": "Robot maker Boston Dynamics announced on Thursday that it’s quadruped Spot robot is already in use at one Boston hospital to help with coronavirus treatment. The company now has ambitious plans to expand use of its robots to assist healthcare workers during t…", "url": "https://www.theverge.com/2020/4/23/21231855/boston-dynamics-spot-robot-covid-19-coronavirus-telemedicine", "urlToImage": null, "publishedAt": "2020-04-23T13:15:48Z", "content": "The company has ambitious plans for using robots to assist COVID-19 treatment\r\nPhoto: Boston Dynamics\r\nRobot maker Boston Dynamics announced on Thursday that its quadruped Spot robot is already in use at one Boston hospital to help with coronavirus treatment.… [+4911 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Matthew Wright For Dailymail.com Vanessa Chalmers Health Reporter For Mailonline", "title": "Nearly 90 per cent of COVID-19 patients placed on ventilators in NY's largest health system DIED - Daily Mail", "description": "The study, published in the Journal of the American Medical Association on Wednesday, examined the electronic health records of 5,700 patients hospitalized.", "url": "https://www.dailymail.co.uk/news/article-8248023/Nearly-90-cent-COVID-19-patients-placed-ventilators-NYs-largest-health-DIED.html", "urlToImage": null, "publishedAt": "2020-04-23T12:07:07Z", "content": "Nearly 90 per cent of all coronavirus patients placed on ventilators in New York's largest health system died, according to a study. \r\nThe study, published in the Journal of the American Medical Association on Wednesday, examined the electronic health records… [+4384 chars]"}, {"source": {"id": null, "name": "9news.com.au"}, "author": "9News Staff", "title": "Tour operator's 'backdated' rules deny COIVD-19 refunds - 9News", "description": "<p>The coronavirus pandemic has thrown hundreds of thousands of travel plans into chaos – but Australians seeking a refund could now find it even harder.</p>", "url": "https://www.9news.com.au/national/coronavirus-travel-refunds-guide-rules-on-getting-money-back-accc-topdeck/b9ae3a7c-f7fd-449c-b5b5-2623ef9411c7", "urlToImage": null, "publishedAt": "2020-04-23T11:57:15Z", "content": "Auto news: Toyota is funding an electric aircraft company - caradvice.com.au"}, {"source": {"id": null, "name": "Todayonline.com"}, "author": null, "title": "Special Report: As virus advances, doctors rethink rush to ventilate - TODAYonline", "description": "BERLIN - When he was diagnosed with COVID-19, Andre Bergmann knew exactly where he wanted to be treated: the Bethanien hospital lung clinic in Moers, near his home in northwestern Germany.", "url": "https://www.todayonline.com/world/special-report-virus-advances-doctors-rethink-rush-ventilate", "urlToImage": null, "publishedAt": "2020-04-23T11:30:00Z", "content": null}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Sarah Al-Arshani", "title": "Fauci said he's 'convinced' that COVID-19 would linger in the fall, right after Trump said it could be gone by then - Business Insider Australia", "description": "President Donald Trump suggested Wednesday that the novel coronavirus might be gone in the fall – and was quickly contradicted by the US’s top infectious-disease expert.", "url": "https://www.businessinsider.com.au/trump-claimed-covid-19-will-disappear-fall-fauci-said-otherwise-2020-4", "urlToImage": null, "publishedAt": "2020-04-23T10:48:33Z", "content": "<ul><li>\r\nPresident Donald Trump suggested at Wednesday’s coronavirus press briefing that COVID-19 might not be around in the fall – an idea that was quickly contradicted by the US’s top infectious-disease expert.\r\n</li><li>\r\nDr. Anthony Fauci, the director o… [+2943 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: The latest from Europe - BBC News - BBC News", "description": "Italy’s death toll climbed to 25,085 on Wednesday, rising by 437 compared with 534 the day before. The number of people currently confirmed ill with the viru...", "url": "https://www.youtube.com/watch?v=YTXVhC1h2ls", "urlToImage": null, "publishedAt": "2020-04-23T10:10:41Z", "content": "Italys death toll climbed to 25,085 on Wednesday, rising by 437 compared with 534 the day before. The number of people currently confirmed ill with the virus fell for the third consecutive day, and the number of people in intensive care also continued to decl… [+926 chars]"}, {"source": {"id": null, "name": "Newshub.co.nz"}, "author": null, "title": "Coronavirus: Doctors warn COVID-19 may give healthy adults strokes - Newshub", "description": "Doctors are concerned patients may not call for emergency help during the pandemic.", "url": "https://www.newshub.co.nz/home/new-zealand/2020/04/coronavirus-doctors-warn-covid-19-may-give-healthy-adults-strokes.html", "urlToImage": null, "publishedAt": "2020-04-23T10:09:39Z", "content": "New York doctors are warning coronavirus may cause sudden strokes in healthy adults in their 30s and 40s.\r\nDoctors at Mount Sinai Health System say there is growing evidence blood clots, which can cause strokes, are occurring in patients with mild or no COVID… [+453 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "The reason Australia's virus cases are reducing - Chronicle", "description": "The drop in new COVID-19 cases show Australia is on its way to defeating the virus and there are clear reasons behind the country’s recent success.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-the-reason-australias-virus-cases-are-reducing/news-story/c9ec7c264bdad514d96bb79248e7d4e4", "urlToImage": null, "publishedAt": "2020-04-23T09:43:00Z", "content": "The number of new daily coronavirus cases has dropped dramatically across Australia, showing that strict social distancing and health measures are helping slow the spread of the outbreak.\r\nNew infections in Australia rose by just 12 yesterday, with no Queensl… [+3038 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Family's plea after two-year-old's death - Daily Examiner", "description": "Little Sofie DeLuis’s flu shot this year was a “bittersweet” moment for her parents who are still grieving the loss of their other daughter.", "url": "https://www.news.com.au/lifestyle/real-life/news-life/influenza-vaccine-familys-powerful-photo-after-daughters-flu-death/news-story/6ab8b43cb585017cba2d28af6efdfcb0", "urlToImage": null, "publishedAt": "2020-04-23T08:17:00Z", "content": "Heartbroken parents who lost their two-year-old daughter due to complications from the flu want other families to get their children vaccinated before winter claims another young life.\r\nLucy DeLuis, from the town of Narembeen in Western Australia, died at Per… [+4430 chars]"}, {"source": {"id": null, "name": "Brisbanetimes.com.au"}, "author": "Stuart Layt, Lydia Lynch", "title": "More than 20 inmates quarantined in maximum security Brisbane prison - Sydney Morning Herald", "description": "The economic cost of coronavirus lockdowns is well known, but the Queensland government today tried to address the mental toll of the pandemic on residents.", "url": "https://www.brisbanetimes.com.au/national/queensland/more-than-20-inmates-quarantined-in-maximum-security-brisbane-prison-20200423-p54mp7.html", "urlToImage": null, "publishedAt": "2020-04-23T07:45:45Z", "content": "It was the same prison where a guard tested positive for the virus last month.\r\nMeanwhile, the economic cost of containing coronavirus has been huge, but as Queensland continues to showcase the success of the measures, their mental cost has also taken centre … [+3721 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Matt Atherton", "title": "Coronavirus warning - WHO reveals the three most common COVID-19 symptoms you need to know - Express", "description": "CORONAVIRUS is a deadly infection that's easily spread, and the disease has already killed more than 18,000 people in the UK. You could be at risk of COVID-19 infection if you have any of these three most common mild symptoms. Signs revealed by the World Heal…", "url": "https://www.express.co.uk/life-style/health/1272734/coronavirus-symptoms-signs-covid-19-infection-who-fever-cough-tiredness", "urlToImage": null, "publishedAt": "2020-04-23T07:26:14Z", "content": null}, {"source": {"id": null, "name": "Bunburymail.com.au"}, "author": "Emily Cosenza", "title": "Virus fight an 'ultramarathon': SA Health - Bunbury Mail", "description": "Australia is undergoing an \"ultramarathon\" battling the coronavirus and lifting restrictions too early would be counterproductive, a parliamentary committee h...", "url": "https://www.bunburymail.com.au/story/6733371/virus-fight-an-ultramarathon-sa-health/?cs=9397", "urlToImage": null, "publishedAt": "2020-04-23T06:22:16Z", "content": "Australia is undergoing an \"ultramarathon\" battling the coronavirus and lifting restrictions too early would be counterproductive, a parliamentary committee has been told.\r\nChief public health officer Nicola Spurrier told the inquiry while the state had done … [+1743 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Lucy Jones", "title": "Coronavirus’s long-term effects: It’s not just the lungs that are affected - Jimmys Post", "description": "It’s becoming increasingly clear coronavirus is here, and it’s here to stay.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronaviruss-long-term-effects-how-the-disease-continues-to-affect-our-vital-organs-and-bodily-systems/news-story/8345e23fa9e31409219ce1ce3df9e9e7", "urlToImage": null, "publishedAt": "2020-04-23T03:15:44Z", "content": "Its becoming increasingly clear coronavirus is here, and its here to stay. \r\nNow doctors are warning that patients who have survived COVID-19 may be left with long-term health problems.\r\nThey say that the deadly disease can have a lasting impact on a patient’… [+5712 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Covid toes could be a symptom of coronavirus - FOX 4 Now", "description": "If you can't think of any other reason that your toes are turning purple, you should call your doctor.", "url": "https://www.youtube.com/watch?v=UXACtWsQO0M", "urlToImage": null, "publishedAt": "2020-04-22T23:52:19Z", "content": null}]}