{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "9news.com.au"}, "author": "AAP", "title": "Housing costs 'devoured' NSW residents' weekly budget even before coronavirus - 9News", "description": "<p>NSW residents were already struggling to make ends meet before the COVID-19 pandemic, according to new research, with households taking &quot;extreme&quot; measures due to cost pressures.</p>", "url": "https://www.9news.com.au/national/nsw-residents-cost-of-living-strain-amid-coronavirus/52764384-55bd-4af4-b2f7-3ad74589f47e", "urlToImage": null, "publishedAt": "2020-04-26T17:48:06Z", "content": "Auto News: Skoda sales hit 1.24 million in 2019 - caradvice.com.au"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Michael McGowan", "title": "'On top of everything': coronavirus is making Australia's drug crisis a whole lot worse - The Guardian", "description": "Rising substance abuse and treatment restrictions are pushing an already over-burdened rehab system to breaking point", "url": "https://www.theguardian.com/world/2020/apr/27/on-top-of-everything-coronavirus-is-making-australias-drug-crisis-a-whole-lot-worse", "urlToImage": null, "publishedAt": "2020-04-26T17:30:00Z", "content": "Like most Australians, George* has spent the better part of the past two months trying to stay at home. He watches Netflix, tries to cook new things, and takes his dog Baz for walks to the park near his home in Coburg, north of Melbourne.\r\nBut life in a pande… [+13014 chars]"}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": "Julia Kanapathippillai", "title": "Want an accessible full body workout? Try Nordic walking - The Canberra Times", "description": "Kristen Pratt wants Canberrans to embrace Nordic walking.", "url": "https://www.canberratimes.com.au/story/6734859/move-over-strolling-try-nordic-walking/", "urlToImage": null, "publishedAt": "2020-04-26T17:00:00Z", "content": ""}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Andrew O'Reilly", "title": "Top public health expert says U.S. 'not out of the woods' in coronavirus pandemic - Fox News", "description": "Tom Inglesby, director of the Johns Hopkins Center for Health Security, said Sunday that the United States is “near the end of the beginning” of the coronavirus pandemic, but remained skeptical of Vice President Mike Pence’s earlier assertion that the country…", "url": "https://www.foxnews.com/politics/top-public-health-expert-says-u-s-not-out-of-the-woods-in-coronavirus-pandemic", "urlToImage": null, "publishedAt": "2020-04-26T14:52:02Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nTom Inglesby, director of the Johns Hopkins Center for Health Security, said Sunday that the United States is “near the end of the beginning” of the coronavirus pand… [+3458 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Melissa Cunningham, Kate Aubusson", "title": "'No one dies alone': Hospitals look for solutions to connect dying COVID-19 patients with families - Sydney Morning Herald", "description": "Being unable to hold your loved one’s hand or kiss them goodbye as they die alone in a hospital bed is perhaps the most brutal and devastating hallmark of coronavirus.", "url": "https://www.smh.com.au/national/no-one-dies-alone-hospitals-look-for-solutions-to-connect-dying-covid-19-patients-with-families-20200426-p54ncw.html", "urlToImage": null, "publishedAt": "2020-04-26T14:03:08Z", "content": "At St Vincent's Hospital a priest and chaplain are on call 24 hours a day, ready to suit up in face masks, gloves and protective gowns, to give coronavirus patients their last rites.\r\nWards are being remodelled to increase capacity to isolate critically ill C… [+5593 chars]"}, {"source": {"id": null, "name": "Thenewdaily.com.au"}, "author": null, "title": "Here’s why we shouldn’t give ‘immunity passports’ to coronavirus survivors - The New Daily", "description": "The number of coronavirus survivors is growing worldwide, and some countries want to issue 'immunity passports' that would allow them to get back to work.", "url": "https://thenewdaily.com.au/news/national/2020/04/26/coronavirus-immunity-passport-why-not/", "urlToImage": null, "publishedAt": "2020-04-26T13:18:45Z", "content": "The number of coronavirus survivors is increasing worldwide, and some countries want to issue ‘immunity passports’ that would allow them to get back to work.\r\nThe idea is that people who have recovered from COVID-19 will have developed antibodies that protect… [+3393 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Daniel BOSQUE", "title": "Why has Spain been hit so hard by the coronavirus pandemic? - Yahoo News", "description": "In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, e...", "url": "https://news.yahoo.com/why-spain-hit-hard-coronavirus-pandemic-071133079.html", "urlToImage": null, "publishedAt": "2020-04-26T12:11:51Z", "content": "Barcelona (AFP) - In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told AFP.\r\nWhile they stressed it was too early to carry out a detailed analy… [+4456 chars]"}, {"source": {"id": null, "name": "Un.org"}, "author": null, "title": "Millions more children at risk with immunization services disrupted amid COVID-19 pandemic - UN News", "description": "Last year, over 13 million children received no vaccines at all, and the UN Children’s Fund (UNICEF) is calling on governments to step up, warning disrupting immunization services amid the COVID-19 pandemic could leave even more of the world’s most marginaliz…", "url": "https://news.un.org/en/story/2020/04/1062622", "urlToImage": null, "publishedAt": "2020-04-26T11:40:07Z", "content": "Making its call at the start of the 2020 edition of World Immunization Week, UNICEF said on Saturday that millions of children are in danger of missing life-saving vaccines against measles, diphtheria and polio due to disruptions in immunization service as th… [+3030 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Lauren Clark", "title": "Nurse with 13 children is self-isolating at family home after positive coronavirus test - Yahoo Lifestyle", "description": "The dad jokes they are 'going for herd immunity'.", "url": "https://au.lifestyle.yahoo.com/nurse-dad-children-coronavirus-isolation-112417770.html", "urlToImage": null, "publishedAt": "2020-04-26T11:24:00Z", "content": "A nurse - and father of 13 - is self-isolating after testing positive for coronavirus this week.\r\nRoy Hann will have to stay home in Dundee for seven days, while his wife Emma and ten children still living with them will have to remain in quarantine for two w… [+2282 chars]"}, {"source": {"id": null, "name": "Ntnews.com.au"}, "author": "NATASHA EMECK", "title": "Patient mistook coronavirus for a hangover - Warwick Daily News", "description": "ONE of the city's first coronavirus patients says his symptoms were so mild at first that he mistook them for a hangover after a boozy night out on holiday.", "url": "https://www.ntnews.com.au/news/northern-territory/darwin-patient-says-he-mistook-coronavirus-for-a-hangover/news-story/72d6e9987cf324d159913167ceb4af12", "urlToImage": null, "publishedAt": "2020-04-26T09:51:00Z", "content": "ONE of Darwin's first coronavirus patients says his symptoms were so mild at first that he mistook them for a hangover after a boozy night out on holiday.\r\nThe man in his mid-30s, who did not wish to be named for privacy reasons, has told the NT News about hi… [+1476 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Lauren Clark", "title": "Hospital staff cheer as baby girl, six months, who tested positive for coronavirus leaves isolation - Yahoo Lifestyle", "description": "She was kept alone with her mum for 14 days at Alder Hey Children's Hospital.", "url": "https://au.lifestyle.yahoo.com/baby-girl-coronavirus-hospital-isolation-094105034.html", "urlToImage": null, "publishedAt": "2020-04-26T09:41:00Z", "content": "She is one of the youngest in the UK to contract coronavirus - but a baby girl has been cheered on by medical staff as she was moved out of isolation.\r\nErin, who is just six months old, had spent 14 days in a room with her mum Emma while being treated at Alde… [+3084 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "George Martin", "title": "Coronavirus: Government orders 50 million new testing kits after development 'breakthrough' - Yahoo News Australia", "description": "The so-called “lateral flow” tests will cost £10 and use a similar two-line system to pregnancy tests.", "url": "https://au.news.yahoo.com/coronavirus-government-orders-new-testing-kits-091648021.html", "urlToImage": null, "publishedAt": "2020-04-26T09:16:00Z", "content": "The government has reportedly ordered 50 million new coronavirus test after scientists in Oxford made a breakthrough in developing the new form of kit.\r\nThe new immunity tests have been devised by researchers working for the government-backed Rapid Testing Co… [+2368 chars]"}, {"source": {"id": null, "name": "Theconversation.com"}, "author": "Asha Bowen, Christopher Blyth, Kirsty Short", "title": "5 reasons it's safe for kids to go back to school - The Conversation AU", "description": "More evidence has come in and confirmed what the government has been saying for some time. Children do get infected much less than adults with COVID-19 and when they do, they hardly spread it.", "url": "https://theconversation.com/5-reasons-its-safe-for-kids-to-go-back-to-school-137064", "urlToImage": null, "publishedAt": "2020-04-26T09:02:00Z", "content": "In mid March, cases of COVID-19 the disease caused by SARS-CoV-2 dramatically increased in Australia and the government responded with an effective public health strategy. People who could, shifted to working from home, social distancing measures were applied… [+5782 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Brittany Chain Lauren Ferri For Daily Mail Australia", "title": "Ten workers at Nepean and Sydney Adventist Hospitals quarantined after doctor caught coronavirus - Daily Mail", "description": "On Sunday, Nepean Blue Mountains Local Health District confirmed a female doctor from Nepean Hospital, at the base of the Blue Mountains in Sydney's west, tested positive for coronavirus.", "url": "https://www.dailymail.co.uk/news/article-8258071/Ten-workers-Nepean-Sydney-Adventist-Hospitals-quarantined-doctor-caught-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-26T08:42:33Z", "content": "Ten healthcare workers across two hospitals will spend the next 14 days in self-isolation after another employee tested positive to coronavirus.\r\nOn Sunday morning, Nepean Blue Mountains Local Health District confirmed a female doctor from Nepean Hospital, at… [+4220 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Serum Institute to Start Making Oxford's Covid-19 Vaccine in 3 Weeks, Launch by Oct if Trials Succeed - News18", "description": "The Pune-based company has partnered with Oxford University as one of the seven global institutions manufacturing the vaccine.", "url": "https://www.news18.com/news/business/serum-institute-to-start-making-oxfords-covid-19-vaccine-in-3-weeks-launch-by-oct-if-trials-succeed-2593239.html", "urlToImage": null, "publishedAt": "2020-04-26T08:14:15Z", "content": "Vaccine major Serum Institute of India on Sunday said it plans to start production of the Covid-19 vaccine developed by Oxford University in the next two to three weeks and hopes to bring it to the market by October if the human clinical trials are successful… [+2898 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Women face anxiety over pregnancy and birth in US - TRT World", "description": "For many women, being pregnant comes with its own set of fears and anxiety. But being pregnant during the Covid-19 pandemic takes those fears to a whole new ...", "url": "https://www.youtube.com/watch?v=gagwijdvCR0", "urlToImage": null, "publishedAt": "2020-04-26T08:10:16Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "The Conversation", "title": "Coronavirus: Australia's four scenarios for coming out of lockdown - Yahoo News Australia", "description": "There are a number of options Australia can look at as we ease lockdown measures.", "url": "https://au.news.yahoo.com/australias-four-scenarios-for-coming-out-of-lockdown-080640423.html", "urlToImage": null, "publishedAt": "2020-04-26T08:06:00Z", "content": "Australia is effectively in lockdown. Public gatherings of more than two people are banned and people are only permitted to leave home for a limited set of reasons.\r\nThe recent tough measures appear to be having some effect and the daily growth rate of new ca… [+6147 chars]"}, {"source": {"id": "ary-news", "name": "Ary News"}, "author": "AFP", "title": "US records 2,494 more coronavirus deaths in 24 hours - ARY NEWS", "description": "Total cases around the world rose to 2.86 million and deaths mounted past the 200,000 mark.", "url": "https://arynews.tv/en/us-records-2494-more-coronavirus-deaths-in-24-hours/", "urlToImage": null, "publishedAt": "2020-04-26T07:50:03Z", "content": "The United States recorded 2,494 more coronavirus deaths in the past 24 hours, according to figures reported Saturday night by Johns Hopkins University.\r\nThe country now has an overall death toll of 53,511, with 936,293 confirmed infections, according to a ta… [+1729 chars]"}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": "Simon Bourke", "title": "Figures paint positive picture as Australia plans for COVID-19 recovery - Warrnambool Standard", "description": "Our COVID-19 Informer will keep you up to date with everything you need to know today.", "url": "https://www.canberratimes.com.au/story/6735440/figures-paint-positive-picture-as-australia-plans-for-covid-19-recovery/", "urlToImage": null, "publishedAt": "2020-04-26T07:30:00Z", "content": ""}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Digital Staff", "title": "Victorian Education Minister James Merlino backs school plan amid federal push - 7NEWS.com.au", "description": "The Education Minister has unleashed a blunt message on the Morrison government.", "url": "https://7news.com.au/lifestyle/health-wellbeing/victorian-education-minister-james-merlino-backs-school-plan-amid-federal-push-c-999874", "urlToImage": null, "publishedAt": "2020-04-26T06:48:22Z", "content": "Victorian Education Minister James Merlino has delivered a blunt message as Australian leaders remain split on schooling amid the coronavirus pandemic.\r\nThe federal government is increasing pressure on the states to return schools to normal as soon as possibl… [+3171 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Virus: Latest developments in the COVID-19 pandemic, 26 April | ABC News - ABC News (Australia)", "description": "Jeremy Fernandez takes you through the key developments in Australia's battle against the spread of coronavirus. In this epsiode, we look at the first human ...", "url": "https://www.youtube.com/watch?v=N446G4fqPuA", "urlToImage": null, "publishedAt": "2020-04-26T06:41:34Z", "content": "Jeremy Fernandez takes you through the key developments in Australia's battle against the spread of coronavirus. \r\nIn this epsiode, we look at the first human trials of a vaccine, how Japan is faring in its battle against COVID-19, and our panel answers your … [+476 chars]"}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": null, "title": "School return plan reinforced by NSW study - The Canberra Times", "description": "There is no evidence students at NSW schools have infected staff with COVID-19, according to a study cited by the federal government in its push to reopen sch...", "url": "https://www.canberratimes.com.au/story/6735338/school-return-plan-reinforced-by-nsw-study/?cs=14264", "urlToImage": null, "publishedAt": "2020-04-26T04:45:18Z", "content": ""}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Entrepreneurs are 'focussed' on securing a COVID-19 vaccine - Sky News Australia", "description": "The ability “to make money and do good” is driving many entrepreneurs and venture capitalists to invest in projects designed to find a COVID-19 vaccine, acco...", "url": "https://www.youtube.com/watch?v=yIZbwEOxPxc", "urlToImage": null, "publishedAt": "2020-04-26T04:30:38Z", "content": "The ability to make money and do good is driving many entrepreneurs and venture capitalists to invest in projects designed to find a COVID-19 vaccine, according to OurCrowd CEO Jonathan Medved.\r\nThere are almost 100 different projects worldwide aimed at findi… [+886 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": "Jane Hansen", "title": "One in three parents unaware flu vaccination is recommended for kids - Daily Telegraph", "description": "While influenza vaccination uptake is at record levels for adults, children under the age of five have been slow to have their shots.", "url": "https://www.dailytelegraph.com.au/news/nsw/one-in-three-parents-unaware-flu-vaccination-is-recommended-for-kids/news-story/c64564798dc4d31c269553bf9cd86093", "urlToImage": null, "publishedAt": "2020-04-26T01:36:54Z", "content": "While influenza vaccination uptake is at record levels for adults, children under the age of five have been slow to have their shots.\r\nEven though these shots are now available free on the national immunisation program, only one in 16 children have had their … [+2163 chars]"}, {"source": {"id": null, "name": "Theleader.com.au"}, "author": "Colin Brinsden", "title": "Virus tracing app only for health use: PM - St George and Sutherland Shire Leader", "description": "Doctors, nurses, business and bankers have been quick to back the Morrison government's COVID-19 tracer app, which aims to help health officials identify peop...", "url": "https://www.theleader.com.au/story/6735355/covidsafe-app-to-help-get-back-to-normal/?cs=9397&utm_campaign=sidebar&utm_medium=index&utm_source=website", "urlToImage": null, "publishedAt": "2020-04-26T01:18:17Z", "content": "Doctors, nurses, business and bankers have been quick to back the Morrison government's COVID-19 tracer app, which aims to help health officials identify people who may have come into contact with someone with the disease.\r\nCalled COVIDSafe, the voluntary app… [+3371 chars]"}, {"source": {"id": "xinhua-net", "name": "Xinhua Net"}, "author": null, "title": "Study reveals link between ADHD and sleeping disorder - Xinhua | English.news.cn - Xinhua", "description": null, "url": "http://www.xinhuanet.com/english/2020-04/26/c_139008340.htm", "urlToImage": null, "publishedAt": "2020-04-26T00:07:03Z", "content": "SHANGHAI, April 26 (Xinhua) -- An international team of researchers have found that Attention Deficit Hyperactivity Disorder (ADHD) is related to sleeping disorder through brain imaging analysis.\r\nADHD is seen in some children who are often accompanied by sle… [+1022 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Spain reports nearly 3,000 daily virus cases - Times of India", "description": "Europe News: MADRID: Spain's health authorities say 2,944 new Covid-19 infections were confirmed in the previous 24 hours, taking the total to nearly 206,000 cases.", "url": "https://timesofindia.indiatimes.com/world/europe/spain-reports-nearly-3000-daily-virus-cases/articleshow/75380478.cms", "urlToImage": null, "publishedAt": "2020-04-25T23:47:56Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "Coronavirus Australia: COVID-19 has limited transmissibility for students, NSW Health report finds - The Weekly Times", "description": "Coronavirus Australia: COVID-19 has limited transmissibility for students, NSW Health report finds", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-australia-covid19-has-limited-transmissibility-for-students-nsw-health-report-finds/news-story/1d441996a3654167226bb910277a4f68", "urlToImage": null, "publishedAt": "2020-04-25T23:38:00Z", "content": "A NSW Health report has concluded that COVID-19 has limited transmissibility between students, and from students to teachers.Chief Medical Officer Brendan Murphy cited the report on Friday at a press conference with Prime Minister Scott Morrison, who stressed… [+3141 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Summer Woolley", "title": "Coronavirus update: Six-month-old baby with heart condition survives COVID-19 - 7NEWS.com.au", "description": "The baby received a standing ovation from hospital staff but just weeks prior, her parents Emma and Wayne had been told they were going to lose her.", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-update-six-month-old-baby-with-heart-condition-survives-covid-19-c-999490", "urlToImage": null, "publishedAt": "2020-04-25T22:48:49Z", "content": "A six-month-old baby who fought through a rare heart defect, a respiratory illness and collapsed lungs has now survived COVID-19.\r\nThe baby from Manchester, England, received a standing ovation from NHS staff as she was escorted through the hospital.\r\nJust we… [+3155 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "UK doctor invents digital flashcards to help Covid-19 patients understand staff - The Guardian", "description": "Cardmedic overcomes communication barrier caused by healthcare staff wearing PPE", "url": "https://www.theguardian.com/world/2020/apr/25/uk-doctor-invents-digital-flashcards-to-help-covid-19-patients-understand-staff", "urlToImage": null, "publishedAt": "2020-04-25T21:50:36Z", "content": "A coronavirus patients terrifying hospital experience inspired an NHS doctor to create a flashcard system to improve communication with medical staff wearing face masks.\r\nAnaesthetist Rachael Grimaldi founded Cardmedic while on maternity leave after reading a… [+2712 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "'No evidence' people with coronavirus are immunised: WHO - SBS News", "description": "While the global death toll of coronavirus passes 200,000, the World Health Organization warns there is no evidence of immunity to the disease.", "url": "https://www.sbs.com.au/news/no-evidence-people-with-coronavirus-are-immunised-says-who", "urlToImage": null, "publishedAt": "2020-04-25T21:37:23Z", "content": "The World Health Organization has warned that recovering from coronavirus might not protect people from reinfection as the death toll from the pandemic passed 200,000 around the globe.\r\nGovernments are struggling to limit the economic devastation unleashed by… [+7190 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "The Mighty Staff", "title": "Doctors Report People in Their 30s and 40s With COVID-19 Are Having Strokes - Yahoo News", "description": "Doctors in New York City and around the country are now reporting that people in their 30s and 40s with COVID-19, even mild cases, are having and dying from ...", "url": "https://news.yahoo.com/doctors-report-people-30s-40s-205330026.html", "urlToImage": null, "publishedAt": "2020-04-25T20:53:00Z", "content": "Microscopic view of a infectious virus.\r\nDoctors are now reporting cases where the coronavirus (COVID-19) may be causing blood clots and consequently, strokes in a small number of people in their 30s and 40s. These young and middle-aged patients, some who did… [+4222 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Mehr Gill", "title": "Explained: Types of human coronaviruses and the symptoms they cause - The Indian Express", "description": "While there are hundreds of coronaviruses, there are seven that we know can infect humans.", "url": "https://indianexpress.com/article/explained/types-of-human-coronaviruses-and-symptoms-6368444/", "urlToImage": null, "publishedAt": "2020-04-25T19:50:19Z", "content": "Written by Mehr Gill\r\n | New Delhi | \r\nUpdated: April 25, 2020 6:09:09 pm\r\nHuman coronaviruses were first characterised in the mid-1960s and they are mostly considered to be responsible for causing upper respiratory tract infections in children. (AP illustrat… [+6888 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "RACGP launches nationwide campaign to stop people neglecting their health due to COVID-19 - Mirage News", "description": "The Royal Australian College of General Practitioners (RACGP) has today launched a nationwide campaign to stop people from neglecting their health...", "url": "https://www.miragenews.com/racgp-launches-nationwide-campaign-to-stop-people-neglecting-their-health-due-to-covid-19/", "urlToImage": null, "publishedAt": "2020-04-25T19:36:09Z", "content": "The Royal Australian College of General Practitioners (RACGP) has today launched a nationwide campaign to stop people from neglecting their health concerns during the COVID-19 pandemic.\r\nThe campaign, Expert Advice Matters, will run for 30 days with advertise… [+5584 chars]"}, {"source": {"id": null, "name": "Tribune.com.pk"}, "author": "Tribune.com.pk", "title": "Oxford University hopes to produce coronavirus jab by September - The Express Tribune", "description": "Professor Sarah Gilbert's team begins human trials of potential vaccine against Covid-19", "url": "https://tribune.com.pk/story/2206994/3-oxford-university-hopes-produce-coronavirus-jab-september/", "urlToImage": null, "publishedAt": "2020-04-25T19:35:14Z", "content": "The UN says finding a coronavirus vaccine is the only possible way to bring the world back to \"normality\". PHOTO: AFP \r\nLONDON: Oxford University has begun a human trial of a potential coronavirus vaccine, with the daunting aim of making a successful jab avai… [+3583 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Jody Serrano", "title": "Recovered From Covid-19? WHO Says That's No Guarantee You Can't Get It Again - Gizmodo Australia", "description": "Over the past few weeks, one comforting idea that people recovered from covid-19, the disease caused by the novel coronavirus, could think about was that they would probably not get it again. However, the World Health Organisation (WHO) contradicted that assu…", "url": "https://www.gizmodo.com.au/2020/04/recovered-from-covid-19-who-says-thats-no-guarantee-you-cant-get-it-again/", "urlToImage": null, "publishedAt": "2020-04-25T19:27:00Z", "content": "Over the past few weeks, one comforting idea that people recovered from covid-19, the disease caused by the novel coronavirus, could think about was that they would probably not get it again. However, the World Health Organisation (WHO) contradicted that assu… [+2693 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ariana Eunjung Cha", "title": "Spike in stroke deaths in patients with only minor coronavirus symptoms - The Independent", "description": "Reports of strokes in the young and middle-aged are the latest twist in our evolving understanding of the mysteries of the virus, finds Ariana Eunjung Cha", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-stroke-deaths-symptoms-covid-19-heart-a9484091.html", "urlToImage": null, "publishedAt": "2020-04-25T18:45:03Z", "content": "Thomas Oxley wasnt even on call the day he received the page to come into Mount Sinai Beth Israel Hospital in Manhattan. There werent enough doctors to treat all the emergency stroke patients, and he was needed in the operating room.\r\nThe patients chart appea… [+9849 chars]"}, {"source": {"id": null, "name": "Greatlakesadvocate.com.au"}, "author": "Darren Cartwright", "title": "Independent schools want to reopen in Qld - Great Lakes Advocate", "description": "Family picnics and weekend drives are back and national parks will reopen in Queensland from next weekend after just three COVID-19 cases were recorded overni...", "url": "https://www.greatlakesadvocate.com.au/story/6735369/covid-19-restrictions-to-be-eased-in-qld/?cs=9397", "urlToImage": null, "publishedAt": "2020-04-25T17:31:10Z", "content": ""}, {"source": {"id": null, "name": "Theleader.com.au"}, "author": "Carly Waters and Benita Kolovos", "title": "Victoria elective surgeries set to return | St George & Sutherland Shire Leader | St George, NSW - St George and Sutherland Shire Leader", "description": "Victoria will not follow in the footsteps of other states in easing some social distancing measures, despite a steady decline in the number of new COVID-19 ca...", "url": "https://www.theleader.com.au/story/6735329/no-plans-to-relax-rules-open-vic-schools/?cs=9397", "urlToImage": null, "publishedAt": "2020-04-25T17:30:42Z", "content": "Victoria will not follow in the footsteps of other states in easing some social distancing measures, despite a steady decline in the number of new COVID-19 cases.\r\nHealth Minister Jenny Mikakos confirmed the state recorded one death and three new coronavirus … [+2910 chars]"}, {"source": {"id": null, "name": "Newcastlestar.com.au"}, "author": null, "title": "Contact checks on WA's latest virus case | The Star | Newcastle, NSW - Newcastle Star", "description": "Western Australia will relax its coronavirus restrictions to allow up to 10 people to gather for non-work activities, as the state recorded another day of no...", "url": "https://www.newcastlestar.com.au/story/6735328/wa-cautiously-relaxes-virus-restrictions/?cs=7", "urlToImage": null, "publishedAt": "2020-04-25T17:30:39Z", "content": "Western Australia will relax its coronavirus restrictions to allow up to 10 people to gather for non-work activities, as the state recorded another day of no new COVID-19 cases.\r\nPremier Mark McGowan said it was a \"cautious relaxation\" of restrictions, acknow… [+1570 chars]"}, {"source": {"id": null, "name": "Wellingtontimes.com.au"}, "author": null, "title": "SA near end of coronavirus testing blitz - Wellington Times", "description": "South Australia has recorded no new cases of coronavirus for the fourth consecutive day, as the state government urged people with other serious medical issue...", "url": "https://www.wellingtontimes.com.au/story/6735327/sa-hospital-numbers-down-amid-covid-19/?cs=9397", "urlToImage": null, "publishedAt": "2020-04-25T17:30:09Z", "content": "South Australia has recorded no new cases of coronavirus for the fourth consecutive day, as the state government urged people with other serious medical issues to not let the pandemic stop them seeking help.\r\nThe state has confirmed a total of 438 cases, but … [+1837 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Sweden goes it alone with 'relaxed' attitude to coronavirus - CGTN", "description": "Sweden's relaxed restrictions could lead to herd immunity but at what cost?", "url": "https://newseu.cgtn.com/news/2020-04-25/Sweden-goes-it-alone-with-relaxed-attitude-to-coronavirus-PYIUqQSwH6/index.html", "urlToImage": null, "publishedAt": "2020-04-25T12:41:25Z", "content": "Everyone wants immunity from the coronavirus. But there may be different ways to get it.\r\nOne is a vaccine. Clinical trials are already underway in the UK, and if all goes well, say those involved, it's possible a vaccination may be ready for production by Se… [+3523 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "R. Prasad", "title": "Sewage surveillance can estimate coronavirus spread in the community - The Hindu", "description": "Viral particles in sewage samples is a collection of virus shed by many people in the community and is akin to pooled testing", "url": "https://www.thehindu.com/sci-tech/energy-and-environment/sewage-surveillance-can-estimate-coronavirus-spread-in-the-community/article31432872.ece", "urlToImage": null, "publishedAt": "2020-04-25T12:08:00Z", "content": "Sampling sewage for viral particles is a time-tested method of environment surveillance and is routinely resorted to for understanding circulation of several viruses wild and vaccine-derived polio, rota virus, Hepatitis E and typhoid in the community. Now, re… [+4429 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Faye Brown", "title": "WHO warning against coronavirus immunity passports - Metro.co.uk", "description": "The World Health Organisation say there is still not enough evidence having coronavirus can protect you from reinfection.", "url": "https://metro.co.uk/2020/04/25/casts-doubt-antibody-tests-warning-immunity-passports-12608431/", "urlToImage": null, "publishedAt": "2020-04-25T11:12:53Z", "content": "There is no evidence having coronavirus will protect you from reinfection, according to the World Health Organisation\r\nThe World Health Organisation has warned against the idea of immunity passports as a solution to easing lockdown amid the coronavirus pandem… [+2174 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Reuters", "title": "'No Evidence' That Recovered COVID-19 Patients Cannot Be Reinfected: WHO - The New York Times", "description": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.", "url": "https://www.nytimes.com/reuters/2020/04/25/world/americas/25reuters-health-coronavirus-who.html", "urlToImage": null, "publishedAt": "2020-04-25T09:51:00Z", "content": "GENEVA The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nIn a scientific brief, the United Nations a… [+1736 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Baby makes 'miracle' recovery to beat virus - Queensland Times", "description": "Doctors held grave fears for this six-month old-baby when she contracted COVID-19, but she pulled through against all odds and has become a symbol of hope.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-sixmonthold-baby-from-manchester-beats-covid19-parents-overjoyed/news-story/dd23c0c28d8689c2497724fdb6291258", "urlToImage": null, "publishedAt": "2020-04-25T09:49:00Z", "content": "Already severely underweight and with other medical complications, doctors thought this six-month-old baby was done for when she contracted COVID-19.\r\nBut Erin Bates pulled through and has become a symbol of hope for others.\r\nThe baby from Manchester, England… [+3615 chars]"}, {"source": {"id": null, "name": "Araratadvertiser.com.au"}, "author": "Gus McCubbing", "title": "Blue Mtns health worker positive for virus - Ararat Advertiser", "description": "An 83-year-old man has died from COVID-19 at an aged care facility in western Sydney, taking the state's virus toll to 36. The man was a resident at Anglicare...", "url": "https://www.araratadvertiser.com.au/story/6734966/sixth-virus-death-at-nsw-age-care-facility/", "urlToImage": null, "publishedAt": "2020-04-25T09:27:18Z", "content": ""}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Dave Lee", "title": "Craft site Etsy sews up share bounce with homemade masks - Financial Times", "description": "News, analysis and comment from the Financial Times, the worldʼs leading global business publication", "url": "https://www.ft.com/content/075c1d10-29e4-4a52-ad67-16d3825705c8", "urlToImage": null, "publishedAt": "2020-04-25T08:43:44Z", "content": "Keep abreast of significant corporate, financial and political developments around the world.\r\nStay informed and spot emerging risks and opportunities with independent global reporting, expert\r\ncommentary and analysis you can trust."}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "France to trial nicotine patches to prevent COVID-19 - Big Rigs", "description": "Despite repeated warnings that smokers have a higher risk of severe cases one European country is hoping to trial nicotine patches on healthcare workers.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-france-to-trial-nicotine-patches-to-prevent-covid19/news-story/616d8f570780c5eba4d76b34ba015c7e", "urlToImage": null, "publishedAt": "2020-04-25T07:40:37Z", "content": "France is hoping to trial nicotine patches on healthcare workers after a study suggested that smokers may have a lesser chance of catching coronavirus.\r\nThe surprising findings come despite health officials around the world repeatedly warning that smokers who… [+2894 chars]"}, {"source": {"id": null, "name": "Newstalk.com"}, "author": null, "title": "Morning top 5: New criteria for COVID-19 testing to be introduced next week - Newstalk", "description": "New criteria for COVID-19 testing is being introduced early next week.Currently, only people in ...", "url": "https://www.newstalk.com/news/morning-top-5-new-criteria-covid-19-testing-introduced-next-week-1005748", "urlToImage": null, "publishedAt": "2020-04-25T07:28:57Z", "content": "New criteria for COVID-19 testing is being introduced early next week.\r\nCurrently, only people in at-risk groups or those with two symptoms can be sent for testing.\r\nFrom next week, anyone with a fever, cough or shortness of breath will be able to get a test,… [+1544 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "The Conversation", "title": "The truth about Australia's coronavirus 'exit strategy' - Yahoo News Australia", "description": "As the COVID-19 curve starts to flatten in Australia, people are rightly wondering how we will roll back the current lockdown.", "url": "https://au.news.yahoo.com/the-truth-about-australias-coronavirus-exit-strategy-072320488.html", "urlToImage": null, "publishedAt": "2020-04-25T07:23:00Z", "content": "As the COVID-19 curve starts to flatten in Australia and New Zealand, people are rightly wondering how we will roll back current lockdown policies.\r\nAustralias Federal Health Minister Greg Hunt says Australia is looking to South Korea, Japan and Singapore to … [+6727 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "James Rodger", "title": "Government were 'warned to prepare for impending pandemic last year' - Birmingham Live", "description": "The National Security Risk Assessment (NSRA) - running to more than 600 pages - highlighted the devastating social and economic costs of a major disease outbreak", "url": "https://www.birminghammail.co.uk/news/midlands-news/government-were-warned-prepare-impending-18148465", "urlToImage": null, "publishedAt": "2020-04-25T06:34:57Z", "content": "Ministers were warned last year that the Government needed robust plans in place to deal with a potential pandemic virus, according to a leaked Cabinet Office briefing.\r\nThe National Security Risk Assessment (NSRA) - running to more than 600 pages - highlight… [+2462 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "Coronavirus Q&A Dr Kathleen Matthews on the impact of public health restrictions on Australian dental services - Herald Sun", "description": "Dr Kathleen Matthews answers your questions about dental health", "url": "https://www.news.com.au/national/dr-kathleen-matthews-answers-your-questions-about-dental-health/news-story/e429a06086e4486410137ef9883a15ed", "urlToImage": null, "publishedAt": "2020-04-25T05:05:15Z", "content": "COVID-19 had brought tight restrictions on Australian dentists, limiting them to providing just urgent and emergency treatment.But from Monday, the Federal Government has said so-called level three restrictions can be relaxed to level two, meaning patients ca… [+5175 chars]"}, {"source": {"id": null, "name": "Bendigoadvertiser.com.au"}, "author": "Karen Sweeney and Andi Yu", "title": "Three new COVID-19 cases in Victoria - Bendigo Advertiser", "description": "The stark contrast between the slow spread of coronavirus in Victoria and the pandemic internationally makes the state the \"envy of the world\". Deputy chief h...", "url": "https://www.bendigoadvertiser.com.au/story/6734968/vic-cases-enviable-but-virus-is-not-over/", "urlToImage": null, "publishedAt": "2020-04-25T03:58:00Z", "content": ""}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Maggie Fox", "title": "COVID-19 causing blood clots, sudden strokes in young adults, doctors say - CTV News", "description": "The new coronavirus appears to be causing sudden strokes in adults in their 30s and 40s who are not otherwise terribly ill, doctors reported Wednesday.", "url": "https://www.ctvnews.ca/health/coronavirus/covid-19-causing-blood-clots-sudden-strokes-in-young-adults-doctors-say-1.4910674", "urlToImage": null, "publishedAt": "2020-04-25T03:40:15Z", "content": "The new coronavirus appears to be causing sudden strokes in adults in their 30s and 40s who are not otherwise terribly ill, doctors reported Wednesday.\r\nThey said patients may be unwilling to call 911 because they have heard hospitals are overwhelmed by coron… [+2516 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": null, "title": "Dentists, doctors, registered nurses most at risk of catching COVID-19 - Daily Telegraph", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.dailytelegraph.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T03:00:00Z", "content": null}, {"source": {"id": null, "name": "News-medical.net"}, "author": null, "title": "Active ingredient from parasite larvae could help treat asthma - News-Medical.Net", "description": "The larvae of the roundworm Heligmosomoides polygyrus bakeri (Hpb) need a very special environment in order to survive: They have to invade the mucosal layer of the intestine in rodents, the only place where they can then develop into adult worms capable of r…", "url": "https://www.news-medical.net/news/20200424/Active-ingredient-from-parasite-larvae-could-help-treat-asthma.aspx", "urlToImage": null, "publishedAt": "2020-04-25T00:24:01Z", "content": "Reviewed by Emily Henderson, B.Sc.Apr 24 2020\r\nThe larvae of the roundworm Heligmosomoides polygyrus bakeri (Hpb) need a very special environment in order to survive: They have to invade the mucosal layer of the intestine in rodents, the only place where they… [+2953 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Baked beans an unlikely nutrition star, and pandemic hit - Health - ABC News", "description": "While baked beans might not look particularly sexy, they're a favourite among nutrition experts. Here's why.", "url": "https://www.abc.net.au/news/health/2020-04-25/baked-beans-an-unlikely-nutrition-star/12176974", "urlToImage": null, "publishedAt": "2020-04-25T00:17:11Z", "content": "As we all fight our inner \"prepper\" and try not to succumb to panic buying, it seems many of us have turned to an old favourite: baked beans.\r\nBean production at Australia's largest fruit and vegetable cannery in Shepparton, Victoria, has doubled its usual vo… [+5001 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Kate Kelland and Manas Mishra", "title": "Could warm weather help contain pandemic? - Gold Coast Bulletin", "description": "As the seasons change in the northern and southern hemispheres, questions are being asked about the influence of weather in the spread of coronavirus, which has killed more than 190,000 people and sent the global economy into a tailspin.", "url": "https://www.news.com.au/world/breaking-news/could-warm-weather-help-contain-pandemic/news-story/3151c026d02efea4a5c503ede2417b8d", "urlToImage": null, "publishedAt": "2020-04-25T00:12:00Z", "content": "As the seasons change in the northern and southern hemispheres, questions are being asked about the influence of weather in the spread of coronavirus, which has killed more than 190,000 people and sent the global economy into a tailspin.\r\nHere's what we know … [+3623 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "CNN", "title": "Coronavirus update: Experts say not to wipe down groceries or takeout but wash your hands - 7NEWS.com.au", "description": "One of the scientists who found the virus might live on cardboard for up to 24 hours and metal and plastic for two to three days has spoken out.", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-update-experts-say-not-to-wipe-down-groceries-or-takeout-but-wash-your-hands-c-998677", "urlToImage": null, "publishedAt": "2020-04-24T23:12:48Z", "content": "Experts say it might be time to reconsider wiping down your groceries and take-out food.\r\nThe US Food and Drug Administration (FDA) has joined the chorus of scientific experts who say there is no real risk of getting the virus that causes COVID-19 that way.\r\n… [+3845 chars]"}, {"source": {"id": null, "name": "Popsugar.com.au"}, "author": "Maggie Ryan", "title": "If We Get a Second Wave of Coronavirus, Here's When to Expect It — and How to Stay Safe - POPSUGAR Health and Fitness Australia", "description": "A second coronavirus outbreak is possible. If it comes, doctors say it will be more important than ever to social distance and follow other precautions.", "url": "https://www.popsugar.com.au/fitness/will-there-be-second-wave-coronavirus-47420049", "urlToImage": null, "publishedAt": "2020-04-24T22:43:05Z", "content": "The coronavirus pandemic continues, but parts of the US are already considering a return to some semblance of normalcy. That means that the issue of a \"second wave\" of coronavirus cases is one we're starting to hear a lot about. What's happening, explained St… [+3528 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Sydney doctor Edward O’Neill in UK coronavirus vaccine trial - 7NEWS.com.au", "description": "Edward O'Neill believes taking part in a UK coronavirus vaccine trial is the right thing to do but admits he's taking a \"walk in faith\".", "url": "https://7news.com.au/lifestyle/health-wellbeing/aussie-to-walk-in-faith-in-vaccine-trial-c-998463", "urlToImage": null, "publishedAt": "2020-04-24T21:49:15Z", "content": "An Australian man who is testing a potential coronavirus vaccine in the UK says he is taking a walk in faith.\r\nDr Edward ONeill was one of the first two people injected as part of trials for a potential vaccine that has been developed by Oxford University.\r\nT… [+1441 chars]"}, {"source": {"id": null, "name": "Popsugar.com.au"}, "author": "Kate Schweitzer", "title": "Cats Can, In Fact, Get Coronavirus: Here’s What Pet Owners Need to Know - POPSUGAR Australia", "description": "What", "url": "https://www.popsugar.com.au/pets/how-to-tell-if-your-cat-has-coronavirus-47419889", "urlToImage": null, "publishedAt": "2020-04-24T21:30:35Z", "content": "It was confirmed this week that two domesticated cats had been infected with the coronavirus in the United States. Following early news reports of lions and tigers showing COVID-19 symptoms at a New York zoo, this is the first case of household pets testing p… [+4817 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Not flattening the curve, crushing it - Fraser Coast Chronicle", "description": "One statistic tells a story that is far more positive than the 6,675 Australians with COVID-19 you may have heard on the news.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-australia-forget-flattening-the-curve-australia-is-crushing-it/news-story/05f19f874fc8c16f32b4559d9049b84f", "urlToImage": null, "publishedAt": "2020-04-24T21:09:00Z", "content": "As the number of COVID-19 cases explodes across the globe, it's easy to forget a statistic that rarely hits the headlines.\r\nBut it remains the key to understanding how close Australia is to not simply flattening the curve, but crushing it.\r\nThe statistic is t… [+4838 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Olivia Willis", "title": "When coronavirus patients suddenly decline, their own immune system might be to blame - ABC News", "description": "In some cases of COVID-19, it may be the body's response to the virus, rather than the virus itself, that ultimately causes harm.", "url": "https://www.abc.net.au/news/health/2020-04-25/coronavirus-covid-immune-response-causes-harm/12176872", "urlToImage": null, "publishedAt": "2020-04-24T20:30:29Z", "content": "It's been described as the \"second week crash\".\r\nAbout seven days after developing symptoms of COVID-19, some people even those with mild symptoms can suddenly start to deteriorate, often with little warning.\r\n\"They end up getting admitted to hospital, and ab… [+6217 chars]"}, {"source": {"id": null, "name": "9news.com.au"}, "author": "Associated Press", "title": "France braces for second wave of infections; EPA contradicts Trump disinfectant 'cure' suggestion - 9News", "description": "<p>France is preparing for a <a href=\"https://news-website-prev.ap-southeast-2.elasticbeanstalk.com/world/worst-ways-coronavirus-pandemic-has-been-handled/c7a84cfa-a169-4fb1-bff9-a574381543de\">second wave of virus cases</a>, Britain is reporting nearly 20,000…", "url": "https://www.9news.com.au/world/france-braces-for-coronavirus-second-wave/8c127830-54ed-4fc6-97f4-f26618ab4f4e", "urlToImage": null, "publishedAt": "2020-04-24T19:54:51Z", "content": "Property News: Creative ways people are staying connected during isolation - domain.com.au"}, {"source": {"id": null, "name": "Medicinenet.com"}, "author": null, "title": "Blood Clotting, Strokes in Young Adults With COVID-19 - MedicineNet", "description": "More acute, large vessel strokes in young adults infected with COVID-19.", "url": "https://www.medicinenet.com/blood_clotting_strokes_in_young_adults_with_covid-news.htm", "urlToImage": null, "publishedAt": "2020-04-24T19:18:45Z", "content": "Damian McNamaraApril 24, 2020\r\nPhysicians in New York City, which still leads the nation in reported COVID-19 cases, are reporting significantly more acute, large vessel strokes in young adults infected with COVID-19.\r\nIn a rapid communication to be published… [+2313 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Deconfine or double down? Coronavirus in France, Turkey, Sweden, Russia - The World This Week - FRANCE 24 English", "description": "From Russia, where mobile phone apps track citizens to ensure compliance with lockdown, to Sweden, which never confined and opted instead for herd immunity, ...", "url": "https://www.youtube.com/watch?v=E_mepoumEA4", "urlToImage": null, "publishedAt": "2020-04-24T19:03:19Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jon Fingas", "title": "Lyft extends free scooter rides for critical workers through May - Yahoo News Australia", "description": "Lyft is giving healthcare workers and other vital staff another month of free rides to help during the COVID-19 pandemic.", "url": "https://au.news.yahoo.com/lyft-extends-free-scooter-rides-for-critical-workers-184144961.html", "urlToImage": null, "publishedAt": "2020-04-24T18:41:00Z", "content": "Lyft isnt waiting until the end of April to decide on the fate of its free scooter rides for critical workers during the COVID-19 pandemic. The ridesharing firm has extended its LyftUp Scooter Program through May, giving free rides to healthcare, emergency an… [+877 chars]"}]}