{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Entrepreneurs are 'focussed' on securing a COVID-19 vaccine - Sky News Australia", "description": "The ability “to make money and do good” is driving many entrepreneurs and venture capitalists to invest in projects designed to find a COVID-19 vaccine, acco...", "url": "https://www.youtube.com/watch?v=yIZbwEOxPxc", "urlToImage": null, "publishedAt": "2020-04-26T04:30:38Z", "content": null}, {"source": {"id": null, "name": "Heraldsun.com.au"}, "author": "Alex White", "title": "Return kids to classrooms, says Victorian Opposition leader Michael O'Brien - Herald Sun", "description": "The push is on for Victorian students to return to classrooms immediately with the Opposition calling on the State Government to reopen campuses to all children.", "url": "https://www.heraldsun.com.au/education/return-kids-to-classrooms-says-victorian-opposition-leader-michael-obrien/news-story/dfb1fcbd1b1165248d9a33cbb96cf1b1", "urlToImage": null, "publishedAt": "2020-04-26T04:21:00Z", "content": "The push is on for Victorian students to return to classrooms immediately with the Opposition calling on the State Government to reopen campuses to all children.\r\nOpposition Leader Michael O’Brien has demanded Premier Daniel Andrews follow the national advice… [+4917 chars]"}, {"source": {"id": null, "name": "Miragenews.com"}, "author": null, "title": "Queensland latest coronavirus data as at 26 April - Mirage News", "description": "Queensland has confirmed three news cases of novel coronavirus (COVID-19) raising the state total to 1,030. Yesterday's total cases were revised up from...", "url": "https://www.miragenews.com/queensland-latest-coronavirus-data-as-at-26-april/", "urlToImage": null, "publishedAt": "2020-04-26T02:36:07Z", "content": "Queensland has confirmed three news cases of novel coronavirus (COVID-19) raising the state total to 1,030.\r\nYesterday’s total cases were revised up from 1,026 to 1,027.\r\n* HHS level case data may include a patient’s residential address, Public Health Unit ma… [+2452 chars]"}, {"source": {"id": null, "name": "Hepburnadvocate.com.au"}, "author": "Melbourne", "title": "One new COVID-19 death in Victoria - Hepburn Advocate", "description": "Victoria has recorded one new death from coronavirus overnight on Saturday. Health Minister Jenny Mikakos announced on Sunday a man in his 90s died in hospita...", "url": "https://www.hepburnadvocate.com.au/story/6735329/one-new-covid-19-death-in-victoria/?cs=7", "urlToImage": null, "publishedAt": "2020-04-26T01:56:02Z", "content": "Victoria has recorded one new death from coronavirus overnight on Saturday.\r\nHealth Minister Jenny Mikakos announced on Sunday a man in his 90s died in hospital, bringing the state's total deaths to 17.\r\nThe state's total coronavirus cases now stands at 1349,… [+2250 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Lauren Ferri For Daily Mail Australia", "title": "Sydney healthcare worker tests positive for coronavirus fears of ANOTHER hospital COVID-19 cluster - Daily Mail", "description": "The employee was working at Nepean Hospital in the Blue Mountains region, west of Sydney, undertaking non-clinical duties before she was diagnosed.", "url": "https://www.dailymail.co.uk/news/article-8257589/Sydney-healthcare-worker-tests-positive-coronavirus-fears-hospital-COVID-19-cluster.html", "urlToImage": null, "publishedAt": "2020-04-26T01:48:07Z", "content": "A hospital worker has tested positive for coronavirus.\r\nThe employee was working at Nepean Hospital in the Blue Mountains region, west of Sydney, undertaking non-clinical duties before she was diagnosed.\r\nNepean Blue Mountains Local Health District confirmed … [+3340 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Lucy Mae Beers", "title": "Jenny Mikakos confirms 17th death in Victoria from coronavirus - 7NEWS.com.au", "description": "One of the new cases is a patient at the private inpatient psychiatric facility where there is an outbreak.", "url": "https://7news.com.au/lifestyle/health-wellbeing/jenny-mikakos-confirms-17th-death-in-victoria-from-coronavirus-c-999641", "urlToImage": null, "publishedAt": "2020-04-26T01:42:33Z", "content": "A man has died in a Victorian hospital, bringing the states COVID-19 death toll to 17.\r\nOn Sunday, Health Minister Jenny Mikakos confirmed the man was aged in his 90s and had passed away overnight.\r\nI want to express my sympathies to the family of the gentlem… [+633 chars]"}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "The Sunday Telegraph", "title": "One in three parents unaware flu vaccination is recommended for kids - PerthNow", "description": "There is a record uptake of influenza vaccine in adults this year but vaccination in children is lagging, with researching showing one-in-three parents don’t know it is recommended for children under five.", "url": "https://www.perthnow.com.au/news/nsw/one-in-three-parents-unaware-flu-vaccination-is-recommended-for-kids-ng-c64564798dc4d31c269553bf9cd86093", "urlToImage": null, "publishedAt": "2020-04-26T01:17:03Z", "content": "There is a record uptake of influenza vaccine in adults this year but vaccination in children is lagging, with researching showing \r\none-in-three parents dont know it is recommended for children under five. \r\nEven though these shots are now available free on … [+2291 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": null, "title": "'No evidence' recovered COVID-19 patients are immune, warns WHO - Sydney Morning Herald", "description": "The United Nations agency warned governments against issuing \"immunity passports\" or \"risk-free certificates\" to people who have been infected.", "url": "https://www.smh.com.au/world/europe/no-evidence-recovered-covid-19-patients-cannot-be-reinfected-warns-who-20200426-p54na1.html", "urlToImage": null, "publishedAt": "2020-04-26T01:07:54Z", "content": "\"There is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection,\" it said.\r\nChile said last week it would begin handing out \"health passports\" to people deemed to have recovered from the i… [+726 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Evgeny Lebedev For The Mail On Sunday", "title": "Shocking picture of bats for sale in Indonesia shows wet markets are still open - Daily Mail", "description": "Since I have begun to write on the urgent need to close live animal markets, I have been surprised by the support I have received from across the UK.", "url": "https://www.dailymail.co.uk/news/article-8257375/Shocking-picture-bats-sale-Indonesia-shows-wet-markets-open.html", "urlToImage": null, "publishedAt": "2020-04-26T00:56:23Z", "content": "Since I have begun to write on the urgent need to close live animal markets, I have been surprised by the support I have received from across the UK. \r\nReaders of The Mail on Sunday have written to say how strongly they agree about the threat of contagion the… [+3244 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: US and China trade conspiracy theories - BBC News", "description": "Conspiracy theories about Covid-19 have been spreading online since the early days of the outbreak.", "url": "https://www.bbc.com/news/world-52224331", "urlToImage": null, "publishedAt": "2020-04-26T00:23:19Z", "content": "Image caption\r\n Speculation about the origin of the virus has been rife online\r\nFrom the early stages of the coronavirus outbreak, conspiracy theories about the origin and scale of the disease were spread on online platforms. \r\nAmong these were the false clai… [+6717 chars]"}, {"source": {"id": null, "name": "Mtv.com.au"}, "author": null, "title": "More Depressing News: WHO Reveals That There's No Evidence That You'll Be Immune From COVID-19 Just Because You've Had It Before - MTV News Australia", "description": "WHO's new scientific brief reveals that even if you've had coronavirus already, there's no evidence you'll be safe from catching the virus again.", "url": "http://www.mtv.com.au/irl/news/who-says-just-coz-youve-had-covid19-doesnt-mean-you-cant-get-it-again-so-yeah-that-could-affect-govts-strategies", "urlToImage": null, "publishedAt": "2020-04-26T00:16:00Z", "content": "While scientists previously theorised that people whod recovered from COVID-19 couldnt get the deadly virus again, the World Health Organization has this week revealed that theres \"no evidence to support that, reports the ABC.\r\nIn a scientific brief released … [+2620 chars]"}, {"source": {"id": "xinhua-net", "name": "Xinhua Net"}, "author": null, "title": "Study reveals link between ADHD and sleeping disorder - Xinhua | English.news.cn - Xinhua", "description": null, "url": "http://www.xinhuanet.com/english/2020-04/26/c_139008340.htm", "urlToImage": null, "publishedAt": "2020-04-26T00:07:03Z", "content": "SHANGHAI, April 26 (Xinhua) -- An international team of researchers have found that Attention Deficit Hyperactivity Disorder (ADHD) is related to sleeping disorder through brain imaging analysis.\r\nADHD is seen in some children who are often accompanied by sle… [+1022 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Yahoo News Australia and agencies", "title": "Coronavirus: Mum's shocking discovery after awaking from coma - Yahoo News Australia", "description": "A mother with coronavirus woke up from a 'living nightmare' to discover some very surprising news.", "url": "https://au.news.yahoo.com/coronavirus-mums-shocking-discovery-after-awaking-from-coma-232017036.html", "urlToImage": null, "publishedAt": "2020-04-25T23:20:00Z", "content": "A mother-of-three discovered she was pregnant with twins after waking up from an induced coma while battling COVID-19.\r\nDanielle Martin, 32, from Belfast, Northern Ireland, initially had a sore throat which worsened, but she never thought it would be the dead… [+3587 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Alex Woodward", "title": "Coronavirus: 'No evidence' recovered patients are immune to re-infection, warns WHO - The Independent", "description": "World Health Organisation does not recommend governments issue 'immunity passports' as countries look to 'reopen' amid pandemic", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-immunity-passports-antibody-tests-world-health-organisation-a9484261.html", "urlToImage": null, "publishedAt": "2020-04-25T23:11:26Z", "content": "The World Health Organisation says there is no evidence that people who have recovered from coronavirus and have antibodies are protected against a second infection.\r\nIn a scientific brief published on Saturday, the United Nations agency warned against countr… [+2673 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Alex Turner-Cohen", "title": "Coronavirus: Six-month-old baby from Manchester beats COVID-19, parents overjoyed - NEWS.com.au", "description": "Coronavirus: Six-month-old baby from Manchester beats COVID-19, parents overjoyed", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-sixmonthold-baby-from-manchester-beats-covid19-parents-overjoyed/news-story/dd23c0c28d8689c2497724fdb6291258", "urlToImage": null, "publishedAt": "2020-04-25T23:05:20Z", "content": "Already severely underweight and with other medical complications, doctors thought this six-month-old baby was done for when she contracted COVID-19. But Erin Bates pulled through and has become a symbol of hope for others.\r\nThe baby from Manchester, England,… [+3668 chars]"}, {"source": {"id": null, "name": "Nzherald.co.nz"}, "author": "NZ Herald", "title": "Covid-19 coronavirus: Healthy young people dying of virus-related strokes - New Zealand Herald", "description": "A terrifying warning has been issued about people with mild or no symptoms of the virus.", "url": "https://www.nzherald.co.nz/world/news/article.cfm?c_id=2&objectid=12327627", "urlToImage": null, "publishedAt": "2020-04-25T22:53:21Z", "content": "Young people, with mild to no symptoms of Covid-19, are dying of strokes related to the virus, doctors have warned.\r\n The experts say Covid-19 seems to be the cause for sudden strokes in adults in their 30s and 40s, who are otherwise healthy.\r\n Doctors in the… [+1525 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "CNN", "title": "WHO warn people who have had coronavirus not necessarily immune - 7NEWS.com.au", "description": "It has issued a warning to governments that are considering issuing “immunity passports” to people who have had COVID-19.", "url": "https://7news.com.au/lifestyle/health-wellbeing/who-warn-people-who-have-had-coronavirus-not-necessarily-immune-c-999511", "urlToImage": null, "publishedAt": "2020-04-25T22:49:12Z", "content": "The World Health Organization is warning that people who have had COVID-19 are not necessarily immune by the presence of antibodies from getting the virus again.\r\nThere is no evidence yet that people who have had COVID-19 will not get a second infection, WHO … [+1765 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Summer Woolley", "title": "Coronavirus update: Six-month-old baby with heart condition survives COVID-19 - 7NEWS.com.au", "description": "The baby received a standing ovation from hospital staff but just weeks prior, her parents Emma and Wayne had been told they were going to lose her.", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-update-six-month-old-baby-with-heart-condition-survives-covid-19-c-999490", "urlToImage": null, "publishedAt": "2020-04-25T22:33:50Z", "content": "A six-month-old baby who fought through a rare heart defect, a respiratory illness and collapsed lungs has now survived COVID-19.\r\nThe baby from Manchester, England, received a standing ovation from NHS staff as she was escorted through the hospital.\r\nJust we… [+3155 chars]"}, {"source": {"id": null, "name": "Skynews.com.au"}, "author": null, "title": "National death toll reaches 81 - Sky News Australia", "description": "A sixth resident has died at a coronavirus-affected aged care home in Western Sydney, taking the national death toll to 81.\n\nThe 83-year-old man already suffered from multiple health issues before testing positive for COVID-19 and the official cause of his de…", "url": "https://www.skynews.com.au/details/_6152046097001", "urlToImage": null, "publishedAt": "2020-04-25T22:11:51Z", "content": null}, {"source": {"id": null, "name": "Noosanews.com.au"}, "author": "Peter Gardiner, Peter Gardiner", "title": "It's been and age, but Noosa nursing visits back on! - Noosa News", "description": "Showing compassion to our community as NoosaCare goes above and beyond to help residents.", "url": "https://www.noosanews.com.au/news/its-been-and-age-but-noosa-nursing-visits-back-on/4002882/", "urlToImage": null, "publishedAt": "2020-04-25T20:30:00Z", "content": "HOLLYWOOD legend Humphrey Bogart could not have put it any better than the message board held up by one of the NoosaCare residents forced into social isolation by the coronavirus pandemic.\r\nShe wrote to her loved ones: As time goes by we will catch up\r\nAnd to… [+5409 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": null, "title": "COVID-19 back to school: NSW schools’ blueprint on returning - Daily Telegraph", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.dailytelegraph.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T20:01:47Z", "content": null}, {"source": {"id": null, "name": "Illawarramercury.com.au"}, "author": null, "title": "Global coronavirus death toll hits 200000 - Illawarra Mercury", "description": "As the global death toll from the coronavirus surpassed 200,000 on Saturday, countries took cautious steps toward easing lockdowns imposed amid the pandemic,...", "url": "https://www.illawarramercury.com.au/story/6735340/global-coronavirus-death-toll-hits-200000/?cs=298", "urlToImage": null, "publishedAt": "2020-04-25T19:09:56Z", "content": ""}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ariana Eunjung Cha", "title": "Spike in stroke deaths in patients with only minor coronavirus symptoms - The Independent", "description": "Reports of strokes in the young and middle-aged are the latest twist in our evolving understanding of the mysteries of the virus, finds Ariana Eunjung Cha", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-stroke-deaths-symptoms-covid-19-heart-a9484091.html", "urlToImage": null, "publishedAt": "2020-04-25T18:45:03Z", "content": "Thomas Oxley wasnt even on call the day he received the page to come into Mount Sinai Beth Israel Hospital in Manhattan. There werent enough doctors to treat all the emergency stroke patients, and he was needed in the operating room.\r\nThe patients chart appea… [+9849 chars]"}, {"source": {"id": null, "name": "Greatlakesadvocate.com.au"}, "author": null, "title": "Contact checks on WA's latest virus case - Great Lakes Advocate", "description": "Contact tracing is under way after yet another coronavirus case in Western Australia linked to a cruise ship. Health authorities confirmed on Saturday that a...", "url": "https://www.greatlakesadvocate.com.au/story/6735328/contact-checks-on-was-latest-virus-case/?cs=9397", "urlToImage": null, "publishedAt": "2020-04-25T17:30:39Z", "content": ""}, {"source": {"id": null, "name": "Youngwitness.com.au"}, "author": "Tim Dornin", "title": "SA near end of coronavirus testing blitz - The Young Witness", "description": "South Australia has recorded no new cases of the coronavirus on six of the past eight days as it continues with a two-week testing blitz to flush out infectio...", "url": "https://www.youngwitness.com.au/story/6735327/sa-near-end-of-coronavirus-testing-blitz/", "urlToImage": null, "publishedAt": "2020-04-25T17:30:09Z", "content": "South Australia has recorded no new cases of the coronavirus on six of the past eight days as it continues with a two-week testing blitz to flush out infections across the community.\r\nOnly three new cases have been reported over the past week leaving the stat… [+828 chars]"}, {"source": {"id": null, "name": "Independentaustralia.net"}, "author": null, "title": "Still in the dark over COVID-19, testing and re-testing is vital - Independent Australia", "description": "To hedge risk, we need to estimate the risk. Yet COVID-19 involves too much uncertainty to know.", "url": "https://independentaustralia.net/life/life-display/still-in-the-dark-over-covid-19-testing-and-re-testing-is-vital,13829", "urlToImage": null, "publishedAt": "2020-04-25T16:34:43Z", "content": "To hedge risk, we need to estimate the risk. Yet COVID-19 involves too much uncertainty to know.\r\nWe have to rely on the experience of other countries and other viruses. We know more than a month ago, but still need to know more. We need to know the likelihoo… [+6348 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "'No evidence' yet that recovered Covid-19 patients cannot be reinfected: WHO - Times of India", "description": "Rest of World News: The WHO said on Saturday that there was currently \"no evidence\" that people who have recovered from Covid-19 and have antibodies are protected from a", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/no-evidence-yet-that-recovered-covid-patients-cannot-be-reinfected-who/articleshow/75374877.cms", "urlToImage": null, "publishedAt": "2020-04-25T15:16:26Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Alle McMahon", "title": "Coronavirus: WHO warns countries against handing out ‘immunity passports’ - NEWS.com.au", "description": "Coronavirus: WHO warns countries against handing out ‘immunity passports’", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-who-warns-countries-against-handing-out-immunity-passports/news-story/bb6f5b9447911f5e06eed525b363a84d", "urlToImage": null, "publishedAt": "2020-04-25T15:09:34Z", "content": "The World Health Organisation (WHO) has warned against handing out immunity passports to people who have recovered from the coronavirus, saying there is no evidence they are protected from catching the disease again.Several countries anxious to reboot their e… [+2709 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Associated Press", "title": "WHO warns against idea of ‘immunity passports’ - INQUIRER.net", "description": "BERLIN — The World Health Organization (WHO) has cautioned against the idea of “immunity passports,&quot; saying there is currently no evidence that people who have recovered from COVID-19 and", "url": "https://newsinfo.inquirer.net/1264763/who-warns-against-idea-of-immunity-passports", "urlToImage": null, "publishedAt": "2020-04-25T14:15:00Z", "content": "Subscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer &amp; other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am &amp; share articles on social media. Call 896 6000."}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Reuters", "title": "US coronavirus death toll tops 50,000 - Geo News", "description": "United States is the country hardest-hit by the virus with more than 890,000 confirmed cases", "url": "https://www.geo.tv/latest/284830-us-coronavirus-death-toll-tops-50000", "urlToImage": null, "publishedAt": "2020-04-25T13:45:43Z", "content": "The death toll from the novel coronavirus topped 51,000 on Friday as nearly one in six workers out of a job, Georgia, Oklahoma and several other states took tentative steps at reopening businesses, despite disapproval from President Donald Trump and medical e… [+5484 chars]"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "Staff", "title": "WHO says ‘no evidence’ that recovered COVID-19 patients cannot be re-infected - Global News", "description": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.", "url": "http://globalnews.ca/news/6867902/coronavirus-who-patients-reinfected/", "urlToImage": null, "publishedAt": "2020-04-25T13:43:33Z", "content": "The World Health Organization (WHO) said on Saturday that there was currently “no evidence” that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nIn a scientific brief, the United Nations agency w… [+1913 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Zach Hope", "title": "Farmers ploughing fresh veggies back into soil as restaurant ban bites - The Age", "description": "Millions of dollars of fresh produce is going to waste as the coronavirus ban on dining at cafes, restaurants and pubs continues without an end in sight.", "url": "https://www.theage.com.au/national/victoria/farmers-ploughing-fresh-veggies-back-into-soil-as-restaurant-ban-bites-20200424-p54n0q.html", "urlToImage": null, "publishedAt": "2020-04-25T13:31:19Z", "content": "\"We are planting, but we're planting for numbers that we're just guessing at.\"\r\nMr Haw said his business had lost \"literally millions\" of dollars worth of produce since the coronavirus outbreak, having \"ploughed it back into the ground because we can't sell i… [+2192 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "WHO says no evidence recovered COVID-19 patients are immune to reinfection - The Times of Israel", "description": "UN health agency warns against notion of 'immunity passports,' saying they could risk further transmission of the coronavirus", "url": "https://www.timesofisrael.com/who-says-no-evidence-recovered-covid-19-patients-immune-to-reinfection/", "urlToImage": null, "publishedAt": "2020-04-25T12:54:26Z", "content": "The World Health Organization on Saturday said there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection, cautioning against the idea of immunity passports.\r\nThe concept of immunit… [+4204 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "DOH: More than 72000 lab tests conducted for COVID-19 in PH - INQUIRER.net", "description": "More than 72,000 laboratory tests were conducted for checking novel coronavirus or SARS-CoV-2, which causes COVID-19, in the country, the Department of Healt...", "url": "https://www.youtube.com/watch?v=fB_ScQAcFZs", "urlToImage": null, "publishedAt": "2020-04-25T11:58:23Z", "content": "More than 72,000 laboratory tests were conducted for checking novel coronavirus or SARS-CoV-2, which causes COVID-19, in the country, the Department of Health (DOH) said Saturday. Video by PTV\r\nVisit us at https://www.inquirer.netFacebook: https://facebook.co… [+58 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Alex Turner-Cohen", "title": "Baby makes 'miracle' recovery to beat virus - Queensland Times", "description": "Coronavirus: Six-month-old baby from Manchester beats COVID-19, parents overjoyed", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-sixmonthold-baby-from-manchester-beats-covid19-parents-overjoyed/news-story/dd23c0c28d8689c2497724fdb6291258", "urlToImage": null, "publishedAt": "2020-04-25T09:49:00Z", "content": "Already severely underweight and with other medical complications, doctors thought this six-month-old baby was done for when she contracted COVID-19. But Erin Bates pulled through and has become a symbol of hope for others.\r\nThe baby from Manchester, England,… [+3668 chars]"}, {"source": {"id": null, "name": "Standard.net.au"}, "author": "Gus McCubbing", "title": "Blue Mtns health worker positive for virus - Warrnambool Standard", "description": "An 83-year-old man has died from COVID-19 at an aged care facility in western Sydney, taking the state's virus toll to 36. The man was a resident at Anglicare...", "url": "https://www.standard.net.au/story/6734966/sixth-virus-death-at-nsw-age-care-facility/?cs=10264", "urlToImage": null, "publishedAt": "2020-04-25T09:27:18Z", "content": ""}, {"source": {"id": "breitbart-news", "name": "Breitbart News"}, "author": "Breitbart London", "title": "WHO Discourages Coronavirus ‘Immunity Passports’, Ex-Patients Could Be Reinfected - Breitbart", "description": "BERLIN (AP) -- The World Health Organization is cautioning against the idea of \"immunity passports.\" It says there is currently no evidence that people who have recovered from Covid-19 and have antibodies are protected against a second infection.", "url": "https://www.breitbart.com/europe/2020/04/25/who-discourages-coronavirus-immunity-passports-no-evidence-patients-cannot-be-reinfected/", "urlToImage": null, "publishedAt": "2020-04-25T08:57:00Z", "content": "BERLIN (AP) — The World Health Organization is cautioning against the idea of “immunity passports.” It says there is currently no evidence that people who have recovered from Covid-19 and have antibodies are protected against a second infection.\r\nThe concept … [+832 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Dave Lee", "title": "Craft site Etsy sews up share bounce with homemade masks - Financial Times", "description": "News, analysis and comment from the Financial Times, the worldʼs leading global business publication", "url": "https://www.ft.com/content/075c1d10-29e4-4a52-ad67-16d3825705c8", "urlToImage": null, "publishedAt": "2020-04-25T08:43:44Z", "content": "Keep abreast of significant corporate, financial and political developments around the world.\r\nStay informed and spot emerging risks and opportunities with independent global reporting, expert\r\ncommentary and analysis you can trust."}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/peta-fuller/11746470", "title": "Sentinel testing will be part of the strategy before Australia's coronavirus restrictions are potentially eased - ABC News", "description": "Australians are seeing more days with low (or even no) new coronavirus cases in their state. But alone, that's not enough to see restrictions ease. Can more testing help?", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-sentinel-testing-surveillance-testing-covid-19/12180274", "urlToImage": null, "publishedAt": "2020-04-25T07:58:12Z", "content": "Updated \r\nApril 25, 2020 17:10:08\r\nThere's a new testing buzzword in Australia and it might sound slightly ominous sentinel surveillance or sentinel testing.\r\nAs our COVID-19 case rates slow, it's part of the next step to staying on top of infection rates in … [+5412 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "France to trial nicotine patches to prevent COVID-19 - Big Rigs", "description": "Despite repeated warnings that smokers have a higher risk of severe cases one European country is hoping to trial nicotine patches on healthcare workers.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-france-to-trial-nicotine-patches-to-prevent-covid19/news-story/616d8f570780c5eba4d76b34ba015c7e", "urlToImage": null, "publishedAt": "2020-04-25T07:40:37Z", "content": "France is hoping to trial nicotine patches on healthcare workers after a study suggested that smokers may have a lesser chance of catching coronavirus.\r\nThe surprising findings come despite health officials around the world repeatedly warning that smokers who… [+2894 chars]"}, {"source": {"id": null, "name": "Couriermail.com.au"}, "author": "NATASHA BITA", "title": "Miner, his workmates and the false COVID-19 tests - Daily Examiner", "description": "Queensland Health says a few coronavirus tests have yielded false positives but won’t reveal the number of wrong results.", "url": "https://www.couriermail.com.au/news/queensland/queensland-health-some-coronavirus-tests-yield-minute-number-of-false-results/news-story/ac6f8833ce82c60874f2737498ec4681", "urlToImage": null, "publishedAt": "2020-04-25T06:46:00Z", "content": "QUEENSLAND Health has revealed a \"minute proportion'' of wrong results in coronavirus tests.\r\nThe false positives include a BHP worker from Blackwater Mine, whose workmates were forced into isolation after his test earlier this month.\r\nQueensland Health told … [+2046 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": "Jane Hansen", "title": "Risky business: 100 jobs most at risk of COVID-19 - Ballina Shire Advocate", "description": "They are the 100 occupations most at risk of contracting COVID-19. And while some are obvious given their exposure to people, others far less so.", "url": "https://www.dailytelegraph.com.au/coronavirus/dentists-doctors-registered-nurses-most-at-risk-of-catching-covid19/news-story/880ffd1dc28abcf3c5b26fe6e16d773f", "urlToImage": null, "publishedAt": "2020-04-25T03:18:00Z", "content": "While doctors and nurses are the heroes on the front line, risking greater exposure to coronavirus, many other occupations also have risk and analysts have crunched the data into an occupation risk score.\r\nThe US-based Occupation Information Network has found… [+4558 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": null, "title": "Dentists, doctors, registered nurses most at risk of catching COVID-19 - Daily Telegraph", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.dailytelegraph.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-25T03:00:00Z", "content": null}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Candace Sutton", "title": "COVID-19 kills in 'brain to toe rampage' - Ipswich Advertiser", "description": "How COVID-19 kills in ‘ferocious rampage from brain to toes’", "url": "https://www.news.com.au/world/coronavirus/health/how-covid19-kills-in-ferocious-rampage-from-brain-to-toes/news-story/76f8edff42d1302b2c9acc8211547ea6", "urlToImage": null, "publishedAt": "2020-04-25T02:28:00Z", "content": "COVID-19 kills in a ferocious rampage through the body from brain to toes doctors have explained, saying the virus acts like no pathogen humanity has ever seen.In an article in sciencemag.org, frontline clinicians caring for the five per cent who become criti… [+7241 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Baked beans an unlikely nutrition star, and pandemic hit - Health - ABC News", "description": "While baked beans might not look particularly sexy, they're a favourite among nutrition experts. Here's why.", "url": "https://www.abc.net.au/news/health/2020-04-25/baked-beans-an-unlikely-nutrition-star/12176974", "urlToImage": null, "publishedAt": "2020-04-25T00:17:11Z", "content": "As we all fight our inner \"prepper\" and try not to succumb to panic buying, it seems many of us have turned to an old favourite: baked beans.\r\nBean production at Australia's largest fruit and vegetable cannery in Shepparton, Victoria, has doubled its usual vo… [+5001 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Kate Kelland and Manas Mishra", "title": "Could warm weather help contain pandemic? - Gold Coast Bulletin", "description": "As the seasons change in the northern and southern hemispheres, questions are being asked about the influence of weather in the spread of coronavirus, which has killed more than 190,000 people and sent the global economy into a tailspin.", "url": "https://www.news.com.au/world/breaking-news/could-warm-weather-help-contain-pandemic/news-story/3151c026d02efea4a5c503ede2417b8d", "urlToImage": null, "publishedAt": "2020-04-25T00:12:00Z", "content": "As the seasons change in the northern and southern hemispheres, questions are being asked about the influence of weather in the spread of coronavirus, which has killed more than 190,000 people and sent the global economy into a tailspin.\r\nHere's what we know … [+3623 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Expectant mothers prepare to have children in the midst of COVID-19 pandemic - CBS 17", "description": "Expectant mothers prepare to have children in the midst of COVID-19 pandemic", "url": "https://www.youtube.com/watch?v=xf3lExxSb94", "urlToImage": null, "publishedAt": "2020-04-24T22:09:28Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Lateshia Beachum, The Washington Post", "title": "Researchers found coronavirus in a patient’s eyes — days after it left her nose - SF Gate", "description": "Italy's first coronavirus patient traveled from Wuhan, China, to Italy in late January and was admitted to the hospital with coronavirus symptoms days later. A recently published report shows that she had detectable traces of the virus in her eyes days after …", "url": "https://www.washingtonpost.com/health/2020/04/24/researchers-found-coronavirus-patients-eyes-days-after-it-left-her-nose/", "urlToImage": null, "publishedAt": "2020-04-24T21:49:42Z", "content": "<ul><li>FILE - In this Wednesday, April 8, 2020 file photo, Doctor Giovanni Passeri, top left, with his assistant doctor Mariaconcetta Terracina, read the medical notes of 82-year-old patient Mario, during a routine examination part of a night shift in his wa… [+5823 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Sydney doctor Edward O’Neill in UK coronavirus vaccine trial - 7NEWS.com.au", "description": "Edward O'Neill believes taking part in a UK coronavirus vaccine trial is the right thing to do but admits he's taking a \"walk in faith\".", "url": "https://7news.com.au/lifestyle/health-wellbeing/aussie-to-walk-in-faith-in-vaccine-trial-c-998463", "urlToImage": null, "publishedAt": "2020-04-24T21:49:15Z", "content": "An Australian man who is testing a potential coronavirus vaccine in the UK says he is taking a walk in faith.\r\nDr Edward ONeill was one of the first two people injected as part of trials for a potential vaccine that has been developed by Oxford University.\r\nT… [+1441 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "", "title": "Coronavirus FAQs: Are There Lots Of Cases With No Symptoms? Can I See A Dentist? : Goats and Soda - NPR", "description": "We also discuss the phenomenon of symptom-free cases — how many are there, do we know how much of a role they play in spreading the virus?", "url": "https://www.npr.org/sections/goatsandsoda/2020/04/24/844325330/coronavirus-faqs-does-a-bigger-dose-make-you-sicker-can-you-go-to-the-dentist", "urlToImage": null, "publishedAt": "2020-04-24T21:32:39Z", "content": "Credit: Cristina Spano for NPR\r\nEach week we answer some of your pressing questions about the coronavirus and how to stay safe. Email us your questions at goatsandsoda@npr.org with the subject line: \"Weekly Coronavirus Questions.\" \r\nDoes the size of a viral d… [+7028 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Joseph Guzman", "title": "New report: Coronavirus lingers in patient's eyes days after it leaves nose | TheHill - The Hill", "description": "A new report is detailing how the coronavirus can exist in an infected person’s eye fluids at potentially contagious levels.", "url": "https://thehill.com/changing-america/well-being/prevention-cures/494586-coronavirus-found-in-patients-eyes-days-after-it", "urlToImage": null, "publishedAt": "2020-04-24T21:19:55Z", "content": "A recently published report is detailing how Italys first coronavirus patient had detectable traces of the virus in her eyes days after it had cleared from her nose, highlighting how the eyes could play a factor in the spread of COVID-19. \r\nThe patient, a 65-… [+2785 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Olivia Willis", "title": "When coronavirus patients suddenly decline, their own immune system might be to blame - ABC News", "description": "In some cases of COVID-19, it may be the body's response to the virus, rather than the virus itself, that ultimately causes harm.", "url": "https://www.abc.net.au/news/health/2020-04-25/coronavirus-covid-immune-response-causes-harm/12176872", "urlToImage": null, "publishedAt": "2020-04-24T20:30:29Z", "content": "It's been described as the \"second week crash\".\r\nAbout seven days after developing symptoms of COVID-19, some people even those with mild symptoms can suddenly start to deteriorate, often with little warning.\r\n\"They end up getting admitted to hospital, and ab… [+6217 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Nazia Parveen", "title": "New mother dies of coronavirus six days after giving birth - The Guardian", "description": "Fozia Hanif developed symptoms before her 29th birthday, resulting in premature birth of her son, Ayaan", "url": "https://www.theguardian.com/world/2020/apr/24/new-mother-dies-of-coronavirus-six-days-after-giving-birth", "urlToImage": null, "publishedAt": "2020-04-24T19:31:43Z", "content": null}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Chris Smith", "title": "The most unusual coronavirus symptom is also the most dangerous - BGR", "description": "The newest observed coronavirus symptom is also the most dangerous one and can appear in patients who don’t even experience other symptoms. Doctors have noticed an increase in strokes caused by blood clots in young adults, who might be reluctant to seek medic…", "url": "https://bgr.com/2020/04/24/coronavirus-symptoms-stroke-after-blood-clots-in-young-patients/", "urlToImage": null, "publishedAt": "2020-04-24T14:02:10Z", "content": "<ul><li>The newest observed coronavirus symptom is also the most dangerous one and can appear in patients who don’t even experience other symptoms.</li><li>Doctors have noticed an increase in strokes caused by blood clots in young adults, who might be relucta… [+3622 chars]"}, {"source": {"id": null, "name": "Pressenza.com"}, "author": "https://www.facebook.com/ConversationUK", "title": "Coronavirus: are we underestimating how many people have had it? Sweden thinks so - Pressenza", "description": "Many countries around the world are now facing the difficult decision of when and how to ease lockdown restrictions due to the novel coronavirus. In the", "url": "https://www.pressenza.com/2020/04/coronavirus-are-we-underestimating-how-many-people-have-had-it-sweden-thinks-so/", "urlToImage": null, "publishedAt": "2020-04-24T13:09:10Z", "content": "Many countries around the world are now facing the difficult decision of when and how to ease lockdown restrictions due to the novel coronavirus. In the absence of a vaccine, it is likely there will be new waves of the epidemic, unless enough people have been… [+6968 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Aussies should brace for rolling lockdowns in years ahead - Big Rigs", "description": "Australia is preparing to cautiously lift the first virus restrictions next week – but a return to “normal” could still be years away.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-aussies-should-brace-for-rolling-lockdowns-in-years-ahead/news-story/8847b0e8f896994785239983a0e91880", "urlToImage": null, "publishedAt": "2020-04-24T11:15:08Z", "content": "ANALYSIS\r\nBrace yourselves: We're going to need more lockdowns to get on top of COVID-19.\r\nEconomists used to dream of exponential growth in relation to the economy. But that same explosive effect seems set to doom us to rolling lockdowns for years to come.\r\n… [+5660 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Kelly-Ann Mills", "title": "Doctor shares video of son, 4, struggling to breathe in hospital with coronavirus - Mirror Online", "description": "Dr Anna Zimmerman's son Lincoln told his mum 'this isn't worth it' as he was battling to breath and being given 9L of oxygen in just one day", "url": "https://www.mirror.co.uk/news/us-news/doctor-shares-video-son-4-21919944", "urlToImage": null, "publishedAt": "2020-04-24T11:07:54Z", "content": "A doctor has shared a powerful video of her four-year-old son struggling to breathe as he battled with coronavirus in hospital. \r\nNeonatal specialist Dr Anna Zimmerman's son Lincoln even told her \"this isn't worth it\" and said \"Mama, I'm not gonna go home\" as… [+2497 chars]"}, {"source": {"id": null, "name": "Bendigoadvertiser.com.au"}, "author": "Natalie Croxon", "title": "Hospital first to use new telehealth platform for COVID-19 patients - Bendigo Advertiser", "description": "The new system allows health practitioners to monitor patients' conditions from afar.", "url": "https://www.bendigoadvertiser.com.au/story/6734213/hospital-first-to-use-new-telehealth-platform-for-covid-19-patients/", "urlToImage": null, "publishedAt": "2020-04-24T08:00:00Z", "content": ""}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Melissa Cunningham", "title": "'Things can change quickly': Complacency warning as infections drop - The Age", "description": "As Victoria's rate of coronavirus infection falls again, Chief Health Officer warns second wave of cases could happen anytime if social distancing is relaxed.", "url": "https://www.theage.com.au/national/victoria/things-can-change-quickly-complacency-warning-as-infections-drop-20200424-p54mzh.html", "urlToImage": null, "publishedAt": "2020-04-24T07:24:37Z", "content": "There were no new community transmission infections in Victoria as of Friday morning, with the number of those cases stable at 135.\r\nTwenty-seven people remain in hospital, including 11 people in intensive care.\r\nAsked if Victoria's tally might continue to tr… [+1892 chars]"}, {"source": {"id": null, "name": "Chinadaily.com.cn"}, "author": "于小明", "title": "No evidence suggests people with COVID-19 antibodies protected from secondary infection: WHO - 中国日报", "description": "There is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection, the World Health Organization (WHO) said in a daily situation report on Saturday.", "url": "https://global.chinadaily.com.cn/a/202004/26/WS5ea4c1fba310a8b24115196a.html", "urlToImage": null, "publishedAt": "2020-04-24T07:00:00Z", "content": "A logo is pictured on the headquarters of the World Health Organization ahead of a meeting of the Emergency Committee on the novel coronavirus in Geneva, Switzerland, Jan 30, 2020. [Photo/Agencies] \r\nGENEVA -- There is currently no evidence that people who ha… [+1393 chars]"}, {"source": {"id": null, "name": "Racgp.org.au"}, "author": null, "title": "Major new campaign encourages patients to see their GP - RACGP", "description": null, "url": "https://www1.racgp.org.au/newsgp/racgp/major-new-campaign-encourages-patients-to-see-thei", "urlToImage": null, "publishedAt": "2020-04-24T07:00:00Z", "content": "News\r\nLook after your health – keep seeing your GP. That’s the message of a new RACGP campaign.\r\nThe nationwide campaign calls on Australians to look after their health during lockdown. \r\nAustralians have taken the responsibility to stay at home very seriousl… [+6745 chars]"}, {"source": {"id": null, "name": "Denipt.com.au"}, "author": null, "title": "Install virus app to aid health carers: PM - Deniliquin Pastoral Times", "description": "", "url": "https://www.denipt.com.au/national/2020/04/24/1143612/install-virus-app-to-aid-health-carers-pm", "urlToImage": null, "publishedAt": "2020-04-24T06:46:30Z", "content": "Scott Morrison has conceded the government might not meet its goal for Australians downloading its coronavirus surveillance software.The prime minister says the app will be released imminently and is urging everyone to support the national efforts to suppress… [+2442 chars]"}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": "Simon Bourke", "title": "Lifeline picks up the phone in an age of loneliness as more than ever before call - Great Lakes Advocate", "description": "\"There are people out there, and the call they make to Lifeline is the only conversation they have all week.\"", "url": "https://www.canberratimes.com.au/story/6734221/covid-19-sparks-highest-ever-demand-for-lifeline-help/", "urlToImage": null, "publishedAt": "2020-04-24T06:30:00Z", "content": ""}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Scientists uncover evidence coronavirus could trigger diabetes in healthy adults - SBS News", "description": "A new study involving Australian researchers has found there is evidence COVID-19 could be causing diabetes in otherwise healthy adults.", "url": "https://www.sbs.com.au/news/scientists-uncover-evidence-coronavirus-could-trigger-diabetes-in-healthy-adults", "urlToImage": null, "publishedAt": "2020-04-24T06:10:00Z", "content": "Coronavirus may be triggering diabetes in typically healthy adults.\r\nElderly Australians with diabetes are also at an increased risk from coronavirus, a study released on Friday shows.\r\nCo-author and Monash University professor Paul Zimmet said diabetic child… [+2582 chars]"}, {"source": {"id": null, "name": "Voanews.com"}, "author": null, "title": "Britain Starts Testing Vaccine for Coronavirus on Humans - Malaysia Sun", "description": "WASHINGTON - Britain has performed the first human trial of a coronavirus vaccine in Europe.&nbsp;  Two volunteers were injected T", "url": "https://www.voanews.com/covid-19-pandemic/britain-starts-testing-vaccine-coronavirus-humans", "urlToImage": null, "publishedAt": "2020-04-24T06:05:00Z", "content": "WASHINGTON - Britain has performed the first human trial of a coronavirus vaccine in Europe.\r\nTwo volunteers were injected Thursday in the city of Oxford, where a university team developed the vaccine in less than three months. Hundreds of other volunteers wi… [+3915 chars]"}, {"source": {"id": null, "name": "Weeklytimesnow.com.au"}, "author": null, "title": "Steps to combat cattle pneumonia - The Weekly Times", "description": "CATTLE restockers are being urged to consider introducing stress mitigation measures in their enterprises to help combat a rise in pneumonia-related cattle deaths in the New South Wales central west.", "url": "https://www.weeklytimesnow.com.au/news/rural-weekly/steps-to-combat-cattle-pneumonia/news-story/2180677fcd8b3348012b7cc3cf3bcd10", "urlToImage": null, "publishedAt": "2020-04-24T06:03:00Z", "content": "CATTLE restockers are being urged to consider introducing stress mitigation measures in their enterprises to help combat a rise in pneumonia-related cattle deaths in the New South Wales central west. \r\nBovine Respiratory Disease is the most common disease in … [+1931 chars]"}, {"source": {"id": null, "name": "Armidaleexpress.com.au"}, "author": "Newsroom", "title": "Coronavirus pandemic: Armidale Hospital opening COVID-19 testing blitz - Armidale Express", "description": "Armidale Hospital opening COVID-19 testing blitz", "url": "https://www.armidaleexpress.com.au/story/6734597/why-covid-19-testing-blitz-is-coming-to-armidale/", "urlToImage": null, "publishedAt": "2020-04-24T05:30:00Z", "content": ""}, {"source": {"id": null, "name": "Armidaleexpress.com.au"}, "author": "Michael Ramsey", "title": "Artania passenger dies of virus in WA - Armidale Express", "description": "A fourth person from the now-departed Artania cruise ship has died of coronavirus in Western Australia, taking the state's toll to eight. Health Minister Roge...", "url": "https://www.armidaleexpress.com.au/story/6733620/artania-passenger-dies-of-virus-in-wa/?cs=7", "urlToImage": null, "publishedAt": "2020-04-24T05:16:34Z", "content": ""}, {"source": {"id": null, "name": "Goldcoastbulletin.com.au"}, "author": "Sue Dunlevy and Brianna Morris-Grant", "title": "Why we're unlikely to be shaking hands 'anytime soon' - Chinchilla News", "description": "THE family dinner could be one of the first social gatherings allowed as we come out of the COVID-19 lockdown.", "url": "https://www.goldcoastbulletin.com.au/coronavirus/gold-coast-warned-against-breaching-social-distancing-laws-as-coronavirus-cases-drop/news-story/fb52d6aba701c1c79700f6d9380a3da0", "urlToImage": null, "publishedAt": "2020-04-24T04:43:00Z", "content": "THE family dinner could be one of the first social gatherings allowed as we come out of the COVID-19 lockdown.\r\nEpidemiologists advising the Federal Government said the best approach to ending the lockdown may be lifting one restriction at a time - like allow… [+5103 chars]"}]}