{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Coronavirus Australia: COVID-19 in NSW schools under the microscope in new study - 7NEWS.com.au", "description": "The study cited by the federal government has looked at the risk of coronavirus clusters in schools.", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-australia-covid-19-in-nsw-schools-under-the-microscope-in-new-study-c-999423", "urlToImage": null, "publishedAt": "2020-04-25T23:27:52Z", "content": "There is no evidence students at NSW schools have infected staff with COVID-19, according to a study cited by the federal government in its push to reopen schools.\r\nThe National Centre for Immunisation Research and Surveillance probe looked at all 18 cases of… [+616 chars]"}, {"source": {"id": null, "name": "Bombalatimes.com.au"}, "author": "Darren Cartwright", "title": "Independent schools want to reopen in Qld - Bombala Times", "description": "Queensland's independent schools have called on the Palaszczuk government to allow all Year 11 and 12 students to return to school immediately. Independent Sc...", "url": "https://www.bombalatimes.com.au/story/6735369/independent-schools-want-to-reopen-in-qld/?cs=7", "urlToImage": null, "publishedAt": "2020-04-25T23:26:38Z", "content": "Queensland's independent schools have called on the Palaszczuk government to allow all Year 11 and 12 students to return to school immediately.\r\nIndependent Schools Queensland (ISQ) want Year 11 and 12 students to return amid COVID-19 restrictions so they're … [+2272 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: The latest COVID-19 news on Sunday, April 26 (Sunrise edition) | 7NEWS - 7NEWS Australia", "description": "Government launches virus tracking app, 150 Aussies flying home on mercy flight from South America and heat becomes the new battlefield in the United States....", "url": "https://www.youtube.com/watch?v=pu2YnvRL27o", "urlToImage": null, "publishedAt": "2020-04-25T23:14:40Z", "content": "Government launches virus tracking app, 150 Aussies flying home on mercy flight from South America and heat becomes the new battlefield in the United States.\r\nSubscribe to 7NEWS for the latest video » https://7news.link/YTSubscribe\r\nConnect with 7NEWS onlineV… [+213 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Alex Turner-Cohen", "title": "Coronavirus: Six-month-old baby from Manchester beats COVID-19, parents overjoyed - NEWS.com.au", "description": "Coronavirus: Six-month-old baby from Manchester beats COVID-19, parents overjoyed", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-sixmonthold-baby-from-manchester-beats-covid19-parents-overjoyed/news-story/dd23c0c28d8689c2497724fdb6291258", "urlToImage": null, "publishedAt": "2020-04-25T23:05:20Z", "content": "Already severely underweight and with other medical complications, doctors thought this six-month-old baby was done for when she contracted COVID-19. But Erin Bates pulled through and has become a symbol of hope for others.\r\nThe baby from Manchester, England,… [+3668 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "CNN", "title": "WHO warn people who have had coronavirus not necessarily immune - 7NEWS.com.au", "description": "It has issued a warning to governments that are considering issuing “immunity passports” to people who have had COVID-19.", "url": "https://7news.com.au/lifestyle/health-wellbeing/who-warn-people-who-have-had-coronavirus-not-necessarily-immune-c-999511", "urlToImage": null, "publishedAt": "2020-04-25T22:49:12Z", "content": "The World Health Organization is warning that people who have had COVID-19 are not necessarily immune by the presence of antibodies from getting the virus again.\r\nThere is no evidence yet that people who have had COVID-19 will not get a second infection, WHO … [+1765 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Summer Woolley", "title": "Coronavirus update: Six-month-old baby with heart condition survives COVID-19 - 7NEWS.com.au", "description": "The baby received a standing ovation from hospital staff but just weeks prior, her parents Emma and Wayne had been told they were going to lose her.", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-update-six-month-old-baby-with-heart-condition-survives-covid-19-c-999490", "urlToImage": null, "publishedAt": "2020-04-25T22:33:50Z", "content": "A six-month-old baby who fought through a rare heart defect, a respiratory illness and collapsed lungs has now survived COVID-19.\r\nThe baby from Manchester, England, received a standing ovation from NHS staff as she was escorted through the hospital.\r\nJust we… [+3155 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "It's Possible to Catch Covid-19 Twice, Says the WHO - QuickTake by Bloomberg", "description": "The World Health Organization says just because you caught coronavirus once, doesn't mean you can't catch it again. Here's what you should know about why iss...", "url": "https://www.youtube.com/watch?v=7xtKvPDP-MI", "urlToImage": null, "publishedAt": "2020-04-25T22:01:37Z", "content": "The World Health Organization says just because you caught coronavirus once, doesn't mean you can't catch it again.\r\nHere's what you should know about why issuing 'immunity passports' based on antibody tests may be a flawed plan.\r\nSubscribe to our YouTube cha… [+446 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "UK doctor invents digital flashcards to help Covid-19 patients understand staff - The Guardian", "description": "Cardmedic overcomes communication barrier caused by healthcare staff wearing PPE", "url": "https://www.theguardian.com/world/2020/apr/25/uk-doctor-invents-digital-flashcards-to-help-covid-19-patients-understand-staff", "urlToImage": null, "publishedAt": "2020-04-25T21:50:36Z", "content": "A coronavirus patients terrifying hospital experience inspired an NHS doctor to create a flashcard system to improve communication with medical staff wearing face masks.\r\nAnaesthetist Rachael Grimaldi founded Cardmedic while on maternity leave after reading a… [+2712 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Mehr Gill", "title": "Explained: Types of human coronaviruses and the symptoms they cause - The Indian Express", "description": "While there are hundreds of coronaviruses, there are seven that we know can infect humans.", "url": "https://indianexpress.com/article/explained/types-of-human-coronaviruses-and-symptoms-6368444/", "urlToImage": null, "publishedAt": "2020-04-25T19:50:19Z", "content": "Written by Mehr Gill\r\n | New Delhi | \r\nUpdated: April 25, 2020 6:09:09 pm\r\nHuman coronaviruses were first characterised in the mid-1960s and they are mostly considered to be responsible for causing upper respiratory tract infections in children. (AP illustrat… [+6888 chars]"}, {"source": {"id": null, "name": "Illawarramercury.com.au"}, "author": null, "title": "Global coronavirus death toll hits 200000 - Illawarra Mercury", "description": "As the global death toll from the coronavirus surpassed 200,000 on Saturday, countries took cautious steps toward easing lockdowns imposed amid the pandemic,...", "url": "https://www.illawarramercury.com.au/story/6735340/global-coronavirus-death-toll-hits-200000/?cs=298", "urlToImage": null, "publishedAt": "2020-04-25T19:09:56Z", "content": ""}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Michael Fowler", "title": "Families and doctors blast 'lack of transparency' over COVID-19 outbreak - The Age", "description": "Insiders are outraged over how the cluster linked to a private psychiatric clinic in Melbourne was handled.", "url": "https://www.theage.com.au/national/victoria/families-and-doctors-blast-lack-of-transparency-over-covid-19-outbreak-20200425-p54n77.html", "urlToImage": null, "publishedAt": "2020-04-25T18:51:01Z", "content": "Her psychiatrist told her about the outbreak on Thursday, rather than the clinic or health department, when he received a blanket email from Victoria's Chief Psychiatrist.\r\nMy mum explicitly asked before she went in on Tuesday, have there been any coronavirus… [+3046 chars]"}, {"source": {"id": null, "name": "Heraldsun.com.au"}, "author": "Nathan Vass in New York, Staff writers, AP, Reuters", "title": "Coronavirus updates: UK’s grim milestone as ‘immunity passports’ slammed by WHO - Herald Sun", "description": "The world’s coronavirus death toll passed 200,000 early this morning Australian time as the number of infections approached three million.", "url": "https://www.heraldsun.com.au/coronavirus/coronavirus-updates-uks-grim-milestone-prediction-as-immunity-passports-slammed-by-who/news-story/004c23014e5a3f38760ca5bb34088e17", "urlToImage": null, "publishedAt": "2020-04-25T17:58:18Z", "content": "<ul><li>Global virus death toll passes 200,000</li><li>Britain hits grim new milestone</li><li>Americans flock to beaches in heat wave</li><li>WHO warns against immunity passports</li></ul>The worlds coronavirus death toll passed 200,000 early this morning Au… [+22497 chars]"}, {"source": {"id": null, "name": "Crookwellgazette.com.au"}, "author": null, "title": "French daily virus deaths drop below 200 - Crookwell Gazette", "description": "The daily death toll of COVID-19 patients in French hospitals has dropped to 198, according to figures provided by the health ministry. The figures released o...", "url": "https://www.crookwellgazette.com.au/story/6735334/french-daily-virus-deaths-drop-below-200/?cs=5461", "urlToImage": null, "publishedAt": "2020-04-25T17:52:40Z", "content": "The daily death toll of COVID-19 patients in French hospitals has dropped to 198, according to figures provided by the health ministry.\r\nThe figures released on Saturday appear to confirm that the epidemic is lessening in France, although caution is required,… [+1363 chars]"}, {"source": {"id": null, "name": "Greatlakesadvocate.com.au"}, "author": null, "title": "Contact checks on WA's latest virus case - Great Lakes Advocate", "description": "Contact tracing is under way after yet another coronavirus case in Western Australia linked to a cruise ship. Health authorities confirmed on Saturday that a...", "url": "https://www.greatlakesadvocate.com.au/story/6735328/contact-checks-on-was-latest-virus-case/?cs=9397", "urlToImage": null, "publishedAt": "2020-04-25T17:30:39Z", "content": ""}, {"source": {"id": null, "name": "Thecourier.com.au"}, "author": "Tim Dornin", "title": "SA near end of coronavirus testing blitz - Ballarat Courier", "description": "South Australia has recorded no new cases of the coronavirus on six of the past eight days as it continues with a two-week testing blitz to flush out infectio...", "url": "https://www.thecourier.com.au/story/6735327/sa-near-end-of-coronavirus-testing-blitz/", "urlToImage": null, "publishedAt": "2020-04-25T17:30:09Z", "content": ""}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "World Malaria Day: Governments urged to prevent rise in deaths - Al Jazeera English", "description": "On World Malaria Day, health officials are warning governments to move fast to prevent a rise in Malaria-related deaths. In Kenya, thousands of people have l...", "url": "https://www.youtube.com/watch?v=64nKBK4kq_w", "urlToImage": null, "publishedAt": "2020-04-25T15:59:04Z", "content": "On World Malaria Day, health officials are warning governments to move fast to prevent a rise in Malaria-related deaths.In Kenya, thousands of people have lost their homes after seasonal torrential rains destroyed them. Now, mosquitos are thriving in the wet … [+340 chars]"}, {"source": {"id": null, "name": "France24.com"}, "author": "France 24", "title": "WHO warns over virus immunity as global death toll nears 200,000 - FRANCE 24", "description": "", "url": "https://www.france24.com/en/20200425-who-warns-over-virus-immunity-as-global-death-toll-nears-200-000", "urlToImage": null, "publishedAt": "2020-04-25T14:42:00Z", "content": "Geneva (AFP)\r\nThe World Health Organization warned on Saturday recovering from coronavirus may not protect people from reinfection as the death toll from the pandemic approached 200,000 around the globe.\r\nGovernments across the world are struggling to limit t… [+6407 chars]"}, {"source": {"id": null, "name": "Thedailystar.net"}, "author": null, "title": "‘No evidence’ people with coronavirus are immunised: WHO - The Daily Star", "description": "The World Health Organization (WHO) warns that there is no evidence that people who test positive for the new coronavirus are immunised and protected against reinfection.", "url": "https://www.thedailystar.net/coronavirus-deadly-new-threat/news/no-evidence-people-coronavirus-are-immunised-who-1896688", "urlToImage": null, "publishedAt": "2020-04-25T14:21:40Z", "content": "The World Health Organization (WHO) warned on Saturday that there is no evidence that people who test positive for the new coronavirus are immunised and protected against reinfection.\r\nThe warning suggests that the issuance of \"immune passports\" may promote t… [+2068 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": "Caitlin Fitzsimmons, Laura Chung", "title": "Virus cluster hits Blue Mountains as state government announces economic stimulus - Sydney Morning Herald", "description": "A localised outbreak of COVID-19 has hit the Blue Mountains west of Sydney, as the state recorded 12 new cases.", "url": "https://www.smh.com.au/lifestyle/health-and-wellness/virus-cluster-hits-blue-mountains-as-state-government-announces-economic-stimulus-20200425-p54n76.html", "urlToImage": null, "publishedAt": "2020-04-25T14:03:30Z", "content": "Treasurer Dominic Perrottet said: \"Our state's 128 local councils are a critical part of the NSW economy, especially in many regional and rural towns where they are sometimes the largest employer.\"\r\nNSW has confirmed 2994 cases of COVID-19, including 2193 peo… [+1973 chars]"}, {"source": {"id": null, "name": "Sahiwal.tv"}, "author": "Jeremy Spirogis", "title": "WHO has & # 039; immune passport & # 039; Or & # 039; risk-free certificates & # 039; Warned in opposition to the concept of - Sahiwal Tv", "description": "Berlin: The World Health Organization is warning in opposition to the concept of ​​an \"immune passport\". It states that there’s at the moment no proof that individuals who have recovered…", "url": "https://sahiwal.tv/who-has-039-immune-passport-039-or-039-risk-free-certificate-039-warned-against-the-idea-of-%e2%80%8b%e2%80%8b-2/", "urlToImage": null, "publishedAt": "2020-04-25T13:48:00Z", "content": "Berlin: The World Health Organization is warning in opposition to the concept of an \"immune passport\". It states that there’s at the moment no proof that individuals who have recovered from COVID-19 and have antibodies are shielded from one other an infection… [+907 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "WHO says no evidence recovered COVID-19 patients are immune to reinfection - The Times of Israel", "description": "UN health agency warns against notion of 'immunity passports,' saying they could risk further transmission of the coronavirus", "url": "https://www.timesofisrael.com/who-says-no-evidence-recovered-covid-19-patients-immune-to-reinfection/", "urlToImage": null, "publishedAt": "2020-04-25T12:54:26Z", "content": "The World Health Organization on Saturday said there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection, cautioning against the idea of immunity passports.\r\nThe concept of immunit… [+4204 chars]"}, {"source": {"id": null, "name": "Thenewdaily.com.au"}, "author": null, "title": "Coronavirus vaccine: Dr Peter Doherty tells us how likely it is we’ll get one - The New Daily", "description": "This week, in a wide-ranging interview with The New Daily, Professor Peter Doherty, Nobel Laureate and immunologist, talked about the likelihood of a vaccine for COVID-19 being developed, and what happens if we don't get one.", "url": "https://thenewdaily.com.au/life/wellbeing/2020/04/25/coronavirus-vaccine-peter-doherty/", "urlToImage": null, "publishedAt": "2020-04-25T12:18:21Z", "content": "This week, in a wide-ranging interview with The New Daily, Professor Peter Doherty, Nobel Laureate and immunologist, talked about the likelihood of a vaccine for COVID-19 being developed, and what happens if we don’t get one.\r\nThe short answer is that COVID-1… [+3849 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Lauren McMah", "title": "Coronavirus: Antibodies tests could restart countries but also have dangers - NEWS.com.au", "description": "Coronavirus: Antibodies tests could restart countries but also have dangers", "url": "https://www.news.com.au/travel/travel-updates/health-safety/coronavirus-antibodies-tests-could-restart-countries-but-also-have-dangers/news-story/77beebb098069c539997a0648312cbab", "urlToImage": null, "publishedAt": "2020-04-25T12:06:42Z", "content": "As a world besieged by COVID-19 waits in hope for a vaccine that may or may not come, antibody tests could be the next best thing. The finger prick tests with rapid results, which are already being used in some populations, can detect people who have already … [+5427 chars]"}, {"source": {"id": null, "name": "Bnnbloomberg.ca"}, "author": "Bloomberg News", "title": "WHO warns you may catch COVID-19 more than once - BNNBloomberg.ca", "description": "Catching Covid-19 once may not protect you from getting it again, according to the World Health Organization.", "url": "http://www.bnnbloomberg.ca/who-says-you-may-catch-coronavirus-more-than-once-1.1426851", "urlToImage": null, "publishedAt": "2020-04-25T12:00:02Z", "content": "Catching COVID-19 once may not protect you from getting it again, according to the World Health Organization, a finding that could jeopardize efforts to allow people to return to work after recovering from the virus.\r\nThere is currently no evidence that peopl… [+2099 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "DOH: More than 72000 lab tests conducted for COVID-19 in PH - INQUIRER.net", "description": "More than 72,000 laboratory tests were conducted for checking novel coronavirus or SARS-CoV-2, which causes COVID-19, in the country, the Department of Healt...", "url": "https://www.youtube.com/watch?v=fB_ScQAcFZs", "urlToImage": null, "publishedAt": "2020-04-25T11:58:23Z", "content": "More than 72,000 laboratory tests were conducted for checking novel coronavirus or SARS-CoV-2, which causes COVID-19, in the country, the Department of Health (DOH) said Saturday. Video by PTV\r\nVisit us at https://www.inquirer.netFacebook: https://facebook.co… [+58 chars]"}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "The Irish Times", "title": "Coronavirus: No evidence that recovered patients are immune, says WHO - The Irish Times", "description": "Health agency warns governments against issuing ‘immunity passports’", "url": "https://www.irishtimes.com/news/world/coronavirus-no-evidence-that-recovered-patients-are-immune-says-who-1.4238216", "urlToImage": null, "publishedAt": "2020-04-25T11:30:48Z", "content": "The World Health Organisation (WHO) said on Saturday that there was currently no evidence that people who have recovered from coronavirus and have antibodies are protected from a second coronavirus infection.\r\nIn a scientific brief, the United Nations agency … [+1685 chars]"}, {"source": {"id": null, "name": "Tribuneindia.com"}, "author": "Tribune India", "title": "Can you catch Covid-19 twice? WHO answers to it - The Tribune India", "description": "", "url": "https://www.tribuneindia.com/news/health/can-you-catch-covid-19-twice-who-answers-to-it-76173", "urlToImage": null, "publishedAt": "2020-04-25T11:26:13Z", "content": "Geneva, April 25\r\nThe World Health Organisation (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nIn a scientific brief, the Unite… [+1678 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Reuters", "title": "'No evidence' yet that recovered COVID-19 patients cannot be reinfected - WHO - Deccan Herald", "description": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection. Track live updates on coronavirus here", "url": "https://www.deccanherald.com/international/no-evidence-yet-that-recovered-covid-19-patients-cannot-be-reinfected-who-829770.html", "urlToImage": null, "publishedAt": "2020-04-25T10:58:06Z", "content": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nTrack live updates on coronavirus here\r\nIn a state… [+494 chars]"}, {"source": {"id": null, "name": "Khaleejtimes.com"}, "author": "Reuters", "title": "'No evidence' that recovered Covid-19 patients cannot be reinfected: WHO - Khaleej Times", "description": "The World Health Organization (WHO) said on Saturday that there was currently no evidence that people who have recovered from COVID-19 and...", "url": "https://www.khaleejtimes.com/coronavirus-pandemic/no-evidence-that-recovered-covid-19-patients-cannot-be-reinfected-who", "urlToImage": null, "publishedAt": "2020-04-25T10:40:51Z", "content": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection\r\nIn a scientific brief, the United Nations agency wa… [+1649 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: Another Sydney nursing home COVID-19 outbreak | Nine News Australia - 9 News Australia", "description": "A nursing home in Sydney’s Blue Mountains has become the latest COVID-19 nursing home outbreak, with a worker testing positive. Subscribe: https://bit.ly/2no...", "url": "https://www.youtube.com/watch?v=fd2C2IfdUbA", "urlToImage": null, "publishedAt": "2020-04-25T10:07:00Z", "content": null}, {"source": {"id": null, "name": "Macarthuradvertiser.com.au"}, "author": "Gus McCubbing", "title": "Sixth virus death at NSW age care facility - Campbelltown Macarthur Advertiser", "description": "An 83-year-old man has died from COVID-19 at an aged care facility in western Sydney, taking the state's virus toll to 36. The man was a resident at Anglicare...", "url": "https://www.macarthuradvertiser.com.au/story/6734966/sixth-virus-death-at-nsw-age-care-facility/", "urlToImage": null, "publishedAt": "2020-04-25T09:51:00Z", "content": "An 83-year-old man has died from COVID-19 at an aged care facility in western Sydney, taking the state's virus toll to 36.\r\nThe man was a resident at Anglicare Newmarch House in Cadden and is the sixth death at the facility.\r\nThe facility is the state's large… [+2026 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Baby makes 'miracle' recovery to beat virus - Northern Star", "description": "Doctors held grave fears for this six-month old-baby when she contracted COVID-19, but she pulled through against all odds and has become a symbol of hope.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-sixmonthold-baby-from-manchester-beats-covid19-parents-overjoyed/news-story/dd23c0c28d8689c2497724fdb6291258", "urlToImage": null, "publishedAt": "2020-04-25T09:49:00Z", "content": "Already severely underweight and with other medical complications, doctors thought this six-month-old baby was done for when she contracted COVID-19.\r\nBut Erin Bates pulled through and has become a symbol of hope for others.\r\nThe baby from Manchester, England… [+3615 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": null, "title": "Coronavirus: WHO warns against idea of Covid-19 'immunity passports' - Stuff.co.nz", "description": "There is no evidence that people who have recovered from Covid-19 and have antibodies are protected against a second infection.", "url": "https://i.stuff.co.nz/national/health/coronavirus/121100571/coronavirus-who-warns-against-idea-of-covid19-immunity-passports", "urlToImage": null, "publishedAt": "2020-04-25T09:08:00Z", "content": "The World Health Organisation is cautioning against the idea of \"immunity passports.\" It says there is currently no evidence that people who have recovered from Covid-19 and have antibodies are protected against a second infection.\r\n The concept of \"immunity … [+1018 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/peta-fuller/11746470", "title": "Sentinel testing will be part of the strategy before Australia's coronavirus restrictions are potentially eased - ABC News", "description": "Australians are seeing more days with low (or even no) new coronavirus cases in their state. But alone, that's not enough to see restrictions ease. Can more testing help?", "url": "https://www.abc.net.au/news/2020-04-25/coronavirus-sentinel-testing-surveillance-testing-covid-19/12180274", "urlToImage": null, "publishedAt": "2020-04-25T07:58:12Z", "content": "Updated \r\nApril 25, 2020 17:10:08\r\nThere's a new testing buzzword in Australia and it might sound slightly ominous sentinel surveillance or sentinel testing.\r\nAs our COVID-19 case rates slow, it's part of the next step to staying on top of infection rates in … [+5412 chars]"}, {"source": {"id": null, "name": "Ballinaadvocate.com.au"}, "author": "", "title": "Nicotine patches 'may prevent virus' - Ballina Shire Advocate", "description": "Despite repeated warnings that smokers have a higher risk of severe cases one European country is hoping to trial nicotine patches on healthcare workers.", "url": "https://www.ballinaadvocate.com.au/news/nicotine-patches-may-prevent-virus/4002631/", "urlToImage": null, "publishedAt": "2020-04-25T07:23:36Z", "content": "France is hoping to trial nicotine patches on healthcare workers after a study suggested that smokers may have a lesser chance of catching coronavirus.\r\nThe surprising findings come despite health officials around the world repeatedly warning that smokers who… [+2894 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "James Rodger", "title": "Government were 'warned to prepare for impending pandemic last year' - Birmingham Live", "description": "The National Security Risk Assessment (NSRA) - running to more than 600 pages - highlighted the devastating social and economic costs of a major disease outbreak", "url": "https://www.birminghammail.co.uk/news/midlands-news/government-were-warned-prepare-impending-18148465", "urlToImage": null, "publishedAt": "2020-04-25T06:34:57Z", "content": "Ministers were warned last year that the Government needed robust plans in place to deal with a potential pandemic virus, according to a leaked Cabinet Office briefing.\r\nThe National Security Risk Assessment (NSRA) - running to more than 600 pages - highlight… [+2462 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "Success against malaria gives solutions for COVID-19 - The Jakarta Post - Jakarta Post", "description": "Today is World Malaria Day, a day when we remind ourselves of a disease that has killed more people in history than any other.", "url": "https://www.thejakartapost.com/academia/2020/04/25/success-against-malaria-gives-solutions-for-covid-19.html", "urlToImage": null, "publishedAt": "2020-04-25T04:56:00Z", "content": "Today is World Malaria Day, a day when we remind ourselves of a disease that has killed more people in history than any other.\r\nAs the world is focused on bringing the deadly COVID-19 pandemic under control, reflecting on the progress made in the fight agains… [+4107 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": "Jane Hansen", "title": "Risky business: 100 jobs most at risk of COVID-19 - Morning Bulletin", "description": "They are the 100 occupations most at risk of contracting COVID-19. And while some are obvious given their exposure to people, others far less so.", "url": "https://www.dailytelegraph.com.au/coronavirus/dentists-doctors-registered-nurses-most-at-risk-of-catching-covid19/news-story/880ffd1dc28abcf3c5b26fe6e16d773f", "urlToImage": null, "publishedAt": "2020-04-25T03:18:00Z", "content": "While doctors and nurses are the heroes on the front line, risking greater exposure to coronavirus, many other occupations also have risk and analysts have crunched the data into an occupation risk score.\r\nThe US-based Occupation Information Network has found… [+4558 chars]"}, {"source": {"id": null, "name": "Kidspot.com.au"}, "author": "Vanessa Stubbs", "title": "Nurses in tears as baby wins her coronavirus fight - Kidspot", "description": "Little Erin Bates has become a symbol of hope.", "url": "https://www.kidspot.com.au/news/nurses-in-tears-as-baby-wins-her-coronavirus-fight/news-story/7a317269d080a6ff81536cc368444940", "urlToImage": null, "publishedAt": "2020-04-25T03:07:00Z", "content": "Little Erin Bates has become a symbol of hope.Nurses formed a guard of honour and clapped as six-month-old baby Erin was wheeled out of isolation.\r\nThe baby girl was being treated at Alder Hey Children's Hospital in Liverpool in the UK, where she battled COVI… [+1996 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Candace Sutton", "title": "COVID-19 kills in 'brain to toe rampage' - Ipswich Advertiser", "description": "How COVID-19 kills in ‘ferocious rampage from brain to toes’", "url": "https://www.news.com.au/world/coronavirus/health/how-covid19-kills-in-ferocious-rampage-from-brain-to-toes/news-story/76f8edff42d1302b2c9acc8211547ea6", "urlToImage": null, "publishedAt": "2020-04-25T02:28:00Z", "content": "COVID-19 kills in a ferocious rampage through the body from brain to toes doctors have explained, saying the virus acts like no pathogen humanity has ever seen.In an article in sciencemag.org, frontline clinicians caring for the five per cent who become criti… [+7241 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": null, "title": "Coronavirus: Five new cases, one death, as recoveries surge to 77 per cent - Stuff.co.nz", "description": "About 77 per cent of all New Zealand's Covid-19 cases have recovered.", "url": "https://i.stuff.co.nz/national/health/coronavirus/121269987/coronavirus-ministry-of-health-covid19-update", "urlToImage": null, "publishedAt": "2020-04-25T02:15:00Z", "content": "There are five new coronavirus cases in New Zealand, according to the Ministry of Health.\r\n One other person, a woman in her 70s, has also died, bringing the country's Covid-19 death toll to 18. \r\n New Zealand's recovery rate continues to increase with about … [+2927 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Anastasia Santoreneos", "title": "'Inexplicable': Govt's coronavirus app sends data to Amazon - Yahoo Finance Australia", "description": "The government's Covid-19 tracking app has irked the public, after it was revealed data would be stored with a foreign company.", "url": "https://au.finance.yahoo.com/news/govts-coronavirus-app-sends-data-to-amazon-012946916.html", "urlToImage": null, "publishedAt": "2020-04-25T01:34:57Z", "content": "The governments coronavirus tracking app will store its data with tech giant Amazon, but will not mean US officials can access it, new reports show.\r\nThe government issued a data storage contract to Amazon for its coronavirus app, which is not mandatory, and … [+1981 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": null, "title": "British soldiers to get insect repellant as COVID-19 protection - msnNOW", "description": "British armed forces are to be given insect repellent to protect them against COVID-19 infection, it has emerged.", "url": "https://www.theguardian.com/world/2020/apr/24/british-soldiers-to-get-insect-repellant-as-covid-19-protection", "urlToImage": null, "publishedAt": "2020-04-25T00:30:00Z", "content": "© ASSOCIATED PRESS\r\n British Army soldiers get instructions outside the ExCel center which is being turned in to a 4000 bed temporary hospital for coronavirus patients in London, Tuesday, March 31, 2020. The new coronavirus causes mild or moderate symptoms fo… [+2124 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Baked beans an unlikely nutrition star, and pandemic hit - Health - ABC News", "description": "While baked beans might not look particularly sexy, they're a favourite among nutrition experts. Here's why.", "url": "https://www.abc.net.au/news/health/2020-04-25/baked-beans-an-unlikely-nutrition-star/12176974", "urlToImage": null, "publishedAt": "2020-04-25T00:17:11Z", "content": "As we all fight our inner \"prepper\" and try not to succumb to panic buying, it seems many of us have turned to an old favourite: baked beans.\r\nBean production at Australia's largest fruit and vegetable cannery in Shepparton, Victoria, has doubled its usual vo… [+5001 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Could warm weather help contain pandemic? - 7NEWS.com.au", "description": "Scientists aren't certain about the link between colder conditions and the spread of coronavirus, but are hoping the northern summer will see the outbreak ease.", "url": "https://7news.com.au/news/health/could-warm-weather-help-contain-pandemic-c-998765", "urlToImage": null, "publishedAt": "2020-04-25T00:08:56Z", "content": "As the seasons change in the northern and southern hemispheres, questions are being asked about the influence of weather in the spread of coronavirus, which has killed more than 190,000 people and sent the global economy into a tailspin.\r\nHere's what we know … [+3556 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Why disease detectives could call Ohioans about COVID-19 - FOX 8 News Cleveland", "description": "State and local health departments in Ohio have people working as disease detectives trying to uncover more about the spread of COVID-19 and you could get a ...", "url": "https://www.youtube.com/watch?v=UGlGEeQYAAA", "urlToImage": null, "publishedAt": "2020-04-24T23:13:23Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Expectant mothers prepare to have children in the midst of COVID-19 pandemic - CBS 17", "description": "Expectant mothers prepare to have children in the midst of COVID-19 pandemic", "url": "https://www.youtube.com/watch?v=xf3lExxSb94", "urlToImage": null, "publishedAt": "2020-04-24T22:09:28Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Researchers Studying Hydroxychloroquine As Coronavirus Treatment - WJZ", "description": "Researchers at the University of Maryland School of Medicine are testing the effectiveness of the malaria drug hydroxychloroquine as a possible treatment for...", "url": "https://www.youtube.com/watch?v=LrQBPFvq9Y8", "urlToImage": null, "publishedAt": "2020-04-24T21:54:00Z", "content": null}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Sydney doctor Edward O’Neill in UK coronavirus vaccine trial - 7NEWS.com.au", "description": "Edward O'Neill believes taking part in a UK coronavirus vaccine trial is the right thing to do but admits he's taking a \"walk in faith\".", "url": "https://7news.com.au/lifestyle/health-wellbeing/aussie-to-walk-in-faith-in-vaccine-trial-c-998463", "urlToImage": null, "publishedAt": "2020-04-24T21:49:15Z", "content": "An Australian man who is testing a potential coronavirus vaccine in the UK says he is taking a walk in faith.\r\nDr Edward ONeill was one of the first two people injected as part of trials for a potential vaccine that has been developed by Oxford University.\r\nT… [+1441 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "", "title": "Coronavirus FAQs: Are There Lots Of Cases With No Symptoms? Can I See A Dentist? : Goats and Soda - NPR", "description": "We also discuss the phenomenon of symptom-free cases — how many are there, do we know how much of a role they play in spreading the virus?", "url": "https://www.npr.org/sections/goatsandsoda/2020/04/24/844325330/coronavirus-faqs-does-a-bigger-dose-make-you-sicker-can-you-go-to-the-dentist", "urlToImage": null, "publishedAt": "2020-04-24T21:32:39Z", "content": "Credit: Cristina Spano for NPR\r\nEach week we answer some of your pressing questions about the coronavirus and how to stay safe. Email us your questions at goatsandsoda@npr.org with the subject line: \"Weekly Coronavirus Questions.\" \r\nDoes the size of a viral d… [+7028 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus Update: New Antibody Testing Site Opens In Sunset Park, Brooklyn - CBS New York", "description": "A new COVID-19 antibody testing site is now open in Brooklyn.", "url": "https://www.youtube.com/watch?v=pmtcbUHGXEA", "urlToImage": null, "publishedAt": "2020-04-24T21:15:39Z", "content": null}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Olivia Willis", "title": "When coronavirus patients suddenly decline, their own immune system might be to blame - ABC News", "description": "In some cases of COVID-19, it may be the body's response to the virus, rather than the virus itself, that ultimately causes harm.", "url": "https://www.abc.net.au/news/health/2020-04-25/coronavirus-covid-immune-response-causes-harm/12176872", "urlToImage": null, "publishedAt": "2020-04-24T20:30:29Z", "content": "It's been described as the \"second week crash\".\r\nAbout seven days after developing symptoms of COVID-19, some people even those with mild symptoms can suddenly start to deteriorate, often with little warning.\r\n\"They end up getting admitted to hospital, and ab… [+6217 chars]"}, {"source": {"id": null, "name": "China.org.cn"}, "author": "", "title": "Sweden sees rise in coronavirus-related deaths - China.org.cn", "description": null, "url": "http://www.china.org.cn/world/Off_the_Wire/2020-04/25/content_75973508.htm", "urlToImage": null, "publishedAt": "2020-04-24T19:45:59Z", "content": "STOCKHOLM, April 24 (Xinhua) -- A new spike in COVID-19 cases in the Swedish capital of Stockholm could signal that residents have started to relax about social distancing recommendations, the country's health authorities said on Friday.\r\nA total of 1,152 peo… [+3212 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Nazia Parveen", "title": "New mother dies of coronavirus six days after giving birth - The Guardian", "description": "Fozia Hanif developed symptoms before her 29th birthday, resulting in premature birth of her son, Ayaan", "url": "https://www.theguardian.com/world/2020/apr/24/new-mother-dies-of-coronavirus-six-days-after-giving-birth", "urlToImage": null, "publishedAt": "2020-04-24T19:31:43Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "UK government's Covid-19 testing website closes hours after opening due to 'significant demand' - Channel 4 News", "description": "The new website enabling millions of key workers in England to access virus tests closed within hours after it experienced what the government said was 'sign...", "url": "https://www.youtube.com/watch?v=hSKZP_Xsg18", "urlToImage": null, "publishedAt": "2020-04-24T19:03:59Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "'Sage did not advise a specific target' for Covid-19 testing, says Chris Whitty - The Telegraph", "description": "Chief Medical Officer, Chris Whitty, appears in front of the Science and Tech Committee to answer questions of Covid-19 testing Get the latest headlines: htt...", "url": "https://www.youtube.com/watch?v=TXaG8YVLm8U", "urlToImage": null, "publishedAt": "2020-04-24T16:35:21Z", "content": null}, {"source": {"id": null, "name": "Prevention.com"}, "author": "Korin Miller", "title": "Does Coronavirus Cause Blood Clots? Doctors Explain the Life-Threatening Complication - Prevention.com", "description": "The condition can further weaken already struggling lungs, experts say.", "url": "https://www.prevention.com/health/a32264828/coronavirus-blood-clots/", "urlToImage": null, "publishedAt": "2020-04-24T16:30:00Z", "content": "Every day, more news emerges about the serious complications that can result from COVID-19, the respiratory illness caused by the novel coronavirus. But a new one is a bit mysterious: Many doctors have noticed that patients who have a severe case are struggli… [+6790 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Chris Smith", "title": "The most unusual coronavirus symptom is also the most dangerous - BGR", "description": "The newest observed coronavirus symptom is also the most dangerous one and can appear in patients who don’t even experience other symptoms. Doctors have noticed an increase in strokes caused by blood clots in young adults, who might be reluctant to seek medic…", "url": "https://bgr.com/2020/04/24/coronavirus-symptoms-stroke-after-blood-clots-in-young-patients/", "urlToImage": null, "publishedAt": "2020-04-24T14:02:10Z", "content": "<ul><li>The newest observed coronavirus symptom is also the most dangerous one and can appear in patients who don’t even experience other symptoms.</li><li>Doctors have noticed an increase in strokes caused by blood clots in young adults, who might be relucta… [+3622 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Aussies should brace for rolling lockdowns in years ahead - Big Rigs", "description": "Australia is preparing to cautiously lift the first virus restrictions next week – but a return to “normal” could still be years away.", "url": "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-aussies-should-brace-for-rolling-lockdowns-in-years-ahead/news-story/8847b0e8f896994785239983a0e91880", "urlToImage": null, "publishedAt": "2020-04-24T11:15:08Z", "content": "ANALYSIS\r\nBrace yourselves: We're going to need more lockdowns to get on top of COVID-19.\r\nEconomists used to dream of exponential growth in relation to the economy. But that same explosive effect seems set to doom us to rolling lockdowns for years to come.\r\n… [+5660 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Joe Gamp", "title": "Hancock: Coronavirus lockdown should be eased at the same time for all parts of UK - Yahoo News Australia", "description": "The health secretary said restrictions should be eased across the UK at the same time, after experts said London was weeks ahead of the nation.", "url": "https://au.news.yahoo.com/coronavirus-matt-hancock-lockdown-restrictions-111313657.html", "urlToImage": null, "publishedAt": "2020-04-24T11:13:00Z", "content": "Matt Hancock has said he would prefer if coronavirus social distancing measures were eased across all parts of the UK at the same time.\r\nThe UK is in its fifth week of social distancing restrictions, with the government announcing on April 17 that measures wi… [+3575 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Erika Edwards", "title": "Doctors report uptick in surprising coronavirus complication: dangerous blood clots - NBC News", "description": "Coronavirus patients are developing blood clots at higher rates. Does the virus cause blood to clot, or is it the result of inflammation? Regular anticoagulants aren't working.", "url": "https://www.nbcnews.com/health/health-news/doctors-report-uptick-surprising-coronavirus-complication-dangerous-blood-clots-n1190491", "urlToImage": null, "publishedAt": "2020-04-24T08:33:27Z", "content": "Three weeks ago, critical care pulmonologist Hugh Cassiere encountered something he hadn't seen in 24 years of practicing medicine.\r\nA 45-year-old man arrived at the hospital where Cassiere works, North Shore University Hospital on Long Island, New York, with… [+4346 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Melissa Cunningham", "title": "'Things can change quickly': Complacency warning as infections drop - The Age", "description": "As Victoria's rate of coronavirus infection falls again, Chief Health Officer warns second wave of cases could happen anytime if social distancing is relaxed.", "url": "https://www.theage.com.au/national/victoria/things-can-change-quickly-complacency-warning-as-infections-drop-20200424-p54mzh.html", "urlToImage": null, "publishedAt": "2020-04-24T07:24:37Z", "content": "There were no new community transmission infections in Victoria as of Friday morning, with the number of those cases stable at 135.\r\nTwenty-seven people remain in hospital, including 11 people in intensive care.\r\nAsked if Victoria's tally might continue to tr… [+1892 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "Scientists uncover evidence coronavirus could trigger diabetes in healthy adults - SBS News", "description": "A new study involving Australian researchers has found there is evidence COVID-19 could be causing diabetes in otherwise healthy adults.", "url": "https://www.sbs.com.au/news/scientists-uncover-evidence-coronavirus-could-trigger-diabetes-in-healthy-adults", "urlToImage": null, "publishedAt": "2020-04-24T06:10:00Z", "content": "Coronavirus may be triggering diabetes in typically healthy adults.\r\nElderly Australians with diabetes are also at an increased risk from coronavirus, a study released on Friday shows.\r\nCo-author and Monash University professor Paul Zimmet said diabetic child… [+2582 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Two pet cats contract coronavirus - Ballina Shire Advocate", "description": "Two pet cats from different homes have contracted the coronavirus with one believed to have caught the virus from someone other than its owner.", "url": "https://www.news.com.au/lifestyle/health/health-problems/two-pet-cats-contract-coronavirus-in-new-york-city/news-story/88a58061054ea124b819ddeaea6f6ec6", "urlToImage": null, "publishedAt": "2020-04-24T05:55:00Z", "content": "Those nine lives might come in handy.\r\nTwo pet cats in New York state in the US have tested positive for the coronavirus, in the first diagnoses of domestic animals on American soil, a report said this week.\r\nIt's believed that the cats contracted the illness… [+1572 chars]"}, {"source": {"id": null, "name": "Goldcoastbulletin.com.au"}, "author": "Sue Dunlevy and Brianna Morris-Grant", "title": "Why we're unlikely to be shaking hands 'anytime soon' - Chinchilla News", "description": "THE family dinner could be one of the first social gatherings allowed as we come out of the COVID-19 lockdown.", "url": "https://www.goldcoastbulletin.com.au/coronavirus/gold-coast-warned-against-breaching-social-distancing-laws-as-coronavirus-cases-drop/news-story/fb52d6aba701c1c79700f6d9380a3da0", "urlToImage": null, "publishedAt": "2020-04-24T04:43:00Z", "content": "THE family dinner could be one of the first social gatherings allowed as we come out of the COVID-19 lockdown.\r\nEpidemiologists advising the Federal Government said the best approach to ending the lockdown may be lifting one restriction at a time - like allow… [+5103 chars]"}, {"source": {"id": null, "name": "Asiaone.com"}, "author": null, "title": "Coronavirus: As virus advances, doctors rethink rush to ventilate - AsiaOne", "description": "BERLIN - When he was diagnosed with Covid-19, Mr Andre Bergmann knew exactly where he wanted to be treated: The Bethanien hospital lung clinic in Moers, near his home in north-western Germany. The clinic is known for its reluctance to put patients with breath…", "url": "https://www.asiaone.com/world/coronavirus-virus-advances-doctors-rethink-rush-ventilate", "urlToImage": null, "publishedAt": "2020-04-24T03:31:34Z", "content": "BERLIN - When he was diagnosed with Covid-19, Mr Andre Bergmann knew exactly where he wanted to be treated: The Bethanien hospital lung clinic in Moers, near his home in north-western Germany.\r\nThe clinic is known for its reluctance to put patients with breat… [+16360 chars]"}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "PerthNow", "title": "Coronavirus crisis: Artania passenger adds to WA death tally - PerthNow", "description": "WA Health Minister Roger Cook has confirmed another COVID-19 death in WA.", "url": "https://www.perthnow.com.au/news/coronavirus/coronavirus-crisis-artania-passenger-adds-to-wa-death-tally-ng-b881528983z", "urlToImage": null, "publishedAt": "2020-04-24T02:40:14Z", "content": "An Artania passenger in his 70s has died, bringing WAs COVID-19 death toll to eight.\r\nThe passenger was one of the original cases taken off the ship last month but lost his fight at Sir Charles Gairdner Hospital yesterday.\r\nThe death came as two new cases of … [+1247 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Almost all of these virus patients die - Tweed Daily News", "description": "The results of a new hospital study show that when critically ill patients are put on ventilators it is highly unlikely they will survive.", "url": "https://www.news.com.au/lifestyle/health/health-problems/almost-90-per-cent-of-coronavirus-patients-put-on-ventilators-die/news-story/7d95181220848cd1d95d68319f160c2b", "urlToImage": null, "publishedAt": "2020-04-24T02:07:00Z", "content": "New research shows that critically ill coronavirus patients who are put on ventilators have a very poor chance of surviving.\r\nA newly published study revealed 90 per cent of coronavirus patients who were ventilated in New York City hospitals died, despite a h… [+2176 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Tom Flanagan", "title": "The restrictions which could be lifted first as Australia flattens the curve - Yahoo News Australia", "description": "The majority of Australia's coronavirus restrictions could be lifted within six months, a former state chief health officer believes.", "url": "https://au.news.yahoo.com/coronavirus-restrictions-could-be-lifted-first-australia-011351455.html", "urlToImage": null, "publishedAt": "2020-04-24T01:13:00Z", "content": "One of Australias former state chief health officers believes the majority of current restrictions in place to fight the coronavirus outbreak will have been lifted within six months.\r\nQueensland University of Technology Professor Gerry Fitzgerald, Queenslands… [+2969 chars]"}]}