{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Le Parisien"}, "author": null, "title": "Le coronavirus actuel plus infectieux que la version originale ? Cinq questions sur l’étude de Cell - Le Parisien", "description": "Alors que le Covid-2019 dépasse les 10 millions de contaminations dans le monde, des chercheurs américains suggèrent dans une étude que le v", "url": "https://www.leparisien.fr/societe/sante/le-coronavirus-actuel-plus-infectieux-que-la-version-originale-cinq-questions-sur-l-etude-de-cell-03-07-2020-8346894.php", "urlToImage": "https://cloudfront-eu-central-1.images.arcpublishing.com/leparisien/UCSHS6DN7LSTMD3ZN7H2LQNQOE.jpg", "publishedAt": "2020-07-03T15:44:00Z", "content": "La revue américaine Cell a publié ce jeudi une étude montrant qu'une variation du génome viral de COVID-19 a amélioré sa capacité à infecter les cellules humaines. Et l'a aidé à devenir la souche dom… [+2801 chars]"}, {"source": {"id": null, "name": "Trust My Science"}, "author": null, "title": "Les bactéries intestinales liées à un certain type d'alimentation seraient une cause majeure du vieillissement des artères - Trust My Science", "description": "Une nouvelle étude de l’Université du Colorado à Boulder met en lien les bactéries intestinales, l’alimentation (plus précisément la consommation de viande rouge) et le vieillissement des artères. En effet, un composé produit dans l’intestin lorsque nous mang…", "url": "https://trustmyscience.com/bacteries-intestinales-alimentation-liees-vieillissement-arteres/", "urlToImage": "https://trustmyscience.com/wp-content/uploads/2020/07/viande-rouge.jpg", "publishedAt": "2020-07-03T12:10:05Z", "content": "Une nouvelle étude de lUniversité du Colorado à Boulder met en lien les bactéries intestinales, lalimentation (plus précisément la consommation de viande rouge) et le vieillissement des artères. En e… [+5063 chars]"}, {"source": {"id": null, "name": "FREDZONE"}, "author": "Lydie", "title": "Covid-19 : des traces du virus retrouvées en Europe… en mars 2019 ?! - FREDZONE", "description": "Quand on pense au Covid-19, on pense généralement qu'il s'agit d'une maladie propre à l'année 2020. C'est d'ailleurs normal puisque les premiers cas ont officiellement ét", "url": "https://www.fredzone.org/covid-19-des-traces-du-virus-retrouvees-en-europe-en-mars-2019-288", "urlToImage": "https://www.fredzone.org/wp-content/uploads/2020/06/Barcelone-640x325.jpg", "publishedAt": "2020-07-02T20:20:52Z", "content": "Quand on pense au Covid-19, on pense généralement quil sagit dune maladie propre à lannée 2020. Cest dailleurs normal puisque les premiers cas ont officiellement été détectés cette année. Pourtant, d… [+3030 chars]"}, {"source": {"id": null, "name": "Normandie Actu"}, "author": "Rédaction La Dépêche de Tahiti", "title": "Covid-19 : Le Pays importe le remède malgache - La Dépêche de Tahiti", "description": "Le ministère de l'économie verte a présenté au conseil des ministres une proposition d'étude visant à l'introduction de l'Artemisia annua (ou absinthe chinoise).", "url": "https://actu.fr/politique/covid-19-le-pays-importe-le-remede-malgache_34721526.html", "urlToImage": "https://static.actu.fr/uploads/2020/07/artemisia-annua-west-virginia.jpg", "publishedAt": "2020-07-02T17:55:44Z", "content": "L’absinthe chinoise pour lutter contre le coronavirus. (©DR)\r\nLe ministère de l’économie verte a présenté au conseil des ministres une proposition d’étude visant à l’introduction de l’Artemisia annua… [+1048 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Mayotte 1ère", "title": "Fièvre typhoïde, près de dix nouveaux cas dans le Nord de Mayotte - Mayotte la 1ère - Outre-mer la 1ère", "description": "Alors que la Covid-19 circule encore activement à Mayotte, l’Agence Régionale de Santé signale une augmentation de cas de fièvre typhoïde ces derniers jours. \r\n&", "url": "https://la1ere.francetvinfo.fr/mayotte/fievre-typhoide-pres-dix-nouveaux-cas-nord-mayotte-849774.html", "urlToImage": "https://la1ere.francetvinfo.fr/image/b4AFITg8jjGVjhbk3GmPOWHnsQI/930x620/outremer/2020/07/02/5efded93558c9_whatsapp_image_2020-07-02_at_17.17.30-1415962.jpeg", "publishedAt": "2020-07-02T15:04:16Z", "content": "Depuis le début de lannée, dix-huit cas ont été signalés, dont neuf dans le seul village de Dzoumogné, cest dans la commune de Bandraboua au Nord de Mayotte. Cest ce quon appelle vulgairement la mala… [+1430 chars]"}, {"source": {"id": null, "name": "Trust My Science"}, "author": null, "title": "Coronavirus : Type de construction et matériaux utilisés, les deux facteurs clés pour qu'un masque soit efficace - Trust My Science", "description": "45 Partages Au cours des derniers mois, masques et distanciation sociale se sont imposés rapidement comme les principaux moyens de lutte contre la COVID-19. Bien que l’utilisation de protections faciales soit une arme standard de lutte contre les épidémies en…", "url": "https://trustmyscience.com/type-construction-materiaux-utilises-deux-facteurs-cles-pour-efficacite-masque/", "urlToImage": "https://trustmyscience.com/wp-content/uploads/2020/07/masque-coronavirus-efficacite-gouttelettes.jpg", "publishedAt": "2020-07-02T13:13:01Z", "content": "Au cours des derniers mois, masques et distanciation sociale se sont imposés rapidement comme les principaux moyens de lutte contre la COVID-19. Bien que lutilisation de protections faciales soit une… [+8067 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Chine : faut-il craindre une pandémie de grippe porcine ? - RTL.fr", "description": "ÉCLAIRAGE - Une nouvelle souche du virus de grippe porcine a été découverte lundi dernier par des chercheurs en Chine.", "url": "https://www.rtl.fr/actu/international/chine-faut-il-craindre-une-pandemie-de-grippe-porcine-7800646208", "urlToImage": "https://cdn-media.rtl.fr/online/image/2020/0415/7800398549_un-scientifique-dans-le-laboratoire-de-hengyang-en-chine-illustration.jpg", "publishedAt": "2020-07-02T13:06:00Z", "content": "Une nouvelle pandémie venue de Chine ? Des chercheurs ont découvert une souche de virus de grippe porcine en Chine présentant toutes les caractéristiques capables de provoquer une future pandémie, se… [+2922 chars]"}, {"source": {"id": null, "name": "L-frii.com"}, "author": "Dammipi BONSA", "title": "Ces aliments accélèrent le vieillissement, selon une diététicienne - L-FRII", "description": "Un certain nombre de produits alimentaires ont des impacts négatifs sur l’organisme et accélèrent le vieillissement, selon une diététicienne. « Les aliments", "url": "https://l-frii.com/ces-aliments-accelerent-le-vieillissement-selon-une-dieteticienne/", "urlToImage": "https://l-frii.com/wp-content/uploads/2020/06/Ces-aliments-accélèrent-le-vieillissement-selon-une-diététicienne.jpg", "publishedAt": "2020-06-30T20:35:00Z", "content": "Un certain nombre de produits alimentaires ont des impacts négatifs sur lorganisme et accélèrent le vieillissement, selon une diététicienne russe. \r\nNutrition : voici le top 20 des aliments brûle-gra… [+1432 chars]"}]}