{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Trust My Science"}, "author": null, "title": "Coronavirus : la souche virale pandémique actuelle serait une variante plus infectieuse de la souche initiale - Trust My Science", "description": "109 Partages Tandis que la pandémie à coronavirus SARS-CoV-2 fait toujours rage dans de nombreux pays, les virologues continuent d’étudier le virus afin d’améliorer les moyens de lutte mis en place et, peut-être, accélérer le développement de traitements et d…", "url": "https://trustmyscience.com/coronavirus-souche-virale-actuelle-variante-plus-infectieuse/", "urlToImage": "https://trustmyscience.com/wp-content/uploads/2020/07/mutation-coronavirus.jpeg", "publishedAt": "2020-07-04T16:26:27Z", "content": "Tandis que la pandémie à coronavirus SARS-CoV-2 fait toujours rage dans de nombreux pays, les virologues continuent d’étudier le virus afin d’améliorer les moyens de lutte mis en place et, peut-être,… [+3658 chars]"}, {"source": {"id": null, "name": "Montceau-news.com"}, "author": null, "title": "Dernier point en date de la situation en Saône-et-Loire (Santé) - Montceau News", "description": "Dans le monde, la pandémie s’accélère selon l’Organisation Mondiale de la Santé. En Saône-et-Loire comme en France, jour après jour, le relâchement des comportements s’accélère aussi. C’est un sujet de grave préoccupation de voir des personnes se serrer la ma…", "url": "https://montceau-news.com/saone_et_loire/609039-dernier-point-en-date-de-la-situation-en-saone-et-loire-sante.html", "urlToImage": "https://montceau-news.com/imagesPost/2020/04/virus-0704202-150x150.jpg", "publishedAt": "2020-07-03T15:20:00Z", "content": "Dans le monde, la pandémie saccélère selon lOrganisation Mondiale de la Santé. En Saône-et-Loire comme en France, jour après jour, le relâchement des comportements saccélère aussi. Cest un sujet de g… [+1612 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": null, "title": "Comment la viande rouge fait vieillir nos artères ? - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_109e6b3e-a12a-4028-817f-7ed55023b6d2&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-07-03T08:14:00Z", "content": "Afin de vous offrir une expérience globale optimisée, nous souhaitons vous proposer des publicités pertinentes qui vous seront plus utiles. Par exemple, lorsque vous recherchez un film, nous utilison… [+531 chars]"}, {"source": {"id": null, "name": "L-frii.com"}, "author": "Dammipi BONSA", "title": "Ces aliments accélèrent le vieillissement, selon une diététicienne - L-FRII", "description": "Un certain nombre de produits alimentaires ont des impacts négatifs sur l’organisme et accélèrent le vieillissement, selon une diététicienne. « Les aliments", "url": "https://l-frii.com/ces-aliments-accelerent-le-vieillissement-selon-une-dieteticienne/", "urlToImage": "https://l-frii.com/wp-content/uploads/2020/06/Ces-aliments-accélèrent-le-vieillissement-selon-une-diététicienne.jpg", "publishedAt": "2020-06-30T20:35:00Z", "content": "Un certain nombre de produits alimentaires ont des impacts négatifs sur lorganisme et accélèrent le vieillissement, selon une diététicienne russe. \r\nNutrition : voici le top 20 des aliments brûle-gra… [+1432 chars]"}]}