{"status": "ok", "totalResults": 41, "articles": [{"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Des tests de la chloroquine contre le Covid-19 interrompus pour des raisons de sécurité après plusieurs décès - Sputnik France", "description": "Une équipe de chercheurs qui testait de la chloroquine en tant que traitement du Covid-19 a dû écourter ses travaux après qu’un quart des patients ayant pris cet...", "url": "https://fr.sputniknews.com/sci_tech/202004241043649413-des-tests-de-la-chloroquine-contre-le-covid-19-interrompus-pour-des-raisons-de-securite-apres/", "urlToImage": null, "publishedAt": "2020-04-24T21:15:58Z", "content": "Une équipe de chercheurs qui testait de la chloroquine en tant que traitement du Covid-19 a dû écourter ses travaux après quun quart des patients ayant pris cet antipaludéen sont décédés, selon les résultats de létude publiés dans le Journal de l'American Med… [+3394 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Nicolas Stival", "title": "Coronavirus à Toulouse : En attendant une possible deuxième vague, les cas diminuent toujours au CHU - 20 Minutes", "description": "71 malades du coronavirus étaient hospitalisés ce vendredi au CHU de Purpan, contre 113 une semaine plus tôt", "url": "https://www.20minutes.fr/toulouse/2767363-20200424-coronavirus-toulouse-attendant-possible-deuxieme-vague-cas-diminuent-toujours-chu", "urlToImage": null, "publishedAt": "2020-04-24T17:18:36Z", "content": "L'unité des soins intensifs de l'hôpital Purpan, à Toulouse, le 21 avril 2020. Frédéric Scheiber / 20 Minutes\r\nLes chiffres sont éloquents : selon le CHU de Toulouse, 71 malades du coronavirus sont hospitalisés ce vendredi (dont 20 en réanimation et deux en s… [+2241 chars]"}, {"source": {"id": null, "name": "Metrotime.be"}, "author": null, "title": "Des chercheurs belges tentent de bloquer la phase inflammatoire du Covid-19 - Metro Belgique", "description": "Des essais cliniques visant à bloquer la phase inflammatoire du Covid-19, où les cas sont les plus graves, sont coordonnés par l'hôpital universitaire de Gand depuis début avril. Les résultats sont encourageants.", "url": "https://fr.metrotime.be/2020/04/24/must-read/des-chercheurs-belges-tentent-de-bloquer-la-phase-inflammatoire-du-covid-19/", "urlToImage": null, "publishedAt": "2020-04-24T17:17:55Z", "content": "Des essais cliniques visant à bloquer la phase inflammatoire du Covid-19, où les cas sont les plus graves, sont coordonnés par lhôpital universitaire de Gand depuis début avril. Les résultats sont encourageants. Le dosage de certaines protéines permet de déte… [+1695 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Anne Prigent", "title": "Coronavirus : la bactérie Prevotella joue-t-elle vraiment un rôle dans l'infection ? - Le Figaro", "description": "Le virus s'attaquerait à une bactérie présente dans l'organisme, selon une théorie étonnante qui fleurit sur les réseaux sociaux. Mais est-elle un tant soit peu fondée ?", "url": "http://www.lefigaro.fr/sciences/coronavirus-nbsp-la-bacterie-prevotella-nbsp-joue-t-elle-nbsp-vraiment-un-role-dans-l-infection-nbsp-20200424", "urlToImage": null, "publishedAt": "2020-04-24T16:33:00Z", "content": "LA QUESTION. Est-ce que le virus SARS-CoV-2 est un bactériophage ? C'est-à-dire qu'il agirait en infectant une bactérie, présente naturellement dans l'organisme : Prevotella. En devenant virulente, cette bactérie déclencherait l'hyper-réaction immunitaire à l… [+829 chars]"}, {"source": {"id": null, "name": "Futura-sciences.com"}, "author": "Éléonore Solé", "title": "D'étranges chauves-souris porteuses de coronavirus - Futura", "description": "Les chauves-souris seraient plus douées que d'autres pour transmettre des virus à la population humaine. Pourtant, ces espèces sont peu connues des scientifiques. Un manque que des chercheurs ont...", "url": "https://www.futura-sciences.com/planete/actualites/chauve-souris-etranges-chauves-souris-porteuses-coronavirus-80721/", "urlToImage": null, "publishedAt": "2020-04-24T16:18:17Z", "content": "Les chauves-souris seraient plus douées que d'autres pour transmettre des virus à la population humaine. Pourtant, ces espèces sont peu connues des scientifiques. Un manque que des chercheurs ont contribué à combler en se penchant sur les chauve-souris à nez … [+3036 chars]"}, {"source": {"id": null, "name": "Trustmyscience.com"}, "author": null, "title": "Coronavirus : Des chercheurs auraient découvert les types de cellules humaines les plus vulnérables - Trust My Science", "description": "180 Partages Des scientifiques ont découvert quels types de cellules du corps humain sont les plus susceptibles d’être infectées par le nouveau coronavirus SARS-CoV-2, en identifiant les cibles pour le pathogène en fonction des types de protéines produites pa…", "url": "https://trustmyscience.com/covid-19-scientifiques-decouvert-types-cellules-humaines-plus-vulnerables/", "urlToImage": null, "publishedAt": "2020-04-24T16:15:17Z", "content": "Des scientifiques ont découvert quels types de cellules du corps humain sont les plus susceptibles dêtre infectées par le nouveau coronavirus SARS-CoV-2, en identifiant les cibles pour le pathogène en fonction des types de protéines produites par les cellules… [+5315 chars]"}, {"source": {"id": null, "name": "Actu.fr"}, "author": "Anne-Sophie Blot", "title": "Trois semaines après son hospitalisation, un médecin raconte la persistance du coronavirus - actu.fr", "description": "Peu suivis à la sortie de l'hôpital, les patients les plus gravement atteints par le coronavirus continuent de ressentir des difficultés respiratoires plusieurs semaines après.", "url": "https://actu.fr/societe/coronavirus/trois-semaines-apres-hospitalisation-medecin-raconte-persistance-coronavirus_33235354.html", "urlToImage": null, "publishedAt": "2020-04-24T15:12:48Z", "content": "Un scanner de poumons d’un patient infecté par le Covid-19. (©AFP/Archives/LUCAS BARIOULET)\r\nPhilippe Vasseur a été hospitalisé sous oxygène à Paris pendant 13 jours, puis renvoyé à domicile sans recommandations. Trois semaines plus tard, alors que ce médecin… [+4216 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": "Jonathan Parienté, Pierre Breteau, Maxime Ferrer, Léa Sanchez", "title": "Coronavirus : âge, sexe, département… la hausse de la mortalité française en six graphiques - Le Monde", "description": "Depuis le début de l’épidémie, grâce aux remontées de l’état civil, l’Insee observe une surmortalité, notamment dans les zones les plus touchées par le Covid-19, et parmi les plus âgés.", "url": "https://www.lemonde.fr/les-decodeurs/article/2020/04/24/coronavirus-age-sexe-departement-la-hausse-de-la-mortalite-francaise-en-six-graphiques_6037681_4355770.html", "urlToImage": null, "publishedAt": "2020-04-24T14:25:06Z", "content": "Peut-on estimer le nombre de victimes du Covid-19 en France ? Chaque soir, le directeur général de la santé, Jérôme Salomon, communique le nombre de personnes mortes des suites de la maladie. Jusquau 2 avril, il ne prenait en compte que les morts en milieu ho… [+2767 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "Manon Adoue", "title": "Les moustiques tigre sont déjà là : toute l'Occitanie en vigilance rouge - LaDepeche.fr", "description": "", "url": "https://www.ladepeche.fr/2020/04/24/les-moustiques-tigre-sont-deja-la-toute-loccitanie-en-vigilance-rouge,8861132.php", "urlToImage": null, "publishedAt": "2020-04-24T13:35:46Z", "content": "La France voit rouge. Mais cette fois-ci à cause du moustique tigre. Le site d'informations Vigilance-Moustiques vient de publier sa carte 2020 de la présence des moustiques tigre en France. Et la cartographie fait froid dans le dos. Six nouveaux départements… [+2046 chars]"}, {"source": {"id": null, "name": "Sciencepost.fr"}, "author": "Brice Louvet, rédacteur sciences", "title": "Covid-19 : que dit la première étude séro-épidémiologique en France ? - SciencePost", "description": "Fin Mars, 661 personnes ont fait l'objet d'une étude épidémiologique et sérologique dans le cadre de la lutte contre le Covid-19", "url": "https://sciencepost.fr/covid-19-que-dit-la-premiere-etude-sero-epidemiologique-en-france/", "urlToImage": null, "publishedAt": "2020-04-24T12:52:57Z", "content": "Fin mars 2020, 661 personnes reliées à un lycée de Crépy-en-Valois (Oise) ont fait l’objet d’une étude épidémiologique et sérologique menée par les chercheurs de lInstitut Pasteur dans le cadre de la lutte contre le Covid-19. Quels enseignements peut-on tirer… [+3683 chars]"}, {"source": {"id": null, "name": "Www.rfi.fr"}, "author": "Caroline Paré, Ophélie Lahccen", "title": "Covid-19: porteurs du VIH et anciens malades de la tuberculose doivent être très vigilants - RFI", "description": "La présence d'autres pathologies augmente le risque de complications chez un patient atteint du nouveau coronavirus. D'où l'importance pour les porteurs du VIH ou les anciens tuberculeux de redoubler de vigilance. Entretien.", "url": "http://www.rfi.fr/fr/afrique/20200424-covid-19-porteurs-vih-et-anciens-malades-la-tuberculose-doivent-%C3%AAtre-tr%C3%A8s-vigilants", "urlToImage": null, "publishedAt": "2020-04-24T11:10:00Z", "content": "La présence d'autres pathologies augmente le risque de complications chez un patient atteint du nouveau coronavirus. D'où l'importance pour les porteurs du VIH ou les anciens tuberculeux de redoubler de vigilance. Entretien.\r\n Le professeur Jean-Marie Kayembe… [+4630 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "La rédaction", "title": "Souillac : les gendarmes interceptent un conducteur ivre et sans attestation - LaDepeche.fr", "description": "", "url": "https://www.ladepeche.fr/2020/04/24/souillac-les-gendarmes-interceptent-un-conducteur-ivre-et-sans-attestation,8860901.php", "urlToImage": null, "publishedAt": "2020-04-24T11:00:24Z", "content": "De jour, comme de nuit, les contrôles pour le respect des mesures de confinement se poursuivent sur l'ensemble du département du Lot. Ce jeudi 23 avril, à 22 heures 40, les gendarmes de la communauté de brigades de Souillac procèdent au contrôle d'un automobi… [+536 chars]"}, {"source": {"id": null, "name": "Orange.fr"}, "author": "https://www.facebook.com/orangeactufr", "title": "Une étude se penche sur les impacts du Covid-19 chez les personnes âgées - Actu Orange", "description": "Tous les patients âgés du Covid-19 n'en meurent pas et qu'advient-il des survivants ? Pour y répondre, le CHU de Grenoble coordonne une étude sur les impacts à plus long terme de la maladie chez les plus de 70 ans.", "url": "https://actu.orange.fr/societe/sante/une-etude-se-penche-sur-les-impacts-du-covid-19-chez-les-personnes-agees-CNT000001pGn1h.html", "urlToImage": null, "publishedAt": "2020-04-24T10:51:53Z", "content": "AFP, publié le vendredi 24 avril 2020 à 12h51\r\nTous les patients âgés du Covid-19 n'en meurent pas et qu'advient-il des survivants ? Pour y répondre, le CHU de Grenoble coordonne une étude sur les impacts à plus long terme de la maladie chez les plus de 70 an… [+2840 chars]"}, {"source": {"id": "les-echos", "name": "Les Echos"}, "author": "Alexandre Rousset", "title": "Coronavirus et allergies : comment distinguer les symptômes - Les Échos", "description": "La saison des pollens étant ouverte, de nombreux Français craignent de ne pas faire la différence entre une banale crise allergique et une infection au Covid-19. Si certains symptômes peuvent être similaires, d'autres permettent de différencier les deux patho…", "url": "https://www.lesechos.fr/industrie-services/pharmacie-sante/coronavirus-et-allergies-comment-distinguer-les-symptomes-1197888", "urlToImage": null, "publishedAt": "2020-04-24T10:39:05Z", "content": "Nez qui coule, yeux irrités, difficultés à respirer Comme chaque année, le printemps est synonyme d'allergies pour des millions de Français. Mais ce rendez-vous annuel prend une nouvelle dimension en 2020, alors que le pays, comme le monde entier, doit faire … [+4649 chars]"}, {"source": {"id": null, "name": "Sudinfo.be"}, "author": "Par sudinfo.be", "title": "Coronavirus: une mystérieuse complication des patients contaminés inquiète les médecins, «ça nous fait peur» - Sudinfo.be", "description": "Au fur et à mesure que le monde médical étudie les différents aspects du coronavirus, on découvre de nouveaux symptômes et complications de la maladie, parfois très inquiétants…", "url": "https://www.sudinfo.be/id181519/article/2020-04-24/coronavirus-une-mysterieuse-complication-des-patients-contamines-inquiete-les", "urlToImage": null, "publishedAt": "2020-04-24T09:21:00Z", "content": "Depuis lapparition du coronavirus en Chine, dans la province de Hubei, la communauté médicale a eu bien du mal à évaluer la gravité de la maladie. Dabord décrit comme « une grosse grippe », le coronavirus sest révélé bien plus dangereux que ce que lon pensait… [+2404 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus : le Tocilizumab, une piste prometteuse ? - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_5afc4061-0acb-4f43-bca0-ed07bbabd9c2&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-24T08:56:00Z", "content": "Afin de vous offrir une expérience globale optimisée, nous souhaitons vous proposer des publicités pertinentes qui vous seront plus utiles. Par exemple, lorsque vous recherchez un film, nous utilisons vos données de recherche et votre position pour afficher l… [+471 chars]"}, {"source": {"id": "liberation", "name": "Libération"}, "author": "Anaïs Condomines", "title": "Les visières en plastique constituent-elles une protection efficace ? - Libération", "description": "Ces masques ne sont pas des protections respiratoires. Ils présentent toutefois certains avantages. Si utilisés, ils doivent l'être en complément des gestes barrières et de la distanciation sociale.", "url": "https://www.liberation.fr/checknews/2020/04/23/les-visieres-en-plastique-constituent-elles-une-protection-efficace_1786198", "urlToImage": null, "publishedAt": "2020-04-24T08:51:37Z", "content": "Question posée par Anne le 23/04/2020\r\nBonjour, \r\nVous nous questionnez sur lefficacité des masques munis dune visière de protection en plastique. Habituellement utilisés sur les chantiers, ils sont parfois considérés par la population comme une alternative a… [+1686 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus : la maladie peut-elle se transmettre lors des relations sexuelles ? - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_a57398c6-f2e5-4648-8d45-fc3cbe230910&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-24T08:14:00Z", "content": "Yahoo fait partie de Verizon Media. Cliquez sur J'accepte afin dautoriser Verizon Media et ses partenaires à utiliser des cookies et des technologies similaires pour accéder à votre appareil, utiliser vos données (y compris votre position géographique), compr… [+596 chars]"}, {"source": {"id": null, "name": "Atlantico.fr"}, "author": null, "title": "Covid-19 : tour du monde des pistes de traitements potentiels - Atlantico.fr", "description": "Alors que de nombreux pays à travers la planète préparent et travaillent activement sur la phase du déconfinement, le Dr Stéphane Gayet revient sur les pistes de traitements contre le Covid-19 et notamment sur les vaccins ou sur la solution du...", "url": "https://www.atlantico.fr/decryptage/3589060/covid-19--tour-du-monde-des-pistes-de-traitements-potentiels-hydroxychloroquine-didier-raoult-vaccin-coronavirus-stephane-gayet", "urlToImage": null, "publishedAt": "2020-04-24T06:37:14Z", "content": "Atlantico.fr : Que savons-nous aujourd'hui des pistes de traitements du CoVid-19 ?\r\nAntiviraux et antibiotiques : deux classes thérapeutiques sans aucun point commun\r\nStéphane Gayet : On parle bien ici de médicaments qui agissent in vivo, c'est-à-dire dans no… [+20179 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "Julie Philippe @Julie_Philippe_", "title": "Toulouse. Coronavirus : deux chercheurs toulousains veulent percer le mystère de la perte du goût et de l’odor - LaDepeche.fr", "description": "Denis Pierron et Veronica Pereda-Loth, deux chercheurs toulousains, participent à une enquête internationale sur la perte du goût et de l’odorat chez les malades du Covid-19.", "url": "https://www.ladepeche.fr/2020/04/24/ils-veulent-percer-le-mystere-de-la-perte-du-gout-et-de-lodorat,8860124.php", "urlToImage": null, "publishedAt": "2020-04-24T06:08:37Z", "content": "l'essentiel\r\n Denis Pierron et Veronica Pereda-Loth, deux chercheurs toulousains, participent à une enquête internationale sur la perte du goût et de lodorat chez les malades du Covid-19.\r\n Quatre jours après être tombée malade, Loubna, 27 ans, ne sentait plu… [+2548 chars]"}, {"source": {"id": null, "name": "Orange.fr"}, "author": "https://www.facebook.com/orangeactufr", "title": "Dengue + coronavirus = bombe à retardement pour les hôpitaux d'Amérique centrale - Actu Orange", "description": "Les systèmes de santé d'Amérique centrale, déjà confrontés au nouveau coronavirus, sont maintenant sous la menace supplémentaire d'une flambée de dengue avec l'arrivée de la saison des pluies.", "url": "https://actu.orange.fr/societe/sante/dengue-coronavirus-bombe-a-retardement-pour-les-hopitaux-d-amerique-centrale-CNT000001pFNhs.html", "urlToImage": null, "publishedAt": "2020-04-24T06:07:00Z", "content": "AFP, publié le vendredi 24 avril 2020 à 08h07\r\nLes systèmes de santé d'Amérique centrale, déjà confrontés au nouveau coronavirus, sont maintenant sous la menace supplémentaire d'une flambée de dengue avec l'arrivée de la saison des pluies.\r\nPlus de 23.000 cas… [+4069 chars]"}, {"source": {"id": null, "name": "Francebleu.fr"}, "author": "Cécile Bidault", "title": "Coronavirus : un médecin généraliste de Tourcoing juge \"criminelle\" la politique du gouvernement - France Bleu", "description": "Après la mort de deux médecins généralistes atteints du coronavirus dans le Nord, le secrétaire général de la CSMF 59/62, Bertrand Legrand, médecin à Tourcoing, lance sur France Bleu Nord un cri d'alarme : il dénonce la politique du gouvernement qu'il juge \"s…", "url": "https://www.francebleu.fr/infos/sante-sciences/coronavirus-un-medecin-generaliste-de-tourcoing-juge-criminelle-la-politique-du-gouvernement-1587653136", "urlToImage": null, "publishedAt": "2020-04-24T06:03:09Z", "content": "Nous l'évoquions ces derniers jours sur France Bleu Nord, deux médecins généralistes sont morts récemment du coronavirus dans le Nord. Ces praticiens sont en première ligne dans la lutte contre le Covid-19, et ce vendredi 24 avril, l'un d'entre eux ne cache p… [+2842 chars]"}, {"source": {"id": null, "name": "Parismatch.be"}, "author": "E.M", "title": "L'obésité provoquerait des troubles du sommeil, et non pas l'inverse - Paris Match Belgique", "description": "La conservation de l’énergie pourrait être une fonction majeure du sommeil.", "url": "https://parismatch.be/actualites/sante/393385/lobesite-provoquerait-des-troubles-du-sommeil-et-non-pas-linverse", "urlToImage": null, "publishedAt": "2020-04-24T05:30:00Z", "content": "La conservation de l’énergie pourrait être une fonction majeure du sommeil.\r\nDe nombreuses études effectuées ces dernières années suggèrent qu’un mauvais sommeil provoque un risque accru d’obésité, car les individus consomment une plus grande quantité de calo… [+3725 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Anissa Boumediene", "title": "Coronavirus : Finalement, les enfants ne seraient pas de grands vecteurs de transmission du Covid-19 - 20 Minutes", "description": "Si au début de l’épidémie de coronavirus en France, les scientifiques ont alerté sur le potentiel contaminant des enfants, ces derniers ne seraient finalement pas de grands vecteurs de diffusion du Covid-19", "url": "https://www.20minutes.fr/sante/2766687-20200423-coronavirus-finalement-enfants-grands-vecteurs-transmission-covid-19", "urlToImage": null, "publishedAt": "2020-04-23T20:08:33Z", "content": "Des enfants entrent dans une école élémentaire (illustration). \r\nIls ne seraient finalement pas si contaminants que ça. Alors quau début de lépidémie de coronavirus, les enfants étaient décrits comme un public largement vecteur de transmission, ce ne serait d… [+6551 chars]"}, {"source": {"id": null, "name": "La-croix.com"}, "author": "Loup Besmond de Senneville", "title": "Coronavirus : l’État s’apprête à réquisitionner les médicaments de réanimation - Journal La Croix", "description": "À partir de lundi 27 avril, l’État devrait prendre la main sur cinq produits indispensables en réanimation. Objectif : « éviter une rupture de stock effective sur le territoire français à court terme », selon une note de la Direction générale de la santé.", "url": "https://www.la-croix.com/France/Coronavirus-lEtat-sapprete-requisitionner-medicaments-reanimation-2020-04-23-1201090855", "urlToImage": null, "publishedAt": "2020-04-23T17:40:02Z", "content": null}, {"source": {"id": null, "name": "Franceantilles.fr"}, "author": null, "title": "Coronavirus. Un nouveau décès et un nouveau cas - Le point sur le Coronavirus en Guadeloupe - France.Antilles.fr Guadeloupe", "description": "Un nouveau d&eacute;c&egrave;s et un nouveau cas confirm&eacute; de coronavirus sont &agrave; d&eacute;plorer, ce jeudi, dans notre archipel. Un homme de 75 ans n'a pas...", "url": "https://www.guadeloupe.franceantilles.fr/actualite/sante/coronavirus/coronavirus-un-nouveau-deces-et-un-nouveau-cas-568834.php", "urlToImage": null, "publishedAt": "2020-04-23T16:36:00Z", "content": "Un nouveau décès et un nouveau cas confirmé de coronavirus sont à déplorer, ce jeudi, dans notre archipel. Un homme de 75 ans n'a pas résisté au virus qui a tué pour la dixième fois chez nous.Un nouveau décès est à déplorer, ce jeudi, ce qui porte à 10 le nom… [+1692 chars]"}, {"source": {"id": null, "name": "Actusoins.com"}, "author": "Rédaction ActuSoins", "title": "L’Ordre des infirmiers demande un recensement du nombre d’infirmiers contaminés et décédés - ActuSoins", "description": "L'ONI réclame un recensement 'dans les plus brefs délais', du nombre d'infirmiers contaminés, hospitalisés ou décédés des suites du Covid-19. L'instance demande aussi que les enfants de professionnels de santé décédés du Covid-19 obtiennent le statut de 'pupi…", "url": "https://www.actusoins.com/329863/lordre-des-infirmiers-demande-un-recensement-du-nombre-dinfirmiers-contamines-et-decedes.html", "urlToImage": null, "publishedAt": "2020-04-23T14:49:07Z", "content": "L'ONI réclame un recensement \"dans les plus brefs délais\", du nombre d'infirmiers contaminés, hospitalisés ou décédés des suites du Covid-19. L'instance demande aussi que les enfants de professionnels de santé décédés du Covid-19 obtiennent le statut de \"pupi… [+3596 chars]"}, {"source": {"id": null, "name": "Futura-sciences.com"}, "author": "Julie Kern", "title": "Coronavirus : les tests sérologiques sont-ils fiables ? - Futura", "description": "Les tests sérologiques, qui permettent de détecter les anticorps créés à la suite d'une infection par le coronavirus, sont encore en développement. Nombre d'entre eux ne remplissent pas le cahier...", "url": "https://www.futura-sciences.com/sante/actualites/coronavirus-coronavirus-tests-serologiques-sont-ils-fiables-80667/", "urlToImage": null, "publishedAt": "2020-04-23T14:31:58Z", "content": "Les tests sérologiques, qui permettent de détecter les anticorps créés à la suite d'une infection par le coronavirus, sont encore en développement. Nombre d'entre eux ne remplissent pas le cahier des charges pour leur homologation. Leur fiabilité, notamment, … [+3070 chars]"}, {"source": {"id": null, "name": "Linternaute.com"}, "author": "Mathilde Saintilan", "title": "Coronavirus : quels symptômes doivent vous alerter ? - Linternaute.com", "description": "Dans 80% des cas, le coronavirus se traduit par des symptômes bénins. Quels sont-ils ? Quand devez-vous vous inquiéter ? Quelles sont les aggravations potentielles de la maladie ?", "url": "https://www.linternaute.com/actualite/guide-vie-quotidienne/2475703-coronavirus-quels-symptomes-doivent-vous-alerter/", "urlToImage": null, "publishedAt": "2020-04-23T13:57:52Z", "content": "Dans 80% des cas, le coronavirus se traduit par des symptômes bénins. Quels sont-ils ? Quand devez-vous vous inquiéter ? Quelles sont les aggravations potentielles de la maladie ? \r\n[Mis à jour le 24 avril 2020 à 11h15] Le nouveau coronavirus est apparu fin 2… [+10722 chars]"}, {"source": {"id": null, "name": "Pourquoidocteur.fr"}, "author": null, "title": "Coronavirus : la Covid-19 n’est pas qu’une infection virale du poumon - Pourquoi Docteur ?", "description": "La Covid-19 désigne la maladie provoquée par le nouveau coronavirus, le SARS-CoV-2. La majorité des formes de cette infection sont bénignes, ou asymptomatiques, mais elle donne aussi des pneumonies potentiellement graves. Si elle a été, au départ, considérée …", "url": "https://www.pourquoidocteur.fr/MaladiesPkoidoc/1176-Coronavirus-Covid-19-n-est-qu-une-infection-virale-poumon", "urlToImage": null, "publishedAt": "2020-04-23T12:17:15Z", "content": "Des mots pour les maux\r\nCovid-19 est un acronyme qui vient de l’agrégation de « Co » pour « Corona », « vi » pour « virus » et « D » pour « Disease » (maladie en anglais). Enfin, le « 19 » est là pour indiquer l’année d’apparition = 2019.\r\nSARS-Cov-2 est le n… [+34022 chars]"}, {"source": {"id": null, "name": "Maxisciences.com"}, "author": "La rédaction", "title": "Confinement : comment compenser le manque de soleil ? - Maxisciences", "description": "La vitamine D, produite par la peau lorsqu'on s'expose au soleil, est un nutriment essentiel à notre organisme. Même confiné, il faut être attentif à ne pas être carencé.…", "url": "https://www.maxisciences.com/sante/confinement-comment-compenser-le-manque-de-soleil_art44430.html", "urlToImage": null, "publishedAt": "2020-04-23T12:11:03Z", "content": "La vitamine D, produite par la peau lorsqu'on s'expose au soleil, est un nutriment essentiel à notre organisme. Même confiné, il faut être attentif à ne pas être carencé. Alors comment faire le plein ?\r\nLa vitamine D est essentielle à notre corps pour la sant… [+3481 chars]"}, {"source": {"id": null, "name": "Theconversation.com"}, "author": "Vincent Marechal", "title": "On a retrouvé le coronavirus dans les eaux usées, et cela pourrait nous aider à mieux suivre l’épidémie - The Conversation FR", "description": "Le 19 avril 2020, des traces du coronavirus étaient retrouvées dans le réseau d’eau non potable de Paris. Le suivi de cette présence pourrait apporter de précieuses informations sur l’épidémie.", "url": "https://theconversation.com/on-a-retrouve-le-coronavirus-dans-les-eaux-usees-et-cela-pourrait-nous-aider-a-mieux-suivre-lepidemie-136970", "urlToImage": null, "publishedAt": "2020-04-23T11:55:00Z", "content": "Lépidémie de Covid-19, due au coronavirus SARS-CoV-2, impressionne à la fois par la rapidité de circulation du virus depuis décembre 2019 et par le nombre de cas rapportés : lorsque lOrganisation mondiale de la Santé a officiellement déclaré létat de pandémie… [+10722 chars]"}, {"source": {"id": null, "name": "Nicematin.com"}, "author": "Nancy Cattan  ncattan@nicematin.fr", "title": "Coronavirus: des scientifiques azuréens identifient les deux types de cellules nasales qui forment les points d'entrée de l'infection - Nice-Matin", "description": "Des scientifiques de la Côte d'Azur ont identifié les deux types de cellules nasales qui forment les points d'infection initiaux.", "url": "https://www.nicematin.com/sante/decouverte-scientifique-majeure-sur-la-cote-dazur-les-cellules-nasales-qui-forment-les-points-dentree-du-covid-19-identifiees-500290", "urlToImage": null, "publishedAt": "2020-04-23T11:22:00Z", "content": "Des médecins et chercheurs azuréens ont participé à la découverte des points d'entrée du coronavirus (SARS -CoV-2) dans l'organisme lors dune infection COVID-19.\r\nEn première ligne dans cette découverte, les équipes de Pascal Barbry, directeur de recherches à… [+644 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Coronavirus : l’usine Sanofi de Lisieux produit du Doliprane à plein régime - Le Parisien", "description": "Le site de Lisieux (Calvados) est l’un des deux seuls en France à produire l’antidouleur. Les ventes ont explosé depuis le début de la crise", "url": "http://www.leparisien.fr/economie/business/coronavirus-l-usine-sanofi-de-lisieux-produit-du-doliprane-a-plein-regime-23-04-2020-8304420.php", "urlToImage": null, "publishedAt": "2020-04-23T10:21:00Z", "content": "Le Calvados ne se cantonne pas aux pommes et au camembert. Il a une autre spécialité : le Doliprane. Depuis 1982, il est fabriqué dans l'usine Sanofi de Lisieux, l'une des deux seules avec le site de Compiègne (Oise) à produire le célèbre médicament à base de… [+2251 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Luca ANDREOLLI", "title": "Coronavirus : une nouvelle découverte inquiétante pour les moins de 40 ans - Télé Loisirs.fr", "description": "Une augmentation significative du nombre d'infectés au Covid-19 victimes d'un AVC a été signalé dans un hôpital de New York. Une étude va prochainement être publiée sur ce nouveau problème lié à la maladie.", "url": "https://www.programme-tv.net/news/societe/253474-coronavirus-une-nouvelle-decouverte-inquietante-pour-les-moins-de-40-ans/", "urlToImage": null, "publishedAt": "2020-04-23T09:43:25Z", "content": "Médecins et scientifiques n'ont de cesse d'en découvrir davantage sur le Covid-19. Chaque jour, de nouveaux symptômes ou des propriétés jusqu'ici inconnues font l'objet d'études poussées et de constats. Le dernier en date, relayé par CNN aux États-Unis, nous … [+1882 chars]"}, {"source": {"id": null, "name": "Sciencepost.fr"}, "author": "Brice Louvet, rédacteur sciences", "title": "Covid-19 : la maladie provoque une inflammation vasculaire systémique qui peut endommager tous les organes - SciencePost", "description": "Des chercheurs ont découvert que le Covid-19 provoque une inflammation des vaisseaux sanguins, ce qui peut entraîner une défaillance des organes vitaux.", "url": "https://sciencepost.fr/covid-19-la-maladie-provoque-une-inflammation-vasculaire-systemique-qui-peut-endommager-tous-les-organes/", "urlToImage": null, "publishedAt": "2020-04-23T07:45:23Z", "content": "En analysant les tissus de patients décédés du Covid-19, des chercheurs ont découvert que la maladie provoque directement une inflammation des vaisseaux sanguins, ce qui peut entraîner une défaillance des organes vitaux, voire la mort.\r\nSi le Covid-19 a, au d… [+2519 chars]"}, {"source": {"id": null, "name": "Ohmymag.com"}, "author": "Marion Mancho", "title": "Coronavirus : les nouveaux symptômes sont la confusion et la perte des repères - Ohmymag", "description": "Hospitalisés, de nombreux patients auraient ressenti de nouveaux symptômes. En plus de la fièvre, de la toux et des maux de tête, les médecins ont observés chez les personnes attei…", "url": "https://www.ohmymag.com/news/coronavirus-les-nouveaux-symptomes-sont-la-confusion-et-la-perte-des-reperes_art135073.html", "urlToImage": null, "publishedAt": "2020-04-23T07:41:00Z", "content": "Hospitalisés, de nombreux patients auraient ressenti de nouveaux symptômes. En plus de la fièvre, de la toux et des maux de tête, les médecins ont observés chez les personnes atteintes du Covid-19 de la confusion et la perte de repères.\r\nÀ lheure actuelle on … [+2053 chars]"}, {"source": {"id": "les-echos", "name": "Les Echos"}, "author": "Elsa Dicharry", "title": "Comment les agents immobiliers préparent la reprise des visites - Les Échos", "description": "Les agences immobilières se préparent à rouvrir progressivement leurs portes à partir du 11 mai, date annoncée du début du déconfinement. Des procédures seront adoptées pour accueillir les clients et organiser les visites de logements en toute sécurité.", "url": "https://www.lesechos.fr/industrie-services/immobilier-btp/coronavirus-comment-les-agents-immobiliers-preparent-la-reprise-des-visites-1197434", "urlToImage": null, "publishedAt": "2020-04-23T07:20:25Z", "content": "Le cap est désormais fixé : à partir du 11 mai, date de fin du confinement, l'activité va pouvoir reprendre progressivement pour les agents immobiliers. La profession s'y prépare, même si toutes les agences ne seront pas ouvertes à cette date ou ne fonctionne… [+567 chars]"}, {"source": {"id": null, "name": "Letemps.ch"}, "author": "Le Temps avec les agences", "title": "[En continu] Covid-19: l'Agence européenne des médicaments met en garde sur la chloroquine - Le Temps", "description": "La chloroquine et l’hydroxychloroquine, promus notamment par Donald Trump comme remèdes au Covid-19, ont des effets secondaires graves, a averti l’Agence européenne des médicaments. Des essais cliniques de vaccins sur des humains sont lancés en Allemagne et e…", "url": "https://www.letemps.ch/node/1206621", "urlToImage": null, "publishedAt": "2020-04-23T06:27:00Z", "content": "Lessentiel\r\nLAgence européenne des médicaments met en garde contre les effets secondaires de la chloroquine et de lhydroxychloroquine, qui peuvent être fatals.\r\nLes crèches rouvriront le 27 avril à Genève.\r\nDes essais cliniques de vaccins devraient démarrer e… [+27118 chars]"}, {"source": {"id": null, "name": "Orange.fr"}, "author": "https://www.facebook.com/orangeactufr", "title": "Journal de bord d'un réanimateur: \"C'est bien de retrouver une activité plus habituelle\" - Actu Orange", "description": "Praticien dans un hôpital de la région parisienne, en première ligne pour traiter la vague de patients atteints par le coronavirus, un anesthésiste-réanimateur livre tous les jours pour l'AFP, sous couvert d'anonymat, le résumé de sa journée en pleine crise s…", "url": "https://actu.orange.fr/france/journal-de-bord-d-un-reanimateur-c-est-bien-de-retrouver-une-activite-plus-habituelle-CNT000001pCZh8.html", "urlToImage": null, "publishedAt": "2020-04-23T05:27:26Z", "content": "AFP, publié le jeudi 23 avril 2020 à 07h27\r\nPraticien dans un hôpital de la région parisienne, en première ligne pour traiter la vague de patients atteints par le coronavirus, un anesthésiste-réanimateur livre tous les jours pour l'AFP, sous couvert d'anonyma… [+1768 chars]"}, {"source": {"id": null, "name": "Lessorsavoyard.fr"}, "author": null, "title": "L'hôpital d'Annecy mesure l'efficacité des traitements du Covid-19 - lessorsavoyard.fr", "description": "A la UNE L'Essor Savoyard . Ne ratez rien de l’actualité locale &régionale. Toute l’actu sportive, faits divers, transports, élections municipales de votre commune.", "url": "https://www.lessorsavoyard.fr/8470/article/2020-04-23/l-hopital-d-annecy-mesure-l-efficacite-des-traitements-du-covid-19", "urlToImage": null, "publishedAt": "2020-04-23T05:00:00Z", "content": "Alors quil nexiste pas encore de remède au coronavirus, le centre hospitalier Annecy Genevois (Change) est en première ligne pour en trouver un. Il fait partie des 29 centres en France intégrés dans un essai clinique baptisé «Discovery». Voici les dessous de … [+400 chars]"}]}