{"status": "ok", "totalResults": 34, "articles": [{"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Coronavirus : les signalements d'effets indésirables des traitements en hausse - RTL.fr", "description": "300 cas d'effets indésirables liés aux traitements testés contre le Covid-19 ont été signalés ces dernières semaines.", "url": "https://www.rtl.fr/actu/bien-etre/coronavirus-les-signalements-d-effets-indesirables-des-traitements-en-hausse-7800442761", "urlToImage": null, "publishedAt": "2020-04-25T19:11:00Z", "content": "\"Au 22 avril 2020, 321 cas d'effets indésirables ont été déclarés en lien avec une infection au Covid-19, dont 80% de cas graves\", détaille l'Agence nationale de sécurité du médicament, qui avait annoncé une centaine de cas le 10 avril.\r\nDans les deux tiers d… [+1763 chars]"}, {"source": {"id": null, "name": "Www.lci.fr"}, "author": "Thomas Deszpot", "title": "La Prevotella, une bactérie intestinale liée à la mortalité du Covid-19 ? Gare aux conclusions hâtives - LCI", "description": "À LA LOUPE – Des messages relayés notamment sur WhatsApp indiquent que le Covid-19 infecterait une bactérie intestinale, la Prevotella, ce qui expliquerait sa mortalité. Les experts se montrent néanmoins très critiques : ils remettent en cause les fondements …", "url": "https://www.lci.fr/sante/coronavirus-la-bacterie-intestinale-prevotella-est-elle-liee-a-la-mortalite-du-virus-covid-19-2151795.html", "urlToImage": null, "publishedAt": "2020-04-25T18:55:39Z", "content": "Santé\r\nÀ LA LOUPE Des messages relayés notamment sur WhatsApp indiquent que le Covid-19 infecterait une bactérie intestinale, la Prevotella, ce qui expliquerait sa mortalité. Les experts se montrent néanmoins très critiques : ils remettent en cause les fondem… [+5093 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Guadeloupe 1ère", "title": "Coronavirus : toujours 149 cas confirmés par test PCR en Guadeloupe, un patient évacué par le Dixmude - Guadel - Outre-mer la 1ère", "description": "Le nombre de cas cumul&eacute;s et confirm&eacute;s par test PCR en Guadeloupe est toujours de 149 cas. Pas de nouveau cas enregistr&eacute; officiellement, selon le dernier bilan communiqu&eacute; pa", "url": "https://la1ere.francetvinfo.fr/guadeloupe/coronavirus-toujours-149-cas-confirmes-par-test-pcr-en-guadeloupe-pas-de-nouveau-cas-826638.html", "urlToImage": null, "publishedAt": "2020-04-25T17:29:25Z", "content": "Selon le dernier bilan publié par l'Agence Régionale de Santé, il n'y a pas de nouveau cas recensé chez nous ces dernières 24h. Le nombre de cas confirmés par test PCR (en données cumulées) en Guadeloupe est toujours de 149.Parmi ces cas confirmés, 12 patient… [+1629 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Réunion 1ère", "title": "Dengue : personnes sont décédées du virus à La Réunion - Réunion la 1ère - Outre-mer la 1ère", "description": "La dengue continue de gagner du terrain &agrave; La R&eacute;union. Trois nouveaux d&eacute;c&egrave;s sont li&eacute;s &agrave; cette &eacute;pid&eacute;mie, ce qui porte &agrave; 4 le nombre de mort", "url": "https://la1ere.francetvinfo.fr/reunion/dengue-personnes-sont-decedees-du-virus-a-la-reunion-826646.html", "urlToImage": null, "publishedAt": "2020-04-25T17:29:07Z", "content": "Lépidémie de dengue a fait 3 nouvelles victimes, portant à 4 le nombre de personnes décédées à cause du virus qui circule activement dans lîle. Selon lAgence Régionale de Santé, ces victimes étaient déjà fragilisées par des pathologies associées.\r\n Les formes… [+2944 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Coronavirus et allergies au pollen : comment différencier les symptômes ? - RTL.fr", "description": "Les allergies au pollen sont de retour. Leurs symptômes peuvent être similaires à ceux du Covid-19, la fièvre et la fatigue en moins.", "url": "https://www.rtl.fr/actu/bien-etre/coronavirus-et-allergies-au-pollen-comment-differencier-les-symptomes-7800442515", "urlToImage": null, "publishedAt": "2020-04-25T16:23:00Z", "content": "Le printemps bat son plein, et avec lui les allergies saisonnières reviennent : une bonne partie du Sud de la France a été placée en alerte orange concernant les pollens de graminées par le Réseau national de surveillance aérobiologique. Problème en cette pér… [+1300 chars]"}, {"source": {"id": null, "name": "Pourquoidocteur.fr"}, "author": null, "title": "Covid-19 : le virus pourrait survivre plus longtemps chez les patients atteints d'une forme grave - Pourquoi Docteur ?", "description": "Une étude réalisée en Chine montre qu’il reste en moyenne 21 jours chez les parents atteints d’une forme sévère, contre 14 jours pour les cas modérés. Ces conclusions présentent toutefois certaines limites. .", "url": "https://www.pourquoidocteur.fr/Articles/Question-d-actu/32257-Covid-19-virus-pourrait-survivre-patients-atteints-d-une-forme-grave", "urlToImage": null, "publishedAt": "2020-04-25T11:30:00Z", "content": "Comment évolue la charge virale chez les patients atteints du Covid-19 ? Selon une étude du British Medical Journal, plus la forme contractée est grave, plus le virus reste longtemps dans l’organisme. La recherche a été réalisée dans un hôpital de la province… [+2260 chars]"}, {"source": {"id": null, "name": "Objectifgard.com"}, "author": "Corentin Corger", "title": "NÎMES Le chef du service cardiologie au CHU : « il ne faut pas être effrayé de venir à l'hôpital - Objectif Gard", "description": "Avec le confinement, certains patients, qui présentent pourtant des urgences cardiaques, attendent ou refusent de se rendre à l'hôpital. Des craintes qui entraînent des dégâts irréversibles voire même", "url": "https://www.objectifgard.com/2020/04/25/nimes-le-chef-du-service-cardiologie-au-chu-il-ne-faut-pas-etre-effraye-de-venir-a-lhopital/", "urlToImage": null, "publishedAt": "2020-04-25T11:00:34Z", "content": "Guillaume Cayla, chef de service de cardiologie au CHU de Nîmes (Photo CHU Carémeau)\r\nAvec le confinement, certains patients, qui présentent pourtant des urgences cardiaques, attendent ou refusent de se rendre à l'hôpital. Des craintes qui entraînent des dégâ… [+5266 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "Pauline Brassart", "title": "Coronavirus : ce qu'il faut savoir dans le Tarn ce week-end - LaDepeche.fr", "description": "Au 40e jour de confinement, on compte 6294 cas confirmés de personnes atteintes du Covid-19 en Occitanie. 18 personnes sont décédées dans le Tarn. Rappel et mise à jour ici des informations importantes.", "url": "https://www.ladepeche.fr/2020/04/25/coronavirus-ce-quil-faut-savoir-dans-le-tarn-ce-week-end,8862415.php", "urlToImage": null, "publishedAt": "2020-04-25T09:57:56Z", "content": "l'essentiel\r\n Au 40e jour de confinement, on compte 6294 cas confirmés de personnes atteintes du Covid-19 en Occitanie. 18 personnes sont décédées dans le Tarn. Rappel et mise à jour ici des informations importantes.\r\n Ce samedi 25 avril dans le Tarn, selon l… [+20808 chars]"}, {"source": {"id": null, "name": "Laprovence.com"}, "author": "La Provence", "title": "L'après-Covid-19 : quand les symptômes persistent - La Provence", "description": "Le Dr Vasseur, médecin hospitalier dans l'unité médico-judiciaire de l'Hôtel-Dieu à Paris - où il reçoit notamment les victimes de coups et de viols - pense avoir contracté le Covid-19 dans l'exercice de ses fonctions. À 64 ans, \"avec un poids de jeune homme\"…", "url": "https://www.laprovence.com/article/sante/5971340/lapres-covid-19-quand-les-symptomes-persistent.html", "urlToImage": null, "publishedAt": "2020-04-25T09:34:31Z", "content": "Le Dr Vasseur, médecin hospitalier dans l'unité médico-judiciaire de l'Hôtel-Dieu à Paris - où il reçoit notamment les victimes de coups et de viols - pense avoir contracté le Covid-19 dans l'exercice de ses fonctions. À 64 ans, \"avec un poids de jeune homme\"… [+6690 chars]"}, {"source": {"id": null, "name": "Slate.fr"}, "author": "Jean-Yves Nau", "title": "Covid-19: les nouvelles et paradoxales vertus de la nicotine | Slate.fr - Slate.fr", "description": "Les personnes qui fument du tabac semblent moins atteintes que la moyenne, mais ces espoirs thérapeutiques laissent redouter de nouveaux risques sanitaires.", "url": "http://www.slate.fr/story/189954/covid-19-nicotine-fumeurs-protection-risques-sanitaires-danger-essais-cliniques-pitie-salpetriere", "urlToImage": null, "publishedAt": "2020-04-25T06:52:00Z", "content": "Temps de lecture: 5 min\r\nAu début de l'épidémie de Covid-19, c'est une simple curiosité statistique. On imagine que les personnes qui fument du tabac encourent plus de risques que la moyenne d'être atteintes, or elles semblent moins exposées vis-à-vis de l'in… [+7826 chars]"}, {"source": {"id": null, "name": "Actu.fr"}, "author": "Thibaut Calatayud", "title": "Coronavirus. Toulouse est-elle prête à accueillir une deuxième vague après le confinement ? - actu.fr", "description": "Au CHU de Toulouse, l'activité liée au Covid-19 continue de baisser. Mais l'arrivée probable d'une seconde vague après le confinement pourrait-elle mettre le CHU en délicatesse ?", "url": "https://actu.fr/occitanie/toulouse_31555/coronavirus-toulouse-prete-accueillir-deuxieme-vague-apres-confinement_33235279.html", "urlToImage": null, "publishedAt": "2020-04-25T06:06:02Z", "content": "L’activité du CHU de Toulouse liée au coronavirus continue de baisser. (©Adobe Stock)\r\n« L’activité Covid continue à décroître, lentement, mais de façon certaine », constate Marc Penaud, le directeur général du CHU de Toulouse. Le plateau observé depuis déjà … [+7028 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": "Collectif", "title": "Traçage numérique : « Pour éviter une seconde crise sanitaire, il faut s'en donner les moyens » - Le Monde", "description": "L’application StopCovid, dont l’usage est basé sur le volontariat et l’anonymat, serait un outil indispensable contre la diffusion du virus, affirme un collectif de scientifiques et professionnels de santé, alors qu’un débat sur le traçage numérique est prévu…", "url": "https://www.lemonde.fr/idees/article/2020/04/25/tracage-numerique-pour-eviter-une-seconde-crise-sanitaire-il-faut-s-en-donner-les-moyens_6037732_3232.html", "urlToImage": null, "publishedAt": "2020-04-25T04:45:18Z", "content": "SERGIO AQUINDO\r\nTribune. Le 11 mai, seule une faible fraction de la population française, aux alentours de 5 %, aura été infectée par le virus SARS-CoV-2. Dimportantes mesures de contrôle de lépidémie resteront nécessaires. Elles sont indispensables pour évit… [+2429 chars]"}, {"source": {"id": null, "name": "Santelog.com"}, "author": null, "title": "COVID-19 : Les compléments alimentaires pour se faire une immunité - santé log", "description": "Face à la pandémie COVID-19 l’accent a été mis sur les stratégies de distanciation et la recherche de vaccins et de traitements. Peu d’études ont encore porté sur les mesures de mode de vie, pratique de l’exercice ou alimentation qui, en boostant notre immuni…", "url": "https://www.santelog.com/actualites/covid-19-les-complements-alimentaires-pour-se-faire-une-immunite", "urlToImage": null, "publishedAt": "2020-04-25T03:03:17Z", "content": "Les enjeux sont énormes, note lauteur principal, Adrian Gombart de l'Institut Linus Pauling de l'OSU : au-delà de lépidémie actuelle, chaque année, la grippe à elle-seule entraîne lhospitalisation de millions de personnes et 2,5 millions de décès dans le mond… [+2994 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Des tests de la chloroquine contre le Covid-19 interrompus pour des raisons de sécurité après plusieurs décès - Sputnik France", "description": "Une équipe de chercheurs qui testait de la chloroquine en tant que traitement du Covid-19 a dû écourter ses travaux après qu’un quart des patients ayant pris cet...", "url": "https://fr.sputniknews.com/sci_tech/202004241043649413-des-tests-de-la-chloroquine-contre-le-covid-19-interrompus-pour-des-raisons-de-securite-apres/", "urlToImage": null, "publishedAt": "2020-04-24T21:15:58Z", "content": "Une équipe de chercheurs qui testait de la chloroquine en tant que traitement du Covid-19 a dû écourter ses travaux après quun quart des patients ayant pris cet antipaludéen sont décédés, selon les résultats de létude publiés dans le Journal de l'American Med… [+3394 chars]"}, {"source": {"id": null, "name": "Tdg.ch"}, "author": "Rédaction NXP", "title": "Direct- Légère hausse des cas de Covid-19 en 24h - Tribune de Genève", "description": "Retrouvez toutes les informations en direct sur l'évolution de la pandémie du Covid-19.", "url": "https://tdg.ch/24581768", "urlToImage": null, "publishedAt": "2020-04-24T18:52:00Z", "content": null}, {"source": {"id": null, "name": "Metrotime.be"}, "author": null, "title": "Des chercheurs belges tentent de bloquer la phase inflammatoire du Covid-19 - Metro Belgique", "description": "Des essais cliniques visant à bloquer la phase inflammatoire du Covid-19, où les cas sont les plus graves, sont coordonnés par l'hôpital universitaire de Gand depuis début avril. Les résultats sont encourageants.", "url": "https://fr.metrotime.be/2020/04/24/must-read/des-chercheurs-belges-tentent-de-bloquer-la-phase-inflammatoire-du-covid-19/", "urlToImage": null, "publishedAt": "2020-04-24T17:17:55Z", "content": "Des essais cliniques visant à bloquer la phase inflammatoire du Covid-19, où les cas sont les plus graves, sont coordonnés par lhôpital universitaire de Gand depuis début avril. Les résultats sont encourageants. Le dosage de certaines protéines permet de déte… [+1695 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Sébastien Bouwy", "title": "Coronavirus : la colère des soignants de l'hôpital de Périgueux incriminés par l'ARS après la contaminati - France 3 Régions", "description": "La contamination de 18 patients et d'une vingtaine de soignants d'un service de l'hôpital de Périgueux a du mal à passer. Hier, la directrice de l'ARS pour la Dordogne a indiqué que la propagation du virus était sans doute liée à un relâchement du personnel s…", "url": "https://france3-regions.francetvinfo.fr/nouvelle-aquitaine/dordogne/perigueux/coronavirus-colere-soignants-hopital-perigueux-incrimines-ars-apres-contamination-service-1820446.html", "urlToImage": null, "publishedAt": "2020-04-24T16:56:12Z", "content": "Le foyer épidémique qui s'est développé dans le service de soins de suite et de réadaptation du centre hospitalier de Périgueux ne lasse pas d'interroger. 18 patients et une vingtaine de soignants ont été testés positifs au Covid-19.Hier jeudi, la directrice … [+2950 chars]"}, {"source": {"id": null, "name": "Futura-sciences.com"}, "author": "Éléonore Solé", "title": "D'étranges chauves-souris porteuses de coronavirus - Futura", "description": "Les chauves-souris seraient plus douées que d'autres pour transmettre des virus à la population humaine. Pourtant, ces espèces sont peu connues des scientifiques. Un manque que des chercheurs ont...", "url": "https://www.futura-sciences.com/planete/actualites/chauve-souris-etranges-chauves-souris-porteuses-coronavirus-80721/", "urlToImage": null, "publishedAt": "2020-04-24T16:18:17Z", "content": "Les chauves-souris seraient plus douées que d'autres pour transmettre des virus à la population humaine. Pourtant, ces espèces sont peu connues des scientifiques. Un manque que des chercheurs ont contribué à combler en se penchant sur les chauve-souris à nez … [+3036 chars]"}, {"source": {"id": null, "name": "Trustmyscience.com"}, "author": null, "title": "Coronavirus : Des chercheurs auraient découvert les types de cellules humaines les plus vulnérables - Trust My Science", "description": "554 Partages Des scientifiques ont découvert quels types de cellules du corps humain sont les plus susceptibles d’être infectées par le nouveau coronavirus SARS-CoV-2, en identifiant les cibles pour le pathogène en fonction des types de protéines produites pa…", "url": "https://trustmyscience.com/covid-19-scientifiques-decouvert-types-cellules-humaines-plus-vulnerables/", "urlToImage": null, "publishedAt": "2020-04-24T16:15:17Z", "content": "Des scientifiques ont découvert quels types de cellules du corps humain sont les plus susceptibles dêtre infectées par le nouveau coronavirus SARS-CoV-2, en identifiant les cibles pour le pathogène en fonction des types de protéines produites par les cellules… [+5315 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "Cyrille Marqué", "title": "Covid-19 : beaucoup de décès dans les Ehpad des Hautes-Pyrénées - LaDepeche.fr", "description": "Les Hautes-Pyrénées sont le 3e département d'Occitanie concernant le nombre de décès dans les Ehpad.", "url": "https://www.ladepeche.fr/2020/04/24/covid-19-beaucoup-de-deces-dans-les-ehpad-des-hautes-pyrenees,8861324.php", "urlToImage": null, "publishedAt": "2020-04-24T15:39:07Z", "content": "l'essentiel\r\n Les Hautes-Pyrénées sont le 3e département d'Occitanie concernant le nombre de décès dans les Ehpad. \r\n Jeudi, l’agence nationale Santé publique France a publié son bulletin sur le point épidémiologique sur le Covid-19. Du 1er mars au 20 avril, … [+1035 chars]"}, {"source": {"id": null, "name": "Linternaute.com"}, "author": "Mathilde Ledroit", "title": "Remdesivir et coronavirus : un usage peu efficace, voire dangereux ? - Linternaute.com", "description": "Dans la lutte contre le Covid-19, le Remdesivir a été cité parmi les traitements potentiels. Pourtant, des essais cliniques démontrent des effets secondaires importants, qui peuvent s'avérer dangereux.", "url": "https://www.linternaute.com/actualite/guide-vie-quotidienne/2491649-remdesivir-et-kaletra-des-remedes-au-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-24T12:49:16Z", "content": "Dans la lutte contre le Covid-19, le Remdesivir a été cité parmi les traitements potentiels. Pourtant, des essais cliniques démontrent des effets secondaires importants, qui peuvent s'avérer dangereux. \r\n[Mis à jours le 24 avril 2020 à 14h45] Cela fait plusie… [+5860 chars]"}, {"source": {"id": null, "name": "Agoravox.fr"}, "author": null, "title": "Partir ou revenir en fumée ? - AgoraVox", "description": "Le professeur Jean-François Delfraissy, président du conseil scientifique du gouvernement, s'interroge lui aussi sur un possible rôle positif de la nicotine pour lutter contre le coronavirus, et se demande si « le tabac protégerait contre ce virus, via la nic…", "url": "https://www.agoravox.fr/actualites/sante/article/partir-ou-revenir-en-fumee-223608", "urlToImage": null, "publishedAt": "2020-04-24T11:28:19Z", "content": "On se souvient de ces paquets de cigarette ornés d’une tête de mort, ornés de la mention « fumer tue »...\r\nSurprise, d’après plusieurs scientifiques, la cigarette pourrait guérir du tristement célèbre coronavirus.\r\nBien évidemment, cette affirmation amènera u… [+8018 chars]"}, {"source": {"id": null, "name": "Www.rfi.fr"}, "author": "Caroline Paré, Ophélie Lahccen", "title": "Covid-19: porteurs du VIH et anciens malades de la tuberculose doivent être très vigilants - RFI", "description": "La présence d'autres pathologies augmente le risque de complications chez un patient atteint du nouveau coronavirus. D'où l'importance pour les porteurs du VIH ou les anciens tuberculeux de redoubler de vigilance. Entretien.", "url": "http://www.rfi.fr/fr/afrique/20200424-covid-19-porteurs-vih-et-anciens-malades-la-tuberculose-doivent-%C3%AAtre-tr%C3%A8s-vigilants", "urlToImage": null, "publishedAt": "2020-04-24T11:10:00Z", "content": "La présence d'autres pathologies augmente le risque de complications chez un patient atteint du nouveau coronavirus. D'où l'importance pour les porteurs du VIH ou les anciens tuberculeux de redoubler de vigilance. Entretien.\r\n Le professeur Jean-Marie Kayembe… [+4630 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "La rédaction", "title": "Souillac : les gendarmes interceptent un conducteur ivre et sans attestation - LaDepeche.fr", "description": "", "url": "https://www.ladepeche.fr/2020/04/24/souillac-les-gendarmes-interceptent-un-conducteur-ivre-et-sans-attestation,8860901.php", "urlToImage": null, "publishedAt": "2020-04-24T11:00:24Z", "content": "De jour, comme de nuit, les contrôles pour le respect des mesures de confinement se poursuivent sur l'ensemble du département du Lot. Ce jeudi 23 avril, à 22 heures 40, les gendarmes de la communauté de brigades de Souillac procèdent au contrôle d'un automobi… [+536 chars]"}, {"source": {"id": null, "name": "Ulyces.co"}, "author": null, "title": "Israël lance des essais cliniques pour soigner le Covid-19 avec du cannabis - Ulyces", "description": "Des cher­cheurs israé­liens pensent que les proprié­tés anti-inflam­ma­toires du canna­bis pour­raient sauver des vies dans la lutte contre le Covid-19. Des essais cliniques ont donc été lancés pour essayer de trai­ter le virus à l’aide de canna­bis, rappor­t…", "url": "https://www.ulyces.co/news/israel-lance-des-essais-cliniques-pour-soigner-le-covid-19-avec-du-cannabis/", "urlToImage": null, "publishedAt": "2020-04-24T10:45:03Z", "content": "par   Denis Hadzovic   | 24 avril 2020 Des cher­cheurs israé­liens pensent que les proprié­tés anti-inflam­ma­toires du canna­bis pour­raient sauver des vies dans la lutte contre le Covid-19. Des essais cliniques ont donc été lancés pour essayer de trai­ter l… [+1887 chars]"}, {"source": {"id": "les-echos", "name": "Les Echos"}, "author": "Alexandre Rousset", "title": "Coronavirus et allergies : comment distinguer les symptômes - Les Échos", "description": "La saison des pollens étant ouverte, de nombreux Français craignent de ne pas faire la différence entre une banale crise allergique et une infection au Covid-19. Si certains symptômes peuvent être similaires, d'autres permettent de différencier les deux patho…", "url": "https://www.lesechos.fr/industrie-services/pharmacie-sante/coronavirus-et-allergies-comment-distinguer-les-symptomes-1197888", "urlToImage": null, "publishedAt": "2020-04-24T10:39:05Z", "content": "Nez qui coule, yeux irrités, difficultés à respirer Comme chaque année, le printemps est synonyme d'allergies pour des millions de Français. Mais ce rendez-vous annuel prend une nouvelle dimension en 2020, alors que le pays, comme le monde entier, doit faire … [+4649 chars]"}, {"source": {"id": null, "name": "Centre-presse.fr"}, "author": null, "title": "La Vienne en vigilance rouge au moustique tigre - Centre Presse", "description": "Vigilance-moustiques, premier site d'information actualisée sur les moustiques en France, publie sa carte 2020 du moustique tigre. Épargné j", "url": "https://www.centre-presse.fr/article-739546-la-vienne-en-vigilance-rouge-au-moustique-tigre.html", "urlToImage": null, "publishedAt": "2020-04-24T09:47:51Z", "content": "A quelques jours du lancement du plan anti-dissémination d'arboviroses par la Direction générale de la Santé, Vigilance-moustiques vient de publier ce vendredi 24 avril, sa carte 2020 du moustique tigre. Avec six nouveaux départements en vigilance rouge, dont… [+1234 chars]"}, {"source": {"id": null, "name": "Linternaute.com"}, "author": "Mathilde Saintilan", "title": "Coronavirus : quels symptômes doivent vous alerter ? - Linternaute.com", "description": "Dans 80% des cas, le coronavirus se traduit par des symptômes bénins. Quels sont-ils ? Quand devez-vous vous inquiéter ? Quelles sont les aggravations potentielles de la maladie ?", "url": "https://www.linternaute.com/actualite/guide-vie-quotidienne/2475703-coronavirus-quels-symptomes-doivent-vous-alerter/", "urlToImage": null, "publishedAt": "2020-04-24T09:20:26Z", "content": "Dans 80% des cas, le coronavirus se traduit par des symptômes bénins. Quels sont-ils ? Quand devez-vous vous inquiéter ? Quelles sont les aggravations potentielles de la maladie ? \r\n[Mis à jour le 24 avril 2020 à 11h15] Le nouveau coronavirus est apparu fin 2… [+10722 chars]"}, {"source": {"id": null, "name": "Pourquoidocteur.fr"}, "author": null, "title": "Obésité : on en sait plus sur le lien entre manque de sommeil et prise de poids - Pourquoi Docteur ?", "description": "D'après une nouvelle étude, l'excès de poids pourrait favoriser un mauvais sommeil et non pas le contraire, contrairement à ce qui a souvent été avancé. .", "url": "https://www.pourquoidocteur.fr/Articles/Question-d-actu/32263-Obesite-sait-lien-manque-sommeil-prise-de-poids", "urlToImage": null, "publishedAt": "2020-04-24T09:15:00Z", "content": "<ul><li> Le lien entre mauvais sommeil et prise de poids a déjà été établi</li><li> Une nouvelle étude suggère que c'est le surpoids qui entraînerait un mauvais sommeil et non l'inverse</li></ul>\r\nIl a été prouvé à maintes reprises qu’un mauvais sommeil favor… [+4957 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus : la maladie peut-elle se transmettre lors des relations sexuelles ? - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_4db7bbd4-e26a-4c8f-8fa9-a939b058f083&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-24T08:14:00Z", "content": "Yahoo fait partie de Verizon Media. Cliquez sur J'accepte afin dautoriser Verizon Media et ses partenaires à utiliser des cookies et des technologies similaires pour accéder à votre appareil, utiliser vos données (y compris votre position géographique), compr… [+596 chars]"}, {"source": {"id": null, "name": "Atlantico.fr"}, "author": null, "title": "Covid-19 : tour du monde des pistes de traitements potentiels - Atlantico.fr", "description": "Alors que de nombreux pays à travers la planète préparent et travaillent activement sur la phase du déconfinement, le Dr Stéphane Gayet revient sur les pistes de traitements contre le Covid-19 et notamment sur les vaccins ou sur la solution du...", "url": "https://www.atlantico.fr/decryptage/3589060/covid-19--tour-du-monde-des-pistes-de-traitements-potentiels-hydroxychloroquine-didier-raoult-vaccin-coronavirus-stephane-gayet", "urlToImage": null, "publishedAt": "2020-04-24T06:37:14Z", "content": "Atlantico.fr : Que savons-nous aujourd'hui des pistes de traitements du CoVid-19 ?\r\nAntiviraux et antibiotiques : deux classes thérapeutiques sans aucun point commun\r\nStéphane Gayet : On parle bien ici de médicaments qui agissent in vivo, c'est-à-dire dans no… [+20179 chars]"}, {"source": {"id": null, "name": "Orange.fr"}, "author": "https://www.facebook.com/orangeactufr", "title": "Dengue + coronavirus = bombe à retardement pour les hôpitaux d'Amérique centrale - Actu Orange", "description": "Les systèmes de santé d'Amérique centrale, déjà confrontés au nouveau coronavirus, sont maintenant sous la menace supplémentaire d'une flambée de dengue avec l'arrivée de la saison des pluies.", "url": "https://actu.orange.fr/societe/sante/dengue-coronavirus-bombe-a-retardement-pour-les-hopitaux-d-amerique-centrale-CNT000001pFNhs.html", "urlToImage": null, "publishedAt": "2020-04-24T06:07:00Z", "content": "AFP, publié le vendredi 24 avril 2020 à 08h07\r\nLes systèmes de santé d'Amérique centrale, déjà confrontés au nouveau coronavirus, sont maintenant sous la menace supplémentaire d'une flambée de dengue avec l'arrivée de la saison des pluies.\r\nPlus de 23.000 cas… [+4069 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "41% des élèves et enseignants d'un lycée infectés - cafepedagogique.net", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiXWh0dHA6Ly93d3cuY2FmZXBlZGFnb2dpcXVlLm5ldC9sZXhwcmVzc28vUGFnZXMvMjAyMC8wNC8yNDA0MjAyMEFydGljbGU2MzcyMzMxMTM0NDk5NzU5MTMuYXNweNIBAA?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T06:00:32Z", "content": null}, {"source": {"id": null, "name": "Journaldesfemmes.fr"}, "author": "Lise  Lafaurie et Aurélie Blaize", "title": "Gestes barrières anti coronavirus : \"pour longtemps en France\" - Journal des femmes", "description": "Les mesures barrières et de distanciation physique et sociale seront toujours d'actualité au mois de mai, et sans doute au mois de juin et cet été et peut-être pour longtemps en France. Quels sont ces gestes barrières ? Comment bien les appliquer et qui en pr…", "url": "https://sante.journaldesfemmes.fr/fiches-maladies/2619739-gestes-barrieres-coronavirus-covid-19-oms-deconfinement-duree-france-mai-juin/", "urlToImage": null, "publishedAt": "2020-04-23T18:42:26Z", "content": "Les mesures barrières et de distanciation physique et sociale seront toujours d'actualité au mois de mai, et sans doute au mois de juin et cet été et peut-être pour longtemps en France. Quels sont ces gestes barrières ? Comment bien les appliquer et qui en pr… [+7074 chars]"}]}