{"status": "ok", "totalResults": 28, "articles": [{"source": {"id": null, "name": "Linternaute.com"}, "author": "Martin Lemaire", "title": "DIRECT. Coronavirus en France : les personnes guéries sont-elle immunisées ? - Linternaute.com", "description": "CORONAVIRUS. L'alerte de l'OMS sur l'efficacité des anticorps a remis en cause la stratégie de plusieurs pays dans la lutte contre le coronavirus et douché les espoirs de ceux qui visent l'immunité collective pour se sortir de l'épidémie. Suivez toutes les in…", "url": "https://www.linternaute.com/actualite/guide-vie-quotidienne/2462477-direct-coronavirus-en-france-les-personnes-gueries-sont-elle-immunisees/", "urlToImage": null, "publishedAt": "2020-04-26T08:25:14Z", "content": "CORONAVIRUS. L'alerte de l'OMS sur l'efficacité des anticorps a remis en cause la stratégie de plusieurs pays dans la lutte contre le coronavirus et douché les espoirs de ceux qui visent l'immunité collective pour se sortir de l'épidémie. Suivez toutes les in… [+8648 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "En quoi le smartphone peut être dangereux pendant la pandémie? La réponse d’un spécialiste - Sputnik France", "description": "L’usage constant de son smartphone pendant le confinement peut affecter la santé, dont la vue et la posture, et augmenter le risque d’infection par des microbes qui s’y...", "url": "https://fr.sputniknews.com/societe/202004261043654346-en-quoi-le-smartphone-peut-etre-dangereux-pendant-la-pandemie-la-reponse-dun-specialiste/", "urlToImage": null, "publishedAt": "2020-04-26T07:49:55Z", "content": null}, {"source": {"id": null, "name": "Actu.fr"}, "author": "Thibaut Calatayud", "title": "Coronavirus. Âge, poids, sexe… Quel est le profil des malades accueillis par le CHU de Toulouse ? - actu.fr", "description": "Au CHU de Toulouse, à quoi ressemble le patient-type atteint du Covid-19 ? Âge, poids, sexe de la personne... Des tendances se dessinent. On fait le point.", "url": "https://actu.fr/occitanie/toulouse_31555/coronavirus-age-poids-sexe-est-profil-malades-accueillis-chu-toulouse_33243693.html", "urlToImage": null, "publishedAt": "2020-04-26T06:08:01Z", "content": "Nous ne sommes pas tous égaux face au coronavirus selon le CHU de Toulouse. (©Adobe stock)\r\nNous ne sommes pas tous égaux face au coronavirus. Alors que la lutte contre l’épidémie de Covid-19 se poursuit, le CHU de Toulouse a pu définir quels étaient les pati… [+4528 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": "Paul Benkimoun, Chloé Hecketsweiler", "title": "Coronavirus : masques, travail, écoles, transports… Le conseil scientifique très prudent sur les conditions du déconfinement - Le Monde", "description": "Dans son sixième avis, le cercle d’experts pose plusieurs conditions à cette nouvelle étape. Il insiste sur le risque de rebond en cas de relâchement trop soudain des mesures de contrôle.", "url": "https://www.lemonde.fr/planete/article/2020/04/25/coronavirus-masques-systematiques-teletravail-ecoles-le-conseil-scientifique-recommande-une-strategie-nationale-pour-le-deconfinement_6037781_3244.html", "urlToImage": null, "publishedAt": "2020-04-25T21:30:23Z", "content": "Des enfants jouent au tennis dans les rues désertées de Paris, le 21 avril. CHRISTOPHE ARCHAMBAULT / AFP\r\nA quelles conditions le confinement pourra-t-il être levé ? Quelle stratégie mettre en uvre pour éviter un rebond de lépidémie de Covid-19 ? Voilà les qu… [+2211 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Coronavirus : les signalements d'effets indésirables des traitements en hausse - RTL.fr", "description": "300 cas d'effets indésirables liés aux traitements testés contre le Covid-19 ont été signalés ces dernières semaines.", "url": "https://www.rtl.fr/actu/bien-etre/coronavirus-les-signalements-d-effets-indesirables-des-traitements-en-hausse-7800442761", "urlToImage": null, "publishedAt": "2020-04-25T19:11:00Z", "content": "\"Au 22 avril 2020, 321 cas d'effets indésirables ont été déclarés en lien avec une infection au Covid-19, dont 80% de cas graves\", détaille l'Agence nationale de sécurité du médicament, qui avait annoncé une centaine de cas le 10 avril.\r\nDans les deux tiers d… [+1763 chars]"}, {"source": {"id": null, "name": "Www.rts.ch"}, "author": null, "title": "Des bracelets biométriques testés au Liechtenstein pour détecter le coronavirus - RTS.ch", "description": "Le Liechtenstein veut contrôler l'épidémie de Covid-19 sur son territoire en équipant ses habitants de bracelets biométriques. Quelque 2000 volontaires participent à cette étude destinée à détecter les signes précoces d'infection.", "url": "https://www.rts.ch/info/monde/11273984-des-bracelets-biometriques-testes-au-liechtenstein-pour-detecter-le-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-25T19:00:37Z", "content": "Ces bracelets biométriques mesurent la température corporelle, le pouls et la fréquence de la respiration, ainsi que le débit sanguin et la variabilité du rythme cardiaque pendant le sommeil.\r\nUn bracelet développé à l'origine pour observer les cycles de fert… [+1002 chars]"}, {"source": {"id": null, "name": "Www.lci.fr"}, "author": "Thomas Deszpot", "title": "La Prevotella, une bactérie intestinale liée à la mortalité du Covid-19 ? Gare aux conclusions hâtives - LCI", "description": "À LA LOUPE – Des messages relayés notamment sur WhatsApp indiquent que le Covid-19 infecterait une bactérie intestinale, la Prevotella, ce qui expliquerait sa mortalité. Les experts se montrent néanmoins très critiques : ils remettent en cause les fondements …", "url": "https://www.lci.fr/sante/coronavirus-la-bacterie-intestinale-prevotella-est-elle-liee-a-la-mortalite-du-virus-covid-19-2151795.html", "urlToImage": null, "publishedAt": "2020-04-25T18:55:39Z", "content": "Santé\r\nÀ LA LOUPE Des messages relayés notamment sur WhatsApp indiquent que le Covid-19 infecterait une bactérie intestinale, la Prevotella, ce qui expliquerait sa mortalité. Les experts se montrent néanmoins très critiques : ils remettent en cause les fondem… [+5093 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Guadeloupe 1ère", "title": "Coronavirus : toujours 149 cas confirmés par test PCR en Guadeloupe, un patient évacué par le Dixmude - Guadel - Outre-mer la 1ère", "description": "Le nombre de cas cumul&eacute;s et confirm&eacute;s par test PCR en Guadeloupe est toujours de 149 cas. Pas de nouveau cas enregistr&eacute; officiellement, selon le dernier bilan communiqu&eacute; pa", "url": "https://la1ere.francetvinfo.fr/guadeloupe/coronavirus-toujours-149-cas-confirmes-par-test-pcr-en-guadeloupe-pas-de-nouveau-cas-826638.html", "urlToImage": null, "publishedAt": "2020-04-25T17:29:25Z", "content": "Selon le dernier bilan publié par l'Agence Régionale de Santé, il n'y a pas de nouveau cas recensé chez nous ces dernières 24h. Le nombre de cas confirmés par test PCR (en données cumulées) en Guadeloupe est toujours de 149.Parmi ces cas confirmés, 12 patient… [+1629 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Réunion 1ère", "title": "Dengue : personnes sont décédées du virus à La Réunion - Réunion la 1ère - Outre-mer la 1ère", "description": "La dengue continue de gagner du terrain &agrave; La R&eacute;union. Trois nouveaux d&eacute;c&egrave;s sont li&eacute;s &agrave; cette &eacute;pid&eacute;mie, ce qui porte &agrave; 4 le nombre de mort", "url": "https://la1ere.francetvinfo.fr/reunion/dengue-personnes-sont-decedees-du-virus-a-la-reunion-826646.html", "urlToImage": null, "publishedAt": "2020-04-25T17:29:07Z", "content": "Lépidémie de dengue a fait 3 nouvelles victimes, portant à 4 le nombre de personnes décédées à cause du virus qui circule activement dans lîle. Selon lAgence Régionale de Santé, ces victimes étaient déjà fragilisées par des pathologies associées.\r\n Les formes… [+2944 chars]"}, {"source": {"id": null, "name": "Pourquoidocteur.fr"}, "author": null, "title": "La grippe saisonnière terminée, le développement du prochain vaccin en question - Pourquoi Docteur ?", "description": "Le confinement engendré par la pandémie de coronavirus a prématurément mis fin à l'épidémie de grippe saisonnière en Europe. Une situation qui pourrait pénaliser le développement d'un vaccin pour l’année prochaine..", "url": "https://www.pourquoidocteur.fr/Articles/Question-d-actu/32226-La-grippe-saisonniere-terminee-developpement-prochain-vaccin-question", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "La lutte contre le coronavirus a conduit au confinement massif de la population, mettant parallèlement fin à l’épidémie de grippe saisonnière en Europe. Durant l’hiver 2017-2018, elle a causé la mort de 152 000 personnes en Europe, soit plus que le Covid-19 q… [+2206 chars]"}, {"source": {"id": null, "name": "Pourquoidocteur.fr"}, "author": null, "title": "Covid-19 : le virus pourrait survivre plus longtemps chez les patients atteints d'une forme grave - Pourquoi Docteur ?", "description": "Une étude réalisée en Chine montre qu’il reste en moyenne 21 jours chez les parents atteints d’une forme sévère, contre 14 jours pour les cas modérés. Ces conclusions présentent toutefois certaines limites. .", "url": "https://www.pourquoidocteur.fr/Articles/Question-d-actu/32257-Covid-19-virus-pourrait-survivre-patients-atteints-d-une-forme-grave", "urlToImage": null, "publishedAt": "2020-04-25T11:30:00Z", "content": "Comment évolue la charge virale chez les patients atteints du Covid-19 ? Selon une étude du British Medical Journal, plus la forme contractée est grave, plus le virus reste longtemps dans l’organisme. La recherche a été réalisée dans un hôpital de la province… [+2260 chars]"}, {"source": {"id": null, "name": "Objectifgard.com"}, "author": "Corentin Corger", "title": "NÎMES Le chef du service cardiologie au CHU : « il ne faut pas être effrayé de venir à l'hôpital - Objectif Gard", "description": "Avec le confinement, certains patients, qui présentent pourtant des urgences cardiaques, attendent ou refusent de se rendre à l'hôpital. Des craintes qui entraînent des dégâts irréversibles voire même", "url": "https://www.objectifgard.com/2020/04/25/nimes-le-chef-du-service-cardiologie-au-chu-il-ne-faut-pas-etre-effraye-de-venir-a-lhopital/", "urlToImage": null, "publishedAt": "2020-04-25T11:00:34Z", "content": "Guillaume Cayla, chef de service de cardiologie au CHU de Nîmes (Photo CHU Carémeau)\r\nAvec le confinement, certains patients, qui présentent pourtant des urgences cardiaques, attendent ou refusent de se rendre à l'hôpital. Des craintes qui entraînent des dégâ… [+5266 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "Pauline Brassart", "title": "Coronavirus : ce qu'il faut savoir dans le Tarn ce week-end - LaDepeche.fr", "description": "Au 40e jour de confinement, on compte 6294 cas confirmés de personnes atteintes du Covid-19 en Occitanie. 18 personnes sont décédées dans le Tarn. Rappel et mise à jour ici des informations importantes.", "url": "https://www.ladepeche.fr/2020/04/25/coronavirus-ce-quil-faut-savoir-dans-le-tarn-ce-week-end,8862415.php", "urlToImage": null, "publishedAt": "2020-04-25T09:57:56Z", "content": "l'essentiel\r\n Au 40e jour de confinement, on compte 6294 cas confirmés de personnes atteintes du Covid-19 en Occitanie. 18 personnes sont décédées dans le Tarn. Rappel et mise à jour ici des informations importantes.\r\n Ce samedi 25 avril dans le Tarn, selon l… [+20808 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Jennifer Alberts", "title": "Coronavirus - L'Institut Pasteur étend son étude épidémiologique à Crépy-en-Valois aux enfants de 5 à 1 - France 3 Régions", "description": "Après une première étude épidémiologique fin mars auprès de 661 personnes reliées au lycée Jean-Monnet de Crépy-en-Valois dans l'Oise, l'Institut Pasteur va tester les 5-12 ans scolarisés dans la commune. Le but : comprendre comment elle est devenue le coeur …", "url": "https://france3-regions.francetvinfo.fr/hauts-de-france/oise/coronavirus-institut-pasteur-etend-son-etude-epidemiologiste-aux-enfants-5-12-ans-crepy-valois-1820800.html", "urlToImage": null, "publishedAt": "2020-04-25T09:36:36Z", "content": "Groupe CORSER-2. C'est le nom de la deuxième phase de l'étude épidémiologique de l'Institut Pasteur à Crépy-en-Valois dans l'Oise. Cette fois-ci, ce sont les enfants de 5 à 12 ans, scolarisés dans la commune, et leurs parents qui sont ciblés, après avoir test… [+4089 chars]"}, {"source": {"id": null, "name": "Laprovence.com"}, "author": "La Provence", "title": "L'après-Covid-19 : quand les symptômes persistent - La Provence", "description": "Le Dr Vasseur, médecin hospitalier dans l'unité médico-judiciaire de l'Hôtel-Dieu à Paris - où il reçoit notamment les victimes de coups et de viols - pense avoir contracté le Covid-19 dans l'exercice de ses fonctions. À 64 ans, \"avec un poids de jeune homme\"…", "url": "https://www.laprovence.com/article/sante/5971340/lapres-covid-19-quand-les-symptomes-persistent.html", "urlToImage": null, "publishedAt": "2020-04-25T09:34:31Z", "content": "Le Dr Vasseur, médecin hospitalier dans l'unité médico-judiciaire de l'Hôtel-Dieu à Paris - où il reçoit notamment les victimes de coups et de viols - pense avoir contracté le Covid-19 dans l'exercice de ses fonctions. À 64 ans, \"avec un poids de jeune homme\"… [+6690 chars]"}, {"source": {"id": null, "name": "Slate.fr"}, "author": "Jean-Yves Nau", "title": "Covid-19: les nouvelles et paradoxales vertus de la nicotine | Slate.fr - Slate.fr", "description": "Les personnes qui fument du tabac semblent moins atteintes que la moyenne, mais ces espoirs thérapeutiques laissent redouter de nouveaux risques sanitaires.", "url": "http://www.slate.fr/story/189954/covid-19-nicotine-fumeurs-protection-risques-sanitaires-danger-essais-cliniques-pitie-salpetriere", "urlToImage": null, "publishedAt": "2020-04-25T06:52:00Z", "content": "Temps de lecture: 5 min\r\nAu début de l'épidémie de Covid-19, c'est une simple curiosité statistique. On imagine que les personnes qui fument du tabac encourent plus de risques que la moyenne d'être atteintes, or elles semblent moins exposées vis-à-vis de l'in… [+7826 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Des tests de la chloroquine contre le Covid-19 interrompus pour des raisons de sécurité après plusieurs décès - Sputnik France", "description": "Une équipe de chercheurs qui testait de la chloroquine en tant que traitement du Covid-19 a dû écourter ses travaux après qu’un quart des patients ayant pris cet...", "url": "https://fr.sputniknews.com/sci_tech/202004241043649413-des-tests-de-la-chloroquine-contre-le-covid-19-interrompus-pour-des-raisons-de-securite-apres/", "urlToImage": null, "publishedAt": "2020-04-24T21:15:58Z", "content": "Une équipe de chercheurs qui testait de la chloroquine en tant que traitement du Covid-19 a dû écourter ses travaux après quun quart des patients ayant pris cet antipaludéen sont décédés, selon les résultats de létude publiés dans le Journal de l'American Med… [+3394 chars]"}, {"source": {"id": null, "name": "Tdg.ch"}, "author": "Rédaction NXP", "title": "Direct- Légère hausse des cas de Covid-19 en 24h - Tribune de Genève", "description": "Retrouvez toutes les informations en direct sur l'évolution de la pandémie du Covid-19.", "url": "https://tdg.ch/24581768", "urlToImage": null, "publishedAt": "2020-04-24T18:52:00Z", "content": null}, {"source": {"id": null, "name": "Metrotime.be"}, "author": null, "title": "Des chercheurs belges tentent de bloquer la phase inflammatoire du Covid-19 - Metro Belgique", "description": "Des essais cliniques visant à bloquer la phase inflammatoire du Covid-19, où les cas sont les plus graves, sont coordonnés par l'hôpital universitaire de Gand depuis début avril. Les résultats sont encourageants.", "url": "https://fr.metrotime.be/2020/04/24/must-read/des-chercheurs-belges-tentent-de-bloquer-la-phase-inflammatoire-du-covid-19/", "urlToImage": null, "publishedAt": "2020-04-24T17:17:55Z", "content": "Des essais cliniques visant à bloquer la phase inflammatoire du Covid-19, où les cas sont les plus graves, sont coordonnés par lhôpital universitaire de Gand depuis début avril. Les résultats sont encourageants. Le dosage de certaines protéines permet de déte… [+1695 chars]"}, {"source": {"id": null, "name": "Trustmyscience.com"}, "author": null, "title": "Coronavirus : Des chercheurs auraient découvert les types de cellules humaines les plus vulnérables - Trust My Science", "description": "554 Partages Des scientifiques ont découvert quels types de cellules du corps humain sont les plus susceptibles d’être infectées par le nouveau coronavirus SARS-CoV-2, en identifiant les cibles pour le pathogène en fonction des types de protéines produites pa…", "url": "https://trustmyscience.com/covid-19-scientifiques-decouvert-types-cellules-humaines-plus-vulnerables/", "urlToImage": null, "publishedAt": "2020-04-24T16:15:17Z", "content": "Des scientifiques ont découvert quels types de cellules du corps humain sont les plus susceptibles dêtre infectées par le nouveau coronavirus SARS-CoV-2, en identifiant les cibles pour le pathogène en fonction des types de protéines produites par les cellules… [+5315 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Covid-19 : l'absence d'immunité serait \"une exception\" explique le Pr. Vivier - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_12ca8140-a384-451d-ae34-48fa512d0952&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-24T15:41:00Z", "content": "Afin de vous offrir une expérience globale optimisée, nous souhaitons vous proposer des publicités pertinentes qui vous seront plus utiles. Par exemple, lorsque vous recherchez un film, nous utilisons vos données de recherche et votre position pour afficher l… [+471 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "Cyrille Marqué", "title": "Covid-19 : beaucoup de décès dans les Ehpad des Hautes-Pyrénées - LaDepeche.fr", "description": "Les Hautes-Pyrénées sont le 3e département d'Occitanie concernant le nombre de décès dans les Ehpad.", "url": "https://www.ladepeche.fr/2020/04/24/covid-19-beaucoup-de-deces-dans-les-ehpad-des-hautes-pyrenees,8861324.php", "urlToImage": null, "publishedAt": "2020-04-24T15:39:07Z", "content": "l'essentiel\r\n Les Hautes-Pyrénées sont le 3e département d'Occitanie concernant le nombre de décès dans les Ehpad. \r\n Jeudi, l’agence nationale Santé publique France a publié son bulletin sur le point épidémiologique sur le Covid-19. Du 1er mars au 20 avril, … [+1035 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Mickaël Bosredon", "title": "Coronavirus : Pourquoi faire de la chauve-souris un bouc émissaire serait une erreur - 20 Minutes", "description": "« Vraisemblablement » à l'origine de la pandémie de Covid-19, la chauve-souris n'est pas pour autant davantage porteuse de virus transmissibles à l'Homme, que d'autres espèces animales", "url": "https://www.20minutes.fr/planete/2766347-20200424-coronavirus-idee-chauves-souris-reservoirs-privilegies-maladies-humaines-fausse", "urlToImage": null, "publishedAt": "2020-04-24T14:57:15Z", "content": "chauve-souris du genre rhinolophe CHRISTIAN KOENIG / AFP\r\nResponsable, mais pas coupable La chauve-souris est vraisemblablement à lorigine de l'épidémie de Covid-19, confirme le virologue de \r\nl'Institut de recherche pour le développement (IRD) Eric Leroy. Si… [+8125 chars]"}, {"source": {"id": null, "name": "Journaldesfemmes.fr"}, "author": "Anaïs Thiébaux et Lise  Lafaurie", "title": "Victimes du coronavirus : âge des cas et des décès, jeunes touchés... - Journal des femmes", "description": "Le Covid-19 poursuit sa propagation en France et fait de plus en plus de victimes : plus de 121 000 personnes testées positives au coronavirus et plus de 21 000 décès sont déplorés. Quel est l'âge des victimes en France ? La maladie frappe-t-elle les plus de …", "url": "https://sante.journaldesfemmes.fr/fiches-maladies/2622115-coronavirus-victime-france-deces-mort-qui-meurt-age-mort-pour-l-avoir-jeunes-touches/", "urlToImage": null, "publishedAt": "2020-04-24T13:07:30Z", "content": "Le Covid-19 poursuit sa propagation en France et fait de plus en plus de victimes : plus de 121 000 personnes testées positives au coronavirus et plus de 21 000 décès sont déplorés. Quel est l'âge des victimes en France ? La maladie frappe-t-elle les plus de … [+11675 chars]"}, {"source": {"id": null, "name": "Linternaute.com"}, "author": "Mathilde Ledroit", "title": "Remdesivir et coronavirus : un usage peu efficace, voire dangereux ? - Linternaute.com", "description": "Dans la lutte contre le Covid-19, le Remdesivir a été cité parmi les traitements potentiels. Pourtant, des essais cliniques démontrent des effets secondaires importants, qui peuvent s'avérer dangereux.", "url": "https://www.linternaute.com/actualite/guide-vie-quotidienne/2491649-remdesivir-et-kaletra-des-remedes-au-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-24T12:49:16Z", "content": "Dans la lutte contre le Covid-19, le Remdesivir a été cité parmi les traitements potentiels. Pourtant, des essais cliniques démontrent des effets secondaires importants, qui peuvent s'avérer dangereux. \r\n[Mis à jours le 24 avril 2020 à 14h45] Cela fait plusie… [+5860 chars]"}, {"source": {"id": null, "name": "Agoravox.fr"}, "author": null, "title": "Partir ou revenir en fumée ? - AgoraVox", "description": "Le professeur Jean-François Delfraissy, président du conseil scientifique du gouvernement, s'interroge lui aussi sur un possible rôle positif de la nicotine pour lutter contre le coronavirus, et se demande si « le tabac protégerait contre ce virus, via la nic…", "url": "https://www.agoravox.fr/actualites/sante/article/partir-ou-revenir-en-fumee-223608", "urlToImage": null, "publishedAt": "2020-04-24T11:28:19Z", "content": "On se souvient de ces paquets de cigarette ornés d’une tête de mort, ornés de la mention « fumer tue »...\r\nSurprise, d’après plusieurs scientifiques, la cigarette pourrait guérir du tristement célèbre coronavirus.\r\nBien évidemment, cette affirmation amènera u… [+8018 chars]"}, {"source": {"id": null, "name": "Www.rfi.fr"}, "author": "Caroline Paré, Ophélie Lahccen", "title": "Covid-19: porteurs du VIH et anciens malades de la tuberculose doivent être très vigilants - RFI", "description": "La présence d'autres pathologies augmente le risque de complications chez un patient atteint du nouveau coronavirus. D'où l'importance pour les porteurs du VIH ou les anciens tuberculeux de redoubler de vigilance. Entretien.", "url": "http://www.rfi.fr/fr/afrique/20200424-covid-19-porteurs-vih-et-anciens-malades-la-tuberculose-doivent-%C3%AAtre-tr%C3%A8s-vigilants", "urlToImage": null, "publishedAt": "2020-04-24T11:10:00Z", "content": "La présence d'autres pathologies augmente le risque de complications chez un patient atteint du nouveau coronavirus. D'où l'importance pour les porteurs du VIH ou les anciens tuberculeux de redoubler de vigilance. Entretien.\r\n Le professeur Jean-Marie Kayembe… [+4630 chars]"}, {"source": {"id": null, "name": "Ulyces.co"}, "author": null, "title": "Israël lance des essais cliniques pour soigner le Covid-19 avec du cannabis - Ulyces", "description": "Des cher­cheurs israé­liens pensent que les proprié­tés anti-inflam­ma­toires du canna­bis pour­raient sauver des vies dans la lutte contre le Covid-19. Des essais cliniques ont donc été lancés pour essayer de trai­ter le virus à l’aide de canna­bis, rappor­t…", "url": "https://www.ulyces.co/news/israel-lance-des-essais-cliniques-pour-soigner-le-covid-19-avec-du-cannabis/", "urlToImage": null, "publishedAt": "2020-04-24T10:45:03Z", "content": "par   Denis Hadzovic   | 24 avril 2020 Des cher­cheurs israé­liens pensent que les proprié­tés anti-inflam­ma­toires du canna­bis pour­raient sauver des vies dans la lutte contre le Covid-19. Des essais cliniques ont donc été lancés pour essayer de trai­ter l… [+1887 chars]"}]}