{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Le Figaro avec AFP", "title": "Transport routier : la CFDT appelle au débrayage le 7 mai - Le Figaro", "description": null, "url": "http://www.lefigaro.fr/flash-eco/transport-routier-la-cfdt-appelle-au-debrayage-le-7-mai-20200425", "urlToImage": null, "publishedAt": "2020-04-25T10:07:00Z", "content": "L'UFR-CFDT, premier syndicat du transport routier, a appelé les salariés du secteur à débrayer le 7 mai et porter des brassards noirs, tout en demandant à l'Etat de démontrer sa «gratitude à tous (les) salariés de la deuxième ligne qui sont au front».\r\nL'Unio… [+2090 chars]"}, {"source": {"id": null, "name": "Slate.fr"}, "author": "Jean-Yves Nau", "title": "Covid-19: les nouvelles et paradoxales vertus de la nicotine | Slate.fr - Slate.fr", "description": "Les personnes qui fument du tabac semblent moins atteintes que la moyenne, mais ces espoirs thérapeutiques laissent redouter de nouveaux risques sanitaires.", "url": "http://www.slate.fr/story/189954/covid-19-nicotine-fumeurs-protection-risques-sanitaires-danger-essais-cliniques-pitie-salpetriere", "urlToImage": null, "publishedAt": "2020-04-25T06:52:00Z", "content": "Temps de lecture: 5 min\r\nAu début de l'épidémie de Covid-19, c'est une simple curiosité statistique. On imagine que les personnes qui fument du tabac encourent plus de risques que la moyenne d'être atteintes, or elles semblent moins exposées vis-à-vis de l'in… [+7826 chars]"}, {"source": {"id": null, "name": "Actu.fr"}, "author": "Thibaut Calatayud", "title": "Coronavirus. Toulouse est-elle prête à accueillir une deuxième vague après le confinement ? - actu.fr", "description": "Au CHU de Toulouse, l'activité liée au Covid-19 continue de baisser. Mais l'arrivée probable d'une seconde vague après le confinement pourrait-elle mettre le CHU en délicatesse ?", "url": "https://actu.fr/occitanie/toulouse_31555/coronavirus-toulouse-prete-accueillir-deuxieme-vague-apres-confinement_33235279.html", "urlToImage": null, "publishedAt": "2020-04-25T06:06:02Z", "content": "L’activité du CHU de Toulouse liée au coronavirus continue de baisser. (©Adobe Stock)\r\n« L’activité Covid continue à décroître, lentement, mais de façon certaine », constate Marc Penaud, le directeur général du CHU de Toulouse. Le plateau observé depuis déjà … [+7028 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Des tests de la chloroquine contre le Covid-19 interrompus pour des raisons de sécurité après plusieurs décès - Sputnik France", "description": "Une équipe de chercheurs qui testait de la chloroquine en tant que traitement du Covid-19 a dû écourter ses travaux après qu’un quart des patients ayant pris cet...", "url": "https://fr.sputniknews.com/sci_tech/202004241043649413-des-tests-de-la-chloroquine-contre-le-covid-19-interrompus-pour-des-raisons-de-securite-apres/", "urlToImage": null, "publishedAt": "2020-04-24T21:15:58Z", "content": "Une équipe de chercheurs qui testait de la chloroquine en tant que traitement du Covid-19 a dû écourter ses travaux après quun quart des patients ayant pris cet antipaludéen sont décédés, selon les résultats de létude publiés dans le Journal de l'American Med… [+3394 chars]"}, {"source": {"id": null, "name": "Lanouvelletribune.info"}, "author": null, "title": "Coronavirus : un nouveau symptôme très étrange chez les enfants - La Nouvelle Tribune", "description": "En dehors de l’inquiétante découverte en Chine d’une nouvelle cellule souche du Covid-19 qui ne se laisse pas détecter facilement, les médecins sont en train de faire la remarque de l’apparition de plus en plus fréquente chez certains patients atteints du vir…", "url": "https://lanouvelletribune.info/2020/04/coronavirus-un-nouveau-symptome-tres-etrange-chez-les-enfants/", "urlToImage": null, "publishedAt": "2020-04-24T20:13:49Z", "content": "En dehors de linquiétante découverte en Chine dune nouvelle cellule souche du Covid-19 qui ne se laisse pas détecter facilement, les médecins sont en train de faire la remarque de lapparition de plus en plus fréquente chez certains patients atteints du virus,… [+1696 chars]"}, {"source": {"id": null, "name": "Sudouest.fr"}, "author": "Sud Ouest", "title": "Coronavirus en Nouvelle-Aquitaine : huit morts en 24 heures, les premières projections pour le 11 mai - Sud Ouest", "description": "Dans son bilan quotidien, l'ARS Nouvelle-Aquitaine déplore huit nouveaux décès dans les hôpitaux et a procédé à des ajustements dans les chiffres des Ehpad. Elle a également dévoilé les projections réalisées par l'Institut Pasteur pour le 11 mai", "url": "https://www.sudouest.fr/2020/04/24/coronavirus-en-nouvelle-aquitaine-huit-morts-en-24-heures-les-premieres-projections-pour-le-11-mai-7437287-10861.php", "urlToImage": null, "publishedAt": "2020-04-24T17:51:08Z", "content": "La Nouvelle-Aquitaine reste l’une des régions de France les moins impactées par l’épidémie. Les premières projections réalisées par l’Institut Pasteur montrent que le pourcentage de personnes potentiellement infectées serait au 11 mai, date du début de déconf… [+2667 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Guadeloupe 1ère", "title": "Coronavirus : toujours 149 cas confirmés par test PCR en Guadeloupe, pas de nouveau cas - Guadeloupe la 1ère - Outre-mer la 1ère", "description": "149 c&#39;est toujours le nombre de cas cumul&eacute;s et confirm&eacute;s par test PCR en Guadeloupe. Pas de nouveau cas enregistr&eacute; officiellement. C&#39;est le dernier bilan communiqu&eacute;", "url": "https://la1ere.francetvinfo.fr/guadeloupe/coronavirus-toujours-x-cas-confirmes-par-test-pcr-en-guadeloupe-pas-de-nouveau-cas-826374.html", "urlToImage": null, "publishedAt": "2020-04-24T17:36:33Z", "content": "Pas de nouveau cas recensé dans notre région ces dernières 24h, selon le dernier bilan publié par l'Agence Régionale de Santé. Cela porte toujours à 149, le nombre de cas confirmés par test PCR (en données cumulées) en Guadeloupe. Parmi ces cas confirmés, 14 … [+1476 chars]"}, {"source": {"id": null, "name": "Pourquoidocteur.fr"}, "author": null, "title": "Port du masque : comment éviter la buée sur les lunettes - Pourquoi Docteur ?", "description": "Alors que le port du masque tend à se généraliser en France, les personnes à lunettes sont confrontées à la formation de buée sur leurs verres. Eau savonneuse, mouchoir plié à l'horizontale… Voici quelques techniques pour garder des verres nets.  .", "url": "https://www.pourquoidocteur.fr/Articles/Question-d-actu/32270-Port-masque-eviter-buee-lunettes", "urlToImage": null, "publishedAt": "2020-04-24T17:30:00Z", "content": "Afin de lutter contre la propagation du Covid-19 ainsi qu'une deuxième vague, le port du masque pourrait se généraliser en France, voire devenir obligatoire dans l'espace public. Une mesure qui toucherait certains plus que d'autres, à l'instar des porteurs de… [+2934 chars]"}, {"source": {"id": null, "name": "Metrotime.be"}, "author": null, "title": "Des chercheurs belges tentent de bloquer la phase inflammatoire du Covid-19 - Metro Belgique", "description": "Des essais cliniques visant à bloquer la phase inflammatoire du Covid-19, où les cas sont les plus graves, sont coordonnés par l'hôpital universitaire de Gand depuis début avril. Les résultats sont encourageants.", "url": "https://fr.metrotime.be/2020/04/24/must-read/des-chercheurs-belges-tentent-de-bloquer-la-phase-inflammatoire-du-covid-19/", "urlToImage": null, "publishedAt": "2020-04-24T17:17:55Z", "content": "Des essais cliniques visant à bloquer la phase inflammatoire du Covid-19, où les cas sont les plus graves, sont coordonnés par lhôpital universitaire de Gand depuis début avril. Les résultats sont encourageants. Le dosage de certaines protéines permet de déte… [+1695 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Sébastien Bouwy", "title": "Coronavirus : la colère des soignants de l'hôpital de Périgueux incriminés par l'ARS après la contaminati - France 3 Régions", "description": "La contamination de 18 patients et d'une vingtaine de soignants d'un service de l'hôpital de Périgueux a du mal à passer. Hier, la directrice de l'ARS pour la Dordogne a indiqué que la propagation du virus était sans doute liée à un relâchement du personnel s…", "url": "https://france3-regions.francetvinfo.fr/nouvelle-aquitaine/dordogne/perigueux/coronavirus-colere-soignants-hopital-perigueux-incrimines-ars-apres-contamination-service-1820446.html", "urlToImage": null, "publishedAt": "2020-04-24T16:56:12Z", "content": "Le foyer épidémique qui s'est développé dans le service de soins de suite et de réadaptation du centre hospitalier de Périgueux ne lasse pas d'interroger. 18 patients et une vingtaine de soignants ont été testés positifs au Covid-19.Hier jeudi, la directrice … [+2950 chars]"}, {"source": {"id": null, "name": "Futura-sciences.com"}, "author": "Éléonore Solé", "title": "D'étranges chauves-souris porteuses de coronavirus - Futura", "description": "Les chauves-souris seraient plus douées que d'autres pour transmettre des virus à la population humaine. Pourtant, ces espèces sont peu connues des scientifiques. Un manque que des chercheurs ont...", "url": "https://www.futura-sciences.com/planete/actualites/chauve-souris-etranges-chauves-souris-porteuses-coronavirus-80721/", "urlToImage": null, "publishedAt": "2020-04-24T16:18:17Z", "content": "Les chauves-souris seraient plus douées que d'autres pour transmettre des virus à la population humaine. Pourtant, ces espèces sont peu connues des scientifiques. Un manque que des chercheurs ont contribué à combler en se penchant sur les chauve-souris à nez … [+3036 chars]"}, {"source": {"id": null, "name": "Trustmyscience.com"}, "author": null, "title": "Coronavirus : Des chercheurs auraient découvert les types de cellules humaines les plus vulnérables - Trust My Science", "description": "180 Partages Des scientifiques ont découvert quels types de cellules du corps humain sont les plus susceptibles d’être infectées par le nouveau coronavirus SARS-CoV-2, en identifiant les cibles pour le pathogène en fonction des types de protéines produites pa…", "url": "https://trustmyscience.com/covid-19-scientifiques-decouvert-types-cellules-humaines-plus-vulnerables/", "urlToImage": null, "publishedAt": "2020-04-24T16:15:17Z", "content": "Des scientifiques ont découvert quels types de cellules du corps humain sont les plus susceptibles dêtre infectées par le nouveau coronavirus SARS-CoV-2, en identifiant les cibles pour le pathogène en fonction des types de protéines produites par les cellules… [+5315 chars]"}, {"source": {"id": null, "name": "Actu.fr"}, "author": "Anne-Sophie Blot", "title": "Trois semaines après son hospitalisation, un médecin raconte la persistance du coronavirus - actu.fr", "description": "Peu suivis à la sortie de l'hôpital, les patients les plus gravement atteints par le coronavirus continuent de ressentir des difficultés respiratoires plusieurs semaines après.", "url": "https://actu.fr/societe/coronavirus/trois-semaines-apres-hospitalisation-medecin-raconte-persistance-coronavirus_33235354.html", "urlToImage": null, "publishedAt": "2020-04-24T15:12:48Z", "content": "Un scanner de poumons d’un patient infecté par le Covid-19. (©AFP/Archives/LUCAS BARIOULET)\r\nPhilippe Vasseur a été hospitalisé sous oxygène à Paris pendant 13 jours, puis renvoyé à domicile sans recommandations. Trois semaines plus tard, alors que ce médecin… [+4216 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": "Jonathan Parienté, Pierre Breteau, Maxime Ferrer, Léa Sanchez", "title": "Coronavirus : âge, sexe, département… la hausse de la mortalité française en six graphiques - Le Monde", "description": "Depuis le début de l’épidémie, grâce aux remontées de l’état civil, l’Insee observe une surmortalité, notamment dans les zones les plus touchées par le Covid-19, et parmi les plus âgés.", "url": "https://www.lemonde.fr/les-decodeurs/article/2020/04/24/coronavirus-age-sexe-departement-la-hausse-de-la-mortalite-francaise-en-six-graphiques_6037681_4355770.html", "urlToImage": null, "publishedAt": "2020-04-24T14:25:06Z", "content": "Peut-on estimer le nombre de victimes du Covid-19 en France ? Chaque soir, le directeur général de la santé, Jérôme Salomon, communique le nombre de personnes mortes des suites de la maladie. Jusquau 2 avril, il ne prenait en compte que les morts en milieu ho… [+2767 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "Manon Adoue", "title": "Les moustiques tigre sont déjà là : toute l'Occitanie en vigilance rouge - LaDepeche.fr", "description": "", "url": "https://www.ladepeche.fr/2020/04/24/les-moustiques-tigre-sont-deja-la-toute-loccitanie-en-vigilance-rouge,8861132.php", "urlToImage": null, "publishedAt": "2020-04-24T13:35:46Z", "content": "La France voit rouge. Mais cette fois-ci à cause du moustique tigre. Le site d'informations Vigilance-Moustiques vient de publier sa carte 2020 de la présence des moustiques tigre en France. Et la cartographie fait froid dans le dos. Six nouveaux départements… [+2046 chars]"}, {"source": {"id": null, "name": "Sciencepost.fr"}, "author": "Brice Louvet, rédacteur sciences", "title": "Covid-19 : que dit la première étude séro-épidémiologique en France ? - SciencePost", "description": "Fin Mars, 661 personnes ont fait l'objet d'une étude épidémiologique et sérologique dans le cadre de la lutte contre le Covid-19", "url": "https://sciencepost.fr/covid-19-que-dit-la-premiere-etude-sero-epidemiologique-en-france/", "urlToImage": null, "publishedAt": "2020-04-24T12:52:57Z", "content": "Fin mars 2020, 661 personnes reliées à un lycée de Crépy-en-Valois (Oise) ont fait l’objet d’une étude épidémiologique et sérologique menée par les chercheurs de lInstitut Pasteur dans le cadre de la lutte contre le Covid-19. Quels enseignements peut-on tirer… [+3683 chars]"}, {"source": {"id": null, "name": "Agoravox.fr"}, "author": null, "title": "Partir ou revenir en fumée ? - AgoraVox", "description": "Le professeur Jean-François Delfraissy, président du conseil scientifique du gouvernement, s'interroge lui aussi sur un possible rôle positif de la nicotine pour lutter contre le coronavirus, et se demande si « le tabac protégerait contre ce virus, via la nic…", "url": "https://www.agoravox.fr/actualites/sante/article/partir-ou-revenir-en-fumee-223608", "urlToImage": null, "publishedAt": "2020-04-24T11:28:19Z", "content": "On se souvient de ces paquets de cigarette ornés d’une tête de mort, ornés de la mention « fumer tue »...\r\nSurprise, d’après plusieurs scientifiques, la cigarette pourrait guérir du tristement célèbre coronavirus.\r\nBien évidemment, cette affirmation amènera u… [+8018 chars]"}, {"source": {"id": null, "name": "Www.rfi.fr"}, "author": "Caroline Paré, Ophélie Lahccen", "title": "Covid-19: porteurs du VIH et anciens malades de la tuberculose doivent être très vigilants - RFI", "description": "La présence d'autres pathologies augmente le risque de complications chez un patient atteint du nouveau coronavirus. D'où l'importance pour les porteurs du VIH ou les anciens tuberculeux de redoubler de vigilance. Entretien.", "url": "http://www.rfi.fr/fr/afrique/20200424-covid-19-porteurs-vih-et-anciens-malades-la-tuberculose-doivent-%C3%AAtre-tr%C3%A8s-vigilants", "urlToImage": null, "publishedAt": "2020-04-24T11:10:00Z", "content": "La présence d'autres pathologies augmente le risque de complications chez un patient atteint du nouveau coronavirus. D'où l'importance pour les porteurs du VIH ou les anciens tuberculeux de redoubler de vigilance. Entretien.\r\n Le professeur Jean-Marie Kayembe… [+4630 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "La rédaction", "title": "Souillac : les gendarmes interceptent un conducteur ivre et sans attestation - LaDepeche.fr", "description": "", "url": "https://www.ladepeche.fr/2020/04/24/souillac-les-gendarmes-interceptent-un-conducteur-ivre-et-sans-attestation,8860901.php", "urlToImage": null, "publishedAt": "2020-04-24T11:00:24Z", "content": "De jour, comme de nuit, les contrôles pour le respect des mesures de confinement se poursuivent sur l'ensemble du département du Lot. Ce jeudi 23 avril, à 22 heures 40, les gendarmes de la communauté de brigades de Souillac procèdent au contrôle d'un automobi… [+536 chars]"}, {"source": {"id": null, "name": "Orange.fr"}, "author": "https://www.facebook.com/orangeactufr", "title": "Une étude se penche sur les impacts du Covid-19 chez les personnes âgées - Actu Orange", "description": "Tous les patients âgés du Covid-19 n'en meurent pas et qu'advient-il des survivants ? Pour y répondre, le CHU de Grenoble coordonne une étude sur les impacts à plus long terme de la maladie chez les plus de 70 ans.", "url": "https://actu.orange.fr/societe/sante/une-etude-se-penche-sur-les-impacts-du-covid-19-chez-les-personnes-agees-CNT000001pGn1h.html", "urlToImage": null, "publishedAt": "2020-04-24T10:51:53Z", "content": "AFP, publié le vendredi 24 avril 2020 à 12h51\r\nTous les patients âgés du Covid-19 n'en meurent pas et qu'advient-il des survivants ? Pour y répondre, le CHU de Grenoble coordonne une étude sur les impacts à plus long terme de la maladie chez les plus de 70 an… [+2840 chars]"}, {"source": {"id": "les-echos", "name": "Les Echos"}, "author": "Alexandre Rousset", "title": "Coronavirus et allergies : comment distinguer les symptômes - Les Échos", "description": "La saison des pollens étant ouverte, de nombreux Français craignent de ne pas faire la différence entre une banale crise allergique et une infection au Covid-19. Si certains symptômes peuvent être similaires, d'autres permettent de différencier les deux patho…", "url": "https://www.lesechos.fr/industrie-services/pharmacie-sante/coronavirus-et-allergies-comment-distinguer-les-symptomes-1197888", "urlToImage": null, "publishedAt": "2020-04-24T10:39:05Z", "content": "Nez qui coule, yeux irrités, difficultés à respirer Comme chaque année, le printemps est synonyme d'allergies pour des millions de Français. Mais ce rendez-vous annuel prend une nouvelle dimension en 2020, alors que le pays, comme le monde entier, doit faire … [+4649 chars]"}, {"source": {"id": null, "name": "Linternaute.com"}, "author": "Mathilde Saintilan", "title": "Coronavirus : quels symptômes doivent vous alerter ? - Linternaute.com", "description": "Dans 80% des cas, le coronavirus se traduit par des symptômes bénins. Quels sont-ils ? Quand devez-vous vous inquiéter ? Quelles sont les aggravations potentielles de la maladie ?", "url": "https://www.linternaute.com/actualite/guide-vie-quotidienne/2475703-coronavirus-quels-symptomes-doivent-vous-alerter/", "urlToImage": null, "publishedAt": "2020-04-24T09:20:26Z", "content": "Dans 80% des cas, le coronavirus se traduit par des symptômes bénins. Quels sont-ils ? Quand devez-vous vous inquiéter ? Quelles sont les aggravations potentielles de la maladie ? \r\n[Mis à jour le 24 avril 2020 à 11h15] Le nouveau coronavirus est apparu fin 2… [+10722 chars]"}, {"source": {"id": null, "name": "Pourquoidocteur.fr"}, "author": null, "title": "Obésité : on en sait plus sur le lien entre manque de sommeil et prise de poids - Pourquoi Docteur ?", "description": "D'après une nouvelle étude, l'excès de poids pourrait favoriser un mauvais sommeil et non pas le contraire, contrairement à ce qui a souvent été avancé. .", "url": "https://www.pourquoidocteur.fr/Articles/Question-d-actu/32263-Obesite-sait-lien-manque-sommeil-prise-de-poids", "urlToImage": null, "publishedAt": "2020-04-24T09:15:00Z", "content": "<ul><li> Le lien entre mauvais sommeil et prise de poids a déjà été établi</li><li> Une nouvelle étude suggère que c'est le surpoids qui entraînerait un mauvais sommeil et non l'inverse</li></ul>\r\nIl a été prouvé à maintes reprises qu’un mauvais sommeil favor… [+4957 chars]"}, {"source": {"id": "liberation", "name": "Libération"}, "author": "Anaïs Condomines", "title": "Les visières en plastique constituent-elles une protection efficace ? - Libération", "description": "Ces masques ne sont pas des protections respiratoires. Ils présentent toutefois certains avantages. Si utilisés, ils doivent l'être en complément des gestes barrières et de la distanciation sociale.", "url": "https://www.liberation.fr/checknews/2020/04/23/les-visieres-en-plastique-constituent-elles-une-protection-efficace_1786198", "urlToImage": null, "publishedAt": "2020-04-24T08:51:37Z", "content": "Question posée par Anne le 23/04/2020\r\nBonjour, \r\nVous nous questionnez sur lefficacité des masques munis dune visière de protection en plastique. Habituellement utilisés sur les chantiers, ils sont parfois considérés par la population comme une alternative a… [+1686 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": "Assma Maad", "title": "Coronavirus : des bactéries intestinales, les « Prevotella », sont-elles les véritables responsables du Covid-19 ? - Le Monde", "description": "Une rumeur prétend que ces bactéries présentes dans notre flore intestinale seraient infectées par le virus SARS-CoV-2 et seraient à l’origine des décès. Elle ne repose sur rien de fiable.", "url": "https://www.lemonde.fr/les-decodeurs/article/2020/04/24/des-bacteries-intestinales-les-prevotella-sont-elles-les-veritables-responsables-du-covid-19_6037624_4355770.html", "urlToImage": null, "publishedAt": "2020-04-24T08:46:32Z", "content": "Depuis le début de lépidémie de Covid-19, la rumeur court plus rapidement que la recherche scientifique. Lune des dernières en date, partagée notamment sur WhatsApp, fait état dune prétendue « découverte majeure » dans la recherche dun traitement pour lutter … [+11004 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus : la maladie peut-elle se transmettre lors des relations sexuelles ? - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_a57398c6-f2e5-4648-8d45-fc3cbe230910&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-24T08:14:00Z", "content": "Yahoo fait partie de Verizon Media. Cliquez sur J'accepte afin dautoriser Verizon Media et ses partenaires à utiliser des cookies et des technologies similaires pour accéder à votre appareil, utiliser vos données (y compris votre position géographique), compr… [+596 chars]"}, {"source": {"id": null, "name": "Atlantico.fr"}, "author": null, "title": "Covid-19 : tour du monde des pistes de traitements potentiels - Atlantico.fr", "description": "Alors que de nombreux pays à travers la planète préparent et travaillent activement sur la phase du déconfinement, le Dr Stéphane Gayet revient sur les pistes de traitements contre le Covid-19 et notamment sur les vaccins ou sur la solution du...", "url": "https://www.atlantico.fr/decryptage/3589060/covid-19--tour-du-monde-des-pistes-de-traitements-potentiels-hydroxychloroquine-didier-raoult-vaccin-coronavirus-stephane-gayet", "urlToImage": null, "publishedAt": "2020-04-24T06:37:14Z", "content": "Atlantico.fr : Que savons-nous aujourd'hui des pistes de traitements du CoVid-19 ?\r\nAntiviraux et antibiotiques : deux classes thérapeutiques sans aucun point commun\r\nStéphane Gayet : On parle bien ici de médicaments qui agissent in vivo, c'est-à-dire dans no… [+20179 chars]"}, {"source": {"id": null, "name": "Orange.fr"}, "author": "https://www.facebook.com/orangeactufr", "title": "Dengue + coronavirus = bombe à retardement pour les hôpitaux d'Amérique centrale - Actu Orange", "description": "Les systèmes de santé d'Amérique centrale, déjà confrontés au nouveau coronavirus, sont maintenant sous la menace supplémentaire d'une flambée de dengue avec l'arrivée de la saison des pluies.", "url": "https://actu.orange.fr/societe/sante/dengue-coronavirus-bombe-a-retardement-pour-les-hopitaux-d-amerique-centrale-CNT000001pFNhs.html", "urlToImage": null, "publishedAt": "2020-04-24T06:07:00Z", "content": "AFP, publié le vendredi 24 avril 2020 à 08h07\r\nLes systèmes de santé d'Amérique centrale, déjà confrontés au nouveau coronavirus, sont maintenant sous la menace supplémentaire d'une flambée de dengue avec l'arrivée de la saison des pluies.\r\nPlus de 23.000 cas… [+4069 chars]"}, {"source": {"id": null, "name": "Francebleu.fr"}, "author": "Cécile Bidault", "title": "Coronavirus : un médecin généraliste de Tourcoing juge \"criminelle\" la politique du gouvernement - France Bleu", "description": "Après la mort de deux médecins généralistes atteints du coronavirus dans le Nord, le secrétaire général de la CSMF 59/62, Bertrand Legrand, médecin à Tourcoing, lance sur France Bleu Nord un cri d'alarme : il dénonce la politique du gouvernement qu'il juge \"s…", "url": "https://www.francebleu.fr/infos/sante-sciences/coronavirus-un-medecin-generaliste-de-tourcoing-juge-criminelle-la-politique-du-gouvernement-1587653136", "urlToImage": null, "publishedAt": "2020-04-24T06:03:09Z", "content": "Nous l'évoquions ces derniers jours sur France Bleu Nord, deux médecins généralistes sont morts récemment du coronavirus dans le Nord. Ces praticiens sont en première ligne dans la lutte contre le Covid-19, et ce vendredi 24 avril, l'un d'entre eux ne cache p… [+2842 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Anissa Boumediene", "title": "Coronavirus : Finalement, les enfants ne seraient pas de grands vecteurs de transmission du Covid-19 - 20 Minutes", "description": "Si au début de l’épidémie de coronavirus en France, les scientifiques ont alerté sur le potentiel contaminant des enfants, ces derniers ne seraient finalement pas de grands vecteurs de diffusion du Covid-19", "url": "https://www.20minutes.fr/sante/2766687-20200423-coronavirus-finalement-enfants-grands-vecteurs-transmission-covid-19", "urlToImage": null, "publishedAt": "2020-04-23T20:08:33Z", "content": "Des enfants entrent dans une école élémentaire (illustration). \r\nIls ne seraient finalement pas si contaminants que ça. Alors quau début de lépidémie de coronavirus, les enfants étaient décrits comme un public largement vecteur de transmission, ce ne serait d… [+6551 chars]"}, {"source": {"id": null, "name": "La-croix.com"}, "author": "Loup Besmond de Senneville", "title": "Coronavirus : l’État s’apprête à réquisitionner les médicaments de réanimation - Journal La Croix", "description": "À partir de lundi 27 avril, l’État devrait prendre la main sur cinq produits indispensables en réanimation. Objectif : « éviter une rupture de stock effective sur le territoire français à court terme », selon une note de la Direction générale de la santé.", "url": "https://www.la-croix.com/France/Coronavirus-lEtat-sapprete-requisitionner-medicaments-reanimation-2020-04-23-1201090855", "urlToImage": null, "publishedAt": "2020-04-23T17:40:02Z", "content": null}, {"source": {"id": null, "name": "Objectifgard.com"}, "author": "Corentin Corger", "title": "NÎMES Urgences cardiaques, le CHU alerte les patients - Objectif Gard", "description": "Le CHU de Nîmes alerte les patients atteints de maladies cardiaques de continuer à se rendre aux urgences en cas d'aggravation de leur état de santé. Car peur de contracter le coronavirus, cert", "url": "https://www.objectifgard.com/2020/04/23/nimes-urgences-cardiaques-le-chu-alerte-les-patients/", "urlToImage": null, "publishedAt": "2020-04-23T15:43:17Z", "content": "Une salle d'échographie du service de cardiologie du CHU Carémeau (Photo Corentin Corger)\r\nLe CHU de Nîmes alerte les patients atteints de maladies cardiaques de continuer à se rendre aux urgences en cas d'aggravation de leur état de santé. Car peur de contra… [+1830 chars]"}, {"source": {"id": null, "name": "Actusoins.com"}, "author": "Rédaction ActuSoins", "title": "L’Ordre des infirmiers demande un recensement du nombre d’infirmiers contaminés et décédés - ActuSoins", "description": "L'ONI réclame un recensement 'dans les plus brefs délais', du nombre d'infirmiers contaminés, hospitalisés ou décédés des suites du Covid-19. L'instance demande aussi que les enfants de professionnels de santé décédés du Covid-19 obtiennent le statut de 'pupi…", "url": "https://www.actusoins.com/329863/lordre-des-infirmiers-demande-un-recensement-du-nombre-dinfirmiers-contamines-et-decedes.html", "urlToImage": null, "publishedAt": "2020-04-23T14:49:07Z", "content": "L'ONI réclame un recensement \"dans les plus brefs délais\", du nombre d'infirmiers contaminés, hospitalisés ou décédés des suites du Covid-19. L'instance demande aussi que les enfants de professionnels de santé décédés du Covid-19 obtiennent le statut de \"pupi… [+3596 chars]"}, {"source": {"id": null, "name": "Futura-sciences.com"}, "author": "Julie Kern", "title": "Coronavirus : les tests sérologiques sont-ils fiables ? - Futura", "description": "Les tests sérologiques, qui permettent de détecter les anticorps créés à la suite d'une infection par le coronavirus, sont encore en développement. Nombre d'entre eux ne remplissent pas le cahier...", "url": "https://www.futura-sciences.com/sante/actualites/coronavirus-coronavirus-tests-serologiques-sont-ils-fiables-80667/", "urlToImage": null, "publishedAt": "2020-04-23T14:31:58Z", "content": "Les tests sérologiques, qui permettent de détecter les anticorps créés à la suite d'une infection par le coronavirus, sont encore en développement. Nombre d'entre eux ne remplissent pas le cahier des charges pour leur homologation. Leur fiabilité, notamment, … [+3070 chars]"}, {"source": {"id": null, "name": "Actu.fr"}, "author": "Hugues-Olivier Dumez", "title": "Toulouse. Perte du goût et de l'odorat : des chercheurs y voient un symptôme spécifique au Covid-19 - actu.fr", "description": "Une enquête sur la perte du goût et de l'odorat, comme signe d'un début d'infection du Covid-19, est menée à l'échelle internationale. Des chercheurs y contribuent à Toulouse.", "url": "https://actu.fr/occitanie/toulouse_31555/toulouse-perte-gout-de-lodorat-chercheurs-voient-symptome-specifique-covid-19_33179991.html", "urlToImage": null, "publishedAt": "2020-04-23T14:10:51Z", "content": "La perte d’odorat ou de goût, ainsi que des troubles digestifs, peuvent être des signes d’alerte d’un début d’infection du Covid-19. (©Illustration / Adobe Stock)\r\nPerte du goût et de l’odorat ? Ces troubles sensoriels – aussi appelés « agueusie » et « anosmi… [+4556 chars]"}, {"source": {"id": null, "name": "Maxisciences.com"}, "author": "La rédaction", "title": "Confinement : comment compenser le manque de soleil ? - Maxisciences", "description": "La vitamine D, produite par la peau lorsqu'on s'expose au soleil, est un nutriment essentiel à notre organisme. Même confiné, il faut être attentif à ne pas être carencé.…", "url": "https://www.maxisciences.com/sante/confinement-comment-compenser-le-manque-de-soleil_art44430.html", "urlToImage": null, "publishedAt": "2020-04-23T12:11:03Z", "content": "La vitamine D, produite par la peau lorsqu'on s'expose au soleil, est un nutriment essentiel à notre organisme. Même confiné, il faut être attentif à ne pas être carencé. Alors comment faire le plein ?\r\nLa vitamine D est essentielle à notre corps pour la sant… [+3481 chars]"}, {"source": {"id": null, "name": "Nicematin.com"}, "author": "Nancy Cattan  ncattan@nicematin.fr", "title": "Coronavirus: des scientifiques azuréens identifient les deux types de cellules nasales qui forment les points d'entrée de l'infection - Nice-Matin", "description": "Des scientifiques de la Côte d'Azur ont identifié les deux types de cellules nasales qui forment les points d'infection initiaux.", "url": "https://www.nicematin.com/sante/decouverte-scientifique-majeure-sur-la-cote-dazur-les-cellules-nasales-qui-forment-les-points-dentree-du-covid-19-identifiees-500290", "urlToImage": null, "publishedAt": "2020-04-23T11:22:00Z", "content": "Des médecins et chercheurs azuréens ont participé à la découverte des points d'entrée du coronavirus (SARS -CoV-2) dans l'organisme lors dune infection COVID-19.\r\nEn première ligne dans cette découverte, les équipes de Pascal Barbry, directeur de recherches à… [+644 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Coronavirus : l’usine Sanofi de Lisieux produit du Doliprane à plein régime - Le Parisien", "description": "Le site de Lisieux (Calvados) est l’un des deux seuls en France à produire l’antidouleur. Les ventes ont explosé depuis le début de la crise", "url": "http://www.leparisien.fr/economie/business/coronavirus-l-usine-sanofi-de-lisieux-produit-du-doliprane-a-plein-regime-23-04-2020-8304420.php", "urlToImage": null, "publishedAt": "2020-04-23T10:21:00Z", "content": "Le Calvados ne se cantonne pas aux pommes et au camembert. Il a une autre spécialité : le Doliprane. Depuis 1982, il est fabriqué dans l'usine Sanofi de Lisieux, l'une des deux seules avec le site de Compiègne (Oise) à produire le célèbre médicament à base de… [+2251 chars]"}]}