{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Coronavirus : une carence en vitamine K pourrait favoriser les cas sévères - RTL.fr", "description": "Une étude menée aux Pays-Bas suggère qu'une déficience en vitamine K pourrait favoriser les formes graves de coronavirus.", "url": "https://www.rtl.fr/actu/bien-etre/coronavirus-une-carence-en-vitamine-k-pourrait-favoriser-les-cas-severes-7800581968", "urlToImage": "https://cdn-media.rtl.fr/cache/JVLZfoJLqkD__M-U_zGtDg/2000v1300-0/online/image/2020/0518/7800525743_des-infirmiers-dans-un-hopital-illustration.jpg", "publishedAt": "2020-06-08T13:49:00Z", "content": "Des scientifiques néerlandais, en collaboration avec lInstitut de recherche cardiovasculaire de Maastricht aux Pays-Bas, ont réalisé une étude durant un mois, du 12 mars au 11 avril sur deux groupes … [+1017 chars]"}, {"source": {"id": null, "name": "Le HuffPost"}, "author": "Grégory Rozières", "title": "Coronavirus: les manifestations augmentent-elles les risques d'épidémie? Ce que dit la science - Le HuffPost", "description": "Si les cas de Covid-19 sont pour l'instant maîtrisés en France, des rassemblements importants peuvent-ils participer à une deuxième vague ? Ce que l'on sait de Sars-Cov2 permet d'éclairer cette question, sans apporter de réponse définitive.", "url": "https://www.huffingtonpost.fr/entry/coronavirus-propagation-manifestations_fr_5eddfdd7c5b659e41a835842", "urlToImage": "https://img.huffingtonpost.com/asset/5ede14cc2500007128eb2ef6.jpeg?ops=1200_630", "publishedAt": "2020-06-08T11:16:05Z", "content": "SCIENCE - C’est une mobilisation mondiale qui a lieu depuis des jours. Parties des États-Unis après la mort de George Floyd lors de son interpellation, des manifestations contre le racisme et les vio… [+8788 chars]"}, {"source": {"id": null, "name": "Reporterre"}, "author": "https://reporterre.net", "title": "Malbouffe et sédentarité... notre mode de vie a aggravé la pandémie - Reporterre", "description": "Les malades chroniques ont bien davantage succombé au Covid-19 que les autres, comme le montrent plusieurs études. Or, le développement de l’obésité, du diabète, du cancer, de l’hypertension… est directement lié aux facteurs environnementaux, que les politiqu…", "url": "https://reporterre.net/Malbouffe-et-sedentarite-notre-mode-de-vie-a-aggrave-la-pandemie", "urlToImage": "https://reporterre.net/local/cache-gd2/4b/3439df7dd541c8b3ec87b246544c98.jpg?1591602516", "publishedAt": "2020-06-08T07:33:36Z", "content": "Une épidémie peut parfois en cacher une autre, plus profonde, moins visible. Car le virus Sars-CoV-2 a crû sur un terreau fertile, il a proliféré sur les dérives de notre société dabondance, son modè… [+10413 chars]"}, {"source": {"id": null, "name": "Presselib.com"}, "author": "francois", "title": "Basé à Dax, cette structure unique en France va accueillir ses 90 premiers résidents avec des commerces et des associations ouverts sur l'extérieur ainsi qu'un centre de recherche… - Presselib", "description": "Nous l’attendions avec impatience, nous en avons d’ailleurs parlé à plusieurs reprises : Le Village Landais Alzheimer va accueillir ces premiers résidents ! On rappelle que ce village, « une expérimentation unique en France », ne sera pas un centre Alzheimer …", "url": "https://presselib.com/dax-village-alzheimer/", "urlToImage": "https://presselib.com/wp-content/uploads/2020/06/ALZHEIMER-DAX-PARC.jpg", "publishedAt": "2020-06-07T10:24:00Z", "content": "Nous lattendions avec impatience, nous en avons dailleurs parlé à plusieurs reprises : Le Village Landais Alzheimer va accueillir ces premiers résidents !\r\nOn rappelle que ce village, « une expérimen… [+5565 chars]"}, {"source": {"id": null, "name": "Pressesante.com"}, "author": null, "title": "Cancer de la prostate: causes, facteurs de risque et prévention - Presse santé", "description": "La cancer de la prostate est causé par de multiples facteurs. Une bonne hygiène de vie, une alimentation saine et d'autres facteurs peuvent vous protéger.", "url": "https://www.pressesante.com/cancer-de-la-prostate-causes-facteurs-de-risque-et-prevention/", "urlToImage": "https://www.pressesante.com/wp-content/uploads/2018/12/Cancer-de-la-prostate.jpg", "publishedAt": "2020-06-07T07:00:00Z", "content": "La prostate est une petite glande située sous la vessie chez l’homme et fait partie du système de reproduction. Certains hommes développent un cancer de la prostate, généralement tard dans leur vie. … [+6580 chars]"}, {"source": {"id": null, "name": "Orange.fr"}, "author": "https://www.facebook.com/orangeactufr", "title": "Détecter le virus avant tout symptôme grâce aux accessoires connectés - Actu Orange", "description": "Votre montre connectée, qui mesure déjà votre activité physique, est-elle capable de détecter la contamination au coronavirus avant l'apparition des symptômes?", "url": "https://actu.orange.fr/societe/high-tech/detecter-le-virus-avant-tout-symptome-grace-aux-accessoires-connectes-CNT000001qHSP0.html", "urlToImage": "http://media1.woopic.com/api/v1/images/661%2Fafp-news%2F402%2F050%2Fc4c2e3e816559744057c0f86d7%2Fdetecter-le-virus-avant-tout-symptome-grace-aux-accessoires-connectes%7C000_1KF4US-highDef.jpg?format=470x264&facedetect=1&quality=85", "publishedAt": "2020-06-07T06:30:58Z", "content": "AFP, publié le dimanche 07 juin 2020 à 08h30\r\nVotre montre connectée, qui mesure déjà votre activité physique, est-elle capable de détecter la contamination au coronavirus avant l'apparition des symp… [+3966 chars]"}, {"source": {"id": null, "name": "Pressesante.com"}, "author": null, "title": "9 vérités sur la perte de poids qu'on préfère ne pas voir - Presse santé", "description": "Comprendre pourquoi il est si difficile de perdre du poids peut vous aider à augmenter vos chances de réussite. Voici 9 faits auxquels il faut faire face.", "url": "https://www.pressesante.com/9-verites-sur-la-perte-de-poids-quon-prefere-ne-pas-voir/", "urlToImage": "https://www.pressesante.com/wp-content/uploads/2019/10/poids.jpg", "publishedAt": "2020-06-07T05:29:00Z", "content": "Il existe des raisons simples et claires pour lesquelles vous avez du mal à perdre ces kilos en trop. Mais si vous faites face à ces faits que vous refusez de voir généralement concernant la perte de… [+7300 chars]"}]}