{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Chiara Fiorillo", "title": "Man dies drinking cleaner he thought was drug championed by Trump to beat coronavirus - Mirror Online", "description": "Gary Lenius and his wife Wanda, both in their 60s, drank chloroquine phosphate last month after confusing it for hydroxychloroquine. Gary died and Wanda was left in critical condition", "url": "https://www.mirror.co.uk/news/us-news/man-dies-drinking-cleaner-thought-21924827", "urlToImage": null, "publishedAt": "2020-04-25T16:35:30Z", "content": "A man died after drinking fish tank cleaner, believing it was a malaria drug that could potentially beat coronavirus. \r\n Gary Lenius and his wife Wanda, both in their 60s, drank chloroquine phosphate last month after confusing it for hydroxychloroquine - a dr… [+3880 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Dominic Waghorn", "title": "Coronavirus: The good news (and not so good news) about the chances of a COVID-19 vaccine - Sky News", "description": "Scientists are optimistic about the prospects of finding a COVID-19 vaccine but there are unknowns ahead.", "url": "https://news.sky.com/story/coronavirus-the-good-news-and-not-so-good-news-about-the-chances-of-a-covid-19-vaccine-11978492", "urlToImage": null, "publishedAt": "2020-04-25T16:08:45Z", "content": null}, {"source": {"id": null, "name": "Edp24.co.uk"}, "author": "Dan Grimmer", "title": "Coronavirus in Norfolk, UK: Six more people die in county's hospitals | Health - Eastern Daily Press", "description": "Six more people with coronavirus, including a woman in her 30s, have died in Norfolk’s hospitals.", "url": "https://www.edp24.co.uk/news/health/six-more-patients-with-coronavirus-die-in-norfolk-hospitals-1-6624168", "urlToImage": null, "publishedAt": "2020-04-25T15:29:00Z", "content": "UpdatedPUBLISHED: 16:29 25 April 2020 | UPDATED: 16:29 25 April 2020\r\nFour more patients with coronavirus have died at the Norfolk and Norwich University Hospital. Pictures: BRITTANY WOODMAN\r\nArchant\r\nFour more patients were confirmed to have died at the Norf… [+2862 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Belarus orphanage seeks help amid 'critical' outbreak - BBC News", "description": "A Belarus orphanage says it has at least 23 cases, and that some of the children are \"extremely ill\".", "url": "https://www.bbc.co.uk/news/world-europe-52426260", "urlToImage": null, "publishedAt": "2020-04-25T15:20:06Z", "content": "Image copyrightGetty ImagesImage caption\r\n Authorities in Belarus have confirmed an outbreak at an orphanage for children with severe disabilities\r\nAt least 23 people have been infected with coronavirus at an orphanage for children with developmental disabili… [+1824 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Jenny Kirkham, Rebecca Day", "title": "Erin the 'miracle baby' born with a heart condition has beaten coronavirus - Manchester Evening News", "description": "'They are all truly amazing and we will be forever grateful', her mum said of the NHS heroes who saved her daughter's life", "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/erin-miracle-baby-born-heart-18150417", "urlToImage": null, "publishedAt": "2020-04-25T14:36:06Z", "content": "A six-month-old 'miracle baby' born with a heart condition has beaten coronavirus.\r\nMedics were moved to tears as they clapped for little Erin Bates, from Bury, as she was wheeled through the corridor having spent two weeks in an isolation unit.\r\nThe tot was … [+4394 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Laura Clements", "title": "Coronavirus cases in Wales reach 8,900 as 23 more people confirmed dead - Wales Online", "description": "The total number of deaths now stands at 774", "url": "https://www.walesonline.co.uk/news/wales-news/coronavirus-deaths-wales-cases-total-18149398", "urlToImage": null, "publishedAt": "2020-04-25T14:28:35Z", "content": "The total number of people in Wales who have now tested positive for coronavirus has reached 8,900 after Public Health Wales confirmed a further 299 cases on Saturday.\r\nAs the total number of people who have tested positive for Covid-19 in Wales creeps ever c… [+2235 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: UK hospital deaths pass 20,000 - BBC South East Wales", "description": "The government reveals the \"tragic and terrible milestone\", 51 days after the first virus-related death was announced in the UK.", "url": "https://www.bbc.co.uk/news/uk-52424413", "urlToImage": null, "publishedAt": "2020-04-25T14:24:29Z", "content": "Image copyrightGetty Images\r\nMore than 20,000 people have now died with coronavirus in UK hospitals, the Department of Health has announced.\r\nThe latest figures showed a total of 20,319 deaths in the UK, up by 813 on the previous day.\r\nAt the government's dai… [+4634 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By James Wood For Mailonline", "title": "Coronavirus patients who get put on a ventilator have just a 34% chance of survival, new study shows - Daily Mail", "description": "The figures come from the Intensive Care National Audit and Research Centre (ICNARC) and are based on a sample of 6,720 critically-ill coronavirus patients.", "url": "https://www.dailymail.co.uk/news/article-8256381/Coronavirus-patients-ventilator-just-34-chance-survival-new-study-shows.html", "urlToImage": null, "publishedAt": "2020-04-25T14:07:00Z", "content": "Coronavirus patients who get put on a ventilator have just a 34 per cent chance of survival, a new study has revealed.  \r\nThe figures come from the Intensive Care National Audit and Research Centre (ICNARC) and are based on a sample of 6,720 critically-ill co… [+2556 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus test online slots booked up within hour of site reopening - BBC News", "description": "Millions of key workers and people they live with can apply for a coronavirus test online.", "url": "https://www.bbc.co.uk/news/uk-52424044", "urlToImage": null, "publishedAt": "2020-04-25T14:02:19Z", "content": "Image copyrightPA Media\r\nCoronavirus tests offered to UK key workers were booked up within an hour - apart from some in Scotland.\r\nThe tests, which are targeted at those who are self-isolating, allow people to return to work as quickly as possible.\r\nHealth Se… [+4631 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nLizzie Roberts", "title": "Contact tracing: how has it worked for other countries, and could it really help ease UK lockdown? - The Telegraph", "description": "From teams of 'corona detectives' to Army cadets making thousands of calls a day, countries are tracking the spread of Covid-19", "url": "https://www.telegraph.co.uk/news/2020/04/25/what-contact-tracing-how-work-countries-uk-lockdown/", "urlToImage": null, "publishedAt": "2020-04-25T13:41:28Z", "content": "Countries around the world are rushing to launch contact tracing apps to identify who an infected person has had contact with, as part of efforts to slow the spread of the coronavirus. \r\nThe UK Government has announced the infrastructure was being put in plac… [+1754 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Immunity passports ‘could increase virus spread’ - BBC News", "description": "No evidence people who develop antibodies after recovering are protected against a second infection.", "url": "https://www.bbc.com/news/world-52425825", "urlToImage": null, "publishedAt": "2020-04-25T13:40:47Z", "content": "Image copyrightReutersImage caption\r\n Testing for antibodies is becoming more widespread\r\nGovernments should not issue so-called \"immunity passports\" or \"risk-free certificates\" as a way of easing lockdowns, the World Health Organization (WHO) says.\r\nIt said … [+4744 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Katrina Turrill", "title": "Bowel cancer symptoms: What colour is your poo? Sign of the deadly disease - Express", "description": "BOWEL cancer symptoms can be subtle as they don't necessarily make a person feel unwell. But one sign of the disease may present itself in a person's stools. What colour is your poo?", "url": "https://www.express.co.uk/life-style/health/1273790/bowel-cancer-symptoms-poo-colour-dark-red-blood-black", "urlToImage": null, "publishedAt": "2020-04-25T12:54:12Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Wright For Mailonline", "title": "Terminally ill ex-CBBC star battling cystic fibrosis fears she won't live to see end of lockdown - Daily Mail", "description": "Chelsie Whibley, 28, from Denmead, Hampshire, must undergo intensive intravenous treatment at home after her specialist Southampton Hospital unit was given over to coronavirus patients.", "url": "https://www.dailymail.co.uk/news/article-8256189/Terminally-ill-ex-CBBC-star-battling-cystic-fibrosis-fears-wont-live-end-lockdown.html", "urlToImage": null, "publishedAt": "2020-04-25T12:43:10Z", "content": "A terminally ill ex-CBBC star battling cystic fibrosis fears that she might not live to see the end of the lockdown as she faces treatment at home. \r\nChelsie Whibley, 28, has been instructed to quarantine indefinitely because she is classed along another 1.4m… [+1906 chars]"}, {"source": {"id": null, "name": "Gov.scot"}, "author": "The Scottish Government", "title": "Coronavirus (COVID-19): testing for key workers in Scotland - Scottish Government News", "description": "Guidance on coronavirus testing for key workers who are showing symptoms.", "url": "https://www.gov.scot/publications/coronavirus-covid-19-testing-for-key-workers-in-Scotland/", "urlToImage": null, "publishedAt": "2020-04-25T12:11:15Z", "content": "Testing of key workers\r\nThe UK government has established a new network of Covid testing facilities for key workers. This programme runs alongside the existing programme of testing in the NHS for clinical purposes and testing of key workers in health and soci… [+8940 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nPaul Nuki,", "title": "Two new waves of deaths are about to break over the NHS, new analysis warns - Telegraph.co.uk", "description": "Radical solutions will need to be found if the health service is to avoid formal rationing", "url": "https://www.telegraph.co.uk/global-health/science-and-disease/two-new-waves-deaths-break-nhs-new-analysis-warns/", "urlToImage": null, "publishedAt": "2020-04-25T12:04:00Z", "content": "There will then be a third wave of deaths for Britain to contend with. This is made up, not of emergency cases, but of people who are developing conditions such as cancer and heart disease which are going undiagnosed because of the Covid crisis.\r\nThese patien… [+1786 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By James Wood For Mailonline", "title": "New figures show number of people visiting UK's A&E wards down by half this month - Daily Mail", "description": "Health officials are worried many people are not seeking treatment because they fear contracting Covid-19, thereby jeopardising their survival and potentially becoming collateral damage.", "url": "https://www.dailymail.co.uk/news/article-8256237/New-figures-number-people-visiting-UKs-E-wards-half-month.html", "urlToImage": null, "publishedAt": "2020-04-25T11:23:22Z", "content": "The NHS is launching a new campaign to make sure people seek urgent care during a medical emergency after visits to A&amp;E dropped by almost 50 per cent this month.\r\nHealth officials are worried many people are not seeking treatment because they fear contrac… [+23274 chars]"}, {"source": {"id": null, "name": "Mkfm.com"}, "author": null, "title": "Road closed in Milton Keynes due to 'large number of vehicles' attending coronavirus test centre - MKFM", "description": "Milton Keynes Council have announced an emergency road closure in Milton Keynes due to a 'large number of vehicles' attending the new coronavirus drive through test centre.", "url": "https://www.mkfm.com/news/local-news/road-closed-in-milton-keynes-due-to-large-number-of-vehicles-attending-coronavirus-test-centre/", "urlToImage": null, "publishedAt": "2020-04-25T11:06:29Z", "content": "Saturday, April 25th, 2020 12:02pm\r\nMilton Keynes Council have announced an emergency road closure in Milton Keynes due to a 'large number of vehicles' attending the new coronavirus drive through test centre.\r\nOfficials have closed a section of Avebury Boulev… [+3996 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Rise in illegal drone flying near RAF bases in Moray - BBC News", "description": "Recent good weather is suspected for the increased use of drones over restricted areas in Moray.", "url": "https://www.bbc.co.uk/news/uk-scotland-north-east-orkney-shetland-52424523", "urlToImage": null, "publishedAt": "2020-04-25T10:44:00Z", "content": "Image copyrightGoogleImage caption\r\n A flight restriction zone is in place at RAF Lossiemouth\r\nDrones have increasingly been flown illegally near two military bases in Moray, the RAF has said.\r\nFight restriction zones are in place at RAF Lossiemouth and nearb… [+764 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Holly Christodoulou", "title": "UK troops given insect repellent Citriodiol after tests show spray could give ‘enhanced’ protection against co - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11478110/troops-given-insect-spray-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-25T09:38:32Z", "content": "BRITISH troops will be given insect repellant for protection against coronavirus after tests showed it may kill the deadly disease.\r\nCitriodiol has been known to fight types of the virus - with evidence now suggesting it could also tackle the Covid-19 strain.… [+3076 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Emma Brazell", "title": "Neighbours clap for care home nurse who died of coronavirus - Metro.co.uk", "description": "Locals surrounded the medic's house in Sutton to pay tribute to her during 'Clap For Carers' on Thursday.", "url": "https://metro.co.uk/2020/04/25/neighbours-clap-care-home-nurse-died-coronavirus-12608017/", "urlToImage": null, "publishedAt": "2020-04-25T09:15:17Z", "content": "Rahima Bibi Sidhanee, 69, brought so much love into this world (Picture: PA/Family Handout)\r\nNeighbours of a care home nurse who died after contracting coronavirus took to the streets to clap for her on Thursday.\r\nRahima Bibi Sidhanee, 69, who worked at Grenn… [+2246 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Faye Brown", "title": "Government warned last year to prepare for a pandemic and stockpile PPE - Metro.co.uk", "description": "A leaked Cabinet Office briefing said even a mild outbreak could cost tens of thousands of lives.", "url": "https://metro.co.uk/2020/04/25/government-warned-last-year-prepare-pandemic-stockpile-ppe-12607913/", "urlToImage": null, "publishedAt": "2020-04-25T09:12:04Z", "content": "UK ministers were warned last year of risks of a coronavirus pandemic (Picture: Cabinet Office)\r\nMinisters were warned last year about the devastating impact of a viral flu pandemic hitting the UK and urged to stockpile PPE. \r\nA leaked Cabinet Office briefing… [+4071 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": null, "title": "Pollen count today: UK hay fever and allergy suffers face high tree pollen count - Express.co.uk", "description": "HAY FEVER and allergy sufferers could be hard-hit today as the tree pollen count across the country is rated as high risk, the Met Office reports.", "url": "https://www.express.co.uk/news/weather/1273731/pollen-count-today-tree-pollen-high-hay-fever-symptoms-allergies-weekend-forecast-uk", "urlToImage": null, "publishedAt": "2020-04-25T08:45:00Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Elsom For Mailonline", "title": "Chris Whitty reveals the UK's 'reproduction number' dropped below 1 - Daily Mail", "description": "England's chief medical officer has offered a chink of light out of the lockdown after revealing coronavirus infection rates in the UK have been wrestled down.", "url": "https://www.dailymail.co.uk/news/article-8255677/Chris-Whitty-reveals-UKs-reproduction-number-dropped-1.html", "urlToImage": null, "publishedAt": "2020-04-25T08:38:55Z", "content": "Professor Chris Whitty has offered a chink of light out of the lockdown after revealing coronavirus infection rates have been wrestled down.\r\nEngland's chief medical officer said the reproduction number - or R0 - has been brought below 1, marking a critical a… [+4163 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Katrina Turrill", "title": "Coronavirus update: Six new symptoms of the deadly virus you need to look out for - Express", "description": "CORONAVIRUS has still taken a hold of the UK, with more than 143,000 confirmed cases and at least 19.506 deaths from the virus. Spotting the symptoms has never been so important, and the Centers for Disease Control and Prevention (CDC) has now added six new s…", "url": "https://www.express.co.uk/life-style/health/1273703/coronavirus-update-news-latest-symptoms-new-cdc", "urlToImage": null, "publishedAt": "2020-04-25T07:21:33Z", "content": "Coronavirus has been reported by patients to have a wide range of symptoms. Up until now, the CDC has listed the main symptoms as a fever, cough and shortness of breath or difficulty breathing. But six news symptoms have now been added to the list.After exper… [+1136 chars]"}, {"source": {"id": null, "name": "Zimeye.net"}, "author": null, "title": "Health Minister Confirms Gwanda Villagers' Fears That The Strange Malaria Killing People In The Area Could Actually Be Covid-19 - ZimEye - Zimbabwe News", "description": null, "url": "https://www.zimeye.net/2020/04/25/health-minister-confirms-gwanda-villagers-fears-that-the-strange-malaria-killing-people-in-the-area-could-actually-be-covid-19/", "urlToImage": null, "publishedAt": "2020-04-25T07:15:00Z", "content": "The Minister of Health and Child Care Doctor Obadiah Moyo has confirmed that there is an extremely thin line between symptoms of malaria and those of the Covid-19 disease currently sweeping through the world calling for extended screening efforts.\r\nThe Minist… [+2462 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Callum Hoare", "title": "‘Reservoir for viruses’ China told to permanently ban bat trade to prevent next pandemic - Express.co.uk", "description": "CHINA must permanently ban the hunting trade and consumption of wildlife animals, including bats, or a future pandemic similar to coronavirus is inevitable, research shows.", "url": "https://www.express.co.uk/news/world/1273464/china-xi-jinping-bat-animal-trade-coronavirus-pandemic-covid19-wuhan-seafood-market-spt", "urlToImage": null, "publishedAt": "2020-04-25T07:00:00Z", "content": null}, {"source": {"id": null, "name": "Lancashiretelegraph.co.uk"}, "author": "Joe Harrigan", "title": "Dental care shutdown: Patients in East Lancashire and nationwide left in agony due to PPE shortages - Lancashire Telegraph", "description": "DENTAL patients in East Lancashire are being forced to go without treatment, and in some cases left in agony, due to a lack of Personal Protective…", "url": "https://www.lancashiretelegraph.co.uk/news/18405275.dental-care-shutdown-patients-east-lancashire-nationwide-left-agony-due-ppe-shortages/", "urlToImage": null, "publishedAt": "2020-04-25T04:36:00Z", "content": "DENTAL patients in East Lancashire are being forced to go without treatment, and in some cases left in agony, due to a lack of Personal Protective Equipment in dental surgeries.\r\nNHS England has insisted that provisions have been made to make sure that people… [+2839 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Matt Atherton", "title": "Coronavirus warning - does your poo look like this? The texture that could be COVID-19 - Express", "description": "CORONAVIRUS is a deadly infection that's easily spread, and the disease has killed almost 20,000 people in the UK. You could be at risk of COVID-19 symptoms if you develop this mild sign when you go to the toilet. What texture is your poo, and should you be c…", "url": "https://www.express.co.uk/life-style/health/1273471/coronavirus-symptoms-signs-covid-19-infection-toilet-loose-poo-diarrhoea", "urlToImage": null, "publishedAt": "2020-04-25T03:01:37Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Shaun Wooller", "title": "Blood plasma from coronavirus survivors will be given to 5,000 NHS patients a week in new trial - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11475979/blood-plasma-coronavirus-survivors-nhs-trial/", "urlToImage": null, "publishedAt": "2020-04-25T01:42:35Z", "content": "BLOOD plasma from survivors will be given to 5,000 coronavirus patients a week in an NHS trial.\r\nIt is hoped antibodies in blood from those who have recovered will clear the bug in others with a weaker immune response.\r\n Doctors hope antibodies in recovered p… [+2136 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Betsi death report delay sparks investigation - BBC News", "description": "The north Wales health board reported all its deaths at once after issues with reporting systems.", "url": "https://www.bbc.com/news/uk-wales-52419068", "urlToImage": null, "publishedAt": "2020-04-24T19:23:29Z", "content": "Image copyrightGetty ImagesImage caption\r\n Betsi Cadwaladr health board reported 84 deaths in the north Wales area on Thursday\r\nThe recording of the number of people who have died with coronavirus is being investigated after a Welsh health board failed to rep… [+2468 chars]"}, {"source": {"id": null, "name": "Iflscience.com"}, "author": "Katy Pallister", "title": "Preliminary Study Suggests Coronavirus Has Gained Mutations Capable Of Changing Its Virulence - IFLScience", "description": "As scientists across the world direct their research efforts towards Covid-19, papers are piling up to be peer-reviewed. During this vigorous process, the", "url": "https://www.iflscience.com/health-and-medicine/preliminary-study-suggests-coronavirus-has-gained-mutations-capable-of-changing-its-virulence/", "urlToImage": null, "publishedAt": "2020-04-24T19:23:00Z", "content": "As scientists across the world direct their research efforts towards Covid-19, papers are piling up to be peer-reviewed. During this vigorous process, the methodology and results of the study are tested for their accuracy. Therefore, whilst these pre-print st… [+3843 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Paralysed Ed Jackson reaches Everest staircase feat - BBC News", "description": "Former rugby player Ed Jackson has climbed 89,056 steps and made 2,783 trips up and down the stairs.", "url": "https://www.bbc.co.uk/news/uk-england-somerset-52416450", "urlToImage": null, "publishedAt": "2020-04-24T19:09:39Z", "content": "Image copyrightWings for Life Image caption\r\n To simulate the ascent of Everest's 8,848m peak, Ed Jackson climbed 89,056 steps\r\nA paralysed ex-rugby player has climbed the equivalent height of Mount Everest on his parents' staircase.\r\nEd Jackson, from Bath, b… [+1708 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Lizzy Buchan", "title": "Government was warned last year that it needed an action plan to deal with a pandemic - The Independent", "description": "Labour brands revelations 'alarming' and calls for Michael Gove to be hauled before MPs", "url": "https://www.independent.co.uk/news/uk/politics/coronavirus-government-warned-pandemic-action-plan-cabinet-office-a9483291.html", "urlToImage": null, "publishedAt": "2020-04-24T19:02:04Z", "content": "The government was warned last year that it needed an action plan to deal with a coronavirus-style pandemic, according to a leaked Cabinet Office report.\r\nThe 600-page National Security Risk Assessment (NRSA) reportedly warned that a new pandemic virus could … [+7569 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Stephen Matthews Health Editor For Mailonline Sam Blanchard Senior Health Reporter For Mailonline", "title": "NHS to release plan next week to 'redeploy coronavirus capacity' - Daily Mail", "description": "NHS bosses are keen to get operating theatres back up and running and to return to business as usual for non-coronavirus patients who may have been missing out on treatment for weeks.", "url": "https://www.dailymail.co.uk/news/article-8254393/NHS-release-plan-week-redeploy-coronavirus-capacity.html", "urlToImage": null, "publishedAt": "2020-04-24T18:35:52Z", "content": "NHS hospitals could restart routine operations as soon as next week as the health service prepares plans to get back on its feet as the coronavirus crisis blows over. \r\nPrivate hospitals have laid empty in the past week and up to 40,000 NHS beds are thought t… [+9807 chars]"}, {"source": {"id": null, "name": "Sluggerotoole.com"}, "author": "Mick Fealty", "title": "Drawing conclusions on provisional #Covid19 figures does no favours to public understanding. - Slugger O'Toole", "description": "Significant news has just come through from RTE News this evening… The total death toll here is now 1,014, including 185* probable deaths, after two deaths that had previously been reported are no longer classified as related to Covid-19. [Emphasis added] A l…", "url": "https://sluggerotoole.com/2020/04/24/drawing-conclusions-on-provisional-covid19-figures-does-no-favours-to-public-understanding/", "urlToImage": null, "publishedAt": "2020-04-24T18:14:00Z", "content": "Significant news has just come through from RTE News this evening…\r\nThe total death toll here is now 1,014, including 185* probable deaths, after two deaths that had previously been reported are no longer classified as related to Covid-19. [Emphasis added]\r\nA… [+3263 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Les Steed", "title": "How does key worker testing work and what time can I apply for a coronavirus test? - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11469520/key-worker-coronavirus-testing-how-what-time/", "urlToImage": null, "publishedAt": "2020-04-24T17:35:15Z", "content": "MATT HANCOCK announced that testing can now be provided for up to seven million key workers and emergency staff.\r\nHere's how to get tested if you are an essential worker who believes that you or a household member has coronavirus.\r\n Matt Hancock said key work… [+6641 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Emma Brazell", "title": "Scientists detect coronavirus on particles of air pollution - Metro.co.uk", "description": "It raises a suggestion that higher levels of particle pollution could lead to higher rates of infection - for example in regions of northern Italy.", "url": "https://metro.co.uk/2020/04/24/scientists-detect-coronavirus-particles-air-pollution-12605944/", "urlToImage": null, "publishedAt": "2020-04-24T17:13:01Z", "content": "The new medical work is preliminary and it is not confirmed if the virus remains viable on pollution particles (Picture: Rex/ PA)\r\nCoronavirus has been detected on particles of air pollution by scientists looking into whether the illness could be carried this… [+2081 chars]"}, {"source": {"id": null, "name": "Worthingherald.co.uk"}, "author": "John Holden", "title": "Coronavirus: Number of hospital deaths and confirmed cases in West Sussex rise - Worthing Herald", "description": "The number of coronavirus related deaths in West Sussex hospitals has increased alongside a rise in confirmed cases.", "url": "https://www.worthingherald.co.uk/health/coronavirus/coronavirus-number-hospital-deaths-and-confirmed-cases-west-sussex-rise-2549499", "urlToImage": null, "publishedAt": "2020-04-24T16:26:00Z", "content": "According to the latest figures from NHS England, 249 people have now sadly died in hospital after testing positive for coronavirus, as of April 24.\r\nToday's statistics show an increase of 17 fatalities from Wednesday (April 22).\r\nNHS England figures do not i… [+1444 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Sian Elvin", "title": "Coronavirus UK: 'Amazing' doctor who loved caring for babies dies - Metro.co.uk", "description": "'He treated every patient and family he cared for as his own. I couldn't have been prouder of him.'", "url": "https://metro.co.uk/2020/04/24/three-nhs-doctors-12605725/", "urlToImage": null, "publishedAt": "2020-04-24T15:52:10Z", "content": "Dr Vishna Rasiah, who has been described as talented, dedicated and respected, has died after contracting Covid-19 (Picture: PA)\r\nA talented, dedicated and respected doctor has died after contracting coronavirus.\r\nDr Vishna Rasiah, who worked at Birmingham Wo… [+2320 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Jacob Jarvis", "title": "UK coronavirus death toll at least 5,000 higher than hospital reports, new figures show - Evening Standard", "description": "", "url": "https://www.standard.co.uk/news/uk/coronavirus-uk-death-toll-5000-higher-ons-covid-19-a4423611.html", "urlToImage": null, "publishedAt": "2020-04-24T15:37:40Z", "content": "The true number of deaths linked to coronavirus in the UK is at least 5,000 higher than those reported from hospitals, new figures show.\r\nLatest numbers from the Office for National Statistics show total of 14,192 deaths where Covid-19 was the primary or susp… [+1230 chars]"}, {"source": {"id": null, "name": "Scotsman.com"}, "author": "Claire Schofield", "title": "Coronavirus face masks: what types of face coverings are there - and how effective are they? - Edinburgh News", "description": "Whether the public should wear face masks or not to prevent the spread of coronavirus is an issue that has come under much debate", "url": "https://www.edinburghnews.scotsman.com/health/coronavirus/coronavirus-face-masks-what-types-face-coverings-are-there-and-how-effective-are-they-2549323", "urlToImage": null, "publishedAt": "2020-04-24T15:04:00Z", "content": "At present, the World Health Organisation (WHO) is currently only advising those who are sick and showing symptoms of the virus to wear a mask, such as coughing or sneezing, or if you are caring for someone with a suspected coronavirus infection.\r\nAside from … [+3502 chars]"}, {"source": {"id": null, "name": "Examinerlive.co.uk"}, "author": "Jessica Sansome, Brett Gibbons", "title": "Exhausted mum 'named and shamed' over Clap for Carers 'snub' - Leicestershire Live", "description": "Woman claimed that she was criticised on social media for not taking part last week and accused of 'showing the street up'", "url": "https://www.examinerlive.co.uk/news/uk-world-news/exhausted-mum-named-shamed-facebook-18144302", "urlToImage": null, "publishedAt": "2020-04-24T14:59:00Z", "content": "A tearful mum says she is really upset after being 'named and shamed' on Facebook for not joining in with Clap for Carers.\r\nClap for Carers started some weeks ago and takes place every Thursday at 8pm to recognise the work of NHS and key workers in the fight … [+1744 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "UK hospital coronavirus death toll rises to 19506 as 768 more die - ITV News", "description": "A total of 19,506 patients had died in hospital after testing positive for coronavirus in the UK as of 5pm on Thursday, the Department of Health said, up by 768 from 18,738 the day before.\n\nThe daily figure is up on the previous day when 616 people were confi…", "url": "https://www.itv.com/news/2020-04-24/uk-hospital-coronavirus-death-toll-rises-to-19-506-as-768-more-die/", "urlToImage": null, "publishedAt": "2020-04-24T14:17:00Z", "content": null}, {"source": {"id": null, "name": "Pulsetoday.co.uk"}, "author": null, "title": "GPs should contact all shielded patients as a 'follow-up' to letter, says NHS - Pulse", "description": "Practices should contact all of their patients who are shielding from coronavirus (Covid-19) as a 'follow-up' to the NHS letter notifying them to stay at home for 12 weeks, NHS England has said.", "url": "http://www.pulsetoday.co.uk/clinical/clinical-specialties/respiratory-/gps-should-contact-all-shielded-patients-as-a-follow-up-to-letter-says-nhs/20040685.article", "urlToImage": null, "publishedAt": "2020-04-24T13:18:45Z", "content": "Practices should contact all of their patients who are shielding from coronavirus (Covid-19) as a 'follow-up' to the NHS letter notifying them to stay at home for 12 weeks, NHS England has said.\r\nDuring this follow-up conversation, GPs should discuss what shi… [+3708 chars]"}, {"source": {"id": null, "name": "Examinerlive.co.uk"}, "author": "Lauren Ballinger", "title": "Police spell out lockdown rules for \"confused\" Yorkshire Dales day trippers - ExaminerLive", "description": "More than 350 people have been fined for breaking lockdown rules", "url": "https://www.examinerlive.co.uk/news/west-yorkshire-news/police-spell-out-lockdown-rules-18145084", "urlToImage": null, "publishedAt": "2020-04-24T12:54:00Z", "content": "Police have urged day trippers tempted by the good weather forecast this weekend to stay away from the Yorkshire Dales.\r\nAnd they have said despite some confusion over the rules, it couldn't be clearer that we must all stay at home.\r\nNorth Yorkshire Police sa… [+2599 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Will Sweden's coronavirus gamble pay off? - The Telegraph", "description": "Sweden has one of the world’s most controversial - and closely watched - coronavirus strategies. Instead of ordering people to stay at home and shutting down...", "url": "https://www.youtube.com/watch?v=dkN7FFyv-QA", "urlToImage": null, "publishedAt": "2020-04-24T11:47:45Z", "content": "Sweden has one of the worlds most controversial - and closely watched - coronavirus strategies. Instead of ordering people to stay at home and shutting down all non-essential businesses, the Swedish government has simply asked people to adhere to social dista… [+439 chars]"}, {"source": {"id": null, "name": "Doncasterfreepress.co.uk"}, "author": "Tim Cunningham", "title": "Doncaster coronavirus deaths may be missed in official figures - Doncaster Free Press", "description": "At least two deaths linked to coronavirus in Doncaster may not be captured in official estimates, new figures suggest.", "url": "https://www.doncasterfreepress.co.uk/health/coronavirus/doncaster-coronavirus-deaths-may-be-missed-official-figures-2548746", "urlToImage": null, "publishedAt": "2020-04-24T11:02:00Z", "content": "Shadow social care minister Liz Kendall has called on the Government to publish daily figures of Covid-19 deaths outside hospital settings, including in care homes, to understand \"the true scale of the problem.\"\r\nOffice for National statistics data shows that… [+1965 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Rob Powell, political correspondent, and Greg Heffer, political reporter", "title": "Coronavirus test applications closed after 5,000 home kits ordered in two minutes - Sky News", "description": "Downing Street reveals that 5,000 home-testing kits were ordered within two minutes of the new website opening.", "url": "https://news.sky.com/story/coronavirus-online-applications-for-covid-19-tests-temporarily-closed-due-to-huge-demand-11978070", "urlToImage": null, "publishedAt": "2020-04-24T10:11:24Z", "content": null}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Staff devastated as 15 residents of the same nursing home die in the space of a month - ITV News", "description": "Staff at a nursing home in Newport have been left devastated following the\ndeaths of 15 residents in the space of a month.\n\nFourteen of the elderly residents at Tregwilym Lodge in Rogerstone were showing symptoms of coronavirus before they died, although test…", "url": "https://www.itv.com/news/wales/2020-04-24/fifteen-nursing-home-residents-die-in-the-space-of-a-month/", "urlToImage": null, "publishedAt": "2020-04-24T09:44:00Z", "content": "Staff at a nursing home in Newport have been left devastated following the\r\ndeaths of 15 residents in the space of a month.\r\nFourteen of the elderly residents at Tregwilym Lodge in Rogerstone were showing symptoms of coronavirus before they died, although tes… [+1796 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nAnnelies Gartner", "title": "How close are we to a coronavirus vaccine - and when will trials begin? - Telegraph.co.uk", "description": "Latest news on the search for a vaccine against the new coronavirus", "url": "https://www.telegraph.co.uk/global-health/science-and-disease/coronavirus-vaccine-trials-start-covid-19-latest-update/", "urlToImage": null, "publishedAt": "2020-04-24T08:57:32Z", "content": "As Covid-19 has rapidly spread around the world there has been a mad scramble to find a vaccine. \r\nIn the UK a potential coronavirus vaccine being developed at the University of Oxford will begin human trials from Thursday, Matt Hancock, the Health Secretary,… [+1550 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "BBC News", "title": "What is contact tracing and how does it work? - BBC News", "description": "When lockdown ends, contact tracing could help limit the spread of coronavirus.", "url": "https://www.bbc.com/news/av/technology-52401049/coronavirus-what-is-contact-tracing-and-how-does-it-work", "urlToImage": null, "publishedAt": "2020-04-24T08:29:46Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Jessica Knibbs", "title": "Coronavirus symptoms: Do your toes look like this? Signs you could have 'COVID toes' - Express", "description": "CORONAVIRUS has caused mass havoc in its wake. The UK's updated cases of death from the deadly virus sits at an astonishing 17,337. Having toes which resemble the following could mean you're at risk of an infection.", "url": "https://www.express.co.uk/life-style/health/1272455/coronavirus-update-uk-cases-news-symptoms-covid-toes-frostbite-like-purple-red", "urlToImage": null, "publishedAt": "2020-04-24T08:14:00Z", "content": null}, {"source": {"id": null, "name": "Expressandstar.com"}, "author": null, "title": "Birmingham mother dies with coronavirus six days after giving birth - expressandstar.com", "description": "The family of a new mother who died in hospital without ever getting to hold her baby have spoken of their devastation.", "url": "https://www.expressandstar.com/news/health/coronavirus-covid19/2020/04/24/birmingham-mother-dies-in-hospital-six-days-after-giving-birth/", "urlToImage": null, "publishedAt": "2020-04-24T07:37:00Z", "content": "Fozia Hanif, who had tested positive for coronavirus, died at Birmingham's Heartlands Hospital on April 8 after her condition deteriorated following the birth of her son. \r\nThe 29-year-old - whose baby remains in hospital but has tested negative for Covid-19 … [+2426 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Coronavirus: 'Too soon' to end lockdown but health secretary 'comfortable' with some businesses reopening - Sky News", "description": "", "url": "https://news.sky.com/story/coronavirus-too-soon-to-end-lockdown-but-health-secretary-comfortable-with-building-sites-reopening-11977971", "urlToImage": null, "publishedAt": "2020-04-24T07:04:48Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Kathleen Speirs, Ryan Merrifield", "title": "'One in a million' nurse described 'excruciating' symptoms before dying of coronavirus - Mirror Online", "description": "Angela Cunningham's death saw an outpouring of grief on social media, where the veteran nurse had detailed her agonising symptoms, including vomiting and muscle pain, in the days before going into hospital", "url": "https://www.mirror.co.uk/news/uk-news/one-million-nurse-described-excruciating-21918725", "urlToImage": null, "publishedAt": "2020-04-24T06:08:50Z", "content": "The heartbreak of a popular nurse's tragic death from coronavirus, just days before she turned 60, will \"never heal\", her brother has said.\r\nAngela Cunningham, known as Angie, had been on a ventilator in ITU at Borders General Hospital for a week after testin… [+2692 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: What do the stats tell us in Wales? - BBC News", "description": "Where are the hot spots in Wales and what is happening in care homes?", "url": "https://www.bbc.co.uk/news/uk-wales-52380643", "urlToImage": null, "publishedAt": "2020-04-24T05:41:30Z", "content": "Image copyrightGetty ImagesImage caption\r\n Beaches such as this one in Rhyl are all-but deserted during lockdown restrictions\r\nWhat can different statistics tell us about coronavirus in Wales so far?\r\nWe seem to be bombarded with different measures, but what … [+10081 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "David Rhodes", "title": "Coronavirus: Middlesbrough inhabitants most 'at risk' of dying - BBC News", "description": "A think tank says people in Middlesbrough have the highest chance of dying from Covid-19.", "url": "https://www.bbc.com/news/uk-england-tees-52354430", "urlToImage": null, "publishedAt": "2020-04-23T23:52:00Z", "content": "Let us know you agree to cookies\r\nWe use cookies to give you the best online experience. Please let us know if you agree to all of these cookies.\r\nImage caption\r\n Parks in Middlesbrough remain closed\r\nThe Mayor of Middlesbrough recently ordered all of the tow… [+6161 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: 'I faked having Covid-19 on Facebook and got arrested' - BBC News", "description": "Across the world police are chasing down alleged symptom-fakers who are being accused of triggering panic.", "url": "https://www.bbc.com/news/technology-52397294", "urlToImage": null, "publishedAt": "2020-04-23T23:21:30Z", "content": "Image copyrightTyler County Sheriff's Office/ GettyImage caption\r\n Mr Brandin's picture released by police\r\nMichael Lane Brandin knew his Facebook post would cause a stir.\r\nWhat he didn't realise was that he'd be arrested, lose his job and face a trial that c… [+4279 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Kat Lay", "title": "The next big shortage: dialysis machines | News - The Times", "description": "Doctors have warned that they face a “critical” shortage of vital machines for patients with coronavirus and kidney failure in intensive care units.Almost a third of Covid-19 patients in critical care", "url": "https://www.thetimes.co.uk/article/the-next-big-shortage-dialysis-machines-3ljrnw2ks", "urlToImage": null, "publishedAt": "2020-04-23T23:01:00Z", "content": "Doctors have warned that they face a critical shortage of vital machines for patients with coronavirus and kidney failure in intensive care units.\r\nAlmost a third of Covid-19 patients in critical care need dialysis because they have developed acute kidney fai… [+535 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Will Pavia, David Charter, Henry Zeffman", "title": "Only a tenth of New York ventilator patients survive coronavirus - The Times", "description": "Little more than a tenth of Covid-19 patients who have been put on ventilators survive, according to the largest and most comprehensive study of sufferers in the United States who were admitted to", "url": "https://www.thetimes.co.uk/article/only-a-tenth-of-new-york-ventilator-patients-survive-coronavirus-920vg6dtp", "urlToImage": null, "publishedAt": "2020-04-23T23:01:00Z", "content": "Little more than a tenth of Covid-19 patients who have been put on ventilators survive, according to the largest and most comprehensive study of sufferers in the United States who were admitted to hospital.\r\nVentilators have been held up as the last hope for … [+492 chars]"}, {"source": {"id": null, "name": "Shieldsgazette.com"}, "author": "Debra Fox", "title": "Coronavirus cases rise by 13 across South Tyneside as six more patients die within hospital trust - Shields Gazette", "description": "Another 16 patients have lost their lives after testing positive for coronavirus at the hospital trust which serves South Tyneside, according to the latest data from NHS England.", "url": "https://www.shieldsgazette.com/health/coronavirus/south-tynesides-coronavirus-cases-stand-464-16-more-patients-die-under-care-boroughs-hospital-trust-2498479", "urlToImage": null, "publishedAt": "2020-04-23T22:37:37Z", "content": "The figures show 242 people have died in hospitals covered by South Tyneside and Sunderland NHS Foundation Trust as of Saturday, April 25.\r\nIn total, 905 people who had tested positive for coronavirus have died across the North Easts hospital trusts.\r\nForty-t… [+3429 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus lockdown: Living with my parents under new house rules - BBC News", "description": "Madeleine, 22, shows us what life is like for a college student who has moved back in with her parents.", "url": "https://www.bbc.com/news/world-us-canada-52358591", "urlToImage": null, "publishedAt": "2020-04-23T21:01:28Z", "content": "Image copyrightMadeleine Hordinski\r\nWhat's life like under lockdown for a university student who has moved back in with her family?\r\nHi, my name is Madeleine Hordinski, I'm 22, and I'm living at home with my parents and my 17-year-old sister in Cincinnati, Oh… [+6077 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Harrison Jones", "title": "UK urged 'do your bit' with 25,000 to be invited to take part in coronavirus study - Metro.co.uk", "description": "'Take part in this vital research for your country.'", "url": "https://metro.co.uk/2020/04/23/uk-urged-bit-25000-invited-take-part-coronavirus-study-12602033/", "urlToImage": null, "publishedAt": "2020-04-23T20:38:08Z", "content": "Participants will give nose and throat swabs in one of the biggest virus infection and antibodies studies that this country has ever seen (Picture: Getty Images)\r\nThe Health Secretary Matt Hancock has urged the public to do your bit by taking part in a large-… [+4458 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Britons come together to Clap for our Carers and thank the NHS - The Telegraph", "description": "People across the UK came out on their doorsteps, balconies, windows and gardens to clap for our cares for the fifth week running. For all the latest on coro...", "url": "https://www.youtube.com/watch?v=XZo5XuydB9M", "urlToImage": null, "publishedAt": "2020-04-23T19:45:53Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Henry McDonald, Pamela Duncan", "title": "Lockdown may be lifted earlier in Northern Ireland than rest of UK - The Guardian", "description": "Arlene Foster makes statement as it emerges extra critical care capacity not expected to be needed", "url": "https://www.theguardian.com/world/2020/apr/23/lockdown-may-be-lifted-earlier-in-northern-ireland-than-rest-of-uk", "urlToImage": null, "publishedAt": "2020-04-23T19:09:46Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Frances Perraudin, Rowena Mason", "title": "NHS supplier urges public not to buy out medical masks - The Guardian", "description": "UK distributor of PPE ensures sales of its clinical masks are ‘not diverted’ from key workers", "url": "https://www.theguardian.com/world/2020/apr/23/nhs-supplier-urges-public-not-to-buy-out-medical-masks", "urlToImage": null, "publishedAt": "2020-04-23T18:44:59Z", "content": "The public has been urged not to buy medical face masks so that stocks can be preserved for the NHS, following scientists advice to the government saying cloth coverings could be worn to stem the spread of coronavirus.\r\nThe advice from Arco, one of the UKs le… [+4385 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Paul Dinsdale For Mailonline Vanessa Chalmers Health Reporter For Mailonline", "title": "NHS trusts buy their own antibody kits from Dutch firm to test staff - Daily Mail", "description": "Hundreds of the Biozek tests have already been used on NHS staff in London, Manchester and Leicester as hospitals face a surge in demand at a time when up to a fifth of the workforce are off sick.", "url": "https://www.dailymail.co.uk/news/article-8250133/NHS-trusts-buy-antibody-kits-Dutch-firm-test-staff.html", "urlToImage": null, "publishedAt": "2020-04-23T18:32:57Z", "content": "Five trusts in England are in talks with Dutch firm Biozek Medical to buy thousands of its rapid finger-prick tests which give a diagnosis in a matter of minutes\r\nNHS trusts have resorted to buying coronavirus antibody tests overseas in a bid to get their sta… [+13487 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus: Lowest weekday rise in UK hospital deaths for three weeks - Yahoo News UK", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_cadf5037-f6db-451a-bdf4-ed479e7b2e64&lang=en-GB&inline=false", "urlToImage": null, "publishedAt": "2020-04-23T17:57:00Z", "content": "Yahoo is part of Verizon Media. Click 'I agree' to allow Verizon Media and our partners to use cookies and similar technologies to access your device and use your data (including location) to understand your interests, and provide and measure personalised ads… [+344 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": null, "title": "LIVE: Health secretary giving daily coronavirus briefing | Politics News - Sky News", "description": "Deaths of UK hospital patients with COVID-19 reach 18,738, but social distancing is said to be working.", "url": "https://news.sky.com/story/live-health-secretary-gives-daily-coronavirus-briefing-11977730", "urlToImage": null, "publishedAt": "2020-04-23T16:07:30Z", "content": null}]}