{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nLaura Donnelly,", "title": "Lifting lockdown for all except the most vulnerable would see more than 100,000 die, government scientist warns - Telegraph.co.uk", "description": "Prof Neil Ferguson said the young and healthy returning to work while keeping the vulnerable shielded would still see an increase in deaths", "url": "https://www.telegraph.co.uk/news/2020/04/26/lifting-lockdown-except-vulnerable-would-see-100000-die-government/", "urlToImage": null, "publishedAt": "2020-04-26T17:49:00Z", "content": "Lifting lockdown for all except the elderly would see more than than 100,000 die, the scientist behind the governments modelling has warned. \r\nProfessor Neil Ferguson spoke out amid growing calls for an easing of social distancing restrictions in order to lim… [+807 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Ian Sample", "title": "Coronavirus UK: government assessing antibody test kits - The Guardian", "description": "Ministers are considering ordering millions of tests although concerns remain over their accuracy", "url": "https://www.theguardian.com/world/2020/apr/26/coronavirus-uk-government-assessing-antibody-test-kits", "urlToImage": null, "publishedAt": "2020-04-26T17:40:59Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "UK vaccine trial volunteer says she is 'doing fine' after online death rumours - The Guardian", "description": "A fake article about Elisa Granato’s death was circulated on social media", "url": "https://www.theguardian.com/world/2020/apr/26/uk-coronavirus-vaccine-trial-subject-doing-fine-online-death-rumours-elisa-granato", "urlToImage": null, "publishedAt": "2020-04-26T17:33:48Z", "content": "One of the first people to be injected as part of UK human trials for a coronavirus vaccine has said she is doing fine, after a fake article about her death was circulated on social media.\r\nThe article claims that microbiologist Dr Elisa Granato, who took par… [+2400 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": null, "title": "Global coronavirus death toll could be 60% higher than reported - Financial Times", "description": "Mortality statistics show 122,000 deaths in excess of normal levels across 14 countries analysed by the FT", "url": "https://www.ft.com/content/6bd88b7d-3386-4543-b2e9-0d5c6fac846c", "urlToImage": null, "publishedAt": "2020-04-26T17:06:03Z", "content": "The death toll from coronavirus may be almost 60 per cent higher than reported in official counts, according to an FT analysis of overall fatalities during the pandemic in 14 countries. \r\nMortality statistics show 122,000 deaths in excess of normal levels acr… [+5228 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Alahna Kindred", "title": "Construction sites to open at nights and weekends to kickstart economy after coronavirus lockdown - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11484433/construction-sites-coronavirus-lockdown/", "urlToImage": null, "publishedAt": "2020-04-26T17:05:38Z", "content": "CONSTRUCTIONS sites will open at night and at the weekend to help kickstart the economy after the coronavirus lockdown, it has bee reported.\r\nMinisters are planning a change in the the law to override restrictions preventing builders from carrying out loud wo… [+3962 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Coronavirus: 'Definite trend' for falling hospital numbers as deaths hit April low - Sky News", "description": "There were 413 coronavirus-linked hospital deaths reported on Sunday - the smallest numerical increase since last month.", "url": "https://news.sky.com/story/coronavirus-hospital-deaths-england-scotland-and-wales-report-fewer-fatalities-11979059", "urlToImage": null, "publishedAt": "2020-04-26T16:38:54Z", "content": null}, {"source": {"id": null, "name": "Islandecho.co.uk"}, "author": null, "title": "LARGE SPIKE IN CORONAVIRUS CASES WITH TOTAL NOW HITTING OVER 100 - Island Echo", "description": "The total number of confirmed cases of COVID-19 on the Isle of Wight has breached the 100 mark, according to Public Health England. There has been a large spike in the official number of confirmed cases, rising from 86 yesterday to 101 today (Sunday) - an inc…", "url": "https://www.islandecho.co.uk/large-spike-in-coronavirus-cases-with-total-now-hitting-over-100/", "urlToImage": null, "publishedAt": "2020-04-26T16:38:27Z", "content": null}, {"source": {"id": null, "name": "Shieldsgazette.com"}, "author": "Fiona Thompson", "title": "Six more patients who tested positive for coronarivus die at South Tyneside's hospital trust - Shields Gazette", "description": "Another six patients have lost their lives after testing positive for coronavirus at the hospital trust which serves South Tyneside, according to the latest data from NHS England.", "url": "https://www.shieldsgazette.com/health/coronavirus/six-more-patients-who-tested-positive-coronarivus-die-south-tynesides-hospital-trust-2498479", "urlToImage": null, "publishedAt": "2020-04-26T16:35:57Z", "content": "The figures show 248 people have now died in hospitals covered by South Tyneside and Sunderland NHS Foundation Trust as of today, Sunday, April 26.\r\nIn total, 924 people who had tested positive for coronavirus have died across the North Easts hospital trusts.… [+3528 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Jane Dalton", "title": "France limits nicotine sales after researchers say it may protect against coronavirus - The Independent", "description": "Study based on 483 patients suggested smokers were infected with Covid-19 less than others", "url": "https://www.independent.co.uk/news/world/europe/coronavirus-france-nicotine-patch-gum-research-covid-19-a9484696.html", "urlToImage": null, "publishedAt": "2020-04-26T16:32:12Z", "content": "France is limiting sales of nicotine substitutes after new research suggested the drug may offer some protection against coronavirus.\r\nHealth chiefs say they want to avoid a shortage of products such as nicotine patches and gum and to prevent their incorrect … [+1996 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Ellie Cambridge", "title": "Coronavirus tracking app suggests bug was spreading through UK in January – weeks before first confirmed c - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11483845/coronavirus-app-uk-january-bug/", "urlToImage": null, "publishedAt": "2020-04-26T16:24:22Z", "content": "CORONAVIRUS was silently spreading through Britain from January, a tracking app suggests - weeks before the first confirmed case.\r\nCOVID Symptom tracker, created by King's College London, says it's data shows the killer virus was already in the country by the… [+4221 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Valerie Edwards For Dailymail.com Reuters", "title": "WHO says there's 'NO evidence' that having coronavirus gives immunity - Daily Mail", "description": "The World Health Organization (WHO) has warned that recovering from the coronavirus may not protect people from reinfection as antibody testing kicks-off across the United States.", "url": "https://www.dailymail.co.uk/news/article-8258423/WHO-says-theres-NO-evidence-having-coronavirus-gives-immunity.html", "urlToImage": null, "publishedAt": "2020-04-26T16:09:09Z", "content": "The World Health Organization (WHO) has warned that recovering from the coronavirus may not protect people from reinfection as antibody testing kicks-off across the United States where there are more than 959,000. confirmed cases.  \r\n'There is currently no ev… [+5077 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Ian Sample", "title": "More than 2m operations cancelled as NHS fights Covid-19 - The Guardian", "description": "Backlog of procedures in England could cost NHS £3bn to work through after crisis", "url": "https://www.theguardian.com/society/2020/apr/26/more-than-two-million-operations-cancelled-as-nhs-fights-covid-19", "urlToImage": null, "publishedAt": "2020-04-26T15:48:41Z", "content": null}, {"source": {"id": null, "name": "Edp24.co.uk"}, "author": "Dan Grimmer", "title": "Coronavirus testing centres for key workers open in Norwich, Gorleston and King's Lynn | Health - Eastern Daily Press", "description": "Health bosses have said that coronavirus testing is now available to key workers, such as teachers or food industry staff, at three locations in Norfolk.", "url": "https://www.edp24.co.uk/news/health/coronavirus-testing-centres-for-norfolk-key-workers-open-1-6624745", "urlToImage": null, "publishedAt": "2020-04-26T15:35:00Z", "content": "PUBLISHED: 16:35 26 April 2020 | UPDATED: 16:46 26 April 2020\r\nKey workers can now book for coronavirus tests, through their employers. Photo: NCH&amp;C\r\nArchant\r\nManagers of key workers are being urged to book through the local system - because none of the c… [+2695 chars]"}, {"source": {"id": null, "name": "Eadt.co.uk"}, "author": "Tom Potter", "title": "Another four coronavirus deaths confirmed at Ipswich and Colchester hospitals - East Anglian Daily Times", "description": "Another four people have died at Ipswich and Colchester hospitals as a result of coronavirus.", "url": "https://www.eadt.co.uk/news/another-four-coronavirus-deaths-confirmed-at-ipswich-and-colchester-hospitals-1-6624733", "urlToImage": null, "publishedAt": "2020-04-26T15:16:00Z", "content": "PUBLISHED: 16:16 26 April 2020 | UPDATED: 16:16 26 April 2020\r\nESNEFT operates Ipswich and Colchester hospitals Picture: SARAH LUCY BROWN\r\nArchant\r\nOne person died at Ipswich Hospital, while three people died at Colchester Hospital, according to East Suffolk … [+2525 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nJordan Kelly-Linden", "title": "University of Oxford Covid-19 vaccine: everything we know so far - Telegraph.co.uk", "description": "A million doses of their experimental coronavirus vaccine could be ready as early as September, Oxford scientists say", "url": "https://www.telegraph.co.uk/global-health/science-and-disease/oxford-university-coronavirus-vaccine-trial-covid-news/", "urlToImage": null, "publishedAt": "2020-04-26T15:04:00Z", "content": "When asked how they managed to move the usually lengthy process of vaccine approval along so quickly, Professor Sarah Gilbert, who is leading the study, said it was their ongoing research into Disease X an as yet unknown infectious agent earmarked as a potent… [+1434 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Andy Gregory", "title": "Up to six million UK residents may have already had coronavirus, NHS adviser says - The Independent", "description": "Oxford epidemiologist says virus is ‘very rapidly transmitted’ before symptoms show in half of cases", "url": "https://www.independent.co.uk/news/health/coronavirus-uk-cases-contact-tracing-app-test-nhs-a9484576.html", "urlToImage": null, "publishedAt": "2020-04-26T14:45:32Z", "content": "As many as six million people in the UK may have already contracted coronavirus, according to the scientist behind the governments new contact tracing smartphone app.\r\nProfessor Christophe Fraser leads an NHS-backed team working at the forefront of efforts to… [+2958 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Katrina Turrill", "title": "Cancer symptoms: Five signs you should be looking out for during coronavirus lockdown - Express", "description": "CANCER has not stopped in the wake of coronavirus and spotting signs and symptoms now is still as important as ever. Here are five signs you should be looking out for during coronavirus lockdown.", "url": "https://www.express.co.uk/life-style/health/1274018/cancer-symptoms-signs-weight-loss-fever-fatigue-pain-skin-changes-coronavirus-lockdown", "urlToImage": null, "publishedAt": "2020-04-26T14:27:25Z", "content": null}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Athlete's cancer treatment hopes dashed due to lockdown - BBC News", "description": "Sarah Wright was accepted on to a drug trial in the US but cannot fly due to coronavirus restrictions.", "url": "https://www.bbc.com/news/uk-england-kent-52431390", "urlToImage": null, "publishedAt": "2020-04-26T13:50:44Z", "content": "Image copyrightSarah WrightImage caption\r\n Sarah and Adam Wright with baby Everleigh\r\nA former Commonwealth Games athlete is unable to access a potentially life-saving drug due to the coronavirus pandemic.\r\nSarah Wright, 33, was in the British Shooting team w… [+2976 chars]"}, {"source": {"id": null, "name": "Theguardian.comsociety"}, "author": "Ian Sample", "title": "Missed vaccinations could lead to other fatal outbreaks, doctors warn - The Guardian", "description": "GPs worried thousands may delay routine appointments due to fear of catching coronavirus", "url": "https://amp.theguardian.comsociety/2020/apr/26/missed-vaccinations-could-lead-to-other-fatal-outbreaks-doctors-warn", "urlToImage": null, "publishedAt": "2020-04-26T13:45:46Z", "content": "Senior doctors fear that thousands of routine vaccination appointments may be missed or delayed because of the coronavirus lockdown, raising the risk of sudden and potentially fatal outbreaks of other diseases when restrictions on movement are finally eased.\r… [+4165 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Report awaited on under-reporting of deaths - BBC South East Wales", "description": "People need to know the recording of coronavirus deaths \"can be relied upon\", the first minister says.", "url": "https://www.bbc.co.uk/news/uk-wales-politics-52431775", "urlToImage": null, "publishedAt": "2020-04-26T12:44:21Z", "content": "Image caption\r\n Mark Drakeford: \"I have asked for a report that will be on my desk tomorrow so that I can be sure that any glitches... are being ironed out\"\r\nPeople need to know that the recording of coronavirus deaths \"can be relied upon\", Wales' first minis… [+4738 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nSarah Knapton,", "title": "Why a second coronavirus wave is on the horizon, and what that means for the UK's exit strategy - Telegraph.co.uk", "description": "Whilst Health Secretary has said UK is at virus peak, there are concerns about deadly second wave of Covid-19", "url": "https://www.telegraph.co.uk/news/2020/04/26/what-second-coronavirus-wave-peak-means-lockdown-uk-exit-strategy/", "urlToImage": null, "publishedAt": "2020-04-26T10:30:00Z", "content": "\"We must assume and prepare for the fact that this is not a discrete one-off episode,\" he said. \"My belief is that this is now an endemic human infection. It is likely that this is here with the human race for the future. We're going to have to find ways to d… [+3116 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "BBC News", "title": "NHS staff 'have best PPE we can get them' - Raab - BBC News", "description": "The Foreign Secretary says it has been a \"challenge\" to get PPE, because of a global supply shortage.", "url": "https://www.bbc.com/news/av/uk-politics-52431221/coronavirus-nhs-staff-have-best-ppe-we-can-get-them-raab", "urlToImage": null, "publishedAt": "2020-04-26T10:14:16Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Alahna Kindred", "title": "Coronavirus patients suffering ‘nasty red rash’ before Covid-19 symptoms - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11482938/coronavirus-symptoms-rash/", "urlToImage": null, "publishedAt": "2020-04-26T09:56:39Z", "content": "A RED rash could be another symptom of coronavirus, experts have warned.\r\nData from Italy suggests as many as one in five people who are hospitalised with the killer bug may develop rashes or unexplained marks on their skin.\r\n Scientists are still trying to u… [+3944 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nAnnelies Gartner", "title": "How close are we to a coronavirus vaccine? Latest news on UK trials - Telegraph.co.uk", "description": "Latest news on the search for a vaccine against the new coronavirus", "url": "https://www.telegraph.co.uk/global-health/science-and-disease/coronavirus-vaccine-trials-start-covid-19-update-why-long/", "urlToImage": null, "publishedAt": "2020-04-26T09:40:09Z", "content": "As Covid-19 has rapidly spread around the world there has been a mad scramble to find a vaccine. \r\nIn the UK, a potential coronavirus vaccine being developed at the University of Oxford began human trials on Thursday.\r\nSpeaking at the Governments daily press … [+1670 chars]"}, {"source": {"id": null, "name": "Mylondon.news"}, "author": "Ryan Smith", "title": "London coronavirus: Met Police Federation chairman says there's confusion around lockdown rules - MyLondon", "description": "He claimed that the government is sending \"mixed messages\"", "url": "https://www.mylondon.news/news/zone-1-news/london-coronavirus-met-police-federation-18152132", "urlToImage": null, "publishedAt": "2020-04-26T09:31:00Z", "content": "The chairman of the Metropolitan Police Federation has claimed there is confusion around the coronavirus lockdown due to mixed messages from the government.\r\nKen Marshs comments come after Home Secretary Priti Patel said that the governments message has been … [+1521 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": null, "title": "The thorny dilemma of when to reopen schools - Financial Times", "description": "Schools can spread infection, but long absences mean gaps in learning", "url": "https://www.ft.com/content/ce5186f6-860e-11ea-b872-8db45d5f6714", "urlToImage": null, "publishedAt": "2020-04-26T09:04:00Z", "content": "For millions of children around the world, the return to school for a new term has been a strictly virtual one. School-age children are among those worst affected by governments’ decisions to lock down their economies to slow the spread of coronavirus. A prol… [+3315 chars]"}, {"source": {"id": null, "name": "Theconversation.com"}, "author": "Asha Bowen, Christopher Blyth, Kirsty Short", "title": "5 reasons it's safe for kids to go back to school - The Conversation AU", "description": "More evidence has come in and confirmed what the government has been saying for some time. Children do get infected much less than adults with COVID-19 and when they do, they hardly spread it.", "url": "https://theconversation.com/5-reasons-its-safe-for-kids-to-go-back-to-school-137064", "urlToImage": null, "publishedAt": "2020-04-26T09:02:00Z", "content": "In mid March, cases of COVID-19 the disease caused by SARS-CoV-2 dramatically increased in Australia and the government responded with an effective public health strategy. People who could, shifted to working from home, social distancing measures were applied… [+5782 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Melanie Hancill", "title": "Vitamin D tips and 12 other ways of keeping bones healthy in coronavirus lockdown - Mirror Online", "description": "Exercise and diet play a huge role in how healthy our bones stay as we get older – so at a time when we are more sedentary than ever, here’s how to keep moving", "url": "https://www.mirror.co.uk/lifestyle/health/thirteen-secrets-keeping-your-bones-21907317", "urlToImage": null, "publishedAt": "2020-04-26T08:59:08Z", "content": "We might be cooped up indoors, but it shouldnt be an excuse to sit around all day as tempting as that is.\r\nStaying active helps to keep bones strong and healthy, says osteopath Jess Roberts, founder of Unity-wellness.com.\r\nIn fact, research suggests that walk… [+4880 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Jon Coates", "title": "Tragic nurse who hadn't seen his family in five years is latest Covid-19 victim - Express", "description": "A NURSE who had not seen his family in the Philippines for five years is among the latest victims of Covid-19.", "url": "https://www.express.co.uk/news/uk/1273958/coronavirus-nurse-dead-london-hospital", "urlToImage": null, "publishedAt": "2020-04-26T07:45:40Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Allyson M Pollock and Peter Roderick", "title": "To tackle this virus, local public health teams need to take back control - The Guardian", "description": "A massive increase in testing and tracing is the next phase, but decades of cuts and reorganisations have whittled away the necessary regional expertise", "url": "https://www.theguardian.com/world/2020/apr/26/to-tackle-this-virus-local-public-health-teams-need-to-take-back-control", "urlToImage": null, "publishedAt": "2020-04-26T07:44:40Z", "content": "Perhaps, the most surprising aspect of the British Covid-19 crisis is the extent to which the Scottish, Welsh and Northern Irish governments, and the English regions, have allowed strategy to be decided by Westminster.\r\nHealth and social care are devolved, an… [+5145 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Some nations inch toward reopening as coronavirus deaths rise - ITV News", "description": "US states and nations around the world are taking divergent paths on when to reopen their economies and communities.\n\nThe number of deaths officially attributed to coronavirus topped 200,000 globally, a figure widely believed to understate the actual total.\n\n…", "url": "https://www.itv.com/news/2020-04-26/some-nations-inch-toward-reopening-as-virus-deaths-rise/", "urlToImage": null, "publishedAt": "2020-04-26T07:27:00Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Katie Harris", "title": "Coronavirus map LIVE: NHS could run out of 1bn items of protective gear on frontline - Express", "description": "THE NHS will be short of up to a billion items of personal protective equipment (PPE), according to a Government forecast.", "url": "https://www.express.co.uk/news/uk/1273944/coronavirus-uk-news-map-live-nhs-personal-protective-equipment-ppe", "urlToImage": null, "publishedAt": "2020-04-26T06:59:01Z", "content": null}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Morning update as military begins mobile testing - BBC News", "description": "Five things you need to know about the coronavirus outbreak this morning.", "url": "https://www.bbc.com/news/uk-52429303", "urlToImage": null, "publishedAt": "2020-04-26T06:54:27Z", "content": "Here are five things you need to know about the coronavirus outbreak this Sunday. We'll have another update for you on Monday.\r\n1. Military pop-up testing\r\nThe military is to begin carrying out coronavirus tests in pop-up facilities. The mobile units will tra… [+2792 chars]"}, {"source": {"id": null, "name": "Theguardian.comuk-news"}, "author": "Jamie Doward", "title": "If ministers fail to reveal 2016 flu study they ‘will face court’ - The Guardian", "description": "Doctor’s threat over results of three-day simulation exercise that were ‘too terrifying’ to be made public", "url": "https://amp.theguardian.comuk-news/2020/apr/26/doctor-sue-results-operation-cygnus", "urlToImage": null, "publishedAt": "2020-04-26T06:24:41Z", "content": "The government faces being taken to court if it refuses to disclose the findings of an exercise confirming the UK could not cope with a flu pandemic.\r\nDr Moosa Qureshi, an NHS doctor, is demanding the government publish its report into Exercise Cygnus, a thre… [+2395 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Katrina Turrill", "title": "Coronavirus symptoms: Heartbroken son reveals mum’s first symptom before her death - Express", "description": "CORONAVIRUS symptoms have been shown to differ from person to person - while symptoms in some people appear mild, in others they present as more severe. A son has now spoken of his mum's first symptom before her death.", "url": "https://www.express.co.uk/life-style/health/1273717/coronavirus-symptoms-cases-death-feeling-unwell-cough", "urlToImage": null, "publishedAt": "2020-04-26T06:17:24Z", "content": "Graeme Anderson, 36, has described his mum’s first symptoms before her untimely death from COVID-19.\r\nSpeaking to Liverpool Echo, he explained his mum, June, had self-isolated for two weeks after a neighbour by her home tested positive for the disease.\r\nBut s… [+264 chars]"}, {"source": {"id": null, "name": "Kentonline.co.uk"}, "author": "Sam Williams", "title": "A look back at the worse pandemics in history - Kent Online", "description": "With Covid-19 raging through the country, we take a look at some of the other pandemics through history that have changed the world.", "url": "https://www.kentonline.co.uk/kent/news/a-look-back-at-the-worst-pandemics-in-history-226232/", "urlToImage": null, "publishedAt": "2020-04-26T05:00:00Z", "content": "Worldwide, more than 170,000 people have now died of the novel coronavirus known as Covid-19.\r\nBelieved to have originated in China, the deadly disease has quickly spread across the globe, resulting in many countries entering a strict lockdown period in an at… [+10686 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Matthew Davis For Mail On Sunday", "title": "Five people admitted to A&E after being attacked by crocodiles... in England, NHS figures reveal - Daily Mail", "description": "An analysis of hospital admissions in England reveals medics have had to deal with everything from alligator bites to scorpion stings - and even illness brought on by simulated space flight.", "url": "https://www.dailymail.co.uk/news/article-8257325/Five-people-admitted-E-attacked-crocodiles-England-NHS-figures-reveal.html", "urlToImage": null, "publishedAt": "2020-04-26T02:44:27Z", "content": "There's never a dull moment for the staff of Englands A&amp;E hospitals. But even they must be shocked when cases turn up that look more suited to the tropics.\r\nAn analysis of admissions reveals medics have had to deal with everything from alligator bites to … [+2082 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Neville Lazarus", "title": "Coronavirus: Millions in India facing hunger during COVID-19 lockdown measures - Sky News", "description": "The World Food Programme has said the coronavirus outbreak could cause \"multiple famines of biblical proportions\".", "url": "https://news.sky.com/story/coronavirus-millions-of-indians-facing-hunger-during-covid-19-lockdown-measures-11978857", "urlToImage": null, "publishedAt": "2020-04-26T01:20:13Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Christy Cooney", "title": "UK removes China from official coronavirus deaths comparison after ‘cover-up’ claims and disbelief at low fig - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11481397/uk-removes-china-official-coronavirus-deaths-cover-up/", "urlToImage": null, "publishedAt": "2020-04-25T23:30:19Z", "content": "THE government has removed China from graphs it uses to compare the UK's coronavirus deaths to those elsewhere amid accusations the country has covered up the true impact of the pandemic.   \r\nThe official toll in China, where the virus first broke out in Dece… [+2351 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Andrew Gregory", "title": "Coronavirus tests run out in minutes again — and results will take a month - The Times", "description": "NHS staff are being forced to wait up to 25 days for the results of coronavirus tests as the government’s testing regime descends into farce.The revelation came as tests for key workers via the", "url": "https://www.thetimes.co.uk/article/coronavirus-tests-run-out-in-minutes-again-and-results-will-take-a-month-dv2jckhxj", "urlToImage": null, "publishedAt": "2020-04-25T23:01:00Z", "content": "NHS staff are being forced to wait up to 25 days for the results of coronavirus tests as the governments testing regime descends into farce.\r\nThe revelation came as tests for key workers via the governments booking website ran out within minutes yesterday for… [+496 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Peter Conradi, Europe Editor", "title": "Coronavirus: Rome set to ease lockdown, but Italy's engine room still stricken - The Times", "description": "A row of dozens of identical small white crosses has been erected in recent days at Milan’s giant Cimitero Maggiore for the victims of Covid-19 whose remains have yet to be claimed by relatives. There", "url": "https://www.thetimes.co.uk/article/coronavirus-rome-set-to-ease-lockdown-but-italys-engine-room-still-stricken-jbxcqd32t", "urlToImage": null, "publishedAt": "2020-04-25T23:00:00Z", "content": "A row of dozens of identical small white crosses has been erected in recent days at Milans giant Cimitero Maggiore for the victims of Covid-19 whose remains have yet to be claimed by relatives. There is space for 600 in what have been called Italys first war … [+467 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "UK doctor invents digital flashcards to help Covid-19 patients understand staff - The Guardian", "description": "Cardmedic overcomes communication barrier caused by healthcare staff wearing PPE", "url": "https://www.theguardian.com/world/2020/apr/25/uk-doctor-invents-digital-flashcards-to-help-covid-19-patients-understand-staff", "urlToImage": null, "publishedAt": "2020-04-25T21:50:36Z", "content": "A coronavirus patients terrifying hospital experience inspired an NHS doctor to create a flashcard system to improve communication with medical staff wearing face masks.\r\nAnaesthetist Rachael Grimaldi founded Cardmedic while on maternity leave after reading a… [+2712 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nTom Morgan", "title": "Coronavirus test for anyone traced to a known carrier - Telegraph.co.uk", "description": "The technology should eventually allow symptomless workers to return to their jobs quicker", "url": "https://www.telegraph.co.uk/news/2020/04/25/coronavirus-test-anyone-traced-known-carrier/", "urlToImage": null, "publishedAt": "2020-04-25T20:30:00Z", "content": "In the letter to public health agencies and local authorities, he says the app will work in unison with a call-based system for those without the technology.\r\nHe also refers to the Government's huge recruitment drive to carry out the extra testing. \"There wil… [+2492 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Shopping robots come into their own in locked-down English town - AOL Travel UK", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_59515b5f-3be2-4a97-9325-d096f85a7510&lang=en-GB&inline=false", "urlToImage": null, "publishedAt": "2020-04-25T18:37:00Z", "content": "AOL is part of Verizon Media. Click 'I agree' to allow Verizon Media and our partners to use cookies and similar technologies to access your device and use your data (including location) to understand your interests, and provide and measure personalised ads. … [+342 chars]"}, {"source": {"id": null, "name": "Burytimes.co.uk"}, "author": "Saiqa Chaudhari", "title": "Baby Erin Bates survives coronavirus — and is cheered by nurses and doctors as she leaves HDU - Bury Times", "description": "A BABY girl who won the heart of the nation ­— and the world ­— in her fight against coronavirus has made a full recovery from the illness.", "url": "https://www.burytimes.co.uk/news/18405951.baby-erin-bates-survives-coronavirus-----cheered-nurses-doctors-leaves-hdu/", "urlToImage": null, "publishedAt": "2020-04-25T18:36:24Z", "content": "A BABY girl who won the heart of the nation ­— and the world ­— in her fight against coronavirus has made a full recovery from the illness.\r\nMum Emma Bates found out yesterday her daughter, Erin's test result for covid-19 had come back negative ­— less than t… [+3402 chars]"}, {"source": {"id": null, "name": "Inverse.com"}, "author": "Abela Mahimbo, David Isaacs, Melissa Kang, Melanie Wong", "title": "Why are some people with Covid-19 asymptomatic? Evidence points to 2 factors - Inverse", "description": "Recent studies suggest as many as 80% or more of those infected are “silent carriers”, showing no or very mild symptoms.", "url": "https://www.inverse.com/science/covid-19-asymptomatic", "urlToImage": null, "publishedAt": "2020-04-25T17:58:15Z", "content": "SARS-CoV-2, the coronavirus which causes COVID-19, has infected almost 2.5 million people around the world and claimed 170,000 lives.\r\nBut some people dont even get symptoms. Recent studies suggest as many as 80 percentor more of those infected are silent car… [+5687 chars]"}, {"source": {"id": null, "name": "Essexlive.news"}, "author": "Paige Ingram", "title": "Essex coronavirus: Covid-19 cases exceed 2,700 across the county - Essex Live", "description": "Nationwide, more than 20,000 people have now passed away after testing positive for Covid-19", "url": "https://www.essexlive.news/news/essex-news/essex-coronavirus-covid-19-cases-4075799", "urlToImage": null, "publishedAt": "2020-04-25T17:52:00Z", "content": "The total number of coronavirus cases in Essex has risen to over 2,700, according to Public Health England data released today (April 25)\r\nNationwide, 148,377 people who have now tested positive for the Covid-19 virus, and the death toll stands at  20,319.\r\nI… [+2024 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Alice Tidey", "title": "Coronavirus: France drastically limits sale of nicotine products - Euronews", "description": "The measure comes after a study found that \"nicotine may be suggested as a potential preventive agent against Covid-19 infection.\"", "url": "https://www.euronews.com/2020/04/25/coronavirus-france-drastically-limits-sale-of-nicotine-products", "urlToImage": null, "publishedAt": "2020-04-25T16:31:54Z", "content": "France severely curtailed the sale of nicotine products on Friday after a study suggested smokers may be less likely to contract COVID-19.\r\nThe decree, issued by the Ministry of Health, limits pharmacies from selling more than a one-month supply of any nicoti… [+1842 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Over 300 patients 'refused' ambulance transport to hospital over Covid-19 fears - ITV News", "description": "More than three hundred people with severe illnesses refused to be taken to hospital by ambulance over fears of coronavirus.\n\nThe cases related to patients visited by West Midlands Ambulance Service earlier this month.\n\nSandwell and West Birmingham NHS Trust …", "url": "https://www.itv.com/news/central/2020-04-25/over-300-patients-refuse-to-be-taken-hospital-by-ambulance-over-covid-19-fears/", "urlToImage": null, "publishedAt": "2020-04-25T15:44:00Z", "content": "\"The first message that the NHS needs to make clearer than we have so far is that the NHS is open, and we are open for people who do not think they have Covid-19 but they may be concerned about a stroke, a heart attack or sickle cell pain.\r\n\"Over 300 patients… [+444 chars]"}, {"source": {"id": null, "name": "Shropshirestar.com"}, "author": "Deborah Hardiman", "title": "Eight more coronavirus deaths confirmed in Shropshire as UK death toll passes 20000 - shropshirestar.com", "description": "A further eight people have been confirmed to have died with coronavirus in Shropshire.", "url": "https://www.shropshirestar.com/news/health/coronavirus-covid19/2020/04/25/eight-more-coronavirus-deaths-confirmed-in-shropshire-as-uk-death-toll-passes-20000/", "urlToImage": null, "publishedAt": "2020-04-25T14:37:00Z", "content": "Seven patients were in the care of Shrewsbury &amp; Telford Hospital NHS Trust (SaTH) and died after testing positive for Covid-19, while one patient was in the care of the Robert Jones and Agnes Hunt Orthopaedic Hospital near Oswestry, NHS England confirmed … [+1743 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Jenny Kirkham, Rebecca Day", "title": "Erin the 'miracle baby' born with a heart condition has beaten coronavirus - Manchester Evening News", "description": "'They are all truly amazing and we will be forever grateful', her mum said of the NHS heroes who saved her daughter's life", "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/erin-miracle-baby-born-heart-18150417", "urlToImage": null, "publishedAt": "2020-04-25T14:36:06Z", "content": "A six-month-old 'miracle baby' born with a heart condition has beaten coronavirus.\r\nMedics were moved to tears as they clapped for little Erin Bates, from Bury, as she was wheeled through the corridor having spent two weeks in an isolation unit.\r\nThe tot was … [+4394 chars]"}, {"source": {"id": null, "name": "Dailypost.co.uk"}, "author": "Ben Mitchell, Press Association, Marc Waddington-NW", "title": "Identical twin sister nurses die days apart after contracting coronavirus - Daily Post", "description": "Katy and Emma Davies, from Southampton, died this week", "url": "https://www.dailypost.co.uk/news/uk-world-news/identical-twin-sister-nurses-die-18150611", "urlToImage": null, "publishedAt": "2020-04-25T14:31:10Z", "content": "Identical twin sister nurses both died after catching coronavirus.\r\nChildren's nurse Katy Davis, 37, died at Southampton General Hospital on Tuesday.\r\nHer sister Emma, a former surgery nurse, died early on Friday.\r\nBoth women had an underlying health conditio… [+1786 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Northern Ireland's coronavirus death toll rises to 294 | UTV - ITV News - ITV News", "description": "Sixteen more people who tested positive for coronavirus in Northern Ireland have sadly died, taking the total number to 294.\n\nAccording to the Department of Health, testing has resulted in 104 new cases in the region.\n\nThe total number of confirmed cases in N…", "url": "https://www.itv.com/news/utv/2020-04-25/northern-irelands-coronavirus-death-toll-rises-to-294/", "urlToImage": null, "publishedAt": "2020-04-25T14:22:00Z", "content": "Sixteen more people who tested positive for coronavirus in Northern Ireland have sadly died, taking the total number to 294.\r\nAccording to the Department of Health, testing has resulted in 104 new cases in the region.\r\nThe total number of confirmed cases in N… [+337 chars]"}, {"source": {"id": null, "name": "Sunderlandecho.com"}, "author": "Fiona Thompson", "title": "Sunderland's coronavirus cases stand at 1,066 as 16 more patients die under care of city's hospital trust - Sunderland Echo", "description": "Twelve more patients have been confirmed as having coronavirus whole another six patients have lost their lives at the hospital trust which serves the city.", "url": "https://www.sunderlandecho.com/health/coronavirus/further-12-more-coronavirus-cases-are-confirmed-sunderland-health-trust-reports-six-more-deaths-2498170", "urlToImage": null, "publishedAt": "2020-04-25T13:52:30Z", "content": "The figures show 248 people have died in hospitals covered by South Tyneside and Sunderland NHS Foundation Trust as of Sunday, April 26.\r\nIn total, 924 people who had tested positive for coronavirus have died across the North Easts hospital trusts, an increas… [+3715 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "UK coronavirus death toll passes 20000, as 781 more people die in hospitals - Grimsby Live", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiXmh0dHBzOi8vd3d3LmdyaW1zYnl0ZWxlZ3JhcGguY28udWsvbmV3cy91ay13b3JsZC1uZXdzL3VrLWNvcm9uYXZpcnVzLWRlYXRoLXRvbGwtcGFzc2VzLTQwNzg3MzjSAQA?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T13:34:00Z", "content": null}, {"source": {"id": null, "name": "Creativebloq.com"}, "author": "Rosie Hilder", "title": "Where to buy a face mask right now – plus how to make a face mask at home - Creative Bloq", "description": "Wondering where to buy a face mask? These retailers still have stock. Plus how to make your own.", "url": "https://www.creativebloq.com/news/where-to-buy-face-masks", "urlToImage": null, "publishedAt": "2020-04-25T13:01:17Z", "content": "If you want to know where to buy a face mask, you're in the right place. Face masks are selling out quickly around the world, so we've put together this list of online retailers that still have face masks in stock. \r\nBear in mind that the face masks in this a… [+6427 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Rebecca Speare-Cole", "title": "Professor Chris Whitty says it is 'unlikely' the UK will stay in coronavirus lockdown 'indefinitely' - Evening Standard", "description": "", "url": "https://www.standard.co.uk/news/uk/uk-coronavirus-lockdown-end-prof-chris-whitty-a4423761.html", "urlToImage": null, "publishedAt": "2020-04-25T11:50:01Z", "content": "The UK is unlikely to remain in the current coronaviruslockdown pattern for the indefinite future, England's chief medical officer said today.\r\nProfessor Chris Whitty told Westminster's Science and Technology Committee said that the Government were not going … [+1910 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Faye Brown", "title": "WHO warning against coronavirus immunity passports - Metro.co.uk", "description": "The World Health Organisation say there is still not enough evidence having coronavirus can protect you from reinfection.", "url": "https://metro.co.uk/2020/04/25/casts-doubt-antibody-tests-warning-immunity-passports-12608431/", "urlToImage": null, "publishedAt": "2020-04-25T11:12:53Z", "content": "There is no evidence having coronavirus will protect you from reinfection, according to the World Health Organisation\r\nThe World Health Organisation has warned against the idea of immunity passports as a solution to easing lockdown amid the coronavirus pandem… [+2174 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus Explained: how the virus will hit the poorest people on the planet - Channel 4 News", "description": "The coronavirus pandemic is affecting the world, no matter who you are and where you come from. (Subscribe: https://bit.ly/C4_News_Subscribe) Covid-19 is dev...", "url": "https://www.youtube.com/watch?v=QorckhwMLR0", "urlToImage": null, "publishedAt": "2020-04-25T11:05:09Z", "content": "The coronavirus pandemic is affecting the world, no matter who you are and where you come from. (Subscribe: https://bit.ly/C4_News_Subscribe) \r\nCovid-19 is devastating countries across the globe, with some of the wealthiest nations struggling to contain the s… [+522 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Alessandra Scotto di Santolo", "title": "Expert reveals up to seven tests needed to get accurate coronavirus antibody results - Express", "description": "CORONAVIRUS tests may need up to seven takes to give accurate results on the development of antibodies in those who have already suffered from the deadly virus.", "url": "https://www.express.co.uk/news/uk/1273747/coronavirus-test-antibody-tests-covid-19-uk-latest-update", "urlToImage": null, "publishedAt": "2020-04-25T10:00:19Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Dave Burke", "title": "Coronavirus home tests run out in less than 30 minutes on second day of launch - Mirror Online", "description": "By 8.30am on Saturday, the gov.uk website said no Covid-19 home testing kits were available. It comes two days after Health Secretary Matt Hancock said 10 million essential workers were eligible for tests", "url": "https://www.mirror.co.uk/news/uk-news/breaking-coronavirus-home-tests-run-21924743", "urlToImage": null, "publishedAt": "2020-04-25T09:57:07Z", "content": "Coronavirus home tests ran out in just 15 minutes today - as the government comes under pressure to ramp up testing.\r\nEssential workers and their families hoping to find out if they had the deadly bug faced disappointment as drive-through appointments across … [+3331 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "WHO warns against idea of ‘immunity passports’ - Yahoo News UK", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_9f664cf0-ddf5-408d-95c0-9470a6d797be&lang=en-GB&inline=false", "urlToImage": null, "publishedAt": "2020-04-25T08:03:00Z", "content": "Yahoo is part of Verizon Media. Click 'I agree' to allow Verizon Media and our partners to use cookies and similar technologies to access your device and use your data (including location) to understand your interests, and provide and measure personalised ads… [+344 chars]"}, {"source": {"id": null, "name": "Iwradio.co.uk"}, "author": "Iona Stewart-Richardson", "title": "Isle Of Wight Reservists Reveal Their Role In Coronavirus, Six Years Since Last Tasked To A Landslip - Isle Of Wight Radio News - Isle of Wight Radio", "description": "The Isle of Wight reservists have exclusively revealed how they have been preparing us for the “worst-case scenario” in the fight against coronavirus.", "url": "https://iwradio.co.uk/2020/04/25/isle-of-wight-reservists-reveal-their-role-in-coronavirus-six-years-since-last-tasked-to-a-landslip/", "urlToImage": null, "publishedAt": "2020-04-25T06:01:00Z", "content": "The Isle of Wight reservists have exclusively revealed how they have been preparing us for the worst-case scenario in the fight against coronavirus.\r\nSome soldiers were training up north then called home to join the fight against the deadly virus – a situatio… [+1724 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Elsom For Mailonline", "title": "Cabinet ministers were warned last year about a coronavirus pandemic - Daily Mail", "description": "The National Security Risk Assessment highlighted the devastating social and economic costs of a major disease outbreak and was signed off by chief scientific adviser Sir Patrick Vallance.", "url": "https://www.dailymail.co.uk/news/article-8255043/Cabinet-ministers-warned-year-coronavirus-pandemic.html", "urlToImage": null, "publishedAt": "2020-04-25T05:22:54Z", "content": "Ministers were warned last year of the grave consequences a future pandemic would unleash on the UK, a leaked Cabinet Office briefing has revealed. \r\nTens of thousands of deaths, crippling economic costs and creaking public services were predicted in the 2019… [+10342 chars]"}, {"source": {"id": null, "name": "Lancashiretelegraph.co.uk"}, "author": "Joe Harrigan", "title": "Dental care shutdown: Patients in East Lancashire and nationwide left in agony due to PPE shortages - Lancashire Telegraph", "description": "DENTAL patients in East Lancashire are being forced to go without treatment, and in some cases left in agony, due to a lack of Personal Protective…", "url": "https://www.lancashiretelegraph.co.uk/news/18405275.dental-care-shutdown-patients-east-lancashire-nationwide-left-agony-due-ppe-shortages/", "urlToImage": null, "publishedAt": "2020-04-25T04:36:00Z", "content": "DENTAL patients in East Lancashire are being forced to go without treatment, and in some cases left in agony, due to a lack of Personal Protective Equipment in dental surgeries.\r\nNHS England has insisted that provisions have been made to make sure that people… [+2839 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Plea for public to get medical care when they need it - BBC News", "description": "People needing help should not be put off by the coronavirus pandemic, say health professionals.", "url": "https://www.bbc.co.uk/news/health-52417599", "urlToImage": null, "publishedAt": "2020-04-25T00:12:51Z", "content": "Image copyrightAFP/Oli Scarff via Getty Images\r\nPeople should seek medical care when they need it and not be put off by the coronavirus epidemic, say doctors, charities and the health service.\r\nAnyone who delays seeking treatment is putting their long-term he… [+5447 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "Www.gov.uk"}, "author": "Department of Health and Social Care", "title": "Clinical trial approved to help the NHS treat COVID-19 patients using plasma - GOV.UK", "description": "If effective, a national programme will deliver up to 10,000 units of plasma a week to the NHS to help treat coronavirus (COVID-19) patients.", "url": "https://www.gov.uk/government/news/clinical-trial-approved-to-help-the-nhs-treat-covid-19-patients-using-plasma", "urlToImage": null, "publishedAt": "2020-04-24T23:20:34Z", "content": "<ul><li>A clinical trial has been given approval to determine if plasma donated by patients who have recovered from COVID-19 can help those battling the illness</li><li>If effective, a scaled-up national programme will deliver up to 10,000 units of convalesce… [+5284 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Dailyrecord.co.uk", "title": "Twin sister nurses tragically die from coronavirus just three days apart - Daily Record", "description": "Children's nurse Katy Davis and surgery nurse Emma both suffered from an underlying health condition when they passed away after testing positive.", "url": "https://www.dailyrecord.co.uk/news/uk-world-news/twin-sister-nurses-tragically-die-21923920", "urlToImage": null, "publishedAt": "2020-04-24T21:25:43Z", "content": "Twin sisters who had both worked as nurses have died within three days of each other after both testing positive for Covid-19. \r\n Children's nurse Katy Davis, 37, died at Southampton General Hospital on Tuesday while her identical twin, Emma, a former surgery… [+2642 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Betsi death report delay sparks investigation - BBC South East Wales", "description": "The north Wales health board reported all its deaths at once after issues with reporting systems.", "url": "https://www.bbc.co.uk/news/uk-wales-52419068", "urlToImage": null, "publishedAt": "2020-04-24T19:23:29Z", "content": "Image copyrightGetty ImagesImage caption\r\n Betsi Cadwaladr health board reported 84 deaths in the north Wales area on Thursday\r\nThe recording of the number of people who have died with coronavirus is being investigated after a Welsh health board failed to rep… [+2468 chars]"}]}