{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Theguardian.com"}, "author": "Lucy Campbell", "title": "Coronavirus UK: test slots run out for second day running – latest updates - The Guardian", "description": "Questions over independence of Sage group come as UK death toll nears 20,000", "url": "https://www.theguardian.com/world/live/2020/apr/25/coronavirus-uk-calls-for-transparency-over-scientific-advice-to-ministers-latest-updates", "urlToImage": null, "publishedAt": "2020-04-25T10:41:00Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "WHO Says You May Catch Coronavirus More Than Once - Bloomberg", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=49ad3e10-86e3-11ea-b7a6-9b7bd6ab411d&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNC0yNS9jYXRjaGluZy1jb3ZpZC0xOS1tYXktbm90LXNoaWVsZC1hZ2FpbnN0LW5ldy1pbmZlY3Rpb24td2hvLXNheXM=", "urlToImage": null, "publishedAt": "2020-04-25T10:33:07Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Holly Christodoulou", "title": "UK troops given insect repellent Citriodiol after tests show spray could give ‘enhanced’ protection against co - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11478110/troops-given-insect-spray-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-25T09:38:32Z", "content": "BRITISH troops will be given insect repellant for protection against coronavirus after tests showed it may kill the deadly disease.\r\nCitriodiol has been known to fight types of the virus - with evidence now suggesting it could also tackle the Covid-19 strain.… [+3076 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Coronavirus: Plasma treatment for COVID-19 patients to be trialled - Sky News", "description": "So-called convalescent plasma is given to patients struggling to produce their own antibodies to fight the virus.", "url": "https://news.sky.com/story/coronavirus-plasma-treatment-for-covid-19-patients-to-be-trialled-11978522", "urlToImage": null, "publishedAt": "2020-04-25T09:21:49Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Elsom For Mailonline", "title": "Chris Whitty reveals the UK's 'reproduction number' dropped below 1 - Daily Mail", "description": "England's chief medical officer has offered a chink of light out of the lockdown after revealing coronavirus infection rates in the UK have been wrestled down.", "url": "https://www.dailymail.co.uk/news/article-8255677/Chris-Whitty-reveals-UKs-reproduction-number-dropped-1.html", "urlToImage": null, "publishedAt": "2020-04-25T08:38:55Z", "content": "Professor Chris Whitty has offered a chink of light out of the lockdown after revealing coronavirus infection rates have been wrestled down.\r\nEngland's chief medical officer said the reproduction number - or R0 - has been brought below 1, marking a critical a… [+4163 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Katrina Turrill", "title": "Coronavirus symptoms: Heartbroken son reveals mum's first symptom before her death - Express", "description": "CORONAVIRUS symptoms have been shown to differ from person to person - while symptoms in some people appear mild, in others they present as more severe. A son has now spoken of his mum's first symptom before her death.", "url": "https://www.express.co.uk/life-style/health/1273717/coronavirus-symptoms-cases-death-feeling-unwell-cough", "urlToImage": null, "publishedAt": "2020-04-25T08:30:49Z", "content": "Graeme Anderson, 36, has described his mum’s first symptoms before her untimely death from COVID-19.\r\nSpeaking to Liverpool Echo, he explained his mum, June, had self-isolated for two weeks after a neighbour by her home tested positive for the disease.\r\nBut s… [+264 chars]"}, {"source": {"id": null, "name": "Theguardian.comworld"}, "author": "Sarah Marsh, Nazia Parveen", "title": "England campaign targets seriously ill patients avoiding hospitals - The Guardian", "description": "Campaign will urge people with serious non-coronavirus-related conditions to seek help", "url": "https://amp.theguardian.comworld/2020/apr/25/england-campaign-targets-seriously-ill-patients-avoiding-hospitals", "urlToImage": null, "publishedAt": "2020-04-25T07:46:47Z", "content": "A government campaign has been launched to encourage people seriously ill with non-Covid conditions such as heart attacks to seek help amid concerns some are avoiding hospitals.\r\nThe campaign, which will be rolled out next week, aims to encourage people to us… [+4549 chars]"}, {"source": {"id": null, "name": "Wired.co.uk"}, "author": null, "title": "The UK is racing to create the world's first coronavirus vaccine - Smash Newz", "description": "Getty Images / RunZebraRun / WIRED: In early 2018, the World Health Organization’s list of threats, which could later lead to a deadly pandemic, added to the “Disease X” condition. Unlike other diseases on the list, X disease did not yet exist. It was just th…", "url": "https://www.wired.co.uk/article/uk-coronavirus-vaccine-trial", "urlToImage": null, "publishedAt": "2020-04-25T07:38:30Z", "content": "Getty Images / RunZebraRun / WIRED:\r\nIn early 2018, the World Health Organization’s list of threats, which could later lead to a deadly pandemic, added to the “Disease X” condition. Unlike other diseases on the list, X disease did not yet exist. It was just t… [+7363 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Emer Scully For Mailonline", "title": "Italy's coronavirus outbreak began in January, study shows - Daily Mail", "description": "Italy was the first western country where the number of Covid-19 cases dramatically shot up, leading to 12,000 deaths by the end of March. A study shows Covid-19 was in Italy from January.", "url": "https://www.dailymail.co.uk/news/article-8255233/Italys-coronavirus-outbreak-began-January-study-shows.html", "urlToImage": null, "publishedAt": "2020-04-25T07:34:38Z", "content": "Coronavirus arrived in Italy in January 'for sure' - despite the first case not being diagnosed until the end of February, says a scientist who presented a study on the subject today.\r\nExpert Stefano Merler, of the Bruno Kessler Foundation, told a news confer… [+5356 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Katrina Turrill", "title": "Coronavirus update: Six new symptoms of the deadly virus you need to look out for - Express", "description": "CORONAVIRUS has still taken a hold of the UK, with more than 143,000 confirmed cases and at least 19.506 deaths from the virus. Spotting the symptoms has never been so important, and the Centers for Disease Control and Prevention (CDC) has now added six new s…", "url": "https://www.express.co.uk/life-style/health/1273703/coronavirus-update-news-latest-symptoms-new-cdc", "urlToImage": null, "publishedAt": "2020-04-25T07:21:33Z", "content": "Coronavirus has been reported by patients to have a wide range of symptoms. Up until now, the CDC has listed the main symptoms as a fever, cough and shortness of breath or difficulty breathing. But six news symptoms have now been added to the list.After exper… [+1136 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Dailymail.com Reporter", "title": "Cyclist who confronted CNN's Chris Cuomo in his backyard says the host was like a 'boiling pot' - Daily Mail", "description": "David Whelan claimed that the anchor berated him as he asked Cuomo why he was not self-quarantining on Easter Sunday.", "url": "https://www.dailymail.co.uk/news/article-8255903/Cyclist-confronted-CNNs-Chris-Cuomo-backyard-says-host-like-boiling-pot.html", "urlToImage": null, "publishedAt": "2020-04-25T06:58:02Z", "content": "The Long Island bicyclist who got into a verbal spat with CNN anchor Chris Cuomo on Easter Sunday said the host was like a 'boiling pot' as he was confronted for not self-quarantining.\r\nDavid Whelan claimed that he had decided to go on a bike ride near where … [+4687 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Ben Mitchell, Press Association", "title": "Identical twins who both worked as nurses die with coronavirus - Wales Online", "description": "'They always said they would come into the world together and go out together'", "url": "https://www.walesonline.co.uk/news/uk-news/coronavirus-identical-twins-died-davis-18149129", "urlToImage": null, "publishedAt": "2020-04-25T05:52:43Z", "content": "Identical twin sisters died in three days of each other after both testing positive for Covid-19.\r\nChildren's nurse Katy Davis, 37, died at Southampton General Hospital on Tuesday while her identical twin, Emma, a former surgery nurse, died early on Friday.\r\n… [+2001 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Elsom For Mailonline", "title": "Cabinet ministers were warned last year about a coronavirus pandemic - Daily Mail", "description": "The National Security Risk Assessment highlighted the devastating social and economic costs of a major disease outbreak and was signed off by chief scientific adviser Sir Patrick Vallance.", "url": "https://www.dailymail.co.uk/news/article-8255043/Cabinet-ministers-warned-year-coronavirus-pandemic.html", "urlToImage": null, "publishedAt": "2020-04-25T05:22:54Z", "content": "Ministers were warned last year of the grave consequences a future pandemic would unleash on the UK, a leaked Cabinet Office briefing has revealed. \r\nTens of thousands of deaths, crippling economic costs and creaking public services were predicted in the 2019… [+10342 chars]"}, {"source": {"id": null, "name": "Dailypost.co.uk"}, "author": "Owen Hughes", "title": "Eight communities in North Wales set to be worst hit by coronavirus economic shock waves - Daily Post", "description": "Two reports lay bare the economic impact coronavirus is already having on our towns and villages", "url": "https://www.dailypost.co.uk/news/north-wales-news/eight-communities-north-wales-set-18148745", "urlToImage": null, "publishedAt": "2020-04-25T05:11:07Z", "content": "Two reports have laid bare the communities in North Wales that look set to be impacted the hardest by the economic fallout from the coronavirus pandemic.\r\nLockdown measures to control the spread of Covid-19 are set to have a major impact across Wales and the … [+3205 chars]"}, {"source": {"id": null, "name": "Grimsbytelegraph.co.uk"}, "author": "Jamie Waller", "title": "NHS staff respond to criticism for gathering in Clap for Carers - Grimsby Live", "description": "They have pointed out they cannot social distance inside hospitals", "url": "https://www.grimsbytelegraph.co.uk/news/grimsby-news/nurses-defend-social-distancing-clap-4076411", "urlToImage": null, "publishedAt": "2020-04-25T05:00:00Z", "content": "NHS staff have asked for people to give them a break after criticism of them gathering outside hospitals for the Clap for Carers.\r\nThe national applause every Thursday at 8pm is normally a positive event, with people applauding the emergency services from the… [+5744 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Inzamam Rashid", "title": "Coronavirus: Intensive care patients given iPads to speak to relatives - Sky News", "description": "In the most tragic cases the devices will be used by patients saying goodbye to their loved ones for the last time.", "url": "https://news.sky.com/story/coronavirus-intensive-care-patients-given-ipads-to-speak-to-relatives-11978509", "urlToImage": null, "publishedAt": "2020-04-25T03:33:00Z", "content": null}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Coronavirus dominates Saturday's newspaper front pages - ITV News - ITV News", "description": "Saturday’s papers are led by the possible easing of lockdown measures and a new treatment being trialled for Covid-19 patients.\n\nTreasury has issued a proposal to “get Britain back to work” with non-essential businesses to reopen in a “safe and practical way”…", "url": "https://www.itv.com/news/2020-04-25/what-the-papers-say-april-25/", "urlToImage": null, "publishedAt": "2020-04-25T01:38:00Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-25T00:33:50Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8701 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Martin Fricker, Ben Glaze, Martin Bagot, Oliver Milne", "title": "Government warned a year ago to urgently prepare for pandemic and stockpile PPE - Mirror Online", "description": "Before Covid-19 emerged, ministers were told to put in place plans to monitor and contact-trace infected patients and manage a surge in deaths", "url": "https://www.mirror.co.uk/news/uk-news/ministers-warned-year-ago-viral-21923949", "urlToImage": null, "publishedAt": "2020-04-24T21:41:47Z", "content": "Ministers were warned last year about the devastating impact of a viral pandemic hitting the UK and urged to stockpile PPE.\r\nBefore Covid-19 emerged they were told to put in place plans to monitor and contact-trace infected patients and manage a surge in deat… [+1424 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Betsi death report delay sparks investigation - BBC South East Wales", "description": "The north Wales health board reported all its deaths at once after issues with reporting systems.", "url": "https://www.bbc.co.uk/news/uk-wales-52419068", "urlToImage": null, "publishedAt": "2020-04-24T19:23:29Z", "content": "Image copyrightGetty ImagesImage caption\r\n Betsi Cadwaladr health board reported 84 deaths in the north Wales area on Thursday\r\nThe recording of the number of people who have died with coronavirus is being investigated after a Welsh health board failed to rep… [+2244 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Paralysed Ed Jackson reaches Everest staircase feat - BBC News", "description": "Former rugby player Ed Jackson has climbed 89,056 steps and made 2,783 trips up and down the stairs.", "url": "https://www.bbc.co.uk/news/uk-england-somerset-52416450", "urlToImage": null, "publishedAt": "2020-04-24T19:09:39Z", "content": "Image copyrightWings for Life Image caption\r\n To simulate the ascent of Everest's 8,848m peak, Ed Jackson climbed 89,056 steps\r\nA paralysed ex-rugby player has climbed the equivalent height of Mount Everest on his parents' staircase.\r\nEd Jackson, from Bath, b… [+1708 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Weekend lockdowns - Turkey's coronavirus response - Channel 4 News", "description": "No country outside Europe and America has more coronavirus cases than Turkey, where numbers have overtaken China and Iran. (Subscribe: https://bit.ly/C4_News...", "url": "https://www.youtube.com/watch?v=AZ6v2UWPVnE", "urlToImage": null, "publishedAt": "2020-04-24T18:58:24Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Stephen Matthews Health Editor For Mailonline Sam Blanchard Senior Health Reporter For Mailonline", "title": "NHS to release plan next week to 'redeploy coronavirus capacity' - Daily Mail", "description": "NHS bosses are keen to get operating theatres back up and running and to return to business as usual for non-coronavirus patients who may have been missing out on treatment for weeks.", "url": "https://www.dailymail.co.uk/news/article-8254393/NHS-release-plan-week-redeploy-coronavirus-capacity.html", "urlToImage": null, "publishedAt": "2020-04-24T18:35:52Z", "content": "NHS hospitals could restart routine operations as soon as next week as the health service prepares plans to get back on its feet as the coronavirus crisis blows over. \r\nPrivate hospitals have laid empty in the past week and up to 40,000 NHS beds are thought t… [+9807 chars]"}, {"source": {"id": null, "name": "Sluggerotoole.com"}, "author": "Mick Fealty", "title": "Drawing conclusions on provisional #Covid19 figures does no favours to public understanding. - Slugger O'Toole", "description": "Significant news has just come through from RTE News this evening… The total death toll here is now 1,014, including 185* probable deaths, after two deaths that had previously been reported are no longer classified as related to Covid-19. [Emphasis added] A l…", "url": "https://sluggerotoole.com/2020/04/24/drawing-conclusions-on-provisional-covid19-figures-does-no-favours-to-public-understanding/", "urlToImage": null, "publishedAt": "2020-04-24T18:14:00Z", "content": "Significant news has just come through from RTE News this evening…\r\nThe total death toll here is now 1,014, including 185* probable deaths, after two deaths that had previously been reported are no longer classified as related to Covid-19. [Emphasis added]\r\nA… [+3263 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Les Steed", "title": "How does key worker testing work and what time can I apply for a coronavirus test? - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11469520/key-worker-coronavirus-testing-how-what-time/", "urlToImage": null, "publishedAt": "2020-04-24T17:35:15Z", "content": "MATT HANCOCK announced that testing can now be provided for up to seven million key workers and emergency staff.\r\nHere's how to get tested if you are an essential worker who believes that you or a household member has coronavirus.\r\n Matt Hancock said key work… [+6641 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Emma Brazell", "title": "Scientists detect coronavirus on particles of air pollution - Metro.co.uk", "description": "It raises a suggestion that higher levels of particle pollution could lead to higher rates of infection - for example in regions of northern Italy.", "url": "https://metro.co.uk/2020/04/24/scientists-detect-coronavirus-particles-air-pollution-12605944/", "urlToImage": null, "publishedAt": "2020-04-24T17:13:01Z", "content": "The new medical work is preliminary and it is not confirmed if the virus remains viable on pollution particles (Picture: Rex/ PA)\r\nCoronavirus has been detected on particles of air pollution by scientists looking into whether the illness could be carried this… [+2081 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Sathnam Sanghera", "title": "Coronavirus and ethnicity: black and Asian NHS medics on the front line - The Times", "description": "My last significant social engagement before the coronavirus lockdown was a school reunion dinner. For the first time since I left Wolverhampton Grammar School 25 years ago, initially for a grim", "url": "https://www.thetimes.co.uk/article/coronavirus-and-ethnicity-black-and-asian-nhs-medics-on-the-front-line-dhznrc3kc", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "My last significant social engagement before the coronavirus lockdown was a school reunion dinner. For the first time since I left Wolverhampton Grammar School 25 years ago, initially for a grim summer job in a local hospital laundry, and then Cambridge Unive… [+451 chars]"}, {"source": {"id": null, "name": "Mylondon.news"}, "author": "Qasim Peracha", "title": "London coronavirus: The hospitals where 126 more patients have died as London death toll hits 4,426 - MyLondon", "description": "UK deaths now account for one in 10 coronavirus deaths across the world", "url": "https://www.mylondon.news/news/zone-1-news/london-coronavirus-hospitals-126-more-18146984", "urlToImage": null, "publishedAt": "2020-04-24T15:59:00Z", "content": "A further 126 deaths from coronavirus have been recorded in London, taking the total death toll in the capital's hospitals to 4,426. \r\nNationally, the death toll reached 19,506 deaths in hospitals across the country after 684 more deaths were registered accor… [+5100 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Sian Elvin", "title": "Coronavirus UK: 'Amazing' doctor who loved caring for babies dies - Metro.co.uk", "description": "'He treated every patient and family he cared for as his own. I couldn't have been prouder of him.'", "url": "https://metro.co.uk/2020/04/24/three-nhs-doctors-12605725/", "urlToImage": null, "publishedAt": "2020-04-24T15:52:10Z", "content": "Dr Vishna Rasiah, who has been described as talented, dedicated and respected, has died after contracting Covid-19 (Picture: PA)\r\nA talented, dedicated and respected doctor has died after contracting coronavirus.\r\nDr Vishna Rasiah, who worked at Birmingham Wo… [+2320 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Jacob Jarvis", "title": "UK coronavirus death toll at least 5,000 higher than hospital reports, new figures show - Evening Standard", "description": "", "url": "https://www.standard.co.uk/news/uk/coronavirus-uk-death-toll-5000-higher-ons-covid-19-a4423611.html", "urlToImage": null, "publishedAt": "2020-04-24T15:37:40Z", "content": "The true number of deaths linked to coronavirus in the UK is at least 5,000 higher than those reported from hospitals, new figures show.\r\nLatest numbers from the Office for National Statistics show total of 14,192 deaths where Covid-19 was the primary or susp… [+1230 chars]"}, {"source": {"id": null, "name": "Kilburntimes.co.uk"}, "author": "Nathalie Raffray", "title": "Coronavirus: Northwick Park Hospital sees 'massive decline' in new covid cases | Health - Kilburn Times", "description": "Northwick Park Hospital is experiencing “a lull” in coronavirus cases which staff are using to prepare should their be another wave of infections.", "url": "https://www.kilburntimes.co.uk/news/health/covid-northwick-park-hospital-sees-decline-in-cases-1-6623263", "urlToImage": null, "publishedAt": "2020-04-24T15:23:00Z", "content": "PUBLISHED: 16:23 24 April 2020 | UPDATED: 16:23 24 April 2020\r\nNathalie Raffray\r\nDr Rachel Tennant, Northwick Park Hospital consultant. Picture: Nathalie Raffray\r\nArchant\r\nNorthwick Park Hospital is experiencing “a lull” in coronavirus cases which staff are u… [+2614 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "UK hospital coronavirus death toll rises to 19506 as 768 more die - ITV News", "description": "A total of 19,506 patients had died in hospital after testing positive for coronavirus in the UK as of 5pm on Thursday, the Department of Health said, up by 768 from 18,738 the day before.\n\nThe daily figure is up on the previous day when 616 people were confi…", "url": "https://www.itv.com/news/2020-04-24/uk-hospital-coronavirus-death-toll-rises-to-19-506-as-768-more-die/", "urlToImage": null, "publishedAt": "2020-04-24T14:17:00Z", "content": null}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Chris Smith", "title": "The most unusual coronavirus symptom is also the most dangerous - BGR", "description": "The newest observed coronavirus symptom is also the most dangerous one and can appear in patients who don’t even experience other symptoms. Doctors have noticed an increase in strokes caused by blood clots in young adults, who might be reluctant to seek medic…", "url": "https://bgr.com/2020/04/24/coronavirus-symptoms-stroke-after-blood-clots-in-young-patients/", "urlToImage": null, "publishedAt": "2020-04-24T14:02:10Z", "content": "<ul><li>The newest observed coronavirus symptom is also the most dangerous one and can appear in patients who don’t even experience other symptoms.</li><li>Doctors have noticed an increase in strokes caused by blood clots in young adults, who might be relucta… [+3622 chars]"}, {"source": {"id": null, "name": "Shropshirestar.com"}, "author": "Dominic Robertson", "title": "Four more coronavirus deaths confirmed in Shropshire as UK death toll passes 19000 - shropshirestar.com", "description": "A further four people have been confirmed to have died with coronavirus in Shropshire.", "url": "https://www.shropshirestar.com/news/health/coronavirus-covid19/2020/04/24/four-more-coronavirus-deaths-confirmed-in-county/", "urlToImage": null, "publishedAt": "2020-04-24T13:35:00Z", "content": "All four patients were in the care of Shrewsbury &amp; Telford Hospital NHS Trust (SaTH) and died after testing positive for Covid-19, NHS England confirmed today. \r\nIt takes the total who have now died at the trust, which manages Royal Shrewsbury Hospital an… [+1529 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Anna Lewis", "title": "Four cemeteries in Cardiff to reopen - Wales Online", "description": "The sites will be monitored by council staff with the support of South Wales Police", "url": "https://www.walesonline.co.uk/news/wales-news/cemeteries-cardiff-open-coronavirus-cathays-18144366", "urlToImage": null, "publishedAt": "2020-04-24T13:07:26Z", "content": "Four cemeteries will be re-opened in Cardiff after being shut at the start of the month.\r\nCathays, Western, Thornhill and Pantmawr Cemeteries will be accessible to the public from Saturday for those attending funerals and visiting graves.\r\nThe sites were orig… [+2462 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Lynn Love", "title": "Scotland's youngest coronavirus patient thanks NHS for saving her life in cute clap for carers - Daily Record", "description": "Peyton Maguire was diagnosed with Covid-19 at just three-weeks-old after being born eight weeks premature on March 26.", "url": "https://www.dailyrecord.co.uk/news/scottish-news/scotlands-youngest-coronavirus-patient-thanks-21919993", "urlToImage": null, "publishedAt": "2020-04-24T13:02:43Z", "content": "A four-week-old baby, thought to be Scotland's youngest coronavirus patient, thanked NHS staff for saving her life in her first 'Clap for Carers'. \r\n Little Peyton Maguire was diagnosed with Covid-19 at just three-weeks-old after being born eight weeks premat… [+2090 chars]"}, {"source": {"id": null, "name": "Examinerlive.co.uk"}, "author": "Lauren Ballinger", "title": "Police spell out lockdown rules for \"confused\" Yorkshire Dales day trippers - ExaminerLive", "description": "More than 350 people have been fined for breaking lockdown rules", "url": "https://www.examinerlive.co.uk/news/west-yorkshire-news/police-spell-out-lockdown-rules-18145084", "urlToImage": null, "publishedAt": "2020-04-24T12:54:00Z", "content": "Police have urged day trippers tempted by the good weather forecast this weekend to stay away from the Yorkshire Dales.\r\nAnd they have said despite some confusion over the rules, it couldn't be clearer that we must all stay at home.\r\nNorth Yorkshire Police sa… [+2599 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Will Sweden's coronavirus gamble pay off? - The Telegraph", "description": "Sweden has one of the world’s most controversial - and closely watched - coronavirus strategies. Instead of ordering people to stay at home and shutting down...", "url": "https://www.youtube.com/watch?v=dkN7FFyv-QA", "urlToImage": null, "publishedAt": "2020-04-24T11:47:45Z", "content": "Sweden has one of the worlds most controversial - and closely watched - coronavirus strategies. Instead of ordering people to stay at home and shutting down all non-essential businesses, the Swedish government has simply asked people to adhere to social dista… [+439 chars]"}, {"source": {"id": null, "name": "Imperial.ac.uk"}, "author": null, "title": "Coronavirus 'map' identifies key virus entry points into the body | Imperial News - Imperial College London", "description": "Scientists are creating a map of the human body to identify locations where the COVID-19 virus can enter human cells.", "url": "https://www.imperial.ac.uk/news/197114/coronavirus-identifies-virus-entry-points-into/", "urlToImage": null, "publishedAt": "2020-04-24T11:36:27Z", "content": "Scientists are creating a map of the human body to identify locations where the COVID-19 virus can enter human cells.\r\nThe research, from a number of international institutions including Imperial College London, has so far identified likely initial infection … [+5951 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Hancock: Coronavirus lockdown should be eased at the same time for all parts of UK - Yahoo News UK", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_2db003ec-6db0-4586-9546-3a6f96629ea6&lang=en-GB&inline=false", "urlToImage": null, "publishedAt": "2020-04-24T11:13:00Z", "content": "Yahoo is part of Verizon Media. Click 'I agree' to allow Verizon Media and our partners to use cookies and similar technologies to access your device and use your data (including location) to understand your interests, and provide and measure personalised ads… [+344 chars]"}, {"source": {"id": null, "name": "Doncasterfreepress.co.uk"}, "author": "Tim Cunningham", "title": "Doncaster coronavirus deaths may be missed in official figures - Doncaster Free Press", "description": "At least two deaths linked to coronavirus in Doncaster may not be captured in official estimates, new figures suggest.", "url": "https://www.doncasterfreepress.co.uk/health/coronavirus/doncaster-coronavirus-deaths-may-be-missed-official-figures-2548746", "urlToImage": null, "publishedAt": "2020-04-24T11:02:00Z", "content": "Shadow social care minister Liz Kendall has called on the Government to publish daily figures of Covid-19 deaths outside hospital settings, including in care homes, to understand \"the true scale of the problem.\"\r\nOffice for National statistics data shows that… [+1965 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Rob Powell, political correspondent, and Greg Heffer, political reporter", "title": "Coronavirus test applications closed after 5,000 home kits ordered in two minutes - Sky News", "description": "Downing Street reveals that 5,000 home-testing kits were ordered within two minutes of the new website opening.", "url": "https://news.sky.com/story/coronavirus-online-applications-for-covid-19-tests-temporarily-closed-due-to-huge-demand-11978070", "urlToImage": null, "publishedAt": "2020-04-24T10:11:24Z", "content": null}, {"source": {"id": null, "name": "Edp24.co.uk"}, "author": "Abigail Nicholson", "title": "We must be told when we can see our relatives again, says health expert | Politics - Eastern Daily Press", "description": "Clear guidance on whether people can safely visit family and friends needs to be ready as soon as any easing of coronavirus lockdown rules is announced, a public health expert has warned.", "url": "https://www.edp24.co.uk/news/politics/must-be-told-when-we-can-see-relatives-again-1-6621960", "urlToImage": null, "publishedAt": "2020-04-24T10:00:00Z", "content": "PUBLISHED: 11:00 24 April 2020\r\nAbigail Nicholson\r\nClear guidance on whether people can safely visit family and friends needs to be ready as soon as any easing of coronavirus lockdown rules is announced, a public health expert has warned. Picture: Getty Image… [+2742 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Staff devastated as 15 residents of the same nursing home die in the space of a month - ITV News", "description": "Staff at a nursing home in Newport have been left devastated following the\ndeaths of 15 residents in the space of a month.\n\nFourteen of the elderly residents at Tregwilym Lodge in Rogerstone were showing symptoms of coronavirus before they died, although test…", "url": "https://www.itv.com/news/wales/2020-04-24/fifteen-nursing-home-residents-die-in-the-space-of-a-month/", "urlToImage": null, "publishedAt": "2020-04-24T09:44:00Z", "content": "Staff at a nursing home in Newport have been left devastated following the\r\ndeaths of 15 residents in the space of a month.\r\nFourteen of the elderly residents at Tregwilym Lodge in Rogerstone were showing symptoms of coronavirus before they died, although tes… [+1796 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nAnnelies Gartner", "title": "How close are we to a coronavirus vaccine - and when will trials begin? - Telegraph.co.uk", "description": "Latest news on the search for a vaccine against the new coronavirus", "url": "https://www.telegraph.co.uk/global-health/science-and-disease/coronavirus-vaccine-trials-start-covid-19-latest-update/", "urlToImage": null, "publishedAt": "2020-04-24T08:57:32Z", "content": "As Covid-19 has rapidly spread around the world there has been a mad scramble to find a vaccine. \r\nIn the UK a potential coronavirus vaccine being developed at the University of Oxford will begin human trials from Thursday, Matt Hancock, the Health Secretary,… [+1550 chars]"}, {"source": {"id": null, "name": "Expressandstar.com"}, "author": null, "title": "Birmingham mother dies with coronavirus six days after giving birth - expressandstar.com", "description": "The family of a new mother who died in hospital without ever getting to hold her baby have spoken of their devastation.", "url": "https://www.expressandstar.com/news/health/coronavirus-covid19/2020/04/24/birmingham-mother-dies-in-hospital-six-days-after-giving-birth/", "urlToImage": null, "publishedAt": "2020-04-24T07:37:00Z", "content": "Fozia Hanif, who had tested positive for coronavirus, died at Birmingham's Heartlands Hospital on April 8 after her condition deteriorated following the birth of her son. \r\nThe 29-year-old - whose baby remains in hospital but has tested negative for Covid-19 … [+2426 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nLizzie Roberts", "title": "Contact tracing: how has it worked for other countries, and could it really help ease UK lockdown? - The Telegraph", "description": "From teams of 'corona detectives' to Army cadets making thousands of calls a day, countries are tracking the spread of Covid-19", "url": "https://www.telegraph.co.uk/news/2020/04/25/what-contact-tracing-how-work-countries-uk-lockdown/", "urlToImage": null, "publishedAt": "2020-04-24T06:57:00Z", "content": "Countries around the world are rushing to launch contact tracing apps to identify who an infected person has had contact with, as part of efforts to slow the spread of the coronavirus. \r\nThe UK Government has announced the infrastructure was being put in plac… [+1754 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Kathleen Speirs, Ryan Merrifield", "title": "'One in a million' nurse described 'excruciating' symptoms before dying of coronavirus - Mirror Online", "description": "Angela Cunningham's death saw an outpouring of grief on social media, where the veteran nurse had detailed her agonising symptoms, including vomiting and muscle pain, in the days before going into hospital", "url": "https://www.mirror.co.uk/news/uk-news/one-million-nurse-described-excruciating-21918725", "urlToImage": null, "publishedAt": "2020-04-24T06:08:50Z", "content": "The heartbreak of a popular nurse's tragic death from coronavirus, just days before she turned 60, will \"never heal\", her brother has said.\r\nAngela Cunningham, known as Angie, had been on a ventilator in ITU at Borders General Hospital for a week after testin… [+2692 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "BBC News", "title": "What is contact tracing and how does it work? - BBC News", "description": "When lockdown ends, contact tracing could help limit the spread of coronavirus.", "url": "https://www.bbc.co.uk/news/av/technology-52401049/coronavirus-what-is-contact-tracing-and-how-does-it-work", "urlToImage": null, "publishedAt": "2020-04-24T05:54:19Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: What do the stats tell us in Wales? - BBC News", "description": "Where are the hot spots in Wales and what is happening in care homes?", "url": "https://www.bbc.co.uk/news/uk-wales-52380643", "urlToImage": null, "publishedAt": "2020-04-24T05:41:30Z", "content": "Image copyrightGetty ImagesImage caption\r\n Beaches such as this one in Rhyl are all-but deserted during lockdown restrictions\r\nWhat can different statistics tell us about coronavirus in Wales so far?\r\nWe seem to be bombarded with different measures, but what … [+10081 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "David Rhodes", "title": "Coronavirus: Middlesbrough inhabitants most 'at risk' of dying - BBC News", "description": "A think tank says people in Middlesbrough have the highest chance of dying from Covid-19.", "url": "https://www.bbc.com/news/uk-england-tees-52354430", "urlToImage": null, "publishedAt": "2020-04-23T23:52:00Z", "content": "Let us know you agree to cookies\r\nWe use cookies to give you the best online experience. Please let us know if you agree to all of these cookies.\r\nImage caption\r\n Parks in Middlesbrough remain closed\r\nThe Mayor of Middlesbrough recently ordered all of the tow… [+6161 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: 'I faked having Covid-19 on Facebook and got arrested' - BBC News", "description": "Across the world police are chasing down alleged symptom-fakers who are being accused of triggering panic.", "url": "https://www.bbc.com/news/technology-52397294", "urlToImage": null, "publishedAt": "2020-04-23T23:21:30Z", "content": "Image copyrightTyler County Sheriff's Office/ GettyImage caption\r\n Mr Brandin's picture released by police\r\nMichael Lane Brandin knew his Facebook post would cause a stir.\r\nWhat he didn't realise was that he'd be arrested, lose his job and face a trial that c… [+4279 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Kat Lay, Health Correspondent | Chris Smyth, Whitehall Editor", "title": "Virus-free 'hubs' to take over cancer care as referrals drop - The Times", "description": "A network of “Covid-free hubs” will treat cancer patients, it has been announced, as the NHS launches a “help us help you” campaign to get people back to hospitals.Amid growing fears about the risk to", "url": "https://www.thetimes.co.uk/article/virus-free-hubs-to-take-over-cancer-care-as-referrals-drop-f229579kn", "urlToImage": null, "publishedAt": "2020-04-23T23:01:00Z", "content": "A network of Covid-free hubs will treat cancer patients, it has been announced, as the NHS launches a help us help you campaign to get people back to hospitals.\r\nAmid growing fears about the risk to patients with other conditions as the health service focuses… [+487 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Lucy Jones", "title": "Take Vitamin D supplements during coronavirus lockdown, Public Health England urges - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11461447/take-vitamin-d-supplements-coronavirus-lockdown-nhs/", "urlToImage": null, "publishedAt": "2020-04-23T23:00:35Z", "content": "BRITS should take vitamin D supplements during coronavirus lockdown, Public Health England says. \r\nThe vitamin is produced by exposing the skin to sunshine and is essential for a healthy immune system.\r\n Public Health England are urging people to take vitamin… [+6561 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Sarah Marsh", "title": "NHS limits dialysis supplies for coronavirus patients - The Guardian", "description": "NHS England sends out emergency guidance following a shortage of dialysis fluids", "url": "https://www.theguardian.com/uk-news/2020/apr/23/nhs-limits-dialysis-supplies-for-coronavirus-patients", "urlToImage": null, "publishedAt": "2020-04-23T21:24:00Z", "content": "Hospitals are having to conserve life-saving dialysis fluid in the coming days because of national shortages, as it has been revealed that 28% of coronavirus patients in intensive care who need significant help to breathe also need kidney support.\r\nAccording … [+4901 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Harrison Jones", "title": "UK urged 'do your bit' with 25,000 to be invited to take part in coronavirus study - Metro.co.uk", "description": "'Take part in this vital research for your country.'", "url": "https://metro.co.uk/2020/04/23/uk-urged-bit-25000-invited-take-part-coronavirus-study-12602033/", "urlToImage": null, "publishedAt": "2020-04-23T20:38:08Z", "content": "Participants will give nose and throat swabs in one of the biggest virus infection and antibodies studies that this country has ever seen (Picture: Getty Images)\r\nThe Health Secretary Matt Hancock has urged the public to do your bit by taking part in a large-… [+4458 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Britons come together to Clap for our Carers and thank the NHS - The Telegraph", "description": "People across the UK came out on their doorsteps, balconies, windows and gardens to clap for our cares for the fifth week running. For all the latest on coro...", "url": "https://www.youtube.com/watch?v=XZo5XuydB9M", "urlToImage": null, "publishedAt": "2020-04-23T19:45:53Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Henry McDonald, Pamela Duncan", "title": "Lockdown may be lifted earlier in Northern Ireland than rest of UK - The Guardian", "description": "Arlene Foster makes statement as it emerges extra critical care capacity not expected to be needed", "url": "https://www.theguardian.com/world/2020/apr/23/lockdown-may-be-lifted-earlier-in-northern-ireland-than-rest-of-uk", "urlToImage": null, "publishedAt": "2020-04-23T19:09:46Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Paul Dinsdale For Mailonline Vanessa Chalmers Health Reporter For Mailonline", "title": "NHS trusts buy their own antibody kits from Dutch firm to test staff - Daily Mail", "description": "Hundreds of the Biozek tests have already been used on NHS staff in London, Manchester and Leicester as hospitals face a surge in demand at a time when up to a fifth of the workforce are off sick.", "url": "https://www.dailymail.co.uk/news/article-8250133/NHS-trusts-buy-antibody-kits-Dutch-firm-test-staff.html", "urlToImage": null, "publishedAt": "2020-04-23T18:32:57Z", "content": "Five trusts in England are in talks with Dutch firm Biozek Medical to buy thousands of its rapid finger-prick tests which give a diagnosis in a matter of minutes\r\nNHS trusts have resorted to buying coronavirus antibody tests overseas in a bid to get their sta… [+13487 chars]"}, {"source": {"id": null, "name": "Herefordtimes.com"}, "author": "James Thomas", "title": "Coronavirus: ONS figures reveal more deaths in Herefordshire - Hereford Times", "description": "AT least three deaths linked to coronavirus in Herefordshire happened outside of hospital, new figures suggest.", "url": "https://www.herefordtimes.com/news/18401691.coronavirus-ons-figures-reveal-deaths-herefordshire/", "urlToImage": null, "publishedAt": "2020-04-23T18:01:33Z", "content": "AT least three deaths linked to coronavirus in Herefordshire happened outside of hospital, new figures suggest.\r\nOffice for National Statistics (ONS) data shows that in Herefordshire, 18 deaths involving Covid-19 were provisionally registered up to April 10.\r… [+2366 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": null, "title": "LIVE: Health secretary giving daily coronavirus briefing | Politics News - Sky News", "description": "Deaths of UK hospital patients with COVID-19 reach 18,738, but social distancing is said to be working.", "url": "https://news.sky.com/story/live-health-secretary-gives-daily-coronavirus-briefing-11977730", "urlToImage": null, "publishedAt": "2020-04-23T16:07:30Z", "content": null}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Sophie Law", "title": "Scots to be told to 'cover mouth and nose with scarves' instead of masks during coronavirus outbreak - Daily Record", "description": "Scientists and politicians are set to meet today to discuss whether masks should be made compulsory.", "url": "https://www.dailyrecord.co.uk/news/health/scots-told-cover-mouth-nose-21915766", "urlToImage": null, "publishedAt": "2020-04-23T16:02:47Z", "content": "Scots are expected to be told to use scarves to cover their mouth and nose instead of wearing masks during the coronavirus outbreak, according to reports. \r\n The nation's top scientists have been discussing the benefits of masks, and whether they could slow t… [+1659 chars]"}, {"source": {"id": null, "name": "Lep.co.uk"}, "author": "Iain Lynn", "title": "Two pet cats test positive to coronavirus - Lancashire Post", "description": "Two pet cats in New York state have tested positive for the coronavirus, marking the first confirmed cases in companion animals in the US, federal officials said.", "url": "https://www.lep.co.uk/health/coronavirus/two-pet-cats-test-positive-coronavirus-2547776", "urlToImage": null, "publishedAt": "2020-04-23T16:00:00Z", "content": "The cats, which had mild respiratory illnesses and are expected to recover, are thought to have contracted the virus from people in their households or neighbourhoods, the US Department of Agriculture (USDA) and the federal Centres for Disease Control and Pre… [+3049 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Oliver Wright", "title": "Coronavirus 'nearly put Dominic Cummings in hospital' | News - The Times", "description": "Dominic Cummings’s wife has described how he collapsed after suffering coronavirus symptoms and was nearly taken to hospital when his oxygen levels dropped.Mary Wakefield, a writer for The Spectator", "url": "https://www.thetimes.co.uk/article/coronavirus-nearly-left-dominic-cummings-in-hospital-3k2zrjdd3", "urlToImage": null, "publishedAt": "2020-04-23T16:00:00Z", "content": "Dominic Cummingss wife has described how he collapsed after suffering coronavirus symptoms and was nearly taken to hospital when his oxygen levels dropped.\r\nMary Wakefield, a writer for The Spectator, said that Boris Johnsons most senior adviser had rushed ho… [+449 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "UK Covid-19 hospital death toll rises to 18738 - AOL Travel UK", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_e85314e3-7f25-4baa-b5b9-9f49911aff5a&lang=en-GB&inline=false", "urlToImage": null, "publishedAt": "2020-04-23T15:28:00Z", "content": "AOL is part of Verizon Media. Click 'I agree' to allow Verizon Media and our partners to use cookies and similar technologies to access your device and use your data (including location) to understand your interests, and provide and measure personalised ads. … [+342 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Gemma Mullin", "title": "Scientists can’t rule out the chance coronavirus could be sexually transmitted - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11462872/scientists-coronavirus-sexually-transmitted/", "urlToImage": null, "publishedAt": "2020-04-23T14:19:53Z", "content": "SCIENTISTS have admitted that they can't rule out the chance that coronavirus could be sexually transmitted.\r\nResearchers from the University of Utah have analysed some early data from men in China who recently had Covid-19.\r\n Experts say they can't rule out … [+5454 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Gemma Mullin", "title": "Coronavirus causes blood clots and sudden strokes in young, healthy patients, doctors warn - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11462002/coronavirus-blood-clots-sudden-strokes-young-healthy-patients/", "urlToImage": null, "publishedAt": "2020-04-23T14:12:43Z", "content": "CORONAVIRUS can cause blood clots and sudden strokes in young, healthy patients, doctors have warned.\r\nMedics in New York say they have seen a sevenfold increase in stroke cases in people in their 30s and 40s who either had mild or no Covid-19 symptoms at all… [+4692 chars]"}, {"source": {"id": null, "name": "Inverness-courier.co.uk"}, "author": "Philip Murray", "title": "Three new Covid-19 coronavirus cases confirmed in the Highlands, but numbers in hospital fell; mirroring a similar fall across Scotland as a whole - Inverness Courier", "description": "Three new cases of Covid-19 have been confirmed in the NHS Highland area, taking the overall total to 214.", "url": "https://www.inverness-courier.co.uk/news/new-highland-covid-19-cases-confirmed-amid-a-slight-drop-in-hospital-patient-numbers-197600/", "urlToImage": null, "publishedAt": "2020-04-23T13:21:00Z", "content": "Coronavirus news.\r\nTHREE new cases of Covid-19 have been confirmed in the NHS Highland area, taking the overall total to 214.\r\nIt came as Scotland recorded another 371 cases, taking the overall number since the outbreak began to 9409. Sadly the death toll als… [+1227 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Kit Heren", "title": "Nose cells identified as entry points for coronavirus - Evening Standard", "description": "", "url": "https://www.standard.co.uk/news/health/nose-cells-coronavirus-entry-infection-a4422226.html", "urlToImage": null, "publishedAt": "2020-04-23T12:37:03Z", "content": "Two nose cells have been identified as the first points at which Covid-19 enters the human body.\r\nScientists from the Wellcome Sanger Institute in the UK and several other universities have found that these cells contain high levels of the protein that corona… [+1661 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Kathleen Speirs", "title": "'One in a million' Scots nurse dies from Covid-19 week after telling of 'excruciating' symptoms - Daily Record", "description": "Great-grandmother Angie Cunningham 'wasn't scared to stand up and be counted when things were tough'.", "url": "https://www.dailyrecord.co.uk/news/health/one-million-scots-nurse-dies-21913766", "urlToImage": null, "publishedAt": "2020-04-23T12:34:36Z", "content": "A 'one in a million' Scots nurse died from covid-19 in the hospital where she worked just days after her 60th birthday. \r\n Angela Cunningham, known as Angie, passed away at Borders General Hospital's Intensive Care Unit (ICU) on Wednesday. \r\nThe great-grandmo… [+3569 chars]"}]}