{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Spain's children run free from lockdown - but not all - BBC News", "description": "After six weeks indoors, under-14s are being let out of doors, but how damaging was the lockdown?", "url": "https://www.bbc.co.uk/news/world-europe-52409407", "urlToImage": null, "publishedAt": "2020-04-26T03:45:43Z", "content": "Image caption\r\n Susana Fuertes believes her children have coped well with the six weeks indoors, but her son Mateo will not yet be allowed out\r\nWhen Spain's government announced a national lockdown in mid-March, in reaction to coronavirus, not everyone was di… [+5381 chars]"}, {"source": {"id": null, "name": "Shieldsgazette.com"}, "author": "Debra Fox", "title": "South Tyneside's coronavirus cases stand at 464 as 16 more patients die under care of borough's hospital trust - Shields Gazette", "description": "Another 16 patients have lost their lives after testing positive for coronavirus at the hospital trust which serves South Tyneside, according to the latest data from NHS England.", "url": "https://www.shieldsgazette.com/health/coronavirus/south-tynesides-coronavirus-cases-stand-464-16-more-patients-die-under-care-boroughs-hospital-trust-2498479", "urlToImage": null, "publishedAt": "2020-04-26T03:41:16Z", "content": "The figures show 242 people have died in hospitals covered by South Tyneside and Sunderland NHS Foundation Trust as of Saturday, April 25.\r\nIn total, 905 people who had tested positive for coronavirus have died across the North Easts hospital trusts.\r\nForty-t… [+3429 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Isobel Frodsham, news reporter", "title": "Coronavirus: Cancer surgeon expands red and green card scheme to help vulnerable - Sky News", "description": "Dr Shilen Patel, 36, began rolling out the movement as the UK was on the verge of lockdown.", "url": "https://news.sky.com/story/coronavirus-cancer-surgeon-expands-red-and-green-card-scheme-to-help-vulnerable-11978652", "urlToImage": null, "publishedAt": "2020-04-26T03:32:10Z", "content": null}, {"source": {"id": null, "name": "Sky.com"}, "author": "Neville Lazarus", "title": "Coronavirus: Millions in India facing hunger during COVID-19 lockdown measures - Sky News", "description": "The World Food Programme has said the coronavirus outbreak could cause \"multiple famines of biblical proportions\".", "url": "https://news.sky.com/story/coronavirus-millions-of-indians-facing-hunger-during-covid-19-lockdown-measures-11978857", "urlToImage": null, "publishedAt": "2020-04-26T01:20:13Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Evgeny Lebedev For The Mail On Sunday", "title": "Shocking picture of bats for sale in Indonesia shows wet markets are still open - Daily Mail", "description": "Since I have begun to write on the urgent need to close live animal markets, I have been surprised by the support I have received from across the UK.", "url": "https://www.dailymail.co.uk/news/article-8257375/Shocking-picture-bats-sale-Indonesia-shows-wet-markets-open.html", "urlToImage": null, "publishedAt": "2020-04-26T00:56:23Z", "content": "Since I have begun to write on the urgent need to close live animal markets, I have been surprised by the support I have received from across the UK. \r\nReaders of The Mail on Sunday have written to say how strongly they agree about the threat of contagion the… [+3244 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: US and China trade conspiracy theories - BBC News", "description": "Conspiracy theories about Covid-19 have been spreading online since the early days of the outbreak.", "url": "https://www.bbc.com/news/world-52224331", "urlToImage": null, "publishedAt": "2020-04-26T00:23:19Z", "content": "Image caption\r\n Speculation about the origin of the virus has been rife online\r\nFrom the early stages of the coronavirus outbreak, conspiracy theories about the origin and scale of the disease were spread on online platforms. \r\nAmong these were the false clai… [+6717 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Alex Woodward", "title": "Coronavirus: 'No evidence' recovered patients are immune to re-infection, warns WHO - The Independent", "description": "World Health Organisation does not recommend governments issue 'immunity passports' as countries look to 'reopen' amid pandemic", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-immunity-passports-antibody-tests-world-health-organisation-a9484261.html", "urlToImage": null, "publishedAt": "2020-04-25T23:11:26Z", "content": "The World Health Organisation says there is no evidence that people who have recovered from coronavirus and have antibodies are protected against a second infection.\r\nIn a scientific brief published on Saturday, the United Nations agency warned against countr… [+2673 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Rosamund Urwin, Andrew Gregory and Caroline Wheeler", "title": "Coronavirus: NHS will fall short of 1bn items of protective gear, review reveals - The Times", "description": "The UK will be short of up to a billion items of personal protective equipment (PPE), according to a secret forecast commissioned by the government that will heap pressure on the health secretary", "url": "https://www.thetimes.co.uk/article/surgical-gowns-almost-gone-send-boiler-suits-plead-nhs-bosses-nk25sfsx7", "urlToImage": null, "publishedAt": "2020-04-25T23:01:00Z", "content": "The UK will be short of up to a billion items of personal protective equipment (PPE), according to a secret forecast commissioned by the government that will heap pressure on the health secretary, Matt Hancock.\r\nThe predictions of severe shortages were set ou… [+501 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Chanel Georgina", "title": "Hair loss treatment: The ‘most effective’ remedy to boost hair growth - how to make it - Express", "description": "HAIR LOSS can be upsetting for men and women alike. What's the 'most effective' remedy to boost hair growth? And how do you make it?", "url": "https://www.express.co.uk/life-style/health/1273911/hair-loss-treatment-coconut-milk-how-to-make-it", "urlToImage": null, "publishedAt": "2020-04-25T22:30:57Z", "content": "According to Dr Blossom Kochhar, the \"most effective\" remedy for natural hair growth is the use of coconut milk.\r\nSpecifically, Dr Kochhar advises to \"take coconut milk from a fresh coconut\" – and not to use the liquid from a carton.\r\nCoconut milks is rich in… [+182 chars]"}, {"source": {"id": null, "name": "Sunderlandecho.com"}, "author": "Dominic Scurr", "title": "Live updates: North East coronavirus cases rise to 6,772 as UK death toll passes 20,000 - Sunderland Echo", "description": "Good evening on Saturday, April 25. It’s Dominic here bringing you the latest updates from across the North East and UK.", "url": "https://www.sunderlandecho.com/health/coronavirus/live-updates-north-east-coronavirus-cases-rise-6772-uk-death-toll-passes-20000-2505131", "urlToImage": null, "publishedAt": "2020-04-25T22:07:41Z", "content": "With Prime Minister Boris Johnson expected to return to Downing Street next week after recuperating from the virus, Mr Hammond said he hoped it would mark a \"clear step change\" in the Government's response to the crisis.\r\nThe former Chancellor said it is esse… [+826 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "James Hockaday", "title": "Parks swamped with sunbathers as phone data shows Brits ignoring lockdown - Metro.co.uk", "description": "'It won't take much for this virus to start increasing its transmission again and to spread more widely.'", "url": "https://metro.co.uk/2020/04/25/parks-swamped-sunbathers-phone-data-shows-brits-ignoring-lockdown-12610758/", "urlToImage": null, "publishedAt": "2020-04-25T21:55:51Z", "content": "Police patrolled parks as people flocked outside to enjoy the sunshine (Picture: Getty Images/REX)\r\nHealth officials fear Britons are getting complacent about the coronavirus lockdown as traffic and mobile phone data revealed more of us are on the roads and l… [+4912 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "UK doctor invents digital flashcards to help Covid-19 patients understand staff - The Guardian", "description": "Cardmedic overcomes communication barrier caused by healthcare staff wearing PPE", "url": "https://www.theguardian.com/world/2020/apr/25/uk-doctor-invents-digital-flashcards-to-help-covid-19-patients-understand-staff", "urlToImage": null, "publishedAt": "2020-04-25T21:50:36Z", "content": "A coronavirus patients terrifying hospital experience inspired an NHS doctor to create a flashcard system to improve communication with medical staff wearing face masks.\r\nAnaesthetist Rachael Grimaldi founded Cardmedic while on maternity leave after reading a… [+2712 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nSteve Bird", "title": "Vaccine results could be set back by successful lockdown, professor warns - Telegraph.co.uk", "description": "As the first human tests for a Covid-19 vaccine begin, scientists warn that the success of the lockdown could slow down their analysis", "url": "https://www.telegraph.co.uk/news/2020/04/25/vaccine-results-could-set-back-successful-lockdown-professor/", "urlToImage": null, "publishedAt": "2020-04-25T20:00:00Z", "content": "Results from trials for a Covid-19 vaccine could be delayed due to the success of the lockdown in preventing the spread of coronavirus, the director of the Oxford Vaccine Group has said.\r\nSpeaking shortly after the first volunteers were injected as part of hu… [+3129 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ariana Eunjung Cha", "title": "Spike in stroke deaths in patients with only minor coronavirus symptoms - The Independent", "description": "Reports of strokes in the young and middle-aged are the latest twist in our evolving understanding of the mysteries of the virus, finds Ariana Eunjung Cha", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-stroke-deaths-symptoms-covid-19-heart-a9484091.html", "urlToImage": null, "publishedAt": "2020-04-25T18:45:03Z", "content": "Thomas Oxley wasnt even on call the day he received the page to come into Mount Sinai Beth Israel Hospital in Manhattan. There werent enough doctors to treat all the emergency stroke patients, and he was needed in the operating room.\r\nThe patients chart appea… [+9849 chars]"}, {"source": {"id": null, "name": "Burytimes.co.uk"}, "author": "Saiqa Chaudhari", "title": "Baby Erin Bates survives coronavirus — and is cheered by nurses and doctors as she leaves HDU - Bury Times", "description": "A BABY girl who won the heart of the nation ­— and the world ­— in her fight against coronavirus has made a full recovery from the illness.", "url": "https://www.burytimes.co.uk/news/18405951.baby-erin-bates-survives-coronavirus-----cheered-nurses-doctors-leaves-hdu/", "urlToImage": null, "publishedAt": "2020-04-25T18:36:24Z", "content": "A BABY girl who won the heart of the nation ­— and the world ­— in her fight against coronavirus has made a full recovery from the illness.\r\nMum Emma Bates found out yesterday her daughter, Erin's test result for covid-19 had come back negative ­— less than t… [+3402 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Chanel Georgina", "title": "Type 2 diabetes symptoms: The sign to look for when you go to the toilet - Express", "description": "TYPE 2 diabetes needs to be diagnosed early. Otherwise, the condition can really have a negative impact on your health. What's the sign to look for when you go to the toilet?", "url": "https://www.express.co.uk/life-style/health/1273864/type-2-diabetes-symptoms-diarrhoea-constipation-nerve-damage", "urlToImage": null, "publishedAt": "2020-04-25T18:23:59Z", "content": "Type 2 diabetes is estimated to affect one in 15 people within the UK. How do you know if you've got it too? What's the sign to look for in the loo?\r\nFirst, what exactly is type 2 diabetes and what causes it?\r\nDiabetes UK explains how diabetes is a health con… [+1167 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Coronavirus: People with COVID-19 symptoms more than double number who tested positive, app shows - Sky News", "description": "The COVID symptom tracker has been downloaded by nearly 2.7 million people and is generating an \"unprecedented\" amount of data.", "url": "https://news.sky.com/story/coronavirus-people-with-covid-19-symptoms-more-than-double-number-who-tested-positive-app-shows-11978714", "urlToImage": null, "publishedAt": "2020-04-25T17:48:45Z", "content": null}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Charlotte Hadfield", "title": "'Vibrant, outgoing' mum admitted to hospital with eye infection dies from coronavirus - Liverpool Echo", "description": "The mum-of-three sadly died at the Royal Hospital holding her son's hand", "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/vibrant-outgoing-mum-admitted-hospital-18151209", "urlToImage": null, "publishedAt": "2020-04-25T17:44:43Z", "content": "Tributes have been paid to a \"vibrant and outgoing\" mum who has died from coronavirus.\r\n Margaret Magee, from Anfield, sadly lost her life on April 3 at the Royal Liverpool Hospital, while holding her son Michael's hand. \r\nThe 79-year-old was first admitted t… [+1870 chars]"}, {"source": {"id": null, "name": "Countypress.co.uk"}, "author": "Dominic Kureen", "title": "Isle of Wight confirmed coronavirus cases now at 86 - Isle of Wight County Press", "description": "THERE have been four more coronavirus deaths announced on the Isle of Wight today (Saturday).", "url": "https://www.countypress.co.uk/news/18405866.isle-wight-confirmed-coronavirus-cases-now-86/", "urlToImage": null, "publishedAt": "2020-04-25T16:32:00Z", "content": "THERE have been four more coronavirus deaths announced on the Isle of Wight today (Saturday).\r\nThe number of confirmed cases now stands at 86, having climbed from 82 yesterday.\r\nThe latest figures have been released by Public Health England.\r\nThe Isle of Wigh… [+231 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Alice Tidey", "title": "Coronavirus: France drastically limits sale of nicotine products - Euronews", "description": "The measure comes after a study found that \"nicotine may be suggested as a potential preventive agent against Covid-19 infection.\"", "url": "https://www.euronews.com/2020/04/25/coronavirus-france-drastically-limits-sale-of-nicotine-products", "urlToImage": null, "publishedAt": "2020-04-25T16:31:54Z", "content": "France severely curtailed the sale of nicotine products on Friday after a study suggested smokers may be less likely to contract COVID-19.\r\nThe decree, issued by the Ministry of Health, limits pharmacies from selling more than a one-month supply of any nicoti… [+1842 chars]"}, {"source": {"id": null, "name": "Getreading.co.uk"}, "author": "Kirstie McCrum", "title": "More Berkshire hospital trust coronavirus-related deaths confirmed as UK losses pass 20,000 - Get Reading", "description": "Reading is reporting the highest number of positive cases in the area", "url": "https://www.getreading.co.uk/news/reading-berkshire-news/more-berkshire-hospital-trust-coronavirus-18150829", "urlToImage": null, "publishedAt": "2020-04-25T15:22:02Z", "content": "Another 11 people have died at Berkshire's hospitals after testing positive for coronavirus.\r\nThe latest figures from NHS England on Friday (April 24) show a total of 386 people have now died.\r\nThere have now been 262 deaths at the Frimley Health NHS Foundati… [+1256 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Chris Smith", "title": "Everything we know about Italy’s horrific coronavirus outbreak might’ve just changed - BGR", "description": "New research from Italy says the first local coronavirus cases may have appeared as early as a month before people were diagnosed COVID-19 positive. Italy’s first COVID-19 cases were two Chinese citizens who were tested in Rome on January 31st. Three weeks la…", "url": "https://bgr.com/2020/04/25/coronavirus-stats-italys-covid-19-epidemic-may-have-started-earlier/", "urlToImage": null, "publishedAt": "2020-04-25T14:42:09Z", "content": "<ul><li>New research from Italy says the first local coronavirus cases may have appeared as early as a month before people were diagnosed COVID-19 positive.</li><li>Italy’s first COVID-19 cases were two Chinese citizens who were tested in Rome on January 31st… [+3644 chars]"}, {"source": {"id": null, "name": "Shropshirestar.com"}, "author": "Deborah Hardiman", "title": "Eight more coronavirus deaths confirmed in Shropshire as UK death toll passes 20000 - shropshirestar.com", "description": "A further eight people have been confirmed to have died with coronavirus in Shropshire.", "url": "https://www.shropshirestar.com/news/health/coronavirus-covid19/2020/04/25/eight-more-coronavirus-deaths-confirmed-in-shropshire-as-uk-death-toll-passes-20000/", "urlToImage": null, "publishedAt": "2020-04-25T14:37:00Z", "content": "Seven patients were in the care of Shrewsbury &amp; Telford Hospital NHS Trust (SaTH) and died after testing positive for Covid-19, while one patient was in the care of the Robert Jones and Agnes Hunt Orthopaedic Hospital near Oswestry, NHS England confirmed … [+1743 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Mattha Busby", "title": "Coronavirus tests for key workers in England run out quickly for second day - The Guardian", "description": "Home-testing kits unavailable 15 minutes after website opens and drive-through slots booked up within hour", "url": "https://www.theguardian.com/world/2020/apr/25/england-and-wales-coronavirus-test-slots-and-kits-run-out-again", "urlToImage": null, "publishedAt": "2020-04-25T14:36:53Z", "content": null}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Jenny Kirkham, Rebecca Day", "title": "Erin the 'miracle baby' born with a heart condition has beaten coronavirus - Manchester Evening News", "description": "'They are all truly amazing and we will be forever grateful', her mum said of the NHS heroes who saved her daughter's life", "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/erin-miracle-baby-born-heart-18150417", "urlToImage": null, "publishedAt": "2020-04-25T14:36:06Z", "content": "A six-month-old 'miracle baby' born with a heart condition has beaten coronavirus.\r\nMedics were moved to tears as they clapped for little Erin Bates, from Bury, as she was wheeled through the corridor having spent two weeks in an isolation unit.\r\nThe tot was … [+4394 chars]"}, {"source": {"id": null, "name": "Dailypost.co.uk"}, "author": "Ben Mitchell, Press Association, Marc Waddington-NW", "title": "Identical twin sister nurses die days apart after contracting coronavirus - Daily Post", "description": "Katy and Emma Davies, from Southampton, died this week", "url": "https://www.dailypost.co.uk/news/uk-world-news/identical-twin-sister-nurses-die-18150611", "urlToImage": null, "publishedAt": "2020-04-25T14:31:10Z", "content": "Identical twin sister nurses both died after catching coronavirus.\r\nChildren's nurse Katy Davis, 37, died at Southampton General Hospital on Tuesday.\r\nHer sister Emma, a former surgery nurse, died early on Friday.\r\nBoth women had an underlying health conditio… [+1786 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Northern Ireland's coronavirus death toll rises to 294 | UTV - ITV News - ITV News", "description": "Sixteen more people who tested positive for coronavirus in Northern Ireland have sadly died, taking the total number to 294.\n\nAccording to the Department of Health, testing has resulted in 104 new cases in the region.\n\nThe total number of confirmed cases in N…", "url": "https://www.itv.com/news/utv/2020-04-25/northern-irelands-coronavirus-death-toll-rises-to-294/", "urlToImage": null, "publishedAt": "2020-04-25T14:22:00Z", "content": "Sixteen more people who tested positive for coronavirus in Northern Ireland have sadly died, taking the total number to 294.\r\nAccording to the Department of Health, testing has resulted in 104 new cases in the region.\r\nThe total number of confirmed cases in N… [+337 chars]"}, {"source": {"id": null, "name": "Leaderlive.co.uk"}, "author": "Steve Craddock", "title": "65 new cases of coronavirus and more than 90 total deaths reported across north Wales - LeaderLive", "description": "THE total number of deaths in relation to coronavirus across north Wales now stands at 93, health chiefs have announced.", "url": "https://www.leaderlive.co.uk/news/18405711.65-new-cases-coronavirus-90-total-deaths-reported-across-north-wales/", "urlToImage": null, "publishedAt": "2020-04-25T13:55:00Z", "content": "THE total number of deaths in relation to coronavirus across north Wales now stands at 93, health chiefs have announced.\r\nPublic Health Wales has confirmed that as of 2pm on Saturday (April 25) 65 new cases of the virus have been reported across the Betsi Cad… [+729 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Immunity passports 'could increase virus spread' - BBC News", "description": "No evidence people who develop antibodies after recovering are protected against a second infection.", "url": "https://www.bbc.com/news/world-52425825", "urlToImage": null, "publishedAt": "2020-04-25T13:40:47Z", "content": "Image copyrightReutersImage caption\r\n Testing for antibodies is becoming more widespread\r\nGovernments should not issue so-called \"immunity passports\" or \"risk-free certificates\" as a way of easing lockdowns, the World Health Organization (WHO) says.\r\nIt said … [+4744 chars]"}, {"source": {"id": null, "name": "Cornwalllive.com"}, "author": "Lee Trewhela", "title": "Two more coronavirus deaths are confirmed in Cornwall - Cornwall Live", "description": "New deaths reported by Cornwall Partnership NHS Foundation Trust", "url": "https://www.cornwalllive.com/news/cornwall-news/two-more-coronavirus-deaths-confirmed-4078683", "urlToImage": null, "publishedAt": "2020-04-25T13:34:46Z", "content": "Two more people have died in Cornwall after testing positive for the COVID-19 coronavirus.\r\nThe latest figures from NHS England brings the total deaths in the county to 70.\r\nBoth of the deaths were reported by Cornwall Partnership NHS Foundation Trust.\r\nThere… [+552 chars]"}, {"source": {"id": null, "name": "Plymouthherald.co.uk"}, "author": "Sarah Waddington", "title": "Person dies from coronavirus in Plymouth as total reaches 57 - Plymouth Live", "description": "Another patient has died after testing positive for COVID-19 at Derriford Hospital", "url": "https://www.plymouthherald.co.uk/news/plymouth-news/person-dies-coronavirus-plymouth-total-4078672", "urlToImage": null, "publishedAt": "2020-04-25T13:33:22Z", "content": "There has been another coronavirus death at Derriford Hospital in Plymouth, latest figures from NHS England show.\r\nNew figures released this afternoon state that another patient with coronavirus has died at the hospital, bringing the city's total to 57.\r\nTher… [+1144 chars]"}, {"source": {"id": null, "name": "Dailyecho.co.uk"}, "author": "Emily Liddell", "title": "Coronavirus: 10 more patients die across Hampshire in 24 hours - Daily Echo", "description": "A FURTHER ten people who tested positive for coronavirus have died in Hampshire in the last 24 hours.", "url": "https://www.dailyecho.co.uk/news/18405663.coronavirus-10-patients-die-across-hampshire-24-hours/", "urlToImage": null, "publishedAt": "2020-04-25T13:19:00Z", "content": "A FURTHER ten people who tested positive for coronavirus have died in Hampshire in the last 24 hours.\r\nOfficial figures released by the NHS today have revealed that the total number of deaths across the county currently stands at 418, up from 408 by ten in 24… [+936 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By James Wood For Mailonline", "title": "New figures show number of people visiting UK's A&E wards down by half this month - Daily Mail", "description": "Health officials are worried many people are not seeking treatment because they fear contracting Covid-19, thereby jeopardising their survival and potentially becoming collateral damage.", "url": "https://www.dailymail.co.uk/news/article-8256237/New-figures-number-people-visiting-UKs-E-wards-half-month.html", "urlToImage": null, "publishedAt": "2020-04-25T13:13:17Z", "content": "The NHS is launching a new campaign to make sure people seek urgent care during a medical emergency after visits to A&amp;E dropped by almost 50 per cent this month.\r\nHealth officials are worried many people are not seeking treatment because they fear contrac… [+23379 chars]"}, {"source": {"id": null, "name": "Creativebloq.com"}, "author": "Rosie Hilder", "title": "Where to buy a face mask right now – plus how to make a face mask at home - Creative Bloq", "description": "Wondering where to buy a face mask? These retailers still have stock. Plus how to make your own.", "url": "https://www.creativebloq.com/news/where-to-buy-face-masks", "urlToImage": null, "publishedAt": "2020-04-25T13:01:17Z", "content": "If you want to know where to buy a face mask, you're in the right place. Face masks are selling out quickly around the world, so we've put together this list of online retailers that still have face masks in stock. \r\nBear in mind that the face masks in this a… [+6427 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Robots deliver shopping to NHS workers for free in Milton Keynes - The Sun", "description": "A fleet of robots on wheels have been delivering shopping to people in Milton Keynes as residents are stuck in doors due to the coronavirus lockdown. The fou...", "url": "https://www.youtube.com/watch?v=mHc-LQ1mfVk", "urlToImage": null, "publishedAt": "2020-04-25T12:44:53Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Chiara Fiorillo", "title": "UK troops 'given insect repellent' as part of 'enhanced' protection against coronavirus - Mirror Online", "description": "Soldiers will be issued with Citriodiol, which is said to kill types of coronaviruses. The company that produces the repellent is urging the government to support a formal testing programme", "url": "https://www.mirror.co.uk/news/uk-news/uk-troops-given-insect-repellent-21924978", "urlToImage": null, "publishedAt": "2020-04-25T12:25:36Z", "content": "British troops are being given an insect repellent as a new layer of protection against Covid-19, it has been reported.\r\nSoldiers will be issued with Citriodiol, which reportedly kills types of coronaviruses.\r\n A military source told Sky News that the repelle… [+2283 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus Explained: how the virus will hit the poorest people on the planet - Channel 4 News", "description": "The coronavirus pandemic is affecting the world, no matter who you are and where you come from. (Subscribe: https://bit.ly/C4_News_Subscribe) Covid-19 is dev...", "url": "https://www.youtube.com/watch?v=QorckhwMLR0", "urlToImage": null, "publishedAt": "2020-04-25T11:05:09Z", "content": "The coronavirus pandemic is affecting the world, no matter who you are and where you come from. (Subscribe: https://bit.ly/C4_News_Subscribe) \r\nCovid-19 is devastating countries across the globe, with some of the wealthiest nations struggling to contain the s… [+522 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Alessandra Scotto di Santolo", "title": "Expert reveals up to seven tests needed to get accurate coronavirus antibody results - Express", "description": "CORONAVIRUS tests may need up to seven takes to give accurate results on the development of antibodies in those who have already suffered from the deadly virus.", "url": "https://www.express.co.uk/news/uk/1273747/coronavirus-test-antibody-tests-covid-19-uk-latest-update", "urlToImage": null, "publishedAt": "2020-04-25T10:00:19Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Emer Scully For Mailonline", "title": "Italy's coronavirus outbreak began in January, study shows - Daily Mail", "description": "Italy was the first western country where the number of Covid-19 cases dramatically shot up, leading to 12,000 deaths by the end of March. A study shows Covid-19 was in Italy from January.", "url": "https://www.dailymail.co.uk/news/article-8255233/Italys-coronavirus-outbreak-began-January-study-shows.html", "urlToImage": null, "publishedAt": "2020-04-25T07:34:38Z", "content": "Coronavirus arrived in Italy in January 'for sure' - despite the first case not being diagnosed until the end of February, says a scientist who presented a study on the subject today.\r\nExpert Stefano Merler, of the Bruno Kessler Foundation, told a news confer… [+5356 chars]"}, {"source": {"id": null, "name": "Nottinghampost.com"}, "author": "Gemma Toulson", "title": "Coronavirus news updates: Government 'considering allowing people to see up to 10 others' - Nottinghamshire Live", "description": "'Please bear in mind this weekend that we are not yet seeing a reduction in the infection rate that could call for the current restrictions to be lifted'", "url": "https://www.nottinghampost.com/news/nottingham-news/coronavirus-news-updates-government-considering-4078160", "urlToImage": null, "publishedAt": "2020-04-25T06:02:51Z", "content": "Proposals are being considered by the Government which could allow people to meet up with 10 of their closest family and friends as part of plans to ease lockdown restrictions.\r\nReports suggest the Government is considering allowing small groups to cluster to… [+1486 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "Www.gov.uk"}, "author": "Department of Health and Social Care", "title": "Clinical trial approved to help the NHS treat COVID-19 patients using plasma - GOV.UK", "description": "If effective, a national programme will deliver up to 10,000 units of plasma a week to the NHS to help treat coronavirus (COVID-19) patients.", "url": "https://www.gov.uk/government/news/clinical-trial-approved-to-help-the-nhs-treat-covid-19-patients-using-plasma", "urlToImage": null, "publishedAt": "2020-04-24T23:20:34Z", "content": "<ul><li>A clinical trial has been given approval to determine if plasma donated by patients who have recovered from COVID-19 can help those battling the illness</li><li>If effective, a scaled-up national programme will deliver up to 10,000 units of convalesce… [+5284 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "The most promising strategies for defeating coronavirus: A review study - Science Daily", "description": "Experts from UNC Chapel Hill review possible clinical approaches from antivirals to gene therapy against the virus responsible for COVID-19 and related diseases.", "url": "https://www.sciencedaily.com/releases/2020/04/200424081706.htm", "urlToImage": null, "publishedAt": "2020-04-24T20:35:32Z", "content": "In an unprecedented effort, hundreds of thousands of researchers and clinicians worldwide are locked in a race against time to develop cures, vaccines, and better diagnostic tests for COVID-19, the illness caused by the virus SARS-CoV-2.Over 1,650 articles on… [+4617 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Nazia Parveen", "title": "New mother dies of coronavirus six days after giving birth - The Guardian", "description": "Fozia Hanif developed symptoms before her 29th birthday, resulting in premature birth of her son, Ayaan", "url": "https://www.theguardian.com/world/2020/apr/24/new-mother-dies-of-coronavirus-six-days-after-giving-birth", "urlToImage": null, "publishedAt": "2020-04-24T19:31:43Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Betsi death report delay sparks investigation - BBC South East Wales", "description": "The north Wales health board reported all its deaths at once after issues with reporting systems.", "url": "https://www.bbc.co.uk/news/uk-wales-52419068", "urlToImage": null, "publishedAt": "2020-04-24T19:23:29Z", "content": "Image copyrightGetty ImagesImage caption\r\n Betsi Cadwaladr health board reported 84 deaths in the north Wales area on Thursday\r\nThe recording of the number of people who have died with coronavirus is being investigated after a Welsh health board failed to rep… [+2468 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Paralysed Ed Jackson reaches Everest staircase feat - BBC News", "description": "Former rugby player Ed Jackson has climbed 89,056 steps and made 2,783 trips up and down the stairs.", "url": "https://www.bbc.com/news/uk-england-somerset-52416450", "urlToImage": null, "publishedAt": "2020-04-24T19:09:39Z", "content": "Image copyrightWings for Life Image caption\r\n To simulate the ascent of Everest's 8,848m peak, Ed Jackson climbed 89,056 steps\r\nA paralysed ex-rugby player has climbed the equivalent height of Mount Everest on his parents' staircase.\r\nEd Jackson, from Bath, b… [+1708 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Lizzy Buchan", "title": "Government was warned last year that it needed an action plan to deal with a pandemic - The Independent", "description": "Labour brands revelations 'alarming' and calls for Michael Gove to be hauled before MPs", "url": "https://www.independent.co.uk/news/uk/politics/coronavirus-government-warned-pandemic-action-plan-cabinet-office-a9483291.html", "urlToImage": null, "publishedAt": "2020-04-24T19:02:04Z", "content": "The government was warned last year that it needed an action plan to deal with a coronavirus-style pandemic, according to a leaked Cabinet Office report.\r\nThe 600-page National Security Risk Assessment (NRSA) reportedly warned that a new pandemic virus could … [+7569 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Stephen Matthews Health Editor For Mailonline Sam Blanchard Senior Health Reporter For Mailonline", "title": "NHS to release plan next week to 'redeploy coronavirus capacity' - Daily Mail", "description": "NHS bosses are keen to get operating theatres back up and running and to return to business as usual for non-coronavirus patients who may have been missing out on treatment for weeks.", "url": "https://www.dailymail.co.uk/news/article-8254393/NHS-release-plan-week-redeploy-coronavirus-capacity.html", "urlToImage": null, "publishedAt": "2020-04-24T18:35:52Z", "content": "NHS hospitals could restart routine operations as soon as next week as the health service prepares plans to get back on its feet as the coronavirus crisis blows over. \r\nPrivate hospitals have laid empty in the past week and up to 40,000 NHS beds are thought t… [+9807 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Damian Carrington", "title": "Coronavirus detected on particles of air pollution - The Guardian", "description": "Exclusive: Scientists examine whether this route may enable infections at longer distances", "url": "https://www.theguardian.com/environment/2020/apr/24/coronavirus-detected-particles-air-pollution", "urlToImage": null, "publishedAt": "2020-04-24T18:12:43Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Nicola Bartlett", "title": "Coronavirus hit to the economy could cause more deaths, chief medic warns - Mirror Online", "description": "Professor Chris Whitty also revealed that 90% of people in the UK had not yet contracted the virus", "url": "https://www.mirror.co.uk/news/politics/coronavirus-hit-economy-could-cause-21923232", "urlToImage": null, "publishedAt": "2020-04-24T18:03:21Z", "content": "The Chief Medical Officer has warned that the health of the UK population will suffer if there is an increase in deprivation as a result of a prolonged economic downturn.\r\nProfessor Chris Whitty told Westminster's Science and Technology Committee about severa… [+5111 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Les Steed", "title": "How does key worker testing work and what time can I apply for a coronavirus test? - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11469520/key-worker-coronavirus-testing-how-what-time/", "urlToImage": null, "publishedAt": "2020-04-24T17:35:15Z", "content": "MATT HANCOCK announced that testing can now be provided for up to seven million key workers and emergency staff.\r\nHere's how to get tested if you are an essential worker who believes that you or a household member has coronavirus.\r\n Matt Hancock said key work… [+6641 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Tech Tent: Are apps the way to lift the lockdown? - BBC News", "description": "Should we be more relaxed about government surveillance, if it helps combat the coronavirus?", "url": "https://www.bbc.com/news/technology-52415020", "urlToImage": null, "publishedAt": "2020-04-24T16:34:52Z", "content": "Image copyrightGetty Images\r\nShould we be more relaxed about government surveillance, if it helps combat the coronavirus? \r\nOn this week's Tech Tent podcast, we look at the arguments that have surfaced in recent days over just how much information contact-tra… [+3704 chars]"}, {"source": {"id": null, "name": "Northwichguardian.co.uk"}, "author": "Northwich Guardian Staff", "title": "At least 7 coronavirus-related deaths in Cheshire West and Chester not captured in official data - Northwich Guardian", "description": "AT LEAST seven deaths linked to coronavirus in Cheshire West and Chester may not be captured in official estimates, new figures suggest.", "url": "https://www.northwichguardian.co.uk/news/18404523.least-7-coronavirus-related-deaths-cheshire-west-chester-not-captured-official-data/", "urlToImage": null, "publishedAt": "2020-04-24T16:20:00Z", "content": "AT LEAST seven deaths linked to coronavirus in Cheshire West and Chester may not be captured in official estimates, new figures suggest.\r\nShadow social care minister Liz Kendall has called on the Government to publish daily figures of Covid-19 deaths outside … [+2180 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Sathnam Sanghera", "title": "Coronavirus and ethnicity: black and Asian NHS medics on the front line - The Times", "description": "My last significant social engagement before the coronavirus lockdown was a school reunion dinner. For the first time since I left Wolverhampton Grammar School 25 years ago, initially for a grim", "url": "https://www.thetimes.co.uk/article/coronavirus-and-ethnicity-black-and-asian-nhs-medics-on-the-front-line-dhznrc3kc", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "My last significant social engagement before the coronavirus lockdown was a school reunion dinner. For the first time since I left Wolverhampton Grammar School 25 years ago, initially for a grim summer job in a local hospital laundry, and then Cambridge Unive… [+451 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Sian Elvin", "title": "Coronavirus UK: 'Amazing' doctor who loved caring for babies dies - Metro.co.uk", "description": "'He treated every patient and family he cared for as his own. I couldn't have been prouder of him.'", "url": "https://metro.co.uk/2020/04/24/three-nhs-doctors-12605725/", "urlToImage": null, "publishedAt": "2020-04-24T15:52:10Z", "content": "Dr Vishna Rasiah, who has been described as talented, dedicated and respected, has died after contracting Covid-19 (Picture: PA)\r\nA talented, dedicated and respected doctor has died after contracting coronavirus.\r\nDr Vishna Rasiah, who worked at Birmingham Wo… [+2320 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Tim Stickings For Mailonline Rory Butler For Mailonline", "title": "Sweden sees record number of coronavirus infections for second day in a row - 812 - Daily Mail", "description": "Sweden has reported a record number of new coronavirus cases for the second day in a row - 812 - just as the country threatens to close bars and restaurants that don't social distance.", "url": "https://www.dailymail.co.uk/news/article-8252553/Swedish-expert-says-coronavirus-lockdown-not-saved-lives.html", "urlToImage": null, "publishedAt": "2020-04-24T15:47:23Z", "content": "Sweden has reported a record number of new coronavirus infections for the second day in a row - just as the country threatens to close bars and restaurants that do not follow social distancing measures.\r\nSweden posted a record 812 new Covid-19 cases today, ad… [+8076 chars]"}, {"source": {"id": null, "name": "Shropshirestar.com"}, "author": "Dominic Robertson", "title": "Four more coronavirus deaths confirmed in Shropshire as UK death toll passes 19000 - shropshirestar.com", "description": "A further four people have been confirmed to have died with coronavirus in Shropshire.", "url": "https://www.shropshirestar.com/news/health/coronavirus-covid19/2020/04/24/four-more-coronavirus-deaths-confirmed-in-county/", "urlToImage": null, "publishedAt": "2020-04-24T13:35:00Z", "content": "All four patients were in the care of Shrewsbury &amp; Telford Hospital NHS Trust (SaTH) and died after testing positive for Covid-19, NHS England confirmed today. \r\nIt takes the total who have now died at the trust, which manages Royal Shrewsbury Hospital an… [+1529 chars]"}, {"source": {"id": null, "name": "Cravenherald.co.uk"}, "author": "Lesley Tate", "title": "Driving to Craven to climb the Yorkshire Three Peaks 'is not essential travel' - North Yorkshire Police - Craven Herald", "description": "WITH Craven expected to have good weather this weekend, police have stressed once again the importance of staying home.", "url": "https://www.cravenherald.co.uk/news/18403762.driving-craven-climb-yorkshire-three-peaks-is-not-essential-travel---north-yorkshire-police/", "urlToImage": null, "publishedAt": "2020-04-24T13:28:00Z", "content": "WITH Craven expected to have good weather this weekend, police have stressed once again the importance of staying home.\r\nPolice say they have seen an increase in the number of people making unnecessary journeys and heading to the Dales - such as Malham - for … [+3855 chars]"}, {"source": {"id": null, "name": "Pulsetoday.co.uk"}, "author": null, "title": "GPs should contact all shielded patients as a 'follow-up' to letter, says NHS - Pulse", "description": "Practices should contact all of their patients who are shielding from coronavirus (Covid-19) as a 'follow-up' to the NHS letter notifying them to stay at home for 12 weeks, NHS England has said.", "url": "http://www.pulsetoday.co.uk/clinical/clinical-specialties/respiratory-/gps-should-contact-all-shielded-patients-as-a-follow-up-to-letter-says-nhs/20040685.article", "urlToImage": null, "publishedAt": "2020-04-24T13:18:45Z", "content": "Practices should contact all of their patients who are shielding from coronavirus (Covid-19) as a 'follow-up' to the NHS letter notifying them to stay at home for 12 weeks, NHS England has said.\r\nDuring this follow-up conversation, GPs should discuss what shi… [+3708 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Anna Lewis", "title": "Four cemeteries in Cardiff to reopen - Wales Online", "description": "The sites will be monitored by council staff with the support of South Wales Police", "url": "https://www.walesonline.co.uk/news/wales-news/cemeteries-cardiff-open-coronavirus-cathays-18144366", "urlToImage": null, "publishedAt": "2020-04-24T13:07:26Z", "content": "Four cemeteries will be re-opened in Cardiff after being shut at the start of the month.\r\nCathays, Western, Thornhill and Pantmawr Cemeteries will be accessible to the public from Saturday for those attending funerals and visiting graves.\r\nThe sites were orig… [+2462 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Sophie McCoid, Sonia Sharma", "title": "Exhausted mum 'named and shamed' for not clapping for carers - Liverpool Echo", "description": "The mum said she was called out on a community Facebook group", "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/exhausted-mum-named-shamed-not-18144048", "urlToImage": null, "publishedAt": "2020-04-24T11:23:11Z", "content": "A tired mum has been left upset after she was named and shamed on Facebook for not joining in with the weekly 'Clap for Carers' event. \r\nEvery Thursday night at 8pm people across the UK have been clapping outside their homes or from their windows in recogniti… [+2077 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Richard Hartley-Parkinson", "title": "Hairdressers may not open for another six months so get used to 'Captain Caveman' look - Metro.co.uk", "description": "Barber shops and hair salons won't be able to open until it is safe to do so - that may not be until the end of the year.", "url": "https://metro.co.uk/2020/04/24/hairdressers-may-not-open-another-six-months-get-used-captain-caveman-look-12604007/", "urlToImage": null, "publishedAt": "2020-04-24T10:39:15Z", "content": "A sign of things to come? Barbers in Wuhan cut the hair of medical workers (Picture: Rex Shutterstock)\r\nYour roots may be longer than your preferred hair colour and were going to have to get used to looking like Captain Caveman as hairdressers may not open fo… [+4548 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Rob Powell, political correspondent, and Greg Heffer, political reporter", "title": "Coronavirus test applications closed after 5,000 home kits ordered in two minutes - Sky News", "description": "Downing Street reveals that 5,000 home-testing kits were ordered within two minutes of the new website opening.", "url": "https://news.sky.com/story/coronavirus-online-applications-for-covid-19-tests-temporarily-closed-due-to-huge-demand-11978070", "urlToImage": null, "publishedAt": "2020-04-24T10:11:24Z", "content": null}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Staff devastated as 15 residents of the same nursing home die in the space of a month - ITV News", "description": "Staff at a nursing home in Newport have been left devastated following the\ndeaths of 15 residents in the space of a month.\n\nFourteen of the elderly residents at Tregwilym Lodge in Rogerstone were showing symptoms of coronavirus before they died, although test…", "url": "https://www.itv.com/news/wales/2020-04-24/fifteen-nursing-home-residents-die-in-the-space-of-a-month/", "urlToImage": null, "publishedAt": "2020-04-24T09:44:00Z", "content": "Staff at a nursing home in Newport have been left devastated following the\r\ndeaths of 15 residents in the space of a month.\r\nFourteen of the elderly residents at Tregwilym Lodge in Rogerstone were showing symptoms of coronavirus before they died, although tes… [+1796 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nAnnelies Gartner", "title": "How close are we to a coronavirus vaccine - and when will trials begin? - Telegraph.co.uk", "description": "Latest news on the search for a vaccine against the new coronavirus", "url": "https://www.telegraph.co.uk/global-health/science-and-disease/coronavirus-vaccine-trials-start-covid-19-latest-update/", "urlToImage": null, "publishedAt": "2020-04-24T08:57:32Z", "content": "As Covid-19 has rapidly spread around the world there has been a mad scramble to find a vaccine. \r\nIn the UK a potential coronavirus vaccine being developed at the University of Oxford will begin human trials from Thursday, Matt Hancock, the Health Secretary,… [+1550 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Coronavirus: 'Too soon' to end lockdown but health secretary 'comfortable' with some businesses reopening - Sky News", "description": "", "url": "https://news.sky.com/story/coronavirus-too-soon-to-end-lockdown-but-health-secretary-comfortable-with-building-sites-reopening-11977971", "urlToImage": null, "publishedAt": "2020-04-24T07:04:48Z", "content": null}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nLizzie Roberts", "title": "Contact tracing: how has it worked for other countries, and could it really help ease UK lockdown? - The Telegraph", "description": "From teams of 'corona detectives' to Army cadets making thousands of calls a day, countries are tracking the spread of Covid-19", "url": "https://www.telegraph.co.uk/news/2020/04/25/what-contact-tracing-how-work-countries-uk-lockdown/", "urlToImage": null, "publishedAt": "2020-04-24T06:57:00Z", "content": "Countries around the world are rushing to launch contact tracing apps to identify who an infected person has had contact with, as part of efforts to slow the spread of the coronavirus. \r\nThe UK Government has announced the infrastructure was being put in plac… [+1754 chars]"}, {"source": {"id": null, "name": "Refinery29.com"}, "author": "Molly Longman", "title": "A Second Wave Of Coronavirus Could Hit This Year - Refinery29", "description": "The Spanish flu of 1918 hit in waves, the second of which was most deadly.", "url": "https://www.refinery29.com/en-gb/2020/04/9734359/coronavirus-second-wave-cdc-warning-flu-season", "urlToImage": null, "publishedAt": "2020-04-24T06:15:00Z", "content": "Skip navigation!\r\nNow ReadingA Second Wave Of Coronavirus Could Hit This Year\r\n\"There's a possibility that the assault of the virus on our nation next winter will actually be even more difficult than the one we just went through,\" Robert Redfield, director of… [+4340 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "BBC News", "title": "What is contact tracing and how does it work? - BBC News", "description": "When lockdown ends, contact tracing could help limit the spread of coronavirus.", "url": "https://www.bbc.co.uk/news/av/technology-52401049/coronavirus-what-is-contact-tracing-and-how-does-it-work", "urlToImage": null, "publishedAt": "2020-04-24T05:54:19Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Lucy Jones", "title": "Rare coronavirus symptom dubbed Covid toes is mostly seen in kids, docs discover - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11455294/rare-coronavirus-symptom-covid-toes-kids/", "urlToImage": null, "publishedAt": "2020-04-22T18:51:04Z", "content": "A RARE new symptom of coronavirus dubbed 'Covid toes' is mainly seen in kids, doctors say.\r\nMedics treating Covid-19 patients have reported seeing unusual cases where people have developed blisters and purple lesions on their feet.\r\n The purple lesions are ve… [+5169 chars]"}]}