{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nSarah Knapton,", "title": "Why a second coronavirus wave is on the horizon, and what that means for the UK's exit strategy - Telegraph.co.uk", "description": "Whilst Health Secretary has said UK is at virus peak, there are concerns about deadly second wave of Covid-19", "url": "https://www.telegraph.co.uk/news/2020/04/26/what-second-coronavirus-wave-peak-means-lockdown-uk-exit-strategy/", "urlToImage": null, "publishedAt": "2020-04-26T10:30:00Z", "content": "\"We must assume and prepare for the fact that this is not a discrete one-off episode,\" he said. \"My belief is that this is now an endemic human infection. It is likely that this is here with the human race for the future. We're going to have to find ways to d… [+3116 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Alahna Kindred", "title": "Coronavirus patients suffering ‘nasty red rash’ before Covid-19 symptoms - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11482938/coronavirus-symptoms-rash/", "urlToImage": null, "publishedAt": "2020-04-26T09:56:39Z", "content": "A RED rash could be another symptom of coronavirus, experts have warned.\r\nData from Italy suggests as many as one in five people who are hospitalised with the killer bug may develop rashes or unexplained marks on their skin.\r\n Scientists are still trying to u… [+3944 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Katrina Turrill", "title": "Coronavirus warning - how likely are you to die from COVID-19? Doctor reveals your risk - Express", "description": "CORONAVIRUS tends to be just a mild infection for most people, but for some, the virus can result in hospital admission and prove life-threatening. How likely are you to die from COVID-19?", "url": "https://www.express.co.uk/life-style/health/1273982/coronavirus-cases-deaths-symptoms-stats-covid-19", "urlToImage": null, "publishedAt": "2020-04-26T09:19:52Z", "content": "She writes: “A model-based analysis of the widely varying statistics on death rates for coronavirus, based on figures from 37 countries, suggests that even among people with more severe disease, the 'case fatality' ratio (the proportion of people with confirm… [+810 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Melanie Hancill", "title": "Vitamin D tips and 12 other ways of keeping bones healthy in coronavirus lockdown - Mirror Online", "description": "Exercise and diet play a huge role in how healthy our bones stay as we get older – so at a time when we are more sedentary than ever, here’s how to keep moving", "url": "https://www.mirror.co.uk/lifestyle/health/thirteen-secrets-keeping-your-bones-21907317", "urlToImage": null, "publishedAt": "2020-04-26T08:59:08Z", "content": "We might be cooped up indoors, but it shouldnt be an excuse to sit around all day as tempting as that is.\r\nStaying active helps to keep bones strong and healthy, says osteopath Jess Roberts, founder of Unity-wellness.com.\r\nIn fact, research suggests that walk… [+4880 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Dean Dunham", "title": "What not to do during the Covid-19 pandemic as Brits make costly mistakes - Mirror Online", "description": "Consumer lawyer Dean Dunham lays bare the costly mistakes more and more Brits are making in an attempt to save themselves some money during the coronavirus pandemic", "url": "https://www.mirror.co.uk/money/what-not-during-covid-19-21921457", "urlToImage": null, "publishedAt": "2020-04-26T08:05:32Z", "content": "My inbox is dominated at the moment by readers battling with Covid-19 issues and the lockdown.\r\nIve been able to advise and help many of you but there have also been those where bad, and in some cases costly, decisions were made.\r\nSo I am concentrating this w… [+2037 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Jon Coates", "title": "Tragic nurse who hadn't seen his family in five years is latest Covid-19 victim - Express", "description": "A NURSE who had not seen his family in the Philippines for five years is among the latest victims of Covid-19.", "url": "https://www.express.co.uk/news/uk/1273958/coronavirus-nurse-dead-london-hospital", "urlToImage": null, "publishedAt": "2020-04-26T07:45:40Z", "content": null}, {"source": {"id": null, "name": "Theguardian.comuk-news"}, "author": "Jamie Doward", "title": "If ministers fail to reveal 2016 flu study they ‘will face court’ - The Guardian", "description": "Doctor’s threat over results of three-day simulation exercise that were ‘too terrifying’ to be made public", "url": "https://amp.theguardian.comuk-news/2020/apr/26/doctor-sue-results-operation-cygnus", "urlToImage": null, "publishedAt": "2020-04-26T06:24:41Z", "content": "The government faces being taken to court if it refuses to disclose the findings of an exercise confirming the UK could not cope with a flu pandemic.\r\nDr Moosa Qureshi, an NHS doctor, is demanding the government publish its report into Exercise Cygnus, a thre… [+2395 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Emma Graham-Harrison, Philip Oltermann, Sam Jones", "title": "Coronavirus face masks: why covering up is becoming the new normal - The Guardian", "description": "Even western countries are starting to accept that shielding our faces could save lives … whether you live in New York or Berlin", "url": "https://www.theguardian.com/world/2020/apr/26/coronavirus-face-masks-why-covering-up-is-becoming-the-new-normal", "urlToImage": null, "publishedAt": "2020-04-26T06:24:34Z", "content": "When coronavirus emerged in China, people across much of the region were quick to start wearing some form of face mask when they went out in public. Memories of the Sars epidemic were still strong, and there is a cultural tradition of wearing masks to protect… [+5674 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Katrina Turrill", "title": "Coronavirus symptoms: Heartbroken son reveals mum’s first symptom before her death - Express", "description": "CORONAVIRUS symptoms have been shown to differ from person to person - while symptoms in some people appear mild, in others they present as more severe. A son has now spoken of his mum's first symptom before her death.", "url": "https://www.express.co.uk/life-style/health/1273717/coronavirus-symptoms-cases-death-feeling-unwell-cough", "urlToImage": null, "publishedAt": "2020-04-26T06:17:24Z", "content": "Graeme Anderson, 36, has described his mum’s first symptoms before her untimely death from COVID-19.\r\nSpeaking to Liverpool Echo, he explained his mum, June, had self-isolated for two weeks after a neighbour by her home tested positive for the disease.\r\nBut s… [+264 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Record Reporter", "title": "Tons of PPE left at Prestwick Airport after boxes arrived without labels - Daily Record", "description": "NHS officials have been left scrambling to confirm what exactly is in the 90-ton consignment from China.", "url": "https://www.dailyrecord.co.uk/news/scottish-news/coronavirus-mislabeling-sparks-confusion-over-21927588", "urlToImage": null, "publishedAt": "2020-04-26T05:09:46Z", "content": "Tons of PPE was left at Prestwick Airport after boxes full of supplies arrived without labels.\r\nNHS officials have been left scrambling to confirm what exactly is in the 90-ton consignment from China.\r\nThere are fears it could lead to delays arming front line… [+823 chars]"}, {"source": {"id": null, "name": "Kentonline.co.uk"}, "author": "Sam Williams", "title": "A look back at the worse pandemics in history - Kent Online", "description": "With Covid-19 raging through the country, we take a look at some of the other pandemics through history that have changed the world.", "url": "https://www.kentonline.co.uk/kent/news/a-look-back-at-the-worst-pandemics-in-history-226232/", "urlToImage": null, "publishedAt": "2020-04-26T05:00:00Z", "content": "Worldwide, more than 170,000 people have now died of the novel coronavirus known as Covid-19.\r\nBelieved to have originated in China, the deadly disease has quickly spread across the globe, resulting in many countries entering a strict lockdown period in an at… [+10686 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: US and China trade conspiracy theories - BBC News", "description": "Conspiracy theories about Covid-19 have been spreading online since the early days of the outbreak.", "url": "https://www.bbc.co.uk/news/world-52224331", "urlToImage": null, "publishedAt": "2020-04-26T04:49:04Z", "content": "Image caption\r\n Speculation about the origin of the virus has been rife online\r\nFrom the early stages of the coronavirus outbreak, conspiracy theories about the origin and scale of the disease were spread on online platforms. \r\nAmong these were the false clai… [+6717 chars]"}, {"source": {"id": null, "name": "Theboltonnews.co.uk"}, "author": "The Bolton News Staff", "title": "New app hopes to help highlight 'coronavirus hotspots' - The Bolton News", "description": "A new app is hoping to highlight areas which may be 'hotspots' for coronavirus.", "url": "https://www.theboltonnews.co.uk/news/18404035.new-app-hopes-help-highlight-coronavirus-hotspots/", "urlToImage": null, "publishedAt": "2020-04-26T04:00:00Z", "content": "The ‘COVID-19 Tracker’ encourages users to report their health condition daily, which helps experts identify spikes in coronavirus symptoms across the UK.\r\n2592 people in Bolton have already submitted their condition to help the team.\r\nLead researcher Profess… [+1191 chars]"}, {"source": {"id": null, "name": "Shieldsgazette.com"}, "author": "Debra Fox", "title": "South Tyneside's coronavirus cases stand at 464 as 16 more patients die under care of borough's hospital trust - Shields Gazette", "description": "Another 16 patients have lost their lives after testing positive for coronavirus at the hospital trust which serves South Tyneside, according to the latest data from NHS England.", "url": "https://www.shieldsgazette.com/health/coronavirus/south-tynesides-coronavirus-cases-stand-464-16-more-patients-die-under-care-boroughs-hospital-trust-2498479", "urlToImage": null, "publishedAt": "2020-04-26T03:41:16Z", "content": "The figures show 242 people have died in hospitals covered by South Tyneside and Sunderland NHS Foundation Trust as of Saturday, April 25.\r\nIn total, 905 people who had tested positive for coronavirus have died across the North Easts hospital trusts.\r\nForty-t… [+3429 chars]"}, {"source": {"id": null, "name": "Sunderlandecho.com"}, "author": "Kevin Clark", "title": "Live updates: North East coronavirus cases rise to 6,772 as UK death toll passes 20,000 - Sunderland Echo", "description": "Good morning on Sunday, April 26. It’s Kevin here bringing you the latest updates from across the North East and UK.", "url": "https://www.sunderlandecho.com/health/coronavirus/live-updates-shadow-minister-questions-whether-government-was-too-slow-over-lockdown-2505131", "urlToImage": null, "publishedAt": "2020-04-26T03:12:18Z", "content": "We'll be bringing you the latest on the coronavirus situation throughout the day.\r\nShadow minister for mental health Dr Rosena Allin-Khan (pictured) has questioned how many families would be grieving the loss of loved ones if lockdown had been enforced sooner… [+2067 chars]"}, {"source": {"id": null, "name": "Watfordobserver.co.uk"}, "author": "Nathan Louis", "title": "Coronavirus updates from Hertfordshire and UK recap - Watford Observer", "description": "Welcome to our live blog recap from across Hertfordshire and the UK.", "url": "https://www.watfordobserver.co.uk/news/18405405.coronavirus-updates-hertfordshire-uk-recap/", "urlToImage": null, "publishedAt": "2020-04-26T03:00:11Z", "content": "©Copyright 2001-2020. This site is part of Newsquest's audited local newspaper network. A Gannett Company. Newsquest Media Group Ltd, Loudwater Mill, Station Road, High Wycombe, Buckinghamshire. HP10 9TY | 01676637 | Registered in England &amp; Wales."}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Matthew Davis For Mail On Sunday", "title": "Five people admitted to A&E after being attacked by crocodiles... in England, NHS figures reveal - Daily Mail", "description": "An analysis of hospital admissions in England reveals medics have had to deal with everything from alligator bites to scorpion stings - and even illness brought on by simulated space flight.", "url": "https://www.dailymail.co.uk/news/article-8257325/Five-people-admitted-E-attacked-crocodiles-England-NHS-figures-reveal.html", "urlToImage": null, "publishedAt": "2020-04-26T02:44:27Z", "content": "There's never a dull moment for the staff of Englands A&amp;E hospitals. But even they must be shocked when cases turn up that look more suited to the tropics.\r\nAn analysis of admissions reveals medics have had to deal with everything from alligator bites to … [+2082 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Seamus Duff", "title": "Terminally ill ex-CBBC star fears she won't live to see family due to lockdown - Mirror Online", "description": "Chelsie Whibley, 28, suffers from cystic fibrosis and is isolating indefinitely while the coronavirus pandemic continues and fears she is losing precious time to spend with her family", "url": "https://www.mirror.co.uk/3am/celebrity-news/terminally-ill-ex-cbbc-star-21927795", "urlToImage": null, "publishedAt": "2020-04-26T01:56:02Z", "content": "Former CBBC star Chelsie Whibley fears she might not live to see her family again as she battles a terminal illness during the coronavirus pandemic. \r\n The 28-year-old former actress suffers from cystic fibrosis a condition that causes sticky mucus to build u… [+2949 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Neville Lazarus", "title": "Coronavirus: Millions in India facing hunger during COVID-19 lockdown measures - Sky News", "description": "The World Food Programme has said the coronavirus outbreak could cause \"multiple famines of biblical proportions\".", "url": "https://news.sky.com/story/coronavirus-millions-of-indians-facing-hunger-during-covid-19-lockdown-measures-11978857", "urlToImage": null, "publishedAt": "2020-04-26T01:20:13Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Evgeny Lebedev For The Mail On Sunday", "title": "Shocking picture of bats for sale in Indonesia shows wet markets are still open - Daily Mail", "description": "Since I have begun to write on the urgent need to close live animal markets, I have been surprised by the support I have received from across the UK.", "url": "https://www.dailymail.co.uk/news/article-8257375/Shocking-picture-bats-sale-Indonesia-shows-wet-markets-open.html", "urlToImage": null, "publishedAt": "2020-04-26T00:56:23Z", "content": "Since I have begun to write on the urgent need to close live animal markets, I have been surprised by the support I have received from across the UK. \r\nReaders of The Mail on Sunday have written to say how strongly they agree about the threat of contagion the… [+3244 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: 'Going to buy drugs' among lockdown breach excuses - BBC News", "description": "Police reveal the random and bizarre reasons given by people flouting the \"stay at home\" rules.", "url": "https://www.bbc.co.uk/news/uk-wales-52386123", "urlToImage": null, "publishedAt": "2020-04-25T23:36:34Z", "content": "Image copyrightGetty ImagesImage caption\r\n Police have urged the public to follow the lockdown rules and stay home\r\nTrying out a new catapult, taking a quad bike for a \"walk\" and buying drugs are just some of the random excuses people have used for breaking c… [+4790 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Christy Cooney", "title": "UK removes China from official coronavirus deaths comparison after ‘cover-up’ claims and disbelief at low fig - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11481397/uk-removes-china-official-coronavirus-deaths-cover-up/", "urlToImage": null, "publishedAt": "2020-04-25T23:30:19Z", "content": "THE government has removed China from graphs it uses to compare the UK's coronavirus deaths to those elsewhere amid accusations the country has covered up the true impact of the pandemic.   \r\nThe official toll in China, where the virus first broke out in Dece… [+2351 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Alex Woodward", "title": "Coronavirus: 'No evidence' recovered patients are immune to re-infection, warns WHO - The Independent", "description": "World Health Organisation does not recommend governments issue 'immunity passports' as countries look to 'reopen' amid pandemic", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-immunity-passports-antibody-tests-world-health-organisation-a9484261.html", "urlToImage": null, "publishedAt": "2020-04-25T23:11:26Z", "content": "The World Health Organisation says there is no evidence that people who have recovered from coronavirus and have antibodies are protected against a second infection.\r\nIn a scientific brief published on Saturday, the United Nations agency warned against countr… [+2673 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: The father of 13 self isolating with Covid-19 - BBC News", "description": "The Hann family have found lockdown a struggle but say they feel \"privileged\" as they pull together.", "url": "https://www.bbc.com/news/uk-scotland-tayside-central-52426962", "urlToImage": null, "publishedAt": "2020-04-25T23:05:02Z", "content": "Image copyrightLesley MartinImage caption\r\n The father of one of Scotland's largest families - Roy Hann - has tested positive for Covid-19\r\nWhen lockdown measures were first announced, Roy and Emma Hann gave their children strict routines and organised family… [+3801 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Rosamund Urwin, Andrew Gregory and Caroline Wheeler", "title": "Coronavirus: NHS will fall short of 1bn items of protective gear, review reveals - The Times", "description": "The UK will be short of up to a billion items of personal protective equipment (PPE), according to a secret forecast commissioned by the government that will heap pressure on the health secretary", "url": "https://www.thetimes.co.uk/article/surgical-gowns-almost-gone-send-boiler-suits-plead-nhs-bosses-nk25sfsx7", "urlToImage": null, "publishedAt": "2020-04-25T23:01:00Z", "content": "The UK will be short of up to a billion items of personal protective equipment (PPE), according to a secret forecast commissioned by the government that will heap pressure on the health secretary, Matt Hancock.\r\nThe predictions of severe shortages were set ou… [+501 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Andrew Gregory and Sian Griffiths", "title": "Take more coronavirus patients to hospital, paramedics told - The Times", "description": "The NHS in London has altered its official guidance to lower the threshold at which paramedics take suspected coronavirus patients to hospital.London Ambulance Service (LAS) has changed how it uses a", "url": "https://www.thetimes.co.uk/article/take-more-coronavirus-patients-to-hospital-paramedics-told-jks756c63", "urlToImage": null, "publishedAt": "2020-04-25T23:01:00Z", "content": "The NHS in London has altered its official guidance to lower the threshold at which paramedics take suspected coronavirus patients to hospital.\r\nLondon Ambulance Service (LAS) has changed how it uses a scorecard called News2, which helps assess whether caller… [+547 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Peter Conradi, Europe Editor", "title": "Coronavirus: Rome set to ease lockdown, but Italy's engine room still stricken - The Times", "description": "A row of dozens of identical small white crosses has been erected in recent days at Milan’s giant Cimitero Maggiore for the victims of Covid-19 whose remains have yet to be claimed by relatives. There", "url": "https://www.thetimes.co.uk/article/coronavirus-rome-set-to-ease-lockdown-but-italys-engine-room-still-stricken-jbxcqd32t", "urlToImage": null, "publishedAt": "2020-04-25T23:00:00Z", "content": "A row of dozens of identical small white crosses has been erected in recent days at Milans giant Cimitero Maggiore for the victims of Covid-19 whose remains have yet to be claimed by relatives. There is space for 600 in what have been called Italys first war … [+467 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "UK doctor invents digital flashcards to help Covid-19 patients understand staff - The Guardian", "description": "Cardmedic overcomes communication barrier caused by healthcare staff wearing PPE", "url": "https://www.theguardian.com/world/2020/apr/25/uk-doctor-invents-digital-flashcards-to-help-covid-19-patients-understand-staff", "urlToImage": null, "publishedAt": "2020-04-25T21:50:36Z", "content": "A coronavirus patients terrifying hospital experience inspired an NHS doctor to create a flashcard system to improve communication with medical staff wearing face masks.\r\nAnaesthetist Rachael Grimaldi founded Cardmedic while on maternity leave after reading a… [+2712 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nTom Morgan", "title": "Coronavirus test for anyone traced to a known carrier - Telegraph.co.uk", "description": "The technology should eventually allow symptomless workers to return to their jobs quicker", "url": "https://www.telegraph.co.uk/news/2020/04/25/coronavirus-test-anyone-traced-known-carrier/", "urlToImage": null, "publishedAt": "2020-04-25T20:30:00Z", "content": "In the letter to public health agencies and local authorities, he says the app will work in unison with a call-based system for those without the technology.\r\nHe also refers to the Government's huge recruitment drive to carry out the extra testing. \"There wil… [+2492 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Peter Stubley", "title": "First credible evidence emerges of person being killed by meteor - The Independent", "description": "Researchers find official records documenting fatal strike in Iraq in 1888", "url": "https://www.independent.co.uk/news/science/meteor-man-death-first-person-killed-iraq-turkey-ottoman-empire-a9484231.html", "urlToImage": null, "publishedAt": "2020-04-25T20:00:42Z", "content": "The odds of being struck and killed by a meteorite are said to be as low as one in 250,000.\r\nThere has been no credible and well-documented evidence of any human being befalling this unfortunate fate.\r\nBut researchers now say they have found three separate of… [+16481 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nSteve Bird", "title": "Vaccine results could be set back by successful lockdown, professor warns - Telegraph.co.uk", "description": "As the first human tests for a Covid-19 vaccine begin, scientists warn that the success of the lockdown could slow down their analysis", "url": "https://www.telegraph.co.uk/news/2020/04/25/vaccine-results-could-set-back-successful-lockdown-professor/", "urlToImage": null, "publishedAt": "2020-04-25T20:00:00Z", "content": "Results from trials for a Covid-19 vaccine could be delayed due to the success of the lockdown in preventing the spread of coronavirus, the director of the Oxford Vaccine Group has said.\r\nSpeaking shortly after the first volunteers were injected as part of hu… [+3129 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Coronavirus: Government giving out mixed messages over lockdown, says Met Police Federation - Sky News", "description": "The association calls for \"clear and unambiguous laws, guidance and communication\" around what people \"can and can't do\".", "url": "https://news.sky.com/story/coronavirus-government-giving-out-mixed-messages-over-lockdown-says-met-police-federation-11978825", "urlToImage": null, "publishedAt": "2020-04-25T19:51:38Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Chanel Georgina", "title": "Type 2 diabetes symptoms: The sign to look for when you go to the toilet - Express", "description": "TYPE 2 diabetes needs to be diagnosed early. Otherwise, the condition can really have a negative impact on your health. What's the sign to look for when you go to the toilet?", "url": "https://www.express.co.uk/life-style/health/1273864/type-2-diabetes-symptoms-diarrhoea-constipation-nerve-damage", "urlToImage": null, "publishedAt": "2020-04-25T18:23:59Z", "content": "Type 2 diabetes is estimated to affect one in 15 people within the UK. How do you know if you've got it too? What's the sign to look for in the loo?\r\nFirst, what exactly is type 2 diabetes and what causes it?\r\nDiabetes UK explains how diabetes is a health con… [+1167 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Coronavirus: People with COVID-19 symptoms more than double number who tested postive, app shows - Sky News", "description": "The COVID symptom tracker has been downloaded by nearly 2.7 million people and is generating an \"unprecedented\" amount of data.", "url": "https://news.sky.com/story/coronavirus-people-with-covid-19-symptoms-more-than-double-number-who-tested-positive-app-shows-11978714", "urlToImage": null, "publishedAt": "2020-04-25T17:48:45Z", "content": null}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Alice Tidey", "title": "Coronavirus: France drastically limits sale of nicotine products - Euronews", "description": "The measure comes after a study found that \"nicotine may be suggested as a potential preventive agent against Covid-19 infection.\"", "url": "https://www.euronews.com/2020/04/25/coronavirus-france-drastically-limits-sale-of-nicotine-products", "urlToImage": null, "publishedAt": "2020-04-25T16:31:54Z", "content": "France severely curtailed the sale of nicotine products on Friday after a study suggested smokers may be less likely to contract COVID-19.\r\nThe decree, issued by the Ministry of Health, limits pharmacies from selling more than a one-month supply of any nicoti… [+1842 chars]"}, {"source": {"id": null, "name": "Shropshirestar.com"}, "author": "Deborah Hardiman", "title": "Eight more coronavirus deaths confirmed in Shropshire as UK death toll passes 20000 - shropshirestar.com", "description": "A further eight people have been confirmed to have died with coronavirus in Shropshire.", "url": "https://www.shropshirestar.com/news/health/coronavirus-covid19/2020/04/25/eight-more-coronavirus-deaths-confirmed-in-shropshire-as-uk-death-toll-passes-20000/", "urlToImage": null, "publishedAt": "2020-04-25T14:37:00Z", "content": "Seven patients were in the care of Shrewsbury &amp; Telford Hospital NHS Trust (SaTH) and died after testing positive for Covid-19, while one patient was in the care of the Robert Jones and Agnes Hunt Orthopaedic Hospital near Oswestry, NHS England confirmed … [+1743 chars]"}, {"source": {"id": null, "name": "Dailypost.co.uk"}, "author": "Ben Mitchell, Press Association, Marc Waddington-NW", "title": "Identical twin sister nurses die days apart after contracting coronavirus - Daily Post", "description": "Katy and Emma Davies, from Southampton, died this week", "url": "https://www.dailypost.co.uk/news/uk-world-news/identical-twin-sister-nurses-die-18150611", "urlToImage": null, "publishedAt": "2020-04-25T14:31:10Z", "content": "Identical twin sister nurses both died after catching coronavirus.\r\nChildren's nurse Katy Davis, 37, died at Southampton General Hospital on Tuesday.\r\nHer sister Emma, a former surgery nurse, died early on Friday.\r\nBoth women had an underlying health conditio… [+1786 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: The 'good outcome' that never was - BBC News", "description": "The UK's official coronavirus death tally has passed 20,000. How can we grasp the scale of such a loss?", "url": "https://www.bbc.co.uk/news/stories-52419218", "urlToImage": null, "publishedAt": "2020-04-25T14:24:59Z", "content": "Image copyrightGetty Images\r\nThe UK's official tally of coronavirus-related deaths has passed 20,000 - a figure the chief scientist once said would represent a \"good outcome\". It's a huge number and hard to visualise. How can we grasp the scale of this loss?\r… [+6775 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Northern Ireland's coronavirus death toll rises to 294 | UTV - ITV News - ITV News", "description": "Sixteen more people who tested positive for coronavirus in Northern Ireland have sadly died, taking the total number to 294.\n\nAccording to the Department of Health, testing has resulted in 104 new cases in the region.\n\nThe total number of confirmed cases in N…", "url": "https://www.itv.com/news/utv/2020-04-25/northern-irelands-coronavirus-death-toll-rises-to-294/", "urlToImage": null, "publishedAt": "2020-04-25T14:22:00Z", "content": "Sixteen more people who tested positive for coronavirus in Northern Ireland have sadly died, taking the total number to 294.\r\nAccording to the Department of Health, testing has resulted in 104 new cases in the region.\r\nThe total number of confirmed cases in N… [+337 chars]"}, {"source": {"id": null, "name": "Leaderlive.co.uk"}, "author": "Steve Craddock", "title": "65 new cases of coronavirus and more than 90 total deaths reported across north Wales - LeaderLive", "description": "THE total number of deaths in relation to coronavirus across north Wales now stands at 93, health chiefs have announced.", "url": "https://www.leaderlive.co.uk/news/18405711.65-new-cases-coronavirus-90-total-deaths-reported-across-north-wales/", "urlToImage": null, "publishedAt": "2020-04-25T13:55:00Z", "content": "THE total number of deaths in relation to coronavirus across north Wales now stands at 93, health chiefs have announced.\r\nPublic Health Wales has confirmed that as of 2pm on Saturday (April 25) 65 new cases of the virus have been reported across the Betsi Cad… [+729 chars]"}, {"source": {"id": null, "name": "Plymouthherald.co.uk"}, "author": "Sarah Waddington", "title": "Person dies from coronavirus in Plymouth as total reaches 57 - Plymouth Live", "description": "Another patient has died after testing positive for COVID-19 at Derriford Hospital", "url": "https://www.plymouthherald.co.uk/news/plymouth-news/person-dies-coronavirus-plymouth-total-4078672", "urlToImage": null, "publishedAt": "2020-04-25T13:33:22Z", "content": "There has been another coronavirus death at Derriford Hospital in Plymouth, latest figures from NHS England show.\r\nNew figures released this afternoon state that another patient with coronavirus has died at the hospital, bringing the city's total to 57.\r\nTher… [+1144 chars]"}, {"source": {"id": null, "name": "Creativebloq.com"}, "author": "Rosie Hilder", "title": "Where to buy a face mask right now – plus how to make a face mask at home - Creative Bloq", "description": "Wondering where to buy a face mask? These retailers still have stock. Plus how to make your own.", "url": "https://www.creativebloq.com/news/where-to-buy-face-masks", "urlToImage": null, "publishedAt": "2020-04-25T13:01:17Z", "content": "If you want to know where to buy a face mask, you're in the right place. Face masks are selling out quickly around the world, so we've put together this list of online retailers that still have face masks in stock. \r\nBear in mind that the face masks in this a… [+6427 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus Explained: how the virus will hit the poorest people on the planet - Channel 4 News", "description": "The coronavirus pandemic is affecting the world, no matter who you are and where you come from. (Subscribe: https://bit.ly/C4_News_Subscribe) Covid-19 is dev...", "url": "https://www.youtube.com/watch?v=QorckhwMLR0", "urlToImage": null, "publishedAt": "2020-04-25T11:05:09Z", "content": "The coronavirus pandemic is affecting the world, no matter who you are and where you come from. (Subscribe: https://bit.ly/C4_News_Subscribe) \r\nCovid-19 is devastating countries across the globe, with some of the wealthiest nations struggling to contain the s… [+522 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus test online slots booked up within hour of site reopening - BBC News", "description": "Millions of key workers and people they live with can apply for a coronavirus test online.", "url": "https://www.bbc.co.uk/news/uk-52424044", "urlToImage": null, "publishedAt": "2020-04-25T10:03:07Z", "content": "Image copyrightPA Media\r\nCoronavirus tests offered to UK key workers were booked up within an hour - apart from some in Scotland.\r\nThe tests, which are targeted at those who are self-isolating, allow people to return to work as quickly as possible.\r\nHealth Se… [+4610 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Alessandra Scotto di Santolo", "title": "Expert reveals up to seven tests needed to get accurate coronavirus antibody results - Express", "description": "CORONAVIRUS tests may need up to seven takes to give accurate results on the development of antibodies in those who have already suffered from the deadly virus.", "url": "https://www.express.co.uk/news/uk/1273747/coronavirus-test-antibody-tests-covid-19-uk-latest-update", "urlToImage": null, "publishedAt": "2020-04-25T10:00:19Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus test slots run out for second day as booking website reopens - AOL Travel UK", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_52a62ada-57c5-4414-b06e-27a744a2920c&lang=en-GB&inline=false", "urlToImage": null, "publishedAt": "2020-04-25T09:41:00Z", "content": "AOL is part of Verizon Media. Click 'I agree' to allow Verizon Media and our partners to use cookies and similar technologies to access your device and use your data (including location) to understand your interests, and provide and measure personalised ads. … [+342 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Elsom For Mailonline", "title": "Chris Whitty reveals the UK's 'reproduction number' dropped below 1 - Daily Mail", "description": "England's chief medical officer has offered a chink of light out of the lockdown after revealing coronavirus infection rates in the UK have been wrestled down.", "url": "https://www.dailymail.co.uk/news/article-8255677/Chris-Whitty-reveals-UKs-reproduction-number-dropped-1.html", "urlToImage": null, "publishedAt": "2020-04-25T08:38:55Z", "content": "Professor Chris Whitty has offered a chink of light out of the lockdown after revealing coronavirus infection rates have been wrestled down.\r\nEngland's chief medical officer said the reproduction number - or R0 - has been brought below 1, marking a critical a… [+4163 chars]"}, {"source": {"id": null, "name": "Thescottishsun.co.uk"}, "author": "Brittany Vonow", "title": "WHO warns there is ‘no proof’ of coronavirus immunity as medics say ‘immunity passports’ could risk second wav - The Scottish Sun", "description": "", "url": "http://www.thescottishsun.co.uk/news/5529746/who-no-proof-immunity-passports-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-25T08:32:54Z", "content": "THE World Health Organisation today warned there is \"no proof\" of coronavirus immunity as medics warned 'risk-free certificates' could risk a second wave of the virus.\r\nWHO warned coronavirus immunity passports could make the pandemic worse as patients who ha… [+4877 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "NI pupils can use A-level results in Republic of Ireland - BBC News", "description": "As exams have been cancelled due to the Covid-19 pandemic, pupils will be awarded \"predicted grades\".", "url": "https://www.bbc.com/news/uk-northern-ireland-52417659", "urlToImage": null, "publishedAt": "2020-04-25T06:20:24Z", "content": "Image copyrightPAImage caption\r\n The Leaving Certificate and A-levels are both used by pupils to progress into further and higher education\r\nPupils in Northern Ireland will be able to use this year's A-level results in 2020 to enter universities in the Republ… [+2260 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Plea for public to get medical care when they need it - BBC News", "description": "People needing help should not be put off by the coronavirus pandemic, say health professionals.", "url": "https://www.bbc.co.uk/news/health-52417599", "urlToImage": null, "publishedAt": "2020-04-25T00:12:51Z", "content": "Image copyrightAFP/Oli Scarff via Getty Images\r\nPeople should seek medical care when they need it and not be put off by the coronavirus epidemic, say doctors, charities and the health service.\r\nAnyone who delays seeking treatment is putting their long-term he… [+5447 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "Www.gov.uk"}, "author": "Department of Health and Social Care", "title": "Clinical trial approved to help the NHS treat COVID-19 patients using plasma - GOV.UK", "description": "If effective, a national programme will deliver up to 10,000 units of plasma a week to the NHS to help treat coronavirus (COVID-19) patients.", "url": "https://www.gov.uk/government/news/clinical-trial-approved-to-help-the-nhs-treat-covid-19-patients-using-plasma", "urlToImage": null, "publishedAt": "2020-04-24T23:20:34Z", "content": "<ul><li>A clinical trial has been given approval to determine if plasma donated by patients who have recovered from COVID-19 can help those battling the illness</li><li>If effective, a scaled-up national programme will deliver up to 10,000 units of convalesce… [+5284 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "The most promising strategies for defeating coronavirus: A review study - Science Daily", "description": "Experts from UNC Chapel Hill review possible clinical approaches from antivirals to gene therapy against the virus responsible for COVID-19 and related diseases.", "url": "https://www.sciencedaily.com/releases/2020/04/200424081706.htm", "urlToImage": null, "publishedAt": "2020-04-24T20:35:32Z", "content": "In an unprecedented effort, hundreds of thousands of researchers and clinicians worldwide are locked in a race against time to develop cures, vaccines, and better diagnostic tests for COVID-19, the illness caused by the virus SARS-CoV-2.Over 1,650 articles on… [+4617 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Nazia Parveen", "title": "New mother dies of coronavirus six days after giving birth - The Guardian", "description": "Fozia Hanif developed symptoms before her 29th birthday, resulting in premature birth of her son, Ayaan", "url": "https://www.theguardian.com/world/2020/apr/24/new-mother-dies-of-coronavirus-six-days-after-giving-birth", "urlToImage": null, "publishedAt": "2020-04-24T19:31:43Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Betsi death report delay sparks investigation - BBC South East Wales", "description": "The north Wales health board reported all its deaths at once after issues with reporting systems.", "url": "https://www.bbc.co.uk/news/uk-wales-52419068", "urlToImage": null, "publishedAt": "2020-04-24T19:23:29Z", "content": "Image copyrightGetty ImagesImage caption\r\n Betsi Cadwaladr health board reported 84 deaths in the north Wales area on Thursday\r\nThe recording of the number of people who have died with coronavirus is being investigated after a Welsh health board failed to rep… [+2468 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Paralysed Ed Jackson reaches Everest staircase feat - BBC News", "description": "Former rugby player Ed Jackson has climbed 89,056 steps and made 2,783 trips up and down the stairs.", "url": "https://www.bbc.com/news/uk-england-somerset-52416450", "urlToImage": null, "publishedAt": "2020-04-24T19:09:39Z", "content": "Image copyrightWings for Life Image caption\r\n To simulate the ascent of Everest's 8,848m peak, Ed Jackson climbed 89,056 steps\r\nA paralysed ex-rugby player has climbed the equivalent height of Mount Everest on his parents' staircase.\r\nEd Jackson, from Bath, b… [+1708 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Stephen Matthews Health Editor For Mailonline Sam Blanchard Senior Health Reporter For Mailonline", "title": "NHS to release plan next week to 'redeploy coronavirus capacity' - Daily Mail", "description": "NHS bosses are keen to get operating theatres back up and running and to return to business as usual for non-coronavirus patients who may have been missing out on treatment for weeks.", "url": "https://www.dailymail.co.uk/news/article-8254393/NHS-release-plan-week-redeploy-coronavirus-capacity.html", "urlToImage": null, "publishedAt": "2020-04-24T18:35:52Z", "content": "NHS hospitals could restart routine operations as soon as next week as the health service prepares plans to get back on its feet as the coronavirus crisis blows over. \r\nPrivate hospitals have laid empty in the past week and up to 40,000 NHS beds are thought t… [+9807 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Contact tracing pilot to start in NI next week - BBC News", "description": "It comes as 13 more people are confirmed to have died in NI with Covid-19, bringing the total to 263.", "url": "https://www.bbc.com/news/uk-northern-ireland-52397772", "urlToImage": null, "publishedAt": "2020-04-24T18:28:52Z", "content": "Image copyrightGetty Images\r\nAn enhanced contact tracing programme for Covid-19 will start in Northern Ireland next week, the chief medical officer has said.\r\nContact tracing in the UK largely stopped on 12 March, as the government moved into a different stag… [+4345 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Nick Hopkins", "title": "Leaked Cabinet Office briefing on UK pandemic threat – the key points - The Guardian", "description": "From management of excess deaths to public outrage, 2019 document set out likely social and economic risks", "url": "https://www.theguardian.com/world/2020/apr/24/leaked-cabinet-office-briefing-on-uk-pandemic-threat-the-key-points", "urlToImage": null, "publishedAt": "2020-04-24T18:12:46Z", "content": "The 2019 National Security Risk Assessment (NSRA) is a comprehensive planning document that sets out the risks facing the UK and what is needed to prepare for them.\r\nIt was signed off by Sir Patrick Vallance, the governments chief scientific adviser. Over 600… [+8924 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Damian Carrington", "title": "Coronavirus detected on particles of air pollution - The Guardian", "description": "Exclusive: Scientists examine whether this route may enable infections at longer distances", "url": "https://www.theguardian.com/environment/2020/apr/24/coronavirus-detected-particles-air-pollution", "urlToImage": null, "publishedAt": "2020-04-24T18:12:43Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Les Steed", "title": "How does key worker testing work and what time can I apply for a coronavirus test? - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11469520/key-worker-coronavirus-testing-how-what-time/", "urlToImage": null, "publishedAt": "2020-04-24T17:35:15Z", "content": "MATT HANCOCK announced that testing can now be provided for up to seven million key workers and emergency staff.\r\nHere's how to get tested if you are an essential worker who believes that you or a household member has coronavirus.\r\n Matt Hancock said key work… [+6641 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Lancashire victim's touching farewell to fiancee - BBC News", "description": "Ricky McKeag thanked his partner Katie Martin \"for the best life\" before he was placed in a coma.", "url": "https://www.bbc.com/news/uk-england-lancashire-52417589", "urlToImage": null, "publishedAt": "2020-04-24T17:34:58Z", "content": "Image copyrightFamily handoutImage caption\r\n The couple were hoping to get married\r\nA 29-year-old man who died after testing positive for coronavirus messaged his fiancee to say \"thank you for the best life\" before he went into a coma.\r\nRichard McKeag, known … [+1796 chars]"}, {"source": {"id": null, "name": "Northwichguardian.co.uk"}, "author": "Northwich Guardian Staff", "title": "At least 7 coronavirus-related deaths in Cheshire West and Chester not captured in official data - Northwich Guardian", "description": "AT LEAST seven deaths linked to coronavirus in Cheshire West and Chester may not be captured in official estimates, new figures suggest.", "url": "https://www.northwichguardian.co.uk/news/18404523.least-7-coronavirus-related-deaths-cheshire-west-chester-not-captured-official-data/", "urlToImage": null, "publishedAt": "2020-04-24T16:20:00Z", "content": "AT LEAST seven deaths linked to coronavirus in Cheshire West and Chester may not be captured in official estimates, new figures suggest.\r\nShadow social care minister Liz Kendall has called on the Government to publish daily figures of Covid-19 deaths outside … [+2180 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: US death toll passes 50,000 in world's deadliest outbreak - BBC News", "description": "A grim milestone is passed by the world's deadliest outbreak, although US mortality rate is comparatively low.", "url": "https://www.bbc.co.uk/news/world-us-canada-52415579", "urlToImage": null, "publishedAt": "2020-04-24T16:11:07Z", "content": "Image copyrightGetty Images\r\nThe US virus death toll has surpassed 50,000, according to data from Johns Hopkins University, in what is the world's deadliest Covid-19 outbreak.\r\nMore than 3,000 deaths came in the last 24 hours, and there are now over 870,000 c… [+3928 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Chris Smith", "title": "The most unusual coronavirus symptom is also the most dangerous - BGR", "description": "The newest observed coronavirus symptom is also the most dangerous one and can appear in patients who don’t even experience other symptoms. Doctors have noticed an increase in strokes caused by blood clots in young adults, who might be reluctant to seek medic…", "url": "https://bgr.com/2020/04/24/coronavirus-symptoms-stroke-after-blood-clots-in-young-patients/", "urlToImage": null, "publishedAt": "2020-04-24T14:02:10Z", "content": "<ul><li>The newest observed coronavirus symptom is also the most dangerous one and can appear in patients who don’t even experience other symptoms.</li><li>Doctors have noticed an increase in strokes caused by blood clots in young adults, who might be relucta… [+3622 chars]"}, {"source": {"id": null, "name": "Cravenherald.co.uk"}, "author": "Lesley Tate", "title": "Driving to Craven to climb the Yorkshire Three Peaks 'is not essential travel' - North Yorkshire Police - Craven Herald", "description": "WITH Craven expected to have good weather this weekend, police have stressed once again the importance of staying home.", "url": "https://www.cravenherald.co.uk/news/18403762.driving-craven-climb-yorkshire-three-peaks-is-not-essential-travel---north-yorkshire-police/", "urlToImage": null, "publishedAt": "2020-04-24T13:28:00Z", "content": "WITH Craven expected to have good weather this weekend, police have stressed once again the importance of staying home.\r\nPolice say they have seen an increase in the number of people making unnecessary journeys and heading to the Dales - such as Malham - for … [+3855 chars]"}, {"source": {"id": null, "name": "Pulsetoday.co.uk"}, "author": null, "title": "GPs should contact all shielded patients as a 'follow-up' to letter, says NHS - Pulse", "description": "Practices should contact all of their patients who are shielding from coronavirus (Covid-19) as a 'follow-up' to the NHS letter notifying them to stay at home for 12 weeks, NHS England has said.", "url": "http://www.pulsetoday.co.uk/clinical/clinical-specialties/respiratory-/gps-should-contact-all-shielded-patients-as-a-follow-up-to-letter-says-nhs/20040685.article", "urlToImage": null, "publishedAt": "2020-04-24T13:18:45Z", "content": "Practices should contact all of their patients who are shielding from coronavirus (Covid-19) as a 'follow-up' to the NHS letter notifying them to stay at home for 12 weeks, NHS England has said.\r\nDuring this follow-up conversation, GPs should discuss what shi… [+3708 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Will Sweden's coronavirus gamble pay off? - The Telegraph", "description": "Sweden has one of the world’s most controversial - and closely watched - coronavirus strategies. Instead of ordering people to stay at home and shutting down...", "url": "https://www.youtube.com/watch?v=dkN7FFyv-QA", "urlToImage": null, "publishedAt": "2020-04-24T11:47:45Z", "content": null}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Birmingham Women’s Hospital consultant with Covid-19 dies - BBC News", "description": "Dr Vishna Rasiah was \"passionate about the care of babies and their families\" Birmingham Women and Children's Hospital said.", "url": "https://www.bbc.com/news/uk-england-birmingham-52412049", "urlToImage": null, "publishedAt": "2020-04-24T11:35:07Z", "content": "Image copyrightBirmingham Women's and Children's NHS TrustImage caption\r\n Dr Vishna Rasiah, was known across the Midlands as the lead for the regional neonatal network, focusing on newborns\r\nA \"talented, dedicated and respected\" paediatric consultant has died… [+1510 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Richard Hartley-Parkinson", "title": "Hairdressers may not open for another six months so get used to 'Captain Caveman' look - Metro.co.uk", "description": "Barber shops and hair salons won't be able to open until it is safe to do so - that may not be until the end of the year.", "url": "https://metro.co.uk/2020/04/24/hairdressers-may-not-open-another-six-months-get-used-captain-caveman-look-12604007/", "urlToImage": null, "publishedAt": "2020-04-24T10:39:15Z", "content": "A sign of things to come? Barbers in Wuhan cut the hair of medical workers (Picture: Rex Shutterstock)\r\nYour roots may be longer than your preferred hair colour and were going to have to get used to looking like Captain Caveman as hairdressers may not open fo… [+4548 chars]"}]}