{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nPaul Nuki,", "title": "Two new waves of deaths are about to break over the NHS, new analysis warns - Telegraph.co.uk", "description": "Radical solutions will need to be found if the health service is to avoid formal rationing", "url": "https://www.telegraph.co.uk/global-health/science-and-disease/two-new-waves-deaths-break-nhs-new-analysis-warns/", "urlToImage": null, "publishedAt": "2020-04-25T12:04:00Z", "content": "There will then be a third wave of deaths for Britain to contend with. This is made up, not of emergency cases, but of people who are developing conditions such as cancer and heart disease which are going undiagnosed because of the Covid crisis.\r\nThese patien… [+1786 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By James Wood For Mailonline", "title": "New figures show number of people visiting UK's A&E wards down by half this month - Daily Mail", "description": "Health officials are worried many people are not seeking treatment because they fear contracting Covid-19, thereby jeopardising their survival and potentially becoming collateral damage.", "url": "https://www.dailymail.co.uk/news/article-8256237/New-figures-number-people-visiting-UKs-E-wards-half-month.html", "urlToImage": null, "publishedAt": "2020-04-25T11:23:22Z", "content": "The NHS is launching a new campaign to make sure people seek urgent care during a medical emergency after visits to A&amp;E dropped by almost 50 per cent this month.\r\nHealth officials are worried many people are not seeking treatment because they fear contrac… [+23274 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Ewan Somerville", "title": "Government was warned last year to prepare for devastating pandemic, according to leaked memo - Evening Standard", "description": "", "url": "https://www.standard.co.uk/news/politics/government-warned-pandemic-ppe-testing-coronavirus-a4423921.html", "urlToImage": null, "publishedAt": "2020-04-25T10:53:56Z", "content": "The Government was warned last year that it needed to plan for a potentially lethal pandemic, according to a leaked memo.\r\nThe document, seen by the Guardian, reportedly set out urgent capability requirements that ministers needed to draw up to prevent tens o… [+2474 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shona Ghosh", "title": "Coronavirus: France bans online sales of nicotine substitutes - Business Insider - Business Insider", "description": "The government fears panic buying of nicotine replacement therapies after a new study found smokers were less likely to be infected by COVID-19.", "url": "https://www.businessinsider.com/coronavirus-france-halts-online-sales-nicotine-substitutes-smoker-study-2020-4", "urlToImage": null, "publishedAt": "2020-04-25T09:43:08Z", "content": "France on Friday banned online sales of nicotine replacements — such as nicotine gum and patches — after a widely reported Paris study found smokers were less likely to admitted to hospital for COVID-19.\r\nIn a draft legal text published earlier this week, the… [+1966 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Holly Christodoulou", "title": "UK troops given insect repellent Citriodiol after tests show spray could give ‘enhanced’ protection against co - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11478110/troops-given-insect-spray-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-25T09:38:32Z", "content": "BRITISH troops will be given insect repellant for protection against coronavirus after tests showed it may kill the deadly disease.\r\nCitriodiol has been known to fight types of the virus - with evidence now suggesting it could also tackle the Covid-19 strain.… [+3076 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Brittany Vonow", "title": "WHO warns there is ‘no proof’ of coronavirus immunity as medics say ‘immunity passports’ could risk second wav - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11478106/who-no-proof-immunity-passports-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-25T09:38:29Z", "content": "THE World Health Organisation today warned there is \"no proof\" of coronavirus immunity as medics warned 'risk-free certificates' could risk a second wave of the virus.\r\nWHO warned coronavirus immunity passports could make the pandemic worse as patients who ha… [+4811 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: The hidden health crisis - Sky News", "description": "The number of A&E visits has dropped by 41% in the UK, leading to fears that some people are risking their lives by staying away. Health officials are worrie...", "url": "https://www.youtube.com/watch?v=GPjMZuDLCBE", "urlToImage": null, "publishedAt": "2020-04-25T09:30:33Z", "content": null}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Helen Carter", "title": "Identical twins with coronavirus who both worked as nurses die within three days of each other - Manchester Evening News", "description": "'They always said they had come into the world together and would go out together as well'", "url": "https://www.manchestereveningnews.co.uk/news/uk-news/twin-nurses-die-coronavirus-days-18149319", "urlToImage": null, "publishedAt": "2020-04-25T09:29:48Z", "content": "Identical twin sisters have sadly died within three days of each other after both testing positive for cornavirus. \r\nChildren's nurse Katy Davis, 37, died at Southampton General Hospital on Tuesday while her identical twin, Emma, a former surgery nurse, died … [+2698 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Coronavirus: Plasma treatment for COVID-19 patients to be trialled - Sky News", "description": "So-called convalescent plasma is given to patients struggling to produce their own antibodies to fight the virus.", "url": "https://news.sky.com/story/coronavirus-plasma-treatment-for-covid-19-patients-to-be-trialled-11978522", "urlToImage": null, "publishedAt": "2020-04-25T09:21:49Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": null, "title": "Pollen count today: UK hay fever and allergy suffers face high tree pollen count - Express.co.uk", "description": "HAY FEVER and allergy sufferers could be hard-hit today as the tree pollen count across the country is rated as high risk, the Met Office reports.", "url": "https://www.express.co.uk/news/weather/1273731/pollen-count-today-tree-pollen-high-hay-fever-symptoms-allergies-weekend-forecast-uk", "urlToImage": null, "publishedAt": "2020-04-25T08:45:00Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Elsom For Mailonline", "title": "Chris Whitty reveals the UK's 'reproduction number' dropped below 1 - Daily Mail", "description": "England's chief medical officer has offered a chink of light out of the lockdown after revealing coronavirus infection rates in the UK have been wrestled down.", "url": "https://www.dailymail.co.uk/news/article-8255677/Chris-Whitty-reveals-UKs-reproduction-number-dropped-1.html", "urlToImage": null, "publishedAt": "2020-04-25T08:38:55Z", "content": "Professor Chris Whitty has offered a chink of light out of the lockdown after revealing coronavirus infection rates have been wrestled down.\r\nEngland's chief medical officer said the reproduction number - or R0 - has been brought below 1, marking a critical a… [+4163 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Some states begin to reopen as US death toll passes 50,000 - BBC News", "description": "Georgia, Oklahoma and Alaska lift some restrictions despite warnings that it may be too soon.", "url": "https://www.bbc.co.uk/news/world-us-canada-52421730", "urlToImage": null, "publishedAt": "2020-04-25T08:38:04Z", "content": "Image copyrightReutersImage caption\r\n Salons and spas were allowed to reopen in Georgia\r\nThree US states have allowed some shops to reopen after measures imposed to curb the spread of the coronavirus, as the country's death toll passed 51,000.\r\nSalons and spa… [+3317 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Katrina Turrill", "title": "Coronavirus symptoms: Heartbroken son reveals mum's first symptom before her death - Express", "description": "CORONAVIRUS symptoms have been shown to differ from person to person - while symptoms in some people appear mild, in others they present as more severe. A son has now spoken of his mum's first symptom before her death.", "url": "https://www.express.co.uk/life-style/health/1273717/coronavirus-symptoms-cases-death-feeling-unwell-cough", "urlToImage": null, "publishedAt": "2020-04-25T08:30:49Z", "content": "Graeme Anderson, 36, has described his mum’s first symptoms before her untimely death from COVID-19.\r\nSpeaking to Liverpool Echo, he explained his mum, June, had self-isolated for two weeks after a neighbour by her home tested positive for the disease.\r\nBut s… [+264 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Katrina Turrill", "title": "Coronavirus update: Six new symptoms of the deadly virus you need to look out for - Express", "description": "CORONAVIRUS has still taken a hold of the UK, with more than 143,000 confirmed cases and at least 19.506 deaths from the virus. Spotting the symptoms has never been so important, and the Centers for Disease Control and Prevention (CDC) has now added six new s…", "url": "https://www.express.co.uk/life-style/health/1273703/coronavirus-update-news-latest-symptoms-new-cdc", "urlToImage": null, "publishedAt": "2020-04-25T07:21:33Z", "content": "Coronavirus has been reported by patients to have a wide range of symptoms. Up until now, the CDC has listed the main symptoms as a fever, cough and shortness of breath or difficulty breathing. But six news symptoms have now been added to the list.After exper… [+1136 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Callum Hoare", "title": "‘Reservoir for viruses’ China told to permanently ban bat trade to prevent next pandemic - Express.co.uk", "description": "CHINA must permanently ban the hunting trade and consumption of wildlife animals, including bats, or a future pandemic similar to coronavirus is inevitable, research shows.", "url": "https://www.express.co.uk/news/world/1273464/china-xi-jinping-bat-animal-trade-coronavirus-pandemic-covid19-wuhan-seafood-market-spt", "urlToImage": null, "publishedAt": "2020-04-25T07:00:00Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Dailymail.com Reporter", "title": "Cyclist who confronted CNN's Chris Cuomo in his backyard says the host was like a 'boiling pot' - Daily Mail", "description": "David Whelan claimed that the anchor berated him as he asked Cuomo why he was not self-quarantining on Easter Sunday.", "url": "https://www.dailymail.co.uk/news/article-8255903/Cyclist-confronted-CNNs-Chris-Cuomo-backyard-says-host-like-boiling-pot.html", "urlToImage": null, "publishedAt": "2020-04-25T06:58:02Z", "content": "The Long Island bicyclist who got into a verbal spat with CNN anchor Chris Cuomo on Easter Sunday said the host was like a 'boiling pot' as he was confronted for not self-quarantining.\r\nDavid Whelan claimed that he had decided to go on a bike ride near where … [+4687 chars]"}, {"source": {"id": null, "name": "Wired.co.uk"}, "author": "Sabrina Weiss", "title": "The UK is racing to create the world's first coronavirus vaccine - Wired.co.uk", "description": "Vaccines usually take years to create. But a team at the University of Oxford is hoping to get things done in a matter of months. Here’s how", "url": "https://www.wired.co.uk/article/uk-coronavirus-vaccine-trial", "urlToImage": null, "publishedAt": "2020-04-25T05:10:10Z", "content": "In early 2018, a condition called Disease X was added to the World Health Organisations list of threats that could cause a deadly pandemic in the future. Unlike the other diseases on the list, Disease X didnt yet exist. It was just a placeholder for a novel p… [+7577 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Inzamam Rashid", "title": "Coronavirus: Intensive care patients given iPads to speak to relatives - Sky News", "description": "In the most tragic cases the devices will be used by patients saying goodbye to their loved ones for the last time.", "url": "https://news.sky.com/story/coronavirus-intensive-care-patients-given-ipads-to-speak-to-relatives-11978509", "urlToImage": null, "publishedAt": "2020-04-25T03:33:00Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "Thelancet.com"}, "author": null, "title": "A real-time dashboard of clinical trials for COVID-19 - The Lancet", "description": "In response to the global coronavirus disease 2019 (COVID-19) emergency, clinical\ntrial research assessing the efficacy and safety of clinical candidate interventions\nto treat COVID-19 are emerging at an unprecedented rate. As of April 21, 2020, well\nover 500…", "url": "https://www.thelancet.com/journals/landig/article/PIIS2589-7500(20)30086-8/fulltext", "urlToImage": null, "publishedAt": "2020-04-24T22:33:39Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. By continuing you agree to the use of cookies.\r\nCopyright © 2020 Elsevier Inc. except certain content provided by third parties.\r\nPrivacy Policy   Terms and Conditions"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Martin Fricker, Ben Glaze, Martin Bagot, Oliver Milne", "title": "Government warned a year ago to urgently prepare for pandemic and stockpile PPE - Mirror Online", "description": "Before Covid-19 emerged, ministers were told to put in place plans to monitor and contact-trace infected patients and manage a surge in deaths", "url": "https://www.mirror.co.uk/news/uk-news/ministers-warned-year-ago-viral-21923949", "urlToImage": null, "publishedAt": "2020-04-24T21:41:47Z", "content": "Ministers were warned last year about the devastating impact of a viral pandemic hitting the UK and urged to stockpile PPE.\r\nBefore Covid-19 emerged they were told to put in place plans to monitor and contact-trace infected patients and manage a surge in deat… [+1424 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Betsi death report delay sparks investigation - BBC South East Wales", "description": "The north Wales health board reported all its deaths at once after issues with reporting systems.", "url": "https://www.bbc.co.uk/news/uk-wales-52419068", "urlToImage": null, "publishedAt": "2020-04-24T19:23:29Z", "content": "Image copyrightGetty ImagesImage caption\r\n Betsi Cadwaladr health board reported 84 deaths in the north Wales area on Thursday\r\nThe recording of the number of people who have died with coronavirus is being investigated after a Welsh health board failed to rep… [+2244 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Paralysed Ed Jackson reaches Everest staircase feat - BBC News", "description": "Former rugby player Ed Jackson has climbed 89,056 steps and made 2,783 trips up and down the stairs.", "url": "https://www.bbc.com/news/uk-england-somerset-52416450", "urlToImage": null, "publishedAt": "2020-04-24T19:09:39Z", "content": "Image copyrightWings for Life Image caption\r\n To simulate the ascent of Everest's 8,848m peak, Ed Jackson climbed 89,056 steps\r\nA paralysed ex-rugby player has climbed the equivalent height of Mount Everest on his parents' staircase.\r\nEd Jackson, from Bath, b… [+1708 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Lizzy Buchan", "title": "Government was warned last year that it needed an action plan to deal with a pandemic - The Independent", "description": "Labour brands revelations 'alarming' and calls for Michael Gove to be hauled before MPs", "url": "https://www.independent.co.uk/news/uk/politics/coronavirus-government-warned-pandemic-action-plan-cabinet-office-a9483291.html", "urlToImage": null, "publishedAt": "2020-04-24T19:02:04Z", "content": "The government was warned last year that it needed an action plan to deal with a coronavirus-style pandemic, according to a leaked Cabinet Office report.\r\nThe 600-page National Security Risk Assessment (NRSA) reportedly warned that a new pandemic virus could … [+7569 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Weekend lockdowns - Turkey's coronavirus response - Channel 4 News", "description": "No country outside Europe and America has more coronavirus cases than Turkey, where numbers have overtaken China and Iran. (Subscribe: https://bit.ly/C4_News...", "url": "https://www.youtube.com/watch?v=AZ6v2UWPVnE", "urlToImage": null, "publishedAt": "2020-04-24T18:58:24Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Stephen Matthews Health Editor For Mailonline Sam Blanchard Senior Health Reporter For Mailonline", "title": "NHS to release plan next week to 'redeploy coronavirus capacity' - Daily Mail", "description": "NHS bosses are keen to get operating theatres back up and running and to return to business as usual for non-coronavirus patients who may have been missing out on treatment for weeks.", "url": "https://www.dailymail.co.uk/news/article-8254393/NHS-release-plan-week-redeploy-coronavirus-capacity.html", "urlToImage": null, "publishedAt": "2020-04-24T18:35:52Z", "content": "NHS hospitals could restart routine operations as soon as next week as the health service prepares plans to get back on its feet as the coronavirus crisis blows over. \r\nPrivate hospitals have laid empty in the past week and up to 40,000 NHS beds are thought t… [+9807 chars]"}, {"source": {"id": null, "name": "Sluggerotoole.com"}, "author": "Mick Fealty", "title": "Drawing conclusions on provisional #Covid19 figures does no favours to public understanding. - Slugger O'Toole", "description": "Significant news has just come through from RTE News this evening… The total death toll here is now 1,014, including 185* probable deaths, after two deaths that had previously been reported are no longer classified as related to Covid-19. [Emphasis added] A l…", "url": "https://sluggerotoole.com/2020/04/24/drawing-conclusions-on-provisional-covid19-figures-does-no-favours-to-public-understanding/", "urlToImage": null, "publishedAt": "2020-04-24T18:14:00Z", "content": "Significant news has just come through from RTE News this evening…\r\nThe total death toll here is now 1,014, including 185* probable deaths, after two deaths that had previously been reported are no longer classified as related to Covid-19. [Emphasis added]\r\nA… [+3263 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Les Steed", "title": "How does key worker testing work and what time can I apply for a coronavirus test? - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11469520/key-worker-coronavirus-testing-how-what-time/", "urlToImage": null, "publishedAt": "2020-04-24T17:35:15Z", "content": "MATT HANCOCK announced that testing can now be provided for up to seven million key workers and emergency staff.\r\nHere's how to get tested if you are an essential worker who believes that you or a household member has coronavirus.\r\n Matt Hancock said key work… [+6641 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Emma Brazell", "title": "Scientists detect coronavirus on particles of air pollution - Metro.co.uk", "description": "It raises a suggestion that higher levels of particle pollution could lead to higher rates of infection - for example in regions of northern Italy.", "url": "https://metro.co.uk/2020/04/24/scientists-detect-coronavirus-particles-air-pollution-12605944/", "urlToImage": null, "publishedAt": "2020-04-24T17:13:01Z", "content": "The new medical work is preliminary and it is not confirmed if the virus remains viable on pollution particles (Picture: Rex/ PA)\r\nCoronavirus has been detected on particles of air pollution by scientists looking into whether the illness could be carried this… [+2081 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Tragic coronavirus victim text fiancée 'thank you for the best life' before his death - Daily Record", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiX2h0dHBzOi8vd3d3LmRhaWx5cmVjb3JkLmNvLnVrL25ld3Mvc2NvdHRpc2gtbmV3cy90cmFnaWMtY29yb25hdmlydXMtdmljdGltLXRleHQtZmlhbmNlLTIxOTIyNjY30gFjaHR0cHM6Ly93d3cuZGFpbHlyZWNvcmQuY28udWsvbmV3cy9zY290dGlzaC1uZXdzL3RyYWdpYy1jb3JvbmF2aXJ1cy12aWN0aW0tdGV4dC1maWFuY2UtMjE5MjI2NjcuYW1w?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T16:46:21Z", "content": null}, {"source": {"id": null, "name": "Worthingherald.co.uk"}, "author": "John Holden", "title": "Coronavirus: Number of hospital deaths and confirmed cases in West Sussex rise - Worthing Herald", "description": "The number of coronavirus related deaths in West Sussex hospitals has increased alongside a rise in confirmed cases.", "url": "https://www.worthingherald.co.uk/health/coronavirus/coronavirus-number-hospital-deaths-and-confirmed-cases-west-sussex-rise-2549499", "urlToImage": null, "publishedAt": "2020-04-24T16:26:00Z", "content": "According to the latest figures from NHS England, 249 people have now sadly died in hospital after testing positive for coronavirus, as of April 24.\r\nToday's statistics show an increase of 17 fatalities from Wednesday (April 22).\r\nNHS England figures do not i… [+1444 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Sathnam Sanghera", "title": "Coronavirus and ethnicity: black and Asian NHS medics on the front line - The Times", "description": "My last significant social engagement before the coronavirus lockdown was a school reunion dinner. For the first time since I left Wolverhampton Grammar School 25 years ago, initially for a grim", "url": "https://www.thetimes.co.uk/article/coronavirus-and-ethnicity-black-and-asian-nhs-medics-on-the-front-line-dhznrc3kc", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "My last significant social engagement before the coronavirus lockdown was a school reunion dinner. For the first time since I left Wolverhampton Grammar School 25 years ago, initially for a grim summer job in a local hospital laundry, and then Cambridge Unive… [+451 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Sian Elvin", "title": "Coronavirus UK: 'Amazing' doctor who loved caring for babies dies - Metro.co.uk", "description": "'He treated every patient and family he cared for as his own. I couldn't have been prouder of him.'", "url": "https://metro.co.uk/2020/04/24/three-nhs-doctors-12605725/", "urlToImage": null, "publishedAt": "2020-04-24T15:52:10Z", "content": "Dr Vishna Rasiah, who has been described as talented, dedicated and respected, has died after contracting Covid-19 (Picture: PA)\r\nA talented, dedicated and respected doctor has died after contracting coronavirus.\r\nDr Vishna Rasiah, who worked at Birmingham Wo… [+2320 chars]"}, {"source": {"id": null, "name": "Examinerlive.co.uk"}, "author": "Jessica Sansome, Brett Gibbons", "title": "Exhausted mum 'named and shamed' on Facebook over Clap for Carers 'snub' - Hull Daily Mail", "description": "Woman claimed that she was criticised on social media for not taking part last week and accused of 'showing the street up'", "url": "https://www.examinerlive.co.uk/news/uk-world-news/exhausted-mum-named-shamed-facebook-18144302", "urlToImage": null, "publishedAt": "2020-04-24T15:20:35Z", "content": "A tearful mum says she is really upset after being 'named and shamed' on Facebook for not joining in with Clap for Carers.\r\nClap for Carers started some weeks ago and takes place every Thursday at 8pm to recognise the work of NHS and key workers in the fight … [+1744 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "UK hospital coronavirus death toll rises to 19506 as 768 more die - ITV News", "description": "A total of 19,506 patients had died in hospital after testing positive for coronavirus in the UK as of 5pm on Thursday, the Department of Health said, up by 768 from 18,738 the day before.\n\nThe daily figure is up on the previous day when 616 people were confi…", "url": "https://www.itv.com/news/2020-04-24/uk-hospital-coronavirus-death-toll-rises-to-19-506-as-768-more-die/", "urlToImage": null, "publishedAt": "2020-04-24T14:17:00Z", "content": null}, {"source": {"id": null, "name": "Shropshirestar.com"}, "author": "Dominic Robertson", "title": "Four more coronavirus deaths confirmed in Shropshire as UK death toll passes 19000 - shropshirestar.com", "description": "A further four people have been confirmed to have died with coronavirus in Shropshire.", "url": "https://www.shropshirestar.com/news/health/coronavirus-covid19/2020/04/24/four-more-coronavirus-deaths-confirmed-in-county/", "urlToImage": null, "publishedAt": "2020-04-24T13:35:00Z", "content": "All four patients were in the care of Shrewsbury &amp; Telford Hospital NHS Trust (SaTH) and died after testing positive for Covid-19, NHS England confirmed today. \r\nIt takes the total who have now died at the trust, which manages Royal Shrewsbury Hospital an… [+1529 chars]"}, {"source": {"id": null, "name": "Pulsetoday.co.uk"}, "author": null, "title": "GPs should contact all shielded patients as a 'follow-up' to letter, says NHS - Pulse", "description": "Practices should contact all of their patients who are shielding from coronavirus (Covid-19) as a 'follow-up' to the NHS letter notifying them to stay at home for 12 weeks, NHS England has said.", "url": "http://www.pulsetoday.co.uk/clinical/clinical-specialties/respiratory-/gps-should-contact-all-shielded-patients-as-a-follow-up-to-letter-says-nhs/20040685.article", "urlToImage": null, "publishedAt": "2020-04-24T13:18:45Z", "content": "Practices should contact all of their patients who are shielding from coronavirus (Covid-19) as a 'follow-up' to the NHS letter notifying them to stay at home for 12 weeks, NHS England has said.\r\nDuring this follow-up conversation, GPs should discuss what shi… [+3708 chars]"}, {"source": {"id": null, "name": "Examinerlive.co.uk"}, "author": "Lauren Ballinger", "title": "Police spell out lockdown rules for \"confused\" Yorkshire Dales day trippers - ExaminerLive", "description": "More than 350 people have been fined for breaking lockdown rules", "url": "https://www.examinerlive.co.uk/news/west-yorkshire-news/police-spell-out-lockdown-rules-18145084", "urlToImage": null, "publishedAt": "2020-04-24T12:54:00Z", "content": "Police have urged day trippers tempted by the good weather forecast this weekend to stay away from the Yorkshire Dales.\r\nAnd they have said despite some confusion over the rules, it couldn't be clearer that we must all stay at home.\r\nNorth Yorkshire Police sa… [+2599 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Will Sweden's coronavirus gamble pay off? - The Telegraph", "description": "Sweden has one of the world’s most controversial - and closely watched - coronavirus strategies. Instead of ordering people to stay at home and shutting down...", "url": "https://www.youtube.com/watch?v=dkN7FFyv-QA", "urlToImage": null, "publishedAt": "2020-04-24T11:47:45Z", "content": "Sweden has one of the worlds most controversial - and closely watched - coronavirus strategies. Instead of ordering people to stay at home and shutting down all non-essential businesses, the Swedish government has simply asked people to adhere to social dista… [+439 chars]"}, {"source": {"id": null, "name": "Imperial.ac.uk"}, "author": null, "title": "Coronavirus 'map' identifies key virus entry points into the body | Imperial News - Imperial College London", "description": "Scientists are creating a map of the human body to identify locations where the COVID-19 virus can enter human cells.", "url": "https://www.imperial.ac.uk/news/197114/coronavirus-identifies-virus-entry-points-into/", "urlToImage": null, "publishedAt": "2020-04-24T11:36:27Z", "content": "Scientists are creating a map of the human body to identify locations where the COVID-19 virus can enter human cells.\r\nThe research, from a number of international institutions including Imperial College London, has so far identified likely initial infection … [+5951 chars]"}, {"source": {"id": null, "name": "Doncasterfreepress.co.uk"}, "author": "Tim Cunningham", "title": "Doncaster coronavirus deaths may be missed in official figures - Doncaster Free Press", "description": "At least two deaths linked to coronavirus in Doncaster may not be captured in official estimates, new figures suggest.", "url": "https://www.doncasterfreepress.co.uk/health/coronavirus/doncaster-coronavirus-deaths-may-be-missed-official-figures-2548746", "urlToImage": null, "publishedAt": "2020-04-24T11:02:00Z", "content": "Shadow social care minister Liz Kendall has called on the Government to publish daily figures of Covid-19 deaths outside hospital settings, including in care homes, to understand \"the true scale of the problem.\"\r\nOffice for National statistics data shows that… [+1965 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Laura Geggel", "title": "SARS-CoV-2 may be exploiting our immune system's 'first responder' cells - Livescience.com", "description": "", "url": "https://www.livescience.com/coronavirus-immune-interferon-response.html", "urlToImage": null, "publishedAt": "2020-04-24T11:00:00Z", "content": "The new coronavirus\r\n, known as SARS-CoV-2, may be using part of the human body's own immune response against us, a new study suggests.\r\nThe novel coronavirus is known to use a keyhole called the ACE2 receptor to \"unlock\" a cell and get inside, where it repli… [+6132 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Rob Powell, political correspondent, and Greg Heffer, political reporter", "title": "Coronavirus test applications closed after 5,000 home kits ordered in two minutes - Sky News", "description": "Downing Street reveals that 5,000 home-testing kits were ordered within two minutes of the new website opening.", "url": "https://news.sky.com/story/coronavirus-online-applications-for-covid-19-tests-temporarily-closed-due-to-huge-demand-11978070", "urlToImage": null, "publishedAt": "2020-04-24T10:11:24Z", "content": null}, {"source": {"id": null, "name": "Edp24.co.uk"}, "author": "Abigail Nicholson", "title": "We must be told when we can see our relatives again, says health expert | Politics - Eastern Daily Press", "description": "Clear guidance on whether people can safely visit family and friends needs to be ready as soon as any easing of coronavirus lockdown rules is announced, a public health expert has warned.", "url": "https://www.edp24.co.uk/news/politics/must-be-told-when-we-can-see-relatives-again-1-6621960", "urlToImage": null, "publishedAt": "2020-04-24T10:00:00Z", "content": "PUBLISHED: 11:00 24 April 2020\r\nAbigail Nicholson\r\nClear guidance on whether people can safely visit family and friends needs to be ready as soon as any easing of coronavirus lockdown rules is announced, a public health expert has warned. Picture: Getty Image… [+2742 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Staff devastated as 15 residents of the same nursing home die in the space of a month - ITV News", "description": "Staff at a nursing home in Newport have been left devastated following the\ndeaths of 15 residents in the space of a month.\n\nFourteen of the elderly residents at Tregwilym Lodge in Rogerstone were showing symptoms of coronavirus before they died, although test…", "url": "https://www.itv.com/news/wales/2020-04-24/fifteen-nursing-home-residents-die-in-the-space-of-a-month/", "urlToImage": null, "publishedAt": "2020-04-24T09:44:00Z", "content": "Staff at a nursing home in Newport have been left devastated following the\r\ndeaths of 15 residents in the space of a month.\r\nFourteen of the elderly residents at Tregwilym Lodge in Rogerstone were showing symptoms of coronavirus before they died, although tes… [+1796 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nAnnelies Gartner", "title": "How close are we to a coronavirus vaccine - and when will trials begin? - Telegraph.co.uk", "description": "Latest news on the search for a vaccine against the new coronavirus", "url": "https://www.telegraph.co.uk/global-health/science-and-disease/coronavirus-vaccine-trials-start-covid-19-latest-update/", "urlToImage": null, "publishedAt": "2020-04-24T08:57:32Z", "content": "As Covid-19 has rapidly spread around the world there has been a mad scramble to find a vaccine. \r\nIn the UK a potential coronavirus vaccine being developed at the University of Oxford will begin human trials from Thursday, Matt Hancock, the Health Secretary,… [+1550 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Jessica Knibbs", "title": "Coronavirus symptoms: Do your toes look like this? Signs you could have 'COVID toes' - Express", "description": "CORONAVIRUS has caused mass havoc in its wake. The UK's updated cases of death from the deadly virus sits at an astonishing 17,337. Having toes which resemble the following could mean you're at risk of an infection.", "url": "https://www.express.co.uk/life-style/health/1272455/coronavirus-update-uk-cases-news-symptoms-covid-toes-frostbite-like-purple-red", "urlToImage": null, "publishedAt": "2020-04-24T08:14:00Z", "content": null}, {"source": {"id": null, "name": "Expressandstar.com"}, "author": null, "title": "Birmingham mother dies with coronavirus six days after giving birth - expressandstar.com", "description": "The family of a new mother who died in hospital without ever getting to hold her baby have spoken of their devastation.", "url": "https://www.expressandstar.com/news/health/coronavirus-covid19/2020/04/24/birmingham-mother-dies-in-hospital-six-days-after-giving-birth/", "urlToImage": null, "publishedAt": "2020-04-24T07:37:00Z", "content": "Fozia Hanif, who had tested positive for coronavirus, died at Birmingham's Heartlands Hospital on April 8 after her condition deteriorated following the birth of her son. \r\nThe 29-year-old - whose baby remains in hospital but has tested negative for Covid-19 … [+2426 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Coronavirus: 'Too soon' to end lockdown but health secretary 'comfortable' with some businesses reopening - Sky News", "description": "", "url": "https://news.sky.com/story/coronavirus-too-soon-to-end-lockdown-but-health-secretary-comfortable-with-building-sites-reopening-11977971", "urlToImage": null, "publishedAt": "2020-04-24T07:04:48Z", "content": null}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nLizzie Roberts", "title": "Contact tracing: how has it worked for other countries, and could it really help ease UK lockdown? - The Telegraph", "description": "From teams of 'corona detectives' to Army cadets making thousands of calls a day, countries are tracking the spread of Covid-19", "url": "https://www.telegraph.co.uk/news/2020/04/25/what-contact-tracing-how-work-countries-uk-lockdown/", "urlToImage": null, "publishedAt": "2020-04-24T06:57:00Z", "content": "Countries around the world are rushing to launch contact tracing apps to identify who an infected person has had contact with, as part of efforts to slow the spread of the coronavirus. \r\nThe UK Government has announced the infrastructure was being put in plac… [+1754 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Kathleen Speirs, Ryan Merrifield", "title": "'One in a million' nurse described 'excruciating' symptoms before dying of coronavirus - Mirror Online", "description": "Angela Cunningham's death saw an outpouring of grief on social media, where the veteran nurse had detailed her agonising symptoms, including vomiting and muscle pain, in the days before going into hospital", "url": "https://www.mirror.co.uk/news/uk-news/one-million-nurse-described-excruciating-21918725", "urlToImage": null, "publishedAt": "2020-04-24T06:08:50Z", "content": "The heartbreak of a popular nurse's tragic death from coronavirus, just days before she turned 60, will \"never heal\", her brother has said.\r\nAngela Cunningham, known as Angie, had been on a ventilator in ITU at Borders General Hospital for a week after testin… [+2692 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "BBC News", "title": "What is contact tracing and how does it work? - BBC News", "description": "When lockdown ends, contact tracing could help limit the spread of coronavirus.", "url": "https://www.bbc.co.uk/news/av/technology-52401049/coronavirus-what-is-contact-tracing-and-how-does-it-work", "urlToImage": null, "publishedAt": "2020-04-24T05:54:19Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: What do the stats tell us in Wales? - BBC News", "description": "Where are the hot spots in Wales and what is happening in care homes?", "url": "https://www.bbc.co.uk/news/uk-wales-52380643", "urlToImage": null, "publishedAt": "2020-04-24T05:41:30Z", "content": "Image copyrightGetty ImagesImage caption\r\n Beaches such as this one in Rhyl are all-but deserted during lockdown restrictions\r\nWhat can different statistics tell us about coronavirus in Wales so far?\r\nWe seem to be bombarded with different measures, but what … [+10081 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "David Rhodes", "title": "Coronavirus: Middlesbrough inhabitants most 'at risk' of dying - BBC News", "description": "A think tank says people in Middlesbrough have the highest chance of dying from Covid-19.", "url": "https://www.bbc.com/news/uk-england-tees-52354430", "urlToImage": null, "publishedAt": "2020-04-23T23:52:00Z", "content": "Let us know you agree to cookies\r\nWe use cookies to give you the best online experience. Please let us know if you agree to all of these cookies.\r\nImage caption\r\n Parks in Middlesbrough remain closed\r\nThe Mayor of Middlesbrough recently ordered all of the tow… [+6161 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: 'I faked having Covid-19 on Facebook and got arrested' - BBC News", "description": "Across the world police are chasing down alleged symptom-fakers who are being accused of triggering panic.", "url": "https://www.bbc.com/news/technology-52397294", "urlToImage": null, "publishedAt": "2020-04-23T23:21:30Z", "content": "Image copyrightTyler County Sheriff's Office/ GettyImage caption\r\n Mr Brandin's picture released by police\r\nMichael Lane Brandin knew his Facebook post would cause a stir.\r\nWhat he didn't realise was that he'd be arrested, lose his job and face a trial that c… [+4279 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Sarah Marsh", "title": "NHS limits dialysis supplies for coronavirus patients - The Guardian", "description": "NHS England sends out emergency guidance following a shortage of dialysis fluids", "url": "https://www.theguardian.com/uk-news/2020/apr/23/nhs-limits-dialysis-supplies-for-coronavirus-patients", "urlToImage": null, "publishedAt": "2020-04-23T21:24:00Z", "content": "Hospitals are having to conserve life-saving dialysis fluid in the coming days because of national shortages, as it has been revealed that 28% of coronavirus patients in intensive care who need significant help to breathe also need kidney support.\r\nAccording … [+4901 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Harrison Jones", "title": "UK urged 'do your bit' with 25,000 to be invited to take part in coronavirus study - Metro.co.uk", "description": "'Take part in this vital research for your country.'", "url": "https://metro.co.uk/2020/04/23/uk-urged-bit-25000-invited-take-part-coronavirus-study-12602033/", "urlToImage": null, "publishedAt": "2020-04-23T20:38:08Z", "content": "Participants will give nose and throat swabs in one of the biggest virus infection and antibodies studies that this country has ever seen (Picture: Getty Images)\r\nThe Health Secretary Matt Hancock has urged the public to do your bit by taking part in a large-… [+4458 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nAnna Mikhailova,", "title": "Scarves are no substitute for face masks in protecting against coronavirus, experts say - Telegraph.co.uk", "description": "Worries over supplies of masks for medical workers means Government advice could be to use alternative ways of covering their faces", "url": "https://www.telegraph.co.uk/politics/2020/04/23/scarves-no-substitute-face-masks-protecting-against-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-23T20:30:00Z", "content": "The governments plan to recommend scarves instead of face masks will not offer people the same level of protection from Covid-19, experts have warned.\r\nMinisters are considering the recommendation by the Scientific Advisory Group for Emergencies (Sage), which… [+1150 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Britons come together to Clap for our Carers and thank the NHS - The Telegraph", "description": "People across the UK came out on their doorsteps, balconies, windows and gardens to clap for our cares for the fifth week running. For all the latest on coro...", "url": "https://www.youtube.com/watch?v=XZo5XuydB9M", "urlToImage": null, "publishedAt": "2020-04-23T19:45:53Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Henry McDonald, Pamela Duncan", "title": "Lockdown may be lifted earlier in Northern Ireland than rest of UK - The Guardian", "description": "Arlene Foster makes statement as it emerges extra critical care capacity not expected to be needed", "url": "https://www.theguardian.com/world/2020/apr/23/lockdown-may-be-lifted-earlier-in-northern-ireland-than-rest-of-uk", "urlToImage": null, "publishedAt": "2020-04-23T19:09:46Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Frances Perraudin, Rowena Mason", "title": "NHS supplier urges public not to buy out medical masks - The Guardian", "description": "UK distributor of PPE ensures sales of its clinical masks are ‘not diverted’ from key workers", "url": "https://www.theguardian.com/world/2020/apr/23/nhs-supplier-urges-public-not-to-buy-out-medical-masks", "urlToImage": null, "publishedAt": "2020-04-23T18:44:59Z", "content": "The public has been urged not to buy medical face masks so that stocks can be preserved for the NHS, following scientists advice to the government saying cloth coverings could be worn to stem the spread of coronavirus.\r\nThe advice from Arco, one of the UKs le… [+4385 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Paul Dinsdale For Mailonline Vanessa Chalmers Health Reporter For Mailonline", "title": "NHS trusts buy their own antibody kits from Dutch firm to test staff - Daily Mail", "description": "Hundreds of the Biozek tests have already been used on NHS staff in London, Manchester and Leicester as hospitals face a surge in demand at a time when up to a fifth of the workforce are off sick.", "url": "https://www.dailymail.co.uk/news/article-8250133/NHS-trusts-buy-antibody-kits-Dutch-firm-test-staff.html", "urlToImage": null, "publishedAt": "2020-04-23T18:32:57Z", "content": "Five trusts in England are in talks with Dutch firm Biozek Medical to buy thousands of its rapid finger-prick tests which give a diagnosis in a matter of minutes\r\nNHS trusts have resorted to buying coronavirus antibody tests overseas in a bid to get their sta… [+13487 chars]"}, {"source": {"id": null, "name": "Herefordtimes.com"}, "author": "James Thomas", "title": "Coronavirus: ONS figures reveal more deaths in Herefordshire - Hereford Times", "description": "AT least three deaths linked to coronavirus in Herefordshire happened outside of hospital, new figures suggest.", "url": "https://www.herefordtimes.com/news/18401691.coronavirus-ons-figures-reveal-deaths-herefordshire/", "urlToImage": null, "publishedAt": "2020-04-23T18:01:33Z", "content": "AT least three deaths linked to coronavirus in Herefordshire happened outside of hospital, new figures suggest.\r\nOffice for National Statistics (ONS) data shows that in Herefordshire, 18 deaths involving Covid-19 were provisionally registered up to April 10.\r… [+2366 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": null, "title": "LIVE: Health secretary giving daily coronavirus briefing | Politics News - Sky News", "description": "Deaths of UK hospital patients with COVID-19 reach 18,738, but social distancing is said to be working.", "url": "https://news.sky.com/story/live-health-secretary-gives-daily-coronavirus-briefing-11977730", "urlToImage": null, "publishedAt": "2020-04-23T16:07:30Z", "content": null}, {"source": {"id": null, "name": "Lep.co.uk"}, "author": "Iain Lynn", "title": "Two pet cats test positive to coronavirus - Lancashire Post", "description": "Two pet cats in New York state have tested positive for the coronavirus, marking the first confirmed cases in companion animals in the US, federal officials said.", "url": "https://www.lep.co.uk/health/coronavirus/two-pet-cats-test-positive-coronavirus-2547776", "urlToImage": null, "publishedAt": "2020-04-23T16:00:00Z", "content": "The cats, which had mild respiratory illnesses and are expected to recover, are thought to have contracted the virus from people in their households or neighbourhoods, the US Department of Agriculture (USDA) and the federal Centres for Disease Control and Pre… [+3049 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Oliver Wright", "title": "Coronavirus 'nearly put Dominic Cummings in hospital' | News - The Times", "description": "Dominic Cummings’s wife has described how he collapsed after suffering coronavirus symptoms and was nearly taken to hospital when his oxygen levels dropped.Mary Wakefield, a writer for The Spectator", "url": "https://www.thetimes.co.uk/article/coronavirus-nearly-left-dominic-cummings-in-hospital-3k2zrjdd3", "urlToImage": null, "publishedAt": "2020-04-23T16:00:00Z", "content": "Dominic Cummingss wife has described how he collapsed after suffering coronavirus symptoms and was nearly taken to hospital when his oxygen levels dropped.\r\nMary Wakefield, a writer for The Spectator, said that Boris Johnsons most senior adviser had rushed ho… [+449 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "UK Covid-19 hospital death toll rises to 18738 - AOL Travel UK", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_e85314e3-7f25-4baa-b5b9-9f49911aff5a&lang=en-GB&inline=false", "urlToImage": null, "publishedAt": "2020-04-23T15:28:00Z", "content": "AOL is part of Verizon Media. Click 'I agree' to allow Verizon Media and our partners to use cookies and similar technologies to access your device and use your data (including location) to understand your interests, and provide and measure personalised ads. … [+342 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Lucy Jones", "title": "The 10 cancer warning signs you must NEVER ignore – even in coronavirus lockdown - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11464299/cancer-warning-signs-never-ignore-coronavirus-lockdown/", "urlToImage": null, "publishedAt": "2020-04-23T15:10:19Z", "content": "SHOCKING statistics this week revealed that 2,300 new cancer cases could be going undetected each week in the UK during the coronavirus pandemic. \r\nAnd, according to Cancer Research UK, the number of urgent suspected cancer referrals by GPs have dropped to 25… [+8728 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Gemma Mullin", "title": "Scientists can’t rule out the chance coronavirus could be sexually transmitted - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11462872/scientists-coronavirus-sexually-transmitted/", "urlToImage": null, "publishedAt": "2020-04-23T14:19:53Z", "content": "SCIENTISTS have admitted that they can't rule out the chance that coronavirus could be sexually transmitted.\r\nResearchers from the University of Utah have analysed some early data from men in China who recently had Covid-19.\r\n Experts say they can't rule out … [+5454 chars]"}, {"source": {"id": null, "name": "Inverness-courier.co.uk"}, "author": "Philip Murray", "title": "Three new Covid-19 coronavirus cases confirmed in the Highlands, but numbers in hospital fell; mirroring a similar fall across Scotland as a whole - Inverness Courier", "description": "Three new cases of Covid-19 have been confirmed in the NHS Highland area, taking the overall total to 214.", "url": "https://www.inverness-courier.co.uk/news/new-highland-covid-19-cases-confirmed-amid-a-slight-drop-in-hospital-patient-numbers-197600/", "urlToImage": null, "publishedAt": "2020-04-23T13:21:00Z", "content": "Coronavirus news.\r\nTHREE new cases of Covid-19 have been confirmed in the NHS Highland area, taking the overall total to 214.\r\nIt came as Scotland recorded another 371 cases, taking the overall number since the outbreak began to 9409. Sadly the death toll als… [+1227 chars]"}]}