{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Emer Scully For Mailonline", "title": "Italy's coronavirus outbreak began in January, study shows - Daily Mail", "description": "Italy was the first western country where the number of Covid-19 cases dramatically shot up, leading to 12,000 deaths by the end of March. A study shows Covid-19 was in Italy from January.", "url": "https://www.dailymail.co.uk/news/article-8255233/Italys-coronavirus-outbreak-began-January-study-shows.html", "urlToImage": null, "publishedAt": "2020-04-24T23:56:31Z", "content": "Coronavirus arrived in Italy in January 'for sure' - despite the first case not being diagnosed until the end of February, says a scientist who presented a study on the subject today.\r\nExpert Stefano Merler, of the Bruno Kessler Foundation, told a news confer… [+5356 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Applause for key workers 'is not enough' - BBC News", "description": "NHS staff, police and firefighters need better pay and treatment after coronavirus, union leader warns.", "url": "https://www.bbc.com/news/uk-politics-52403609", "urlToImage": null, "publishedAt": "2020-04-24T23:38:03Z", "content": "Image copyrightwebphotographeer\r\nNHS workers, police and firefighters must get better pay and treatment after they \"see us through\" the coronavirus crisis, a union leader has said.\r\nMatt Wrack, of the Fire Brigades Union, said many of his members were working… [+2170 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Elsom For Mailonline", "title": "Cabinet ministers were warned last year about a coronavirus pandemic - Daily Mail", "description": "The National Security Risk Assessment highlighted the devastating social and economic costs of a major disease outbreak and was signed off by chief scientific adviser Sir Patrick Vallance.", "url": "https://www.dailymail.co.uk/news/article-8255043/Cabinet-ministers-warned-year-coronavirus-pandemic.html", "urlToImage": null, "publishedAt": "2020-04-24T22:42:58Z", "content": "Ministers were last year warned of the grave consequences a future pandemic would unleash on the UK, a leaked Cabinet Office briefing had revealed. \r\nTens of thousands of deaths, crippling economic costs and creaking public services were predicted in the 2019… [+7832 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nKatherine Rushton", "title": "Care homes' soaring death rate blamed on 'reckless' order to take back Covid-19 patients - Telegraph.co.uk", "description": "The number of Covid-19 deaths in care homes was estimated by Care England to have reached 7,500 a week ago", "url": "https://www.telegraph.co.uk/news/2020/04/24/care-homes-ordered-take-patients-suspected-coronavirus-nhs-hospitals/", "urlToImage": null, "publishedAt": "2020-04-24T20:16:00Z", "content": "It added that coronavirus patients could be safely cared for as long as care home staff adhered to certain procedures, but that patients who had not been tested and showed no symptoms could be cared for as normal.\r\nA Whitehall official told the Telegraph that… [+904 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Coronavirus: Identical twins Emma and Katy Davis die within three days of each other - Sky News", "description": "Emma and Katy Davis, 37, both had the same underlying health condition.", "url": "https://news.sky.com/story/coronavirus-identical-twins-emma-and-katy-davis-die-within-three-days-of-each-other-11978456", "urlToImage": null, "publishedAt": "2020-04-24T20:06:42Z", "content": null}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Rebecca Speare-Cole", "title": "Professor Chris Whitty says it is 'unlikely' the UK will stay in coronavirus lockdown 'indefinitely' - Evening Standard", "description": "", "url": "https://www.standard.co.uk/news/uk/uk-coronavirus-lockdown-end-prof-chris-whitty-a4423761.html", "urlToImage": null, "publishedAt": "2020-04-24T19:39:45Z", "content": "The UK is unlikely to remain in the current coronaviruslockdown pattern for the indefinite future, England's chief medical officer said today.\r\nProfessor Chris Whitty told Westminster's Science and Technology Committee said that the Government were not going … [+1910 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Betsi death report delay sparks investigation - BBC South East Wales", "description": "The north Wales health board reported all its deaths at once after issues with reporting systems.", "url": "https://www.bbc.co.uk/news/uk-wales-52419068", "urlToImage": null, "publishedAt": "2020-04-24T19:23:29Z", "content": "Image copyrightGetty ImagesImage caption\r\n Betsi Cadwaladr health board reported 84 deaths in the north Wales area on Thursday\r\nThe recording of the number of people who have died with coronavirus is being investigated after a Welsh health board failed to rep… [+2244 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Paralysed Ed Jackson reaches Everest staircase feat - BBC News", "description": "Former rugby player Ed Jackson has climbed 89,056 steps and made 2,783 trips up and down the stairs.", "url": "https://www.bbc.com/news/uk-england-somerset-52416450", "urlToImage": null, "publishedAt": "2020-04-24T19:09:39Z", "content": "Image copyrightWings for Life Image caption\r\n To simulate the ascent of Everest's 8,848m peak, Ed Jackson climbed 89,056 steps\r\nA paralysed ex-rugby player has climbed the equivalent height of Mount Everest on his parents' staircase.\r\nEd Jackson, from Bath, b… [+1708 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Weekend lockdowns - Turkey's coronavirus response - Channel 4 News", "description": "No country outside Europe and America has more coronavirus cases than Turkey, where numbers have overtaken China and Iran. (Subscribe: https://bit.ly/C4_News...", "url": "https://www.youtube.com/watch?v=AZ6v2UWPVnE", "urlToImage": null, "publishedAt": "2020-04-24T18:58:24Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "'I feel a deep responsibility': UK Health Secretary Matt Hancock on Covid-19 response - Channel 4 News", "description": "We speak to Health Secretary Matt Hancock and begin by asking him whether the government had failed to anticipate the demand for tests when it launched its o...", "url": "https://www.youtube.com/watch?v=kraGcbA_7D4", "urlToImage": null, "publishedAt": "2020-04-24T18:37:28Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Stephen Matthews Health Editor For Mailonline Sam Blanchard Senior Health Reporter For Mailonline", "title": "NHS to release plan next week to 'redeploy coronavirus capacity' - Daily Mail", "description": "NHS bosses are keen to get operating theatres back up and running and to return to business as usual for non-coronavirus patients who may have been missing out on treatment for weeks.", "url": "https://www.dailymail.co.uk/news/article-8254393/NHS-release-plan-week-redeploy-coronavirus-capacity.html", "urlToImage": null, "publishedAt": "2020-04-24T18:35:52Z", "content": "NHS hospitals could restart routine operations as soon as next week as the health service prepares plans to get back on its feet as the coronavirus crisis blows over. \r\nPrivate hospitals have laid empty in the past week and up to 40,000 NHS beds are thought t… [+9807 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Nicoletta Lanese", "title": "New COVID-19 vaccine shows promise in monkeys. Next step: humans. - Live Science", "description": "The vaccine has entered early clinical trials in human volunteers.", "url": "https://www.livescience.com/experimental-covid19-vaccine-protects-monkeys.html", "urlToImage": null, "publishedAt": "2020-04-24T18:23:26Z", "content": "An experimental COVID-19 vaccine protected monkeys from catching the viral infection, according to an unreviewed report. The new vaccine has now entered clinical trials in China\r\n to test the drug in humans.     \r\nAlthough the animal study, posted April 19 to… [+5914 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Patrick Wintour", "title": "US stays away as world leaders agree action on Covid-19 vaccine - The Guardian", "description": "Video meeting seen as global endorsement of WHO and sign of Trump’s isolation on world stage", "url": "https://www.theguardian.com/world/2020/apr/24/us-stays-away-as-world-leaders-agree-action-on-covid-19-vaccine", "urlToImage": null, "publishedAt": "2020-04-24T18:23:01Z", "content": "Global leaders have pledged to accelerate cooperation on a coronavirus vaccine and to share research, treatment and medicines across the globe. But the United States did not take part in the World Health Organization initiative, in a sign of Donald Trumps inc… [+3604 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Hospital staff's humanity and love made me proud to be able to tell their story, writes Emily Morgan - ITV News", "description": "There is something very sobering about going into an Intensive Care Unit. But so much more so today.\n\nWhat struck me first, as we walked into Kettering Hospital's ICU, was the silence. Clinicians in hazmat suits huddle around sleeping patients, monitoring oxy…", "url": "https://www.itv.com/news/2020-04-24/hospital-staff-s-humanity-and-love-made-me-proud-to-be-able-to-tell-their-story/", "urlToImage": null, "publishedAt": "2020-04-24T17:57:00Z", "content": null}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nJessica Carpani", "title": "The way out of lockdown: the strategies evaluated - Telegraph.co.uk", "description": "As other countries begin to ease restrictions, we look at the ways of doing so and analyse how each strategy could work for the UK", "url": "https://www.telegraph.co.uk/news/2020/04/24/way-lockdown-strategies-evaluated/", "urlToImage": null, "publishedAt": "2020-04-24T17:52:00Z", "content": "Grant Shapps, the Transport Secretary, has said businesses should be asking themselves why everybody has to travel in the rush hour.\r\nSport and cultural activities could also look very different and there is also consideration as to whether theatres could ope… [+3317 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nHarry de Quetteville,", "title": "How the coronavirus lockdown will change our lives forever - The Telegraph", "description": "The old and the vulnerable have little to look forward to as the race to find an effective way to battle Covid-19 becomes more intense", "url": "https://www.telegraph.co.uk/news/2020/04/24/coronavirus-lockdown-will-change-lives-forever/", "urlToImage": null, "publishedAt": "2020-04-24T17:47:36Z", "content": "But perhaps the most positive news of all came in Oxford, where the first of 510 volunteers received a modified cold virus from chimpanzees known as ChAdOx1 nCoV-19. That is a mouthful. Yet to those many experts who believe that only a successful vaccine will… [+3465 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Lancashire victim's touching farewell to fiancee - BBC News", "description": "Ricky McKeag thanked his partner Katie Martin \"for the best life\" before he was placed in a coma.", "url": "https://www.bbc.co.uk/news/uk-england-lancashire-52417589", "urlToImage": null, "publishedAt": "2020-04-24T17:34:58Z", "content": "Image copyrightFamily handoutImage caption\r\n The couple were hoping to get married\r\nA 29-year-old man who died after testing positive for coronavirus messaged his fiancee to say \"thank you for the best life\" before he went into a coma.\r\nRichard McKeag, known … [+1796 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Deborah Haynes", "title": "Coronavirus: UK troops given insect repellent Citriodiol as part of 'enhanced' protection - Sky News", "description": "A disinfectant spray to be used after coming into contact with someone who has the virus is also being given out.", "url": "https://news.sky.com/story/coronavirus-uk-troops-given-insect-repellent-citriodiol-as-part-of-enhanced-protection-11978318", "urlToImage": null, "publishedAt": "2020-04-24T17:33:59Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Evening update as key worker testing website to reopen - BBC News", "description": "Five things you need to know about the coronavirus outbreak this evening.", "url": "https://www.bbc.co.uk/news/uk-52414795", "urlToImage": null, "publishedAt": "2020-04-24T17:18:02Z", "content": "Here are five things you need to know about the coronavirus outbreak this Friday evening. We'll have another update on Saturday morning.\r\n1. Testing website to reopen\r\nThe government's new website for key workers to book coronavirus tests will reopen later, t… [+3165 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Emma Brazell", "title": "Scientists detect coronavirus on particles of air pollution - Metro.co.uk", "description": "It raises a suggestion that higher levels of particle pollution could lead to higher rates of infection - for example in regions of northern Italy.", "url": "https://metro.co.uk/2020/04/24/scientists-detect-coronavirus-particles-air-pollution-12605944/", "urlToImage": null, "publishedAt": "2020-04-24T17:13:01Z", "content": "The new medical work is preliminary and it is not confirmed if the virus remains viable on pollution particles (Picture: Rex/ PA)\r\nCoronavirus has been detected on particles of air pollution by scientists looking into whether the illness could be carried this… [+2081 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Jessica Murray", "title": "A 'nutional' health service, TikTok dancing at 82, and green fingers for all - The Guardian", "description": "Squirrels enjoy an assault course, care home residents discover TikTok, while a keen gardener spreads the love", "url": "https://www.theguardian.com/news/2020/apr/24/a-nutional-health-service-tiktok-dancing-at-82-and-green-fingers-for-all", "urlToImage": null, "publishedAt": "2020-04-24T16:38:38Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NHS Married Couple Suing the Government for Lack of PPE | Good Morning Britain - Good Morning Britain", "description": "Subscribe now for more! http://bit.ly/1NbomQa Two doctors are launching legal action against the government's advice over personal protective equipment. Meen...", "url": "https://www.youtube.com/watch?v=hipPSbGoU60", "urlToImage": null, "publishedAt": "2020-04-24T16:18:02Z", "content": "Subscribe now for more! http://bit.ly/1NbomQaTwo doctors are launching legal action against the government's advice over personal protective equipment. Meenal Viz and Nishant Joshi, who are married and expecting a baby, have been exposed to patients with COVI… [+786 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Sathnam Sanghera", "title": "Coronavirus and ethnicity: black and Asian NHS medics on the front line - The Times", "description": "My last significant social engagement before the coronavirus lockdown was a school reunion dinner. For the first time since I left Wolverhampton Grammar School 25 years ago, initially for a grim", "url": "https://www.thetimes.co.uk/article/coronavirus-and-ethnicity-black-and-asian-nhs-medics-on-the-front-line-dhznrc3kc", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "My last significant social engagement before the coronavirus lockdown was a school reunion dinner. For the first time since I left Wolverhampton Grammar School 25 years ago, initially for a grim summer job in a local hospital laundry, and then Cambridge Unive… [+451 chars]"}, {"source": {"id": null, "name": "Mylondon.news"}, "author": "Qasim Peracha", "title": "London coronavirus: The hospitals where 126 more patients have died as London death toll hits 4,426 - MyLondon", "description": "UK deaths now account for one in 10 coronavirus deaths across the world", "url": "https://www.mylondon.news/news/zone-1-news/london-coronavirus-hospitals-126-more-18146984", "urlToImage": null, "publishedAt": "2020-04-24T15:59:00Z", "content": "A further 126 deaths from coronavirus have been recorded in London, taking the total death toll in the capital's hospitals to 4,426. \r\nNationally, the death toll reached 19,506 deaths in hospitals across the country after 684 more deaths were registered accor… [+5100 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Jon Henley", "title": "Sweden queries basis of lockdowns as Germany keeps its guard up - The Guardian", "description": "Looser regime means Sweden is better placed to face second wave, says chief epidemiologist", "url": "https://www.theguardian.com/world/2020/apr/24/sweden-queries-basis-of-lockdowns-as-germany-keeps-its-guard-up", "urlToImage": null, "publishedAt": "2020-04-24T15:55:49Z", "content": "Sweden questioned the scientific basis of other EU countries strict coronavirus lockdowns as Germany said its number of cases needed to fall from about 2,000 to a few hundred a day before it could ease restrictions further.\r\nAs several European countries cont… [+4375 chars]"}, {"source": {"id": null, "name": "Channel4.com"}, "author": null, "title": "Revealed: Elderly woman dies after being 'refused admission' from Glasgow hospital - Channel 4 News", "description": "A woman has died after allegedly being refused admission to Glasgow’s Queen Elizabeth University Hospital, Channel 4 News can reveal.", "url": "https://www.channel4.com/news/revealed-elderly-woman-dies-after-being-refused-admission-from-glasgow-hospital", "urlToImage": null, "publishedAt": "2020-04-24T15:48:12Z", "content": "Natalie Wolfson, 85, a resident at Westacres Care Home in East Renfrewshire, passed away the day after her GP allegedly asked for her to be admitted to hospital for hydration and pain relief after she fell and fractured her upper arm.\r\nWestacres Care Home man… [+4787 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Carmen Aguilar-Garcia, data journalist, and Alice Udale-Smith, news reporter", "title": "Coronavirus: England's 'excess deaths' among the highest in Europe - Sky News", "description": "New mortality figures suggest England has been as badly affected as Spain and Italy by the COVID-19 outbreak.", "url": "https://news.sky.com/story/coronavirus-englands-excess-deaths-among-the-highest-in-europe-11977394", "urlToImage": null, "publishedAt": "2020-04-24T14:49:45Z", "content": null}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Jacob Jarvis", "title": "Coronavirus death toll in UK hospitals hits 19,506 as figure rises by 768 - Evening Standard", "description": "", "url": "https://www.standard.co.uk/news/uk/uk-coronavirus-hospital-death-toll-hits-19506-a4423521.html", "urlToImage": null, "publishedAt": "2020-04-24T14:36:12Z", "content": "The coronavirus death toll in UK hospitals has hit 19,506.\r\nThe new figure, released by the Department of Health, was accurate as of 5pm yesterday.\r\nIt is up 768 from the day before, when the figure was at 18,738.\r\nThe Department of Health said there had been… [+4502 chars]"}, {"source": {"id": null, "name": "Lincolnshirelive.co.uk"}, "author": "Matty Hewitt", "title": "Five more people die from coronavirus at Lincolnshire hospitals - Lincolnshire Live", "description": "Rest in peace", "url": "https://www.lincolnshirelive.co.uk/news/local-news/coronavirus-cases-lincolnshire-deaths-nhs-4076203", "urlToImage": null, "publishedAt": "2020-04-24T14:18:08Z", "content": "Five more people have died in Lincolnshire hospitals after testing positive for coronavirus.\r\nTheir deaths take the total number of people to have died from the virus in Lincolnshire to 91 as of today, Friday, April 24. \r\nThree women, aged 67, 69 and 85, and … [+1373 chars]"}, {"source": {"id": null, "name": "Shropshirestar.com"}, "author": "Dominic Robertson", "title": "Four more coronavirus deaths confirmed in Shropshire as UK death toll passes 19000 - shropshirestar.com", "description": "A further four people have been confirmed to have died with coronavirus in Shropshire.", "url": "https://www.shropshirestar.com/news/health/coronavirus-covid19/2020/04/24/four-more-coronavirus-deaths-confirmed-in-county/", "urlToImage": null, "publishedAt": "2020-04-24T13:35:00Z", "content": "All four patients were in the care of Shrewsbury &amp; Telford Hospital NHS Trust (SaTH) and died after testing positive for Covid-19, NHS England confirmed today. \r\nIt takes the total who have now died at the trust, which manages Royal Shrewsbury Hospital an… [+1529 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Lynn Love", "title": "Scotland's youngest coronavirus patient thanks NHS for saving her life in cute clap for carers - Daily Record", "description": "Peyton Maguire was diagnosed with Covid-19 at just three-weeks-old after being born eight weeks premature on March 26.", "url": "https://www.dailyrecord.co.uk/news/scottish-news/scotlands-youngest-coronavirus-patient-thanks-21919993", "urlToImage": null, "publishedAt": "2020-04-24T13:02:43Z", "content": "A four-week-old baby, thought to be Scotland's youngest coronavirus patient, thanked NHS staff for saving her life in her first 'Clap for Carers'. \r\n Little Peyton Maguire was diagnosed with Covid-19 at just three-weeks-old after being born eight weeks premat… [+2090 chars]"}, {"source": {"id": null, "name": "Expressandstar.com"}, "author": "Thomas Parkes", "title": "How nurse sculpture has become new landmark on Cinder Bank island - expressandstar.com", "description": "A steel sculpture of a nurse has been installed at an island in Dudley to help show solidarity with frontline workers.", "url": "https://www.expressandstar.com/news/local-hubs/dudley/2020/04/24/nurse-sculpture-takes-pride-of-place-on-cinder-bank-island/", "urlToImage": null, "publishedAt": "2020-04-24T12:57:00Z", "content": "Liam Harris, who works at family-run Colstan Profile Ltd, thought up the idea during his spare time at work. \r\nThe piece has has now taken pride-of-place on Cinder Bank island and has been widely praised online. \r\n A steel nurse sculpture designed by brothers… [+1520 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Anna Lewis", "title": "Blackweir Bridge in Cardiff shut after people ignored coronavirus social distancing rules - Wales Online", "description": "Cardiff council said it,together with the police, do not have the resources to keep monitoring the bridge after people ignored the rules", "url": "https://www.walesonline.co.uk/news/wales-news/blackweir-bridge-cardiff-closed-coronavirus-18144055", "urlToImage": null, "publishedAt": "2020-04-24T12:17:39Z", "content": "Blackweir Bridge in Cardiff's Bute Park is to be shut temporarily after people ignored social distancing rules. \r\nCardiff Council said the decision to close the popular bridge was made after people continued to ignore instructions to cross in one direction at… [+1985 chars]"}, {"source": {"id": null, "name": "Yorkpress.co.uk"}, "author": "Haydn Lewis", "title": "CORONAVIRUS: Police urge day-trippers to stay home this weekend - York Press", "description": "DAY trippers are being urged to stay home this weekend as more good weather is expected.", "url": "https://www.yorkpress.co.uk/news/18403468.coronavirus-police-urge-day-trippers-stay-home/", "urlToImage": null, "publishedAt": "2020-04-24T11:51:00Z", "content": "DAY trippers are being urged to stay home this weekend as more good weather is expected.\r\nNorth Yorkshire Police is again stressing the importance of staying home and continuing the fight against COVID-19.\r\nAnd coastguards have urged everyone to stay away fro… [+4340 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "'How do you sleep at night?': PPE company accused of 'blatant profiteering' by NHS boss for 725% price hike - ITV News", "description": "A company selling personal protective equipment (PPE) has been accused of \"blatant profiteering\" after offering an NHS trust the equipment at 825% of the normal price.\n\nCEO of East Suffolk and North Essex NHS Foundation Trust (ESNEFT) Nick Hulme, told ITV New…", "url": "https://www.itv.com/news/2020-04-24/how-do-you-sleep-at-night-ppe-company-accused-of-blatant-profiteering-by-nhs-boss-for-725-price-hike/", "urlToImage": null, "publishedAt": "2020-04-24T11:09:00Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Rowena Mason", "title": "Sick care home residents not tested despite UK government pledge - The Guardian", "description": "Leaked email reveals delay 10 days after Matt Hancock said any resident with symptoms would be checked for coronavirus", "url": "https://www.theguardian.com/world/2020/apr/24/sick-care-home-residents-not-tested-despite-uk-government-pledge", "urlToImage": null, "publishedAt": "2020-04-24T10:50:42Z", "content": "The government is failing to test sick care home residents for coronavirus 10 days after Matt Hancock promised that anyone in residential care would be checked if symptomatic, a leaked email has revealed.\r\nWith a worsening crisis in care homes for the elderly… [+3911 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Robin McKie", "title": "Coronavirus: what have scientists learned about Covid-19 so far? - The Guardian", "description": "Medical researchers have been studying everything we know about Covid-19. What have they learned – and is it enough to halt the pandemic?", "url": "https://www.theguardian.com/world/2020/apr/24/coronavirus-what-have-scientists-learned-about-covid-19-so-far", "urlToImage": null, "publishedAt": "2020-04-24T10:16:00Z", "content": "Coronaviruses have been causing problems for humanity for a long time. Several versions are known to trigger common colds and more recently two types have set off outbreaks of deadly illnesses: severe acute respiratory syndrome (Sars) and Middle East respirat… [+9271 chars]"}, {"source": {"id": null, "name": "Edp24.co.uk"}, "author": "Abigail Nicholson", "title": "We must be told when we can see our relatives again, says health expert | Politics - Eastern Daily Press", "description": "Clear guidance on whether people can safely visit family and friends needs to be ready as soon as any easing of coronavirus lockdown rules is announced, a public health expert has warned.", "url": "https://www.edp24.co.uk/news/politics/must-be-told-when-we-can-see-relatives-again-1-6621960", "urlToImage": null, "publishedAt": "2020-04-24T10:00:00Z", "content": "PUBLISHED: 11:00 24 April 2020\r\nAbigail Nicholson\r\nClear guidance on whether people can safely visit family and friends needs to be ready as soon as any easing of coronavirus lockdown rules is announced, a public health expert has warned. Picture: Getty Image… [+2742 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Claire Anderson", "title": "Matt Hancock loses his temper again in BBC interview - 'Stop interrupting me!' - Express", "description": "MATT HANCOCK was caught up in another brutal clash with BBC's Mishal Husain today over the UK's coronavirus lockdown measures as he called her out for interrupting him.", "url": "https://www.express.co.uk/news/uk/1273334/matt-hancock-coronavirus-uk-lockdown-bbc-radio-4-today-mishal-husain-covid-19", "urlToImage": null, "publishedAt": "2020-04-24T09:50:27Z", "content": null}, {"source": {"id": "independent", "name": "Independent"}, "author": "Matt Mathers", "title": "Do I need to start taking vitamin D during lockdown? - The Independent", "description": "Public Health England has updated its advice on vitamin D", "url": "https://www.independent.co.uk/life-style/health-and-families/health-news/coronavirus-vitamin-d-supplements-benefits-tablets-covid-19-health-advice-a9480386.html", "urlToImage": null, "publishedAt": "2020-04-24T09:36:32Z", "content": "Millions of people across the UK are being forced to spend more time indoors as the Covid-19 lockdown continues.\r\nIncreased time spent at home means that many of us may not be getting the same amount of vitamin D that we normally would by being outside.\r\nIn r… [+31662 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "'Amazing doctor' who was passionate about caring for babies and their families dies after contracting Covid-19 - ITV News", "description": "A Consultant Neonatologist has died after contracting Covid-19, bringing the number of deaths of NHS workers who had Coronavirus in the Midlands to 13.\n\nDr Vishna Rasiah worked at Birmingham Women's and Children's NHS Foundation Trust and was also the clinica…", "url": "https://www.itv.com/news/central/2020-04-24/amazing-doctor-who-was-passionate-about-caring-for-babies-and-their-families-dies-after-contracting-covid-19/", "urlToImage": null, "publishedAt": "2020-04-24T09:03:00Z", "content": null}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Neil Shaw", "title": "How to get tested for coronavirus with new Government site - Cornwall Live", "description": "A help desk has been established to aid the process, while mobile units run by the Army are travelling around the country to where they are needed, such as care homes.", "url": "https://www.walesonline.co.uk/news/uk-news/how-tested-coronavirus-new-government-18142652", "urlToImage": null, "publishedAt": "2020-04-24T08:28:00Z", "content": "The Government has launched a new website which allows hundreds of thousands of people across the country to book themselves in for a coronavirus test. \r\nThe site is open to all essential workers - which covers a huge swathe of the population from frontline N… [+2770 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Cathy Owen", "title": "15 residents at single Welsh care home have died in a month - Wales Online", "description": "Staff at Tregwilym Lodge in Rogerstone, Newport, have been left devastated. None of the residents were tested for coronavirus but 14 reportedly had symptoms", "url": "https://www.walesonline.co.uk/news/wales-news/care-home-deaths-wales-coronavirus-18142381", "urlToImage": null, "publishedAt": "2020-04-24T08:09:39Z", "content": "Staff at a Welsh nursing home have been left devastated after the deaths of 15 residents in the space of just a month.\r\n Tests weren't carried out but 14 of the elderly residents at Tregwilym Lodge in Rogerstone, Newport, reportedly had coronavirus symptoms. … [+2667 chars]"}, {"source": {"id": null, "name": "Expressandstar.com"}, "author": null, "title": "Birmingham mother dies with coronavirus six days after giving birth - expressandstar.com", "description": "The family of a new mother who died in hospital without ever getting to hold her baby have spoken of their devastation.", "url": "https://www.expressandstar.com/news/health/coronavirus-covid19/2020/04/24/birmingham-mother-dies-in-hospital-six-days-after-giving-birth/", "urlToImage": null, "publishedAt": "2020-04-24T07:37:00Z", "content": "Fozia Hanif, who had tested positive for coronavirus, died at Birmingham's Heartlands Hospital on April 8 after her condition deteriorated following the birth of her son. \r\nThe 29-year-old - whose baby remains in hospital but has tested negative for Covid-19 … [+2426 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: What do the stats tell us in Wales? - BBC News", "description": "Where are the hot spots in Wales and what is happening in care homes?", "url": "https://www.bbc.co.uk/news/uk-wales-52380643", "urlToImage": null, "publishedAt": "2020-04-24T05:41:30Z", "content": "Image copyrightGetty ImagesImage caption\r\n Beaches such as this one in Rhyl are all-but deserted during lockdown restrictions\r\nWhat can different statistics tell us about coronavirus in Wales so far?\r\nWe seem to be bombarded with different measures, but what … [+10081 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "David Rhodes", "title": "Coronavirus: Middlesbrough inhabitants most 'at risk' of dying - BBC News", "description": "A think tank says people in Middlesbrough have the highest chance of dying from Covid-19.", "url": "https://www.bbc.com/news/uk-england-tees-52354430", "urlToImage": null, "publishedAt": "2020-04-23T23:52:00Z", "content": "Let us know you agree to cookies\r\nWe use cookies to give you the best online experience. Please let us know if you agree to all of these cookies.\r\nImage caption\r\n Parks in Middlesbrough remain closed\r\nThe Mayor of Middlesbrough recently ordered all of the tow… [+6161 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: 'I faked having Covid-19 on Facebook and got arrested' - BBC News", "description": "Across the world police are chasing down alleged symptom-fakers who are being accused of triggering panic.", "url": "https://www.bbc.com/news/technology-52397294", "urlToImage": null, "publishedAt": "2020-04-23T23:21:30Z", "content": "Image copyrightTyler County Sheriff's Office/ GettyImage caption\r\n Mr Brandin's picture released by police\r\nMichael Lane Brandin knew his Facebook post would cause a stir.\r\nWhat he didn't realise was that he'd be arrested, lose his job and face a trial that c… [+4279 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Will Pavia, David Charter, Henry Zeffman", "title": "Only a tenth of New York ventilator patients survive coronavirus - The Times", "description": "Little more than a tenth of Covid-19 patients who have been put on ventilators survive, according to the largest and most comprehensive study of sufferers in the United States who were admitted to", "url": "https://www.thetimes.co.uk/article/only-a-tenth-of-new-york-ventilator-patients-survive-coronavirus-920vg6dtp", "urlToImage": null, "publishedAt": "2020-04-23T23:01:00Z", "content": "Little more than a tenth of Covid-19 patients who have been put on ventilators survive, according to the largest and most comprehensive study of sufferers in the United States who were admitted to hospital.\r\nVentilators have been held up as the last hope for … [+492 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Kat Lay, Health Correspondent | Chris Smyth, Whitehall Editor", "title": "Virus-free 'hubs' to take over cancer care as referrals drop - The Times", "description": "A network of “Covid-free hubs” will treat cancer patients, it has been announced, as the NHS launches a “help us help you” campaign to get people back to hospitals.Amid growing fears about the risk to", "url": "https://www.thetimes.co.uk/article/virus-free-hubs-to-take-over-cancer-care-as-referrals-drop-f229579kn", "urlToImage": null, "publishedAt": "2020-04-23T23:01:00Z", "content": "A network of Covid-free hubs will treat cancer patients, it has been announced, as the NHS launches a help us help you campaign to get people back to hospitals.\r\nAmid growing fears about the risk to patients with other conditions as the health service focuses… [+487 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nAnna Mikhailova,", "title": "Scarves are no substitute for face masks in protecting against coronavirus, experts say - Telegraph.co.uk", "description": "Worries over supplies of masks for medical workers means Government advice could be to use alternative ways of covering their faces", "url": "https://www.telegraph.co.uk/politics/2020/04/23/scarves-no-substitute-face-masks-protecting-against-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-23T20:30:00Z", "content": "The governments plan to recommend scarves instead of face masks will not offer people the same level of protection from Covid-19, experts have warned.\r\nMinisters are considering the recommendation by the Scientific Advisory Group for Emergencies (Sage), which… [+1150 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nRobert Mendick,", "title": "UK's contact tracing strategy questioned as scientists say army of 100,000 will be needed - Telegraph.co.uk", "description": "Ensuring a critical 48-hour turnaround of the tests in the post may prove problematic, leaving results invalid", "url": "https://www.telegraph.co.uk/news/2020/04/23/uks-contact-tracing-strategy-questioned-scientists-say-army/", "urlToImage": null, "publishedAt": "2020-04-23T20:00:00Z", "content": "\"As we look ahead, this is critical to keep the virus under control,\" he said.\r\nThe aim would be to track more than 80 per cent of people with whom an infected person had been in contact within 24 hours of diagnosis. Infected people and those they had contact… [+2373 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Britons come together to Clap for our Carers and thank the NHS - The Telegraph", "description": "People across the UK came out on their doorsteps, balconies, windows and gardens to clap for our cares for the fifth week running. For all the latest on coro...", "url": "https://www.youtube.com/watch?v=XZo5XuydB9M", "urlToImage": null, "publishedAt": "2020-04-23T19:45:53Z", "content": "People across the UK came out on their doorsteps, balconies, windows and gardens to clap for our cares for the fifth week running.\r\nFor all the latest on coronavirus, head here: https://www.telegraph.co.uk/global-he...\r\nGet the latest headlines: https://www.t… [+228 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Henry McDonald, Pamela Duncan", "title": "Lockdown may be lifted earlier in Northern Ireland than rest of UK - The Guardian", "description": "Arlene Foster makes statement as it emerges extra critical care capacity not expected to be needed", "url": "https://www.theguardian.com/world/2020/apr/23/lockdown-may-be-lifted-earlier-in-northern-ireland-than-rest-of-uk", "urlToImage": null, "publishedAt": "2020-04-23T19:09:46Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Frances Perraudin, Rowena Mason", "title": "NHS supplier urges public not to buy out medical masks - The Guardian", "description": "UK distributor of PPE ensures sales of its clinical masks are ‘not diverted’ from key workers", "url": "https://www.theguardian.com/world/2020/apr/23/nhs-supplier-urges-public-not-to-buy-out-medical-masks", "urlToImage": null, "publishedAt": "2020-04-23T18:44:59Z", "content": "The public has been urged not to buy medical face masks so that stocks can be preserved for the NHS, following scientists advice to the government saying cloth coverings could be worn to stem the spread of coronavirus.\r\nThe advice from Arco, one of the UKs le… [+4385 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Paul Dinsdale For Mailonline Vanessa Chalmers Health Reporter For Mailonline", "title": "NHS trusts buy their own antibody kits from Dutch firm to test staff - Daily Mail", "description": "Hundreds of the Biozek tests have already been used on NHS staff in London, Manchester and Leicester as hospitals face a surge in demand at a time when up to a fifth of the workforce are off sick.", "url": "https://www.dailymail.co.uk/news/article-8250133/NHS-trusts-buy-antibody-kits-Dutch-firm-test-staff.html", "urlToImage": null, "publishedAt": "2020-04-23T18:32:57Z", "content": "Five trusts in England are in talks with Dutch firm Biozek Medical to buy thousands of its rapid finger-prick tests which give a diagnosis in a matter of minutes\r\nNHS trusts have resorted to buying coronavirus antibody tests overseas in a bid to get their sta… [+13487 chars]"}, {"source": {"id": null, "name": "Herefordtimes.com"}, "author": "James Thomas", "title": "Coronavirus: ONS figures reveal more deaths in Herefordshire - Hereford Times", "description": "AT least three deaths linked to coronavirus in Herefordshire happened outside of hospital, new figures suggest.", "url": "https://www.herefordtimes.com/news/18401691.coronavirus-ons-figures-reveal-deaths-herefordshire/", "urlToImage": null, "publishedAt": "2020-04-23T18:01:33Z", "content": "AT least three deaths linked to coronavirus in Herefordshire happened outside of hospital, new figures suggest.\r\nOffice for National Statistics (ONS) data shows that in Herefordshire, 18 deaths involving Covid-19 were provisionally registered up to April 10.\r… [+2366 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Shaun Lintern", "title": "Hospitals running low on kidney dialysis equipment needed to keep coronavirus patients alive - The Independent", "description": "Exclusive: A third of coronavirus patients need their blood to be filtered as a result of kidney damage, but hospitals are reporting shortages as demand for the specialist kits rise", "url": "https://www.independent.co.uk/news/health/coronavirus-kidney-dialysis-nhs-intensive-care-filter-a9480676.html", "urlToImage": null, "publishedAt": "2020-04-23T17:22:17Z", "content": "Hospitals are running out of vital kidney dialysis blood filtering kits that are needed to keep up to a third of Covid-19 patients alive in another NHS shortage that threatens to compromise coronavirus care.\r\nDoctors told The Independent they were already und… [+4913 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": null, "title": "LIVE: Health secretary giving daily coronavirus briefing | Politics News - Sky News", "description": "Deaths of UK hospital patients with COVID-19 reach 18,738, but social distancing is said to be working.", "url": "https://news.sky.com/story/live-health-secretary-gives-daily-coronavirus-briefing-11977730", "urlToImage": null, "publishedAt": "2020-04-23T16:07:30Z", "content": null}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Oliver Wright", "title": "Coronavirus 'nearly put Dominic Cummings in hospital' | News - The Times", "description": "Dominic Cummings’s wife has described how he collapsed after suffering coronavirus symptoms and was nearly taken to hospital when his oxygen levels dropped.Mary Wakefield, a writer for The Spectator", "url": "https://www.thetimes.co.uk/article/coronavirus-nearly-left-dominic-cummings-in-hospital-3k2zrjdd3", "urlToImage": null, "publishedAt": "2020-04-23T16:00:00Z", "content": "Dominic Cummingss wife has described how he collapsed after suffering coronavirus symptoms and was nearly taken to hospital when his oxygen levels dropped.\r\nMary Wakefield, a writer for The Spectator, said that Boris Johnsons most senior adviser had rushed ho… [+449 chars]"}, {"source": {"id": null, "name": "Lep.co.uk"}, "author": "Iain Lynn", "title": "Two pet cats test positive to coronavirus - Lancashire Post", "description": "Two pet cats in New York state have tested positive for the coronavirus, marking the first confirmed cases in companion animals in the US, federal officials said.", "url": "https://www.lep.co.uk/health/coronavirus/two-pet-cats-test-positive-coronavirus-2547776", "urlToImage": null, "publishedAt": "2020-04-23T16:00:00Z", "content": "The cats, which had mild respiratory illnesses and are expected to recover, are thought to have contracted the virus from people in their households or neighbourhoods, the US Department of Agriculture (USDA) and the federal Centres for Disease Control and Pre… [+3049 chars]"}, {"source": {"id": null, "name": "Inverness-courier.co.uk"}, "author": "Philip Murray", "title": "Three new Covid-19 coronavirus cases confirmed in the Highlands, but numbers in hospital fell; mirroring a similar fall across Scotland as a whole - Inverness Courier", "description": "Three new cases of Covid-19 have been confirmed in the NHS Highland area, taking the overall total to 214.", "url": "https://www.inverness-courier.co.uk/news/new-highland-covid-19-cases-confirmed-amid-a-slight-drop-in-hospital-patient-numbers-197600/", "urlToImage": null, "publishedAt": "2020-04-23T13:21:00Z", "content": "Coronavirus news.\r\nTHREE new cases of Covid-19 have been confirmed in the NHS Highland area, taking the overall total to 214.\r\nIt came as Scotland recorded another 371 cases, taking the overall number since the outbreak began to 9409. Sadly the death toll als… [+1227 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Kit Heren", "title": "Nose cells identified as entry points for coronavirus - Evening Standard", "description": "", "url": "https://www.standard.co.uk/news/health/nose-cells-coronavirus-entry-infection-a4422226.html", "urlToImage": null, "publishedAt": "2020-04-23T12:37:03Z", "content": "Two nose cells have been identified as the first points at which Covid-19 enters the human body.\r\nScientists from the Wellcome Sanger Institute in the UK and several other universities have found that these cells contain high levels of the protein that corona… [+1661 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Who will take part in coronavirus tracking testing and what is the aim? - ITV News", "description": "Twenty thousands households in England will be asked to take part in a study to track the spread of Covid-19.\n\nThe aim is to further understand the rate of infection and the number of people who have developed immunity across the UK.\n\nWho will take part?\n\nPar…", "url": "https://www.itv.com/news/2020-04-23/who-will-take-part-coronavirus-tracking-test-and-what-is-the-aim/", "urlToImage": null, "publishedAt": "2020-04-23T12:21:00Z", "content": "Twenty thousands households in England will be asked to take part in a study to track the spread of Covid-19.\r\nThe aim is to further understand the rate of infection and the number of people who have developed immunity across the UK.\r\nWho will take part?\r\nPar… [+1803 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Nurse dies in hospital after contracting coronavirus - BBC News", "description": "Tributes have been paid to Angie Cunningham, who worked for NHS Borders for more than 30 years.", "url": "https://www.bbc.com/news/uk-scotland-south-scotland-52398523", "urlToImage": null, "publishedAt": "2020-04-23T12:15:14Z", "content": "Tributes have been paid to a nurse who died in Borders General Hospital from Covid-19.\r\nAngie Cunningham died on Wednesday in the hospital's intensive care unit\r\nA joint statement from NHS Borders and her family described Ms Cunningham as a \"much loved wife, … [+359 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nJordan Kelly-Linden", "title": "University of Oxford Covid-19 vaccine: everything we know so far - Telegraph.co.uk", "description": "A million doses of their experimental coronavirus vaccine could be ready as early as September, Oxford scientists say", "url": "https://www.telegraph.co.uk/global-health/science-and-disease/oxford-university-coronavirus-vaccine-covid/", "urlToImage": null, "publishedAt": "2020-04-23T10:27:00Z", "content": "A potential coronavirus vaccine being developed at the University of Oxford will be trialled on people from Thursday, Matt Hancock revealed at Tuesday's Government briefing.\r\nThe vaccine project, which is being run by the Jenner Institute and Oxford Vaccine G… [+2389 chars]"}, {"source": {"id": null, "name": "Thescottishsun.co.uk"}, "author": "Catriona Graffius", "title": "Coronavirus Scotland: Tributes for ‘much loved’ Borders nurse and great-granny who died from Covid-19 - The Scottish Sun", "description": "", "url": "http://www.thescottishsun.co.uk/news/scottish-news/5522555/coronavirus-scotland-borders-nurse-grandmother-dies/", "urlToImage": null, "publishedAt": "2020-04-23T10:23:26Z", "content": "A 'MUCH LOVED' Borders nurse and great-granny has tragically died from coronavirus. \r\nTributes have now flooded in for Angie Cunningham who passed away yesterday in the ICU at the Borders General Hospital from the virus. \r\n Read our coronavirus live blog for … [+1105 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Shivali Best", "title": "Three key signs to distinguish coronavirus from your allergy symptoms - Mirror Online", "description": "Amid the coronavirus pandemic, many people are concerned that their allergy symptoms are actually a sign of COVID-19. However, there are three key signs to distinguish allergies from coronavirus", "url": "https://www.mirror.co.uk/science/coronavirus-three-key-signs-distinguish-21913144", "urlToImage": null, "publishedAt": "2020-04-23T09:13:13Z", "content": "This week, both temperatures and pollen counts across the UK are set to soar, spelling disaster for the 20% of Brits with hay fever. \r\n Amid the coronavirus pandemic, many people could be concerned that their allergy symptoms are actually a sign of COVID-19. … [+1737 chars]"}, {"source": {"id": null, "name": "Wired.co.uk"}, "author": "Sabrina Weiss", "title": "Can the UK avoid a deadly second wave of coronavirus? - Wired.co.uk", "description": "With the vast majority of people in the UK likely still vulnerable to Covid-19 and thoughts turning to easing the lockdown, the threat of a second wave is looming", "url": "https://www.wired.co.uk/article/coronavirus-uk-second-wave-lockdown", "urlToImage": null, "publishedAt": "2020-04-23T05:23:17Z", "content": "The UK appears to have reached the peak of its coronavirus outbreak. On April 22 health secretary Matt Hancock told parliament that the UK's lockdown measures that have been in place for four-and-half weeks appear to be having an effect as the number of daily… [+6952 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Sophie Harris", "title": "Hay fever symptoms: Is a persistent cough a sign? Expert reveals what to look out for - Express", "description": "HAY FEVER is an allergic reaction to pollen and many Brits suffer with it every year. There are many different symptoms that come with the allergy. However coronavirus and hay fever do share similar symptoms like a cough. Here is how to tell the difference be…", "url": "https://www.express.co.uk/life-style/health/1272668/hayfever-symptoms-cough-persistent-coronavirus-covid-19", "urlToImage": null, "publishedAt": "2020-04-23T05:00:15Z", "content": null}]}