{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Elsom For Mailonline", "title": "Cabinet ministers were warned last year about a coronavirus pandemic - Daily Mail", "description": "The National Security Risk Assessment highlighted the devastating social and economic costs of a major disease outbreak and was signed off by chief scientific adviser Sir Patrick Vallance.", "url": "https://www.dailymail.co.uk/news/article-8255043/Cabinet-ministers-warned-year-coronavirus-pandemic.html", "urlToImage": null, "publishedAt": "2020-04-25T05:22:54Z", "content": "Ministers were warned last year of the grave consequences a future pandemic would unleash on the UK, a leaked Cabinet Office briefing has revealed. \r\nTens of thousands of deaths, crippling economic costs and creaking public services were predicted in the 2019… [+10342 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Inzamam Rashid", "title": "Coronavirus: Intensive care patients given iPads to speak to relatives - Sky News", "description": "In the most tragic cases the devices will be used by patients saying goodbye to their loved ones for the last time.", "url": "https://news.sky.com/story/coronavirus-intensive-care-patients-given-ipads-to-speak-to-relatives-11978509", "urlToImage": null, "publishedAt": "2020-04-25T03:33:00Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Matt Atherton", "title": "Coronavirus warning - does your poo look like this? The texture that could be COVID-19 - Express", "description": "CORONAVIRUS is a deadly infection that's easily spread, and the disease has killed almost 20,000 people in the UK. You could be at risk of COVID-19 symptoms if you develop this mild sign when you go to the toilet. What texture is your poo, and should you be c…", "url": "https://www.express.co.uk/life-style/health/1273471/coronavirus-symptoms-signs-covid-19-infection-toilet-loose-poo-diarrhoea", "urlToImage": null, "publishedAt": "2020-04-25T03:01:37Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Shaun Wooller", "title": "Blood plasma from coronavirus survivors will be given to 5,000 NHS patients a week in new trial - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11475979/blood-plasma-coronavirus-survivors-nhs-trial/", "urlToImage": null, "publishedAt": "2020-04-25T01:42:35Z", "content": "BLOOD plasma from survivors will be given to 5,000 coronavirus patients a week in an NHS trial.\r\nIt is hoped antibodies in blood from those who have recovered will clear the bug in others with a weaker immune response.\r\n Doctors hope antibodies in recovered p… [+2136 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Coronavirus dominates Saturday's newspaper front pages - ITV News - ITV News", "description": "Saturday’s papers are led by the possible easing of lockdown measures and a new treatment being trialled for Covid-19 patients.\n\nTreasury has issued a proposal to “get Britain back to work” with non-essential businesses to reopen in a “safe and practical way”…", "url": "https://www.itv.com/news/2020-04-25/what-the-papers-say-april-25/", "urlToImage": null, "publishedAt": "2020-04-25T01:38:00Z", "content": null}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Coronavirus latest news: Lockdown can be eased next month, ministers told - Telegraph.co.uk", "description": "The chief medical officer has old the Government that there is now &ldquo;scope for manoeuvre&rdquo; to ease some lockdown restrictions because the transmission rate of coronavirus is now within a manageable range.", "url": "https://www.telegraph.co.uk/global-health/science-and-disease/coronavirus-news-testing-kits-key-workers-deaths-cases/", "urlToImage": null, "publishedAt": "2020-04-25T01:14:56Z", "content": "Donald Trump took no questions during his daily White House briefing on Friday and spoke for just six minutes in a stark contrast to other recent press conferences. \r\nHours after having to clarify his comments about injecting disinfectant to treat coronavirus… [+1166 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "Philippa Roxby", "title": "Coronavirus: Plea for public to get medical care when they need it - BBC News", "description": "People needing help should not be put off by the coronavirus pandemic, say health professionals.", "url": "https://www.bbc.com/news/health-52417599", "urlToImage": null, "publishedAt": "2020-04-25T00:12:00Z", "content": "Let us know you agree to cookies\r\nWe use cookies to give you the best online experience. Please let us know if you agree to all of these cookies.\r\nImage copyright\r\n Getty Images\r\nPeople should seek medical care when they need it and not be put off by the coro… [+2781 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Emer Scully For Mailonline", "title": "Italy's coronavirus outbreak began in January, study shows - Daily Mail", "description": "Italy was the first western country where the number of Covid-19 cases dramatically shot up, leading to 12,000 deaths by the end of March. A study shows Covid-19 was in Italy from January.", "url": "https://www.dailymail.co.uk/news/article-8255233/Italys-coronavirus-outbreak-began-January-study-shows.html", "urlToImage": null, "publishedAt": "2020-04-24T23:56:31Z", "content": "Coronavirus arrived in Italy in January 'for sure' - despite the first case not being diagnosed until the end of February, says a scientist who presented a study on the subject today.\r\nExpert Stefano Merler, of the Bruno Kessler Foundation, told a news confer… [+5356 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Peter Stubley", "title": "Coronavirus: Identical twin sisters die within days of each other - The Independent", "description": "‘They always said they had come into the world together and would go out together as well’", "url": "https://www.independent.co.uk/news/uk/home-news/coronavirus-twin-sisters-death-nurses-southampton-hospital-katy-emma-davis-a9483481.html", "urlToImage": null, "publishedAt": "2020-04-24T23:48:47Z", "content": "Identical twin sisters who had worked as nurses at the same hospital died within days of each other after testing positive for coronavirus.\r\nKaty and Emma Davis, 37, both suffered from underlying health conditions and had been unwell for some time before cont… [+1667 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Tariq Tahir", "title": "James Bulger killer Jon Venables launches bid for early release from jail sentence for possessing child abuse - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11476757/james-bulger-jon-venables-early-release-jail/", "urlToImage": null, "publishedAt": "2020-04-24T22:51:11Z", "content": "ONE of James Bulgers killers has applied for early release from prison where he is serving  a sentence for possessing indecent pictures of children.\r\nJon Venables was aged 10 when he and and Robert Thompson snatched James from a shopping centre in Bootle, Mer… [+2347 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: test booking website swamped as thousands apply - BBC News - BBC News", "description": "A new government website, for key workers and their families to book coronavirus tests online, was forced to shut down for a time as it was swamped with requ...", "url": "https://www.youtube.com/watch?v=UI99jRFra_0", "urlToImage": null, "publishedAt": "2020-04-24T21:28:30Z", "content": "A new government website, for key workers and their families to book coronavirus tests online, was forced to shut down for a time as it was swamped with requests. \r\nAlmost 50,000 people in England tried to book a test just hours after the website launched. 16… [+530 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nKatherine Rushton", "title": "Care homes' soaring death rate blamed on 'reckless' order to take back Covid-19 patients - Telegraph.co.uk", "description": "The number of Covid-19 deaths in care homes was estimated by Care England to have reached 7,500 a week ago", "url": "https://www.telegraph.co.uk/news/2020/04/24/care-homes-ordered-take-patients-suspected-coronavirus-nhs-hospitals/", "urlToImage": null, "publishedAt": "2020-04-24T20:16:00Z", "content": "It added that coronavirus patients could be safely cared for as long as care home staff adhered to certain procedures, but that patients who had not been tested and showed no symptoms could be cared for as normal.\r\nA Whitehall official told the Telegraph that… [+904 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Rebecca Speare-Cole", "title": "Professor Chris Whitty says it is 'unlikely' the UK will stay in coronavirus lockdown 'indefinitely' - Evening Standard", "description": "", "url": "https://www.standard.co.uk/news/uk/uk-coronavirus-lockdown-end-prof-chris-whitty-a4423761.html", "urlToImage": null, "publishedAt": "2020-04-24T19:39:45Z", "content": "The UK is unlikely to remain in the current coronaviruslockdown pattern for the indefinite future, England's chief medical officer said today.\r\nProfessor Chris Whitty told Westminster's Science and Technology Committee said that the Government were not going … [+1910 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Betsi death report delay sparks investigation - BBC South East Wales", "description": "The north Wales health board reported all its deaths at once after issues with reporting systems.", "url": "https://www.bbc.co.uk/news/uk-wales-52419068", "urlToImage": null, "publishedAt": "2020-04-24T19:23:29Z", "content": "Image copyrightGetty ImagesImage caption\r\n Betsi Cadwaladr health board reported 84 deaths in the north Wales area on Thursday\r\nThe recording of the number of people who have died with coronavirus is being investigated after a Welsh health board failed to rep… [+2244 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Chelsea Ritschel", "title": "Cristina Cuomo criticised for taking Clorox baths in attempt to treat coronavirus - The Independent", "description": "She says she used alternative treatment to 'combat the radiation and metals in my system and oxygenate it'", "url": "https://www.independent.co.uk/life-style/cristina-cuomo-coronavirus-clorox-baths-a9483301.html", "urlToImage": null, "publishedAt": "2020-04-24T19:14:48Z", "content": "Cristina Cuomo - wife of CNN anchor Chris Cuomo - is facing criticism after sharing a list of alternative treatments that she claims helped her recover from coronavirus, which included taking Clorox baths.\r\nLast week, the TV newsman revealed that he had passe… [+4221 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Paralysed Ed Jackson reaches Everest staircase feat - BBC News", "description": "Former rugby player Ed Jackson has climbed 89,056 steps and made 2,783 trips up and down the stairs.", "url": "https://www.bbc.com/news/uk-england-somerset-52416450", "urlToImage": null, "publishedAt": "2020-04-24T19:09:39Z", "content": "Image copyrightWings for Life Image caption\r\n To simulate the ascent of Everest's 8,848m peak, Ed Jackson climbed 89,056 steps\r\nA paralysed ex-rugby player has climbed the equivalent height of Mount Everest on his parents' staircase.\r\nEd Jackson, from Bath, b… [+1708 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: Are ventilators the best option for critically ill patients? - Sky News", "description": "Medical professionals are questioning whether ventilators are the best option for treating patients who are in a critical condition. Studies carried out in N...", "url": "https://www.youtube.com/watch?v=DyagCpMX0tE", "urlToImage": null, "publishedAt": "2020-04-24T19:00:34Z", "content": "Medical professionals are questioning whether ventilators are the best option for treating patients who are in a critical condition. Studies carried out in New York in the US and Wuhan in China suggest the current death rate associated with the support system… [+781 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Weekend lockdowns - Turkey's coronavirus response - Channel 4 News", "description": "No country outside Europe and America has more coronavirus cases than Turkey, where numbers have overtaken China and Iran. (Subscribe: https://bit.ly/C4_News...", "url": "https://www.youtube.com/watch?v=AZ6v2UWPVnE", "urlToImage": null, "publishedAt": "2020-04-24T18:58:24Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "'I feel a deep responsibility': UK Health Secretary Matt Hancock on Covid-19 response - Channel 4 News", "description": "We speak to Health Secretary Matt Hancock and begin by asking him whether the government had failed to anticipate the demand for tests when it launched its o...", "url": "https://www.youtube.com/watch?v=kraGcbA_7D4", "urlToImage": null, "publishedAt": "2020-04-24T18:37:28Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Stephen Matthews Health Editor For Mailonline Sam Blanchard Senior Health Reporter For Mailonline", "title": "NHS to release plan next week to 'redeploy coronavirus capacity' - Daily Mail", "description": "NHS bosses are keen to get operating theatres back up and running and to return to business as usual for non-coronavirus patients who may have been missing out on treatment for weeks.", "url": "https://www.dailymail.co.uk/news/article-8254393/NHS-release-plan-week-redeploy-coronavirus-capacity.html", "urlToImage": null, "publishedAt": "2020-04-24T18:35:52Z", "content": "NHS hospitals could restart routine operations as soon as next week as the health service prepares plans to get back on its feet as the coronavirus crisis blows over. \r\nPrivate hospitals have laid empty in the past week and up to 40,000 NHS beds are thought t… [+9807 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Nicoletta Lanese", "title": "New COVID-19 vaccine shows promise in monkeys. Next step: humans. - Live Science", "description": "The vaccine has entered early clinical trials in human volunteers.", "url": "https://www.livescience.com/experimental-covid19-vaccine-protects-monkeys.html", "urlToImage": null, "publishedAt": "2020-04-24T18:23:26Z", "content": "An experimental COVID-19 vaccine protected monkeys from catching the viral infection, according to an unreviewed report. The new vaccine has now entered clinical trials in China\r\n to test the drug in humans.     \r\nAlthough the animal study, posted April 19 to… [+5914 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Hospital staff's humanity and love made me proud to be able to tell their story, writes Emily Morgan - ITV News", "description": "There is something very sobering about going into an Intensive Care Unit. But so much more so today.\n\nWhat struck me first, as we walked into Kettering Hospital's ICU, was the silence. Clinicians in hazmat suits huddle around sleeping patients, monitoring oxy…", "url": "https://www.itv.com/news/2020-04-24/hospital-staff-s-humanity-and-love-made-me-proud-to-be-able-to-tell-their-story/", "urlToImage": null, "publishedAt": "2020-04-24T17:57:00Z", "content": null}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nChristopher Hope,", "title": "Britons will not get preferential access to a UK-invented coronavirus vaccine afterall, says Government - Telegraph.co.uk", "description": "Britons will not get preferential access to any new coronavirus vaccines developed by taxpayer-funded UK universities under a deal announced by Dominic Raab last night.", "url": "https://www.telegraph.co.uk/politics/2020/04/24/britons-will-not-get-preferential-access-uk-invented-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-24T17:39:00Z", "content": "The UK Government has pumped hundreds of millions of pounds of taxpayers' money to try to find a vaccine to treat Covid-19.\r\nThe scale of the UK's investment had led to hopes that Britons would be among the first to benefit from any vaccines which are develop… [+2215 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Emma Brazell", "title": "Scientists detect coronavirus on particles of air pollution - Metro.co.uk", "description": "It raises a suggestion that higher levels of particle pollution could lead to higher rates of infection - for example in regions of northern Italy.", "url": "https://metro.co.uk/2020/04/24/scientists-detect-coronavirus-particles-air-pollution-12605944/", "urlToImage": null, "publishedAt": "2020-04-24T17:13:01Z", "content": "The new medical work is preliminary and it is not confirmed if the virus remains viable on pollution particles (Picture: Rex/ PA)\r\nCoronavirus has been detected on particles of air pollution by scientists looking into whether the illness could be carried this… [+2081 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Eleanor Barlow", "title": "Tragic coronavirus victim text fiancée 'thank you for the best life' before his death - Daily Record", "description": "Richard McKeag, 29, had been working on-call care support shifts before he struggled with his breathing and a bad persistent cough.", "url": "https://www.dailyrecord.co.uk/news/scottish-news/tragic-coronavirus-victim-text-fiance-21922667", "urlToImage": null, "publishedAt": "2020-04-24T16:46:21Z", "content": "A 29-year-old man who died after testing positive for coronavirus messaged his fiancée to say \"thank you for the best life\" before he was put into a coma. \r\n Richard McKeag, known as Ricky, had been working on-call care support shifts before he contracted Cov… [+2981 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Sathnam Sanghera", "title": "Coronavirus and ethnicity: black and Asian NHS medics on the front line - The Times", "description": "My last significant social engagement before the coronavirus lockdown was a school reunion dinner. For the first time since I left Wolverhampton Grammar School 25 years ago, initially for a grim", "url": "https://www.thetimes.co.uk/article/coronavirus-and-ethnicity-black-and-asian-nhs-medics-on-the-front-line-dhznrc3kc", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "My last significant social engagement before the coronavirus lockdown was a school reunion dinner. For the first time since I left Wolverhampton Grammar School 25 years ago, initially for a grim summer job in a local hospital laundry, and then Cambridge Unive… [+451 chars]"}, {"source": {"id": null, "name": "Mylondon.news"}, "author": "Qasim Peracha", "title": "London coronavirus: The hospitals where 126 more patients have died as London death toll hits 4,426 - MyLondon", "description": "UK deaths now account for one in 10 coronavirus deaths across the world", "url": "https://www.mylondon.news/news/zone-1-news/london-coronavirus-hospitals-126-more-18146984", "urlToImage": null, "publishedAt": "2020-04-24T15:59:00Z", "content": "A further 126 deaths from coronavirus have been recorded in London, taking the total death toll in the capital's hospitals to 4,426. \r\nNationally, the death toll reached 19,506 deaths in hospitals across the country after 684 more deaths were registered accor… [+5100 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Jon Henley", "title": "Sweden queries basis of lockdowns as Germany keeps its guard up - The Guardian", "description": "Looser regime means Sweden is better placed to face second wave, says chief epidemiologist", "url": "https://www.theguardian.com/world/2020/apr/24/sweden-queries-basis-of-lockdowns-as-germany-keeps-its-guard-up", "urlToImage": null, "publishedAt": "2020-04-24T15:55:49Z", "content": "Sweden questioned the scientific basis of other EU countries strict coronavirus lockdowns as Germany said its number of cases needed to fall from about 2,000 to a few hundred a day before it could ease restrictions further.\r\nAs several European countries cont… [+4375 chars]"}, {"source": {"id": null, "name": "Spiked-online.com"}, "author": "Jacob Reynolds", "title": "Wokeness has destroyed the university - Spiked", "description": "An academic says that if Oxford develops a coronavirus vaccine, it would bolster racism.", "url": "https://www.spiked-online.com/2020/04/24/wokeness-has-destroyed-the-university/", "urlToImage": null, "publishedAt": "2020-04-24T15:53:26Z", "content": "Coronavirus is going to hit universities hard. According to a new report by the Universities and Colleges Union (UCU), they face a £2.5 billion gap in lost fees, and the prospect of tens of thousands of job cuts. For those of us who believe in the value of kn… [+3789 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Emilia Jiang For Mailonline", "title": "First coronavirus vaccine could be ready by September, head of China's CDC claims - Daily Mail", "description": "Dr Gao Fu, director-general of China's Centre for Disease Prevention and Control, said that China expects to have a successful vaccine candidate for the deadly disease by September.", "url": "https://www.dailymail.co.uk/news/article-8253689/First-coronavirus-vaccine-ready-September-head-Chinas-CDC-claims.html", "urlToImage": null, "publishedAt": "2020-04-24T15:48:45Z", "content": "A Chinese official has claimed that the country's first coronavirus vaccine could be ready in less than five months.\r\nDr Gao Fu, director-general of China's Centre for Disease Prevention and Control, said that China expects to have a successful vaccine candid… [+3328 chars]"}, {"source": {"id": null, "name": "Kilburntimes.co.uk"}, "author": "Nathalie Raffray", "title": "Coronavirus: Northwick Park Hospital sees 'massive decline' in new covid cases | Health - Kilburn Times", "description": "Northwick Park Hospital is experiencing “a lull” in coronavirus cases which staff are using to prepare should their be another wave of infections.", "url": "https://www.kilburntimes.co.uk/news/health/covid-northwick-park-hospital-sees-decline-in-cases-1-6623263", "urlToImage": null, "publishedAt": "2020-04-24T15:23:00Z", "content": "PUBLISHED: 16:23 24 April 2020 | UPDATED: 16:23 24 April 2020\r\nNathalie Raffray\r\nDr Rachel Tennant, Northwick Park Hospital consultant. Picture: Nathalie Raffray\r\nArchant\r\nNorthwick Park Hospital is experiencing “a lull” in coronavirus cases which staff are u… [+2614 chars]"}, {"source": {"id": null, "name": "Lincolnshirelive.co.uk"}, "author": "Matty Hewitt", "title": "Five more people die from coronavirus at Lincolnshire hospitals - Lincolnshire Live", "description": "Rest in peace", "url": "https://www.lincolnshirelive.co.uk/news/local-news/coronavirus-cases-lincolnshire-deaths-nhs-4076203", "urlToImage": null, "publishedAt": "2020-04-24T14:18:08Z", "content": "Five more people have died in Lincolnshire hospitals after testing positive for coronavirus.\r\nTheir deaths take the total number of people to have died from the virus in Lincolnshire to 91 as of today, Friday, April 24. \r\nThree women, aged 67, 69 and 85, and … [+1373 chars]"}, {"source": {"id": null, "name": "Shropshirestar.com"}, "author": "Dominic Robertson", "title": "Four more coronavirus deaths confirmed in Shropshire as UK death toll passes 19000 - shropshirestar.com", "description": "A further four people have been confirmed to have died with coronavirus in Shropshire.", "url": "https://www.shropshirestar.com/news/health/coronavirus-covid19/2020/04/24/four-more-coronavirus-deaths-confirmed-in-county/", "urlToImage": null, "publishedAt": "2020-04-24T13:35:00Z", "content": "All four patients were in the care of Shrewsbury &amp; Telford Hospital NHS Trust (SaTH) and died after testing positive for Covid-19, NHS England confirmed today. \r\nIt takes the total who have now died at the trust, which manages Royal Shrewsbury Hospital an… [+1529 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Four cemeteries in Cardiff to reopen - Wales Online", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiYmh0dHBzOi8vd3d3LndhbGVzb25saW5lLmNvLnVrL25ld3Mvd2FsZXMtbmV3cy9jZW1ldGVyaWVzLWNhcmRpZmYtb3Blbi1jb3JvbmF2aXJ1cy1jYXRoYXlzLTE4MTQ0MzY20gFmaHR0cHM6Ly93d3cud2FsZXNvbmxpbmUuY28udWsvbmV3cy93YWxlcy1uZXdzL2NlbWV0ZXJpZXMtY2FyZGlmZi1vcGVuLWNvcm9uYXZpcnVzLWNhdGhheXMtMTgxNDQzNjYuYW1w?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T13:07:26Z", "content": null}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Lynn Love", "title": "Scotland's youngest coronavirus patient thanks NHS for saving her life in cute clap for carers - Daily Record", "description": "Peyton Maguire was diagnosed with Covid-19 at just three-weeks-old after being born eight weeks premature on March 26.", "url": "https://www.dailyrecord.co.uk/news/scottish-news/scotlands-youngest-coronavirus-patient-thanks-21919993", "urlToImage": null, "publishedAt": "2020-04-24T13:02:43Z", "content": "A four-week-old baby, thought to be Scotland's youngest coronavirus patient, thanked NHS staff for saving her life in her first 'Clap for Carers'. \r\n Little Peyton Maguire was diagnosed with Covid-19 at just three-weeks-old after being born eight weeks premat… [+2090 chars]"}, {"source": {"id": null, "name": "Expressandstar.com"}, "author": "Thomas Parkes", "title": "How nurse sculpture has become new landmark on Cinder Bank island - expressandstar.com", "description": "A steel sculpture of a nurse has been installed at an island in Dudley to help show solidarity with frontline workers.", "url": "https://www.expressandstar.com/news/local-hubs/dudley/2020/04/24/nurse-sculpture-takes-pride-of-place-on-cinder-bank-island/", "urlToImage": null, "publishedAt": "2020-04-24T12:57:00Z", "content": "Liam Harris, who works at family-run Colstan Profile Ltd, thought up the idea during his spare time at work. \r\nThe piece has has now taken pride-of-place on Cinder Bank island and has been widely praised online. \r\n A steel nurse sculpture designed by brothers… [+1520 chars]"}, {"source": {"id": null, "name": "Examinerlive.co.uk"}, "author": "Lauren Ballinger", "title": "Police spell out lockdown rules for \"confused\" Yorkshire Dales day trippers - ExaminerLive", "description": "More than 350 people have been fined for breaking lockdown rules", "url": "https://www.examinerlive.co.uk/news/west-yorkshire-news/police-spell-out-lockdown-rules-18145084", "urlToImage": null, "publishedAt": "2020-04-24T12:54:00Z", "content": "Police have urged day trippers tempted by the good weather forecast this weekend to stay away from the Yorkshire Dales.\r\nAnd they have said despite some confusion over the rules, it couldn't be clearer that we must all stay at home.\r\nNorth Yorkshire Police sa… [+2599 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Birmingham Women’s Hospital consultant with Covid-19 dies - BBC News", "description": "Dr Vishna Rasiah was \"passionate about the care of babies and their families\" Birmingham Women and Children's Hospital said.", "url": "https://www.bbc.co.uk/news/uk-england-birmingham-52412049", "urlToImage": null, "publishedAt": "2020-04-24T11:35:07Z", "content": "Image copyrightBirmingham Women's and Children's NHS TrustImage caption\r\n Dr Vishna Rasiah, was known across the Midlands as the lead for the regional neonatal network, focusing on newborns\r\nA \"talented, dedicated and respected\" paediatric consultant has died… [+1510 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Sophie McCoid, Sonia Sharma", "title": "Exhausted mum 'named and shamed' for not clapping for carers - Liverpool Echo", "description": "The mum said she was called out on a community Facebook group", "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/exhausted-mum-named-shamed-not-18144048", "urlToImage": null, "publishedAt": "2020-04-24T11:23:11Z", "content": "A tired mum has been left upset after she was named and shamed on Facebook for not joining in with the weekly 'Clap for Carers' event. \r\nEvery Thursday night at 8pm people across the UK have been clapping outside their homes or from their windows in recogniti… [+2077 chars]"}, {"source": {"id": null, "name": "Doncasterfreepress.co.uk"}, "author": "Tim Cunningham", "title": "Doncaster coronavirus deaths may be missed in official figures - Doncaster Free Press", "description": "At least two deaths linked to coronavirus in Doncaster may not be captured in official estimates, new figures suggest.", "url": "https://www.doncasterfreepress.co.uk/health/coronavirus/doncaster-coronavirus-deaths-may-be-missed-official-figures-2548746", "urlToImage": null, "publishedAt": "2020-04-24T11:02:00Z", "content": "Shadow social care minister Liz Kendall has called on the Government to publish daily figures of Covid-19 deaths outside hospital settings, including in care homes, to understand \"the true scale of the problem.\"\r\nOffice for National statistics data shows that… [+1965 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Laura Geggel", "title": "SARS-CoV-2 may be exploiting our immune system's 'first responder' cells - Livescience.com", "description": "", "url": "https://www.livescience.com/coronavirus-immune-interferon-response.html", "urlToImage": null, "publishedAt": "2020-04-24T11:00:00Z", "content": "The new coronavirus\r\n, known as SARS-CoV-2, may be using part of the human body's own immune response against us, a new study suggests.\r\nThe novel coronavirus is known to use a keyhole called the ACE2 receptor to \"unlock\" a cell and get inside, where it repli… [+6132 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Rob Powell, political correspondent, and Greg Heffer, political reporter", "title": "Coronavirus test applications closed after 5,000 home kits ordered in two minutes - Sky News", "description": "Downing Street reveals that 5,000 home-testing kits were ordered within two minutes of the new website opening.", "url": "https://news.sky.com/story/coronavirus-online-applications-for-covid-19-tests-temporarily-closed-due-to-huge-demand-11978070", "urlToImage": null, "publishedAt": "2020-04-24T10:11:24Z", "content": null}, {"source": {"id": null, "name": "Edp24.co.uk"}, "author": "Abigail Nicholson", "title": "We must be told when we can see our relatives again, says health expert | Politics - Eastern Daily Press", "description": "Clear guidance on whether people can safely visit family and friends needs to be ready as soon as any easing of coronavirus lockdown rules is announced, a public health expert has warned.", "url": "https://www.edp24.co.uk/news/politics/must-be-told-when-we-can-see-relatives-again-1-6621960", "urlToImage": null, "publishedAt": "2020-04-24T10:00:00Z", "content": "PUBLISHED: 11:00 24 April 2020\r\nAbigail Nicholson\r\nClear guidance on whether people can safely visit family and friends needs to be ready as soon as any easing of coronavirus lockdown rules is announced, a public health expert has warned. Picture: Getty Image… [+2742 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Matt Mathers", "title": "Do I need to start taking vitamin D during lockdown? - The Independent", "description": "Public Health England has updated its advice on vitamin D", "url": "https://www.independent.co.uk/life-style/health-and-families/health-news/coronavirus-vitamin-d-supplements-benefits-tablets-covid-19-health-advice-a9480386.html", "urlToImage": null, "publishedAt": "2020-04-24T09:36:32Z", "content": "Millions of people across the UK are being forced to spend more time indoors as the Covid-19 lockdown continues.\r\nIncreased time spent at home means that many of us may not be getting the same amount of vitamin D that we normally would by being outside.\r\nIn r… [+31662 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Juliette Garside", "title": "Hospitals sound alarm over privately run virus test centre at Surrey theme park - The Guardian", "description": "Frontline staff complain over ‘lost Covid-19 test results’ from Chessington drive-in site", "url": "https://www.theguardian.com/world/2020/apr/23/hospitals-sound-alarm-over-privately-run-test-centre-in-surrey", "urlToImage": null, "publishedAt": "2020-04-24T09:20:46Z", "content": "Hospitals sought to take over the operation of a flagship government coronavirus testing centre from the accounting firm Deloitte after severe failings in the service led to the test results of NHS staff being lost or sent to the wrong person, the Guardian ca… [+5590 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Cathy Owen", "title": "15 residents at single Welsh care home have died in a month - Wales Online", "description": "Staff at Tregwilym Lodge in Rogerstone, Newport, have been left devastated. None of the residents were tested for coronavirus but 14 reportedly had symptoms", "url": "https://www.walesonline.co.uk/news/wales-news/care-home-deaths-wales-coronavirus-18142381", "urlToImage": null, "publishedAt": "2020-04-24T08:09:39Z", "content": "Staff at a Welsh nursing home have been left devastated after the deaths of 15 residents in the space of just a month.\r\n Tests weren't carried out but 14 of the elderly residents at Tregwilym Lodge in Rogerstone, Newport, reportedly had coronavirus symptoms. … [+2667 chars]"}, {"source": {"id": null, "name": "Expressandstar.com"}, "author": null, "title": "Birmingham mother dies with coronavirus six days after giving birth - expressandstar.com", "description": "The family of a new mother who died in hospital without ever getting to hold her baby have spoken of their devastation.", "url": "https://www.expressandstar.com/news/health/coronavirus-covid19/2020/04/24/birmingham-mother-dies-in-hospital-six-days-after-giving-birth/", "urlToImage": null, "publishedAt": "2020-04-24T07:37:00Z", "content": "Fozia Hanif, who had tested positive for coronavirus, died at Birmingham's Heartlands Hospital on April 8 after her condition deteriorated following the birth of her son. \r\nThe 29-year-old - whose baby remains in hospital but has tested negative for Covid-19 … [+2426 chars]"}, {"source": {"id": null, "name": "Refinery29.com"}, "author": "Molly Longman", "title": "A Second Wave Of Coronavirus Could Hit This Year - Refinery29", "description": "The Spanish flu of 1918 hit in waves, the second of which was most deadly.", "url": "https://www.refinery29.com/en-gb/2020/04/9734359/coronavirus-second-wave-cdc-warning-flu-season", "urlToImage": null, "publishedAt": "2020-04-24T06:15:00Z", "content": "Skip navigation!We noticed you're in Canada, would you like to see your local site? Click on the country / region above to switch.\r\nNow ReadingA Second Wave Of Coronavirus Could Hit This Year\r\n\"There's a possibility that the assault of the virus on our nation… [+4454 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Kathleen Speirs, Ryan Merrifield", "title": "'One in a million' nurse described 'excruciating' symptoms before dying of coronavirus - Mirror Online", "description": "Angela Cunningham's death saw an outpouring of grief on social media, where the veteran nurse had detailed her agonising symptoms, including vomiting and muscle pain, in the days before going into hospital", "url": "https://www.mirror.co.uk/news/uk-news/one-million-nurse-described-excruciating-21918725", "urlToImage": null, "publishedAt": "2020-04-24T06:08:50Z", "content": "The heartbreak of a popular nurse's tragic death from coronavirus, just days before she turned 60, will \"never heal\", her brother has said.\r\nAngela Cunningham, known as Angie, had been on a ventilator in ITU at Borders General Hospital for a week after testin… [+2692 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "BBC News", "title": "What is contact tracing and how does it work? - BBC News", "description": "When lockdown ends, contact tracing could help limit the spread of coronavirus.", "url": "https://www.bbc.co.uk/news/av/technology-52401049/coronavirus-what-is-contact-tracing-and-how-does-it-work", "urlToImage": null, "publishedAt": "2020-04-24T05:54:19Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: What do the stats tell us in Wales? - BBC News", "description": "Where are the hot spots in Wales and what is happening in care homes?", "url": "https://www.bbc.co.uk/news/uk-wales-52380643", "urlToImage": null, "publishedAt": "2020-04-24T05:41:30Z", "content": "Image copyrightGetty ImagesImage caption\r\n Beaches such as this one in Rhyl are all-but deserted during lockdown restrictions\r\nWhat can different statistics tell us about coronavirus in Wales so far?\r\nWe seem to be bombarded with different measures, but what … [+10081 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "David Rhodes", "title": "Coronavirus: Middlesbrough inhabitants most 'at risk' of dying - BBC News", "description": "A think tank says people in Middlesbrough have the highest chance of dying from Covid-19.", "url": "https://www.bbc.com/news/uk-england-tees-52354430", "urlToImage": null, "publishedAt": "2020-04-23T23:52:00Z", "content": "Let us know you agree to cookies\r\nWe use cookies to give you the best online experience. Please let us know if you agree to all of these cookies.\r\nImage caption\r\n Parks in Middlesbrough remain closed\r\nThe Mayor of Middlesbrough recently ordered all of the tow… [+6161 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: 'I faked having Covid-19 on Facebook and got arrested' - BBC News", "description": "Across the world police are chasing down alleged symptom-fakers who are being accused of triggering panic.", "url": "https://www.bbc.com/news/technology-52397294", "urlToImage": null, "publishedAt": "2020-04-23T23:21:30Z", "content": "Image copyrightTyler County Sheriff's Office/ GettyImage caption\r\n Mr Brandin's picture released by police\r\nMichael Lane Brandin knew his Facebook post would cause a stir.\r\nWhat he didn't realise was that he'd be arrested, lose his job and face a trial that c… [+4279 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Kat Lay, Health Correspondent | Chris Smyth, Whitehall Editor", "title": "Virus-free 'hubs' to take over cancer care as referrals drop - The Times", "description": "A network of “Covid-free hubs” will treat cancer patients, it has been announced, as the NHS launches a “help us help you” campaign to get people back to hospitals.Amid growing fears about the risk to", "url": "https://www.thetimes.co.uk/article/virus-free-hubs-to-take-over-cancer-care-as-referrals-drop-f229579kn", "urlToImage": null, "publishedAt": "2020-04-23T23:01:00Z", "content": "A network of Covid-free hubs will treat cancer patients, it has been announced, as the NHS launches a help us help you campaign to get people back to hospitals.\r\nAmid growing fears about the risk to patients with other conditions as the health service focuses… [+487 chars]"}, {"source": {"id": null, "name": "Theguardian.comuk-news"}, "author": "Sarah Marsh", "title": "NHS limits dialysis supplies for coronavirus patients - The Guardian", "description": "NHS England sends out emergency guidance following a shortage of dialysis fluids", "url": "https://amp.theguardian.comuk-news/2020/apr/23/nhs-limits-dialysis-supplies-for-coronavirus-patients", "urlToImage": null, "publishedAt": "2020-04-23T21:24:00Z", "content": "Hospitals are having to conserve life-saving dialysis fluid in the coming days because of national shortages, as it has been revealed that 28% of coronavirus patients in intensive care who need significant help to breathe also need kidney support.\r\nAccording … [+4901 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Harrison Jones", "title": "UK urged 'do your bit' with 25,000 to be invited to take part in coronavirus study - Metro.co.uk", "description": "'Take part in this vital research for your country.'", "url": "https://metro.co.uk/2020/04/23/uk-urged-bit-25000-invited-take-part-coronavirus-study-12602033/", "urlToImage": null, "publishedAt": "2020-04-23T20:38:08Z", "content": "Participants will give nose and throat swabs in one of the biggest virus infection and antibodies studies that this country has ever seen (Picture: Getty Images)\r\nThe Health Secretary Matt Hancock has urged the public to do your bit by taking part in a large-… [+4458 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nAnna Mikhailova,", "title": "Scarves are no substitute for face masks in protecting against coronavirus, experts say - Telegraph.co.uk", "description": "Worries over supplies of masks for medical workers means Government advice could be to use alternative ways of covering their faces", "url": "https://www.telegraph.co.uk/politics/2020/04/23/scarves-no-substitute-face-masks-protecting-against-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-23T20:30:00Z", "content": "The governments plan to recommend scarves instead of face masks will not offer people the same level of protection from Covid-19, experts have warned.\r\nMinisters are considering the recommendation by the Scientific Advisory Group for Emergencies (Sage), which… [+1150 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Henry McDonald, Pamela Duncan", "title": "Lockdown may be lifted earlier in Northern Ireland than rest of UK - The Guardian", "description": "Arlene Foster makes statement as it emerges extra critical care capacity not expected to be needed", "url": "https://www.theguardian.com/world/2020/apr/23/lockdown-may-be-lifted-earlier-in-northern-ireland-than-rest-of-uk", "urlToImage": null, "publishedAt": "2020-04-23T19:09:46Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Paul Dinsdale For Mailonline Vanessa Chalmers Health Reporter For Mailonline", "title": "NHS trusts buy their own antibody kits from Dutch firm to test staff - Daily Mail", "description": "Hundreds of the Biozek tests have already been used on NHS staff in London, Manchester and Leicester as hospitals face a surge in demand at a time when up to a fifth of the workforce are off sick.", "url": "https://www.dailymail.co.uk/news/article-8250133/NHS-trusts-buy-antibody-kits-Dutch-firm-test-staff.html", "urlToImage": null, "publishedAt": "2020-04-23T18:32:57Z", "content": "Five trusts in England are in talks with Dutch firm Biozek Medical to buy thousands of its rapid finger-prick tests which give a diagnosis in a matter of minutes\r\nNHS trusts have resorted to buying coronavirus antibody tests overseas in a bid to get their sta… [+13487 chars]"}, {"source": {"id": null, "name": "Herefordtimes.com"}, "author": "James Thomas", "title": "Coronavirus: ONS figures reveal more deaths in Herefordshire - Hereford Times", "description": "AT least three deaths linked to coronavirus in Herefordshire happened outside of hospital, new figures suggest.", "url": "https://www.herefordtimes.com/news/18401691.coronavirus-ons-figures-reveal-deaths-herefordshire/", "urlToImage": null, "publishedAt": "2020-04-23T18:01:33Z", "content": "AT least three deaths linked to coronavirus in Herefordshire happened outside of hospital, new figures suggest.\r\nOffice for National Statistics (ONS) data shows that in Herefordshire, 18 deaths involving Covid-19 were provisionally registered up to April 10.\r… [+2366 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": null, "title": "LIVE: Health secretary giving daily coronavirus briefing | Politics News - Sky News", "description": "Deaths of UK hospital patients with COVID-19 reach 18,738, but social distancing is said to be working.", "url": "https://news.sky.com/story/live-health-secretary-gives-daily-coronavirus-briefing-11977730", "urlToImage": null, "publishedAt": "2020-04-23T16:07:30Z", "content": null}, {"source": {"id": null, "name": "Lep.co.uk"}, "author": "Iain Lynn", "title": "Two pet cats test positive to coronavirus - Lancashire Post", "description": "Two pet cats in New York state have tested positive for the coronavirus, marking the first confirmed cases in companion animals in the US, federal officials said.", "url": "https://www.lep.co.uk/health/coronavirus/two-pet-cats-test-positive-coronavirus-2547776", "urlToImage": null, "publishedAt": "2020-04-23T16:00:00Z", "content": "The cats, which had mild respiratory illnesses and are expected to recover, are thought to have contracted the virus from people in their households or neighbourhoods, the US Department of Agriculture (USDA) and the federal Centres for Disease Control and Pre… [+3049 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "UK Covid-19 hospital death toll rises to 18738 - AOL Travel UK", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_e85314e3-7f25-4baa-b5b9-9f49911aff5a&lang=en-GB&inline=false", "urlToImage": null, "publishedAt": "2020-04-23T15:28:00Z", "content": "AOL is part of Verizon Media. Click 'I agree' to allow Verizon Media and our partners to use cookies and similar technologies to access your device and use your data (including location) to understand your interests, and provide and measure personalised ads. … [+342 chars]"}, {"source": {"id": null, "name": "Inverness-courier.co.uk"}, "author": "Philip Murray", "title": "Three new Covid-19 coronavirus cases confirmed in the Highlands, but numbers in hospital fell; mirroring a similar fall across Scotland as a whole - Inverness Courier", "description": "Three new cases of Covid-19 have been confirmed in the NHS Highland area, taking the overall total to 214.", "url": "https://www.inverness-courier.co.uk/news/new-highland-covid-19-cases-confirmed-amid-a-slight-drop-in-hospital-patient-numbers-197600/", "urlToImage": null, "publishedAt": "2020-04-23T13:21:00Z", "content": "Coronavirus news.\r\nTHREE new cases of Covid-19 have been confirmed in the NHS Highland area, taking the overall total to 214.\r\nIt came as Scotland recorded another 371 cases, taking the overall number since the outbreak began to 9409. Sadly the death toll als… [+1227 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Kit Heren", "title": "Nose cells identified as entry points for coronavirus - Evening Standard", "description": "", "url": "https://www.standard.co.uk/news/health/nose-cells-coronavirus-entry-infection-a4422226.html", "urlToImage": null, "publishedAt": "2020-04-23T12:37:03Z", "content": "Two nose cells have been identified as the first points at which Covid-19 enters the human body.\r\nScientists from the Wellcome Sanger Institute in the UK and several other universities have found that these cells contain high levels of the protein that corona… [+1661 chars]"}, {"source": {"id": null, "name": "Thescottishsun.co.uk"}, "author": "Catriona Graffius", "title": "Coronavirus Scotland: Tributes for ‘much loved’ Borders nurse and great-granny who died from Covid-19 - The Scottish Sun", "description": "", "url": "http://www.thescottishsun.co.uk/news/scottish-news/5522555/coronavirus-scotland-borders-nurse-grandmother-dies/", "urlToImage": null, "publishedAt": "2020-04-23T10:23:26Z", "content": "A 'MUCH LOVED' Borders nurse and great-granny has tragically died from coronavirus. \r\nTributes have now flooded in for Angie Cunningham who passed away yesterday in the ICU at the Borders General Hospital from the virus. \r\n Read our coronavirus live blog for … [+1105 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Shivali Best", "title": "Three key signs to distinguish coronavirus from your allergy symptoms - Mirror Online", "description": "Amid the coronavirus pandemic, many people are concerned that their allergy symptoms are actually a sign of COVID-19. However, there are three key signs to distinguish allergies from coronavirus", "url": "https://www.mirror.co.uk/science/coronavirus-three-key-signs-distinguish-21913144", "urlToImage": null, "publishedAt": "2020-04-23T09:13:13Z", "content": "This week, both temperatures and pollen counts across the UK are set to soar, spelling disaster for the 20% of Brits with hay fever. \r\n Amid the coronavirus pandemic, many people could be concerned that their allergy symptoms are actually a sign of COVID-19. … [+1737 chars]"}, {"source": {"id": null, "name": "Dorsetecho.co.uk"}, "author": "Jennifer Mulcahey", "title": "Police won't visit hospitals for tonight's Clap for Carers due to crowd concerns - Bournemouth Echo", "description": "Police officers won't be visiting Dorset's hospitals for tonight's Clap for Carers due to crowd concerns.", "url": "https://www.dorsetecho.co.uk/news/18399385.police-wont-visit-hospitals-tonights-clap-carers-due-crowd-concerns/", "urlToImage": null, "publishedAt": "2020-04-23T07:50:00Z", "content": "Police officers won't be visiting Dorset's hospitals for tonight's Clap for Carers due to crowd concerns.\r\nDorset Police says it's aware hospitals are becoming focal points during the weekly show of appreciation for frontline workers and the risk is that it c… [+1693 chars]"}, {"source": {"id": null, "name": "Kentlive.news"}, "author": "James Anderson, John James", "title": "The best places to buy coronavirus face masks - Kent Live", "description": "People might soon be forced to wear face masks when they head out in public - here's the places still selling them", "url": "https://www.kentlive.news/news/uk-world-news/best-places-buy-coronavirus-face-4070402", "urlToImage": null, "publishedAt": "2020-04-23T06:36:00Z", "content": "More and more people are seeking reassurance from a face mask when they venture out to public places like supermarkets.\r\nCurrently, official guidance doesn't require people to wear masks, but it is feared that the government may U-turn on this if some lockdow… [+4859 chars]"}]}