{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "independent", "name": "Independent"}, "author": "Alex Woodward", "title": "Coronavirus: 'No evidence' recovered patients are immune to re-infection, warns WHO - The Independent", "description": "World Health Organisation does not recommend governments issue 'immunity passports' as countries look to 'reopen' amid pandemic", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-immunity-passports-antibody-tests-world-health-organisation-a9484261.html", "urlToImage": null, "publishedAt": "2020-04-25T23:11:26Z", "content": "The World Health Organisation says there is no evidence that people who have recovered from coronavirus and have antibodies are protected against a second infection.\r\nIn a scientific brief published on Saturday, the United Nations agency warned against countr… [+2673 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Rosamund Urwin, Andrew Gregory and Caroline Wheeler", "title": "Coronavirus: NHS will fall short of 1bn items of protective gear, review reveals - The Times", "description": "The UK will be short of up to a billion items of personal protective equipment (PPE), according to a secret forecast commissioned by the government that will heap pressure on the health secretary", "url": "https://www.thetimes.co.uk/article/surgical-gowns-almost-gone-send-boiler-suits-plead-nhs-bosses-nk25sfsx7", "urlToImage": null, "publishedAt": "2020-04-25T23:01:00Z", "content": "The UK will be short of up to a billion items of personal protective equipment (PPE), according to a secret forecast commissioned by the government that will heap pressure on the health secretary, Matt Hancock.\r\nThe predictions of severe shortages were set ou… [+501 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Chanel Georgina", "title": "Hair loss treatment: The ‘most effective’ remedy to boost hair growth - how to make it - Express", "description": "HAIR LOSS can be upsetting for men and women alike. What's the 'most effective' remedy to boost hair growth? And how do you make it?", "url": "https://www.express.co.uk/life-style/health/1273911/hair-loss-treatment-coconut-milk-how-to-make-it", "urlToImage": null, "publishedAt": "2020-04-25T22:30:57Z", "content": "According to Dr Blossom Kochhar, the \"most effective\" remedy for natural hair growth is the use of coconut milk.\r\nSpecifically, Dr Kochhar advises to \"take coconut milk from a fresh coconut\" – and not to use the liquid from a carton.\r\nCoconut milks is rich in… [+182 chars]"}, {"source": {"id": null, "name": "Sunderlandecho.com"}, "author": "Dominic Scurr", "title": "Live updates: North East coronavirus cases rise to 6,772 as UK death toll passes 20,000 - Sunderland Echo", "description": "Good evening on Saturday, April 25. It’s Dominic here bringing you the latest updates from across the North East and UK.", "url": "https://www.sunderlandecho.com/health/coronavirus/live-updates-north-east-coronavirus-cases-rise-6772-uk-death-toll-passes-20000-2505131", "urlToImage": null, "publishedAt": "2020-04-25T22:07:41Z", "content": "With Prime Minister Boris Johnson expected to return to Downing Street next week after recuperating from the virus, Mr Hammond said he hoped it would mark a \"clear step change\" in the Government's response to the crisis.\r\nThe former Chancellor said it is esse… [+826 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "UK doctor invents digital flashcards to help Covid-19 patients understand staff - The Guardian", "description": "Cardmedic overcomes communication barrier caused by healthcare staff wearing PPE", "url": "https://www.theguardian.com/world/2020/apr/25/uk-doctor-invents-digital-flashcards-to-help-covid-19-patients-understand-staff", "urlToImage": null, "publishedAt": "2020-04-25T21:50:36Z", "content": "A coronavirus patients terrifying hospital experience inspired an NHS doctor to create a flashcard system to improve communication with medical staff wearing face masks.\r\nAnaesthetist Rachael Grimaldi founded Cardmedic while on maternity leave after reading a… [+2712 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "'No evidence' that recovered COVID-19 patients cannot be reinfected - WHO - Reuters UK", "description": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.", "url": "https://uk.reuters.com/article/health-coronavirus-who-idUKL5N2CC6XA", "urlToImage": null, "publishedAt": "2020-04-25T20:40:44Z", "content": "GENEVA, April 25 (Reuters) - The World Health Organization (WHO) said on Saturday that there was currently “no evidence” that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection. \r\nIn a statement, the … [+545 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Charlotte Hadfield", "title": "Mum taken to hospital with eye infection died of coronavirus as son held her hand - Mirror Online", "description": "Margaret Magee, from Anfield, Liverpool, was first admitted to the Royal Liverpool Hospital with an eye infection but she then tested positive for coronavirus and her condition deteriorated rapidly", "url": "https://www.mirror.co.uk/news/uk-news/mum-taken-hospital-eye-infection-21926713", "urlToImage": null, "publishedAt": "2020-04-25T20:31:33Z", "content": "A \"charismatic\" mum who was taken to hospital with an eye infection sadly died of coronavirus with her son holding her hand. \r\nMargaret Magee, from Anfield, Liverpool, was first admitted to the Royal Liverpool Hospital on March 16 with an eye infection.\r\nBut … [+1895 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nEdward Malnick,", "title": "All key workers must get masks and public should cover faces, says BMA - Telegraph.co.uk", "description": "The British Medical Association cites 'emerging evidence' that covering mouths and noses may help to control the spread of Covid-19", "url": "https://www.telegraph.co.uk/news/2020/04/25/key-workers-must-get-masks-public-should-cover-faces-says-bma/", "urlToImage": null, "publishedAt": "2020-04-25T20:30:00Z", "content": "All essential workers, including shopkeepers, should be given protective masks, the British Medical Association said, as the leading doctors' union joined calls for ministers to ask members of the public to wear face coverings outside of their homes.\r\nIn a si… [+1051 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nTom Morgan", "title": "Coronavirus test for anyone traced to a known carrier - Telegraph.co.uk", "description": "The technology should eventually allow symptomless workers to return to their jobs quicker", "url": "https://www.telegraph.co.uk/news/2020/04/25/coronavirus-test-anyone-traced-known-carrier/", "urlToImage": null, "publishedAt": "2020-04-25T20:30:00Z", "content": "In the letter to public health agencies and local authorities, he says the app will work in unison with a call-based system for those without the technology.\r\nHe also refers to the Government's huge recruitment drive to carry out the extra testing. \"There wil… [+2492 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nSteve Bird", "title": "Vaccine results could be set back by successful lockdown, professor warns - Telegraph.co.uk", "description": "As the first human tests for a Covid-19 vaccine begin, scientists warn that the success of the lockdown could slow down their analysis", "url": "https://www.telegraph.co.uk/news/2020/04/25/vaccine-results-could-set-back-successful-lockdown-professor/", "urlToImage": null, "publishedAt": "2020-04-25T20:00:00Z", "content": "Results from trials for a Covid-19 vaccine could be delayed due to the success of the lockdown in preventing the spread of coronavirus, the director of the Oxford Vaccine Group has said.\r\nSpeaking shortly after the first volunteers were injected as part of hu… [+3129 chars]"}, {"source": {"id": null, "name": "Theguardian.compolitics"}, "author": "Robin McKie, Toby Helm", "title": "Johnson faces lockdown dilemma as scientists warn over grim virus data - The Guardian", "description": "Number of cases still much too high to relax social restrictions soon, say leading scientists", "url": "https://amp.theguardian.compolitics/2020/apr/25/boris-johnson-lockdown-dilemma-grim-virus-data", "urlToImage": null, "publishedAt": "2020-04-25T19:51:46Z", "content": "The number of new cases of Covid-19 being diagnosed is still much too high to allow any easing of the lockdown soon, leading scientists have warned, as the virus death toll in UK hospitals passed 20,000 on Saturday.\r\nThe home secretary, Priti Patel, described… [+2089 chars]"}, {"source": {"id": null, "name": "Mylondon.news"}, "author": "Kirstie McCrum", "title": "London coronavirus: The hospitals where 116 more patients have died as London death toll hits 4,542 - MyLondon", "description": "The grim figure comes as the total UK deaths pass 20,000", "url": "https://www.mylondon.news/news/zone-1-news/london-coronavirus-hospital-deaths-capital-18151620", "urlToImage": null, "publishedAt": "2020-04-25T18:58:00Z", "content": "A further 116 deaths from coronavirus have been recorded in London, taking the total death toll in the capital's hospitals to 4,542 on Saturday (April 25)..\r\nIn the face of the growing tally, Home Secretary Priti Patel urged the public to \"stay strong and emb… [+4742 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Chanel Georgina", "title": "Type 2 diabetes symptoms: The sign to look for when you go to the toilet - Express", "description": "TYPE 2 diabetes needs to be diagnosed early. Otherwise, the condition can really have a negative impact on your health. What's the sign to look for when you go to the toilet?", "url": "https://www.express.co.uk/life-style/health/1273864/type-2-diabetes-symptoms-diarrhoea-constipation-nerve-damage", "urlToImage": null, "publishedAt": "2020-04-25T18:23:59Z", "content": "Type 2 diabetes is estimated to affect one in 15 people within the UK. How do you know if you've got it too? What's the sign to look for in the loo?\r\nFirst, what exactly is type 2 diabetes and what causes it?\r\nDiabetes UK explains how diabetes is a health con… [+1167 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nTom Morgan", "title": "£3.2bn cash for councils may not stop 'uncontrollable' second wave - Telegraph.co.uk", "description": "Public health experts call for councils to get more powers so local teams can be at the heart of the response to coronavirus", "url": "https://www.telegraph.co.uk/politics/2020/04/25/32bn-cash-councils-may-not-stop-uncontrollable-second-wave/", "urlToImage": null, "publishedAt": "2020-04-25T18:00:00Z", "content": "Britain's public health sector has told the Government that the emergency £3.2 billion support package for local authorities may not be enough to avoid an \"uncontrollable\" second wave of coronavirus.\r\nA letter sent to Professor Chris Whitty, England's chief m… [+1095 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Coronavirus: People with COVID-19 symptoms more than double number who tested postive, app shows - Sky News", "description": "The COVID symptom tracker has been downloaded by nearly 2.7 million people and is generating an \"unprecedented\" amount of data.", "url": "https://news.sky.com/story/coronavirus-more-than-370-000-people-in-uk-have-symptomatic-covid-19-says-tracker-app-11978714", "urlToImage": null, "publishedAt": "2020-04-25T17:48:45Z", "content": null}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Coronavirus: People with COVID-19 symptoms more than double number who tested positive, app shows - Sky News", "description": "The COVID symptom tracker has been downloaded by nearly 2.7 million people and is generating an \"unprecedented\" amount of data.", "url": "https://news.sky.com/story/coronavirus-people-with-covid-19-symptoms-more-than-double-number-who-tested-positive-app-shows-11978714", "urlToImage": null, "publishedAt": "2020-04-25T17:48:45Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Samantha Lock", "title": "How to book a coronavirus test? Who is eligible and where are the test centres - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11479298/how-to-book-coronavirus-test/", "urlToImage": null, "publishedAt": "2020-04-25T17:38:04Z", "content": "ON WEDNESDAY April 22, 23,560 tests were carried out on 14,629 people, according to the Department of Health and Social Care.\r\nHealth Secretary Matt Hancock said the capacity had now increased to 51,000 per day - which still remains almost 50,000 below his pr… [+8355 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Peter Conradi, Europe Editor", "title": "Rome set to ease lockdown, but Italy's engine room still stricken - The Times", "description": "A row of dozens of identical small white crosses has been erected in recent days at Milan’s giant Cimitero Maggiore for the victims of Covid-19 whose remains have yet to be claimed by relatives. There", "url": "https://www.thetimes.co.uk/article/rome-set-to-ease-lockdown-but-italys-engine-room-still-stricken-jbxcqd32t", "urlToImage": null, "publishedAt": "2020-04-25T17:00:00Z", "content": "A row of dozens of identical small white crosses has been erected in recent days at Milans giant Cimitero Maggiore for the victims of Covid-19 whose remains have yet to be claimed by relatives. There is space for 600 in what have been called Italys first war … [+467 chars]"}, {"source": {"id": null, "name": "Islandecho.co.uk"}, "author": null, "title": "ANOTHER 4 CASES OF COVID-19 CONFIRMED ON THE ISLE OF WIGHT - Island Echo", "description": "86 cases of coronavirus have now been confirmed on the Isle of Wight, according to the latest data from Public Health England. Figures reveal that there have been a further 4 cases of COVID-19 identified and confirmed on the Island, taking the overall total f…", "url": "https://www.islandecho.co.uk/another-4-cases-of-covid-19-confirmed-on-the-isle-of-wight/", "urlToImage": null, "publishedAt": "2020-04-25T16:43:12Z", "content": "Nationally, the number of people who have tested positive for COVID-19 stands at 148,377 with 20,319 deaths (as of 25th April).\r\nFor the latest information on coronavirus here on the Isle of Wight visit islandecho.co.uk/category/coronavirus.\r\nSymptoms of coro… [+4639 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "David Chipakupaku", "title": "Coronavirus: Robots in Milton Keynes deliver shopping to NHS workers - Sky News", "description": "There has been a big rise in the use of the machines by NHS staff in Milton Keynes since the lockdown was introduced a month ago.", "url": "https://news.sky.com/story/coronavirus-robots-in-milton-keynes-deliver-shopping-to-nhs-workers-11978670", "urlToImage": null, "publishedAt": "2020-04-25T16:37:31Z", "content": null}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Alice Tidey", "title": "Coronavirus: France drastically limits sale of nicotine products - Euronews", "description": "The measure comes after a study found that \"nicotine may be suggested as a potential preventive agent against Covid-19 infection.\"", "url": "https://www.euronews.com/2020/04/25/coronavirus-france-drastically-limits-sale-of-nicotine-products", "urlToImage": null, "publishedAt": "2020-04-25T16:31:54Z", "content": "France severely curtailed the sale of nicotine products on Friday after a study suggested smokers may be less likely to contract COVID-19.\r\nThe decree, issued by the Ministry of Health, limits pharmacies from selling more than a one-month supply of any nicoti… [+1842 chars]"}, {"source": {"id": null, "name": "Yorkpress.co.uk"}, "author": "Ed Horner", "title": "Rise in confirmed coronavirus cases in York and North Yorkshire - York Press", "description": "THE number of confirmed coronavirus cases in York and North Yorkshire has risen again.", "url": "https://www.yorkpress.co.uk/news/18405857.rise-confirmed-coronavirus-cases-york-north-yorkshire/", "urlToImage": null, "publishedAt": "2020-04-25T16:22:00Z", "content": "THE number of confirmed coronavirus cases in York and North Yorkshire has risen again.\r\nLatest figures from Public Health England show there were 232 confirmed cases in the City of York Council area today (April 25), compared with 224 yesterday.\r\nThe North Yo… [+450 chars]"}, {"source": {"id": null, "name": "Essexlive.news"}, "author": "Paige Ingram", "title": "Essex coronavirus: Where 1,198 Covid-19 patients in and around the county have died - Essex Live", "description": "There have been 217 deaths in one trust", "url": "https://www.essexlive.news/news/essex-news/essex-coronavirus-1198-covid-19-4076002", "urlToImage": null, "publishedAt": "2020-04-25T16:20:00Z", "content": "It is something that has, at some point, touched all our lives.\r\nFrom cradle to grave, the National Health Service, and the incredible professionals within it who care for us, is a part of British life.\r\nToday, more than ever, we should cherish those who dedi… [+550 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Chiara Fiorillo", "title": "No evidence that those who have survived coronavirus are immune to it, WHO warns - Mirror Online", "description": "The WHO warned governments against issuing 'immunity passports' or 'risk-free certificates' to people to have been infected as their accuracy cannot be guaranteed at this point in the pandemic", "url": "https://www.mirror.co.uk/news/world-news/no-evidence-those-who-survived-21925116", "urlToImage": null, "publishedAt": "2020-04-25T16:10:51Z", "content": "The World Health Organisation said there is currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies for the virus are protected from a second coronavirus infection. \r\nIn a scientific brief, the United Nations agency warned gov… [+3278 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "NHS Heroes: Nurse on coronavirus ward shares 'uplifting' moments - ITV News", "description": "A nurse on a coronavirus ward has shared a video diary with ITV News - telling of the  \"uplifting\" moments she's experienced in the last few weeks.\n\nNatalie Duffy, who works at University Monklands Hospital in Airdrie, said: \"I'm one of the newly qualified nu…", "url": "https://www.itv.com/news/2020-04-25/nhs-heroes-nurse-on-coronavirus-ward-shares-uplifting-moments/", "urlToImage": null, "publishedAt": "2020-04-25T16:05:00Z", "content": "A nurse on a coronavirus ward has shared a video diary with ITV News - telling of the \"uplifting\" moments she's experienced in the last few weeks.\r\nNatalie Duffy, who works at University Monklands Hospital in Airdrie, said: \"I'm one of the newly qualified nur… [+1423 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Louise Callaghan, Malmo", "title": "Sweden: the young dance at a distance amid growing fears about fatal coronavirus misstep - The Times", "description": "As the singer screamed another chorus and the smoke machine whirred, the crowd went wild — or as wild as they could standing a metre apart.It was a socially distanced punk gig on Friday night. Spader", "url": "https://www.thetimes.co.uk/article/sweden-the-young-dance-at-a-distance-amid-growing-fears-about-fatal-coronavirus-misstep-r3gjr0hhr", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "As the singer screamed another chorus and the smoke machine whirred, the crowd went wild or as wild as they could standing a metre apart.\r\nIt was a socially distanced punk gig on Friday night. Spader Kung, from Malmo, were playing what might have been the onl… [+419 chars]"}, {"source": {"id": null, "name": "Devonlive.com"}, "author": "Howard Lloyd", "title": "Dozens of new coronavirus cases confirmed in Devon and Cornwall - Cornwall Live", "description": "There were 50 new cases confirmed across Devon and Cornwall in the last 24 hours", "url": "https://www.devonlive.com/news/devon-news/dozens-new-coronavirus-cases-confirmed-4078994", "urlToImage": null, "publishedAt": "2020-04-25T15:56:00Z", "content": "Fresh figures show that there have been 50 new confirmed cases of coronavirus in Devon and Cornwall.\r\nThere were 40 new reported cases confirmed in Devon and 10 in Cornwall, bringing the total across the two counties to 1,531.\r\nIt is an increase on the 28 con… [+876 chars]"}, {"source": {"id": null, "name": "Dailypost.co.uk"}, "author": "Ben Mitchell, Press Association, Marc Waddington-NW", "title": "Identical twin sister nurses die days apart after contracting coronavirus - Daily Post", "description": "Katy and Emma Davies, from Southampton, died this week", "url": "https://www.dailypost.co.uk/news/uk-world-news/identical-twin-sister-nurses-die-18150611", "urlToImage": null, "publishedAt": "2020-04-25T14:31:10Z", "content": "Identical twin sister nurses both died after catching coronavirus.\r\nChildren's nurse Katy Davis, 37, died at Southampton General Hospital on Tuesday.\r\nHer sister Emma, a former surgery nurse, died early on Friday.\r\nBoth women had an underlying health conditio… [+1786 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Northern Ireland's coronavirus death toll rises to 294 | UTV - ITV News - ITV News", "description": "Sixteen more people who tested positive for coronavirus in Northern Ireland have sadly died, taking the total number to 294.\n\nAccording to the Department of Health, testing has resulted in 104 new cases in the region.\n\nThe total number of confirmed cases in N…", "url": "https://www.itv.com/news/utv/2020-04-25/northern-irelands-coronavirus-death-toll-rises-to-294/", "urlToImage": null, "publishedAt": "2020-04-25T14:22:00Z", "content": "Sixteen more people who tested positive for coronavirus in Northern Ireland have sadly died, taking the total number to 294.\r\nAccording to the Department of Health, testing has resulted in 104 new cases in the region.\r\nThe total number of confirmed cases in N… [+337 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By James Wood For Mailonline", "title": "Coronavirus patients who get put on a ventilator have just a 34% chance of survival, new study shows - Daily Mail", "description": "The figures come from the Intensive Care National Audit and Research Centre (ICNARC) and are based on a sample of 6,720 critically-ill coronavirus patients.", "url": "https://www.dailymail.co.uk/news/article-8256381/Coronavirus-patients-ventilator-just-34-chance-survival-new-study-shows.html", "urlToImage": null, "publishedAt": "2020-04-25T14:07:00Z", "content": "Coronavirus patients who get put on a ventilator have just a 34 per cent chance of survival, a new study has revealed.  \r\nThe figures come from the Intensive Care National Audit and Research Centre (ICNARC) and are based on a sample of 6,720 critically-ill co… [+2556 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Latest Welsh coronavirus death toll and new cases - Daily Post", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiXmh0dHBzOi8vd3d3LmRhaWx5cG9zdC5jby51ay9uZXdzL25vcnRoLXdhbGVzLW5ld3MvbGF0ZXN0LXdlbHNoLWNvcm9uYXZpcnVzLWRlYXRoLXRvbGwtMTgxNTA0MTjSAWJodHRwczovL3d3dy5kYWlseXBvc3QuY28udWsvbmV3cy9ub3J0aC13YWxlcy1uZXdzL2xhdGVzdC13ZWxzaC1jb3JvbmF2aXJ1cy1kZWF0aC10b2xsLTE4MTUwNDE4LmFtcA?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T13:45:16Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By James Wood For Mailonline", "title": "New figures show number of people visiting UK's A&E wards down by half this month - Daily Mail", "description": "Health officials are worried many people are not seeking treatment because they fear contracting Covid-19, thereby jeopardising their survival and potentially becoming collateral damage.", "url": "https://www.dailymail.co.uk/news/article-8256237/New-figures-number-people-visiting-UKs-E-wards-half-month.html", "urlToImage": null, "publishedAt": "2020-04-25T13:13:17Z", "content": "The NHS is launching a new campaign to make sure people seek urgent care during a medical emergency after visits to A&amp;E dropped by almost 50 per cent this month.\r\nHealth officials are worried many people are not seeking treatment because they fear contrac… [+23379 chars]"}, {"source": {"id": null, "name": "Creativebloq.com"}, "author": "Rosie Hilder", "title": "Where to buy a face mask right now – plus how to make a face mask at home - Creative Bloq", "description": "Wondering where to buy a face mask? These retailers still have stock. Plus how to make your own.", "url": "https://www.creativebloq.com/news/where-to-buy-face-masks", "urlToImage": null, "publishedAt": "2020-04-25T13:01:17Z", "content": "If you want to know where to buy a face mask, you're in the right place. Face masks are selling out quickly around the world, so we've put together this list of online retailers that still have face masks in stock. \r\nBear in mind that the face masks in this a… [+6427 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Chiara Fiorillo", "title": "UK troops 'given insect repellent' as part of 'enhanced' protection against coronavirus - Mirror Online", "description": "Soldiers will be issued with Citriodiol, which is said to kill types of coronaviruses. The company that produces the repellent is urging the government to support a formal testing programme", "url": "https://www.mirror.co.uk/news/uk-news/uk-troops-given-insect-repellent-21924978", "urlToImage": null, "publishedAt": "2020-04-25T12:25:36Z", "content": "British troops are being given an insect repellent as a new layer of protection against Covid-19, it has been reported.\r\nSoldiers will be issued with Citriodiol, which reportedly kills types of coronaviruses.\r\n A military source told Sky News that the repelle… [+2283 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": null, "title": "WHO warns against coronavirus ‘immunity passports’ - Financial Times", "description": "Health agency says there is no proof recovered patients are shielded from reinfection", "url": "https://www.ft.com/content/49615c5b-d5b0-444b-b5f3-29bcc451f01e", "urlToImage": null, "publishedAt": "2020-04-25T12:19:58Z", "content": "The World Health Organization has warned governments against issuing “immunity passports” to allow people who show antibodies for coronavirus to return to work. \r\nAs leaders across the world turn their focus to reopening their economies after weeks of social … [+2484 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Milly Vincent For Mailonline", "title": "No evidence recovered covid patients can't be re-infected World Health Organisation says - Daily Mail", "description": "United Nations agency warned against issuing 'immunity passports' to people who have been infected, saying practice may actually increase the risk of spread as they may ignore standard advice.", "url": "https://www.dailymail.co.uk/news/article-8256249/No-evidence-recovered-covid-patients-infected-World-Health-Organisation-says.html", "urlToImage": null, "publishedAt": "2020-04-25T12:18:37Z", "content": "The World Health Organization (WHO) said on Saturday that there was currently 'no evidence' that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nIn a statement, the United Nations agency warned a… [+10548 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus Explained: how the virus will hit the poorest people on the planet - Channel 4 News", "description": "The coronavirus pandemic is affecting the world, no matter who you are and where you come from. (Subscribe: https://bit.ly/C4_News_Subscribe) Covid-19 is dev...", "url": "https://www.youtube.com/watch?v=QorckhwMLR0", "urlToImage": null, "publishedAt": "2020-04-25T11:05:09Z", "content": "The coronavirus pandemic is affecting the world, no matter who you are and where you come from. (Subscribe: https://bit.ly/C4_News_Subscribe) \r\nCovid-19 is devastating countries across the globe, with some of the wealthiest nations struggling to contain the s… [+522 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Alessandra Scotto di Santolo", "title": "Expert reveals up to seven tests needed to get accurate coronavirus antibody results - Express", "description": "CORONAVIRUS tests may need up to seven takes to give accurate results on the development of antibodies in those who have already suffered from the deadly virus.", "url": "https://www.express.co.uk/news/uk/1273747/coronavirus-test-antibody-tests-covid-19-uk-latest-update", "urlToImage": null, "publishedAt": "2020-04-25T10:00:19Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Elsom For Mailonline", "title": "Chris Whitty reveals the UK's 'reproduction number' dropped below 1 - Daily Mail", "description": "England's chief medical officer has offered a chink of light out of the lockdown after revealing coronavirus infection rates in the UK have been wrestled down.", "url": "https://www.dailymail.co.uk/news/article-8255677/Chris-Whitty-reveals-UKs-reproduction-number-dropped-1.html", "urlToImage": null, "publishedAt": "2020-04-25T08:38:55Z", "content": "Professor Chris Whitty has offered a chink of light out of the lockdown after revealing coronavirus infection rates have been wrestled down.\r\nEngland's chief medical officer said the reproduction number - or R0 - has been brought below 1, marking a critical a… [+4163 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Katrina Turrill", "title": "Coronavirus update: Six new symptoms of the deadly virus you need to look out for - Express", "description": "CORONAVIRUS has still taken a hold of the UK, with more than 143,000 confirmed cases and at least 19.506 deaths from the virus. Spotting the symptoms has never been so important, and the Centers for Disease Control and Prevention (CDC) has now added six new s…", "url": "https://www.express.co.uk/life-style/health/1273703/coronavirus-update-news-latest-symptoms-new-cdc", "urlToImage": null, "publishedAt": "2020-04-25T07:21:33Z", "content": "Coronavirus has been reported by patients to have a wide range of symptoms. Up until now, the CDC has listed the main symptoms as a fever, cough and shortness of breath or difficulty breathing. But six news symptoms have now been added to the list.After exper… [+1136 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Callum Hoare", "title": "‘Reservoir for viruses’ China told to permanently ban bat trade to prevent next pandemic - Express.co.uk", "description": "CHINA must permanently ban the hunting trade and consumption of wildlife animals, including bats, or a future pandemic similar to coronavirus is inevitable, research shows.", "url": "https://www.express.co.uk/news/world/1273464/china-xi-jinping-bat-animal-trade-coronavirus-pandemic-covid19-wuhan-seafood-market-spt", "urlToImage": null, "publishedAt": "2020-04-25T07:00:00Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Kate Ferguson", "title": "Boris Johnson is ‘cheerful and on the mend’ after easing himself back into work - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11476730/boris-johnson-cheerful-and-on-the-mend/", "urlToImage": null, "publishedAt": "2020-04-25T01:36:12Z", "content": "BORIS Johnson is cheerful and on the mend fuelling hopes he could soon return to No10.\r\nThe PM has eased himself back into work over the past few days, holding calls with the Queen and Donald Trump.\r\n After a difficult battle with coronavirus, Boris Johnson i… [+3264 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Jon Henley", "title": "Sweden queries basis of lockdowns as Germany keeps its guard up - The Guardian", "description": "Looser regime means Sweden is better placed to face second wave, says chief epidemiologist", "url": "https://www.theguardian.com/world/2020/apr/24/sweden-queries-basis-of-lockdowns-as-germany-keeps-its-guard-up", "urlToImage": null, "publishedAt": "2020-04-24T23:59:38Z", "content": "Sweden questioned the scientific basis of other EU countries strict coronavirus lockdowns as Germany said its number of cases needed to fall from about 2,000 to a few hundred a day before it could ease restrictions further.\r\nAs several European countries cont… [+4375 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.com/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:41Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8701 chars]"}, {"source": {"id": null, "name": "Www.gov.uk"}, "author": "Department of Health and Social Care", "title": "Clinical trial approved to help the NHS treat COVID-19 patients using plasma - GOV.UK", "description": "If effective, a national programme will deliver up to 10,000 units of plasma a week to the NHS to help treat coronavirus (COVID-19) patients.", "url": "https://www.gov.uk/government/news/clinical-trial-approved-to-help-the-nhs-treat-covid-19-patients-using-plasma", "urlToImage": null, "publishedAt": "2020-04-24T23:20:34Z", "content": "<ul><li>A clinical trial has been given approval to determine if plasma donated by patients who have recovered from COVID-19 can help those battling the illness</li><li>If effective, a scaled-up national programme will deliver up to 10,000 units of convalesce… [+5284 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "The most promising strategies for defeating coronavirus: A review study - Science Daily", "description": "Experts from UNC Chapel Hill review possible clinical approaches from antivirals to gene therapy against the virus responsible for COVID-19 and related diseases.", "url": "https://www.sciencedaily.com/releases/2020/04/200424081706.htm", "urlToImage": null, "publishedAt": "2020-04-24T20:35:32Z", "content": "In an unprecedented effort, hundreds of thousands of researchers and clinicians worldwide are locked in a race against time to develop cures, vaccines, and better diagnostic tests for COVID-19, the illness caused by the virus SARS-CoV-2.Over 1,650 articles on… [+4617 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Nazia Parveen", "title": "New mother dies of coronavirus six days after giving birth - The Guardian", "description": "Fozia Hanif developed symptoms before her 29th birthday, resulting in premature birth of her son, Ayaan", "url": "https://www.theguardian.com/world/2020/apr/24/new-mother-dies-of-coronavirus-six-days-after-giving-birth", "urlToImage": null, "publishedAt": "2020-04-24T19:31:43Z", "content": null}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Betsi death report delay sparks investigation - BBC News", "description": "The north Wales health board reported all its deaths at once after issues with reporting systems.", "url": "https://www.bbc.com/news/uk-wales-52419068", "urlToImage": null, "publishedAt": "2020-04-24T19:23:29Z", "content": "Image copyrightGetty ImagesImage caption\r\n Betsi Cadwaladr health board reported 84 deaths in the north Wales area on Thursday\r\nThe recording of the number of people who have died with coronavirus is being investigated after a Welsh health board failed to rep… [+2468 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Paralysed Ed Jackson reaches Everest staircase feat - BBC News", "description": "Former rugby player Ed Jackson has climbed 89,056 steps and made 2,783 trips up and down the stairs.", "url": "https://www.bbc.com/news/uk-england-somerset-52416450", "urlToImage": null, "publishedAt": "2020-04-24T19:09:39Z", "content": "Image copyrightWings for Life Image caption\r\n To simulate the ascent of Everest's 8,848m peak, Ed Jackson climbed 89,056 steps\r\nA paralysed ex-rugby player has climbed the equivalent height of Mount Everest on his parents' staircase.\r\nEd Jackson, from Bath, b… [+1708 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Lizzy Buchan", "title": "Government was warned last year that it needed an action plan to deal with a pandemic - The Independent", "description": "Labour brands revelations 'alarming' and calls for Michael Gove to be hauled before MPs", "url": "https://www.independent.co.uk/news/uk/politics/coronavirus-government-warned-pandemic-action-plan-cabinet-office-a9483291.html", "urlToImage": null, "publishedAt": "2020-04-24T19:02:04Z", "content": "The government was warned last year that it needed an action plan to deal with a coronavirus-style pandemic, according to a leaked Cabinet Office report.\r\nThe 600-page National Security Risk Assessment (NRSA) reportedly warned that a new pandemic virus could … [+7569 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Ellie Cambridge", "title": "Coronavirus victim, 29, told fiancee ‘thank you for the best life’ in final moments before fatal coma - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11474318/coronavirus-victim-fiancee-thank-you-life-before-coma/", "urlToImage": null, "publishedAt": "2020-04-24T18:55:09Z", "content": "A CORONAVIRUS victim messaged his fiancee saying \"thank you for the best life\" before he was put into a coma and died.\r\nRichard McKeag, 29, sent the heartbreaking final message to Katie Martin, 25, after they spoke for the last time on Facetime.\r\n Richard McK… [+4731 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Stephen Matthews Health Editor For Mailonline Sam Blanchard Senior Health Reporter For Mailonline", "title": "NHS to release plan next week to 'redeploy coronavirus capacity' - Daily Mail", "description": "NHS bosses are keen to get operating theatres back up and running and to return to business as usual for non-coronavirus patients who may have been missing out on treatment for weeks.", "url": "https://www.dailymail.co.uk/news/article-8254393/NHS-release-plan-week-redeploy-coronavirus-capacity.html", "urlToImage": null, "publishedAt": "2020-04-24T18:35:52Z", "content": "NHS hospitals could restart routine operations as soon as next week as the health service prepares plans to get back on its feet as the coronavirus crisis blows over. \r\nPrivate hospitals have laid empty in the past week and up to 40,000 NHS beds are thought t… [+9807 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "James Hockaday", "title": "NHS app will use Bluetooth signals to warn people they could have coronavirus - Metro.co.uk", "description": "It will trigger a warning for people who have been in close contact with a patient.", "url": "https://metro.co.uk/2020/04/24/nhs-app-will-use-bluetooth-signals-warn-people-coronavirus-12606898/", "urlToImage": null, "publishedAt": "2020-04-24T18:30:36Z", "content": "People who experience symptoms can tell the app, which then tells other users (Picture: NurPhoto/Getty Images)\r\nThe UK is preparing to anonymously track potential coronavirus carriers on their mobile phones as part of a contract tracing strategy. \r\nUsing Blue… [+3757 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Damian Carrington", "title": "Coronavirus detected on particles of air pollution - The Guardian", "description": "Exclusive: Scientists examine whether this route may enable infections at longer distances", "url": "https://www.theguardian.com/environment/2020/apr/24/coronavirus-detected-particles-air-pollution", "urlToImage": null, "publishedAt": "2020-04-24T18:12:43Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Les Steed", "title": "How does key worker testing work and what time can I apply for a coronavirus test? - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11469520/key-worker-coronavirus-testing-how-what-time/", "urlToImage": null, "publishedAt": "2020-04-24T17:35:15Z", "content": "MATT HANCOCK announced that testing can now be provided for up to seven million key workers and emergency staff.\r\nHere's how to get tested if you are an essential worker who believes that you or a household member has coronavirus.\r\n Matt Hancock said key work… [+6641 chars]"}, {"source": {"id": null, "name": "Northwichguardian.co.uk"}, "author": "Northwich Guardian Staff", "title": "At least 7 coronavirus-related deaths in Cheshire West and Chester not captured in official data - Northwich Guardian", "description": "AT LEAST seven deaths linked to coronavirus in Cheshire West and Chester may not be captured in official estimates, new figures suggest.", "url": "https://www.northwichguardian.co.uk/news/18404523.least-7-coronavirus-related-deaths-cheshire-west-chester-not-captured-official-data/", "urlToImage": null, "publishedAt": "2020-04-24T16:20:00Z", "content": "AT LEAST seven deaths linked to coronavirus in Cheshire West and Chester may not be captured in official estimates, new figures suggest.\r\nShadow social care minister Liz Kendall has called on the Government to publish daily figures of Covid-19 deaths outside … [+2180 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Sian Elvin", "title": "Coronavirus UK: 'Amazing' doctor who loved caring for babies dies - Metro.co.uk", "description": "'He treated every patient and family he cared for as his own. I couldn't have been prouder of him.'", "url": "https://metro.co.uk/2020/04/24/three-nhs-doctors-12605725/", "urlToImage": null, "publishedAt": "2020-04-24T15:52:10Z", "content": "Dr Vishna Rasiah, who has been described as talented, dedicated and respected, has died after contracting Covid-19 (Picture: PA)\r\nA talented, dedicated and respected doctor has died after contracting coronavirus.\r\nDr Vishna Rasiah, who worked at Birmingham Wo… [+2320 chars]"}, {"source": {"id": null, "name": "Pulsetoday.co.uk"}, "author": null, "title": "GPs should contact all shielded patients as a 'follow-up' to letter, says NHS - Pulse", "description": "Practices should contact all of their patients who are shielding from coronavirus (Covid-19) as a 'follow-up' to the NHS letter notifying them to stay at home for 12 weeks, NHS England has said.", "url": "http://www.pulsetoday.co.uk/clinical/clinical-specialties/respiratory-/gps-should-contact-all-shielded-patients-as-a-follow-up-to-letter-says-nhs/20040685.article", "urlToImage": null, "publishedAt": "2020-04-24T13:18:45Z", "content": "Practices should contact all of their patients who are shielding from coronavirus (Covid-19) as a 'follow-up' to the NHS letter notifying them to stay at home for 12 weeks, NHS England has said.\r\nDuring this follow-up conversation, GPs should discuss what shi… [+3708 chars]"}, {"source": {"id": null, "name": "Examinerlive.co.uk"}, "author": "Lauren Ballinger", "title": "Police spell out lockdown rules for \"confused\" Yorkshire Dales day trippers - ExaminerLive", "description": "More than 350 people have been fined for breaking lockdown rules", "url": "https://www.examinerlive.co.uk/news/west-yorkshire-news/police-spell-out-lockdown-rules-18145084", "urlToImage": null, "publishedAt": "2020-04-24T12:54:00Z", "content": "Police have urged day trippers tempted by the good weather forecast this weekend to stay away from the Yorkshire Dales.\r\nAnd they have said despite some confusion over the rules, it couldn't be clearer that we must all stay at home.\r\nNorth Yorkshire Police sa… [+2599 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Sophie McCoid, Sonia Sharma", "title": "Exhausted mum 'named and shamed' for not clapping for carers - Liverpool Echo", "description": "The mum said she was called out on a community Facebook group", "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/exhausted-mum-named-shamed-not-18144048", "urlToImage": null, "publishedAt": "2020-04-24T11:23:11Z", "content": "A tired mum has been left upset after she was named and shamed on Facebook for not joining in with the weekly 'Clap for Carers' event. \r\nEvery Thursday night at 8pm people across the UK have been clapping outside their homes or from their windows in recogniti… [+2077 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Richard Hartley-Parkinson", "title": "Hairdressers may not open for another six months so get used to 'Captain Caveman' look - Metro.co.uk", "description": "Barber shops and hair salons won't be able to open until it is safe to do so - that may not be until the end of the year.", "url": "https://metro.co.uk/2020/04/24/hairdressers-may-not-open-another-six-months-get-used-captain-caveman-look-12604007/", "urlToImage": null, "publishedAt": "2020-04-24T10:39:15Z", "content": "A sign of things to come? Barbers in Wuhan cut the hair of medical workers (Picture: Rex Shutterstock)\r\nYour roots may be longer than your preferred hair colour and were going to have to get used to looking like Captain Caveman as hairdressers may not open fo… [+4548 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Rob Powell, political correspondent, and Greg Heffer, political reporter", "title": "Coronavirus test applications closed after 5,000 home kits ordered in two minutes - Sky News", "description": "Downing Street reveals that 5,000 home-testing kits were ordered within two minutes of the new website opening.", "url": "https://news.sky.com/story/coronavirus-online-applications-for-covid-19-tests-temporarily-closed-due-to-huge-demand-11978070", "urlToImage": null, "publishedAt": "2020-04-24T10:11:24Z", "content": null}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Staff devastated as 15 residents of the same nursing home die in the space of a month - ITV News", "description": "Staff at a nursing home in Newport have been left devastated following the\ndeaths of 15 residents in the space of a month.\n\nFourteen of the elderly residents at Tregwilym Lodge in Rogerstone were showing symptoms of coronavirus before they died, although test…", "url": "https://www.itv.com/news/wales/2020-04-24/fifteen-nursing-home-residents-die-in-the-space-of-a-month/", "urlToImage": null, "publishedAt": "2020-04-24T09:44:00Z", "content": "Staff at a nursing home in Newport have been left devastated following the\r\ndeaths of 15 residents in the space of a month.\r\nFourteen of the elderly residents at Tregwilym Lodge in Rogerstone were showing symptoms of coronavirus before they died, although tes… [+1796 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nAnnelies Gartner", "title": "How close are we to a coronavirus vaccine - and when will trials begin? - Telegraph.co.uk", "description": "Latest news on the search for a vaccine against the new coronavirus", "url": "https://www.telegraph.co.uk/global-health/science-and-disease/coronavirus-vaccine-trials-start-covid-19-latest-update/", "urlToImage": null, "publishedAt": "2020-04-24T08:57:32Z", "content": "As Covid-19 has rapidly spread around the world there has been a mad scramble to find a vaccine. \r\nIn the UK a potential coronavirus vaccine being developed at the University of Oxford will begin human trials from Thursday, Matt Hancock, the Health Secretary,… [+1550 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Jessica Knibbs", "title": "Coronavirus symptoms: Do your toes look like this? Signs you could have 'COVID toes' - Express", "description": "CORONAVIRUS has caused mass havoc in its wake. The UK's updated cases of death from the deadly virus sits at an astonishing 17,337. Having toes which resemble the following could mean you're at risk of an infection.", "url": "https://www.express.co.uk/life-style/health/1272455/coronavirus-update-uk-cases-news-symptoms-covid-toes-frostbite-like-purple-red", "urlToImage": null, "publishedAt": "2020-04-24T08:14:00Z", "content": null}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Coronavirus: 'Too soon' to end lockdown but health secretary 'comfortable' with some businesses reopening - Sky News", "description": "", "url": "https://news.sky.com/story/coronavirus-too-soon-to-end-lockdown-but-health-secretary-comfortable-with-building-sites-reopening-11977971", "urlToImage": null, "publishedAt": "2020-04-24T07:04:48Z", "content": null}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nLizzie Roberts", "title": "Contact tracing: how has it worked for other countries, and could it really help ease UK lockdown? - The Telegraph", "description": "From teams of 'corona detectives' to Army cadets making thousands of calls a day, countries are tracking the spread of Covid-19", "url": "https://www.telegraph.co.uk/news/2020/04/25/what-contact-tracing-how-work-countries-uk-lockdown/", "urlToImage": null, "publishedAt": "2020-04-24T06:57:00Z", "content": "Countries around the world are rushing to launch contact tracing apps to identify who an infected person has had contact with, as part of efforts to slow the spread of the coronavirus. \r\nThe UK Government has announced the infrastructure was being put in plac… [+1754 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Kathleen Speirs, Ryan Merrifield", "title": "'One in a million' nurse described 'excruciating' symptoms before dying of coronavirus - Mirror Online", "description": "Angela Cunningham's death saw an outpouring of grief on social media, where the veteran nurse had detailed her agonising symptoms, including vomiting and muscle pain, in the days before going into hospital", "url": "https://www.mirror.co.uk/news/uk-news/one-million-nurse-described-excruciating-21918725", "urlToImage": null, "publishedAt": "2020-04-24T06:08:50Z", "content": "The heartbreak of a popular nurse's tragic death from coronavirus, just days before she turned 60, will \"never heal\", her brother has said.\r\nAngela Cunningham, known as Angie, had been on a ventilator in ITU at Borders General Hospital for a week after testin… [+2692 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "BBC News", "title": "What is contact tracing and how does it work? - BBC News", "description": "When lockdown ends, contact tracing could help limit the spread of coronavirus.", "url": "https://www.bbc.com/news/av/technology-52401049/coronavirus-what-is-contact-tracing-and-how-does-it-work", "urlToImage": null, "publishedAt": "2020-04-24T03:10:58Z", "content": null}, {"source": {"id": null, "name": "Southwalesargus.co.uk"}, "author": "Thomas Moody and Nicholas Thomas", "title": "Coronavirus latest as 234 new cases in Wales and NHS boss says Wales is showing 'encouraging signs' - South Wales Argus", "description": "• Public Health Wales reported 234 new cases, with 23 new cases in Gwent. • NHS Wales chief executive Dr Andrew Goodall said Wales was showing…", "url": "https://www.southwalesargus.co.uk/news/18399469.coronavirus-latest-234-new-cases-wales-nhs-boss-says-wales-showing-encouraging-signs/", "urlToImage": null, "publishedAt": "2020-04-24T00:00:11Z", "content": "©Copyright 2001-2020. This site is part of Newsquest's audited local newspaper network. A Gannett Company. Newsquest Media Group Ltd, Loudwater Mill, Station Road, High Wycombe, Buckinghamshire. HP10 9TY | 01676637 | Registered in England &amp; Wales."}]}