{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Nationalheraldindia.com"}, "author": "NH Web Desk", "title": "Coronavirus: What’s the plan C ? - National Herald", "description": "Billions of people are confined to their homes, waiting for a solution to get rid of the coronavirus", "url": "https://www.nationalheraldindia.com/videos/coronavirus-whats-the-plan-c", "urlToImage": null, "publishedAt": "2020-04-27T04:29:31Z", "content": "Billions of people are confined to their homes, waiting for a solution to get rid of the coronavirus.\r\nThe world strives for a vaccine and a sure shot treatment to defeat the deadly virus\r\nIt's the only sure-fire answer we have, but Science takes time, medici… [+2157 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julie Zaugg, for CNN", "title": "The virus hunters who search bat caves to predict the next pandemic - CNN", "description": "Before entering the cave, the small team of scientists pull on hazmat suits, face masks and thick gloves to cover every inch of their skin. Contact with bat droppings or urine could expose them to some of the world's deadliest unknown viruses.", "url": "https://www.cnn.com/2020/04/26/health/virus-hunters-bat-cave-coronavirus-hnk-intl/index.html", "urlToImage": null, "publishedAt": "2020-04-27T03:45:54Z", "content": "(CNN)Before entering the cave, the small team of scientists pull on hazmat suits, face masks and thick gloves to cover every inch of their skin. Contact with bat droppings or urine could expose them to some of the world's deadliest unknown viruses.\r\nEquipped … [+11972 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Why tongue cleaning should be an important part of your brushing routine - Times of India", "description": "Tongue cleaning is an equally essential step as brushing. While cleaning your teeth, you must never skip the tongue", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/why-tongue-cleaning-should-be-an-important-part-of-your-brushing-routine/articleshow/75393122.cms", "urlToImage": null, "publishedAt": "2020-04-27T03:36:38Z", "content": "Tongue cleaning is an equally essential step as brushing. While cleaning your teeth, you must never skip the tongue scrapping part. You can either use your toothbrush to clean your tongue lightly or use a tongue scrapper for the purpose. Here are some reasons… [+1951 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Ryan Merrifield, Emma Bowden", "title": "Coronavirus: Doctors without PPE face 'awful dilemma' of whether to resuscitate patients - Mirror Online", "description": "The Health Consultants and Specialists Association is pushing Public Health England to re-think its guidance after a quarter of doctors admitted facing infected patients without adequate PPE", "url": "https://www.mirror.co.uk/news/uk-news/coronavirus-doctors-without-ppe-face-21930977", "urlToImage": null, "publishedAt": "2020-04-27T03:27:50Z", "content": "Union bosses have urged frontline doctors fearing for their lives against performing CPR on virus patients unless they have adequate PPE, it is claimed.\r\nThe Daily Telegraph reports the Health Consultants and Specialists Association (HCSA) has put pressure on… [+3688 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Business owners seek guidance on re-opening - 41 Action News", "description": "Several area leaders are meeting this week to formulate plans on how to re-open the Kansas City metro following weeks of stay-at-home orders.", "url": "https://www.youtube.com/watch?v=C0S4AkK5o_s", "urlToImage": null, "publishedAt": "2020-04-27T03:18:15Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Wuhan's L-strand behind high mortality in Gujarat? - Times of India", "description": "India News: AHMEDABAD: A senior government official in Gujarat on Sunday said experts have pointed out that the prevalence of L-strain of Covid-19 virus - which w.", "url": "https://timesofindia.indiatimes.com/india/wuhans-l-strand-behind-high-mortality-in-gujarat/articleshow/75397342.cms", "urlToImage": null, "publishedAt": "2020-04-27T02:26:47Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Keto, Intermittent Fasting can help you lose weight and manage diabetes, say experts - Times of India", "description": "Researchers have claimed that certain diet plans can not only effectively manage weight problems but also prevent or treat diabetes to an extent.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/keto-intermittent-fasting-can-help-you-lose-weight-and-manage-diabetes-say-experts/photostory/75381445.cms", "urlToImage": null, "publishedAt": "2020-04-27T01:30:00Z", "content": "And now, new researchers have claimed that certain diet plans can not only effectively manage weight problems but also prevent or treat diabetes to an extent.\r\nWhile we do know that certain lifestyle diseases are a result of bad eating habits and low levels o… [+219 chars]"}, {"source": {"id": null, "name": "Indiaspend.com"}, "author": "Chaitanya Mallapur", "title": "COVID-19 Lockdown Is The Best Time To Quit Tobacco - IndiaSpend", "description": "The temporary ban on the sale of tobacco products during the ongoing lockdown to curb the spread of COVID-19 can be an opportunity to reduce tobacco consumption in India, the world's second biggest", "url": "https://www.indiaspend.com/covid-19-lockdown-is-the-best-time-to-quit-tobacco/", "urlToImage": null, "publishedAt": "2020-04-27T00:30:00Z", "content": "Mumbai: The temporary ban on the sale of tobacco products during the ongoing lockdown to curb the spread of COVID-19 is an opportunity to reduce tobacco consumption in India, the worlds second biggest consumer, experts say. Forced to go without tobacco for ov… [+17936 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: How India will play a major role in a Covid-19 vaccine - BBC News", "description": "As one of the world's biggest vaccine makers, India could to play a big role in stopping the virus.", "url": "https://www.bbc.com/news/world-asia-india-52363791", "urlToImage": null, "publishedAt": "2020-04-26T23:14:23Z", "content": "Image caption\r\n Half a dozen Indian companies are developing vaccines for coronavirus\r\nUS Secretary of State Mike Pompeo said last fortnight that India and the US were working together to develop vaccines against the coronavirus. \r\nMr Pompeo's remark didn't e… [+4660 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Kabir Firaque", "title": "Explained: Where does COVID-19 virus first strike? Study pinpoints two cell types in nose - The Indian Express", "description": "The new study has identified the specific cells where the mechanism of entry most likely comes into play when the virus begins it attack.", "url": "https://indianexpress.com/article/explained/where-does-covid-19-virus-first-strike-study-pinpoints-two-cell-types-in-nose-6380544/", "urlToImage": null, "publishedAt": "2020-04-26T23:10:20Z", "content": "Written by Kabir Firaque\r\n | New Delhi | \r\nUpdated: April 27, 2020 8:16:36 am\r\nLike all coronaviruses, SARS-CoV2 consists of a fatty envelope with a spike protein on the surface. The spike acts as the key to unlock a protein on the human cell, called ACE2, wh… [+4674 chars]"}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "Dileep V Kumar", "title": "Health department augments testing strategy to reach out to more people - The New Indian Express", "description": "While the fear of community transmission continues to hang in the air, Kerala has adopted testing as its mantra to combat Covid-19.", "url": "https://www.newindianexpress.com/cities/thiruvananthapuram/2020/apr/27/health-department-augments-testing-strategy-to-reach-out-to-more-people-2135705.html", "urlToImage": null, "publishedAt": "2020-04-26T22:24:00Z", "content": "THIRUVANANTHAPURAM: While the fear of community transmission continues to hang in the air, Kerala has adopted testing as its mantra to combat Covid-19. Shaping new strategies, the health department is now augmenting testing facilities to reach out to more peo… [+1986 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: children in Spain leave homes for first time in 6 weeks - BBC News - BBC News", "description": "Spain, which has had one of the strictest lockdowns in Europe, is allowing children to leave their homes, if they're with an adult, for the first time in six...", "url": "https://www.youtube.com/watch?v=ykUvfGAA8nk", "urlToImage": null, "publishedAt": "2020-04-26T21:42:38Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Chile to introduce controversial certificate - BBC News", "description": "People who recover from Covid-19 will get a certificate despite a World Health Organization warning.", "url": "https://www.bbc.co.uk/news/world-latin-america-52436330", "urlToImage": null, "publishedAt": "2020-04-26T21:35:33Z", "content": "Image copyrightReutersImage caption\r\n Chile has confirmed more than 13,000 cases of Covid-19\r\nChile's government has said it will go ahead with a controversial plan to issue certificates to people who have recovered from Covid-19.\r\nThe documents would be give… [+1338 chars]"}, {"source": {"id": null, "name": "Reliefweb.int"}, "author": null, "title": "Coronavirus disease 2019 (COVID-19): Situation Report - 97 (26 April 2020) - World - ReliefWeb", "description": "English Situation Report on World about Health and Epidemic; published on 26 Apr 2020 by WHO", "url": "https://reliefweb.int/report/world/coronavirus-disease-2019-covid-19-situation-report-97-26-april-2020", "urlToImage": null, "publishedAt": "2020-04-26T20:40:36Z", "content": "HIGHLIGHTS\r\n• Public health systems are coming under severe strain as the COVID-19 pandemic\r\ncontinues. Countries must also continue to focus on other health emergencies and\r\nmake progress against diseases such as malaria or poliomyelitis (polio). A new\r\nanal… [+1171 chars]"}, {"source": {"id": null, "name": "Nzherald.co.nz"}, "author": "NZ Herald", "title": "Covid 19 coronavirus: What went wrong in Italy? - New Zealand Herald", "description": "Italy's 26,600 fatalities lags behind only the U.S. in the global Covid-19 death toll.", "url": "https://www.nzherald.co.nz/world/news/article.cfm?c_id=2&objectid=12327725", "urlToImage": null, "publishedAt": "2020-04-26T20:37:30Z", "content": "As Italy prepares to emerge from the West's first and most extensive coronavirus lockdown, it is increasingly clear that something went terribly wrong in Lombardy, the hardest-hit region in Europe's hardest-hit country.\r\n Italy had the bad luck of being the f… [+14646 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "HRD Ministry wants universities to study how India handled 1918 Spanish flu, revived economy - India Today", "description": "The HRD Ministry has also advised the universities to set up research teams and study the levels of awareness of Covid-19 in villages near their campuses.", "url": "https://www.indiatoday.in/education-today/news/story/hrd-ministry-wants-universities-to-study-how-india-handled-1918-spanish-flu-revived-economy-1671448-2020-04-27", "urlToImage": null, "publishedAt": "2020-04-26T20:26:34Z", "content": "The HRD Ministry has asked universities to study how India handled the Spanish flu pandemic in 1918 and what measures were taken to boost the economy.\r\nThe ministry has also advised the universities to set up research teams and study the levels of awareness o… [+1653 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "HEALTH FOCUS: COVID-19 disrupts mass immunisation campaigns - NTVUganda", "description": "Immunization services are some of the primary health care activities that are expected to be affected by the COVID-19 pandemic which could be another catastr...", "url": "https://www.youtube.com/watch?v=Fw4N-nVX7BU", "urlToImage": null, "publishedAt": "2020-04-26T18:25:54Z", "content": null}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Pam Belluck", "title": "32 Days on a Ventilator: One Covid Patient’s Fight to Breathe Again - The New York Times", "description": "Jim Bello, 49 and healthy, fell gravely ill, highlighting agonizing mysteries of the coronavirus. Doctors’ relentless effort to save him was a roller-coaster of devastating and triumphant twists.", "url": "https://www.nytimes.com/2020/04/26/health/coronavirus-patient-ventilator.html", "urlToImage": null, "publishedAt": "2020-04-26T18:18:44Z", "content": "HINGHAM, Mass. Is he going to make it? Kim Bello asked, clutching her phone, alone in her yard.\r\nShe had slipped outside so her three children, playing games in the living room, could be shielded from a wrenching conversation with a doctor treating her husban… [+15430 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nRobert Mendick,", "title": "'Game changing' Oxford antibody test claims 'overblown' - Telegraph.co.uk", "description": "Government sources said the test, which claims to produce a result within an hour, had yet to be approved by a regulator", "url": "https://www.telegraph.co.uk/news/2020/04/26/game-changing-oxford-antibody-test-claims-overblown/", "urlToImage": null, "publishedAt": "2020-04-26T18:09:00Z", "content": "Hopes for the discovery of a game changing immunity test for Covid-19 were dealt a new blow on Sunday when the Government was forced to deny claims it had ordered up to 50 million home testing kits.\r\nScientists are racing to manufacture an antibody test that … [+2922 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Chanel Georgina", "title": "Coronavirus symptoms: What's that on your skin? Could it be a sign of COVID-19? - Express", "description": "CORONAVIRUS has a plethora of symptoms, with some reported more commonly than others. What's that on your skin? Could it be a sign of COVID-19?", "url": "https://www.express.co.uk/life-style/health/1274111/coronavirus-symptoms-red-rash-skin-CDC-WHO-NHS", "urlToImage": null, "publishedAt": "2020-04-26T17:55:48Z", "content": "The CDC outline very dangerous side effects of the virus – all of which need immediate medical attention.\r\nFor example, any \"trouble breathing\", \"persistent pain or pressure in the chest\", or \"new confusion or inability to arouse\" requires somebody to dial 99… [+176 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "UK vaccine trial volunteer says she is 'doing fine' after online death rumours - The Guardian", "description": "A fake article about Elisa Granato’s death was circulated on social media", "url": "https://www.theguardian.com/world/2020/apr/26/uk-coronavirus-vaccine-trial-subject-doing-fine-online-death-rumours-elisa-granato", "urlToImage": null, "publishedAt": "2020-04-26T17:33:48Z", "content": "One of the first people to be injected as part of UK human trials for a coronavirus vaccine has said she is doing fine, after a fake article about her death was circulated on social media.\r\nThe article claims that microbiologist Dr Elisa Granato, who took par… [+2400 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Agence France-Presse", "title": "‘Can have serious side effects’: Canada warns Hydroxychloroquine use against Covid-19 - Hindustan Times", "description": "The European Medicines Agency on Thursday issued a similar warning about the drugs, whose promise as a coronavirus treatment has been touted by US President Donald Trump.", "url": "https://www.hindustantimes.com/world-news/can-have-serious-side-effects-canada-warns-hydroxychloroquine-use-against-covid-19/story-PI9kobMMhAP4ZI6eww7JKK.html", "urlToImage": null, "publishedAt": "2020-04-26T17:07:30Z", "content": "Canadian health authorities have issued a warning against the use of anti-malarial drugs chloroquine and hydroxychloroquine to treat coronavirus infections or prevent reinfections.\r\n“Chloroquine and hydroxychloroquine can have serious side effects. These drug… [+516 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "CDC Adds Six New COVID-19 Symptoms - Newsy", "description": "Previously, only fever, shortness of breath and coughing were listed as symptoms for the coronavirus. Now, there are 6 new symptoms to look out for. Learn mo...", "url": "https://www.youtube.com/watch?v=naWLq3SVnLM", "urlToImage": null, "publishedAt": "2020-04-26T16:24:50Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AP", "title": "As virus lockdown eases, Italy ponders what went wrong - Economic Times", "description": "Italy's first homegrown case was recorded Feb 21, at a time when the World Health Organisation was still insisting the virus was  containable  and not nearly as infectious as the flu.", "url": "https://economictimes.indiatimes.com/news/international/world-news/as-virus-lockdown-eases-italy-ponders-what-went-wrong/articleshow/75393536.cms", "urlToImage": null, "publishedAt": "2020-04-26T15:27:39Z", "content": "Rome: As Italy prepares to emerge from the West's first and most extensive coronavirus lockdown, it is increasingly clear that something went terribly wrong in Lombardy, the hardest-hit region in Europe's hardest-hit country. Italy had the bad luck of being t… [+5194 chars]"}, {"source": {"id": null, "name": "Arabnews.com"}, "author": "AFP", "title": "Two Dutch mink farms infected with coronavirus - Arabnews", "description": "THE HAGUE: Dutch authorities Sunday cordoned off two mink farms in the southern Netherlands after tests showed the animals had been infected with the coronavirus, most likely from human contact. The farms are located east of Eindhoven in the Northern Brabant …", "url": "https://www.arabnews.com/node/1665311", "urlToImage": null, "publishedAt": "2020-04-26T15:01:31Z", "content": "KABUL: The US envoy for Afghanistan, Zalmay Khalilzad, on Sunday urged the Taliban to suspend attacks on Afghan government forces until the threat of coronavirus had disappeared from the country.\r\nHe also reminded President Ashraf Ghani and his rival Dr. Abdu… [+3956 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Sgt. Philip Kahn, Whose Life Spans 2 Global Pandemics, Dies At 100 | Sunday TODAY - TODAY", "description": "Sgt. Philip Kahn was born in 1919 during the flu pandemic that killed 50 million people worldwide, including his twin brother weeks after birth. Kahn died la...", "url": "https://www.youtube.com/watch?v=J8LMN2OEjfA", "urlToImage": null, "publishedAt": "2020-04-26T14:33:02Z", "content": null}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Eden David", "title": "A reality check on antibody testing: How do we race forward thoughtfully? - ABC News", "description": "", "url": "https://abcnews.go.com/Health/reality-check-antibody-testing-race-forward-thoughtfully/story?id=70214520", "urlToImage": null, "publishedAt": "2020-04-26T13:03:48Z", "content": "As U.S. government officials begin debating the right steps in easing restrictions due to the novel coronavirus, antibody tests have been touted as the key to returning to normal.\r\nThis particular type of test can detect whether or not a person has developed … [+12523 chars]"}, {"source": {"id": null, "name": "Ommcomnews.com"}, "author": "OMMCOM NEWS", "title": "'Asymptomatic Transmission Achilles' Heel Of COVID-19 Strategies' - Ommcom News", "description": "Calling for unprecedented measures to defeat COVID-19, researchers form University of California, San Francisco have said that asymptomatic transmission of SARS-CoV-2 has made controlling the spread of the disease all the more difficult.", "url": "https://www.ommcomnews.com/world-news/-asymptomatic-transmission-achilles-heel-of-covid-19-strategies-", "urlToImage": null, "publishedAt": "2020-04-26T12:33:32Z", "content": "Subscribe\r\nSubscribe to never miss a news \r\nLondon: Calling for unprecedented measures to defeat COVID-19, researchers form University of California, San Francisco have said that asymptomatic transmission of SARS-CoV-2 has made controlling the spread of the d… [+2526 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Anushree Gupta", "title": "Autopsy shows US woman's heart 'burst open' due to coronavirus, patient dies of cardiac arrest - Times Now", "description": "The 57-year-old woman, from Santa Clara County, California, had traces of coronavirus in her heart, lungs, trachea, and intestines, the autopsy report stated.", "url": "https://www.timesnownews.com/health/article/autopsy-shows-us-womans-heart-burst-open-due-to-coronavirus-patient-dies-of-cardiac-arrest/583253", "urlToImage": null, "publishedAt": "2020-04-26T11:49:23Z", "content": "<ul><li>The coronavirus pandemic has infected more than 2.5 million people around the world</li><li>According to recent reports, a woman's heart 'burst open' due to COVID-19 complications in the US</li><li>The patient reportedly died in February, but her auto… [+1901 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Silver Lining? UK Gov’t Orders 50 Million ‘Immunity Tests’ Amid Scientific “Breakthrough” - Sputnik International", "description": "The development may offer a ray of hope as the number of confirmed COVID-19 cases in the UK hits 148,000, with 20,319 deaths as of the morning of Sunday, April 26.", "url": "https://sputniknews.com/uk/202004261079098293-UK-GOV-50-million/", "urlToImage": null, "publishedAt": "2020-04-26T11:29:53Z", "content": "The development may offer a ray of hope as the number of confirmed COVID-19 cases in the UK hits 148,000, with 20,319 deaths as of the morning of Sunday, April 26. \r\nThe UK government has ordered 50 million immunity tests which allegedly show if a person has … [+2991 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "For a woman stuck at home in Brooklyn, coronavirus lockdown brings back memories of a decades-old LSD trip - Firstpost", "description": "Amid the coronavirus lockdown, all it took was a Bob Dylan song to bring back memories of a summer in Alaska.", "url": "https://www.firstpost.com/world/for-a-woman-stuck-at-home-in-brooklyn-coronavirus-lockdown-brings-back-memories-of-a-decades-old-lsd-trip-8301651.html", "urlToImage": null, "publishedAt": "2020-04-26T11:22:27Z", "content": "It was Day 8 of quarantine for me and my family. My son had returned from his semester abroad in Europe, and so we were all hunkered down in our Brooklyn house, cooking, eating, working together and listening to music. Dean, 20, was mostly in charge of the so… [+5940 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Coronavirus in Goa: All seven COVID-19 cases recovered; Here’s how a novel treatment worked for the state - The Financial Express", "description": "COVID-19: While Dr Gomes hopes for the development of a vaccine soon, he also puts equal weightage on the need to treat people with human proximity.", "url": "https://www.financialexpress.com/lifestyle/health/coronavirus-in-goa-all-seven-covid-19-cases-recovered-heres-how-a-novel-treatment-worked-for-the-state/1939976/", "urlToImage": null, "publishedAt": "2020-04-26T10:46:40Z", "content": "Coronavirus pandemic: In Goa, doctors modified the coronavirus treatment with a human touch to ensure the recovery of its patients. The state has witnessed seven positive cases so far and it has no active cases now. While the state is gearing up for a possibl… [+3008 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Tech Desk", "title": "How to track coronavirus (COVID-19) cases live in India - The Indian Express", "description": "Coronavirus (COVID-19) trackers: There are several coronavirus trackers available that let you track the live updates of the confirmed COVID-19 cases along with the recovered and deceased cases.", "url": "https://indianexpress.com/article/technology/tech-news-technology/how-to-track-coronavirus-covid-19-cases-live-in-india-6379726/", "urlToImage": null, "publishedAt": "2020-04-26T10:15:45Z", "content": "By: Tech Desk | New Delhi | \r\nUpdated: April 26, 2020 3:42:20 pm\r\nHow to track coronavirus (COVID-19) cases live in IndiaCoronavirus (COVID-19) cases are rising in the country with every passing day. This is worrying people sitting at home for over a month no… [+3327 chars]"}, {"source": {"id": null, "name": "Thelogicalindian.com"}, "author": "Palak Agrawal", "title": "Oxford University Starts COVID-19 Vaccine Trials, First Volunteer Injected - The Logical Indian", "description": "The aim is to quicken the process and make the vaccines available to the residents of UK by...", "url": "https://thelogicalindian.com/news/covid-19-vaccine-trials-on-human-to-start-in-uk-20780", "urlToImage": null, "publishedAt": "2020-04-26T09:26:49Z", "content": "Microbiologist Elisa Granato has become the first human to be injected for the human trial phase of a potential vaccine of COVID-19 by a group of scientists at the University of Oxford, UK.\r\nThe ground-breaking vaccine is set to be tried on around 800 volunte… [+2177 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Women face anxiety over pregnancy and birth in US - TRT World", "description": "For many women, being pregnant comes with its own set of fears and anxiety. But being pregnant during the Covid-19 pandemic takes those fears to a whole new ...", "url": "https://www.youtube.com/watch?v=gagwijdvCR0", "urlToImage": null, "publishedAt": "2020-04-26T08:10:16Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "40 people in a village in Port St Johns have tested positive for the corona virus - eNCA", "description": "The COVID-19 outbreak appears to be growing in the Eastern Cape. The province currently has 4-hundred and 88 confirmed cases and ten deaths. It's reported th...", "url": "https://www.youtube.com/watch?v=yU-usyRdS5c", "urlToImage": null, "publishedAt": "2020-04-26T06:57:56Z", "content": "The COVID-19 outbreak appears to be growing in the Eastern Cape. The province currently has 4-hundred and 88 confirmed cases and ten deaths. It's reported that 40 people in a village in Port St. Johns have tested positive for the virus. On Saturday Eastern Ca… [+102 chars]"}, {"source": {"id": null, "name": "Khaleejtimes.com"}, "author": "AFP", "title": "WHO warns over coronavirus immunity as global death toll tops 200000 - Khaleej Times", "description": "The global death toll in the novel coronavirus pandemic soared past the grim 200,000 milestone on Sunday, as the World Health Organization w...", "url": "https://www.khaleejtimes.com/coronavirus-pandemic/who-warns-over-coronavirus-immunity-as-global-death-toll-tops-200000", "urlToImage": null, "publishedAt": "2020-04-26T05:37:44Z", "content": "The global death toll in the novel coronavirus pandemic soared past the grim 200,000 milestone on Sunday, as the World Health Organization warned against \"immunity passports\" for recovered patients, seen as a possible tool for countries preparing to re-open t… [+5892 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "Second wave of COVID-19 may hit India during monsoon months - Northeast Now", "description": "Though coronavirus cases in India may go down substantially in the coming days, it may again resurface during the monsoon months. According to an India Times report, the second wave is expected to hit the country in the months of July and August. However, acc…", "url": "https://nenow.in/top-news/second-wave-of-covid-19-may-hit-india-during-monsoon-months.html/", "urlToImage": null, "publishedAt": "2020-04-26T03:20:07Z", "content": "Though coronavirus cases in India may go down substantially in the coming days, it may again resurface during the monsoon months.\r\nAccording to an India Times report, the second wave is expected to hit the country in the months of July and August.\r\nHowever, a… [+840 chars]"}, {"source": {"id": null, "name": "Deccanchronicle.com"}, "author": "Balu Pulipaka", "title": "So is Telangana betting on herd immunity? - Deccan Chronicle", "description": "In a sudden policy switch two days ago, health officials stopped testing secondary contacts unless they had covid-19 symptoms", "url": "https://www.deccanchronicle.com/nation/current-affairs/260420/so-is-telangana-betting-on-herd-immunity.html", "urlToImage": null, "publishedAt": "2020-04-26T03:12:00Z", "content": "Hyderabad: Telangana appears to be betting on 'herd immunity' to see itself through what it perceives as the worst of the Covid-19 epidemic.\r\nAuthorities are hoping that the current trend of about 80 per cent of the coronavirus-infected people now in hospital… [+2706 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Hindustan Times", "title": "India records biggest single day spike, virus can survive on particulate matter: Covid-19 news today - Hindustan Times", "description": "Here is a preview of the important Covid-19 stories from India and world today.", "url": "https://www.hindustantimes.com/india-news/india-records-biggest-single-day-spike-virus-can-survive-on-particulate-matter-covid-19-news-today/story-WANk0UoFH42j3DcDdXLDSM.html", "urlToImage": null, "publishedAt": "2020-04-26T02:48:01Z", "content": "India’s tally of confirmed coronavirus disease (Covid-19) cases shot past the 26,000-mark on Saturday with the biggest single-day spike in infections. Tests in Italy found the Sars-CoV-2 virus, which causes Covid-19, can cling to air pollution particles.\r\nInd… [+4828 chars]"}, {"source": {"id": null, "name": "Sakshi.com"}, "author": "Priyadarshini", "title": "India May Face 2nd Wave Of Coronavirus In July-August: Experts - Sakshi English", "description": "Coronavirus disease is an infectious disease caused by a newly discovered COVID-19.", "url": "https://english.sakshi.com/national/2020/04/26/india-may-face-2nd-wave-of-coronavirus-in-july-august-experts", "urlToImage": null, "publishedAt": "2020-04-26T01:16:10Z", "content": "Coronavirus disease is an infectious disease caused by a newly discovered COVID-19. The first case of novel coronavirus was reported in Wuhan, China in December 2019. The infection spreads from one person to another and later, the virus began to appear outsid… [+1496 chars]"}, {"source": {"id": null, "name": "Manoramaonline.com"}, "author": "Reuters", "title": "Could warmer weather help contain the coronavirus? - Onmanorama", "description": "Here's what we know about seasonal features of disease outbreaks.", "url": "https://english.manoramaonline.com/lifestyle/health/2020/04/25/could-warmer-weather-help-contain-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-26T01:01:18Z", "content": "The world is looking for signs that the arrival of warmer weather in the northern hemisphere could slow the spread of the coronavirus outbreak, which has killed more than 1,90,000 people and sent the global economy into a tailspin as countries impose lockdown… [+3652 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Spain reports nearly 3,000 daily virus cases - Times of India", "description": "Europe News: MADRID: Spain's health authorities say 2,944 new Covid-19 infections were confirmed in the previous 24 hours, taking the total to nearly 206,000 cases.", "url": "https://timesofindia.indiatimes.com/world/europe/spain-reports-nearly-3000-daily-virus-cases/articleshow/75380478.cms", "urlToImage": null, "publishedAt": "2020-04-25T23:47:56Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Why has Spain been hit so hard by the coronavirus pandemic? - India Today", "description": "Experts pointed to the country's sociable lifestyle and close ties between young and older family members as significant factors in the virus's spread.", "url": "https://www.indiatoday.in/world/story/why-spain-hit-hard-by-coronavirus-pandemic-1671126-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T22:00:06Z", "content": "In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told news agency AFP.\r\nWhile they stressed it was too early to carry out a detailed analysis, t… [+4429 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "WHO warns against coronavirus 'immunity passports' - Al Jazeera English", "description": "UN health agency says there is 'no evidence' that recovered coronavirus patients are protected from reinfection.", "url": "https://www.aljazeera.com/news/2020/04/warns-coronavirus-immunity-passports-200425150532564.html", "urlToImage": null, "publishedAt": "2020-04-25T21:22:24Z", "content": "The United Nations's health agency has warned there is no scientific evidence to prove that people who have recovered from the coronavirus develop immunity against potential infection in the future, as the global death toll from COVID-19 passed 200,000 on Sat… [+4030 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": null, "title": "WHO warns malaria deaths could double during virus pandemic - cgtn.com", "description": "The new coronavirus pandemic could severely disrupt access to anti-malaria nets and drugs in sub-Saharan", "url": "https://africa.cgtn.com/2020/04/25/who-warns-malaria-deaths-could-double-during-virus-pandemic/", "urlToImage": null, "publishedAt": "2020-04-25T20:47:00Z", "content": "Aedes aegypti Mosquito. Close up a Mosquito sucking human blood.Aedes aegypti Mosquito. Close up a Mosquito sucking human blood,Mosquito Vector-borne diseases,Chikungunya.Dengue fever.Rift Valley fever.Yellow fever.Zika.Mosquito on skin\r\nThe new coronavirus p… [+3281 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Could a Second Wave of Coronavirus Infections Appear? - QuickTake by Bloomberg", "description": "The concern about a second wave of #coronavirus is that, once quelled, the pandemic will resurface with renewed strength Subscribe to our YouTube channel: ht...", "url": "https://www.youtube.com/watch?v=fNZ83AEd7Wk", "urlToImage": null, "publishedAt": "2020-04-25T20:34:42Z", "content": "The concern about a second wave of #coronavirus is that, once quelled, the pandemic will resurface with renewed strength\r\nSubscribe to our YouTube channel: https://bit.ly/2TwO8Gm\r\nQUICKTAKE ON SOCIAL:Follow QuickTake on Twitter: twitter.com/quicktakeLike Quic… [+337 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Harshita Jain", "title": "US FDA gives statement on use of this drug for corona treatment - News Track English", "description": "Washington: The US Food and Drug Administration (US FDA) on Friday warned against the use of the malaria drug hydroxychloroquine. This is the drug that is being used in the treatment of Coronavirus, which US President Donald Trump has consistently and strongl…", "url": "https://english.newstracklive.com/news/us-fda-statement-on-use-of-hydroxychloroquine-for-corona-treatment-mc24-nu764-ta294-1087629-1.html", "urlToImage": null, "publishedAt": "2020-04-25T18:54:20Z", "content": null}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ariana Eunjung Cha", "title": "Spike in stroke deaths in patients with only minor coronavirus symptoms - The Independent", "description": "Reports of strokes in the young and middle-aged are the latest twist in our evolving understanding of the mysteries of the virus, finds Ariana Eunjung Cha", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-stroke-deaths-symptoms-covid-19-heart-a9484091.html", "urlToImage": null, "publishedAt": "2020-04-25T18:45:03Z", "content": "Thomas Oxley wasnt even on call the day he received the page to come into Mount Sinai Beth Israel Hospital in Manhattan. There werent enough doctors to treat all the emergency stroke patients, and he was needed in the operating room.\r\nThe patients chart appea… [+9849 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Prof. K. Ganapathy", "title": "COVID-19 and the nervous system - The Hindu", "description": "In the last few weeks several articles have appeared from various specialists pointing out how the novel coronavirus disease (COVID-19) can affect their respective specialties. SARS-CoV-2, the scienti", "url": "https://www.thehindu.com/news/national/tamil-nadu/covid-19-and-the-nervous-system/article31434974.ece", "urlToImage": null, "publishedAt": "2020-04-25T18:36:51Z", "content": "In the last few weeks several articles have appeared from various specialists pointing out how the novel coronavirus disease (COVID-19) can affect their respective specialties. SARS-CoV-2, the scientific name given to the virus, appears to be truly omnipresen… [+3491 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Ariana Eunjung Cha", "title": "Young and middle-aged people, barely sick with covid-19, are dying of strokes - The Washington Post", "description": "Doctors sound alarm about patients in their 30s and 40s left debilitated or dead by strokes. Some didn’t even know they were infected by coronavirus.", "url": "https://www.washingtonpost.com/health/2020/04/24/strokes-coronavirus-young-patients/", "urlToImage": null, "publishedAt": "2020-04-25T18:18:21Z", "content": "Oxley gasped when he got to the patients age and covid-19 status: 44, positive.\r\nThe man was among several recent stroke patients in their 30s to 40s who were all infected with the coronavirus. The median age for that type of severe stroke is 74.\r\nAs Oxley, a… [+9467 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "2 cell types are entry points for virus - Hindustan Times", "description": "The respiratory tract is filled with numerous cells, among which are goblet cells and ciliated cells.", "url": "https://www.hindustantimes.com/india-news/2-cell-types-are-entry-points-for-virus/story-VZ250MIqdc4r0OIzxsTqPJ.html", "urlToImage": null, "publishedAt": "2020-04-25T17:54:31Z", "content": "Scientists have identified two types of cells in the nose that are likely to be point of infection for the Sars-CoV-2 virus, which causes Covid-19, in the body.\r\nThe respiratory tract is filled with numerous cells, among which are goblet cells and ciliated ce… [+2449 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Hyderabad University's UVC disinfection trolley can clean coronavirus rapidly - India Today", "description": "The University of Hyderabad along with other institutions have created a UVC based disinfection trolley which can clean coronavirus infected areas rapidly.", "url": "https://www.indiatoday.in/education-today/news/story/hyderabad-university-created-uvc-disinfection-trolley-can-clean-coronavirus-rapidly-1671036-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T15:09:42Z", "content": "In a fight against Covid-19, a UVC based disinfection trolley to rapidly clean hospital environment has been created by the International Advanced Research Centre for Powder Metallurgy and New Materials (ARCI), an autonomous R&amp;D Centre of Department of Sc… [+3034 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Can this pulse monitor detect COVID-19? - Good Morning America", "description": "Pulse oximeters can provide an early warning sign of COVID-19 for patients in hospitals, but are those devices as effective when people use them at home?", "url": "https://www.youtube.com/watch?v=z9sypZ7mWRA", "urlToImage": null, "publishedAt": "2020-04-25T14:28:18Z", "content": "Pulse oximeters can provide an early warning sign of COVID-19 for patients in hospitals, but are those devices as effective when people use them at home?"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Free robot delivery for health workers in British town - Reuters", "description": "Ever since the British government imposed strict social distancing, a fleet of robots on wheels have been busy in the town of Milton Keynes, delivering for f...", "url": "https://www.youtube.com/watch?v=nib5bcNVZ8s", "urlToImage": null, "publishedAt": "2020-04-25T13:14:29Z", "content": "Ever since the British government imposed strict social distancing, a fleet of robots on wheels have been busy in the town of Milton Keynes, delivering for free to NHS staff and facing increased demand from the general public. \r\nSubscribe: http://smarturl.it/… [+401 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Explained Desk", "title": "Explained: How coronavirus may affect the kidneys - The Indian Express", "description": "Kidney damage is common in severe cases of Covid-19. However, it is not yet clear if the virus directly attacks the kidneys, or if kidney failure or damage is a part of multiple-organ failure.", "url": "https://indianexpress.com/article/explained/explained-how-coronavirus-may-affect-the-kidneys-6378915/", "urlToImage": null, "publishedAt": "2020-04-25T12:55:05Z", "content": "A patient undergoes dialysis treatment at a dialysis centre, amidst the coronavirus disease (COVID-19) outbreak, in Guayaquil, Ecuador. (Reuters Photo: Santiago Arcos)Apart from ventilators, another kind of machinery that is in shortage amid the coronaviruspa… [+3849 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Kenneth R. Rosen", "title": "Italian Woman Tests Positive for COVID-19 After 60 Days of Quarantine and Swabbing - Newsweek", "description": "Bianca Dobroiu arrived at the Sant'Orsola-Malpighi Polyclinic hospital in Bologna with a fever above 105 degrees and was diagnosed with COVID-19.", "url": "https://www.newsweek.com/italian-woman-tests-positive-covid-19-after-60-days-quarantine-swabbing-1500202", "urlToImage": null, "publishedAt": "2020-04-25T12:30:39Z", "content": "A 23-year-old in Italy being treated for the disease caused by the novel coronavirus continues to test positive, despite two months of quarantine and continual swabs.\r\nBianca Dobroiu arrived at the Sant'Orsola-Malpighi Polyclinic hospital, a public hospital p… [+4335 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "DOH: More than 72000 lab tests conducted for COVID-19 in PH - INQUIRER.net", "description": "More than 72,000 laboratory tests were conducted for checking novel coronavirus or SARS-CoV-2, which causes COVID-19, in the country, the Department of Healt...", "url": "https://www.youtube.com/watch?v=fB_ScQAcFZs", "urlToImage": null, "publishedAt": "2020-04-25T11:58:23Z", "content": "More than 72,000 laboratory tests were conducted for checking novel coronavirus or SARS-CoV-2, which causes COVID-19, in the country, the Department of Health (DOH) said Saturday. Video by PTV\r\nVisit us at https://www.inquirer.netFacebook: https://facebook.co… [+58 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Could stem cell therapy help treat coronavirus? - CBS This Morning", "description": "Doctors are hoping stem cell therapy could be a weapon in the fight against coronavirus. On Friday, regenerative medicine company Mesoblast announced a 300-p...", "url": "https://www.youtube.com/watch?v=4Ul6_EJ3Swg", "urlToImage": null, "publishedAt": "2020-04-25T11:48:58Z", "content": null}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Coronavirus And Smoking: French Researchers Suggest Nicotine Could Protect Against Coronavirus - Swarajya", "description": "", "url": "https://swarajyamag.com/news-brief/coronavirus-and-smoking-french-researchers-suggest-nicotine-could-protect-against-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T11:31:00Z", "content": null}, {"source": {"id": null, "name": "India.com"}, "author": "India.com News Desk", "title": "Coronavirus Will be Destroyed by Acids Present in Stomach, Ramdev Makes Bizarre Claim - India.com", "description": "He also talked about 'Ujjai', a special 'pranayama' (yoga) which could help in the treatment of the coronavirus. He demonstrated the exercise live at the event and asserted that doing the same is a self-testing for coronavirus.", "url": "https://www.india.com/news/india/coronavirus-will-be-destroyed-by-acids-present-in-stomach-ramdev-makes-bizarre-claim-4010634/", "urlToImage": null, "publishedAt": "2020-04-25T11:18:51Z", "content": "New Delhi: At a time when the entire world is struggling to combat the spread of coronavirus outbreak, Yoga guru Ramdev has come up with a bizarre solution to treat COVID-19. Speaking at an event organised by a media organisation,  Ramdev claimed that if COVI… [+1405 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Plasma therapy trials for coronavirus patients begin in Karnataka - Deccan Herald", "description": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.", "url": "https://www.deccanherald.com/state/top-karnataka-stories/plasma-therapy-trials-for-coronavirus-patients-begin-in-karnataka-829772.html", "urlToImage": null, "publishedAt": "2020-04-25T11:00:06Z", "content": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.\r\nFollow latest updates on the COVID-19 pandemic here\r\nIn a tweet, Medical Education Minister K Sudhakar said, \"Happy to … [+1295 chars]"}, {"source": {"id": null, "name": "Euroweeklynews.com"}, "author": null, "title": "CORONAVIRUS: ‘IT’S IN THE AIR’ – ITALIAN SCIENTISTS MAKE A WORRYING DISCOVERY - Euro Weekly News", "description": "In a worrying development, Italian Scientists have detected traces of the coronavirus in particles of air pollution. THE Coronavirus has been detected in News Article", "url": "https://www.euroweeklynews.com/2020/04/25/coronavirus-its-in-the-air-italian-scientists-make-a-worrying-discovery/", "urlToImage": null, "publishedAt": "2020-04-25T10:09:38Z", "content": "THE Coronavirus has been detected in particles of air pollution by Italian scientists looking into whether the illness could be carried this way over long distances and potentially increase the infection rate.\r\nPreliminary work from researchers in Italy found… [+1240 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Cotton, natural silk, chiffon make best materials for homemade masks against COVID-19: Study - The Financial Express", "description": "They said the performance of these fabric layers was close to that of an N95 mask material.  According to the study, substituting the chiffon with natural silk or flannel, or simply using a cotton quilt with cotton-polyester batting, produced similar results.", "url": "https://www.financialexpress.com/lifestyle/health/cotton-natural-silk-chiffon-make-best-materials-for-homemade-masks-against-covid-19-study/1939446/", "urlToImage": null, "publishedAt": "2020-04-25T09:04:27Z", "content": "As people resort to making their own cloth masks due to shortage of surgical and N95 varieties in the wake of the COVID-19 pandemic, a new study says a combination of cotton with natural silk or chiffon can filter out aerosol particles provided that the mask … [+2378 chars]"}, {"source": {"id": null, "name": "Trtworld.com"}, "author": "TRTWorld", "title": "WHO warns against idea of 'immunity passports' - TRT World", "description": "The concept of “immunity passports” or “risk-free certificates” has been floated as a way of allowing people protected against reinfection to return to work.", "url": "https://www.trtworld.com/life/who-warns-against-idea-of-immunity-passports-35737", "urlToImage": null, "publishedAt": "2020-04-25T08:54:25Z", "content": "The concept of immunity passports or risk-free certificates has been floated as a way of allowing people protected against reinfection to return to work.\r\nThis Wednesday, March 11, 2015 photo shows the World Health Organization headquarters building in Geneva… [+1045 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "AP", "title": "Coronavirus: WHO warns against idea of 'immunity passports' - Deccan Herald", "description": "The World Health Organization is cautioning against the idea of “immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.", "url": "https://www.deccanherald.com/international/world-news-politics/coronavirus-world-health-organization-warns-against-idea-of-immunity-passports-829739.html", "urlToImage": null, "publishedAt": "2020-04-25T08:50:01Z", "content": "The World Health Organization is cautioning against the idea of immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.\r\nThe concept of immunity pas… [+813 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "sarthakdogra", "title": "A Second Wave Of COVID 19 Infections In India May Take Place In Monsoon Months - India Times", "description": "Post the lockdown, studies predict that the number of Coronvairus infected cases will be on the rise once again and this will be a part of a second wave of the novel virus in the country. Here is what we need to know to be prepared.", "url": "https://www.indiatimes.com/technology/news/a-second-wave-of-covid-19-infections-in-india-likely-to-take-place-in-monsoon-months-511756.html", "urlToImage": null, "publishedAt": "2020-04-25T07:23:14Z", "content": "Coronavirus cases in India are likely to plateau soon and might even go down for some weeks. There is, however, a possibility of a second wave of the infection sweeping the country in the coming months, experts suggest.\r\nThe second wave is expected to hit the… [+3069 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "World Malaria Day 2020: WHO's anti-malaria campaign and target to eliminate malaria from 35 more... - Firstpost", "description": "According to WHO reports, malaria affected more than 228 million people in the world in 2018 and killed about 405,000 people globally in the same year.", "url": "https://www.firstpost.com/health/world-malaria-day-2020-whos-anti-malaria-campaign-and-target-to-eliminate-malaria-from-35-more-countries-by-2030-8298691.html", "urlToImage": null, "publishedAt": "2020-04-25T06:06:06Z", "content": null}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Nitin Sreedhar", "title": "When a virus jumps: of man, microbes and pandemics - Livemint", "description": "Climate change effects or complex man-animal interactions—why are zoonotic disease outbreaks like covid-19 becoming more frequent?", "url": "https://www.livemint.com/mint-lounge/features/when-a-virus-jumps-of-man-microbes-and-pandemics-11587735889206.html", "urlToImage": null, "publishedAt": "2020-04-25T05:10:40Z", "content": "Inger Andersen, executive director of the UN Environment Programme, said last month that nature was sending humankind a message\" through the coronavirus pandemic and climate crisis. In an interview with The Guardian, the Danish environmentalist said there wer… [+10236 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "G Thing: Pet fashion designer finds unique ways to give back to animal rescue crews - PIX11 News", "description": "She's one of the most in demand New York fashion designers for dog and cats.", "url": "https://www.youtube.com/watch?v=WcRkfwYZcdU", "urlToImage": null, "publishedAt": "2020-04-25T03:02:18Z", "content": "Sign in to report inappropriate content.\r\nSign in"}]}