{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Blood Sugar test: When and how to do it correctly - Times of India", "description": "Constantly monitoring the blood glucose level helps to manage the health condition and prevent complications.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/blood-sugar-test-when-and-how-to-do-it-correctly/photostory/75578538.cms", "urlToImage": "https://static.toiimg.com/photo/75578655.cms", "publishedAt": "2020-05-06T13:35:00Z", "content": "You can do the test multiple times a day to monitor the fluctuation, but it is important to consult your doctor about the frequency. Depending on your health condition, your doctor will tell you how often you should do it. You can do it:\r\nBefore meals and sna… [+525 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Urvashi Dev Rawal", "title": "Two Covid-19 patients given plasma therapy in Jaipur, condition stable - Hindustan Times", "description": "Rajasthan has started the clinical trials for plasma therapy after it obtained permission from ICMR", "url": "https://www.hindustantimes.com/india-news/two-covid-19-patients-given-plasma-therapy-in-jaipur-condition-stable/story-cmUCK6Mjfn1CnNJKYHYCTM.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/06/Pictures/delhi-coronavirus-lockdown-day-35_150c269e-8f99-11ea-8c4e-d383a7371370.jpg", "publishedAt": "2020-05-06T13:14:51Z", "content": "Two Covid-19 patients have been given convalescent plasma therapy at the SMS hospital in Jaipur and doctors say their condition is stable. The plasma donors were recovered Covid-19 patients.\r\nDr Sudhir Bhandari, the principal, SMS Medical College, said both p… [+2986 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Helping health care workers cope - ABC15 Arizona", "description": "It's said being a healthcare worker is a calling. A calling that millions across the U.S. have answered as the country deals with a global health crisis.", "url": "https://www.youtube.com/watch?v=8RxRKMnBEA4", "urlToImage": "https://i.ytimg.com/vi/8RxRKMnBEA4/maxresdefault.jpg", "publishedAt": "2020-05-06T12:55:48Z", "content": "It's said being a healthcare worker is a calling. A calling that millions across the U.S. have answered as the country deals with a global health crisis."}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Did the COVID-19 virus spread long before detection? | Coronavirus Pandemic - WION", "description": "The origin of the coronavirus has become a matter of intense debate. The World Health Organisation (WHO) has asked countries to retest samples from Dec and J...", "url": "https://www.youtube.com/watch?v=YkUWwgYBgf8", "urlToImage": "https://i.ytimg.com/vi/YkUWwgYBgf8/maxresdefault.jpg", "publishedAt": "2020-05-06T12:52:38Z", "content": "The origin of the coronavirus has become a matter of intense debate. The World Health Organisation (WHO) has asked countries to retest samples from Dec and Jan to determine whether the transmission of the virus happened much before it came to the world's noti… [+843 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus mutations: Scientists puzzle over impact - BBC News", "description": "A study has identified a mutation that its authors say could make the coronavirus more infectious.", "url": "https://www.bbc.co.uk/news/health-52557955", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/9F98/production/_112165804_covid-19-4k-1-1-scaled.jpg", "publishedAt": "2020-05-06T12:25:43Z", "content": "Image copyrightWe Are CovertImage caption\r\n Researchers have been tracking changes to the 'spike' of the virus\r\nResearchers in the US and UK have identified hundreds of mutations to the virus which causes the disease Covid-19. \r\nBut none has yet established w… [+2800 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Lucy Jones", "title": "As common symptoms fade coronavirus patients face deadly blood clots, docs warn - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11554807/common-symptoms-fade-coronavirus-blood-clots/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/04/NINTCHDBPICT000580161456.jpg?strip=all&quality=100&w=724&h=482&crop=1", "publishedAt": "2020-05-06T12:20:16Z", "content": "CORONAVIRUS patients are facing deadly blood clots after their respiratory symptoms fade, doctors are warning.\r\nUS medics say they have started to notice this troubling blood-clotting phenomenon, which is occurring more frequently in Covid-19 patients.\r\n Covi… [+5485 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Sam Meredith", "title": "Millions of people are expected to fall ill with tuberculosis due to coronavirus lockdown - CNBC", "description": "\"This situation makes me sick, because (it) is totally avoidable,\" Lucica Ditiu, executive director of the Stop TB Partnership, said.", "url": "https://www.cnbc.com/2020/05/06/coronavirus-millions-of-people-expected-to-fall-ill-with-tuberculosis.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106522684-1588762025420gettyimages-1211085918.jpeg?v=1588762457", "publishedAt": "2020-05-06T12:04:26Z", "content": "Migrant labourers stand in a queue for medical checkup after reaching quarantine center at their hometown Allahabad during Government imposed nationwide lockdown as a prventive measure against the COVID-19 corona virus in Allahabad, India on April 27, 2020.\r\n… [+3541 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NHS Covid-19 app: Hands on with the new coronavirus tracing app | LBC - LBC", "description": "LBC has taken a look through how the new NHS coronavirus tracing app. The app is a key part of the UK's plan to get the country out of lockdown to help track...", "url": "https://www.youtube.com/watch?v=6gdZFre2UoE", "urlToImage": "https://i.ytimg.com/vi/6gdZFre2UoE/maxresdefault.jpg", "publishedAt": "2020-05-06T12:00:07Z", "content": "LBC has taken a look through how the new NHS coronavirus tracing app.\r\nThe app is a key part of the UK's plan to get the country out of lockdown to help track, trace and test people that may have contracted coronavirus.\r\nThe idea is that anyone who has been i… [+1530 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Italy claims to develop first COVID-19 vaccine: Here is the current status of all the potential coronavirus vaccines - Times of India", "description": "The world has joined hands to find a vaccine for the novel coronavirus and scientists and medical researchers across the globe are scrambling for the first breakthrough. Since the virus spreads easily and is already overwhelming the healthcare system of most …", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/italy-claims-to-develop-first-covid-19-vaccine-here-is-the-current-status-of-all-the-potential-coronavirus-vaccines/photostory/75575319.cms", "urlToImage": "https://static.toiimg.com/photo/75575349.cms", "publishedAt": "2020-05-06T11:02:21Z", "content": "The malaria drug paved its way to the limelight after reports of Donald Trump requesting India to supply hydroxychloroquine to the US surfaced online. The US President has been backing the malaria drug as a treatment for the novel coronavirus, even though the… [+1159 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express Web Desk", "title": "Italian firm claims to have developed vaccine that neutralises coronavirus in human cells - The Indian Express", "description": "Italy Coronavirus Covid-19 Vaccine: A team of scientists at Italian medical firm Takis conducted tests on a mice which, after a single vaccination, developed antibodies that can block the virus from infecting human cells, ANSA reported.", "url": "https://indianexpress.com/article/world/italian-firms-covid-19-vaccine-takis-spallanzani-6396531/", "urlToImage": "https://images.indianexpress.com/2020/04/covid-test-2.jpg?w=759", "publishedAt": "2020-05-06T10:45:14Z", "content": "According to tests carried out at Romes infectious-disease Spallanzani Hospital, the vaccine has antibodies generated in mice that work on human cells.An Italian medical firm has claimed to have developed a vaccine that neutralises the novel coronavirus in hu… [+2668 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Candle Light Day; Ugandans asked not to forget fight against HIV - NTVUganda", "description": "Whereas the Country is now focussed on the fight against COVID-19, the Minister of Presidency Esther Mbayo has asked the population not to forget about Sexua...", "url": "https://www.youtube.com/watch?v=T_UtWLVR0PA", "urlToImage": "https://i.ytimg.com/vi/T_UtWLVR0PA/maxresdefault.jpg", "publishedAt": "2020-05-06T10:43:29Z", "content": "Whereas the Country is now focussed on the fight against COVID-19, the Minister of Presidency Esther Mbayo has asked the population not to forget about Sexually Transmitted Diseases. While addressing the Media on the preparations of the celebrations of the Ca… [+313 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Vanessa Chalmers Health Reporter For Mailonline", "title": "Obese people may be at risk of coronavirus because fat cells are infection targets - Daily Mail", "description": "Researchers from Germany and the US explained fat cells secrete ACE-2 receptors - known as the 'gateway' into the cells of the body.", "url": "https://www.dailymail.co.uk/news/article-8291869/Obese-people-risk-coronavirus-fat-cells-infection-targets.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/06/10/28065400-0-image-a-11_1588758526968.jpg", "publishedAt": "2020-05-06T10:37:33Z", "content": "The reason why obese people may be more at risk of dying from coronavirus could be because their fat cells make large amounts of a protein used by the infection to infiltrate human cells.\r\nThe coronavirus - scientifically called SARS-CoV-2 - latches onto ACE-… [+16237 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Coronavirus Spread Swiftly in Late 2019 and is Now Adapting to Its Human Hosts, Shows Genetic Mutation St... - News18", "description": "A study by scientists at University College London's Genetics Institute found almost 200 recurrent genetic mutations of the new coronavirus - SARS-CoV-2 - which researchers said showed how it may be evolving as it spreads in people.", "url": "https://www.news18.com/news/world/coronavirus-spread-swiftly-in-late-2019-and-is-adapting-to-human-hosts-genetic-mutation-study-2608203.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1588182233_rtx7gbzs.jpg", "publishedAt": "2020-05-06T10:34:39Z", "content": "A genetic analysis of samples from more than 7,500 people infected with COVID-19 suggests the new coronavirus spread quickly around the world late last year and is adapting to its human hosts, scientists said on Wednesday.\r\nA study by scientists at University… [+2650 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Nursing cancer patients during COVID-19 - NEWS CENTER Maine", "description": "Nurses at Northern Light Cancer Care are dealing with physical and emotional changes during the coronavirus pandemic to better protect susceptible patients.", "url": "https://www.youtube.com/watch?v=xewPkvW7jn0", "urlToImage": "https://i.ytimg.com/vi/xewPkvW7jn0/hqdefault.jpg", "publishedAt": "2020-05-06T10:33:09Z", "content": null}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "AP", "title": "With COVID-19 tracing apps comes privacy tradeoffs: Here's why you should be worried - India TV News", "description": "As governments around the world consider how to monitor new coronavirus outbreaks while reopening their societies, many are starting to bet on smartphone apps to help stanch the pandemic.", "url": "https://www.indiatvnews.com/technology/news-with-covid-19-tracing-apps-comes-privacy-tradeoffs-614694", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/05/covid-19-1588760178.jpg", "publishedAt": "2020-05-06T10:32:58Z", "content": "Virus Outbreak Phone Surveillance\r\nAs governments around the world consider how to monitor new coronavirus outbreaks while reopening their societies, many are starting to bet on smartphone apps to help stanch the pandemic. But their decisions on which technol… [+5981 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Anushree Gupta", "title": "Structure of SARS-CoV-2 virus offers clue to high infection rate - Study - Times Now", "description": "In order to infect a cell, they said features of the spike protein must bind with a receptor on the host cell's surface, and cats have a receptor binding site that closely matches that of humans.", "url": "https://www.timesnownews.com/health/article/structure-of-sars-cov-2-virus-offers-clue-to-high-infection-rate-study/587835", "urlToImage": "https://imgk.timesnownews.com/story/coronavirus_reuters_26.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-06T10:04:13Z", "content": "New York: Researchers studying the structure of the novel coronavirus that causes COVID-19 have found a unique feature in the virus that could explain its high transmissibility between people, an advance that may help develop new drugs against the disease.The… [+2423 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Scientists release app to track COVID-19 symptoms, inform users about hotspots - Deccan Herald", "description": "Scientists have developed an app that provides insights on COVID-19 hot spots, and the symptoms users must look out for, an advance that may aid public health officials in their efforts to contain the coronavirus pandemic.", "url": "https://www.deccanherald.com/science-and-environment/scientists-release-app-to-track-covid-19-symptoms-inform-users-about-hotspots-834212.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/06/iStock-1213943211-1588762339.jpg", "publishedAt": "2020-05-06T10:00:01Z", "content": "Scientists have developed an app that provides insights on COVID-19 hot spots, and the symptoms users must look out for, an advance that may aid public health officials in their efforts to contain the coronavirus pandemic.\r\nTrack live updates on coronavirus h… [+1998 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "Heating may effectively disinfect N95 masks for reuse - Northeast Now", "description": "Researchers have found that heating is the best way to disinfect N95 masks for reuse. As per reports, a study had been conducted by some researchers in the US regarding the efficiency of various methods used for disinfecting masks. After testing various metho…", "url": "https://nenow.in/health/heating-may-effectively-disinfect-n95-masks-for-reuse.html/", "urlToImage": "https://nenow.in/wp-content/uploads/2020/05/Story-2-4.jpg", "publishedAt": "2020-05-06T09:23:50Z", "content": "Researchers have found that heating is the best way to disinfect N95 masks for reuse.\r\nAs per reports, a study had been conducted by some researchers in the US regarding the efficiency of various methods used for disinfecting masks.\r\nAfter testing various met… [+1203 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Bhavya Sukheja", "title": "Study reveals coronavirus has mutated and appears to be more contagious now - Republic World - Republic World", "description": "While leaders are scrambling to contain the spread of coronavirus, scientists have no identified a new strain of the virus which appears to be more contagious.", "url": "https://www.republicworld.com/world-news/rest-of-the-world-news/coronavirus-has-mutated-and-believed-to-be-more-contagious-study.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/hr1qkxtr3fulhhbh_1588754008.jpeg?tr=f-jpeg", "publishedAt": "2020-05-06T08:48:00Z", "content": "While world leaders are scrambling to contain the spread of the deadly coronavirus outbreak, scientists have now identified that coronavirus has mutated and it appears to be more contagious now. According to a study led by scientists at Los Alamos National La… [+2160 chars]"}, {"source": {"id": null, "name": "France24.com"}, "author": "FRANCE 24", "title": "France records 330 Covid-19 deaths in 24 hours, highest in six days - FRANCE 24 English", "description": "The number of people who died from Covid-19 in France increased by 330 to 25,531 on Tuesday, the sharpest rate of increase in six days, government data showed.", "url": "https://www.france24.com/en/20200505-france-records-330-covid-19-deaths-in-24-hours-highest-in-six-days", "urlToImage": "https://s.france24.com/media/display/792fa434-8ef9-11ea-8064-005056bff430/w:1240/p:16x9/may5-france.JPG", "publishedAt": "2020-05-06T08:35:25Z", "content": "The number of people who died from Covid-19 in France increased by 330 to 25,531 on Tuesday, the sharpest rate of increase in six days, government data showed. \r\n France's health ministry said the number of people in intensive care units fell to 3,430 from 3,… [+1333 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Anushree Gupta", "title": "COVID-19 Treatment: Scientists look to a llama for antibodies against SARS-CoV-2 virus - Times Now", "description": "The researchers chose the llama, as the animal and other animals of the camel family produce standard and smaller antibodies, which help the researchers study them better.", "url": "https://www.timesnownews.com/health/article/covid-19-treatment-scientists-look-to-a-llama-for-antibodies-against-sars-cov-2-virus/587773", "urlToImage": "https://imgk.timesnownews.com/story/llama.PNG?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-06T08:12:44Z", "content": "<ul><li>Researchers have identified a llama, called Winter, to help with antibodies against the novel coronavirus</li><li>Four years ago, the researchers had given the llama safe amounts of the SARS and MERS viruses</li><li>The novel coronavirus is a close co… [+1768 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Salome Phelamei", "title": "Volunteers to be injected with coronavirus as hunt for COVID-19 vaccine heats up: How will it help? - Times Now", "description": "Healthy adults will be injected with the novel coronavirus in an attempt to help speed up the COVID-19 vaccine development process.", "url": "https://www.timesnownews.com/health/article/volunteers-to-be-injected-with-coronavirus-as-hunt-for-covid-19-vaccine-heats-up-how-will-it-help/587751", "urlToImage": "https://imgk.timesnownews.com/story/vaccine-human-trials.gif?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-06T07:48:03Z", "content": "<ul><li>As scientists across the world scramble to find a safe vaccine for COVID-19, healthy adults will be injected with the virus</li><li>The aim of the Human Challenge Trials is to help speed up vaccine development</li><li>Till date, there is no specific t… [+3517 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Dr. Kamal Kant Kohli", "title": "Green tea augments weight loss efforts, finds study - Medical Dialogues", "description": "Green tea is known to contain antioxidants and has several health benefits.Several studies have...", "url": "https://medicaldialogues.in/medicine/news/green-tea-augments-weight-loss-efforts-finds-study-65507", "urlToImage": "https://medicaldialogues.in/h-upload/2020/01/21/123318-tea-drinking.jpg", "publishedAt": "2020-05-06T06:44:21Z", "content": "Green tea is known to contain antioxidants and has several health benefits.Several studies have suggested that the flavonoids and caffeine in green tea can help elevate metabolic rate, increase fat oxidation and even improve insulin activity.\r\nIn a new system… [+1744 chars]"}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "PTI", "title": "Indian-origin scientist identifies 4 possible drugs for COVID-19 - The New Indian Express", "description": "The study, published in the journal Pathogens, found that all four drugs were effective in inhibit-ing, or blocking, the coronavirus’ RNA proteins from making genomic copies of the novel coronavirus.", "url": "https://www.newindianexpress.com/world/2020/may/06/indian-origin-scientist-identifies-4-possible-drugs-for-covid-19-2139831.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2020/4/29/w600X390/AP20101756277973.jpg", "publishedAt": "2020-05-06T05:42:00Z", "content": "WASHINGTON: An Indian-origin researcher in the US and his team have identified four antiviral drugs - including remdesivir that was originally developed to treat Ebola - which may be effective in inhibiting  the replication of the novel coronavirus.\r\nKamlendr… [+1511 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Swagata Yadavar", "title": "Why the small pulse oximeter is becoming a major tool for doctors in Covid-19 crisis - ThePrint", "description": "A relatively small medical device that clips on to a patient's finger, the oximeter can measure one of the five vital pulmonary signs.", "url": "https://theprint.in/health/why-the-small-pulse-oximeter-is-becoming-a-major-tool-for-doctors-in-covid-19-crisis/414646/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/05/pulse-oximeter.jpg", "publishedAt": "2020-05-06T04:32:08Z", "content": "New Delhi: When a 22-year-old heavily pregnant Covid-19 patient had difficulty in breathing, doctors at Jaipur’s Rajasthan University of Health Sciences (RUHS) had to first figure out whether it was due to her pregnancy or the disease.\r\nAn X-ray could have re… [+4661 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "New York Times", "title": "New studies add to evidence that children may transmit the coronavirus - Economic Times", "description": "While children were about a third as susceptible to coronavirus infection as adults are, with schools open, the former are likely to have about three times as many contacts as adults and three times as many opportunities to become infected, essentially evenin…", "url": "https://economictimes.indiatimes.com/news/international/world-news/new-studies-add-to-evidence-that-children-may-transmit-the-coronavirus/articleshow/75567276.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75567268,width-1070,height-580,imgsize-823259,overlay-economictimes/photo.jpg", "publishedAt": "2020-05-06T03:13:19Z", "content": "By Apoorva MandavilliAmong the most important unanswered questions about COVID-19 is this: What role do children play in keeping the pandemic going?\r\nThe answer is key to deciding whether and when to reopen schools, a step that President Donald Trump urged st… [+1887 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "New York Times", "title": "Children in US are falling ill with a baffling ailment related to COVID-19 - Economic Times", "description": "In total, about 25 similarly ill children have been admitted there in recent weeks with symptoms ranging from reddened tongues to enlarged coronary arteries.", "url": "https://economictimes.indiatimes.com/news/international/world-news/children-in-us-are-falling-ill-with-a-baffling-ailment-related-to-covid-19/articleshow/75567183.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75567200,width-1070,height-580,imgsize-578726,overlay-economictimes/photo.jpg", "publishedAt": "2020-05-06T03:09:10Z", "content": "By Joseph Goldstein and Pam BelluckOne child, 8 years old, arrived at a Long Island, New York, hospital near death last week. His brother, a Boy Scout, had begun performing chest compressions before the ambulance crew arrived.\r\nIn the past two days alone, the… [+8015 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Coronavirus Outbreak: Noida, Greater Noida impose fines of up to Rs 1,000 for spitting in public places - Firstpost", "description": "Spitting saliva, gutka, or tobacco in public places across Noida and Greater Noida has been prohibited and violation of this ban can attract a penalty of Rs 500 for first-time offenders and Rs 1,000 for repeat offenders, according to orders issued to contain …", "url": "https://www.firstpost.com/health/coronavirus-outbreak-noida-greater-noida-impose-fines-of-up-to-rs-1000-for-spitting-in-public-places-8336601.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/03/coronavirus_Hyderabad_PTI_1280.jpg", "publishedAt": "2020-05-06T03:08:04Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Associated Press | Posted by: Shankhyaneel Sarkar", "title": "US infection rate rising outside New York as states open up - Hindustan Times", "description": "Britain’s official coronavirus death toll, at more than 29,000, topped that of Italy to become the highest in Europe and second-highest in the world behind the United States.", "url": "https://www.hindustantimes.com/world-news/us-infection-rate-rising-outside-new-york-as-states-open-up/story-ccN3D3niEkZ4hRRvhU9aHI.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/06/Pictures/coronavirus-brooklyn-temporary-disease-national-outbreak-soldier_d6d07fac-8f42-11ea-8c4e-d383a7371370.jpg", "publishedAt": "2020-05-06T02:57:47Z", "content": "Take the New York metropolitan area’s progress against the coronavirus out of the equation and the numbers show the rest of the US is moving in the wrong direction, with the known infection rate rising even as states move to lift their lockdowns, an Associate… [+6714 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": null, "title": "Coronavirus may have made early appearance in France, suggests report; government remains mum on possibility - Firstpost", "description": "If confirmed — the doctors are certain, and the French government says it is looking at the report — the case of the fishmonger, Amirouche Hammar, would mean the coronavirus made an appearance in Europe long before officials there began tackling it", "url": "https://www.nytimes.com/2020/05/05/world/europe/france-coronavirus-timeline.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/03/the-fear-4915904_1280-1.jpg", "publishedAt": "2020-05-06T02:45:37Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Immunisation: World's Most Successful Health Intervention - NDTV", "description": "Researchers across the globe are hard at work for developing a vaccine for COVID-19. Vaccines have helped the world tackle many deadly and highly contagious ...", "url": "https://www.youtube.com/watch?v=WuJhXqBq9e4", "urlToImage": "https://i.ytimg.com/vi/WuJhXqBq9e4/hqdefault.jpg", "publishedAt": "2020-05-06T00:42:17Z", "content": null}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Prostate-cancer men swap chemo for precision drugs - BBC News", "description": "Men with advanced prostate cancer can now take highly targeted hormone therapies at home.", "url": "https://www.bbc.com/news/health-52542106", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/44ED/production/_112154671_stuartfraser-2.jpg", "publishedAt": "2020-05-06T00:38:59Z", "content": "Image copyrightStuart FraserImage caption\r\n Stuart is now taking one of the treatments at home\r\nMen with advanced prostate cancer can take highly targeted hormone therapies at home instead of coming into hospital for chemotherapy, NHS England says. \r\nExperts … [+2508 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "COVID-19 patients and blood clots: Are blood thinners enough? - WGN News", "description": "The more doctors study SARS-CoV-2, the more they realize it not only makes it difficult to breathe, it makes the blood clot. Now, the finding is driving a ch...", "url": "https://www.youtube.com/watch?v=NIeXq5q1pRs", "urlToImage": "https://i.ytimg.com/vi/NIeXq5q1pRs/maxresdefault.jpg", "publishedAt": "2020-05-06T00:21:28Z", "content": "The more doctors study SARS-CoV-2, the more they realize it not only makes it difficult to breathe, it makes the blood clot.Now, the finding is driving a change in the approach to treatment."}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "BBC News", "title": "Coronavirus: How long does it take to recover? - BBC News", "description": "Weeks, months, even a year - we look at the factors that can affect the time taken to get better.", "url": "https://www.bbc.co.uk/news/av/health-52508831/coronavirus-how-long-it-takes-to-recover", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/12A57/production/_112157367_p08ccd69.jpg", "publishedAt": "2020-05-06T00:07:33Z", "content": null}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Bloomberg", "title": "A vet detective squad is preparing for the next pandemic - Livemint", "description": "As the coronavirus death toll surpasses 250,000 and the world scrambles to find a vaccine, a new scientific taskforce is headed to the wilderness to try and stop the next pandemic", "url": "https://www.livemint.com/news/world/a-vet-detective-squad-is-preparing-for-the-next-pandemic-11588707603546.html", "urlToImage": "https://images.livemint.com/img/2020/05/05/600x338/straydogs--621x414_1588709097731.jpg", "publishedAt": "2020-05-05T20:07:40Z", "content": "SYDNEY :\r\nAs the coronavirus death toll surpasses 250,000 and the world scrambles to find a vaccine, a new scientific taskforce is headed to the wilderness to try and stop the next pandemic.After decades of patchy global investment into researching the linkag… [+4592 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Marta Rodriguez Martinez", "title": "Malaria breakthrough as scientists find microbe 'that can stop' mosquitoes spreading deadly disease - Euronews", "description": "As the world scrambles to find a COVID-19 vaccine, this is a rare bit of good news.", "url": "https://www.euronews.com/2020/05/05/malaria-breakthrough-as-scientists-find-microbe-that-can-stop-mosquitoes-spreading-deadly", "urlToImage": "https://static.euronews.com/articles/stories/04/66/80/08/1000x563_cmsv2_97ff9c14-49f3-54fa-9d0a-ae690705d512-4668008.jpg", "publishedAt": "2020-05-05T19:46:37Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Record number of Illinois deaths from COVID-19 announced in single day, at 176 in 24 hours - Eyewitness News WTVO WQRF", "description": "Record number of Illinois deaths from COVID-19 announced in single day, at 176 in 24 hours", "url": "https://www.youtube.com/watch?v=rkrss-OMWwQ", "urlToImage": "https://i.ytimg.com/vi/rkrss-OMWwQ/maxresdefault.jpg", "publishedAt": "2020-05-05T19:45:24Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What are COVID toes? - Fox5NY", "description": "People are seeing discolored toes as a side-effect of the coronavirus.", "url": "https://www.youtube.com/watch?v=tHs9A3iGa1w", "urlToImage": "https://i.ytimg.com/vi/tHs9A3iGa1w/maxresdefault.jpg", "publishedAt": "2020-05-05T19:20:14Z", "content": null}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Anuradha Mascarenhas", "title": "Epidemiological modelling indicates COVID-19 pandemic may recede in July if transmission is low - The Indian Express", "description": "The IISER Kolkata model also indicates that if a national lockdown was not implemented, India could have faced a catastrophic pandemic, rivaling and probably exceeding the worst-hit nations.", "url": "https://indianexpress.com/article/cities/pune/epidemiological-modelling-indicates-covid-19-pandemic-may-recede-in-july-if-transmission-is-low-6395640/", "urlToImage": "https://images.indianexpress.com/2020/04/doctor-5.jpg?w=759", "publishedAt": "2020-05-05T18:03:58Z", "content": "The IISER team consisted of scientists Dibyendu Nandi, Ayan Banerjee, Rajesh Nayak, PhD students Shaonwita Pal, Soumyaranjan Dash, and undergraduate students Agnibha Banerjee and Vishal Singh.The results of a new epidemiological modelling, released by researc… [+2938 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Mary Kekatos Senior Health Reporter For Dailymail.com", "title": "Doctors say they're inundated with calls about COVID toes from people with no other symptoms - Daily Mail", "description": "Doctors say they're being inundated with calls about COVID toes, mysterious bruises, rashes and lesions on their feet, who don't have other traditional symptoms such as fever and coughing.", "url": "https://www.dailymail.co.uk/health/article-8288837/Doctors-say-theyre-inundated-calls-COVID-toes-people-no-symptoms.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/05/16/28033366-0-image-a-2_1588694392297.jpg", "publishedAt": "2020-05-05T16:57:43Z", "content": "Doctors say they are being overwhelmed by calls from people whose only sign of the novel coronavirus is bruising and lesions on the feet.\r\nThe mysterious symptom is called 'COVID toes' and they've primarily been spotted in children and teenagers. \r\nEven more … [+2184 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Lifestyle Desk", "title": "Avoid these foods if you have asthma; here’s why - The Indian Express", "description": "World Asthma Day 2020: People suffering from the condition should avoid foods with preservatives.", "url": "https://indianexpress.com/article/lifestyle/health/world-asthma-day-foods-to-avoid-6395091/", "urlToImage": "https://images.indianexpress.com/2020/05/asthma-759-getty.jpg?w=759", "publishedAt": "2020-05-05T16:14:08Z", "content": "Ongoing research suggests diet plays an important role in controlling asthma. (Source: Getty Images)World Asthma Day: Apart from environmental factors like inhaled allergens, exposure to smoke or pollution, and also genetic susceptibility, diet plays an impor… [+2661 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "CORONAVIRUS: Vaccines in Clinical Trials - VOA News", "description": "How Close Are We to a COVID-19 Vaccine? In the race for a vaccine to end the global COVID-19 pandemic, eight contenders are at the front of the pack. These e...", "url": "https://www.youtube.com/watch?v=f1cdReL5Gs4", "urlToImage": "https://i.ytimg.com/vi/f1cdReL5Gs4/maxresdefault.jpg", "publishedAt": "2020-05-05T15:54:47Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus pandemic | Hepatitis C drugs may help fight COVID-19, supercomputer simulations suggest - Moneycontrol", "description": "Researchers found that compounds from the four hepatitis C drugs have high affinity to bind SARS-CoV-2 very strongly and may, therefore, be able to prevent infection.", "url": "https://www.moneycontrol.com/news/coronavirus/coronavirus-pandemic-hepatitis-c-drugs-may-help-fight-covid-19-supercomputer-simulations-suggest-5224991.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2017/10/ebola-e1545189642153-770x433.jpg", "publishedAt": "2020-05-05T14:49:00Z", "content": "Several drugs approved for the treatment of hepatitis C viral infection have been identified as potential candidates against COVID-19 caused by the SARS-CoV-2 coronavirus, according to a study based on extensive calculations using supercomputer simulations.\r\n… [+2242 chars]"}, {"source": {"id": null, "name": "Tweaktown.com"}, "author": "Jak Connor", "title": "This coronavirus symptom nobody is talking about can't be explained - TweakTown", "description": "A new coronavirus complication has been found and doctors can't explain why it's happening", "url": "https://www.tweaktown.com/news/72259/this-coronavirus-symptom-nobody-is-talking-about-cant-be-explained/index.html", "urlToImage": "https://images.tweaktown.com/news/7/2/72259_01_doctors-discovered-bizarre-new-coronavirus-complication-that-no-one_full.jpg", "publishedAt": "2020-05-05T14:39:24Z", "content": "The longer we experience the coronavirus, the more understanding we develop on how it works and how it affects people. Yet, there are still some things about a COVID-19 infection that are still confusing doctors, and here's one of them.\r\nIt's called \"happy hy… [+1504 chars]"}, {"source": {"id": null, "name": "Nih.gov"}, "author": null, "title": "NIH Statement on World Asthma Day 2020 | National Institutes of Health - National Institutes of Health", "description": "Asthma is a chronic lung disease that causes periods of wheezing, chest tightness, shortness of breath, and coughing.", "url": "https://www.nih.gov/news-events/news-releases/nih-statement-world-asthma-day-2020", "urlToImage": "https://www.nih.gov/sites/default/files/news-events/news-releases/2020/20200505-asthma.jpg", "publishedAt": "2020-05-05T14:21:04Z", "content": null}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AP", "title": "Coronavirus-afflicted 2020 looks like 1918 despite science's march - Livemint", "description": "In 1918, no one had a vaccine, treatment or cure for the Spanish flu pandemic as it ravaged the world and killed more than 50 million people. No one has any of that for the coronavirus, either", "url": "https://www.livemint.com/news/world/coronavirus-afflicted-2020-looks-like-1918-despite-science-s-march-11588686426691.html", "urlToImage": "https://images.livemint.com/img/2020/05/05/600x338/spanish_1588687203410_1588687208375.jpg", "publishedAt": "2020-05-05T14:09:01Z", "content": "WASHINGTON :\r\nDespite a century's progress in science, 2020 is looking a lot like 1918.In the years between two lethal pandemics, one the misnamed Spanish flu, the other COVID-19, the world learned about viruses, cured various diseases, made effective vaccine… [+9932 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "This necklace can figure out irregular heartbeat: Know how this works - India TV News", "description": "Researchers have developed a necklace to detect atrial fibrillation, which is can lead to serious heart issues", "url": "https://www.indiatvnews.com/technology/news-necklace-by-researchers-to-detect-irregular-heartbeats-like-apple-watch-see-how-614444", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/05/apple-watch-series-5-1588686539.jpg", "publishedAt": "2020-05-05T14:00:46Z", "content": "Apple Watch Series 5\r\nResearchers have developed an ingenious necklace which detects abnormal heart rhythm called atrial fibrillation (AFib), an irregular heartbeat that can lead to serious complications such as stroke, heart failure and heart attacks. One of… [+2802 chars]"}, {"source": {"id": null, "name": "Healthline.com"}, "author": null, "title": "Is Sour Cream Keto-Friendly? - Healthline", "description": "Many dairy products are off-limits on the very low carb, high fat keto diet. This article reviews whether sour cream is keto-friendly.", "url": "https://www.healthline.com/nutrition/is-sour-cream-keto", "urlToImage": "https://post.healthline.com/wp-content/uploads/2020/05/ranch-sour-cream-dip-1200x628-facebook-1200x628.jpg", "publishedAt": "2020-05-05T13:37:41Z", "content": "When it comes to choosing foods for a keto diet, fat is where it’s at.\r\nKeto is short for a ketogenic diet — a high fat, very low carb eating pattern that forces your body to use fat for fuel instead of glucose.\r\nThe first rule of keto is to keep your carbs v… [+5693 chars]"}, {"source": {"id": null, "name": "Wionews.com"}, "author": "WION Web Team", "title": "Scientists spar over new report that recommends widespread use of face masks to stem coronavirus transmission - WION", "description": "The recommendation contrasts to the standard use of masks for the protection of wearers, suggesting face coverings could stymie transmission in symptomless carriers.", "url": "https://www.wionews.com/world/scientists-spar-over-new-report-that-recommends-widespread-use-of-face-masks-to-stem-coronavirus-transmission-296759", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/03/14/132970-0001pv479.jpg", "publishedAt": "2020-05-05T13:35:06Z", "content": "A new report advocating the widespread use of face masks to prevent coronavirus transmissions has become the bone of contention among scientists.\r\nAccording to Delve's -- a multi-disciplinary group convened by the Royal Society report, published on Monday, fa… [+2205 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus Can Cause Damaging Blood Clots From Brain to Toes - Bloomberg Markets and Finance", "description": "May.05 -- Another threat from the lung virus that causes Covid-19 has emerged that may cause swift, sometimes fatal damage: blood clots. Doctors around the w...", "url": "https://www.youtube.com/watch?v=fisAtZc2BzY", "urlToImage": "https://i.ytimg.com/vi/fisAtZc2BzY/hqdefault.jpg", "publishedAt": "2020-05-05T12:33:59Z", "content": null}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nSarah Newey,", "title": "Rise in mobility could trigger a deadlier second wave of infections in Italy, modelling suggests - Telegraph.co.uk", "description": "The country remains 'far from the herd immunity threshold' and disease surveillance should be prioritised, a report from Imperial warns", "url": "https://www.telegraph.co.uk/global-health/science-and-disease/rise-mobility-could-trigger-deadlier-second-wave-infections/", "urlToImage": "https://www.telegraph.co.uk/content/dam/global-health/2020/05/05/TELEMMGLPICT000230675749_trans_NvBQzQNjv4Bq3hdKsLay43Ll1rxKCycvPSyMiZvNQfO48FdC8GQvmw8.jpeg?impolicy=logo-overlay", "publishedAt": "2020-05-05T11:49:00Z", "content": "The model also found that the attack rate  the proportion of people infected to date  is far from the herd immunity threshold in all Italian regions. Most have seen less than one per cent of the population infected, though this figure rises to 13 per cent in … [+1359 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus pandemic: Pregnant women refused care over poor quality PPEs - CitiTube", "description": "Some pregnant women who visited the Kaneshie Polyclinic have been denied health care services due to poor PPEs available for health workers. #CitiNewsroom #C...", "url": "https://www.youtube.com/watch?v=gkcctAbowZ4", "urlToImage": "https://i.ytimg.com/vi/gkcctAbowZ4/maxresdefault.jpg", "publishedAt": "2020-05-05T11:44:37Z", "content": null}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Jason Gale, Bloomberg", "title": "Doctors warn of emerging COVID-19 symptom: dangerous blood clots - Fortune", "description": "The clots can result in deaths weeks or months after respiratory issues have eased", "url": "https://fortune.com/2020/05/05/blood-clots-covid19-symptom/", "urlToImage": "https://content.fortune.com/wp-content/uploads/2020/05/GettyImages-1211474849.jpg?resize=1200,600", "publishedAt": "2020-05-05T10:15:22Z", "content": null}, {"source": {"id": null, "name": "Undark.org"}, "author": null, "title": "Covid-19 Reignites a Contentious Debate Over Bats and Disease - Undark Magazine", "description": "Bats’ special relationship with viruses has attracted both awe from scientists and hatred from those who fear disease.", "url": "https://undark.org/2020/05/05/covid-19-bats/", "urlToImage": "https://undark.org/wp-content/uploads/2020/04/geoff-brooks-TomNEOzcGWk-unsplash.jpg", "publishedAt": "2020-05-05T09:42:31Z", "content": "In the past few months, Arinjay Banerjee has gotten an unexpected taste of Internet fame.\r\nSince December, when news of Covid-19 began to shudder across the world, Banerjee who studies the immune systems of bats at McMaster University in Ontario, Canada has p… [+13010 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Angana Chakrabarti", "title": "JNU prof says he was first to suggest BCG vaccine trials for Covid-19 but was ‘turned down’ - ThePrint", "description": "Professor Gobardhan Das said he had emailed Health Minister Dr Harsh Vardhan and the ICMR with the suggestion in March. Govt announced the trials in mid-April.", "url": "https://theprint.in/health/jnu-prof-says-he-was-first-to-suggest-bcg-vaccine-trials-for-covid-19-but-was-turned-down/414790/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/05/JNUprof.jpg", "publishedAt": "2020-05-05T09:38:24Z", "content": "New Delhi: A professor of Jawaharlal Nehru University (JNU) has claimed he was the first to propose the idea of conducting clinical trials of anti-leprosy and anti-tuberculosis vaccines, which began last month, to see if they can prevent Covid-19, but was tur… [+3269 chars]"}, {"source": {"id": null, "name": "Microbiozindia.com"}, "author": null, "title": "Zydus Cadila looks for endorsement to utilize hepatitis medicate for Covid-19 clinical preliminaries - Microbioz India", "description": "The nation's top medication controller, Drug Controller General of India (DCGI), has gotten an application from Zydus Cadila, the leading worldwide pharmaceutical organization in India, to direct clinical preliminary utilizing antiviral medication 'Pegylated …", "url": "https://microbiozindia.com/pharma-news/zydus-cadila-looks-for-endorsement-to-utilize-hepatitis-medicate-for-covid-19-clinical-preliminaries/", "urlToImage": "https://microbiozindia.com/wp-content/uploads/2020/04/001ZYDUS.jpg", "publishedAt": "2020-05-05T08:58:14Z", "content": "The nation’s top medication controller, Drug Controller General of India (DCGI), has gotten an application from Zydus Cadila, the leading worldwide pharmaceutical organization in India, to direct clinical preliminary utilizing antiviral medication ‘Pegylated … [+2528 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Kabir Firaque", "title": "Explained: How remdesivir tricks coronavirus - The Indian Express", "description": "Remdesivir is designed to obstruct the stage of replication, when the virus creates copies of itself, followed endlessly by the copies creating copies of themselves.", "url": "https://indianexpress.com/article/explained/how-remdesivir-tricks-the-coronavirus-6392255/", "urlToImage": "https://images.indianexpress.com/2020/05/drugs.jpg?w=759", "publishedAt": "2020-05-05T08:46:19Z", "content": "Written by Kabir Firaque\r\n | New Delhi | \r\nUpdated: May 5, 2020 2:11:57 pm\r\nRubber stoppers are placed onto filled vials of the investigational drug remdesivir at a Gilead manufacturing site in the United States. (Gilead Sciences via AP)In all the debate over… [+3844 chars]"}, {"source": {"id": null, "name": "Foodnavigator.com"}, "author": "foodnavigator.com", "title": "Food agency stresses vitamin D intake in lockdown: 'Our immune defences might need to work particularly hard' - FoodNavigator.com", "description": "With fewer hours spent in the sun due to COVID-19 lockdown, vitamin D levels are at risk of falling. So what can consumers eat to help ensure sufficient intake? ANSES weighs in.", "url": "https://www.foodnavigator.com/Article/2020/05/05/Food-agency-stresses-vitamin-D-intake-in-lockdown-Our-immune-defences-might-need-to-work-particularly-hard", "urlToImage": "https://cdn-a.william-reed.com/var/wrbm_gb_food_pharma/storage/images/publications/food-beverage-nutrition/foodnavigator.com/news/food-safety-quality/food-agency-stresses-vitamin-d-intake-in-lockdown-our-immune-defences-might-need-to-work-particularly-hard/10966685-1-eng-GB/Food-agency-stresses-vitamin-D-intake-in-lockdown-Our-immune-defences-might-need-to-work-particularly-hard.jpg", "publishedAt": "2020-05-05T08:42:00Z", "content": "ANSES, the French Agency for Food, Environmental and Occupational Health and Safety, has stressed the importance of adequate vitamin D intake all year round.\r\nHowever, during lockdown, the food safety agency suggests sufficient vitamin D intake is of particul… [+2848 chars]"}, {"source": {"id": null, "name": "Thequint.com"}, "author": "Dr K Shanmugam", "title": "World Asthma Day 2020: Is there a Natural Way to Fighting Asthma? - The Quint", "description": "World Asthma Day 2020: Asthma is the most prevalent inflammatory disorder and is characterized by inflammation of the airways in your lungs. The inflammation causes the airway to constrict, weakening its ability to exchange air.", "url": "https://fit.thequint.com/health-news/ways-to-fight-asthma-the-natural-way-world-asthma-day-2020", "urlToImage": "https://images.assettype.com/thequint-fit/2020-05/fb29353e-b732-4d19-8d16-993e554506e0/iStock_475869778.jpg", "publishedAt": "2020-05-05T08:05:26Z", "content": "It also reduces feelings of breathlessness by boosting the functioning of your diaphragm and eliminating the inefficient use of accessory respiratory muscles, particularly those in your neck and abdomen. Studies have shown that patients who practiced yoga reg… [+744 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "AFP", "title": "Doctor who treated first US coronavirus patient fears second wave - Deccan Herald", "description": "The doctor who treated the first COVID-19 patient in the United States said Monday he fears a second outbreak of the coronavirus disease when lockdown measures are lifted. Track live updates on coronavirus here", "url": "https://www.deccanherald.com/international/doctor-who-treated-first-us-coronavirus-patient-fears-second-wave-833715.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/05/iStock-1209873947-1588658849.jpg", "publishedAt": "2020-05-05T05:43:01Z", "content": "The doctor who treated the first COVID-19 patient in the United States said Monday he fears a second outbreak of the coronavirus disease when lockdown measures are lifted.\r\nTrack live updates on coronavirus here\r\nGeorge Díaz's first patient, diagnosed in Janu… [+1680 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Israeli Biological Institute Develops Coronavirus Antibody, Defence Minister Says - Sputnik International", "description": "Scientists from several countries are diligently working to develop a vaccine against COVID-19, as the global number of infected tops 3.5 million, according to data...", "url": "https://sputniknews.com/middleeast/202005051079197824-israeli-biological-institute-develops-coronavirus-antibody-defence-minister-says/", "urlToImage": "https://cdn1.img.sputniknews.com/images/107865/78/1078657892.jpg", "publishedAt": "2020-05-05T02:47:56Z", "content": "Scientists from several countries are diligently working to develop a vaccine against COVID-19, as the global number of infected tops 3.5 million, according to data from Johns Hopkins University. Some estimates suggest that a vaccine could be tested and distr… [+2099 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Salome Phelamei", "title": "Should asthma patients stop taking steroid inhalers during COVID-19 crisis? A pulmonologist clarifies - Times Now", "description": "On the occasion of World Asthma Day, Times Now Digital talked to a pulmonologist to find out whether the coronavirus disease poses a higher risk for people with asthma.", "url": "https://www.timesnownews.com/health/article/should-asthma-patients-stop-taking-steroid-inhalers-during-covid-19-crisis-a-pulmonologist-clarifies/587070", "urlToImage": "https://imgk.timesnownews.com/story/asthma-inhaler.gif?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-05T02:21:59Z", "content": "<ul><li>Experts say people with moderate to severe asthma may be at higher risk of severe illness from coronavirus infection</li><li>Is coronavirus infection more dangerous for people with asthma?</li><li>Here's what asthmatics need to know about the COVID-19… [+2911 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "AmÉlie Bottollier-Depois, AFP", "title": "Genetic Study Shows COVID-19 Was in France Weeks Before The First Case Was Reported - ScienceAlert", "description": "China reported its first cases of the new coronavirus in December. But was COVID-19 already silently circulating? To find out scientists are looking for \"patient zeros\" by tracking the evolution of the virus itself.", "url": "https://www.sciencealert.com/genetic-investigation-reveals-covid-19-was-circulating-in-europe-before-cases-were-reported", "urlToImage": "https://www.sciencealert.com/images/2020-05/processed/nil-castellvi-ZG5_505mUog-unsplash_1_1024.jpg", "publishedAt": "2020-05-05T01:52:17Z", "content": "China reported its first cases of the new coronavirus in December. But was COVID-19 already silently circulating? To find out scientists are looking for \"patient zeros\" by tracking the evolution of the virus itself.\r\nThis genetic detective work is tracing the… [+4829 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WHO on 'powerful' vaccine unity, US virus claims - Associated Press", "description": "The World Health Organization talks about vaccine to battle COVID-19 and US claims that the virus began in a laboratory in the Chinese city of Wuhan. (May 4)...", "url": "https://www.youtube.com/watch?v=JFnEnAC1wWI", "urlToImage": "https://i.ytimg.com/vi/JFnEnAC1wWI/maxresdefault.jpg", "publishedAt": "2020-05-04T20:09:16Z", "content": null}, {"source": {"id": null, "name": "Gulfnews.com"}, "author": "Bloomberg", "title": "Scientists create antibody that defeats coronavirus in lab - Gulf News", "description": "Experimental antibody has neutralized the virus in cell cultures", "url": "https://gulfnews.com/world/europe/scientists-create-antibody-that-defeats-coronavirus-in-lab-1.1588612370821", "urlToImage": "https://imagevars.gulfnews.com/2020/05/04/antibody-coronavirus-generic_171e0b3e685_medium.jpg", "publishedAt": "2020-05-04T17:04:50Z", "content": "Image Credit: Shutterstock\r\nScientists created a monoclonal antibody that can defeat the new coronavirus in the lab, an early but promising step in efforts to find treatments and curb the pandemic's spread.\r\nThe experimental antibody has neutralized the virus… [+2124 chars]"}, {"source": {"id": null, "name": "Webmd.com"}, "author": "Carolyn  Crist", "title": "Two More Years of COVID-19 Pandemic Likely Pandemic experts predict that the coronavirus will likely - WebMD", "description": "Pandemic experts predict that the coronavirus will likely spread for the next 2 years and infect up to 70% of the population.", "url": "https://www.webmd.com/lung/news/20200504/two-more-years-of-covid-19-pandemic-likely", "urlToImage": "https://img.webmd.com/dtmcms/live/webmd/consumer_assets/site_images/article_thumbnails/other/coronavirus_madmicrobe_studios/1800x1200_madmicrobe_rf_coronavirus_1.jpg", "publishedAt": "2020-05-04T16:59:16Z", "content": "May 4, 2020 - Today in the world of coronavirus news \r\nThe coronavirus will likely spread for the next 18-24 months and infect up to 70% of the population, several pandemic experts said in a new report.\r\nEven in a best-case scenario, people will continue to d… [+1937 chars]"}, {"source": {"id": null, "name": "Iflscience.com"}, "author": "Rachael Funnell", "title": "Diagnosis Of Covid-19 Patients Further Complicated By Unusual Happy Hypoxia Phenomenon - IFLScience", "description": "Happy hypoxia, or silent hypoxia, is a phenomenon in which patients with catastrophically low oxygen levels appear comfortable and even capable of speech d", "url": "https://www.iflscience.com/health-and-medicine/diagnosis-of-covid-19-patients-further-complicated-by-unusual-happy-hypoxia-phenomenon/", "urlToImage": "https://cdn.iflscience.com/images/9b393a18-ad83-5a52-abe4-ea4ddff7149c/default-1588602582-flywish-shutterstock.jpg", "publishedAt": "2020-05-04T16:12:00Z", "content": "Happy hypoxia, or silent hypoxia, is a phenomenon in which patients with catastrophically low oxygen levels appear comfortable and even capable of speech despite their serious condition. As the Covid-19 outbreak continues to rage on, there have been increasin… [+2443 chars]"}, {"source": {"id": null, "name": "Healthday.com"}, "author": null, "title": "More Symptoms of Coronavirus: COVID Toes, Skin Rashes - HealthDay", "description": "The virus that causes COVID-19 typically strikes the lungs with full force, but new research shows it can also cause frostbite-like patches on the hands and toes, and rashes on the body.", "url": "https://consumer.healthday.com/infectious-disease-information-21/coronavirus-1008/more-symptoms-of-coronavirus-covid-toes-skin-rashes-757310.html", "urlToImage": "https://media.healthday.com/Images/icimages/covid_toes54.jpg", "publishedAt": "2020-05-04T16:03:17Z", "content": "MONDAY, May 4, 2020 (HealthDay News) -- The virus that causes COVID-19 typically strikes the lungs with full force, but new research shows it can also cause frostbite-like patches on the hands and toes, and rashes on the body.\r\nThe condition has recently been… [+4874 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Tim Loh", "title": "Dutch scientists create anti-body that defeats coronavirus in lab - ThePrint", "description": "The experimental anti-body may help prevent or treat Covid-19 either alone or in a drug combination, according to study published in Nature Communications.", "url": "https://theprint.in/health/dutch-scientists-create-anti-body-that-defeats-coronavirus-in-lab/414347/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/coronavirus-testing-scaled-e1586165575726.jpg", "publishedAt": "2020-05-04T15:56:31Z", "content": "Munich: Scientists created a monoclonal antibody that can defeat the new coronavirus in the lab, an early but promising step in efforts to find treatments and curb the pandemics spread.\r\nThe experimental antibody may help prevent or treat Covid-19 and related… [+1659 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Kashmira Gander", "title": "Some COVID-19 Patients May Get Seriously Ill Because of the Timing of Their Immune Response, Study Suggests - Newsweek", "description": "Scientists used a mathematical model to map how the body interacts with the coronavirus.", "url": "https://www.newsweek.com/coronavirus-immune-response-body-1501694", "urlToImage": "https://d.newsweek.com/en/full/1586961/covid19-coronavirus-getty.jpg", "publishedAt": "2020-05-04T13:26:07Z", "content": "Some people may develop severe COVID-19 because of how their immune systems respond to the coronavirus, according to scientists who used a mathematical model to map how our bodies interact with the bug. \r\nThe team, from the Keck School of Medicine, University… [+8429 chars]"}]}