{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Coronavirus causes damaging blood clots from brain to toes - Times of India", "description": "Science News: Another threat from the lung virus that causes Covid-19 has emerged that may cause swift, sometimes fatal damage: blood clots. Doctors around the worl", "url": "https://timesofindia.indiatimes.com/home/science/coronavirus-causes-damaging-blood-clots-from-brain-to-toes/articleshow/75552309.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75552445,width-1070,height-580,imgsize-194467,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-05-05T10:41:36Z", "content": "Another threat from the lung virus that causes Covid-19 has emerged that may cause swift, sometimes fatal damage: blood clots. Doctors around the world are noting a raft of clotting-related disorders from benign skin lesions on the feet sometimes called \"Covi… [+6421 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "World Hand Hygiene Day: Do you know how to wash your hands properly? Here are CDC approved guidelines - Times of India", "description": "While it should have been the norm, to begin with, the havoc wrecked by COVID-19 across the globe has given immense", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/world-hand-hygiene-day-do-you-know-how-to-wash-your-hands-properly-here-are-cdc-approved-guidelines/articleshow/75551194.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75551195,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-1212484/75551195.jpg", "publishedAt": "2020-05-05T10:35:16Z", "content": null}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Scientists discover microbe that could stop malaria transmission - Aljazeera.com", "description": "A new study shows that the Microsporidia MB microbe blocks malaria parasites from spreading in mosquitoes.", "url": "https://www.aljazeera.com/news/2020/05/scientists-discover-microbe-stop-malaria-transmission-200505080050317.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/5/5/23057ec525704fdcb1979d0a8681bc0d_18.jpg", "publishedAt": "2020-05-05T10:29:00Z", "content": "Scientists have discovered a new microbe that protects mosquitoes from being infected by malaria, a finding that could be a significant breakthrough in the fight against the spread of the disease, which is spread to humans through mosquito bites.\r\nResearch pu… [+1875 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Angana Chakrabarti", "title": "JNU prof says he was first to suggest BCG vaccine trials for Covid-19 but was ‘turned down’ - ThePrint", "description": "Professor Gobardhan Das said he had emailed Health Minister Dr Harsh Vardhan and the ICMR with the suggestion in March. Govt announced the trials in mid-April.", "url": "https://theprint.in/health/jnu-prof-says-he-was-first-to-suggest-bcg-vaccine-trials-for-covid-19-but-was-turned-down/414790/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/05/JNUprof.jpg", "publishedAt": "2020-05-05T09:38:24Z", "content": "New Delhi: A professor of Jawaharlal Nehru University (JNU) has claimed he was the first to propose the idea of conducting clinical trials of anti-leprosy and anti-tuberculosis vaccines, which began last month, to see if they can prevent Covid-19, but was tur… [+3269 chars]"}, {"source": {"id": null, "name": "Dw.com"}, "author": "Deutsche Welle (www.dw.com)", "title": "1.8 million people in Germany could be infected with coronavirus, researchers find - DW (English)", "description": "A new study out of Germany has suggested that the coronavirus infection rate there could be much higher than initially thought. Some 1.8 million people could be infected nationwide, a quarter of them without symptoms.", "url": "https://www.dw.com/en/18-million-people-in-germany-could-be-infected-with-coronavirus-researchers-find/a-53330608", "urlToImage": "https://www.dw.com/image/53151779_304.jpg", "publishedAt": "2020-05-05T09:08:51Z", "content": "The number of coronavirus infections in Germany could be 10 times higher than currently thought, researchers from the University of Bonn have concluded in the much-discussed Heinsberg Report, which took a closer look at the effects of COVID-19 on a small comm… [+2913 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "PTI", "title": "Hepatitis C drugs may help fight COVID-19, supercomputer simulations suggest - The Indian Express", "description": "Several drugs approved for the treatment of hepatitis C viral infection have been identified as potential candidates against COVID-19 caused by the SARS-CoV-2 coronavirus, according to a study based on extensive calculations using supercomputer simulations. R…", "url": "https://indianexpress.com/article/world/hepatitis-c-drugs-may-help-fight-covid-19-supercomputer-simulations-suggest/", "urlToImage": "https://images.indianexpress.com/2020/03/Hepatitis-C.jpg?w=759", "publishedAt": "2020-05-05T08:48:39Z", "content": "By: PTI | Berlin | \r\nUpdated: May 5, 2020 1:50:33 pm\r\nUsing the powerful MOGON II supercomputer operated by JGU and the Helmholtz Institute Mainz, the researchers made more than 30 billion single calculations within two months. (File Photo)Several drugs appro… [+2296 chars]"}, {"source": {"id": null, "name": "Dnaindia.com"}, "author": "DNA", "title": "AI-supported test could lead to early detection of glaucoma progression - DNA India", "description": "Researchers have discovered a new test that can detect glaucoma progression 18 months earlier than the gold standard method used currently.  The clinical trial by UCL researchers was published in the journal Expert Review of Molecular Diagnostics. Glaucoma, t…", "url": "https://www.dnaindia.com/india/video-ai-supported-test-could-lead-to-early-detection-of-glaucoma-progression-2823670", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/2020/05/05/904807-00000003.jpg", "publishedAt": "2020-05-05T08:35:59Z", "content": "©2020 Diligent Media Corporation Ltd."}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shikha Desai", "title": "Yoga asanas for stay-at-home days - Times of India", "description": "The recent health pandemic has brought about a new normal.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/yoga-asanas-for-stay-at-home-days/articleshow/75550750.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75550750,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-54657/75550750.jpg", "publishedAt": "2020-05-05T08:14:00Z", "content": null}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Lifestyle Desk", "title": "Ways severe asthma patients can stay safe during lockdown - The Indian Express", "description": "Asthma is an inflammatory respiratory condition in which patients find it hard to breathe as the tubes carrying air to the lungs swell up.", "url": "https://indianexpress.com/article/lifestyle/health/world-asthma-day-severe-asthmatic-patients-health-lockdown-6394570/", "urlToImage": "https://images.indianexpress.com/2020/05/asthma-tweets-thinkstock-2.jpg?w=759", "publishedAt": "2020-05-05T07:54:15Z", "content": "If you are allergic to dust mites or pollens, they can make the asthma symptoms get worse. (Source: Thinkstock Images)Discussions around asthma care and management become even more crucial owing to the pandemic. For decades, we have been reading reports that … [+3250 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Sambit Dash and Aarthy Ramasamy", "title": "COVID-19: Telemedicine Is a Good Idea – but Not Without Access - The Wire", "description": "The success of telemedicine rests largely on infrastructure. Poor internet penetration threatens to diminish its potential.", "url": "https://science.thewire.in/health/telemedicine-privacy-internet-covid-19/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2020/05/05113406/0_v0shJ-mTRfylWcaR.jpeg", "publishedAt": "2020-05-05T07:48:24Z", "content": "Since India commenced, and subsequently extended, its nationwide lockdown from March 24, healthcare in the country has been adversely and ironically affected. Coupled with the curtailment or shutting down of outpatient consultations, drawn largely from the It… [+5076 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Talib Khan", "title": "Scientists create monoclonal antibodies that may help in defeating coronavirus: Report - Jagran English", "description": "Scientists in Netherlands have created a monoclonal antibody that can help in defeating the COVID 19 in the lab  The new research is a promising step in efforts to find the coronavirus vaccine and curb the spread of the deadly contagion   Representational Ima…", "url": "https://english.jagran.com/world/scientists-create-monoclonal-antibodies-that-may-help-in-defeating-coronavirus-report-10011487", "urlToImage": "https://www.jagranimages.com/images/2020/may/anti1588665067882.jpg", "publishedAt": "2020-05-05T07:46:10Z", "content": "New Delhi | Jagran New Desk: In what could result in a major relief during the coronavirus pandemic, scientists in Netherlands have created a monoclonal antibody that can help in defeating the COVID-19 in the lab. The new research is a promising step in effor… [+1856 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Increasing green spaces in cities may prevent premature deaths - Telangana Today", "description": "New York: Researchers now claim that planting trees and making urban environments greener can prevent many premature deaths every year. The study, published in the journal The Lancet Planetary, analysed the impact of increasing green spaces on premature morta…", "url": "https://telanganatoday.com/increasing-green-spaces-in-cities-may-prevent-premature-deaths", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2020/05/green-space.jpg", "publishedAt": "2020-05-05T07:42:04Z", "content": "New York: Researchers now claim that planting trees and making urban environments greener can prevent many premature deaths every year.\r\nThe study, published in the journal The Lancet Planetary, analysed the impact of increasing green spaces on premature mort… [+2677 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET CONTRIBUTORS", "title": "Don't share household items like cups, regularly disinfect door knobs & mobile: Preventive tips for asthma patients during the pandemic - Economic Times", "description": "According to the WHO, people with underlying conditions such as chronic lung disease are at higher risk of Covid-19.", "url": "https://economictimes.indiatimes.com/magazines/panache/world-asthma-day-dont-share-household-items-like-cups-regularly-disinfect-door-knobs-mobile-preventive-tips-for-asthma-patients-during-the-pandemic/articleshow/75547989.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75548388,width-1070,height-580,imgsize-77704,overlay-etpanache/photo.jpg", "publishedAt": "2020-05-05T07:28:00Z", "content": "By Dr. Bornali Dutta The ongoing pandemic and norm of social distancing has confined everyone to their homes and has also restricted hospital visits, unless in case of emergencies, with movement being constrained. In the absence of regular follow-ups, people … [+3765 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Parenting Desk", "title": "What parents should know about COVID-19 symptoms in children - The Indian Express", "description": "While there is no need for parents to press the panic button, they have to be careful at all times, says Dr Ingale. Sometimes children present myocarditis -- or an inflammation of the heart muscle -- and mimic Kawasaki-like disease, which starts with a fever.", "url": "https://indianexpress.com/article/parenting/health-fitness/what-parents-should-know-about-covid-19-symptoms-in-children-6394618/", "urlToImage": "https://images.indianexpress.com/2020/05/children-and-coronavirus_759.jpg?w=759", "publishedAt": "2020-05-05T07:25:04Z", "content": "In children it is usually a mild illness, and the recovery rate is also good, says Dr Ingale. (Source: Getty/Thinkstock)The ongoing pandemic has caused a lot of stress around the world, mainly because it has been an unprecedented crisis, and scientists and do… [+3331 chars]"}, {"source": {"id": null, "name": "News-medical.net"}, "author": null, "title": "AHA emphasizes the importance of managing cardiovascular disease during pregnancy - News-Medical.Net", "description": "A new statement issued today by the American Heart Association emphasizes the importance of taking a multidisciplinary approach to the management of cardiovascular disease during pregnancy and outlines heart care before, during and after pregnancy.", "url": "https://www.news-medical.net/news/20200505/AHA-emphasizes-the-importance-of-managing-cardiovascular-disease-during-pregnancy.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f9%2fheart_disease_1_12c3ff20f43b43d898bf18f5689e0c7c-620x480.jpg", "publishedAt": "2020-05-05T07:22:08Z", "content": "A new statement issued today by the American Heart Association emphasizes the importance of taking a multidisciplinary approach to the management of cardiovascular disease during pregnancy and outlines heart care before, during and after pregnancy.\r\nDr. Laxmi… [+4289 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "News18", "title": "The Covid-19 Riddle: Why Does the Virus Wallop Some Places and Spare Others? - News18", "description": "In Thailand and India, where virus numbers are relatively low, people greet each other at a distance, with palms joined together as in prayer.", "url": "https://www.nytimes.com/2020/05/03/world/asia/coronavirus-spread-where-why.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1586353646_delhi-health.jpg", "publishedAt": "2020-05-05T07:15:20Z", "content": "The coronavirus has killed so many people in Iran that the country has resorted to mass burials, but in neighboring Iraq, the body count is fewer than 100.\r\nThe Dominican Republic has reported nearly 7,600 cases of the virus. Just across the border, Haiti has… [+8237 chars]"}, {"source": {"id": null, "name": "Aninews.in"}, "author": null, "title": "Experts warn COVID-19 is pushing America into a looming mental health crisis - ANI News", "description": "Washington D.C. [USA], May 5 (ANI): The fast-spreading coronavirus pandemic, with daily mounting deaths, social isolation and widespread psychological trauma caused due to fear of economic fallout, is pushing America into a historic wave of mental health prob…", "url": "https://www.aninews.in/news/world/us/experts-warn-covid-19-is-pushing-america-into-a-looming-mental-health-crisis20200505124432", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/depression-mental-health-sadness-mental-preview_jjNiHIe-thumbnail-154x87-70.jpg", "publishedAt": "2020-05-05T07:14:00Z", "content": "ANI | Updated: May 05, 2020 12:44 IST\r\nWashington D.C. [USA], May 5 (ANI): The fast-spreading coronavirus pandemic, with daily mounting deaths, social isolation and widespread psychological trauma caused due to fear of economic fallout, is pushing America int… [+3994 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "France hoping to deploy StopCovid app by June 2 - minister - Reuters India", "description": "France is hoping to deploy its state-supported \"StopCOVID\" contact-tracing app by June 2, the country's Minister for Digital Affairs, Cedric O, said while lamenting that Apple had declined to take part in the project.", "url": "https://in.reuters.com/article/health-coronavirus-france-tech-idINKBN22H0LS", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200505&t=2&i=1517488022&w=1200&r=LYNXMPEG440CL", "publishedAt": "2020-05-05T06:50:00Z", "content": "PARIS (Reuters) - France is hoping to deploy its state-supported “StopCOVID” contact-tracing app by June 2, the country’s Minister for Digital Affairs, Cedric O, said while lamenting that Apple had declined to take part in the project. \r\n“We hope to have some… [+1283 chars]"}, {"source": {"id": null, "name": "Gadgetsnow.com"}, "author": "Gadgets Now Bureau", "title": "UK to test COVID-19 tracing app on the Isle of Wight this week - Gadgets Now", "description": "Britain will start testing its own COVID-19 tracing app on the Isle of Wight from Tuesday, hoping that the technology in combination with more testing and tracking will help limit transmission of the coronavirus. It has taken a different approach from other E…", "url": "https://www.gadgetsnow.com/tech-news/uk-to-test-covid-19-tracing-app-on-the-isle-of-wight-this-week/articleshow/75547966.cms", "urlToImage": "https://static.toiimg.com/photo/75547986.cms", "publishedAt": "2020-05-05T06:38:59Z", "content": "Britain will start testing its own COVID-19 tracing app on the Isle of Wight from Tuesday, hoping that the technology in combination with more testing and tracking will help limit transmission of the coronavirus. \r\nIt has taken a different approach from other… [+3235 chars]"}, {"source": {"id": null, "name": "Wionews.com"}, "author": "WION Web Team", "title": "France COVID-19 timeline shifts weeks earlier in wake of new evidence - WION", "description": "The said patient was a 42-year-old man born in Algeria, who lived in France for many years, and worked as a fishmonger.  The man had not been to China, and one of his children had also been sick.", "url": "https://www.wionews.com/world/france-covid-19-timeline-shifts-weeks-earlier-in-wake-of-new-evidence-296722", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/04/13/136613-corona-paris.jpg", "publishedAt": "2020-05-05T06:38:28Z", "content": "Doctors at a Paris hospital have said they found evidence that one patient admitted in December was infected with coronavirus. This stands to prove that the deadly virus was already circulating in Europe at that time -- well before the first known cases were … [+1492 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Niranjana Rajalakshmi", "title": "How Does Remdesivir Work Against the Novel Coronavirus? - The Wire", "description": "Remdesivir is a broad-spectrum antiviral drug originally created to treat Ebola.", "url": "https://science.thewire.in/the-sciences/how-does-remdesivir-work-against-the-novel-coronavirus/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2020/05/04181017/2020-04-30T022718Z_1_LYNXMPEG3T04X_RTROPTP_4_HEALTH-CORONAVIRUS-REMDESIVIR-scaled.jpg", "publishedAt": "2020-05-05T06:32:21Z", "content": "A lab technician visually inspects a vial of remdesivir at a facility in California, March 11, 2020. Photo: Gilead Sciences Inc/Handout via Reuters.\r\nAlthough researchers around the world have developed different therapies to tackle COVID-19, no single method… [+4585 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV News Desk", "title": "From Spanish flu to COVID-19, why virus-afflicted 2020 looks like 1918 despite science's march - India TV News", "description": "Centuries apart, between two lethal pandemics, one the misnamed Spanish Flu and the othe coronavirus the world learned about viruses, cured various diseases, made effective vaccines, developed instant communications and created elaborate public-health network…", "url": "https://www.indiatvnews.com/news/world/from-spanish-flu-to-covid-19-virus-afflicted-2020-looks-like-1918-despite-science-s-march-614269", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/05/1000-70-1588657278.jpeg", "publishedAt": "2020-05-05T06:08:02Z", "content": "Image Source : AP FILE - In this 1918 file photo made available by the Library of Congress, volunteer nurses from the American Red Cross tend to influenza patients in the Oakland Municipal Auditorium, used as a temporary hospital. Science has ticked off some … [+12654 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Soaked peanuts, just like soaked almonds are super healthy! Here's why - Times of India", "description": "Peanuts are a powerhouse of nutrition. A good source of fats, protein, fibre, potassium, phosphorus, B vitamins and magnesium, peanuts make for one of the healthiest snacks.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/soaked-peanuts-just-like-soaked-almonds-are-super-healthy-heres-why/photostory/75548177.cms", "urlToImage": "https://static.toiimg.com/photo/75548467.cms", "publishedAt": "2020-05-05T05:53:52Z", "content": "Peanuts are a powerhouse of nutrition. A good source of fats, protein, fibre, potassium, phosphorus, B vitamins and magnesium, peanuts make for one of the healthiest snacks. Despite being high in calories, peanuts are absolutely safe to munch on even when try… [+316 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Abhay Shukla, Maharashtra Public Health Analysis Group", "title": "What Maharashtra Can Do to Tackle COVID-19 While Easing the Lockdown - The Wire", "description": "Increasing community participation and involving civil society can make a marked difference.", "url": "https://science.thewire.in/health/maharashtra-covid-19-lockdown-testing-isolation/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2020/05/05110802/2020_5img01_May_2020_PTI01-05-2020_000079B-scaled.jpg", "publishedAt": "2020-05-05T05:46:58Z", "content": "Featured image: Medical workers are seen outside a government hospital, where six people were tested positive for COVID-19, in Karad, Maharashtra, Friday, May 1, 2020. Photo: PTI\r\nThis is the second of a two-part analysis of Maharashtras COVID-19 epidemic. Re… [+10330 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Editorial Team", "title": "World Asthma Day: Covid-19 can escalate asthma symptoms - TheHealthSite", "description": "Seasonal strains of the coronavirus family escalate asthma symptoms. Dr. (Brig) Ashok K Rajput Pulmonologist on Lybrate.com shares his views.", "url": "https://www.thehealthsite.com/news/world-asthma-day-covid-19-can-escalate-asthma-symptoms-743698/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2020/05/asthma-inhaler-655x353.jpg", "publishedAt": "2020-05-05T05:24:43Z", "content": "Covid-19 has come across as an unprecedented global pandemic which has already claimed more than 200,000 lives and infected millions of others. The disease has spread to about 200 countries across the planet and the impact on the physical and social world is … [+4071 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Israel isolates key coronavirus antibody in 'significant breakthrough' in quest for treatment for... - Firstpost", "description": "Israel has isolated a key coronavirus antibody at its main biological research laboratory, the Israeli defence minister said on Monday, calling the step a 'significant breakthrough' toward a possible treatment for the COVID-19 pandemic.", "url": "https://www.firstpost.com/health/israel-isolates-key-coronavirus-antibody-in-significant-breakthrough-in-quest-for-treatment-for-infection-claims-defence-minister-8332221.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/04/1280px-3D_medical_animation_corona_virus-1.jpg", "publishedAt": "2020-05-05T04:16:03Z", "content": null}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "French hospital , restesting old samples from pneumonia patients, finds COVID-19 case from 27 December - Firstpost", "description": "The man could be patient zero in France and was sick for 15 days and infected his two children, but not his wife.", "url": "https://www.firstpost.com/health/french-hospital-restesting-old-samples-from-pneumonia-patients-finds-covid-19-case-from-27-december-8332241.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/04/macau-photo-agency-2AGj7bQ68lk-unsplash-1.jpg", "publishedAt": "2020-05-05T04:14:02Z", "content": null}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Supressing immune response may help avoid severe Covid-19 symptoms: Study - India Today", "description": "Researchers noted that the flu is a fast-moving infection that attacks certain target cells on the surface of the upper respiratory system and kills almost all of the target cells within two to three days.", "url": "https://www.indiatoday.in/education-today/latest-studies/story/supressing-immune-response-may-help-avoid-severe-covid-19-symptoms-study-1674488-2020-05-05", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/coronavirus-4939242_1920_0-647x363.jpeg?kxDe.F2BWs6Z0v4aYMk3DvRvDHvh5Svm", "publishedAt": "2020-05-05T03:45:00Z", "content": "Temporarily suppressing the body's immune system during the early stages of Covid-19 could help a patient avoid severe symptoms of the deadly disease, according to a study.\r\nThe research, published in the Journal of Medical Virology, shows that an interaction… [+2939 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Was Covid-19 Silently Circulating Even Before China's 1st Case? Detectives Tracking Virus to its Genetic ... - News18", "description": "This genetic detective work is tracing the family tree of the coronavirus that has killed tens of thousands in its relentless spread across the planet.", "url": "https://www.news18.com/news/world/was-covid-19-silently-circulating-even-before-chinas-1st-case-detectives-tracking-virus-to-its-genetic-origins-2605839.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587038870_rtx7ddbj.jpg", "publishedAt": "2020-05-05T03:34:25Z", "content": "Paris: China reported its first cases of the new coronavirus in December. But was Covid-19 already silently circulating? To find out scientists are looking for \"patient zeros\" by tracking the evolution of the virus itself.\r\nThis genetic detective work is trac… [+4814 chars]"}, {"source": {"id": null, "name": "Tribuneindia.com"}, "author": "Tribune India", "title": "Plasma therapy no magic bullet: Experts - The Tribune India", "description": "", "url": "https://www.tribuneindia.com/news/nation/plasma-therapy-no-magic-bullet-experts-80569", "urlToImage": "https://cms.tribuneindia.com/gallary_content/2020/5/Desk/2020_5$largeimg_416661432.jpg", "publishedAt": "2020-05-05T02:19:35Z", "content": "New Delhi, May 4\r\nThe convalescent plasma therapy is no “magic bullet” to deal with coronavirus, and only large-scale controlled trials can ascertain its efficacy as part of the treatment strategy, top medical experts said on Monday, even as several states ar… [+840 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Jack Gramenz", "title": "Coronavirus: Retested flu samples find first French COVID-19 case in December - NEWS.com.au", "description": "Coronavirus: Retested flu samples find first French COVID-19 case in December", "url": "https://www.news.com.au/world/coronavirus/global/coronavirus-retested-flu-samples-find-first-french-covid19-case-in-december/news-story/72e2644489ebbd798d39ffcdce341e04", "urlToImage": "https://cdn.newsapi.com.au/image/v1/5111a3344aed6c4b75cc4e1fced0c69b?width=650", "publishedAt": "2020-05-05T01:45:34Z", "content": "Coronavirus could have been in Europe earlier than originally thought after French scientists retested samples and found a confirmed case from December 2019.The head of resuscitation at the Avicenne and Jean Verdier hospitals in the northern suburbs of Paris … [+1921 chars]"}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": null, "title": "Fauci: No scientific evidence the coronavirus was made in a Chinese lab - National Geographic", "description": "In an exclusive interview, the face of America’s COVID-19 response cautions against the rush for states to reopen, and offers his tips for handling the pandemic's information deluge.", "url": "https://www.nationalgeographic.com/science/2020/05/anthony-fauci-no-scientific-evidence-the-coronavirus-was-made-in-a-chinese-lab-cvd/", "urlToImage": "https://www.nationalgeographic.com/content/dam/science/2020/05/05/fauci/mm9349_20200502_0055h.ngsversion.1588638731623.adapt.1900.1.jpg", "publishedAt": "2020-05-05T00:57:57Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Doctors concerned about patients avoiding hospitals - KING 5", "description": "During the coronavirus pandemic, doctors are worried patients aren't coming in because they're afraid of catching the virus or that there won't be enough beds.", "url": "https://www.youtube.com/watch?v=nsqBBNeFMd8", "urlToImage": "https://i.ytimg.com/vi/nsqBBNeFMd8/hqdefault.jpg", "publishedAt": "2020-05-05T00:55:44Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "After retesting samples, French hospital discovers Covid-19 case from December - Times of India", "description": "Europe News: PARIS: A French hospital which has retested old samples from pneumonia patients discovered that it treated a man who had Covid-19 as early as December.", "url": "https://timesofindia.indiatimes.com/world/europe/after-retesting-samples-french-hospital-discovers-covid-19-case-from-december/articleshow/75541478.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75541495,width-1070,height-580,imgsize-186080,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-05-05T00:35:59Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": null, "title": "Experts: Coronavirus penetrated to France at the end of last year - The Times Hub", "description": null, "url": "https://thetimeshub.in/experts-coronavirus-penetrated-to-france-at-the-end-of-last-year/14522/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2020/05/3ecdacb5b1b99bf1f9a2500484481ece-600x400.jpg", "publishedAt": "2020-05-05T00:07:28Z", "content": "Coronavirus walks the planet since the end of last year, according to new data, even then he penetrated into France. Previously it was thought that in Europe the disease was only in the year 2020.\r\nUntil Jan cases COVID-19 was recorded only in China, but now … [+692 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: France's first known case 'was in December' - BBC News", "description": "A Paris doctor says a patient first diagnosed with pneumonia is now confirmed as having had Covid-19.", "url": "https://www.bbc.com/news/world-europe-52526554", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/3264/production/_112100921_942e9a45-2fc6-4e01-918f-8a784f1a1ead.jpg", "publishedAt": "2020-05-04T23:37:03Z", "content": "Image copyrightAFPImage caption\r\n A doctor suggests the virus arrived in France almost a month earlier than previously thought\r\nA patient diagnosed with pneumonia near Paris on 27 December actually had the coronavirus, his doctor has said.\r\nDr Yves Cohen told… [+1403 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Chiara Fiorillo", "title": "Coronavirus was in Europe as early as December – a month before outbreak was known, new tests prove - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11548575/coronavirus-outbreak-europe-december-france-hospital-covid-19-patient/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/05/CJ-COMP-COVID-1.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-05-04T22:47:59Z", "content": "CORONAVIRUS was already in Europe as early as December, a month before the outbreak was known, new tests have proven.\r\nA French hospital has retested old samples from pneumonia patients and discovered it treated a man who had Covid-19 on December 27 - nearly … [+4693 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Premier Health begins antibody testing, hundreds turn out for first day - WDTNTV", "description": "The antibody can help determine if a person has had COVID19 in the past", "url": "https://www.youtube.com/watch?v=JYA1za4giZw", "urlToImage": "https://i.ytimg.com/vi/JYA1za4giZw/maxresdefault.jpg", "publishedAt": "2020-05-04T20:42:53Z", "content": null}, {"source": {"id": null, "name": "Un.org"}, "author": null, "title": "UN health agency hails 7.4 billion Euro pledge for COVID-19 treatments - UN News", "description": "World leaders on Monday pledged 7.4 billion Euros to support research and development for medicines to fight COVID-19 which the top UN health official has hailed as “a powerful and inspiring demonstration of global solidarity”.", "url": "https://news.un.org/en/story/2020/05/1063182", "urlToImage": "https://global.unitednations.entermediadb.net/assets/mediadb/services/module/asset/downloads/preset/Collections/Embargoed/24-04-2020_UNDP_Bangladesh.jpg/image770x420cropped.jpg", "publishedAt": "2020-05-04T20:29:54Z", "content": "Tedros Adhanom Ghebreyesus was updating journalists about the outcome of the funding conference for the recently launched ACT Accelerator to speed up production of treatments to beat the disease.\r\n\"Recent advances in science are enabling the world to move at … [+3556 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Study suggests nicotine patches could prevent COVID-19 infection - eNCA", "description": "Nicotine patches could help prevent the coronavirus infection, that's according to a study by French researchers. Let's look further into these claims now. J...", "url": "https://www.youtube.com/watch?v=BfKs2dLco7E", "urlToImage": "https://i.ytimg.com/vi/BfKs2dLco7E/maxresdefault.jpg", "publishedAt": "2020-05-04T17:52:30Z", "content": "Nicotine patches could help prevent the coronavirus infection, that's according to a study by French researchers. \r\nLet's look further into these claims now. \r\nJoining us is Professor Alex Broadbent from the Institute for the Future of Knowledge. Courtesy #DS… [+4 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "Apps cannot replace 'boots-on-the-ground' in COVID-19 fight: WHO - CNA", "description": "GENEVA: The World Health Organization on Monday (May 4) stressed that contact-tracing apps and other technology cannot replace old-fashioned \"boots-on-the-ground\" surveillance measures as many countries begin easing lockdowns imposed to curb the new coronavir…", "url": "https://www.channelnewsasia.com/news/world/apps-replace-boots-covid-19-coronavirus-fight-who-12702078", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12702094/16x9/991/557/ec952d179f9d4fc051371cef4aa16231/ei/who.jpg", "publishedAt": "2020-05-04T17:51:34Z", "content": "GENEVA: The World Health Organization on Monday (May 4) stressed that contact-tracing apps and other technology cannot replace old-fashioned \"boots-on-the-ground\" surveillance measures as many countries begin easing lockdowns imposed to curb the new coronavir… [+1634 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindustantimes.com | Edited by Meenakshi Ray", "title": "Covid-19 might never have a vaccine just like HIV, dengue: Report - Hindustan Times", "description": "More than 100 vaccines are currently under pre-clinical trials and a couple of those have entered the human trial stage—at Oxford University in England made from a chimpanzee virus and in the US for a different vaccine produced by Moderna.", "url": "https://www.hindustantimes.com/india-news/covid-19-might-never-have-a-vaccine-just-like-hiv-dengue-report/story-3E1BFQjOk2APEQiV482zVI.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/04/Pictures/nationwide-lockdown-wearing-inspection-residential-accompanied-officers_65025fb2-8de9-11ea-82ee-ef85d4b5e80b.jpg", "publishedAt": "2020-05-04T14:39:21Z", "content": "Leading health experts have warned scientists may not be able to develop a vaccine against the coronavirus disease (Covid-19) at all and pointed that it has happened before in case of HIV and dengue among others, a report has said.\r\nMore than 100 vaccines are… [+2725 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Brian Cooley", "title": "Coronavirus sensor you stick at the top of your chest can track symptoms - CNET", "description": "The device senses the nature, duration and time of coughs, checking for the onset and progression of COVID-19.", "url": "https://www.cnet.com/health/new-sensor-you-stick-on-your-chest-can-detect-covid-19/", "urlToImage": "https://cnet4.cbsistatic.com/img/ZDRiW1zrlJHj6PtOzSoxlnNiQR0=/2020/05/02/b92ddae0-7e20-43db-928b-4782498a8600/vlcsnap-2020-05-01-18h06m46s606.png", "publishedAt": "2020-05-04T14:03:53Z", "content": "Northwestern University\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nIt looks like a Band-Aid, but it's a flexible wireless sensor that sits where your throat and chest meet, picking up coughing and bre… [+3956 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "IANS", "title": "Coronavirus: Scientists find antibody that blocks infection by COVID-19 in cells - Livemint", "description": "The discovery is an initial step towards developing a fully human antibody to treat or prevent the respiratory disease COVID-19 caused by the novel coronavirus SARS-CoV-2", "url": "https://www.livemint.com/news/india/coronavirus-scientists-find-antibody-that-blocks-infection-by-covid-19-in-cells-11588599171695.html", "urlToImage": "https://images.livemint.com/img/2020/05/04/600x338/360908332_0-5_1585840944312_1588599929323.jpg", "publishedAt": "2020-05-04T13:49:24Z", "content": "LONDON :\r\nResearchers have identified a fully human monoclonal antibody that prevents the SARS-CoV-2 (COVID-19) virus from infecting cultured cells.The discovery, detailed in the journal Nature Communications, is an initial step towards developing a fully hum… [+2450 chars]"}, {"source": {"id": null, "name": "Newser.com"}, "author": "Jenn Gidman", "title": "Doctors Trying to Figure Out Why 'Happy Hypoxia' Coronavirus Patients Can Function Despite Abnormally Low Oxygen Levels - Newser", "description": "Patients with abnormally low oxygen levels that would normally render them unconscious seem fine", "url": "https://www.newser.com/story/290419/virus-condition-flouting-basic-biology-is-a-head-scratcher.html", "urlToImage": "https://img2-azrcdn.newser.com/image/1296225-12-20200504083418.jpeg", "publishedAt": "2020-05-04T13:27:00Z", "content": "(Newser)\r\nAn odd condition that the New York Post says seems to \"defy basic biology\" is popping up among coronavirus patients, and no one has yet figured out how or why it's happening. Some COVID-19 patients are exhibiting abnormally low oxygen levels—ones th… [+1526 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Decoding SARS-COV-2: A dummy's guide to the dreaded virus - Moneycontrol", "description": "There is little reliable information available in the public domain about the virus, its origin, its structure, the peculiarities and its modality of the infection it causes.", "url": "https://www.moneycontrol.com/news/coronavirus/decoding-sars-cov-2-a-dummys-guide-to-the-dreaded-virus-5220311.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/05/1-2-770x433.jpg", "publishedAt": "2020-05-04T13:18:39Z", "content": "By Samrat Bora\r\nWith the novel coronavirus pandemic raging across the continents, there are a lot of advisories of dos and don'ts. Unfortunately, most of the information available is in bits and pieces leading to less of coherence and more of confusion.Hence,… [+7313 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: A hunt for the 'missing link' host species - BBC News", "description": "The identity of the \"intermediate host\" animal that first passed the coronavirus to a human may never be found, say scientists.", "url": "https://www.bbc.co.uk/news/science-environment-52529830", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/09A8/production/_111827420_hi059295836.jpg", "publishedAt": "2020-05-04T11:11:59Z", "content": "Image copyrightReutersImage caption\r\n A number of early cases in the pandemic were linked to the Wuhan Seafood Market\r\nIt was a matter of \"when not if\" an animal passed the coronavirus from wild bats to humans, scientists say. \r\nBut it remains unclear whether… [+6602 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Yaron Steinbuch", "title": "Mysterious coronavirus condition 'happy hypoxia' baffles doctors - New York Post ", "description": "A strange phenomenon dubbed “happy hypoxia” has baffled doctors treating coronavirus patients who describe themselves as comfortable despite dangerously low oxygen levels that would typically leave…", "url": "https://nypost.com/2020/05/04/mysterious-coronavirus-effect-happy-hypoxia-baffles-doctors/", "urlToImage": "https://thenypost.files.wordpress.com/2020/05/lungs.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-05-04T10:37:31Z", "content": "A strange phenomenon dubbed happy hypoxia has baffled doctors treating coronavirus patients who describe themselves as comfortable despite dangerously low oxygen levels that would typically leave them unconscious, or even dead, according to reports.\r\nThe myst… [+4365 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Boost your immunity with Apple, beetroot and carrot juices! Here’s how - The Financial Express", "description": "The ABC drink also makes your skin glow. This also makes your skin spotless. There will be no black spots, acne or pimples, blemishes and blackheads.", "url": "https://www.financialexpress.com/lifestyle/health/boost-your-immunity-with-apple-beetroot-and-carrot-juices-heres-how/1947421/", "urlToImage": "https://images.financialexpress.com/2020/05/BEETROOT.jpg", "publishedAt": "2020-05-04T10:32:57Z", "content": "Apple, beetroot and carrot juice can boost your immunity! It is essential to have a sound immunity throughout the year and more so when there is a pandemic outbreak. So if you are willing to enhance your immunity, you can try apple, beetroot and carrot juice.… [+1741 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Srishti Choudhary", "title": "Covid-19 may be here to stay, could hit in waves over next two years - Livemint", "description": "Scientists urged governments to plan for the worst-case scenario, including no vaccine availability or herd immunity.With global race for vaccine intensifying, the course of the pandemic could be influenced by a vaccine, but it is unlikely to be available unt…", "url": "https://www.livemint.com/news/india/covid-19-may-be-here-to-stay-could-hit-in-waves-over-next-two-years-11588585820842.html", "urlToImage": "https://images.livemint.com/img/2020/05/04/600x338/2020-04-30T114432Z_873633977_RC2ZEG9UZJND_RTRMADP_3_HEALTH-CORONAVIRUS-BRITAIN_1588520423344_1588586719308.JPG", "publishedAt": "2020-05-04T10:11:29Z", "content": "NEW DELHI: In what seems like the most probable scenario emerging from recent studies, covid-19 pandemic is here to stay and may hit in waves over the next two years with hotspots emerging in diverse geographical areas.The findings were shared by a global tea… [+3609 chars]"}, {"source": {"id": null, "name": "Kalingatv.com"}, "author": "IANS", "title": "Higher thrombus risk in men with obesity in adolescence: Study - Kalinga TV", "description": "London: Obese people, read this carefully. Researchers have found that men with a history of obesity in their late teens, in adult life, are more at risk of a blood clot (thrombus) in a leg or lung. The risk rises successively and is highest in those", "url": "https://kalingatv.com/miscellany/higher-thrombus-risk-in-men-with-obesity-in-adolescence-study/", "urlToImage": "https://cdn.kalingatv.com/wp-content/uploads/2020/05/obesity-Bel-Marra-Health.jpg", "publishedAt": "2020-05-04T08:56:00Z", "content": "London: Obese people, read this carefully. Researchers have found that men with a history of obesity in their late teens, in adult life, are more at risk of a blood clot (thrombus) in a leg or lung. The risk rises successively and is highest in those who were… [+2372 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Ellena Cruse", "title": "UK scientists test experimental drug which could 'significantly improve' health of coronavirus patients - Evening Standard", "description": "", "url": "https://www.standard.co.uk/news/uk/uk-scientists-test-coronavirus-drug-stimulate-immune-response-university-hospital-southampton-a4430831.html", "urlToImage": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2020/04/25/08/coronavirus-testing-0.jpg", "publishedAt": "2020-05-04T07:51:30Z", "content": "UK scientists have started testing an experimental Covid-19 drug which they hope will significantly improve the health of coronavirus patients.\r\nThe treatment, known as SNG-001, has been shown to stimulate immune response in the lungs of patients with asthma … [+1088 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Salome Phelamei", "title": "COVID-19 crisis: 5 lifestyle tips for cancer patients to boost immunity and improve general health - Times Now", "description": "Here are are a few lifestyle tips for cancer patients on how they can improve their immunity, stay healthy during the COVID-19 disease outbreak.", "url": "https://www.timesnownews.com/health/article/covid-19-crisis-5-lifestyle-tips-for-cancer-patients-to-boost-immunity-and-improve-general-health/586669", "urlToImage": "https://imgk.timesnownews.com/story/cancer-care_0.gif?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-04T06:59:52Z", "content": "<ul><li>Experts say that cancer patients have a higher risk of developing severe complications from COVID-19</li><li>Social distancing and good personal hygiene are identified as the best ways to prevent or reduce the risk of contracting coronavirus infection… [+4913 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "COVID-19 vaccine hunt heats up globally, still no guarantee - Financial Express", "description": "About 100 research groups are pursuing vaccines with nearly a dozen in early stages of human trials or poised to start.", "url": "https://www.financialexpress.com/lifestyle/health/covid-19-vaccine-hunt-heats-up-globally-still-no-guarantee/1947317/", "urlToImage": "https://images.financialexpress.com/2020/05/Covid-19-vaccine.jpg", "publishedAt": "2020-05-04T06:27:50Z", "content": "Hundreds of people are rolling up their sleeves in countries across the world to be injected with experimental vaccines that might stop COVID-19, spurring hope ”maybe unrealistic” that an end to the pandemic may arrive sooner than anticipated.\r\nAbout 100 rese… [+5231 chars]"}, {"source": {"id": null, "name": "Cnbctv18.com"}, "author": null, "title": "France, UK to trial COVID-19 tracing apps next week - CNBCTV18", "description": "France, UK to trial COVID-19 tracing apps next week. Get latest Healthcare online at cnbctv18.com", "url": "https://www.cnbctv18.com/healthcare/france-uk-to-trial-covid-19-tracing-apps-next-week-5834671.htm/", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2019/06/2019-06-05T221030Z_1_LYNXNPEF54222_RTROPTP_4_DDAY-ANNIVERSARY-BRITAIN-768x512.jpg", "publishedAt": "2020-05-04T05:43:22Z", "content": "France and the UK will start the trials of the their respective COVID-19 tracing apps from next week, the two governments have confirmed.\r\nFrench Minister for Digital Affairs Cedric O said on Sunday the testing of the \"StopCOVID\" contact tracing app will begi… [+960 chars]"}, {"source": {"id": null, "name": "Sakshi.com"}, "author": "amena", "title": "Can Prayers Heal COVID-19 Patients? Telugu-Origin American Doctor Launches Study - సాక్షి", "description": "A new study has been launched by an Indian-American physician in Kansas City, to find out if prayers are effective in healing COVID-19 patients", "url": "https://english.sakshi.com/world/2020/05/04/can-prayers-heal-covid-19-pateints-indian-american-launches-study-on-it", "urlToImage": "https://images.assettype.com/sakshipost/2020-05/dbd160b7-6cd8-4891-8f24-0672c99ace69/pray_ed.jpg", "publishedAt": "2020-05-04T05:26:01Z", "content": "KANSAS: A new study has been launched by a Telugu-Origin American physician in Kansas City, to find out if prayers are effective in healing COVID-19 patients.\r\nDhanunjaya Lakkireddy has initiated a study called \"remote intercessory prayer,\" hoping that God wi… [+2291 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Dr. Kamal Kant Kohli", "title": "COVID Toe yet another symptom of Covid 19 - Medical Dialogues", "description": "According to dermatologists of Spain  a new symptom of Covid 19 has emerged which is a ...", "url": "https://medicaldialogues.in/dermatology/news/covid-toe-yet-another-symptom-of-covid-19-65432", "urlToImage": "https://medicaldialogues.in/h-upload/2020/05/04/1200x630_128190-chilblains-toe.jpg?width=1200&height=630", "publishedAt": "2020-05-04T05:18:02Z", "content": "According to dermatologists of Spain a new symptom of Covid 19 has emerged which is a chilblain-like lesions on the toe which has been termed as \"COVID Toe\" by the investigators.The new symptom has not yet made onto the CDC's symptom list as yet.\r\nSeries of c… [+2582 chars]"}, {"source": {"id": null, "name": "Eurekalert.org"}, "author": null, "title": "Labels on alcohol bottles increase awareness of drinking harms, guidelines - EurekAlert", "description": "When alcohol bottles come with conspicuous labels providing information on the risks of alcohol consumption or drinking guidelines, people are better informed about alcohol's harms and may cut down their drinking, according to a series of studies in the Journ…", "url": "https://eurekalert.org/pub_releases/2020-05/joso-loa042320.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/230091_web.jpg", "publishedAt": "2020-05-04T05:02:17Z", "content": "IMAGE: Do alcohol warning labels work? Findings from a real-world experiment\r\n view more \r\nCredit: University of Toronto/University of Victoria\r\nPISCATAWAY, NJ - When alcohol bottles come with conspicuous labels providing information on the risks of alcohol c… [+7640 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Carolyn Y. Johnson", "title": "Inside the extraordinary race to invent a coronavirus vaccine - The Washington Post", "description": "Companies are launching vaccine trials at an unprecedented pace, but some are worried about the trade-offs between speed and safety.", "url": "https://www.washingtonpost.com/science/2020/05/02/coronavirus-vaccine/", "urlToImage": "https://www.washingtonpost.com/resizer/FB33jJj_l1_YcZFXiBf4EJIqibw=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BEVCJBMPHFHAPD33WDQXVIUJFA.jpeg", "publishedAt": "2020-05-04T04:44:30Z", "content": "Scientists at the National Institutes of Health in Bethesda, Md., will study blood from Haydon and others for signs that the vaccine triggered an immune response to a pathogen they have never encountered. It would be the first, preliminary signal that the vac… [+12380 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "IANS", "title": "Coronavirus Outbreak in US May Last for 18 to 24 Months: Study - The Weather Channel", "description": "Government agencies and healthcare delivery organizations should develop strategies to ensure adequate protection for healthcare workers when disease incidence surges.", "url": "https://weather.com/en-IN/india/coronavirus/news/2020-05-04-novel-coronavirus-may-last-18-to-24-months-in-the-united-states", "urlToImage": "https://s.w-x.co/in-uscoronavirus.jpg", "publishedAt": "2020-05-04T03:38:26Z", "content": "New York City urban park rangers hand out free face masks at the Prospect Park in the Brooklyn. \r\n(Michael Nagle/Xinhua/IANS)\r\nAs the US battles the unabated rise of coronavirus cases as well as deaths, a new study from Minnesota-based Center for Infectious D… [+3415 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "ANI", "title": "Race for coronavirus vaccine intensifies - Times Now", "description": "A vaccine is the only tool that will bring the novel coronavirus to heel and allow life around the world to normalize, say experts.", "url": "https://www.timesnownews.com/health/article/race-for-coronavirus-vaccine-intensifies/586582", "urlToImage": "https://imgk.timesnownews.com/story/accine.gif?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-04T03:09:08Z", "content": "Washington: A cure or vaccine for the Coronavirus infection, which has brought the world economy and public health system to the brink of collapse, is the need of the hour. The search for a vaccine has begun around the globe at an intensity never before seen … [+2807 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "New York Times", "title": "What if we already have a coronavirus vaccine? - Economic Times", "description": "New study in a niche area of immunology suggests that certain live vaccines may, possibly, protect against coronavirus.", "url": "https://economictimes.indiatimes.com/news/international/world-news/what-if-we-already-have-a-coronavirus-vaccine/articleshow/75502684.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75502672,width-1070,height-580,imgsize-499848,overlay-economictimes/photo.jpg", "publishedAt": "2020-05-04T02:10:00Z", "content": "by Melinda Wenner MoyerAs the world waits for a coronavirus vaccine, tens of thousands of people could die. But some scientists believe a vaccine might already exist.\r\nSurprising new research in a niche area of immunology suggests that certain live vaccines t… [+9522 chars]"}, {"source": {"id": null, "name": "Newsjok.com"}, "author": "sourav chowdhury", "title": "Indians should cut down on processed food as poor diet major cause behind Coronavirus death: UK cardiologist - Newsjok", "description": "Poor diet is a major cause behind the COVID-19 deaths and the Indians should urgently cut down on ultra-processed food to construct resilience towards the lethal virus, a number one Indian-origin cardiologist within the UK has cautioned. Dr Aseem Malhotra, wh…", "url": "https://newsjok.com/indians-should-cut-down-on-processed-food-as-poor-diet-major-cause-behind-coronavirus-death-uk-cardiologist-firstpost/", "urlToImage": "https://newsjok.com/wp-content/uploads/2020/05/Indians-should-cut-down-on-processed-food-as-poor-diet.jpg", "publishedAt": "2020-05-04T02:01:18Z", "content": "Poor diet is a major cause behind the COVID-19 deaths and the Indians should urgently cut down on ultra-processed food to construct resilience towards the lethal virus, a number one Indian-origin cardiologist within the UK has cautioned.\r\nDr Aseem Malhotra, w… [+5624 chars]"}, {"source": {"id": null, "name": "Techtimes.com"}, "author": "Giuliano J.", "title": "COVID-19 Effect: 'Happy Hypoxia' in Coronavirus Patients Concerns Doctors; Causes 50% Oxygen Drop - Tech Times", "description": "The drastic 50% drop in oxygen is concerning doctors.", "url": "https://www.techtimes.com/articles/249331/20200503/covid-19-effect-happy-hypoxia-in-coronavirus-patients-concerns-doctors-causes-50-oxygen-drop.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/365325/happy-hypoxia-seen-in-covid-19-patients-causes-unusual-50-oxygen-drop-could-lead-to-death-experts-say.jpg", "publishedAt": "2020-05-04T01:26:39Z", "content": "A new COVID-19 side effect is baffling medical experts. According to The Guardian's latest report, a new study has revealed that COVID-19 patients who appear to be not in distress have dangerously low oxygen levels. This may not only cause the patient to beco… [+2550 chars]"}, {"source": {"id": null, "name": "Kxan36news.com"}, "author": null, "title": "France announced the date of appearance of the first patient with a coronavirus - The KXAN 36 News", "description": null, "url": "http://www.kxan36news.com/france-announced-the-date-of-appearance-of-the-first-patient-with-a-coronavirus", "urlToImage": null, "publishedAt": "2020-05-04T00:11:56Z", "content": "the Chief emergency physician of the hospital of Bobigny Yves Cohen announced the date of appearance of the first patient with a coronavirus in France. He told about it on air of TV channel BFM, reports TASS.\r\nAccording to him, the first patient infected with… [+961 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Vanessa Chalmers Health Reporter For Mailonline", "title": "One in four coronavirus patients on ventilation suffer KIDNEY failure - Daily Mail", "description": "Charities in the UK have warned the killer infection can lead to acute kidney injury (AKI), a sudden serious condition that can be fatal if not treated immediately.", "url": "https://www.dailymail.co.uk/news/article-8282521/One-four-coronavirus-patients-ventilation-suffer-KIDNEY-failure.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/03/18/27955148-0-image-a-65_1588526458221.jpg", "publishedAt": "2020-05-03T21:08:46Z", "content": "Over a quarter of coronavirus patients on ventilation suffer kidney failure, causing a shortage of vital equipment. \r\nCharities have warned the killer infection can lead to acute kidney injury (AKI), a sudden serious condition that can be fatal if not treated… [+8240 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Marla Milling", "title": "Can You Pray Coronavirus Away? A New Clinical Study Is Underway - Forbes", "description": "Could remote prayer help heal critically ill COVID-19 patients? A new clinical study focuses on finding an answer.", "url": "https://www.forbes.com/sites/marlamilling/2020/05/03/can-you-pray-coronavirus-away-a-new-clinical-study-is-underway/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1211656382%2F0x0.jpg", "publishedAt": "2020-05-03T16:15:53Z", "content": "As researchers race to find an effective treatment or vaccine for the COVID-19 coronavirus, a new study is underway to determine if the power of prayer helps heal ICU patients sickened with the virus. \r\nCardiologist Dr. Dhanunjaya DJ Lakkireddy, Medical Direc… [+1738 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Tamil Nadu: Four new Covid-19 cases take total in Coimbatore to 146 - Times of India", "description": "Four people in the district tested positive for Covid-19 on Sunday, taking the total number of cases to 146. While one of them is a 31-year-old pregna", "url": "https://timesofindia.indiatimes.com/city/coimbatore/tamil-nadu-four-new-covid-19-cases-take-total-in-coimbatore-to-146/articleshow/75518834.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75518860,width-1070,height-580,imgsize-85636,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-05-03T14:09:48Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Paige Holland, Saffron Otter", "title": "Make-up artist who cured acne shares top skincare hacks - and 3 lockdown mistakes - Mirror Online", "description": "Ella Gorton, a make-up artist who suffered with acne as an adult, has shared her top tips for achieving glowing skin in lockdown, and the three mistakes you're probably making", "url": "https://www.mirror.co.uk/lifestyle/health/make-up-artist-shares-top-21966289", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21966255.ece/ALTERNATES/s1200/1_THP_CHP_030520SLUG_2181JPGa.jpg", "publishedAt": "2020-05-03T13:17:22Z", "content": "A make-up artist who suffered with severe acne as an adult shared her top tips for achieving glowing skin in lockdown.\r\n Being in lockdown could actually impact our skin for a number of reasons, some including a change of diet, sleep pattern and a lack of vit… [+5841 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ivana Kottasová, CNN", "title": "What you need to know about coronavirus on Sunday, May 3 - CNN", "description": "Expect a barrage of reopening announcements in the coming days.", "url": "https://www.cnn.com/2020/05/03/world/coronavirus-newsletter-05-03-20/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "publishedAt": "2020-05-03T11:33:52Z", "content": null}]}