{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Wionews.com"}, "author": "WION Web Team", "title": "Cyber spies are targetting ongoing COVID-19 vaccination research programmes across the world - WION", "description": "Even though no data has been reportedly stolen yet, the UK has also reported similar activity", "url": "https://www.wionews.com/world/cyber-spies-are-targetting-ongoing-covid-19-vaccination-research-programmes-across-the-world-296153", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/04/07/135915-vaccine-research-afp.jpg", "publishedAt": "2020-05-01T18:41:28Z", "content": "Spy agencies across the world are targeting the American research organisations to find out about potential coronavirus vaccines.\r\nIn conversation with the BBC, Bill Evaning, the director of the National Counterintelligence and Security Center claimed that th… [+2520 chars]"}, {"source": {"id": null, "name": "Arabnews.com"}, "author": "Reuters", "title": "India extends coronavirus lockdown for two weeks, with some easing - Arabnews", "description": "NEW DELHI: The Indian government said on Friday that the world's biggest coronavirus lockdown will be extended for two weeks beyond May 4, but with some easing of restrictions. The home ministry said in a statement that in view of \"significant gains in the CO…", "url": "https://www.arabnews.com/node/1668021", "urlToImage": "https://www.arabnews.com/sites/default/files/2020/05/01/2086556-403660683.jpg", "publishedAt": "2020-05-01T18:40:59Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus deaths 'disproportionately high' for black and ethnic minority people - Channel 4 News", "description": "When the pictures of the first 10 doctors to die from Covid-19 appeared it seemed unusual that they were all from ethnic minority backgrounds. (Subscribe: ht...", "url": "https://www.youtube.com/watch?v=8L7s7Z6nECQ", "urlToImage": "https://i.ytimg.com/vi/8L7s7Z6nECQ/maxresdefault.jpg", "publishedAt": "2020-05-01T18:38:30Z", "content": "When the pictures of the first 10 doctors to die from Covid-19 appeared it seemed unusual that they were all from ethnic minority backgrounds. \r\n(Subscribe: https://bit.ly/C4_News_Subscribe) \r\nBut at that point it was not clear if the numbers reflected the fa… [+296 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "France says 218 more deaths from COVID-19 taking toll to 24,594 - Reuters India", "description": "The number of people who have died from coronavirus infection in France rose by 218 to 24,594 on Friday, while hospitalizations for the disease and people in ICU units continued to decline, the public health chief said on Friday.", "url": "https://in.reuters.com/article/us-health-coronavirus-france-casualties-idINKBN22D61M", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200501&t=2&i=1517186386&w=1200&r=LYNXMPEG403Z5", "publishedAt": "2020-05-01T17:44:00Z", "content": "PARIS (Reuters) - The number of people who have died from coronavirus infection in France rose by 218 to 24,594 on Friday, while hospitalizations for the disease and people in ICU units continued to decline, the public health chief said on Friday. \r\nThe death… [+403 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "IANS", "title": "Not disinfecting your phones? Mobiles may be 'Trojan horses' for Covid-19 - Livemint", "description": "According to the researchers, community transmission could occur when an infected person touched their phone and then a pole on a bus which was grasped by an elderly person.Mobile devices were 'five-star hotels with premium heated spas, free buffet for microb…", "url": "https://www.livemint.com/technology/tech-news/not-disinfecting-your-phones-mobiles-may-be-trojan-horses-for-covid-19-11588337257574.html", "urlToImage": "https://images.livemint.com/img/2020/05/01/600x338/AFP_1Q05YA_1584596633859_1588350318937.jpg", "publishedAt": "2020-05-01T16:25:38Z", "content": "Sydney: Are you disinfecting your phone? If not, do it now. Mobile phones could be acting as 'Trojan horses' for coronavirus, warn researchers, urging billions of users worldwide to decontaminate their devices daily.While all the studies predate the current p… [+2895 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Giles Tremlett", "title": "US germ warfare research leads to new early Covid-19 test - The Guardian", "description": "Exclusive: test has potential to identify carriers before they become infectious", "url": "https://www.theguardian.com/world/2020/may/01/us-germ-warfare-lab-creates-test-for-pre-infectious-covid-19-carriers", "urlToImage": "https://i.guim.co.uk/img/media/068d65cec4394c6141828fdcbfb01a09121414f2/0_175_2560_1536/master/2560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=bf2cfc75e64ed843934c708eda7c0e43", "publishedAt": "2020-05-01T16:09:44Z", "content": null}, {"source": {"id": null, "name": "Healthissuesindia.com"}, "author": "Kerean Watts", "title": "herpes - Hyderus Cyf", "description": "Health issues in India", "url": "https://www.healthissuesindia.com/tag/herpes/", "urlToImage": "https://www.healthissuesindia.com/wp-content/uploads/2020/05/53228323_s.jpg", "publishedAt": "2020-05-01T16:07:44Z", "content": "For some, herpes is a badge of shame. However, there is no need for this to be the case. Herpes, in fact, is relatively common. Globally, there are billions of people living with the diseases according to research by the University of Bristol, the World Healt… [+83 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Italy's tally of daily coronavirus deaths dips, cases steady - Reuters India", "description": "Deaths from the COVID-19 epidemic in Italy climbed by 269 on Friday, down from 285 the day before, the Civil Protection Agency said, while the daily tally of new infections stood at 1,965 against 1,872 on Thursday.", "url": "https://in.reuters.com/article/health-coronavirus-italy-tally-idINKBN22D5UR", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200501&t=2&i=1517174722&w=1200&r=LYNXMPEG403UA", "publishedAt": "2020-05-01T16:04:00Z", "content": "ROME (Reuters) - Deaths from the COVID-19 epidemic in Italy climbed by 269 on Friday, down from 285 the day before, the Civil Protection Agency said, while the daily tally of new infections stood at 1,965 against 1,872 on Thursday. \r\nThe total death toll sinc… [+811 chars]"}, {"source": {"id": null, "name": "Boomlive.in"}, "author": "AFP", "title": "Did A COVID-19 Vaccine Volunteer In UK Die After Trial? A Fact Check - BOOM", "description": "The volunteer, herself, has dismissed the report, which was also denied by UK health officials.", "url": "https://www.boomlive.in/world/did-a-covid-19-vaccine-volunteer-in-uk-die-after-trial-a-fact-check-7914", "urlToImage": "https://www.boomlive.in/h-upload/2020/04/30/920711-uk-vaccine.jpg", "publishedAt": "2020-05-01T15:52:19Z", "content": "An online report shared tens of thousands of times on Facebook and Twitter claims that one of Britain's first volunteers to be injected with a trial coronavirus vaccine has died. However, the claim is false, originating from a website with a history of spread… [+3752 chars]"}, {"source": {"id": null, "name": "Smetimes.in"}, "author": null, "title": "SL looks to transport medicines, food in COVID-19 hit areas via drones - SME Times", "description": "Sri Lanka's Civil Aviation Authority on Friday invited drone operators in the country to offer their services towards the possible transportation of essential medicines and food supplies in COVID-19 hit areas.", "url": "http://www.smetimes.in/smetimes/news/global-business/2020/May/01/covid-sri-lanka52435.html", "urlToImage": null, "publishedAt": "2020-05-01T15:27:12Z", "content": "Sri Lanka's Civil Aviation Authority on Friday invited drone operators \r\nin the country to offer their services towards the possible \r\ntransportation of essential medicines and food supplies in COVID-19 hit \r\nareas.In a statement, the Civil Aviation Authority… [+927 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Your Healthy Family: COVID-19 infection may increase stroke risk - KOAA 5", "description": "We know COVID-19 impacts the lungs, but recent data shows the infection may also increase a person’s risk for suffering a stroke.", "url": "https://www.youtube.com/watch?v=1LEaOTjxr-A", "urlToImage": "https://i.ytimg.com/vi/1LEaOTjxr-A/maxresdefault.jpg", "publishedAt": "2020-05-01T15:21:44Z", "content": "We know COVID-19 impacts the lungs, but recent data shows the infection may also increase a persons risk for suffering a stroke."}, {"source": {"id": null, "name": "News18.com"}, "author": "Trending Desk", "title": "Study Claims Meat-eaters Have Better Mental Health Than Vegetarians - News18", "description": "The scientists at the University of Alabama reviewed 18 studies with more than 160,000 people to examine the relationship between meat-eaters and their mental condition.", "url": "https://www.news18.com/news/lifestyle/study-claims-meat-eaters-have-better-mental-health-than-vegetarians-2601593.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2018/08/meat_AFP2.jpg", "publishedAt": "2020-05-01T14:46:37Z", "content": "A group of US-based researchers claims in a new study that meat consumers are less likely to be depressed when compared with vegetarians and vegans.\r\nThe scientists at the University of Alabama reviewed 18 studies with more than 160,000 people to examine the … [+1885 chars]"}, {"source": {"id": null, "name": "Medicinenet.com"}, "author": null, "title": "Blood Count May Offer Clues to Treatment of COVID-19: Study - MedicineNet", "description": "The severity of COVID-19 illness may be influenced by what researchers call cytokine storms.", "url": "https://www.medicinenet.com/script/main/art.asp?articlekey=231038", "urlToImage": "https://images.medicinenet.com/images/facebook/medicinenet/fb-mnet-default.jpg", "publishedAt": "2020-05-01T14:30:47Z", "content": "FRIDAY, May 1, 2020 (HealthDay News) -- The severity of COVID-19 illness may be influenced by what researchers call \"cytokine storms.\"\r\nIn a new study, investigators assessed 522 COVID-19 patients, aged 5 days to 97 years, who were admitted to two hospitals i… [+1883 chars]"}, {"source": {"id": null, "name": "Medicinenet.com"}, "author": null, "title": "ECMO: Technology That Might Help COVID Patients When Ventilators Can't - MedicineNet", "description": "Many people who are seriously ill with COVID-19 end up on ventilators to help them breathe, but sometimes, even ventilators aren't enough. That's when a device called ECMO may help.", "url": "https://www.medicinenet.com/script/main/art.asp?articlekey=231035", "urlToImage": "https://images.medicinenet.com/images/facebook/medicinenet/fb-mnet-default.jpg", "publishedAt": "2020-05-01T14:30:47Z", "content": "By Serena GordonHealthDay ReporterFRIDAY, May 1, 2020 (HealthDay News) -- Many people who are seriously ill with COVID-19 end up on ventilators to help them breathe, but sometimes, even ventilators aren't enough. That's when a device called ECMO may help.\r\nEC… [+3661 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "Hangover in morning? Drink plant extracts to relieve symptoms - India TV News", "description": "Various natural remedies have been recommended to ease hangover symptoms, but there is as yet no strong scientific evidence for their use.", "url": "https://www.indiatvnews.com/lifestyle/news-hangover-morning-drink-plant-extracts-symptoms-613202", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/05/hangover-1588337141.jpg", "publishedAt": "2020-05-01T13:27:29Z", "content": "Image Source : INSTAGRAMThe plant extracts included Barbados cherry (Acerola), prickly pear, ginkgo Biloba, willow and ginger root.\r\nIf you are suffering from headache and nausea after a drinking fiesta with friends last evening, read this carefully. A plant … [+2661 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Scientists develop fast, sensitive antibody blood test for COVID-19 - The Financial Express", "description": "To help identify people with current or past exposure to SARS-CoV-2, the researchers, including those from Southern Medical University in China, wanted to develop a fast, sensitive antibody test.", "url": "https://www.financialexpress.com/lifestyle/health/scientists-develop-fast-sensitive-antibody-blood-test-for-covid-19/1945736/", "urlToImage": "https://images.financialexpress.com/2020/05/covid-19-blood-test.jpg", "publishedAt": "2020-05-01T13:09:38Z", "content": "Scientists have developed a quick, sensitive test for antibodies against the novel coronavirus in human blood that could help doctors track a person’s exposure to COVID-19, as well as confirm suspected cases that tested negative by other methods.\r\nBecause COV… [+2098 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Minhaj Adnan", "title": "COVID-19 vaccine may take at least 9 months: Bill Gates - The Siasat Daily", "description": "San Francisco: While it appears that only a COVID-19 vaccine may take us back to normal, its development may take at least nine months to two years, billionaire philanthropist Bill Gates has said. Even though several drugs are also being tested to treat COVID…", "url": "https://www.siasat.com/covid-19-vaccine-may-take-least-9-months-bill-gates-1882570/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/02/Bill-gates-1.jpg", "publishedAt": "2020-05-01T13:08:30Z", "content": "San Francisco: While it appears that only a COVID-19 vaccine may take us back to normal, its development may take at least nine months to two years, billionaire philanthropist Bill Gates has said.\r\nEven though several drugs are also being tested to treat COVI… [+2277 chars]"}, {"source": {"id": null, "name": "Thequint.com"}, "author": "William Petri", "title": "5 Questions on Asymptomatic COVID-19 Patients Answered - The Quint", "description": "Asymptomatic COVID-19 FAQs: A physician answers commonly asked questions on asymptomatic patients like how common it is to be asymptomatic or how contagious it is.", "url": "https://fit.thequint.com/coronavirus/5-questions-on-asymptomatic-covid-19-patients-answered", "urlToImage": "https://images.assettype.com/thequint-fit/2020-03/a2b8cd92-1c20-433a-8ad5-68dbb5351c0f/19031_pti18_03_2020_000105b.jpg", "publishedAt": "2020-05-01T12:50:15Z", "content": "No one knows for sure, and for the moment lots of the evidence is anecdotal.\r\nFor a small example, consider the nursing home in Washington\r\n where many residents became infected. Twenty-three tested positive. Ten of them were already sick. Ten more eventually… [+1055 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "When will we have a vaccine for coronavirus (COVID-19)? | Wellcome - Wellcome Trust", "description": "What are some of the challenges around developing a vaccine for COVID-19? And when will a vaccine be available? Charlie Weller, head of Wellcome's vaccine pr...", "url": "https://www.youtube.com/watch?v=qkopw062iGM", "urlToImage": "https://i.ytimg.com/vi/qkopw062iGM/maxresdefault.jpg", "publishedAt": "2020-05-01T12:28:55Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Millions of children risk missing vaccines, says UN - BBC News", "description": "A huge backlog of shipments has built up in the coronavirus outbreak, the organisation warns.", "url": "https://www.bbc.co.uk/news/world-52503313", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/6B4B/production/_112076472_mediaitem112076469.jpg", "publishedAt": "2020-05-01T12:18:59Z", "content": "Image copyrightUnicef\r\nMillions of children risk missing \"life-saving\" vaccines, the UN has warned, after a \"massive backlog\" of shipments built up due to the coronavirus pandemic.\r\nThe outbreak has had a huge impact on the air industry, drastically reducing … [+2043 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Thomas Macaulay", "title": "Drug discovery might be the best use of AI to tackle the pandemic - The Next Web", "description": "In the four months since the novel coronavirus was first identified, a myriad of AI tools has popped up promising to fight the disease. The tech has predicted how the virus will spread, calculated ventilator demand, and searched for symptoms by analyzing X-ra…", "url": "https://thenextweb.com/neural/2020/05/01/drug-discovery-might-be-the-best-use-of-ai-to-tackle-the-pandemic/", "urlToImage": "https://img-cdn.tnwcdn.com/image/neural?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2020%2F05%2FUntitled-design-21.png&signature=4c7e95a2fd26371176161004b594fa0c", "publishedAt": "2020-05-01T12:03:46Z", "content": "In the four months since the novel coronavirus was first identified, a myriad of AI tools has popped up promising to fight the disease.\r\nThe tech has predicted how the virus will spread, calculated ventilator demand, and searched for symptoms by analyzing X-r… [+2054 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Personal protective equipment used by COVID-19 medical staff may cause serious skin injuries: Study - Deccan Herald", "description": "More than 40 per cent of medical staff treating COVID-19-infected patients may experience serious skin injury related to the use of personal protective equipment such as masks, goggles, face shields, and protective gowns, according to a study. According to th…", "url": "https://www.deccanherald.com/international/personal-protective-equipment-used-by-covid-19-medical-staff-may-cause-serious-skin-injuries-study-832312.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/01/PPE-1588334755.jpg", "publishedAt": "2020-05-01T12:01:03Z", "content": "More than 40 per cent of medical staff treating COVID-19-infected patients may experience serious skin injury related to the use of personal protective equipment such as masks, goggles, face shields, and protective gowns, according to a study.\r\nAccording to t… [+3097 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "How Spanish flu changed the world - Telangana Today", "description": "Hyderabad: A couple of years ago, journalist Laura Spinney could hardly believe how little people thought about the Spanish flu pandemic, which swept the globe in three deadly waves between 1918 and 1919. So she wrote a book – Pale Rider: The Spanish Flu of 1…", "url": "https://telanganatoday.com/how-spanish-flu-changed-the-world", "urlToImage": "https://cdn.telanganatoday.com/im/Telangana-Today-News.jpg", "publishedAt": "2020-05-01T11:56:59Z", "content": "Hyderabad: A couple of years ago, journalist Laura Spinney could hardly believe how little people thought about the Spanish flu pandemic, which swept the globe in three deadly waves between 1918 and 1919.\r\nSo she wrote a book Pale Rider: The Spanish Flu of 19… [+1768 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Studies Show Smokers at Lower Risk of Catching Coronavirus, But Don't Light it Yet - News18", "description": "The French study, however, did not advocate smoking which is believed to kill an estimated 8 million people across the world annually.", "url": "https://www.news18.com/news/buzz/studies-show-smokers-at-lower-risk-of-catching-coronavirus-but-dont-light-it-yet-2600829.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/05/1588325487_smoking.jpg", "publishedAt": "2020-05-01T09:54:29Z", "content": "The novel coronavirus has baffled doctors and researchers across the globe. The disease that affects the lungs and the respiratory system has shown a number of symptoms and characteristics. One of the most puzzling of these traits has, however, been its alleg… [+2502 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Andrew Gelman", "title": "The More Effectively We Track Data, the Less Speculative Our Coronavirus Models Will Be - The Wire", "description": "Continuous data collection, forecasting, and calibration projects will have value long after the pandemic has faded.", "url": "https://science.thewire.in/health/coronavirus-data-tracking-symptoms-flu/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2020/05/01133730/Screen-Shot-2020-05-01-at-1.37.12-PM.png", "publishedAt": "2020-05-01T09:34:20Z", "content": "As of  April 27, there have now been more than 3 million confirmed cases of COVID-19 and more than 200,000 recorded deaths worldwide, one-quarter of which have been in the United States.\r\nBut we dont really know how many people have been infected or how fast … [+7928 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Low immunity for Gemini, amxiety for Aquarians: Here is your health horoscope for the month of May! - Times of India", "description": "Continuing with the tradition, astrologer Manav Jaitly shares his tips for all zodiac signs to stay healthy this month. Stay well and safe!", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/de-stress/low-immunity-for-gemini-amxiety-for-aquarians-here-is-your-health-horoscope-for-the-month-of-may/photostory/75488606.cms", "urlToImage": "https://static.toiimg.com/photo/75488800.cms", "publishedAt": "2020-05-01T09:23:49Z", "content": "Libras tend to have low immunity and as the weather has officially changed, (hello, scorching summers!), it's best if you take preventive care from the start. Problems like joint ache, indigestion or pain shall plague you. Do not develop a neglecting attitude… [+160 chars]"}, {"source": {"id": null, "name": "Eurekalert.org"}, "author": null, "title": "Emergence of deadly honey bee disease revealed - EurekAlert", "description": "Honey bee colonies from across the UK are increasingly suffering from a viral disease, a new study has shown. Publishing their findings in the journal Nature Communications, the team led by Professor Giles Budge of Newcastle University, UK, found that the num…", "url": "https://www.eurekalert.org/pub_releases/2020-05/nu-eod043020.php", "urlToImage": "https://www.eurekalert.org/images/EurekAlert_StackedLogo_RGB.jpg", "publishedAt": "2020-05-01T09:04:31Z", "content": "Honey bee colonies from across the UK are increasingly suffering from a viral disease, a new study has shown.\r\nPublishing their findings in the journal Nature Communications, the team led by Professor Giles Budge of Newcastle University, UK, found that the nu… [+3494 chars]"}, {"source": {"id": null, "name": "Greaterkashmir.com"}, "author": null, "title": "Testing not enough, scientists examine sewage to gauge spread of coronavirus - Greater Kashmir", "description": "Testing not enough, scientists examine sewage to gauge spread of coronavirus Greater Kashmir | Given that most Indians are unlikely to be tested for COVID-19, scientists are taking a cue from the country's surveillance programme for polio and", "url": "https://www.greaterkashmir.com/news/latest-news/testing-not-enough-scientists-examine-sewage-to-gauge-spread-of-coronavirus/", "urlToImage": "https://i2.wp.com/www.greaterkashmir.com/wp-content/uploads/2020/04/nurse-covid.jpg?fit=720%2C480&ssl=1", "publishedAt": "2020-05-01T08:43:00Z", "content": "Given that most Indians are unlikely to be tested for\r\nCOVID-19, scientists are taking a cue from the country’s surveillance programme\r\nfor polio and turning to sewage to get a clearer snapshot of how many people\r\nare infected with the coronavirus.\r\nWastewate… [+6286 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Coronavirus Pandemic Likely to Last Two Years, Report Says - Bloomberg", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=b4944de0-8b89-11ea-ba6a-39b3f358fe32&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNS0wMS9jb3ZpZC0xOS1wYW5kZW1pYy1saWtlbHktdG8tbGFzdC10d28teWVhcnMtcmVwb3J0LXNheXM=", "urlToImage": null, "publishedAt": "2020-05-01T08:36:16Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "America says coronavirus is not man-made - ​Suspicions - Economic Times", "description": "Since the start of the pandemic, conspiracy theorists have espoused the theory that the coronavirus is a man-made virus designed to wipe out as much of the world’s population as possible. ​Suspicions", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/america-says-coronavirus-is-not-man-made/suspicions/slideshow/75487408.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75487408,width-1070,height-580,overlay-economictimes/photo.jpg", "publishedAt": "2020-05-01T08:07:00Z", "content": null}, {"source": {"id": null, "name": "Genengnews.com"}, "author": "Jeffrey S. Buguliskis, Ph.D.", "title": "Axon Regeneration Seen for Optic Nerve and Spinal Cord Injuries - Genetic Engineering & Biotechnology News", "description": "New research shows that gains in functional recovery from axonal injuries may be possible, thanks to a molecule known as Lin28, which regulates cell growth.", "url": "https://www.genengnews.com/news/axon-regeneration-seen-for-optic-nerve-and-spinal-cord-injuries/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2018/11/Sep29_2017_Getty_694146082_BrainNeuronsDegenerativeDisease7590186811.jpg", "publishedAt": "2020-05-01T08:00:00Z", "content": "The regeneration of damaged neurons has been the ultimate goal for a large portion of neuroscience research. Understanding the underlying mechanisms that control neuronal growth is key to developing interventional therapies. Like power lines in an electrical … [+4463 chars]"}, {"source": {"id": null, "name": "Akipress.com"}, "author": null, "title": "Five skin conditions linked to COVID-19 identified, study finds - AKIpress", "description": "News and analytical articles about Kazakhstan, Kyrgyzstan, Tajikistan, Turkmenistan, Uzbekistan.", "url": "https://akipress.com/news:640656:Five_skin_conditions_linked_to_COVID-19_identified,_study_finds/", "urlToImage": "https://static.ca-news.org/upload/ennews/6/640656.1588310226.b.jpg", "publishedAt": "2020-05-01T05:17:00Z", "content": "AKIPRESS.COM - Five skin conditions associated with coronavirus have been identified by dermatologists, according to a new study.\r\nResearch was carried out on 375 patients in Spain, in an effort to build a picture of how the disease might manifest in skin sym… [+758 chars]"}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "Ritika arun vaishali", "title": "Beware! Gastric problems might also be a symptom of coronavirus - The New Indian Express", "description": "Recently, the CDC added five new symptoms to the list, which include intense chills, headache, pink eye, loss of smell or taste and muscle pain.", "url": "https://www.newindianexpress.com/cities/vijayawada/2020/may/01/beware-gastric-problems-might-also-be-a-symptom-of-coronavirus-2137695.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2020/5/1/w600X390/CVBK.jpg", "publishedAt": "2020-05-01T04:02:00Z", "content": "VIJAYAWADA: With coronavirus being still a comparatively new virus, the Centre for Disease Control and Prevention (CDC) has been updating the world with more and more symptoms noticed during its studies on COVID-19. Recently, the CDC added five new symptoms t… [+2253 chars]"}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "Dileep V Kumar", "title": "Covid-19 or dengue? Report on similar symptoms sparks concern - The New Indian Express", "description": "The health dept has stumbled upon a report that warns of difficulty in distinguishing between both", "url": "https://www.newindianexpress.com/states/kerala/2020/may/01/covid-19-or-dengue-report-on-similar-symptoms-sparks-concern-2137616.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2019/11/28/w600X390/RECOVERING_.jpg", "publishedAt": "2020-05-01T01:28:00Z", "content": "THIRUVANANTHAPURAM: Amid its battle against Covid-19, the Health Department has received some worrying news. The department has stumbled upon a report that warns of the difficulty in distinguishing between dengue fever and novel coronavirus, as symptoms like … [+2890 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "US coronavirus outbreak soon to be deadlier than any flu since 1967 as deaths top 60,000 - firstshopp", "description": "US deaths from the novel coronavirus topped 60,000 on Wednesday and the outbreak will soon be deadlier than any flu season since 1967, according to a Reuters tally.America’s worst flu season …", "url": "https://www.indiatoday.in/world/story/us-coronavirus-outbreak-soon-to-be-deadlier-than-any-flu-since-1967-as-deaths-top-60-000-1672884-2020-04-30?utm_source=rss/", "urlToImage": "https://firstshopp.com/wp-content/uploads/2020/04/US-coronavirus-outbreak-soon-to-be-deadlier-than-any-flu.png", "publishedAt": "2020-04-30T23:53:33Z", "content": "US deaths from the novel coronavirus topped 60,000 on Wednesday and the outbreak will soon be deadlier than any flu season since 1967, according to a Reuters tally.\r\nAmerica’s worst flu season in recent years was in 2017-2018 when more than 61,000 people died… [+2123 chars]"}, {"source": {"id": null, "name": "Boomlive.in"}, "author": "AFP", "title": "No, Aspirin Mixed With Lemon Juice And Honey Will Not Cure COVID-19 - BOOM", "description": "Facebook posts claim that aspirin, lemon juice and honey have been combined to make a home remedy...", "url": "https://www.boomlive.in/world/no-aspirin-mixed-with-lemon-juice-and-honey-will-not-cure-covid-19-7892", "urlToImage": "https://www.boomlive.in/h-upload/2020/04/30/920696-aspirin.jpg", "publishedAt": "2020-04-30T20:56:08Z", "content": "Multiple Facebook posts claim that aspirin, lemon juice and honey have been combined to make a \"home remedy\" for COVID-19 in Italy. The claim is misleading; the World Health Organization (WHO) has warned against self-medicating for COVID-19, saying there is n… [+1844 chars]"}, {"source": {"id": null, "name": "Businesswire.com"}, "author": null, "title": "Sinovac Reports Unaudited Fourth Quarter 2019 Financial Results and Files 2019 Annual Report on Form 20-F - Business Wire", "description": "Sinovac Biotech Ltd. (NASDAQ:SVA) (“Sinovac” or the “Company”), a leading provider of biopharmaceutical products in China, has filed its 2019 annual r", "url": "https://www.businesswire.com/news/home/20200430005994/en/Sinovac-Reports-Unaudited-Fourth-Quarter-2019-Financial", "urlToImage": "http://www.businesswire.com/images/bwlogo_square.png", "publishedAt": "2020-04-30T20:29:00Z", "content": "BEIJING, China--(BUSINESS WIRE)--Sinovac Biotech Ltd. (NASDAQ:SVA) (Sinovac or the Company), a leading provider of biopharmaceutical products in China, has filed its 2019 annual report on Form 20-F with the U.S. Securities and Exchange Commission for the year… [+51567 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Dr. Kamal Kant Kohli", "title": "New clinical review casts doubt on use of chloroquine and hydroxychloroquine for COVID-19 - Medical Dialogues", "description": "In its May issue, The FASEB Journal is publishing a comprehensive review on the science and clinical ...", "url": "https://medicaldialogues.in/medicine/news/new-clinical-review-casts-doubt-on-use-of-chloroquine-and-hydroxychloroquine-for-covid-19-65311", "urlToImage": "https://medicaldialogues.in/h-upload/2020/04/02/1200x630_126177-anti-malarial-drug.jpg?width=1200&height=630", "publishedAt": "2020-04-30T18:00:10Z", "content": "In its May issue, The FASEB Journal is publishing a comprehensive review on the science and clinical experiences with the drugs chloroquine and hydroxychloroquine, first introduced as effective weapons against malaria, rheumatoid arthritis, and the autoimmune… [+2899 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "PTI", "title": "Ruthless Containment, Vaccine Far Away: Amitabh Kant’s 6-Point Forecast on What’s Next in Covid-19 Ba... - News18", "description": "Niti Aayog CEO Amitabh Kant said that there would be strict containment measures in 'red zones' but  there will also be considerable relaxations to people and services.", "url": "https://www.news18.com/news/india/ruthless-containment-vaccine-far-away-amitabh-kants-6-point-forecast-on-whats-next-in-covid-19-battle-2600237.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1588130337_dibrugarh.jpg", "publishedAt": "2020-04-30T16:15:00Z", "content": "Advocating strict containment measures in 'red zones', Niti Aayog CEO Amitabh Kant on Thursday said the economy should kickstart with full supply chains to protect livelihood of people.\r\nThe Centre on Wednesday gave clear indications that the ongoing nationwi… [+1444 chars]"}, {"source": {"id": null, "name": "Pharmalive.com"}, "author": "Andrew Humphreys", "title": "India exports 50 million hydroxychloroquine tablets to U.S. for COVID-19 fight: source - PharmaLive", "description": "India shipped 50 million tablets of hydroxychloroquine to the United States, an Indian source with direct knowledge of the exports said, although U.S. regulators warned the anti-malarial drug may have harmful side effects in the treatment of COVID-19.", "url": "https://www.pharmalive.com/india-exports-50-million-hydroxychloroquine-tablets-to-u-s-for-covid-19-fight-source/", "urlToImage": "https://www.pharmalive.com/wp-content/uploads/2020/04/India-exports-50-million-hydroxychloroquine-tablets-to-U.S.-for-COVID-19-fight-PER-source-REUTERS-4-30-20.jpeg", "publishedAt": "2020-04-30T16:10:35Z", "content": "NEW DELHI/AHMEDABAD (Reuters) – India has shipped 50 million tablets of hydroxychloroquine to the United States, an Indian source with direct knowledge of the exports said, although U.S. regulators warned the anti-malarial drug may have harmful side effects i… [+3017 chars]"}, {"source": {"id": null, "name": "Greatandhra.com"}, "author": "GREATANDHRA BUREAU", "title": "Covid-19 May Not Go Away Even After A Vaccine.. - Greatandhra.com", "description": "The debates are going on about Covid-19 and the earliest possibility of getting a vaccine to combat it.", "url": "https://www.greatandhra.com/articles/special-articles/covid-19-may-not-go-away-even-after-a-vaccine-104368", "urlToImage": "https://www.greatandhra.com/newphotos7/Coronavirus-Vaccine1588260686.jpg", "publishedAt": "2020-04-30T15:31:26Z", "content": "The debates are going on about Covid-19 and the earliest possibility of getting a vaccine to combat it. But shockingly, some researchers are saying that the arrival of vaccine may not put a permanent end to the virus. \r\n\"Why the world has imposed lockdown? Is… [+1087 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Riya Baibhawi", "title": "COVID-19: Tigers tested for virus in US, photos break internet - Republic World - Republic World", "description": "Wildlife expert and photographer, Ron Magill shared photographs of samples being collected from tiger’s mouth, nose etc. for coronavirus", "url": "https://www.republicworld.com/entertainment-news/whats-viral/covid-19-tigers-tested-for-coronavirus-in-us-photographs-emerge.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/sjsv2woi5nxsvzzu_1588256316.jpeg?tr=f-jpeg", "publishedAt": "2020-04-30T14:42:54Z", "content": "After a tiger at New York's Bronx Zoo tested positive for COVID-19, scepticism arose about the animals contracting the virus. Amid all this, a series of photographs which show tiger being tested have caught everybody's attention. Taking to Twitter, Wildlife e… [+2067 chars]"}, {"source": {"id": null, "name": "Dailysabah.com"}, "author": "French Press Agency - AFP", "title": "WHO calls to keep other infectious diseases in check during pandemic | Daily Sabah - Daily Sabah", "description": "The World Health Organization's (WHO) European office warned Thursday that to keep other infectious diseases in check, vaccination programs must remain a priority even during...", "url": "https://www.dailysabah.com/world/who-calls-to-keep-other-infectious-diseases-in-check-during-pandemic/news", "urlToImage": "https://idsb.tmgrup.com.tr/ly/uploads/images/2020/04/30/thumbs/1200x600/33373.jpg", "publishedAt": "2020-04-30T13:54:58Z", "content": "The World Health Organization's (WHO) European office warned Thursday that to keep other infectious diseases in check, vaccination programs must remain a priority even during the coronavirus pandemic.\r\nThe warning came as the U.N. body noted that while the sp… [+1767 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Health check: How to cope with stress and anxiety during the pandemic - WFAA", "description": "For people who struggled with anxiety and depression before COVID-19, this can be an especially hard time. Health and wellness reporter Sonia Azad offers som...", "url": "https://www.youtube.com/watch?v=l48BiUk6Q3I", "urlToImage": "https://i.ytimg.com/vi/l48BiUk6Q3I/hqdefault.jpg", "publishedAt": "2020-04-30T13:37:33Z", "content": null}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Mia Jankowicz", "title": "A rare condition in children, which doctors fear is linked to the coronavirus, has been recorded in around 100 - Business Insider India", "description": "Almost 100 children in 6 countries have been reported infected with a rare condition that doctors suspect could have a connection to the coronavirus, according", "url": "https://www.businessinsider.in/science/news/a-rare-condition-in-children-which-doctors-fear-is-linked-to-the-coronavirus-has-been-recorded-in-around-100-kids-across-6-countries/articleshow/75474598.cms", "urlToImage": "https://www.businessinsider.in/photo/75474598/a-rare-condition-in-children-which-doctors-fear-is-linked-to-the-coronavirus-has-been-recorded-in-around-100-kids-across-6-countries.jpg?imgsize=783960", "publishedAt": "2020-04-30T13:19:00Z", "content": "Around 100 children in 6 countries have been reported as having a rare complication that doctors fear could be related to coronavirus, The Guardian reported. \r\nThe World Health Organization has put its clinical network on alert since UK health officials first… [+2674 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Bloomberg", "title": "Dead coronavirus particles muddy the outcome of covid-19 patient's test result - Livemint", "description": "Coronavirus patients who remain positive weeks after diagnosis may harbor dead virus particles that can’t be distinguished from infectious ones in standard tests, say scientists", "url": "https://www.livemint.com/news/india/dead-coronavirus-particles-muddy-the-outcome-of-test-results-11588250764951.html", "urlToImage": "https://images.livemint.com/img/2020/04/30/600x338/9ab39872-5baf-11ea-9c69-d6eb4bacb74c_1583076698066_1588251088823.jpg", "publishedAt": "2020-04-30T12:56:44Z", "content": "Coronavirus patients who remain positive weeks after diagnosis may harbor dead virus particles that cant be distinguished from infectious ones in standard tests, scientists in South Korea found.The so-called SARS-CoV-2 virus dies one-to-two weeks after infect… [+3318 chars]"}, {"source": {"id": null, "name": "Biospectrumasia.com"}, "author": null, "title": "CEPI invests $3.5M in Clover Australia for COVID-19 vaccine - BSA bureau", "description": "This initial CEPI investment will support Clover Australia in its efforts to initiate a phase 1 clinical trial in Australia", "url": "https://www.biospectrumasia.com/news/37/15879/cepi-invests-3-5m-in-clover-australia-for-covid-19-vaccine.html", "urlToImage": "https://www.biospectrumasia.com/uploads/articles/shutterstock_hcq_1024x686-15879.jpg", "publishedAt": "2020-04-30T12:33:53Z", "content": "This initial CEPI investment will support Clover Australia in its efforts to initiate a phase 1 clinical trial in Australia\r\nNorway based CEPI, the Coalition for Epidemic Preparedness Innovations has announced a ninth worldwide collaboration to develop a COVI… [+2419 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "First pregnancy complications may up risk of future premature birth - Daijiworld.com", "description": null, "url": "https://www.daijiworld.com/404Error.aspx", "urlToImage": null, "publishedAt": "2020-04-30T12:14:17Z", "content": "Daijiworld Residency,Airport Road, Bondel Post,Mangalore - 575 008 \r\n Karnataka IndiaTelephone : +91-824-2982023.General Enquiry: office@daijiworld.com,News &amp; Info : news@daijiworld.com"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "The ventilator question: Why Covid-19 patients starve of oxygen - India Today", "description": "A study in China found that 53 per cent Covid-19 patients died of respiratory problems. In many cases, the patients were able to breathe mechanically but the body lacked oxygen.", "url": "https://www.indiatoday.in/coronavirus-outbreak/story/the-ventilator-question-why-covid-19-patients-starve-of-oxygen-1672908-2020-04-30", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202004/Coronavirus_Prague_ICU_AP-PTI-647x363.jpeg?E.abPyKQ_NSVi5_G3pkEtM6ZgpBGlITY", "publishedAt": "2020-04-30T11:48:50Z", "content": "Health experts and authorities maintain that only about 15 per cent of Covid-19 patients actually need hospitalization, treatment in ICU, oxygen supply for breathing or ventilator support. Around 1 out of every 6 people who gets COVID-19 becomes seriously ill… [+4068 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak: How a secretive organization helped China hoard PPE - Global News", "description": "Before alerting the public to the danger posed by the novel coronavirus, Beijing quietly began gathering personal protective equipment (PPE), such as N95 mas...", "url": "https://www.youtube.com/watch?v=VwTCRygJi9M", "urlToImage": "https://i.ytimg.com/vi/VwTCRygJi9M/maxresdefault.jpg", "publishedAt": "2020-04-30T11:00:15Z", "content": null}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Laura Geggel", "title": "Are 'covid toes' a real symptom of the coronavirus? - Livescience.com", "description": "", "url": "https://www.livescience.com/frostbite-toes-covid-19.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/oDTNRUusqWcgXatU9e9fpY-1200-80.jpg", "publishedAt": "2020-04-30T11:00:00Z", "content": "A frostbite\r\n-like rash on a person's toes might be a symptom of the new coronavirus\r\n, according to anecdotal evidence from dermatologists around the world. \r\nHowever, research is needed to determine whether this peculiar rash is truly caused by  COVID-19.\r\n… [+3421 chars]"}, {"source": {"id": null, "name": "Socialnews.xyz"}, "author": null, "title": "9/11 rescuers have elevated levels of fatty liver disease: Study - SocialNews.XYZ", "description": "New York, April 30 (SocialNews.XYZ) Researchers have found that toxin exposure appears to have contributed to dramatically higher rates of fatty liver disease among first responders, who were at the World Trade Center site after... - Social News XYZ", "url": "https://www.socialnews.xyz/2020/04/30/9-11-rescuers-have-elevated-levels-of-fatty-liver-disease-study/", "urlToImage": "https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2019/01/29/6d195ba61d7c245fcabbae40819257da.jpg?fit=1999%2C902&quality=90&zoom=1&ssl=1", "publishedAt": "2020-04-30T10:44:16Z", "content": "Home » General » Study » 9/11 rescuers have elevated levels of fatty liver disease: Study\r\nNew York, April 30 (SocialNews.XYZ) Researchers have found that toxin exposure appears to have contributed to dramatically higher rates of fatty liver disease among fir… [+2128 chars]"}, {"source": {"id": null, "name": "Latestly.com"}, "author": "Tania Tarafdar", "title": "Could a Toe Rash Be a Possible Symptom of Coronavirus Infection? Here's How to Know If You Should Be Tested - LatestLY", "description": "New research has shown that red, patchy, and sometimes itchy rashes on the toes could be a of possible of coronavirus infection. Here is when you should get yourself tested.", "url": "https://www.latestly.com/lifestyle/health-wellness/could-a-toe-rash-be-a-possible-symptom-of-coronavirus-infection-heres-how-to-know-if-you-should-be-tested-for-covid-19-by-the-changes-in-your-skin-1719604.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2020/04/17-Image-3.jpg", "publishedAt": "2020-04-30T10:41:18Z", "content": "If you are a bit feverish or tired, you might wonder, 'Could I have COVID-19?' It is a legitimate concern considering that coronavirus has spread like wildfire worldwide. But are cough, fever and shortness of breath the only symptoms that you should consider,… [+2185 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Mohana Basu", "title": "CSIR to test sepsis drug in asymptomatic Covid patients and those who have recovered - ThePrint", "description": "CSIR will launch trials to see if sepsis drug can stop Covid-19 from progressing in asymptomatic patients & if it can prevent it from redeveloping in recovered patients.", "url": "https://theprint.in/health/csir-to-test-sepsis-drug-in-asymptomatic-covid-patients-and-those-who-have-recovered/411813/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/Bloodsmaples.jpg", "publishedAt": "2020-04-30T10:30:43Z", "content": "New Delhi: Scientists at the Council of Scientific and Industrial Research (CSIR)will launch two separate trials to test if a drug used to treat sepsis and liver cirrhosis can stop Covid-19 infection from progressing in asymptomatic patients and whether the s… [+3317 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu", "title": "Work-related stress may up risk for peripheral artery disease - The Hindu", "description": "The study is published in the Journal of the American Heart Association and researchers evaluated the records of 139,000 men and women for the findings", "url": "https://www.thehindu.com/sci-tech/health/work-related-stress-may-up-risk-for-peripheral-artery-disease/article31472062.ece", "urlToImage": "https://www.thehindu.com/sci-tech/health/oi2hcw/article31472061.ece/ALTERNATES/LANDSCAPE_615/upset-26815021920", "publishedAt": "2020-04-30T10:20:56Z", "content": "People who reported work-related stress were more likely to be hospitalised for peripheral artery disease compared to those who did not report work-related stress, according to a study.\r\nPeripheral artery disease, or PAD, is a cardiovascular disease that occu… [+2240 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bangalore Mirror", "title": "New COVID-19 symptoms in Indian patients? Experts need more data - Bangalore Mirror", "description": "Some experts say the new symptoms have been observed in Indian patients too while others have maintained that no such study in India has been published yet and it requires more evidence and data for", "url": "https://bangaloremirror.indiatimes.com/news/india/new-covid-19-symptoms-in-indian-patients-experts-need-more-data/articleshow/75469387.cms", "urlToImage": "https://static.toiimg.com/photo/imgsize-416767,msid-75469357/75469357.jpg", "publishedAt": "2020-04-30T09:34:00Z", "content": "The initial symptoms of novel coronavirus\r\n disease were identified as Influenza like and respiratory problems till now, but recently the Centre for Disease Control and Prevention, the US agency charged with tracking and investigating public health trends, ha… [+4548 chars]"}, {"source": {"id": null, "name": "Lakeshoregazette.com"}, "author": "yogesh sengar", "title": "Global Measles And Rubella Vaccines Market to Record Robust Growth Rate in the Next 10 Years After the End of COVID-19 Crisis and Forecast 2018 – 2026 - Lake Shore Gazette", "description": null, "url": "https://lakeshoregazette.com/2020/04/30/global-measles-and-rubella-vaccines-market-to-record-robust-growth-rate-in-the-next-10-years-after-the-end-of-covid-19-crisis-and-forecast-2018-2026/", "urlToImage": null, "publishedAt": "2020-04-30T08:38:48Z", "content": "Measles is childhood infectious disease caused by measles virus and rubella contagious viral infection by the rubella virus. Rubella can cause serious birth deficiencies in developing baby if a woman is infected when she is pregnant. The best method to protec… [+4777 chars]"}, {"source": {"id": null, "name": "Qrius.com"}, "author": "Qrius", "title": "CBD for muscle recovery – no more pains for gym enthusiasts - Qrius", "description": "How Does CBD Work?", "url": "https://qrius.com/cbd-for-muscle-recovery-no-more-pains-for-gym-enthusiasts/", "urlToImage": "//qrius.com/wp-content/uploads/2020/04/image1.jpg", "publishedAt": "2020-04-30T08:18:12Z", "content": "Have you ever finished a workout, and the moment you left the gym, you knew your muscles would hurt really bad the next day? Maybe you were training to get rid of the extra weight, or perhaps you wanted to demonstrate yourself you can handle a complicated wor… [+6117 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "Goblet, ciliated cells in nose likely COVID-19 entry points - Express Healthcare", "description": "Identification of these cells by researchers involved in Human Cell Atlas Lung Biological Network could help explain high transmission rate of virus", "url": "https://www.expresshealthcare.in/news/goblet-ciliated-cells-in-nose-likely-covid-19-entry-points/419604/", "urlToImage": "https://cdn.expresshealthcare.in/wp-content/uploads/2020/03/04162320/GettyImages-1208623485-e1583319314816.jpg", "publishedAt": "2020-04-30T08:12:00Z", "content": "Identification of these cells by researchers involved in Human Cell Atlas Lung Biological Network could help explain high transmission rate of virus\r\nScientists, including experts at Newcastle University, have discovered that goblet and ciliated cells in the … [+4702 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Smart contact lenses developed to diagnose, treat diabetes - Telangana Today", "description": "Seoul:  A team of researchers has developed wirelessly driven 'smart contact lens' technology that can detect diabetes and further treat diabetic retinopathy - a common visual health condition associated with the disease - just by wearing them. The team from …", "url": "https://telanganatoday.com/smart-contact-lenses-developed-to-diagnose-treat-diabetes", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2020/04/contact-lenses-1.jpg", "publishedAt": "2020-04-30T07:51:58Z", "content": "Seoul:  A team of researchers has developed wirelessly driven ‘smart contact lens’ technology that can detect diabetes and further treat diabetic retinopathy – a common visual health condition associated with the disease – just by wearing them.\r\nThe team from… [+2144 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Can eating ice cream spread Covid-19? Here’s what govt has to say - Hindustan Times", "description": "This is one of the latest in the list of false claims and rumours that have been doing the rounds ever since the coronavirus pandemic broke out.", "url": "https://www.hindustantimes.com/india-news/coronavirus-update-can-eating-ice-cream-spread-covid-19-here-s-what-government-has-to-say/story-sjEUVVL8Z8U2RsMSmcIwoO.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/30/Pictures/_bff52422-8aab-11ea-8f61-783f666b6086.jpg", "publishedAt": "2020-04-30T07:36:00Z", "content": "The government on Thursday rubbished claims linking consumption of ice cream and chilled products with the spread of Covid-19. \r\n“The World Health Organization has clarified that there is no scientific evidence to support the claim,” PIB clarified in a tweet.… [+1792 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "IIT-G, Hester Biosciences to develop COVID-19 vaccine - BSI bureau", "description": "The agreement between the two parties was signed on 15th April 2020", "url": "https://www.biospectrumindia.com/news/43/16343/iit-g-hester-biosciences-to-develop-covid-19-vaccine.html", "urlToImage": "https://www.biospectrumindia.com/uploads/articles/shutterstock_114250597_760x475_2x-16343.jpg", "publishedAt": "2020-04-30T07:25:55Z", "content": "The vaccine will be based on recombinant avian paramyxovirus-based vector platform\r\nIndian Institute of Technology Guwahati (IIT-G) is collaborating with Hester Biosciences Limited, a pharmaceutical company based in Ahmedabad, Gujarat, to work on the vaccine … [+3052 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Max Nisen", "title": "What a second wave of Covid-19 could look like - ThePrint", "description": "One model of Covid-19’s future transmission dynamics suggests the size of outbreaks will vary drastically depending on seasonality and duration of people’s immunity.", "url": "https://theprint.in/health/what-a-second-wave-of-covid-19-could-look-like/411712/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/Test-.jpg", "publishedAt": "2020-04-30T06:43:59Z", "content": "The world is beginning to loosen restrictions that have been put in place to limit the spread of Covid-19. Leaders of countries, states and cities are finding they have little choice but to return to economic activity well before an effective vaccine or treat… [+6044 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "David Gilbert", "title": "Chinese Scientists Find Evidence Coronavirus Can Float in the Air for Hours - VICE", "description": "The research also suggests that virus droplets that have landed on the surface of nurses' PPE could be knocked back into the air.", "url": "https://www.vice.com/en_in/article/akw534/chinese-scientists-find-evidence-coronavirus-can-float-in-the-air-for-hours", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5ea94cabc9d46200989e6959/lede/1588158670727-AP_20057262537937.jpeg?crop=1xw:0.8426xh;0xw,0.1295xh&resize=1200:*", "publishedAt": "2020-04-30T05:22:00Z", "content": "This article originally appeared on VICE US.\r\nResearchers in China who examined how the coronavirus spread through two Wuhan hospitals at the height of the outbreak there have found evidence that it can be transmitted through the air.\r\nThe research was publis… [+3517 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "TV Padma", "title": "Loss of biodiversity increases risk of infectious diseases - Quartz India", "description": "Interconnected.", "url": "https://qz.com/india/1848480/loss-of-biodiversity-increases-risk-of-infectious-diseases/", "urlToImage": "https://cms.qz.com/wp-content/uploads/2020/04/2020-04-08T112412Z_1893006184_RC2B0G9HJMRG_RTRMADP_3_CLIMATE-CHANGE-BIODIVERSITY-e1588215258657.jpg?quality=75&strip=all&w=1400", "publishedAt": "2020-04-30T04:57:12Z", "content": "Do biodiversity losses aggravate transmission of infectious diseases spread by animals to humans? The jury is still out but several scientists say there is a biodiversity dilution effect in which declining biodiversity results in increased infectious-disease … [+8120 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Lifestyle Desk", "title": "Childhood trauma, abuse increases risk of cardiovascular disease in middle age: Study - The Indian Express", "description": "Researchers found that people exposed to higher levels of childhood family environment adversity were more than 50 per cent likely to have a cardiovascular disease such as heart attack or stroke.", "url": "https://indianexpress.com/article/lifestyle/health/childhood-trauma-abuse-increases-risk-of-cardiovascular-disease-in-middle-age-study-6385092/", "urlToImage": "https://images.indianexpress.com/2020/04/trauma1.jpg?w=759", "publishedAt": "2020-04-30T04:44:01Z", "content": "By: Lifestyle Desk | New Delhi | \r\nPublished: April 30, 2020 10:00:27 am\r\nChildren experiencing such adversity were predisposed to higher rates of lifelong stress, smoking, anxiety, depression and a sedentary lifestyle that persisted in adulthood. (Source: Ge… [+2441 chars]"}, {"source": {"id": null, "name": "Indiaeducationdiary.in"}, "author": null, "title": "Stanford teams with UCSF, Chan Zuckerberg Biohub to study prevalence of COVID-19 in San Francisco Bay Area - India Education Diary", "description": "A large-scale research collaboration between Stanford University, the University of California, San Francisco (UCSF) and the Chan Zuckerberg Biohub (CZ Biohub) aims to better understand the spread …", "url": "https://indiaeducationdiary.in/stanford-teams-with-ucsf-chan-zuckerberg-biohub-to-study-prevalence-of-covid-19-in-san-francisco-bay-area/", "urlToImage": "https://s0.wp.com/i/blank.jpg", "publishedAt": "2020-04-30T03:45:27Z", "content": "A large-scale research collaboration between Stanford University, the University of California, San Francisco (UCSF) and the Chan Zuckerberg Biohub (CZ Biohub) aims to better understand the spread of COVID-19 across the San Francisco Bay Area. The Chan Zucker… [+6364 chars]"}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "Omjasvin MD", "title": "Antibody testing: A way forward to identify herd immunity ratio, feel experts - The New Indian Express", "description": "Experts say the intermediate process can help identify antibodies until a vaccine is found", "url": "https://www.newindianexpress.com/cities/chennai/2020/apr/30/antibody-testing-a-way-forward-to-identify-herd-immunity-ratio-feel-experts-2137240.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2020/4/28/w600X390/covid-19_testing-_EPS.jpg", "publishedAt": "2020-04-30T01:22:00Z", "content": "CHENNAI: Even as the worry over COVID-19 looms large over our heads, the State and the country is nearing the end of phase 2 of the lockdown. Experts believe that antibody testing is one of the ways to move forward and identify the herd immunity ratio, at lea… [+1750 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: Experimental drug Remdesivir 'can block' COVID-19 | Nine News Australia - 9 News Australia", "description": "The White House says they are cautiously optimistic after recent trials of Ebola drug Remdesivir on COVID-19 patients around the world, it lowered the death ...", "url": "https://www.youtube.com/watch?v=7HGjftqnbzM", "urlToImage": "https://i.ytimg.com/vi/7HGjftqnbzM/maxresdefault.jpg", "publishedAt": "2020-04-29T22:28:53Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "#7Health - New coronavirus symptoms - Dr. Cedrek McFadden on Carolina's Family at 4 - WSPA 7News", "description": "Our 7 News medical expert, Dr. Cedrek McFadden, discusses some new symptoms the CDC has added to the list of Coronavirus symptoms, to consider when deciding ...", "url": "https://www.youtube.com/watch?v=1cwbrhVLF6Q", "urlToImage": "https://i.ytimg.com/vi/1cwbrhVLF6Q/maxresdefault.jpg", "publishedAt": "2020-04-29T21:29:30Z", "content": null}]}