{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "India TV News"}, "author": "India TV News Desk", "title": "AstraZeneca COVID-19 vaccine candidate likely to provide protection against disease for 1 year - India TV News", "description": "After admitting that the world may have a Covid-19 vaccine within one year or even a few months earlier, the World Health Organization (WHO) on Friday said that UK-based AstraZeneca is leading the vaccine race while US-based pharmaceutical major Moderan is no…", "url": "https://www.indiatvnews.com/news/world/covid-19-vaccine-astrazeneca-protection-for-one-year-coronavirus-vaccine-availability-629541", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/06/maharashtra-coronavirus-latest-news-1593182488.jpg", "publishedAt": "2020-06-27T02:26:37Z", "content": "Image Source : PTIAstraZeneca COVID-19 vaccine candidate likely to provide protection against disease for 1 year\r\nAfter admitting that the world may have a Covid-19 vaccine within one year or even a … [+1207 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "US health body adds pregnancy to risk list - Times of India", "description": "US News: NEW YORK: Pregnant women with Covid-19 are at greater risk for being hospitalised and sent to an intensive-care unit than women who aren’t expecting, .", "url": "https://timesofindia.indiatimes.com/world/us/us-health-body-adds-pregnancy-to-risk-list/articleshow/76654899.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-06-27T01:59:15Z", "content": null}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "COVID-19 origin: University of Calgary research shows SARS-CoV-2 may have been evolving slowly since 2013 - Firstpost", "description": "Scientists at the University of Calgary in Canada say that the novel coronavirus (SARS-CoV-2) may have been circulating amongst humans since at least 2013, though not the same variant that is responsible for the COVID-19 pandemic", "url": "https://www.firstpost.com/health/covid-19-origin-university-of-calgary-research-shows-sars-cov-2-may-have-been-evolving-slowly-since-2013-8529141.html", "urlToImage": "https://www.firstpost.com/wp-content/uploads/2020/06/Coronavirus_Fusion-Medical-Animation_640.jpg", "publishedAt": "2020-06-27T01:45:51Z", "content": "COVID-19 showed up late in 2019. Since the virus is new to humans, there has been a lot of speculation about how it came to be.\r\nWhile scientists have been studying the viral genome to find out more … [+4478 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Oura Health smart ring claims to detect COVID-19 - FOX5 Las Vegas", "description": "Oura Health smart ring has data proving it can track early signs of sickness in users. Now they claim ability to tracking early signs of COVID-19.", "url": "https://www.youtube.com/watch?v=Ztda7O8MPrw", "urlToImage": "https://i.ytimg.com/vi/Ztda7O8MPrw/maxresdefault.jpg", "publishedAt": "2020-06-27T00:43:39Z", "content": null}, {"source": {"id": null, "name": "Thenewleam.com"}, "author": null, "title": "New Lancet Study Reveals Children Likely to Have Mild COVID-19 Symptoms - The New Leam", "description": "A Lancet study highlights that COVID-19 causes mild disease in most children, while fatalities are rare.", "url": "https://www.thenewleam.com/2020/06/new-lancet-study-reveals-children-likely-to-have-mild-covid-19-symptoms/", "urlToImage": "https://www.thenewleam.com/wp-content/uploads/2020/06/coronavirus-5088470_1280.jpg", "publishedAt": "2020-06-27T00:41:22Z", "content": "In its latest study, the Lancet Child and Adolescent Health journal has said that most of the children who contract coronavirus tend to suffer only a mild form of the infection and they are quite unl… [+1655 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Hero Nurse Travels From One COVID-19 Hotspot to Another to Help - Inside Edition", "description": "She's a modern-day Florence Nightingale — traveling from state-to-state to treat severely ill COVID-19 patients. In March, nurse Bridgett Harrigan went from ...", "url": "https://www.youtube.com/watch?v=M9OjHyPsQdo", "urlToImage": "https://i.ytimg.com/vi/M9OjHyPsQdo/maxresdefault.jpg", "publishedAt": "2020-06-26T22:36:40Z", "content": "She's a modern-day Florence Nightingale traveling from state-to-state to treat severely ill COVID-19 patients. In March, nurse Bridgett Harrigan went from her home in Texas to Queens, New York, at th… [+290 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "A coronavirus vaccine is still months away, but an antibody treatment could be closer - CNN", "description": "Vaccines have gotten all the attention in the race to fight Covid-19, but there is a major push in the US to develop antibody therapies to treat coronavirus. There's so much of a push that some scientists think these treatments may be available this year, eve…", "url": "https://www.cnn.com/2020/06/26/health/antibody-therapies-covid-19-update-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200605161508-03-regeneron-manufacturing-antibody-super-tease.jpg", "publishedAt": "2020-06-26T21:34:03Z", "content": "(CNN)Vaccines have gotten all the attention in the race to fight Covid-19, but there is a major push in the United States to develop antibody therapies to treat coronavirus. There's so much of a push… [+6810 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Military prepares for National PTSD Awareness Day - 13News Now", "description": "Veterans are encouraged to contact their local VA medical center if they experience any symptoms of PTSD. It's not weak to seek help.", "url": "https://www.youtube.com/watch?v=zlhpg-BR7nE", "urlToImage": "https://i.ytimg.com/vi/zlhpg-BR7nE/maxresdefault.jpg", "publishedAt": "2020-06-26T20:21:07Z", "content": null}, {"source": {"id": null, "name": "Express"}, "author": "Emily Hodgkin", "title": "Weight loss: Apple cider vinegar - how much to take to shed belly fat - Express", "description": "APPLE cider vinegar is used by many as a weight loss tool. Various studies have show the positive effect the liquid can have for those looking to slim.", "url": "https://www.express.co.uk/life-style/diets/1301638/apple-cider-vinegar-how-much-to-take", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/126/750x445/1301638.jpg", "publishedAt": "2020-06-26T19:29:00Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "East Congo Ebola outbreak no longer an international emergency, says WHO - Reuters India", "description": "The World Health Organization said on Friday that the Ebola outbreak in eastern Democratic Republic of Congo that was declared over on Thursday no longer constitutes an international public health emergency.", "url": "https://in.reuters.com/article/us-health-ebola-congo-idINKBN23X2L5", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200626&t=2&i=1523777773&w=1200&r=LYNXMPEG5P1P5", "publishedAt": "2020-06-26T18:09:00Z", "content": "DAKAR (Reuters) - The World Health Organization said on Friday that the Ebola outbreak in eastern Democratic Republic of Congo that was declared over on Thursday no longer constitutes an internationa… [+329 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "-", "title": "Infectious Diseases Society of America Adds Steroids to Covid-19 Treatment Guidelines - News18", "description": "The IDSA late on Thursday said its change was based on recent data from a United Kingdom study showing that a low-cost and widely used steroid called dexamethasone reduced death rates by around a third among the most severely ill hospitalized COVID-19 patient…", "url": "https://www.news18.com/news/world/infectious-diseases-society-of-america-adds-steroids-to-covid-19-treatment-guidelines-2689329.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/06/1592408169_2020-06-17t024009z_1_lynxmpeg5g05h_rtroptp_4_health-coronavirus-steroid.jpg", "publishedAt": "2020-06-26T17:59:13Z", "content": "The Infectious Diseases Society of America (IDSA) has updated its treatment guidelines to include generic steroid pills for patients hospitalized with severe COVID-19, the disease caused by the new c… [+1935 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "Xinhua", "title": "COVID-19 cases in U.S. may be 10 times higher than reported, says CDC chief - Free Press Journal", "description": null, "url": "https://www.freepressjournal.in/world/covid-19-cases-in-us-may-be-10-times-higher-than-reported-says-cdc-chief", "urlToImage": "https://images.assettype.com/freepressjournal%2F2020-06%2F6d4262c7-9075-444e-9c7c-cd0bda87d992%2F139168979_15931726488241n.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-06-26T17:54:05Z", "content": "WASHINGTON: The number of people in the United States who have been infected with the coronavirus is likely to be 10 times as high as the 2.4 million confirmed cases, the chief of the U.S. Centers fo… [+1318 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "Covid-19 survivors should volunteer as counsellors, say Telangana govt, doctors - The Indian Express", "description": "Infectious diseases specialists in Hyderabad are saying it was now time for persons who have recovered from Covid-19 to volunteer their services at hospitals where staff and patient care providers are overwhelmed due to the rising number of infected persons.", "url": "https://indianexpress.com/article/india/covid-19-telangana-volunteer-6477494/", "urlToImage": "https://images.indianexpress.com/2020/06/Coronavirus-11.jpg?w=759", "publishedAt": "2020-06-26T16:15:55Z", "content": "As of June 24, a total of 4,321 people have recovered from the novel coronavirus and discharged in the state. (Express photo: Gajendra Yadav)Telangana government is considering requesting Covid-19 su… [+3952 chars]"}, {"source": {"id": null, "name": "India New England"}, "author": null, "title": "Scientists decode why people can't recall familiar names at times - India New England", "description": "New York– Most of us know that feeling of trying to retrieve a memory that does not come right away and neuroscientists have now identified different sets of individual neurons which help us retrieve memories when required, a hallmark of the human brain’s fle…", "url": "https://indianewengland.com/2020/06/scientists-decode-why-people-cant-recall-familiar-names-at-times/", "urlToImage": "https://indianewengland.com/wp-content/uploads/2018/06/Brain-iStock.jpg", "publishedAt": "2020-06-26T15:46:00Z", "content": "New York– Most of us know that feeling of trying to retrieve a memory that does not come right away and neuroscientists have now identified different sets of individual neurons which help us retrieve… [+3178 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Anna Medaris Miller", "title": "Thousands of people returned to gyms in Norway, and no one got infected with the coronavirus - Business Insider India", "description": "Norway reopened five gyms in Oslo in May, allowing half of its members to return while following certain protocols. Scientists tracked the experiment. According", "url": "https://www.businessinsider.in/science/health/news/thousands-of-people-returned-to-gyms-in-norway-and-no-one-got-infected/articleshow/76649278.cms", "urlToImage": "https://www.businessinsider.in/photo/76649278/thousands-of-people-returned-to-gyms-in-norway-and-no-one-got-infected.jpg?imgsize=188137", "publishedAt": "2020-06-26T15:26:00Z", "content": "As gyms around the world continue to welcome back members, five gyms in Norway that reopened May 22 are shedding a light on how it may be done safely. \r\nThe gyms were a part of an experiment in which… [+3221 chars]"}, {"source": {"id": null, "name": "Los Angeles Times"}, "author": "Melissa Healy", "title": "The coronavirus is even more sinister than we suspected - Los Angeles Times", "description": "Cells hijacked by the coronavirus grow long, streaming tentacles to reach out to new victims, scientists found. This could complicate the search for a vaccine.", "url": "https://www.latimes.com/science/story/2020-06-26/inside-the-body-the-coronavirus-is-even-more-sinister-than-scientists-had-realized", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/076e246/2147483647/strip/true/crop/2560x1344+0+288/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F8d%2F8c%2F6f1763604c40b9f46fddbbcdce5e%2Fverocells-48hncov-i011.JPG", "publishedAt": "2020-06-26T15:02:21Z", "content": "The new coronavirus reputation for messing with scientists assumptions has taken a truly creepy turn.\r\nResearchers exploring the interaction between the coronavirus and its hosts have discovered that… [+5024 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sedentary Lifestyle Is More Harmful Than You Think: Here's How - NDTV", "description": "Sedentary lifestyle: According to WHO, sedentary lifestyles increase all causes of mortality, double the risk of cardiovascular diseases, diabetes, and obesity, and increase the risks of colon cancer, high blood pressure and more serious health conditions.", "url": "https://www.ndtv.com/health/sedentary-lifestyle-is-more-harmful-than-you-think-heres-how-2252885", "urlToImage": "https://c.ndtvimg.com/2019-05/51he1nv_obesity_625x300_21_May_19.jpg", "publishedAt": "2020-06-26T14:55:23Z", "content": "Sedentary lifestyle can increase the risk of several chronic diseases\r\nHighlights\r\n<ul><li>Sedentary lifestyle can increase the risk of heart disease\r\n</li><li>Eat a balanced diet and move more throu… [+3677 chars]"}, {"source": {"id": null, "name": "http://www.newsgram.com/"}, "author": null, "title": "Covid-19 Patients Show Changes in Behaviour, Other Brain Issues - http://www.newsgram.com/", "description": "Researchers have found that some hospitalised Covid-19 patients show signs of confusion, changes in behaviour and other brain complications,", "url": "https://www.newsgram.com/covid-19-patients-changes-behaviour-brain-issues/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2020/06/confused-2681507_19201.jpg", "publishedAt": "2020-06-26T14:28:58Z", "content": "Researchers have found that some hospitalised Covid-19 patients show signs of confusion, changes in behaviour and other brain complications, including stroke, psychosis and dementia-like syndrome.\r\nC… [+3008 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Astrazeneca, Moderna most advanced in COVID-19 vaccine race - WHO - Reuters", "description": "AstraZeneca's experimental COVID-19 vaccine is probably the world's leading candidate and most advanced in terms of development, the World Health Organization's (WHO) chief scientist said on Friday.", "url": "https://in.reuters.com/article/health-coronavirus-who-development-idINKBN23X1X4", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200626&t=2&i=1523746398&w=1200&r=LYNXMPEG5P1A2", "publishedAt": "2020-06-26T13:39:00Z", "content": "GENEVA (Reuters) - AstraZeneca’s experimental COVID-19 vaccine is probably the world’s leading candidate and most advanced in terms of development, the World Health Organization’s (WHO) chief scienti… [+2062 chars]"}, {"source": {"id": null, "name": "SpotboyE"}, "author": "Akriti Anand", "title": "Monsoon Diet Tips: Add These 5 Herbs And Spices To Your Diet To Boost Immunity In This Rainy weather - SpotboyE", "description": "Rich with anti-inflammatory, anti-aging properties, turmeric is very good to include in your Monsoon diet.", "url": "https://www.spotboye.com/lifestyle/lifestyle-news/monsoon-diet-tips-add-these-5-herbs-and-spices-to-your-diet-to-boost-immunity-in-this-rainy-weather/5ef5e3a4dfb8c4229f9b35cf", "urlToImage": "https://static.spotboye.com/uploads/rukusdiary_90356423_146177430202538_7201586552880624021_n_2020-6-26-12-1-40_thumbnail.jpg", "publishedAt": "2020-06-26T12:03:02Z", "content": "Up NextArjun Kapoor's Birthday Celebration Decoration Was Carefully Sanitised Amid COVID-19 Scare Under Sister Anshula Kapoor Orders"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Timing of antibody testing is critical for accurate COVID-19 detection - News-Medical.Net", "description": "Scientists have analysed data from around the world to examine the accuracy of antibody tests for COVID-19, and have shown that the timing of testing is critical. The tests do not work accurately when administered at the wrong time.", "url": "https://www.news-medical.net/news/20200626/Timing-of-antibody-testing-is-critical-for-accurate-COVID-19-detection.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2020%2f6%2fCoronavirus-red-720_-_Copy_7f7a6d8dea4e44dfbd884f90457e24c0-620x480.jpg", "publishedAt": "2020-06-26T11:58:31Z", "content": "Scientists have analysed data from around the world to examine the accuracy of antibody tests for COVID-19, and have shown that the timing of testing is critical. The tests do not work accurately whe… [+5305 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "As world approaches 10 million coronavirus cases, doctors see hope in new treatments, lessons learned - Moneycontrol", "description": "Doctors say they've learned enough about the highly contagious virus to solve some key problems for many patients. The changes could be translating into more saved lives, although there is little conclusive data.", "url": "https://www.moneycontrol.com/news/trends/health-trends/as-world-approaches-10-million-coronavirus-cases-doctors-see-hope-in-new-treatments-lessons-learned-5464021.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/06/corona2_june26-770x433.jpg", "publishedAt": "2020-06-26T11:58:18Z", "content": "Dr. Gopi Patel recalls how powerless she felt when New York's Mount Sinai Hospital overflowed with COVID-19 patients in March. Guidance on how to treat the disease was scant, and medical studies were… [+17013 chars]"}, {"source": {"id": null, "name": "Orissapost.com"}, "author": "Post News Network", "title": "Six potential drug targets for COVID-19 identified by researchers - OrissaPOST", "description": "London: By profiling the immune response to the novel coronavirus in critically ill COVID-19 patients, scientists have identified a unique pattern of six molecules which could be used as therapeutic targets for the disease. The researchers from the Lawson Hea…", "url": "https://www.orissapost.com/six-potential-drug-targets-for-covid-19-identified-by-researchers/", "urlToImage": "https://www.orissapost.com/wp-content/uploads/2020/05/Vaccine_1713a4d9e61_medium.jpg", "publishedAt": "2020-06-26T11:50:00Z", "content": "London: By profiling the immune response to the novel coronavirus in critically ill COVID-19 patients, scientists have identified a unique pattern of six molecules which could be used as therapeutic … [+2756 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Nick Brown", "title": "Special Report: As world approaches 10 million coronavirus cases, doctors see hope in new treatments - Reuters India", "description": "Dr. Gopi Patel recalls how powerless she felt when New York's Mount Sinai Hospital overflowed with COVID-19 patients in March.", "url": "https://in.reuters.com/article/us-health-coronavirus-lessons-special-re-idINKBN23X1I5", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200626&t=2&i=1523728814&w=1200&r=LYNXMPEG5P0Y6", "publishedAt": "2020-06-26T11:48:34Z", "content": "(Reuters) - Dr. Gopi Patel recalls how powerless she felt when New York’s Mount Sinai Hospital overflowed with COVID-19 patients in March. \r\nGuidance on how to treat the disease was scant, and medica… [+17310 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Scientists begin to understand the many health problems caused by COVID-19 - CGTN", "description": "", "url": "https://news.cgtn.com/news/2020-06-26/Scientists-begin-to-understand-the-health-problems-caused-by-COVID-19-RDMIeKikpi/index.html", "urlToImage": "https://news.cgtn.com/news/2020-06-26/Scientists-begin-to-understand-the-health-problems-caused-by-COVID-19-RDMIeKikpi/img/c0fa2daa985d479b813a702d79847e16/c0fa2daa985d479b813a702d79847e16-250.png", "publishedAt": "2020-06-26T11:42:36Z", "content": "Scientists are only starting to grasp the vast array of health problems caused by the novel coronavirus, some of which may have lingering effects on patients and health systems for years to come, acc… [+4039 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "Tribune India", "title": "Chandigarh: Seven-month-old baby boy, woman test COVID-19 positive; count reaches 425 - The Tribune India", "description": "21 contacts of a Sector-22 positive case have been home-quarantined", "url": "https://www.tribuneindia.com/news/chandigarh/seven-month-old-baby-boy-tests-covid-19-positive-city-count-reaches-424-104839", "urlToImage": "https://cmsimages.tribuneindia.com/gallary_content/2020/6/2020_6$largeimg_6301835.JPG", "publishedAt": "2020-06-26T11:38:02Z", "content": "The Tribune, now published from Chandigarh, started publication on February 2, 1881, in Lahore (now in Pakistan). It was started by Sardar Dyal Singh Majithia, a public-spirited philanthropist, and i… [+465 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Simrin Sirur", "title": "Delhi girl gets liver from recovered Covid-positive sister in ‘first-of-its-kind’ transplant - ThePrint", "description": "Both the recipient and the donor are recuperating at the Max Super Speciality Hospital after surgery on 20 May, doctors rule out possibility of future complications.", "url": "https://theprint.in/health/delhi-girl-gets-liver-from-recovered-covid-positive-sister-in-first-of-its-kind-transplant/449099/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/05/Max-Hospital.jpg", "publishedAt": "2020-06-26T11:30:23Z", "content": "New Delhi: A 13-year-old girl underwent a successful liver transplant last month at a Delhi hospital, receiving a portion of the vital organ from her sister. What makes her case different from any ot… [+4849 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "'The epidemic is growing very rapidly': Indian government adviser fears coronavirus crisis will worsen - Nature.com", "description": "Jayaprakash Muliyil says coronavirus infections are rising rapidly in the country, and the surprisingly low death rate could be misleading.", "url": "https://www.nature.com/articles/d41586-020-01865-w", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-020-01865-w/d41586-020-01865-w_18110950.jpg", "publishedAt": "2020-06-26T11:25:56Z", "content": "Temperature screening in Mumbai, India, during the COVID-19 pandemic.Credit: Satish Bate/Hindustan Times via Getty\r\nIndia has confirmed more than 450,000 cases of COVID-19 so far, making it the world… [+7515 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Asian News International | Posted by: Alfea Jamal", "title": "Coronavirus pandemic: Post-Covid-19 diseases emerging in children - Hindustan Times", "description": "In recent weeks, a multisystem hyperinflammatory condition has emerged in children in association with prior exposure or infection to SARS-CoV-2.", "url": "https://www.hindustantimes.com/health/new-study-looks-at-post-covid-19-emerging-disease-in-children/story-sVxCut55rH5m5jNdHsspwK.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/06/26/Pictures/going-wider-image-covid-amazon-people-races_9dc3d326-b79c-11ea-b212-8f8a0313eef6.jpg", "publishedAt": "2020-06-26T11:04:00Z", "content": "In recent weeks, a multisystem hyperinflammatory condition has emerged in children in association with prior exposure or infection to SARS-CoV-2. A new case series published in the journal Radiology … [+3764 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Beware of These Common Food Additive in Desserts or be Ready For Long-Term Health Damage - India.com", "description": "Food additives may make your dessert look presentable and increase its shelf life but can impact your health in a huge way. Read further to know how.", "url": "https://www.india.com/lifestyle/beware-of-these-common-food-additive-in-desserts-or-be-ready-for-long-term-health-damage-4068238/", "urlToImage": "https://www.india.com/wp-content/uploads/2020/06/Food-additives.jpg", "publishedAt": "2020-06-26T10:50:42Z", "content": "Next time when you hop on desserts, candy, beverages or gum, read on. Researchers have found that a common food additive significantly alters gut microbiota in mice, causing inflammation in the colon… [+2614 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Scientists just beginning to understand the many health problems caused by COVID-19 - Moneycontrol", "description": "Besides the respiratory issues that leave patients gasping for breath, the virus that causes COVID-19 attacks many organ systems, in some cases causing catastrophic damage.", "url": "https://www.moneycontrol.com/news/trends/health-trends/scientists-just-beginning-to-understand-the-many-health-problems-caused-by-covid-19-5463631.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/06/Corona_june26-770x433.jpg", "publishedAt": "2020-06-26T10:38:29Z", "content": "Scientists are only starting to grasp the vast array of health problems caused by the novel coronavirus, some of which may have lingering effects on patients and health systems for years to come, acc… [+4081 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Reuters | Posted by Saumya Sharma", "title": "Covid-19: Austrian ski resort has record rate of coronavirus antibodies - Hindustan Times", "description": "Despite the Ischgl outbreak, Austria has one of western Europe’s lowest infection rates. It introduced a national lockdown in mid-March, which flattened its curve of infections, and it started loosening that lockdown a month later.", "url": "https://www.hindustantimes.com/health/covid-19-austrian-ski-resort-has-record-rate-of-coronavirus-antibodies/story-BLfjjxVpOsVA9F8wEt4qzI.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/06/26/Pictures/_875c1724-b788-11ea-bb4b-1e210f9e7edf.jpg", "publishedAt": "2020-06-26T08:40:00Z", "content": "A study of residents in the Alpine ski resort of Ischgl, the site of Austria’s biggest coronavirus outbreak, has found 42% have antibodies for the virus, the highest rate ever proven, the university … [+1971 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "TWC India Edit Team", "title": "Fever, Cough the Most Common Signs of COVID-19 Infection Worldwide: Study - The Weather Channel", "description": "To identify the most common symptoms of the disease, researchers examined data from about 148 different COVID-19 research studies.", "url": "https://weather.com/en-IN/india/coronavirus/news/2020-06-26-fever-cough-most-common-signs-covid-19-infection-worldwide", "urlToImage": "https://s.w-x.co/in-thermalcheck.jpg", "publishedAt": "2020-06-26T08:32:10Z", "content": "(K.K. Choudhary/TOI, Mumbai /BCCL)\r\nPersistent cough and fever have been classified as the two most prevalent symptoms of COVID-19, according to a new study. Other prevalent major symptoms of the nov… [+2168 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Yuvraj Malik", "title": "World Coronavirus Dispatch: LatAm deaths may hit 388,000 by Oct, says study - Business Standard", "description": "UK's Royal Mail to axe 2,000 jobs, Saudi may see a U-shaped recovery, Germany's infection rate slowest in three months and other pandemic related news across the globe", "url": "https://www.business-standard.com/article/international/world-coronavirus-dispatch-latam-deaths-may-hit-388-000-by-oct-says-study-120062600749_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-06/22/full/1592770907-4656.jpg", "publishedAt": "2020-06-26T08:30:26Z", "content": "The death toll from the coronavirus in Latin America is expected to skyrocket to 388,300 by October, with Brazil and Mexico seen accounting for two-thirds of fatalities as other nations in the region… [+4375 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Press Trust of India| Posted by: Alfea Jamal", "title": "Coronavirus: Six potential drug targets for Covid-19 identified - Hindustan Times", "description": "By profiling the immune response to the novel coronavirus in critically ill COVID-19 patients, scientists have identified a unique pattern of six molecules which could be used as therapeutic targets for the disease.", "url": "https://www.hindustantimes.com/health/coronavirus-six-potential-drug-targets-for-covid-19-identified/story-Qx0VYPr5UTKBdbAqqyrO1H.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/06/26/Pictures/the-spread-tokyo-the-coronavirus-disease-covid_6aef452c-b786-11ea-b212-8f8a0313eef6.jpg", "publishedAt": "2020-06-26T08:26:00Z", "content": "By profiling the immune response to the novel coronavirus in critically ill COVID-19 patients, scientists have identified a unique pattern of six molecules which could be used as therapeutic targets … [+2921 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Press Trust of India", "title": "Scientists identify six potential drug targets for Covid-19 - Business Standard", "description": "By profiling the immune response to novel coronavirus in critically ill patients, scientists have identified a unique pattern of six molecules that could be used as therapeutic targets for Covid-19", "url": "https://www.business-standard.com/article/current-affairs/scientists-identify-six-potential-drug-targets-for-covid-19-120062600353_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-06/23/full/1592860353-6846.jpg", "publishedAt": "2020-06-26T07:31:59Z", "content": "By profiling the immune response to the novel coronavirus in critically ill COVID-19 patients, scientists have identified a unique pattern of six molecules which could be used as therapeutic targets … [+2915 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Asian News International | Posted by: Alfea Jamal", "title": "Coronavirus: Children and youth’s mental, physical health negatively affected by Covid-19 - Hindustan Times", "description": "Other effects can be widespread delays or omissions of routine childhood vaccinations, which can threaten herd immunity and missed detection of delayed development milestones that are usually identified during routine child health checks.", "url": "https://www.hindustantimes.com/more-lifestyle/coronavirus-children-and-youth-s-mental-physical-health-negatively-affected-by-covid-19/story-AqRU3fyMoKytpzfxYHszZN.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/06/26/Pictures/outbreak-santiago-the-coronavirus-disease-covid-19_351a1c3c-b77d-11ea-b212-8f8a0313eef6.jpg", "publishedAt": "2020-06-26T07:19:00Z", "content": "Toronto [Canada], June 25 (ANI): Despite reports that children and young people may be less likely to get infected with COVID-19 than older adults, there may be substantial indirect adverse effects o… [+3778 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "PTI", "title": "6 potential drug targets for COVID-19 identified, say scientists - India TV News", "description": "Based on the analysis, published in the journal Critical Care Explorations, the scientists found top six molecules in the blood of COVID-19 positive patients in the intensive care unit (ICU), which distinguished them from those without the disease.", "url": "https://www.indiatvnews.com/science/covid-19-treatment-cytokine-storm-coronavirus-potential-drugs-molecules-scientists-629342", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/06/coronavirus-drugs-1591600930.jpg", "publishedAt": "2020-06-26T07:01:27Z", "content": "Image Source : GOOGLEScientists identify six potential drug targets for COVID-19\r\nBy profiling the immune response to the novel coronavirus in critically ill COVID-19 patients, scientists have identi… [+2900 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "PTI", "title": "Scientists identify 6 potential drug targets for Covid-19 - Deccan Herald", "description": "By profiling the immune response to the novel coronavirus in critically-ill Covid-19 patients, scientists have identified a unique pattern of six molecules which could be used as therapeutic targets for the disease. The researchers from the Lawson Health Rese…", "url": "https://www.deccanherald.com/science-and-environment/scientists-identify-6-potential-drug-targets-for-covid-19-853914.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2020/06/26/Coronavirus-1593154269.jpg", "publishedAt": "2020-06-26T06:51:09Z", "content": "By profiling the immune response to the novel coronavirus in critically-ill Covid-19 patients, scientists have identified a unique pattern of six molecules which could be used as therapeutic targets … [+2801 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "International travellers refusing a third of COVID-19 tests in Vic - Sky News Australia", "description": "Up to 30 per cent of international travellers are refusing opt-in COVID-19 tests in Victoria as part of their mandatory two-week quarantine – prompting scrut...", "url": "https://www.youtube.com/watch?v=eiFjtiSN_NA", "urlToImage": "https://i.ytimg.com/vi/eiFjtiSN_NA/maxresdefault.jpg", "publishedAt": "2020-06-26T06:31:16Z", "content": "Up to 30 per cent of international travellers are refusing opt-in COVID-19 tests in Victoria as part of their mandatory two-week quarantine prompting scrutiny of the states trouble-plagued hotel stra… [+466 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Anushree Gupta", "title": "SARS-CoV-2 has been evolving for more than 7 years, researchers claim - Times Now", "description": "While most microbes are restricted in terms of the species they are able to affect or infect, the SARS-CoV-2 virus, just like its close cousins SARS and MERS coronaviruses, has crossed over to humans.", "url": "https://www.timesnownews.com/health/article/sars-cov-2-has-been-evolving-for-more-than-7-years-researchers-claim/612241", "urlToImage": "https://imgk.timesnownews.com/story/coronavirus_reuters_34.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-06-26T06:30:31Z", "content": "<ul><li>Ever since the novel coronavirus was discovered, new information about the virus has been coming in</li></ul>\r\n<ul><li>This information helps scientists and researchers to understand the viru… [+3311 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Anushree Gupta", "title": "BP issues more common even among youth: 5 foods you must avoid to keep your heart healthy - Times Now", "description": "The food we eat and the drinks we consume have a direct effect on our body, especially vital organs such as the heart. Here are 5 foods you must avoid if you are trying to keep your blood pressure stable.", "url": "https://www.timesnownews.com/health/article/bp-issues-more-common-even-among-youth-5-foods-you-must-avoid-to-keep-your-heart-healthy/612127", "urlToImage": "https://imgk.timesnownews.com/story/iStock-898305914.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-06-26T04:47:58Z", "content": "<ul><li>Our diet has a direct impact on our heart and other vital organs </li></ul>\r\n<ul><li> Foods rich in salt can lead to high BP, which can damage the heart </li></ul>\r\n<ul><li>Here are 5 foods y… [+3101 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mohali admin to start criminal proceedings against people jumping home quarantine - The Indian Express", "description": "Seven more positive Covid-19 cases take total number to 236.", "url": "https://indianexpress.com/article/cities/chandigarh/mohali-admin-to-start-criminal-proceedings-against-people-jumping-home-quarantine-6476949/", "urlToImage": "https://images.indianexpress.com/2020/06/coronavirus-13.jpg?w=759", "publishedAt": "2020-06-26T04:31:29Z", "content": "Seven more positive Covid-19 cases take total number to 236.Following a spike in COVID-19 cases in the district this month, Mohali district administration has decided to initiate criminal proceedings… [+2209 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New study explores post-COVID-19 inflammatory condition in children - News-Medical.Net", "description": "In recent weeks, a multisystem hyperinflammatory condition has emerged in children in association with prior exposure or infection to SARS-CoV-2.", "url": "https://www.news-medical.net/news/20200625/New-study-explores-post-COVID-19-inflammatory-condition-in-children.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2016%2f3%2fChildren_playing_sunset_-_Zurijeta_8c5bdac77e44431bb1bfec67b9c87208-620x480.jpg", "publishedAt": "2020-06-26T02:49:54Z", "content": "Reviewed by Emily Henderson, B.Sc.Jun 25 2020\r\nIn recent weeks, a multisystem hyperinflammatory condition has emerged in children in association with prior exposure or infection to SARS-CoV-2. A new … [+3561 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "International New York Times", "title": "What’s really behind the gender gap in Covid-19 deaths? - Deccan Herald", "description": "More men than women are dying of Covid-19. The numbers are striking. In Italy, men in their 50s died at four times the rate of women in their 50s. Globally, twice as many men than women may be dying of Covid-19.", "url": "https://www.deccanherald.com/science-and-environment/what-s-really-behind-the-gender-gap-in-covid-19-deaths-853848.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2020/06/26/china-1593139566.jpg", "publishedAt": "2020-06-26T02:46:06Z", "content": "More men than women are dying of Covid-19. The numbers are striking. In Italy, men in their 50s died at four times the rate of women in their 50s. Globally, twice as many men than women may be dying … [+7274 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Indrani Bagchi", "title": "‘India to have say in Covid vaccine distribution’ - Times of India", "description": "India News: Interestingly, while India has a presence in most of the international vaccine development programmes, it has no presence in the two Chinese vaccine p", "url": "https://timesofindia.indiatimes.com/india/india-to-have-say-in-covid-vaccine-distribution/articleshow/76634738.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-76634737,width-1070,height-580,imgsize-664712,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-06-26T02:19:57Z", "content": "India to have say in Covid vaccine distribution"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "States halt reopening, impose new pandemic orders | Reuters Video - Reuters India", "description": "[NFA] Texas Governor Greg Abbott said on Thursday that he was halting his state's phased economic reopening in response to a jump in COVID-19 infections and hospitalizations, as the number of new daily cases around the country climbed to a near-record high. T…", "url": "https://in.reuters.com/video/watch/idOVCJVJCGV", "urlToImage": "https://static.reuters.com/resources/r/?d=20200625&i=OVCJVJCGV&r=OVCJVJCGV&t=2", "publishedAt": "2020-06-25T19:44:54Z", "content": "Posted \r\n[NFA] Texas Governor Greg Abbott said on Thursday that he was halting his state's phased economic reopening in response to a jump in COVID-19 infections and hospitalizations, as the number o… [+104 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA", "title": "Study links increased exercise with lower sleep apnea risk - DNA India", "description": "A study published online as an accepted paper in the Journal of Clinical Sleep Medicine found that increased physical activity is associated with a lower risk of obstructive sleep apnea, a common sleep-related breathing disorder. The study is the largest to d…", "url": "https://www.dnaindia.com/india/video-study-links-increased-exercise-with-lower-sleep-apnea-risk-2829598", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/2020/06/25/910764-00000003.jpg", "publishedAt": "2020-06-25T18:33:53Z", "content": "©2020 Diligent Media Corporation Ltd."}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "AFP", "title": "Up to 8% of US population has been infected with coronavirus: officials - Deccan Herald", "description": "Between five and eight percent of the total US population has experienced infection with the new coronavirus, a top health body said Thursday as it warned pregnant women were at higher risk of getting severe COVID-19. The estimate for infections by the Center…", "url": "https://www.deccanherald.com/international/up-to-8-of-us-population-has-been-infected-with-coronavirus-officials-853765.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2020/06/25/new%20york%20health%20workers%20afp-1593107856.jpg", "publishedAt": "2020-06-25T17:47:01Z", "content": "Between five and eight percent of the total US population has experienced infection with the new coronavirus, a top health body said Thursday as it warned pregnant women were at higher risk of gettin… [+1962 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Sam Corbishley", "title": "Doctor warns of 'long-term Covid' after suffering symptoms for three months - Metro.co.uk", "description": "Dr Jake Suett has called for a scientific study into whether there may be a potential ‘post-Covid syndrome’.", "url": "https://metro.co.uk/2020/06/25/icu-doctor-warns-long-term-covid-suffering-symptoms-three-months-12903847/", "urlToImage": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2020/06/PRI_150933942_1593104815.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "publishedAt": "2020-06-25T17:29:28Z", "content": "An intensive care doctor has warned of long-term Covid (Picture: Getty Images)\r\nAn intensive care doctor has warned people about the effects of long-term Covid as England prepares to move out of lock… [+3270 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Anna Medaris Miller", "title": "Pregnant women may be more likely to suffer severe coronavirus infections, according to the largest study of i - Business Insider India", "description": "A government analysis has found that pregnant women with COVID-19 are more likely to be hospitalized, admitted to the ICU, and put on ventilators than infected", "url": "https://www.businessinsider.in/science/news/pregnant-women-are-more-likely-to-suffer-severe-coronavirus-infections-according-to-the-largest-study-of-its-kind/articleshow/76631864.cms", "urlToImage": "https://www.businessinsider.in/photo/76631864/pregnant-women-are-more-likely-to-suffer-severe-coronavirus-infections-according-to-the-largest-study-of-its-kind.jpg?imgsize=91523", "publishedAt": "2020-06-25T16:37:00Z", "content": "Pregnant women with COVID-19, the disease the coronavirus causes, are more likely to be hospitalized, admitted to the intensive care unit, and put on ventilators than non-pregnant women with the dise… [+7081 chars]"}, {"source": {"id": null, "name": "FiercePharma"}, "author": null, "title": "I-O blockbusters from Merck, BMS and more linked to poor COVID-19 outcomes: study - FiercePharma", "description": "Cancer patients at Memorial Sloan Kettering who developed COVID-19 faced a higher risk of poor outcomes if they had been treated with checkpoint inhibitors such as Merck's Keytruda, according to a new study.", "url": "https://www.fiercepharma.com/pharma/i-o-blockbusters-from-merck-bms-and-more-linked-to-poor-covid-19-outcomes-study", "urlToImage": "https://qtxasset.com/fiercepharma/1593101030/coronavirus%20from%20nih.jpg/coronavirus%20from%20nih.jpg?PTZLYFsnsSYihxraDfGfUyKKpUctH0tl", "publishedAt": "2020-06-25T15:30:00Z", "content": "In the month ending April 7, 423 cancer patients at Memorial Sloan Kettering Cancer Center were diagnosed with COVID-19, 20% of whom developed serious respiratory symptoms. That in and of itself wasn… [+4206 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "Share Bed With Your Spouse For Quality Sleep, Super Memory - India.com", "description": "Sleeping with a partner can give you an extra boost regarding your mental health, your memory and creative problem-solving skills. Here is how.", "url": "https://www.india.com/lifestyle/share-bed-with-your-spouse-for-quality-sleep-super-memory-4067531/", "urlToImage": "https://www.india.com/wp-content/uploads/2020/06/fbb06450be6504e0d55cd4fa5058a9cc.jpg", "publishedAt": "2020-06-25T13:50:19Z", "content": "Sharing a bed with your spouse, even if there is marital conflict or too much difference of opinion in your life, will not only make your sleep better, deeper and meaningful but also help you solve r… [+2798 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Scientists have zeroed down on most prevalent Covid-19 symptoms & it does not include loss of smell or breathing difficulty - Economic Times", "description": "There is some variation in terms of the prevalence of symptoms between countries.", "url": "https://economictimes.indiatimes.com/magazines/panache/scientists-have-zeroed-down-on-most-prevalent-covid-19-symptoms-it-does-not-include-loss-of-smell-or-breathing-difficulty/articleshow/76622900.cms", "urlToImage": "https://img.etimg.com/thumb/msid-76623125,width-1070,height-580,imgsize-821035,overlay-etpanache/photo.jpg", "publishedAt": "2020-06-25T13:07:46Z", "content": "LONDON; A persistent cough and fever have been confirmed as the most prevalent symptoms of Covid-19, according to a major review of studies which identified fatigue, loss of smell and difficulty in b… [+3903 chars]"}, {"source": {"id": null, "name": "Microbiozindia.com"}, "author": null, "title": "Neuroscientists reveals new insight into systems liable for familial headache - Microbioz India", "description": "Neuroscientists of the University of Zurich shed another light on the instruments answerable for familial headache: They show that a hereditary brokenness in explicit synapses of the cingulate cortex territory firmly impacts head torment event.\r\n\r\nHeadache is…", "url": "https://microbiozindia.com/health-news/neuroscientists-reveals-new-insight-into-systems-liable-for-familial-headache/", "urlToImage": "https://microbiozindia.com/wp-content/uploads/2020/06/SideHeadache-scaled-1.jpg", "publishedAt": "2020-06-25T12:22:49Z", "content": "Neuroscientists of the University of Zurich shed another light on the instruments answerable for familial headache: They show that a hereditary brokenness in explicit synapses of the cingulate cortex… [+3319 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Monsoon Diet Tips: Do Not Miss These 3 Immunity Boosting Kitchen Ingredients This Season - NDTV", "description": "Monsoon diet: Several kitchen ingredients present in your kitchen can help you boost immunity. During monsoon it is essential to maintain a healthy immune system to ward off potential diseases. Here are top 3 kitchen ingredients you should not miss.", "url": "https://www.ndtv.com/health/monsoon-diet-tips-do-not-miss-these-3-immunity-boosting-kitchen-ingredients-this-season-2252180", "urlToImage": "https://c.ndtvimg.com/2020-05/otgmjqig_turmeric-and-ginger_625x300_07_May_20.jpg", "publishedAt": "2020-06-25T12:11:11Z", "content": "Monsoon diet tips: Eat a healthy diet to boost immunity\r\nHighlights\r\n<ul><li>A strong immune system can help fight against diseases\r\n</li><li>Add Vitamin C to your diet for better immunity \r\n</li><li… [+3339 chars]"}, {"source": {"id": null, "name": "Healthissuesindia.com"}, "author": "Kerean Watts", "title": "Critical COVID-19: Bad news for heart health - Hyderus Cyf", "description": "Critical cases of COVID-19, warranting admission to the intensive care unit (ICU), could pose a danger to heart health.   Patients admitted to the ICU with C", "url": "https://www.healthissuesindia.com/2020/06/25/critical-covid-19-bad-news-for-heart-health/", "urlToImage": "https://www.healthissuesindia.com/wp-content/uploads/2017/05/52656668_l.jpg", "publishedAt": "2020-06-25T10:59:57Z", "content": "Image credit: tribalium123 / 123RF\r\nCritical cases of COVID-19, warranting admission to the intensive care unit (ICU), could pose a danger to heart health. \r\nPatients admitted to the ICU with COVID-1… [+3028 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "Who would be the first to get a COVID-19 vaccine? - CNBCTV18", "description": "The World Health Organization is drafting guidelines for the ethical distribution of COVID-19 vaccines.Get latest Healthcare online at cnbctv18.com", "url": "https://www.cnbctv18.com/healthcare/who-would-be-the-first-to-get-a-covid-19-vaccine-6204781.htm/", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2020/06/coronavirus-vaccine-COVID-19-vaccine-768x522.jpg", "publishedAt": "2020-06-25T10:09:24Z", "content": "Who would be the first to get a COVID-19 vaccine?\r\nProbably people in the country where the first effective vaccine is developed.\r\nAbout a dozen different vaccines are in various stages of testing wo… [+1188 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "Devina Buckshee", "title": "‘Flawed Science’: Experts Question Patanjali’s New COVID-19 Drugs - Quint Hindi", "description": "Experts deconstruct the gaps in the science behind Ramdev’s new apparent ‘COVID-19 cure.’", "url": "https://fit.thequint.com/coronavirus/flawed-science-experts-slam-patanjalis-new-covid-19-drugs", "urlToImage": "https://gumlet.assettype.com/thequint-fit%2F2020-06%2F4473009b-2245-4835-9194-9546eec85774%2Fhero_image_2.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-06-25T09:55:09Z", "content": "As the world looks for vaccines and treatments for coronavirus, Baba Ramdevs Patanjali has released a drug that he claims is a coronavirus cure with a 100 per cent recovery rate.\r\nBut after the Union… [+453 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "IANS", "title": "Kids infected with COVID-19 posing 'clinical challenge', suffer anxiety and fear PPE suits, say doctors - Times Now", "description": "According to a doctor in Prayagraj, most children admitted to COVID hospitals experience anxiety, loneliness, distress, and fear. Many of them get petrified seen people move around in PPE suits.", "url": "https://www.timesnownews.com/mirror-now/in-focus/article/kids-infected-with-covid-19-posing-clinical-challenge-suffer-anxiety-and-fear-ppe-suits-say-doctors/611819", "urlToImage": "https://imgk.timesnownews.com/story/child-iStock-1192622961.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-06-25T09:42:59Z", "content": "Lucknow: Children who got infected with the Coronavirus and have been admitted to COVID hospitals, are posing a ''clinical challenge'' to doctors and other health workers. Most of them complain of an… [+2459 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Press Trust of India | Posted by: Alfea Jamal", "title": "Coronavirus: Use of statins linked to lower death rate in Covid-19 patients. Here’s how - Hindustan Times", "description": "Using cholesterol-lowering drugs called statins is associated with a lower death rate in patients hospitalised with COVID-19, according to a large-scale study.", "url": "https://www.hindustantimes.com/health/coronavirus-use-of-statins-linked-to-lower-death-rate-in-covid-19-patients-here-s-how/story-IO7Lao9Owo7ZI22PkSvsYO.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/06/25/Pictures/testing-coronavirus-samples-methodist-disease-medical-center_098f9bd6-b6c0-11ea-9350-67a6fbf842e0.jpg", "publishedAt": "2020-06-25T08:47:00Z", "content": "Using cholesterol-lowering drugs called statins is associated with a lower death rate in patients hospitalised with COVID-19, according to a large-scale study.\r\n The research, published in the journa… [+4652 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "How much should you exercise daily to boost your immunity? - Times of India", "description": "Having a strong immune system is necessary at any point of time to stay safe from disease-causing germs and viruses.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/fitness/how-much-should-you-exercise-daily-to-boost-your-immunity/photostory/76576897.cms", "urlToImage": "https://static.toiimg.com/photo/76577615.cms", "publishedAt": "2020-06-25T08:00:00Z", "content": "Leading a sedentary lifestyle can be a prime reason for various health conditions. Exercising daily keeps your heart healthy, manages the symptoms of type 2 diseases, maintains your healthy weight an… [+511 chars]"}, {"source": {"id": null, "name": "GeekWire"}, "author": "https://www.facebook.com/alan.boyle", "title": "Allen Institute will host $40.5M brain research center to map the effects of Alzheimer’s disease - GeekWire", "description": "A $40.5 million collaborative research center in Seattle aims to create high-resolution maps of brains ravaged by Alzheimer’s disease.", "url": "https://www.geekwire.com/2020/allen-institute-will-host-40-5m-brain-research-center-map-effects-alzheimers-disease/", "urlToImage": "https://cdn.geekwire.com/wp-content/uploads/2020/06/200624-brains3.jpg", "publishedAt": "2020-06-25T07:11:08Z", "content": "This image shows a section of one hemisphere of a healthy brain from an older person at left,and a brain with advanced Alzheimers disease at right. (UW Medicine Photo)\r\nA $40.5 million collaborative … [+5466 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Reuters", "title": "Eighth coronavirus vaccine goes into human trial in China - Livemint", "description": "The new drug is developed by the Academy of Military Science (AMS), a research institute affiliated with the People's Liberation Army.No vaccine has been approved for sale against the virus that has killed over 470,000 people", "url": "https://www.livemint.com/science/health/eighth-coronavirus-vaccine-goes-into-human-trial-in-china-11593064864105.html", "urlToImage": "https://images.livemint.com/img/2020/06/25/600x338/2020-06-25T031321Z_1_LYNXMPEG5O0AI_RTROPTP_3_BRITAIN-ROYALS-WILLIAM_1593065594540_1593065614334.JPG", "publishedAt": "2020-06-25T06:25:34Z", "content": "A Chinese military research institute has been approved to test its second experimental coronavirus vaccine in humans, the eighth candidate in clinical trials for China as it emerges as a front-runne… [+1688 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Covid-19 affecting mental, physical health of kids, young people - Daijiworld.com", "description": "", "url": "http://www.daijiworld.com/news/newsDisplay.aspx?newsID=723410", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2020-06-25T05:51:59Z", "content": "London, Jun 25 (IANS): While children and young people seem rarely to be victims of severe Covid-19, they are experiencing indirect adverse effects of the pandemic on their mental and physical health… [+2464 chars]"}, {"source": {"id": null, "name": "Deccan Chronicle"}, "author": "Kaniza Garari", "title": "Coronavirus more intelligent than humans, says medical journal - Deccan Chronicle", "description": "Lockdown violation by people led to spurt in Covid-19 cases, finds study", "url": "https://www.deccanchronicle.com/science/science/250620/genetic-structure-of-a-rudimentary-virus-more-intelligent-than-entire.html", "urlToImage": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-1pc077agf1otcj584gq2hjad06-20200625101710.Medi.jpeg", "publishedAt": "2020-06-25T04:47:00Z", "content": "Hyderabad: Public participation is very important to control Sars-Cov2 virus according to a study of 100 days of Covid-19 in India. The study shows that breach of the lockdown led to a spurt of cases… [+2452 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Margaret Newkirk", "title": "Coronavirus races through US, now predicted to kill 1.8 lakh by October - ThePrint", "description": "The spike in cases comes as states across the US have either already lifted or are easing lockdown orders, many at the behest of President Donald Trump.", "url": "https://theprint.in/world/coronavirus-races-through-us-now-predicted-to-kill-1-8-lakh-by-october/448270/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/360890907-scaled-e1586142236795.jpg", "publishedAt": "2020-06-25T04:29:15Z", "content": "Miami/Atlanta/Minneapolis: The Covid-19 pandemic, which set records for infections and hospitalizations across the U.S. on Wednesday, is now predicted to kill 180,000 Americans by October, adding to … [+7060 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "3 non-food things that help in boosting your immune system - Times of India", "description": "Ever since the outbreak of novel coronavirus, there has been a sharp increase in the sales of ‘immunity-boosting products’ including Vitamin C tablets, Zinc supplements and Ayurvedic products which claim to ‘boost’ the immune system. Since there is no definit…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/3-non-food-things-that-help-in-boosting-your-immune-system/photostory/76574067.cms", "urlToImage": "https://static.toiimg.com/photo/76574588.cms", "publishedAt": "2020-06-25T03:30:00Z", "content": "While this may seem like the most obvious advice and something you hear all the time, building your immunity actually boils down to the good old ways of sleeping, working out and leading a stress-fre… [+459 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Family deals with the aftermath of COVID-19 while offering a message of hope - ABC Action News", "description": "A family dealing with the aftermath of COVID-19 is sharing a message of hope as they work to recover from the virus’ impacts.", "url": "https://www.youtube.com/watch?v=D6wI15-_tls", "urlToImage": "https://i.ytimg.com/vi/D6wI15-_tls/hqdefault.jpg", "publishedAt": "2020-06-25T03:27:27Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "R Sukumar", "title": "Covid-19: What you need to know today - Hindustan Times", "description": "Six months into the year, there’s a lot we have learnt about Sars-CoV-2, the virus that causes Covid-19 (the coronavirus disease), and there’s a lot we have learnt about the disease itself.", "url": "https://www.hindustantimes.com/india-news/covid-19-what-you-need-to-know-today/story-TDtmJnEfXhw4E4TK36iYEN.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/06/25/Pictures/_714cb876-b652-11ea-90dd-2a5e32daeb81.jpg", "publishedAt": "2020-06-25T02:23:00Z", "content": "Six months into the year, there’s a lot we have learnt about Sars-CoV-2, the virus that causes Covid-19 (the coronavirus disease), and there’s a lot we have learnt about the disease itself.\r\nWe know … [+4627 chars]"}]}