{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "World leaders to launch COVID-19 drugs, vaccine plan: WHO - ARIRANG NEWS", "description": "WHO \"코로나19 치료제•백신 개발 협력안 제시\" World leaders have pledged to work together in a landmark collaboration, to speed up the development of drugs, tests and vaccine...", "url": "https://www.youtube.com/watch?v=XC4JHNYFmk0", "urlToImage": null, "publishedAt": "2020-04-25T04:57:01Z", "content": "WHO \"19 \"\r\nWorld leaders have pledged to work together in a landmark collaboration, to speed up the development of drugs, tests and vaccines to diagnose and treat COVID-19.According to the World Health Organization on Friday, world leaders including French Pr… [+495 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Paris: Sewers tested for COVID-19 concentration | France Coronavirus | World News - WION", "description": "Paris: Sewers tested for COVID-19 concentration | France Coronavirus | World News In France, traces of the novel coronavirus were discovered in 4 out of 27 s...", "url": "https://www.youtube.com/watch?v=4ZJVtFYyA58", "urlToImage": null, "publishedAt": "2020-04-25T04:35:19Z", "content": "Paris: Sewers tested for COVID-19 concentration | France Coronavirus | World News\r\nIn France, traces of the novel coronavirus were discovered in 4 out of 27 samples of the non-potable water, which is supplied in Paris.\r\n#ParisCoronavirus#FranceCoronavirusDeat… [+1130 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Aswathi Pacha", "title": "Stop villainising bats, say scientists and conservationists - The Hindu", "description": "The mammals do not spread COVID-19, they say", "url": "https://www.thehindu.com/sci-tech/energy-and-environment/stop-villainising-bats-say-scientists-and-conservationists/article31429962.ece", "urlToImage": null, "publishedAt": "2020-04-25T04:24:55Z", "content": "Unverified news and social media posts linking bats to the COVID-19 outbreak have led to widespread antipathy and there have been increasing incidents of the public destroying bat roosts and smoking them out. To raise awareness, 64 chiropterologists (those wh… [+2199 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "White House COVID-19 update: April 24 - 9NEWS", "description": "The White House COVID-19 task force is giving its daily update on the federal response to the novel coronavirus pandemic. More local videos here: https://bit...", "url": "https://www.youtube.com/watch?v=y1XaNbLimKI", "urlToImage": null, "publishedAt": "2020-04-25T04:10:33Z", "content": null}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Maggie Fox", "title": "COVID-19 causing blood clots, sudden strokes in young adults, doctors say - CTV News", "description": "The new coronavirus appears to be causing sudden strokes in adults in their 30s and 40s who are not otherwise terribly ill, doctors reported Wednesday.", "url": "https://www.ctvnews.ca/health/coronavirus/covid-19-causing-blood-clots-sudden-strokes-in-young-adults-doctors-say-1.4910674", "urlToImage": null, "publishedAt": "2020-04-25T03:40:15Z", "content": "The new coronavirus appears to be causing sudden strokes in adults in their 30s and 40s who are not otherwise terribly ill, doctors reported Wednesday.\r\nThey said patients may be unwilling to call 911 because they have heard hospitals are overwhelmed by coron… [+2516 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "G. Lakshmi and Shilpi Garg", "title": "World Malaria Day – a Good Time to Remember COVID-19 Isn't the Only Crisis - The Wire", "description": "The ongoing novel coronavirus pandemic hasn't made matters easier, even if the world has developed – even temporarily – a heightened awareness of the effects of infectious diseases.", "url": "https://science.thewire.in/the-sciences/world-malaria-day-a-good-time-to-remember-covid-19-isnt-the-only-crisis/", "urlToImage": null, "publishedAt": "2020-04-25T03:29:00Z", "content": "An Anopheles stephensi mosquito obtains a blood meal from a human host through its pointed proboscis in this undated handout photo obtained by Reuters, November 2015. Photo: Reuters/Jim Gathany/CDC.\r\nThe latest World Malaria Report released in December 2019 s… [+5011 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Vaping, smoking increases risk of infections from COVID-19 - WWLP-22News", "description": "We all know smoking can be harmful to our lungs, but now advisories are being issued that COVID-19 can be an even more serious threat to those who smoke and ...", "url": "https://www.youtube.com/watch?v=qB-WapNuDuo", "urlToImage": null, "publishedAt": "2020-04-25T03:15:03Z", "content": null}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Bengaluru hospital to conduct plasma therapy trials on Sat - Daijiworld.com", "description": "", "url": "http://www.daijiworld.com/news/newsDisplay.aspx?newsID=700743", "urlToImage": null, "publishedAt": "2020-04-25T02:32:14Z", "content": "Bengaluru, Apr 25 (IANS): City-based BMC Victoria Hospital is poised to take the first steps in assessing the efficacy of plasma therapy for Covid-19 patients on Saturday, Karnataka Health Minister B. Sriramulu said on Friday.\r\n\"BMC Victoria hospital will tak… [+875 chars]"}, {"source": {"id": null, "name": "Newkerala.com"}, "author": null, "title": "Scientists discover protein for better obesity treatments - New Kerala", "description": "Researchers have found the precise shape of a key player in human metabolism, which could lead the way to better treatments for obesity and other metabolic di...", "url": "https://www.newkerala.com/news/2020/72424.htm", "urlToImage": null, "publishedAt": "2020-04-25T02:26:05Z", "content": "Researchers have found the precise shape of a key player in human metabolism, which could lead the way to better treatments for obesity and other metabolic diseases. According to a study, published in the journal Science, the research team focused on a protei… [+2020 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": null, "title": "Coronavirus: Five new cases, one death, as recoveries surge to 77 per cent - Stuff.co.nz", "description": "About 77 per cent of all New Zealand's Covid-19 cases have recovered.", "url": "https://i.stuff.co.nz/national/health/coronavirus/121269987/coronavirus-ministry-of-health-covid19-update", "urlToImage": null, "publishedAt": "2020-04-25T02:15:00Z", "content": "There are five new coronavirus cases in New Zealand, according to the Ministry of Health.\r\n One other person, a woman in her 70s, has also died, bringing the country's Covid-19 death toll to 18. \r\n New Zealand's recovery rate continues to increase with about … [+2927 chars]"}, {"source": {"id": null, "name": "Uniindia.com"}, "author": "Uniindia News Service", "title": "Africa Vaccination Week 2020 kicks off - United News of India", "description": "Brazzaville, Apr 25 (UNI)  The Africa Vaccination Week 2020 has started as the COVID-19 pandemic is causing significant disruption to vaccination efforts and to the surveillance of vaccine-preventable diseases on the continent.", "url": "http://www.uniindia.com/africa-vaccination-week-2020-kicks-off/world/news/1968505.html", "urlToImage": null, "publishedAt": "2020-04-25T01:41:00Z", "content": "Brazzaville, Apr 25 (UNI) The Africa Vaccination Week 2020 has started as the COVID-19 pandemic is causing significant disruption to vaccination efforts and to the surveillance of vaccine-preventable diseases on the continent.\r\nPrior disease outbreaks and hum… [+2905 chars]"}, {"source": {"id": null, "name": "Unicef.org"}, "author": null, "title": "Over 13 million children did not receive any vaccines at all even before COVID-19 disrupted global immunization - UNICEF", "description": "Mass measles immunization campaigns suspended in 25 largely high-burden countries due to pandemic", "url": "https://www.unicef.org/press-releases/over-13-million-children-did-not-receive-any-vaccines-all-even-covid-19-disrupted", "urlToImage": null, "publishedAt": "2020-04-25T01:03:21Z", "content": "NEW YORK, 25 April 2020 As the world waits desperately for a vaccine, the COVID-19 pandemic is continuing to surge across the globe. Millions of children are in danger of missing life-saving vaccines against measles, diphtheria and polio due to disruptions in… [+5399 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "US coronavirus death toll doubles in 10 days to more than 50,000 - Times of India", "description": "US News: The US death toll from the novel coronavirus reached 50,000 on Friday, having doubled in 10 days, according to a Reuters tally. More than 875,000 Amer", "url": "https://timesofindia.indiatimes.com/world/us/us-coronavirus-death-toll-doubles-in-10-days-to-more-than-50000/articleshow/75357950.cms", "urlToImage": null, "publishedAt": "2020-04-25T00:18:57Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Reliefweb.int"}, "author": null, "title": "World Malaria Day 2020 : Malaria - Status Update on Children (25 April 2020) - World - ReliefWeb", "description": "English News and Press Release on World and 10 other countries about Health, Children and Epidemic; published on 24 Apr 2020 by UNICEF", "url": "https://reliefweb.int/report/world/world-malaria-day-2020-malaria-status-update-children-25-april-2020", "urlToImage": null, "publishedAt": "2020-04-25T00:00:08Z", "content": "Malaria data snapshots\r\nSnapshots from sub-Saharan Africa and added impacts of COVID-19\r\nEvery two minutes, a child under the age of 5 dies from malaria. Under-five children accounted for 67 per cent of all malaria deaths worldwide in 2018. Most of them occur… [+1280 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Today, The U.S. Passed 50000 Deaths Due To COVID-19 | MTP Daily | MSNBC - MSNBC", "description": "Today, the U.S. passed 50,000 deaths due to COVID-19. Chuck Todd says, \"At this rate, in just a few days, more Americans will have died from Coronavirus over...", "url": "https://www.youtube.com/watch?v=1B5UdkzxcbE", "urlToImage": null, "publishedAt": "2020-04-24T23:32:05Z", "content": "Today, the U.S. passed 50,000 deaths due to COVID-19. Chuck Todd says, \"At this rate, in just a few days, more Americans will have died from Coronavirus over a span of roughly 9 weeks than died in the Vietnam War over a span of 12-years.\" Aired on 4/24/2020.»… [+770 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Bengaluru: Shortage of hydroxychloroquine a pain for arthritis, lupus patients - Times of India", "description": "Due to its use as a prophylaxis for Covid-19, anti-malarial drug hydroxychloroquine (HCQ) is not available to those who consume it regularly — arthrit", "url": "https://timesofindia.indiatimes.com/city/bengaluru/shortage-of-hcq-a-pain-for-arthritis-lupus-patients/articleshow/75362305.cms", "urlToImage": null, "publishedAt": "2020-04-24T23:19:00Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "COVID-19 outbreak: Pune’s Serum Institute all set to make under-trial Coronavirus vaccine - The Financial Express", "description": "Once the clinical trials are over and successful, SII will release its vaccine. If the clinical trials by Oxford are not successful then the loss will be of SII. Some limited clinical trials will be done by SII also.", "url": "https://www.financialexpress.com/industry/covid-19-outbreak-punes-serum-institute-all-set-to-make-under-trial-coronavirus-vaccine/1938911/", "urlToImage": null, "publishedAt": "2020-04-24T23:16:14Z", "content": "The Serum Institute of India (SII), which has partnered with the University of Oxford, has started work on manufacturing a vaccine for coronavirus. The SII has started the work even as Oxford University on Thursday started clinical trials of the vaccine it ha… [+1151 chars]"}, {"source": {"id": null, "name": "Greaterkashmir.com"}, "author": null, "title": "COVID19 not manipulated or constructed: WHO - Greater Kashmir", "description": "COVID19 not manipulated or constructed: WHO Greater Kashmir | All available evidence to date suggests that the novel coronavirus has a natural animal origin and was not a manipulated or constructed virus, the World", "url": "https://www.greaterkashmir.com/news/front-page-2/covid19-not-manipulated-or-constructed-who/", "urlToImage": null, "publishedAt": "2020-04-24T23:04:00Z", "content": "All available evidence to date suggests that the novel coronavirus has a natural animal origin and was not a manipulated or constructed virus, the World Health Organization (WHO) said.\r\n“Many researchers have been able to look at the genomic\r\nfeatures of SARS… [+1000 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: test booking website swamped as thousands apply - BBC News - BBC News", "description": "A new government website, for key workers and their families to book coronavirus tests online, was forced to shut down for a time as it was swamped with requ...", "url": "https://www.youtube.com/watch?v=UI99jRFra_0", "urlToImage": null, "publishedAt": "2020-04-24T21:28:30Z", "content": "A new government website, for key workers and their families to book coronavirus tests online, was forced to shut down for a time as it was swamped with requests. \r\nAlmost 50,000 people in England tried to book a test just hours after the website launched. 16… [+530 chars]"}, {"source": {"id": null, "name": "France24.com"}, "author": "NEWS WIRES", "title": "Covid-19: France records 389 new deaths as hospital cases continue to fall - FRANCE 24 English", "description": "France on Friday reported 389 more coronavirus deaths, a lower toll than in previous days, and also welcomed new falls in the number of patients in hospital and intensive care.", "url": "https://www.france24.com/en/20200424-covid-19-france-records-389-new-deaths-as-hospital-cases-continue-to-fall", "urlToImage": null, "publishedAt": "2020-04-24T20:32:47Z", "content": "France on Friday reported 389 more coronavirus deaths, a lower toll than in previous days, and also welcomed new falls in the number of patients in hospital and intensive care.\r\n The latest deaths in both hospitals and nursing homes brought France's total tol… [+335 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "R Sukumar", "title": "Covid-19: What you need to know today - Hindustan Times", "description": "There’s long been a theory that the number of people infected with the Sars-CoV-2 virus, which causes Covid-19, is actually higher than that reported.", "url": "https://www.hindustantimes.com/india-news/covid-19-what-you-need-to-know-today/story-Nv96Urk58r4g4vC43WqwZJ.html", "urlToImage": null, "publishedAt": "2020-04-24T20:07:28Z", "content": "When there is no cure, metrics such as the prevalence of infection and immunity in a population become important.\r\nWhich is why the results of New York’s study of 3,000 people picked at random for an antibody test that were announced on Thursday are being stu… [+3547 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Samantha  Black, PhD, The Science Advisory Board staff writer", "title": "Experts discuss promising strategies for tackling SARS-CoV-2 - The Science Board", "description": "What's the best strategy for developing treatments for the SARS-CoV-2 virus? The most promising approaches for a rapid response are antivirals and gene therapy, according to a new review article published April 24 in <em>Frontiers in Microbiology</em>.", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=687", "urlToImage": null, "publishedAt": "2020-04-24T19:24:18Z", "content": "In an unprecedented effort, hundreds of thousands of researchers and clinicians from around the world are fighting against the clock to develop cures, vaccines, and diagnostics for COVID-19, the illness caused by the virus SARS-CoV-2. To date, over 1,650 acad… [+6253 chars]"}, {"source": {"id": null, "name": "Thequint.com"}, "author": "Ankita Sharma", "title": "69% Asymptomatic COVID Cases: Should India Worry Or There Is Hope? - The Quint", "description": "69% COVID-19 Positive Cases were Asymptomatic: In the last few weeks, a lot has been said about asymptomatic & mildly infected coronavirus cases. Earlier this week, Lav Agrawal,Joint Secretary, Ministry of Health said, On  basis of worldwide analysis", "url": "https://fit.thequint.com/coronavirus/asymptomatic-covid-19-cases-can-they-transmit-the-coronavirus", "urlToImage": null, "publishedAt": "2020-04-24T19:07:59Z", "content": "In the last few weeks, a lot has been said about asymptomatic and mildly infected coronavirus cases.\r\nEarlier this week, Lav Agrawal, Joint Secretary, Ministry of Health said, On the basis of worldwide analysis, 80% of coronavirus patients are asymptomatic or… [+357 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Rupsa Chakraborty", "title": "Hospital didn’t have bed, ambulance refused oxygen facility: Family’s ordeal after doctor succumbs to... - Hindustan Times", "description": "", "url": "https://www.hindustantimes.com/mumbai-news/hospital-didn-t-have-bed-ambulance-refused-oxygen-facility-ordeal-of-a-doctor-s-family-who-succumbed-to-covid-19/story-kDp3I3cyMp5qX034CAySGP.html", "urlToImage": null, "publishedAt": "2020-04-24T18:56:00Z", "content": "The family of a 36-year-old general physician from Shivaji Nagar who contracted Covid-19 struggled for 24 hours to get him admitted to a hospital. \r\nMany hospitals refused to admit him due to unavailability of beds or lack of treatment facilities for the nove… [+3523 chars]"}, {"source": {"id": null, "name": "Webmd.com"}, "author": "Brenda  Goodman, MA", "title": "Blood Clots Are Another Dangerous COVID-19 Mystery - WebMD", "description": "Around the world, doctors caring for COVID-19 patients have been trying to make sense of the same thing. When they draw blood from COVID patients, it clots in the tubes.", "url": "https://www.webmd.com/lung/news/20200424/blood-clots-are-another-dangerous-covid-19-mystery", "urlToImage": null, "publishedAt": "2020-04-24T18:46:44Z", "content": "He says this theory of infection explains some things that doctors have been trying to puzzle out.\r\nFor example, certain conditions like high blood pressure, diabetes, and heart disease stress the endothelium. Its no surprise, then, that people who have these… [+1776 chars]"}, {"source": {"id": null, "name": "Greaterkashmir.com"}, "author": null, "title": "Key nose cells identified as likely entry points of coronavirus - Greater Kashmir", "description": "Key nose cells identified as likely entry points of coronavirus Greater Kashmir | Scientists have identified two specific cell types in the nose as likely initial infection points for the novel coronavirus that causes COVID-19. The", "url": "https://www.greaterkashmir.com/news/health/key-nose-cells-identified-as-likely-entry-points-of-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-24T18:39:45Z", "content": null}, {"source": {"id": null, "name": "Biospectrumasia.com"}, "author": null, "title": "Scientists identify key nasal cells believed to attract Coronavirus - BSA bureau", "description": "Scientists discovered that goblet and ciliated cells in the nose have high levels of the entry proteins that the Coronavirus uses to get into our cells.", "url": "https://www.biospectrumasia.com/news/26/15851/scientists-identify-key-nasal-cells-believed-to-attract-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-24T18:29:42Z", "content": "Scientists discovered that goblet and ciliated cells in the nose have high levels of the entry proteins that the Coronavirus uses to get into our cells.\r\nTwo specific nose cell types have been identified as likely initial infection points for COVID-19 coronav… [+1756 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Largest COVID-19 patient study in the United States - 9NEWS", "description": "A new study looked at 5,700 patients in New York City . 9Health Expert, Dr. Payal Kohli, explains the findings.", "url": "https://www.youtube.com/watch?v=Fob9MPhmC28", "urlToImage": null, "publishedAt": "2020-04-24T16:50:17Z", "content": "A new study looked at 5,700 patients in New York City . 9Health Expert, Dr. Payal Kohli, explains the findings."}, {"source": {"id": null, "name": "Thehindubusinessline.com"}, "author": "Our Bureau", "title": "Total Covid-19 cases at 983 in Telangana - BusinessLine", "description": "291 discharged; active cases 663", "url": "https://www.thehindubusinessline.com/news/national/total-covid-19-cases-at-983-in-telangana/article31427066.ece", "urlToImage": null, "publishedAt": "2020-04-24T16:48:01Z", "content": "The total number of Covid-19 positive cases reported in Telangana so far has reached 983. While 29 patients have been discharged on Friday, taking the total number of patients discharged after treatment so far to 291.\r\nThe total active cases is put at 663, wi… [+799 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "PTI", "title": "India may see second wave of COVID-19 outbreak in monsoon: Scientists - Zee News", "description": "The timing of the peak will depend on how India is able to control physical distancing and on the level of infection spreads after restrictions are relaxed, said scientists.", "url": "https://zeenews.india.com/india/india-may-see-second-wave-of-covid-19-outbreak-in-monsoon-scientists-2278767.html", "urlToImage": null, "publishedAt": "2020-04-24T16:47:09Z", "content": "New Delhi: The trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the lockdown is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say scient… [+6179 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Covid-19 update: Telangana gets 13 new cases on April 24 - Telangana Today", "description": "Hyderabad: Health authorities on Friday have reported 13 more coronavirus positive cases, which has taken the overall number of positive cases so far to 983 in Telangana. While there are no fatalities related to Covid-19 on Friday, health officials said 29 po…", "url": "https://telanganatoday.com/covid-19-update-telangana-gets-13-new-cases-on-april-24", "urlToImage": null, "publishedAt": "2020-04-24T16:08:08Z", "content": "Hyderabad: Health authorities on Friday have reported 13 more coronavirus positive cases, which has taken the overall number of positive cases so far to 983 in Telangana.\r\nWhile there are no fatalities related to Covid-19 on Friday, health officials said 29 p… [+408 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Tara Parker-Pope", "title": "What’s a Pulse Oximeter, and Do I Really Need One at Home? - The New York Times", "description": "A tiny fingertip device can give you valuable information about your health during a bout of Covid-19 or any respiratory illness.", "url": "https://www.nytimes.com/2020/04/24/well/live/coronavirus-pulse-oximeter-oxygen.html", "urlToImage": null, "publishedAt": "2020-04-24T16:05:24Z", "content": "After working for 10 days at Bellevue Hospital in New York, Dr. Richard Levitan decided to share what he had learned about Covid-19. Too many patients were showing up at the hospital with perilously low oxygen levels, putting them at risk for severe complicat… [+8004 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Sweden to shut bars and restaurants that ignore coronavirus restrictions - Reuters India", "description": "Sweden warned on Friday it would shut restaurants and bars in the capital that did not comply with guidelines aimed at preventing the spread of the novel coronavirus, amid signs Stockholm residents were beginning to ignore the rules.", "url": "https://in.reuters.com/article/health-coronavirus-sweden-stockholm-idINKCN2262C2", "urlToImage": null, "publishedAt": "2020-04-24T15:05:14Z", "content": "STOCKHOLM (Reuters) - Sweden warned on Friday it would shut restaurants and bars in the capital that did not comply with guidelines aimed at preventing the spread of the novel coronavirus, amid signs Stockholm residents were beginning to ignore the rules. \r\nT… [+2132 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Reuters", "title": "Italy's coronavirus epidemic began in January or maybe even before: Study - Livemint", "description": "Stefano Merler, of Bruno Kessler Foundation, says 'We realized that there were a lot of infected people in Lombardy well before 20 Feb, which means the epidemic had started much earlier'", "url": "https://www.livemint.com/news/world/italy-s-coronavirus-epidemic-began-in-january-or-maybe-even-before-study-11587739037180.html", "urlToImage": null, "publishedAt": "2020-04-24T14:44:59Z", "content": "Rome: The first COVID-19 infections in Italy date back to January, according to a scientific study presented on Friday, shedding new light on the origins of the outbreak in one of the world's worst-affected countries.Italy began testing people after diagnosin… [+1652 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus prevention: How to make your own protective mask - Gulf News", "description": "UAE-based designer Behnood Javaherpour shows how to create your own face mask at home See more videos at https://gulfnews.com/videos Read more Gulf News stor...", "url": "https://www.youtube.com/watch?v=DTyKcdUZCOQ", "urlToImage": null, "publishedAt": "2020-04-24T14:29:30Z", "content": null}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AFP", "title": "Coronavirus vaccine: Monkeys largely protected during trial, says Chinese firm - Livemint", "description": "Sinovac Biotech said it injected two different doses of its vaccine into eight rhesus macaque monkeys and exposed them to the virus three weeks later, and they did not develop infections", "url": "https://www.livemint.com/news/world/coronavirus-vaccine-monkeys-largely-protected-during-trial-says-chinese-firm-11587736770613.html", "urlToImage": null, "publishedAt": "2020-04-24T14:13:47Z", "content": "A novel coronavirus vaccine has for the first time \"largely protected\" monkeys from infection during an animal trial, data from a Chinese pharmaceutical giant showed.It is among a slew of vaccines being developed around the world as countries race to stop an … [+3317 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "Coronavirus outcome of crazy experiments at Wuhan: Russian scientist - Northeast Now", "description": "A leading Russian microbiologist has claimed that the novel coronavirus is the outcome of \"crazy\" experiments conducted by scientists at the Wuhan Institute of Virology. Coronavirus originated in Chinas Wuhan city in December last year. In an interview to Rus…", "url": "https://nenow.in/health/coronavirus-outcome-of-crazy-experiments-at-wuhan-russian-scientist.html/", "urlToImage": null, "publishedAt": "2020-04-24T13:37:37Z", "content": "A leading Russian microbiologist has claimed that the novel coronavirus is the outcome of “crazy” experiments conducted by scientists at the Wuhan Institute of Virology.\r\nCoronavirus originated in Chinas Wuhan city in December last year.\r\nIn an interview to R… [+1896 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Aylin Woodward", "title": "5 young New Yorkers with mild COVID-19 were recently hospitalized with strokes. Doctors say the coronavirus ca - Business Insider India", "description": "Although the coronavirus is primarily a respiratory disease that affects the lungs, it can cause heart, kidney, and brain problems. Doctors have reported blood", "url": "https://www.businessinsider.in/science/news/5-young-new-yorkers-with-mild-covid-19-were-recently-hospitalized-with-strokes-doctors-say-the-coronavirus-can-cause-blood-clots-/articleshow/75355741.cms", "urlToImage": null, "publishedAt": "2020-04-24T13:32:00Z", "content": "Doctors treating COVID-19\r\n patients have begun to document ways in which the disease impacts far more than just the lungs.\r\nExperts have reported kidney issues, heart problems, and more recently, blood clots appearing in various parts of patients' bodies. Su… [+4046 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "New York Times", "title": "Nearly All Patients Hospitalized With Covid-19 Had Chronic Health Issues, Study Finds - Times of India", "description": "A new study of thousands of hospitalized coronavirus patients in the New York City area, the epicenter of the outbr", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/nearly-all-patients-hospitalized-with-covid-19-had-chronic-health-issues-study-finds/articleshow/75347362.cms", "urlToImage": null, "publishedAt": "2020-04-24T13:20:37Z", "content": "A new study of thousands of hospitalized coronavirus patients in the New York City area, the epicenter of the outbreak in the United States, has found that nearly all of them had at least one major chronic health condition, and most 88 percent had at least tw… [+5568 chars]"}, {"source": {"id": null, "name": "Dailysabah.com"}, "author": "Associated Press", "title": "Fight against malaria could be set back 20 years by coronavirus pandemic, WHO warns | Daily Sabah - Daily Sabah", "description": "One of the hard lessons the World Health Organization (WHO) learned during the Ebola outbreak in West Africa was this: Other diseases can be forgotten and take a deadlier...", "url": "https://www.dailysabah.com/life/health/fight-against-malaria-could-be-set-back-20-years-by-coronavirus-pandemic-who-warns", "urlToImage": null, "publishedAt": "2020-04-24T12:41:06Z", "content": "One of the hard lessons the World Health Organization (WHO) learned during the Ebola outbreak in West Africa was this: Other diseases can be forgotten and take a deadlier toll.\r\nWHO is now warning that the battle against malaria in sub-Saharan Africa, where i… [+2813 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "Covid-19 crisis: Fight against malaria could be set back 20 years, warns WHO - Livemint", "description": "The WHO said new projections indicate that in a worst-case scenario, 769,000 people could die of malaria in sub-Saharan Africa this year.There have already been 'severe disruptions' to anti-malaria campaigns and access to anti-malaria medication in Africa, WH…", "url": "https://www.livemint.com/news/world/covid-19-crisis-fight-against-malaria-could-be-set-back-20-years-warns-who-11587729475109.html", "urlToImage": null, "publishedAt": "2020-04-24T12:13:20Z", "content": "Cape Town: One of the hard lessons the World Health Organization learned during the Ebola outbreak in West Africa was this: Other diseases can be forgotten and take a deadlier toll.The WHO is now warning that the battle against malaria in sub-Saharan Africa, … [+3100 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Vinod Rathore", "title": "Blood thickening, clots in covid-19 patients alarm doctors - News Track English", "description": "New York: A new news related to the corona virus has shocked doctors. This virus is now clotting the blood of the body of the infected. Nephrologists at Mount Sinai Hospital in New York, New York, USA have found that blood is also accumulating in the kidneys …", "url": "https://english.newstracklive.com/news/blood-blockage-in-body-of-corona-patients-says-doctors-mc24-nu764-ta272-1087286-1.html", "urlToImage": null, "publishedAt": "2020-04-24T11:31:04Z", "content": null}, {"source": {"id": null, "name": "Edexlive.com"}, "author": "Edex Live", "title": "Dietary supplements important weapon for fighting off COVID-19, say researchers - EdexLive", "description": "In particular vitamin C, vitamin D, zinc, and an omega-3 fatty acid found in fish, docosahexaenoic acid, also known as DHA, are critical for immune function", "url": "https://www.edexlive.com/news/2020/apr/24/dietary-supplements-important-weapon-for-fighting-off-covid-19-say-researchers-11557.html", "urlToImage": null, "publishedAt": "2020-04-24T11:08:04Z", "content": "Supplements containing vitamins C and D and other micronutrients are a safe, effective and low-cost means of helping your immune system fight off COVID-19 and other acute respiratory tract diseases, say researchers.\r\nAccording to the study, published in the j… [+2042 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sarah Moon, CNN", "title": "A seemingly healthy woman's sudden death is now the first known US coronavirus-related fatality - CNN", "description": "A 57-year-old Northern California woman whose February 6 death has become the first known coronavirus-related fatality in the US had been in relatively good health, her brother told CNN.", "url": "https://www.cnn.com/2020/04/23/us/california-woman-first-coronavirus-death/index.html", "urlToImage": null, "publishedAt": "2020-04-24T10:54:56Z", "content": "December 31, 2019: China reports mysterious pneumonia cases to the World Health Organization.\r\nJanuary 7, 2020: China says the cases were caused by a new coronavirus.\r\nJanuary 17: US starts screening for symptoms at certain airports.\r\nJanuary 21: First US cas… [+625 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "IIT professor develops software to detect Covid-19 within 5 seconds using X-ray scan - Times of India", "description": "India News: NEW DELHI: An IIT-Roorkee professor claims to have developed a software which can detect Covid-19 within five seconds using X-ray scan of the suspecte.", "url": "https://timesofindia.indiatimes.com/india/iit-professor-develops-software-to-detect-covid-19-within-5-seconds-using-x-ray-scan/articleshow/75343677.cms", "urlToImage": null, "publishedAt": "2020-04-24T10:15:44Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Covid causing blood clots in patients: Docs - Times of India", "description": "The number of COVID-19 cases crossed the 2.5 million mark recently, as researchers rush to make new findings and se", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/covid-causing-blood-clots-in-patients-docs/articleshow/75342355.cms", "urlToImage": null, "publishedAt": "2020-04-24T09:36:07Z", "content": null}, {"source": {"id": null, "name": "Selectscience.net"}, "author": "SelectScience", "title": "Pfizer, BioNTech COVID-19 vaccine cleared for human tests - SelectScience", "description": "Pfizer and BioNTech to start human trials of COVID-19 vaccine", "url": "https://www.selectscience.net/industry-news/pfizer-and-biontech-to-start-human-trials-of-covid-19-vaccine/?artID=51330", "urlToImage": null, "publishedAt": "2020-04-24T09:09:30Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Mumbai Mirror", "title": "Mumbai-based medico designs face shield from overhead projector sheets - Mumbai Mirror", "description": "When the coronavirus pandemic hit Mumbai and medical workers appeared clueless how to treat patients by ensuring their own safety, an enterprising female medical practitioner found a solution by desi", "url": "https://mumbaimirror.indiatimes.com/coronavirus/news/mumbai-based-medico-designs-face-shield-from-overhead-projector-sheets/articleshow/75346286.cms", "urlToImage": null, "publishedAt": "2020-04-24T08:58:00Z", "content": "Mumbai\r\n: When the coronavirus\r\n pandemic hit \r\nMumbai and medical workers appeared clueless how to treat patients by ensuring their own safety, an enterprising female medical practitioner found a solution by designing a face shield made out of overhead proje… [+3399 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "India may see second wave of COVID-19 outbreak in monsoon, say scientists - Economic Times", "description": "The timing of the peak will depend on how India is able to control physical distancing and on the level of infection spreads after restrictions are relaxed, they said.", "url": "https://economictimes.indiatimes.com/news/science/india-may-see-second-wave-of-covid-19-outbreak-in-monsoon-say-scientists/articleshow/75345793.cms", "urlToImage": null, "publishedAt": "2020-04-24T08:36:21Z", "content": "The trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the lockdown is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say scientists.\r\nThe … [+1442 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Erika Edwards", "title": "Doctors report uptick in surprising coronavirus complication: dangerous blood clots - NBC News", "description": "Coronavirus patients are developing blood clots at higher rates. Does the virus cause blood to clot, or is it the result of inflammation? Regular anticoagulants aren't working.", "url": "https://www.nbcnews.com/health/health-news/doctors-report-uptick-surprising-coronavirus-complication-dangerous-blood-clots-n1190491", "urlToImage": null, "publishedAt": "2020-04-24T08:33:27Z", "content": "Three weeks ago, critical care pulmonologist Hugh Cassiere encountered something he hadn't seen in 24 years of practicing medicine.\r\nA 45-year-old man arrived at the hospital where Cassiere works, North Shore University Hospital on Long Island, New York, with… [+4346 chars]"}, {"source": {"id": null, "name": "Latestly.com"}, "author": "Team Latestly", "title": "How to Wash Vegetables and Fruits Right Way? Dos and Don’ts to Properly Handle Groceries During the - LatestLY", "description": "Food safety experts advise against frantically washing your produce in soapy water in hopes of scrubbing away the coronavirus. If not soap, how to clean the vegetables and fruits? In this article, we bring you the dos and don’ts that you need to follow to pro…", "url": "https://www.latestly.com/lifestyle/food/how-to-wash-vegetables-and-fruits-right-way-dos-and-donts-to-properly-handle-groceries-during-the-covid-19-pandemic-1705417.html", "urlToImage": null, "publishedAt": "2020-04-24T07:44:17Z", "content": "The coronavirus scare has gripped us all. The virus is new, and there is not much information about it. Besides, with no immediate vaccine, the concern increases. We all are figuring out how to cope up with the new normal of staying home. And there is the add… [+2641 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Covid Toes among kids: New symptom of novel coronavirus infection - India Today", "description": "First some dermatologists in Italy found it. Now, it is being reported in the US. There is sudden surge in the cases similar to frostbite or pernio among kids in the areas severely affected by Covid-19. Some doctors have nicknamed it as Covid Toes.", "url": "https://www.indiatoday.in/coronavirus-outbreak/story/covid-toes-among-kids-new-symptom-of-novel-coronavirus-infection-1670462-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T06:40:08Z", "content": "Dermatologists in Europe and America are discussing a new potential symptom to identify a Covid-19 patient, particularly if the novel coronavirus has infected kids and young adults. In March, some dermatologists in Italy found an inflammation of toes and feet… [+2295 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "COVID: Max hospital group to study use of HCQ among healthcare workers - Livemint", "description": "The large-scale observational study will involve use of hydroxychloroquine prophylaxis among its healthcare workers.This is the first study involving COVID-19 that has been approved by ICMR", "url": "https://www.livemint.com/news/india/covid-max-hospital-group-to-study-use-of-hcq-among-healthcare-workers-11587698913597.html", "urlToImage": null, "publishedAt": "2020-04-24T03:56:25Z", "content": "NEW DELHI :\r\nAmid rising number of coronavirus cases in the country, a private hospital group on Thursday announced that it will conduct a large-scale observational study involving the use of hydroxychloroquine (HCQ) prophylaxis among its healthcare workers, … [+2088 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Gemma Mullin", "title": "Coronavirus causing blood clots and sudden strokes in young healthy patients - NEWS.com.au", "description": "Doctors warn coronavirus causing blood clots and sudden strokes in young healthy patients", "url": "https://www.news.com.au/lifestyle/health/health-problems/doctors-warn-coronavirus-causing-blood-clots-and-sudden-strokes-in-young-healthy-patients/news-story/d9d3f775f84783346d10f47229359e9a", "urlToImage": null, "publishedAt": "2020-04-23T23:59:35Z", "content": "Coronavirus can cause blood clots and sudden strokes in young, healthy patients, doctors have warned.Medics in New York have seen a sevenfold increase in stroke cases in people in their 30s and 40s who either had mild or no COVID-19 symptoms at all.\r\nIt comes… [+3691 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "CDC Director Clarifies Coronavirus Comments - HuffPost", "description": "President Donald Trump said Dr. Robert Redfield was misquoted about the coronavirus resurging in the fall, but the CDC director said his interview with The W...", "url": "https://www.youtube.com/watch?v=XhPtzNbO8iI", "urlToImage": null, "publishedAt": "2020-04-23T21:33:39Z", "content": "President Donald Trump said Dr. Robert Redfield was misquoted about the coronavirus resurging in the fall, but the CDC director said his interview with The Washington Post was accurate. \r\nSubscribe to HuffPost today: http://goo.gl/xW6HGSupport our work: https… [+134 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "Most NYC Virus Patients Had Underlying Health Issues, Study Shows - The Epoch Times", "description": "Most patients in New York City hospitalized with the CCP virus suffered from at least one underlying health issue, such as obesity or kidney disease.", "url": "https://www.theepochtimes.com/most-new-york-virus-patients-had-underlying-health-issue-study_3324097.html", "urlToImage": null, "publishedAt": "2020-04-23T21:17:16Z", "content": "Most patients in New York City hospitalized with the CCP virus suffered from one or more underlying health issues, such as obesity or kidney disease, according to a new study.\r\nResearchers analyzed records from 5,700 patients and found more than 56 percent su… [+3603 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "WHO warns malaria deaths in Africa could double amid pandemic - Al Jazeera English", "description": "Top health officials urge countries to ensure essential malaria prevention work continues during coronavirus pandemic.", "url": "https://www.aljazeera.com/news/2020/04/warns-malaria-deaths-africa-double-pandemic-200423182645239.html", "urlToImage": null, "publishedAt": "2020-04-23T19:32:29Z", "content": "The World Health Organisation (WHO) has warned that the number of deaths caused by malaria in sub-Saharan Africa could double to 769,000, as efforts to tackle the disease face disruptions by the coronavirus pandemic.\r\nAs of Thursday, the region had registered… [+3200 chars]"}, {"source": {"id": null, "name": "Boston25news.com"}, "author": "Debbie Lord, Cox Media Group National Content Desk", "title": "Coronavirus: Are blood clots killing COVID-19 patients? - Boston 25 News", "description": "According to reports from doctors across the country and around the world, some patients infected with the new coronavirus appear to be developing blood clots primarily in their lungs and legs.", "url": "https://www.boston25news.com/news/trending/coronavirus-are-blood-clots-killing-covid-19-patients/UAH5GS4WK5FPJFP7YUHPYT2ZIQ/", "urlToImage": null, "publishedAt": "2020-04-23T19:20:55Z", "content": "Physicians on the front line of coronavirus treatment are seeing a new and alarming symptom among patients infected with the COVID-19 virus.\r\nAccording to reports from doctors across the country and around the world, some patients infected with the new corona… [+4405 chars]"}, {"source": {"id": null, "name": "Kashmirreader.com"}, "author": "Press Trust of India", "title": "Two pet cats test positive for Covid19 in New York - Kashmir Reader", "description": "NEW YORK: Two cats in New York State have tested positive for the novel coronavirus, marking the first confirmed case of the COVID-19 infection in pets in the US, according to health authorities.\nThe US Centers for Disease Control and Prevention (CDC) and the…", "url": "https://kashmirreader.com/2020/04/24/two-pet-cats-test-positive-for-covid19-in-new-york/", "urlToImage": null, "publishedAt": "2020-04-23T19:07:00Z", "content": "NEW YORK: Two cats in New York State have tested positive for the novel coronavirus, marking the first confirmed case of the COVID-19 infection in pets in the US, according to health authorities.The US Centers for Disease Control and Prevention (CDC) and the … [+813 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "According to Researches, Filter Coffee Extends Life, Turkish Coffee Is Harmful To The Heart - Somag News", "description": "In a study conducted by the Swedish University of Gothenburg, it is stated that filter coffee is beneficial to health and can prolong life, but coffee boiled like Turkish coffee increases the risk of heart disease. The results of the research, published in th…", "url": "https://www.somagnews.com/according-researches-filter-coffee-extends-life-turkish-coffee-harmful-heart/", "urlToImage": null, "publishedAt": "2020-04-23T18:26:00Z", "content": "In a study conducted by the Swedish University of Gothenburg, it is stated that filter coffee is beneficial to health and can prolong life, but coffee boiled like Turkish coffee increases the risk of heart disease.\r\nThe results of the research, published in t… [+1203 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Blood Clots a New Surprise Side Effect in Coronavirus Patients | NBC10 Philadelphia - NBC10 Philadelphia", "description": "Doctors are noticing a new trend in COVID-19 patients in the form of blood clots. NBC10’s Matt DeLucia spoke with two local doctors about what they’re seeing...", "url": "https://www.youtube.com/watch?v=t2Bu8mqxwrg", "urlToImage": null, "publishedAt": "2020-04-23T17:56:50Z", "content": "Doctors are noticing a new trend in COVID-19 patients in the form of blood clots. NBC10s Matt DeLucia spoke with two local doctors about what theyre seeing at hospitals. \r\n_____\r\nSUBSCRIBE TO NBC10: VISIT the NBC10 channel for the latest news and exclusive re… [+437 chars]"}, {"source": {"id": null, "name": "Theshillongtimes.com"}, "author": "Agencies", "title": "Most COVID-19 patients put on ventilators in NY died: Study - The Shillong Times", "description": "New York : Researchers have found that nearly all coronavirus (COVID-19) hospitalised patients placed on mechanical ventilators in New York's largest health system have died.For the findings, published in the Journal of the American Medical Associati", "url": "http://theshillongtimes.com/2020/04/24/most-covid-19-patients-put-on-ventilators-in-ny-died-study/", "urlToImage": null, "publishedAt": "2020-04-23T15:19:00Z", "content": "New York : Researchers have found that nearly all coronavirus (COVID-19) hospitalised patients placed on mechanical ventilators in New York’s largest health system have died.\r\nFor the findings, published in the Journal of the American Medical Association, the… [+1709 chars]"}, {"source": {"id": null, "name": "Futurism.com"}, "author": null, "title": "The Coronavirus May Be Doing Something Strange to Your Toes - Futurism", "description": "\"We don’t know for sure if it’s related to COVID-19.\"", "url": "https://futurism.com/neoscope/covid-toes", "urlToImage": null, "publishedAt": "2020-04-23T15:15:48Z", "content": "Health practitioners are noticing a strange new sign that patients could be carrying the coronavirus without symptoms such as a dry cough or fever.\r\nThe media and even some health experts are now referring to the condition as COVID toes mysterious blue or red… [+1419 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "92-year-old woman with one side of body paralysed defeats coronavirus in Pune - Times of India", "description": "PUNE: A 92-year-old Pune resident has recovered from coronavirus infection despite having suffered a stroke seven months ago which left one side of he.", "url": "https://timesofindia.indiatimes.com/city/pune/92-year-old-woman-with-one-side-of-body-paralysed-defeats-coronavirus-in-pune/articleshow/75323751.cms", "urlToImage": null, "publishedAt": "2020-04-23T13:28:43Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Asianage.com"}, "author": "PTI", "title": "Covid-19 may not be sexually transmitted: Study - The Asian Age", "description": "Laboratory tests did not detect SARS-CoV-2 in any of the semen samples, the researchers found", "url": "http://www.asianage.com/life/health/230420/covid-19-may-not-be-sexually-transmitted-study.html", "urlToImage": null, "publishedAt": "2020-04-23T12:15:00Z", "content": "Laboratory tests did not detect SARS-CoV-2 in any of the semen samples, the researchers found Covid-19 is unlikely to be spread through sexual transmission, according to a study that found no evidence of the novel coronavirus in the semen or testes of men.\r\nT… [+3435 chars]"}, {"source": {"id": null, "name": "Newkerala.com"}, "author": null, "title": "We are running out of beds: Doctors in Pakistan plead with govt to enforce stricter Covid-19 lockdown | newkerala.com #71623 - New Kerala", "description": "A group of Karachis leading doctors, belonging to the Pakistan Medical Association PMA, on Wednesday, urged the government and religious leaders to continue...", "url": "https://www.newkerala.com/news/2020/71623.htm", "urlToImage": null, "publishedAt": "2020-04-23T12:14:49Z", "content": "A group of Karachi's leading doctors, belonging to the Pakistan Medical Association (PMA), on Wednesday, urged the government and religious leaders to continue to abide by stricter precautionary measures to control the rapid spread of the highly contagious in… [+3716 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ariana Eunjung Cha", "title": "Coronavirus: 88% of Covid-19 patients on ventilators didn’t survive in New York’s hospital system, study finds - The Independent", "description": "This compares with the roughly 80 per cent of patients who died on ventilators before the pandemic, according to previous studies", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-us-new-york-hospital-ventilator-death-rate-latest-a9479411.html", "urlToImage": null, "publishedAt": "2020-04-23T09:20:00Z", "content": "Throughout March, as the pandemic gained momentum in the United States, much of the preparations focused on the breathing machines that were supposed to save everyones lives.\r\nNew York State Gov. Andrew Cuomo and President Donald Trump sparred over how many v… [+3229 chars]"}, {"source": {"id": null, "name": "Newsd.in"}, "author": "IANS", "title": "COVID-19 may not spread through sperm: Study - Newsd", "description": "New York, April 23 (IANS) The deadly coronavirus is unlikely to spread through sperms, say researchers, adding that they found no evidence of the virus in the samples of semen of men infected with mild-to-moderate COVID-19 disease. It comes as a huge relief a…", "url": "https://newsd.in/covid-19-may-not-spread-through-sperm-study/", "urlToImage": null, "publishedAt": "2020-04-23T08:06:46Z", "content": "New York, April 23 (IANS) The deadly coronavirus is unlikely to spread through sperms, say researchers, adding that they found no evidence of the virus in the samples of semen of men infected with mild-to-moderate COVID-19 disease. It comes as a huge relief a… [+2534 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Aishwarya Dharni", "title": "Doctors Terrified Of Blood Clotting And Thickening Causing Strokes In Coronavirus Patients - India Times", "description": "According to a report by Reuters, doctors at Mount Sinai Hospital in New York City have noticed a brand new thing that takes place in a COVID-19 positive patient's body. As the novel coronavirus spread through New York City in late March, doctors at Mount Sin…", "url": "https://www.indiatimes.com/trending/wtf/doctors-terrified-of-blood-clotting-and-thickening-causing-strokes-in-coronavirus-patients-511563.html", "urlToImage": null, "publishedAt": "2020-04-23T06:50:20Z", "content": "New things about COVID-19 are coming to light each day it seems, and living in a world affected by it, scientists and researchers are only too keen to learn all that they can about it. \r\nAccording to a report byReuters, doctors at Mount Sinai Hospital in New … [+2318 chars]"}]}