{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Aswathi Pacha", "title": "Stop villainising bats, say scientists and conservationists - The Hindu", "description": "The mammals do not spread COVID-19, they say", "url": "https://www.thehindu.com/sci-tech/energy-and-environment/stop-villainising-bats-say-scientists-and-conservationists/article31429962.ece", "urlToImage": null, "publishedAt": "2020-04-25T04:24:55Z", "content": "Unverified news and social media posts linking bats to the COVID-19 outbreak have led to widespread antipathy and there have been increasing incidents of the public destroying bat roosts and smoking them out. To raise awareness, 64 chiropterologists (those wh… [+2199 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Bengaluru hospital to conduct plasma therapy trials on Sat - Daijiworld.com", "description": "", "url": "http://www.daijiworld.com/news/newsDisplay.aspx?newsID=700743", "urlToImage": null, "publishedAt": "2020-04-25T02:32:14Z", "content": "Bengaluru, Apr 25 (IANS): City-based BMC Victoria Hospital is poised to take the first steps in assessing the efficacy of plasma therapy for Covid-19 patients on Saturday, Karnataka Health Minister B. Sriramulu said on Friday.\r\n\"BMC Victoria hospital will tak… [+875 chars]"}, {"source": {"id": null, "name": "Unicef.org"}, "author": null, "title": "Over 13 million children did not receive any vaccines at all even before COVID-19 disrupted global immunization - UNICEF", "description": "Mass measles immunization campaigns suspended in 25 largely high-burden countries due to pandemic", "url": "https://www.unicef.org/press-releases/over-13-million-children-did-not-receive-any-vaccines-all-even-covid-19-disrupted", "urlToImage": null, "publishedAt": "2020-04-25T01:03:21Z", "content": "NEW YORK, 25 April 2020 As the world waits desperately for a vaccine, the COVID-19 pandemic is continuing to surge across the globe. Millions of children are in danger of missing life-saving vaccines against measles, diphtheria and polio due to disruptions in… [+5399 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mysteries remain about coronavirus - ABC News", "description": "Dr. Simone Wiles, an infectious disease physician, joins us to discuss how scientists race to learn more about this deadly virus. ABC News Live Prime, Weekda...", "url": "https://www.youtube.com/watch?v=fLNwkogfNfs", "urlToImage": null, "publishedAt": "2020-04-25T00:46:03Z", "content": "Dr. Simone Wiles, an infectious disease physician, joins us to discuss how scientists race to learn more about this deadly virus.\r\nABC News Live Prime, Weekdays at 7EST &amp; 9EST WATCH the ABC News Live Stream Here: https://www.youtube.com/watch?v=w_Ma8...\r\n… [+234 chars]"}, {"source": {"id": null, "name": "Reliefweb.int"}, "author": null, "title": "World Malaria Day 2020 : Malaria - Status Update on Children (25 April 2020) - World - ReliefWeb", "description": "English News and Press Release on World and 10 other countries about Health, Children and Epidemic; published on 24 Apr 2020 by UNICEF", "url": "https://reliefweb.int/report/world/world-malaria-day-2020-malaria-status-update-children-25-april-2020", "urlToImage": null, "publishedAt": "2020-04-25T00:00:08Z", "content": "Malaria data snapshots\r\nSnapshots from sub-Saharan Africa and added impacts of COVID-19\r\nEvery two minutes, a child under the age of 5 dies from malaria. Under-five children accounted for 67 per cent of all malaria deaths worldwide in 2018. Most of them occur… [+1280 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Today, The U.S. Passed 50000 Deaths Due To COVID-19 | MTP Daily | MSNBC - MSNBC", "description": "Today, the U.S. passed 50,000 deaths due to COVID-19. Chuck Todd says, \"At this rate, in just a few days, more Americans will have died from Coronavirus over...", "url": "https://www.youtube.com/watch?v=1B5UdkzxcbE", "urlToImage": null, "publishedAt": "2020-04-24T23:32:05Z", "content": "Today, the U.S. passed 50,000 deaths due to COVID-19. Chuck Todd says, \"At this rate, in just a few days, more Americans will have died from Coronavirus over a span of roughly 9 weeks than died in the Vietnam War over a span of 12-years.\" Aired on 4/24/2020.»… [+770 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Navy veteran recovering from COVID-19 after spending 18 days on a ventilator - FOX 8 News Cleveland", "description": "For 18 days, Loretta Novitskey sat by her telephone wondering if she would ever be able to talk to the love of her life again.", "url": "https://www.youtube.com/watch?v=KXkTYXP_p98", "urlToImage": null, "publishedAt": "2020-04-24T23:12:17Z", "content": null}, {"source": {"id": null, "name": "Thelancet.com"}, "author": null, "title": "Diagnosing malaria and other febrile illnesses during the COVID-19 pandemic - The Lancet", "description": "As the global malaria community observes World Malaria Day on April 25, 2020, we have\nplenty to celebrate. Yet this year, the coronavirus disease 2019 (COVID-19) outbreak\nis greatly dampening the spirits. While the Asia-Pacific region has made substantial\npro…", "url": "https://www.thelancet.com/journals/langlo/article/PIIS2214-109X(20)30210-2/fulltext", "urlToImage": null, "publishedAt": "2020-04-24T22:33:36Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. By continuing you agree to the use of cookies.\r\nCopyright © 2020 Elsevier Inc. except certain content provided by third parties.\r\nPrivacy Policy   Terms and Conditions"}, {"source": {"id": null, "name": "Wjla.com"}, "author": "SCOTT THUMAN, Sinclair Broadcast Group", "title": "Trump signs relief bill into law as some states begin to reopen parts of their economy - KOMO News", "description": "WASHINGTON (SBG) &mdash; President Donald Trump on Friday signed the latest relief package into law &mdash;a whopping $484 billion to help small businesses, hospitals, and testing.  Video: Sinclair Broadcast Group. At the same time, a handful of states are st…", "url": "http://wjla.com/news/coronavirus/trump-signs-relief-bill-into-law", "urlToImage": null, "publishedAt": "2020-04-24T20:14:00Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "R Sukumar", "title": "Covid-19: What you need to know today - Hindustan Times", "description": "There’s long been a theory that the number of people infected with the Sars-CoV-2 virus, which causes Covid-19, is actually higher than that reported.", "url": "https://www.hindustantimes.com/india-news/covid-19-what-you-need-to-know-today/story-Nv96Urk58r4g4vC43WqwZJ.html", "urlToImage": null, "publishedAt": "2020-04-24T20:07:28Z", "content": "When there is no cure, metrics such as the prevalence of infection and immunity in a population become important.\r\nWhich is why the results of New York’s study of 3,000 people picked at random for an antibody test that were announced on Thursday are being stu… [+3547 chars]"}, {"source": {"id": null, "name": "Theweek.in"}, "author": null, "title": "France limits nicotine sales as researchers test if it 'protects' against COVID-19 - THE WEEK", "description": "Study suggests smokers less likely to catch COVID-19, officials warn of health risk", "url": "https://www.theweek.in/news/health/2020/04/25/france-limits-nicotine-sales-as-researchers-test-if-it-protects-against-covid-19.html", "urlToImage": null, "publishedAt": "2020-04-24T19:57:17Z", "content": "After reports that French researchers were planning clinical trials to see if nicotine patches could help prevent the incidence of COVID-19, following research that showed fewer smokers contracting the disease compared to non-smokers, the French government ha… [+4184 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Oxford University pushing science to the limit in Covid-19 vaccine hunt - India Today", "description": "The British government strongly supports Oxford University’s work, and the first human trials were to start on Thursday, Health Minister Matt Hancock said.", "url": "https://www.indiatoday.in/education-today/news/story/oxford-university-pushing-science-to-the-limit-in-covid-19-vaccine-hunt-1670830-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-24T19:45:14Z", "content": "Oxford University is launching a human trial of a potential coronavirus vaccine, with the daunting aim of making a successful jab available to the public later this year.\r\nOf the more than 100 research projects around the world to find a vaccine -- described … [+3429 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Covid-19: France records 389 new deaths as hospital cases continue to fall - FRANCE 24 English", "description": "France on Friday reported 389 more coronavirus deaths, a lower toll than in previous days, and also welcomed new falls in the number of patients in hospital ...", "url": "https://www.youtube.com/watch?v=VlXP3b86pd0", "urlToImage": null, "publishedAt": "2020-04-24T19:32:42Z", "content": "France on Friday reported 389 more coronavirus deaths, a lower toll than in previous days, and also welcomed new falls in the number of patients in hospital and intensive care.\r\nSubscribe to France 24 now:http://f24.my/youtubeEN\r\nFRANCE 24 live news stream: a… [+261 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Samantha  Black, PhD, The Science Advisory Board staff writer", "title": "Experts discuss promising strategies for tackling SARS-CoV-2 - The Science Board", "description": "What's the best strategy for developing treatments for the SARS-CoV-2 virus? The most promising approaches for a rapid response are antivirals and gene therapy, according to a new review article published April 24 in <em>Frontiers in Microbiology</em>.", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=687", "urlToImage": null, "publishedAt": "2020-04-24T19:24:18Z", "content": "In an unprecedented effort, hundreds of thousands of researchers and clinicians from around the world are fighting against the clock to develop cures, vaccines, and diagnostics for COVID-19, the illness caused by the virus SARS-CoV-2. To date, over 1,650 acad… [+6253 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: Are ventilators the best option for critically ill patients? - Sky News", "description": "Medical professionals are questioning whether ventilators are the best option for treating patients who are in a critical condition. Studies carried out in N...", "url": "https://www.youtube.com/watch?v=DyagCpMX0tE", "urlToImage": null, "publishedAt": "2020-04-24T19:00:34Z", "content": "Medical professionals are questioning whether ventilators are the best option for treating patients who are in a critical condition. Studies carried out in New York in the US and Wuhan in China suggest the current death rate associated with the support system… [+781 chars]"}, {"source": {"id": null, "name": "Greaterkashmir.com"}, "author": null, "title": "Key nose cells identified as likely entry points of coronavirus - Greater Kashmir", "description": "Key nose cells identified as likely entry points of coronavirus Greater Kashmir | Scientists have identified two specific cell types in the nose as likely initial infection points for the novel coronavirus that causes COVID-19. The", "url": "https://www.greaterkashmir.com/news/health/key-nose-cells-identified-as-likely-entry-points-of-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-24T18:39:45Z", "content": null}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Covid-19: Telangana govt shifts focus to three districts, GHMC - Telangana Today", "description": "Hyderabad: The prevalence of coronavirus positive cases is now almost confined to three districts and the Greater Hyderabad Municipal Corporation limits in Telangana, which has given a lot of hope that the spread of Covid-19 can be halted and the situation br…", "url": "https://telanganatoday.com/covid-19-telangana-govt-shifts-focus-to-three-districts-ghmc", "urlToImage": null, "publishedAt": "2020-04-24T18:28:00Z", "content": "Hyderabad: The prevalence of coronavirus positive cases is now almost confined to three districts and the Greater Hyderabad Municipal Corporation limits in Telangana, which has given a lot of hope that the spread of Covid-19 can be halted and the situation br… [+2402 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Sanchita Sharma", "title": "6 vaccines in human trials bring hope of early Covid-19 relief - Hindustan Times", "description": "If the trials are a success, scientists hope to have one million doses ready by September, and to dramatically scale up manufacturing after that.", "url": "https://www.hindustantimes.com/india-news/6-vaccines-in-human-trials-bring-hope-of-early-covid-19-relief/story-visLZbOv8tSYdAjFJZHGDN.html", "urlToImage": null, "publishedAt": "2020-04-24T18:23:28Z", "content": "Human safety trials of a coronavirus vaccine developed by Oxford University began on Thursday even as Indian company Serum Institute of India started work on making the vaccine locally so as to be ready in case the trial succeeds. \r\nThe trial began in Oxford … [+7254 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Matthew Weaver", "title": "Twin sisters, one a nurse in Southampton, two of the latest to die from coronavirus - The Guardian", "description": "Katy and Emma Davis among recent victims, who include a BNP member who found Islam", "url": "https://www.theguardian.com/world/2020/apr/24/twin-sisters-one-a-nurse-in-southampton-two-of-the-latest-to-die-from-coronavirus", "urlToImage": null, "publishedAt": "2020-04-24T18:06:46Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "5 Things in 5 Minutes in Germany - Can Germany endure a second COVID-19 wave? - TRT World", "description": "This week we are looking at: -The possibility of second coronavirus wave with restrictions loosened -Thousands of students sit final exams, social distancing...", "url": "https://www.youtube.com/watch?v=_RdD5uYofW0", "urlToImage": null, "publishedAt": "2020-04-24T17:38:10Z", "content": "This week we are looking at:\r\n-The possibility of second coronavirus wave with restrictions loosened-Thousands of students sit final exams, social distancing challenges arise-German economy experiencing hardest time after World War II-Protesters against lockd… [+508 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Staff Correspondent", "title": "Serum Institute eyes COVID-19 vaccine by October - The Hindu", "description": "It is being developed by University of Oxford; clinical trials in India soon, says CEO.", "url": "https://www.thehindu.com/sci-tech/health/serum-institute-eyes-covid-19-vaccine-by-october/article31427592.ece", "urlToImage": null, "publishedAt": "2020-04-24T17:24:47Z", "content": "City-based Serum Institute of India has said that it expects the vaccine for coronavirus (COVID-19) developed by the University of Oxford in the market by October or November provided the safety and efficacy of the product is established during trials.\r\nState… [+2349 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "#CheckTheFake-25: Use of HCQ for Covid-19 is a stale tale - Northeast Now", "description": "Gaga over the use of hydroxychloroquine (HCQ) for Covid-19 control is unfortunately not an inspiring tale to tell. Hydroxychloroquine is a medication used for prevention and treatment of malaria, rheumatoid arthritis, lupus, and porphyria cutanea tarda. It wa…", "url": "https://nenow.in/health/checkthefake-25-use-of-hcq-for-covid-19-is-a-stale-tale.html/", "urlToImage": null, "publishedAt": "2020-04-24T17:19:50Z", "content": "Gaga over the use of hydroxychloroquine (HCQ) for Covid-19 control is unfortunately not an inspiring tale to tell.\r\nHydroxychloroquine is a medication used for prevention and treatment of malaria, rheumatoid arthritis, lupus, and porphyria cutanea tarda. It w… [+2600 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Does COVID-19 Cause Blood Clot Complications? | NBC New York - NBC New York", "description": "A small study of five critically ill COVID-19 patients at Mount Sinai Hospital in New York City could have major implications for how doctors respond to the ...", "url": "https://www.youtube.com/watch?v=twPd0YvY3T0", "urlToImage": null, "publishedAt": "2020-04-24T17:18:33Z", "content": null}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Covid-19 update: Telangana gets 13 new cases on April 24 - Telangana Today", "description": "Hyderabad: Health authorities on Friday have reported 13 more coronavirus positive cases, which has taken the overall number of positive cases so far to 983 in Telangana. While there are no fatalities related to Covid-19 on Friday, health officials said 29 po…", "url": "https://telanganatoday.com/covid-19-update-telangana-gets-13-new-cases-on-april-24", "urlToImage": null, "publishedAt": "2020-04-24T16:08:08Z", "content": "Hyderabad: Health authorities on Friday have reported 13 more coronavirus positive cases, which has taken the overall number of positive cases so far to 983 in Telangana.\r\nWhile there are no fatalities related to Covid-19 on Friday, health officials said 29 p… [+408 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Tara Parker-Pope", "title": "What’s a Pulse Oximeter, and Do I Really Need One at Home? - The New York Times", "description": "A tiny fingertip device can give you valuable information about your health during a bout of Covid-19 or any respiratory illness.", "url": "https://www.nytimes.com/2020/04/24/well/live/coronavirus-pulse-oximeter-oxygen.html", "urlToImage": null, "publishedAt": "2020-04-24T16:05:24Z", "content": "After working for 10 days at Bellevue Hospital in New York, Dr. Richard Levitan decided to share what he had learned about Covid-19. Too many patients were showing up at the hospital with perilously low oxygen levels, putting them at risk for severe complicat… [+8004 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Italy's coronavirus epidemic began in January, study shows - Economic Times", "description": "Italy began testing people after diagnosing its first local patient on Feb 21 in Codogno, a small town in the wealthy Lombardy region. Cases and deaths immediately surged, with scientists soon suspecting that the virus had been around, unnoticed, for weeks.", "url": "https://economictimes.indiatimes.com/news/international/world-news/italys-coronavirus-epidemic-began-in-january-study-shows/articleshow/75357050.cms", "urlToImage": null, "publishedAt": "2020-04-24T15:22:37Z", "content": "ROME: The first COVID-19 infections in Italy date back to January, according to a scientific study presented on Friday, shedding new light on the origins of the outbreak in one of the world's worst-affected countries.\r\nItaly began testing people after diagnos… [+1636 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Sweden to shut bars and restaurants that ignore coronavirus restrictions - Reuters India", "description": "Sweden warned on Friday it would shut restaurants and bars in the capital that did not comply with guidelines aimed at preventing the spread of the novel coronavirus, amid signs Stockholm residents were beginning to ignore the rules.", "url": "https://in.reuters.com/article/health-coronavirus-sweden-stockholm-idINKCN2262C2", "urlToImage": null, "publishedAt": "2020-04-24T15:05:14Z", "content": "STOCKHOLM (Reuters) - Sweden warned on Friday it would shut restaurants and bars in the capital that did not comply with guidelines aimed at preventing the spread of the novel coronavirus, amid signs Stockholm residents were beginning to ignore the rules. \r\nT… [+2132 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "US records more than 42000 COVID-19 deaths - TVC News Nigeria", "description": "In this interview, Global Affairs Analyst, Collins Nweke, shares his views on the rising number of Coronavirus deaths in the United States. #COVID19Deaths #C...", "url": "https://www.youtube.com/watch?v=9MB0tdiUxb0", "urlToImage": null, "publishedAt": "2020-04-24T15:01:44Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus prevention: How to make your own protective mask - Gulf News", "description": "UAE-based designer Behnood Javaherpour shows how to create your own face mask at home See more videos at https://gulfnews.com/videos Read more Gulf News stor...", "url": "https://www.youtube.com/watch?v=DTyKcdUZCOQ", "urlToImage": null, "publishedAt": "2020-04-24T14:29:30Z", "content": null}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AFP", "title": "Coronavirus vaccine: Monkeys largely protected during trial, says Chinese firm - Livemint", "description": "Sinovac Biotech said it injected two different doses of its vaccine into eight rhesus macaque monkeys and exposed them to the virus three weeks later, and they did not develop infections", "url": "https://www.livemint.com/news/world/coronavirus-vaccine-monkeys-largely-protected-during-trial-says-chinese-firm-11587736770613.html", "urlToImage": null, "publishedAt": "2020-04-24T14:13:47Z", "content": "A novel coronavirus vaccine has for the first time \"largely protected\" monkeys from infection during an animal trial, data from a Chinese pharmaceutical giant showed.It is among a slew of vaccines being developed around the world as countries race to stop an … [+3317 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coming up with COVID-19 vaccine will be very complex - Dr Oyekan - TVC News Nigeria", "description": "In this interview, Dr Oyekan shares his views on the challenges facing health workers who are at the forfront of Coronavirus battle. #DrOyekan #Coronavirus #...", "url": "https://www.youtube.com/watch?v=kd4ET9pB3iY", "urlToImage": null, "publishedAt": "2020-04-24T14:01:34Z", "content": null}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Livemint", "title": "Coronavirus survivor's diary: Life after ventilators can be hell - Livemint", "description": "Three weeks after her release, Diana Aguilar's recovery is mercilessly slow. She still feels weak, with a shortness of breath and vivid nightmares that she’s back in the hospital, tied to the bed, unable to breathe", "url": "https://www.livemint.com/news/world/coronavirus-survivor-s-diary-life-after-ventilators-can-be-hell-11587734690907.html", "urlToImage": null, "publishedAt": "2020-04-24T13:56:03Z", "content": "NEW YORK :\r\nHer fever hit 105 degrees. In her delirium, Diana Aguilar was sure the strangers hovering over her, in their masks and gowns, were angels before they morphed into menacing aliens. As a doctor prepared to slide a ventilator tube down her throat, al… [+13674 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aylin Woodward", "title": "Coronavirus may cause blood clots and strokes, even in young patients - Business Insider - Business Insider", "description": "A New York doctor said there's been an uptick in the number of local young people having strokes. That could be because of COVID-19-related clots.", "url": "https://www.businessinsider.com/coronavirus-blood-clots-strokes-young-patients-2020-4", "urlToImage": null, "publishedAt": "2020-04-24T13:39:31Z", "content": "Doctors treating COVID-19 patients have begun to document ways in which the disease affects far more than just the lungs.\r\nExperts have reported kidney issues, heart problems, and, more recently, blood clots appearing in various parts of patients' bodies. Suc… [+4237 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "New York Times", "title": "Nearly All Patients Hospitalized With Covid-19 Had Chronic Health Issues, Study Finds - Times of India", "description": "A new study of thousands of hospitalized coronavirus patients in the New York City area, the epicenter of the outbr", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/nearly-all-patients-hospitalized-with-covid-19-had-chronic-health-issues-study-finds/articleshow/75347362.cms", "urlToImage": null, "publishedAt": "2020-04-24T13:20:37Z", "content": "A new study of thousands of hospitalized coronavirus patients in the New York City area, the epicenter of the outbreak in the United States, has found that nearly all of them had at least one major chronic health condition, and most 88 percent had at least tw… [+5568 chars]"}, {"source": {"id": null, "name": "Ommcomnews.com"}, "author": "OMMCOM NEWS", "title": "Covid-19 Result Of Crazy Experiments At Wuhan: Russian Scientist - Ommcom News", "description": "A leading microbiologist from Russia has claimed that the novel coronavirus, which originated in China's Wuhan city, is the outcome of \"crazy\" experiments conducted by scientists at the Wuhan Institute of Virology.", "url": "https://www.ommcomnews.com/india-news/covid-19-result-of-crazy-experiments-at-wuhan-russian-scientist", "urlToImage": null, "publishedAt": "2020-04-24T13:12:59Z", "content": "Subscribe\r\nSubscribe to never miss a news \r\nNew Delhi/London: A leading microbiologist from Russia has claimed that the novel coronavirus, which originated in China's Wuhan city, is the outcome of \"crazy\" experiments conducted by scientists at the Wuhan Insti… [+2315 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Gabriella Borter", "title": "On next COVID-19 front line, New York nurse tends to discharged patients at home - Reuters India", "description": "Nurse Flora Ajayi parks her car on a residential block in Queens, New York and pops open the trunk, revealing plastic bins full of personal protective gear. She dons gloves, a blue gown, two masks, a face shield and shoe covers and turns to enter the home of …", "url": "https://in.reuters.com/article/health-coronavirus-usa-homecare-feature-idINKCN2261KR", "urlToImage": null, "publishedAt": "2020-04-24T13:04:49Z", "content": "(Reuters) - Nurse Flora Ajayi parks her car on a residential block in Queens, New York and pops open the trunk, revealing plastic bins full of personal protective gear. She dons gloves, a blue gown, two masks, a face shield and shoe covers and turns to enter … [+5085 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "Key nose cells identified as likely entry points of novel coronavirus - Livemint", "description": "The identification of these cells could help explain the high transmission rate of Covid-19.The researchers looked for which individual cells expressed both of two key entry proteins that are used by the Covid-19 virus to infect our cells", "url": "https://www.livemint.com/science/health/key-nose-cells-identified-as-likely-entry-points-of-novel-coronavirus-11587731023526.html", "urlToImage": null, "publishedAt": "2020-04-24T12:40:00Z", "content": "LONDON :\r\nScientists have identified two specific cell types in the nose as likely initial infection points for the novel coronavirus that causes COVID-19.The researchers, including those from the Wellcome Sanger Institute in the UK and University Medical Cen… [+2481 chars]"}, {"source": {"id": null, "name": "Newkerala.com"}, "author": null, "title": "Evidence suggests COVID-19 isnt sexually transmitted - New Kerala", "description": "COVID-19 is unlikely to be spread through semen, suggests a new study conducted by the scientists of the University of Utah....", "url": "https://www.newkerala.com/news/2020/72225.htm", "urlToImage": null, "publishedAt": "2020-04-24T12:02:00Z", "content": "The study was published in the journal - Fertility and Sterility. Chinese men who recently had the disease were examined for conducting the study. The researchers found no evidence of the virus that causes COVID-19 in the semen or testes of the men.\r\nThe stud… [+3437 chars]"}, {"source": {"id": null, "name": "Socialnews.xyz"}, "author": null, "title": "Key nose cells identified as entry points for corona: Study - SocialNews.XYZ", "description": "London, April 24 (SocialNews.XYZ) Researchers have discovered that goblet and ciliated cells in the nose have high levels of the entry proteins that the COVID-19 coronavirus uses to get into our cells. The identification of... - Social News XYZ", "url": "https://www.socialnews.xyz/2020/04/24/key-nose-cells-identified-as-entry-points-for-corona-study/", "urlToImage": null, "publishedAt": "2020-04-24T11:55:08Z", "content": "Home » General » Health » Key nose cells identified as entry points for corona: Study\r\nLondon, April 24 (SocialNews.XYZ) Researchers have discovered that goblet and ciliated cells in the nose have high levels of the entry proteins that the COVID-19 coronaviru… [+2630 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Vinod Rathore", "title": "Blood thickening, clots in covid-19 patients alarm doctors - News Track English", "description": "New York: A new news related to the corona virus has shocked doctors. This virus is now clotting the blood of the body of the infected. Nephrologists at Mount Sinai Hospital in New York, New York, USA have found that blood is also accumulating in the kidneys …", "url": "https://english.newstracklive.com/news/blood-blockage-in-body-of-corona-patients-says-doctors-mc24-nu764-ta272-1087286-1.html", "urlToImage": null, "publishedAt": "2020-04-24T11:31:04Z", "content": null}, {"source": {"id": null, "name": "Edexlive.com"}, "author": "Edex Live", "title": "Dietary supplements important weapon for fighting off COVID-19, say researchers - EdexLive", "description": "In particular vitamin C, vitamin D, zinc, and an omega-3 fatty acid found in fish, docosahexaenoic acid, also known as DHA, are critical for immune function", "url": "https://www.edexlive.com/news/2020/apr/24/dietary-supplements-important-weapon-for-fighting-off-covid-19-say-researchers-11557.html", "urlToImage": null, "publishedAt": "2020-04-24T11:08:04Z", "content": "Supplements containing vitamins C and D and other micronutrients are a safe, effective and low-cost means of helping your immune system fight off COVID-19 and other acute respiratory tract diseases, say researchers.\r\nAccording to the study, published in the j… [+2042 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Kansas City area doctors among first in Midwest to use plasma treatment for COVID-19 patients - KCTV5 News", "description": "There was a new sign of progress in the battle against the coronavirus Monday as physicians with Research and Menorah Medical Centers became some of the firs...", "url": "https://www.youtube.com/watch?v=UPcqgICEmbY", "urlToImage": null, "publishedAt": "2020-04-24T10:05:09Z", "content": "There was a new sign of progress in the battle against the coronavirus Monday as physicians with Research and Menorah Medical Centers became some of the first in the Midwest to transfuse plasma from a recovered patient into one who's critically ill."}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Saliva droplets, vectors of Sars-Cov-2 transmission | AFP Animé - AFP News Agency", "description": "COVID-19 is transmitted is mostly by saliva droplets... these vectors of the disease are expelled from the moist areas of the respiratory tract and throat wh...", "url": "https://www.youtube.com/watch?v=77nsWZSMAk4", "urlToImage": null, "publishedAt": "2020-04-24T09:54:28Z", "content": "COVID-19 is transmitted is mostly by saliva droplets... these vectors of the disease are expelled from the moist areas of the respiratory tract and throat when we cough or sneeze and - potentially in smaller quantities - when we speak.\r\nSubscribe to AFP and a… [+89 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Pune Mirror", "title": "India may see second wave of COVID-19 outbreak in monsoon, say scientists - Pune Mirror", "description": "A study published in The Lancet journal earlier this month modelled the potential adverse consequences of premature relaxation of interventions, and found it might lead to a second wave of infections", "url": "https://punemirror.indiatimes.com/news/india/covid-19-india-may-see-second-wave-of-outbreak-in-monsoon-say-scientists/articleshow/75347662.cms", "urlToImage": null, "publishedAt": "2020-04-24T09:37:00Z", "content": "The trajectory of COVID-19\r\n cases could have plateaued and might even fall for some weeks after the lockdown\r\n is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say scientists\r\n.… [+6693 chars]"}, {"source": {"id": null, "name": "Selectscience.net"}, "author": "SelectScience", "title": "Pfizer, BioNTech COVID-19 vaccine cleared for human tests - SelectScience", "description": "Pfizer and BioNTech to start human trials of COVID-19 vaccine", "url": "https://www.selectscience.net/industry-news/pfizer-and-biontech-to-start-human-trials-of-covid-19-vaccine/?artID=51330", "urlToImage": null, "publishedAt": "2020-04-24T09:09:30Z", "content": null}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "PTI", "title": "COVID-19: Medico designs face shield from overhead projector sheets - The New Indian Express", "description": "After testing the in-house produced shields for factors like comfort and clarity among others, the prototype was approved and 1,000 units were made.", "url": "https://www.newindianexpress.com/nation/2020/apr/24/covid-19-medico-designs-face-shield-from-overhead-projector-sheets-2134683.html", "urlToImage": null, "publishedAt": "2020-04-24T08:47:00Z", "content": "MUMBAI: When the coronavirus pandemic hit Mumbai and medical workers appeared clueless how to treat patients by ensuring their own safety, an enterprising female medical practitioner found a solution by designing a face shield made out of overhead projector s… [+3337 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "IANS", "title": "Novel Coronavirus Has Natural Origin; Not Constructed in Laboratory: WHO - The Weather Channel", "description": "The virus has an ecological origin in bat populations, but the intermediate animal host has not been identified yet, says the WHO.", "url": "https://weather.com/en-IN/india/coronavirus/news/2020-04-24-novel-coronavirus-natural-animal-origin-constructed-laboratory", "urlToImage": null, "publishedAt": "2020-04-24T07:57:07Z", "content": "All available evidence to date suggests that the novel coronavirus has a natural animal origin, and was not a manipulated or constructed virus, the World Health Organization (WHO) said.\r\n\"Many researchers have been able to look at the genomic features of SARS… [+1093 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "COVID: Max hospital group to study use of HCQ among healthcare workers - Livemint", "description": "The large-scale observational study will involve use of hydroxychloroquine prophylaxis among its healthcare workers.This is the first study involving COVID-19 that has been approved by ICMR", "url": "https://www.livemint.com/news/india/covid-max-hospital-group-to-study-use-of-hcq-among-healthcare-workers-11587698913597.html", "urlToImage": null, "publishedAt": "2020-04-24T03:56:25Z", "content": "NEW DELHI :\r\nAmid rising number of coronavirus cases in the country, a private hospital group on Thursday announced that it will conduct a large-scale observational study involving the use of hydroxychloroquine (HCQ) prophylaxis among its healthcare workers, … [+2088 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Death rewrites timeline of US COVID-19 outbreak | WNT - ABC News", "description": "Patricia Dowd, 57, died in Santa Clara County, California, in February, three weeks before the first documented coronavirus death in the U.S. WATCH THE FULL ...", "url": "https://www.youtube.com/watch?v=pzTtusYk1p0", "urlToImage": null, "publishedAt": "2020-04-23T23:46:51Z", "content": "Patricia Dowd, 57, died in Santa Clara County, California, in February, three weeks before the first documented coronavirus death in the U.S.\r\nWATCH THE FULL EPISODE OF 'WORLD NEWS TONIGHT':https://bit.ly/2Kul5An\r\nWATCH OTHER FULL EPISODES OF WORLD NEWS TONIG… [+139 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "CDC Director Clarifies Coronavirus Comments - HuffPost", "description": "President Donald Trump said Dr. Robert Redfield was misquoted about the coronavirus resurging in the fall, but the CDC director said his interview with The W...", "url": "https://www.youtube.com/watch?v=XhPtzNbO8iI", "urlToImage": null, "publishedAt": "2020-04-23T21:33:39Z", "content": "President Donald Trump said Dr. Robert Redfield was misquoted about the coronavirus resurging in the fall, but the CDC director said his interview with The Washington Post was accurate. \r\nSubscribe to HuffPost today: http://goo.gl/xW6HGSupport our work: https… [+134 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "Most NYC Virus Patients Had Underlying Health Issues, Study Shows - The Epoch Times", "description": "Most patients in New York City hospitalized with the CCP virus suffered from at least one underlying health issue, such as obesity or kidney disease.", "url": "https://www.theepochtimes.com/most-new-york-virus-patients-had-underlying-health-issue-study_3324097.html", "urlToImage": null, "publishedAt": "2020-04-23T21:17:16Z", "content": "Most patients in New York City hospitalized with the CCP virus suffered from one or more underlying health issues, such as obesity or kidney disease, according to a new study.\r\nResearchers analyzed records from 5,700 patients and found more than 56 percent su… [+3603 chars]"}, {"source": {"id": null, "name": "Boston25news.com"}, "author": "Debbie Lord, Cox Media Group National Content Desk", "title": "Coronavirus: Are blood clots killing COVID-19 patients? - Boston 25 News", "description": "According to reports from doctors across the country and around the world, some patients infected with the new coronavirus appear to be developing blood clots primarily in their lungs and legs.", "url": "https://www.boston25news.com/news/trending/coronavirus-are-blood-clots-killing-covid-19-patients/UAH5GS4WK5FPJFP7YUHPYT2ZIQ/", "urlToImage": null, "publishedAt": "2020-04-23T19:20:55Z", "content": "Physicians on the front line of coronavirus treatment are seeing a new and alarming symptom among patients infected with the COVID-19 virus.\r\nAccording to reports from doctors across the country and around the world, some patients infected with the new corona… [+4405 chars]"}, {"source": {"id": null, "name": "Kashmirreader.com"}, "author": "Press Trust of India", "title": "Two pet cats test positive for Covid19 in New York - Kashmir Reader", "description": "NEW YORK: Two cats in New York State have tested positive for the novel coronavirus, marking the first confirmed case of the COVID-19 infection in pets in the US, according to health authorities.\nThe US Centers for Disease Control and Prevention (CDC) and the…", "url": "https://kashmirreader.com/2020/04/24/two-pet-cats-test-positive-for-covid19-in-new-york/", "urlToImage": null, "publishedAt": "2020-04-23T19:07:00Z", "content": "NEW YORK: Two cats in New York State have tested positive for the novel coronavirus, marking the first confirmed case of the COVID-19 infection in pets in the US, according to health authorities.The US Centers for Disease Control and Prevention (CDC) and the … [+813 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "According to Researches, Filter Coffee Extends Life, Turkish Coffee Is Harmful To The Heart - Somag News", "description": "In a study conducted by the Swedish University of Gothenburg, it is stated that filter coffee is beneficial to health and can prolong life, but coffee boiled like Turkish coffee increases the risk of heart disease. The results of the research, published in th…", "url": "https://www.somagnews.com/according-researches-filter-coffee-extends-life-turkish-coffee-harmful-heart/", "urlToImage": null, "publishedAt": "2020-04-23T18:26:00Z", "content": "In a study conducted by the Swedish University of Gothenburg, it is stated that filter coffee is beneficial to health and can prolong life, but coffee boiled like Turkish coffee increases the risk of heart disease.\r\nThe results of the research, published in t… [+1203 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "The Hans India", "title": "Coronavirus may not be sexually transmitted - The Hans India", "description": "COVID-19 is unlikely to be spread through sexual transmission, according to a study that found no...", "url": "https://www.thehansindia.com/life-style/health/coronavirus-may-not-be-sexually-transmitted-618880", "urlToImage": null, "publishedAt": "2020-04-23T18:13:13Z", "content": "COVID-19 is unlikely to be spread through sexual transmission, according to a study that found no evidence of the novel coronavirus in the semen or testes of men. The study, published in the journal Fertility &amp; Sterility, was not comprehensive enough to f… [+1555 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Blood Clots a New Surprise Side Effect in Coronavirus Patients | NBC10 Philadelphia - NBC10 Philadelphia", "description": "Doctors are noticing a new trend in COVID-19 patients in the form of blood clots. NBC10’s Matt DeLucia spoke with two local doctors about what they’re seeing...", "url": "https://www.youtube.com/watch?v=t2Bu8mqxwrg", "urlToImage": null, "publishedAt": "2020-04-23T17:56:50Z", "content": "Doctors are noticing a new trend in COVID-19 patients in the form of blood clots. NBC10s Matt DeLucia spoke with two local doctors about what theyre seeing at hospitals. \r\n_____\r\nSUBSCRIBE TO NBC10: VISIT the NBC10 channel for the latest news and exclusive re… [+437 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Kalyan Ray", "title": "50-yr-old bacteria drug makes a comeback in fight against coronavirus - Deccan Herald", "description": "A medicinally useful microbe discovered by an Indian biologist half-a-century ago has made a comeback in India’s fight against coronavirus as the Council of Scientific and Industrial Research is set to start three clinical trials with a medicine containing an…", "url": "https://www.deccanherald.com/science-and-environment/50-yr-old-bacteria-drug-makes-a-comeback-in-fight-against-coronavirus-829105.html", "urlToImage": null, "publishedAt": "2020-04-23T17:39:16Z", "content": "The first trial would be on 50 critically-ill COVID-19 patients to check whether the intra-venous drug Sepsivac used against sepsis or blood poisoning - can reduce mortality.\r\nTrack live updates on coronavirus here\r\nThe second trial would on about 500 asympto… [+2517 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Joshua Nelson", "title": "NYC doctor reacts to study showing most NY coronavirus patients had underlying issue - Fox News", "description": "Dr. Craig Spencer reacted Thursday on “America’s Newsroom” to a new study revealing that most of the people in New York City who were hospitalized due to coronavirus had one or more underlying health issues.", "url": "https://www.foxnews.com/media/nyc-doctor-patients-covid-underlying-issues", "urlToImage": null, "publishedAt": "2020-04-23T16:37:37Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nDr. Craig Spencer reacted Thursday on “America’s Newsroom” to a new study revealing that most of the people in New York City who were hospitalized due to coronavirus… [+3065 chars]"}, {"source": {"id": null, "name": "Menshealth.com"}, "author": "Philip Ellis", "title": "Doctors Warn COVID-19 Can Cause Sudden Strokes in People Under 50 - menshealth.com", "description": "Coronavirus has been linked to blood clots in age groups previously not deemed at risk.", "url": "https://www.menshealth.com/health/a32253678/coronavirus-covid-19-sudden-stroke-young-patients/", "urlToImage": null, "publishedAt": "2020-04-23T16:34:00Z", "content": "Medics in New York City have reported that people in their 30s and 40s who were previously not deemed at-risk during the coronavirus pandemic may in fact be vulnerable to sudden strokes. COVID-19 has recently been thought to cause increased blood clotting, wh… [+1675 chars]"}, {"source": {"id": null, "name": "Latestly.com"}, "author": "PTI", "title": "Coronavirus Does Not Spread Through Sex? Study Finds No COVID-19 Traces in Semen Tests of Patients, But - LatestLY", "description": "According to a study that found no evidence of the novel coronavirus in the semen or testes of men, covid-19 may not spread through sex. The study, published in the journal Fertility &amp; Sterility, was not comprehensive enough to fully rule out the possibil…", "url": "https://www.latestly.com/lifestyle/health-wellness/coronavirus-does-not-spread-through-sex-study-finds-no-covid-19-traces-in-semen-tests-of-patients-but-does-not-completely-rule-out-sexual-transmission-1703310.html", "urlToImage": null, "publishedAt": "2020-04-23T14:50:22Z", "content": "Washington, Apr 23: COVID-19 is unlikely to be spread through sexual transmission, according to a study that found no evidence of the novel coronavirus in the semen or testes of men. The study, published in the journal Fertility &amp; Sterility, was not compr… [+3562 chars]"}, {"source": {"id": null, "name": "Aninews.in"}, "author": null, "title": "45 COVID-19 patients in Vadodara recover - ANI News", "description": "Vadodara (Gujarat) [India], April 23 (ANI): 45 persons who had tested positive for COVID-19 were discharged today from a quarantine centre here after recovering.", "url": "https://www.aninews.in/news/national/general-news/45-covid-19-patients-in-vadodara-recover20200423201102", "urlToImage": null, "publishedAt": "2020-04-23T14:41:00Z", "content": "ANI | Updated: Apr 23, 2020 20:11 IST\r\nVadodara (Gujarat) [India], April 23 (ANI): 45 persons who had tested positive for COVID-19 were discharged today from a quarantine centre here after recovering.\"45 people who had tested positive for COVID-19, were disch… [+627 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "92-year-old woman with one side of body paralysed defeats coronavirus in Pune - Times of India", "description": "PUNE: A 92-year-old Pune resident has recovered from coronavirus infection despite having suffered a stroke seven months ago which left one side of he.", "url": "https://timesofindia.indiatimes.com/city/pune/92-year-old-woman-with-one-side-of-body-paralysed-defeats-coronavirus-in-pune/articleshow/75323751.cms", "urlToImage": null, "publishedAt": "2020-04-23T13:28:43Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "COVID-19 may not be sexually transmitted: Study - Daily Pioneer", "description": "COVID-19 is unlikely to be spread through sexual transmission, according to a study that found no evidence of the novel coronavirus in the semen or testes of men.\n\nThe study, published in the journal Fertility &amp; Sterility, was not comprehensive enough to …", "url": "https://www.dailypioneer.com/2020/pioneer-health/covid-19-may-not-be-sexually-transmitted--study.html", "urlToImage": null, "publishedAt": "2020-04-23T10:08:50Z", "content": "COVID-19 is unlikely to be spread through sexual transmission, according to a study that found no evidence of the novel coronavirus in the semen or testes of men.\r\nThe study, published in the journal Fertility &amp; Sterility, was not comprehensive enough to … [+3333 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ariana Eunjung Cha", "title": "Coronavirus: 88% of Covid-19 patients on ventilators didn’t survive in New York’s hospital system, study finds - The Independent", "description": "This compares with the roughly 80 per cent of patients who died on ventilators before the pandemic, according to previous studies", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-us-new-york-hospital-ventilator-death-rate-latest-a9479411.html", "urlToImage": null, "publishedAt": "2020-04-23T09:20:00Z", "content": "Throughout March, as the pandemic gained momentum in the United States, much of the preparations focused on the breathing machines that were supposed to save everyones lives.\r\nNew York State Gov. Andrew Cuomo and President Donald Trump sparred over how many v… [+3229 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "David Aaro", "title": "Blood clotting seen as additional threat for coronavirus patients: report - Fox News", "description": "Doctors are beginning to notice that blood clots could be another troubling complication for patients who are hospitalized with coronavirus.", "url": "https://www.foxnews.com/health/blood-clotting-seen-possible-threat-coronavirus-patients", "urlToImage": null, "publishedAt": "2020-04-23T08:48:35Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here. \r\nDoctors are beginning to notice that blood clots could be another troubling complication for patients who are hospitalized with coronavirus.\r\nThe clots present the … [+2762 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Maeve Campbell", "title": "How can you boost your immune system during the COVID-19 pandemic? - Euronews", "description": "Consultant Dietitian and Nutritionist Paula Mee tells us which foods to stock up on and which to avoid.", "url": "https://www.euronews.com/living/2020/04/23/how-can-you-boost-your-immune-system-during-the-covid-19-pandemic", "urlToImage": null, "publishedAt": "2020-04-23T07:42:39Z", "content": "Our immune systems do a remarkable job at fighting off foreign cells to protect us against illness. Varying factors are at play, such as age, which determine how resilient this defence system will be. Naturally, when a global health pandemic strikes, we’re bo… [+7093 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Anushree Gupta", "title": "Coronavirus may cause sudden strokes in young people - The physical implications of poor mental health - Times Now", "description": "Doctors have found a seven-fold increase in the reported cases of strokes among young adults, due to COVID-19.", "url": "https://www.timesnownews.com/health/article/coronavirus-may-cause-sudden-strokes-in-young-people-the-physical-implications-of-poor-mental-health/581852", "urlToImage": null, "publishedAt": "2020-04-23T06:51:14Z", "content": "<ul><li>The coronavirus outbreak has affected more than 2.5 million people worldwide </li><li>According to recent reports, the coronavirus infection can attack blood vessels, and cause damage to your heart, kidneys, liver, etc as well</li><li>According to doc… [+2579 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Aishwarya Dharni", "title": "Doctors Terrified Of Blood Clotting And Thickening Causing Strokes In Coronavirus Patients - India Times", "description": "According to a report by Reuters, doctors at Mount Sinai Hospital in New York City have noticed a brand new thing that takes place in a COVID-19 positive patient's body. As the novel coronavirus spread through New York City in late March, doctors at Mount Sin…", "url": "https://www.indiatimes.com/trending/wtf/doctors-terrified-of-blood-clotting-and-thickening-causing-strokes-in-coronavirus-patients-511563.html", "urlToImage": null, "publishedAt": "2020-04-23T06:50:20Z", "content": "New things about COVID-19 are coming to light each day it seems, and living in a world affected by it, scientists and researchers are only too keen to learn all that they can about it. \r\nAccording to a report byReuters, doctors at Mount Sinai Hospital in New … [+2318 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "A herd immunity strategy could actually work in youthful India - Economic Times", "description": "The herd strategy would allow a majority of the population to gain resistance to coronavirus.", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/a-herd-immunity-strategy-could-actually-work-in-youthful-india/articleshow/75285241.cms", "urlToImage": null, "publishedAt": "2020-04-23T04:07:00Z", "content": "By Ari AltstedterControversial given the high risk of deaths, a coronavirus strategy discarded by the U.K. is being touted as the solution for poor but young countries like India.\r\nThe herd immunity strategy, which would allow a majority of the population to … [+6875 chars]"}]}