{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Boomlive.in"}, "author": "AFP", "title": "No, Flu Vaccines Do Not Make People Vulnerable To Infections - BOOM", "description": "An image of an article falsely claiming that flu vaccines make people vulnerable to infections have...", "url": "https://www.boomlive.in/world/no-flu-vaccines-do-not-make-people-vulnerable-to-infections-8044", "urlToImage": "https://www.boomlive.in/h-upload/2020/05/11/921321-afp0101.jpg", "publishedAt": "2020-05-11T14:25:20Z", "content": "An image purportedly showing an article about flu vaccination has been shared hundreds of times in multiple posts on Facebook and Twitter posts alongside a claim that flu vaccines can make people more vulnerable to infections. The posts, shared in May 2020 du… [+5227 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Gabby Landsverk", "title": "Vitamin D deficiency may be tied to a higher risk of severe coronavirus infection - Insider - INSIDER", "description": "New research suggests lower levels of vitamin D could be tied to a higher risk of coronavirus complications.", "url": "https://www.insider.com/vitamin-d-deficiency-may-be-linked-more-severe-coronavirus-2020-5", "urlToImage": "https://i.insider.com/5eb9562d42278d6ca300cff3?width=1200&format=jpeg", "publishedAt": "2020-05-11T13:53:57Z", "content": "If you're looking for ways to protect yourself against the coronavirus, new research suggests that getting plenty of vitamin D could help. \r\nTwo new studies have linked vitamin D deficiency with coronavirus risks, suggesting that not having enough of the nutr… [+4376 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "William Schomberg", "title": "Low-skilled men suffer highest COVID fatalities in England and Wales - Reuters India", "description": "Men in the lowest-skilled jobs have the highest death rates involving COVID-19 among working-age people, according to data for England and Wales that also showed fatalities among nurses and doctors were no higher than the average.", "url": "https://in.reuters.com/article/us-health-coronavirus-britain-occupation-idINKBN22N1AL", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200511&t=2&i=1518184685&w=1200&r=LYNXMPEG4A0V0", "publishedAt": "2020-05-11T13:46:38Z", "content": "LONDON (Reuters) - Men in the lowest-skilled jobs have the highest death rates involving COVID-19 among working-age people, according to data for England and Wales that also showed fatalities among nurses and doctors were no higher than the average. \r\nMonday’… [+2575 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Coronavirus Outbreak: How did the previous pandemics end? When will we know that it is over? - Firstpost", "description": "An end can occur not because a disease is defeated but because people grow tired of the panic and learn to live with it.", "url": "https://www.firstpost.com/health/coronavirus-outbreak-how-did-the-previous-pandemics-end-when-will-we-know-that-it-is-over-8356321.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/05/virus-1.jpg", "publishedAt": "2020-05-11T13:36:06Z", "content": null}, {"source": {"id": null, "name": "Deccanchronicle.com"}, "author": "T.S.S. Siddharth", "title": "The other side of Covid: 600 kg of biomedical waste nobody should touch ever again - Deccan Chronicle", "description": "The BMW generated each day also includes other wastes generated in the process of treating the coronavirus victims at the two hospitals", "url": "https://www.deccanchronicle.com/science/science/110520/the-other-side-of-covid-600-kg-of-biomedical-waste-nobody-should-touc.html", "urlToImage": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-gccnvgfe8rcrefcdu5a1jpqr94-20200511181802.Medi.jpeg", "publishedAt": "2020-05-11T12:52:00Z", "content": "Hyderabad: All the masks, PPEs, gloves discarded after use at the two Covid-19 designated hospitals in Hyderabad, Gandhi Hospital and Fever Hospital, are amounting to as much as 600 kg of biomedical waste (BMW) everyday.\r\nThe BMW generated each day also inclu… [+2037 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Times Now Digital", "title": "A mysterious illness linked to coronavirus is affecting children: How worried should you be for your child? - Times Now", "description": "Pediatric multisystem inflammatory syndrome has symptoms similar to Kawasaki disease, which usually attacks children. Kawasaki disease leads to inflammation in the walls of medium-sized arteries.", "url": "https://www.timesnownews.com/international/article/a-mysterious-illness-linked-to-coronavirus-is-affecting-children-how-worried-should-you-be-for-your-child/590294", "urlToImage": "https://imgk.timesnownews.com/story/Coronavirus_kids_pit.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-11T12:42:26Z", "content": "<ul><li>In the past week, more troubling reports are coming in, again mainly from the US, and more specifically New York, the hardest-hit state in America</li><li>Dozens of children have reported sick from a mysterious illness linked to the coronavirus and, t… [+3836 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Dr. Kamal Kant Kohli", "title": "Healthier eating behaviors early in life reduce risk of obesity and CVD later: AHA - Medical Dialogues", "description": "DALLAS — American Heart Association has issued a new scientific statement aboutCaregiver Influences...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/healthier-eating-behaviors-early-in-life-reduce-risk-of-obesity-and-cvd-later-aha-65668", "urlToImage": "https://medicaldialogues.in/h-upload/2020/03/04/125172-childhood-obesity.jpg", "publishedAt": "2020-05-11T11:41:34Z", "content": "DALLAS American Heart Association has issued a new scientific statement about\"Caregiver Influences on Eating Behaviors in Young Children,\" that has been published in the Journal of the American Heart Association.\r\nHealthy food choices has been linked to bette… [+6173 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Even animals benefit from social distancing to prevent disease - Telangana Today", "description": "New York: Researchers have uncovered fresh evidence about the importance of maintaining physical distance to minimise the spread of microbes among individuals. Microorganisms living inside and on our body play a crucial role in both the maintenance of our hea…", "url": "https://telanganatoday.com/even-animals-benefit-from-social-distancing-to-prevent-disease", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2020/05/Monkeys.jpg", "publishedAt": "2020-05-11T11:33:18Z", "content": "New York: Researchers have uncovered fresh evidence about the importance of maintaining physical distance to minimise the spread of microbes among individuals.\r\nMicroorganisms living inside and on our body play a crucial role in both the maintenance of our he… [+2360 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "High enzyme levels make men more vulnerable to COVID-19: Report - Al Jazeera English", "description": "Study, which does not include COVD-19 patients, suggests key receptor on surface of cells more diffused in men.", "url": "https://www.aljazeera.com/news/2020/05/high-enzyme-levels-men-vulnerable-covid-19-report-200511081359742.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/5/11/fa2cc697408e4406bc367f84845bbfb4_18.jpg", "publishedAt": "2020-05-11T11:27:39Z", "content": "The level of a key enzyme used by the new coronavirus to infect cells is higher in men's blood than women's, a new study has found.\r\nIn most countries, the number of deaths from the new coronavirus among men is higher than women. \r\nMore:\r\nThe discrepancy was … [+2211 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "Commendable that India has been able to keep COVID-19 cases low compared to other nations: WHO’s chief scientist - The Hindu", "description": "Dr. Soumya Swaminathan said the whole world has to be prepared for the ongoing transmission of infection for ‘many many months and for perhaps years to come’", "url": "https://www.thehindu.com/news/national/commendable-that-india-has-been-able-to-keep-covid-19-cases-low-compared-to-other-nations-whos-chief-scientist/article31557382.ece", "urlToImage": "https://www.thehindu.com/news/national/k9uu9o/article31557381.ece/ALTERNATES/LANDSCAPE_615/SOUMYASWAMINATHANKB", "publishedAt": "2020-05-11T11:16:28Z", "content": "World Health Organisations (WHO) Chief Scientist Dr. Soumya Swaminathan on Monday commended India for keeping the coronavirus cases and deaths very low compared to other countries and said it will play an important role in the development of a vaccine for COV… [+2814 chars]"}, {"source": {"id": null, "name": "Newsjok.com"}, "author": "sourav chowdhury", "title": "Coronavirus Outbreak: What lessons can our battle with malaria teach us about tackling COVID-19? - Newsjok", "description": "The novel coronavirus presents a novel problem to India's policymakers and public well being professionals. As they face tough decisions within the coming months, they can draw lessons from India's current success in opposition to malaria. Three elements are …", "url": "https://newsjok.com/coronavirus-outbreak-what-lessons-can-our-battle-with-malaria-teach-us-about-tackling-covid-19-firstpost/", "urlToImage": "https://newsjok.com/wp-content/uploads/2020/05/Coronavirus-Outbreak-As-India-extends-lockdown-health-experts-question-lack.jpeg", "publishedAt": "2020-05-11T11:13:25Z", "content": "The novel coronavirus presents a novel problem to India’s policymakers and public well being professionals. As they face tough decisions within the coming months, they can draw lessons from India’s current success in opposition to malaria. Three elements are … [+6024 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "'Unwarranted' to think COVID-19 will vanish down the summer, says Indian virologist - Deccan Herald", "description": "While the possibility for reduced spread of SARS-CoV-2 due to hot weather cannot be ruled out, it will be unwarranted to assume that COVID-19 will vanish during the summer, according to an Indian virologist. The arrival of summer in India may have raised hope…", "url": "https://www.deccanherald.com/science-and-environment/unwarranted-to-think-covid-19-will-vanish-during-the-summer-says-indian-virologist-836287.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/11/file7agx38c01eg105koz2wm-1589195750.jpg", "publishedAt": "2020-05-11T11:07:45Z", "content": "While the possibility for reduced spread of SARS-CoV-2 due to hot weather cannot be ruled out, it will be unwarranted to assume that COVID-19 will vanish during the summer, according to an Indian virologist.\r\nThe arrival of summer in India may have raised hop… [+5261 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Coronavirus treatment: New drug combination to speed up recovery for patients; check details - The Financial Express", "description": "With the number of Coronavirus infected patients on rise, health experts worldwide are experimenting different combinations of drugs to treat the deadly virus.", "url": "https://www.financialexpress.com/lifestyle/health/coronavirus-treatment-new-drug-combination-to-speed-up-recovery-for-patients-check-details/1955225/", "urlToImage": "https://images.financialexpress.com/2020/05/coronavirus-660-7.jpg", "publishedAt": "2020-05-11T11:05:21Z", "content": "Fighting COVID-19: With the number of Coronavirus infected patients on rise, health experts worldwide are experimenting different combinations of drugs to treat the deadly virus. A recent study published in The Lancet journal has highlighted that Remdesivir w… [+1914 chars]"}, {"source": {"id": null, "name": "Who.int"}, "author": "World Health Organization: WHO", "title": "WHO statement: Tobacco use and COVID-19 - World Health Organization", "description": "<p>Tobacco kills more than 8 million people globally every year. More than 7 million of these deaths are from direct tobacco use and around 1.2 million are due to non-smokers being exposed to second-hand smoke. </p><p>Tobacco smoking is a known risk factor fo…", "url": "https://www.who.int/news-room/detail/11-05-2020-who-statement-tobacco-use-and-covid-19", "urlToImage": "https://www.who.int/images/default-source/infographics/tobacco/tobacco.tmb-1200v.jpg?Culture=en&sfvrsn=a48c1b33_1", "publishedAt": "2020-05-11T10:23:01Z", "content": "Tobacco kills more than 8 million people globally every year. More than 7 million of these deaths are from direct tobacco use and around 1.2 million are due to non-smokers being exposed to second-hand smoke. \r\nTobacco smoking is a known risk factor for many r… [+6563 chars]"}, {"source": {"id": null, "name": "Devdiscourse.com"}, "author": "ANI", "title": "Study finds rising rate of mental health visits among youth to emergency departments - Devdiscourse", "description": "A recent study has found that while the number of pediatric emergency department (ED) visits across the nation has remained stable over the last 10 years, visits for mental health disorders have risen 60% and the rate of visits for deliberate self-harm have i…", "url": "https://www.devdiscourse.com/article/lifestyle/1045594-study-finds-rising-rate-of-mental-health-visits-among-youth-to-emergency-departments", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/11_05_2020_10_21_03_1620836.jpg?width=920&format=jpeg", "publishedAt": "2020-05-11T10:21:07Z", "content": "A recent study has found that while the number of pediatric emergency department (ED) visits across the nation has remained stable over the last 10 years, visits for mental health disorders have risen 60% and the rate of visits for deliberate self-harm has in… [+3939 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Arit John", "title": "Coronavirus adds new hurdles for those with health issues - Los Angeles Times", "description": "During the coronavirus outbreak, people with conditions like diabetes and kidney disease are adapting their medical routines to avoid exposure.", "url": "https://www.latimes.com/science/story/2020-05-11/underlying-health-conditions-diabetes-coronavirus-challenges", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/7a426c7/2147483647/strip/true/crop/2048x1075+0+130/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F2b%2F27%2Fd50364c21f7edefc4b58d8421107%2Fla-heb-diabetes-amputations-20120127-001", "publishedAt": "2020-05-11T10:06:06Z", "content": "After nearly six years waiting for a kidney transplant, Amar Abu-Samrah found out late last year that she was near the top of the list. In mid-March, the coronavirus outbreak forced the transplant center to postpone most procedures.\r\nSince then, Abu-Samrah, 2… [+9751 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Associated Press Television News", "title": "New Mexico woman, 105, who beat 1918 flu, has COVID-19 - Republic World - Republic World", "description": "A 105-year-old New Mexico woman who beat back the 1918 flu that killed millions, including her mother and infant sister, is battling COVID-19.", "url": "https://www.republicworld.com/world-news/us-news/new-mexico-woman-105-who-beat-1918-flu-has-covid-19.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/9pwlbkduy4dzqjmm_1589191451.jpeg?tr=f-jpeg", "publishedAt": "2020-05-11T10:04:00Z", "content": "A 105-year-old New Mexico woman who beat back the 1918 flu that killed millions, including her mother and infant sister, is battling COVID-19.\r\nThe Gallup Independent reports Lubica “Luby” Grenko, who will turn 106 years old in August, has been fighting the c… [+676 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Rajvi Desai", "title": "WHO Publishes Ethical Guidelines for Covid19 Human Challenge Trials - The Swaddle", "description": "More than 14,000 people have already registered their intent to join a human challenge trial, should one begin soon.", "url": "https://theswaddle.com/who-publishes-ethical-criteria-for-vaccine-trials-that-require-infecting-healthy-volunteers-with-covid19/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2020/05/WHO-and-CV-OP.jpg", "publishedAt": "2020-05-11T10:02:14Z", "content": "The World Health Organization just gave a conditional green light to Covid19 human challenge trials an ethically sensitive, controversial form of experimental research that involves injecting an infectious pathogen into human volunteers as a way to test vacci… [+4774 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Covid-19 Patients Can End Home Isolation After 17 Days, Says Health Ministry in Revised Guidelines - News18", "description": "The revised guidelines released by the health ministry reiterated that patients, who are pre-symptomatic or have very mild symptoms, can opt for home isolation if they have the requisite self-isolation facility at their residence so as to avoid contact with o…", "url": "https://www.news18.com/news/india/covid-19-patients-can-end-home-isolation-after-17-days-says-health-ministry-in-revised-guidelines-2615113.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587578328_rtx7ezms-1.jpg", "publishedAt": "2020-05-11T09:54:29Z", "content": "Coronavirus infected patients can end home isolation after 17 days of onset of symptoms or date of sampling and if they have no fever for 10 days without getting tested again for Covid-19, according to revised guidelines for home isolation of very mild/pre-sy… [+2580 chars]"}, {"source": {"id": null, "name": "Indiaspend.com"}, "author": "Sadhika Tiwari", "title": "Obesity Puts Younger People At Risk For Severe COVID-19: Study | - IndiaSpend", "description": "Obesity could make COVID-19 infection more severe, says a new study published in The Lancet.", "url": "https://www.indiaspend.com/obesity-puts-younger-people-at-risk-for-severe-covid-19-study/", "urlToImage": "https://www.indiaspend.com/wp-content/uploads/2020/05/obese_1200-1024x536.jpg", "publishedAt": "2020-05-11T09:46:00Z", "content": "New Delhi: Obesity could make COVID-19 infection more severe, a new study in the medical journal The Lancet says. [I]n populations with a high prevalence of obesity, COVID-19 will affect younger populations more than previously reported, it says.\r\nCommon como… [+3506 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "People who should never try Intermittent Fasting, according to experts - Times of India", "description": "Like any diet, Intermittent Fasting too has its share of cons. There are certain times the diet may not work for certain people.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/people-who-should-never-try-intermittent-fasting-according-to-experts/photostory/75673131.cms", "urlToImage": "https://static.toiimg.com/photo/75673272.cms", "publishedAt": "2020-05-11T09:29:28Z", "content": "Although some studies say that certain diets, including intermittent fasting, can help control diabetes, for those with acute diabetes, or dependent on insulin, adopting the diet plan can be quite threatening. Prolong fasting window can affect blood sugar lev… [+239 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Coronavirus vaccine: India joins hunt for Covid-19 vaccine with ICMR-Bharat Biotech partnership - India Today", "description": "India has joined the international race to develop a vaccine for the novel coronavirus with the ICMR typing up with Bharat Biotech over the weekend. Globally, eight prospective vaccines have entered human trials as the novel coronavirus pandemic continues una…", "url": "https://www.indiatoday.in/science/story/coronavirus-vaccine-news-update-india-icmr-bharat-biotech-tie-up-1676735-2020-05-11", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/coronavirus_vaccine_update_ind-647x363.jpeg?YxYe65jTxwe0hbqvVrcSnORMJidh.Td2", "publishedAt": "2020-05-11T09:23:28Z", "content": "India formally entered the global race to develop a vaccine for the novel coronavirus over the weekend, with the Indian Council for Medical Research (ICMR) tying up with the Hyderabad-based Bharat Biotech to develop \"a fully indigenous vaccine\" for Covid-19, … [+3421 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Past studies have revealed coronavirus vaccines 'actually enhanced infection' - Sky News Australia", "description": "It has been revealed previous studies and trials into coronaviruses have produced vaccines which not only didn't work, but in fact \"actually enhanced infecti...", "url": "https://www.youtube.com/watch?v=6T7mHwNls9E", "urlToImage": "https://i.ytimg.com/vi/6T7mHwNls9E/maxresdefault.jpg", "publishedAt": "2020-05-11T09:09:56Z", "content": "It has been revealed previous studies and trials into coronaviruses have produced vaccines which not only didn't work, but in fact \"actually enhanced infection,\" according to Australian National Universitys Professor Peter Collignon.\r\nProfessor Collignon told… [+724 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Hina Zahid", "title": "Early mammography may reduce risk of fatal and advanced breast cancers - Medical Dialogues", "description": "It is certainly important to evaluate the impact of participation in organized mammography service...", "url": "https://medicaldialogues.in/radiology/news/early-mammography-may-reduce-risk-of-fatal-and-advanced-breast-cancers-65657", "urlToImage": "https://medicaldialogues.in/h-upload/2020/03/30/126064-breast-cancer.jpg", "publishedAt": "2020-05-11T09:04:01Z", "content": "It is certainly important to evaluate the impact of participation in organized mammography service screening independently from changes in breast cancer treatment. This can be done by measuring the incidence of fatal breast cancer, which is based on the date … [+1920 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Peter Ellis", "title": "Coronavirus found in semen of young men with Covid-19 - ThePrint", "description": "It would still be sensible for those recovering from Covid-19 to use a condom until further research clarifies how long the infectious virus stays in semen.", "url": "https://theprint.in/health/coronavirus-found-in-semen-of-young-men-with-covid-19/418916/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2018/08/328081941_1-9-e1533095782821.jpg", "publishedAt": "2020-05-11T09:01:38Z", "content": "We dont know much about SARS-CoV-2, the virus that causes COVID-19, but we are learning new things about it every day. The latest bit of the jigsaw puzzle comes from a small study conducted in China, which found SARS-CoV-2 RNA (the viruss genetic code) in the… [+3953 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Longjam Dineshwori", "title": "Eating flavonoid-rich foods may help keep Alzheimer's disease at bay - TheHealthSite", "description": "A new study has revealed that eating flavonoid-rich foods may protect against Alzheimer's disease. Read to know which foods contain flavonoids.", "url": "https://www.thehealthsite.com/diseases-conditions/alzheimers/eating-flavonoid-rich-foods-may-help-keep-alzheimers-disease-at-bay-744861/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2019/09/happy-retirement-655x353.jpg", "publishedAt": "2020-05-11T08:49:00Z", "content": "Alzheimer’s disease (AD) is the most common cause of dementia in older people. It causes problems with memory, thinking and behavior. However, one in three cases of Alzheimer’s disease is preventable, according to a research from the University of Cambridge. … [+3886 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "News18", "title": "How Pandemics End: Finding Solutions to Halt the Virus, Researchers Now Stumble Upon History - News18", "description": "According to historians, pandemics typically have two types of endings: the medical, which occurs when the incidence and death rates plummet, and the social, when the epidemic of fear about the disease wanes.", "url": "https://www.nytimes.com/2020/05/10/health/coronavirus-plague-pandemic-history.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/05/1588855059_2020-05-07t122149z_1_lynxmpeg460zu_rtroptp_4_health-coronvairus-syndrome-kids-1.jpg", "publishedAt": "2020-05-11T08:46:00Z", "content": "When will the Covid-19 pandemic end? And how?\r\nAccording to historians, pandemics typically have two types of endings: the medical, which occurs when the incidence and death rates plummet, and the social, when the epidemic of fear about the disease wanes.\r\nWh… [+10620 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ANI", "title": "Middle-age people might be experiencing more stress compared to life in 90s: Study - Times of India", "description": "A team of researchers led by Penn State found that across all ages, there was a slight increase in daily stress in", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/de-stress/middle-age-people-might-be-experiencing-more-stress-compared-to-life-in-90s-study/articleshow/75668224.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75668211,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-1212407/75668211.jpg", "publishedAt": "2020-05-11T08:14:37Z", "content": null}, {"source": {"id": null, "name": "Dw.com"}, "author": "Deutsche Welle (www.dw.com)", "title": "Can a tuberculosis vaccine help combat COVID-19? - DW (English)", "description": "VPM1002 is the name of a new tuberculosis vaccine that could possibly help control the novel coronavirus. Several studies have been initiated and seem promising.", "url": "https://www.dw.com/en/can-a-tuberculosis-vaccine-help-combat-covid-19/a-53388220", "urlToImage": "https://www.dw.com/image/49943669_304.jpg", "publishedAt": "2020-05-11T08:00:14Z", "content": "The tuberculosis vaccine called Bacille Calmette-Guerin (BCG) has been around since the beginning of the last century. It is the only approved vaccine againsttuberculosis. To date, more than 4 million doses of it have been administered. The new VPM1002 is bas… [+8663 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "COVID-19 vaccine status: These 4 coronavirus vaccines are leading the race - Times of India", "description": "At the same time, scientists and researchers across the globe are racing against the time to develop a vaccine for the novel coronavirus. As of now, almost 100 research groups are working round the clock to develop a potential vaccine for COVID-19.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-vaccine-latest-news-covid-19-vaccine-status-update-these-4-coronavirus-vaccines-are-leading-the-race/photostory/75670744.cms", "urlToImage": "https://static.toiimg.com/photo/75670917.cms", "publishedAt": "2020-05-11T08:00:00Z", "content": "As per recent reports, the Indian Council of Medical Research (ICMR) has teamed up with Bharat Biotech International Limited (BBIL) for developing COVID-19 vaccine. It is important to note that the vaccine will use the virus strain isolated at the National In… [+297 chars]"}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "PTI", "title": "ICMR Issues Guidance For Appropriate Recording Of Covid-19 Deaths To Create Robust Data - BloombergQuint", "description": "Deaths in which tests are awaited with the presence of symptoms will be recorded as suspected deaths, the ICMR said.", "url": "https://www.bloombergquint.com/coronavirus-outbreak/icmr-issues-guidance-for-appropriate-recording-of-covid-19-deaths-to-create-robust-data", "urlToImage": "https://images.assettype.com/bloombergquint%2F2020-05%2F32765132-ad9f-45ad-911c-fc6655667c5f%2F361443630.jpg?rect=0%2C568%2C3998%2C2099&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-05-11T07:52:26Z", "content": "Covid-19 would be recorded as an \"underlying cause of death\" when leading to pneumonia, cardiac injury and clotting in the bloodstream, among others, according to the guidance issued by Indian Council of Medical Research for appropriate recording of deaths du… [+3391 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Here is How to Prepare Ubtans at Home During Lockdown to Enhance Your Look - India.com", "description": "To get a fair complexion or enhance your look, here are a certain ways to prepare Ubtans at home.", "url": "https://www.india.com/lifestyle/here-is-how-to-prepare-ubtans-at-home-to-enhance-your-look-during-lockdown-4025697/", "urlToImage": "https://www.india.com/wp-content/uploads/2020/05/Ubtan.jpg", "publishedAt": "2020-05-11T07:14:34Z", "content": "Ubtan is the most natural form of cosmetic that you can prepare and use. Ubtan is basically a traditionally made face mask or other beauty product that can potentially rejuvenate your skin with the help of its powerful ingredients that are majorly found in yo… [+1663 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Mental Health Tips: Five ways to practise self-care during the COVID-19 pandemic - Firstpost", "description": "While it may seem like you can’t possibly find the time for it — given you’re managing your home as well as work — it’ll be better for you in the long run.", "url": "https://www.firstpost.com/health/mental-health-tips-five-ways-to-practise-self-care-during-the-covid-19-pandemic-8355211.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2019/11/GettyImages-956414812a.jpg", "publishedAt": "2020-05-11T06:36:35Z", "content": null}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Marshall Allen, ProPublica", "title": "6 Questions You Can Ask to Spot Coronavirus Misinformation - The Wire", "description": "Ultimately, we’re all going to need to be more savvy consumers when it comes to information, no matter how slickly it’s presented.", "url": "https://science.thewire.in/uncategorised/6-questions-you-can-ask-to-spot-coronavirus-misinformation/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2020/05/11114406/old-man-sitting-while-holding-newspaper-article-2248503-scaled.jpg", "publishedAt": "2020-05-11T06:32:05Z", "content": "This story was originally published by ProPublica.\r\nThe links to the viral video Plandemic started showing up in my Facebook feed Wednesday. Very interesting, one of my friends wrote about it. I saw several subsequent posts about it, and then my brother texte… [+10759 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Aanchal Nigam", "title": "Scientists find coronavirus is well adapted to humans, detect mutations - Republic World - Republic World", "description": "Researchers in London have recently found out the deadly coronavirus that has now infected over 4.1 million people across the world is “well adapted to humans”.", "url": "https://www.republicworld.com/world-news/uk-news/scientists-find-coronavirus-is-well-adapted-to-humans.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/chltenyix29bfpxq_1589177699.jpeg?tr=f-jpeg", "publishedAt": "2020-05-11T06:30:53Z", "content": "Researchers in London have recently found out that the deadly coronavirus which has now infected over 4.1 million people across the world is “well adapted to humans”. After the analysis of over five thousand strains of SARS-CoV-2 from at least 62 countries, t… [+2007 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "A study on reactions to the coronavirus finds people worried more about health of loved ones - Deccan Herald", "description": "", "url": "https://www.deccanherald.com/national/a-study-on-reactions-to-the-coronavirus-finds-people-worried-more-about-health-of-loved-ones-836161.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/11/2020-03-27T141622Z_1369428898_RC2ESF98GH9E_RTRMADP_3_HEALTH-CORONAVIRUS-ITALY-HOSPITAL%20%281%29-1589180727.jpg", "publishedAt": "2020-05-11T06:28:01Z", "content": "Amid the coronavirus outbreak, most of the people are more concerned about the health of their near and dear ones than their own well-being, says a study conducted by a leading business school in Goa.\r\nTrack live updates on coronavirus here\r\nPeople are now mo… [+2256 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "7 amazing health benefits of makhanas - Times of India", "description": "Makhanas, also called foxnuts or lotus seeds in English are mostly consumed during fasting, thanks to their strong", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/7-amazing-health-benefits-of-makhanas/articleshow/75645503.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75645503,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-1029925/75645503.jpg", "publishedAt": "2020-05-11T06:26:04Z", "content": "Makhanas, also called foxnuts or lotus seeds in English are mostly consumed during fasting, thanks to their strong nutritional value. Makhanas are an extremely popular ingredient of various recipes and make for a perfect snack for everyone, including weight w… [+2793 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Jahnavi Sarma", "title": "Recognise the different kinds of rashes that may indicate COVID-19 infection - TheHealthSite", "description": "Doctors are puzzled by the appearance of different kinds of rashes on some people who tested positive for COVID-19. Read on to know more", "url": "https://www.thehealthsite.com/news/recognise-the-different-kinds-of-rashes-that-may-indicate-covid-19-infection-744731/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2020/05/rashes-655x353.jpg", "publishedAt": "2020-05-11T04:56:00Z", "content": "The current pandemic still shows no signs of retreating even after the best efforts of all across the world. Cases continue to spike across the world with places where things seem to have gotten a little better reporting new cases almost every day. This is a … [+3060 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "AP", "title": "In Japan, pandemic brings outbreaks of bullying, ostracism - The Hindu", "description": "There are many other people who also have faced discrimination and prejudice,” said Ms. Kadono, who decided to speak out on her own behalf and that of other COVID-19 survivors and their families.", "url": "https://www.thehindu.com/news/international/in-japan-pandemic-brings-outbreaks-of-bullying-ostracism/article31554514.ece", "urlToImage": "https://www.thehindu.com/news/international/m80024/article31554513.ece/ALTERNATES/LANDSCAPE_615/ARISAKADONO", "publishedAt": "2020-05-11T04:04:55Z", "content": "The coronavirus in Japan has brought not just an epidemic of infections, but also an onslaught of bullying and discrimination against the sick, their families and health workers.\r\n A government campaign to raise awareness seems to be helping, at least for med… [+3759 chars]"}, {"source": {"id": null, "name": "Thehitavada.com"}, "author": "The Hitavada", "title": "Doctors warn against stigma attached to virus - The Hitavada", "description": "WITH the number of COVID-19 cases continuously increasing in the country, there have been several incidents of name and shame, discrimination, verbal abuse and hostility with patients’ families, doctors, and health workers, highlighting the stigma attached to…", "url": "https://www.thehitavada.com/Encyc/2020/5/11/Doctors-warn-against-stigma-attached-to-virus.html", "urlToImage": "https://www.thehitavada.com/Encyc/2020/5/11/2_08_59_20_stigma-attached-to-virus_1_H@@IGHT_380_W@@IDTH_655.jpg", "publishedAt": "2020-05-11T03:32:25Z", "content": "WITH the number of COVID-19 cases continuously increasing in the country, there have been several incidents of name and shame, discrimination, verbal abuse and hostility with patients’ families, doctors, and health workers, highlighting the stigma attached to… [+2868 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Singapore's coronavirus crackdown exposed treatment of migrant workers - CBC News: The National", "description": "Singapore contained its coronavirus outbreak through aggressive tracing, testing and clamping down on its economy, but it exposed some ugly truths about its ...", "url": "https://www.youtube.com/watch?v=3iUPuiYhLKI", "urlToImage": "https://i.ytimg.com/vi/3iUPuiYhLKI/maxresdefault.jpg", "publishedAt": "2020-05-11T02:42:48Z", "content": "Singapore contained its coronavirus outbreak through aggressive tracing, testing and clamping down on its economy, but it exposed some ugly truths about its treatment of migrant workers in the process.\r\n»»» Subscribe to The National to watch more videos here:… [+381 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "COVID-19: Will contact sports have to wait for a vaccine before resuming? - CBC News: The National", "description": "An infectious disease specialist answers questions about the COVID-19 pandemic including whether contact sports will have to wait for a vaccine before resumi...", "url": "https://www.youtube.com/watch?v=R2YiMmyzMw0", "urlToImage": "https://i.ytimg.com/vi/R2YiMmyzMw0/maxresdefault.jpg", "publishedAt": "2020-05-11T02:26:21Z", "content": "An infectious disease specialist answers questions about the COVID-19 pandemic including whether contact sports will have to wait for a vaccine before resuming.\r\n»»» Subscribe to The National to watch more videos here: https://www.youtube.com/user/CBCTheNa...… [+340 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "Patient with Covid dies in Faridabad, two more test positive - Times of India", "description": "GURUGRAM: A 72-year-old woman, who was diagnosed with Covid-19 on May 6, has died in Faridabad, taking the death toll in Haryana to 10.", "url": "https://timesofindia.indiatimes.com/city/faridabad/patient-with-covid-dies-in-fbd-2-more-test-positive/articleshow/75665419.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75669223,width-1070,height-580,imgsize-188052,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-05-11T02:20:13Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AP", "title": "US public health expert warns coronavirus still has a long run - Times of India", "description": "US News: A public health expert says the new coronavirus still “has a long way to run” despite President Donald Trump's claim last week that it will go away wi", "url": "https://timesofindia.indiatimes.com/world/us/us-public-health-expert-warns-coronavirus-still-has-a-long-run/articleshow/75663656.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75663638,width-1070,height-580,imgsize-103327,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-05-11T02:19:06Z", "content": null}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Karishma Mehrotra", "title": "ICMR: Categorise cause of death, focus on sequence of events - The Indian Express", "description": "Apart from outlining three categories to identify causal sequence of death for proper surveillance, the guidelines stress that the logical sequence of events must be clearly articulated in the records.", "url": "https://indianexpress.com/article/india/coronavirus-icmr-categorise-cause-of-death-focus-on-sequence-of-events-6403643/", "urlToImage": "https://images.indianexpress.com/2020/05/Coronavirus-medical-2-1.jpg?w=759", "publishedAt": "2020-05-11T02:05:30Z", "content": "The immediate cause is the disease, injury, or complication that caused the death, not the mode of dying. (Express File Photo by Partha Paul)In new guidelines on recording Covid-19 related deaths, the Indian Council of Medical Research (ICMR) has directed med… [+3482 chars]"}, {"source": {"id": null, "name": "Freepressjournal.in"}, "author": "ANI", "title": "Researchers discover stem cells' 'death-defying' quality that aids healing - Free Press Journal", "description": "Already known for their shape-shifting abilities, stem cells can now add \"death-defying\" to their list of remarkable qualities, suggests a novel study.", "url": "https://www.freepressjournal.in/science/researchers-discover-stem-cells-death-defying-quality-that-aids-healing", "urlToImage": "https://images.assettype.com/freepressjournal%2F2020-05%2F1a0da4df-a1e7-4d5b-8306-234338eeeec8%2Fetc_2nd_lead_twitter.jpg?rect=0%2C24%2C760%2C399&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-05-11T01:44:27Z", "content": "Washington D.C.: Already known for their shape-shifting abilities, stem cells can now add \"death-defying\" to their list of remarkable qualities, suggests a novel study.\r\nThe new study shows how stem cells, which can contribute to creating many parts of the bo… [+2908 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Chahat Rana", "title": "Chandigarh: Positivity rate rises to double the national average, testing slumps in UT - The Indian Express", "description": "According to an epidemiologist from the city who wishes to remain anonymous, the increase in positivity rate can either denote a decrease in testing, or testing targeted at a pool which is already likely to be positive.", "url": "https://indianexpress.com/article/cities/chandigarh/coronavirus-chandigarh-positivity-rate-rises-to-double-the-national-average-testing-slumps-in-ut-6403897/", "urlToImage": "https://images.indianexpress.com/2020/05/test-759-1.jpg?w=759", "publishedAt": "2020-05-11T00:28:40Z", "content": "Written by Chahat Rana\r\n | Chandigarh | \r\nPublished: May 11, 2020 5:56:51 am\r\nThe positivity rate of COVID-19 patients is the proportion of confirmed cases to the total number of tests conducted. (Representational Photo)Even as the positivity rate of COVID-19… [+1867 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "Couples Are Less Likely to Conceive During Coronavirus Lockdown And This is The Reason Why - India.com", "description": "Over 80 per cent of people are not planning to conceive during the coronavirus (COVID-19) pandemic, perhaps putting to rest suggestions that the lockdown could lead to a rise in birth numbers, say researchers.", "url": "https://www.india.com/lifestyle/couples-are-less-likely-to-conceive-during-coronavirus-lockdown-and-this-is-the-reason-why-4025327/", "urlToImage": "https://www.india.com/wp-content/uploads/2020/05/pjimage-1-1.jpg", "publishedAt": "2020-05-10T16:29:33Z", "content": "Over 80 per cent of people are not planning to conceive during the coronavirus (COVID-19) pandemic, perhaps putting to rest suggestions that the lockdown could lead to a rise in birth numbers, say researchers. Also Read - Coronavirus in Uttar Pradesh: As Numb… [+2624 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Lifestyle Desk", "title": "Irregular sleep cycle might disturb growth in kids: Study - The Indian Express", "description": "It was observed that parents who complained of sleep difficulties amongst their children who later went on to contract autism were more in number than the ones who did not.", "url": "https://indianexpress.com/article/lifestyle/health/irregular-sleep-cycle-might-disturb-growth-in-kids-study-6403128/", "urlToImage": "https://images.indianexpress.com/2017/08/sleeping-baby759.jpg?w=759", "publishedAt": "2020-05-10T12:22:07Z", "content": "The infants who were later detected to have autism have had to undergo issues in falling asleep. (Source: getty/thinkstock images)Research has put into light the fact that sleep complications in the first twelve months of a babys life could further lead to an… [+2570 chars]"}, {"source": {"id": null, "name": "Thenortheasttoday.com"}, "author": null, "title": "Recovery rate of covid-19 patients stands at nearly 30 per cent - thenortheasttoday.com", "description": "NATIONAL | MAY 10, 2020: Indian Council of Medical Research, ICMR has said that a total of 16,09,037 samples of COVID-19 have been tested by the various government and private laboratories in the country so far. Yesterday, 85 thousand 824 tests were conducted…", "url": "https://thenortheasttoday.com/recovery-rate-of-covid-19-patients-stands-at-nearly-30-per-cent/", "urlToImage": "https://tnt.sgp1.cdn.digitaloceanspaces.com/uploads/2020/03/TNT-12.jpg", "publishedAt": "2020-05-10T12:07:35Z", "content": "NATIONAL | MAY 10, 2020:\r\nIndian Council of Medical Research, ICMR has said that a total of 16,09,037 samples of COVID-19 have been tested by the various government and private laboratories in the country so far. Yesterday, 85 thousand 824 tests were conducte… [+1001 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Ian Sample", "title": "Will Covid-19 mutate into a more dangerous virus? - The Guardian", "description": "What do we know about the way coronavirus is evolving?", "url": "https://www.theguardian.com/world/2020/may/10/will-covid-19-mutate-into-a-more-dangerous-virus", "urlToImage": "https://i.guim.co.uk/img/media/5493b9df3d37b1a05c816868d07eb3bd9b01c309/227_479_3234_1941/master/3234.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=01d9eb9e3e6a6f479918b7c4eded3d44", "publishedAt": "2020-05-10T11:53:41Z", "content": null}, {"source": {"id": null, "name": "Dailysabah.com"}, "author": "DAILY SABAH", "title": "With no vaccine in sight, locally made COVID-19 drug gets green light | Daily Sabah - Daily Sabah", "description": "Turkey has approved the sales permit for a drug produced by a local firm to be used in the treatment of COVID-19. Turkey's Presidential Communications Director Fahrettin Altun...", "url": "https://www.dailysabah.com/turkey/with-no-vaccine-in-sight-locally-made-covid-19-drug-gets-green-light/news", "urlToImage": "https://idsb.tmgrup.com.tr/ly/uploads/images/2020/05/10/thumbs/1200x600/34976.jpg", "publishedAt": "2020-05-10T11:40:04Z", "content": "Turkey has approved the sales permit for a drug produced by a local firm to be used in the treatment of COVID-19. Turkey's Presidential Communications Director Fahrettin Altun announced the news on Twitter, though he did not name the company or the drug.\r\nSev… [+3534 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Coronavirus and Acute Respiratory Syndromes (COVID-19, MERS, and SARS) Market 2020: Trends Estimates High Demand - Cole of Duty", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMikwFodHRwczovL2NvbGVvZmR1dHkuY29tL25ld3MvMjAyMC8wNS8xMC9jb3JvbmF2aXJ1cy1hbmQtYWN1dGUtcmVzcGlyYXRvcnktc3luZHJvbWVzLWNvdmlkLTE5LW1lcnMtYW5kLXNhcnMtbWFya2V0LTIwMjAtdHJlbmRzLWVzdGltYXRlcy1oaWdoLWRlbWFuZC_SAQA?oc=5", "urlToImage": null, "publishedAt": "2020-05-10T11:22:00Z", "content": null}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Longjam Dineshwori", "title": "Mother's Day 2020: Healthy food options for new moms - TheHealthSite", "description": "A poor diet will not only affect the growth of the baby but it may also be bad for her own health. Some foods that new moms should include in their diet.", "url": "https://www.thehealthsite.com/fitness/diet/mothers-day-2020-healthy-food-options-for-new-moms-744771/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2019/07/new-moms-diet-after-delivery-655x353.jpg", "publishedAt": "2020-05-10T09:57:00Z", "content": "Happy Mothers Day to all the mothers and mother figures around the world. For a mother, the priority is always her children. Often, mothers neglect their own health and go extra miles to make life easy and comfortable for their children. But dear mothers your… [+3223 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "IANS", "title": "Diabetes, smoking, and hypertension can increase risk of strokes due to COVID-19, says expert - Times Now", "description": "They said there is growing evidence to suggest that Covid-19 infection can cause the blood to clot in unusual ways, and as a consequence stroke could be an outcome.", "url": "https://www.timesnownews.com/health/article/diabetes-smoking-and-hypertension-can-increase-risk-of-strokes-due-to-covid-19-says-expert/589775", "urlToImage": "https://imgk.timesnownews.com/story/stroke_0.png?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-10T09:53:15Z", "content": "New Delhi: The novel Coronavirus that has been mutating rapidly appears to cause sudden strokes in people, who are heavy smokers, diabetic and suffering from hypertension, doctors suggested on Saturday.\r\nThey said there is growing evidence to suggest that Cov… [+2704 chars]"}, {"source": {"id": null, "name": "Sentinelassam.com"}, "author": "Sentinel Digital Desk", "title": "Six-week-old baby becomes UKs youngest COVID-19 victim confirms NHS- Sentinelassam - The Sentinel Assam", "description": "A six-week-old baby has died of coronavirus in England, becoming the UK’s youngest COVID-19 victim,...", "url": "https://www.sentinelassam.com/international/six-week-old-baby-becomes-uks-youngest-covid-19-victim-confirms-nhs-471492", "urlToImage": "https://www.sentinelassam.com/h-upload/2020/05/09/124971-babyy.JPG", "publishedAt": "2020-05-10T08:00:54Z", "content": "A six-week-old baby has died of coronavirus in England, becoming the UK's youngest COVID-19 victim, the National Health Service (NHS) has confirmed. A further 332 deaths in hospitals in England were recorded on Friday, including the baby, reports the Metro ne… [+720 chars]"}, {"source": {"id": null, "name": "Sentinelassam.com"}, "author": "Sentinel Digital Desk", "title": "COVID-19 patients lose sense of smell by third day of infection- Sentinelassam - The Sentinel Assam", "description": "Loss of taste or smell is now among the new coronavirus symptoms that the US Centers for Disease...", "url": "https://www.sentinelassam.com/international/covid-19-patients-lose-sense-of-smell-by-third-day-of-infection-471578", "urlToImage": "https://www.sentinelassam.com/h-upload/2020/05/09/125022-covid-19.jpg", "publishedAt": "2020-05-10T07:43:18Z", "content": "NEW YORK: Loss of taste or smell is now among the new coronavirus symptoms that the US Centers for Disease Control and Prevention (CDC) has added to its official list and now, a new study says that loss of the sense of smell is most likely to occur by the thi… [+1743 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Anti-malaria drug hydroxychloroquine championed by Donald Trump for coronavirus COVID-19 treatment fails an... - Zee News", "description": "A new study has revealed that anti-malaria drug Hydroxychloroquine (HCQ) has failed another test to prove its efficiency in treating the coronavirus COVID-19, with infected patients showing no change in their conditions after being administered HCQ.", "url": "https://zeenews.india.com/world/anti-malaria-drug-hydroxychloroquine-championed-by-donald-trump-for-coronavirus-covid-19-treatment-fails-another-test-finds-study-2282404.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2020/05/10/859916-hcq1.jpg", "publishedAt": "2020-05-10T07:12:30Z", "content": "A new study has revealed that anti-malaria drug Hydroxychloroquine (HCQ) has failed another test to prove its efficiency in treating the coronavirus COVID-19, with infected patients showing no change in their conditions after being administered HCQ.\r\nThe obse… [+2202 chars]"}, {"source": {"id": null, "name": "Orfonline.org"}, "author": "Chitra Pattabiraman", "title": "What can we learn from the genomes of the novel coronavirus? - Observer Research Foundation", "description": "COVID-19 is the disease caused by the novel coronavirus SARS-CoV-2. “Bad news wrapped in a protein”, as a recent news story", "url": "https://www.orfonline.org/expert-speak/what-can-we-learn-from-the-genomes-of-the-novel-coronavirus-65929/", "urlToImage": "https://www.orfonline.org/wp-content/uploads/2020/05/cvirus.jpg", "publishedAt": "2020-05-10T06:59:18Z", "content": "COVID-19 is the disease caused by the novel coronavirus SARS-CoV-2. Bad news wrapped in a protein, as a recent news story\r\n(link is external) put it, is an apt epithet for this virus which has brought life as we know it to a stand still. This bad news, is the… [+9706 chars]"}, {"source": {"id": null, "name": "Edexlive.com"}, "author": "Edex Live", "title": "ArtificiaI Intelligence supported test to detect glaucoma progression early, finds research - EdexLive", "description": "The researchers were able to accurately predict progressive glaucomatous damage 18 months before that seen with the current gold standard OCT retinal imaging technology", "url": "https://www.edexlive.com/news/2020/may/10/artificiai-intelligence-supported-test-to-detect-glaucoma-progression-early-finds-research-11902.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2020/5/10/w600X390/research.jpg", "publishedAt": "2020-05-10T06:51:23Z", "content": "In a bid to detect glaucoma progression in patients even before its visible signs appear, researchers have discovered a new Artificial Intelligence-based test that can detect glaucoma progression 18 months earlier than the gold standard method used currently.… [+3608 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Coronavirus: Immunisation programmes to continue in full steam, says West Bengal govt - India Today", "description": "The West Bengal government has asked the heads of all hospitals to ensure that immunisation programmes against vaccine-preventable diseases continue in full steam amid the Covid-19 pandemic.", "url": "https://www.indiatoday.in/india/story/coronavirus-india-lockdown-immunisation-programmes-vaccine-continue-full-steam-west-bengal-govt-1676353-2020-05-10", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/PTI03-05-2020_000212B-647x363.jpeg?.A7dE8VlUlcKxcDNDXb2LaGoYVHNE6DQ", "publishedAt": "2020-05-10T06:07:13Z", "content": null}, {"source": {"id": null, "name": "Thenewsopediaindia.co.in"}, "author": "rishixkumar00", "title": "Happy Mother’s Day 2020: Mothers are precious and need to be cherished for ‘Supohit Bharat’ - The Newsopedia", "description": "Women have special nutritional requirements throughout their life cycle, particularly, in India they often suffer from poorer nutrition than men.By Dr Sujeet RanjanHappy Mother’s Day! ‘Ma’, ‘Janani’ is primarily", "url": "https://www.thenewsopediaindia.co.in/news/lifestyle/happy-mothers-day-2020-mothers-are-precious-and-need-to-be-cherished-for-supohit-bharat/", "urlToImage": "https://images.financialexpress.com/2020/05/happy-mothers-day-2.jpg", "publishedAt": "2020-05-10T05:04:21Z", "content": "By Dr Sujeet Ranjan\r\nHappy Mothers Day! Ma, Janani is primarily derived from the Sanskrit word meaning mother, Janani is conceptualized to be a woman who takes care of her children and family safeguarding them from all worries and troubles. All of us are from… [+5109 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Two bookstores and a lockdown: Delhi's Midland and Mumbai's Kitab Khana on weathering the coronavirus crisis - Firstpost", "description": "Midland and Kitab Khana have never run on glitz, but the commitment of their readers. However, in a world where intimacy itself is a risk, India’s vintage bookshops must adapt, as they are, to find ways to remain relevant and alive.", "url": "https://www.firstpost.com/living/two-bookstores-and-a-lockdown-delhis-midland-and-mumbais-kitab-khana-on-weathering-the-coronavirus-crisis-8342901.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/05/midland1200-min.jpg", "publishedAt": "2020-05-10T04:25:33Z", "content": "Nobody saw this coming. The world has irrevocably changed, its ritualistic familiarity shaken so violently it may never regain an older, recognisable form. The coronavirus epidemic has dealt each facet of our life a hand that will require time, patience and p… [+5594 chars]"}, {"source": {"id": null, "name": "Uniindia.com"}, "author": "Uniindia News Service", "title": "Diseases like Dengue, Malaria, Chikungunya should not be ignored due to COVID-19: Sunil Kataria - United News of India", "description": "Panaji, May 10 (UNI) While COVID-19 is spreading rapidly around the globe, there are also other health issues like Dengue and Malaria which need to be addressed.", "url": "http://www.uniindia.com/diseases-like-dengue-malaria-chikungunya-should-not-be-ignored-due-to-covid-19-sunil-kataria/business-economy/news/1989366.html", "urlToImage": "http://www.uniindia.com//images/stripad.png", "publishedAt": "2020-05-10T03:35:00Z", "content": "By Anil MishraPanaji, May 10 (UNI) While COVID-19 is spreading rapidly around the globe, there are also other health issues like Dengue and Malaria which need to be addressed.In an attempt to tackle mosquito-spread diseases, Godrej Group has urged government … [+1970 chars]"}, {"source": {"id": null, "name": "Omfut.com"}, "author": "akhila", "title": "COVID 19 Vaccine- China’s succeeded in testing Coronavirus Vaccine on Monkeys - Omfut", "description": "2020 seems much disgusting with the spread of the ly virus and other relative incidents happening globally. The impact of the s is seen in almost all the countries in the world, and everyone is fighting from their own premises. Following home quarantine durin…", "url": "https://omfut.com/health/covid-19-vaccine-chinas-succeeded-in-testing-coronavirus-vaccine-on-monkeys/", "urlToImage": "https://omfut.com/wp-content/uploads/2020/05/vaccine.png", "publishedAt": "2020-05-09T18:42:21Z", "content": "On Saturday, a team of 15 doctors &amp; healthcare professionals was despatched by India to Kuwait. This step has been taken to supplement the efforts of the Kuwaiti government to fight against coronavirus.\r\nA statement from Indian foreign ministry said that … [+1427 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Dr. Rahul Yadav", "title": "COVID-19 in neonates and infants - The Hindu", "description": "Here is some good news for pregnant and lactating mothers: Coronavirus infection is less frequent and less severe in children (Child Sparing Pattern)During and after pregnancy, a woman is not at incre", "url": "https://www.thehindu.com/news/cities/chennai/covid-19-in-neonates-and-infants/article31547359.ece", "urlToImage": "https://www.thehindu.com/news/cities/chennai/cpx9kw/article31547358.ece/ALTERNATES/LANDSCAPE_615/10MAYTHESYADAV", "publishedAt": "2020-05-09T18:32:18Z", "content": "Here is some good news for pregnant and lactating mothers: \r\n<ul><li>Coronavirus infection is less frequent and less severe in children (Child Sparing Pattern)</li><li>During and after pregnancy, a woman is not at increased risk of coronavirus</li><li>COVID-1… [+2828 chars]"}, {"source": {"id": null, "name": "Risingkashmir.com"}, "author": null, "title": "Rising Kashmir - Rising Kashmir Daily English Newspaper", "description": "Prospect of Covid-19 vaccine", "url": "http://www.risingkashmir.com/article/prospect-of-covid-19-vaccine", "urlToImage": "http://admin.risingkashmir.com/images/article/008deb00-4148-4c54-acb0-f79daa7a6579.jpg", "publishedAt": "2020-05-09T16:51:46Z", "content": "Dr. Rajkumar Singh\r\nrajkumarsinghpg@gmail.com\r\nMore than 60 candidate vaccines are now in development, worldwide, and several have entered early clinical trials in human volunteers, according to the World Health Organization.  Some groups aim to provoke an im… [+7625 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Peter Aitken", "title": "Warm weather won't kill off coronavirus, study finds - Fox News", "description": "Summer may not provide the kind of relief from the coronavirus that many hoped it would.", "url": "https://www.foxnews.com/science/warm-weather-wont-kill-off-coronavirus-study-finds", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/04/DWeiner_2.jpg", "publishedAt": "2020-05-09T16:05:36Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nTemperature has no clear impact on the spread of coronavirus, a new study has found. \r\nThe University of Toronto studied all 144 geopolitical areas worldwide in whic… [+2550 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "UW-Madison doctor says coronavirus vaccine 'won't be easy' - WISN 12 News", "description": "One of the fewer than 20 doctors who will be making federal vaccine recommendations for COVID-19 is right in Wisconsin. Subscribe to WISN on YouTube now for ...", "url": "https://www.youtube.com/watch?v=CG59tng8WeE", "urlToImage": "https://i.ytimg.com/vi/CG59tng8WeE/maxresdefault.jpg", "publishedAt": "2020-05-09T16:01:28Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Llama antibodies could help fight COVID-19 | Coronavirus Cure | World News - WION", "description": "Llama antibodies could help fight COVID-19 | Coronavirus Cure | World News Researchers in Belgium say “Winter the Llama” has antibodies that show promise in ...", "url": "https://www.youtube.com/watch?v=7R7P8HjwJhE", "urlToImage": "https://i.ytimg.com/vi/7R7P8HjwJhE/maxresdefault.jpg", "publishedAt": "2020-05-09T14:16:21Z", "content": "Llama antibodies could help fight COVID-19 | Coronavirus Cure | World News\r\nResearchers in Belgium say Winter the Llama has antibodies that show promise in blocking the virus from infecting cells.\r\n#LlamaAntibodies#COVID-19antitode #COVID-19news\r\nAbout Channe… [+1102 chars]"}]}