{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "Wuhan's L-strain may be behind Gujarat's high death rate: Experts - Livemint", "description": "The coronavirus sample we collected from a patient for genome sequence contained the L-type strain.The dominance of the more virulent L-type coronavirus strain as compared to the S-type one could be behind the high mortality rate in the state", "url": "https://www.livemint.com/news/india/wuhan-s-l-strain-may-be-behind-gujarat-s-high-death-rate-experts-11587902424455.html", "urlToImage": null, "publishedAt": "2020-04-26T12:13:16Z", "content": "AHMEDABAD :\r\nThe high Covid-19 mortality rate in Gujarat could be due to the dominance of the L-type strain of coronavirus, found to have been more prevalent in Wuhan in China, where the outbreak started, experts said.The dominance of the more virulent L-type… [+2416 chars]"}, {"source": {"id": null, "name": "Un.org"}, "author": null, "title": "Millions more children at risk with immunization services disrupted amid COVID-19 pandemic - UN News", "description": "Last year, over 13 million children received no vaccines at all, and the UN Children’s Fund (UNICEF) is calling on governments to step up, warning disrupting immunization services amid the COVID-19 pandemic could leave even more of the world’s most marginaliz…", "url": "https://news.un.org/en/story/2020/04/1062622", "urlToImage": null, "publishedAt": "2020-04-26T11:40:07Z", "content": "Making its call at the start of the 2020 edition of World Immunization Week, UNICEF said on Saturday that millions of children are in danger of missing life-saving vaccines against measles, diphtheria and polio due to disruptions in immunization service as th… [+3030 chars]"}, {"source": {"id": null, "name": "Weforum.org"}, "author": "Stephanie Nebehay", "title": "WHO warns COVID-19 patients could be infected again - World Economic Forum", "description": "The World Health Organization advises countries against issuing “immunity passports” or “risk-free certificates” to people who have been infected.", "url": "https://www.weforum.org/agenda/2020/04/no-evidence-that-recovered-covid-19-patients-cannot-be-reinfected-who/", "urlToImage": null, "publishedAt": "2020-04-26T11:38:09Z", "content": "<ul><li>People who have recovered from COVID-19 still need to take precautions to prevent re-infection</li><li>Some countries have handed out health passports to people who have recovered from the illness</li><li>There are now 2.9 million cases of coronavirus… [+1994 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "New York Times", "title": "Coronavirus antibody tests: Can you trust the results? - Times of India", "description": "The researchers worked around the clock, in shifts of three to five hours, hoping to stave off weariness and keep t", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-antibody-tests-can-you-trust-the-results/articleshow/75387833.cms", "urlToImage": null, "publishedAt": "2020-04-26T10:11:40Z", "content": "The researchers worked around the clock, in shifts of three to five hours, hoping to stave off weariness and keep their minds sharp for the delicate task.\r\nThey set up lines of laboratory volunteers: medical residents, postdoctoral students, even experienced … [+11078 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "Pune's Serum Institute to start making coronavirus vaccine that is under trial - Livemint", "description": "Serum Institute of India will be manufacturing Oxford University's coronavirus vaccine in anticipation of clinical trials succeeding by September-October in the UK.The company expressed optimism of starting trials in India for this vaccine over the next 2-3 w…", "url": "https://www.livemint.com/news/india/pune-s-serum-institute-to-start-making-coronavirus-vaccine-that-is-under-trial-11587889621799.html", "urlToImage": null, "publishedAt": "2020-04-26T08:47:51Z", "content": "Vaccine major Serum Institute of India today said it plans to start production of the COVID-19 vaccine developed by Oxford University in the next two to three weeks and hopes to bring it to the market by October if the human clinical trials are successful.The… [+3104 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Women face anxiety over pregnancy and birth in US - TRT World", "description": "For many women, being pregnant comes with its own set of fears and anxiety. But being pregnant during the Covid-19 pandemic takes those fears to a whole new ...", "url": "https://www.youtube.com/watch?v=gagwijdvCR0", "urlToImage": null, "publishedAt": "2020-04-26T08:10:16Z", "content": null}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Covid-19 in Indore: Doctors suspect deadlier Coronavirus strain, will send samples to National Institute of Virology - The Financial Express", "description": "Jitendra Z Bhargava, director of the state government- run School of Excellence in Pulmonary Medicine said the high mortality rate in Indore needs to be investigated through viral culture and RNA extraction.", "url": "https://www.financialexpress.com/lifestyle/health/covid-19-in-indore-doctors-suspect-deadlier-coronavirus-strain-will-send-samples-to-national-institute-of-virology/1939870/", "urlToImage": null, "publishedAt": "2020-04-26T06:08:44Z", "content": "Doctors treating COVID-19 cases in Indore say a more virulent strain may be wreaking havoc in the city, which has emerged as the coronavirus hotspot in Madhya Pradesh. They say samples from Indore, where COVID-19 haskilled 57 people, will be sent to the Pune-… [+1311 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Longjam Dineshwori", "title": "Prescriptions for antidepressants and anti-anxiety drugs surge amidst COVID-19 pandemic - TheHealthSite", "description": "According to a report prescriptions of anti-anxiety medications rose by 34.1% between mid-February and mid-March in the US.", "url": "https://www.thehealthsite.com/news/prescriptions-for-antidepressants-and-anti-anxiety-drugs-surge-amidst-covid-19-pandemic-741891/", "urlToImage": null, "publishedAt": "2020-04-26T06:06:59Z", "content": "Stress about health, finances and uncertainty about the future amidst the COVID-19 pandemic is taking a serious toll on the mental health of people worldwide. In India, there has been a massive spike in patients with mental illness since the coronavirus outbr… [+4292 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Spain's children run free from lockdown - but not all - BBC News", "description": "After six weeks indoors, under-14s are being let out of doors, but how damaging was the lockdown?", "url": "https://www.bbc.com/news/world-europe-52409407", "urlToImage": null, "publishedAt": "2020-04-26T05:55:09Z", "content": "Image caption\r\n Susana Fuertes believes her children have coped well with the six weeks indoors, but her son Mateo will not yet be allowed out\r\nWhen Spain's government announced a national lockdown in mid-March, in reaction to coronavirus, not everyone was di… [+5381 chars]"}, {"source": {"id": null, "name": "Jamaica-gleaner.com"}, "author": null, "title": "Jamaica will emerge from COVID-19 as an example to the world - Doctor who initiated blood plasma treatment for the virus hails control measures taken by her homeland - Jamaica Gleaner", "description": "Jamaica is taking the right steps to combat the killer coronavirus, believes the Jamaica-born US-based doctor who has pioneered the concept of using the blood plasma of recovered COVID-19 patients to treat the contagion. And Dr Khamille West was...", "url": "http://jamaica-gleaner.com/article/lead-stories/20200426/jamaica-will-emerge-covid-19-example-world-doctor-who-initiated-blood", "urlToImage": null, "publishedAt": "2020-04-26T05:32:25Z", "content": "Jamaica is taking the right steps to combat the killer coronavirus, believes the Jamaica-born US-based doctor who has pioneered the concept of using the blood plasma of recovered COVID-19 patients to treat the contagion. \r\nAnd Dr Khamille West was not alone i… [+4526 chars]"}, {"source": {"id": null, "name": "Bangkokpost.com"}, "author": "Bangkok Post Public Company Limited", "title": "German start-up in global demand with anti-virus escalators - Bangkok Post", "description": "COLOGNE: Tanja Nickel and Katharina Obladen were still in high school when they patented an idea to disinfect escalator handrails using UV light.", "url": "https://www.bangkokpost.com/business/1907830/german-start-up-in-global-demand-with-anti-virus-escalators", "urlToImage": null, "publishedAt": "2020-04-26T04:45:00Z", "content": "COLOGNE: Tanja Nickel and Katharina Obladen were still in high school when they patented an idea to disinfect escalator handrails using UV light.\r\nA decade later, their small German start-up UVIS can barely keep up with orders from around the world for their … [+4073 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "Second wave of COVID-19 may hit India during monsoon months - Northeast Now", "description": "Though coronavirus cases in India may go down substantially in the coming days, it may again resurface during the monsoon months. According to an India Times report, the second wave is expected to hit the country in the months of July and August. However, acc…", "url": "https://nenow.in/top-news/second-wave-of-covid-19-may-hit-india-during-monsoon-months.html/", "urlToImage": null, "publishedAt": "2020-04-26T03:20:07Z", "content": "Though coronavirus cases in India may go down substantially in the coming days, it may again resurface during the monsoon months.\r\nAccording to an India Times report, the second wave is expected to hit the country in the months of July and August.\r\nHowever, a… [+840 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Hindustan Times", "title": "India records biggest single day spike, virus can survive on particulate matter: Covid-19 news today - Hindustan Times", "description": "Here is a preview of the important Covid-19 stories from India and world today.", "url": "https://www.hindustantimes.com/india-news/india-records-biggest-single-day-spike-virus-can-survive-on-particulate-matter-covid-19-news-today/story-WANk0UoFH42j3DcDdXLDSM.html", "urlToImage": null, "publishedAt": "2020-04-26T02:48:01Z", "content": "India’s tally of confirmed coronavirus disease (Covid-19) cases shot past the 26,000-mark on Saturday with the biggest single-day spike in infections. Tests in Italy found the Sars-CoV-2 virus, which causes Covid-19, can cling to air pollution particles.\r\nInd… [+4828 chars]"}, {"source": {"id": null, "name": "Newsonair.com"}, "author": null, "title": "WHO says there is no evidence that recovered patients are immune to COVID-19 infection - All India Radio", "description": "World Health Organization (WHO) has said that there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection.", "url": "http://newsonair.com/Main-News-Details.aspx?id=386715", "urlToImage": null, "publishedAt": "2020-04-26T02:42:41Z", "content": "Site Maintained by: Website Cell, NSD and IT Division, Prasar Bharati, New Delhi, India. Website Policy"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Home care workers say they need PPE equipment - KGW News", "description": "Home care providers are essential workers who put their clients and families at risk as they venture out into the world to get their duties done. They say th...", "url": "https://www.youtube.com/watch?v=n8L80xNxlXk", "urlToImage": null, "publishedAt": "2020-04-26T00:40:17Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Spain reports nearly 3,000 daily virus cases - Times of India", "description": "Europe News: MADRID: Spain's health authorities say 2,944 new Covid-19 infections were confirmed in the previous 24 hours, taking the total to nearly 206,000 cases.", "url": "https://timesofindia.indiatimes.com/world/europe/spain-reports-nearly-3000-daily-virus-cases/articleshow/75380478.cms", "urlToImage": null, "publishedAt": "2020-04-25T23:47:56Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: The father of 13 self isolating with Covid-19 - BBC News", "description": "The Hann family have found lockdown a struggle but say they feel \"privileged\" as they pull together.", "url": "https://www.bbc.com/news/uk-scotland-tayside-central-52426962", "urlToImage": null, "publishedAt": "2020-04-25T23:05:02Z", "content": "Image copyrightLesley MartinImage caption\r\n The father of one of Scotland's largest families - Roy Hann - has tested positive for Covid-19\r\nWhen lockdown measures were first announced, Roy and Emma Hann gave their children strict routines and organised family… [+3801 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "VIDEO: Coronavirus pandemic changing Ramadan celebrations - WFSB 3", "description": "This year, Ramadan celebrations are looking very different because of the coronavirus pandemic.", "url": "https://www.youtube.com/watch?v=6Pp13Nbk12I", "urlToImage": null, "publishedAt": "2020-04-25T22:57:49Z", "content": "This year, Ramadan celebrations are looking very different because of the coronavirus pandemic."}, {"source": {"id": null, "name": "Nzherald.co.nz"}, "author": "NZ Herald", "title": "Covid-19 coronavirus: Healthy young people dying of virus-related strokes - New Zealand Herald", "description": "A terrifying warning has been issued about people with mild or no symptoms of the virus.", "url": "https://www.nzherald.co.nz/world/news/article.cfm?c_id=2&objectid=12327627", "urlToImage": null, "publishedAt": "2020-04-25T22:53:21Z", "content": "Young people, with mild to no symptoms of Covid-19, are dying of strokes related to the virus, doctors have warned.\r\n The experts say Covid-19 seems to be the cause for sudden strokes in adults in their 30s and 40s, who are otherwise healthy.\r\n Doctors in the… [+1525 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Chanel Georgina", "title": "Hair loss treatment: The ‘most effective’ remedy to boost hair growth - how to make it - Express", "description": "HAIR LOSS can be upsetting for men and women alike. What's the 'most effective' remedy to boost hair growth? And how do you make it?", "url": "https://www.express.co.uk/life-style/health/1273911/hair-loss-treatment-coconut-milk-how-to-make-it", "urlToImage": null, "publishedAt": "2020-04-25T22:30:57Z", "content": "According to Dr Blossom Kochhar, the \"most effective\" remedy for natural hair growth is the use of coconut milk.\r\nSpecifically, Dr Kochhar advises to \"take coconut milk from a fresh coconut\" – and not to use the liquid from a carton.\r\nCoconut milks is rich in… [+182 chars]"}, {"source": {"id": null, "name": "Greaterkashmir.com"}, "author": null, "title": "COVID19 not manipulated or constructed: WHO - Greater Kashmir", "description": "COVID19 not manipulated or constructed: WHO Greater Kashmir | All available evidence to date suggests that the novel coronavirus has a natural animal origin and was not a manipulated or constructed virus, the World", "url": "https://www.greaterkashmir.com/news/front-page-2/covid19-not-manipulated-or-constructed-who/", "urlToImage": null, "publishedAt": "2020-04-25T21:38:00Z", "content": "All available evidence to date suggests that the novel coronavirus has a natural animal origin and was not a manipulated or constructed virus, the World Health Organization (WHO) said.\r\n“Many researchers have been able to look at the genomic\r\nfeatures of SARS… [+1000 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "'No evidence' people with coronavirus are immunised: WHO - SBS News", "description": "While the global death toll of coronavirus passes 200,000, the World Health Organization warns there is no evidence of immunity to the disease.", "url": "https://www.sbs.com.au/news/no-evidence-people-with-coronavirus-are-immunised-says-who", "urlToImage": null, "publishedAt": "2020-04-25T21:37:23Z", "content": "The World Health Organization has warned that recovering from coronavirus might not protect people from reinfection as the death toll from the pandemic passed 200,000 around the globe.\r\nGovernments are struggling to limit the economic devastation unleashed by… [+7190 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": null, "title": "WHO warns malaria deaths could double during virus pandemic - cgtn.com", "description": "The new coronavirus pandemic could severely disrupt access to anti-malaria nets and drugs in sub-Saharan", "url": "https://africa.cgtn.com/2020/04/25/who-warns-malaria-deaths-could-double-during-virus-pandemic/", "urlToImage": null, "publishedAt": "2020-04-25T20:47:00Z", "content": "Aedes aegypti Mosquito. Close up a Mosquito sucking human blood.Aedes aegypti Mosquito. Close up a Mosquito sucking human blood,Mosquito Vector-borne diseases,Chikungunya.Dengue fever.Rift Valley fever.Yellow fever.Zika.Mosquito on skin\r\nThe new coronavirus p… [+3281 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Could a Second Wave of Coronavirus Infections Appear? - QuickTake by Bloomberg", "description": "The concern about a second wave of #coronavirus is that, once quelled, the pandemic will resurface with renewed strength Subscribe to our YouTube channel: ht...", "url": "https://www.youtube.com/watch?v=fNZ83AEd7Wk", "urlToImage": null, "publishedAt": "2020-04-25T20:34:42Z", "content": "The concern about a second wave of #coronavirus is that, once quelled, the pandemic will resurface with renewed strength\r\nSubscribe to our YouTube channel: https://bit.ly/2TwO8Gm\r\nQUICKTAKE ON SOCIAL:Follow QuickTake on Twitter: twitter.com/quicktakeLike Quic… [+337 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nTom Morgan", "title": "Coronavirus test for anyone traced to a known carrier - Telegraph.co.uk", "description": "The technology should eventually allow symptomless workers to return to their jobs quicker", "url": "https://www.telegraph.co.uk/news/2020/04/25/coronavirus-test-anyone-traced-known-carrier/", "urlToImage": null, "publishedAt": "2020-04-25T20:30:00Z", "content": "In the letter to public health agencies and local authorities, he says the app will work in unison with a call-based system for those without the technology.\r\nHe also refers to the Government's huge recruitment drive to carry out the extra testing. \"There wil… [+2492 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Peter Stubley", "title": "First credible evidence emerges of person being killed by meteor - The Independent", "description": "Researchers find official records documenting fatal strike in Iraq in 1888", "url": "https://www.independent.co.uk/news/science/meteor-man-death-first-person-killed-iraq-turkey-ottoman-empire-a9484231.html", "urlToImage": null, "publishedAt": "2020-04-25T20:00:42Z", "content": "The odds of being struck and killed by a meteorite are said to be as low as one in 250,000.\r\nThere has been no credible and well-documented evidence of any human being befalling this unfortunate fate.\r\nBut researchers now say they have found three separate of… [+16481 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Mehr Gill", "title": "Explained: Types of human coronaviruses and the symptoms they cause - The Indian Express", "description": "While there are hundreds of coronaviruses, there are seven that we know can infect humans.", "url": "https://indianexpress.com/article/explained/types-of-human-coronaviruses-and-symptoms-6368444/", "urlToImage": null, "publishedAt": "2020-04-25T19:50:19Z", "content": "Written by Mehr Gill\r\n | New Delhi | \r\nUpdated: April 25, 2020 6:09:09 pm\r\nHuman coronaviruses were first characterised in the mid-1960s and they are mostly considered to be responsible for causing upper respiratory tract infections in children. (AP illustrat… [+6888 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ariana Eunjung Cha", "title": "Spike in stroke deaths in patients with only minor coronavirus symptoms - The Independent", "description": "Reports of strokes in the young and middle-aged are the latest twist in our evolving understanding of the mysteries of the virus, finds Ariana Eunjung Cha", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-stroke-deaths-symptoms-covid-19-heart-a9484091.html", "urlToImage": null, "publishedAt": "2020-04-25T18:45:03Z", "content": "Thomas Oxley wasnt even on call the day he received the page to come into Mount Sinai Beth Israel Hospital in Manhattan. There werent enough doctors to treat all the emergency stroke patients, and he was needed in the operating room.\r\nThe patients chart appea… [+9849 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Prof. K. Ganapathy", "title": "COVID-19 and the nervous system - The Hindu", "description": "In the last few weeks several articles have appeared from various specialists pointing out how the novel coronavirus disease (COVID-19) can affect their respective specialties. SARS-CoV-2, the scienti", "url": "https://www.thehindu.com/news/national/tamil-nadu/covid-19-and-the-nervous-system/article31434974.ece", "urlToImage": null, "publishedAt": "2020-04-25T18:36:51Z", "content": "In the last few weeks several articles have appeared from various specialists pointing out how the novel coronavirus disease (COVID-19) can affect their respective specialties. SARS-CoV-2, the scientific name given to the virus, appears to be truly omnipresen… [+3491 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Ariana Eunjung Cha", "title": "Young and middle-aged people, barely sick with covid-19, are dying of strokes - The Washington Post", "description": "Doctors sound alarm about patients in their 30s and 40s left debilitated or dead by strokes. Some didn’t even know they were infected by coronavirus.", "url": "https://www.washingtonpost.com/health/2020/04/24/strokes-coronavirus-young-patients/", "urlToImage": null, "publishedAt": "2020-04-25T18:18:21Z", "content": "Oxley gasped when he got to the patients age and covid-19 status: 44, positive.\r\nThe man was among several recent stroke patients in their 30s to 40s who were all infected with the coronavirus. The median age for that type of severe stroke is 74.\r\nAs Oxley, a… [+9467 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Sunetra Choudhury", "title": "CEA points at Spanish Flu lesson in Covid fight - Hindustan Times", "description": "The  Spanish flu emerged in 1918 and claimed 39 million lives till 1920.", "url": "https://www.hindustantimes.com/india-news/cea-points-at-spanish-flu-lesson-in-covid-fight/story-bMWrrU9fXxrCfKLjyVM96M.html", "urlToImage": null, "publishedAt": "2020-04-25T18:15:05Z", "content": "A paper recently published by the US-based National Bureau of Economic Research (NBER) is bringing considerable comfort to policy makers here. Chief Economic Advisor KV Subramanian was the first to draw attention to the research and others like it on the Span… [+2689 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "2 cell types are entry points for virus - Hindustan Times", "description": "The respiratory tract is filled with numerous cells, among which are goblet cells and ciliated cells.", "url": "https://www.hindustantimes.com/india-news/2-cell-types-are-entry-points-for-virus/story-VZ250MIqdc4r0OIzxsTqPJ.html", "urlToImage": null, "publishedAt": "2020-04-25T17:54:31Z", "content": "Scientists have identified two types of cells in the nose that are likely to be point of infection for the Sars-CoV-2 virus, which causes Covid-19, in the body.\r\nThe respiratory tract is filled with numerous cells, among which are goblet cells and ciliated ce… [+2449 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Experts are now warning of another coronavirus symptom in kids, 'Covid Toes' - Times of India", "description": "The alarming symptom, which has been nicknamed 'Covid Toes', was first observed in kids who tested positive for cor", "url": "https://timesofindia.indiatimes.com/life-style/parenting/toddler-year-and-beyond/experts-are-now-warning-of-another-coronavirus-symptom-in-kids-covid-toes/articleshow/75375300.cms", "urlToImage": null, "publishedAt": "2020-04-25T16:32:11Z", "content": "The coronavirus pandemic and the current crisis has resulted in widespread panic. With many asymptomatic cases on the rise, experts are increasingly finding out newer symptoms.\r\nOne thing that is concerning experts is the effect of coronavirus on children. Th… [+2347 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Gabby Landsverk", "title": "CDC's new COVID-19 symptoms: loss of smell, sore throat, aches, chills - Insider - INSIDER", "description": "The CDC has added 6 new recognized symptoms to its list for COVID-19: sore throat, headache, chills, muscle pain, loss of smell or taste, and shaking.", "url": "https://www.insider.com/what-are-new-cdc-covid19-symptoms-chills-sore-throat-headache-2020-4", "urlToImage": null, "publishedAt": "2020-04-25T16:16:57Z", "content": "The CDC has added six new symptoms to its list of what to watch out for in COVID-19 patients. Chills, repeated shaking with chills, muscle pain, headaches, sore throat, and loss of smell and taste are all newly listed on the CDC's coronavirus website. \r\nThat … [+2767 chars]"}, {"source": {"id": null, "name": "Healthissuesindia.com"}, "author": "Kerean Watts", "title": "World Malaria Day in the time of COVID - Hyderus Cyf", "description": "The era of COVID-19 masks the manifold health issues the world - India included - is grappling with. Malaria is among those issues - and with March 25th marking", "url": "https://www.healthissuesindia.com/2020/04/25/world-malaria-day-in-the-time-of-covid/", "urlToImage": null, "publishedAt": "2020-04-25T16:14:04Z", "content": "The era of COVID-19 masks the manifold health issues the world – India included – is grappling with. Malaria is among those issues – and with March 25th marking World Malaria Day, it is important to pay attention to the disease and afford it the gravity it wa… [+6790 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WATCH | National curfew and mandatory cloth face masks to come into effect under Level 4 - News24", "description": "As of 1 May, a national curfew from 20:00 to 05:00 will be in place and it will be applicable to everyone except essential workers traveling to and from work...", "url": "https://www.youtube.com/watch?v=dNs8wczQKNM", "urlToImage": null, "publishedAt": "2020-04-25T15:15:23Z", "content": null}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Hyderabad University's UVC disinfection trolley can clean coronavirus rapidly - India Today", "description": "The University of Hyderabad along with other institutions have created a UVC based disinfection trolley which can clean coronavirus infected areas rapidly.", "url": "https://www.indiatoday.in/education-today/news/story/hyderabad-university-created-uvc-disinfection-trolley-can-clean-coronavirus-rapidly-1671036-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T15:09:42Z", "content": "In a fight against Covid-19, a UVC based disinfection trolley to rapidly clean hospital environment has been created by the International Advanced Research Centre for Powder Metallurgy and New Materials (ARCI), an autonomous R&amp;D Centre of Department of Sc… [+3034 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Can this pulse monitor detect COVID-19? - Good Morning America", "description": "Pulse oximeters can provide an early warning sign of COVID-19 for patients in hospitals, but are those devices as effective when people use them at home?", "url": "https://www.youtube.com/watch?v=z9sypZ7mWRA", "urlToImage": null, "publishedAt": "2020-04-25T14:28:18Z", "content": "Pulse oximeters can provide an early warning sign of COVID-19 for patients in hospitals, but are those devices as effective when people use them at home?"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "AP", "title": "Italy to ease lockdown on May 4, give free masks - India TV News", "description": "Italy will start distributing free protective masks to nursing homes, many of which have been devastated by coronavirus infections and deaths.", "url": "https://www.indiatvnews.com/news/world/italy-ease-coronavirus-lockdown-may-4-covid-19-free-masks-611217", "urlToImage": null, "publishedAt": "2020-04-25T13:03:04Z", "content": "Image Source : APItaly to ease lockdown on May 4\r\nItaly will start distributing free protective masks to nursing homes, many of which have been devastated by coronavirus infections and deaths. Domenico Arcuri, the governments commissioner for the pandemic, sa… [+797 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Sweden goes it alone with 'relaxed' attitude to coronavirus - CGTN", "description": "Sweden's relaxed restrictions could lead to herd immunity but at what cost?", "url": "https://newseu.cgtn.com/news/2020-04-25/Sweden-goes-it-alone-with-relaxed-attitude-to-coronavirus-PYIUqQSwH6/index.html", "urlToImage": null, "publishedAt": "2020-04-25T12:41:25Z", "content": "Everyone wants immunity from the coronavirus. But there may be different ways to get it.\r\nOne is a vaccine. Clinical trials are already underway in the UK, and if all goes well, say those involved, it's possible a vaccination may be ready for production by Se… [+3523 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": "Team Newsable", "title": "2 COVID-19 patients released by mistake due to name confusion in Uttar Pradesh - Asianet News English", "description": "A confusion due to similar names led to the release of two COVID-19 positive patients from quarantine. The error was later rectified.", "url": "https://newsable.asianetnews.com/india/2-covid-19-patients-released-by-mistake-due-to-name-confusion-in-uttar-pradesh-q9cfuk", "urlToImage": null, "publishedAt": "2020-04-25T12:27:50Z", "content": "Moradabad: A shocking incident has emerged from Moradabad amidst the coronavirus pandemic. On Thursday evening, the health department mistakenly discharged two COVID-19 patients from a quarantine centre as their names were similar to two other persons who tes… [+917 chars]"}, {"source": {"id": null, "name": "Vanguardngr.com"}, "author": "David O Royal", "title": "WHO urges countries to move quickly to save lives from malaria - Vanguard", "description": "WHO has urged countries to move quickly to save lives from malaria in Sub-Saharan Africa as the World commemorates World Malaria Day", "url": "https://www.vanguardngr.com/2020/04/who-urges-countries-to-move-quickly-to-save-lives-from-malaria/", "urlToImage": null, "publishedAt": "2020-04-25T12:20:38Z", "content": "WHO’s Director-General, Dr. Tedros Ghebreyesus.\r\nThe World Health Organisation (WHO) has urged countries to move quickly to save lives from malaria in Sub-Saharan Africa as the World commemorates World Malaria Day (WMD).\r\nThe WHO made the call in a statement … [+3010 chars]"}, {"source": {"id": null, "name": "Newkerala.com"}, "author": null, "title": "COVID-19 vaccine must be considered public good with universal availability: UN chief - New Kerala", "description": "The under-trial vaccine for coronavirus must be considered a global public good and made affordable with universal availability, UN Secretary-General Antonio...", "url": "https://www.newkerala.com/news/2020/72921.htm", "urlToImage": null, "publishedAt": "2020-04-25T11:41:13Z", "content": "The under-trial vaccine for coronavirus must be considered a global public good and made affordable with universal availability, UN Secretary-General Antonio Guterres said on Friday (local time).This comes at the backdrop of clinical trials of a potential COV… [+1392 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Coronavirus And Smoking: French Researchers Suggest Nicotine Could Protect Against Coronavirus - Swarajya", "description": "", "url": "https://swarajyamag.com/news-brief/coronavirus-and-smoking-french-researchers-suggest-nicotine-could-protect-against-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T11:31:00Z", "content": null}, {"source": {"id": null, "name": "India.com"}, "author": "India.com News Desk", "title": "Coronavirus Will be Destroyed by Acids Present in Stomach, Ramdev Makes Bizarre Claim - India.com", "description": "New Delhi: At a time when the entire world is struggling to combat the spread of coronavirus outbreak, Yoga guru Ramdev has come up with a bizarre solution to treat COVID-19. Speaking at an event orga", "url": "https://www.india.com/news/india/coronavirus-will-be-destroyed-by-acids-present-in-stomach-ramdev-makes-bizarre-claim-4010634/", "urlToImage": null, "publishedAt": "2020-04-25T11:18:51Z", "content": "New Delhi: At a time when the entire world is struggling to combat the spread of coronavirus outbreak, Yoga guru Ramdev has come up with a bizarre solution to treat COVID-19. Speaking at an event organised by a media organisation,  Ramdev claimed that if COVI… [+1570 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Plasma therapy trials for coronavirus patients begin in Karnataka - Deccan Herald", "description": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.", "url": "https://www.deccanherald.com/state/top-karnataka-stories/plasma-therapy-trials-for-coronavirus-patients-begin-in-karnataka-829772.html", "urlToImage": null, "publishedAt": "2020-04-25T11:00:06Z", "content": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.\r\nFollow latest updates on the COVID-19 pandemic here\r\nIn a tweet, Medical Education Minister K Sudhakar said, \"Happy to … [+1295 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "Bats cannot directly infect humans with Covid-19: Scientists - Hindustan Times", "description": "According to scientists, Sars-Cov-2 may have diverged from the closest coronavirus found in bats called RaTG13, about 40 to 70 years ago, indicating that the bat virus cannot directly infect humans.", "url": "https://www.hindustantimes.com/india-news/bats-cannot-directly-infect-humans-with-covid-19-scientists/story-uuEwHKcI0x266H1fxawFbN.html", "urlToImage": null, "publishedAt": "2020-04-25T09:30:44Z", "content": "Sixty-four scientists have said bats do not spread Covid-19 after reports of people requesting local authorities to clear trees over a fear of the colonies the winged mammals host.\r\nThe chiropterologists issuing the statement said they came together after rep… [+3518 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Riya Baibhawi", "title": "Doctors say ventilators cause more harm than good to coronavirus patients - Republic World - Republic World", "description": "US doctors are now warning against the use of the ventilators to treat coronavirus patients saying that they were doing more harm than good.", "url": "https://www.republicworld.com/world-news/us-news/doctors-says-ventilators-cause-more-harm-than-good-to-covid-19-patient.html", "urlToImage": null, "publishedAt": "2020-04-25T09:28:00Z", "content": "The demands of ventilators have surged amid the ongoing global health crisis with major countries racing to secure more and more of the breathing machines. However, doctors are now warning against the use of the breathing machines to treat coronavirus patient… [+2040 chars]"}, {"source": {"id": null, "name": "Trtworld.com"}, "author": "TRTWorld", "title": "WHO warns against idea of 'immunity passports' - TRT World", "description": "The concept of “immunity passports” or “risk-free certificates” has been floated as a way of allowing people protected against reinfection to return to work.", "url": "https://www.trtworld.com/life/who-warns-against-idea-of-immunity-passports-35737", "urlToImage": null, "publishedAt": "2020-04-25T08:54:25Z", "content": "The concept of immunity passports or risk-free certificates has been floated as a way of allowing people protected against reinfection to return to work.\r\nThis Wednesday, March 11, 2015 photo shows the World Health Organization headquarters building in Geneva… [+1045 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "AP", "title": "Coronavirus: WHO warns against idea of 'immunity passports' - Deccan Herald", "description": "The World Health Organization is cautioning against the idea of “immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.", "url": "https://www.deccanherald.com/international/world-news-politics/coronavirus-world-health-organization-warns-against-idea-of-immunity-passports-829739.html", "urlToImage": null, "publishedAt": "2020-04-25T08:50:01Z", "content": "The World Health Organization is cautioning against the idea of immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.\r\nThe concept of immunity pas… [+813 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "Cotton, natural silk, chiffon make best materials for homemade masks against COVID-19: study - The Hindu", "description": "According to the researchers, including those from the University of Chicago in the US, SARS-CoV-2, the new coronavirus that causes COVID-19, is thought to spread mainly through respiratory droplets when an infected person coughs, sneezes, speaks or breathes.", "url": "https://www.thehindu.com/news/international/cotton-natural-silk-chiffon-make-best-materials-for-homemade-masks-against-covid-19-study/article31431280.ece", "urlToImage": null, "publishedAt": "2020-04-25T08:19:56Z", "content": "As people resort to making their own cloth masks due to shortage of surgical and N95 varieties in the wake of the COVID-19 pandemic, a new study says a combination of cotton with natural silk or chiffon can filter out aerosol particles provided that the mask … [+2378 chars]"}, {"source": {"id": null, "name": "Thepeninsulaqatar.com"}, "author": "", "title": "Why has Spain been hit so hard by the coronavirus pandemic? - The Peninsula Qatar", "description": "In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told AFP.", "url": "https://www.thepeninsulaqatar.com/article/25/04/2020/Why-has-Spain-been-hit-so-hard-by-the-coronavirus-pandemic", "urlToImage": null, "publishedAt": "2020-04-25T08:01:00Z", "content": "Barcelona: In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told AFP.\r\nWhile they stressed it was too early to carry out a detailed analysis, th… [+4426 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Nations join WHO in virus initiative, but not US - The Star", "description": "World leaders pledged on Friday to accelerate work on tests, drugs and vaccines against Covid-19 and to share them around the globe. But the United States di...", "url": "https://www.youtube.com/watch?v=BSi5E7Grjx8", "urlToImage": null, "publishedAt": "2020-04-25T06:51:50Z", "content": "World leaders pledged on Friday to accelerate work on tests, drugs and vaccines against Covid-19 and to share them around the globe. But the United States did not take part in the launch.\r\nWATCH MORE: https://thestartv.com/c/newsSUBSCRIBE: https://cutt.ly/The… [+37 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Nitin Sreedhar", "title": "When a virus jumps: of man, microbes and pandemics - Livemint", "description": "Climate change effects or complex man-animal interactions—why are zoonotic disease outbreaks like covid-19 becoming more frequent?", "url": "https://www.livemint.com/mint-lounge/features/when-a-virus-jumps-of-man-microbes-and-pandemics-11587735889206.html", "urlToImage": null, "publishedAt": "2020-04-25T05:10:40Z", "content": "Inger Andersen, executive director of the UN Environment Programme, said last month that nature was sending humankind a message\" through the coronavirus pandemic and climate crisis. In an interview with The Guardian, the Danish environmentalist said there wer… [+10236 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "US accounts for over one fourth of global coronavirus deaths - India Today", "description": "The United States accounts for more than one fourth of the global Covid-19 deaths and over one-third of the total number of people infected with the deadly virus, latest figures revealed on Friday.", "url": "https://www.indiatoday.in/world/story/us-accounts-for-over-one-fourth-of-global-coronavirus-deaths-1670864-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T03:34:00Z", "content": "The United States accounts for more than one fourth of the global Covid-19 deaths and over one-third of the total number of people infected with the deadly virus, latest figures revealed on Friday.\r\nThe coronavirus pandemic that started from Wuhan City in Chi… [+4060 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "G Thing: Pet fashion designer finds unique ways to give back to animal rescue crews - PIX11 News", "description": "She's one of the most in demand New York fashion designers for dog and cats.", "url": "https://www.youtube.com/watch?v=WcRkfwYZcdU", "urlToImage": null, "publishedAt": "2020-04-25T03:02:18Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Scientists in Italy find coronavirus on air pollution particles - The Times of Israel", "description": "In preliminary study, researchers detect distinct virus genes on airborne pollutants, suggesting disease could travel farther by air than previously assumed", "url": "https://www.timesofisrael.com/scientists-in-italy-find-coronavirus-on-air-pollution-particles/", "urlToImage": null, "publishedAt": "2020-04-25T01:06:00Z", "content": "In a preliminary study, scientists in Italy detected the coronavirus on particles of air pollution.\r\nIt is still unclear whether the virus is viable or able to cause infections when carried by pollution, according to The Guardian, which first publicized the f… [+1690 chars]"}, {"source": {"id": null, "name": "Telegraphindia.com"}, "author": "By G.S. Mudur", "title": "Doctors: Monitor every Covid patient given HCQ - Telegraph India", "description": "The HCQ and azithromycin combination carries the risk of drug-induced sudden cardiac death", "url": "https://www.telegraphindia.com/india/coronavirus-outbreak-doctors-ask-to-monitor-every-covid-19-patient-given-hcq/cid/1767906", "urlToImage": null, "publishedAt": "2020-04-24T23:26:19Z", "content": "Every Covid-19 patient given the hydroxychloroquine (HCQ) and azithromycin combination should be monitored for adverse cardiac effects, doctors in India and the US said on Friday in cautionary research papers about the therapy adopted by India, the US and oth… [+3153 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "NBC", "title": "Coronavirus update: US study reveals common medical conditions in sickest COVID-19 patients - 7NEWS.com.au", "description": "Researchers have issued a warning to those with the health problems to be hyper-aware of new or unusual symptoms.", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-update-us-study-reveals-common-medical-conditions-in-sickest-covid-19-patients-c-998646", "urlToImage": null, "publishedAt": "2020-04-24T22:49:11Z", "content": "People with obesity, diabetes and high blood pressure are at greater risk for complications from coronavirus, according to a large study of patients hospitalised with the illness it causes.\r\nThe findings, published on Wednesday in the Journal of the American … [+2322 chars]"}, {"source": {"id": null, "name": "Medscape.com"}, "author": null, "title": "COVID-19 Daily: Doctor Support Hotline, New Mortality Data - Medscape", "description": "These are the coronavirus stories you need to know about today.", "url": "https://www.medscape.com/viewarticle/929383", "urlToImage": null, "publishedAt": "2020-04-24T22:32:41Z", "content": "Editor's note: Find the latest COVID-19 news and guidance in Medscape's Coronavirus Resource Center.\r\nHere are the coronavirus stories Medscape's editors around the globe think you need to know about today: \r\nDoctor Support Hotline\r\nIn late March, a Philadelp… [+5366 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Reuters", "title": "Coronavirus and COVID-19: Fact versus fiction - Deccan Herald", "description": "U.S. President Donald Trump's musings about whether disinfectants and ultraviolet light can be inserted into patients' bodies to treat COVID-19 have alarmed doctors and drawn warnings from the makers of Lysol, Dettol and Clorox. Here are some other claims tha…", "url": "https://www.deccanherald.com/science-and-environment/coronavirus-and-covid-19-fact-versus-fiction-829603.html", "urlToImage": null, "publishedAt": "2020-04-24T20:48:45Z", "content": "U.S. President Donald Trump's musings about whether disinfectants and ultraviolet light can be inserted into patients' bodies to treat COVID-19 have alarmed doctors and drawn warnings from the makers of Lysol, Dettol and Clorox.\r\nHere are some other claims th… [+3054 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "5 Things in 5 Minutes in Germany - Can Germany endure a second COVID-19 wave? - TRT World", "description": "This week we are looking at: -The possibility of second coronavirus wave with restrictions loosened -Thousands of students sit final exams, social distancing...", "url": "https://www.youtube.com/watch?v=_RdD5uYofW0", "urlToImage": null, "publishedAt": "2020-04-24T17:38:10Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Les Steed", "title": "How does key worker testing work and what time can I apply for a coronavirus test? - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11469520/key-worker-coronavirus-testing-how-what-time/", "urlToImage": null, "publishedAt": "2020-04-24T17:35:15Z", "content": "MATT HANCOCK announced that testing can now be provided for up to seven million key workers and emergency staff.\r\nHere's how to get tested if you are an essential worker who believes that you or a household member has coronavirus.\r\n Matt Hancock said key work… [+6641 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aylin Woodward", "title": "Coronavirus may cause blood clots and strokes, even in young patients - Business Insider - Business Insider", "description": "A New York doctor said there's been an uptick in the number of local young people having strokes. That could be because of COVID-19-related clots.", "url": "https://www.businessinsider.com/coronavirus-blood-clots-strokes-young-patients-2020-4", "urlToImage": null, "publishedAt": "2020-04-24T17:33:00Z", "content": "Doctors treating COVID-19 patients have begun to document ways in which the disease affects far more than just the lungs.\r\nExperts have reported kidney issues, heart problems, and, more recently, blood clots appearing in various parts of patients' bodies. Suc… [+4237 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Does COVID-19 Cause Blood Clot Complications? | NBC New York - NBC New York", "description": "A small study of five critically ill COVID-19 patients at Mount Sinai Hospital in New York City could have major implications for how doctors respond to the ...", "url": "https://www.youtube.com/watch?v=twPd0YvY3T0", "urlToImage": null, "publishedAt": "2020-04-24T17:18:33Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "David Nikel", "title": "Sweden Health Chief Admits ‘It’s Not Over’ As Coronavirus Cases Leap - Forbes", "description": "Following an additional 131 deaths reported in the last 24 hours, Sweden’s COVID-19 death toll now stands at 2,152.", "url": "https://www.forbes.com/sites/davidnikel/2020/04/24/sweden-health-chief-admits-its-not-over-as-coronavirus-cases-leap/", "urlToImage": null, "publishedAt": "2020-04-24T15:09:59Z", "content": "Sweden's state epidemiologist Anders Tegnell has said the number of COVID-19 deaths in Sweden have ... [+] been higher than expected.\r\nAFP via Getty Images\r\nSwedens state epidemiologist Anders Tegnell has announced a record daily high of coronavirus cases for… [+3119 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": null, "title": "World Immunization Week: WHO highlights other diseases as coronavirus vaccine trials begin - Euronews", "description": "As coronavirus vaccine trials begin in the UK and get the green light in Germany, the World Health Organization warns other diseases must not be neglected.", "url": "https://www.euronews.com/2020/04/23/coronavirus-in-europe-vaccine-trials-begin-in-uk-and-get-green-light-in-germany", "urlToImage": null, "publishedAt": "2020-04-24T14:52:08Z", "content": "The beginning of UK clinical trials this week to find a coronavirus vaccine coincides with the start of World Immunization Week -- encouraging the use of vaccines to protect people against disease generally.\r\nThe event is promoted by the World Health Organiza… [+2089 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AFP", "title": "Coronavirus vaccine: Monkeys largely protected during trial, says Chinese firm - Livemint", "description": "Sinovac Biotech said it injected two different doses of its vaccine into eight rhesus macaque monkeys and exposed them to the virus three weeks later, and they did not develop infections", "url": "https://www.livemint.com/news/world/coronavirus-vaccine-monkeys-largely-protected-during-trial-says-chinese-firm-11587736770613.html", "urlToImage": null, "publishedAt": "2020-04-24T14:13:47Z", "content": "A novel coronavirus vaccine has for the first time \"largely protected\" monkeys from infection during an animal trial, data from a Chinese pharmaceutical giant showed.It is among a slew of vaccines being developed around the world as countries race to stop an … [+3317 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus pandemic | Over 50% consumers quit smoking during lockdown: Report - Moneycontrol", "description": "The survey revealed that over half of those who were interviewed had quit smoking during the ongoing lockdown while nearly 30 percent had reduced their daily consumption.", "url": "https://www.moneycontrol.com/news/business/coronavirus-pandemic-over-50-consumers-quit-smoking-during-lockdown-report-5187161.html", "urlToImage": null, "publishedAt": "2020-04-24T13:43:19Z", "content": "During the lockdown period in India, the consumption of cigarettes has taken a hit. A survey of over 100 smokers, conducted by IIFL Securities, found that around 58 percent respondents have quit smoking following the implementation of the nationwide lockdown … [+2003 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Novel Coronavirus Is A Result Of Crazy Experiments At Wuhan Institute of Virology: Top Russian Microbiologist - Swarajya", "description": "", "url": "https://swarajyamag.com/insta/novel-coronavirus-is-a-result-of-crazy-experiments-at-wuhan-institute-of-virology-top-russian-microbiologist", "urlToImage": null, "publishedAt": "2020-04-24T13:42:15Z", "content": null}]}