{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Maxouris, CNN", "title": "Coronavirus has killed nearly 52,000 people in the US, over a quarter of the world's deaths - CNN", "description": "Less than three months since the first known coronavirus death in the US, the country's reported fatalities make up more than a quarter of the world's known Covid-19 death toll.", "url": "https://www.cnn.com/2020/04/25/health/us-coronavirus-saturday/index.html", "urlToImage": null, "publishedAt": "2020-04-25T14:35:35Z", "content": null}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Hina Zahid", "title": "Dietary counselling during infancy linked to better cardiovascular health in adults - Medical Dialogues", "description": "Researchers have found that regular dietary counselling starting in infancy has positive impact on...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/dietary-counselling-during-infancy-linked-to-better-cardiovascular-health-in-adults-65183", "urlToImage": null, "publishedAt": "2020-04-25T13:45:13Z", "content": "Researchers have found that regular dietary counselling starting in infancy has positive impact on the quality of fat in the diet, as well as on the serum cholesterol level, insulin sensitivity, and blood pressure.\r\nThe Special Turku Coronary Risk Factor Inte… [+2484 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Immunity passports ‘could increase virus spread’ - BBC News", "description": "No evidence people who develop antibodies after recovering are protected against a second infection.", "url": "https://www.bbc.com/news/world-52425825", "urlToImage": null, "publishedAt": "2020-04-25T13:40:47Z", "content": "Image copyrightReutersImage caption\r\n Testing for antibodies is becoming more widespread\r\nGovernments should not issue so-called \"immunity passports\" or \"risk-free certificates\" as a way of easing lockdowns, the World Health Organization (WHO) says.\r\nIt said … [+4744 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Key nose cells identified as entry points for corona: Study - Telangana Today", "description": "London: Researchers have discovered that goblet and ciliated cells in the nose have high levels of the entry proteins that the COVID-19 coronavirus uses to get into our cells. The identification of these cells could help explain the high transmission rate of …", "url": "https://telanganatoday.com/key-nose-cells-identified-as-entry-points-for-corona-study", "urlToImage": null, "publishedAt": "2020-04-25T12:43:00Z", "content": "London: Researchers have discovered that goblet and ciliated cells in the nose have high levels of the entry proteins that the COVID-19 coronavirus uses to get into our cells. The identification of these cells could help explain the high transmission rate of … [+2503 chars]"}, {"source": {"id": null, "name": "Reliefweb.int"}, "author": null, "title": "World Immunization Week | 24 - 30 April 2020: Available vaccines should continue to be offered and utilized to save lives while waiting for an anti COVID-19 vaccine - WHO underlines - World - ReliefWeb", "description": "English News and Press Release on World about Health, Children and Epidemic; published on 24 Apr 2020 by WHO", "url": "https://reliefweb.int/report/world/world-immunization-week-24-30-april-2020-available-vaccines-should-continue-be-offered", "urlToImage": null, "publishedAt": "2020-04-25T12:23:04Z", "content": "24 APRIL 2020 | Cairo – Any suspension of immunization services or hesitancy to use them during the COVID-19 pandemic will result in a resurgence of diseases that have largely been controlled thanks to safe and effective vaccines. That is the warning from the… [+4281 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "'No evidence' yet that recovered COVID patients cannot be reinfected: WHO - Times of India", "description": "Rest of World News: The WHO said on Saturday that there was currently \"no evidence\" that people who have recovered from Covid-19 and have antibodies are protected from a", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/no-evidence-yet-that-recovered-covid-patients-cannot-be-reinfected-who/articleshow/75374877.cms", "urlToImage": null, "publishedAt": "2020-04-25T12:18:47Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Aa.com.tr"}, "author": null, "title": "World Malaria Day: Fight against life-threatening disease - Anadolu Agency", "description": "'No evidence-based information chloroquine medication, used in malaria, protective in COVID-19,' says expert  - Anadolu Agency", "url": "https://www.aa.com.tr/en/health/world-malaria-day-fight-against-life-threatening-disease/1818308", "urlToImage": null, "publishedAt": "2020-04-25T12:10:38Z", "content": "ANKARA \r\nWhile humanity is struggling with coronavirus outbreak, the world is observing on April 25 Malaria Day, highlighting the importance of the fight against another life-threatening disease.\r\nAlthough it is very easy and inexpensive to prevent deaths fro… [+3789 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Jahnavi Sarma", "title": "Can nicotine save you from COVID-19? - TheHealthSite", "description": "After creating hype over hydroxychloroquine and the tuberculosis vaccine as potential cures for COVID-19 researchers now shift their focus to nicotine.", "url": "https://www.thehealthsite.com/news/can-nicotine-save-you-from-covid-19-741768/", "urlToImage": null, "publishedAt": "2020-04-25T12:04:33Z", "content": "With the COVID-19 pandemic showing no signs of abating, scientists across the world are working against time to develop a cure at the earliest. Many trials have started at various places but there is no conclusive evidence of a cure as yet. We are today witne… [+3433 chars]"}, {"source": {"id": null, "name": "Inventiva.co.in"}, "author": "inventiva", "title": "US Accounts For Over One Fourth Of Global COVID-19 Deaths - Inventiva", "description": "The United States accounts for more than one fourth of the global COVID-19 deaths and over one-third of the total number of people infected with the deadly viru", "url": "https://www.inventiva.co.in/stories/inventiva/us-accounts-for-over-one-fourth-of-global-covid-19-deaths/", "urlToImage": null, "publishedAt": "2020-04-25T11:44:09Z", "content": "The United States accounts for more than one fourth of the global COVID-19 deaths and over one-third of the total number of people infected with the deadly virus, latest figures revealed on Friday.\r\nThe coronavirus pandemic that started from Wuhan City in Chi… [+4060 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Coronavirus And Smoking: French Researchers Suggest Nicotine Could Protect Against Coronavirus - Swarajya", "description": "", "url": "https://swarajyamag.com/news-brief/coronavirus-and-smoking-french-researchers-suggest-nicotine-could-protect-against-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T11:31:00Z", "content": null}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Explained Desk", "title": "Explained: How coronavirus may affect the kidneys - The Indian Express", "description": "Kidney damage is common in severe cases of Covid-19. However, it is not yet clear if the virus directly attacks the kidneys, or if kidney failure or damage is a part of multiple-organ failure.", "url": "https://indianexpress.com/article/explained/explained-how-coronavirus-may-affect-the-kidneys-6378915/", "urlToImage": null, "publishedAt": "2020-04-25T11:28:27Z", "content": "A patient undergoes dialysis treatment at a dialysis centre, amidst the coronavirus disease (COVID-19) outbreak, in Guayaquil, Ecuador. (Reuters Photo: Santiago Arcos)Apart from ventilators, another kind of machinery that is in shortage amid the coronaviruspa… [+3849 chars]"}, {"source": {"id": null, "name": "Tribuneindia.com"}, "author": "Tribune India", "title": "Can you catch Covid-19 twice? This is what WHO has to say - The Tribune", "description": "", "url": "https://www.tribuneindia.com/news/health/can-you-catch-covid-19-twice-this-is-what-who-has-to-say-76173", "urlToImage": null, "publishedAt": "2020-04-25T11:08:00Z", "content": "Geneva, April 25\r\nThe World Health Organisation (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nIn a scientific brief, the Unite… [+1678 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Plasma therapy trials for coronavirus patients begin in Karnataka - Deccan Herald", "description": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.", "url": "https://www.deccanherald.com/state/top-karnataka-stories/plasma-therapy-trials-for-coronavirus-patients-begin-in-karnataka-829772.html", "urlToImage": null, "publishedAt": "2020-04-25T11:00:06Z", "content": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.\r\nFollow latest updates on the COVID-19 pandemic here\r\nIn a tweet, Medical Education Minister K Sudhakar said, \"Happy to … [+1295 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "'No Evidence that Recovered Covid-19 Patients Cannot be Reinfected': WHO Warns Against 'Immunity Passport... - News18", "description": "The practice could actually increase the risks of continued spread as people who have recovered may ignore advice about taking standard precautions against the virus, the WHO said.", "url": "https://www.news18.com/news/world/no-evidence-that-recovered-covid-19-patients-cannot-be-reinfected-who-warns-govts-against-immunity-passports-2592409.html", "urlToImage": null, "publishedAt": "2020-04-25T10:36:34Z", "content": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nIn a scientific brief, the United Nations agency w… [+1650 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Hydroxychloroquine could have a beneficial effect on COVID-19 - News-Medical.Net", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMibWh0dHBzOi8vd3d3Lm5ld3MtbWVkaWNhbC5uZXQvbmV3cy8yMDIwMDQyNS9IeWRyb3h5Y2hsb3JvcXVpbmUtY291bGQtaGF2ZS1hLWJlbmVmaWNpYWwtZWZmZWN0LW9uLUNPVklELTE5LmFzcHjSAXFodHRwczovL3d3dy5uZXdzLW1lZGljYWwubmV0L2FtcC9uZXdzLzIwMjAwNDI1L0h5ZHJveHljaGxvcm9xdWluZS1jb3VsZC1oYXZlLWEtYmVuZWZpY2lhbC1lZmZlY3Qtb24tQ09WSUQtMTkuYXNweA?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T10:27:55Z", "content": null}, {"source": {"id": null, "name": "Edexlive.com"}, "author": "Edex Live", "title": "Cotton, natural silk, chiffon make best materials for homemade masks against COVID-19: Study - EdexLive", "description": "In the study, published in the journal ACS Nano, the scientists assessed the ability of common fabrics, alone or in combination, to filter out aerosols similar in size to respiratory droplets", "url": "https://www.edexlive.com/news/2020/apr/25/cotton-natural-silk-chiffon-make-best-materials-for-homemade-masks-against-covid-19-study-11578.html", "urlToImage": null, "publishedAt": "2020-04-25T10:07:19Z", "content": "As people resort to making their own cloth masks due to shortage of surgical and N95 varieties in the wake of the COVID-19 pandemic, a new study says a combination of cotton with natural silk or chiffon can filter out aerosol particles provided that the mask … [+2381 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "'No evidence' that recovered COVID-19 patients cannot be reinfected: WHO - Reuters India", "description": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.", "url": "https://in.reuters.com/article/us-health-coronavirus-who-idINKCN2270FB", "urlToImage": null, "publishedAt": "2020-04-25T09:53:00Z", "content": "GENEVA (Reuters) - The World Health Organization (WHO) said on Saturday that there was currently “no evidence” that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection. \r\nIn a scientific brief, the Uni… [+1753 chars]"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Nirmal Narayanan", "title": "Is coronavirus sexually transmitted? Medical expert answers - International Business Times, India Edition", "description": "A previous study report had suggested that men are more prone to the severity of coronavirus infection due to the presence of testicles in their body.", "url": "https://www.ibtimes.co.in/coronavirus-sexually-transmitted-medical-expert-answers-818377", "urlToImage": null, "publishedAt": "2020-04-25T09:40:27Z", "content": "Top US vaccine expert was 'fired'\r\nThe novel coronavirus that originated in a Wuhan seafood market has been spreading chaos all across the globe for the past four months. With death toll nearing 2,00,000, Covid-19 has affected people in all countries irrespec… [+1912 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "Bats cannot directly infect humans with Covid-19: Scientists - Hindustan Times", "description": "According to scientists, Sars-Cov-2 may have diverged from the closest coronavirus found in bats called RaTG13, about 40 to 70 years ago, indicating that the bat virus cannot directly infect humans.", "url": "https://www.hindustantimes.com/india-news/bats-cannot-directly-infect-humans-with-covid-19-scientists/story-uuEwHKcI0x266H1fxawFbN.html", "urlToImage": null, "publishedAt": "2020-04-25T09:30:44Z", "content": "Sixty-four scientists have said bats do not spread Covid-19 after reports of people requesting local authorities to clear trees over a fear of the colonies the winged mammals host.\r\nThe chiropterologists issuing the statement said they came together after rep… [+3518 chars]"}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "John Ainger", "title": "Why the World’s Highest Virus Death Rate Is in Europe’s Capital - BloombergQuint", "description": "Despite having only 11 million people, Belgium has reported more deaths from the disease than China", "url": "https://www.bloombergquint.com/politics/why-the-world-s-highest-virus-death-rate-is-in-europe-s-capital", "urlToImage": null, "publishedAt": "2020-04-25T08:48:22Z", "content": ""}, {"source": {"id": null, "name": "Oneindia.com"}, "author": "PTI", "title": "You may catch coronavirus more than once: WHO - Oneindia", "description": "The World Health Organization is cautioning against the idea of “immunity passports.' It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.", "url": "https://www.oneindia.com/international/you-may-catch-coronavirus-more-than-once-who-3077941.html", "urlToImage": null, "publishedAt": "2020-04-25T08:40:26Z", "content": "Berlin, Apr 25: The World Health Organization is cautioning against the idea of “immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.\r\nThe concep… [+818 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Health workers are on the frontline of the COVID-19 pandemic - eNCA", "description": "Health workers are on the frontline of the covid-19 pandemic, some get infected and even succumb to the virus. Retshidisitswe Kotane, who recently graduated,...", "url": "https://www.youtube.com/watch?v=8ZrrAJkQu2w", "urlToImage": null, "publishedAt": "2020-04-25T08:34:11Z", "content": null}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "World Malaria Day 2020: WHO tells nations not to compromise on efforts to battle disease during COVID-19... - Firstpost", "description": "WHO says that every year the world witnesses more than 200 million new cases of malaria", "url": "https://www.firstpost.com/health/world-malaria-day-2020-who-tells-nations-not-to-compromise-on-efforts-to-battle-disease-during-covid-19-pandemic-says-67-deaths-among-kids-under-5-8299361.html", "urlToImage": null, "publishedAt": "2020-04-25T08:16:18Z", "content": null}, {"source": {"id": null, "name": "Newslanded.com"}, "author": "https://www.facebook.com/Krish.bkm", "title": "New cells are identified as entry points in COVID-19 - News Landed", "description": "It was found that two cells in the inner lining of the nose had a higher expression of such proteins, providing an easy entry for the virus.", "url": "https://newslanded.com/2020/04/25/new-cells-entry-point-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-25T07:34:15Z", "content": "Since its first emergence in Wuhan last year, we have been trying to clearly understand how the novel coronavirus is interacting with mankind. We already know that the virus is entering our body using ACE-2 receptors as the primary route of entry. However, a … [+2952 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": "https://www.facebook.com/dineshRewale", "title": "e-Agenda AajTak: Not just stay at home but also do yoga at home, says Ramdev - dineshr", "description": "In the wake of the coronavirus pandemic and the nationwide lockdown, people should not just stay and work at home, but they must also perform yoga at home, said yoga…", "url": "https://www.indiatoday.in/india/story/e-agenda-aajtak-yoga-ramdev-coronavirus-pandemic-lockdown-1670908-2020-04-25?utm_source=rss", "urlToImage": null, "publishedAt": "2020-04-25T07:21:40Z", "content": "In the wake of the coronavirus pandemic and the nationwide lockdown, people should not just stay and work at home, but they must also perform yoga at home, said yoga guru Ramdev on Saturday.\r\nRamdev was speaking at a special session at the e-Agenda Aaj Tak.\r\n… [+739 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "ANI", "title": "106-year-old woman who survived Spanish Flu, now beats coronavirus too - Livemint", "description": "Ana del Valle is the oldest survivor of the pandemic outbreaks in Spain.Ana was born in October 1913 and in less than six months she will turn 107", "url": "https://www.livemint.com/news/world/106-year-old-woman-who-survived-spanish-flu-now-beats-coronavirus-too-11587798144700.html", "urlToImage": null, "publishedAt": "2020-04-25T07:15:52Z", "content": "Madrid: We may have all heard that miracles do happen, but sadly not all of us have the chance to witness them in our daily lives, especially during a pandemic today which brings the world to a standstill.Citing a similar story of survival, The Olive Press, a… [+2495 chars]"}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "Ravil Shirodkar, P R Sanjai", "title": "India Allows Neighborhood Stores to Reopen, Keeps Malls Shut - BloombergQuint", "description": "The shops can deploy a maximum of 50% of their staff, all wearing masks and following social distancing rules.", "url": "https://www.bloombergquint.com/coronavirus-outbreak/india-allows-neighborhood-stores-to-reopen-keeps-malls-shut", "urlToImage": null, "publishedAt": "2020-04-25T05:50:12Z", "content": "(Bloomberg) -- \r\nIndias government is allowing smaller neighborhood stores to reopen, bringing relief to residents after a month into the worlds biggest lockdown thats restricting 1.3 billion people.\r\nThe shops can deploy a maximum of 50% of their staff, all … [+1820 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Nitin Sreedhar", "title": "When a virus jumps: of man, microbes and pandemics - Livemint", "description": "Climate change effects or complex man-animal interactions—why are zoonotic disease outbreaks like covid-19 becoming more frequent?", "url": "https://www.livemint.com/mint-lounge/features/when-a-virus-jumps-of-man-microbes-and-pandemics-11587735889206.html", "urlToImage": null, "publishedAt": "2020-04-25T05:10:40Z", "content": "Inger Andersen, executive director of the UN Environment Programme, said last month that nature was sending humankind a message\" through the coronavirus pandemic and climate crisis. In an interview with The Guardian, the Danish environmentalist said there wer… [+10236 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Aswathi Pacha", "title": "Stop villainising bats, say scientists and conservationists - The Hindu", "description": "The mammals do not spread COVID-19, they say", "url": "https://www.thehindu.com/sci-tech/energy-and-environment/stop-villainising-bats-say-scientists-and-conservationists/article31429962.ece", "urlToImage": null, "publishedAt": "2020-04-25T04:24:55Z", "content": "Unverified news and social media posts linking bats to the COVID-19 outbreak have led to widespread antipathy and there have been increasing incidents of the public destroying bat roosts and smoking them out. To raise awareness, 64 chiropterologists (those wh… [+2199 chars]"}, {"source": {"id": null, "name": "Wefornews.com"}, "author": "admin", "title": "Agra reports seven new COVID-19 cases, tally 348 - WeForNews", "description": "Agra, April 25 With seven more COVID-19 positive cases reported on Friday, the total count of virus-infected people in Agra has reached 348, a health official said on Saturday. The city has reported eight Covid deaths, while a total of 32 patients have been c…", "url": "https://www.wefornews.com/agra-reports-seven-new-covid-19-cases-tally-348/", "urlToImage": null, "publishedAt": "2020-04-25T04:14:52Z", "content": "Agra, April 25 With seven more COVID-19 positive cases reported on Friday, the total count of virus-infected people in Agra has reached 348, a health official said on Saturday.\r\nThe city has reported eight Covid deaths, while a total of 32 patients have been … [+937 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Coronavirus Detected on Air Pollution Particles That May Carry It Over Long Distances, Scientists Warn - News18", "description": "Leonardo Setti at the University of Bologna in Italy said it was imperative to investigate if the the coronavirus could be transported through air pollution.", "url": "https://www.news18.com/news/world/coronavirus-detected-on-air-pollution-particles-that-may-carry-it-over-long-distances-scientists-warn-2591919.html", "urlToImage": null, "publishedAt": "2020-04-25T03:39:15Z", "content": "The novel coronavirus has been found on air pollution particles by scientists who are studying if this could allow the virus to advance longer distances, resulting in more number of people contracting it, The Guardian reported.\r\nThe work is still in the initi… [+2716 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Health Headlines - 4-24-20 - FOX 47 News", "description": "In today's health headlines we talk about COVID toes, toes that are red and swollen. There is no correlation to say that people with these symptoms have COVI...", "url": "https://www.youtube.com/watch?v=laF68DLqBuA", "urlToImage": null, "publishedAt": "2020-04-25T03:33:13Z", "content": "In today's health headlines we talk about COVID toes, toes that are red and swollen. There is no correlation to say that people with these symptoms have COVID-19 but they tend to clear up in a few weeks."}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Neelakshi Varma", "title": "World Malaria Day: Why a disease thousands of years old continues to kill - ThePrint", "description": "Malaria, which kills around 5 lakh people every year, is caused by a parasite transmitted through mosquito bites.", "url": "https://theprint.in/science/world-malaria-day-why-a-disease-thousands-of-years-old-continues-to-kill/407384/", "urlToImage": null, "publishedAt": "2020-04-25T02:17:00Z", "content": "Edinburgh: Mosquitoes in warm and sultry parts of the world have been agents of great misery for thousands of years, carrying within them microscopic parasites that are responsible for around 5 lakh deaths annually. \r\nThese parasites belong to the Plasmodium … [+5301 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Candace Sutton", "title": "Coronavirus: How it kills in ‘ferocious rampage’ from brain to toes - NEWS.com.au", "description": "How COVID-19 kills in ‘ferocious rampage from brain to toes’", "url": "https://www.news.com.au/world/coronavirus/health/how-covid19-kills-in-ferocious-rampage-from-brain-to-toes/news-story/76f8edff42d1302b2c9acc8211547ea6", "urlToImage": null, "publishedAt": "2020-04-25T02:03:37Z", "content": "COVID-19 kills in a ferocious rampage through the body from brain to toes doctors have explained, saying the virus acts like no pathogen humanity has ever seen.In an article in sciencemag.org, frontline clinicians caring for the five per cent who become criti… [+7241 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Agencies", "title": "New study shows Covid-19 infections in Italy began in January - Hindustan Times", "description": "Cases and deaths immediately surged, with scientists soon suspecting that the virus had been around, unnoticed, for weeks.", "url": "https://www.hindustantimes.com/world-news/new-study-shows-covid-19-infections-in-italy-began-in-january/story-wRNRjYvRnrKcWirig4bkUN.html", "urlToImage": null, "publishedAt": "2020-04-25T01:37:52Z", "content": "The first Covid-19 infections in Italy date back to January, according to a scientific study presented on Friday, shedding new light on the origins of the outbreak in one of the world’s worst-affected countries.\r\nItaly began testing people after diagnosing it… [+792 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Four-month-old baby from Malappuram dies of Covid-19 - Times of India", "description": "The four-month-old girl child, who tested positive for coronavirus infection two days ago and was under treatment at Kozhikode Medical College Hospita", "url": "https://timesofindia.indiatimes.com/city/kozhikode/four-month-old-baby-from-malappuram-dies-of-covid-19/articleshow/75342997.cms", "urlToImage": null, "publishedAt": "2020-04-24T23:31:25Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "Wjla.com"}, "author": "SCOTT THUMAN, Sinclair Broadcast Group", "title": "Trump signs relief bill into law as some states begin to reopen parts of their economy - KOMO News", "description": "WASHINGTON (SBG) &mdash; President Donald Trump on Friday signed the latest relief package into law &mdash;a whopping $484 billion to help small businesses, hospitals, and testing.  Video: Sinclair Broadcast Group. At the same time, a handful of states are st…", "url": "http://wjla.com/news/coronavirus/trump-signs-relief-bill-into-law", "urlToImage": null, "publishedAt": "2020-04-24T20:14:00Z", "content": null}, {"source": {"id": null, "name": "Devdiscourse.com"}, "author": "Reuters", "title": "Coronavirus and COVID-19: Fact versus fiction - Devdiscourse", "description": "U.S. President Donald Trumps musings about whether disinfectants and ultraviolet light can be inserted into patients bodies to treat COVID-19 have alarmed doct", "url": "https://www.devdiscourse.com/article/health/1023132-coronavirus-and-covid-19-fact-versus-fiction", "urlToImage": null, "publishedAt": "2020-04-24T19:33:19Z", "content": "U.S. President Donald Trump's musings about whether disinfectants and ultraviolet light can be inserted into patients' bodies to treat COVID-19 have alarmed doctors and drawn warnings from the makers of Lysol, Dettol and Clorox.\r\nHere are some other claims th… [+3043 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Samantha  Black, PhD, The Science Advisory Board staff writer", "title": "Experts discuss promising strategies for tackling SARS-CoV-2 - The Science Board", "description": "What's the best strategy for developing treatments for the SARS-CoV-2 virus? The most promising approaches for a rapid response are antivirals and gene therapy, according to a new review article published April 24 in <em>Frontiers in Microbiology</em>.", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=687", "urlToImage": null, "publishedAt": "2020-04-24T19:24:18Z", "content": "In an unprecedented effort, hundreds of thousands of researchers and clinicians from around the world are fighting against the clock to develop cures, vaccines, and diagnostics for COVID-19, the illness caused by the virus SARS-CoV-2. To date, over 1,650 acad… [+6253 chars]"}, {"source": {"id": null, "name": "Webmd.com"}, "author": "Brenda  Goodman, MA", "title": "Blood Clots Are Another Dangerous COVID-19 Mystery - WebMD", "description": "Around the world, doctors caring for COVID-19 patients have been trying to make sense of the same thing. When they draw blood from COVID patients, it clots in the tubes.", "url": "https://www.webmd.com/lung/news/20200424/blood-clots-are-another-dangerous-covid-19-mystery", "urlToImage": null, "publishedAt": "2020-04-24T18:46:44Z", "content": "He says this theory of infection explains some things that doctors have been trying to puzzle out.\r\nFor example, certain conditions like high blood pressure, diabetes, and heart disease stress the endothelium. Its no surprise, then, that people who have these… [+1776 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Madeline Farber", "title": "First known US coronavirus fatality did not show signs of virus, father claims - Fox News", "description": "A California woman whose death in early February is said to be the first known COVID-19 fatality in the U.S. allegedly did not show any signs of the virus before passing away, her father claims.", "url": "https://www.foxnews.com/health/first-known-coronavirus-fatality-us-signs-of-virus", "urlToImage": null, "publishedAt": "2020-04-24T18:39:48Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nA California woman whose death in early February is now said to be the first known COVID-19 fatality in the U.S. did not show any signs of the virus before dying, he… [+2047 chars]"}, {"source": {"id": null, "name": "Greaterkashmir.com"}, "author": null, "title": "Key nose cells identified as likely entry points of coronavirus - Greater Kashmir", "description": "Key nose cells identified as likely entry points of coronavirus Greater Kashmir | Scientists have identified two specific cell types in the nose as likely initial infection points for the novel coronavirus that causes COVID-19. The", "url": "https://www.greaterkashmir.com/news/health/key-nose-cells-identified-as-likely-entry-points-of-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-24T18:39:45Z", "content": null}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "The Hans India", "title": "2nd wave of virus outbreak in monsoon, warn scientists - The Hans India", "description": "The trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the...", "url": "https://www.thehansindia.com/news/national/2nd-wave-of-virus-outbreak-in-monsoon-warn-scientists-619062", "urlToImage": null, "publishedAt": "2020-04-24T18:35:48Z", "content": "New Delhi: The trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the lockdown is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say scient… [+2291 chars]"}, {"source": {"id": null, "name": "Arunachaltimes.in"}, "author": null, "title": "Fight against malaria could be set back 20 years, WHO warns - The Arunachal Times", "description": null, "url": "https://arunachaltimes.in/index.php/2020/04/25/fight-against-malaria-could-be-set-back-20-years-who-warns/", "urlToImage": null, "publishedAt": "2020-04-24T18:08:00Z", "content": "Cape Town, Apr 24 (AP) One of the hard lessons the World Health Organization learned during the Ebola outbreak in West Africa was this: Other diseases can be forgotten and take a deadlier toll.The WHO is now warning that the battle against malaria in sub-Saha… [+2802 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mashable News Staff", "title": "Chinese Biotech’s COVID-19 Vaccine Can Protect Monkeys, Claims Report - Mashable India", "description": "A vaccine developed by a Beijing-based company, Sinovac Biotech has proved to be effective at protecting monkeys from getting COVID-19. The vaccine based on chemically inactivated coronavirus is one of six vaccines that are in the ‘clinical evaluation’ phase.", "url": "https://in.mashable.com/science/13474/chinese-biotechs-covid-19-vaccine-can-protect-monkeys-claims-report", "urlToImage": null, "publishedAt": "2020-04-24T17:06:00Z", "content": "A vaccine candidate developed by a Beijing-based company, Sinovac Biotech has proved to be effective at protecting monkeys from getting COVID-19.\r\nCurrently, researchers from all over the world are trying to develop vaccines based on various approaches and th… [+2080 chars]"}, {"source": {"id": null, "name": "Newsonair.com"}, "author": null, "title": "Telangana: 13 more people tested COVID positive during past 24 hrs - All India Radio", "description": "In Telangana, 13 more people tested positive for Coronavirus during the past 24 hours.  With this, the number of total Covid-19 cases in the state has gone up to 983.", "url": "http://newsonair.com/Main-News-Details.aspx?id=386611", "urlToImage": null, "publishedAt": "2020-04-24T16:06:45Z", "content": "In Telangana, 13 more people tested positive for Coronavirus during the past 24 hours.  With this, the number of total Covid-19 cases in the state has gone up to 983. State Health Minister E. Rajender informed a media conference this evening that more cases a… [+1000 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Sweden to shut bars and restaurants that ignore coronavirus restrictions - Reuters India", "description": "Sweden warned on Friday it would shut restaurants and bars in the capital that did not comply with guidelines aimed at preventing the spread of the novel coronavirus, amid signs Stockholm residents were beginning to ignore the rules.", "url": "https://in.reuters.com/article/health-coronavirus-sweden-stockholm-idINKCN2262C2", "urlToImage": null, "publishedAt": "2020-04-24T15:05:14Z", "content": "STOCKHOLM (Reuters) - Sweden warned on Friday it would shut restaurants and bars in the capital that did not comply with guidelines aimed at preventing the spread of the novel coronavirus, amid signs Stockholm residents were beginning to ignore the rules. \r\nT… [+2132 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Matthew Binnicker", "title": "Coronavirus Tests To Reopen The Economy Have Important Limitations, Notes This Diagnostics Expert - Forbes", "description": "Two types of coronavirus tests are crucial for re-opening the economy. But it's important to remember that they're not perfect.", "url": "https://www.forbes.com/sites/coronavirusfrontlines/2020/04/24/coronavirus-tests-to-reopen-the-economy-have-important-limitations-notes-this-diagnostics-expert/", "urlToImage": null, "publishedAt": "2020-04-24T14:57:08Z", "content": "As tests are used to re-open the economy, it's important to remember that they're no perfect. \r\nDaniel Reinhardt/picture alliance via Getty Images\r\nAs the COVID-19 pandemic continues to rage in many parts of the country, there are signs for guarded optimism. … [+4842 chars]"}, {"source": {"id": null, "name": "Healio.com"}, "author": null, "title": "Dermatology expert weighs in on 'COVID toes,' tracking dermatologic symptoms of COVID-19 - Healio", "description": "As the world continues to struggle with the COVID-19 pandemic, new symptoms of the virus continue to be identified. One such symptom, purple or red lesions on the toes and hands, has been dubbed &ldquo;COVID toes&rdquo; and has gained attention over recent we…", "url": "https://www.healio.com/dermatology/dermatitis/news/online/{1f54025b-e860-4862-979d-46daebae6818}/dermatology-expert-weighs-in-on-covid-toes-tracking-dermatologic-symptoms-of-covid-19", "urlToImage": null, "publishedAt": "2020-04-24T14:39:27Z", "content": "As the world continues to struggle with the COVID-19 pandemic, new symptoms of the virus continue to be identified. One such symptom, purple or red lesions on the toes and hands, has been dubbed “COVID toes” and has gained attention over recent weeks. \r\nHeali… [+15263 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "Coronavirus outcome of crazy experiments at Wuhan: Russian scientist - Northeast Now", "description": "A leading Russian microbiologist has claimed that the novel coronavirus is the outcome of \"crazy\" experiments conducted by scientists at the Wuhan Institute of Virology. Coronavirus originated in Chinas Wuhan city in December last year. In an interview to Rus…", "url": "https://nenow.in/health/coronavirus-outcome-of-crazy-experiments-at-wuhan-russian-scientist.html/", "urlToImage": null, "publishedAt": "2020-04-24T13:37:37Z", "content": "A leading Russian microbiologist has claimed that the novel coronavirus is the outcome of “crazy” experiments conducted by scientists at the Wuhan Institute of Virology.\r\nCoronavirus originated in Chinas Wuhan city in December last year.\r\nIn an interview to R… [+1896 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Shyama Rajagopal", "title": "Experts divided over efficacy of tests - The Hindu", "description": "One group says RT-PCR, antibody test lack sensitivity to detect virus in one attempt", "url": "https://www.thehindu.com/news/national/kerala/experts-are-divided-on-efficacy-of-tests/article31425247.ece", "urlToImage": null, "publishedAt": "2020-04-24T12:44:58Z", "content": "At a time when there is a clamour for more testing to isolate those with severe acute respiratory syndrome corona virus (SARS-CoV-2), experts are divided on the efficacy of the tests.\r\nWhile one group opines that neither the reverse transcriptase polymerase c… [+2537 chars]"}, {"source": {"id": null, "name": "Dailysabah.com"}, "author": "Associated Press", "title": "Fight against malaria could be set back 20 years by coronavirus pandemic, WHO warns | Daily Sabah - Daily Sabah", "description": "One of the hard lessons the World Health Organization (WHO) learned during the Ebola outbreak in West Africa was this: Other diseases can be forgotten and take a deadlier...", "url": "https://www.dailysabah.com/life/health/fight-against-malaria-could-be-set-back-20-years-by-coronavirus-pandemic-who-warns", "urlToImage": null, "publishedAt": "2020-04-24T12:41:06Z", "content": "One of the hard lessons the World Health Organization (WHO) learned during the Ebola outbreak in West Africa was this: Other diseases can be forgotten and take a deadlier toll.\r\nWHO is now warning that the battle against malaria in sub-Saharan Africa, where i… [+2813 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Can I get coronavirus from my pet? - India Today", "description": "There's no evidence pets are spreading the virus to people. However, there have been a few cases worldwide where animals likely got the virus from humans, according to the US Department of Agriculture and US Centers for Disease Control and Prevention.", "url": "https://www.indiatoday.in/science/story/can-i-get-coronavirus-from-my-pet-1670664-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T12:31:07Z", "content": null}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Reuters", "title": "Coronavirus: US Covid-19 death toll expected to reach 50,000 today - Livemint", "description": "About 875,000 Americans have contracted the coronavirus disease, and on average about 2,000 have died every day this month.Deaths are also likely higher, as most states only count hospital and nursing home victims and not those who died at home", "url": "https://www.livemint.com/news/india/coronavirus-us-covid-19-death-toll-expected-to-reach-50-000-today-11587728517502.html", "urlToImage": null, "publishedAt": "2020-04-24T11:57:01Z", "content": "The US death toll from the novel coronavirus is expected to reach 50,000 on Friday, doubling in 10 days and the highest in the world, according to a Reuters tally.About 875,000 Americans have contracted the highly contagious respiratory illness COVID-19 cause… [+2472 chars]"}, {"source": {"id": null, "name": "Imperial.ac.uk"}, "author": null, "title": "Coronavirus 'map' identifies key virus entry points into the body | Imperial News - Imperial College London", "description": "Scientists are creating a map of the human body to identify locations where the COVID-19 virus can enter human cells.", "url": "https://www.imperial.ac.uk/news/197114/coronavirus-identifies-virus-entry-points-into/", "urlToImage": null, "publishedAt": "2020-04-24T11:36:27Z", "content": "Scientists are creating a map of the human body to identify locations where the COVID-19 virus can enter human cells.\r\nThe research, from a number of international institutions including Imperial College London, has so far identified likely initial infection … [+5951 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Vinod Rathore", "title": "Blood thickening, clots in covid-19 patients alarm doctors - News Track English", "description": "New York: A new news related to the corona virus has shocked doctors. This virus is now clotting the blood of the body of the infected. Nephrologists at Mount Sinai Hospital in New York, New York, USA have found that blood is also accumulating in the kidneys …", "url": "https://english.newstracklive.com/news/blood-blockage-in-body-of-corona-patients-says-doctors-mc24-nu764-ta272-1087286-1.html", "urlToImage": null, "publishedAt": "2020-04-24T11:31:04Z", "content": null}, {"source": {"id": null, "name": "Edexlive.com"}, "author": "Edex Live", "title": "Dietary supplements important weapon for fighting off COVID-19, say researchers - EdexLive", "description": "In particular vitamin C, vitamin D, zinc, and an omega-3 fatty acid found in fish, docosahexaenoic acid, also known as DHA, are critical for immune function", "url": "https://www.edexlive.com/news/2020/apr/24/dietary-supplements-important-weapon-for-fighting-off-covid-19-say-researchers-11557.html", "urlToImage": null, "publishedAt": "2020-04-24T11:08:04Z", "content": "Supplements containing vitamins C and D and other micronutrients are a safe, effective and low-cost means of helping your immune system fight off COVID-19 and other acute respiratory tract diseases, say researchers.\r\nAccording to the study, published in the j… [+2042 chars]"}, {"source": {"id": null, "name": "Scoopwhoop.com"}, "author": "Akanksha Bhatia", "title": "Proud To Be Your Husband: A Coronavirus Patient's Heartbreaking Last Words To His Wife - ScoopWhoop", "description": "She found the note on his phone after he passed away from COVID-19.", "url": "https://www.scoopwhoop.com/culture/proud-to-be-your-husband-a-coronavirus-patient-s-heartbreaking-last-words-to-his-wife/", "urlToImage": null, "publishedAt": "2020-04-24T10:59:15Z", "content": "Across the world, people are losing their loved ones in this fight against the pandemic. Some get the chance to say goodbye, while others don't. \r\nSource: Gofundme\r\n32-year-old Jon was being treated for the past month, after he tested positive. And when Katie… [+1300 chars]"}, {"source": {"id": null, "name": "Sentinelassam.com"}, "author": "Mili Basumatary", "title": "Vaccine could be available for the UK’s front-line workers this year, says scientist - The Sentinel Assam", "description": "Two scientists who are leading the charge for a vaccine in the UK have been speaking about their projects.\r\n\r\nProfessor Sarah Gilbert", "url": "https://www.sentinelassam.com/international/vaccine-could-be-available-for-the-uks-front-line-workers-this-year-says-scientist/", "urlToImage": null, "publishedAt": "2020-04-24T10:16:26Z", "content": "London: Two scientists who are leading the charge for a vaccine in the UK have been speaking about their projects.\r\nProfessor Sarah Gilbert is head of a team at the University of Oxford. Trials, which have had 5,000 volunteers, are set to begin on Thursday, t… [+1056 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Covid causing blood clots in patients: Docs - ETHealthworld.com", "description": "The number of COVID-19 cases crossed the 2.5 million mark recently, as researchers rush to make new findings and search for a vaccine.", "url": "https://health.economictimes.indiatimes.com/news/industry/covid-causing-blood-clots-in-patients-docs/75345684", "urlToImage": null, "publishedAt": "2020-04-24T10:02:21Z", "content": "As coronavirus spread through New York City in late March, doctors at Mount Sinai Hospital noticed something strange happening to patients blood. Signs of blood thickening and clotting were being detected in different organs by doctors from different specialt… [+1180 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Peter Sullivan", "title": "Controversial idea to speed coronavirus vaccine gains ground | TheHill - The Hill", "description": "An idea that might seem outlandish at first is gaining some ground as a way to speed de...", "url": "https://thehill.com/policy/healthcare/494417-controversial-idea-to-speed-coronavirus-vaccine-gains-ground", "urlToImage": null, "publishedAt": "2020-04-24T10:00:37Z", "content": "An idea that might seem outlandish at first is gaining some ground as a way to speed development of a coronavirus vaccine: intentionally infecting people with the virus as part of a trial.\r\nThe idea, known as a challenge trial, would deliberately infect a few… [+4702 chars]"}, {"source": {"id": null, "name": "Selectscience.net"}, "author": "SelectScience", "title": "Pfizer, BioNTech COVID-19 vaccine cleared for human tests - SelectScience", "description": "Pfizer and BioNTech to start human trials of COVID-19 vaccine", "url": "https://www.selectscience.net/industry-news/pfizer-and-biontech-to-start-human-trials-of-covid-19-vaccine/?artID=51330", "urlToImage": null, "publishedAt": "2020-04-24T09:09:30Z", "content": null}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "India may see second wave of COVID-19 outbreak in monsoon, say scientists - The Financial Express", "description": "The timing of the peak will depend on how India is able to control physical distancing and on the level of infection spreads after restrictions are relaxed, they said.", "url": "https://www.financialexpress.com/lifestyle/health/india-may-see-second-wave-of-covid-19-outbreak-in-monsoon-say-scientists/1938497/", "urlToImage": null, "publishedAt": "2020-04-24T08:55:53Z", "content": "The trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the lockdown is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say scientists.\r\nThe … [+6136 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nLizzie Roberts", "title": "Contact tracing: how has it worked for other countries, and could it really help ease UK lockdown? - The Telegraph", "description": "From teams of 'corona detectives' to Army cadets making thousands of calls a day, countries are tracking the spread of Covid-19", "url": "https://www.telegraph.co.uk/news/2020/04/25/what-contact-tracing-how-work-countries-uk-lockdown/", "urlToImage": null, "publishedAt": "2020-04-24T06:57:00Z", "content": "Countries around the world are rushing to launch contact tracing apps to identify who an infected person has had contact with, as part of efforts to slow the spread of the coronavirus. \r\nThe UK Government has announced the infrastructure was being put in plac… [+1754 chars]"}, {"source": {"id": null, "name": "Citytoday.news"}, "author": "CTBUREAU_NAV", "title": "Nearly 90% Covid-19 patients put on ventilators in New York hospitals died, shows Study - citytoday", "description": "Health News, International, (New York), April 24:-Researchers have found that nearly all coronavirus (COVID-19) hospitalised patients placed on mechanical ventilators in New York's largest health syst", "url": "https://citytoday.news/nearly-90-covid-19-patients-put-on-ventilators-in-new-york-hospitals-died-shows-study/", "urlToImage": null, "publishedAt": "2020-04-24T06:36:15Z", "content": "Health News, International, (New York), April 24:-Researchers have found that nearly all coronavirus (COVID-19) hospitalised patients placed on mechanical ventilators in New York’s largest health system have died.\r\nFor the findings, published in the Journal o… [+1800 chars]"}, {"source": {"id": null, "name": "Futurism.com"}, "author": null, "title": "COVID Patients Are Getting Mysterious and Deadly Blood Clots - Futurism", "description": "\"The problem we are having is that while we understand that there is a clot, we don’t yet understand why there is a clot.\"", "url": "https://futurism.com/neoscope/covid-patients-deadly-blood-clots", "urlToImage": null, "publishedAt": "2020-04-23T21:04:34Z", "content": "Scientists and healthcare workers are still trying to make sense of the many symptoms of COVID-19.\r\nFrom extensive lung and blood vessel damage to the loss of smell and taste and even strange discoloration of toes, questions linger about the deadly virus curr… [+1228 chars]"}, {"source": {"id": null, "name": "Hydnews.net"}, "author": null, "title": "After Recovery, Long-Term #Covid Effects Remain In The Body Causes Reversal - #KhabarLive Hyderabad", "description": "Hyderabad's First Digital Newspaper", "url": "http://www.hydnews.net/after-recovery-long-term-covid-effects-remain-in-the-body-causes-reversal/", "urlToImage": null, "publishedAt": "2020-04-23T20:38:00Z", "content": "Experts explain what damage COVID-19 might cause, even after someone recovers from the disease. As doctors and scientists race to understand the many ways in which COVID-19 the illness caused by the novel coronavirus affects the brain and body, theyre also tr… [+6502 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Blood Clots a New Surprise Side Effect in Coronavirus Patients | NBC10 Philadelphia - NBC10 Philadelphia", "description": "Doctors are noticing a new trend in COVID-19 patients in the form of blood clots. NBC10’s Matt DeLucia spoke with two local doctors about what they’re seeing...", "url": "https://www.youtube.com/watch?v=t2Bu8mqxwrg", "urlToImage": null, "publishedAt": "2020-04-23T17:56:50Z", "content": "Doctors are noticing a new trend in COVID-19 patients in the form of blood clots. NBC10s Matt DeLucia spoke with two local doctors about what theyre seeing at hospitals. \r\n_____\r\nSUBSCRIBE TO NBC10: VISIT the NBC10 channel for the latest news and exclusive re… [+437 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Yeji Jesse Lee", "title": "'COVID Toes' might be the latest unusual sign that people are infected with the novel coronavirus - Business Insider India", "description": "COVID Toes, purple and swollen toes that look like they've been frostbitten, may be the latest indication of coronavirus infection.The American Academy of", "url": "https://www.businessinsider.in/science/news/covid-toes-might-be-the-latest-unusual-sign-that-people-are-infected-with-the-novel-coronavirus/articleshow/75329215.cms", "urlToImage": null, "publishedAt": "2020-04-23T15:00:00Z", "content": "Purple and swollen toes that look like they've been frostbitten may be the latest indication of coronavirus infection, doctors say.\r\nDubbed 'COVID Toes' by the dermatology community, this symptom could be the latest indication that you should get tested for c… [+5331 chars]"}]}