{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Republicworld.com"}, "author": "Vishal Tiwari", "title": "Contact-tracing apps cant replace public health workforce in COVID-19 fight, says WHO - Republic World - Republic World", "description": "WHO executive director on May 4 said that apps cannot replace \"boots-on-the-ground\" surveillance measures in the fight against coronavirus.", "url": "https://www.republicworld.com/world-news/rest-of-the-world-news/who-says-apps-cannot-replace-basic-human-workforce-on-ground.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/3rsyojofwajrxgjh_1588632414.jpeg?tr=f-jpeg", "publishedAt": "2020-05-05T02:01:00Z", "content": "The World Health Organisation (WHO) on May 4 said that contact-tracing apps cannot replace old-fashioned \"boots-on-the-ground\" surveillance measures in the fight against Coronavirus even though they can be efficient in the tracing processes. WHO Executive Dir… [+2345 chars]"}, {"source": {"id": null, "name": "Yourstory.com"}, "author": "Anju Ann Mathew", "title": "On World Hand Hygiene Day, these 5 organisations are championing the cause - YourStory", "description": "In light of the ongoing pandemic, these five organisations are promoting handwashing and hand-drying to prevent the spread of the novel coronavirus and break the chain of infection.", "url": "https://yourstory.com/socialstory/2020/05/world-hand-hygiene-day-campaigns-coronavirus", "urlToImage": "https://images.yourstory.com/cs/5/98c65090592f11ea9f62339ce853ca75/Imageq0hb-1588604938787.jpg?fm=png&auto=format", "publishedAt": "2020-05-05T01:44:57Z", "content": "At present, the world is fighting the coronavirus pandemic — something that has taken control of our every breath and is putting immense pressure on personal hygiene — especially hand hygiene.\r\nWith the increasing number of positive COVID-19 cases globally, p… [+4461 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "World Asthma Day: Know about the different kinds of asthma - Times of India", "description": "As per the World Health Center (WHO), 15–20 million people in India are suffering from asthma and of all, 10%–15% are children.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/world-asthma-day-know-about-the-different-kinds-of-asthma/photostory/75539112.cms", "urlToImage": "https://static.toiimg.com/photo/75539135.cms", "publishedAt": "2020-05-05T01:30:00Z", "content": "Asthma is a chronic medical condition that affects the airways making it difficult to breathe. The air passage narrows and swells, leading to wheezing, shortness of breath, and coughing. As per the World Health Center (WHO), 15–20 million people in India are … [+407 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Bloomberg", "title": "Coronavirus may cause fatal blood clots harming organs from brain to toes: Doctors - Hindustan Times", "description": "Coronavirus: The problem is visible in clots -- doctors call them thrombi -- that form in Covid-19 patients’ arterial catheters and filters used to support failing kidneys. More pernicious are the clots that impede blood flow in the lungs, causing difficulty …", "url": "https://www.hindustantimes.com/science/coronavirus-causes-life-threatening-blood-clots-harming-organs-from-brain-to-toes-doctors/story-cc36kS66ZApuKMLAdDwVYP.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/05/Pictures/disease-hospital-medical-workers-moscow-patients-coronavirus_63746020-8e6e-11ea-8c4e-d383a7371370.jpg", "publishedAt": "2020-05-05T01:26:45Z", "content": "Another threat from the lung virus that causes Covid-19 has emerged that may cause swift, sometimes fatal damage: blood clots.\r\nDoctors around the world are noting a raft of clotting-related disorders -- from benign skin lesions on the feet sometimes called “… [+6109 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Hina Zahid", "title": "New three-drug combo effectively eradicates H pylori infection in adults - Medical Dialogues", "description": "The three-drug combination of omeprazole, amoxicillin, and rifabutin in one capsule, RHB-105,...", "url": "https://medicaldialogues.in/medicine/news/new-three-drug-combo-effectively-eradicates-h-pylori-infection-in-adults-65422", "urlToImage": "https://medicaldialogues.in/h-upload/2020/05/01/1200x630_128091-three-drug-combination.jpg?width=1200&height=630", "publishedAt": "2020-05-05T00:30:51Z", "content": "The three-drug combination of omeprazole, amoxicillin, and rifabutin in one capsule, RHB-105, effectively eradicates Helicobacter pylori infection in adults. The novel formulation was found to still be effective and well-tolerated in an environment of clinica… [+1619 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "India a step closer to making key drug to treat Covid-19 - Hindustan Times", "description": "India is part of the World Health Organisation’s Solidarity Trials for the cure of Covid-19 and has received 1000 doses of the drug for testing.", "url": "https://www.hindustantimes.com/india-news/india-a-step-closer-to-making-key-drug/story-mVleP51rCdJUPQgU2UtCLK.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/05/Pictures/files-germany-health-virus-remdesivir-approval_d59ed2f4-8e58-11ea-8c4e-d383a7371370.jpg", "publishedAt": "2020-05-04T23:32:39Z", "content": "The Hyderabad based Indian Institute of Chemical Technology (CSIR-IICT) has synthesised the key starting materials (KSMs) for Remdesivir, the first step to develop the active pharmaceutical ingredient in a drug.\r\nIICT has also begun so-called technology demon… [+2977 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express News Service", "title": "Paper Clip: In antibodies from llamas, scientists see COVID hope - The Indian Express", "description": "Initial tests with the new antibody and cultured cells indicated the antibody blocks viruses with this spike protein from infecting cells.", "url": "https://indianexpress.com/article/explained/in-antibodies-from-llamas-scientists-see-covid-hope-6394007/", "urlToImage": "https://images.indianexpress.com/2020/05/llama.jpg?w=759", "publishedAt": "2020-05-04T23:22:46Z", "content": "Scientists were inspired by antibodies produced by this llama, named Winter. (Source: Tim Coppens via University of Texas at Austin)In a llama named Winter, researchers have found an unlikely ally in the hunt for an effective treatment for COVID-19, the Unive… [+1476 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Chiara Fiorillo", "title": "Coronavirus was in Europe as early as December – a month before outbreak was known, new tests prove - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11548575/coronavirus-outbreak-europe-december-france-hospital-covid-19-patient/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/05/CJ-COMP-COVID-1.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-05-04T22:47:59Z", "content": "CORONAVIRUS was already in Europe as early as December, a month before the outbreak was known, new tests have proven.\r\nA French hospital has retested old samples from pneumonia patients and discovered it treated a man who had Covid-19 on December 27 - nearly … [+4693 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Israel isolates coronavirus antibody in 'significant breakthrough': minister - Reuters India", "description": "Israel has isolated a key coronavirus antibody at its main biological research laboratory, the Israeli defence minister said on Monday, calling the step a \"significant breakthrough\" toward a possible treatment for the COVID-19 pandemic.", "url": "https://in.reuters.com/article/us-health-coronavirus-israel-treatment-idINKBN22G2WT", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-05-04T22:24:00Z", "content": "JERUSALEM (Reuters) - Israel has isolated a key coronavirus antibody at its main biological research laboratory, the Israeli defence minister said on Monday, calling the step a “significant breakthrough” toward a possible treatment for the COVID-19 pandemic. … [+1648 chars]"}, {"source": {"id": null, "name": "Indianewengland.com"}, "author": null, "title": "Higher thrombus risk in men with obesity in adolescence: Study - India New England", "description": "London– Obese people, read this carefully. Researchers have found that men with a history of obesity in their late teens, in adult life, are more at risk of a blood clot (thrombus) in a leg o…", "url": "https://indianewengland.com/2020/05/higher-thrombus-risk-in-men-with-obesity-in-adolescence-study/", "urlToImage": "https://indianewengland.com/wp-content/uploads/2017/11/qtq80-dxxQDB-e1514845548139.jpeg", "publishedAt": "2020-05-04T22:16:20Z", "content": "London– Obese people, read this carefully. Researchers have found that men with a history of obesity in their late teens, in adult life, are more at risk of a blood clot (thrombus) in a leg or lung. The risk rises successively and is highest in those who were… [+2379 chars]"}, {"source": {"id": null, "name": "Annals.org"}, "author": null, "title": "L-Thyroxine for Subclinical Hypothyroidism and Hypothyroid Symptoms - Annals of Internal Medicine", "description": null, "url": "https://annals.org/aim/article-abstract/2765669/l-thyroxine-therapy-older-adults-subclinical-hypothyroidism-hypothyroid-symptoms-secondary", "urlToImage": null, "publishedAt": "2020-05-04T21:12:28Z", "content": "Inselspital, Bern University Hospital, and Institute of Primary Health Care (BIHAM), University of Bern, Bern, Switzerland (M.D., M.F., S.B., N.R.)\r\nRobertson Centre for Biostatistics, Institute of Health and Wellbeing, University of Glasgow, Glasgow, Scotlan… [+6500 chars]"}, {"source": {"id": null, "name": "Wionews.com"}, "author": "WION Web Team", "title": "South Africa commence COVID-19 trials by providing TB shots to health workers - WION", "description": "The Bacillus Calmette–Guerin (BCG) vaccine is a century-old and was created Frances Pasteur Institute and it is one of the worlds oldest immunisations.", "url": "https://www.wionews.com/world/south-africa-commence-covid-19-trials-by-providing-tb-shots-to-health-workers-296636", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/04/29/138595-covid-test-afp.jpg", "publishedAt": "2020-05-04T19:56:41Z", "content": "South African health workers were given a tuberculosis vaccine on Monday to check if it protects against coronavirus. \r\nAlso read: Iran reports 74 coronavirus death as mosques due to reopen\r\nThe Bacillus CalmetteGuerin (BCG) vaccine is a century-old and was c… [+1542 chars]"}, {"source": {"id": null, "name": "Newsbytesapp.com"}, "author": "Shubham Sharma", "title": "#COVID19: 5 promising vaccine candidates currently in trial - NewsBytes", "description": "With nearly 2.5 lakh deaths, COVID-19 has transformed into the worst public health crisis of our time", "url": "https://www.newsbytesapp.com/timeline/World/60653/283668/5-promising-covid-19-vaccines-in-development", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l170_25181588589303.jpg", "publishedAt": "2020-05-04T19:54:36Z", "content": "<li>With nearly 2.5 lakh deaths and over 35 lakh infections, COVID-19 has transformed from a mysterious pneumonia-like disease to the worst public health crisis of our time.\r\nThe disease has swept across more than 170 countries, keeping people desperately wai… [+3250 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "The Hans India", "title": "Just like HIV, corona may never have a vaccine - The Hans India", "description": "London: While over 100 vaccines are currently under pre-clinical trials and a couple of those have...", "url": "https://www.thehansindia.com/news/international/just-like-hiv-corona-may-never-have-a-vaccine-620769", "urlToImage": "https://assets.thehansindia.com/h-upload/2020/05/04/1200x630_966626-covid.jpg?width=1200&height=630", "publishedAt": "2020-05-04T19:32:49Z", "content": "London: While over 100 vaccines are currently under pre-clinical trials and a couple of those have entered human trial stage, leading health experts have raised alarming questions about what if the world never sees a Covid-19 vaccine, as in the case of HIV wh… [+2106 chars]"}, {"source": {"id": null, "name": "Telegraphindia.com"}, "author": "By Hannah Beech, Alissa J. Rubin, Anatoly Kurmanaev and  Ruth Maclean/ NYTNS", "title": "Riddle: Why virus hits some and spares others - Telegraph India", "description": "Global metropolises like New York, Paris and London have been devastated, while teeming cities like Bangkok, Baghdad, New Delhi and Lagos have, so far, largely been spared", "url": "https://www.telegraphindia.com/world/riddle-why-the-coronavirus-affects-some-and-spares-others/cid/1770358", "urlToImage": "https://static.telegraphindia.com/derivative/THE_TELEGRAPH/1770358/2X1/image981f1569-09b6-44e8-ac16-ebb88483e11c.jpg?v=2", "publishedAt": "2020-05-04T19:09:59Z", "content": "The coronavirus has killed so many people in Iran that the country has resorted to mass burials, but in neighbouring Iraq, the body count is fewer than 100.\r\nThe Dominican Republic has reported nearly 7,600 cases of the virus. Just across the border, Haiti ha… [+12146 chars]"}, {"source": {"id": null, "name": "Oneindia.com"}, "author": "Alphonse Joseph", "title": "Explained: Study claims fatality rate among lung cancer patients due to coronavirus is high - Oneindia", "description": "A new study in the United States has estimated the number of fatality rate among patients suffering from cancer patients infected with the deadly coronavirus. This study is described as the largest study has found out that the people suffering from cancer are…", "url": "https://www.oneindia.com/international/explained-study-claims-fatality-rate-among-lung-cancer-patients-due-to-coronavirus-is-high-3082460.html", "urlToImage": "https://www.oneindia.com/img/2020/05/whatsappimage2020-05-04at11-06-22am-1588571419.jpeg", "publishedAt": "2020-05-04T18:23:24Z", "content": "New York, May 04: A new study in the United States has estimated the number of fatality rate among patients suffering from cancer patients infected with the deadly coronavirus. This study is described as the largest study has found out that the people sufferi… [+1927 chars]"}, {"source": {"id": null, "name": "Menafn.com"}, "author": "MENAFN", "title": "Don't hold your breath for a COVID-19 vaccine in 2020 - MENAFN.COM", "description": "(MENAFN - The Conversation) Donald Trump may be ' very confident ' we will have a vaccine for COVID-19 by the end of the year, but the rest of us should be more cautious. Billions of dollars are being spent trying to develop vaccines and treatments as a more …", "url": "https://menafn.com/1100113684/Dont-hold-your-breath-for-a-COVID-19-vaccine-in-2020", "urlToImage": "https://menafn.com/updates/pr/2020-05/04/TC_bbdf0362-bimage_story.jpg", "publishedAt": "2020-05-04T18:21:00Z", "content": "(MENAFN - The Conversation) Donald Trump may be ' very confident ' we will have a vaccine for COVID-19 by the end of the year, but the rest of us should be more cautious. Billions of dollars are being spent trying to develop vaccines and treatments as a more … [+6488 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "The Hans India", "title": "France, UK to trial coronavirus tracing apps next week - The Hans India", "description": "France and the UK will start the trials of the their respective COVID-19 tracing apps from next...", "url": "https://www.thehansindia.com/news/international/france-uk-to-trial-coronavirus-tracing-apps-next-week-620744", "urlToImage": "https://assets.thehansindia.com/h-upload/2020/05/04/1200x630_966597-mobile.jpg?width=1200&height=630", "publishedAt": "2020-05-04T18:13:25Z", "content": "Paris/London: France and the UK will start the trials of the their respective COVID-19 tracing apps from next week, the two governments have confirmed. \r\nFrench Minister for Digital Affairs Cedric O said on Sunday the testing of the \"StopCOVID\" contact tracin… [+974 chars]"}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "PTI", "title": "UK to pilot coronavirus contact tracing smartphone app - The New Indian Express", "description": "UK Health Secretary Matt Hancock told the daily Downing Street briefing that central to the track and trace phase will be a new contact tracing smartphone app.", "url": "https://www.newindianexpress.com/world/2020/may/04/uk-to-pilot-coronavirus-contact-tracing-smartphone-app-2139199.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2020/5/4/w600X390/Smartphonegeneric_AP1.jpg", "publishedAt": "2020-05-04T17:53:00Z", "content": "LONDON: The UK government on Monday announced that after hitting its testing target for coronavirus of over 100,000 tests daily, it will now be moving into the track and trace phase of its fight against the deadly virus, which has claimed 28,734 lives across … [+2648 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Billions raised for virus vaccine 'powerful' show of solidarity: WHO | AFP - AFP News Agency", "description": "World Health Organization chief Tedros Adhanom Ghebreyesus hails an international fundraising telethon as a powerful show of \"global solidarity\". The fundrai...", "url": "https://www.youtube.com/watch?v=AyCrs1Hbdjo", "urlToImage": "https://i.ytimg.com/vi/AyCrs1Hbdjo/maxresdefault.jpg", "publishedAt": "2020-05-04T17:24:46Z", "content": "World Health Organization chief Tedros Adhanom Ghebreyesus hails an international fundraising telethon as a powerful show of \"global solidarity\". The fundraiser, hosted by Ursula von der Leyen, head of the European Commission, saw world leaders pledge 7.4 bil… [+200 chars]"}, {"source": {"id": null, "name": "Socialnews.xyz"}, "author": null, "title": "Coronavirus – Africa: World Health Organization (WHO) supports Scientifically-Proven Traditional Medicine - SocialNews.XYZ", "description": "Download logoThe World Health Organization (WHO) welcomes innovations around the world including repurposing drugs, traditional medicines and developing new therapies in the search for potential treatments for COVID-19. WHO recognizes that traditional, comple…", "url": "https://www.socialnews.xyz/2020/05/04/coronavirus-africa-world-health-organization-who-supports-scientifically-proven-traditional-medicine/", "urlToImage": "https://www.africa-newsroom.com/files/large/52911d604aefbe2", "publishedAt": "2020-05-04T17:20:14Z", "content": "Home » General » Coronavirus – Africa: World Health Organization (WHO) supports Scientifically-Proven Traditional MedicineDownload logoThe World Health Organization (WHO) welcomes innovations around the world including repurposing drugs, traditional medicines… [+3484 chars]"}, {"source": {"id": null, "name": "Newsinfopark.com"}, "author": "Saurabh Gupta", "title": "Band-Aid style wearable gadget syncs with iPad to diagnose coronavirus - News Info Park", "description": "A device which sticks to your throat like a Band-Aid is intended to help diagnose coronavirus infections by detecting early signs of coughing or breathing difficulties associated with COVID-19. The se", "url": "https://newsinfopark.com/technology/2020-05-04/article/band-aid-style-wearable-gadget-syncs-with-ipad-to-diagnose-coronavirus-28527/saurabh-gupta/", "urlToImage": "https://9to5mac.com/wp-content/uploads/sites/6/2020/05/A-Band-Aid-style-wearable-to-diagnose-coronavirus.jpg?quality=82&strip=all&w=1500", "publishedAt": "2020-05-04T17:15:11Z", "content": "A device which sticks to your throat like a Band-Aid is intended to help diagnose coronavirus infections by detecting early signs of coughing or breathing difficulties associated with COVID-19.Northwestern says the device could be particularly valuable as a w… [+1890 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": null, "title": "After retesting samples, French hospital discovers COVID-19 case from December - The Age", "description": "The hospital discovered that it treated a man who had COVID-19 as early as December 27, nearly a month before the French government confirmed its first cases.", "url": "https://www.smh.com.au/world/europe/after-retesting-samples-french-hospital-discovers-covid-19-case-from-december-20200505-p54prz.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.26475%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/q_86%2Cf_auto/df188a7edd3fb94aea81961e6d52b50ab38fd730", "publishedAt": "2020-05-04T15:59:27Z", "content": "Each sample was retested several times to ensure there were no errors, he added. Neither Cohen nor his team were immediately available for comment on Monday.\r\nFrance, which has seen almost 25,000 people die from the virus since March 1, confirmed its first th… [+1582 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Tim Loh", "title": "Dutch scientists create anti-body that defeats coronavirus in lab - ThePrint", "description": "The experimental anti-body may help prevent or treat Covid-19 either alone or in a drug combination, according to study published in Nature Communications.", "url": "https://theprint.in/health/dutch-scientists-create-anti-body-that-defeats-coronavirus-in-lab/414347/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/coronavirus-testing-scaled-e1586165575726.jpg", "publishedAt": "2020-05-04T15:56:31Z", "content": "Munich: Scientists created a monoclonal antibody that can defeat the new coronavirus in the lab, an early but promising step in efforts to find treatments and curb the pandemics spread.\r\nThe experimental antibody may help prevent or treat Covid-19 and related… [+1659 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Jon Sharman", "title": "Coronavirus news – live: Government hints lockdown restrictions will not be lifted this week, as daily death toll hits lowest level since March - The Independent", "description": "Follow the latest updates", "url": "https://www.independent.co.uk/news/health/coronavirus-update-live-uk-news-latest-covid-19-today-vaccine-cases-deaths-a9496921.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/05/04/07/pri150741415.jpg", "publishedAt": "2020-05-04T15:02:54Z", "content": "'Pilot test, trace, isolate policy in Hebrides, says MPHolyrood has announced plans for the strategy to be in place across Scotland by the end of May, however Angus MacNeil suggested the Western Isles are an ideal location to pilot the policy.\r\n\"We should be … [+1169 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "COVID-19 might never have a vaccine: Report - Northeast Now", "description": "Leading health experts have warned that scientists may not be able to develop a COVID-19 vaccine ever. “There are some viruses that we still do not have vaccines against,” reported The Hindustan Times quoting Dr David Nabarro, a professor of global health at …", "url": "https://nenow.in/health/covid-19-might-never-have-a-vaccine-report.html/", "urlToImage": "https://nenow.in/wp-content/uploads/2020/03/Coronavirus_vaccine.jpg", "publishedAt": "2020-05-04T14:52:57Z", "content": "Leading health experts have warned that scientists may not be able to develop a COVID-19 vaccine ever.\r\nThere are some viruses that we still do not have vaccines against, reported The Hindustan Times quoting Dr David Nabarro, a professor of global health at I… [+990 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India| Posted by: Harshit Sabarwal", "title": "Plasma therapy ‘no magic bullet’ against Covid-19; Need large-scale trials to prove efficacy: Exper... - Hindustan Times", "description": "The therapy involves taking antibodies from the blood of a person who has recovered from Covid-19 and transfusing those antibodies into an active coronavirus patient to help kickstart the immune system to fight the infection.", "url": "https://www.hindustantimes.com/india-news/plasma-therapy-no-magic-bullet-against-covid-19-need-large-scale-trials-to-prove-efficacy-experts/story-LefKFEXQOznTzQZ3o9n4XM.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/04/Pictures/spread-istanbul-the-coronavirus-disease-covid-19_65a4d1a2-8e16-11ea-82ee-ef85d4b5e80b.jpg", "publishedAt": "2020-05-04T14:52:37Z", "content": "The convalescent plasma therapy is no “magic bullet” to deal with coronavirus, and only large-scale controlled trials can ascertain its efficacy as part of the treatment strategy, top medical experts said on Monday, even as several states are considering the … [+6081 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Brian Cooley", "title": "Coronavirus sensor you stick at the top of your chest can track symptoms - CNET", "description": "The device senses the nature, duration and time of coughs, checking for the onset and progression of COVID-19.", "url": "https://www.cnet.com/health/new-sensor-you-stick-on-your-chest-can-detect-covid-19/", "urlToImage": "https://cnet4.cbsistatic.com/img/ZDRiW1zrlJHj6PtOzSoxlnNiQR0=/2020/05/02/b92ddae0-7e20-43db-928b-4782498a8600/vlcsnap-2020-05-01-18h06m46s606.png", "publishedAt": "2020-05-04T14:03:53Z", "content": "Northwestern University\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nIt looks like a Band-Aid, but it's a flexible wireless sensor that sits where your throat and chest meet, picking up coughing and bre… [+3956 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Coronavirus present in France in December - a month earlier than thought, test indicates - Sky News", "description": "One expert suggests the revelation could mean \"various versions of the virus evolved at different times in different places\".", "url": "https://news.sky.com/story/coronavirus-present-in-france-a-month-earlier-than-thought-test-indicates-11982989", "urlToImage": "https://e3.365dm.com/20/05/1600x900/skynews-france-coronavirus_4982948.jpg?20200504141611", "publishedAt": "2020-05-04T13:47:40Z", "content": null}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Supressing immune response may help avoid severe COVID-19 symptoms: Study - Deccan Herald", "description": "Temporarily suppressing the body's immune system during the early stages of COVID-19 could help a patient avoid severe symptoms of the deadly disease, according to a study. The research, published in the Journal of Medical Virology, shows that an interaction …", "url": "https://www.deccanherald.com/science-and-environment/supressing-immune-response-may-help-avoid-severe-covid-19-symptoms-study-833459.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/04/iStock-1208953647-1588599303.jpg", "publishedAt": "2020-05-04T13:35:03Z", "content": "Temporarily suppressing the body's immune system during the early stages of COVID-19 could help a patient avoid severe symptoms of the deadly disease, according to a study.\r\nThe research, published in the Journal of Medical Virology, shows that an interaction… [+3160 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Decoding SARS-COV-2: A dummy's guide to the dreaded virus - Moneycontrol", "description": "There is little reliable information available in the public domain about the virus, its origin, its structure, the peculiarities and its modality of the infection it causes.", "url": "https://www.moneycontrol.com/news/coronavirus/decoding-sars-cov-2-a-dummys-guide-to-the-dreaded-virus-5220311.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/05/1-2-770x433.jpg", "publishedAt": "2020-05-04T13:18:39Z", "content": "By Samrat Bora\r\nWith the novel coronavirus pandemic raging across the continents, there are a lot of advisories of dos and don'ts. Unfortunately, most of the information available is in bits and pieces leading to less of coherence and more of confusion.Hence,… [+7313 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "ANI", "title": "AI-supported test could detect glaucoma progression 18 months earlier than current methods - Times Now", "description": "Scientists have developed a quick, automated and highly sensitive way to identify which people with glaucoma are at risk of rapid progression to blindness.", "url": "https://www.timesnownews.com/health/article/ai-supported-test-could-detect-glaucoma-progression-18-months-earlier-than-current-methods/586878", "urlToImage": "https://imgk.timesnownews.com/story/glaucoma.gif?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-04T12:42:37Z", "content": "Washington DC: Researchers have discovered a new test that can detect glaucoma progression 18 months earlier than the gold standard method used currently. The clinical trial by UCL researchers was published in the journal Expert Review of Molecular Diagnostic… [+3509 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Dr. Kamal Kant Kohli", "title": "Pregnant women with CVD must be provided specialized care: AHA statement - Medical Dialogues", "description": "Advanced maternal age is associated with a higher risk of premature birth, chronic hypertension,...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/pregnant-women-with-cvd-must-be-provided-specialized-care-aha-statement-65464", "urlToImage": "https://medicaldialogues.in/h-upload/2020/01/23/1200x630_123477-pregnancy-1.jpg?width=1200&height=630", "publishedAt": "2020-05-04T12:36:01Z", "content": "Advanced maternal age is associated with a higher risk of premature birth, chronic hypertension, preeclampsia and gestational diabetes. With rising age of marriage and bearing children, Cardio-obstetrics has emerged as an important multidisciplinary field req… [+6502 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "German study suggests infections are 10 times the number of confirmed cases - Reuters", "description": "More than 10 times as many people in Germany have likely been infected with the coronavirus than the number of confirmed cases, researchers from the University of Bonn have concluded from a field trial in one of the worst hit towns.", "url": "https://www.reuters.com/article/us-health-coronavirus-germany-estimates-idUSKBN22G1BW", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-05-04T11:53:57Z", "content": "FRANKFURT (Reuters) - More than 10 times as many people in Germany have likely been infected with the coronavirus than the number of confirmed cases, researchers from the University of Bonn have concluded from a field trial in one of the worst hit towns. \r\nTh… [+1424 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Plasma therapy 'no magic bullet' against Covid-19, need large-scale trials to prove efficacy: Experts - India Today", "description": "The convalescent plasma therapy is no \"magic bullet\" to deal with coronavirus, and only large-scale controlled trials can ascertain its efficacy as part of the treatment strategy, top medical experts said on Monday.", "url": "https://www.indiatoday.in/coronavirus-outbreak/story/plasma-therapy-no-magic-bullet-against-covid-19-need-large-scale-trials-to-prove-efficacy-experts-1674285-2020-05-04", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/Drug-647x363.jpeg?TZFTAhu1iDqKMqE2Fw847.U5EK7PKrYq", "publishedAt": "2020-05-04T11:44:36Z", "content": "The convalescent plasma therapy is no \"magic bullet\" to deal with coronavirus, and only large-scale controlled trials can ascertain its efficacy as part of the treatment strategy, top medical experts said on Monday, even as several states are considering the … [+5924 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Fazil Khan", "title": "When Exactly Can We Expect a Covid-19 Vaccine? Well, It’s Complicated - News18", "description": "Tthere are currently 111 potential vaccines for SARS-CoV-2 in development and 197 treatments are being tested and considered. Of these, nine are under initial clinical trials while the rest are under pre-clinical trials.", "url": "https://www.news18.com/news/india/when-exactly-can-we-expect-a-covid-19-vaccine-well-its-complicated-2604307.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/03/vaccine-coronavirus.jpg", "publishedAt": "2020-05-04T11:32:00Z", "content": "The Covid-19 pandemic has affected lives on a scale never seen before in recent history. The global economy is in the midst of its deepest recession in almost a century and a large population is forced to stay indoors. \r\nGovernments across the world are engag… [+6238 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Malaria 'completely stopped' by microbe - BBC News", "description": "Scientists say the microbe - found in the wild near Lake Victoria - has enormous potential.", "url": "https://www.bbc.com/news/health-52530828", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/BE00/production/_112104684_gettyimages-944691950-1.jpg", "publishedAt": "2020-05-04T11:31:21Z", "content": "Image copyrightGetty ImagesImage caption\r\n Malaria is spread by the bite of infected mosquitoes\r\nScientists have discovered a microbe that completely protects mosquitoes from being infected with malaria. \r\nThe team in Kenya and the UK say the finding has \"eno… [+3785 chars]"}, {"source": {"id": null, "name": "Medscape.com"}, "author": null, "title": "Adding a Blood Test to Screening May Improve Cancer Detection - Medscape", "description": "A minimally invasive multicancer blood test used with standard-of-care screening is safe, and effective, according to interim findings from a large, prospective study.", "url": "https://www.medscape.com/viewarticle/929859", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_200504_blood_test_arm_vial_tube_800x450.jpg", "publishedAt": "2020-05-04T11:11:04Z", "content": "A minimally invasive multicancer blood test used with standard-of-care screening is safe, effective, and feasible for use in routine clinical care, according to interim findings from a large, prospective study.\r\nThe DETECT-A blood test, an early version of th… [+5737 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AP", "title": "Coronavirus: How this care home fights against COVID-19 and wins - Livemint", "description": "For 47 days and nights, staff and residents of the Vilanova nursing home on the outskirts of the east-central city of Lyon waited out the coronavirus storm together", "url": "https://www.livemint.com/news/india/coronavirus-how-this-care-home-fights-against-covid-19-and-wins-11588589360809.html", "urlToImage": "https://images.livemint.com/img/2020/05/04/600x338/d32847dc5bff4508a1cdf5a88ce1a527-d32847dc5bff4508a1cdf5a88ce1a527-0_1588589682543_1588589701312.jpg", "publishedAt": "2020-05-04T11:04:16Z", "content": "As the coronavirus scythed through nursing homes, cutting a deadly path, Valerie Martin vowed to herself that the story would be different in the home she runs in France.The action she took to stop the virus from infecting and killing the vulnerable older adu… [+3528 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "PTI", "title": "Plasma therapy 'no magic bullet' against COVID-19; Need large-scale trials to prove efficacy: Expert - India TV News", "description": "Plasma therapy 'no magic bullet' against COVID-19, Plasma therapy Needs large-scale trials to prove efficacy, plasma therapy news", "url": "https://www.indiatvnews.com/news/india/plasma-therapy-no-magic-bullet-against-covid19-need-largescale-trials-to-prove-efficacy-say-expert-614058", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/05/ap20111321865110-1588320358.jpg", "publishedAt": "2020-05-04T10:55:57Z", "content": "Image Source : APPlasma therapy 'no magic bullet' against COVID-19; Need large-scale trials to prove efficacy: Expert\r\nThe convalescent plasma therapy is no \"magic bullet\" to deal with coronavirus, and only large-scale controlled trials can ascertain its effi… [+6056 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Boost your immunity with Apple, beetroot and carrot juices! Here’s how - The Financial Express", "description": "The ABC drink also makes your skin glow. This also makes your skin spotless. There will be no black spots, acne or pimples, blemishes and blackheads.", "url": "https://www.financialexpress.com/lifestyle/health/boost-your-immunity-with-apple-beetroot-and-carrot-juices-heres-how/1947421/", "urlToImage": "https://images.financialexpress.com/2020/05/BEETROOT.jpg", "publishedAt": "2020-05-04T10:32:57Z", "content": "Apple, beetroot and carrot juice can boost your immunity! It is essential to have a sound immunity throughout the year and more so when there is a pandemic outbreak. So if you are willing to enhance your immunity, you can try apple, beetroot and carrot juice.… [+1741 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Srishti Choudhary", "title": "Covid-19 may be here to stay, could hit in waves over next two years - Livemint", "description": "Scientists urged governments to plan for the worst-case scenario, including no vaccine availability or herd immunity.With global race for vaccine intensifying, the course of the pandemic could be influenced by a vaccine, but it is unlikely to be available unt…", "url": "https://www.livemint.com/news/india/covid-19-may-be-here-to-stay-could-hit-in-waves-over-next-two-years-11588585820842.html", "urlToImage": "https://images.livemint.com/img/2020/05/04/600x338/2020-04-30T114432Z_873633977_RC2ZEG9UZJND_RTRMADP_3_HEALTH-CORONAVIRUS-BRITAIN_1588520423344_1588586719308.JPG", "publishedAt": "2020-05-04T10:11:29Z", "content": "NEW DELHI: In what seems like the most probable scenario emerging from recent studies, covid-19 pandemic is here to stay and may hit in waves over the next two years with hotspots emerging in diverse geographical areas.The findings were shared by a global tea… [+3609 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": null, "title": "The COVID-19 riddle: Why does the virus wallop some places and spare others? - Moneycontrol", "description": "Experts are trying to figure out why the coronavirus is so capricious. The answers could determine how to best protect ourselves and how long we have to.", "url": "https://www.nytimes.com/2020/05/03/world/asia/coronavirus-spread-where-why.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/04/coronavirus-china-wuhan-770x433.jpg", "publishedAt": "2020-05-04T10:03:09Z", "content": "The coronavirus has killed so many people in Iran that the country has resorted to mass burials, but in neighboring Iraq, the body count is fewer than 100.\r\nThe Dominican Republic has reported nearly 7,600 cases of the virus. Just across the border, Haiti has… [+8557 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Sahana Ghosh", "title": "Looking for COVID-19: Have You Tried the Sewage? - The Wire", "description": "Tracking wastewater for the coronavirus can serve as an early warning system alerting the public health community as to when and where infections are emerging.", "url": "https://science.thewire.in/health/coronavirus-sewage/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2020/03/13112622/2020-03-13T042530Z_1_LYNXMPEG2C0CN_RTROPTP_4_HEALTH-CORONAVIRUS-TELEHEALTH.jpg", "publishedAt": "2020-05-04T09:35:16Z", "content": "A test tube with a name label is seen in this photo taken on January 29, 2020. Photo: Reuters/Dado Ruvic\r\nScientists around the world are peeping into poop and wastewater for the novel coronavirus (SARS-CoV-2) to come up with surveillance techniques to warn i… [+13468 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": null, "title": "As COVID-19 deaths pile up across globe, scientists ponder why the virus wallops some places and spares... - Firstpost", "description": "The coronavirus has killed so many people in Iran that the country has resorted to mass burials, but in neighbouring Iraq, the body count is fewer than 100.", "url": "https://www.nytimes.com/2020/05/03/world/asia/coronavirus-spread-where-why.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/03/SIN103-316_2020_105112-1.jpg", "publishedAt": "2020-05-04T09:13:36Z", "content": "The coronavirus has killed so many people in Iran that the country has resorted to mass burials, but in neighbouring Iraq, the body count is fewer than 100.\r\nThe Dominican Republic has reported nearly 7,600 cases of the virus. Just across the border, Haiti ha… [+8523 chars]"}, {"source": {"id": null, "name": "Thequint.com"}, "author": "FIT", "title": "COVID-19: Study Finds Smokers Less Likely to Suffer; Doctors Wary - The Quint", "description": "Smoking During Coronavirus: A preliminary study by French researchers left the medical community baffled when it analyzed public health data to find that smokers may be 80 percent less likely to catch COVID-19 than non-smokers of the same age and sex", "url": "https://fit.thequint.com/coronavirus/preliminary-study-finds-smokers-less-likely-to-suffer-from-coronavirus-doctors-express-caution", "urlToImage": "https://images.assettype.com/thequint-fit/2020-04/a09ea414-2367-4d10-8f49-7ee645072bce/iStock_1215058050.jpg", "publishedAt": "2020-05-04T09:10:36Z", "content": "While smokers may not be completely protected from getting infected by the novel coronavirus, they are perhaps less likely to develop symptoms, and more likely than non-smokers to have mild symptoms, thereby not going to hospitals, the study theorises.\r\nThe h… [+742 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "JOHN LEICESTER and ANTHONY CERRONE", "title": "Freedom! In France, a nursing home takes on COVID and wins - Yahoo News", "description": "As the coronavirus scythed through nursing homes, cutting a deadly path, Valerie Martin vowed to herself that the story would be different in the home she ru...", "url": "https://news.yahoo.com/freedom-france-nursing-home-takes-080445303.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/dWk804YvKmo_1prz74FabA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTQuNA--/https://s.yimg.com/uu/api/res/1.2/sWcwp4Bfz0JbwErOeco.2Q--~B/aD01MjM4O3c9Nzg1MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/8c3c2d15e1da289099c36a18d518c211", "publishedAt": "2020-05-04T08:04:00Z", "content": "LYON, France (AP) As the coronavirus scythed through nursing homes, cutting a deadly path, Valerie Martin vowed to herself that the story would be different in the home she runs in France.\r\nThe action she took to stop the virus from infecting and killing the … [+3898 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Bengaluru Doctor Greeted With Hero's Welcome on Return After Treating Coronavirus Patients - News18", "description": "Earlier, in a similar gesture, a doctor who had returned home after 20 days of non-stop service to the COVID-19 patients received a warm welcome from her neighbours.", "url": "https://www.news18.com/news/buzz/bengaluru-doctor-greeted-with-heros-welcome-on-return-after-treating-coronavirus-patients-2604701.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/05/1588577195_untitled.jpg", "publishedAt": "2020-05-04T07:54:23Z", "content": "It was a moment Dr. Vijayashree who returned home after treating COVID-19 patients will cherish for long. Upon her arrival, Vijayashrees residential society welcomed their hero will claps and cheer. \r\nShared by Bangalore Mayor M Goutham Kumar on Twitter, the … [+2245 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": null, "title": "Scientists: Cure for schizophrenia is able to save from brain cancer - The Times Hub", "description": null, "url": "https://thetimeshub.in/scientists-cure-for-schizophrenia-is-able-to-save-from-brain-cancer/14171/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2020/05/2f3d1528b1f16bd4c5e07bec7abcc16f-700x400.png", "publishedAt": "2020-05-04T07:07:10Z", "content": "Scientists from the Comprehensive cancer center Jonsson found that the use of medication for schizophrenia increases the survival of mice suffering from brain cancer. Treatment is with radiation therapy, the positive results. \r\nSpecialists have experienced a … [+787 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Coronavirus: France, UK To Start Trials Of Their Respective Covid-19 Tracing Apps From Next Week - Swarajya", "description": "", "url": "https://swarajyamag.com/insta/coronavirus-france-uk-to-start-trials-of-their-respective-covid-19-tracing-apps-from-next-week", "urlToImage": "https://images.assettype.com/swarajya/2020-04/eec27e48-9394-43d2-adf1-07a0ac9c77ac/thewire_globe.png?w=700", "publishedAt": "2020-05-04T05:38:32Z", "content": null}, {"source": {"id": null, "name": "Webindia123.com"}, "author": null, "title": "France, UK to trial COVID-19 tracing apps next week - Web India 123", "description": "France and the UK will start the trials of the their respective COVID-19 tracing apps from next week, the two governments have confirmed.", "url": "https://news.webindia123.com/news/Articles/World/20200504/3552149.html", "urlToImage": null, "publishedAt": "2020-05-04T05:30:37Z", "content": "<tr><td></td></tr><tr><td>\r\nFrance and the UK will start the trials of the their respective COVID-19 tracing apps from next week, the two governments have confirmed.</td></tr>\r\n French Minister for Digital Affairs Cedric O said on Sunday the testing of the \"S… [+1062 chars]"}, {"source": {"id": null, "name": "Thecitizen.in"}, "author": "akriti gupta", "title": "Cancer Has Not Stopped, But the Treatment Has - The Citizen", "description": "Deep Kumar, a senior citizen and a cancer patient based in Faridabad, had been going for his chemotherapy sessions on a regular basis before the lockd", "url": "https://www.thecitizen.in//index.php/en/newsdetail/index/15/18696/cancer-has-not-stopped-but-the-treatment-has", "urlToImage": "https://www.thecitizen.in/../NewsImages/articlepage/becdb835d4a7e209614bbbec9cf3915c.JPG", "publishedAt": "2020-05-04T05:25:52Z", "content": "Deep Kumar, a senior citizen and a cancer patient based in Faridabad, had been going for his chemotherapy sessions on a regular basis before the lockdown was announced. While Kumar was determined in his fight against cancer his plans took a tumultuous turn wh… [+6081 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Dr. Kamal Kant Kohli", "title": "COVID Toe yet another symptom of Covid 19 - Medical Dialogues", "description": "According to dermatologists of Spain  a new symptom of Covid 19 has emerged which is a ...", "url": "https://medicaldialogues.in/dermatology/news/covid-toe-yet-another-symptom-of-covid-19-65432", "urlToImage": "https://medicaldialogues.in/h-upload/2020/05/04/1200x630_128190-chilblains-toe.jpg?width=1200&height=630", "publishedAt": "2020-05-04T05:18:02Z", "content": "According to dermatologists of Spain a new symptom of Covid 19 has emerged which is a chilblain-like lesions on the toe which has been termed as \"COVID Toe\" by the investigators.The new symptom has not yet made onto the CDC's symptom list as yet.\r\nSeries of c… [+2582 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Carolyn Y. Johnson", "title": "Inside the extraordinary race to invent a coronavirus vaccine - The Washington Post", "description": "Companies are launching vaccine trials at an unprecedented pace, but some are worried about the trade-offs between speed and safety.", "url": "https://www.washingtonpost.com/science/2020/05/02/coronavirus-vaccine/", "urlToImage": "https://www.washingtonpost.com/resizer/FB33jJj_l1_YcZFXiBf4EJIqibw=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BEVCJBMPHFHAPD33WDQXVIUJFA.jpeg", "publishedAt": "2020-05-04T04:44:30Z", "content": "Scientists at the National Institutes of Health in Bethesda, Md., will study blood from Haydon and others for signs that the vaccine triggered an immune response to a pathogen they have never encountered. It would be the first, preliminary signal that the vac… [+12380 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "IANS", "title": "Coronavirus Outbreak in US May Last for 18 to 24 Months: Study - The Weather Channel", "description": "Government agencies and healthcare delivery organizations should develop strategies to ensure adequate protection for healthcare workers when disease incidence surges.", "url": "https://weather.com/en-IN/india/coronavirus/news/2020-05-04-novel-coronavirus-may-last-18-to-24-months-in-the-united-states", "urlToImage": "https://s.w-x.co/in-uscoronavirus.jpg", "publishedAt": "2020-05-04T03:38:26Z", "content": "New York City urban park rangers hand out free face masks at the Prospect Park in the Brooklyn. \r\n(Michael Nagle/Xinhua/IANS)\r\nAs the US battles the unabated rise of coronavirus cases as well as deaths, a new study from Minnesota-based Center for Infectious D… [+3415 chars]"}, {"source": {"id": null, "name": "Newsinfopark.com"}, "author": "NIP Web Desk Team", "title": "Coronavirus quarantine brings a surge of TV and movie reunions - News Info Park", "description": "With the entertainment industry on pause because of the coronavirus, casts from some beloved TV shows and movies are getting together (virtually) to take a look back at past work.From \"Parks and Recre", "url": "https://newsinfopark.com/health/2020-05-04/article/coronavirus-quarantine-brings-a-surge-of-tv-and-movie-reunions-27913/nip-web-desk-team/", "urlToImage": "https://media2.s-nbcnews.com/j/newscms/2020_18/3333141/200501-parks-and-rec-reunion-ew-1118a_6c2f89eda663ea4bc7b076e8b573d671.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-05-04T03:20:25Z", "content": "With the entertainment industry on pause because of the coronavirus, casts from some beloved TV shows and movies are getting together (virtually) to take a look back at past work.\r\nFrom “Parks and Recreation” and “Fresh Prince of Bel-Air” to “Chuck” and “The … [+3698 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "ANI", "title": "Race for coronavirus vaccine intensifies - Times Now", "description": "A vaccine is the only tool that will bring the novel coronavirus to heel and allow life around the world to normalize, say experts.", "url": "https://www.timesnownews.com/health/article/race-for-coronavirus-vaccine-intensifies/586582", "urlToImage": "https://imgk.timesnownews.com/story/accine.gif?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-04T03:09:08Z", "content": "Washington: A cure or vaccine for the Coronavirus infection, which has brought the world economy and public health system to the brink of collapse, is the need of the hour. The search for a vaccine has begun around the globe at an intensity never before seen … [+2807 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Indians should cut down on processed food as poor diet major cause behind Coronavirus death: UK cardiologist - Firstpost", "description": "Dr Aseem Malhotra from the UK's NHS said obesity and excess weight needs to be addressed as a factor behind coronavirus deaths.", "url": "https://www.firstpost.com/health/indians-should-cut-down-on-processed-food-as-poor-diet-major-cause-behind-coronavirus-death-uk-cardiologist-8327931.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/05/1280px-Unhealthy_snacks_in_cart-1.jpg", "publishedAt": "2020-05-04T01:45:42Z", "content": null}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "First coronavirus case in France appeared in December: expert - CGTN", "description": "", "url": "https://news.cgtn.com/news/2020-05-04/First-coronavirus-case-in-France-appeared-in-December-expert--Qd1h8wDIZ2/index.html", "urlToImage": "https://news.cgtn.com/news/7755544e354d7a4d7841544e3463444e3167444f31457a6333566d54/img/d505692072994fffab167aac9dbfa3d2/d505692072994fffab167aac9dbfa3d2-1.png", "publishedAt": "2020-05-04T00:38:42Z", "content": "The novel coronavirus first appeared in France on December 27, 2019, said Yves Cohen, an intensive care chief from Avicenne Hospital in Paris, in an interview with local media BFMTV on Sunday.\r\nHe said his medical team revisited test results of 24 patients wi… [+1122 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Virus efforts jeopardise vaccines for millions of MENA children: UN - Telangana Today", "description": "Amman: The coronavirus pandemic could jeopardise vaccination campaigns in the Middle East and North Africa, UNICEF warned Sunday, saying millions of children could miss out on polio and measles immunisations. The UN agency said most countries in the region we…", "url": "https://telanganatoday.com/virus-efforts-jeopardise-vaccines-for-millions-of-mena-children-un", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2020/05/United-Nations.jpg", "publishedAt": "2020-05-03T16:32:33Z", "content": "Amman: The coronavirus pandemic could jeopardise vaccination campaigns in the Middle East and North Africa, UNICEF warned Sunday, saying millions of children could miss out on polio and measles immunisations.\r\nThe UN agency said most countries in the region w… [+1228 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Marla Milling", "title": "Can You Pray Coronavirus Away? A New Clinical Study Is Underway - Forbes", "description": "Could remote prayer help heal critically ill COVID-19 patients? A new clinical study focuses on finding an answer.", "url": "https://www.forbes.com/sites/marlamilling/2020/05/03/can-you-pray-coronavirus-away-a-new-clinical-study-is-underway/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1211656382%2F0x0.jpg", "publishedAt": "2020-05-03T16:15:53Z", "content": "As researchers race to find an effective treatment or vaccine for the COVID-19 coronavirus, a new study is underway to determine if the power of prayer helps heal ICU patients sickened with the virus. \r\nCardiologist Dr. Dhanunjaya DJ Lakkireddy, Medical Direc… [+1738 chars]"}, {"source": {"id": null, "name": "Thestatesman.com"}, "author": "SNS Web", "title": "Indian-origin doctor in UK alerts Indians to poor diet linking it to Coronavirus deaths - The Statesman", "description": "The 42-year-old medic who is originally from New Delhi said, 'India is particularly vulnerable, having a very high prevalence of lifestyle related diseases,' who is on a mission to spread awareness around lifestyle changes as a major weapon in the fight again…", "url": "https://www.thestatesman.com/coronavirus/indian-origin-doctor-in-uk-alerts-indians-to-poor-diet-linking-it-to-coronavirus-deaths-1502883559.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2020/05/doctor.jpg", "publishedAt": "2020-05-03T16:11:38Z", "content": "A major cause behind the Coronavirus deaths is poor diet and the Indians must urgently cut down on ultra-processed food to build resilience against the deadly virus, a leading Indian-origin cardiologist in the UK has cautioned.\r\nDr Aseem Malhotra, who is amon… [+5080 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Scientists discover human genome regions that influence risk of developing melanoma - Times of India", "description": "Science News: WASHINGTON: In a breakthrough study, a global collaboration of scientists have discovered more than double human genome regions that influence the ris.", "url": "https://timesofindia.indiatimes.com/home/science/scientists-discover-human-genome-regions-that-influence-risk-of-developing-melanoma/articleshow/75520321.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75520371,width-1070,height-580,imgsize-1136159,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-05-03T14:12:00Z", "content": "WASHINGTON: In a breakthrough study, a global collaboration of scientists have discovered more than double human genome regions that influence the risk of developing melanoma.\r\nJoint study leader and QIMR Berghofer statistical geneticist Associate Professor M… [+3405 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Tamil Nadu: Four new Covid-19 cases take total in Coimbatore to 146 - Times of India", "description": "Four people in the district tested positive for Covid-19 on Sunday, taking the total number of cases to 146. While one of them is a 31-year-old pregna", "url": "https://timesofindia.indiatimes.com/city/coimbatore/tamil-nadu-four-new-covid-19-cases-take-total-in-coimbatore-to-146/articleshow/75518834.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75518860,width-1070,height-580,imgsize-85636,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-05-03T14:09:48Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Wtop.com"}, "author": "CNN", "title": "What happens if a coronavirus vaccine is never developed? It has happened before - WTOP", "description": "As countries lie frozen in lockdown and billions of people lose their livelihoods, public figures are teasing a breakthrough that would mark the end of the crippling coronavirus pandemic: a vaccine.", "url": "http://wtop.com/health-fitness/2020/05/what-happens-if-a-coronavirus-vaccine-is-never-developed-it-has-happened-before/", "urlToImage": "https://wtop.com/wp-content/uploads/2020/04/Virus_Outbreak_Vaccine_Misinformation_94286.jpg", "publishedAt": "2020-05-03T12:07:27Z", "content": "As countries lie frozen in lockdown and billions of people lose their livelihoods, public figures are teasing a breakthrough that would mark the end of the crippling coronavirus pandemic: a vaccine.\r\nBut there is another, worst-case possibility: that no vacci… [+13123 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ivana Kottasová, CNN", "title": "What you need to know about coronavirus on Sunday, May 3 - CNN", "description": "Expect a barrage of reopening announcements in the coming days.", "url": "https://www.cnn.com/2020/05/03/world/coronavirus-newsletter-05-03-20/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "publishedAt": "2020-05-03T11:33:52Z", "content": null}, {"source": {"id": null, "name": "Newsgram.com"}, "author": null, "title": "Here's Why Cancer Patients Should Fear COVID-19 - http://www.newsgram.com/", "description": "People with cancer who develop coronavirus (COVID-19) are much more likely to die from the disease than those without cancer.", "url": "https://www.newsgram.com/why-cancer-patients-fear-covid-19/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2020/05/covid-19-4982910_1280-3.jpg", "publishedAt": "2020-05-03T08:09:00Z", "content": "By N.S.Venkataraman\r\nFrom historical times, human beings have been surviving,  inspite of  several types of diseases  confronting them.  In such conditions, medical science to safeguard  human beings from diseases have been developed due to the compelling nee… [+6753 chars]"}, {"source": {"id": null, "name": "Deccanchronicle.com"}, "author": null, "title": "Research finds blood pressure medicines don't raise COVID-19 risk - Deccan Chronicle", "description": "There had been concern arising from animal studies that these drugs might increase body's protein levels which the coronavirus latches on to", "url": "https://www.deccanchronicle.com/lifestyle/health-and-wellbeing/030520/research-finds-blood-pressure-medicines-dont-raise-covid-19-risk.html", "urlToImage": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-p7gblobppvmu7vlufl9hmuc851-20200503111617.Medi.jpeg", "publishedAt": "2020-05-03T05:53:00Z", "content": "Blood pressure medicines do not increase the risk of COVID-19 infection nor do they increase the risk of becoming seriously ill with the disease, three major studies said Friday, positive news for the millions of people who take them.\r\nThe research primarily … [+2598 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "News18", "title": "Indian-American Physician Launches Study to Find if Prayers Could Heal Covid-19 Patients - Yahoo India News", "description": "An Indian-American physician in Kansas City has begun a study to find if something called \"remote intercessory prayer\" might initiate God to heal those infected with the coronavirus.", "url": "https://in.news.yahoo.com/indian-american-physician-launches-study-022000346.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/C0KeQgPAK03kztfyPt8DlA--~B/aD01ODM7dz04NzU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/news18_coronavirus_edition_222/327b9090c133594dbc8ce59fa6c0503d", "publishedAt": "2020-05-03T04:09:05Z", "content": "An Indian-American physician in Kansas City has begun a study to find if something called \"remote intercessory prayer\" might initiate God to heal those infected with the coronavirus.\r\nDhanunjaya Lakkireddy launched the four-month prayer study on Friday, which… [+1961 chars]"}, {"source": {"id": null, "name": "Asianage.com"}, "author": "PTI", "title": "Indian-American physician launches study to find if prayers could heal Covid patients - The Asian Age", "description": "Randomly chosen patients will receive a &quot;universal&quot; prayer offered following rituals of Christianity, Hinduism, Islam, Judaism, and Buddhism", "url": "https://www.asianage.com/world/americas/030520/indian-american-physician-launches-study-to-find-if-prayers-could-heal-covid-patients.html", "urlToImage": "https://s3.ap-southeast-1.amazonaws.com/images.asianage.com/images/aa-Cover-p7gblobppvmu7vlufl9hmuc851-20200503092158.jpeg", "publishedAt": "2020-05-03T03:53:00Z", "content": "Randomly chosen patients will receive a \"universal\" prayer offered following rituals of Christianity, Hinduism, Islam, Judaism, and BuddhismKansas City: An Indian-American physician in Kansas City has begun a study to find if something called \u0093remote interces… [+2151 chars]"}]}