{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Sleep disturbances among infants can affect brain development: Study - Telangana Today", "description": "Washington D.C: The prime time for brain development in a child's life is the first year, where the infant spends most of the time asleep. It is the time when neural connections form and sensory memories are encoded. However, when sleep is disrupted, as occur…", "url": "https://telanganatoday.com/sleep-disturbances-among-infants-can-affect-brain-development-study", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2020/05/sleeping-child.jpg", "publishedAt": "2020-05-07T15:51:16Z", "content": "Washington D.C: The prime time for brain development in a child’s life is the first year, where the infant spends most of the time asleep.\r\nIt is the time when neural connections form and sensory memories are encoded. However, when sleep is disrupted, as occu… [+3636 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Simon Kolstoe, The Conversation", "title": "Don't get your hopes high. A Covid-19 vaccine is unlikely to arrive in 2020 - Scroll.in", "description": "It is necessary to realise that the real cost of good research is time.", "url": "https://scroll.in/article/961088/don-t-get-your-hopes-high-a-covid-19-vaccine-is-unlikely-to-arrive-in-2020", "urlToImage": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/139734-hpaynfxlid-1586435063.jpg", "publishedAt": "2020-05-07T15:00:00Z", "content": "Donald Trump may be very confident we will have a vaccine for Covid-19 by the end of the year, but the rest of us should be more cautious. Billions of dollars are being spent trying to develop vaccines and treatments as a more permanent solution to the crisis… [+6374 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Adrija Roychowdhury", "title": "Black death: The great plague that killed millions, and feudalism - The Indian Express", "description": "In Europe though, the catastrophic plague eventually played out to be a boon for some -- the serfs who were legally committed to providing labour to landlords in exchange for allowing them to live and work in their lands.", "url": "https://indianexpress.com/article/research/coronavirus-black-death-the-great-plague-that-killed-millions-and-feudalism-6398433/", "urlToImage": "https://images.indianexpress.com/2020/05/EpicsOfEpidemics-759.jpg?w=759", "publishedAt": "2020-05-07T14:47:10Z", "content": "The ‘Black death’ played out as the biggest human tragedy of medieval Europe. (Source- Wikimedia Commons)In autumn of 1347 CE, when a fleet of 12 ships reached the docks of a Sicilian port, people gathered there were horrified to meet with a pile of corpses. … [+7807 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What are antibody tests and why are they so wrong? - ThePrint", "description": "#COVID19 #CoronaTest #PureScience Antibody tests for Covid-19 are used to establish if a person has already been infected with the disease, irrespective of w...", "url": "https://www.youtube.com/watch?v=Q8yZtoZyZ1w", "urlToImage": "https://i.ytimg.com/vi/Q8yZtoZyZ1w/maxresdefault.jpg", "publishedAt": "2020-05-07T14:30:07Z", "content": "#COVID19#CoronaTest#PureScienceAntibody tests for Covid-19 are used to establish if a person has already been infected with the disease, irrespective of whether they were diagnosed as positive. But these tests have high rates of error in their sensitivity and… [+580 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "TWC India Edit Team", "title": "Infecting Healthy People With Coronavirus Could Accelerate COVID-19 Vaccine Development: WHO - The Weather Channel", "description": "Human challenge studies can be especially valuable for testing vaccines, as they are substantially faster to conduct than vaccine field trials.", "url": "https://weather.com/en-IN/india/coronavirus/news/2020-05-07-infecting-healthy-people-coronavirus-accelerate-covid-19-vaccine", "urlToImage": "https://s.w-x.co/in-test.jpg", "publishedAt": "2020-05-07T13:25:27Z", "content": "Representational image: A man being tested for COVID-19 in New Delhi, India\r\n(Anindya Chattopadhyay/BCCL Delhi)\r\nDeliberately infecting healthy human beings with the novel coronavirus could be a particularly effective step towards developing a successful COVI… [+2779 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Benedict Carey, James Glanz", "title": "Travel From New York City Seeded Wave of U.S. Outbreaks - The New York Times", "description": "The coronavirus outbreak in New York City became the primary source of infections around the United States, researchers have found.", "url": "https://www.nytimes.com/2020/05/07/us/new-york-city-coronavirus-outbreak.html", "urlToImage": "https://static01.nyt.com/images/2020/05/06/us/2020-05-06-nyc-virus-hub-chart-promo-1588808590076/2020-05-06-nyc-virus-hub-chart-promo-1588808590076-facebookJumbo-v3.png", "publishedAt": "2020-05-07T13:04:14Z", "content": "New York Citys coronavirus outbreak grew so large by early March that the city became the primary source of new infections in the United States, new research reveals, as thousands of infected people traveled from the city and seeded outbreaks around the count… [+12597 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "US Scientists Scramble to Study Life-threatening Syndrome in Kids Linked to Coronavirus - News18", "description": "This emerging syndrome, which may occur days to weeks after a COVID-19 illness, reflects the surprising ways that this entirely new coronavirus infects and sickens its human hosts.", "url": "https://www.news18.com/news/world/us-scientists-scramble-to-study-life-threatening-syndrome-in-kids-linked-to-coronavirus-2610123.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/05/1588855059_2020-05-07t122149z_1_lynxmpeg460zu_rtroptp_4_health-coronvairus-syndrome-kids-1.jpg", "publishedAt": "2020-05-07T12:54:20Z", "content": "U.S. scientists are working to understand a rare, life-threatening inflammatory syndrome in children associated with exposure to the new coronavirus by quickly assembling clinical trials and patient registries.\r\nCases were first reported in Britain, Italy and… [+4195 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Black and Pakistani people more likely to die from COVID-19 according to UK data - Reuters", "description": "Black people and those of Bangladeshi and Pakistani ethnicity have a significantly higher chance of dying from COVID-19 than white people, even when adjustin...", "url": "https://www.youtube.com/watch?v=CcqRdAbrjOM", "urlToImage": "https://i.ytimg.com/vi/CcqRdAbrjOM/hqdefault.jpg", "publishedAt": "2020-05-07T12:53:24Z", "content": "Black people and those of Bangladeshi and Pakistani ethnicity have a significantly higher chance of dying from COVID-19 than white people, even when adjusting for deprivation, the British statistics office said.\r\nSubscribe: http://smarturl.it/reuterssubscribe… [+385 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Sounak Mitra", "title": "Scientists warn COVID-19 transmission risk via sewage must not be neglected - Republic World - Republic World", "description": "A research was conducted by a group of scientists in which they have reportedly warned the potential transmission of Covid-19 via sewage must not be neglected.", "url": "https://www.republicworld.com/world-news/rest-of-the-world-news/scientists-warns-covid-19-transmission-risk-via-sewage-system.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/dfybtvxwitl9v7hk_1588852928.jpeg?tr=f-jpeg", "publishedAt": "2020-05-07T12:28:08Z", "content": "A research was conducted by a group of scientists in which they have reportedly warned that the potential transmission of COVID-19 via sewage “must not be neglected”. As per reports, the scientists have claimed that the pathogens from the digestive system of … [+1994 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Are llama antibodies going to be the key to finding a COVID-19 treatment? - Firstpost", "description": "A research team have isolated single-domain antibodies called VHHs from a llama affectionately known as Winter.", "url": "https://www.firstpost.com/health/are-llama-antibodies-going-to-be-the-key-to-finding-a-covid-19-treatment-8343421.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/05/llama-4233347_1280-1.jpg", "publishedAt": "2020-05-07T12:16:48Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What's it like to be a health worker fighting COVID-19? | AFP - AFP News Agency", "description": "They have been hailed as the heroes of the pandemic, working flat out to stave off the worst effects of the virus. Doctors and nurses around the world gave A...", "url": "https://www.youtube.com/watch?v=9VIIiaL5K4g", "urlToImage": "https://i.ytimg.com/vi/9VIIiaL5K4g/maxresdefault.jpg", "publishedAt": "2020-05-07T12:12:38Z", "content": null}, {"source": {"id": null, "name": "Dnaindia.com"}, "author": "DNA", "title": "Wider availability of non-alcoholic drinks may reduce liquor consumption: Study - DNA India", "description": "A recent study shows that people are more likely to opt for non-alcoholic drinks if more of them are available than alcoholic drinks. A team of researchers at the NIHR Bristol Biomedical Research Centre and the Universities of Bristol and Cambridge, UK found …", "url": "https://www.dnaindia.com/india/video-wider-availability-of-non-alcoholic-drinks-may-reduce-liquor-consumption-study-2823896", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/2020/05/07/905034-00000003.jpg", "publishedAt": "2020-05-07T12:09:01Z", "content": "©2020 Diligent Media Corporation Ltd."}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Mohana Basu", "title": "After HCQ, it’s time for azithromycin and pneumonia drug combo to go under clinical trial - ThePrint", "description": "As scientists try out new drug combinations and look for clues in existing cancer therapies, ThePrint brings you the latest on studies on Covid-19 patients.", "url": "https://theprint.in/science/after-hcq-its-time-for-azithromycin-and-pneumonia-drug-combo-to-go-under-clinical-trial/416413/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/Test-.jpg", "publishedAt": "2020-05-07T11:46:56Z", "content": "New Delhi: The Covid-19 pandemic has brought the world to a standstill, even as scientists continue to look for treatments to fight the infection.\r\nHere are some of the latest potential therapies being proposed by researchers across the world.\r\nClinical trial… [+4958 chars]"}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "Understanding zoonotic diseases: 'Humans tend to be naive to emerging viruses' - Down To Earth Magazine", "description": "Population growth, rapid urbanisation and climate change are leading to the increase in new viruses, says Pranav Pandit, veterinary epidemiologist, University of California, Davis", "url": "https://www.downtoearth.org.in/interviews/wildlife-biodiversity/understanding-zoonotic-diseases-humans-tend-to-be-naive-to-emerging-viruses--70958", "urlToImage": "https://cdn.downtoearth.org.in/library/large/2020-05-07/0.27644000_1588847933_45.jpg", "publishedAt": "2020-05-07T11:38:59Z", "content": "Population growth, rapid urbanisation and climate change are leading to the increase in new viruses, says Pranav Pandit, veterinary epidemiologist, University of California, DavisIt is humanity that is squarely responsible for the emergence of new viruses in … [+4109 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Can't smell suddenly? You could have coronavirus - Hindustan Times", "description": "A sudden loss of smell and taste could be a sign of mild coronavirus disease. Covid-19 symptoms include fever, dry cough, tiredness, shortness of breath or d...", "url": "https://www.youtube.com/watch?v=pbHm6d5g5ho", "urlToImage": "https://i.ytimg.com/vi/pbHm6d5g5ho/maxresdefault.jpg", "publishedAt": "2020-05-07T11:37:04Z", "content": "A sudden loss of smell and taste could be a sign of mild coronavirus disease. Covid-19 symptoms include fever, dry cough, tiredness, shortness of breath or difficulty breathing. Those with a sudden loss of smell must home-quarantine and get tested for coronav… [+492 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu", "title": "Spend some time in garden for good health, mental wellbeing: Study - The Hindu", "description": "The research analysed data from nearly 8,000 people and the findings were published in the journal ‘Landscape and Urban Planning’", "url": "https://www.thehindu.com/life-and-style/fitness/spend-some-time-in-garden-for-good-health-mental-wellbeing/article31526492.ece", "urlToImage": "https://www.thehindu.com/life-and-style/fitness/p7jwl0/article31526491.ece/ALTERNATES/LANDSCAPE_615/VEGETABLEFARMINGONTERRACE", "publishedAt": "2020-05-07T11:36:59Z", "content": "People who spend time in the garden are significantly more likely to report general good health, higher psychological wellbeing and greater physical activity levels than those who do not spend time in the garden, say researchers. Published in the journal Land… [+1715 chars]"}, {"source": {"id": null, "name": "Openaccessgovernment.org"}, "author": null, "title": "Existing drugs should be used to treat COVID-19 instead of vaccine - Open Access Government", "description": "Researchers say we should repurpose existing drugs, which would be faster than waiting for a \"magic bullet\" vaccine to treat COVID-19", "url": "https://www.openaccessgovernment.org/treat-covid-19/86631/", "urlToImage": "https://www.openaccessgovernment.org/wp-content/uploads/2020/05/ACE2-2.jpg", "publishedAt": "2020-05-07T11:35:00Z", "content": "Speaking out in the British Journal of Pharmacology today (7 May), an international team of scientists point out the lengthy timeline involved in developing and manufacturing a vaccine. They are proposing that we use the drugs we already have, to offer a more… [+5719 chars]"}, {"source": {"id": null, "name": "Weforum.org"}, "author": "Kate Kelland", "title": "Coronavirus was spreading globally as early as December 2019 - World Economic Forum", "description": "Research was based on sample testing from around 7,500 people infected with COVID-19", "url": "https://www.weforum.org/agenda/2020/05/coronavirus-spread-around-world-2019-study/", "urlToImage": "https://assets.weforum.org/editor/ilM-9j2dHSWhQOl8BK5J_UGIloqmsEj8PuvxkutyXNs.PNG", "publishedAt": "2020-05-07T11:27:52Z", "content": "<ul><li>A new study suggests that COVID-19 spread around the world far quicker than originally predicted.</li><li>French authorities have recently confirmed a case of coronavirus from December 27, almost a month before the country announced it's first officia… [+3716 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": null, "title": "The COVID-19 Riddle: Why does the virus wallop some places and spare others? - Firstpost", "description": "Cultural factors, like the social distancing that is built into certain societies like Thailand and India, may give some countries more protection.", "url": "https://www.nytimes.com/2020/05/03/world/asia/coronavirus-spread-where-why.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/05/VIRUS-MYSTERY-4-1.jpg", "publishedAt": "2020-05-07T10:46:55Z", "content": null}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "Natalia Drozdiak", "title": "U.K. Virus App Contains Privacy Loopholes, Rights Group Says - BloombergQuint", "description": "U.K. Virus App Contains Privacy Loopholes, Advocacy Group Says", "url": "https://www.bloombergquint.com/business/u-k-virus-app-contains-privacy-loopholes-advocacy-group-says", "urlToImage": "https://images.assettype.com/bloombergquint%2F2018-08%2F3a8e2237-2edb-4494-bcf2-231993fb6108%2FBLOOMBERG_LOGO.png?rect=0%2C56%2C1920%2C1008&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-05-07T10:39:48Z", "content": ""}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": "todaynewspaper.in", "title": "Chinese coronavirus researcher shot dead in US murder-suicide - Todaynewspaper", "description": "A Chinese scientist was found dead at the weekend in his home on the outskirts of Pittsburgh. The body of his suspected attacker was discovered around the corner in what authorities said was a suicide. Image for representation. HIGHLIGHTS Cops say crime commi…", "url": "https://www.indiatoday.in/world/story/coronavirus-chinese-scientist-shot-dead-in-us-1675361-2020-05-07?utm_source=rss", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/WhatsApp_Image_2020-05-07_at_1-647x363.jpeg?tBd7t5DU8KQON8ZKQK7D.yrT1UHdFLqG", "publishedAt": "2020-05-07T10:32:58Z", "content": "An ethnic Chinese scientist working on the novel coronavirus in the United States has been shot dead in what police said was a murder-suicide over an “intimate partner”.\r\nBing Liu, 37, was found dead at the weekend in his home on the outskirts of Pittsburgh, … [+1733 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Bloomberg", "title": "Deliberately infecting healthy people with coronavirus may speed Covid vaccine studies, says WHO - Hindustan Times", "description": "Such studies, which pose significant potential dangers to subjects, may be considered in dire situations and with certain disclosures and protections, a working group of the United Nations health agency said in a report posted Wednesday on its website.", "url": "https://www.hindustantimes.com/india-news/deliberately-infecting-healthy-people-with-coronavirus-may-speed-covid-vaccine-studies-says-who/story-RK74T8dCPwpbeILOafZQ9I.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/07/Pictures/virus-outbreak-frontline-foreigners_fa666b20-904b-11ea-80d7-183d6ba34199.jpg", "publishedAt": "2020-05-07T10:22:00Z", "content": "Deliberately infecting healthy volunteers with the virus that causes Covid-19 may speed studies of vaccines against the deadly pathogen, the World Health Organization said.\r\nSuch studies, which pose significant potential dangers to subjects, may be considered… [+3237 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": null, "title": "A New Source Of Coronavirus Spread: 'COVID-19 Parties' - Forbes India", "description": "Much like 'chicken pox parties' that health authorities have long tried to halt, at least two instances of 'Covid-19 parties' have been identified as people want to quickly contract the disease in the hope to build immunity", "url": "https://www.nytimes.com/2020/05/06/us/coronavirus-covid-parties.html", "urlToImage": "https://www.forbesindia.com/media/images/2020/May/img_132865_coronapartiess.jpg", "publishedAt": "2020-05-07T09:45:21Z", "content": "Image: Shutterstock\r\nSEATTLE — A county in Washington state dealing with a coronavirus outbreak has identified a confounding new source of spread: “COVID-19 parties” organized so that people can deliberately mingle with an infected person in the hope of getti… [+3299 chars]"}, {"source": {"id": null, "name": "Tribuneindia.com"}, "author": "Tribune India", "title": "Italian researchers claim world's first coronavirus vaccine: Report - The Tribune India", "description": "The total number of Covid-19 infections has risen to 213,013", "url": "https://www.tribuneindia.com/news/health/italian-researchers-claim-worlds-first-coronavirus-vaccine-report-81639", "urlToImage": "https://cms.tribuneindia.com/gallary_content/2020/5/2020_5$largeimg_43233020.jpeg", "publishedAt": "2020-05-07T08:43:19Z", "content": "Rome, May 7\r\nItalian researchers have claimed that they have successfully developed a vaccine to contain coronavirus (Covid-19) which is likely to work on humans, a report said.\r\nLuigi Aurisicchio, CEO of Takis, the firm developing the medication, said that a… [+1949 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "COVID-19: CSIR submits 53 genome sequences of coronavirus in Indians to global body; to submit 450 more by May 15 - The Financial Express", "description": "The Council for Scientific and Industrial Research (CSIR) is also planning to submit additional 450 genome sequence data of coronavirus by May 15, its Director General Shekhar Mande said.", "url": "https://www.financialexpress.com/lifestyle/health/covid-19-csir-submits-53-genome-sequences-of-coronavirus-in-indians-to-global-body-to-submit-450-more-by-may-15/1950988/", "urlToImage": "https://images.financialexpress.com/2020/05/coronavirus-tests.jpg", "publishedAt": "2020-05-07T08:26:03Z", "content": "Amidst concerns that coronavirus have undergone mutation and the new strain maybe more contagious, India’s premier R&amp;D organisation, CSIR, has submitted as many as 53 genome sequences of the virus to a global genome database, a move that may help in bette… [+3396 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "India will see post-quarantine baby boom with over 20 mn births after coronavirus was declared a pandemic - Economic Times", "description": "The country will welcome highest number of births between March and December.", "url": "https://economictimes.indiatimes.com/magazines/panache/india-will-see-post-quarantine-baby-boom-with-over-20-mn-births-since-coronavirus-was-declared-a-pandemic/articleshow/75595271.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75595366,width-1070,height-580,imgsize-466097,overlay-etpanache/photo.jpg", "publishedAt": "2020-05-07T07:37:46Z", "content": "UNITED NATIONS: India is projected to record the highest number of births in the 9 months since COVID-19 was declared a pandemic in March, with more than 20 million babies expected to be born in the country between March and December, according to a top UN bo… [+7055 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "'How bats carry coronavirus without getting sick decoded' - Deccan Herald", "description": "Scientists have uncovered how bats can carry the MERS coronavirus without getting sick, shedding light on what triggers coronaviruses, including the one behind the COVID-19 pandemic, to jump to humans. According to the study, published in the journal Scientif…", "url": "https://www.deccanherald.com/science-and-environment/how-bats-carry-coronavirus-without-getting-sick-decoded-834567.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/07/bat-1588832899.jpg", "publishedAt": "2020-05-07T06:28:19Z", "content": "Scientists have uncovered how bats can carry the MERS coronavirus without getting sick, shedding light on what triggers coronaviruses, including the one behind the COVID-19 pandemic, to jump to humans.\r\nAccording to the study, published in the journal Scienti… [+3267 chars]"}, {"source": {"id": null, "name": "Edexlive.com"}, "author": "Edex Live", "title": "Moderate exercise in middle, older age cuts time spent in hospital, says study - EdexLive", "description": "The findings are based on a general British population cohort study of 25,639 men and women aged 40-79 living in Norfolk and recruited from general practices between 1993 and 1997", "url": "https://www.edexlive.com/news/2020/may/07/moderate-exercise-in-middle-older-age-cuts-time-spent-in-hospital-says-study-11850.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2018/10/5/w600X390/VR.jpg", "publishedAt": "2020-05-07T06:22:55Z", "content": "People aged 40-79 are at significantly lower risk of long or frequent hospital admissions if they do some form of physical activity, a new study suggests. According to the study, exercising regularly can cut 25-27 per cent of the risk of frequent hospital sta… [+3895 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Karishma Mehrotra", "title": "14 studies, 1 refrain: Closed public spaces are environments for super-spreading - The Indian Express", "description": "The common findings of 14 studies on transmission patterns across nine countries could provide some pointers as the Centre and state governments work on exit strategies ahead of May 17, when the third phase of the nationwide lockdown is scheduled to end.", "url": "https://indianexpress.com/article/india/closed-public-spaces-environments-coronavirus-super-spreading-6397621/", "urlToImage": "https://images.indianexpress.com/2020/05/Corona-Partha.jpg?w=759", "publishedAt": "2020-05-07T04:32:53Z", "content": "Public enclosed spaces like workplaces and restaurants can become super-spreading environments for Covid-19.Public enclosed spaces like workplaces and restaurants can become super-spreading environments for Covid-19; however, schools are not prominent transmi… [+5702 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Suraksha P", "title": "Coronavirus Lockdown 3.0: Karnataka revises SOP for international passengers, scraps category C - Deccan Herald", "description": "Karnataka revised its standard operating procedure (SOP) for international passengers on Wednesday. The first group of passengers will arrive in the state on May 8. The number of categories has been reduced to two from three. Category A includes passengers sy…", "url": "https://www.deccanherald.com/state/coronavirus-lockdown-30-karnataka-revises-sop-for-international-passengers-scraps-category-c-834541.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/07/Corona-istock-1588825450.jpg", "publishedAt": "2020-05-07T04:24:10Z", "content": "Karnataka revised its standard operating procedure (SOP) for international passengers on Wednesday. The first group of passengers will arrive in the state on May 8.\r\nThe number of categories has been reduced to two from three. Category A includes passengers s… [+2070 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Prafulla Das", "title": "COVID-19: With 20 new cases, Odisha’s tally goes up to 205 - The Hindu", "description": "Ganjam district has emerged as the latest hotspot in the State with a total of 21 cases being reported in less than a week", "url": "https://www.thehindu.com/news/national/other-states/covid-19-with-20-new-cases-odishas-tally-goes-up-to-205/article31523271.ece", "urlToImage": "https://www.thehindu.com/news/national/other-states/6dr11v/article31523270.ece/ALTERNATES/LANDSCAPE_615/THNAK", "publishedAt": "2020-05-07T04:04:43Z", "content": "Odisha has registered a highest single day spike in COVID-19 positive cases with the detection of 20 new cases, pushing its total to 205, the State Health &amp; Family Welfare Department said on Thursday morning.\r\nThe total number of cases, which was 185 till… [+2005 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mystery Pediatric Illness Possibly Linked To COVID-19 Reported In New York - CBS New York", "description": "A mystery illness is affecting children in New York and possibly New Jersey, and it may be linked to COVID-19.", "url": "https://www.youtube.com/watch?v=jTPGBwfyRE4", "urlToImage": "https://i.ytimg.com/vi/jTPGBwfyRE4/maxresdefault.jpg", "publishedAt": "2020-05-07T03:17:54Z", "content": "A mystery illness is affecting children in New York and possibly New Jersey, and it may be linked to COVID-19."}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Italy's daily coronavirus death toll and new cases tally both rise - Times of India", "description": "Europe News: ROME: Deaths from the Covid-19 epidemic in Italy climbed by 369 on Wednesday, against just 236 the day before, the civil protection agency said, while.", "url": "https://timesofindia.indiatimes.com/world/europe/italys-daily-coronavirus-death-toll-and-new-cases-tally-both-rise/articleshow/75582763.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75582816,width-1070,height-580,imgsize-664487,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-05-07T02:30:52Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allen Kim and Amanda Watts, CNN", "title": "These are the '10 plain truths' about the coronavirus pandemic, according to former CDC Director Dr. Tom Frieden - CNN", "description": "Dr. Tom Frieden, the former director of the US Centers for Disease Control and Prevention, laid out \"10 plain truths\" about Covid-19 on Wednesday as he spoke at a House Appropriations Committee hearing on the pandemic response.", "url": "https://www.cnn.com/2020/05/06/health/cdc-coronavirus-truths-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/141016094336-cdc-director-tom-frieden-super-tease.jpg", "publishedAt": "2020-05-07T02:15:56Z", "content": "(CNN)Dr. Tom Frieden, the former director of the US Centers for Disease Control and Prevention, laid out \"10 plain truths\" about Covid-19 on Wednesday as he spoke at a House Appropriations Committee hearing on the pandemic response. \r\n\"In my 30 years in globa… [+5359 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Tim Loh", "title": "Dutch scientists create anti-body that defeats coronavirus in lab - ThePrint", "description": "The experimental anti-body may help prevent or treat Covid-19 either alone or in a drug combination, according to study published in Nature Communications.", "url": "https://theprint.in/health/dutch-scientists-create-anti-body-that-defeats-coronavirus-in-lab/414347/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/coronavirus-testing-scaled-e1586165575726.jpg", "publishedAt": "2020-05-07T01:36:33Z", "content": "Munich: Scientists created a monoclonal antibody that can defeat the new coronavirus in the lab, an early but promising step in efforts to find treatments and curb the pandemics spread.\r\nThe experimental antibody may help prevent or treat Covid-19 and related… [+1659 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Dr. Kamal Kant Kohli", "title": "Adding Yoga to standard migraine treatment improves outcomes - Medical Dialogues", "description": "A new study finds that addition of yoga to standard medical treatment helps reduce frequency,...", "url": "https://medicaldialogues.in/neurology-neurosurgery/news/yoga-addition-to-medical-treatment-of-migraine-improves-outcomes-65531", "urlToImage": "https://medicaldialogues.in/h-upload/2020/01/16/123024-migraine.jpg", "publishedAt": "2020-05-06T22:48:00Z", "content": "MINNEAPOLIS - Migraine is one of the most difficult medical challenges not responsive to most available treatments. Researchers have suggested an easy, safe and cost effective treatment of migraine.\r\nResearchers have found that adding yoga to regularly prescr… [+3133 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Aylin Woodward", "title": "A mutated coronavirus strain is responsible for most of the world's COVID-19 infections. That doesn't mean it' - Business Insider India", "description": "Scientists track genetic errors, or mutations, in the coronavirus' genome to study its evolution over time. A preliminary study suggests a mutated coronavirus", "url": "https://www.businessinsider.in/science/news/a-mutated-coronavirus-strain-is-responsible-for-most-of-the-worlds-covid-19-infections-that-doesnt-mean-its-more-dangerous-than-the-original-/articleshow/75589135.cms", "urlToImage": "https://www.businessinsider.in/photo/75589135/a-mutated-coronavirus-strain-is-responsible-for-most-of-the-worlds-covid-19-infections-that-doesnt-mean-its-more-dangerous-than-the-original-.jpg?imgsize=769848", "publishedAt": "2020-05-06T22:43:00Z", "content": "Preliminary research from scientists at Los Alamos National Laboratory suggests that a version of the new coronavirus with a particular mutation is outcompeting all the rest. \r\nThe strain is of \"urgent concern,\"the scientists wrote. \"It began spreading in Eur… [+4820 chars]"}, {"source": {"id": null, "name": "Thelancet.com"}, "author": null, "title": "The immune system of children: the key to understanding SARS-CoV-2 susceptibility? - The Lancet", "description": "Humanity has repeatedly faced epidemics of known and novel pathogens and the immune\nsystem has adapted to survive. Since severe acute respiratory syndrome coronavirus\n2 (SARS-CoV-2) is a new zoonotic pathogen, there is no pre-existing immunity and the\nwhole o…", "url": "https://www.thelancet.com/journals/lanchi/article/PIIS2352-4642(20)30135-8/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/5adce2ab-6375-4a50-b247-21c8ef55c5f0/fx1.jpg", "publishedAt": "2020-05-06T22:37:16Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. By continuing you agree to the use of cookies.\r\nCopyright © 2020 Elsevier Inc. except certain content provided by third parties.\r\nPrivacy Policy   Terms and Conditions"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Doctors 3D Print Exact Model of 7-Year-Old Girl's Airway to Prepare for Delicate Operation - SciTechDaily", "description": "An anesthesia team in Israel has become one of the first to use 3D printing and virtual reality to produce an exa. ct model of the airway of a 7-year-old girl in order to prepare properly for an operation to remove part of her lung. This pioneering report is …", "url": "https://scitechdaily.com/doctors-3d-print-exact-model-of-7-year-old-girls-airway-to-prepare-for-delicate-operation/", "urlToImage": "https://scitechdaily.com/images/Endotracheal-Tube-Left-Main-Bronchus.jpg", "publishedAt": "2020-05-06T22:00:50Z", "content": "The day before surgery, the treating anesthesiologist spent time on the virtual reality simulator familiarizing himself with the patient’s airway anatomy. Credit: European Society of Anaesthesiology\r\nAn anesthesia team in Israel has become one of the first to… [+3373 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Cholesterol lowering drugs linked to improved gut bacteria composition in obese people - Science Daily", "description": "Obese Europeans who are treated with cholesterol lowering drugs have not only lower values of blood LDL cholesterol and markers of inflammation but in addition a more healthy gut bacteria profile than those obese who are not prescribed statins.", "url": "https://www.sciencedaily.com/releases/2020/05/200506133639.htm", "urlToImage": null, "publishedAt": "2020-05-06T19:48:51Z", "content": "The human gut microbiota consists of trillions of bacteria, fungi and virus constituting an inner chemical factory producing a multitude of microbial compounds affecting immunity, neurobiology and metabolism of the human host.It has for long been known that i… [+2369 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Virus mutations could mean more contagious strain of COVID-19 - euronews (in English)", "description": "Subscribe to our channel: http://bit.ly/2nhQGgN Hello and welcome to Euronews Live, our top stories ➡️ The United Kingdom records more Coronavirus deaths tha...", "url": "https://www.youtube.com/watch?v=gt2JGYGXwqw", "urlToImage": "https://i.ytimg.com/vi/gt2JGYGXwqw/maxresdefault.jpg", "publishedAt": "2020-05-06T19:03:32Z", "content": "Subscribe to our channel: http://bit.ly/2nhQGgN\r\nHello and welcome to Euronews Live, our top stories The United Kingdom records more Coronavirus deaths than Italy. More than 29 thousand people have known to have died of the virus, but is the actual number muc… [+851 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Pope prays for COVID-19 vaccine - Arlington Catholic Herald", "description": "During his Regina Coeli address May 3, Pope Francis prayed for a vaccine for the novel coronavirus and asked people of all religions to pray and fast on May 14.", "url": "https://www.youtube.com/watch?v=nLpGADncxwY", "urlToImage": "https://i.ytimg.com/vi/nLpGADncxwY/maxresdefault.jpg", "publishedAt": "2020-05-06T18:23:23Z", "content": null}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Maria Cohut Ph.D.", "title": "Should people take vitamin D to ward off the new coronavirus? - Medical News Today", "description": "A preliminary study claims a link between mean levels of vitamin D in a country's population and the incidence of COVID-19 deaths. But is it convincing?", "url": "https://www.medicalnewstoday.com/articles/should-people-take-vitamin-d-to-ward-off-the-new-coronavirus", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2020/05/GettyImages-1213350102-1200x628.jpg", "publishedAt": "2020-05-06T17:15:38Z", "content": "A preliminary, unpublished study speculates that vitamin D deficiency may have something to do with poor COVID-19 outcomes. Its authors suggest people may benefit from ensuring they are getting enough vitamin D. However, there are serious concerns about the r… [+4579 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "The second virus wave: How bad will it be as lockdowns ease? - Moneycontrol", "description": "A century ago, the Spanish flu epidemic’s second wave was far deadlier than its first, in part because authorities allowed mass gatherings from Philadelphia to San Francisco.", "url": "https://www.moneycontrol.com/news/world/the-second-virus-wave-how-bad-will-it-be-as-lockdowns-ease-5233531.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/05/coronavirus_world-770x433.jpg", "publishedAt": "2020-05-06T16:38:12Z", "content": "From the marbled halls of Italy to the wheat fields of Kansas, health authorities are increasingly warning that the question isnt whether a second wave of coronavirus infections and deaths will hit, but when and how badly.\r\nIn India, which relaxed its lockdow… [+7106 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "New York Times", "title": "Coronavirus cases rise in India as lockdown eases - Times of India", "description": "Part of India’s success in blunting the spread of a coronavirus outbreak had been a fierce lockdown — the largest i", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-cases-rise-in-india-as-lockdown-eases/articleshow/75576652.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75576652,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-795932/75576652.jpg", "publishedAt": "2020-05-06T16:00:19Z", "content": "Part of Indias success in blunting the spread of a coronavirus outbreak had been a fierce lockdown the largest in the world, with 1.3 billion people under the restrictions. But the government has loosened the rules over the past few days, drawing people into … [+1923 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Cecile Mantovani", "title": "Over 90,000 health workers infected with COVID-19 worldwide: nurses group - Reuters", "description": "At least 90,000 health-care workers worldwide are believed to have been infected with COVID-19, and possibly twice that, amid reports of continuing shortages of protective equipment, the International Council of Nurses (ICN) said on Wednesday.", "url": "https://www.reuters.com/article/us-health-coronavirus-nurses-idUSKBN22I1XH", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200506&t=2&i=1517670296&w=1200&r=LYNXMPEG45183", "publishedAt": "2020-05-06T14:35:40Z", "content": "(Reuters) - At least 90,000 health-care workers worldwide are believed to have been infected with COVID-19, and possibly twice that, amid reports of continuing shortages of protective equipment, the International Council of Nurses (ICN) said on Wednesday. \r\nT… [+2065 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Conrad Duncan", "title": "Coronavirus: Experts warn potential for Covid-19 to spread through sewage ‘must not be neglected’ by researchers - The Independent", "description": "Scientists say investment is needed to investigate issue after Covid-19 found in sewers", "url": "https://www.independent.co.uk/news/health/coronavirus-sewage-spread-research-professor-richard-quilliam-wastewater-sewers-a9501386.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/05/06/12/coronavirus-stock.jpg", "publishedAt": "2020-05-06T14:31:16Z", "content": "The potential for coronavirus to spread through sewage must not be neglected in efforts to contain the Covid-19 pandemic, environmental biologists have warned.\r\nAlthough attempts to slow the spread of the virus have mainly focused on preventing human-to-human… [+2634 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "IANS", "title": "Hyderabad university faculty deciphers key to Covid-19 infection in humans - Livemint", "description": "Professor Lalita Guruprasad of Hyderabad university has identified the defining features that distinguish the coronavirus mutations possessing the ability to infect human beings", "url": "https://www.livemint.com/news/india/hyderabad-university-faculty-deciphers-key-to-covid-19-infection-in-humans-11588773576958.html", "urlToImage": "https://images.livemint.com/img/2020/05/06/600x338/2020-05-03T172617Z_1806814533_RC25HG9F861B_RTRMADP_3_HEALTH-CORONAVIRUS-CANADA-ABCELLERA_1588766913244_1588774105137.JPG", "publishedAt": "2020-05-06T14:09:07Z", "content": "HYDERABAD :\r\nWhile the world races to develop a vaccine to counter the scourge of Covid-19, a faculty member at the University of Hyderabad (UoH) has made a crucial discovery that can help in the design of antibodies capable of combating the virus.Professor L… [+2849 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Blood Sugar test: When and how to do it correctly - Times of India", "description": "Constantly monitoring the blood glucose level helps to manage the health condition and prevent complications.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/blood-sugar-test-when-and-how-to-do-it-correctly/photostory/75578538.cms", "urlToImage": "https://static.toiimg.com/photo/75578655.cms", "publishedAt": "2020-05-06T13:35:00Z", "content": "You can do the test multiple times a day to monitor the fluctuation, but it is important to consult your doctor about the frequency. Depending on your health condition, your doctor will tell you how often you should do it. You can do it:\r\nBefore meals and sna… [+525 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Silent hypoxia: Covid-19 patients who should be gasping for air but aren't - CNN", "description": "An unusual subset of Covid-19 patients have few breathing struggles, called 'silent hypoxia' and horribly nicknamed 'happy' hypoxia, even though their oxygen levels and lungs show signs of terrible illness.", "url": "https://www.cnn.com/2020/05/06/health/happy-hypoxia-pulse-oximeter-trnd-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200325000535-covid-19-lung-damage-video-super-tease.jpg", "publishedAt": "2020-05-06T13:34:09Z", "content": "(CNN)In hospitals around the world, doctors are shaking their heads in disbelief as they watch Covid-19 patients who should be comatose or \"seizing\" from hypoxia -- a lack of oxygen in the body's tissues -- check social media, chat with nurses and barely comp… [+7322 chars]"}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "Understanding zoonotic diseases: How viruses break the nature-human divide - Down To Earth Magazine", "description": "Their novel nature and unpredictability make diseases that jump from animals to humans extremely dangerous", "url": "https://www.downtoearth.org.in/news/wildlife-biodiversity/understanding-zoonotic-diseases-how-viruses-break-the-nature-human-divide-70930", "urlToImage": "https://cdn.downtoearth.org.in/library/large/2020-05-06/0.12843600_1588767050_35.jpg", "publishedAt": "2020-05-06T13:00:39Z", "content": "Their novel nature and unpredictability make diseases that jump from animals to humans extremely dangerousIn the first 20 years of the 21st century, the world has seen outbreaks of avian influenza, Ebola virus disease, Zika virus disease, Nipah virus disease,… [+5444 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Hydroxychloroquine No Wonder Drug for Treating Covid-19 Patients, Can be Fatal: Experts - News18", "description": "While frantic efforts are underway to develop a vaccine and doctors all over try and control the spread of the disease for which there is yet no cure, hydroxychloroquine, or HCQ, has emerged as a prime focus area of treatment.", "url": "https://www.news18.com/news/world/hydroxychloroquine-no-wonder-drug-for-treating-covid-19-patients-can-be-fatal-experts-2608463.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1586623002_untitled-design-6.png", "publishedAt": "2020-05-06T12:55:34Z", "content": "New Delhi: As countries around the world explore the potential of hydroxychloroquine to treat COVID-19 patients, several experts have sounded a note of warning to say it is not a wonder drug and may even be fatal in some cases.\r\nWhile frantic efforts are unde… [+4382 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus pandemic | FSSAI launches online training programme for food businesses - Moneycontrol", "description": "\"COVID-19 is posing a serious challenge for food supply chains worldwide. The challenge is to ensure uninterrupted food supply to consumers whilst containing the risk of COVID-19 for the workers, customers and all participants in the food supply chain,\" FSSAI…", "url": "https://www.moneycontrol.com/news/india/coronavirus-impact-fssai-launches-online-training-programme-for-food-businesses-5231531.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/01/Organic-Food-770x433.png", "publishedAt": "2020-05-06T12:18:35Z", "content": "Food regulator FSSAI on Wednesday said it has started an online training programme for food business operators (FBOs) to help them maintain safety and hygiene across food supply chain in view of the coronavirus outbreak.\r\n\"COVID-19 is posing a serious challen… [+1676 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Dealing with Covid: Heating may effectively disinfect N95 masks, making them reusable for 50 cycles - Economic Times", "description": "Because of the shortage, many healthcare workers have to wear the same mask repeatedly.", "url": "https://economictimes.indiatimes.com/magazines/panache/dealing-with-covid-heating-may-effectively-disinfect-n95-masks-making-them-reusable-for-50-cycles/articleshow/75573853.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75574036,width-1070,height-580,imgsize-622136,overlay-etpanache/photo.jpg", "publishedAt": "2020-05-06T12:04:13Z", "content": "LOS ANGELES: Heating may be the best way to disinfect N95 masks for reuse, according to a study which found that doing so preserves their filtration efficiency for 50 cycles. \r\nSince the outbreak of the COVID-19 pandemic, N95 face masks have been in short sup… [+4744 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "A tale of two deadly pandemics? How 2020 looks remarkably similar to 1918 - euronews (in English)", "description": "Modern science and medicine may have jumped by leaps and bounds since 1918, but the world's response to the COVID-19 pandemic has so far relied on old tried-...", "url": "https://www.youtube.com/watch?v=b-t6ttLU0w8", "urlToImage": "https://i.ytimg.com/vi/b-t6ttLU0w8/maxresdefault.jpg", "publishedAt": "2020-05-06T11:53:45Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Intensive farming may increase risk of epidemics, scientists warn - Times of India", "description": "Science News: LONDON: Intensive farming techniques have led to a common antibiotic-resistant pathogen to become capable of infecting both cattle and humans, accordi.", "url": "https://timesofindia.indiatimes.com/home/science/intensive-farming-may-increase-risk-of-epidemics-scientists-warn/articleshow/75575732.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75575727,width-1070,height-580,imgsize-1683965,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-05-06T11:20:00Z", "content": "LONDON: Intensive farming techniques have led to a common antibiotic-resistant pathogen to become capable of infecting both cattle and humans, according to a study which suggests the need to check agriculture practices for such outbreaks.\r\nThe scientists, inc… [+2578 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Nursing cancer patients during COVID-19 - NEWS CENTER Maine", "description": "Nurses at Northern Light Cancer Care are dealing with physical and emotional changes during the coronavirus pandemic to better protect susceptible patients.", "url": "https://www.youtube.com/watch?v=xewPkvW7jn0", "urlToImage": "https://i.ytimg.com/vi/xewPkvW7jn0/hqdefault.jpg", "publishedAt": "2020-05-06T10:33:09Z", "content": null}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Anushree Gupta", "title": "Structure of SARS-CoV-2 virus offers clue to high infection rate - Study - Times Now", "description": "In order to infect a cell, they said features of the spike protein must bind with a receptor on the host cell's surface, and cats have a receptor binding site that closely matches that of humans.", "url": "https://www.timesnownews.com/health/article/structure-of-sars-cov-2-virus-offers-clue-to-high-infection-rate-study/587835", "urlToImage": "https://imgk.timesnownews.com/story/coronavirus_reuters_26.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-06T10:04:13Z", "content": "New York: Researchers studying the structure of the novel coronavirus that causes COVID-19 have found a unique feature in the virus that could explain its high transmissibility between people, an advance that may help develop new drugs against the disease.The… [+2423 chars]"}, {"source": {"id": null, "name": "Goodnewsnetwork.org"}, "author": null, "title": "Breakthrough For Kenyan Scientists Who Discover Natural Microbe That Completely Stops Malaria in Mosquitoes - Good News Network", "description": "Kenyan scientists discovered a microbe–Microsporidia MB–inside some mosquitoes that completely protects them from malaria infection which spreads to humans.", "url": "https://www.goodnewsnetwork.org/microbe-completely-stops-malaria-in-mosquitoes-discovered/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2020/05/mosquito-net-with-bugs-cc-Dean-Calma-IAEA.jpg", "publishedAt": "2020-05-06T09:20:00Z", "content": "A team of scientists in Kenya and the UK are hailing the enormous potential of a new strategy to control malaria, after discovering that a microbe completely protects mosquitoes from infection.\r\nThe data we have so far suggest it is 100% blockage, Dr. Jeremy … [+1843 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Dr. Kamal Kant Kohli", "title": "Green tea augments weight loss efforts, finds study - Medical Dialogues", "description": "Green tea is known to contain antioxidants and has several health benefits.Several studies have...", "url": "https://medicaldialogues.in/medicine/news/green-tea-augments-weight-loss-efforts-finds-study-65507", "urlToImage": "https://medicaldialogues.in/h-upload/2020/01/21/123318-tea-drinking.jpg", "publishedAt": "2020-05-06T06:44:21Z", "content": "Green tea is known to contain antioxidants and has several health benefits.Several studies have suggested that the flavonoids and caffeine in green tea can help elevate metabolic rate, increase fat oxidation and even improve insulin activity.\r\nIn a new system… [+1744 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Melanie Kaidan", "title": "Shocking report reveals Italy could see a deadlier second wave of coronavirus soon - Express.co.uk", "description": "A STUDY from Imperial College London has found Italy could experience a deadlier second coronavirus outbreak.", "url": "https://www.express.co.uk/news/world/1278350/italy-second-wave-lockdown-coronavirus-death-toll-giuseppe-conte-covid-19-research-report", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/78/750x445/1278350.jpg", "publishedAt": "2020-05-06T04:09:00Z", "content": null}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Coronavirus Outbreak: Noida, Greater Noida impose fines of up to Rs 1,000 for spitting in public places - Firstpost", "description": "Spitting saliva, gutka, or tobacco in public places across Noida and Greater Noida has been prohibited and violation of this ban can attract a penalty of Rs 500 for first-time offenders and Rs 1,000 for repeat offenders, according to orders issued to contain …", "url": "https://www.firstpost.com/health/coronavirus-outbreak-noida-greater-noida-impose-fines-of-up-to-rs-1000-for-spitting-in-public-places-8336601.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/03/coronavirus_Hyderabad_PTI_1280.jpg", "publishedAt": "2020-05-06T03:08:04Z", "content": null}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Himani Chandna", "title": "How India can be a world leader in making Covid vaccine and keeping it cheap too - ThePrint", "description": "With a system of mass manufacturing already in place, India is set to play a major role in producing the Covid-19 vaccine and selling it at affordable price across the globe.", "url": "https://theprint.in/india/how-india-can-be-a-world-leader-in-making-covid-vaccine-and-keeping-it-cheap-too/414701/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2018/12/vaccine.jpg", "publishedAt": "2020-05-06T02:33:42Z", "content": "New Delhi: With the world joining hands to find a vaccine for Covid-19, all eyes are on India, the powerhouse of vaccine manufacturing. \r\nIndia produces 60 per cent of the worlds vaccines and accounts for 60-80 per cent of the United Nations annual vaccine pr… [+8462 chars]"}, {"source": {"id": null, "name": "Newshub.co.nz"}, "author": null, "title": "US scientists discover mutation which could signal end of coronavirus - Newshub", "description": "The discovery is just a \"drop in the bucket\" but it's still promising.", "url": "https://www.newshub.co.nz/home/world/2020/05/us-scientists-discover-mutation-which-could-signal-end-of-coronavirus.html", "urlToImage": "https://www.newshub.co.nz/home/world/2020/05/us-scientists-discover-mutation-which-could-signal-end-of-coronavirus/_jcr_content/par/image.dynimg.1280.q75.jpg/v1588730296761/getty-coronavirus-1120.jpg", "publishedAt": "2020-05-06T01:51:27Z", "content": "Scientists in Arizona have discovered a mutation of COVID-19 similar to one which ended the SARS epidemic. \r\nResearchers from Arizona State University took 382 samples from confirmed COVID-19 cases and discovered one of the samples was missing a large chunk o… [+378 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "COVID-19 patients and blood clots: Are blood thinners enough? - WGN News", "description": "The more doctors study SARS-CoV-2, the more they realize it not only makes it difficult to breathe, it makes the blood clot. Now, the finding is driving a ch...", "url": "https://www.youtube.com/watch?v=NIeXq5q1pRs", "urlToImage": "https://i.ytimg.com/vi/NIeXq5q1pRs/maxresdefault.jpg", "publishedAt": "2020-05-06T00:21:28Z", "content": "The more doctors study SARS-CoV-2, the more they realize it not only makes it difficult to breathe, it makes the blood clot.Now, the finding is driving a change in the approach to treatment."}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "BBC News", "title": "Coronavirus: How long does it take to recover? - BBC News", "description": "Weeks, months, even a year - we look at the factors that can affect the time taken to get better.", "url": "https://www.bbc.co.uk/news/av/health-52508831/coronavirus-how-long-it-takes-to-recover", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/12A57/production/_112157367_p08ccd69.jpg", "publishedAt": "2020-05-06T00:07:33Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Road to Recovery: Intermoutain Hospital's response to Covid-19 & how they continue to treat mental i - KTVB", "description": "People still need help with mental illness and substance abuse problems. Intermountain Hospital remains available to you.", "url": "https://www.youtube.com/watch?v=9Ky1CmFKrpI", "urlToImage": "https://i.ytimg.com/vi/9Ky1CmFKrpI/hqdefault.jpg", "publishedAt": "2020-05-05T21:47:52Z", "content": null}, {"source": {"id": null, "name": "Medpagetoday.com"}, "author": "Molly Walker", "title": "Asthma and COVID-19 Risk: Good, Bad, or Indifferent? - MedPage Today", "description": "CDC says condition increases risk of severe outcomes; emerging evidence suggests otherwise", "url": "https://www.medpagetoday.com/infectiousdisease/covid19/86323", "urlToImage": "https://clf1.medpagetoday.net/media/images/86xxx/86323.jpg", "publishedAt": "2020-05-05T21:30:07Z", "content": "People with asthma are classified as being at increased risk for severe COVID-19 outcomes, although evidence is emerging that may point in the opposite direction.\r\nUnder normal circumstances, viral infections are a big driver of flares in asthma patients. But… [+3554 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Anuradha Mascarenhas", "title": "Epidemiological modelling indicates COVID-19 pandemic may recede in July if transmission is low - The Indian Express", "description": "The IISER Kolkata model also indicates that if a national lockdown was not implemented, India could have faced a catastrophic pandemic, rivaling and probably exceeding the worst-hit nations.", "url": "https://indianexpress.com/article/cities/pune/epidemiological-modelling-indicates-covid-19-pandemic-may-recede-in-july-if-transmission-is-low-6395640/", "urlToImage": "https://images.indianexpress.com/2020/04/doctor-5.jpg?w=759", "publishedAt": "2020-05-05T18:03:58Z", "content": "The IISER team consisted of scientists Dibyendu Nandi, Ayan Banerjee, Rajesh Nayak, PhD students Shaonwita Pal, Soumyaranjan Dash, and undergraduate students Agnibha Banerjee and Vishal Singh.The results of a new epidemiological modelling, released by researc… [+2938 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Discussion | BCG vaccine and COVID-19 - eNCA", "description": "Clinical research centre, TASK, believes a century-old TB vaccine could be the key to combating COVID-19. Courtesy #DStv403", "url": "https://www.youtube.com/watch?v=eKvth9IPVEU", "urlToImage": "https://i.ytimg.com/vi/eKvth9IPVEU/maxresdefault.jpg", "publishedAt": "2020-05-05T17:24:09Z", "content": "Clinical research centre, TASK, believes a century-old TB vaccine could be the key to combating COVID-19. Courtesy #DStv403"}]}