{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How to self-monitor for Novel Coronavirus (COVID-19) - Univ. of California, Riverside", "description": "This video is a quick guide for protecting one’s self against the novel coronavirus as well as how to self-monitor for symptoms. These steps are particularly...", "url": "https://www.youtube.com/watch?v=WLl_Py3HpkU", "urlToImage": null, "publishedAt": "2020-04-25T02:21:29Z", "content": "This video is a quick guide for protecting ones self against the novel coronavirus as well as how to self-monitor for symptoms. These steps are particularly important for essential workers, including those at the University of California, Riverside who contin… [+1107 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mysteries remain about coronavirus - ABC News", "description": "Dr. Simone Wiles, an infectious disease physician, joins us to discuss how scientists race to learn more about this deadly virus. ABC News Live Prime, Weekda...", "url": "https://www.youtube.com/watch?v=fLNwkogfNfs", "urlToImage": null, "publishedAt": "2020-04-25T00:46:03Z", "content": "Dr. Simone Wiles, an infectious disease physician, joins us to discuss how scientists race to learn more about this deadly virus.\r\nABC News Live Prime, Weekdays at 7EST &amp; 9EST WATCH the ABC News Live Stream Here: https://www.youtube.com/watch?v=w_Ma8...\r\n… [+234 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Journalists receive face masks and sanitisers for protection - TVC News Nigeria", "description": "As the world continue to battle the spread of Coronavirus pandemic, face masks and hand sanitisers have been distributed to journalists for protection agains...", "url": "https://www.youtube.com/watch?v=OafLtFLJc6w", "urlToImage": null, "publishedAt": "2020-04-24T23:37:30Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Hydroxychloroquine shortage a pain for Bengaluru arthritis patients - Times of India", "description": "Due to its use as a prophylaxis for Covid-19, anti-malarial drug hydroxychloroquine (HCQ) is not available to those who consume it regularly — arthrit", "url": "https://timesofindia.indiatimes.com/city/bengaluru/shortage-of-hcq-a-pain-for-arthritis-lupus-patients/articleshow/75362305.cms", "urlToImage": null, "publishedAt": "2020-04-24T23:19:00Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "VIDEO: Doctor, patient discuss donating plasma - WFSB 3", "description": "A doctor from St. Franics and a patient who recovered from COVID-19 are discussing how donating blood plasma can save others.", "url": "https://www.youtube.com/watch?v=F0ni6X6a5hg", "urlToImage": null, "publishedAt": "2020-04-24T22:39:53Z", "content": null}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Ariana Eunjung Cha", "title": "Young and middle-aged people, barely sick with covid-19, are dying from strokes - The Washington Post", "description": "Doctors sound alarm about patients in their 30s and 40s left debilitated or dead by strokes. Some didn’t even know they were infected by coronavirus.", "url": "https://www.washingtonpost.com/health/2020/04/24/strokes-coronavirus-young-patients/", "urlToImage": null, "publishedAt": "2020-04-24T22:36:00Z", "content": "Thomas Oxley wasnt even on call the day he received the page to come into Mount Sinai Beth Israel Hospital in Manhattan. There werent enough doctors to treat all the emergency stroke patients, and he was needed in the operating room.\r\nThe patients chart appea… [+9500 chars]"}, {"source": {"id": null, "name": "Thelancet.com"}, "author": null, "title": "Diagnosing malaria and other febrile illnesses during the COVID-19 pandemic - The Lancet", "description": "As the global malaria community observes World Malaria Day on April 25, 2020, we have\nplenty to celebrate. Yet this year, the coronavirus disease 2019 (COVID-19) outbreak\nis greatly dampening the spirits. While the Asia-Pacific region has made substantial\npro…", "url": "https://www.thelancet.com/journals/langlo/article/PIIS2214-109X(20)30210-2/fulltext", "urlToImage": null, "publishedAt": "2020-04-24T22:33:36Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. By continuing you agree to the use of cookies.\r\nCopyright © 2020 Elsevier Inc. except certain content provided by third parties.\r\nPrivacy Policy   Terms and Conditions"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "White House Coronavirus Task Force holds Friday briefing on COVID-19 - 10 Tampa Bay", "description": "President Donald Trump and members of the White House Coronavirus Task Force are giving an update on the nation's fight against COVID-19. Health experts cont...", "url": "https://www.youtube.com/watch?v=BiDhFyIMPm4", "urlToImage": null, "publishedAt": "2020-04-24T21:39:36Z", "content": "President Donald Trump and members of the White House Coronavirus Task Force are giving an update on the nation's fight against COVID-19. Health experts continue to urge people to practice social distancing to limit the spread of the virus. wtsp.com/coronavir… [+355 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Reuters", "title": "Pregnancy, malaria and coronavirus: A 'perfect storm' for preventable deaths? - Deccan Herald", "description": "Pregnant women in malaria-prone areas are more vulnerable to contracting COVID-19, especially where pesticide spraying to kill mosquitoes has been suspended due to lockdowns, health experts warned ahead of World Malaria Day. During pregnancy, women's immune s…", "url": "https://www.deccanherald.com/science-and-environment/pregnancy-malaria-and-coronavirus-a-perfect-storm-for-preventable-deaths-829608.html", "urlToImage": null, "publishedAt": "2020-04-24T21:34:18Z", "content": "Pregnant women in malaria-prone areas are more vulnerable to contracting COVID-19, especially where pesticide spraying to kill mosquitoes has been suspended due to lockdowns, health experts warned ahead of World Malaria Day.\r\nDuring pregnancy, women's immune … [+2449 chars]"}, {"source": {"id": null, "name": "Straitstimes.com"}, "author": "AUDREY TAN", "title": "Molecular ninja: How a virus hijacks the body, one cell at a time - The Straits Times", "description": "From drinking hot water to eating garlic, \"cures\" for Covid-19 abound on the Internet.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/singapore/health/molecular-ninja-how-a-virus-hijacks-the-body-one-cell-at-a-time", "urlToImage": null, "publishedAt": "2020-04-24T21:00:00Z", "content": "From drinking hot water to eating garlic, \"cures\" for Covid-19 abound on the Internet.\r\nLike the two mentioned, most of these health tips are just myths. It will take more than just hot water to kill the virus in an infected person.\r\nThis is because the virus… [+6495 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "R Sukumar", "title": "Covid-19: What you need to know today - Hindustan Times", "description": "There’s long been a theory that the number of people infected with the Sars-CoV-2 virus, which causes Covid-19, is actually higher than that reported.", "url": "https://www.hindustantimes.com/india-news/covid-19-what-you-need-to-know-today/story-Nv96Urk58r4g4vC43WqwZJ.html", "urlToImage": null, "publishedAt": "2020-04-24T20:07:28Z", "content": "When there is no cure, metrics such as the prevalence of infection and immunity in a population become important.\r\nWhich is why the results of New York’s study of 3,000 people picked at random for an antibody test that were announced on Thursday are being stu… [+3547 chars]"}, {"source": {"id": null, "name": "Theweek.in"}, "author": null, "title": "France limits nicotine sales as researchers test if it 'protects' against COVID-19 - THE WEEK", "description": "Study suggests smokers less likely to catch COVID-19, officials warn of health risk", "url": "https://www.theweek.in/news/health/2020/04/25/france-limits-nicotine-sales-as-researchers-test-if-it-protects-against-covid-19.html", "urlToImage": null, "publishedAt": "2020-04-24T19:57:17Z", "content": "After reports that French researchers were planning clinical trials to see if nicotine patches could help prevent the incidence of COVID-19, following research that showed fewer smokers contracting the disease compared to non-smokers, the French government ha… [+4184 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How has Turkey managed to keep its Covid-19 death toll down? - TRT World", "description": "Turkey is in the top 10 countries globally in terms of its number of coronavirus cases, but the death rate remains low. Why? #turkey #coronavirus, #ICU units...", "url": "https://www.youtube.com/watch?v=gG7Uw0ubj0w", "urlToImage": null, "publishedAt": "2020-04-24T19:51:45Z", "content": "Turkey is in the top 10 countries globally in terms of its number of coronavirus cases, but the death rate remains low. Why? #turkey#coronavirus, #ICU units, #ventilators\r\nSubscribe: http://trt.world/subscribeLivestream: http://trt.world/ytliveFacebook: http:… [+124 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Reuters", "title": "Italy's daily Covid-19 death toll lowest since March 19, but new cases rise - Livemint", "description": "The total number of fatalities since the outbreak now stands at 25,969.The number of confirmed cases was 192,994, the third highest global tally behind those of the United States and Spain", "url": "https://www.livemint.com/news/world/italy-s-daily-covid-19-death-toll-lowest-since-march-19-but-new-cases-rise-11587757014841.html", "urlToImage": null, "publishedAt": "2020-04-24T19:44:35Z", "content": "ROME: Deaths from the COVID-19 epidemic in Italy climbed by 420 on Friday, the smallest daily tally since March 19, the Civil Protection Agency said, but the number of new infections rose to 3,021 from 2,646 on Thursday.Friday's death toll was down from 464 t… [+1058 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Samantha  Black, PhD, The Science Advisory Board staff writer", "title": "Experts discuss promising strategies for tackling SARS-CoV-2 - The Science Board", "description": "What's the best strategy for developing treatments for the SARS-CoV-2 virus? The most promising approaches for a rapid response are antivirals and gene therapy, according to a new review article published April 24 in <em>Frontiers in Microbiology</em>.", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=687", "urlToImage": null, "publishedAt": "2020-04-24T19:24:18Z", "content": "In an unprecedented effort, hundreds of thousands of researchers and clinicians from around the world are fighting against the clock to develop cures, vaccines, and diagnostics for COVID-19, the illness caused by the virus SARS-CoV-2. To date, over 1,650 acad… [+6253 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: Are ventilators the best option for critically ill patients? - Sky News", "description": "Medical professionals are questioning whether ventilators are the best option for treating patients who are in a critical condition. Studies carried out in N...", "url": "https://www.youtube.com/watch?v=DyagCpMX0tE", "urlToImage": null, "publishedAt": "2020-04-24T19:00:34Z", "content": "Medical professionals are questioning whether ventilators are the best option for treating patients who are in a critical condition. Studies carried out in New York in the US and Wuhan in China suggest the current death rate associated with the support system… [+781 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Bloomberg", "title": "France reports 389 more Covid-19 deaths today, fewest in nearly four weeks - Livemint", "description": "The death toll in France rose to 22,245 since the coronavirus outbreak in the country.The overall number of hospitalized patients fell for a 10th day to 28,658, the lowest in almost three weeks", "url": "https://www.livemint.com/news/world/france-reports-389-more-covid-19-deaths-today-fewest-in-nearly-four-weeks-11587753840824.html", "urlToImage": null, "publishedAt": "2020-04-24T19:00:13Z", "content": "France reported the slowest increase in deaths linked to the coronavirus in almost four weeks.Deaths rose by 389 to 22,245, the smallest daily rise since March 29, according to figures provided by Director General for Health Jerome Salomon in a briefing on Fr… [+1317 chars]"}, {"source": {"id": null, "name": "Webmd.com"}, "author": "Brenda  Goodman, MA", "title": "Blood Clots Are Another Dangerous COVID-19 Mystery - WebMD", "description": "Around the world, doctors caring for COVID-19 patients have been trying to make sense of the same thing. When they draw blood from COVID patients, it clots in the tubes.", "url": "https://www.webmd.com/lung/news/20200424/blood-clots-are-another-dangerous-covid-19-mystery", "urlToImage": null, "publishedAt": "2020-04-24T18:46:44Z", "content": "He says this theory of infection explains some things that doctors have been trying to puzzle out.\r\nFor example, certain conditions like high blood pressure, diabetes, and heart disease stress the endothelium. Its no surprise, then, that people who have these… [+1776 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Covid-19: Telangana govt shifts focus to three districts, GHMC - Telangana Today", "description": "Hyderabad: The prevalence of coronavirus positive cases is now almost confined to three districts and the Greater Hyderabad Municipal Corporation limits in Telangana, which has given a lot of hope that the spread of Covid-19 can be halted and the situation br…", "url": "https://telanganatoday.com/covid-19-telangana-govt-shifts-focus-to-three-districts-ghmc", "urlToImage": null, "publishedAt": "2020-04-24T18:28:00Z", "content": "Hyderabad: The prevalence of coronavirus positive cases is now almost confined to three districts and the Greater Hyderabad Municipal Corporation limits in Telangana, which has given a lot of hope that the spread of Covid-19 can be halted and the situation br… [+2402 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Sanchita Sharma", "title": "6 vaccines in human trials bring hope of early Covid-19 relief - Hindustan Times", "description": "If the trials are a success, scientists hope to have one million doses ready by September, and to dramatically scale up manufacturing after that.", "url": "https://www.hindustantimes.com/india-news/6-vaccines-in-human-trials-bring-hope-of-early-covid-19-relief/story-visLZbOv8tSYdAjFJZHGDN.html", "urlToImage": null, "publishedAt": "2020-04-24T18:23:28Z", "content": "Human safety trials of a coronavirus vaccine developed by Oxford University began on Thursday even as Indian company Serum Institute of India started work on making the vaccine locally so as to be ready in case the trial succeeds. \r\nThe trial began in Oxford … [+7254 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Matthew Weaver", "title": "Twin sisters, one a nurse in Southampton, two of the latest to die from coronavirus - The Guardian", "description": "Katy and Emma Davis among recent victims, who include a BNP member who found Islam", "url": "https://www.theguardian.com/world/2020/apr/24/twin-sisters-one-a-nurse-in-southampton-two-of-the-latest-to-die-from-coronavirus", "urlToImage": null, "publishedAt": "2020-04-24T18:06:46Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "5 Things in 5 Minutes in Germany - Can Germany endure a second COVID-19 wave? - TRT World", "description": "This week we are looking at: -The possibility of second coronavirus wave with restrictions loosened -Thousands of students sit final exams, social distancing...", "url": "https://www.youtube.com/watch?v=_RdD5uYofW0", "urlToImage": null, "publishedAt": "2020-04-24T17:38:10Z", "content": "This week we are looking at:\r\n-The possibility of second coronavirus wave with restrictions loosened-Thousands of students sit final exams, social distancing challenges arise-German economy experiencing hardest time after World War II-Protesters against lockd… [+508 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Microbiologist is first in line for Oxford's Covid-19 vaccine trial - Telangana Today", "description": "London: A microbiologist has become the first human to be injected for the human trial phase of a vaccine in the UK against the novel coronavirus being developed by a group of scientists at the University of Oxford. Elisa Granato is the first volunteer in an …", "url": "https://telanganatoday.com/microbiologist-is-first-in-line-for-oxfords-covid-19-vaccine-trial", "urlToImage": null, "publishedAt": "2020-04-24T17:14:00Z", "content": "London: A microbiologist has become the first human to be injected for the human trial phase of a vaccine in the UK against the novel coronavirus being developed by a group of scientists at the University of Oxford.\r\nElisa Granato is the first volunteer in an… [+1911 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "PTI", "title": "India may see second wave of COVID-19 outbreak in monsoon: Scientists - Zee News", "description": "The timing of the peak will depend on how India is able to control physical distancing and on the level of infection spreads after restrictions are relaxed, said scientists.", "url": "https://zeenews.india.com/india/india-may-see-second-wave-of-covid-19-outbreak-in-monsoon-scientists-2278767.html", "urlToImage": null, "publishedAt": "2020-04-24T16:47:09Z", "content": "New Delhi: The trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the lockdown is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say scient… [+6179 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Covid-19: Plasma Therapy likely to begin from Apr 25 in Karnataka - India Today", "description": "Karnataka is likely to start Convalescent Plasma Therapy for Covid-19 patients, who are critical, from April 25, Medical Education Minister K Sudhakar said on Friday.", "url": "https://www.indiatoday.in/india/story/covid19-plasma-therapy-likely-begin-apr-25-karnataka-1670778-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T16:46:58Z", "content": "Karnataka is likely to start Convalescent Plasma Therapy for Covid-19 patients, who are critical, from tomorrow, Medical Education Minister K Sudhakar said on Friday.\r\n\"We have already got approval for Convalescent Plasma Therapy. There is no need for any spe… [+1496 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Tara Parker-Pope", "title": "What’s a Pulse Oximeter, and Do I Really Need One at Home? - The New York Times", "description": "A tiny fingertip device can give you valuable information about your health during a bout of Covid-19 or any respiratory illness.", "url": "https://www.nytimes.com/2020/04/24/well/live/coronavirus-pulse-oximeter-oxygen.html", "urlToImage": null, "publishedAt": "2020-04-24T16:05:24Z", "content": "After working for 10 days at Bellevue Hospital in New York, Dr. Richard Levitan decided to share what he had learned about Covid-19. Too many patients were showing up at the hospital with perilously low oxygen levels, putting them at risk for severe complicat… [+8004 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Sweden to shut bars and restaurants that ignore coronavirus restrictions - Reuters India", "description": "Sweden warned on Friday it would shut restaurants and bars in the capital that did not comply with guidelines aimed at preventing the spread of the novel coronavirus, amid signs Stockholm residents were beginning to ignore the rules.", "url": "https://in.reuters.com/article/health-coronavirus-sweden-stockholm-idINKCN2262C2", "urlToImage": null, "publishedAt": "2020-04-24T15:05:14Z", "content": "STOCKHOLM (Reuters) - Sweden warned on Friday it would shut restaurants and bars in the capital that did not comply with guidelines aimed at preventing the spread of the novel coronavirus, amid signs Stockholm residents were beginning to ignore the rules. \r\nT… [+2132 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AFP", "title": "Coronavirus vaccine: Monkeys largely protected during trial, says Chinese firm - Livemint", "description": "Sinovac Biotech said it injected two different doses of its vaccine into eight rhesus macaque monkeys and exposed them to the virus three weeks later, and they did not develop infections", "url": "https://www.livemint.com/news/world/coronavirus-vaccine-monkeys-largely-protected-during-trial-says-chinese-firm-11587736770613.html", "urlToImage": null, "publishedAt": "2020-04-24T14:13:47Z", "content": "A novel coronavirus vaccine has for the first time \"largely protected\" monkeys from infection during an animal trial, data from a Chinese pharmaceutical giant showed.It is among a slew of vaccines being developed around the world as countries race to stop an … [+3317 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Chris Smith", "title": "The most unusual coronavirus symptom is also the most dangerous - BGR", "description": "The newest observed coronavirus symptom is also the most dangerous one and can appear in patients who don’t even experience other symptoms. Doctors have noticed an increase in strokes caused by blood clots in young adults, who might be reluctant to seek medic…", "url": "https://bgr.com/2020/04/24/coronavirus-symptoms-stroke-after-blood-clots-in-young-patients/", "urlToImage": null, "publishedAt": "2020-04-24T14:02:10Z", "content": "<ul><li>The newest observed coronavirus symptom is also the most dangerous one and can appear in patients who don’t even experience other symptoms.</li><li>Doctors have noticed an increase in strokes caused by blood clots in young adults, who might be relucta… [+3622 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coming up with COVID-19 vaccine will be very complex - Dr Oyekan - TVC News Nigeria", "description": "In this interview, Dr Oyekan shares his views on the challenges facing health workers who are at the forfront of Coronavirus battle. #DrOyekan #Coronavirus #...", "url": "https://www.youtube.com/watch?v=kd4ET9pB3iY", "urlToImage": null, "publishedAt": "2020-04-24T14:01:34Z", "content": null}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Livemint", "title": "Coronavirus survivor's diary: Life after ventilators can be hell - Livemint", "description": "Three weeks after her release, Diana Aguilar's recovery is mercilessly slow. She still feels weak, with a shortness of breath and vivid nightmares that she’s back in the hospital, tied to the bed, unable to breathe", "url": "https://www.livemint.com/news/world/coronavirus-survivor-s-diary-life-after-ventilators-can-be-hell-11587734690907.html", "urlToImage": null, "publishedAt": "2020-04-24T13:56:03Z", "content": "NEW YORK :\r\nHer fever hit 105 degrees. In her delirium, Diana Aguilar was sure the strangers hovering over her, in their masks and gowns, were angels before they morphed into menacing aliens. As a doctor prepared to slide a ventilator tube down her throat, al… [+13674 chars]"}, {"source": {"id": null, "name": "Webmd.com"}, "author": "Carolyn  Crist", "title": "WebMD Poll: 93% With COVID Symptoms Didn't Get Test - WebMD", "description": "About 10% of people think they may have been infected with COVID-19, yet a majority of them have not been tested to find out, a new WebMD reader poll finds.", "url": "https://www.webmd.com/lung/news/20200424/webmd-poll-few-with-symptoms-tested-for-covid", "urlToImage": null, "publishedAt": "2020-04-24T13:45:23Z", "content": "April 24, 2020 -- About 10% of people think they may have been infected with COVID-19, yet only 7% of them received a test to find out, a new WebMD poll finds.\r\nThat percentage is even higher in the New York City area, which has the greatest number of cases i… [+1790 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "New York Times", "title": "Nearly All Patients Hospitalized With Covid-19 Had Chronic Health Issues, Study Finds - Times of India", "description": "A new study of thousands of hospitalized coronavirus patients in the New York City area, the epicenter of the outbr", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/nearly-all-patients-hospitalized-with-covid-19-had-chronic-health-issues-study-finds/articleshow/75347362.cms", "urlToImage": null, "publishedAt": "2020-04-24T13:20:37Z", "content": "A new study of thousands of hospitalized coronavirus patients in the New York City area, the epicenter of the outbreak in the United States, has found that nearly all of them had at least one major chronic health condition, and most 88 percent had at least tw… [+5568 chars]"}, {"source": {"id": null, "name": "Ommcomnews.com"}, "author": "OMMCOM NEWS", "title": "Covid-19 Result Of Crazy Experiments At Wuhan: Russian Scientist - Ommcom News", "description": "A leading microbiologist from Russia has claimed that the novel coronavirus, which originated in China's Wuhan city, is the outcome of \"crazy\" experiments conducted by scientists at the Wuhan Institute of Virology.", "url": "https://www.ommcomnews.com/india-news/covid-19-result-of-crazy-experiments-at-wuhan-russian-scientist", "urlToImage": null, "publishedAt": "2020-04-24T13:12:59Z", "content": "Subscribe\r\nSubscribe to never miss a news \r\nNew Delhi/London: A leading microbiologist from Russia has claimed that the novel coronavirus, which originated in China's Wuhan city, is the outcome of \"crazy\" experiments conducted by scientists at the Wuhan Insti… [+2315 chars]"}, {"source": {"id": null, "name": "Devdiscourse.com"}, "author": "PTI", "title": "Key nose cells identified as likely entry points of novel coronavirus - Devdiscourse", "description": "Scientists have identified two specific cell types in the nose as likely initial infection points for the novel coronavirus that causes COVID-19. The researche", "url": "https://www.devdiscourse.com/article/health/1022363-key-nose-cells-identified-as-likely-entry-points-of-novel-coronavirus", "urlToImage": null, "publishedAt": "2020-04-24T12:56:53Z", "content": "Scientists have identified two specific cell types in the nose as likely initial infection points for the novel coronavirus that causes COVID-19. The researchers, including those from the Wellcome Sanger Institute in the UK and University Medical Centre Groni… [+2333 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Can I get coronavirus from my pet? - India Today", "description": "There's no evidence pets are spreading the virus to people. However, there have been a few cases worldwide where animals likely got the virus from humans, according to the US Department of Agriculture and US Centers for Disease Control and Prevention.", "url": "https://www.indiatoday.in/science/story/can-i-get-coronavirus-from-my-pet-1670664-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T12:31:07Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Life After Ventilators Can Be Hell for Coronavirus Survivors - Bloomberg", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=e6021680-869f-11ea-af8b-dfdc31105994&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNC0yNC9saWZlLWFmdGVyLXZlbnRpbGF0b3JzLWNhbi1iZS1oZWxsLWZvci1jb3JvbmF2aXJ1cy1zdXJ2aXZvcnM=", "urlToImage": null, "publishedAt": "2020-04-24T12:21:24Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": null, "name": "Socialnews.xyz"}, "author": null, "title": "Key nose cells identified as entry points for corona: Study - SocialNews.XYZ", "description": "London, April 24 (SocialNews.XYZ) Researchers have discovered that goblet and ciliated cells in the nose have high levels of the entry proteins that the COVID-19 coronavirus uses to get into our cells. The identification of... - Social News XYZ", "url": "https://www.socialnews.xyz/2020/04/24/key-nose-cells-identified-as-entry-points-for-corona-study/", "urlToImage": null, "publishedAt": "2020-04-24T11:55:08Z", "content": "Home » General » Health » Key nose cells identified as entry points for corona: Study\r\nLondon, April 24 (SocialNews.XYZ) Researchers have discovered that goblet and ciliated cells in the nose have high levels of the entry proteins that the COVID-19 coronaviru… [+2630 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Vinod Rathore", "title": "Blood thickening, clots in covid-19 patients alarm doctors - News Track English", "description": "New York: A new news related to the corona virus has shocked doctors. This virus is now clotting the blood of the body of the infected. Nephrologists at Mount Sinai Hospital in New York, New York, USA have found that blood is also accumulating in the kidneys …", "url": "https://english.newstracklive.com/news/blood-blockage-in-body-of-corona-patients-says-doctors-mc24-nu764-ta272-1087286-1.html", "urlToImage": null, "publishedAt": "2020-04-24T11:31:04Z", "content": null}, {"source": {"id": null, "name": "Edexlive.com"}, "author": "Edex Live", "title": "Dietary supplements important weapon for fighting off COVID-19, say researchers - EdexLive", "description": "In particular vitamin C, vitamin D, zinc, and an omega-3 fatty acid found in fish, docosahexaenoic acid, also known as DHA, are critical for immune function", "url": "https://www.edexlive.com/news/2020/apr/24/dietary-supplements-important-weapon-for-fighting-off-covid-19-say-researchers-11557.html", "urlToImage": null, "publishedAt": "2020-04-24T11:08:04Z", "content": "Supplements containing vitamins C and D and other micronutrients are a safe, effective and low-cost means of helping your immune system fight off COVID-19 and other acute respiratory tract diseases, say researchers.\r\nAccording to the study, published in the j… [+2042 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Mumbai Mirror", "title": "COVID-19: India may see second wave of outbreak in monsoon, say scientists - Mumbai Mirror", "description": "A study published in The Lancet journal earlier this month modelled the potential adverse consequences of premature relaxation of interventions, and found it might lead to a second wave of infections", "url": "https://mumbaimirror.indiatimes.com/coronavirus/news/covid-19-india-may-see-second-wave-of-outbreak-in-monsoon-say-scientists/articleshow/75347333.cms", "urlToImage": null, "publishedAt": "2020-04-24T09:37:00Z", "content": "The trajectory of COVID-19\r\n cases could have plateaued and might even fall for some weeks after the lockdown\r\n is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say scientists\r\n.… [+6693 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Covid causing blood clots in patients: Docs - Times of India", "description": "The number of COVID-19 cases crossed the 2.5 million mark recently, as researchers rush to make new findings and se", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/covid-causing-blood-clots-in-patients-docs/articleshow/75342355.cms", "urlToImage": null, "publishedAt": "2020-04-24T09:36:07Z", "content": null}, {"source": {"id": null, "name": "Selectscience.net"}, "author": "SelectScience", "title": "Pfizer, BioNTech COVID-19 vaccine cleared for human tests - SelectScience", "description": "Pfizer and BioNTech to start human trials of COVID-19 vaccine", "url": "https://www.selectscience.net/industry-news/pfizer-and-biontech-to-start-human-trials-of-covid-19-vaccine/?artID=51330", "urlToImage": null, "publishedAt": "2020-04-24T09:09:30Z", "content": null}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "PTI", "title": "COVID-19: Medico designs face shield from overhead projector sheets - The New Indian Express", "description": "After testing the in-house produced shields for factors like comfort and clarity among others, the prototype was approved and 1,000 units were made.", "url": "https://www.newindianexpress.com/nation/2020/apr/24/covid-19-medico-designs-face-shield-from-overhead-projector-sheets-2134683.html", "urlToImage": null, "publishedAt": "2020-04-24T08:47:00Z", "content": "MUMBAI: When the coronavirus pandemic hit Mumbai and medical workers appeared clueless how to treat patients by ensuring their own safety, an enterprising female medical practitioner found a solution by designing a face shield made out of overhead projector s… [+3337 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "IANS", "title": "Novel Coronavirus Has Natural Origin; Not Constructed in Laboratory: WHO - The Weather Channel", "description": "The virus has an ecological origin in bat populations, but the intermediate animal host has not been identified yet, says the WHO.", "url": "https://weather.com/en-IN/india/coronavirus/news/2020-04-24-novel-coronavirus-natural-animal-origin-constructed-laboratory", "urlToImage": null, "publishedAt": "2020-04-24T07:57:07Z", "content": "All available evidence to date suggests that the novel coronavirus has a natural animal origin, and was not a manipulated or constructed virus, the World Health Organization (WHO) said.\r\n\"Many researchers have been able to look at the genomic features of SARS… [+1093 chars]"}, {"source": {"id": null, "name": "Ianslive.in"}, "author": "IANSLive", "title": "79% COVID-19 cases in Pak caused by local transmission - IANS", "description": "As the nature of the infection has undergone this change, the government has decided to introduce track and trace system under which random testing of people will start in a few days, reports Dawn news.Duri", "url": "http://www.ianslive.in/index.php?param=news/79%25_COVID_19_cases_in_Pak_caused_by_local_transmission-671054/INTERNATIONAL/13", "urlToImage": null, "publishedAt": "2020-04-24T05:42:55Z", "content": null}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Maharashtra: Man beaten on suspicion of being COVID-19 patient, dies - Telangana Today", "description": "Thane: A 34-year-old man was allegedly attacked on suspicion of being a COVID-19 patient and died after falling into a gutter during the assault in Kalyan town of Maharashtra's Thane district, police said on Friday. The incident took place on Wednesday mornin…", "url": "https://telanganatoday.com/maharashtra-man-beaten-on-suspicion-of-being-covid-19-patient-dies", "urlToImage": null, "publishedAt": "2020-04-24T04:34:00Z", "content": "Thane: A 34-year-old man was allegedly attacked on suspicion of being a COVID-19 patient and died after falling into a gutter during the assault in Kalyan town of Maharashtra’s Thane district, police said on Friday.\r\nThe incident took place on Wednesday morni… [+587 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "COVID: Max hospital group to study use of HCQ among healthcare workers - Livemint", "description": "The large-scale observational study will involve use of hydroxychloroquine prophylaxis among its healthcare workers.This is the first study involving COVID-19 that has been approved by ICMR", "url": "https://www.livemint.com/news/india/covid-max-hospital-group-to-study-use-of-hcq-among-healthcare-workers-11587698913597.html", "urlToImage": null, "publishedAt": "2020-04-24T03:56:25Z", "content": "NEW DELHI :\r\nAmid rising number of coronavirus cases in the country, a private hospital group on Thursday announced that it will conduct a large-scale observational study involving the use of hydroxychloroquine (HCQ) prophylaxis among its healthcare workers, … [+2088 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Doctors urging people to seek medical attention despite fears of COVID-19 - WWLP-22News", "description": "As COVID-19 takes over much of the health care system, individuals who aren’t infected are staying clear of health care facilities, even if they should be se...", "url": "https://www.youtube.com/watch?v=--Ce3t1JWhg", "urlToImage": null, "publishedAt": "2020-04-24T02:36:16Z", "content": "As COVID-19 takes over much of the health care system, individuals who arent infected are staying clear of health care facilities, even if they should be seeking medical treatment."}, {"source": {"id": null, "name": "Dailyherald.com"}, "author": "Dave Oberhelman", "title": "'COVID toes' reported in some patients with the coronavirus - Chicago Daily Herald", "description": "Laying waste to lives and livelihoods, dividing people in regard to \"opening up\" states and economies, the coronavirus again looks to kick us when we're down. With COVID toes.", "url": "https://www.dailyherald.com/news/20200423/covid-toes-reported-in-some-patients-with-the-coronavirus", "urlToImage": null, "publishedAt": "2020-04-23T23:41:15Z", "content": "Just great.\r\nLaying waste to lives and livelihoods, dividing people in regard to \"opening up\" states and economies, the coronavirus again looks to kick us when we're down.\r\nWith COVID toes.\r\nYes, COVID toes, a term given to discolored toes reported in some pa… [+3192 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "CDC Director Clarifies Coronavirus Comments - HuffPost", "description": "President Donald Trump said Dr. Robert Redfield was misquoted about the coronavirus resurging in the fall, but the CDC director said his interview with The W...", "url": "https://www.youtube.com/watch?v=XhPtzNbO8iI", "urlToImage": null, "publishedAt": "2020-04-23T21:33:39Z", "content": "President Donald Trump said Dr. Robert Redfield was misquoted about the coronavirus resurging in the fall, but the CDC director said his interview with The Washington Post was accurate. \r\nSubscribe to HuffPost today: http://goo.gl/xW6HGSupport our work: https… [+134 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "Most NYC Virus Patients Had Underlying Health Issues, Study Shows - The Epoch Times", "description": "Most patients in New York City hospitalized with the CCP virus suffered from at least one underlying health issue, such as obesity or kidney disease.", "url": "https://www.theepochtimes.com/most-new-york-virus-patients-had-underlying-health-issue-study_3324097.html", "urlToImage": null, "publishedAt": "2020-04-23T21:17:16Z", "content": "Most patients in New York City hospitalized with the CCP virus suffered from one or more underlying health issues, such as obesity or kidney disease, according to a new study.\r\nResearchers analyzed records from 5,700 patients and found more than 56 percent su… [+3603 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "According to Researches, Filter Coffee Extends Life, Turkish Coffee Is Harmful To The Heart - Somag News", "description": "In a study conducted by the Swedish University of Gothenburg, it is stated that filter coffee is beneficial to health and can prolong life, but coffee boiled like Turkish coffee increases the risk of heart disease. The results of the research, published in th…", "url": "https://www.somagnews.com/according-researches-filter-coffee-extends-life-turkish-coffee-harmful-heart/", "urlToImage": null, "publishedAt": "2020-04-23T18:26:00Z", "content": "In a study conducted by the Swedish University of Gothenburg, it is stated that filter coffee is beneficial to health and can prolong life, but coffee boiled like Turkish coffee increases the risk of heart disease.\r\nThe results of the research, published in t… [+1203 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Nikhil Ghanekar", "title": "Favipiravir, Antiviral Used Against Covid-19 in China and Japan, Ready to be Developed in India: CSIR - News18", "description": "CSIR DG, Dr Shekhar C Mande, said the synthesis process of Favipiravir has been completed and the Drug Controller General of India will now take a call on introducing it for testing as Covid-19 treatment.", "url": "https://www.news18.com/news/india/favipiravir-antiviral-used-against-covid-19-in-china-and-japan-ready-to-be-developed-in-india-csir-2589857.html", "urlToImage": null, "publishedAt": "2020-04-23T18:15:00Z", "content": "New Delhi: The end-to-end synthesis of Favipiravir, an anti-retroviral drug that has shown promise against Covid-19, has been completed, the Council of Scientific and Industrial Research (CSIR), said on Thursday. \r\nIn a conversation with News18.com, Dr Shekha… [+5867 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Blood Clots a New Surprise Side Effect in Coronavirus Patients | NBC10 Philadelphia - NBC10 Philadelphia", "description": "Doctors are noticing a new trend in COVID-19 patients in the form of blood clots. NBC10’s Matt DeLucia spoke with two local doctors about what they’re seeing...", "url": "https://www.youtube.com/watch?v=t2Bu8mqxwrg", "urlToImage": null, "publishedAt": "2020-04-23T17:56:50Z", "content": "Doctors are noticing a new trend in COVID-19 patients in the form of blood clots. NBC10s Matt DeLucia spoke with two local doctors about what theyre seeing at hospitals. \r\n_____\r\nSUBSCRIBE TO NBC10: VISIT the NBC10 channel for the latest news and exclusive re… [+437 chars]"}, {"source": {"id": null, "name": "Menshealth.com"}, "author": "Philip Ellis", "title": "Doctors Warn COVID-19 Can Cause Sudden Strokes in People Under 50 - menshealth.com", "description": "Coronavirus has been linked to blood clots in age groups previously not deemed at risk.", "url": "https://www.menshealth.com/health/a32253678/coronavirus-covid-19-sudden-stroke-young-patients/", "urlToImage": null, "publishedAt": "2020-04-23T16:34:00Z", "content": "Medics in New York City have reported that people in their 30s and 40s who were previously not deemed at-risk during the coronavirus pandemic may in fact be vulnerable to sudden strokes. COVID-19 has recently been thought to cause increased blood clotting, wh… [+1675 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Gemma Mullin", "title": "Coronavirus causes blood clots and sudden strokes in young, healthy patients, doctors warn - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11462002/coronavirus-blood-clots-sudden-strokes-young-healthy-patients/", "urlToImage": null, "publishedAt": "2020-04-23T14:12:43Z", "content": "CORONAVIRUS can cause blood clots and sudden strokes in young, healthy patients, doctors have warned.\r\nMedics in New York say they have seen a sevenfold increase in stroke cases in people in their 30s and 40s who either had mild or no Covid-19 symptoms at all… [+5568 chars]"}, {"source": {"id": null, "name": "Theguardian.comglobal-development"}, "author": "Kaamil Ahmed", "title": "Pandemic could 'turn back the clock' 20 years on malaria deaths, warns WHO - The Guardian", "description": "Deaths in sub-Saharan African countries could double to more than 700,000 this year if Covid-19 crisis disrupts programmes", "url": "https://amp.theguardian.comglobal-development/2020/apr/23/pandemic-could-turn-back-the-clock-20-years-on-malaria-deaths-warns-who", "urlToImage": null, "publishedAt": "2020-04-23T13:36:46Z", "content": "Deaths from malaria could double across sub-Saharan Africa this year if work to prevent the disease is disrupted by Covid-19, the World Health Organization has warned.\r\nThe UNs global health agency said that if countries failed to maintain delivery of insecti… [+2702 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "92-year-old woman with one side of body paralysed defeats coronavirus in Pune - Times of India", "description": "PUNE: A 92-year-old Pune resident has recovered from coronavirus infection despite having suffered a stroke seven months ago which left one side of he.", "url": "https://timesofindia.indiatimes.com/city/pune/92-year-old-woman-with-one-side-of-body-paralysed-defeats-coronavirus-in-pune/articleshow/75323751.cms", "urlToImage": null, "publishedAt": "2020-04-23T13:28:43Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "WHO warns malaria deaths could double during COVID-19 pandemic - CNA", "description": "GENEVA: The new coronavirus pandemic could severely disrupt access to anti-malaria nets and drugs in sub-Saharan Africa, the World Health Organization said on Thursday (Apr 23), warning that malaria deaths risked doubling if efforts are not urgently scaled up.", "url": "https://www.channelnewsasia.com/news/world/who-warns-malaria-deaths-double-during-covid-19-12671240", "urlToImage": null, "publishedAt": "2020-04-23T13:17:23Z", "content": "GENEVA: The new coronavirus pandemic could severely disrupt access to anti-malaria nets and drugs in sub-Saharan Africa, the World Health Organization said on Thursday (Apr 23), warning that malaria deaths risked doubling if efforts are not urgently scaled up… [+2880 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "John Bowden", "title": "Large majority of coronavirus patients on ventilators in major NY health system died, researchers say | TheHill - The Hill", "description": "More than 85 percent of those placed on ventilators in New York's largest hospital system du...", "url": "https://thehill.com/homenews/state-watch/494260-almost-all-covid-19-patients-on-ventilators-in-new-york-health-system", "urlToImage": null, "publishedAt": "2020-04-23T12:26:26Z", "content": "More than 85 percent of those placed on ventilators in New York's largest hospital system due to coronavirus symptoms later died from the disease, a study has found.\r\nCNN reported Thursday that a study from researchers at the Feinstein Institutes for Medical … [+1292 chars]"}, {"source": {"id": null, "name": "Theweekendleader.com"}, "author": null, "title": "Most COVID-19 patients put on ventilators in NY died Study - The Weekend Leader", "description": "Researchers have found that nearly all coronavirus (COVID-19) hospitalised patients placed on mechanical ventilators in New York's largest health system have died.\r\n\r\nFor the findings, published in the Journal of the American Medical Association, the research…", "url": "http://www.theweekendleader.com/Headlines/56986/most-covid-19-patients-put-on-ventilators-in-ny-died:-study.html", "urlToImage": null, "publishedAt": "2020-04-23T11:27:49Z", "content": "Most COVID-19 patients put on ventilators in NY died: Study \r\n25-Apr-2020New York \r\n Posted\r\n 23 Apr 2020 \r\n Researchers have found that nearly all coronavirus (COVID-19) hospitalised patients placed on mechanical ventilators in New York's largest health syst… [+1812 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Times Now Digital", "title": "‘We don't have what it takes; this will blow out of control’: Pakistani doctors issue coronavirus SOS - Times Now", "description": "The doctors rued the fact that some in Pakistan were unfortunately treating the virus outbreak as a non-serious issue.", "url": "https://www.timesnownews.com/international/article/we-dont-have-what-it-takes-this-will-blow-out-of-control-pakistani-doctors-issue-coronavirus-sos/581967", "urlToImage": null, "publishedAt": "2020-04-23T10:41:22Z", "content": "Karachi: Amid the worsening coronavirus situation in Pakistan, a group of doctors have issued an SOS and suggested the country is in a precarious situation as far as preparedness to tackle the COVID-19 pandemic was concerned.\r\nThe SOS was issued by a group of… [+3010 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nJordan Kelly-Linden", "title": "University of Oxford Covid-19 vaccine: everything we know so far - Telegraph.co.uk", "description": "A million doses of their experimental coronavirus vaccine could be ready as early as September, Oxford scientists say", "url": "https://www.telegraph.co.uk/global-health/science-and-disease/oxford-university-coronavirus-vaccine-covid/", "urlToImage": null, "publishedAt": "2020-04-23T10:27:00Z", "content": "A potential coronavirus vaccine being developed at the University of Oxford will be trialled on people from Thursday, Matt Hancock revealed at Tuesday's Government briefing.\r\nThe vaccine project, which is being run by the Jenner Institute and Oxford Vaccine G… [+2389 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Saswati Sarkar", "title": "COVID-19 alert for men: Your testicles may up your death risk from the infection - TheHealthSite", "description": "New study reveals that high volume of a protein called ACE2 receptor in testes makes the COVID-19 infection last longer in men increasing the severity of the condition in them.", "url": "https://www.thehealthsite.com/news/testicles-and-other-factors-for-mens-covid-19-death-risk-741226/", "urlToImage": null, "publishedAt": "2020-04-23T09:45:14Z", "content": "Estimates from the Ministry of Health and Family Welfare suggest that three-fourth of COVID patients in India are men. According to the ministry estimates, males account for 76 per cent of the COVID-19 cases in India, while their death rate is even higher: 76… [+4889 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ariana Eunjung Cha", "title": "Coronavirus: 88% of Covid-19 patients on ventilators didn’t survive in New York’s hospital system, study finds - The Independent", "description": "This compares with the roughly 80 per cent of patients who died on ventilators before the pandemic, according to previous studies", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-us-new-york-hospital-ventilator-death-rate-latest-a9479411.html", "urlToImage": null, "publishedAt": "2020-04-23T09:20:00Z", "content": "Throughout March, as the pandemic gained momentum in the United States, much of the preparations focused on the breathing machines that were supposed to save everyones lives.\r\nNew York State Gov. Andrew Cuomo and President Donald Trump sparred over how many v… [+3229 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Maeve Campbell", "title": "How can you boost your immune system during the COVID-19 pandemic? - Euronews", "description": "Consultant Dietitian and Nutritionist Paula Mee tells us which foods to stock up on and which to avoid.", "url": "https://www.euronews.com/living/2020/04/23/how-can-you-boost-your-immune-system-during-the-covid-19-pandemic", "urlToImage": null, "publishedAt": "2020-04-23T07:42:39Z", "content": "Our immune systems do a remarkable job at fighting off foreign cells to protect us against illness. Varying factors are at play, such as age, which determine how resilient this defence system will be. Naturally, when a global health pandemic strikes, we’re bo… [+7093 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Aishwarya Dharni", "title": "Doctors Terrified Of Blood Clotting And Thickening Causing Strokes In Coronavirus Patients - India Times", "description": "According to a report by Reuters, doctors at Mount Sinai Hospital in New York City have noticed a brand new thing that takes place in a COVID-19 positive patient's body. As the novel coronavirus spread through New York City in late March, doctors at Mount Sin…", "url": "https://www.indiatimes.com/trending/wtf/doctors-terrified-of-blood-clotting-and-thickening-causing-strokes-in-coronavirus-patients-511563.html", "urlToImage": null, "publishedAt": "2020-04-23T06:50:20Z", "content": "New things about COVID-19 are coming to light each day it seems, and living in a world affected by it, scientists and researchers are only too keen to learn all that they can about it. \r\nAccording to a report byReuters, doctors at Mount Sinai Hospital in New … [+2318 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "A herd immunity strategy could actually work in youthful India - Economic Times", "description": "The herd strategy would allow a majority of the population to gain resistance to coronavirus.", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/a-herd-immunity-strategy-could-actually-work-in-youthful-india/articleshow/75285241.cms", "urlToImage": null, "publishedAt": "2020-04-23T04:07:00Z", "content": "By Ari AltstedterControversial given the high risk of deaths, a coronavirus strategy discarded by the U.K. is being touted as the solution for poor but young countries like India.\r\nThe herd immunity strategy, which would allow a majority of the population to … [+6875 chars]"}]}