{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus pandemic | Data from COVID-19 vaccine's phase-1 trials to be out in a month: AstraZeneca - Moneycontrol", "description": "Pharmaceutical and biopharmaceutical company AstraZeneca is expected to start working manufacturing capabilities once the late stage of the COVID-19 vaccine's trials begin.", "url": "https://www.moneycontrol.com/news/trends/health-trends/coronavirus-pandemic-data-from-covid-19-vaccines-phase-1-trials-to-be-out-in-a-month-astrazeneca-5264261.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/10/ebola-e1545189642153-770x433.jpg", "publishedAt": "2020-05-14T08:38:12Z", "content": "AstraZeneca, which is partnering with the University of Oxford to develop a potential COVID-19 vaccine, has said that the data from phase-I trials will be available in a month, according to a report by Business Standard.\r\nThe company has also said that late-s… [+1743 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Study shows reprogrammed cells helped treat Parkinson's patient - Reuters", "description": "A single-patient study on a man with Parkinson's disease may have pointed to a new kind of therapy treatment for the millions afflicted with the neurodegener...", "url": "https://www.youtube.com/watch?v=kywI6z4Jn7A", "urlToImage": "https://i.ytimg.com/vi/kywI6z4Jn7A/maxresdefault.jpg", "publishedAt": "2020-05-14T08:35:45Z", "content": "A single-patient study on a man with Parkinson's disease may have pointed to a new kind of therapy treatment for the millions afflicted with the neurodegenerative disease, researchers said. \r\nSubscribe: http://smarturl.it/reuterssubscribe\r\nReuters brings you … [+364 chars]"}, {"source": {"id": null, "name": "Cnbctv18.com"}, "author": null, "title": "Coronavirus can spread even by talking, finds new study - CNBCTV18", "description": "As per the study, microdroplets generated can remain suspended in the air in an enclosed space for more than ten minutes.Get latest Healthcare online at cnbctv18.com", "url": "https://www.cnbctv18.com/healthcare/coronavirus-can-spread-even-by-talking-finds-new-study-5919871.htm/", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2020/05/migrant_screening2-768x512.jpg", "publishedAt": "2020-05-14T08:03:20Z", "content": "Microdroplets generated by speech can lead to the spread of coronavirus, a study published in the journal, Proceedings of the National Academy of Sciences of the United States of America (PNAS), showed. As per the study, microdroplets can remain suspended in … [+1203 chars]"}, {"source": {"id": null, "name": "Wionews.com"}, "author": "WION Web Team", "title": "Japanese experiment shows how quickly one person can spread coronavirus - WION", "description": "A substance was used to signify the germsinfection. When the participants were subjected to black light, the substance could be seen on food, serving utensils and platters, and even on the faces of some of them.", "url": "https://www.wionews.com/world/japanese-experiment-shows-how-quickly-one-person-can-spread-coronavirus-298584", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/04/29/138595-covid-test-afp.jpg", "publishedAt": "2020-05-14T08:00:52Z", "content": "In an experiment conducted in japan, it has been proved that even one person can easily spread germs if he/she is infected.\r\nThe experiment was conducted by the public broadcasting organization NHK and health experts. It was setup similar to a buffet restaura… [+1406 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Cats can spread COVID-19 to other cats without them exhibiting symptoms, an experiment found - Firstpost", "description": "Just because an animal can be deliberately infected in a lab doesn't mean that it will be easily infected under natural conditions.", "url": "https://www.firstpost.com/health/cats-can-spread-covid-19-to-other-cats-without-them-exhibiting-symptoms-an-experiment-found-8367251.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/05/iz-phil-pdALzg0yN-8-unsplash-1.jpg", "publishedAt": "2020-05-14T07:57:55Z", "content": null}, {"source": {"id": null, "name": "Arabnews.com"}, "author": "AFP", "title": "WHO warns coronavirus may be here to stay as toll nears 300000 - Arabnews", "description": "GENEVA: The coronavirus may never go away and populations will have to learn to live with it just as they have HIV, the World Health Organization has warned, as the global death toll from the disease nears 300,000. There were also gloomy forecasts from the US…", "url": "https://www.arabnews.com/node/1674506", "urlToImage": "https://www.arabnews.com/sites/default/files/2020/05/14/2104961-58072082.jpg", "publishedAt": "2020-05-14T07:53:26Z", "content": "GENEVA: The coronavirus may never go away and populations will have to learn to live with it just as they have HIV, the World Health Organization has warned, as the global death toll from the disease nears 300,000.There were also gloomy forecasts from the US … [+3336 chars]"}, {"source": {"id": null, "name": "Who.int"}, "author": "World Health Organization: WHO", "title": "Substantial investment needed to avert mental health crisis - World Health Organization", "description": "<div><p>The COVID-19 pandemic is highlighting the need to urgently increase investment in services for mental health or risk a massive increase in mental health conditions in the coming months, according to a policy brief on COVID-19 and mental health issued …", "url": "https://www.who.int/news-room/detail/14-05-2020-substantial-investment-needed-to-avert-mental-health-crisis", "urlToImage": null, "publishedAt": "2020-05-14T07:34:37Z", "content": "The COVID-19 pandemic is highlighting the need to urgently increase investment in services for mental health or risk a massive increase in mental health conditions in the coming months, according to a policy brief on COVID-19 and mental health issued by the U… [+5104 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "5 things you should never do while consuming Apple Cider Vinegar (ACV) - Times of India", "description": "Benefits of Apple Cider Vinegar are many but those wanting to consume it should know that consuming it the wrong wa", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/5-things-you-should-never-do-while-consuming-apple-cider-vinegar-acv/articleshow/75719523.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75719523,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-1327889/75719523.jpg", "publishedAt": "2020-05-14T07:23:58Z", "content": "Benefits of Apple Cider Vinegar are many but those wanting to consume it should know that consuming it the wrong way can prove to be unhealthy and dangerous. Here are five things that you should never do while consuming ACV:\r\nDrink it right after eatingIf you… [+1632 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Masks against coronavirus present 'brutal' challenge for hearing impaired - FRANCE 24 English", "description": "Amid the global Covid-19 pandemic, face masks have been deemed a useful tool in the fight against the spread of the virus. As France begins to ease its lockd...", "url": "https://www.youtube.com/watch?v=iMlIjp3kXUk", "urlToImage": "https://i.ytimg.com/vi/iMlIjp3kXUk/hqdefault.jpg", "publishedAt": "2020-05-14T07:17:12Z", "content": "Amid the global Covid-19 pandemic, face masks have been deemed a useful tool in the fight against the spread of the virus. As France begins to ease its lockdown, the facial coverings are now compulsory in order to use public transportation and many shops requ… [+409 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Turkey's contact tracers piece together infection puzzle - TRT World", "description": "Turkey’s rate of Covid-19 infections is continuing to slow. And the government credits part of that success to the work of the country’s contact tracers. The...", "url": "https://www.youtube.com/watch?v=4smOKEBmVnk", "urlToImage": "https://i.ytimg.com/vi/4smOKEBmVnk/hqdefault.jpg", "publishedAt": "2020-05-14T07:15:46Z", "content": "Turkeys rate of Covid-19 infections is continuing to slow. And the government credits part of that success to the work of the countrys contact tracers. Theyre teams of medics who interview every new coronavirus patient - to try and determine how they contract… [+414 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "Why older people are vulnerable to Covid-19 decoded - Livemint", "description": "Researchers said microRNAs play a major role in controlling the activity of genes in the body.However, with age and some chronic medical conditions, the attacking microRNA numbers dwindle, reducing our ability to respond to viruses", "url": "https://www.livemint.com/science/news/why-older-people-are-vulnerable-to-covid-19-decoded-11589437945184.html", "urlToImage": "https://images.livemint.com/img/2020/05/14/600x338/1223054178_1589080871954_1589438405218.jpg", "publishedAt": "2020-05-14T06:42:34Z", "content": "Washington: A group of tiny molecules that attack invading viruses is diminished with age and chronic illnesses, according to a study which says this decrease may explain why older individuals are vulnerable to COVID-19.Researchers, including those from the U… [+3794 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Some of WHO's Coronavirus vaccines are showing positive data but they need more data to be 100 percent... - Firstpost", "description": "A malaria treatment championed by Donald Trump failed to show a benefit in patients hospitalised with COVID-19, a study found.", "url": "https://www.firstpost.com/health/some-of-whos-coronavirus-vaccines-are-showing-positive-data-but-they-need-more-data-to-be-100-percent-confident-8367111.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/05/file-20200504-83721-zvmbw2-1.jpg", "publishedAt": "2020-05-14T06:40:22Z", "content": null}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Anushree Gupta", "title": "Placentas of pregnant women with COVID-19 show signs of maternal vascular damage, linked with adverse outcomes - Times Now", "description": "The study has found that the placenta of pregnant women with COVID-19 shows signs of maternal vascular damage, which is linked with various adverse outcomes during pregnancy like stillbirth, premature birth.", "url": "https://www.timesnownews.com/health/article/placenta-of-pregnant-women-with-covid-19-shows-sings-of-maternal-vascular-damage-linked-with-adverse-outcomes/591706", "urlToImage": "https://imgk.timesnownews.com/story/iStock-1217104402_1.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-14T06:25:38Z", "content": "<ul><li>Pregnant women have been placed in the high-risk category for complications due to coronavirus infection</li><li>The elderly, people with existing health conditions, smokers are also in this category</li><li>A study has found that the placenta of preg… [+1566 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "R. Prasad", "title": "Nicotine may not prevent coronavirus infection, WHO cautions - The Hindu", "description": "A review of studies found that smokers are more likely to develop severe disease with COVID-19, compared to non-smokers, says a statement by the global health body", "url": "https://www.thehindu.com/sci-tech/health/nicotine-may-not-prevent-coronavirus-infection-who-cautions/article31579901.ece", "urlToImage": "https://www.thehindu.com/sci-tech/health/z3p2ax/article31579900.ece/ALTERNATES/LANDSCAPE_615/TH14WHO", "publishedAt": "2020-05-14T05:22:50Z", "content": "Urging researchers, scientists and the media to be cautious about amplifying unproven claims that tobacco or nicotine could reduce the risk of COVID-19, the World Health Organisation on May 11 issued a statement saying there is insufficient evidence to confir… [+3271 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service | Posted by: Prashasti Singh", "title": "Gastrointestinal symptoms could indicate Covid-19 infection in kids: Study - Hindustan Times", "description": "In this study, the research team detail the clinical features of children admitted to hospital with non-respiratory symptoms, which were subsequently diagnosed with pneumonia and Covid-19.", "url": "https://www.hindustantimes.com/world-news/gastrointestinal-symptoms-could-indicate-covid-19-infection-in-kids-study/story-AkkIQTp77R1nBtYyTogU2L.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/14/Pictures/_25521f26-9599-11ea-a968-2ed746e9a968.png", "publishedAt": "2020-05-14T04:52:39Z", "content": "Gastrointestinal symptoms such as diarrhoea, coupled with a fever or history of exposure to Covid-19, could indicate coronavirus infection in children, according to a new study.\r\nPublished in the journal Frontiers in Pediatrics, the research also suggests tha… [+2932 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Hard to predict when COVID-19 pandemic will be over: WHO - Telangana Today", "description": "Geneva: Officials of the World Health Organisation (WHO) have said that it was hard to predict when the global COVID-19 pandemic will be over, but countries should stay positive and collaborate closely in an effort to stem the virus from spreading any further…", "url": "https://telanganatoday.com/hard-to-predict-when-covid-19-pandemic-will-be-over-who", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2020/05/WHO_World-Health-Organization-1.jpg", "publishedAt": "2020-05-14T04:12:52Z", "content": "Geneva: Officials of the World Health Organisation (WHO) have said that it was hard to predict when the global COVID-19 pandemic will be over, but countries should stay positive and collaborate closely in an effort to stem the virus from spreading any further… [+2064 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Sugary drinks up heart disease risk in women by 20%: Study - Daijiworld.com", "description": "", "url": "https://www.daijiworld.com/news/newsDisplay.aspx?newsID=707987", "urlToImage": "http://www.tvdaijiworld.com/images6/asha_14520_sugarydrnks.jpg", "publishedAt": "2020-05-14T03:59:17Z", "content": "New York, May 14 (IANS): Women who drink one or more sugary beverages a day are more than 20 per cent more likely to be diagnosed with cardiovascular disease, warn researchers.\r\nCompared to women who never consume sugary drinks -- like soft drinks, sweetened … [+2069 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV News Desk", "title": "WHO says COVID-19 pandemic may turn into endemic, warns against lifting restrictions - India TV News", "description": "Coronavirus may be here to stay. World Health Organisation Executive Director Michael J Ryan has said that the novel coronavirus that has infected over 4.3 million people worldwide might turn from a pandemic to an endemic.", "url": "https://www.indiatvnews.com/news/world/coronavirus-pandemic-may-turn-into-endemic-lifting-restrictions-covid-19-warning-617007", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/05/maxresdefault-1589425776.jpg", "publishedAt": "2020-05-14T03:25:27Z", "content": "Image Source : FILEWHO says COVID-19 pandemic may turn into endemic, warns against lifting restrictions\r\nCoronavirus may be here to stay. World Health Organisation Executive Director Michael J Ryan has said that the novel coronavirus that has infected over 4.… [+1166 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Dr. Kamal Kant Kohli", "title": "Researchers develop new safe version of Amphetamine for weight loss - Medical Dialogues", "description": "Researchers have developed a new version of popular weight Loss drug Amphetamine which is not only...", "url": "https://medicaldialogues.in/medicine/news/researchers-develop-new-safe-version-of-amphetamine-for-weight-loss-65744", "urlToImage": "https://medicaldialogues.in/h-upload/2020/02/29/124924-weight-loss.jpg", "publishedAt": "2020-05-14T03:19:37Z", "content": "Researchers have developed a new version of popular weight Loss drug Amphetamine which is not only effective but is safe. The new research has been published in the journal Cell Metabolism.\r\nThe PEGylated amphetamine has following advantages-\r\n1.PEGylated amp… [+6439 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maggie Fox, CNN", "title": "Covid-19 infects intestines, kidneys and other organs, studies find - CNN", "description": "The new coronavirus can infect organs throughout the body, including lungs, throat, heart, liver, brain, kidneys and the intestines, researchers found.", "url": "https://www.cnn.com/2020/05/13/health/wellness-covid-attacks-organs-kidney/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200420164554-01-hospital-coronavirus-0414-super-tease.jpg", "publishedAt": "2020-05-14T03:03:54Z", "content": "(CNN)The new coronavirus can infect organs throughout the body, including lungs, throat, heart, liver, brain, kidneys and the intestines, researchers reported Wednesday.\r\nTwo separate reports suggest the virus goes far beyond the lungs and can attack various … [+2347 chars]"}, {"source": {"id": null, "name": "Researchmatters.in"}, "author": null, "title": "224 Years Of Modern Day Vaccine – The Journey Of Vaccinology - Research Matters", "description": "“As the world confronts the COVID-19 pandemic, humanity’s victory over smallpox is a reminder of what is possible when nations come together to fight a common health threat,” said Tedros Adhanom, Director-General of the World Health Organisation (WHO), in a r…", "url": "https://researchmatters.in/news/224-years-modern-day-vaccine-%E2%80%93-journey-vaccinology", "urlToImage": "https://researchmatters.in/sites/default/files/vaccinesday.jpg", "publishedAt": "2020-05-14T02:58:14Z", "content": "As the world confronts the COVID-19 pandemic, humanitys victory over smallpox is a reminder of what is possible when nations come together to fight a common health threat, said Tedros Adhanom, Director-General of the World Health Organisation (WHO), in a rece… [+5873 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Reuters| Posted by: Harshit Sabarwal", "title": "Swiss drugmaker in talks with UK govt to roll out Covid antibody test kits - Hindustan Times", "description": "Public Health England  (PHE), which conducted an independent evaluation of Roche’s antibody test last week, said it found Roche’s assay has a specificity of 100%.", "url": "https://www.hindustantimes.com/world-news/swiss-drugmaker-in-talks-with-uk-govt-to-roll-out-covid-antibody-test-kits/story-0mW7ok4FXxYLuJ3a6RxG9H.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/14/Pictures/university-recovered-washington-medicine-patients-antibodies-covid_cd095610-958c-11ea-a968-2ed746e9a968.jpg", "publishedAt": "2020-05-14T02:50:28Z", "content": "Swiss drugmaker Roche Holding AG said on Wednesday it was in talks with the UK government to roll out its coronavirus antibody test kits in the country after Public Health England (PHE) found them reliable.\r\nPHE, which conducted an independent evaluation of R… [+1652 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Explained Desk", "title": "Explained: Why it’s important to determine whether Covid-19 can spread through sewage - The Indian Express", "description": "Researchers have detected the coronavirus in the stool of both symptomatic and asymptomatic patients. This information has helped them identify the virus in untreated wastewater.", "url": "https://indianexpress.com/article/explained/coronavirus-transmission-through-sewage-wastewater-6408399/", "urlToImage": "https://images.indianexpress.com/2020/05/drain.jpg?w=759", "publishedAt": "2020-05-14T00:35:57Z", "content": "There is also no evidence yet to prove the virus can be transmitted through the faecal-oral route. (Source: Getty Images)Researchers in Australia are developing a technology to help track the transmission of the novel coronavirus through waterwater. The early… [+3447 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Sanchita Sharma", "title": "Covid poses risk to healthy Indian lives: WHO report - Hindustan Times", "description": "The average life expectancy in India is 68.8 years, with women living close to three years longer than men. Life expectancy is 70.3 years for women in India, and 67.4 years for men, said the 2020 World Health Statistics report.", "url": "https://www.hindustantimes.com/india-news/covid-poses-risk-to-healthy-indian-lives-who-report/story-DV5xFRaZQRsk7Fwlar8YuL.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/14/Pictures/virus-outbreak-india_3a41ae98-9548-11ea-9070-932bbf5d90a5.jpg", "publishedAt": "2020-05-14T00:24:50Z", "content": "Indians lose a decade of healthy life to non-communicable diseases like diabetes, cancers, and heart and lung diseases, and the threat to a healthy life will be compounded by of the coronavirus disease (Covid-19) pandemic, said the World Health Organization (… [+4022 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu Data Team", "title": "Data | Obesity linked to serious coronavirus illness even in younger patients, poor too are at high risk - The Hindu", "description": "Patients who were highly obese and were aged less than 60 years were 3.6 times more likely to be admitted to ICU than patients without obesity", "url": "https://www.thehindu.com/data/data-obesity-linked-to-serious-coronavirus-illness-even-in-younger-patients-poor-too-are-at-high-risk/article31578998.ece", "urlToImage": "https://www.thehindu.com/news/international/tw29kg/article31426301.ece/ALTERNATES/LANDSCAPE_615/SPAINKB", "publishedAt": "2020-05-13T22:27:03Z", "content": "Earlier studies from South Korea and China showed that the COVID-19 fatality rate increased significantly for older patients and those with pre-existing conditions. Recent studies from the U.S., the U.K. and France show that obesity is a risk factor, and that… [+3575 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "What is pulse oximeter and can it help in detecting Coronavirus infection? - Times of India", "description": "The reason being that it can measure the concentration of oxygen in the blood, which is believed to help in detecti", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/what-is-pulse-oximeter-and-can-it-help-in-detecting-coronavirus-infection/articleshow/75720966.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75720972,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-479146/75720972.jpg", "publishedAt": "2020-05-13T18:53:50Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "WHO Warns Coronavirus May Never Go Away, Become Another Endemic - News18", "description": "The world has a 'long, long way to go' to bring the coronavirus pandemic under control, despite tentative steps in many countries to begin restarting normal life, WHO's top emergencies expert warned.", "url": "https://www.news18.com/news/world/coronavirus-may-never-go-away-warns-who-slams-magical-thinking-that-lockdowns-work-perfectly-2619027.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/05/1588855059_2020-05-07t122149z_1_lynxmpeg460zu_rtroptp_4_health-coronvairus-syndrome-kids-1.jpg", "publishedAt": "2020-05-13T18:34:16Z", "content": "Mike Ryan, the head of the World Health Organization emergencies program, on Wednesday told reporters that the novel coronavirus may become \"another endemic virus in our communities. And this virus may never go away.\"\r\nThe world has a \"long, long way to go\" t… [+858 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Dale Smith", "title": "Coronavirus vaccine: When will it be ready? Everything we know so far - CNET", "description": "Scientists are racing to find a cure for the pandemic, and a new fast-tracking protocol could help speed up approval.", "url": "https://www.cnet.com/how-to/coronavirus-vaccine-when-will-it-be-ready-everything-we-know-so-far/", "urlToImage": "https://cnet3.cbsistatic.com/img/0IZ5MirMvXBtiDqEdSSrRimFIH8=/756x567/2020/05/13/1d434333-feb3-44ce-b91e-fbcb764f92da/gettyimages-1209302220.jpg", "publishedAt": "2020-05-13T17:03:42Z", "content": "Experts are hopeful that a vaccine against the SARS-CoV-2 virus will become available sooner rather than later.\r\nSOPA Images/Getty Images\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nAs the death toll f… [+8692 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Aria Bendix", "title": "Harvard and MIT researchers are developing a face mask that lights up when it detects the coronavirus - Business Insider India", "description": "For the last six years, bioengineers at MIT and Harvard have been developing sensors that can detect viruses like Zika and Ebola. They're adapting their technology", "url": "https://www.businessinsider.in/science/news/harvard-and-mit-researchers-are-developing-a-face-mask-that-lights-up-when-it-detects-the-coronavirus/articleshow/75723321.cms", "urlToImage": "https://www.businessinsider.in/photo/75723321/harvard-and-mit-researchers-are-developing-a-face-mask-that-lights-up-when-it-detects-the-coronavirus.jpg?imgsize=284262", "publishedAt": "2020-05-13T15:42:00Z", "content": "Pandemics were top of mind for Jim Collins years before the new coronavirus\r\n emerged.\r\nIn 2014, his bioengineering laboratory at MIT began developing sensors that could detect the Ebola virus when it was freeze-dried onto a piece of paper. The small team of … [+6273 chars]"}, {"source": {"id": null, "name": "Goachronicle.com"}, "author": "GC NewsDesk", "title": "WHO: People living longer and healthier lives but COVID-19 threatens to throw progress off track - Goa Chronicle", "description": "Geneva: All over the world, the COVID-19 pandemic is causing significant loss of life, disrupting livelihoods, and threatening the recent advances in health and progress towards global development goa", "url": "https://goachronicle.com/who-people-living-longer-and-healthier-lives-but-covid-19-threatens-to-throw-progress-off-track/", "urlToImage": "https://i0.wp.com/goachronicle.com/wp-content/uploads/2020/05/images.jpg?fit=300%2C168&ssl=1", "publishedAt": "2020-05-13T15:32:22Z", "content": "Geneva: All over the world, the COVID-19 pandemic is causing significant loss of life, disrupting livelihoods, and threatening the recent advances in health and progress towards global development goals highlighted in the 2020 World Health Statistics publishe… [+4817 chars]"}, {"source": {"id": null, "name": "Devdiscourse.com"}, "author": "Reuters", "title": "WHO sees \"potentially positive data\" in treating coronavirus - Devdiscourse", "description": "Read more about WHO sees \"potentially positive data\" in treating coronavirus on Devdiscourse", "url": "https://www.devdiscourse.com/article/health/1049367-who-sees-potentially-positive-data-in-treating-coronavirus", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/26_04_2020_22_13_04_6363459.jpg?width=920&format=jpeg", "publishedAt": "2020-05-13T14:36:43Z", "content": "The World Health Organization said on Tuesday that some treatments appear to be limiting the severity or length of the COVID-19 disease, referring to the results of early studies of four or five treatments.\r\nThe Geneva-based WHO is leading a global initiative… [+4044 chars]"}, {"source": {"id": null, "name": "Indiaspend.com"}, "author": "Govindraj Ethiraj", "title": "'COVID Will Set Back India's TB Programme By A Decade' | - IndiaSpend", "description": "", "url": "https://www.indiaspend.com/covid-will-set-back-indias-tb-programme-by-a-decade/", "urlToImage": "https://www.indiaspend.com/wp-content/uploads/2020/05/MahukarPaiInterview_1440.jpg", "publishedAt": "2020-05-13T14:29:00Z", "content": "Mumbai: India will be lucky if it ends tuberculosis by 2035--a decade later than targeted--says Madhukar Pai, Canada Research Chair in epidemiology and global health and director of the McGill International TB Centre in Montreal, Canada, pointing to an 80% dr… [+34492 chars]"}, {"source": {"id": null, "name": "Inventiva.co.in"}, "author": "inventiva", "title": "Is There A Link Between Coronavirus And Vitamin D Deficiency? This Startup Just Raised Cash To Find Out - Inventiva", "description": "Solius’ light therapy kiosks use a narrow spectrum of ultraviolet light that can stimulate the production of critical hormones and peptides, and increase vita", "url": "https://www.inventiva.co.in/stories/inventiva/is-there-a-link-between-coronavirus-and-vitamin-d-deficiency-this-startup-just-raised-cash-to-find-out/", "urlToImage": "https://www.inventiva.co.in/wp-content/uploads/2020/05/vitamin-d.jpg", "publishedAt": "2020-05-13T14:00:00Z", "content": "Solius light therapy kiosks use a narrow spectrum of ultraviolet light that can stimulate the production of critical hormones and peptides, and increase vitamin D levels. (Solius Photo)\r\nNew research shows a potential correlation between severe vitamin D defi… [+3879 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "The Hans India", "title": "COVID-19 vaccine may not be enough to end the pandemic. Heres why - The Hans India", "description": "About 70 per cent of the worlds population - or 5.6 billion people - will probably need to be...", "url": "https://www.thehansindia.com/news/international/covid-19-vaccine-may-not-be-enough-to-end-the-pandemic-heres-why-622310", "urlToImage": "https://assets.thehansindia.com/h-upload/2020/05/11/968414-coronavirus.jpg", "publishedAt": "2020-05-13T13:52:50Z", "content": "Washington D.C.: Medical experts have warned that the volume of vaccine available to fight the coronavirus or SARS-CoV-2 in coming years is expected to fall far short of global demand, despite an unprecedented effort to manufacture billions of doses. \r\nAbout … [+3725 chars]"}, {"source": {"id": null, "name": "Thequint.com"}, "author": "Ahmed Ali Fayyaz", "title": "How COVID-19 Spread Across 3 Super Specialty Hospitals in Kashmir - The Quint", "description": "In Sher-e-Kashmir Institute of Medical Sciences, Bone and Joint Hospital and the Super Specialty Hospital (SSH) at Shireen Bagh COVID-19 cases and screening are on the rise.", "url": "https://www.thequint.com/news/india/kashmir-super-speciality-hospital-coronavirus-covid-19", "urlToImage": "https://images.assettype.com/thequint/2020-05/7446a0a3-9655-4472-9b07-92e734d1cec4/Hero_Image__15_.jpg", "publishedAt": "2020-05-13T13:41:07Z", "content": null}, {"source": {"id": null, "name": "Hospimedica.com"}, "author": "HospiMedica International", "title": "New Artificial Intelligence Algorithm Accurately Predicts COVID-19 Without Testing - HospiMedica", "description": "Researchers have developed an artificial intelligence (AI) diagnostic that can predict whether someone is likely to have COVID-19 based on their symptoms.", "url": "https://www.hospimedica.com/covid-19/articles/294782353/new-artificial-intelligence-algorithm-accurately-predicts-covid-19-without-testing.html", "urlToImage": "https://www.hospimedica.com/images/stories/articles/article_images/2020-05-13/SDD-1307.jpg", "publishedAt": "2020-05-13T12:48:54Z", "content": "Researchers have developed an artificial intelligence (AI) diagnostic that can predict whether someone is likely to have COVID-19 based on their symptoms.The team of researchers at Kings College London (London, England), Massachusetts General Hospital (Boston… [+2963 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Doctors suggest having fruits could help keep coronavirus at bay - Economic Times", "description": "It is always better for Vegetarians or non-Vegetarians to have a lot of fresh fruit and vegetable .", "url": "https://economictimes.indiatimes.com/magazines/panache/doctors-suggest-having-fruits-could-help-keep-coronavirus-at-bay/articleshow/75714887.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75714944,width-1070,height-580,imgsize-322201,overlay-etpanache/photo.jpg", "publishedAt": "2020-05-13T12:45:57Z", "content": "BENGALURU: Are Vegans immune to COVID-19?\r\nThere is no proof at the moment, says prominent health expert and President of the Public Health Foundation of India, Professor K Srinath Reddy.\r\nEven Vegetarians have been affected because this is a virus which trav… [+3674 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Top U.S. Doctors Hope These Treatments Can Bridge The Gap To A Vaccine - Newsy", "description": "At least eight COVID-19 vaccines are in clinical development. Medical officials are hoping treatments could buy us time until one is available. Learn more ab...", "url": "https://www.youtube.com/watch?v=zDkZFtpi7Kw", "urlToImage": "https://i.ytimg.com/vi/zDkZFtpi7Kw/maxresdefault.jpg", "publishedAt": "2020-05-13T12:18:14Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus symptoms: The 7 lesser-known COVID-19 symptoms that everyone should be aware of - Times of India", "description": "Initially, lingering dry cough, fever, breathless and fatigue were believed to be the telltale symptoms of COVID-19, but as the disease continues to spread its fang across people of different age groups, newer symptoms are emerging. As we continue to learn mo…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-symptoms-the-7-lesser-known-covid-19-symptoms-that-everyone-should-be-aware-of/photostory/75717040.cms", "urlToImage": "https://static.toiimg.com/photo/75717371.cms", "publishedAt": "2020-05-13T11:41:49Z", "content": "While scientists and medical researchers are working at breakneck speed to develop avaccine for COVID-19, medical workers are still struggling to tabulate and an exhaustive list of novel coronavirus symptoms. As per the World Health Organization, most people … [+480 chars]"}, {"source": {"id": null, "name": "Bignewsnetwork.com"}, "author": null, "title": "Here's why finding a COVID-19 vaccine won't be enough - Malaysia Sun", "description": "Medical experts have warned that the volume of vaccine available to fight the coronavirus or SARS-CoV-2 in coming years is expected to fall far short of global", "url": "https://www.bignewsnetwork.com/news/265059094/here-why-finding-a-covid-19-vaccine-wont-be-enough", "urlToImage": "https://cdn.bignewsnetwork.com/ani1589370132.jpg", "publishedAt": "2020-05-13T11:37:00Z", "content": "Washington D.C. [USA], May 13 (ANI): Medical experts have warned that the volume of vaccine available to fight the coronavirus or SARS-CoV-2 in coming years is expected to fall far short of global demand, despite an unprecedented effort to manufacture billion… [+3730 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Disease control strategies impact evolution of spreading viruses: Study - Telangana Today", "description": "New York: Disease control strategies employed by governments can dramatically alter the evolution of pathogens like the novel coronavirus, according to a study which says such measures can change the extent of symptoms a spreading virus causes in infected ind…", "url": "https://telanganatoday.com/disease-control-strategies-impact-evolution-of-spreading-viruses-study", "urlToImage": "https://cdn.telanganatoday.com/im/Telangana-Today-News.jpg", "publishedAt": "2020-05-13T10:45:30Z", "content": "New York: Disease control strategies employed by governments can dramatically alter the evolution of pathogens like the novel coronavirus, according to a study which says such measures can change the extent of symptoms a spreading virus causes in infected ind… [+5124 chars]"}, {"source": {"id": null, "name": "Medicalxpress.com"}, "author": "Science X staff", "title": "Children with autism face higher risk of eating disorders - Medical Xpress", "description": "Previous research has found that autism and eating disorders can occur together, as 20-30% of adults with eating disorders have autism, and 3-10% of children and young people with eating disorders.", "url": "https://medicalxpress.com/news/2020-05-children-autism-higher-disorders.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/autism.jpg", "publishedAt": "2020-05-13T10:24:18Z", "content": "Previous research has found that autism and eating disorders can occur together, as 20-30% of adults with eating disorders have autism, and 3-10% of children and young people with eating disorders.\r\nHowever, it has not been clear whether autistic traits resul… [+4958 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "ANI", "title": "Microsoft grant for COVID-19 research to Shoolini Univ Scientists - Yahoo India News", "description": "Solan (Himachal Pradesh) [India], May 13 (ANI/PRNewswire): A team of scientists from Himachal Pradesh-based Shoolini University has been offered a grant through Microsoft Artificial Intelligence for Health Programme to conduct research on finding drugs to cur…", "url": "https://in.news.yahoo.com/microsoft-grant-covid-19-research-shoolini-univ-scientists-094709781.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-05-13T09:47:00Z", "content": "Solan (Himachal Pradesh) [India], May 13 (ANI/PRNewswire): A team of scientists from Himachal Pradesh-based Shoolini University has been offered a grant through Microsoft Artificial Intelligence for Health Programme to conduct research on finding drugs to cur… [+1775 chars]"}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "All about ACE-2 — the molecule that helps novel coronavirus invade cells - Down To Earth Magazine", "description": "SARS-CoV-2 has a high-binding capacity for ACE2 &mdash;&nbsp;between 10 and 20 times more that of original SARS virus", "url": "https://www.downtoearth.org.in/news/science-technology/all-about-ace-2-the-molecule-that-helps-novel-coronavirus-invade-cells-71089", "urlToImage": "https://cdn.downtoearth.org.in/library/large/2020-05-13/0.97121400_1589361207_sars.jpg", "publishedAt": "2020-05-13T09:43:02Z", "content": "SARS-CoV-2 has a high-binding capacity for ACE2 — between 10 and 20 times more that of original SARS virusThe more we learn about the science behind COVID-19, the more we are beginning to understand the vital role a single molecule in our bodies plays in how … [+5859 chars]"}, {"source": {"id": null, "name": "Newslanded.com"}, "author": null, "title": "Loss of smell and taste can be a probable symptom of COVID-19 - News Landed", "description": "A new study has drawn a link between COVID-19 and a change or loss of smell or taste by collecting data from a smartphone app.", "url": "https://newslanded.com/2020/05/13/loss-of-smell-and-taste-can-be-a-probable-symptom-of-covid-19/", "urlToImage": "https://newslanded.b-cdn.net/wp-content/uploads/2020/05/051120_TI_covid-smell_feat-1028x579-1.jpg", "publishedAt": "2020-05-13T08:20:24Z", "content": "A new study has drawn a link between COVID-19 and a change or loss of smell or taste by collecting data from a smartphone app. The reason for anosmia and dysgeusia is unclear as the virus is suspected of interfering with some nerve cells.\r\nRead Also: 2020: An… [+1956 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Passive immunisation may slow down COVID-19 infection: Study - Telangana Today", "description": "Dubai: Researchers have revealed that passive vaccine or passive immunisation (PI) can provide instant, short-term fortification against infectious agents and slow down coronavirus (COVID-19). Passive immunisation is the term used when an antibody formed in o…", "url": "https://telanganatoday.com/passive-immunisation-may-slow-down-covid-19-infection-study", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2020/05/COVID-19-Coronavirus-testing-3.jpg", "publishedAt": "2020-05-13T07:34:18Z", "content": "Dubai: Researchers have revealed that passive vaccine or passive immunisation (PI) can provide instant, short-term fortification against infectious agents and slow down coronavirus (COVID-19).\r\nPassive immunisation is the term used when an antibody formed in … [+2796 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "‘Deforestation, exploitation of wildlife leads to pandemics like Covid-19’: Epidemiologist - Hindustan Times", "description": "Because the world is more interconnected than ever through travel and trade, it is likely that we will see pandemics at an increasing rate, says Dr Pranav Pandit, a veterinary epidemiologist.", "url": "https://www.hindustantimes.com/india-news/deforestation-exploitation-of-wildlife-leads-to-pandemics-like-covid-19-epidemiologist/story-QNnOsXd2sqR3QOQ6UqxVFI.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/13/Pictures/_c778ecf2-94e6-11ea-84fe-62f09e00e282.jpg", "publishedAt": "2020-05-13T07:04:47Z", "content": "New research has confirmed that Sars-Cov-2 is very closely genetically related to coronaviruses from bat populations, and specifically rhinolophus bats, and pangolins may have been intermediate hosts in transmission to humans. \r\nSuch pandemics will become mor… [+3879 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Anushree Gupta", "title": "Coronavirus and children: When to seek immediate medical help? Here are the symptoms to watch out for - Times Now", "description": "Recent studies have shown that the coronavirus infection does not spare children and young people, as previously thought. Know about the symptoms of COVID-19 in children, and when they need urgent medical help.", "url": "https://www.timesnownews.com/health/article/coronavirus-and-children-when-to-seek-immediate-medical-help-here-are-the-symptoms-to-watch-out-for/591208", "urlToImage": "https://imgk.timesnownews.com/story/iStock-1210753709_2.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-13T06:54:54Z", "content": "<ul><li>Recent studies have shown that children, and young adults are at high risk of complications and death due to COVID-19</li><li>A mysterious illness has also been affecting children from all around the world, and has a link to COVID-19</li><li>Here is a… [+3273 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Lucy Quaggin", "title": "COVID-19 stricken Chinese doctor whose skin changed colour is now returning to normal - 7NEWS.com.au", "description": "The doctor and his colleague say they experienced the strange side effect while they were being treated for the disease.", "url": "https://7news.com.au/travel/coronavirus/covid-19-stricken-chinese-doctor-whose-skin-changed-colour-is-now-returning-to-normal-c-1034763", "urlToImage": "https://images.7news.com.au/publication/C-1034763/83547be42177b860a2fe262722b3d517185db060-16x9-x0y0w1304h734.png?imwidth=1024", "publishedAt": "2020-05-13T06:16:54Z", "content": "A doctor whose skin turned a dramatically darker shade while he was sick with COVID-19 has finally started to see his original colour return.\r\nDr Yi Fan contracted the virus while working at the Wuhan Central Hospital back in January.\r\nHe woke up from life su… [+1158 chars]"}, {"source": {"id": null, "name": "Eurekalert.org"}, "author": null, "title": "How COVID-19 kills - EurekAlert", "description": "Experts review how the SARS-Cov-2 virus can cause an immune overreaction in the form of potentially lethal cytokine storm.", "url": "https://eurekalert.org/pub_releases/2020-05/f-hck051120.php", "urlToImage": "https://www.eurekalert.org/images/EurekAlert_StackedLogo_RGB.jpg", "publishedAt": "2020-05-13T04:03:56Z", "content": "COVID-19, the disease caused by coronavirus SARS-Cov-2, has infected over 4 million people in 212 countries, of whom at least 272,000 have died. The ongoing economic and social impact of the pandemic is staggering, but despite a daily flood of news on the dis… [+5114 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "WHO sees 'potentially positive data' on coronavirus treatments - India Today", "description": "The World Health Organization said that some treatments appear to be limiting the severity or length of the Covid-19 disease .", "url": "https://www.indiatoday.in/world/story/who-coronavirus-treatments-1677373-2020-05-13", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/WHO_RTs-647x363.png?4afPivNIQqdJTYP0BvSik76TKUQF9NW7", "publishedAt": "2020-05-13T03:11:39Z", "content": "The World Health Organization said on Tuesday that some treatments appear to be limiting the severity or length of the Covid-19 disease and that it was focusing on learning more about four or five of the most promising ones.\r\nThe Geneva-based WHO is leading a… [+3268 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "ANI", "title": "Insufficient sleep can lead to more asthma attacks in adults, says study - Zee News", "description": "The study adds solid evidence to the practice of asthma patients discussing sleep issues with their allergist to help determine if they need to change their asthma plan to achieve adequate sleep as a component of overall good asthma management.", "url": "https://zeenews.india.com/insufficient-sleep-can-lead-to-more-asthma-attacks-in-adults-says-study-2283011.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2020/05/12/860445-asthma.jpg", "publishedAt": "2020-05-12T19:29:27Z", "content": "California: A good night`s sleep is crucial to good health and can also be necessary for Asthma patients, suggests a new study. A new article in Annals of Allergy, Asthma and Immunology, the scientific journal of the American College of Allergy, Asthma, and I… [+2696 chars]"}, {"source": {"id": null, "name": "Uk.com"}, "author": "News18", "title": "At Least 20,000 People Died Due to Coronavirus Outbreak in UK Care Homes, Says Study - CloudHub", "description": "The new total excludes hundreds of further deaths in Scotland and deaths that occurred since May 1. Other care home residents were transferred to hospital and died there. These are also not included in this figure.", "url": "http://ddlm.uk.com/news/world/at-least-20000-people-died-due-to-coronavirus-outbreak-in-uk-care-homes-says-study-2617385.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/05/1589305322_rtx7hzs0.jpg", "publishedAt": "2020-05-12T17:46:07Z", "content": "At least 20,000 people have died in care homes in England and Wales as a consequence of the coronavirus pandemic, according to Reuters calculations based on official data.\r\nIn the eight weeks to 1 May, 37,627 people died in care homes of all causes in England… [+1162 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Jenni Fink", "title": "Potential Coronavirus Treatments Are Promising But Can't 'Stop The Virus,' WHO Says - Newsweek", "description": "WHO's \"solidarity\" trial is testing four different potential treatments in more than 100 countries.", "url": "https://www.newsweek.com/potential-coronavirus-treatments-are-promising-cant-stop-virus-who-says-1503486", "urlToImage": "https://d.newsweek.com/en/full/1589280/coronavirus-treatments-improvements-who.jpg", "publishedAt": "2020-05-12T17:12:28Z", "content": "Early studies on treatments for a new coronavirus have shown promising signs but none of them are able to actually kill or stop the virus, according to the World Health Organization (WHO).\r\nWHO spokeswoman Margaret Harris told reporters during a Tuesday brief… [+2682 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Cong Asks PM to Take Action Against Gujarat Minister Chudasama, Expel Him From BJP - News18", "description": "Congress leader Kapil Sibal questioned the PM's silence on the issue and said if he was serious on ending corruption in the country he should take strict action against the minister from his home state.", "url": "https://www.news18.com/news/politics/cong-asks-pm-to-take-action-against-gujarat-minister-chudasama-expel-him-from-bjp-2617235.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/05/1589272306_bhupendrasinh-chudasama.jpg", "publishedAt": "2020-05-12T15:45:46Z", "content": "The Congress Tuesday asked Prime Minister Narendra Modi to expel Gujarat minister Bhupendrasinh Chudasama from the BJP after his 2017 election was declared void by the High Court on grounds of malpractice and manipulation.\r\nCongress leader Kapil Sibal questio… [+2884 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "All the Covid-19 symptoms you didn’t know about - Economic Times", "description": "Covid is now emerging as a pathogen capable of harming in a myriad of unexpected, and sometimes lethal, ways.", "url": "https://economictimes.indiatimes.com/news/science/all-the-covid-19-symptoms-you-didnt-know-about/articleshow/75688422.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75688496,width-1070,height-580,imgsize-97071,overlay-economictimes/photo.jpg", "publishedAt": "2020-05-12T15:41:00Z", "content": "By Jason Gale and Ari AltstedterAs the pandemic spreads around the world, doctors are beginning to scope the coronavirus’s damage. Seen initially as a cause of viral pneumonia during the chaos of an explosion of cases in China, it’s now emerging as an enigmat… [+4319 chars]"}, {"source": {"id": null, "name": "Kashmirobserver.net"}, "author": null, "title": "Children Face Greater Risk From COVID-19 Than Previously Thought: Study - Kashmir Observer", "description": "Children, teens, and young adults are at greater risk for severe complications from COVID-19 than previously thought, according to a study", "url": "https://kashmirobserver.net/2020/05/12/children-face-greater-risk-from-covid-19-than-previously-thought-study/", "urlToImage": "https://kashmirobserver.net/wp-content/uploads/2020/03/children-Coronavirus.jpg", "publishedAt": "2020-05-12T15:38:03Z", "content": "WhatsAppFacebook TwitterEmail9Shares\r\nNew York- Children, teens, and young adults are at greater risk for severe complications from COVID-19 than previously thought, according to a study which says those with underlying health conditions are at even greater r… [+3352 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "Explained: India’s new discharge policy for hospitalised COVID-19 patients - The News Minute", "description": "The Ministry of Health and Family Welfare (MoHFW) on Saturday released a revised policy on the discharge of patients hospitalised for COVID-19 infections. The revised guidelines state that only severe cases of COVID-19 will be tested before discharge, while m…", "url": "https://www.thenewsminute.com/article/explained-india-s-new-discharge-policy-hospitalised-covid-19-patients-124415", "urlToImage": "https://www.thenewsminute.com/sites/default/files/Chennai_PTI_Officials_Airport_0.jpg", "publishedAt": "2020-05-12T15:24:27Z", "content": "The revised guidelines state that only severe cases of COVID-19 will be tested before discharge, while mild and moderate cases need not be tested at the time of discharge.The Ministry of Health and Family Welfare (MoHFW) on Saturday released a revised policy … [+7525 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "PTI", "title": "Smoking, COPD linked with higher death risk from COVID-19: Study - Zee News", "description": "The researchers from the University College London in the UK noted that an estimated 251 million people worldwide are affected by COPD.", "url": "https://zeenews.india.com/india/smoking-copd-linked-with-higher-death-risk-from-covid-19-study-2282917.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2020/05/12/860363-smoking-pixabay.gif", "publishedAt": "2020-05-12T15:20:16Z", "content": "London: Being a current smoker or having chronic obstructive pulmonary disease (COPD) are associated with an increased risk of severe complications and higher death risk from COVID-19 infection, according to a study. COPD is a common, persistent dysfunction o… [+1797 chars]"}, {"source": {"id": null, "name": "Navhindtimes.in"}, "author": "nt", "title": "Coronavirus vaccine may never be found, warns UK PM - The Navhind Times", "description": "London: British Prime Minister Boris Johnson has warned that a mass vaccine for the novel coronavirus may be over a year away and, in the worst-case scenario, may in fact never be found. In his forewo", "url": "http://www.navhindtimes.in/coronavirus-vaccine-may-never-be-found-warns-uk-pm/", "urlToImage": null, "publishedAt": "2020-05-12T14:38:04Z", "content": "London: British Prime Minister Boris Johnson has warned that a mass vaccine for the novel coronavirus may be over a year away and, in the worst-case scenario, may in fact never be found.\r\nIn his foreword to the governments new 50-page guidance on a step by st… [+3589 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Novel test can detect antibodies to SARS-CoV-2 in human blood - Telangana Today", "description": "New York: A new blood test may help identify individuals whose plasma contains antibodies to SARS-CoV-2 virus that causes COVID-19, and could potentially be used to treat other patients, scientists said on Tuesday. Tests that detect the presence of SARS-CoV-2…", "url": "https://telanganatoday.com/novel-test-can-detect-antibodies-to-sars-cov-2-in-human-blood", "urlToImage": "https://cdn.telanganatoday.com/im/Telangana-Today-News.jpg", "publishedAt": "2020-05-12T14:27:48Z", "content": "New York: A new blood test may help identify individuals whose plasma contains antibodies to SARS-CoV-2 virus that causes COVID-19, and could potentially be used to treat other patients, scientists said on Tuesday.\r\nTests that detect the presence of SARS-CoV-… [+1937 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Food to keep your heart healthy - Daijiworld.com", "description": "", "url": "https://www.daijiworld.com/news/newsDisplay.aspx?newsID=707451", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2020-05-12T14:05:21Z", "content": "New Delhi, May 12 (IANSlife): It has been proven that eating certain kinds of food every day can reduce the risk of developing cardiovascular disease.\r\n\"Eating food in its natural form as whole foods and unprocessed food is good for your body. Naturally occur… [+1610 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Reuters| Posted by: Alfea Jamal", "title": "Coronavirus: WHO sees ‘potentially positive data’ on Covid-19 treatments - Hindustan Times", "description": "The Geneva-based WHO is leading a global initiative to develop safe and effective drugs, tests and vaccines to prevent, diagnose and treat COVID-19. The respiratory illness caused by the novel coronavirus has infected 4.19 million people around the world.", "url": "https://www.hindustantimes.com/more-lifestyle/coronavirus-who-sees-potentially-positive-data-on-covid-19-treatments/story-ciUZoNMpUZfyz4HBPNKcjI.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/12/Pictures/virus-outbreak-indonesia_52784ba6-9454-11ea-bea3-7211baa10040.jpg", "publishedAt": "2020-05-12T13:34:00Z", "content": "The World Health Organization said on Tuesday that some treatments appear to be limiting the severity or length of the COVID-19 disease and said it was focusing on learning more about four or five of the most promising ones.\r\nThe Geneva-based WHO is leading a… [+1251 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "PTI", "title": "Covid-19 vaccine may never be found, says Boris Johnson - ThePrint", "description": "United Kingdom's Prime Minister Johnson admitted that a vaccine or drug-based treatment is the only feasible long-term solution.", "url": "https://theprint.in/world/covid-19-vaccine-may-never-be-found-says-boris-johnson/419875/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2019/08/Boris-Johnson.jpg", "publishedAt": "2020-05-12T12:37:17Z", "content": "London: British Prime Minister Boris Johnson, a COVID-19 survivor, has warned that a mass vaccine for the highly contagious disease may be over a year away and may in fact never be found.\r\nIn his foreword to the government’s new 50-page guidance on a step by … [+4265 chars]"}, {"source": {"id": null, "name": "Docwirenews.com"}, "author": null, "title": "Hydroxychloroquine Does Not Improve Mortality in COVID-19 Patients in Study, Again - DocWire News", "description": "Another study has come out rejecting the notion that hydroxychloroquine is a useful drug to treat COVID-19, alone or in combination with azithromycin.", "url": "https://www.docwirenews.com/docwire-pick/rheumatology-picks/hydroxychloroquine-does-not-improve-mortality-in-covid-19-patients-in-study-again/", "urlToImage": "https://www.docwirenews.com/wp-content/uploads/2020/03/Homepage_3.13.20.jpg", "publishedAt": "2020-05-12T12:24:00Z", "content": "Hydroxychloroquine, a drug prescribed to treat rheumatoid arthritis and lupus, has been touted as a possible treatment for COVID-19, leading to an influx of studies on the subject as well as nationwide shortages of the drug. However, another study has come ou… [+3573 chars]"}, {"source": {"id": null, "name": "Latestly.com"}, "author": "PTI", "title": "New AI Tool to Predict COVID-19 Without Testing: Study - LatestLY", "description": "Researchers have developed an AI tool to predict whether someone is likely to have COVID-19 based on their symptoms alone, an advance which they say can help make better estimates of the disease spread in areas with limited testing.", "url": "https://www.latestly.com/agency-news/new-ai-tool-to-predict-covid-19-without-testing-study-1747534.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2018/04/Latestly-World.jpg", "publishedAt": "2020-05-12T12:09:00Z", "content": "London, May 12 (PTI) Researchers have developed an AI tool to predict whether someone is likely to have COVID-19 based on their symptoms alone, an advance which they say can help make better estimates of the disease spread in areas with limited testing.\r\n The… [+3505 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Aanchal Nigam", "title": "Study: Animals follow social distancing to prevent contraction of microbes - Republic World - Republic World", "description": "A new study by UTSA researchers has revealed that animals have long followed social distancing rules when it comes to microorganisms found in their gut.", "url": "https://www.republicworld.com/world-news/rest-of-the-world-news/study-animals-follow-social-distancing-to-prevent-contraction.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/foc6flkfmqaercpu_1589280326.jpeg?tr=f-jpeg", "publishedAt": "2020-05-12T11:08:18Z", "content": "Amid the unprecedented outbreak of deadly coronavirus, maintaining social distance has been one of the most touted methods to prevent the contraction of COVID-19 disease. While lockdowns have been imposed across the world, a new study has revealed that animal… [+2246 chars]"}, {"source": {"id": null, "name": "Indiapost.com"}, "author": "by India Post News Weekly", "title": "COVID-19 infection in kids may not start with a cough - IndiaPost.com", "description": "Gastrointestinal symptoms such as diarrhoea, coupled with a fever or history of exposure to COVID-19, could indicate coronavirus infection in children,", "url": "https://www.indiapost.com/covid-19-infection-in-kids-may-not-start-with-a-cough/", "urlToImage": "https://www.indiapost.com/wp-content/plugins/all-in-one-seo-pack-pro/images/default-user-image.png", "publishedAt": "2020-05-12T10:26:27Z", "content": "BEIJING: Gastrointestinal symptoms such as diarrhoea, coupled with a fever or history of exposure to COVID-19, could indicate coronavirus infection in children, according to a new study.\r\nPublished in the journal Frontiers in Pediatrics, the research also sug… [+2920 chars]"}, {"source": {"id": null, "name": "Gulfnews.com"}, "author": "IANS", "title": "COVID-19 infection in children may not start with a cough - Gulf News", "description": "Study: Gastrointestinal symptoms suffered by some children hint at potential infection", "url": "https://gulfnews.com/world/asia/covid-19-infection-in-children-may-not-start-with-a-cough-1.71454183", "urlToImage": "https://imagevars.gulfnews.com/2020/05/12/Children-teacher-mask-France_172086b9238_medium.jpg", "publishedAt": "2020-05-12T10:23:03Z", "content": "A teacher wearing a protective mask teaches children in her classroom at Champ l'Eveque public school in Bruz, western France, on May 12, 2020, after France eased lockdown measures taken to curb the spread of the COVID-19 pandemic, caused by the novel coronav… [+3179 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Extreme vigilance is needed to ensure a second wave of COVID-19 infections don't spread as countries ease... - Firstpost", "description": "WHO chief said lifting restrictions were “complex and difficult” and the “slow, steady lifting of lockdowns” is key to protecting lives and livelihoods.", "url": "https://www.firstpost.com/health/extreme-vigilance-is-needed-to-ensure-a-second-wave-of-covid-19-infections-dont-spread-as-countries-ease-lockdowns-8358941.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/01/Not-a-PHEIC-says-Tedros-Adhanom-Ghebreyesus-of-the-WHO-at-least-not-yet_Salvatore-di-Nolfi_EPA-1.jpg", "publishedAt": "2020-05-12T08:39:33Z", "content": null}]}