{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Journalists receive face masks and sanitisers for protection - TVC News Nigeria", "description": "As the world continue to battle the spread of Coronavirus pandemic, face masks and hand sanitisers have been distributed to journalists for protection agains...", "url": "https://www.youtube.com/watch?v=OafLtFLJc6w", "urlToImage": null, "publishedAt": "2020-04-24T23:37:30Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "COVID-19 outbreak: Pune’s Serum Institute all set to make under-trial Coronavirus vaccine - The Financial Express", "description": "Once the clinical trials are over and successful, SII will release its vaccine. If the clinical trials by Oxford are not successful then the loss will be of SII. Some limited clinical trials will be done by SII also.", "url": "https://www.financialexpress.com/industry/covid-19-outbreak-punes-serum-institute-all-set-to-make-under-trial-coronavirus-vaccine/1938911/", "urlToImage": null, "publishedAt": "2020-04-24T23:16:14Z", "content": "The Serum Institute of India (SII), which has partnered with the University of Oxford, has started work on manufacturing a vaccine for coronavirus. The SII has started the work even as Oxford University on Thursday started clinical trials of the vaccine it ha… [+1151 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "4-month old COVID-19 positive baby girl dies in Kerala - Telangana Today", "description": "Kozhikode: A four-month-old baby girl, who had tested positive for COVID-19 and suffering from congenital heart disease, died in a hospital here in Kerala early Friday after suffering a cardiac arrest, officials said. This is the third COVID-19 death and the …", "url": "https://telanganatoday.com/4-month-old-covid-19-positive-baby-girl-dies-in-kerala", "urlToImage": null, "publishedAt": "2020-04-24T23:02:54Z", "content": "Kozhikode: A four-month-old baby girl, who had tested positive for COVID-19 and suffering from congenital heart disease, died in a hospital here in Kerala early Friday after suffering a cardiac arrest, officials said.\r\nThis is the third COVID-19 death and the… [+1930 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "ABC News reporter is one of many COVID-19 survivors who has donated their plasma - Good Morning America", "description": "More than 30,000 people have volunteered to donate plasma with the Red Cross since the COVID-19 crisis began. Scientists think plasma from survivors could he...", "url": "https://www.youtube.com/watch?v=gJnSHb3aKVc", "urlToImage": null, "publishedAt": "2020-04-24T22:21:53Z", "content": "More than 30,000 people have volunteered to donate plasma with the Red Cross since the COVID-19 crisis began. Scientists think plasma from survivors could help those who are sick."}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "White House Coronavirus Task Force holds Friday briefing on COVID-19 - 10 Tampa Bay", "description": "President Donald Trump and members of the White House Coronavirus Task Force are giving an update on the nation's fight against COVID-19. Health experts cont...", "url": "https://www.youtube.com/watch?v=BiDhFyIMPm4", "urlToImage": null, "publishedAt": "2020-04-24T21:39:36Z", "content": "President Donald Trump and members of the White House Coronavirus Task Force are giving an update on the nation's fight against COVID-19. Health experts continue to urge people to practice social distancing to limit the spread of the virus. wtsp.com/coronavir… [+355 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Reuters", "title": "Pregnancy, malaria and coronavirus: A 'perfect storm' for preventable deaths? - Deccan Herald", "description": "Pregnant women in malaria-prone areas are more vulnerable to contracting COVID-19, especially where pesticide spraying to kill mosquitoes has been suspended due to lockdowns, health experts warned ahead of World Malaria Day. During pregnancy, women's immune s…", "url": "https://www.deccanherald.com/science-and-environment/pregnancy-malaria-and-coronavirus-a-perfect-storm-for-preventable-deaths-829608.html", "urlToImage": null, "publishedAt": "2020-04-24T21:34:18Z", "content": "Pregnant women in malaria-prone areas are more vulnerable to contracting COVID-19, especially where pesticide spraying to kill mosquitoes has been suspended due to lockdowns, health experts warned ahead of World Malaria Day.\r\nDuring pregnancy, women's immune … [+2449 chars]"}, {"source": {"id": null, "name": "Biospectrumasia.com"}, "author": null, "title": "Scientists identify key nasal cells believed to attract Coronavirus - BSA bureau", "description": "Scientists discovered that goblet and ciliated cells in the nose have high levels of the entry proteins that the Coronavirus uses to get into our cells.", "url": "https://www.biospectrumasia.com/news/26/15851/scientists-identify-key-nasal-cells-believed-to-attract-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-24T18:29:42Z", "content": "Scientists discovered that goblet and ciliated cells in the nose have high levels of the entry proteins that the Coronavirus uses to get into our cells.\r\nTwo specific nose cell types have been identified as likely initial infection points for COVID-19 coronav… [+1756 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "COVID-19 deaths continue to surge in the U.S. as some states consider reopening - CTV News", "description": "Washington Post reporter Lenny Bernstein breaks down the current health crisis in the United States and lack of guidance from the White House. Subscribe to C...", "url": "https://www.youtube.com/watch?v=BUqpilPjGSc", "urlToImage": null, "publishedAt": "2020-04-24T18:21:32Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Matthew Weaver", "title": "Twin sisters, one a nurse in Southampton, two of the latest to die from coronavirus - The Guardian", "description": "Katy and Emma Davis among recent victims, who include a BNP member who found Islam", "url": "https://www.theguardian.com/world/2020/apr/24/twin-sisters-one-a-nurse-in-southampton-two-of-the-latest-to-die-from-coronavirus", "urlToImage": null, "publishedAt": "2020-04-24T18:06:46Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "5 Things in 5 Minutes in Germany - Can Germany endure a second COVID-19 wave? - TRT World", "description": "This week we are looking at: -The possibility of second coronavirus wave with restrictions loosened -Thousands of students sit final exams, social distancing...", "url": "https://www.youtube.com/watch?v=_RdD5uYofW0", "urlToImage": null, "publishedAt": "2020-04-24T17:38:10Z", "content": "This week we are looking at:\r\n-The possibility of second coronavirus wave with restrictions loosened-Thousands of students sit final exams, social distancing challenges arise-German economy experiencing hardest time after World War II-Protesters against lockd… [+508 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "#CheckTheFake-25: Use of HCQ for Covid-19 is a stale tale - Northeast Now", "description": "Gaga over the use of hydroxychloroquine (HCQ) for Covid-19 control is unfortunately not an inspiring tale to tell. Hydroxychloroquine is a medication used for prevention and treatment of malaria, rheumatoid arthritis, lupus, and porphyria cutanea tarda. It wa…", "url": "https://nenow.in/health/checkthefake-25-use-of-hcq-for-covid-19-is-a-stale-tale.html/", "urlToImage": null, "publishedAt": "2020-04-24T17:19:50Z", "content": "Gaga over the use of hydroxychloroquine (HCQ) for Covid-19 control is unfortunately not an inspiring tale to tell.\r\nHydroxychloroquine is a medication used for prevention and treatment of malaria, rheumatoid arthritis, lupus, and porphyria cutanea tarda. It w… [+2600 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Does COVID-19 Cause Blood Clot Complications? | NBC New York - NBC New York", "description": "A small study of five critically ill COVID-19 patients at Mount Sinai Hospital in New York City could have major implications for how doctors respond to the ...", "url": "https://www.youtube.com/watch?v=twPd0YvY3T0", "urlToImage": null, "publishedAt": "2020-04-24T17:18:33Z", "content": null}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Tara Parker-Pope", "title": "What’s a Pulse Oximeter, and Do I Really Need One at Home? - The New York Times", "description": "A tiny fingertip device can give you valuable information about your health during a bout of Covid-19 or any respiratory illness.", "url": "https://www.nytimes.com/2020/04/24/well/live/coronavirus-pulse-oximeter-oxygen.html", "urlToImage": null, "publishedAt": "2020-04-24T16:05:24Z", "content": "After working for 10 days at Bellevue Hospital in New York, Dr. Richard Levitan decided to share what he had learned about Covid-19. Too many patients were showing up at the hospital with perilously low oxygen levels, putting them at risk for severe complicat… [+8004 chars]"}, {"source": {"id": null, "name": "Nejm.org"}, "author": null, "title": "Asymptomatic Transmission, the Achilles' Heel of Current Strategies to Control Covid-19 - nejm.org", "description": "Editorial from The New England Journal of Medicine — Asymptomatic Transmission, the Achilles’ Heel of Current Strategies to Control Covid-19", "url": "https://www.nejm.org/doi/full/10.1056/NEJMe2009758", "urlToImage": null, "publishedAt": "2020-04-24T16:03:34Z", "content": "Traditional infection-control and public health strategies rely heavily on early detection of disease to contain spread. When Covid-19 burst onto the global scene, public health officials initially deployed interventions that were used to control severe acute… [+7447 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Italy's coronavirus epidemic began in January, study shows - Economic Times", "description": "Italy began testing people after diagnosing its first local patient on Feb 21 in Codogno, a small town in the wealthy Lombardy region. Cases and deaths immediately surged, with scientists soon suspecting that the virus had been around, unnoticed, for weeks.", "url": "https://economictimes.indiatimes.com/news/international/world-news/italys-coronavirus-epidemic-began-in-january-study-shows/articleshow/75357050.cms", "urlToImage": null, "publishedAt": "2020-04-24T15:22:37Z", "content": "ROME: The first COVID-19 infections in Italy date back to January, according to a scientific study presented on Friday, shedding new light on the origins of the outbreak in one of the world's worst-affected countries.\r\nItaly began testing people after diagnos… [+1636 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Sweden to shut bars and restaurants that ignore coronavirus restrictions - Reuters India", "description": "Sweden warned on Friday it would shut restaurants and bars in the capital that did not comply with guidelines aimed at preventing the spread of the novel coronavirus, amid signs Stockholm residents were beginning to ignore the rules.", "url": "https://in.reuters.com/article/health-coronavirus-sweden-stockholm-idINKCN2262C2", "urlToImage": null, "publishedAt": "2020-04-24T15:05:14Z", "content": "STOCKHOLM (Reuters) - Sweden warned on Friday it would shut restaurants and bars in the capital that did not comply with guidelines aimed at preventing the spread of the novel coronavirus, amid signs Stockholm residents were beginning to ignore the rules. \r\nT… [+2132 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AFP", "title": "Coronavirus vaccine: Monkeys largely protected during trial, says Chinese firm - Livemint", "description": "Sinovac Biotech said it injected two different doses of its vaccine into eight rhesus macaque monkeys and exposed them to the virus three weeks later, and they did not develop infections", "url": "https://www.livemint.com/news/world/coronavirus-vaccine-monkeys-largely-protected-during-trial-says-chinese-firm-11587736770613.html", "urlToImage": null, "publishedAt": "2020-04-24T14:13:47Z", "content": "A novel coronavirus vaccine has for the first time \"largely protected\" monkeys from infection during an animal trial, data from a Chinese pharmaceutical giant showed.It is among a slew of vaccines being developed around the world as countries race to stop an … [+3317 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Chris Smith", "title": "The most unusual coronavirus symptom is also the most dangerous - BGR", "description": "The newest observed coronavirus symptom is also the most dangerous one and can appear in patients who don’t even experience other symptoms. Doctors have noticed an increase in strokes caused by blood clots in young adults, who might be reluctant to seek medic…", "url": "https://bgr.com/2020/04/24/coronavirus-symptoms-stroke-after-blood-clots-in-young-patients/", "urlToImage": null, "publishedAt": "2020-04-24T14:02:10Z", "content": "<ul><li>The newest observed coronavirus symptom is also the most dangerous one and can appear in patients who don’t even experience other symptoms.</li><li>Doctors have noticed an increase in strokes caused by blood clots in young adults, who might be relucta… [+3622 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coming up with COVID-19 vaccine will be very complex - Dr Oyekan - TVC News Nigeria", "description": "In this interview, Dr Oyekan shares his views on the challenges facing health workers who are at the forfront of Coronavirus battle. #DrOyekan #Coronavirus #...", "url": "https://www.youtube.com/watch?v=kd4ET9pB3iY", "urlToImage": null, "publishedAt": "2020-04-24T14:01:34Z", "content": null}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Livemint", "title": "Coronavirus survivor's diary: Life after ventilators can be hell - Livemint", "description": "Three weeks after her release, Diana Aguilar's recovery is mercilessly slow. She still feels weak, with a shortness of breath and vivid nightmares that she’s back in the hospital, tied to the bed, unable to breathe", "url": "https://www.livemint.com/news/world/coronavirus-survivor-s-diary-life-after-ventilators-can-be-hell-11587734690907.html", "urlToImage": null, "publishedAt": "2020-04-24T13:56:03Z", "content": "NEW YORK :\r\nHer fever hit 105 degrees. In her delirium, Diana Aguilar was sure the strangers hovering over her, in their masks and gowns, were angels before they morphed into menacing aliens. As a doctor prepared to slide a ventilator tube down her throat, al… [+13674 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Sanchita Sharma", "title": "Six coronavirus vaccines in human trials bring hope for early success - India news - gotech daily", "description": "Covid-19 update: The trial will study whether the new vaccine is safe and can generate strong immune responses against Sars-Cov-2, the virus that causes the coronavirus disease (Covid-19), and protect healthy people from infection.", "url": "https://www.hindustantimes.com/india-news/six-coronavirus-vaccines-in-human-trials-bring-hope-of-early-success/story-N3ZcJMi93NeF0puSIAFuvL.html", "urlToImage": null, "publishedAt": "2020-04-24T13:37:46Z", "content": "Human safety trials of a coronavirus vaccine developed by Oxford University began on Thursday even as Indian company Serum Institute of India started work on making the vaccine locally so as to be ready in case the trial succeeds.\r\nThe trial began in Oxford o… [+7429 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "New York Times", "title": "Nearly All Patients Hospitalized With Covid-19 Had Chronic Health Issues, Study Finds - Times of India", "description": "A new study of thousands of hospitalized coronavirus patients in the New York City area, the epicenter of the outbr", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/nearly-all-patients-hospitalized-with-covid-19-had-chronic-health-issues-study-finds/articleshow/75347362.cms", "urlToImage": null, "publishedAt": "2020-04-24T13:20:37Z", "content": "A new study of thousands of hospitalized coronavirus patients in the New York City area, the epicenter of the outbreak in the United States, has found that nearly all of them had at least one major chronic health condition, and most 88 percent had at least tw… [+5568 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "France testing whether nicotine could prevent coronavirus - India Today", "description": "Nicotine could protect people from contracting the coronavirus, according to new research in France, where further trials are planned to test whether the substance could be used to prevent or treat the deadly illness.", "url": "https://www.indiatoday.in/science/story/france-testing-whether-nicotine-could-prevent-coronavirus-1670697-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T13:00:37Z", "content": "Nicotine could protect people from contracting the coronavirus, according to new research in France, where further trials are planned to test whether the substance could be used to prevent or treat the deadly illness.\r\nThe findings come after researchers at a… [+2300 chars]"}, {"source": {"id": null, "name": "Devdiscourse.com"}, "author": "PTI", "title": "Key nose cells identified as likely entry points of novel coronavirus - Devdiscourse", "description": "Scientists have identified two specific cell types in the nose as likely initial infection points for the novel coronavirus that causes COVID-19. The researche", "url": "https://www.devdiscourse.com/article/health/1022363-key-nose-cells-identified-as-likely-entry-points-of-novel-coronavirus", "urlToImage": null, "publishedAt": "2020-04-24T12:56:53Z", "content": "Scientists have identified two specific cell types in the nose as likely initial infection points for the novel coronavirus that causes COVID-19. The researchers, including those from the Wellcome Sanger Institute in the UK and University Medical Centre Groni… [+2333 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "COVID-19: Plasma Therapy likely to begin from April 25 in Karnataka - Deccan Herald", "description": "Karnataka is likely to start Convalescent Plasma Therapy for COVID-19 patients, who are critical, from tomorrow, Medical Education Minister K Sudhakar said here on on Friday. \"We have already got approval for Convalescent Plasma Therapy.", "url": "https://www.deccanherald.com/state/top-karnataka-stories/covid-19-plasma-therapy-likely-to-begin-from-april-25-in-karnataka-829398.html", "urlToImage": null, "publishedAt": "2020-04-24T12:55:53Z", "content": "Karnataka is likely to start Convalescent Plasma Therapy for COVID-19 patients, who are critical, from tomorrow, Medical Education Minister K Sudhakar said here on on Friday. \"We have already got approval for Convalescent Plasma Therapy.\r\nFollow latest update… [+1640 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Shyama Rajagopal", "title": "Experts divided over efficacy of tests - The Hindu", "description": "One group says RT-PCR, antibody test lack sensitivity to detect virus in one attempt", "url": "https://www.thehindu.com/news/national/kerala/experts-are-divided-on-efficacy-of-tests/article31425247.ece", "urlToImage": null, "publishedAt": "2020-04-24T12:44:58Z", "content": "At a time when there is a clamour for more testing to isolate those with severe acute respiratory syndrome corona virus (SARS-CoV-2), experts are divided on the efficacy of the tests.\r\nWhile one group opines that neither the reverse transcriptase polymerase c… [+2537 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Can I get coronavirus from my pet? - India Today", "description": "There's no evidence pets are spreading the virus to people. However, there have been a few cases worldwide where animals likely got the virus from humans, according to the US Department of Agriculture and US Centers for Disease Control and Prevention.", "url": "https://www.indiatoday.in/science/story/can-i-get-coronavirus-from-my-pet-1670664-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T12:31:07Z", "content": null}, {"source": {"id": null, "name": "Newsd.in"}, "author": "IANS", "title": "Key nose cells identified as entry points for corona: Study - Newsd", "description": "London, April 24 (IANS) Researchers have discovered that goblet and ciliated cells in the nose have high levels of the entry proteins that the COVID-19 coronavirus uses to get into our cells. The identification of these cells could help explain the high trans…", "url": "https://newsd.in/key-nose-cells-identified-as-entry-points-for-corona-study/", "urlToImage": null, "publishedAt": "2020-04-24T12:12:23Z", "content": "London, April 24 (IANS) Researchers have discovered that goblet and ciliated cells in the nose have high levels of the entry proteins that the COVID-19 coronavirus uses to get into our cells. The identification of these cells could help explain the high trans… [+2537 chars]"}, {"source": {"id": null, "name": "Greaterkashmir.com"}, "author": null, "title": "'COVID toes' may be symptom of coronavirus, especially in youth - Greater Kashmir", "description": "‘COVID toes’ may be symptom of coronavirus, especially in youth Greater Kashmir | Medical professionals created a registry to document skin conditions among coronavirus patients. About half of them have what’s been dubbed “COVID toes.”", "url": "https://www.greaterkashmir.com/news/health/covid-toes-may-be-symptom-of-coronavirus-especially-in-youth/", "urlToImage": null, "publishedAt": "2020-04-24T12:07:00Z", "content": "Medical professionals created a registry to document skin conditions among coronavirus patients. About half of them have whats been dubbed COVID toes.\r\nThe condition involves purple coloring and inflammation of\r\nthe skin that looks similar to frostbite.\r\nWe h… [+2391 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Vinod Rathore", "title": "Blood thickening, clots in covid-19 patients alarm doctors - News Track English", "description": "New York: A new news related to the corona virus has shocked doctors. This virus is now clotting the blood of the body of the infected. Nephrologists at Mount Sinai Hospital in New York, New York, USA have found that blood is also accumulating in the kidneys …", "url": "https://english.newstracklive.com/news/blood-blockage-in-body-of-corona-patients-says-doctors-mc24-nu764-ta272-1087286-1.html", "urlToImage": null, "publishedAt": "2020-04-24T11:31:04Z", "content": null}, {"source": {"id": null, "name": "Edexlive.com"}, "author": "Edex Live", "title": "Dietary supplements important weapon for fighting off COVID-19, say researchers - EdexLive", "description": "In particular vitamin C, vitamin D, zinc, and an omega-3 fatty acid found in fish, docosahexaenoic acid, also known as DHA, are critical for immune function", "url": "https://www.edexlive.com/news/2020/apr/24/dietary-supplements-important-weapon-for-fighting-off-covid-19-say-researchers-11557.html", "urlToImage": null, "publishedAt": "2020-04-24T11:08:04Z", "content": "Supplements containing vitamins C and D and other micronutrients are a safe, effective and low-cost means of helping your immune system fight off COVID-19 and other acute respiratory tract diseases, say researchers.\r\nAccording to the study, published in the j… [+2042 chars]"}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Kaiser Health News", "title": "Seniors with COVID-19 show unusual symptoms, doctors say - Raw Story", "description": "Older adults with COVID-19, the illness caused by the coronavirus, have several “atypical” symptoms, complicating efforts to ensure they get timely and appropriate treatment, according to physicians. COVID-19 is typically signaled by three symptoms: a fever, …", "url": "https://www.rawstory.com/2020/04/seniors-with-covid-19-show-unusual-symptoms-doctors-say/", "urlToImage": null, "publishedAt": "2020-04-24T09:56:16Z", "content": "Older adults with COVID-19, the illness caused by the coronavirus, have several atypical symptoms, complicating efforts to ensure they get timely and appropriate treatment, according to physicians.\r\nCOVID-19 is typically signaled by three symptoms: a fever, a… [+6329 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Mumbai Mirror", "title": "COVID-19: India may see second wave of outbreak in monsoon, say scientists - Mumbai Mirror", "description": "A study published in The Lancet journal earlier this month modelled the potential adverse consequences of premature relaxation of interventions, and found it might lead to a second wave of infections", "url": "https://mumbaimirror.indiatimes.com/coronavirus/news/covid-19-india-may-see-second-wave-of-outbreak-in-monsoon-say-scientists/articleshow/75347333.cms", "urlToImage": null, "publishedAt": "2020-04-24T09:37:00Z", "content": "The trajectory of COVID-19\r\n cases could have plateaued and might even fall for some weeks after the lockdown\r\n is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say scientists\r\n.… [+6693 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Covid causing blood clots in patients: Docs - Times of India", "description": "The number of COVID-19 cases crossed the 2.5 million mark recently, as researchers rush to make new findings and se", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/covid-causing-blood-clots-in-patients-docs/articleshow/75342355.cms", "urlToImage": null, "publishedAt": "2020-04-24T09:36:07Z", "content": null}, {"source": {"id": null, "name": "Selectscience.net"}, "author": "SelectScience", "title": "Pfizer, BioNTech COVID-19 vaccine cleared for human tests - SelectScience", "description": "Pfizer and BioNTech to start human trials of COVID-19 vaccine", "url": "https://www.selectscience.net/industry-news/pfizer-and-biontech-to-start-human-trials-of-covid-19-vaccine/?artID=51330", "urlToImage": null, "publishedAt": "2020-04-24T09:09:30Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Mumbai Mirror", "title": "Mumbai-based medico designs face shield from overhead projector sheets - Mumbai Mirror", "description": "When the coronavirus pandemic hit Mumbai and medical workers appeared clueless how to treat patients by ensuring their own safety, an enterprising female medical practitioner found a solution by desi", "url": "https://mumbaimirror.indiatimes.com/coronavirus/news/mumbai-based-medico-designs-face-shield-from-overhead-projector-sheets/articleshow/75346286.cms", "urlToImage": null, "publishedAt": "2020-04-24T08:58:00Z", "content": "Mumbai\r\n: When the coronavirus\r\n pandemic hit \r\nMumbai and medical workers appeared clueless how to treat patients by ensuring their own safety, an enterprising female medical practitioner found a solution by designing a face shield made out of overhead proje… [+3399 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Erika Edwards", "title": "Doctors report uptick in surprising coronavirus complication: dangerous blood clots - NBC News", "description": "Coronavirus patients are developing blood clots at higher rates. Does the virus cause blood to clot, or is it the result of inflammation? Regular anticoagulants aren't working.", "url": "https://www.nbcnews.com/health/health-news/doctors-report-uptick-surprising-coronavirus-complication-dangerous-blood-clots-n1190491", "urlToImage": null, "publishedAt": "2020-04-24T08:33:27Z", "content": "Three weeks ago, critical care pulmonologist Hugh Cassiere encountered something he hadn't seen in 24 years of practicing medicine.\r\nA 45-year-old man arrived at the hospital where Cassiere works, North Shore University Hospital on Long Island, New York, with… [+4346 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "PTI", "title": "India may see second wave of COVID-19 outbreak in monsoon, say scientists - India TV News", "description": "The trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the lockdown is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say scientists.", "url": "https://www.indiatvnews.com/news/india/india-may-see-second-wave-of-covid-19-outbreak-in-monsoon-say-scientists-610847", "urlToImage": null, "publishedAt": "2020-04-24T08:28:18Z", "content": "Image Source : PTIThe trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the lockdown is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say… [+6507 chars]"}, {"source": {"id": null, "name": "Pragativadi.com"}, "author": "pragativadinewsservice", "title": "Wuhan lab actively working on coronavirus variant to infect humans: Russian microbiologist - Pragativadi", "description": "New Delhi: A Russian microbiologist has said that the Wuhan lab did ‘crazy things’ to alter coronavirus for  enabling it to infect humans.The top Russian expert has claimed everything was done at Wuhan virology centre to target human beings.Professor", "url": "https://pragativadi.com/wuhan-lab-actively-working-on-coronavirus-variant-to-infect-humans-russian-microbiologist/", "urlToImage": null, "publishedAt": "2020-04-24T07:57:05Z", "content": "New Delhi: A Russian microbiologist has said that the Wuhan lab did crazy things to alter coronavirus for  enabling it to infect humans.\r\nThe top Russian expert has claimed everything was done at Wuhan virology centre to target human beings.\r\nProfessor Petr C… [+526 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "IANS", "title": "Plasma Therapy on Delhi's COVID-19 Patients Showing Positive Results: Kejriwal - The Weather Channel", "description": "In convalescent plasma therapy, antibodies of a recovered patient are taken and transfused into a sick person (infected by the virus) to help boost the latter's immune system.", "url": "https://weather.com/en-IN/india/coronavirus/news/2020-04-24-plasma-therapy-delhi-covid-19-patients-positive-results-cm", "urlToImage": null, "publishedAt": "2020-04-24T07:36:51Z", "content": "(Rajesh Mehta/TOI, Delhi, BCCL)\r\nDelhi Chief Minister Arvind Kejriwal, on Friday, April 24, revealed that the plasma therapy used on four coronavirus patients in New Delhi is showing positive results.\r\n\"Two patients were given plasma on Tuesday, while two wer… [+2205 chars]"}, {"source": {"id": null, "name": "Thequint.com"}, "author": "Ankita Sharma", "title": "69% Asymptomatic COVID Cases: Should India Worry Or There Is Hope? - The Quint", "description": "69% COVID-19 Positive Cases were Asymptomatic: In the last few weeks, a lot has been said about asymptomatic & mildly infected coronavirus cases. Earlier this week, Lav Agrawal,Joint Secretary, Ministry of Health said, On  basis of worldwide analysis", "url": "https://fit.thequint.com/coronavirus/asymptomatic-covid-19-cases-can-they-transmit-the-coronavirus", "urlToImage": null, "publishedAt": "2020-04-24T07:06:21Z", "content": "In the last few weeks, a lot has been said about asymptomatic and mildly infected coronavirus cases.\r\nEarlier this week, Lav Agrawal, Joint Secretary, Ministry of Health said, On the basis of worldwide analysis, 80% of coronavirus patients are asymptomatic or… [+357 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Blood thickening, clots in coronavirus patients alarm doctors in US - India Today", "description": "Signs of blood thickening and clotting were being detected in different organs by doctors from different specialties. Nephrologists noticed kidney dialysis catheters getting plugged with clots.", "url": "https://www.indiatoday.in/world/story/blood-thickening-clots-in-coronavirus-patients-alarm-doctors-in-us-1670435-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T05:29:43Z", "content": "As the novel coronavirus spread through New York City in late March, doctors at Mount Sinai Hospital noticed something strange happening to patients' blood.\r\nSigns of blood thickening and clotting were being detected in different organs by doctors from differ… [+4675 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "COVID: Max hospital group to study use of HCQ among healthcare workers - Livemint", "description": "The large-scale observational study will involve use of hydroxychloroquine prophylaxis among its healthcare workers.This is the first study involving COVID-19 that has been approved by ICMR", "url": "https://www.livemint.com/news/india/covid-max-hospital-group-to-study-use-of-hcq-among-healthcare-workers-11587698913597.html", "urlToImage": null, "publishedAt": "2020-04-24T03:56:25Z", "content": "NEW DELHI :\r\nAmid rising number of coronavirus cases in the country, a private hospital group on Thursday announced that it will conduct a large-scale observational study involving the use of hydroxychloroquine (HCQ) prophylaxis among its healthcare workers, … [+2088 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "New antibody study in New York | Nearly 14% tests positive for antibodies | Coronavirus Pandemic - WION", "description": "New York remains the worst affected state in the US with nearly 270000 cases of coronavirus so far but a new antibody study by the state shows that people in...", "url": "https://www.youtube.com/watch?v=voHYW9G6vNY", "urlToImage": null, "publishedAt": "2020-04-24T02:53:25Z", "content": "New York remains the worst affected state in the US with nearly 270000 cases of coronavirus so far but a new antibody study by the state shows that people infected could be far more. Watch report.\r\n#NewYorkCoronavirus#CoronavirusUS#COVID19\r\nAbout Channel:\r\nTh… [+794 chars]"}, {"source": {"id": null, "name": "Dailyherald.com"}, "author": "Dave Oberhelman", "title": "'COVID toes' reported in some patients with the coronavirus - Chicago Daily Herald", "description": "Laying waste to lives and livelihoods, dividing people in regard to \"opening up\" states and economies, the coronavirus again looks to kick us when we're down. With COVID toes.", "url": "https://www.dailyherald.com/news/20200423/covid-toes-reported-in-some-patients-with-the-coronavirus", "urlToImage": null, "publishedAt": "2020-04-23T23:41:15Z", "content": "Just great.\r\nLaying waste to lives and livelihoods, dividing people in regard to \"opening up\" states and economies, the coronavirus again looks to kick us when we're down.\r\nWith COVID toes.\r\nYes, COVID toes, a term given to discolored toes reported in some pa… [+3192 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "CDC Director Clarifies Coronavirus Comments - HuffPost", "description": "President Donald Trump said Dr. Robert Redfield was misquoted about the coronavirus resurging in the fall, but the CDC director said his interview with The W...", "url": "https://www.youtube.com/watch?v=XhPtzNbO8iI", "urlToImage": null, "publishedAt": "2020-04-23T21:33:39Z", "content": "President Donald Trump said Dr. Robert Redfield was misquoted about the coronavirus resurging in the fall, but the CDC director said his interview with The Washington Post was accurate. \r\nSubscribe to HuffPost today: http://goo.gl/xW6HGSupport our work: https… [+134 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "Most NYC Virus Patients Had Underlying Health Issues, Study Shows - The Epoch Times", "description": "Most patients in New York City hospitalized with the CCP virus suffered from at least one underlying health issue, such as obesity or kidney disease.", "url": "https://www.theepochtimes.com/most-new-york-virus-patients-had-underlying-health-issue-study_3324097.html", "urlToImage": null, "publishedAt": "2020-04-23T21:17:16Z", "content": "Most patients in New York City hospitalized with the CCP virus suffered from one or more underlying health issues, such as obesity or kidney disease, according to a new study.\r\nResearchers analyzed records from 5,700 patients and found more than 56 percent su… [+3603 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "According to Researches, Filter Coffee Extends Life, Turkish Coffee Is Harmful To The Heart - Somag News", "description": "In a study conducted by the Swedish University of Gothenburg, it is stated that filter coffee is beneficial to health and can prolong life, but coffee boiled like Turkish coffee increases the risk of heart disease. The results of the research, published in th…", "url": "https://www.somagnews.com/according-researches-filter-coffee-extends-life-turkish-coffee-harmful-heart/", "urlToImage": null, "publishedAt": "2020-04-23T18:26:00Z", "content": "In a study conducted by the Swedish University of Gothenburg, it is stated that filter coffee is beneficial to health and can prolong life, but coffee boiled like Turkish coffee increases the risk of heart disease.\r\nThe results of the research, published in t… [+1203 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Kalyan Ray", "title": "50-yr-old bacteria drug makes a comeback in fight against coronavirus - Deccan Herald", "description": "A medicinally useful microbe discovered by an Indian biologist half-a-century ago has made a comeback in India’s fight against coronavirus as the Council of Scientific and Industrial Research is set to start three clinical trials with a medicine containing an…", "url": "https://www.deccanherald.com/science-and-environment/50-yr-old-bacteria-drug-makes-a-comeback-in-fight-against-coronavirus-829105.html", "urlToImage": null, "publishedAt": "2020-04-23T17:39:16Z", "content": "The first trial would be on 50 critically-ill COVID-19 patients to check whether the intra-venous drug Sepsivac used against sepsis or blood poisoning - can reduce mortality.\r\nTrack live updates on coronavirus here\r\nThe second trial would on about 500 asympto… [+2517 chars]"}, {"source": {"id": null, "name": "Menshealth.com"}, "author": "Philip Ellis", "title": "Doctors Warn COVID-19 Can Cause Sudden Strokes in People Under 50 - menshealth.com", "description": "Coronavirus has been linked to blood clots in age groups previously not deemed at risk.", "url": "https://www.menshealth.com/health/a32253678/coronavirus-covid-19-sudden-stroke-young-patients/", "urlToImage": null, "publishedAt": "2020-04-23T16:34:00Z", "content": "Medics in New York City have reported that people in their 30s and 40s who were previously not deemed at-risk during the coronavirus pandemic may in fact be vulnerable to sudden strokes. COVID-19 has recently been thought to cause increased blood clotting, wh… [+1675 chars]"}, {"source": {"id": null, "name": "Who.int"}, "author": "World Health Organization: WHO", "title": "WHO urges countries to move quickly to save lives from malaria in sub-Saharan Africa - World Health Organization", "description": "<p>Severe disruptions to insecticide-treated net campaigns and in access to antimalarial medicines could lead to a doubling in the number of malaria deaths in sub-Saharan Africa this year compared to 2018, according to a <a href=\"/publications-detail/the-pote…", "url": "https://www.who.int/news-room/detail/23-04-2020-who-urges-countries-to-move-quickly-to-save-lives-from-malaria-in-sub-saharan-africa", "urlToImage": null, "publishedAt": "2020-04-23T14:21:27Z", "content": "Severe disruptions to insecticide-treated net campaigns and in access to antimalarial medicines could lead to a doubling in the number of malaria deaths in sub-Saharan Africa this year compared to 2018, according to a new modelling analysis released by\r\n WHO … [+3458 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Sara McClain", "title": "All the Approaches to Get rid of a Coronavirus (So Considerably) - Mash Viral", "description": "The race is on to come across a cure for Covid-19. Researchers are testing new vaccines, resurrecting aged medicines, and repurposing treatment plans initially designed for other disorders. Issues are shifting rapidly by the time you go through this, the pred…", "url": "https://www.wired.com/story/all-the-ways-to-kill-a-coronavirus-so-far", "urlToImage": null, "publishedAt": "2020-04-23T14:01:47Z", "content": "The race is on to come across a cure for Covid-19. Researchers are testing new vaccines, resurrecting aged medicines, and repurposing treatment plans initially designed for other disorders. Issues are shifting rapidly by the time you go through this, the pred… [+3871 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Shivali Best", "title": "Coronavirus can cause sudden strokes in young adults, doctors warn - Mirror Online", "description": "Doctors in New York have noticed a surge in strokes among adults with coronavirus in their 30s and 40s who have either mild COVID-19 symptoms, or no symptoms at all", "url": "https://www.mirror.co.uk/science/coronavirus-can-cause-sudden-strokes-21915303", "urlToImage": null, "publishedAt": "2020-04-23T13:48:59Z", "content": "From a fever to a dry cough, coronavirus is known to be associated with a range of unpleasant side effects.\r\n Now, doctors have warned coronavirus can also cause sudden strokes - even if youre young and healthy. \r\nDoctors in New York have noticed a surge in s… [+1681 chars]"}, {"source": {"id": null, "name": "Theguardian.comglobal-development"}, "author": "Kaamil Ahmed", "title": "Pandemic could 'turn back the clock' 20 years on malaria deaths, warns WHO - The Guardian", "description": "Deaths in sub-Saharan African countries could double to more than 700,000 this year if Covid-19 crisis disrupts programmes", "url": "https://amp.theguardian.comglobal-development/2020/apr/23/pandemic-could-turn-back-the-clock-20-years-on-malaria-deaths-warns-who", "urlToImage": null, "publishedAt": "2020-04-23T13:36:46Z", "content": "Deaths from malaria could double across sub-Saharan Africa this year if work to prevent the disease is disrupted by Covid-19, the World Health Organization has warned.\r\nThe UNs global health agency said that if countries failed to maintain delivery of insecti… [+2702 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "92-year-old woman with one side of body paralysed defeats coronavirus in Pune - Times of India", "description": "PUNE: A 92-year-old Pune resident has recovered from coronavirus infection despite having suffered a stroke seven months ago which left one side of he.", "url": "https://timesofindia.indiatimes.com/city/pune/92-year-old-woman-with-one-side-of-body-paralysed-defeats-coronavirus-in-pune/articleshow/75323751.cms", "urlToImage": null, "publishedAt": "2020-04-23T13:28:43Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "John Bowden", "title": "Large majority of coronavirus patients on ventilators in major NY health system died, researchers say | TheHill - The Hill", "description": "More than 85 percent of those placed on ventilators in New York's largest hospital system du...", "url": "https://thehill.com/homenews/state-watch/494260-almost-all-covid-19-patients-on-ventilators-in-new-york-health-system", "urlToImage": null, "publishedAt": "2020-04-23T12:26:26Z", "content": "More than 85 percent of those placed on ventilators in New York's largest hospital system due to coronavirus symptoms later died from the disease, a study has found.\r\nCNN reported Thursday that a study from researchers at the Feinstein Institutes for Medical … [+1292 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Matthew Wright For Dailymail.com Vanessa Chalmers Health Reporter For Mailonline", "title": "Nearly 90 per cent of COVID-19 patients placed on ventilators in NY's largest health system DIED - Daily Mail", "description": "The study, published in the Journal of the American Medical Association on Wednesday, examined the electronic health records of 5,700 patients hospitalized.", "url": "https://www.dailymail.co.uk/news/article-8248023/Nearly-90-cent-COVID-19-patients-placed-ventilators-NYs-largest-health-DIED.html", "urlToImage": null, "publishedAt": "2020-04-23T12:07:07Z", "content": "Nearly 90 per cent of all coronavirus patients placed on ventilators in New York's largest health system died, according to a study. \r\nThe study, published in the Journal of the American Medical Association on Wednesday, examined the electronic health records… [+4384 chars]"}, {"source": {"id": null, "name": "Dailypost.ng"}, "author": "John Owen Nwachukwu", "title": "COVID-19: Nigerian govt clears air on reported nationwide lockdown - Daily Post Nigeria", "description": "The Presidential Task Force on COVID-19 has dissociated itself from a statement that went round on Tuesday evening, attributing an alleged plan by the Federal Government to impose a national lockdown soon. The 'fake' statement said the government's decision c…", "url": "https://dailypost.ng/2020/04/23/covid-19-nigerian-govt-clears-air-on-reported-nationwide-lockdown/", "urlToImage": null, "publishedAt": "2020-04-23T11:24:48Z", "content": "The Presidential Task Force on COVID-19 has dissociated itself from a statement that went round on Tuesday evening, attributing an alleged plan by the Federal Government to impose a national lockdown soon.\r\nThe ‘fake’ statement said the government’s decision … [+1009 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Silvia Aloisi", "title": "Special Report: As virus advances, doctors rethink rush to ventilate - Reuters", "description": "When he was diagnosed with COVID-19, Andre Bergmann knew exactly where he wanted to be treated: the Bethanien hospital lung clinic in Moers, near his home in northwestern Germany.", "url": "https://in.reuters.com/article/uk-health-coronavirus-ventilators-specia-idINKCN2251ST", "urlToImage": null, "publishedAt": "2020-04-23T11:03:00Z", "content": "BERLIN (Reuters) - When he was diagnosed with COVID-19, Andre Bergmann knew exactly where he wanted to be treated: the Bethanien hospital lung clinic in Moers, near his home in northwestern Germany. \r\nThe clinic is known for its reluctance to put patients wit… [+16781 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Scroll Staff", "title": "Covid-19: Infected man alleges Delhi hospital denied admission to him and his family - Scroll.in", "description": "The patient, identified as Naseem, said he walked to the hospital on foot, leaving behind seven other family members who tested positive.", "url": "https://scroll.in/latest/960025/covid-19-infected-man-alleges-delhi-hospital-denied-admission-to-him-and-his-family", "urlToImage": null, "publishedAt": "2020-04-23T10:45:00Z", "content": "A man in Delhi who tested positive for the coronavirus has alleged that he and his family members were denied admission to the Lok Nayak Hospital in the national Capital for treatment, ANI reported. \r\nThe patient, identified as Naseem, is a resident of Choori… [+3277 chars]"}, {"source": {"id": null, "name": "Msn.com"}, "author": null, "title": "In New York's largest hospital system, 88 percent of coronavirus patients on ventilators didn't make it - msnNOW", "description": "The analysis is the largest and most comprehensive look at outcomes in the United States to be published so far.", "url": "https://www.msn.com/en-us/news/us/in-new-yorks-largest-hospital-system-88-percent-of-coronavirus-patients-on-ventilators-didnt-make-it/ar-BB133Act", "urlToImage": null, "publishedAt": "2020-04-23T10:30:00Z", "content": "Throughout March, as the pandemic gained momentum in the United States, much of the preparations focused on the breathing machines that were supposed to save everyones lives. \r\n© Timothy A. Clary/AFP/Getty Images\r\n In a tribute to health care workers, first r… [+3828 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "COVID-19 may not be sexually transmitted: Study - Daily Pioneer", "description": "COVID-19 is unlikely to be spread through sexual transmission, according to a study that found no evidence of the novel coronavirus in the semen or testes of men.\n\nThe study, published in the journal Fertility &amp; Sterility, was not comprehensive enough to …", "url": "https://www.dailypioneer.com/2020/pioneer-health/covid-19-may-not-be-sexually-transmitted--study.html", "urlToImage": null, "publishedAt": "2020-04-23T10:08:50Z", "content": "COVID-19 is unlikely to be spread through sexual transmission, according to a study that found no evidence of the novel coronavirus in the semen or testes of men.\r\nThe study, published in the journal Fertility &amp; Sterility, was not comprehensive enough to … [+3333 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ariana Eunjung Cha", "title": "Coronavirus: 88% of Covid-19 patients on ventilators didn’t survive in New York’s hospital system, study finds - The Independent", "description": "This compares with the roughly 80 per cent of patients who died on ventilators before the pandemic, according to previous studies", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-us-new-york-hospital-ventilator-death-rate-latest-a9479411.html", "urlToImage": null, "publishedAt": "2020-04-23T09:20:00Z", "content": "Throughout March, as the pandemic gained momentum in the United States, much of the preparations focused on the breathing machines that were supposed to save everyones lives.\r\nNew York State Gov. Andrew Cuomo and President Donald Trump sparred over how many v… [+3229 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "REUTERS", "title": "Alarmed as COVID patients' blood thickened, New York doctors try new treatments - Times Now", "description": "Clotting can develop in anyone who gets very sick and spends long periods of time immobile on a ventilator, but doctors say the problem seemed to show up sooner in COVID-19 patients.", "url": "https://www.timesnownews.com/health/article/alarmed-as-covid-patients-blood-thickened-new-york-doctors-try-new-treatments/581903", "urlToImage": null, "publishedAt": "2020-04-23T07:49:31Z", "content": "New York: As the novel coronavirus spread through New York City in late March, doctors at Mount Sinai Hospital noticed something strange happening to patients' blood.\r\n    Signs of blood thickening and clotting were being detected in different organs by docto… [+4687 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Maeve Campbell", "title": "How can you boost your immune system during the COVID-19 pandemic? - Euronews", "description": "Consultant Dietitian and Nutritionist Paula Mee tells us which foods to stock up on and which to avoid.", "url": "https://www.euronews.com/living/2020/04/23/how-can-you-boost-your-immune-system-during-the-covid-19-pandemic", "urlToImage": null, "publishedAt": "2020-04-23T07:42:39Z", "content": "Our immune systems do a remarkable job at fighting off foreign cells to protect us against illness. Varying factors are at play, such as age, which determine how resilient this defence system will be. Naturally, when a global health pandemic strikes, we’re bo… [+7093 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Aishwarya Dharni", "title": "Doctors Terrified Of Blood Clotting And Thickening Causing Strokes In Coronavirus Patients - India Times", "description": "According to a report by Reuters, doctors at Mount Sinai Hospital in New York City have noticed a brand new thing that takes place in a COVID-19 positive patient's body. As the novel coronavirus spread through New York City in late March, doctors at Mount Sin…", "url": "https://www.indiatimes.com/trending/wtf/doctors-terrified-of-blood-clotting-and-thickening-causing-strokes-in-coronavirus-patients-511563.html", "urlToImage": null, "publishedAt": "2020-04-23T06:50:20Z", "content": "New things about COVID-19 are coming to light each day it seems, and living in a world affected by it, scientists and researchers are only too keen to learn all that they can about it. \r\nAccording to a report byReuters, doctors at Mount Sinai Hospital in New … [+2318 chars]"}, {"source": {"id": null, "name": "Actmedia.eu"}, "author": "ACTMedia - Romanian Business News", "title": "Health Ministry completes methodology for collection, use of plasma from COVID-19 cured donors - ACTmedia", "description": "A methodology for collecting, testing, processing, storing and distributing plasma from donors cured of the infection with the novel coronavirus and the monitor...", "url": "https://www.actmedia.eu/daily/health-ministry-completes-methodology-for-collection-use-of-plasma-from-covid-19-cured-donors/86114", "urlToImage": null, "publishedAt": "2020-04-23T06:29:51Z", "content": "Thursday, April 23, 2020\r\nA methodology for collecting, testing, processing, storing and distributing plasma from donors cured of the infection with the novel coronavirus and the monitored use for COVID-19 critically ill patients in intensive care has been co… [+2638 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "A herd immunity strategy could actually work in youthful India - Economic Times", "description": "The herd strategy would allow a majority of the population to gain resistance to coronavirus.", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/a-herd-immunity-strategy-could-actually-work-in-youthful-india/articleshow/75285241.cms", "urlToImage": null, "publishedAt": "2020-04-23T04:07:00Z", "content": "By Ari AltstedterControversial given the high risk of deaths, a coronavirus strategy discarded by the U.K. is being touted as the solution for poor but young countries like India.\r\nThe herd immunity strategy, which would allow a majority of the population to … [+6875 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Recovered COVID-19 patient has tough time donating blood plasma with life-saving antibodies - TMJ4 News", "description": "A local coronavirus survivor is hoping to help other patients by donating his blood plasma to patients in need.", "url": "https://www.youtube.com/watch?v=6771wucQ1_8", "urlToImage": null, "publishedAt": "2020-04-23T03:19:37Z", "content": null}]}