{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Kyle O'Sullivan", "title": "Coronavirus vaccine set for early autumn - but scientist warns of deadly risk - Mirror Online", "description": "An Oxford University team are already mass producing a possible vaccine on an industrial scale before animal and human trials indicate whether it can lead to serious immune systems complications", "url": "https://www.mirror.co.uk/tv/tv-news/coronavirus-vaccine-set-early-autumn-22058055", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article22059595.ece/ALTERNATES/s1200/1_Coronavirus.jpg", "publishedAt": "2020-05-21T12:30:44Z", "content": "With hundreds of thousands dying around the world, the race is on to find a vaccine to end the coronavirus pandemic.\r\nMore than 100 groups across the world are attempting to develop a vaccine, which is likely to induce longer lasting immunity than infection.\r… [+8808 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "US pharma firm Gilead Sciences likely to seek nod to market anti-viral drug remdesivir in India - Livemint", "description": "The medicine has been issued an Emergency Use Authorization (EUA) by the United States Food and Drug Administration (FDA) to treat hospitalised covid-19 patient.Officials of the Union Health Ministry, along with the DCGI held a discussion with the representat…", "url": "https://www.livemint.com/companies/news/us-pharma-firm-gilead-sciences-likely-to-seek-nod-to-market-anti-viral-drug-remdesivir-in-india-11590063005562.html", "urlToImage": "https://images.livemint.com/img/2020/05/21/600x338/2020-05-18T114034Z_3_LYNXMPEG4H0PK_RTROPTP_3_HEALTH-CORONAVIRUS-GILEAD-SCIENCES_1590063269263_1590063282055.JPG", "publishedAt": "2020-05-21T12:29:30Z", "content": "NEW DELHI :\r\nUS pharmaceutical giant Gilead Sciences is likely to apply to India's Central Drugs Standard Control Organisation (CDSCO) soon seeking marketing authorisation for its anti-viral drug remdesivir, which is being considered by many as a potential me… [+4098 chars]"}, {"source": {"id": null, "name": "Edexlive.com"}, "author": "Edex Live", "title": "Young people with even mild mental distress at high suicide risk - EdexLive", "description": "Previous studies have suggested that a broad range of mental health problems like depression anxiety, and low self-esteem can be measured together as levels of common mental distress", "url": "https://www.edexlive.com/news/2020/may/21/young-people-with-even-mild-mental-distress-at-high-suicide-risk-12170.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2019/11/12/w600X390/suicide1.jpg", "publishedAt": "2020-05-21T12:22:30Z", "content": "The vast majority of young people who self-harm or experience suicidal thoughts appear to have only mild or moderate mental distress, according to researchers.\r\nMeasures to reduce suicide risk in young people should focus on the whole population, not just tho… [+2324 chars]"}, {"source": {"id": null, "name": "Edexlive.com"}, "author": "Edex Live", "title": "Emergency Covid-19 vaccine could be ready by Jan-Feb 2021: Former ICMR chief - EdexLive", "description": "RNA is the genetic material of the viruses and messenger RNA or mRNA vaccines are fully synthetic. After knowing the target antigen's sequence, the production of a vaccine can be accelerated", "url": "https://www.edexlive.com/news/2020/may/21/emergency-covid-19-vaccine-could-be-ready-by-jan-feb-2021-former-icmr-chief-12169.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2020/5/21/w600X390/Proper-storage-temperature-is-crucial-to-vaccine-potency.jpg", "publishedAt": "2020-05-21T12:19:19Z", "content": "Against the backdrop of leading vaccine maker Bharat Biotech partnering with Thomas Jefferson University of Philadelphia to develop a new vaccine candidate for Covid-19 invented at Jefferson, it seems the emergency vaccine for Covid-19 would be available late… [+2214 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "As the world races to stop Covid-19, here's how vaccines work - ThePrint", "description": "The number of cases of Covid-19 worldwide has crossed 50 lakh. As the infectious disease continues to claim more lives, scientists across the world are racin...", "url": "https://www.youtube.com/watch?v=tCpnnq55ab4", "urlToImage": "https://i.ytimg.com/vi/tCpnnq55ab4/maxresdefault.jpg", "publishedAt": "2020-05-21T12:18:42Z", "content": null}, {"source": {"id": null, "name": "Ndtv.com"}, "author": "DoctorNDTV", "title": "7 Simple Yet Effective Tips To Make Your Diet Healthier - Doctor NDTV", "description": "Healthy diet: A balanced diet is a mixture of all essential nutrients which your body requires to function properly and for optimum growth. Read on to know some tips to make your diet healthier.", "url": "https://doctor.ndtv.com/living-healthy/7-simple-yet-effective-tips-to-make-your-diet-healthier-2232852", "urlToImage": "https://c.ndtvimg.com/2019-05/rcbiqg8o_healthy-diet_625x300_25_May_19.jpg", "publishedAt": "2020-05-21T12:14:43Z", "content": "A healthy diet promotes healthy functioning of the body. It is advised to consume a healthy and balanced diet. A balanced diet is a mixture of all essential nutrients which your body requires to function properly and for optimum growth. It can help you mainta… [+3387 chars]"}, {"source": {"id": null, "name": "Inventiva.co.in"}, "author": "Nandini Marwah", "title": "Coronavirus Is Shifting Its Base To India From China Via US - Inventiva", "description": "If we analyze the situation of the pandemic, there is one thing that one can infer from it. The virus started in China and move to the United States. With thous", "url": "https://www.inventiva.co.in/trends/nandini/coronavirus-is-shifting-its-base-to-india-from-china-via-us/", "urlToImage": "https://www.inventiva.co.in/wp-content/uploads/2020/05/coronavirus-india.jpg", "publishedAt": "2020-05-21T11:06:34Z", "content": "If we analyze the situation of the pandemic, there is one thing that one can infer from it. The virus started in China and move to the United States. With thousands of coronavirus fresh cases being reported in our country every day, everyone is scared of what… [+6140 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Bloomberg", "title": "Coronavirus: Diamond Princess’s cases reveal pattern of Covid-19 disease - Livemint", "description": "Understanding the disease pattern that coronavirus infection can cause is important for informing strategies for detecting and controlling it.A detailed analysis of cases found the disease could be very mild, causing a sore throat, dry cough and runny nose, w…", "url": "https://www.livemint.com/news/world/coronavirus-diamond-princess-s-cases-reveal-pattern-of-covid-19-disease-11590057147097.html", "urlToImage": "https://images.livemint.com/img/2020/05/21/600x338/dimand_1581702229254_1590057384774.jpg", "publishedAt": "2020-05-21T10:45:27Z", "content": "Months after the coronavirus infected more than 700 people on board the Diamond Princess cruise ship in Japan, scientists are still gleaning insights into the patterns of illness it causes.Almost a fifth of the 3,711 passengers and crew on the 13-deck luxury … [+2051 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "BP drug can reduce COVID-19 mortality risk, say researchers - Times of India", "description": "Scientists from all over the world are eagerly looking for potential treatments, vaccines against the novel coronav", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/bp-drug-can-reduce-covid-19-mortality-risk-say-researchers/articleshow/75849069.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75849069,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-1177331/75849069.jpg", "publishedAt": "2020-05-21T10:34:38Z", "content": null}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Aalok Sensharma", "title": "Coronavirus News | Is working out with face masks harmful? Here's all you need to know - Jagran English", "description": "The face mask restricts the flow of air into our lungs  which  while exercising or working out  makes us feel breathless and tired   pic credits  PTI", "url": "https://english.jagran.com/lifestyle/coronavirus-news-is-working-out-with-face-masks-harmful-heres-all-you-need-to-know-10012099", "urlToImage": "https://www.jagranimages.com/images/2020/may/face-marks1590056290682.jpg", "publishedAt": "2020-05-21T10:15:05Z", "content": "New Delhi | Jagran Lifestyle Desk: Close to five million people worldwide have been infected by COVID-19, with the fatality count closing the mark of 3,50,000 by every passing hour. The pandemic continues to keep the people on their toes when it comes to ensu… [+1583 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Ashwagandha against coronavirus: Researchers from IIT-Delhi and Japan's AIST make an interesting discovery about the Ayurvedic drug - Times of India", "description": "Just recently, India's Ministry of AYUSH and CSIR announced a slew of measures and clinical trials aimed at studying the use of ashwagandha, along with other Ayurvedic herbs as a preventive treatment for COVID-19.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-treatment-ayurvedic-drug-covid-19-cure-ashwagandha-against-coronavirus-researchers-from-iit-delhi-and-japans-aist-make-an-interesting-discovery-about-the-ayurvedic-drug/photostory/75864118.cms", "urlToImage": "https://static.toiimg.com/photo/75864572.cms", "publishedAt": "2020-05-21T09:45:00Z", "content": "Just recently, India's Ministry of AYUSH and CSIR announced a slew of measures and clinical trials aimed at studying the use of ashwagandha, along with other Ayurvedic herbs as a preventive treatment to front line workers and infected patients in a large stud… [+521 chars]"}, {"source": {"id": null, "name": "Unaids.org"}, "author": null, "title": "Communities strengthening the AIDS response in Nepal - UNAIDS", "description": "From the very beginning, communities were in the vanguard of the AIDS response in Nepal. Still playing a vital role in the response to HIV in the country, communities are making good-quality services more accessible for people living with HIV and key populati…", "url": "https://www.unaids.org/en/resources/presscentre/featurestories/2020/may/20200521_community-led-organizations", "urlToImage": null, "publishedAt": "2020-05-21T09:18:49Z", "content": "From the very beginning, communities were in the vanguard of the AIDS response in Nepal.From the very beginning, communities were in the vanguard of the AIDS response in Nepal. Still playing a vital role in the response to HIV in the country, communities are … [+3854 chars]"}, {"source": {"id": null, "name": "Vogue.in"}, "author": "Aparrna Gupta", "title": "Are you feeling hungry all the time in lockdown? You're not alone - VOGUE India", "description": "With regular schedules thrown out of whack, those trips to the fridge have become more frequent than ever before. Vogue investigates", "url": "https://www.vogue.in/wellness/content/diet-tips-feeling-hungry-all-the-time-in-lockdown", "urlToImage": "https://assets.vogue.in/photos/5ec6312a17f6dfaff1498e49/16:9/w_1920,c_limit/diet%20hungry%20all%20the%20time%20lockdown%20bored%20tired%20packaged%20food.jpg", "publishedAt": "2020-05-21T08:45:13Z", "content": "Are you feeling hungry all the time? When you're working, when you wake up and especially before you go to bed? If you're raiding your fridge for comfort food and finding yourself craving sweet treats and pizza more than you ever have before, you can blame al… [+4422 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Coronavirus pandemic may cause long-term health problems: Study - Deccan Herald", "description": "The life-altering effects of the COVID-19 pandemic are likely to result in lasting physical and mental health consequences for many people worldwide, particularly those from vulnerable populations, according to a study. Researchers from the Yale School of Pub…", "url": "https://www.deccanherald.com/science-and-environment/coronavirus-pandemic-may-cause-long-term-health-problems-study-840189.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/21/vIRUS-263783188-1590048931.jpg", "publishedAt": "2020-05-21T08:15:31Z", "content": "The life-altering effects of the COVID-19 pandemic are likely to result in lasting physical and mental health consequences for many people worldwide, particularly those from vulnerable populations, according to a study.\r\nResearchers from the Yale School of Pu… [+2237 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Anushree Gupta", "title": "Stress management in times of COVID-19: 5 tips to keep yourself from stress and emotional eating - Times Now", "description": "Researchers have found that stress eating works on the concept of a \"reward system\" designed by our brains. The causes of stress eating may not be under our control, but we can find ways to manage it better.", "url": "https://www.timesnownews.com/health/article/stress-management-in-times-of-covid-19-5-tips-to-keep-yourself-from-stress-and-emotional-eating/595039", "urlToImage": "https://imgk.timesnownews.com/story/iStock-646731204.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-21T07:33:11Z", "content": "<ul><li>As we embrace the 'new normal' that COVID-19 pandemic has brought upon us, stress and its omnipresence is also becoming increasingly normal in our lives</li><li>Stress brings with it the baggage of stress or emotional eating, which can have some serio… [+5648 chars]"}, {"source": {"id": null, "name": "Sentinelassam.com"}, "author": "Sentinel Digital Desk", "title": "Took HCQ after valet tested COVID positive, says President Donald Trump- Sentinelassam - The Sentinel Assam", "description": "President Donald Trump says he began taking hydroxychloroquine (HCQ) “as a frontline defence” after...", "url": "https://www.sentinelassam.com/international/took-hcq-after-valet-tested-covid-positive-says-president-donald-trump-478036", "urlToImage": "https://www.sentinelassam.com/h-upload/2020/05/21/128248-took-hcq-after-valet-tested-covid-positive.jpg", "publishedAt": "2020-05-21T07:21:24Z", "content": "NEW YORK: President Donald Trump says he began taking hydroxychloroquine (HCQ) \"as a frontline defence\" after his valet and Vice President Mike Pence's press secretary tested positive for COVID-19. After the two of them tested positive, \"I thought, you know, … [+1574 chars]"}, {"source": {"id": null, "name": "Sentinelassam.com"}, "author": "Sentinel Digital Desk", "title": "Walking or cycling to work may reduce early death risk or illness- Sentinelassam - The Sentinel Assam", "description": "Walking or cycling and travel by train to work are at reduced risk of early death or illness", "url": "https://www.sentinelassam.com/international/walking-or-cycling-to-work-may-reduce-early-death-risk-or-illness-478035", "urlToImage": "https://www.sentinelassam.com/h-upload/2020/05/21/128239-walking-or-cycling-to-work-may-reduce-early-death-risk.jpg", "publishedAt": "2020-05-21T07:21:20Z", "content": "LONDON: People who walk, cycle and travel by train to work are at reduced risk of early death or illness compared with those who commute by car, according to a new study.\r\nFor the findings, the researchers conducted a study on more than 300,000 commuters in E… [+1449 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Harshita Jain", "title": "Corona become more dangerous for patients suffering from this disease - News Track English", "description": "Corona is increasingly making people with weak immunities a victim. In the ongoing situation to prevent lockdown and infection, this time is difficult for those breast cancer patients who have to undergo chemo or radiotherapy. Such patients should consult the…", "url": "https://english.newstracklive.com/news/higher-risk-of-corona-infection-in-breast-cancer-patients-taking-chemoor-radio-ther-apy-mc23-nu870-ta294-1093980-1.html", "urlToImage": "https://media.newstracklive.com/uploads/national-news//May/21/big_thumb/carnss_5ec609698e298.jpg", "publishedAt": "2020-05-21T07:18:47Z", "content": null}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Hina Zahid", "title": "High BP during and after exercise linked to CVD and death risk - Medical Dialogues", "description": "Blood pressure responses to exercise is a significant marker of CVD and mortality risk in young to...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/high-bp-during-and-after-exercise-linked-to-cvd-and-death-risk-65958", "urlToImage": "https://medicaldialogues.in/h-upload/2020/03/16/125563-blood-pressure.jpg", "publishedAt": "2020-05-21T06:51:21Z", "content": "Boston)--Exercise can increase blood pressure, but the effects are typically temporary.\r\nResearchers from Boston University School of Medicine (BUSM) have found that higher blood pressure during exercise and delayed blood pressure recovery after exercise are … [+2050 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Asian News International | Posted by: Alfea Jamal", "title": "Obesity not related to how close you live to fast food restaurants or gyms. Here’s why - Hindustan Times", "description": "The areas where we live are known to be important for our health. For example, obesity is more prevalent in deprived neighbourhoods. Deprived neighbourhoods are typically defined by low socio-economic levels.", "url": "https://www.hindustantimes.com/more-lifestyle/obesity-not-related-to-how-close-you-live-to-fast-food-restaurants-or-gyms-here-s-why/story-FJIfp7FtCpn3O89sgkk9pK.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/21/Pictures/_8286d12e-9b29-11ea-92be-8e275334e660.jpg", "publishedAt": "2020-05-21T06:11:00Z", "content": "A new study from Lund University in Sweden has shown there is no correlation between obesity and how close you live to fast food restaurants or gyms.\r\nStudies from other countries have previously indicated that these factors may be important in adult obesity.… [+1746 chars]"}, {"source": {"id": null, "name": "Edexlive.com"}, "author": "Edex Live", "title": "Over 100,000 new COVID-19 cases recorded in last 24 hrs: World Health Organisation - EdexLive", "description": "Revealing the alarming numbers at his daily briefing, WHO Director General Tedros Adhanom Ghebreyesus said that two-thirds of those cases came from just four countries", "url": "https://www.edexlive.com/news/2020/may/21/over-100000-new-covid-19-cases-recorded-in-last-24-hrs-world-health-organisation-12160.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2020/5/21/w600X390/Unknown.jpg", "publishedAt": "2020-05-21T06:10:38Z", "content": "Highlighting its continuing peril around the world even as its spread slows in some areas of Asia and Europe and lockdown restrictions are eased, coronavirus has infected 106,000 people in the last 24 hours - the largest number of cases since its outbreak, th… [+472 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Time running out on track and trace, NHS leaders warn - BBC News", "description": "The NHS Confederation warns of \"severe\" consequences if the right system is not established quickly.", "url": "https://www.bbc.com/news/uk-52748564", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/8DE9/production/_112392363_mediaitem112392238.jpg", "publishedAt": "2020-05-21T06:05:40Z", "content": "Image copyrightPA Media\r\nTime is running out to finalise a test, track and trace strategy to avoid a possible second surge in coronavirus cases, NHS bosses have said.\r\nThe NHS Confederation warned of \"severe\" consequences to staff and patients if the right sy… [+7099 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Reuters", "title": "China's Wuhan: Relief, and fear, at ground zero of the coronavirus - Deccan Herald", "description": "Back in March when I was in Wuhan as it opened up after over two months in lockdown, I often went past the Minyi vegetable market. Blocked by 2-metre-high yellow barricades, it was a constant reminder of how the city's life had come to a crashing halt during …", "url": "https://www.deccanherald.com/international/chinas-wuhan-relief-and-fear-at-ground-zero-of-the-coronavirus-840149.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/21/820506-01-02-875750474-1590041489.jpg", "publishedAt": "2020-05-21T06:04:48Z", "content": "Back in March when I was in Wuhan as it opened up after over two months in lockdown, I often went past the Minyi vegetable market. Blocked by 2-metre-high yellow barricades, it was a constant reminder of how the city's life had come to a crashing halt during … [+2741 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Sally Hayden", "title": "Uganda women fear food shortages will make coronavirus and HIV a deadly mix - Reuters India", "description": "GULU, Uganda (Thomson Reuters Foundation) - Before Uganda's coronavirus lockdown, HIV-positive Matina had a morning routine. After waking she drank tea, ate something small, and took her antiretroviral drugs as doctors instructed.", "url": "https://in.reuters.com/article/health-coronavirus-uganda-hiv-feature-idINKBN22X0FG", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-05-21T05:46:09Z", "content": "GULU, Uganda (Thomson Reuters Foundation) - Before Uganda’s coronavirus lockdown, HIV-positive Matina had a morning routine. After waking she drank tea, ate something small, and took her antiretroviral drugs as doctors instructed.  \r\nBut since restrictions to… [+6518 chars]"}, {"source": {"id": null, "name": "Guwahatiplus.com"}, "author": null, "title": "IIT-G Researchers Develop ways to Delay Alzheimer’s Disease by 10 Years - Guwahati Plus", "description": "A team of researchers of Indian Institute of Technology, Guwahati (IITG) have developed ways to reduce short-term memory losses for Alzheimer patients.", "url": "https://www.guwahatiplus.com/daily-news/iit-g-researchers-develop-ways-to-delay-alzheimer-s-disease-by-10-years", "urlToImage": "https://s3.amazonaws.com/guwahati-plus/daily_banners/9840/original/IIT-G_Researchers_Develop_ways_to_Delay_Alzheimer%E2%80%99s_Disease_by_10_Years.png", "publishedAt": "2020-05-21T05:38:00Z", "content": "GUWAHATI: A team of researchers of Indian Institute of Technology, Guwahati (IITG) have developed ways to reduce short-term memory losses for Alzheimer patients.\r\nThe team of four led by Professor Vibin Ramakrishnan, Department of Biosciences &amp; Bioenginee… [+1417 chars]"}, {"source": {"id": null, "name": "Devdiscourse.com"}, "author": "PTI", "title": "'How macaques resist coronavirus re-infection decoded, may help develop vaccine' - Devdiscourse", "description": "Read more about 'How macaques resist coronavirus re-infection decoded, may help develop vaccine' on Devdiscourse", "url": "https://www.devdiscourse.com/article/health/1060206-how-macaques-resist-coronavirus-re-infection-decoded-may-help-develop-vaccine", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/03_03_2020_18_59_53_6525806.jpg?width=920&format=jpeg", "publishedAt": "2020-05-21T05:25:21Z", "content": "Researchers have revealed the components of the immune system in macaques which help them develop immunity to coronavirus re-infection, findings which have helped them uncover the likely protective function a potential vaccine should exhibit. While there are … [+2870 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "CPC Diagnostics launches SARS COV-2 IgM, SARS COV-2 IgG tests in India - Express Healthcare", "description": "Both are CE-approved antibody tests and have been approved by ICMR", "url": "https://www.expresshealthcare.in/news/cpc-diagnostics-launches-sars-cov-2-igm-sars-cov-2-igg-tests-in-india/420673/", "urlToImage": "https://cdn.expresshealthcare.in/wp-content/uploads/2020/03/26153924/GettyImages-1204866804-e1585217630711.jpg", "publishedAt": "2020-05-21T05:05:00Z", "content": "Both are CE-approved antibody tests and have been approved by ICMR\r\nCPC Diagnostics (CPC), Chennai, a portfolio company of Everstone backed healthcare platform Everlife Holdings has launched SARS COV-2 IgM and SARS COV-2 IgG tests in India. Both are CE-approv… [+2796 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Asian News International| Posted by: Harshit Sabarwal", "title": "Covid-19 infected elderly patients on ventilators have low survival rates: Report - Hindustan Times", "description": "The Washington Post cited the study, published in the Lancet, on Tuesday, saying that most elderly Covid-19 patients put on ventilators at two New York hospitals did not survive.", "url": "https://www.hindustantimes.com/world-news/covid-19-infected-elderly-patients-on-ventilators-have-low-survival-rates-report/story-rgC5Qj43EZGmyNiYPxPUQO.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/21/Pictures/coronavirus-death-in-delhi_4b332cd2-9b1e-11ea-a010-c71373fc244b.jpg", "publishedAt": "2020-05-21T04:49:00Z", "content": "Most people in their advance age, especially among those who are infected by the novel coronavirus and are suffering from some underlying disease such as hypertension, diabetes, heart disease and obesity, have lower rates of survival, even if they are put on … [+3752 chars]"}, {"source": {"id": null, "name": "France24.com"}, "author": "NEWS WIRES", "title": "WHO reports most coronavirus cases in a day, sees steep rise in poor countries - FRANCE 24 English", "description": "The World Health Organization expressed concern on Wednesday about the rising number of new coronavirus cases in poor countries, even as many rich nations have begun emerging from lockdown.", "url": "https://www.france24.com/en/20200520-who-reports-most-coronavirus-cases-in-a-day-sees-steep-rise-in-poor-countries", "urlToImage": "https://s.france24.com/media/display/22cb5396-9aa6-11ea-a9dd-005056bff430/w:1240/p:16x9/2020-05-19T160618Z_812217758_RC2SRG9RIG7P_RTRMADP_3_HEALTH-CORONAVIRUS-AFRICA-LEADERS.JPG", "publishedAt": "2020-05-21T03:43:40Z", "content": "The World Health Organization expressed concern on Wednesday about the rising number of new coronavirus cases in poor countries, even as many rich nations have begun emerging from lockdown.\r\n The global health body said 106,000 new cases of infections of the … [+2621 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "What we know about the Covid-related syndrome affecting children - Times of India", "description": "Science News: For parents, one of the most reassuring aspects of the coronavirus has been that it largely spares children, only causing mild symptoms.", "url": "https://timesofindia.indiatimes.com/home/science/what-we-know-about-the-covid-related-syndrome-affecting-children/articleshow/75858758.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75858840,width-1070,height-580,imgsize-1166699,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-05-21T03:01:00Z", "content": "NYT: For parents, one of the most reassuring aspects of the coronavirus has been that it largely spares children, only causing mild symptoms. But recent reports of a new life-threatening pediatric inflammatory syndrome are worrying many families. Children in … [+6544 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindustantimes.com | Edited by: Amit Chaturvedi", "title": "50-day lockdown, relaxation for 30 days: British scientists suggest new model to beat Covid-19 - Hindustan Times", "description": "The researchers, however, say that testing, contact tracing and isolation should continue.", "url": "https://www.hindustantimes.com/world-news/50-day-lockdown-relaxation-for-30-days-british-scientists-suggest-new-model-to-beat-covid-19/story-Gv4sUc4rkMGALcJyCGi1nJ.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/21/Pictures/file-photo-covid-spread-disease-york-coronavirus_936ea2c8-9b0b-11ea-9ae4-6c4a5d56c128.jpg", "publishedAt": "2020-05-21T02:42:11Z", "content": "The scientists in Britain have suggested staggered lockdown periods to check the spread of coronavirus disease Covid-19. They say there should be system of working for 30 days and then living under lockdown for another 50 days.\r\nThis cycle is the only way we … [+2042 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "AP", "title": "Coronavirus lockdown: US health officials quietly release more reopening guidance - Deccan Herald", "description": "U.S. health officials have quietly released more reopening guidance that was created more than a month ago but initially shelved. As with other recently released guidance, religious organizations were not included. Instead, the document has advice for childca…", "url": "https://www.deccanherald.com/international/world-news-politics/coronavirus-lockdown-us-health-officials-quietly-release-more-reopening-guidance-840109.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/21/US12-1731471987-1590028538.jpg", "publishedAt": "2020-05-21T02:35:38Z", "content": "U.S. health officials have quietly released more reopening guidance that was created more than a month ago but initially shelved.\r\nAs with other recently released guidance, religious organizations were not included. Instead, the document has advice for childc… [+1878 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Coronavirus LIVE Updates: Global Covid-19 Cases Surpass 5 Million; Mumbai to Get More Ambulances, Live Tracker for Hospital Beds as Infections Rise - News18", "description": "Coronavirus LIVE Updates: The number of active coronavirus cases in Kerala today rose to 177, with 24 more people testing positive, said the state Health Department. Of the 24 new cases, 14 are from those people repatriated from abroad and 10 from other state…", "url": "https://www.news18.com/news/india/coronavirus-live-updates-maharashtra-covid19-mumbai-vaccine-delhi-india-cases-world-deaths-prevention-tips-2629419.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/05/1588874944_kerala.jpg", "publishedAt": "2020-05-21T02:28:22Z", "content": "Almost 1.50 lakh tickets were booked within two hours of opening the bookings for the 100 pairs of passenger trains that the railways will operationalise on June 1, officials said today. On Wednesday, railways issued a list of 100 pairs of trains that it will… [+2173 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Mumbai: India hospital delivers 100 babies from Covid-19 mums - BBC News", "description": "A team of 65 doctors and two dozen nurses have treated mothers infected with coronavirus in India.", "url": "https://www.bbc.co.uk/news/world-asia-india-52693987", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/BB64/production/_112327974_photo-2020-05-16-12-57-10.jpg", "publishedAt": "2020-05-21T02:21:00Z", "content": "Image caption\r\n Doctors have been wearing protective gear in the delivery room\r\nMore than 100 healthy babies have been born to mothers infected with the novel coronavirus in one hospital in India's western city of Mumbai.\r\nThree of the 115 babies born to infe… [+4572 chars]"}, {"source": {"id": null, "name": "Yourstory.com"}, "author": "Anju Ann Mathew", "title": "Coronavirus: A pandemic of anxiety and depression - YourStory", "description": "The pandemic, and the collateral damage it has been causing, is one of the leading sources of stressors today. With no end currently in sight, people's mental health could take a serious blow, experts worry. Mental wellbeing today is as important as physical …", "url": "https://yourstory.com/socialstory/2020/05/coronavirus-pandemic-mental-health-people", "urlToImage": "https://images.yourstory.com/cs/5/98c65090592f11ea9f62339ce853ca75/Imagex9bo-1589984323438.jpg?fm=png&auto=format", "publishedAt": "2020-05-21T01:43:01Z", "content": "These are tough times we live in, where something as simple as a sneeze or a cough elicits fear like nothing ever has before, where venturing out to do grocery shopping feels like stepping into a battlefield, surrounded by a deadly, invisible enemy, and where… [+7557 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Dr. Kamal Kant Kohli", "title": "Recurrent pregnancy loss linked to diabetes, blood sugar monitoring advised - Medical Dialogues", "description": "Women with three or more pregnancy losses must monitor  their blood sugar profile because a new...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/women-pregnancy-loss-blood-sugar-profile-monitored-recurrent-pregnancy-loss-type-2-diabetes-abortion-65949", "urlToImage": "https://medicaldialogues.in/h-upload/2020/02/20/124490-type-2-diabetes-in-women.jpg", "publishedAt": "2020-05-20T23:51:21Z", "content": "Pregnancy loss is a common event, and previous research has linked it with later development of cardiovascular disease and heart failure. But it's effect on blood sugar and development of type 2 diabetes is unknown.\r\nDr Pia Egerup, Copenhagen University Hospi… [+4094 chars]"}, {"source": {"id": null, "name": "Bmj.com"}, "author": null, "title": "Oral fluconazole use in the first trimester and risk of congenital malformations: population based cohort study - The BMJ", "description": "Objective To examine the risk of congenital malformations associated with exposure to oral fluconazole at commonly used doses in the first trimester of pregnancy for the treatment of vulvovaginal candidiasis.\n\nDesign Population based cohort study.\n\nSetting A …", "url": "https://www.bmj.com/content/369/bmj.m1494", "urlToImage": "", "publishedAt": "2020-05-20T22:46:56Z", "content": "Abstract\r\nObjective To examine the risk of congenital malformations associated with exposure to oral fluconazole at commonly used doses in the first trimester of pregnancy for the treatment of vulvovaginal candidiasis.\r\nDesign Population based cohort study.\r\n… [+6556 chars]"}, {"source": {"id": null, "name": "Medicalxpress.com"}, "author": "Science X staff", "title": "Drug combination could eliminate side effects of once-popular diabetes treatment - Medical Xpress", "description": "A new UT Southwestern study shows how an effective but largely abandoned treatment for Type 2 diabetes could be used again in combination with another drug to eliminate problematic side effects.", "url": "https://medicalxpress.com/news/2020-05-drug-combination-side-effects-once-popular.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/drugcombinat.jpg", "publishedAt": "2020-05-20T21:21:27Z", "content": "A new UT Southwestern study shows how an effective but largely abandoned treatment for Type 2 diabetes could be used again in combination with another drug to eliminate problematic side effects.\r\nRosiglitazone, sold under the brand name Avandia, won Food and … [+4140 chars]"}, {"source": {"id": null, "name": "Medscape.com"}, "author": "Sue Hughes", "title": "ACE Inhibitors Protective Against Severe COVID-19? - Medscape", "description": "A randomized trial is planned after a study showed that fewer older hypertensive patients taking ACE inhibitors were hospitalized with COVID-19. A meta-analysis showed no harm with ACE inhibitors or ARBs.", "url": "https://www.medscape.com/viewarticle/930841", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_200520_ace_2_receptors_coronavirus_800x450.jpg", "publishedAt": "2020-05-20T19:51:24Z", "content": "Editor's note: Find the latest COVID-19 news and guidance in Medscape's Coronavirus Resource Center.\r\nA new nationwide US observational study suggests that ACE inhibitors may protect against severe illness in older people with COVID-19, prompting the start of… [+9181 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Special Correspondent", "title": "Coronavirus | Tamil Nadu records 743 new cases, tally surpasses 13,000-mark - The Hindu", "description": "Chennai’s 557 cases take its total to 8,228; 987 patients discharged from hospitals across State.", "url": "https://www.thehindu.com/news/national/tamil-nadu/coronavirus-tamil-nadu-records-743-new-cases-tally-surpasses-13000-mark/article31636617.ece", "urlToImage": "https://www.thehindu.com/news/cities/chennai/74veq/article31578766.ece/ALTERNATES/LANDSCAPE_615/samples", "publishedAt": "2020-05-20T18:47:47Z", "content": "Tamil Nadu saw another sharp rise in the number of COVID-19 cases on Wednesday. A total of 743 persons, including 83 who returned from Maharashtra, tested positive, taking the States tally past the 13,000-mark. This, even as 987 persons were discharged from h… [+2624 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Neetu Chandra Sharma", "title": "Asymptomatic patients less likely to infect others: Govt - Livemint", "description": "Recovery data shows only 3% of the patients who test positive require ICU support, says govt.Govt says cases with mild/moderate symptoms and no fever for 10 days won’t infect others", "url": "https://www.livemint.com/news/india/asymptomatic-patients-less-likely-to-infect-others-govt-11589998055866.html", "urlToImage": "https://images.livemint.com/img/2020/05/20/600x338/5c7753d4-9aaa-11ea-8fb7-c74384469d2b_1589998055514_1589998259493.jpg", "publishedAt": "2020-05-20T18:17:58Z", "content": "NEW DELHI :\r\nPre-symptomatic, mild and moderately symptomatic covid-19 cases who havent had fever for 10 days cannot infect others, the Union health ministry said on Wednesday.The government on 9 May revised the discharge policy for covid-19 patients, indicat… [+3780 chars]"}, {"source": {"id": null, "name": "Gulfnews.com"}, "author": "Reuters", "title": "WHO reports most COVID-19 cases in a day as cases approach 5 million <br/> - Gulf News", "description": "Global health body said 106,000 new cases of infections had been recorded", "url": "https://gulfnews.com/world/europe/who-reports-most-covid-19-cases-in-a-day-as-cases-approach-5-million-1.1589995719914", "urlToImage": "https://imagevars.gulfnews.com/2020/04/16/World-Health-Organization--WHO--Director-General-Tedros-Adhanom-Ghebreyesus_17183a2957a_medium.jpg", "publishedAt": "2020-05-20T17:25:03Z", "content": "World Health Organization (WHO) Director-General Tedros Adhanom Ghebreyesus.\r\n Image Credit: AFP \r\nThe World Health Organization expressed concern on Wednesday about the rising number of new coronavirus cases in poor countries, even as many rich nations have … [+2708 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Scientists in China believe new drug can stop pandemic 'without vaccine' - Arab News", "description": "A Chinese laboratory has been developing a drug it believes has the power to bring the coronavirus pandemic to a halt. - For more Coronavirus stories: https:...", "url": "https://www.youtube.com/watch?v=8GD7Ecc5Eqk", "urlToImage": "https://i.ytimg.com/vi/8GD7Ecc5Eqk/maxresdefault.jpg", "publishedAt": "2020-05-20T16:42:47Z", "content": "A Chinese laboratory has been developing a drug it believes has the power to bring the coronavirus pandemic to a halt.\r\n- For more Coronavirus stories: https://bit.ly/2JrFtBu\r\n- For more videos, visit Arab News: https://bit.ly/2revxCa2- Subscribe to our chann… [+273 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express Web Desk", "title": "Coronavirus (Covid-19) Vaccine Latest Update: Oxford jab fails to stop infection in animal trials; Thailand enters race - The Indian Express", "description": "Coronavirus (Covid-19) Vaccine Latest Update: While the success of Moderna Inc with its Covid-19 vaccine has offered tentative hopes, reports of Oxford's vaccine not being able to prevent infection in monkeys has resulted in equal dejection.", "url": "https://indianexpress.com/article/coronavirus/covid-19-vaccine-latest-updates-6419189/", "urlToImage": "https://images.indianexpress.com/2020/05/britain-covid-vaccine.jpg?w=759", "publishedAt": "2020-05-20T15:28:48Z", "content": "A health worker in full protective gear administers a vaccine to a baby at a community health center in Tangerang, Indonesia. (AP)While the success of US biotechnology company Moderna Inc with its Covid-19 vaccine has offered tentative hopes in the global eff… [+5937 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Rahul Karmakar", "title": "IIT-Guwahati takes ‘Trojan horse’ route to fight Alzheimer’s disease - The Hindu", "description": "Designer peptides to impede aggregation of brain plaque", "url": "https://www.thehindu.com/sci-tech/health/iit-guwahati-takes-trojan-horse-route-to-fight-alzheimers-disease/article31634337.ece", "urlToImage": "https://www.thehindu.com/sci-tech/health/et2imt/article31634336.ece/ALTERNATES/LANDSCAPE_615/21th-peptide", "publishedAt": "2020-05-20T15:08:55Z", "content": "A war trick borrowed from Greek mythology, specifically poet Homers epic Iliad, could help reduce short-term memory losses associated with Alzheimers disease. Researchers at the Indian Institute of Technology-Guwahati (IIT-G) have, after a five-year study, ar… [+2414 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Longjam Dineshwori", "title": "Tingling pain in the hands could be a warning sign of COVID-19 infection - TheHealthSite", "description": "A report has suggested tingling pain in the hands as a warning sign of COVID-19 infection. MP govt has also added anxiety and nausea to symptoms list.", "url": "https://www.thehealthsite.com/diseases-conditions/tingling-pain-in-the-hands-could-be-a-warning-sign-of-covid-19-infection-746488/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2020/04/200416-F-LN908-1031-655x353.jpg", "publishedAt": "2020-05-20T15:04:26Z", "content": "If you feel a subtle tingling pain in your hands, do not ignore it. It could also be a warning sign of COVID-19 infection. The novel coronavirus is known to affect different people in different ways. People infected with the disease reported a wide range of s… [+3974 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Mink might be a COVID-19 intermediate host: Dutch research - CGTN", "description": "Research into COVID-19 infections in the Netherlands showed possible human contamination by a mink, the Dutch Agriculture, Nature and Food Quality announced on Wednesday.", "url": "https://news.cgtn.com/news/2020-05-20/Mink-might-be-a-COVID-19-intermediate-host-Dutch-research-QExPaWxnX2/index.html", "urlToImage": "https://news.cgtn.com/news/2020-05-20/Mink-might-be-a-COVID-19-intermediate-host-Dutch-research-QExPaWxnX2/img/ea580d728a5d4c318331d667e5a4c7c2/ea580d728a5d4c318331d667e5a4c7c2-750.jpeg", "publishedAt": "2020-05-20T14:27:15Z", "content": "Research into COVID-19 infections in the Netherlands showed possible human contamination by a mink, the Dutch Agriculture, Nature and Food Quality announced on Wednesday.\r\nBy the end of April several minks at two mink farms in Gemert-Bakel and Laarbeek in the… [+1068 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "What is the difference between Pandemic and Epidemic - Times of India", "description": "Pandemic and epidemic are two terms most people use interchangeably to refer to stages of the spreading of any infectious disease.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/what-is-the-difference-between-pandemic-and-epidemic/photostory/75849744.cms", "urlToImage": "https://static.toiimg.com/photo/75849968.cms", "publishedAt": "2020-05-20T13:53:22Z", "content": "Although there is a blurred line between epidemic and pandemic, here are a few things that you should know about pandemic:\r\n-It affects a large geographical area, mostly the entire world\r\n-It is generally caused by a new strain of a virus\r\n-The death toll is … [+58 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Coronavirus could 'burn out' on its own before we have a working vaccine: Former WHO chief - Firstpost", "description": "A widely-distributed vaccine, according to many in the medical fraternity, is the only way to immunize those vulnerable, like older adults and those with underlying conditions.", "url": "https://www.firstpost.com/health/coronavirus-could-burn-out-on-its-own-before-we-have-a-working-vaccine-former-who-chief-8387911.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/04/coronavirus-disease-covid-2019-5060522_1280-1.jpg", "publishedAt": "2020-05-20T13:44:38Z", "content": null}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "What pregnant women can do to keep themselves protected from COVID-19 - The News Minute", "description": "With several women apprehensive about visiting hospitals even for their routine check-ups, what can they do to ensure that they have a healthy pregnancy and safe delivery Doctors from Sakra World Hospital in Bengaluru explained in webinar what precautions pre…", "url": "https://www.thenewsminute.com/article/what-pregnant-women-can-do-keep-themselves-protected-covid-19-124948", "urlToImage": "https://www.thenewsminute.com/sites/default/files/Pregnant-woman-rep_1200.jpg", "publishedAt": "2020-05-20T13:44:24Z", "content": "If the doctor recommends a visit in person to the hospital, it is important and should be taken seriously, said a gynaecologist.With several women apprehensive about visiting hospitals even for their routine check-ups, what can they do to ensure that they hav… [+3854 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Farhana Ahmed", "title": "In Northeast India, African Swine Flu Causes an Epidemic Among Pigs - The Wire", "description": "The disease is highly contagious. It has no vaccine, no cure, and has decimated pig populations in East and Southeast Asia.", "url": "https://science.thewire.in/environment/northeast-india-african-swine-flu-pigs/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2020/05/20163500/Screen-Shot-2020-05-20-at-4.31.03-PM.png", "publishedAt": "2020-05-20T12:33:02Z", "content": "Mukti Doley and his three friends covered their faces as they rowed next to Majuli the worlds largest river island on the transboundary Brahmaputra river. The COVID-19 pandemic has made masks a common sight everywhere including in this relatively remote part … [+6721 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Walking or cycling to work may reduce early death risk: Study - Telangana Today", "description": "London: People who walk, cycle and travel by train to work are at reduced risk of early death or illness compared with those who commute by car, according to a new study. For the findings, published in the journal The Lancet Planetary Health, the researchers …", "url": "https://telanganatoday.com/walking-or-cycling-to-work-may-reduce-early-death-risk-study", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2020/05/cycling.jpg", "publishedAt": "2020-05-20T12:08:42Z", "content": "London: People who walk, cycle and travel by train to work are at reduced risk of early death or illness compared with those who commute by car, according to a new study.\r\nFor the findings, published in the journal The Lancet Planetary Health, the researchers… [+2098 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Coronavirus can lead to long-term mental problems, patients may experience PTSD & delirium - Economic Times", "description": "Rates of depression and anxiety may also increase in Covid-19 patients.", "url": "https://economictimes.indiatimes.com/magazines/panache/coronavirus-can-lead-to-long-term-mental-problems-patient-may-experience-ptsd-delirium/articleshow/75843808.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75843919,width-1070,height-580,imgsize-870389,overlay-etpanache/photo.jpg", "publishedAt": "2020-05-20T11:44:00Z", "content": "LONDON: People taken ill by coronavirus infection may experience psychiatric problems such as delirium and post-traumatic stress disorder (PTSD) while hospitalised and potentially even after they recover, according to a study. \r\nThe research, published in The… [+7374 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu", "title": "Diet rich in fruits and vegetables may protect heart health: Study - The Hindu", "description": "The findings were published in the journal ‘Annals of Internal Medicine’", "url": "https://www.thehindu.com/sci-tech/health/diet-rich-in-fruits-and-vegetables-may-protect-heart-health-study/article31632671.ece", "urlToImage": "https://www.thehindu.com/sci-tech/health/wb1tcq/article31632670.ece/ALTERNATES/LANDSCAPE_615/vegetables-10850631920", "publishedAt": "2020-05-20T11:40:59Z", "content": "A diet rich in fruits and vegetables given over a relatively short period of time was associated with significantly lower levels of markers for subclinical cardiac damage and strain in adults without preexisting cardiovascular disease (CVD), say researchers.\r… [+1722 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Excellent finding! Study suggests Coronavirus patients testing positive after recovery can’t infect others - The Financial Express", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiowFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlc3R5bGUvaGVhbHRoL2V4Y2VsbGVudC1maW5kaW5nLXN0dWR5LXN1Z2dlc3RzLWNvcm9uYXZpcnVzLXBhdGllbnRzLXRlc3RpbmctcG9zaXRpdmUtYWZ0ZXItcmVjb3ZlcnktY2FudC1pbmZlY3Qtb3RoZXJzLzE5NjUyMDQv0gGoAWh0dHBzOi8vd3d3LmZpbmFuY2lhbGV4cHJlc3MuY29tL2xpZmVzdHlsZS9oZWFsdGgvZXhjZWxsZW50LWZpbmRpbmctc3R1ZHktc3VnZ2VzdHMtY29yb25hdmlydXMtcGF0aWVudHMtdGVzdGluZy1wb3NpdGl2ZS1hZnRlci1yZWNvdmVyeS1jYW50LWluZmVjdC1vdGhlcnMvMTk2NTIwNC9saXRlLw?oc=5", "urlToImage": null, "publishedAt": "2020-05-20T10:51:32Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "IANS", "title": "Explore New, Diverse Experiences to Boost Happiness - News18", "description": "When people had more variability in their physical location--visiting more locations in a day and spending proportionately equitable time across these locations--they reported feeling more positive.", "url": "https://www.news18.com/news/lifestyle/explore-new-diverse-experiences-to-boost-happiness-2628599.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2018/01/STRESS.jpg", "publishedAt": "2020-05-20T10:09:46Z", "content": "Researchers have found that new and diverse experiences are linked to enhanced happiness, and this relationship is associated with a greater correlation of brain activity.\r\nThe results, published in the journal Nature Neuroscience, reveal a previously unknown… [+2889 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "Diabetic? Tracking sugar level during lockdown matters - Times of India", "description": "Monitoring blood sugar levels daily may help diabetics on a combination of medicines and insulin find if they have any infection including Covid-19,", "url": "https://timesofindia.indiatimes.com/city/chennai/diabetic-tracking-sugar-level-during-lockdown-matters/articleshow/75844477.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75844611,width-1070,height-580,imgsize-183316,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-05-20T09:32:06Z", "content": null}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "Two Servings Of Dairy Products Daily May Lower Risks Of Diabetes, High BP - Study - NDTV Food", "description": "The study had participants from 21 countries (aged between 35 and 70) including India, Bangladesh, Malaysia, Saudi Arabia etc.", "url": "https://food.ndtv.com/news/two-servings-of-dairy-products-daily-may-lower-risks-of-diabetes-high-bp-study-2232112", "urlToImage": "https://i.ndtvimg.com/mt/cooks/2014-09/milk-heart_med.jpg", "publishedAt": "2020-05-20T09:24:05Z", "content": "Participants of the study consumed dairy products like milk, yogurt, yogurt drinks, cheeseMilk and milk products are known to be packed with several nutrients, especially calcium, promoting bone-health. But did you know that they are also linked to managing d… [+1777 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Anushree Gupta", "title": "Coronavirus treatment: Researchers find BP drug, if given in early stages, can reduce COVID-19 mortality risk - Times Now", "description": "Blood pressure drug Prazosin can reduce the risk of cytokine storm - a leading cause of death among COVID-19 patients. Researchers warn that the drug should be given in the early stages of infection.", "url": "https://www.timesnownews.com/health/article/coronavirus-treatment-researchers-find-bp-drug-if-given-in-early-stages-can-reduce-covid-19-mortality-risk/594527", "urlToImage": "https://imgk.timesnownews.com/story/iStock-999970232_0.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-20T07:49:48Z", "content": "<ul><li>Researchers from all over the world are looking for potential treatments, vaccines against the novel coronavirus</li><li>Researchers have recently found that a BP drug, if given early, can reduce risk of death among COVID-19 patients</li><li>The drug,… [+2161 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "ANI", "title": "Covid treatment: HCQ shows some promise, finds Telangana government report - Livemint", "description": "Over 70% of healthcare workers who were administered HCQ on a trial basis reported no onset of symptoms of coronavirus.Hydroxychloroquine or HCQ as it is commonly called is an anti-malarial drug that is also used to treat other autoimmune diseases", "url": "https://www.livemint.com/news/india/covid-treatment-hcq-shows-some-promise-finds-telangana-government-report-11589957584026.html", "urlToImage": "https://images.livemint.com/img/2020/05/20/600x338/1c1e5d2e888c489882045d1779d1492e-1c1e5d2e888c489882045d1779d1492e-1_1587702462827_1589959044193.jpg", "publishedAt": "2020-05-20T07:18:09Z", "content": "An interim report prepared by the Telangana government has yielded promising results on the efficacy of prophylactic use of Hydroxychloroquine or HCQ, as it is popularly known, on preventing COVID-19 in frontline medical workers in the state.Over 70 per cent … [+4052 chars]"}, {"source": {"id": null, "name": "Theweek.in"}, "author": null, "title": "Smokers far more likely to develop COVID-19 complications - THE WEEK", "description": "Smoking increases SARS-CoV-2 receptors in the lung, making them more vulnerable", "url": "https://www.theweek.in/news/health/2020/05/20/Smokers-far-more-likely-to-develop-COVID-19-complications.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/sci-tech/2018/january/girl-smoking-smoke-mouth-shut.jpg", "publishedAt": "2020-05-20T06:19:14Z", "content": "Latest findings by scientists from Cold Spring Harbor Laboratory (CSHL) may explain why smokers are at a higher risk of contracting fatal diseases such as COVID-19.\r\nThe New study, reported in the journal Developmental Cell, suggests that cigarette smoke spur… [+2533 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Anushree Gupta", "title": "Cannabis for COVID-19: Canadian research claims extracts from the psychoactive drug could fight coronavirus - Times Now", "description": "The study found that extracts from cannabis can affect the ACE-2 receptors in the host cells. ACE2 receptors are proteins that have been found to be the \"entry points\" for coronavirus in the host's body.", "url": "https://www.timesnownews.com/health/article/cannabis-for-covid-19-canadian-research-claims-extracts-from-the-psychoactive-drug-could-fight-coronavirus/594455", "urlToImage": "https://imgk.timesnownews.com/story/iStock-647243062.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-20T06:06:13Z", "content": "<ul><li>The coronavirus pandemic has been plaguing the world for months now</li><li>Researchers from all over the world are looking for effective treatments against the novel coronavirus </li><li>A team of researchers from Canada has found that extracts from … [+2267 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "World Autoimmune Arthritis Day 2020: All you need to know about autoimmune arthritis diseases - Firstpost", "description": "About 50% of people with an autoimmune arthritis disease don’t get a proper diagnosis or are diagnosed with an undifferentiated disease.", "url": "https://www.firstpost.com/health/world-autoimmune-arthritis-day-2020-all-you-need-to-know-about-autoimmune-arthritis-diseases-8386551.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2019/10/knee-2768834_1280.jpg", "publishedAt": "2020-05-20T06:05:53Z", "content": null}, {"source": {"id": null, "name": "Deccanchronicle.com"}, "author": "Balu Pulipaka", "title": "Virus in India diverging from the one originated in Wuhan, scientists say - Deccan Chronicle", "description": "Scientists caution that low testing rate minimal genome submissions are major bottlenecks in the assessment of the evolution of SARS-CoV-2", "url": "https://www.deccanchronicle.com/science/science/200520/virus-in-india-diverging-from-the-one-originated-in-wuhan-scientists.html", "urlToImage": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-p7gblobppvmu7vlufl9hmuc851-20200520112028.Medi.jpeg", "publishedAt": "2020-05-20T05:53:00Z", "content": "Hyderabad: A group of Indian scientists who have been working on understanding changes happening to the Coronavirus that causes Covid-19 has found that some structures of the virus are undergoing changes that show that the virus, in India, is diverging from t… [+3000 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Ontario and Atlantic Canada had the largest spike in anxiety, depression since pandemic began: survey - CTV News", "description": "A new survey looking into how Canadians' mental health has changed since the start of the pandemic has revealed that Ontario and Atlantic Canada have experienced the largest spike in anxiety and depression, and that high levels of anxiety have quadrupled nati…", "url": "https://www.ctvnews.ca/health/coronavirus/ontario-and-atlantic-canada-had-the-largest-spike-in-anxiety-depression-since-pandemic-began-survey-1.4946022", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4919761.1588288491!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2020-05-20T02:14:16Z", "content": "TORONTO -- \r\nA new survey looking into how Canadians mental health has changed since the start of the pandemic has revealed that Ontario and Atlantic Canada have experienced the largest spike in anxiety and depression.\r\nAcross all provinces, the number of peo… [+9821 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "IANS", "title": "Here’s why psychological impact of COVID-19 is higher on ophthalmologists - Times Now", "description": "An online study was conducted to evaluate the psychological impact of the Covid-19 crisis on trainees and practising ophthalmologists in India during the lockdown.", "url": "https://www.timesnownews.com/health/article/here-s-why-psychological-impact-of-covid-19-is-higher-on-ophthalmologists/594360", "urlToImage": "https://imgk.timesnownews.com/story/opthalm.gif?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-20T01:54:39Z", "content": "Hyderabad: The psychological impact of Covid-19 is higher on ophthalmologists as they are at an increased risk of close contact with the patient's eyes and face, reveals a study.\r\nThe LV Prasad Eye Institute (LVPEI), Hyderabad, in collaboration with the All I… [+3980 chars]"}, {"source": {"id": null, "name": "Mother.ly"}, "author": "Heather Marcoux", "title": "Multiples: Texas Couple Brings Home Identical Quadruplets - Motherly Inc.", "description": "The last few months have been shocking for Jenny, who delivered four boys by C-section and has no history of multiples in her family.", "url": "https://www.mother.ly/news/pandemic-quadruplets", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vd3d3Lm1vdGhlci5seS9tZWRpYS1saWJyYXJ5L2V5SmhiR2NpT2lKSVV6STFOaUlzSW5SNWNDSTZJa3BYVkNKOS5leUpwYldGblpTSTZJbWgwZEhCek9pOHZZWE56WlhSekxuSmliQzV0Y3k4eU16STVNRGd3TXk5dmNtbG5hVzR1YW5Cbklpd2laWGh3YVhKbGMxOWhkQ0k2TVRZek1EQTNOREV6T0gwLjJvLVJoVXFPMWFXak02bzJXaHdselMwTjZFMTdBSjhkYnBBdy02S1FiRXMvaW1hZ2UuanBnP3dpZHRoPTEyMDAmY29vcmRpbmF0ZXM9MCUyQzMxJTJDMCUyQzQ4MSZoZWlnaHQ9NjAwIiwiZXhwaXJlc19hdCI6MTY1MjU5OTIwNH0.0oWj8CKu0LgvFlIkg9oK7v7PVciKLXJcw-J4MfdeWSc/img.jpg?width=2000&height=2000", "publishedAt": "2020-05-19T21:21:46Z", "content": "For many parents deciding how many children to have isn't an easy one. Mama of three Kate Hudson welcomed her baby girl Rani Rose in 2018 and has two older sons, 16-year-old Ryder Russell and 8-year-old Bingham Hawn. Her family is beautiful, but it may not be… [+1994 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Special Correspondent", "title": "Psychological impact of pandemic high on ophthalmologists: study - The Hindu", "description": "LVPEI survey covered 2,355 ophthalmologists and trainees in the 25-82 age group", "url": "https://www.thehindu.com/news/cities/Hyderabad/psychological-impact-of-pandemic-high-on-ophthalmologists-study/article31626676.ece", "urlToImage": "https://www.thehindu.com/news/cities/Hyderabad/i2f6tx/article31626685.ece/ALTERNATES/LANDSCAPE_615/HY19-SAROJINIDEVIEYEHOSPITAL", "publishedAt": "2020-05-19T17:27:22Z", "content": "A high proportion of ophthalmologists were affected psychologically across the country during the ongoing lockdown as they are at an increased risk of close contact with the patients eyes and face, according to an online study conducted by L.V. Prasad Eye Ins… [+2165 chars]"}, {"source": {"id": null, "name": "Eetindia.co.in"}, "author": null, "title": "Ashwagandha Takes Lead in IIT-Delhi Study to be COVID-19 Warrior - EE Times India", "description": "IIT-Delhi collaborated with Japan's AIST in a study that discovered that Ashwagandha compound may be efficietive anti-Covid-19 drug...", "url": "https://www.eetindia.co.in/ashwagandha-takes-lead-in-iit-delhi-study-to-be-covid-19-warrior/", "urlToImage": "https://www.eetindia.co.in/wp-content/uploads/sites/4/2020/05/COVID-19-test.jpg", "publishedAt": "2020-05-19T16:36:04Z", "content": "Article By : Umashankar Mishra \r\nIIT-Delhi collaborated with Japan's AIST in a study that discovered that Ashwagandha compound may be efficietive anti-Covid-19 drug...\r\nRemdesivir, Hydroxychloroquine, Lopinavir, Ritonavir, APN01 or Favilavir are being tested … [+4099 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus impact on dental practices - FOX 2 St. Louis", "description": "Barbara McClatchie, a dentist with Complete Health Dentistry and an advisor to ProBioraHealth, tells us patients should expect a vastly new experience", "url": "https://www.youtube.com/watch?v=OtduoJqUizQ", "urlToImage": "https://i.ytimg.com/vi/OtduoJqUizQ/maxresdefault.jpg", "publishedAt": "2020-05-19T15:03:42Z", "content": "Barbara McClatchie, a dentist with Complete Health Dentistry and an advisor to ProBioraHealth, tells us patients should expect a vastly new experience"}]}