{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Children with Coronavirus May Threaten World's Ability to Reopen - Bloomberg QuickTake", "description": "Children with Covid-19 threaten recovery from the pandemic -- sparking increased scrutiny of their cases from scientists and policy makers seeking clues abou...", "url": "https://www.youtube.com/watch?v=6BKjSqyIQT4", "urlToImage": "https://i.ytimg.com/vi/6BKjSqyIQT4/maxresdefault.jpg", "publishedAt": "2020-05-08T18:30:41Z", "content": null}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Explained Desk", "title": "What is coronavirus pandemic, and how it spread across the world - The Indian Express", "description": "Coronavirus Pandemic, Covid-19 Symptoms, Precautions, Vaccine, Medicine, Cases in India and World: Here's how the novel coronavirus pandemic started and a summary of the biggest developments in the novel coronavirus outbreak.", "url": "https://indianexpress.com/article/explained/what-is-the-coronavirus-pandemic-and-how-it-spread-across-the-world-6397912/", "urlToImage": "https://images.indianexpress.com/2020/05/covid-explained.jpg?w=759", "publishedAt": "2020-05-08T18:23:39Z", "content": "Coronavirus (Covid-19) cases, symptoms, precautions: The United States is at the top of the list in coronavirus infections and deaths that stand at 1,256,972 and 75,670 respectively.Coronavirus (Covid-19) cases, symptoms, precautions: For the last few months,… [+16059 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Rita Sobot", "title": "Spain detects first coronavirus case in pet cat after family members struck down - Mirror Online", "description": "The four-year-old cat didn't die of coronavirus, but it's the first case of its kind in the country where more than 26,000 people have now died from the disease", "url": "https://www.mirror.co.uk/news/world-news/spain-detects-first-coronavirus-case-21996119", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21996135.ece/ALTERNATES/s1200/0_Cute-ginger-cat-lies-on-womans-hands-The-fluffy-pet-comfortably-settled-to-sleep-or-to-play-Cute.jpg", "publishedAt": "2020-05-08T18:22:07Z", "content": "Scientists say a cat which had to be put down in Spain showed signs of Covid-19 but did not die from the deadly virus. \r\nThis is the first case of its kind in the country where more than 26,000 people have now died from the virus. \r\nResearchers from the Anima… [+2057 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Special Correspondent", "title": "Bharat Biotech to lead human monoclonal antibodies project - The Hindu", "description": "COVID-19 therapy plan gets nod from CSIR", "url": "https://www.thehindu.com/news/cities/Hyderabad/bharat-biotech-to-lead-human-monoclonal-antibodies-project/article31538128.ece", "urlToImage": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg", "publishedAt": "2020-05-08T17:40:42Z", "content": "A project sanctioned by the Council of Scientific and Industrial Research (CSIR) to develop human monoclonal antibodies as therapy for COVID-19 infections will be led by Bharat Biotech. \r\nAnnouncing this on Friday, the Hyderabad-based vaccine manufacturer sai… [+2008 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Suchitra Karthikeyan", "title": "WHO concedes Wuhan market had clear role in virus outbreak as China agrees to probe - Republic World - Republic World", "description": "In a massive development, WHO scientist Dr. Peter Ben Embarek, on Friday, stated that the Wuhan market had role in virus outbreak, but more research is needed.", "url": "https://www.republicworld.com/world-news/global-event-news/who-concedes-wuhan-market-had-clear-role-in-virus-outbreak.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/ghz1ekikzz7cklrs_1588956950.jpeg?tr=f-jpeg", "publishedAt": "2020-05-08T17:08:05Z", "content": "In a massive development, WHO scientist Dr. Peter Ben Embarek, on Friday, stated that the Wuhan market had role in virus outbreak, but more research is needed. Dr. Embarek - who is a WHO expert on food safety and zoonotic viruses, has stated that while the ro… [+2244 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NYC launches virus contract tracing corps - Associated Press", "description": "New York City announced Friday it is launching a contact tracing corps to identify and treat people infected with the new coronavirus and prevent spread. (Ma...", "url": "https://www.youtube.com/watch?v=IOEw7lcnEBI", "urlToImage": "https://i.ytimg.com/vi/IOEw7lcnEBI/maxresdefault.jpg", "publishedAt": "2020-05-08T17:04:27Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What do studies on new coronavirus mutations tell us? - Arab News", "description": "A series of studies of the genomes of thousands of samples of the new coronavirus SARS-CoV-2 show that it is mutating and evolving as it adapts to its human ...", "url": "https://www.youtube.com/watch?v=Sic0VMNEFcE", "urlToImage": "https://i.ytimg.com/vi/Sic0VMNEFcE/hqdefault.jpg", "publishedAt": "2020-05-08T16:57:54Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Antibiotic resistance may rise after COVID-19, as doctors struggle to treat secondary infections - CBS News", "description": "Doctors around the world are struggling to cure secondary illnesses patients contracted while battling coronavirus. Wired contributor Maryn McKenna joined CB...", "url": "https://www.youtube.com/watch?v=rvYekgNZhCo", "urlToImage": "https://i.ytimg.com/vi/rvYekgNZhCo/maxresdefault.jpg", "publishedAt": "2020-05-08T16:52:06Z", "content": "Doctors around the world are struggling to cure secondary illnesses patients contracted while battling coronavirus. Wired contributor Maryn McKenna joined CBSN to explain why this may contribute to the already growing problem of antibiotic resistance and what… [+29 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "This is how often you need to replace your kitchen sponge - Times of India", "description": "From cleaning that grease on your utensils, scrubbing tiles to cleaning the oven door and spills on the microwave,", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/this-is-how-often-you-need-to-replace-your-kitchen-sponge/articleshow/75627954.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75627954,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-784998/75627954.jpg", "publishedAt": "2020-05-08T16:32:57Z", "content": "From cleaning that grease on your utensils, scrubbing tiles to cleaning the oven door and spills on the microwave, we use a kitchen sponge to clean a lot of mess in the kitchen. It's cheap, convenient and easy to use. But because we use it so much every day, … [+1746 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Vitamin D Linked to Low Coronavirus Death Rate - SciTechDaily", "description": "New COVID-19 research finds relationship in data from 20 European countries. A new study has found an association between low average levels of vitamin D and high numbers of COVID-19 cases and mortality rates across 20 European countries. The research, led by…", "url": "https://scitechdaily.com/vitamin-d-linked-to-low-coronavirus-death-rate/", "urlToImage": "https://scitechdaily.com/images/Vitamin-D-Supplement-Sunshine.jpg", "publishedAt": "2020-05-08T16:02:01Z", "content": "People get vitamin D from sun exposure, foods (such as fatty fish, beef liver, cheese, and egg yolks), and supplements.\r\nNew COVID-19 research finds relationship in data from 20 European countries.\r\nA new study has found an association between low average lev… [+2820 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How Scientists Are Using Baker's Yeast to Develop a Coronavirus Vaccine | Mashable - Mashable", "description": "While scientists are desperately looking for COVID-19 treatments and vaccines, common baker's yeast has proven to be an unexpected, yet valuable resource in ...", "url": "https://www.youtube.com/watch?v=ohe9tKUAVq4", "urlToImage": "https://i.ytimg.com/vi/ohe9tKUAVq4/maxresdefault.jpg", "publishedAt": "2020-05-08T16:00:36Z", "content": "While scientists are desperately looking for COVID-19 treatments and vaccines, common baker's yeast has proven to be an unexpected, yet valuable resource in the fight against coronavirus.\r\nMashable is your source for the latest in tech, culture, and entertain… [+223 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Nupur Amarnath", "title": "Can you quick fix your anxiety? - Times of India", "description": "Now that we are sitting indoors, fighting the good fight for our generation, this is a time to try and flatten the other curve: the looming mental health crisis.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/de-stress/can-you-quick-fix-your-anxiety/photostory/75628935.cms", "urlToImage": "https://static.toiimg.com/photo/75629328.cms", "publishedAt": "2020-05-08T15:30:00Z", "content": "One of the basic quick fixes of anxiety is conscious deep breathing. Mittal says, “This technique sounds too simple to be effective, but it works.” Sit or lie down in a comfortable position with your eyes closed, taking a deep breath in through your nose, bre… [+300 chars]"}, {"source": {"id": null, "name": "Fda.gov"}, "author": "Office of the Commissioner", "title": "Coronavirus (COVID-19) Update: FDA Authorizes First Diagnostic Test Using At-Home Collection of Saliva Specimens - FDA.gov", "description": "Today, the U.S. Food and Drug Administration authorized the first diagnostic test with the option of using home-collected saliva samples for COVID-19 testing", "url": "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-first-diagnostic-test-using-home-collection-saliva", "urlToImage": "https://www.fda.gov/themes/custom/preview/img/FDA-Social-Graphic.png", "publishedAt": "2020-05-08T15:30:00Z", "content": "For Immediate Release:\r\nMay 08, 2020\r\nToday, the U.S. Food and Drug Administration authorized the first diagnostic test with the option of using home-collected saliva samples for COVID-19 testing. Specifically, the FDA issued an emergency use authorization (E… [+2719 chars]"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "meaghanwray", "title": "Man discovers he has 3 kidneys after going to doctor for lower back pain - Global News", "description": "Fewer than 100 cases of having a third kidney have been reported in medical literature.", "url": "http://globalnews.ca/news/6920351/man-finds-third-kidney-back-pain/", "urlToImage": "https://shawglobalnews.files.wordpress.com/2020/05/gettyimages-960898000.jpg?quality=70&strip=all&w=720&h=379&crop=1", "publishedAt": "2020-05-08T15:24:11Z", "content": "One Brazilian man’s lower back pain turned out to reveal his third kidney.\r\nThe 38-year-old took himself to the Hospital do Rim in São Paulo with severe back pain. Doctors performed a CT scan, according to a report published Wednesday in the New England Journ… [+1869 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Father of young boy with life-threatening mysterious illness speaks out - Good Morning America", "description": "Jayden Hardowar, 8, is off a ventilator and recovering after he showed symptoms similar to Kawasaki disease, the rare illness possibly linked to coronavirus....", "url": "https://www.youtube.com/watch?v=zxOr9WKF4dQ", "urlToImage": "https://i.ytimg.com/vi/zxOr9WKF4dQ/maxresdefault.jpg", "publishedAt": "2020-05-08T14:50:12Z", "content": "Jayden Hardowar, 8, is off a ventilator and recovering after he showed symptoms similar to Kawasaki disease, the rare illness possibly linked to coronavirus.READ MORE: https://abcn.ws/2YKT2ot\r\nSubscribe to GMA's YouTube page: https://bit.ly/2Zq0dU5\r\nVisit Goo… [+344 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Jimmy McCloskey", "title": "Coronavirus patient, 43, dies after being given experimental plasma treatment - Metro.co.uk", "description": "Married dad of two Scott Kaplan appeared to be improving after the treatment, but ended up dying after suffering two strokes", "url": "https://metro.co.uk/2020/05/08/coronavirus-patient-43-dies-experimental-plasma-treatment-12674699/", "urlToImage": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2020/05/comp-1588945863_1588946440.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "publishedAt": "2020-05-08T14:22:34Z", "content": "Coronavirus patient Scott Kaplan, pictured on the right with his wife and sons, died even after being given an experimental convalescent plasma treatment (Pictures: KDVR)\r\nA 43 year-old coronavirus sufferer was killed by the disease even after receiving an ex… [+2546 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "EU leaders pledge support for initiative to raise US$8.1b for COVID-19 vaccine - CNA", "description": "European leaders have pledged support for an initiative from Brussels to find a vaccine for COVID-19. A new fund aims to raise 7.5 billion euros or about US$...", "url": "https://www.youtube.com/watch?v=8Ky_GSydUiI", "urlToImage": "https://i.ytimg.com/vi/8Ky_GSydUiI/maxresdefault.jpg", "publishedAt": "2020-05-08T14:16:49Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India | Posted by: Harshita Singh", "title": "Mandatory BCG vaccination may make Covid-19 less virulent in India: Study - Hindustan Times", "description": "The bacille Calmette-Gurin (BCG) vaccine has a documented protective effect against meningitis and disseminated TB in children, according to the World Health Organisation.", "url": "https://www.hindustantimes.com/india-news/mandatory-bcg-vaccination-may-make-covid-19-less-virulent-in-india-study/story-iMvOo11WpAomquZMBi4jRP.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/08/Pictures/vaccin-bcg_b6fd0cc0-9133-11ea-b214-efce58d4f976.jpg", "publishedAt": "2020-05-08T14:06:52Z", "content": "After scanning Covid-19 data of 29 countries across the world, a group of city-based researchers has suggested that factors such as BCG vaccination in developing nations like India have led to a situation where the rate of contamination and fatality from the … [+3435 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Lifestyle Desk", "title": "How diabetics can manage stress during lockdown to control blood sugar levels - The Indian Express", "description": "If your blood sugar levels are not under control, make sure to consult your doctor without delay.", "url": "https://indianexpress.com/article/lifestyle/health/how-diabetics-can-manage-stress-to-control-sugar-levels-lockdown-covid-19-6400326/", "urlToImage": "https://images.indianexpress.com/2020/05/stress-759.jpg?w=759", "publishedAt": "2020-05-08T13:00:33Z", "content": "Stress can increase blood sugar levels. (Source: getty images)One of the things diabetics are most worried about these days is whether they are more prone to the coronavirus infection. But evidence has shown that as long as diabetics keep their blood sugar le… [+3782 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "World Thalassemia Day 2020: More than 10,000 children born in India every year with Thalassemia - The Financial Express", "description": "There is only one cure for Thalassemia major at present, which is a bone marrow transplant with a suitable donor.", "url": "https://www.financialexpress.com/lifestyle/health/world-thalassemia-day-2020-more-than-10000-children-born-in-india-every-year-with-thalassemia/1952626/", "urlToImage": "https://images.financialexpress.com/2020/05/1-158.jpg", "publishedAt": "2020-05-08T12:34:53Z", "content": "Dr. Vikas Dua and Dr Mansi Sachdev\r\nWorld Thalassemia Day: Thalassemia is an inherited blood disorder (passed down from parents). Under this condition, the body makes an abnormal form and inadequate amount of hemoglobin. The disorder results in destruction of… [+2893 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "IANS", "title": "Coronavirus: Hotter, humid weather may not stop COVID-19, says study - Livemint", "description": "The study looked at 144 geopolitical areas and found little or no association between latitude or temperature with epidemic growth of COVID-19 and a weak association between humidity and reduced transmission", "url": "https://www.livemint.com/news/india/coronavirus-hotter-humid-weather-may-not-stop-covid-19-says-study-11588938178090.html", "urlToImage": "https://images.livemint.com/img/2020/05/08/600x338/AFP_1R36IG_1588895056631_1588941139487.jpg", "publishedAt": "2020-05-08T12:34:47Z", "content": "TORONTO :\r\ncoronavirus, coronavirus pandemic, temperature, humid weather, COVID-19 disease, coronavirus transmission, Canadian Medical Association Journal, Donald TrumpTemperature and latitude are not associated with the spread of the COVID-19 disease, say re… [+3161 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "IANS", "title": "Hot, Humid Weather Unlikely to Slow Down Coronavirus Transmission: Study - The Weather Channel", "description": "The researchers did find that public health measures, including school closures, social distancing and restrictions of large gatherings, have been effective.", "url": "https://weather.com/en-IN/india/coronavirus/news/2020-05-08-hot-humid-weather-unlikely-slow-down-coronavirus-transmission", "urlToImage": "https://s.w-x.co/in-heat_20.jpg", "publishedAt": "2020-05-08T12:26:03Z", "content": "File photo: People stand in scorching heat at a food distribution centre during the nationwide lockdown in New Delhi, India\r\n(Piyal Bhattacharjee/TOI, Delhi, BCCL\r\n)\r\nTemperature and latitude are not associated with the spread of COVID-19, say researchers, ad… [+3007 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Mohana Basu", "title": "Scientists develop sensor that can help smartphones detect coronavirus in 60 seconds - ThePrint", "description": "Low vitamin D levels linked to higher deaths and a dialysis device that gives white blood cells a fighting edge, ThePrint brings you the latest on Covid-19.", "url": "https://theprint.in/health/scientists-develop-sensor-that-can-help-smartphones-detect-coronavirus-in-60-seconds/417100/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/corr.jpg", "publishedAt": "2020-05-08T11:10:14Z", "content": "New Delhi: The coronavirus pandemic has driven scientists around the world to find new ways of fighting Covid-19, even as understanding about the virus evolves every day.\r\nHere are some of the latest scientific developments in the fight against SARS-CoV-2.\r\nS… [+5593 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mystery illness, potentially related to COVID-19, impacts children - WBIR Channel 10", "description": "Growing concerns as new cases of a mystery illness believed to be linked to COVID-19 infects dozens of children in the U.S. and Europe.", "url": "https://www.youtube.com/watch?v=5gArc1EvS7U", "urlToImage": "https://i.ytimg.com/vi/5gArc1EvS7U/hqdefault.jpg", "publishedAt": "2020-05-08T10:50:10Z", "content": "Growing concerns as new cases of a mystery illness believed to be linked to COVID-19 infects dozens of children in the U.S. and Europe."}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "IANS", "title": "Facebook, YouTube, Twitter struggle to remove pandemic conspiracy video - The Hindu", "description": "The 26-minute video features a famous vaccine conspiracist who defies the advice of medical experts like saying that “sheltering in place harms consumers’ immune systems and that masks can make people sicker”", "url": "https://www.thehindu.com/sci-tech/technology/internet/facebook-youtube-twitter-struggle-to-remove-pandemic-conspiracy-video/article31534247.ece", "urlToImage": "https://www.thehindu.com/sci-tech/technology/internet/m9fw0z/article31534246.ece/ALTERNATES/LANDSCAPE_615/08NETFBGOOGLETWITTER", "publishedAt": "2020-05-08T10:32:02Z", "content": "Social media platforms like Facebook, YouTube and Twitter are finding it difficult to remove a Coronavirus conspiracy video called Plandemic that has spread faster that the virus and can still be accessed on these platforms.\r\nThe 26-minute video features a fa… [+1387 chars]"}, {"source": {"id": null, "name": "Kalingatv.com"}, "author": "IANS", "title": "Hotter and humid weather may not stop COVID-19 - Kalinga TV", "description": "Toronto: Temperature and latitude are not associated with the spread of the COVID-19 disease, say researchers, adding that they found a weak association between humidity and reduced transmission.The results -- that hotter weather had no effect on the", "url": "https://kalingatv.com/miscellany/hotter-and-humid-weather-may-not-stop-covid-19/", "urlToImage": "https://cdn.kalingatv.com/wp-content/uploads/2020/04/coronavirus-AFEW-International-1.jpg", "publishedAt": "2020-05-08T10:19:00Z", "content": "Toronto: Temperature and latitude are not associated with the spread of the COVID-19 disease, say researchers, adding that they found a weak association between humidity and reduced transmission.\r\nThe results — that hotter weather had no effect on the pandemi… [+2875 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Times Now Digital", "title": "Coronavirus found in semen of infected men – can it be sexually transmitted? - Times Now", "description": "Since the COVID-19 outbreak started, scientists and doctors have been stressing that while the coronavirus can be spread by kissing, it may not be a sexually transmittable virus.", "url": "https://www.timesnownews.com/health/article/coronavirus-found-in-semen-of-infected-men-can-it-be-sexually-transmitted/588959", "urlToImage": "https://imgk.timesnownews.com/story/coronavirus_i_stock_alert.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-08T10:18:18Z", "content": "<ul><li>Chinese scientists say that the novel coronavirus can persist in semen of infected men even after they have started to recover from COVID-19</li><li>A team of researchers had tested 38 male coronavirus patients at Shangqiu Municipal Hospital when the … [+2680 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Duke University looking out for rare pediatric syndrome that could be linked to COVID-19 - CBS 17", "description": "There have been dozens of cases reported in New York already.", "url": "https://www.youtube.com/watch?v=NNu66fiUfRI", "urlToImage": "https://i.ytimg.com/vi/NNu66fiUfRI/maxresdefault.jpg", "publishedAt": "2020-05-08T09:57:07Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Public health emphasis centers on testing, contact tracing - 11Alive", "description": "Georgia officials are prioritizing the measures as the next step in the state's reopening process.", "url": "https://www.youtube.com/watch?v=dpnPC8BEsyA", "urlToImage": "https://i.ytimg.com/vi/dpnPC8BEsyA/hqdefault.jpg", "publishedAt": "2020-05-08T09:54:23Z", "content": null}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "Nishant Sharma", "title": "Are India’s Private Labs Overcharging For Covid-19 Tests? - BloombergQuint", "description": "The pricing of the RT-PCR tests being conducted by private labs has kicked off a debate.", "url": "https://www.bloombergquint.com/business/are-indias-private-labs-overcharging-for-covid-19-tests", "urlToImage": "https://images.assettype.com/bloombergquint%2F2020-05%2Fb60b05e1-dd21-47ba-ab8b-5a71bd725511%2F361805276.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-05-08T09:54:05Z", "content": ""}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Route of infection: Researchers say eyes could be important entry point for virus - euronews (in English)", "description": "Researchers in Hong Kong say the coronavirus could enter a patient through their eyes. They're now recommending that people include protective glasses as par...", "url": "https://www.youtube.com/watch?v=mK9oFuXyweg", "urlToImage": "https://i.ytimg.com/vi/mK9oFuXyweg/hqdefault.jpg", "publishedAt": "2020-05-08T09:50:01Z", "content": null}, {"source": {"id": null, "name": "Oneindia.com"}, "author": "Simran Kashyap", "title": "What is ‘silent hypoxia’ that can prove deadly for Coronavirus patients - Oneindia", "description": "Hypoxia is a condition in which the body or a region of the body is deprived of adequate oxygen supply at the tissue level. It is a condition in which the body's oxygen concentration levels drop below 60 per cent in patients infected with the coronavirus.", "url": "https://www.oneindia.com/india/what-is-silent-hypoxia-that-can-prove-deadly-for-coronavirus-patients-3085161.html", "urlToImage": "https://www.oneindia.com/img/2020/05/xcoronavirus832-1586958260-1588668194-jpg-pagespeed-ic-lnndj5ptof-1588930694.jpg", "publishedAt": "2020-05-08T09:40:19Z", "content": "New Delhi, May 08: Many patients are now arriving at the hospital with oxygen percentage levels in the 80s or 70s and some have even had levels below 50 per cent. The condition is known as 'Silent Hypoxia'.\r\nIt is a condition in which the body's oxygen concen… [+1727 chars]"}, {"source": {"id": null, "name": "Medicalxpress.com"}, "author": "Cedric Ricks", "title": "By the third day most with COVID-19 lose sense of smell - Medical Xpress", "description": "A University of Cincinnati researcher says a study of COVID-19 patients shows loss of the sense of smell is most likely to occur by the third day of infection with the novel virus. Most of these patients are also experiencing a loss of the sense of taste.", "url": "https://medicalxpress.com/news/2020-05-day-covid-.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/bythethirdda.jpg", "publishedAt": "2020-05-08T08:44:09Z", "content": "A University of Cincinnati researcher says a study of COVID-19 patients shows loss of the sense of smell is most likely to occur by the third day of infection with the novel virus. Most of these patients are also experiencing a loss of the sense of taste.\r\nTh… [+4746 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Coronavirus pandemic: Hotter, humid weather not effective; social distancing checks COVID 19, reveals study - The Financial Express", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiogFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlc3R5bGUvaGVhbHRoL2Nvcm9uYXZpcnVzLXBhbmRlbWljLWhvdHRlci1odW1pZC13ZWF0aGVyLW5vdC1lZmZlY3RpdmUtc29jaWFsLWRpc3RhbmNpbmctY2hlY2tzLWNvdmlkLTE5LXJldmVhbHMtc3R1ZHkvMTk1MjI2Ny_SAacBaHR0cHM6Ly93d3cuZmluYW5jaWFsZXhwcmVzcy5jb20vbGlmZXN0eWxlL2hlYWx0aC9jb3JvbmF2aXJ1cy1wYW5kZW1pYy1ob3R0ZXItaHVtaWQtd2VhdGhlci1ub3QtZWZmZWN0aXZlLXNvY2lhbC1kaXN0YW5jaW5nLWNoZWNrcy1jb3ZpZC0xOS1yZXZlYWxzLXN0dWR5LzE5NTIyNjcvbGl0ZS8?oc=5", "urlToImage": null, "publishedAt": "2020-05-08T08:30:54Z", "content": null}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Coronavirus lockdown: Despondency in adults can quickly spread to their children in times like these,... - Firstpost", "description": "The mix of information and misinformation, and exaggerated fears of the situation, result in symptoms of anxiety of various kinds depending on the age of the child, warns child and adolescent psychiatrist Dr Amit Sen.", "url": "https://www.firstpost.com/health/coronavirus-lockdown-despondency-in-adults-can-quickly-spread-to-their-children-in-times-like-these-warns-child-psychiatrist-8346251.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/05/1280-AMIT.jpg", "publishedAt": "2020-05-08T08:05:47Z", "content": null}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Touted by Trump for coronavirus, hydroxychloroquine fails another test - India Today", "description": "In a new study, doctors have reported that use of hydroxycholoquine neither lessened the need for patients requiring breathing assistance nor the risk of death.", "url": "https://www.indiatoday.in/science/story/hydroxychloriquine-fails-another-test-coronavirus-research-1675701-2020-05-08", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/2020-04-22T000000Z_1179955418_-647x363.png?_mmYjWKh.MAJtJULyXmDzYVwtjlZgV7w", "publishedAt": "2020-05-08T07:52:30Z", "content": "The malaria treatment repeatedly championed by U.S. President Donald Trump as a \"game changer\" in the fight against the novel coronavirus has again failed to show a benefit in patients hospitalised with Covid-19, according to a study released on Thursday.\r\nWh… [+2868 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Chinese Drugmaker in Talks to Test Coronavirus Vaccine Globally - Bloomberg", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=98fc9ea0-915d-11ea-804e-9520c17efefa&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNS0wOC9jaGluZXNlLWRydWdtYWtlci1pbi10YWxrcy10by10ZXN0LWNvcm9uYXZpcnVzLXZhY2NpbmUtZ2xvYmFsbHk=", "urlToImage": null, "publishedAt": "2020-05-08T06:58:21Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": null, "title": "Most Covid patients may lose sense of smell by third day of infection: Study - Top Live News", "description": "Loss of the sense of odor is probably to happen by the third day of an infection with the novel coronavirus, in line with a research of over 100 Covid-19 sufferers which can assist public well being specialists higher establish these carrying the virus with o…", "url": "https://www.hindustantimes.com/world-news/most-covid-patients-may-lose-sense-of-smell-by-third-day-of-infection-study/story-amScEAgZ7AuIdg5n33J7YK.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/08/Pictures/workers-collect-swabs-students-senior-nucleic-school_2318f07e-90f1-11ea-b214-efce58d4f976.jpg", "publishedAt": "2020-05-08T06:35:31Z", "content": "Loss of the sense of odor is probably to happen by the third day of an infection with the novel coronavirus, in line with a research of over 100 Covid-19 sufferers which can assist public well being specialists higher establish these carrying the virus with o… [+3035 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Could wastewater spread the novel coronavirus? - Don't neglect sewage! - Economic Times", "description": "Even as the novel coronavirus spreads across the world, environmental biologists at the University of Stirling have warned that the potential spread of COVID-19 via sewage \"must not be neglected\" in the battle to protect human health. Don't neglect sewage!", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/could-wastewater-spread-the-novel-coronavirus/dont-neglect-sewage/slideshow/75619333.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75619333,width-1070,height-580,overlay-economictimes/photo.jpg", "publishedAt": "2020-05-08T06:35:00Z", "content": "Updated: 08 May 2020, 12:05 PM IST\r\nEven as the novel coronavirus spreads across the world, environmental biologists at the University of Stirling have warned that the potential spread of COVID-19 via sewage \"must not be neglected\" in the battle to protect hu… [+1813 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Most COVID-19 patients may lose sense of smell by third day of infection: Study - The Financial Express", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiiQFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlc3R5bGUvaGVhbHRoL21vc3QtY292aWQtMTktcGF0aWVudHMtbWF5LWxvc2Utc2Vuc2Utb2Ytc21lbGwtYnktdGhpcmQtZGF5LW9mLWluZmVjdGlvbi1zdHVkeS8xOTUyMTI3L9IBjgFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlc3R5bGUvaGVhbHRoL21vc3QtY292aWQtMTktcGF0aWVudHMtbWF5LWxvc2Utc2Vuc2Utb2Ytc21lbGwtYnktdGhpcmQtZGF5LW9mLWluZmVjdGlvbi1zdHVkeS8xOTUyMTI3L2xpdGUv?oc=5", "urlToImage": null, "publishedAt": "2020-05-08T06:29:44Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "What scientists are finding out about coronavirus - ​New research - Economic Times", "description": "With the coronavirus holding the world hostage, scientists are constantly looking into ways to beat the virus, which has led to studies into the genome of the coronavirus. ​New research", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/what-scientists-are-finding-out-about-coronavirus/new-research/slideshow/75619094.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75619094,width-1070,height-580,overlay-economictimes/photo.jpg", "publishedAt": "2020-05-08T06:24:00Z", "content": "08 May 2020, 11:54 AM IST\r\nWith the coronavirus holding the world hostage, scientists are constantly looking into ways to beat the virus, which has led to studies into the genome of the coronavirus.\r\nScientists have found that the coronavirus is evolving and … [+794 chars]"}, {"source": {"id": null, "name": "Japantimes.co.jp"}, "author": "Internal Submission", "title": "Lockdown darkens for India after train runs over sleeping migrants - The Japan Times", "description": "A freight train ran over and killed more than a dozen poor Indians, who were trying to walk back to their home state after the world’s most expansive virus", "url": "https://www.japantimes.co.jp/news/2020/05/08/asia-pacific/india-train-runs-over-migrants/", "urlToImage": "https://cdn.japantimes.2xx.jp/wp-content/uploads/2020/05/np_file_10894-870x617.jpeg", "publishedAt": "2020-05-08T06:18:00Z", "content": "A freight train ran over and killed more than a dozen poor Indians, who were trying to walk back to their home state after the worlds most expansive virus lockdown left them unemployed.\r\nAs many as 20 people had walked for 36 kilometers (22 miles), following … [+1783 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": null, "title": "Coronavirus Outbreak: Researchers look hopefully at Llamas' antibodies to give us a COVID-19 vaccine - Firstpost", "description": "Llamas’ antibodies are also easily manipulated and can be fused with other antibodies, including human's, and remain stable.", "url": "https://www.nytimes.com/2020/05/06/science/llama-coronavirus-antibodies.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/05/toimetaja-tolkeburoo-IcWOh2prgu4-unsplash-1.jpg", "publishedAt": "2020-05-08T05:12:28Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "US: 58% deaths in counties with more black residents - WION", "description": "Minorities are being hit harder by COVID-19. In United States 58% deaths in counties with more black residents. Watch report. #WION #Coronavirus #Coronavirus...", "url": "https://www.youtube.com/watch?v=F8Pox9ww_fM", "urlToImage": "https://i.ytimg.com/vi/F8Pox9ww_fM/maxresdefault.jpg", "publishedAt": "2020-05-08T05:02:39Z", "content": "Minorities are being hit harder by COVID-19. In United States 58% deaths in counties with more black residents. Watch report.\r\n#WION#Coronavirus#CoronavirusPandemic\r\nAbout Channel: \r\nWION -The World is One News, examines global issues with in-depth analysis. … [+1021 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "COVID-19 Treatment May Lie in Pangolin Genetics – May Possess Evolutionary Advantage Against Coronavirus - SciTechDaily", "description": "The exotic animal's genome could point to possible treatment options for COVID-19 in humans. Similar to how a smoke detector sounds off an alarm, certain genes sense when a virus enters the body, alerting of an intruder and triggering an immune response in mo…", "url": "https://scitechdaily.com/covid-19-treatment-may-lie-in-pangolin-genetics-may-possess-evolutionary-advantage-against-coronavirus/", "urlToImage": "https://scitechdaily.com/images/Pangolin-Zambia.jpg", "publishedAt": "2020-05-08T04:00:39Z", "content": "The exotic animal’s genome could point to possible treatment options for COVID-19 in humans.\r\nSimilar to how a smoke detector sounds off an alarm, certain genes sense when a virus enters the body, alerting of an intruder and triggering an immune response in m… [+2767 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "CNN", "title": "Coronavirus: Missing remains mean no peace for grieving families in Ecuador - 7NEWS.com.au", "description": "There are so many bodies, relatives are being asked to search through unidentified remains themselves.", "url": "https://7news.com.au/news/world/coronavirus-missing-remains-mean-no-peace-for-grieving-families-in-ecuador-c-1024833", "urlToImage": "https://images.7news.com.au/publication/C-1024833/1003a0153431771deb6413b91bf6a1bf641f49e3-16x9-x0y0w2000h1125.png?imwidth=1024", "publishedAt": "2020-05-08T03:05:31Z", "content": "Warning: Distressing images and content\r\nWhen Flavio Ramos was wheeled into the hospital room in Ecuador, he was gasping for air and slipping in and out of consciousness.\r\nSo it was his son, Arturo, who first noticed the bodies.\r\nTwo corpses laid unattended o… [+8268 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "COVID-19 Patients Still Face A Long Recovery After The ICU - Newsy", "description": "After 14 days on a ventilator and 11 days on ECMO, Jason Jahanian's COVID-19 recovery is just getting started. Learn more about this story at https://www.new...", "url": "https://www.youtube.com/watch?v=8DWICGoCl-M", "urlToImage": "https://i.ytimg.com/vi/8DWICGoCl-M/maxresdefault.jpg", "publishedAt": "2020-05-08T01:14:35Z", "content": null}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "AFP", "title": "As the COVID-19 pandemic deepens, virus symptoms multiply - Deccan Herald", "description": "Every week, it seems, the list of coronavirus symptoms -- ranging from disagreeable to the deadly -- grows longer. Follow latest updates on the COVID-19 pandemic here", "url": "https://www.deccanherald.com/science-and-environment/as-the-covid-19-pandemic-deepens-virus-symptoms-multiply-834928.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/08/755237-01-02-1588904450.jpg", "publishedAt": "2020-05-07T20:58:35Z", "content": "Every week, it seems, the list of coronavirus symptoms -- ranging from disagreeable to the deadly -- grows longer.\r\nFollow latest updates on the COVID-19 pandemic here\r\nWhat began as a familiar flu-like cluster of chills, headaches and fever has rapidly expan… [+5496 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What happens if your driver's license expires during the COVID-19 pandemic? - WHAS11", "description": "If your license expired March 18, the day after offices closed, and you cannot renew online, you have until June 15 before your license truly expires.", "url": "https://www.youtube.com/watch?v=8pzTUrQZV2I", "urlToImage": "https://i.ytimg.com/vi/8pzTUrQZV2I/hqdefault.jpg", "publishedAt": "2020-05-07T20:50:17Z", "content": null}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Staff Reporter", "title": "Health expert warns against herd immunity strategy - The Hindu", "description": "It is better to focus on herd protection by emphasising more on disease containment and protection of vulnerable groups’", "url": "https://www.thehindu.com/news/national/health-expert-warns-against-herd-immunity-strategy/article31530401.ece", "urlToImage": "https://www.thehindu.com/news/national/kipois/article31530400.ece/ALTERNATES/LANDSCAPE_615/07THLTKSRINATHREDDYPHFI", "publishedAt": "2020-05-07T20:44:44Z", "content": "Prominent public health expert and advisor to the Odisha government on health, K. Srinath Reddy, warned against pursuing the herd immunity strategy to overcome the COVID-19 pandemic.\r\nThe herd immunity idea might prove to be dangerous as it carries the risk o… [+2149 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Virus exposes gaping holes in African healthcare - Reuters", "description": "World Health Organization warns that Africa could become the next epicenter of the coronavirus pandemic https://reut.rs/2L8oLrQ Subscribe: http://smarturl.it...", "url": "https://www.youtube.com/watch?v=N96yfop1ADw", "urlToImage": "https://i.ytimg.com/vi/N96yfop1ADw/maxresdefault.jpg", "publishedAt": "2020-05-07T20:31:19Z", "content": null}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Not good enough: FDA withdraws approval for some China-made masks - Aljazeera.com", "description": "A number of the Chinese-made masks failed to demonstrate a minimum particulate filtration efficiency: FDA.", "url": "https://www.aljazeera.com/ajimpact/good-fda-withdraws-approval-china-masks-200507193220747.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/5/7/c6691ec61e5445d29b4269b174e9d88d_18.jpg", "publishedAt": "2020-05-07T20:02:00Z", "content": "The United States Food and Drug Administration (FDA) on Thursday announced that it has cancelled the approval for some manufacturers in China to sell N95 respirators in the US. The administration says the masks failed to offer adequate protection against the … [+486 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Gravitas: The mysterious death of a Chinese researcher in the US - WION", "description": "A Chinese-born coronavirus researcher was found dead in the US. The police say this is a case of murder-suicide. #Gravitas #ChineseResearcherMurdered #Chines...", "url": "https://www.youtube.com/watch?v=Gc_P64qZm0w", "urlToImage": "https://i.ytimg.com/vi/Gc_P64qZm0w/maxresdefault.jpg", "publishedAt": "2020-05-07T18:45:38Z", "content": "A Chinese-born coronavirus researcher was found dead in the US. The police say this is a case of murder-suicide. \r\n#Gravitas#ChineseResearcherMurdered#ChineseCoronavirusResearcher\r\nAbout Channel: \r\nWION -The World is One News, examines global issues with in-d… [+1036 chars]"}, {"source": {"id": null, "name": "Shethepeople.tv"}, "author": null, "title": "Italian Researchers Claim A Breakthrough In Coronavirus Vaccine - SheThePeople", "description": "As per reports a team of scientists in Italy conducted tests on a mice which, after a single vaccination, developed antibodies.", "url": "https://www.shethepeople.tv/news/italian-researchers-coronavirus-vaccine-claim-breakthrough", "urlToImage": "https://www.shethepeople.tv/wp-content/uploads/2020/03/corona.jpg", "publishedAt": "2020-05-07T16:29:00Z", "content": "SheThePeople.TV is India's biggest digital storytelling for women, dedicated to passionately championing and promoting their journeys. We Empower, Engage and Elevate, connecting them to an amazing network that inspires and grows each others' efforts.\r\nIn Indi… [+393 chars]"}, {"source": {"id": null, "name": "Aol.com"}, "author": "Gabrielle Sorto", "title": "Sperm containing virus raises small risk of COVID-19 spread via sex -study - AOL", "description": "\"Further studies are required with respect to the detailed information about virus shedding, survival time and concentration in semen,\" the study said.", "url": "https://www.aol.com/article/news/2020/05/07/sperm-containing-virus-raises-small-risk-of-covid-19-spread-via-sex-study/24229161/", "urlToImage": "https://o.aolcdn.com/images/dims3/GLOB/crop/5468x3585+0+0/resize/1028x675!/format/jpg/quality/85/https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2020-04%2Ffaa2c8f0-783a-11ea-bfff-12d07558e2f4", "publishedAt": "2020-05-07T15:57:07Z", "content": "LONDON, May 7 (Reuters) - Chinese researchers who tested sperm of men infected with COVID-19 found that a minority of them had the new coronavirus in their semen, opening up a small chance the disease could be transmitted sexually, scientists said on Thursday… [+2343 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Sleep difficulties linked to altered brain development in infants who later develop autism - Science Daily", "description": "New research finds that sleep problems in a baby's first 12 months may not only precede an autism diagnosis, but also may be associated with altered growth trajectory in a key part of the brain, the hippocampus.", "url": "https://www.sciencedaily.com/releases/2020/05/200507094747.htm", "urlToImage": null, "publishedAt": "2020-05-07T15:56:20Z", "content": "Infants spend most of their first year of life asleep. Those hours are prime time for brain development, when neural connections form and sensory memories are encoded.But when sleep is disrupted, as occurs more often among children with autism, brain developm… [+7765 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "COVID-19: Could wastewater be a new way of Coronavirus transmission? One study says so - The Financial Express", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMijwFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlc3R5bGUvaGVhbHRoL2NvdmlkLTE5LWNvdWxkLXdhc3Rld2F0ZXItYmUtYS1uZXctd2F5LW9mLWNvcm9uYXZpcnVzLXRyYW5zbWlzc2lvbi1vbmUtc3R1ZHktc2F5cy1zby8xOTUxMzg1L9IBlAFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlc3R5bGUvaGVhbHRoL2NvdmlkLTE5LWNvdWxkLXdhc3Rld2F0ZXItYmUtYS1uZXctd2F5LW9mLWNvcm9uYXZpcnVzLXRyYW5zbWlzc2lvbi1vbmUtc3R1ZHktc2F5cy1zby8xOTUxMzg1L2xpdGUv?oc=5", "urlToImage": null, "publishedAt": "2020-05-07T13:08:25Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Black and Pakistani people more likely to die from COVID-19 according to UK data - Reuters", "description": "Black people and those of Bangladeshi and Pakistani ethnicity have a significantly higher chance of dying from COVID-19 than white people, even when adjustin...", "url": "https://www.youtube.com/watch?v=CcqRdAbrjOM", "urlToImage": "https://i.ytimg.com/vi/CcqRdAbrjOM/hqdefault.jpg", "publishedAt": "2020-05-07T12:53:24Z", "content": null}, {"source": {"id": null, "name": "Khaleejtimes.com"}, "author": "IANS", "title": "Covid-19 found to lead to severe mystery illness in kids - Khaleej Times", "description": "Although Covid-19 affects children less frequently, officials say they have been diagnosed in the New York area with a serious mystery illne...", "url": "https://www.khaleejtimes.com/coronavirus-pandemic/covid-19-found-to-lead-to-severe-mystery-illness-in-kids", "urlToImage": "https://images.khaleejtimes.com/storyimage/KT/20200507/ARTICLE/200508916/AR/0/baby,-coronavirus,-new-york,-covid19,-kawasaki-disease.jpg&NCS_modified=20200507145035&exif=.jpg", "publishedAt": "2020-05-07T12:51:07Z", "content": "Although Covid-19 affects children less frequently, officials say they have been diagnosed in the New York area with a serious mystery illness connected to it that affects the heart and blood vessels.\r\nThe state's Health Department said on Wednesday that 64 c… [+3145 chars]"}, {"source": {"id": null, "name": "Cheddar.com"}, "author": "Alexander Vuocolo", "title": "New Alcohol To-Go Rules Prove Popular for Restaurants Struggling to Survive - Cheddar", "description": "To restaurants and bars struggling to stay open for food delivery and pick-up, the ability to add high-margin cocktails and mixed drinks to the check has provided a crucial revenue stream.", "url": "https://cheddar.com/media/new-alcohol-to-go-rules-prove-popular-for-restaurants-struggling-to-survive", "urlToImage": "https://img.chdrstatic.com/media/d1d38243-4190-47ec-b4c4-4f92f34e76c4.jpg?source=web&crop=1200:675,smart&width=1200&height=675&auto=webp", "publishedAt": "2020-05-07T12:30:49Z", "content": "An employee at White Street Brewing Company in Wake Forest, N.C., fills a \"crowler\" can of beer on Tuesday, March 17, 2020. With bars ordered close due to coronavirus, brewers are making sure their customers can enjoy some fresh suds. (AP Photo/Allen G. Breed… [+6545 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What's it like to be a health worker fighting COVID-19? | AFP - AFP News Agency", "description": "They have been hailed as the heroes of the pandemic, working flat out to stave off the worst effects of the virus. Doctors and nurses around the world gave A...", "url": "https://www.youtube.com/watch?v=9VIIiaL5K4g", "urlToImage": "https://i.ytimg.com/vi/9VIIiaL5K4g/maxresdefault.jpg", "publishedAt": "2020-05-07T12:12:38Z", "content": null}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Mohana Basu", "title": "After HCQ, it’s time for azithromycin and pneumonia drug combo to go under clinical trial - ThePrint", "description": "As scientists try out new drug combinations and look for clues in existing cancer therapies, ThePrint brings you the latest on studies on Covid-19 patients.", "url": "https://theprint.in/science/after-hcq-its-time-for-azithromycin-and-pneumonia-drug-combo-to-go-under-clinical-trial/416413/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/Test-.jpg", "publishedAt": "2020-05-07T11:46:56Z", "content": "New Delhi: The Covid-19 pandemic has brought the world to a standstill, even as scientists continue to look for treatments to fight the infection.\r\nHere are some of the latest potential therapies being proposed by researchers across the world.\r\nClinical trial… [+4958 chars]"}, {"source": {"id": null, "name": "Ladbible.com"}, "author": "Claire Reid", "title": "Menthol Cigarettes Will Be Banned In The UK This Month - LADbible", "description": "The new rules, which also ban 'skinny' cigarettes, comes into action soon", "url": "https://www.ladbible.com/news/uk-menthol-cigarettes-banned-in-the-uk-from-20-may-20200507", "urlToImage": "https://images.ladbible.com/thumbnail?type=jpeg&url=http://beta.ems.ladbiblegroup.com/s3/content/3e89c0965eb37d3967dac6e332c318db.png&quality=70&width=808", "publishedAt": "2020-05-07T10:03:46Z", "content": "A ban on menthol cigarettes comes into action in the UK on 20 May.\r\nThe ban, which includes the sale of all tobacco that contains flavourings, is part of an effort to stop younger people from smoking and reducing the number of people taking up smoking overall… [+1875 chars]"}, {"source": {"id": null, "name": "Sciencetimes.com"}, "author": "Staff Reporter", "title": "Vaccines May Not Work on New Mutant Strain of Coronavirus Spreading in US and Europe – Study - Science Times", "description": "A newly discovered coronavirus mutation may be \"immune\" to vaccines currently being tested. It is of urgent concern to the medical community, which is searching for a vaccine that will work against COVID-19.", "url": "https://www.sciencetimes.com/articles/25610/20200507/vaccines-work-new-mutant-strain-coronavirus-spreading-europe-–-study.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/27430/covid-19.jpg", "publishedAt": "2020-05-07T09:09:28Z", "content": null}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "COVID-19: CSIR submits 53 genome sequences of coronavirus in Indians to global body; to submit 450 more by May 15 - The Financial Express", "description": "The Council for Scientific and Industrial Research (CSIR) is also planning to submit additional 450 genome sequence data of coronavirus by May 15, its Director General Shekhar Mande said.", "url": "https://www.financialexpress.com/lifestyle/health/covid-19-csir-submits-53-genome-sequences-of-coronavirus-in-indians-to-global-body-to-submit-450-more-by-may-15/1950988/", "urlToImage": "https://images.financialexpress.com/2020/05/coronavirus-tests.jpg", "publishedAt": "2020-05-07T08:26:03Z", "content": "Amidst concerns that coronavirus have undergone mutation and the new strain maybe more contagious, India’s premier R&amp;D organisation, CSIR, has submitted as many as 53 genome sequences of the virus to a global genome database, a move that may help in bette… [+3396 chars]"}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "Agencies", "title": "How bats carry coronavirus without getting sick decoded by scientists - Business Standard", "description": "In the study, the scientists demonstrated that cells from an insect-eating brown bat can be persistently infected with MERS coronavirus for months", "url": "https://www.business-standard.com/article/current-affairs/how-bats-carry-coronavirus-without-getting-sick-decoded-by-scientists-120050700550_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-05/06/full/1588788947-3303.jpg", "publishedAt": "2020-05-07T08:15:51Z", "content": "Scientists have uncovered how bats can carry the MERS coronavirus without getting sick, shedding light on what triggers coronaviruses, including the one behind the Covid-19 pandemic, to jump to humans.\r\nAccording to the study, published in the journal Scienti… [+3406 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Karishma Mehrotra", "title": "14 studies, 1 refrain: Closed public spaces are environments for super-spreading - The Indian Express", "description": "The common findings of 14 studies on transmission patterns across nine countries could provide some pointers as the Centre and state governments work on exit strategies ahead of May 17, when the third phase of the nationwide lockdown is scheduled to end.", "url": "https://indianexpress.com/article/india/closed-public-spaces-environments-coronavirus-super-spreading-6397621/", "urlToImage": "https://images.indianexpress.com/2020/05/Corona-Partha.jpg?w=759", "publishedAt": "2020-05-07T04:50:38Z", "content": "Public enclosed spaces like workplaces and restaurants can become super-spreading environments for Covid-19.Public enclosed spaces like workplaces and restaurants can become super-spreading environments for Covid-19; however, schools are not prominent transmi… [+5702 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Suraksha P", "title": "Coronavirus Lockdown 3.0: Karnataka revises SOP for international passengers, scraps category C - Deccan Herald", "description": "Karnataka revised its standard operating procedure (SOP) for international passengers on Wednesday. The first group of passengers will arrive in the state on May 8. The number of categories has been reduced to two from three. Category A includes passengers sy…", "url": "https://www.deccanherald.com/state/coronavirus-lockdown-30-karnataka-revises-sop-for-international-passengers-scraps-category-c-834541.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/07/Corona-istock-1588825450.jpg", "publishedAt": "2020-05-07T04:24:10Z", "content": "Karnataka revised its standard operating procedure (SOP) for international passengers on Wednesday. The first group of passengers will arrive in the state on May 8.\r\nThe number of categories has been reduced to two from three. Category A includes passengers s… [+2070 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "Arul Louis | IANS", "title": "Novel Coronavirus Found to Cause Severe Mystery Illness in Children - The Weather Channel", "description": "The new COVID-19-associated illness affects children's heart and blood vessels.", "url": "https://weather.com/en-IN/india/coronavirus/news/2020-05-07-novel-coronavirus-cause-severe-mystery-illness-children-covid-19", "urlToImage": "https://s.w-x.co/in-children_0.jpg", "publishedAt": "2020-05-07T03:42:10Z", "content": "File photo: Two coronavirus-infected children are discharged from hospital after complete recovery\r\n(Pravin Barnale/BCCL)\r\nAlthough COVID-19 affects children less frequently, they have been diagnosed with a serious mystery illness connected to it in the New Y… [+3272 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "VICTOR TANGERMANN, Futurism", "title": "Llama Antibodies Could Help Us Defeat COVID-19, Scientists Say - ScienceAlert", "description": "Scientists say llamas could help defeat the coronavirus.", "url": "https://www.sciencealert.com/llama-blood-could-play-a-role-in-helping-people-fight-off-coronavirus-infections", "urlToImage": "https://www.sciencealert.com/images/2020-05/processed/llama_ab_covid_1024.jpg", "publishedAt": "2020-05-07T02:07:34Z", "content": "Scientists say llamas could help defeat the coronavirus.\r\nAccording to a new study published in the journal Cell Tuesday by an international team of researchers, antibodies found in the blood of llamas were able to stave off COVID infections.\r\n\"This is one of… [+1944 chars]"}]}