{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "Strict monitoring ‘a must’ with new discharge policy - Times of India", "description": "Pune: Leading health experts have said the new national Covid-19 discharge policy needs to be supplemented with active monitoring of patients through .", "url": "https://timesofindia.indiatimes.com/city/pune/strict-monitoring-a-must-with-new-discharge-policy/articleshow/75705648.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-05-12T23:09:00Z", "content": null}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express News Service", "title": "Smoking and Covid: recent claims, and new findings - The Indian Express", "description": "Its statement said it is constantly evaluating new research, including research that examines the link between tobacco use, nicotine use, and Covid-19.", "url": "https://indianexpress.com/article/explained/smoking-and-covid-recent-claims-and-new-findings-6407195/", "urlToImage": "https://images.indianexpress.com/2020/05/smoking.jpg?w=759", "publishedAt": "2020-05-12T22:53:37Z", "content": "Nicotine is known to bind with nAChR; the hypothesis is that if nicotine is already present on human cells, it may block SARS-CoV-2. (File)ON MONDAY, the World Health Organization (WHO) issued a statement underlining the perils of smoking, and referring to un… [+2514 chars]"}, {"source": {"id": null, "name": "Thelancet.com"}, "author": null, "title": "Implications of gastrointestinal manifestations of COVID-19 - The Lancet", "description": "In late December, 2019, the first case of coronavirus disease 2019 (COVID-19), caused\nby severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), was reported in Wuhan,\nChina.1 According to WHO situation report 99, there have been more than 2·95 million\n…", "url": "https://www.thelancet.com/journals/langas/article/PIIS2468-1253(20)30132-1/fulltext", "urlToImage": null, "publishedAt": "2020-05-12T22:32:04Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. By continuing you agree to the use of cookies.\r\nCopyright © 2020 Elsevier Inc. except certain content provided by third parties.\r\nPrivacy Policy   Terms and Conditions"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Emma Farge", "title": "WHO sees 'potentially positive data' in treating coronavirus - Reuters India", "description": "The World Health Organization said on Tuesday that some treatments appear to be limiting the severity or length of the COVID-19 disease and that it was focusing on learning more about four or five of the most promising ones.", "url": "https://in.reuters.com/article/health-coronavirus-int-idINKBN22O1HP", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-05-12T22:05:00Z", "content": "GENEVA (Reuters) - The World Health Organization said on Tuesday that some treatments appear to be limiting the severity or length of the COVID-19 disease and that it was focusing on learning more about four or five of the most promising ones. \r\nThe Geneva-ba… [+4019 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Ticket collector dies with COVID-19 after man claiming to have virus spat on her - Sky News", "description": "Belly Mujinga's family want justice as they describe how she died just 14 days after the incident at London's Victoria Station. A mother working as a ticket ...", "url": "https://www.youtube.com/watch?v=fLzGCJBwIck", "urlToImage": "https://i.ytimg.com/vi/fLzGCJBwIck/maxresdefault.jpg", "publishedAt": "2020-05-12T21:09:57Z", "content": "Belly Mujinga's family want justice as they describe how she died just 14 days after the incident at London's Victoria Station.\r\nA mother working as a ticket collector has died with COVID-19 after being spat at by someone claiming to have the illness.\r\nSUBSCR… [+553 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Coronavirus death toll in NYC likely worse than official tally, CDC study says - CBS News", "description": "Between March 11 and May 2, about 24,000 more people died in the city than researchers would ordinarily expect during that time period.", "url": "https://www.cbsnews.com/news/coronavirus-nyc-deaths-higher-offical-count-cdc-study/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/05/06/e10e5722-ed8d-40d8-be5c-6932d908c01b/thumbnail/1200x630g6/fe339361c3187a71a18c170cc9e9a41b/ap-20105166373380.jpg", "publishedAt": "2020-05-12T20:27:21Z", "content": "New York City's death toll from the coronavirus may be thousands of fatalities worse than the tally kept by the city and state, according to an analysis released Monday by the U.S. Centers for Disease Control and Prevention.\r\nBetween March 11 and May 2, about… [+2134 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": null, "title": "Is COVID-19 making it harder to treat other diseases in Africa? - Aljazeera.com", "description": null, "url": "https://www.aljazeera.com/programmes/insidestory/2020/05/covid-19-making-harder-treat-diseases-africa-200512173305807.html", "urlToImage": null, "publishedAt": "2020-05-12T18:53:00Z", "content": null}, {"source": {"id": null, "name": "Eurekalert.org"}, "author": null, "title": "A combo of fasting plus vitamin C is effective for hard-to-treat cancers, study shows - EurekAlert", "description": "Researchers from USC and IFOM Cancer Institute found a fasting-mimicking diet could be more effective at treating some types of cancer when combined with vitamin C.\r\n\r\nIn studies on mice, researchers found that the combination delayed tumor progression in mul…", "url": "https://eurekalert.org/pub_releases/2020-05/uosc-aco051220.php", "urlToImage": "https://eurekalert.org/images/EurekAlert_StackedLogo_RGB.jpg", "publishedAt": "2020-05-12T18:32:35Z", "content": "Scientists from USC and the IFOM Cancer Institute in Milan have found that a fasting-mimicking diet could be more effective at treating some types of cancer when combined with vitamin C.\r\nIn studies on mice, researchers found that the combination delayed tumo… [+5994 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Special Correspondent", "title": "Coronavirus | States asked to ramp up surveillance for Severe Acute Respiratory Infections or Influenza-like illnesses to detect hidden infections - The Hindu", "description": "Aarogya Setu app made mandatory for returning NRIs and migrants.", "url": "https://www.thehindu.com/news/national/coronavirus-states-asked-to-ramp-up-surveillance-for-severe-acute-respiratory-infections-or-influenza-like-illnesses-to-detect-hidden-infections/article31569205.ece", "urlToImage": "https://www.thehindu.com/news/national/9c0qfi/article31569201.ece/ALTERNATES/LANDSCAPE_615/APTOPIXVIRUSOUTBREAKINDIA", "publishedAt": "2020-05-12T18:07:07Z", "content": "Expanding the ambit of the Aarogya Setu app, the Union Health Ministry on Tuesday directed that downloading it be made compulsory for all returnees (migrant labourers and those coming from abroad) for better contact surveillance and suitable medical intervent… [+4005 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Doctor On Call: Cancer Treatment During Covid-19 - WCPO 9", "description": "Mark Witte, executive director of the TriHealth Cancer Institute talks about how the staff is keeping cancer patients safe amid the pandemic.", "url": "https://www.youtube.com/watch?v=nFDF-4uM-kM", "urlToImage": "https://i.ytimg.com/vi/nFDF-4uM-kM/hqdefault.jpg", "publishedAt": "2020-05-12T17:33:48Z", "content": "Mark Witte, executive director of the TriHealth Cancer Institute talks about how the staff is keeping cancer patients safe amid the pandemic."}, {"source": {"id": null, "name": "Boomlive.in"}, "author": "AFP", "title": "Are US Health Authorities Reducing COVID-19 Death Toll? A Fact Check - BOOM", "description": "Posts on social media are falsely claiming that the US CDC is cutting reported COVID-19 death toll.", "url": "https://www.boomlive.in/world/are-us-health-authorities-reducing-covid-19-death-toll-a-fact-check-8054", "urlToImage": "https://www.boomlive.in/h-upload/2020/05/12/921412-covid-us.jpg", "publishedAt": "2020-05-12T17:24:16Z", "content": "Posts on social media claim the US Centers for Disease Control and Prevention (CDC) has revised down its death toll for COVID-19. This is false; the CDC says it has not cut its statistics on fatalities from the disease caused by the novel coronavirus, and tha… [+2089 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Rachel Fairbank", "title": "How Much Vitamin D Do You Need? - Lifehacker", "description": "Vitamin D is important. It helps your body absorb calcium, promotes bone growth and plays a role in your immune system. It’s commonly called the “sunshine vitamin,” as our bodies use the energy from sunlight to make vitamin D, which by definition is actually …", "url": "https://vitals.lifehacker.com/how-much-vitamin-d-do-you-need-1843412816", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/qs5y4anesreoohhk9nll.jpg", "publishedAt": "2020-05-12T17:01:00Z", "content": "Vitamin D is important. It helps your body absorb calcium, promotes bone growth and plays a role in your immune system. Its commonly called the sunshine vitamin, as our bodies use the energy from sunlight to make vitamin D, which by definition is actually a p… [+3196 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Exclusive: At least 20,000 people died due to the coronavirus outbreak in UK care homes - Reuters calculation - Reuters India", "description": "At least 20,000 people have died in care homes in England and Wales as a consequence of the coronavirus pandemic, according to Reuters calculations based on official data.", "url": "https://in.reuters.com/article/health-coronavirus-britain-carehomes-idINKBN22O2MT", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-05-12T16:59:00Z", "content": "LONDON (Reuters) - At least 20,000 people have died in care homes in England and Wales as a consequence of the coronavirus pandemic, according to Reuters calculations based on official data. \r\nIn the eight weeks to 1 May, 37,627 people died in care homes of a… [+1262 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "News18", "title": "China's Lack of Transparency on Coronavirus Fuelling Rumours, Says US Epidemiologist - Yahoo Singapore News", "description": "Theories abound about the provenance of the virus that has sparked the global COVID-19 pandemic, which has killed nearly 300,000 people worldwide in a matter of months.", "url": "https://in.news.yahoo.com/chinas-lack-transparency-coronavirus-fuelling-165400753.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/0IC9rZgfQ6hB2Og4y2_TsQ--~B/aD01ODM7dz04NzU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/news18_coronavirus_edition_222/130fefad618b46634b5709a52052ba74", "publishedAt": "2020-05-12T16:54:00Z", "content": "Renowned US epidemiologist Larry Brilliant has urged China to be \"radically transparent\" if it wants to fend off suspicion over the origin of the novel coronavirus.\r\nTheories abound about the provenance of the virus that has sparked the global COVID-19 pandem… [+4380 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "Indo-Mediterranean Diet May Be Good For Heart, Study Evaluates Effect On Pre-Heart-Failure - NDTV Food", "description": "A study published in The Open Inflammation Journal, shed light on the impact of Indo-Mediterranean diet on pre-heart failure.", "url": "https://food.ndtv.com/news/indo-mediterranean-diet-may-be-good-for-heart-study-evaluates-effect-on-pre-heart-failure-2227627", "urlToImage": "https://c.ndtvimg.com/2018-12/fbcrot_mediterranean-diet_625x300_22_December_18.jpg", "publishedAt": "2020-05-12T16:32:37Z", "content": "There are a variety diets that have become a global sensation, but there are very few that have been even remotely as popular as the Mediterranean diet, a diet that focuses primarily on consuming, nuts, greens and healthy oils. There are many variations of th… [+3126 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "Child Nutrition: 5 Diet Tips On How To Make Children Develop Healthy Eating Habits (Study) - NDTV Food", "description": "Child obesity or weakness or other such child nutrition issues can be tackled by understanding why different children have differing abilities. A great way to do this is by instilling ideal eating behaviour in the child right from the start.", "url": "https://food.ndtv.com/news/child-nutrition-5-tips-on-how-to-make-children-develop-healthy-eating-habits-study-2227623", "urlToImage": "https://c.ndtvimg.com/2019-01/24gn6ld_child-nutrition_625x300_11_January_19.jpg", "publishedAt": "2020-05-12T16:32:34Z", "content": "Parents can influence children's eating habits.Every parent is concerned about what their children eat. Too much focus is put on what they eat rather than how they eat. A recent research by American Heart Association's (AHA) provides evidence-based suggestion… [+2323 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Anna Medaris Miller", "title": "134 pregnant women were diagnosed with the coronavirus, but so far none of their babies have tested positive - Business Insider India", "description": "Of the 24 babies born to COVID-positive moms in Los Angeles County so far, none tested positive for the virus. The data supports most earlier findings suggesting", "url": "https://www.businessinsider.in/science/news/134-pregnant-women-were-diagnosed-with-the-coronavirus-but-so-far-none-of-their-babies-have-tested-positive/articleshow/75701828.cms", "urlToImage": "https://www.businessinsider.in/photo/75701828/134-pregnant-women-were-diagnosed-with-the-coronavirus-but-so-far-none-of-their-babies-have-tested-positive.jpg?imgsize=1792150", "publishedAt": "2020-05-12T15:58:00Z", "content": "Being pregnant is stressful enough. Being pregnant during the current pandemic — one that's raised more questions than answers as to how it affects moms-to-be and their children — compounds that stress many-fold. \r\nBut expectant mothers can take comfort in ne… [+3140 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Cong Asks PM to Take Action Against Gujarat Minister Chudasama, Expel Him From BJP - News18", "description": "Congress leader Kapil Sibal questioned the PM's silence on the issue and said if he was serious on ending corruption in the country he should take strict action against the minister from his home state.", "url": "https://www.news18.com/news/politics/cong-asks-pm-to-take-action-against-gujarat-minister-chudasama-expel-him-from-bjp-2617235.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/05/1589272306_bhupendrasinh-chudasama.jpg", "publishedAt": "2020-05-12T15:45:46Z", "content": "The Congress Tuesday asked Prime Minister Narendra Modi to expel Gujarat minister Bhupendrasinh Chudasama from the BJP after his 2017 election was declared void by the High Court on grounds of malpractice and manipulation.\r\nCongress leader Kapil Sibal questio… [+2884 chars]"}, {"source": {"id": null, "name": "Kashmirobserver.net"}, "author": null, "title": "Children Face Greater Risk From COVID-19 Than Previously Thought: Study - Kashmir Observer", "description": "Children, teens, and young adults are at greater risk for severe complications from COVID-19 than previously thought, according to a study", "url": "https://kashmirobserver.net/2020/05/12/children-face-greater-risk-from-covid-19-than-previously-thought-study/", "urlToImage": "https://kashmirobserver.net/wp-content/uploads/2020/03/children-Coronavirus.jpg", "publishedAt": "2020-05-12T15:38:03Z", "content": "WhatsAppFacebook TwitterEmail9Shares\r\nNew York- Children, teens, and young adults are at greater risk for severe complications from COVID-19 than previously thought, according to a study which says those with underlying health conditions are at even greater r… [+3352 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Dr. Kamal Kant Kohli", "title": "Folic acid during pregnancy may lead to dangerously high BP - Medical Dialogues", "description": "Women are routinely prescribed iron and folic acid during pregnancy for better outcomes of...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/folic-acid-during-pregnancy-may-lead-to-dangerously-high-bp-65705", "urlToImage": "https://medicaldialogues.in/h-upload/2020/02/19/124441-pregnancy-hypertension.jpg", "publishedAt": "2020-05-12T15:08:36Z", "content": "Women are routinely prescribed iron and folic acid during pregnancy for better outcomes of pregnancy.But a new study has raised questions Women are routinely prescribed iron and folic acid during pregnancy for better outcomes of pregnancy.But a new study has … [+6415 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Novel test can detect antibodies to SARS-CoV-2 in human blood - Telangana Today", "description": "New York: A new blood test may help identify individuals whose plasma contains antibodies to SARS-CoV-2 virus that causes COVID-19, and could potentially be used to treat other patients, scientists said on Tuesday. Tests that detect the presence of SARS-CoV-2…", "url": "https://telanganatoday.com/novel-test-can-detect-antibodies-to-sars-cov-2-in-human-blood", "urlToImage": "https://cdn.telanganatoday.com/im/Telangana-Today-News.jpg", "publishedAt": "2020-05-12T14:27:48Z", "content": "New York: A new blood test may help identify individuals whose plasma contains antibodies to SARS-CoV-2 virus that causes COVID-19, and could potentially be used to treat other patients, scientists said on Tuesday.\r\nTests that detect the presence of SARS-CoV-… [+1937 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service| Posted by: Alfea Jamal", "title": "Here’s how too little sleep may lead to asthma attacks in adults - Hindustan Times", "description": "A good night’s sleep is crucial to good health because researchers have found that too little sleep, and occasionally too much sleep, can negatively impact adults with asthma.", "url": "https://www.hindustantimes.com/more-lifestyle/here-s-how-too-little-sleep-may-lead-to-asthma-attacks-in-adults/story-EM1Y4ukDn9qzvCKMBF0fCI.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/12/Pictures/_8379fe96-9451-11ea-bea3-7211baa10040.jpeg", "publishedAt": "2020-05-12T13:50:00Z", "content": "A good night’s sleep is crucial to good health because researchers have found that too little sleep, and occasionally too much sleep, can negatively impact adults with asthma.\r\nPrevious research revealed that poor sleep quality has a negative effect on asthma… [+2081 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Press Trust of India | Posted by: Alfea Jamal", "title": "Coronavirus: Smoking, COPD linked with higher death risk from Covid-19 - Hindustan Times", "description": "Being a current smoker or having chronic obstructive pulmonary disease (COPD) are associated with an increased risk of severe complications and higher death risk from COVID-19 infection.", "url": "https://www.hindustantimes.com/more-lifestyle/coronavirus-smoking-copd-linked-with-higher-death-risk-from-covid-19/story-ypSnZCTyPEOjRuKOnZN5YK.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/12/Pictures/_a2183ffc-9451-11ea-bea3-7211baa10040.jpg", "publishedAt": "2020-05-12T13:50:00Z", "content": "Being a current smoker or having chronic obstructive pulmonary disease (COPD) are associated with an increased risk of severe complications and higher death risk from COVID-19 infection, according to a study.\r\n COPD is a common, persistent dysfunction of the … [+1980 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Reuters| Posted by: Alfea Jamal", "title": "Coronavirus: WHO sees ‘potentially positive data’ on Covid-19 treatments - Hindustan Times", "description": "The Geneva-based WHO is leading a global initiative to develop safe and effective drugs, tests and vaccines to prevent, diagnose and treat COVID-19. The respiratory illness caused by the novel coronavirus has infected 4.19 million people around the world.", "url": "https://www.hindustantimes.com/more-lifestyle/coronavirus-who-sees-potentially-positive-data-on-covid-19-treatments/story-ciUZoNMpUZfyz4HBPNKcjI.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/12/Pictures/virus-outbreak-indonesia_52784ba6-9454-11ea-bea3-7211baa10040.jpg", "publishedAt": "2020-05-12T13:34:00Z", "content": "The World Health Organization said on Tuesday that some treatments appear to be limiting the severity or length of the COVID-19 disease and said it was focusing on learning more about four or five of the most promising ones.\r\nThe Geneva-based WHO is leading a… [+1251 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "New Artificial Intelligence Tool to Predict Covid-19 Without Testing: Study - News18", "description": "The artificial intelligence (AI) model, described in the journal Nature Medicine, uses data from the COVID Symptom Study app to predict SARS-CoV-2 infection by comparing people's symptoms and the results of diagnostic tests.", "url": "https://www.news18.com/news/world/new-artificial-intelligence-tool-to-predict-covid-19-without-testing-study-2617009.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/05/1588855059_2020-05-07t122149z_1_lynxmpeg460zu_rtroptp_4_health-coronvairus-syndrome-kids-1.jpg", "publishedAt": "2020-05-12T13:19:45Z", "content": "Researchers have developed an AI tool to predict whether someone is likely to have COVID-19 based on their symptoms alone, an advance which they say can help make better estimates of the disease spread in areas with limited testing. \r\nThe artificial intellige… [+3334 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Adam Forrest", "title": "Coronavirus: WHO condemns idea of herd immunity for Covid-19 as 'dangerous' - The Independent", "description": "Health emergency director at World Health Organisation condemns idea nations with lax restrictions will ‘all of a sudden magically reach some herd immunity’", "url": "https://www.independent.co.uk/news/health/coronavirus-herd-immunity-who-uk-matt-hancock-a9510231.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/05/12/12/michael-ryan-who.jpg", "publishedAt": "2020-05-12T13:08:58Z", "content": "The World Health Organisation has condemned the dangerous concept of herd immunity for managing the coronavirus pandemic.\r\nDr Michael Ryan, executive director of the WHOs health emergencies programme said it was wrong to think that countries can magically mak… [+3772 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Covid-19: Expert warns many countries are driving blind as they reopen - India Today", "description": "How to safely reopen businesses and schools but not kick off a second wave of coronavirus infections will be a key topic Tuesday as infectious disease experts testify at a Senate hearing - a setting where the agenda is not controlled by President Donald Trump.", "url": "https://www.indiatoday.in/world/story/covid-19-expert-warns-many-countries-are-driving-blind-as-they-reopen-1677222-2020-05-12", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/1000__1__0-647x363.jpeg?ctx4tSTkv2bSnCidy7931h7N9Lalx2Jt", "publishedAt": "2020-05-12T12:54:39Z", "content": "How to safely reopen businesses and schools but not kick off a second wave of coronavirus infections will be a key topic Tuesday as infectious disease experts testify at a Senate hearing - a setting where the agenda is not controlled by President Donald Trump… [+7153 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Can 100-year-old TB vaccine be SA's secret weapon against Covid-19? - Multimedia LIVE", "description": "A clinical research centre in Cape Town called TASK has begun a vaccine clinical trial on 500 health workers to determine if the Bacille Calmette-Guerin (BCG...", "url": "https://www.youtube.com/watch?v=u_vV89kCua4", "urlToImage": "https://i.ytimg.com/vi/u_vV89kCua4/maxresdefault.jpg", "publishedAt": "2020-05-12T12:45:35Z", "content": "A clinical research centre in Cape Town called TASK has begun a vaccine clinical trial on 500 health workers to determine if the Bacille Calmette-Guerin (BCG) vaccine can prevent people from contracting the coronavirus or limit the severity of Covid-19 sympto… [+166 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "New AI tool to predict COVID-19 without testing: Study - Deccan Herald", "description": "Researchers have developed an AI tool to predict whether someone is likely to have COVID-19 based on their symptoms alone, an advance which they say can help make better estimates of the disease spread in areas with limited testing. The artificial intelligenc…", "url": "https://www.deccanherald.com/science-and-environment/new-ai-tool-to-predict-covid-19-without-testing-study-836791.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/12/covid%20symptom%20app-1589285944.png", "publishedAt": "2020-05-12T12:08:01Z", "content": "Researchers have developed an AI tool to predict whether someone is likely to have COVID-19 based on their symptoms alone, an advance which they say can help make better estimates of the disease spread in areas with limited testing.\r\nThe artificial intelligen… [+3364 chars]"}, {"source": {"id": null, "name": "Thequint.com"}, "author": "Saakhi Chadha", "title": "Ethics Vs Urgency: Infecting People With a Virus to Test Vaccines - The Quint", "description": "COVID-19 Vaccine: A human challenge trial fast-tracks vaccine development by deliberately infecting individuals with the virus, to see if the candidate works in protecting them from the diseases. But are they ethical?", "url": "https://fit.thequint.com/coronavirus/controversial-human-challenge-trials-for-vaccine-development-for-covid-19", "urlToImage": "https://images.assettype.com/thequint-fit/2020-05/2ebd235f-db69-4714-9a05-e7fc28639d16/800.jpeg", "publishedAt": "2020-05-12T11:39:51Z", "content": "A team of researchers at Rutgers University in New Jersey has actively advocated these studies for COVID-19, by challenging volunteers with the live virus while also laying down ways to ensure the safety and ethicality of the experiments. We argue that such s… [+1823 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "CNA", "title": "WHO sees 'potentially positive data' on COVID-19 treatments - CNA", "description": "The World Health Organization said on Tuesday that some treatments appear to be limiting the severity or length of the COVID-19 respiratory disease and said the body is focusing on learning more about four or five of the most promising ones.", "url": "https://www.channelnewsasia.com/news/world/covid-19-who-positive-data-coronavirus-treatments-12725118", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12725116/16x9/991/557/b7c039043fe033c4c2aacd77f397f0ba/Il/file-photo--file-photo--a-logo-is-pictured-on-the-headquarters-of-the-who-in-geneva-1.jpg", "publishedAt": "2020-05-12T11:26:50Z", "content": "GENEVA: The World Health Organization said on Tuesday (May 12) that some treatments appear to be limiting the severity or length of the COVID-19 disease and said it was focusing on learning more about four or five of the most promising ones.\r\nThe Geneva-based… [+3296 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Agencies", "title": "WHO says some treatments appear to be limiting severity of coronavirus - Livemint", "description": "WHO also said it was focusing on learning more about four or five of the most promising Covid-19 treatments.'We do have potentially positive data coming out but we need to see more data to be 100% confident that we can say this treatment over that one,' said …", "url": "https://www.livemint.com/news/world/who-says-some-treatments-appear-to-be-limiting-severity-of-coronavirus-11589282059930.html", "urlToImage": "https://images.livemint.com/img/2020/05/12/600x338/2020-05-12T104149Z_1_LYNXMPEG4B0SY_RTROPTP_3_HEALTH-CORONAVIRUS-WHO_1589282604913_1589282617079.JPG", "publishedAt": "2020-05-12T11:24:39Z", "content": "Geneva: The World Health Organization said on Tuesday that some treatments appear to be limiting the severity or length of the COVID-19 respiratory disease and said the body is focusing on learning more about four or five of the most promising ones.\"We do hav… [+2478 chars]"}, {"source": {"id": null, "name": "Kalingatv.com"}, "author": "IANS", "title": "COVID-19 infection in kids may not start with a cough - Kalinga TV", "description": "Beijing: Gastrointestinal symptoms such as diarrhoea, coupled with a fever or history of exposure to COVID-19, could indicate coronavirus infection in children, according to a new study.Published in the journal Frontiers in Pediatrics, the research a", "url": "https://kalingatv.com/miscellany/covid-19-infection-in-kids-may-not-start-with-a-cough/", "urlToImage": "https://cdn.kalingatv.com/wp-content/uploads/2020/05/e5582fedc7f361ba1d09eb95b7899176.jpg", "publishedAt": "2020-05-12T11:20:00Z", "content": "Beijing: Gastrointestinal symptoms such as diarrhoea, coupled with a fever or history of exposure to COVID-19, could indicate coronavirus infection in children, according to a new study.\r\nPublished in the journal Frontiers in Pediatrics, the research also sug… [+2902 chars]"}, {"source": {"id": null, "name": "Weforum.org"}, "author": "Mariana Mazzucato, Els  Toreele", "title": "This is how to fairly create a global vaccine for COVID-19 - World Economic Forum", "description": "Strong health systems, adequate testing capacity, and an effective, universally available vaccine will be key to protecting societies from COVID-19.", "url": "https://www.weforum.org/agenda/2020/05/how-to-develop-a-covid-19-vaccine-for-all/", "urlToImage": "https://assets.weforum.org/editor/ksP_raD8uBfAeXzEU4SLIPweNOwDZksc1Fg44ptWc3k.jpg", "publishedAt": "2020-05-12T11:15:16Z", "content": "<ul><li>Strong health systems, adequate testing capacity, and an effective, universally available vaccine will be key to protecting societies from COVID-19.</li><li>Ensuring that no one is left behind requires not just unprecedented collective investment, but… [+5067 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Basit Aijaz", "title": "Italy Is Recovering As Less Than 1,000 COVID-19 Patients In ICU Now For First Time In 2 Months - Indiatimes.com", "description": "While Italy is one of the hardest hit by coronavirus, the country is finally seeing some positives in nearly two months of battling the virus as more than 1,00,000 people have recovered from COVID-19.                         Reuters Also on Monday, the civil …", "url": "https://www.indiatimes.com/news/world/less-than-1000-covid-19-patients-in-icu-in-italy-for-the-first-time-in-2-months-513020.html", "urlToImage": "https://im.indiatimes.in/content/2020/May/25271_5eba4844128be.jpg", "publishedAt": "2020-05-12T11:09:26Z", "content": "While Italy is one of the hardest hit by coronavirus, the country is finally seeing some positives in nearly two months of battling the virus as more than 1,00,000 people have recovered from COVID-19. \r\nReuters \r\nAlso on Monday, the civil protection agency sa… [+1789 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Aanchal Nigam", "title": "Study: Animals follow social distancing to prevent contraction of microbes - Republic World - Republic World", "description": "A new study by UTSA researchers has revealed that animals have long followed social distancing rules when it comes to microorganisms found in their gut.", "url": "https://www.republicworld.com/world-news/rest-of-the-world-news/study-animals-follow-social-distancing-to-prevent-contraction.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/foc6flkfmqaercpu_1589280326.jpeg?tr=f-jpeg", "publishedAt": "2020-05-12T11:08:18Z", "content": "Amid the unprecedented outbreak of deadly coronavirus, maintaining social distance has been one of the most touted methods to prevent the contraction of COVID-19 disease. While lockdowns have been imposed across the world, a new study has revealed that animal… [+2246 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Kaunain Sheriff M", "title": "Covid & summer: Still an unsettled question - The Indian Express", "description": "Despite initial suggestions that seasonality would strongly control Covid-19, the researchers said weather only explains 17% of the variation in Covid-19 growth rates.", "url": "https://indianexpress.com/article/explained/covid-summer-temperature-correlation-6405358/", "urlToImage": "https://images.indianexpress.com/2020/05/summer.jpg?w=759", "publishedAt": "2020-05-12T10:45:28Z", "content": "A man carries air-coolers on a rickshaw trolley, which are in demand during summer season, amid ongoing COVID-19 lockdown in Jabalpur, Thursday, April 30, 2020. (PTI Photo)The arrival of summer may have raised hopes that the novel coronavirus will not survive… [+4888 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "IANS", "title": "Children, young adults face severe complication, death risk from COVID-19 - Times Now", "description": "While children are more likely to get very sick if they have other chronic conditions, including obesity, it is important to note that children without chronic illness are also at risk, says a new study.", "url": "https://www.timesnownews.com/health/article/children-young-adults-face-severe-complication-death-risk-from-covid/590796", "urlToImage": "https://imgk.timesnownews.com/story/covid-in-kids.gif?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-12T10:45:23Z", "content": "New York: Researchers, including one of Indian-origin, have revealed that children, teenagers and young adults are at greater risk for severe complications from COVID-19 and those with underlying health conditions are at even greater risk of death.\r\n\"This stu… [+2525 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Isobel Asher Hamilton", "title": "Iceland had the most-downloaded contact-tracing app for its population size. Authorities there say it hasn't m - Business Insider India", "description": "Governments around the world are racing to build and deploy contact-tracing apps to help track and curb the spread of the coronavirus. One of the challenges", "url": "https://www.businessinsider.in/tech/news/iceland-had-the-most-downloaded-contact-tracing-app-for-its-population-size-authorities-there-say-it-hasnt-made-much-difference-/articleshow/75695539.cms", "urlToImage": "https://www.businessinsider.in/photo/75695539/iceland-had-the-most-downloaded-contact-tracing-app-for-its-population-size-authorities-there-say-it-hasnt-made-much-difference-.jpg?imgsize=487487", "publishedAt": "2020-05-12T10:40:00Z", "content": "Iceland appears to be leading the pack among countries building contact-tracing apps to help curb the spread of the coronavirus, but it turns out the app has not been the hoped-for game changer.\r\nMIT Tech Review reports that per capita, Iceland's download rat… [+4140 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Reuters", "title": "China calls for coronavirus vigilance, warns against complacency - Hindustan Times", "description": "In the past two weeks, new cases have been reported in seven provinces, including Hubei, the original epicentre of the outbreak late last year.", "url": "https://www.hindustantimes.com/world-news/china-calls-for-coronavirus-vigilance-warns-against-complacency/story-oTilEPuX53jmfWnaGcO7lN.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/12/Pictures/staff-member-takes-worker-temperature-measurement-wuhan_3c06ad22-943b-11ea-84fe-62f09e00e282.jpg", "publishedAt": "2020-05-12T10:28:00Z", "content": "Chinese health authorities called on Tuesday called for vigilance to be maintained against the novel coronavirus as new clusters emerge, even though the peak of the epidemic has passed in the country where it first appeared.\r\nIn the past two weeks, new cases … [+2510 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Banjot Kaur", "title": "COVID-19: What Did India Gain From the Nationwide Lockdown? - The Wire", "description": "The three-day average of the number of cases in India is currently at 3,060. The number was at 76 at the beginning of the lockdown.", "url": "https://science.thewire.in/health/covid-19-what-did-india-gain-in-the-nationwide-lockdown/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2020/05/12163336/Screen-Shot-2020-05-03-at-4.59.36-PM.png", "publishedAt": "2020-05-12T09:34:31Z", "content": "A man wearing a face mask sits near closed shops, during the ongoing COVID-19 lockdown, in Beawar, Sunday, May 03, 2020. Photo: PTI\r\nIndia is witness to the biggest lockdown of people in the world, since it was announced. As many as 1.3 billion people were co… [+10878 chars]"}, {"source": {"id": null, "name": "Statnews.com"}, "author": null, "title": "When a Covid-19 vaccine is available, all Americans should get it - STAT", "description": "Getting the coronavirus vaccine should be required of all Americans — or at the very least for schoolchildren and workers in direct-contact jobs.", "url": "https://www.statnews.com/2020/05/12/covid-19-vaccine-all-americans-should-get-it/", "urlToImage": "https://www.statnews.com/wp-content/uploads/2020/05/AdobeStock_321669462-1024x576.jpeg", "publishedAt": "2020-05-12T08:57:20Z", "content": "My work as an emergency medicine physician has taken me to urban and rural areas on both coasts and in the middle of the country. No matter where I see patients, I hear excuses like these for not getting immunized against influenza:\r\n<ul><li>Flu shots dont wo… [+7957 chars]"}, {"source": {"id": null, "name": "Manoramaonline.com"}, "author": "IANS", "title": "Men more vulnerable to COVID-19 due to presence of this enzyme - Onmanorama", "description": "Research of several thousand patients shows that men have higher concentrations of angiotensin-converting enzyme 2 (ACE2) in their blood than women.", "url": "https://english.manoramaonline.com/lifestyle/health/2020/05/12/men-more-vulnerable-to-covid-19-presence-enzyme.html", "urlToImage": "https://img.manoramaonline.com/content/dam/mm/en/lifestyle/health/images/2020/5/12/coronavirus-graphic-new-c.jpg", "publishedAt": "2020-05-12T08:03:05Z", "content": "London: After several studies revealed that men are more vulnerable to COVID-19 infection, evidence from a new larger research of several thousand patients shows that men have higher concentrations of angiotensin-converting enzyme 2 (ACE2) in their blood than… [+2981 chars]"}, {"source": {"id": null, "name": "Microbiozindia.com"}, "author": null, "title": "Coronavirus contamination in kids may not begin with hacks: Study - Microbioz India", "description": "Kids experiencing non-respiratory infection side effects like the runs and fever, or those with a background marked by introduction to the novel coronavirus, ought to be associated with having COVID-19, another examination says.\r\n\r\nAs per the examination, dis…", "url": "https://microbiozindia.com/health-news/coronavirus-contamination-in-kids-may-not-begin-with-hacks-study/", "urlToImage": "https://microbiozindia.com/wp-content/uploads/2020/05/5d85234d-94e9-4f9c-9195-a735251b224a.jpg", "publishedAt": "2020-05-12T07:51:07Z", "content": "Kids experiencing non-respiratory infection side effects like the runs and fever, or those with a background marked by introduction to the novel coronavirus, ought to be associated with having COVID-19, another examination says.\r\nAs per the examination, distr… [+3590 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Coronavirus Infection in Children May Start With Diarrhea, Not Cough: Study - News18", "description": "COVID-19 might infect patients not only through the respiratory tract in the form of air droplets, but also through the digestive tract by contact or fecal-oral transmission.", "url": "https://www.news18.com/news/india/coronavirus-infection-in-children-may-start-with-diarrhea-not-cough-study-2616357.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1588092687_2020-04-28t130445z_1_lynxnpeg3r1d9_rtroptp_4_health-coronavirus-southasia.jpg", "publishedAt": "2020-05-12T06:59:28Z", "content": "Children suffering from non-respiratory disease symptoms like diarrhea and fever, or those with a history of exposure to the novel coronavirus, should be suspected of having COVID-19, a new study says.\r\nAccording to the research, published in the journal Fron… [+3270 chars]"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Nirmal Narayanan", "title": "Scientist who fell ill due to coronavirus says world will never return to normal - International Business Times, India Edition", "description": "The world will be witnessing a 'new normal' scenario if healthcare experts fail to develop an effective vaccination for coronavirus.", "url": "https://www.ibtimes.co.in/scientist-who-fell-ill-due-coronavirus-says-world-will-never-return-normal-819685", "urlToImage": "https://data1.ibtimes.co.in/en/full/737837/coronavirus-mutation.jpg", "publishedAt": "2020-05-12T06:54:05Z", "content": "Where is China's \"patient zero?\"\r\nWith over 2,84,700 deaths and more than 4.2 million positive cases, the novel coronavirus is continuing its deadly killing spree in all nooks of the world. As healthcare experts have not succeeded in developing an effective v… [+2195 chars]"}, {"source": {"id": null, "name": "Tribuneindia.com"}, "author": "Tribune India", "title": "COVID-19 positive Indian dies of heart attack in Singapore - The Tribune", "description": "", "url": "https://www.tribuneindia.com/news/coronavirus/covid-19-positive-indian-dies-of-heart-attack-in-singapore-83800", "urlToImage": "https://cms.tribuneindia.com/gallary_content/2020/5/2020_5$largeimg_2133426550.jpg", "publishedAt": "2020-05-12T06:46:00Z", "content": "Singapore, May 12 \r\nA 53-year-old Indian national in Singapore, who tested positive for the coronavirus, died after suffering a cardiac arrest, the health ministry said.\r\nThe man died on May 9 and his COVID-19 test report came on May 10, it said on Monday.\r\nT… [+1561 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Bloomberg", "title": "The Covid-19 symptoms you didn’t know about - Livemint", "description": "Here’s a snapshot of some of the symptoms coronavirus causes, including some you might not have heard about", "url": "https://www.livemint.com/news/world/the-covid-19-symptoms-you-didn-t-know-about-11589260714138.html", "urlToImage": "https://images.livemint.com/img/2020/05/12/600x338/9611f1a2d0324abcab6fb820bb209e42-9611f1a2d0324abcab6fb820bb209e42-1_1589261288998_1589261298481.jpg", "publishedAt": "2020-05-12T05:28:58Z", "content": "As the pandemic spreads around the world, doctors are beginning to scope the coronaviruss damage. Seen initially as a cause of viral pneumonia during the chaos of an explosion of cases in China, its now emerging as an enigmatic pathogen capable of harming the… [+4527 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Early mammography screening cuts fatal breast cancer risk: Study - Daijiworld.com", "description": "", "url": "http://www.daijiworld.com/news/newsDisplay.aspx?newsID=707178", "urlToImage": "http://www.tvdaijiworld.com/images6/asha_12520_mammgrm.jpg", "publishedAt": "2020-05-12T04:15:07Z", "content": "London, May 12 (IANS): An analysis of more than half a million women has revealed that early mammography screening reduces the rates of advanced and fatal breast cancers, say researchers.\r\nFor the findings, published in the journal CANCER, the research team e… [+1468 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Associated Press", "title": "New York City’s coronavirus death toll may be worse than official numbers, study finds - MarketWatch", "description": "Additional 5,300 deaths could have been caused by COVID-19", "url": "http://www.marketwatch.com/story/new-york-citys-coronavirus-death-toll-may-be-worse-than-official-numbers-study-finds-2020-05-11", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-IG299_nyc051_ZG_20200511232210.jpg", "publishedAt": "2020-05-12T03:23:00Z", "content": "NEW YORK New York Citys death toll from the coronavirus may be thousands of fatalities worse than the tally kept by the city and state, according to an analysis released Monday by the U.S. Centers for Disease Control and Prevention.Between March 11 and May 2,… [+1579 chars]"}, {"source": {"id": null, "name": "Dnaindia.com"}, "author": "DNA Web Team", "title": "Revised discharge policy a move toward ‘symptom-based' or ‘time-based' strategy: Centre - DNA India", "description": "The government said that the discharge policy was changed because several countries have changed their discharge criteria from 'test-based strategy to 'symptom-based strategy or 'time-based strategy'.", "url": "https://www.dnaindia.com/india/report-revised-discharge-policy-a-move-toward-symptom-based-or-time-based-strategy-centre-2824458", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2020/05/11/905715-mumbai-coronavirus-screening.jpg", "publishedAt": "2020-05-12T02:27:36Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "93 cases of mystery illness possibly linked to COVID-19 in NY - Eyewitness News ABC7NY", "description": "Governor Andrew Cuomo said Monday that there are now 93 cases of Pediatric Multi-System Inflammatory Syndrome, a mysterious illness with symptoms similar to ...", "url": "https://www.youtube.com/watch?v=rdTRQ9EHdzc", "urlToImage": "https://i.ytimg.com/vi/rdTRQ9EHdzc/maxresdefault.jpg", "publishedAt": "2020-05-12T01:35:12Z", "content": "Governor Andrew Cuomo said Monday that there are now 93 cases of Pediatric Multi-System Inflammatory Syndrome, a mysterious illness with symptoms similar to Kawasaki Disease that is believed to be related to COVID-19, in New York.\r\nAs of Sunday, at least 38 o… [+796 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Imported face masks failing to protect first responders from coronavirus - CBS Evening News", "description": "Face masks have been in high demand during the coronavirus pandemic, but first responders in Massachusetts have discovered some imported masks from China hav...", "url": "https://www.youtube.com/watch?v=PqDT8lv13h4", "urlToImage": "https://i.ytimg.com/vi/PqDT8lv13h4/maxresdefault.jpg", "publishedAt": "2020-05-11T23:01:46Z", "content": null}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Sakshi Dayal", "title": "In Gurgaon, nod to 1,000 industrial units to resume operations - The Indian Express", "description": "According to officials, since April 20, when the administration began granting permission to industries to resume work, a total of 1,330 establishments, with a cumulative staff of 1,06,751 workers, have been permitted to resume work.", "url": "https://indianexpress.com/article/cities/delhi/in-gurgaon-nod-to-industrial-units-to-resume-operations-6405488/", "urlToImage": "https://images.indianexpress.com/2020/05/gurgaon-industry.jpg?w=1024", "publishedAt": "2020-05-11T22:16:15Z", "content": "Written by Sakshi Dayal\r\n | Delhi | \r\nPublished: May 12, 2020 3:44:47 am\r\n1,330 establishments with staff of 1,06,751 workers have been permitted to resume work since April 20.Over 1,000 industrial establishments and more than 90 construction sites in Gurgaon… [+2441 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Baishali Adak", "title": "Mosquito-borne diseases in Capital on the rise - Hindustan Times", "description": "Malaria cases in Delhi have more than quadrupled from four cases, reported between January 1, 2019 and May 9, 2019, to 18 cases reported between the same period this year.", "url": "https://www.hindustantimes.com/delhi-news/mosquito-borne-diseases-in-capital-on-the-rise/story-dOJwY4WHj2DJBdC26ddYDN.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/12/Pictures/delhi-lockdown-covid-19-day-48_7fdc60a2-93d0-11ea-9070-932bbf5d90a5.jpg", "publishedAt": "2020-05-11T21:44:00Z", "content": "Mosquito-borne diseases in the national Capital are rising at an alarming rate adding to the worries of civic agencies that are struggling to contain the spread of the coronavirus disease (Covid-19) pandemic. \r\nUntil May 9 this year, areas under all five muni… [+2592 chars]"}, {"source": {"id": null, "name": "Medscape.com"}, "author": null, "title": "Triple Antiviral Combo May Speed COVID-19 Recovery - Medscape", "description": "The combination of interferon-beta1, lopinavir/ritonavir, and ribavirin shortened median time to COVID-19 viral negativity by 5 days, according to results of an open-label, randomized phase 2 trial.", "url": "https://www.medscape.com/viewarticle/930336", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_200511_coronavirus_begative_test_five_days_800x450.jpg", "publishedAt": "2020-05-11T21:26:51Z", "content": "Editor's note: Find the latest COVID-19 news and guidance in Medscape's Coronavirus Resource Center.\r\nA triple-antiviral therapy regimen of interferon-beta1, lopinavir/ritonavir, and ribavirin shortened median time to COVID-19 viral negativity by 5 days in a … [+7028 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Leah Sherwood, Science Advisory Board contributing writer", "title": "Researchers call for rapid drug repurposing to fight COVID-19 - The Science Board", "description": "Filling the therapeutic gap for coronavirus treatments with existing drugs approved for other uses could greatly benefit patients around the world. Researchers from the University of Kentucky urged the scientific community to quickly identify drugs that may b…", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=745", "urlToImage": "https://www.scienceboard.net/user/images/content_images/sup_bioproc/2020_03_02_21_32_8019_pharmaceutical_scientific_20200302215911.jpeg", "publishedAt": "2020-05-11T20:44:37Z", "content": "Until recently, coronaviral drug discovery had been a low priority relative to efforts to fight other viral diseases such as influenza, despite the fact that previous coronaviruses were responsible for recent epidemics such as severe acute respiratory syndrom… [+2359 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Astha Saxena", "title": "Delhi: Malaria, dengue cases creeping up - The Indian Express", "description": "The South, North and East civic bodies have prepared a roadmap of activities — fogging and awareness drives — to be carried out in the coming days.", "url": "https://indianexpress.com/article/cities/delhi/delhi-malaria-dengue-cases-creeping-up-6405419/", "urlToImage": "https://images.indianexpress.com/2020/04/malaria_759.jpg?w=759", "publishedAt": "2020-05-11T20:38:23Z", "content": "At North MCD, a campaign was launched against mosquito-borne diseases Wednesday. (Source: File/Getty Images/Thinkstock)As Delhi continues to deal with Covid-19 cases, cases of vector-borne diseases are slowly rising. The weekly report prepared by the South De… [+2165 chars]"}, {"source": {"id": null, "name": "Medscape.com"}, "author": null, "title": "Does Vitamin D Protect Against COVID-19? - Medscape", "description": "Dr JoAnn Manson reviews new data suggesting a link between COVID-19 infection and severity with low serum vitamin D levels.", "url": "https://www.medscape.com/viewarticle/930152", "urlToImage": "https://img.medscape.com/thumbnail_library/Manson_on_WomensHealth_800x600.jpg", "publishedAt": "2020-05-11T19:41:39Z", "content": "Find the latest COVID-19 news and guidance in Medscape's Coronavirus Resource Center.\r\nThis transcript has been edited for clarity.\r\nHello. This is Dr JoAnn Manson, professor of medicine at Harvard Medical School and Brigham and Women's Hospital.\r\nI'd like to… [+3577 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus crisis | These four COVID-19 vaccines are ahead of the pack - Moneycontrol", "description": "Over 100 potential COVID-19 vaccines are currently under development, but four are ahead of the pack.", "url": "https://www.moneycontrol.com/news/trends/health-trends/coronavirus-crisis-these-four-covid-19-vaccines-are-ahead-of-the-pack-5247601.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/05/Moderna-Coronavirus-vacine-770x433.jpg", "publishedAt": "2020-05-11T19:02:00Z", "content": "The race to develop a vaccine against COVID-19 is intensifying globally.\r\nOver 100 potential coronavirus vaccines are currently under development, but four vaccines are ahead of the pack. Here are the frontrunners:\r\nOxford University vaccine\r\nOne of the poten… [+4956 chars]"}, {"source": {"id": null, "name": "Medicalxpress.com"}, "author": "Lisa Marshall", "title": "We're hard-wired for longing, new study suggests - Medical Xpress", "description": "When it comes to forming a lasting bond, our longing for a partner may be as important as—if not more important than—how we react when we're with them, suggests a surprising new brain imaging study published in the Proceedings of the National Academy of Scien…", "url": "https://medicalxpress.com/news/2020-05-hard-wired.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/areourbrains.jpg", "publishedAt": "2020-05-11T18:51:26Z", "content": "When it comes to forming a lasting bond, our longing for a partner may be as important asif not more important thanhow we react when we're with them, suggests a surprising new brain imaging study published in the Proceedings of the National Academy of Science… [+4273 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Dr. Kamal Kant Kohli", "title": "Dual hormone combo effectively controls blood sugar in diabetes - Medical Dialogues", "description": "Researchers have devised a new way to combine insulin with a second hormone known as amylin to...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/dual-hormone-combo-effectively-controls-blood-sugar-in-diabetes-65676", "urlToImage": "https://medicaldialogues.in/h-upload/2020/02/04/123907-diabetes-drug.jpg", "publishedAt": "2020-05-11T18:45:00Z", "content": "Treatment of patients with diabetes with insulin and pramlintide is more effective than treatment with insulin only. However, because mixtures of insulin and pramlintide are unstable and have to be injected separately, amylin analogues are only used by 1.5% o… [+5697 chars]"}, {"source": {"id": null, "name": "Odishatv.in"}, "author": null, "title": "WHO Chief Scientist Commends India For Keeping COVID-19 Cases Low - Odisha Television Ltd.", "description": "World Health Organisation's Chief Scientist Soumya Swaminathan on Monday commended India for keeping the coronavirus cases and deaths very low compared to other countries and said it will play an important role in the development of a vaccine for COVID-19.", "url": "https://odishatv.in/coronavirus/who-chief-scientist-commends-india-for-keeping-covid-19-cases-low-450513", "urlToImage": "https://odishatv.in/wp-content/uploads/2020/05/World-Health-Organisations.jpg", "publishedAt": "2020-05-11T16:22:00Z", "content": "New Delhi: World Health Organisation’s Chief Scientist Soumya Swaminathan on Monday commended India for keeping the coronavirus cases and deaths very low compared to other countries and said it will play an important role in the development of a vaccine for C… [+2677 chars]"}, {"source": {"id": null, "name": "Deccanchronicle.com"}, "author": "T.S.S. Siddharth", "title": "The other side of Covid: 600 kg of biomedical waste nobody should touch ever again - Deccan Chronicle", "description": "The BMW generated each day also includes other wastes generated in the process of treating the coronavirus victims at the two hospitals", "url": "https://www.deccanchronicle.com/science/science/110520/the-other-side-of-covid-600-kg-of-biomedical-waste-nobody-should-touc.html", "urlToImage": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-gccnvgfe8rcrefcdu5a1jpqr94-20200511181802.Medi.jpeg", "publishedAt": "2020-05-11T12:52:00Z", "content": "Hyderabad: All the masks, PPEs, gloves discarded after use at the two Covid-19 designated hospitals in Hyderabad, Gandhi Hospital and Fever Hospital, are amounting to as much as 600 kg of biomedical waste (BMW) everyday.\r\nThe BMW generated each day also inclu… [+2037 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Coronavirus could spread via sexual intercourse as traces were was found in semen - Firstpost", "description": "We should not be surprised if the virus is found in the semen since this has happened with other viruses like Ebola and Zika.", "url": "https://www.firstpost.com/health/coronavirus-could-spread-via-sexual-intercourse-as-traces-were-was-found-in-semen-8356291.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/05/sperium-2505952_1280-1.jpghttps://images.firstpost.com/wp-content/uploads/2020/05/sperium-2505952_1280-1.jpg", "publishedAt": "2020-05-11T11:02:20Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "When will the COVID-19 pandemic end? And how? - ETHealthworld.com", "description": "Endings “are very, very messy,” said Dora Vargha, a historian at the University of Exeter. “Looking back, we have a weak narrative. For whom does the epidemic ended, and who gets to say?”", "url": "https://health.economictimes.indiatimes.com/news/industry/when-will-the-covid-19-pandemic-end-and-how/75674711", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-75674711,imgsize-50268,width-800,height-434,overlay-ethealthworld/when-will-the-covid-19-pandemic-end-and-how.jpg", "publishedAt": "2020-05-11T10:55:20Z", "content": "According to historians, pandemics typically have two types of endings: the medical, which occurs when the incidence and death rates plummet, and the social, when the epidemic of fear about the disease wanes.When people ask, When will this end?, they are aski… [+10520 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "People who should never try Intermittent Fasting, according to experts - Times of India", "description": "Like any diet, Intermittent Fasting too has its share of cons. There are certain times the diet may not work for certain people.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/people-who-should-never-try-intermittent-fasting-according-to-experts/photostory/75673131.cms", "urlToImage": "https://static.toiimg.com/photo/75673272.cms", "publishedAt": "2020-05-11T09:29:28Z", "content": "Although some studies say that certain diets, including intermittent fasting, can help control diabetes, for those with acute diabetes, or dependent on insulin, adopting the diet plan can be quite threatening. Prolong fasting window can affect blood sugar lev… [+239 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Coronavirus vaccine: India joins hunt for Covid-19 vaccine with ICMR-Bharat Biotech partnership - India Today", "description": "India has joined the international race to develop a vaccine for the novel coronavirus with the ICMR typing up with Bharat Biotech over the weekend. Globally, eight prospective vaccines have entered human trials as the novel coronavirus pandemic continues una…", "url": "https://www.indiatoday.in/science/story/coronavirus-vaccine-news-update-india-icmr-bharat-biotech-tie-up-1676735-2020-05-11", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/coronavirus_vaccine_update_ind-647x363.jpeg?YxYe65jTxwe0hbqvVrcSnORMJidh.Td2", "publishedAt": "2020-05-11T09:23:28Z", "content": "India formally entered the global race to develop a vaccine for the novel coronavirus over the weekend, with the Indian Council for Medical Research (ICMR) tying up with the Hyderabad-based Bharat Biotech to develop \"a fully indigenous vaccine\" for Covid-19, … [+3421 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Dartunorro Clark", "title": "'A breaking point': Anti-lockdown efforts during Spanish flu offer a cautionary tale for coronavirus - NBCNews.com", "description": "During the Spanish flu era, officials pushing public health mandates to stop the pandemic in its tracks were met with pushback across the country.", "url": "https://www.nbcnews.com/politics/politics-news/breaking-point-anti-lockdown-efforts-during-spanish-flu-offer-cautionary-n1202111", "urlToImage": "https://media3.s-nbcnews.com/j/newscms/2020_19/3342901/200508-spanish-flu-masks-se-420_0684bb5e0be70bd2fc748c5946be89f7.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-05-11T08:30:00Z", "content": "America was tired.\r\nTired of the stay-at-home orders, mandatory masks, business closures and social distancing rules.\r\nDuring the Spanish flu era, officials pushing public health mandates to stop the pandemic in its tracks were met with pushback across the co… [+8260 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "ICMR issues guidance for appropriate recording of COVID-19 deaths to create robust data - The Hindu", "description": "In its guidance for appropriate recording of COVID-10 deaths in India, the ICMR said deaths with inconclusive test results, but in which coronavirus symptoms are present will be recorded as “probable COVID-19” fatalities", "url": "https://www.thehindu.com/news/national/icmr-issues-guidance-for-appropriate-recording-of-covid-19-deaths-to-create-robust-data/article31555423.ece", "urlToImage": "https://www.thehindu.com/news/national/lm8zuu/article31555432.ece/ALTERNATES/LANDSCAPE_615/TH23KallolTesGLR7CAL873jpgjpg", "publishedAt": "2020-05-11T06:53:22Z", "content": "COVID-19 would be recorded as an underlying cause of death when leading to pneumonia, cardiac injury and clotting in the bloodstream, among others, according to the guidance issued by ICMR for appropriate recording of deaths due to the disease in India.\r\nAlso… [+3620 chars]"}]}