{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Wionews.com"}, "author": "WION Web Team", "title": "Over 3,00,000 smokers in UK may have quit due to COVID-19 fears - WION", "description": "The survey of 1,004 people suggested 2% of smokers had quit because of concerns about coronavirus; 8% were trying to quit; 36% had cut down; and 27% were now more likely to quit.", "url": "https://www.wionews.com/world/over-300000-smokers-in-uk-may-have-quit-due-to-covid-19-fears-296545", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/05/04/139218-cigarette.jpg", "publishedAt": "2020-05-04T15:00:24Z", "content": "Over 3,00,000 in the UK may have quit smoking during the coronavirus crisis owing to the belief, supported by growing evidence, that smoking is associated with worse outcomes in those admitted to hospital with Covid-19.\r\nThe survey of 1,004 people suggested 2… [+628 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Krupa Trivedi", "title": "World Asthma Day 2020 theme and activities performed to mark the day - Republic World - Republic World", "description": "Check out the World Asthma Day theme 2020. It is celebrated on the first Tuesday of May month to raise awareness about asthma. Read on to know more.", "url": "https://www.republicworld.com/lifestyle/health/world-asthma-day-2020-theme-and-significance-of-the-day-read-details.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/fdayztok8tqcvlbl_1588584528.jpeg?tr=f-jpeg", "publishedAt": "2020-05-04T15:00:00Z", "content": "World Asthma Day will be celebrated on May 5, 2020, this year. Annually celebrated on the 1st Tuesday of May, the World Asthma Day event is organised by the Global Initiative for Asthma (GINA). The organisation works to increase perception about asthma diseas… [+2546 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "South Africa starts coronavirus trial of tuberculosis vaccine - Telangana Today", "description": "Cape Town: Hundreds of South African health workers were given a century-old tuberculosis vaccine on Monday in a trial to see whether the venerable formula can protect against coronavirus. Devised at France's legendary Pasteur Institute 100 years ago, the Bac…", "url": "https://telanganatoday.com/south-africa-starts-coronavirus-trial-of-tuberculosis-vaccine", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2020/05/S-Africa...jpg", "publishedAt": "2020-05-04T14:59:52Z", "content": "Cape Town: Hundreds of South African health workers were given a century-old tuberculosis vaccine on Monday in a trial to see whether the venerable formula can protect against coronavirus.\r\nDevised at France’s legendary Pasteur Institute 100 years ago, the Ba… [+1971 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "COVID-19 might never have a vaccine: Report - Northeast Now", "description": "Leading health experts have warned that scientists may not be able to develop a COVID-19 vaccine ever. “There are some viruses that we still do not have vaccines against,” reported The Hindustan Times quoting Dr David Nabarro, a professor of global health at …", "url": "https://nenow.in/health/covid-19-might-never-have-a-vaccine-report.html/", "urlToImage": "https://nenow.in/wp-content/uploads/2020/03/Coronavirus_vaccine.jpg", "publishedAt": "2020-05-04T14:52:57Z", "content": "Leading health experts have warned that scientists may not be able to develop a COVID-19 vaccine ever.\r\nThere are some viruses that we still do not have vaccines against, reported The Hindustan Times quoting Dr David Nabarro, a professor of global health at I… [+990 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "IANS", "title": "Coronavirus: Scientists find antibody that blocks infection by COVID-19 in cells - Livemint", "description": "The discovery is an initial step towards developing a fully human antibody to treat or prevent the respiratory disease COVID-19 caused by the novel coronavirus SARS-CoV-2", "url": "https://www.livemint.com/news/india/coronavirus-scientists-find-antibody-that-blocks-infection-by-covid-19-in-cells-11588599171695.html", "urlToImage": "https://images.livemint.com/img/2020/05/04/600x338/360908332_0-5_1585840944312_1588599929323.jpg", "publishedAt": "2020-05-04T13:49:24Z", "content": "LONDON :\r\nResearchers have identified a fully human monoclonal antibody that prevents the SARS-CoV-2 (COVID-19) virus from infecting cultured cells.The discovery, detailed in the journal Nature Communications, is an initial step towards developing a fully hum… [+2450 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Women, men may share some similar heart attack symptoms - Daijiworld.com", "description": "", "url": "https://www.daijiworld.com/news/newsDisplay.aspx?newsID=704379", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2020-05-04T13:37:34Z", "content": "London, May 4 (IANS): Researchers have revealed that women's heart attack symptoms are not all that different, adding that the top three heart attack symptoms in both women and men are chest pain, sweating, and shortness of breath.\r\nHeart attack symptoms are … [+2039 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Decoding SARS-COV-2: A dummy's guide to the dreaded virus - Moneycontrol", "description": "There is little reliable information available in the public domain about the virus, its origin, its structure, the peculiarities and its modality of the infection it causes.", "url": "https://www.moneycontrol.com/news/coronavirus/decoding-sars-cov-2-a-dummys-guide-to-the-dreaded-virus-5220311.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/05/1-2-770x433.jpg", "publishedAt": "2020-05-04T13:18:39Z", "content": "By Samrat Bora\r\nWith the novel coronavirus pandemic raging across the continents, there are a lot of advisories of dos and don'ts. Unfortunately, most of the information available is in bits and pieces leading to less of coherence and more of confusion.Hence,… [+7313 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Adam Payne", "title": "An official government mobile phone app could soon track millions of people in the UK in order prevent a secon - Business Insider India", "description": "The UK government is this week launching a mobile app for tracking and tracing the coronavirus. It will be trialled on the 141,000 people living on the Isle", "url": "https://www.businessinsider.in/politics/world/news/an-official-government-mobile-phone-app-could-soon-track-millions-of-people-in-the-uk-in-order-prevent-a-second-wave-of-coronavirus-infections/articleshow/75536909.cms", "urlToImage": "https://www.businessinsider.in/photo/75536909/an-official-government-mobile-phone-app-could-soon-track-millions-of-people-in-the-uk-in-order-prevent-a-second-wave-of-coronavirus-infections.jpg?imgsize=53598", "publishedAt": "2020-05-04T13:11:00Z", "content": "Millions of British people are set to have their location tracked by an official government mobile phone app, due to be trialled from this week, which is designed to prevent another spike in coronavirus infections.\r\nThe app, which will identify whether indivi… [+5228 chars]"}, {"source": {"id": null, "name": "Medgadget.com"}, "author": null, "title": "Kidney Dialysis Equipment Market Global Growth and Size Analysis Showcases Highest Revenue USD 29.9 Billion with Striking CAGR 6.6% till 2027 | Confirms CMI | - Medgadget", "description": "Global Kidney Dialysis Equipment Market Kidneys perform various crucial functions in the body, such as blood filtration, blood pressure regulation,", "url": "https://www.medgadget.com/2020/05/kidney-dialysis-equipment-market-global-growth-and-size-analysis-showcases-highest-revenue-usd-29-9-billion-with-striking-cagr-6-6-till-2027-confirms-cmi.html", "urlToImage": "https://www.medgadget.com/wp-content/uploads/2020/05/Kidney-Dialysis-Equipment-Market.png", "publishedAt": "2020-05-04T12:50:23Z", "content": "Global Kidney Dialysis Equipment Market Kidneys perform various crucial functions in the body, such as blood filtration, blood pressure regulation, hormone generation that helps produce red blood cells (RBCs), bone health promotion, and others. Chronic kidney… [+7067 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Rachael Rettner", "title": "More than 'covid toes': Numerous reports of skin rashes tied to COVID-19 - Live Science", "description": "", "url": "https://www.livescience.com/skin-rashes-covid-19-symptoms.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/pVwDN4FfVvGa8k9wwubWz4-1200-80.jpg", "publishedAt": "2020-05-04T12:35:14Z", "content": "Numerous reports of skin rashes in patients with COVID-19 are cropping up around the world.\r\nThe rashes can take many forms some appear as tiny red spots, while others appear as larger flat or raised lesions. Some have a hive-like appearance, while others loo… [+4810 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Supressing immune response may help avoid severe coronavirus symptoms: Study - Times of India", "description": "Science News: The body's first line of defence, the innate immune response, starts right after an infection, killing the virus and any cells damaged by it, said res", "url": "https://timesofindia.indiatimes.com/home/science/supressing-immune-response-may-help-avoid-severe-coronavirus-symptoms-study/articleshow/75535135.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75535437,width-1070,height-580,imgsize-1100193,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-05-04T12:03:00Z", "content": "LOS ANGELES: Temporarily suppressing the body's immune system during the early stages of Covid-19 could help a patient avoid severe symptoms of the deadly disease, according to a study. The research, published in the Journal of Medical Virology, shows that an… [+3125 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Aalok Sensharma", "title": "Coronavirus Pandemic: Six tips for pregnant women to keep themselves safe and heathy amid COVID-19 outbreak - Jagran English", "description": "Here are some tips for pregnant women to keep themselves safe and heathy amid coronavirus pandemic   Representational Image", "url": "https://english.jagran.com/lifestyle/coronavirus-pandemic-six-tips-for-pregnant-women-to-keep-themselves-safe-and-heathy-amid-covid19-outbreak-10011457", "urlToImage": "https://www.jagranimages.com/images/2020/may/30_01_2020-o-pregnancy-facebook_1_19980503_2222578571588593678596.jpg", "publishedAt": "2020-05-04T11:59:42Z", "content": "New Delhi | Jagran Lifestyle Desk: A woman's body gets most vulnerable when she is carrying another life in her womb. Amid the coronavirus pandemic, it gets more important for women to take care of themselves if they are pregnant as the infection spreads thro… [+3021 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The immune system: the body's natural defence | AFP Animé - AFP News Agency", "description": "The immune system continuously protects the human body from infectious diseases, bacteria, viruses, and parasites. Original videographic explaining the immun...", "url": "https://www.youtube.com/watch?v=XVq9JQVMwsk", "urlToImage": "https://i.ytimg.com/vi/XVq9JQVMwsk/hqdefault.jpg", "publishedAt": "2020-05-04T11:52:45Z", "content": "The immune system continuously protects the human body from infectious diseases, bacteria, viruses, and parasites. Original videographic explaining the immune system.VIDEOGRAPHICS\r\nSubscribe to AFP and activate your notifications to get the latest news http:/… [+33 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Plasma therapy 'no magic bullet' against Covid-19, need large-scale trials to prove efficacy: Experts - India Today", "description": "The convalescent plasma therapy is no \"magic bullet\" to deal with coronavirus, and only large-scale controlled trials can ascertain its efficacy as part of the treatment strategy, top medical experts said on Monday.", "url": "https://www.indiatoday.in/coronavirus-outbreak/story/plasma-therapy-no-magic-bullet-against-covid-19-need-large-scale-trials-to-prove-efficacy-experts-1674285-2020-05-04", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/Drug-647x363.jpeg?TZFTAhu1iDqKMqE2Fw847.U5EK7PKrYq", "publishedAt": "2020-05-04T11:44:36Z", "content": "The convalescent plasma therapy is no \"magic bullet\" to deal with coronavirus, and only large-scale controlled trials can ascertain its efficacy as part of the treatment strategy, top medical experts said on Monday, even as several states are considering the … [+5924 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Malaria 'completely stopped' by microbe - BBC News", "description": "Scientists say the microbe - found in the wild near Lake Victoria - has enormous potential.", "url": "https://www.bbc.com/news/health-52530828", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/BE00/production/_112104684_gettyimages-944691950-1.jpg", "publishedAt": "2020-05-04T11:31:21Z", "content": "Image copyrightGetty ImagesImage caption\r\n Malaria is spread by the bite of infected mosquitoes\r\nScientists have discovered a microbe that completely protects mosquitoes from being infected with malaria. \r\nThe team in Kenya and the UK say the finding has \"eno… [+3785 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Dr. Kamal Kant Kohli", "title": "Intensive blood pressure control reduces AF risk, finds study - Medical Dialogues", "description": "Hypertension and atrial fibrillation (AF) are two important public health priorities. Their...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/intensive-blood-pressure-control-reduces-af-risk-finds-study-65455", "urlToImage": "https://medicaldialogues.in/h-upload/2020/01/18/1200x630_123257-atrial-fibrillation.jpg?width=1200&height=630", "publishedAt": "2020-05-04T11:05:42Z", "content": "Hypertension and atrial fibrillation (AF) are two important public health priorities. Their prevalence is increasing worldwide, and both often coexist in the same patient.\r\nResearchers at Wake Forest School of Medicine have found that intensive blood pressure… [+2323 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Local Nurse Teaming Up To Provide Phone Chargers In Hospitals For COVID-19 Patients - CBS Chicago", "description": "When COVID patients have to rush to the hospital, many times, one key item is forgotten.", "url": "https://www.youtube.com/watch?v=dllHzldDmh4", "urlToImage": "https://i.ytimg.com/vi/dllHzldDmh4/maxresdefault.jpg", "publishedAt": "2020-05-04T11:01:31Z", "content": "When COVID patients have to rush to the hospital, many times, one key item is forgotten."}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Down the tubes: How Israel's poop may help prevent second coronavirus wave - The Times of Israel", "description": "Scientists say analyzing sewage from across the nation can help pinpoint infection areas and nip new cases in the bud", "url": "https://www.timesofisrael.com/down-the-tubes-how-israels-poop-may-prevent-second-coronavirus-wave/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2020/05/iStock-1097296452-1024x640.jpg", "publishedAt": "2020-05-04T11:00:47Z", "content": "The toilet flushes of every Israeli could soon play a central part in efforts to prevent a second wave of the coronavirus pandemic.\r\nAs Israels COVID-19 cases wane, health officials are worried about future outbreaks. They are determined to catch them early, … [+4895 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Investment in coronavirus (COVID-19) research is urgently needed | Wellcome - Wellcome Trust", "description": "At least $8 billion is needed to cover a funding shortfall for global COVID-19 research and development. Research remains the world’s best exit strategy from...", "url": "https://www.youtube.com/watch?v=BjrojMW09YE", "urlToImage": "https://i.ytimg.com/vi/BjrojMW09YE/maxresdefault.jpg", "publishedAt": "2020-05-04T10:51:20Z", "content": "At least $8 billion is needed to cover a funding shortfall for global COVID-19 research and development.\r\nResearch remains the worlds best exit strategy from COVID-19 and this initial funding boost a fraction of what governments have found to protect their ec… [+320 chars]"}, {"source": {"id": null, "name": "Alkhaleejtoday.co"}, "author": "Gulf News", "title": "Why does COVID-19 wallop some places and spare others? - AlKhaleej Today", "description": "Why does COVID-19 wallop some places and spare others?", "url": "https://alkhaleejtoday.co/international/89646/Why-does-COVID-19-wallop-some-places-and-spare-others.html", "urlToImage": "https://alkhaleejtoday.co/temp/resized/medium_2020-05-04-077105551e.jpg", "publishedAt": "2020-05-04T10:26:09Z", "content": "Thank you for your reading and interest in the news Why does COVID-19 wallop some places and spare others? and now with details\r\nAden - Yasmin Abdel Azim - Mourners pray before of an 87-year-old Muslim man originally from Algeria who died of COVID-19, in Thia… [+12153 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Abbott's Covid-19 Lab-based Antibody Tests to be Available in India by End of May - News18", "description": "Antibody testing is an important step to tell if someone has been previously infected. It will provide more understanding of the virus.", "url": "https://www.news18.com/news/business/abbotts-covid-19-lab-based-antibody-tests-to-be-available-in-india-by-may-end-2604961.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1586964976_abbott.jpg", "publishedAt": "2020-05-04T10:14:22Z", "content": "Global healthcare major Abbott on Monday said it has received CE mark for its laboratory-based serology blood tests for COVID-19 and these tests will be available in India by the end of May.\r\nThe company will begin shipping the tests to India during May and w… [+919 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Srishti Choudhary", "title": "Covid-19 may be here to stay, could hit in waves over next two years - Livemint", "description": "Scientists urged governments to plan for the worst-case scenario, including no vaccine availability or herd immunity.With global race for vaccine intensifying, the course of the pandemic could be influenced by a vaccine, but it is unlikely to be available unt…", "url": "https://www.livemint.com/news/india/covid-19-may-be-here-to-stay-could-hit-in-waves-over-next-two-years-11588585820842.html", "urlToImage": "https://images.livemint.com/img/2020/05/04/600x338/2020-04-30T114432Z_873633977_RC2ZEG9UZJND_RTRMADP_3_HEALTH-CORONAVIRUS-BRITAIN_1588520423344_1588586719308.JPG", "publishedAt": "2020-05-04T10:11:29Z", "content": "NEW DELHI: In what seems like the most probable scenario emerging from recent studies, covid-19 pandemic is here to stay and may hit in waves over the next two years with hotspots emerging in diverse geographical areas.The findings were shared by a global tea… [+3609 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Plasma therapy 'no magic bullet' against COVID-19; Need large-scale trials to prove efficacy: Experts - Yahoo India News", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiR2h0dHBzOi8vaW4ubmV3cy55YWhvby5jb20vcGxhc21hLXRoZXJhcHktbm8tbWFnaWMtYnVsbGV0LTEwMDg1MDg2NC5odG1s0gFPaHR0cHM6Ly9pbi5uZXdzLnlhaG9vLmNvbS9hbXBodG1sL3BsYXNtYS10aGVyYXB5LW5vLW1hZ2ljLWJ1bGxldC0xMDA4NTA4NjQuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-05-04T10:08:00Z", "content": null}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Hannah Beech, Alissa J. Rubin, Anatoly Kurmanaev, Ruth Maclean", "title": "As COVID-19 deaths pile up across globe, scientists ponder why the virus wallops some places and spares... - Firstpost", "description": "Experts are trying to figure out why the coronavirus is so capricious. The answers could determine how to best protect ourselves and how long we have to.", "url": "https://www.nytimes.com/2020/05/03/world/asia/coronavirus-spread-where-why.html", "urlToImage": "https://static01.nyt.com/images/2020/04/28/world/00virus-notspots/00virus-notspots-facebookJumbo.jpg", "publishedAt": "2020-05-04T09:13:36Z", "content": "The coronavirus has killed so many people in Iran that the country has resorted to mass burials, but in neighboring Iraq, the body count is fewer than 100.\r\nThe Dominican Republic has reported nearly 7,600 cases of the virus. Just across the border, Haiti has… [+15924 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Basit Mahmood", "title": "Sexually Active Gay and Bisexual Men Banned from U.K. COVID-19 Blood Plasma Trials - Newsweek", "description": "Doctors are carrying out tests to understand if blood plasma from those who have recovered from COVID-19 can be used to treat those who are ill with the virus.", "url": "https://www.newsweek.com/gay-bisexual-blood-coronavirus-1501724", "urlToImage": "https://d.newsweek.com/en/full/1586986/gay-bisexual-men-blood-plasma.jpg", "publishedAt": "2020-05-04T08:57:45Z", "content": "Gay and bisexual men have been told they cannot take part in blood plasma trials as part of efforts to treat COVID-19 patients because \"men who have sex with men are at an increased risk of acquiring certain infections through sex.\"\r\nDoctors are carrying out … [+2113 chars]"}, {"source": {"id": null, "name": "Kalingatv.com"}, "author": "IANS", "title": "Higher thrombus risk in men with obesity in adolescence: Study - Kalinga TV", "description": "London: Obese people, read this carefully. Researchers have found that men with a history of obesity in their late teens, in adult life, are more at risk of a blood clot (thrombus) in a leg or lung. The risk rises successively and is highest in those", "url": "https://kalingatv.com/miscellany/higher-thrombus-risk-in-men-with-obesity-in-adolescence-study/", "urlToImage": "https://cdn.kalingatv.com/wp-content/uploads/2020/05/obesity-Bel-Marra-Health.jpg", "publishedAt": "2020-05-04T08:56:00Z", "content": "London: Obese people, read this carefully. Researchers have found that men with a history of obesity in their late teens, in adult life, are more at risk of a blood clot (thrombus) in a leg or lung. The risk rises successively and is highest in those who were… [+2372 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Dr. Ashish Jha", "title": "Trump's coronavirus testing blueprint isn't enough. Let's fix this before we open America. - NBCNews.com", "description": "President Donald Trump's coronavirus testing blueprint isn't enough. Let's fix this before we open America.", "url": "https://www.nbcnews.com/think/opinion/trump-s-coronavirus-testing-blueprint-isn-t-enough-let-s-ncna1197326", "urlToImage": "https://media3.s-nbcnews.com/j/newscms/2020_18/3332466/200430-donald-trump-cdc-ac-955p_70403f110c1b12d33b01c123ff478137.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-05-04T08:33:00Z", "content": "On April 26, the White House presented a \"testing blueprint,\" an addendum to the Guidelines for Opening Up America Again announced two weeks ago. It came after weeks of pressure from public health experts and state leaders asking for a national testing strate… [+6466 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Artificial Intelligence to Soon Predict Glaucoma Progression Faster Than Standard Methods - News18", "description": "The new test called DARC can detect glaucoma progression 18 months earlier than the current gold standard method.", "url": "https://www.news18.com/news/tech/artificial-intelligence-to-soon-predict-glaucoma-progression-faster-than-standard-methods-2604497.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2019/04/Artificial-intelligence.jpg", "publishedAt": "2020-05-04T07:16:32Z", "content": "Using Artificial Intelligence (AI), researchers have developed a quick test to identify which people with glaucoma are at risk of rapid progression to blindness. A new test can detect glaucoma progression 18 months earlier than the current gold standard metho… [+2172 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "COVID-19 virus infects human intestinal cells, study finds - Daily Pioneer", "description": "The novel coronavirus can infect and replicate in cells that line the inside of the human intestines, according to a study that could explain why some patients with COVID-19 experience gastrointestinal symptoms.\n\nThe finding, published in the journal Science,…", "url": "https://www.dailypioneer.com/2020/pioneer-health/covid-19-virus-infects-human-intestinal-cells--study-finds.html", "urlToImage": "https://www.dailypioneer.com/uploads/2020/story/images/big/covid-19-virus-infects-human-intestinal-cells--study-finds-2020-05-04.jpg", "publishedAt": "2020-05-04T06:50:21Z", "content": "The novel coronavirus can infect and replicate in cells that line the inside of the human intestines, according to a study that could explain why some patients with COVID-19 experience gastrointestinal symptoms.\r\nThe finding, published in the journal Science,… [+1591 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Longjam Dineshwori", "title": "COVID-19 and dengue fever: Know the difference - TheHealthSite", "description": "While countries around that world are focussing on fighting the COVID-19 pandemic health experts have raised concern for possible spike of dengue cases.", "url": "https://www.thehealthsite.com/news/covid-19-and-dengue-fever-know-the-difference-743551/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2019/10/dengue-cases-in-delhi-has-been-dicreased-1-655x353.jpg", "publishedAt": "2020-05-04T06:48:12Z", "content": "Globally, the number of confirmed COVID-19 cases have jumped to 3,356, 205 including 238,730 deaths, according to the latest report from the World Health Organization (WHO). While the countries around that world are focussing on fighting the pandemic, many he… [+4572 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": null, "title": "The COVID-19 riddle: Why does the virus wallop some places and spare others? - Moneycontrol", "description": "Experts are trying to figure out why the coronavirus is so capricious. The answers could determine how to best protect ourselves and how long we have to.", "url": "https://www.nytimes.com/2020/05/03/world/asia/coronavirus-spread-where-why.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/04/coronavirus-china-wuhan-770x433.jpg", "publishedAt": "2020-05-04T06:39:00Z", "content": "The coronavirus has killed so many people in Iran that the country has resorted to mass burials, but in neighboring Iraq, the body count is fewer than 100.\r\nThe Dominican Republic has reported nearly 7,600 cases of the virus. Just across the border, Haiti has… [+8557 chars]"}, {"source": {"id": null, "name": "Thecitizen.in"}, "author": "akriti gupta", "title": "Cancer Has Not Stopped, But the Treatment Has - The Citizen", "description": "Deep Kumar, a senior citizen and a cancer patient based in Faridabad, had been going for his chemotherapy sessions on a regular basis before the lockd", "url": "https://www.thecitizen.in//index.php/en/newsdetail/index/15/18696/cancer-has-not-stopped-but-the-treatment-has", "urlToImage": "https://www.thecitizen.in/../NewsImages/articlepage/becdb835d4a7e209614bbbec9cf3915c.JPG", "publishedAt": "2020-05-04T05:25:52Z", "content": "Deep Kumar, a senior citizen and a cancer patient based in Faridabad, had been going for his chemotherapy sessions on a regular basis before the lockdown was announced. While Kumar was determined in his fight against cancer his plans took a tumultuous turn wh… [+6081 chars]"}, {"source": {"id": null, "name": "News-medical.net"}, "author": null, "title": "Blood sugar control is key for people with type 2 diabetes and COVID-19 - News-Medical.Net", "description": "A study reported in the journal Cell Metabolism on April 30 adds to the evidence that people with type 2 diabetes (T2D) are at greater risk of a poor outcome should they become infected with the virus that causes COVID-19.", "url": "https://www.news-medical.net/news/20200504/Blood-sugar-control-is-key-for-people-with-type-2-diabetes-and-COVID-19.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2fBlood_glucose-620x480.jpg", "publishedAt": "2020-05-04T04:30:12Z", "content": "A study reported in the journal Cell Metabolism on April 30 adds to the evidence that people with type 2 diabetes (T2D) are at greater risk of a poor outcome should they become infected with the virus that causes COVID-19.\r\nBut there is some encouraging news:… [+2835 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Lifestyle Desk", "title": "ABC for health: Why apple, beetroot and carrot juice is good for immunity - The Indian Express", "description": "Time to learn the importance of this ABC to boost immunity.", "url": "https://indianexpress.com/article/lifestyle/health/apple-beetroot-carrot-abc-juice-immunity-detox-drink-6384960/", "urlToImage": "https://images.indianexpress.com/2020/04/apple-beetroot-carrot-juice_759.jpg?w=759", "publishedAt": "2020-05-04T04:17:56Z", "content": "How about building immunity in a flavoursome way? (Source: File Photo)Given the growing focus on immunity and the need to stay fit, it is a good idea to fall back on vegetables and fruits owing to their many health benefits. And what better than beetroot and … [+3336 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "IANS", "title": "Coronavirus Outbreak in US May Last for 18 to 24 Months: Study - The Weather Channel", "description": "Government agencies and healthcare delivery organizations should develop strategies to ensure adequate protection for healthcare workers when disease incidence surges.", "url": "https://weather.com/en-IN/india/coronavirus/news/2020-05-04-novel-coronavirus-may-last-18-to-24-months-in-the-united-states", "urlToImage": "https://s.w-x.co/in-uscoronavirus.jpg", "publishedAt": "2020-05-04T03:38:26Z", "content": "New York City urban park rangers hand out free face masks at the Prospect Park in the Brooklyn. \r\n(Michael Nagle/Xinhua/IANS)\r\nAs the US battles the unabated rise of coronavirus cases as well as deaths, a new study from Minnesota-based Center for Infectious D… [+3415 chars]"}, {"source": {"id": null, "name": "Newsinfopark.com"}, "author": "NIP Web Desk Team", "title": "Coronavirus quarantine brings a surge of TV and movie reunions - News Info Park", "description": "With the entertainment industry on pause because of the coronavirus, casts from some beloved TV shows and movies are getting together (virtually) to take a look back at past work.From \"Parks and Recre", "url": "https://newsinfopark.com/health/2020-05-04/article/coronavirus-quarantine-brings-a-surge-of-tv-and-movie-reunions-27913/nip-web-desk-team/", "urlToImage": "https://media2.s-nbcnews.com/j/newscms/2020_18/3333141/200501-parks-and-rec-reunion-ew-1118a_6c2f89eda663ea4bc7b076e8b573d671.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-05-04T03:20:25Z", "content": "With the entertainment industry on pause because of the coronavirus, casts from some beloved TV shows and movies are getting together (virtually) to take a look back at past work.\r\nFrom “Parks and Recreation” and “Fresh Prince of Bel-Air” to “Chuck” and “The … [+3698 chars]"}, {"source": {"id": null, "name": "Aninews.in"}, "author": null, "title": "Researchers discover neural circuit that drives physical responses to emotional stress - ANI News", "description": "Washington DC [USA], May 4 (ANI): A neural circuit that drives physical responses to emotional stress has been discovered by researchers in a recent study.", "url": "https://www.aninews.in/news/health/researchers-discover-neural-circuit-that-drives-physical-responses-to-emotional-stress20200504081208", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/download_8EKsSZI_5Mbq3nN_YP4wDnR-thumbnail-320x180-70_utwJEYe_RAoZJL1-thumbnail-154x87-70.jpg", "publishedAt": "2020-05-04T02:42:59Z", "content": "ANI | Updated: May 04, 2020 08:12 IST\r\nWashington DC [USA], May 4 (ANI): A neural circuit that drives physical responses to emotional stress has been discovered by researchers in a recent study.This circuit could be a key target for treating stress-related di… [+2442 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "IANS", "title": "Personal Protective Equipment can Cause Serious Skin Injuries: Study - The Weather Channel", "description": "A new study has found medical staff treating COVID-19-infected patients experienced serious skin injury related to the use of personal protective equipment (PPE), including masks, goggles, face shields, and protective gowns.", "url": "https://weather.com/en-IN/india/coronavirus/news/2020-05-04-covid-19-personal-protective-equipment-cause-serious-skin", "urlToImage": "https://s.w-x.co/in-ppe.jpg", "publishedAt": "2020-05-04T02:38:56Z", "content": "Medical workers from north China's Inner Mongolia Autonomous Region work at the Wuhan pulmonary hospital in Wuhan, central China's Hubei Province. \r\n(Xinhua/Xiao Yijiu/IANS)\r\nA new study has found medical staff treating COVID-19-infected patients experienced … [+1830 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "COVID-19: Tripura doctor develops PPE face shield costing only ₹40 - Livemint", "description": "A face shield is a protective gear with a transparent visor attached to a headband", "url": "https://www.livemint.com/news/india/covid-19-tripura-doctor-develops-ppe-face-shield-costing-only-rs-40-11588558902819.html", "urlToImage": "https://images.livemint.com/img/2020/05/04/600x338/20200424232L_1587742410607_1588559065329.jpg", "publishedAt": "2020-05-04T02:25:03Z", "content": "A doctor from Tripura has developed a PPE face shield costing only 40, to protect frontline medical personnel from contracting COVID-19 while treating patients.A face shield is a protective gear with a transparent visor attached to a headband. It protects the… [+2828 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Mumbai Mirror", "title": "Ask The Sexpert: From masturbation to pregancy, Dr Mahinder Watsa answers sex-related queries - Mumbai Mirror", "description": "If you have any queries regarding masturbation, erectile dysfunction, premature ejaculation, unprotected sex, pregnancy, and other problems related to your sexual life, Dr Mahinder Watsa is here to c", "url": "https://mumbaimirror.indiatimes.com/mumbai/other/ask-the-sexpert-from-masturbation-to-pregancy-dr-mahinder-watsa-answers-sex-related-queries/articleshow/75514169.cms", "urlToImage": "https://static.toiimg.com/photo/imgsize-89732,msid-75514180/75514180.jpg", "publishedAt": "2020-05-04T01:49:00Z", "content": "If you have any queries regarding masturbation\r\n, erectile dysfunction\r\n, premature ejaculation\r\n, unprotected sex\r\n, pregnancy\r\n, and other problems related to your sexual life, Dr Mahinder Watsa\r\n is here to clear all your doubts.I am a 32-year-old man. Sin… [+3185 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Indians should cut down on processed food as poor diet major cause behind Coronavirus death: UK cardiologist - Firstpost", "description": "Dr Aseem Malhotra from the UK's NHS said obesity and excess weight needs to be addressed as a factor behind coronavirus deaths.", "url": "https://www.firstpost.com/health/indians-should-cut-down-on-processed-food-as-poor-diet-major-cause-behind-coronavirus-death-uk-cardiologist-8327931.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/05/1280px-Unhealthy_snacks_in_cart-1.jpg", "publishedAt": "2020-05-04T01:45:42Z", "content": null}, {"source": {"id": null, "name": "Freepressjournal.in"}, "author": "Dr Anjali Chhabria", "title": "Beat those Lockdown Blues: Pandemic problems by Dr Anjali Chhabria - Free Press Journal", "description": null, "url": "https://www.freepressjournal.in/health/beat-those-lockdown-blues-pandemic-problems-by-dr-anjali-chhabria", "urlToImage": "https://images.assettype.com/freepressjournal%2F2020-05%2F561ee399-57e5-463d-85bb-dcd156c3e837%2Fcats.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-05-04T00:39:05Z", "content": "Hi. I am 43 years old living in Mumbai. I get very scared now a days whenever I face even a small health issue. I directly think what if I have got the virus. Sometimes, it is only a headache or even acidity. But I cannot help but stress. I keep asking my wif… [+3064 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: UK hospital trials new treatment drug - BBC News", "description": "The new drug is based around a protein that is commonly used in the treatment of multiple sclerosis.", "url": "https://www.bbc.com/news/health-52504409", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/B4C7/production/_112097264_kayeflitney.jpg", "publishedAt": "2020-05-03T23:01:33Z", "content": "Image copyrightBBC PanoramaImage caption\r\n Kaye Flitney is one of 75 people enrolled in the clinical trial\r\nA new drug developed by UK scientists to treat Covid-19 patients is being trialled at University Hospital Southampton. \r\nDeveloped by UK bio-tech compa… [+4072 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Sanchita Sharma", "title": "Does coronavirus affect children differently? - Hindustan Times", "description": "So far, Covid-19 was believed to have largely spared young children, with most hospitalisations and deaths being reported in older adults and those with chronic conditions.", "url": "https://www.hindustantimes.com/cities/does-coronavirus-affect-children-differently/story-uDL9ru1GFQFsvWSznYOROM.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/04/Pictures/world-wider-image-children-lockdown-drawings-from_54311890-8d8f-11ea-85c6-561c42737975.JPG", "publishedAt": "2020-05-03T22:58:38Z", "content": "Clinicians are investigating the possible link of a potentially-lethal inflammatory syndrome characterised by high fever and swollen blood vessels and guts in young children that appears to be linked with coronavirus disease (Covid-19).\r\nSo far, Covid-19 was … [+4407 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Kaunain Sheriff M", "title": "AC in the time of COVID: the apprehensions, and what the guidelines say - The Indian Express", "description": "The government has issued general guidelines on the use of air-conditioners. These are limited to temperature and relative humidity in the context of the virus.", "url": "https://indianexpress.com/article/explained/ac-in-the-time-of-covid-the-apprehensions-and-what-the-guidelines-say-6392297/", "urlToImage": "https://images.indianexpress.com/2020/05/ac.jpg?w=759", "publishedAt": "2020-05-03T22:55:59Z", "content": "Relative humidity is believed to affect infectivity of the coronavirus. Moisture in the air plays a primary role in proving protection against respiratory infection. (Express Photo)With summer having arrived during an outbreak, a question being asked is wheth… [+4931 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Hannah Devlin", "title": "'Happy hypoxia': unusual coronavirus effect baffles doctors - The Guardian", "description": "Some patients who appear not in distress are found to have dangerously low oxygen levels", "url": "https://www.theguardian.com/world/2020/may/03/happy-hypoxia-unusual-coronavirus-effect-baffles-doctors", "urlToImage": "https://i.guim.co.uk/img/media/9b5151a81a9a8ca3a3c2a3908f0ff9b7f5ce6f5e/68_387_5025_3015/master/5025.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9d98eb759d3c4a382fb1ad19ffbe4a09", "publishedAt": "2020-05-03T20:07:49Z", "content": null}, {"source": {"id": null, "name": "As.com"}, "author": "AS English", "title": "US has developed a coronavirus test that gives results in 24 hours - AS English", "description": "Scientists working for the US military have designed a new coronavirus test that could potentially identify carries before they become infectious.", "url": "https://en.as.com/en/2020/05/03/other_sports/1588532825_197163.html", "urlToImage": "https://as01.epimg.net/en/imagenes/2020/05/03/other_sports/1588532825_197163_1588532904_noticia_normal.jpg", "publishedAt": "2020-05-03T19:10:13Z", "content": "As of the morning of Sunday 3 May the United States has over 1 million confirmed coronavirus cases, 152,000 have recovered and 64,283 have died during the pandemic. New York remains the epicenter of the outbreak in the U.S. and president Donald Trump is urgin… [+2293 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "1K genome sequencing of SARS-Cov 2 virus launched to decode Covid-19 - Daily Pioneer", "description": "The Department of Biotechnology (DBT) under the Union Science and Technology Ministry has announced the launch of 1,000 Genome sequencing of SARS-Cov 2 virus to understand viral and host genomics of COVID-19 outbreak. The deadly contagion has swept across the…", "url": "https://www.dailypioneer.com/2020/india/1k-genome-sequencing-of-sars-cov-2-virus-launched-to-decode-covid-19.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2020-05-03T18:31:48Z", "content": "The Department of Biotechnology (DBT) under the Union Science and Technology Ministry has announced the launch of 1,000 Genome sequencing of SARS-Cov 2 virus to understand viral and host genomics of COVID-19 outbreak. The deadly contagion has swept across the… [+1606 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Family mourn loss of father and daughter from coronavirus | ITV News - ITV News", "description": "David Whincup and his daughter Jo Rennison were always at the heart of family parties. Jo had lived with multiple sclerosis for over 20 years, but never let ...", "url": "https://www.youtube.com/watch?v=bryXYYVyNbs", "urlToImage": "https://i.ytimg.com/vi/bryXYYVyNbs/maxresdefault.jpg", "publishedAt": "2020-05-03T18:05:54Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Marla Milling", "title": "Can You Pray Coronavirus Away? A New Clinical Study Is Underway - Forbes", "description": "Could remote prayer help heal critically ill COVID-19 patients? A new clinical study focuses on finding an answer.", "url": "https://www.forbes.com/sites/marlamilling/2020/05/03/can-you-pray-coronavirus-away-a-new-clinical-study-is-underway/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1211656382%2F0x0.jpg", "publishedAt": "2020-05-03T16:15:53Z", "content": "As researchers race to find an effective treatment or vaccine for the COVID-19 coronavirus, a new study is underway to determine if the power of prayer helps heal ICU patients sickened with the virus. \r\nCardiologist Dr. Dhanunjaya DJ Lakkireddy, Medical Direc… [+1738 chars]"}, {"source": {"id": null, "name": "Greatandhra.com"}, "author": "IANS", "title": "Why a COVID-19 vaccine could never be around.. - Greatandhra.com", "description": "While over 100 vaccines are currently under pre-clinical trials and a couple of those have entered human trial stage, leading health experts have raised alarming questions about what if the world never sees a COVID-10 vaccine, as in the case of HIV and even d…", "url": "https://www.greatandhra.com/articles/special-articles/why-a-covid-19-vaccine-could-never-be-around-104435", "urlToImage": "https://www.greatandhra.com/newphotos7/corona vaccine1588518747.jpg", "publishedAt": "2020-05-03T15:12:27Z", "content": "London: While over 100 vaccines are currently under pre-clinical trials and a couple of those have entered human trial stage, leading health experts have raised alarming questions about what if the world never sees a COVID-10 vaccine, as in the case of HIV an… [+2730 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Tamil Nadu: Four new Covid-19 cases take total in Coimbatore to 146 - Times of India", "description": "Four people in the district tested positive for Covid-19 on Sunday, taking the total number of cases to 146. While one of them is a 31-year-old pregna", "url": "https://timesofindia.indiatimes.com/city/coimbatore/tamil-nadu-four-new-covid-19-cases-take-total-in-coimbatore-to-146/articleshow/75518834.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75518860,width-1070,height-580,imgsize-85636,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-05-03T14:09:48Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Neha", "title": "Scientists get a better understanding of melanoma - The Siasat Daily", "description": "Washington D.C.: After conducting research on melanoma, a group of scientists has more than doubled the known number of regions that influence risk of development of melanoma. The research, co-led by QIMR Berghofer, the University of Leeds in the UK, and the …", "url": "https://www.siasat.com/scientists-get-better-understanding-melanoma-1883616/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/05/melanoma.jpg", "publishedAt": "2020-05-03T13:42:24Z", "content": "Washington D.C.: After conducting research on melanoma, a group of scientists has more than doubled the known number of regions that influence risk of development of melanoma.\r\nThe research, co-led by QIMR Berghofer, the University of Leeds in the UK, and the… [+3622 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": null, "title": "Here's Why Cancer Patients Should Fear COVID-19 - http://www.newsgram.com/", "description": "People with cancer who develop coronavirus (COVID-19) are much more likely to die from the disease than those without cancer.", "url": "https://www.newsgram.com/why-cancer-patients-fear-covid-19/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2020/05/covid-19-4982910_1280-3.jpg", "publishedAt": "2020-05-03T08:09:00Z", "content": "By N.S.Venkataraman\r\nFrom historical times, human beings have been surviving,  inspite of  several types of diseases  confronting them.  In such conditions, medical science to safeguard  human beings from diseases have been developed due to the compelling nee… [+6753 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "iStock", "title": "Skin care routine to look your best this summer - Times of India", "description": "To protect our skin from any more breakouts and damages, here’s a guide to a skin care routine that’ll protect your skin throughout this summer.", "url": "https://timesofindia.indiatimes.com/life-style/beauty/skin-care-routine-to-look-your-best-this-summer/photostory/75490223.cms", "urlToImage": "https://static.toiimg.com/photo/75490248.cms", "publishedAt": "2020-05-03T07:30:00Z", "content": "For most of us, our skin is our prized possession and we make sure it’s protected and cared for in every possible way. With summer already at our doorsteps, some of us may have already invested in expensive creams and skin supplements, which is okay! But it i… [+484 chars]"}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "Lisa Du", "title": "‘False Dawn’ Recovery Haunts Virus Survivors Who Fall Sick Again - BloombergQuint", "description": "There hasn’t been enough research to conclude why symptoms of Covid-19 seem to re-emerge in some people", "url": "https://www.bloombergquint.com/coronavirus-outbreak/-false-dawn-recovery-haunts-virus-survivors-who-fall-sick-again", "urlToImage": "https://images.assettype.com/bloombergquint%2F2020-05%2F2c9baecd-ae21-461e-b6d0-b4c0fc847326%2F361732958.jpg?rect=0%2C263%2C3998%2C2099&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-05-03T07:27:18Z", "content": ""}, {"source": {"id": null, "name": "Socialnews.xyz"}, "author": null, "title": "Coronavirus – Africa: Despite Covid-19 pandemic, routine vaccination of children continues across the Middle East and North Africa - SocialNews.XYZ", "description": "Download logoDespite the COVID-19 outbreak, most countries in the Middle East and North Africa continue with routine immunization for children while applying strict precautionary health measures. However, in some countries, special vaccination campaigns have …", "url": "https://www.socialnews.xyz/2020/05/03/coronavirus-africa-despite-covid-19-pandemic-routine-vaccination-of-children-continues-across-the-middle-east-and-north-africa/", "urlToImage": "https://www.africa-newsroom.com/files/large/a80b0a0ee7ee53c", "publishedAt": "2020-05-03T07:20:30Z", "content": "Home » General » Coronavirus – Africa: Despite Covid-19 pandemic, routine vaccination of children continues across the Middle East and North AfricaDownload logoDespite the COVID-19 outbreak, most countries in the Middle East and North Africa continue with rou… [+2870 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Anushree Gupta", "title": "Obese people, men at high death risk due to coronavirus - Why being overweight is a risk factor for COVID-19 - Times Now", "description": "The study was conducted on 16,749 people from 166 hospitals. It was found that the virus is more lethal for male/obese patients.", "url": "https://www.timesnownews.com/health/article/obese-people-men-at-high-death-risk-due-to-coronavirus-why-being-overweight-is-a-risk-factor-for-covid/586316", "urlToImage": "https://imgk.timesnownews.com/story/coronavirus_symptoms_2_5.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-03T06:14:24Z", "content": "<ul><li>The coronavirus outbreak has affected millions of people around the world</li><li>A study in the UK has found that obese people, and men are at a higher risk of death due to coronavirus infection</li><li>The study mentioned that these findings were no… [+2458 chars]"}, {"source": {"id": null, "name": "Asianage.com"}, "author": "AFP", "title": "Blood pressure medicines don't raise COVID-19 risk: Research - The Asian Age", "description": "There had been concern arising from animal studies that these drugs might increase body&#039;s protein levels which the coronavirus latches on to", "url": "https://www.asianage.com/life/health/030520/blood-pressure-medicines-dont-raise-covid-19-risk-research.html", "urlToImage": "https://s3.ap-southeast-1.amazonaws.com/images.asianage.com/images/aa-Cover-p7gblobppvmu7vlufl9hmuc851-20200503111833.jpeg", "publishedAt": "2020-05-03T05:54:00Z", "content": "There had been concern arising from animal studies that these drugs might increase body's protein levels which the coronavirus latches on toBlood pressure medicines do not increase the risk of COVID-19 infection nor do they increase the risk of becoming serio… [+2745 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Coronavirus infections drop in Italy as lockdown draws to a close - Daijiworld.com", "description": "", "url": "http://www.daijiworld.com/news/newsDisplay.aspx?newsID=703830", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2020-05-03T04:10:29Z", "content": "Rome, May 3 (IANS): As a national lockdown to fight the coronavirus pandemic is drawing to a close, Italy on Saturday posted a decrease in new infections, according to the latest numbers released by the Civil Protection Department.\r\nThe number of new infectio… [+1734 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "Press Trust of India", "title": "ICMR lauds Kerala's containment strategy for COVID-19 - Express Healthcare", "description": "Dr Raman R Gangakhedkar, Chief of Epidemiology and Communicable Diseases, ICMR, the country was now in a position to ramp up tests up to 1.25 lakh a day in the government sectorThe Indian Council for Medical Research (ICMR) lauded the containment str", "url": "https://www.expresshealthcare.in/news/icmr-lauds-keralas-containment-strategy-for-covid-19/419715/", "urlToImage": "https://cdn.expresshealthcare.in/wp-content/uploads/2020/03/23230447/GettyImages-1209968955-e1584985138250.jpg", "publishedAt": "2020-05-03T03:26:00Z", "content": "Dr Raman R Gangakhedkar, Chief of Epidemiology and Communicable Diseases, ICMR, the country was now in a position to ramp up tests up to 1.25 lakh a day in the government sector\r\nThe Indian Council for Medical Research (ICMR) lauded the containment strategy a… [+2503 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: 'Covid toe' and other rashes puzzle doctors - BBC News", "description": "A Spanish study identifies five rashes present in some coronavirus hospital patients.", "url": "https://www.bbc.com/news/health-52493574", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/0389/production/_112050900_img_2199.jpg", "publishedAt": "2020-05-02T23:56:20Z", "content": "Image copyrightCOVID-piel studyImage caption\r\n \"Covid toe\" is a rash that can look like chilblains\r\nFive rashes, including Covid toe, are affecting some hospital patients diagnosed with Covid-19, a small study by Spanish doctors has found. \r\nThe rashes tended… [+3377 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Patient Treated With Convalescent Plasma Released From Hospital - CBS Denver", "description": "\"I'm still here... I did it!\" proclaimed a 71-year-old woman who was discharged from Centura-Littleton Adventist Hospital on Friday.", "url": "https://www.youtube.com/watch?v=i2hgJTAr0VQ", "urlToImage": "https://i.ytimg.com/vi/i2hgJTAr0VQ/maxresdefault.jpg", "publishedAt": "2020-05-02T23:30:41Z", "content": null}, {"source": {"id": null, "name": "Newkerala.com"}, "author": "https://www.newkerala.com/news/", "title": "Study reveals elderly people with persistent insomnia more likely to remain depressed - New Kerala", "description": "Older people with depression, who also experience persistent and worsening sleep disturbances, are at much higher risk of remaining depressed, suggests a recent study....", "url": "https://www.newkerala.com/news/2020/77684.htm", "urlToImage": "https://www.newkerala.com/news/news-room.jpg", "publishedAt": "2020-05-02T23:23:13Z", "content": "The study analysed data from almost 600 people over 60 years old who visited primary care centres in the Northeast US. All patients met clinical criteria for major or minor depression at the outset of the study. The researchers at Johns Hopkins Bloomberg Scho… [+2747 chars]"}, {"source": {"id": null, "name": "Greaterkashmir.com"}, "author": null, "title": "COVID-19 vaccine may take at least 9 months: Bill Gates - Greater Kashmir", "description": "COVID-19 vaccine may take at least 9 months: Bill Gates Greater Kashmir | While it appears that only a COVID-19 vaccine may take us back to normal, its development may take at least nine months to two years, billionaire", "url": "https://www.greaterkashmir.com/news/front-page-2/covid-19-vaccine-may-take-at-least-9-months-bill-gates/", "urlToImage": "https://i1.wp.com/www.greaterkashmir.com/wp-content/uploads/2020/03/Bill-Gates_2018.jpg?fit=701%2C879&ssl=1", "publishedAt": "2020-05-02T23:16:00Z", "content": "While it appears that only a COVID-19 vaccine may take us back to normal, its development may take at least nine months to two years, billionaire philanthropist Bill Gates has said.\r\nEven though several drugs are also being tested to treat\r\nCOVID-19, Gates be… [+2073 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "todaynewspaper.in", "title": "Coronavirus | When will a COVID-19 vaccine be ready? - Todaynewspaper", "description": "The story so far: On April 23, Oxford University initiated a phase-1 human clinical trial of its vaccine — ChAdOx1 nCoV-19 — against the novel coronavirus, SARS-CoV-2. A single dose of the candidate vaccine will be administered to 1,112 healthy volunteers to …", "url": "https://www.thehindu.com/sci-tech/health/coronavirus-when-will-a-covid-19-vaccine-be-ready/article31490925.ece", "urlToImage": "https://www.thehindu.com/sci-tech/health/j86jgj/article31490924.ece/ALTERNATES/LANDSCAPE_615/03THHEALTH", "publishedAt": "2020-05-02T21:13:01Z", "content": "The story so far: On April 23, Oxford University initiated a phase-1 human clinical trial of its vaccine ChAdOx1 nCoV-19 against the novel coronavirus, SARS-CoV-2. A single dose of the candidate vaccine will be administered to 1,112 healthy volunteers to stud… [+6133 chars]"}, {"source": {"id": null, "name": "Newsherder.com"}, "author": null, "title": "Can Immunity Save Us From Corona Virus? - News Herder", "description": "Doctors and nurses are observed in a provisional intensive care unit in Bahrain during the final inspection of the equipment Photo credit: Reuters One of the many uncertainties with Covid-19 is how the human immune system responds to infections and what this …", "url": "https://newsherder.com/opinion/2020/05/02/can-immunity-save-us-from-corona-virus/", "urlToImage": "https://newsherder.com/wp-content/uploads/2020/05/Bahrain_17178d94af2_medium.jpg", "publishedAt": "2020-05-02T20:13:48Z", "content": "Doctors and nurses are observed in a provisional intensive care unit in Bahrain during the final inspection of the equipmentPhoto credit: Reuters\r\nOne of the many uncertainties with Covid-19 is how the human immune system responds to infections and what this … [+5590 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Anonna Dutt", "title": "BCG vaccine may help Covid-19 health workers: Study - Hindustan Times", "description": "Immunity conferred through BCG vaccine may be effective in preventing a cytokine storm, the article suggests. A cytokine storm is when the immune system goes into an overdrive and starts attacking the body’s own cells and tissues other than fighting off an in…", "url": "https://www.hindustantimes.com/india-news/bcg-vaccine-may-help-health-workers-study/story-ADx5vFIBjmq3DHZMylGaDO.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/03/Pictures/research-coronavirus-laboratory-scientist-arcturus-therapeutics-medicines_b665f3d8-8cad-11ea-8bae-d48e751bd032.jpg", "publishedAt": "2020-05-02T18:35:34Z", "content": "The Bacillus Calmette-Guérin (BCG) vaccine to prevent tuberculosis must be administered to health care workers and the elderly as prophylaxis (preventive action) for the coronavirus disease (Covid-19), according to a paper published in the Indian Journal of O… [+3185 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Associated Press Television News", "title": "Polio vaccine triumph could speed coronavirus pandemic end - Republic World - Republic World", "description": "Peter Salk still remembers the trepidation he felt when his father came home from work one day in May 1953 and promptly began boiling a set of needles and syringes on the kitchen stove.", "url": "https://www.republicworld.com/world-news/us-news/polio-vaccine-triumph-could-speed-coronavirus-pandemic-end.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/uvh8pservcrpysys_1588439476.jpeg?tr=f-jpeg", "publishedAt": "2020-05-02T17:12:00Z", "content": "Peter Salk still remembers the trepidation he felt when his father came home from work one day in May 1953 and promptly began boiling a set of needles and syringes on the kitchen stove.\r\nWith several years of research and promising results in monkeys fueling … [+10495 chars]"}, {"source": {"id": null, "name": "Clickorlando.com"}, "author": "Emilee Speck", "title": "CDC expands list of coronavirus symptoms. Here’s what to look for - WKMG News 6 & ClickOrlando", "description": "Cough, fever and shortness of breath are the most widely reported symptoms of the novel <a href=\"https://www.clickorlando.com/topic/coronavirus/\" target=_blank>coronavirus</a>, according to global and U.S. data, however, the U.S. Center for Disease Control an…", "url": "https://www.clickorlando.com/news/local/2020/04/27/cdc-expands-list-of-coronavirus-symptoms-heres-what-to-look-for/", "urlToImage": "https://www.clickorlando.com/resizer/8aZpoiQkEiw-a9wE0MM8TD6aUGM=/1600x900/smart/filters:format(jpeg):strip_exif(true):strip_icc(true):no_upscale(true):quality(65)/d1vhqlrjc8h82r.cloudfront.net/04-27-2020/t_9ef53c4eebed4a0fa2ab0cd409b80a34_name_Virus_Outbreak_Spain_scaled.jpg", "publishedAt": "2020-05-01T09:02:36Z", "content": "Cough, fever and shortness of breath are the most widely reported symptoms of the novel coronavirus, according to global and U.S. data, however, the U.S. Center for Disease Control and Prevention has expanded its list of known COVID-19 symptoms.\r\nPreviously, … [+2403 chars]"}]}