{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Sgt. Philip Kahn, Whose Life Spans 2 Global Pandemics, Dies At 100 | Sunday TODAY - TODAY", "description": "Sgt. Philip Kahn was born in 1919 during the flu pandemic that killed 50 million people worldwide, including his twin brother weeks after birth. Kahn died la...", "url": "https://www.youtube.com/watch?v=J8LMN2OEjfA", "urlToImage": null, "publishedAt": "2020-04-26T14:33:02Z", "content": "Sgt. Philip Kahn was born in 1919 during the flu pandemic that killed 50 million people worldwide, including his twin brother weeks after birth. Kahn died last week at 100 years old due to the coronavirus. He served during World War II in the United States Ar… [+1102 chars]"}, {"source": {"id": null, "name": "Scmp.com"}, "author": null, "title": "Hong Kong Sports Institute sprays disinfectant to protect against Covid-19 - Better Life", "description": "The Fo Tan sports academy houses up to 200 athletes and coaches who are unable to leave because of Hong Kong government restrictions", "url": "https://www.scmp.com/sport/hong-kong/article/3081610/coronavirus-sports-institute-sprays-hong-kong-invented-disinfectant", "urlToImage": null, "publishedAt": "2020-04-26T14:14:13Z", "content": "Published: 6:12pm, 26 Apr, 2020\r\nUpdated: 10:15pm, 26 Apr, 2020"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "England's hospital COVID-19 death toll rises to 18,420 - Reuters India", "description": "The number of people who have died in hospitals in England after testing positive for the new coronavirus has risen to 18,420, up by 336 in 24 hours, the National Health Service said on Sunday.", "url": "https://in.reuters.com/article/health-coronavirus-england-idINKCN2280HS", "urlToImage": null, "publishedAt": "2020-04-26T14:12:44Z", "content": "LONDON (Reuters) - The number of people who have died in hospitals in England after testing positive for the new coronavirus has risen to 18,420, up by 336 in 24 hours, the National Health Service said on Sunday. \r\nThe patients who died were aged between 28 a… [+246 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Luke Andrews For Mailonline", "title": "Tracker app shows coronavirus was spreading in UK weeks before first case was spotted - Daily Mail", "description": "The COVID symptom tracker, designed by scientists at King's College London, has identified 'hundreds' of possible cases in January and some in December.", "url": "https://www.dailymail.co.uk/news/article-8258291/Tracker-app-shows-coronavirus-spreading-UK-weeks-case-spotted.html", "urlToImage": null, "publishedAt": "2020-04-26T12:42:24Z", "content": "A coronavirus tracking app has suggested coronavairus was spreading through the UK in January, weeks before it was first spotted.\r\nCOVID Symptom tracker, designed by scientists at King's College London, is asking its 2.6million users to report their symptoms … [+5952 chars]"}, {"source": {"id": null, "name": "Un.org"}, "author": null, "title": "Millions more children at risk with immunization services disrupted amid COVID-19 pandemic - UN News", "description": "Last year, over 13 million children received no vaccines at all, and the UN Children’s Fund (UNICEF) is calling on governments to step up, warning disrupting immunization services amid the COVID-19 pandemic could leave even more of the world’s most marginaliz…", "url": "https://news.un.org/en/story/2020/04/1062622", "urlToImage": null, "publishedAt": "2020-04-26T11:40:07Z", "content": "Making its call at the start of the 2020 edition of World Immunization Week, UNICEF said on Saturday that millions of children are in danger of missing life-saving vaccines against measles, diphtheria and polio due to disruptions in immunization service as th… [+3030 chars]"}, {"source": {"id": null, "name": "Weforum.org"}, "author": "Stephanie Nebehay", "title": "WHO warns COVID-19 patients could be infected again - World Economic Forum", "description": "The World Health Organization advises countries against issuing “immunity passports” or “risk-free certificates” to people who have been infected.", "url": "https://www.weforum.org/agenda/2020/04/no-evidence-that-recovered-covid-19-patients-cannot-be-reinfected-who/", "urlToImage": null, "publishedAt": "2020-04-26T11:38:09Z", "content": "<ul><li>People who have recovered from COVID-19 still need to take precautions to prevent re-infection</li><li>Some countries have handed out health passports to people who have recovered from the illness</li><li>There are now 2.9 million cases of coronavirus… [+1994 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Sukanya Charuchandra", "title": "Convalescent Plasma's Success Against COVID-19 Continues in New Study - The Wire", "description": "Convalescent plasma is one of three immune-based options that may be able to tackle COVID-19.", "url": "https://science.thewire.in/the-sciences/convalescent-plasmas-success-against-covid-19-continues-in-new-study/", "urlToImage": null, "publishedAt": "2020-04-26T09:29:00Z", "content": "An artist’s impression of red blood cells flowing through a vein. Image: Narupon Promvichai/pixabay.\r\nResearchers in China have been experimenting with using blood plasma from patients who have recovered from COVID-19 as a possible way to treat severely ill C… [+5508 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "PTI", "title": "Cardiac abnormalities in COVID-19 patients treated with hydroxychloroquine: Study - India TV News", "description": "Patients with COVID-19 who were on a regimen of the drugs hydroxychloroquine and azithromycin experienced cardiac abnormalities, according to a study which recommends the continuous monitoring of heart beat rhythms in infected people with underlying health co…", "url": "https://www.indiatvnews.com/science/cardiac-abnormalities-covid-19-patients-treated-with-hydroxychloroquine-study-611462", "urlToImage": null, "publishedAt": "2020-04-26T09:20:29Z", "content": "Cardiac abnormalities in COVID-19 patients treated with hydroxychloroquine: Study\r\nPatients with COVID-19 who were on a regimen of the drugs hydroxychloroquine and azithromycin experienced cardiac abnormalities, according to a study which recommends the conti… [+2424 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "Pune's Serum Institute to start making coronavirus vaccine that is under trial - Livemint", "description": "Serum Institute of India will be manufacturing Oxford University's coronavirus vaccine in anticipation of clinical trials succeeding by September-October in the UK.The company expressed optimism of starting trials in India for this vaccine over the next 2-3 w…", "url": "https://www.livemint.com/news/india/pune-s-serum-institute-to-start-making-coronavirus-vaccine-that-is-under-trial-11587889621799.html", "urlToImage": null, "publishedAt": "2020-04-26T08:47:51Z", "content": "Vaccine major Serum Institute of India today said it plans to start production of the COVID-19 vaccine developed by Oxford University in the next two to three weeks and hopes to bring it to the market by October if the human clinical trials are successful.The… [+3104 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Indore strain may be deadlier, will send samples to NIV: Docs - India Today", "description": "The novel coronavirus is posing a big challenge due to multiple strains.", "url": "https://www.indiatoday.in/india/story/indore-strain-may-be-deadlier-will-send-samples-to-niv-docs-1671256-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T08:39:35Z", "content": "Doctors treating COVID-19 cases in Indore say a more virulent strain may be wreaking havoc in the city, which has emerged as the coronavirus hotspot in Madhya Pradesh. They say samples from Indore, where COVID-19 has killed 57 people, will be sent to the Pune… [+1315 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Women face anxiety over pregnancy and birth in US - TRT World", "description": "For many women, being pregnant comes with its own set of fears and anxiety. But being pregnant during the Covid-19 pandemic takes those fears to a whole new ...", "url": "https://www.youtube.com/watch?v=gagwijdvCR0", "urlToImage": null, "publishedAt": "2020-04-26T08:10:16Z", "content": null}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Morning update as military begins mobile testing - BBC News", "description": "Five things you need to know about the coronavirus outbreak this morning.", "url": "https://www.bbc.com/news/uk-52429303", "urlToImage": null, "publishedAt": "2020-04-26T06:54:27Z", "content": "Here are five things you need to know about the coronavirus outbreak this Sunday. We'll have another update for you on Monday.\r\n1. Military pop-up testing\r\nThe military is to begin carrying out coronavirus tests in pop-up facilities. The mobile units will tra… [+2792 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "New York starts antibody testing medical front-line workers - Al Jazeera English", "description": "The US state of New York has begun antibody tests for front-line healthcare workers. The screening programme will examine whether doctors and nurses working ...", "url": "https://www.youtube.com/watch?v=eVueTtGNPhU", "urlToImage": null, "publishedAt": "2020-04-26T05:24:44Z", "content": null}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express News Service", "title": "Gujarat’s high death rate could be due to presence of Wuhan strain - The Indian Express", "description": "In Kerala the mortality rate was low because most of the patients came from Dubai which has the milder S strain, said Dr Atul Patel at a media interaction presided over by chief minister Vijay Rupani and deputy chief minister Nitin Patel on Saturday", "url": "https://indianexpress.com/article/india/states-high-death-rate-could-be-due-to-presence-of-wuhan-strain-coronavirus-6379410/", "urlToImage": null, "publishedAt": "2020-04-26T03:42:37Z", "content": "According to Dr RR Gangakhedkar, the head of epidemiology and infectious diseases at ICMR, there are minor variations in the strains. (Representational Photo)Gujarats high fatality rate could be due to the significant presence of L strain of coronavirus over … [+4146 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "Second wave of COVID-19 may hit India during monsoon months - Northeast Now", "description": "Though coronavirus cases in India may go down substantially in the coming days, it may again resurface during the monsoon months. According to an India Times report, the second wave is expected to hit the country in the months of July and August. However, acc…", "url": "https://nenow.in/top-news/second-wave-of-covid-19-may-hit-india-during-monsoon-months.html/", "urlToImage": null, "publishedAt": "2020-04-26T03:20:07Z", "content": "Though coronavirus cases in India may go down substantially in the coming days, it may again resurface during the monsoon months.\r\nAccording to an India Times report, the second wave is expected to hit the country in the months of July and August.\r\nHowever, a… [+840 chars]"}, {"source": {"id": null, "name": "Ianslive.in"}, "author": "IANSLive", "title": "Welcome To IANS Live - NATION - US COVID-19 cases top 900,000, deaths touch 52,000 - IANS", "description": "The number of COVID-19 cases in the country reached 905,364 as of 10.30 a.m. (1430 GMT), and a total of 52,042 deaths related to the disease were recorded, according to the Center for Systems Science and Engineering (CSSE) at Johns Hopkins University, Xinhua …", "url": "http://www.ianslive.in/index.php?param=news/US_COVID_19_cases_top_900000_deaths_touch_52000-671687/NATION/1", "urlToImage": null, "publishedAt": "2020-04-26T02:50:20Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Hindustan Times", "title": "India records biggest single day spike, virus can survive on particulate matter: Covid-19 news today - Hindustan Times", "description": "Here is a preview of the important Covid-19 stories from India and world today.", "url": "https://www.hindustantimes.com/india-news/india-records-biggest-single-day-spike-virus-can-survive-on-particulate-matter-covid-19-news-today/story-WANk0UoFH42j3DcDdXLDSM.html", "urlToImage": null, "publishedAt": "2020-04-26T02:48:01Z", "content": "India’s tally of confirmed coronavirus disease (Covid-19) cases shot past the 26,000-mark on Saturday with the biggest single-day spike in infections. Tests in Italy found the Sars-CoV-2 virus, which causes Covid-19, can cling to air pollution particles.\r\nInd… [+4828 chars]"}, {"source": {"id": null, "name": "Newsonair.com"}, "author": null, "title": "WHO says there is no evidence that recovered patients are immune to COVID-19 infection - All India Radio", "description": "World Health Organization (WHO) has said that there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection.", "url": "http://newsonair.com/Main-News-Details.aspx?id=386715", "urlToImage": null, "publishedAt": "2020-04-26T02:42:41Z", "content": "Site Maintained by: Website Cell, NSD and IT Division, Prasar Bharati, New Delhi, India. Website Policy"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Temple University Hospital Asking For Personal Protective Equipment Donations - CBS Philly", "description": "The hospital says gowns -- both surgical and isolation -- and N95 masks are needed most.", "url": "https://www.youtube.com/watch?v=7dPAa6IEimU", "urlToImage": null, "publishedAt": "2020-04-26T02:37:41Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Bruce Y. Lee", "title": "CDC: Here Are 6 New Possible Symptoms Of COVID-19 Coronavirus - Forbes", "description": "It was only a matter of time before the Centers of Disease Control and Prevention (CDC) added to this list.", "url": "https://www.forbes.com/sites/brucelee/2020/04/25/cdc-here-are-6-new-possible-symptoms-of-covid-19-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-26T01:57:16Z", "content": "The Centers for Disease Control and Prevention (CDC) has added six new symptoms to its list of ... [+] possible COVID-19 symptoms. (Photo by TAMI CHAPPELL/AFP via Getty Images)\r\nAFP via Getty Images\r\nIt was only a matter of time before the Centers of Disease … [+5324 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Spain reports nearly 3,000 daily virus cases - Times of India", "description": "Europe News: MADRID: Spain's health authorities say 2,944 new Covid-19 infections were confirmed in the previous 24 hours, taking the total to nearly 206,000 cases.", "url": "https://timesofindia.indiatimes.com/world/europe/spain-reports-nearly-3000-daily-virus-cases/articleshow/75380478.cms", "urlToImage": null, "publishedAt": "2020-04-25T23:47:56Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Second member of Moradabad family succumbs to Covid-19; three brothers die in 20 days - Times of India", "description": "Bareilly: A family in Moradabad’s Nawabpura, which has been quarantined ever since one of its members, a 49-year-old man, tested positive for Covid-19.", "url": "https://timesofindia.indiatimes.com/city/bareilly/second-member-of-moradabad-family-succumbs-to-covid-19-three-brothers-die-in-20-days/articleshow/75383064.cms", "urlToImage": null, "publishedAt": "2020-04-25T23:18:00Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "UK doctor invents digital flashcards to help Covid-19 patients understand staff - The Guardian", "description": "Cardmedic overcomes communication barrier caused by healthcare staff wearing PPE", "url": "https://www.theguardian.com/world/2020/apr/25/uk-doctor-invents-digital-flashcards-to-help-covid-19-patients-understand-staff", "urlToImage": null, "publishedAt": "2020-04-25T21:50:36Z", "content": "A coronavirus patients terrifying hospital experience inspired an NHS doctor to create a flashcard system to improve communication with medical staff wearing face masks.\r\nAnaesthetist Rachael Grimaldi founded Cardmedic while on maternity leave after reading a… [+2712 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "'No evidence' people with coronavirus are immunised: WHO - SBS News", "description": "While the global death toll of coronavirus passes 200,000, the World Health Organization warns there is no evidence of immunity to the disease.", "url": "https://www.sbs.com.au/news/no-evidence-people-with-coronavirus-are-immunised-says-who", "urlToImage": null, "publishedAt": "2020-04-25T21:37:23Z", "content": "The World Health Organization has warned that recovering from coronavirus might not protect people from reinfection as the death toll from the pandemic passed 200,000 around the globe.\r\nGovernments are struggling to limit the economic devastation unleashed by… [+7190 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Could a Second Wave of Coronavirus Infections Appear? - QuickTake by Bloomberg", "description": "The concern about a second wave of #coronavirus is that, once quelled, the pandemic will resurface with renewed strength Subscribe to our YouTube channel: ht...", "url": "https://www.youtube.com/watch?v=fNZ83AEd7Wk", "urlToImage": null, "publishedAt": "2020-04-25T20:34:42Z", "content": "The concern about a second wave of #coronavirus is that, once quelled, the pandemic will resurface with renewed strength\r\nSubscribe to our YouTube channel: https://bit.ly/2TwO8Gm\r\nQUICKTAKE ON SOCIAL:Follow QuickTake on Twitter: twitter.com/quicktakeLike Quic… [+337 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nTom Morgan", "title": "Coronavirus test for anyone traced to a known carrier - Telegraph.co.uk", "description": "The technology should eventually allow symptomless workers to return to their jobs quicker", "url": "https://www.telegraph.co.uk/news/2020/04/25/coronavirus-test-anyone-traced-known-carrier/", "urlToImage": null, "publishedAt": "2020-04-25T20:30:00Z", "content": "In the letter to public health agencies and local authorities, he says the app will work in unison with a call-based system for those without the technology.\r\nHe also refers to the Government's huge recruitment drive to carry out the extra testing. \"There wil… [+2492 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Mehr Gill", "title": "Explained: Types of human coronaviruses and the symptoms they cause - The Indian Express", "description": "While there are hundreds of coronaviruses, there are seven that we know can infect humans.", "url": "https://indianexpress.com/article/explained/types-of-human-coronaviruses-and-symptoms-6368444/", "urlToImage": null, "publishedAt": "2020-04-25T19:50:19Z", "content": "Written by Mehr Gill\r\n | New Delhi | \r\nUpdated: April 25, 2020 6:09:09 pm\r\nHuman coronaviruses were first characterised in the mid-1960s and they are mostly considered to be responsible for causing upper respiratory tract infections in children. (AP illustrat… [+6888 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ariana Eunjung Cha", "title": "Spike in stroke deaths in patients with only minor coronavirus symptoms - The Independent", "description": "Reports of strokes in the young and middle-aged are the latest twist in our evolving understanding of the mysteries of the virus, finds Ariana Eunjung Cha", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-stroke-deaths-symptoms-covid-19-heart-a9484091.html", "urlToImage": null, "publishedAt": "2020-04-25T18:45:03Z", "content": "Thomas Oxley wasnt even on call the day he received the page to come into Mount Sinai Beth Israel Hospital in Manhattan. There werent enough doctors to treat all the emergency stroke patients, and he was needed in the operating room.\r\nThe patients chart appea… [+9849 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Prof. K. Ganapathy", "title": "COVID-19 and the nervous system - The Hindu", "description": "In the last few weeks several articles have appeared from various specialists pointing out how the novel coronavirus disease (COVID-19) can affect their respective specialties. SARS-CoV-2, the scienti", "url": "https://www.thehindu.com/news/national/tamil-nadu/covid-19-and-the-nervous-system/article31434974.ece", "urlToImage": null, "publishedAt": "2020-04-25T18:36:51Z", "content": "In the last few weeks several articles have appeared from various specialists pointing out how the novel coronavirus disease (COVID-19) can affect their respective specialties. SARS-CoV-2, the scientific name given to the virus, appears to be truly omnipresen… [+3491 chars]"}, {"source": {"id": "xinhua-net", "name": "Xinhua Net"}, "author": null, "title": "The Latest: Italy records fewest new deaths in nearly six weeks - Xinhua | English.news.cn - Xinhua", "description": null, "url": "http://www.xinhuanet.com/english/2020-04/26/c_139008002.htm", "urlToImage": null, "publishedAt": "2020-04-25T18:27:29Z", "content": "A staff member wearing face mask and face shield works in a supermarket in Rome, Italy, April 22, 2020. (Photo by Elisa Lingria/Xinhua)\r\nItaly's total number of confirmed cases -- combining active infections, fatalities and recoveries -- rose to 195,351 on Ap… [+1719 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Ariana Eunjung Cha", "title": "Young and middle-aged people, barely sick with covid-19, are dying of strokes - The Washington Post", "description": "Doctors sound alarm about patients in their 30s and 40s left debilitated or dead by strokes. Some didn’t even know they were infected by coronavirus.", "url": "https://www.washingtonpost.com/health/2020/04/24/strokes-coronavirus-young-patients/", "urlToImage": null, "publishedAt": "2020-04-25T18:18:21Z", "content": "Oxley gasped when he got to the patients age and covid-19 status: 44, positive.\r\nThe man was among several recent stroke patients in their 30s to 40s who were all infected with the coronavirus. The median age for that type of severe stroke is 74.\r\nAs Oxley, a… [+9467 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Sunetra Choudhury", "title": "CEA points at Spanish Flu lesson in Covid fight - Hindustan Times", "description": "The  Spanish flu emerged in 1918 and claimed 39 million lives till 1920.", "url": "https://www.hindustantimes.com/india-news/cea-points-at-spanish-flu-lesson-in-covid-fight/story-bMWrrU9fXxrCfKLjyVM96M.html", "urlToImage": null, "publishedAt": "2020-04-25T18:15:05Z", "content": "A paper recently published by the US-based National Bureau of Economic Research (NBER) is bringing considerable comfort to policy makers here. Chief Economic Advisor KV Subramanian was the first to draw attention to the research and others like it on the Span… [+2689 chars]"}, {"source": {"id": null, "name": "Inverse.com"}, "author": "Abela Mahimbo, David Isaacs, Melissa Kang, Melanie Wong", "title": "Why are some people with Covid-19 asymptomatic? Evidence points to 2 factors - Inverse", "description": "Recent studies suggest as many as 80% or more of those infected are “silent carriers”, showing no or very mild symptoms.", "url": "https://www.inverse.com/science/covid-19-asymptomatic", "urlToImage": null, "publishedAt": "2020-04-25T17:58:15Z", "content": "SARS-CoV-2, the coronavirus which causes COVID-19, has infected almost 2.5 million people around the world and claimed 170,000 lives.\r\nBut some people dont even get symptoms. Recent studies suggest as many as 80 percentor more of those infected are silent car… [+5687 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "mw vaccine trial sucessfull in pgi chandigarh..cadila is manufacture of mw vaccine .monday big up mo.. - Moneycontrol.com", "description": "", "url": "https://mmb.moneycontrol.com/forum-topics/stocks/cadila-health/thread-message-81561927-83361927.html", "urlToImage": null, "publishedAt": "2020-04-25T17:55:47Z", "content": "Reposted about 1 hr 28 mins ago by Sandy Desouza\r\nPrice when posted : NSE: Rs. 336.95\r\nCorona virus: PGI Chandigarh`s success in vaccine safety trial Chandigarh Positive response has been found in the safety trial launched as an alternative medicine for coron… [+763 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "2 cell types are entry points for virus - Hindustan Times", "description": "The respiratory tract is filled with numerous cells, among which are goblet cells and ciliated cells.", "url": "https://www.hindustantimes.com/india-news/2-cell-types-are-entry-points-for-virus/story-VZ250MIqdc4r0OIzxsTqPJ.html", "urlToImage": null, "publishedAt": "2020-04-25T17:54:31Z", "content": "Scientists have identified two types of cells in the nose that are likely to be point of infection for the Sars-CoV-2 virus, which causes Covid-19, in the body.\r\nThe respiratory tract is filled with numerous cells, among which are goblet cells and ciliated ce… [+2449 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Free robot delivery for health workers in British town - The Straits Times", "description": "A fleet of robots on wheels that deliver shopping in the English town of Milton Keynes have seen their popularity surge as residents are stuck indoors due to...", "url": "https://www.youtube.com/watch?v=4ytZQPEw58k", "urlToImage": null, "publishedAt": "2020-04-25T17:49:04Z", "content": null}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "Reuters", "title": "Will warmer weather help slow the spread of coronavirus? - Business Standard", "description": "Here's what we know about seasonal features of disease outbreaks.", "url": "https://www.business-standard.com/article/health/will-warmer-weather-help-slow-the-spread-of-coronavirus-120042501080_1.html", "urlToImage": null, "publishedAt": "2020-04-25T16:48:38Z", "content": "The world is looking for signs that the arrival of warmer weather in the northern hemisphere could slow the spread of the coronavirus outbreak, which has killed more than 190,000 people and sent the global economy into a tailspin as countries impose lockdowns… [+3655 chars]"}, {"source": {"id": null, "name": "Healthissuesindia.com"}, "author": "Kerean Watts", "title": "World Malaria Day in the time of COVID - Hyderus Cyf", "description": "The era of COVID-19 masks the manifold health issues the world - India included - is grappling with. Malaria is among those issues - and with March 25th marking", "url": "https://www.healthissuesindia.com/2020/04/25/world-malaria-day-in-the-time-of-covid/", "urlToImage": null, "publishedAt": "2020-04-25T16:14:04Z", "content": "The era of COVID-19 masks the manifold health issues the world – India included – is grappling with. Malaria is among those issues – and with March 25th marking World Malaria Day, it is important to pay attention to the disease and afford it the gravity it wa… [+6790 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "World Malaria Day: Governments urged to prevent rise in deaths - Al Jazeera English", "description": "On World Malaria Day, health officials are warning governments to move fast to prevent a rise in Malaria-related deaths. In Kenya, thousands of people have l...", "url": "https://www.youtube.com/watch?v=64nKBK4kq_w", "urlToImage": null, "publishedAt": "2020-04-25T15:59:04Z", "content": "On World Malaria Day, health officials are warning governments to move fast to prevent a rise in Malaria-related deaths.In Kenya, thousands of people have lost their homes after seasonal torrential rains destroyed them. Now, mosquitos are thriving in the wet … [+340 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "'No evidence' people tested positive for Coronavirus are immunised: WHO - Telangana Today", "description": "Geneva: The World Health Organization (WHO) warned on Saturday that there is no evidence that people who test positive for the new Coronavirus are immunised and protected against reinfection. The warning suggests that the issuance of immune passports may prom…", "url": "https://telanganatoday.com/no-evidence-people-with-coronavirus-are-immunised-who", "urlToImage": null, "publishedAt": "2020-04-25T15:21:00Z", "content": "Geneva: The World Health Organization (WHO) warned on Saturday that there is no evidence that people who test positive for the new Coronavirus are immunised and protected against reinfection.\r\nThe warning suggests that the issuance of “immune passports” may p… [+2079 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WATCH | National curfew and mandatory cloth face masks to come into effect under Level 4 - News24", "description": "As of 1 May, a national curfew from 20:00 to 05:00 will be in place and it will be applicable to everyone except essential workers traveling to and from work...", "url": "https://www.youtube.com/watch?v=dNs8wczQKNM", "urlToImage": null, "publishedAt": "2020-04-25T15:15:23Z", "content": null}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Hyderabad University's UVC disinfection trolley can clean coronavirus rapidly - India Today", "description": "The University of Hyderabad along with other institutions have created a UVC based disinfection trolley which can clean coronavirus infected areas rapidly.", "url": "https://www.indiatoday.in/education-today/news/story/hyderabad-university-created-uvc-disinfection-trolley-can-clean-coronavirus-rapidly-1671036-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T15:09:42Z", "content": "In a fight against Covid-19, a UVC based disinfection trolley to rapidly clean hospital environment has been created by the International Advanced Research Centre for Powder Metallurgy and New Materials (ARCI), an autonomous R&amp;D Centre of Department of Sc… [+3034 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Can this pulse monitor detect COVID-19? - Good Morning America", "description": "Pulse oximeters can provide an early warning sign of COVID-19 for patients in hospitals, but are those devices as effective when people use them at home?", "url": "https://www.youtube.com/watch?v=z9sypZ7mWRA", "urlToImage": null, "publishedAt": "2020-04-25T14:28:18Z", "content": "Pulse oximeters can provide an early warning sign of COVID-19 for patients in hospitals, but are those devices as effective when people use them at home?"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "'No evidence' that recovered COVID-19 patients cannot be reinfected: WHO - Moneycontrol", "description": "In a scientific brief, the United Nations agency warned governments against issuing \"immunity passports\" or \"risk-free certificates\" to people who have been infected as their accuracy could not be guaranteed.", "url": "https://www.moneycontrol.com/news/world/no-evidence-that-recovered-covid-19-patients-cannot-be-reinfected-who-5189661.html", "urlToImage": null, "publishedAt": "2020-04-25T13:38:14Z", "content": "The World Health Organisation (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nIn a scientific brief, the United Nations agency w… [+2096 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Sweden goes it alone with 'relaxed' attitude to coronavirus - CGTN", "description": "Sweden's relaxed restrictions could lead to herd immunity but at what cost?", "url": "https://newseu.cgtn.com/news/2020-04-25/Sweden-goes-it-alone-with-relaxed-attitude-to-coronavirus-PYIUqQSwH6/index.html", "urlToImage": null, "publishedAt": "2020-04-25T12:41:25Z", "content": "Everyone wants immunity from the coronavirus. But there may be different ways to get it.\r\nOne is a vaccine. Clinical trials are already underway in the UK, and if all goes well, say those involved, it's possible a vaccination may be ready for production by Se… [+3523 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Kenneth R. Rosen", "title": "Italian Woman Tests Positive for COVID-19 After 60 Days of Quarantine and Swabbing - Newsweek", "description": "Bianca Dobroiu arrived at the Sant'Orsola-Malpighi Polyclinic hospital in Bologna with a fever above 105 degrees and was diagnosed with COVID-19.", "url": "https://www.newsweek.com/italian-woman-tests-positive-covid-19-after-60-days-quarantine-swabbing-1500202", "urlToImage": null, "publishedAt": "2020-04-25T12:30:39Z", "content": "A 23-year-old in Italy being treated for the disease caused by the novel coronavirus continues to test positive, despite two months of quarantine and continual swabs.\r\nBianca Dobroiu arrived at the Sant'Orsola-Malpighi Polyclinic hospital, a public hospital p… [+4335 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Coronavirus And Smoking: French Researchers Suggest Nicotine Could Protect Against Coronavirus - Swarajya", "description": "", "url": "https://swarajyamag.com/news-brief/coronavirus-and-smoking-french-researchers-suggest-nicotine-could-protect-against-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T11:31:00Z", "content": null}, {"source": {"id": null, "name": "India.com"}, "author": "India.com News Desk", "title": "Coronavirus Will be Destroyed by Acids Present in Stomach, Ramdev Makes Bizarre Claim - India.com", "description": "New Delhi: At a time when the entire world is struggling to combat the spread of coronavirus outbreak, Yoga guru Ramdev has come up with a bizarre solution to treat COVID-19. Speaking at an event orga", "url": "https://www.india.com/news/india/coronavirus-will-be-destroyed-by-acids-present-in-stomach-ramdev-makes-bizarre-claim-4010634/", "urlToImage": null, "publishedAt": "2020-04-25T11:18:51Z", "content": "New Delhi: At a time when the entire world is struggling to combat the spread of coronavirus outbreak, Yoga guru Ramdev has come up with a bizarre solution to treat COVID-19. Speaking at an event organised by a media organisation,  Ramdev claimed that if COVI… [+1570 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Plasma therapy trials for coronavirus patients begin in Karnataka - Deccan Herald", "description": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.", "url": "https://www.deccanherald.com/state/top-karnataka-stories/plasma-therapy-trials-for-coronavirus-patients-begin-in-karnataka-829772.html", "urlToImage": null, "publishedAt": "2020-04-25T11:00:06Z", "content": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.\r\nFollow latest updates on the COVID-19 pandemic here\r\nIn a tweet, Medical Education Minister K Sudhakar said, \"Happy to … [+1295 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "Bats cannot directly infect humans with Covid-19: Scientists - Hindustan Times", "description": "According to scientists, Sars-Cov-2 may have diverged from the closest coronavirus found in bats called RaTG13, about 40 to 70 years ago, indicating that the bat virus cannot directly infect humans.", "url": "https://www.hindustantimes.com/india-news/bats-cannot-directly-infect-humans-with-covid-19-scientists/story-uuEwHKcI0x266H1fxawFbN.html", "urlToImage": null, "publishedAt": "2020-04-25T09:30:44Z", "content": "Sixty-four scientists have said bats do not spread Covid-19 after reports of people requesting local authorities to clear trees over a fear of the colonies the winged mammals host.\r\nThe chiropterologists issuing the statement said they came together after rep… [+3518 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Riya Baibhawi", "title": "Doctors say ventilators cause more harm than good to coronavirus patients - Republic World - Republic World", "description": "US doctors are now warning against the use of the ventilators to treat coronavirus patients saying that they were doing more harm than good.", "url": "https://www.republicworld.com/world-news/us-news/doctors-says-ventilators-cause-more-harm-than-good-to-covid-19-patient.html", "urlToImage": null, "publishedAt": "2020-04-25T09:28:00Z", "content": "The demands of ventilators have surged amid the ongoing global health crisis with major countries racing to secure more and more of the breathing machines. However, doctors are now warning against the use of the breathing machines to treat coronavirus patient… [+2040 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "AP", "title": "Coronavirus: WHO warns against idea of 'immunity passports' - Deccan Herald", "description": "The World Health Organization is cautioning against the idea of “immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.", "url": "https://www.deccanherald.com/international/world-news-politics/coronavirus-world-health-organization-warns-against-idea-of-immunity-passports-829739.html", "urlToImage": null, "publishedAt": "2020-04-25T08:50:01Z", "content": "The World Health Organization is cautioning against the idea of immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.\r\nThe concept of immunity pas… [+813 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "Cotton, natural silk, chiffon make best materials for homemade masks against COVID-19: study - The Hindu", "description": "According to the researchers, including those from the University of Chicago in the US, SARS-CoV-2, the new coronavirus that causes COVID-19, is thought to spread mainly through respiratory droplets when an infected person coughs, sneezes, speaks or breathes.", "url": "https://www.thehindu.com/news/international/cotton-natural-silk-chiffon-make-best-materials-for-homemade-masks-against-covid-19-study/article31431280.ece", "urlToImage": null, "publishedAt": "2020-04-25T08:19:56Z", "content": "As people resort to making their own cloth masks due to shortage of surgical and N95 varieties in the wake of the COVID-19 pandemic, a new study says a combination of cotton with natural silk or chiffon can filter out aerosol particles provided that the mask … [+2378 chars]"}, {"source": {"id": null, "name": "Thepeninsulaqatar.com"}, "author": "", "title": "Why has Spain been hit so hard by the coronavirus pandemic? - The Peninsula Qatar", "description": "In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told AFP.", "url": "https://www.thepeninsulaqatar.com/article/25/04/2020/Why-has-Spain-been-hit-so-hard-by-the-coronavirus-pandemic", "urlToImage": null, "publishedAt": "2020-04-25T08:01:00Z", "content": "Barcelona: In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told AFP.\r\nWhile they stressed it was too early to carry out a detailed analysis, th… [+4426 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Nations join WHO in virus initiative, but not US - The Star", "description": "World leaders pledged on Friday to accelerate work on tests, drugs and vaccines against Covid-19 and to share them around the globe. But the United States di...", "url": "https://www.youtube.com/watch?v=BSi5E7Grjx8", "urlToImage": null, "publishedAt": "2020-04-25T06:51:50Z", "content": "World leaders pledged on Friday to accelerate work on tests, drugs and vaccines against Covid-19 and to share them around the globe. But the United States did not take part in the launch.\r\nWATCH MORE: https://thestartv.com/c/newsSUBSCRIBE: https://cutt.ly/The… [+37 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "World Malaria Day 2020: WHO's anti-malaria campaign and target to eliminate malaria from 35 more... - Firstpost", "description": "According to WHO reports, malaria affected more than 228 million people in the world in 2018 and killed about 405,000 people globally in the same year.", "url": "https://www.firstpost.com/health/world-malaria-day-2020-whos-anti-malaria-campaign-and-target-to-eliminate-malaria-from-35-more-countries-by-2030-8298691.html", "urlToImage": null, "publishedAt": "2020-04-25T06:06:06Z", "content": null}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "Coronavirus and COVID-19: Fact versus fiction - The Jakarta Post - Jakarta Post", "description": "Here are some claims that have circulated about how to treat COVID-19 or stop the transmission of the new coronavirus, and the facts according to doctors and health experts.", "url": "https://www.thejakartapost.com/life/2020/04/25/coronavirus-and-covid-19-fact-versus-fiction.html", "urlToImage": null, "publishedAt": "2020-04-25T05:35:00Z", "content": "US President Donald Trump's musings about whether disinfectants and ultraviolet light can be inserted into patients' bodies to treat COVID-19 have alarmed doctors and drawn warnings from the makers of Lysol, Dettol and Clorox.\r\nHere are some other claims that… [+3208 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Nitin Sreedhar", "title": "When a virus jumps: of man, microbes and pandemics - Livemint", "description": "Climate change effects or complex man-animal interactions—why are zoonotic disease outbreaks like covid-19 becoming more frequent?", "url": "https://www.livemint.com/mint-lounge/features/when-a-virus-jumps-of-man-microbes-and-pandemics-11587735889206.html", "urlToImage": null, "publishedAt": "2020-04-25T05:10:40Z", "content": "Inger Andersen, executive director of the UN Environment Programme, said last month that nature was sending humankind a message\" through the coronavirus pandemic and climate crisis. In an interview with The Guardian, the Danish environmentalist said there wer… [+10236 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What COVID-19 Symptoms Should People Be On The Lookout For? - WCCO - CBS Minnesota", "description": "There are so many unknowns about COVID-19. But, one thing has been clear – the virus can present itself differently in different people, Heather Brown report...", "url": "https://www.youtube.com/watch?v=Ml0aBNKYVyc", "urlToImage": null, "publishedAt": "2020-04-25T03:58:36Z", "content": "There are so many unknowns about COVID-19. But, one thing has been clear the virus can present itself differently in different people, Heather Brown reports (2:37).WCCO 4 News at 10 April 24, 2020"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "G Thing: Pet fashion designer finds unique ways to give back to animal rescue crews - PIX11 News", "description": "She's one of the most in demand New York fashion designers for dog and cats.", "url": "https://www.youtube.com/watch?v=WcRkfwYZcdU", "urlToImage": null, "publishedAt": "2020-04-25T03:02:18Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Scientists in Italy find coronavirus on air pollution particles - The Times of Israel", "description": "In preliminary study, researchers detect distinct virus genes on airborne pollutants, suggesting disease could travel farther by air than previously assumed", "url": "https://www.timesofisrael.com/scientists-in-italy-find-coronavirus-on-air-pollution-particles/", "urlToImage": null, "publishedAt": "2020-04-25T01:06:00Z", "content": "In a preliminary study, scientists in Italy detected the coronavirus on particles of air pollution.\r\nIt is still unclear whether the virus is viable or able to cause infections when carried by pollution, according to The Guardian, which first publicized the f… [+1690 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: White House task force addresses national COVID-19 response - KTLA 5", "description": "Update: Federal officials were providing updates on the government's response to COVID-19. #WhiteHouse #coronavirus #COVID19", "url": "https://www.youtube.com/watch?v=18CeqywkFLg", "urlToImage": null, "publishedAt": "2020-04-24T22:05:28Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Chopper 2 Shows Eerily Empty New York City Streets And Landmarks Coronavirus Pandemic - CBS New York", "description": "New York City is usually knowns for its hustle and bustle. Parks and streets constantly filled with people and cars. CBS2's Dan Rice takes us on a ride in Ch...", "url": "https://www.youtube.com/watch?v=2p4iodDjcg8", "urlToImage": null, "publishedAt": "2020-04-24T21:06:47Z", "content": "New York City is usually knowns for its hustle and bustle. Parks and streets constantly filled with people and cars. CBS2's Dan Rice takes us on a ride in Chopper 2 to show just how different the city is during the coronavirus pandemic."}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Deconfine or double down? Coronavirus in France, Turkey, Sweden, Russia - The World This Week - FRANCE 24 English", "description": "From Russia, where mobile phone apps track citizens to ensure compliance with lockdown, to Sweden, which never confined and opted instead for herd immunity, ...", "url": "https://www.youtube.com/watch?v=E_mepoumEA4", "urlToImage": null, "publishedAt": "2020-04-24T19:03:19Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Les Steed", "title": "How does key worker testing work and what time can I apply for a coronavirus test? - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11469520/key-worker-coronavirus-testing-how-what-time/", "urlToImage": null, "publishedAt": "2020-04-24T17:35:15Z", "content": "MATT HANCOCK announced that testing can now be provided for up to seven million key workers and emergency staff.\r\nHere's how to get tested if you are an essential worker who believes that you or a household member has coronavirus.\r\n Matt Hancock said key work… [+6641 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Does COVID-19 Cause Blood Clot Complications? | NBC New York - NBC New York", "description": "A small study of five critically ill COVID-19 patients at Mount Sinai Hospital in New York City could have major implications for how doctors respond to the ...", "url": "https://www.youtube.com/watch?v=twPd0YvY3T0", "urlToImage": null, "publishedAt": "2020-04-24T17:18:33Z", "content": null}, {"source": {"id": null, "name": "Zmescience.com"}, "author": "Fermin Koop", "title": "Vaccine tests in China protected monkeys from coronavirus - ZME Science", "description": "The study was limited, however, both in scope and translatability to humans.", "url": "https://www.zmescience.com/science/china-vaccine-monkey-covid-9252342/", "urlToImage": null, "publishedAt": "2020-04-24T16:35:28Z", "content": "More than 2.6 million people around the world have so far been infected with the coronavirus. As it expands, all hopes are on creating a vaccine, with trials currently taking place in different parts of the world.\r\nCredit Flickr\r\nIn China, researchers at Sino… [+2849 chars]"}, {"source": {"id": null, "name": "Prevention.com"}, "author": "Korin Miller", "title": "Does Coronavirus Cause Blood Clots? Doctors Explain the Life-Threatening Complication - Prevention.com", "description": "The condition can further weaken already struggling lungs, experts say.", "url": "https://www.prevention.com/health/a32264828/coronavirus-blood-clots/", "urlToImage": null, "publishedAt": "2020-04-24T16:30:00Z", "content": "Every day, more news emerges about the serious complications that can result from COVID-19, the respiratory illness caused by the novel coronavirus. But a new one is a bit mysterious: Many doctors have noticed that patients who have a severe case are struggli… [+6790 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": null, "title": "World Immunization Week: WHO highlights other diseases as coronavirus vaccine trials begin - Euronews", "description": "As coronavirus vaccine trials begin in the UK and get the green light in Germany, the World Health Organization warns other diseases must not be neglected.", "url": "https://www.euronews.com/2020/04/23/coronavirus-in-europe-vaccine-trials-begin-in-uk-and-get-green-light-in-germany", "urlToImage": null, "publishedAt": "2020-04-24T14:52:08Z", "content": "The beginning of UK clinical trials this week to find a coronavirus vaccine coincides with the start of World Immunization Week -- encouraging the use of vaccines to protect people against disease generally.\r\nThe event is promoted by the World Health Organiza… [+2089 chars]"}]}