{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Business-standard.com"}, "author": "Kanishka Gupta", "title": "What is the second wave of Covid-19 and why should we be worried?s - Business Standard", "description": "The disease could come back with a greater bang once the lockdown is lifted, with many of the infected being asymptomatic", "url": "https://www.business-standard.com/podcast/current-affairs/what-is-the-second-wave-of-covid-19-and-why-should-we-be-worried-120042500677_1.html", "urlToImage": null, "publishedAt": "2020-04-25T12:36:58Z", "content": "While scientists the world over are trying their best to develop a vaccine and an anti-viral for Covid-19, governments are looking to arrest the rapid decline in the global economy by lifting the lockdown in phases.\r\nIn such a scenario, in which the number of… [+3751 chars]"}, {"source": {"id": null, "name": "Reliefweb.int"}, "author": null, "title": "World Immunization Week | 24 - 30 April 2020: Available vaccines should continue to be offered and utilized to save lives while waiting for an anti COVID-19 vaccine - WHO underlines - World - ReliefWeb", "description": "English News and Press Release on World about Health, Children and Epidemic; published on 24 Apr 2020 by WHO", "url": "https://reliefweb.int/report/world/world-immunization-week-24-30-april-2020-available-vaccines-should-continue-be-offered", "urlToImage": null, "publishedAt": "2020-04-25T12:23:04Z", "content": "24 APRIL 2020 | Cairo – Any suspension of immunization services or hesitancy to use them during the COVID-19 pandemic will result in a resurgence of diseases that have largely been controlled thanks to safe and effective vaccines. That is the warning from the… [+4281 chars]"}, {"source": {"id": null, "name": "Cnbctv18.com"}, "author": null, "title": "Lockdown: Godrej Group urges govt to include mosquito repellents in essential items list - CNBCTV18", "description": "In March, the World Health Organization (WHO) also issued an advisory urging countries to ensure the continuity of malaria services in the context of the COVID-19 pandemic, the statement saidGet latest Business online at cnbctv18.com", "url": "https://www.cnbctv18.com/business/lockdown-godrej-group-urges-govt-to-include-mosquito-repellents-in-essential-items-list-5775731.htm/", "urlToImage": null, "publishedAt": "2020-04-25T12:23:02Z", "content": "The Godrej Group on Saturday urged the government to include mosquito repellents and other similar products in the essential items list during the ongoing lockdown.\r\nAs a trend, malaria and dengue spike during May running up to August and preparation for the … [+1509 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "'No evidence' yet that recovered COVID patients cannot be reinfected: WHO - Times of India", "description": "Rest of World News: The WHO said on Saturday that there was currently \"no evidence\" that people who have recovered from Covid-19 and have antibodies are protected from a", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/no-evidence-yet-that-recovered-covid-patients-cannot-be-reinfected-who/articleshow/75374877.cms", "urlToImage": null, "publishedAt": "2020-04-25T12:18:47Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Aa.com.tr"}, "author": null, "title": "World Malaria Day: Fight against life-threatening disease - Anadolu Agency", "description": "'No evidence-based information chloroquine medication, used in malaria, protective in COVID-19,' says expert  - Anadolu Agency", "url": "https://www.aa.com.tr/en/health/world-malaria-day-fight-against-life-threatening-disease/1818308", "urlToImage": null, "publishedAt": "2020-04-25T12:10:38Z", "content": "ANKARA \r\nWhile humanity is struggling with coronavirus outbreak, the world is observing on April 25 Malaria Day, highlighting the importance of the fight against another life-threatening disease.\r\nAlthough it is very easy and inexpensive to prevent deaths fro… [+3789 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Could stem cell therapy help treat coronavirus? - CBS This Morning", "description": "Doctors are hoping stem cell therapy could be a weapon in the fight against coronavirus. On Friday, regenerative medicine company Mesoblast announced a 300-p...", "url": "https://www.youtube.com/watch?v=4Ul6_EJ3Swg", "urlToImage": null, "publishedAt": "2020-04-25T11:48:58Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Covid-19: Why a vaccine is likely by the end of 2020 - Hindustan Times", "description": "Human safety trials of a coronavirus vaccine developed by Oxford University began on Thursday even as Indian company Serum Institute of India started work on...", "url": "https://www.youtube.com/watch?v=TNhRKAxvbHs", "urlToImage": null, "publishedAt": "2020-04-25T11:32:47Z", "content": "Human safety trials of a coronavirus vaccine developed by Oxford University began on Thursday even as Indian company Serum Institute of India started work on making the vaccine locally so as to be ready in case the trial succeeds. The trial began in Oxford on… [+443 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Coronavirus And Smoking: French Researchers Suggest Nicotine Could Protect Against Coronavirus - Swarajya", "description": "", "url": "https://swarajyamag.com/news-brief/coronavirus-and-smoking-french-researchers-suggest-nicotine-could-protect-against-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T11:31:00Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "COVID-19 vaccine just months away? | Ori Ben Herzl EXCLUSIVE | India Upfront With Rahul Shivshankar - TIMES NOW", "description": "Everyone across the globe is looking for a cure for the Coronavirus pandemic. The International science community is trying to find the best possible way to ...", "url": "https://www.youtube.com/watch?v=9LKjw9V5SMs", "urlToImage": null, "publishedAt": "2020-04-25T11:30:45Z", "content": "Everyone across the globe is looking for a cure for the Coronavirus pandemic. The International science community is trying to find the best possible way to defeat this COVID-19 virus. The plasma therapy is believed to be the first cure but there is also a pa… [+1028 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Explained Desk", "title": "Explained: How coronavirus may affect the kidneys - The Indian Express", "description": "Kidney damage is common in severe cases of Covid-19. However, it is not yet clear if the virus directly attacks the kidneys, or if kidney failure or damage is a part of multiple-organ failure.", "url": "https://indianexpress.com/article/explained/explained-how-coronavirus-may-affect-the-kidneys-6378915/", "urlToImage": null, "publishedAt": "2020-04-25T11:28:27Z", "content": "A patient undergoes dialysis treatment at a dialysis centre, amidst the coronavirus disease (COVID-19) outbreak, in Guayaquil, Ecuador. (Reuters Photo: Santiago Arcos)Apart from ventilators, another kind of machinery that is in shortage amid the coronaviruspa… [+3849 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "'No Evidence that Recovered Covid-19 Patients Cannot be Reinfected': WHO Warns Against 'Immunity Passport... - News18", "description": "The practice could actually increase the risks of continued spread as people who have recovered may ignore advice about taking standard precautions against the virus, the WHO said.", "url": "https://www.news18.com/news/world/no-evidence-that-recovered-covid-19-patients-cannot-be-reinfected-who-warns-govts-against-immunity-passports-2592409.html", "urlToImage": null, "publishedAt": "2020-04-25T10:36:34Z", "content": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nIn a scientific brief, the United Nations agency w… [+1650 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Why the World’s Highest Virus Death Rate Is in Europe’s Capital - Bloomberg", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=04f4c630-86e3-11ea-88f2-0d52bd2de320&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNC0yNS93aHktdGhlLXdvcmxkLXMtaGlnaGVzdC12aXJ1cy1kZWF0aC1yYXRlLWlzLWluLWV1cm9wZS1zLWNhcGl0YWw=", "urlToImage": null, "publishedAt": "2020-04-25T10:14:21Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Dale Smith", "title": "Coronavirus antibody testing a big deal? What to know about the promising serology tests - CNET", "description": "Tests that detect whether you've recovered from COVID-19 might help doctors and government officials navigate the pandemic. Here's what you should know.", "url": "https://www.cnet.com/how-to/coronavirus-antibody-testing-a-big-deal-what-to-know-about-the-promising-serology-tests/", "urlToImage": null, "publishedAt": "2020-04-25T10:10:29Z", "content": "Antibody testing looks for evidence that a person has been infected with the coronavirus SARS-CoV-2, but not the virus itself.\r\nJames Martin/CNET\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nAs some are… [+7629 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Suraksha P", "title": "Will do whatever it takes to ensure that all of us come out of this, says recovered Bengaluru COVID-19 patient - Deccan Herald", "description": "Karnataka Medical Education Minister Dr K Sudhakar and Health Minister B Sriramulu symbolically launched the clinical trials for convalescent plasma therapy here on Saturday at Victoria Hospital in Bengaluru.  Two patients from the state who have recovered fr…", "url": "https://www.deccanherald.com/city/top-bengaluru-stories/will-do-whatever-it-takes-to-ensure-that-all-of-us-come-out-of-this-says-recovered-bengaluru-covid-19-patient-829762.html", "urlToImage": null, "publishedAt": "2020-04-25T10:07:38Z", "content": "Karnataka Medical Education Minister Dr K Sudhakar and Health Minister B Sriramulu symbolically launched the clinical trials for convalescent plasma therapy here on Saturday at Victoria Hospital in Bengaluru. \r\nTwo patients from the state who have recovered f… [+2654 chars]"}, {"source": {"id": null, "name": "Edexlive.com"}, "author": "Edex Live", "title": "Cotton, natural silk, chiffon make best materials for homemade masks against COVID-19: Study - EdexLive", "description": "In the study, published in the journal ACS Nano, the scientists assessed the ability of common fabrics, alone or in combination, to filter out aerosols similar in size to respiratory droplets", "url": "https://www.edexlive.com/news/2020/apr/25/cotton-natural-silk-chiffon-make-best-materials-for-homemade-masks-against-covid-19-study-11578.html", "urlToImage": null, "publishedAt": "2020-04-25T10:07:19Z", "content": "As people resort to making their own cloth masks due to shortage of surgical and N95 varieties in the wake of the COVID-19 pandemic, a new study says a combination of cotton with natural silk or chiffon can filter out aerosol particles provided that the mask … [+2381 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "'No evidence' that recovered COVID-19 patients cannot be reinfected: WHO - Reuters India", "description": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.", "url": "https://in.reuters.com/article/us-health-coronavirus-who-idINKCN2270FB", "urlToImage": null, "publishedAt": "2020-04-25T09:53:00Z", "content": "GENEVA (Reuters) - The World Health Organization (WHO) said on Saturday that there was currently “no evidence” that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection. \r\nIn a scientific brief, the Uni… [+1753 chars]"}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "Patrick Henry", "title": "WHO Warns You May Catch Coronavirus More Than Once - BloombergQuint", "description": "Catching Covid-19 once may not protect you from getting it again, according to the World Health Organization.", "url": "https://www.bloombergquint.com/business/catching-covid-19-may-not-shield-against-new-infection-who-says", "urlToImage": null, "publishedAt": "2020-04-25T09:51:48Z", "content": ""}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Nirmal Narayanan", "title": "Is coronavirus sexually transmitted? Medical expert answers - International Business Times, India Edition", "description": "A previous study report had suggested that men are more prone to the severity of coronavirus infection due to the presence of testicles in their body.", "url": "https://www.ibtimes.co.in/coronavirus-sexually-transmitted-medical-expert-answers-818377", "urlToImage": null, "publishedAt": "2020-04-25T09:40:27Z", "content": "Top US vaccine expert was 'fired'\r\nThe novel coronavirus that originated in a Wuhan seafood market has been spreading chaos all across the globe for the past four months. With death toll nearing 2,00,000, Covid-19 has affected people in all countries irrespec… [+1912 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "Bats cannot directly infect humans with Covid-19: Scientists - Hindustan Times", "description": "According to scientists, Sars-Cov-2 may have diverged from the closest coronavirus found in bats called RaTG13, about 40 to 70 years ago, indicating that the bat virus cannot directly infect humans.", "url": "https://www.hindustantimes.com/india-news/bats-cannot-directly-infect-humans-with-covid-19-scientists/story-uuEwHKcI0x266H1fxawFbN.html", "urlToImage": null, "publishedAt": "2020-04-25T09:30:44Z", "content": "Sixty-four scientists have said bats do not spread Covid-19 after reports of people requesting local authorities to clear trees over a fear of the colonies the winged mammals host.\r\nThe chiropterologists issuing the statement said they came together after rep… [+3518 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Health workers are on the frontline of the COVID-19 pandemic - eNCA", "description": "Health workers are on the frontline of the covid-19 pandemic, some get infected and even succumb to the virus. Retshidisitswe Kotane, who recently graduated,...", "url": "https://www.youtube.com/watch?v=8ZrrAJkQu2w", "urlToImage": null, "publishedAt": "2020-04-25T08:34:11Z", "content": null}, {"source": {"id": null, "name": "Gulfnews.com"}, "author": "AFP", "title": "COVID-19: Does sunlight rapidly destroy the coronavirus? | Americas - Gulf News", "description": "Experts urge caution after US department of homeland security makes claim", "url": "https://gulfnews.com/world/americas/covid-19-does-sunlight-rapidly-destroy-the-coronavirus-1.1587801920020", "urlToImage": null, "publishedAt": "2020-04-25T08:02:36Z", "content": "Generic image used for illustrative purposes\r\n Image Credit: Pixabay\r\nWashington:  Does sunlight rapidly destroy the coronavirus? A White House presentation on a mysterious government study says so - but some scientists have called for caution as we await mor… [+4257 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "ANI", "title": "106-year-old woman who survived Spanish Flu, now beats coronavirus too - Livemint", "description": "Ana del Valle is the oldest survivor of the pandemic outbreaks in Spain.Ana was born in October 1913 and in less than six months she will turn 107", "url": "https://www.livemint.com/news/world/106-year-old-woman-who-survived-spanish-flu-now-beats-coronavirus-too-11587798144700.html", "urlToImage": null, "publishedAt": "2020-04-25T07:15:52Z", "content": "Madrid: We may have all heard that miracles do happen, but sadly not all of us have the chance to witness them in our daily lives, especially during a pandemic today which brings the world to a standstill.Citing a similar story of survival, The Olive Press, a… [+2495 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Dr. Kamal Kant Kohli", "title": "National Institutes of Health releases guidelines for Covid 19 treatment - Medical Dialogues", "description": "National Institutes of Health (NIH) has issued living treatment guidelines of Covid 19. These...", "url": "https://medicaldialogues.in/medicine/news/national-institutes-of-health-releases-guidelines-for-covid-19-treatment-65174", "urlToImage": null, "publishedAt": "2020-04-25T07:03:03Z", "content": "National Institutes of Health (NIH) has issued \"living\" treatment guidelines of Covid 19. These Treatment Guidelines have been developed to inform clinicians how to care for patients with COVID-19.The recommendations of which shall be updated online as and wh… [+3858 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "e-Agenda AajTak: Not just stay at home but also do yoga at home, says Ramdev - India Today", "description": "e-Agenda Aaj Tak: Yoga guru Ramdev said people should not just stay and work at home, but they must also perform yoga at home.", "url": "https://www.indiatoday.in/india/story/e-agenda-aajtak-yoga-ramdev-coronavirus-pandemic-lockdown-1670908-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T06:56:14Z", "content": "In the wake of the coronavirus pandemic and the nationwide lockdown, people should not just stay and work at home, but they must also perform yoga at home, said yoga guru Ramdev on Saturday.\r\nRamdev was speaking at a special session at the e-Agenda Aaj Tak.\r\n… [+1005 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "Sanjiv Das", "title": "Experts stress on radiology preparedness for COVID 19 - Express Healthcare", "description": "Like any other health professionals, radiologists are doing their bit to safeguard their patients with limited resources.  It’s time they get ready to set protocol for preparedness during and post epidemicIn the wake of the global health crisis due t", "url": "https://www.expresshealthcare.in/covid19-updates/experts-stress-on-radiology-preparedness-for-covid-19/419329/", "urlToImage": null, "publishedAt": "2020-04-25T06:20:00Z", "content": "Like any other health professionals, radiologists are doing their bit to safeguard their patients with limited resources.  Its time they get ready to set protocol for preparedness during and post epidemic\r\nIn the wake of the global health crisis due to COVID-… [+13798 chars]"}, {"source": {"id": null, "name": "Yourtango.com"}, "author": "https://www.yourtango.com/users/nicole-pomarico", "title": "Covid-19 Strokes: Coronavirus Is Causing Strokes In Young Adults, Doctors Warn - YourTango", "description": "This is a pretty scary possible side effect of the virus.", "url": "https://www.yourtango.com/2020333481/covid-19-strokes-in-young-adults", "urlToImage": null, "publishedAt": "2020-04-25T05:43:17Z", "content": "This is a pretty scary possible side effect of the virus.\r\nSo far, doctors have believed that coronavirus has had a more mild impact on young adults, but now, they've learned new information that could change that belief.\r\nNow that we're a few months into the… [+3510 chars]"}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "Express News Service", "title": "13 new Covid-19 cases in Telangana; 29 discharged - The New Indian Express", "description": "Eatala rubbishes rumours about unhygienic conditions at Covid wards.", "url": "https://www.newindianexpress.com/cities/hyderabad/2020/apr/25/13-new-covid-19-cases-in-telangana-29-discharged-2134925.html", "urlToImage": null, "publishedAt": "2020-04-25T05:09:00Z", "content": "HYDERABAD: Taking the tally to 983, Telangana recorded 13 new Covid-19 cases on Friday. However, as many as 29 patients were discharged and no new case of death was reported. Speaking to the media on Friday, Health Minister Eatala Rajender said the State gove… [+1979 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Coronavirus Detected on Air Pollution Particles That May Carry It Over Long Distances, Scientists Warn - News18", "description": "Leonardo Setti at the University of Bologna in Italy said it was imperative to investigate if the the coronavirus could be transported through air pollution.", "url": "https://www.news18.com/news/world/coronavirus-detected-on-air-pollution-particles-that-may-carry-it-over-long-distances-scientists-warn-2591919.html", "urlToImage": null, "publishedAt": "2020-04-25T03:39:15Z", "content": "The novel coronavirus has been found on air pollution particles by scientists who are studying if this could allow the virus to advance longer distances, resulting in more number of people contracting it, The Guardian reported.\r\nThe work is still in the initi… [+2716 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Speech Pathologists Face New Challenges Trying To Treat Coronavirus Patients Who Were On Ventilators - CBS New York", "description": "Ventilators have been a key resource in the coronavirus pandemic, but they also strain patients' vocal chords, and now their doctors are also under strain; C...", "url": "https://www.youtube.com/watch?v=1wBvjCP695g", "urlToImage": null, "publishedAt": "2020-04-25T03:28:19Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Agencies", "title": "New study shows Covid-19 infections in Italy began in January - Hindustan Times", "description": "Cases and deaths immediately surged, with scientists soon suspecting that the virus had been around, unnoticed, for weeks.", "url": "https://www.hindustantimes.com/world-news/new-study-shows-covid-19-infections-in-italy-began-in-january/story-wRNRjYvRnrKcWirig4bkUN.html", "urlToImage": null, "publishedAt": "2020-04-25T01:37:52Z", "content": "The first Covid-19 infections in Italy date back to January, according to a scientific study presented on Friday, shedding new light on the origins of the outbreak in one of the world’s worst-affected countries.\r\nItaly began testing people after diagnosing it… [+792 chars]"}, {"source": {"id": null, "name": "Ourbitcoinnews.com"}, "author": null, "title": "Covid19, Second Wave of Corona May Hit India During Rainy Season – Corona Crisis: Second wave of Corona might hit India throughout monsoon - OBN", "description": ", , New Delhi Updated Sat, 25 Apr 2020 06:36 AM IST Listen to the information Even although India has restricted the affect of the…", "url": "https://ourbitcoinnews.com/covid19-second-wave-of-corona-may-hit-india-during-rainy-season-corona-crisis-second-wave-of-corona-may-hit-india-during-monsoon/", "urlToImage": null, "publishedAt": "2020-04-25T01:22:00Z", "content": "Even although India has restricted the affect of the Corona virus epidemic thats wreaking havoc on a worldwide scale, the Indians might must face the second wave of the epidemic within the upcoming monsoon. Scientists have warned {that a} sudden enhance withi… [+1740 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Four-month-old baby from Malappuram dies of Covid-19 - Times of India", "description": "The four-month-old girl child, who tested positive for coronavirus infection two days ago and was under treatment at Kozhikode Medical College Hospita", "url": "https://timesofindia.indiatimes.com/city/kozhikode/four-month-old-baby-from-malappuram-dies-of-covid-19/articleshow/75342997.cms", "urlToImage": null, "publishedAt": "2020-04-24T23:31:25Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Bengaluru: Shortage of hydroxychloroquine a pain for arthritis, lupus patients - Times of India", "description": "Due to its use as a prophylaxis for Covid-19, anti-malarial drug hydroxychloroquine (HCQ) is not available to those who consume it regularly — arthrit", "url": "https://timesofindia.indiatimes.com/city/bengaluru/shortage-of-hcq-a-pain-for-arthritis-lupus-patients/articleshow/75362305.cms", "urlToImage": null, "publishedAt": "2020-04-24T23:19:00Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "VIDEO: Doctor, patient discuss donating plasma - WFSB 3", "description": "A doctor from St. Franics and a patient who recovered from COVID-19 are discussing how donating blood plasma can save others.", "url": "https://www.youtube.com/watch?v=F0ni6X6a5hg", "urlToImage": null, "publishedAt": "2020-04-24T22:39:53Z", "content": "A doctor from St. Franics and a patient who recovered from COVID-19 are discussing how donating blood plasma can save others."}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Hospital celebrates release of 600th COVID patient - Associated Press", "description": "Mt. Sinai Hospital, South Nassau in Oceanside, New York celebrates the discharge of its 600th COVID-19 patient Friday. (April 19) Subscribe for more Breaking...", "url": "https://www.youtube.com/watch?v=oxO8XiVOCdw", "urlToImage": null, "publishedAt": "2020-04-24T20:26:04Z", "content": null}, {"source": {"id": null, "name": "Wjla.com"}, "author": "SCOTT THUMAN, Sinclair Broadcast Group", "title": "Trump signs relief bill into law as some states begin to reopen parts of their economy - KOMO News", "description": "WASHINGTON (SBG) &mdash; President Donald Trump on Friday signed the latest relief package into law &mdash;a whopping $484 billion to help small businesses, hospitals, and testing.  Video: Sinclair Broadcast Group. At the same time, a handful of states are st…", "url": "http://wjla.com/news/coronavirus/trump-signs-relief-bill-into-law", "urlToImage": null, "publishedAt": "2020-04-24T20:14:00Z", "content": null}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Samantha  Black, PhD, The Science Advisory Board staff writer", "title": "Experts discuss promising strategies for tackling SARS-CoV-2 - The Science Board", "description": "What's the best strategy for developing treatments for the SARS-CoV-2 virus? The most promising approaches for a rapid response are antivirals and gene therapy, according to a new review article published April 24 in <em>Frontiers in Microbiology</em>.", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=687", "urlToImage": null, "publishedAt": "2020-04-24T19:24:18Z", "content": "In an unprecedented effort, hundreds of thousands of researchers and clinicians from around the world are fighting against the clock to develop cures, vaccines, and diagnostics for COVID-19, the illness caused by the virus SARS-CoV-2. To date, over 1,650 acad… [+6253 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Madeline Farber", "title": "First known US coronavirus fatality did not show signs of virus, father claims - Fox News", "description": "A California woman whose death in early February is said to be the first known COVID-19 fatality in the U.S. allegedly did not show any signs of the virus before passing away, her father claims.", "url": "https://www.foxnews.com/health/first-known-coronavirus-fatality-us-signs-of-virus", "urlToImage": null, "publishedAt": "2020-04-24T18:39:48Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nA California woman whose death in early February is now said to be the first known COVID-19 fatality in the U.S. did not show any signs of the virus before dying, he… [+2047 chars]"}, {"source": {"id": null, "name": "Greaterkashmir.com"}, "author": null, "title": "Key nose cells identified as likely entry points of coronavirus - Greater Kashmir", "description": "Key nose cells identified as likely entry points of coronavirus Greater Kashmir | Scientists have identified two specific cell types in the nose as likely initial infection points for the novel coronavirus that causes COVID-19. The", "url": "https://www.greaterkashmir.com/news/health/key-nose-cells-identified-as-likely-entry-points-of-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-24T18:39:45Z", "content": null}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "The Hans India", "title": "2nd wave of virus outbreak in monsoon, warn scientists - The Hans India", "description": "The trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the...", "url": "https://www.thehansindia.com/news/national/2nd-wave-of-virus-outbreak-in-monsoon-warn-scientists-619062", "urlToImage": null, "publishedAt": "2020-04-24T18:35:48Z", "content": "New Delhi: The trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the lockdown is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say scient… [+2291 chars]"}, {"source": {"id": null, "name": "Arunachaltimes.in"}, "author": null, "title": "Fight against malaria could be set back 20 years, WHO warns - The Arunachal Times", "description": null, "url": "https://arunachaltimes.in/index.php/2020/04/25/fight-against-malaria-could-be-set-back-20-years-who-warns/", "urlToImage": null, "publishedAt": "2020-04-24T18:08:00Z", "content": "Cape Town, Apr 24 (AP) One of the hard lessons the World Health Organization learned during the Ebola outbreak in West Africa was this: Other diseases can be forgotten and take a deadlier toll.The WHO is now warning that the battle against malaria in sub-Saha… [+2802 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "Experts demolish studies suggesting COVID-19 is no worse than flu - Ars Technica", "description": "Authors of widely publicized antibody studies “owe us all an apology,” one expert says.", "url": "https://arstechnica.com/science/2020/04/experts-demolish-studies-suggesting-covid-19-is-no-worse-than-flu/", "urlToImage": null, "publishedAt": "2020-04-24T17:33:00Z", "content": "Enlarge/ A COVID-19 blood test is administered outside of Delmont Medical Care on April 22, 2020 in Franklin Square, New York. The test identifies antibodies to the coronavirus. \r\n135 with 85 posters participating\r\nFrustrated statisticians and epidemiologists… [+9053 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Doctors utilize virtual appointments to ease patients' fear of catching coronavirus - KBZK Bozeman MT News", "description": "Plans to reopen the state doesn’t mean an end to the current coronavirus pandemic. In fact, doctors say now more than ever is the time to practice safety and...", "url": "https://www.youtube.com/watch?v=-5psSfEhpo0", "urlToImage": null, "publishedAt": "2020-04-24T17:10:43Z", "content": "Plans to reopen the state doesnt mean an end to the current coronavirus pandemic. In fact, doctors say now more than ever is the time to practice safety and sanitation because its better to be safe than sorry."}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mashable News Staff", "title": "Chinese Biotech’s COVID-19 Vaccine Can Protect Monkeys, Claims Report - Mashable India", "description": "A vaccine developed by a Beijing-based company, Sinovac Biotech has proved to be effective at protecting monkeys from getting COVID-19. The vaccine based on chemically inactivated coronavirus is one of six vaccines that are in the ‘clinical evaluation’ phase.", "url": "https://in.mashable.com/science/13474/chinese-biotechs-covid-19-vaccine-can-protect-monkeys-claims-report", "urlToImage": null, "publishedAt": "2020-04-24T17:06:00Z", "content": "A vaccine candidate developed by a Beijing-based company, Sinovac Biotech has proved to be effective at protecting monkeys from getting COVID-19.\r\nCurrently, researchers from all over the world are trying to develop vaccines based on various approaches and th… [+2080 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Even statues in Brazil wear face masks amid coronavirus outbreak - WION", "description": "In the battle against the coronavirus in Brazil, authorities in Rio de Janeiro imposed a mandatory use of masks for people walking on streets or using public...", "url": "https://www.youtube.com/watch?v=PmYD9cpqpKw", "urlToImage": null, "publishedAt": "2020-04-24T15:15:49Z", "content": "In the battle against the coronavirus in Brazil, authorities in Rio de Janeiro imposed a mandatory use of masks for people walking on streets or using public transportation services. According to local media reports, only homemade and common masks are made co… [+1249 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Sweden to shut bars and restaurants that ignore coronavirus restrictions - Reuters India", "description": "Sweden warned on Friday it would shut restaurants and bars in the capital that did not comply with guidelines aimed at preventing the spread of the novel coronavirus, amid signs Stockholm residents were beginning to ignore the rules.", "url": "https://in.reuters.com/article/health-coronavirus-sweden-stockholm-idINKCN2262C2", "urlToImage": null, "publishedAt": "2020-04-24T15:05:14Z", "content": "STOCKHOLM (Reuters) - Sweden warned on Friday it would shut restaurants and bars in the capital that did not comply with guidelines aimed at preventing the spread of the novel coronavirus, amid signs Stockholm residents were beginning to ignore the rules. \r\nT… [+2132 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Matthew Binnicker", "title": "Coronavirus Tests To Reopen The Economy Have Important Limitations, Notes This Diagnostics Expert - Forbes", "description": "Two types of coronavirus tests are crucial for re-opening the economy. But it's important to remember that they're not perfect.", "url": "https://www.forbes.com/sites/coronavirusfrontlines/2020/04/24/coronavirus-tests-to-reopen-the-economy-have-important-limitations-notes-this-diagnostics-expert/", "urlToImage": null, "publishedAt": "2020-04-24T14:57:08Z", "content": "As tests are used to re-open the economy, it's important to remember that they're no perfect. \r\nDaniel Reinhardt/picture alliance via Getty Images\r\nAs the COVID-19 pandemic continues to rage in many parts of the country, there are signs for guarded optimism. … [+4842 chars]"}, {"source": {"id": null, "name": "Healio.com"}, "author": null, "title": "Dermatology expert weighs in on 'COVID toes,' tracking dermatologic symptoms of COVID-19 - Healio", "description": "As the world continues to struggle with the COVID-19 pandemic, new symptoms of the virus continue to be identified. One such symptom, purple or red lesions on the toes and hands, has been dubbed &ldquo;COVID toes&rdquo; and has gained attention over recent we…", "url": "https://www.healio.com/dermatology/dermatitis/news/online/{1f54025b-e860-4862-979d-46daebae6818}/dermatology-expert-weighs-in-on-covid-toes-tracking-dermatologic-symptoms-of-covid-19", "urlToImage": null, "publishedAt": "2020-04-24T14:39:27Z", "content": "As the world continues to struggle with the COVID-19 pandemic, new symptoms of the virus continue to be identified. One such symptom, purple or red lesions on the toes and hands, has been dubbed “COVID toes” and has gained attention over recent weeks. \r\nHeali… [+15263 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus pandemic | Over 50% consumers quit smoking during lockdown: Report - Moneycontrol", "description": "The survey revealed that over half of those who were interviewed had quit smoking during the ongoing lockdown while nearly 30 percent had reduced their daily consumption.", "url": "https://www.moneycontrol.com/news/business/coronavirus-pandemic-over-50-consumers-quit-smoking-during-lockdown-report-5187161.html", "urlToImage": null, "publishedAt": "2020-04-24T13:43:19Z", "content": "During the lockdown period in India, the consumption of cigarettes has taken a hit. A survey of over 100 smokers, conducted by IIFL Securities, found that around 58 percent respondents have quit smoking following the implementation of the nationwide lockdown … [+2003 chars]"}, {"source": {"id": null, "name": "Ommcomnews.com"}, "author": "OMMCOM NEWS", "title": "Covid-19 Result Of Crazy Experiments At Wuhan: Russian Scientist - Ommcom News", "description": "A leading microbiologist from Russia has claimed that the novel coronavirus, which originated in China's Wuhan city, is the outcome of \"crazy\" experiments conducted by scientists at the Wuhan Institute of Virology.", "url": "https://www.ommcomnews.com/india-news/covid-19-result-of-crazy-experiments-at-wuhan-russian-scientist", "urlToImage": null, "publishedAt": "2020-04-24T13:12:59Z", "content": "Subscribe\r\nSubscribe to never miss a news \r\nNew Delhi/London: A leading microbiologist from Russia has claimed that the novel coronavirus, which originated in China's Wuhan city, is the outcome of \"crazy\" experiments conducted by scientists at the Wuhan Insti… [+2315 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Adam Forrest", "title": "Coronavirus: Eyes could be contagious for weeks, study finds - The Independent", "description": "Eye fluid could may be ‘not only a site of virus entry but also a source of contagion,’ Italian study concludes", "url": "https://www.independent.co.uk/news/health/coronavirus-eyes-contagious-infection-conjunctivitis-italy-wuhan-a9482186.html", "urlToImage": null, "publishedAt": "2020-04-24T12:45:34Z", "content": "The coronavirus can linger in patients eyes for several weeks and could act as a way of spreading the Covid-19 disease, according new study from Italy.\r\nScientists at Italys National Institute for Infectious Diseases hospital in Rome studied the symptoms of a… [+1675 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Can I get coronavirus from my pet? - India Today", "description": "There's no evidence pets are spreading the virus to people. However, there have been a few cases worldwide where animals likely got the virus from humans, according to the US Department of Agriculture and US Centers for Disease Control and Prevention.", "url": "https://www.indiatoday.in/science/story/can-i-get-coronavirus-from-my-pet-1670664-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T12:31:07Z", "content": null}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "Associated Press", "title": "Focus on combatting coronavirus can take fight against malaria back by 20 years, warns WHO - The New Indian Express", "description": "The WHO said new projections indicate that in a worst-case scenario, 769,000 people could die of malaria in sub-Saharan Africa this year as campaigns to combat it are interrupted.", "url": "https://www.newindianexpress.com/world/2020/apr/24/focus-on-combatting-coronavirus-can-take-fight-against-malaria-back-by-20-years-warns-who-2134749.html", "urlToImage": null, "publishedAt": "2020-04-24T12:15:00Z", "content": "CAPE TOWN: One of the hard lessons the World Health Organization learned during the Ebola outbreak in West Africa was this: Other diseases can be forgotten and take a deadlier toll.\r\nThe WHO is now warning that the battle against malaria in sub-Saharan Africa… [+3016 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Reuters", "title": "Coronavirus: US Covid-19 death toll expected to reach 50,000 today - Livemint", "description": "About 875,000 Americans have contracted the coronavirus disease, and on average about 2,000 have died every day this month.Deaths are also likely higher, as most states only count hospital and nursing home victims and not those who died at home", "url": "https://www.livemint.com/news/india/coronavirus-us-covid-19-death-toll-expected-to-reach-50-000-today-11587728517502.html", "urlToImage": null, "publishedAt": "2020-04-24T11:57:01Z", "content": "The US death toll from the novel coronavirus is expected to reach 50,000 on Friday, doubling in 10 days and the highest in the world, according to a Reuters tally.About 875,000 Americans have contracted the highly contagious respiratory illness COVID-19 cause… [+2472 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Vinod Rathore", "title": "Blood thickening, clots in covid-19 patients alarm doctors - News Track English", "description": "New York: A new news related to the corona virus has shocked doctors. This virus is now clotting the blood of the body of the infected. Nephrologists at Mount Sinai Hospital in New York, New York, USA have found that blood is also accumulating in the kidneys …", "url": "https://english.newstracklive.com/news/blood-blockage-in-body-of-corona-patients-says-doctors-mc24-nu764-ta272-1087286-1.html", "urlToImage": null, "publishedAt": "2020-04-24T11:31:04Z", "content": null}, {"source": {"id": null, "name": "Edexlive.com"}, "author": "Edex Live", "title": "Dietary supplements important weapon for fighting off COVID-19, say researchers - EdexLive", "description": "In particular vitamin C, vitamin D, zinc, and an omega-3 fatty acid found in fish, docosahexaenoic acid, also known as DHA, are critical for immune function", "url": "https://www.edexlive.com/news/2020/apr/24/dietary-supplements-important-weapon-for-fighting-off-covid-19-say-researchers-11557.html", "urlToImage": null, "publishedAt": "2020-04-24T11:08:04Z", "content": "Supplements containing vitamins C and D and other micronutrients are a safe, effective and low-cost means of helping your immune system fight off COVID-19 and other acute respiratory tract diseases, say researchers.\r\nAccording to the study, published in the j… [+2042 chars]"}, {"source": {"id": null, "name": "Scoopwhoop.com"}, "author": "Akanksha Bhatia", "title": "Proud To Be Your Husband: A Coronavirus Patient's Heartbreaking Last Words To His Wife - ScoopWhoop", "description": "She found the note on his phone after he passed away from COVID-19.", "url": "https://www.scoopwhoop.com/culture/proud-to-be-your-husband-a-coronavirus-patient-s-heartbreaking-last-words-to-his-wife/", "urlToImage": null, "publishedAt": "2020-04-24T10:59:15Z", "content": "Across the world, people are losing their loved ones in this fight against the pandemic. Some get the chance to say goodbye, while others don't. \r\nSource: Gofundme\r\n32-year-old Jon was being treated for the past month, after he tested positive. And when Katie… [+1300 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Covid causing blood clots in patients: Docs - ETHealthworld.com", "description": "The number of COVID-19 cases crossed the 2.5 million mark recently, as researchers rush to make new findings and search for a vaccine.", "url": "https://health.economictimes.indiatimes.com/news/industry/covid-causing-blood-clots-in-patients-docs/75345684", "urlToImage": null, "publishedAt": "2020-04-24T10:02:21Z", "content": "As coronavirus spread through New York City in late March, doctors at Mount Sinai Hospital noticed something strange happening to patients blood. Signs of blood thickening and clotting were being detected in different organs by doctors from different specialt… [+1180 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Pune Mirror", "title": "India may see second wave of COVID-19 outbreak in monsoon, say scientists - Pune Mirror", "description": "A study published in The Lancet journal earlier this month modelled the potential adverse consequences of premature relaxation of interventions, and found it might lead to a second wave of infections", "url": "https://punemirror.indiatimes.com/news/india/covid-19-india-may-see-second-wave-of-outbreak-in-monsoon-say-scientists/articleshow/75347662.cms", "urlToImage": null, "publishedAt": "2020-04-24T09:37:00Z", "content": "The trajectory of COVID-19\r\n cases could have plateaued and might even fall for some weeks after the lockdown\r\n is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say scientists\r\n.… [+6693 chars]"}, {"source": {"id": null, "name": "Newsonair.com"}, "author": null, "title": "Human trials of vaccine developed by Oxford University against novel coronavirus begins in UK - All India Radio", "description": "Human trials of an eagerly-awaited vaccine, developed by the Oxford University, against the novel coronavirus began in the UK on Thursday.", "url": "http://newsonair.com/Main-News-Details.aspx?id=386579", "urlToImage": null, "publishedAt": "2020-04-24T09:12:44Z", "content": "Human trials of an eagerly-awaited vaccine, developed by the Oxford University, against the novel coronavirus began in the UK on Thursday. Scientists have given the vaccine an 80 per cent chance of success.The UK government has pledged 20 million pounds to su… [+564 chars]"}, {"source": {"id": null, "name": "Selectscience.net"}, "author": "SelectScience", "title": "Pfizer, BioNTech COVID-19 vaccine cleared for human tests - SelectScience", "description": "Pfizer and BioNTech to start human trials of COVID-19 vaccine", "url": "https://www.selectscience.net/industry-news/pfizer-and-biontech-to-start-human-trials-of-covid-19-vaccine/?artID=51330", "urlToImage": null, "publishedAt": "2020-04-24T09:09:30Z", "content": null}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nLizzie Roberts", "title": "Contact tracing: how has it worked for other countries, and could it really help ease UK lockdown? - The Telegraph", "description": "From teams of 'corona detectives' to Army cadets making thousands of calls a day, countries are tracking the spread of Covid-19", "url": "https://www.telegraph.co.uk/news/2020/04/25/what-contact-tracing-how-work-countries-uk-lockdown/", "urlToImage": null, "publishedAt": "2020-04-24T06:57:00Z", "content": "Countries around the world are rushing to launch contact tracing apps to identify who an infected person has had contact with, as part of efforts to slow the spread of the coronavirus. \r\nThe UK Government has announced the infrastructure was being put in plac… [+1754 chars]"}, {"source": {"id": null, "name": "Webmd.com"}, "author": "Neha  Pathak, MD", "title": "The Great Invader: How COVID Attacks Every Organ - dineshr", "description": "It can cause symptoms that may be confused with a cold or the flu. It can cause pinkeye, a runny nose, loss of taste and smell, muscle aches, fatigue, diarrhea, loss of appetite, nausea and vomiting, whole-body rashes, and areas of swelling and redness in jus…", "url": "https://www.webmd.com/lung/news/20200423/the-great-invader-how-covid-attacks-every-organ", "urlToImage": null, "publishedAt": "2020-04-24T02:25:10Z", "content": "medRxiv: COVID-19 Antibody Seroprevalence in Santa Clara County, California.\r\nJoseph Vinetz, MD,  professor, Section of Infectious Diseases, Yale School of Medicine, New Haven, CT.\r\nScience: How does coronavirus kill? Clinicians trace ferocious rampage throug… [+1053 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "CDC Director Clarifies Coronavirus Comments - HuffPost", "description": "President Donald Trump said Dr. Robert Redfield was misquoted about the coronavirus resurging in the fall, but the CDC director said his interview with The W...", "url": "https://www.youtube.com/watch?v=XhPtzNbO8iI", "urlToImage": null, "publishedAt": "2020-04-23T21:33:39Z", "content": "President Donald Trump said Dr. Robert Redfield was misquoted about the coronavirus resurging in the fall, but the CDC director said his interview with The Washington Post was accurate. \r\nSubscribe to HuffPost today: http://goo.gl/xW6HGSupport our work: https… [+134 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "According to Researches, Filter Coffee Extends Life, Turkish Coffee Is Harmful To The Heart - Somag News", "description": "In a study conducted by the Swedish University of Gothenburg, it is stated that filter coffee is beneficial to health and can prolong life, but coffee boiled like Turkish coffee increases the risk of heart disease. The results of the research, published in th…", "url": "https://www.somagnews.com/according-researches-filter-coffee-extends-life-turkish-coffee-harmful-heart/", "urlToImage": null, "publishedAt": "2020-04-23T18:26:00Z", "content": "In a study conducted by the Swedish University of Gothenburg, it is stated that filter coffee is beneficial to health and can prolong life, but coffee boiled like Turkish coffee increases the risk of heart disease.\r\nThe results of the research, published in t… [+1203 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Blood Clots a New Surprise Side Effect in Coronavirus Patients | NBC10 Philadelphia - NBC10 Philadelphia", "description": "Doctors are noticing a new trend in COVID-19 patients in the form of blood clots. NBC10’s Matt DeLucia spoke with two local doctors about what they’re seeing...", "url": "https://www.youtube.com/watch?v=t2Bu8mqxwrg", "urlToImage": null, "publishedAt": "2020-04-23T17:56:50Z", "content": "Doctors are noticing a new trend in COVID-19 patients in the form of blood clots. NBC10s Matt DeLucia spoke with two local doctors about what theyre seeing at hospitals. \r\n_____\r\nSUBSCRIBE TO NBC10: VISIT the NBC10 channel for the latest news and exclusive re… [+437 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Joshua Nelson", "title": "NYC doctor reacts to study showing most NY coronavirus patients had underlying issue - Fox News", "description": "Dr. Craig Spencer reacted Thursday on “America’s Newsroom” to a new study revealing that most of the people in New York City who were hospitalized due to coronavirus had one or more underlying health issues.", "url": "https://www.foxnews.com/media/nyc-doctor-patients-covid-underlying-issues", "urlToImage": null, "publishedAt": "2020-04-23T16:37:37Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nDr. Craig Spencer reacted Thursday on “America’s Newsroom” to a new study revealing that most of the people in New York City who were hospitalized due to coronavirus… [+3065 chars]"}, {"source": {"id": null, "name": "Theshillongtimes.com"}, "author": "Agencies", "title": "Most COVID-19 patients put on ventilators in NY died: Study - The Shillong Times", "description": "New York : Researchers have found that nearly all coronavirus (COVID-19) hospitalised patients placed on mechanical ventilators in New York's largest health system have died.For the findings, published in the Journal of the American Medical Associati", "url": "http://theshillongtimes.com/2020/04/24/most-covid-19-patients-put-on-ventilators-in-ny-died-study/", "urlToImage": null, "publishedAt": "2020-04-23T15:19:00Z", "content": "New York : Researchers have found that nearly all coronavirus (COVID-19) hospitalised patients placed on mechanical ventilators in New York’s largest health system have died.\r\nFor the findings, published in the Journal of the American Medical Association, the… [+1709 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Yeji Jesse Lee", "title": "'COVID Toes' might be the latest unusual sign that people are infected with the novel coronavirus - Business Insider India", "description": "COVID Toes, purple and swollen toes that look like they've been frostbitten, may be the latest indication of coronavirus infection.The American Academy of", "url": "https://www.businessinsider.in/science/news/covid-toes-might-be-the-latest-unusual-sign-that-people-are-infected-with-the-novel-coronavirus/articleshow/75329215.cms", "urlToImage": null, "publishedAt": "2020-04-23T15:00:00Z", "content": "Purple and swollen toes that look like they've been frostbitten may be the latest indication of coronavirus infection, doctors say.\r\nDubbed 'COVID Toes' by the dermatology community, this symptom could be the latest indication that you should get tested for c… [+5331 chars]"}]}