{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Britta Zeltmann", "title": "UK coronavirus death toll rises to 18,100 as 763 more die including 26-year-old die - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11451775/coronavirus-death-toll-rises-england-deaths/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/04/DD-COMPOSITE-C19-graphs-2.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-04-22T16:30:02Z", "content": "THE UK coronavirus death toll has risen to 18,100 after 763 more deaths were recorded today.\r\nThe Department of Health confirmed that 133,495 have tested positive for the killer bug - up 4,451 from yesterday.\r\n Technicians during the opening of the new Covid-… [+7227 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mayo Clinic expert answers questions about antibody testing for COVID-19 - Mayo Clinic", "description": "A new serology, or antibody, test for COVID-19 has been developed and is now in use by Mayo Clinic Laboratories. . Unlike the molecular diagnostic test for C...", "url": "https://www.youtube.com/watch?v=laG_UAIUZ6w", "urlToImage": "https://i.ytimg.com/vi/laG_UAIUZ6w/hqdefault.jpg", "publishedAt": "2020-04-22T15:11:22Z", "content": "A new serology, or antibody, test for COVID-19 has been developed and is now in use by Mayo Clinic Laboratories. . Unlike the molecular diagnostic test for COVID-19, which determines if someone is currently infected with the SARS-CoV-2, the virus that causes … [+676 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Daniel Michaels", "title": "Mortality Rates Tell True Tale of Coronavirus’s Effect - The Wall Street Journal", "description": "Governments are studying overall death totals to determine when they can ease their lockdown measures", "url": "https://www.wsj.com/articles/mortality-rates-tell-true-tale-of-coronaviruss-effect-11587558540", "urlToImage": "https://images.wsj.net/im-179035/social", "publishedAt": "2020-04-22T14:19:56Z", "content": "Governments considering reopening economies frozen by restrictions to limit the spread of the new coronavirus are struggling to determine how deadly it is. With tests for the virus still in short supply, many analysts are looking to the blunter measure of tot… [+273 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Sanjeev Miglani", "title": "India suspends coronavirus antibody tests after questions over reliability - Reuters", "description": "India has ordered a pause in testing for antibodies to the coronavirus because of concern over the accuracy, health officials said on Wednesday, complicating the fight against the epidemic as its tally of cases nears 20,000.", "url": "https://www.reuters.com/article/us-health-coronavirus-southasia-idUSKCN22414L", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200422&t=2&i=1515995751&w=1200&r=LYNXNPEG3L0MZ", "publishedAt": "2020-04-22T14:09:09Z", "content": "NEW DELHI (Reuters) - India has ordered a pause in testing for antibodies to the coronavirus because of concern over the accuracy, health officials said on Wednesday, complicating the fight against the epidemic as its tally of cases nears 20,000. \r\nIndia trai… [+4037 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: First US deaths weeks earlier than thought - BBC News", "description": "Two newly identified cases in California are now believed to be the earliest virus deaths in the US.", "url": "https://www.bbc.co.uk/news/world-us-canada-52385558", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/AAA8/production/_111888634_gettyimages-1220306364-1.jpg", "publishedAt": "2020-04-22T14:03:45Z", "content": "Image copyrightGetty ImagesImage caption\r\n There are now over 15,000 cases in Los Angeles\r\nAn autopsy in California has revealed that the first US coronavirus-related death came weeks earlier than previously thought.\r\nThe first previously known death in the U… [+1780 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Why you should wear a face mask to fight coronavirus - Vox", "description": "Face masks don't make you invincible. Support Vox by joining the Video Lab at http://vox.com/join or making a one-time contribution: http://vox.com/contribut...", "url": "https://www.youtube.com/watch?v=P27HRClMf2U", "urlToImage": "https://i.ytimg.com/vi/P27HRClMf2U/maxresdefault.jpg", "publishedAt": "2020-04-22T14:00:13Z", "content": "Face masks don't make you invincible.\r\nSupport Vox by joining the Video Lab at http://vox.com/join or making a one-time contribution: http://vox.com/contribute\r\nThe fight against coronavirus is global. But the guidelines on whether you should wear a face mask… [+2706 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "IGIB scientists develop low-cost COVID-19 test; name it after detective character 'Feluda' - Deccan Herald", "description": "Scientists at the CSIR's Institute of Genomics and Integrative Biology have come up with a low-cost coronavirus test that will not require any expensive machines for detection of the pathogen. Named after 'Feluda', the detective character in legendary filmmak…", "url": "https://www.deccanherald.com/science-and-environment/igib-scientists-develop-low-cost-covid-19-test-name-it-after-detective-character-feluda-828560.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/04/22/iStock-1201170570%20%287%29-1587563966.jpg", "publishedAt": "2020-04-22T13:58:06Z", "content": "Scientists at the CSIR's Institute of Genomics and Integrative Biology have come up with a low-cost coronavirus test that will not require any expensive machines for detection of the pathogen.\r\nNamed after 'Feluda', the detective character in legendary filmma… [+1883 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Newly discovered bats are related to those associated with the pandemic - CNN", "description": "Four new species of African leaf-nosed bats have been discovered, and they're related to the horseshoe bats that have become known as the host for novel coronavirus.", "url": "https://www.cnn.com/2020/04/22/world/leaf-nosed-bats-discovery-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200421142844-01-leaf-nosed-bats-discovery-super-tease.jpg", "publishedAt": "2020-04-22T13:16:18Z", "content": null}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Bloomberg", "title": "Coronavirus: Pfizer, BioNTech covid-19 vaccine cleared for human clinical trials - Livemint", "description": "Regulators gave the green light to test Pfizer, BioNTech proposed vaccine on 200 healthy people aged 18 to 55 years in a first stage, and on additional high-risk candidates in a second stage.Human trials of a potential vaccine being developed by Oxford Univer…", "url": "https://www.livemint.com/news/world/coronavirus-pfizer-biontech-covid-19-vaccine-cleared-for-human-clinical-trials-11587560504587.html", "urlToImage": "https://images.livemint.com/img/2020/04/22/600x338/vaccine1_1587560897712_1587560898814.jpg", "publishedAt": "2020-04-22T13:12:49Z", "content": "BERLIN :\r\nPfizer Inc. and BioNTech SE secured approval for Germanys first human clinical trials of a possible coronavirus vaccine, entering a global race to develop a defense against the pandemic.Regulators gave the green light to test the companies proposed … [+1508 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Max Hospital doctor who oversaw blood plasma treatment in COVID-19 patient in Delhi explains how the... - Firstpost", "description": "Convalescent plasma therapy, or passive antibody therapy, involves taking the blood plasma of a recovered patient and transferring it to an infected person.", "url": "https://www.firstpost.com/health/max-hospital-doctor-who-oversaw-blood-plasma-treatment-in-covid-19-patient-in-delhi-explains-how-the-therapy-works-8287381.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2017/09/HIV-AIDS-blood.jpg", "publishedAt": "2020-04-22T12:54:18Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Coronavirus Originated in Wuhan Laboratory, Claims French Nobel Prize-winning Scientist - News18", "description": "As per a recent Washington Post, two years ago, the US embassy officials in China raised concerns about the insufficient biosafety at the Chinese government's Wuhan Institute of Virology where deadly viruses and infectious diseases are studied.", "url": "https://www.news18.com/news/world/nobel-winning-scientist-luc-montagnier-claims-coronavirus-originated-in-wuhan-lab-2588367.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587145786_coronavirus-testing.jpg", "publishedAt": "2020-04-22T12:45:09Z", "content": "French Nobel prize winning scientist Luc Montagnier has sparked a fresh controversy by claiming that the SARS-CoV-2 virus came from a lab, and is the result of an attempt to manufacture a vaccine against the AIDS virus.\r\nIn an interview given to French CNews … [+2250 chars]"}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "Sohini Das", "title": "Battling Covid-19: India to try BCG vaccine on humans within next two weeks - Business Standard", "description": "The 100-yr old vaccine has an established safety profile; if effective can hit the market within this year", "url": "https://www.business-standard.com/article/current-affairs/battling-covid-19-india-to-try-bcg-vaccine-on-humans-within-next-two-weeks-120042201068_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-04/21/full/1587452339-5953.png", "publishedAt": "2020-04-22T12:35:00Z", "content": "A vaccine Indians get at birth for tuberculosis will in two weeks be tested on adults to see if it builds immunity against the novel coronavirus, which till Wednesday evening had kill 652 people in the country.\r\nPune-based Serum Institute's recombinant BCG va… [+2828 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Bloomberg", "title": "Coronavirus: A herd immunity strategy could actually work in youthful India - Livemint", "description": "By allowing the virus to be unleashed in a controlled way for the next seven months would give 60% of the country’s people immunity by November, and thus halt the disease", "url": "https://www.livemint.com/news/india/coronavirus-a-herd-immunity-strategy-could-actually-work-in-youthful-india-11587555143312.html", "urlToImage": "https://images.livemint.com/img/2020/04/22/600x338/police1_1587556187700_1587556189731.jpg", "publishedAt": "2020-04-22T12:17:44Z", "content": "Controversial given the high risk of deaths, a coronavirus strategy discarded by the UK is being touted as the solution for poor but young countries like India.The herd immunity strategy, which would allow a majority of the population to gain resistance to th… [+6682 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Antibodies may provide a new treatment for OCD - Telangana Today", "description": "London: Mental health conditions such as obsessive-compulsive disorder (OCD) could be treated in a new way using drugs that target the immune system, research suggests. Published in the journal Brain, Behavior and Immunity, the study found that patients suffe…", "url": "https://telanganatoday.com/antibodies-may-provide-a-new-treatment-for-ocd", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2020/04/Antibodies-may-provide-a-ne.jpg", "publishedAt": "2020-04-22T12:00:00Z", "content": "London: Mental health conditions such as obsessive-compulsive disorder (OCD) could be treated in a new way using drugs that target the immune system, research suggests.\r\nPublished in the journal Brain, Behavior and Immunity, the study found that patients suff… [+2102 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AP", "title": "India plans wristband patient surveillance as lockdown eases - Livemint", "description": "The wristband project aims to track quarantined patients and aid health workers and those delivering essential services.India is ramping up surveillance as it begins to ease one of the world's strictest virus lockdowns", "url": "https://www.livemint.com/news/india/india-plans-wristband-patient-surveillance-as-lockdown-eases-11587555609909.html", "urlToImage": "https://images.livemint.com/img/2020/04/22/600x338/20200422098L_1587555970085_1587556013026.jpg", "publishedAt": "2020-04-22T11:47:25Z", "content": "NEW DELHI :\r\nIndia said Wednesday that it plans to manufacture thousands of wristbands that will monitor the locations and temperatures of coronavirus patients and help perform contact tracing.The wristband project aims to track quarantined patients and aid h… [+2233 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Can Asymptomatic Coronavirus Cases Be Transmitted? - QuickTake by Bloomberg", "description": "A lot of people infected with the coronavirus have very mild or even no symptoms, or ones that don’t match the usual markers of fever, dry cough or difficult...", "url": "https://www.youtube.com/watch?v=szIZ2wqFZUg", "urlToImage": "https://i.ytimg.com/vi/szIZ2wqFZUg/maxresdefault.jpg", "publishedAt": "2020-04-22T11:17:40Z", "content": null}, {"source": {"id": null, "name": "Jagran.com"}, "author": "James Kuanal", "title": "Smoking can increase your chances of getting COVID-19: WHO - Jagran English", "description": "Tobacco weakens your respiratory system making you more vulnerable to the virus  the WHO said   Pic credits   WHO Twitter", "url": "https://english.jagran.com/lifestyle/smoking-tobacco-products-can-increase-your-chance-of-getting-covid19-who-10011008", "urlToImage": "https://www.jagranimages.com/images/2020/apr/WHO1587553101387.jpg", "publishedAt": "2020-04-22T10:51:51Z", "content": "New Delhi | Jagran News Desk: The World Health Organisation on Wednesday said that using tobacco can increase the chance of getting coronavirus. \r\n\"Smokers are likely to be more vulnerable to COVID-19 as the act of smoking means that fingers (and possibly con… [+1826 chars]"}, {"source": {"id": null, "name": "Nikkei.com"}, "author": "JADA NAGUMO", "title": "Japan to block foreign investment in medicine amid coronavirus - Nikkei Asian Review", "description": "New law to deem makers of vaccines and ventilators critical to national security", "url": "https://asia.nikkei.com/Politics/Japan-to-block-foreign-investment-in-medicine-amid-coronavirus", "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fs3-ap-northeast-1.amazonaws.com%2Fpsh-ex-ftnikkei-3937bb4%2Fimages%2F8%2F7%2F7%2F1%2F26631778-1-eng-GB%2FRTS38LGN.JPG?source=nar-cms&width=1024&height=512&fit=cover&gravity=faces", "publishedAt": "2020-04-22T10:04:00Z", "content": "TOKYO -- Japan plans to prevent foreign companies from acquiring domestic pharmaceutical and medical equipment makers, Nikkei has learned.\r\nThe Japanese government will include companies that operate in the fields of vaccines, medicine and advanced medical eq… [+2103 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Growing concerns about mental health in UK - Al Jazeera English", "description": "In the United Kingdom, more than 17,000 people have now died in hospitals, and there are fears the true extent of the coronavirus outbreak is much higher. Bu...", "url": "https://www.youtube.com/watch?v=ajSTTYAPePM", "urlToImage": "https://i.ytimg.com/vi/ajSTTYAPePM/maxresdefault.jpg", "publishedAt": "2020-04-22T09:53:08Z", "content": "In the United Kingdom, more than 17,000 people have now died in hospitals, and there are fears the true extent of the coronavirus outbreak is much higher.\r\nBut while many health officials try to fight the virus, others are responding to a surge in demand for … [+333 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "No benefit, higher death rate for hydroxychloroquine in coronavirus study - India Today", "description": "In the study, death rates for patients on hydroxychloroquine were 28 percent, compared to 22 percent when it was taken with the anti-biotic azithromycin -- a combination favored by the French scientist whose study on the subject triggered a surge of global in…", "url": "https://www.indiatoday.in/science/story/hydroxychloroquine-study-coronavirus-1669756-2020-04-22", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202004/000_1Q4809_2-647x363.jpeg?Y41CsgprCK8GXVdDrzWNpZ5SlNzJFViL", "publishedAt": "2020-04-22T08:54:15Z", "content": "A malaria drug widely touted as a potential cure for COVID-19 showed no benefit against the disease over standard care -- and was in fact associated with more deaths, the biggest study of its kind showed Tuesday.\r\nThe US government funded analysis of how Amer… [+3100 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Podcast: COVID-19 vaccine development, patient data and isolation diaries - Imperial College London", "description": "In this edition: We hear from researchers working on a COVID-19 vaccine and with patient samples, and how students are coping in isolation. News: University ...", "url": "https://www.youtube.com/watch?v=UG541b2mOck", "urlToImage": "https://i.ytimg.com/vi/UG541b2mOck/maxresdefault.jpg", "publishedAt": "2020-04-22T08:53:17Z", "content": "In this edition: We hear from researchers working on a COVID-19 vaccine and with patient samples, and how students are coping in isolation.\r\nNews: University Challenge win and neutrino discovery We celebrate Imperials spectacular University Challenge win and … [+816 chars]"}, {"source": {"id": null, "name": "Weforum.org"}, "author": "Tolu Oni", "title": "COVID-19 shows the link between human and planetary health - World Economic Forum", "description": "The damage we have done to our planet is exacerbating the spread and severity of the COVID-19 pandemic - but our collective response shows all is not lost.", "url": "https://www.weforum.org/agenda/2020/04/on-earth-day-heres-what-covid-19-can-teach-us-about-improving-our-planetary-health/", "urlToImage": "https://assets.weforum.org/article/image/responsive_medium_wN1KXU5rwUPAVT2lOGSrMEGk5ni_oHpLqkm72e4f6lI.JPG", "publishedAt": "2020-04-22T08:42:38Z", "content": "<ul><li>The damage we have done to our planet is having a direct impact on the spread and severity of COVID-19.</li><li>The global response, however, demonstrates our ability to work together.</li><li>By focusing collectively on our planetary health, we can e… [+9427 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Vaccine tests: UK to start human trials on thursday - euronews (in English)", "description": "Across Europe, countries are taking their first cautious steps toward opening up - as they gradually start to lift lockdown restrictions. But authorities say...", "url": "https://www.youtube.com/watch?v=w-oxV2Z3aWE", "urlToImage": "https://i.ytimg.com/vi/w-oxV2Z3aWE/hqdefault.jpg", "publishedAt": "2020-04-22T08:38:58Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The similarities between COVID-19 and illnesses like malaria, common flu | Citi Newsroom - CitiTube", "description": "Dr Kelvin Owusu joins Dziffa on the health segment on the Breakfast Daily, Dr Kelvin Owusu joins Dziffa to talk about some similarities between COVID-19 and ...", "url": "https://www.youtube.com/watch?v=qQTnoKh_CRk", "urlToImage": "https://i.ytimg.com/vi/qQTnoKh_CRk/maxresdefault.jpg", "publishedAt": "2020-04-22T08:27:56Z", "content": null}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: US health official warns of dangerous second wave - BBC News", "description": "The top US health official warns a fresh outbreak could coincide with the flu season.", "url": "https://www.bbc.com/news/world-us-canada-52378845", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/F512/production/_111883726_mediaitem111883725.jpg", "publishedAt": "2020-04-22T08:25:04Z", "content": "Image copyrightGetty ImagesImage caption\r\n The US has reported the most coronavirus cases in the world\r\nA second wave of coronavirus cases in the US could be even worse than the first, the country's top health official has warned. \r\nCenters for Disease Contro… [+3354 chars]"}, {"source": {"id": null, "name": "Indiaspend.com"}, "author": "Shreehari Paliath", "title": "Gram-negative sepsis drug to be trialled for treating critically-ill COVID-19 patients | - IndiaSpend", "description": "", "url": "https://www.indiaspend.com/gram-negative-sepsis-drug-to-be-trialled-for-treating-critically-ill-covid-19-patients/", "urlToImage": "https://www.indiaspend.com/wp-content/uploads/2020/04/Drug-Trial_1200.jpg", "publishedAt": "2020-04-22T07:57:00Z", "content": "The Drugs Controller General of India has approved the trial of a drug developed for the treatment of critically-ill gram-negative sepsis patients, to evaluate if it can reduce mortality (deaths) in critically-ill COVID-19 patients.\r\nSepsivac has been develop… [+4528 chars]"}, {"source": {"id": null, "name": "Japantimes.co.jp"}, "author": "Internal Submission", "title": "Recovered, almost: China's early patients unable to shed coronavirus - The Japan Times", "description": "Dressed in a hazmat suit, two masks and a face shield, Du Mingjun knocked on the mahogany door of a flat in a suburban district of Wuhan on a recent mornin", "url": "https://www.japantimes.co.jp/news/2020/04/22/asia-pacific/china-early-patients-coronavirus/", "urlToImage": "https://cdn.japantimes.2xx.jp/wp-content/uploads/2020/04/np_file_8005-870x580.jpeg", "publishedAt": "2020-04-22T07:49:00Z", "content": "Wuhan, China – Dressed in a hazmat suit, two masks and a face shield, Du Mingjun knocked on the mahogany door of a flat in a suburban district of Wuhan on a recent morning.\r\nA man wearing a single mask opened the door a crack and, after Du introduced herself … [+7808 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Coronavirus may be aided by body's own immune response to enter more cells: Study - Deccan Herald", "description": "One of the human body's main defences against viral infections may be helping the novel coronavirus infect more cells, according to a study which can help understand why some people are more susceptible than others to COVID-19. The study, published in the jou…", "url": "https://www.deccanherald.com/science-and-environment/coronavirus-may-be-aided-by-bodys-own-immune-response-to-enter-more-cells-study-828412.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/04/22/covid-19-4922384_1920-1587541573.jpg", "publishedAt": "2020-04-22T07:46:13Z", "content": "One of the human body's main defences against viral infections may be helping the novel coronavirus infect more cells, according to a study which can help understand why some people are more susceptible than others to COVID-19.\r\nThe study, published in the jo… [+4002 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "Sfoorti Mishra | IANS", "title": "Delhi's First COVID-19 Survivor Shares His Harrowing Experience - The Weather Channel", "description": "The Delhi-based businessman adds that he wishes to donate his plasma for the treatment of other COVID-19 patients as soon as possible.", "url": "https://weather.com/en-IN/india/coronavirus/news/2020-04-22-delhi-first-covid-19-survivor-shares-harrowing-experience", "urlToImage": "https://s.w-x.co/in-patient.jpg", "publishedAt": "2020-04-22T06:54:56Z", "content": "(Xinhua/Wang Yuguo/IANS)\r\nThe first person in Delhi to defeat the novel coronavirus disease has opened up about his COVID-19 ordeal, while adding that he plans to donate his plasma for the treatment of other patients as soon as possible. \r\nThe Delhi-based bus… [+4615 chars]"}, {"source": {"id": null, "name": "Edexlive.com"}, "author": "Edex Live", "title": "Don't drink yourself sick this lockdown. Here's why - EdexLive", "description": "However, the increase in drinking might be fun pastime but is likely to have both short and long term impact on the health and safety of individuals.", "url": "https://www.edexlive.com/news/2020/apr/22/dont-drink-yourself-sick-this-lockdown-heres-why-11469.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2019/4/27/w600X390/Alcohol_Causes.jpg", "publishedAt": "2020-04-22T06:27:57Z", "content": "While it may be lucrative to leisurely consume alcohol in excess during the lockdown, your body and mind can feel the health impact of it more than you would like.\r\n\"Research studies have suggested that people in the age group of 18-40 years are buying more a… [+1453 chars]"}, {"source": {"id": null, "name": "Newshub.co.nz"}, "author": null, "title": "'COVID toes': The possible coronavirus symptom mostly seen in children - Newshub", "description": "\"This might be your first clue that they have COVID.\"", "url": "https://www.newshub.co.nz/home/world/2020/04/covid-toes-the-possible-coronavirus-symptom-mostly-seen-in-children.html", "urlToImage": "https://www.newshub.co.nz/home/world/2020/04/covid-toes-the-possible-coronavirus-symptom-mostly-seen-in-children/_jcr_content/par/image.dynimg.1280.q75.jpg/v1587532151259/GETTY_CHILD_FEET_1120.jpg", "publishedAt": "2020-04-22T05:10:23Z", "content": "Doctors have identified a possible new symptom of coronavirus which sees purple or blue lesions appear on the feet of otherwise asymptomatic patients.\r\nThe symptom, which has been dubbed 'COVID toe', was discovered in March by Italian doctors and is now being… [+835 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "US Will Have Second, 'Even More Difficult' Wave of Coronavirus: Health Official - News18", "description": "Center for Disease Control and Prevention Director Robert Redfield told T Washington Post that the US will have the epidemic and coronavirus epidemic at the same time.", "url": "https://www.news18.com/news/world/us-will-have-second-even-more-difficult-wave-of-coronavirus-health-official-2587555.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587145786_coronavirus-testing.jpg", "publishedAt": "2020-04-22T04:54:15Z", "content": "Washington: A second wave of the novel coronavirus will hit the US later this year with even more difficult ramifications than the current COVID-19 crisis that has claimed more than 45,000 lives and infected over 824,000 people in the country, a top American … [+2760 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "PTI", "title": "Pregnant women in hotspot districts nearing due date to undergo Covid-19 testing: ICMR - ThePrint", "description": "The ICMR said testing should be done in health facilities where the women are expected to deliver and samples should be collected and transferred to testing facilities.", "url": "https://theprint.in/health/pregnant-women-in-hotspot-districts-nearing-due-date-to-undergo-covid-19-testing-icmr/406399/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2019/02/04-21-2016Tetanus.jpg", "publishedAt": "2020-04-22T03:56:15Z", "content": "New Delhi: All pregnant women residing in cluster or containment areas from hotspot districts who present signs of labour or are likely to deliver in the next five days should be tested for COVID-19 even if asymptomatic, the ICMR said on Tuesday.\r\nAsymptomati… [+2057 chars]"}, {"source": {"id": null, "name": "Tribuneindia.com"}, "author": "Tribune India", "title": "Virus drug trial begins this week - The Tribune India", "description": "Project accorded approval by drugs controller | PGI one of the three testing sites", "url": "https://www.tribuneindia.com/news/nation/virus-drug-trial-begins-this-week-74407", "urlToImage": "https://cms.tribuneindia.com/gallary_content/2020/4/Desk/2020_4$largeimg_761102255.jpg", "publishedAt": "2020-04-22T03:25:06Z", "content": "Aditi TandonTribune News ServiceNew Delhi, April 21\r\nIndia will this week embark on its first drug trial against Covid-19 with the apex drug controller fast-tracking regulatory clearances today and granting the necessary approvals. The trial involves testing … [+2059 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Why are ventilators so important amid the COVID-19 pandemic? - CGTN", "description": "With the number of global COVID-19 cases topping 2.47 million and the death toll exceeding 170,000, ventilators are in great demand. But what is the significance of ventilators in treating COVID-19 patients?", "url": "https://news.cgtn.com/news/2020-04-22/Why-are-ventilators-so-important-amid-the-COVID-19-pandemic--PSiPiFPhmM/index.html", "urlToImage": "https://news.cgtn.com/news/30556a4e30597a4e7863444d77417a4e3063444f31457a6333566d54/img/9fa2a7ae5af74db5af4d3cfce47eec3b/9fa2a7ae5af74db5af4d3cfce47eec3b-1.jpg", "publishedAt": "2020-04-22T03:15:29Z", "content": "With the number of global COVID-19 cases topping 2.5 million and countries scrambling for medical supplies, ventilators are in great demand, and sometimes jurisdictions within one country are competing with each other for it.\r\nAccording to GlobalData, a data … [+9390 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Weight loss: 5 exercises that can help you burn 200 calories in less than 3 minutes - Times of India", "description": "You too can reap the benefit of this exciting new study by doing intense training for just 2.5 minutes in a day.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/fitness/weight-loss-5-exercises-that-can-help-you-burn-200-calories-in-less-than-3-minutes/photostory/75276479.cms", "urlToImage": "https://static.toiimg.com/photo/75276633.cms", "publishedAt": "2020-04-22T01:30:00Z", "content": "For the study, five healthy men were asked to perform sprint interval training on a stationary bike. They performed five 30 seconds of intense interval training, followed by one minute of easy cycling. In the end, it was found that although the men followed a… [+411 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "St. Luke's doctor: Life with the coronavirus is the new normal until a vaccine is made - KTVB", "description": "\"In terms of a vaccine, it's not until 2021, which means for the next year, we need to figure out how to live with COVID-19 being in our communities.\"", "url": "https://www.youtube.com/watch?v=eu5VKSpIlTc", "urlToImage": "https://i.ytimg.com/vi/eu5VKSpIlTc/hqdefault.jpg", "publishedAt": "2020-04-21T23:22:33Z", "content": "\"In terms of a vaccine, it's not until 2021, which means for the next year, we need to figure out how to live with COVID-19 being in our communities.\""}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Staying fit and healthy during the coronavirus, COVID-19 pandemic - NEWS CENTER Maine", "description": "Staying fit and healthy during the coronavirus, COVID-19 pandemic", "url": "https://www.youtube.com/watch?v=EyrHN2Ienc0", "urlToImage": "https://i.ytimg.com/vi/EyrHN2Ienc0/hqdefault.jpg", "publishedAt": "2020-04-21T22:16:46Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "COVID-19 Vaccines, Explained With Fruit - OPB", "description": "Even when the world is gripped by a pandemic, coming up with a vaccine is complicated and takes time. Here’s why. Subscribe to our channel for new OPB videos...", "url": "https://www.youtube.com/watch?v=x3zAmoa5PWE", "urlToImage": "https://i.ytimg.com/vi/x3zAmoa5PWE/maxresdefault.jpg", "publishedAt": "2020-04-21T19:55:35Z", "content": null}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Alistair MacDonald", "title": "For People With Autism, Lockdowns Shatter Routine, Heighten Anxiety - The Wall Street Journal", "description": "The coronavirus pandemic has disrupted the reliable pace and structure of life essential to many people with autism", "url": "https://www.wsj.com/articles/for-people-with-autism-lockdowns-shatter-routine-heighten-anxiety-11587480231", "urlToImage": "https://images.wsj.net/im-178623/social", "publishedAt": "2020-04-21T19:15:45Z", "content": "When Amy Belles first heard the coronavirus lockdown would close her sons school in Ohio, it felt like the moment 14 years ago when he was first diagnosed with autism. \r\nThe wave just hit me, a feeling of uncertainty, anxiety, and that youre dropped into this… [+82 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Excl: Carers asked to live in care homes for 'weeks' for no extra pay to tackle Covid-19 | ITV News - ITV News", "description": "Some carers are being asked to move into the care home they work in to help deal with cases of coronavirus, ITV News has learned. A form circulated by the pr...", "url": "https://www.youtube.com/watch?v=xP5YFP3XaQc", "urlToImage": "https://i.ytimg.com/vi/xP5YFP3XaQc/maxresdefault.jpg", "publishedAt": "2020-04-21T19:10:55Z", "content": null}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Christopher Carbone", "title": "Coronavirus lingered in woman's eyes long after it cleared from her nose, study reveals - Fox News", "description": "A 65-year-old woman who was Italy's first confirmed COVID-19 patient had detectable levels of infectious viral particles in her eyes, long after the infection had cleared from her nose, according to a new report on her case.", "url": "https://www.foxnews.com/science/coronavirus-lingered-womans-eyes-long-after-it-cleared-from-her-nose-study-reveals", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/04/AP20111219738441.jpg", "publishedAt": "2020-04-21T18:30:55Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nA 65-year-old woman who was Italy's first confirmed COVID-19 patient had detectable levels of infectious viral particles in her eyes, long after the infection had cl… [+1979 chars]"}, {"source": {"id": null, "name": "Nikkei.com"}, "author": "James Crabtree", "title": "Beware of over-hyping contact tracing apps in coronavirus fight - Nikkei Asian Review", "description": "Technology has to integrate with health services and protect civil liberties", "url": "https://asia.nikkei.com/Opinion/Beware-of-over-hyping-contact-tracing-apps-in-coronavirus-fight", "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fs3-ap-northeast-1.amazonaws.com%2Fpsh-ex-ftnikkei-3937bb4%2Fimages%2F2%2F4%2F7%2F9%2F26289742-3-eng-GB%2FCropped-1587461029N20200421%20TraceTogether%20Singapore.jpg?source=nar-cms&width=1024&height=512&fit=cover&gravity=faces", "publishedAt": "2020-04-21T18:00:00Z", "content": "James Crabtree is an associate professor in practice at the Lee Kuan Yew School of Public Policy at the National University of Singapore. He is author of \"The Billionaire Raj.\"\r\nAs countries begin to relax social distancing rules over the coming weeks, politi… [+5230 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Vaccines: Teachers of immune system, where is COVID-19 vaccine? - State Times", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiV2h0dHA6Ly9uZXdzLnN0YXRldGltZXMuaW4vdmFjY2luZXMtdGVhY2hlcnMtb2YtaW1tdW5lLXN5c3RlbS13aGVyZS1pcy1jb3ZpZC0xOS12YWNjaW5lL9IBAA?oc=5", "urlToImage": null, "publishedAt": "2020-04-21T17:42:36Z", "content": null}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Imogen Braddick", "title": "UK coronavirus death tolls jumps by more than 820 as new data shows total figure could be 41 per cent higher - Evening Standard", "description": "", "url": "https://www.standard.co.uk/news/uk/uk-coronavirus-death-toll-latest-828-a4420296.html", "urlToImage": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2020/04/20/11/Ambulance2004a.jpg", "publishedAt": "2020-04-21T17:18:00Z", "content": "The number of people who have died in hospital after testing positive for coronavirus in the UK has reached 17,337, up from 16,509 in 24 hours.\r\nThe difference between the Department of Health's daily hospital death tolls shows an increase of 828 fatalities, … [+14304 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Don't fast if infected by the virus - Times of Oman", "description": "Those who observe the Holy Month of Ramadan are expected to fast, unless they are infected with COVID-19.", "url": "https://www.youtube.com/watch?v=-nlMk2WX-a4", "urlToImage": "https://i.ytimg.com/vi/-nlMk2WX-a4/maxresdefault.jpg", "publishedAt": "2020-04-21T17:12:29Z", "content": "Those who observe the Holy Month of Ramadan are expected to fast, unless they are infected with COVID-19."}, {"source": {"id": null, "name": "Medicinenet.com"}, "author": null, "title": "Some COVID-19 Patients Stricken by Guillain-Barre Syndrome - MedicineNet", "description": "Studies are beginning to show that, in rare cases, people with severe COVID-19 may develop the serious nervous system disorder known as Guillain-Barre syndrome.", "url": "https://www.medicinenet.com/script/main/art.asp?articlekey=230602", "urlToImage": "https://images.medicinenet.com/images/facebook/medicinenet/fb-mnet-default.jpg", "publishedAt": "2020-04-21T17:04:06Z", "content": "By E.J. MundellHealthDay ReporterTUESDAY, April 21, 2020 (HealthDay News) -- Studies are beginning to show that, in rare cases, people with severe COVID-19 may develop the serious nervous system disorder known as Guillain-Barre syndrome.\r\n\"Guillain-Barre synd… [+3235 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Sheryl Sandberg on how Facebook is helping map Covid-19 - CNN Business", "description": "Facebook COO Sheryl Sandberg tells CNN's Poppy Harlow in a live interview about the company's global Covid-19 \"symptom map\" and how it's combating Covid-19 m...", "url": "https://www.youtube.com/watch?v=3uDyC0M5Uyg", "urlToImage": "https://i.ytimg.com/vi/3uDyC0M5Uyg/maxresdefault.jpg", "publishedAt": "2020-04-21T16:31:53Z", "content": null}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Shira Feder", "title": "Air conditioning spread the coronavirus to 10 people sitting near an infected person in a restaurant. It has h - Business Insider India", "description": "A research letter in Emerging Infectious Diseases journal showed 10 people got COVID-19 after going to a restaurant, likely because of the restaurant's air", "url": "https://www.businessinsider.in/science/news/air-conditioning-spread-the-coronavirus-to-10-people-sitting-near-an-infected-person-in-a-restaurant-it-has-huge-implications-for-the-service-industry-/articleshow/75278554.cms", "urlToImage": "https://www.businessinsider.in/photo/75278554/air-conditioning-spread-the-coronavirus-to-10-people-sitting-near-an-infected-person-in-a-restaurant-it-has-huge-implications-for-the-service-industry-.jpg?imgsize=3380311", "publishedAt": "2020-04-21T15:59:00Z", "content": "Three seemingly-healthy families were struck by COVID-19 in mid-January after dining on neighboring tables in a windowless restaurant in Guangzhou, China.\r\nNone of them had symptoms, but researchers studying the case believe one person had an asymptomatic cas… [+4975 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aaron Holmes", "title": "Explore coronavirus maps made from Facebook, Google, Apple user data - Business Insider - Business Insider", "description": "Apple, Google, and Facebook are collecting data on people's movement from smartphone apps and using it to show where people have reduced mobility.", "url": "https://www.businessinsider.com/explore-coronavirus-maps-made-from-facebook-google-apple-user-data-2020-4", "urlToImage": "https://i.insider.com/5e9ef9c66985256420603346?width=1200&format=jpeg", "publishedAt": "2020-04-21T14:43:50Z", "content": "Tech giants are joining the fight against coronavirus — and in the process, they're giving us a look under the hood at some of the user data they've been tracking all along.\r\nFacebook, Google, and Apple have all released maps and dashboards in recent weeks po… [+1302 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Debbie White", "title": "Wuhan doctors’ skin changes colour after coronavirus battle left them fighting for their lives - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11441792/wuhan-doctors-skin-after-coronavirus/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/04/tp-composite-wuhan-doctors-new.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-04-21T14:25:54Z", "content": "THE skin of two Chinese medics in Wuhan has turned substantially darker after suffering liver damage from severe coronavirus infections.\r\nDoctors Yi Fan and Hu Weifeng had beaten the killer bug after two months of treatment, but both have been left with chang… [+3652 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: WHO developing guidance on wet markets - BBC News", "description": "The World Health Organization calls for stricter safety and hygiene when wet markets reopen.", "url": "https://www.bbc.com/news/science-environment-52369878", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/123E7/production/_111872747_market_philippines.jpg", "publishedAt": "2020-04-21T13:14:23Z", "content": "Image copyrightGetty ImagesImage caption\r\n Wet market covered in plastic for social distancing\r\nThe World Health Organization (WHO) is calling for stricter safety and hygiene standards when wet markets reopen.\r\nAnd it says governments must rigorously enforce … [+3840 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "Skin of 2 Chinese doctors infected with COVID-19 turned dark: Report - India TV News", "description": "The skin of two Chinese doctors who were infected with coronavirus (COVID-19), turned dark after suffering liver damage from coronavirus infection, the media reported.", "url": "https://www.indiatvnews.com/news/world/skin-of-2-chinese-doctors-infected-with-covid-19-turned-dark-report-609877", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/04/capture-1587450941.jpg", "publishedAt": "2020-04-21T12:52:19Z", "content": "Image Source : APFile Image\r\nThe skin of two Chinese doctors who were infected with coronavirus (COVID-19), turned dark after suffering liver damage from coronavirus infection, the media reported. Dr Yi Fan and Dr Hu Weifeng were got infected with the deadly … [+1093 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "WHO: All evidence shows coronavirus likely originated in bats - CGTN", "description": "", "url": "https://news.cgtn.com/news/2020-04-21/WHO-All-evidence-show-coronavirus-likely-originated-in-bats-PSk0ko14Ry/index.html", "urlToImage": "https://news.cgtn.com/news/3d677a4d30456a4d3067544d79457a4e3063444f31457a6333566d54/img/08a3976c2dab4f0b89ba380db921cde9/08a3976c2dab4f0b89ba380db921cde9-1.png", "publishedAt": "2020-04-21T12:40:07Z", "content": "\"All available evidence suggests the virus has an animal origin and is not manipulated or constructed in a lab or somewhere else,\" WHO spokeswoman Fadela Chaib told a Geneva news briefing Tuesday. \r\nFadela Chaib refuted recent comments that the virus emanated… [+1242 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "COVID-19 likely came from an animal, not a lab: WHO - Sky News Australia", "description": "The World Health Organisation says it believes the devastating novel coronavirus COVID-19 originated from animal-to-human transmission and was not \"manipulat...", "url": "https://www.youtube.com/watch?v=uB7tl8FQzLo", "urlToImage": "https://i.ytimg.com/vi/uB7tl8FQzLo/maxresdefault.jpg", "publishedAt": "2020-04-21T12:34:31Z", "content": null}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Deaths at 20-year high but peak may be over - BBC News", "description": "Numbers dying nearly double above what would be expected, but peak may now be over, say experts.", "url": "https://www.bbc.com/news/health-52361519", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/A79C/production/_111780924_gettyimages-1218015796.jpg", "publishedAt": "2020-04-21T12:07:18Z", "content": "Image copyrightGetty Images\r\nDeaths in England and Wales have nearly doubled above what would be expected, hitting a 20-year high.\r\nThe Office for National Statistics said there were 18,500 deaths in the week up to 10 April - about 8,000 more than is normal a… [+4511 chars]"}, {"source": {"id": null, "name": "Unian.info"}, "author": null, "title": "Chinese scientists successfully conduct first animal trials of inactivated coronavirus vaccine - UNIAN", "description": "Collectively, the results suggest a path forward for clinical development of SARS-CoV-2 vaccines for use in humans.", "url": "https://www.unian.info/world/10966133-chinese-scientists-successfully-conduct-first-animal-trials-of-inactivated-coronavirus-vaccine.html", "urlToImage": "https://images.unian.net/photos/2019_07/thumb_files/1000_545_1563209432-3103.JPG?1", "publishedAt": "2020-04-21T11:00:00Z", "content": null}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "COVID-19 vaccine shown to be effective and safe on macaques: study - CGTN", "description": "", "url": "https://news.cgtn.com/news/2020-04-21/COVID-19-vaccine-shown-to-be-effective-and-safe-on-macaques-study-PS9coy3PNe/index.html", "urlToImage": "https://news.cgtn.com/news/35596a4d7767544e32596a4d30496a4e3063444f31457a6333566d54/img/c2d7d3566ce9423d8c6fd15ae70c28c0/c2d7d3566ce9423d8c6fd15ae70c28c0-1.jpeg", "publishedAt": "2020-04-21T10:53:34Z", "content": "A Chinese-led research group recently announced in a study that their newly-developed inactivated vaccines for COVID-19 are effective and safe on macaques and other non-human primates such as rats.  \r\nThe study, published last Sunday in bioRxiv, an open acces… [+2284 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Coronavirus COVID-19 has mutated into 30 strains, Chinese study finds - Zee News", "description": "A new study conducted by a team of Chinese researchers from Zhejiang University has claimed that the novel coronavirus COVID-19 has mutated into at least 30 different strains.", "url": "https://zeenews.india.com/coronavirus-covid-19-has-mutated-into-30-strains-chinese-study-finds-2278008.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2020/04/21/856112-856062-china-economy.gif", "publishedAt": "2020-04-21T10:50:59Z", "content": "A new study conducted by a team of Chinese researchers from Zhejiang University has claimed that the novel coronavirus COVID-19 has mutated into at least 30 different strains.\r\nThe researchers said that the ability of the coronavirus to mutate has been greatl… [+1715 chars]"}, {"source": {"id": null, "name": "Microbiozindia.com"}, "author": null, "title": "Chinese doctors might be infused with recently created COVID19 immunization by year-end:Health official - Microbioz India", "description": "China intends to injects its doctors with coronavirus vaccines before the year's over to ensure and set them up to manage any crisis circumstance because of the pandemic, while 11 new affirmed COVID-19 cases were accounted for in the nation without any passin…", "url": "https://microbiozindia.com/health-news/chinese-doctors-might-be-infused-with-recently-created-covid19-immunization-by-year-end-health-official/", "urlToImage": "https://microbiozindia.com/wp-content/uploads/2020/04/covid-19-4969674_640.jpg", "publishedAt": "2020-04-21T08:50:25Z", "content": "China intends to injects its doctors with coronavirus vaccines before the year’s over to ensure and set them up to manage any crisis circumstance because of the pandemic, while 11 new affirmed COVID-19 cases were accounted for in the nation without any passin… [+2971 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "PTI", "title": "China to inject medics with newly developed COVID-19 vaccine by year-end: Health official - Times Now", "description": "A Chinese health expert said recently that China could be hit by a second wave of coronavirus cases in November this year but by that time the country would be well prepared to deal with the disease.", "url": "https://www.timesnownews.com/health/article/china-to-inject-medics-with-newly-developed-covid-19-vaccine-by-year-end-health-official/580879", "urlToImage": "https://imgk.timesnownews.com/story/china-vaccine_1.gif?tr=w-560,h-292,fo-top", "publishedAt": "2020-04-21T08:39:53Z", "content": "Beijing: China plans to inject Chinese medics with coronavirus vaccines by year-end to protect them to deal with any emergency situation, while 11 new confirmed COVID-19 cases were reported in the country with no deaths due to the virus, health officials said… [+2713 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Chinese Medics May be Injected With a Coronavirus Vaccine by Year-end, Says Health Official - News18", "description": "China has approved three COVID-19 vaccine candidates for clinical trials.", "url": "https://www.news18.com/news/world/chinese-medics-may-be-injected-with-a-coronavirus-vaccine-by-year-end-says-health-official-2586129.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587038870_rtx7ddbj.jpg", "publishedAt": "2020-04-21T06:14:20Z", "content": "China plans to inject Chinese medics with coronavirus vaccines by year-end to protect them to deal with any emergency situation, while 11 new confirmed COVID-19 cases were reported in the country with no deaths due to the virus, health officials said.\r\nChina'… [+2704 chars]"}, {"source": {"id": null, "name": "Medium.com"}, "author": "MyHistoryFeed", "title": "Why We Should Be Hesitant On A COVID-19 Vaccine - Elemental", "description": "Vaccines have saved humanity from countless scourges, including measles, polio, and smallpox. But the method of manufacturing a secure, effective vaccine is necessarily painstaking, because the risk…", "url": "https://medium.com/@vincetran_28429/why-we-should-be-hesitant-on-a-covid-19-vaccine-70f1cb0a9ca0", "urlToImage": "https://miro.medium.com/max/1200/1*qjkGok8Kk1eovU9AGLm3tw.jpeg", "publishedAt": "2020-04-21T04:51:13Z", "content": "Vaccines have saved humanity from countless scourges, including measles, polio, and smallpox. But the method of manufacturing a secure, effective vaccine is necessarily painstaking, because the risk of harm is real.\r\nA viral disease spreads across the world, … [+4401 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Teena Thacker", "title": "No symptoms in 80% of Covid cases raise concerns - Economic Times", "description": "The new revelation of asymptomatic or mildly symptomatic infection in India has sparked concerns.", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/no-symptoms-in-80-of-covid-cases-raise-concerns/articleshow/75260387.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75262834,width-1070,height-580,imgsize-226823,overlay-economictimes/photo.jpg", "publishedAt": "2020-04-21T02:26:00Z", "content": "New Delhi: With mounting evidence that asymptomatic Covid-19 cases are spreading the infection, India’s top medical research body is grappling with the problem posed by “silent spreaders” and examining the feasibility of starting ‘door-to-door’ surveillance t… [+3810 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "John Teerlink, MD: Impact of COVID-19 on Clinical Trials - HCPLive", "description": "Professor of Medicine and Executive Committee Chair, COSMIC-HF and GALACTIC-HF discusses impact of COVID-19 on clinical trials.", "url": "https://www.youtube.com/watch?v=v1Q2T2-XyoE", "urlToImage": "https://i.ytimg.com/vi/v1Q2T2-XyoE/maxresdefault.jpg", "publishedAt": "2020-04-20T21:48:27Z", "content": "Professor of Medicine and Executive Committee Chair, COSMIC-HF and GALACTIC-HF discusses impact of COVID-19 on clinical trials."}, {"source": {"id": null, "name": "Kiis1065.com.au"}, "author": "Olivia Esveld", "title": "So It Turns Out We Might Be Able To Spread Coronavirus Through Our Farts - KIIS1065", "description": "When it comes to the coronavirus we all have a lot of questions. But by far the most unusual question we’ve heard yet, ‘Can you catch the coronavirus through farts?’ Yep actually, this is a legit thing that we should be considering and one doctor has actually…", "url": "https://www.kiis1065.com.au/lifestyle/health-beauty/so-it-turns-out-we-might-be-able-to-spread-coronavirus-through-our-farts/", "urlToImage": "https://www.kiis1065.com.au/wp-content/uploads/sites/2/2020/04/farting.jpg?crop=0px,65px,1200px,675px&resize=2400,1350&quality=75", "publishedAt": "2020-04-20T21:31:24Z", "content": "Yep actually, this is a legit thing that we should be considering and one doctor has actually taken it upon himself to answer it.\r\nAnd honestly, the answer might surprise you. You might even say that it could blow you away…\r\nPhysician Dr Norman Swan took on t… [+1609 chars]"}, {"source": {"id": null, "name": "Fox2detroit.com"}, "author": "FOX TV Digital Team", "title": "Facebook launches interactive COVID-19 map showing number of people reporting symptoms by county - FOX 2 Detroit", "description": "Facebook released an interactive COVID-19 map that shows how many people are reporting symptoms at the county level across the U.S.", "url": "https://www.fox2detroit.com/news/facebook-launches-interactive-covid-19-map-showing-number-of-people-reporting-symptoms-by-county", "urlToImage": "https://images.foxtv.com/static.fox2detroit.com/www.fox2detroit.com/content/uploads/2020/04/724/407/covid-19-map.jpg?ve=1&tl=1", "publishedAt": "2020-04-20T19:50:07Z", "content": "MENLO PARK, Calif. - Facebook launched an interactive map on Monday that shows how many people have reported experiencing COVID-19 symptoms by county, a tool that CEO Mark Zuckerberg said the platform is “uniquely suited” to run based on its billions of users… [+2365 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Cleaning Tips to Prevent Coronavirus - MLive", "description": "Professional tips on the proper way to use cleaning products to sanitize and disinfect your home from Dorine Berriel-Cass, Director of Infection Prevention a...", "url": "https://www.youtube.com/watch?v=tJ3yIGKb9i0", "urlToImage": "https://i.ytimg.com/vi/tJ3yIGKb9i0/hqdefault.jpg", "publishedAt": "2020-04-20T19:39:59Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Wuhan Coronavirus: More than 24 lakh infected | Gravitas - WION", "description": "More than 24 lakh people have been infected by the Wuhan coronavirus worldwide. In India, there are more than 14,000 active cases now. #Gravitas #Coronavirus...", "url": "https://www.youtube.com/watch?v=uexGUk4CGdQ", "urlToImage": "https://i.ytimg.com/vi/uexGUk4CGdQ/maxresdefault.jpg", "publishedAt": "2020-04-20T19:12:28Z", "content": "More than 24 lakh people have been infected by the Wuhan coronavirus worldwide. In India, there are more than 14,000 active cases now.\r\n#Gravitas#Coronavirus#Covid19#CoronavirusAlert#CoronavirusExplained#WION\r\nAbout Channel: \r\nWION -The World is One News, exa… [+1065 chars]"}, {"source": {"id": null, "name": "Futurism.com"}, "author": null, "title": "This Heatmap Shows Severity of COVID Outbreak in Every US County - Futurism", "description": "\"I think providing aggregate data to governments and health officials is one of the most important tools tech companies can provide to help respond to COVID.\"", "url": "https://futurism.com/neoscope/heatmap-severity-covid-outbreak-us-county", "urlToImage": "https://wp-assets.futurism.com/2020/04/facebook-mapped-us-countys-coronavirus-outbreak-768x403.jpg", "publishedAt": "2020-04-20T17:28:20Z", "content": "Facebook just launched a heatmap of the entire United States that illustrates the severity of the coronavirus outbreak within each individual county.\r\nThe map doesnt necessarily reflect the actual number of confirmed COVID-19 cases in each area that number th… [+1570 chars]"}]}