{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express News Service", "title": "Explained: How masks, gowns cause skin injuries among doctors, nurses - The Indian Express", "description": "The researchers identified three main types of PPE-related skin injuries: device-related pressure injuries; moist associated skin damage; skin tear.", "url": "https://indianexpress.com/article/explained/how-masks-gowns-cause-skin-injuries-among-doctors-nurses-6389540/", "urlToImage": "https://images.indianexpress.com/2020/05/ppe-kits.jpg?w=759", "publishedAt": "2020-05-02T04:48:35Z", "content": "Among them, 42.8% experienced serious skin injury related to use of PPE, the study found. (Express photo by Partha Paul)The personal protective equipment (PPE) that medical professionals wear while treating COVID-19 patients masks, goggles, face shields, and … [+1142 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Commuter 'fever check' and Princess Charlotte turns five - BBC News", "description": "Five things you need to know about the coronavirus outbreak this morning.", "url": "https://www.bbc.co.uk/news/uk-52511613", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/17884/production/_112088369_4abb81b7-7074-4fa4-84e9-c526648eecd5.jpg", "publishedAt": "2020-05-02T04:48:09Z", "content": "Here are five things you need to know about the coronavirus outbreak this Saturday morning. We'll have another update for you at 18:00 BST.\r\n1. US authorises use of Ebola drug remdesivir\r\nAn Ebola drug has been authorised for emergency use by the US's Food an… [+3629 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Infection control breaches revealed at coronavirus-hit Newmarch House - Sky News Australia", "description": "The New South Wales Chief Health Officer has revealed breaches in infection control practices at the coronavirus-hit Newmarch House in Sydney’s west. Dr Kerr...", "url": "https://www.youtube.com/watch?v=YU8E4mAYWnw", "urlToImage": "https://i.ytimg.com/vi/YU8E4mAYWnw/maxresdefault.jpg", "publishedAt": "2020-05-02T04:24:37Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Bruce Y. Lee", "title": "How Long Does COVID-19 Coronavirus Live On Clothes? How To Wash Them - Forbes", "description": "Here are the precautions to take for your clothes and your shoes during this SARS-CoV2 pandemic.", "url": "https://www.forbes.com/sites/brucelee/2020/05/01/how-long-does-covid-19-coronavirus-survive-on-clothes-how-to-wash-them/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1138578105%2F0x0.jpg", "publishedAt": "2020-05-02T04:01:29Z", "content": "Are there COVID-19 coronaviruses lurking in your laundry? (Photo: Getty)\r\nGetty\r\nAssuming that you wear clothes, you may have been wondering how long the COVID-19 coronavirus may stay on your various garments. After all, clothing is what typically keeps many … [+6498 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "AFP", "title": "Blood pressure medicines don't raise COVID-19 risk: Research - Deccan Herald", "description": "Commonly used blood pressure medicines do not heighten susceptibility to COVID-19 infection, or increase the risk of becoming seriously ill with the disease, three major studies said Friday, positive news for the millions of people who take them. The research…", "url": "https://www.deccanherald.com/science-and-environment/blood-pressure-medicines-dont-raise-covid-19-risk-research-832560.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/02/Tab-1588389474.jpg", "publishedAt": "2020-05-02T03:17:54Z", "content": "Commonly used blood pressure medicines do not heighten susceptibility to COVID-19 infection, or increase the risk of becoming seriously ill with the disease, three major studies said Friday, positive news for the millions of people who take them.\r\nThe researc… [+4050 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV News Desk", "title": "Italy reports 207,428 COVID-19 cases, cautious ahead of easing lockdown - India TV News", "description": "Amid the rising number of cases, the coronavirus pandemic has claimed 28,236 lives in locked-down Italy, bringing the total number of infections, fatalities, and recoveries to 207,428 on Friday.", "url": "https://www.indiatvnews.com/news/world/italy-coronavirus-pandemic-lockdown-death-toll-positive-cases-613310", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/05/vbk-coronavirus-chennai-pti-1588388572.jpg", "publishedAt": "2020-05-02T03:17:24Z", "content": "Image Source : PTI Italy reports 207,428 COVID-19 cases, cautious ahead of easing lockdown\r\nAmid the rising number of cases, the coronavirus pandemic has claimed 28,236 lives in locked-down Italy, bringing the total number of infections, fatalities, and recov… [+3014 chars]"}, {"source": {"id": null, "name": "Aninews.in"}, "author": null, "title": "Blood sugar control is key for people with diabetes and COVID-19 - ANI News", "description": "Washington D.C. [USA], May 2 (ANI): Novel study adds to the evidence that people with type 2 diabetes (T2D) are at greater risk of a poor outcome should they become infected with the virus that causes COVID-19. But there is some encouraging news: people with …", "url": "https://www.aninews.in/news/health/blood-sugar-control-is-key-for-people-with-diabetes-and-covid-1920200502082522", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/Insulin_16-3-20_mPeRMDc_SjrKOi2-thumbnail-154x87-70.jpg", "publishedAt": "2020-05-02T02:55:41Z", "content": "ANI | Updated: May 02, 2020 08:25 IST\r\nWashington D.C. [USA], May 2 (ANI): Novel study adds to the evidence that people with type 2 diabetes (T2D) are at greater risk of a poor outcome should they become infected with the virus that causes COVID-19. But there… [+2680 chars]"}, {"source": {"id": null, "name": "China.org.cn"}, "author": "崔灿", "title": "COVID-19 remains a public health emergency of int'l concern - China.org.cn", "description": null, "url": "http://www.china.org.cn/world/2020-05/02/content_76000602.htm", "urlToImage": null, "publishedAt": "2020-05-02T01:37:02Z", "content": "The World Health Organization (WHO) Director-General Tedros Adhanom Ghebreyesus said on Friday that the COVID-19 outbreak still constitutes a Public Health Emergency of International Concern (PHEIC).\r\n\"Of course, the COVID-19 pandemic remains a Public Health … [+1069 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Sheri Fink", "title": "Labs Across U.S. Join Federal Initiative to Study Coronavirus Genome - The New York Times", "description": "The project, announced by the C.D.C., will help trace patterns of transmission, investigate outbreaks and map how the virus is evolving, which can affect a cure.", "url": "https://www.nytimes.com/2020/04/30/science/coronavirus-genetic-sequencing.html", "urlToImage": "https://static01.nyt.com/images/2020/04/30/multimedia/30Virus-sequencing3/30Virus-sequencing3-facebookJumbo.jpg", "publishedAt": "2020-05-01T22:59:19Z", "content": "The Centers for Disease Control and Prevention on Thursday announced a national initiative to speed research into how the coronavirus was spreading around the country, bringing together at least 75 public health, academic and commercial institutions studying … [+4480 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: New York becomes Ground Zero again - BBC News", "description": "The city that never sleeps became the city that couldn't sleep, a place known for bravado gripped by fear.", "url": "https://www.bbc.com/news/world-us-canada-52495746", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/1486E/production/_112087048_sunset_nyc976getty.jpg", "publishedAt": "2020-05-01T21:54:00Z", "content": "Image copyrightGetty Images\r\nThe headlines seemed to be crowding in on us. The coronavirus had reached American shores. \r\nIt had come to the outer suburbs of New York. There were cases in the Bronx, Brooklyn, Queens and Manhattan.\r\nBy now, the news was coming… [+8774 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Bloomberg", "title": "A 102-year-old leaves Singapore hospital after fighting coronavirus - Livemint", "description": "A 107-year-old Dutch woman is seen as the oldest survivor of the outbreak", "url": "https://www.livemint.com/news/world/a-102-year-old-leaves-singapore-hospital-after-fighting-coronavirus-11588364350052.html", "urlToImage": "https://images.livemint.com/img/2020/05/01/600x338/2020-04-26T045546Z_331326398_RC24CG9GJWSD_RTRMADP_3_HEALTH-CORONAVIRUS-SINGAPORE-TEMP-HOSPITAL_1587896723459_1588364525133.JPG", "publishedAt": "2020-05-01T20:24:37Z", "content": "LOS ANGELES :\r\nA 102-year-old woman born during the Spanish flu pandemic was discharged from a Singapore hospital after battling coronavirus, joining the handful of centenarian survivors of the outbreak.The woman, who has five children, 11 grandchildren and 1… [+1091 chars]"}, {"source": {"id": null, "name": "Indianewengland.com"}, "author": null, "title": "COVID-19 vaccine may take at least 9 months: Bill Gates - India New England", "description": "San Francisco– While it appears that only a COVID-19 vaccine may take us back to normal, its development may take at least nine months to two years, billionaire philanthropist Bill Gates has …", "url": "https://indianewengland.com/2020/05/covid-19-vaccine-may-take-at-least-9-months-bill-gates/", "urlToImage": "https://indianewengland.com/wp-content/uploads/2019/09/modi-e1569519354477.png", "publishedAt": "2020-05-01T19:03:26Z", "content": "San Francisco– While it appears that only a COVID-19 vaccine may take us back to normal, its development may take at least nine months to two years, billionaire philanthropist Bill Gates has said.\r\nEven though several drugs are also being tested to treat COVI… [+2067 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "IANS", "title": "In US, coronavirus will be inescapable for at least 18-24 months: Report - Livemint", "description": "The coronavirus cases increased to 1,070,032 with over 63,000 deaths in the US, according to Johns Hopkins University.'Authorities should plan for the worst-case scenario, which involves a large second peak of cases in the fall of 2020,' says Minnesota-based …", "url": "https://www.livemint.com/news/world/in-us-coronavirus-will-be-inescapable-for-at-least-18-24-months-report-11588357292481.html", "urlToImage": "https://images.livemint.com/img/2020/05/01/600x338/931ee0ccd4f84a96bb44e0e854554180-931ee0ccd4f84a96bb44e0e854554180-1_1588357722191_1588357748343.jpg", "publishedAt": "2020-05-01T18:31:57Z", "content": "Washington: As the US battles the unabated rise of coronavirus cases as well as deaths, a new study from Minnesota-based Center for Infectious Disease Research and Policy (CIDRAP) has said that COVID-19 virus may well last 18 to 24 months, especially given th… [+3561 chars]"}, {"source": {"id": null, "name": "Kashmirtimes.com"}, "author": null, "title": "A Virus Untethered: Tracking a Journey from Caves to Cities - Kashmir Times", "description": "The novel coronavirus or SARS-CoV-2 has jumped from the bat-world to our cities, creating confusion and fear. As the situation escalates worldwide, it has become essential to trace the origin of the infection and find out how it travels between species in ord…", "url": "http://www.kashmirtimes.com/newsdet.aspx?q=101770", "urlToImage": null, "publishedAt": "2020-05-01T18:30:59Z", "content": "<ol><li>Home</li><li>Columnist</li></ol> By Dr. Deepak Bhardwaj. Dated: 5/1/2020 11:59:17 PM\r\nThe novel coronavirus or SARS-CoV-2 has jumped from the bat-world to our cities, creating confusion and fear. As the situation escalates worldwide, it has become ess… [+10548 chars]"}, {"source": {"id": null, "name": "Devdiscourse.com"}, "author": "Reuters", "title": "France's death toll from COVID-19 rises by 218 to 24,594 - Devdiscourse", "description": "Read more about France's death toll from COVID-19 rises by 218 to 24,594 on Devdiscourse", "url": "https://www.devdiscourse.com/article/health/1032852-frances-death-toll-from-covid-19-rises-by-218-to-24594", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/03_03_2020_18_59_34_5882013.jpg?width=920&format=jpeg", "publishedAt": "2020-05-01T18:26:46Z", "content": "The number of people who have died from coronavirus infection in France rose by 218 to 24,594 on Friday, while hospitalizations for the disease and people in ICU units continued to decline, France's public health chief said on Friday.\r\nJerome Salomon said the… [+1157 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "New York Times", "title": "Find a vaccine for coronavirus. Next: Produce 300 million vials of it - Economic Times", "description": "RNA or DNA vaccines might have different storage and refrigeration requirements because the technology has never been used for an approved vaccine before. The final vaccine might be packaged in ready-to-use glass syringes, which are commonly used in flu campa…", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/find-a-vaccine-next-produce-300-million-vials-of-it/articleshow/75497373.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75497368,width-1070,height-580,imgsize-102328,overlay-economictimes/photo.jpg", "publishedAt": "2020-05-01T18:24:00Z", "content": "By Knvul SheikhIn the midst of national shortages of testing swabs and protective gear, some medical suppliers and health policy experts are looking ahead to another extraordinary demand on manufacturing: Delivering a vaccine that could potentially end the pa… [+7547 chars]"}, {"source": {"id": null, "name": "Nationalheraldindia.com"}, "author": "IANS", "title": "New genes linked to severe childhood speech disorder discovered - National Herald", "description": "Researchers have discovered nine new genes linked to the most severe type of childhood speech disorder (CAS) -- apraxia, in which a child has difficulty making accurate movements when speaking.", "url": "https://www.nationalheraldindia.com/health/new-genes-linked-to-severe-childhood-speech-disorder-discovered", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2019-02%2F04f64b50-47eb-4a17-aea5-5119eb2dab90%2Fgenes.jpg?rect=0%2C72%2C1920%2C1008&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-05-01T18:19:38Z", "content": "The genetic variations were caused by spontaneously and not inherited from their parents, the study, published in the journal Neurology, said.\r\nAccording to the researchers, one in 1,000 children has apraxia, and despite intensive investigation, the genetic o… [+352 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Roni Caryn Rabin", "title": "What Is ‘Covid Toe’? Maybe a Strange Sign of Coronavirus Infection - The New York Times", "description": "Dermatologists say the lesions should prompt testing for the virus, even though many patients have no other symptoms.", "url": "https://www.nytimes.com/2020/05/01/health/coronavirus-covid-toe.html", "urlToImage": "https://static01.nyt.com/images/2020/04/30/science/30VIRUS-COVIDTOE/30VIRUS-COVIDTOE-facebookJumbo.jpg", "publishedAt": "2020-05-01T18:02:24Z", "content": "Before the coronavirus outbreak, Dr. Lindy Fox, a dermatologist in San Francisco, used to see four or five patients a year with chilblains painful red or purple lesions that typically emerge on fingers or toes in the winter.\r\nOver the past few weeks, she has … [+6949 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Samantha  Black, PhD, The Science Advisory Board staff writer", "title": "Cytokine storm may cause T-cell exhaustion in COVID-19 cases - The Science Board", "description": "Cytokine storms may impact the severity of COVID-19 cases by lowering T-cell populations, according to a study published in <em>Frontiers in Immunology</em> on May 1.", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=708", "urlToImage": "https://www.scienceboard.net/user/images/content_images/sup_imm/2020_05_01_15_44_4180_Antigen_Tcell_cytokines_400.jpg", "publishedAt": "2020-05-01T16:27:46Z", "content": "The immune response against virus-infected cells often requires activation of cytotoxic T cells to clear infection. Therefore, a boost in number and function of T cells -- a specialized type of white blood cell -- should help patients recover from COVID-19, t… [+3608 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "IANS", "title": "Not disinfecting your phones? Mobiles may be 'Trojan horses' for Covid-19 - Livemint", "description": "According to the researchers, community transmission could occur when an infected person touched their phone and then a pole on a bus which was grasped by an elderly person.Mobile devices were 'five-star hotels with premium heated spas, free buffet for microb…", "url": "https://www.livemint.com/technology/tech-news/not-disinfecting-your-phones-mobiles-may-be-trojan-horses-for-covid-19-11588337257574.html", "urlToImage": "https://images.livemint.com/img/2020/05/01/600x338/AFP_1Q05YA_1584596633859_1588350318937.jpg", "publishedAt": "2020-05-01T16:25:38Z", "content": "Sydney: Are you disinfecting your phone? If not, do it now. Mobile phones could be acting as 'Trojan horses' for coronavirus, warn researchers, urging billions of users worldwide to decontaminate their devices daily.While all the studies predate the current p… [+2895 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Aaron Holmes", "title": "Millions of people have used this app to log their COVID-19 symptoms — and data suggests the set of symptoms g - Business Insider India", "description": "Nearly 3.5 million people are using an app daily to report whether they're experiencing symptoms of COVID-19. The Covid Symptom Tracker app, built by researchers", "url": "https://www.businessinsider.in/tech/news/millions-of-people-have-used-this-app-to-log-their-covid-19-symptoms-and-data-suggests-the-set-of-symptoms-governments-initially-warned-about-was-too-narrow/articleshow/75495815.cms", "urlToImage": "https://www.businessinsider.in/photo/75495815/millions-of-people-have-used-this-app-to-log-their-covid-19-symptoms-and-data-suggests-the-set-of-symptoms-governments-initially-warned-about-was-too-narrow.jpg?imgsize=204048", "publishedAt": "2020-05-01T16:25:00Z", "content": "As governments prepare to lift COVID-19 lockdowns across the globe, real-time data from an app with millions of users could provide a critical tool to help policymakers understand the spread of the virus.\r\nNearly 3.5 million people have been using the Covid S… [+2166 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Why BAME people may be more at risk from coronavirus - Guardian News", "description": "NHS staff from black, Asian and minority ethnic backgrounds may be given roles away from the frontline under plans to reduce their disproportionately high de...", "url": "https://www.youtube.com/watch?v=XPF35H9RLNE", "urlToImage": "https://i.ytimg.com/vi/XPF35H9RLNE/maxresdefault.jpg", "publishedAt": "2020-05-01T15:28:47Z", "content": "NHS staff from black, Asian and minority ethnic backgrounds may be given roles away from the frontline under plans to reduce their disproportionately high death rate from Covid-19. The Guardian revealed last week that minority groups were over-represented by … [+436 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Trending Desk", "title": "Study Claims Meat-eaters Have Better Mental Health Than Vegetarians - News18", "description": "The scientists at the University of Alabama reviewed 18 studies with more than 160,000 people to examine the relationship between meat-eaters and their mental condition.", "url": "https://www.news18.com/news/lifestyle/study-claims-meat-eaters-have-better-mental-health-than-vegetarians-2601593.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2018/08/meat_AFP2.jpg", "publishedAt": "2020-05-01T14:46:37Z", "content": "A group of US-based researchers claims in a new study that meat consumers are less likely to be depressed when compared with vegetarians and vegans.\r\nThe scientists at the University of Alabama reviewed 18 studies with more than 160,000 people to examine the … [+1885 chars]"}, {"source": {"id": null, "name": "Medicinenet.com"}, "author": null, "title": "ECMO: Technology That Might Help COVID Patients When Ventilators Can't - MedicineNet", "description": "Many people who are seriously ill with COVID-19 end up on ventilators to help them breathe, but sometimes, even ventilators aren't enough. That's when a device called ECMO may help.", "url": "https://www.medicinenet.com/script/main/art.asp?articlekey=231035", "urlToImage": "https://images.medicinenet.com/images/facebook/medicinenet/fb-mnet-default.jpg", "publishedAt": "2020-05-01T14:30:47Z", "content": "By Serena GordonHealthDay ReporterFRIDAY, May 1, 2020 (HealthDay News) -- Many people who are seriously ill with COVID-19 end up on ventilators to help them breathe, but sometimes, even ventilators aren't enough. That's when a device called ECMO may help.\r\nEC… [+3661 chars]"}, {"source": {"id": null, "name": "Weforum.org"}, "author": "Sam Leakey, World Economic Forum", "title": "A leading COVID-19 vaccine scientist answers our questions - World Economic Forum", "description": "After warning of the risks of a global pandemic at Davos in 2019, Professor Robin Shattock shares insights on his effort to develop a vaccine against COVID-19.", "url": "https://www.weforum.org/agenda/2020/05/covid19-vaccine-researcher-questions/", "urlToImage": "https://assets.weforum.org/article/image/responsive_medium_18yDUxiZbizvaM49NP_wQ5Hdou0aFIePk4J4vjqs39k.jpg", "publishedAt": "2020-05-01T14:19:23Z", "content": "<ul><li>An innovative approach to COVID-19 vaccine development using RNA offers advantages in speed and scalability, if tests prove successful.</li><li>Although effective vaccines may be identified in 12 to 18 months, it could take significantly longer before… [+9613 chars]"}, {"source": {"id": null, "name": "Africanews.com"}, "author": null, "title": "Kenya coronavirus cases hit 411, Uhuru defends flower donation to UK - Africanews English", "description": "Kenya remains one of East Africa's most impacted countries after leader Mauritius. Government is enforcing a night-time curfew to curb spread of the virus.", "url": "http://www.africanews.com/2020/05/01/enforcement-of-coronavirus-lockdown-turns-violent-in-parts-of-africa/", "urlToImage": "https://static.euronews.com/articles/1061447/1024x538_1061447.jpg?1588340421", "publishedAt": "2020-05-01T13:49:42Z", "content": "May 1: Case count hits 411, Uhuru vows transparency \r\nThe case count has reached 411 as of May 1 after 15 new cases were recorded over the last 24-hours. Meanwhile recoveries have reached 150 according to data released today by the Ministry of Health.\r\nFatali… [+45607 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Scientists develop fast, sensitive antibody blood test for COVID-19 - The Financial Express", "description": "To help identify people with current or past exposure to SARS-CoV-2, the researchers, including those from Southern Medical University in China, wanted to develop a fast, sensitive antibody test.", "url": "https://www.financialexpress.com/lifestyle/health/scientists-develop-fast-sensitive-antibody-blood-test-for-covid-19/1945736/", "urlToImage": "https://images.financialexpress.com/2020/05/covid-19-blood-test.jpg", "publishedAt": "2020-05-01T13:09:38Z", "content": "Scientists have developed a quick, sensitive test for antibodies against the novel coronavirus in human blood that could help doctors track a person’s exposure to COVID-19, as well as confirm suspected cases that tested negative by other methods.\r\nBecause COV… [+2098 chars]"}, {"source": {"id": null, "name": "Contagionlive.com"}, "author": null, "title": "Study Suggests Men More Likely Than Women to Die of COVID-19 - Contagionlive.com", "description": "In a study of patients in China, investigators found most men were more likely than women to have severe cases of COVID-19, and more likely to die from the disease.", "url": "https://www.contagionlive.com/news/men-more-likely-than-women-to-die-of-covid-19", "urlToImage": "https://contagion.s3.amazonaws.com/_media/_thumb/covid-19-5.jpg", "publishedAt": "2020-05-01T13:09:20Z", "content": "Being elderly and having a weakened immune system have already been shown to be risk factors of more severe coronavirus disease 2019 (COVID-19), but new research suggests another risk factor might be gender.The study, published in Frontiers in Public Health, … [+2892 chars]"}, {"source": {"id": null, "name": "Thequint.com"}, "author": "William Petri", "title": "5 Questions on Asymptomatic COVID-19 Patients Answered - The Quint", "description": "Asymptomatic COVID-19 FAQs: A physician answers commonly asked questions on asymptomatic patients like how common it is to be asymptomatic or how contagious it is.", "url": "https://fit.thequint.com/coronavirus/5-questions-on-asymptomatic-covid-19-patients-answered", "urlToImage": "https://images.assettype.com/thequint-fit/2020-03/a2b8cd92-1c20-433a-8ad5-68dbb5351c0f/19031_pti18_03_2020_000105b.jpg", "publishedAt": "2020-05-01T12:50:15Z", "content": "No one knows for sure, and for the moment lots of the evidence is anecdotal.\r\nFor a small example, consider the nursing home in Washington\r\n where many residents became infected. Twenty-three tested positive. Ten of them were already sick. Ten more eventually… [+1055 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Hina Zahid", "title": "Smoking tobacco may increase lung entry points for COVID-19 virus - Medical Dialogues", "description": "Researchers at Baylor College of Medicine, the University of South Carolina and other institutions...", "url": "https://medicaldialogues.in/pulmonology/news/smoking-tobacco-may-increase-lung-entry-points-for-covid-19-virus-65361", "urlToImage": "https://medicaldialogues.in/h-upload/2020/04/24/1200x630_127780-lung.jpg?width=1200&height=630", "publishedAt": "2020-05-01T12:45:30Z", "content": "Researchers at Baylor College of Medicine, the University of South Carolina and other institutions have identified tobacco smoking as a potential risk factor for infection of the COVID-19 virus.The new study has been published in American Journal of Respirato… [+1920 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Livemint", "title": "What coronavirus research to trust? Rush to publish creates confusion - Livemint", "description": "Health-policy experts and a weary public are struggling to make sense of it all. .Early research released in the middle of a health crisis can result in more confusion than clarification", "url": "https://www.livemint.com/news/world/what-coronavirus-research-to-trust-rush-to-publish-creates-confusion-11588335651408.html", "urlToImage": "https://images.livemint.com/img/2020/05/01/600x338/virus1_1581012107602_1588336573833.jpg", "publishedAt": "2020-05-01T12:42:32Z", "content": "NEW YORK :\r\nOn April 22, researchers at Northwell Health, a major hospital system in the New York area, reported a stunning 88% death rate among Covid-19 patients on ventilators. The number was published in the prestigious Journal of the American Medical Asso… [+9375 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETtech", "title": "How AI steered doctors toward a possible Coronavirus treatment - ETtech.com", "description": "Many AI researchers and data scientists around the world have turned their attention to Covid-19, hoping they can accelerate efforts to understand how it is spreading, treat people who have it and find a vaccine.", "url": "https://tech.economictimes.indiatimes.com/news/technology/how-ai-steered-doctors-toward-a-possible-coronavirus-treatment/75491573", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-75491573,imgsize-254859,width-800,height-434,overlay-ettech/how-ai-steered-doctors-toward-a-possible-coronavirus-treatment.jpg", "publishedAt": "2020-05-01T12:27:00Z", "content": "By Cade MetzIn late January, researchers at BenevolentAI, an artificial intelligence startup in central London, turned their attention to the coronavirus.\r\nWithin two days, using technologies that can scour scientific literature related to the virus, they pin… [+6291 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Millions of children risk missing vaccines, says UN - BBC News", "description": "A huge backlog of shipments has built up in the coronavirus outbreak, the organisation warns.", "url": "https://www.bbc.co.uk/news/world-52503313", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/6B4B/production/_112076472_mediaitem112076469.jpg", "publishedAt": "2020-05-01T12:18:59Z", "content": "Image copyrightUnicef\r\nMillions of children risk missing \"life-saving\" vaccines, the UN has warned, after a \"massive backlog\" of shipments built up due to the coronavirus pandemic.\r\nThe outbreak has had a huge impact on the air industry, drastically reducing … [+2043 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Personal protective equipment used by COVID-19 medical staff may cause serious skin injuries: Study - Deccan Herald", "description": "More than 40 per cent of medical staff treating COVID-19-infected patients may experience serious skin injury related to the use of personal protective equipment such as masks, goggles, face shields, and protective gowns, according to a study. According to th…", "url": "https://www.deccanherald.com/international/personal-protective-equipment-used-by-covid-19-medical-staff-may-cause-serious-skin-injuries-study-832312.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/01/PPE-1588334755.jpg", "publishedAt": "2020-05-01T12:01:03Z", "content": "More than 40 per cent of medical staff treating COVID-19-infected patients may experience serious skin injury related to the use of personal protective equipment such as masks, goggles, face shields, and protective gowns, according to a study.\r\nAccording to t… [+3097 chars]"}, {"source": {"id": null, "name": "Gametransfers.com"}, "author": "macappsworld.com", "title": "The coronavirus vaccine can take two years for making it a full-fledged cure- sources from the lab - GameTransfers", "description": "As every part of the world is scrambling to get back on their feet, all the while trying to curtail the pandemic. It is an uphill task for the researchers and scientists to work out a cure so fast. It has to be effective enough to provide long term b", "url": "https://gametransfers.com/the-coronavirus-vaccine/", "urlToImage": "https://gametransfers.com/wp-content/uploads/2020/05/coronavirus-vaccine.jpg", "publishedAt": "2020-05-01T11:48:00Z", "content": "As every part of the world is scrambling to get back on their feet, all the while trying to curtail the pandemic. It is an uphill task for the researchers and scientists to work out a cure so fast. It has to be effective enough to provide long term benefits t… [+3756 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "AP", "title": "COVID-19 survivor urges: ‘To all of you: Continue to fight’ - The Indian Express", "description": "Before I slipped into the night, I automatically stayed awake a little longer to make sure I was still alive. And I was hoping that I would, please, wake up in the morning.", "url": "https://indianexpress.com/article/world/covid-19-survivor-urges-to-all-of-you-continue-to-fight-6388900/", "urlToImage": "https://images.indianexpress.com/2020/05/AP20121336819548.jpg?w=759", "publishedAt": "2020-05-01T10:55:19Z", "content": "By: AP | Belgium | \r\nPublished: May 1, 2020 4:19:17 pm\r\nIn this photo taken on Wednesday, April 29, 2020, Diane Wanten, 61, poses as she looks out of the window of the house of her son in Alken, Belgium. (AP Photo/Francisco Seco)Sucking in the little oxygen h… [+5284 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Testing not enough, scientists examine sewage to gauge spread of coronavirus - India Today", "description": "Scientists are turning to wastewater for an indication of how many people have been infected by the SARS-CoV-2 coronavirus. \"Sewage-based epidemiology is an indication of what may be missed by case-based surveillance,\" an expert said.", "url": "https://www.indiatoday.in/science/story/sewage-coronavirus-surveillance-1673298-2020-05-01", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/2020-04-04T111226Z_431468955_R_0-647x363.png?YjDHc2jnJtsn5g7TYHFMp7dYsnKe.SI2", "publishedAt": "2020-05-01T10:19:06Z", "content": "Given that most Indians are unlikely to be tested for Covid-19, scientists are taking a cue from the country's surveillance programme for polio and turning to sewage to get a clearer snapshot of how many people are infected with the coronavirus.\r\nWastewater e… [+6718 chars]"}, {"source": {"id": null, "name": "China.org.cn"}, "author": "", "title": "Sri Lanka's health minister warns of dengue virus as rains set in - China.org.cn", "description": null, "url": "http://www.china.org.cn/world/Off_the_Wire/2020-05/01/content_75999193.htm", "urlToImage": null, "publishedAt": "2020-05-01T09:56:37Z", "content": "COLOMBO, May 1 (Xinhua) -- Sri Lanka's Health Minister Pavithra Wanniarachchi Friday warned the public against a dengue outbreak due to expected monsoonal rains across the island country.\r\nThe government information department, in a statement quoting Wanniara… [+1292 chars]"}, {"source": {"id": null, "name": "Who.int"}, "author": "World Health Organization: WHO", "title": "Billions worldwide living with herpes - World Health Organization", "description": "<p>About half a billion people worldwide are living with genital herpes, and several billion have an oral herpes infection, new estimates show, highlighting the need to improve awareness and scale up services to prevent and treat herpes.</p><p>About 13% of th…", "url": "https://www.who.int/news-room/detail/01-05-2020-billions-worldwide-living-with-herpes", "urlToImage": "https://www.who.int/images/default-source/default-album/who-061228.tmb-1200v.jpg?sfvrsn=3444aa39_1", "publishedAt": "2020-05-01T08:04:28Z", "content": "About half a billion people worldwide are living with genital herpes, and several billion have an oral herpes infection, new estimates show, highlighting the need to improve awareness and scale up services to prevent and treat herpes.\r\nAbout 13% of the world’… [+2786 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Chinese firm ready to make 100 million Coronavirus vaccine doses if trials are successful - South China Morning Post", "description": "Subscribe to our YouTube channel for free here: https://sc.mp/subscribe-youtube A Chinese pharmaceutical company says its researchers are working day and nig...", "url": "https://www.youtube.com/watch?v=Pl5qf7uo_7U", "urlToImage": "https://i.ytimg.com/vi/Pl5qf7uo_7U/maxresdefault.jpg", "publishedAt": "2020-05-01T07:15:10Z", "content": null}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "French COVID-19 outbreak does not come directly from China: Study - CGTN", "description": "A genetic study done by French scientists revealed that the COVID-19 outbreak in France was caused by a locally circulating strain with unknown origin, rather than cases imported from China or Italy.", "url": "https://news.cgtn.com/news/2020-05-01/French-COVID-19-outbreak-does-not-come-directly-from-China-Study-Q8moXw6vNS/index.html", "urlToImage": "https://news.cgtn.com/news/3067544d794d6a4d316b7a4e3059444d7a67444f31457a6333566d54/img/27cbaf0d88f640bba9f1257bb96beac6/27cbaf0d88f640bba9f1257bb96beac6-1.jpg", "publishedAt": "2020-05-01T05:12:33Z", "content": "A genetic study done by French scientists revealed that the COVID-19 outbreak in France was caused by a locally circulating strain with unknown origin, rather than cases imported from China or Italy.\r\nThe pre-print study, entitled \"Introductions and early spr… [+2193 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: What promising clinical trials for Remdesivir mean for patients in Pittsburgh area - WPXI-TV News Pittsburgh", "description": "There is no cure for COVID-19, but an anti-viral drug – Remdesivir – is showing a lot of hope for some of the sickest of patients. https://bit.ly/3d3BFTP SUB...", "url": "https://www.youtube.com/watch?v=T9yAzKiGdUI", "urlToImage": "https://i.ytimg.com/vi/T9yAzKiGdUI/maxresdefault.jpg", "publishedAt": "2020-05-01T04:02:21Z", "content": "There is no cure for COVID-19, but an anti-viral drug Remdesivir is showing a lot of hope for some of the sickest of patients. https://bit.ly/3d3BFTP\r\nSUBSCRIBE: https://www.youtube.com/channel/UCBnn...\r\nABOUT WPXI 11 News:WPXI-TV is your source for breaking … [+416 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "France sees lowest weekday COVID-19 death toll increase since end March - Reuters India", "description": "The number of people who died of coronavirus infection in France increased by 289 or 1.2% to 24,376 on Thursday, the lowest increase on a weekday since end March, government data showed.", "url": "https://in.reuters.com/article/health-coronavirus-france-casualties-idINKBN22D4AO", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200501&t=2&i=1517111566&w=1200&r=LYNXMPEG402OA", "publishedAt": "2020-05-01T03:34:56Z", "content": "PARIS (Reuters) - The number of people who died of coronavirus infection in France increased by 289 or 1.2% to 24,376 on Thursday, the lowest increase on a weekday since end March, government data showed. \r\nOn Sunday, only 242 new deaths were reported, but on… [+1182 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Scientists regenerate neurons in mice with spinal cord injury and optic nerve damage - Science Daily", "description": "Each year thousands of patients face life-long losses in sensation and motor function from spinal cord injury and related conditions in which axons are badly damaged or severed. New research in mice shows, however, that gains in functional recovery from these…", "url": "https://www.sciencedaily.com/releases/2020/04/200430113041.htm", "urlToImage": null, "publishedAt": "2020-05-01T02:54:00Z", "content": "Like power lines in an electrical grid, long wiry projections that grow outward from neurons -- structures known as axons -- form interconnected communication networks that run from the brain to all parts of the body. But unlike an outage in a power line, whi… [+4129 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "US coronavirus outbreak soon to be deadlier than any flu since 1967 as deaths top 60,000 - firstshopp", "description": "US deaths from the novel coronavirus topped 60,000 on Wednesday and the outbreak will soon be deadlier than any flu season since 1967, according to a Reuters tally.America’s worst flu season …", "url": "https://www.indiatoday.in/world/story/us-coronavirus-outbreak-soon-to-be-deadlier-than-any-flu-since-1967-as-deaths-top-60-000-1672884-2020-04-30?utm_source=rss/", "urlToImage": "https://firstshopp.com/wp-content/uploads/2020/04/US-coronavirus-outbreak-soon-to-be-deadlier-than-any-flu.png", "publishedAt": "2020-04-30T23:53:33Z", "content": "US deaths from the novel coronavirus topped 60,000 on Wednesday and the outbreak will soon be deadlier than any flu season since 1967, according to a Reuters tally.\r\nAmerica’s worst flu season in recent years was in 2017-2018 when more than 61,000 people died… [+2123 chars]"}, {"source": {"id": null, "name": "Thelancet.com"}, "author": null, "title": "Safeguarding cancer care in a post-COVID-19 world - The Lancet", "description": "As the world comes to grips with the coronavirus disease 2019 (COVID-19) pandemic,\nreports are emerging on how cancer care is being deprioritised, delayed, and discontinued.\nThese decisions made under the duress of the pandemic will have grave consequences\nfo…", "url": "https://www.thelancet.com/journals/lanonc/article/PIIS1470-2045(20)30243-6/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/49dc1a41-30c4-42a1-9c2d-52d8854d3b9a/fx1.jpg", "publishedAt": "2020-04-30T23:43:53Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. By continuing you agree to the use of cookies.\r\nCopyright © 2020 Elsevier Inc. except certain content provided by third parties.\r\nPrivacy Policy   Terms and Conditions"}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "Sudhir Suryawanshi", "title": "INTERVIEW | COVID-19 vaccine will be kept affordable: Serum Institute of India CEO - The New Indian Express", "description": "Serum Institute of India is in an advanced stage of manufacturing a vaccine for COVID-19 in partnership with Oxford University, which is undergoing human trial.", "url": "https://www.newindianexpress.com/nation/2020/may/01/interview--covid-19-vaccine-will-be-kept-affordable-serum-institute-of-india-ceo-2137744.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2020/5/1/w600X390/ADAR-POONAWALA1.jpg", "publishedAt": "2020-04-30T21:49:00Z", "content": "Adar Poonawalla, CEO of Serum Institute of India, which is in an advanced stage of manufacturing a vaccine for COVID-19 in partnership with Oxford University, which is undergoing human trial, tells Sudhir Suryawanshi that production is being started so that t… [+1887 chars]"}, {"source": {"id": null, "name": "Medpagetoday.com"}, "author": "Molly Walker", "title": "HCQ, the Immune System, and COVID-19: Unanswered Questions - MedPage Today", "description": "Experts urge more research, not anecdotal data, prior to widespread use", "url": "https://www.medpagetoday.com/infectiousdisease/covid19/86246", "urlToImage": "https://clf1.medpagetoday.com/media/images/86xxx/86246.jpg", "publishedAt": "2020-04-30T21:30:10Z", "content": "Using hydroxychloroquine (HCQ) to treat COVID-19 has been surrounded by more hype than data, with too little known about how the virus affects the immune system, investigators said.\r\n\"[T]he known and potent immunomodulatory effects of [HCQ and its close cousi… [+4184 chars]"}, {"source": {"id": null, "name": "Boomlive.in"}, "author": "AFP", "title": "No, Aspirin Mixed With Lemon Juice And Honey Will Not Cure COVID-19 - BOOM", "description": "Facebook posts claim that aspirin, lemon juice and honey have been combined to make a home remedy...", "url": "https://www.boomlive.in/world/no-aspirin-mixed-with-lemon-juice-and-honey-will-not-cure-covid-19-7892", "urlToImage": "https://www.boomlive.in/h-upload/2020/04/30/920696-aspirin.jpg", "publishedAt": "2020-04-30T20:56:08Z", "content": "Multiple Facebook posts claim that aspirin, lemon juice and honey have been combined to make a \"home remedy\" for COVID-19 in Italy. The claim is misleading; the World Health Organization (WHO) has warned against self-medicating for COVID-19, saying there is n… [+1844 chars]"}, {"source": {"id": null, "name": "Pharmalive.com"}, "author": "Reuters Health", "title": "India exports 50 million hydroxychloroquine tablets to U.S. for COVID-19 fight: source - PharmaLive", "description": "India shipped 50 million tablets of hydroxychloroquine to the United States, an Indian source with direct knowledge of the exports said, although U.S. regulators warned the anti-malarial drug may have harmful side effects in the treatment of COVID-19.", "url": "https://www.pharmalive.com/india-exports-50-million-hydroxychloroquine-tablets-to-u-s-for-covid-19-fight-source/", "urlToImage": "https://www.pharmalive.com/wp-content/uploads/2020/04/India-exports-50-million-hydroxychloroquine-tablets-to-U.S.-for-COVID-19-fight-PER-source-REUTERS-4-30-20.jpeg", "publishedAt": "2020-04-30T16:10:35Z", "content": "NEW DELHI/AHMEDABAD (Reuters) – India has shipped 50 million tablets of hydroxychloroquine to the United States, an Indian source with direct knowledge of the exports said, although U.S. regulators warned the anti-malarial drug may have harmful side effects i… [+3017 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Graded opening of economy needed to protect livelihood, says Amitabh Kant - Economic Times", "description": "Possible Road Ahead: Hyper-localisation in Red areas with ruthless containment; 2.Physical distancing & Masks =New Fashion; 3.Virus can bounce back; 4. Look after 60+with Co-morbidity; 5.Vaccine still far away; 6.For livelihoods, economy should kickstart with…", "url": "https://economictimes.indiatimes.com/news/economy/policy/graded-opening-of-economy-needed-to-protect-livelihood-says-amitabh-kant/articleshow/75477101.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75477208,width-1070,height-580,imgsize-571063,overlay-economictimes/photo.jpg", "publishedAt": "2020-04-30T16:09:03Z", "content": "New Delhi: Advocating strict containment measures in 'red zones', Niti Aayog CEO Amitabh Kant on Thursday said the economy should kickstart with full supply chains to protect livelihood of people. The Centre on Wednesday gave clear indications that the ongoin… [+637 chars]"}, {"source": {"id": null, "name": "Greatandhra.com"}, "author": "GREATANDHRA BUREAU", "title": "Covid-19 May Not Go Away Even After A Vaccine.. - Greatandhra.com", "description": "The debates are going on about Covid-19 and the earliest possibility of getting a vaccine to combat it.", "url": "https://www.greatandhra.com/articles/special-articles/covid-19-may-not-go-away-even-after-a-vaccine-104368", "urlToImage": "https://www.greatandhra.com/newphotos7/Coronavirus-Vaccine1588260686.jpg", "publishedAt": "2020-04-30T15:31:26Z", "content": "The debates are going on about Covid-19 and the earliest possibility of getting a vaccine to combat it. But shockingly, some researchers are saying that the arrival of vaccine may not put a permanent end to the virus. \r\n\"Why the world has imposed lockdown? Is… [+1087 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Riya Baibhawi", "title": "COVID-19: Tigers tested for virus in US, photos break internet - Republic World - Republic World", "description": "Wildlife expert and photographer, Ron Magill shared photographs of samples being collected from tiger’s mouth, nose etc. for coronavirus", "url": "https://www.republicworld.com/entertainment-news/whats-viral/covid-19-tigers-tested-for-coronavirus-in-us-photographs-emerge.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/sjsv2woi5nxsvzzu_1588256316.jpeg?tr=f-jpeg", "publishedAt": "2020-04-30T14:42:54Z", "content": "After a tiger at New York's Bronx Zoo tested positive for COVID-19, scepticism arose about the animals contracting the virus. Amid all this, a series of photographs which show tiger being tested have caught everybody's attention. Taking to Twitter, Wildlife e… [+2067 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Zaini Majeed", "title": "Rare inflammatory syndrome seen in children who tested positive for COVID-19 - Republic World - Republic World", "description": "Earlier, Britain's NHS warned that there was a rise in inflammatory syndrome in children with the overlapping features of atypical Kawasaki disease.", "url": "https://www.republicworld.com/world-news/rest-of-the-world-news/inflammatory-disease-in-children-prompt-experts-to-study-covid-19-link.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/ajrlgjxd3y013evt_1588254007.jpeg?tr=f-jpeg", "publishedAt": "2020-04-30T13:52:00Z", "content": "Children in the United States, who tested positive for the novel coronavirus are experiencing a rare inflammatory disease of the heart and organs that could be linked with the COVID-19, the health experts reportedly said. The syndrome causes the patient to ex… [+2112 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Health check: How to cope with stress and anxiety during the pandemic - WFAA", "description": "For people who struggled with anxiety and depression before COVID-19, this can be an especially hard time. Health and wellness reporter Sonia Azad offers som...", "url": "https://www.youtube.com/watch?v=l48BiUk6Q3I", "urlToImage": "https://i.ytimg.com/vi/l48BiUk6Q3I/hqdefault.jpg", "publishedAt": "2020-04-30T13:37:33Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Should You Stop Having Ice-cream to Prevent Covid-19? This is What the Govt and WHO Say - News18", "description": "In another recent claim that coronavirus spread can be contained by avoiding ice-cream was doing rounds until it was rejected by the PIB.", "url": "https://www.news18.com/news/buzz/should-you-stop-having-ice-cream-to-prevent-covid-19-this-is-what-the-govt-and-who-say-2599899.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/03/You-dont-have-to-be-a-man-to-do-a-mans-jpb-1.jpg", "publishedAt": "2020-04-30T13:34:25Z", "content": "As the contagious coronavirus continues to spread around the world, fake health advise on social media has been seen to be on rise.\r\nAnother recent claim doing the rounds states that the coronavirus spread can be contained by avoiding ice-cream, until the PIB… [+1344 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Bloomberg", "title": "Dead coronavirus particles muddy the outcome of covid-19 patient's test result - Livemint", "description": "Coronavirus patients who remain positive weeks after diagnosis may harbor dead virus particles that can’t be distinguished from infectious ones in standard tests, say scientists", "url": "https://www.livemint.com/news/india/dead-coronavirus-particles-muddy-the-outcome-of-test-results-11588250764951.html", "urlToImage": "https://images.livemint.com/img/2020/04/30/600x338/9ab39872-5baf-11ea-9c69-d6eb4bacb74c_1583076698066_1588251088823.jpg", "publishedAt": "2020-04-30T12:56:44Z", "content": "Coronavirus patients who remain positive weeks after diagnosis may harbor dead virus particles that cant be distinguished from infectious ones in standard tests, scientists in South Korea found.The so-called SARS-CoV-2 virus dies one-to-two weeks after infect… [+3318 chars]"}, {"source": {"id": null, "name": "Biospectrumasia.com"}, "author": null, "title": "CEPI invests $3.5M in Clover Australia for COVID-19 vaccine - BSA bureau", "description": "This initial CEPI investment will support Clover Australia in its efforts to initiate a phase 1 clinical trial in Australia", "url": "https://www.biospectrumasia.com/news/37/15879/cepi-invests-3-5m-in-clover-australia-for-covid-19-vaccine.html", "urlToImage": "https://www.biospectrumasia.com/uploads/articles/shutterstock_hcq_1024x686-15879.jpg", "publishedAt": "2020-04-30T12:33:53Z", "content": "This initial CEPI investment will support Clover Australia in its efforts to initiate a phase 1 clinical trial in Australia\r\nNorway based CEPI, the Coalition for Epidemic Preparedness Innovations has announced a ninth worldwide collaboration to develop a COVI… [+2419 chars]"}, {"source": {"id": null, "name": "Dailyo.in"}, "author": null, "title": "Good news on Covid-19: Drugs, sunshine, vaccine aid in India's war with coronavirus - DailyO", "description": "The India story is looking good as compared to the rest of the world.", "url": "https://www.dailyo.in/variety/coronavirus-in-india-covid-19-hydroxychloroquine-indian-pharmaceuticals-covid-vaccine/story/1/32802.html", "urlToImage": "https://akm-img-a-in.tosshub.com/sites/dailyo/fb_feed_images/story_image/202004/fb_covid-swab-test_r_043020053949.jpg", "publishedAt": "2020-04-30T12:11:18Z", "content": "India emerges among the top in the fight against Covid-19 — from sunshine to the vaccine to the Covid-19 drug, we have it all right here in India.\r\nSome would say, it’s been a dreadful few weeks. Holed up in homes and worrying ourselves sick that the virus co… [+5155 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "The ventilator question: Why Covid-19 patients starve of oxygen - India Today", "description": "A study in China found that 53 per cent Covid-19 patients died of respiratory problems. In many cases, the patients were able to breathe mechanically but the body lacked oxygen.", "url": "https://www.indiatoday.in/coronavirus-outbreak/story/the-ventilator-question-why-covid-19-patients-starve-of-oxygen-1672908-2020-04-30", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202004/Coronavirus_Prague_ICU_AP-PTI-647x363.jpeg?E.abPyKQ_NSVi5_G3pkEtM6ZgpBGlITY", "publishedAt": "2020-04-30T11:48:50Z", "content": "Health experts and authorities maintain that only about 15 per cent of Covid-19 patients actually need hospitalization, treatment in ICU, oxygen supply for breathing or ventilator support. Around 1 out of every 6 people who gets COVID-19 becomes seriously ill… [+4068 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Hina Zahid", "title": "Men have double the death rate compared to women in COVID-19 infection - Medical Dialogues", "description": "It is established that elderly and those with certain pre-existing conditions appear to be at...", "url": "https://medicaldialogues.in/pulmonology/news/men-have-double-the-death-rate-compared-to-women-in-covid-19-infection-65329", "urlToImage": "https://medicaldialogues.in/h-upload/2020/04/11/1200x630_127064-coronavirus.jpg?width=1200&height=630", "publishedAt": "2020-04-30T11:30:16Z", "content": "It is established that elderly and those with certain pre-existing conditions appear to be at greater risk.\r\nAccording to a new study appearing in Frontiers in Public Health,Men are more than twice as likely to die of COVID-19 than women, regardless of age, \r… [+3294 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak: How a secretive organization helped China hoard PPE - Global News", "description": "Before alerting the public to the danger posed by the novel coronavirus, Beijing quietly began gathering personal protective equipment (PPE), such as N95 mas...", "url": "https://www.youtube.com/watch?v=VwTCRygJi9M", "urlToImage": "https://i.ytimg.com/vi/VwTCRygJi9M/maxresdefault.jpg", "publishedAt": "2020-04-30T11:00:15Z", "content": null}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Mohana Basu", "title": "CSIR to test sepsis drug in asymptomatic Covid patients and those who have recovered - ThePrint", "description": "CSIR will launch trials to see if sepsis drug can stop Covid-19 from progressing in asymptomatic patients & if it can prevent it from redeveloping in recovered patients.", "url": "https://theprint.in/health/csir-to-test-sepsis-drug-in-asymptomatic-covid-patients-and-those-who-have-recovered/411813/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/Bloodsmaples.jpg", "publishedAt": "2020-04-30T10:30:43Z", "content": "New Delhi: Scientists at the Council of Scientific and Industrial Research (CSIR)will launch two separate trials to test if a drug used to treat sepsis and liver cirrhosis can stop Covid-19 infection from progressing in asymptomatic patients and whether the s… [+3317 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "Smart contact lenses developed to diagnose, treat diabetes - Daily Pioneer", "description": "A team of researchers has developed wirelessly driven 'smart contact lens' technology that can detect diabetes and further treat diabetic retinopathy - a common visual health condition associated with the disease - just by wearing them.\n\nThe team from Pohang …", "url": "https://www.dailypioneer.com/2020/pioneer-health/smart-contact-lenses-developed-to-diagnose--treat-diabetes.html", "urlToImage": "https://www.dailypioneer.com/uploads/2020/story/images/big/smart-contact-lenses-developed-to-diagnose--treat-diabetes-2020-04-30.jpg", "publishedAt": "2020-04-30T09:44:32Z", "content": "A team of researchers has developed wirelessly driven 'smart contact lens' technology that can detect diabetes and further treat diabetic retinopathy - a common visual health condition associated with the disease - just by wearing them.\r\nThe team from Pohang … [+2136 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Lower Hygiene Levels, Higher Smoking Habits: Here's Why Men Fare Worse with Covid-19 Than Women - News18", "description": "In Italy, an analysis of more than 127,700 COVID-19 cases found that 52.9% of all infected people were men and 47.1% women. Among Italy’s first 14,860 deaths, almost 68% were men.", "url": "https://www.news18.com/news/buzz/lower-hygiene-levels-higher-smoking-habits-heres-why-men-fare-worse-with-covid-19-than-women-2599429.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587998950_women.jpg", "publishedAt": "2020-04-30T09:34:41Z", "content": "London: Death and infection tolls from the COVID-19 pandemic spreading around the world point to men being more likely than women to contract the disease and to suffer severe or critical complications if they do.\r\nHere are some insights from research and expe… [+2598 chars]"}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "Andrew Davis", "title": "Children Don’t Pass Covid-19 to Adults, Report Indicates - BloombergQuint", "description": "There doesn’t appear to be cases of a child passing Covid-19 to an adult, according to a new report.", "url": "https://www.bloombergquint.com/coronavirus-outbreak/children-don-t-pass-covid-19-to-adults-report-indicates", "urlToImage": "https://images.assettype.com/bloombergquint%2F2020-04%2F08d5ecc7-f8eb-48aa-b3f7-fe70af6a7664%2F361015659.jpg?rect=0%2C1344%2C9504%2C4990&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-04-30T09:32:38Z", "content": ""}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Jonathan Corum, Carl Zimmer", "title": "How Coronavirus Mutates and Spreads - The New York Times", "description": "The virus has mutated. But that doesn’t mean it’s getting deadlier.", "url": "https://www.nytimes.com/interactive/2020/04/30/science/coronavirus-mutations.html", "urlToImage": "https://static01.nyt.com/images/2020/04/29/us/coronavirus-mutations-promo-1588180690446/coronavirus-mutations-promo-1588180690446-facebookJumbo.jpg", "publishedAt": "2020-04-30T09:01:00Z", "content": "The coronavirus is an oily membrane packed with genetic instructions to make millions of copies of itself. The instructions are encoded in 30,000 letters of RNA a, c, g and u which the infected cell reads and translates into many kinds of virus proteins.\r\nRNA… [+19261 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "Goblet, ciliated cells in nose likely COVID-19 entry points - Express Healthcare", "description": "Identification of these cells by researchers involved in Human Cell Atlas Lung Biological Network could help explain high transmission rate of virus", "url": "https://www.expresshealthcare.in/news/goblet-ciliated-cells-in-nose-likely-covid-19-entry-points/419604/", "urlToImage": "https://cdn.expresshealthcare.in/wp-content/uploads/2020/03/04162320/GettyImages-1208623485-e1583319314816.jpg", "publishedAt": "2020-04-30T08:12:00Z", "content": "Identification of these cells by researchers involved in Human Cell Atlas Lung Biological Network could help explain high transmission rate of virus\r\nScientists, including experts at Newcastle University, have discovered that goblet and ciliated cells in the … [+4702 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": "SCI Knowledge Interlinks", "title": "IIT-G, Hester Biosciences to develop COVID-19 vaccine - BSI bureau", "description": "BioSpectrum is an integrated B2B media platform for the healthcare and bioscience industry in India and Asia.", "url": "https://www.biospectrumindia.com/", "urlToImage": "https://www.biospectrumindia.com/bundles/interlinksapp/app/app-asia/images/logo1.jpg", "publishedAt": "2020-04-30T07:30:01Z", "content": "Ashirwad Bungalow, First floor,36/A/2, S.No. 270, Pallod Farms, Near Bank of Baroda, Baner Road, Pune, Maharashtra, India 411045\r\nMob : +91-9579069369"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Max Nisen", "title": "What a second wave of Covid-19 could look like - ThePrint", "description": "One model of Covid-19’s future transmission dynamics suggests the size of outbreaks will vary drastically depending on seasonality and duration of people’s immunity.", "url": "https://theprint.in/health/what-a-second-wave-of-covid-19-could-look-like/411712/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/Test-.jpg", "publishedAt": "2020-04-30T06:43:59Z", "content": "The world is beginning to loosen restrictions that have been put in place to limit the spread of Covid-19. Leaders of countries, states and cities are finding they have little choice but to return to economic activity well before an effective vaccine or treat… [+6044 chars]"}]}