{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Timesnownews.com"}, "author": "Anushree Gupta", "title": "Placentas of pregnant women with COVID-19 show signs of maternal vascular damage, linked with adverse outcomes - Times Now", "description": "The study has found that the placenta of pregnant women with COVID-19 shows signs of maternal vascular damage, which is linked with various adverse outcomes during pregnancy like stillbirth, premature birth.", "url": "https://www.timesnownews.com/health/article/placenta-of-pregnant-women-with-covid-19-shows-sings-of-maternal-vascular-damage-linked-with-adverse-outcomes/591706", "urlToImage": "https://imgk.timesnownews.com/story/iStock-1217104402_1.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-14T06:25:38Z", "content": "<ul><li>Pregnant women have been placed in the high-risk category for complications due to coronavirus infection</li><li>The elderly, people with existing health conditions, smokers are also in this category</li><li>A study has found that the placenta of preg… [+1566 chars]"}, {"source": {"id": null, "name": "Thequint.com"}, "author": "Padmini Vaidyanathan", "title": "How Grief Can Affect Your Health - The Quint", "description": "Mental And Physical Health: Grief is usually thought to be an emotional experience, but it can be surprisingly physical too. Find out how grief affects our body and health, both physically and emotionally.", "url": "https://fit.thequint.com/coronavirus/how-can-grief-affect-your-mental-and-physical-health", "urlToImage": "https://images.assettype.com/thequint-fit/2020-05/503d2ef6-ad0c-42c3-be75-e6a2c92df086/Hero_Image_2.jpg", "publishedAt": "2020-05-14T05:38:13Z", "content": "Loss of a loved one, end of a relationship even a loss of job, can often leave us feeling without any control over our life or our future. This is anxiety and it is a normal part of grief. The panic and excessive worry can often lead to a loss of sleep, appet… [+411 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "R. Prasad", "title": "Nicotine may not prevent coronavirus infection, WHO cautions - The Hindu", "description": "A review of studies found that smokers are more likely to develop severe disease with COVID-19, compared to non-smokers, says a statement by the global health body", "url": "https://www.thehindu.com/sci-tech/health/nicotine-may-not-prevent-coronavirus-infection-who-cautions/article31579901.ece", "urlToImage": "https://www.thehindu.com/sci-tech/health/z3p2ax/article31579900.ece/ALTERNATES/LANDSCAPE_615/TH14WHO", "publishedAt": "2020-05-14T05:22:50Z", "content": "Urging researchers, scientists and the media to be cautious about amplifying unproven claims that tobacco or nicotine could reduce the risk of COVID-19, the World Health Organisation on May 11 issued a statement saying there is insufficient evidence to confir… [+3271 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Scroll Staff", "title": "Coronavirus ‘may never go away’, could become an endemic, says WHO - Scroll.in", "description": "Emergencies Director Michael Ryan pointed out that the HIV has not been eradicated but people have learnt to live with it.", "url": "https://scroll.in/latest/961890/coronavirus-may-never-go-away-could-become-an-endemic-says-who", "urlToImage": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/141304-xsbnnbbotd-1589432703.jpg", "publishedAt": "2020-05-14T05:14:00Z", "content": "The World Health Organization on Wednesday said the novel coronavirus may never go away and that people will have to learn to live with it. Covid-19, the disease caused by the coronavirus, has infected a total of 43.47 lakh people in the world and 2.97 lakh p… [+2693 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AFP", "title": "Coronavirus 'eminently capable' of spreading through speech: Study - Livemint", "description": "If the level of infectiousness of Covid-19 through speech can be confirmed, it could give a scientific boost to recommendations in many countries to wear a face mask.This will also help explain the coronavirus's rapid spread", "url": "https://www.livemint.com/news/world/coronavirus-eminently-capable-of-spreading-through-speech-study-11589428132206.html", "urlToImage": "https://images.livemint.com/img/2020/05/14/600x338/corona_1589428753668_1589428753877.PNG", "publishedAt": "2020-05-14T04:03:51Z", "content": "Microdroplets generated by speech can remain suspended in the air in an enclosed space for more than ten minutes, a study published Wednesday showed, underscoring their likely role in spreading COVID-19.Researchers at the National Institute of Diabetes and Di… [+1509 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV News Desk", "title": "WHO says COVID-19 pandemic may turn into endemic, warns against lifting restrictions - India TV News", "description": "Coronavirus may be here to stay. World Health Organisation Executive Director Michael J Ryan has said that the novel coronavirus that has infected over 4.3 million people worldwide might turn from a pandemic to an endemic.", "url": "https://www.indiatvnews.com/news/world/coronavirus-pandemic-may-turn-into-endemic-lifting-restrictions-covid-19-warning-617007", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/05/maxresdefault-1589425776.jpg", "publishedAt": "2020-05-14T03:25:27Z", "content": "Image Source : FILEWHO says COVID-19 pandemic may turn into endemic, warns against lifting restrictions\r\nCoronavirus may be here to stay. World Health Organisation Executive Director Michael J Ryan has said that the novel coronavirus that has infected over 4.… [+1166 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Dr. Kamal Kant Kohli", "title": "Researchers develop new safe version of Amphetamine for weight loss - Medical Dialogues", "description": "Researchers have developed a new version of popular weight Loss drug Amphetamine which is not only...", "url": "https://medicaldialogues.in/medicine/news/researchers-develop-new-safe-version-of-amphetamine-for-weight-loss-65744", "urlToImage": "https://medicaldialogues.in/h-upload/2020/02/29/124924-weight-loss.jpg", "publishedAt": "2020-05-14T03:19:37Z", "content": "Researchers have developed a new version of popular weight Loss drug Amphetamine which is not only effective but is safe. The new research has been published in the journal Cell Metabolism.\r\nThe PEGylated amphetamine has following advantages-\r\n1.PEGylated amp… [+6439 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "AP", "title": "Don't kiss your pets: Cats with no symptoms spread coronavirus to other cats in lab test - Deccan Herald", "description": "Cats can spread the new coronavirus to other cats without any of them ever having symptoms, a lab experiment suggests. Scientists who led the work, reported on Wednesday, say it shows the need for more research into whether the virus can spread from people to…", "url": "https://www.deccanherald.com/science-and-environment/dont-kiss-your-pets-cats-with-no-symptoms-spread-coronavirus-to-other-cats-in-lab-test-837399.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/14/iStock-1214907564-1589425922.jpg", "publishedAt": "2020-05-14T03:12:02Z", "content": "Cats can spread the new coronavirus to other cats without any of them ever having symptoms, a lab experiment suggests.\r\nScientists who led the work, reported on Wednesday, say it shows the need for more research into whether the virus can spread from people t… [+2676 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "UK, US children affected by rare disease connected to coronavirus - Northeast Now", "description": "Hundreds of children in the UK and US have been affected by a rare inflammatory disease linked to coronavirus. A number of children have also been diagnosed with the disease - which can cause symptoms similar to toxic shock syndrome - elsewhere in Europe, acc…", "url": "https://nenow.in/health/uk-us-children-affected-by-rare-disease-connected-to-coronavirus.html/", "urlToImage": "https://nenow.in/wp-content/uploads/2020/01/Story-1.jpg", "publishedAt": "2020-05-14T02:51:32Z", "content": "Hundreds of children in the UK and US have been affected by a rare inflammatory disease linked to coronavirus.\r\nA number of children have also been diagnosed with the disease which can cause symptoms similar to toxic shock syndrome elsewhere in Europe, accord… [+925 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus antibody test a 'positive development' - BBC News", "description": "A test to find out whether people have already had coronavirus is said to have serious potential.", "url": "https://www.bbc.co.uk/news/health-52656808", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/13640/production/_111842497_gettyimages-1209968955.jpg", "publishedAt": "2020-05-14T02:50:41Z", "content": "Image copyrightGetty Images\r\nA test to find out whether people have been infected with coronavirus in the past has been approved by health officials in England.\r\nPublic Health England said the antibody test, developed by Swiss pharmaceutical company Roche, wa… [+3117 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Coronavirus May Never Go Away, Warns WHO, Slams 'Magical' Thinking That Lockdowns Work Perfectly - News18", "description": "The world has a 'long, long way to go' to bring the coronavirus pandemic under control, despite tentative steps in many countries to begin restarting normal life, WHO's top emergencies expert warned.", "url": "https://www.news18.com/news/world/coronavirus-may-never-go-away-warns-who-slams-magical-thinking-that-lockdowns-work-perfectly-2619027.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/05/1588855059_2020-05-07t122149z_1_lynxmpeg460zu_rtroptp_4_health-coronvairus-syndrome-kids-1.jpg", "publishedAt": "2020-05-14T01:54:16Z", "content": "Mike Ryan, the head of the World Health Organization emergencies program, on Wednesday told reporters that the novel coronavirus may become \"another endemic virus in our communities. And this virus may never go away.\"\r\nThe world has a \"long, long way to go\" t… [+858 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Coronavirus may become endemic and never go away like HIV, warns WHO - India Today", "description": "More than half of humanity has been put under some form of lockdown since the coronavirus crisis began. WHO has said we have to accept the fact that coronavirus may become an endemic and never go away.", "url": "https://www.indiatoday.in/world/story/coronavirus-may-never-go-away-hiv-endemic-virus-covid19-who-michael-ryan-1677779-2020-05-14", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/india_coronavirus_pti_0-647x363.jpeg?Q0gq_9xbyAN8ZTXcZD9UMvrHeEz3XSwh", "publishedAt": "2020-05-14T01:07:52Z", "content": "Coronavirus may never go away and populations around the world will have to learn to live with it, the World Health Organization (WHO) warned Wednesday.\r\nMichael Ryan, director WHO health emergencies program, said that the coronavirus may become another endem… [+2629 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Explained Desk", "title": "Explained: Why it’s important to determine whether Covid-19 can spread through sewage - The Indian Express", "description": "Researchers have detected the coronavirus in the stool of both symptomatic and asymptomatic patients. This information has helped them identify the virus in untreated wastewater.", "url": "https://indianexpress.com/article/explained/coronavirus-transmission-through-sewage-wastewater-6408399/", "urlToImage": "https://images.indianexpress.com/2020/05/drain.jpg?w=759", "publishedAt": "2020-05-14T00:35:57Z", "content": "There is also no evidence yet to prove the virus can be transmitted through the faecal-oral route. (Source: Getty Images)Researchers in Australia are developing a technology to help track the transmission of the novel coronavirus through waterwater. The early… [+3447 chars]"}, {"source": {"id": null, "name": "News-medical.net"}, "author": null, "title": "Placentas of pregnant women with COVID-19 showed abnormalities - News-Medical.Net", "description": "A study conducted by researchers at Northwestern University, Chicago, has found that the placentas of pregnant women who were infected with severe acute respiratory syndrome coronavirus 2 (SARS-CoV2) showed abnormalities, compared with those of uninfected wom…", "url": "https://www.news-medical.net/news/20200513/Placentas-of-pregnant-women-with-COVID-19-showed-abnormalities.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2020%2f5%2fSARS2_d33968c101f84b4e88b61f55582bb1fc-620x480.jpg", "publishedAt": "2020-05-14T00:22:22Z", "content": "A study conducted by researchers at Northwestern University, Chicago, has found that the placentas of pregnant women who were infected with severe acute respiratory syndrome coronavirus 2 (SARS-CoV2) showed abnormalities, compared with those of uninfected wom… [+5937 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu Data Team", "title": "Data | Obesity linked to serious coronavirus illness even in younger patients, poor too are at high risk - The Hindu", "description": "Patients who were highly obese and were aged less than 60 years were 3.6 times more likely to be admitted to ICU than patients without obesity", "url": "https://www.thehindu.com/data/data-obesity-linked-to-serious-coronavirus-illness-even-in-younger-patients-poor-too-are-at-high-risk/article31578998.ece", "urlToImage": "https://www.thehindu.com/news/international/tw29kg/article31426301.ece/ALTERNATES/LANDSCAPE_615/SPAINKB", "publishedAt": "2020-05-13T22:27:03Z", "content": "Earlier studies from South Korea and China showed that the COVID-19 fatality rate increased significantly for older patients and those with pre-existing conditions. Recent studies from the U.S., the U.K. and France show that obesity is a risk factor, and that… [+3575 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Doctors say COVID-19 treatment is more likely to come before vaccine - WKBW TV | Buffalo, NY", "description": "The medical community has a lot of questions and not many answers when it comes to COVID-19. Doctors do not have treatments for the coronavirus as they do th...", "url": "https://www.youtube.com/watch?v=-nPIsiyBk5k", "urlToImage": "https://i.ytimg.com/vi/-nPIsiyBk5k/maxresdefault.jpg", "publishedAt": "2020-05-13T22:20:39Z", "content": "The medical community has a lot of questions and not many answers when it comes to COVID-19. Doctors do not have treatments for the coronavirus as they do the flu or the common cold."}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Helen Carter", "title": "Number of people who have died from coronavirus in UK increases by 494 - Manchester Evening News", "description": "The figures are released daily by the Department of Health and Social Care across all settings", "url": "https://www.manchestereveningnews.co.uk/news/uk-news/coronavirus-deaths-uk-rises-494-18244677", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/incoming/article18202782.ece/ALTERNATES/s1200/0_JS210758205.jpg", "publishedAt": "2020-05-13T19:03:10Z", "content": "The number of people who have died from coronavirus has increased by 494 to 33,186 people across all settings, according to the Department of Health and Social Care. \r\nIt was considerably lower (by 133 deaths) than Tuesday's tragic figure of 627 new deaths, a… [+2766 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "What is pulse oximeter and can it help in detecting Coronavirus infection? - Times of India", "description": "The reason being that it can measure the concentration of oxygen in the blood, which is believed to help in detecti", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/what-is-pulse-oximeter-and-can-it-help-in-detecting-coronavirus-infection/articleshow/75720966.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75720972,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-479146/75720972.jpg", "publishedAt": "2020-05-13T18:53:50Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Health commissioner gives update on COVID-19 cases, contact tracing in Virginia - WTVR CBS 6", "description": "Depend on WTVR.com and CBS 6 News for complete coverage of the COVID-19 outbreak.", "url": "https://www.youtube.com/watch?v=0YoRiTMDHtg", "urlToImage": "https://i.ytimg.com/vi/0YoRiTMDHtg/maxresdefault.jpg", "publishedAt": "2020-05-13T18:38:13Z", "content": null}, {"source": {"id": null, "name": "Wionews.com"}, "author": "WION Web Team", "title": "COVID-19 has now begun to show newer symptoms and syndromes - WION", "description": "The most obvious symptoms of the infection are classic respiratory symptoms -- fever, pneumonia and acute respiratory distress syndrome. But the virus also seems to attack some organs directly.", "url": "https://www.wionews.com/world/covid-19-has-now-begun-to-show-newer-symptoms-and-syndromes-298424", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/05/06/139454-corona-afp.jpg", "publishedAt": "2020-05-13T18:35:10Z", "content": "COVID-19 isn't just a respiratory disease that has been ravaging the entire world. It hits the whole body, according to recent findings.\r\nThe most obvious symptoms of the infection are classic respiratory symptoms -- fever, pneumonia and acute respiratory dis… [+2635 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/sophie-scott/167202", "title": "Experts worried people delaying medical tests due to coronavirus will create 'tidal wave' of diagnoses - ABC News", "description": "Advocates and doctors say the number of people attending specialist check-ups and calling an ambulance for chest pain has dropped dramatically since COVID-19 began, with possibly dire consequences.", "url": "https://www.abc.net.au/news/2020-05-14/coronavirus-medical-testing-delays-could-lead-to-future-sickness/12241812", "urlToImage": "https://www.abc.net.au/cm/rimage/12241840-16x9-large.jpg?v=4", "publishedAt": "2020-05-13T18:08:00Z", "content": "Australians are delaying lifesaving medical tests, as they heed the message to \"stay at home\" to prevent the spread of COVID-19.\r\nKey points:\r\n<ul><li>The Cancer Council says up to one in 10 Australians have put off cancer screening during the pandemic</li><l… [+5463 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Dale Smith", "title": "Coronavirus vaccine: When will it be ready? Everything we know so far - CNET", "description": "Scientists are racing to find a cure for the pandemic, and a new fast-tracking protocol could help speed up approval.", "url": "https://www.cnet.com/how-to/coronavirus-vaccine-when-will-it-be-ready-everything-we-know-so-far/", "urlToImage": "https://cnet3.cbsistatic.com/img/0IZ5MirMvXBtiDqEdSSrRimFIH8=/756x567/2020/05/13/1d434333-feb3-44ce-b91e-fbcb764f92da/gettyimages-1209302220.jpg", "publishedAt": "2020-05-13T17:03:42Z", "content": "Experts are hopeful that a vaccine against the SARS-CoV-2 virus will become available sooner rather than later.\r\nSOPA Images/Getty Images\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nAs the death toll f… [+8692 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Aria Bendix", "title": "Harvard and MIT researchers are developing a face mask that lights up when it detects the coronavirus - Business Insider India", "description": "For the last six years, bioengineers at MIT and Harvard have been developing sensors that can detect viruses like Zika and Ebola. They're adapting their technology", "url": "https://www.businessinsider.in/science/news/harvard-and-mit-researchers-are-developing-a-face-mask-that-lights-up-when-it-detects-the-coronavirus/articleshow/75723321.cms", "urlToImage": "https://www.businessinsider.in/photo/75723321/harvard-and-mit-researchers-are-developing-a-face-mask-that-lights-up-when-it-detects-the-coronavirus.jpg?imgsize=284262", "publishedAt": "2020-05-13T15:42:00Z", "content": "Pandemics were top of mind for Jim Collins years before the new coronavirus\r\n emerged.\r\nIn 2014, his bioengineering laboratory at MIT began developing sensors that could detect the Ebola virus when it was freeze-dried onto a piece of paper. The small team of … [+6273 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "University in Himachal to study Covid-19 drugs - Hindustan Times", "description": "It has been funded through High Performance Computing Consortium and the team is led by Gurjot Kaur, Associate Professor, School of Pharmaceutical Sciences of Shoolini University.", "url": "https://www.hindustantimes.com/education/university-in-himachal-to-study-covid-19-drugs/story-qrP66729zFiS82mqa1dE7M.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/13/Pictures/_e95f4e0a-952d-11ea-bea3-7211baa10040.jpg", "publishedAt": "2020-05-13T15:26:00Z", "content": "A team of scientists from a university in Himachal Pradesh has been offered a grant through Microsoft to conduct research on finding drugs to cure and prevent Covid-19.\r\nThis project will directly influence the anti-viral drug development.\r\nIt has been funded… [+756 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "AP", "title": "Wear a mask? Even with 20,000 dead, some New Yorkers don't - Deccan Herald", "description": "The outbreak of COVID-19 has adversely impacted the occupancy levels at hotels across 11 major cities, resulting in a decline of up to 29 per cent in revenue per available room (RevPAR) during January-March this year, according to JLL India. While occupancy l…", "url": "https://www.deccanherald.com/international/wear-a-mask-even-with-20000-dead-some-new-yorkers-dont-837273.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/13/file7ajrd7xeig6rh2ba11l-1589382065.jpg", "publishedAt": "2020-05-13T15:01:05Z", "content": "The outbreak of COVID-19 has adversely impacted the occupancy levels at hotels across 11 major cities, resulting in a decline of up to 29 per cent in revenue per available room (RevPAR) during January-March this year, according to JLL India.\r\nWhile occupancy … [+2426 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Caregiver must for those in self-isolation for coronavirus: West Bengal govt - India Today", "description": "The state health department in its orders said that the people who opt for home isolation should also submit an undertaking that self-isolation guidelines will be followed by them.", "url": "https://www.indiatoday.in/india/story/caregiver-must-for-those-in-self-isolation-for-coronavirus-west-bengal-govt-1677696-2020-05-13", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/quarantinr-centre-pti-647x363.jpeg?R3ftRKlyfl.eLeXNK0aWKqaRugqRGf3H", "publishedAt": "2020-05-13T14:42:03Z", "content": "West Bengal has made it mandatory for those with very mild symptoms of novel coronavirus or are pre-symptomatic or asymptomatic to have a caregiver during their self-isolation, officials said on Wednesday.\r\nThe state health department in its orders said that … [+2152 chars]"}, {"source": {"id": null, "name": "Devdiscourse.com"}, "author": "Reuters", "title": "WHO sees \"potentially positive data\" in treating coronavirus - Devdiscourse", "description": "Read more about WHO sees \"potentially positive data\" in treating coronavirus on Devdiscourse", "url": "https://www.devdiscourse.com/article/health/1049367-who-sees-potentially-positive-data-in-treating-coronavirus", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/26_04_2020_22_13_04_6363459.jpg?width=920&format=jpeg", "publishedAt": "2020-05-13T14:36:43Z", "content": "The World Health Organization said on Tuesday that some treatments appear to be limiting the severity or length of the COVID-19 disease, referring to the results of early studies of four or five treatments.\r\nThe Geneva-based WHO is leading a global initiative… [+4044 chars]"}, {"source": {"id": null, "name": "Indiaspend.com"}, "author": "Govindraj Ethiraj", "title": "'COVID Will Set Back India's TB Programme By A Decade' | - IndiaSpend", "description": "", "url": "https://www.indiaspend.com/covid-will-set-back-indias-tb-programme-by-a-decade/", "urlToImage": "https://www.indiaspend.com/wp-content/uploads/2020/05/MahukarPaiInterview_1440.jpg", "publishedAt": "2020-05-13T14:29:00Z", "content": "Mumbai: India will be lucky if it ends tuberculosis by 2035--a decade later than targeted--says Madhukar Pai, Canada Research Chair in epidemiology and global health and director of the McGill International TB Centre in Montreal, Canada, pointing to an 80% dr… [+34492 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "Sugary drinks up heart disease risk in women by 20 per cent: Study - India TV", "description": "The study, published in the JAHA: Journal of the American Heart Association, also found that who drink one or more sugary beverages Women who drink were at 21 per cent higher risk of suffering a stroke", "url": "https://www.indiatvnews.com/health/sugary-drinks-up-heart-disease-risk-in-women-by-20-per-cent-study-616922", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/05/pjimage-3-1589378562.jpg", "publishedAt": "2020-05-13T14:03:52Z", "content": "Image Source : PIXABAYSugary drinks up heart disease risk in women by 20 per cent: Study\r\nWomen who drink one or more sugary beverages a day are more than 20 per cent more likely to be diagnosed with cardiovascular disease, warn researchers.\r\nCompared to wome… [+2175 chars]"}, {"source": {"id": null, "name": "Inventiva.co.in"}, "author": "inventiva", "title": "Is There A Link Between Coronavirus And Vitamin D Deficiency? This Startup Just Raised Cash To Find Out - Inventiva", "description": "Solius’ light therapy kiosks use a narrow spectrum of ultraviolet light that can stimulate the production of critical hormones and peptides, and increase vita", "url": "https://www.inventiva.co.in/stories/inventiva/is-there-a-link-between-coronavirus-and-vitamin-d-deficiency-this-startup-just-raised-cash-to-find-out/", "urlToImage": "https://www.inventiva.co.in/wp-content/uploads/2020/05/vitamin-d.jpg", "publishedAt": "2020-05-13T14:00:00Z", "content": "Solius light therapy kiosks use a narrow spectrum of ultraviolet light that can stimulate the production of critical hormones and peptides, and increase vitamin D levels. (Solius Photo)\r\nNew research shows a potential correlation between severe vitamin D defi… [+3879 chars]"}, {"source": {"id": null, "name": "Thequint.com"}, "author": "Ahmed Ali Fayyaz", "title": "How COVID-19 Spread Across 3 Super Specialty Hospitals in Kashmir - The Quint", "description": "In Sher-e-Kashmir Institute of Medical Sciences, Bone and Joint Hospital and the Super Specialty Hospital (SSH) at Shireen Bagh COVID-19 cases and screening are on the rise.", "url": "https://www.thequint.com/news/india/kashmir-super-speciality-hospital-coronavirus-covid-19", "urlToImage": "https://images.assettype.com/thequint/2020-05/7446a0a3-9655-4472-9b07-92e734d1cec4/Hero_Image__15_.jpg", "publishedAt": "2020-05-13T13:41:07Z", "content": null}, {"source": {"id": null, "name": "Newsd.in"}, "author": "IANS", "title": "Kids with autism face higher eating disorders risk: Study - Newsd", "description": "London, May 13 (IANS) Children with autism face a greater risk of eating disorders, say researchers, adding that autistic traits in childhood come before behaviours characteristic of eating disorders, and so could be a risk factor for developing eating disord…", "url": "https://newsd.in/kids-with-autism-face-higher-eating-disorders-risk-study/", "urlToImage": "https://newsd.in/wp-content/uploads/2016/05/newsd-story-banner.jpg", "publishedAt": "2020-05-13T13:22:55Z", "content": "London, May 13 (IANS) Children with autism face a greater risk of eating disorders, say researchers, adding that autistic traits in childhood come before behaviours characteristic of eating disorders, and so could be a risk factor for developing eating disord… [+2355 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Doctors suggest having fruits could help keep coronavirus at bay - Economic Times", "description": "It is always better for Vegetarians or non-Vegetarians to have a lot of fresh fruit and vegetable .", "url": "https://economictimes.indiatimes.com/magazines/panache/doctors-suggest-having-fruits-could-help-keep-coronavirus-at-bay/articleshow/75714887.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75714944,width-1070,height-580,imgsize-322201,overlay-etpanache/photo.jpg", "publishedAt": "2020-05-13T12:45:57Z", "content": "BENGALURU: Are Vegans immune to COVID-19?\r\nThere is no proof at the moment, says prominent health expert and President of the Public Health Foundation of India, Professor K Srinath Reddy.\r\nEven Vegetarians have been affected because this is a virus which trav… [+3674 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Novel coronavirus may infect human intestines as well: Study - Deccan Herald", "description": "The SARS-CoV-2 virus that causes COVID-19 may be capable of infecting human intestinal tract, in addition to the respiratory system, according to a study. The study, published in the journal Nature Medicine, was conducted on human and bat organoids -- miniatu…", "url": "https://www.deccanherald.com/science-and-environment/novel-coronavirus-may-infect-human-intestines-as-well-study-837191.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/13/Bacteria-1589373462.jpg", "publishedAt": "2020-05-13T12:37:42Z", "content": "The SARS-CoV-2 virus that causes COVID-19 may be capable of infecting human intestinal tract, in addition to the respiratory system, according to a study.\r\nThe study, published in the journal Nature Medicine, was conducted on human and bat organoids -- miniat… [+1707 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Top U.S. Doctors Hope These Treatments Can Bridge The Gap To A Vaccine - Newsy", "description": "At least eight COVID-19 vaccines are in clinical development. Medical officials are hoping treatments could buy us time until one is available. Learn more ab...", "url": "https://www.youtube.com/watch?v=zDkZFtpi7Kw", "urlToImage": "https://i.ytimg.com/vi/zDkZFtpi7Kw/maxresdefault.jpg", "publishedAt": "2020-05-13T12:18:14Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus symptoms: The 7 lesser-known COVID-19 symptoms that everyone should be aware of - Times of India", "description": "Initially, lingering dry cough, fever, breathless and fatigue were believed to be the telltale symptoms of COVID-19, but as the disease continues to spread its fang across people of different age groups, newer symptoms are emerging. As we continue to learn mo…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-symptoms-the-7-lesser-known-covid-19-symptoms-that-everyone-should-be-aware-of/photostory/75717040.cms", "urlToImage": "https://static.toiimg.com/photo/75717371.cms", "publishedAt": "2020-05-13T11:41:49Z", "content": "While scientists and medical researchers are working at breakneck speed to develop avaccine for COVID-19, medical workers are still struggling to tabulate and an exhaustive list of novel coronavirus symptoms. As per the World Health Organization, most people … [+480 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Yasemin Saplakoglu", "title": "COVID-19 looks different in children, doctors say - Livescience.com", "description": "\"I think we better be careful [that] we are not cavalier in thinking that children are completely immune of the deleterious effects.\"", "url": "https://www.livescience.com/children-coronavirus-infections.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/3RdnhJWnPiksLpkoGte9e7-1200-80.jpg", "publishedAt": "2020-05-13T11:00:00Z", "content": "Since children make up only a sliver of known cases of the coronavirus\r\n causing COVID-19, not as much is known about the effects of the virus on this population. But more and more data, such as a new case report describing five children hospitalized with COV… [+4252 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Disease control strategies impact evolution of spreading viruses: Study - Telangana Today", "description": "New York: Disease control strategies employed by governments can dramatically alter the evolution of pathogens like the novel coronavirus, according to a study which says such measures can change the extent of symptoms a spreading virus causes in infected ind…", "url": "https://telanganatoday.com/disease-control-strategies-impact-evolution-of-spreading-viruses-study", "urlToImage": "https://cdn.telanganatoday.com/im/Telangana-Today-News.jpg", "publishedAt": "2020-05-13T10:45:30Z", "content": "New York: Disease control strategies employed by governments can dramatically alter the evolution of pathogens like the novel coronavirus, according to a study which says such measures can change the extent of symptoms a spreading virus causes in infected ind… [+5124 chars]"}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "All about ACE-2 — the molecule that helps novel coronavirus invade cells - Down To Earth Magazine", "description": "SARS-CoV-2 has a high-binding capacity for ACE2 &mdash;&nbsp;between 10 and 20 times more that of original SARS virus", "url": "https://www.downtoearth.org.in/news/science-technology/all-about-ace-2-the-molecule-that-helps-novel-coronavirus-invade-cells-71089", "urlToImage": "https://cdn.downtoearth.org.in/library/large/2020-05-13/0.97121400_1589361207_sars.jpg", "publishedAt": "2020-05-13T09:43:02Z", "content": "SARS-CoV-2 has a high-binding capacity for ACE2 — between 10 and 20 times more that of original SARS virusThe more we learn about the science behind COVID-19, the more we are beginning to understand the vital role a single molecule in our bodies plays in how … [+5859 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "ANI", "title": "Combination of fasting, vitamin C effective on hard-to-treat cancers, suggests study - Times Now", "description": "The researchers said that while fasting remains a challenging option for cancer patients, a safer, more feasible option is a low-calorie, plant-based diet that causes cells to respond as if the body is fasting.", "url": "https://www.timesnownews.com/health/article/combination-of-fasting-vitamin-c-effective-on-hard-to-treat-cancers-suggests-study/591313", "urlToImage": "https://imgk.timesnownews.com/story/iStock-993119894.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-13T09:29:25Z", "content": "California: A fasting-mimicking diet could be more effective at treating some types of cancer when combined with vitamin C, suggests a new study conducted by the scientists from USC and the IFOM Cancer Institute in Milan.\r\nIn studies on mice, researchers foun… [+4470 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "hindustantimes.com | Edited by: Amit Chaturvedi", "title": "Covid-19 more than a lung disease, it can lead to blood clots, say doctors - Hindustan Times", "description": "Clotting can develop in anyone who gets very sick and spends long periods of time immobile on a ventilator, but doctors say the problem seemed to show up sooner in Covid-19 patients.", "url": "https://www.hindustantimes.com/world-news/covid-19-more-than-a-lung-disease-it-can-lead-to-blood-clots-say-doctors/story-cnHbjebDCNJquRqG8q9dQN.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/13/Pictures/the-coronavirus-disease-covid-jakarta-outbreak-in_0ce0c042-94f3-11ea-84fe-62f09e00e282.jpg", "publishedAt": "2020-05-13T08:43:10Z", "content": "As the coronavirus disease spreads through the United States, the doctors are noticing something strange happening to patients’ blood.\r\nSigns of blood thickening and clotting were being detected in different organs by doctors from different specialties. This … [+1680 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Passive immunisation may slow down COVID-19 infection: Study - Telangana Today", "description": "Dubai: Researchers have revealed that passive vaccine or passive immunisation (PI) can provide instant, short-term fortification against infectious agents and slow down coronavirus (COVID-19). Passive immunisation is the term used when an antibody formed in o…", "url": "https://telanganatoday.com/passive-immunisation-may-slow-down-covid-19-infection-study", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2020/05/COVID-19-Coronavirus-testing-3.jpg", "publishedAt": "2020-05-13T07:34:18Z", "content": "Dubai: Researchers have revealed that passive vaccine or passive immunisation (PI) can provide instant, short-term fortification against infectious agents and slow down coronavirus (COVID-19).\r\nPassive immunisation is the term used when an antibody formed in … [+2796 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Anushree Gupta", "title": "Coronavirus and children: When to seek immediate medical help? Here are the symptoms to watch out for - Times Now", "description": "Recent studies have shown that the coronavirus infection does not spare children and young people, as previously thought. Know about the symptoms of COVID-19 in children, and when they need urgent medical help.", "url": "https://www.timesnownews.com/health/article/coronavirus-and-children-when-to-seek-immediate-medical-help-here-are-the-symptoms-to-watch-out-for/591208", "urlToImage": "https://imgk.timesnownews.com/story/iStock-1210753709_2.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-13T06:54:54Z", "content": "<ul><li>Recent studies have shown that children, and young adults are at high risk of complications and death due to COVID-19</li><li>A mysterious illness has also been affecting children from all around the world, and has a link to COVID-19</li><li>Here is a… [+3273 chars]"}, {"source": {"id": null, "name": "Channelnewsasia.com"}, "author": "Anjana Ahuja", "title": "Commentary: Infecting volunteers with COVID-19 may speed up vaccine development - CNA", "description": "The idea of intentionally infecting people in the quest for a vaccine is not alien to medical research, says Anjana Ahuja.", "url": "https://www.channelnewsasia.com/news/commentary/coronavirus-covid-19-vaccine-volunteer-test-medical-research-12727808", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12727812/16x9/991/557/16c3847e5842893576cdb3cc39a137ea/aA/more-than-100-labs-around-the-world-are-scrambling-to-come-up-with-a-vaccine-but-only-seven-are-currently-in-clinical-trials-1588218061238-2.jpg", "publishedAt": "2020-05-13T06:21:40Z", "content": "LONDON: Josh Morrison, a former corporate lawyer in New York, wants to be deliberately exposed to coronavirus. \r\nHe hit on the idea after reading a scientific paper suggesting that infecting volunteers could speed up vaccine development.\r\nAdvertisement\r\nAdver… [+3795 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Lucy Quaggin", "title": "COVID-19 stricken Chinese doctor whose skin changed colour is now returning to normal - 7NEWS.com.au", "description": "The doctor and his colleague say they experienced the strange side effect while they were being treated for the disease.", "url": "https://7news.com.au/travel/coronavirus/covid-19-stricken-chinese-doctor-whose-skin-changed-colour-is-now-returning-to-normal-c-1034763", "urlToImage": "https://images.7news.com.au/publication/C-1034763/83547be42177b860a2fe262722b3d517185db060-16x9-x0y0w1304h734.png?imwidth=1024", "publishedAt": "2020-05-13T06:16:54Z", "content": "A doctor whose skin turned a dramatically darker shade while he was sick with COVID-19 has finally started to see his original colour return.\r\nDr Yi Fan contracted the virus while working at the Wuhan Central Hospital back in January.\r\nHe woke up from life su… [+1158 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Qayam", "title": "COVID-19: Indian origin health staff abroad battle stress - The Siasat Daily", "description": "Mumbai: Medical professionals of Indian origin in the UK and USA are also battling emotional trauma and stress like their counterparts in India while taking care of COVID-19 patients and fighting the disease, which has spread to virtually every corner of the …", "url": "https://www.siasat.com/covid-19-indian-origin-health-staff-abroad-battle-stress-1888296/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/04/Coronavirus-COVID-19.jpg", "publishedAt": "2020-05-13T06:16:00Z", "content": "Mumbai: Medical professionals of Indian origin in the UK and USA are also battling emotional trauma and stress like their counterparts in India while taking care of COVID-19 patients and fighting the disease, which has spread to virtually every corner of the … [+4913 chars]"}, {"source": {"id": null, "name": "Theweek.in"}, "author": null, "title": "Cancer Patients Find Virtual Consultation a Boon in These Times of Crisis - THE WEEK", "description": "(This story has not been edited by THE WEEK and is auto-generated from a PTI", "url": "https://www.theweek.in/wire-updates/business/2020/05/13/pwr7-health-care-global-enterprises-ltd.--hcg.html", "urlToImage": "https://www.theweek.in/etc/designs/week/img/logo-main.png", "publishedAt": "2020-05-13T06:13:53Z", "content": "(Eds: Disclaimer: The following press release comes to you under an arrangement with Business Wire India. PTI takes no editorial responsibility for the same.)India Business Wire India \r\nHCG Cancer Hospital has enabled virtual consultation facility across its … [+6494 chars]"}, {"source": {"id": null, "name": "Sentinelassam.com"}, "author": "Sentinel Digital Desk", "title": "COVID-19 infection in kids may not start with a cough: Study- Sentinelassam - The Sentinel Assam", "description": "Gastrointestinal symptoms such as diarrhoea, coupled with a fever or history of exposure to", "url": "https://www.sentinelassam.com/top-headlines/covid-19-infection-in-kids-may-not-start-with-a-cough-study-472031", "urlToImage": "https://www.sentinelassam.com/h-upload/2020/05/13/125877-stuu.JPG", "publishedAt": "2020-05-13T03:00:04Z", "content": "BEIJING: Gastrointestinal symptoms such as diarrhoea, coupled with a fever or history of exposure to COVID-19, could indicate coronavirus infection in children, according to a new study.\r\nPublished in the journal 'Frontiers in Pediatrics', the research also s… [+2922 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "'Viruses are Tricky': WHO Sees Positive Potential in Covid-19 Treatments, But Dulls Hope of Vaccine - News18", "description": "\"We do have some treatments that seem to be in very early studies limiting the severity or the length of the illness but we do not have anything that can kill or stop the virus,\" spokeswoman Margaret Harris told a briefing.", "url": "https://www.news18.com/news/world/viruses-are-tricky-who-sees-positive-potential-in-covid-19-treatments-but-dulls-hope-of-vaccine-2617445.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/05/1588697675_remdesivir.jpg", "publishedAt": "2020-05-13T02:14:15Z", "content": "The World Health Organisation said on Tuesday that some treatments appear to be limiting the severity or length of the Covid-19 disease and that it was focusing on learning more about four or five of the most promising ones.\r\nThe Geneva-based WHO is leading a… [+1456 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "ANI", "title": "Insufficient sleep can lead to more asthma attacks in adults, says study - Zee News", "description": "The study adds solid evidence to the practice of asthma patients discussing sleep issues with their allergist to help determine if they need to change their asthma plan to achieve adequate sleep as a component of overall good asthma management.", "url": "https://zeenews.india.com/insufficient-sleep-can-lead-to-more-asthma-attacks-in-adults-says-study-2283011.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2020/05/12/860445-asthma.jpg", "publishedAt": "2020-05-12T19:29:27Z", "content": "California: A good night`s sleep is crucial to good health and can also be necessary for Asthma patients, suggests a new study. A new article in Annals of Allergy, Asthma and Immunology, the scientific journal of the American College of Allergy, Asthma, and I… [+2696 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Special Correspondent", "title": "Coronavirus | States asked to ramp up surveillance for Severe Acute Respiratory Infections or Influenza-like illnesses to detect hidden infections - Frontline", "description": "Aarogya Setu app made mandatory for returning NRIs and migrants.", "url": "https://www.thehindu.com/news/national/coronavirus-states-asked-to-ramp-up-surveillance-for-severe-acute-respiratory-infections-or-influenza-like-illnesses-to-detect-hidden-infections/article31569205.ece", "urlToImage": "https://www.thehindu.com/news/national/9c0qfi/article31569201.ece/ALTERNATES/LANDSCAPE_615/APTOPIXVIRUSOUTBREAKINDIA", "publishedAt": "2020-05-12T18:07:07Z", "content": "Expanding the ambit of the Aarogya Setu app, the Union Health Ministry on Tuesday directed that downloading it be made compulsory for all returnees (migrant labourers and those coming from abroad) for better contact surveillance and suitable medical intervent… [+4005 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Jenni Fink", "title": "Potential Coronavirus Treatments Are Promising But Can't 'Stop The Virus,' WHO Says - Newsweek", "description": "WHO's \"solidarity\" trial is testing four different potential treatments in more than 100 countries.", "url": "https://www.newsweek.com/potential-coronavirus-treatments-are-promising-cant-stop-virus-who-says-1503486", "urlToImage": "https://d.newsweek.com/en/full/1589280/coronavirus-treatments-improvements-who.jpg", "publishedAt": "2020-05-12T17:12:28Z", "content": "Early studies on treatments for a new coronavirus have shown promising signs but none of them are able to actually kill or stop the virus, according to the World Health Organization (WHO).\r\nWHO spokeswoman Margaret Harris told reporters during a Tuesday brief… [+2682 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Cong Asks PM to Take Action Against Gujarat Minister Chudasama, Expel Him From BJP - News18", "description": "Congress leader Kapil Sibal questioned the PM's silence on the issue and said if he was serious on ending corruption in the country he should take strict action against the minister from his home state.", "url": "https://www.news18.com/news/politics/cong-asks-pm-to-take-action-against-gujarat-minister-chudasama-expel-him-from-bjp-2617235.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/05/1589272306_bhupendrasinh-chudasama.jpg", "publishedAt": "2020-05-12T15:45:46Z", "content": "The Congress Tuesday asked Prime Minister Narendra Modi to expel Gujarat minister Bhupendrasinh Chudasama from the BJP after his 2017 election was declared void by the High Court on grounds of malpractice and manipulation.\r\nCongress leader Kapil Sibal questio… [+2884 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "All the Covid-19 symptoms you didn’t know about - Economic Times", "description": "Covid is now emerging as a pathogen capable of harming in a myriad of unexpected, and sometimes lethal, ways.", "url": "https://economictimes.indiatimes.com/news/science/all-the-covid-19-symptoms-you-didnt-know-about/articleshow/75688422.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75688496,width-1070,height-580,imgsize-97071,overlay-economictimes/photo.jpg", "publishedAt": "2020-05-12T15:41:00Z", "content": "By Jason Gale and Ari AltstedterAs the pandemic spreads around the world, doctors are beginning to scope the coronavirus’s damage. Seen initially as a cause of viral pneumonia during the chaos of an explosion of cases in China, it’s now emerging as an enigmat… [+4319 chars]"}, {"source": {"id": null, "name": "Kashmirobserver.net"}, "author": null, "title": "Children Face Greater Risk From COVID-19 Than Previously Thought: Study - Kashmir Observer", "description": "Children, teens, and young adults are at greater risk for severe complications from COVID-19 than previously thought, according to a study", "url": "https://kashmirobserver.net/2020/05/12/children-face-greater-risk-from-covid-19-than-previously-thought-study/", "urlToImage": "https://kashmirobserver.net/wp-content/uploads/2020/03/children-Coronavirus.jpg", "publishedAt": "2020-05-12T15:38:03Z", "content": "WhatsAppFacebook TwitterEmail9Shares\r\nNew York- Children, teens, and young adults are at greater risk for severe complications from COVID-19 than previously thought, according to a study which says those with underlying health conditions are at even greater r… [+3352 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "Explained: India’s new discharge policy for hospitalised COVID-19 patients - The News Minute", "description": "The Ministry of Health and Family Welfare (MoHFW) on Saturday released a revised policy on the discharge of patients hospitalised for COVID-19 infections. The revised guidelines state that only severe cases of COVID-19 will be tested before discharge, while m…", "url": "https://www.thenewsminute.com/article/explained-india-s-new-discharge-policy-hospitalised-covid-19-patients-124415", "urlToImage": "https://www.thenewsminute.com/sites/default/files/Chennai_PTI_Officials_Airport_0.jpg", "publishedAt": "2020-05-12T15:24:27Z", "content": "The revised guidelines state that only severe cases of COVID-19 will be tested before discharge, while mild and moderate cases need not be tested at the time of discharge.The Ministry of Health and Family Welfare (MoHFW) on Saturday released a revised policy … [+7525 chars]"}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "Brian Latham", "title": "Aids Deaths May Double in Africa Because of Covid-19 - BloombergQuint", "description": "Aids Deaths May Double in Africa Because of Covid-19", "url": "https://www.bloombergquint.com/onweb/africa-s-aids-deaths-may-double-if-virus-disrupts-drugs-supply", "urlToImage": "https://images.assettype.com/bloombergquint%2F2018-08%2F3a8e2237-2edb-4494-bcf2-231993fb6108%2FBLOOMBERG_LOGO.png?rect=0%2C56%2C1920%2C1008&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-05-12T14:47:46Z", "content": ""}, {"source": {"id": null, "name": "Navhindtimes.in"}, "author": "nt", "title": "Coronavirus vaccine may never be found, warns UK PM - The Navhind Times", "description": "London: British Prime Minister Boris Johnson has warned that a mass vaccine for the novel coronavirus may be over a year away and, in the worst-case scenario, may in fact never be found. In his forewo", "url": "http://www.navhindtimes.in/coronavirus-vaccine-may-never-be-found-warns-uk-pm/", "urlToImage": null, "publishedAt": "2020-05-12T14:38:04Z", "content": "London: British Prime Minister Boris Johnson has warned that a mass vaccine for the novel coronavirus may be over a year away and, in the worst-case scenario, may in fact never be found.\r\nIn his foreword to the governments new 50-page guidance on a step by st… [+3589 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Novel test can detect antibodies to SARS-CoV-2 in human blood - Telangana Today", "description": "New York: A new blood test may help identify individuals whose plasma contains antibodies to SARS-CoV-2 virus that causes COVID-19, and could potentially be used to treat other patients, scientists said on Tuesday. Tests that detect the presence of SARS-CoV-2…", "url": "https://telanganatoday.com/novel-test-can-detect-antibodies-to-sars-cov-2-in-human-blood", "urlToImage": "https://cdn.telanganatoday.com/im/Telangana-Today-News.jpg", "publishedAt": "2020-05-12T14:27:48Z", "content": "New York: A new blood test may help identify individuals whose plasma contains antibodies to SARS-CoV-2 virus that causes COVID-19, and could potentially be used to treat other patients, scientists said on Tuesday.\r\nTests that detect the presence of SARS-CoV-… [+1937 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Food to keep your heart healthy - Daijiworld.com", "description": "", "url": "https://www.daijiworld.com/news/newsDisplay.aspx?newsID=707451", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2020-05-12T14:05:21Z", "content": "New Delhi, May 12 (IANSlife): It has been proven that eating certain kinds of food every day can reduce the risk of developing cardiovascular disease.\r\n\"Eating food in its natural form as whole foods and unprocessed food is good for your body. Naturally occur… [+1610 chars]"}, {"source": {"id": null, "name": "Devdiscourse.com"}, "author": "PTI", "title": "US' CDC commits USD 3.6 million to India's COVID-19 fight - Devdiscourse", "description": "Read more about US' CDC commits USD 3.6 million to India's COVID-19 fight\n on Devdiscourse", "url": "https://www.devdiscourse.com/article/headlines/1047653-us-cdc-commits-usd-36-million-to-indias-covid-19-fight", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/25_06_2019_19_11_46_1465506.jpg?width=920&format=jpeg", "publishedAt": "2020-05-12T14:00:52Z", "content": "The US' Centres for Disease Control and Prevention (CDC) has committed USD 3.6 million to assist India's response to the COVID-19 pandemic and the aid will support prevention, preparedness and response activities. The funds will also be used to support the de… [+3421 chars]"}, {"source": {"id": null, "name": "Biospectrumasia.com"}, "author": null, "title": "FDA approves first CRISPR test for coronavirus detection - BSA bureau", "description": "Sherlock Biosciences's CRISPR SARS-CoV-2 Rapid Diagnostic kit with the detection time of 1 hour receives FDA Emergency Use Authorization in the United States", "url": "https://www.biospectrumasia.com/news/26/15927/fda-approves-first-crispr-test-for-coronavirus.html", "urlToImage": "https://www.biospectrumasia.com/uploads/articles/freepik2543655-15927.jpg", "publishedAt": "2020-05-12T13:19:08Z", "content": "Sherlock Biosciences's CRISPR SARS-CoV-2 Rapid Diagnostic kit with the detection time of 1 hour receives FDA Emergency Use Authorization in the United States\r\nUS based Sherlock Biosciences, an Engineering Biology company dedicated to making diagnostic testing… [+2467 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus pandemic | UK's COVID-19 death toll tops 38,000, worst in Europe - Moneycontrol", "description": "Figures published by the Office for National Statistics for England and Wales brought the United Kingdom's official death toll to 38,289 as of May 3 - up nearly 6,000 in the space of a week, according to a Reuters tally of death registrations data that also i…", "url": "https://www.moneycontrol.com/news/world/coronavirus-pandemic-uks-covid-19-death-toll-tops-38000-worst-in-europe-5256691.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/05/Europe-770x433.jpg", "publishedAt": "2020-05-12T12:58:02Z", "content": "The United Kingdom's COVID-19 death toll topped 38,000 as of early May, by far the worst yet reported in Europe, raising more questions about Prime Minister Boris Johnson's handling of the coronavirus crisis.\r\nFigures published by the Office for National Stat… [+4116 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "PTI", "title": "Covid-19 vaccine may never be found, says Boris Johnson - ThePrint", "description": "United Kingdom's Prime Minister Johnson admitted that a vaccine or drug-based treatment is the only feasible long-term solution.", "url": "https://theprint.in/world/covid-19-vaccine-may-never-be-found-says-boris-johnson/419875/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2019/08/Boris-Johnson.jpg", "publishedAt": "2020-05-12T12:37:17Z", "content": "London: British Prime Minister Boris Johnson, a COVID-19 survivor, has warned that a mass vaccine for the highly contagious disease may be over a year away and may in fact never be found.\r\nIn his foreword to the government’s new 50-page guidance on a step by … [+4265 chars]"}, {"source": {"id": null, "name": "Docwirenews.com"}, "author": null, "title": "Hydroxychloroquine Does Not Improve Mortality in COVID-19 Patients in Study, Again - DocWire News", "description": "Another study has come out rejecting the notion that hydroxychloroquine is a useful drug to treat COVID-19, alone or in combination with azithromycin.", "url": "https://www.docwirenews.com/docwire-pick/rheumatology-picks/hydroxychloroquine-does-not-improve-mortality-in-covid-19-patients-in-study-again/", "urlToImage": "https://www.docwirenews.com/wp-content/uploads/2020/03/Homepage_3.13.20.jpg", "publishedAt": "2020-05-12T12:24:00Z", "content": "Hydroxychloroquine, a drug prescribed to treat rheumatoid arthritis and lupus, has been touted as a possible treatment for COVID-19, leading to an influx of studies on the subject as well as nationwide shortages of the drug. However, another study has come ou… [+3573 chars]"}, {"source": {"id": null, "name": "Thequint.com"}, "author": "Vaishali Sood", "title": "‘It’s Time to Exit the Lockdown,’ Says Dr K Srinath Reddy - The Quint", "description": "COVID-19 in India: Dr K Srinath Reddy also spoke about how, “we should not shy away as a nation from facing the possibility of a community transmission.” He also mentioned that herd immunity cannot possibly be a public health strategy.", "url": "https://fit.thequint.com/coronavirus/covid-19-india-its-time-to-exit-the-lockdown-says-dr-k-srinath-reddy", "urlToImage": "https://images.assettype.com/thequint-fit/2020-05/6eab3b37-015d-4e83-bff2-bcb8df16a05e/Hero_Image_2.jpg", "publishedAt": "2020-05-12T11:53:23Z", "content": "There is a lot of misunderstanding about what herd immunity is. Firstly it depends a lot upon the R Nought or R0 (rate of transmission). And the more the R0, the greater the immunity threshold. If you take polio and smallpox, the R0 was 5-7. And the herd immu… [+1383 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "PTI", "title": "New AI tool to predict COVID-19 without testing: Study - Yahoo India News", "description": "London, May 12 (PTI) Researchers have developed an AI tool to predict whether someone is likely to have COVID-19 based on their symptoms alone, an advance which they say can help make better estimates of the disease spread in areas with limited testing.", "url": "https://in.news.yahoo.com/ai-tool-predict-covid-19-114453981.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-05-12T11:44:00Z", "content": "London, May 12 (PTI) Researchers have developed an AI tool to predict whether someone is likely to have COVID-19 based on their symptoms alone, an advance which they say can help make better estimates of the disease spread in areas with limited testing.\r\nThe … [+3356 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Smoking, COPD linked with higher death risk from COVID-19: Study - Deccan Herald", "description": "Being a current smoker or having chronic obstructive pulmonary disease (COPD) are associated with an increased risk of severe complications and higher death risk from COVID-19 infection, according to a study. COPD is a common, persistent dysfunction of the lu…", "url": "https://www.deccanherald.com/science-and-environment/smoking-copd-linked-with-higher-death-risk-from-covid-19-study-836752.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/12/iStock-511377626-1589281755.jpg", "publishedAt": "2020-05-12T11:09:15Z", "content": "Being a current smoker or having chronic obstructive pulmonary disease (COPD) are associated with an increased risk of severe complications and higher death risk from COVID-19 infection, according to a study.\r\nCOPD is a common, persistent dysfunction of the l… [+1849 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Aanchal Nigam", "title": "Study: Animals follow social distancing to prevent contraction of microbes - Republic World - Republic World", "description": "A new study by UTSA researchers has revealed that animals have long followed social distancing rules when it comes to microorganisms found in their gut.", "url": "https://www.republicworld.com/world-news/rest-of-the-world-news/study-animals-follow-social-distancing-to-prevent-contraction.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/foc6flkfmqaercpu_1589280326.jpeg?tr=f-jpeg", "publishedAt": "2020-05-12T11:08:18Z", "content": "Amid the unprecedented outbreak of deadly coronavirus, maintaining social distance has been one of the most touted methods to prevent the contraction of COVID-19 disease. While lockdowns have been imposed across the world, a new study has revealed that animal… [+2246 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express News Service", "title": "Explained: What data from 20 countries show on Covid-19’s Vitamin D link - The Indian Express", "description": "The new study shows that Italy and Spain, both of which have experienced high Covid-19 mortality rates, have lower average vitamin D levels than most northern European countries.", "url": "https://indianexpress.com/article/explained/covids-vitamin-d-link-what-data-from-20-countries-show-6403603/", "urlToImage": "https://images.indianexpress.com/2020/05/vitamin-D-test.jpg?w=759", "publishedAt": "2020-05-12T08:20:03Z", "content": "Vitamin D is known to modulate the response of white blood cells (Source: Getty Images)A new study has found an association between low average levels of vitamin D and high numbers of Covid-19 cases and mortality rates across 20 European countries. The resear… [+2497 chars]"}]}