{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "AP", "title": "Many failures combined to unleash death on Italy's Lombardy - The Hindu", "description": "As Italy prepares to emerge from the West’s first and most extensive coronavirus lockdown, it is increasingly clear that something went terribly wrong in Lombardy, the hardest-hit region in Europe’s h", "url": "https://www.thehindu.com/news/international/why-italys-lombardy-was-the-hardest-hmany-failures-combined-to-unleash-death-on-italys-lombardy/article31441240.ece", "urlToImage": null, "publishedAt": "2020-04-27T02:00:02Z", "content": "As Italy prepares to emerge from the Wests first and most extensive coronavirus lockdown, it is increasingly clear that something went terribly wrong in Lombardy, the hardest-hit region in Europes hardest-hit country. \r\nItaly had the bad luck of being the fir… [+13416 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Keto, Intermittent Fasting can help you lose weight and manage diabetes, say experts - Times of India", "description": "Researchers have claimed that certain diet plans can not only effectively manage weight problems but also prevent or treat diabetes to an extent.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/keto-intermittent-fasting-can-help-you-lose-weight-and-manage-diabetes-say-experts/photostory/75381445.cms", "urlToImage": null, "publishedAt": "2020-04-27T01:30:00Z", "content": "And now, new researchers have claimed that certain diet plans can not only effectively manage weight problems but also prevent or treat diabetes to an extent.\r\nWhile we do know that certain lifestyle diseases are a result of bad eating habits and low levels o… [+219 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Victoria to conduct 100000 COVID-19 tests over two weeks - Sky News Australia", "description": "Premier Daniel Andrews has announced his state will undertake a coronavirus testing blitz with plans to test 100,000 Victorians for the virus over the next f...", "url": "https://www.youtube.com/watch?v=6VsJ7VUCCwk", "urlToImage": null, "publishedAt": "2020-04-27T01:25:57Z", "content": null}, {"source": {"id": null, "name": "Labmate-online.com"}, "author": "International Labmate", "title": "What Are the Steps of Vaccine Development? - Labmate Online", "description": "With global cases of the coronavirus disease edging towards three million and more than 200,000 lives claimed, fast tracking a vaccination is front of mind for laboratories around the world. While...", "url": "https://www.labmate-online.com/news/laboratory-products/3/breaking-news/what-are-the-steps-of-vaccine-development/52089", "urlToImage": null, "publishedAt": "2020-04-27T00:43:29Z", "content": "With global cases of the coronavirus disease edging towards three million and more than 200,000 lives claimed, fast tracking a vaccination is front of mind for laboratories around the world. While nothing is guaranteed, experts are hopeful a vaccine for COVID… [+2635 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Gujarat to sequence Covid-19 strain - Times of India", "description": "Ahmedabad: Could a different strain of Covid-19 virus active in Gujarat compared to some of the Indian states be a reason for the state’s high death r.", "url": "https://timesofindia.indiatimes.com/city/ahmedabad/gujarat-to-sequence-covid-19-strain/articleshow/75397075.cms", "urlToImage": null, "publishedAt": "2020-04-26T22:55:00Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "New study says coronavirus detected on tiny particles of air pollution - CBS Evening News", "description": "As the debate rages worldwide about when to send people back to work, a new report says COVID-19 could be even more contagious than previously believed. It's...", "url": "https://www.youtube.com/watch?v=zqrSXTl1Nns", "urlToImage": null, "publishedAt": "2020-04-26T22:41:28Z", "content": null}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "Dileep V Kumar", "title": "Health department augments testing strategy to reach out to more people - The New Indian Express", "description": "While the fear of community transmission continues to hang in the air, Kerala has adopted testing as its mantra to combat Covid-19.", "url": "https://www.newindianexpress.com/cities/thiruvananthapuram/2020/apr/27/health-department-augments-testing-strategy-to-reach-out-to-more-people-2135705.html", "urlToImage": null, "publishedAt": "2020-04-26T22:24:00Z", "content": "THIRUVANANTHAPURAM: While the fear of community transmission continues to hang in the air, Kerala has adopted testing as its mantra to combat Covid-19. Shaping new strategies, the health department is now augmenting testing facilities to reach out to more peo… [+1986 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: lockdown to continue with outbreak at “delicate and dangerous stage” - BBC News - BBC News", "description": "The Government is rejecting calls to relax the coronavirus lockdown, saying the outbreak remains at a \"delicate and dangerous\" stage. Ministers are asking pe...", "url": "https://www.youtube.com/watch?v=YcaRfDqH0zA", "urlToImage": null, "publishedAt": "2020-04-26T21:27:56Z", "content": "The Government is rejecting calls to relax the coronavirus lockdown, saying the outbreak remains at a \"delicate and dangerous\" stage. Ministers are asking people to adjust to what they're calling \"a new normal,\" for some time yet. \r\nAs the Prime Minister Bori… [+572 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What happens if you get both COVID-19 and malaria? - Al Jazeera English", "description": "Malaria is active in scores of countries with most cases occurring in tropical regions. The World Health Organization says there are more than 200 million ne...", "url": "https://www.youtube.com/watch?v=cRNY-B_Kfow", "urlToImage": null, "publishedAt": "2020-04-26T18:51:57Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Study finds coronavirus could be more contagious than previously thought - CBS News", "description": "Scientists in Italy now say coronavirus has been detected in particles of air pollution, which allowed it to be carried over long distances. Chris Livesay re...", "url": "https://www.youtube.com/watch?v=OJJvtdGgau0", "urlToImage": null, "publishedAt": "2020-04-26T18:47:21Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nRobert Mendick,", "title": "'Game changing' Oxford antibody test claims 'overblown' - Telegraph.co.uk", "description": "Government sources said the test, which claims to produce a result within an hour, had yet to be approved by a regulator", "url": "https://www.telegraph.co.uk/news/2020/04/26/game-changing-oxford-antibody-test-claims-overblown/", "urlToImage": null, "publishedAt": "2020-04-26T18:09:00Z", "content": "Hopes for the discovery of a game changing immunity test for Covid-19 were dealt a new blow on Sunday when the Government was forced to deny claims it had ordered up to 50 million home testing kits.\r\nScientists are racing to manufacture an antibody test that … [+2922 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "UK vaccine trial volunteer says she is 'doing fine' after online death rumours - The Guardian", "description": "A fake article about Elisa Granato’s death was circulated on social media", "url": "https://www.theguardian.com/world/2020/apr/26/uk-coronavirus-vaccine-trial-subject-doing-fine-online-death-rumours-elisa-granato", "urlToImage": null, "publishedAt": "2020-04-26T17:33:48Z", "content": "One of the first people to be injected as part of UK human trials for a coronavirus vaccine has said she is doing fine, after a fake article about her death was circulated on social media.\r\nThe article claims that microbiologist Dr Elisa Granato, who took par… [+2400 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "News Update: A lot of fires overnight around the Valley, new coronavirus case numbers and deaths - azfamily powered by 3TV & CBS5AZ", "description": "There were a bunch of fires overnight around the Phoenix area including one where investigators found a body and at another fire, a homeowner escaped the fla...", "url": "https://www.youtube.com/watch?v=OQm1vOKrv1Y", "urlToImage": null, "publishedAt": "2020-04-26T17:27:51Z", "content": "There were a bunch of fires overnight around the Phoenix area including one where investigators found a body and at another fire, a homeowner escaped the flames just in time. Arizona is now reporting 2,526 cases and 275 deaths for COVID-19 cases statewide."}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Agence France-Presse", "title": "‘Can have serious side effects’: Canada warns Hydroxychloroquine use against Covid-19 - Hindustan Times", "description": "The European Medicines Agency on Thursday issued a similar warning about the drugs, whose promise as a coronavirus treatment has been touted by US President Donald Trump.", "url": "https://www.hindustantimes.com/world-news/can-have-serious-side-effects-canada-warns-hydroxychloroquine-use-against-covid-19/story-PI9kobMMhAP4ZI6eww7JKK.html", "urlToImage": null, "publishedAt": "2020-04-26T17:07:30Z", "content": "Canadian health authorities have issued a warning against the use of anti-malarial drugs chloroquine and hydroxychloroquine to treat coronavirus infections or prevent reinfections.\r\n“Chloroquine and hydroxychloroquine can have serious side effects. These drug… [+516 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Pets and COVID-19: Everything You Need To Know | NowThis - NowThis News", "description": "Can animals get COVID-19 or pass it to humans? Here’s everything pet owners need to know about the virus. » Subscribe to NowThis: http://go.nowth.is/News_Sub...", "url": "https://www.youtube.com/watch?v=3Aa79GsOMKA", "urlToImage": null, "publishedAt": "2020-04-26T16:59:48Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "CDC Adds Six New COVID-19 Symptoms - Newsy", "description": "Previously, only fever, shortness of breath and coughing were listed as symptoms for the coronavirus. Now, there are 6 new symptoms to look out for. Learn mo...", "url": "https://www.youtube.com/watch?v=naWLq3SVnLM", "urlToImage": null, "publishedAt": "2020-04-26T16:24:50Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: We must continue to comply with social distancing guidance - Powis @BBC News - BBC - BBC", "description": "Subscribe and 🔔 to OFFICIAL BBC YouTube 👉 https://bit.ly/2IXqEIn Stream original BBC programmes FIRST on BBC iPlayer 👉 https://bbc.in/2J18jYJ 🔘 Subscribe and...", "url": "https://www.youtube.com/watch?v=CX3bOxB4Ygw", "urlToImage": null, "publishedAt": "2020-04-26T15:47:35Z", "content": "Subscribe and to OFFICIAL BBC YouTube https://bit.ly/2IXqEInStream original BBC programmes FIRST on BBC iPlayer https://bbc.in/2J18jYJ\r\nSubscribe and for BBC News breaking news UK https://bit.ly/3a1zyipStream BBC News live on iPlayer https://bbc.in/3b64IVPCor… [+920 chars]"}, {"source": {"id": null, "name": "Arabnews.com"}, "author": "AFP", "title": "Two Dutch mink farms infected with coronavirus - Arabnews", "description": "THE HAGUE: Dutch authorities Sunday cordoned off two mink farms in the southern Netherlands after tests showed the animals had been infected with the coronavirus, most likely from human contact. The farms are located east of Eindhoven in the Northern Brabant …", "url": "https://www.arabnews.com/node/1665311", "urlToImage": null, "publishedAt": "2020-04-26T15:01:31Z", "content": "KABUL: The US envoy for Afghanistan, Zalmay Khalilzad, on Sunday urged the Taliban to suspend attacks on Afghan government forces until the threat of coronavirus had disappeared from the country.\r\nHe also reminded President Ashraf Ghani and his rival Dr. Abdu… [+3956 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Sgt. Philip Kahn, Whose Life Spans 2 Global Pandemics, Dies At 100 | Sunday TODAY - TODAY", "description": "Sgt. Philip Kahn was born in 1919 during the flu pandemic that killed 50 million people worldwide, including his twin brother weeks after birth. Kahn died la...", "url": "https://www.youtube.com/watch?v=J8LMN2OEjfA", "urlToImage": null, "publishedAt": "2020-04-26T14:33:02Z", "content": null}, {"source": {"id": null, "name": "Scoopwhoop.com"}, "author": "Priyanka Aggarwal", "title": "Covid-19 Might Not Be The Last Pandemic We'll Face - ScoopWhoop", "description": "May it be Spanish Flu, Yellow fever, SARS, MERS, Plague or HIV, there have been constant viruses that have been spreading from one country to another.", "url": "https://www.scoopwhoop.com/news/covid-19-might-not-be-the-last-pandemic-we-face/", "urlToImage": null, "publishedAt": "2020-04-26T14:06:55Z", "content": "While we all are sitting at home waiting for achhe din when well be able to get out of our houses and live a normal life, the epidemiologists fear about our near future. \r\nPandemics have been something that has been recurring. May it be Spanish Flu, Yellow fe… [+2995 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Eden David", "title": "A reality check on antibody testing: How do we race forward thoughtfully? - ABC News", "description": "", "url": "https://abcnews.go.com/Health/reality-check-antibody-testing-race-forward-thoughtfully/story?id=70214520", "urlToImage": null, "publishedAt": "2020-04-26T13:03:48Z", "content": "As U.S. government officials begin debating the right steps in easing restrictions due to the novel coronavirus, antibody tests have been touted as the key to returning to normal.\r\nThis particular type of test can detect whether or not a person has developed … [+12523 chars]"}, {"source": {"id": null, "name": "Newsbytesapp.com"}, "author": "Shubham Sharma", "title": "India will start COVID-19 vaccine production next month: Details here - NewsBytes", "description": "Cyrus S", "url": "https://www.newsbytesapp.com/timeline/Science/60337/282086/pune-s-serum-institute-to-begin-covid-19-vaccine-development", "urlToImage": null, "publishedAt": "2020-04-26T12:48:22Z", "content": "<li>In a major development, Cyrus S. Poonawalla's Serum Institute of India has confirmed that it will start making a vaccine for COVID-19 next month.\r\nThe solution, the institute says, is the candidate vaccine that has been developed by Oxford University rese… [+2538 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Anushree Gupta", "title": "Autopsy shows US woman's heart 'burst open' due to coronavirus, patient dies of cardiac arrest - Times Now", "description": "The 57-year-old woman, from Santa Clara County, California, had traces of coronavirus in her heart, lungs, trachea, and intestines, the autopsy report stated.", "url": "https://www.timesnownews.com/health/article/autopsy-shows-us-womans-heart-burst-open-due-to-coronavirus-patient-dies-of-cardiac-arrest/583253", "urlToImage": null, "publishedAt": "2020-04-26T11:49:23Z", "content": "<ul><li>The coronavirus pandemic has infected more than 2.5 million people around the world</li><li>According to recent reports, a woman's heart 'burst open' due to COVID-19 complications in the US</li><li>The patient reportedly died in February, but her auto… [+1901 chars]"}, {"source": {"id": null, "name": "Un.org"}, "author": null, "title": "Millions more children at risk with immunization services disrupted amid COVID-19 pandemic - UN News", "description": "Last year, over 13 million children received no vaccines at all, and the UN Children’s Fund (UNICEF) is calling on governments to step up, warning disrupting immunization services amid the COVID-19 pandemic could leave even more of the world’s most marginaliz…", "url": "https://news.un.org/en/story/2020/04/1062622", "urlToImage": null, "publishedAt": "2020-04-26T11:40:07Z", "content": "Making its call at the start of the 2020 edition of World Immunization Week, UNICEF said on Saturday that millions of children are in danger of missing life-saving vaccines against measles, diphtheria and polio due to disruptions in immunization service as th… [+3029 chars]"}, {"source": {"id": null, "name": "Weforum.org"}, "author": "Stephanie Nebehay", "title": "WHO warns COVID-19 patients could be infected again - World Economic Forum", "description": "The World Health Organization advises countries against issuing “immunity passports” or “risk-free certificates” to people who have been infected.", "url": "https://www.weforum.org/agenda/2020/04/no-evidence-that-recovered-covid-19-patients-cannot-be-reinfected-who/", "urlToImage": null, "publishedAt": "2020-04-26T11:38:09Z", "content": "<ul><li>People who have recovered from COVID-19 still need to take precautions to prevent re-infection</li><li>Some countries have handed out health passports to people who have recovered from the illness</li><li>There are now 2.9 million cases of coronavirus… [+1994 chars]"}, {"source": {"id": null, "name": "Cnbctv18.com"}, "author": null, "title": "Substance in tobacco may lower risk of contracting coronavirus, study suggests - CNBCTV18", "description": "The researchers said they were not encouraging people to take up smoking as it has serious health implications. Get latest Healthcare online at cnbctv18.com", "url": "https://www.cnbctv18.com/healthcare/substance-in-tobacco-may-lower-risk-of-contracting-coronavirus-study-suggests-5779131.htm/", "urlToImage": null, "publishedAt": "2020-04-26T11:34:34Z", "content": "Contrary to recent reports that highlighted smokers and tobacco users are at higher risk of COVID-19 infection, a new study suggests substance in tobacco may lower risk of contracting coronavirus.\r\nThe study, conducted at a hospital in Paris, suggests that a … [+1510 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Coronavirus in Goa: All seven COVID-19 cases recovered; Here’s how a novel treatment worked for the state - The Financial Express", "description": "COVID-19: While Dr Gomes hopes for the development of a vaccine soon, he also puts equal weightage on the need to treat people with human proximity.", "url": "https://www.financialexpress.com/lifestyle/health/coronavirus-in-goa-all-seven-covid-19-cases-recovered-heres-how-a-novel-treatment-worked-for-the-state/1939976/", "urlToImage": null, "publishedAt": "2020-04-26T10:46:40Z", "content": "Coronavirus pandemic: In Goa, doctors modified the coronavirus treatment with a human touch to ensure the recovery of its patients. The state has witnessed seven positive cases so far and it has no active cases now. While the state is gearing up for a possibl… [+3008 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Chris Caulfield", "title": "50,000,000 coronavirus immunity tests ‘could let Brits socialise by June’ - Metro.co.uk", "description": "'People who assume that they are immune to a second infection because they have received a positive test result may ignore public health advice.'", "url": "https://metro.co.uk/2020/04/26/government-orders-50million-coronavirus-immunity-tests-12611310/", "urlToImage": null, "publishedAt": "2020-04-26T10:39:16Z", "content": "It is hoped that the test kits would allow people to return to a more normal life and for the Goverment to build up a picture of immunity (Picture: AFP)\r\nThe Government has reportedly ordered 50 million new coronavirus immunity tests that could let Brits work… [+4143 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Iraqi TV show producers hope to provide comfort for Ramadan - Al Jazeera English", "description": "Watching TV is a popular pastime during the holy month of Ramadan, and Iraq is no exception. It is perhaps the only custom that has remained unaffected by th...", "url": "https://www.youtube.com/watch?v=pIRYFFgKW6E", "urlToImage": null, "publishedAt": "2020-04-26T09:28:03Z", "content": null}, {"source": {"id": null, "name": "Thelogicalindian.com"}, "author": "Palak Agrawal", "title": "Oxford University Starts COVID-19 Vaccine Trials, First Volunteer Injected - The Logical Indian", "description": "The aim is to quicken the process and make the vaccines available to the residents of UK by...", "url": "https://thelogicalindian.com/news/covid-19-vaccine-trials-on-human-to-start-in-uk-20780", "urlToImage": null, "publishedAt": "2020-04-26T09:26:49Z", "content": "Microbiologist Elisa Granato has become the first human to be injected for the human trial phase of a potential vaccine of COVID-19 by a group of scientists at the University of Oxford, UK.\r\nThe ground-breaking vaccine is set to be tried on around 800 volunte… [+2177 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "As virus lockdown eases, Italy ponders what went wrong - Economic Times", "description": "As Italy prepares to emerge from the West's first and most extensive coronavirus lockdown, it is increasingly clear that something went terribly wrong in Lombardy, the hardest-hit region in Europe's hardest-hit country.", "url": "https://economictimes.indiatimes.com/news/international/world-news/as-virus-lockdown-eases-italy-ponders-what-went-wrong/articleshow/75388803.cms", "urlToImage": null, "publishedAt": "2020-04-26T09:08:30Z", "content": "As Italy prepares to emerge from the West's first and most extensive coronavirus lockdown, it is increasingly clear that something went terribly wrong in Lombardy, the hardest-hit region in Europe's hardest-hit country. Italy had the bad luck of being the fir… [+5171 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Women face anxiety over pregnancy and birth in US - TRT World", "description": "For many women, being pregnant comes with its own set of fears and anxiety. But being pregnant during the Covid-19 pandemic takes those fears to a whole new ...", "url": "https://www.youtube.com/watch?v=gagwijdvCR0", "urlToImage": null, "publishedAt": "2020-04-26T08:10:16Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "40 people in a village in Port St Johns have tested positive for the corona virus - eNCA", "description": "The COVID-19 outbreak appears to be growing in the Eastern Cape. The province currently has 4-hundred and 88 confirmed cases and ten deaths. It's reported th...", "url": "https://www.youtube.com/watch?v=yU-usyRdS5c", "urlToImage": null, "publishedAt": "2020-04-26T06:57:56Z", "content": "The COVID-19 outbreak appears to be growing in the Eastern Cape. The province currently has 4-hundred and 88 confirmed cases and ten deaths. It's reported that 40 people in a village in Port St. Johns have tested positive for the virus. On Saturday Eastern Ca… [+102 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Anna MacSwan", "title": "Government pins hopes on order of 50 million 'game changing' coronavirus immunity tests - Mirror Online", "description": "The UK Government has ordered 50 million antibody tests which show if a person has already contracted Covid-19 - despite WHO warning \"there is no evidence\" survivors are immune", "url": "https://www.mirror.co.uk/news/politics/government-pins-hopes-order-50-21927858", "urlToImage": null, "publishedAt": "2020-04-26T06:55:40Z", "content": "The Government has ordered 50 million tests which can show if a person has already had coronavirus. \r\nIt is widely believed that contracting the virus creates immunity against future infection. \r\nIt is hoped the new antibody tests will be a \"game changer\" in … [+3846 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "basitwani", "title": "Baba Ramdev Claims 'If You Can Hold Your Breath For A Minute, You Don’t Have Coronavirus' - Indiatimes.com", "description": "Yoga guru Baba Ramdev claims he knows how one can know for sure if they are COVID-19 positive - if you can hold your breath for a minute, you don't have coronavirus.", "url": "https://www.indiatimes.com/news/india/baba-ramdev-claims-if-you-can-hold-your-breath-for-a-minute-you-dont-have-coronavirus-511780.html", "urlToImage": null, "publishedAt": "2020-04-26T06:44:23Z", "content": "Yoga guru Baba Ramdev claims he knows how one can know for sure if they are COVID-19 positive - if you can hold your breath for a minute, you don't have coronavirus. \r\nPTI\r\nWhile countries scrap to test their citizens for the virus, Ramdev has made an astonis… [+1259 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Katrina Turrill", "title": "Coronavirus symptoms: Heartbroken son reveals mum’s first symptom before her death - Express", "description": "CORONAVIRUS symptoms have been shown to differ from person to person - while symptoms in some people appear mild, in others they present as more severe. A son has now spoken of his mum's first symptom before her death.", "url": "https://www.express.co.uk/life-style/health/1273717/coronavirus-symptoms-cases-death-feeling-unwell-cough", "urlToImage": null, "publishedAt": "2020-04-26T06:17:24Z", "content": "Graeme Anderson, 36, has described his mum’s first symptoms before her untimely death from COVID-19.\r\nSpeaking to Liverpool Echo, he explained his mum, June, had self-isolated for two weeks after a neighbour by her home tested positive for the disease.\r\nBut s… [+264 chars]"}, {"source": {"id": null, "name": "Khaleejtimes.com"}, "author": "AFP", "title": "WHO warns over coronavirus immunity as global death toll tops 200000 - Khaleej Times", "description": "The global death toll in the novel coronavirus pandemic soared past the grim 200,000 milestone on Sunday, as the World Health Organization w...", "url": "https://www.khaleejtimes.com/coronavirus-pandemic/who-warns-over-coronavirus-immunity-as-global-death-toll-tops-200000", "urlToImage": null, "publishedAt": "2020-04-26T05:37:44Z", "content": "The global death toll in the novel coronavirus pandemic soared past the grim 200,000 milestone on Sunday, as the World Health Organization warned against \"immunity passports\" for recovered patients, seen as a possible tool for countries preparing to re-open t… [+5892 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "Second wave of COVID-19 may hit India during monsoon months - Northeast Now", "description": "Though coronavirus cases in India may go down substantially in the coming days, it may again resurface during the monsoon months. According to an India Times report, the second wave is expected to hit the country in the months of July and August. However, acc…", "url": "https://nenow.in/top-news/second-wave-of-covid-19-may-hit-india-during-monsoon-months.html/", "urlToImage": null, "publishedAt": "2020-04-26T03:20:07Z", "content": "Though coronavirus cases in India may go down substantially in the coming days, it may again resurface during the monsoon months.\r\nAccording to an India Times report, the second wave is expected to hit the country in the months of July and August.\r\nHowever, a… [+840 chars]"}, {"source": {"id": null, "name": "Deccanchronicle.com"}, "author": "Balu Pulipaka", "title": "So is Telangana betting on herd immunity? - Deccan Chronicle", "description": "In a sudden policy switch two days ago, health officials stopped testing secondary contacts unless they had covid-19 symptoms", "url": "https://www.deccanchronicle.com/nation/current-affairs/260420/so-is-telangana-betting-on-herd-immunity.html", "urlToImage": null, "publishedAt": "2020-04-26T03:12:00Z", "content": "Hyderabad: Telangana appears to be betting on 'herd immunity' to see itself through what it perceives as the worst of the Covid-19 epidemic.\r\nAuthorities are hoping that the current trend of about 80 per cent of the coronavirus-infected people now in hospital… [+2706 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Hindustan Times", "title": "India records biggest single day spike, virus can survive on particulate matter: Covid-19 news today - Hindustan Times", "description": "Here is a preview of the important Covid-19 stories from India and world today.", "url": "https://www.hindustantimes.com/india-news/india-records-biggest-single-day-spike-virus-can-survive-on-particulate-matter-covid-19-news-today/story-WANk0UoFH42j3DcDdXLDSM.html", "urlToImage": null, "publishedAt": "2020-04-26T02:48:01Z", "content": "India’s tally of confirmed coronavirus disease (Covid-19) cases shot past the 26,000-mark on Saturday with the biggest single-day spike in infections. Tests in Italy found the Sars-CoV-2 virus, which causes Covid-19, can cling to air pollution particles.\r\nInd… [+4828 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Reuters", "title": "US FDA warns against hydroxychloroquine drug Donald Trump touted as game changer - Zee News", "description": "The FDA has allowed healthcare providers to use the drugs for COVID-19 through its emergency use authorization, but has not approved them to treat the disease.", "url": "https://zeenews.india.com/world/us-fda-warns-against-hydroxychloroquine-drug-donald-trump-touted-as-game-changer-2279092.html", "urlToImage": null, "publishedAt": "2020-04-26T02:20:28Z", "content": "The US Food and Drug Administration on Friday (April 24, 2020) cautioned against the use of malaria drug hydroxychloroquine in COVID-19 patients even as President Donald Trump, who has touted it as a \"game-changer\" advocated for an additional review.\r\nThe dru… [+2717 chars]"}, {"source": {"id": null, "name": "Manoramaonline.com"}, "author": "Reuters", "title": "Could warmer weather help contain the coronavirus? - Onmanorama", "description": "Here's what we know about seasonal features of disease outbreaks.", "url": "https://english.manoramaonline.com/lifestyle/health/2020/04/25/could-warmer-weather-help-contain-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-26T01:01:18Z", "content": "The world is looking for signs that the arrival of warmer weather in the northern hemisphere could slow the spread of the coronavirus outbreak, which has killed more than 1,90,000 people and sent the global economy into a tailspin as countries impose lockdown… [+3652 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Summer Woolley", "title": "Coronavirus update: Six-month-old baby with heart condition survives COVID-19 - 7NEWS.com.au", "description": "The baby received a standing ovation from hospital staff but just weeks prior, her parents Emma and Wayne had been told they were going to lose her.", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-update-six-month-old-baby-with-heart-condition-survives-covid-19-c-999490", "urlToImage": null, "publishedAt": "2020-04-25T22:48:49Z", "content": "A six-month-old baby who fought through a rare heart defect, a respiratory illness and collapsed lungs has now survived COVID-19.\r\nThe baby from Manchester, England, received a standing ovation from NHS staff as she was escorted through the hospital.\r\nJust we… [+3155 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Why are some people with Covid-19 asymptomatic? Evidence points to 2 factors - India Gone Viral", "description": "SARS-CoV-2, the coronavirus which causes COVID-19, has infected almost 2.5 million people around the world and claimed 170,000 lives.But some people don’t even get symptoms. Recent studies suggest as", "url": "https://indiagoneviral.com/health/2020/04/26/why-are-some-people-with-covid-19-asymptomatic-evidence-points-to-2-factors/42499/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T22:06:23Z", "content": "SARS-CoV-2, the coronavirus which causes COVID-19, has infected almost 2.5 million people around the world and claimed 170,000 lives.\r\nBut some people dont even get symptoms. Recent studies suggest as many as 80 percentor more of those infected are silent car… [+5687 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "WHO warns against coronavirus 'immunity passports' - Al Jazeera English", "description": "UN health agency says there is 'no evidence' that recovered coronavirus patients are protected from reinfection.", "url": "https://www.aljazeera.com/news/2020/04/warns-coronavirus-immunity-passports-200425150532564.html", "urlToImage": null, "publishedAt": "2020-04-25T21:22:24Z", "content": "The United Nations's health agency has warned there is no scientific evidence to prove that people who have recovered from the coronavirus develop immunity against potential infection in the future, as the global death toll from COVID-19 passed 200,000 on Sat… [+4030 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Could a Second Wave of Coronavirus Infections Appear? - QuickTake by Bloomberg", "description": "The concern about a second wave of #coronavirus is that, once quelled, the pandemic will resurface with renewed strength Subscribe to our YouTube channel: ht...", "url": "https://www.youtube.com/watch?v=fNZ83AEd7Wk", "urlToImage": null, "publishedAt": "2020-04-25T20:34:42Z", "content": "The concern about a second wave of #coronavirus is that, once quelled, the pandemic will resurface with renewed strength\r\nSubscribe to our YouTube channel: https://bit.ly/2TwO8Gm\r\nQUICKTAKE ON SOCIAL:Follow QuickTake on Twitter: twitter.com/quicktakeLike Quic… [+337 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Mehr Gill", "title": "Explained: Types of human coronaviruses and the symptoms they cause - The Indian Express", "description": "While there are hundreds of coronaviruses, there are seven that we know can infect humans.", "url": "https://indianexpress.com/article/explained/types-of-human-coronaviruses-and-symptoms-6368444/", "urlToImage": null, "publishedAt": "2020-04-25T19:50:19Z", "content": "Written by Mehr Gill\r\n | New Delhi | \r\nUpdated: April 25, 2020 6:09:09 pm\r\nHuman coronaviruses were first characterised in the mid-1960s and they are mostly considered to be responsible for causing upper respiratory tract infections in children. (AP illustrat… [+6888 chars]"}, {"source": {"id": null, "name": "Voanews.com"}, "author": null, "title": "COVID-19 Frightens Malaria Patients in Cameroon - VOA News", "description": "A song urging Cameroonians not to relent in the fight against malaria blasted through speakers Saturday — World Malaria Day — at road junctions and popular neighborhoods, as well as from publicity vans driving through Cameroon’s capital, Yaounde.\n\nDr.", "url": "https://www.voanews.com/science-health/covid-19-frightens-malaria-patients-cameroon", "urlToImage": null, "publishedAt": "2020-04-25T19:49:20Z", "content": "YAOUNDE, CAMEROON - A song urging Cameroonians not to relent in the fight against malaria blasted through speakers Saturday World Malaria Day at road junctions and popular neighborhoods, as well as from publicity vans driving through Cameroons capital, Yaound… [+2820 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Ariana Eunjung Cha", "title": "Young and middle-aged people, barely sick with covid-19, are dying of strokes - The Washington Post", "description": "Doctors sound alarm about patients in their 30s and 40s left debilitated or dead by strokes. Some didn’t even know they were infected by coronavirus.", "url": "https://www.washingtonpost.com/health/2020/04/24/strokes-coronavirus-young-patients/", "urlToImage": null, "publishedAt": "2020-04-25T18:18:21Z", "content": "Oxley gasped when he got to the patients age and covid-19 status: 44, positive.\r\nThe man was among several recent stroke patients in their 30s to 40s who were all infected with the coronavirus. The median age for that type of severe stroke is 74.\r\nAs Oxley, a… [+9467 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "2 cell types are entry points for virus - Hindustan Times", "description": "The respiratory tract is filled with numerous cells, among which are goblet cells and ciliated cells.", "url": "https://www.hindustantimes.com/india-news/2-cell-types-are-entry-points-for-virus/story-VZ250MIqdc4r0OIzxsTqPJ.html", "urlToImage": null, "publishedAt": "2020-04-25T17:54:31Z", "content": "Scientists have identified two types of cells in the nose that are likely to be point of infection for the Sars-CoV-2 virus, which causes Covid-19, in the body.\r\nThe respiratory tract is filled with numerous cells, among which are goblet cells and ciliated ce… [+2449 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Recovered COVID-19 patient Smriti Thakkar speaks to Mirror Now | EXCLUSIVE - Mirror Now", "description": "Meet Smriti Thakkar a braveheart who recovered from Coronavirus and now a plasma donor speaks exclusively to Mirror Now. She talks about her journey from ill...", "url": "https://www.youtube.com/watch?v=3zQgID-kiNY", "urlToImage": null, "publishedAt": "2020-04-25T16:07:07Z", "content": null}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Hyderabad University's UVC disinfection trolley can clean coronavirus rapidly - India Today", "description": "The University of Hyderabad along with other institutions have created a UVC based disinfection trolley which can clean coronavirus infected areas rapidly.", "url": "https://www.indiatoday.in/education-today/news/story/hyderabad-university-created-uvc-disinfection-trolley-can-clean-coronavirus-rapidly-1671036-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T15:09:42Z", "content": "In a fight against Covid-19, a UVC based disinfection trolley to rapidly clean hospital environment has been created by the International Advanced Research Centre for Powder Metallurgy and New Materials (ARCI), an autonomous R&amp;D Centre of Department of Sc… [+3034 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Can this pulse monitor detect COVID-19? - Good Morning America", "description": "Pulse oximeters can provide an early warning sign of COVID-19 for patients in hospitals, but are those devices as effective when people use them at home?", "url": "https://www.youtube.com/watch?v=z9sypZ7mWRA", "urlToImage": null, "publishedAt": "2020-04-25T14:28:18Z", "content": "Pulse oximeters can provide an early warning sign of COVID-19 for patients in hospitals, but are those devices as effective when people use them at home?"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Free robot delivery for health workers in British town - Reuters", "description": "Ever since the British government imposed strict social distancing, a fleet of robots on wheels have been busy in the town of Milton Keynes, delivering for f...", "url": "https://www.youtube.com/watch?v=nib5bcNVZ8s", "urlToImage": null, "publishedAt": "2020-04-25T13:14:29Z", "content": "Ever since the British government imposed strict social distancing, a fleet of robots on wheels have been busy in the town of Milton Keynes, delivering for free to NHS staff and facing increased demand from the general public. \r\nSubscribe: http://smarturl.it/… [+401 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "WHO Warns You May Catch Coronavirus More Than Once - Bloomberg", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=cd167a30-87ee-11ea-be62-69f070f39e5f&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNC0yNS9jYXRjaGluZy1jb3ZpZC0xOS1tYXktbm90LXNoaWVsZC1hZ2FpbnN0LW5ldy1pbmZlY3Rpb24td2hvLXNheXM=", "urlToImage": null, "publishedAt": "2020-04-25T13:13:20Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Explained Desk", "title": "Explained: How coronavirus may affect the kidneys - The Indian Express", "description": "Kidney damage is common in severe cases of Covid-19. However, it is not yet clear if the virus directly attacks the kidneys, or if kidney failure or damage is a part of multiple-organ failure.", "url": "https://indianexpress.com/article/explained/explained-how-coronavirus-may-affect-the-kidneys-6378915/", "urlToImage": null, "publishedAt": "2020-04-25T12:55:05Z", "content": "A patient undergoes dialysis treatment at a dialysis centre, amidst the coronavirus disease (COVID-19) outbreak, in Guayaquil, Ecuador. (Reuters Photo: Santiago Arcos)Apart from ventilators, another kind of machinery that is in shortage amid the coronaviruspa… [+3849 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Kenneth R. Rosen", "title": "Italian Woman Tests Positive for COVID-19 After 60 Days of Quarantine and Swabbing - Newsweek", "description": "Bianca Dobroiu arrived at the Sant'Orsola-Malpighi Polyclinic hospital in Bologna with a fever above 105 degrees and was diagnosed with COVID-19.", "url": "https://www.newsweek.com/italian-woman-tests-positive-covid-19-after-60-days-quarantine-swabbing-1500202", "urlToImage": null, "publishedAt": "2020-04-25T12:30:39Z", "content": "A 23-year-old in Italy being treated for the disease caused by the novel coronavirus continues to test positive, despite two months of quarantine and continual swabs.\r\nBianca Dobroiu arrived at the Sant'Orsola-Malpighi Polyclinic hospital, a public hospital p… [+4335 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Could stem cell therapy help treat coronavirus? - CBS This Morning", "description": "Doctors are hoping stem cell therapy could be a weapon in the fight against coronavirus. On Friday, regenerative medicine company Mesoblast announced a 300-p...", "url": "https://www.youtube.com/watch?v=4Ul6_EJ3Swg", "urlToImage": null, "publishedAt": "2020-04-25T11:48:58Z", "content": null}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Coronavirus And Smoking: French Researchers Suggest Nicotine Could Protect Against Coronavirus - Swarajya", "description": "", "url": "https://swarajyamag.com/news-brief/coronavirus-and-smoking-french-researchers-suggest-nicotine-could-protect-against-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T11:31:00Z", "content": null}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Faye Brown", "title": "WHO warning against coronavirus immunity passports - Metro.co.uk", "description": "The World Health Organisation say there is still not enough evidence having coronavirus can protect you from reinfection.", "url": "https://metro.co.uk/2020/04/25/casts-doubt-antibody-tests-warning-immunity-passports-12608431/", "urlToImage": null, "publishedAt": "2020-04-25T11:12:53Z", "content": "There is no evidence having coronavirus will protect you from reinfection, according to the World Health Organisation\r\nThe World Health Organisation has warned against the idea of immunity passports as a solution to easing lockdown amid the coronavirus pandem… [+2174 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Plasma therapy trials for coronavirus patients begin in Karnataka - Deccan Herald", "description": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.", "url": "https://www.deccanherald.com/state/top-karnataka-stories/plasma-therapy-trials-for-coronavirus-patients-begin-in-karnataka-829772.html", "urlToImage": null, "publishedAt": "2020-04-25T11:00:06Z", "content": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.\r\nFollow latest updates on the COVID-19 pandemic here\r\nIn a tweet, Medical Education Minister K Sudhakar said, \"Happy to … [+1295 chars]"}, {"source": {"id": null, "name": "Euroweeklynews.com"}, "author": null, "title": "CORONAVIRUS: ‘IT’S IN THE AIR’ – ITALIAN SCIENTISTS MAKE A WORRYING DISCOVERY - Euro Weekly News", "description": "In a worrying development, Italian Scientists have detected traces of the coronavirus in particles of air pollution. THE Coronavirus has been detected in News Article", "url": "https://www.euroweeklynews.com/2020/04/25/coronavirus-its-in-the-air-italian-scientists-make-a-worrying-discovery/", "urlToImage": null, "publishedAt": "2020-04-25T10:09:38Z", "content": "THE Coronavirus has been detected in particles of air pollution by Italian scientists looking into whether the illness could be carried this way over long distances and potentially increase the infection rate.\r\nPreliminary work from researchers in Italy found… [+1240 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "Identical twin sisters die of COVID-19 - Northeast Now", "description": "Identical twin sisters, who worked as nurses at the same hospital, died within three days after testing positive for COVID-19. As per reports, the 37-year-old sisters were suffering from other health complications before contracting COVID-19 and had been unwe…", "url": "https://nenow.in/health/identical-twin-sisters-die-of-covid-19.html/", "urlToImage": null, "publishedAt": "2020-04-25T09:16:31Z", "content": "Identical twin sisters, who worked as nurses at the same hospital, died within three days after testing positive for COVID-19.\r\nAs per reports, the 37-year-old sisters were suffering from other health complications before contracting COVID-19 and had been unw… [+1124 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Cotton, natural silk, chiffon make best materials for homemade masks against COVID-19: Study - The Financial Express", "description": "They said the performance of these fabric layers was close to that of an N95 mask material.  According to the study, substituting the chiffon with natural silk or flannel, or simply using a cotton quilt with cotton-polyester batting, produced similar results.", "url": "https://www.financialexpress.com/lifestyle/health/cotton-natural-silk-chiffon-make-best-materials-for-homemade-masks-against-covid-19-study/1939446/", "urlToImage": null, "publishedAt": "2020-04-25T09:04:27Z", "content": "As people resort to making their own cloth masks due to shortage of surgical and N95 varieties in the wake of the COVID-19 pandemic, a new study says a combination of cotton with natural silk or chiffon can filter out aerosol particles provided that the mask … [+2378 chars]"}, {"source": {"id": null, "name": "Trtworld.com"}, "author": "TRTWorld", "title": "WHO warns against idea of 'immunity passports' - TRT World", "description": "The concept of “immunity passports” or “risk-free certificates” has been floated as a way of allowing people protected against reinfection to return to work.", "url": "https://www.trtworld.com/life/who-warns-against-idea-of-immunity-passports-35737", "urlToImage": null, "publishedAt": "2020-04-25T08:54:25Z", "content": "The concept of immunity passports or risk-free certificates has been floated as a way of allowing people protected against reinfection to return to work.\r\nThis Wednesday, March 11, 2015 photo shows the World Health Organization headquarters building in Geneva… [+1045 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "AP", "title": "Coronavirus: WHO warns against idea of 'immunity passports' - Deccan Herald", "description": "The World Health Organization is cautioning against the idea of “immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.", "url": "https://www.deccanherald.com/international/world-news-politics/coronavirus-world-health-organization-warns-against-idea-of-immunity-passports-829739.html", "urlToImage": null, "publishedAt": "2020-04-25T08:50:01Z", "content": "The World Health Organization is cautioning against the idea of immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.\r\nThe concept of immunity pas… [+813 chars]"}, {"source": {"id": null, "name": "Thepeninsulaqatar.com"}, "author": "", "title": "Why has Spain been hit so hard by the coronavirus pandemic? - The Peninsula Qatar", "description": "In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told AFP.", "url": "https://www.thepeninsulaqatar.com/article/25/04/2020/Why-has-Spain-been-hit-so-hard-by-the-coronavirus-pandemic", "urlToImage": null, "publishedAt": "2020-04-25T08:01:00Z", "content": "Barcelona: In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told AFP.\r\nWhile they stressed it was too early to carry out a detailed analysis, th… [+4426 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Nitin Sreedhar", "title": "When a virus jumps: of man, microbes and pandemics - Livemint", "description": "Climate change effects or complex man-animal interactions—why are zoonotic disease outbreaks like covid-19 becoming more frequent?", "url": "https://www.livemint.com/mint-lounge/features/when-a-virus-jumps-of-man-microbes-and-pandemics-11587735889206.html", "urlToImage": null, "publishedAt": "2020-04-25T05:10:40Z", "content": "Inger Andersen, executive director of the UN Environment Programme, said last month that nature was sending humankind a message\" through the coronavirus pandemic and climate crisis. In an interview with The Guardian, the Danish environmentalist said there wer… [+10236 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Aswathi Pacha", "title": "Stop villainising bats, say scientists and conservationists - The Hindu", "description": "The mammals do not spread COVID-19, they say", "url": "https://www.thehindu.com/sci-tech/energy-and-environment/stop-villainising-bats-say-scientists-and-conservationists/article31429962.ece", "urlToImage": null, "publishedAt": "2020-04-25T04:24:55Z", "content": "Unverified news and social media posts linking bats to the COVID-19 outbreak have led to widespread antipathy and there have been increasing incidents of the public destroying bat roosts and smoking them out. To raise awareness, 64 chiropterologists (those wh… [+2199 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "G Thing: Pet fashion designer finds unique ways to give back to animal rescue crews - PIX11 News", "description": "She's one of the most in demand New York fashion designers for dog and cats.", "url": "https://www.youtube.com/watch?v=WcRkfwYZcdU", "urlToImage": null, "publishedAt": "2020-04-25T03:02:18Z", "content": "Sign in to report inappropriate content.\r\nSign in"}]}