{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak: World Health Organization provides update on COVID-19 pandemic | LIVE - Global News", "description": "World Health Organization (WHO) Director General Dr. Tedros Adhanom Ghebreyesus said on Wednesday that while responding to the current COVID-19 pandemic, the...", "url": "https://www.youtube.com/watch?v=0T0nDFjBoYo", "urlToImage": "https://i.ytimg.com/vi/0T0nDFjBoYo/maxresdefault.jpg", "publishedAt": "2020-05-06T16:25:42Z", "content": "World Health Organization (WHO) Director General Dr. Tedros Adhanom Ghebreyesus said on Wednesday that while responding to the current COVID-19 pandemic, the world must work harder to prepare for the next pandemic.\r\nHe added that its now an opportunity to bui… [+1630 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What Are The Most Promising Coronavirus Vaccines Under Trial? - CRUX", "description": "Scientists all across the world are trying to develop a COVID-19 vaccine, as Coronavirus cases in the world cross 3.7 million. The top five vaccines include ...", "url": "https://www.youtube.com/watch?v=p2iMJoWGqtY", "urlToImage": "https://i.ytimg.com/vi/p2iMJoWGqtY/maxresdefault.jpg", "publishedAt": "2020-05-06T15:55:53Z", "content": "Scientists all across the world are trying to develop a COVID-19 vaccine, as Coronavirus cases in the world cross 3.7 million. The top five vaccines include the vaccine developed by Oxford University. These vaccines are under either Phase-I or II of the trail… [+204 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "World's Largest Measles Outbreak Still Raging in DRC—Alongside COVID-19 - Doctors Without Borders / MSF-USA", "description": "While the world is responding to the COVID-19 pandemic, Doctors Without Borders/Médecins Sans Frontières (MSF) is warning that efforts to contain the spread ...", "url": "https://www.youtube.com/watch?v=0JN2XNcBiAQ", "urlToImage": "https://i.ytimg.com/vi/0JN2XNcBiAQ/maxresdefault.jpg", "publishedAt": "2020-05-06T15:49:11Z", "content": "While the world is responding to the COVID-19 pandemic, Doctors Without Borders/Médecins Sans Frontières (MSF) is warning that efforts to contain the spread of the new coronavirus should not interfere with the prevention of measles and other killer diseases. … [+1628 chars]"}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "Express News Service", "title": "COVID-19 vaccine: Italian firm claims big breakthrough - The New Indian Express", "description": "Tests are being carried out at Rome's infectious-disease Spallanzani Hospital where researchers from the firm Takis have successfully managed to generate antibodies in mice that “work” on human cells", "url": "https://www.newindianexpress.com/nation/2020/may/06/covid-19-vaccine-italian-firm-claims-big-breakthrough-2139983.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2020/5/6/w600X390/IILy.jpg", "publishedAt": "2020-05-06T15:09:00Z", "content": "NEW DELHI: A day after Israel claimed that it has achieved a “significant breakthrough' in developing an antibody to the coronavirus and applied for a patent, Italy has now announced that it has developed a vaccine for the virus that could effectively work on… [+2336 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AP", "title": "The second coronavirus wave: How bad will it be as lockdowns ease? - Livemint", "description": "The US has seen over 71,000 deaths amid its 1.2 million confirmed infections, and Europe has endured over 144,000 reported deaths.In India, which partly relaxed its lockdown this week, health authorities scrambled Wednesday to contain an outbreak at a huge ma…", "url": "https://www.livemint.com/news/world/the-second-coronavirus-wave-how-bad-will-it-be-as-lockdowns-ease-11588774977842.html", "urlToImage": "https://images.livemint.com/img/2020/05/06/600x338/20200505088L_1588777151377_1588777182853.jpg", "publishedAt": "2020-05-06T15:01:50Z", "content": "ROME :\r\nFrom the marbled halls of Italy to the wheat fields of Kansas, health authorities are increasingly warning that the question isn't whether a second wave of coronavirus infections and deaths will hit, but when and how badly.In India, which partly relax… [+3433 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Sanchita Sharma", "title": "Lab-grown antibodies could block Sars-Cov-2 virus: Scientists - Hindustan Times", "description": "Scientists in the Netherlands and Israel have separately created antibodies in the lab that can neutralise Sars-CoV-2, the virus that causes Covid-19, to prevent human cells from getting infected.", "url": "https://www.hindustantimes.com/world-news/lab-grown-antibodies-could-block-sars-cov-2-virus-scientists/story-vx24ZoDsFw6QKQCQn1zJbI.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/06/Pictures/virus-outbreak-india_1609a028-8fa1-11ea-8c4e-d383a7371370.jpg", "publishedAt": "2020-05-06T14:22:36Z", "content": "Lab-grown antibodies have been shown evidence of blocking the coronavirus disease (Covid-19) in the Netherlands and Israel, and could emerge as a critical new tool to stop the spread of the infection.\r\nScientists in the Netherlands and Israel have separately … [+2657 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "IANS", "title": "Hyderabad university faculty deciphers key to Covid-19 infection in humans - Livemint", "description": "Professor Lalita Guruprasad of Hyderabad university has identified the defining features that distinguish the coronavirus mutations possessing the ability to infect human beings", "url": "https://www.livemint.com/news/india/hyderabad-university-faculty-deciphers-key-to-covid-19-infection-in-humans-11588773576958.html", "urlToImage": "https://images.livemint.com/img/2020/05/06/600x338/2020-05-03T172617Z_1806814533_RC25HG9F861B_RTRMADP_3_HEALTH-CORONAVIRUS-CANADA-ABCELLERA_1588766913244_1588774105137.JPG", "publishedAt": "2020-05-06T14:09:07Z", "content": "HYDERABAD :\r\nWhile the world races to develop a vaccine to counter the scourge of Covid-19, a faculty member at the University of Hyderabad (UoH) has made a crucial discovery that can help in the design of antibodies capable of combating the virus.Professor L… [+2849 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Reuters", "title": "Coronavirus spread swiftly around world in late 2019, adapting to its human hosts: Study - Livemint", "description": "The study found almost 200 recurrent genetic mutations of the coronavirus (Covid-19) which the researchers said showed how it may be evolving as it spreads in people.More than 3.68 million people have been reported to be infected by the novel coronavirus glob…", "url": "https://www.livemint.com/news/india/coronavirus-spread-swiftly-around-world-in-late-2019-adapting-to-its-human-hosts-study-11588771786256.html", "urlToImage": "https://images.livemint.com/img/2020/05/06/600x338/2020-05-03T172617Z_1806814533_RC25HG9F861B_RTRMADP_3_HEALTH-CORONAVIRUS-CANADA-ABCELLERA_1588766913244_1588772362279.JPG", "publishedAt": "2020-05-06T13:43:26Z", "content": "LONDON :\r\nA genetic analysis of samples from more than 7,500 people infected with COVID-19 suggests the new coronavirus spread quickly around the world late last year and is adapting to its human hosts, scientists said on Wednesday.A study by scientists at Un… [+3086 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Blood Sugar test: When and how to do it correctly - Times of India", "description": "Constantly monitoring the blood glucose level helps to manage the health condition and prevent complications.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/blood-sugar-test-when-and-how-to-do-it-correctly/photostory/75578538.cms", "urlToImage": "https://static.toiimg.com/photo/75578655.cms", "publishedAt": "2020-05-06T13:35:00Z", "content": "You can do the test multiple times a day to monitor the fluctuation, but it is important to consult your doctor about the frequency. Depending on your health condition, your doctor will tell you how often you should do it. You can do it:\r\nBefore meals and sna… [+525 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus mutations: Scientists puzzle over impact - BBC News", "description": "A study has identified a mutation that its authors say could make the coronavirus more infectious.", "url": "https://www.bbc.co.uk/news/health-52557955", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/9F98/production/_112165804_covid-19-4k-1-1-scaled.jpg", "publishedAt": "2020-05-06T12:25:43Z", "content": "Image copyrightWe Are CovertImage caption\r\n Researchers have been tracking changes to the 'spike' of the virus\r\nResearchers in the US and UK have identified hundreds of mutations to the virus which causes the disease Covid-19. \r\nBut none has yet established w… [+2800 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Lucy Jones", "title": "As common symptoms fade coronavirus patients face deadly blood clots, docs warn - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11554807/common-symptoms-fade-coronavirus-blood-clots/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/04/NINTCHDBPICT000580161456.jpg?strip=all&quality=100&w=724&h=482&crop=1", "publishedAt": "2020-05-06T12:20:16Z", "content": "CORONAVIRUS patients are facing deadly blood clots after their respiratory symptoms fade, doctors are warning.\r\nUS medics say they have started to notice this troubling blood-clotting phenomenon, which is occurring more frequently in Covid-19 patients.\r\n Covi… [+5485 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Sam Meredith", "title": "Millions of people are expected to fall ill with tuberculosis due to coronavirus lockdown - CNBC", "description": "\"This situation makes me sick, because (it) is totally avoidable,\" Lucica Ditiu, executive director of the Stop TB Partnership, said.", "url": "https://www.cnbc.com/2020/05/06/coronavirus-millions-of-people-expected-to-fall-ill-with-tuberculosis.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106522684-1588762025420gettyimages-1211085918.jpeg?v=1588762457", "publishedAt": "2020-05-06T12:04:26Z", "content": "Migrant labourers stand in a queue for medical checkup after reaching quarantine center at their hometown Allahabad during Government imposed nationwide lockdown as a prventive measure against the COVID-19 corona virus in Allahabad, India on April 27, 2020.\r\n… [+3541 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NHS Covid-19 app: Hands on with the new coronavirus tracing app | LBC - LBC", "description": "LBC has taken a look through how the new NHS coronavirus tracing app. The app is a key part of the UK's plan to get the country out of lockdown to help track...", "url": "https://www.youtube.com/watch?v=6gdZFre2UoE", "urlToImage": "https://i.ytimg.com/vi/6gdZFre2UoE/maxresdefault.jpg", "publishedAt": "2020-05-06T12:00:07Z", "content": "LBC has taken a look through how the new NHS coronavirus tracing app.\r\nThe app is a key part of the UK's plan to get the country out of lockdown to help track, trace and test people that may have contracted coronavirus.\r\nThe idea is that anyone who has been i… [+1530 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Italy claims first COVID-19 vaccine | Vaccine works on humans - WION", "description": "Italy which is one of the worst affected coronavirus nation has claimed to have successfully developed the coronavirus vaccine to contain the deadly disease....", "url": "https://www.youtube.com/watch?v=X8GCRYl4X4o", "urlToImage": "https://i.ytimg.com/vi/X8GCRYl4X4o/maxresdefault.jpg", "publishedAt": "2020-05-06T11:55:28Z", "content": "Italy which is one of the worst affected coronavirus nation has claimed to have successfully developed the coronavirus vaccine to contain the deadly disease. Watch report.\r\n#ItalyCoronavirusVaccine#CoronavirusVaccine#COVID19Vaccine\r\nAbout Channel:\r\nThe World … [+786 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How are antibody drugs developed? | Race to find a cure for COVID-19 - WION", "description": "Antibody drugs are in the news nowadays and in the absence of a COVID-19 vaccine, they are being doubted as the next best thing. Watch report. #Antibody #Cor...", "url": "https://www.youtube.com/watch?v=dHPbZSgWjok", "urlToImage": "https://i.ytimg.com/vi/dHPbZSgWjok/maxresdefault.jpg", "publishedAt": "2020-05-06T11:34:16Z", "content": null}, {"source": {"id": null, "name": "Thequint.com"}, "author": "Devina Buckshee", "title": "Plasma Therapy: New Hope for COVID-19 or Still Unproven? - The Quint", "description": "Plasma Therapy for Coronavirus: Plasma therapy is not a new option say experts but the ICMR still does not recommend its use outside of clinical trials. Some patients have recovered while others have succumbed under this. Does it work?", "url": "https://fit.thequint.com/coronavirus/plasma-therapy-new-hope-for-covid-19-or-still-unproven", "urlToImage": "https://images.assettype.com/thequint-fit/2020-05/09b5e359-2c43-4da8-9523-63d581a80f75/Hero_Image_3__2_.jpg", "publishedAt": "2020-05-06T11:10:04Z", "content": "All over the world, researchers and healthcare professionals are scrambling to find a way to slow down the novel coronavirus.\r\nOn 20 April, a critical COVID-19 patient in Delhi's max hospital requested to be put on the experimental plasma treatment therapy an… [+567 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Italy claims to develop first COVID-19 vaccine: Here is the current status of all the potential coronavirus vaccines - Times of India", "description": "The world has joined hands to find a vaccine for the novel coronavirus and scientists and medical researchers across the globe are scrambling for the first breakthrough. Since the virus spreads easily and is already overwhelming the healthcare system of most …", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/italy-claims-to-develop-first-covid-19-vaccine-here-is-the-current-status-of-all-the-potential-coronavirus-vaccines/photostory/75575319.cms", "urlToImage": "https://static.toiimg.com/photo/75575349.cms", "publishedAt": "2020-05-06T11:02:21Z", "content": "The malaria drug paved its way to the limelight after reports of Donald Trump requesting India to supply hydroxychloroquine to the US surfaced online. The US President has been backing the malaria drug as a treatment for the novel coronavirus, even though the… [+1159 chars]"}, {"source": {"id": null, "name": "Thecut.com"}, "author": "Madeleine Aggeler", "title": "How Do I Stay Sober Now? - The Cut", "description": "It was two weeks into social distancing that I started craving alcohol again.", "url": "http://www.thecut.com/2020/05/stay-sober-isolation.html", "urlToImage": "https://pyxis.nymag.com/v1/imgs/ef9/08e/74ca24bf0be75a280a31843758c227ba65-sobriety.1x.rsocial.w1200.jpg", "publishedAt": "2020-05-06T11:00:33Z", "content": "By the time I was eight months sober, the version of myself who drank felt like a distant memory. Id think back on her with pity, and a little condescension. Why did I think I needed alcohol to have fun? Id wonder, knowing full well that fun had nothing to do… [+6139 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Candle Light Day; Ugandans asked not to forget fight against HIV - NTVUganda", "description": "Whereas the Country is now focussed on the fight against COVID-19, the Minister of Presidency Esther Mbayo has asked the population not to forget about Sexua...", "url": "https://www.youtube.com/watch?v=T_UtWLVR0PA", "urlToImage": "https://i.ytimg.com/vi/T_UtWLVR0PA/maxresdefault.jpg", "publishedAt": "2020-05-06T10:43:29Z", "content": "Whereas the Country is now focussed on the fight against COVID-19, the Minister of Presidency Esther Mbayo has asked the population not to forget about Sexually Transmitted Diseases. While addressing the Media on the preparations of the celebrations of the Ca… [+313 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Coronavirus Spread Swiftly in Late 2019 and is Now Adapting to Its Human Hosts, Shows Genetic Mutation St... - News18", "description": "A study by scientists at University College London's Genetics Institute found almost 200 recurrent genetic mutations of the new coronavirus - SARS-CoV-2 - which researchers said showed how it may be evolving as it spreads in people.", "url": "https://www.news18.com/news/world/coronavirus-spread-swiftly-in-late-2019-and-is-adapting-to-human-hosts-genetic-mutation-study-2608203.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1588182233_rtx7gbzs.jpg", "publishedAt": "2020-05-06T10:34:39Z", "content": "A genetic analysis of samples from more than 7,500 people infected with COVID-19 suggests the new coronavirus spread quickly around the world late last year and is adapting to its human hosts, scientists said on Wednesday.\r\nA study by scientists at University… [+2650 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Nursing cancer patients during COVID-19 - NEWS CENTER Maine", "description": "Nurses at Northern Light Cancer Care are dealing with physical and emotional changes during the coronavirus pandemic to better protect susceptible patients.", "url": "https://www.youtube.com/watch?v=xewPkvW7jn0", "urlToImage": "https://i.ytimg.com/vi/xewPkvW7jn0/hqdefault.jpg", "publishedAt": "2020-05-06T10:33:09Z", "content": null}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "AP", "title": "With COVID-19 tracing apps comes privacy tradeoffs: Here's why you should be worried - India TV News", "description": "As governments around the world consider how to monitor new coronavirus outbreaks while reopening their societies, many are starting to bet on smartphone apps to help stanch the pandemic.", "url": "https://www.indiatvnews.com/technology/news-with-covid-19-tracing-apps-comes-privacy-tradeoffs-614694", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/05/covid-19-1588760178.jpg", "publishedAt": "2020-05-06T10:32:58Z", "content": "Virus Outbreak Phone Surveillance\r\nAs governments around the world consider how to monitor new coronavirus outbreaks while reopening their societies, many are starting to bet on smartphone apps to help stanch the pandemic. But their decisions on which technol… [+5981 chars]"}, {"source": {"id": null, "name": "Sciencetimes.com"}, "author": "Staff Reporter", "title": "Scientists Found A Way to Disable a Gene Responsible For Obesity: Worry About Getting Too Fat No More? - Science Times", "description": "Despite being fed high-fat diets, a study reveals that by blocking macrophages or inflammatory cells, low-grade inflammation related to obesity could also be controlled. Click the link above to learn more.", "url": "https://www.sciencetimes.com/articles/25592/20200506/scientists-found-way-disable-gene-responsible-obesity-worry-getting-fat.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/27390/mouse.jpg", "publishedAt": "2020-05-06T09:04:03Z", "content": null}, {"source": {"id": null, "name": "France24.com"}, "author": "FRANCE 24", "title": "France records 330 Covid-19 deaths in 24 hours, highest in six days - FRANCE 24 English", "description": "The number of people who died from Covid-19 in France increased by 330 to 25,531 on Tuesday, the sharpest rate of increase in six days, government data showed.", "url": "https://www.france24.com/en/20200505-france-records-330-covid-19-deaths-in-24-hours-highest-in-six-days", "urlToImage": "https://s.france24.com/media/display/792fa434-8ef9-11ea-8064-005056bff430/w:1240/p:16x9/may5-france.JPG", "publishedAt": "2020-05-06T08:35:25Z", "content": "The number of people who died from Covid-19 in France increased by 330 to 25,531 on Tuesday, the sharpest rate of increase in six days, government data showed. \r\n France's health ministry said the number of people in intensive care units fell to 3,430 from 3,… [+1333 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Anushree Gupta", "title": "COVID-19 Treatment: Scientists look to a llama for antibodies against SARS-CoV-2 virus - Times Now", "description": "The researchers chose the llama, as the animal and other animals of the camel family produce standard and smaller antibodies, which help the researchers study them better.", "url": "https://www.timesnownews.com/health/article/covid-19-treatment-scientists-look-to-a-llama-for-antibodies-against-sars-cov-2-virus/587773", "urlToImage": "https://imgk.timesnownews.com/story/llama.PNG?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-06T08:12:44Z", "content": "<ul><li>Researchers have identified a llama, called Winter, to help with antibodies against the novel coronavirus</li><li>Four years ago, the researchers had given the llama safe amounts of the SARS and MERS viruses</li><li>The novel coronavirus is a close co… [+1768 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Salome Phelamei", "title": "Volunteers to be injected with coronavirus as hunt for COVID-19 vaccine heats up: How will it help? - Times Now", "description": "Healthy adults will be injected with the novel coronavirus in an attempt to help speed up the COVID-19 vaccine development process.", "url": "https://www.timesnownews.com/health/article/volunteers-to-be-injected-with-coronavirus-as-hunt-for-covid-19-vaccine-heats-up-how-will-it-help/587751", "urlToImage": "https://imgk.timesnownews.com/story/vaccine-human-trials.gif?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-06T07:48:03Z", "content": "<ul><li>As scientists across the world scramble to find a safe vaccine for COVID-19, healthy adults will be injected with the virus</li><li>The aim of the Human Challenge Trials is to help speed up vaccine development</li><li>Till date, there is no specific t… [+3517 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "Scientists created synthetic novel coronavirus clones - Tech Explorist", "description": "The study shows the full functionality of a yeast-based synthetic genomics platform to genetically reconstruct diverse RNA viruses, including Coronavirus.", "url": "https://www.techexplorist.com/synthetic-novel-coronavirus-clones/32079/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/05/Institute-of-Virology-and-Immunology.jpg", "publishedAt": "2020-05-06T06:54:12Z", "content": "Scientists in virology and veterinary bacteriology at the University of Bern have reconstructed the clones of a novel coronavirus from synthetic DNA. The synthetic clones are being used by research groups worldwide to test corona samples, find antiviral drugs… [+1519 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Coronavirus Outbreak: 100 years later, we are staring at another pandemic, with masks on and no vaccine... - Firstpost", "description": "Conspiracy theorists have blamed COVID-19 on the development of 5G networks, just as they say radio waves caused the 1918 flu.", "url": "https://www.firstpost.com/health/coronavirus-outbreak-100-years-later-we-are-staring-at-another-pandemic-with-masks-on-and-no-vaccine-in-sight-8337091.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/05/screencapture-headtopics-images-2020-3-31-el-pais-lecciones-de-1918-las-ciudades-que-adelantaron-el-distanciamiento-social-crecieron-m-s-tras-la-pand-1244754864804110337-webp-2020-05-06-11_13_21.jpg", "publishedAt": "2020-05-06T05:55:55Z", "content": null}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "New York reports 15 child cases of rare disease linked to COVID-19 - CGTN", "description": "Fifteen children have been hospitalized in New York with a rare inflammatory disease possibly linked to coronavirus, officials said Tuesday, in the latest reports of the worrying syndrome.", "url": "https://news.cgtn.com/news/2020-05-06/New-York-reports-15-child-cases-of-rare-disease-linked-to-COVID-19-QgJB9eQCTS/index.html", "urlToImage": "https://news.cgtn.com/news/3159444e78516a4e3245444f3341444e3367444f31457a6333566d54/img/116bb014d0d6484391ccb1e798ef6502/116bb014d0d6484391ccb1e798ef6502-1.png", "publishedAt": "2020-05-06T05:31:42Z", "content": "Fifteen children have been hospitalized in New York with a rare inflammatory disease possibly linked to coronavirus, officials said Tuesday, in the latest reports of the worrying syndrome.\r\nKawasaki disease is a mysterious illness that primarily affects child… [+1592 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Swagata Yadavar", "title": "Why the small pulse oximeter is becoming a major tool for doctors in Covid-19 crisis - ThePrint", "description": "A relatively small medical device that clips on to a patient's finger, the oximeter can measure one of the five vital pulmonary signs.", "url": "https://theprint.in/health/why-the-small-pulse-oximeter-is-becoming-a-major-tool-for-doctors-in-covid-19-crisis/414646/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/05/pulse-oximeter.jpg", "publishedAt": "2020-05-06T04:32:08Z", "content": "New Delhi: When a 22-year-old heavily pregnant Covid-19 patient had difficulty in breathing, doctors at Jaipur’s Rajasthan University of Health Sciences (RUHS) had to first figure out whether it was due to her pregnancy or the disease.\r\nAn X-ray could have re… [+4661 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Scientific Studies Show Drinking Green Tea May Help You Lose Weight - SciTechDaily", "description": "In an analysis of randomized controlled trials, individuals who consumed green tea experienced a significant decline in body weight and body mass index. On the other hand, the analysis did not show any significant change in terms of waist circumference (a mea…", "url": "https://scitechdaily.com/scientific-studies-show-drinking-green-tea-may-help-you-lose-weight/", "urlToImage": "https://scitechdaily.com/images/Weight-Loss-Scale-Concept.jpg", "publishedAt": "2020-05-06T04:00:46Z", "content": "In an analysis of randomized controlled trials, individuals who consumed green tea experienced a significant decline in body weight and body mass index. On the other hand, the analysis did not show any significant change in terms of waist circumference (a mea… [+421 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "New York Times", "title": "New studies add to evidence that children may transmit the coronavirus - Economic Times", "description": "While children were about a third as susceptible to coronavirus infection as adults are, with schools open, the former are likely to have about three times as many contacts as adults and three times as many opportunities to become infected, essentially evenin…", "url": "https://economictimes.indiatimes.com/news/international/world-news/new-studies-add-to-evidence-that-children-may-transmit-the-coronavirus/articleshow/75567276.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75567268,width-1070,height-580,imgsize-823259,overlay-economictimes/photo.jpg", "publishedAt": "2020-05-06T03:13:19Z", "content": "By Apoorva MandavilliAmong the most important unanswered questions about COVID-19 is this: What role do children play in keeping the pandemic going?\r\nThe answer is key to deciding whether and when to reopen schools, a step that President Donald Trump urged st… [+1887 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Coronavirus Outbreak: Noida, Greater Noida impose fines of up to Rs 1,000 for spitting in public places - Firstpost", "description": "Spitting saliva, gutka, or tobacco in public places across Noida and Greater Noida has been prohibited and violation of this ban can attract a penalty of Rs 500 for first-time offenders and Rs 1,000 for repeat offenders, according to orders issued to contain …", "url": "https://www.firstpost.com/health/coronavirus-outbreak-noida-greater-noida-impose-fines-of-up-to-rs-1000-for-spitting-in-public-places-8336601.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/03/coronavirus_Hyderabad_PTI_1280.jpg", "publishedAt": "2020-05-06T03:08:04Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Associated Press | Posted by: Shankhyaneel Sarkar", "title": "US infection rate rising outside New York as states open up - Hindustan Times", "description": "Britain’s official coronavirus death toll, at more than 29,000, topped that of Italy to become the highest in Europe and second-highest in the world behind the United States.", "url": "https://www.hindustantimes.com/world-news/us-infection-rate-rising-outside-new-york-as-states-open-up/story-ccN3D3niEkZ4hRRvhU9aHI.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/06/Pictures/coronavirus-brooklyn-temporary-disease-national-outbreak-soldier_d6d07fac-8f42-11ea-8c4e-d383a7371370.jpg", "publishedAt": "2020-05-06T02:57:47Z", "content": "Take the New York metropolitan area’s progress against the coronavirus out of the equation and the numbers show the rest of the US is moving in the wrong direction, with the known infection rate rising even as states move to lift their lockdowns, an Associate… [+6714 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "COVID-19 patients and blood clots: Are blood thinners enough? - WGN News", "description": "The more doctors study SARS-CoV-2, the more they realize it not only makes it difficult to breathe, it makes the blood clot. Now, the finding is driving a ch...", "url": "https://www.youtube.com/watch?v=NIeXq5q1pRs", "urlToImage": "https://i.ytimg.com/vi/NIeXq5q1pRs/maxresdefault.jpg", "publishedAt": "2020-05-06T00:21:28Z", "content": "The more doctors study SARS-CoV-2, the more they realize it not only makes it difficult to breathe, it makes the blood clot.Now, the finding is driving a change in the approach to treatment."}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "BBC News", "title": "Coronavirus: How long does it take to recover? - BBC News", "description": "Weeks, months, even a year - we look at the factors that can affect the time taken to get better.", "url": "https://www.bbc.co.uk/news/av/health-52508831/coronavirus-how-long-it-takes-to-recover", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/12A57/production/_112157367_p08ccd69.jpg", "publishedAt": "2020-05-06T00:07:33Z", "content": null}, {"source": {"id": null, "name": "Thelancet.com"}, "author": null, "title": "SARS-CoV-2 and influenza virus co-infection - The Lancet", "description": "Since December, 2019, coronavirus disease 2019 (COVID-19) has been an international\npublic health emergency.1–3 Severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2)\nmimics the influenza virus regarding clinical presentation, transmission mechanism,\nan…", "url": "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)31052-7/fulltext", "urlToImage": null, "publishedAt": "2020-05-05T22:34:57Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. By continuing you agree to the use of cookies.\r\nCopyright © 2020 Elsevier Inc. except certain content provided by third parties.\r\nPrivacy Policy   Terms and Conditions"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "Vegans, Vegetarians Tend to Have Poorer Mental Health Than Meat Eaters, Study Finds - Sputnik International", "description": "A new meta-analysis examining the link between the consumption or avoidance of meat and psychological health and well-being has found that a majority of studies...", "url": "https://sputniknews.com/society/202005051079207929-those-with-vegan-vegetarian-diets-tend-to-have-poorer-mental-health-than-meat-eaters---study/", "urlToImage": "https://cdn1.img.sputniknews.com/images/107920/78/1079207878.jpg", "publishedAt": "2020-05-05T22:33:57Z", "content": "A new meta-analysis examining the link between the consumption or avoidance of meat and psychological health and well-being has found that a majority of studies observed showed an association between abstention from eating meat and poorer psychological health… [+2090 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Oliver O'Connell", "title": "I thought I'd misheard my doctor when she asked if I had 'Covid toes' — but this weird new coronavirus symptom is real - The Independent", "description": "Most of those with 'Covid toes' do not know they've been exposed to coronavirus and have no other symptoms", "url": "https://www.independent.co.uk/voices/covid-toes-coronavirus-symptoms-feet-testing-a9500736.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/04/30/16/istock-989387872-0.jpg", "publishedAt": "2020-05-05T22:17:07Z", "content": "In a recent discussion about Covid-19 with a medical professional, she asked me about any changes in the appearance of my toes. Initially, I thought I'd misheard her.\r\nUnderstandably confused, I asked why. Was this a symptom of coronavirus I hadn't yet heard … [+2107 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Bloomberg", "title": "A vet detective squad is preparing for the next pandemic - Livemint", "description": "As the coronavirus death toll surpasses 250,000 and the world scrambles to find a vaccine, a new scientific taskforce is headed to the wilderness to try and stop the next pandemic", "url": "https://www.livemint.com/news/world/a-vet-detective-squad-is-preparing-for-the-next-pandemic-11588707603546.html", "urlToImage": "https://images.livemint.com/img/2020/05/05/600x338/straydogs--621x414_1588709097731.jpg", "publishedAt": "2020-05-05T20:07:40Z", "content": "SYDNEY :\r\nAs the coronavirus death toll surpasses 250,000 and the world scrambles to find a vaccine, a new scientific taskforce is headed to the wilderness to try and stop the next pandemic.After decades of patchy global investment into researching the linkag… [+4592 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": "Marta Rodriguez Martinez", "title": "Malaria breakthrough as scientists find microbe 'that can stop' mosquitoes spreading deadly disease - Euronews", "description": "As the world scrambles to find a COVID-19 vaccine, this is a rare bit of good news.", "url": "https://www.euronews.com/2020/05/05/malaria-breakthrough-as-scientists-find-microbe-that-can-stop-mosquitoes-spreading-deadly", "urlToImage": "https://static.euronews.com/articles/stories/04/66/80/08/1000x563_cmsv2_97ff9c14-49f3-54fa-9d0a-ae690705d512-4668008.jpg", "publishedAt": "2020-05-05T19:46:37Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Record number of Illinois deaths from COVID-19 announced in single day, at 176 in 24 hours - Eyewitness News WTVO WQRF", "description": "Record number of Illinois deaths from COVID-19 announced in single day, at 176 in 24 hours", "url": "https://www.youtube.com/watch?v=rkrss-OMWwQ", "urlToImage": "https://i.ytimg.com/vi/rkrss-OMWwQ/maxresdefault.jpg", "publishedAt": "2020-05-05T19:45:24Z", "content": null}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Dr. Kamal Kant Kohli", "title": "Heating best method for disinfection of N95 masks, finds study - Medical Dialogues", "description": "Researchers have revealed  that heating was recently found to inactivate the coronavirus in solution ...", "url": "https://medicaldialogues.in/medicine/news/heating-best-method-for-disinfecting-n95-masks-finds-study-65499", "urlToImage": "https://medicaldialogues.in/h-upload/2020/04/20/127516-mask-1.jpg", "publishedAt": "2020-05-05T18:30:00Z", "content": "Researchers have revealed that heating was recently found to inactivate the coronavirus in solution within 5 min at 70 °C and is among the most scalable, user-friendly methods for viral disinfection of N 95 masks. Heating them preserves their filtration effic… [+2423 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Anuradha Mascarenhas", "title": "Epidemiological modelling indicates COVID-19 pandemic may recede in July if transmission is low - The Indian Express", "description": "The IISER Kolkata model also indicates that if a national lockdown was not implemented, India could have faced a catastrophic pandemic, rivaling and probably exceeding the worst-hit nations.", "url": "https://indianexpress.com/article/cities/pune/epidemiological-modelling-indicates-covid-19-pandemic-may-recede-in-july-if-transmission-is-low-6395640/", "urlToImage": "https://images.indianexpress.com/2020/04/doctor-5.jpg?w=759", "publishedAt": "2020-05-05T18:03:58Z", "content": "The IISER team consisted of scientists Dibyendu Nandi, Ayan Banerjee, Rajesh Nayak, PhD students Shaonwita Pal, Soumyaranjan Dash, and undergraduate students Agnibha Banerjee and Vishal Singh.The results of a new epidemiological modelling, released by researc… [+2938 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Lifestyle Desk", "title": "Avoid these foods if you have asthma; here’s why - The Indian Express", "description": "World Asthma Day 2020: People suffering from the condition should avoid foods with preservatives.", "url": "https://indianexpress.com/article/lifestyle/health/world-asthma-day-foods-to-avoid-6395091/", "urlToImage": "https://images.indianexpress.com/2020/05/asthma-759-getty.jpg?w=759", "publishedAt": "2020-05-05T16:14:08Z", "content": "Ongoing research suggests diet plays an important role in controlling asthma. (Source: Getty Images)World Asthma Day: Apart from environmental factors like inhaled allergens, exposure to smoke or pollution, and also genetic susceptibility, diet plays an impor… [+2661 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "CORONAVIRUS: Vaccines in Clinical Trials - VOA News", "description": "How Close Are We to a COVID-19 Vaccine? In the race for a vaccine to end the global COVID-19 pandemic, eight contenders are at the front of the pack. These e...", "url": "https://www.youtube.com/watch?v=f1cdReL5Gs4", "urlToImage": "https://i.ytimg.com/vi/f1cdReL5Gs4/maxresdefault.jpg", "publishedAt": "2020-05-05T15:54:47Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus pandemic | Hepatitis C drugs may help fight COVID-19, supercomputer simulations suggest - Moneycontrol", "description": "Researchers found that compounds from the four hepatitis C drugs have high affinity to bind SARS-CoV-2 very strongly and may, therefore, be able to prevent infection.", "url": "https://www.moneycontrol.com/news/coronavirus/coronavirus-pandemic-hepatitis-c-drugs-may-help-fight-covid-19-supercomputer-simulations-suggest-5224991.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2017/10/ebola-e1545189642153-770x433.jpg", "publishedAt": "2020-05-05T14:49:00Z", "content": "Several drugs approved for the treatment of hepatitis C viral infection have been identified as potential candidates against COVID-19 caused by the SARS-CoV-2 coronavirus, according to a study based on extensive calculations using supercomputer simulations.\r\n… [+2242 chars]"}, {"source": {"id": null, "name": "Tweaktown.com"}, "author": "Jak Connor", "title": "This coronavirus symptom nobody is talking about can't be explained - TweakTown", "description": "A new coronavirus complication has been found and doctors can't explain why it's happening", "url": "https://www.tweaktown.com/news/72259/this-coronavirus-symptom-nobody-is-talking-about-cant-be-explained/index.html", "urlToImage": "https://images.tweaktown.com/news/7/2/72259_01_doctors-discovered-bizarre-new-coronavirus-complication-that-no-one_full.jpg", "publishedAt": "2020-05-05T14:39:24Z", "content": "The longer we experience the coronavirus, the more understanding we develop on how it works and how it affects people. Yet, there are still some things about a COVID-19 infection that are still confusing doctors, and here's one of them.\r\nIt's called \"happy hy… [+1504 chars]"}, {"source": {"id": null, "name": "Nih.gov"}, "author": null, "title": "NIH Statement on World Asthma Day 2020 | National Institutes of Health - National Institutes of Health", "description": "Asthma is a chronic lung disease that causes periods of wheezing, chest tightness, shortness of breath, and coughing.", "url": "https://www.nih.gov/news-events/news-releases/nih-statement-world-asthma-day-2020", "urlToImage": "https://www.nih.gov/sites/default/files/news-events/news-releases/2020/20200505-asthma.jpg", "publishedAt": "2020-05-05T14:21:04Z", "content": null}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "This necklace can figure out irregular heartbeat: Know how this works - India TV News", "description": "Researchers have developed a necklace to detect atrial fibrillation, which is can lead to serious heart issues", "url": "https://www.indiatvnews.com/technology/news-necklace-by-researchers-to-detect-irregular-heartbeats-like-apple-watch-see-how-614444", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/05/apple-watch-series-5-1588686539.jpg", "publishedAt": "2020-05-05T14:00:46Z", "content": "Apple Watch Series 5\r\nResearchers have developed an ingenious necklace which detects abnormal heart rhythm called atrial fibrillation (AFib), an irregular heartbeat that can lead to serious complications such as stroke, heart failure and heart attacks. One of… [+2802 chars]"}, {"source": {"id": null, "name": "Healthline.com"}, "author": null, "title": "Is Sour Cream Keto-Friendly? - Healthline", "description": "Many dairy products are off-limits on the very low carb, high fat keto diet. This article reviews whether sour cream is keto-friendly.", "url": "https://www.healthline.com/nutrition/is-sour-cream-keto", "urlToImage": "https://post.healthline.com/wp-content/uploads/2020/05/ranch-sour-cream-dip-1200x628-facebook-1200x628.jpg", "publishedAt": "2020-05-05T13:37:41Z", "content": "When it comes to choosing foods for a keto diet, fat is where it’s at.\r\nKeto is short for a ketogenic diet — a high fat, very low carb eating pattern that forces your body to use fat for fuel instead of glucose.\r\nThe first rule of keto is to keep your carbs v… [+5693 chars]"}, {"source": {"id": null, "name": "Wionews.com"}, "author": "WION Web Team", "title": "Scientists spar over new report that recommends widespread use of face masks to stem coronavirus transmission - WION", "description": "The recommendation contrasts to the standard use of masks for the protection of wearers, suggesting face coverings could stymie transmission in symptomless carriers.", "url": "https://www.wionews.com/world/scientists-spar-over-new-report-that-recommends-widespread-use-of-face-masks-to-stem-coronavirus-transmission-296759", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/03/14/132970-0001pv479.jpg", "publishedAt": "2020-05-05T13:35:06Z", "content": "A new report advocating the widespread use of face masks to prevent coronavirus transmissions has become the bone of contention among scientists.\r\nAccording to Delve's -- a multi-disciplinary group convened by the Royal Society report, published on Monday, fa… [+2205 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus Can Cause Damaging Blood Clots From Brain to Toes - Bloomberg Markets and Finance", "description": "May.05 -- Another threat from the lung virus that causes Covid-19 has emerged that may cause swift, sometimes fatal damage: blood clots. Doctors around the w...", "url": "https://www.youtube.com/watch?v=fisAtZc2BzY", "urlToImage": "https://i.ytimg.com/vi/fisAtZc2BzY/hqdefault.jpg", "publishedAt": "2020-05-05T12:33:59Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus pandemic: Pregnant women refused care over poor quality PPEs - CitiTube", "description": "Some pregnant women who visited the Kaneshie Polyclinic have been denied health care services due to poor PPEs available for health workers. #CitiNewsroom #C...", "url": "https://www.youtube.com/watch?v=gkcctAbowZ4", "urlToImage": "https://i.ytimg.com/vi/gkcctAbowZ4/maxresdefault.jpg", "publishedAt": "2020-05-05T11:44:37Z", "content": null}, {"source": {"id": null, "name": "Thequint.com"}, "author": "FIT", "title": "Israel Isolates Antibody That Can ‘Neutralise’ the Coronavirus - The Quint", "description": "COVID-19 Treatment: In a “significant breakthrough”, Israel has successfully isolated a coronavirus antibody that can counterbalance the virus in the patient’s body. The statement released by the defense minister added that when he visited  (IIBR)", "url": "https://fit.thequint.com/health-news/israel-isolates-antibody-that-can-neutralise-the-coronavirus", "urlToImage": "https://images.assettype.com/thequint-fit/2020-05/6d659c81-b97c-449a-b5bb-372d9ef86d74/iStock_1200706447.jpg", "publishedAt": "2020-05-05T11:30:15Z", "content": "In a \"significant breakthrough\", Israel has successfully isolated a coronavirus antibody that can counterbalance the virus in a patient's body.\r\nIsrael's defence minister on Monday, 4 May said, Monoclonal neutralising antibody can neutralise COVID-19 inside c… [+44 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "Indian-origin scientist identifies four possible drugs to treat coronavirus - Livemint", "description": "An Indian-origin researcher in the US and his team have identified four antiviral drugs, including remdesivir.The researchers noted that SARS-CoV-2 that causes COVID-19, like all viruses, can mutate and develop resistance to antiviral drugs", "url": "https://www.livemint.com/news/india/indian-origin-scientist-identifies-four-possible-drugs-to-treat-coronavirus-11588676441854.html", "urlToImage": "https://images.livemint.com/img/2020/05/05/600x338/6b2079b03c83406f865b3371ceac01e8-6b2079b03c83406f865b3371ceac01e8-1_1588586637999_1588677539086.jpg", "publishedAt": "2020-05-05T11:20:38Z", "content": "Washington: An Indian-origin researcher in the US and his team have identified four antiviral drugs -- including remdesivir that was originally developed to treat Ebola -- which may be effective in inhibiting the replication of the novel coronavirus that caus… [+1765 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Reuters", "title": "France’s early COVID-19 case may hold clues to pandemic’s start - The Indian Express", "description": "The results, published in the International Journal of Antimicrobial Agents, showed that one patient - a 42-year-old man born in Algeria, who had lived in France for many years and worked as a fishmonger - was infected with COVID-19 “one month before the firs…", "url": "https://indianexpress.com/article/world/france-covid-19-coronavirus-pandemic-6395102/", "urlToImage": "https://images.indianexpress.com/2020/05/France-Coronavirus-759.jpg?w=759", "publishedAt": "2020-05-05T11:19:38Z", "content": "By: Reuters | London | \r\nUpdated: May 5, 2020 4:43:06 pm\r\nFILE- In this file photo dated Monday, May 4, 2020, a statue wears a mask along Trocadero square close to the Eiffel Tower in Paris. (File)A study by French scientists which suggests a man was infected… [+2818 chars]"}, {"source": {"id": null, "name": "Undark.org"}, "author": null, "title": "Covid-19 Reignites a Contentious Debate Over Bats and Disease - Undark Magazine", "description": "Bats’ special relationship with viruses has attracted both awe from scientists and hatred from those who fear disease.", "url": "https://undark.org/2020/05/05/covid-19-bats/", "urlToImage": "https://undark.org/wp-content/uploads/2020/04/geoff-brooks-TomNEOzcGWk-unsplash.jpg", "publishedAt": "2020-05-05T09:42:31Z", "content": "In the past few months, Arinjay Banerjee has gotten an unexpected taste of Internet fame.\r\nSince December, when news of Covid-19 began to shudder across the world, Banerjee who studies the immune systems of bats at McMaster University in Ontario, Canada has p… [+13010 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Angana Chakrabarti", "title": "JNU prof says he was first to suggest BCG vaccine trials for Covid-19 but was ‘turned down’ - ThePrint", "description": "Professor Gobardhan Das said he had emailed Health Minister Dr Harsh Vardhan and the ICMR with the suggestion in March. Govt announced the trials in mid-April.", "url": "https://theprint.in/health/jnu-prof-says-he-was-first-to-suggest-bcg-vaccine-trials-for-covid-19-but-was-turned-down/414790/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/05/JNUprof.jpg", "publishedAt": "2020-05-05T09:38:24Z", "content": "New Delhi: A professor of Jawaharlal Nehru University (JNU) has claimed he was the first to propose the idea of conducting clinical trials of anti-leprosy and anti-tuberculosis vaccines, which began last month, to see if they can prevent Covid-19, but was tur… [+3269 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Kabir Firaque", "title": "Explained: How remdesivir tricks coronavirus - The Indian Express", "description": "Remdesivir is designed to obstruct the stage of replication, when the virus creates copies of itself, followed endlessly by the copies creating copies of themselves.", "url": "https://indianexpress.com/article/explained/how-remdesivir-tricks-the-coronavirus-6392255/", "urlToImage": "https://images.indianexpress.com/2020/05/drugs.jpg?w=759", "publishedAt": "2020-05-05T08:46:19Z", "content": "Written by Kabir Firaque\r\n | New Delhi | \r\nUpdated: May 5, 2020 2:11:57 pm\r\nRubber stoppers are placed onto filled vials of the investigational drug remdesivir at a Gilead manufacturing site in the United States. (Gilead Sciences via AP)In all the debate over… [+3844 chars]"}, {"source": {"id": null, "name": "Foodnavigator.com"}, "author": "foodnavigator.com", "title": "Food agency stresses vitamin D intake in lockdown: 'Our immune defences might need to work particularly hard' - FoodNavigator.com", "description": "With fewer hours spent in the sun due to COVID-19 lockdown, vitamin D levels are at risk of falling. So what can consumers eat to help ensure sufficient intake? ANSES weighs in.", "url": "https://www.foodnavigator.com/Article/2020/05/05/Food-agency-stresses-vitamin-D-intake-in-lockdown-Our-immune-defences-might-need-to-work-particularly-hard", "urlToImage": "https://cdn-a.william-reed.com/var/wrbm_gb_food_pharma/storage/images/publications/food-beverage-nutrition/foodnavigator.com/news/food-safety-quality/food-agency-stresses-vitamin-d-intake-in-lockdown-our-immune-defences-might-need-to-work-particularly-hard/10966685-1-eng-GB/Food-agency-stresses-vitamin-D-intake-in-lockdown-Our-immune-defences-might-need-to-work-particularly-hard.jpg", "publishedAt": "2020-05-05T08:42:00Z", "content": "ANSES, the French Agency for Food, Environmental and Occupational Health and Safety, has stressed the importance of adequate vitamin D intake all year round.\r\nHowever, during lockdown, the food safety agency suggests sufficient vitamin D intake is of particul… [+2848 chars]"}, {"source": {"id": null, "name": "Medicalxpress.com"}, "author": "Science X staff", "title": "Strenuous exercise safe for people at high risk of knee arthritis - Medical Xpress", "description": "People at high risk for knee osteoarthritis (OA) may be nervous and reluctant to participate in strenuous physical activities such as jogging, cycling, singles tennis and skiing. But a new Northwestern Medicine study that followed high-risk individuals for 10…", "url": "https://medicalxpress.com/news/2020-05-strenuous-safe-people-high-knee.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/knee.jpg", "publishedAt": "2020-05-05T07:43:56Z", "content": "People at high risk for knee osteoarthritis (OA) may be nervous and reluctant to participate in strenuous physical activities such as jogging, cycling, singles tennis and skiing. But a new Northwestern Medicine study that followed high-risk individuals for 10… [+4214 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "ANI", "title": "COVID-19: Zydus Cadila seeks DCGI’s approval for clinical trial of hepatitis drug ‘PegiHep’ - Times Now", "description": "Pegylated Interferon Alpha-2b used for treating Hepatitis B and C has been tried on COVID-19 patients in China and Cuba and is a part of the treatment guidelines of the Chinese government.", "url": "https://www.timesnownews.com/health/article/covid19-zydus-cadila-seeks-dcgis-approval-for-clinical-trial-of-hepatitis-drug-pegihep/587177", "urlToImage": "https://imgk.timesnownews.com/story/coorna-drug.gif?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-05T06:27:05Z", "content": "New Delhi: The country's top drug regulator, Drug Controller General of India (DCGI), has received an application from Zydus Cadila, the leading global pharmaceutical company in India, to conduct clinical trial using antiviral drug 'Pegylated Interferon Alpha… [+2312 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "AFP", "title": "Doctor who treated first US coronavirus patient fears second wave - Deccan Herald", "description": "The doctor who treated the first COVID-19 patient in the United States said Monday he fears a second outbreak of the coronavirus disease when lockdown measures are lifted. Track live updates on coronavirus here", "url": "https://www.deccanherald.com/international/doctor-who-treated-first-us-coronavirus-patient-fears-second-wave-833715.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/05/iStock-1209873947-1588658849.jpg", "publishedAt": "2020-05-05T05:43:01Z", "content": "The doctor who treated the first COVID-19 patient in the United States said Monday he fears a second outbreak of the coronavirus disease when lockdown measures are lifted.\r\nTrack live updates on coronavirus here\r\nGeorge Díaz's first patient, diagnosed in Janu… [+1680 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Bloomberg", "title": "Coronavirus causes blood clots harming organs from brain to toes - The Indian Express", "description": "Doctors around the world are noting a raft of clotting-related disorders -- from benign skin lesions on the feet sometimes called “Covid toe” to life-threatening strokes and blood-vessel blockages.", "url": "https://indianexpress.com/article/world/coronavirus-causes-blood-clots-harming-organs-from-brain-to-toes-6394279/", "urlToImage": "https://images.indianexpress.com/2020/05/361778720.jpg?w=759", "publishedAt": "2020-05-05T02:23:01Z", "content": "By: Bloomberg | \r\nPublished: May 5, 2020 7:25:28 am\r\nDoctors treat Covid-19 patients in an intensive care unit at a Hospital in Rome, Italy on March 26.Another threat from the lung virus that causes Covid-19 has emerged that may cause swift, sometimes fatal d… [+6516 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Salome Phelamei", "title": "Should asthma patients stop taking steroid inhalers during COVID-19 crisis? A pulmonologist clarifies - Times Now", "description": "On the occasion of World Asthma Day, Times Now Digital talked to a pulmonologist to find out whether the coronavirus disease poses a higher risk for people with asthma.", "url": "https://www.timesnownews.com/health/article/should-asthma-patients-stop-taking-steroid-inhalers-during-covid-19-crisis-a-pulmonologist-clarifies/587070", "urlToImage": "https://imgk.timesnownews.com/story/asthma-inhaler.gif?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-05T02:21:59Z", "content": "<ul><li>Experts say people with moderate to severe asthma may be at higher risk of severe illness from coronavirus infection</li><li>Is coronavirus infection more dangerous for people with asthma?</li><li>Here's what asthmatics need to know about the COVID-19… [+2911 chars]"}, {"source": {"id": null, "name": "Sciencealert.com"}, "author": "AmÉlie Bottollier-Depois, AFP", "title": "Genetic Study Shows COVID-19 Was in France Weeks Before The First Case Was Reported - ScienceAlert", "description": "China reported its first cases of the new coronavirus in December. But was COVID-19 already silently circulating? To find out scientists are looking for \"patient zeros\" by tracking the evolution of the virus itself.", "url": "https://www.sciencealert.com/genetic-investigation-reveals-covid-19-was-circulating-in-europe-before-cases-were-reported", "urlToImage": "https://www.sciencealert.com/images/2020-05/processed/nil-castellvi-ZG5_505mUog-unsplash_1_1024.jpg", "publishedAt": "2020-05-05T01:52:17Z", "content": "China reported its first cases of the new coronavirus in December. But was COVID-19 already silently circulating? To find out scientists are looking for \"patient zeros\" by tracking the evolution of the virus itself.\r\nThis genetic detective work is tracing the… [+4829 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WHO on 'powerful' vaccine unity, US virus claims - Associated Press", "description": "The World Health Organization talks about vaccine to battle COVID-19 and US claims that the virus began in a laboratory in the Chinese city of Wuhan. (May 4)...", "url": "https://www.youtube.com/watch?v=JFnEnAC1wWI", "urlToImage": "https://i.ytimg.com/vi/JFnEnAC1wWI/maxresdefault.jpg", "publishedAt": "2020-05-04T20:09:16Z", "content": null}, {"source": {"id": null, "name": "Gulfnews.com"}, "author": "Bloomberg", "title": "Scientists create antibody that defeats coronavirus in lab - Gulf News", "description": "Experimental antibody has neutralized the virus in cell cultures", "url": "https://gulfnews.com/world/europe/scientists-create-antibody-that-defeats-coronavirus-in-lab-1.1588612370821", "urlToImage": "https://imagevars.gulfnews.com/2020/05/04/antibody-coronavirus-generic_171e0b3e685_medium.jpg", "publishedAt": "2020-05-04T17:04:50Z", "content": "Image Credit: Shutterstock\r\nScientists created a monoclonal antibody that can defeat the new coronavirus in the lab, an early but promising step in efforts to find treatments and curb the pandemic's spread.\r\nThe experimental antibody has neutralized the virus… [+2124 chars]"}, {"source": {"id": null, "name": "Webmd.com"}, "author": "Carolyn  Crist", "title": "Two More Years of COVID-19 Pandemic Likely Pandemic experts predict that the coronavirus will likely - WebMD", "description": "Pandemic experts predict that the coronavirus will likely spread for the next 2 years and infect up to 70% of the population.", "url": "https://www.webmd.com/lung/news/20200504/two-more-years-of-covid-19-pandemic-likely", "urlToImage": "https://img.webmd.com/dtmcms/live/webmd/consumer_assets/site_images/article_thumbnails/other/coronavirus_madmicrobe_studios/1800x1200_madmicrobe_rf_coronavirus_1.jpg", "publishedAt": "2020-05-04T16:59:16Z", "content": "May 4, 2020 - Today in the world of coronavirus news \r\nThe coronavirus will likely spread for the next 18-24 months and infect up to 70% of the population, several pandemic experts said in a new report.\r\nEven in a best-case scenario, people will continue to d… [+1937 chars]"}]}