{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "CDC Adds Six New COVID-19 Symptoms - Newsy", "description": "Previously, only fever, shortness of breath and coughing were listed as symptoms for the coronavirus. Now, there are 6 new symptoms to look out for. Learn mo...", "url": "https://www.youtube.com/watch?v=naWLq3SVnLM", "urlToImage": null, "publishedAt": "2020-04-26T16:24:50Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Wuhan's L-strain may be behind Gujarat's high death rate: Experts - Times of India", "description": "India News: The high Covid-19 mortality rate in Gujarat could be due to the dominance of the L-type strain of coronavirus, found to have been more prevalent in Wu", "url": "https://timesofindia.indiatimes.com/india/wuhans-l-strain-may-be-behind-gujs-high-death-rate-experts/articleshow/75390504.cms", "urlToImage": null, "publishedAt": "2020-04-26T15:57:27Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Mink found to have coronavirus on two Dutch farms: ministry - Reuters India", "description": "Two mink farms in the Netherlands have been put into quarantine after animals were found to be infected with the new coronavirus, the agriculture ministry said on Sunday, urging people to report any other likely cases in the animals.", "url": "https://in.reuters.com/article/health-coronavirus-netherlands-mink-idINKCN2280K2", "urlToImage": null, "publishedAt": "2020-04-26T15:35:00Z", "content": "AMSTERDAM (Reuters) - Two mink farms in the Netherlands have been put into quarantine after animals were found to be infected with the new coronavirus, the agriculture ministry said on Sunday, urging people to report any other likely cases in the animals. \r\nT… [+1489 chars]"}, {"source": {"id": null, "name": "Theferret.scot"}, "author": "https://www.facebook.com/theferret.scot/", "title": "Claim that the first person to receive the Covid-19 trial vaccine has died is False - The Ferret", "description": "Ferret Fact Service looks at a claim that the first person who participated in the Oxford University vaccine trial has died.", "url": "https://theferret.scot/vaccine-trial-oxford-elisa-granato-fact-check/", "urlToImage": null, "publishedAt": "2020-04-26T15:06:46Z", "content": "News reports and a number of social media posts claimed that the first person to participate in the Oxford University trial testing a new coronavirus vaccine had died.\r\nA news website called News NT published a story suggesting Dr Elisa Granato had died two d… [+2131 chars]"}, {"source": {"id": null, "name": "Scoopwhoop.com"}, "author": "Priyanka Aggarwal", "title": "Covid-19 Might Not Be The Last Pandemic We'll Face - ScoopWhoop", "description": "May it be Spanish Flu, Yellow fever, SARS, MERS, Plague or HIV, there have been constant viruses that have been spreading from one country to another.", "url": "https://www.scoopwhoop.com/news/covid-19-might-not-be-the-last-pandemic-we-face/", "urlToImage": null, "publishedAt": "2020-04-26T14:06:55Z", "content": "While we all are sitting at home waiting for achhe din when well be able to get out of our houses and live a normal life, the epidemiologists fear about our near future. \r\nPandemics have been something that has been recurring. May it be Spanish Flu, Yellow fe… [+2995 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Trials of Mw vaccine for treatment of Covid-19 patients to be initiated soon: PGIMER Chandigarh - India Today", "description": "In a recently concluded multi-center trial, it has been found that Mw reduces mortality in ICU patients with severe sepsis.", "url": "https://www.indiatoday.in/india/story/trials-of-mw-vaccine-for-treatment-of-covid-19-patients-to-be-initiated-soon-pgimer-chandigarh-1671370-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T13:13:57Z", "content": "The Mycobacterium w (Mw) vaccine is not a vaccine for Covid-19 and will be used only as an adjunct, said experts at the Postgraduate Institute of Medical Education and Research (PGIMER) in Chandigarh. The facility was among three premier health institutions, … [+1774 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Daniel BOSQUE", "title": "Why has Spain been hit so hard by the coronavirus pandemic? - Yahoo News", "description": "In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, e...", "url": "https://news.yahoo.com/why-spain-hit-hard-coronavirus-pandemic-071133079.html", "urlToImage": null, "publishedAt": "2020-04-26T12:11:51Z", "content": "Barcelona (AFP) - In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told AFP.\r\nWhile they stressed it was too early to carry out a detailed analy… [+4456 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "New York Times", "title": "Coronavirus antibody tests: Can you trust the results? - Times of India", "description": "The researchers worked around the clock, in shifts of three to five hours, hoping to stave off weariness and keep t", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-antibody-tests-can-you-trust-the-results/articleshow/75387833.cms", "urlToImage": null, "publishedAt": "2020-04-26T11:41:54Z", "content": "The researchers worked around the clock, in shifts of three to five hours, hoping to stave off weariness and keep their minds sharp for the delicate task.\r\nThey set up lines of laboratory volunteers: medical residents, postdoctoral students, even experienced … [+11078 chars]"}, {"source": {"id": null, "name": "Un.org"}, "author": null, "title": "Millions more children at risk with immunization services disrupted amid COVID-19 pandemic - UN News", "description": "Last year, over 13 million children received no vaccines at all, and the UN Children’s Fund (UNICEF) is calling on governments to step up, warning disrupting immunization services amid the COVID-19 pandemic could leave even more of the world’s most marginaliz…", "url": "https://news.un.org/en/story/2020/04/1062622", "urlToImage": null, "publishedAt": "2020-04-26T11:40:07Z", "content": "Making its call at the start of the 2020 edition of World Immunization Week, UNICEF said on Saturday that millions of children are in danger of missing life-saving vaccines against measles, diphtheria and polio due to disruptions in immunization service as th… [+3030 chars]"}, {"source": {"id": null, "name": "Weforum.org"}, "author": "Stephanie Nebehay", "title": "WHO warns COVID-19 patients could be infected again - World Economic Forum", "description": "The World Health Organization advises countries against issuing “immunity passports” or “risk-free certificates” to people who have been infected.", "url": "https://www.weforum.org/agenda/2020/04/no-evidence-that-recovered-covid-19-patients-cannot-be-reinfected-who/", "urlToImage": null, "publishedAt": "2020-04-26T11:38:09Z", "content": "<ul><li>People who have recovered from COVID-19 still need to take precautions to prevent re-infection</li><li>Some countries have handed out health passports to people who have recovered from the illness</li><li>There are now 2.9 million cases of coronavirus… [+1994 chars]"}, {"source": {"id": null, "name": "Cnbctv18.com"}, "author": null, "title": "Substance in tobacco may lower risk of contracting coronavirus, study suggests - CNBCTV18", "description": "The researchers said they were not encouraging people to take up smoking as it has serious health implications. Get latest Healthcare online at cnbctv18.com", "url": "https://www.cnbctv18.com/healthcare/substance-in-tobacco-may-lower-risk-of-contracting-coronavirus-study-suggests-5779131.htm/", "urlToImage": null, "publishedAt": "2020-04-26T11:34:34Z", "content": "Contrary to recent reports that highlighted smokers and tobacco users are at higher risk of COVID-19 infection, a new study suggests substance in tobacco may lower risk of contracting coronavirus.\r\nThe study, conducted at a hospital in Paris, suggests that a … [+1510 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Serum Institute to start making Oxford Uni's COVID-19 vaccine in 3 weeks; launch by October if trials succeed - Moneycontrol", "description": "The Pune-based company has partnered with Oxford University as one of the seven global institutions manufacturing the vaccine.", "url": "https://www.moneycontrol.com/news/india/serum-institute-to-start-making-oxford-unis-covid-19-vaccine-in-3-weeks-launch-by-october-if-trials-succeed-5190661.html", "urlToImage": null, "publishedAt": "2020-04-26T10:34:05Z", "content": "Vaccine major Serum Institute of India on Sunday said it plans to start production of the COVID-19 vaccine developed by Oxford University in the next two to three weeks and hopes to bring it to the market by October if the human clinical trials are successful… [+3377 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "PTI", "title": "Coronavirus: Serum Institute to start production of Oxford University's vaccine in 3 weeks, launch by October - Times Now", "description": "The company plans to initiate the trials in India for the vaccine with necessary regulatory approvals, which are underway presently.", "url": "https://www.timesnownews.com/health/article/coronavirus-serum-institute-to-start-production-of-oxford-universitys-vaccine-in-3-weeks-launch-by-october/583216", "urlToImage": null, "publishedAt": "2020-04-26T10:32:23Z", "content": "New Delhi: Vaccine major Serum Institute of India on Sunday said it plans to start production of the COVID-19 vaccine developed by Oxford University in the next two to three weeks and hopes to bring it to the market by October if the human clinical trials are… [+2866 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Sukanya Charuchandra", "title": "Convalescent Plasma's Success Against COVID-19 Continues in New Study - The Wire", "description": "Convalescent plasma is one of three immune-based options that may be able to tackle COVID-19.", "url": "https://science.thewire.in/the-sciences/convalescent-plasmas-success-against-covid-19-continues-in-new-study/", "urlToImage": null, "publishedAt": "2020-04-26T09:29:00Z", "content": "An artist’s impression of red blood cells flowing through a vein. Image: Narupon Promvichai/pixabay.\r\nResearchers in China have been experimenting with using blood plasma from patients who have recovered from COVID-19 as a possible way to treat severely ill C… [+5508 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "PTI", "title": "Cardiac abnormalities in COVID-19 patients treated with hydroxychloroquine: Study - India TV News", "description": "Patients with COVID-19 who were on a regimen of the drugs hydroxychloroquine and azithromycin experienced cardiac abnormalities, according to a study which recommends the continuous monitoring of heart beat rhythms in infected people with underlying health co…", "url": "https://www.indiatvnews.com/science/cardiac-abnormalities-covid-19-patients-treated-with-hydroxychloroquine-study-611462", "urlToImage": null, "publishedAt": "2020-04-26T09:20:29Z", "content": "Cardiac abnormalities in COVID-19 patients treated with hydroxychloroquine: Study\r\nPatients with COVID-19 who were on a regimen of the drugs hydroxychloroquine and azithromycin experienced cardiac abnormalities, according to a study which recommends the conti… [+2424 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "IANS", "title": "Coronavirus: US COVID-19 Cases Top 900,000, Deaths Touch 52,000 - ABP Live", "description": "The number of COVID-19 cases in the country reached 905,364 as of 10.30 a.m. (1430 GMT), and a total of 52,042 deaths related to the disease were recorded, according to the Center for Systems Science and Engineering (CSSE) at Johns Hopkins University, Xinhua …", "url": "https://news.abplive.com/news/world/coronavirus-in-united-states-us-covid-19-cases-top-900000-deaths-touch-52000-1206575", "urlToImage": null, "publishedAt": "2020-04-26T09:13:00Z", "content": "Washington: More than 900,000 people were infected with the novel coronavirus (COVID-19) as of Saturday in the United States, with the death toll exceeding 52,000, while a new study indicated that the virus was likely to be spreading in multiple US cities \"fa… [+4120 chars]"}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "Associated Press", "title": "As coronavirus lockdown eases, Italy ponders what went wrong in hardest-hit regions - The New Indian Express", "description": "Virologists and epidemiologists say what went wrong there will be studied for years, given how the outbreak overwhelmed a medical system considered one of Europe's best.", "url": "https://www.newindianexpress.com/world/2020/apr/26/as-coronavirus-lockdown-eases-italy-ponders-what-went-wrong-in-hardest-hit-regions-2135545.html", "urlToImage": null, "publishedAt": "2020-04-26T09:12:00Z", "content": "ROME: As Italy prepares to emerge from the West's first and most extensive coronavirus lockdown, it is increasingly clear that something went terribly wrong in Lombardy, the hardest-hit region in Europe's hardest-hit country.\r\nItaly had the bad luck of being … [+5318 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Indore strain may be deadlier, will send samples to NIV: Docs - India Today", "description": "The novel coronavirus is posing a big challenge due to multiple strains.", "url": "https://www.indiatoday.in/india/story/indore-strain-may-be-deadlier-will-send-samples-to-niv-docs-1671256-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T08:39:35Z", "content": "Doctors treating COVID-19 cases in Indore say a more virulent strain may be wreaking havoc in the city, which has emerged as the coronavirus hotspot in Madhya Pradesh. They say samples from Indore, where COVID-19 has killed 57 people, will be sent to the Pune… [+1315 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Women face anxiety over pregnancy and birth in US - TRT World", "description": "For many women, being pregnant comes with its own set of fears and anxiety. But being pregnant during the Covid-19 pandemic takes those fears to a whole new ...", "url": "https://www.youtube.com/watch?v=gagwijdvCR0", "urlToImage": null, "publishedAt": "2020-04-26T08:10:16Z", "content": null}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Morning update as military begins mobile testing - BBC News", "description": "Five things you need to know about the coronavirus outbreak this morning.", "url": "https://www.bbc.com/news/uk-52429303", "urlToImage": null, "publishedAt": "2020-04-26T06:54:27Z", "content": "Here are five things you need to know about the coronavirus outbreak this Sunday. We'll have another update for you on Monday.\r\n1. Military pop-up testing\r\nThe military is to begin carrying out coronavirus tests in pop-up facilities. The mobile units will tra… [+2792 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Longjam Dineshwori", "title": "Prescriptions for antidepressants and anti-anxiety drugs surge amidst COVID-19 pandemic - TheHealthSite", "description": "According to a report prescriptions of anti-anxiety medications rose by 34.1% between mid-February and mid-March in the US.", "url": "https://www.thehealthsite.com/news/prescriptions-for-antidepressants-and-anti-anxiety-drugs-surge-amidst-covid-19-pandemic-741891/", "urlToImage": null, "publishedAt": "2020-04-26T06:06:59Z", "content": "Stress about health, finances and uncertainty about the future amidst the COVID-19 pandemic is taking a serious toll on the mental health of people worldwide. In India, there has been a massive spike in patients with mental illness since the coronavirus outbr… [+4292 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": "https://www.facebook.com/dineshRewale", "title": "Coronavirus lockdown: Shopping robots deliver free groceries to NHS workers in English town - dineshr", "description": "The shopping robots are delivering for free to National Health Service (NHS) staff and facing increased demand from the general public. Shopping robots are delivering for free to National Health…", "url": "https://www.indiatoday.in/trending-news/story/coronavirus-lockdown-shopping-robots-deliver-free-groceries-to-nhs-workers-in-english-town-1671193-2020-04-26?utm_source=rss", "urlToImage": null, "publishedAt": "2020-04-26T05:16:18Z", "content": "A fleet of robots on wheels that deliver shopping in the English town of Milton Keynes have seen their popularity surge as residents are stuck indoors due to the coronavirus lockdown.\r\nThe robots, which come up roughly to an adult’s knee height and look like … [+1888 chars]"}, {"source": {"id": null, "name": "Bangkokpost.com"}, "author": "Bangkok Post Public Company Limited", "title": "German start-up in global demand with anti-virus escalators - Bangkok Post", "description": "COLOGNE: Tanja Nickel and Katharina Obladen were still in high school when they patented an idea to disinfect escalator handrails using UV light.", "url": "https://www.bangkokpost.com/business/1907830/german-start-up-in-global-demand-with-anti-virus-escalators", "urlToImage": null, "publishedAt": "2020-04-26T04:45:00Z", "content": "COLOGNE: Tanja Nickel and Katharina Obladen were still in high school when they patented an idea to disinfect escalator handrails using UV light.\r\nA decade later, their small German start-up UVIS can barely keep up with orders from around the world for their … [+4073 chars]"}, {"source": {"id": null, "name": "Thehitavada.com"}, "author": "The Hitavada", "title": "She survived Spanish Flu in 1918, now she beat Covid-19 - The Hitavada", "description": "WE MAY have all heard that miracles do happen, but sadly not all of us have the chance to witness them in our daily lives, especially during a pandemic today which brings the world to a standstill. Citing a similar story of survival, The Olive Press, a Spain-…", "url": "https://www.thehitavada.com/Encyc/2020/4/26/She-survived-Spanish-Flu-in-1918-now-she-beat-Covid-19.html", "urlToImage": null, "publishedAt": "2020-04-26T03:57:54Z", "content": "WE MAY have all heard that miracles do happen, but sadly not all of us have the chance to witness them in our daily lives, especially during a pandemic today which brings the world to a standstill. Citing a similar story of survival, The Olive Press, a Spain-… [+1280 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "Second wave of COVID-19 may hit India during monsoon months - Northeast Now", "description": "Though coronavirus cases in India may go down substantially in the coming days, it may again resurface during the monsoon months. According to an India Times report, the second wave is expected to hit the country in the months of July and August. However, acc…", "url": "https://nenow.in/top-news/second-wave-of-covid-19-may-hit-india-during-monsoon-months.html/", "urlToImage": null, "publishedAt": "2020-04-26T03:20:07Z", "content": "Though coronavirus cases in India may go down substantially in the coming days, it may again resurface during the monsoon months.\r\nAccording to an India Times report, the second wave is expected to hit the country in the months of July and August.\r\nHowever, a… [+840 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Hindustan Times", "title": "India records biggest single day spike, virus can survive on particulate matter: Covid-19 news today - Hindustan Times", "description": "Here is a preview of the important Covid-19 stories from India and world today.", "url": "https://www.hindustantimes.com/india-news/india-records-biggest-single-day-spike-virus-can-survive-on-particulate-matter-covid-19-news-today/story-WANk0UoFH42j3DcDdXLDSM.html", "urlToImage": null, "publishedAt": "2020-04-26T02:48:01Z", "content": "India’s tally of confirmed coronavirus disease (Covid-19) cases shot past the 26,000-mark on Saturday with the biggest single-day spike in infections. Tests in Italy found the Sars-CoV-2 virus, which causes Covid-19, can cling to air pollution particles.\r\nInd… [+4828 chars]"}, {"source": {"id": null, "name": "Newsonair.com"}, "author": null, "title": "WHO says there is no evidence that recovered patients are immune to COVID-19 infection - All India Radio", "description": "World Health Organization (WHO) has said that there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection.", "url": "http://newsonair.com/Main-News-Details.aspx?id=386715", "urlToImage": null, "publishedAt": "2020-04-26T02:42:41Z", "content": "Site Maintained by: Website Cell, NSD and IT Division, Prasar Bharati, New Delhi, India. Website Policy"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Temple University Hospital Asking For Personal Protective Equipment Donations - CBS Philly", "description": "The hospital says gowns -- both surgical and isolation -- and N95 masks are needed most.", "url": "https://www.youtube.com/watch?v=7dPAa6IEimU", "urlToImage": null, "publishedAt": "2020-04-26T02:37:41Z", "content": null}, {"source": {"id": null, "name": "Manoramaonline.com"}, "author": "Reuters", "title": "Could warmer weather help contain the coronavirus? - Onmanorama", "description": "Here's what we know about seasonal features of disease outbreaks.", "url": "https://english.manoramaonline.com/lifestyle/health/2020/04/25/could-warmer-weather-help-contain-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-26T01:01:18Z", "content": "The world is looking for signs that the arrival of warmer weather in the northern hemisphere could slow the spread of the coronavirus outbreak, which has killed more than 1,90,000 people and sent the global economy into a tailspin as countries impose lockdown… [+3652 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Mumbai Mirror", "title": "‘No evidence’ recovered patients cannot be reinfected: WHO - Mumbai Mirror", "description": "The World Health Organization (WHO) said on Saturday that there was currently “no evidence” that people who have recovered from Covid-19 and have antibodies are protected from a second coronavirus in", "url": "https://mumbaimirror.indiatimes.com/coronavirus/news/no-evidence-recovered-patients-cannot-be-reinfected-who/articleshow/75383625.cms", "urlToImage": null, "publishedAt": "2020-04-26T00:30:00Z", "content": "The World Health Organization\r\n (WHO) said on Saturday that there was currently no evidence that people who have recovered from Covid-19 and have antibodies\r\n are protected from a second coronavirus\r\n infection.\r\nIn a scientific brief, the United Nations\r\n ag… [+1349 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "UK doctor invents digital flashcards to help Covid-19 patients understand staff - The Guardian", "description": "Cardmedic overcomes communication barrier caused by healthcare staff wearing PPE", "url": "https://www.theguardian.com/world/2020/apr/25/uk-doctor-invents-digital-flashcards-to-help-covid-19-patients-understand-staff", "urlToImage": null, "publishedAt": "2020-04-25T21:50:36Z", "content": "A coronavirus patients terrifying hospital experience inspired an NHS doctor to create a flashcard system to improve communication with medical staff wearing face masks.\r\nAnaesthetist Rachael Grimaldi founded Cardmedic while on maternity leave after reading a… [+2712 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "'No evidence' people with coronavirus are immunised: WHO - SBS News", "description": "While the global death toll of coronavirus passes 200,000, the World Health Organization warns there is no evidence of immunity to the disease.", "url": "https://www.sbs.com.au/news/no-evidence-people-with-coronavirus-are-immunised-says-who", "urlToImage": null, "publishedAt": "2020-04-25T21:37:23Z", "content": "The World Health Organization has warned that recovering from coronavirus might not protect people from reinfection as the death toll from the pandemic passed 200,000 around the globe.\r\nGovernments are struggling to limit the economic devastation unleashed by… [+7190 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": null, "title": "WHO warns malaria deaths could double during virus pandemic - cgtn.com", "description": "The new coronavirus pandemic could severely disrupt access to anti-malaria nets and drugs in sub-Saharan", "url": "https://africa.cgtn.com/2020/04/25/who-warns-malaria-deaths-could-double-during-virus-pandemic/", "urlToImage": null, "publishedAt": "2020-04-25T20:47:00Z", "content": "Aedes aegypti Mosquito. Close up a Mosquito sucking human blood.Aedes aegypti Mosquito. Close up a Mosquito sucking human blood,Mosquito Vector-borne diseases,Chikungunya.Dengue fever.Rift Valley fever.Yellow fever.Zika.Mosquito on skin\r\nThe new coronavirus p… [+3281 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Could a Second Wave of Coronavirus Infections Appear? - QuickTake by Bloomberg", "description": "The concern about a second wave of #coronavirus is that, once quelled, the pandemic will resurface with renewed strength Subscribe to our YouTube channel: ht...", "url": "https://www.youtube.com/watch?v=fNZ83AEd7Wk", "urlToImage": null, "publishedAt": "2020-04-25T20:34:42Z", "content": "The concern about a second wave of #coronavirus is that, once quelled, the pandemic will resurface with renewed strength\r\nSubscribe to our YouTube channel: https://bit.ly/2TwO8Gm\r\nQUICKTAKE ON SOCIAL:Follow QuickTake on Twitter: twitter.com/quicktakeLike Quic… [+337 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nTom Morgan", "title": "Coronavirus test for anyone traced to a known carrier - Telegraph.co.uk", "description": "The technology should eventually allow symptomless workers to return to their jobs quicker", "url": "https://www.telegraph.co.uk/news/2020/04/25/coronavirus-test-anyone-traced-known-carrier/", "urlToImage": null, "publishedAt": "2020-04-25T20:30:00Z", "content": "In the letter to public health agencies and local authorities, he says the app will work in unison with a call-based system for those without the technology.\r\nHe also refers to the Government's huge recruitment drive to carry out the extra testing. \"There wil… [+2492 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Peter Stubley", "title": "First credible evidence emerges of person being killed by meteor - The Independent", "description": "Researchers find official records documenting fatal strike in Iraq in 1888", "url": "https://www.independent.co.uk/news/science/meteor-man-death-first-person-killed-iraq-turkey-ottoman-empire-a9484231.html", "urlToImage": null, "publishedAt": "2020-04-25T20:00:42Z", "content": "The odds of being struck and killed by a meteorite are said to be as low as one in 250,000.\r\nThere has been no credible and well-documented evidence of any human being befalling this unfortunate fate.\r\nBut researchers now say they have found three separate of… [+16481 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Maxouris and Jason Hanna, CNN", "title": "US coronavirus: Some states begin to reopen as US closes in on 1 million coronavirus cases - msnNOW", "description": "A few states this weekend are running a tricky experiment: Trying to reopen certain businesses and services amid the coronavirus pandemic, even against the advice of some health experts who say it risks dangerously spiking the number of cases.", "url": "https://www.cnn.com/2020/04/25/health/us-coronavirus-saturday/index.html", "urlToImage": null, "publishedAt": "2020-04-25T20:00:00Z", "content": "(CNN)A few states this weekend are running a tricky experiment: Trying to reopen certain businesses and services amid the coronavirus pandemic, even against the advice of some health experts who say it risks dangerously spiking the number of cases.\r\nIn Georgi… [+9123 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Mehr Gill", "title": "Explained: Types of human coronaviruses and the symptoms they cause - The Indian Express", "description": "While there are hundreds of coronaviruses, there are seven that we know can infect humans.", "url": "https://indianexpress.com/article/explained/types-of-human-coronaviruses-and-symptoms-6368444/", "urlToImage": null, "publishedAt": "2020-04-25T19:50:19Z", "content": "Written by Mehr Gill\r\n | New Delhi | \r\nUpdated: April 25, 2020 6:09:09 pm\r\nHuman coronaviruses were first characterised in the mid-1960s and they are mostly considered to be responsible for causing upper respiratory tract infections in children. (AP illustrat… [+6888 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Milly Vincent For Mailonline", "title": "Six-month-old baby given guard of honour as she is released from isolation after beating covid-19 - Daily Mail", "description": "Six-month-old Erin Bates is one of the youngest people to catch the infection and spent the last 14 days alone in isolation at Alder Hey Children's Hospital in Liverpool. She has made a full recovery.", "url": "https://www.dailymail.co.uk/news/article-8256649/Six-month-old-baby-given-guard-honour-released-isolation-beating-covid-19.html", "urlToImage": null, "publishedAt": "2020-04-25T18:55:14Z", "content": "This the touching moment a 'miracle baby' was given a guard of honour by tearful nurses and doctors after she beat Covid-19 and was wheeled out of isolation today.\r\nSix-month-old Erin Bates is one of the youngest people to catch the infection and has spent th… [+2296 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Ramya Kannan", "title": "Coronavirus | Why pathogens travel in search of a host - The Hindu", "description": "What is the link between the virus causing COVID-19 and bats, pangolins and other wild species? Why are zoonotic diseases on the rise?", "url": "https://www.thehindu.com/sci-tech/health/coronavirus-why-pathogens-travel-in-search-of-a-host/article31434762.ece", "urlToImage": null, "publishedAt": "2020-04-25T18:32:00Z", "content": "The story so far: Long before the virus causing COVID-19 vitiated for the world many efficiencies it had taken for granted, it pit many over claims about how the vicious virus came to be in the first place. Claims were made of the virus being manufactured in … [+7586 chars]"}, {"source": {"id": null, "name": "Washingtonexaminer.com"}, "author": "https://www.washingtonexaminer.com/author/zachary-halaschak", "title": "WHO cautions against use of 'immunity passports' for people who have coronavirus antibodies - Washington Examiner", "description": "The World Health Organization is warning that countries should be wary about issuing certificates for people who have coronavirus antibodies.", "url": "https://www.washingtonexaminer.com/news/who-cautions-against-use-of-immunity-passports-for-people-who-have-coronavirus-antibodies", "urlToImage": null, "publishedAt": "2020-04-25T18:25:00Z", "content": "The World Health Organization is warning that countries should be wary about issuing certificates for people who have coronavirus antibodies. \r\nThe WHO issued the warning in a scientific brief published on Friday. It noted how as the world begins to reopen sl… [+1393 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Ariana Eunjung Cha", "title": "Young and middle-aged people, barely sick with covid-19, are dying of strokes - The Washington Post", "description": "Doctors sound alarm about patients in their 30s and 40s left debilitated or dead by strokes. Some didn’t even know they were infected by coronavirus.", "url": "https://www.washingtonpost.com/health/2020/04/24/strokes-coronavirus-young-patients/", "urlToImage": null, "publishedAt": "2020-04-25T18:18:21Z", "content": "Oxley gasped when he got to the patients age and covid-19 status: 44, positive.\r\nThe man was among several recent stroke patients in their 30s to 40s who were all infected with the coronavirus. The median age for that type of severe stroke is 74.\r\nAs Oxley, a… [+9467 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "2 cell types are entry points for virus - Hindustan Times", "description": "The respiratory tract is filled with numerous cells, among which are goblet cells and ciliated cells.", "url": "https://www.hindustantimes.com/india-news/2-cell-types-are-entry-points-for-virus/story-VZ250MIqdc4r0OIzxsTqPJ.html", "urlToImage": null, "publishedAt": "2020-04-25T17:54:31Z", "content": "Scientists have identified two types of cells in the nose that are likely to be point of infection for the Sars-CoV-2 virus, which causes Covid-19, in the body.\r\nThe respiratory tract is filled with numerous cells, among which are goblet cells and ciliated ce… [+2449 chars]"}, {"source": {"id": null, "name": "Kimt.com"}, "author": null, "title": "A 5-part series: What does it take to re-open one of Minnesota's largest cities? - KIMT 3", "description": "KIMT's Jessica Bringe talked to people throughout southeastern Minnesota to see what's next as people and communities fight the coronavirus.", "url": "https://www.kimt.com/content/news/A-5-part-series-What-does-it-take-to-re-open-one-of-Minnesotas-largest-cities-569950771.html", "urlToImage": null, "publishedAt": "2020-04-25T17:05:00Z", "content": "Governor Tim Walz is moving forward with plans to reopen the economy in our region by partnering with other Midwest governors.Walz said, “If I thought we could go back to work tomorrow that’s exactly what we would do.”As governors across the U.S. begin collab… [+3176 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "World Malaria Day: Governments urged to prevent rise in deaths - Al Jazeera English", "description": "On World Malaria Day, health officials are warning governments to move fast to prevent a rise in Malaria-related deaths. In Kenya, thousands of people have l...", "url": "https://www.youtube.com/watch?v=64nKBK4kq_w", "urlToImage": null, "publishedAt": "2020-04-25T15:59:04Z", "content": "On World Malaria Day, health officials are warning governments to move fast to prevent a rise in Malaria-related deaths.In Kenya, thousands of people have lost their homes after seasonal torrential rains destroyed them. Now, mosquitos are thriving in the wet … [+340 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WATCH | National curfew and mandatory cloth face masks to come into effect under Level 4 - News24", "description": "As of 1 May, a national curfew from 20:00 to 05:00 will be in place and it will be applicable to everyone except essential workers traveling to and from work...", "url": "https://www.youtube.com/watch?v=dNs8wczQKNM", "urlToImage": null, "publishedAt": "2020-04-25T15:15:23Z", "content": null}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Mekins develop UVC based disinfection trolley for COVID-19 - Daijiworld.com", "description": "", "url": "http://www.daijiworld.com/news/newsDisplay.aspx?newsID=701014", "urlToImage": null, "publishedAt": "2020-04-25T14:44:51Z", "content": "Hyderabad, Apr 25 (IANS): Mekins Industries Limited, a leading automobile packaging manufacturer, has developed a UVC based disinfection trolley to fight against COVID-19 by rapid cleaning of hospital environment, offices, factories, malls, airports and railw… [+2670 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Can this pulse monitor detect COVID-19? - Good Morning America", "description": "Pulse oximeters can provide an early warning sign of COVID-19 for patients in hospitals, but are those devices as effective when people use them at home?", "url": "https://www.youtube.com/watch?v=z9sypZ7mWRA", "urlToImage": null, "publishedAt": "2020-04-25T14:28:18Z", "content": "Pulse oximeters can provide an early warning sign of COVID-19 for patients in hospitals, but are those devices as effective when people use them at home?"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Sweden goes it alone with 'relaxed' attitude to coronavirus - CGTN", "description": "Sweden's relaxed restrictions could lead to herd immunity but at what cost?", "url": "https://newseu.cgtn.com/news/2020-04-25/Sweden-goes-it-alone-with-relaxed-attitude-to-coronavirus-PYIUqQSwH6/index.html", "urlToImage": null, "publishedAt": "2020-04-25T12:41:25Z", "content": "Everyone wants immunity from the coronavirus. But there may be different ways to get it.\r\nOne is a vaccine. Clinical trials are already underway in the UK, and if all goes well, say those involved, it's possible a vaccination may be ready for production by Se… [+3523 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Making masks at home? Cotton with silk, chiffon best materials, says new study - Economic Times", "description": "The study says that the combination can filter out aerosol particles, provided the mask fits well.", "url": "https://economictimes.indiatimes.com/magazines/panache/making-masks-at-home-cotton-with-silk-chiffon-best-materials-says-new-study/articleshow/75376504.cms", "urlToImage": null, "publishedAt": "2020-04-25T12:27:11Z", "content": "WASHINGTON: As people resort to making their own cloth masks due to shortage of surgical and N95 varieties in the wake of the COVID-19 pandemic, a new study says a combination of cotton with natural silk or chiffon can filter out aerosol particles provided th… [+4257 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "DOH: More than 72000 lab tests conducted for COVID-19 in PH - INQUIRER.net", "description": "More than 72,000 laboratory tests were conducted for checking novel coronavirus or SARS-CoV-2, which causes COVID-19, in the country, the Department of Healt...", "url": "https://www.youtube.com/watch?v=fB_ScQAcFZs", "urlToImage": null, "publishedAt": "2020-04-25T11:58:23Z", "content": null}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Coronavirus And Smoking: French Researchers Suggest Nicotine Could Protect Against Coronavirus - Swarajya", "description": "", "url": "https://swarajyamag.com/news-brief/coronavirus-and-smoking-french-researchers-suggest-nicotine-could-protect-against-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T11:31:00Z", "content": null}, {"source": {"id": null, "name": "India.com"}, "author": "India.com News Desk", "title": "Coronavirus Will be Destroyed by Acids Present in Stomach, Ramdev Makes Bizarre Claim - India.com", "description": "New Delhi: At a time when the entire world is struggling to combat the spread of coronavirus outbreak, Yoga guru Ramdev has come up with a bizarre solution to treat COVID-19. Speaking at an event orga", "url": "https://www.india.com/news/india/coronavirus-will-be-destroyed-by-acids-present-in-stomach-ramdev-makes-bizarre-claim-4010634/", "urlToImage": null, "publishedAt": "2020-04-25T11:18:51Z", "content": "New Delhi: At a time when the entire world is struggling to combat the spread of coronavirus outbreak, Yoga guru Ramdev has come up with a bizarre solution to treat COVID-19. Speaking at an event organised by a media organisation,  Ramdev claimed that if COVI… [+1570 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Plasma therapy trials for coronavirus patients begin in Karnataka - Deccan Herald", "description": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.", "url": "https://www.deccanherald.com/state/top-karnataka-stories/plasma-therapy-trials-for-coronavirus-patients-begin-in-karnataka-829772.html", "urlToImage": null, "publishedAt": "2020-04-25T11:00:06Z", "content": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.\r\nFollow latest updates on the COVID-19 pandemic here\r\nIn a tweet, Medical Education Minister K Sudhakar said, \"Happy to … [+1295 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "Bats cannot directly infect humans with Covid-19: Scientists - Hindustan Times", "description": "According to scientists, Sars-Cov-2 may have diverged from the closest coronavirus found in bats called RaTG13, about 40 to 70 years ago, indicating that the bat virus cannot directly infect humans.", "url": "https://www.hindustantimes.com/india-news/bats-cannot-directly-infect-humans-with-covid-19-scientists/story-uuEwHKcI0x266H1fxawFbN.html", "urlToImage": null, "publishedAt": "2020-04-25T09:30:44Z", "content": "Sixty-four scientists have said bats do not spread Covid-19 after reports of people requesting local authorities to clear trees over a fear of the colonies the winged mammals host.\r\nThe chiropterologists issuing the statement said they came together after rep… [+3518 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Riya Baibhawi", "title": "Doctors say ventilators cause more harm than good to coronavirus patients - Republic World - Republic World", "description": "US doctors are now warning against the use of the ventilators to treat coronavirus patients saying that they were doing more harm than good.", "url": "https://www.republicworld.com/world-news/us-news/doctors-says-ventilators-cause-more-harm-than-good-to-covid-19-patient.html", "urlToImage": null, "publishedAt": "2020-04-25T09:28:00Z", "content": "The demands of ventilators have surged amid the ongoing global health crisis with major countries racing to secure more and more of the breathing machines. However, doctors are now warning against the use of the breathing machines to treat coronavirus patient… [+2040 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "AP", "title": "Coronavirus: WHO warns against idea of 'immunity passports' - Deccan Herald", "description": "The World Health Organization is cautioning against the idea of “immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.", "url": "https://www.deccanherald.com/international/world-news-politics/coronavirus-world-health-organization-warns-against-idea-of-immunity-passports-829739.html", "urlToImage": null, "publishedAt": "2020-04-25T08:50:01Z", "content": "The World Health Organization is cautioning against the idea of immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.\r\nThe concept of immunity pas… [+813 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "While 58% Indians Quit Smoking, France Says Nicotine Could Protect COVID-19 Patients - CRUX", "description": "Consumption of cigarettes has decreased in India during the lockdown period. According to a survey conducted by IIFL, 58% smokers have quit smoking during lo...", "url": "https://www.youtube.com/watch?v=B0zyXoDvbUM", "urlToImage": null, "publishedAt": "2020-04-25T08:23:14Z", "content": null}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "World Malaria Day 2020: WHO's anti-malaria campaign and target to eliminate malaria from 35 more... - Firstpost", "description": "According to WHO reports, malaria affected more than 228 million people in the world in 2018 and killed about 405,000 people globally in the same year.", "url": "https://www.firstpost.com/health/world-malaria-day-2020-whos-anti-malaria-campaign-and-target-to-eliminate-malaria-from-35-more-countries-by-2030-8298691.html", "urlToImage": null, "publishedAt": "2020-04-25T06:06:06Z", "content": null}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "Coronavirus and COVID-19: Fact versus fiction - The Jakarta Post - Jakarta Post", "description": "Here are some claims that have circulated about how to treat COVID-19 or stop the transmission of the new coronavirus, and the facts according to doctors and health experts.", "url": "https://www.thejakartapost.com/life/2020/04/25/coronavirus-and-covid-19-fact-versus-fiction.html", "urlToImage": null, "publishedAt": "2020-04-25T05:35:00Z", "content": "US President Donald Trump's musings about whether disinfectants and ultraviolet light can be inserted into patients' bodies to treat COVID-19 have alarmed doctors and drawn warnings from the makers of Lysol, Dettol and Clorox.\r\nHere are some other claims that… [+3208 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Nitin Sreedhar", "title": "When a virus jumps: of man, microbes and pandemics - Livemint", "description": "Climate change effects or complex man-animal interactions—why are zoonotic disease outbreaks like covid-19 becoming more frequent?", "url": "https://www.livemint.com/mint-lounge/features/when-a-virus-jumps-of-man-microbes-and-pandemics-11587735889206.html", "urlToImage": null, "publishedAt": "2020-04-25T05:10:40Z", "content": "Inger Andersen, executive director of the UN Environment Programme, said last month that nature was sending humankind a message\" through the coronavirus pandemic and climate crisis. In an interview with The Guardian, the Danish environmentalist said there wer… [+10236 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Key nose cells identified as entry points for corona: Study - Daijiworld.com", "description": "", "url": "https://www.daijiworld.com/news/newsDisplay.aspx?newsID=700787", "urlToImage": null, "publishedAt": "2020-04-25T03:49:28Z", "content": "London, Apr 25 (IANS): Researchers have discovered that goblet and ciliated cells in the nose have high levels of the entry proteins that the COVID-19 coronavirus uses to get into our cells. The identification of these cells could help explain the high transm… [+2518 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus Detected on Air Pollution Particles That May Carry It Over Long Distances, Scientists Warn - Yahoo India News", "description": "Leonardo Setti at the University of Bologna in Italy said it was imperative to investigate if the the coronavirus could be transported through air pollution.", "url": "https://in.news.yahoo.com/coronavirus-detected-air-pollution-particles-032800819.html", "urlToImage": null, "publishedAt": "2020-04-25T03:37:47Z", "content": "Novel coronavirus has been found on air pollution particles by scientists who are studying if this could allow the virus to advance longer distances, resulting in a more number of people contracting it, The Guardian reported.\r\nThe work is still in the initial… [+2706 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "G Thing: Pet fashion designer finds unique ways to give back to animal rescue crews - PIX11 News", "description": "She's one of the most in demand New York fashion designers for dog and cats.", "url": "https://www.youtube.com/watch?v=WcRkfwYZcdU", "urlToImage": null, "publishedAt": "2020-04-25T03:02:18Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Dawn.com"}, "author": "AFP", "title": "Vaccine shows promise in monkey trials, says Chinese company - DAWN.com", "description": "All the monkeys “were largely protected against SARS-CoV-2 infection” says producer Sinovac Biotech.", "url": "https://www.dawn.com/news/1552041", "urlToImage": null, "publishedAt": "2020-04-25T01:43:18Z", "content": "BEIJING: A novel coronavirus vaccine has for the first time largely protected monkeys from infection during an animal trial, data from a Chinese pharmaceutical giant showed.\r\nIt is among a slew of vaccines being developed around the world as countries race to… [+2570 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Deconfine or double down? Coronavirus in France, Turkey, Sweden, Russia - The World This Week - FRANCE 24 English", "description": "From Russia, where mobile phone apps track citizens to ensure compliance with lockdown, to Sweden, which never confined and opted instead for herd immunity, ...", "url": "https://www.youtube.com/watch?v=E_mepoumEA4", "urlToImage": null, "publishedAt": "2020-04-24T19:03:19Z", "content": null}, {"source": {"id": null, "name": "Kashmirreader.com"}, "author": "Press Trust of India", "title": "Second wave of coronavirus infections in India likely during monsoon: Scientists - Kashmir Reader", "description": "NEW DELHI: The trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the lockdown is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say scient…", "url": "https://kashmirreader.com/2020/04/25/second-wave-of-coronavirus-infections-in-india-likely-during-monsoon-scientists/", "urlToImage": null, "publishedAt": "2020-04-24T18:48:00Z", "content": "NEW DELHI: The trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the lockdown is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say scient… [+6156 chars]"}, {"source": {"id": null, "name": "Webmd.com"}, "author": "Brenda  Goodman, MA", "title": "Blood Clots Are Another Dangerous COVID-19 Mystery - WebMD", "description": "Around the world, doctors caring for COVID-19 patients have been trying to make sense of the same thing. When they draw blood from COVID patients, it clots in the tubes.", "url": "https://www.webmd.com/lung/news/20200424/blood-clots-are-another-dangerous-covid-19-mystery", "urlToImage": null, "publishedAt": "2020-04-24T18:46:44Z", "content": "He says this theory of infection explains some things that doctors have been trying to puzzle out.\r\nFor example, certain conditions like high blood pressure, diabetes, and heart disease stress the endothelium. Its no surprise, then, that people who have these… [+1776 chars]"}, {"source": {"id": null, "name": "Scoopsquare24.com"}, "author": null, "title": "Britain launches COVID-19 vaccine study, latest in race - Scoop Square24", "description": "Testing of an experimental COVID-19 vaccine started in wholesome volunteers in Britain Thursday, the most recent in a cluster of early-stage research in the hunt for safety in opposition to the coronavirus. College of Oxford researchers gave injections to vol…", "url": "https://scoopsquare24.com/britain-launches-covid-19-vaccine-study-latest-in-race/", "urlToImage": null, "publishedAt": "2020-04-24T18:15:00Z", "content": "Testing of an experimental COVID-19 vaccine started in wholesome volunteers in Britain Thursday, the most recent in a cluster of early-stage research in the hunt for safety in opposition to the coronavirus.\r\nCollege of Oxford researchers gave injections to vo… [+2037 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Does COVID-19 Cause Blood Clot Complications? | NBC New York - NBC New York", "description": "A small study of five critically ill COVID-19 patients at Mount Sinai Hospital in New York City could have major implications for how doctors respond to the ...", "url": "https://www.youtube.com/watch?v=twPd0YvY3T0", "urlToImage": null, "publishedAt": "2020-04-24T17:18:33Z", "content": null}]}