{"status": "ok", "totalResults": 68, "articles": [{"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Zaheena Rasheed", "title": "Global coronavirus deaths pass 200,000: Live updates - Al Jazeera English", "description": "Saudi Arabia partially lifts curfew and thousands hit California beaches as pandemic reaches another grim milestone.", "url": "https://www.aljazeera.com/news/2020/04/global-coronavirus-deaths-pass-200000-live-updates-200425232324631.html", "urlToImage": null, "publishedAt": "2020-04-26T02:34:00Z", "content": "<ul><li>The coronavirus global death toll exceeded the 200,000 threshold, according to a tally by the Johns Hopkins University.\r\n</li><li>The World Health Organization (WHO) warned against countries issuing so-called \"immunity passports\" to those recovered fr… [+3734 chars]"}, {"source": {"id": null, "name": "Chinadaily.com.cn"}, "author": "于小明", "title": "No evidence suggests people with COVID-19 antibodies protected from secondary infection: WHO - 中国日报", "description": "There is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection, the World Health Organization (WHO) said in a daily situation report on Saturday.", "url": "http://global.chinadaily.com.cn/a/202004/26/WS5ea4c1fba310a8b24115196a.html", "urlToImage": null, "publishedAt": "2020-04-26T02:13:21Z", "content": "A logo is pictured on the headquarters of the World Health Organization ahead of a meeting of the Emergency Committee on the novel coronavirus in Geneva, Switzerland, Jan 30, 2020. [Photo/Agencies] \r\nGENEVA -- There is currently no evidence that people who ha… [+1393 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Just like Shilpa Shetty, here's why dosa is the perfect protein-packed breakfast option for you - Times of India", "description": "Love feasting on dosas? We tell you why this is one of the healthiest breakfast options for you!", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/just-like-shilpa-shetty-heres-why-dosa-is-the-perfect-protein-packed-breakfast-option-for-you/photostory/75377655.cms", "urlToImage": null, "publishedAt": "2020-04-26T01:30:00Z", "content": "For all the vegetarians who complain about missing out on proteins with their morning meal, fear no more. Dosa batter is made of fermented rice and black urad dal, which is an essential lentil. Pulses and lentils are super-rich on proteins, amino acids and gi… [+135 chars]"}, {"source": {"id": null, "name": "Theladders.com"}, "author": "CW Headley", "title": "These are the 6 new COVID-19 symptoms the CDC has just added to the list - Ladders", "description": "If your COVID-19 conditions begin to decline, you’ll likely know by one or more of these symptom developments.", "url": "https://www.theladders.com/career-advice/these-are-the-6-new-covid-19-symptoms-the-cdc-has-just-added-to-the-list", "urlToImage": null, "publishedAt": "2020-04-25T22:23:04Z", "content": "<ul><li><ul><li>Fever</li><li>Cough</li><li>Shortness of breath or difficulty breathing</li><li>Chills</li><li>Repeated shaking with chills</li><li>Muscle pain</li><li>Headache</li><li>Sore throat</li><li>New loss of taste or smell</li></ul></li></ul>Most peo… [+2419 chars]"}, {"source": {"id": null, "name": "Ourbitcoinnews.com"}, "author": null, "title": "World Malaria Day 2020: How India Became Big Manufacturing Country of Hydroxychloroquine May Results Positive in Covid 19 By Coronavirus – World Malaria Day: How did India turn into a serious producer of malaria medicine? - OBN", "description": "Malaria Day 2020: India is a serious producer of malaria medicine – Photo: Pexels Listen to the information Today is World Malaria Day. This 12…", "url": "https://ourbitcoinnews.com/world-malaria-day-2020-how-india-became-big-manufacturing-country-of-hydroxychloroquine-may-results-positive-in-covid-19-by-coronavirus-world-malaria-day-how-did-india-become-a-major-producer-of-m/", "urlToImage": null, "publishedAt": "2020-04-25T20:47:14Z", "content": "Malaria Day 2020: India is a serious producer of malaria medicine– Photo: Pexels Today is World Malaria Day. This 12 months, its theme is Zero malaria begins with me ie 'Zero Malaria ki Aur Mein'. This mosquito-borne illness causes deaths in India. According … [+5628 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "AFP", "title": "WHO warns ´no evidence´ coronavirus patients who recover will not get reinfected - Geo News", "description": "The warning suggests that the issuance of immune passports may promote the continued spread of the pandemic.", "url": "https://www.geo.tv/latest/284950-who-warns-no-evidence-coronavirus-patients-who-recover-will-not-get-reinfected", "urlToImage": null, "publishedAt": "2020-04-25T20:40:04Z", "content": "GENEVA: The World Health Organization (WHO) warned on Saturday that there is no evidence that people who test positive for coronavirus are immunised and protected against reinfection.\r\nThe warning suggests that the issuance of \"immune passports\" may promote t… [+2068 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Could a Second Wave of Coronavirus Infections Appear? - QuickTake by Bloomberg", "description": "The concern about a second wave of #coronavirus is that, once quelled, the pandemic will resurface with renewed strength Subscribe to our YouTube channel: ht...", "url": "https://www.youtube.com/watch?v=fNZ83AEd7Wk", "urlToImage": null, "publishedAt": "2020-04-25T20:34:42Z", "content": "The concern about a second wave of #coronavirus is that, once quelled, the pandemic will resurface with renewed strength\r\nSubscribe to our YouTube channel: https://bit.ly/2TwO8Gm\r\nQUICKTAKE ON SOCIAL:Follow QuickTake on Twitter: twitter.com/quicktakeLike Quic… [+337 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Mehr Gill", "title": "Explained: Types of human coronaviruses and the symptoms they cause - The Indian Express", "description": "While there are hundreds of coronaviruses, there are seven that we know can infect humans.", "url": "https://indianexpress.com/article/explained/types-of-human-coronaviruses-and-symptoms-6368444/", "urlToImage": null, "publishedAt": "2020-04-25T19:50:19Z", "content": "Written by Mehr Gill\r\n | New Delhi | \r\nUpdated: April 25, 2020 6:09:09 pm\r\nHuman coronaviruses were first characterised in the mid-1960s and they are mostly considered to be responsible for causing upper respiratory tract infections in children. (AP illustrat… [+6888 chars]"}, {"source": {"id": null, "name": "Theshillongtimes.com"}, "author": "Agencies", "title": "No proof recovered patients cannot be reinfected: WHO - The Shillong Times", "description": "GENEVA: The World Health Organization (WHO) said on Saturday that there was currently “no evidence” that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection. In a scientific brief, the United", "url": "http://theshillongtimes.com/2020/04/26/no-proof-recovered-patients-cannot-be-reinfected-who/", "urlToImage": null, "publishedAt": "2020-04-25T19:45:00Z", "content": "GENEVA: The World Health Organization (WHO) said on Saturday that there was currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection. In a scientific brief, the United Nations age… [+1637 chars]"}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "Reuters", "title": "No evidence that recovered Covid-19 patients cannot be reinfected: WHO - Business Standard", "description": "In a scientific brief, the UN agency warned governments against issuing \"immunity passports\" or \"risk-free certificates\" to people who have been infected as their accuracy could not be guaranteed", "url": "https://www.business-standard.com/article/health/no-evidence-that-recovered-covid-19-patients-cannot-be-reinfected-who-120042501218_1.html", "urlToImage": null, "publishedAt": "2020-04-25T18:44:19Z", "content": "The World Health Organization (WHO) said on Saturday that there was currently “no evidence” that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nALSO READ: Artificial intelligence drives content … [+557 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Prof. K. Ganapathy", "title": "COVID-19 and the nervous system - The Hindu", "description": "In the last few weeks several articles have appeared from various specialists pointing out how the novel coronavirus disease (COVID-19) can affect their respective specialties. SARS-CoV-2, the scienti", "url": "https://www.thehindu.com/news/national/tamil-nadu/covid-19-and-the-nervous-system/article31434974.ece", "urlToImage": null, "publishedAt": "2020-04-25T18:36:51Z", "content": "In the last few weeks several articles have appeared from various specialists pointing out how the novel coronavirus disease (COVID-19) can affect their respective specialties. SARS-CoV-2, the scientific name given to the virus, appears to be truly omnipresen… [+3491 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "2 cell types are entry points for virus - Hindustan Times", "description": "The respiratory tract is filled with numerous cells, among which are goblet cells and ciliated cells.", "url": "https://www.hindustantimes.com/india-news/2-cell-types-are-entry-points-for-virus/story-VZ250MIqdc4r0OIzxsTqPJ.html", "urlToImage": null, "publishedAt": "2020-04-25T17:54:31Z", "content": "Scientists have identified two types of cells in the nose that are likely to be point of infection for the Sars-CoV-2 virus, which causes Covid-19, in the body.\r\nThe respiratory tract is filled with numerous cells, among which are goblet cells and ciliated ce… [+2449 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WHO: Why should I get vaccinated? - World Health Organization (WHO)", "description": "Without vaccines, we are at risk of serious illness and disability from diseases like measles, meningitis, tetanus and polio. In today' interconnected world,...", "url": "https://www.youtube.com/watch?v=9nadnOxvE74", "urlToImage": null, "publishedAt": "2020-04-25T17:33:39Z", "content": null}, {"source": {"id": null, "name": "Brusselstimes.com"}, "author": null, "title": "Coronavirus: Italy to run antibody tests on 150,000 persons - The Brussels Times", "description": "Italy plans to conduct antibody tests on 150,000 persons in its 20 regions, under a nationwide campaign beginning on 4 May, with a view to finding out more about the novel Coronavirus (Covid-19), Gove", "url": "https://www.brusselstimes.com/all-news/108144/coronavirus-italy-to-run-antibody-tests-on-150000-persons/", "urlToImage": null, "publishedAt": "2020-04-25T17:12:25Z", "content": "Italy plans to conduct antibody tests on 150,000 persons in its 20 regions, under a nationwide campaign beginning on 4 May, with a view to finding out more about the novel Coronavirus (Covid-19), Government Commissioner Domenico Arcuri announced on Saturday.\r… [+1421 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "HRD wants universities to study how India handled 1918 Spanish flu, revived economy - Moneycontrol", "description": "The HRD Ministry has been encouraging academic institutions to make research contributions to aid the fight against the deadly coronavirus.", "url": "https://www.moneycontrol.com/news/india/hrd-wants-universities-to-study-how-india-handled-1918-spanish-flu-revived-economy-5189901.html", "urlToImage": null, "publishedAt": "2020-04-25T15:48:35Z", "content": "The HRD Ministry has asked universities to study how India handled the Spanish flu pandemic in 1918 and what measures were taken to boost the economy. The ministry has also advised the universities to set up research teams and study the levels of awareness of… [+1713 chars]"}, {"source": {"id": null, "name": "Millenniumpost.in"}, "author": "IANS", "title": "Unearthing new dimensions - Millennium Post", "description": "The current pandemic has brought viral infections to public notice and yet misinformation abounds....", "url": "http://www.millenniumpost.in/sundaypost/inland/unearthing-new-dimensions-407847", "urlToImage": null, "publishedAt": "2020-04-25T15:38:14Z", "content": "Not too long ago, people were not really aware of viruses and their various characteristics. To most, viruses were an abstract, invisible threat, occasionally felt but largely ignored in favour of more immediate problems associated with modern living. However… [+5460 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Caroline Roberts", "title": "Can you become immune to the coronavirus? What we do and don't know - CNET", "description": "A doctor answers all of our questions.", "url": "https://www.cnet.com/news/can-you-become-immune-to-the-coronavirus-what-we-do-and-dont-know/", "urlToImage": null, "publishedAt": "2020-04-25T13:57:56Z", "content": "No, a positive antibody test doesn't mean you're immune.\r\nKaren Ducey/Getty Images\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nAs the coronavirus pandemic continues to sweep across the globe, researche… [+5345 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Free robot delivery for health workers in British town - Reuters", "description": "Ever since the British government imposed strict social distancing, a fleet of robots on wheels have been busy in the town of Milton Keynes, delivering for f...", "url": "https://www.youtube.com/watch?v=nib5bcNVZ8s", "urlToImage": null, "publishedAt": "2020-04-25T13:14:29Z", "content": null}, {"source": {"id": null, "name": "Slashgear.com"}, "author": "Brittany A. Roston", "title": "Homemade face mask study finds which two common materials are best - SlashGear", "description": "A newly published study looks into homemade face masks and which kinds of materials are best for filtering out potentially contaminated particles. The researchers found that two commonly available …", "url": "https://www.slashgear.com/homemade-face-mask-study-finds-which-two-common-materials-are-best-25618243/", "urlToImage": null, "publishedAt": "2020-04-25T13:03:56Z", "content": "A newly published study looks into homemade face masks and which kinds of materials are best for filtering out potentially contaminated particles. The researchers found that two commonly available fabrics are the best options, but only if they’re combined, le… [+1583 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Aalok Sensharma", "title": "Coronavirus Pandemic | 'No evidence' that recovered COVID-19 patients cannot be reinfected: WHO - Jagran English", "description": "In a scientific brief  the United Nations  UN  agency warned governments against issuing  immunity passports  or  risk free certificates  to people who have been infected as their accuracy could not be guaranteed", "url": "https://english.jagran.com/world/coronavirus-pandemic-no-evidence-that-recovered-covid19-patients-cannot-be-reinfected-who-10011117", "urlToImage": null, "publishedAt": "2020-04-25T13:01:03Z", "content": "Geneva | Agencies: At a time when the whole world battling the novel coronavirus, the World Health Organisation (WHO) has said that there is no evidence that patients who recovered from the deadly infection have antibodies for the virus and are protected from… [+1873 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Reuters", "title": "Fact vs fiction: Heres what you need to know about coronavirus - Geo News", "description": "Read what health experts says about how to treat COVID-19 or stop the transmission of the new coronavirus", "url": "https://www.geo.tv/latest/284878-fact-vs-fiction-heres-what-you-need-to-know-about-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T12:55:28Z", "content": "If you like us are wondering whether US President Donald Trumps musings about disinfectants and ultraviolet light can be used to treat COVID-19 are true or false, here's a breakdown of what's true and false about the disease. \r\nTREATMENT\r\nFiction: Disinfectan… [+2869 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "WHO says no evidence recovered COVID-19 patients are immune to reinfection - The Times of Israel", "description": "UN health agency warns against notion of 'immunity passports,' saying they could risk further transmission of the coronavirus", "url": "https://www.timesofisrael.com/who-says-no-evidence-recovered-covid-19-patients-immune-to-reinfection/", "urlToImage": null, "publishedAt": "2020-04-25T12:54:26Z", "content": "The World Health Organization on Saturday said there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection, cautioning against the idea of immunity passports.\r\nThe concept of immunit… [+4204 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "World Malaria Day : Fighting malaria alongside COVID-19 - ETHealthworld.com", "description": "Productivity losses from malaria are estimated to cost the Indian economy $3 billion every year. Despite this, malaria remains almost invisible in the public eye.", "url": "https://health.economictimes.indiatimes.com/news/industry/world-malaria-day-fighting-malaria-alongside-covid-19/75377775", "urlToImage": null, "publishedAt": "2020-04-25T12:45:22Z", "content": "By Jayeeta Chowdhury, Prog. Director &amp; Sagar Atre, Prog. Manager, India Health Fund, Tata TrustsThe ongoing COVID-19 pandemic has served as a painful reminder for countries across the world to have strong health systems which can provide the necessary car… [+5330 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Sweden goes it alone with 'relaxed' attitude to coronavirus - CGTN", "description": "Sweden's relaxed restrictions could lead to herd immunity but at what cost?", "url": "https://newseu.cgtn.com/news/2020-04-25/Sweden-goes-it-alone-with-relaxed-attitude-to-coronavirus-PYIUqQSwH6/index.html", "urlToImage": null, "publishedAt": "2020-04-25T12:41:25Z", "content": "Everyone wants immunity from the coronavirus. But there may be different ways to get it.\r\nOne is a vaccine. Clinical trials are already underway in the UK, and if all goes well, say those involved, it's possible a vaccination may be ready for production by Se… [+3523 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Coronavirus And Smoking: French Researchers Suggest Nicotine Could Protect Against Coronavirus - Swarajya", "description": "", "url": "https://swarajyamag.com/news-brief/coronavirus-and-smoking-french-researchers-suggest-nicotine-could-protect-against-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T11:31:00Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus Explained: how the virus will hit the poorest people on the planet - Channel 4 News", "description": "The coronavirus pandemic is affecting the world, no matter who you are and where you come from. (Subscribe: https://bit.ly/C4_News_Subscribe) Covid-19 is dev...", "url": "https://www.youtube.com/watch?v=QorckhwMLR0", "urlToImage": null, "publishedAt": "2020-04-25T11:05:09Z", "content": "The coronavirus pandemic is affecting the world, no matter who you are and where you come from. (Subscribe: https://bit.ly/C4_News_Subscribe) \r\nCovid-19 is devastating countries across the globe, with some of the wealthiest nations struggling to contain the s… [+522 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "COVID-19 Vaccines: 'We're Starting With Optimism' - Medscape", "description": "References and COVID-19 resource: https://wb.md/2zhMmDE WebMD Chief Medical Officer John Whyte talks with Dr William Schaffner about the search for a COVID-1...", "url": "https://www.youtube.com/watch?v=UB5NvAs8-EI", "urlToImage": null, "publishedAt": "2020-04-25T11:00:23Z", "content": "References and COVID-19 resource: https://wb.md/2zhMmDE\r\nWebMD Chief Medical Officer John Whyte talks with Dr William Schaffner about the search for a COVID-19 vaccine, the outlook for treatments, and problems with antibody testing.\r\nWe are a partner of WebMD… [+67 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Reuters", "title": "'No evidence' yet that recovered COVID-19 patients cannot be reinfected - WHO - Deccan Herald", "description": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection. Track live updates on coronavirus here", "url": "https://www.deccanherald.com/international/no-evidence-yet-that-recovered-covid-19-patients-cannot-be-reinfected-who-829770.html", "urlToImage": null, "publishedAt": "2020-04-25T10:58:06Z", "content": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nTrack live updates on coronavirus here\r\nIn a state… [+494 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Coronavirus and Covid-19: Here's a Quick Glance at Fact Versus Fiction - News18", "description": "There are currently no specific proven medicines for COVID-19 infection, but those infected can relieve and treat mild symptoms with over-the-counter fever-reducing medicines such as acetaminophen, also known as paracetamol, and aspirin.", "url": "https://www.news18.com/news/world/coronavirus-and-covid-19-heres-a-quick-glance-at-fact-versus-fiction-2592357.html", "urlToImage": null, "publishedAt": "2020-04-25T10:14:57Z", "content": "US President Donald Trump's musings about whether disinfectants and ultraviolet light can be inserted into patients' bodies to treat COVID-19 have alarmed doctors and drawn warnings from the makers of Lysol, Dettol and Clorox.\r\nHere are some other claims that… [+3052 chars]"}, {"source": {"id": null, "name": "Sputniknews.com"}, "author": null, "title": "WHO Says No Evidence People Who Have COVID-19 Antibodies Protected from Second Infection - Sputnik International", "description": "As of 25 April, the number of confirmed coronavirus cases globally stands at 2,686,785, with 184,681 deaths, according to the World Health Organisation.", "url": "https://sputniknews.com/world/202004251079089652-who-says-no-evidence-people-who-have-covid-19-antibodies-protected-from-second-infection/", "urlToImage": null, "publishedAt": "2020-04-25T10:10:35Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "'No evidence' that recovered COVID-19 patients cannot be reinfected: WHO - Reuters", "description": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.", "url": "https://www.reuters.com/article/us-health-coronavirus-who-idUSKCN2270FB", "urlToImage": null, "publishedAt": "2020-04-25T09:50:00Z", "content": "GENEVA (Reuters) - The World Health Organization (WHO) said on Saturday that there was currently “no evidence” that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection. \r\nIn a scientific brief, the Uni… [+1753 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "Bats cannot directly infect humans with Covid-19: Scientists - Hindustan Times", "description": "According to scientists, Sars-Cov-2 may have diverged from the closest coronavirus found in bats called RaTG13, about 40 to 70 years ago, indicating that the bat virus cannot directly infect humans.", "url": "https://www.hindustantimes.com/india-news/bats-cannot-directly-infect-humans-with-covid-19-scientists/story-uuEwHKcI0x266H1fxawFbN.html", "urlToImage": null, "publishedAt": "2020-04-25T09:30:44Z", "content": "Sixty-four scientists have said bats do not spread Covid-19 after reports of people requesting local authorities to clear trees over a fear of the colonies the winged mammals host.\r\nThe chiropterologists issuing the statement said they came together after rep… [+3518 chars]"}, {"source": {"id": null, "name": "Trtworld.com"}, "author": "TRTWorld", "title": "WHO warns against idea of 'immunity passports' - TRT World", "description": "The concept of “immunity passports” or “risk-free certificates” has been floated as a way of allowing people protected against reinfection to return to work.", "url": "https://www.trtworld.com/life/who-warns-against-idea-of-immunity-passports-35737", "urlToImage": null, "publishedAt": "2020-04-25T08:52:43Z", "content": "The concept of immunity passports or risk-free certificates has been floated as a way of allowing people protected against reinfection to return to work.\r\nThis Wednesday, March 11, 2015 photo shows the World Health Organization headquarters building in Geneva… [+1045 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "AP", "title": "Coronavirus: WHO warns against idea of 'immunity passports' - Deccan Herald", "description": "The World Health Organization is cautioning against the idea of “immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.", "url": "https://www.deccanherald.com/international/world-news-politics/coronavirus-world-health-organization-warns-against-idea-of-immunity-passports-829739.html", "urlToImage": null, "publishedAt": "2020-04-25T08:50:01Z", "content": "The World Health Organization is cautioning against the idea of immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.\r\nThe concept of immunity pas… [+813 chars]"}, {"source": {"id": null, "name": "Ibgnews.com"}, "author": "https://www.facebook.com/suman.munshi", "title": "WHO talks of “Immunity passports” in the context of COVID-19 - IBG NEWS", "description": "“Immunity passports” in the context of COVID-19 WHO Press Report – Scientific Brief 24 April 2020 WHO has published guidance on adjusting public health and social measures for the next phase of the COVID-19 response.1 Some governments have suggested that the …", "url": "https://ibgnews.com/who-talks-of-immunity-passports-in-the-context-of-covid-19/", "urlToImage": null, "publishedAt": "2020-04-25T08:42:01Z", "content": "24 April 2020\r\nWHO has published guidance on adjusting public health and social measures for the next phase of the COVID-19 response.1 Some governments have suggested that the detection of antibodies to the SARS-CoV-2, the virus that causes COVID-19, could se… [+8240 chars]"}, {"source": {"id": null, "name": "Dailysabah.com"}, "author": "Associated Press", "title": "WHO urges against idea of 'immunity passports' | Daily Sabah - Daily Sabah", "description": "The World Health Organization is cautioning against the idea of \"immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19...", "url": "https://www.dailysabah.com/world/who-urges-against-idea-of-immunity-passports/news", "urlToImage": null, "publishedAt": "2020-04-25T08:28:41Z", "content": "The World Health Organization is cautioning against the idea of \"immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second case of infection.\r\nThe concept of \"im… [+816 chars]"}, {"source": {"id": null, "name": "Thepeninsulaqatar.com"}, "author": "", "title": "Why has Spain been hit so hard by the coronavirus pandemic? - The Peninsula Qatar", "description": "In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told AFP.", "url": "https://www.thepeninsulaqatar.com/article/25/04/2020/Why-has-Spain-been-hit-so-hard-by-the-coronavirus-pandemic", "urlToImage": null, "publishedAt": "2020-04-25T08:01:00Z", "content": "Barcelona: In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told AFP.\r\nWhile they stressed it was too early to carry out a detailed analysis, th… [+4426 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": "https://www.facebook.com/dineshRewale", "title": "e-Agenda AajTak: Not just stay at home but also do yoga at home, says Ramdev - dineshr", "description": "In the wake of the coronavirus pandemic and the nationwide lockdown, people should not just stay and work at home, but they must also perform yoga at home, said yoga…", "url": "https://www.indiatoday.in/india/story/e-agenda-aajtak-yoga-ramdev-coronavirus-pandemic-lockdown-1670908-2020-04-25?utm_source=rss", "urlToImage": null, "publishedAt": "2020-04-25T07:21:40Z", "content": "In the wake of the coronavirus pandemic and the nationwide lockdown, people should not just stay and work at home, but they must also perform yoga at home, said yoga guru Ramdev on Saturday.\r\nRamdev was speaking at a special session at the e-Agenda Aaj Tak.\r\n… [+739 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Callum Hoare", "title": "‘Reservoir for viruses’ China told to permanently ban bat trade to prevent next pandemic - Express.co.uk", "description": "CHINA must permanently ban the hunting trade and consumption of wildlife animals, including bats, or a future pandemic similar to coronavirus is inevitable, research shows.", "url": "https://www.express.co.uk/news/world/1273464/china-xi-jinping-bat-animal-trade-coronavirus-pandemic-covid19-wuhan-seafood-market-spt", "urlToImage": null, "publishedAt": "2020-04-25T07:00:00Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Nations join WHO in virus initiative, but not US - The Star", "description": "World leaders pledged on Friday to accelerate work on tests, drugs and vaccines against Covid-19 and to share them around the globe. But the United States di...", "url": "https://www.youtube.com/watch?v=BSi5E7Grjx8", "urlToImage": null, "publishedAt": "2020-04-25T06:51:50Z", "content": "World leaders pledged on Friday to accelerate work on tests, drugs and vaccines against Covid-19 and to share them around the globe. But the United States did not take part in the launch.\r\nWATCH MORE: https://thestartv.com/c/newsSUBSCRIBE: https://cutt.ly/The… [+37 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Lifestyle Desk", "title": "World Malaria Day 2020: Does malaria continue to be a threat during Covid-19 outbreak? - The Indian Express", "description": "The early symptoms of COVID-19, including fever, myalgia and fatigue, might be confused with malaria and lead to challenges in early clinical diagnosis.", "url": "https://indianexpress.com/article/lifestyle/health/world-malaria-day-2020-malaria-mosquito-coronavirus-pandemic-lockdown-fogging-6378515/", "urlToImage": null, "publishedAt": "2020-04-25T06:10:36Z", "content": "By: Lifestyle Desk | New Delhi | \r\nPublished: April 25, 2020 11:21:33 am\r\nMarch and April are crucial months when preventive measures such asfogging, fumigation and awareness campaigns are undertaken. (Source: File/Getty Images/Thinkstock)While social distanc… [+3820 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Coronavirus in Italy may have started unnoticed in January: Study - Al Jazeera English", "description": "The surge in cases after the first diagnosis suggests the virus had been in Italy longer than realised, say researchers.", "url": "https://www.aljazeera.com/news/2020/04/coronavirus-italy-started-unnoticed-january-study-200424214841332.html", "urlToImage": null, "publishedAt": "2020-04-25T06:08:57Z", "content": "The first coronavirus infections in Italy date back to January, according to a scientific study presented on Friday, shedding new light on the origins of the outbreak in one of the world's worst-affected countries.\r\nItaly began testing people after diagnosing… [+2322 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "World Malaria Day 2020: WHO's anti-malaria campaign and target to eliminate malaria from 35 more... - Firstpost", "description": "According to WHO reports, malaria affected more than 228 million people in the world in 2018 and killed about 405,000 people globally in the same year.", "url": "https://www.firstpost.com/health/world-malaria-day-2020-whos-anti-malaria-campaign-and-target-to-eliminate-malaria-from-35-more-countries-by-2030-8298691.html", "urlToImage": null, "publishedAt": "2020-04-25T06:06:06Z", "content": null}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "Coronavirus and COVID-19: Fact versus fiction - The Jakarta Post - Jakarta Post", "description": "Here are some claims that have circulated about how to treat COVID-19 or stop the transmission of the new coronavirus, and the facts according to doctors and health experts.", "url": "https://www.thejakartapost.com/life/2020/04/25/coronavirus-and-covid-19-fact-versus-fiction.html", "urlToImage": null, "publishedAt": "2020-04-25T05:35:00Z", "content": "US President Donald Trump's musings about whether disinfectants and ultraviolet light can be inserted into patients' bodies to treat COVID-19 have alarmed doctors and drawn warnings from the makers of Lysol, Dettol and Clorox.\r\nHere are some other claims that… [+3208 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Nitin Sreedhar", "title": "When a virus jumps: of man, microbes and pandemics - Livemint", "description": "Climate change effects or complex man-animal interactions—why are zoonotic disease outbreaks like covid-19 becoming more frequent?", "url": "https://www.livemint.com/mint-lounge/features/when-a-virus-jumps-of-man-microbes-and-pandemics-11587735889206.html", "urlToImage": null, "publishedAt": "2020-04-25T05:10:40Z", "content": "Inger Andersen, executive director of the UN Environment Programme, said last month that nature was sending humankind a message\" through the coronavirus pandemic and climate crisis. In an interview with The Guardian, the Danish environmentalist said there wer… [+10236 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "1752 Coronavirus Cases Reported On Friday, Biggest Single Day Spike | Coronavirus Outbreak - CNBC-TV18", "description": "India's fight against coronavirus has reached on the critical phase as the total number of coronavirus cases have crossed 23,000. Out of which 1750 cases wer...", "url": "https://www.youtube.com/watch?v=GnPn5O0s-v4", "urlToImage": null, "publishedAt": "2020-04-25T04:48:57Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What COVID-19 Symptoms Should People Be On The Lookout For? - WCCO - CBS Minnesota", "description": "There are so many unknowns about COVID-19. But, one thing has been clear – the virus can present itself differently in different people, Heather Brown report...", "url": "https://www.youtube.com/watch?v=Ml0aBNKYVyc", "urlToImage": null, "publishedAt": "2020-04-25T03:58:36Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Coronavirus Detected on Air Pollution Particles That May Carry It Over Long Distances, Scientists Warn - News18", "description": "Leonardo Setti at the University of Bologna in Italy said it was imperative to investigate if the the coronavirus could be transported through air pollution.", "url": "https://www.news18.com/news/world/coronavirus-detected-on-air-pollution-particles-that-may-carry-it-over-long-distances-scientists-warn-2591919.html", "urlToImage": null, "publishedAt": "2020-04-25T03:39:15Z", "content": "The novel coronavirus has been found on air pollution particles by scientists who are studying if this could allow the virus to advance longer distances, resulting in more number of people contracting it, The Guardian reported.\r\nThe work is still in the initi… [+2716 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "G Thing: Pet fashion designer finds unique ways to give back to animal rescue crews - PIX11 News", "description": "She's one of the most in demand New York fashion designers for dog and cats.", "url": "https://www.youtube.com/watch?v=WcRkfwYZcdU", "urlToImage": null, "publishedAt": "2020-04-25T03:02:18Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Abc7.com"}, "author": null, "title": "'COVID toes' may be new symptom of coronavirus, doctors say - KABC-TV", "description": "Doctors say there may be a new symptom of coronavirus they are calling \"Covid Toes.\"", "url": "https://abc7.com/covid-toes-covid19-coronavirus-symptoms/6128227/", "urlToImage": null, "publishedAt": "2020-04-25T02:05:31Z", "content": "Doctors say there may be a new symptom of coronavirus they are calling \"Covid Toes.\"Doctors treating patients with COVID-19 say they're finding red, purple, or blue lesions on some people's toes.\r\nRELATED: Coronavirus: Skin rashes emerge as possible symptom o… [+223 chars]"}, {"source": {"id": null, "name": "Telegraphindia.com"}, "author": "By G.S. Mudur", "title": "Doctors: Monitor every Covid patient given HCQ - Telegraph India", "description": "The HCQ and azithromycin combination carries the risk of drug-induced sudden cardiac death", "url": "https://www.telegraphindia.com/india/coronavirus-outbreak-doctors-ask-to-monitor-every-covid-19-patient-given-hcq/cid/1767906", "urlToImage": null, "publishedAt": "2020-04-24T23:26:19Z", "content": "Every Covid-19 patient given the hydroxychloroquine (HCQ) and azithromycin combination should be monitored for adverse cardiac effects, doctors in India and the US said on Friday in cautionary research papers about the therapy adopted by India, the US and oth… [+3153 chars]"}, {"source": {"id": null, "name": "Thelancet.com"}, "author": null, "title": "COVID-19 deaths in Lombardy, Italy: data in context - The Lancet", "description": "Italy has one of the highest 2019 coronavirus disease (COVID-19) clinical burdens\nin the world. Although national-level data have been published,1 such data allow weaker\ninterpretation of the COVID-19 outbreak in Italy compared with regional-level data.\nThe r…", "url": "https://www.thelancet.com/journals/lanpub/article/PIIS2468-2667(20)30099-2/fulltext", "urlToImage": null, "publishedAt": "2020-04-24T22:33:37Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. By continuing you agree to the use of cookies.\r\nCopyright © 2020 Elsevier Inc. except certain content provided by third parties.\r\nPrivacy Policy   Terms and Conditions"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Expectant mothers prepare to have children in the midst of COVID-19 pandemic - CBS 17", "description": "Expectant mothers prepare to have children in the midst of COVID-19 pandemic", "url": "https://www.youtube.com/watch?v=xf3lExxSb94", "urlToImage": null, "publishedAt": "2020-04-24T22:09:28Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Samantha  Black, PhD, The Science Advisory Board staff writer", "title": "Experts discuss promising strategies for tackling SARS-CoV-2 - The Science Board", "description": "What's the best strategy for developing treatments for the SARS-CoV-2 virus? The most promising approaches for a rapid response are antivirals and gene therapy, according to a new review article published April 24 in <em>Frontiers in Microbiology</em>.", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=687", "urlToImage": null, "publishedAt": "2020-04-24T19:24:18Z", "content": "In an unprecedented effort, hundreds of thousands of researchers and clinicians from around the world are fighting against the clock to develop cures, vaccines, and diagnostics for COVID-19, the illness caused by the virus SARS-CoV-2. To date, over 1,650 acad… [+6253 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "Experts demolish studies suggesting COVID-19 is no worse than flu - Ars Technica", "description": "Authors of widely publicized antibody studies “owe us all an apology,” one expert says.", "url": "https://arstechnica.com/science/2020/04/experts-demolish-studies-suggesting-covid-19-is-no-worse-than-flu/", "urlToImage": null, "publishedAt": "2020-04-24T17:33:00Z", "content": "Enlarge/ A COVID-19 blood test is administered outside of Delmont Medical Care on April 22, 2020 in Franklin Square, New York. The test identifies antibodies to the coronavirus. \r\n135 with 85 posters participating\r\nFrustrated statisticians and epidemiologists… [+9053 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Does COVID-19 Cause Blood Clot Complications? | NBC New York - NBC New York", "description": "A small study of five critically ill COVID-19 patients at Mount Sinai Hospital in New York City could have major implications for how doctors respond to the ...", "url": "https://www.youtube.com/watch?v=twPd0YvY3T0", "urlToImage": null, "publishedAt": "2020-04-24T17:18:33Z", "content": null}, {"source": {"id": null, "name": "Greaterkashmir.com"}, "author": null, "title": "First patients injected in UK vaccine trial - Greater Kashmir", "description": "First patients injected in UK vaccine trial Greater Kashmir | The first human trial in Europe of a coronavirus vaccine has begun in Oxford. Two volunteers were injected, the first of more than 800 people recruited", "url": "https://www.greaterkashmir.com/news/world/first-patients-injected-in-uk-vaccine-trial/", "urlToImage": null, "publishedAt": "2020-04-24T15:19:00Z", "content": "The first human trial in Europe of a coronavirus vaccine has\r\nbegun in Oxford.\r\nTwo volunteers were injected, the first of more than 800\r\npeople recruited for the study, the BBC reported.\r\nHalf will receive the COVID-19 vaccine, and half a control\r\nvaccine wh… [+2199 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "David Nikel", "title": "Sweden Health Chief Admits ‘It’s Not Over’ As Coronavirus Cases Leap - Forbes", "description": "Following an additional 131 deaths reported in the last 24 hours, Sweden’s COVID-19 death toll now stands at 2,152.", "url": "https://www.forbes.com/sites/davidnikel/2020/04/24/sweden-health-chief-admits-its-not-over-as-coronavirus-cases-leap/", "urlToImage": null, "publishedAt": "2020-04-24T15:09:59Z", "content": "Sweden's state epidemiologist Anders Tegnell has said the number of COVID-19 deaths in Sweden have ... [+] been higher than expected.\r\nAFP via Getty Images\r\nSwedens state epidemiologist Anders Tegnell has announced a record daily high of coronavirus cases for… [+3119 chars]"}, {"source": {"id": null, "name": "Healio.com"}, "author": null, "title": "Dermatology expert weighs in on 'COVID toes,' tracking dermatologic symptoms of COVID-19 - Healio", "description": "As the world continues to struggle with the COVID-19 pandemic, new symptoms of the virus continue to be identified. One such symptom, purple or red lesions on the toes and hands, has been dubbed &ldquo;COVID toes&rdquo; and has gained attention over recent we…", "url": "https://www.healio.com/dermatology/dermatitis/news/online/{1f54025b-e860-4862-979d-46daebae6818}/dermatology-expert-weighs-in-on-covid-toes-tracking-dermatologic-symptoms-of-covid-19", "urlToImage": null, "publishedAt": "2020-04-24T14:39:27Z", "content": "As the world continues to struggle with the COVID-19 pandemic, new symptoms of the virus continue to be identified. One such symptom, purple or red lesions on the toes and hands, has been dubbed “COVID toes” and has gained attention over recent weeks. \r\nHeali… [+15263 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AFP", "title": "Coronavirus vaccine: Monkeys largely protected during trial, says Chinese firm - Livemint", "description": "Sinovac Biotech said it injected two different doses of its vaccine into eight rhesus macaque monkeys and exposed them to the virus three weeks later, and they did not develop infections", "url": "https://www.livemint.com/news/world/coronavirus-vaccine-monkeys-largely-protected-during-trial-says-chinese-firm-11587736770613.html", "urlToImage": null, "publishedAt": "2020-04-24T14:13:47Z", "content": "A novel coronavirus vaccine has for the first time \"largely protected\" monkeys from infection during an animal trial, data from a Chinese pharmaceutical giant showed.It is among a slew of vaccines being developed around the world as countries race to stop an … [+3317 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Novel Coronavirus Is A Result Of Crazy Experiments At Wuhan Institute of Virology: Top Russian Microbiologist - Swarajya", "description": "", "url": "https://swarajyamag.com/insta/novel-coronavirus-is-a-result-of-crazy-experiments-at-wuhan-institute-of-virology-top-russian-microbiologist", "urlToImage": null, "publishedAt": "2020-04-24T13:42:15Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "New York Times", "title": "Nearly All Patients Hospitalized With Covid-19 Had Chronic Health Issues, Study Finds - Times of India", "description": "A new study of thousands of hospitalized coronavirus patients in the New York City area, the epicenter of the outbr", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/nearly-all-patients-hospitalized-with-covid-19-had-chronic-health-issues-study-finds/articleshow/75347362.cms", "urlToImage": null, "publishedAt": "2020-04-24T13:20:37Z", "content": "A new study of thousands of hospitalized coronavirus patients in the New York City area, the epicenter of the outbreak in the United States, has found that nearly all of them had at least one major chronic health condition, and most 88 percent had at least tw… [+5568 chars]"}, {"source": {"id": null, "name": "Imperial.ac.uk"}, "author": null, "title": "Coronavirus 'map' identifies key virus entry points into the body | Imperial News - Imperial College London", "description": "Scientists are creating a map of the human body to identify locations where the COVID-19 virus can enter human cells.", "url": "https://www.imperial.ac.uk/news/197114/coronavirus-identifies-virus-entry-points-into/", "urlToImage": null, "publishedAt": "2020-04-24T11:36:27Z", "content": "Scientists are creating a map of the human body to identify locations where the COVID-19 virus can enter human cells.\r\nThe research, from a number of international institutions including Imperial College London, has so far identified likely initial infection … [+5951 chars]"}, {"source": {"id": null, "name": "Selectscience.net"}, "author": "SelectScience", "title": "Pfizer, BioNTech COVID-19 vaccine cleared for human tests - SelectScience", "description": "Pfizer and BioNTech to start human trials of COVID-19 vaccine", "url": "https://www.selectscience.net/industry-news/pfizer-and-biontech-to-start-human-trials-of-covid-19-vaccine/?artID=51330", "urlToImage": null, "publishedAt": "2020-04-24T09:09:30Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "PTI", "title": "India May See Second Wave of Covid-19 Outbreak in Late July-August, Say Scientists - News18", "description": "The second epidemic may come back in late July or August in the monsoon, although the peak timing will depend on how we control social distancing during that time, scientists said.", "url": "https://www.news18.com/news/india/india-may-see-second-wave-of-covid-19-outbreak-in-late-july-august-say-scientists-2590949.html", "urlToImage": null, "publishedAt": "2020-04-24T09:00:17Z", "content": "New Delhi: The trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the lockdown is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say scient… [+6652 chars]"}, {"source": {"id": null, "name": "Deccanchronicle.com"}, "author": null, "title": "Second wave of coronavirus infections in India likely during monsoon: Scientists - Deccan Chronicle", "description": "The finding is critical to governments globally, because it warns against premature relaxation of strict interventions", "url": "https://www.deccanchronicle.com/lifestyle/health-and-wellbeing/240420/second-wave-of-coronavirus-infections-in-india-likely-during-monsoon.html", "urlToImage": null, "publishedAt": "2020-04-24T08:36:00Z", "content": "New Delhi: The trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the lockdown is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say scient… [+6186 chars]"}, {"source": {"id": null, "name": "Todayonline.com"}, "author": null, "title": "Nearly all patients hospitalised with Covid-19 had chronic health issues, study finds - TODAYonline", "description": "NEW YORK — A new study of thousands of hospitalised coronavirus patients in the New York City area, the epicenter of the outbreak in the United States, has found that nearly all of them had at least one major chronic health condition, and most — 88 per cent —…", "url": "https://www.todayonline.com/world/nearly-all-patients-hospitalised-covid-19-had-chronic-health-issues-study-finds", "urlToImage": null, "publishedAt": "2020-04-24T06:23:32Z", "content": null}, {"source": {"id": null, "name": "Kgw.com"}, "author": "Whitney Woodworth Salem Statesman Journal", "title": "Oregon State University researcher: Vitamins C, D can help prevent COVID-19 - KGW.com", "description": "This is not new science, the role nutrition plays in supporting the immune system is well-established.", "url": "https://www.kgw.com/article/news/local/oregon-state-university-researcher-vitamins-c-d-can-help-prevent-covid-19/283-2cbd044f-98a4-47be-99db-fd61222d6530", "urlToImage": null, "publishedAt": "2020-04-24T03:41:00Z", "content": "CORVALLIS, Ore. Supplements containing vitamins C and D, along with other micronutrients, can be a \"safe, effective and low-cost\" means to fight off COVID-19 and other acute respiratory tract diseases, according to an Oregon State University researcher.\r\nAdri… [+5705 chars]"}]}