{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Oxford Vaccine Human Trials Begin, Serum Is A Partner | Coronavirus Pandemic - CNBC-TV18", "description": "As the world fights coronavirus, the vaccine would be the more definitive & effective weapon. The WHO said as of 11th April over 70 vaccine candidates are in...", "url": "https://www.youtube.com/watch?v=Xynpp7rHs48", "urlToImage": null, "publishedAt": "2020-04-26T08:25:38Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Women face anxiety over pregnancy and birth in US - TRT World", "description": "For many women, being pregnant comes with its own set of fears and anxiety. But being pregnant during the Covid-19 pandemic takes those fears to a whole new ...", "url": "https://www.youtube.com/watch?v=gagwijdvCR0", "urlToImage": null, "publishedAt": "2020-04-26T08:10:16Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Vaccine Race - 1 NEWS", "description": "Many countries, like Australia, the United States, and especially China, are in a bio-tech arm race to develop – and own – a Covid-19 vaccine. It’s what the ...", "url": "https://www.youtube.com/watch?v=pWBtHhZDpUc", "urlToImage": null, "publishedAt": "2020-04-26T07:30:04Z", "content": null}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Don't issue virus 'immunity passports': WHO - Telangana Today", "description": "Geneva: Governments should not issue so-called immunity passports or risk-free certificates as a way of easing lockdowns, the World Health Organization (WHO) said. The WHO's guidance is based on evidence from researchers all around the world. But it could wel…", "url": "https://telanganatoday.com/dont-issue-virus-immunity-passports-who", "urlToImage": null, "publishedAt": "2020-04-26T06:15:00Z", "content": "Geneva: Governments should not issue so-called “immunity passports” or “risk-free certificates” as a way of easing lockdowns, the World Health Organization (WHO) said.\r\nThe WHO’s guidance is based on evidence from researchers all around the world. But it coul… [+2984 chars]"}, {"source": {"id": null, "name": "Mercurynews.com"}, "author": "David DeBolt, Thomas Peele", "title": "Coronavirus: First known victim in U.S. died of “burst” heart, pathologist says - The Mercury News", "description": "“There’s an indication the heart was weakened,” Melinek said. “The immune system was attacking the virus and in attacking the virus it damaged the heart and then the heart basically burst.”…", "url": "https://www.mercurynews.com/coronavirus-first-known-victim-in-u-s-died-of-burst-heart-pathologist-says", "urlToImage": null, "publishedAt": "2020-04-26T05:48:16Z", "content": "A Santa Clara County woman now believed to be the first person in the U.S. killed by the novel coronavirus died of a ruptured heart caused by her body’s struggle to defeat the virus, her autopsy shows.\r\nPatricia Dowd, 57, of San Jose, died at home on Feb. 6 o… [+1995 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Indore coronavirus strain may be deadlier, will send samples to NIV: Doctors - Deccan Herald", "description": "Doctors treating COVID-19 cases in Indore say a more virulent strain may be wrecking havoc in the city, which has emerged as the coronavirus hotspot in Madhya Pradesh.", "url": "https://www.deccanherald.com/national/north-and-central/indore-coronavirus-strain-may-be-deadlier-will-send-samples-to-niv-doctors-830015.html", "urlToImage": null, "publishedAt": "2020-04-26T05:04:01Z", "content": "Doctors treating COVID-19 cases in Indore say a more virulent strain may be wrecking havoc in the city, which has emerged as the coronavirus hotspot in Madhya Pradesh.\r\nThey say samples from Indore, where COVID-19 has killed 57 people, will be sent to the Pun… [+1319 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Developing strategies for management of Covid-19 - Telangana Today", "description": "We have witnessed several catastrophes and the way they were handled by governments with inputs from science. Today, in a knowledge-based society that uses Information Technology tools extensively, it has become possible to rapidly bring out products by short…", "url": "https://telanganatoday.com/developing-strategies-for-management-of-covid-19", "urlToImage": null, "publishedAt": "2020-04-26T04:44:53Z", "content": "We have witnessed several catastrophes and the way they were handled by governments with inputs from science. Today, in a knowledge-based society that uses Information Technology tools extensively, it has become possible to rapidly bring out products by short… [+8264 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "WHO Advices Against Immunity Passports, Says No Evidence Suggests You’re Protected After Getting It Once - Swarajya", "description": "Some governments have considered permitting people who have recovered to travel or return to work.", "url": "https://swarajyamag.com/insta/who-advices-against-immunity-passports-says-no-evidence-suggests-youre-protected-after-getting-it-once", "urlToImage": null, "publishedAt": "2020-04-26T04:17:39Z", "content": null}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "Second wave of COVID-19 may hit India during monsoon months - Northeast Now", "description": "Though coronavirus cases in India may go down substantially in the coming days, it may again resurface during the monsoon months. According to an India Times report, the second wave is expected to hit the country in the months of July and August. However, acc…", "url": "https://nenow.in/top-news/second-wave-of-covid-19-may-hit-india-during-monsoon-months.html/", "urlToImage": null, "publishedAt": "2020-04-26T03:20:07Z", "content": "Though coronavirus cases in India may go down substantially in the coming days, it may again resurface during the monsoon months.\r\nAccording to an India Times report, the second wave is expected to hit the country in the months of July and August.\r\nHowever, a… [+840 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Hindustan Times", "title": "India records biggest single day spike, virus can survive on particulate matter: Covid-19 news today - Hindustan Times", "description": "Here is a preview of the important Covid-19 stories from India and world today.", "url": "https://www.hindustantimes.com/india-news/india-records-biggest-single-day-spike-virus-can-survive-on-particulate-matter-covid-19-news-today/story-WANk0UoFH42j3DcDdXLDSM.html", "urlToImage": null, "publishedAt": "2020-04-26T02:48:01Z", "content": "India’s tally of confirmed coronavirus disease (Covid-19) cases shot past the 26,000-mark on Saturday with the biggest single-day spike in infections. Tests in Italy found the Sars-CoV-2 virus, which causes Covid-19, can cling to air pollution particles.\r\nInd… [+4828 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "No evidence that recovered COVID-19 patients cannot be reinfected, 'immunity passports' could increase... - Firstpost", "description": "In a scientific brief, the United Nations agency warned governments against issuing “immunity passports” or “risk-free certificates” to people who have been infected as their accuracy could not be guaranteed.", "url": "https://www.firstpost.com/world/no-evidence-that-recovered-covid-19-patients-cannot-be-reinfected-immunity-passports-could-increase-spread-says-who-8300901.html", "urlToImage": null, "publishedAt": "2020-04-26T02:32:57Z", "content": "Geneva: The World Health Organization (WHO) said on Saturday that there was currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nWHO logo. Reuters\r\nIn a scientific brief, th… [+1873 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Bruce Y. Lee", "title": "CDC: Here Are 6 New Possible Symptoms Of COVID-19 Coronavirus - Forbes", "description": "It was only a matter of time before the Centers of Disease Control and Prevention (CDC) added to this list.", "url": "https://www.forbes.com/sites/brucelee/2020/04/25/cdc-here-are-6-new-possible-symptoms-of-covid-19-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-26T01:57:16Z", "content": "The Centers for Disease Control and Prevention (CDC) has added six new symptoms to its list of ... [+] possible COVID-19 symptoms. (Photo by TAMI CHAPPELL/AFP via Getty Images)\r\nAFP via Getty Images\r\nIt was only a matter of time before the Centers of Disease … [+5324 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Evgeny Lebedev For The Mail On Sunday", "title": "Shocking picture of bats for sale in Indonesia shows wet markets are still open - Daily Mail", "description": "Since I have begun to write on the urgent need to close live animal markets, I have been surprised by the support I have received from across the UK.", "url": "https://www.dailymail.co.uk/news/article-8257375/Shocking-picture-bats-sale-Indonesia-shows-wet-markets-open.html", "urlToImage": null, "publishedAt": "2020-04-26T00:56:23Z", "content": "Since I have begun to write on the urgent need to close live animal markets, I have been surprised by the support I have received from across the UK. \r\nReaders of The Mail on Sunday have written to say how strongly they agree about the threat of contagion the… [+3244 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Home care workers say they need PPE equipment - KGW News", "description": "Home care providers are essential workers who put their clients and families at risk as they venture out into the world to get their duties done. They say th...", "url": "https://www.youtube.com/watch?v=n8L80xNxlXk", "urlToImage": null, "publishedAt": "2020-04-26T00:40:17Z", "content": null}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Andhra Pradesh: 'Bored' truck driver plays cards with friends, leads to 24 getting coronavirus - Deccan Herald", "description": "A bored truck drivers effort to kill time by indulging in a game of cards with friends and neighbours led to the infection of coronavirus in 24 people in one locality of Vijayawada city in Andhra Pradesh, Krishna district Collector A Md Imtiaz said here on Sa…", "url": "https://www.deccanherald.com/national/south/andhra-pradesh-bored-truck-driver-plays-cards-with-friends-leads-to-24-getting-coronavirus-829973.html", "urlToImage": null, "publishedAt": "2020-04-25T23:05:56Z", "content": "A bored truck drivers effort to kill time by indulging in a game of cards with friends and neighbours led to the infection of coronavirus in 24 people in one locality of Vijayawada city in Andhra Pradesh, Krishna district Collector A Md Imtiaz said here on Sa… [+1218 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "VIDEO: Coronavirus pandemic changing Ramadan celebrations - WFSB 3", "description": "This year, Ramadan celebrations are looking very different because of the coronavirus pandemic.", "url": "https://www.youtube.com/watch?v=6Pp13Nbk12I", "urlToImage": null, "publishedAt": "2020-04-25T22:57:49Z", "content": "This year, Ramadan celebrations are looking very different because of the coronavirus pandemic."}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Why has Spain been hit so hard by the coronavirus pandemic? - India Today", "description": "Experts pointed to the country's sociable lifestyle and close ties between young and older family members as significant factors in the virus's spread.", "url": "https://www.indiatoday.in/world/story/why-spain-hit-hard-by-coronavirus-pandemic-1671126-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T22:00:06Z", "content": "In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told news agency AFP.\r\nWhile they stressed it was too early to carry out a detailed analysis, t… [+4429 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nTom Morgan", "title": "Coronavirus test for anyone traced to a known carrier - Telegraph.co.uk", "description": "The technology should eventually allow symptomless workers to return to their jobs quicker", "url": "https://www.telegraph.co.uk/news/2020/04/25/coronavirus-test-anyone-traced-known-carrier/", "urlToImage": null, "publishedAt": "2020-04-25T20:30:00Z", "content": "In the letter to public health agencies and local authorities, he says the app will work in unison with a call-based system for those without the technology.\r\nHe also refers to the Government's huge recruitment drive to carry out the extra testing. \"There wil… [+2492 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Mehr Gill", "title": "Explained: Types of human coronaviruses and the symptoms they cause - The Indian Express", "description": "While there are hundreds of coronaviruses, there are seven that we know can infect humans.", "url": "https://indianexpress.com/article/explained/types-of-human-coronaviruses-and-symptoms-6368444/", "urlToImage": null, "publishedAt": "2020-04-25T19:50:19Z", "content": "Written by Mehr Gill\r\n | New Delhi | \r\nUpdated: April 25, 2020 6:09:09 pm\r\nHuman coronaviruses were first characterised in the mid-1960s and they are mostly considered to be responsible for causing upper respiratory tract infections in children. (AP illustrat… [+6888 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Milly Vincent For Mailonline", "title": "Six-month-old baby given guard of honour as she is released from isolation after beating covid-19 - Daily Mail", "description": "Six-month-old Erin Bates is one of the youngest people to catch the infection and spent the last 14 days alone in isolation at Alder Hey Children's Hospital in Liverpool. She has made a full recovery.", "url": "https://www.dailymail.co.uk/news/article-8256649/Six-month-old-baby-given-guard-honour-released-isolation-beating-covid-19.html", "urlToImage": null, "publishedAt": "2020-04-25T18:55:14Z", "content": "This the touching moment a 'miracle baby' was given a guard of honour by tearful nurses and doctors after she beat Covid-19 and was wheeled out of isolation today.\r\nSix-month-old Erin Bates is one of the youngest people to catch the infection and has spent th… [+2296 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ariana Eunjung Cha", "title": "Spike in stroke deaths in patients with only minor coronavirus symptoms - The Independent", "description": "Reports of strokes in the young and middle-aged are the latest twist in our evolving understanding of the mysteries of the virus, finds Ariana Eunjung Cha", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-stroke-deaths-symptoms-covid-19-heart-a9484091.html", "urlToImage": null, "publishedAt": "2020-04-25T18:45:03Z", "content": "Thomas Oxley wasnt even on call the day he received the page to come into Mount Sinai Beth Israel Hospital in Manhattan. There werent enough doctors to treat all the emergency stroke patients, and he was needed in the operating room.\r\nThe patients chart appea… [+9849 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Ramya Kannan", "title": "Coronavirus | Why pathogens travel in search of a host - The Hindu", "description": "What is the link between the virus causing COVID-19 and bats, pangolins and other wild species? Why are zoonotic diseases on the rise?", "url": "https://www.thehindu.com/sci-tech/health/coronavirus-why-pathogens-travel-in-search-of-a-host/article31434762.ece", "urlToImage": null, "publishedAt": "2020-04-25T18:32:00Z", "content": "The story so far: Long before the virus causing COVID-19 vitiated for the world many efficiencies it had taken for granted, it pit many over claims about how the vicious virus came to be in the first place. Claims were made of the virus being manufactured in … [+7586 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Ariana Eunjung Cha", "title": "Young and middle-aged people, barely sick with covid-19, are dying of strokes - The Washington Post", "description": "Doctors sound alarm about patients in their 30s and 40s left debilitated or dead by strokes. Some didn’t even know they were infected by coronavirus.", "url": "https://www.washingtonpost.com/health/2020/04/24/strokes-coronavirus-young-patients/", "urlToImage": null, "publishedAt": "2020-04-25T18:18:21Z", "content": "Oxley gasped when he got to the patients age and covid-19 status: 44, positive.\r\nThe man was among several recent stroke patients in their 30s to 40s who were all infected with the coronavirus. The median age for that type of severe stroke is 74.\r\nAs Oxley, a… [+9467 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "The Hans India", "title": "Finally, US says no to hydroxychloroquine - The Hans India", "description": "The United States Food and Drug Administration has issued a safety communication regarding the known ...", "url": "https://www.thehansindia.com/news/international/finally-us-says-no-to-hydroxychloroquine-619207", "urlToImage": null, "publishedAt": "2020-04-25T18:12:50Z", "content": "Washington: The United States Food and Drug Administration has issued a safety communication regarding the known side effects of anti-malarial drug hydroxychloroquine, touted by President Donald Trump for treating coronavirus patients. \r\nThe side effects incl… [+1746 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WHO: Why should I get vaccinated? - World Health Organization (WHO)", "description": "Without vaccines, we are at risk of serious illness and disability from diseases like measles, meningitis, tetanus and polio. In today' interconnected world,...", "url": "https://www.youtube.com/watch?v=9nadnOxvE74", "urlToImage": null, "publishedAt": "2020-04-25T17:33:39Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "World Malaria Day: Governments urged to prevent rise in deaths - Al Jazeera English", "description": "On World Malaria Day, health officials are warning governments to move fast to prevent a rise in Malaria-related deaths. In Kenya, thousands of people have l...", "url": "https://www.youtube.com/watch?v=64nKBK4kq_w", "urlToImage": null, "publishedAt": "2020-04-25T15:59:04Z", "content": "On World Malaria Day, health officials are warning governments to move fast to prevent a rise in Malaria-related deaths.In Kenya, thousands of people have lost their homes after seasonal torrential rains destroyed them. Now, mosquitos are thriving in the wet … [+340 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "HRD wants universities to study how India handled 1918 Spanish flu, revived economy - Moneycontrol", "description": "The HRD Ministry has been encouraging academic institutions to make research contributions to aid the fight against the deadly coronavirus.", "url": "https://www.moneycontrol.com/news/india/hrd-wants-universities-to-study-how-india-handled-1918-spanish-flu-revived-economy-5189901.html", "urlToImage": null, "publishedAt": "2020-04-25T15:48:35Z", "content": "The HRD Ministry has asked universities to study how India handled the Spanish flu pandemic in 1918 and what measures were taken to boost the economy. The ministry has also advised the universities to set up research teams and study the levels of awareness of… [+1713 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WATCH | National curfew and mandatory cloth face masks to come into effect under Level 4 - News24", "description": "As of 1 May, a national curfew from 20:00 to 05:00 will be in place and it will be applicable to everyone except essential workers traveling to and from work...", "url": "https://www.youtube.com/watch?v=dNs8wczQKNM", "urlToImage": null, "publishedAt": "2020-04-25T15:15:23Z", "content": null}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Govindraj Ethiraj, IndiaSpend.com", "title": "Interview: Given India’s vastness, we need local solutions to fight Covid-19 - Scroll.in", "description": "Professor Ajay Shah on testing strategies India should adopt.", "url": "https://scroll.in/article/960122/interview-given-indias-vastness-we-need-local-solutions-to-fight-covid-19", "urlToImage": null, "publishedAt": "2020-04-25T15:00:00Z", "content": "The lockdown on the Indian economy to contain Covid-19 spead is supposed to continue at least till May 3. Whether it will be lifted, and in what way and in how many cities and states, is not yet known. Most importantly, restarting the economy is not going to … [+14327 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Chris Smith", "title": "Everything we know about Italy’s horrific coronavirus outbreak might’ve just changed - BGR", "description": "New research from Italy says the first local coronavirus cases may have appeared as early as a month before people were diagnosed COVID-19 positive. Italy’s first COVID-19 cases were two Chinese citizens who were tested in Rome on January 31st. Three weeks la…", "url": "https://bgr.com/2020/04/25/coronavirus-stats-italys-covid-19-epidemic-may-have-started-earlier/", "urlToImage": null, "publishedAt": "2020-04-25T14:42:09Z", "content": "<ul><li>New research from Italy says the first local coronavirus cases may have appeared as early as a month before people were diagnosed COVID-19 positive.</li><li>Italy’s first COVID-19 cases were two Chinese citizens who were tested in Rome on January 31st… [+3644 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Scientists have discovered the first significant mutation of the coronavirus - The Times Hub", "description": null, "url": "https://thetimeshub.in/scientists-have-discovered-the-first-significant-mutation-of-the-coronavirus/10797/", "urlToImage": null, "publishedAt": "2020-04-25T13:07:48Z", "content": "A group of researchers from Australia and Taiwan were able to detect the first important mutation in the structure of coronavirus infections SARS-CoV-2. To make this discovery, scientists were able after a detailed analysis of the genetic structure of more th… [+1235 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Associated Press", "title": "Italy to ease Covid-19 lockdown on May 4, give free masks - Hindustan Times", "description": "Italy, with some 26,000 reported deaths, most of them of elderly persons, has Europe’s highest toll from COVID-19.", "url": "https://www.hindustantimes.com/world-news/italy-to-ease-covid-19-lockdown-on-may-4-give-free-masks/story-Z9tKNJW7ULhkpFIXPiCAVJ.html", "urlToImage": null, "publishedAt": "2020-04-25T13:05:38Z", "content": "Italy will start distributing free protective masks to nursing homes, many of which have been devastated by coronavirus infections and deaths.\r\nDomenico Arcuri, the government’s commissioner for the pandemic, says doing so is a “gesture of solidarity and near… [+581 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Reuters", "title": "Fact vs fiction: Heres what you need to know about coronavirus - Geo News", "description": "Read what health experts says about how to treat COVID-19 or stop the transmission of the new coronavirus", "url": "https://www.geo.tv/latest/284878-fact-vs-fiction-heres-what-you-need-to-know-about-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T12:55:28Z", "content": "If you like us are wondering whether US President Donald Trumps musings about disinfectants and ultraviolet light can be used to treat COVID-19 are true or false, here's a breakdown of what's true and false about the disease. \r\nTREATMENT\r\nFiction: Disinfectan… [+2869 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Sweden goes it alone with 'relaxed' attitude to coronavirus - CGTN", "description": "Sweden's relaxed restrictions could lead to herd immunity but at what cost?", "url": "https://newseu.cgtn.com/news/2020-04-25/Sweden-goes-it-alone-with-relaxed-attitude-to-coronavirus-PYIUqQSwH6/index.html", "urlToImage": null, "publishedAt": "2020-04-25T12:41:25Z", "content": "Everyone wants immunity from the coronavirus. But there may be different ways to get it.\r\nOne is a vaccine. Clinical trials are already underway in the UK, and if all goes well, say those involved, it's possible a vaccination may be ready for production by Se… [+3523 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Kenneth R. Rosen", "title": "Italian Woman Tests Positive for COVID-19 After 60 Days of Quarantine and Swabbing - Newsweek", "description": "Bianca Dobroiu arrived at the Sant'Orsola-Malpighi Polyclinic hospital in Bologna with a fever above 105 degrees and was diagnosed with COVID-19.", "url": "https://www.newsweek.com/italian-woman-tests-positive-covid-19-after-60-days-quarantine-swabbing-1500202", "urlToImage": null, "publishedAt": "2020-04-25T12:30:39Z", "content": "A 23-year-old in Italy being treated for the disease caused by the novel coronavirus continues to test positive, despite two months of quarantine and continual swabs.\r\nBianca Dobroiu arrived at the Sant'Orsola-Malpighi Polyclinic hospital, a public hospital p… [+4335 chars]"}, {"source": {"id": null, "name": "Aa.com.tr"}, "author": null, "title": "World Malaria Day: Fight against life-threatening disease - Anadolu Agency", "description": "'No evidence-based information chloroquine medication, used in malaria, protective in COVID-19,' says expert  - Anadolu Agency", "url": "https://www.aa.com.tr/en/health/world-malaria-day-fight-against-life-threatening-disease/1818308", "urlToImage": null, "publishedAt": "2020-04-25T12:10:38Z", "content": "ANKARA \r\nWhile humanity is struggling with coronavirus outbreak, the world is observing on April 25 Malaria Day, highlighting the importance of the fight against another life-threatening disease.\r\nAlthough it is very easy and inexpensive to prevent deaths fro… [+3789 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Coronavirus And Smoking: French Researchers Suggest Nicotine Could Protect Against Coronavirus - Swarajya", "description": "", "url": "https://swarajyamag.com/news-brief/coronavirus-and-smoking-french-researchers-suggest-nicotine-could-protect-against-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T11:31:00Z", "content": null}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Plasma therapy trials for coronavirus patients begin in Karnataka - Deccan Herald", "description": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.", "url": "https://www.deccanherald.com/state/top-karnataka-stories/plasma-therapy-trials-for-coronavirus-patients-begin-in-karnataka-829772.html", "urlToImage": null, "publishedAt": "2020-04-25T11:00:06Z", "content": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.\r\nFollow latest updates on the COVID-19 pandemic here\r\nIn a tweet, Medical Education Minister K Sudhakar said, \"Happy to … [+1295 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "Bats cannot directly infect humans with Covid-19: Scientists - Hindustan Times", "description": "According to scientists, Sars-Cov-2 may have diverged from the closest coronavirus found in bats called RaTG13, about 40 to 70 years ago, indicating that the bat virus cannot directly infect humans.", "url": "https://www.hindustantimes.com/india-news/bats-cannot-directly-infect-humans-with-covid-19-scientists/story-uuEwHKcI0x266H1fxawFbN.html", "urlToImage": null, "publishedAt": "2020-04-25T09:30:44Z", "content": "Sixty-four scientists have said bats do not spread Covid-19 after reports of people requesting local authorities to clear trees over a fear of the colonies the winged mammals host.\r\nThe chiropterologists issuing the statement said they came together after rep… [+3518 chars]"}, {"source": {"id": null, "name": "Trtworld.com"}, "author": "TRTWorld", "title": "WHO warns against idea of 'immunity passports' - TRT World", "description": "The concept of “immunity passports” or “risk-free certificates” has been floated as a way of allowing people protected against reinfection to return to work.", "url": "https://www.trtworld.com/life/who-warns-against-idea-of-immunity-passports-35737", "urlToImage": null, "publishedAt": "2020-04-25T08:54:25Z", "content": "The concept of immunity passports or risk-free certificates has been floated as a way of allowing people protected against reinfection to return to work.\r\nThis Wednesday, March 11, 2015 photo shows the World Health Organization headquarters building in Geneva… [+1045 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "AP", "title": "Coronavirus: WHO warns against idea of 'immunity passports' - Deccan Herald", "description": "The World Health Organization is cautioning against the idea of “immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.", "url": "https://www.deccanherald.com/international/world-news-politics/coronavirus-world-health-organization-warns-against-idea-of-immunity-passports-829739.html", "urlToImage": null, "publishedAt": "2020-04-25T08:50:01Z", "content": "The World Health Organization is cautioning against the idea of immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.\r\nThe concept of immunity pas… [+813 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Sandhya Ramesh", "title": "Don’t demonise bats, we need them: Researchers explain why ‘mass hysteria’ is uncalled for - ThePrint", "description": "Chiropterologists from 6 Asian nations have released a seven-point statement to combat ill-informed opinions on bats as the source of Covid-19.", "url": "https://theprint.in/science/dont-demonise-bats-we-need-them-researchers-explain-why-mass-hysteria-is-uncalled-for/408485/", "urlToImage": null, "publishedAt": "2020-04-25T08:21:00Z", "content": "Bengaluru: A group of 64 chiropterologists or bat researchers, scientists, and conservationists from six Asian nations released a statement Friday expressing concern about increased stigmatisation and killing of bats due to unverified opinions on these mammal… [+21801 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "Cotton, natural silk, chiffon make best materials for homemade masks against COVID-19: study - The Hindu", "description": "According to the researchers, including those from the University of Chicago in the US, SARS-CoV-2, the new coronavirus that causes COVID-19, is thought to spread mainly through respiratory droplets when an infected person coughs, sneezes, speaks or breathes.", "url": "https://www.thehindu.com/news/international/cotton-natural-silk-chiffon-make-best-materials-for-homemade-masks-against-covid-19-study/article31431280.ece", "urlToImage": null, "publishedAt": "2020-04-25T08:19:56Z", "content": "As people resort to making their own cloth masks due to shortage of surgical and N95 varieties in the wake of the COVID-19 pandemic, a new study says a combination of cotton with natural silk or chiffon can filter out aerosol particles provided that the mask … [+2378 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": "https://www.facebook.com/dineshRewale", "title": "e-Agenda AajTak: Not just stay at home but also do yoga at home, says Ramdev - dineshr", "description": "In the wake of the coronavirus pandemic and the nationwide lockdown, people should not just stay and work at home, but they must also perform yoga at home, said yoga…", "url": "https://www.indiatoday.in/india/story/e-agenda-aajtak-yoga-ramdev-coronavirus-pandemic-lockdown-1670908-2020-04-25?utm_source=rss", "urlToImage": null, "publishedAt": "2020-04-25T07:21:40Z", "content": "In the wake of the coronavirus pandemic and the nationwide lockdown, people should not just stay and work at home, but they must also perform yoga at home, said yoga guru Ramdev on Saturday.\r\nRamdev was speaking at a special session at the e-Agenda Aaj Tak.\r\n… [+739 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "ANI", "title": "106-year-old woman who survived Spanish Flu, now beats Covid-19 too - Livemint", "description": "Ana del Valle is the oldest survivor of the pandemic outbreaks in Spain.Ana was born in October 1913 and in less than six months she will turn 107", "url": "https://www.livemint.com/news/world/106-year-old-woman-who-survived-spanish-flu-now-beats-coronavirus-too-11587798144700.html", "urlToImage": null, "publishedAt": "2020-04-25T07:15:52Z", "content": "Madrid: We may have all heard that miracles do happen, but sadly not all of us have the chance to witness them in our daily lives, especially during a pandemic today which brings the world to a standstill.Citing a similar story of survival, The Olive Press, a… [+2495 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Nations join WHO in virus initiative, but not US - The Star", "description": "World leaders pledged on Friday to accelerate work on tests, drugs and vaccines against Covid-19 and to share them around the globe. But the United States di...", "url": "https://www.youtube.com/watch?v=BSi5E7Grjx8", "urlToImage": null, "publishedAt": "2020-04-25T06:51:50Z", "content": "World leaders pledged on Friday to accelerate work on tests, drugs and vaccines against Covid-19 and to share them around the globe. But the United States did not take part in the launch.\r\nWATCH MORE: https://thestartv.com/c/newsSUBSCRIBE: https://cutt.ly/The… [+37 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What COVID-19 Symptoms Should People Be On The Lookout For? - WCCO - CBS Minnesota", "description": "There are so many unknowns about COVID-19. But, one thing has been clear – the virus can present itself differently in different people, Heather Brown report...", "url": "https://www.youtube.com/watch?v=Ml0aBNKYVyc", "urlToImage": null, "publishedAt": "2020-04-25T03:58:36Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Coronavirus Detected on Air Pollution Particles That May Carry It Over Long Distances, Scientists Warn - News18", "description": "Leonardo Setti at the University of Bologna in Italy said it was imperative to investigate if the the coronavirus could be transported through air pollution.", "url": "https://www.news18.com/news/world/coronavirus-detected-on-air-pollution-particles-that-may-carry-it-over-long-distances-scientists-warn-2591919.html", "urlToImage": null, "publishedAt": "2020-04-25T03:39:15Z", "content": "The novel coronavirus has been found on air pollution particles by scientists who are studying if this could allow the virus to advance longer distances, resulting in more number of people contracting it, The Guardian reported.\r\nThe work is still in the initi… [+2716 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "G Thing: Pet fashion designer finds unique ways to give back to animal rescue crews - PIX11 News", "description": "She's one of the most in demand New York fashion designers for dog and cats.", "url": "https://www.youtube.com/watch?v=WcRkfwYZcdU", "urlToImage": null, "publishedAt": "2020-04-25T03:02:18Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Reuters", "title": "Could warmer weather help contain coronavirus? - Deccan Herald", "description": "The world is looking for signs that the arrival of warmer weather in the northern hemisphere could slow the spread of the coronavirus outbreak, which has killed more than 190,000 people and sent the global economy into a tailspin as countries impose lockdowns…", "url": "https://www.deccanherald.com/science-and-environment/could-warmer-weather-help-contain-coronavirus-829641.html", "urlToImage": null, "publishedAt": "2020-04-25T02:48:17Z", "content": "The world is looking for signs that the arrival of warmer weather in the northern hemisphere could slow the spread of the coronavirus outbreak, which has killed more than 190,000 people and sent the global economy into a tailspin as countries impose lockdowns… [+3715 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "NBC", "title": "Coronavirus update: US study reveals common medical conditions in sickest COVID-19 patients - 7NEWS.com.au", "description": "Researchers have issued a warning to those with the health problems to be hyper-aware of new or unusual symptoms.", "url": "https://7news.com.au/lifestyle/health-wellbeing/coronavirus-update-us-study-reveals-common-medical-conditions-in-sickest-covid-19-patients-c-998646", "urlToImage": null, "publishedAt": "2020-04-24T22:49:11Z", "content": "People with obesity, diabetes and high blood pressure are at greater risk for complications from coronavirus, according to a large study of patients hospitalised with the illness it causes.\r\nThe findings, published on Wednesday in the Journal of the American … [+2322 chars]"}, {"source": {"id": null, "name": "Medscape.com"}, "author": null, "title": "COVID-19 Daily: Doctor Support Hotline, New Mortality Data - Medscape", "description": "These are the coronavirus stories you need to know about today.", "url": "https://www.medscape.com/viewarticle/929383", "urlToImage": null, "publishedAt": "2020-04-24T22:32:41Z", "content": "Editor's note: Find the latest COVID-19 news and guidance in Medscape's Coronavirus Resource Center.\r\nHere are the coronavirus stories Medscape's editors around the globe think you need to know about today: \r\nDoctor Support Hotline\r\nIn late March, a Philadelp… [+5366 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Samantha  Black, PhD, The Science Advisory Board staff writer", "title": "Experts discuss promising strategies for tackling SARS-CoV-2 - The Science Board", "description": "What's the best strategy for developing treatments for the SARS-CoV-2 virus? The most promising approaches for a rapid response are antivirals and gene therapy, according to a new review article published April 24 in <em>Frontiers in Microbiology</em>.", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=687", "urlToImage": null, "publishedAt": "2020-04-24T19:24:18Z", "content": "In an unprecedented effort, hundreds of thousands of researchers and clinicians from around the world are fighting against the clock to develop cures, vaccines, and diagnostics for COVID-19, the illness caused by the virus SARS-CoV-2. To date, over 1,650 acad… [+6253 chars]"}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "Michelle Fay Cortez, Olivia Carville", "title": "Life After Ventilators Can Be Hell for Coronavirus Survivors - BloombergQuint", "description": "Aguilar, in the throes of Covid-19, was starting her 10-day descent into ventilator limbo.", "url": "https://www.bloombergquint.com/coronavirus-outbreak/life-after-ventilators-can-be-hell-for-coronavirus-survivors", "urlToImage": null, "publishedAt": "2020-04-24T18:45:00Z", "content": ""}, {"source": {"id": null, "name": "Biospectrumasia.com"}, "author": null, "title": "Scientists identify key nasal cells believed to attract Coronavirus - BSA bureau", "description": "Scientists discovered that goblet and ciliated cells in the nose have high levels of the entry proteins that the Coronavirus uses to get into our cells.", "url": "https://www.biospectrumasia.com/news/83/15851/scientists-identify-key-nasal-cells-believed-to-attract-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-24T18:29:42Z", "content": "Scientists discovered that goblet and ciliated cells in the nose have high levels of the entry proteins that the Coronavirus uses to get into our cells.\r\nTwo specific nose cell types have been identified as likely initial infection points for COVID-19 coronav… [+1756 chars]"}, {"source": {"id": null, "name": "Ianslive.in"}, "author": "IANSLive", "title": "Covid-19 cases in Delhi cross 2500-mark; 53 deaths (Ld) - IANS", "description": "As many as 49 people have been cured of the infection in the last 24 hours, according to the Delhi Health Report. A total of 857 patients have recovered from coronavirus so far in Delhi.", "url": "http://www.ianslive.in/index.php?param=news/Covid_19_cases_in_Delhi_cross_2500_mark_53_deaths_Ld-671364/NATION/1", "urlToImage": null, "publishedAt": "2020-04-24T18:08:32Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Does COVID-19 Cause Blood Clot Complications? | NBC New York - NBC New York", "description": "A small study of five critically ill COVID-19 patients at Mount Sinai Hospital in New York City could have major implications for how doctors respond to the ...", "url": "https://www.youtube.com/watch?v=twPd0YvY3T0", "urlToImage": null, "publishedAt": "2020-04-24T17:18:33Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Covid-19 and ethnicity: is there a connection? | The Leader podcast - Evening Standard", "description": "Subscribe to The Leader podcast: https://podfollow.com/the-leader/episode/652231b6f3033619fa39d9439ff6095b4d9a4802 It’s thought around 34 percent of people w...", "url": "https://www.youtube.com/watch?v=GpPsTeBA0H0", "urlToImage": null, "publishedAt": "2020-04-24T16:43:22Z", "content": "Subscribe to The Leader podcast: https://podfollow.com/the-leader/epis...Its thought around 34 percent of people with covid-19 in the UK come from a Black, Asian or Ethnic Minority background. Those communities make up 14 percent of the population in England … [+1148 chars]"}, {"source": {"id": null, "name": "Prevention.com"}, "author": "Korin Miller", "title": "Does Coronavirus Cause Blood Clots? Doctors Explain the Life-Threatening Complication - Prevention.com", "description": "The condition can further weaken already struggling lungs, experts say.", "url": "https://www.prevention.com/health/a32264828/coronavirus-blood-clots/", "urlToImage": null, "publishedAt": "2020-04-24T16:30:00Z", "content": "Every day, more news emerges about the serious complications that can result from COVID-19, the respiratory illness caused by the novel coronavirus. But a new one is a bit mysterious: Many doctors have noticed that patients who have a severe case are struggli… [+6790 chars]"}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": null, "title": "Vitamins C, D can help prevent coronavirus, Oregon State University researcher says - OregonLive", "description": "Adrian Gombart of OSU’s Linus Pauling Institute, along with his collaborators at universities across the world, said public health officials should issue a clear set of nutritional guidelines to complement the existing advice about washing hands to prevent th…", "url": "https://www.oregonlive.com/coronavirus/2020/04/vitamins-c-d-can-help-prevent-coronavirus-oregon-state-university-researcher-says.html", "urlToImage": null, "publishedAt": "2020-04-24T15:37:02Z", "content": "Supplements containing vitamins C and D, along with other micronutrients, can be a safe, effective and low-cost means to fight off the novel coronavirus and other acute respiratory tract diseases, according to an Oregon State University researcher.\r\nAdrian Go… [+5436 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "David Nikel", "title": "Sweden Health Chief Admits ‘It’s Not Over’ As Coronavirus Cases Leap - Forbes", "description": "Following an additional 131 deaths reported in the last 24 hours, Sweden’s COVID-19 death toll now stands at 2,152.", "url": "https://www.forbes.com/sites/davidnikel/2020/04/24/sweden-health-chief-admits-its-not-over-as-coronavirus-cases-leap/", "urlToImage": null, "publishedAt": "2020-04-24T15:09:59Z", "content": "Sweden's state epidemiologist Anders Tegnell has said the number of COVID-19 deaths in Sweden have ... [+] been higher than expected.\r\nAFP via Getty Images\r\nSwedens state epidemiologist Anders Tegnell has announced a record daily high of coronavirus cases for… [+3119 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": null, "title": "World Immunization Week: WHO highlights other diseases as coronavirus vaccine trials begin - Euronews", "description": "As coronavirus vaccine trials begin in the UK and get the green light in Germany, the World Health Organization warns other diseases must not be neglected.", "url": "https://www.euronews.com/2020/04/23/coronavirus-in-europe-vaccine-trials-begin-in-uk-and-get-green-light-in-germany", "urlToImage": null, "publishedAt": "2020-04-24T14:52:08Z", "content": "The beginning of UK clinical trials this week to find a coronavirus vaccine coincides with the start of World Immunization Week -- encouraging the use of vaccines to protect people against disease generally.\r\nThe event is promoted by the World Health Organiza… [+2089 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus pandemic | Over 50% consumers quit smoking during lockdown: Report - Moneycontrol", "description": "The survey revealed that over half of those who were interviewed had quit smoking during the ongoing lockdown while nearly 30 percent had reduced their daily consumption.", "url": "https://www.moneycontrol.com/news/business/coronavirus-pandemic-over-50-consumers-quit-smoking-during-lockdown-report-5187161.html", "urlToImage": null, "publishedAt": "2020-04-24T13:43:19Z", "content": "During the lockdown period in India, the consumption of cigarettes has taken a hit. A survey of over 100 smokers, conducted by IIFL Securities, found that around 58 percent respondents have quit smoking following the implementation of the nationwide lockdown … [+2003 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Novel Coronavirus Is A Result Of Crazy Experiments At Wuhan Institute of Virology: Top Russian Microbiologist - Swarajya", "description": "", "url": "https://swarajyamag.com/insta/novel-coronavirus-is-a-result-of-crazy-experiments-at-wuhan-institute-of-virology-top-russian-microbiologist", "urlToImage": null, "publishedAt": "2020-04-24T13:42:15Z", "content": null}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Aylin Woodward", "title": "5 young New Yorkers with mild COVID-19 were recently hospitalized with strokes. Doctors say the coronavirus ca - Business Insider India", "description": "Although the coronavirus is primarily a respiratory disease that affects the lungs, it can cause heart, kidney, and brain problems. Doctors have reported blood", "url": "https://www.businessinsider.in/science/news/5-young-new-yorkers-with-mild-covid-19-were-recently-hospitalized-with-strokes-doctors-say-the-coronavirus-can-cause-blood-clots-/articleshow/75355741.cms", "urlToImage": null, "publishedAt": "2020-04-24T13:32:00Z", "content": "Doctors treating COVID-19\r\n patients have begun to document ways in which the disease impacts far more than just the lungs.\r\nExperts have reported kidney issues, heart problems, and more recently, blood clots appearing in various parts of patients' bodies. Su… [+4046 chars]"}, {"source": {"id": null, "name": "Positive.news"}, "author": null, "title": "What went right: good coronavirus news from the fifth week of lockdown - Positive.News", "description": "There are signs the epidemic had reached its peak in the UK, but that wasn’t the only good news about coronavirus this week", "url": "https://www.positive.news/society/good-coronavirus-news-from-the-fifth-week-of-lockdown/", "urlToImage": null, "publishedAt": "2020-04-24T12:50:29Z", "content": "Crowdfunder launched to get Positive News to NHS staffThe Positive News team is raising funds via a Crowdfunder campaign to distribute thousands of complimentary copies of the magazine to NHS staff. After a number of hospitals got in touch to request copies, … [+371 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "A second wave of COVID-19 - PIX11 News", "description": "Just like the flu reemerges every winter, health officials are expecting coronavirus to do the same. This has been referred to as a “second wave.” Infectious...", "url": "https://www.youtube.com/watch?v=gJlWYRobaLQ", "urlToImage": null, "publishedAt": "2020-04-24T11:56:29Z", "content": null}, {"source": {"id": null, "name": "Imperial.ac.uk"}, "author": null, "title": "Coronavirus 'map' identifies key virus entry points into the body | Imperial News - Imperial College London", "description": "Scientists are creating a map of the human body to identify locations where the COVID-19 virus can enter human cells.", "url": "https://www.imperial.ac.uk/news/197114/coronavirus-identifies-virus-entry-points-into/", "urlToImage": null, "publishedAt": "2020-04-24T11:36:27Z", "content": "Scientists are creating a map of the human body to identify locations where the COVID-19 virus can enter human cells.\r\nThe research, from a number of international institutions including Imperial College London, has so far identified likely initial infection … [+5951 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Peter Sullivan", "title": "Controversial idea to speed coronavirus vaccine gains ground | TheHill - The Hill", "description": "An idea that might seem outlandish at first is gaining some ground as a way to speed de...", "url": "https://thehill.com/policy/healthcare/494417-controversial-idea-to-speed-coronavirus-vaccine-gains-ground", "urlToImage": null, "publishedAt": "2020-04-24T10:00:37Z", "content": "An idea that might seem outlandish at first is gaining some ground as a way to speed development of a coronavirus vaccine: intentionally infecting people with the virus as part of a trial.\r\nThe idea, known as a challenge trial, would deliberately infect a few… [+4702 chars]"}]}