{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Livemint.com"}, "author": "ANI", "title": "106-year-old woman who survived Spanish Flu, now beats coronavirus too - Livemint", "description": "Ana del Valle is the oldest survivor of the pandemic outbreaks in Spain.Ana was born in October 1913 and in less than six months she will turn 107", "url": "https://www.livemint.com/news/world/106-year-old-woman-who-survived-spanish-flu-now-beats-coronavirus-too-11587798144700.html", "urlToImage": null, "publishedAt": "2020-04-25T07:15:52Z", "content": "Madrid: We may have all heard that miracles do happen, but sadly not all of us have the chance to witness them in our daily lives, especially during a pandemic today which brings the world to a standstill.Citing a similar story of survival, The Olive Press, a… [+2495 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Dr. Kamal Kant Kohli", "title": "National Institutes of Health releases guidelines for Covid 19 treatment - Medical Dialogues", "description": "National Institutes of Health (NIH) has issued living treatment guidelines of Covid 19. These...", "url": "https://medicaldialogues.in/medicine/news/national-institutes-of-health-releases-guidelines-for-covid-19-treatment-65174", "urlToImage": null, "publishedAt": "2020-04-25T07:03:03Z", "content": "National Institutes of Health (NIH) has issued \"living\" treatment guidelines of Covid 19. These Treatment Guidelines have been developed to inform clinicians how to care for patients with COVID-19.The recommendations of which shall be updated online as and wh… [+3858 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "World leaders to launch COVID-19 drugs, vaccine plan: WHO - ARIRANG NEWS", "description": "WHO \"코로나19 치료제•백신 개발 협력안 제시\" World leaders have pledged to work together in a landmark collaboration, to speed up the development of drugs, tests and vaccine...", "url": "https://www.youtube.com/watch?v=XC4JHNYFmk0", "urlToImage": null, "publishedAt": "2020-04-25T04:57:01Z", "content": "WHO \"19 \"\r\nWorld leaders have pledged to work together in a landmark collaboration, to speed up the development of drugs, tests and vaccines to diagnose and treat COVID-19.According to the World Health Organization on Friday, world leaders including French Pr… [+495 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Paris: Sewers tested for COVID-19 concentration | France Coronavirus | World News - WION", "description": "Paris: Sewers tested for COVID-19 concentration | France Coronavirus | World News In France, traces of the novel coronavirus were discovered in 4 out of 27 s...", "url": "https://www.youtube.com/watch?v=4ZJVtFYyA58", "urlToImage": null, "publishedAt": "2020-04-25T04:35:19Z", "content": "Paris: Sewers tested for COVID-19 concentration | France Coronavirus | World News\r\nIn France, traces of the novel coronavirus were discovered in 4 out of 27 samples of the non-potable water, which is supplied in Paris.\r\n#ParisCoronavirus#FranceCoronavirusDeat… [+1130 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Aswathi Pacha", "title": "Stop villainising bats, say scientists and conservationists - The Hindu", "description": "The mammals do not spread COVID-19, they say", "url": "https://www.thehindu.com/sci-tech/energy-and-environment/stop-villainising-bats-say-scientists-and-conservationists/article31429962.ece", "urlToImage": null, "publishedAt": "2020-04-25T04:24:55Z", "content": "Unverified news and social media posts linking bats to the COVID-19 outbreak have led to widespread antipathy and there have been increasing incidents of the public destroying bat roosts and smoking them out. To raise awareness, 64 chiropterologists (those wh… [+2199 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Coronavirus Detected on Air Pollution Particles That May Carry It Over Long Distances, Scientists Warn - News18", "description": "Leonardo Setti at the University of Bologna in Italy said it was imperative to investigate if the the coronavirus could be transported through air pollution.", "url": "https://www.news18.com/news/world/coronavirus-detected-on-air-pollution-particles-that-may-carry-it-over-long-distances-scientists-warn-2591919.html", "urlToImage": null, "publishedAt": "2020-04-25T03:39:15Z", "content": "The novel coronavirus has been found on air pollution particles by scientists who are studying if this could allow the virus to advance longer distances, resulting in more number of people contracting it, The Guardian reported.\r\nThe work is still in the initi… [+2716 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "G. Lakshmi and Shilpi Garg", "title": "World Malaria Day – a Good Time to Remember COVID-19 Isn't the Only Crisis - The Wire", "description": "The ongoing novel coronavirus pandemic hasn't made matters easier, even if the world has developed – even temporarily – a heightened awareness of the effects of infectious diseases.", "url": "https://science.thewire.in/the-sciences/world-malaria-day-a-good-time-to-remember-covid-19-isnt-the-only-crisis/", "urlToImage": null, "publishedAt": "2020-04-25T03:29:00Z", "content": "An Anopheles stephensi mosquito obtains a blood meal from a human host through its pointed proboscis in this undated handout photo obtained by Reuters, November 2015. Photo: Reuters/Jim Gathany/CDC.\r\nThe latest World Malaria Report released in December 2019 s… [+5011 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Vaping, smoking increases risk of infections from COVID-19 - WWLP-22News", "description": "We all know smoking can be harmful to our lungs, but now advisories are being issued that COVID-19 can be an even more serious threat to those who smoke and ...", "url": "https://www.youtube.com/watch?v=qB-WapNuDuo", "urlToImage": null, "publishedAt": "2020-04-25T03:15:03Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Hindustan Times", "title": "A month in lockdown, vaccines in human trials give hope: Covid-19 news today - Hindustan Times", "description": "A preview of the important Covid-19 news from India and world today", "url": "https://www.hindustantimes.com/india-news/a-month-in-lockdown-vaccines-in-human-trials-give-hope-covid-19-news-today/story-Y9XTbYJNVJFRhle8ubkTEL.html", "urlToImage": null, "publishedAt": "2020-04-25T02:27:49Z", "content": "India completes a month in lockdown on Saturday. In this period, the country has slowed the spread of the coronavirus disease (Covid-19) though many challenges still remain. Meanwhile, human trials of a vaccine developed by Oxford University has begun. An Ind… [+5596 chars]"}, {"source": {"id": null, "name": "Theweek.in"}, "author": null, "title": "THE WEEK morning brief: Cabinet secretary to meet state officials on lockdown - THE WEEK", "description": "The meeting comes two days before Modi holds a videoconference with all CMs", "url": "https://www.theweek.in/news/india/2020/04/25/the-week-morning-brief-cabinet-secretary-to-meet-state-officials-on-lockdown.html", "urlToImage": null, "publishedAt": "2020-04-25T02:26:47Z", "content": "Bureaucrats meeting\r\nCabinet Secretary Rajiv Gauba is scheduled to meet all chief secretaries and top police officials of all states and Union territories on Saturday. According to reports, the meeting is aimed at charting a road map to normalcy after the nat… [+2311 chars]"}, {"source": {"id": null, "name": "Newkerala.com"}, "author": null, "title": "Scientists discover protein for better obesity treatments - New Kerala", "description": "Researchers have found the precise shape of a key player in human metabolism, which could lead the way to better treatments for obesity and other metabolic di...", "url": "https://www.newkerala.com/news/2020/72424.htm", "urlToImage": null, "publishedAt": "2020-04-25T02:26:05Z", "content": "Researchers have found the precise shape of a key player in human metabolism, which could lead the way to better treatments for obesity and other metabolic diseases. According to a study, published in the journal Science, the research team focused on a protei… [+2020 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": null, "title": "Coronavirus: Five new cases, one death, as recoveries surge to 77 per cent - Stuff.co.nz", "description": "About 77 per cent of all New Zealand's Covid-19 cases have recovered.", "url": "https://i.stuff.co.nz/national/health/coronavirus/121269987/coronavirus-ministry-of-health-covid19-update", "urlToImage": null, "publishedAt": "2020-04-25T02:15:00Z", "content": "There are five new coronavirus cases in New Zealand, according to the Ministry of Health.\r\n One other person, a woman in her 70s, has also died, bringing the country's Covid-19 death toll to 18. \r\n New Zealand's recovery rate continues to increase with about … [+2927 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Candace Sutton", "title": "Coronavirus: How it kills in ‘ferocious rampage’ from brain to toes - NEWS.com.au", "description": "How COVID-19 kills in ‘ferocious rampage from brain to toes’", "url": "https://www.news.com.au/world/coronavirus/health/how-covid19-kills-in-ferocious-rampage-from-brain-to-toes/news-story/76f8edff42d1302b2c9acc8211547ea6", "urlToImage": null, "publishedAt": "2020-04-25T02:03:37Z", "content": "COVID-19 kills in a ferocious rampage through the body from brain to toes doctors have explained, saying the virus acts like no pathogen humanity has ever seen.In an article in sciencemag.org, frontline clinicians caring for the five per cent who become criti… [+7241 chars]"}, {"source": {"id": null, "name": "Uniindia.com"}, "author": "Uniindia News Service", "title": "Africa Vaccination Week 2020 kicks off - United News of India", "description": "Brazzaville, Apr 25 (UNI)  The Africa Vaccination Week 2020 has started as the COVID-19 pandemic is causing significant disruption to vaccination efforts and to the surveillance of vaccine-preventable diseases on the continent.", "url": "http://www.uniindia.com/africa-vaccination-week-2020-kicks-off/world/news/1968505.html", "urlToImage": null, "publishedAt": "2020-04-25T01:41:00Z", "content": "Brazzaville, Apr 25 (UNI) The Africa Vaccination Week 2020 has started as the COVID-19 pandemic is causing significant disruption to vaccination efforts and to the surveillance of vaccine-preventable diseases on the continent.\r\nPrior disease outbreaks and hum… [+2905 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mysteries remain about coronavirus - ABC News", "description": "Dr. Simone Wiles, an infectious disease physician, joins us to discuss how scientists race to learn more about this deadly virus. ABC News Live Prime, Weekda...", "url": "https://www.youtube.com/watch?v=fLNwkogfNfs", "urlToImage": null, "publishedAt": "2020-04-25T00:46:03Z", "content": "Dr. Simone Wiles, an infectious disease physician, joins us to discuss how scientists race to learn more about this deadly virus.\r\nABC News Live Prime, Weekdays at 7EST &amp; 9EST WATCH the ABC News Live Stream Here: https://www.youtube.com/watch?v=w_Ma8...\r\n… [+234 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "COVID-19: India may see second wave of outbreak in monsoon, say scientists - India Gone Viral", "description": "The trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the lockdown is lifted but India is likely to see a second wave in late July or August with a surge in th", "url": "https://indiagoneviral.com/news/2020/04/25/covid-19-india-may-see-second-wave-of-outbreak-in-monsoon-say-scientists/41722/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T00:04:54Z", "content": "The trajectory of\r\nCOVID-19\r\ncases could have plateaued and might even fall for some weeks after the\r\nlockdown\r\nis lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say\r\nscientists\r\n… [+6225 chars]"}, {"source": {"id": null, "name": "Reliefweb.int"}, "author": null, "title": "World Malaria Day 2020 : Malaria - Status Update on Children (25 April 2020) - World - ReliefWeb", "description": "English News and Press Release on World and 10 other countries about Health, Children and Epidemic; published on 24 Apr 2020 by UNICEF", "url": "https://reliefweb.int/report/world/world-malaria-day-2020-malaria-status-update-children-25-april-2020", "urlToImage": null, "publishedAt": "2020-04-25T00:00:08Z", "content": "Malaria data snapshots\r\nSnapshots from sub-Saharan Africa and added impacts of COVID-19\r\nEvery two minutes, a child under the age of 5 dies from malaria. Under-five children accounted for 67 per cent of all malaria deaths worldwide in 2018. Most of them occur… [+1280 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Bengaluru: Shortage of hydroxychloroquine a pain for arthritis, lupus patients - Times of India", "description": "Due to its use as a prophylaxis for Covid-19, anti-malarial drug hydroxychloroquine (HCQ) is not available to those who consume it regularly — arthrit", "url": "https://timesofindia.indiatimes.com/city/bengaluru/shortage-of-hcq-a-pain-for-arthritis-lupus-patients/articleshow/75362305.cms", "urlToImage": null, "publishedAt": "2020-04-24T23:19:00Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "The best material for homemade face masks may be a combination of two fabrics - Science Daily", "description": "Researchers report that a combination of cotton with natural silk or chiffon can effectively filter out aerosol particles -- if the fit is good.", "url": "https://www.sciencedaily.com/releases/2020/04/200424081648.htm", "urlToImage": null, "publishedAt": "2020-04-24T20:35:34Z", "content": "In the wake of the COVID-19 pandemic, the U.S. Centers for Disease Control and Prevention recommends that people wear masks in public. Because N95 and surgical masks are scarce and should be reserved for health care workers, many people are making their own c… [+2136 chars]"}, {"source": {"id": null, "name": "Wjla.com"}, "author": "SCOTT THUMAN, Sinclair Broadcast Group", "title": "Trump signs relief bill into law as some states begin to reopen parts of their economy - KOMO News", "description": "WASHINGTON (SBG) &mdash; President Donald Trump on Friday signed the latest relief package into law &mdash;a whopping $484 billion to help small businesses, hospitals, and testing.  Video: Sinclair Broadcast Group. At the same time, a handful of states are st…", "url": "http://wjla.com/news/coronavirus/trump-signs-relief-bill-into-law", "urlToImage": null, "publishedAt": "2020-04-24T20:14:00Z", "content": null}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Reuters", "title": "Italy's daily Covid-19 death toll lowest since March 19, but new cases rise - Livemint", "description": "The total number of fatalities since the outbreak now stands at 25,969.The number of confirmed cases was 192,994, the third highest global tally behind those of the United States and Spain", "url": "https://www.livemint.com/news/world/italy-s-daily-covid-19-death-toll-lowest-since-march-19-but-new-cases-rise-11587757014841.html", "urlToImage": null, "publishedAt": "2020-04-24T19:44:35Z", "content": "ROME: Deaths from the COVID-19 epidemic in Italy climbed by 420 on Friday, the smallest daily tally since March 19, the Civil Protection Agency said, but the number of new infections rose to 3,021 from 2,646 on Thursday.Friday's death toll was down from 464 t… [+1058 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Samantha  Black, PhD, The Science Advisory Board staff writer", "title": "Experts discuss promising strategies for tackling SARS-CoV-2 - The Science Board", "description": "What's the best strategy for developing treatments for the SARS-CoV-2 virus? The most promising approaches for a rapid response are antivirals and gene therapy, according to a new review article published April 24 in <em>Frontiers in Microbiology</em>.", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=687", "urlToImage": null, "publishedAt": "2020-04-24T19:24:18Z", "content": "In an unprecedented effort, hundreds of thousands of researchers and clinicians from around the world are fighting against the clock to develop cures, vaccines, and diagnostics for COVID-19, the illness caused by the virus SARS-CoV-2. To date, over 1,650 acad… [+6253 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Rupsa Chakraborty", "title": "Hospital didn’t have bed, ambulance refused oxygen facility: Family’s ordeal after doctor succumbs to... - Hindustan Times", "description": "", "url": "https://www.hindustantimes.com/mumbai-news/hospital-didn-t-have-bed-ambulance-refused-oxygen-facility-ordeal-of-a-doctor-s-family-who-succumbed-to-covid-19/story-kDp3I3cyMp5qX034CAySGP.html", "urlToImage": null, "publishedAt": "2020-04-24T18:56:00Z", "content": "The family of a 36-year-old general physician from Shivaji Nagar who contracted Covid-19 struggled for 24 hours to get him admitted to a hospital. \r\nMany hospitals refused to admit him due to unavailability of beds or lack of treatment facilities for the nove… [+3523 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "The Hans India", "title": "2nd wave of virus outbreak in monsoon, warn scientists - The Hans India", "description": "The trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the...", "url": "https://www.thehansindia.com/news/national/2nd-wave-of-virus-outbreak-in-monsoon-warn-scientists-619062", "urlToImage": null, "publishedAt": "2020-04-24T18:35:48Z", "content": "New Delhi: The trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the lockdown is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say scient… [+2291 chars]"}, {"source": {"id": null, "name": "Biospectrumasia.com"}, "author": null, "title": "Scientists identify key nasal cells believed to attract Coronavirus - BSA bureau", "description": "Scientists discovered that goblet and ciliated cells in the nose have high levels of the entry proteins that the Coronavirus uses to get into our cells.", "url": "https://www.biospectrumasia.com/news/26/15851/scientists-identify-key-nasal-cells-believed-to-attract-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-24T18:29:42Z", "content": "Scientists discovered that goblet and ciliated cells in the nose have high levels of the entry proteins that the Coronavirus uses to get into our cells.\r\nTwo specific nose cell types have been identified as likely initial infection points for COVID-19 coronav… [+1756 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "The Hans India", "title": "Plasma therapy for Covid patients from Monday Only 13 new cases in Telangana in 24 hrs - The Hans India", "description": "Hyderabad: Health Minister Eatala Rajender said Telangana has got the nod for convalescent plasma...", "url": "https://www.thehansindia.com/telangana/plasma-therapy-for-covid-patients-from-monday-only-13-new-cases-in-telangana-in-24-hrs-619047", "urlToImage": null, "publishedAt": "2020-04-24T18:02:48Z", "content": "Hyderabad: Health Minister Eatala Rajender said Telangana has got the nod for convalescent plasma therapy from the Centre and it would be done on Covid-19 patients in critical condition from Monday.\r\nHe said that 13 new cases were confirmed with 29 recovered … [+1903 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "Experts demolish studies suggesting COVID-19 is no worse than flu - Ars Technica", "description": "Authors of widely publicized antibody studies “owe us all an apology,” one expert says.", "url": "https://arstechnica.com/science/2020/04/experts-demolish-studies-suggesting-covid-19-is-no-worse-than-flu/", "urlToImage": null, "publishedAt": "2020-04-24T17:33:00Z", "content": "Enlarge/ A COVID-19 blood test is administered outside of Delmont Medical Care on April 22, 2020 in Franklin Square, New York. The test identifies antibodies to the coronavirus. \r\n135 with 85 posters participating\r\nFrustrated statisticians and epidemiologists… [+9053 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Doctors utilize virtual appointments to ease patients' fear of catching coronavirus - KBZK Bozeman MT News", "description": "Plans to reopen the state doesn’t mean an end to the current coronavirus pandemic. In fact, doctors say now more than ever is the time to practice safety and...", "url": "https://www.youtube.com/watch?v=-5psSfEhpo0", "urlToImage": null, "publishedAt": "2020-04-24T17:10:43Z", "content": "Plans to reopen the state doesnt mean an end to the current coronavirus pandemic. In fact, doctors say now more than ever is the time to practice safety and sanitation because its better to be safe than sorry."}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mashable News Staff", "title": "Chinese Biotech’s COVID-19 Vaccine Can Protect Monkeys, Claims Report - Mashable India", "description": "A vaccine developed by a Beijing-based company, Sinovac Biotech has proved to be effective at protecting monkeys from getting COVID-19. The vaccine based on chemically inactivated coronavirus is one of six vaccines that are in the ‘clinical evaluation’ phase.", "url": "https://in.mashable.com/science/13474/chinese-biotechs-covid-19-vaccine-can-protect-monkeys-claims-report", "urlToImage": null, "publishedAt": "2020-04-24T17:06:00Z", "content": "A vaccine candidate developed by a Beijing-based company, Sinovac Biotech has proved to be effective at protecting monkeys from getting COVID-19.\r\nCurrently, researchers from all over the world are trying to develop vaccines based on various approaches and th… [+2080 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "COVID-19 cure success in 'Plasma therapy', Is closure near? | India Upfront with Rahul Shivshankar - TIMES NOW", "description": "On India Upfront with Rahul Shivshankar, Intense race for Corona cure. Plasma therapy brings ‘Success’, vaccine trials happening from the UK to Israel & US b...", "url": "https://www.youtube.com/watch?v=-C4gCSCq0M8", "urlToImage": null, "publishedAt": "2020-04-24T17:00:46Z", "content": null}, {"source": {"id": null, "name": "Thehindubusinessline.com"}, "author": "Our Bureau", "title": "Total Covid-19 cases at 983 in Telangana - BusinessLine", "description": "291 discharged; active cases 663", "url": "https://www.thehindubusinessline.com/news/national/total-covid-19-cases-at-983-in-telangana/article31427066.ece", "urlToImage": null, "publishedAt": "2020-04-24T16:48:01Z", "content": "The total number of Covid-19 positive cases reported in Telangana so far has reached 983. While 29 patients have been discharged on Friday, taking the total number of patients discharged after treatment so far to 291.\r\nThe total active cases is put at 663, wi… [+799 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "PTI", "title": "India may see second wave of COVID-19 outbreak in monsoon: Scientists - Zee News", "description": "The timing of the peak will depend on how India is able to control physical distancing and on the level of infection spreads after restrictions are relaxed, said scientists.", "url": "https://zeenews.india.com/india/india-may-see-second-wave-of-covid-19-outbreak-in-monsoon-scientists-2278767.html", "urlToImage": null, "publishedAt": "2020-04-24T16:47:09Z", "content": "New Delhi: The trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the lockdown is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say scient… [+6179 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Strokes in young patients with COVID-19 - 9NEWS", "description": "Doctors in New York are warning that COVID-19 may cause sudden strokes in young adults who aren't severely sick. 9Health Expert Dr. Payal Kohli explains.", "url": "https://www.youtube.com/watch?v=DqpQ2K6xIXM", "urlToImage": null, "publishedAt": "2020-04-24T16:36:18Z", "content": null}, {"source": {"id": null, "name": "Africanews.com"}, "author": null, "title": "Coronavirus - Africa Vaccination Week 2020 kicks off as COVID-19 threatens immunization gains - Africanews English", "description": "This year’s Africa Vaccination Week starts today as the COVID-19 pandemic is causing significant disruption to vaccination efforts and to the surveillance of vaccine-preventable diseases", "url": "http://www.africanews.com/2020/04/24/coronavirus-africa-vaccination-week-2020-kicks-off-as-covid-19-threatens-immunization-gains/", "urlToImage": null, "publishedAt": "2020-04-24T15:36:00Z", "content": "This years Africa Vaccination Week starts today as the COVID-19 pandemic is causing significant disruption to vaccination efforts and to the surveillance of vaccine-preventable diseases on the continent. \r\nPrior disease outbreaks and humanitarian emergencies … [+3119 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Sweden to shut bars and restaurants that ignore coronavirus restrictions - Reuters India", "description": "Sweden warned on Friday it would shut restaurants and bars in the capital that did not comply with guidelines aimed at preventing the spread of the novel coronavirus, amid signs Stockholm residents were beginning to ignore the rules.", "url": "https://in.reuters.com/article/health-coronavirus-sweden-stockholm-idINKCN2262C2", "urlToImage": null, "publishedAt": "2020-04-24T15:05:14Z", "content": "STOCKHOLM (Reuters) - Sweden warned on Friday it would shut restaurants and bars in the capital that did not comply with guidelines aimed at preventing the spread of the novel coronavirus, amid signs Stockholm residents were beginning to ignore the rules. \r\nT… [+2132 chars]"}, {"source": {"id": null, "name": "Healio.com"}, "author": null, "title": "Dermatology expert weighs in on 'COVID toes,' tracking dermatologic symptoms of COVID-19 - Healio", "description": "As the world continues to struggle with the COVID-19 pandemic, new symptoms of the virus continue to be identified. One such symptom, purple or red lesions on the toes and hands, has been dubbed &ldquo;COVID toes&rdquo; and has gained attention over recent we…", "url": "https://www.healio.com/dermatology/dermatitis/news/online/{1f54025b-e860-4862-979d-46daebae6818}/dermatology-expert-weighs-in-on-covid-toes-tracking-dermatologic-symptoms-of-covid-19", "urlToImage": null, "publishedAt": "2020-04-24T14:39:27Z", "content": "As the world continues to struggle with the COVID-19 pandemic, new symptoms of the virus continue to be identified. One such symptom, purple or red lesions on the toes and hands, has been dubbed “COVID toes” and has gained attention over recent weeks. \r\nHeali… [+15263 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus prevention: How to make your own protective mask - Gulf News", "description": "UAE-based designer Behnood Javaherpour shows how to create your own face mask at home See more videos at https://gulfnews.com/videos Read more Gulf News stor...", "url": "https://www.youtube.com/watch?v=DTyKcdUZCOQ", "urlToImage": null, "publishedAt": "2020-04-24T14:29:30Z", "content": null}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "Coronavirus outcome of crazy experiments at Wuhan: Russian scientist - Northeast Now", "description": "A leading Russian microbiologist has claimed that the novel coronavirus is the outcome of \"crazy\" experiments conducted by scientists at the Wuhan Institute of Virology. Coronavirus originated in Chinas Wuhan city in December last year. In an interview to Rus…", "url": "https://nenow.in/health/coronavirus-outcome-of-crazy-experiments-at-wuhan-russian-scientist.html/", "urlToImage": null, "publishedAt": "2020-04-24T13:37:37Z", "content": "A leading Russian microbiologist has claimed that the novel coronavirus is the outcome of “crazy” experiments conducted by scientists at the Wuhan Institute of Virology.\r\nCoronavirus originated in Chinas Wuhan city in December last year.\r\nIn an interview to R… [+1896 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "New York Times", "title": "Nearly All Patients Hospitalized With Covid-19 Had Chronic Health Issues, Study Finds - Times of India", "description": "A new study of thousands of hospitalized coronavirus patients in the New York City area, the epicenter of the outbr", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/nearly-all-patients-hospitalized-with-covid-19-had-chronic-health-issues-study-finds/articleshow/75347362.cms", "urlToImage": null, "publishedAt": "2020-04-24T13:20:37Z", "content": "A new study of thousands of hospitalized coronavirus patients in the New York City area, the epicenter of the outbreak in the United States, has found that nearly all of them had at least one major chronic health condition, and most 88 percent had at least tw… [+5568 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Fall in coronavirus hospital admissions are 'real and growing cause for optimism' - STV News", "description": "The First Minister said lower figures for hospital admissions and patients in intensive care for Covid-19 are giving 'real and growing cause for optimism'.", "url": "https://www.youtube.com/watch?v=8wf932JCVOk", "urlToImage": null, "publishedAt": "2020-04-24T12:13:01Z", "content": null}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Reuters", "title": "Coronavirus: US Covid-19 death toll expected to reach 50,000 today - Livemint", "description": "About 875,000 Americans have contracted the coronavirus disease, and on average about 2,000 have died every day this month.Deaths are also likely higher, as most states only count hospital and nursing home victims and not those who died at home", "url": "https://www.livemint.com/news/india/coronavirus-us-covid-19-death-toll-expected-to-reach-50-000-today-11587728517502.html", "urlToImage": null, "publishedAt": "2020-04-24T11:57:01Z", "content": "The US death toll from the novel coronavirus is expected to reach 50,000 on Friday, doubling in 10 days and the highest in the world, according to a Reuters tally.About 875,000 Americans have contracted the highly contagious respiratory illness COVID-19 cause… [+2472 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Vinod Rathore", "title": "Blood thickening, clots in covid-19 patients alarm doctors - News Track English", "description": "New York: A new news related to the corona virus has shocked doctors. This virus is now clotting the blood of the body of the infected. Nephrologists at Mount Sinai Hospital in New York, New York, USA have found that blood is also accumulating in the kidneys …", "url": "https://english.newstracklive.com/news/blood-blockage-in-body-of-corona-patients-says-doctors-mc24-nu764-ta272-1087286-1.html", "urlToImage": null, "publishedAt": "2020-04-24T11:31:04Z", "content": null}, {"source": {"id": null, "name": "Edexlive.com"}, "author": "Edex Live", "title": "Dietary supplements important weapon for fighting off COVID-19, say researchers - EdexLive", "description": "In particular vitamin C, vitamin D, zinc, and an omega-3 fatty acid found in fish, docosahexaenoic acid, also known as DHA, are critical for immune function", "url": "https://www.edexlive.com/news/2020/apr/24/dietary-supplements-important-weapon-for-fighting-off-covid-19-say-researchers-11557.html", "urlToImage": null, "publishedAt": "2020-04-24T11:08:04Z", "content": "Supplements containing vitamins C and D and other micronutrients are a safe, effective and low-cost means of helping your immune system fight off COVID-19 and other acute respiratory tract diseases, say researchers.\r\nAccording to the study, published in the j… [+2042 chars]"}, {"source": {"id": null, "name": "Cnbctv18.com"}, "author": null, "title": "Fight against malaria could be set back 20 years: WHO - CNBCTV18", "description": "The WHO said new projections indicate that in a worst-case scenario, 769,000 people could die of malaria in sub-Saharan Africa this year as campaigns to combat it are interrupted.Get latest Healthcare online at cnbctv18.com", "url": "https://www.cnbctv18.com/healthcare/fight-against-malaria-could-be-set-back-20-years-who-5768591.htm/", "urlToImage": null, "publishedAt": "2020-04-24T10:40:42Z", "content": "One of the hard lessons the World Health Organisation learned during the Ebola outbreak in West Africa was this: Other diseases can be forgotten and take a deadlier toll.\r\nThe WHO is now warning that the battle against malaria in sub-Saharan Africa, where it … [+2824 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Covid causing blood clots in patients: Docs - Times of India", "description": "The number of COVID-19 cases crossed the 2.5 million mark recently, as researchers rush to make new findings and se", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/covid-causing-blood-clots-in-patients-docs/articleshow/75342355.cms", "urlToImage": null, "publishedAt": "2020-04-24T09:36:07Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "PTI", "title": "IIT Professor Develops Software to Detect Covid-19 Within 5 Seconds Using X-ray Scan - News18", "description": "Kamal Jain, a professor at the institute's civil engineering department, claims that the software will not only reduce testing costs but will also reduce the risk of exposure to healthcare professionals.", "url": "https://www.news18.com/news/india/iit-professor-develops-software-to-detect-covid-19-within-5-seconds-using-x-ray-scan-2590903.html", "urlToImage": null, "publishedAt": "2020-04-24T09:23:28Z", "content": "New Delhi: An IIT-Roorkee professor claims to have developed a software which can detect COVID-19 within five seconds using X-ray scan of the suspected patient.\r\nThe professor, who took over 40 days to develop the software, has filed a patent for the same and… [+2520 chars]"}, {"source": {"id": null, "name": "Selectscience.net"}, "author": "SelectScience", "title": "Pfizer, BioNTech COVID-19 vaccine cleared for human tests - SelectScience", "description": "Pfizer and BioNTech to start human trials of COVID-19 vaccine", "url": "https://www.selectscience.net/industry-news/pfizer-and-biontech-to-start-human-trials-of-covid-19-vaccine/?artID=51330", "urlToImage": null, "publishedAt": "2020-04-24T09:09:30Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Find out how technology is revolutionising COVID-19 vaccine development from years to months - Wellcome Trust", "description": "Vaccine development traditionally takes many years, even decades to be completed, this is problematic when we are trying to develop a vaccine to protect us f...", "url": "https://www.youtube.com/watch?v=YI1aLQ_XMhE", "urlToImage": null, "publishedAt": "2020-04-24T08:59:46Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Mumbai Mirror", "title": "Mumbai-based medico designs face shield from overhead projector sheets - Mumbai Mirror", "description": "When the coronavirus pandemic hit Mumbai and medical workers appeared clueless how to treat patients by ensuring their own safety, an enterprising female medical practitioner found a solution by desi", "url": "https://mumbaimirror.indiatimes.com/coronavirus/news/mumbai-based-medico-designs-face-shield-from-overhead-projector-sheets/articleshow/75346286.cms", "urlToImage": null, "publishedAt": "2020-04-24T08:58:00Z", "content": "Mumbai\r\n: When the coronavirus\r\n pandemic hit \r\nMumbai and medical workers appeared clueless how to treat patients by ensuring their own safety, an enterprising female medical practitioner found a solution by designing a face shield made out of overhead proje… [+3399 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Business Insider India", "title": "India may see second wave of COVID-19 outbreak in monsoon, say scientists - Business Insider India", "description": "By Shakoor Rather New Delhi, Apr 23 () The trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the lockdown is lifted", "url": "https://www.businessinsider.in/india/news/india-may-see-second-wave-of-covid-19-outbreak-in-monsoon-say-scientists/articleshow/75345119.cms", "urlToImage": null, "publishedAt": "2020-04-24T08:04:00Z", "content": "By Shakoor Rather New Delhi, Apr 23 () The trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the lockdown is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases du… [+6227 chars]"}, {"source": {"id": null, "name": "Latestly.com"}, "author": "Team Latestly", "title": "How to Wash Vegetables and Fruits Right Way? Dos and Don’ts to Properly Handle Groceries During the - LatestLY", "description": "Food safety experts advise against frantically washing your produce in soapy water in hopes of scrubbing away the coronavirus. If not soap, how to clean the vegetables and fruits? In this article, we bring you the dos and don’ts that you need to follow to pro…", "url": "https://www.latestly.com/lifestyle/food/how-to-wash-vegetables-and-fruits-right-way-dos-and-donts-to-properly-handle-groceries-during-the-covid-19-pandemic-1705417.html", "urlToImage": null, "publishedAt": "2020-04-24T07:44:17Z", "content": "The coronavirus scare has gripped us all. The virus is new, and there is not much information about it. Besides, with no immediate vaccine, the concern increases. We all are figuring out how to cope up with the new normal of staying home. And there is the add… [+2641 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Covid Toes among kids: New symptom of novel coronavirus infection - India Today", "description": "First some dermatologists in Italy found it. Now, it is being reported in the US. There is sudden surge in the cases similar to frostbite or pernio among kids in the areas severely affected by Covid-19. Some doctors have nicknamed it as Covid Toes.", "url": "https://www.indiatoday.in/coronavirus-outbreak/story/covid-toes-among-kids-new-symptom-of-novel-coronavirus-infection-1670462-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T06:40:08Z", "content": "Dermatologists in Europe and America are discussing a new potential symptom to identify a Covid-19 patient, particularly if the novel coronavirus has infected kids and young adults. In March, some dermatologists in Italy found an inflammation of toes and feet… [+2295 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "COVID: Max hospital group to study use of HCQ among healthcare workers - Livemint", "description": "The large-scale observational study will involve use of hydroxychloroquine prophylaxis among its healthcare workers.This is the first study involving COVID-19 that has been approved by ICMR", "url": "https://www.livemint.com/news/india/covid-max-hospital-group-to-study-use-of-hcq-among-healthcare-workers-11587698913597.html", "urlToImage": null, "publishedAt": "2020-04-24T03:56:25Z", "content": "NEW DELHI :\r\nAmid rising number of coronavirus cases in the country, a private hospital group on Thursday announced that it will conduct a large-scale observational study involving the use of hydroxychloroquine (HCQ) prophylaxis among its healthcare workers, … [+2088 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "CDC Director Clarifies Coronavirus Comments - HuffPost", "description": "President Donald Trump said Dr. Robert Redfield was misquoted about the coronavirus resurging in the fall, but the CDC director said his interview with The W...", "url": "https://www.youtube.com/watch?v=XhPtzNbO8iI", "urlToImage": null, "publishedAt": "2020-04-23T21:33:39Z", "content": "President Donald Trump said Dr. Robert Redfield was misquoted about the coronavirus resurging in the fall, but the CDC director said his interview with The Washington Post was accurate. \r\nSubscribe to HuffPost today: http://goo.gl/xW6HGSupport our work: https… [+134 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "Most NYC Virus Patients Had Underlying Health Issues, Study Shows - The Epoch Times", "description": "Most patients in New York City hospitalized with the CCP virus suffered from at least one underlying health issue, such as obesity or kidney disease.", "url": "https://www.theepochtimes.com/most-new-york-virus-patients-had-underlying-health-issue-study_3324097.html", "urlToImage": null, "publishedAt": "2020-04-23T21:17:16Z", "content": "Most patients in New York City hospitalized with the CCP virus suffered from one or more underlying health issues, such as obesity or kidney disease, according to a new study.\r\nResearchers analyzed records from 5,700 patients and found more than 56 percent su… [+3603 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "WHO warns malaria deaths in Africa could double amid pandemic - Al Jazeera English", "description": "Top health officials urge countries to ensure essential malaria prevention work continues during coronavirus pandemic.", "url": "https://www.aljazeera.com/news/2020/04/warns-malaria-deaths-africa-double-pandemic-200423182645239.html", "urlToImage": null, "publishedAt": "2020-04-23T19:32:29Z", "content": "The World Health Organisation (WHO) has warned that the number of deaths caused by malaria in sub-Saharan Africa could double to 769,000, as efforts to tackle the disease face disruptions by the coronavirus pandemic.\r\nAs of Thursday, the region had registered… [+3200 chars]"}, {"source": {"id": null, "name": "Boston25news.com"}, "author": "Debbie Lord, Cox Media Group National Content Desk", "title": "Coronavirus: Are blood clots killing COVID-19 patients? - Boston 25 News", "description": "According to reports from doctors across the country and around the world, some patients infected with the new coronavirus appear to be developing blood clots primarily in their lungs and legs.", "url": "https://www.boston25news.com/news/trending/coronavirus-are-blood-clots-killing-covid-19-patients/UAH5GS4WK5FPJFP7YUHPYT2ZIQ/", "urlToImage": null, "publishedAt": "2020-04-23T19:20:55Z", "content": "Physicians on the front line of coronavirus treatment are seeing a new and alarming symptom among patients infected with the COVID-19 virus.\r\nAccording to reports from doctors across the country and around the world, some patients infected with the new corona… [+4405 chars]"}, {"source": {"id": null, "name": "Kashmirreader.com"}, "author": "Press Trust of India", "title": "Two pet cats test positive for Covid19 in New York - Kashmir Reader", "description": "NEW YORK: Two cats in New York State have tested positive for the novel coronavirus, marking the first confirmed case of the COVID-19 infection in pets in the US, according to health authorities.\nThe US Centers for Disease Control and Prevention (CDC) and the…", "url": "https://kashmirreader.com/2020/04/24/two-pet-cats-test-positive-for-covid19-in-new-york/", "urlToImage": null, "publishedAt": "2020-04-23T19:07:00Z", "content": "NEW YORK: Two cats in New York State have tested positive for the novel coronavirus, marking the first confirmed case of the COVID-19 infection in pets in the US, according to health authorities.The US Centers for Disease Control and Prevention (CDC) and the … [+813 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "According to Researches, Filter Coffee Extends Life, Turkish Coffee Is Harmful To The Heart - Somag News", "description": "In a study conducted by the Swedish University of Gothenburg, it is stated that filter coffee is beneficial to health and can prolong life, but coffee boiled like Turkish coffee increases the risk of heart disease. The results of the research, published in th…", "url": "https://www.somagnews.com/according-researches-filter-coffee-extends-life-turkish-coffee-harmful-heart/", "urlToImage": null, "publishedAt": "2020-04-23T18:26:00Z", "content": "In a study conducted by the Swedish University of Gothenburg, it is stated that filter coffee is beneficial to health and can prolong life, but coffee boiled like Turkish coffee increases the risk of heart disease.\r\nThe results of the research, published in t… [+1203 chars]"}, {"source": {"id": null, "name": "Komonews.com"}, "author": "Denise Whitaker", "title": "New COVID-19 side effect in people under 50 - KATU", "description": "Doctors in New York say a growing number of their coronavirus patients in their 30s and 40s are suffering sudden strokes. This new side effect comes from the staff at Mt Sinai Health, after seeing blood clot in unusual ways in these younger patients who were …", "url": "http://komonews.com/news/local/new-covid-19-side-effect-in-people-under-50", "urlToImage": null, "publishedAt": "2020-04-23T18:09:00Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Blood Clots a New Surprise Side Effect in Coronavirus Patients | NBC10 Philadelphia - NBC10 Philadelphia", "description": "Doctors are noticing a new trend in COVID-19 patients in the form of blood clots. NBC10’s Matt DeLucia spoke with two local doctors about what they’re seeing...", "url": "https://www.youtube.com/watch?v=t2Bu8mqxwrg", "urlToImage": null, "publishedAt": "2020-04-23T17:56:50Z", "content": "Doctors are noticing a new trend in COVID-19 patients in the form of blood clots. NBC10s Matt DeLucia spoke with two local doctors about what theyre seeing at hospitals. \r\n_____\r\nSUBSCRIBE TO NBC10: VISIT the NBC10 channel for the latest news and exclusive re… [+437 chars]"}, {"source": {"id": null, "name": "Menshealth.com"}, "author": "Philip Ellis", "title": "Doctors Warn COVID-19 Can Cause Sudden Strokes in People Under 50 - menshealth.com", "description": "Coronavirus has been linked to blood clots in age groups previously not deemed at risk.", "url": "https://www.menshealth.com/health/a32253678/coronavirus-covid-19-sudden-stroke-young-patients/", "urlToImage": null, "publishedAt": "2020-04-23T16:34:00Z", "content": "Medics in New York City have reported that people in their 30s and 40s who were previously not deemed at-risk during the coronavirus pandemic may in fact be vulnerable to sudden strokes. COVID-19 has recently been thought to cause increased blood clotting, wh… [+1675 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Major COVID-19 study shows hypertension, obesity and diabetes to be most common underlying conditions - Firstpost", "description": "A study published in JAMA yesterday is the largest and most comprehensive look at COVID-19 health outcomes in the US so far.", "url": "https://www.firstpost.com/health/major-covid-19-study-shows-hypertension-obesity-and-diabetes-to-be-most-common-underlying-conditions-8292031.html", "urlToImage": null, "publishedAt": "2020-04-23T14:45:33Z", "content": null}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "Charles Capel", "title": "U.K. Daily Coronavirus Deaths Drop to 616, Lower for Second Day - BloombergQuint", "description": "U.K. Daily Coronavirus Deaths Drop to 616, Lower for Second Day", "url": "https://www.bloombergquint.com/onweb/u-k-daily-coronavirus-deaths-drop-to-616-lower-for-second-day", "urlToImage": null, "publishedAt": "2020-04-23T14:26:15Z", "content": ""}, {"source": {"id": "wired", "name": "Wired"}, "author": "Sara McClain", "title": "All the Approaches to Get rid of a Coronavirus (So Considerably) - Mash Viral", "description": "The race is on to come across a cure for Covid-19. Researchers are testing new vaccines, resurrecting aged medicines, and repurposing treatment plans initially designed for other disorders. Issues are shifting rapidly by the time you go through this, the pred…", "url": "https://www.wired.com/story/all-the-ways-to-kill-a-coronavirus-so-far", "urlToImage": null, "publishedAt": "2020-04-23T14:01:47Z", "content": "The race is on to come across a cure for Covid-19. Researchers are testing new vaccines, resurrecting aged medicines, and repurposing treatment plans initially designed for other disorders. Issues are shifting rapidly by the time you go through this, the pred… [+3871 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "92-year-old woman with one side of body paralysed defeats coronavirus in Pune - Times of India", "description": "PUNE: A 92-year-old Pune resident has recovered from coronavirus infection despite having suffered a stroke seven months ago which left one side of he.", "url": "https://timesofindia.indiatimes.com/city/pune/92-year-old-woman-with-one-side-of-body-paralysed-defeats-coronavirus-in-pune/articleshow/75323751.cms", "urlToImage": null, "publishedAt": "2020-04-23T13:28:43Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Theweekendleader.com"}, "author": null, "title": "Most COVID-19 patients put on ventilators in NY died Study - The Weekend Leader", "description": "Researchers have found that nearly all coronavirus (COVID-19) hospitalised patients placed on mechanical ventilators in New York's largest health system have died.\r\n\r\nFor the findings, published in the Journal of the American Medical Association, the research…", "url": "http://www.theweekendleader.com/Headlines/56986/most-covid-19-patients-put-on-ventilators-in-ny-died-study.html", "urlToImage": null, "publishedAt": "2020-04-23T11:27:49Z", "content": "Most COVID-19 patients put on ventilators in NY died: Study \r\n25-Apr-2020New York \r\n Posted\r\n 23 Apr 2020 \r\n Researchers have found that nearly all coronavirus (COVID-19) hospitalised patients placed on mechanical ventilators in New York's largest health syst… [+1812 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "COVID-19 may not be sexually transmitted: Study - Daily Pioneer", "description": "COVID-19 is unlikely to be spread through sexual transmission, according to a study that found no evidence of the novel coronavirus in the semen or testes of men.\n\nThe study, published in the journal Fertility &amp; Sterility, was not comprehensive enough to …", "url": "https://www.dailypioneer.com/2020/pioneer-health/covid-19-may-not-be-sexually-transmitted--study.html", "urlToImage": null, "publishedAt": "2020-04-23T10:08:50Z", "content": "COVID-19 is unlikely to be spread through sexual transmission, according to a study that found no evidence of the novel coronavirus in the semen or testes of men.\r\nThe study, published in the journal Fertility &amp; Sterility, was not comprehensive enough to … [+3333 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ariana Eunjung Cha", "title": "Coronavirus: 88% of Covid-19 patients on ventilators didn’t survive in New York’s hospital system, study finds - The Independent", "description": "This compares with the roughly 80 per cent of patients who died on ventilators before the pandemic, according to previous studies", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-us-new-york-hospital-ventilator-death-rate-latest-a9479411.html", "urlToImage": null, "publishedAt": "2020-04-23T09:20:00Z", "content": "Throughout March, as the pandemic gained momentum in the United States, much of the preparations focused on the breathing machines that were supposed to save everyones lives.\r\nNew York State Gov. Andrew Cuomo and President Donald Trump sparred over how many v… [+3229 chars]"}]}